{"samir.mogal.148": "Abe bahen ke Lodi har baar kya English English bol rahe hai kabhi Hindi bhi to bol Loudiii", "faathi_r": "I thought I was the only one concerned about her posture 😯", "transform_yourself_hub": "Your too cute ❤️", "giangichef": "Cooking is an amazing passion 😉👌👌", "roselin_sonia_gomes": "Why are you standing like that ??🥺", "dr07luv": "Am sure that ur mom made already u just posing 😜🤣🙏", "annupriyababu": "Why are u standing like that?", "dariobelmont": "Hola saludos que es lo que cocinas ?se ve rico que bueno que te gusta cocinar abrazos 🌹", "lplokeshpatel": "💯👏amazing💕😍😍✨💋", "maheee8383": "❤️", "mount.kh": "I", "therraposa": "Your skin is ❤️😍", "namesaresooverrated": "That stove doesn't look like it's on. Wat?", "sajjad.s.56": "super", "chetanrudra12": "Looking very tasty", "angryashwin": "In other words it's just some bread with some curry", "miss_preet__": "Natural beauty ❤️", "hardstrike77": "Awesome 👌", "shobhathakur74": "❤️", "aaradhya_xhhetri_": "😍", "ro_han3912": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "humptydumpty_02_30": "Why are you standing like this?", "dancewithpreety": "💖💖💖", "remteahrangchal": "Beauty queen..", "staypositiveandfit": "Gosh ur so gorgeous ♥️", "sandeip1424": "I think you are not that busy.. U seems like no work...", "pooja.prasanna.5": "But u can stand normally, whys r u standing so awkward? 😂", "oad_rahul__": "#oadrahul", "saimira2244": "I dont find her inspiring or beautiful or sexy nor hot ..why she is all over the media ..i do not know ..her face and persona is very funny .", "sadresadrealam": "Buddhi ghori laal lagaam", "rinkusingria": "where is my favriot अर्जुन", "cocoatease": "😍", "hiraumairr": "Please share how do you take care of your skin you re so flaw less . Please share with us so we cam look shiny this quarantine break Love 💕", "shodiiorbakhtiiorovich": "❤️👏", "fithostess_ascetic": "I like your poise while you explain", "indhumathi678": "Aiyo pai", "sankarnathsaha": "Don't post this type of cooking video at this critical time.several people are hungry.They don't have any minimum food to eat.", "aaakriti_bansal": "What's with the position of standing in every picture", "aish.144": "Without makeup u look pretty", "juveriyasaleem19": "Why dont you stand properly.. no need of a glam pose in a kitchen.. go easy girl", "prajgca": "So confused, first decide what u wanna say!", "sonampunawala": "Just can’t ignore the fact the way she’s staying 🤣", "swatisingh6268": "Mem fitness ka diet routine bataiye. Aur work out ideas bataiye plz❤️❤️❤️❤️", "briinda": "Atleast while cooking u don’t need to pop out your bum 😂", "vahishtapanthaki": "Looks yum! Used to make it for my kids when they were toddlers...", "ahmud2012": "U r not English native right can speak Hindi too", "karanvir_1920": "Ehna kee busy schedule ae tera... chipkli jahi...", "yusra_yuzi_": "You’re so talented ❤🔥 @malaikaaroraofficial", "asifpathan4796": "Without makeup you looking so beautiful mashallah", "patelrehan78": "Nice💋💋❤️❤️", "maheshkumarmj9696": "You are awesome sweety and my love life same to you", "ab_dul961": "Bahut he Aged lag rahi ho ap.", "sagiridixit": "@keepingupwithqueeng please attempt something like this", "anilmhatre0408": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "psy_patil": "I like it 😘", "agirlstravelogue": "@ashwinisriram", "gurbani_kaur2013": "Aren’t we done with posting cooking videos and food pictures yet? Just spare a thought - there are hundreds of thousands of people, specially on our side of the world starving to heath and struggling to find food even once a day if they are lucky.”", "a.k.chauhan007": "Awesome", "nayangauravmalviya": "Cook for family 🤔, teri family v hai 😆.", "rani677": "Wslm, 4cups Self raising flour 3 cups yogurt .like to share my quick dough .u can use it for pizza. Naan bread just add garlic butter wen frying .u cud mk", "prkumar3500": "Super", "_0601maya": "Hai hi aunty ...cooking vooking toh aata hi hoga ...aunty ji ko🤮😵", "rahul_nair_arts": "Love Cook...single😍🤔👍", "tanweer1978": "No work at home,,,0oo pls do sum house work ,keep busy all d tym 😏yess", "gupta_varun341": "I really like d way u cooking..", "manishgupta041188": "hellow english mam... u r indian.whenever u giving the msg ur fans please dont talk in english, talk in hindi. becoz you r not a high-class superstar and in india high class super star also talk in hindi like amitabh sir, Sachin Tendulkar", "invincible_bhuv": "It may be great for the health but never be great for soul 😾", "mahvashbukhari": "Sabzi😖", "zero000atillahan": "Yerim kız gülüşünü bu güzellik taş bebek", "shaluxshalu": "Aaj pure kapde kaise paihan liye😂😂😂😂😂😂😂🖕", "anumeet__": "Budhi tu to anrez ho gyi re😄👎👎.miss behaya🙌", "spunjabi19": "🎉", "gramhunterbaby": "Somebody tell me where to buy this same-2-same JOMO tee? Bless thy soul who replies, God 🙌", "mariabashir2626": "Teri hi kami thi", "rainadilerkhan": "You always have a sophisticated English name instead of Real Hindi name of the dish. Are you ashamed of speaking in Hindi?", "dubeymukesh745": "Madam please give me your delicious cookies ❤️", "dark._.msza": "🔥🔥🔥🔥", "ashkaanmaala": "@bawrey_naina @minii_jain Mai badi fida rehti hun inpe ajkal muje bhot pasand hai malai..(mera adha naaam inke naam me ata hai😎). Humare me bhi aisa noor ata jayei, agar hum log bhi try karei to zarur fit rehsakte ...i like her eloquence and poised nature ...", "fruitso": "@malaikaaroraofficial share recipe please all from 🇬🇧 UK lifts the spirits up.", "ammu_khn": "Her posture while cooking🤣", "eshurajpot1": "Yummy 😋😍", "faikchaudhary": "😳😳😜😜", "tejasmondal": "It was nice to see the cook", "qparvej": "Invite me also dinner🌹", "sumansharma2462": "Itna tede mede hone ki to jrurt hi ni h..", "dreams029": "How come some people look so glamorous even while making stew", "s0harab": "Stfu", "prakash__akki": "@arjunkapoor Congrats Your wife is Love Cooking and You love @malaikaaroraofficial 😍 Both of you perfect couple🙌", "serene.calm": "Please make more cooking videos Malaika ❤️", "fahimraazkhan": "Mdam khana v pose dekar hi pkaati h kya😆😆😂😂", "ghaalibaumeeruddy": "All celebrities have become chef during the quarantine😂👍💖", "timepaas.memes": "Thanks aunty", "nikhilchauhan88": "Arjun kapoor ke liye.....", "hepsimani12": "Very good nice cook😍", "rohit16o6": "Why are you standing like this! Can't you stand straight?", "mariammitra": "💖👍", "sanjevs143": "😍😍", "nehaachutiya": "Bhosdikey @arjunkapoor bas video he shoot karta raheo Iss aunty ki 😅😂🤣🤣", "lamba.manmeet": "👍", "zamanahmed755": "Buddi mam..nce 1", "shahbaaz271": "😂😂😂", "ti_games2020": "Топ", "sahil_singh96": "क्या आप लोगों को हिन्दी बोलने मे दिक्कत होती है??? ऐसा क्यो है के सभी सेलिब्रिटी या स्टार्स केवल english भाषा ही बोलते हैं, कभी- कभी ही हिन्दी बोलते हैं । हिन्दी बोलें । हिंदुस्तानी है हम!!! अपनी भाषा बोलने मे क्या दिक्कत । हमारे देश के PM श्री नरेन्द्र मोदी जी विदेशों मे अपनी मातृ भाषा का उपयोग करते हैं । 🙏 जय हिन्द🇮🇳", "_j_homies_01": "How many tip", "krishna15sharma": "Enough of dis Bollywood people bullshit.suddenly all of u dumbasses in Bollywood have found ur inner soul and peace and cooking talent and love for long chats and gossips with the family,love for nature and blah blah blah, enough u don't necessarily have to post whatever u do...now don't post a pic in the loo and say OH MY GOD!!!it's so wonderful and satisfying to shit in peace!!!just stfu plzzz for good sake", "mehidia_afrin_tania": "Try to help poor people at least at this pandemic situation instead of showoff! No one really interested what are you cooking 🙄", "unzila_aftab": "Bas kr do budhi hogai ho lekin abhi tak yeh harkaten khatam nhe hui tumhari", "indrani.joshi.587": "Hey Malla...(Malaikaji) good to see u in the kitchen ...this makes the audience feel familiar with u😁🤣🤣🤣 otherwise we wonder celebrity hardly enter their kitchens...😁😜", "akipur_london": "@rani.g15 look she also made the same malabar vegetable ishtu that I made last night.❤️ @freebird08dm 😁", "56aaux7": "Hy", "priyanka.kp89": "Shut up", "silver_meba_mawroh": "I dnt mean to be rude but its kinda weird standing like that while cooking becz it looks like your posing", "allandriagriffin": "budhiya 🤣🤣🤣🤣", "poddarom": "Itna lecture hindi me diya hota smjh ata or follow krta.. Pr.. Time west hogya..", "shabeeh.abbas.792": "😍", "whoakshayvala": "Osm yarr kiss u now again❤️", "zara.love.786": "Love kregi", "muadubai_asfia": "U look so pretty💗", "pradipjanaa": "👌👌", "padminichatterji": "Beautiful skin ❤️❤️", "sweetu_monty": "Ye kya kr rhi..gas toh jala leti", "alfredjr.2": "I love all of the Indian food, it is my preferred food over everything else", "dilkash.n": "Bhancho thak tii nii hoo aap... Pura din presentable dikan^ee k chakkar mei", "monika_pandi": "Ap bold ho...keep it up.. don't afraid society", "lindameyntmas": "My all time favourite Appams n stew😋😋😋", "pareto208": "عالی بود 🙌", "keetkamykamal": "Hi you actually look like a girl next door while cooking in kitchen . Impressive", "alipsabehera": "At least hindi me bol dete taki sare logon ko pata chal jatw", "dukeinsta10": "if its tumhari bread chori karne ki cheez hain when i given kapoor khan ahuja kumar singh punjab sindh deol Pizza top potato Tomato sauce spice your cheese veg top best than any Pizza taste should i remove than duke 💫 court my id strip bread punch roll press two peice bread fold stuff cheese corn cucumber yeast bread any loaf slice bun jail ❌ shivaji re born shree ajit bhosale mother wonder fool Quantum she have tranform Quantum power human to animals live her brain shradha your nose Malika Prakash bhosale your nose his power you are khan or nose i can end khan living nose or family by duke 💫 court", "arpita3710": "Itni overacting kyu kar rahi thi", "alir2594": "You look sad ☹️ in your last few pictures ☹️☹️☹️", "kapilmuchandi": "Watch celebs without makeup 😂😂", "_yusuf_1010_": "🍫🍫🍫🍫🍫🍫🍫🍓🍓🍓🍓🍓🍓🍓🍓🍯🍯🍯🍯🍯🍯🍯", "dhami6352": "Great 👌🤣🤣😍😍😍Malaika Super cooking 🥘", "sangeetamadal283": "Pagal hai ye", "lakra_m": "Ara aunty ab to ruk jao", "vishal.sarathe26": "Please donate some money for help poor instead of upload this video", "sureeta.sen": "How can you be so fake and artificial. Where the nation is struggling with food scarcity in the midst of this pandemic you post videos on gluten free chickpea breads and your fancy food. Go and help donate food and essentials to the lesser fortunate you snoots @malaikaaroraofficial", "adipatil1293": "U will have ds dish on ur bed with @arjunkapoor .. 😋😋", "kahnzainab": "Tum ko ek goli lagena .", "alamkatib": "Hello", "iamamaan_saifi_3": "Chup be budhiya", "vershaprasad": "Tumhare pass khane ko h to bana rahe ho. Donate for corona", "ilikesaurabh": "Aur cook kar k kisi labour ya gareeb ko kuch bhejwa dijiye ...uska photo video upload kariye to acha bhi lage", "naturaltreatment77": "Check my story 😍😍😍😍😍😍", "tantalizing.tia": "Wow these bollywood celebrities surprise me ! They are dancing , skipping , cooking and doing Tiktok videos when with so much money that can be of some good to the nation. Use your connections, power and money to make sure Indian medical team has enough supplies, make sure that the under privileged are getting food and water and good sanitising facilities. Thanks for making millions of money from the Indian public and not giving back. Share your contribution through Videos of what difference have you made during this pandemic india is going through... I and many other Indians want to see that. Post some videos of what difference you have made to india ! WAKE UP BOLLYWOOD ! Share it people", "kushalkapinky": "Des actresses look so dum whn dey pretend to do or tell things dey actually dnt knw... Guess in todays panic situation JHADU n COOKING r tending among des actor/actresses... Pls request h aap sabhi se jis kam mein aap number one ho wahi kaam kare DNT PRETEND..dnt teach how to wash hands ,cook food , or how to clean r utensils n jhadu kaise lagana (as shown by katrina)... Aap apna acting ,workouts,dance inn sab par video banakar humein entertain kare na ki ye sab kar k... Aur one more thing MALLIKA PLS USE WOODEN SPOON IN NON STUCK PAN...N NT D STEEL ONE", "vijaymaliyas": "Khana Sahi Hai jaan", "sudhirockfor": "why don't u guys eat proper indian meal😑", "desi_travller": "❤️", "pparikh2020": "https://www.instagram.com/p/B9-7XdBhhZH/?igshid=10t3pz2o1525p", "_jaiswal_sabhya": "Meko aaj pta chl rha h ki inko b khana bnana ata😂😂 taste bura ho o baat alg h😂😂", "faizal_faizu9": "Ur busy schedule 😂😂😂", "mubin_a_traveller": "@malaikaaroraofficial katrina ke page par ja kar dekho tumhara chaman chutiya katrina pr line mar rha hai", "shehnilazuhrani": "Worest lady on this planet", "abhishek__sharmaa": "Didi jaha aapne wo chickpea glutten free bread bole na mai udhar hi soch lia vada pav khake jeelega main ye nai banayega😂🙌 @malaikaaroraofficial", "sushmitamastud": "Ppl are striving for food.... Daily wage earners... Instead of taking some sort of initiative towards it.. You celeb are enjoying and showin off ur diet routine.... real fake ppl", "rushan2690": "@malaikaaroraofficial Please do not eat and share it on social media. As you are previllaged and you don't have any other worries in this global pandemic situation except for looking after your figure and cook but some of us or most of us have bigger concern during this crisis to please hamare upar raham kijiye aur Aapke cooking Ka videos bandh kar dijiye. And if you can't stop then please don't feel bad if FARAH KHAN unfollow you. Stay safe jai hind.", "wiem_saideni": "Why she's standing like that 😂😂", "star_mbd": "Old lady u need to learn u can’t use steel spoon in non sticky pot. Use wooden one", "mbhimani": "BS", "sh_ubzz_143": "Video arjun kapur nikal raha hai ky0🤨", "shivam.agnihotri.372019": "So beautiful", "sabugraphy": "Aunty Arjun kaha h ..", "aschoudharyksg": "घणी इतराई ए बाई", "sheren.k.ahmad": "شكد مكروها", "vaani.1995": "Ma'am u r so fit", "bidesh.ghosh": "Kya re budhi ek bache ko patali tu. Uska jivaan barbaad kar dya tune. Nautanki kahiki sirf style karna ata hai tujhe aur kuch kar nahi ati tujhe.", "swedishcrab": "But why are you standing so awkward... Never seen anyone so awkward cooking in kitchen... Don't try too hard to flaunt your shape 🤦", "aomkarjagdale": "Ek kaaam karo oscar lelo aap....mast acting kiya hai khana banane ka", "nehaavinashsingh": "Iske Alva agar greeb janta ke liye kuch ho ske to zrur kre jaise unhe khana phuchvana", "covid19virusvaccine": "Dear Friend, Greetings to you & your Family. We are currently experiencing an unprecedented global event. The outbreak of Coronavirus Disease 2019 (COVID-19) – now officially a pandemic – has caused apprehension globally, ultimately resulting in lockdowns, travel bans, panic buying, and financial market turmoil. How do you feel about the air you are breathing? If you are watching the news then you surely don't feel safe. You and your loved ones have to leave in an environment that is harmful to your health and theirs is many ways. Air pollution from all the cars and factories, disease and overpopulation. It's time to do something about it.. OxyBreath Pro is a new premium mask that promises to keep you protected and also a vaccine to prevent you from getting infected from harmful bacteria and microparticles that flows around the air that you breathe everyday such as corona virus. Message us for more information. Health is wealth. Share this to the world. Save lifes", "mokk.uu": "Your mom makes best food 🥘 👅❤️", "zaheen_n_jada_ali": "😍😍😍😍😍 @malaikaaroraofficial you look so cute without makeup 😘", "minniemuo": "Why are you standing as if you have something stuck up your ass @malaikaaroraofficial", "farahvshaikh": "#arjunkapoor Your kaantabai2 is already at your home😂😂😂 why u want #katrinakaif at home😂😂😂", "imsbutt": "Turn the gas on it might helps 😂", "swati.kapadia": "👌👍😋", "thalassophile_05": "Why are you standing so weirdly ? 😂", "sushi_saki": "Looks yumm! Wish you could share some recipes", "i.am.bhagirath": "I'm finding here arjun kapoor's comment🤣", "vivek_mitra": "Arjun looks ur baby , Arbaaz was much better 😂", "alighulam1815": "Love u❤❤❤❤❤❤❤❤", "tunio11": "Malaika your bbb so beautiful🔥🔥🔥🔥", "daniyalkhan0fficial": "#jugaad", "knumair": "@jawwad_khan_ is k khanay mai daalde", "sahil_sharma3_": "Bow down to you mistress🙏 I am sahil aged 21 from Delhi I am into femdom from 3 yeaera I wana submit myself to you completely ...pls consider me mam I am into thesw fetishes (just telling) ◆Humiliation ◆Punishments ◆Slapping caning whiping ◆Toilet humiliation ◆Human ashtray ◆CBT ◆Feet licking and everything my mistress wants", "biserawat": "Very nice", "vikass940": "Idiot", "muazchahduary": "❤️❤️👏", "nis.bca": "Arjun Kaha hai?????", "utsav_patel_1996": "Gas to chalu Kar", "evan.raval": "Ill try that standing pose while cooking 🔥", "dv.maru.3": "❤️", "stranger20302": "You are super cute n ageless!!!!! N mannn you are freaking fit. Tons of love!!❤️😍 But hey.. why are you standing so odd? 😳", "shehzad_jordan23": "Arbaaz bhai Ne sikhaya 💩", "a.t_bnd": "@A.t_bnd", "irmaododetejente": "👏👏👏❤️🇧🇷👍", "paul_bradley75": "What’s wrong? Ur standing odd.... could u move aside and let the maid get some appreciation.", "rajputkh55": "She is bitch of bad sex I hate her and her shameless pig Arjun.... What a couple..... Beghairat couple.. Lanti couple. A mother of young children and good wife of hand some PERSON..... why demands talaq.. When her dirty bad sex on peak for a newly young boy... Lanat dono pr... Koi Hya Koi wafa koi bachoon ka khyal koi dewar, susar saas ka khyyal koi society ka khyyal.... Lannat sex bitch and Lanti dog... Doob maroo.", "grand_most_wanted": "😂😂😂😂😂😂😂😂😂😂😂😂", "er_sajid_shaikh": "Buddhi saali", "souravpahi": "@satyasdas tell me what you see", "sanaabbasi2480": "😜", "piyushsharma.18": "@arjunkapoor kidhr hai 😂", "i.m.deepak_justin___": "Arjun ke liye bnari h 😂", "_dk_27p": "Bachhe ko pata liya", "romedynow\nVerified": "Verified", "arfaadcr7": "Arjun bartan dhone laga gandu ko", "shameem2150": "She has no attraction at all, look at her body, it seems a patient but she thinks that she is very gorgeous, Actually she is unable to understand her real attraction or figure that is totally rubbish.", "onlineincomeideasss": "Nice", "i_am_sara09": "Lot p cuit 🤣🤣 @fadil_dulmar @poo.gk11 @pooja.bissonauth @thenajladulmar", "shrivasdilip349": "Ha ok ab mt sikhao", "sahil_kirmuch_official": "Arjun Kapoor vedio bna Raha hoga pakka", "komaldahiya1493": "Making for Arjun😂😂", "apsaramakeupstudio": "What u cooking i d pan", "adwait.chachad": "Hey malaika", "hami_562": "Buddi", "akhilsbisht786": "Bakchod kahi ki", "sweetannu": "Enjoy💛💛💛💛", "shrutiinet": "That looks yumm can we get the full recipe please here , M ??? Will be highly appreciated Xx", "gopal_dewala": "Beautifull cooking", "vanrajsinh_5636": "Arjun khagaya ji", "pratibhahah": "Buddhi lagri h😂", "matteamartz": "Stand straight", "poonamnandlaskar": "Social distancing do’s and donts from 9 year old. https://youtu.be/WHo9irIDDIA", "mahvash.bukhari": "May as well cook eggs with those truffles", "thatboyarman": "Where is arjun btw", "sujanfaster": "Hope you are making something Malai ka?😉", "uxama_axad299": "Tm gori kb sy hogai hu?😂😂😂😂😂", "donkany": "How are you", "hyder2115": "Very nice", "anxonimisaqui7": "Guest off", "ridhii_memezer": "Y to show off so much on cooking", "kazims466": "Called arbaz khan to eat 😂😂😂😂😂😂", "sagarpatel_sss_": "💃👑", "jaclin_d": "Why is she standing like that?", "anilb_djt17": "Stop talking with your hand 🤚, it’s so annoying 😂😂😂", "arif7325": "Gas to on kar leti", "kuch_guftgu": "What happened to legs, kitchen mai ese koe kaha khada hota hai😂", "zakku_zakwan": "Kelthi😁", "marlenef.teixera": "👏👏", "purple_crayons64": "@malaikaaroraofficial your skin💕❤", "prince_zaiff": "Man are you fine? Why are you standing like that? Any knee or hip injury? Tc If so❤️", "narinderkaur137": "❤️", "khairnar49": "Plz Arbaaz Bhai ko kaise laga batana..??", "shaista.salmani": "many times i have seen this video ❤️i dnt knw why", "dharmenco": "In this time you can pray for all those who are no more due to corona", "sunnythakur763": "Ek time aisa aayega jab ye log hugte huye ka bhi video banake share karenge", "prashantnaikade3237": "Bhakari kha bhakari 😂😂😂😂👌", "afghan_man00": "Dirty", "hamidul023": "Tera boyfrend kaha he arjun", "nihammohsin": "Benchod khana pakane me bhi kamar teri karke pose karna h😂", "stefygupta": "Lovely ♥️", "moniiisingh": "Yrr iske hath bilkul mari padi he ye", "younilateral_03": "Is it just me who noticed that her right hand thumb does not have nail paint applied?", "hjkrishna123": "Family kon h timhare acha bada beta arjun kapoor", "hussainmdenayat": "Good", "imrandrmohd": "Very nice.", "kanupriyasingh02": "👍🏻👍🏻", "ravinapalit": "❤️", "basupam": "What happened to her back? Why can't she stand straight?🙄🙄🤣", "nanireddy69": "Fake 👌😂", "piyush_bhaisare": "@malaikaaroraofficial madam paisa donate karne ko bolo logo", "vivektiwari263": "Kyo hindi me bolne se aap choti ho jae gee kya", "arushi_jain03": "😍😍", "a2314t": "S L A G", "sriram1001": "Hi grandmaa", "momma_diva": "Gorgeous ❤️", "avengerajay": "Fitness Ka Raj Batao Ma'am", "sehrawat4683": "Buddhi", "sleep_eat_repeat__": "Monika geller 😂😂", "saima.makeup": "Yeah for sure I hate u", "aishanyachadha": "I want to taste 😍😍😍😍", "pinkesh1574": "Madam ji hindi bolne mein aap ko tax dena padta hain kya?", "tym_is_urs": "😂", "sopikulhoqe": "❤️", "akki_boss310": "😍👌👍", "jabi899": "Ab kaam Kya hai", "a80appa": "😂", "ajeka6632020": "Nice Cooking❤", "khatri.2013": "Munni ab tu sahi dikrahi hai, yahi Tera asli chehra hai .yahi krte raho ab hamesha ke liye", "escobar_writes": "Family??", "avinawkumar01": "Hw 2 b fit lyk u😍", "khushbhushahichand": "👌👌👌👌👌👌👌👌👌👌👌👌", "alisha.chhetry": "❤️", "yash_vaishnav_____": "Video khatam hone ke baad daal chawal khayegi😂😂😂✌", "ashu_8307": "So fake...", "shreepatilhond96": "Noncense thodisi sharam kar 💵💵💵💵💵", "drsad211": "U r not star or celebrity... What's ur busy schedule!!", "not_mobashshir": "Who’s shooting?", "a.muktadir": "Hey old lady ? What are you cooking ?", "ritika.s05": "Waah ghar pe denim skirt 😂😂", "evlynda8": "Wtf !!", "fariha8798": "👍", "deep_0547": "😢", "anvi_sharma69": "I'm bored 💦 anyone up for chat DM me", "vickylalwaniji": "wife ho to aisi", "sfmash101": "She looks constipated haha ease a little @malaikaaroraofficial always posing looking cute but very funny @arjunkapoor plz make her at ease..", "adilnagmaansari127gmail.com6": "Aapki mummy aapko yahi sikhaya hai hi dhokha dena apni age Ka to khyal karo", "sohail_ansari2222": "Arjun se acha to apne arbaaz sir h...", "francklin.pierre.182": "V", "shahidboomboom111": "💋💋💋💋", "bhavinn_patel": "@malaikaaroraofficial i am watching supermodel of the year and I noticed one thing why are you favoring so much to priya singh everybody can see she is not that good still you are supporting her not good its really disappointing", "rupesh.panwar.77": "Madam very sexy", "sunny.142240": "😬😬😬", "reneackerschott": "Lekker ding", "sheetal_chandel58": "Aj aagyi uad sb celebrities ko kitchen ki", "mudra_lopa_1012": "Aunty pehele khana khud banao fir yha pe natak karne aana 😂😂😂", "nirul__nnm": "Aunty y r u showing off ...", "rishabh4317": "Iska konsa bsy schedule.....gym jana aur arjun k sath ghumne k alawa..kabhi labour workers ko pucho bsy schedule kya hta h....uske bad b rat ko ja k khud ka khana banate h...", "maske886": "🔥🔥🔥", "karthik.kathi_": "I guess arjun kapoor is recording the video 😂😂", "baljit__virk__actress": "Nice", "s_a_h_i_l_patil_2004": "Without make up kitni gandi lagtiho", "jaatrapper": "Poorey kapdo mei to tum baai se b badttar dikhti ho bey !", "11thescapist": "@peoplestanding", "shafeeq_k786": "Best", "iamparasluthra": "Arjun ke ghar bhi bhej dena🤩👻", "santhu.sahu": "What is your skin care routine ma'am!?... I was constantly watching at ur skin all along the video.. U have such a beautiful skin!", "nikksess": "Why she looks 20 @anathelioness", "sujatatuli": "You look stunning ma’am", "fkkkkshit": "Gas is off bro", "fridadoingthings00": "Sidhi hoke bolna itna kyu matak ri hai @malaikaaroraofficial @beingsalmankhan @arbaazkhanofficial @seemakhan76 @maheepkapoor @amuaroraofficial @anshulakapoor", "mkiar62": "Where’s the recipe though", "a_p_r_a_j_i_t_a": "Is it Kerala style stew ? Can we have recipe.. please💕❤️", "tintu8275": "What happened to your posture?", "monikashray27": "@prabhjyotdang @amanjot_kakkar dekho meine di ye recipe ..she said herself my frd monika..ab tuh man jao mujhe achi cooking aati hai😂😂😂😂😂😂", "jatin.cs1.6": "look how old you have become", "sangita_sharmaji": "Ab kaam ni h to cook hi karna padega madamji..", "bo_bby4817": "It so hard sexy", "dineshbhai.ravat.10": "Hi👌👌👌👌👌👌👌", "sehar_theskygirl": "Masha Allah look at your skin and glow😍", "noorishah747": "Lovely 😍", "s_shailu1": "Q bechare Arjun ko fasaya", "kavita_pillai": "😘", "sameersameer9981": "Very good... malaika arora 👏👏👏👏👏👏😘😘😘", "sahil.sharma004": "Cook for that maha Vella person sitting in your home #arjunkapoor", "aarushi1035": "❤️❤️❤️", "designing_perfect_life": "Experiment free remote meditation and divine energy healing from the comfort of your home ..😇💎 Healing for any body pains, headaches, insomnia, anxiety, depression, clearing negativity or any health issues . For details please visit website or contact us. Sunny www.designingperfectlife.com", "salman_rshaikh": "Bus karo logo ki zindagi bar bad karna. Jo aapku baneta hai usku chor ke bacho ke peche padna. Zindagi bar bad karte ho. Logo ki", "ansariparwejansari": "💞💞💞🤗🤗🤗🔥🔥😍😍😍😍", "akkkkk_9999": "Hallo aunty Arjun beta kidher hai", "saaaju_ahhhmed": "🐕🐕🐃🐃🐃", "coolkarniomkar999": "home quarantine kiske ghar par arjun kapoor ya koi aur ?😂", "baljeetsidhupb03": "Love you", "chandel_chhavi": "You are social distancing or staying home.. not self isolating..", "pcshinge": "Mallika ji... Aapke fitness ka kya raj hai...", "pawansharma_93": "Apne bache ki umar ke ladke se ishq ladane wali budiya", "sharmaji_ki_ldkii": "😍", "heyitsanagha": "woohoo #vegan!! 😍", "anil7536": "Wow...malaika great cooking yumm yummy looking....😍", "khurshidoo7": "Nice", "kunu4427": "Ma'am video kisne nikala... Arjun bhai ne.. 😂😂", "himanshujoshi282": "Gas is off @malaikaaroraofficial 🤣🤣", "priya_singh_oo": "😍😍🔥🔥", "koka2o14": "😍😍😍😍", "saiyad.khan.56829": "Ok", "anoopsingh5830": "Nice mam", "kween_999": "@malaikaaroraofficial Stewwwww....my fav with puttu or idli", "ishtiaq7259": "❤️", "davood____50_50": "😂🙈🙈🙈🙈🙈❤️", "manish.vyas.94": "😘💗", "rinmawialalrin": "@malaikaaroraofficial cooking for Arhaan khan step Father .......😊😊😊", "ammu_uppal": "I love ur skin !! Gorgeous", "monika.arora.3572": "Without makeup bhi bahut beautiful ho sap😘😘😘", "ussmanrajput": "Aaj pehli baar isy pury kaproh me dekha he", "karangurav95": "❤️❤️❤️", "noorejahan95": "Q ml", "uneramdinkar": "Would is best person", "itsrisharma": "Love you Malaika for being a vegan!!😘", "stylebymuskan": "@arjunkapoor how was the taste?", "kiratkaurk": "Her skin is amazing😍😍", "patilpratik100": "Khana banate samay kon makeup karta hai didi", "md07photography": "Love nature?? than follow me ❤️", "meeuo.1": "تعالو شوفو الستوري حقي منزلة يومياتي بالاستراحة مع صديقاتي ووناسة وأشياء تفيد البنات بستوري 💗 💗 وعطني رايك 🥂", "blush_by_wajeha": "Good job budi 👵btw stay away from heat ... Suna hai heat se silicone melt ho jata hai 🙀", "a.r.alhoti": "تاني مره اوقفي كده واطبخي 🙂 @ana_bint_al_tamimi", "sohaib3079": "#follow #f4f #followme #TFLers #followforfollow #follow4follow #teamfollowback #followher #followbackteam #followhim #followall #followalways #followback #me #love #pleasefollow #follows #follower #following", "mahendrasinghdeor": "So super 👌", "fahadsheikh259": "❤️", "vi.ckey7098": "If u can", "vipulpatel131319": "You are inspiration on life bec apna life bhot utav chadav dakha life iam big fan you zindagi rahi toa mila ga ek bar talk you my farvet actoress 09038199090 I live indore iam bussnesman @malaikaaroraofficial", "rashmisudame": "Biased lady", "mohit.ishu": "❤️❤️❤️❤️😍", "__________gatsby__________": "Chechiye..😃 @malaikaaroraofficial", "niyantakorgaokar": "Will you share the recipe?", "_ll_axmed_ll_": "Gt", "thisisthejoie": "Mother and mom is the same ...", "dudhatranimisha": "Hey dear you hv ss table top stove wanttt to know the brand ......i love this table top stove", "ruhi.ranka7": "Kitna pakka ti hai re Malaika Tu", "yd_21888": "❤️", "vilasdamodare": "So sweet yr maliaka love you❤️❤️❤️", "navdeesh3594": "Gud girl", "su.nilsharma788": "Hiii old lady", "chandan_haloi_": "Yami😘😘", "shiprakapilratra": "Luv u😘😘😘", "nikesh_panchal_": "U look like Kim kardashiyan lekin sasti vali", "shakuntalaghosh1999": "❤️❤️❤️", "styleicon_india": "U also eat 👍. I always find only outside gym 😀.", "deepthi.basavaraj": "Beautiful❤️❤️", "the_red_coat_girl": "You look fab as always💖 Just one humble request. DO NOT address parents of contestants on super dancer as uncle aunty. With due respect most of them are closer to your age or some even younger to you. So though you hv maintained like a queen 👑 refrain from calling people your age uncles or aunties!!", "natchsnacks": "Those look like some yummy coconut chips on your counter 😍😍😋", "jyotsnapurswani": "❤️❤️", "sanjeevi206": "Enna cooking...", "sajid408ali": "Old look", "syedarfath_18": "It's her wish😂😂😂", "roshanyadav260": "But there is also hindi language", "crazy_ravi": "@malaikaaroraofficial My kind request to tell people of India not to come on road after 9pm as if we have won world cup. They will listen to you and this will help in a big way.", "kareenaati": "💜💜💜", "warriorslove007": "Wow...", "black_lion.9": "#stay_home follow me 😄😄", "shreyakhanna94": "Why are you posing while cooking? 🤷‍♀️", "vervevin": "Malaika, you look pretty even with no makeup 😊💕", "punjabi_nadeem": "Roz new Londa bulaya kar", "lavanya__la": "Great for the soul!!!?????😝😝😂😂 Soul ko curry ki zarurat kabse padhgayi? Soul ko toh akela chod doh🤭😅😂", "vankamanjula7": "Where is arjun😍", "singer_rafi_official": "Yummy 😋 ❤️❤️", "ashleyassumi": "You are good mother", "andie_fdez": "@malaikaaroraofficial your mum's a great cook and such a lovely down to earth person as well. She gave me some lovely tips which i use, especially these days where am brushing up on my indian cooking.", "sunny_chauhan_03": "😍", "aashi_ojhai": "😘😘", "pankajkumarrai33": "Arjun ke liye hai", "12499rohit": "😋😮", "mahesh_patel_13": "Good job bhury", "satinder6645": "Nice mam khanna bna rahe ho ap 👌👌👌", "deepakdn__": "Ghar pe make-up lagaya Karo pls", "manjittuteja": "Dua mein Yad Rakhna", "reet8245": "U r always Flawless..😘❤️", "prajapat_jack": "👌", "vinayak_ingavale": "Best translation of what she's cooking: bhat amti ani paav😅", "nature_loverqueen7844": "Old lady... u should use wooden spoon with non stick...not steel one😂", "akhunza_jaan": "🤣🤣🤣🤣🤣🤣 You are an evil and unfaithful woman 🤬🤬", "nirajan.ambani": "I am coming your home ❤️❤️❤️❤️❤️", "su.priya6906": "😍😍", "kamalaktar7": "Tera chotiya Arjun kedar hai", "mohadevissakmohammodjessus": "Damn your acting 🔥🔥🔥", "jaiveer_nishad": "Mujhe kuchh samajh Mai hi nahi aaya angrejo ko Bata Rahi ho ya India walo ko", "drafts80": "This woman is an embodiment of smartness, intellect , oomph and talent . Never fails to impress and surprise me", "bhascar": "Thanks Monika,", "basant.kori.9": "Sexy nail polish ha", "balouchghulammustafa": "❤️", "k007_munshi": "Who is she ⁉️ oh my god 🙄‼️", "_prashant_khushik": "Hindi me bat kar liya karo......", "graylinnian090": "Hello there! At blue Cash Loan, We OFFER loan to All African countries; South Africa, Namibia, Lesotho, Zambia, Zimbabwe, Swaziland, Botswana, etc. Europe, American & Asian @ 3% Interest Rate From R10,000.00 to R50 Million Loan Installment starts in 2 months after the client receives the loan. We OFFER Personal Loan. Business Loan. * Debt Consolidation. *Home Loan.*Agricultural & Investment Loan. Blacklisted Can Apply, Debt Review Can Apply. “No Credit Check” blue Cash Loan is a Registered & Authorized Loan Firm. Apply Today SEND Your Full Names * ID or Passport No. * Cell No* Loan Amount* Loan period* Bank statement To email directloan@mail.com , WhatsApp +15202002250 Blue Cash Loan Consultant", "rony_john72": "Lol malbaari🔥🔥😍😍🤘🤘", "purshotam_d": "Nice pretty looking", "md_khan1098": "Food is looking delicious❤️", "nirmal_official_888": "215", "singhanju2728": "You look awesome, n great personality...", "iampub5837": "Can you show how u made it? The soup is all ready and ur just posing and stirring it ..😂😂. Btw soup se jyaada garmi toh Arjun dega.. so u can save the effort and also the gas!!😆", "_46tiwari": "aaj kya arjun kapoor aa raha hai ya arbaaz khan ya koi teesra chalo dekhte hai", "imprakashtoyota": "@malaikaaroraofficial you cant make meal😂", "rahulraj3993": "Mam logo ke pas pase bi to ne chahiye yaha kam hi band ho gye he pase kha se aa ye ga cooking kare ge kha se🙏", "makumar8061": "Bohat weak ho aap kuch healthy khao", "vedic_way_india": "Stay safe everyone 🤞🏻", "petaindia\nVerified": "Verified", "shamshersinghshersi": "Wao", "surbhi_578943": "Don’t use stainless steel spatula in non stick pan 🙄🙄🙄🙄🙄🙄🙄🙄", "rajithanair_nj": "That's what I am doing...cooking for my family...", "subhankardaspunu": "AUNTY 😮😮", "maggy45762019": "Looks beautifull..both of u.", "vihaan_sharma_097": "randiya", "megxx__too": "So beautifull and sweet you are 🌹❤️❤️❤️", "chrissanshaan": "Hygiene comes first. Pls trim the fingernails and set a gd example. Thank you.", "sushil7526kumar": "Covid -19 ney kuch achchey kaam bhee kiyey hai????🙏🙏🙏🙏🙏🙏", "seemabartwal": "Wat a glowing skin u got❤️", "k.muthunayake": "😍😍😍😍😍", "franck_alexe": "J'aime ça bb", "parvezkhan7910": "Nice", "keeparun": "U Bollywood people are so much addicted to camera that post every scene of daily life on national pages..footage hungry nothing else.", "jatinder1662": "Looking so beautiful 😍 🌷", "anoosha_2299": "هههههههههههههخخخههه 😂🤣😂😂😂😂", "h.a_1990_": "😍😍😍", "kelly.zana": "Thank you for inspiring us love from California", "iravateeshinde": "Your mom is great cook so as may be daughter we hv already tried our hands with Joycera ma’am recipe. Thank you keep inspiring in difficult time with us", "chottadalalshab": "Madam g thoda hindi mai btaya diya kro😛", "deshmukhparimala": "Just a piece of advice from a well wisher- never use steel stirrer on a non stick pan , only wooden spatulas otherwise the pan will loose its nonstick", "hyderamin": "@arjunkapoor khaaya kya?", "ajeet.pathak.923": "क्या क्या बोल रही हो साला समझ में ही नही आता", "dpandeyme072019": "Ek item banaogi or puri duniya ko bataogi", "archanakharel": "I have been watching you since I was small and I think I look older and you are still too cute and young👌 you are a Diva!", "te.586": "👏👏👏👏👏", "katalan__": "Thalli thalli angad marikk🤣 ijj enth bidalan mole", "mannatzamy": "The way she is standing though😂", "vinodtimmanpyati": "Hiii", "ma.nsur9231": "❤️", "mina_vish": "Wow.. this is awesome!! Stay safe!! From 🇺🇸", "jinder.d25": "Why is she standing in an awkward posture? Can't imagine her standing so stiff fm start to end of the meal 🤔", "kiranjit_77": "I want some.....", "sunginostinf": "Is malabari vegetable a things ?", "iambluntqueen": "Ye gori Kaise ho gyi 😂", "rafik2164": "Good Cheff", "snoritaz": "Why are you standing like that...looks so uncomfy and.... ofcourse distracting🙈", "husain_ahmad1991": "Good to have that excuse you got to spend time with people at home", "rahilaparker": "Yummy...Chickpea bread that is something new will surely check the recipe out. You mom is an outstanding cook I follow her and her heirloom recipes are awesome. Be Safe n Healthy n positive ❤️", "pranjal_3112": "Why you can't stand straight? 😆", "ritikaramday": "Why can't you stand properly...", "r_i_y_a_601": "You are beautiful really feel jealous", "purviy_77": "👏👏", "deependra.pandey.1694": "💕😢", "mishrashireesh": "U r looking like a 25 years old girl....so natural look..amazing", "patel_yerapatel": "Who stands like that. And stirring the pot isn’t cooking.", "salujagee": "Aap Hindi mein bhi bolo na ji", "bhartisharma150": "♥️", "aryapaddy": "💖", "bijaysinghchandel196": "🤗", "saswatiest64": "You r so beautiful", "cshus321": "@malaikaaroraofficial you are amazing and I have been following you since I saw your first cover on society magzine. Please can you post that pic if you have it❤️❤️", "abhijit.kr_ka_papa1212": "Guff zayda kaam thoda hai tera", "shrutilaw": "How are u always glowing soo much", "payalsingh3048": "You are beautiful", "nysico1": "Mala with malabari recipe what", "sudesh__004": "❤️❤️❤️❤️", "tokosith": "👏👏👏👏", "kamilhaseeb87": "Bsdki randy chinaaal", "amanvir_singh07": "Making food is \"survival\" ..not constructive.", "vrushaligurjar": "Looking ♥️", "neetuarora521": "Looks more Beautiful 💓", "saif.alli.338658": "Call girl 👏", "yarosa5802": "❤️❤️", "arundev97": "Love to see you with malbari dishes ❤️", "chaudharylatyan": "Kya banra khane maj", "haaniimran": "@zarishimran is it just me or she’s actually talking like Misha in this video", "ashyashh": "White rice is not healthy Miss Malaika! It's full of bad sugar and not good for health. Try brown rice.", "baptista7440": "😆😁", "amnajatt1984": "Chutiyapa when you get a bit of cash in divorce settlements,these cunts put more attention to their meals then their family.", "idsheswangmo": "❤️", "baj_dhaliwal": "Hindi me bolte huye sharm atti he kya madm", "thegrandtijori": "Looks yummy", "swatibairagi2": "Lovely,Strong & Independent Lady👏👏", "rajatcharodi": "Aunty....", "vardhanraj7870": "👌👌I also love cooking", "urmila_petkar": "👌👏", "raju.mahender": "😢", "japu1996": "@mamatu_98", "kirtesh_meena": "Why are you standing like this? 🤔 Quite uncomfortable.", "xxal_phaxx": "Great! Now we are watching her making something we will never get a bite of 😂😅", "swamiheera": "Itne lambe NAAM WALI bread KIDHAR milti HAI????", "_being_perfect06": "🔥🔥🔥🔥", "ajay.manchanda.73": "Little bit surprised celebs like you too cook food", "gnk786": "randi", "malhar_photography83": "Look a hot .... awesomeness", "sulltan409": "👏👏👏", "neupane.milan": "Arjun will be happy", "ssharmakashyap1": "Black tea main adrak daike peo", "dadasova_nezrin": "Dirty kitchen", "karanchahal0933": "Ki bna re ho madam...", "sophia.arif": "Hunching back", "abhishek_bafna_": "Fake posing", "shashinim81": "Beautiful you💕", "saib.2001": "I kept watching all time thinking that you will share recipe for curry 😋", "sujan.ghosh.1865": "Aunty cooking for her son Arjun kapoor 😂😂😂😂😂😂", "_beingankit__": "Khtm hogyi re ab tu 😂😂", "fahimk102": "U old and Arjun Kapoor is young😂", "shravanlal.suthar": "Good", "avnish_arora": "😮👏❤️", "dathanvs5": "😍😍", "thalapathy__fan.girl": "😠😠😠😠😠😠😠😠🤮🤮😒😒😒😓😥😢😓😥😢😓", "emaankhan37": "Arjun ko bula lo yaadse aunty g", "uzmataimuri": "Can you please tell me about hand care as your age but your hands looks good. I want to know", "arpitbodhe": "Ap kitni gori hai ?😝", "arjun_reddy777777": "Hot milf mommy🔥@malaikaaroraofficial", "tnylek": "Give it to ur papi Arjun", "ravi_boranan": "Gelchodi sidhi sidhi bolni khaatto bnayo h", "gangulydevalina": "Looks yum. Please share the recipe", "d_a_r_s_h_03": "As always overacting 🙄", "usuf.quadri": "Nice .", "waibajagat": "🔥🔥🔥👏👏👏😮😮❤️❤️ delicious dish madam", "bhagyesh_chavan": "Mein aaj fir dal chawal khaunga", "pooja9876_123": "..soooo good ❤️❤️", "fahad.dz": "Camera man arjun Kapoor hoga!😂", "amitt_1512": "You are a true inspiration in this age ur looking soo beautiful & difficult to believe ur a mother of a son 😘😘 & I want face shine like u hv so what should I do? @malaikaaroraofficial ❤️", "alien_romeo": "kuch kaam nahi hai kahi aana jaana nahi hai kahi ghoomna nahi hai to cooking pasand hai kitna public ko chutiyaa banaoge", "dheeraj_kasaudhan_harry": "Please turn on the gas flame first", "being2home": "👌", "gawade6443": "Hume bhi chahiye", "aisha001345": "Take your medicine you’re not well💉 you can’t even stand properly.", "samkjain": "Looks yummy 😊", "prakashprakash3557": "Yeh ladki bahar me kam ghr me jada kapde pehanti hai 👙👙👙😘😘😘💋💋💋😋😋😋", "hipparkarmg": "Love this.....❤️", "unbridledshru": "Atleast now u can stand straight and give a normal pose", "salfulislam8986": "🐶", "jk_jio": "No yoga suit in kitchen!? :(", "mauriciorodrigues869": "❤️❤️❤️❤️❤️😍", "ayushigoenkaa": "Recipe pls", "richa300387": "Recipe please", "saera_xo": "you can cook ... how lovely ❤️💕❤️", "shahiljaan786love": "Ek Baar Khaana Kya Bana Liya Jaise Koi Yodh Jeet Liya", "bhanu4817": "She is standing as if she needs to pee asap🤣🤣", "___kunal__001": "Hi ❤️❤️🔥🔥👍", "ritu_fitnesshub": "@kirtikaaaa 😍😍", "iffrah.mukhtar": "What u r cooking ma’am", "gauravranafz": "Ronak ni chali gye breakup 💔chej he ase hoti h", "ireemashah": "Follow @ireemashah 🔥🔥🔥", "amelbasheer_1": "Malaika you look so lovely and so much younger in clothes like these.... Rather than those skimpy... Half naked... clothes which make you look older... Stay lovely and beautiful and healthy", "lalitmsing": "Good", "vikas.bahuguna": "😍😍😍😍", "kushalkumar2019": "Before corona virrus you was Always busy, 10 movie per year", "karasergiodamian": "Mi amor te amo mucho", "rakheevaswani\nVerified": "Verified", "aaliya_khan_35": "💖💖💖", "mafijul812": "Yummy food my favorite actress you 👀💗u❣❣❣❣", "vijayw1880": "One side you look at old 😱", "phutash_8": "Budi... Aapna Umar ka liyaz karo", "thorshiva": "@malaikaaroraofficial bhabhi arjun bhaiya ke liye bana rhe ho kya😍", "mahla.ent79": "Please follow me guys and see my beautiful posts 🙂❤️", "saroo_lion3090": "Arjun kaha hai🥕", "gopika_puthur": "Why she s standing like dis??", "parminder2558": "Gas ta calay ne😁😂", "cookwithtay": "Sounds so good ❤️❤️", "sutariya362": "Pls dear don't use steal spatula with nonstic pan", "sweta.singh.984": "Sorry but your gas stove is not turned on 😂", "sahil2192_": "Gas pe bna hua khana garam kiya aur bn gyi cook i love cooking...overacting ki dukaan", "a___i___z": "😘😘😘😘😘😘😘", "rajukhan8183": "Hallo ferind", "maseeha": "Plz share the recipe", "theresaandrews476": "Dont use stainless steel spoon in a nonstick pan...", "roshanisharma": "Plz share recipe", "chefmeeran": "Love the innocence!! Enjoy the meal !", "rehaan.mondal.31": "Thanks, but I, ve found already.", "rositadawlat": "Yummieeee", "devinder.tanwar.39": "Love you 2❤️❤️❤️", "supriya3839": "Dm me", "kumarpanikkar": "Arjun Kapoor you lucky", "kocherk909": "👏👏👏👏", "sumit_sam_88": "Hii malaika", "kavya_som20": "Uh are the most sensible person of Bollywood 😍", "bdllhkhldlrjny": "Beautiful ♥️👏Great 👍", "shameless_passion": "🔥🔥🙌🙌🙌🙌🙌😍😍", "sassykeets": "Looks amazing👌. Where can we find the recipe?", "jeffer1805": "🤩👏🏻👏🏻", "kirangsung123": "Beautiful ❤️", "anwar.hosaain.92": "Khana banate Waqt Bhi lagta hai hi tum ramp working kar rahe ho", "ghana_guli": "💖💖💖💖👌👌💖👌", "paras_sharma_15": "❤️❤️❤️", "laughingeyes_sid": "@miss_glamiles", "candylaventen": "Wowwwww", "fa.had9341": "@malaikaaroraofficial Tati jaisi shakal.", "vishnu_kannamballi": "#malabari #mallu #keraladish ❤️💃", "arjunk26style1": "Malabari Veg Stew...👌🏽😀 Enjoy dear fellow mallu..😉 How r u Fitness Guru 😋", "parika_samawat": "The stove is not on! 😅", "sneekpeek4": "Chickpea bread 😆😆😆Besan ka Chilla 😆😆🤣🤣", "kirandembla\nVerified": "Verified", "faiza_dahir": "❤️", "sh.ubham2909": "wa wa wa wa.......shabdh nhi he.", "sidharthan_jr": "Hey, have any connection with kerala??", "priyalika_dubey": "Peer mae factor hai kya", "ughani290": "Ugly bitch", "abhishekpathak9185": "Love you welcome Khajuraho India and", "amanjacque": "Esa lagta h ki.... foreigner ho... chutiya", "mimimoma11": "❤️❤️❤️😍🇩🇿", "agape_mellifluous": "I loved your cheeks", "they_all_call_me_bob": "👌🏼", "7_bansalbajaj": "Has nobody notice that or just me why she standing like that or she stand like that only...", "dazzling_sayu18": "🔥🔥🔥🔥", "dudewithtale": "They will die, if eat 😂", "rgupta2401": "Good. Now u may have sufficient time. Enjoy by making good, tasty,tasty food", "bharatkjoshi": "Mast", "lzab_ela": "👙🔥👙🔥", "somnath832": "Sexy slim", "urz_pretmann2106": "Bimari me v show off ki dukaan khuli hai@@ yaar iss isolation me in jaisi show off ki dukaan or cameraz k liye gym jaane wali aunties k mobile ko v isolation me rakh do plzz", "sanjaykapoor2500\nVerified": "Verified", "guulsingh": "💖🙌", "anchalrautela19": "Is sunday ko wo bulayegi magar jaane ka nahi🙌", "_online._shopping._": "★★★★★★★★★★★★★★★ Hello ladies......... Here is a good news for u ....... Fashionable dresses at cheap prices are on sale.... So don't miss it and grab now CHECK OUT MY STORY AND FOLLOW ME FOR MORE .... STUFF or check out this link :-https://myshopprime.com/sherry28/shop ★★★★★★★★★★★★★★★", "funky922420": "Chutiyapa", "cuteemalvika": "niceee👌", "meghnathi_s": "Arjun kapur ke liye bana rahi he", "kiran20.sandhu": "@charul.singhsen @antima_sen_parmar charul teri trah khadi hai yeh 😂", "pristine_pacific": "Aww... what a sweet simple kitchen for such a huge celeb. Simply beautiful. ❤", "anupama_well_wishers": "Wash your hands frequently Regularly and thoroughly clean your hands with an alcohol-based hand rub or wash them with soap and water. Why? Washing your hands with soap and water or using alcohol-based hand rub kills viruses that may be on your hands. Maintain social distancing To avoid corona virus 🙏❤ This comment only for the purpose of social awareness 🙏❤", "pankajj_la": "Hello neighbors ❤️ not the same Bldg but close by :)", "capri18daniel": "👍maling best use of the time", "thesecretblusher": "Very Good ❤️ @malaikaaroraofficial", "binal_valand": "I luv cooking Malabar veggie stew", "siraj_choudhary": "Baki sab tho thik hai, but why u standing like this ?", "_singh_an7654": "❤️❤️❤️", "ankitajollybeans": "Vegans never age🔥", "omprakash9957": "Eat healthy and be healthy", "kareena_bold": "Urr verry beautiful still u look like 30 u have amazing body and figure ♥️", "saalima.ali": "I have always tried to invest and trade (Bitcoin) binary options but all attempt seemed abortive until I met with Mr Walter @invest_with_walterbtc . I earned $40,000 in two months. He is a life saver", "rakhiarun6633": "Love ur skin", "chiran_arjun": "So u love to eat the food u cooked..😛..", "ezzitrades": "It's a stress buster as well", "khushkaria": "Mar ghare ek maharaj joyej che tu avi ja❤️", "daf_ne_868": "Malabari cheers Malaika..", "rsingh01011984": "😍😍😍", "impeccablejaat": "U r still a goddess.... 😘😘", "mushhrroom": "Wow", "aazad.thakur1": "😂😂", "helkokon": "First time full cloths🖕😂", "darshan533": "Love u hotiie", "ashmita_baidya": "Oh plz u dnt look healthy at all . So stfu n eat something . N kya kamar tut gyi hai? U dnt even knw to stand now", "meetsingh.1313": "U r my love forever baby", "real_pinku_official": "Motherhood..💪🏼", "shalu_thakur55": "Thanku so much mam......good idea cooking at home", "adonis_2021": "👍", "pradnyamore35": "Aapke face pe glow hai Woh kaise mam aap kya karti ho", "raveenataurani": "Thank you ❤️🙏🏻😘", "dharinimehta": "Gas on kar le...", "lisa62234": "❤️", "roshan2277": "😍❤️👏", "payelkirtaniya": "💗💗", "sheetal_aparaj": "Wow mala i just loves u", "yadavranveer12895": "😍😍😍@malaikaaroraofficial", "krishna_batsha": "Hot", "hussain_lakhat_": "@malaikaaroraofficial bartan me sirf chamcha ghumane ko cooking nahi kehte, jinhone ye banake diya he vese kabhi insta p live demo de do ARBAZ'S AMBASSADOR", "jhansipippari": "Looks yum 😋", "kashyap_mohit_786": "Nice work 👍", "rajeshmunsara": "🥀", "rrk1.4": "Yaha bhi pose dekar khada hona jaroori hai?", "supriyasingh300": "Wo sb to thkk h .,,bt tedii kyu khdii h didi aap .,,,humeshaa achha nii lgtaa esa pose 🙌🙌🙌", "saeed_ullah_baig": "Where is your family🤔🤔😜", "diasrohan": "❤️❤️", "sushmita.swain": "U r glowing. I love your skin🐥", "moupriyyyao2": "👏😒🤤", "kenderllamadhu": "❤️❤️❤️", "singhayush0508": "Dadi lg rhii", "madebykarima": "very simple i like this life", "dipaksuryawashi": "nice", "itimesinsta\nVerified": "Verified", "khalifa__sikandar": "❤️", "priyankagauravsood": "Ma'am hindi me boliye Plz... 🙏 ache se samj ayega kaafi logo ki💟", "nnithinlal": "❤️❤️❤️❤️", "delnazd": "Yeah u got that yummy yum........😋😋", "cookinacurry\nVerified": "Verified", "gulcharee": "I need Friend anyone ❤️❤️❤️", "jesskhan7116": "Loda mera lelo bc chinnal", "dias_sam1": "@joycearora Like mother like daughter❤❤❤", "savan_1551__": "❤️I love to eat", "boughamervictor": "Beautiful", "gulam8562": "👌", "rukhsana4485": "Nice😍", "sonam3568": "Kabhi kabhi kapde bi phan lena chaiye nhi to tumare ander virus kidhar kidhat se ghusega tumko maloom bi nhi padega aunti", "shruwa": "👌👌", "knightrider_1489": "Iski shakal dekhlo to sala pura din kharab hota hai", "unknown______soul": "♥️♥️♥️", "vinay222": "Antiji please be simple, why you doing so much showoff?", "hardik.raj.dahiya": "Waaw", "s_mishras": "Wud love to join u for lunch in Dreams", "saranshgoila\nVerified": "Verified", "alvina_awomi": "So lovely ❤️❤️❤️❤️", "akshay.chandan.96": "Mala-we saw everything you do in very unique and style way... Nice to see you in Kitchen.... Please start another show call Mala Kitchen :) :) :)", "sweetypatel1112": "So sweet dear", "k_virgo28": "U r super kool @malaikaaroraofficial 👍👍👍👍", "kingdalvij": "Yummy 😋😋😋😋", "record.killers10": "daily 1kg makeup laga kr gora ho jaao, aur face ko glow karao phir bad me diet pr gyan pelo", "aniketpandey___": "😍", "aditi_nagre": "Fuck off bitch!", "vandana_iru": "❤️❤️", "mehul_official_account": "हिन्दी नहीं आता क्या @malaikaaroraofficial", "abhi_capriquarian": "@78.komal", "coolbeansxoxo": "Its the common cold", "riteshrone20": "Wow", "sweta.bhanushali2": "Malika your skin looking beautiful", "emmyiftikhar": "The way you're standing, like seriously 🙄", "shahdk25000": "Dear Malaikaji,pls parcel me", "karthikthamalapakula": "Arjun kapoor likes you medum super couple", "_.the_bong_kush._": "Gas toh jalaya nhi..aur Khana paka rhi hai😂😂", "mahir_912": "E ha saru ho daiii 😒😒", "rahulchauhan17389": "Apko cooking bhi aati dekh kar achha lava mjhe only work out hi aata hai....@malaikaaroraofficial", "nikhildaware": "@bilalarcherofficial Man she is so nervous. Probably the first time in the kitchen 🙈", "____paayal": "Can you please follow to @just_feelings.49", "esha.khaan302": "❤️❤️❤️❤️", "baigs25402018": "Is Arjun wid you💏", "girishshebbar": "Good way to keep you busy at home", "neha_garg86": "U really admire me.", "zuber.04": "U r a good pakau .. We al know seen u in ur fake dance shows .. Commenting wit real words .. Plastic .. Aunty", "_tarabakshipage_": "Hahaha why the awkward stance!", "vanshikagupta203": "❤❤❤❤", "niranjan__changre": "Budddhiiii 😁😁😁 @malaikaaroraofficial", "kgeet82": "Hello mam...u r so sweet 😘", "sakshi_patel_07": "Wow your skin😍and those pink cheeks😘@malaikaaroraofficial", "imagesbysanj": "why are you standing like this?", "sanyax6969": "💩💩💩💩💩", "vishukhdd": "Why you are trying to show ...???", "deretrupti_112456": "Nice video", "nirul007": "Aap food bhi cocking karte ho madam", "ll_suresh_ll_vaishnav_": "👏", "vishalthefop": "Is @arjunkapoor invited..😛 @malaikaaroraofficial", "iam_altaf_": "Mam at least be normal while cooking, your fake accent and that body language 🙌", "vasiliykanchuga": "😍👏", "yoursrohit1213": "Loved the word JOMO on your tshirt. Apt at this time 👏👏", "rajveerrathore3430": "❤❤❤💕💕💕💋💋💋", "milanbhanderii": "@milanbhanderii", "tselhakey_dekhang": "👍👍😍", "vikramphadnis\nVerified": "Verified", "sammsammy8": "Ajji😂😂😂", "suresh.bhandari77": "❤️", "vwankhade": "busy😂 gym jane ke sivay konsa kam hai aap na film krte ho apko koi kam deta nhi", "raaz.kumar970": "I dont think you have cooked it, the way you are stiring it with a steel ladle, while your pan is nonstic, anyway great show though.", "mohd_danish7": "👌👌👌👌", "diva._.diaries": "Nice 🤩", "naushad8014": "Yes hoty love you 😘", "sbpatel1612": "😊", "adiii___23": "🙌🙌", "londoncannabizclub": "😊🇬🇧", "little_miss.7324": "❤️❤️", "jb___2210": "How r u aunty ?"}