{"fithunk.sumeet": "Mi", "imram_dobwal": "@arjunkapoor bhai teri choice pe proud feel krr raha hoon laadle....😍😍😍😍😍😍..@malaikaaroraofficial you're #1hot lady....god bless u both of you😍", "bulllakhan": "@arjunkapoor Ache se sex ki Goli khake chodna @malaikaaroraofficial Ko madam ji ko sex ki Goli khake isliye chodna kyu ke unki seal pehle hi @arbaazkhanofficial Ne todi huyi hai to dhyaan se agar arjoon bhai aapka khada nahi hua to tenshion mt lena @sanjaykapoor2500 Ko bula lana unke sath bhi madam ka huk barabar ataack jata hai enjoy your mam", "misbah_shaikh_13": "ohh ap apne bete my sth ghoom rhi ho ap ky hasband nh ay", "areeba.shaikh.566790": "Bhai Sy break up KR lo sharafat Sy BHT ghandi lag rhi ho Bhai ky sath", "damfuko": "@malaikaaroraofficial @arjunkapoor bete jesa ka sath romance karti ho saram nahi aati besaram log. Aur ek hai jish thali mai khaya usi thali pe thukka.. besaram log", "harshad_kapur": "It's their personal life personal matters friends lets not speak bad about them..", "bedarkarpragati": "Pehla beta hai aur isko bhi beta banaya ...he bhagwan Kya jamana aa gya ...", "ranjita.seth": "Everything is fair love and war ..What is age ? just a number..No bad comment please...Jiyo or jine do life bht choti hai..fstay Bless always....Kuch to log kahenge logo ka kaam hai kahne.....kyu k wo jalte hai..", "dr.tinagameti93": "😂😂😂", "satishksingh3006": "Malaika Aunty ka khayal rakhna bachche", "ranin2704": "😑😑", "8371sahil": "Nice Couple God bless u ☺️☺️", "mahakal___69": "Stepmom love😂😂😂😂🤣🤣🤣🤣", "dnesh5380": "Bony kapoor ka komet pado", "nisha.shah2233": "Lolzz .i just hate them now.just to fulfil fanrtcy of old women young guy in bed. Malaika evn dnt bother tht she has son nd arjun will also leave u.shame on u.shame on u", "manju.bala1234": "Jb khan se iski haws na mit payi to kapoor se kya mitegi", "i.m_nishu.nishant": "👌", "uday_solanki": "😂😂🤣🤣🤣 @prashant_chauhan1212 💥", "nitisha_94": "What !🤣", "hangma_lady": "People do think good and give priority to saifali khan and Kareena Kapoor but in the of case these two Arjun and malaika they just think negative and had done major wrong , common man let them be happy , after all its their life. God bless both.", "_ankita_0608": "You guys make a great couple.. God bless you... I know you might have given your son many life lessons and he will be happy with your new relationship ❣❣", "siddhesh.mahale.71": "Love u", "__avkarips__": "Lowri", "______1991____": "Tumare purane marad k sath posts honge na w9hi dekh raha hu", "radhey2537": "😂...😂...😂...", "kavyakharat.84199": "Ky zamana aa gaya h aaj kal😡😡isska toh style h aaj yeh kal wo aisa😡😡😡", "tunakant": "Kisi ki wife.. Kisi bocho ki Maa.. Hone ki baat.. Kisi or ledka ki sath is Tarah ka post deke.. Aap log society me Kya message Dena chahate ho.... Is Tarah ka kaam karke v aap log superstar hai.. Ghanta sala.. ..", "ig_lagdaop": "Arbaaz Khan ki wife chor", "bhatmeera": "Feel happy for both , beautiful couple,may they always be happy", "bapodraranjeet": "Abe Arjun ye chali budhi hhe is K sakar me mat pad", "gautami_sane_": "If her husband can date someone who's 29 years old, why can't she? Why is everyone asking her to be ashamed? \"aRjUn Ko FaSaYA\" my god! They're two grown adults who can do whatever they want.", "ritesh_ratan": "And these people are ideal of today's generation.", "jayshrpatil": "Mhatari", "harisom91249": "hot romance", "___blackstone___": "Aunty bivi😂😂😂", "mohammad_navil": "😂", "cuty_apekshya_123": "Kharap nahin lagta", "amit_kumar_1988": "Disgusting..", "dsjjsnakk": "😢😢😢😢", "polpol499": "❤️❤️", "xzin_knzo": "Smlss", "mahendrayadav864": "Right mam", "sufi__shaikh": "Bhai tuje kahi kaa nahi chodega 😅", "__strange_beast": "Anuty with son 😂😂😂😂", "abikh_an": "Love birds 🐦", "shahid__munshi": "bhai ka dil dhokhaya tune bcc🤣😂", "aamersalahuddin": "Ye malaika ka beta itna mota kab hogaya", "sun.kap23": "Aunty ji ka baby", "kashy143": "Pedophile aunt 😂", "monikasachintyagi": "Sherm nahi aati na tumko bilkul bhi", "ak8829808": "You both are perfect", "lpdancer25": "🖕🖕", "dazz_jd": "arjun jaisa ghtiya actor ko aunty hi milega...😋", "a.aziz__alnoaimi": "Arjun he sem father he brok u home u son brok hard u only u think about u life no think about u son life", "ankitrathoreji": "Isne salman ki bhabi set krli hats off😁", "nabilambella": "@sumaiya_nasir", "pradeep_1524": "Grandma and grandpa u both looking stunning....hope grandma live long years @malaikaaroraofficial @arjunkapoor @neetu54 @rishikapoorofficial @anilskapoor @sridevi.boney.kapoor @iifa", "ishaz990": "Budhi", "hussna.143": "@must.amiri1", "nado_kol": "@hana_kurtun", "makeupbysabrinnaa": "he’s got wrinkly vagege", "sailor7025": "Aunty ka maja he kuch or h 😍", "yanubaja": "i know you have a big heart thats y u'r not fear to society..I love you n live hppy", "attitudekillersaqib": "Arjun right now Main to supermen Salman ki bhabhi ka fan", "neelimamishra_official": "Waaahhhh 😁😁😁", "arunkhajuria420": "Best ever couple @malaikaaroraofficial & @arjunkapoor", "danish_aman_92": "Salman Bhai say panga bhot hard bhot hard💪💪💪", "yogesh_bhorwanshi48": "😂", "mehek_irani": "😠😡", "ankit_ruhela_modinagar": "Nice", "kumarakshay.007": "Malaika aunty with Arjun", "branded_shoe_watch_collection": "Sup😍", "write_be_happy_": "They r living their life and happy and just people who r jealous r barking this that bs, no 1 lived her life no 1 would come in front to ask her if she was sad or crying or miserable in her marriage , just because she was married no 1 cared if she would cry behind closed doors but if she got out of a marriage and trying to live a normal life for once dogs r starting to bark", "vinay.duggal": "What your kids think about you..just wonder..", "vsl_rai": "This shows how @arjunkapoor Badly likes milfs. 😂😂", "yuthi37": "Bitch, rot in hell for eternal 😊😊 Satan's child", "hasan8lfc": "2 bitches from 2 different generation. One needed MILF & one needed Young power. Whn the both is over they will separete. How bitchch are Malaika. And i say lots about a 'Gay Kapoor'", "saltychocolate_._": "@__sakshi_vishwakarma apne shadi ka kharcha kudh karegi, khudh kamati hain , tumhare tarah baap k paiso se phone nehi chalati 😂😂", "maira_morrish": "Seriously married you both look stunning together no matter what people think kuch toh log kahengey logo ka kaam h kahna 🤣❤️", "kalyank135": "Enjoy with it", "chandra_bkr.12": ".", "little_miss_sammy__": "Cant wait for your marriage !! Get married and make haters burn ! 😁", "tejas9893": "Are baba ye India hai, ye tumhra Europe nahi, Europe me chalta hai kisi k bhi sth ghumna", "rahulsingh___rathod": "Me toh super man Salman ka fan😂", "shubhammamgai": "@arbaazkhanofficial Bhai Salman Bhai ko kehke iska career barbad karwa do 😂", "nanireddy25": "Malaika aunty he is your small brother ahh aunty you already got married Nd had children’s aunty don’t think with dirty mind aunty", "being_tarik_khan": "Nyc pic @malaikaaroraofficial mem 👌👌👌👌👌❤️❤️❤️❤️", "nehalkatta10": "Overrated actor everrr", "aaaa_9981": "Very naic", "shobhit_singh31": "Pyaar andha hota hai😁😁", "sakshi__vishwakarma_": "Maa bete ka shadi ka intezar", "maheboob.i": "Bache ko phasa di😜😜", "jasdhanjal11": "Love? Lol.😂😂😂😂", "leenabhushannnnnn": "Hawsi orat, kankal, hadio ka dhacha apni hawass chey bus jawan londey fass rhe h Iss Umar main Tere apne londey se bus 10 saal he bada hoga yehe besharam orat", "hardy_singh00": "Fuck boy 😂😂", "gqtenzin": "♥️♥️♥️", "jennythehag90": "Indian men are disgusting they can't see an Indian woman move on 🖕🏽🖕🏽but they can remarry/date as much they like with women way younger!!! butt hurt desi's 😂😂😂 get use to cause Indian women are making progress we are not going to succumb to your ideology of we can be!!!", "niks_special": "Lusty girl kitno k sath kregi aunty😂", "vivek570": "Abey chutiyo agar koE budha Kisi choti ladki say pyar krta ha tab to kuch nhi bolte ho. Saley ZAHIL choti soch walooo🖕", "name_is_singh_saab": "Is gadhe ko le liya ab.", "adam_8547": "Leave him aunty.", "markanda92": "Wish all the best en👏joy malika we sport you lost", "virbhadrasinghrana": "Chichore nalle kahi k 😂😂😂😂", "jamyk__": "Where is your original husband😂😁", "__sunam__": "Adorbs❤️✨", "pankumar3459": "Aunty", "imrankhan741493": "Aurjun ki maa se do ya tin den choti hogi ye", "poshakdavinderdeepa": "@malaikaaroraofficial shame on a women like you! @arjunkapoor you had a step mother you never liked. Now you are ready to be the step father. How come people like you exist? Garbage relationship of needs!", "merimitgrg": "Cute couple 💞💕💖😍", "chitramenghar2": "Lovely ❤", "supi_debnath": "Its like Eternity.. He holds u soo strong n close.. Stay Blessed n happy .. Both of U", "amrtsekhon": "Dono fuddu", "deeprana05": "Who the hell are these people who are commenting someone about their personal life..It's their life.. they should enjoy. Nobody is asking about your judgement. #cheapbugger", "_palya_2002_": "🙌🏿", "subham_dolai": "this boy know bhabi is better than wife 😂", "gul_aleee": "Ary abaz ko Kya jalega sab sy phaly tho arbaz NY he lyy Lee na iskii ...", "sudeshdesha": "Perfect coppels🔥👌", "purnima.18": "Arjun aapko dhoka de rha", "miss__raizadaa": "Mind on ur buisness", "aakibhasan05": "@malaikaaroraofficial full maje maar rahi", "garuu22nd": "Always stay blessed both of you... Lv u lot", "ak9348019": "Aap ek lalka honai ka baad talak kiyo li ha", "tut.payni": "Shame on you Malaika, spoiling others life for your own good", "nipunscorp": "Arjun Kapoor - the milf hunter!!", "faisal_shah_21": "😄😄", "februarygirl_sozu": "You didn't talk to Sri devi jee for she was your second mom and now what about you... You are dating someone's mon and someone's wife, i dont respect you at all Arjun Kapoor over weight sandh", "1615_raj": "Ha ha chutiya jodi", "vaibhav_8885": "Arbaz khan ko jala re.", "rizwana792": "Beautiful couple 🔥🔥🔥🔥🔥", "kareena4645": "Arbaaz Khan Malaika Arora best jodi in Bollywood.. Arjun Kapoor 👎👎👎👎", "abhishekhimmatsingka": "Spoiling Indian culture..shame on you", "mietesofficial": "Hot couple 💏", "sonali_singh_sandhu_annu": "Beautiful couple👌👌", "atwalshivdeep": "🔥", "kpnaaaaa": "Aunty and her nephew😂😂😂😂", "shaizznaz": "@malaikaaroraofficial @arjunkapoor arjun ko bhi patla kero kitna mota hai 🤣🤣", "toqeer.sukhera.16": "👍👍😊", "one_fitness_freak": "Wanted to follow u but cant follow u bcoz i saw ur pic with arjun kapooor 🤣if no pic with him damn sure i follow u nw this👉👎👎👎", "keceyzoom": "Aaj salman ki family ne support kiya na hota to ye ourat kab industries ma gum ho gayi hoti.......bollywood me 50 ki age me bhi kaam pana wo bhi ladkiyo k liye jyada hi muskil hai...or is budhi ne wahi family ko betray kiya......shameless woman👎👎🤮🤮🤮", "manojrishit9": "Nice pair", "thehumoroushuman": "I don't understand what problem Indian people have with a girl falling in love with a younger man and no problem the other way round?", "kabirgurjarofficial": "कुछ तो लोग कहेंगे लोगों का काम है कहना", "silent_killer_07k": "My @malaikaaroraofficial mom with my dad @arjunkapoor ❤️❤️", "pradiptakumarpaikaray": "3saal se jyada tumara sadi nanhi tikega", "_____usf_____": "Seriously baacha lagraha Arjun malaika ke samne kya ch***** hai😂😂😂😂😂", "umarsiddique1986": "Love is blind,and she is blinded,", "kathakali_mandal": "I love this bond. ❤️", "d_diary14562": "Pyar andha hi hota he..jb pyar ka parwaan utrega to bond wond sb bhad me jayega..jo log ek khubsurat se rishte ko nibha Nhi pate itne saalo ka rishta tor dete he unko kya khak love samjh aata hoga", "venky7509": "She looks like your mother", "imcarnagemate": "😂😂", "ratulpranchal": "😂😂", "being_human1020": "Thy hv been talkn abt ths the hol night bfo it got postd 🤣🤣🤣🤣🤣 boney uncle where r u ? @arjunkapoor malaika dadi ma 😅😅😅sorry dadi", "mimi.sayani": "I don't like Malika nor Arjun but yeha ki comment dekh ke samaj ati hai Abhi bhi log kitne jada uneducated and soch Kitna ghatiya hai", "prithvi_sangale2197": "Ye topi wala kiska baccha leke ghum rhi 😂😂😂😂", "yashla": "So happy for both of u ❤️ @arjunkapoor @malaikaaroraofficial", "vishalyadav6947": "My favourite Arjun bhaiya", "1piyush22": "Me39", "shaksujita": "Kya zamana aa gaya hai.. Ek buddhi se shaadi karne wala hai ☹️", "the__siidhu": "Fudu aw aah Kapoor aaunty te fida ho gaya", "iamco_mic": "Bhai birthday pr to de hogi bhabhi ne", "rajsarpanch03": "Happy Birthday", "santoshchoudhary8748": "Bahut nice joodi hai too like thoko ☜☆☞\\(-ㅂ-)/ ♥ ♥ ♥", "patiya231": "Just to bring the body hit down. good choice grandma. who is better ? arbaz or arjun?", "pldtsn": "Arjun jarila saap ko Salman ne duth pilaya", "nazi_malik_awan": "Bohot acha lag raha hain ap dono sat mein ❤️", "rehanzadi0099": "It's a world how can a married woman fall in love again with a ugly boy", "kashif1arbab": "Mom and son 😂", "reyanshvibes": "😂😂😂", "phatalegayatripramod": "Happy birthday aunty", "deona_lewiis": "Wtf", "hammadsiddique2628": "Bache k pi che padgai hai", "khan1098": "🔥🔥🔥L", "mantesh203": "❤️❤️❤️❤️💋🔥🔥👌👌", "asma_balooshi": "irritating women😂😂😂", "irfan_rubia": "Y some people r commenting about their relationship.....did these guys asked from u people that what they should do n what not ......🙄", "anjupadol": "Irritating ....😠😠", "koubru_king": "👍", "parikatariya9": "Omg yar public me Sb sand mat karo hamare bache bigad jayenge plz", "blackrose_______2003.z": "🌹🌹🌹🌹", "prehaan_vlogs": "😍👌", "simrandhillon_32": "sharm hi nai aundi loka nu tere bete ki umar ka hai 🤣🤣 tu fr apne bete ki zindgi khrab kr rehi a itni agg paise de ke ladko bola liyea karo kisi ki zindgi toh na khrab karo aj m sochta hu arjun ne apni maa se kuch ni seekha acha hi hoya us ke sath jis ki aulaad arjun jaisi a usko dup ke mar jna chiya eh 50 sal budia 🤣🤣 ab jwanni sha rehi hai 🤣🤣 @arjunkapoor @malaikaaroraofficial", "junaidmrz": "🔥Meri nazar me chutiya h Arjun🤣", "charming_varun": "Arjun ne knsa sasta Nasha kea tha 😂🤣 ldki nhi mil rhi thi kya koi .... Baap Umar se half wife laaya ...beta opposite aanty le aaya ....", "_faaiiii": "@samz_shb @ohfxbulous", "prianca9999": "Being the only son, now he is marrying someone who won't be able to give him a child 😥", "david07508": "Arjun isko use karke chodne wla he", "smita010791": "Age gape doesn't matter... Love matters", "premkumar4397": "Cute couple", "shabbirmaliksrm": "Honeymoon", "lhaa_zom": "I really ship your bond with your son 😂😂😂😂😂🖕", "mona.pieters": "He is sooooo fat", "wasim_khan_2": "Nice sister and brother 😂😂", "_pipilika_": "People are so jealous lol. Malaika is 45 and Arjun is 35, it’s a very decent gap. they look fab they are happy together!! People who are burning inside they truly have pathetic life.", "sheikh_mim": "Maa beta🤣", "santoshyadav_2_0_2_0": "Cuthiya He sala arjun", "deepika_mishra06": "Aunty and son", "whoismehulsain": "Maje hi Bc chutiye ke hai", "vishnu_saiesh": "Call him little brother😂", "saaniyajackson": "Why people hate so much ..when everyone say love has no age bar then why so judgemental they are Happy with Each other have some guts to prove the odds wrong💖", "aamil_dalla_royal": "@psycho_engineer_ 🤣🤣🤣🤣padho pura comment ko haasss hasss ke thak jaoge pura desh khali baitha hai dusro ko decision dene k liye 🤣🤣🤣🤣🤣", "tenzin_zordan_591": "Karena ka show meh dono ek dusre ko sahi sabit kar raha tha...shameless people..", "_zeeeeeeexo": "@i_am_khantastic wait what", "ravina_thakur_": "Guys its their life whatever they feel good for their future they have the right to do that ...you guys should not comment about their personal life 👍", "koushikichaudhuri": "Disgusting comments ! I think most people who have posted these comments are either jobless or incapable of finding a companion for themselves", "abzz_tahiid": "Fucking bitch Randi ha sali sharam kar old enough to be the fat ugly arjun Kapoor mother shame on u", "official_ranjit_shergill": "Gr8", "parisa_epilasiun.kaj_": "Betrayal of work🤬", "gaurav_patnaikk": "🤣🤣🤣🤣", "disciple.civils": "The People who are judging them behind the keyboards are the ones secretly wishing to have the kind of courage these two have, the guts and glory to show who they love and cherish , when men and women break under the pressure of awkward stereotypes and living the life of someone else's choice. These two people dealt with their own storms keeping calm and came out with grace.If you can't celebrate in their happiness, rather not showcase your envy by writing bad about them or saying hurtful things.Peace Out. @malaikaaroraofficial u go gurl, keep honouring the goddess within , u are inspiring tonnes of young minds.", "minakshimehra77": "👌❤️😍", "supinder_vding_offical": "Happy birthday Arjun", "naikharsh08": "paradise island resort and spa ... Maldives", "bhagyashrisolankigoyal": "Arjun ki aunty", "parwez_5470": "❤️", "kinemagar": "I am very young boy will you marry me babe😁😂", "bhumiluxuryresort": "@gulnaaz_m babee💝", "shaitan_sahil": "Tera baap jo kara tune bhi wahi kiya", "angelhasiq": "But why 😭", "ahmed.zulfiquar": "😍🔥 hot couple", "advik_ashishkumar": "Buddhi luvs👙", "zin_dxb": "This is maldive", "1996_2011_2021": "Aunty and her son 😝", "g.sihag": "❤️❤️❤️❤️", "gersha1234": "Is he your son?!", "kayshyap_044": "Tumar bhaiti Homan hei2", "raja.n114": "Nice place", "kun_naal": "NICE COUPLE", "datta4747": "Happy bharthday arjun", "f_a_gazzaliy": "LoL yr ,, can you digggg her suckkka", "bolly_edite": "Iam sorry for you 🤲 #corrupt 🙄", "rn_haso__7": "Arjun ka mom lagdi hai 😂😂", "commando_mir_basith_ali": "Desi version of nick jonas&priyanka chopra", "afzalkhan3272": "Isko bhi jld chodegi inshaallah", "amey_ooo": "❤️❤️❤️", "zeestar2018": "♥️♥️♥️♥️", "me2kt2": "@malaikaaroraofficial i bet you will not marry him nor he will 🤣🤣🤣 but time pass to be in news @arjunkapoor #milf#slutshaming", "imranhussain8659": "Maldives solid jagha hai", "tanu_jatt": "Happy birthday @malaikaaroraofficial and arjun enjoy ur life ........ U both r my favorite star😍😍😍😍😍😍😍😍😍😍", "aashish.kapoor78": "🙌🙌🙌🙌", "shivamshekharshrivastava": "Cute couple", "a_o_n_e_1_0": "Sons f..... King", "ganapatipolaki": "I m so happy u both diclosed it...it will become a new example", "ggyyuukkzz": "Buddddi", "harjotsinghofficial2": "Arjun Kapoor hated Sridevi his entire life because she thought he ruined his family, he felt sad for his mom. And now, he has done the same with Khan family. Just thinking how arbaz and maliaka's son would be feeling.", "im.raashi": "❤️", "dharmadhikariganeshm": "Bail", "manozpoon": "@devin_pun", "i.shahidkhan5976": "Jis thali me khaya usi me chhed kiya arjun or malaika tune...bhai bhai kar k salman bhai ki bhabhi se hi muh maar liya kutta h tu to", "darshanrajvir": "lust aur bekari ka perfect combination👏", "asad.amin.98284": "Arjun flop actor 😂😂😂😂", "luckyrandhawa35": "🖕🖕", "zohakazim": "@ferrwashahid when did they go official?", "nauman.47": "U r too ollllllllldddddd for @arjunkapoor live him to live his life and watch over children", "dil_de_khwab": "Just give him everything he wants nd Be happy always Mam @malaikaaroraofficial @arjunkapoor ❤️🥰🥰", "lesdso": "Old Lady and the Pig living off Khan Money", "ukashabalouch": "Niceee", "cristi.s7": "Should spend life with someone with whom we find happiness", "darshan.mhatre.2304": "@11", "iam_mughal1": "Mom son love ❤️", "ayan7399": "Stunning gorgeous beauty", "gujar_rashmi20_20": "😍😍😍😍@malaikaaroraofficial", "official_krishna._": "Yrr ap ye glt kr rhe ho😡", "samimkhan761": "Son with mother 😎", "megha.badal": "❤️❤️❤️❤️", "siddharthdedhia": "@abhishekmoorjani Kya bhai bday pe bulaya bhi nai", "abhijit_sangwan": "@arbaazkhanofficial dekh lo bhaisahab!!!", "iam__akshit": "@arbaazkhanofficial bhai dekhlo!", "1111rajat": "both r flop", "_good_vibes_7_": "Budhee 😂", "tp43624": "Mstt men 👌 u r best💓💓👌😘", "thevvvbrand": "❤️", "nik_addicted": "Braziers will hire them in the category of fucking my sons best friend 😂😂", "vasu.behl.122": "Salman bhai tera gand fad denga", "aditya.9758": "Chup kar dramebaaz", "usersnotfoundx": "❤️❤️", "yomdoatung": "Nice couple", "thisisnaku": "@itsme_samaan 🤓🧐", "meema5260": "حرام عليك يا مجنون", "vinodsinghr11": "Arjun pagal hai", "karanmaan138": "Gift mai gand marri hoggi", "mannamohit": "Maa bete ka pyaar 😂😂", "faraz_yt0": "😂😂😂", "ravidhiman31": "Hello mam", "angelkr245": "Apne bachche toh sambhaal ni payi sahi tarah isse kya sambhalegi buddi aunty", "jaideepmukhee": "Ek over age hai ot ek over weight hai 😁 😁 😁 perfect couple 👫", "iamminishaaa": "❤❤", "zia_rauf": "Aunty apne Bachy ky sath acha lag rha hy", "jetumakcha": "Randi hai tu", "fukreyzstore": "Follow our website for attractive customized t shirt at rs 249", "m.kamranshahid": "Aunties aaj kal bachey phasa rahe hain hahaha kia zamana agaya 😁😁😁😁. Arjun ki maa ki age ki tou hogi na @malaikaaroraofficial", "josna_203_anna": "Happy birthday Arjun kappor have a super blessed year", "mahlia710": "👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "itsjustsizen": "😍😍", "anj_aks": "Ghapa ghap hora hai...🤫🤫🤫", "voguesmitten": "✨✨", "fabulousfarhan19": "Ma aur beta ki love story", "sweetysisodia3131": "Saram kr MA Lagti he Arjun ki", "the_mom_glaze": "💖💖💖💖", "iamcharu_moon": "Arbaaz ka kaat diya", "hiteshmodi33": "Happy birthday boss", "ysd_abhi.ps": "@malaikaaroraofficial Besharam aurat", "manojkumar_7927": "Nice pair....all d best ..😍", "baljeet.singh94": "Very nice", "ziza_om96": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "sksarekali": "Buri dube mor tui..", "dushyant_bhardwaj___3___": "@malaikaaroraofficial dhoka arbaz k sth😂😂😂", "arsim915": "You both look awesome wish you both happy future👏👏👏👏", "alvi2122": "Ye sab thik nhi mem", "ma.ndeep1247": "SAB MOH MAAYAA HAI ... BCCHAAA... INN PYAAR KRNE VALE PANCHIYO KO KUCH MATT KAHO..... YE TO SAKSHAAT PYAAR KI MURAT HAI......... hahahaha.... arey bhai sab ki apni life hai ...jo jaise merzi kare.... hum log apas mei comments kr kr k kyo ulazh rahe hai....? Jo log insta ya fb pe gyaan dete hai vo log real lyf mei ghnta nhi bjaa sakte....so coooooollll raho... jio and jine do", "dipti.chougule89": "BuddHi ghodi tez lagam... Kya baat", "nazia.hossain11": "@malaikaaroraofficial ma aur beta", "s.angel1992": "He grew up masturbating to you now he is actually dicking you down .... wow dreams do come true @malaikaaroraofficial", "eurusn": "Who's dick is bigger ? Arbaaz or Arjun ?", "dr.lakhyapratim": "😍Hbd arjun", "aqibninty": "Tujy Arjun use kry ga Phir chor dai ga malaikaarora", "mukhiayasho": "Happy birthday arjun Toda saram karo madam ji apka beta ka umar hai arjun kapoor apko or arbaz ka jodi hi acha dhekta hai", "monu_sharma_bhojvada": "nice", "_kunal._thakur": "Arjun Kapoor urf apke badee bete ki taaraf see shukriya mummy😘", "kung_pangkam": "Shameless dirty people", "rashidkhanfansclub": "Enjoy the comments 🤗😂", "sk3394": "Celebrities ke liye izzat koi matter nahi karti. Chahe Boyfriend baap ki umar ka ho ya bete ki umar ka. Ya girlfriend beti Ki umar Ki ho ya maa ke umar ki. They are just showing we are in love😂", "sonamongmu.bhutia": "😍", "al.71_": "FOLLOW ME FOR COMMENTS!!", "armin7921": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "filleseul_123": "Both are shameless", "sanskaari_af_": "follow me", "dr._dude5871": "Aunties & bhabhis are more milky", "shubhamsinghsawai": "Malaika aunty with a mallu aunty", "nehamalik7765": "Ye kuttye old ke shaat mat rho", "deepa_mukkatira": "😢", "kantakkaushik": "No matter what you are in this worldly thing... Important is connection between to soul", "mr.aaru25": "Happy Bday Buffalo..", "majeez_p": "🤬🤬🤬🤬 age over mom 🤮🤮🤮", "imjay72": "@kelseyelliott_1 she is Malaika Arora and she is girlfriend of Arjuna Kapoor! There love life has been very complicated and not easy at all.. but finally they made it together. I hope couple is happy and having great life :)", "sparkling_lace7": "It's nice to see you with your bf @arjunkapoor . Kabhi galti se apne son K sath bhi picture click karke post Karo. Ain't you proud to be a mother of your son? @malaikaaroraofficial", "sarvesh_kr9": "The real definition of #Haramkhor @arjunkapoor 😂😂😂😂", "beingsamkhan_": "Aab chutiya ka bhi b day hai", "sanket5164": "2014 से जब से मोदी सरकार आयी है तबसे अरोरा जी भी बदल गयी है । देश बदल रहा है सच मैं :-D", "sanketwwww": "❤️❤️", "subhajit__roy__": "❤️", "last_character": "When u see her and think about tonight and she is about her last night", "whilk_misky": "All the dogs will keep barking at you malaika, but don't mind these street dogs, just keep ignoring them and live your amazing life 💕 much support to your love", "gsm_k_stuart_little": "Mubarak ho #rss walo #aunty ki ghar wapsi ho gyi", "x__dramatic__x": "Love birds @arjunkapoor @malaikaaroraofficial", "tamanaa.kh": "@salmamardan its officiel now", "rohit_02.25": "Budii sherni but jawani km ni hue h av v", "reddymaheshaa": "Beta kaha hai mammi 😂", "jakariak1": "Aunty lover😂😂😂😂", "smruti_maji": "Arjun k baad se increase hua hai re 😕😕", "megaurav9": "Arjun kya dekh rha hai 😂😂🙄", "hinacutiepie7": "Yeh apka yandhar ha...", "shergill.ranvir": "Is that your son ms Arora?", "hamzasheikh1067": "Malaikaaaa bobsss😘😍🔥", "aryan_xxd": "Wtf", "saurabh__official13": "Namak haram😂😂", "bollywoodviralvilla": "Carry on bcz Everytime Mens aren't the Bodyguard sometimes a Man needs a Women who can fight for him. And if she is elder then it's always good. I support it.", "priyareddyminki": "Happy birthday beta bolo madam", "sahilrawat_o7": "Happy birthday sir 💗🎂", "princess.pihu__": "Kesa lgra h divorce le k 😹", "pavanjatt_": "Ki & ka", "bhusari_suyog_": "❤️", "poojahanda0412019": "Malika ka arjun 👍", "suyashjadhav___": "I'mma supper man Salman da fan he proved it right", "ankur_thakur_0007": "Saala chutiya", "shahkashif7": "Wat a joke", "akram_2064": "Mallaika unty you look like mother of Arjun kapur😂😂😂😂", "shekharahire2": "😍", "twisha_sharma99": "❤️", "aghori_baba29": "Astrologer Pawan Sharma is world famous astrologer. Specialist in -Love problems solutions -Marriage problem -Financial problem -Business problem -Child problem -Career Soultions -Vashikaran Mantra for love -Vashikaran Specialist -Husband wife Disputues -Free Astrology Predictions -Kaal Sharp Dosh -Janampatri -Manglik Dosh -Pitra Dosh -Shani Sade Sati -Planet & Disease For more information contact me on +91 9602158812", "atul.deshmukh.376": "❤️", "pauleazy24": "Have a shame", "insane_lovelesh": "Salman fan be like 😂😂😂😂😂😂😂😂", "faiqhaider007": "Arjun ky liya yahi bachi thi😂😂😂", "m_kaur2010": "Both look beautiful ignore the haters have wonderful life together 👌🏻❤️❤️❤️", "noorcute9": "@tt-----ti104", "shahid_kapoor125": "Bcccccccccccccccccccccccccccccccv", "sab.sahi.hai_": "😍😍😍", "fob_xd": "@imranlaf", "solace0925": "He has mommy issues!!! Unfortunately!!", "pranaykumarrajput4": "Malaika aunty apne bhaii ke sath", "juhaifajuhani": "💖💖💖", "kishor__v_": "plz koi naa kehna maa bete ka pyar disgusting😜😜😜", "iam.asif7": "Bache ke sath anuty😆", "ritaafsd": "😍😍😍", "mzm_zrgr4": "Maa n beta😂🔥", "nishu_pakhi": "😍", "blade_of_horus": "Onko Maastor", "donzeldonn": "Idhala @arjunkapoor pooru nekkla auldo!!", "frankie_murzello": "Beautiful pic ....", "ishan_parmar__": "Hum hi single ghumre hai 😂😑 @dark_x019", "himanshu.lohiya_967": "#🙏🇮🇳💕👍🙌", "ladakh.leh": "@gulnaaz_m ❤️", "grhindi": "Hello Stranger.. I know Not many are going to reach this comment ... but you, who is reading it right now, I wish that you become successful in life and achieve every goal that you dream of. I also have a dream. But I think it will never get completed. I wish to be a Motivator and currently on Instagram i am nothing.. Just few followers ... The only thing I request you to do is visit my insta id , look at the content and follow if you like it.. no forcing.. Just a humble request... You are awesome Best of luck for your future endeavours... Have a cheerful day or a great night ahead", "rohnisharma00": "Waiting for ur future 😂😂😂😂😂😂😂😂", "inshasinsta": "@lakshittawww", "solmanhussain3": "😂", "jawad_shyhk": "❤", "adilvhor": "Malayka so lucky 2 husband @malaikaaroraofficial @arjunkapoor", "urs_luckyarora": "👌👌", "shana9jf": "Sikoooo!! Didn’t he go out with Aprita Salman sister !!now the bhabhi 😂😂 🤦‍♀️ Yukkk !! Who next Salman mother 😂😂", "ms_khan_oficil": "Tumhara boyfriend se acha Vivek Obero hai", "rabia.hameed46": "@ifrah_naveed 😭😭😭", "sunny.gihar.9809": "Awesome", "vasim_s786": "Sharm aani chahiye apko.....apka ladka b sochta hoga k meri mom ka kisi or k sath afear chal raha h to ...kya sochta hoga wo b.........itna achha pariwar tha apka...or pura Bollywood izzat karta h is parivar kk...or aapne ....mujhe sochte hue b sharm aati h.....areh kitne din ki zindgi h apki....ek din chale jaoge dunya chhod kr....kuch esa kaam to kro jo upar kaam aaye", "heydar_kooh_": "❤️❤️❤️❤️", "abhishekpandey158": "Iske 18 saal ka beta h😂😂😂", "madhavi_devi": "Kuch to log kahenge logo ka kaam hai kahna choro bekar ki bate👍", "varldsmastare": "Bksh de bchche ko 😁😆", "javed5462": "😂😂😂😂😂😂😂", "mohdsohail.ms": "Piche dehk piche koun hai wo", "rameshvastrabhandar101": "#RameshVastraBhandar Sell On Amazon A Good Quality Women Casual Cotton Leggings And Jeggings -lBuy Nowl-", "kanchi_1718": "He doesn't share single picture with u ???", "priyachaturvedi31": "Love birds", "itssushpaikra": "👎👎", "sadia5438": "Mommy boy", "_memes_nd_videos": "@malaikaaroraofficial maam aapka beta bilkul aap par gya HY", "tulu.jena.52": "Sali tu kitni badi randi hay kisiko shaadi ar honeymoon ar kisike sath chi nonsense girl", "effutiti": "Rufjfjjgjj", "the_azizulmurshed": "🔥🔥🔥🔥", "troubledesires": "Malaika’s new source of income", "_thesassypotato_": "all the men whining and shaming these two...those are the kind of men that never get laid", "x___________chr": "Pyar ki umra nai hoti 💯", "syeda_aiman_taha": "@samantistic", "sufi4han": "Kya baat h.. 🤣👍", "viratkohli.fanclub__": "Follow @viratkohli.fanclub__", "real_salman_nawab": "Abe chutiya lagta hai tu arjun kapoor pata hai tere ko 😁😁😁", "eishabehal": "😊😊dabangg to aap ho...", "rui_khattak": "Nobody can be in love with you the way i am with your life style #stayblessedMala", "mahyaroshni_29": "Srysli😂😂😂😂😂🙈", "santhosh4252": "😂🤣", "rohit_filmy786": "Iska beta kya sochta Hoga god bless him 😊. Kai's maa hey", "mojilahabsi92": "R****d**", "vipins57": "Hate this man", "bollywoodhotties1": "@malaikaaroraofficial hope you both married soon 😍", "___shrishtiforever______": "😻", "mahuyasaha": "Lovely 😍", "tariq.safi3": "Ajeeb duny hay !", "igiyas": "#maldives🇲🇻", "vijay_3747": "जवानी तो वापस नही आति ना ।।", "kasyapi_singh": "Budhii", "shakshi520": "Paid Fun Available 🔥❤️", "abhirock176": "🖤🖤👌👍", "rohanch3891": "Pyaar gyaa bhaad m ... Duniyaa ko kuch toh dikhana pdega... Toh do chaar insta post hee daal do ... Gold digger👏👏💰💰💰", "vipshoppingservices": "Here We go! That’s bold move", "babubismaria": "Hate her shame on you", "sunil_pujar__": "Criminal ki ghand jaali", "akshay__998": "143", "_sukraj_": "May toh super man salmam ka fan😂🤣", "hamzahadi6694": "Mom n sun😂", "nazia.naz.12139": "He never post photo of himself with his auntie", "its_n_a_r_w_a_l": "Ladke ki maaa", "akash_sandhu143": "🤗", "jjaannaammjjaayy": "Very lovely 🌹very dramatic 🍎", "himi_jaan": "Wish You u best of luck both of you love from pakistan @arjunkapoor @malaikaaroraofficial", "tanvi2190": "Such a beautiful couple..age should never be a concern if you truly love someone", "the_royal_falcon": "🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬", "tumaneabhi": "👏😍", "rajeshsaha666": "Happy f@@k day to our national's kaka kai.", "swapan.kokrajhar": "Dil vil pyar vyar....kuch bhi nahi hai....nayi machine se thokna hai bas aur kya...", "mraashishmishra43": "DESTROYED ARBAAZ CARRIER NOW ARJUN ONLY LADY NEED MONEY", "5izar": "Bechari Priyanka toh Yun hi baad naam Hai 💔", "akhunza_jaan": "Who is next 👎❓😠", "imsahil_04": "Chutiyapa😂😂😂", "maydreamsank": "Money talks", "kapadiamonik": "@arbaazkhanofficial", "parulvikash": "Chutiya", "rrai_theparadise": "@arbaazkhanofficial", "jaspreetsingharora": "😂😂😂😂😂😂😝😝😝😝😝👌👌", "avvngrs_": "Aww❤️", "mekaynath": "❤️❤️❤️❤️❤️", "bj9199": "Hii", "imagin__alienfarts": "dark humour over here.....follow the god damn page", "ishani_sharma0123": "❤❤❤", "mahshid.063": "He just look like her son and they want to get married how crap", "anil.reyat": "👏👏👏👏👏👏", "musicsai": "CHOODU number 🔢 One 🥇🥇🥇🥇🥇", "saibaba_2020": "SALMAN Bhai ko gussa aane de bus 🚌🚌🚌🚌🚌 iss baar HITnRUN Bus se 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "shubham.reddy.129": "👌👌👌😍😍", "sudhaayyalasomayajula": "If they really feel comfortable with each other then it would be really wonderful but i feel their relationship is more to show off and maje Khan family very jealous - Arjun is doing to take revenge probably for Arpita and Malaika for Arbaaz and Salman . They both have common reason to be together .", "himani_glittersncolors": "👍👍👍", "vijaysinhmori": "Randi_baz he dono .....They love only for wealth", "nehra_deepak111": "😡😡😡😡😡", "shaluheart21": "Age doesn't matter for the love ...you both are poved it....I wish you both to led a good life😍 life long😍😍 Arujun kapoor and Malaikaarora😍", "kavitaanto": "Such a cute couple n so nice of arjun kapoor to break all so called norms of love", "sagor_zain": "mother & son 👌", "hasan.safder.16": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "rasheedrasheed8936": "MummySon😂", "becca_vaag": "😘", "mohammedmuzammil.shareef": "Can i know weather malaika is divorced or not", "prya1888": "Mother and son out for Birthday", "juliyana_c": "Beautiful couple 💕💕💕💕💕💕😘😘😍😍😍", "sajiy786": "It's ok for Salman Khan her.ex to date girls old enough.to be there daughters it's ok for said to marry Kareena but was wrong when he married amrita why is it ok for these buddhas to marry bachis but not ok for women to marry young men who it just shows how narrow minded & objective our society is & even in today's day & time such oppression against wonens age is shame on peoples thinking love has bo boundaries control you find some one you feel give you respect treat you right & your heart says this is the one so what you going to take his biodata what's your age religion age cast extra no this is all irrelevant what's important is he respects you loves you bes by your side no matter what life throws at you treats you as his equal not his age her age but just love matte it's ok for shahid to marry a little girl but not.ok for Myra Karen'a or Katrina to marry young man why because they are women a man can go & cheat on his wife bed hops but if a girl has.relationdhip before.marriage or after.marriagr shes seen as.cheap why because our narrow minded.society men want there women to be chaste & pure then why the hell is it different rules for you a woman to wants a man just to be hers & not.some one who.has been through the whole its womans birth right just make species to have preferences.& desires & it's her shareeri haq to do get lost get a life", "sakshisingh6124": "👍", "sapananingthoujam": "Beta ke saath time bitaney ka 1 bhi pic nahi dekha.. yaar ke kitney honeymoon pics upload karugi.. aunty malla.. ek pic apne bete ke saath bhi dallo.. dil ko sukun milega", "saffa.__": "@baybe_zee", "being_enamul": "Fuck both of you", "celinehanaa": "So they're officially dating?", "khansohail__": "🔥🔥", "sanaullah__143": "Are bc ye kya chl rha hai 😁😁😁 arbaaz bhai ke sath", "itsme.kool": "Buddhi Godhi Jawan Lagam", "montamourtravel": "❤️❤️❤️", "salmanzaib11": "Asalam o walikum how are you.. Can i say something secret", "saloni__gill": "Ma ka alag bf baap ki alag gf Bete ki alag gf wah re Indian culture😂😂😂", "afrin_hridoy": "how can b anyone so ridiculously shameless ???", "yaduvanshi.ritesh": "Lovely ❤️😍 arjun bhai😍", "basitpatel08": "अर्जुन इस बुड्ढी में क्या दिखा यार तुझे ??😆😆😆", "pradeep_sharma_deep1": "😂", "itsneha_official": "Perfect", "naval_tyagi_": "Beautiful", "theakshaytripathi": "They both are good❤️👌 doesn't matter what people think about them ..... Perfect both of you👌", "tiaranuraniii_": "❤❤", "_sheida75_sh": "Inappropriate couple", "aishwarya.paul.16568": "Yaar sab ko q problem ho Raha hai??? Lf me khush rehena important hai.... Jo yeh dono hai.... To q Aise negative comment kar rahe ho... Yaa sabki apni apni soch hai. Bt abhi 21st century me to apni soch ko barah banao..... Aise gali galoj karna Kya acchi baat hai???? Agar koi apne pyar k sath khush hai toh khush rahe woh. Yehi Dil ki duyan hai.💖💖💖", "bollygosip1": "Momma maine school naa jaana naa jaana naa jaanaaaaaaaaa", "bristy_bepary": "Chi chic", "vikas5461": "2 saal or ruk ja arjun log bolge ye tumhari mummy hai ke.....😉😉😉", "big_dady_ashish": "Behenchod tu kiski mummy hai teri beta 18+ hai aur tu us lawde Arjun Ko shaadi karna chahti hai aur tumhari husband Ko divorce", "deepali9": "Shame on u", "amrita_khanna2": "@arbaazkhanofficial bhi bday wish karega... 😂", "meswagatamukherjee": "I just loved ur togetherness....god bless u both always", "fa.iz2760": "Kitna badha mota suwar lag RHA @arjunkapoor", "beantbernice": "Happy to see a free woman..every woman should have the spirit to live like you..❤️", "ashishchoukse007": "Happy Birthday 🍫🙂🎂💪💐", "its.navya": "What's wrong with it anyways!? It's all ok", "official_harry1133": "No you don't deserve him.", "shrutijoshi12": "Bhabhi oops sis in law oops gf oops wife oops mother oops divorcee oops gold digger", "shvmm.100": "🙏🙏🙏🙏😆😆😆", "gun.veen": "I hope you guys get get married..!! 💕", "ravi_nagargoje_": "😍", "hajarzabane": "Be happy ❤️", "skyz_d_limit": "Not my business but is ke liye Arbaaz ko raaste se hataya.. that part is sad", "kozoruh": "Hi I have just uploaded my first singing video I will be very glad if you can check it out and give me a like and a follow so I would know😊😊", "__________sandi_______": "🔥🔥", "beingbibsh": "Kaun he fir a arjun 😂😂", "viksa_salyawadi": "Happy birthday🎂🎁🎉👑", "lilstarboytzofficially": "Happy birthday @arjunkapoor love you so much 👏👏👏", "shoai9770": "Chiii yrr ek aunty ka umer hoke bhi baccha ko phassa liya kese generation agaya yrr kch to sharam kro ousko dekho aur khud ko dekho #malikaaroraofficial tmhara to carier khtm ouska q kharb kr rhi ho 🖕🖕🖕🖕🖕🖕", "pixiedotxo": "🔥🔥🔥🔥🔥🔥", "amits8539": "What's this... thodu sharam karo.... what message given to society", "menuyel": "😄👌", "sid_siddiqui_2011": "Iss pyar ko ham kya naam dae 😂?", "poster_houze": "check my page for awesome poster frames 😊", "ruthcastro0908": "👏👏👏👏👏👏", "subhan.minhas": "Follow and DM for interesting stories.... @subhan.minhas", "mamunrashidmamun1973": "Malaika buddi ko achese chudai korna", "ren.1882": "😂😍", "pankaj_bundhate_mns": "Jis thali me khaya wahi xx kar dia ... Nalayal", "wutdafurk": "Follow our page for the best memes 😎", "akshaysuryavanshi740": "Aunty ka bachhha😂😂😂😂😜", "vikas.sharma.001": "I like mature ladies too ♥ ♥", "jdr972": "Mast raho mauj karo duniya Jaye bhaad mein apni life apne hisab se jiyo Koi Bolta Salman Khan career khatam Kar dega only bakwas Salman Khan acha insaan hai Salman Khan ko bhi Badnam mat karo duniya mein ek Hi powerful hai only God❤️", "jashanking77": "wtf", "vipul8750": "😁😁😁😁😁😁😁😁", "k.d_luri": "Worst couple ever", "cutieee5105": "Jodi toh bahut hi aacha hai Sadi Kyu nahi Kar lete", "y.aadarsh": "@arbaazkhanofficial bhai u r lucky move on and jaldi se bhavi dhund lo u r lucky that she is not more in ur life", "baluyeshwanth": "I'm gonna Puke, with all these so called Love. Just imagine how Arbaz is right now", "bollygyan_7": "Happy Birthday ... Cute Couple 😍😍😍", "kulkarniabhijeet92": "By", "jagat_bamniya": "Beautiful pic", "alpesh173": "Bhai behan ki Jodi hoho hoho", "vikas_khachi": "#Hotty_with_Fatty 😂👌😆👌👌👍", "snoop5203": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "arruneemuchwala": "🙌", "shreyathukral": "@sanabansal @taarushi10", "outdoorswithsal": "You are amazing. Go for what you love and the world will be yours 👍", "arpi_smily": "Enjyoing by reading comments..both negative and positive😂😆", "nagin4fans": "happy birthday malaika ki chut", "jaipal_reddy45": "Super", "manish040898": "2 - 3 saal thok le fir to dusri milegi hi 😂", "sanjeevdhankhar02": "nice", "bilalmalik91": "Uff yeh dobara young hona chahti hai. Isi liye young blood you know. 💋", "krishnakute2015": "Kam se kam apni families ke bare me to sochte...", "oliveisfab": "The comments show the mindset of so called 'youngsters' of our society. Their bodies may be born in 90s n 2000s. But their mindset is still as regressive as 1920s. If you're really modern and gen next you wouldn't give 2 fucks about who does what!", "farazmughal93": "Pornstar", "aditibhartii": "Appalled by the comments. The problem is men can never tolerate a woman who can make her choices. Male ego is the most fragile think in the world! And women, sadly, also validates such archaic, patriarchal thinking. They too have lost the ability to think and appreciate others.", "aishwarya.umashankar": "@arjunkapoor @malaikaaroraofficial Item songs karte karte real life mein bhi item girl ban gayi ho tum congratulations 🎊🎊🎊🎊😅.....pehle khan ne toh tumhari 20 saal dudh piya🔥 ab kapoor ki bari next kiska line hai bolo💋👙dekhna yeh hai ki tumhari chut kitna enjoy kar raha hai varieties of pe*** andar ja raha hai ummmmmmmm.... dekhne me aur age mein toh aunty ho par andar toh jawani hai.....yahi dekhe @arjunkapoor Ne surrender ho gya shayad @malaikaaroraofficial Tumhari gandi soch ke age mera ye words kuch bhi nahi hai", "sulahre_sunny": "❤️😍", "ch_mynkgujjar": "Maa beta ki jodii achi h", "lobaalfayy": "😍😍😍😍😍😍", "dbbb__72269": "Arjun kaa bahut andar jata hai kya kitna deep hata hai babe 🍓😍😍", "_.lubana": "#Deadshit 🐒", "sardar_izhar_jadgal": "salmn khan arjun ko aisa kary ga jisi vivok ko kya", "kingslayer_225": "Kahe inka carrier khane pe lagi h aap", "kashyapjyoti9525": "👌👌👌", "smeagol91": "@sunali93", "nuskakc": "What different he is from Sridevi whom he heated all these years because she destroyed their life and now he did the same.", "mahnoor.khanzai": "😂😂", "mon.oz": "Old ass bitch @malaikaaroraofficial", "nomankhan7739": "Use lesh mal khan aam chush ke gutli arjun ko de diya", "anumeet__": "Kya re jhateri", "anonymous.__67": "Besharam", "samchaudhary6": "Jisko kuchh nahi milta usko malai ka pakoda milta hain .! Shame on you guys .! For this relationship you ditched your families age group nahi to Kids ka to sochte both of you arbaz and malaika .!! Abhi kuchh time ka maza fir saza", "iambiky": "Shadi bhi kar lo", "saima_ali27": "OMG you are dating Arpita sharma’s Ex boyfriend? Gross !", "mona4512994": "Hi", "prashantchaudhary312": "Nice Jodi", "anshu.in27": "Wo bhai tere ko ye Aunty hi ek mili thi kya. Jo. 15 sal ke batche ki maa hai", "ashutoshkumar4399": "Love is in the air , Budhia change the gear..!!!", "sa_chin5572": "Happy birthday arjun ,", "rahul_ramteke_official": "Barish ka mousam h shadi krlo😭", "fahad_bin_taher": "Hardik pandey to Arjun kapoor : aj karke aya?", "sushmaarshharma": "Loved d tee.....💞", "__tithi______": "🤣", "goofyshh": "Thts Boney Kapoor and Sridevi🙄 with vice versa age", "bhaduri.abhisek": "Super Hit 👌", "mischaduran": "Ewwwww", "sadiashowkat": "❤️😍", "aditya_jagtap964": "😘", "_rebeccagwilson_": "Happy for you 😊", "mino27mino": "@blsousou تفرجي", "harshkaran007": "Age doesn't matter...🥂.. love is in the air...best of luck for your future.. party hard🥃 ....@arjunkapoor @malaikaaroraofficial 😍", "niss3052": "Красивая пара. Очень гармоничная и стильная пара👍🏼👍🏼👍🏼👍🏼👍🏼 я", "ur.michael.jones": "Whore", "danyaldareshani": "Mom and Son’s bond is unbreakable. May God give you everything.", "mehwish_miffy": "Love and respect ♥️😘", "atulya_7": "Say thanks .", "ash_arete": "Pls marry soon😍😍😍🔥 @malaikaaroraofficial @arjunkapoor", "khajuria2809": "👏", "madhavmakhija": "Shit guys", "thn.4428": "I'm sorry for you", "yasinbodale05": "Salmans hetter are replied ....🖕🖕🖕🖕", "xoomm__": "🔥🔥🔥🔥", "premkumar13031": "So nice pic you", "whoharshdeep": "Is he fat for reason?", "vaibhavguptaforever": "Najar na lage @malaikaaroraofficial", "__wind_storm_": "Antuys ka shok rakhta hai launda 😂", "_mahima_kadir_ria": "@fadilarahmanerin", "rihaakhan": "Beshrm👎", "mahdi_ayaticr7": "🤮🤮🤮🤮🤮🤮🤢🤢🤢🤢🤢🤢🤢🤮🤮🤮🤮🤮🤮", "g.jsodha": "Kuch bhiii", "nobita__d_": "Beta lag rha hai tm hare saamne🤣🤣", "govinda_11_": "Galta he yaa 😏", "aayeshaijaz": "❤️", "vintagebyrano": "Happiest birthday @arjunkapoor 🤗", "biswas8926": "Mismatch", "ibrarahmed_123": "@ebbad96", "shahan.hamza": "https://ciaopakistan.com/", "kafayat_93": "Hello aunty", "nishasaini1680": "Not again 😂", "khata_rhe_mera.dil": "love is blind 😋", "abu_azzaan": "💓", "omraje.official": "Ye bhi #aunty wala Nikla...😂😂😂😂", "patel.kalpesh.75457": "👌beautiful my love", "_evitize": "❤️❤️❤️💙💙💚💚💛💛💜💜💖💖💞💞", "hina5550": "Hi", "lucid_mantra": "Hunny ki tarah lg raha hai... @ang_drogo 😂", "daksh_dhruv_official": "Ranveer dialogue 😎..Ye kalyug h kalyug yahn log ✊🤞iski mtlb ke liye jite h😝", "mmh2604": "Happy Vala Birthday 🎂🎊🎉🎈Both are looks nice 😜😜😜😜", "bibliophil007": "Pigs!", "ku_n_al__1919": "Ek number❤️📷🔥", "my.shayri": "Shayri Pado Fir \"\"FOLLOW\"\" Karo.. @my.shayri", "naddy1923": "Arbaaz khan feeling Happy they got new gf old one given arjun ko😂😂🙏", "sparkly_shaa": "@chicka_94 😱", "imsonu1998": "❤️😍", "avengingshredder": "She will breast feed arjun", "radhekirshna1047": "Bollywood in the jaise logo ki wajha se badname ho rha hai", "mayankdhar": "What is the problem with people let them be happy in their zone", "ranjitsaini5837": "Great couple❤️😍", "____rajb____": "Nice love bird 👍👍👍 best of luck I. Future", "himanshu_kantale": "My sexy Stepmom", "beinggouskhan4726": "Kya yaar bete ke umar ka hai arjun", "smart_boy_manish_": "ⒻⓄⓁⓁⓄⓌ ⒻⒶⓈⓉ ⒻⓊⓁⓁ ⓈⓊⓅⓅⓄⓇⓉ ⒶⓃⓎⓉⒾⓂⒺ ••••Awesome••••–💥💥 (Cute)•••••#Nice❄️☔️░▒▓█►─═ 🔙🔙𝔽αᗷ𝓾𝓵𝕠Ữ𝔰 🔵✔️🔙🔙🌹 ═─◄█▓▒░ 💥 ▫️▫️▫️－•••－Ｔｏ Ｇｏｏｄ 🔥🌷❄️💥🔙🔙🔙🔙🔙🔙🔙🔙☄️☄️☄️☄️☄️☄️☄️☄️👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻✨✨✨✨✨✨✨✨", "tripurakusha": "arey madam dho din v nhi lagega divorce hone mai...ye v khtm ho jaiga", "mahrukh__ch": "@malaikaaroraofficial Mahrukh Chaudhry from pakistan & USA! I wanted to DM you but its better THIS should be out there! TBH youre one person who should actually be proud ofyourself without any guilt. I know many fans people have been talking about your life since a time now BUT i would want to say the journey of life till now is what youve chosen for yourself and it should be this way!You are the sole owner of your life and you should own and live up to whatever the hell however the hell you want to lie it. We live in societies where people DO talk whether its a common mango person or a celeb like you so its just the BEST youre doing. They'll talk to you, about you, behind you or upfront but you should just dont care because at the end of the day its YOU who has to see how well you spent your day not them/papparazi! In this world NOBODY knows how to respect people no matter what and im sure youre well eperined with that im NOT a fan or anyone but i just love love love the way you have composed everything and even its public BE HAPPY to do so! people do talk they will at the end they can get into your bedroom and see whats Malaika is doing! i wish you all the best with all your decsions and screw the pessimism and love what you have and it wont matter who loves you or dislikes you! I feel proud of this picture because NOW hyoure coming out with soneon eYOU chose for the rest of your life and NOBODY should have a problem with that butsadly its our society which is a dog so pay no attention and you GO GIRL! PS. Happy Belated @arjunkapoor im not your fan BUT what you did for this lady is respectable enough because you didnt care about anyone and you chose your life! it should be this way because, YOUR LIFE YOUR CHOICES! KUDOS! just a person who had a random dream about you both!! and i love @malaikaaroraofficial anyway even if hses doeing nothing im sure shees talked about everywhere and i think if youre still talked about by doing nothing, YOURE ALREADY MEGA babes! best of luck!!", "noorkhan12311": "Mansoon bhi aa gaya ab to secondhand ko apnawo......", "akuve_vero": "💩 💩💩", "vaidu_p143": "Malaika I u md ho kit ne achhe h arjun or ap 😂", "tosif.qureshi.1042": "Saali 3-4 bacchon ki Maa budhi ghodi laal lagam", "_out._of._this._world_": "I saw you saying many emotional things about u nd arbaaz in past & after seeing this i just feel.....Love is so fake nowadays ...it only depends on your satisfaction..if you are unhappy you will cheat or leave.. Relationships like that doesn't last long...anyways who am i to say anything..its your life make it large or just F🔥CK Off !!", "texmaxcheese": "Allah bless both, arjun and you with lots of love and happiness in life. Be happy always and enjoy life with fun. 💕❤️😘😍", "doc_rahul_d_healer_winner": "You looks very young mam @malaikaaroraofficial evn after being 48 year old .. we can't imagine how u maintained your self so young no one can say you will be 49 year old this year ,,", "aishak8730": "Omg", "sakatka": "Happy bday arjun", "jounkumaili": "Fuck u", "royi07": "peace on people, their life, they want to cheat, bang or whatever. why salty....", "mahesh__shakhla_77777": "A1", "usha_khadgi": "😊", "zahera.jabeen": "🙌", "karansinh013": "paryay nhe ooo", "sanjay.kalra.77736": "Gatiya old women", "thepriyakashyap545": "Bogus b'day ever", "darshits8": "Rub ne bana di jodi", "shubham_singhthakurshubham6611": "Good looking 👀 😍🙌🙌nyc 👨‍❤️‍💋‍👨 👨‍❤️‍💋‍👨 pair", "i_m_daljeet": "Madarchod........ Uska launda tmhari maaa chod dega 😂😂😂😂😂😂😂😂bsdk amma ki umar ki aurat fasaye ghoom rhah... Bsdka... Namard", "afzal_shaik_08": "Finally malaika...... open her relationship lot's of ❤️...to both", "saman_shahid1": "😂😂", "zak.iia": "@protap6695", "kingofbanka": "Happy birthday", "yessbee89": "Sri Devi ke qaatil", "mushi_khan_": "Ab arjun ki toh wath lagna wale hai no carrier no movies 🤣 namak haram arjun, salma gave him a way to industry and in return salman bhai ki family par hi haat daldiya", "vivekkoul": "Zindagi k asli majey to ye le raha hai", "shuwonitaye": "Society me arjun ka jo love life he vo koi v na sikhe varna sab ka ghar tutega..pehle Salman ki sister ko fir baad me Salman ki sister-in-law ko..not done yar..soch k kharab lagta he itna v western kya banna, itna v mind ko broad mat banao ki rishte kicher lage.", "radhye_singh_": "well apne papa ki bhrpaai to Arjun hi krega.. papa ne apne se choti se ki thi ab beta apne se badi se kr raha hai , 😂🤣🤣😂😂", "131369zahra": "🤨🤨🤨", "leeyangneh": "May you be happy always", "karank999": "😍❤️❤️❤️❤️❤️❤️❤️", "sojol5710": "Mature sex with young", "krishugale": "😂😂😂😂same pinch", "belikesardars": "free promotion for sardars ,,, send ur hd pics for shotout or for poll/battle🙏🤗 follow kro g nd story pa do g mention krke to follow🙏", "arjun_samnotra": "I feel these type of things defame the industry just my thought", "asif_mustab": "Is he your cousin?", "sekhon_taj": "God bless", "aliphysique_": "@malaikaaroraofficial cougar as bitch 😂😂😂how could u do tht to Arbaz🤦🏽‍♂️", "virendertashi": "😂🤣", "sanaz__raeisi": "👨‍⚕️👵", "xoaakarsh": "Bete se itna pyaar Moms are the best things.", "tsenam1413": "Amma take care ur age...🖕", "nilu3535": "Pyar kbhi bhi Kahi bhi Kisi BHI age m ho skta h Sahi Kaha Apne koi chij nhi h pyar feeling h agr feeling hurt Hoti h to pyar Mr jata h or koi apko smjhe to dobara kya tibara pyar krna BHI glt nhi h", "justclick.111": "How many times u fucked up🤣🤣", "kanejogdand27": "so so cut coupl mam", "saddam_khan2": "Fall in Love with his stepmom", "sexyaastic": "Both are looking cute 😍", "ashwin9462": "They look awesome .... Why arjun always carry bag..what the hell he is hinding in it.", "wizzysubh_27": "Did u dated that ugly fat Arjun Kapoor when he was of your grand children's age? Or after @beingsalmankhan transformed him into ❤️ throb of a \"few\" girls.. coz I personally find him a total chutiya.. very much unwanted and undeserving of his place in Bollywood.. which is eventually fading away anyways..", "amanukey00": "Kapoor", "shivu___2111": "Even i am happy for both of them .... But yes i am little disappointed with today's married couples .... How easily they all are breaking up and divorcing each other no matters how much time they have spent together like after spending 18 years with each they suddenly decide that they r not fit for each other and should divorce .... Hope u 2 will make your marriage work together.... I am expecting from you 2 to get married and start a new life and just dont let stupid term enter in your life like breakup and divorce again ...", "official.adityam": "Happy birthday malaika ke oolad byaav kr rha h ussw h bhudi pasand aae tere ko malajade ke oolad", "kkunu": "His c**k must have satisfied you", "rohit_007_1": "Superb 🔥🔥", "abhishek_thakurwansi": "साली बूढ़ी मियंदी एक नौजवान हिन्दू को फसा लिया", "suhas3605": "❤️😍👏", "96.49007291": "Nice jodi", "sonammanda399": "Happy birthday to u arjun sir", "rabbicamart": "Being a woman how can you disrespect other woman ? It's her wish & her choice with whoever she wants to spend the rest of her life. Please respect that. It's ok for a man to romance a woman quarter her age both onscreen & offscreen but why a woman can't do it ? Please stop doing that to your own gender ladies.", "_virat_param_": "😍😍😍😍😍", "i.saadqazi": "@arbaazkhanofficial dekh rhey ho?", "muniram_sanjeev": "happy birthday", "ivipinsahu": "@arbaazkhanofficial dekho", "ilovemyselfss": "Aunty aur bacha", "pihus3932": "Love to see Both of u Together...Ignore All and Enjoy Ur life in ur way..best of luck both cute Couple❤️❤️", "simmi2109.sr": "Arjun was missing his mom now he found one...😢", "burrr81": "Salman khan would be proud!!", "om_taiim1": "🔴🔴تعاني من السمنة ... الكرش... الترهلااات... مشاكل الشعر والبشرة ...علاج مرض القولون.. ماعلييك غير تراسلني خاص 👍والحل عندي بأذن الله 🔴🔴", "wang_xiu_yiing": "Ye baat to sach nikla ki ek aadmi ko khud ka beta aur biwi dusro ka hi acha lagta hain😂", "alraisi__": "😍", "zia_110": "👎👎👎", "happy_rathor5": "Nice ❤️🌹👨‍❤️‍💋‍👨💑👩‍❤️‍👩💐", "vikas_bandi_": "He's behind khan family . pehle arpita khan sharma ab usiki bhabhi se . maje hai iske...", "haifavi122": "🤮🤮🤮🤮🤮🤮", "suhailraja774": "Mom and son", "yashraj3753": "Aunty ji with unka beta 🤣🤣🤣🤣", "dazyvella": "Doesn't matter anything what bothers is two kids of her😥", "pragatirane123": "Couple not at all looks good", "nawalein": "@mumtanha", "nainglintun_nlt": "⠀", "innocent_minhaj": "Happy Birthday to your bravee sonnn!!!!! 💙", "deepak_phogat007": "Ye celebrity ko har 2&3 mhine m nye bande se pyar ho jata h.....dialogue ye marte h ki m apni lyf bas sirf aap k sath bitana chahta hu..", "sandeepdhaka97": "I don't have any right for said about on your personal life .. your life and your decision... But his type guy called dil-fake lover. He will cheat you. God bless you", "sainathghoneofficial": "मलाइका अरोरा आणि अर्जुन कपूर यांना वयावरून ट्रोल करणाऱ्यानो औकातीत रहा तुम्हांला कुणी अधिकार दिला या दोघांच्या खाजगी जीवनात हस्तक्षेप करण्याचा...मी तर या दोघांच्या पवित्र प्रेमाबद्दल जगभरात मनापासुन विचार प्रसारीत करनार आहे ..मी या दोघांबद्दल चांगलंच बोलणार, या दोघांना पूर्ण ताकतीन सपोर्ट करनार.. या दोघांबद्दल भरभरुन लिहणार.. कोनाला काय प्राॅब्लम ? आणि हो प्राॅब्लम असला तरी, तो प्राॅब्लम तुमचाय माझा नाही.. अन त्याच्यान मला काय बी फरक पडत न्हाय.. या दोघांकडे वाईट नजरेने बघायच नाही .. सगळ कळतय अन सगळ समजतय.. या दोघांनी कधी जातीचा, जुन्या रुढी परंपराचा विचार नाही केला तर तुम्ही कोण रे जात, जुन्या रुढी परंपराच्या साखळ्यांन याना बांधनारे ? पुन्हा सांगतोय निट रहायच अन निटच रहायच बर का ? ट्रोल करायला बघायच न्हाय.. थोडफार वाचन करायच अन मगच बोलायच.. उग व्यक्तीगत स्वार्थापोटी या दोघांच्या प्रेमाला वयाच्या बंधनात अडकवून बदनाम करायचे न्हाय.. विनाकारण तुमचे जुनाट विचार पुढे दामटायचे नाहीत बर..", "london_girl_1": "So ugly my god 😢😮", "dharm.ver": "Hppy birthday..Arjun boss💪💪💪", "warumistdassowichtig": "That is yak !", "samgadhvi": "Pyar Andha hi hota hai 🤣🤣🤣"}