{"rey_insta_": "its very hard process , i personally felt many people including me sober around the past and stay in that sadness never ready to heal. they think about the mishaps and being worried of that. the healing doesnt come as we prepared for. it will crush us with the pain each day and make us averted towards and one day we make a fresh start being bored and used to that pain", "klausl123": "🙏🏻🙏🏻🙏🏻♥️♥️♥️", "just4meemes": "@sowmyakk1993", "jazz__baat": "Yeah!! It is difficult in the initial phase but once you started, it gets easier everyday. You have to keep a firm belief in you and your surrounding.", "danieldinesh27": "Nice", "shivampaix": "🤤", "notishaana": "recovery is one of the most difficult and winding journeys and it’s never linear but it’s so, so rewarding and i hope you find your way ♥️", "ajaj_dk": "Show biuty full sweet", "martins.brasil": "You are a very beautiful girl, and you were perfect in this place with beautiful flowers, so you integrated into the place, being one more flower, blooming the garden. sorry if my english was not good, I'm brazilian.", "_subbuuu": "❣️❣️", "mr.satyadev": "♥️", "pulinprabhu": "Bindiiiii ❤️", "t_h_e_n_a_m_e_i_s_s_e_e_w_a": "❤️❤️❤️", "edgability": "♥️", "johann_jakob_101": "@aranyajohar do you know that Jesus Christ loves you?", "saumitra2987": "Beautiful photograph and very astute caption", "wrtyuiidfgjkkk": "👏👏👏👏🌹🌹🌹🌹🌹🌹", "haneef13_": "😋💦", "alexbardosbardos": "🍑🍑🍑🍑🍑🍑🍑🍑🍑🍑🍑", "tris_shelter": "👏👏👏", "vikram._shah": "Beautiful ❤️", "vgarg2307": "Mst yr", "keshavrai": "healing is exhausting, thanks for saying it", "skyecardoz": "I really needed to read this!! 🌿", "viper_vipin_nair_00078": "Wow ur gorgeous😊😘", "_sandrss": "😍😍", "_shraddhadabral_": "So much love for you♥️", "sxkshi__": "Thank you for this.", "jarvis___1203": "👍👍❤️❤️🔥yek no", "ro.hittt__": "@momowitheyebrows", "rushin_maradiya": "I think it is, to put all that feelings deep inside and try to move on, so you can be normal to all, but you also know where it is in deep inside..", "akankshasinha_": "you’re an inspiration!!! miss you❤️", "swaraaaaaaalililili__": "❤️", "__thegoldfinch": "Healing is an utmost require for all human kind as it brings out the true pleasure for ourselves and our loved ones💕 I'm working on it so should everyone", "raginimathur15": "❤️", "kunsahuja": "you the real flower in the garden", "divyanshugoyal_": "I crave time by myself to sit and heal my heart before I step out into the world again", "sp_i_r_it": "@aranyajohar ❤️", "sneepies": "❤️❤️❤️", "starring_grace": "thank u for this ♡✨🥺", "dagajay": "But how does one know that its all fine now?", "lalonormey": "Nothing more to add ❤️", "jharaunakkumar": "Looking glamorous...", "promise.tpf": "I love this 😍", "mohammed2287": "😍🔥🔥🔥🔥", "mrunal.shankar": "Girl, where are those high waisted jeans from!?😍", "saharmalik": "The Chain by Fleetwood Mac was written about ur jeans", "tiasriv": "thank you for writing this", "antipravclub2.0": "healing is layered and tailored to us, it's bever easy work but not something we should give up on. :) ps : take all my uwu(s)", "rahulbaxi_libra": "National crush...❤️ @aranyajohar", "_jay.parab_": "💕💕💕", "_himaya__": "Will do. Much love girl! ❤️", "siddharth_1117": "Healing is exhausting a kind of exhausting thing which help you grow stronger,💪", "breathing.movies": "Much love, actually all the love♥️", "pallavi108": "It really is hard! Also so worth it! And actually do it a few times to the end and one gets addicted to the process. 🥂", "the_foodie_scribbler": "Its very important to heal. Coz once you get a scar and u heal, u really get to know ur tolerance level. And due to that u would always be able to take calculated risks in future that would always work in your favour. If u r not sure about ur healing power u would never dare to walk on a sword when required because of the pain u might get in return. But as it is beautifully said TOUGHEST PATHS ALWAYS LEAD TO BEAUTIFUL DESTINATION and SCARS ARE ALWAYS BEAUTIFUL bcoz they show how courageous you really are and so better at healing. Scars make uh more stronger. Keep healing and Spread Peace.✌️✌️✌️", "nomaan_ahmed6": "❤️", "susnthomas": "Fight for your peace 🙌", "ambarish_kv": "🤗", "mulla_akram": "Nice pic", "poorvaaaa": "🌻 ❤️", "iglezeye": "You look gorgeous and the background looks beautiful bcoz of you 😍🔥🔥🌶🌶🙈🙈😍"}