{"andromedan_aureole": "I can count on my fingers the number of times a man made way for me to walk while crossing them in a narrow road, instead of the other way round. I spent my childhood thinking you're not supposed to move, so I wouldn't move either and body parts would often collide. I understood it's something to be avoided only when I overheard my parents saying that I was a 12 year old, yet so stupid that I wouldn't move for the incoming men.", "massivetrashcan": "Bahahahahahahahahano", "arushisinhaa_": "Yasss! Women don't have to leave states, countries and be always alert. We're not roborts that we can always be alert, we should be able to walk around anywhere, at anytime wearing anything🔥🙌", "nariactual": "If you don't feel safe on the street, why do you go out on the street? Also, if I didn't feel safe, I'd probably carry a gun and train with it regularly to be able to defend myself against those that might want harm me.", "dymkilsus.9": "☹️It is true.", "aman___98": "True. Unfortunately", "patsucks_": "How would you know", "asmitrbsr": "Nobody is safe either men or women until these inhumans are there", "kafka.esques": "Exactly", "myad83": "Not black men but ok", "taylor.hargrove": "Unpopular opinion: which is why women in the US should utilize their 2A right to concealed carry and defend themselves. Men are biologically stronger than women, but that doesn’t mean we are incapable of defending ourselves and feeling safe.", "ezzysimona": "@trishka_sachi", "debashis.mishra.752": "@emmawatson", "ak.feedingsouls": "Kindly check out my page if you like reading and connecting. I write stories, quotes and more trying to spread love and positivity. If you like my stuff, do support me by following my page.", "ushasharma3002": "Itna safe space chahiye toh IIT se engineering kar ke u.s.a chali jao🤣 1 arab 30 crore ki population wale desh mai jaha 70% janta 32rs. Roz par zindagi guzar rahi hai waha safe water safe road safe air safe traffic sab chahiye. Safe leaders nahi chahiye terrrorist ko vote de kar loksabha ka m.p banao😂😂😂", "adrian_sky11": "Yes and every time someone tells a woman to be careful right before they go out it's usually because of men.", "theblacktaylor": "Maybe you should move to a better city. Here in Canada, women don't feel threatened on a regular basis (I. E", "mis.tified": "We should call out a compulsory strike.", "moinak26": "🤣", "a3ank": "I offends me everytime when I read something feminist around but in retrospect I agree because it's all truth at some level", "radavishay": "It's very horrific how the things are taking shape in a young country like ours where most of the population is considered to be youth. Feeling disgusted and sorry raged and many more pissed off emotions for the future. We need to change for sure!", "srilalitha76": "😢😢😢😢", "eighth_sin_canc": "Woman are programmed to worry more", "thechataiwhodoesntsellchataii": "As a 16 year old, I don't have to worry about study anymore but about my safety", "shicanclick": "Thank you for inspring me to write my recent post @aranyajohar", "beingafamous": "What the hell is wrong WID u ? Do u think hyderabad is horror ? Stop trying to be a good person if u repeat diz word's u will never visit hyd again I promise diz", "chilledmorphine": "Somewhere I read that, \"Men of quality, Don't fear equality.\" And I believe it.", "ssachin805": "👍", "ishitaaaaaaaaa_": "Truth 100%", "a_r_.09": "Isn't that the opposite🙄", "maddielockyer": "@th0mas.hunter", "joanna.kerch": "Not entirely true, my boyfriend has gotten harassed by Georgia police countless times on the street and in his own house for doing NOTHING except for being a person of color. He's been beaten, held down on the ground, pointed a gun at by cops on several occasions. He has also been harassed by other men (usually gay). I am scared walking down the street but I'm also aware and alert, so I have never been physically assaulted here in Vegas or when I lived in Miami. Even when I've been trapped by guys in the alley I knew my surroundings and used my voice to get out of it. I am a feminist but we need to stop alienating men because we need them on our side to fight the oppressors. Who is our true oppressor? Men? Or a system of oppressive laws?", "komalwho": "could not be more accurate", "mamthaaa": "ACCURATE!", "nakshatra_paul": "Agreed.", "mahimaa.thakur": ":)", "aprilislush": "I totally agree with you. However, I feel that it’s not black and white anymore. Toxic men have lived their entire lives feeling safe on the streets and they’ve had very few instances where they’ve not. But, women, a lot of gay men, and trans people have very few instances. We should keep all of that in mind. #justiceforpriyankareddy but most importantly #justiceforall ❤️", "noahs_words": "👏🏽👏🏽👏🏽👏🏽", "nitsuaaaaaa_": "It’s high time for stricter laws!!", "serenade_25": "@preethi__jayaprakash", "cr7awsm": "It's a humble request please don't make this heinous crime a men vs women debate it is a crime and criminal should be burned alive.", "paraparaparadise._": "Straight men will talk about consent only when they are in gay bar. Period.", "theregoesmyhero01": "Yes so sad but very true, in this day and age you would think this imbalance would have been eradicated. We have these issues everywhere but in India it appears more apparent. The day men learn to treat women with respect and dignity these kind of animals will never learn.", "ang.tho": "@royshubha_", "thatguyclauf": "World would be different place if periods were fun and taking out sperms painful.", "shafaqameer": "@r.i.z__w.a.n 😭", "bong_guy4": "😭", "jyofoods": "im dead already", "theconfusedhead": "This is very alarming situation"}