{"sharvari_03": "Wow girl, this is just eg xactly what I feel", "mounicabattula": "💯", "ajukamusic": "Deepest selfie caption ... Breath of fresh air😍😂", "_pany.__": "W", "appuuphigh": "Love you bro❤️💯", "sankshipt.reddy_": "Hi Aranya, @ubaidu_15 wants to do a love jihad with you and convert you to Muslim. He also has plan to marry other young girls after you are properly converted and impregnated with 3+kids. This is to make sure you that you don’t remarry anyone again so that you don’t convert back to Hindu. I hear him telling this to my friend over a party. Please be careful🥺", "parker_williams26": "Hi, kindly take note of this .. Trading is recommended with only Mr @Christerry_traderforex and I’m too sure about this and not publishing this to lure others into it but to spread the successful news so others can make profits like me. Thanks 😊..", "romstah": "enlightened", "shawna_robertson_800": "It’s appropriate and more appreciating to see someone whom you actually trust in helping you trade and get profits from forex and bitcoin investing. It’s so amazing to say @Christerry_traderforex is the only trader who helped me in getting profits which has done much changes in my financial life.", "anuradha6187": "@aranyajohar I am the crazy lady who screamed “we love you “ last night at Carter rd. My daughter a big fan is extremely jealous and would so love to meet you!", "ban.slayy": "You're such a cutie! Haven't seen you on YouTube in a while! Any updates for your next post? ❤️", "lara_blake123": "This is so alarming and might be hard to believe but it’s a fact that @Christerry_traderforex got me profits and so satisfied with what i have gained and it’s a big and huge enough for me 😍.", "osicap6": "You are beautiful", "itsvinayunique": "gorgeous 🔥🔥😍", "anandi_yadav": "@shailee_p caption", "lindacooganbyrne": "Your speech on a woman’s body is brilliant 👏🏻", "memech14": "So paraud", "kaam25_._": "المعاول جنون", "grandaddysenpai42069": "என்னை அறிந்திருக்கிறேன், இன்னும் அதே ஓ.ஜி. ஆனால் நான் குறைந்த விசை சீஸ், ஒப்பந்தங்கள் மற்றும் ஜி இல்லாத இந்த நிக்காக்களால் வெறுக்கப்படுகிறது சக்கரங்கள் மற்றும் சாவிகள் இல்லை, படகுகள் இல்லை, ஸ்னோமொபைல்கள் இல்லை, ஸ்கிஸ் இல்லை என் குடும்பத்திற்கு மளிகை சாமான்களை வழங்க நான் இறுதியாக என்னால் முடியும் ஒரு ஸ்டுடியோவுடன் ஒரு எடுக்காதே கிடைத்தது, அது சுவரில் சேர்க்க தடங்கள் அனைத்தும் நிரம்பியுள்ளது முழு பலகைகள், என் வீட்டின் பின்புறம் உள்ள அலுவலகத்தில் கோப்பைகளைப் போல தொங்குகின்றன நான் தயவுசெய்து என் மாவை உறைய விடுகிறேன் என்று நினைத்தேன், ஹோ ப்ளீஸ் மரங்களை புகைக்கக் கற்றுக் கொடுத்ததாக நீங்கள் நினைக்கும் இரு முழங்கால்களிலும் நீங்கள் தலைவணங்குவது நல்லது நீங்கள் வயதானவர்களை அழைத்து வந்தீர்கள் ஈஸி-இ, ஐஸ் க்யூப்ஸ் மற்றும் டி.ஓ.சி. ஸ்னூப் டி-ஓ-டபுள்-ஜி மேலும் அந்தக் காவல்துறையினரை மதர்ஃபக் என்று கூறிய குழு டோப் பீட்ஸ் நிறைந்த டேப்பை உங்களுக்கு வழங்கினார் நீங்கள் உள்ளே செல்லும்போது முட்டிக்கொள்ள", "rahel_fdlr": "Wow you're so beautiful 😍 😍 😍", "srikavasanth": "😍😍😍 Which filter is this?", "sanskritisingh_11": "This is something I wanted u to read...", "mankirat.jpg": "I stopped believing you when you said \"commemorate the few times i look good\" LIES🙂", "starring_grace": "this caption is everything to me 🥺✨💓", "the_caped.crusader": "Great, inspiring and Confident @aranyajohar", "ranjith.dass": "👅❤️", "__shruts_": "😍❤", "97_damad": "❤️❤️❤️❤️❤️", "ajaj_dk": "💋nicely", "cosmetic_po": "Pretty hair👌👌🍃", "_liana_dutta": "How could you? I was having this exact thought today and you just- wow. Thanks for the post. ❤️ ( p.s. - I'm appreciating and not being rude 😅)", "philosophersazkaban": "So pretty!! 😍🔥", "itsrainingg": "❤️❤️", "raveenabajaj": "You are beautiful ❤️", "tanaya__choudhary": "The justification is so good!❤", "mast_auratachintya": "Oh my god. What even - ❤️", "innerchildevanshi": "the aesthetic tho 🥺", "mi.manasi": "You have a beautiful mind ❤", "_leanandlanky": "When is that flipbook of rickshaw photobooth selfies out then? 😍", "lakshitaaaa": "Hot💕", "mandy_tanwar": "See messages plzz👏😢😢❤️😮", "pradhyu.anand": "Hahaha, this is exactly what my final year papers looked like, but love the effort! XD", "jyofoods": "a queen is always a queen ❣️", "tanishqquraishi": "Fantastic", "niveditha_v": "@aranyajohar Killing it. Everything 😭🙌", "studbud7": "Power of thinking...reading....and conquering the world comes within....it’s great 👌", "yp_the_phenomenal": "👌👌🏻👌 @aranyajohar", "purabi.ch": "you truly are art wow", "nandamuri.bhavanand": "🌸💕", "storiesbysurabhi": "Ah what a thought! 🙌♥️", "himanshu_sharma8412": "Loved the caption ❤️", "lifeslongpreperation": "Why does this feel so important", "som_surojit_44": "Beautiful", "aranyajohar\nVerified": "Verified", "sxkshi__": "You are beautiful 💘💘", "_chaai_addict_": "❤️😍", "aasthashukla_m": "You are the art! ♥️"}