{"nikita.gauba": "@aranyajohar feminism makes my heart race. Oppression in my own family, woman keeping shut because of the fear of the famous society. I know passion is something which actually makes you happy and content, and being a voice for even one such woman, would def make my heart happy.", "tomaroy22": "❤️❤️", "sxkshi__": "!!!!!!!❤️❤️❤️❤️❤️", "ani._.sha._": "❤❤", "_sym_jn": "I have written a book on women empowerment...I wish to connect to you and show my work, also I want you to know its concept and the purpose behind writing this book #achingtokickout @aranyajohar 😊", "annika.tay": "something that makes my heart race is poetry too! yours is so amazing , I inspire to be that good. i feel like life is finding what makes your heart race. I really dont know does though. having one of those heart beat things could help. anyways thanks for sharing your poetry i know it touches hearts of anyone that listens! @fastrackworld", "_manasvi.i": "Taking risks and doing things that I have never done before makes my heart race.I love exploring my self through this process.And thankyou for the cogent support u have been giving through ur words🖤@aranyajohar @fastrackworld", "priyalmarlecha": "Serving others is what makes my heart race working in an ngo seeing those kidos make me more happpy and sharing those laughter with is is what makes me happy @aranyajohar @fastrackworld", "nidhisha": "Seeing a brain tumour patient, walk back home; the kindness they have to offer, despite their debilitation; the patients offering biscuits to me on my rounds, despite their empty pockets is what makes my heart race. Neurosurgery, makes my heart race. @fastrackworld @aranyajohar", "anuja4953": "Music makes my heart race", "kayyysside": "Plzzz reply", "cooldudefriend": "Haha omg tb to a good day", "ethereal_paramour": "Poetry makes my heart race too. Poetry isn't just a hobby, it's my passion, it's a way of living a better life, it's the one thing I live by. I am an amateur poet who writes in order to create a world of her own where she can live away from the vile realities of this world. But other than poetry there is something that makes my heart race too. That is being able to help poor people specially underprivileged children. I believe the smile on their face can instantly lift up one's mood. That smile I get when I give them small gifts like chocolates, books, new clothes during festival makes my day a hundred times better and I'll keep on doing so. I believe we are what we do and not what people think us to be and hence I try to be my best self to myself and those people who are looked down up. This not only includes helping the poor but also standing up for the LGBTQ community, the eunuchs on the roadside. ❤️ @aranyajohar @fastrackworld", "_nishapriya_": "Acting on stage makes my heart race.. listening to poetry that is bold and makes me think \"I wish I were this confident\" makes my heart race.. thinking about what should be my next move on stage because somebody else made a mistake makes my heart race @aranyajohar @fastrackworld", "jhaliianjalii": "Yaaarrrr you are so amazing i literally love the way you just clear the thoughts with your empowering words and the way you speak omg . . . I love you girl . ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ Stay amazing and keep slaying 🔥🔥🔥", "nrmn.ckrt": "Is it a ad?"}