{"sapphic.in": "Heyaaaaaa I'm a hugeeee fan n I posted parts of your videos n they exploded😂😂", "aamy10290": "Omg is that dress from SheIn @aranyajohar ?", "kuonaa.aa": "i usually write when i'm sad", "be_shree": "Dear Aranya, I'm writing on behalf of KLE Technological University Hubballi, Karnataka. We would like to cordially invite you to be a speaker in “TEDxKLETech” that is being held in the second week of March, 2018. It is an independently organized TED event. We would be grateful if you took part in it and shared your expertise with our participants.  Please let me know, if we could proceed further on the same!  Thank you", "xxarushi05": "I realized very late that it's a boomerang lulz.", "_triptiiiii_": "I write when I feel something deeply ....Something touching the heart.....Real life experiences melting around like a theatrical cinema...!!", "nihar_uddin": "Just love the way you are @aranyajohar ❤", "kimyra.accessories": "@_aditi.shetty26_ dresss", "elisheva_nicy": "I write when I'm upset, when I see no way out . Once I ink my diary, I feel I'm over with every negative emotion.", "haseeblali18": "Nice", "ravina_15": "@rasika14", "biryanithough": "https://achlamydialist.wordpress.com/2018/02/08/a-letter-to-shamir-reuben/ I'm shook, really.", "eri_thehuman": "❤", "readandgrow_": "@aranyajohar Haha...I think most of the writers write in the same situation, but that makes me wonder how the very first piece has been written.🤔", "sydneyyangg": "Ur so gorgeous wth", "be_emvi_ous": "You are such a talented inspiration. Your poetry is infectious!! 🙌🏽💓", "saucy.mausi": "i write only when my emotions are triggered because writing is my only escape to let those out.", "the_amitrajput92": "your voice is awesome @aranyajohar", "backfootdrive": "@prash4nth this ?", "achilles_.tendon": "www.facebook.com/vibespoetry", "iamnitishthakur": "Why it doesn't have sound.?😃", "saraausmani": "You are amazing", "iam_stephlova": "I remember asking myself this question before. Recently too — however I feel that I write when I’m sad and inspired by a master piece ! This caption Motivated me by continuing to write 🙏 😇", "rakshanda_28": "Writing is so much fun! I write when I'm low and sometimes when I hear a great piece", "writika_": "I write when I am low, happy and yes hear a great piece.", "i_vibhanshu": "When every thing gets overwhelming. When you just know what id going on inside the mind and you are clear about it. But you know writing will calm you down.", "priyesh_panday": "Mam I also have something to share.i write poetry.and I want it with u.@aranyajohar", "mudasser07": "I write when I am sad", "zalajaydeep3": "I usually write when I hear a great piece or when I listen some great music 🎶.!", "nostos_9": "Inspiration 💯❤", "itsakshaya": "i write sad things when i'm happy meh", "binabgkaa_aiz": "I love you 💕💕💕 @aranyajohar", "today_day9": "OMG I w when I see you 😍", "s.narsaria": "When will this piece be out?", "parnika_gupta": "I write just when it feels right.", "tarak_shah18": "No sound🤔", "chaitralchourikarr": "Ayyy I have the same dress lel 😛", "actuallygandhar": "You’re so pretty!!!", "maybehitarthi": "I write when I feel the extremes of any emotion, happy or sad. The magnanimity of what I'm feeling drives me to feel a fear factor sort of, like if I don't put this moment into words, it'll vanish. It has to be there in the records for me to re-visit. And also when any great piece instills a completely different kind of fire within me, I write. 😬", "luftmensch.yd": "What about writing when you're high but you don't have anyone to talk to?", "msat212": "@aranyajohar sad or when inspired by a piece", "singh_sakshi601": "I usually write when I am too sad or I want to cru loud n I am full of emotions....which I am usually 😃", "chrysanth_blue": "You look pretty! 😍😍😍", "_bhumikarao_": "When ever I am sad or when I hear or read something inspiring", "_an8gel": "Whenever I feel too much", "rohanbarad": "nights; whenever i can’t figure out, why am I still sleepless, i find some coffee and go to my space,listen to something and then write. last sunday heard your poetry on big mic, vol 27)", "inker_passioned": "I didn't read whole of your caption and clicked and clicked and clicked and ended up jus liking your post a couple of times 😂😂😂😘😘😘", "angryindiangoddess": "💘💘💘", "luxxe_supplements1": "No sounds lok", "radheyp26": "Hey can't hear u Icon @aranyajohar", "meetu.siham": "I do the same thing usually", "tanishqquraishi": "it's always the zone which is a very distinct feeling"}