{"anaghanaik": "You hyping me up for my highlighter and clicking my solo pictures was fun. You are a Sweetheaaaaart ❤️", "shrushti.ashok": "yaasssss GURL🌻", "advaita_gk": "I love you soo soo soo much! And meeting you, made my day! ❤ You are super awesome! 💯❤ P. S. I won't stop obsessing over the fact that I met you! That was destiny.😂❤ P. P. S. I loved that tee so much, I got it for myself! ❤😂🙈", "jyofoods": "A queen is always a queen of she smiles", "the.happy.anand": "@_lalithakg_ see, I infiltrated 3/4 of their feeds with my face 😂", "jahnvi.writes": "You're truly a gem ❤❤ thank you for being inspiration to so many girls💓 and for me my biggest dream would be seeing you performing live in front of me💟", "purabi.ch": "Thanks to under25 for giving us the opportunity to have soooo much funnn😭😭💖💖", "ujasna": "What an icon💕💕", "sxkshi__": "YAS GIRL YOU ROCK💘", "_divya_sharma1": "Ishq♥️💯💯", "isiri_rao": "@drowntheory 😭😭😭😭", "niharicabhalla": "Seeee you soooon", "_noordixit_": "Watching you live was a real dream come true for me. You've been such a large inspiration in my life for so long now not only as a writer but as a person. I couldn't even begin to describe the kind of impact you've had in my life and being just a few steps away from you, even in that photo is such an honor because you're such an incredibly talented and special person and yet you stay so chill and humble about everything. Absolutely loved every moment of watching you, I hope you visit bangalore sometime soon again XO", "_laliithakg_": "Keep slaying girl💣❤️❤️❤️", "tanisha_pitalia": "Thanks for being such a sweetheart ❤️ I am glad I got a chance to meet you ❤️❤️", "fmwdotcom": "Mindblowing", "thanzeela_khan": "Too gud", "_leanandlanky": "This looks like such a happy fam picture. :')))) ❤️", "surabhi_paraki": "Please please please come to Bangalore again! I wish I could have been there(exams, ugh) but next time I'll honestly drop everything and run to wherever you are just so I can see you 😭❤️😭❤️😭 ilysm", "rohit_takhi13": "Keep Smiling 🙂😉", "ishiboy_me": "Fake feminism", "al_rockstr": "Nice nyce", "ru.thicc": "Silent disco was fav 💕", "yudhis93": "♥️❤️💓", "nehareddyx": "4 of my favourites in one pic omg hell yea 🙌🏼🙌🏼🙌🏼❤️", "kashastrophe": "what an icon ♥️", "_shraddhadabral_": "I love you💕🌸", "abbiinayaaa": "YOURE THE BEST. ILY AND IM SO GLAD I MET YOU TWICE YOURE SO REAL AND NOW MY MOMS IN LOVE WITH YOU ❤️"}