{"judahwarsky": "I am just one out of millions of people who have seen that video of your poem. I think it is wonderful, both in content and in style. I just wanted to say bravo, I think you are great", "rishi_kir": "\"Yuh cyar play mas if yuh fraid powder\". - Trinidadian saying", "serthekk": "Ex nihilo nihil fit (out of nothing, nothing comes) - refers to the chaos or nothingness (in Greek mythology) out of which the universe came to be.", "kimieabreak": "Just saw your YouTube video that's going viral on fb. Fantastic job 👏🏼👏🏼👏🏼 I've watched it server all times and am impressed by your poise and eloquence. 💕", "its.sharmaji": "Ur the best person I have see u on social networking site...The open minded girl with a great positive thoughts ..Hats off to u..🙏🙏", "yashpalr98_": "U r great", "amithkocher": "\"I wanna eject my emotions, filter it and inject it back' @aranyajohar (This is my favourite line and I have written it!!", "mudasser07": "\"Life can seem awful and unfixable until the universe shifts a little and the observation point is altered, and then suddenly, everything seems more bearable.\" - Jasmine warga #myheartandotherblackholes", "antoniomarquex": "\"Always despise free lunch\"", "shruvii": "Heyyy its good", "hwang_wonsang": "응원합니다~!!🖒🖒🖒", "rubi_qtr1": "Ur an inspiration!", "thepriyammodi": "🍁🍂 Mind Management is the essence of Life Management! 🍁🍂", "u9_u_": "'Shy or arrogance' or 'Shy and arrogance' @aranyajohar", "hari_om_jais_wal": "Gorgeous pic", "_the_mighty_pen_": "👌👌👌👌", "daniaasif60": "Remember? I told you that you're an awesome listener? @aranyajohar", "bhappilehri": "@behtareen this bandi is so pretty", "sanskriti1515": "*Great speakers put in immense efforts in preparing so that their performance looks effortless.*👍", "gunnerraj": "💚🌈🤗🖤👌🏼", "rebeccalvarley": "I have a couple but this one is with me everyday \"There is freedom waiting for you, On the breezes of the sky, And you ask \"What if I fall?\" Oh but my darling, What if you fly?\" - - - Erin Hanson", "aarifahrebello": "Cassiopeia - Sara bareilles. Or I don't wanna be by Gavin Degraw", "rajeshopr": "When you want something, all the universe conspires to help you to achieve it - Paulo coelho", "rachierach___": "\"To all the little girls watching...never doubt that you are valuable and powerful & deserving of every chance & opportunity in the world.\" -Sec. Clinton", "naveen.thumma": "\"The best way to find yourself is to lose yourself in the service of others \" -mahatma gandhi", "badgirlsupreme": "but love is wanting more for someone than they do for themself @aranyajohar", "ikarthiksekar": "Don't give a damn about what others thinks about you !", "ajaycounts9": "Everything is prewritten, nothing can be rewritten. Just live the present why to worry for future", "soothe_pole": "Maïa Mazaurette, french columnist who write about sex and gender said that it's strange when men feel threatened by feminism, and say “yes but where is the place for men now?” because they act like power is a limited supply women try to steal or take back. But it’s not. Neither are freedom and respect. Power isn’t necessarily power over someone else. It’s great to have power over ourselves and our own lifes, and that power grow when it’s shared.", "dna_deen": "be the best ..F**k the rest🤓", "godsy_zach": "\"I dont know if my soul is safe. Sometimes i use curse words when i pray.\" #avettbrothers 💮❤", "el_rod82": "I asked her out six times in thirty seconds. She said yes after the third one, but none of them felt right, so I had to keep going. On our first date, I spent more time organizing my meal by color than I did eating it, or fucking talking to her... But she loved it.  Neil Hilborn \"OCD\"", "12ravesand13birds": "\"You're unforgettable. Women like you don't come around often, your presence is electrifying, not for the weak of heart...maybe that's why he couldn't keep you.\" 😏 — r.h.Sin", "vik_rant_singh": "Awesome b 😘😘", "klausl123": "I love the opening monologue of Richard the third: RICHARD: Now is the winter of our discontent Made glorious summer by this son of York; And all the clouds that lowered upon our house In the deep bosom of the ocean buried. Now are our brows bound with victorious wreaths, Our bruisèd arms hung up for monuments, Our stern alarums changed to merry meetings, Our dreadful marches to delightful measures. Grim-visaged war hath smoothed his wrinkled front, And now, instead of mounting barbèd steeds To fright the souls of fearful adversaries, He capers nimbly in a lady's chamber To the lascivious pleasing of a lute. But I, that am not shaped for sportive tricks Nor made to court an amorous looking-glass; I, that am rudely stamped, and want love's majesty To strut before a wanton ambling nymph; I, that am curtailed of this fair proportion, Cheated of feature by dissembling Nature, Deformed, unfinished, sent before my time Into this breathing world, scarce half made up, And that so lamely and unfashionable That dogs bark at me as I halt by them-- Why I, in this weak piping time of peace, Have no delight to pass away the time, Unless to see my shadow in the sun And descant on mine own deformity. And therefore, since I cannot prove a lover To entertain these fair well-spoken days, I am determinèd to prove a villain And hate the idle pleasures of these days. Plots have I laid, inductions dangerous, By drunk prophecies, libels, and dreams, To set my brother Clarence and the king In deadly hate the one against the other; And if King Edward be as true and just As I am subtle, false, and treacherous, This day should Clarence closely be mewed up About a prophecy which says that \"G\" Of Edward's heirs the murderer shall be. Dive, thoughts, down to my soul -- here Clarence comes!", "jobi_muraneyil": "Love the life you Live!!! Live the life you Love", "i_am_._batman": "If you are good at something, never do it for free.", "avinash_aaron": "@aranyajohar one of my quote from my fav actor. “My goal was never to be the loudest or the craziest. It was to be the most entertaining.” – Dwayne Johnson", "enjayde": "If we are not free, no one will respect us - A.P.J.Abdul Kalam", "opal__in": "\"loneliness is a sign you are in desperate need of yourself\" -rupi kaur", "k_e_n_i_l": "@aranyajohar you are so beautiful 😍😍 and ur smile❤. Secret admirer😇 and i just love ur poems and the way you present it 👌👌", "gotnoishu": "we're all just prisoners here, of our own device", "sheartw": "Issues by Julia Michaels check that out 😊", "antonyarakkal": "If quotes could make us feel better..... If.", "rravii": "😍😍", "nomadicsuitcase": "If you can dream and not make dreams your master, if you can think and not make thoughts your aim, if you can meet with triumph and disaster and treat those two imposters just the same... Yours is the Earth and everything that's in it!", "x._.rps._.x": "@aranyajohar When people forget their priorities they fail", "himanshi2o": "You could listen to Young God by Halsey! 💕💕", "vaishali62442": "@allan_oommen_ thistle and weeds*", "themalluganguly": "Pleasure's all mine", "sahcabrera": "The whole of Hurts Like Heaven by Coldplay ❤", "navgoyal": "Beautiful 😍😍👌👌", "aranayasharma": "You are beautiful", "iamthoyaj": "Don’t walk in front of me… I may not follow. Don’t walk behind me… I may not lead. Walk beside me… just be my friend! ~ Albert Camus", "ur_avrg_friend": "I've fallen for eyes but they don't know me yet. (No pun intended. Maybe.)", "j.rdiaz": "💯💯💯💯", "kundan__shukla": "looking gorgeous ....sister 😊😊😊😊😊", "tharif7": "My aunt raped by her husband but marital rape is fine, pucker up.. Its a mad design get in line 🙂 source- A Brown girls guide to gender by Aranya Johar... She nailed it 👏🏻👏🏻@aranyajo", "amulyakundran": "\"You'll see purpose start to surface, no one else is dealing with your demons meaning maybe defeating them could be the beginning of your meaning, friend.\" - twenty one pilots 🌸", "ankurwat": "\"I sell ice in the winter/ I sell fire in hell / I am a hustla baby / I sell water to a whale!\" jay-z", "aranyajohar\nVerified": "Verified", "thedreamylass": "I've died everyday waiting for you..darling don't be afraid I've loved you...for a thousand years...I'll love you for a thousand more.", "rishabhjain654": "👌❤️", "the.prolific.wordsmith": "A quote for you, It's just to windward & sounds travel longer distance in dark nights.", "gundhar": "Me", "tango_2608": "In this Paradise I dwell And spend my life on making it Hell Even though does jihad emphasise The achievement, after death, of Paradise.", "vinothshivan_coimbatore": "Wooooo 😍❤️", "vishaldass7": "Best time to plant a tree 20 years ago, the second best is today. \"Work harder on yourself than you do on your job\" \"All you have to do is to conquer the world u must conquer Yourself in first place\" Inspiration will gets u going, Self-discipline will makes you growing.", "nishreeta_k": "I'm literally your fan.....bcz of the women's day poem😢🙆🙆🙆🙆🙆🙆🙍🙋🙋🙋🙋🙋🙋", "revolutionandpandas": "\"The whole world, it is sleeping, but my world is you\"- Bloom, The Paper Kites", "alezzandrarodi": "\"I'm a little bit lost without you\" - oh wonder", "pauline_darras": "\"I'll step on a grenade, so you can see I'm the bomb\" - Smile, The royal Concept", "allan_oommen_": "Plant yourself with good seeds don't cover Urself with thistle and seeds rain down on me.... Mumford and sons", "shubhwho": "Do i dm u mine? @aranyajohar", "ippliya": "When I speak everyone look out at me ? The same way I do ? i Wonder. 😃", "puffle.o.pegus": "AW U QT", "sahilspatel9": "I could hear my heart beating. I could hear everyone's heart. I could hear the human noise we sat there making. Not one of us moved, even when the room went dark.", "alex___duran": "@aranyajohar You're so pretty <3 You are my favorite, I think that all world should hear you.", "thisisenkore": "\"Coolin\" - Coolin", "gandheeji": "You're pretty!", "knit.ya": "\"Take a sad song, and make it better...\" by The Beatles (Hey Jude) :')", "therealmurali": "This too shall pass", "thelostquote": "Your memory is a monster; you forget—it doesn't. It simply files things away. It keeps things for you, or hides things from you—and summons them to your recall with will of its own. You think you have a memory; but it has you! ( A prayer for Owen Meany - John Irving )", "anirudhvenugopal": "\"in the clearing stands a boxer, and a fighter by his trade, and he carries the reminder of every glove that laid him down or cut him till he cried out in his anger and his shame, 'I AM LEAVING, I AM LEAVING' - but the fighter still remained.\" The Boxer, Simon and Garfunkel", "meghalsheth": "My fav quote is - 'this too shall pass'... Which helps me get through both good and bad times. It's surprising how it perfectly fits in both the circumstances.", "kinglillyaf": "\"You dont have a soul you are a soup , you have a body\"", "anjcuacoyes97": "So pretty 😍"}