{"_trophiez": "Muffin tops.........it doesn't matter", "anisha.223": "N also skin colour, marks that we score in an exam....of course grades are important but they do not always determine our future. ...there are many people who had not scored good grades but they are now very successful in life...moreover no one should worry about comparison...", "raidubnation": "Money", "himani_chand25may": "@aranyajohar perfectly said girl...🙋", "tellsaboutme": "Last one is wrong.. people remember it and I don't remember :P", "destoeknee_": "changing for people", "paroma.mehta": "33.9k aree waah", "iloveunicornsandrainbow": "And how does one stop worrying about such seemingly minor things? How does one re-wire their brain?", "aranyajohar\nVerified": "Verified", "nitin0g": "Stop worrying about others but you should worry about yourself that junk sweet and more making your self worse day by day eat clean and be fit :) and ignore others", "krutikabagrecha": "About grades", "tembulwar": "About future.....live in present", "vashisth00": "@saloniswaika99", "saloniswaika99": "@vashisth00 Aapke dil mein. <3", "r.skb": "Appearances or facades ! However good or ugly we think we are...it's only temporary 🤗", "kalashvikov": "1 slice won't make me fat...that's why I have more than 1", "minumoh": "@_tj.exclusive_", "sharayu__music": "@maithiliraut", "ii_areejshahid": "@i.haveno.name", "akshata_shah_": "The burn scars?", "ashwin_d_vora24": "We should stop worrying about what others speak, think and react.", "rithwik_singh31": "Stop worrying about failing in Exams 😂😂. I know it sounds weird but still", "anankit.skywalker": "Oh you were talking about physical Insecurities. Height?", "soberlad_23": "Losing hair 😥😥", "avichal_dani1308": "Stress of MBBS 😂🙈", "siannagomes": "About satisfying everyone", "iamshaileshkurle": "About not having a girlfriend", "_kashif_rahman": "Well I think that we should not worry too much about the negativity that surrounds us and get depressed with the world rather we should be optimistic and always be happy may whatever happens, do you agree with my point @aranyajohar ?", "gracie_ariana_": "About being what society defines 'normal'. 🌹", "kaygee_1978": "My imperfections are as per someone's perception... I perceive them to be me ...my strengths !!", "santhgates": "@dhanam_jeyan", "electricdreamz5": "But you should worry about acne because it's your bodies way of telling you that you are doing something wrong...not everyone gets acne! Stop consuming dairy and eating processed food while limiting dead animal parts, you will see your acne disappear or never start in the first place:..", "rachit543": "Girls not replying 😂", "twinklesakariya": "About d way ppl thinks abut us...abut our body,shape,structures n evrythn which set back u frm being who you are...@aranyajohar", "karanagrawal05": "Iske baare me Versova me baat karte hai 😋!! @aranyajohar", "cuzzzii": "Being short 😂", "vidhi_.9": "Grades... @aranyajohar", "komal_annaldas": "We should stop worrying about people who judge us regarding anything we do.", "simply_aiming_": "Past😩 and things u can't control", "porishmitaadutta": "Post -surgery scars they are normal as well.. But then I am tired explaining it to people around who constantly stare at them.. I mean it bothers me.. It does😐", "mehulraw": "We should stop worrying about What other people think!! When We'll have \"Kya Farak padta h \" kinda attitude then We will be absolutely free.", "moumousalma08": "Being ourselves", "sinjita_mohan": "Stop worrying about being short,fat,dark and many more. Just be happy with yourself", "dszurb": "Not being pretty like the next girl", "vee_thikadas": "Yes.....", "simu_gandhi": "Worrying about what people would say to us being a gay/lesbian, making a career choice different from the mainstream", "bandita0.5": "We should stop worrying about our future, and just go with the flow of life. :))", "thatmolekid": "We should stop worrying about body shaming , bra strap shaming , slut shaming. Just breathe and make everyday productive.♥", "debalina____": "Obesity the common one 😑", "_shrishtiiiiii_": "Body shaming, scars 🙃", "nikigujar": "@aranyajohar colour complex", "dhruv_deshpande": "small faces😙", "avaneemalhotra": "Dark circles, because worrying about dark circles makes them darker 😁", "klausl123": "Hair loss 🙈"}