{"mswaraj143": "Hats off you r such an inspiration the video gave me goosebumps", "akhila_reddy.s": "Waiting waiting ❤❤", "beingyadhu": "In my point of view, It was too quick! I mean your dialogue delivery. And also brown girl's guide to gender is better than this ! Otherwise you did a great job 🤗 hats off @aranyajohar", "bhumika_jindal": "Inspirational 😍💯", "coconutsushi": "Watched your video and pledged to go without foundation to turn myself into \"Desired complexion\" ... Girl it's high time we embrace our skin and for me it starts today ... Thank you ...", "pranav.jamwal": "Beautifully crafted", "preetiiiiiiiiiiii": "Plz aranya make a video on old thinking. Like girl should know to cook, girls should be virgin,etc. And mostly if boy is not virgin that fine but girl should be virgin such thinking and boys can roam around world by wearing shorts but not girls. Plzzzzz make video on such thinkings and if hindi is possible and plz make in hindi. Its a humble request", "deepikapadukones_world": "U deserve every bit of respect😘😘😘😘😘", "simran.mullani": "You nailed it....... Touched.....😍😍😍😍😍", "nandiniramnath": "I loved the video so much ❤️ You're amazing and so inspiring ❤️", "faizkh4n": "you are an truly an amazing speaker. Hope you make more such videos soon!", "iamjagritip134": "girl @aranyajohar I have become your big fan...♥♥ as today was just scrolling my feeds and I found ur video..I watched it and then I just watched all ur videos...those are amazing and so inspiring...u speak what women really goes through...I was like this what everyone needs to watch...each and every single word touched....I was like this is what I also always wanted to say the world.....lots of love....keep posting more videos 😘😍😘💋💋🙈💥", "mark_bothelo": "Well put 😍", "ashersmusic": "Won't be able to come but I hope you upload a video of the show on YouTube. I would love to watch it", "sharishirazi": "JUST SAW YOUR POEM ON PEOPLE OF COLOR AND I JUST WANT TO TELL YOU THAT I LOVE YOU SO MUCH FOR THAT! YOU GO GIRL 💖💖💖", "denadayalan_nayakar": "@aranyajohar Don't Forget To Visit #Pondicherry #Puducherry #CityOfDawns #FrenchColony 🇫🇷 & #Brihadeshwara temple in #Thanjavur Is the First Temple in World Made Of #Granite #UNESCO #CHENNAI 🌊🏖 ✈✈ #Auroville #InternationalTownShip By #UNESCO #Maduari #MeenakshiTemple #Top20 Of #7Wonders of World ✈✈✈", "lexi.wes": "I love you, your skin colour and everything", "unerasepoetry": "So proud!", "g_aravinda": "I feel privileged to get an opportunity to hear you. You were right, when you said art needs encouragement and you were right, when you said its the mentality which has to change and you were right, when you said art can bring change. Though lot of people know it is important to speak out and our ideology can be stabbed, so we shouldn't let that happen. We just let it be. So congratulations and keep going cause you have that potential @aranyajohar", "shipra_pal_99": "Yeh Aranya... Too good...I am a brown skinned girl... U r the one of changing our stupid society...", "superr._.bored": "💃💃💃💃💃💃💃", "griffin_the_clasher": "Oh", "hari__prasaath": "Amazing pic", "love.lakshman": "I love that👩🏽", "iaamirrayzada": "Nice", "sharma.8692": "Kya bat kya bat👍👍", "effortlesslymee": "It was just amazing! Breathtaking", "amarjeetsharma17": "AWESOME", "arty_tyagi": "Come to Delhi!!!!❤", "adrijaroi": "Poem was amazing😍...You are such an inspiration. Everytime I see your your videos, I learn to admire and accept myself however I am💞", "dawoodsoobashahh": "After mamata banerjee, your voice is the most daring ive ever heard. 😏👌", "aakashi._": "The poem was so influencing.... God bless! 😍😍inspirational", "namisha_mishu": "Hats off to your confidence girl 👍", "shreya.raheja": "Yayy ❤️", "sabirchetri.7": "The 'goosebumps. ' creator💛👍👍", "narsim206": "Liveee yayyyyy 😂🎉", "axjunx": "Okay I'll wait", "sunnykabbinada": "Loved it girlllllll. More power to u.", "sid_r_28": "The poem was amazing!!!loved it💕👌", "aree.zz": "The video is so amazingggg.❤💫", "_.palash._": "🖤🖤🖤", "konica1921": "U r such a girl that will for sure bring reforms. U r amazing and so r ur poems . Such a beautiful and noble soul. #superwoman ... waiting for more 2 come.. lots of love ❤️", "philosophy_baba": "That vid was fantastic @aranyajohar ... It inspired me to do something like u .", "gajenderthakur": "👍👍👍👍"}