{"_sa___ga_": "Practice..practice makes it perfect..", "vishaldass7": "Repeat! Repeat! Repeat is the old classic quote works all the time. Kobe bryant the legend of basketball player who never take a break till he gets his 400 shots.....", "ashwinipeter": "Speak with your inner voice, speak whatever comes to your mind.", "haveumetpiggy": "Since you wrote those lines remember how you felt while writing it and feel it while your saying it, I bet it will work. Feeling will definitely connect you with the words.", "rohit__mehta96": "Join toastmasters ans give the same speech 2-3 times , then u will not forget it.", "gautam_yadu": "Always try to learn from you!", "bhaveenjoshi": "@aranyajohar do it by brain mapping", "abbaaaae": "Create a story with the words you'd forget! I'm sure it will keep the words coming and you won't forget!", "udhaya_abinaya": "Maybe you should start preparing or biharding them a month before the video. Then you would get the flow of words and nothing would be missed.", "sreenivasgayam": "do one thing speak from your heart that is the best way to remember in fact you need not to remember what you wanna speak just go from your heart.", "ban.slayy": "😻u b the Besttt❤", "merabhaidaaniyal": "@aranyajohar badaam khaao bro", "utkarshh_kumar": "U r a wonderful speaker... I'm fan of u n ur Inspiration lines😍", "jharna_29": "U should learn everything thoroughly at night and then sleep. Revise once in the morning and u will notice you've learnt everything.", "jahnviiiiii7": "Practicing can enhance your memory before you make an actual video practice 4-5 times & learn everything by heart", "shreyaahahahaha": "Practicing in front of the mirror is the best way ...and also u can learn in the ways u learn lyrics ...songs are the best way to mugup 🙂", "srivastava_anushka6": "if the lines come directly from your heart you dont need to learn it then", "xvogue.vibesx": "Keep on writing it a million times until u know it by heart", "chiru_sree": "Happy friendship day 👫", "kartik896": "Get up early in morning at 3/4 am recite u will remember", "writer.saheba": "Hey Aranya! Please check your dm!", "shreyarangnekar_25": "I salute you @aranyajohar love u and your poetry’s are so damn inspirational", "itsvinayunique": "😍😍😍", "klausl123": "Most importantly: while you repeat a line over and over again till you really memorize it, you have to walk through the room addressing a virtual audience, because otherwise you will remember everything perfectly whilst sitting but you might have a hard time remembering your lines standing on stage. After the first line is memorized you do the same thing with the 2nd line but don't forget to regularly start to repeat your poem from the very beginning so that you not just remember every single line but also remember which line follows the next one.", "euri_lifeink": "Let me know if it helped 😁", "mark_bothelo": "Cute 😍", "gaurii_013": "Placards would do !", "beingraz_official": "1. Number the sequence of topics you need to cover and make a rhythm out of it. 2. Practice it few a times. 3. When you speak it just consider that you re the one giving speech about it to yourself only. And how good ll you sound when you speak it in your voice. 4. Following this process you ll have the speech in your heart, just give up on a fobia that you don't remember it. Cause there is nobody else who can memorize it and can speak it better than u can...", "sksroyal": "Switch to patanjali chyawanprash.... Memory badhaye 500 pratishat....", "hebahh": "record what you have to say, then keep listening to it like it's music", "monster_rofl": "Your random pix are more osm... Plus your poems😍😍 damn🌼", "rohan_parekh95": "Eat badam", "myheart_whispers": "@aranyajohar maa'm you have been a great inspiration...can you pleaae check my work on my page...I would really me blessed by it...😊😊", "ashishat13": "Use a teleprompter kind of thingy 😂😅", "rigpsy": "More sleep. Less coffee", "ananyakharidhi": "just connect all of your lines in a way that makes sense to you. use acronyms, funny words, whatever, to help you remember the order. 💙", "_.ridhoee._": "Aranya, Can you please check your inbox for the message I sent you. Its REALLY important. Thank you :)", "deepanmagilan": "Make a hint word for those lines and find a way to sync it with your flow, so that you wont forget 👍🏻😊", "aborphukan12": "That brown girl... dot dot dot dot dot dot dot..", "shreya.raheja": "You've gotta learn them by heart so it comes out itself even when your brain ain't helping you remember. You can do that by giving more time on rehearsing and practising. Also, making a link with the keywords in each sentence can be a great help.", "mridul_rathi": "Two words: tele prompter (before anyone gets offended I'm joking)", "_devwritessometimes": "@aranyajohar record yourself and put it on loop..👍", "himanshi2o": "Read it out loud. Record it. Listen to it on loop!", "r.skb": "Spend more time, practice multiple times. Record yourself...critique yourself and soon enough you won't make any mistake twice !", "medhu.vadaaa": "Use mnemonics", "suman.ghosal007": "Wow", "ashoi.d": "When I was younger, I'd remember paragraphs with the starting words. I'd make a sentence with the starting word(s) of each paragraph and if it was a poem, I'd do the same for each stanza. That way if at any point I forgot, I'd quickly go through the sentence, and continue.:)"}