{"rosesofme": "Do you think a girl with dark body hair basically everywhere needs to remove it all? I don't want to do this but I'm freaking out what people will think about it when they see me in a bikini.", "diana_madalina0000": "How are you feeling now since you start a vegan foodlife?", "kynga119": "wow beautiful <3", "nicinnarnia": "Why did you started with YouTube? 💛", "sydney.fletch": "Where did you get your extensions from?😍", "tiffany.dawn15": "@loey.lane @loeybug you have got to do an allcosmeticswholesale.com haul!! It's #amazing!!!", "mvlinb": "Loey, you are amazing, and what you are doing for yourself and others is amazing. you have helped me gain confidence and to think positive. I'm still not the most confidence person, i still can't dress in whatever i want because i feel like people would judge me. But i have learned that i just hurt myself if i think badly about myself. So i just wanted to say thank you for everything you are doing 😍", "abbydischer": "When you are brushing your teeth, do you put the toothpaste on and then get it wet or do the opposite? Btw ily and your videos❤️", "kingaj2018": "Good recipes to try?", "redneckclassy228": "Hair growth tips! @loeybug", "sara.meadowss": "Do you ever think of having kids ?", "mvrissxn": "How do you deal with all of the jugdement towards you, btw love you!! 💘", "jahna.cana": "What are some of your current goals? & if you can change one thing about your past, what would it be? :)", "lyssylouuu": "Would you ever do a how-to on contouring with stick foundation/concealer (like the fit me sticks)? (:", "oneshotbeyond": "With fall coming where do you shop for wider cute boots? What self tanners do you love? What's your least favorite chore around the house and why?", "devyn_plett": "What is your favourite vegan/vegetarian food?", "romy.wood": "😻😻😻👀👈🏼", "kyasamuels": "@ayr.ania", "peytonphillips1": "Are you a traveler or are you more of a stay at home type of person?", "georgia_876": "@molly_fuda", "ellineko": "Sei bellissimissima!!!! 💟💟💟 @loeybug", "obx_bishop_": "@loeybug My question is why are you so beautiful 😉😚", "their_momma2": "Oh @ravynpop please talk to someone :( you're so beautiful and worth so much more than what people say/think about you. Pray about it...it will get better. I will pray for you.", "nicolehaskins": "@loeybug my friends and some family tells me that I look gorgeous with and without makeup and then I have the rest of my family tells me endless you have makeup on and hair done we aren't doing anything. My question is how to deal with this situation.", "mandy_rene3": "Any makeup tips to help green eyes pop.. Besides purple and green eyeshadows/eyeliners I already do that", "birdie_1998": "What's your favorite memory from your childhood? By the way, you are such an inspiration, love you!💕💕", "yvetterees73": "So pretty", "fitinmy40": "Have you ever been to Europe and if where? ❤️ to you from Denmark", "sinakatarina": "So beautiful 😍", "___keilani___": "Can you do a back to school lookbook for highschool?", "memoleluna": "You're awesome!!", "boldly_girl": "Beautiful im a fan", "rgeloeschhht": "How did you got so confident", "yeyaslife": "When did you start wearing makeup? by the way, love your advice on body positivity!", "chen_bas": "Have u ever visited the Caribbean? If so what island/country? If not would u ever and where would u go? 😊p.s I luv u btw I watch every one of ur vids...", "queen_crista": "What is the hardest thing about being so confident and brave in this world full of hate and how do you deal with all of it ?", "kuzynskit13": "What's your favorite kind of pie?", "rosalinnieliwocki": "What music do you listen to?", "rinaa.michelle": "What is your favorite color to wear in each season? What color do you hate wearing?", "diosa_elisabeth": "Does it become difficult to always be body positive?", "blah___00": "How can you deal with social anxiety", "bek.schu": "Do you have any advice for teenagers on confidence? I don't have that much and I want to try to have more for my sophomore year of high school", "lupitaa__f": "@loeybug have you always been so confident? Or how did you build your confidence", "emilyartful": "What advice do you have for someone who is contemplating suicide or self harm due to constant body shaming? What do you do when you feel like you can't take the pressure anymore and you can't ignore the insults?", "boardingar": "What animal would you come back as in your next life?💗🐘🌞", "peterakashs": "How do i adjust to a healthier lifestyle like you? Thanks babe, you're soo inspirational and ily ♡", "askoomson": "@alispeciali brighter face 👍🏾", "kelseygrizzaffi": "What's the best date you've ever been on?", "andielovesbows": "What would you like to do as a career, besides Youtube?", "tathianarycquart": "What is your advice for teenage girls who are struggling with their body whether they are curvy or slim?", "elliedotcom": "Omg hair tutorial! So gorgeous", "invisible_girl93015": "What/who helps you get through the tough days?", "heatherxflowers": "@loeybug as a plus size teenager I always feel like I'll never find a guy who will find me beautiful. Any advice ? Btw your amazing ^~^", "__isa_merp__": "Which set of makeup brushes will you recommend from drugstore and high end", "chikinjoe_": "Whats ur best tip for makeup on blue eyed people", "kyliepatrice": "@loeybug does your family support you doing YouTube? I love you so much girl 😘", "mmarisol.xo": "@sitamun82 si tiene su canal en youtube creo es bajo el mismo nombre. 😊😊", "itsashleebaby": "When you're in a funk about body image, as many of us struggle with, what self care skills do you practice? And how often", "sarahdaniels.jpg": "Would you ever cut your hair short? 💇🏼😬😜", "jarynraekuoppala": "How do you have so much confidence? I mean I try to, yet it seems like your also confident l", "ally_breitfeld": "What have you been reading lately?", "ixelgirl": "Any self care advice for a plus size gal who's trying to get her confidence and health back?", "mariaml_g": "Qué maquillaje usas, de qué marcas? has hecho tutoriales al respecto? Dónde puedo encontrarlos? Eres bellísima @loeybug a big Kiss from spain", "inklacedfeather": "I can't think of any questions but I just wanted to say I think you are absolutely beautiful. Inside and out. You have made me feel so much more confident and happy with myself and my body. Thank you so very much for being you. @loeybug", "k19m98berly": "What are your favorite plus size clothing stores/ where do you shop?!!! Btw your gorgeous and ily💞💯💘", "xkaylaamarieex": "fave let's play channels? love you girl!! :)", "plainjoyce": "I like this guy who works in my building... and he acted friendly enough the couple of times we bumped into each other alone in the elevator - problem is I want to know if he's the type to only date a \"Barbie\" girl or if he is willing to branch out. How do I approach him and ask? (He's Caucasian, and I am soooo not.)", "dedeihuns": "I'm moving to TX in the next couple of weeks. Any book/s you recommend to read for the road trip down there? You're such an inspiration and just a gorgeous human being. Love ya lots! 😄😄💜💜", "claudiapan4": "Did your body ever interfere w your love life ?", "sarahmurpphy": "fave lip color", "beautyaunt": "Where did you get your blue top oMG it is so beautiful", "xx__emmy": "Loey, you are such an inspiration for girls everywhere of any size and you are absolutely stunning! Do you still get body shamed online or in life? Or have people finally stopped being so cruel? Xxx", "ldegley": "Do you like being an army wife And moving around? Where did u grow up? :)", "rosssi____e92": "I came across your channel from that viral video that shamed plus size women for wearing 2 piece bagging suits and even though I'm not plus size, I see you as a role model and inspiration with both fashion and makeup, have you ever thought of modeling as a profession or even on the side? you are so beautiful, how have you not been contracted!", "katrinaa.gagnon": "What is the one thing you absolutely need to do before you die?", "_erin.bonham_": "I'm about to start my freshman year at college, any tips on how to be myself? I feel like I can start over and truly be who I am but not sure how I could go about it???", "breanna.j.s": "Any advice for incoming high school freshman?", "_paradazes_": "Any college advice and tips for upcoming freshman like myself 😊", "muniibagz": "Do you have stretch marks? If so, how do you feel about them, and do you have any advice for your viewers with stretch marks? @loeybug", "melloncakes": "Kyo!", "kayla.cottrell_": "What's the best way to match foundation to your skin tone? Also, how much should I use? I know that's a question that depends on me but I either don't get enough to get the coverage I want or get too cakey! Thanks, much love ❤️", "leahgable22": "What's your favorite tv show?", "iridescent_madness": "I don't know if this has been asked but how did you start blogging? Like what did you talk about? How did you get more followers? And what site?", "millietruong": "How excited are you for New York with me (millie) and nabela?☺️😏❤️", "shellybutton7": "Do you have any suggestions for girls with hooded eyes? I have a hard time recreating some of yoyr greatest looks because of my hooded eyes. I love watching your videos. Thanks for being so inspiring!", "soukainalazar": "Do u ever wish u were thin just to be able to fit into most trend styles perfectly? I mean generally smaller sizes fit better especially with the new styles nowadays, even basic shorts fit better when u r skinnier and look better, so what r ur thoughts on that? And also if u had the choice would u be skinny with a toned body or just the way u r now? Thank uuu already and looove u <3 !", "sarah.nicole.olsen": "If you were only able to use one makeup product for the rest of your life what would it be?", "ataortega": "How do you make your foundation look so natural??? @loeybug (btw it look perfect)", "audrey.dawn": "Have you learned/changed a lot since you've been on YouTube?", "faith_lynn_16": "Why did you start your youtube channel", "martaelidaa": "What is something you know now that you would like your younger self to know? I love your videos thank you for every inspiration 💜💜", "jess.rodriguez87": "Do you ever touch up your blone at home? How do keep up with the root growth maintenance? #help #loveyou", "jaceyjardine": "how was your day?? (ilysm xx)", "tymbrezoe": "At what age did you realize self love and acceptance is the answer and what helped you to do so? 😊", "mindythoerig": "How come you haven't done too many makeup tutorials lately?", "z.a.1117": "❤️", "brighterspark": "How do you deal with pressure to change your lifestyle to be skinny? My brother and dad have dreams of me being a super skinny blonde cheerleader. But I'm a nerdy musician. What do I do??", "devitchka_25": "Favorite games to play to unwind? <33", "elisewagner206": "Coming to Seattle any time soon? 😋", "_vivii_lee": "What's you favorite Outfit at the moment? 💜 Love you 💜 u r beautiful", "letsgetweirdtogether": "Would u ever get tattoos and if yes where?😱😂", "nicki_sunday": "Will you do a meet up in the Tampa Bay, Florida area? I love you <3 and I want to meet my inspiration", "bellagood22": "Can u do a back to school haul like asap😭😭😭😭!!", "mlee_09": "Do you remember meeting me at Oak Park mall in Kansas?😁But serious question now, What is your favorite lipstick brand?😊(it's national lipstick day so I had to.)😉", "cassie_marie34": "if you could go anywhere in the world, where would it be and why? :) ps: love you @loeybug", "emmafranz": "Have you moved houses yet?", "katie.merwin": "What are your best recommendations for beginner makeup? Like drugstore products", "searching4sophia": "Talk about your relationship with anime", "emilypm_": "What makes you happiest?", "heyteeny": "Is fruits basket the only manga/anime you enjoy?", "piecesofautumn95": "When and how did you begin to love yourself and feel more confident?", "cassrost_": "when i put foundation on it doesnt look like its one color more liney and such. and i not putting enough on or applying it wrong?", "viv.cobos": "What tips do you have for people who are trying to improve their self-confidence?", "originalmsshasha": "What are your \"Top 3 makeup must haves\" and/or \"Top 3 beauty must haves\" right now? Look forward to the video!", "mystique.manns": "If you ever come to Australia, can you please do a meet up! I love you so much!", "alyse_penson": "Advice of young woman to be confident? Your an inspiration", "kelsey_vavak": "Favorite plus size stores? (On the cheaper side) 💜", "shellysmeets": "Do you have some advice for girls who aren't feeling comfortable in their own skin? You're a true inspiration ❤", "nxc_o": "whats it like to suddenly be an inspiration to so many girls? I love you Lo, youre one of my greatest role models to feeling pretty xoxo", "simplygenesis": "What are your top plus size fashion brands that you would recommend to people on a budget? I want to dress nice but not be poor haha", "asapreety": "Who is your greatest inspiration? Btw you're beautiful both in and outside !☺️😍", "swishytailstitches": "my powder never seems to stay on my face very long. any tips on how to remedy this?", "colonelpink": "@loeybug have you tried Arbonne products? What are your thoughts on them?", "scamperlily_unedited": "Do you ever get jealous of skinny girls? Not that you should be! I mean you are gorgeous! But I just wonder, do you ever see a tinier girl and think, why not me? But please don't think this! You are legit beautiful! Sorry, just a question.", "someone_knows_my_lover": "Did you ever have any strechmarks and if yes what did you use to treat them? And in general do you have any advice how to prevent them? @loeybug", "ash2dust115": "ILY Loey! What games are you playing lately? Are there any your awaiting the release?", "cinnabunbunn": "how do you stay so positive and confident about your body 💕 love chu", "lmart1130": "Do you have any good make up tips for a beginner who doesn't use makeup on a daily basis. What would be a good place to start?", "marygracegambino": "What is your favorite liquid lipstick range? I can't decide what to buy with so many out there! 😁😘", "kelseykreme": "If you could go back in the past, what would you tell yourself? Also, how do you feel about being such an important role model to young girls.. Big and small? What have you done in your life that has made you the most proud? :) also, LOVE YOU 😍😍😍", "maddie.bantin": "Who is your inspiration and who do you look up to?❤️", "ah_keuraeyo": "You're so beautiful. Is this size comfortable for you? Do you care if you get bigger or if you did. . Would you try to lose to be this size again? Just curious. Either way - love the blog! wish summer wasnt over , ive been showing my wife all of your bathing suit pics to inspire her to come out of her shell.", "cyn412": "What advice can you give to a newbie blogger?...Also your amazing!! ❤❤", "an.honest.momlife": "Where do you see yourself in 5 years? Do you think you'll still be making youtube videos?", "sydney_yopp": "What made you so comfortable in your body?", "kelliear": "What products are you wearing today? And how do you get to the point of saying I'm \"ok\" where I'm at... Not having to constantly diet to \"be better\"??", "pingerrain": "Hi... I am also plus size but I have lots of scars on my legs and I dont really like my arms. I always have problems wearing short skirts because of my legs and sleeveless because of my arms. Do you have any tips or advice??", "ally.grimaldi": "Who are your biggest inspirations? Love you, Loey! ❤️", "joshuas_fiance22": "Why are you so gorgeous??? 😍😍 Love all your YouTube videos!! You are inspiration!! 😆😄 @loeybug", "omfgell": "who's your biggest fashion inspiration?💖", "klovegal22": "Where is that top from?? @loeybug", "southern_belle342": "Do you have any tips for dealing with BMT? Kinda struggling with him being gone for this long.", "becca_kittridge": "Do you have any advice or tips for high school?", "katerinamiska": "Tips on how to study/prepare yourself for exams x", "kimkittybutt": "What is something you enjoy doing besides YouTube ?", "alandmermaid": "How to feel confident running as a plus sized woman? I have been feeling so embarrassed about it lately.", "brittaniek18": "@loeybug how do you deal with negative critics as a young plus sized women??? Xoxxo love you girl", "maddieoustrich": "What is your all time favorite makeup product?💄", "marisa_baylor": "What to do if I need help gaining the will power to change my life. I am constantly telling myself horrible degrading things, but when it comes to actually doing anything about it, I tell myself to embrace what I have. I am tired of the back and forth, happy and sad. Please help!", "stephaniebiela": "How do you maintain your positivity? I know you're human and experience emotions like all of us, but you portray a strength and amazing attitude in all your videos. With your busy life and all the attention coming your way, how do you maintain your sanity and sense of self while continuing to put out such positive messages? Do you have any habits/routines/rituals that keep you grounded? Thanks so much! Love the videos and what you're doing! 😘", "k_enady": "how is your skin so flawless-looking?", "elizabear_fincher": "How, just how do you get an even tan on your back?? I don't understand...", "stefanienixole": "Is it surreal to know that you're constantly changing lives for the better?", "desijane84": "Hi girl what is your favourite quote?", "sadxgirlll": "How did you learn to accept and love your body?", "_bibicorrea_": "What's your favorite curling wand?", "eryngraham21": "What is the hardest and best part about being a military wife?", "old_fashioned_flowers": "How did you become so body confident, was there anyone who inspired you to know your self worth?", "sarahannesmith_8": "At the bar in the back", "_mysticmoonchild_": "Hey Loey i want to know if you have any advice on being uncomfortable or just plain being afraid to be around people because of what they could be saying?and to being afraid to take pictures because you don't like how they look? Xo", "xolindseylou": "what is your favorite decade?", "ashleybongar": "Talk about weigh fluctuations?", "karena_taylor_": "This is kind of a personal question, but you said you used to have an eating disorder...and so did i a few years ago (been recovered for 5 years) and was just wondering how you recovered and who was your biggest supporters? Love your videos btw!❤❤❤❤❤💋💋💋💋💋❤❤❤❤", "jessicabreeann3": "Do you have any suggestions for plus size clothing companies that are affordable? I rarely get things for myself. Also sizes are so different in each brand. Online shopping intimidates me because I can't make sure the items fit properly.", "shaest.j": "How do you feel comfortable in your body? I feel uncomfortable with my average size body even when the doctors say I'm healthly @loeybug", "ratedpwf": "Those eyes tho.", "victoria8397_": "What's something positive you would say to a heavier girl to feel happy about her body ?", "fieryforte_": "How do I stop worrying about what other people think of my body? How do you do it??", "chantalchipman": "How can you wear skirts or dresses without wearing leggings or tights underneath? If I wouldn't wear them I would be sore cause my tights are rubbing against each other and that hurts urgh so please tell me a trick or something xx", "kawaiipotato6669": "What would you say to a plus sized girl who has a dream of being a model?", "alainalastovica": "When are y'all planning on having babies?!?!:)", "ellievevers": "What was the scary thing that happened with you and alex on the last day of your trip to LA?!", "caraanna9": "Do you ever worry about how your public persona now could effect future job opportunities? I so admire your strength and all you stand up for!", "jesshoward19": "Is jolteon your favorite pokemon?", "ainegrace_xx": "Whats your favourite colours to wear with black?", "oliviavigilphotography": "Do you have any advice for plus size brides in regards to dress shopping? How to flatter your figure ect... Love you girl!", "jess.icadiehm": "@loeybug what's your favorite season and what do you like most about it? 😊", "definedbynikki": "Do you keep friends/family in your life that do not support the body positive movement?", "happycrazylove": "What is your advice can u give me on wearing my two piece swimsuit, i put it on just can't seem to make it out the door. Help !!!!! :/", "iamautumnray": "How tall are you?", "cayla_patriciax7": "Loey you're absolutely amazing & perfect in every way. Don't ever change for anyone or anything in this world because you've helped me a lot since I have discovered your videos. I wish I had a question to ask you but you've answered so many, none come to mind. Thank you so much girl!💕", "samanthaxtina": "What tools do you use to make your hair look so good besides the nume curling iron😊😊😊😊😊", "k8stratt": "What is your favorite thing about YouTube? @loeybug", "iiiamcheekss": "Senior/ High school advice", "aoibhinn_harper": "Who is your biggest inspiration in life?", "ginny.caton": "What is the best thing about doing YouTube and the worst? You're awesome and keep up the great work!!", "amelia.buttigieg": "Were you ever self conscious or just born with confidence?", "miranda_elizabethhh": "How do you stay so confident while posting pictures in your bikini and people reacting negatively? You're so beautiful but I could never be confident enough to do that at the size I am now.", "alispeciali": "@arieg0ld kinda the make up look I was hoping for today deep down inside", "sydneyybuschh": "@loeybug what is your favorite makeup brand? High end or drug store doesn't matter! Stay gorgeous girl! 😘", "jenejeienebjeejend": "You make me feel very happy and confident in my own body, thank you. But I wanted to ask what music are you into? And what bands/singers do you like?", "brookelitherland": "You should do a hair tutorial! Your hair is beautiful ❤️", "miss.kimber28": "If you could visit anywhere, without worry of expenses. Where would you go? 😊", "elianabeliebs": "@idkk_.gracie no problem! You are beautiful and i know its hard, ive been overweight my whole life and used to be obsessed about my stretch marks at your age (4 years ago) because i had them since i was like 10 but i think its hormones causing you these feelings. I realized that no one but u care about your stretch marks we all have them due to many reasons. I know its hard but look in the mirror and tell yourself 5 thinks u like about yourself everyday!", "daddydak420": "Can I get a shoutout? 😉😂💜", "annagrace.turbeville": "@elinanabeliebs thank you darling😊", "samavalos.34": "You always dress so cute! What is your favorite place to shop and for which season? Love you😘😘", "82_analisa": "Do people recognize you when you're out ?", "athenasimba": "Can you do a rocker look book???? The whole shabang? Make up, hair, a few outfits???", "olivia.rperry": "@idkk_.gracie me too! You're not the only one ☺️", "xel455": "@loeybug I'm stuck on finding the perfect cheek highlight! I'm fair and blonde like you so what do you use!? Ps Canada loves you!!! Xkxk", "haley_d_aguilar": "Do you ever plan on having children? They would be beautiful! 💕", "carlanichole86": "@loeybug what is your favorite brand of high end foundation? Do you wear extensions? If so, what kind? Love your makeup, you are beautiful and a true inspiration!", "actingmylife01": "Got any advice for a girl trying to see herself as the beauty everyone tells her that she is? I suffer from body dysmorphia disorder or BDD. I'm not a bad case but I'm sick of it :(", "brittanynissen": "You're stuck on a desert island, and can only bring mascara, foundation, or a razor for shaving. Which one would you bring?", "shelbycwood": "What are your opinions on the movie D.U.F.F.?", "the.ethical.edit": "Do you ever invent you own vegetarian recipes? If so, what are they? Any magical secrets?", "nxrose22": "got any advice for people going through depression?", "jordycrabtree": "How do you deal with people always saying means things to each other on your posts ? Ive notice that a lot of people go off on each other if they don't think your outfit is cute, or if you have a bad hair day.", "ciarahurlburt": "Do you have any advice for long distance relationships? Love you x", "_lilymace": "What's your favorite high end makeup product ,p.s you are amazing 😀😁❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "gittejanet": "What's your favourite make up brand? What's your favourite perfume/fragrance? 😃🌸 You are beautiful😘", "your_pal_goulash": "Anal?", "sophie.badih": "What's one thing you're going to miss the most when you move from Kansas to Texas? What are you gonna miss the least? 💛", "lovelyprincessforeva": "Advice for aspiring youtubers? I'm planning this program for young kids in elementary school where its positivity. Like body. Friends. Family. Life in general. How your problems aren't mountains but rocks you can over come. Teaching kids to love themselves and spread positivity at a young age. I was in the program when I was younger but it was cancled. So I'm planning on a new one. Any advice? I love your vids and you're my queen", "morganleamcneil": "Do you have any book or TV show recommendations? Love you! ❤️", "merrygirl94": "What're your thoughts on self defense and personal carry weapons as a military wife, and just as an American citizen in general? I've heard you mention that you own a rifle in a vlog or two, and I'd understand if you just don't want to answer, but I'd love to know your thoughts on it all. 😊 love you endlessly. 😘", "rosaram20": "How do you deal with the negative things people say about you? Love you by the way ☺", "beautywithcourtney": "I'm dying inside knowing you live in the same place I do. I don't know ANY OTHER makeup lover around here!", "abbiee.jaane": "How do you stop from comparing yourself to others? I compare myself to my sister a lot bc she is thin and small whereas im bigger and curvier. I can't help but resent her for being so pretty and dainty :/", "jazz.marie94": "What's your guilty pleasure?", "sbmahoney15": "I want to start vlogging. . What do you recommend I start with or how?", "shayleywilson": "Have you ever visited Canada? If so where?", "kitty_c_debieux": "what advice would you give your teenage self? 💗 p.s your videos are inspirational and I love all the hard work you do 💘", "llnut": "Do people in your life judge you for your love of makeup/fashion? (I love it all plus bags...shoes...jewelry...et...etc...etc...lol)", "aubs_dobs4": "How can I be as beautiful as you!? 😍😍 But in all seriousness, do you have any advice about growing as in individual in college or as a young adult? I have recently begun to really start to love myself but sometimes I feel like my size stops boys from liking me. When I look at pictures of myself I get really sad about how I look compared to everyone else in the picture. When I look at it I stand out because of my size. It just makes me so sad. I really want to just completely feel comfy with myself and feel like I don't have to change or be something I'm not so other people will like me. I want to be like you. You're such a role model.", "miki_minjaj": "What's your advice for high schoolers? Love you doll.", "ruthquigley": "What's the best drugstore foundation because I can't afford any of the high end types.....", "puentesruth2k14": "How did you overcome the feeling of not fitting in ??", "chloefromearth": "What do you see yourself doing in five years? Ten? Long term? I love your message and contagious smile!! XO @loeybug", "sociallyawkward28": "If you could tell your younger self one thing, what would it be?", "lanaenitz": "Do you have a relationship with God?", "liz2876": "What other youtubers do you watch? that are not beauty gurus", "nancymack34": "When you're not filming and your husbands not home- what sorta things to you do throughout the day? @loeybug", "gabriella_rammirez": "When shopping online, what size do you normally go towards when shopping for pants? I'm usually a 14/16 but I'm scared to buys clothes online because of the fit. Pls help. BTW I love you", "agnesschonbeck": "What is your go-to snack?", "oonsley": "I've been looking for a good face moisturizer that's not crazy expensive and isn't gonna make me crazy oily... any suggestions? thank you for being such an inspiration! love you lots!!!", "sunflowerleoo": "Are you currently addicted to any Netflix shows? I'm hooked on army wives at the moment.", "issyaldridge": "How do you keep your hair in such nice condition?x", "karlen_elizabeth": "What is the best thing about having a youtube channel & What scared you the most about starting one? @loeybug Hugs from Calgary, Canada <3", "stephanievoorhees94": "Do you like pokemon? I see a Jolteon plush behind you. You're the prettiest model in the world!", "captain_minot": "Have you ever met other famous youtubers & were they different in real life?", "morotjohansson": "When did you first get into makeup? :-)", "_britneyydawn": "I'm 18 and I really wanna know how I can feel confident in my body? I know you make a lot of videos about body confidence and I've watched them but I still struggle and I think it has to do with my anxiety. but I love you loey your my favorite youtuber and an amazing role model @loeybug", "msshelbydiane": "Self tanner recomendations and routine.", "joanned333": "Can you ever do any make up tutorials for women 30 and up???", "garanaamari": "What is your favorite store to buy plus size dresses? Btw I love you so much 💚", "kitaxox": "What advice would you give to your 16 year old self?", "lani_katherine": "How do you stay so positive? And when you do have down days how do you being yourself up?! 😊 loves from Utah!", "katerinamarie28": "What age where you when you first started habin", "just_jess_1983": "I have TWO QUESTIONS!!! QUESTION 1: What contouring products would you recommend? QUESTION 2: PLEASE HELP I am trying to bring up my self esteem and confidence... Any suggestions? It's so awesome that you're talking to your fans! It's totally fine if you don't get to my questions, I know there's a lot. 👍💜💋👌😃", "nurzifuli": "If you could live in another country, which country would you chose and why? :) love u <3", "eedi._": "First of all thank you for helping me to be more self confident, and my question is how do you keep your hair sooooo long and healthy? And whats your favorite everyday hair style? Love you so much ❤️❤️", "alymcintyre": "I always notice the Pokemon plushies behind you. So cute! What was your childhood like? What did you love? What did you do for fun? ☺️", "mommasllama": "What's the best drug store full coverage long wearing foundation?", "felicia.fe": "What do you think people think of you when they first meet you?", "inlove_inparis": "What color do you use for your hair @loeybug ?", "jemma22c": "@loeybug How did you get the courage to start your your YouTube channel? I really want to stat a YouTube channel and share my passion for make up as well . 😄💄", "amyw1": "What is your favourite item of clothing xxx", "maiah101": "What is some advice you would give to your 16yr old self about staying confident about yourself and what you want to do in the future?", "signemaggie": "What is your favourite food? 😯🍵🍰🍥🍔🍖🍌🍉", "joyrideintodarkness": "how do you deal with ppl on the beach shaming on you, whispering or outright telling you mean things? do you set them straight? or do you ignore them?", "gracegudas": "Who are your fave beauty youtubers?", "lisamariaart": "I'm really bad at asking questions, I just wanted to say that I'm a really big fan of what you're doing. You always make me feel better about myself, so thank you.♥♥♥ Lots of love", "mrsperkins_sw": "What 3 make up items do you think are a must have for everyone? 💄💋💅🏻 love from Scotland 😘", "rita.alves__": "Have you ever been to England?? If not do you plan on coming here soon??", "lilianaaaav": "What do you like to do when you're feeling down about something? Like when you're really stressed or upset. How do you stay positive?", "lexie_storts": "How do you confront your friend that you feel like your drifting away from each other but you still want to be there friend", "baileekidwell": "Favorite summer lip color @loeybug 💄", "lifedefrann": "How do deal when people say you're too pretty to represent plus sized women?", "shvxvxo_": "If you could choose one store to shop at for the rest of your life which store would you chose ? @loeybug 💖", "jxsusmontilla": "my sister is plus size, how can I help her gather self confidence and self esteem?", "_itzelaurora": "@loeyslovebugs Que bonita 😍", "maryah_rose": "Favorite hair product of all time? And what tips would you give to an incoming senior in highschool? Idk random but", "karissadiaries": "My 9 year said can she have lunch with you before you move? 😢", "johnna.km": "What's your biggest tip on making friends?", "kristenmacccc": "@loeybug what is your best tip/advice for a new beauty YouTuber? How did you get started?", "desxixo": "have you ever experienced any severe depression? if so, how did you overcome it or what advice would you offer someone who is depressed? also i love you 💓", "k_to_da_c_": "Hey 😍 what are your top make up essentials that you find you use very frequently?", "g1ittergir1": "How do do you deal with sharing your life on the internet ?", "erincowan_": "Favourite naked palette??", "meaghanunes": "Do you ever want children!", "alechav25": "Can you come to San Diego 😩", "1thessalonian5.17": "Just recently stumbled upon you through YouTube, just wanted to let you know I enjoy your videos! @loeybug", "barbieloveslv": "@loeybug, first off I want to say that you look fabulous Hun! My question for you is...where do you buy most of your clothes?!? I love your style! 💟", "kaylaruntz": "What are your favorite stores to shop at?", "ashleyb.byelhsa": "What is a good way to deal with my dad saying I shouldn't wear skinny jeans because I'm not skinny and other criticisms @loeybug", "gretalikar": "are you intresting to become a proffesional plus size model?:) you are amaaaizing!<3", "acs_1976": "Hi @loeybug, what is your favorite make up brand?", "fyeahbeautyy": "What inspired you to start a YouTube channel?", "andilynn93": "Whats the one beauty item you think everyone should have?", "paigeehickey": "Do you want children?", "lexie_vl": "What do you do to stay positive on those bad self esteem days where you wake up and your just not feeling your normal confident self, nothing looks good, your hair isn't working out etc ? Those days tend to get the best of me.", "teeevee": "If you were stranded on an island what makeup would you bring?", "emily.starosta": "What happened in LA that had you and Alex so shaken up? The curiosity has been killing me!", "lexiiitilley": "What is your favorite make up to use for contouring?", "kaitlyn_stallard": "I'm getting ready to start my senior year of high school and I find it really hard to stay positive and happy about my friends relationships when guys barely look at me because I'm a bigger girl. How do I deal with that?", "kiyalover78": "Will you be going to Vidcon next year?", "glynnaelaine": "Are you excited to move to Texas? Best and worst thing about moving.", "tandeka_e": "For how long did you grown your hair?", "lauranemeth": "What self tanner do you use!?!?", "jackiekavs": "What/where is the most interesting place you've ever been?", "freakfession": "if you could have one super power, what would it be? & i love you!❤️❤️", "selenalopez2016": "I'm also an army wife. I just want to know when will everything get easier?", "hellobeautifulsouls": "Gorgeous", "colettelmulvey": "What do you do when you're having an off day? Like a day where you don't feel as positive as you usually are?", "mslady201": "Since when are you vegetarian and what started you?", "samonexo": "What do u see when you look in the mirror?", "yvi.the.owl": "How do you handle criticism from others? And what advice would you give someone struggling with their body image?", "yackkiee": "Do you want kids? If so, how many?", "emily_tomczak": "What is your favorite makeup item you've ever owned?", "bratisonn": "What's your favorite charity?", "chips.and.salma": "Do you see children in your life in the future?", "kelli19790": "Have you always been plus size and do you workout at all? I know you're a vegetarian.", "bailey_so": "basic wardrobe items for plus size girls?", "modalamomo": "What made you want to start your channel? And what did you use when you first started?", "fathoma____ima__": "Have you ever looked at any skinny girls and wished you had there body and what advice do you have for big girls that don't have confidence and I love you stay sexy babe love you #curvygurls 😍😍😍😘😘😘💁🏼", "sam.bonnett": "Do you have any tips or tricks to growing your hair long? I can't seem to get mine past my shoulders. I always have too much breakage! D: @loeybug", "mekenzie_00": "How do you find the perfect guy and how has your marriage been do successful?", "_deletedb_": "Just want to say your awesome!!! & you've inspired me to love my body for what it is(:. & I also went to forever 21 the other day and purchased a couple of crop tops 😉 & my man was loving it . 😁", "izialr": "How can you be so strong ? You're so gorgeous and inspiring. Love U", "skyoung10": "I love to read, also....what is your favorite author and why? Love yeeeeew loey 😙", "elsiereynoso": "Would you ever be willing to do a collab with Sarah Rae Vargas? ( @sarahhhrae if you haven't heard of her) 💕", "helloiamleslie": "What size are you?", "shayshayy2014": "What are your tips for shopping for plus sizes on a budget?? I feel like everywhere I go it's more expensive! I'm a mother that doesn't like to spend a lot on myself! Thank you for your videos! Definitely opens my eyes about feeling good about my plus size body!! 💜💚💙", "rebecka.danielle": "What products do u use for your eyebrows? Btw: ilysm!!!!! 💞", "steffy801": "What r you favorite hair care products? Hairspray, volumizer, dry shampoo etc @loeybug", "deidra_latrice": "Can you and Alex collab on more videos ANDDDD YOU GUYS NEVER SAID WHAT HAPPENED THE LAST MORNING AT THE HOTELLLLLL! Lol pleaseeee explain! Haha", "kkatiekat6": "How do you learn not to care what other people think? Btw, love you!", "kristennnlynn": "How did you start building your confidence, because I have been struggling with my self confidence for a while now and just can't seem to be happy with myself. What steps did you take in self love?", "hayleysymbriggs": "How do people that are not naturally confident start to overcome their self esteem issues? Especially when you don't fit the 'norm' that society is making us feel we should be.", "amberallis1018": "What is one of the most important things you've learned in life?", "jaelynnmjohnson": "Are there ever any days where you don't think you're beautiful?", "amychadwickx": "What is your favourite makeup product and why? ❤️❤️", "fawnbrisbois": "What hair products do you use? Are you wearing extensions?", "navinamine": "What are your favourite animes/video games?💗👾", "monikabaur": "What made you want to become a you tube blogger?", "liveygrl23": "If you could have dinner with one man and one woman dead or alive that is not someone you already know, who would they be? And Loey, I aspire to be like you someday😊", "briannadiane_": "Gorgeous!✨", "browneyedcutie3": "Where did you get that blouse?!?!? Love!!", "cheyenne_rode": "how are you doing? everything going okay in life? you're gorgeous btw 💙", "hannahknappjenkins": "Ps I love you:)", "huntershay1": "Can you talk about your new dog a bit more?", "shannon.louisexox": "How do you feel about instagram banning different hash tags, just like curvy?", "ana.m.mercado99": "What would be the first important thing you would tell someone that is trying to learn how to love them self for who they are? By the way you are the best and I love how you don't care what people have to say to you. Ily", "stacy_406": "What is your absolute favorite Too Face cosmetic product that you couldn't live without?? I love you! ❤️", "brooketallent": "What is an absolute must-have in a curvy girl's wardrobe?", "queenbr00ke_": "I love my freckles but what are some make up tips for me!?", "_naeeeee._": "How are you so confident in your body ? I wish I had your confidence . ILoveYou 💘", "briauna.celeste": "How did you make yourself comfortable with your body?", "pouringraina": "Where do you see yourself in a year? 5 years?", "soindy__": "What inspired you to make your own channel", "tarynjashley": "How did you first get in to makeup, and has it helped you overcome insecurities? Love you Loey!", "lisahorn95": "Where do you see yourself in a year? 👨‍👩‍👧‍👧", "lynnessa14": "What kind of you music do you listen to, rock, country etc. and which genre is your favorite?", "jeannevcortez": "How is your \"diet\" going and which manga is your fave? 😘", "heinijones_13": "Who's your style icon and why? You're fabulous by the way!", "ohmymathilda": "How do you practice self love? Are there any rituals you have/ positive affirmations/ etc. ? Love you lots, you're a big inspiration in finally liking myself ( and trying new make up💗💕🌺", "mashasmakhtina": "What is your dream country/city to live in?)", "mrees.xo": "How would you deal with people telling you that because you aren't a certain shape, for example, bikinis or skinny jeans❤️ @loeybug I love you! Thank you so much x", "adabooker": "Do you have any body confidence tips for young girls? Ps I love you 💘", "taybrihawks": "Have you ever been pulled over by a cop? When's your birthday? What is your blood type?", "lizquinteroarroyo": "How long did your hair take to grow that long? ☺️ You're such a beautiful lady and a big inspiration to people. Keep doing what you're doing because you're great at it! Love you and your videos!", "graciegurl17": "When did you start getting into fashion and makeup?", "melissajeanfitness": "What hair care products do you use? Your hair is beautiful!! Do you wear extensions?? :) ❤️❤️❤️", "kaseyholbrook": "What inspired you to do YouTube videos?", "averydenny": "Advice for being confident in the upcoming school year? Love you and your videos 💗", "taylarxx_": "Hi loey you're the best ❤️ what are your two favorite makeup brands and two favorite clothing brands? I'm also a size 14-16 and you make finding certain brands easier for me xoxo.", "tylersue_": "What kind of car do you drive?", "madison.gilgo": "What was your favorite tv show as a kid", "balletkmw": "What are your favorite youtubers to watch for fun?", "mirandacasey4": "if you could go back to one moment in time what would it be?", "jackielayman": "What are you currently hooked on as far as products, TV shows, activities...anything?!", "moonchildgwen": "Hey Loey! How did you get the idea of making a YouTube channel? :)", "inthe_sky_withdiamonds": "1) You've said you don't eat meat. Why did you choose to go vegetarian? 2) What hair care products do you use? You are my hair idol! Love you girl! You're such an inspiration! 💕", "h.annahdavis": "What was your best memory from high school?", "yassouh": "Where would you like to travel or would you like to live in an other country ? 💕 Love you, you're gorgeous", "greene4": "What product do you wish you could review? ( maybe it costs too much to buy personally, doesn't fit with your viewers, etc)", "clairemelrosee": "What inspired you to be so body confident? Like curvy diaries ect? 😊❤️", "sam_savage25": "Hi loey wanted to say thank you for all your helpful videos they are amazing and have helped me to being confident in a size 14-16 thank you for all you do I was wondering if you were going to do a modeling shoot again or if you are starting any new projects love you always Sammy 💕", "celestescarboro": "What are your tips for losing a pet..This morning my dad and I woke up to one of our handsome Tom cats- named BJ/sexyman/big boy- passed away on our porch. (As you can see we all had a nickname for him 😿) The vets said there was nothing we could have done but he is our second cat to pass in a little over a year. Our first was to fibro sarcoma, a vicious cancer, but this one was an unknown cause. I just need some advice on how to handle the loss of a beloved family pet. They're like my children and it's just so difficult to deal with losing them. 😢😦 thanks in advance ❤", "lucky7msu": "Makeup tutorial on this look! Gorg! 😍 and what's the \"weirdest\" thing you do for one of/all of your creatures? 😜", "mpenuelaa": "When did you realize that you're beautiful? And when you accepted yourself?", "catherinered95": "Who's your favourite Disney princess? Love you!! 😍", "tacos.b4.vatos": "Which fashion brands do you support? ( Any type of clothing brand)", "toecracking": "Who are your idols", "till.midnight": "What do you say to your haters ?😒😭What do you say to your subscribers ?💋😍ily babe", "heavenly_xx": "Are you feel comfortable with your body?", "missjessicapaige": "Do you have any stretch marks? And if so how do you deal with them? Love you so much!!!! 💖💖", "rebeccamaityard": "How to become confident in your own body. Ily 💜 @loeybug", "orlaithobrien1991": "Random question - what's your favourite Disney movie ? 🙈💕", "kaseadillaa": "I'm not sure if this was asked but I could use the helpful guidance... WHO are some of the people that inspired you? What where your thoughts when you started this journey? Where you scared or worried at first and did the positive feedback help you get over that and become full blown confident?", "breana.jessee": "How do you love yourself?", "laure_elisabeth2611": "@loeybug your vers beautiful it is amazing 😀!!!! Oh it is pokemon behind you! ! ! ! His name is voltali en français (I am french girl) but I don't know His name in english 😁 kiss", "amani.kawaii": "What clothing brand do you stand by?", "ellishindmarch": "How are you able to get past all the body shamers who don't realise how beautiful you are?", "yuvy.j": "How do you manage to look so perfect every freaking day haha ❤️", "3lliewilson": "What's your favorite part about being a youruber? Love you so much 💜", "dani.billups": "How do u tell your parents that something is serious when they keep thinking you are joking?? Btw love u soooo much", "kaylaburtonn": "What trend are you most excited about for fall? Ily!", "kkrtvi": "WHAT TV SHOWS DO YOU WATCH? 💓 Love you so much n keep doing your thing", "anrivare": "if you could only have seven makeup products what would they be?? xx love from finland", "player297": "Do you use any tipe of artificial thing to get this color on you skin ? Like spray or something ?", "kaitlynaherrera": "Hope this doesn't come off the wrong way bc you are definitely your own person. But you look like Khloe Kardashian here. So beautiful 😊", "duff.enough": "What is your favorite guilty meal?! Mines sushi!!! 🍣🍣🍣😍 @loeybug", "jennnyysssss25": "Whats the story behind your new dog? Would love to know", "lioradanijela": "what advise kan you give to other plussize women who dont have the same confidense as you do 😊", "carriepalme.r": "On a scale to 1 to 10 how much do you love me", "drewcernava": "How did you feel when you first started showing off your body on the internet?", "triciaventura_": "What self tanner do you use? @loeybug", "brookedegoey": "Are you going I be having children anytime in the future??", "moonevie": "How did you finally accepted your body as beautiful? I have trouble thinking my body as beautiful..i love ur videos. You've given me soo much inspiration and confidence in my own site skin", "lhcrane": "What's your favorite summer food?", "hannahloug": "One brand of clothing and one brand of make up for the rest of your life?", "thrashleigh__": "Who are some of your \"guilty pleasure\" youtubers? People who you watch that no one would expect you to be a fan of? Love you, girl!! ☺️😋💕💁🏻", "_a.alyssalucy": "I love you so so so much ! You are such an inspiration !! Lots of texas love !!😍😍😘😘😘😘", "euclepsya_": "How did you accepted your body ?", "jjonnac": "What would you say to a person who looks up to you and considers you as a role model?", "houseofhames": "Do you have any advice for fellow plus size youtubers? I want to add plus size fashion into my channel, but it takes guts girl! You are an inspiration!", "m.a.r.i.e_c.h": "Please make a video on your diet and lifestyle routine 😍 and what's your opinion on freeleethebananagirl?", "curlyredhairednewfie": "Where did you get that shirt? @loeybug", "shelbss_500": "What is your favorite genre of music? And what are your inspirations on things you do", "anythingforsalinas_35": "@loeybug ... what advice do you have for girls that wanna to start making YouTube videos???", "dannykins": "What's the best and worst thing about YouTube?(: love you girl ❤️❤️❤️", "allison.ann.marie": "In your lifetime do you think you can love more than one person/ have more than one soulmate ?", "natalie__sta": "Why are you so beautiful? 💗", "xtinaperini": "How do you overcome being self conscious when it comes to being intimate", "ramie6971": "No questions, just a statement. You are so incredibly beautiful @loeybug", "courtneytberry11": "Whats your all time favourite makeup palette, looking to get a new palette but need help deciding haha! @loeybug", "nogginhead": "Favorite pizza topping?!? 🍕🍕🍕 love your videos!", "s0fiaesc0bar": "What is a good age to start wearing makeup?", "amyrichcreek": "Will Aaron still be roomies with you guys in Texas? I hope so! Love you guys!!! 💖", "unusedcv": "What's your favorite anime?", "rlutwi": "What advice do you wish you had known as a teen?", "katabatta": "How would you take bullying I'm 16 & get bullied I cry my self to sleep any advice you could give me please BTW I love you 😙💕", "carey5898": "Do you know any good stores (online or not) that sell cute plus sized homecoming/prom dresses? The struggle is real!", "kcy_q": "How do you find the right clothes for your body type? I constantly struggle finding cute things that flatter me!", "bnsleeper": "If you could travel anywhere in the world with an unlimited budget, where would you go and why?", "iamkarafarley": "Who were some of the people that inspired you to make videos of your own on YouTube?", "breesquilla8": "Omg is that a jolteon behind you?!?!", "harleyjm1120": "What are some main things you hope to accomplish in the next few years?", "bluemoon1162": "What's your advice for someone who's young, how to be more confident?", "danielle.zamora": "How are you so confidant? I know that you have tons of videos on this and I've see everyone of your videos but your my inspiration and your the reason why I'm so confidant today in 14 years old and I wanted to ask you if you can make a FRESHMAN ADVICE VIDEO cause I really need it lol and thank you so much for everything you do for all of us!I love you so much!Take care and God bless!💘👑☺️", "_ash22": "What inspired you to do your videos? I also just wanted to say that you are truly an amazing person and thank you for everything <3", "sherenahussein": "What inspired you to be so confident in yourself...an what do you do when your having a really crappy day 😞 (currently having a crappy day)", "samantha.mayhew": "What advice do you have for a freshman going into college??", "agnes_wendt": "What's your opinion on John Burks viral video?", "adelitaabonitaa": "Hey @loeybug I need long relationship tips? My bf just left the states and isn't coming back for 8 months what's the most you've been with out your boo??", "_kurlie": "What is your favorite nail wrap? Have you ever tried Jamberry Nail Wraps, if so would you do a nail wrap haul or Jamberry review?", "maemiller_": "What is your favorite mascara? Love you so much girly 😘💕 @loeybug", "samanthalkeegan": "How do you know someone is \"the one\"? Love you ❤️", "paulina.lizz": "How do you keep your cool when all people do piss you off?! Lmao", "fallxgoddess": "Do you ever have to deal with girl cattiness in real life? I've learned over the past few years how much I've grown apart from my friends because they're more focused on Internet drama then real life. Love your positivity by the way, you've helped me learn to love myself as we all should.", "tishalyn103": "Advice on starting a YouTube channel?", "abi_jxnes": "How often to you get your hair died? Do you do it at home or at a salon?:) I love you!", "mamavlzqz": "@karlyosmon one dumbass's opinion does not define you. no. not even close. no man's words should ever have that power. you are a goddess✨", "courtney._.elizabeth": "If you could change anything about your life what would it be and why?", "karencovarrubias": "What's you're favorite makeup brand?", "panda_jayc": "How do you take care of your hair? Its forever long and beautiful 😍", "kay__bye__": "How do you deal with all the haters ? How do you not let it get to you ? - btw you're so beautiful😍", "davrie.althaus": "How are you so positive all the time", "kenziegagne": "Fav makeup brand? Love you", "soares22": "Can you give some tips for starting a youtube Channel? ❤️", "elia_alexandra94": "What are some tips to feel more confident in your own skin? Xxx♥", "_kiara35": "Favorite Starbucks drink.☺☺☺", "martaaaaaj": "When did you realize you were happy with yourself and enjoyed yourself?", "melborgman": "Pink & blue 😍", "agirlhasnohandle_": "Tips for saving money? Recently got my first job and have been spending like CRazy!!", "prettymulah20": "Do you want children ?", "_catalinaaxo": "What do you love most about your body or self? ‼️💕", "tiffmarie_v": "How much do you make on youtube?", "arielsativa": "Do you plan on getting any tattoos? How do you feel about body mods? Love you! @loeybug", "savannahboyee_": "What is your dreem career and why? 😍 -much love from Los Banos ca😘", "t_stieff": "If you could live anywhere outside the U.S., where would you live? Love you, Loey!", "yungchente97": "Do you prefer Coke or Pepsi?", "mesha_tha_god": "Where do you think there is the best place to shop for clothes?", "gemawithag": "What would you wear to a festival", "anelle.villarreal": "Would ever wanna have a talk show like the Ellen show but Talks with Loey and talk to people and have special guests", "mallorieogan": "If you could only use one lip product for the rest of your life what would you use? Ps I love you so much!", "angelica.kathleen": "What's your realest advice for young girls with body issues", "breanna160": "How big of an age gap between people in a relationship is too big?", "reagan.murphyy": "Best pore minimizer? Or maximum coverage foundation", "kenzykellogg": "How long did it take you to be so confident your own body?", "french_alto": "What would you say to someone that every time they look in the mirror can only hate them self more?", "lilygm.28": "What were u like as a kid?", "taco_bella_": "What makes you want to inspire others?", "grace.navarroo": "What is the most valuable life lesson you have ever learned", "nicolexhardy": "What started your love of makeup?", "jessica.lauree.cross": "What is your favourite vegetarian/vegan dish to make at home?", "maya_alibrio": "Who is your greatest inspiration??", "erinpowers": "Favorite band or type of music?🎶🎶", "lizferrara": "What research would you recommend doing before adopting a dog from a shelter? I've fallen in love with a pit bull from a nearby place, but is there anymore I should know about him before taking him home?", "gingerbos_": "Whats your favourite make-up brand ?", "marissasnead": "Do you want children", "thecatttsmeow": "Where does your confidence come from?", "joslynxclem": "What inspired you to start YouTube?", "sjwrz": "Tips on becoming a vegetarian!", "thestrattons": "How do you feel about moving to Texas and what places do you plan on visiting? I'm originally from there and if you are stationed at ft hood good luck lol. It's a bit dangerous but I definitely recommend visiting Austin! Congress st. Has amazing shopping.", "anne_centeno": "Could you give us a tour of your home? I really like your videos and how you be so confident. You're so beautiful and I loveyou!", "lifeofagabs": "What advice (especially since it's summer) would you give on choosing a swim suit and feeling comfortable in it.", "ronnadewey5": "Trying to do my eyeshadow like urs ,but doesn't look good.any tips", "gillianalyssaa": "YouTube subscriber goals?", "shaggybrah": "What are your plans for Halloween???", "xochitlwrites": "Do you wear hair extensions? Or have you ever? And Where did buy them?", "angelenaarrigo": "Where do you see yourself going besides doing YouTube?? Ps. Love you. 😍👿💁🏼💄💜💜", "shaynavogel": "If you could travel anywhere in the world, where would you go, and why? 😊", "kellytriesagain": "@loeybug do you know which companies you do work deliver to Australia!", "zombie_music143": "How long did it take you to get your confidence belt up to what it is today? When your feeling down is there anything you do to being yourself back up?", "valerie.hayess": "What is your favorite makeup brand ps ily follow?", "isabellaknowles12": "Are you different to how you were as a child and in what ways (opinions, fashion,personality)?", "hailey_boyer": "Can I get some life advice? I just love hearing your words of wisdom 💙 love you so much!", "ajsjdjdjd.sjdjfkkgk": "R", "bellatyner": "Favorite foundation and concealer !?🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀🎀", "6youngtea66": "what song does like give you the feeling you left all of ur problems And you Can just let ur self go And be crazy for A few minutes 😊🎀", "imangelicaa_": "What are your best \"affordable\" drugstore makeup recommendations?", "jennaiisabella": "I really struggle with self confidence and I was wondering what it is that changed and you became so comfortable in yourself? I need a bit of whatever it is☺ love your videos and you're so inspiring 💗💗", "karlyosmon": "how do you get so confident? I have 0 self confidence since I met a guy and he told me that I was \"bigger than he expected\". ever since that day all the self confidence I had disappeared. I love you💝", "_sincerelybee": "How did you become so confident? Like when was the moment you realized that whatever people say about you, didn't matter? Love you loey and everything you represent!!💕", "magen.mack": "Is youtube something you'd suggest for people looking to get out of their comfort zones? Love you!! ❤️", "meghanmorrisonxo": "Best beauty tip?💜", "holsikes": "how do you feel knowing you've inspired so many plus size girls??", "bunniebrit": "What did you think we're gonna be when you grow up? Also, love your videos :)", "faith._nichole": "What the number 1 thing that makes you smile everyday?💕 I love you so much! Ur such an inspiration!!:);):)", "mzn0vember": "What does your current purse look like? Do you prefer totes, crossbodies? Big or small?", "emily_stults": "If you could go to any city in the world, which one would it be? (Luv ya! ❤️)", "alexisjaedon": "Do you have any tips on how to become more confident in your body? P.S. You're so beautiful and I love you so much ❤️", "kaitlinmekelminix": "What is your opinion on marrying young? A lot of people have negative thoughts on it but you seem so happy! ❤️ love you Loey!", "saraah.i": "Do you watch Tv shows? Who are your favorite youtubers ?", "siobeans": "What should a total makeup beginner start with in her bag? Where do I learn the basics?", "desireelarissa": "If you had your own episode of \"True Life\" what would it be called and why? 😁", "raneishafit": "What is your favorite pluse size brand and or store ?", "_nailsbymeg": "What kind of strapless bra do you suggest for girly with big boobs and big bellys? All the ones I try are so uncomfortable.", "diana_axx": "What do you think about tess holliday ?💙", "emily_paigee21": "Would you ever do a meet up? 😄 love you! Thank you for helping me with my confidence ❤️❤️ @loeybug", "iamciarasheridan": "Have you ever been to Ireland?? Ilysm ❤", "hurricane_rock": "What thoughts help you get through the day?", "mackenziekailin": "What's something you would like to achieve before this year is up?", "mariarebeccarogers": "Any children in the future?!?!", "abbylyell_": "How can I feel confident going back to school? Being plus size in high school= immediate judgement.", "happily.ever.wiggins": "What did you aspire to be when you grew up as a child?", "sousalouu": "Are you sure you're not lying about not getting chub rub?", "guerinchi1980": "What made you decide to do youtube videos, and also what was going through your mind the first time you posted your channel? :)", "dreamaboutsomethingbig": "Your all time favourite book?? :)", "sarasonder_": "What would you say to someone who doesn't have much confidence in themselves? I love you, hugs from Spain. 💘", "fortunatleyitsjess": "Do you ever feel out of place in groups? I've recently met a lot of new people and I just feel invisible. What can I do? p.s. I love you", "taylorbreann988": "@loeybug can you have a meet and greet??☺️ I live pretty close to you and I wanna meet you so bad", "kat_v_henry": "@loeybug Q: What would you say to your younger self?", "ogletriplets": "What is your favorite tool for curling your hair and how do you get the curls to stay? Your hair is gorgeous and I want the curls, but in this Texas weather it's hard for them to stay:)", "dd.sore": "What's your favorite moment that's you've ever spent with a fan? 💖☺️", "sjessica97": "You have so much confidence and its so inspiring. When did you really start feeling confident? Did anyone inspire you?", "dbrooke07": "What is your favorite show?", "mscupotea": "How can you tell the difference between a guy that wants you for you, and a guy that wants you because he has a BBW fetish.", "laurenw1462": "What moment in your life did you decide you wanted to become a style inspiration and a body confidence motivator?", "heddysphotos": "How do you get your skin so clear ??? @loeybug", "vennah4": "Do you like wearing so much makeup?", "alexandraraczka": "First of all, I adore you! Second, what is your favorite part about what you do?", "imkalynmakenzie": "How are you so beautiful?", "x.em.xx": "How do you stay so confident even though there are so many body shamers out there? Btw I love you so much! 😘", "madprops12": "Would you ever consider visiting WA state? ❤️", "mrsmargaritakolesnikov": "How are you so pretty", "jennydickox": "What keeps you going? How do you keep positive in what you're doing?x", "iits.sacariaa": "😻😻😻😻", "tandog66": "How are you (♡˙︶˙♡)", "laurencollins36": "What's a car u would love to have but its just not practical", "brittnaylord": "How long does it take you get ready??", "lorennland": "Do you like anime and video games?"}