{"emikoh.chikarah": "I have a hard time even applying eyeliner but I really do want to wear it, do you have any tips? (I'm only 16 and i'm such a fail)", "a_nnika_rice": "Do you like Taylor Swift and can we be friends? ☺️", "brooke_victoria__": "How are you so confident in who you are ? I'm bigger and I'm lacking self confidence and need to now how to love myself .", "kyliecaaaat": "you're so beautiful holy shut", "kellyhorakk": "Favorite emoji?", "_dianast": "Can you recommend a good book for a summer reading ? Something humorous would be perfect ;) It can be more than one I still have almost two months of holidays cause I start University year in October ,greetings from Poland :)", "xo_sisi": "What is your favorite new trend? I'm loving the mermaid hair! 😊", "sandyk7": "Are you happy Instagram brought back #bbw?", "jucaliin": "What do you think of a big year difference in a couple", "yesha_thakkar": "Where is one place in the world you would like to travel?", "moore_rebecca_": "Your literally so flawless and my inspiration! Keep slaying girl! 😍💕💖", "pamalarichardson": "You r 💣💣 girl", "diddeelmarsdottir": "You seriously looks like Khloe Kardashian!", "larissacardosouz": "@crislainesouzak", "lil.bindi": "Omg yesss ik her! @penxo_", "_jayjthegreat": "YASS", "mehmetekinci500": "🌅🌼🌸", "sarahakahmed\nVerified": "Verified", "mamaritaa": "@tyotya_diana like", "sonia_mariam": "Kinda looks like Khloé here @rasheada_x", "hmmann_": "If you could meet anyone (past, present, or future) who would you meet and why? P.s. I love your channel so much, and you have helped me gain so much confidence! Love you!", "alyssar23": "I wish there were more plus size stores to go and shop at! I can fit into XL at most stores but they aren't as comfortable and don't look as nice as 1x at the plus size stores. I can't order online and then just pray it fits 😔", "jemstormzz": "You have been looking a little slimmer but still keeping your curves. What have you been doing diet and exercise wise? P.s love you, your videos have helped me so much, I'm so sad I didn't get to meet you when you came to NY :-(", "chantelylace001": "How many videos do you film a day and how often? P.S. love ur style", "ziganna": "Any advice for dealing with body policing family members/relatives?", "sydhealy": "@loeybug how long have you been growing your hair out?", "lucycineaste": "@loeybug you've inspired me to feel so much more confident in myself and my appearance, so thank you for that 💗 I was just wondering how you would suggest dealing with negative people in your life that you can't get rid of (a parent, for example)? Good luck with your move! X", "sophiedukelow": "Would you rather only be able to wear jeans and t shirts, or dresses for the rest of your life? 😯😅😘 xxx", "adelinaq_": "Dear Loey, I stumbled upon your channel about a month ago and instantly fell in love with your personality. You seem so positive with your body. I know you have given many tips about being body positive, but how do you stay positive when all your other friends are thin with boyfriends, and you are still single. @loeybug", "katineri": "You are a selfie queen seriously. How do you do dis!", "corderopartyof4": "Seriously I wish I had money to buy clothes like you have. I hate getting dressed because I don't have clothing that fits me correctly and I look horrible. So jealous.", "seanogle99": "Miss you! 😥💑", "awsnapitzari": "YOU ARE INSANELY GORGEOUS", "aliciacleto": "Watched your Q&A video today. Goodness you're such an inspiration! You're beautiful and kind hearted. Lots of love from NZ 😙", "ittsumo_kawaii": "Hey Loey! I noticed that you like anime/manga (we have the same Kyo plush! (* >ω<)) Which anime/manga is your favorite? ヽ(*≧ω≦)ﾉ", "niamhquilty": "YOUR FAVOURITE YOUVE VISITED/ WHAT YOU WOULD LIKE TO VISIT", "rrfash": "Did marriage change ur relationship?", "luna___may": "How did you picture your 20's to be when you were a teenager?", "tamimb9117": "Will the brat-pack (army friends) be coming with you??? If not, what will happen to them??? Have the pets left already???", "be.yoncaa": "Do you like Digimon?", "meghaslam": "When did you start wearing makeup and do you have any tips for braving more obvious makeup? P.S love you! Xxxx", "puhtricia": "How to get ambition?", "lenitakmene": "Tell us about your teenage years, childhood! Where you a good or a naughty kid? Xoxo", "celestie0": "How do you start on youtube? How do you know that it's something you are good at? (Like to the beginning before you started making videos) & what made you start making youtube videos?", "sara0944": "What made you want to start YouTube?", "_.sarahtaylor": "If you could travel anywhere in the world where would it be and why? 💕", "jazmynia": "Do you use shape wear and if so, what's the best ones you've found?", "sam_lealea": "Where do you see yourself in 20 years?", "gabriellaspicer": "😍😍😍💖💖💖", "ramirez.reyes3": "Why did u decide to become a youtuber? And was it hard to start?", "ahemwastefree": "What's your strangest habit?", "fernandaazr": "Did it hurt when you fell from heaven, loey? 😁💕", "amanda.diepenbroek": "Hi Loey!💕 do you use shapewear? If so, what kind do you recommend? 😘😘", "dafinsjuni": "PERFECT!", "1outofservice1": "CAN YOU TELL US ABOUT YOUR CHILDHOOD ALSO IF YOU WANT TO HAVE KIDS HOW MANY DO YOU WANT BTW I LOVE YOU AND YOUR VIDS SOOOO MUCH 😘💜💜", "liv_toohey": "If you could dye your hair any colour what colour would you dye it?", "beckydoeslife": "McDonald or Taco Bell? ;-) 😘😘", "cassidygunderson": "Would u be willing to sell your Victoria secret pink shirt?", "dnsmnth": "How did your hair grow so long, can you suggest me something for hair to get it longer?", "caprs": "Advice to curvey girls who wanna meet guys", "ash2dust115": "@loeybug ILY your amazing! Favorite book right now? How nervous/excited for the move are you? And have you guys found a house yet??", "sophie.badih": "What are you gonna miss the most when you move to Texas? What are you gonna miss the least? 💛", "phoebe__23": "Advice for curvy girls looking for a guy?", "jessikitabanana": "What advice would you give to someone who wanted to start making videos?", "kaybella4": "Have you ever bought or reviewed anything from @rue107", "zuuuleee__ma": "If you could go back and give your 15 year old self advice what would it be?? 😘 ily", "sweet_deets": "Hey sweet pea! Just want to wish u a smooth move lol", "emilier_1222": "If you weren't doing YouTube what would you want to do?", "alireza_ahmadi_b": "like", "guapoani_": "I am one of your fans so I made a parody page of you I just wanted to tell you and ask you if you can please give me a shout out on this page pleaseee oh and please text me back @loeybug", "haileyyy_danielle": "If you weren't doing YouTube what would you want to do??? 😘💋❤❤", "sleepysllloth": "Do you read or watch anime/ manga b/c I always see fruit baskets merch in the background of your videos @loeybug", "sammiemcsloth": "How do you decide what style to wear best? I am a bigger girl and would love to add a bit more style and confidence to my wardrobe. You always have such good style 😍 loves xx", "hannah_theging": "What are your family goals? Did you have a career goal before youtube?❤️", "this_is_erica_b": "What is your personal hair and makeup routine/ products used for your own everyday look? What did you look like as a teenager? What are your top five favorite attributes of yourself and your top five \"cover-it-up\" traits?", "rockgoddess_": "What gave you the courage to go onto YouTube?!? Love you loey💕💕💕", "lydiakernow": "What's your ancestry? X", "hollymarion_": "What's your ethnicity?", "lian267_": "how did you learn to accept yourself and not care what people say??I love watching your videos, you are an amazing person!!!", "bec_d_nic": "I love almost everything you do. But I'm just not that creative to come up with a question! Haha. 😍😚 so much love.", "jannettewaha09": "How soon after the move will you be filming again? Love you lots and how funny you're moving to Texas, I'm a military wife in Texas about to PCS to GA! Lol!", "kimberleejanee": "What do you do to cheer yourself up and restore your confidence on days that you feel it slipping?", "lianne_hedley": "Will you be coming to the UK any time soon? I've recently had another baby and Love your videos on body confidence ❤️", "kightwhosaysne": "What city or county are you moving to in Texas? I live in Pasadena :)", "linz0922": "@loeybug once you said you had a southern accent but you tone it down in your videos. Why is that? You have such a pleasant sounding voice as it is, I think an accent would sound just as nice! 😃", "reatheunicorn": "@loeybug im a plus size girl and im very proud of my body to be honest but what irritates is that everytime i walk down the street while wearing shorts everybody looks at me as if im doing that for attention or anything like that but when a normal size girl walks nobody cares. We both wear the same outfit but yet im the one being i notice judged. What am i supposed to dooo???", "rhoadies": "@loeybug I'm a plus sized girl in between sizes so none of my clothes fit right. What should I do? Also I'm embarrassed to do fitness testing at my school because I am judged by my classmates. Any tips? Love you sooooooooooooooooo much😍😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘😘", "lani_katherine": "Where's your favorite place to buy clothes?? @loeybug", "smilesmommy": "You remind me so much of carrie underwood!", "lasolnails": "What is your go to drug store products? You are amazing!!😘", "lupitaa__f": "Were you always confident about your self, What helped you build your confidence? Ps: love yaa❤️", "kiki_hall_": "Why are you moving ?", "eetalex": "Any advice for new milsos? thank you gorgeous!", "natalee.sanchez": "btw your gorgeous and i love you!!", "allmylovehailey": "I might be a little late..what self tanner do you use and what makes you feel better on days when you just feel really crappy? Love you, Loey!", "elianabeliebs": "Can i teach you how to twerk? Lol", "ogcush1738": "What do u plan to do after YouTube ps I love you and ur beautiful💕", "_ashl_y": "How does it feel being such a big role model for so many people?", "faithxeli": "What made you want to start making youtube videos? And when did you start doing makeup? Xoxo😘", "mrs.sims2019": "Do you get stopped a lot when you go to different places? Does it ever bother you?", "brandiecampbell": "What is your most EMBARRASSING moment? Love you Loey! 😘", "kyraa.nl": "do you want to have children?👶", "natalielepri": "Have you ever struggled with self image? You're stunning by the way!", "lemmabug": "If you could use only one brand of makeup for the rest of your life which brand would you choose? BTW I love you and your channel so much and I'm so proud of you! ❤💙💕💜💚", "kyrsten_burtchxx": "If you could dye your hair any colour without having to worry about fading, matching clothes to the colour ect what colour would you choose? Love you xo 😘", "rachel_842": "@abbiee.jaane you're like really pretty. Keep your chin up. 😊", "kayla.d.allen": "What is the most rewarding and what is the hardest thing about being a military wife? ❤️", "faunaeden": "Have you ever been to Colorado?", "bittycole724": "Would you ever consider going brunette", "meaghanunes": "What is your natural hair colour? 😋", "liljuli2268": "What is the best primer to use if I have very dry skin on my cheeks. TIA I love watching or listening to you and @learningtobefearless to get my through my work a day", "summer.skye1": "How long did it take you until you became confident?", "maziebaldus": "What's your favorite movie?!? I love getting to know people's fav movies I thing it says a lot about them! Btw love you !", "toniannruggiero": "Favorite YouTuber?", "_kelsje": "Where's that shirt from lol", "_naeeeee._": "What's Your Most Favorite MakeUp Product ?", "lyssa_catherine726": "Are you a Christian? :)", "aneesa_maria": "Hey lou lou .. When will you get a P.O. box so i can send u mail? Love from the Caribbean .. #inspiredbyloey", "kaitlynnecassidy": "When it comes to your makeup routine... Do you have specific makeup you use everyday? Like foundation, contouring, or eyes?", "sophiiahh": "How old were you when you had your first kiss?", "emmhoffman": "Hi loey!!! First wanna say that I love you and your positivity . Thank you for putting time and effort into making such wonderful videos❤️ ok so my question ! If you had to wear one specific outfit forever what would you choose to wear ! Love you have a nice day and good luck with the moving process ☺️", "juliyaiordan": "What was your best day?", "skyler.davis_": "Is there any where specific you go when your sad ?", "molly_spurr": "What is your best advice for young girls who are learning to be confident in their own bodies", "alistanonymous": "How to be social? I usually am but I shit down as soon as I'm around strangers!", "antonella_aguilar": "Why are you moving to texas? (Btw i looove you and i also live here so yaay)", "lexiiiwells": "Hi Loey! Idk if you've ever answered this before but what made you start YouTube & how did you get so many subscribers? I love you so much, you are gorgeous! & I hope your move goes very easy ❤️💕😘", "taylorretzer": "What brought you to YouTube? Btw... New follower! Love youuuu! ❤️❤️@loeybug", "katieatiexo": "Your such a role model and I was wondering how you got your confidence up to where it is now? I admire your strength and courage and your positive attitude", "alxrita96": "I was watching Clueless today & realized that you totally look like Alicia Silverstone!!", "princess_gordy": "What's your favorite make up in your collection? Love you #curvygirlsrules @loeybug", "jasminebelovely": "Any future videos planned with Sarah Rae Vargas?", "blah___00": "Is it hard to keep up on long hair? I love you you're amazing💙💙", "_imashlee_": "Have you done or considered doing volunteer work with a charity. If so which one?", "alexism.parker": "Do you ever want to visit ohio? If so will you do a meet up?", "makeup_by_joolz": "Have you considered having a fan club where your fans get to send you letters and you will to them?", "jennap10": "@jessie.peck this pic lit up my feed😍😩 how can someone so perfect exist?!", "oliveaa__photography": "what is your fitness routine? c:", "mollykate1229": "Do you think you will like living in Texas? Also, I used to live in San Antonio (for 4 years) and I loved it so much! Hopefully you fall in love as I did! Xoxo", "brittney__grey": "What YouTuber do you wanna meet that you haven't met yet?", "enchantingescape": "Why are you so amazing !? Girl seriously though share your amazingness to us fans even just for a second haha love you ! You're my role model. You inspire me to keep going. ❤️", "lilianaaaav": "How do you manage to stay so positive?", "nicolerosemusic": "Do you have a sorry behind your name? It's so unique and beautiful, I love it! Love you, Loey 💜", "jessicapuig": "What are your current favorite songs?", "malysiaschellhammer": "How did you like Texas?", "torilawhorn": "What's your best memory of your time in Kansas? Good luck in Texas!!", "conymontecinos": "favorite makeup brand? you are so beautiful, i love you 💜💜💜💜", "andreaaximena": "what is your favorite makeup brand? love you loey !💗💗", "heybug9": "What was the first makeup product you used as a teenager?", "angelagabriielle": "Favorite song atm?", "itismebrandi": "You're so beautiful, and from what I see you are both inside and out. I respect and envy your self-confidence and self-acceptance. It is truly one of my biggest struggles. Thank you for inspiring so many women, young and old. #beautyisachoice #beyourownkindofbeautiful", "mezabs": "When will you come to San Francisco CA? I would like to meet you!!!!😄", "djwinterfresh": "Favourite clothing brand at the moment? Btw I love you <3", "boymom_melissa": "What part of tx are you moving to?", "lily8909": "Tell us about all the animes and mangas you like, im gonna miss that bookshelf behind you!", "tacobela": "Favorite childhood carntoon", "ruthmlr": "Which is the happiest moment in your life so far? Love youuu🌺", "hardwiredheart": "If you had to chose to use only one lipstick your whole life, what would it be?", "maggii_a": "How is your hair so perfect !?? How do you maintain it ?", "lisahorn95": "Can you say the alphabet backwards 😋", "katieodavis": "Hello Luv! So two unrelated questions. 1. I have a very short neck. Not body shaming, just fact, but I really want to sculpt my jaw line and just slightly elongate my neck. Tips with makeup, facial exercises, and or best camera angles? And 2. Most favorite nostalgic game? Mine is Tetris! 💙", "thesaltlifewife": "What are your thoughts on \"Older\" youtubers? For example, I'm a 40 year old youtuber myself. Do u see yourself continuing your Channel that late in your own life? Ps- u give me such inspiration. ☺️", "samanthagooding_": "Best way to give yourself a confidence boost? Is there anything you do or say to yourself? Xx", "savannahaddison": "What inspired you to love yourself?", "manucaldas": "Can you please talk about stretch marks? 💖 love you", "gabbsss": "Love you Loey! How do you feel about the clumpy mascara look?? Thanks for everything! 💙", "carleycallenberger": "What is your holy grail makeup product", "jesscretty": "How do you overcome the amount of hate you get?", "wildflowerchild_": "Would you ever consider cutting your hair short and different playful color, love you Loey!", "ashleytaylorxo": "What products would you personally not repurchase?", "marycakes_28": "Have you ever been made fun of/bullied severely and didn't know how to make it stop? Btw I think you're such an inspiration to all women ❤", "sarakileyxo": "What hair products do you use on your hair? And would you do any crazy colors? Love you!", "celestegarcia28": "Will you come over for dinner 😊 and Mario kart ? Love you girl !", "kae612": "Favourite thing about living in that house? Something that makes you excited to move?", "tinaamarinacci": "If you could switch places with one person for a whole day who would it be and why ? @loeybug", "shelbyydowns": "If you weren't a blonde what color hair would you like to have? Love you boo! @loeybug", "nxc_o": "so how are you so good at makeup? Like did u go to school or something? Im 17 Loey, and youre my absolute inspiration 😊💕", "freakfession": "highschool advice? 💖 i'm nervous & i want advice from a gal like you! love you loey, keep doing what you're doing. xoxo, lili.🌻", "brnima_love": "Favorite place you've ever traveled too??? @loeybug", "lovelikadove": "What are some professional outfits to wear? I am going to be working at a school. Any ideas?", "mandynale8": "How does it make you feel knowing you inspire so many people to love themselves? You are the only reason I have loved myself 😊 you have given me confidence. I love you and your vids!❤", "imangelicaa_": "I'm in a team at school I love, but I don't have the best grades because of it. What can u suggest, do I quit or how do I handle all the stress ?", "melodieemisslerr": "who is your inspiration? @loeybug", "amyjoplus3": "If you ruled the world, what three changes would you make first? (Or should I say when you rule the world?) love to love you loey!", "angielillian": "Um....when can we explore Austin together?!", "emely_vickery": "What's your favorite book/author? @loeybug ☺️", "cecilliacritch": "Dream destination to live @loeybug", "mimi334__": "I love your name but I've never heard it before. Is loey short for something ? How'd your parents come up with that name", "leslie.presson": "Favorite mascara? Btw love you so much 💗💗 @loeybug", "lysser_99": "First I would like to say I love you so much and u inspire me to be confident with my body, and my question is what is your best memories in that house ?", "a_bandan16": "How did you overcome your fear of being judged by others?? I love you so much and your videos constantly inspire me to be. Confident about myself. 💗💗 thank you!", "devonnelaird": "I'm a military bratt and I love the military life! How are you liking it so far?", "devitchka_25": "What is your favorite game to unwind to? PS welcome to Texas! It's a bit hot but the people are friendly. If you live close enough by I'd totally come to a meet up!", "mia.p.02": "Do you ever plan on having kids?", "sofiaaa27": "What is your favorite nail polish ? and if you can travel anywhere were would you ? Love your videos", "paulina.jablonski": "What is must have piece of clothing ? Love ya doll", "maddsxxo": "What part of Texas are you moving too?", "katie.bbergy": "if you could, what Pokémon would you like to have by your side all the time?", "adv.with.al": "What do you say to all the hatassss out there?? I love you💕", "maddyparkinson": "@loeybug 🐂 what are you most looking forward to about Texas? ☺️ I'm moving there for college this week as well! Xxx", "garanaamari": "What is your middle name? By the way I love you SO much 💛💛", "leabrooke1": "Accepting* @loeybug", "kristynandcats": "Are there anymore pets in your future? All your fur babies are so cute. Have you thought about fostering?", "alexxisc": "Did you date around when you were younger ?", "kaylaeggs": "figured I would answer this for you 😂 I ordered some recently on a website called Sock dreams!! they have a huge variety and the quality is great 😊 @eferguson15", "kimmymcd_nz": "Whats your fav holiday destination?", "shayleywilson": "If you won a million dollars, how would you spend it?", "josephine.no": "what were your childhood dreams?", "brittany.smith.davis": "Whos your favorite musical artist?? Love watching your videos! You are gorgeous", "xxangelfirexx3": "What is you're most favorite thing about having dogs! Love you're videos!", "eferguson15": "Where can you find plus sized thigh high socks?", "ally.grimaldi": "Who's your biggest (non-YouTube) inspiration? Love you Loey! ❤️", "kamryn_locke": "Do you have any tips for people with body confidence issues? Its something I've struggled with for a long time and was just wondering. Love you and your videos! ❤", "anahi.htx": "How do you know if he is the right guy for you?", "kiararanallo": "How many kids do you want to have?", "vickie_rose_96": "Favorite to-go food? P.S. love you", "laurynhylton": "if you were to get a tattoo, what would you get", "harleyjm1120": "Who and/or what inspires you most?", "calliee.mcdonald": "What's your favorite part about being a YouTuber? XOXO", "carolinerhprice": "What's your favorite emoji?", "emilyhustonn": "How did you start youtubing? 📹📷😘", "nesstlycrunch": "What is the thing that made you realize you needed help with your eating disorder?", "thewanderingmommy": "@loeybug are you using your sephora points tonight for any specific reward?", "kayla.p_25": "IF you never started YouTube, what would you see yourself doing?", "crystal.ludin": "@loeybug How did you become so comfortable in your skin?", "anniembsider": "What's your signature dance move? 💃 @loeybug", "silkflowerss": "what advice would you give someone going into their senior year of high school? #2016", "_priscillanicole": "@loeybug Would you ever consider writing a book ?", "morgan_lynn36": "What advice do you have for someone going into college?", "georginaw_": "How old are you? Love you!!", "lipstick_and_champagne": "~*~If your life had a theme song- what would it be?~*~💋💕", "duenasa_": "What is your favorite Starbucks drink !?", "destuknee": "Favorite or top 5 shows on Netflix? ❤️ you!", "hapa_hannah": "You're so beautiful and inspiring ♡♡ who inspires you ???", "celestescarboro": "How do you deal with toxic friendships? Btw, love you and your vids! We should totes be bffs😉😘😍😄❤❤❤", "alexisjaedon": "When did you realize you wanted to inspire people and become an advocate of body positivity in the public eye? When did you start YouTube so to speak? Ps I love you so much 💘", "katlin.m": "If you could give your highschool self one piece of advice, what would it be? ♡", "tarynjashley": "How did you start getting in to makeup/fashion? Love you so much Loey! ❤️❤️❤️", "sophia_ma13": "How do u deal with anger? Do you ever get in fights with friends?", "jessica.m.posh": "Ways to get more water in every day? How do you get the ambition to put makeup on everyday?", "lizzyrose_18": "What's your favorite book to read in the summertime? Any suggestions? :3 luv u", "stephaniiediazz": "is it hard being a military wife? I'm about of a military family and I know how hard deployments can be sometimes. PS i love you so much, you're truly amazing 💞", "maky_may": "What is your biggest fear and you biggest hope in life? Love you!!!", "wow.itskat": "@loeybug first of all u absolutely adore you! My question is, what made you want to start the body positive videos? And where do you get your confidence and could I get some??? 😘😘😘😘😘😘😘😘", "rachhh_04": "What food are you craving right now? 🍖🍕🍉🍎🍒🍋🍑🍐🍊", "amyrichcreek": "Will you ever go shorter with your hair anytime soon? Congrats on your first real home. Texas had better look out for Loey freaking Lane. Love you so much!!💞", "xjessy.woodyx": "What is your jam right now that you could listen to over and over? I love you and your confidence i look up to :)", "abbydaner": "Love you so much, you're my body inspiration! Do you have a hair and skin routine you can share? I'm trying to grow mine out and it's impossible.", "jisetnohemi": "Ohhh okay thank you! @amyrichcreek", "fuentesindyy": "How did you become so confident? It's possibly the hardest thing ever to do.", "_fkn.bluez_": "More of a statement really. But you're absolutely wonderful. And because of you I'm feeling like I can learn to be confident", "vane_aven": "Sending lots of love from Canada!! I know it's not a question but everyone else has asked what I was already thinking :p hehe", "chocchipbrownie": "How has YouTube impacted your life? 💖💖💖💖", "halle_marie_": "What's the best thing about being a youtuber??? Also, luv you! You're such an inspiration !😊", "surquidez2018": "You're such an inspiration to many, including me! If you could have any super power, what would it be and why? ❤❤❤❤", "mak0rina": "favorite memory of that current house ?", "rogers_nic": "What do you recommend to satisfy a sweet tooth that's semi healthy", "holliejean15": "What advice would you give a 16 year old girl trying to build her confidence, even if people are trying to knock it down??", "kk_lew72": "If you could own one mythological creature, what would it be?", "hunter.wyck": "What do you see yourself doing in 10 years?", "lillie_griffith": "What has been your favorite part about living in Kansas?", "_bariatricbeauty": "Can we be friends? Lol.", "annachristmas": "lol how is ur hair so long?", "amoora.as": "Who is your one true inspiration to how you live your life?", "arielx219": "What do you think is different about you now versus when you started filming YouTube videos? PS I love you so much! 😘", "whipnip": "What made you start youtube? p.s, LOVE YOU.", "alyssashepherd_": "What're you looking forward to in the future? Any big plans/dreams?", "bcorrbs": "what did you wanna be when you were younger", "jordan_betson": "I dont have anything to ask you but I just wanted to say how much I love you positivity and confidence it is so inspirational to me. 😊", "nicolecatalfamo_": "What's your favorite color?"}