{"vilder93": "@mariabb1994", "coquettecaitlyn": "If she doesn't make chubby look fab idk who will @emilyann_myrick. #bodypositiveinspiration", "emilyann_myrick": "She's hot! Big girls can work it too! @coquettecaitlyn", "keilynsmommy": "@cecilecasey", "cecbroome": "@keilynsmommy it's so cute!", "rachellilly2": "@ashleigh_sherman", "naomiyork_": "Loey, you're such a beautiful person inside and out! You look flawless and I'd like to day that I'm a mermaid princess too 😉", "shopemeraldbia": "Adorable", "kateduck91": "@loeybug please tell me where to find that skirt?? It's gorgeous! !", "jess_g0ldberg": "@thevonstar 😉 you would look good in this", "zegingerqueen": "@lizmarlow8950", "lunerouge29": "Seriously, you look completely BEAUTIFUL!", "gail981": "@loeybug this skirt with the purple ariel sea shell swim suit top 👍", "lonelyallie": "Would you like to go on tour? PS: you're gorgeous & I love you ❤️", "faith_lynn_16": "What do you think about tattoos", "navsingh_07": "Video of that make up look ! P.S I'm on my fiancé IG so it's not a guy asking lol", "jordycrabtree": "You are looking hot", "leanne_owensby": "@ngowensby", "dayanasoji": "@ibismonse10", "ibismonse10": "Su falda!!! ❤ @dayanaraliz", "veritoeisabella": "Wow!", "adriana1490": "@mokneeknee so cute!", "oliviaquinnharris": "@breeweee", "mollie_rosee": "@shelby_wagner", "lil_hellkat": "We need this skirt @misshaileysin", "joyfullyjosette": "Have you ever done a goodwill haul? Would love to see that!", "tbmayerling": "@vanes_hbl", "salvi_grl29": "Where did you get your skirt??? @loeybug", "moomoomod": "So cute😍😍😍", "vanes_hbl": "@mayerling1602 me encanta", "noor.nasir.khan": "What a cute lady...", "meyallidolli": "@tlea87 loveee", "hubblebubblehunie": "First, i absolutely love you, youre such an inspiration. Second, i was curious if you get the horrible thigh rub, and if you do, what do you do to prevent it? @loeybug 💖💖💖", "amaanni_23": "هل انتي راضيه عن شكلك 😂", "annabellemarie84": "If you couldn't do YouTube as a career full time, what is something else you would like to do?", "meerypeace": "Te vez hermosa, saludos de una fiel admiradora chilena 👌🏻😘", "theworldaccordingtoella": "Wow you look ✌👍 fantabulous", "hasan472020": "Ilove you", "aurab_": "@irismitchelle I'll go with this one. :)", "ele__noir": "Beautiful!", "ilaria_mag.sic": "@ele__noir lo è davvero!", "mallory__a": "I usually get very self conscious about myself a lot. How do you deal with it? If you do that is. It isn't that I don't love myself it's just I'm afraid of what people think of me and so do I. I don't like summer for the fact I'm afraid of showing my body and being judged in negative ways", "zoe.phillips_": "Were you overweight as a kid? How did you learn to love yourself?", "aireuhl_": "@april_morales19", "delia_thegreat": "@ayee_abby", "ayee_abby": "@delia_thegreat I love it!!!", "nicolewandell": "Just had to say that you are ADORABLE in the Ariel bikini on you video!!! So so cute I really love it, the sweetest swimsuit ever!💜💚", "nicolette.valenti": "any advice on gaining confidence m?", "mariahfelty": "So pretty 😱💖", "halestormie": "First of all, I love you and when I started watching your videos, they made me feel better about being me. I never dressed girlie before or wore makeup much, because everyone treated me like I shouldn't.. like I'm a big girl so I shouldn't dress nice or wear makeup because what's the point? Ha. Well, not anymore. 😘also, i have one important question! WHERE did you get that top and bottom!?", "marauani": "Ily", "ffphara": "When did you decide to become who you are today like how to did you become it ?? How did you become yourself and overcome people who bully you ??? @loeybug", "kailebbryant": "Hey Loey! I love you so much! I'm starting to become a bit more confident with myself since I started watching you, but do you have any great tips that you know worked to love yourself? You're seriously an inspiration to me! Xxx", "monikarosiwinkelmann": "Military question. How do you deal with moving to different duty station? I just moved far away from friends and family and was hoping if you had some tips to stay positive and immerse myself in my new environment? I do spend a lot of time watching your videos on YouTube 😀 loves xoxo.", "hahall78": "@tlea87 love this costume", "tlea87": "@hahall78 Ooooo! @meyallidolli", "sadieseddon": "This is amazing! And I love you so much xxx", "irivan58": "Очень стройная в этом костюме! Класс!", "blueeyed66": "Which country is on your to do list to visit? Love u by the way ❤️", "jazii_h": "@massengale.susan I think I'm gonna go like stalk her whole YouTube account 😂 cause I love people who love too faced", "stylingsusan_": "I'm new to watching her too, but I like binge watched her a few days ago lol and yes she's amazing and I love her 💕 @jazii_motherfuckers", "spookibelle": "That looks like the tail from hips & curves, did they come out with a green one?! I only saw blue last time", "bcruschhaupt": "@loeybug what would you say to people who are \"in between\" plus size and not? (Depending on the store size 12-14) I feel like plus size clothes fit me better but regardless of where I go (plus size or not) I have people tell me I don't belong there. It's hard to feel good when no one accepts you. 😢", "xo_sisi": "What is your favorite part of Fall? Are you a pumpkin spice latte fan? 😊 Love your videos, and you've been an amazing inspiration to women of all shapes and sizes! ❤️", "rasberry_icetea": "@kidd.brianna be this", "jayyy_bayyy_bayyy": "@prettyeyedsmiled", "krystal.lorenzoxo": "What made you want to start youtubing? I'm a new follower and subscriber and am dying to know! Really love watching your videos and thanks for being so positive and fun!", "breezy_britney": "How do you stay so positive? I feel like I have to force it all the time.", "mari_21_xoxo": "What is your new fall lipstick favorite color", "sibia4": "@celinajamz", "ranyaayoubi": "Wear on Saturday @lenakaraja pls", "annaelephant": "How did you first become a beauty blogger? And were you worried about what people would think? Love you & your positivity!💗", "makeupmischief01": "If you had to choose between either doing body positivity videos and beauty related videos then which would u choose? Which is more satisfactory?", "tondizzle5": "@lelemarie33", "musina_galiiia": "Вот это блядь русалка ...", "katiemegan89": "I'm about to start a new job and I am really shy around new people. It takes me a while to come out of my shell. Any advice for 1st couple of days?? Ps thank you for all your inspiration x", "audi_grace18": "@amberrlynn96", "da_dek": "@yourpennylane", "gingerellaa_": "😍💕🙌🏼🙌🏼goals!", "loudlyoung": "Favorite song?", "porcupine_babe": "Hey, Loey! I really and truly love you very much. You're a huge inspiration to me and you make me feel beautiful inside and out. Everything about you makes me smile; you're such a gorgeous soul. :) My question is, is it okay to use drugstore makeup? Do you prefer high end?", "shelby.stone": "Beach @kj_tucker3", "angeladiaz76": "Así @roraicy @alejandracbs", "amanda_artistic_dreamer": "Just wanted to say that I love your channels! You are awesome!", "brim1423": "@the_youngman33", "amandaanngoode": "Would you ever consider doing a makeup collect video??? 😁😁😁 love you girl!", "mixueerr": "how did u and your bf started out!! PS: youre really my inspiration.", "em_thompson17": "How are you working on yourself to become a better person or a better citizen?", "astarnes88": "@kimmeharing", "mamak1989": "What is your daily workouts now? What are some of your fav meals?", "stop_sammertime1991": "@ericab11 this costume is on point", "elizabethv0827": "Mmmm maybe lol @_thisiscrystal_", "the_invincible_wallflower": "Where did you get that skirt?!?", "elefranphant": "@lily_mrqz me in my halloween costume 😂😫", "taramassey96": "♡ you @loeybug", "madeleineeee____": "Can you talk about your workout routine?", "bellizamonte": "@fazinhaaa", "cierraarenee": "@rubee1218", "lizjean24": "@eweise @ceceriot oh how i wish i cld pull this ofd", "alexaveln": "MAMAAAAAAA! Me haces un disfraz de sirena?! D: @monnabeth", "shannstephanie": "Omg no. This picture is SO unflattering!", "aliciaa_frias": "@shannstephanie well I happen to think she looks sexy as hell😍...😒", "nevirvin": "Hi how have you been", "ctlove13": "@loeybug you look Stunning:)", "abigailallmond": "What would be your best tip to get through life??", "cdawn11": "Has your hair ever been any color other than blonde? I love it, btw, just wondering.", "livingmylifeloved": "@youmermaidmyday", "lala_laura7": "@lovelylexa", "_sarahforte_": "what inspired you to do/love makeup?", "mattiemakesstuff": "@mahou.mario this is so cute c: and I know you like mermaids", "sarakouffie": "@tre_b_1993 my halloween costume?", "littlemrshayes": "How do you store your makeup and keep it all organized?", "usagiprince": "COME THROUGHHHHHH 💖💖💖 @hustle.dada", "sarahtahami": "@kayllafrance oh my god I LOVE it", "mairi.collins": "Was there ever a time in your life when you thought you would never fall in love or meet the perfect guy? If so, how did you get through it? Thanks Loey, love you ❤️", "angelrnee": "Super cute @adrianuhlyn", "xicanax": "Any advice for someone who wants to make a yt channel", "j4muir": "Have you ever been to the Caribbean or considered it?", "kadiekai": "Do you still have body confidence issues when you see a smaller girl? love you ❤️❤️", "nsab": "Where is your favorite place to get pretty and comfy lingerie? I need suggestions!!", "titaniathecat": "... Nice!!! 😍", "thiccris": "What's your guilty pleasure food wise?", "kimkittybutt": "Are you dressing up for halloween ? and if you are what are you thinking to dress as ?", "aublauada": "Cute mermaid outfit @frenchtiffany89", "mrs_heather_pratt": "Have you considered doing any freelance again in the future?", "cwelker21": "Look @lngreen26 she is so gorgeous", "laurenegaines": "What's your advice for an inbetweeny( someone between straight and plus sizes)?", "yac.eli": "Do you like wearing heels, flats, sandals, or sneakers the most?", "viv.cobos": "What is your most important advice to young women who one day wish to be like you?", "amyrichcreek": "Will you do a video with Dani now that you are both in Texas???", "sese0518": "I LOVE YOU YOU'RE AMAZING !! WHAT MADE YOU START MAKING YOUTUBE VIDEOS ORIGINALLY?? Xoxo", "linduhhj": "@kalichandra10", "_joyful_147": "If you could tell your 16 year old self one thing, what would it be? And what is your advice for woman who are taking steps to love their bodies more?", "hannahjoan__cawley": "How do you deal with mean people ? Love you", "opstyles": "Where'd you get that adorable outfit? @loeybug", "chelzzzy": "@christinewinter", "gogojax": "@marissamartorano you need this skirt. I don't know why I'm stalking you but I take Halloween seriously.", "madisonneecole": "What is your tip for marketing your YouTube channel. I'm a small YouTuber and look up to real & genuine you tubers such as yourself.", "danielleball18": "What's your fav store?", "crlnyjrg": "What things should we look in a man to start a relationship? Hugs and kisses from Chile", "yeyitaa": "@jennim_cx", "lafn2": "@shellyeah32 we need to dress like this!!", "a_nnika_rice": "What's your favorite movie? PS your channel is awesome and I love you!", "greciabiasino": "@jose40054", "ally.grimaldi": "What's your favorite part about being a YouTuber? Most memorable experience? Love your channel! ❤️", "arielsativa": "Do you have any tattoos?? @loeybug", "asulayl": "@jasmineangelica", "sofi.sepulveda95": "If you had to shave your brows ir your head, what would you choose? A big hug from Chile 😄", "joleighli": "@jacorona41 I need this skirt!", "maddynicole101": "@lynneluhrs", "sophia95xo": "Would it be possible for you to give me some advice? I'm 6'4 inches tall and a UK size 16 and a lot of people tell me to do modeling and I do want to do plus size modeling but I'm afraid I'm too big and I will get turned away, is it possible you could give me some advice on what to expect or do if I get the courage please❤️", "aprilsa5": "That's a cute idea @cristina_alysssa", "hi.its.chels": "@oliviacatherinet you need that skirt!"}