{"paulotadeudeoliveira50": "👑 👑", "u.s.kumawat": "Wwow 👌 👌💞 💓🥀 🥀😘 🕊️ vvvvvvvery beautiful 💖👍🕊️", "2506franco": "NICE SWEATER FOR CHRISTMAS AND HOLIDAY SEASON", "savybooca7": "I would buy my daughter some things she is 3 and is my world", "vacumeunicorn": "Did you pick winners", "craigyboyf1": "you are diamond", "holdyfox": "This hair color looks really amazing on you😍", "t.lovere": "❤️❤️❤️❤️❤️", "robhell1979": "😍😍😍", "rawandzee": "I love you , you love me👍🌷🌷🌷🌷🌷🌷🌹🌹🌹🌹", "johnny_jayyyyy": "Goddess", "sinay_yose": "@vicnnel THE HAIR COLOR", "mary.sips.tea": "I want some checked Vans, an eyeshadow palette, and a new phone case.", "crisymahal": "💓", "ashleymichelelx": "For Christmas I want 24 hours of no work! I work so much a day off is far and few between. What about you? @kaycoy16 @juniper.rose.13 @leraprettyx", "steadychillaxinasmr": "Merry Christmas Love Muffins!!All I truly want for Christmas is health and safety for my 2 boys. I cannot wait to see their eyes full of excitement Christmas morning. #loeylane you're a absolutely beautiful inside and out!! Thanks so much for being you ❤️🙌 @chipwoodgood, @jessica24fl , @baileygirl2266", "zanyangel95": "i want good art supplies for my bullet journal and some chocolate @cactusjuicer @sarahshaniece @the_courior", "mariasamakovli": "*not having anyone to tag* 😬", "kashianth_potdar": "Merry Christmas 🎄", "holochanxx": "@annalovesu @colourpopcosmetics @makeupby_elliee ✨❄️✨", "heavens_pink_kittie": "🤓💕💕💕", "dallaseve": "Beautiful", "murdochmichael": "❤️", "babiedcll": "Late, but i want to buy love anybody, that way I won't be miserable during field hockey! @babie.niches @pqsta_ @faulkner.morgan22", "katienthesphynx": "I aspire to this level of beautiful 😍", "kaylamarie663": "I really want an iced coffee maker! @trueillwill_1313 @cjett221 @jacquelinefrye", "eden.nichole": "I want a DSLR camera and my own sound equipment for Christmas so I can be a strong, independent female filmmaker and stop relying on the equipment rental facility at UNLV for equipment 🙏🏻 @alex.marie.29 @_erikamariah @eth_h20", "julianna_1228": "I want anything and everything for my horse. @leahhh166 @xo.juli_04 @fu.ck_yo.uu", "kaylababy117": "I want earpods @jamie.3238 @trrenton_williams @rafaelvalentin9 p.s. Jamie, Trenton and Rafael I'm tagging you because I want to win a giveaway you don't have to buy me earpods but if you do thanks in advance.", "venusdechocomilo": "I’d get a pair of faux fur boots tbh 🤷🏾‍♀️ @legendofthelegendary @ashleyballah @unwantedyouthx", "brigidacadiente": "Dang I missed this:( still love my QUEEN though!", "__allison.parker__": "I really want some chunky combat boots!!! @mikaylapersing @saraparker13 @chlowick", "ciara.sc00t": "I really don’t care about the give away I just gotta sayyyyy GIRL YOU CUTE AS HELL I LOVE YOUUU", "courtsschultz": "Your hair is what I want for christmas 🤣🤣🤣", "_thenameshayley_": "All I want for Christmas is my diploma and frame for it @whit_barb @simplyxrana @goocholivia", "faithchambers1": "Love the hair & want the sweatshirt❤️🎄❤️🎄", "unwantedyouthx": "What I want for Christmas is a new pair of boots! 😂 🥾 @dnhtact @maureeen_b @mikey_sims", "jojo.the.talented.singer": "I just want my son to have wipes and diapers. I’m a single teen mom in college it’s hard. @catherinebr6 @naturally.essence @tacos.r.us2", "sweatbree": "straight up this hair color looks BEAUTIFUL on you!", "melib1991": "So proud of your on your accomplishments this year loey. What I really want for Christmas this year is health (mental and physical) and happiness. It sounds cheesy, but it’s the truth. For my friends I’m tagging @patti_kanouse @mercincompani @katietrethewey", "hannywilliams": "I want new clothes for my cruise coming up 😍 @kala_leann @jayquellin33 @nicolemarie0509", "kira_dreamerrrr": "I just want to continue and spread my happy aura (I'm in the UK so it's probably not applicable but I'd like to spread my love anyway) 🕊️✨🕊️✨ @brittanytraverz @elreduire @nattaylor1998_", "bravcry": "For Christmas, I don’t want anything in particular, but I would spend it wisely not only for myself but probably for my fam as well @zaneisfruity @kittymoonqueen @rsamarialunaavila", "megannjolenee": "I'd love to put it towards some new pots and pans! Thanks Loey. @nmsprince @crystalgoodnight @cuts_and_color_by_cristina", "mish.mish1616": "All I want for Christmas Is my mom to have a joyous and happy Christmas, it's been hard. 🖤❤️🖤❤️🖤 @drodri329 @tamara.sonmez @jakitanock", "karsyashley": "I want a carpet shampooer 😅 this is what motherhood has turned me into, getting hype about carpet cleaning devices lmao. 😂😂 @raeleigh45 @chaunceylynn @itseaveymaya", "ever_chessy": "For Christmas this year, I just want to see my family happy. We're all struggling and the holidays are the hardest but a big smile on their faces would be the best gift all year. 💜", "dodiesclarks": "i really want heelys because i need to just. fly past the haters. besties! @qckity @attacked.bymonsters @uchih.as", "mmendez1014": "I want to get my fiancé something that he has been wanting for a long time. I don’t want anything because I have everything I need 🧡 @mariahlynschoen @asap.barber96 @court.knee.n", "hurleywilma": "Beautiful, Merry Christmas", "lilpeachpit": "@juanita.mccloskey @kaili.bryer @skinsfanrob", "virgocat__": "I don’t want anything for myself, but the gift card would help greatly for what I’m trying to put together for my boyfriends birthday 🤞🏽💕", "xboobafettx": "I want a new pot and pan set 😭 lmao @queendee710 @courtneys.story @derosia_420", "krystaltomasson": "Hey Loey, thank you so much for the opportunity💚🎄 For Christmas Die like some new boots and new clothes 💚@brittdenise23 @skilashea01 @lil_sc19", "sheilalovessol": "I want a massage for Christmas! @0.zyler.0 @jmmrichards @grettyann1124", "fawnsoftly": "I love sweet smelling candlessss 💞 @elliek_titanium @k8lynmariee__ @t__milly", "becca_bun": "I kind of have everything I want for Christmas. Biggest gift this year is my brother and his wife are having twins due in late January early February ♥️ @bryanna_1106 @welcum2nirvana @exterminatedxx", "cassiedonegan": "I want to be able to (hopefully) last minute travel home to see my family! @sceblake @haleyeberger @campbellseth", "sydney.camille": "Moneyyyy !! Haha @its_ya_boy_jimbo @_makayla.danielle__ @xxseth_mccormickxx", "nakedcookiemon": "@krazykoko28 @sweetbellalina @meloncholla I’m such a big fan and i want to get more toys for my daughter", "ravengetsperpetuallylost": "Stranger things vinyl @jahnnyvee @shayboo53 @kayy.kristine", "amberf2181": "Prayers for healthy baby coming in August 2020!", "lyssaaajade": "I think I want make up so I can give it to my best friend for Christmas", "pyrothighs": "Aside from just having a blast spending time with my family and roommate, I wouldn't be mad at getting a Terminator DVD box set, heh. @house_frau_betty @mikayla_nudi @slonudi", "embyrlee": "@brievans__ @fluffymoroccan98 @usmcmaddox I love u sm", "avocadoglohsss": "I'd want an art set for me my dad and my sister as we all love art and my dad likes to teach us! @alvarosoler_england @floz.xo @isabella_romano_xx Good luck to everyone and Merry Christmas!!! ❤️", "floz.xo": "I'd actually want to get two spa tickets for my parents they try so hard to make Christmas special for me and my sister they deserve it ♥️ @avocadoglohsss @isabella_romano_xx @alvarosoler_england", "alvarosoler_england": "I want everyone to be happy it's sad how some people have to spend Christmas in the cold streets I just wish everyone had the chance to have fun 💖 @floz.spam @wengiediyfan @isabella_romano_xx", "gabbybxrr": "@pandaman1an @_lovelythoughts._ @vivi.mz I want clothes that fit lol", "alic0400": "Merry Christmas Loey, hope you and your family have a wonderful Christmas.", "hayleyrone": "Could you check your dms please", "couponerkelly": "I want to see family. @sweetcheeks4565 @amr_bye", "jeyyounit16482": "For Christmas I just want a nice family dinner 💖 Oh and a puppy 😅 @jake.the.mistake7 @swki @haydonconover", "iwasnevergivenaname0": "Honestly this girl needs a new vacuum @haleymarie133 @heyitskaiitt @olivia.stephns", "freespirit_keke": "I'd get a toy truck set for my nephew's and maybe a little something for their mom", "amelia_queerheart": "I'd for sure want to spoil myself and my friends with little gifts here and there, wholesale candy/snacks and crafts kits like we're little kids again. @saskatuwan @cuteness.is.my.quirk @stephanie_deanne", "we_boop_ur_nose": "I really want a new pen for my journal @dinaxpojan @purple_upple @stupid_glass_eyes", "blackeyeliner_blacksoul": "I want the gift card to help me pay for some of my textbooks for next semester 😭", "mckenna_rummans": "Might sound silly but all I really want for Christmas is to find a way to live in peace, health, and happiness. I'm tired of being scared and sad all the time, ready to get better.", "claire.marz": "All I want for Christmas is quality time with friends and family @annam166 @bailey.kuhn @elisemecham", "insomniacsong": "I don't want anything material for Christmas for myself. I just want my friends and family to have everything they want. @meyganl @larvalgoh @kamiijosflower", "_lana.love_": "For Christmas I just want my family to get along. @seth_tha_goon @tybrakr @logan_prust", "magnesiumzinc": "Comforter @postmalone @taylorswift @lizzobeeating", "lyndseyyauten": "I asked for AirPods lol! @thatohiokid @madi.miduri @aelc_windchester", "nataliawiddison": "I would like to get something nice for my mom, to finally start giving back for all the years she raised me. @cloverlordgt @greenpikeemoji @kagisue", "4757arman": "💋💋💋💋💋💋💋💋💋💋💋😚😚😚😚😍😍", "katmackin": "@katandbricontortion @shawnthorngren @oldfriends_seniordogsanctuary", "dreamlandemptyness": "I would like to buy myself a very warm throw blanket ! 😍 Soft and cozy enough to feel warm during the cold Canada winter time ❤️😁 Thank you so much for this giveaway !! You're the best 💖 @alexecoffee @ftf_auds @renecharles_audet", "rheauxane": "@kimberlyraiche @kimberleykruczynski @thehannenguyen", "natyt2010": "for christmas this year i wanna play videogames with my family and friends @lilslothwaffle @hippo.potanus @lilslothwaffle", "mbenz85": "@loeybug you are so beautiful! Keep on being you :). I would love to get some new hair products for my new blonde hair lol. @jmw.8 @maccullochkristy @tammyn8421", "emmie.amanda": "I want a “Bears Beats Battlestar Galactica” sweatshirt! @apostolicguy7 @lydia_joy_swalls @myfairlaney", "amour_cafe102": "I want either a new phone or a new computer @kenziekovers @kenzie_jenna_berv @misterygirl934", "kayisrad": "For Christmas no family drama would be a dream. ❤️ ( @sethradigan @kalin_hunter_ @statictrash )", "thytla": "I just want to eat Christmas dinner 😂 @kellyvith @sydneytrimbath @bhudak12", "ajaycosplay303": "Really want a weighted blanket for Christmas ♥️♥️♥️♥️♥️ I love you Loey!!!!! @jordan_richard5 @karirachul @kristen__richard", "emily.h.2001": "@herrongirl6 @maddy.roche22 @xxjemma._.rosexx I want a good quality camera so i can start actually doing photography", "hollylynn_": "I want my house to be stocked with food 😅 @poppyycockk @hannahbowmannnn @aubie23b", "jessp130": "Money please! @louie_c3 @alecka92 @chellsunshine giveaway tags haha", "eli.starlight": "For Christmas I really want lolita clothes, I'm tired of not embracing a part of myself just because people think I can't be a feminine trans guy💖💗", "nayelie_espinoza": "Id want new paint brushes and canvases or matching pajamas for me and my friends @naynays_art @vfxicefyre @margpupp", "gvalles89": "All I want for Christmas is to see the biggest smile on my daughters face ❤️ @nybxgurl @nicole__valles @morticiastateofmind", "abbiepine": "I just want pyjamas and cute Disney things tbh 😍 @kirstyjpine @emilypinee @_rain.in.july", "mialuvsmemes": "@mikaylacisneros32 @julieecisneros @mia_onomatopoeia I just want a bunch of eyelashes 🥺😔", "ladynohope": "Just want to be able to get my kids something for Christmas and get a job @mommylife1117 @kallykat69 @aloura831", "ronnymartin3996": "I wish you a merry christmas!!! Ronny ❤️❤️❤️❤️❤️❤️❤️", "friendly_trash_pile": "I want to be able to start t for Christmas. Or at least afford an extra binder. @jaeyoungcogbill @tuesday_adamns @portfoli.mo", "yaboikylea": "I would want a eyeshadow pallet ( I only have 1), be able to actually buy my friends presents by Christmas, and something for my sister ❤️ @soulstakenbyhannah @daleew2001 @thefrylord77", "kan_iesha": "I want a ssd for my laptop tbh @victoria.e.winn @pher0326 @lintuchiha", "abbymz7": "I want a new computer since I’m starting college next year! 🙌🏽 @chuck_the_builder @esataty @damariz_melgar", "kittyphi900": "I want to be able to see my beat friend and biggest crush for 4 years but he lives over 1000 miles away from me. I cant wait till i will be able to see him though my 3 friends are him @zackii_gore and 2 other best friends of mine @why_is_brandi_doing_this and @awkward_redhead19", "barbara_estby": "I actually dont know what i want for christmas i love giving @gelll_marie @sirius_black0394 @jojo_helli", "pancakes_and_marshmellows": "Love ya mamas💕💕 @lokis_left_toe @avengersprotectionsquad @trashy.606", "hola_oula": "I’d want an Apple Watch and a gift for my mom❤️❤️❤️ @danafgk @just_ghalia_things @fathersafa", "randommodnar2512": "All I want for Christmas is safety and good health for my family. ❤️ @peppermintcutie08 @alecia_graves86 @alexhudson202", "ijeeee_": "All I want for Christmas is to spend time with family. Holidays are a little different after losing a close family member. @air_jordanns @_kalesay @natstencil", "howardashleyrenae": "I want all of my make up back 😭 @sammycat2000 @1s3a1v2n1h @carlyhoward7000", "brionxna": "I want serotonin for Christmas @jnax.o @ivy_lovesfood @eatsleepinternet", "gloriadavila_7": "All I want for Christmas is inner peace and tranquillity @_ps.920 @hezisma @mrs_liz_presmy love ya ladies. Ps you look beautiful in these pix!", "berryboyboogara": "I want heelies:)) @helpless.island @christianmomshatebrynn @gazeebxs", "dezeraerenee": "@dallaschampion55 @danahays03 @viktoria_eve I would love a new wallet! I need one baddddd lol🙈", "eattakis._": "What I want for Christmas is a new laptop. @baddestbrook @talhyia_ari @baddestbrook", "mrs.amelia_cross": "I really want something from @milkmakeup I’ve been dying to buy their Matcha Detoxifying Face Mask ! @mrsgushta @mrs.moldrem @ms_debano Merry Christmas alley!!", "emilyhopson_photography": "This special edition of a book I love ❤️ @igotnothin_11 @feedyourheadx @amy.lynne.morris", "xoch.garcia23": "@gutierrez0770 @polyboi082 @suc.u.lent I still need to get Andres something just in case he doesn’t like the sweater I got him lol", "amandajbugh": "@seraphteeth @amberdagit @ponyta.is.lame the only thing I want for Christmas is to get something special for my best friend who is basically my sister. She always gets me something without asking for anything in return or is always pitching in a little extra money for me to get something that I really want for Christmas.", "bran.cake": "@hannahberres", "breahnna002": "For Christmas I don't want materialistic items. I'd like for my family and I to have a blessed, happy day filled with laughter, joy, FOOD, and love. 😊❤️ @princess.sydneyy_ @allyson_haver_ @sheraheve82", "thesydneyv": "Christmas for me has always been kinda difficult as my grandmother is so poor and I’m putting myself through college. I don’t really have anything I want really, just a change in my mindset. I want to allow myself to go into the new year being more vulnerable and compassionate. I want to invest in myself in ways that I haven’t before to live a more wholesome life. I think doing so will allow me to enrich my soul in ways I haven’t before 😕 this is so kind of you @loeybug 💗 I’m going to tag @jessica_bethke @dancer_for_life1999 @strongfortori 🎄 happy holidays!!!!", "brittttttnnni": "All I want for Christmas is my family to be happy and healthy! @amandalynnae6 @mel.pedersen @ladybug73keel", "99panda23": "I want to be confident for Christmas! @brownboymakeup @saraii.nicole @allienoelani.spam", "ava.voth": "For Christmas I want the people who aren't as blessed and privileged as others to have a wonderful holiday❤ @coltanmartens @mapetiteboutiquey @ava_is_ok_", "_jannahgayle_": "I just started watching your videos on YouTube and I absolutely love you!! You’re such an inspiration and so beautiful. Keep doin your thing girl. Love you so much 💕", "amandaloves_you": "I want some snow for christmas!!! 🎄@selinserra_ @scottmackenzie36 @rahip97", "yourfavoritecastmember": "I want for Christmas is Happiness and joy spread throughout myself and my family and friends and everyone on earth. We need to set ourselves up for a better next year . We all deserve it . @yourfavoritecastmember @annualpassholders @marimmeow @nancyvalencia1503", "dejasharly": "All I want for Christmas is my babies 1st one to be a happy one! She loves remote controls so I bought her a cheap one ❤️❤️🥰 @kfsantry @really77345 @carriefranklin4213", "annuani77": "Good looking", "toriliz15": "What I want for Christmas is for the day to be peaceful, merry, and warm ❤️ love you boos @daisiesdippedinacid @c_rose0223 @maginmboles", "ivette__ayala": "@ortega_559 @ronniexayala @ss.ryno", "_ash._.bash_": "@clarissajeannette @_leslie.marie_ @thomas.c.hernandez", "brinley_marie23": "I want to be back home surrounded by friends and family @middleton.mya @veronica.england0 @victoriakrager", "princessandherpup": "I want to see my family for Christmas, it’s not gonna happen. But that’s all I want for Christmas 💞 @dr.darawan @cotyx.team1 @accio_prosecco", "foreverstrength": "I just want that bangin’ Christmas breakfast! @carolinejeranek @katiecastellano @heimtime4", "reyesroyalties": "Can you please teach me how to do my brows 😍😍 slay girl!", "arianacloudsss": "All I want for Christmas is for my parents to try and understand me. Or Atleast for me to figure out what I want to major in", "pineapple_babe06": "I'd like to get my parents some nice gifts for Christmas to repay them for everything they've done for me .💗 @ashm808 @katrina_gilman @shaneroxes", "lizthemom1422": "I want to be able to buy my kids something nice for Christmas @raindrop.18 @morganashleighparis @tabitha1154", "christ.inaaaaa": "@hannahleslie__ @vaness.aguayo @sanji.malik Don’t mind me, I’m just trying to win a lil something something 🥺", "lexiegrl3": "I want camera supplies to help my slowly budding YouTube channel. @its_cinta14 @kjvmakeup @xcrystaldoll_ good luck everyone!", "dyunikon": "For Christmas I want a new pair of slipper and treat my mom to whatever she wants! @roxylizzy @ghernandez8899 @karynag13", "despresso.beann": "I just really want a college education lol @maddy_hooey @alovvelyghost @meaganbruso171", "tay_2894": "Ive been watching you for years. I feel in love with your YouTube channel with all of your fashion hauls! Your an inspiration girl! ❤️🙌", "nadia.ism__": "Just to be happy @anika_reynolds @theprozacprincess @meghanvienna", "_anniepaige": "For Christmas I just want my college tuition paid off😂 @madilynn.faithm @_.hails__ @lipstickinmywhitevalentino", "witchyouthebest": "i want a fuzzy blankeeyy❤️❤️❤️ @gracellabattin @1031mxxi @virgorisingkombucha", "heyheyitsaa": "I want a toy for my son and something special for his daddy. @pamelaetling @scarlet_mischief_maker @victoria_thompson313", "trysarahtops1": "All I want for Christmas is to be able to fix my freaking car lol @i__am__ganja @mariemoon93 @its_mar_bitch", "neverland_lost_girl_": "All I want for Christmas is for this tumor to be gone and get my life back on track, the holiday blues really be getting me this year @amberciita @aleka_f @art_by_l1l1th", "katynipples": "@abi_sislo @suburban_ghoul @tr4p_g0d_ 🥵", "caitlinxgrace": "for christmas id like some new lip colors and to maybe treat mom with something for the new year 🥺 @c.a.s.s.i.3 @mollyyrosee @itsbrittcasey", "siisiiweaver": "Tbh I don't really know but I want to get my friend something I won't say cuz she'll see it and I'm really excited😂😅 @izzy_lingle @nyxhhhh @ethereal.beaut", "um.its.heather": "I want to give back to my parents and help them stress less and cover some of their bills @smiley533 @rhondasaez @_allie514_", "zover_it": "@dizzy____dreamer @james_duffy1997 @fabricaterealitypersonal For Christmas I want some new stationary for the scrapbook I’m making my daughter 💛", "hotkatertot": "I want socks tbh @jakehaagsma @flowerpoweramy @stepheniegriffin", "crystal_a87": "I want all the fuzzy socks for Christmas! @gtl87 @j_emelyn @cxrina_g", "kanehast": "all i want for christmas is quality time with family who i don’t always get the pleasure of seeing as often as i’d like ❤️❤️ @organictinktinks @yupitsafinsta @ken_dra_86", "carlycottle": "I want some gel pens😍✨ @shaunaflori @rappingcottle @cathyshack", "xsidequestx": "I’d love to buy a new textbook to study while I’m out of school!", "gingerlove__97": "All I want is to have a good Christmas 🎄", "milkky.ghost": "I want furbies lol @kitxlid @citrus_friend_ @charlestonnnnnnn", "tamra_casey": "@caseytamra_ @instaafar @danielt.golden I want to be able to get my parents a gift for Christmas", "darkfairy_209": "My doggie needs to have surgery on Friday and I just want everything to come out good. I'm so scared of loosing her🥺 Merry Christmas Loey ❤️ @eneriscreations @talentedartistsgallery @enerispoetrycorner", "elizabeth.riichardson": "I want a coffee mug for Christmas. I know it's simple, but I love them so much. ☺ Thank you, Loey!", "rachelkat96": "Would love a gift card. My mom has spent so much on not only our family, but others this Christmas. Would love a chance to give her a gift card as a small thank you/repayment to such a selfless woman. ❤️ Xoxo Merry Christmas Loey!", "haro.jade": "@1975.leuxx @1975.leuxx @1975.leuxx if I win this sister shall we go get ourself a well deserved Christmas dinner? 🥰💕💕", "thejordanlikens": "That’s so freaking generous, Loey! For Christmas, I want improved health for my mom, my car to be repaired, and a new laptop. 🎄 @sara_mc13 @morgan.enriquez @ohh_hale_nahh", "jessiebeemore": "There is honestly nothing I need this Christmas, I’m grateful for the family and friends I have, if I did win I would spend it on them to make sure they have an amazing Christmas. 💕 @hiccup_the_cavapoochon @thenomadtester @cold_urticaria_jess", "emmybee15": "I asked for a makeup vanity this year! ☺️ @witchysarahbear @dealtriston @redheartgamer", "lizzieaprilxo": "I want more torrid clothes 😩 @aprilbutnariu @emilybutnariu @always_ari.22", "sarah.katec": "So gorgeous! I’m hoping for a wonderful day with my family for Christmas... and maybe some new pajama shorts too hehe 😆! @juliaaaa.37 @rilla_barrett @erin_inglis_", "grandrnathaniel": "Omg I want art supplies and plants! @prettyboywrecked @m00nm0th @littlemissleia45", "band_geek_music_freak": "I really want this money so I can get my next books for next semester 😭 @_zaavedra_ @bubbly_bee36 @sai_nudelta", "itsafilthyworld": "All I really want for Christmas is to be able to buy more for my family. 😪 I feel so awful that I can’t afford to get them more when they deserve so much. 😞", "enbie.exe": "I didn't even have any clue about what this was, I saw your pic in the thumbnail of my notification and legit shouted \"LOEY\" and that is the entire reason I'm here. Hello, you're a light, I love what you do, keep shining. Anyway, I'd really love a dragon onesie, or like...a giant dragon stuffy omg they have those at walmart 😭😭 I need them. @m00nm0th @tothecosmosandback", "babybatty96": "To be able to get my baby furniture", "carly_may_farrow": "Awwww I litteraly love ur hair u look so cute 😂💖", "sarinacastro88": "I want the gift of Abundance. It has been a rough year and especially these last few months for my mom being outta work and us struggling. I could gift her something really special. @lopezpink88. @its.evaaaaaaaaaa @highassangela", "jacflood96": "For Christmas I want Christmas decorations for my house! @kwill17 @marywilliams5 @allie_flood20", "jocelynn_hessler": "@novaturient.nomad @brenna_rhiannon13 @jena_fowler AHHH IDK WHAT I WANT.. maybe just for everyone to have an awesome holiday season and for all of my friends to be happy 🥺♥️", "taylor_2319_": "@irooyakkers @juweir2 @danikapricorn I feel like I need this amazon gift card to pay for my new addiction to my gel nail light 😂", "adella_rico": "@alondra_rico2 @alexandra._rico @alo_ricoooo For christmas I want sum rings for my sister and sum boots for my mom 😁 hehe", "holdingontolyrics": "all i want for christmas is for all of my friends to feel loved and happy and for more people to learn that kindness is the foundation of a happy life 🌸💕 @e_maccy @jx.nex @leabdb", "swazyberry": "Beautiful @va_niecy_uh @brklyncass @lizzettegarvin", "x_lenzie_x": "I love to be able to treat my momma so much more than I already have ! Cuz she deserves the world and so much more !! And some make up brushes cuz why not 🤷🏻‍♀️😂 @kxylxighx @morggg.x @aoife2000m", "mmlynn.18": "This year my friends and I are making each other gifts! I also wish for a tiny sweater for my ferrets lol @darbyattoe @verity_5 @kiramyatt", "jahphotography__": "@jimwenrich_99 @littlefishpiekiwi @_can_i_even_draw_ for my friends to get everything they want this holiday ♥️", "coldcoffeebby": "I've been trying to get a new camera for Christmas 🤍 photographer and all lol", "alannalennon": "I just want my family and friends to have a wonderful Christmas. Especially my brother since he's been having a rough time lately!! Also I'd love to get some cool weather here in Florida lol! @willfritz16 @steven_kelley18 @ginger_snapp92", "k.e.l.s.i.e.l.y.n.n": "I would buy popcorn and seasonings, I recently bought a popcorn popper and realized I had none of the things to go with it, and you need popcorn when watching the grinch! @kaela995 @meganiel_ @breezie_skies", "leeannaishere": "I want a watch for Christmas", "nerdmon151": "For Christmas I'd love to have my house cleaned out.of all the junk in it 😅 @drop_dead_beautiful_styles @alwayshlhbc @karenswensonn", "prettypretty3p": "@kilogram916 @amy_kidd @c.h.l.o.e.n.o.e.l.l.e For Christmas I would get myself a new dress 🥰", "sowrongitsdanielle": "all i want for christmas is the will to live SIKE I WANT HARRY STYLES’ NEW ALBUM 😂😂 (@msportyp17 @melp1219 @catelynmairex sorry but yall are my tagging buddies)", "therealslimjenny": "A new dog bed for my rescue puppy, Peach. She's already too big for hers and I'm not handling this well (I want her to stay small forever 😭♥️) @jcoltongoodfellow @megskankbag13 @therealslimmeggie", "mslawing": "The new UD palette! @lawing08 @jrlawing @allyau311", "_woodill": "All I really wanted for Christmas this year was a new Polaroid camera, hopefully I’ll get one but anyways, you are amazing, love ya ❤️@blazing.hot.cheetos @sw_poetry__ @unicorns_and_glitterr", "penny_208": "Something pixar cars for my son @deborahlynncox @kimberryberry @erick_heim", "tdiaamond1_": "Honestly all I want is to be happy 😩😭 @purplehair.lee @tamayojewelers @thereaalest_ love you Loeybug💙", "kmillz21": "For my 9 month old baby girl to get completely better from whatever sickness is plaguing her body ever after a several day hospital stay. @reaganhunter07 @millerremer @higdonreagan", "vincentvangoghaway": "all I want for Christmas is to be able to treat those I care about 🥺 @brenda.lee @taylorgilliss @journologys", "brilee76": "There are so many things!!!!!! @meshellkimble @andria_kimble7666 @mkimble30", "whatever.forever.x": "My pup’s birthday is Christmas Eve, so I’d love to get her some new toys and such! 😊❤️ @andrealynnv @madi_rae9 @kristina.c_", "loeybug\nVerified": "Verified", "addzenglish": "@imagrocerybag @sammybiebs_ @grace.english I want new gym outfits ☺️", "ichunkydunk": "I have been wanting to get a Chromebook because our laptop is broken and we can't really use it. @mozmarr @tmnchick @bobbi_bee011", "lili.rix_15": "I really would like just some regular art supplies for Christmas, nothing fancy just some artist pencils lol", "self_goddess": "I’m just now following you on Instagram after being a fan of your YouTube for over a year now and immediately am met with this gorgeous picture omg Loeyyyy you’re so pretty 😭", "renee_is_super_loud": "I want to get my twin something and my best friends something that is all the same because we call each the quadruplets @ravenregnier @kristiana.i.aguilar @rachael__sings", "jennyrfi": "I would like some black boots🤗👢🎄@jessi_charlene @copperfite @wind_wakin_link", "kaitlang": "You are beautiful! But what I would want? Maybe a new phone my screen is cracked. @tscrouch @korkibenson3 @rvaroyals", "jenniferdawn19": "All I want for Christmas is for it to snow! Haven't seen a white Christmas since I was a kid. ❄💙❄ @diamondking334 @too.sassy.4.you @the.littlest.lady", "sara_loca91": "I just want a new bed and toys for jaxon 🐾 and maybe a new lipstick for me 💋 @ppadilla81 @37_lvyvxa @chikita_lizzy", "jenny_williams9495": "All I want to be able to do is get my kids something this year 8$ an hour is nothing now a days and we are struggling to get by on the basics.😣😢 @good_guy20 @vegansfacts @jessiivee", "savannahkate0302": "I don’t have friends but I’d love to be able to treat my mom and kids this year 🥺💗", "nell_bells_": "All i want for christmas is the barbie dream house ive always wanted from the age of 5😍 @janetgrace_x @lottie_lock @shell.w14", "loeyslane": "i asked for a wig cause i’m lowkey sick of my short hair lol @jessicaraepearce @melissa_petzer @lizthemom1422", "hopesanchor_": "I just wanna be able to spoil all the babies in my life 😍🥺 @mayday_down__ @brii.mariie @alienvibes666", "amber_christinem": "All I want for Christmas is to spend time with my family❤️ @bgm7998 @erin.mcgg @courtney.melvin", "itsmechessiedene": "I want to give my brother a good christmas this year @bai.jensen @heytherelyss @kristinaevonne", "kekeslifeadventures": "What I want for Christmas this year, is for my mom to make a full recovery from her Stroke/Heart Attack. @help_me_god_23456 @redrose_2021_love @kieritaylor", "queenliufau": "I just want a good facial. my skin needs it! 💕", "carryingsleep": "@lizzy.j.hernandez @kateomstead @introducing_toni_hopkins I literally just want anything bts or money 😂💓", "andreaalopez_": "I want to give me mom $50 so she can buy herself something she always buying our Christmas gifts I want to give her a little something @rubenbarr_ @mlx.adriana @1ztag", "daniellekfg": "Merry Christmas Loey!!What do I want for Christmas?...I really would just love to be with me family...too late for this year but maybe next...@akristinel1989 @jlevans24 @beautyamab", "ashashcashrashmeow": "i want some more christmas lights for my front porch for christmas :) @merikayrose23 @ceeleebeth @delanaerin", "zacharys_mommy": "I would love for my mom to be back. She passed right before Thanksgiving 😭", "xoxo_vickyyy": "@_araceely_ @kayla1727 @gonzalezkaylarenee i have enough, but i want to get my friends gifts 💕", "madiecornish": "kinda didn’t have money to buy my friends gifts this year so that’s what i would use it for @oliviaasalas @angelinareimers @rachelrogerss_", "raejofsunshine": "i wanna be able to see my whole fam for christmas!!! @koleykimmy @_andrealawrence @lean.bean.boi", "courtcake3": "I would like to buy accessories for the puppy I’m getting my kids! @lildicke69 @carsoncolemann @l_adyd", "jessi_charlene": "@jennyrfi @wind_wakin_link @kels_the_queen I want markers for Christmas!", "hailey_j587": "For Christmas I want to get a cordless vacuum lol it’s kinda lame but necessary!", "filomena_xx": "I love you and your positivity so much Loey 💕💕 for Christmas I want a blanket with a photo of my 3 cats printed on it so I can cuddle them forever 💕💕 @alexcozzey @frandoingthings @maegan44", "poetickat_": "I’d get myself a weighted blanket. My anxiety is highhhh this year. @dabombmcmom @aphenegar13 @stinaloutina", "humbly_tenacious": "I want the patience to deal with my fathers alcholism and to be able to convince him to go to AA meetings. @alertincomingnerd @juzt._.peachy @_.viclee._", "alexiawynee": "I would buy my cats some treats! @daytmichelle @mirandaholladay @kelseyy.aa", "marissalm22": "I’d probably just get a few more things for my daughter and my expecting child 💕 @zcooker21 @jman_pics_r_neat @lunarcreations_", "mo.atlas": "I want all the sweets to satisfy my pregnancy cravings 😍 and a ride into the city to visit my best friend since i moved an hour away 😭 @shipleyalex @ur.weird.aunt @bastardofthenorthatlantic", "littlemermaidinwonderland": "@weblawless @erinthevampireslayer I want to get some ysl black opium perfume ❤", "yodledodle_": "i want new room decor @_kai.ley_ @mak.attak1 @bb2me", "annabiohazard": "@lilmikey_b @jessicaleigh_90 @properties_of_gabe", "willias01": "I would buy my daughter a ukulele. She wants to teach herself how to play ❤️ @manon.spamx @geebrownuk @kimwazza", "lynnblake1108": "I want your eyebrows for Christmas 💚 @rahhhhbin @jcrampe @cyborgslayer", "laurennnnwright": "I’d probably end up getting something for my friend @acortes_24 ‘s bday and buying some cat and/or dog food for my local humane society cause my mom won’t buy anything for them and they need donations!! @eli_conley_ @acortes_24 @_sofiamarasco", "allsevz": "What I would want most for Christmas is my health back. I've been ill for 13 years now.", "angelena.maree": "i have the same disney shirt!😁❤️🍪", "brittici0014": "@loeybug All I want for christmas is the Shane Dawson pallet The three people I would tag are @blondie_mdc @justin.braswell1 @destiny._.mize", "_sweet.creatures": "I’d like to take my mom on a weekend getaway! @gideon.and.friends @goldendoodlenamedteddy @labradoodlehenley", "eerie.elysian": "I’d wish for family to stop fighting and come together for the new baby🖤 @dusty_a @desiree_nickerson @matiwilliams13", "riverflown": "I wanna get myself a couple pair of leggings because I'm too thick so mine are getting holes in them 💀 @guava.aiden @gravitypants @jojearoni", "emilyn503": "@mammacaramell @makenziesheets_ @shxrry.txy I want more makeup🥺", "kaylislostinwonderland": "I'd like to be able to spend more time with .t family and to be happier. As far as monetary things go, I'd like just money bc I'm going to Disney in January. 💞", "immy_1717": "I want to get some band merch for when I take @anna.j00 to a concert next year then probably spending the rest of the money on my mum cos she deserves so much more than I can afford to give her @kisses_n_tequila @imxgen.xcean", "sold___my_soul": "I'd use it to buy my mom something, she deserves something extra. I only have one friend 😂😭 @zombychaoslayer", "crystal.breau22": "Love all your videos", "mrsthomas1127": "I would want a coffee maker because I have one year old twins and I spend all my money on them 😂🤣", "georgiasio_55526": "I want one of the Lego Harry Potter sets 😂😂 @kellsiejade @kiera_mc_xo @hollie_raisbeck", "_gabe_nunez1": "Id want to use it for my grandma and get her something for Christmas or just something in general for being there for me @meme._.z101 @x1sgusa @francis.dempsey.37", "aralyn.rivers": "I want fluffy socks @mads_edwards @sydneye__ @bbrennan_jjones", "sapphicshock": "I just want computer parts to finish my first pc build. 😍 @bi_grima @bubble_pop_cosmic @mmmkaykool", "underneathgrrl": "I want a spa day. @merderous @makelifeyourrunway_ @amb.nj", "ofpoetichearts": "i want my parents to not have to worry about me in college + to get my little brother a toy that's more friendly to his disability (there's a brand made for it but it's expensive-ish for a college student!) @bria.weisz @kelly.gd @klong2596", "raeganshelby422": "I want Mario Party 10 for Christmas! @dinosaurgrandma @aukelestabile @fandomtrash422", "kyriellelara": "You are so beautiful ✨", "mandyjess2108": "I just want cozy jammies and clothes, more RAM for my laptop, and a new headlight for my car hahaha @christiana1458 @katie__joy__ @ketohalfasser", "kerrrstinfischer": "I just want socks yo haha @kelciefischer @caitlinledger @sandruss2", "maycurtis24": "i’d like to get some pens and a few notebooks for the spring semester @marsbarmara @its_jeda @ema.loves.dogs", "lucia_1031": "I just want things to be better. @_donnaemm @aerykaaahhh @ryuzakitakashi", "jodzz_x": "I think I would get my mum a few presents as she has always been here for my family even through rough patches. She has been really ill with Lyme disease and viral meningitis so I would just love to cheer her up😊😊😊 @ig_liss_xo @ig.abbiex @domi200054", "carawrrr88": "I dont really want anything for xmas besides wishing my son doing well and keep improving and be strong so he can come home. He's was born prematurely and has been in the hospital since June 😢❤️ @cnuon_20 @xladylucc @jnefur_sing", "kasyn_markaelah_": "I want a new phone for Christmas 😌 @tabitha_904 @gangsta.barbieee @jazzi_tho", "queennjustyne_": "I really don’t want any material things. Just to be around all the people I love. ❤️", "katra_winchester": "I just want concert tickets honestly @sxaysxrongbby @k.dawkinz @kspellz_art", "dianamarie_g": "I’m gonna get myself a switch. @elisabet.ruiz @jafardagod @fh_lay", "rachel.kiddlevy": "I want a new mattress @eswaggyz @emily.mescher @hidden_valley_ranchel_", "christiana1458": "cute winter clothes @katie__joy__ @mandyjess2108 @flower_kid666", "martine.mcmurtry": "Want my baby to have the best Christmas ❤️ @182cass @gemmawilson11 @_xo_michaela_xo_28", "tiffanypoullete": "Hey Loey. I’d save that to put towards a shark steam mop. I’ve been suffering with ocd the past 5 years and this would help tremendously to not be afraid of the germs on the floor. I would’ve gotten it a long time ago but i lost my job because of ocd and I have to smart with my savings. Thank you! @kbriones83", "jess_morton6": "Gorgeous🤩🤩❤️", "_ranalapaige": "I would use the money toward a water bill I owe and don’t know if i’ll be able to pay it this month after other bills and Christmas shopping . #strugglebus @courtneyhedden @beccakennedy1 @sofreshsarah", "bluredxthoughts": "I wanna get something for my aunt to say thanks for taking me in and being my mom @marmarbinxs @edgywhcre @p", "__brooklynjensen___": "I’d like to get my grandfather a photo album (he has dementia and I’d like him to be able to look at photos without me there) and a ukulele @into_ag @muggleborn_gryffindor @beehumble_art", "the_heather_experience": "I'd likely finally buy myself makeup I never can commit to because anything more than drugstore price is out of my budget 😂I've been using the same dollar store eyeshadow for like 5 years now and they don't even sell it in stores anymore 😂😂 @breanna_cravens <<<also something for her but I can't say what because I want it to be a surprise but I can say it is for her baby on the way!", "dieerlebnisse": "@surrraaaaaa @queen_feryl @morganbstrain", "oofy_is_my_fav_word": "Your makeup is like so on point 🔥 I wish I could do my makeup like that 💖", "rachell.elise": "I want to get a new backpack for school! @aaaa_llison @helenpayne15 @rachelpayne18", "xxnooneactuallycaresxx": "Manga @illneverforgetloser @reynaxkitty @gracie.sturgill15", "breanna_cravens": "@the_heather_experience @breanna_spam__ @dylan.karn I would love to be able to buy my loved ones a Christmas present! They are all so deserving. And/or diapers for my daughter. Money is tight as I have a baby on the way and life has had many unexpected turns lately... So this giveaway would truly be SO appreciated. ❤️", "mohamad.hasani136625": "❤️❤️", "vahidbooty78": "🙌😍", "clarissa0521": "All I want this Christmas is to have a good day with my little family and hope that these little days we have of this year are the best with love and laughter 🥰 @rosecastro003 @kristinaga1101 @speedking411 wishing the same to everyone here ☺️☺️☺️☺️", "kayla_iguess": "i’d buy my dog all the treats and toys he could wish for 🥺 @yikes_layni @allxsvn @cursedncute", "wayleighhilson": "I want/need school supplies 😭 @mikaelaturkan @bruce.wilson.1650 @drummer122008", "melissabeas": "I want to be able to pay my parents back for all the medical bills and trouble I've put them through for being sick. @t.ofuuu @juliet.catulet @faithlynnphillipss", "charlitucker": "UR HAIR I LOVE IT", "xox_gingersnap": "All I want for Christmas is for these next 10 years to be the best of my life so far @madelinepaquet @_nicoleobrien_ @saveiya", "planet_jen": "I love the hair 😍", "saturnscheetos": "I want my dog to be happy forever @3_3_6.sylvie @_naimah_h_ @itzz.abby01 @red_is_myname", "carlie_rae22": "The only thing I’d really like for Christmas would be some new charcoal pencils to work on my art. Love you loey 🥺 @__alkane__ @dileomike19 @carlies_confections", "_6ixela_": "I would buy presents for my parents and grandparents @geekerheads @lindsykirkpatrick @alexiss_kennedy", "melaniedesroches": "I need textbooks for university 👩‍🎓📚 @shealynmay @brianna.sirju @melissahartxo", "selenacampos16": "I want my babies to have a good Christmas and maybe some nice smelling candles lol @mikeike77 @kika5150 @ceci_rose1986", "maciasspamms": "I would love to meet you, I’ve never been to Cali but trying my best🥺 @_918.debanie @beyond_melanie_ @melanie_diana_dat_best_", "dumbdana17": "i want your confidence for christmas🎄 @keltay92 @jasminefellerrr @teenage.fish", "maco7532": "I just want a purse from amazon . ❤️ merry Christmas loey!! Been following since day one ! @cr.issy @learningtobefearless @iamcardib", "abrcr05512": "I need some therapy shopping.... lost 3 fur babies in 2 weeks, R.I.P.! @mmmcoffeh @cursed_kitty @puckyou42", "kylxris": "how can one be so GORGEOUS", "haileycakes_123": "@haileyhoward15 @tayymcneall @tyshawna_hurd_", "king_ketron": "😍😍 Stunning 😍😍", "saramariemarkovic": "All I want for Christmas is for my kids to have an amazing day ❤️ and some wigs, since i recently shaved my hair off 💁🏼‍♀️ @ossmarko @marianne.o.heymans @pianozaurus", "jordanrellis": "@elpltt @ohdear.xo @cathyrollins_22", "vmontesparra": "I guess I'd buy something my dad's been wanting but wouldn't buy for himself @wendycollazos @juandavidarias1 @valentinaperezg"}