{"kimberleyrseath": "I don't know if you're still looking at questions but I was wondering how you manage to motivate yourself to follow a good fitness routine? I always struggle to get back into one especially when I've been ill for a few days and haven't done anything! Also I just wanted to say how amazing I think you are, you have had such a string positive impact on my life since I first found you on YouTube and I honestly cannot put into words how much I needed that in my life, so thank you so so much! X", "tifaskyy": "You're gorgeous!", "rachelgunn97": "Omg where is that shirt from? My question: Who's your favorite Disney princess and why? 😊", "sumshop": "With all the adorbs dresses/skirts you wear, how do you deal with chub rub or do you deal with it at all?", "lina_elgohary": "Not a question but a wish to do more videos inside the dressing room 🤗", "annette.w.m": "Agh love you ❤️❤️ what's your favorite song as of now?", "melsc489": "Loey you are so amazing and such an inspiration to me! Your story time about being body shamed by teachers totally happened to me too! I was made to wear tights all year round to cover up my legs ( we had a uniform) and was made fun of by my head of year teacher! Anyway.... my question is when did you decide to become a you tube inspiration and how do you promote yourself to get to work with fashion and makeup brands etc? Love you xxx", "pastellies_": "It's not fashion related, but what books are you into? ❤️ Also, I want to take a moment to thank you for helping me on my journey of self-confidence.", "carmentxu4": "Which countries would you like to visit? (Come to Spain!) I will love to meet you 😍 yo are great! I love you 💖", "gotata_elva": "What inspires you to be so confident with your size?", "kate.met.ohh": "You r the most beautiful person inside and outside i have ever met ! U have inspired me a lot ,because till the last year i was ashemed even to wear shorts ! U realy gave me confident and changed my life !!! THANK U SO MUCH 💋❤", "iz.shep": "How do you have the confidence to were bikinis (being a + size girlie), I want to know bc I'm to scared, also do you get hate. Love you lots 💗😘", "geekychicofficial": "Your hair looks amazing! I need to figure out my ponytail game haha 😂", "sarahisabelleee": "this girl so pretty gotta blast @rikkigarand", "jjulia.u": "You model!!😍❤", "ladybrauneis": "I am so obsessed with your hair color here!!! Makes me want to experiment with mine!!! 😘❤️❤️ gorgeous as always", "elintb_": "@catrin_8 ❤️", "alejandra_c_gardner": "@loeybug where did you get this shirt?", "chloe_mxca": "I LOVE LOVE LOVE this shirt on you 💞💞", "vickiyrdz": "Se ve guapisima..", "olivialoew": "What are your thoughts on monograms?", "demijoellea": "@danavanloo kijk dan hoe mooi😍😍😭", "danavanloo": "prettyy @de3m.a", "pascualcarmonaa": "@maria_laveda28", "louisepykermanxx": "Btw I think your really pretty", "ellieridgecain": "Hello my love! I'm 38 and have never been confident with makeup, just a bit of eyeshadow and eyeliner, as I have very dry skin and foundation scares me! Is it too late for me to learn how to apply makeup properly and where do I start? Thank you for injecting so much bopo into my life, you are amazing <3", "shannombre": "Hi Loey, I'm pretty comfortable with my body at the moment so I really want to try my first bikini this summer but I have a very self conscious friend who tends to point out others flaws, do you have any advice on dealing with this without hurting her feelings? Hope your day is as amazing as you are :3 x", "gillianbrennanx": "I love you💗 do you ever eant kids and if you do will you try snd loose wait to make the pregnancy easier/ safer 👑", "beyondthebasic1998": "@gillbrennanx blurghh true haha oh I know ive seen so many of them to tess also I just wanted to say", "zombiegoddess21": "What are some names you like for babies?? Would you change your name??", "teskekone": "Hi Loey, i really love your hair, what do you do to make it look so healthy?", "_.zaraireland._": "Would you move to Scotland @loeybug", "kimiiimars": "you will come to France one day ? 😍😍 Love !", "carmen_coetsee": "If you could go anywhere in the world where would you go? Love u so much xx", "caring_for_cortney_vsg": "How did you get the color out of your hair with out staining? And if it did stain how did you get it out?", "amandalynn1113": "Who was your biggest influence on YouTube to make you start your own Chanel???", "renstogram": "What is your ethnicity", "mandakay92": "{First of all, LOVE you and your channel!} I'm also plus size, and I have found so much inspiration in watching your videos and listening to your stories. My question is: How long did it take you to become fully confident in yourself? I've always been bigger. I'm in shape, but still visibly plus size, which makes me very uncomfortable.", "skylarlight": "Perfect👌🏻👌🏻👌🏻💙💙💙👌🏻👌🏻👌🏻💙💙💙", "lisahorn95": "What's your next hair move?", "future_famousx3": "How many pets do you have and do you plan to get more? 😸", "jameekayy": "As a kid, what did you want to be when you grew up? Are you happy with the career you pursue now? What are somethings you hope to accomplish in the future?", "jj.speirs": "Next big project? 🙊", "nicole_danielle_01": "How do you handle stress?", "meccasalaam": "What is your advice for anyone who wants to do beauty/lifestyle blogging or start a YT channel?", "georgia_at_heart": "As a soon to be army wife, what's some tips/advice you could give?? Btw you're so gorgeous!! 😊", "kayleighgravel": "What would you name your first girl and first boy? LOVE YOU LOEYY!!! 💕💕😃💃🏼🎉🎉", "julylinton": "Can you tell us more about the baby you lost? I had pass for a lost too and it was very hard for me, how was your experience?", "gravvvyy": "What's your favorite memory? Love you girl!💕💖", "crystal_jane97": "Are you and Alex okay ?", "hannahknappjenkins": "Just want to say how much you have and still do inspire me. I've always been a body positive person, but I've never loved myself and my body as much as I do now and I've gained that love through your confidence and wisdom. A lot of great things have come my way since I began truly loving myself and my body. Thank you for being you and inspiring girls like me everyday. You da best girl. My question is can we be BFFs? 👯 <-- that's us", "jhoanrodz.35": "Greetings from Puerto Rico. You are amazing !!!!", "isabelparkey": "how are you so confident???? you are my inspiration!", "sierrasollars": "Who and what inspired you to start your YouTube channel?", "crystal_geiger09": "@loeybug how do you stay so confident around other women. I always feel very inferior around other women like I'm never good enough!", "raphspuria": "if you could go anywhere in the world where would you go? (i love you btw)", "csalazar0517": "Can you do a video on your and your husbands story? How you met, memories, etc?", "oliviajtillson": "Do you like traveling all the time or do you get homesick sometimes? BTW YOU ARE MY FAVORITE YOUTUBER AND I LOVE HOW YOU SPREAD BODY CONFIDENCE MESSAGES YOU ARE THE REASON IM NOT ANOREXIC THANK YOU SO MUCH💜💜💜", "jedimommy4": "If it's too painful I understand", "burningpostage": "Fashion trends that you are not fond of?", "edends": "Would you rather win the lottery or live twice as long?", "not_your_typical_nj_chick": "Are you vegan or vegetarian?", "alexamarie153": "How do you enjoy making story times? Do you have any more for us? Do you think you will ever run out? P.s lysm!❤️❤️", "britney_1997": "Have you ever watched the show Once Upon a Time? Btw I love you ❤️", "sarah.tthomas": "How old were you when you started to realise your body more? And. What did you want to be when you were older? Ilysm 💖😘", "victoria._.gs": "How did you become so confident ☺️???", "eskarletl": "If you could be doing anything right now, regardless of money and responsibilities, what would it be.", "__bellagonzalez__": "If you didn't start YouTube what would be your other job choice?? @loeybug love ya gurl", "faithandmittens": "If you could choose a show to be your life, which one would you choose? And which character would you be?", "daphnetremblay": "How do you handle all the hate? Love you ❤️😭", "veexm": "What was the most embarrassing thing you ever did in front of your other half? 😛❤️", "_kabo_chan_": "What is your favorite memory from your childhood? ^^ 💕", "chrisssspy_32": "I'm plus size and I still don't have confidence in what I look like or what I wear how can that be changed?", "curvygirls78": "Your eyebrows seem different. Have you changed your routine?", "kjgonza": "What is your favorite part about being a YouTuber?", "rikers.penguin": "what have you learned over the course of being on youtube? ily 💓", "abbiebethw": "Do you self tan? And if so what do you use??", "sarah.jesmain": "If you could magically be fit would you want to?", "moody.but.groovy": "Most embarrassing story?", "katelyncarrigan": "You're so beautiful 😍😍😍💝💝", "imaloneinmybox": "How are you so self confident?", "thackeryybinxx": "What would your ideal career be if you weren't a full time youtuber? Love your light, energy and confidence!", "krisg_183": "When did you first get into makeup and how did you progress in it?", "_kelzone_": "Do you whiten your teeth?", "jessica320_": "When did you become so confident and what gave you the confidence you have now? Also I really love your videos! ❤️❤️❤️❤️❤️", "queen.of.georgia": "Do you think you'll ever do a South Georgia meet up? Love you gorgeous!", "taylor.gilbert16": "Where do you get your inspiration on dying your hair ??💜💜💜", "bl0ndie98": "If you weren't doing YouTube, what would you be doing? And why? and I love you 💖", "benzodiazepqueen": "Are you going to CurvyCon? It's gone be hype 😘", "christine_fehr": "What never fails to cheer you up when you're feeling down? Love you so so much xo 💖😘☺️", "jendd7": "Hi from Australia Loey 😘", "boardingar": "Could you give us your insights on sexual health for teenagers/adolescents? Love you so much Lo 💗", "maricahaase": "Any advice on how to make things work with a potentially failing relationship?", "kennedyjeannn": "How do you color your own hair? And with what dye?", "clairebear6211": "Can u ask siri why are fire trucks red", "doughy_": "Who are your fashion inspirations?", "gabrielleebruno": "How to be confident?", "toriemanderson": "Have you ever heard of/tried the brand of makeup called yonique? If so, what are your thoughts?!", "blonde_rehab": "Are", "veryberry_brooke": "Fave meals so I can try them???", "kennedyhayes9": "How do you stay so confident? I love your videos and think you are so gorgeous! Love you!", "allyshmallie": "What color are you considering dying your hair next? Ily!", "mackenzie_bishop0020": "I know you get this a lot but, really how do you stay so positive. I need some tricks. Love you so much xoxo thank you for inspiring me!! 💗💗 #AskLoey", "lilyy.tayylor": "What's your favorite type of animal", "mycreebrowneyes": "What inspired you to start YouTube and who have been your biggest supporters (besides your fans)?", "dark_rose1991": "Will you ever go to an anime convention?", "nikkirae72": "How do you stay so confident? #AskLoey", "amour_bliss": "What're your too makeup products. What can you not live without?", "alliegraceee": "Who is your favorite youtuber and Ilysm @loeybug", "dalina_28": "1)How are you SO AMAZING? 😭❤❤ 2)whats your favorite season 3)any advice you can give a girl who's struggling with finding her true self? You are such an inspiration to me as a person and as a fashion figure Thank you Stay golden 😊💘", "heather_gutentag": "You have been eating mostly vegetarian for awhile. What are you thoughts on going vegan?", "meranda95": "1)Bigest fear 2)most embrassing moment 3) who would you want to meet that's famous or was famous?", "sorry_im_edgy": "whats your advice to someone who has no prom date but wants to go anyway? how can I stay confident the whole night?", "ernieoliv21": "👸🏼Loey! How long did it take you to get to be so confident in yourself and what is some advice you would share from your journey of self love? 💕 I love you btw ❤️", "chilly_banana": "Something u wish you could do in the future", "theboredbitch": "What has been your experience being a military wife? How do you make it work?", "3rdmrsdoucet": "How do you shut down that little voice in your head that just keeps repeating all of the negative things that people and society say about you year after year. I've been working on it for years and still struggle nearly on the daily.", "oxglitterdivaxo": "When are you coming to Euless, TX so we can do lunch???? Lol 😂😂😂😂 💜ya!!!", "redhead_queenb18": "Hi ily so much! And you're my inspiration but I was just wondering which Harry Potter villain is your favorite?", "brittanylaurenxo": "If you could use your success & voice on YouTube as a way to change one thing in society what would it be?", "allmylovehailey": "What skin type do you have and which drugstore foundation is your absolute favorite? Ps, I love you so much! Thanks for being you💗💗", "blythe_spirit25": "Do you have any suggestions for formal dresses for bigger girls? (Military ball coming up, gotta go shopping 😖) You're such an inspiring person with a positive spirit and a great sense of style! Lots of love!! 💙💙💙💙", "natasha_mariexo": "Who is your favourite youtuber?", "tmwelch09": "Mexican or Chinese 😊", "kittypride212": "What are your measurements?", "rachel.phelan": "what's your favourite eyeshadow colour?? love you!! 💖", "rhi3698": "Don't compare yourself to other girls. I know it's hard when you're young because I did the exact same thing. I'm 18 years old and I still compare myself to other girls. That's why being happy with your body while you are younger is better in the long run because you don't want to get older and still compare yourself to others. You seem like a lovely person and you're beautiful. And you're very welcome :) @cutenkind", "sarahvwarner": "if you could go shopping with any celebrity/icon (dead or alive) who would you go with and why? Btw I love you and everything you stand for, you are such and inspiration!!! <3", "kaleyceleste": "What kind of makeup do you use? Cause girl your flawless!😊💖", "t_nt_n": "What's your current anime/manga obsession?", "isabella.vogt": "What do u think of heavier children I honestly want to know because I'm one myself", "bobipaigecharnock": "What are your favourite parts of your body ? / favourite parts about yourself ? 😘", "emma_marie_9.17": "I love you so much, tips for loving my body (even though I'm not plus size)", "m.j.evanss": "Im graduating from nursing school in 5 weeks and need a gorgeous plus size evening gown, suggestions of where to order from and/or tips for ordering? ☺ love your channel 😍😍😍😍", "elizabeth.aea": "If you were stranded on and island what 2 makeup products would you bring ps love your vids 😍😍", "juliet_sither": "What is your opinion on weighing your self and scales? I can't handle even getting on a scale at the doctors!! Thanks and I love you!!!:)", "julia_johnston_": "Would you ever consider having kids?", "heraddiction88": "What does your family and friends think about u doing videos?", "autumncee13": "Did you go to college or do any schooling after high school?", "siesie61190": "Where do u find your bralettes? I'm a 40DD and am having a hard time. 💗 u", "its.elena.duh": "Did you have any like prominent role models celebrities, family, anyone if so who, and what things do you try to integrate in your life now that maybe they inspired?", "abramowp": "When you travel how do select the right combo of clothes to have cute outfits for days without over packing?", "shekby": "Best advice you have ever recieved? :)", "jamiesullivan66": "Can you go a prom look book?", "yeaaahboyyyd": "Where do you mostly shop?", "savannajoi": "What video was your favorite to film?", "lillian.patzn": "What's some advice you'd give to your past self?", "bentleydoesitbest": "What is your favorite brand of lipstick for everyday wear. And I love you! Thanks for making me #confident", "inga2186": "Don't understand the point of it", "robynmbates": "If you could marry one Disney prince, who would it be and why? Also you're amazing and I love you ! ❤️❤️❤️", "thalyxo": "As a plus size woman how do you wear heels and stay comfortable? Xo", "kana_travels": "Would you ever but your hair short and dye it back brunette?", "hollyhipp_": "Why is makeup, beauty and fashion important to you?", "elyssamichellee": "How did you get started on YouTube??", "brookstaah": "Hey beautiful ,😊 what are some baby names you would love to name ur 1st child, boy and girl names? Yasss 🙆", "sannsley": "How do you stay confident while shopping????", "_katrinagleeson": "How much of your life has changed since youtube?", "shailenebreanne": "Best part about being a girl in your opinion?", "bethanylynne7": "How do u stay so confident??❤️", "miri_hedez": "When are you going to do a tour by latin América? Im in Costa Rica 😊", "irgendwieliebichdas": "What is your biggest dream?", "kisforkristine": "Who are your top three YouTubers you hope to collaborate with?", "talker_10": "How are you so confident?", "makena.claire": "what's your favorite type of video to make?", "choulymason": "Have you ever shopped at the PX on post? If so how do you like it and what do you think of the make up selection?", "bbysummaa": "who is your role model?", "audry_tm": "Do you ever worry about toxic ingredients in certain makeup products you try? What are your fav natural products.", "shirin_b_09": "How are you Loey? 💜", "life_as_ily": "I love you ! You make me feel pretty about my body. My question is where do you get all your cute clothes ? And what's your fav makeup line ?", "jkathaj": "favourite ballad? :)", "nickoltkachenko5": "Would you ever get plastic surgery or any type or similar but not surgical procedures?", "ellie_bryant_": "What's you're favourite lipstick? (I love you lots 💜💜)", "a.ttmss": "Favourite bikini brand? Ps I love your videos 💗❤️😻", "maddy_mackayyy": "Advice you would tell your 8th grade self (ps ilysm ❤️)", "unknown_label10": "I'm soo late ! But Loey i love you ! And when are you going to do a meet and greet in New Jersey @loeybug", "olivia_livesay_": "I love you so much!(: advice you have for prom??", "madisson.craft": "@loeybug what is the one bathing suit that you always tend to gravitate to and why? ☺️", "mirclanda": "Which brand of makeup is your absolute favorite? Also I just found you a month ago and I absolutely love your videos! You inspire me @loeybug 💙💙", "e.fallon": "what is your favorite eye shadow pallete?", "tomgrengren": "Will you be making it to VidCon this year?", "alexandrasanders_": "What's your favorite place you've been? and What's your favorite place/store to shop from?", "danifenii": "What was your prom experience like?", "just_a_teen_wolfie": "Are you getting any more pets", "mrshogan11": "Will you ever come to Seattle", "bettas_and_breyers": "If you could meet any county music artist, who would it be and why? Btw love you!!! ❤️", "holly_sparklez": "Would you ever want to own a makeup line?", "briannarayment": "If you have a lid what names", "sara.thorntonn": "Where do you think you'll be in 10 years?", "karlazamora93": "How did you become so confident?", "ivonnem143": "Do you have your future baby names pick out? If so, what are they? Love you Loey 💕", "roya_iravani01": "what is your favorite color?", "mendozagirl10899": "How do I deal with the fact that my ex has moved on and I haven't?", "a_cat_21": "what is your biggest deram?", "kristenguz": "What helped you build your confidence the most? Is there one specific moment that changed how you felt about yourself in a positive way?", "freakfarriswheel": "What's your favorite mascara for when you're not wearing false lashes? ❤️(I love you)", "sasha.oseguera": "Do you ever want to have kids ? Ps ily 😘😍", "scarlet_gitana": "What are your favorite stores to shop for plus size clothing on a budget?", "mollygibson01": "How to deal with mean girls", "kambria_jonelle": "Firstly, you're gorgeous and since I've found your channel my self confidence has gotten so much better, thank you!! 💜 secondly, would you ever go dark brunette? Like black or a deep burgundy color? Love you girl 💕", "lena.860": "What's your natural hair color?", "thiccris": "What are your top 3 guilty pleasure songs", "yellowcrayon13": "How do you get through bad moments? Not just talking about body wise but in general, how do you handle it when things aren't going right? 💗", "rachwiggs": "My question is where is that top from cause it is hot fire 🔥🔥🔥🔥", "miss_madimay": "I don't have a question but I just want to say how much I love and appreciate you. You are my role model and inspire me everyday. You have taught me how to love my big body and I thank you for that. You are a shinning light in my life. Thank you and I love you💖", "jeymeeportillo": "What's the fist step a person should take when wanting to learn how to love themselves and to build self-confidence?", "ofbooksandteaching": "I know you read because you've mentioned it before, I am a huge bookworm and I was wondering if there was any book or books that are your favorite or that really speak to who you are as a person?", "justaspoonfulofsugah": "What was your job before youtube?", "_skyl.ar": "What is your favourite plus size store. Ps I love you so much and your such an inspiration to me I love you have a good day 😘", "paigefg03": "What would you be doing now if you weren't doing YouTube?", "ashtonmccartneyyy": "Do you think you will ever quit YouTube? Or if you have a child would you continue to make as many videos? 😊❤️❤️❤️❤️", "kadiekai": "What do you want to with the platform you have now? Any big plans like a makeup line or collaboration?", "leahgable22": "When did you start YouTube? I love you!", "deannadunfee": "I love your self confidence and ever since I started watching you, I can't stop. How do you stay so positive about your body and what are your top tips for staying positive and what are your favorite healthy snacks and workouts? ❤️ btw I love you!", "k_enady": "CAN YOU SAY I LOVE YOU KENADY ROSE!?!?!? please. because i love you. youre fucking amazing and so inspirational🙌🏼☺️❤️💯💕", "lifemustbefabulous": "U are so pretty Loey! 💚", "batkitty81110": "did you go to college/do you want to?", "jamielynn_xo_": "Do you plan on having any kids? And I love youuuu❤️", "dailydebs97": "What sort of things do you do to keep busy when sick? (I'm sick right now and need something to do 😝) love you Loey and thanks for helping me be more confident with your videos you are amazing", "h.schoonbaert": "What is your favourite makeup product that you don't use frequently?", "myamarieexo": "How did you become so confident? And you are beautiful", "holly_adair": "If you had to live in another country for the rest of your life where would it be @loeybug", "stevecoffinart": "That's an awesome photo of you. Would you mind if I did a drawing from it? Oh, Pizza or Noodles? Coffee or Tea? 😎👍", "gracebowness": "Can you do your best British accent?", "alexmcnew5": "What is your favorite cocktail?! I'm a bartender🍸 at a local Applebee's and would LOVE to name one of my signature drinks after you! I watch you all the time and you are such an inspiration to so many people. I came across one of your videos last summer and let's just say you came into my life at a perfect time! 💜😘", "aeasealpup": "HOW ARE YOU SO BEAUTIFUL????", "kelceel": "@loeybug what can I do to be as pretty as you?", "nichole_baer0618": "How did you start out with your plus size modeling by the way I love you so much you are a huge inspiration to me. Stay awesome! 😄", "olive.__": "What are your top 3 favourite movies?? Would love to know ❤️", "neely_ann": "have you ever been to Arkansas? if not, you're welcome to come hang out with me", "aleyna_c": "What made you decide to start youtube ?", "adelaidekoolaid": "What's a hobby you have we don't know about?", "bethcphillips1": "Any tips from your journey about being 100% confident in a Bikini in public?", "c_aguilar77": "what is your most scariest paranormal experience?why? {ily💕❗️}", "shannon_mmiller": "Opinions on click bait", "katiebells14": "Where do I start with my makeup? I've never done my makeup or dolled myself up. My 21st bday is coming up(on Monday) and I really want to know how to do my makeup but without so many products(I can't afford many)", "fkc.20": "Have you considered ever having kids? I love you so much thank you 💕💕", "abbymz7": "What do u do to always be motivated and encouraged?? P.S. I wanna meet you and take a picture w/you. I live near LA so hopefully one day I can meet you.You inspire me so much. I love you beautiful 😘", "leeshy_nelson": "Im always struggling to find anything positive about myself and i just wondered what your number one tip was for being able to love yourself and be happy with who you are?", "gemmamurney": "What is your favourite tv show at the moment? ♡", "emelyluna": "What anime have you watched (your should watch ouran high school host club) I love you so much btw☺️🐣", "bristoljacksonn": "Can we go shopping together?? I love you!!!😘😘", "abbidabbi": "What are any tips or recommendations to deal with stretch marks?", "_sampick": "Are you my mother?", "rayraychelll": "Do you ever want children ?", "kaarrssoonn": "Where do you get your eyebrows done? :)", "hannahgraceostlund": "What is the best swimsuit suggestion do you have for plus size women who aren't every confident?", "sar.cart": "When you were just getting done with high school how did you decide what to do with the rest of your life?", "courtcorm": "If you could be any age right now, what would it be?", "whxtm.r": "but look through her profile.. like I love her so much @danielausually", "le_manic_": "What is your opinion on famous models like Cara D and Kendall Jenner?", "becksmaybe": "Have you ever used self tanning wipes? I'm a ghost and I need some help!!!! 😩🙌🏻", "anna.kosky": "What is your happiest memory from your childhood? Who has influenced you the most throughout your life? Thank you for being a constant inspiration💞", "alliecamryn": "If you could live anywhere in the world, where would you live?", "a_bandan16": "What kind of jobs did you have in high school, and what would you recommend? Should I get a job while in high school or not? Help please!!! Ilysm😂😭😋", "bekal_t": "I think your so pretty and I love how fierce you are...", "bec.kle": "Would you ever come visit Vermont? Who is your inspiration? What is the top 3 things on your bucket list? What is your favorite memory? Would you relive your favorate memory? When do you feel most confident or at your best? Will you be making any prom videos? Who do you look up to in your life? Ps you're my inspiration, ily♡♡", "ariannebilas": "Hi loey! LOVE YOU SO MUCH 💕 what's your favorite trip that you've taken this year and why! You're always travelling and it looks like so much fun :)", "nylenegarseeya": "Can I see a pic of you in elementary/middle/high school?", "kiararanallo": "Have you ever had any crazy ex boyfriends?", "sumrosiell": "Has anything paranormal happend often? I love you so much💕", "itsemjohnson": "Where's someone where you've always wanted to live?", "ivydelaney_13": "Would you ever consider visiting Alaska? And if you do, let me know so I can hug you for being my favorite YouTuber ❤️", "jess_hossack": "What does your dream house look like and where is it", "secretsnotliesx": "If you could only use one makeup brand the rest of your life which would you choose and why?", "erin_bradyy": "How do you stop yourself from comparing yourself to other people?", "kenz_capelle": "What keeps u so motivated", "phoebestripling": "will you come to Kansas City MO for a meetup I would love to meet you! ❤️", "sweetart1227": "If you had a chance, would you change your body for another or would you stay with yours ? 😘😘", "chikunfillay": "How are you so pretty? Ps love you 💗", "whyhelloalyssa": "Did you have a lot of drama in high school? And if so, how did you deal with it?", "blackie____chan": "When did you start feeling body positive and how do you stay body positive despite all the things media presents to us?", "makeup.queen659": "How does one be self confident when they have a different body shape", "brianna.nc": "If you could be any Disney princess or any Disney character at all who would it be and why ???", "miss.fitlick": "Do you ever have negative thoughts about yourself like you use to and when these thoughts happen what do you do?", "theragequitgirl": "did you go to college/what did you study and what career did you want before youtube became your job? do you see yourself moving into that career in the future?", "kareencrowley": "Would you ever cut your hair short? Also, you're wonderful!!", "jillianann26": "where is your favorite place to buy clothing? ❤️❤️", "notyobabygiirl": "Would you ever consider dying your hair strawberry blonde??🍓 I think it would look amazing. And hope your having a good day 😝 love you ❤🌸", "lilia_lickovski": "Biggest fear??", "watchout_for_selener": "How many bikinis do u own?", "katieoverla": "Do you see yourself getting any more little babies (aka your precious pets) anytime soon? All of them are so adorable they make my heart melt 😍", "oneandonly1990": "What's your favorite song ever ?", "alexaa_maya": "How do you dealt with hate and negativity on social media?? Btw I love u you're so gorgeous 😍😍😍", "lizzlu92": "What's your favorite \"drugstore\" makeup? Eyeshadow, mascara, foundation etc.???", "wittycomet": "Do you have any tips i can use to help me stop comparing myself to other girls? I generally have an ok self esteem but i always seem to find myself being jealous of other girls appearance wise, especially ones my significant other used to talk to. Any tips? Love you girly ❤️", "beau.and.me": "Have you ever thought of getting eyelash extensions? What do you think of them", "jessicampolite": "What are your tips for body positivity @loeybug", "carlyydiascro": "what was your favorite part of your childhood? like any traditions, fun vacations, special meals etc? btw I love you ❤️💚💘!!!", "anna.athompson": "Why did you want to do YouTube?? BTW ily 😘", "isabellegiunta12": "Thoughts on plastic surgery?", "monica.mekhlouf": "Do you listen to Halsey or Melanie Martinez, if so who do you prefer? LOVE YOUUU xxx ❤️", "princess_riker7": "Hi! I love your videos and you are such an inspiration to me! How did you become so comfortable with your body? I want to a plus size model but I'm in struggling to be comfortable. Much love❤️❤️❤️❤️ @loeybug", "angieprencipe": "Do you hope to be doing YouTube for the rest of your life? If you could have any other job in the world, what would it be?", "abbychristine13": "What do you recommend for someone who never acts on a crush to gain confidence to do so?", "mae.the.g": "What was your most awkward encounter with a fan? Love you lots!", "piecesofautumn95": "Favorite form of exercise and favorite vegetarian dish?", "leslayy_ann": "How tall are you?'", "h.m.m_photography": "What is our secret talent?", "callmejacky1992": "Did you ever do a boudoir shoot and if so how did you prepared yourself for a sexy shoot like that! And if you haven't would you like to do one? 🙊🙉🙈", "colombia_1989": "When you need confidence/ motivation for a party or an event what do you do for me its a song what about you?", "elenidickey": "Are you ever going to film your experience with your pregnancy? I've been wondering ever since that bikini/pregnancy test vlog.", "dani_port19": "Being the bigger girl has sometimes been a struggle a struggle for me and currently all of my friends are in relationships or experiencing things with boys. I've always been a pretty confident person with myself, but being the third wheel and the girl with no experience my question is, is it me or haven't I found the guy yet?", "my_existential_crisis": "Hey Loey 💕 What should you do when you have completely lost the motivation to do something with your life and you can't get out of this state of being? Any advice? Lots of love from Dublin 😘", "amelia_johnson": "Where do you get your favorite bathing suits? The pink floral one is so cute!!", "lilyeager": "how do you use clarifying shampoos to get dye out? love you!!! 💖💖", "ambypayton": "I'd you could have the wardrobe of any Disney princess or character what would it be? LOVE YOU LOEY💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗", "loey.bby": "Whats your style and where do you get your clothes! Btw Ilysm! 😚😍💞", "ellaawo": "What advice would you give to young girls who are struggling with body confidence? How can they learn to accept themselves? How did you?", "camilia__rodriguez__": "If you couldn't do YouTube, what would you want to do for a living?", "just_coriee": "What was most memorable about your high school prom?", "loeylovelane": "What colour would you like to dye your hair next?", "__tyler_bell__": "How do you keep yourself so confident? Any tips for being confident in yourself?", "queen.vegan": "What do you think about veganism?", "lowriaangharad": "One makeup product you couldn't live without?", "beautifullybig.lol": "Hey loey, you are so inspirational and since watching your videos my confidence with what I wear has grown and I would eventually like to help someone else. So my question is where did you get your confidence from??", "charlotte0010": "What's if feel like to be such a role model to young women everywhere?", "shaelynelson": "Whats you favorite lipstick color and line? Love u❤️❤️", "sarahhhh_lynn": "Do you think you face discrimination as a plus sized woman, and if so, how do you combat it? PS, you're gorgeous and I love following you on IG!", "imangelicaa_": "Any good book recommendations? P.S. i love you!", "ivarismadani": "How you gain that confidence? For sure im really jelous that i didnt hv confidence as much as you hv 😢", "megggggsssssss": "I live in England And I was wondering if America is actually what it's like in movies? 😊", "cheymarieexo": "What song or artist is \"your jam\" at the moment? :)", "halmargem": "What is your #1 favorite recipe that you make over and over again?", "loribethw": "Is there anything you'd like to accomplish that you haven't yet?", "kellymblaine": "@megggggsssssss trust me it's not lol", "marcydarciee": "^^ yes! Babies 💕", "makaylalynneaster": "You make me feel so inspired and I love myself so much more. What inspired you to start making YouTube videos?", "zoehincapie": "Who's your style inspiration?", "enmagination": "What's the best way to stay motivated with work/school/body positivity when being surrounded by negative people?", "jordan.ann.brown": "Would you rather have coke or Pepsi? 😜", "macaylabatch": "If you could suddenly become part of the anime world, which anime would you choose to live in?", "mady.kadangit": "What's your favorite piece of clothing that you own and why? Also, love you 💜", "marellasorella": "My biggest insecurity is my arms - they are big and wobbly and horrible, how do i get tthe confidence like you to wear spaghetti strap shirts and still feel a millions dollars?", "sasha.kislak": "Best advice for someone who is entering swim suit season and bought their first high waisted bikini?", "blueb4by": "How can I comfort/help a loved one struggling with an eating disorder? ❤", "the_mary_broxton": "How to get out of a rut?", "madame_harmon_": "How can I be as fabulous as you? Because you are freaking running the world ❤", "kierannriv": "Whats kind of makeul do you like to use ?", "bcart1618": "Do you want any more animals? If so, what kind?", "claire.tea": "how did you get to be so confident?", "halligallo5": "What's the scariest thing about growing up and what's the most exciting?", "deidra_latrice": "What is your favorite Disney song. Mine is Colors of the wind (Pocahontas) OR why should I worry (Oliver and Company)", "lauren_blanchard7": "What is your favorite song right now?? I love you so much!! You're an inspiration 💕", "disigney": "What is your favorite snack at Disney World/Land? Mine is definitely dole whip", "sophiegrant._": "How do you stay so positive", "orleadaa": "how do I open up to my significant other more because I'm comfortable with them but I'm scared?", "annies__photos": "Any advice on how to continue a relationship from high school to college?? Love your videos & positivity!", "cristinadgarrido": "I would love your advice. I'm a size 18, but am only about 5 feet tall. What is your advice on how to choose outfits that are still fun and bold, but also look good on my body type? I love all your outfits! But shorts are too long, or crop tops fit weird because of my short torso, etc.", "mxlissaclark": "Where do you shop at for clothes?", "caroline.ivs": "Do you have a workout routine? And can you do more try on hauls?", "moonlight_.mel": "What's your greatest memory of 2016 so far ?", "lili._1147": "How old were you when you had your first kiss ?", "jesikka_122": "How do you always stay so happy and confident😍😍 ps I love you", "veenac": "What's your favorite thing to do when you're alone?", "jennyemmlove": "What's one hair color that you've dyed your hair, that you would never dye it to again?", "lucycineaste": "What's your advice to people who are stuck in a rut? How would you work towards feeling better both mentally and physically? Your videos sometimes help remind me to love who I am, so thank you for being honest and true to yourself in all of your content - I think you help a lot more people than you know 💗", "tashamoorexo": "Have you had any recent paranormal activity? Xx", "editsbyjinxade": "Do you believe in some sort of karma, like your decisions/choicesvdefinitely will positively or negatively affect something in your life later on?", "brookephelinger": "What is the best advice you could give to girls in high school right now? ❤️", "shessoawkward": "How do you live fabulously on a TIGHT budget, like clothes, makeup, etc?", "rachhbehl": "Do you have any regrets in your life? Or something you wish you could relive? Luv ya! 💕💕", "freyaphernelia": "@amandakoersv Haha aw that's awesome! Congratulations! I'm just fed up of being told that we're too young, or that we won't last. To last 3 years when you're a teenager going through so much rubbish is pretty good going I think! ☺️", "ferral_unicorn": "Favorite Disney villain? And favorite dessert food", "missemily_m": "Who do you look up to? 💛", "paupcycle": "How can I stop comparing myself with others around me?", "xxunicorxxrobynxx": "If you could only chose1 what would you pick foundation and Eyeshadow or concela and mascara. Love you sooo much", "whitney.loupe": "What's your favorite thing about living in Texas?! Love you❤️❤️❤️", "chasitybsanders18": "What is your favorite facial feature?", "fernandaruballo": "I have a lot self image and confidence problems. How do stay so positive and have so much confidenc", "jadew0ng": "How do you manage to stay so body positive?? I'm always putting myself down for my body ;((", "a_nnika_rice": "What is your favorite movie?", "mirjamcheriefitness": "so beautiful", "ada.p09": "@loeybug how many children do you want to have in the future ??? BTW ILYSM 😘😘😘", "angelika.nelson": "Without making a whole video and possibly \"summoning the demons\" could you say if you've had any recent paranormal experiences after you made your last video?", "jennabennalove": "Favorite plus size brands/stores? (And links to their websites please :)) What is it like being a military wife? (I think he is army?)", "abby.then": "What was your dream job", "kassidyhalinski": "Hey cool cat😸My question is what's up and how are you? Rock on ya gorgeous gal!!", "emillyweise": "Tips on coping with depression/anxiety", "liv.kalemis": "What's a strange name that you really like? ILYSM! ❤️", "hannahjoan__cawley": "@loeybug How did you deal with the stress is gym tests/running in front of your peers", "marijogtz19": "I don't have a question, I only want to tell you that you are gorgeous and i love you and your dogs. Hope you read this little message from a fan in Mexico ♡♡♡", "cmikel_": "What's you're favorite part of applying makeup ? Love u loey xx", "alaynafields": "WHAT MADE YOU BECOME MORE CONFIDENT? @loeybug ‼️❤️", "sydney.yeah": "What self Tanner do you use?", "caitlin_hunt97": "What has been the most difficult thing about becoming a full time YouTuber? Ilysm too!! Have a great day!!! :*", "ericaxbrooke": "Who is your favorite style icon right now?", "katgandy": "Hey Loey, do you believe in spirit guides? 😘💗😘", "caren_connor": "Are you making any prom videos this year :)", "ahhh_curry": "Where did you buy your bathing suit from,in the picture from yesterday?", "sandruhpereira": "You're so pretty! You're my inspiration everyday to be confident in my body ☺️", "michaeladoonan": "what is your dream brand to model for? :)", "trecey87": "What trends will you be rockin this summer?", "manto2112": "Have you ever tried arepas? :D", "vanessa2229": "Hey Loey! I was wondering what is your absolute FAVORITE quality of your husbands? What do you love best about him? Love you!", "tinplejt": "Any update on paranormal experciences or you don't want to talk about this? Kisses from Poland:)", "miss_alyssa_chase": "Did you get to see @learningtobefearless at playlist live? I love you both so much!", "meganberryeet": "if you could change your name to anything what would you change it to and why?! 💘💘", "adysonm": "DO YOU EVER WANT KIDS, IF SO, WHEN??? LOVE YOU", "katie.bug": "I'f you could give one piece of advice about becoming a YouTuber what would it be ????", "mariah_mae13": "You order a lot of clothes online, how can you tell from just looking if they'll fit you right? Also, you're pretty much my fashion icon 😘", "breanna.j.s": "Any advice for a plus size high school freshman?", "pokemonabductor": "when did u realize u loved fashion?? Xoxo", "hevheartstruck": "What is your favorite way to cheer up after a period of feeling down about your body?", "x.bye.bye.x": "@loeybug how do you react to surprises", "ameliagoodwinx": "If you could travel back in time where would you go and why? Xoxo", "as_told_by_freebird": "I know this is is silly but my birthday is tomorrow id love a shout out... and my question is do you see another clothing collab in the future? Ps ur a gorgeous cupcake in a world full of muffins lol", "raymarie73": "@loeybug if you could choose one outfit to where for the rest of your life, what would you choose?", "jenn.matysek": "hey! I'm also a plus size girl but my clothes aren't NEARLY as cute as yours. where do you but most of your clothes from?!", "birchfieldmya": "what's the weirdest prank call you've ever made/received?", "arciliaericaxo": "If you had to choose one makeup company to use for the rest of your life who would you choose? ☺️☺️ love you!!❤️", "saintstrange": "When it comes to music, do you have a particular song that will lift you up every time you hear it when you're having a not so awesome day?", "chacon_kassy": "Hi! @loeybug first thing I love you! And second thing what's your favorite foundation right now? Does it cover your face completely?", "mackenzie.campbell": "What would your dream house look like and why💗💗💗💗", "lexisholmes": "When do you feel the most beautiful? 😀", "brooke_cozzi": "Can you tell me you love me? 😘😘", "savanaadolphsen": "Would you ever cut your hair above your shoulders?", "bananashanna": "Which part of Texas are you in?? Im in east Texas", "jord_anh": "what do you think of guys fetishizing plus size/curvy girls?", "natalieminniti": "if you could only travel to one more place in the world where would it be?", "cynchhiaaa": "How do you stay so positive and deal with days you just don't feel so good about yourself?", "heatherxflowers": "Favorite physical characteristic you have ?", "maddsxxo": "Texas meet up? Houston? Austin?", "nataliesweetpeach": "When you're feeling upset or lost, what is something you do to get your mind off things?", "megs_rob15": "Can you do a tutorial of the contour pallet form ISH that came in the FabFit spring box?? ☺️☺️", "rileykatew_": "What's your favorite place to buy swimsuits? @loeybug", "meghan_h92": "What's your advice for young women struggling with body confidence? What would say helps love yourself? Xxx love you so much ❤️", "morganjacques19": "Could you give me some tips on how to be comfortable in a bikini? Thank you so much for everything you do! Love you", "crismchelle": "Whats your opinion on Donald Trump?", "lucy_mcburn": "Would you ever consider going vegan !!!! Love you so much @loeybug", "_melcerra": "#askloey will you ever come to BeautyCon London @BeautyconTweets", "deardanaya": "If you could tell every single person in the world one thing, what would it be? ❤️❤️❤️", "httpsparkles_": "If you could only take 3 things on an island with you for life, what would you take?", "invitationalfunny": "Will you marry me?", "konfidentialglitter": "What do you typically eat in a day?", "_stefaniee_rosee_": "Where's your shirt from?!?!", "unnatural_meghan": "How do you know that a guy is right for you?", "jordan.bosma": "what is your favourite primer and foundation?", "sarahmarie.x": "What is your favorite Quote and life rule? 😊 greetings from Germany 🙌", "alexys.elizabethh": "Any tips on how to boost your confidence??", "frolik67": "How do you fill in your eyebrows?! Do a tutorial on your makeup!!", "hanafrank21": "What's your favorite store to shop at? (In person or online)", "alleyiana": "What are your favorite things to do in KC/ Missouri??", "shelleyclark13": "Who was your best dressed at the oscars this year?", "agnieszkasierotnik": "How to be the body positive, curvy girl, who is not afraid of what people say?", "chickzilla99": "Can you do a colorful smokey eye tutorial? By the way I absolutely love you and what you stand for! Go plus size fam!❤️❤️", "celynxevans": "#askloey any tips on being body positive? And can you do makeup tutorials? - I love you so much!", "love_jerbear531": "I want to bleach my hair but I'm scared that it will be forever damaged any advice?", "mallory_wheaton": "Can you review the physicians formula mineral powder 😁", "arlene_ashleym": "If you could be any anime character what you be!?!?!? HI LOEY!!", "paigelynn621": "What is your favorite nextflix-binge show to watch?", "holliegibsonn": "What's your favourite clothing store? X", "tinnaafaceee": "Do you have a favorite inspirational book you would recommend?", "ashlee.jade16": "I'm such a sensitive person and I hate my body. How do I get over my sensitivity? I just don't know what to do anymore😔", "utegirl89": "Will you ever do a meet and greet in Austin???", "_imogenroberts": "If you could take any risk without any consequences, what would you do? 💗", "kristynandcats": "What brand of dog food do you feed your pups?", "rebeccajeannn": "how do handle sadness and pain during the distance part of a LDR? im currently in one.", "sarama88": "How do you overcome and not care about what the others think ❤❤ I love you xx", "brittbecker1224": "What song instantly makes you smile??", "saucyerra": "What keeps you sane?", "abbiee.jaane": "Any advice for feeling like you aren't successful enough? Everyone around me has jobs and sports and ap classes and I'm not rlly doing anything...", "deer.hearttt": "Did you ever tell your parents you were struggling with an eating disorder? If so, how did you tell them?", "megscans": "You have helped me become so much more comfortable with myself with all of your positivity. How did you become so positive? It's truly inspirational and I would melt into a puddle of happiness if you could respond to me. You're truly my biggest role model ❤️ love you, sweet girl.", "geminirose1984": "Can I just get a hello? Thank you for inspiring me to love myself.", "kenziegagne": "Thought on CA (Canada)", "dayswithrose": "Would you ever get a tattoo?", "brigitte.b18": "What's the best advice you've ever received ? 😊", "mbhagroo": "If you had to move out of the country, where would you want to move to?", "nikkisaunderz": "How do you deal with acne? Do you have a skin care routine for keeping your skin clear?", "allisourousrex": "What's your favorite lipstick at the moment? Lots of love 😊💕", "lesbeom": "what are your tips on becoming confident with stretch marks?", "sannetetje": "Wich country would you like to visite in europe ? Beside London 😂😜", "miajtyler": "How you always so happy ? I ALSO LOVE YOU SO MUCH ❤️❤️", "rileypaige969": "If you were a dog, what type of dog.would you be?", "_alliwatson_": "If you weren't doing YouTube, what other career do you think you would be doing?", "urpantsrhot": "What would be your favorite drugstore/cheap makeup brand? 💕", "mauvaises_graines": "Cuuuuuute 😍", "natalie_chantal": "Would you ever go vegan considering all the health, environmental, and ethical benefits? ❤️", "pierceebabi": "Any \"words of wisdom\" for young teens struggling with self acceptance?", "doradwhit": "What is you favorite piece of clothing/most flattering for your body type....ps ❤️u!!!!", "jfate20": "If you did what other color would u want to dye your hair?much love 💕", "malpalisyourgal": "What advice would you give to your younger self?", "gorgeous_927": "How do you stay confident with your body?? Your my inspiration, you've helped me so much!! 💙💜", "rositaamaria_": "How do you know when a boy genuinely likes you? And would you ever permanently dye your hair like a rainbow ? Lots of love 💕💕💕", "stevenshrieves": "If there was one mistake you could fix what would it be", "victoriasaetre": "How do you make your skin look so radiant?", "rockyjackal": "Any advice for middle school girls that r self conscious about their looks @loeybug", "yuruanitaney": "@loeylane how did you gain confidence to wear bathing suits ?", "missmichelle55": "What is your all time favorite make up advice you've been given? :) I love you! @loeybug thanks for teaching me about body confidence", "drewcernava": "What is your favorite color? Love you Loey! 😘💗", "maeeshawaheed": "How are you so gorgeous", "imalegendqueen": "Where did you find the strength to go ahead and be body positive and confident when there's so much hate in the world? You're an inspiration to millions 💕", "jessicaajellyfish": "Where have you traveled and where have you always wanted to go?? You are absolutely beautiful btw and i love yoou:)", "paulina.jablonski": "What is one makeup/beauty item you can't live without ? 🍭", "ameliaedge16": "Can you name your favorite clothing piece right now?? 😍😍", "hsmines": "what makes you feel the sexiest??", "aricari_": "Were you always this confident? If not when did you gain your confidence? P.S love you😊", "fabiolacristell": "What's the most important thing you feel you're doing with your videos?", "stefanienixole": "Hi first off I love you to a million and seven pieces. Second, what is your favorite song at the moment and/or of all time?? 💋💋💋💋", "hannahesile6": "Hiii! I love you so much. I just started watching your channel recently and im obsessed you're so cute. Okay so what is worst/best part about being an army wife?", "noabellaandco": "Fashion/clothing must haves, favorite way to take outfits to the next level without being too fussy.", "_emotionally_distressed_": "Do you waist train at all?", "gwynne.pauline": "what kind of sports do you like to do? love you by the way, you inspire me daily 💗", "aiden_hatley": "I just wanted to say, that I love you so much and you have helped me through so much. What advice do you have for plus size teens, and what are some ways we can stay confident? Thank you so much for being you, you are so inspiring and I love you love you love you!❤️❤️ (Ps. Can we be best friends?)💕💕💕", "celestescarboro": "Can you be my wifey? 😍😘 Also, are you still self conscious about any part of your body, and how do you deal with that? ❤❤❤ love you boo!", "pinjapekkarinen": "If you could live through any Harry Potter book what would it be and why? And you're so beautiful 😍💋", "elliekershaww": "What is your favourite song?", "sasseestar": "Love your black lace top you've been sporting lately , where's it from?", "iheartnaps_": "What's the biggest challenge of being a military wife?", "jess_ellor": "What do you do on days where you feel sluggish/sad, you're gorgeous by the way I love you girl! ❤️❤️❤️", "smokeydabear___": "I love how body positive you are. How do you keep up with all the negative energy being thrown at you ? You're such a strong person! Xoxo -Sam ✨💋 @loeybug", "namelessjannica": "What is your favourite TV show?", "sarahhamza_": "What is your favorite article of clothing?", "sarahmccallum97": "What's your top tips for being body confident?", "angel.m.20": "Who's someone you miss the most", "jaelynnmjohnson": "Why do you think teen girls struggle so much with body image as opposed to grown women? Ps you saved my life ilysm", "mercedez.ryan": "I like my friend but I'm not sure what to do and I don't want to ruin things what should I do?", "brittsowellprice": "If you weren't a YouTuber, what would you be doing? You are beautiful and so inspirational! 😘 we would totally be friends in real life! 😁", "ruthlangleyyy": "Would you ever want to bring out any make up related merch??", "princesslysss": "How do you stay so confident? Especially with the new clothing trends I feel myself hiding in my bed not wanting to go out as the warm weather approaches 😭", "meltybunny": "You said a few years ago you really liked sweet lolita fashion, do you still like it and do you think you'd ever do a full coordinate?", "meg.seidler": "If you could travel anywhere in the world, where would you go and why?", "annaliseewood": "How did you grow your channel?💗", "latoyaave": "What is your all time favourite t.v series? (I need a new one after finishing orphan black!)", "amberlymatttison": "When did you start wanting to make YouTube videos?", "anoraavora78": "What is your opinion on stretch marks?", "angela_yacoub": "If you can Change one thing in the world what would it be", "megan.giunta": "what hair color do you want to dye your hair next??", "syd.blackford": "What is your favorite food or restaurant?", "itsalexia.j": "Any advice for swimming at school if u had that elective?", "julka_kossowska": "How do you stay body positive when there's so much negativity and presure everywhere?", "macyykayy_": "What size do you wear? I love watching your videos!!!", "sonotjaelyn": "Hillary or Bernie or Trump or Cruz?", "kstarlett": "Beautiful", "daisy_bow_bow": "Would you say your healthy?", "shaynaslife": "Are you and @learningtobefearless still friends ??", "archanareddy": "@loeybug what's your latest skincare routine?"}