{"shee_mexxican": "😍😍😍😍😍😍😍😍", "a_g_m_s_": "@gigiembry_ one to talk", "gigiembry_": "@dimiaivs I agree with you and all the other bitches that are being rude to you are just jealous af that they aren't beautiful", "dimiaivalioti": "@anmel2001", "htxblondie_21": "People throw rocks at things that shine @loeybug", "lourdesmartina": "😍😍", "danikanon": "@vin104", "vin104": "No se ve bien, esto es un crimen @danikanon", "sweetbaby1148": "muuuaaahh", "t00t20": "@t00t30 شوفي ام الثقة", "loeyslovebugs": "Nothing but respect for my president", "your.fav.isa": "@surprisingly_tall like tf @loeybug diden't ask for ur opinion. Her apearance isn't ur business", "emilia_59_3": "Gorgeous!🌻", "lizzyphan": "Hahaha I love society these your retarded ass opinion means absolutely nothing. Also you don't even know how I fucking look like little fucking shit dafuq you know hoe. Also hating on others makes you a twat . go do something else than spread negativity on the internet . if you don't fucking like her then GET OFF HER DAMN PAGE BITCH. Go look at at a dick or some shit if thats pleasing for you. She's a empowering woman who's has a right to post her account. Say what ever you want to say little bitch but if you choose to spread negativity for your own enjoyment because you have a God damn life then do you \"hun\" now hopefully we understood each other other wise your just wasting time now good bye. @dimiaivs", "mallory.chastain": "@dimiaivs then why would you look in the first place dumbass. she is confident and empowering others, so don't bring her down for doing something you can't. smh!", "carmingoddard": "Yall aint better because your thinner. @dimiaivs @anmel2001", "mo.d_x": "😳😂 @georgiaerica.x", "tianalazarevska": "... nekoi go smetaa ova ubavo, seksi?? Btw mazena ee 😟 @martinovska_hristina", "gee.geex": "Laterrrr😂 @molliedare__", "iamen_": "@dilekbzkt @hayetgamoudi c'est plus des formes la", "seldasulejmani": "@semra_sylejmanii mashalla😂", "dishafernandez": "jadyndias_23😍😍😍😍 OMGG", "youreallieverwanted": "@darcyscottland I'm so sad.", "rahafshehri_": "@ii.w1 ههههههههههههههههههههههههههههههههههههه", "ii.w1": "@queen_rahif خلاص حرام ههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههههه", "jacques.versteeg": "👌🌹💋😉", "mijn_insta_spaced_m": "And you should fock of @surprisingly_tall", "daphne_elizabeth_rempel_": "Would you be interested in starting a book club series?", "angeljeanty": "^boi if you don't", "brookestead": "@paisleyrobson", "braedentw": "Yh fuck off innit @simpati.co", "gracielynn_01": "Can I just applaud you... Like for real? I agree 110% with you! @simpati.co", "nurashero": "Very beautiful", "bluehaircamille": "That romper is so freaking cute! You look fabulous!! Where is it from?", "lopez2042": "Do you have a Facebook page sweet heart @loeybug", "simpati.co": "@graycloud_01 im glad you agree😊", "hristinam_": "Ok svetov otide vo nepovrat @angelovska23 @tianalazarevska", "angelovska23": "@martinovska_hristina i ja sum debela posle 😅", "gabriella1513": "@sarazarate_33", "christinamarielangston": "Where is this romper from?! It's gorgeous! 😍😍", "x3mary_": "@j_ivonnee", "mrs.doubtfire.dear": "My I ask how much you weigh? I know it's very personal so it's ok if you don't answer I just wanted to know because I seriously think I'm the exact same size as you lol", "evvver": "Beautiful in ur way sis", "pammywhammy845": "Another woman to follow @crystaldeveau", "corneliyy": "@jakubczerwicki", "jayjay.619": "This is cute @shaylaisbatman", "kam_machelle": "How did you get so comfortable in your body?", "erada1980": "@mahasiddiq الوجه جميل", "sailemxoxo": "Oh thank you for being on earth, you are an great inspiration in selflove for me. I have to take better care of myself.", "perksofbeinghira": "Fav pic of you😍", "notamuse": "@alexusmaryjane_", "alexusmaryjane": "@notamuse ha ha ha....", "sammy_twizzle": "Why are you so damn beautiful girl!! Lol love ya loey!! 💕💕💕💕", "anabellaaurea": "@leekhaa_ nOOOOOoo it would look cute", "blueslife_": "Woah that doesn't look comfortable 😱", "5_worth": "@rydesdono22", "_.l1v._": "How do you deal with body shaming ?", "loeybug\nVerified": "Verified", "tatefarman_photography": "I absolutely love you loey I'm trying to love myself more but I constantly compare myself to others, but you help me so much and I think you're gorgeous it means so much to me to have a positive female to look at who is 100% comfortable in her own skin. Thankyou! xxxx", "teresa.ege": "Hey girl! I know you already posted your q&a but I just wanted to tell you I'm excited to have found your channel! I grew up in an EXTREMELY haunted house and have never had someone be able to relate to that experience. Glad I'm not the only one!", "mariah_garcia29": "@jessie_sue29 I want this romper", "mikaylamarcha": "you are beautiful inside & out. I really love your YouTube channel & how positive you are towards yourself & everyone else. keep doing you i love it ❤️😘", "jaylynn.walters": "How do u stay so confident and not let others compliments effect u?", "loveforloey": "💓💓💓", "zajiraaaa": "I want to wear shorts but they always slide up and give me rashes on my thighs. Any suggestions on how to be comfortable in shorts? I always wear leggings and sometimes it's just way too hot for leggings.", "__megancooper__": "I just wanted to say... I am currently struggling with my body image and I'm dealing with Anorexia. I can't seem to accept myself, even now that I want to get better. I'm scared that if I get better but still have issues with my body image, it will only get worse. But watching your videos have helped so much. I think you're such an inspiration to the world and modern day society should have more role models like you. Thank you for changing my life and making so many people smile 😘😊xxxx", "gabxxriellee": "When did you start really begin to accept yourself? Xoxo I love you! You've helped me to realize I'm good the way I am! Stay gorgeous", "jillianhelenn": "How do you have so much confidence in your body when you wear bikinis and shorts? Ps, your so beautiful and confident! You look stunning on anything you wear!🌸", "anniebaderr": "I love your style and you, could you us a story on how your famous loey style came to be?Ilysm!!💕💕💕💜💜💜❤❤❤😊😊😊", "caseyjonelson": "@doyouknowihaveadog adorbs!!!", "jacksonperalta67": "😘😘😘😘😘😘💘💘💘💘💘💘", "sorina.adamovici": "Seriously tho, deep question right here, what do you do to get that fabulous hair? It literally always looks perfect. Could you please do a video on your magical hairstyles? Love you always :)", "izabellelazara": "@kendoken713", "michelehilton": "Love the romper, what did you get it?", "hermesmina": "❤", "michellelouise2412": "What's your fav holiday place to visit and relax", "cebon84": "@mbergie824 I LOVE this!!!", "laaaaaaaaaaaa293744": "I'm 15 and in year 10 in England I'm not sure what grade that is!! I'm feeling so much pressure at school I feel low. What got you through school and what did you do to keep yourself smiling? XXXX ps love you you are so beautiful!!", "bellogram22": "How often do you do your skin care routine and what all do you use to keep your skin refreshed?😊 I'm sure you've answered this but I've forgotten 😬 also I love you so much and I've found a lot of inspiration watching your videos ❤️❤️", "mbergie824": "@cebon84 very cute", "candiwakeley": "I love you by the way! ❤", "cheapthrillzs": "@lordweenbo", "mckaylalynnea": "She's is so cute 😍😍😍", "roxybluemoon": "Will you ever cut your hair short?", "bree.mariexo": "so I'm a 42 in my bust and it says a size 12 is a 41 and a size 14 is a 43. this dress I'm looking at is like an oversized shirt dress but the problem is I'm 5'1 what size would you recommend?!", "keperry01": "Do you like Starbucks? If so what is your favorite order! Love you so much!!😘", "uhhmartha": "what is something you have always wanted to do, but never got around to doing it? 😊", "geekychicofficial": "Fricking slay!!!", "deannamgarcia": "I like watching your videos but I have to say this romper doesn't fit you right. It would look cute if you wore the correct size.", "sproutedtoast": "Wow such a good look", "mariestina": "@johanna.mls", "mackenzie_tate98": "You are such an inspiration for me and I absolutely love you and your videos!!! But my question is where is you're favorite place to buy plus size clothing on a budget??", "lex_getreal": "Favorite TV show?", "shae6567": "How to feel confident in your skin? I am forever struggling with this due to society.", "haleighdarlingg": "Anymore special surprises in store for us soon? 😄", "katerina.sergeevna___": "@ameliiiiagamgam girls should be beautiful and to look after themselves", "jake_from_state_farm18": "You've got that superhero pose going on it looks great on you!", "allison.cats": "I've been thinking about modeling while I'm in college, but I suck at pretty much everything that has to do with modeling... What do you think and how would k get started ? @loeybug", "itmeshhh": "Hottie 🔥", "presley.bush": "What instrument did you play in marching band?🎺🎼", "ella.koen": "Why did you start YouTube? I love you ❤️", "kaileyo120": "Who is the most inspirational person in your life", "andycowie_": "Lmaooo @trostyyy", "ka.yyyla": "Do you like Coke or Pepsi products better?", "katierapxo": "Is it ever weird to think that people back from your high school watch your videos? That's one thing that would just feel so weird to me if I started a channel. Lol", "emilyralphpeck": "How are you?", "samantha.insideout": "Do you have a favorite perfume?", "redhead_queenb18": "Hi! I know you may not read this but if you do I love you so much! I've struggled with an eating disorder and mild depression since I was about 13 and having social anxiety made it worse as I grew up. I'm 17 now but I've been following you since last summer and this is the first summer I am going to be wearing a bikini and I just want to thank you for that! You've honestly influenced me so much and I love you for that. I live in mesquite texas and I am so happy you live in Texas now! I wanted to go to the Beauty con in Dallas to meet you but unfortunately I couldn't because I was sick at the time. My question is what is your favorite movie right now? I'm sorry for rambling but I just wanted to say hi and ily so much boo! 😁😚💁💅💕💞", "lashtonaf96": "Your my inspiration I don't know how you have so much confidence I really wish I was like you", "katariinanttila": "Your self confidence is amazing", "lailaxdavis": "What is your favorite song? (Love u)", "sel_2218": "You're my inspiration, I actually admire you , love you.", "rayners098": "Where do you buy all your clothes I mean seriously you have fantastic fashion @loeybug", "teachingpowerplay": "What is the best sports bra to buy and what do you do for workouts?", "radnadsman": "What advice would you give to younger girls lacking self confidence? Love you and your videos!💜😚😍", "cescakatew": "What do you do to stay happy and favourite shop?❤️❤️❤️", "meranda95": "Can talk about having body confidence while improving your body. For me not liking my body is the main motivator to work out. What are your thoughts on this?", "aylavau": "Pretty love the outfit", "jac3y": "What's your favorite make-up brand 🤔", "abigail.williams01": "do you plan on moving to la anytime soon?", "annesweet__": "@loeybug what's your favourite TV show and why?", "elizabeth.ericson": "Will you ever be coming back to Kansas for a meet up??", "samiellie": "🌸🌸LOEY🌸🌸 I adore you! will you ever come to NY to do a meetup or anything??", "thereluctantmermaid": "How do you handle set backs in your self love journey?", "emmaeliasen": "@_emily.estrada.001 his account is @tybabylane 😊", "emily_estrada.04": "OK thanks @emma_cathrynn", "samanthajjnelson": "Where are some of your favorite places to get your clothess", "tristanhicks2292000": "Will you ever come back to kansas for meet n greet (sorry if I spelled that wrong ) *you are such an inspiration to me I just wish I had your confidence", "nicefernandesster": "I just want to thank you for being an inspiration 😀 love from Portugal 😄", "terimichele": "pls do a meet and great in chicago!", "justynaqq": "😱", "megann_elisee": "I just recently found your channel and I love it! I was wondering How old were you when you first dyed your hair? I've always been scared to dye mine but I was wondering if you have any advice when it comes to dying hair? You are beautiful 😊", "guptasreya94": "Hi. I am an admirer of yours from India. I'm a really short girl, only 4'11. Should I always wear high heels? I love heels but after a long day it gets too painful to stand wearing high heels.", "kaua_awbrey": "What is it like to be a military wife?", "genevaa.g": "Hello Loey! You so incredibly confident and amazing and I wish I could be just like you! I was just wondering how you are so confident to wear whatever you want (and look amazing!!) I've bought many outfits that I love in the store, but then I'm to embarrassed to wear them out because I'm afraid people will judge me. Any advice you have I'd love to hear, thank you!💖", "kamryn_locke": "Where did you get your pet's names from?", "brownaly": "Hi, Loey! I've just begun watching your videos and I've fallen completely in love with them. I wanted to know: what are your top three favorite plus size retailers?! I usually only shop at one or two, so I would like to know some more options. Stay beautiful!", "jade718v": "What are the main clothing stores you like to shop at? And also what are some beginners makeup I should by?", "aubrey.dobrey": "Will there be any more paranormal/maybe some more conspiracy theory story time videos soon??:)) 💕", "marissaacamacho": "Where did you get that romper😍 ps ily", "hannah.newlands": "Babies?", "miasc_": "What year did you finally gain cofidence in your body", "bri_leger13": "Where do u get your clothes at like for real", "hermithippy": "wrong *", "mariah_mae13": "Where do you get your office supplies and other decorations?? They're so cute! (Also you're awesome and I love you and your videos) 😙", "taraaj2": "What's your favorite thing to do in the world", "yo_soy_latina_": "How do you keep strong , how did you get so confident", "marialynnbourbeau": "By the way you are beautiful!", "maidu530": "Would you ever consider designing your own shoe and sunglasses line?", "kriiistaaaaa": "Where do you mainly get your shoes?", "tanithetangerine": "On the days you don't feel as confident, how do you get rid or all that negativity? (Since I'm sure we all have our days!)", "lilyxandersonx": "Who is your role model and why??", "julieducharme_": "thank you @hthees , but actually i am in a very happy relationship with a guy who accepts me as is. however i'm witnessing my friend go through this and i dont know the full situation but that is what i do know. we have a circle of friends who keeps telling her to leave him, but she only justifies him and makes it seem like she is at fault. im not sure what to tell her anymore...", "therosecottagewitch": "How do you keep your life so organized?", "sahel_bahi": "Lovely babe 💋💋💋", "rebeccaann227": "Also how are your animal babies?", "simoneclimpson": "Would you ever consider mentoring someone on makeup/YouTube as a career?? :) .. And if so I'd love to be your mentee 🙃", "chloe_frisby": "@lucyanneckert13 I love this girl!", "savvsavannah": "Out of all of your amazing videos, which one is your all time favorite? P.s I LOVE YOU!!!💖💖💖", "peytonarrowood": "Do you think you would ever have children?", "mulaa.rosee": "fav lipstick brand?", "fghjtdcbhffvbhfc": "😍you are amazing😍", "abigaillperry": "I know you talk about this a lot but I don't really wear shorts that much and I don't wear crop tops but well I'm getting older and I now want to wear them but I haven't exactly gotton the confidence to do so and I have a bunch of skinny friends....what do I do? Or how do I get that confidence?", "michaela_rowan": "Hi Loey!! Hope you're well! What is your secret to wearing crop tops?? I love them standing up but then I can never avoid the sitting muffin top... any advice? Would be a huge help! 😊", "lilalyco": "What is something you like to do when you feel tired or stressed out? Much love. You killing it in this photo ❤️", "strawbrrywhine": "Any advice for younger girls following you? My sister is 14 & adores you.", "lisahardyxo": "Where do you do most of your shopping, I love your outfits and I find it so difficult to find clothes that fit properly! 💕💕", "isabelllaagentile": "how do you deal with stretch marks?", "taylorpaigeciulla": "What made you believe in paranormal ?", "sueheck_1": "Advice on start a YouTube channel", "sara.warner": "How old were you when you started loving makeup?", "grace.hollowell": "What's your go-to drink at Starbucks? 😊❤️", "fran.ces_1120": "What brands of makeup are your favorites?? I love u sm and your videos always make me feel better about myself!!😘😘😘❤️❤️❤️❤️", "mikhaila_borg": "How do you know you truly love someone? Or if you just love having someone?", "abigaelmm": "Dresses or rompers?", "chango_orisha": "You so toletua bbw", "tattooedwizard": "What did you want to be when you were a kid?", "low.key_madison": "How r u so confident with ur body because I need tip", "_mattierose_": "how do you get through the summer being so body positive. it's a lot harder in the summer to feel pretty", "heyim_amanda": "Did you have a job when you first started YouTube? If so, how did you balance the two?", "kayleighdesjardins": "What shoes go best with rompers? I always have a hard time matching them!", "lynsanity621": "What's on your summer bucket list?", "limihofman": "Where do you get your style inspiration from. Do you have a fashion idol? Love ya from Canada 😘", "lauren_k_h": "What is your favorite quote?", "bailey_alspach": "where is your romper from!??", "rhetayambaye": "So you ever plan to have a family anytime soon??", "faithandmittens": "If you could have the life of a character in a tv show, which show would you choose and which character?", "riderkelsie": "How do you wear bras with low cut tops or ones with cut outs.", "lswoods": "How did you build up your confidence to wear whatever you want? I'm slowly getting better, but what tips could you give on it, and ps I love you and you've helped me so much 💖", "yara.alsarabi": "What is your style? Pslove your videos your the best 😘🤗💜", "sophia.koskinen": "Could you share some embarrassing moments from the past? Love you 💕", "averybluewater": "What is your next hair colour?!?!", "samfloresxo": "Do you have a life motto you like to go by?", "ashantidesiree": "Who are some of your favorite plus size you tubers?", "allyson_gentry": "Who inspires you?", "anne_maria45": "I don't have a question but I would just like to say I admire you a lot because of your confidence and strength... love from Trinidad.", "liv.michael": "What's your favorite pair of shoes!?", "kellylatterell": "What is your proudest moment?", "nabeel_baloch90": "Beautiful💕💕", "a_rose_pie": "What is one of your biggest pet peeves?", "raphspuria": "What is your biggest beauty/fashion regret? XD p.s Love you!", "captain_minot": "What do you do with all the clothes bought for hauls/sent for promo? Either your closet I'd beyond amazing or your goodwill's favorite donor! 😉", "carriepalme.r": "Do you ever see yourself being fully vegan , and if so would your children be vegan? Love you loey!!!!!!!!!!!!!!!!!!!!!", "abbyadamsc": "Thanks for all of your positivity!! ☀️", "melodyemassey": "When was the turning point that you started loving your body, and what ultimately made that happen?", "emanxlf": "My question is: GURL WHY YOU SO BEAUTIFUL, DAMN", "madel.ine": "do you ever feel yoir confidence get the slightest bit lower if something youve wanted to try on doesnt fit? if so, how do you deal with that? i love you tons have a lovely day babe 💕", "sara.drescher": "Is there an animal that you've never had but really would like to have? P.s. I love you and your videos are the best! You're my favorite 💕", "bellamking": "what kind of meals do you eat? Can you do a \"what I eat in a day\" video?", "katrinaa.gagnon": "Name a country that you would never travel to and why ?", "ameliiiiagamgam": "@k_a_t_e_r_i_n_a_3105 You're a nasty bitch, seriously what was the point of writing this?", "seeraeuber_jenny_": "@k_a_t_e_r_i_n_a_3105 stupid, stupid, stupid. How pathetic your life must be when you look at someone so superficial! She is so beautiful, outside and in her heart", "amanda_noel___": "What's your favorite brands/stores to shop at?", "t_a_p_101": "What's you worst experience at the beach", "its.araaab": "Hey girl I love you any who what made you want to do scary stories on your YouTube channel @loeybug", "sian_marie_92": "Love the play suit 😚", "_llaurenn27_": "What is your favorite kind of outfit to wear in the summer?? @loeybug", "hbutccrxrbhnkjbcrfcyjbbj": "How do you cope with the challenges life throws at you? PS. you are so gorgeous it's not fair💖💖💖", "g.s.d5": "If you could change one thing in our world, what would it be?", "its.me.ariana02": "Do you have any tips on starting a YouTube channel", "lizziebeefree": "When and how did you start to gain body confidence? Did you use daily mantras, journaling, therapy, etc? I'm desperately trying to learn to love my body. But after 32 years of not liking myself, I'm struggling. I'm plus size and wish I could rock any outfit I put on. Thank you for all the positive energy you put into the world!", "ah.stevenson": "Wjat do you do if the numbers on the scale say that you're overweight but you have finally gained confidence in your body? @loeybug", "flowerdiezel": "What gives you purpose in life?", "skzapcic": "When you were a kid, what did you want to \"be\" when you grew up? 💜", "loiswright__": "Favourite video you've ever done?", "crazyconfettishop": "Hey Loey! Love you, your beautiful! I love all your vlogs, particularly your travel ones. Do you think you'll ever film a \"Plan with me\" video? Show us how you plan your crazy busy schedule!! XOXO, Monica 🌸", "ms.cabera": "Do you still struggle with being body confident sometimes? (cuz I do) And if yes wat helps you gain back your confidence?@loeybug", "emilyymalone": "What's your fav drugstore highlighter?", "kirstenanne_xx": "How do you get your hair so flawlessly curly? 💁🏼", "pvlespectre": "What's your favorite type of music?", "trostyyy": "Found josh is girls friend @andycowie_04 @jacobcordes @carsen_h_3 @ethocolp02", "kathrinsorgenfrei": "Every time a guy tells me he likes the way I look I just can't believe him and feel like he doesn't mean it because he wants to use me or fuck me over.. How can I overcome that?", "hollyibrahimx": "My friends always moan at me for not eating enough, but they don't know I have an ED, what should I do? X", "viky1808": "For you @audir100", "regannhunterr": "I suffer with a lot of anxiety like any teenager would, and dealing with bullies, school and my failing friendships doesn't help. How can I stay positive and learn to love who I am? Xxxx", "acorn_well": "Where did you get your romper!?😍", "eldrathorne": "If could only shop at one clothing store for the rest of your life which one would it be.? And what if your opinion on Torrid.", "daniellepapanicola": "When did you first know that you wanted to have a youtube channel? Do you have any tips for starting a channel, and who are some of the youtubers who inspire you and why? xoxo", "emilyjuppp": "What is your favourite film?", "phanicatthephilsco": "Do you have any tips on body confidence? @loeybug", "franniestill": "What would you have said to your younger self about your body that you would like to say to younger teenage girls? xx love you so much hun, honestly your such a special soul xx ❤️", "makinlie.taylor": "Firs of all I love you and your YouTube channel💜 I honestly could watch your YouTube videos all day long 💙 you inspire me to do so much in life and be thankful for what I have💚 I could go on and on about how much I love watching your videos but hear are some things I want to ask you💛 #1, if one day you have children what would you name them #2 if you cold change five things in your life what would they be #3 what do you see yourself doing in 10 years would you still be a YouTuber of wold you be doing your dream job and if so what is your dream job #4 what was your favorite movie when you where a kid #5 what's your favorite movie naw. ❤️💛💚💙💜", "kenzieeeg": "When you were younger what did you want to grow up and become (job wise). P.s. Love you 💜💜. You are an amazing and beautiful role model.", "pinjapekkarinen": "If you could live in a book's fictional world which fictional world would you live in? Ilysm ❤️", "angiegz03": "How do you like living in Texas so far?", "justme_nancy": "Where did you get your romper from??!!💗😍", "peachy_peach307": "Why are you so beautiful? 😩❤️🙌👏 @loeybug", "_.katiemce": "Do you like reading and if you do what is your all time favourite book and would you want to live in that story? Love you and you inspire me so much xx", "ava.randle": "How do you learn to love your body and be so confident it's impossible for me I feel ill never love my bodyxc", "sorelius": "Oh my goddess", "martynkaa_xo": "If you could go back in time to any moment in your life, is there anything you would change? ❤️", "enchantedelisha": "How do you keep confidence knowing you have to shop at bigger stores & little things like your feet hurting from walking or standing on them to much?", "seasonal_hobo": "Where do you get your confidence from?", "veggie_eat_lift_love": "I really love you and your youtube channel even though I'm from Germany and we don't have most of your products 😅 your legs look gorgous in this jumpsuit - so my question is: I know you do some training - do you have any advise for the legs? 🙈😁 keep going Loey - you are great 💕", "tylermil27": "@asheqane.text I hope that made you feel better.", "mastane_hosseini": "@eva.rose765 okay dear 😍😘💗", "kasvav": "Have you watched any good movies this month? :3 btw I think you're super cute.", "lotted3": "Will you be coming to Norway? Would love to meet you! By the way you are amazing! Love you☺️💜", "jesselizabeth.x": "What are your top 3 makeup brands? Love you loey xxx", "andysomber": "What weird nicknames have you called your pets?", "elliemaekirk": "would you ever consider doing a tour??💖❣✨", "_sandyraouf": "Dealing with negative family members in terms of body positivity", "niamhturnerr": "do you feel comfortable in public when people stare and sometimes laugh? Love you x💟🌺", "fayybarnett": "Would you rather be part of the goonies the film or standby me the film ??💜", "dawnchantelle": "What has been the hardest obsticle for you in fighting for body positivity? Did you need others to help you get to the point your at now? or did you have to find it yourself? Your vlogs are awesome. I always losve hearing responces to this question. Everyone always has a different answer for what works for their life.", "katyjones._": "Do u like peanut butter??", "jkathaj": "what is the first thing on your bucket list?", "ashnmorgan": "What do you see yourself doing in your future years to come? Will you still be filming YouTube or?", "tylamarieee": "Beautiful loey, i love you. Do you have any advice for dealing with life after a long term relationship? Xxx", "hattie_a_bm": "How tall are you?", "charlotte.hilliard": "@georgia.cramerr it's back!", "x_codierose_x": "Your so beautiful @loeybug x", "happiehippie17": "Are you ready for a family?", "eva.hennessey": "@asheqane.text that's so rude, she's perfect the way she is.", "michaella530": "Who is your hero?", "purpleparrots88": "@loeybug what is a favorite toy or bone you get your dogs?", "deni.ve": "How are you so confident? Like woaah😘", "kerrisnewell": "If you could have dinner with anyone in the world who would it be? Ps you're a truly amazing person, sending love from the UK😘 x", "trinabrynn": "how do I fall asleep faster?", "bymegankelly": "Love your channel and everything you do! Have you ever felt that you've overshared or regretted something you shared with your followers? What's the hardest thing about being such an incredible influence? Xxx thanks for your inspiration", "moa_starts": "Do you prefer taking a shower in the morning or in the evening? How often do you wash your hair? It always looks georgous!!! Lots of love from Germany <3", "sophiehenry_x": "Why is she so beautiful !!? #GOALS 💗💓👑👑 @emmakl19 @ddaisyyyx", "julka_kossowska": "How are you? I wanted to know how do you cope with the feeling that you're not good enough or you're not beautiful enough? Do you still get it? Love you ❤️", "elizabethvmeehan": "What would be your perfect morning!!xxx", "tilly.plummer": "Any tips for being confident?xxx", "amyy_.2": "Who is your celebraty crush? X amy", "sassy_stephhh": "Hi loey! Do you struggle every with being vegan/veg? Do you ever crave meat or soda and things like that? Any tips on how to be healthy and slowly turn twords vegan/veg? Thank you!", "egorovaave": "@shinmintae3424_ oh, sorry 😳", "wellsca86": "What are some of your favorite elf products?", "madelaine.fn": "What type of food would you eat if you wanted to get fit?", "agathelegay": "What do you sing in the shower ?", "lauren_keilani": "Any cool tattoo ideas? Love you!", "ljpopsey": "I love how confidant you are! Good for you! It is inspiring ❤️", "ihearharmonies": "Hey! Just was wondering if you have ever had any withdrawls from your eating disorder? How do you carry on in the world today and how has these withdrawls affect you?xoxo much love💕", "janexlowe": "What inspired you to make a YouTube account and promote body confidence?", "madelinescalvini": "How can I wear shorts without being so embarrassed of my cellulite? 😭", "s_gustowski": "I have blackheads all of my nose, forehead and cheeks, what is the best product to use to get rid of them??", "courtney_m_robinson": "Do you prefer having your makeup look amazing or wearing the most amazing outfit", "rileyyjones": "So far what has been the best life lesson that you have learned? How did you learn that lesson?", "grace.e.sanders": "What is your favorite book?", "sarahschulist": "what was / is the best day or your life? what was the worst? PS I LOVE YOU ENDLESSLY AND IMMA MEET YOU SOME SAY I KNOW IT💗💖💖", "instaprosserin_": "Why are you so beautiful?😄😊", "bitchpolartastic": "I'm getting a lady boner hahahaha so cute", "lucyruthers": "Hi Angel, how's your day? What things have you achieved in life that you are proud of?", "juanapant0ja": "What is the meaning of life? Lol😂", "helenakoffman": "What is your favourite lipstick at the moment? Love you xx", "tiffanyswarts": "what's your most traumatic experience with a \"friend\"?", "cristinadgarrido": "Do you have a workout routine? What is it? Sorry if you've said before, but I'm a new fan! I'm also plus-sized, but you look much more toned, and I'd love any tips you have. :) ❤️", "jennjennrejon": "Do you sleep with your sheets tucked in or out? Love you lots 💜", "millie.heaton": "Do you ever want kids", "sophiehorwitzhirsch": "What a radiant, beautiful soul you are ✨💫🌟💛", "alorahrae": "are you traveling fun this summer? If so are going shopping for it? Because please do a hall 😇😇 p.s i love your videos and your confidence 💙💖", "ciararoyea": "What are your goals for this Summer? 😊 ☀️", "em.reedx": "If you had to go to space and could only take 3 things, what would they be? X (I love you ❤️)", "alysa.ann_": "What do you do when you're in the middle phase on loving your body and hating it at the same time", "littlemrshayes": "What did you always want to be when you grew up? If you weren't a YouTuber/model what would you want to be doing?", "beccaaaamiddleton": "What is your least favourite colour and why? ☺️❤️", "whitnzzz": "Omggggg where did you get that romper nd what's your favorite highlighter atm?", "deniozt": "What inspired u to make a channel?", "cascio.lindsey": "You are so beautiful!!❤️ how do you stay so positive?", "nickiashley": "Where do you want to travel ? Love from germany xx", "danaca.love": "I love you! ❤️ Favorite genre of music? ☺️", "crxo._": "😍😍", "baileygoutierrez": "Where is your favorite place to shop? Love your videos so much btw😍😍", "shawnabutnot": "What is your favorite part about summer?", "alanaabrookss": "Favourite childhood memory? LOVE YOU ❤❤", "mescheritzki": "What's the first to come to your mind when you think about home?", "laura.sotor": "What the scariest thing that has ever happened to you that has been life threatening?", "gabylunac90": "What is your favorite part of your body that make you confident , and what is your less favorite, and why? love from mexico", "frutasfrescas1999": "What is the best piece of advice you could ever give someone?", "annaerbchavez": "I don't have a question but I just wanted to say that I love you and everything you do. Thank you for always being such a sweet and inspiring young lady. ☺️💕 @loeybug", "chelsiesnedden": "What inspired you to start makeup ?", "imtiffanyblair": "What's your advice for someone who feels behind in life?", "ashley_naomi_elizabeth": "This isnt a question, but after watching your videos for over a year now I finally built up the courage to buy my first bikini after being plus size my whole life, and I just wanted to thank you for helping me build my confidence through your videos! You're incredible! 💜", "zhanibekovaat": "@tastaganova_", "heyyyash17": "How do you keep your hair so healthy???", "casperthefriendlymua": "Your tummy is so cute! Thanks for making me feel like mine kinda is too! You're the best, Loey!", "firefighter38204": "What is your biggest pet peeve??", "priscilla_oregel": "how old were u when u had your first bf and kiss?😂😱", "xxbeckyxx92": "Do you want children and if so how many? Do you like any particular names? I love you btw 💜", "felycia_carbajal": "Where do you find all your clothes as a plus size myself I can never find as cute of clothes as you do please help.", "eva.wooller": "Thoughts on New Zealand? xx", "cherriesandfaeries": "What would you like to see yourself doing/busy with in the future?", "kaybeelby": "What is the new colour for winter? :)", "ashleeemarle": "😍😍😍", "cinkari": "@dee_rod28 so cute I can see u wearing this", "meleessalebus93": "Dear Loey, you have really helped me to appreciate myself and my body more. Before I used to think there was something wrong with me, but now I'm much happier as I am, so thank you for your inspiration ❤️ Now that my love rant is over, we know you have dogs but Do you have any cats? If so what are their names? 😊", "missytohm": "If you could live anywhere in the world where would it be?", "janessa.compere": "What is your favorite thing or things to indulge on? It can be ANYTHING! 😊", "sierraquad": "What is your absolute favorite article of clothing? Thanks for making your videos and inspiring us to! #askloey @loeybug", "jbm192": "What is your all time fav comfort food?", "ashley_elaine15": "What age did you move out and were you prepared? How did you save up for a house?", "littleblondehomie": "Advice on girls going through heartbreak? Advice on long distant relationships? Love you. 💋", "mfischaaa": "How can I help my fiancé feel more beautiful and help her build self confidence? I find her to be the prettiest and most beautiful women I have ever seen and I just want to help her see what I see. Thanks for your help! :)", "taylafred": "Favourite makeup brand???? ❤️❤️❤️", "princesskay_xo": "Odd or even number?", "queerphotographer": "How can I deal with bullies at school who treat me badly cause I'm heavier?", "arguello__": "Do you shop at torrid? If you do you should apply to be the next torrid model ? 😭 check out @torridfashion", "aliciafayshand_": "If you could say one thing to the people that made high school a living hell, what would it be?? ❤️❤️ @loeybug", "lilygracenelson": "What has most helped you heal (mind and body) from your eating disorder? Also, I absolutely adore you and everything you do astounds me. Thank you so much for your influence and inspiration in my life. All my love to you Loey. ❤️", "meryl.jayne": "What is your stance on plastic surgery?? Is it part of body confidence or does it undermine the idea of you loving your original, natural self?", "unfollow.account.no.longer": "Beautiful 😘❤️", "sarahmhastings": "What's one of your guilty to pleasures? 💖", "sophie_lhw": "Where in the world would you love to live?? Love you!💖", "whatup_mb": "If you had the chance what would you tell your past self and what you tell you future self?", "ffelisias": "what is your favorite artist at the moment?", "madison_hyland": "Would you change anything about your life/ do you have any regrets?", "bombassootd": "How does it feel to know that you've inspired many to be confident in their own bodies?BTW Love you 😍😘💖", "jasminefloraa": "What's your advice for a plus size 14 yr old girl who gets very self conscious? Love you loey💘", "kylie.windy": "do you ever feel down on yourself or less confident when you see someone \"prettier than you\"? I love you Loey❤️❤️", "anthony_kaitlin": "Ever coming to Minnesota?", "kella_2017": "WILL YOU BE MY BEST FRIEND?!", "stellmybelle": "Do you like to bake? If so, what's your favorite dessert recipe? (If you do cook/bake it'd be SO cool if you did a \"Cooking with Loey\" video) love you 😘", "tasha.baker": "Did you ever think you would have so much impact on people's lives? You give me hope, keep doin you💗", "jess_hossack": "If u could travel anywhere where would u go luv u 💗💗💗💗💗", "laurenhaejinkoo": "If you could be any disney princess, who would you be? And why?", "emilylaurencorbett": "All time favorite tv shows and movies?", "sarah_elizabeth130": "How do you get to know your crush without making it seem awkward?", "grracemiller": "What's your favorite foundation for the summer time?", "bum.ble.bee.s": "How do you maintain your confidence? I always have trouble with being confident & comfortable with myself in public, especially when I feel like everyone is staring at my body in a disapproving way. Love you btw! 💕💕", "laceyjenkns": "😍😍👑💧", "barbara_19xx": "Would you rather have Fingers for eyelashes or eyelashes for fingers?", "rsmistletoe3": "What's your favorite book?", "alexiss.romero": "can I have your confidence??", "aldabrowska": "Do you like read books? What is your actuall fav book?", "aliyahabbasi": "what's your favorite part of being a YouTuber? ps..I love you so much!!😍💓", "margsux": "i wanna start off by saying u have contributed so much to my confidence growing in the past few months. i can't thank you enough. love you loey. my question. how did you find a group of friends that supported you and made you feel good about yourself?", "shannon_gm": "Where do u get ur clothes?!", "angel.cruz007": "I just wanted to say that I admire you so much and I'm so happy I can relate to you so well it's incredibly motivating to have a role model that's like me. Anyway I wanted to know what you're most excited for this summer! 💘💘", "statico93": "Have you ever caught yourself comparing yourself to others? If so, how do you try and keep yourself from doing that or from letting it get to you? Btw I love you, you are such an inspiration! ❤❤", "natalienicks": "can we be best friends??? I'm sorry I know this is a dumb question and a lot of people have really great questions I would just love if I could have a friend like you ❤️❤️❤️ love you lots loey", "debluvsmikex3": "What's your hair care routine?", "utegirl89": "Any favorite products or things you do to your hair for the crazy Texas humidity?? I have long hair and can't wear it down half the time lol", "_klp__": "Do you have any tips on how to create a morning routine w/makeup for a rushed morning", "just_coriee": "Recommendations for cheap, colorful lipsticks and what clothes to pair with them.", "lizzie_makeup_artist": "If you could collaborate with a company who would it be, and why? 💜 I love you", "theselflovemamaxoxo": "Hey girl heyyy!! I love you💜 What advice do you give to other YouTube body positivity vloggers like myself? How do you stay successful in the YouTube industry? Thanks Loey💜❤️", "lauren._.victoria": "How do you have so much body confidence?", "oliviaanabelle": "Do you ever have any regrets about sharing things online?", "destinyquarles0000": "Any tanning lotion you prefer (of you use it)???", "tararosecasey": "I if you could chose whether to be a boy or a girl for the rest of your life what would you choose? Love you so much x❤️👑", "shelleyyy": "What do you do when you have failed so many time on achieving one thing ?", "liz_hay": "@loeybug who are some of your favorite music artists or songs?", "kaylacolleenx3": "I love this romper", "xolamborghini": "Are you a vegan? And if not, would you ever go vegan?", "mananaleb": "What is your craziest, most memorable moment in your marriage ?", "sweeteapiemily_19": "Do you have a routine to diminish cellulite or have any tips to do so?", "hayleyarielle": "Do you have any tips or tricks to stop shorts from riding up your thighs when you walk? I haven't worn shorts in years because this makes me very self conscious. Any advice would be appreciated! @loeybug", "danifenii": "How can I keep body confidence when my family is constantly shaming me for my strechmarks?", "little_edwards": "Have you ever thought about visiting Oregon? I live in Southern Oregon, and hope to meet your beautiful self one day!", "mads_fj": "Hey beautiful!! Have you ever been to New Zealand?? I totally think you should visit 💜", "lifes_glitter_gold": "Who is your biggest inspiration as far as people in the public eye? How do you feel about plus size confidence and how its being such a positive movement compared to years before when it was almost frowned upon to talk about body issues! Love you girlie!! @loeybug", "_rhiannonfaith_": "tips for being confident, I'm 16 and my self confidence is so little..", "sarahdubs18": "✨✨✨✨✨✨✨✨ what is the hardest part about being in a military marriage?", "okaymikaela": "What is your favorite ride or attraction at the Disney parks? Mine is Tower of Terror 🌹 @loeybug", "komododragonz": "What was your favorite childhood movie? I love you!!! @loeybug", "absolutely.shawn": "what are your travel essentials? ilyy 💓", "sarapuellman": "How to be confident wearing swimsuits? I'm a new subscriber and I think you're awesome❤️", "lakyndanielle": "What is your favorite college memory?", "nanacottiz": "Advice for a good marriage.", "chloe_mxca": "Who's the most inspirational person in your life and why??", "alicyam92": "You look Great @loeybug", "pattymayo20": "What are 5 books everyone should read?", "rad0016": "When traveling on a plane are the seats comfortable for you being plus sized? BTW I love you so much you are beyond beautiful 💙 @loeybug", "aleyna_c": "What inspired you to start a YouTube channel?", "paigepaigevictoria": "Do you have any tips for someone wanting to transition into a vegetarian life style? 😊", "alyssabacaa_": "What are you most confident about", "rhi3698": "How did you build up the confidence to wear a bikini in public? Have you ever worried about people's reactions? @loeybug", "marvelfangirl_97": "How to tell my parents that im ready o wear less conservative clothing like crop tops or a two piece swim suit and Who is your role model?", "mystifiedmonica": "What's your go to hair product? 😃 your hair is gorgeous!!!", "bethanyhucks": "How do I be confident like you?", "brianna_lynette": "@loeybug If you had the chance to go back in time and give your teenage self some advise what would you say to her? Love you Loey! You are truly an amazing inspirational person ❤😙 #AskLoey", "carinna.m_": "What's your go to running late comfy outfit?", "kaitmercedes": "One more--I'm not very comfortable wearing jewelry because I think it's too much, but realize an outfit is incomplete with out it, any insight on a beginners guide to jewelry wearing?", "sahar.alasiri": "@xlolysj", "chlobug11": "Favorite motivational quote? 💙 love you!", "paddikakes": "#askloey @Loeybug in some of your videos and vlogs, you've mentioned that you're a vegetarian, what kind of tips and/or advice do you have for someone who's seriously considering becoming one? BTW I love you so much, watching your videos are what make my days :)", "holisticbeautypdx": "Tips for someone who wants to start a youtube channel?", "m_thomz": "I just binge watched sooo many of your videos! I love you, Loey! ❤ What's your favorite way of perking yourself up?", "tessa.e.cox": "Is it strange that I feel like we are best friends? Also, how do you get over when people say mean things about you being plus size?", "magaacarmona": "What inspired you to become a fashion vlogger? You're such a beautiful person. Love from Argentina <3", "sandyk7": "What's your favorite city you've visited ? If you had the chance to collob with a makeup company which would you want to work with?", "niaskindaneat": "What's a challenge that you've overcome so far this year?", "abi_bordelon": "What is your best advice to a girl who isn't too sure about who she is yet? Btw, you have been such an inspiration to me for the past 2 years. Love you loey💕", "lexi_belle08": "What's your dream vacation? 🌎✈️", "bettiwarrior": "Are you gonna be at vidcon?", "karii._.mew": "Hey loey!!! Any tips on makeup for beginners? I'm so clueless but wanna start using some make up but dont know where or how to start o:", "tamsyncurin": "Where do you want to visit in the world?🌍", "jx2ro": "Hi Loey, congratulations on your success and on managing to stay humble. I would like to know if you've ever considered doing a haul from Wal mart of both their straight size and plus size items that might work for your/\"our\" body types. They've come a long way and I think it would be nice because no real credible plus sized budget blogger out there like you has ever done it and you have a lot of followers like me who are on lower budgets. continued luck to you!", "kigalrajasbludworker": "Hi Loey! First off, how are you? Hows your family? I hope they are well! My question is how do you deal with negativity in places you cant control? I'm rather confident i think but it all turns to (excuse my language) shit, i get picked on for eating cuz im bigger but then picked on cuz i dont eat at school, the kids are cruel and say rude things are send rude things and there is even a few kids who will throw food at me... Its just really hard to deal with cuz im at that school for 2more years and cant move. How do i not let it get to me?", "s.i.3.r.r.a": "How has YouTube impacted your life? ❤️❤️", "miss.cindy.lee": "1. You're SO beautiful (you have perfect eyebrows 😍) 2. Do you get spray tans or go to a tanning booth? I'm so jealous of your gorgeous tan", "sarah.condor": "Would you ever come to Australia for a meet up? 😈😈😈", "canadiemr": "Where would you most like to travel? And what are your short-term goals? #askloey", "lydia_gomes": "What's your go to outfit for a date night ?", "lanie524": "I'm a new-ish viewer. What inspired your decision to start eating vegan? Love you! Kisses from one May baby Lane to another! 😘", "womanandmomma": "How do you handle a situation where you and a friend both have feelings for each other, but they are afraid to pursue a relationship because they don't want to jeopardize the friendship?", "ashleighnemeth": "What motivates you to make videos? And had there ever been a moment when you didn't want to make videos? Ily Loey💕", "lenkamatouskova": "Do you like yourself? If so, how do you do?", "breanna.j.s": "What are your favorite clothing stores of you're on a budget? I love you so much!", "meghandewinne": "how do you continuously accept yourself for who you are ?? You have helped to teach me to love and appreciate my body but often times I loose that confidence in moments where I'm around people I wish I looked like 🙁", "serenadollcosplay": "Would you ever go to an anime con?", "abracadaverx": "What keeps you motivated when the haters are a little extra hatey?", "aubreytennessee": "What advice do you have for someone wanting to start a successful youtube account and career?", "heidivasquez15": "hi loey just want to say I love you and i LOVE your paranormal stories so much that I literally have watched that whole Playlist 5 times lol. my question is, how do you keep your hair looking healthy? I know you like to color your hair all these fun colors, and my hair has been damaged and I want to bring it back to life! I need to know your secret! sending love from Washington state!", "210_bby_g": "Will you come to San Antonio soon? 😭😭💖💖", "abrilvalladares": "@meghandewinne I agree exactly in your question and I really want to know how Loey love you", "allicoleman": "Favorite motivational quote? Love you 💕", "alyssnv": "What's the first step when learning to love yourself? ps love you Loey!!", "bella.lueck": "how to be less awkward?", "olivialoew": "What facewash do you use?", "almostfamousmo": "You may not have gone through this but dealing with getting ghosted would help...? Or dealing with massive heartbreak- any advice. Thanks!", "enchanting_olivia_": "Can you do makeup collection video?", "bluslady": "Hi Loey! I am wondering how tall you are? You look quite tall in your pictures.", "trysyarif.tu": "Big is beautiful", "tanpoderosa": "Youre so beautiful!", "i.am2yy4u_23": "Hey love! First off let me say ur awesome! Long story short I just had my second baby and my body completely changes I have a mommy pouch I can't get rid of and I'm 8 months pp. what's the best way to conceal it?", "kayginty": "if you could wake up tomorrow in the body of someone else, who would you pick, and what would you do?", "coconut_caitlin": "If you could take one album to a desert island with you which one would you take?", "abbiekbrooks": "What is your favorite bikini that you own?", "meemeex05": "What are your top 3 favorite plus size clothing stores?", "0niikkii": "If you could only have 3 makeup products for the rest of your life what would they be?", "nikenfebrinaa": "@iwangsa kumaubeginiwkwk", "sanitarylilypads": "What are your favorite bands?", "00amirah00": "Do u watch the walking dead?? If so who do u think Negan killed??", "sellvenrebecka": "What do you think about Michael Jackson?Do you like him or not? Love You❤", "a.r.wilde": "You look stunning😍😍", "kat_peters": "Can you take a trip to rio vista ca and be with me for a day!?!?!?!? @loeybug", "evelynweevie": "I just wanna say hi and I love you 😍💕", "theajulian7": "What is your favorite clothing piece that you own?", "xo.jennagrace": "Where can I get plus size clothing on a budget? I love you so much Loey! 💖💋", "victoriarboland": "Are you a feminist?", "bellanoell": "Do you love how you look in any picture or is it hard sometimes to like the way you look ??:)", "belrieb6773": "WHERE did you get that romper?! I am in actual love with it, so please tell? xo", "atownsend17": "What's your favorite high school memory? You actually graduated with my bother.", "chloesrazink": "If you could give any message about confidience and self esteem to young girls, what would it be? Oh and fav makeup products for the month :) xo", "hanadeschepper": "How did you get so confident with yourself? I'm sure you get asked this so much, but I'm struggling to be confident with who I am and about my size.", "awsomenessbooks": "What's ur favorite hair color u have ever colored ur hair", "griselda_96": "What is your favorite plus size brand??? Love you btw😘", "misses.ara": "How do you get your hair so long?? 😍 mine used to grow so fast, but the longer it gets the slower it seems to grow. I'm already taking biotin, which seems to be helping it get softer and feels awesome but doesn't seem to be doing anything for grow time :/", "gabriellabianco": "Why are you so beautiful", "ilyssa.tob": "How are you? I hope you're doing great 😊 ❤️ you've helped me so much. What is it that made you decide to start filming YouTube videos?", "ceydaerem": "Do you believe in dressing for your figure or rocking whatever you want? Love you girl 💕", "kellymblaine": "if/when you have children, do you want boys or girls or a mix? 😊", "magicwildflowers": "Where would you recommend shopping for cute and affordable clothes? (I love your channel btw!💕)", "drewcernava": "You look fierce 🦁 What movie are you most looking forward to that's coming out?", "itsmaryxoxo": "Are you a religious person and what are your thoughts on what happens after death? Love from Greece😘💙", "keshiee": "Who is your biggest inspiration and why?", "katersmarie": "I'm in love with my best friend, who I am going to be living with as well...but he is seeing someone...and it kills me. It's such a tough situation because he's my best friend and I don't want to lose him as a friend. What would you do in that situation?", "chelsealroberts": "How old were you when you had your first paranormal \"encounter\"? I can still remember the first time it happened to me clear as day!", "madalinnicolle": "What has been your hardest challenge to overcome with body positivity? @loeybug P.S. I Freakin' Love You❤", "samilee86": "Plans to come to Australia ever?", "averyvonniessen": "@loeybug If you could travel to any place on Earth, all expenses covered, where would you go and why?", "kayleigh_kornegayy": "What's your skin care routine @loeybug", "txylor_pxige": "What's it like being \"famous\" and having all that pressure . and can you do more paranormal videos??", "monica.mekhlouf": "Do you have any tips for working with blonde brows?", "freetheproud": "How does your family feel about you being a famous Youtuber? Ily and hope you had a great day💕", "lindsayynicoleee": "What's your favorite way to destress?! Love you lots Loey!! 💕💕", "peaches2177": "Can you please do more make up tutorials!", "northwest_cat": "If you could move anywhere in the world where would it be? Ilysm, you're the best dad ever !", "runk_madsss": "what provides you with your confidence and your ability to appreciate and love your body?", "kaylaandc": "Would you like any children in the near future? I saw your pregnancy video, hugs 💕", "sarbear397": "Hey @loeybug I have been watching your videos for a year or so and I love you so much! People always ask what the best is but i was wondering what has been the hardest part about becoming such a YouTube celebrity?!?", "emilykhunter": "Serious question...I would love to wear cute dresses and rompers but alas my thighs rub together, how do you combat thigh chafing? I dunno, maybe you don't have this issue 😕", "freymay__": "Was it hard starting out on YouTube, as in, affording a camera etc ❤️ I love you so much because since I've been watching you for the past year I am so much happier and confident so thanks loey💗💗💗💗", "_huangjessie": "What's your favorite animal and if you can be any supernatural creature, what would it be? 💕 ily", "libbyleonhardt": "if you were to die tomorrow, what would you do with your last 24 hours?", "_medusa_venom__": "How do you stay so confident?", "kaitlynrcallahan": "how do you feel confident if all your friends are skinny, and you're not", "j4yleigh": "Have you got into any physical fights? U had nothing else, i didn't know what to ask 😂💗", "emilykat77": "I don't think I have a question for you, but I just wanted to say how much I enjoy your videos! You are truly so sweet and such a positive influence! Thank you for being so uplifting!", "mackenzie.campbell": "What time period would you go back to if you could??💗💗", "hannahshaymashburn": "FROM ONE GEORGIA GIRL TO ANOTHER WHAT IS IT THAT YOU MISS MOST ABOUT GEORGIA??? ❤🍑", "thinktink2392": "What is the best way to figure out what size actally fits you best?", "diabeticrosie": "Where are your shoes from in this picture? And where's your favorite place to buy clothes. (Im plus size and always loved a good recommendation for places to get cute clothes!)", "vanne.toscano": "I adore u so much❤. What song makes you wanna slay @loeybug", "sparklielove": "How do you color your hair at home? I love the blonde you've been rocking lately. Love you sweets.", "krystacompton": "I just got engaged! What's it like living with your significant other for the first time? I'll be living with my fiancé soon! P.s. You're amazing ilu! 💕", "laurenxval": "omg yaaaasss loey I got off private 😄", "cvlvsyou": "STALK MY PAGE DAD ♥️♥️♥️", "carolineaaalexis": "What do you love about you? 💞💞", "oksanna.v": "What's your all time favourite clothing store to shop at ♡ love you", "alexis.hough": "How can i become more confident?", "rassidycandall": "How are you so perfect and confident I want your life what is your secret", "ruthpuentegarza": "what do you look in a friend?", "xhannahloweryx": "What's your favorite makeup products"}