{"zoella.over.nutella": "😍", "redhead_queenb18": "Hi! I know you may not read this but if you do I love you so much! I've struggled with an eating disorder and mild depression since I was about 13 and having social anxiety made it worse as I grew up. I'm 17 now but I've been following you since last summer and this is the first summer I am going to be wearing a bikini and I just want to thank you for that! You've honestly influenced me so much and I love you for that. I live in mesquite texas and I am so happy you live in Texas now! I wanted to go to the Beauty con in Dallas to meet you but unfortunately I couldn't because I was sick at the time. I'm sorry for rambling but I just wanted to say hi and ily so much boo! 😁😚💁💅💕💞", "fran.ces_1120": "What is your favorite part about doing YouTube!! By the way I love you and have watched tons of your videos!!❤️❤️❤️❤️❤️❤️", "swiftisgoals43": "Hi @loeybug I know my acc ain't about u but your also my idol and role model your so pretty I love your YouTube channel ❤️❤️❤️", "emily1rene": "Ur so pretty 😍😍😍", "__heavenlydezzz": "*how", "brittany_anderson_11": "What are your top picks for baby names for any future kids?", "honigkeit": "Doooo beautiful ❤❤", "yannii_rc": "My life 😍😍💖 I love you 💘", "melanie.snyder": "What foundation do you wear?", "hannacates": "@serenavigil_ she's perfect I swear", "jordanna.udai": "damn mami😻", "robertojgarciaj": "😍", "mscoute": "Ohhh my god😍", "mlc_x_90": "Loving your hair in this pic ❤❤❤❤", "jessieje07": "Omg 😍😍😍", "gracelilyflowerlove": "Omg💋soooo beautiful", "home165": "ThiZ hair mmmmm", "lashtonaf96": "😭😭😍😍😍😍😍😍💍💍", "nayelie.s": "😍😍🔥", "evelynmala": "Grow your hair @alishajade20", "lishajade": "I am! Trying too anyway lol @evelynmala who let me cut it anyway 🙄", "kayleekakunes_": "This picture is so pretty!! And I hear all big girls say that they wish they were skinny they wish they were small! Well I don't wish that I wish I were you I love your curves and your beautiful face! And my favorite part about you is you personality your such a bubble person who I love!!❤️💜 -Kaye K 😍", "elena.fdv": "Die wenkbrauwen zijn echt te overdreve @willemijn.jmb", "chanelwaits": "when was the last time you were genuinely devastated? and HOW did you overcome it and move on? I'm dealing with devastation and I'm wondering if there are other things I can do along side of everything I've been working towards already.", "nila710": "I really love ur hair. How do you keep it so beautiful and healthy??", "isabelsoup": "What is the most embarrassing thing you've done cause someone dared you to?", "ellieridgecain": "Hello my love! I suffer from mild eczema and have a huge fear of using foundation because it might aggravate my skin or clump at dry bits. Do you have any suggestions?", "frankie_cara27": "Makeup goals for real!!", "mari.cora16": "What is something you wish you had done in high school that never got the chance to? Love ya xo", "candiwakeley": "Have you ever thought about getting a tattoo @loeybug ?! If so, what would it be? I have 16! love you so much! 😘", "meagan_dz": "@bsd92 you follow her on yt or anything? She's 🐝utiful", "kbatista17": "Where did you get that necklace? And do you even know how pretty you are?😍😩😍😩😍", "kel.charlie.food": "eyebrows babe👌💕", "oliviagrace_roberts": "If you could spend a day with your idol/ a celebrity, who would it be, why, and what would you do? Btw just binge watched all of your storytime videos, so awesome 😏", "bsd92": "@meagan_dz yep I've been following her for awhile! ☺️ love her, she's so sweet", "shiv_dxx": "How do I get my mum to let me wear a bikini? She thinks only skinny girls can 😔 also are you coming to London anytime soon? I wanna meet you so badly!! Love you so much Loey 💖💖", "katrhymeswithcat": "I love you, and your videos are so meaningful to me. They give me a sense of kinship as you share your own body struggles and the journey to loving yourself. Thank you so so much. You really have helped me overcome a lot of self hatred and negativity. I stumbled upon one of your videos about 3 years ago, while I was searching for dieting tips (cringe). You were talking about wearing bikinis and loving yourself and I was completely awestruck. And it wasn't, 'well if she's happy and she's bigger than me, then surely I can be happy'; it was more the fact that you have struggled and overcome so much, and because of it, you're a happy and confident person. And I wanted that. And I did something about it. So now, about 3 years later, I'm 18 and so comfortable in my own skin. I wear what I want, I'm not ashamed of the size, and I just want to say thank you. Thank you so much.", "kaitlyn_douglas17": "Also, any advice on making workouts more enjoyable? Love you (fellow GA 🍑) Go Dawgs!!🐾😆", "natsa17": "Have you watched all of the Harry Potter movies and read the books? If so, which one is your favorite?", "ami_849": "If you were the last person living what would you do", "zdenidavid": "Hi Loey, I really like your story times :-). Sending greetings from Czech republic. Can you maybe make a video talking about lipsticks you like or perhaps eyeshadows or so? Like one themed video :). Thanks! Have a lovely day!", "wildteadrinker": "Where is your most favorite place to go in Disney world? :)", "audreyknapp": "Are you team Ironman or team captain america?", "shan.may._": "What is your scariest/favourite paranormal storytime? Xxxxx", "1hsjskms": "Has there been any other paranormal experiences recently? Xxx", "ava.randle": "How do you deal with hate. Do you have any advice for someone dealing with body hate xx love your videos btw x", "taralynn.27": "WOW your curls are awesome here Loey!", "haaannaaanutaaa": "I'm new to your channel so this question might be asked before🙈, but was your family ever fatshaming you? Mine is doing that everyday again even though I already am going to the gym.", "coldfanspider": "You are just so beautiful!!!😘", "krystal.lorenzoxo": "What's your favourite memory from your childhood! Love you loey and thanks for always being so positive and brightening up my day 😙💜👆", "carmen_coetsee": "If you could only where one make up product for the rest of your life what would it be? Btw love you and your videos xx", "3mily_piggott": "If there was a zombie acoplolyspse right now, and you had to use the nearest thing to your left,how screwed are you?", "helenakoffman": "If you had a book of your life would you read the last chapter?x", "toukotakku": "It would be so much fun if you share with us 5 your wardrobe must-haves/favourites & 5 your accessory must-haves/favourites ☺ Thanks! 🌹🌻🌼🌸🌺🌷", "doireannlynam": "How to you keep your relationship still fun and exciting after all these years? 😊 love you Loey ❤️", "lifetoldbykayleigh": "You're SO lovely and it amazes me how you're younger than me yet so much more confident and mature... I love your videos they're amazing 💕 What do you do to get yourself out of a bad, I don't look good kind of moment?", "ingridima": "Hi Loey 😊 You are so awesome and give such good advice. So i was wondering. What are your best tips to stop inner thigh chafing. It's such a problem for me, I'd rather sweat to death in jeans than wear dresses, skirts or short shorts in hot summer.", "hannahrecord": "Where do you think you would be right now if you didn't have YouTube? ❤️❤️❤️ love you gorgeous!", "itsmaggiecole": "Favorite pizza toppings?? Thanks Loey!😘🍕", "cristinadgarrido": "What is your favorite place you've ever traveled to? :)", "thecolourfulraven": "For one I'd like you to know that you are one of few YouTubers to help me gain a healthier mindset. You're beautiful! So as for my question, what do you do on those rough days when your confidence is just blahhh that day??", "tattooedwizard": "Favorite show to binge watch?? Love ya ta death girl💛💛💛", "kellynaps": "You look incredible!", "little_flammable": "Where do you buy jewlery?!", "madprops12": "Favorite Alice in Wonderland character?", "nitamarie21": "Favorite place to travel & why? 😊✈️ P.S. You're amazing! 💛", "zoibeans": "If your life were a book would you want to rewrite it? And what chapter are you on right now? ❤️💕❤️😘 I love you! Your videos have helped with my self love recently and I wanted to thank you!! ✨💕✨😊", "raphspuria": "Hi Loey! I was curious to if you got some of Kylie's new lipsticks? What do you think of the colors? :)", "rinaa.michelle": "If you could only wear one color for the rest of your life, what color would it be?", "olivia.ellson": "How do you learn to truly love yourself?..", "laura_babbyy": "Hello thick brows 😧👎🏻", "abby03777": "What is the top three things that you find most important in your life?", "bentleylove01": "Where is your favorite place to shop for fall clothes?", "kacdeleted": "do you want to travel? If yes where to? xxx love you 💜", "hollyann.louisa": "If you could spend 5 minutes with your past teenage self what would you tell her? Love you so much btw😚", "theironicparadox": "This question may come off as rude, I hope you know I love you and do not mean it that way. We have very different body shapes and sizes, but we buy the same size. When you try something on, how do I know what size to get?", "laura_marie.lec": "Have you ever visited Canada, and if so, where have you gone? Also, where would you plan on going? 😘💗🇨🇦Love you to death Loey!", "cassie.kel104": "What do you think about shaving the peach fuzz off of your face? I saw an article on Popsugar, but I would LOVE to have an opinion from someone I 'know' and trust! @loeybug", "porquoiiiiiii____": "Are there times where the haters get to you of so then what do you do when this happens? @loeybug", "joannaaavila": "If you had a pet lamb what would u name it", "tmwelch09": "Btw love you 😘", "oh_thats_sarah_": "How do you think YouTube has changed you?", "carlawiitta": "Who is your favorite pokemon? 😘😘😘", "jacquimoo91": "Where is you favourite place to go to just chill out and relax?", "allyshmallie": "If you could be any superhero who would you be?", "caetiscreations": "You are such an inspiration! Thanks for doing another q&a! What were some of your favorite things, growing up? Like fun memories, nostalgic items/games/movie, etc?", "allison_a_lehr": "I know you've talked about it before, but when was the moment you realized you needed to try and love yourself for who you are, and be happy with what you have? What are things you did to help you love yourself? I've struggled with self image ever since I can remember, you always lift my spirits. Ps: You're so gorgeous😭❤️ please be my mom☺️💕 I'm sorry for the lengthiness😛", "boardingar": "Any sexual health advice for young people??", "jj.speirs": "What do you do on your bad days? 😙", "ruby.cascarina": "What is your hair routine Xx", "lorenduhfresh": "What is your all time favorite pallet that is worth the money?! P. S. You're amazing and I love you <3", "livgram": "How do you stay so confident?", "jordyyyano": "@nad5iah Try Body Glide! That shit is amazing!", "allisourousrex": "Do you have any tips for frizzy hair?", "sophie.badih": "What's the greatest reward you get from your YouTube career?", "absolutely.shawn": "what's your favorite item of clothing to wear? ilyy 💓", "molliejoxo": "How do you get your brows so perfect?? They always look amazing", "xoxopeachesx": "*meant who* and then", "olivialoew": "What are your favorite color combinations?", "just_coriee": "Who would play you in a movie about yourself?", "diabeticrosie": "Where's your favorite place (state?) you've ever lived in. Ps. I LOVE YOU!", "mikhaila_borg": "First I want to say I love you, you have helped me with my body issues so much but I still have some problems with myself. My question is how do you stay so positive with yourself? I have been having some issues lately and I'm scared I'm going to start vomiting again", "htx.abiii": "i spelt that wrong lmao", "leahgable22": "What is your favorite movie? 😘", "kyliepatrice": "What is your biggest pet peeve and are you at and @learningtobefearless going to colab😍😍", "palaye_royale_bride": "How do you get your hair so curly? ILYSM! 😘", "queen.of.georgia": "Kids in near future? Do you think you'll ever do your own YouTuber makeup pallett? Love you!", "ceesully": "Do you have any stretch marks and if so, how do you deal with them?", "erin_irene29": "What are your favorite workouts to do?", "kennedyhayes9": "Do you plan on getting more pets? Love you and your channel and you are absolutely gorgeous! @loeybug", "mliljat99": "How do you motivate yourself to go do things?", "destinylopez.1904": "@loeybug have you ever thought about making a clothing line or store that only sells plus size clothing, that you personally designed, also what king of clothing would you sell, fancy, dressy, casual(etc), or would you try to sell a lot of different types/styles of clothes", "rpryor831": "@alexnikole38 😍😍 thisssss", "mrs.vanessacase": "I'm 20 and just got engaged, advice for the people that give me dirty looks when they see a ring on my finger at the age of 20?!", "its.princess.caroline": "Gorgeous 😍🔥", "idk12346152": "What is your fav makeup brand @loeybug", "maddy_mackayyy": "I have some social anxiety and it's hard for me to make new friends even if they talk to me first I never know how to respond", "amyrichcreek": "How can I get myself to be less socially awkward and put myself out there more? When will the social anxiety stop?", "notusingthisacc579": "Ever thought about visiting the Netherlands/holland? Ly ❤️", "jessica_lynn_2017": "Hey girl! I was wondering if you had make up tips/ make up brand recommendations for uneven skin tone? I tend to be on the red side and haven't found anything that I like to dim that down. Thanks girly you're wonderful! 💜", "ashlynkgriffin": "What is your all time favorite clothing store?", "glambysusy": "Hey girl! My question is: how do you maintain such a busy life & healthy marriage? I'm having such a hard time balancing the two lately. Thanks 💋💋💋", "ashleymariemkxo": "What's the most awkward date you've ever been on?", "courtlafferty": "If you could only wear 3 makeup items for the rest of your life, what would you choose? By the way, you're stunning ❤️ work it girl", "brittanymaybeauty": "Loey I love you. Will you ever do a meet n greet in Michigan? I would go to all the beauty con things but I don't have enough financially but would love to meet you.", "rach_lang": "Hey loey! How do you stay so confident??", "kailebbryant": "Hey Loey! How do you make yourself feel better when you hit a low? I'm struggling with how to pick myself up again after a fall back 😔 also I think you're so beautiful inside and out and I love you so much, all your videos put a huge smile on my face, thank you so much for being you 💓💓💓", "_amywarburton_": "@official_teabag get whisper the app people always help on there and it's anonymous", "hannerodset": "What do you know/think about Norway? I live here, and I feel like the country is really underestimated🙈 Love you💕", "rubyhunt64": "Would you ever or have you ever cosplayed? And who would be your dream character to cosplay as!!!", "rubiinisalama": "How are You? 😊💖 And what are Your favorite things to do to relax? You're awesome 💖", "roxanasifuentes": "If you didn't do YouTube what else would you like to be doing with your life?? Btw I LOVE YOU, all your body positivity videos really help. Thank you 💝😊", "chilly_banana": "What is something you would like to do over the summer and ur gorgeous ❤❤", "julieclausenn": "I need a lot of help with self confidence. I think I'm beautiful I just have really bad days. What do you do on those bad days to up your confidence? Love you 💕", "alleahmm": "What is your favorite movie?", "sisoais": "Loey! So much love for you in the UK girl! And will you ever come to the UK for a meet and greet or just to return for a holiday? Love you! 🌸💙", "invisible_girl93015": "Also... How can I feel confident with myself as a 17 year old in high school and I haven't kissed a single person yet? You've helped me so much with self love of my body... But this still engraved in my mind and makes the process even harder. Ily", "mckaylalynnea": "Loey omg😍😭", "padawankimi": "If you could go back and give your younger self one piece of advice what would it be? P.s. You've been a huge inspiration for my own journey in self-love, keep being wonderful 💕", "itsnicolek_xo": "Hi Loey 😊. Why have I only found your YouTube channel a week ago. I'm OBSESSED. Let's Be Friends, you're TOO amazing. Love you 😘", "gravvvyy": "What's your favorite part of being a youtuber? Ps love you so much❤️❤️", "margsux": "hey loey! I want to start of by saying thank you. I owe so much of this confidence I've gained over the past few months to you. you've made me see the beauty in everyone including myself. I love you loey and thank you so much. now for my question. how do you find truly genuine people in your life? so many of my friends lately haven't been the greatest to me and I'm looking for a fresh start. thanks lo", "lauryn_stevenson": "Hi 😊 did u ever hit rock bottom, where you just didn't think anything was going to go right and if so how did u get over it? Love ur videos, they have made me so much more confident in my own body and accept myself more, thanks ❤️❤️", "emmylads": "Best sweat proof drugstore foundation for the summer time?", "bloginfiniterosie": "What do you like the most about yourself? ❤❤", "skypesnuggles": "Do you have any advice for someone who has lost hope for anything going right anymore? (Sorry for the depressing question I just don't know what to do anymore) I love you and you are a huge happy place in my life. 💞", "ken.drama": "I would like to thicken up my hair like yours! Any recommendations?? 💗💗💗💗💗💗💕💕💕 love you!!!", "__bai.ley__": "what's your favourite pizza 😄🍕", "shannombre": "Hi Loey ^_^ I have a friend with really low self esteem but she's really judgmental of others, I've tried telling her that thinking positively about others will help her think positively about herself but it's not getting through, any advice? Hope you are having a wonderful day <3 p.s. You look stunning x", "sarah_power16": "So proud of everything you've accomplished, Loey! 💞💞 What are your recommendations for waterproof makeup? I'm going on a cruise in a couple of weeks and am looking for a simple everyday waterproof routine. Love you. 😊", "angel.m.20": "Are you ever going to come to the Uk? Looveee Youu💛", "maryjaneyvonneee": "I followed you recently and became addicted to your outfits, makeup but most of all your confidence, it's so beautiful and inspiring. I have always struggled with not being happy in my skin and always trying to improve, so I would love to know what became the light inside of you that one day you became ok with your body and image, looking for the light inside of me still :/ laaaah youuuu girl 🌺", "hannahbr24": "I love your paranormal videos and story times. When are you going to make another one do you have any planned?", "mariacapellani": "So much slayage in one photo, love you girl. And yo hair is POPPIN, OHHH SLAY", "c.1.o.u.d.y": "Hello 😀 do you have any advice on not comparing yourself to others? I always worry about what I look like compared to other women 😧 love you Loey! Xxxx", "ultra.jaz": "Would you ever visit New Zealand?", "trinabrynn": "who are your favorite singers/what's your music taste?", "nataliee_hagen": "If you could travel one place you have never been to before, where would you go? Ps. Love you 😘", "unknown_label10": "Omg I'm always late to post questions😭,,,, Loey will you ever dos meet up in New Jersey ???? I love you - Karita !", "jillianfischer": "I don't have any questions, but I did want to say that I love watching your videos, it has been so awesome to watch your channel grow over the last couple years. You are such an inspiration girly. Love you! 💕", "precarious_mind": "Would you have a meet and greet in the New York/New Jersey area?", "myrtlestarnes": "I'm a mom and I still have body image issues. My daughter tells me I'm beautiful but I don't see it. How do you stay so positive?", "maybe_beth": "Is it ever hard to stay body positive when faced with negative family? And if you do deal with this, how?", "livingthat_mommylife": "@livinliketerrie Rub deodorant on your inner thighs when wearing dresses and skirts and even short shorts. It really helps prevent the irritation.", "decoteaudesigns": "Hey gurrrrl. I hope u see this :)", "kayyytea": "What are makeup tips that completely changed the game for you?", "stephaniecarollo": "How do you come up with video ideas ps I love you 💕💕💕💕😘😘😘😘", "basicallylinds": "I don't think I'm beautiful, so how can I think that I truly am? I've hated the way I look since I was 7 years old, and I am 14 now. I hate feeling this way 😭😭", "madelaine__73": "What is your favorite television show", "_theycallmered_11": "What's your thoughts on all of the negative things people say about military spouses? I'd love to hear from you! 😘", "eve_333": "Who is your biggest confidence inspiration who you look to and wish you had the confidence of? Love you!😘💕", "ozgehatip0glu": "@loeybug Kiss/Marry/Kill --> Matthew Santoro/Tana Mongeau/Stepanka 🙃🙃", "brittany_thibado": "@loeybug we just got a new puppy and since you have two dogs I was curious if you could give me some tips/advice on training, we're especially having trouble getting her not to bite which is very scary because I have a five year old. Anything helps, thank you in advance 😁", "buckaroobongo": "Any tattoos?", "tess_kathleen_": "What are your comfort foods? Love you 😍❤️😍", "1234ariatan": "How can I be more cobfidence and love my body more? ;-;", "meganroseok": "Favourite city you've been to?", "karlielself": "What's a way to love myself more ?", "mikaywaaa_": "How do you stay so positive in a society that puts such embarrassment on being overweight? I've always considered myself a \"pretty in the face\" girl, but have always been overweight and have always felt ridiculed by my body type. What are some things you do to make yourself feel beautiful? I'm a newer fan and have fallen in love with your videos! You're a real inspiration to me to live a happier life 💕", "jainyaustinxx": "If you were a superhero, what would be your name and power? PS your channel has helped me through so love you!!", "ssilviannas": "What is your favorite hobby?", "nad5iah": "Hi! My name is Nadia and I love being feminine and wear skirts and dresses but if I don't wear tights I got irritation in my thighs can you give me a tip please? Thank you so much and I loove all your videos xoxoxo😘😘", "liz_beth1015": "Okay so I have a \"friend\" who I love and she loves me too but her life has been REALLY rough and before I met her I was focusing on me, just me, I gave up on finding love so I was just worrying about myself. my life was going good, I was focused on school, my grades were A's and B's but she would always have these negative things. And whatever she felt, I felt. If she was sad then I was sad. And her attitude affected me and my life was just going a little downhill. She's an amazing girl but she just has this negative mind. And that just affects me physically and mentally. I honestly don't know what to do cause nobody has never been by her side. I've only known her since February and it's been almost 4 months and I've helped her soo much but I can't handle so much negativity. What should I do!? 😭😔 I love you!!! 💖", "megan_mitchell__": "What is your favorite book, poem, play, or any other piece of literature? love you!💛💛💛💛", "emilyy.dawn": "How do you stay motivated to be healthy and workout everyday? Ps: I LOVE YOU ❤️❤️", "sarinoriega": "Eres bella bella", "courtsuero": "How do you get your hair so amazing?", "deidra_latrice": "You never answer my questions when I ask 😩😢!!! But it's understood when you're soooooo POPPIN!!! Have a great day Loey!! 😊", "ohbellabee": "I have always loved myself, and felt confident in myself. Regardless, since I was like 16 untill a few weeks ago and I found your channel, I found that I would look in the mirror and highlight anything that wasn't perfectly tight and smooth. Just two days ago I was trying on my bathing suits in front of mirror and taking pictures. For the first time since I have developed my woman body, I loved how My body looked. I also have wavy / curly hair and have always stressed on perfection. Every part of me I have always viewed as a model to build on to create \"perfection\", but suddenly, since I have watched your videos, those things I ounce built on are highlighted as to what makes me, the beautiful me that I am proud of. Anyways, I wanted to know if you had any defining moment where you recognized society has taught you what is beautiful but you rose above the expectation and realized that expectation needed to change?", "geneticallyugly": "@loeybug How did you survive school? Any helpful hints in not getting overrun by assignments and projects? P.S. Love you so much, you're such an inspiration <3", "mermarci": "What are your thoughts on the Milani lipsticks and blushes? I want to know since it's a rarely spoken of brand. I love you <3 I admire you so so much, you're amazing. Watching you from Mexico <3", "xameliaehlertx": "Favourite makeup product ?💗✨", "jess_hart_iverso": "How do you get your eyebrow so thick and dark?", "fancyavi": "Hi love u tons!!! How do you keep the trust in your relationship being so far apart for long periods at a time?", "teenslogics": "how do you stay so confident in yourself? you're such an inspiration 💖😌", "_paige_hill_": "What do you miss most about Kansas? (I'm from good ol Kansas) ☺️☺️", "redhairdontcare_91": "Have you read any good books lately? P.S. You're gorgeous. I wish it was as easy to style my hair!", "stephcaittodd": "Hey girl, I'm really stressed about going to law school as a big girl. Girls who are bigger always seem to have trouble in the professional world. I don't get taken as seriously as the smaller girls. Any advice?", "katiefrank03": "If you could add one modification to YouTube what would they be and why?", "kristindonnelly55": "If you had one piece of advice for girls (or guys) out there who are struggling with hating themselves because of their looks and other reasons, what would it be? I love you and what you do for us bigger girls😉😘", "mckenzie.cheyeann": "Have you ever been/considered being vegan or vegetarian?", "cassidy._.jean": "What is your biggest challenge when it comes to YouTube?", "twilightlovestacos": "What's your favourite animated to show? ❤️", "lizaaa_h": "What was your trigger to change your outlook on life and your respect and opinion of your body? It's so inspiring and empowering to watch in your videos 💕", "kirstenn.burnss": "If you were to travel in time would you go to the past or future ? 🙋🏼😂😝", "_gray_roses_": "Any advice to cope with hate from your own family? Even if it is a joke it still gets to me. I love you and all of your confidence, please never stop making videos and giving out your wisdom <3", "nikkilynnpurdy": "When did you first begin to love the body you grew up in?", "tafia_a": "What's your favorite piece of clothing?", "hanafrank21": "What's your favorite store? (Either in person or online)", "jjaiiden": "What was your worst experience in school?", "audge_hunter": "Do you plan meals? Do you have any tips on a grocery budget?", "ashmayesfordays": "Would you rather hiccup for the rest of your life it feel line you need to sneeze for the rest of your life. My favorite #firstdate question", "samanthaapolanco": "How can I become more self loving ? I love you , god bless you ♡", "julka_kossowska": "If you were a beauty product what would you be?", "faith.born": "What is you hair care routine?", "mallory_jayne": "Will you ever come to Australia!?! You're amazing! 😘", "mrs_heather_pratt": "Do you have any favorite things you've discovered about living in Central Texas and are there any things you still miss from Kansas? (Besides awesome friends I'm sure!) Love you!!", "polaroidpinto": "Do you have any tips on how you style your own clothing? You have a great sense of style and I just love them so much! ❤️🌺", "madddydukee": "You are PERFECT! SLAY", "candaceexo": "Where is your favourite store to buy bathing suits?", "summer_speaks_beauty": "What's your favorite hair products to use when you curl your hair?", "literallylexie": "Do you want to have kids? If so, how many and what are plans for the names?", "jaaasminx": "How do you stay confident? ❤️", "gail_the_flower_child_22": "Love you girl! Do you see children in your near future? If so any baby names?", "imangelicaa_": "Book recommendations? Any good chick flicks on netflix?", "_tbh_no_one_": "What's the best way to deal with stress in high school, especially now with finals coming up?", "hey__itz_me_annika": "@loeybug do you have a tattoo what is it and if not what would u what it to be!also ilysm", "pens.on.paper": "@loeybug what's your favorite thing about living in Texas? And how is Texas different from your old home? (I live in Tx and love it ❤️)", "lizzlu92": "@loeybug what is your favorite drugstore makeup to use. (Fondation, primer, eyeshadow etc)", "sarahzakula": "What advice do you have for someone who wants to start doing YouTube? Things you would've done differently when you started or tips to be less shy talking to the camera & able to show your personality more? You're such an inspiration for me! Love you! 💘", "loranharrison": "how would you recommend YouTube as a lifestyle? like is your experience what you expected when you posted your first video? (ps. thankyou for constantly empowering me, I love you!)💖", "britt.bo": "Who are your favorite celebrities? And who do you look up to?", "kylie_kenneavy_": "Who is your inspiration and why?", "thatsnotlily": "@loeybug what are your favorite inexpensive clothing stores to shop at?", "livinliketerrie": "I get irritation in my thighs when wearing skirts sometimes... how do I handle That?", "indiaallenn": "@loeybug", "laliss__": "How do you say confident!?", "autumn.smith14": "How did you become so Confident in yourself?", "leighannsays\nVerified": "Verified", "mxr.ce": "Ps I love you and thank you for speak up about ed's because it makes me feel less alone.", "nickiashley": "Are there any country you havent visited and really would love to? Love from berlin, germany xxx", "ronnie_isherwood": "How do you stop from comparing yourself to others when your having bad self confidence days. you have so much confidence and seem to love yourself. Btw your so gorgeous and your such a roll modle to me 💙💙💙💙", "yaraolk": "Do you think being in this 'adult' world and by that I mean having your own house and 3 kids (animals) and paying bills is worth quitting your parents ? I am 19 and I wonder all the time if having my own place will help me building my own self and personality. Love your videos and I hope you'll do meet ups in Canada!", "giaplta": "Would you Ever visit Europe? Why and which Country🙈 Greetings from Germany ❤️", "hotshotwilly": "Have you ever been to Louisiana? If so what was your favorite thing? If not, would you like to?", "hannahsue97": "How did you get into makeup and beauty? Ps I love you and you are sooooo gorgeous in everyway!", "niniii2401": "What was your motivation to start a youtube channel and how do you deal with negative people?", "freakfarriswheel": "Could you give some advice to someone recovering from an eating disorder? I know that for me when I was recovering from anorexia, it turned into binge eating and whatnot. Just some advice on staying strong ❤️ You are so inspiring and I love you!🌚", "haggard.mork": "How did you end up starting youtube? it's given you the opportunity to express yourself in a fun way however, I'm curious what brought your awesomeness to us, and what would you be doing if you weren't on you tube?", "madelyn__p": "how has making videos on YouTube benefited your life?! love you💖", "boopiekins509": "Babies???", "maricahaase": "I love you, do you love me? @loeybug 💗💗💗", "_cx.ra_": "How do you stay positive when theres so much negativity? Xx", "sofigc95": "How do you stay confident? Lovee u💖", "shann_leighhh": "Do you ever think about cutting your hair short?", "skye_tattoo": "If you could choose one thing to tell someone who is suffering from body confidence issue's what would it be? P's love you so much 😍 xx", "hannalinneac": "Whats your favorite season of the year? Xx 💓", "baileyahrens": "@emmabarfoot_", "nicki_sunday": "How do you stay motivated?", "gabbiinicole": "Will you ever come visit the Caribbean? Barbados specifically😘😍 I love you!", "emway": "You look lovely!!!!", "m_a_r_i_e_l_a_12": "Why do u always change ur hair color", "lexy_clarkson": "What things do you make a part of your everyday routine in order to maintain your self confidence? Love you and your videos 💕", "dailybeauty_dose_": "Do you have any obsessions? P.s. I love you 😍😂", "midajah_": "I have a formal dance coming up and I want to ask you if no one asked me should I still go,ps I love you 💕", "__kiki.t.j": "😍😍😍😍", "mira.graft": "What is the best experience you've had in life so far and what is something you can't wait to do? Love you lots xxx 😘", "wanderluster16": "Stripes or Polka dots?", "chxrlotte.e": "If you could only use 1 makeup product for the rest of your life, what would it be?", "gankill": "if you could get one color of colored contacts what would you get?", "kes_catanna": "If you could produce any type of movie what would it be! Love you!!!❤️❤️❤️❤️", "ashleyhetzel": "Did you do any schooling for makeup? Love you!!! 😙😙😙", "princesskay_xo": "How do you manage your money? What a tips you could give?? 😘", "carterdd98": "What's your favorite childhood memory ? :D", "bubblynn81": "Any plans on adopting more fur kids?", "ayaaaat675": "Are you vegan?", "eleanormair": "If you could go anywhere in the world where would it be and why? Love you!! X", "geekychicofficial": "What is your favorite shade or formula of lipstick?", "lilly.short": "What type of group were you with in high school? Like athlete, drama kid, etc.", "isabellberke": "Do you have some advice for plus size teens? xx💕", "imvivy": "What do you admire the most about yourself @loeybug ? Love you!!!", "tasiamaepopovic": "Reduce your eyebrows. I can't. I just can't.", "mvrissxn": "If you were to dye you hair what color would it be", "ah.stevenson": "Also two more: If you could have dinner with anyone, alive or dead, who would it be and why? And how do you deal with bmi? Like if a doctor says you're overweight numbers wise but you work out 5 days a week and you're happy with yourself? @loeybug", "moatillgren": "would you say that you are a femenist? Ps: Love you❤️", "rosie10_98": "If you could have any job in the whole world what it be? Love you 💗", "_leaagrb._": "Would you ever consider going on a trip to smaller Europe countries like Croatia, Serbia, Montenegro? 🏖☉⛵", "niamh_duffy_": "Will u ever go on tour in Europe hint hint Ireland 🍀🇮🇪🇮🇪", "andrealissette": "Favorite tv show? :) I need something new to watch", "jacqlorray": "Do you like to do other people's makeup?", "monique_grk": "Beautiful curls!", "bricoffeequeen": "Will being a fluffy girl ever get easier?", "amyw1": "Do you think you will visit Britain again? (If you do make a visit to lincoln)!Do you have advise on starting a fashion blog?", "raisingthebanes": "@thekadeous2000 a video using your new palette👍🏻", "rebeccabarnett1": "favourite colour? sorry for a boring question ha, love you!!💗💗", "anna.boyce": "Tips on boosting confidence? How did you get your confidence so high?", "missjessieeeeee": "I've started watching your videos recently @loeybug and I love you! I'm going on my first holiday away this summer with my friends and I'm a bigger lass (size 18) and the rest of my friends are slim. I'm just so nervous and I know I shouldn't worry but I can't help it. Is there any advice you could give me? I'm so scared to wear a swimsuit in front of them... thankyou xxx", "nitabedolla": "How tall are you and do you do any type of workouts prior to wearing a bikini. You've given me the confidence to buy one, but I don't feel i look as good as you in one. Lol 😊", "jessicaandrson": "If u got a dog right now what would you name him", "e.daws0n_x": "What's your favourite lush product?", "maudschouten": "what is your favorite brand of makeup rn?", "rebeccajeannn": "how do you get such HD selfies? And what filter(s) do you use?", "movingyouu": "What is your zodiac sign? & do you believe in astrology?", "bmurdaaaa": "Body Shape question.. I have muffin tops that stick out as far as my hips almost. Every time I try on clothes that form to your body, I look square and unappealing. What would you suggest to get a faux hourglass shape for summer attire.. Including swimsuits so spanx and a tummy shaper wouldn't work..", "jazminxjade": "If you could wake up in the body of someone else, just for a day, who would it be, and what would you do?", "its.georgieee": "Where is your favourite place to be? 💗", "megan_ione": "Do you ever get recognized by fellow military spouses? 😊", "griselda_96": "What advice would you give someone trying to become a plus size model? Btw love you ❤️", "chelsxoxoo_": "best way for you to relieve anxiety?", "_.kasumimrl._": "Oh my goood!! You are very very sexy 😲😍", "_laura_0911_": "What's the best way to lift your spirits on those days when you look in the mirror and absolutely hate what you see? They have been \"attacking\" me far too often recently for my own liking and I'd love to know an effective counterattack! P.S - thank you for being born, you wonderful, inspirational lady~ ♡♡", "natalie.weeks": "Your favorite spot to get your favorite summer clothes 💘ps.i love you babes", "jayden21110": "Where do you buy cute plus size clothing that inexpensive besides forever21 ?", "kidnapproof": "Your bullying experience? How was it? It's obviously been a while (not including social media) since you've been bullied. I'm curious. Have you talked to them? Do you think you have forgiven them even though they may/may not have asked for it?", "drewcernava": "You are a cutiepie 🐱💗", "nikhitajaya": "Coming to the UK anytime soon?", "karlaguerrerooo": "Music is so important in my life and many other peoples lives. What is a song or songs that have gotten you through some tough times? Btw ilysm💕", "milena.jen": "how often do you walk your dogs in a day?do you hava fav waterproof foundation for pale skin (and shipment international)? love your radiant confidence", "lienkeeele": "What was your favourite childhood candy? 🍭", "mathilda15": "Favourite film and TV show?❤️", "big.meadey.claws": "if you could only watch one movie for the rest of your life which movie would you watch?", "seli0330": "What makeup product can you it live without in the summer? PS I love you so very much and I think you are so lovely thanks for all that you do!!!", "adelaidekoolaid": "Who is invited to your ideal dinner party?", "madel.ine": "whats something you do to help you stay sane in really busy times?? love you so so so much 💖", "courtney._xoxo": "What's better pizza or French fries", "briannemac15": "What made you realize your self worth?", "jordan_macenna": "Can you pleeeaaase do any type of haul? I'm dying for one", "iggy.and.nugget": "What made you want to become vegetarian?", "shawnabutnot": "I love you so much, @loeybug! Would you ever want to vacation in Alaska?", "lenimarleen": "If you could remake your whole life, would you? Love from switzerland!❤", "onery_anaya": "Any tips on how to meet people. I am in online school so I don't get out much to meet anyone. Thanks ❤️", "briony_fox26": "What is your favourite book atm???", "xokelseypaige": "What's a quote you live by? 💕", "ok.brenna": "Any book, TV, music, or movie recommendations??", "yazz8910": "Where do you like to buy home decor? The little vases and knick-knacks in the background of your videos are so cute! I love you and your style so much!", "taylor.elainee": "What's your favorite type of flower? 🙈", "jamilynn_marie_": "Can you do a clothing haul from Maurice's? They have great clothes all sizes. Or maybe a work clothes look book? Luv you so much you are such an inspiration!", "lauren_k_h": "What was your favorite show when you were growing up?", "sophie_lhw": "Which Disney princess would you be and why? Love you!💘", "mynameschrissy": "what type of makeup is your favorite and what brands do you like??", "kyyconrad": "advice on starting youtube?", "yolandatheodorakis": "Hi! What's your middle name? :)", "starbucks_and_satan": "Favorite movie?", "oksanna.v": "On days where you're just feeling down about yourself, how do you stay so positive.. something I've been struggling with lately. Much love ♡♡", "dxvotie": "what are some tips on being confident in your own skin? ily", "blondie_gkiks": "Say hello to Greece?,❤❤", "cecilevoyage": "Will you ever do a meet up in France?", "rooosieeeee": "Will you come back to the UK soon and if so would you go other places than just London because I live up north and would love to meet you 😊😘 love you so much xxx", "edaly96": "What's your personnality type? ✌", "sugoikokoro": "do you prefer gel nails, regular polish, or acrylics if you had a choice to get them done :)", "sophiekillebrew": "If you could only shop at 1 store where would it be ?", "hollybullock_": "How do you become more confident in yourself, ps your so pretty and ilysm xxx", "its.elena.duh": "Did you have a favorite childhood toy or object? If you did what was it?", "ameliadeluca": "What's your favourite thing about being a youtuber? Love you loey!😘", "itsveritygrace": "What is your favorite childhood memory? 💕 love ya! :)", "giorgiabortoli": "Favourite tv shows? 😘", "haley.polzin": "What's ur fav cat on neko atsume? lol I'm cat trash🐱", "allimacxo": "How do you get over all the hate for being plus sized? It really takes a toll on me!", "leahacrowther": "If you could get on a plane and go anywhere right now where would you go and why? Xx ly", "mimi.saturnino": "Where do you plan on traveling next & will you vlog it??? 💗 love you so much!", "freyaphernelia": "Would you ever consider getting tattoos? If you would, what would you get? Views and thoughts on them in general? Love you so much girl! 💖✨🌙", "issio23": "How do you know he is the one?", "mandy.e.green": "You mentioned in a vlog about pregnancy- are you going to make a storyline about that?", "gina_smith00": "My exams start in a week! Do you have any advice to deal with stress! Love you💖", "kenleereigh": "ps. your beautiful", "buttermynutz": "Your so strong, how do you do it??", "tayalachelle": "what is your favorite store to shop at? I want cute clothes,but I can never find cute plus size clothes. thanks loey! ilysm 💞💖", "fabquab": "What's your favorite plus size brand?", "carolarmas94": "Wow hermosa", "naijxsia": "Can you give advice on crop top confidence?", "laurajayhughes": "Where would your dream vacation be?💗", "nicole.ann.dodson": "😍😍😍 your hair", "mama_corinne": "OMG!!! I love you so much!! My questions is: chub rub, what do you do about it?", "gabriel_jillian0219": "@loeybug use this to end your video! I LOVEEEEEE YOU!!!!", "natali.raquel": "Teach me how to be as confident as you, you're legit goals 🌸😍❤️", "georgia_lukic": "First kiss story and first boyfroend😹💙💙💙💙💙💙💙love you", "aiden_hatley": "What advice do you have for plus size teens who are struggling with confidence? (P.s. I love you so much and thank you for everything you do.) xoxo!!❤️❤️❤️ you're gorgeous💕", "leannejohnson8": "I really dont get how you can be so stunning! 😫 major hair goals girl 😍😍😍", "brooke_cozzi": "You're so pretty!!", "shakira_keegan_18": "What's your favourite thing about doing Youtube?💙💙", "ang3lisse": "whos ur fave band/singer?😘😘ps ilysm❤️❤️", "imn0tsara": "Do you ever want a Lil baby???", "mak0rina": "HAIR, HOW?", "kristiahnedwards": "Cute", "wanderlunde": "Did you know you have a lot of fans i Norway??💕😊☀️", "stefanienixole": "Hey bb first of all I love you. Secondly, who on the Office do you see yourself in most? I'm deffo Kelly.", "chelseamryan": "If you had to pick a go-to no makeup, makeup look - what are the products you would use / what's your bare minimum?", "kat_arundel": "Loey slayyyyyyyyyyy", "stephaniee.serranoo": "How are you confident? I want to be confident"}