{"_no____user___________": "If you can eliminate one of the world's biggest problems what would it be ?? @loeybug", "ruby_s._": "How did you get your name? It's so unusual? Were you named after someone, or did your parents just want something different? I love you! You're such an inspiration! *hugs* x", "_.angelinaaaaaaa._": "Why did you decide to make YouTube videos? Btw you are beautiful and such an inspiration💖", "queen.of.georgia": "Would you ever do a q&a adult rated? Love you babe! Stay beautiful and strong💝💞💗💋❤️💕", "imabookshelf": "If you could live in one store for the rest of your life which would it be?", "court_steve": "Odd question but, what type and size of social circle would you recommend healthy? Such as what varieties of people should you hang around and how many? I see you have a lot of people that you share good relationships with. I have a hard time of keeping good social activity before I become tired but I still want to keep good friends and have good memories", "laurenam97": "I don't have a question I just love you", "kathylegit": "How did you & Alex (learningtobefearless) become friends?? What is your most cherished memory with her? Love you!!", "_shaunnammarie": "@loeybug. Are you in the new #inmyjeans torrid campaign?", "mslaurentobias": "With so much hate in the world,how do you remain so confident and poise? Love yaaa <3", "katheeeloveee": "What is your favorite moment that you have had so far and why? Loveyouu 😍😍😍", "wedaknighthood": "What is your biggest fear? @loeybug", "savannahsmitchell": "You personally had a huge influence on me gaining body confidence. Did you have someone to look up to also to help you gain confidence or was it something you did on your own?", "rayners098": "Where on earth do you get all your cute clothes like be honest because I never can find what I'm looking for same with the swimming suits?? btw love how confident you are!! kisses 😘@loeybug", "adventureswithlau": "Do you know any words in spanish?? Love ya Gurlllll from Dominican Republic!!❤❤❤", "lifewithtati": "Will you ever do meet and greet tours ?? Future suggestion 💙💜💙💙💜💜 maybe you and some other YouTubers like both Alex's lol 💞 @loeybug @learningtobefearless @alexdenmon this needs to happen", "allyshmallie": "What is your current obsession?", "acc0unt_del": "What motivated you to start your own youtube channel??? ❤️❤️ love ya @loeybug @loeybug", "placebka": "@loeybug Is your marriage ok? I'm worried...", "itsjesska_": "When are you coming to L.A. with alex and doing a meet up? @loeybug", "rachel.m.wiltsie": "@happyfeet0416 not for nothing but she's never with him anymore and she never wears her ring so obviously people are going to be curious.", "geekychicofficial": "Love your little flower ears!", "shahdmestarihi": "@maria_rabah", "adoralyst": "What is your favorite show and why ? Love you so much you inspire me on fashion and confidence wise. @loeybug", "wife_mom_boss19": "Question what ur favorite holiday.... I love you so much I have Ben binge watching all of ur videos", "idonthaveone.lol": "What is your fav Disney animal/pet", "midnight_rituals": "Cool", "diana.nichole": "What was your favorite trip you have taken recently? & btw love your videos- you have been such a great inspiration. 😊 Thank you for doing what you do!", "bunnies1920": "What's your favorite color/number? P. S. Ilysm 😀", "nuwakshie_w": "I just want to say thank you for making such inspiring body positivity videos!! 😍😍 It has made a huge positive impact on me.. Being a south asian plus size girl was really a struggle for me growing up and my self esteem and confidence was always at a low level.. I used to be really negative about my body image.. The past two years I started to realize that loving my body and my appearance is the most liberating decision I could ever make.. When I saw your videos for the first time I saw how confident you were and hearing your story made me determined to come out of my unhealthy way that I was viewing my own body.. And I really wish I could've found your videos earlier.. Since you're doing a Q&A, how do you name your pets?? I'm a huge animal lover too.. ☺️☺️☺️ love you!!!!!! ❤️💖💜", "amanda08_spamms": "What was your favorite childhood show? Ps. Ilysm ❤️❤️❤️❤️❤️❤️❤️❤️", "_gracelawrence_": "Where is one place that you want to travel to? Love you so much btw❤❤❤", "priscilla_oregel": "Advice for going into highschool love u lots 😘😘😍😍😍✨✨🔥🔥", "bethany__hooper": "Have you got any tattoos and if not, would you like any and what would they be. ILYSM ♡♡♡♡", "boundless._beauty": "What do you see yourself doing if/when your YouTube career winds down?", "maggielmaxwell": "Loey you are so adorable omg", "bonnaroo86": "If you had to make the book that most touched your soul, which would you choose?", "emily.detert": "Do you get any negative vibes from the veg/vegan community from your diet choices and being plus sized? Or is everyone supportive?", "uhhmartha": "must haves in the fall?🍂", "izabella_rose_": "How do are you always happy btw I 💖 ya", "miamuth": "advice you would give to teenage girls/a younger you?", "private.account720": "If you could tell your younger self somthing what would it be? And ilysm😚", "anna.boyce": "If you had to be on a deserted island, what 3 things would you take with you?", "cassistoica": "what made you want to share fashion and videos on youtube?", "eva_tomas_": "What have you learnt from yesterday? ❤️", "little_flammable": "How do you help make yourself feel good on days that you're feeling bad? @loeybug", "kat_of_ambiance": "What do you look forward to the most in the next ten years?", "passionforfashion84": "What is your favorite item of clothing to wear", "morgitothemosquito": "Do you prefer cereal with milk poured first or last?", "sincerelymelissaxo": "If you weren't doing youtube, what other career do you think you would be doing now?", "luciiliu_": "Do you have a role model? Though you are one already..;)", "meghannwright85": "What is an event that has happened in your life that you feel has greatly shaped who you are now", "aliyahabbasi": "if you could meet all of your viewers at once, what would we do?❤️", "itss_ashleylen": "Would you rather be blind and not be able to do YouTube anymore or be deaf and not be able to do makeup anymore?", "skylerjayde98": "@loeybug if you could live in any country on earth besides America where would you live? Love ya 💕💕💕", "xmerfy": "Would you ever travel the world to meet all of your viewers ?", "rebecca_janegott": "Will you be doing any traveling to meet fans?! I love you so much, you are a sweetheart and such an inspiration:)", "sanchezkolbemd": "Is ezio named for assassins creed? Where did Maka get her name? Gunna adopt anymore fur babies anytime soon?", "skyladasilva": "how do you feel knowing you helped people get through so much, p.s. i love you sm ❤️💜", "lydiaheaney1": "Would u ever move to another country which one would it be ily @loeybug", "fit.thicc.nessa": "Why have you kind of shyed away from beauty videos? I noticed more recently that your doing more story time videos and talk videos and less makeup videos!", "tamarabaker47": "Do you enjoy living in Texas", "lizanne0502": "What is the most inspiring thing someone has ever said to you?", "7.28.am": "What's your favorite thing about being on YouTube? I love you 💕", "erinkennedy.exe": "How did your parents feel about you being a youtuber?", "rocioszurek": "When did you realised that you were such an inspiration for many girls? How did you felt about it? Love you❤️", "nevexhughes": "why are you so beautiful? 💕💫", "m_thomz": "can we be best friends? 😁🙆👭", "amylouisehorton": "How tall are you ? And I love your videos they have helped me so much 😊", "scoantares21": "Best beauty moisturizer for the skin?", "elizabethvmeehan": "What's you favourite food, and what foods do u dislike?xx", "sophie_dimmock": "How did you become so confident? I'm struggling right now and need advice! Love youuuu 💛💛", "mwallace1015": "You have beautiful skin. What face wash and make up do you use? @loeybug", "lianarashidd": "What countries would you like to visit somewhere in the near future ? Love ya so much ❤️", "najwa_mzln": "TIPS FOR PEOPLE WHO JUST STARTED TO WEAR MAKEUP... & HOW TO START LOVING YOURSELF AND BODY? (I dont have supportive families n friends so its kinda hard 😭 so how shld i start?) LOVE U QUEEN", "jamdelobrino": "Hi loey! If there's something about yourself that you don't like what is it? if there's a way to change it, will you change it? or just accept it? love you so much ❤💋", "anniekvanos_": "If you had 3 wishes, and you could wish Anything in the entire world, What would you wish? Love you so much💜", "nogginhead": "What's your favorite pair of shoes?", "shamsax": "How old are you and what's your favourite lipstick arm. 💕✨", "lellio": "Ola! Do you and ur hub get to spend much time together? What do you guys like to do? Xxx", "amelia_la_catracha": "If you had to live with just 3 makeup products, what would they be? ily😘💕", "doireannlynam": "What's your favourite Pokemon? 😊", "rebeccanasher": "How do you start to love yourself/your body? Love you so much.", "monigod": "@maria_adela", "tiffanyswarts": "😍😍😍😍😍😍😍😍😍😍", "_meggy_v_": "You look so beautiful!!!!! Have u had any recent paranormal experiences", "jessie.dp_": "How do get so much confidence. 🇬🇧🇬🇧", "christian_gir": "How do you deal with depression?", "amyw1": "Your such a Inspiration? If you had to wear the same outfit for the the rest of yu or life what would it be? Xx", "_estrellacastaneda": "QUEEN", "mistygrinberg": "@loeybug What advice do you have for someone (like me) who is starting their YouTube Chanel ? Thanks doll 💜 your vids🐱💟🎀🌠", "lexstephens30": "Hey, how long did it take for you to feel confident and love yourself? Love your videos xx💛", "ayesha_abdulaziz_": "If you could pick to live with anyone you want who would it be and why", "caymathis22": "@loeybug How are you doing? you've seemed down lately, I'm so sorry about your kitty, loosing a pet is awful. Hope everything is going well, sending positive vibes💖💓💖💓💖💓💖", "pot_ter_head394": "Have you been playing Pokemon Go like the rest of the world?", "pactparanormal1": "What's the craziest thing you have ever done? Love ya! 😘", "eve.herrington": "What's your favourite game to play ps ily so much 💓💓", "shelbyramona": "How do you keep your curls so beautifull when your a sleep and dont have a lot of time the next morning to do your hair?? 😻❤", "some_kind_of_wonderful1313": "What is your favorite? Vlogs or your main channel?", "ugh0k": "is this question gonna be in the video? btw. i fucking love you sm. 💘", "chloe_mxca": "What do you love most about yourself? Like a personality trait or something?", "esinvm": "If you could go back in time, what would you tell your highschool self? love you sm btw!!💗", "jadicorn": "yes queen", "xxshaniamaexx": "how/why did you start your YouTube channel? btw love you so so much❤️", "libbyleonhardt": "if you could travel anywhere in the world, where would you go and what would you do there? ilysm loey 😘", "baileyfalene": "If you could say one thing to all your Haters what would it be?💗💗", "jinxxedlegacy": "What advice can you give out for people who want to help spread the body positivity and love for example YouTube? Love you Loey! 💕💕💕", "jessicaruthdawes": "So you plan to come back to England for anything?💘", "norellesaada7": "what was your favorite part about vidcon this year? btw i met you there twice and i miss and love you so much!! 😊💞", "_mckenzie.davis_": "If you were to have 1 super power what would it be and why? Love you!", "rita.siagian": "gw segede ini gag? @argadia", "myrandalent": "She's adorable", "mrs.amelia_cross": "@loeybug For someone who is big in the YouTube world, what advice would you give for someone starting their own YouTube channel?", "arielbrynn_": "Would u ever do skits", "zabreya": "❁ What or who inspires your style? ❁", "roxanasifuentes": "Out of all the places and states you've visited which one is your favorite? Love ya! 💞😊", "jskskfjdkdlsoaljddj": "Do u ever get unconfident bout your self??? Cause Ik do", "china_2.0": "How was the reaction from your family and friends when they found out/watched you on youtube? @loeybug", "stephchichak": "Hi love! How is your summer going/what is your favourite thing about summertime? Love you and your videos so much, you are such a beautiful soul inside and out💖☮", "yuechan119": "Oh sexy girl!!", "lilith_rose19": "Hi loey! Ilysm! would you rather be the biggest youtuber ever but never have time for your personal life or have a fabulous personal life but have to quit youtube?", "joc.e.lyn": "If you didn't ever start making videos on youtube, what do you think you'd be doing?", "sarahschulist": "WHERE DID TY GO WE HAVENT SEEN HIM IN FOREVA GIRLLLLL???? !!! PS I LOVE YOU SOOOOOO MUCH❤️❤️❤️❤️❤️❤️❤️❤️❤️💞💕💕💘💘💘💘💘💘💘💘", "madprops12": "Favorite Bath and Body Works scent?", "michellc01": "Whay part of your body do you like best?", "jordyn.capra": "what is your favorite type of video to make, and what is your most requested?", "brenna_baird": "Hi Loey, love you! Where do you see yourself in the future and what are your dreams & goals?", "lakyndanielle": "Were you in a sorority in college? What was your favorite thing about college?", "candiwakeley": "Do you plan on changing your hair color for the fall? I love you so much! my idol 😍", "the_hashslingingslash3r": "Love You💖What do you love most about doing YouTube and how did you get started?", "loriiianng": "How do you stay confident and stay positive when negativity hits you? LOVE YOU LOTS! 💗", "thisisparadice": "What do you think is the most rewarding part of you being a beauty vlogger?", "aylii.nn1": "Who else wishes there question could be answered but anyways ill try so whats your favorite type of anime and also ilysm ❤❤", "katiemagruder": "Hi Loey! Would you like to have kids one day and if so would you want a boy or girl?", "radiantholhealth": "If you could meet anyone dead or alive, whom would it be? Xo :)", "sunspeckled": "I'm headed off to college this August and I'm so scared. I'm worried that I won't do well and that I'll constantly compare myself to everyone else all the time. I've tried to change my feelings but I can't. I was wondering if you had any advice. Thank you so much for taking the time to make videos!! Please hug your doggies for me ✨💕💖🐶", "juliekallini": "Hey Loey! Our body types are very similar and you really have helped me learn that I am beautiful at my size (it's different when you see yourself in another person, ya know?) what do you do to prevent chafing especially when wearing dresses and skirts? I haven't been doing anything about it and it has kinda led to scarring over the years. Anyway, Stay awesome ❤️❤️😘", "helinavalb": "What is your favourite non-animated Disney film? And how do you relax? :)", "wendy_rager03": "Where are those shoes from?! I am obsessing!! 😍", "_unforgettable_95": "@loeybug How do u let someone go that hurt u a lot?", "ninaa_sk": "What do you do when you need some confidence? Or if your feeling down about yourself? Btw love you so much💓", "the_jolie_show": "Although you want others to be confident in their own body's do you think they show like be soooo healthy or be able to eat a little bit of crap food here and there", "shawnabutnot": "Lastly, would you consider coming up and visiting Alaska?", "gabbiehertzke__": "What color have you always wanted to dye your hair but never have?❤️❤️💙❤️❤️💜💜💘💜❤️💙 I love you loey!", "jessicapaige1616": "I really just think you are so beautiful and inspiring. How do you stay so confident with the society these days?", "gabi_r127": "Hey loey! My question is if you had to eat one thing for the rest of your life what would it be? Love you girl #slayMyQueen 👸", "_susanna.maria_": "What's you're favorite online clothing store? (Boohoo, wet seal, forever 21 etc.) I live overseas and can only get clothes in my size online. Ily💕", "carsandraa": "Hi Loey! I just wanted know how you are doing and I wanna make sure that you're doing well after losing your cat. I know he meant a lot to you and I just wanted to make sure that you're okay. I love you dearly, Loey!❤️I'm sending you all my love😊", "my_life_is_my_babies": "Hi loey love u from israel! Wish u come here!", "ssusuartdailyy": "Hey Loey! I love your videos and I thank you for being such inspiration to me and to other girls. I have became so much more okay with myself and most of it is thanks to you and your way of seeing life. Now to the question. What's your favorite pokémon or top 3 if you're like me and can't choose just one? 😄😄😄", "kiss.my.cass___": "Honestly love you so much for helping me love me! Is that a self absorbed thing to say? Idk, but my question is simply \"are you okay?\". I'd be happy to talk! Dm me if you wanna", "goats_and_pizza": "When did you start wearing clothes \"big girls can't wear\" and what did you buy? I just got my first bikini two days ago and I'm so happy! ☺️", "keperry01": "Just a fun question! What is your favorite Starbucks order!! Love you so much loey😘", "fellyy12": "@loeybug what advice would you give to young girls who are struggling to find confidence in their body type? P.s I love you and your YouTube channel!❤️", "missytohm": "What are your biggest successes in you modeling career and at what point did your modeling really start to advance? I am a plus size model just starting out in the industry and I love to hear about how your work is going in the modeling and fashion world and what goals are you wanting to pursue next! Btw I love you so much!! You are my true inspiration! 💕💕", "thurl.ki": "Marry me?😍😍", "shelleyclark13": "What Disneyland ride would you choose to live in? Love you girl, slay on ✌🏼💕", "olivia_herndon": "If you could only wear one outfit for the rest of your life what would it be? Love you💕", "juanira.a": "You have been so inspiring to me and helped me get on the path to loving myself regardless of what others say. Love you❤️❤️ my question is do you want to have a baby anytime soon?", "redhairdontcare_91": "What was the last book you read? What did you think of it? P.S. You're stunning!", "elliebroyles": "Hey Loey! First of all, I think of you as an Internet big sister, hope that's cool. Lol. You have such great advice on so many topics that I can't help but love it all. The only thing I have to ask if you could live anywhere in the US, not including places you've already lived, where would you go (maybe Indiana so we could hang out and be bffs?😋😋)", "bumblebee5296": "If you could live anywhere in the world, where would you live & why?", "fuze83": "@loeybug What is your workout plan an how do you keep a healthy diet? I'm looking to get in better shape :)", "mariahlola123": "Do you watch once upon a time?and who's your favorite character?", "brooksshelby1": "@loeybug", "lucyastwood_": "Hermosa", "saraiisan": "Would you ever consider going brunette 😻", "mercysantiago_13": "Tips on how to stay confident?💗💗 bye gir! 😊", "loucedano": "@loeybug 1st off your amazing and I love you but what would you have any advice on getting used to being more open on YouTube? What made you feel more comfortable? Trying to launch my channel", "schaerlii": "What is your biggest fear?😱🙊", "carlawiitta": "Hi Lolo, what is your fav pokemon ever and your fav catch at Pokemon Go? Love you girl ♥️ suerte en todo.", "krista.von.edmonson": "When you were a child what did you want to be when you grew up? 💞💞💞 you", "bl0ndie98": "I graduated this year #2k16 and I'm not sure if I'm ready for the adult life. Do you have any advice for the adult life and how to keep it lit? Ps: I love you ❤", "84eyefox": "Pretty gurl!!! @loeybug", "jennac.rabbit": "Hi Loey!! ❤ I was wondering if you were thinking of having babies soon? Love you, gorgeous!! 😍❤", "wtfcedes": "I'm getting a high waisted swimsuit soon do you have any tips on how I can feel comfortable in it? Thanks and I love youu❤️", "tessaaasset": "What are you most proud of in yourself and in your life?", "samiellie": "Loeyyyy! Love you lots, how do you tune out the negative feelings about food ?", "shadin.nn": "I'm not confident with my body and I hate my body so much like I just wanna be my self but I can't im some one else, do you have advice for me to love my body and feel confident", "aliciadiallo_": "Does it ever get too much for you, knowing that you're such a big inspiration? Love you💕💕", "gtg_shelby": "Are you typically a \"deal\" shopper?", "pinkyvixen88": "When will a loeybug baby be in your future", "ashleemoultonn": "How you stay confident in all the time?", "_heather97_": "If you could go back in time what would be one thing you would tell your younger self? Love you.", "elliesimmons33": "How did you first gain confidence to go to the beach in a bikini and not care about the people with the perfect bodies?? Love you sooo much 💕 @loeybug", "haileybair": "Who is your biggest makeup inspiration? Love you girl!", "yuliluvchux3": "In this picture I love your outfit where did you get it ? It so cute", "dakotaclare": "What inspired you to do YouTube?!", "agapepe": "How to be popular without using a youtube?", "im_sucha_lopez": "Omfg this is such a cute candid!!!", "caitlynkissandi": "How did you learn to accept yourself!? Ps you gave me confidence to actually wear a bikini without trying to cover myself 24/7", "mina.city": "How did you take criticism back then vs. How you handle it now?", "nunezjessica_og": "Did you gain your confidence at once or did you gain it little by little? ily💖❤❤", "kyliexx.x": "What is the worst thin that ever happened to you", "loeybug\nVerified": "Verified", "_violentpudding_": "If you didnt do youtube, what would you be doing?", "shyra2_cute": "Are you planning on going on more trips with Alex, Learningtobefearless, in the future? P.S. I love you, ur channel, and the friendship u have with Alex 😍", "savannajoi": "What advice would you give to someone who doesn't love who they are on the outside", "shelly_chells1": "Will u ever be in Kentucky", "onlydmoney": "Who's your favorite person to do a collab with ? I've just started watching you & you're awesome", "caitlin_nw": "How is Ezio doing?", "hannahn613": "Why are you so awesome? Also favorite anime ?", "monikaraygoza": "What do you do to stay positive ? 💓", "fenella21": "What's your favorite form of potato? Eg. Mashed, Baked, Chips 😂😊 Love you so much ❤️", "bethanyddunford": "I'm only 18, and I wanna dress the way that makes me feel beautiful but if I'm not wearing a long shirt my mom won't let me leave the house. What should I do? Btw love you so much!", "hayley__daily": "Did you get nervous before your panel?", "lane.cay": "How do you stay confident and do you have any tips on feeling more comfortable in your own skin? I've been struggling recently...", "ericcommando": "I love it when you smile. It gives me all the feels 😃", "nicolecajamarca12": "What do you think about serious relationships in highschool?", "sxn.txnx": "How do you handle people who judge you? I've never been able to handle the judgement of others", "ebornshin": "I feel so big and scary looking in front of other people since they are so pettite, (I'm 5'9.5 and a size 18) have you ever felt like that? How did you get over it? Any tips? Love you 😙", "abigail_trost": "Why did you decide to go vegan?", "gizelle.cg": "If you could collaborate with anyone in the world who would it be? OH AND.. YOUR BOMB AF<333", "peachstarfish": "I love you @loeybug! Since you have super gorgeous hair (read: goals!!) how do you prevent it from drying after constant coloring? Thanks!", "hannah_perryyy": "Has being on YouTube and being seen as a \"plus size\" youtuber made you more confident or has it had the opposite effect, you make me feel so confident and have helped me grow my own channel so thank you so much ily 💕", "hope_makayla": "How do you get passed all of the negativity?", "paigey19waigey": "Would you rather be a mermaid, or have a pet unicorn🦄 I love u!", "ericaa.gracee": "Also what's your opinion on drugs/alcohol/and friends in high school?", "kana_travels": "Tips on over coming the fear of telling your crush that you like them. I know it sounds crazy. But as a curvier girl then most, I have trouble telling myself, \" no way he'll like me because I'm bigger then the average.\" My own thoughts crowd my judgement to either doing something or not. Idk I just feel like I'm lost within my own body to say, do, or feel the way I should be feeling. Which is body positive.", "paytonw653": "What/who are your favorite things in life?? Ps I love youuu💖", "yepitzmichy": "Y do U think U keep getting Paranormal experiences? Ps ILYSM ❤️", "edennorris": "Biggest fear?", "madelineandreaa_": "What's you're biggest tip going into high school. Love you so much 💖💖💖", "audreyknapp": "What inspired you to a start making YouTube videos?", "jbm192": "What is your favorite and least favorite fashion trend from the past year?", "x.pxrisbear.x": "Would you rather close your finger in the door once a month or stub your toe everytime you make a video? @loeybug", "alexis._.webb": "What is your favorite YouTube video of yourself? I love you soooo much", "veronicasidles": "Just wanted to say ily💕💕💕💕", "emilyykoreaa": "why'd you become a youtuber? I'm thinking of becoming one myself in the near future. also do you have any tips", "_sweetcarolann_": "Would you ever come to Australia for a meet and greet? Ps love you so so much ❤️❤️❤️ @loeybug", "unicornfairyglam": "Who's your top Pokemon? Which one do you want to catch? Love you 💕💕💕💕", "dani.greenwood": "What are some things that help you improve your mental health/fight depression? Love you! You are so strong and lovely 💕💕 @loeybug", "alexcooper514": "Who are your favorite YouTubers? :)", "kaitlynanne423": "What is your all time favorite lipstick?? You are absolutely gorgeous!! Love you💕💕💕", "nadia.xo___": "Do Yu ever think to yur self do Yu matter to other people?", "rina.dinarica": "What your favorite lipstick?", "bethaney_green": "I live in a town that doesn't have many plus sized options and the ones that are here are really expensive and I have been wanting to shop online but I am wary about buying products because I'm still self conscious about how things fit on me so I was wondering what are some really nice places to shop online", "aracel.iiii": "Do you have any siblings?", "oliviagracerumbley": "Any advise for meeting new people and starting convos? I'm starting college in about a month and I'm freaking out!! PS. Ily so much.", "marijogtz19": "Are you ok? You've seem to be a little sad in your recent videos, i love you so much you're sooo beautifully gorgeous i love your style. Just a little fan from Mexico", "kyleighkae": "What setting spray would you suggest for the summer time?", "paige.revell": "I am 12 and go through a lot of bullying at school because I am larger than the other girls what can I do", "angell_lachance": "What is your advice for learning to love your appearance when others only criticize you? Do you have any advice about managing anxiety through major life transitions?", "alleahmm": "Okay if you had to pick one genre of music to listen to for the rest of your life what would it be? And btw, you're a huge inspiration and I love you so much❤️", "cheyennennene": "How do you get your hair to grow so long and still look healthy despite dying it?", "miaisclueless": "What is your favorite type of video to film? Ilysm❤️❤️❤️", "justme_nancy": "Where did you get your flats?????", "sarahseasaw": "GIRL How has your day been going? Did you get a good sleep? How can we encourage you this week? ♡ Love love you!", "thereluctantmermaid": "Ever been to the Mall of America???", "bananashanna": "Just wondering which section of texas do you live in? Im in East Texas!!!", "pastelpeonyphotography": "@loeybug Do you have any tips for an aspiring beauty vlogger/youtuber?! Btw love this picture your are forever so graceful and flawless 😍", "kaitlynborst": "Do you wear matching or mismatched socks? 🤔😄", "jabr612": "Do you think you could survive the zombie apocalypse if it ever happened?", "kahl.morgan": "How do you over come the fear of being body shamed? Im heavy set so im body shamed all the time and i wear my favorite outfit and look in the mirror and say \" not today, im not wearing this today.\"", "woah.its.nyaisha": "Where is the best place to shop at for plus size women and btw i love you so much", "sarahmaryxo": "How are you? Simple, but effective😂❤️ I love you so much!", "lscxtt_1": "Hey loey!!! Love your channel so much 💋 do you have any advice on how to work on social anxiety ? And tips on getting a summer job??(even thought summers almost over LOL) Ily so much!!", "liz_beth1015": "Who did you look up to growing up?", "zoee.motta": "@loeybug have you ever bleached your hair?? Btw Ilysm", "hope.myer": "What's your favorite makeup brand and any new projects that you can tell us about? Love ya btw💗💗", "heidiportilllo": "Who is your fav artist and y?", "unicorn.garage.band": "I'm a teen aspiring to be a plus sized model what tips do you have to become one? @loeybug p.s. you're such a huge role model to me, you're awesome!", "popcornzebra12": "Hi Loey first I wanna say ily😚! My questions are where do u live and what's your favorite show 📺!", "salenaperez": "How did you learn to love yourself? You always look so happy and confident. But for me, I find that at times its hard to feel pretty or accepted when the whole world is telling you differently. Any advice? Thanks much!💜", "eurekahaas": "my question is do you love Alex denmon as much as I do 😊", "amberr.jenn": "Do you have any regrets?", "mxciexxox": "Where is somewhere you want to travel ?", "lindsaylovesauras": "What are your top eating/work out tips for being healthy? Ily💕💕💕", "lyssie.inboden": "Do you think a kitten or another fur baby is in your future? I love your face and I hope your having a magical day! 💖", "rockmomma4": "Are you where you thought you would be five years ago ? Where do you want to be five years from now ?", "dalina_28": "Well first of all i love you 😊💜 secondly, what is your favorite book/series of books?", "andreafloresv": "What are somethings you would tell your younger self?", "jill.davidson": "Do you ever feel people judge you for your body? If so how do you deal with it? @loeybug", "yoyo_cosplays": "I remember the first video I watched of yours you had a kyo plushie from fruits baskets. What other anime do you like? I love your videos by the way^_^", "tzysk99": "Hi Loey! I'm a huge fan! I've watched all of you body confidence videos, and I was wondering how you came to love your body? I've had a hard time accepting mine and I was wondering if you had any tips?", "eclarim_": "What do you think your next hair color will be? I love the constant change up, it always looks so good 💕", "tayglow.spam": "How do you feel about bullying/body shaming in general? or How was school for you? or even How are youuu? 😊", "genevaa.g": "I've tried to go on diets and work out but lately I've been slacking and I'm almost positive I've gained. I'm already a large girl with very little self confidence, what can I do to feel better about myself and my body?", "lucyward.0": "What is your favorite book? Love you❤️", "makalafurse": "Will you ever move to LA?", "elenaquirozr_": "How much subscribers did you earn in your first year on YouTube?", "hannahhmcleod": "But for real where do you get your hair done at?😍 like your hair colors are always so pretty!", "marasgm": "How to style yourself with a curvy body? Tips and favs", "savvysleepers": "How do you prevent hair breakage?", "mikaylamarcha": "if you absolutely HAD to get one plastic surgery procedure done, what would you get? ps. not saying you need it its just a question. & ps i love your vids & youu❤️❤️❤️", "cvlvsyou": "Have you ever attended college ? If so how was it like for u ?", "kyler.grubiss": "Hey Loey, what is your inspiration for fashion and clothing? (I love you❤️😊)", "mollzballz_": "OK, this is the HR in me: where do you see yourself in five years? @loeybug", "x09022020x": "how did you became so confident? Love you 💕", "lanie524": "If you could switch places with one living person for a day, who would it be?", "alyssachii": "Do you ever feel jealousy over the bodies of other plus sized woman. I do? What should I do? I am body positive and an comfortable at my size but some times I wish I had a more conventional plus sized body type (size 14 and super curvy)", "vstuckless": "What is your biggest goal you want to achieve by the end of 2016?", "imnotmegann": "Would you rather cut grass with nail clippers or fill up a huge pool with an eye dropper?", "tessastewart_": "Who was your inspiration growing up ? ☺️💜", "nomnom_nom621": "I'm 14 and people are always judging my appearance body wise and I'm really worried to start freshman year bc of homecoming and all... Any advice?", "samantha.c.thomas": "How do you have all the money to buy all the cute trendy styles?", "carriepalme.r": "How was beauty con and what was the best experience? Lovr you so much 💕", "mshaileyy": "How do I deal with the nervousness of starting a new school?", "kimberly__gk": "Hey loey!!!! Thank you so much for inspiring me everyday and giving me confidence. I love you so much!!💗 my question is how do you stay so positive and not compare yourself to others?? Thank you so much 💖💖", "dani.themermaid": "Omg I love you so much!!!💕💕💕. What advice would you give to girls who look in the mirror and aren't okay with how they look? No matter how many people tell them they are beautiful.", "breeannbowers": "whos your biggest inspiration?", "sdg.x": "What all colors have you had your hair? :) also I love you. You're extremely inspirational. 💙🌺", "xo.jennagrace": "How do you calm down when your anxiety gets bad? I love you so much Loey. 💖💖💖", "sayyadrianaa": "Ever since I discovered you. You've been my favorite YouTuber 💕 how did you become so confident in your self and what advice would you give someone to help them become more confident", "its.alia": "favorite conspiracy theory? out of anything!", "blakeycake": "What are some good online plus size clothing brands? I'm on the taller side and I usually have to settle for going a size or two larger so that it's long enough. Love you so much @loeybug 💜💜💜", "katie.sharon": "How do you stay inspired and happy, when life is so hectic??❤️❤️", "lexie.reann": "What is you holy grail makeup product at the moment (btw ilysm❤❤❤)", "lasages": "Have you had a situation/event take place in your life that has changed your outlook on life?", "kayyytea": "What are some aspects of your life that you never imagined would have happened when you were 16? (Other than YouTube/fame)", "wifeybryana": "I love you btw❤️", "brooklyn.knight": "Do people look at you weird when you are wearing you bikini and how do you overcome your hesitations around that??", "madisson.craft": "What is your favorite thing about being a YouTuber? Ps I love you so much and you give me life so never stop being you ❤️", "shannon.powell": "If you have any advice for upcoming high school seniors, what would it be? Love you💖", "marvelfangirl_97": "What have you learned from being a youtuber p.s. ilysm", "_varshashaa": "Hi beautiful!! 😘😘😘 I love your videos because they're always super sweet and you are pure sunshine and I wish you nothing but the best. ☺️☺️ My question for is, if you could relive any day(s) of 2016 so far what day(s) would it be and why? Love you girl and hope you continue to radiate positivity and love as usual! 💖✨", "camillejones": "How have you been able to combat your own insecurities while helping your subscribers with theirs?", "itshaileyhayes": "What's the hardest lesson you've had to learn in life?", "_victoriacarrillo": "How was your day today? & are you religious? I love watching your videos! Very inspirational and beneficial for every body type. Keep doing you gorgeous 💕", "aiden_hatley": "What advice do you have for plus size teens who struggle with finding confidence? I love you so much, you mean the world to me❤️❤️❤️", "tiffanygeovana": "Hi Loey! Would you ever collaborate with a smaller YouTuber? Much love from Tampa, FL 😘💕", "rrrrackcitybitch": "YOU LOOK SO PRETTY😍😙😘😚😭😻😽🙈🙉🙊❤💋💞💟👏👌", "jaimemarcucci": "I love this picture, you look do happy! :)", "blackgirlmanda": "Hi loey. What advice would you give to high school girls about loving themselves", "gabxxriellee": "When and how did you learn to not take what people say and think about you to heart? Especially from the people you love", "kendra.kt": "If you could be any age for a week, what would it be?", "k.alerra": "😍😍😍💜💜💜", "avamstewart": "What's one thing about yourself you wish you could change?", "kayyla.rene": "What inspired you to start a makeup channel? Ps: I love you so much!!", "0fficial.abby_": "What is your favorite place to shop?? ilysm 💖", "amycastle01": "How do you go out of your comfort zone with clothes? Like I want to try new clothing pieces but I'm a bit scared of not looking like mylself, love you girlie💗", "sam.taaylor": "you're literally so gorgeous!! What is one thing you desperately want to do before you die?", "marcellamarie4299": "What inspired you to become a YouTuber? Why did you decide to share your struggles with body positivity and how you overcame them?", "katie__nagle": "You're so cute OMG 😭❤️ are you going to plan a trip to Minnesota? I think I remember you saying you wanted to visit here. Love you 💖", "statelinethrift": "What is your favorite plus size clothing line?", "shiannmariefitness": "Are you ever going to come out with a makeup or fashion collection?", "marandafontenot_": "What is your religious background and do you still practice your religion now? Love you!❤", "kitkatnyanya_": "what is your favorite pair of clothes", "brittanymarie0x": "What is one piece of advice that someone has given you in life that has stuck with you?", "n1aev3": "what do you you hate the most about traveling so much?", "olivialoew": "Favorite color combination? Middle name?", "x.em.xx": "Will you ever come to Florida?", "dianaelizabethamaya_": "How did you start your fashion journey", "thearcangelfell": "Are you doing okay?", "nikkolelawhon": "Will you ever dye all of your hair brown?", "chandalynstar_": "Did you have to put Ezio down? Did he take a turn for the worst? Jw by the post you've made 😞"}