{"some_kind_of_wonderful1313": "Why are you moving? Love you💜", "bradenteat": "whats your favorite eye pallet? ps ilysm & ur videos", "emerywashere": "What has been the hard difficulty you've had to overcome during your YouTube career?", "the_jolie_show": "📚favorite book📚", "danicunning": "On your body confidence journey what were some things you would do when you found yourself slipping back into self criticism and negative talk? How would you get out of that space or turn your thoughts/self talk around? For me personally some days I feel really great about my body, then other days I feel awful.", "elle.mclaughlin03": "Your most watched movie , one that will never get old for you X ilysm ❤️", "allisonpaige__": "what's your go to outfit/make up routine?", "alyssa_jayden_": "If you had a child. What would be there names? Ilysm💚", "olaiteasilokun": "where u more of the sporty kid or the girly girl in school, love u!", "skye.lucier": "I love ur paranormal story times!!!!! Plz do more ily xoxo", "tabbyatkinson3": "What's your best advice to military wives?💕🇺🇸😊", "siacarr": "Where is this shirt from?! 😍😍", "alex_boten": "Where do you get your inspiration from?", "really.mia": "what is your favorite makeup brand ??", "_.ellxjo": "Where do you get all your confidence from? Love your work and you! xx", "elisaabrooks": "Who are your favorite youtubers?", "j3nnypxoxo": "Can you upload videos of you dying your hair? It always looks so pretty!", "oldacctamelia": "Did the scammers stop calling you btw love you !!! You're such an inspiration !!", "annabayne_": "What was your funniest paranormal experience, if any are funny? Btw keep doing you and stay beautiful 💗💗", "behindthese_blueyes": "Also I just got introduced to your channel from my sis in-law, and I LOVE you and your confidence and your attitude about everything. Your such an inspiration! @loeybug", "gcf97art": "Any tips on how to be confident in the clothes you wear? I really wish I had your confidence!", "ninaabers": "Whats your biggest pet peeve??? Ily so much❤️❤️", "carmen_coetsee": "If you had to give advice to your 10 year old self what would you say? Plus you slay life and you are such a beautiful person. Inside and out 💛", "_christinemarie20": "What color lippie are you wearing in this photo? So pretty!", "elvirazetterberg": "How do you get through those days of low self esteem and unhappiness? Any advice?", "melanie__coleman": "will you ever do your own meet and greet tour?? i love u xoxox", "nikigeee90": "Have you always had the confidence to wear bikinis or was their a \"defining\" moment?", "makeup_by_joolz": "Do you have a po box for fan mail?", "jessielovesthis": "Have you planned anything to do on Halloween this year? 🎃", "jaydaisms": "whats ur favorite brand of super glue", "granthar89": "Do you believe in soul mates?", "woopsarah": "What's a good set of makeup brushes that won't cost a fortune? P.s. I love you💕", "nicefernandesster": "What advice do you give to someone who is overly conscious about the chin?", "camrynl52": "@caklukas1 omg! Ur dad, especially ur family and NO ONE should treat u that way!!! Keep him out of ur life until he changes his ways.", "beyoutifulxtina": "Please tell me what's on your lips!! 😻😻", "sara_marie22_": "What's your favorite old school anime? Love you tons 💟", "brookeballos": "Favorite Pokemon?", "amandabjork21": "What lipstick are you wearing? 😍😍", "bojanaasavicc": "Whos your favorite actor? and why? ILYSM💖", "fenella21": "Would you rather a world without puppies or kittens? 💓", "sillylittlewitch.jpeg": "What are your fave liquid lipsticks? ✨✨💄", "dann.i_": "Do u have any goals atm?? X", "hellotobutera": "what is your favorite childhood memory?", "monmon079": "What's your favourite part about being on YouTube/social media?", "audreynpiller": "What was your inspiration to start a You Tube channel", "cheacas": "That color is lovely on you! I love blush", "_rankenfile_": "Why are you so darn beautiful? Love you Loey!!! ♥♥♥", "londonvictoria": "Why are you so perfect", "bethradda": "What's your favourite book at the moment ???💖 you xxxx", "munkymegs": "@loeybug what is your favorite fall color to wear? Outfit & lip color", "daisy_emily03": "Will you ever come to the uk for a meet and greet? would love it if you did !😍😍i love your videos and you are an inspiration!! Ly💖💖💖💕", "lilymacfarlane_": "How are you so gorgeous?!?! 😍lol. Ok. Will u ever come to UK?", "luciiliu_": "Where does all your confidence and strength come from?", "megthdr": "What philosophy do you try to live by?", "angel.m.20": "When feeling self conscious, what's the one thing you say to yourself to feel better and feel good about yourself again ❤️", "deleted.com.ay": "Did you ever think you were going to get this far on YouTube? ❤️ ilysm", "mynameisclaudiuhh": "QUEEEEEEEEEEEEEEEEEEEEN 👑💐💖", "serena_221b": "Which do you prefer, a potato salad (With like,mayonnaise and spring onions) or a green salad? Love u tons!", "natasharolleston": "you are literally so gorgeous!!! what lipstick is this?! and how do you always stay so confident with yourself when there's so much hate and negativity everywhere?", "shawnabutnot": "Would you ever take a vacation to the Northwest?", "shene_barnard": "What made you finally be confident in your body and how would you help others to start being confident and ignore the negativity?", "_j.murdock_": "Can you PLEASE do more scary/paranormal story times? I absolutely love them! @loeybug", "oldaccount18579": "Your so beautiful! I love your videos 💞", "acupofmelissa": "Can you do my make up for me!!? I'm so lost!! 😭", "bribop92": "Where is your absolute favorite place to buy makeup?", "ebonymadeleine": "Will you ever come to Australia? I love you!", "charlieobriendawes": "Would you like any children in the future?", "sophie_lhw": "If you would like children when you're older, how many? 💟", "myeffulgentlife": "What is your favourite poem? ♥♥♥", "keelyyoconnell": "How did you become so body confident? How did you overcome all those problems and ignore what people said?", "abby62971": "How do you stay confident?", "alliberry___": "How is life? Lol that's not my real question, but it's a good one. I have so many tbh. Do you watch Supernatural? Would you consider watching Supernatural? How is your hair so perfect and what is your routine? If you want kids, how many and what gender?", "hay_all29": "How do you manage stress while constantly traveling and working?", "whtvrdenise": "What're your top three tips/advice for someone who wants to start a YouTube channel", "disbemyspamhomies": "Do you ever find yourself judging your body and how do you become to body positive", "littlemexicanthatcould": "have you ever lost your period while in your eating disorder, and if so, what did you do to get it back?", "emmasaarsoo": "Beautiful 😍😍", "mackenziedrakee": "Tips for growing your YouTube channel?❤️❤️", "veronica.juliaa": "If you're into zodiac and all of that, do uou find that your sign is accurate??", "ems0626": "Best physical feature on yourself?? BTW I love you!!!", "madprops12": "This makeup look is so pretty @loeybug 💖😙", "mymy_1115": "What is your go to eyeshadow palette? I love you💕", "hannah_buren3": "What is the absolute best thing about the fall season??? Luv youuu!!! 💜💜💜", "bloopiter": "what is your go to shop for plus size clothes other that's affordable? I need a new place, anyways, I love you loey!!!💕💕", "hanafrank21": "How's your new puppy doing? 😊", "brennalaelle": "FAVE FRO YO FLAVOR💕 @loeybug", "sweetheart071": "How do you deal with insecurities and anxiety?", "eliza12c": "😍 How do you always get your hair to look so perfect? Btw your drop dead gorgeous 💘🙌", "its.tiffany_": "What are some tips you can give on how to make stretch marks less visible . ily💕", "mari.mnunez": "What are your fears? have you ever been forced to face them", "cat_tindell": "Who is your role model and tbh Ilysm", "kaseyxvx": "What's your favorite movie?", "janecharliescarlet": "Are you personally proud of what you achieve so far?", "michelerwoolf": "What is your favorite thing to do for yourself like pamper wise?", "kaseyanncooper": "If you had to choose one youtuber to watch for the rest of your life, who would it be? LOVE YOU LOEY😍", "loserofthemonth": "Can we go on a dinner date?", "raccoonprincss": "How tall are you?", "pagiieee": "What is your go to lipstick of all time?", "northsixx13": "What is your favorite outfit to wear on a chilly autumn day? I love you so much, you're gorgeous and you've helped me so much with my confidence 😊😘", "soft_hellos": "How do I not procrastinate!!!!!", "tiarae62": "WHERE IS YOUR RING! is everything okay?", "aridorsey": "Favorite fall time candle? I just moved into my apartment and I'm looking for recommendations!", "jojo.burrito": "What are your fall go- to outfits?", "radmusique": "I'm an aspiring makeup artist & it would make my whole life if you gave me a shoutout on your channel 😭❤️ I love you loey!", "lill.jade": "How to feel comfortable in clothes if your new at being a plus size women. I struggle with it. I like personal style but how do you embrace it.", "hairrfeed": "Hey babe! Can I just say I absolutely love you 💖 & what advice do you have for someone attempting to start a business through social media? 💋", "stellapallasch": "I love you so much!! do you have any tips for dealing with anxiety?", "aashleychanel": "when you first started youtube, were you concerned how people you grew up with or went to high school with would react? like we're you worried about them judging you?? it sounds dumb lol but I've wanted to create a channel for the longest time, but that's always been in the back of my mind", "becca_lynne_boo": "Do you ever think to yourself when trying on clothes \"I don't like the way this hugs my body\" ? And if so, how do you find the confidence to rock an outfit anyways?", "kelseylyonss": "what's one of the most crazy or reckless thing you've ever done?? love you!! ❤️❤️", "sppaaamm____": "What's your favorite song??", "natmatie": "Hi! I am also a military wife, and I wanted to start a YouTube channel to pass the time while being stationed where I am! What tips can you offer? Thanks! 💖", "breana__reese": "I want to say that you're amazing and truly an inspiration. My question is how are you? Love you mom 😘😍❤", "453621866m": "What was ur scariest ghost story ever? Plz have this in ur video", "nikkilancaster_22": "Will you ever come back to Kansas to do a meet up ? Love you so much!", "kiyalover78": "What are you dressing up as for Halloween this year?", "issabella_slugaxx": "Can you please do a tutorial of this look??? Have you thought about going to Melbourne in Australia for a meet and greet?", "ambers_ateam": "Hair tutorial on how you did it in this pic 😍😍 love your videos!!!!", "nataliavasq": "What lipstick are you wearing?", "seirraxmartinez": "I started my junior year at a new school in a new state. Do you have any adive on being more confident and outgoing?", "my_life_lizzie": "Where did you get that shirt at? Its sooooooo cute P.S ily❤❤❤❤", "seabreeezie": "Did you go to your freshman homecoming? How do I get a date?", "fallxgoddess": "What cameras would you recommend for vlogging and videos? I'm using my iPhone now and it's such poor quality. Love you!", "_gracelawrence_": "Where is one place in the world the you want to visit? Btw I love you so much and you are such an inspiration💞", "holly_781": "Hi. I was wondering if you had any advice for plus size girls who never get any male attention and feel like they are never gonna find someone because of their size? Love ya 😘 xx", "courtneymkline": "How did you learn to gain confidence and be happy with your body? I still can't seem to find it", "emm.28": "What has been the most struggling aspect of being apart of the plus size community? Love you💖", "yaknow.tristine": "Is it difficult for you to find bras? I have problems finding ones that fit the cups and band since I'm bigger but have smaller breasts. Where do you buy your bras? And any tips for finding ones that feel great?", "alwayskate_": "please do a tutorial on this look! 😍", "dettilc": "Most embarrassing moment? 😋", "thereelari": "How do you feel when you are filming your paranormal/scary story time videos, especially alone?? Btw I love you!😍💞💯👑", "gggizan": "Funny story from high school", "sabrina_l_c": "Where is your favorite place to buy clothes?", "stephanieharper_": "How long did it take you to get to complete self acceptance? Love you so so much 💌💘", "nicci.is.me": "Can you do a video about spanx/shape wear?", "lovefromvalerie": "what lipstick are you wearrrrring?!", "talis_sofia": "Whats your favorite comfort food??😋😋😋😋 @loeybug", "fatimahiftikhar7": "Are you still friends with your highschool friends? Love you💖🐼", "joyfullyjosette": "Favorite TV show?", "violacsies": "if you could only wear one makeup product what would it be? @loeybug 💗", "merrygirl94": "What would be your \"last supper\" of choice. Not to be morbid, or anything. 😂 love you!", "hfendley": "If you could pick one \"style\" clothing and makeup to wear everyday what would it be? ❤️", "bethfreeman94": "Describe your ideal outfit a. For day to day b. Fir date night and c. Fir a fancy event eg. Opera, Award show etc. Xx", "millex_chloe": "Bae like a cat 😍", "alleahmm": "what is the hardest thing for you to do everyday? btw I love you so much Loey!❤️", "katystephens2": "What are you're favorite things about fall? Ily bae😍😍", "savannahsmitchell": "This isnt a question but i just want to say thank you so much for helping me gain confidence and i love you so much😭💕", "sasee11": "Who are some of your all time favorite youtubers? Also, can we be best friends, please?💕 @loeybug", "lindaxaraujo": "whenever you change your hair (cut or color), what do you ask your hairstylist / what style do you usually go for? p.s. I LOVE Y O U 💕", "yurr.natalia": "How are u so inspirational?", "_skyl.ar": "What was your fave subject in school. Love u❤️❤️", "taysadillah": "What hair color are you doing next?", "mandalau91": "@loeybug how to prevent chaffing?? I've tried litterally everything.", "sajdr_niyaa": "Whats your favorite holiday and why?💜", "srb01854": "What's your favorite makeup brand?? P.S. I love you so much. You send off such an amazing vibe and you're such an inspiration. You've taught me to be more confident about how I look and I appreciate it so much. Keep smiling.", "neilahlove": "Love u", "darbygilchrist": "@mandylouise91 try putting deodorant on the spots that usually chaff!! I didn't think it would work so I never tried it and then when I did it worked so freaking good!!!!!", "delcie.sanache": "If you had to live like someone or something else for a day, who or what would you choose? Also you are a huge role model and I love your personality. Thank you so much for making your channel!💕💕", "allison.owen27": "What is your go-to workout routine for every day?", "susie.reimer": "What one thing would you like to be remembered for? Love you!!", "oldaccount_annalirayne": "Whats your best makeup tip!!!??? @loeybug 😍", "_ericademaree_": "What is your favorite show(s) to binge watch on Netflix?", "mallory_a_carter": "How are you so beautiful and how do your makeup 😍😘", "sarah.hammons": "What's your favorite thing to do when traveling? (because sometimes it can be so boring) I love you soooooo much!", "chasityl_": "If you had to choose life without one of your 5 senses which one would you give up? Love you!", "zoibeans": "What's your favorite holiday? And what's your go to cozy activity? Mines Christmas and watching movies...or wrapping presents. I'm convinced I'm an elf lol. Love you so much xoxo💕❤️💕💜💕💜", "vibhaswamy": "How is yo face so slim n beautiful??", "micaylabrook": "Can you please do a tutorial over this look? 😍 also, what are you most excited about for fall?", "jaedaxx": "Did you have any band or any music recommendations that I can try out on? Ps love you so much💕", "candice.meyers": "@loeybug I LOVE the lip color 💜💐What is it?", "briannawigginss": "Favorite song atm, ily💗", "westerhoe": "what cute clothing shops, online or not, do you shop from? 💖", "abigailaguilarr": "What is your favorite quote? Love you lots💖☺️", "haileyy.mccormick": "What's your favorite makeup brand ilysm!!! ❤️", "hana1919": "What's the best and worst thing about YouTube? xoxo love you girl!", "mairi.collins": "What did you write your college essays on (random I know but I'm writing mine at the moment haha)? Love you 😁😁❤", "justajokeniea._": "Will this be last question 😊", "boldly_empowered_life": "What types of strategies do you use to stay grounded? What are your favorite coping skills?", "drewcernava": "What's one place in the world you are DYING to visit? 🙈", "starrynicolee": "What's been your favorite place to travel?? Love you!💕", "heidiwitha_g": "You mentioned you are moving. Are you staying in Texas?", "jamilynn_marie_": "If you could change one thing about yourself or your life what would it be? Ps love you, you are a great role model!", "ashleybongar": "How is being vegan going?"}