{"rebelrican23": "Gorgeous Body, Beautiful Face and pretty feet...Love you", "iamb_ella": "@beautifulleedifferent", "royalbushcraft": "Wonderful", "jhon1977rocco": "Perfecta", "jciarlo68": "just lovely .", "sheiboni": "@kcoopjones oh this is target", "itsbrookesquared": "@loeybug hey girl! Where'd you get that phone case?? 😍", "sardar.ss33": "gorgeous", "cthuyvan1710": "@loeybug can u tell me where did u get the swimsuits? Very beautiful u are", "cara_winter_": "I just saw this video!! Loved it! I had a revelation watching one of your videos today, and now i feel completely fine with how i look, and don't need to have a \"summer/swim\" body..so thank you for that 😁❣", "elenaemmalin": "Do you ever feel like your feet or knees is getting tired by being plus sized ? and my second question how do I accept myself as a plus size when i used to be skinny and i dont feel pretty at all anymore? Hope to get an answer thank you ❤😍 @loeybug", "katiekakes_xo": "We have the same phone case 😍😍", "chrisbeq": "😍😩 @mintztayyy", "ddiinnnaaaa": "I love how much she appreciates her body and her confidence, the world needs to learn from her", "willieortiz1074": "@melodie_28 I need this", "hannahwillow27": "Gorgeous lady 😍", "loeybug\nVerified": "Verified", "batkitty81110": "this isn't for the q&a i just wanted to know lol but how did you like that rusty tie dye looking bikini? its really cute! but i didn't see it in the video so i just wanted to ask ❤", "hello12367888": "Hello, @sparkelofslime is selling slime if you want some please contact me or her thanks! Also give her a follow her dream is to get 100 followers", "melodie_28": "@haileyymae let's go to target and get it", "haileyymae": "@melodie_28 pls :(", "ftpelviss": "God damn 😍😍", "dieter04": "Super hot", "donny_rianggara": "😍😍😍😍😍😍", "chbabar42": "Beautiful boobs", "melodies_from_the_heart": "Any advice to becoming more confident in yourself for a more curvy person.", "khedr1656": "رائعه 🌹🌹🌹", "_rurijabari": "@_mueni", "samantha_cheyenne14": "@lairin_eliza_ @mommy2kbh_kwh", "mrsharris__": "She's freaking gorgeous! ! @samantha_cheyenne14", "brayaunna.klimas": "I love you too bad I'll never meet you.😭💙💙", "amber.rosewall": "Loey😍", "madammexico": "@morgan__stephens__ buying this bikini top", "matttyc12": "This is so hot!!! @paxrice", "htezil_serrot": "Cute!!!😍", "collier.darrell": "Very beautiful !", "tioniescott": "Any advice on handling social anxiety?", "nicolemajkszakk": "Ooh love it it's so pretty", "katkasart": "Thank you for the like loey!! ❤❤❤", "laurenbattagello": "I LOVE THIS SO MUCH AAAA", "jerryvalenzuela3187": "❤❤❤❤❤❤❤❤❤❤❤❤❤", "kenna_jbell": "❤️❤️❤️❤️😍😍😍😘", "_brookebenoit_": "You slayyy", "bash_habit": "@kelsieann25 ❤️❤️👀👀👀", "jennaarobertson": "Any advice to overcome bulling??", "mikaela_hellgren": "OMG SLAY GIRL", "rebeccamasotti": "Love this", "ardeshir.ghiyasvand": "اووووووف", "muah_ria": "Yaaaaas target😍", "taylor.raven_": "I see you wear a lot of really cute bikinis, what's your favorite brand/pattern? Love from North Carolina!!", "jessicaraepearce": "Just a simple how are you question? I love you x", "janice7458": "You look so freaking cute in that swimsuit.", "jami_zmood": "You look amazing Loey ❤️❤️❤️", "ellehinkston": "@rbxdaily that would look good on you!", "taiyumi2016": "Que bellaaaa!!!", "yorkshirelasslaura": "What's the thing you love most about your body xx", "mandalynn1392": "Do you have any bad habits? I absolutely love love love your Chanel!", "land__angels": "what is the most thing i should be confident about ?ps ilysm ur my fave", "tds_aka_mr_worldwide": "@layla7519 😍😍😍😍😍", "sarah__olsen": "How is it possible that you make my day everyday ???", "megannjolenee": "Do you ever imagine yourself having children? Ive watched your pregnancy story, I was just thinking about what an amazing mother you would be. Lots of love from Ohio.", "babycelica": "You're so confident and seem to love your self so much, I struggle to see my self as beautiful because of my body. How do you stay so confident ??", "brennacutiepie": "Omggg that top! 😍😍😍", "veronicafang_": "YAS", "ruthpuentegarza": "😍😍😍😍😍", "joann__1": "😍😍😍", "andrealeyvs": "Ya vez @danialeyva_", "cimanin": "Do you have any good music recommendations for an early teen? Ps I love u💖💖", "caruchibegue14": "😆😆😆what's your favorite type of music?? I love U sosososo much! 💋💋from Argentina", "clingycuddles": "Cat or dog?", "theoneandonly_sav": "Have you ever considered releasing your own line of clothes and/or makeup?", "sethwcurtis": "sooo gorggg", "laurenburgess_": "You're so pretty :)", "joanders02": "You are so beautiful I wish I could be that comfortable with my body ❤", "flea1011": "This is probably to personal of a question and you might not answer it but you talked about growing up in church? Do you still have a relationship with God?", "layla7519": "@tds_aka_mr_worldwide 👅👅👅", "tam08_": "What career were you thinking before you did YouTube?", "_myaclancy_": "I love your makeup will u do a tutorial please pick me 💋💋💋💋💋💋💋💋💋💋💋💋💋💋", "loulou_tibiscuit": "Wow 😍❤️", "isjobel": "ICE CREAM OR CHOCOLATE CAKE, THE ULTIMATE QUESTION?!", "xxemilygriffithsxx": "How do you stay positive? Love you 💗💗", "ophelianorris": "This is gorgeous", "lucyhawkinsx": "What's you're favourite band? Love you 💚", "msuhovich66": "So beautiful", "justnatsclaps": "You look awesome as always babe !", "love_is_love_5": "Favorite bikini??", "bossbaes_": "Beautiful!", "__cultivatekindness__": "Omg that's perfect", "micheladallargine": "Are you planning on coming to Europe this year?💕", "kasey.smith.01": "You slay 😍😍", "v_ivie": "Obsessed w this swimsuit combo omg", "lilac_jesi": "Can't remember if you have answered this in the past but do you believe in the Mandela Effect? If so what are your thoughts on it? Love you and all you content!!😍😍", "isis.atkins": "How did you start waking up and loving yourself? I am in this process now and would love tips. Ily!!", "ewokracja\nVerified": "Verified", "sophiejohnston.x": "I love this bikini !! And it looks sooooo good on you 😍❤", "chloebrewster": "i needdd this", "lucy.murphy.x": "What is your favourite place to go clothes shopping? 💖💖", "trishykittie": "Do you shop and thrift stores? If so, find anything awesome?", "xlejkax": "Oh ma gawd 🙌🙌🙌", "gone_deleted_sorry_": "Do you like singing? Could you sing something, I'm sure your voice is beautiful! You have no idea how much I love you, you've helped me so much and in so many ways, ILYSM ❤❤❤❤❤", "shelbycrossman18": "Where do you get all your body confidence?", "aiden_hatley": "Can you adopt me?😇😂 I love you so much💖", "_franki_mae": "Do you love me? Probably not", "rae.klass": "What is your favourite color to wear", "dummy.honey": "If you couldve started youtube later or earlier in life would you?", "cn.marceline": "Are you ever gonna go on tour?(I'm from PA) -holly", "nhimongchung": "SLAY LOVE THE SWIM SUIT!", "abigail.martian": "How does one get into modeling?", "gayathri.rani": "Ways to boost your self esteem?", "josie_spa": "Hey Loey! What's your number 1 tip for someone wanting to start a YouTube channel? I'm way to self conscious to even start! lol please help ❤😃", "sabrinamdiehl": "You are everything I wish to be 😘😘😘 when people tell me I look like you I grin you so perfect thank you for sharing yourself with the world", "gloomyboyromeo": "You're so pretty 😭😍😍😍", "coraljkim": "Whats your fav swimsuit you own?", "spirit.moon.love": "Love it", "unspokenwords4u06": "Girl you look good.....come check out my YouTube and follow me on here", "thoricrlsn": "What are your favorite self care strategies and activities?", "ashleythepancake": "What is your favorite band??", "wrongsideoffheaven": "@loeybug Your beautifull 😍 I wish I was confident like you! 💪🏼❤️", "booksntrees": "if you could live anywhere (real or fictional), where would you live and why? love you lots loey😘❤️", "hailleeshumway": "Beautiful 💕", "its_me_kellie_g": "If you could travel to anywhere in the world, where would you go? Also I love watching your haul videos. Do you think you'd ever do a modcloth one? I would love to see what you'd choose 😀❣️", "christina_dooley": "@ginadalelio", "chelseamryan": "Are you travelling anywhere this year that you're excited about?? @loeybug", "baylieclevenger": "YES 🙌🏽🔥", "kt_rvs": "Are those bottoms from Target???", "joshuaxcastillo": "👀❤️", "____min99": "Slay 👙", "zeldamerilee": "what are ur fave leggings?? ilysm❤❤❤", "kendall_swanson1": "@loeybug what advice do you have to anyone that struggles with body image? I love your videos and your down to earth confidence! You're an inspiration to women! ❤️ love you!", "danixoka": "You're beautiful but I don't find this swimsuit flattering on you . I do like other swimsuit on you . I think the black one is the best .", "lilytepas": "I LOVE YOU LOEY! AND what do you do on \"bad\" days when you're feeling down about yourself?", "nerdgirlbritt": "You are so stunning I love this", "prissyc88": "You're my look alike @loeybug!!! I've been told by so many people", "carmenreid76": "Do you have any paranormal stories that you haven't told on camera yet? Love you Loey! ❤", "mylife_onblast": "Yes girl slay", "mariel.hernandezz": "@a_campbell_kid yeah I know :) I'm asking If she sees herself continuing to do YouTube in the future", "frankie_cara27": "If you had to choose between never reading the Harry Potter series again or never watching a Disney movie again, which would you choose? Love you lost. You are amazing 💋", "montanajordan98": "What is your least favorite \"plus size girls can't do (blank)\" style tip?", "daintyanddappershop": "@mariel.hernandezz she is a youtuber", "kaylee_marchant": "How old were you when you realized you wanted to start YouTube", "pjandbsandwich": "Beautiful 💕💕", "_queentracy_": "What's your favorite go to makeup product? Love you 😘", "kayleebeauparlant": "You're so beautiful!!!!❤❤", "emilyribovich": "what is your best piece of advice for someone struggling with body confidence issues? btw i love you so much 💕💕", "juanccontrerass": "😍😍😍😍😍😍", "brittanycannon10987": "Favorite blonde hair dye", "sweetlittlegeorgiapeach": "Girl you are rocking this!!! Oh my gosh!! 😻😻😻", "bribouthner": "You look so cute! Now I need to go to target", "_mysticmoonchild_": "Hey Loey I just want to say that I have been watching you since 2014 and I thank you because you have been a live saver for body confidence and just all around positivity for my high school years. 💜😚 My question is how do you deal with all the senior year activities when you don't really have a lot of friends and and most importantly PROM! I really want to go but I know I probably won't have a date and most of my already small group of friends of friends will 😂😂 Any advice or suggestions you have about how to deal with those things I would love to hear them.", "autumnn_leigh": "Goals tbh", "baddie_par": "thanks for inspiring me every day", "kenzie.shortland": "Do you ever get judged by people for being on YouTube? Love you. Xoxo", "rebecca_anne_xo": "What's your favourite makeup item at the moment? P.S I love and respect you so much❤", "gorgeous_927": "How do you stay motivated? P.s. you inspire me so much and have helped me so much. Ily 💓💖", "kellylatterell": "What achievement, be it emotional or otherwise, are you most proud of? 💕", "kaijsa.campbell": "How do you stay motivated and confident in your own skin", "sparklesndlove": "Hey Loey, how do you deal with keeping your body positivity high? Are there any tips or tricks?", "cassandramontreuil": "What is the best compliment you ever received? I love you so much you truly are amazing 💗Btw I am from Québec in Canada and even if i'm not speaking the same language as you , my friends and I still Always watch your videos🙈keep going💪🏻💕", "em_g94": "How do you stay so positive, and not let anyone bring you down? Love you xx❤️❤️", "mady.kadangit": "What's your favorite and least favorite fashion trends ? Much love ❤️😊", "misscheyyoung": "Hi Loey, I was wondering how you got the confidence to start a YouTube channel? I admire you so much, and you have really helped me with my self esteem and confidence :) 💕 love ya!", "ro_whitehead27": "Do you have advice in boosting self-confidence?? Ps I love your videos and what you stand for ❤", "a0ifemariab8": "Do you have any plans to travel to the likes of Europe or Asia? 💕", "espiezepzep": "Would you ever dye your hair back to your natural color? PS love you 💕", "jackgunda": "Beautiful Lady", "theloveofficiant": "Yesssss", "factorelli": "What is your opinion on Lgbt?", "its.tiffany_": "How do you keep your skin without stretch marks?♥️♥️♥️♥️♥️ily💕💕", "amandabphoto": "I just left target haha, missed you!", "bobbie_positivity95": "@loeybug you're such a role model to me and other people. You have made me feel comfy in my own skin and feel beautiful. How do you feel impacting people to feel beautiful and more confident?", "ebonymeredith": "What keeps you motivated?", "shiannmariefitness": "What's your favorite article of clothing at the moment?", "ku_fan_1990": "Any tips for a newbie trying to do eyeliner? @loeybug", "madifusheini": "Happy home nice fresh body looking pretty good morning", "sarlegra": "What advice would you give to aspiring fashion/body positive youtubers/vloggers etc.?", "maiyan.amairani": "What is your favorite Netflix tv show or movie at the moment? ❤️", "a_copperwheat": "What motivates you to try to be healthy? The most fun ways to be active? Love you❤", "iambrisleeth": "I'm a size 24 and have a hard time finding clothes that fit me besides Torrid. Any recommendations?", "booknerdquirks": "What's your favorite memory from February", "_ashleymitch": "🔥🔥🔥", "emmadonmyer": "What advise dk you have about being a freshman? Love you!💓💓", "tridumoulin": "GUUUUUURL🔥🔥🔥🔥", "annaf_019": "This is super cute!", "queen.of.georgia": "The first thing you see to your right is the name of your next band,what is it? Love you so much ❤️💕", "aubzthedobz": "What is one thing that you wish everyone would know about you?", "katherinemmcnutt": "It's really frustrating to see this. My boobs will always be too big to fit into target tops. Even the plus size ones are kinda revealing. The bottoms fit, but the tops don't. I wish target would make things for busty girls too.", "channonrose\nVerified": "Verified", "farahasadx": "Omg gorgeous😩😘", "glopezhenderson": "Gorgeous!", "jackjack_nicole": "Would you like children in the future, and your amazing ♥️♥️♥️", "marly529": "@loeybug Thank you for that confidence you show the world. We need more women to show girls,teens and women that there is #Nowrongwaytobeawoman Every women is beautiful no matter Size and Color @denisebidot", "afo.ley": "Yaaaaaaas queeeen ilysm 😍😍😍", "toodae": "Have you ever been to the Caribbean?", "passionforfashion84": "What's your favorite spring time accessory?", "brookehesser": "What are your best tips for always staying positive?", "keith_reyes2": "Looking great ☺️😍", "spoopy_queen570": "What is your absolute favorite place to eat? 🥘 🍔🍟", "angeless915": "What is something that you've experienced that gave you a lesson? Ps I love you ❤️", "purplestar1767": "You look better than ever! Better than last year.", "m_thomz": "Yessss Loey!!!", "shaunaewallace": "What's your favorite time of the season and why??", "farmantmk435": "Super hot girl", "hapi_mix": "Beautiful as always! I'm always late to the game but what are your feeling in the growing division in the country?", "reganajohnson": "Girly you look so goood! Also what is your favorite quote or piece of advice?? ❤❤", "karyarce12": "Do you ever get scared wearing or trying on a bikini? I'm plus size too and I'm scared but then I see you and brings up my confidence. Love you ❤️", "scarlette.l": "❤❤❤", "mari.cora16": "Do you wish you had done something in high school/when you were younger that you didn't get to do?", "mmmorgan_xoxo": "What's your favorite anime? ❤️🤔", "cheyenne_7777": "Hi Loey, you are so beautiful and I love you so much. I just wanted to know do you and Alex (learning to be fearless) plan on doing anymore videos anytime soon? Both of you are very inspiration", "_gracelawrence_": "Where is one place you have wanted to travel to? I love you and you are super gorgeous and I wish I had your confidence❤", "tiger_florence_": "I think I've fallen in love with my best guy-friend... What do I do?! Love you so much and thanks for always making me happy 😊 😘💜", "kj._.2000": "Looking beautiful as always Loey!!! <3", "jadyn_lockhorn": "What's is your dream vacation ps I love u so much", "juvenileesinnerrr": "God Loey your too georgeous for words!!!!!!", "hey.its.savannah__": "What is your favorite place to buy plus size clothing from? Also have anymore recent paranormal things happened to you? @loeybug", "alexislauterbach14": "How do you deal with being in a military relationship? ❤️", "mermaidgalaxies": "Your favorite music artist(s)? And favorite movie(s) of 2016? 😘💖🎶🎸📀🎬🎥", "jaclynglenn\nVerified": "Verified", "katariinanttila": "How can I learn to do eyeliner?", "thejosiemonster": "Are there any more hair colours you would like to try? 💕💕💕", "okryane": "what's your favorite book? @loeybug ps love youu", "brooklyndianeee": "Your so pretty❤❤", "hevheartstruck": "Can we pls be best friends? And what TØP song would you love to see live?", "arielevesque": "Do you feel better? Because girl, you look Stunning! ❤️❤️❤️❤️", "mariacapellani": "What is your favorite childhood memory? PS I love you dad, adopt me please.", "mazzi_399": "What are your favorite summer foundations", "colorado_mommy": "What is your most favorite and least favorite part of your body at the moment? You are amazing.", "juicygirl811": "Omg body goals!! Utterly adorable 😍😍", "kimchieed": "Do you guys ever wonder how many people have stood on that floor, bare footed? I do. Every. Time.", "leah_hallll": "°o° I know you love Disney so what's your all time favorite ride there? 💕", "desireecilento": "How do I wear clothes like shorts and crop tops if I'm a bit curvier? And how do I feel confident and rock them like u? Ps ily girl ❤️", "cgakman": "How did you train yourself to be comfortable in your own skin? I'm my smallest at 120lbs and I'm still unhappy with my body", "jamiekgile": "No question. Just wanted to say love you 💕", "meganxoxo20": "Killing it boo", "shawnabutnot": "Hot cocoa or chocolate milk? Also, half-priced Valentine's Day sweets or half-priced Easter sweets? Love you, @loeybug!! #askloey", "hannah__e__ts": "Favorite Disney Villain ? 🙂 also love you much❤️", "lolimar_bg": "Hermosa.", "vane.tome.gomez": "Where do you see yourself in 5 years? I love you Loey!!😘💕", "elinegevers": "Slay gurl", "tania_lissetth_11": "waaaooo bb estas hermosa", "itme_ivy": "@juliebonillaa I WANT", "nastasiagrace": "What's your current favorite show to binge watch? Love you beautiful! :)", "katiehalverson_": "If you had one piece of advice for people dealing with confidence issues, what would it be? You are an inspiration to so many and have the ability to help others with your lovely personality. Continue to gift the world with your positive aura! 😊❤️", "heathernmccraw": "How did you find so much confidence? Needing advice!💗u", "sara.bradley19": "What's the best way to start gaining more confidence? Love you Loey and everything you represent! You are so gorgeous! ❤", "allison_draws": "@miranda.1138 that's so cute", "ameena.enabosi": "Stunning x", "munirr_lym": "@helenadv8", "helen_kirsty": "You look fantastic", "helenadv8": "Que pasa @munirr_lym ?", "sabrinashley": "angel 💕☺️", "gabbyrosa_": "when was the last time you cried", "thatgirlvanessa_": "Why are you soooo pretty Lo?! You're confidence is goals! Love you girl! 😍😍", "lyainiss": "Hot..😍😍", "mcummins_22": "Hi ✋💕! Just wanted to know what your suggestions would be for good thriller/horror books? Btw, I think you're awesome. Keep doing you girl 👌.", "kenzie_paeton": "What is your biggest inspiration/motivation to stay happy. Ilysm❤", "jemmabradley4": "How did you become so confident in your own body? X love u btw ❤️", "kayluhmichelle": "@loeybug What is your favorite makeup brand of all-time? Love you, girly!", "sophia.koskinen": "Kind of random, but what's your favorite season and why?", "aidenjmarks": "QUEEN", "audrahailey": "Any book recommendations?", "hollyiman": "Gorgeous Loey!!!", "_carleeronquist": "@tuckerrajala i want this swim suit😭", "mollygaertner": "Look at this cute lady", "aixelzuniga": "would you ever dye your hair brown? ilysm btw! ❤️", "julastic": "Hi, question: what do you do about your thighs rubbing against each other when you're wearing skirts/dresses? Thanks a lot & I love you so much :*", "itssteffi_": "what is your favorite video to film? 😊😎 btw you are awesome. thanks so much 🤗", "upsbatman": "Nice booty in the mirror 🌹🌹😍", "jxckson_cxt": "Hi loey!! I'm from England and I was wondering if you'd ever consider visiting? I know you have lots of fans over here!! Love you ❤️❤️❤️", "abby_eg": "Have you ever dated a girl? What's your favorite clothing brand? And, my favorite question to ask everyone: what's your favorite animal?", "_a.liv_": "GO GIRL 😍😍", "ida.engblom": "Beautiful😍", "r2h.alien.baby": "If you were going to dye all your hair a splat or manic panic hair color pink blue purple yellow green which one would you choose?💖💜💙", "keegan.stewart": "What are your thoughts on the recent vogue magazine cover drama? Ily so much and your videos always get my spirits up <3", "onlyleone": "Are you and Alex learningtobefearless going to collab again anytime soon? I love yall both so much and you're so cute together!! 😊", "raccoonprincss": "I love the top", "_lauraabellan": "@_caarmen23", "kristin_carlson": "Favourite Disney movie? Ily💜", "_anyakatherine": "First of I love you Loey ❤️❤️ but second what's the most recent paranormal thing that's happened to you? PS you look amazing 😍💓😘", "kaelynn.williamss": "Do you want to go on tour?", "wisteriiana": "@sickofwu", "missemily_m": "Are you going to start vlogging more/using your second channel? 😊 Love you, btw 😘❤", "sydneysepulveda": "what is your favorite bikini brand? 💞", "sallukelly": "Such a cute suit on you", "michaela_rowan": "Q: I know that you promote all body types and encourage body positive. But do you ever worry when you see young girls idolizing YOUR body instead of thier OWN??? Saying: 'body goals', that 'your perfect' and they wish 'they could have curves like yours' with cry-y emojis and all... Though these are very kind words on your end of thing, from the commenter's perspective they may be creating a negative mindset! Essentially, misconstruing your intended message of SELF love!", "anastasiakauppinen": "@nmmortensen39", "findingtherealbrittany": "You look beautiful! I wish I had the confidence to rock a suit like this. I seen your photo on a torrid wall at my mall. I almost didn't recognize you. So beautiful!!! @loeybug", "karrueche\nVerified": "Verified", "bettas_and_breyers": "What is your favorite Girls name, and what is your favorite boys name? Like for your kids 😊. Ily💕", "freyaluna": "If you ever have days where you are feeling really down on yourself. How do you get through those feelings?", "mxhd_fiqry": "Fak off", "sickofwu": "Biquíni mesmo. Lengerie já perdi a esperança de achar @suchorror", "paugargom": "Can you say something in spanish? Have you ever been to Mexico or do you plan to come? Lovee youuu ❤️", "rec.helle": "What brand of makeup would be best for beginners? 💞", "sassy.bri": "Loooove it", "arirenee24": "Will you be my bestie? Lol no foreal though. What is your go to music for getting ready or just for a cruise? 🎶❤🎶❤", "tek2178": "🔥👅", "kerrtasha": "So cute", "jaceyy.k": "Looks SO good ❤️😊❤️", "lunaa.lexi": "You look so beautiful girl! 😍💖", "chelsxoxoo_": "what should i have for dinner", "josefinemasquerade": "What's your favorite movie? What's your favorite tv show? And will you ever visit Europe? 😊 Greetings from Finland, love you ❤😊", "mariacalkinss": "Also I'm about to go buy this bathing suit 😘😘😘", "ahenning19": "Omg she slays at life wow @oliviaaholden", "deletesna": "Stunning!!!", "tovablomgren": "HOW ARE YOU SO BEAUTIFUL?!", "helenavusic": "You are so beautiful🌞", "rachaelxelizabethh": "That top is adorable!!!", "venture_now": "Cute", "jenwen08": "My question is can we be best friends? LIKE IN REAL LIFE! ILYSM", "reagan_hight": "Favorite kind of music/artist 🎀", "torinwonderland": "If you wanted to dye your hair, what color or colors would you choose? ❤", "mcmuggens": "WHERE DID YOU GET THIS BIKINI ITS THE CUTEST THING I HAVE E V E R SEEN", "kuchenfeelisa": "My question : how are you doing? How was your day ? 🎀❤🦄 sending hugs & greeting from cologne germany ❤❤❤", "delaney.schmid": "SLAYY", "burreeto_": "Where's your favorite place to travel?", "brynndever": "Will you be doing any meet ups soon? Ilysm queen 💗💗", "astarnes88": "That looks gorgeous on you.😍 I wish I was comfortable with a two pice, not yet but working on it!", "emilymadeline_": "Love you Loey❤", "wow.itskat": "@loeybug first off, I absolutely love you. Second, how do you get the confidence to wear crop tops and other things? I wanna try but I'm scared. 💓💓💓", "emilynessing88": "How tall are you?", "phoebebovee": "If you could have your hair stay one length forever, how long would you want it? 💚💚💚", "sushidell": "sooo cute ! 💞", "alexis.gamble": "if you had to move to another country which country would you move to? ❤️", "littepalestrawberry": "What is your favorite movie?", "lizzlu92": "I literally learned how to do my make up from your videos. Also have found some of my favorite make up brands from you. (If that makes sense, sorry I can't English today lol) can you do another drugstore tutorial please!!! Thank you!!! Also ilysm and I'm from Athens too :) @loeybug", "banesgirlx": "Ugh I need that 😍😍💓💓", "kalenatomlinson": "What are your favourite pjs? I love you and all your videos 💕", "madisonnw_17": "I'm watching this video rn babe ! ❤ @loeybug", "_destical_": "Adorable! ❤😍", "ibeth.alvarracin": "You are so beautiful. I wish I was as confident with my body as you are!! Truly and inspiration to me.", "brandielynn120": "What plus size store would you most recommend for someone in a budget?", "samiosbornn": "Where'd you get that phone case?? It's so cute 😍 @loeybug", "sweeetdreamz_": "How to look positive when you're dying inside?", "sionnachban": "I've always wondered how you cope with chafing in general, especially in warm weather and when wearing dresses without tights. Any advice? @loeybug", "xglori": "WHY ARE YOU SO PERFECT 😫😫💖💖💖", "katiesuddath": "What's your favorite food at the moment?💕", "kaptainkenzie": "What Harry Potter character do you relate to the most?! 💕", "corinicole8": "What made you start YouTube in the first place? I love you tons I've been watching you for years❤❤", "my_life_as_chilly": "What is your favorite highlighter?"}