{"roxiidiiva2": "Love you,your such an inspiration 😉@loeybug", "ariellejean_": "i need this 😍😍", "auntcari": "Sweet!!", "meganpitts2015": "😀😍😍😍", "emma_zvonar": "My dads favorite joke 🙄😫 \"Before I was born God gave me the choice of being the most handsome man alive or having an amazing memory. I choose one, but I can't remember!\"", "lill.jade": "Supercalifragilisticespialidocious!!! 🤔 hope is spelled correctly. 🙂oh and HI 👋", "cbiscuit.xo": "Love ypu", "howell_c": "Not a dad joke but my dad still wears matching and1 jumpsuits, if that does not make you laugh I would be surprised. Obviously ballin is a #1 dad concern", "madyson_zadorozny": "what do you call a body with no nose? nobody nose", "fieldsk21": "!!", "meldoesmakeup": "I'm sooo sad i mossed this 😩 pride month this year was a scary time. I didnt end up going to any events because i can't trust that i will be safe in these situations any more. I would have been stoked to enter this to remedy my fomo 😂", "w.p.c1128": "Pride is so unacceptable burn it down", "brick_huss": "Dad jokes are the best! Well after awesome skin!", "craftybabe5": "A man goes to the doctor complaining that everything hurts. The doctor said, \"Can you touch your arm. Does that hurt?\" The man said, \"Yes, that hurts.\" The doctor asked, \"Can you touch your knee, does that hurt?\" The man replies, \"Ouch, yes that hurts.\" The doctor then asked, \"Touch your chest, does that hurt?\" The man answers \"Yes, that hurts too\" The doctor looks at the man and says, \"I know what's wrong, you have a broken finger.\"", "camocasi14": "❤❤", "abbie_lulu1003": "I ❤ you Loey and you're always giving back somehow, it's so amazing. @loeybug", "mollygaertner": "You can't go wrong with the classic \"I'm hungryyyyy\" \"Hi hungry I'm dad\"", "sm_govea": "❤️ How sweet of you Loeybug 😊! Ok ok.. ! when ever my dad would be poking around at me and I'd say leave me alone, he'd tell me, \"I'm not a bank, I can't make loans \" 😂😂😂", "loa_qween": "😍😍😍😍", "meepmeep18911": "👴 dad joke", "gypsyjewls": "“Me: ‘Dad, make me a sandwich!’ Dad: ‘Poof, You’re a sandwich!’” 😂💕🌈😘", "brobediah": "How do you make holy water? You boil the hell out of it 😂", "flemirebs": "This would be great my skins looking rough", "kaleingit_": "TBH my Dad isn't funny SOOOOOO I have no Inspo. 😂 I love you!! 😘💕❤️", "plussize3dbarbie": "3 men walk into a bar. .. the 4th one ducked ♡♡", "kimmeowz": "Yes!😍", "bristenwins": "😍", "kaylabethguffey": "😍😍😍😍😍", "its._.savi": "Why does a chicken coup usually only have 2 doors? { because if it had 4 it would be a chicken sedan } 🤗🤣😂 ILYSM LOEY!! You inspire me soo much😘🦄💜", "natasham4711": "@loeybug I need some good skin care!", "rosiemr": "Love goodies! !!", "mrsbrandimae": "Yessss! 🤤🙋🏽😍", "tofuia": "💗💗💗", "kaityromine": "❤💛💚💙💜", "rose05117": "🌈🏳️‍🌈", "megan.wtvr": "I ran out of dad jokes at the cookout I went to yesterday.. I'll think of one later. Oops. Let me introduce myself though, I'm dad. Lovely to meet ya. 🤷🏻‍♀️", "emulholland658": "Plz", "alyssalevisee": "Hey Loey! I was wondering if you had any recommendations for blenders? All the ones I see have mixed reviews! 😂", "twilight399": "Hey! I love your page! :)", "jessgrozinger": "love you so much ❤", "katieeh": "😍 omg love Kiehl's", "shesgreatkate": "Yes 😍🖖🏼", "alaunakierra": "@_victoria.lynn omgg I would love to win this💛and you should check out her YouTube because her paranormal story times are so good", "soooozz_": "❤️❤️❤️❤️", "emgougeon": "Ah yus, all of the skin care 😍 love it", "hannahiskindaemo": "A MUSHROOM WALKS INTO A BAR🍄THE BARTENDER SAYS \"WE DON'T SERVE YOUR KIND HERE\" 🍄THE MUSHROOM SAYS \"WHY NOT? I'M A REAL FUN-GI!\"", "tess.emiroglu": "Why was the mermaid wearing sea shells? ••••• She grew out of her B shells 🐚🐚", "cvk_atx": "Kiehls is the best for great summer skin!", "chill.4914": "Hello Loey, you are such an inspiration to women of all ages. I don't have any fun dad jokes, my dad passed away when I was 8. You're awesome!!!! Love ya @", "mupp3tblud": "Loey hook a girl up pleeeeaaaese", "only.sarag": "Hey loey! I'll be honest here, before finding your channel I always had a struggle finding cute clothing to fit my body type. I was always told that sizes came in small medium and large. Seeing the way you carry yourself and how you can feel confident and genuine at the same time inspired me so much to be healthy and accept my body. Ty girl ❤️❤️❤️", "speakwiththeeyes": "If this is what you use then I hope I get picked. I've been working on my skin for quite a while and not much works. You're so damn beautiful Loey! I hope to be as confident as you soon! ❤️", "nfik_": "Girl I need this! 😍", "sequoia3901": "Hi Loey, I just want to say that your channel has helped me on my journey to becoming more comfortable in my skin. Thank you and this is so generous 💙", "bruja99": "Yes!!!! This is awesome!!!", "jkirschman": "Happy 4th of July weekend!", "kidnapproof": "Did you know the first fries weren't cooked in France? They were cooked in Greece...... Har har har... Sorry I'll see myself out 😂😂😂", "jillianfischer": "🖤❤💛💚💙💜", "margpfohl": "so cool that you're partnering with kiehls!! i've been using their products for about a year now and they are INCREDIBLE! my skin kind of freaked out when i got to college and the calendula face wash has calmed everything down! the facial oils are to die for too. so excited for this giveaway!!! why do chicken coops only have two doors? because if they had four, they would be chicken sedans 👀", "marthamaria1218": "You are a smart girl!! Says the band mom! 💕", "alanishale1012": "this is the cutest and I'm so happy kiehls is doing this w you! I love them 💖💘💕💞💓💗💝", "karrieblackshaw": "I have been dying to try some if their products, just haven't had the extra funds lately, also @loeybug you are bomb!", "haleymartinsonn": "❤️🎆💕😈", "kendraweaver_": "M,e please!!", "micheleleeann": "Yeah, my dad is pretty funny", "litaaraa": "love you loey!! you're an inspiration to us all & your self confidence is everything to me 😍😍💗 never stop spreading positivity with others and their body image!!! 😘💘", "emerald_patino": "This is cool! And I don't really have any good dad jokes but somehow all my friends know them lol!", "barbgosnell": "😊😊", "schmopal": "Meeeeeeeeeee", "jenn_d.h": "Hello Loey, love you so much your so inspirational and you've helped me with my confidence so much and I wanna say thank you. I still need some work but hey we all have our good and bad days. I would love to win this, my skin could really use it. Good luck to everyone who enters 😘", "katelyn_taylor_holcombe": "🙌😍", "jadorevalerie": "You're so inspirational 🙌🏾💖", "brezzymae7": "Hey girl hey ❤️🎈💕", "alesharae": "I've never tried this brand but I'd love too 🌈", "xomissadrienne": "I tried to catch rain. I mist. *ba dum tiss*", "hunter_souza": "Why don't we have a straight pride month? I feel left out", "whoa_its_stasia": "Ugh my skin needs something like this", "kendraflin": "!!!!!😻😻😻", "strange_creatures718": "✨💖✨💖", "jojlyn": "Loey 😍", "misstori1995": "🎉🌈", "missoctoberxx": "Awesome ☺", "madison.munro": "Made me sad when it said U.S only 😕", "contreras_arianna": "This is so cute. Love you Loey!!!!!!", "hayramirez945": "You're a huge inspiration and a reason some girls are confident 😊 💗", "natylee1113": "🤗🤗🤗", "oliviadpenrod": "You are my Queen.", "yomy985": "Hey Loey❤❤😍😍😘😘😘💖", "cindycat25": "Love you Loey!!' You're such an inspiration. I love watching your video when feeling down.", "8melissadawn8": "What's the difference between the bird flu and the swine flu? For one you need a TWEETMENT and for the other you need OINKMENT! 🐷🐦 lmao I heard that a couple days ago and cracked up! Of course I'm a nerd so...anyways! Smile you are beautiful!", "alexisnightshade": "Why did the coffee file a police report?☕️☕️☕️☕️☕️☕️☕️☕️☕️☕️it got mugged. 💗😍😻💚you @loeybug . You are an inspiration!", "luv2fly30": "Hi gorgeous!!! 😘", "ralnbowsparkles": "@loeybug two guys walk into a bar. The third one ducks 😂", "jordan.anne_": "Hey there beautiful. 💕", "simplystaciet": "❤️💛💚💙💜", "clearence_clairence": "🌈❤️💛💚💙💜🌈", "julianalindberg": "Knock knock. Who's there? King Tut. King Tut who? King Tut-ty Fried Chicken. 🍗 also I love you and all your videos so much!!! ❤️❤️❤️", "devonritter77": "My favorite dad joke! Knock knock! Whose there? Etch! Etch who? Bless you! Lmao", "emilyhauschild": "^ that isnt a dad joke btw", "hauntedfightclub": "Reversing the car, my dad would always say, \"Ahh, this takes me back.\"", "jocegalaviz": "Thank you for being an advocate for the LGBTQ ✊🏼🏳️‍🌈", "sunshineoil": "What did the grape do when he got stept on? He let out a little wine.", "olivianetter": "Love you!!", "akire614": "🙌🏽", "iamjesskiddin": "Two guys walk into a bar, the third one ducks 😂 love + good vibes ❤🙌🏻💅🏼", "sabrina.flemin": "Love your videos you're such an inspiration and love your style and make-up your storytelling is perfect!! Sorry don't have a dad joke", "magskush": "Hello queen❤❤❤ thank u for helping me be more body positive 😘", "gxselleee__": "🤗💖", "karlee.kazoo": "Every time I tell my dad I'm going to take a shower he says \"bring it back\". He's the dadliest of all the dads", "stephanie_rister": "Nothing better then fresh skin.. 💜💙", "krisnictap": "Hey 🌸", "adilenesantos_": "Love is Love ❤️💛💚💙💜", "aprincessanne": "How many tickles does a octopus need? 🐙 Ten-tacles! 😂", "shylergrace": "You are so beautiful you make the sun snails with your kindness!!", "heyitsjenniferv": "Anytime I'm visiting my parents and decide to tease my dad to take a shower, I'll tell the water is good. His response: what does it taste like? We continue the bit sometimes talking about our favorite flavors for drinks. Mine's watermelon.🍉", "wigglesthebunny": "This is getting intense, dad I don't see anything in tents", "a_fiter": "Love your inspiration 😊", "tarynashleyk": "When I was little and my dad and I would be driving around, whenever a truck full a hay (yes, like the kind for horses) he would scream \"Hey!!\" So loud it would scare the heck outta me. Especially if I was sleeping. When I would irritatingly ask \"what?!\" He would just point to the truck and say \"no really... hay\". Now looking back it's hilarious and I do it all the time with people in the car. 😂❤️", "marisa.liane": "Love you Loey ❤", "babyxherb": "I love you Loey!!", "adali.bby": "I've been wanting to try a khiels face mask!", "ngochale1494": "Kiehl's products are the best ones for skin care ever. I love all and feel good when using them ❤️", "steph_ryals": "Love you!!", "brimixelle": "♥ ♥ ♥", "karohouses1": "Love u loeyyyyy ❤️", "kluhr08": "❣️❣️❣️", "thatzoochick": "\"Beans, beans the magical fruit. The more you eat the more you toot\"", "atcrafty": "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans!", "pwc61608": "Keep up the awesome post and videos", "trisaruhtops": "Hoorayyy!!!", "emilyireland_wx": "“I asked my dad for his best dad joke, and he said, 'You'", "patriciak13": "So much 😍😍😍", "thegirlemilee": "My face could use some help fighting ache", "megavelii": "💋💋💋", "missjamieburr": "Did you hear about the guy whose whole left side was cut off? He's all right now 😊😊", "_nexalyis": "What did one beach say to the other beach? Nothing, they just waved. 😋", "kparkerbeck": "😊🦄🌻", "lyssa_mac_": "Hi Loey! Love your new hair color!!💁🏼", "jennaowenz": "do you have 11 protons? because you're sodium cute!!", "mo11yparton": "\"What rhymes with orange?\" \"No it doesn't\" ❤️", "apwmedia": "😍😍😍😍", "bluebellemoon": "How do you make a Kleenex dance? You put a little boogie in it! 👍👍", "sydneygrace6": "i love u queeereeeennnnnn", "iceypops": "💙💜💙💜", "aabbyshepard": "Hi", "mandi_3612": "What's the difference between in-laws an outlaws? Outlaws are wanted !!!😂😂😂😂", "julez224": "Love everything you do girl! Keep killin it!", "brandibrown_23": "Yes😍", "maddie___lynn": "I wasn't originally going to get a brain transplant, but then I changed my mind.", "brandi_kathleen81": "Queen! 👸👑", "dana_j21": "Mangoes can get sunburn", "tyrone_the_babydaddy": ".", "ashleynichol28": "My dad's best joke was always the one where we would tell him we were hungry and he'd say, \"Hi, I'm James. \" and we would giggle and say back, \"No Dad, we're hungry.\"", "kllo88": "@loeybug so beautiful.", "camillehannesson": "What did the buffalo say to his son when he left for college??? BISON 😂😂😂😂😂", "baileypisoni_": "hi I'm gay and i have a frick ton of pride but this would give me even more!;)", "gemini_princesa_": "love me", "jessnukem": "🙋", "lbpettis": "❤️", "foreveryournelly": "How do you make a Kleenex dance? Put a little boogie in it 😂😂", "amanduhplease24": "hey hey", "astrofrances": "i'm gay and i want good skin", "avek22": "👀", "faceless_y0uth": "Heyyyyyyy", "kdq722": "🐾hi! Hope you had a great day! ✌🏻", "rylea.pierce_77": "What do you call a sneaky criminal going down a flight of stairs? A condescending con descending 😂😂", "ikantspell": "When's the best time to go to the dentist? Tooth-hurty!!(2:30)", "raekingleaves": "How do you scare a bee? Boo-bee! 😆🐝", "debbypenna": "How do you make a boogie dance? Put a little boogie in it. My dad would always say that to get me blow my nose.", "graceadamczak": "Q~ What did the buffalo say to his son when he left for college? A~ Bison (Bye son) P.S. I love you sm and you've given me so much confidence over the years💖💖", "burreeto_": "Ahhhh I love Kiehls yes pleaaaase", "courtinhose": "What's a polar bears favorite part of the cake? ICEing", "hellothere_anna": "The butterstick and toner 😍😍😍💙", "elle.cher": "You are a beautiful inspiration to all females", "macnc40": "Yo girl needs some new skincare lol. I'll be praying to based god fa dis! 😂🙏🏽🙏🏽🙏🏽", "queenn.bri": "I have super sensitive skin and my dermatologist just gave me a prescription cream and after one use it burned my chin 😩😭 would love to try some actual good skin care 🙏🏼🙌🏼", "colleenlmeier": "What do you call a dog with no legs? Mat! 🤣😫🤣😫🤣😫", "dvalencia04": "Hi", "tedster87": "Yaaaas! I've never tried Kiehls! 🌈😍", "clarno1234": "😍😍😍", "somecallme_burns": "🐿", "beccerb41203": "Love itttt!", "truthbyjay": "I wanna win", "shamac13": "Love you, love Kiehls, and love Pride!!! ❤️💛💚💙💜", "car0linac_": "❤️❤️❤️", "taylor.crtr": "A ham sandwich walks into a bar and orders a beer. The bartender says, \"sorry we don't serve food here.\"", "scuevas13": "Love 😍", "sam_piternal": "🤷🏼‍♀️", "erin_wrx": "What can you not eat in the morning? ••• Lunch and Dinner 😅 lol #dadjokes", "meyerdak": "Two goldfish are in a tank. The first one turns to the second one and says, \"Do you know how to drive this thing?\"", "lisamcvann": "How do you make Holy water 💦? You boil the hell 🔥out of it 😂", "lifewith.penny": "What do you get when you mix a lawnmower with a bird? Shredded tweet!!! 🤣😂😂😂 Im sorry, all I know is HIMYM jokes", "ganbatte_na": "Fab. Would love to try their products.", "marniecorn": "How do red heads orgasm? Gingerly 😛 hahahaha-sorry #baddadjokes", "kchar_21": "QUESTION : If a meteorite hits a planet, what do you call one that misses? • • • • • 　ANSWER : a meteoWRONG 　you're welcome 😎😂😅", "mercedy24": "Love this and love you!", "alpharettaful": "“Me: ‘Hey, I was thinking…\" My dad: \"I thought I smelled something burning.’”", "carereonahh": "🌈🌈🌈", "emilytashjian": "Love!!!", "apeslee": "🦈🦈🦈", "krystals_castle": "Love you, Loey", "lizzieklou": "Happy Pride! 🌈 and thank you for this giveaway!", "kath_see": "This would be awesome!", "koping89": "Kiehls heals ❤️🦄", "kfeuz": "Love this giveaway...", "h2oquinn": "Boop! 😻", "rosieleon16": "Love you Loey Buuuuggg 😘❣️", "ms.jerrbear": "🌈🌈🌈 pride year 'round!", "maddisonalaine": "I've been looking for new skincare ✨", "kiirstie00": "What did the green grape say to the purple grape? BREATHE!!! 😁😁😁😁", "aud.rey21": "Loooooove it 💗💗", "meljahs": "Love you Loey! 🦄", "chasidyxo": "Love you! 💕", "hotkatertot": "Aliens are real", "angelwarner28": "Loey, I found you a few years ago and since watching your videos, I have learned to love myself more. Thanks for providing your confidence and reminding all of us that we can be confident too.", "gabbydhy": "😍😍😍😍", "live_dyannamically": "I love their products!!!! #kiehls", "ordinary_tayy": "Loey I love you!", "_chelseanichole": "My dad passed away in January so dad jokes are my FAVORITE memory to help me through the grief. My dads favorite joke was \"What color is a submarine, true or false?\" #doesntmakesense #dadjokes", "robingrae": "I've dying to try Kiels!!!", "jivercs": "Ooooo yes!", "kkopetski": "Yes!! Love you xo 💕", "beachesss": "My skin neeeeeds this!", "sierralynnx97": "So I saw a sign that Nickelback was performing in my town and I told my friend I hoped that they were performing with 50 cent so the concert only cost us 45 cents to go (this actually happened and she questioned who she was friends with😂😂)", "allie._.pettit": "Hiiii", "svrvvvvh": "Thanks for loving yourself and inspiring me to do so as well! #girlpower ✨💪🏻💘 @loeybug", "alee.ban": "Hi Loey ❤", "as_told_by_tori": "I don't really know many dad jokes. But I enjoy all you do!! So there's that. Haha! ☺️☺️☺️", "sam.mitchell17": "Love you Loey 😀😀😀😀", "aaamandamariee": "Hi Loey!!! 👋🏻👋🏻", "tennis78745": "Loey does your milkshake bring all the boys to the yard lol", "bestiheatherhad": "What time did the man go to the dentist? Tooth hurt-y", "nesocialines": "Damn it I live in New Zealand", "erinalyssa924": "this is sick!!!", "blackshaw17": "I ❤️ Mac and cheese", "lauredove": "You're so sweet to your followers, Loey! 💕", "beachychic6": "I'd Kiehl for this win😆", "hautecouturemaxwell": "\"How do you get Holy water? You boil he hell out of it!\" 😂😂😂", "the.samwarrior": "Omg would love to try this!!!", "kayx24x": "CASHIER: “Would you like the milk in a bag, sir?” DAD: “No, just leave it in the carton!’ lol. hope you have a wonderful day, beautiful. 💕", "running.withthe.wolves": "THats so cool!! Love you so much @loeybug ❤❤❤", "ohaybeckay": "Kid; hey dad can you make me a sandwich? Dad; *poof* you're a sandwich. 😂😂😂", "lizzbeth1135": "-I'm in desperate need of skincare products!! -Hi \"in desperate need of skincare products,\" I'm Dad!", "dani_jeann": "Okay sorry that was really bad but ilysm!!", "kvsxy": "My dad would tell me that \"if I won something like this, it'd sure kiehl me!\" ❤️", "lilytepas": "Oh hey there", "meadovvs": "Love your videos!", "undercover.fairy": "Why did the tomato blush? Because he saw the ranch dressing!!", "bacon.notcake": "You have been an inspiration to me for about a year.", "wham_bam_glam_official": "I don't have any dad jokes!! My dad is such a bad joke teller!! Lmao @loeybug", "barbs.cl": "would love to win this ❤️❤️", "mahaylah_e": "What do you call Al Capone and a vampire? A fangster! I'd like a product to combat my scarring and I'd love to have a brighter complexion 😊", "yukinadreams": "Can't think of a dad joke, but I've been following you since 4", "rayven.nicole": "This isnt a dad joke but... Are those space pants? Because your booty is out of this world!! @loeybug 💗💗 love you and the positivity you spread! 😊", "ja.y.da_": "Meep 😁", "texasregina": "Why didn't the skeleton ask the pretty girl to the dance??? He didn't have the guts!!!! 😂😁😄", "_mare.bearrr_": "Love you, girl!! 😘😘", "oceana.maria": "How does the moon cut his hair? Eclipse it 🌙 💇🏻😝", "blessedtoheaven": "No jokes, I just love you and your channel!!!! 😘", "baileyinva": "Why do chicken coops only have two doors? Because if they had four they would be chicken sedans!!! Haha!!!", "sharonroseione": "What is Forrest Gumps password??.... 1forrest1 🤔😂", "haleydamico": "too poor to afford this ¯\\_(ツ)_/¯", "little_miss_sunshine0310": "I'm lame and have no jokes. Hope you're having a fabulous day 💕", "megan_thee_palomino": "@loeybug One day a guy walks into a bar where it's just him and the bartender, who is a few feet away. He hears someone whisper, \"nice hair,\" but when he looks around there's nobody nearby. He then hears, \"nice shirt!\" So he finally asks the bartender where he whispers are coming from, and the bartender looks down at a bowl in front of the man and says, \"Oh, it must be the complimentary nuts!\"", "_maddyfay": "I just got my period. It's really cramping my style (that was a stretch)", "realityz_escape": "Why didn't the toilet paper cross the road??? it got stuck in a Crack 😏 **badum tish** or should I say badum tush 😉😂", "freetobefrankie": "So I've been dropping $60 on proactiv and it DOESNT even work. If I could try this out and my acne would lessen that'd be boooomb", "downtheroadvintage": "Why couldn't Batman go fishing? 🤷‍♀️🤷‍♀️ Because Robin ate all of his worms 🤣🤣. It's the only joke I can ever remember!", "nerdykell": "So one time my dad couldnt think of the word ginger so he called my friends baby a raspberry 😂 #truestory", "ayeprul": "What happened to the Italian chef when he died? He pastaway. 😭", "eriaa_xo": "What type of computer sings?? A Dell😂", "lexi_mcneals": "A grasshopper walks into a bar, the bartender goes I have a drink named after you, the grasshopper asks you have a drink named bill? This is my best friends favorite joke all you have to say is the punch line and she dies of laughter", "kaitlyn_douglas17": "My jokes are worse than dad jokes 😂", "lipglossismyvice": "🙂💄❤️", "___sophiea": "\"What time did the man go to the dentist? Tooth hurt-y\" this is so dumb but so funny 😂😂😂", "sbear679": "Would LOVE LOVE LOVE an @kiehls box, 3 months postpartum here!", "greeneyedjennymac": "Why did the Clydesdale give the pony a glass of water? He was a little horse!", "kasasm8": "I love your videos, Loey!!", "victocat": "What do you call and alligator wearing a vest?? An investigator!!! 🐊", "alexandra_fuller": "😛😛❤️❤️", "alainarejer": "I wish I had jokes! 🙋🏻", "halfassedcactus": "What's Forest Gump's password? 1forest1", "sarah.gornto": "Whats the opposite of irony? Wrinkly!😂😂😂", "rachel_reames": "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans!", "mikaylagrc": "💜", "leeann_2019": "Pick me 😍☺️💁🏽", "unicourtney_in_manhappy": "I like to consider myself a bit of a unicorn, but this summer has my skin feeling swamp monster chic. I need some help!", "apricotssuck": "How do you make a tissue dance? You put a little boogie in it 😂 it's so stupid but I love it so so much", "emotionlordx": "how do you make a kleenex dance? put a little boogie in it 😂😂😂😂😂😂", "camilafl0res": "💓💓💓", "colleenagarcia": "What do you call a bear with no teeth?? 🐻🐻 Gummy bear! 🤣😂😁", "sadie_odell": "Gandhi, as one may be aware, walked barefoot most of the time, which produced an impressive set of calluses on his feet. He also ate very little, which made him rather frail, and, with his odd diet, he suffered from bad breath, this made him: A super callused fragile mystic hexed by halitosis.", "xicanax": "💛💫💛💛💫", "cadyefitz": "Me: \"Dad, could you make me a sandwich?\" Dad: \"Abrakazam! Now, you're a sandwich.\" 🤣😂", "wolfden71": "I WOULD LOVE THIS!!!", "kai_tie_": "I asked my dad for his best dad joke and he said, ‘You.’ 😂😂 @loeybug what an awesome giveaway! I hope I win ❤️", "cayla.henry": "where do the stars go when they're hot? they visit their fans", "celestie0": "A mushroom walks in a bar & sits down to order a drink. The bartender says \"we can't serve you, so we're gonna have to ask you to leave\" & the mushroom says \"but why? I'm a fungi!\" 😭😂 oh dad....", "cheyysierra": "I had a dentist appointment once. It was at tooth thirty!😂😂", "steviehearttt": "i have no dad jokes cos sadly i don't really have one but i love you so much 💖", "aratnc": "What do you call a man with no nose and no body?....... nobody nose 😂😂🙄🙄", "megg7997": "🌺 I've got pride, yes I do, I've got pride, how bout you?! Go Kiehls!! 😍👏✌️💋", "samantha_dauer": "Two guys walk into a bar, the third one ducks. Thank you, thank you🤡😂", "timariebergman": "Colin Firth has a younger brother named Colin Thecond", "makena.claire": "I love you and your body positivity ❤️❤️", "vanessaelle": "💖", "juneemm": "How do snowmen get around? By-icicle!! 😋", "uh.oh.s": "Btw i love you ❤️", "mariahsophiar": "How do you make a Kleenex dance? You put a little boogie in it! Lol! Pick me, please!", "nastilyyy": "What did the buffalo say when his son left? Bison!! 🙈😂", "sharkbaitbree": "Happy pride month loey! no one should feel ashamed of themselves 🖤💙🖤❤️", "laceyyjustine": "Why do chicken coops only have 2 doors?? Because if they had 4 doors it would be a chicken sedan. 😂😂😂😂", "kyrabrady": "what did the 0 say to the 8? nice belt!! 😂", "bgutierrez__": "Thank you so much Loey!! 🎉", "dunnwithyou01": "@loeybug I love your videos you're one of the most confident and fearless people I have ever come to know. Your videos intrigue me and make me feel like I'm not alone. Thank you for being who you are and thank you for being so open to us (your subscribers).", "tender_roni84": "🌈 taste the rainbow", "k4terpillark": "Not a dad joke but a pretty funny pick up line. Are you a Jedi master? Because yodalicious!! 😂😂😂", "rahnayxox": "My recliner and I go wayyyyy back! 😏", "claurosario": "Thanks for doing this Loey!", "simplycelene": "I love you 😘", "jeannelle_williams": "#bodypositive", "emycochrane": "what do mountains hear with? mountaineers!", "brookefish24": "You're amazing loey! An absolute inspiration", "leaomgee": "How much does a pirate charge you to get your ears pierced? A Buccaneer Arrrrr!", "desinicolew": "@loeybug Please pick me! My house was recently broken into and they stole everything I had. Im still trying to recover from it :(", "ammaw13": "I want to win this so badly!!", "pokraken": "A guy was drinking Coke when it started fizzing out of his mouth. When I told him he was drooling he said, \"I Mento\". Love you @loeybug !!!", "hapi_mix": "Have I told you lately that I love you ❤️", "the_oddott": "Great giveaway", "ashyy.nicole": "Ahh nice skin is so niceee", "emily_rickens": "@amandarickens thanks for being my person", "thekellymorse": "🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈🌈", "0mariahpapaya0": "Been wanting to try khiels for a while!", "daniknoetgen": "💕💕", "catalinaloca": "Hi Loey! Kiehls products are amazing!!", "aiwonderland": "Two guys walk into a bar, the third one ducks", "stefaniekayrz": "Uhhh yes palease! Love when people give back 💞", "taylor.bryant22": "❤️", "lyssabug23": "Love you :)!!! Thank you!", "shychallinor": "How do you make holy water? You boil the hell out of it.", "_notmarlise_": "Hey Loey!! I love your videos so much! Your beautiful and so confident and that fills me with so much joy! Your Videos gave me confidence that i never felt i really had to be honest. They make my day and i always get Hyped when i see a new video! Love ya Loey!", "bizzy_bee1989": "This is so awesome", "constance1390": "Need need need !!! 👌🏼😲", "amandarickens": "@emily_rickens", "tawnytherockjohnson": "Me: where are we going my dad: we're going crazy!!!!", "brittanycunnien": "love love love @kiehls 💕", "nikkibarber": "Love kiehls!", "cassandraginnette": "These look amazing 🤗💓", "brittb0104": "Love all these products!", "daniellerodriguez86": "@loeybug love you!! Love @kiehls !!!!!😍😍😍😍", "prosemaryd": "Hey Loey! I discovered you about a year ago searching body inspiration and you have changed my life! Everything you represent speaks to me! Keep it up girl!!!", "sabbyluna96": "What did the dogs say to each other after a long run? That was RUFF 😂😂 (and that was horrible)", "deanna.isham": "I'm gonna kiehl over if I win this😍😍 get it?😆", "arlyandjay": "Go pride!", "itsaradworld": "How do you make a Kleenex dance? Put a little boogie in it! Love you dad !! ❤️💛💚💙💜", "leorajaye": "Love kiehls!! Best moisturizer 😍", "daniielisabeth": "My favorite is- \"I have to go change and than we go!\" \"Don't change I like you the way you are.\"", "jacqueline_ohh": "What's Forrest Gump's password? 1forrest1 😂😁", "abigail.funk": "happy pride everyone!!!🌈🌈🏳️‍🌈🏳️‍🌈💛💛 #lovewins", "thelandofmilkandfunny": "What do you call a pile of cats?....a meowtain 🤣", "amanda_mtaylor": "hey I love u", "vsgtxmama": "I need some Kiehls in my life!!", "kbazi01": "Love you Loey ✌️❤️", "mom.on.a.mission3": "Would love to try a new skincare line.... After 3 kids..I need all the help I can get ;)", "dresden.stucky": "Oooo girl you know I need this with how bad my skin has been! Love you❤", "jmtdicer": "I would love to try Kiehls, have never tried it.", "nellabella444": "My dad would always say this to me. I'd go up to him and say \"I'm hungry\" then he'd respond with \"hi Hungry, I'm Randy\" 😛", "heyjudette": "Aw love this giveaway! Thanks for giving us all the chance to win 😊", "sarahrenninger_": "Ohhh my faves!!!", "alyssa_kaitlyn98": "@courtney_theresa", "kateandtate": "Why did Darth Vader cross the road. To get to the dark side.", "am._bear": "What did the buffalo say to his son when he left for college??? BiSON", "melba3605": "Did you hear there's a sale on row boats? I guess it's a big ore deal! 😂", "mariahwolverton": "💖💙💖💖💖", "klcow.art": "I want to quit my job and clean mirrors for a living. It's just something I can see myself doing.", "hannahbr24": "I really need good skin products! Also your youtube videos are AMAZING i love you so much!!❤❤", "tjm.hart": "A French fry walks into a bar and orders a beer. The bartender replies \"Sorry we don't serve food here\"", "caitlin_nw": "Did you hear about the kidnapping? He woke up.", "abbyhighh": "Jack: Hi Dad, how are you? Dad: Hi Jack! Dad: I PROBABLY SHOULDN'T SAY THAT ON A PLANE😂", "hollandeggert": "Two peanuts were walking down the street. One was a salted. 😂🎉", "ginnawinnaxo": "How do you make a Kleenex dance???? You put a little boogie in it!!", "avocado_darling_13": "How do you make an orange laugh, you tickle it's naval! :D", "nursekiki_jubilee": "Hi", "lauren.rene": "Love you Loey!! ❤️❤️❤️❤️", "esthe_krys15": "Love love love you Loeyyyyyy 💖💖", "bails0912": "Love you loey! ❤️", "dann.13": "This is the best thing ever!", "colediazzz": "*walks past the dog food aisle in the store* Dad: do you want me to get you something to snack on? Me: 😢😢😢 lol he's cool", "rebekahrahmatullah": "I love you Loey & and I would love to try Kiehls! 💞", "chanarana37": "Why do elephants wear tennies? Because nineies are too small.", "archerygirl33": "Saweet!", "leahkristene": "Love love love 💋💜🦄", "niccybeth": "❤️ you Loey!", "alexiswillettt": "I love you 💕💕💕 and so does @_abigail.willett_", "synthpopper1": "Sweet!! 🍭", "marissas96": "❤❤Hey Loey! I love your vids, especially the spooky ones 👻👻❤❤", "mskeyna1": "Is kiehls okay for sensitive skin? 🤔", "ge.anna.lee": "Love you loey!", "laurab_stacy": "Love you 😊", "jenniblank1": "*Whenever a song comes on the radio and I start singing* Dad: \"Jen, who sings this? Me: \"Ed Sheeran Dad\" Dad: \"Why don't you let him sing it then!\" He then busts out laughing like he's just the most clever thing anyone has ever said ever", "lovethereseb": "You're my favorite 💜", "t.moneyyy12": "Kiehls is my favorite ❤", "mairintheaquarian": "it'd take me forever to kiehl-lect myself if i won 🤓😅💕💖💕", "emmatsalageek": "what time did the dad go to the dentist ? tooth-hurt-y. *shoots self into the sun*", "quartenie": "wow this is so cool 🙏🏻", "semiiisweet": "How do you make a Kleenex dance? You put a little boogie in it! #overuseddadjokes. I would love to give Kiehl's a try! 🙏✨💖", "soashley11223": "I love you so much!!!", "cydsquid_123": "Love them and you Loey!", "keepcalmitsem": "Two guys walk into a bar, the third one ducks!!", "edgar_alliepoe": "I'd kiehl over if I won this give away 😍", "leslievilla101": "Love you and inspire me to be more accepting of my body every day.", "emma.barry9": "@loeybug I've always wanted to try some of the products that you love and I hope I win this", "kaiapapaia": "@loeybug your beautiful 🌺", "lucky_lindsayy": "Oh my Lordy 😍😍😍", "reynagam": "Its kiehling me that I can't thinking of anything that's not funny or cheesy 😭😩💙💗", "hiiiii_roro": "me: im hungry dad: hi hungry, im dad! (legit my dad's fave thing to say and im so Done every single time lmao)", "allimae1313": "I love Kiehl's! Midnight Recovery Eye is my best friend!", "alex.andraxo": "Love you loey!!! 💛", "nys_voc": "If your American in the living room what are you inthe bathroom?? European!!! ( your a pea in )", "yoguardian_ang": "Me: *texts my dad to see if he has any cool jokes on hand*", "mariahrain_": "My fiancé does dad jokes all the time, but he does them bcuz he actually thinks he's funny... and we don't have kids xD", "mindless.dreamer_": "Hey girl! Love you lots! 💕", "shann_leighhh": "Yay! 😍", "nicoleleibowitz": "You and @kiehls are so incredibly sweet to give away such amazing products! Good luck to everyone 💕", "cr_everman": "Love you and really loving the darker hair. Think it looks stunning on you 😘", "jennifurduque": "Sweet !", "yessenia071793": "I love your videos! ❤️❤️❤️", "morganhurst__": "❤️❤️❤️", "brevee24": "I've always wanted to try some of those products! I love Kiehls!", "isab3lcruz": "@maggiemags_ we need good skin lol", "kaylapezz89": "Omg kiehls is life! 😍😍", "tatumallbaugh": "☺️", "christina__c32": "How do you make holy water? You boil the hell out of it.", "__karls___": "Yeees @ughkelliez", "mckenzieeesmith": "I've been using Kiehl's since 9th grade. Their products are so amazing 😍😍", "baemie_slunt": "@stanleymobile I want this", "olive_oyl013": "Where do bees get milk? Boobies (boo-bees) bahdum-tssk!", "maddiewierda": "Hi I'm giving away, I'm dad", "courtneyallison24": "😍🤞😍", "juggamanforlife": "Thanks! ❤️", "shelbbxx0": "I love you so much loey!!!!!!", "ellagilliam": "love your videos❤️", "chillmija": "✨✨✨", "caitlynnn.x": "Love youuu 💓", "_jaaaylene": "Love you", "jessicaa.bost": "Two peanuts were walking down the street. One was a salted", "_c.r.y.stal": "Love you!💙💚💛💜💖", "amandaaaru": "I loovvee Kiehls products!", "rae_silvestri": "YES QUEEN", "eilatann617": "Would love to try Kiehls products!!", "sknox55": "Love!!", "sarahfay": "I want to try their products so bad!😄", "getitchrissy": "I've been looking into getting serious about my skincare and this would really help!", "maeewat": "Love you!❤❤❤❤❤", "kellbell1967": "🙌🙌🙌", "meeeeeesh220": "No dad jokes just walked in on my dad using a household cleaner like they do in the infomercials and he just keeps excitedly stating \"it's freaking fantastic!\" 😂😂", "lynds_nicoleee": "Love this!!!😍", "blairnrichmond": "What's the leading cause of dry skin? Towels. 😂", "jackie.schu": "Would love to win!", "theajulian7": "What did the zero say to the right? Nice belt.", "charlielaree": "please im very queer and need good skincare", "karibythebay": "Love Kiehl's products! 🙋🏻", "kodilinn": "😍😍😍😍😍", "sarah.brutcher": "Kiehl's saved my skin!!", "kimmeechanga": "What's brown and sticky??? .........a STICK!!", "alexrriveraa": "what happen to the frogs car? it got toad away!", "daffydoodle": "You know... Loey rhymes with glowy and damn girl if your skin ain't so;)", "mrs.hannahmunford": "Yes please", "caspergirl2109": "Me: \"Hey Dad!! HEY DAD!!\" Dad: \"Hay is for horses\" 🐴🌾", "summer_arianna": "💗💗💗", "jessicainga_": "Wow, I've always wanted to try awoke of these products!", "anna_stewart": "Loey, thank you for being such a positive inspiration to all, but for also being such a role model for all of us plus-sized ladies. You're gorgeous!", "jh1tch": "How do you make a tissue dance? Put a little boogie in it! My bday is 7/2 would be a great gift! Thanks💜", "lexicetwinski": "👍🏼👍🏼", "kristalamiller": "I'd love to try these products! Looking for a new skincare regimen.", "josalyn94": "💖💛💚💙💜❤", "amandyharrington": "What type of tree 🌲 can you fit in your hand 🤚🏽 ? A palm tree 🌴 😂😂😂", "texasbridgett_getsfit": "How do you make a tissue dance?........ put a little boogie in it! 😂😂😂😂😂", "itsamelexi": "What did the grape 🍇 do when he got stepped on? He let out a little wine!! 🍷", "jbuggy2003": "Lovely giveaway!", "rachel.evalyn": "Here's a classic dad joke: \"I'm hungry\" \"hi hungry, I'm dad\"", "dcmarie569": "Yay! Happy Pride!! 💙💚💛💜", "allysonokay": "My grandpas every joke every morning is, \"it's a great day for the race\" \"what race?\" \"The human race\" !", "__danifelten": "@laurenncheff", "catoftexas": "😍😍😍😍😍", "n.samineh": "Favorite dad joke: Natalie do you kno why you cant be near a metal detector ,cuz it will go off. (I like metal)", "emily_4504": "❤️❤️❤️❤️❤️", "chantell_ann_": "I would DIE if I won 😍 \"dad joke\"= what sort of animal is a slug? A snail with a housing problem! 😂🤓😉", "hannahkaytlin": "hi hungry, i'm dad!!! haha. would love to win this :) out and proud for 2 years now", "christine6teeen": "I love the midnight recovery oil! Please pick me!", "cocobeauti88": "Oh I would love to win this, I've always wanted to try their products.", "haleymgraham": "Why didn't the toilet paper cross the road? Bc it was stuck in a crack 🤓", "kristi.anneee": "I love you loey you da best👍❤️", "keannamariet": "I love you Loey!💗💗💗", "tucson_cat": "I'm just having a really bad week but I hope your week has been great! Thanks for spreading so much love 💕", "wutserrname": "Kiehls is so nice but too spendy for me 😭", "laurelh0023": "Kiehl's is my favorite. Favorite dad joke 🙎🏼‍♂️\"What did the buffalo say to his kid after dropping him off at school?\"....... \"Bison\" #happykiehlspride 🌈", "currycustard": "I am a fuax pa", "nicole_marie347": "Girl you're beautiful ❤️", "jenniferlynnclose": "\"Here's my hunch: nobody's secure, and nobody feels like she completely belongs. Those insecurities are just job hazards of being human. But some people dance anyway, and those people have more fun\"...thank you for dancing anyway! Xo", "meccasalaam": "Why didn't the skeleton climb the mountain?.... CUZ IT DIDNT HAVE THE GUTS😂😂", "tryin2btru4life5": "My mouth just fell open. I never win anything but anything is worth a shot 😊", "julieinthehill": "I've never tried anything by Kiehls so I would be excited to try any of the products. ☺", "jodyrose": "All I do is WIN WIN WIN no matter WHAT!! ❤️❤️❤️😊😊😊 dad joke: chicken coops have two doors, otherwise it'd be called a chicken sedan. 😂😋", "jasminemuah_": "My baby is two months old now and pregnancy really messed with my skin! I need to get it back on track ! 👶🏻 Love you loeyyyyy💕", "megnperr": "This is so awesome! I've never won anything before but I always enter :) someone's gotta win right? 👍🏼", "leslie.blvd": "ya girl needs some of this wonderful skincare 💐💗💐", "cassie.labay": "This is so awesome i would love to win. 💙💚💛", "mattie_mae": "You've given me self confidence and helped me understand that I don't have to look a certain way to be pretty but that I'm beautiful just the way I am. Thank you for being my role model 💕💕💕", "lexxxiiiiisss": "TBH it would be amazing to win this so I'm commenting💕", "kailadarling": "Love you Loey!!!", "julieboooolie": "Whenever the clerk at the grocery store asks my dad if he'd like a bag for his milk he just says \"no leave it in the carton\" 😂", "suzym2a9": "❤❤ what gets wetter as it dries? A towel😎", "jaime__garner": "Oooo nice, cause who doesn't love Kiehl's?", "brebrantingham": "Ayyee", "mckenna_ann28": "😍😍😍", "poshsalonaustin": "Why did the cookie go to the doctor? Because he felt crumby! 😂😂😂 I crack myself up! Also- #KIEHLS is my jam! 💋💋💋", "hay_all29": "Hi!!!", "embeck.27": "What do you call a lazy baby kangaroo? A pouch potato... Literally my dads favorite joke. And mine. 😂😂😂", "cheryllindberg": "❤️💕", "sarahroshh": "\"Did you hear about the movie Constipation?\" \"No...\" \"That's because it never came out!\" 😂", "crisp143": "😍😭😍", "t_leann81": "I would love to win!", "jcarlson003": "Loey you are my queen 👸❤️", "faviola_lovatic": "Girl I need me a clean face. 😊👍", "nmoetoe": "What do you call a nun sitting on a jesters knee? Virgin on the ridiculous ;D", "catchmeifyoushan": "\"Did you get a haircut?\" \"No, I got all of them cut!\" 💕", "abbyclark33": "Me: Dad where are you going? Dad: Crazy, and your driving. Me: 😒😒😒 You didn't even answer my question", "madbryant1": "what time did the man go to the dentist? tooth hurt-y 😂", "jenny_brooke94": "Would love to win. :)", "wherever_diana_roams": "I only make dentist appointments at one time. Tooth hurty.", "savannahbrooks01": "💙💙", "floraaaline": "Ur story times are 🔥🔥🔥", "lilyyyg": "I don't have any dad jokes but my dad loves to sarcastically say \"duhhhh\" and do this wrist thing 💁🏻 😂😂😂", "thedocumenterdocuments": "No jokes today, but you are the cutest:)", "alicia_1124": "When I was younger when I was hungry I would tell my dad, \"dad I'm hungry\" he replies \"hi hungry nice to meet you I'm dad\".", "itskaylamckinney": "Love you so much Loey!! My skin definitely needs some help! 😘 please and thank you love 💕", "mcminty": "Why did the mushroom go to the party? Because he was a fungi", "veggie.jennyrose": "I can't tell any dad jokes because ours are top secret........jk I just have fish memory", "greta_paris": "Whenever I would say \"heyyyy\" to my dad he would just reply with \"hay is for horses\" 😂 love you loey❤️", "kaptainpenguina": "Love this! Thanks #khiels @loeybug 😘", "brittbrat878": "💘💘💘💘💘💘", "meg_martin": "Neat!", "alissaboucher": "Ayyyee love youuuu !!", "swtluna": "Hugs and blessings everyone. Good luck everyone 😍😍", "andiebonkowske": "Hi!", "yesimrojas": "Loey you are my inspiration to be more confident to wear what ever I want!! Your confidence is everything! 😘😙", "lacidresel": "Why did the Clydesdale give the pony a glass of water?! Because he was a little horse", "jenniferann772": "a ham sandwich walks into a bar and orders a beer. the bartender says we don't serve food here.", "missari25": "I freakin love Kiehls! Lol ❤️❤️❤️", "anntacular": "Why did the man crash how car? He wanted to see how his Mercedes BENDz LOL", "aelincat_23": "What red and smells like blue paint?.................................................... Red paint", "mariasherlyncano": "🏳️‍🌈❤️💛💚💙💜", "lindseyannblake": "👻", "carolinebaxley": "i love your positivity, Loey! ❤❤❤", "as_told_by_freebird": "My bf makes enough dad jokes to make anyone happy haha", "alexxlovessaxes": "@nikkiknox A ham sandwich walks into a bar and orders a beer. Bartender says, 'Sorry we don't serve food here.'", "avaa.davis": "how do you make holy water? you boil the hell out of it.", "thisisandieland": "2 guys walk into a bar. The third one ducks. LOL Sorry this joke is so terrible but I had to.", "amara711": "Omg I need this", "hello_ejo": "What happened to the cat who swallowed a ball of yarn? She had mittens!!", "sav.annah.noelle": "❣️❣️❣️❣️❣️❣️❣️", "redismyfavtho": "Hello from KC", "slayyyva": "Two peanuts were walking down the street. One was a salted.", "_rinieeee": "💙💙💙", "elpollock16": "My dad doesn't do jokes...and I'm definitely not funny so I don't have any either!", "thehoustonmarina": "I LOVE YOUR FASHION! I inspire to be as confident and as well dressed as you! Wo!"}