{"stephaniebrackney": "You are killing it. 🔥", "denicegomez84": "I just love your confidence. I wish I was as confident as you are. Your post always make my day a bit brighter. Thank you for being your 100% yourself. @loeybug", "bluehillmunk": "This is SO beautiful and powerful 💜", "brand_kiilani": "So beautiful!!!!💕💕💕💕💕💕", "i_am_a_anime_nerd": "You are so buetiful do your thing girl", "bunnycouture": "Can I bring it????😍", "elitadaniels": "Where were you when I was a young girl struggling with my body image?! So glad young ladies have you to inspire them now 💕", "charliewhyte_": "@fredtomegovaert", "thepizzakween": "Omg I love that bathing suit so much", "what.ama.does": "I really wish @citychiconline would bring that colourway back in their swim suits it’s really lovely", "melny2173": "I love this look. Omg that bathing suit is killer", "introverted_fantasy_artist": "Beautiful!!! You make me so proud to be a full figured woman Loey❤️❤️❤️", "givememypizzacrust": "oh my i'm in love", "ajarosepete": "Zomgggg #preach 🔥💕🙏🏻", "sammyherre": "oh my God I need that suit😻😻😻", "unavalible23355": "slay em dead🔥", "amazonbella": "Whaaaat @loeybug Kansas?! That's where Im from 😁 I've Been Pinning Your Photos For outfit ideas 😍", "emaad_1394": "❤️", "flmncoamrca": "Love the bathing suit. Who makes it?", "kari07tacoma": "I want that bathing suit!", "kswifey18": "You are from Kansas!!!???? I live in Kansas! 💜", "kathispikes": "You are a beautiful, powerful and inspiring woman. 💖", "rae_books": "@positivepoeticpeace 🙌🏼 The one piece you need!", "buffbunny\nVerified": "Verified", "mrs_goose_": "YASSSSSS QWWEEEENNNNN ❤❤", "_shannonfinlay__": "Beautiful girl!", "bribug0502": "I left you a message and I know u get millions of them a day but it was me in a crop top and shorts for the first time in a long time and I felt beautiful absolutely beautiful In it but I would not have worn that had I never seen your beautiful self. Every time I second guessed myself I looked at your beautiful pics and told myself u got this and u look great. And I messaged u to thank u from the bottom of my heart for helping me wear that and rock it. ♥️ I really hope u see this.", "deisyafter.50": "QUEEEN🙌🙌🙌🙌❤️❤️❤️❤️❤️❤️😍😍😍💖💖💖💖", "__revannomura__": "GIRL FLAUNT IT UGH 😍 QUEEN L!", "sofia_dalee": "O", "shesoasis": "Queen! 👸🏼", "graciejayneholbrook": "I see you girl rocking that Arianna Grande hairdo it looks really beautiful on u", "mr.plussize_rudikunst": "you are a stunning girl!!!!!!!!!!!!", "dearlover_wholesalelingerie": "Youtube Collaboration--Fashion Clothing Pics and Videos for Our New Arrivals can we talk? my email is dearloverwholesale@163.com", "hannah_kenzie17": "I really needed that keep Killin it Girl😍😍😍😍😍😘😘", "mendezrivera": "I love your bathing suit. Where can I get it?", "followthefoxfamily": "Where can we get this suit?!!", "mimi.tahrani": "😍lyyyyyyy❤️", "daphne_elizabeth_rempel_": "I've been with you since the VERY beginning, and Loey I am SO proud of you. I've watched you grow so much and I've looked up to you for YEARS. You are working your hardest to be your very best self and girl you are KILLING IT. I love you. You are stunning 😍💖🔥", "takanya_m": "You are so beautiful!", "rashyymusic": "Beautiful", "heathercosta4": "Yes girl!! 🙌🙌", "omgimfauxreal": "👏👏👏👏👏👏 and I need this swimsuit!!!", "fernyzambrana": "🔥", "miss14lancer": "I NEED this suit! Where did you get it?!", "xsiennareynoldsx": "OKAY GURL WE SEE YOU! Seriously though thank you for being the best and purest version of yourself. I subscribed to you three years ago now. I was 16 years old and my self confidence wasnt even a thing. Now, 3 years later this 19 year old beauty is what i see myself as now. I'm a big ol' lovable size 16 (UK) and I love every moment of it. It's all thanks to you Loey. Thank you for everything you've done for us. I dont know where I'd be without you as my number one idol ❤️💜", "kenza_talibart": "YES TO ALL OF THIS 😫😍😍", "notthebeesxoxo": "I love you 😍", "dark4ngel01": "You are so fricken pretty", "kyrabrady": "QUEEN of honesty and body positivity", "sindy_rod": "😭❤️", "davisjessicam": "😍🙌👐👏🔥", "sarahbeth3182": "@loeybug love those colors on you! Such a cute swimsuit!", "lovecoffeeandmakeup": "This looks amazing on you, the swimsuit is adorable", "andreablake93": "Hot af 👌🔥", "bluebutterflyofdoom": "Those colors! So cute!", "xcarlie.spamx": "😍😍😍😍😍", "stefanienixole": "Oh 😍😍", "sienatoi": "Yasssss", "tashapolis": "GORGEOUS! All my love! You were the first girl who looked like me that showed me that I could wear a bikini as a size 16. It's always a constant struggle especially in this Hollywood world, but I'm always here for you 💕 💕 💕", "project_slime_newengland": "STUNNING", "sam._.453": "I love you I relate to this so much and I'm proud that you've got to the point where you love yourself even though you might have bad days of yourself. I just love this so much❤️", "hippie_0205": "I loved this so much. We love you so much girl. You inspire us all.", "skyemolitor": "This is so sweet ❤️ absolutely adore everything about you honey bun 😍😂", "ashley.miceli": "AHHHH BB. LITTERALLY GORGEOUS! 🥰🥰", "lisahardyxo": "Yes yes yes 😍😍😍😍", "kelsey5664": "Love this-exactly what I needed to hear.", "michele10167": "Love your confidence girl yaas! 😍", "its.sam_mie": "Love u loey", "bebeauti_ful": "@crissi_l0ve ❤️😍", "acortez2009": "Where did you get that swimsuit??❤️@loeybug", "cailynnn24": "💗💗💗", "gngrmarshall": "Beautiful 💕", "jennifer_ortiz___": "You are a great influencer!! Love your videos and messages of inspiration to others!! You are a amazing human being❤", "norah_williams": "Stunninggg 💗", "davis.cadence": "You look so pretty", "kaylareacarter": "❤️", "missgoldenpoppy": "🔥", "jesselizabeth.x": "i love you", "avagrace265": "Love you boo", "tonymax8": "Nice one", "stephjsims33": "I need to know where you got that suit!! I love it!!! 😍", "loveliest_amy": "Wow.", "prettyrock8_": "W♥W!!! I ♥ve it!", "iheart2dgirls": "Slay", "brigiii": "💗", "emma.bolen2008": "Queen Goals amaz", "tyra.watts92201": "Queen ❤ lol love ya", "barkingcatdance": "The world is a more beautiful and kind place for all you do. I've seen many who take inspiration from what you do and run with it in their own wonderful way. It challenges us to think not only of how many ways beauty can be but how we honor one another.", "evaaguilar_2003": "You are so beautiful. Lots of love Loey. I love your videos ❤", "nicoleleigh22": "DAMN 🔥🔥🔥", "emmakimbrel": "stunning", "amber.__.jane": "😍♥️", "lulhaileyyy": "😍😍😍😍", "emcrumbxmb": "YAS Queen!! 🥰", "jaynebb": "S l a y😍", "lovelyinla": "Yessss babe !!!!! And I hope to see you soon 💕", "jordyndanielleharris": "I live for this 😍😍😍", "madiglows": "IM FROM KANSASSSSSSS im glad to hear ya make it!!", "joeenotjoe": "🔥🔥🔥🔥", "chloe.elaine1": "QUEEN💕💕💕", "abbeystrohmeyer": "Omg a queen!!", "tallgrl085": "@loeybug I need to build my confidence up like you I just feel like I'm stuck in this body and it's just eating me away", "ashlynn_kate0898": "Gorgeous💕", "jessica_j93": "Ok Queen", "anmsprts": "I love that swinsuit", "keith_skyler": "Hi loey! I just wanna say thank you for making me happy and I absolutely love your videos there so interesting in the paranormal world, ily so much 💞💞", "amyammss": "You look so good!!!!", "amanda_l_stevens": "🙌🙌🙌🙌🙌", "_x_ellie_jade_x_": "😍😍😍😍", "snailmail.by.kristin": "❤️❤️❤️", "breakmydreams": "Very cute ❤️❤️❤️", "jessmichelle___": "I love you 💖💖", "emma.hanny": "I have body dysmorphic disorder, and I had to have a large surgery in December - the scar has left me loathing my body on my worst days, and trying to love it on my best. You have given me the inspiration to remind myself that I am beautiful, and to do my best to build my self confidence. I could never thank you enough for the incredibly positive influence you’ve had on me, you are truly a wonderful woman. PS - I need some tips for taking good photos, I’m planning on doing a mini shoot in a cropped shirt/sweater to help myself see the beauty in my scar ☺️💕", "danielleduncan858": "❤️❤️", "charli.wigley11": "I LOVE that bathing suit and I think it really brings out you", "xxcarliemaybe": "Yaaaasss Fck @victoriassecret", "max.madore.offical": "WORK IT", "scarlet_sunrise_bird": "🙌😊", "becca._.lopez": "Thank you for this message", "laylamcgeelol": "You are everything people should look up to, so beautiful and genuine and just amazing. ❤️💕", "widk1112": "@loeybug interesting to read ur thoughts!! I’m a size 4 and won’t wear a bikini, I obsess over the scale- anything over 125lbs can ruin my day. I am seriously trying to draw from your vibe!! Keep doing what ur doing!! ❤️❤️", "mrskwhitelock": "So jealous you're so pretty and you can pull off literally anything! I wish I had all that!", "_thatgirlmorgan_": "Awesome! But ugh I want this bathingsuit!!! Its so cute and no longer on the site. :(", "_piiper.marie": "I love you so much!!!!💞❤️", "eden__watson": "🔥🔥🔥", "sinister.sydister": "Holy frick, this is why you’re my inspiration🤩", "cnagirl03": "Cute!!", "ab1ab23714": "Hy hottt🔥🔥🔥🔥💋💋💋💋", "finallyfree5787": "Beautiful!!!!", "taylorphillips1": "Wow😍❤️😘", "moooshiie": "Girl you look incredible! 😍😍😍✨🙌🏻", "varshabolhuis": "❤️❤️❤️", "miau.avi": "As sad as it sounds i am still playing that game, but every time i see Your posts it makes me feel better and think that maybe i'm not so bad. I still have a long way to go, but your positivity is like a ray of sunshine in my cloudy day and gives me hope of confidence ❤", "markachiu": "I unliked the pics just so I could like it again for the text.😂 You are inspiring 🔥🔥🔥", "rrcassandra": "👏👏", "bella_sno": "Baby Loey, I started watching you way back and you were one of the first people i ever saw talking about body positivity. I cant thank you enough because that changed my life! Love you gorgeous ❤️❤️", "leandraruiiz": "We love an iconic queen 💕✨", "rachelemilymakeupartistry": "😍😍😍😍😍", "onewithari": "You are so so beautiful 😍", "mariawingren": "MY QUEEN ❤️", "lauren_hc_03": "Ur amazing!", "joellthc.hristine": "Yaaaassss 🤩", "lovingloeyyy": "GORG🔥🔥", "crazybiss1989": "Your gorgeous!", "allthatjaz24": "gorg ✨", "saren03": "Amen! I remember when I started watching your YouTube videos when I was in elementary school. Idk but you played a big part of me becoming the person I am. Thanks for that and I'm glad that no matter what you've been through, you keep filming. It means alot so thanks!", "mariathereseroth": "😍", "daisymillicenthannahdunne": "How are you even real ?!?!?! You’re so gorgeous 😍", "melo_kebeni": "🔥🔥🔥🔥🔥", "amy_christina91": "Stunning ❤️", "d_e_halfpenny_": "Love the swimsuit", "coleroc": "This is everything, @loeybug !", "itsliamlewis": "Qweeen loey! 👏👏👏", "pinkysmiles": "Amazing!!! You look gorgeous 😍😍😍😍", "_meis.je": "Hii loey, i don’t knoe if you ever going to read this but. I’m a dutch girl that love you video’s but i realy want to meet you but in don’t know how so yeay i hope that i ever going to meet you!!! Love you❤️❤️", "captainminie": "I wish I was as confident with my body as you are with yours!! You're so beautiful 💕💕", "bearybecca": "And this is why I love you 💕 thank you for your words beautiful queen!", "xolilmonster77": "Loey you will forever be my hero and inspiration 💗💗 you are by far the biggest reason I have as much confidence as I do😊", "eddiestea": "I am so happy that you are with us and spreading amazing messages like this! People should accept themselves as they are-I think that every type of body is beautiful because it's so unique 🌻", "carrie.reigna": "😇🥰😍😍😍😍", "andrea_charcoal": "This speaks to me so much ♥️ Thank you! I Need to Heard this every ince in a while and I am Sure a lot of other people as well 😘 I love you so much ♥️ Thank you!!!", "lav3nd3r_sm0k3": "You are so beautiful and inspiring 💓💞", "shelbmegann": "Wow a goddess you’re so stunning😍♥️", "roxiemichelle": "Ily ily you’re perfect 😭💗", "myah.letts": "You are such an awesome person Loey! You make me so happy and make me feel good shout my body and not feel like i should be ashamed! I love you so much!!", "xox_dolce_xox": "I am so thankful for you and so many other women who are putting themselves out here everyday. Because of you, and others like you, my daughters see beautiful women of every shape and size celebrating their bodies. And as a result, they are in love with themselves and confident in their choices. Unlike a younger me, who tried her best to stay hidden and constantly criticized herself. Seriously - THANK YOU!!! ❤️", "xoxo_babyb": "Ayyyyeeee 😍😍 I see you 👀👀", "alaskayoung100": "@loeybug I’m so happy you decided to follow the path you have. You are a wonderful influence and role model to me and millions of other people. I’ve been watching you for years and you inspire me everyday to look in the mirror and attempt to be happy with what I see, I love you Loey and I can’t wait to see what happens next 💕💕💕@loeybug", "kaylaclark80": "Beautiful", "amcc__98": "Yaaaas 😍😍😍", "angsasaki": "Omg I love this so much. Thanks for the positive words to those of us who also struggle. ❤️❤️❤️", "smashl3yy_": "That looks amazing on you", "aimee_frr": "wow this is so inspirational tbh, I love this 💛", "carobaybiebea": "Okay. This.❤️ But also is this suit from a current or future collection?? Cause I need it!!! 😍😍😍", "mayrahperez": "simply beautiful!!!😗😗😗", "paris_sweets1971": "Fabulous and such an inspiration💜🙌", "lani_dengi": "Who said you can be that gorgeous 😍😍😍", "mialm17": "Where is the suit from??💕💕", "knuxxiie": "SNAPPEDDDDDDD", "sarahlouise__18": "You have been such an inspiration and encouragement to me!! And your message makes me think of \"You Are Loved\" by Stars Go Dim❤❤❤", "cristals._world_": "YOURE SO CUTEEEEE😍😍", "timothy.w.adams1": "Wow", "caydenxe": "Excuse me I think it’s illegal to look this good in a bathing suit", "iskra\nVerified": "Verified", "delondane": "can we get more of this every day? Pretty f’n please?!❤️❤️❤️", "itigrotta": "WOWOWOW 😍 you are so STUNNING! so proud of you. ❤", "_curly_d": "Literally, the caption made me tear up. Love you Loey, you’re my idol! ❤️❤️❤️", "chocolate_loving_dinosaur": "Cute swimsuit", "rebeccahyla1994": "I'm so proud of you", "fernyoung": "Thank you ❤️", "juliakomada_": "Whatta queen yes loey work it lysm ❤️", "valeriegarcia96": "LOEY 😍😍😭 I love this!", "h_gott17": "If I hadn’t stanned before( I had) I do now 👏🏼👏🏼👏🏼👏🏼😭❤️❤️❤️❤️", "ashleigh8898": "LOEY YOU A MF ANGEL BABY", "thathurted.jpg": "You are so gorgeous, inside and out. You're the reason I adore every single one of my curves, dimples, love handles and all. Thank you for being such a huge sense of encouragement in my life Loey. You are truly inspiring.", "partly.sunny": "Okay QUEEN", "phoebe11rae": "❤️❤️❤️", "clairemargaret96": "Okay Queen I see you girl 😍😍", "beautifulsurprise_03": "Go girl! You look amazing!!🔥😍👙💄👑", "_peachy.k_": "QUEEN ❤️", "sohn_von_aristotle": "Can we see more of that suit on you?", "_.a._.unicorn._": "Loey😍😍😍", "faithhaileyy": "OKAY YOU LOOK SO BEAUTIFUL I LOVE YOU PLS COME HUG ME AGAIN SOON 🥺", "missgreeneyes1516": "Total babe!! 😍🔥😍", "taleahellaaa": "UHMMM OKAY 😩😩😍😍😍😍", "batesknowsbest": "🙏🏻❤️💪🏻", "mandinc": "I love this!!! (the swimsuit and your positivity) 💜💜💜", "reagan.225": "Ummm gorgeous 🤪", "chantelylace001": "Need it", "deletedthisaccount.d": "Same 💜", "golbachs.xplr": "QUEEN, QUEEN, QUEEN 👑", "catzndogz2003": "Wow this is amazing and u look STUNNING!!!!!!!!!!!!!!!!💓👑👙🙌🙏", "graciex1244": "Yesss loey SLAYYYY ILYSM GIRL", "eliza_cay": "❤️❤️🙌🏻🙌🏻😍", "iftheapocalypsecomes_beepme": "Don't ever stop!", "danielxmiller": "Yessss love uuuuu", "anavee88": "Yeeeees!!! Thank you so much for introducing me to this site!!!! Swimsuits have always been a struggle!! Either they fit and have support but are super boring or they don’t support at all but have cute details. Now I’m so excited for the summer!! 😘😘😘 you’re the best! 😍🔥", "ana.reis97": "Gorgeous wow 🔥🧡", "shannonambermusic": "Well said! Thanks for being you!", "monikathegreat": "snatched 😍", "rebeccajeannn": "Yesssss 🙌🏻 sister soul search 👌🏻😭", "samantha_jjean": "@loeybug I dont know how you can still support @victoriassecret after what they have said regarding plus size women and the LGBTQ community. 😢", "juliacorinnee": "I love this ❤️❤️", "killrkitkat": "Love the skin you’re in in because it’s pretty that it actually makes me angry, like I’m actually mad", "chelseamakeup14": "❤️❤️❤️", "jesuslovedpowerhour": "Queen 👑", "crystalscruggs": "So proud of you then and now for overcoming so much that life has thrown at you!! You’re always beautiful, always open and always a great role model because you’re REAL and that’s what everyone should be in this life!! Love you!!❤️❤️", "maddi_.ox": "your so pretty 😩💓", "_dustipruitt_": "Amazing love ❤️ #soulsiblings", "alexxsienna": "QUEEN 😍🔥", "sophiaimtired": "your positivity is insane. thank you for being you. also, you KILL in that bikini 😍😍", "jjaayy_nnaa": "Such a cute swim suit 💕", "notkellylmao": "im sorry, but this isn't legal 😍 you're amazing and beautiful! you should tell me your secret 😩🙌", "_.kayak._c": "♥️♥️♥️♥️♥️♥️😍😍😍", "alexisbarretttt": "😍", "trippyyy_mk": "Ummm excuse me..WHO GAVE YOU THE RIGHT TO ATTACK US WITH YOUR BEAUTY?!!!😍🔥", "ssimplytaylor": "UM HECK YES", "pamdabear505": "I love that suit!", "barbarapferrer": "🔥🔥🔥🔥", "brookechey_mua": "God just yes to every word of this 😩😩💕💕💕", "milllkteaaa": "currently watching your video on how our phones are listening to us and reloaded my page. first thing that pops up is this picture. coincidence? i think not 😱", "zloop": "Girl YES", "misslateefa": "@7aneen_1414", "jasmine__saunders": "Queen!!! 😍🔥Love you boo. Don't ever stop being you.❤️❤️ ❤️", "lady_k1126": "Love your hair color!", "chaunieee": "💜💜💜💜", "blessed_momma_4x": "You are absolutely beautiful 😍", "slum_bunnyy": "I love you I love you lloveyoundjsbhzhahushs", "scorchingkira": "No thanks, I need my heart to live! I’ll just get chicken nuggets instead 😍❤️", "_wingedeyeliner": "Thank you for existing ❤️", "agconnor14": "FLAWLESS QUEEN🤧♥️👏", "theshanaleigh": "Work it, girl.", "_hannah._15": "Loey omg you’re gorgeous 😭❤️", "glitterfishkyra": "Damn girl get it!!! 😍😍😍😍❤❤❤", "lauraisabelq_": "ILY QUEEEE", "malyah.michelle": "YES QUEEN I LOVE YOU", "michelewolff": "Where that suit from though?", "katiekkilian": "Omg LOVE the suit!!!🔥🔥💖", "mayaa.papaya": "I accidentally liked it again after I read the caption 😭💕 YES LOEY!", "lori.coleman": "This is everything 💜💜😍", "angelslife46": "❤️❤️😍😍😍💯💯", "rosemarie_h": "An inspiration beyond words.", "hollaitspaula": "Looks amazing!", "myaloughran": "UM WAIT OKAAAAY SIS ❤️😍😍😍", "calidessertqueen": "🔥🔥🔥", "kfd.76": "Gorgeous 🔥🔥🔥🔥", "miranda_mae20": "You’re so beautiful 😍😍", "madlauner": "so gorgeous", "danielle.1005": "You’re so pretty!", "isabellaaa_sanchez": "Your so beautiful 😍 ❤😩🔥", "cassie.lynn.11": "You are beautiful😍", "youreadorable3": "Ugh you’re the cutest & the biggest inspiration to us all ❤️😭", "melaniee.vegaa": "😍😍", "some_kind_of_wonderful1313": "Um who is she? Queen 👑 💫", "sidneynichole17": "@loeybug so damn beautiful 😍😍😍", "hey.sisters44": "Not a lot of positivity but you gave me some ❤️❤️", "tiffanykay__": "Love you!!!", "kenziethegemini": "QUEEN, LOVE YOU❤️❤️", "ancientdaisy_xx3": "yassss honey yaaass💁🏽‍♀️", "emiillyy.13": "queen", "fakradin3": "❤️", "jameekdafreak": "Looking amazing!!!", "love_the_v0id_747": "Omg beautiful😍😍", "maddynicole101": "AHHHHH YESSSS!!!! 😍😍😍", "kaymedlyn": "You’re a beautiful person and so inspiring!!! 💕💕💕", "itsjustmadeleine": "Loey you so inspirational. I have struggles with myself right now, and you help a lot. Thank you so much. And I hope you see this. You’ve made a message, and it’s gone through and definitely have changed peoples lives. @loeybug", "bookish_anxiety": "Gorgeous!", "icelynodette": "I love you & I just want to be you!! ❤️😍🤗", "thelibrafaeire": "You’re so beautiful 😍", "kfeuz": "I miss you’re blond hair...", "jackson.w.wall": "Looks Amazing😍😍!", "memesforvalidation": "im in luv", "kingdoris_": "😍😍😍Beautiful AF", "rachmooree": "YES YES YES", "paranormalhousewife": "OMG! You are GORGEOUS!!!! 😍", "tictactori": "You are such an inspiration because you keep it soooo real! Pardon me while I go find my wallet so I can buy this gorgeous swimsuit!", "daniellecovell": "Where did you get that swimsuit!?! Love 😍", "ashley.novoa": "i’d like to know who allowed you to look this good??", "lexi_lemelle": "Wow. A queen 👑", "savanajewels": "😍😍😍🔥🔥🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 Slaaay!!", "siann_95": "Need that swim suit in my life 🙌 where is it from ?", "inloveroses": "i love you so much", "sara.claire.mua": "Woah woah woah hon-ay! You look beautiful! 💣 🐚", "_.nnessa._": "Queen🥵", "mia.cruz1": "Yes ma'am. Seeing your confidence is so heartwarming and I truly aspire to be this happy and comfortable in my body", "amirahclaa": "OMG YES👏😻", "sar.isht": "Loey you are absolutely stunning.", "schuyleradventures": "🔥🔥🔥", "banksyy_100": "Yes 😍", "kimmy_k_95": "❤️❤️", "whoaadestiny": "Queen 👸🏽👑", "danigay.tiu": "So so gorgeous 😍😘", "getlostinthechaos": "I’m sad I can’t find the bathing suit 😢", "its.alaina.mydude": "you have more confidence than i ever will", "mialondon.24": "Queen. Literal queen!!!!!✨💛", "tittah.b": "😭😭i wanna be pretty like you!!!! 💗💗💗💗", "natalieglaneman": "Your confidence inspires me so much😍😍", "mandy_tx31": "That swimsuit is super flattering!", "addyygrace": "QUEEN", "gendervoid_ghost": "LOEY!!!!! My QUEEN!!!! Ready for summer!!!!🖤💜", "genesisamayaaa": "I’m so happy to follow someone so empowering and inspiring as you @loeybug thanks to you I remind myself that I am beautiful the way I am!❤️lots of love beautiful 🥰", "lillarderica": "I LOOOOOOVE YOU!!!!!!!!", "kyxgrey": "YES QUEEN", "justmemare": "Love that suit!", "sarah.elaine125": "Love you beautiful 💕", "kareena.nicole": "Cutieee😍😍😍", "whitlischke": "LITERALLY MY FAVORITE ICON, SLAY SIS 😩😍🔥🙌🏽", "aaisha.kazi": "You look amazing 😆", "iamashleyrenae": "Meanwhile I’m a fellow Kansas girl who has no idea where to start. Congratulations on your success @loeybug", "dj_devils.j": "Beautiful picture 💯", "iamtessaraerock": "Lovely Loey!!! You’re so inspirational ❤️", "maggypat192": "@dpa0286 If it looks some what ok on her we will look amazing on this lol", "muaythai_9000": "@loeybug check your DM please. I’ve been trying to reach you since last month. 💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙", "maddiee051": "You’re so pretty omg🤩🤩🤩", "aliensandwitches_": "😍😍😍😍😍🔥🔥🔥", "dignasworld": "Wowowowow ✨", "renenayyy": "Where u get it", "functional_member_of_society_": "first of all- OMG GO OFF SIS second/ i live in kansas🙃 third- i have a small yt channel (check my bio) fourth- more updates on the sun vanished????", "emmylittletexan": "You are so beautiful inside and out ❤️ you are a huge role model in my life!", "brandicoulas": "You’re literally my inspiration 😍😍❤️", "haleywitt_": "Aw! Omg! Loey, you look amazing! I can’t even.", "seraphinedreams": "@opal.rice.39 read this 😍", "tori_ussery0211": "@loeybug you make it so much easier for me to embrace my curves! I love you so much! Such an inspiration!", "mel731_": "WHERE DID YOU GET YOUR BATHING SUIT?! 🔥❤️❤️", "foxlynn.king": "Holly shiii💕", "destrykarma": "wow never seen someone this gorgeous", "mikalacabe": "I can’t even begin to explain how much your confidence has inspired me, and I’m sure many other young plus size kids like me. I love you so so much Loey, I am proud of you and I am grateful for you.", "daisieemae1967777": "Hi Loey, you look really happy and you are glowing... that bathing suit looks so good on you 🤗 Love your Positive Energy ☀️💛☀️", "samantha.jcc": "👏🏼", "misssashalee0": "😍 you are stunning x", "katrine.bruun": "Omg loey 😍😍😍", "italianadoll": "Your rocking it!👌", "22th_era": "Yeah eat your heart out because the queen is here", "itscatherinemarie": "I honestly wish I had you to look up to when I was 14 years old. You are doing great things and spreading so much positivity, thank you for that 💜", "merrill_streep": "You are so beautiful ❤️😘", "___christinaaa___": "stop it you’re so hot!", "iamthecross": "#PERFECTION 😱😱😱😱", "myfandomwillsaltandburnyours": "Wow, you inspire me so much, you are such a beautiful human, and i hope i get to meet you and tell you that in person one day ☺💗💗", "thepeacesfamily": "Icon😍🙌👏", "axsj30": "👑", "glowpinkstah\nVerified": "Verified", "kaprrin": "@loeybug. Can you please start linking the stores you get your outfits from 😥 help a big girl outtt", "_viannaaek": "So gorgeous", "andygabbs": "💜💜💜💜", "ash_laporte": "Danmmmm girlllll🤩🤩😍😍👏🏽😫", "juliarnes": "Victoria’s wig is offfffff 🔥🔥 beautiful!", "jayjayweezy": "Wtf iconic!!!!??? GOOOO BABE!!!!🎉🎉🎉🎉", "pajes_opinions": "What’s the name of the nail salon", "richerodt": "So proud of you👏👏👏", "gmarie628": "This is everything. ❤️👏🏼👏🏼", "vickienna": "Hi @loeybug. I just want to say that you are a reason why I was able to learn to love myself. I have been watching you for years. I love everything you do. Your paranormal videos, makeup content, and body positivity. I also love your book (using it to tutor a student who is learning to speak english and she likes it too). I just want to thank you for your hard work, dedication, and genuine love for your fans. Keep being you ❤", "toastyness_aj": "slayyyy 🔥🙌", "hannarousey": "@heyimsydnee she’s a queen", "extraordiinary.machiine": "I wish I'd had this mindset at your age. Unfortunately, body positivity wasn't really a thing 12 years ago. :) It's so great to see people working to embrace and love who they are, rather than struggling to conform to societal expectations for beauty and health. You do great work, even on the days you don't feel that you're bringing your best. Just putting yourself out there is inspiring to many. ❤", "n8tvbl00d": "Stunning!🥰", "mel8303": "Send me link to but rhis", "bl00d_h0n3y": "Yeeesss Loey!! GET IT!!!", "imnormakennedy": "I relate sooooo much. You're beautiful, Loey! Even on your worst days I hope you remember that you are beautiful and that you've helped so many other people feel like they're beautiful too. 💜", "itsjaymad": "Beautiful inside & out 💗", "aril3n": "absolutely rocking it 🤩!!!💖", "alex.mollie": "loey i love you but how could you support VS? they’ve outwardly said that they would never hire plus sized or transgender models.", "lteoxdide": "I love you so much. You are so inspiring ❤️😍💞", "emily.ros3e": "you are SO BEAUTIFUL", "phenix1690": "Go ahead loey!!!😘💯👍🏿👍🏿", "mzsarcaziim": "Beautifully said and totally relatable. Hugs and kisses and blessings to us all.", "m.aya1303": "you’re part of the reason i’m alive right now loey. i love you so much.", "haylieee_joyyy": "😍😍😍", "xomlw": "okay mami", "samanthakr1": "Queen 🔥🔥🔥🖤", "maddiemarissa": "🙌🏻🙌🏻🙌🏻", "elizabeth.riichardson": "@loeybug. I sent you a private message here on Insta. I don't have Twitter.. Its a video you have to see! Supposed spirit..", "_chunkyspicee": "Yes mama! 👏🏽👏🏽👏🏽👏🏽🔥🔥🔥🔥", "iamkenziiee": "you’re a beauty queen and i’m jealous stop being so adorable🥺", "maggiepriderwint": "omg icon i love u soo much", "otay.julia": "Hiii helloey 💕🙌", "illeanasfinsta": "YESSS 😍🤤", "ima.unicorn_meow_": "Ugh your so beautiful 😍 I wish I could see it in myself but I also have hated my self for a very long time, I missed so many days of school because I just couldn't handle being around people so I eventually had to just do online schooling and get my GED I never even went to high school. I'm starting to feel better about myself I've been working out everyday for months and it makes me feel great to see a change but I still feel like its not enough sometimes", "larrelwoods": "You are doing big things!!!! So proud. Love you forever! 💗", "olivia_ooh": "Absolutely gorgeous both inside and out 🤗😍", "annaleightoomeyofficial": "You’re a queen😍😭❤️", "nesspie": "I love following you over the years! You inspire me to love myself. You are stunning ❤️", "kayladelonge": "W O A H😍", "kaylislostinwonderland": "I've only been watching you for a little over 2 months, but wow are you inspirational! Seeing you love the body you were given is amazing and helps me to love my reflection. I truly love you.", "sav__spams": "💙💙 needed this love ya Lo!", "jayniecsw": "You and that suit 🔥🔥🔥🔥😍😍😍", "shirley.m.cagle": "You're for sure my idol!!! I love you lost!! 🙌😭💜", "dayleeparker": "ur so beautiful and so is this message", "dfollmer1998": "Soooo beautiful 😍", "sour_cream_on_my_elbow": "Oo girl you’re so beautiful ily and your videos❤️😍", "lauren_rene.v": "Looking amazing as always!!!❤", "shannylynnn": "yesssssss👏🏼👏🏼👏🏼👏🏼", "victoriaals": "My QUEEN i adore everything about u 💕", "kileynicole.xoxo": "OMG WHY ARE YOU MY QUEEN LOEY😍😍😍 @loeybug", "ellieldoggett": "you’re so incredibly i love you loey!!💙💙", "marietaylin": "thank you for pushing into us that we are beautiful no matter what size we are. thank you for being real. you are such an amazing role model for myself and other women. thank you for always telling us we are loved and beautiful when we felt no one else thought that, even our selves. you are an absolute angel.💟", "draemarie": "I love that swimsuit 💕", "meganposhh": "That bathing suit is adorable! I’m looking for a fun one piece for my honeymoon ☺️ is this one from Victoria’s Secret? You are absolutely stunning and I love you! 💕", "anaorohui": "I love you Loey, you are a true inspiration to me ✨", "french_hornn": "SO BEAUTIFUL ❤️ YOU SLAY GIRL❤️❤️", "ashleymarieluv": "Girl.. you’re looking GOOD", "adamejoanna": "💖", "kencellynix7": "You look INCREDIBLE 🤩🤩🤩🔥", "octavia_lewis_asherov": "Gorgeous!", "milkyslug": "Preach girl 😍❤️✨", "josemiguelsal": "go AWFFFFFFF", "nihongojohnny": "You’re my hero Loey! 💜", "alyssaadewig": "thank you for sharing something so close to home. Stay strong and confident beautiful😻", "brianavalentin": "thank u for inspiring me everyday @loeybug 💖", "dvinterventions": "😍😍😍😍😍😍", "spooky.noodlex": "If only.", "jakresky": "Okay ZADDY. She didn’t have to serve so hard but she really did it to em", "jennifer_mercer178": "My queen, Loey❤️❤️🙏🏻 You are stunning and your positive attitude towards yourself and others radiates.", "taylor.takes.photos08": "❤️", "getwiththeglo": "@loeybug your such an inspiration. I am at the point in life that I’m finding my confidence. Slowly finding it but finding it nonetheless. I want to to fashion posts and videos on my YouTube. I just a little afraid of the reactions but you give me hope🤗🤗🤗", "mynamesmargo": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "stlideoz": "ugh wow I love you. Also ready to buy that bathing suit because damn 😭", "jazminnavalos": "Ooo that body tho! 🔥😍😍", "ratedpwf": "You are an amazing woman and influencer and I hope one day to meet you.", "lizgnzlz_": "Love that suit! Where is it from? @loeybug", "margery_weems13": "😍Fire🔥🔥🔥", "rrachel.craigg": "god dang 🤤", "unicole.peggasus": "😍😍💗💜", "sarahh.sim": "@sam_randles her hair omg, this is the kinda curls I need guuurl", "tiffany_era4444": "😍😍😍😍 What a queennnn", "lozzahd": "angel🤩🤩", "lizzie7213": "💗💗💗", "voxamberlynn": "I just love you!", "bethbraddy": "👀👀🔥 Where is the suit from?!? Gorg", "brimartinezz": "QUEEN!!!! EVERY BODY IS BEAUTIFUL", "karishmajb": "I love this!! ❤️", "myriam_948": "Those Colors are my absolute favorite :3 😍😍 slay the look", "blueeyeswaifudragon": "Thank you internet dad 💖😭😭", "krys.m.m": "That’s soo iconic", "tanuahsbr": "James Charles whooooooooo👌😍", "miss_laney87": "@loeybug you are so gorgeous and amazing!! You inspire me daily! 😍😍❤❤ #yassqueen", "mikes.darkside": "OMG LOEY I LOVE YOU SO MUCH, YOU INSPIRE ME MORE THAN ANYTHING AND ANYONE, THANKS TO YOU IVE LEARNED TO LOVE MYSELF AND BE ONLY POSITIVE TOWARDS MYSELF, THANK YOU SO SO MUCH AND I SUPPORT YOU WITH EVERYTHING I HAVE💞💞💞💗💗💗💗💙💙💙💙💘💘💘💘💓💓💓💓💓❤️❤️❤️❤️❤️", "babylene818": "Hella cute❤️😍🔥", "skyler_1302": "Amazing!! So much love and respect for you girl!! ❤️", "mirandataplin": "Yaaaaas loey! 🙌🏻🙌🏻🙌🏻", "marysultanaa": "love this", "kenzz_132": "omg SNAPPED", "jess_1011_": "❤️❤️", "shaelyncampbell": "my beautiful baby girl", "asia.marshall": "With relish 😝💗", "readytoglare": "Victoria’s Secret left the chat 😍", "juliafalveyyy": "awe pretty", "h.gracef": "😍😍😍😍😍", "amber_reyes1988": "What size do the go up to in the swimsuit?", "dreaming_in_1989": "You are amazing. Love you so much. Keep it up, Loey!✨", "hannahmeldrum96": "Work it girl @loeybug 🔥🔥🔥", "butterflyreese": "you look so good. im so proud of how hard you worked to get to this point. you make me wanna work on myself. i love you💛", "xbagelbabex": "Queeeeen💖💖", "yo.pxpii": "love the bathing suits 😍 and your face 😭❤️", "sarahtherealtor_": "Gorgeous! 😍", "kenzie_dobson": "Woww such a queen 👑❤️", "kaelynnhaley": "WOW WHAT A LITERAL QUEEN", "snitchery\nVerified": "Verified", "staceely": "The swimsuit is from where????", "jessfabii": "I’ve been following you loey since DAY ONE and I’ve seen you gone through the good and the bad. I’m honestly so proud of you and everything you’ve accomplished. You’re such an angel. Such an inspiration on so many levels. I hope to meet you one day. You make me sooo happy❣️❣️", "anthemkay": "🤩🤩🤩🤩", "aethercloud": "WAIT OMG", "rein_inthemood": "I Stan this literal queen", "emm_luna1999": "You are so gorgeous and inspiring ❤️😍😍", "bkeziah1024": "BEAUTIFUL 😍😍", "brandonb_backup1.0": "💖💖💖💖💖💖💖", "caroline_chesler": "OH MY GODDDD😍😍😍😍", "ixavel12": "Oh my god where is your bikini from!!😍", "faithcrumpler": "YASSS QUEEN!!😍❤", "john__nosa_king": "@loeybug you re beautiful", "kira_dreamerrrr": "I love you", "juliaboyle21": "you went off 😍", "nevaeh_mancini": "Omg ur beautiful loey", "ismellweeed": "😍", "trxp.lennyy": "I love you", "kcmcl": "Gorgeous!", "__hattie.vic__": "oh lord 😍😍😍😍", "courtneyfit98": "GIRL YOURE KILLIN IT 😻", "foxgirl89": "Beautiful as always ❤️", "jrey0683": "Omg I need this! You look gorgeous !", "emily__kay05": "You’re freaking gorgeous 😍🤩", "jakobwebb": "She’s a body boss and babe. And i Stan so hard 😍"}