{"heartz.icons": "Did any paranormal experiences happen to u when u were younger but u never thought much about it?", "saskiagronow": "How are you so pretty", "kayjay.johnson": "Yesss girl rock this😻😻", "rachellnielson": "You're so pretty!", "baileeebakerrr": "Beautiful*", "ashleybmitchell": "hottie", "april.lee.rose": "That shirt necklace Kylie Jenner thing caught on.. Oh God..", "b3cca_boo": "@loeybug omg i need this top😍", "sugarclawz_cosplay": "Great picture😍👌💋💋", "cutenesslijah": "she is beautiful❤️", "valealonssso": "Can u give a self esteem advice?", "summer.evans_": "Ur soooooooooo pretty omgggg😍😍😍😍😍", "rizlumanlan": "Yessss!", "spectrumoflightt": "You're absolutely stunning girl", "blonde_xoxo16": "Love this top, I own it also. Wondering how to rock it with a bra !", "rosecasss": "😍😩", "abdullah.vt": "@abdullah.zn", "othmanelkantaoui": "Ravaissante 💋💋💋💋", "ceyhun_cabbarov_": "👍👍👍👍👍👍👍👍👍👍💖💖💖💖💖💖💖💖💖💖👑👑👑👑👑👑👑👑👑👑👑", "avalddy": "This outfit is amazing 😍😍😍😍", "alexmxe_": "I love your outfit 💜💜", "twistedth0ughtsxo": "@twisted.princesss", "dimitra_gotzia": "Oh my god I LOVE the outfit 🔥👑", "aoibhinn_harper": "Where is your favourite place that's you have travelled to and why is it your favourite ?", "sarahhh.mitchell": "Funniest childhood memory?", "claraeschneider": "What is your favorite store?", "m___kenzie": "What advice would you give for high school?", "amerizze": "How did you become a plus size model?I would love your help since I am a plus size model well I am trying to become one at least", "sa.anwr_": "beautiful 😘😘😘", "elplev87": "Hola", "noahudesman": "@amit1david", "x_oliwia_x12": "If you could choose one of your scariest paranormal experiences , which one would it be? btw ilysm", "juangaespi": "@juan1999l1", "crimson_poison": "@loeybug first, I love you so much, second, if you could do a world tour, would you? Or would you be too nervous? Ps you should really come to the mall of America on said tour.", "poetcy": "ur the cutest ever", "rachelsteed2016": "How's your marriage?", "anyas_animal_friends": "Do you have any cute sweaters for Annie", "xlinskevandenbosschex": "What is your favorite sport :)", "that_one_short_blonde_girl": "What is you favorite fashion trend", "taylor0livia": "Is there any update on your stalker?", "cassilyn52": "If you could only wear one color for the rest of your life, but you could use different shades and tones of that one color, what would it be?", "shelbyjburg": "@bryannalewiss", "s7rr4": "can you listen to BTS?", "pumpkinlover_277": "@loeybug you are my role model and I wanna be healthy like you, do you have a workout routine if so what is it ilysm❤❤❤💙💙💜💜💜💛💛💛💚💚💚", "misty.marwa": "What's ur favourite kind of videos", "marizalizarzaburo_": "😍😍😍😍😍😍", "esmeevogels90": "What do you like to watch yourselve on youtube?", "thataintit420": "You look so cute", "brooklynwich": "Hey Loey! I'm a new subscriber and I love your videos! I was wondering who some body positive celebrities are to look up to??", "designerbarbie86": "Super cute top!", "migg.iex": "Have you ever had any psychic moments when you were little? If so what happened, love you loey! 💋", "ninaashhatch20": "@loeybug What is the biggest challenge you came across, and how did you handle yourself mentally through it? 💕", "xoxoxbbyliv": "DREAMS... Loey please message me back☺️ thank you @loeybug", "brittaniwinae": "@loeybug if you had to choose one store to shop at for the rest of your life, what would it be?", "mermaid.sabrina": "How did you become so confident? Any tips on boosting your self esteem!", "lizziecapron": "are you going to have any meet and greets soon? I wanna meet you! ❤️❤️", "sarahseasaw": "🥄What is your favorite brand of C E R E A L ?! 😋🦄", "arianerou": "What is your must have makeup product?? X", "lulu_alnaimi25": "WHAT'S YOUR FAVORITE MUSIC", "samantheriee": "@loeybug please can you do more hooked app story videos please? I live for your paranormal videos, UKfan 🇬🇧 x", "olivia_korosec": "@loeybug 1.ily💄💕2. how's life been in LA, any creepy story times while in the west coast?", "carmen.wg": "my aesthetic x @livi_makin", "graciebchilds": "when will i be able to meet you?😭😭😭 i love you so much! you're my absolute inspiration and a lot of times my reason to keep going❤️💋", "brittknee3_2": "Why did you start youtubing ??", "tristanhicks2292000": "What made you start doing paranormal videos and why have you continued", "iboike25": "What would you say is one of the most meaningful or touching things someone has told you they got out of watching one of your videos? I always feel so happy after watching you and wanna give you a huge hug! Come to MN and we'll get Caribou! Love you girl!", "miiuyen": "@loeybug u look so beautiful and confidence girl . uhm have u ever wanted to become a mother ??", "iz.the.avon.lady": "Will you ever do a ghost hunting video?", "sammie_marie22": "@loeybug What advice would you give to someone struggling with body positivity? 😧😧😧😧", "madi.newmann": "how are so you good at makeup!! xox", "livi_makin": "@carmen.wg", "mynameisumz": "Hey Loey! If you had to chose a Disney villain, who would you see yourself like most?", "floor.is.my.name": "Did u ever been to Amsterdam? And of not would u go?", "no_so_unamy": "Mom, I don't if you've made the video yet, but how's Uncle Aar-Bear?", "apricityrain": "I remember in an old video you said you are \"very religious\". I assume you were christian like me. My question is \"Do you believe anymore?\" If not what changed?", "craftybabe5": "Can you please do makeup videos again!!", "courtvioletta": "What would your advice be to someone who is afraid to open up about an eating disorder or other difficult subjects to a partner due to a fear of abandonment?", "kayli.flemings": "What is your worst fear about life?", "aliza.roberts": "Q- what do you have to say to all the girls who don't have the \"perfect body\" and how do you feel about them Beating them selfs up over it.", "okalrightem": "where do you see yourself in 10 years?", "foxyygrandpa": "How is Cali living so far? Any major differences or culture clash from your previous cities? Love you, Lo Lo ❤", "emilynsue": "Why did you start doing YouTube? And what makes you continue to do it? Do you wish that you had a different career if so what would it be?", "achunkysoul": "What got you into the paranormal? Do you open and close Ouija sessions with protection and closure?", "sylvesterbarzey": "Where is the creepiest place you've ever been?", "laciee.michelle": "My lovely loey", "ambrose_rooze": "♥", "kaylinnnnnn6": "Biggest makeup pet peeve ?", "meg0198": "What's your favorite song?", "olivia__fox_": "What is your favorite animal ilysm", "e.rin.rose": "Would you ever come to Australia for a M&G? ❤️", "memartokwakawaka": "Wtf", "grace.gerwig": "What is your craziest paranormal experience", "sidesofesme": "😍😍", "leah_michaela__": "Why do you think that you have so many paranormal experiences? Ilysm", "olivia.schwenke": "When will you have kids if and you are what will you name them boy and girl?", "natalieacrowley": "Can you be my mom", "litaaraa": "😍💕😘", "allisonforts": "What'd your favorite perfume to wear? Love you 😍❤️❤️❤️😁😁👍🏾👍🏾", "brookedegoey": "What are your favorite foundations? i'm trying to find a good one! p.s I LOVE YOU and your videos, you are such an inspiration to me and help me think that everyBODY is beautiful ❤️", "juanfasti": "Looking good from ESLA east Los Angeles baby", "contreras_arianna": "How have you been staying active lately with the move to LA?", "_savannahsmile": "What would you say to someone who is struggling to love themselves even when they know they should?", "jenni.flores__": "What is you all time favorite movie/ tv show?❤️❤️❤️❤️", "nicetoomeetchu": "How do u deal with bad days when they happen? Your videos are amazing and they help me a lot.", "_kaylada_": "What is your most favorite video you've done??", "slimeolicious04": "Do you have advice for someone moving and going to a new school?", "makaylamagness": "@loeybug are you permanently moving out of Texas or will you be back and forth?", "kkristianfields": "any tips for upcoming makeup artists? ive been wanting to pursue a career in makeup artistry for a few years now and im planning to go to college soon for it. anything i should know before i take the next step?", "dakotah_guess": "If you didn't do YouTube what would you do?", "marlee.evans": "Thoughts on fashion nova? ❤️", "zoovolonter4": "#свинья", "oliviaagreenn": "have haters ever brought you down at one point? bc they shouldnt, you're amazing the way you are :))", "_kuehn_": "Omg love 😍", "artoforishiro": "Hey Loey! What's your favorite tv show right now? Love you so much! <3", "ari_vanqueria": "What's the one thing you fear the most? And why? I don't really fear anything except a life un-lived. Also, how the heck does a Joe Shmoe like me start a YouTube channel?", "stseaseabriar": "Do you do your own nails?", "slime.2568": "What's made you confident enough in your own body ? So inspiring ❤️", "erynlajoie": "How was your relationship with your brother when you were younger? Were you always so close? P.S. I'm praying for you and your family! You've been through a lot this year, and you're such a strong person, love you lots! ❤️", "marissaxross": "if you had to sacrifice coffee or make up for the rest of your life, which would you choose? love you🌹", "ariane_183": "what's some advice you would give to someone looking to start a youtube? ilysm", "abygail_abs": "Why are you so pretty?!? (Not that its a bad thing, you're a total inspiration) 😍😆💕", "debtheartnerd": "@loeybug is there anywhere in the world that you've never been, but have always wanted to visit?", "alyssabeth017": "What's the most scariest thing that has ever happened to you?!? Ilysm ❤️💕💖", "maria_xoxoxoxoxoxo": "Would you rather be a nerd or be a model????", "brook_bw02": "Are you having kids yet????😩 You're babies would be beautiful!!!😍❤", "charbazen": "Religion? Is it Easier to forgive or forget? Ever watched spongebob?", "hey_imsupergirl": "Can you please do a video where you demonstrate how you dye your hair so perfectly?", "sarahi.oxo": "Can you give us quick advice about someone who wants to start a channel? Like the equipment needed to start like camaras, lights , mic? Thank you so much 😄", "i_am_alicia93": "How do you deal with stress? I have a one and a half year old and I work 14 hour days. I need some tips for relaxing.", "bbbrrroooke": "Since you live in LA will you be doing more collabs (Ily Loey!)", "melissapinkfield": "Thoughts on babies currently! Xoxo", "hathatsme11": "slaying.", "giulianah12": "Will you ever do a physic reading, and if so will you do a video on the results? 😁", "murry_______": "What is the best and worst things about living in California and Texas? And which do you prefer? Love you sooo much!!!!😍💖💞", "lyiss_may": "@loeybug what's your favorite makeup product? 💜💜💜", "reginaaahx": "Hey! Do you think you will be visiting The Netherlands in the future? ❤", "kare1994": "How DO you go about finding your style and what clothes for your body type? I have such a hard time finding clothes that I like on me.", "angelie9797": "Do you have any sleepwalking stories?🤷‍♀️", "caitlin_hunt97": "My question is: do you get a lot of random invitations to random events from fans? I love you so much you beautiful butterfly", "liliana.pearl": "What's your worldview? Atheist, Christian, Agnostic etc.", "yasin_msdm": "😳", "lovely_trio": "Have you ever been on TV at any time of your life?", "cacyjo": "What's your favorite thing to do outside of YouTube and modeling!?!", "milalalangelize": "I love you Loey! My question is: now that you live in LA, should we expect a lot more of collabs? 🐶🐶🐶.", "mariaandrewsxoxo": "I love you so much. How are you always so confident and positive 💋", "sasha_may": "Seen your snap of your guinea pigs, how long have you wanted to get guinea pigs. Ps love you and I have five guineas of my own ❤️❤️", "nicoleroseriggins": "Any tips on how to find your personal style? 💕💕", "michellegoesoutside": "When are you coming to Tallahassee to relive our glory days at the college bars w me? 💕 (this is a ploy to get you to love Tallahassee and co-op a dog and pony farm here with me)", "_xdesireee": "How do you deal with all the haters is it really hard to stay positive sometimes and have you ever gotten to you? Ps ilysm", "savannahweatherly": "Omg I love you so much!!! My question is...do you want children and if you how many and what gender?? Ps I'm part of the notification squad @loeybug !!!", "julieinthehill": "I love your eyebrows!! How do you do them & what products do you use?", "_christinagriffin": "Whos your favorite superhero?", "abbiejxnex": "gorgeous", "ohhjjhhft": "WHATS YOUR FAVORITE DISNEY MOVIE (yes I'm actually screaming bc I have to know and I love you so much)", "imangelicaa_": "Can you do a makeup collection video?", "sarah.casey55": "Would u rather cut all your hair off or burn all of your makeup??", "hannatolson_": "If you could have lunch with one person (anyone past , present or future) who would it be.ILYSM!!!!😘😘😘", "just_another_youtuber_lover": "Do u know/like The Vamps? If not u should react to them.", "98_l_e_n_a_98": "Who do u listen to?", "coriannaross": "@supimlexx it's a look", "baemie_slunt": "How can the fashion industry become more inclusive in the future?", "briannakndall": "How do you think our perspective on beauty will change within the next 20 years ??", "bbygbs": "How long did it take you to accept your body and become so comfortable with it?", "yexii1721": "@loeybug how are you? How does it feel to live in LA? And are you liking this weird hot weather we are having? Like yesterday was 109 in the IE lol", "lilycrockerr": "Do you ever want to have kids?", "thedevils.wallflower": "Goals😍😍", "mercedy24": "What is your haircare routine? Products and how often you wash, etc? Thank you 🙂", "eveeboyd": "If you were ever to buy a boat what would you call it and why?xx", "kimberly.lashae.simmons": "Love you💕💕How did you get to a point in your life where your happy with yourself?", "twerk4abby": "How has your opinion on the beauty and fashion industry changed over the past few years? Btw love you so much! ❤️", "unconventional_kristen": "What's your favorite gemstone? I know its random but I really want to know anyways love you lots 💖", "that.girl.that.plays.horn": "Could you maybe talk about your experience in a Long Distance Relationship of temporary or not?", "haley.eisman": "will you ever have a meet and greet in Oklahoma? btw if you see this i love you so much you slay my life!! and check out my fan page @loey_lane_fanpage", "baileyfalene": "If you could live one place, where would it be? Ily queen💓", "kamivicious": "How do you stay so motivated and positive with things going wrong and people saying awful things? I cry when people imply something mean, and the world keeps showing its true colors with hate. Idk how to stay afloat in all of this. I know no one is perfect but you're so positive and bubbly. It's so cheerful and always makes my day! If I could just learn to love myself and this life I'd be so much better off. 😥", "maddiefelss": "how do you stay so confident ?!", "_nicoleherbert": "YOUR SO BEAUTIFUL", "carlyhaugen": "Would you ever come to Canada? More specifically Vancouver BC?", "raynalee___": "what is one makeup product you can't live without? love you sm, loey💓", "specificnwphotography": "Where did you get the hoodie?", "x_x.wolfe.x_x": "Oml you look so coot!!😄 Hi Loey! If you see this my name is Keeley, and I love you oh so much! You helped me with my confidence when I needed it most and for that I want to say thank you. I guess my question is do you have a P.O box and if not will you be getting one? Hope you have a wonderful day!😘😘. ~Keeley", "_obnoxious_panda_": "What is one piece of advice that you can give someone who is trying to love themselves and there body ? Much loveeee btw your amazing 💕💕💕❤️❤️❤️", "leaschlitt": "Do you think you'll make another body positivity video soon? @loeybug", "allie.palmerr": "What does Heaven look like to you?? ❤️❤️❤️", "kalynngiana": "Do you have any hidden talents?", "katie_peters21": "What advice would you have for someone that is also moving across country?! LOVE YOU GIRL💜💜", "lovemegananne": "If you never found YouTube, what do you think you would have been doing now?", "allisun_shined": "How short do you think you'd ever cut your hair? Love you sm 😍", "land__angels": "How do you deal with bullying and looking a family member??? Ily sm Loey plz plz plz answer my question ily 💞💞💝💝💞💝😍🙏🙏🙏🙏", "avelencbf1": "wtf", "ky13.6": "Who is your favorite singer? Ilysm Loey 💖💖💖💖", "kellia.hoyle": "How did you learn to have self confidence and not compare yourself to others?", "chloe.mxrgan": "What is your favorite book? Favorite Author?", "loeyslovebugs": "I've been waiting so long for u to post this pic!!!!!!!!!!", "mia_garcia21": "Would you ever come back to Texas cause I live in Alice so I could meet you", "chubbicanadian": "Favorite places you visited?", "toriioriori": "What is your favorite inspirational quote that helps ground you? Also, when are you coming back to NYC?? Love you! 💛☀️", "fauxillumination": "when faced with negativity, how do you deal with it? do you ever feel brought down about it despite your strength? you're such a beauty, by the way! ❤️", "emotionlordx": "favorite place to get clothes from?", "naturallyaly": "What is your favorite story to tell people? I absolutely love story time on your channel 💕💕💕😘", "vve_are_138": "You talk about being natural and all but why do you out on so much make up not trolling just asking?", "bella_raeside": "When was the last time you experienced something paranormal??? Love youuu💕💕", "aditixs": "Do you like to travel? Are there any places you would want to go to? ILYSM!!", "deenarosenthal": "How did you learn to love yourself no matter what your apperance was? 💘 Love your videos.", "kristinthehuman": "Ps I love you", "jackieamaro_": "Do you have a P.O box?", "duncan.sbeth": "What are your religious/spiritual beliefs, if any? I've always wondered about that with you :)", "__haleytaylor__": "My idol <3", "_gracie_1016": "Would u ever get rid of Ava", "repost._.loves._.us": "my question have u had any more paranormal experiences or with ur doll", "tori_babbbe": "how can i gain confidence like you 🤦🏻‍♀️", "klen07": "What is your favorite thing about being a Youtuber?", "mardi.affendi": "Paranormal experience that has recently happened to you? 💛", "brerui_": "Do you ever want to change something about youself? Anything major or minor? I also want to say thank you for helping me over come a few flaws that I struggle with. 😊", "_lena_ll_": "Wow you really have a big confidence", "paytonparker55": "What is ur fav brand to get clothes from", "alwaysandreaig": "What is your number one personality trait you look for in a true friend? @loeybug love you by the way ❤️❤️❤️", "carrito_caro": "Are you going back to blonde?? Ily", "72yearoldgrandmawhocancook": "Would you ever go on tour like girls night in?", "karademary": "Do you watch the walking dead? If so what's your favorite character?? @loeybug", "llmaslover": "Where does your fashion inspo come from?", "tara.jeann": "When was your first kiss?", "zzilcat": "@loeybug do you ever have off days where you just don't feel good? If so how do you power through and get past it? Btw you're fab❤️❤️💕💕", "michelleythehippie09": "What are your favorite lashes and lash glue?", "d.diannee": "Do you have a po box ?", "northwestskyhigh": "How did you start working with forever21?", "simoneeturcotte": "What's ur fav clothing brand/clothing store? Btw ilysm! <3", "jennellecrawford": "what's your favorite pasta dish? 🍝 love ya loey! 💗", "_sophiephillipss_": "A fire happened you have to take 3 things❤️what would they be? P.S ily soooo much xx @loeybug", "saxyz172": "What is the meanest thing someone told you on the internet?", "sara.medinaa03": "If you could meet your favorite band or singer who would you want to meet? @loeybug", "nagrom.snillum": "Any tips on puppy house training. I've had my pup for ab a month and I've gotten no where with training. My mom won't do puppy pads and my dad is getting fed up with it. So I really need some advice. He's so stubborn🙄 btw we have a miniature schnauzer too and ily and your. Ideos💖", "marissa.exe": "What's your favourite brand of makeup to use?", "kira_roddy": "Are you thinking of getting any new dogos to join your family ?🤔", "emmahienola": "if you could meet any celebrity right now who would you meet? ☀️", "sophiaduppee": "You win 5 million dollars the same day aliens land on earth and say they're going to blow it up in 3 days. What do you do? ❤️💛💚💙", "wellskathy71": "What in the Hell are you wearing", "natalieanne124": "Since bopo has its on and off days, what do you do on the days where you feel not so great to feel better about your bod", "maddie__rose6261": "Will you be my friend Ilysm", "bryannaxmendozaa": "If you never started YouTube... what would have been your career instead? Or Hobbies that you have a passion in that we don't know about? Thanks and love you . 💗💗🎀🤷🏽‍♀️", "paigevigliotti": "how old were you when you experienced your first paranormal experience?🌸😁", "kayduda": "What's your favorite meal of the day?", "kira.trinice": "How did you get into modeling?", "ledfootlindy": "Are you happy", "debbie._0205": "What's a dream of yours? Something you still want to do really bad", "killion_von_doom": "Where do you get your clothes", "choconinja123": "How was it like the first time when you dyed your hair?", "queenjaidabeth": "Where can I get the confidence and make up skills that you have?", "alyssakay0403": "Do you have any more haunted cabin stories??!!!??", "_elledenise_": "What is the scariest thing that's happened to you lately?", "lillynwoods": "how have you been doing lately?", "yks_skyy": "THIS IS CUTE", "janacalifornia": "How do you get your landlord to agree to more than two pets? :(. I can never have more than 2!", "kate_moss24": "What are some ways that you try to stay positive even when it feels like the world is crumbling around you ❤️❤️❤️love you", "thesavchamberlain": "Would you rename your doll Ava if you could?", "ashayy.xo": "what is your favorite season?", "x.liwo.x": "How do you feel about people who judge you for being comfortable with your size?", "talinm17": "How would you recommend starting with makeup if you've never really put on makeup before (techniques etc)", "niyatip.18": "What is the most annoying things that people say to u", "hello_justie": "What are your favorite spooky movies/TV shows/books?", "lillygshel": "How'd you learn to embrace who you truly are?", "727kellyj": "Would you ever go back to your old house and do a tour?", "ayyodredre": "If the whole world was listening and you could only say one thing what would you say?", "meganposhh": "Will you be my bff? 😋☺️", "ciara.eichten": "What is the scariest paranormal thing that has ever happened to you? @loeybug", "cbiscuit.xo": "How did you get the idea to start YouTube? Any tips?", "alesjunkdrawer": "What's your favorite/ least favorite thing about living in California? Love you💓💓👋🏽", "katgirxn": "Would you like to visit Puerto Rico 🇵🇷? Btw: you are an inspiration for me", "50shadesofdaisyyy": "Would you ever do a meet an greet in Fresno,ca ???", "imnotmegann": "favorite makeup product?", "avaang3ll": "What is your favorite memory about your dad? Or your mom? Love you so muchhhhhhh! Can't wait to see the viddddeeeeooooo", "avery.huff": "What's you favorite lip product you've ever used? 💋 xoxo Ave", "bonnaroo86": "If you weren't a YouTuber, what would your dream job be?", "adrianna__elizabeth": "What's your secret on staying positive and happy even when circumstances in your life are not going the way you'd like them to? Btw I love you girl been watching your channel for a while now❤️ stay beautiful❤️❤️❤️❤️", "biancaxluv": "do u have any tips for self love? you inspire me so much loey thanks and i love you! 💓", "supimlexx": "This look is cuuute @coriannaross", "paulinamclark": "Cuuuuuuuuuuuuuytttteeee", "vivianmstewart": "Were is your favorite place to travel 2 Ilysm", "krissyferg26": "What places would you like to travel to out of the country?", "oliviakalaniii": "what's your favorite memory in childhood? :) ily!!!", "sarah.w_.w": "Where do you want to visit? P.S I love your videos and you❤️", "official.sandyyy": "What clothing style do you like and what was one thing you wanted to be when you were little btw ilysm❤", "thehaileyhronnow": "What has been the most surprising thing (good or bad) about moving to LA? ☀️🌴", "julastic": "What do you do about chub rub? Love you xx♥", "maddyvae": "Favorite music genre? If not, what's a fav song from each? 😘😘😘", "faith_ihli": "How long did it take you to truly love your body? Love you girl you inspire me", "hannah.beall": "Religious?", "kaydence.rebiejo": "What is your favorite book/series and why. Plus would you recommend that anyone should read it??", "sphiathmas": "what are your favorite/least favorite aspects of being a youtuber?? btw i love you so much you have helped me out so much!!! ♥️♥️♥️", "mari._5": "Have you ever spoke about how Annie came into your life? Can't remember lol @loeybug", "han.leigh_": "Do you want to have kids one day, if so what would you name them?", "phoebejaclyn": "Do you ever have days when you just don't want to do makeup or hair? ILYSM ❤️", "nicolebanser": "How are you so beautiful? ❤❤", "alexisbakerweekly": "What is your advice for oily skin ? The foundation product would be best?", "_dianashark_": "What keeps you going when you feel stuck and lost?", "danciingqueeeen": "What are your top 3 favorite stores to shop at?? ILYSM❤️💘", "_jessica.jordan_": "What's your fav song right now? ps: I love you 💕💕💕💕", "karlee_joan": "Any updates from the crappy moving company?", "keegirl17": "Because of my size I get so much hate for it how do you not let that get to you and just forget about the bad and think of the good?", "lilytepas": "How do you deal with family members who body shame?", "katedinan.x": "How do you stay happy?", "kaitlynsinsta": "Do you have any funny guilty pleasures? Like a song or food? :) ♡", "hannahxpiercex": "What's your real first name??", "faith_jochem": "Favorite hair style? Straight or curly?", "timswifey01": "Do a video on all your pets! The pigs are cute!", "_tiffanycp": "What are your favorite shows right now?", "jessicaraepearce": "What are your plans for summer??", "farmantmk435": "Beautiful", "mb.1112": "What's your favorite ice cream flavor? Love you girl ❤️❤️", "ashleymarieford": "How do you feel body confident on days when you may not feel confident about your body? ❤️😘", "meaga_n": "If you could travel anywhere in the world where would you go? and why? Ilysm Loey❤️", "__arid__": "Slay girl 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "rogers_nic": "How do you stop the negative self talk ?", "bk.hexberg": "What's your favorite song rn? 💕💕💕❤️❤️❤️", "yurr.natalia": "If you could live anywhere in the world where would you live? Ilyssssssmm ❤️", "ariaufiero": "Do you play any instruments?", "andreabmurillo": "Where's ty?!?!", "emmie.scharig": "What's your most embarrassing moment as an adult", "_juliehewitt": "What inspired you to do YouTube and what's your favorite part about doing YouTube? ILYSM❤❤❤", "makayla.gonzales": "do you have any advice for body positivity?", "gcswade": "What are your biggest tips on feeling fully confident and beautiful in a bikini? (LYSMMM❤❤)", "my_midnight_song": "What advice do you have for people who can't do eyeliner (or most makeup) to save their lives? Ps ilysm Loey!", "reagan_richey": "What is your favorite color and do you like Broadway musicals like Hamilton?💗💋", "sydney.pumper": "what do you think you were in the past life?", "meghann1_6": "Would you ever consider living in another country??", "_campbellelizabeth_": "What are some of your biggest hopes/plans for the future of your channel?", "maddyrobertsonn": "How did you build up so much confidence about yourself (don't get me wrong your so beautiful) but it's really hard to get comfortable in your own skin and I want some advice❤️ and I love you more than words can explain😩💗", "jess14_xo": "What are your favorite bronzer/blush? I lovey you loey you are an amazing person💕❤️😘😍 Will you do more paranormal videos?", "ally.degruise": "What are your main tips for confidence at the beach??", "selenaajt": "who is your favorite singer? And also, what is something you can't leave the house without?", "kaela.valle": "If you are planning to visit Texas would you do a meet up? 😁", "leslieahoyer": "What your middle name ? Can you follow back me ? I love you so much", "min._.fang": "😍💯🙌🏼", "fkn.beesechurger": "Will you do a \"how I did my makeup in middle school\" video? Please???", "yellowbeauty97": "What are your favorite top 5 lipies to wear???😘❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️❣️", "rachelerinharris": "how did you start your youtube career? any tips for those who aspire to inspire the way you do?", "labeauteannarose": "What inspires you to tough it out through the rough? How did you begin to do body positivity?", "xempendryx": "What's ur fave thing to do apart from YouTube ps I love u ur my fave YouTuber xx", "jvo.ang": "How is it so far in Cali?", "allie.t.123": "Most recent paranormal experience?", "chloe._.sutton": "What was the worst paranormal experience you've ever gone through? Ps ILYSM", "maglytle": "what's your favorite makeup brand? would u ever consider creating your own line of makeup?", "kateee.brownn": "What is one animal/pet you've always wanted but never had?❤❤❤love you", "liv.kalemis": "What's the craziest thing you have done for money? Haha ik you're not the type of person that bribes but I thought it'd be a fun question! Lots of love ❤❤❤", "vitoriacastellon1": "The most embarrassing situation you had to go through?", "___emmawhite___": "Are you planning on ever having kids? If so what are their names going to be? (P.S. ilysm)", "pretty.vampire": "What's your favorite makeup brand? :) ❤💜💙💚🌙⭐", "asweetmadness": "What conspiracy theory do you most believe in?", "lorenduhfresh": "What's your favorite thing about LA? Love you sooooooo much 💕💕", "irenehern_": "Do you have any advice on dealing with your significant other leaving for deployment!", "kaaf15474782": "👍", "the_masked_nymph": "Favorite Disney movie?", "avery_beau": "How do you combat hate? Ps illysm", "yorkpeppermintjessie": "How do all the shopping without mentality breaking down? I have such a hard time staying positive when it comes to clothes shopping", "doryduhownik": "What's the scariest thing that's happened to you on Disney world????", "dxwnwatts": "If u go on tour in the future would u be willing to come to montana?", "jmirage75": "ILYSM❤️😍😘- how did you get so confident with your body and even able to express and show your body to the whole world so brave.", "sallyrosewolf": "Any tips for posing/flattering angles in photos? Especially for curvier girls? You should do a video on that!", "kayla_.shelton": "When you were a little girl, what did you want to do when you grew up? I love you so much Loey, thank you for doing what you do!", "gracenme1": "How are you liking California? @loeybug", "_madi.nelson_": "I love you so much loey❤️😘 -- how did you become so confident in your body??", "maggiecheyenne": "Favorite snack food? Your goals for the next five years? Love you ♡", "aundrea_mk": "If you had to use one drugstore and one high end makeup brand for the rest of your life what brand would you choose", "melanyeperez_": "How long have you've been doing YouTube??", "nicolemajkszakk": "What paranormal experience made you feel most comforted? Btw ilySMAnd you are so freaking gorgeous", "angela__marie__xo": "I have no questions, just here to tell you that you're absolutely stunning and such a positive inspiration for women today, I hate the pressure we ladies are under to be size 0s because of what we see portrayed in the media as beautiful, it's not for everyone because thats not what everyones bodys look like and thats ok ,but you show girls you can be beautiful inside and out no matter what size you are, beauty comes in all different shapes and sizes, it starts from within, then shines to the outside 💜 thank you for keeping it real, keep on rockin pretty lady! Xo", "maya.ursem": "How did u get all of your self confidence? Any advice to increase self confidence? Btw Ily💙", "brooklyn.giesel": "What did it feel like as you started to get more and more famous?", "jilli_russell": "Hi Loey! I love you!! If you could relive any moment in your life which would it be and why? ❤️❤️❤️", "leah.2s": "How do help your self to keep good mental health? How did you overcome bad mental health if you've ever had any?? I love you and your channel so much!!", "kayla.sullivan_": "Do you like reading, and do you have any book recommendations? Ilysm😘", "alianahhhh": "how long have you been into makeup?? :)", "tilyacim": "Are you ever going to do meet ups or meet and greets?", "fi.onascott": "You look so beautiful loey! Ily and your videos! When I'm sad or bored I go to your channel and that gets me happy 💕", "knm_nikki": "Will you be going to playlist live dc? I want to see youuuu!", "sjbanks81": "Would you ever go on tour? Ilysm!", "rrachel.craigg": "can you adopt me", "jessytbeauty": "Hope everything is going great. Can you please give us advise on how to grow, make good content and make money on social media, instagram to be specific. I have been trying to do instagram for a little while now but it doesnt seem to be working too good. Please help me. Love you💕💕", "alyssaschieffer": "What's the craziest thing you've ever done for a boy?", "alex._.sloane": "What is your lazy day make up routine?", "whit_n_xo": "Puede respirar?", "bree._.noelle": "Do you use any specific strategies to deal with your anxiety?", "lauren.wloszek": "What's ur favorite toothpaste?😂", "abbiexx69": "How do you deal with the paranormal things in your life?", "k.ennedyroberts": "summarize yourself in 3 words, btw I love youuuu💜💜", "haleyannaa_": "Top 4/5 holy grail makeup products! Like if you went on a trip and forgot all your makeup, what would be the first few items you buy and why ❤️💓 love you Loey", "hannah__e__ts": "We share a love for Disney😁 so tell me who is your favorite \"Disney Villain\"?😈 And who is your least favorite villain 👿", "caithendersonn": "how do i get money quickly so i can buy all the clothes from you closet because girl you poppin' !!", "calliee.mcdonald": "What's your favorite memory with your father? ❤️much love Loey❤️", "joanna.m.g": "What was the first paranormal experience that happened to you? (If you remember) ♥", "lauren.rene": "have you ever thought about opening a depop to sell clothes/ makeup you don't wear or use?", "michaelaa57": "When are you coming to Denver?", "kiara_railyn": "What was your worst relationship?", "rylan_nicole12": "What is your most embarrassing moment ?? Ily Loey, when I watch your vids they instantly cheer me up!💓", "itsmaddysliife_": "What's your favourite place in London???❤️❤️❤️Love you", "xojesschittxo": "What's your fave memory from the past year? Love you girl!! 💜💚💙", "jessiebookout": "Can we get an update about your book?", "sarahdadalto08": "What new content are you planning on putting out on your channel?!", "katelynlarue": "what is your favorite song right now?💗", "liv_curtis13": "What do you do when someone body shames you", "jennygroen": "If you could choose a day full with the things you always wanted to do, how would you fill your day from morning till night?", "taz_deanx": "If you could be a Disney character what would you be ps I love your videos 💛💜💛💜💛💜💖💖💖", "cxm.fb": "What is your scariest paranormal experience??? ps luv u 🌹💜", "jessyisabell": "What is your favorite childhood memory 🌸", "brittneydrew": "what are your favorite foods for summer???", "ameils24": "Loey, this is something I've been thinking about for a long time. I notice that you, and other members of the plus sized community, have very slim faces, and prominent jaw lines. (@lateciat @theashleygraham & others) I am also plus sized, but do not have a very strong jawline, and I believe it would make me more confident if I did. Do you think that plus sized women with tight defined jaw lines are considered more beautiful, since that feature sort of 'clings to' the original ideal image of beauty that is mostly presented on runways, and magazines? I just feel like plus sized women who are blessed with a defined jawline are more easily accepted socially as beautiful, as opposed to a plus sized woman with a droopy jawline, or one that appears nonexistent. Let me know your thoughts on this. I've been curious to what you and others think for a long time. Thank you.", "gillianandlife": "If you ever got to have lunch with a celebrity (alive or dead) who would it be?", "alxis.pappas": "What is your aspiration in life?❤️", "cloudropss": "What's your favorite kind of chocolate?", "aiden_hatley": "Will you adopt me??💖💖", "caprs": "Confidence tips x", "damien1819": "So beautiful", "elizabethrileigh": "If you didn't do YouTube what job would you have?", "shelbdreher": "have you ever turned on notos for a fan", "emilyandropolis17": "Your so gorgeous ❤", "shaedowning": "what is the thing that keeps you most motivated in your life right now? ps. ilysm!!💓 @loeybug", "sunshinestrikes": "Would you ever sell all your makeup inventory if you were in a really tough pickle? Love you <3 <3", "lyss_michelle": "What is your favorite Disney ride?! 💕💕💕💕💕💕💕💕💕💕", "its._.savi": "Where did you get Anne and Mach? And will you get anymore animals? ILYSM 😘💜", "myfriendscallme_meg": "How do you sleep at night with all these scary experiences?", "lana_salinas": "If you can ship two Celebrities who would they be?? BTW ILYSM❤️❤️ @loeybug", "_kathryn99_": "What is your favorite makeup palette that has come out this year? And love you 😘", "_jana_henderson_": "@ukuleliz or at least story times of her playing with ont", "jadecaitlynmua": "How have you been? P.s I love you thanks for making me smile", "katiemichelleee_": "what is your favorite makeup brand? i love you so much 💘", "audrey._mae": "When is your birthday and how long have you been on YouTube? Love you!!! ❤️😉", "_annika.c4_": "Are you going on tour?", "chibimistress": "What your favorite comfortable bra type? I've been trying different bras like bralettes and wanted some suggestions? Thanks!", "gracebowden_xo": "Favourite season??", "skylynne13": "How are you so confident!? 😘💜😍", "jaedaxx": "What is your workout routine? I'm about to retrain to play softball again after an injury and I wanted to know what I should start with💕💕", "rachelrosee": "If you were to travel anywhere right now - where would you go ?!?!?!?! @loeybug", "mr.leee711": "😍😍😍😍😍", "elsie.thomson": "Paranormal wise what's the worse thing that had ever happened to you? @loeybug", "ukuleliz": "would you ever do a video of you playing with an ouija board", "empresspamelaallhoney": "Who is your target audience? What about you makes you successfully connect with your subscribers? How do you define authenticity as a YouTube personality?", "ilikechickentaquitos": "I am on the bigger scale of plus size and I get so nervous and scared to walk outside in an outfit I really wanna wear. Has that ever happened to you and what do you do to get rid of the nerves of showing your body?", "momita.paul_": "Favorite makeup brand currently?", "rvarson": "Would you ever consider doing a video with the physic twins to get answers about all the paranormal things in your life?! Ilysm ❤️✨", "bratzgoree": "Do you have stretch marks and if so, have you ever felt like they brought down your self confidence? I feel like i'm the only girl that has stretch marks out of my friends.", "liylahdavis": "when u have \"scary\" dreams do they scare u", "jannenga.nora": "What was your worst habit as a child or now?? (love you tons💓)", "matthewlaraa": "How do you make the most out of nothing and find the light in the tunnel thru your life right now ? Love you loey❤️", "kspanishmami": "MOMMMMMM 😭😍😍❤️‼️", "cathurt_2611": "First of all, I love you with all my heart and I wanna meet you so bad!! 💖 I want to know what makes you happy in these tough times in your life Becuase you deserve to be the happiest always🌼", "rowenabrabyn": "What is your favourite fashion trend for this summer?", "brii.holmes_": "How do you get rid of stretch marks?", "malloryemccann": "Do u spell gray or grey??", "myaablanco": "If you could be anyone else, who would you be?", "courtney_colli21": "How would you describe your style? Girly, Grunge, Hipster etc.", "courtney_powers18": "How in the hell are you so confident like you SLAY ALL DAY", "hannahshields_x": "Why do you think so many scary and paranormal things have happened to you?? 👻☺️", "abigail_pannhoff": "What breed is Ana?", "kabby_odell": "Who is your idol? ❤️ u", "sulema423": "Favorite drug store foundation for summer??", "ninajenhen": "I miss you and Alex together. What happened ?", "emmaverbekee": "what made u first want to start youtube", "hannahbell1995": "please upload more disneyland vlogs and disney related videos 💖💖", "_ari_navarro": "Can you film a makeup collection video?❤️", "ash.cox": "What's your favorite healthy meal choice?", "darthlochness": "Favorite anime/manga? I've seen many cute characters in your backgrounds!", "lilcarell": "@loeybug", "emmieantal": "I wish I had your confidence, you are beautiful", "a_gradeless": "If you could go back and tell your past self one thing what would you say", "paigetucci": "@loeybug besides tom from the oujia board story have u ever had a name associated with any other spirit you've encountered ❤️😱👻", "jayne.erica_100": "Have you ever dealt with makeup shaming?... and if so how did you respond? (Much love beautiful ☺️💖🤞🏼)", "seepandasrun": "What's your favorite summertime drink addiction?", "changing.over": "Do u have any tips for feeling comfortable with your body and food? I LOVE YOU SO MUCH 💖💖", "aqua_marinna": "@loeybug how do you become happy within your own body and be confedient with yourself? I am on the smaller scale of plus but I have ups and downs with myself. I love being a follower on your channel and would love to hear your advice 💗💗 love Marinna xo", "chaselaurenmorris": "How was the move to la? In particular reason for moving or just wanted to for work? 🤗", "iconic.ria": "My Queen❤", "amelialangley27": "What's your favorite highlighter at the moment? Ilysm💜", "_kkaitt_": "What is a message you'd give to everyone boy or girl who has body confidence issues ? Love you! 🖤", "samantha.c.thomas": "Tips for senior year of high school?", "katharinaxbee": "What's your favourite food? Love you so much ❤️", "ambzmaud": "What's your favourite band??", "114_kayla": "If you weren't doing YouTube what would you do", "micahjoy__": "Have you watched/read the twilight saga? I've loved it since it came out ❤️", "zurisadaisanchez": "What do you know now that you wish you would have known when you were in High School? Would it have made a difference back then?", "marjorie_acevedo_": "What do you think you will be doing if you had not become famous?? @loeybug", "kaya_l_k": "if you could travel the world where would be the 5 places you would go???", "ciramilinda": "is there something that makes you sad but happy at the same time? hope you answer and i love you ❣️", "giordanosammy": "Have you seen any broadway shows??", "the_lionhearted101": "I don't know if you've already gotten a question like this in the past, but...what were you like in middle school?", "ccroissanthoe": "❤️❤️", "bilal.rezam": "💞💗💘💖💝💞", "eldavargas_curvygirl": "First of all just want to say i love you! You were my inspiration to wear my bathing suit without a coverup.. Are you ever going to visit México City? That would mean the world to us 🙏😙", "_meganevans13": "What is the scariest conspiracy/paranormal story you've ever heard/experienced? Like one that really stuck with you! Love you Loey❤", "michaela.mullan": "What are your tips for feeling like you can't trust in a relationship? I have a great guy, but I'm having such a hard time trusting him 😥", "bailey.brunning": "How long does it take you to do your makeup everyday?", "gwen_cecilia": "What's your favorite thing about being a YouTuber? Ps. Love you soooo much☺️💕", "minnamumi": "Hi Loey! How are you? ❤️ Lots of love from Copenhagen Denmark ❤️😘", "_.em.anne._": "i would 😍 @lilhoza", "hey.florencee": "Are you an all nighter or an early bird?", "log.ness.monster": "Are you going to playlist live D.C.?", "nicholejacklyne": "OSKZKSKSKSK🚨🚨🚨🚨😩😍", "masha.prima": "What is your fav place to travel to?💕✨", "missmellydoll": "You glow with so much beauty 👑😍", "marilouven": "What is one life experience that you've had that taught you the most ?", "diet_prada_tm": "What is your favorite makeup brand", "shivaanniedevi0228": "How did you learn to be so comfortable in your own skin? This is something i struggle with, but warching your videos help alot. Thank you.", "rafaelkieds": "😍😍", "sophiaferraraa": "what activity would you like to do but never tried?", "whotfiskat": "What achievement are you most proud of?❤️❤️❤️❤️", "kiarahearty1": "What country would you like to see? Ly xx", "jesalynn.v": "What is your most awkward fan encounter? Btw Ilysm Loey! 💗💗💗", "mmyer0612": "Are you and Alex (learning to be fearless) still close?? I started watching her channel after your London vlogs. I just love her!!", "jessica_blank": "Will someone be living in your dads house or will it remain empty until your visits?? Btw I love you!!", "amf93": "If you could go back and tell the child version of yourself one thing, what would it be?", "briannadusk": "How did this journey begin for you? How did you end up YouTube famous? Any advice for someone looking to pursue a plus size modeling?", "owlcitykat": "How much longer do you plan on doing YouTube?", "alissa_copeland": "How long have you been on you tube?", "mliljat99": "Would you ever travel to Iceland?😁", "danikins__": "How does it feel being a face of the body positivity movement? Does it get overwhelming sometimes or do you love knowing you're inspiring so many people to feel comfortable in their own skin?❤️", "abbyy.snyder": "If you could change one thing, what would it be?", "wali7907": "Very nice", "katniss0826": "What was your inspiration to start YouTube? ❤️", "mary_daci": "Happy Sunday to you and your brother 😘", "abbyymcampbell": "Fav hobbies?", "skyeknights_": "What are some of your favourite Mandela effects?❤️", "simply_a_peach": "What is your favorite inspirational quote? 💕", "nuorme": "First of all I love you loey!!! What's the scariest thing you have went through out of all your paranormal experiences?? ❤❤", "aeia_28": "How do you feel about your new hair color now? I absolutely love it loey 😍💖🌸", "kay.siena_21": "I love u Loey!! What is ur favorite creepy scientific phenomenon, like the mandala effect?", "magalineiteler": "Beautiful", "lola.kinney": "Are you into conspiracy theories? If so which are your favorite", "presleyyjune": "Would you be my internet best friend?", "billiebob.st": "What did you wanted to do before youtube ?", "katrinaa.gagnon": "Have you ever thought about getting any tattoos? If so what would you like to get?☺️", "luixa.__": "If your to YouTube career was to end ( hopefully it doesn't ever😂)what career do you think you'd pursue instead ?", "kellyblanchfield": "What is going on with your marriage?", "pamelabrookeee": "What has been your go-to makeup recently? I love you Loey!!!❤", "melodramatic.angel": "If you had to choose between doing your brows and doing your face makeup which would you choose?", "zabreya": "What has been the most challenging part of your career so far? (Have you ever wanted to give up?)", "jaydee1980": "What piece of clothing did you love and now that time has past, the current you wouldn't wear", "katlyfff": "What is your favorite paranormal encounter/memory from throughout your life? 💙💙💙", "maya_papaya411": "What are any tips you would give to somebody who wants to start a YouTube channel?", "slyn30": "What are some of your hobbies/interests?", "skyee_lewis": "If you could live anywhere in the world where would it be and why? 🚘🚗🚙✈️🗽🗼🌎🌍🌏", "_chins_up_buttercups_": "Will you ever come to Nashville?", "mrs_jennifer_diruzzo": "Do u think im pretty?", "a.nnasf": "Honestly just how are you right now ? ❤️", "brittanykaye829": "What is the best piece of advice you've ever received? ☺️", "anastasia04xo": "What is your favourite thing about LA ? ❤", "justssophie": "what is your favourite song atm?", "katt_stone": "What other countries have you visited?", "xjade_mariexx": "What's your favorite bikini?? 💞💞😍", "hanne.hole": "who is your favorit animal?❤️🐰", "dionlayne28": "Because i come from such a paranormal family/background, do you animals ever alarm you first? I know my dogs do 😅 love, love, love you!xx", "rxo_0": "If you had to choose one clothing brand to wear exclusively for the rest of your life, which would you choose?", "erin_mackenzie_": "Coffee or hot chocolate BTW I love you", "anna_v.g_": "How are your little guinea piggy's doing?❤️ Love from my little zoo in the Netherlands🐠🐶🐭🐔", "ilovebabies98": "Hi Loey! I love you so much *hug* what advice do you have for being an adult? Are you feeling better from everything going on? Hope you are.. you are one of the sweetet people I know in the world and I just wish you the best. I love you. I hope you see this :(", "diva_t523": "What eyeshadow do you have on?", "julia.mylene": "If you could go back to a moment in your past, where and why would you go back to that moment? I love you so much, you're an amazing and gorgeous girl!! Thanks for helping me starting to love myself. You're such an inspiration!! *hug*", "silver.opara": "This my email silverboy191@yahoo.com", "christinanicholee": "How do you deal with the paranormal things that happen to you??👻 I'm such a scaredy cat I would not be able to sleep at night let alone be by myself! Love you! 😘😘💕", "captainniamhthreepwood": "The accomplishment you're most proud of? Xox", "jayblissy": "If you can bring back one historic icon who would it be ❤️❤️", "amanda4urviewing": "What are you going to miss about summer? Are you excited for anything in the fall? I can't wait to buy pumpkin spice fabreez!", "syd.distic": "Where do you get your fashion inspirations from? This look is so freaking cute. Love you! ❤️", "kimberlyellendale": "If you could go back in time, what would you change in your life? Or wouldn't you change anything? Much love, sweetheart❤️ You inspire me everyday!!", "hockeymakeup": "If you only had to use one brand of makeup for the rest of your life, what brand would it be?", "heyy.its.ash": "What was the first thing you did to become more confident with your body?? ilysm ❤️you're my idol Andy would mean so much if you followed me back 💙💙💙", "lxciaaa.a": "How do you deal with people haying on you, not because of content but because of your looks? I love so much loey, I have been watching since 1K ❤️", "beccymaexo": "Im going through a lot of issues with my body and excepting it do you have any advice on how to be plus size and be comfortable? Love you and your videos ❤️💖❤️", "lindaefox98": "If U can make one dream alive, what it would be?", "irene_berzi": "3 things you love and 3 things you hate about summer ❤", "lilhoza": "would you ever hangout with a peasant like me 😉", "kendall_fireeee": "what would you say to your 17 year old self?", "aliciamakeup16": "I'm a bigger girl too, how did you make your self so comfortable with yourself? Love you💗💗", "waistcoat_dave": "With all the followers/fans you have on YouTube, Instagram etc, do you ever find it difficult to stay grounded?", "afridi_ishfaq": "Cuuuuuittttteeee 1", "laurenj.w": "What are you most excited for this summer??", "ayvette_xo": "Advice for plus size girls who arent confident enough for bikinis?? Ily!!", "stombie89": "With all the scary and paranormal things you talk about in your channel, do you believe in spirits/ghosts and if so. Do you believe in other paranormal/cryptozoological things?", "madaraaa_n": "How are the creepy baby dolls going? Love you♡♡♡", "bindiloo_": "What advise would you give someone who has zero confidence (me)?", "jessicaruthdawes": "Will you ever come to the uk again 💜💜💜💜", "reanah.abu": "do you think that paranormal things will continue to happen at your new apartment?", "aida_kaufmann": "so pretty 😍", "therealicetre": "😍", "gabby_nichol": "Who is your style inspiration? 😘", "sashathefck": "What's your favorite actor's?", "amber_braddon": "@loeybug what made you so confident with your body? I'm no were near as confident as you, tell me your secret! PS I love you, and your ghost stories are so inspiring💕", "karyarce12": "Was it hard to gain so much confidence and self love? Love you, you're my inspiration. ❤️", "skat3_bak3": "How did you become so confident in yourself", "brnsndvl": "Would you consider going vegan?", "elle.mclaughlin03": "What is your favourite movie that never gets old ? Xx 💗", "charlottewoodman_": "Does that jumper keep you warm?♥️", "scott.mj02": "Which Disney movie would you want to have a remake made for?", "_rankenfile_": "what's your favorite matte lipstick at the time? 🤗 I love you Loey! ❤", "heyy.its.carlsss": "How old were you when you first started to do makeup? ily💜", "aysha_siraa": "Where do you get your outfits from? Love your style. Love you! 💛💛💞", "leilawebsterx": "What's ur favourite eyeshadow pallet", "kailebbryant": "Who is your favourite fictional character and why? (can be from any movie, book, comic etc) Thank you so much for your videos and being who you are. I've missed a couple of weeks worth, because my Nanny passed away last Thursday - she was basically my mum and I'm so cut up about it. But last night I watched a few of your videos, and it really took my mind off what was going on. I don't think you understand what a positive impact you have on others. You are a truly beautiful human and I love you so much ❤❤❤", "k.dori0401": "*if", "jillwhosoever": "Do you have days when your not body confident and how do you handle it? Ps you are the sweetest and I wish I had the confidence to wear the outfits you do.", "___milica_r___": "Your favorite makeup product that came out this summer?Lyyy Loeyy💕💕💓💓💞💞", "sophhastie": "why are you so gorgeous??", "georgiabrtrl": "favorite books? 📚xx", "littlemexicanthatcould": "What's your favorite ice cream", "xjoyceex93": "What products do you use to care for and style your hair?", "keshoms": "Hi Loey, I really need your help with something that happened to me. Please check your dm's for my messege ❤", "torrayvaz": "What inspires your outfits? I love your style!", "erinbyrnne": "Hi loey I was wondering how are you and any words for people with anxiety", "_bridey": "Are you coming to England anytime soon?? Ps I love you❤️", "sumeyra359": "What was the last meal you ate?", "nodsha_rebin": "You handsome veryc nice You body very nice", "emma.graham.x": "Vanilla or Chocolate?", "marekcitko4008": "How much u weigh", "marzipan52": "Why did you move to LA? ✈", "bella_jackman": "❤️❤️❤️", "cara_winter_": "What would your 1st choice of names be for your children; boy/girl; if/when you had any? I asked a question on Twitter too and I've wanted to ask that for a long time in hopes of an answer lol, #GlenCoCo #AskLoey", "lexdodd": "Would you ever go on tour? ❤❤", "cliodhna_maccarthy": "Would you ever dye your whole head like blue or pink? Lussssssm❤️❤️ love cliodhna", "fariiha___s": "What made you love your body??(help me I want to love my body like you love yours...)", "anastasia.sampson": "Would you do a collab to make an eyeshadow palette? If so what brand would you want to collab with? Lysm!", "randomgiggles": "The first thing you order at a bar?", "jessfabii": "What's your favorite store to shop at? ILYSM", "kat_adams3": "What do you think the future of YouTube will be? How long do you see yourself being on the platform and what other ventures do you have interests in? Much love from Georgia! 💜", "kayyytea": "What type of outfit and makeup look make you feel THE MOST fierce?! Love ya 💕", "_daniellebattaglene": "What's your favourite word? 😂 love you ❤️", "boutique.desir": "Hello, i am french creator of curvy girl clothes. Look my site pls & follow me🙏🙂", "sophia_fresh": "How was your day? ☺️", "georgia__md": "Favotite romantic movies?", "jovannnah": "WHATS THE PURPOSE OF THAT SWEATER", "laurennnquesnell": "Overall what is your favorite(s) makeup brand? Xoxo❤️❤️❤️❤️", "ilikeavocadhoooesss": "How to stay positive💕", "sougabrielaregina": "Gorgeous!!!", "mikumaku_": "Will you do a house tour? Love you girl💕💕", "kadiiieeee": "If you didn't do YouTube what job would you want ?", "ryleeabarlow": "What celebrity do you most look up to", "kuro_usagi23": "If you could go on a $1000 shopping spree in one store, which would you choose? ❤️", "ellarose_jameson": "What is your biggest fear?", "duaahussainchaudhry": "Whats ur favourite mythical animal? PS: LYSFM", "ahmedzudemahmo": "Noob", "julissaxj": "What is your favorite pair of Jean brands", "stvy.storm": "😍😍😍😍", "martina_kawulokova": "Have you ever been to Europe and what country would you like to visit?", "kyla_michelle1": "@loeybug Who's your favorite Disney princess ? And who's your favorite Disney villain ? 💙💕", "my_life_is_my_babies": "What is your dream in life and how u are trying to make it come true. Love u from israel!!", "marilena_810": "How are you right now?💕I love you so much ❤️❤️🌸💌💗", "karinagso": "Hello I love you 💕😘💕😘 What is your favorite things about summer/ that you like to do?", "soreyapelitedenny": "Would you ever consider making your own clothes line?? P.S you're a total babe xx", "miki_kate_": "How are you doing? Hope you are doing great, love you and thank you for inspiring so many people to love themselves 😘❤️", "ebaynum14": "Will you ever come to Alaska? Btw ilysm💜💛💚💙❤", "myeffulgentlife": "How do you deal with people who used to be your friends? Would you rather be super shady (posting an indirect) or look extra successful on social media knowing they'll see it?", "elizabetharodriquez": "what were your favorite/least favorite trends of 2016?", "9originalsinner": "What or who inspires you to carry on everyday even when you feel like everything is against you?", "shawnabutnot": "@loeybug — Would you rather only drink coffee or lemonade for the rest of your life? (Keep in mind, the coffee can never be black. It'd always have to be a macchiato or a mocha or a brevé or cappuccino, etc.) Love you, Loey!! 💗💗💗", "julidalai": "I'm on a good way of accepting my self as a plus size person after so many years of self hate, I just wanted to ask some tips to really push ne trough and in to fully self acceptance. Love you, you are so strong and beautiful in very way!💕😊", "anayyacs": "What's the scariest thing that's ever happened to you?", "serenacstllo": "what are some songs that helped you get through hard times? btw i love you!", "sophiamullis": "How are you so confident? because I really struggle with mine and would love some tips because some times it's hard to just look in the mirror. p.s: love you videos", "jazmin.loll": "Do you have any tips on how to love your body?? Because you do it so well and I struggle a lot P.S ILY", "michaelaemrich_": "What inspired you to get started on YouTube? Much love ❤️", "sarahglory13": "Would you ever consider going back to school and getting a degree? I just finished my bachelors in marketing! Love you! 💕😘", "_athanna": "Do you ever want kids, if so how many? 💞💞💞", "emily_4504": "If you could have any wild animal you wanted, and it wouldn't hurt you what would it be? I Love you so much❤️❤️", "jordannnnmonroe": "What's your favorite book?", "drawwithmakayla": "Confidence and figuring out who are are, what are your tips? 💕💕", "pariiiiverma": "Any Asian county you want to vist? and btw girl i love you and please do more haul videos !!", "hayleydollx": "Why you such a babe? (Serious question) 😍😛😘✨", "johanna__viktoria": "What is your biggest inspiration atm? ❤💙💚💛💜🖤💖", "sydneedeann": "What is your favorite thing about life?? Love you!!", "shelbymcnaughton": "how do you stay productive?", "kristendanielsonn": "How do you stay strong during hard times? P.S ily! ❤️", "kayllb_x": "How did you become so confident ? @loeybug xox kaylie", "issamazie": "what is the most successful thing to make you happy when you are feeling down? sending live from Missouri, love you girl💓", "equestrian_rubyx": "If you could be related to one youtuber who would it be? Ps... ily sooo much your a inspiration! ❤️", "gcf97art": "Do you have any tips for combining outfits? I mean, I have a closet full of clothes but the only problem is that I have no idea how to pair them together and make the outfit look good. Help!! Lysm ❤️❤️❤️", "lilyc_25": "What's your face makeup product ???", "blondiebrand": "What's your favorite date you've ever been on?💕💕", "cloeyhandro": "How are you doing with everything that's going on around you? Are you okay?", "sxrxh_axx": "Btw I love you so much", "rchelwaldman": "R u gonna have kids?", "_georgiaconnell": "internet dad 💙", "madiisonchaffee": "What is your favorite brand of clothing?", "jalissajxmes": "What's your favorite conspiracy theory", "mfischaaa": "How do you get over your first love? Also! I love you and I think you're beautiful! Hahaha", "lailakarkori": "who is ur favorite character to meet at disney", "amishaharikantra": "What's ur favourite Starbucks drink ☕️ love u loads xx", "kammiii_d": "Do you plan on having kids! Ilysm", "c.spicee": "What feeding shedual do you have for your animals", "kkrtvi": "do you think there was really a turning point in your life when you suddenly started being more body positive and loving yourself - or has it just always been there deep inside? LOVE YOU LOEY💓💞💖💗🌟", "bananafishings": "How are you so cute and lovely all the time? Sending love from Cali ❤️", "_alycarrillo": "Do you ever wanna go on tour and meet people ?", "ellarennee": "Do you have any tips for body confidence?", "mxniquekayy": "Fav makeup products atm?", "nadinecampbell_": "How do you stay so confident ? 😍 you're absolutely beautiful 💜", "alyssadiannag": "What's your favorite snack at Disneyland???🐭🖤✨", "rhiannasay": "What is your favourite article of clothing to wear? Xx", "marvelfangirl_97": "What are your guilty pleasures and if you could have dinner with any celebrities who who they be? P.s i love you so much.", "ameliadeluca": "If you could change one thing about your life from the past, what would it be? Love you Loey!💖💖", "laurenbattagello": "favourite book series?! ilysm you're such an inspiration ❤️", "chicky_leanne792": "How do you deal with anxiety of any kind including social? You are an inspiration", "steven.36": "Who is your favorite superhero?", "itsomarhamed": "since you're literally making a whole zoo what is the craziest animal you're thinking of getting? 😌"}