{"bagbn1125": "جون میده برای سکس", "esmaeilsheykhe50": "Very very very nice", "varishtiyak4": "Curvaceous queen with seduction 🤗", "komorebiask": "Cutttttiiie❤️❤️❤️❤️❤️❤️❤️", "alimostafa7760": "🔥🔥🔥🔥🔥🔥🔥🔥🔥💋💋💋💋💋💋💋", "creon316": "🔥❤️😍", "ravvan54": "Fakn", "ssarang485": "So beautiful ♥ ♥ ♥", "jdas74": "💓💓😍😍", "halacselcuk729": "You are very very beautiful", "ayhankrynz123": "Snow white Mmmmmm licking", "frzy831": "🙌🙌🙌🙌🙌🙌🙌🙌😍😍😍😍😍😍", "spayk00b": "Nice feet", "skobnikova35": "💋", "karime_karim8": "❤️❤️❤️❤️", "mustfaoji": "ilove you❤️❤️❤️", "cesaret250": "🤙🤙🤙🤙", "beefybouldin": "😍😍you look Amazing", "fwdmyn7": "❤️❤️❤️❤️❤️", "abdallah.nadir.58": "❤️❤️❤️", "bernardo.venegas.94043": "Te ves guapa mi chikitita", "sunehri_c": "That video was so good and you are so right❤️", "denilson_1982": "Saborosa 😍😍😍", "luxsor2013": "Nice ❤️👍🏻", "natiur_lavie": "Goood 😍😍😍😍😍", "kaver_tanha": "🌷❤️🌷", "keeleejc": "i love this ! ur gorgeous💖", "maya_r_saba": "I love you loey! I just wanted to say that you help me so much. I have really thic legs like you and I always feel like nobody else has that kind of build and you make me feel like I’m not alone ❤️❤️", "shyfox202": "YAS QUEEN", "simplyisabellab": "ITS 👏 MADE 👏 OF 👏 PLASTIC 👏 TANYA", "sarahlovescatz": "Saw this photo on hot topics website promoting their brand. I didn’t see the hashtag in your description so just wanted to let you know.", "rebekkah4471": "Beautiful!!💞💞💞", "razigarneh": "خیلی خوب👏👏😮😮😮", "passthemilkyacow": "uhh- STUNNING I CANT. stan is an understatement and so is stunning❤️stay true to yourself cus life’s too short to listen to people who are wasting your time with negativity!! i love you loey😍", "ebad_zuwak": "You went so beauty", "brookemckinley2": "You are GeOrGeOuS!! InSiDe and OuT!!!!", "jose.miguel.rojas": "Linda gordita. 🖤", "sugaverypee": "@vanity_moreira", "jimvalentine0908": "Gorgeous woman with lovely legs 😍😊💖", "erikamabob": "Um, where can I get some of that confidence and self love you have!? I wish I was more like you girl. You're perfect 💖", "mahmoodahmadi108": "😍😍😍😍😍❤️❤️❤️❤️❤️hello", "yerubiferrer": "so beautiful 🙌🏽", "aem_dancer": "Awww my beautiful queen 👑 ❤️👏😍I love you 💕", "montanarainjohnsonherrin": "Omg,what a godess", "troutbrenner": "Пиздец слоняра", "foxxyland": "thanks for blocking me on Twitter even tho I've never talked to you??", "shaynalynne": "Beautiful inside and out<3", "krkrynbyl2": "😍😍😍😍😍😍😍😍😍😍😍😍🙌", "1.alex.l": "Omg guys a hippo in its normal habitat", "brhycc": "Linde 🍒🍒", "sage.mcmahon": "I love you", "slp.edwin": "🤢🤢", "productofpanic": "God you're so stupidly beautiful its not even funny.", "sbah43235": "❤️", "emiliarik": "@spencerr___", "graceyy.savage": "A true Queen 😍😍😍😍", "angeliqxpearll": "absolute queen 🤪🤪", "ryanjones1706": "Immense, gargantuan, and vast sound like good things to me. 😍", "averiella12": "I wish I could have the confidence you have,😕💜", "sofiehuffman": "Thank you for this!!!!!! You are gorgeous btw 💛💛💛💛", "chaunieee": "💜💜💜", "avalynn_____": "Your so pretty omg I’m sueing 😭😍❤️", "andreahennessee": "@nikewomen", "erdianj": "Body sxsy i love", "alexfirestorm194": "To you and anyone out there don't listen to the hate. There is so much love out there for you. You are beautiful and amazing just the way you are. If you want to make a change make it for you not others.", "marricookie": "Your beautiful like always loey and you always will be", "seaveyxx_thelimelight": "Preach queen! Oh my God like I can't say, I. Love. You. Enough!!!! Like you're gorgeous, sweet, just A QUEEN LIKE 💕💕💕❤️❤️❤️❤️❤️ LOVE YA @loeybug", "ritacamposteixeira": "you’re so beautiful MY GOD", "repti.addict": "😭😭😭 this is amazing. I’ve suffered from body issues my whole life being overweight and what people will think of me and if I’m not perfect. It used to be so bad that I suffered from severe depression from what other people will think of me. I learned that I don’t need to have everyone love me as long as I love myself but thank you! You are perfect! 💕💕", "aquapuff": "So much yes to all of this! @loeybug, you and @tessholliday are the 2 women that I look up to and instantly make me feel better about myself. ANY time I go to leave the house and I feel so disgusted with myself and don't want anyone to look at me, I think of you two and I am able to step outside my door. Thank you for being so body positive and in such a good and healthy way! I love you Loey!", "paris__011": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "areya_verma": "I think indian clothes will look so beautiful on u ❤️❤️😍😍", "destinylaurajo": "Ughh you’re so pretty 😭 @loeybug", "sannexlouise": "Queen.✨", "lovingloeyyy": "wow a stunning queen go off", "trevilliona": "Thank you so much for being an inspiration to women around the world!!! I wear Nike plus size and I love it!!! I don't care if anyone else is bothered by my plus size body in these clothes!! They make me feel good and I will wear them with pride!!!", "kellyroams_pets": "Girl, you are so beautiful! Thank you for being such and amazing advocate for self love and acceptance.❤❤", "jessica_j93": "You are my queen", "nick.metos": "Love you beautiful !!❤️❤️❤️", "pibkfudge": "❤️", "dreaming_in_1989": "You’re amazing ❤️ So proud to be a subscriber and follower", "leahjoslyn": "I’m not even sure if you’ll see this but I loved your video today. I didn’t realize how much I needed to hear your body positive messages. It meant so much to me, because lately I have just been so down on myself and wanting to get better, but lacking the ability to and your video gave me the push that I needed ❤️", "sophia_12888": "👏🏼", "charlie.commander": "So proud of you for making that video and for calling her out! #bodypositivitymovement ❤️🧡", "anysiaxalvarez": "I stan 😍", "gabrielle_devil": "You out here speaking the truth and killing it. 💙", "stephrodgers78": "@loeybug your beautiful just the way you are xx", "porcelon": "The checker pattern, the flame red hair, the strong and proud message what more could I ask for ❤️🔥", "jaythebaeisgay.4": "A beautiful soul inside and out. A genuine Queen❤❤", "nicvolie": "GIRRRLL I wish I had the confidence you have I found your YouTube 2 days ago and I am obsessed. Big love from a new follower and subscriber", "rockys.pebble": "You're so stunning, it hurts. 😍❤️", "xdorky_pantsx": "I thought we were done with this body-shaming bs! Ew 😰😬 I bet you looked hot asf in those Nike workout clothes babe 😍", "sena.vasquez": "You are gorgeous go offff queennn😍😍 honestly so ridiculous and embarrassing on her part everyone should feel loved, be loved, and feel included no matter what size her article made me want to puke. 🙄 All bodies are beautiful love you loey 😊💕", "brenda._elizabethh": "😢", "jae2ndd": "She only taged nike because that what her eyebrows look like", "avahaigler": "Hunny, you are beautiful and your video had me feel better about my body.", "martinglo1": "Let us see a pic of her❣", "dodsonhope72": "You’re my hero bc mean ppl like that are why I spend 10 min psyching myself up to go into the gym bc just in case someone says something hateful", "twinmamakate": "Watched your video on this today. When I read the article, I was OUTRAGED. You are truly an inspiration, thank you for continuously spreading love and body positivity even when others are so hateful. You truly are beautiful inside and out ❤️", "belle_hollins": "I’ve noticed that women are each other’s harshest critics. You are gorgeous and I bet a pretty awesome person, too.", "_milliebbrown_.cutie": "Yessss loey yessss", "k3ll_f33ls_b4d": "And body type-", "taylor.daniii": "Queeeeen I have that same suit & you look BOMB in it 🖤🖤🖤", "leilani_crazy": "❤️😍", "leahgraceollie": "i could not love this more wow", "xcarlie.spamx": "I wish I looked as good as you💞😭😍", "playa\nVerified": "Verified", "dj_devils.j": "Beautiful picture 👌👍", "keith_reyes2": "😍😍😍😍 be mine lol", "caseyhitchcock": "Can’t love this enough 💕💕", "mary_daci": "❤️ 😘 👍", "sophiaimtired": "yes!!", "selfcaretaurus_": "Ahhh no words 💖💖💖💖", "donna.turner80": "So beautifully written ! Thank yoi", "iammarissafoster": "I'm gonna marry you. Just wait 🥰", "whyamidead178": "# I love loey bug", "kimmie_khaos": "Gorgeous", "_.mara._____": "Gorgeous💕", "sophie_kohl": "I can’t 🥰🥰🥰", "_karawinters": "Omg u are so gorgeous I CAN’T ❤️🤧", "glo97x": "@jameelajamilofficial", "quingeling": "You are gorgeous ❤ your expression say more than words.", "kelseyh2004": "You are such an inspiration, you are amazing. You are gorgeous inside and out. Preach girl. That article makes me sick that people could say such horrible and awful things. Keep doing what your doing. I love how much confidence you have. You are so inspiring and I just want to say Thankyou for being everyone’s voice. You are rocking this swimsuit. I don’t get how anyone could hate on you or anyone plus-size for that matter, your all so beautiful. I honestly don’t get why that women said that you don’t exercise. They wouldn’t make the sports wear if they didn’t. You are such a queen keep doing what your doing", "thicky_nicky1578": "@loeybug I love you so much and ur so beautiful !! 😃your the best", "rmhartesq": "Well said. You are beautiful and strong! I’m sorry for people who can’t look past someone’s outside. They are missing a lot.", "chrissyland919": "Love you so hard.", "jolie_bell.y": "LOEY FREAKING SLAY", "rankin.jessie": "WHAT A QUEEN", "chloe._.nicole04": "go off sis !! you are absolutely beautiful. don’t listen to a dang word any haters say !!!", "yassin.abokhalid": "😘😘😘😘😘😘", "losmaune84": "Marry me please?!", "laceynicholson56": "BEAUTIFUL 🙌🙌🙌🙌", "mayskii": "🔥🔥🔥🔥🔥", "elizabeth_weedman": "You’re so pretty loey!!!!!", "7.aboud.79": "Beautiful 😍😍❤️", "zoe_butler_16": "Oh ok yep so that’s just actually really good", "lakyndanielle": "YES YES YES! 10,000x YES!!", "account._not._in._use._anymore": "Slay with that perfect body you were blessed with girl", "seraphim_bby": "📢📢📢", "_christina19_": "I READ THIS AND AGREEE AS A PLUS SIZE WOMEN IT WAS A DISGRACE OF AN ARTICLE AND I HAVE UNADDED THE TELEGRAPH", "katielynn.t": "Ugh my fave 😭 work it girl. I love you sooo much!! ❤️❤️🙌", "its_me_brazee": "Preach!!👑 I love you❤️", "xx_ella.mayo_xx": "@_skyelovesevie_", "thalias.beauty.shop": "Omg loey I have that same swimsuit I love it. Your rocking it girl. Got it from @hottopic @loeybug", "sohilamiss": "You are just the best👏🏻👏🏻", "lexi_stamp": "You look beautiful ❤️❤️🔥🔥", "_victoriatolley": "Yasss girl 🙌🏻🙌🏻 slay", "tss__06": "Bootiful ❤️❤️❤️❤️❤️🔥", "lilia_ana_10": "Yes bby!! 🔥✨", "_peachy.k_": "I am over the moon at the fact that they have a plus sized mannequin, i LOVE it and i think it’s fantastic! because I’m on the plus side too! And your video, the words that you spoke made me feel more confident and comfortable with the skin I’m in and i love you so much for that, i can’t tell you enough! ❤️❤️ love you queen!!", "misssugartwist": "Beautiful ❤️❤️❤️ I love looking at your pics and watching your vids. You are incredible ✨✨✨", "iitssadriannaa": "You’re beautiful 💞💞", "jaehyuknowhat": "A literal queen 💜 lysm", "elliefreeman010": "beautifullllll girlllll omggggg", "nickyyward": "thank u 💕", "caitlynmostert": "You are an absolute inspiration to everyone around 💕", "moving.my.mountains": "🙌🙌💜💙😍😍", "tktrinity": "The only thing gargantuan is the ego and hate that spews from that woman's mouth and fingers. On another subject, I need to know what colors are used in your hair coloring routine!", "louisejane.k": "WE LOVE A BODY POSITIVE QUEEEEENNNNNN", "monique_apx2": "🙌🏾🙌🏾🙌🏾🙌🏾", "lady_hackett": "Yyyeees loey, so beautifully girl.", "sophie_phipps": "love this ♥️", "victoriashaz": "Loved your video, love this photo, love that bathing suit 💜", "giorgiabortoli": "Preach 🙌🏼", "shayla___b": "Look great babe", "callie______x": "You go girl 💕🔥", "_bertie_69": "But no one really wants an overweight model", "genes1s_rodr1guez": "Slay queen slay", "jdotson21": "Yes gurl yes! Couldn’t agree with you more!! ❤️❤️", "samantha.howard.7509": "<3", "jacy_ford7": "The fact a video has to be made about this is awful. Like plus size people exercise too, we should be applauding such a statement not shaming it. I don’t even understand the logic behind shaming it? You’re gonna shame a brand for a hunk of plastic? A hunk of plastic that’s message is only to be positive.", "candiicaane": "These words girl!! PREACH BABY! I was honestly going to scroll past this picture without a like just because I myself would never feel comfortable in something like you are wearing and figure \"meh I'll keep scrolling then!\" But I stopped and read what you have to say!! 100% stand for everything you say and do girl!!! And you look bomb to boot! ❤❤", "riskyannss": "YOUR SO PRETTY", "notpaige._": "GO OFF QUEEN ❤️", "crooks_doll": "🙌😘🙌 P R E A C H Q U E E N!🙌😘🙌", "hibah04": "Damn! Stunner! And the hair colour 😍 giving me Ariel vibes ❤️❤️❤️", "elz.rxssell": "Woah how the heck r u so amazing?!!! I love youuuu❤️❤️", "xxime13": "As one of those \"immense, Gargantuan,Vast\" People;I can honestly say thank you for standing up for us. And I firmly believe that we are all beautiful inside and out. And even though it's taking me a long time to believe that myself I firmly believe that of others. So thank you so much for everything you do. You are beautiful! @loeybug", "emmaabryleigh": "i love u loey😭❤️", "fyreglyphsdesigns": "what a cute suit!!!", "blackwidowbrookieee": "Work it queen! ❤️", "gizelle.cg": "HOTTT😍🔥", "kacia_may": "Queen 💜", "juliepierpotvin9": "Mami😍", "jaidee_m_lutz": "100% agree plus size women are BEAUTIFUL", "bearybecca": "Loved your video beautiful 💘", "jackie.atoms": "You’re truly gorgeous inside and out 💕✨", "margaritamcheco": "Beautiful 💕🎀", "__allygrace": "Thank you for this!", "brynn_elliott17": "Love you Loey ❤️", "alicat_vixen": "QUEEN 🙌🏼", "seaglassandsadness": "I love you so much. You're so positive but you also talk about things that need to be addressed. Thank you!!", "emzoticofficial\nVerified": "Verified", "cheesy_eyelash": "YASSSS QUEEN 👏👏", "its_me_phi": "😍😍😍😍😍😍😍😍😍😍😍 !!!!!!!!!!!!!!!!!!!!", "adeliahammond": "Hip replacement happens to people of any size. In fact runners have knee replacements more frequent.", "x.lizz_x": "Your such an inspiration to me I love you ❤️", "__thequeenwoman__": "Love your hair 😍", "bethelizabethuk": "Yes to all of this. You look absolutely incredible and i am obsessed with that swimsuit 😍😍", "__nicolii__": "go off sis!!!👏🏻", "alienoothicc": "ThiCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC with 50 thicc c", "brooklynn_shyanne": "Ugh, love you Queen ❤❤❤❤", "minnahaseki": "@ocibojenociii kad cemo na bazen", "phckin.androids": "YESSSSS I LOVE YOU", "hama_etali_": "@mastan.slemany45 ئةوةجية😉👀👀", "this_be_lili_": "You are my QUEEN👑 whenever i feel bad about my body i turn to you and you make me feel so confident. Thank you thank you thank you. A million times. 💕💕💕", "creationsbytiffanylynn": "Your always so gorgeous 😍", "ozzypaxton": "@loeybug 👍😍😘", "x.kaila.x": "I love you loey😭", "antisocialxaimee_": "Omg I love you 😭😭💕", "stella_de_medici": "Red Loey is a SNACK 😍", "johnblogginwatson": "Frickin superb you funky little lady!!! So proud and inspired by everything you do!", "janice7458": "Love this.", "alondra.lleras": "I wish I had your confidence", "serena_221b": "Truth 💖💖", "lexia_makeup": "We stan ❤️", "brionyconfidential": "Yes! I read that article and was horrified that it was written by a woman. We’re supposed to build each other up, not tear each other down ❤️", "staceyjd1": "I always use immense when complimenting something that I think is awesome!!", "trista_connall": "You’re such an inspiration and you have really opened my eyes to how I want to love myself one day. I hope to be as loving towards myself as you are eventually ❤️", "ohbeansadey": "You are 🔥 and an inspiration!!! 🙌🏻🙌🏻🍑", "scolvin93": "Beautiful!!! 💖", "victoriaheathnaturopath": "❤️❤️❤️", "caitlin_ashtonx": "YOU. ARE. BEAUTIFUL 💛", "qmarsi_hamid_": "Omg😍😍😍", "elliehancoc.kk": "slay guuuurl 🗡❤️", "sheisqueengigi": "You’re such an inspiration❣️", "ameliacherrell": "Love the swimsuit on you 😍", "leandraruiiz": "\"Positive.Unique. Confident. She heaves with beauty\" I think used that word in the wrong context but whatever doesn't change the fact that you're a whole queen 👑", "lasalaconfec": "❤️", "beelzebub_ate_my_hamster": "I know this woman is trying to be snide and cutting with her description but \"gargantuan\" makes me feel prettt empowered 😂 Like \"SHE IS GARGANTUAN AND WILL SIT ON YOU IF YOU DEFY HER COMMANDS\" 😎", "datdirtyburrito": "i’ve been wanting to get that exact bathing suit for weeks now but seeing you rock it makes me want it even more", "moooshiie": "Giiiiiiirl 🥳go you’", "rachie289": "I read that article. I was thinking what the hell? 🤷‍♀️🙈", "newkindame82": "You're beautiful inside and out girl ❤ 😊💕💋", "__a.a.s.t.h.a__": "👏", "kadyyynnn": "I wish i had your confidence ❤️", "mariasoshenko": "I love your videos and you ❤️❤️❤️", "jonirodriguez090107": "Cute suit and cute You.", "daniel.k3200": "U are so beautiful like a princess", "mxchellesch": "❤️❤️❤️", "heartchakrahoney": "I have the same suit!! We can match!! 😍😍", "nathanieltitley": "😉😉", "lila.vassallo": "Omg cuteeee swimsuit 💖", "pandaeyes._": "I love you so much", "its_kimburlee": "🔥 Thanks @loeybug for speaking out about this, I actually found this article on Snapchat. It genuinely broke my heart and angered me. I too have been overweight my entire life and have struggled with eating disorders and for someone to come after plus size women with out knowing the daily struggles we already face was awful. Thank you for being a voice to plus size women 😘 #yougogirl", "katielougray": "You are an amazing queen and such an inspiration you beautiful lady 😍", "lareashia31": "Boom 💥 🙌🏽🙌🏽🙌🏽🙌🏽", "carlyjayne86": "I’m so sick of women being judged for every little thing .... if it was flipped and mean had to deal with this I’m sure it would stop a lot sooner .", "olivia.endicott": "You're so iconic. We love you babe 💛", "theamberparks": "Beautiful ❤️", "colin_quinton_": "Beauty is beauty", "chichi.okwechimex": "LOVE YOU SM HUN. KEEP WINNING 🙏🏾🙌🏾❤", "makaylaklora": "🙌🏽🙌🏽❤️", "x.india.alexander.x": "Icon😫💕💗", "lucymaebutterfield": "💗 Beautiful", "rooohoofa": "Your hair color is very beautiful I need number for your hair dye 💗💗", "laurarobin.es": "i have the same bathing suit omg", "cassvx_": "you’re so inspiring 💓 i love you!!", "emilyjadeee__": "Yes yes!! The article that woman wrote about the Nike plus size mannequin disgusted me!! As someone who isn't far off - if not - the size of that mannequin, reading that article made me feel about 2ft tall. I'm so glad to hear people speaking up!!", "jessicadg0326": "Preach!", "abas.rezaei.ir": "😘", "olivia_mielle": "💛💛💛", "miggy8633": "I want you to know because of you I'm learning to love myself more and more each day use to I would never even think about wearing shorts out in public but now I've decided just because I'm a big girl doesn't mean I should feel ashamed to wear shorts it's damn summer time and I wanna wear cute shorts so I'm gonna wear them! Thank you loey you are amazing and so inspiring and positive!", "pipetrh": "YES GIRL YOU TELL EM!!💗💗", "chbabar42": "Beautiful", "beccaxpaezz": "yessssss", "charlotte__agius": "As I saw this I was watching your video", "mia_laugh_": "Word🔥", "scillalara": "Beautiful baby 🥰😊", "katie_etches": "@loeybug I love this. You keep doing you, you’re an inspiration girl!!!🙌🏻❤️", "_valerieangulo_": "👑👑👑👑", "_ac.04_": "You are one of the most beautiful women in the world! Just had to say that!", "gina_irene_k": "Gorgeous 😍", "waterbugg": "B👏U👏T👏FUL👏", "analisepaola": "You are so beautiful and I love you. 💗💗", "faely.daisy": "I love you so very much!", "ainettako": "I love you so much, yesyesyes", "brent_brent_13": "Oh hey I have that swimsuit!!", "jay_jay_journey": "youre beautiful. 😍", "miss_unlovedd": "You are BEAUTIFUL in EVERY WAY POSSIBLE!!!!!!!!😍😍😍😍😍😘💖😘💖😘💖😘💖😘 You give me the confident with who and how I look!😘", "zamira_mcconnell": "A literal freaking queen😍❤️", "conradbutcher": "Your beautiful", "sadiearbour": "we love a beautiful and powerful QUEEN", "xcarriiexx": "😻", "carycheyennexo": "Amen!! Needed to hear this today!!! 🖤🖤🖤👏🏼👏🏼👏🏼", "kayleeorrwhat": "❤️❤️❤️", "farshidtaj8837": "Charming", "wcbav": "You’re so pretty, stop it 😍😩", "chalena.c": "Your voice and what you’re doing with it matters so much 👊🏼 happy to know you and proud to support you girly! 💪🏼❤️❤️❤️", "yourlocalneighbourhoodcrybaby": "Queeen", "perfect11blue": "literal queen 💕💗✨", "stillshelby": "I have the same bathing suit 😁", "anastasiasnstevens": "Godess😍", "guillaumeanaira": "RLLY loved your new video Loey, your just one of those people i’d subscribe like 5 times to ;—; 🖤🖤🖤🖤🖤 btw this Fatphobic needs a life and take care of herself BEFORE worrying about others. Period🖤🖤🤠", "marvelfangirl_97": "Thank you for posting this video, it was both important and need. Hopefully it will change at least one idiotic mind, much like this writer of this terrible article. Numbers should never matter in any situation to who a person is, even if its a plastic body. What REALLY is important is how kind a person is not only to others but to themselves. Again, thank you Loey for posting this video and other body positive videos, they definitely helped me change my view on my body in a positive way.", "curvemodells": "Beautiful 😍💖", "savannahz_spam": "Self love😍❤️💗👏", "mandyraven87": "🔥🔥🔥", "jaxbrignall": "🔥🙌❤️", "lil.liz_": "Yes ma’am! We are just as valid as the rest of em! I mean, I don’t work out but I wanna wear my leggings and sports bras like the skinny girls!", "benjamin_din_over": "Looking cute. Twits can sod off. 🖤", "cassandrascheider95": "Stunning!!!❤️", "erineeckert": "that article really upset me, and i’m very glad someone said something about it!! big girls can work out too! you don’t need to be thin to maintain a healthy lifestyle, just smart and careful, and obviously the person who wrote this article is neither. i love you loeyyyy♥️", "forbes9551": "Gorgeous", "the_albino_crow_": "You go queen", "phantom.flora": "Yes, you babe!!!!! I was afraid of people who thought like that woman for so long, it took me until I turned 28 last year to get it through my head that I might the thickest of my friends, but they all see me as the athletic friend. Thank you for this reaffirming post, I needed this today!💖💖💖💖", "charlotte_x07x": "if i could find the effort to read that i would", "lynie143.inc": "You are so gorgeous inside and out Loey and such an inspiration to me! Because of you I've been able to look at myself in the mirror and takes the steps so I can feel beautiful. As a mother, sometimes you forget about your own appearance and I got to a point where I felt like I let myself and my family down. I've recently started wearing makeup again, working out and just overall loving myself again. Thank you so much for being such an inspiration! I love you Loey!! 🥰🥰🥰🥰", "jillian.kayleigh": "Damn😻😭", "poolboy_theunicorn": "I wish i could rock a plus size body like you 😍😍😍😍", "yoyo_mc25": "😔❤️", "mrsangiebabe": "Gorgeous", "_savannahsmile": "The woman who taught me to love my body. PREACH IT", "_strangealiens_": "You are so beautiful💕", "hayley.pdf": "This is amazing. Thank you 💓", "roserainbow123": "❤️❤️❤️🙌🏼🙌🏼🙌🏼 I LIVE FOR THIS!", "ashley__light": "👏🏼👏🏼👏🏼👏🏼", "surviver14": "You gotta remember its always better to be \"hefty hefty hefty\" than \"wimpy wimpy wimpy\" (from the hefty garbage bag commercials)", "bigzaxsnak": "thank you speaking out about this. I was completely disgusted and hurt to see someone so blatantly disregard the feelings and existence of SO MANY WOMEN. Stay gorgeous mom😍", "pri.x7": "BEAUTIFUL", "tlajci": "Just beautiful", "ellieldoggett": "@loeybug I LOVE YOU SO MUCH THANK YOU FOR THIS 😭💙💙💙", "the_umph_in_triumph": "👏🏼👏🏼👏🏼👏🏼", "maribal.442": "Love you Queen keep on fighting for us 💗", "o_0.hannah.0_o": "I saw your video you posted. I'm very proud of you for making that! There is alot of youtubers and bloggers who make posts on body positivity but your videos stand out the most to me. Keep spreading your light! We love you Loey!", "anaorohui": "You are so great, I've been following you since a couple years ago and you have been so much inspirational and important in my journey of self love, I love you Loey ♥️", "snitchery\nVerified": "Verified", "essievcollins": "Yessss 👏👏👏QUEEN", "alirasoothbane": "You have been an inspiration to me for a while now and to stand up for what you believe in only makes you that more special and amazing to me. Even though my disabilities make it so hard for me to get around I still push through to get up and try and be a bit more mobile than what people expect. It's all because of you that I don't let my disability keep me bed ridden. I love you and keep being you. ❤❤❤", "princess_maya723": "So beautiful ❤️❤️❤️❤️❤️", "yngppichmpgne": "😍😍😍😍", "principessagabriella": "Love the video and you! 💖Beauty and worth are not determined by size. That woman needs to think about why she would want to spread hatred like that. The plus sized Nike mannequin is awesome for women and young girls to see their body type represented a little bit more.", "kyla_nyc": "You're so pretty 🖤", "aly_avenue": "Stunning! ❤", "nickoleschmitt01": "Yassss queen your so pretty i love You", "jenthedvm1981": "A true beauty", "melody.theatre": "😍😍😍😍😍😍so inspiring and pretty", "jarly.r": "Yess love how you stand out for everyone and every woman out here like this is a motivation for everyone else who should not feel ashamed of their body’s everyone is beautiful the way they are and thank you for this love youuu so much 😍😍🥰😘😘🥰🥰🥰", "jennifer.rose.31": "We love a thiccc queen @loeybug also thanks for being one of the greatest female role models a girl could ever ask for", "mywonderfullife_beverly": "When I go for a run I get looks but I’m thinking to myself “Get out here and show me what you can do!” I’ve gotten praise also, it makes me feel awesome that I can do things that “thinner people can’t” just goes to show you that size definitely doesn’t matter. 👍🏼 Keep being your awesome self! ❤️😊", "tylerrugge": "Queen", "nwenda": "Beautiful 💕", "juejueshops": "I bet Tanya Gold can’t even run a mile stupid twat!", "amanda.schuh": "I LOVE your swimming suit!", "_alexisjohnsonnn_": "CAN I PLEASE BE YOU LOEY", "itscatherinemarie": "You're amazing 💛", "s.stephx": "this is why i love you loey! <3", "renee.mccannell": "Yes! 💕💕💕", "savannahraesisk": "GORGEOUS 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "zayxgabrielle": "I LOVE YOU BEAUTY QUEEN", "0fficialkaylyn": "Could you post any updates on YouTube about anything happening paranormal wise ? I love your videos 💖", "ria.scotto": "Stunning!!😊💕💕", "crakatoot": "i'd sleep with her", "22th_era": "Thats not funny and its not right im not wearing nike right now loey", "sarahbeth3182": "Screw the haters! @loeybug p.s. love this swimsuit on you ❤️❤️❤️", "jada_renae_k": "i speak for us all, we love you❤️", "celiabrookee": "LOEY IS A QUEEN", "olive.sourdough": "Thicc thighs save lives ❤️😘🔥", "miss_mer62": "Preach my queen!!!!!!!!!!!", "taysayslove": "You're beautiful!!! I loveeeeee your swim suit! Adorable!!💖", "bounds4beauty": "Well said Loey.", "lillydespirito": "youre beautiful baby !!", "labellisimakelsissima": "Why people think that plus size people can't exercise is beyond me. And then they would shame them for not doing so. Excuse me, double standard much?! Love you Loey!", "phoebe11rae": "👏👏👏❤️❤️❤️", "haebeautie": "You are a goddess!!🔥", "_elliottjones_": "thank you for this !!!💜💜💜", "lindzlec": "Girl I love you 😭💞", "vshelton4": "Slayyyy", "kaitlynmireiter": "i’m so proud of you. you are perfect.", "natashuuh": "You are an inspiration, thank you 💘 Ily!!!", "leito4438": "😍😍", "katiethequeenofeverything": "THIS IS THE CUTEST BATHING SUIT", "s_d_g_r_": "SLAY❤️", "leon.the.lenny": "Omg you are an icon to me!!", "michellehumphrey83": "People are such ignorant jerks. PREACH, LOEY🙌🏻👏🏼 @loeybug", "_winemxm": "I love you so much I’m in tears :(", "inloveroses": "u look beautiful", "day.tripper.mccartney": "Sweetie you’re gorgeous.", "margery_weems13": "🔥🔥🔥", "sav4nnah.jpg": "Gorgeous, as always ❤️❤️❤️", "bookish_anxiety": "Gorgeous words for a gorgeous woman💜", "hsbanana2126": "Gorgeous 🥰", "rachel_lain_": "❤️❤️❤️", "sttarfighter": "I love you, queen ❤️", "adrcanfield": "I love your hair and makeup in particular in this one", "miss.mad.rin": "That mannequin is fine😂❤️❤️", "0natalia.exe0": "Beautiful. Talented. Radient", "alexislynn08": "Your awesome and i love you!!!", "bankbxby": "💘💘💘💘💘💘@loeybug luv you for inspiring me to be me💘", "heycaitlinjane": "Yes say it girl! 🙌🏼🙌🏼🙌🏼", "xcherrytartx": "@_lucyf0rd", "kathrynlucia.jpg": "YOU ARE INCREDIBLE AND SUCH AN INSPIRATION THANK YOU ♥️😭❤️", "_rayna.leshae_": "I love this and every single thing you stand for. Thank you. 💗", "emmmadelrey": "OMMGGG A QUEEN 🤩 We stan", "elizabethander.son": "queen", "nevebrown._": "YES IM SO PROUD U TELL THEM GIRL!!! Love the swimsuit btw, we love u!! Don’t let ANYONE bring u down! 💗❤️💕💞🔥", "meganlovesjoel": "Yes, yes, yes!", "rebeccazamolo\nVerified": "Verified", "its_me_and_me_only_": "Very inspiring💗💗💗", "lauralosttheplot": "💙💜", "abigaylekepes": "You just made me cry happy tears and you empower me and many others 😭💓", "daruur": "💖 inspiration and beauty all in one.", "silversprings81": "🙌🏻 yes ❤️❤️", "rilee_jean": "So pretty", "magpiemystic": "So beautiful spoken. You’re a vision to behold. ♥️", "emmewillie": "Your such a beautiful and inspiring woman", "julia.messinger": "The most inspiring woman. I will never stop appreciating how passionate and vocal you are about this. Brings me closer and closer to loving my body every day 💗💗💗", "gabriellaarizzo": "@jameelajamilofficial", "ellywabbit1992": "Ur beautiful", "viviannepink": "👍👍👍", "isabel_pish": "Loey you are actually my favorite💖", "sleepdeprived827": "Literally the meaning of GORGEOUS 😍❤️", "mahchamp": "Racetrack runway kween! 🙌🏼🍸💕", "broadwaybaby53": "Looks like I need to order some Nike!!!", "_martifishkin": "and literally yeah i feel this. thank you", "babygirl_montgomery": "You are a goddess and an inspiration to everyone of every size 💜💜💜", "campbellj80": "Watching now", "grace_ram080": "Wait I have that bathing suit wish I looked as good as you do in it tho", "enjenn_slytherin_queen": "I LOVE your hair 😍 seriously wish I could pull that color off, you look fabulous girl! 💯", "kathennessey": "You are a literal gift and a treasure. Xoxo", "ab1ab23714": "👍👍👍💕💕🌹🌹💋💋🔥🔥Hotttt", "rhea.xoxo.1023": "Yeeeeees.... clap back sis 👏👏👏", "ed.ith5993": "I love this 💖", "mindymckirby": "Here's me giving you props and lots of respect omg . Girl 😎👏❤️", "j4zm1n3l0l": "we love you queen", "mickey.masse": "EVERY 👏 BODY 👏 IS 👏 BEAUTIFUL 👏", "aly_luvxoxo": "YES QUEEN 🧡", "trcksweetie": "Yassss girl 💕💕💕", "audreylamkin17": "💕💕", "sincere86": "Keep killin` the game pimpin` @loeybug !", "cheryl_gomery": "Gorgeous 😍", "nedschlxrine": "preach, queen😭🖤", "mikaylasburns": "You’re truly incredible. Inspirational. Beautiful. Truly a great virtual mentor for women of every body type.", "laurenlmarcinkowski": "This is beautifully said, you’re a beautiful person inside and out, this all around needs to be said even louder for everyone to hear!!! Thank you for sharing", "kailynnacco": "Actual queen", "jc_wanderlust20": "Wow, all your words are so perfectly spoken. You are an inspiration as an honest, self loving person every day.", "emi_leeann": "I adore you! Yes, you’re beautiful and bubbly but that’s all overshadowed by how loving and levelheaded you are. You inspire me to be positive and optimistic without being naive and I am so grateful for that ❤️", "averystheraven": "This speaks to me so much.. I hope that one day I can love my body fiercely with all it’s perfect imperfections", "makeupsheri": "I love that suit and you look hella hot in it! ❤️❤️❤️😍😍😍", "anchorman_ron": "I absolutely loathe Nike. But I have to say bravo for their taking the lead and providing \"real\" mannequins. Bold move and long overdue. Well done Nike.", "6jaedo9": "YEEESSS MAMA", "ccbreezyyy": "YASSSSS. Where’s this suit from?", "scaryspookyholly": "I don't see why its hard to understand that fitness comes in all sizes. A large man or women can run with the best of them while a small man or woman that may be perceived as fit could possibly not run for more than a minute. Size does not indicate fitness levels.", "saphy_1": "@vasigiannos look how stunning she is 😍", "shawnaraeshea": "Can you tell us about this swimsuit?", "hestiafirstandlast": "Yes. YEEEESSSSS!!!!!!! 🙌🏻", "ashlyn.elizzabeth": "YES GO OFF SIS", "summer.jewellx": "I adore you with every ounce of my soul", "clowny.baby": "oh my gosh i sobbed in your new video... i am so thankful that you’re putting your voice out there to combat all of the unnecessary negativity and fatphobia thrown around towards plus sized people. you’re an absolute icon loey, your words have made me feel so loved and important and worthy. you mean so much to me, you’re my favorite youtuber for a reason!!!! i adore you and i’m so so happy that you continue to spread your love and light across the internet ❤️🧡💛💚💙💜", "recklessreina": "Thank you for speaking on this, that article was really harmful and made me feel terrible all day but watching you stand up for people our size made me realize who tf I am. 💘", "lauren.midgley": "🙌🏻🙌🏻🙌🏻YASSSS GIRL!💃🏼", "losing._.my.ambition": "Omg Loey you're absolutely stunning!! 💖💗💝", "katiehalina_": "So much love and respect for you girl! And you look 🔥 🔥🔥", "eclaire_kochershew": "👏👏👏👏👏👏", "myheadhurts101p": "this is brilliant Loey is an amazing human", "lauradelacosta": "I’m LIVING FOR THIS RED HAIR 🔥❤️", "corazonxde.luz": "you are a woman of empowerment!! i love you and all that you do to help make this world a less judgmental place❤️❤️", "planetserenitychannel": "Perfect!! Love you Loey 💖💖", "shalamemary": "You are my self love role mode. I love you and everything you stand for!😘😍", "samantha_fitzgerald": "If I could find that bathing suit/body suit I’d buy it ASAP ♥️👏🏻♥️", "amandagram777": "Immense love for ourselves, Gargantuan feelings of love for everyone else, Vast amounts of beautiful women who aren't afraid, heaving with feelings of love for ourselves and every single person on this planet❤️ @loeybug you're an inspiration to me and SO MANY others!!", "tofuwasp": "I love you, watching your video right now 💙 you are so beautiful and that article and the contradictory responses to the Nike mannequin is bs! Thank you for speaking out", "gillianleighhhh": "you are so inspiring and beautiful i'm crying 🥺🥺", "ethiersabrina": "First: wow! Thank you so much for those amazing words, you continue to inspire me on my self-love journey. 💜 Second: you are so freaking gorgeous 😍😍😍", "keeley.alisha": "Literally so hot at all times 🔥💕", "meircohen41860": "You are unique special and absolutely beautiful", "silverfirekiss": "Beautiful 🌹", "kyriellelara": "Your video was done so well, with wit and a stern, empowering, important message. Woman have bodies,not have labels or numbers attached, they have souls, feelings and lives within them that no one, but them can attest to. It is so important that we have people like you who remind everyone, they are worthy and numbers do NOT define them. You are beautiful, and so is every other being on this earth, don't let anyone else tell you different 💖✨", "iheart2dgirls": "Absolute QUEEN.", "allisonkimmey\nVerified": "Verified", "saraevans_83": "All👏the👏damn👏 yesses👏👏👏👏", "ladybookmad": "what a mermaid 💜", "btsarmygirl4_17": "💜💜💜", "mindy_darling": "You are FOREVER my queen! LOVE YOU SOOOO MUCH❤️❤️❤️xoxoxoxoxoxo", "thepeacesfamily": "love you💖", "kelseyson": "YES MAAM!!!", "valerieraneee": "ur such an inspiration ily", "rushgurl": "I love what YOU represent ! 🖖🏽", "littlemissadrienne": "Thank you for this ❤️", "aimeecook_101": "So beautiful 😍", "worl_chon": "Yaassssssssssssssss guuuuuurrrrrrrrrrllllllllll embrace it❤️❤️❤️❤️😍😍😍😍!!!!!!! i love u soooo freakin muchhhhh😩❤️", "ameliamiller._": "I love u ☺️", "serena._.16": "😍🔥 preach girl yess!", "the_nostalgia_of_ghosts": "Gorgeous! 😍", "justmar2mar": "Gorgeous 😻", "rotting.nymphet": "thank you for this 💞💞", "_mikaylab": "That woman sounds like she’s just jealous, lol", "rzeph1": "Hi how are you today? @loeybug", "kaitlyn_rike": "YAS QUEEN🙌🏻🙌🏻🙌🏻", "laineyy.t": "Frick Tanya gold", "mareeeeeelynn": "Just watched the video 😏😉", "willa.michel": "i absolutely love you and this caption. you have no idea how much this means to me and how much i look up to you as a plus-size teen. so thank you loey for being ever confident and being a great role model. 💓🥰", "melicious_mom": "🔥🔥🔥", "reese.ett": "I LOVE YOU SO MUCH LOEY! YOU ARE SUCH AN IDOL!", "sammii.smith": "ICON. i love u and feel this 😍😍", "layla.renee_._": "My babyyyyy😭😭😭😭😍😍😍😍😍", "kenzieactsofficial": "Queen you are so inspirational and I love you dearly society is heart breaking", "_missrachelanne": "Beautiful! Love the swimsuit! And I love what you had to say 💕", "invisiblehunterhayes": "Beautiful", "kyliedeezee": "I love that suit!!", "adrianna654": "Wow literally so gorgeous! Serving body positivity REALNESS over here!😍🙌🏽", "nicolearae": "This suit with your hair is 👌🏽", "alyssariley16": "🔥🔥🔥", "angela_benitezz": "ily loey❤️💕💗", "avyalexis": "You have my dream hair 😭😭 stunning woman", "mevin_black": "@loeybug Beautiful 😍😍😍😍😍🌹🌹🌹", "_jamie_eliza_": "Girl yes! As a plus sized girl myself I can say that your words not only bring me confidence and power, but they bring me peace. This shows me that it is okay to be who I am. I’ve suffered from anorexia for years and this helps me realize it’s okay to eat. It’s okay to be me. I don’t have to look a certain way to be worthy. Thank you, Loey, for showing me that I am allowed to exist.", "theshanaleigh": "I can’t wait to watch the video. You are so right. And I love this swimsuit, btw.", "carly_harmon_": "👏🏻🙌🏻", "realkourtneyk": "@jaime.drader Umm. So if she has like any like, clothes she doesn’t wear, I would l or to take them off her hands. Cause me poor.", "sydthewitch": "But where can I get the bathing suit? 😍", "natx30": "Your amazing!! ❤️", "pinkg0ld_": "Loey😍❤️❤️", "alt_avenged_twitch": "🙌🙌🙌🙌", "kenzz_132": "She went OFF. I looove you!!!", "sophchernitsky": "i love you so much loeg you’re beautiful and amazing inside and out ❤️🙌🏼😍", "abbysis": "Yoi literally are so inspirational on so many levels 💗💗💗", "michaelamcgrady": "YES 👏🏻👏🏻❤️❤️", "grim_adventures2319": "Total queen👏🏻 Ugh I adore your hair!!", "onlyleone": "❤❤❤ yes!!!!", "sophie_porras": "Yes Loey!!!", "melaniee.vegaa": "🔥🔥🔥", "morganhatch7": "PREACH 🙌🙌🙌", "melaniejwallace": "This is so incredible Loey. Thank you for being a ray of sunshine in a world that is capable of being so incredibly gloomy.", "sarahmarsmarchand": "You are beautiful girl! Love yourself because there is no reason you shouldn’t 😘", "k.i.n.g._.m.a.r.k": "I didn't think true beauty was real until i saw Loey😊😊", "ava.longley": "You are so beautiful...Confidence, girl!!!", "nicoleghaney": "You’re lovely. That woman should be ashamed of herself! Every body is a beautiful body 💕", "thepurposefulpeach": "Wonderfully said Loey! There’s nothing wrong or dangerous about being size inclusive and encouraging people of every size to wear workout clothes 👏", "miah_grayer_": "Just watched the video and feel the same way you do. Society needs to change ❤️", "paige._.mcintyre": "QUEEN 👏👏🙌🙌", "_where_are_the_whales_": "AHH SO PRETTY", "robm1171": "I applaud both you and the woman who made that statement", "marilyn.sky": "Wow u look so beautiful here ❤️", "misha_did_it_sp": "I love you so much Loey. You’re my number one idol. 🥰 keep being strong, beautiful. (P.S. I have that suit... it’s incredible) ❤️💕", "lucidlizzy": "Just finished your video 🙌🙌🙌🙌 We need more women like you. Youre a boss babe!! 😍🔥🔥", "pamecastrechini": "❤️❤️👏🏻👏🏻👏🏻", "hihocrochetandco": "Yes!!!! You said it perfectly!! 🙌🏽💕", "kristen_dews": "❤❤❤", "butterflyreese": "wow a beauty queen im proud of you", "crystal.candace": "You’re beautiful Loe🏁", "challenger_mexican503": "Wow princesa ❤️", "brookelynhemsworth": "I love you", "jasminefamulari": "thank you for being such an amazing person to look up to, i just watched your video❤️", "jakobwebb": "@loveanybodybrand x @nike we doing it!", "kayleecasalinuova": "love youu 💛", "_kateymac_": "so cute", "sable0n": "PROUD 😍😍😍😍😍", "_babyciara": "Love your videos ❤️❤️❤️❤️❤️", "issahoe2004": "ur so prettyyy 😭💕💕"}