{"claytonco799": "You are an amazing woman.", "isowheyl": "😍🥺🥀", "adreenaangela": "You got it back!! 🙌🏻❤️", "adam.turner.12764874": "Beautiful❤️", "faiepdeoiad": "Pansexual, that's a new one for me. A new one every week it seems, how many genders is there now?", "kbloemhoff": "Naughty girls love balls❤️🔥💙", "50shadesof_compassion": "I totally luv your content 😍❤️🙏🏻", "dimazelenkov": "I think it all comes down to the simple thing - \"nobody cares with whom I sleep.\" but since human nature cannot be altered, it will always be interesting for people to look into someone else’s wallet or someone else’s bed. @reedamberx", "adam_wenham": "YES REED 😍🌈🌈", "cordero90": "Hey sweetheart how you been?", "alexabrookex": "👏🏼👏🏼👏🏼❤️❤️❤️", "halenger": "💜💜💜", "ladislav_znava": "Very beautiful lady", "rammyphoenix": "You go @reedamberx #loveislove", "renee_lunamossdesigns": "♥️🧡💜💙💚💛💖 He'll Yes! I'm Bi and pansexual too! 💃🔥🌞🔥💃", "deepkanwars": "Ur friend is super hot", "tiarobertsxo": "💙💙", "peeweesmith86": "Beautiful words ❤️❤️", "storyofmoxie\nVerified": "Verified", "imbreepower": "Love this so much 💕", "bstnpr1985": "Mhhhhh cute", "mastahloke": "Pree the thong straps in the waist 💎👁️👁️💎 yes Reed", "casperduppy": "What a beautiful and inspiring post. There are so many who are so happy to hear your words.", "guerilla_needles": "Thanks for this. I identify as pan but think a lot of people just think it's not real, or an excuse or something? But Im just attracted to the person no matter how they identify ❤️", "_chrissaunders": "👏🏼❤️", "ukg2012": "Wow yes please sexy 😍 xxx", "sashshots": "Beautiful inside", "skillmann": "🙌🙌", "ssarai1": "Mmmm my sexy proud pansexual peach 🔥", "kyomichey": "😍😍😍😍😍", "thomasalanchristensen": "@reedamberx. I want thank you for your honesty and being a wonderful teacher.", "decadentepez": "❤️❤️❤️❤️ ree eres la mejor", "barrypompey51": "You have summed it up well reed all my life I fought my feelings and after a while it affects your mental health,I like the way you call yourself queer! The male side of me looked at the picture you posted yesterday in your satin dressing gown and stockings and suspenders and it was wow! Etc 😘 but the female side so wanted to wear what you were wearing! But people like yourself have torn down the barriers! And show there is nothing to be ashamed of! But why do we still hide it and wear what guys are expected to wear! What's wrong with wearing a skirt and stockings whilst down the shops! Thank you for sticking up for people like myself and being open with people on here! Plus you look gorgeous in the picture! If this is not your thing then why are you looking and reading the posts! 💜💜🔥🥰", "fittonchris": "Your so gorgeous and you are just amazing for standing up for what you like and dont let any1 hold you back x", "richardgardner45": "♥️♥️♥️", "jerryboyer0624": "😍😍😍😍❤️❤️❤️❤️ Happy Thursday beautiful lady I hope you have a great day", "coco91model": "Hahaha! Loveeeee ! 👏🔥", "henrydell": "YES to you!!!!!! 🔥", "lilymariagoodchild": "WHEEEEETTTTTT 💦", "solomoncryne": "Beautiful🖤", "emilymalice": "❤️❤️❤️❤️❤️❤️", "_.its_just_talia._": "😊😍❤️💓💕", "callum.s.keight": "Bi and fucking proud 😁", "jae.ishijima": "PANSEXUAL PRIDE BBY!!! ❤️❤️"}