{"natlips": "Mamiiiii💘", "frankfadi10": "@reedamberx please check your inbox", "maman_alkatiri": "Oh my god u sooo sexy, look at the body, i love your body", "sirstoryteller": "Q U E E N 👸", "stevenlobel3": "So sexy hun 😍💋", "harlottscarlett": "🔥 beautiful share", "gary1445": "Stunning", "s66cams": "🔥🙌❤️", "buckley4579": "U look amazing xxx", "bigboy_brum": "Stunning 😍", "clarkey196608": "@reedamberx You are lovely but your exceptional looks, your gorgeous body and your killer smile are all window dressing on your real beauty which comes from deep inside in your your heart, your soul and your inspiring compassion for others. I sincerely hope that age doesn't take any of that away and you avoid becoming cynical and that you remain the exceptional person you are... I would be proud to be your father xxxx", "raebearlawl": "I love this and I love the caption and I also love you", "r.romaine": "you’re beautiful period. Filters normally enhance or distort. One thing remains though. If the camera connects with the visual the the aura and beauty always shines through. Girllll you’re hot. As always 🔥🔥 🙌🏾🔥", "reanna_angela": "😍", "alla.little": "Nothing more liberating than a natural honest shot...shame we can’t all include what nature gave us in the way of areola!! 😍❤️ #", "googleearthguy": "😯😍", "carootj3": "Beautiful as ever. Reality check check check :)", "erocdog": "Nature at it finest right there! 🙌🏽💚🐾✨", "thestorekeeper": "Stunning", "biletskiyr": "Hot beautiful🔥❤️", "rayansuar": "❤❤❤", "nimyonders": "'The Nature of nature in nature must be naturally natural\"....loq...ok doll.... That's nice....", "yarvonekmore": "The most ticklish upperbody in the world @reedamberx", "dimazelenkov": "👏👏👏👏", "cboz23": "My goodness Reed you're gorgeous", "neil230268": "A special picture 😊", "speedospee": "You are perfect 😍😍😍", "robertpike99": "Nice🌹", "adam.turner.12764874": "Beautiful❤️", "curtis_gerald": "Sexy 💋💋💋💋", "carrie.like.the_movie": "My god, I wish I looked like you. 💙", "dannyameri": "Amazing light", "hltbone03": "❤️❤️❤️", "valentiyo": "@peanutter83 👀💜", "lastraven1986": "Interesting tanline 😍", "revenkoandrej393": "👍👍👍👍👍", "tiarobertsxo": "Ugh, love thiss😍", "georgias_spot": "#curioisforreality / #realitydisclaimer is v important, inspiring and v gutsy - I’m so glad u are continuing with it x", "fittonchris": "So sexy x", "domenic_the_explorer": "Great photo", "selwyn45": "😘", "barrypompey51": "I think you look gorgeous as ever! What we see is the real reed! Very rarely photo shopped! Every one's body is different,for me I would rather you pose like you do in a lot of photos leaving something to the imagination! There is nothing wrong with topless etc! But it's like at Christmas if your presents were dumped in a pile unwrapped you would be deflated,don't tell me nobody has not sneaked down & ripped a tiny corner to see what your getting! None of us in our eyes have the perfect body! Just like your fringe not right! Don't let anyone stop you from living your dream! Thank you reed for being open and honest about all your issues you struggle with on a daily basis that why only genuine people follow you! people that care and love what you do! Whether it be modelling or doing podcasts! I do ramble when I am on a roll because I care! 💜💜😍💞💞🔥🔥😘😘❤️❤️💜💜💋💋", "superroo80": "@reedamberx beautiful 💙💚😍💚💙", "chloeleahwilliams": "🔥", "elaw_food": "Such a sexy photo @reedamberx", "alireza.ganjiyan1": "🔥🔥🔥🔥🔥🔥🔥🔥🎅🔥🔥🔥😍🔥🔥🔥💘🔥🔥🔥💣🔥🔥🔥🎆🔥🔥🔥💔🔥🔥🔥_______________________🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "michaelamos1973": "👍❤️", "smyth2691": "You’re stunning 😘😘", "davidboellphotography": "Gorgeous 🔥", "_ciaraelizabeth_": "So so beautiful 🖤", "julietterendersallen": "What a beauty 💓", "hippie_katexox": "Yasssss #realitydisclaimer #curiousforreality 🙌🏼🙌🏼🙌🏼", "burckybear": "Best picture ever", "jahmia_hercules": "🔥🔥🔥", "os.hu99": "😍🤤🔥💪🏽", "shootatmine": "wow look awesome dude :) 🙌🙌"}