{"patrickchilton1970": "Get well soon", "carmen.illustration": "Poor gal, hope you feel better soon xx", "c_j_hilt0n": "@liv_hart_ All the shingle ladies", "jughead_jones": "Hope you feel better soon!", "petertambyapin": "Beautiful absolutely gorgeous @reedamberx 😀😀💖", "ceej.jpg": "Bless you! I shingles last christmas near my 🐱 which I was 100% convinced was hsv-2. Took weeks for my local clinic to give me my result - I was so paranoid. It turned out I got it from being ill and extreme stress. It was sooo painful that I had to miss weeks of uni. Thank fuck for antibiotics 🤩 Wishing you a speedy recovery!! Xx", "gabbyvila": "Get well!", "dennisyouse": "I had shingles years ago around my waist very painful indeed", "c.harden": "Ouch that can be dangerous", "neuralsnafu": "My wife gets flare ups when shes uber stressed. Hella sucks 😥", "smccready83": "Should look into the new shingle vaccine, I hear that it is very effective. Get well soon. 💜 💐", "majid.z.m.k": "😘😘👍", "dextraterrestrial": "I had shingles last year and it was so painful 😖 have some scarring from it.", "gastownkitty": "Oh fuck! Shingles are the WORST! Been there, done that. I feel for you babe ❤️", "veblenceo": "DMed you about a job", "malchee58": "When I had shingles, it was so bloody painful. Sorry.", "bullchristopher": "It's even worse if you have eczema", "revenkoandrej393": "🤔🤔🤔", "trainer77777": "Painful.", "_jennyfromtheblog": "Sent you a DM message gorgeous!!!!", "realeyezart": "I had it once its fucking so painful.", "jayden_lwh": "Love u🤯", "bob_p_11": "I take Nutravita supplements", "jamiemh": "Yoooo try putting some coconut on, really helps the soreness and itch ❤️❤️", "sinbad_cc": "Aww chick r u ok??? You haven’t had a lot of luck since you came off of ur holiday have you. on the plus side ur eye liner is on point really making ur eyes pop. Xx", "bassil_hotait": "I think its herpes simplex , u get well soon", "larry__diamond": "Ive had that , i got it from stress , very painful, try bio oil for the scarring", "sayleekjain": "☝🏽", "buckley4579": "Hope u feel better soon Reed xxx davetherave", "godwolf": "Shingles hurt so bad dude, I’m sorry you have to deal with it. I remember my torso aching so bad any time anything touched it. Get better!", "thisisavulva": "Ugh I feel you. I had shingles and that shit is PAINFUL. Although it did get me out of going to the wedding of my then partner's dad where I was due to be sat with a couple I was banned from talking about Brexit with (they voted leave), a man who turned up in trackside bottoms and a woman I shouldn't talk to about feminism. So actually I secretly loved having shingles. I hope yours also get you out of shit things you don't want to do 💛", "neverneutral": "Oh no! Feel better bunny 🐰 ❤️", "carl5052": "I feel your pain I have just recovered from shingles myself and it’s horrible", "aysiaeliz": "Also get well soon xx", "phils_pick_n_mix_videos": "Hope you get well 😊😊😊😊", "fittonchris": "Get well soon babe x", "therealpaulie": "Shingles is an absolute shit... I've had it twice. It takes no prisoners..Get well soon hunny x", "drdelm7": "Herp derp", "ken_brown_2020": "The things you ladies do fo use to keep us aware of all the stuff in the world waiting to piss on us is simply amazing. Slow down a bit and heal up. You’ll be back up in no time. Feel better", "annabsavage\nVerified": "Verified", "yolandareginafit": "Awwwww babes... super quick recovery wishes sent to you from me. 💖", "lemon_ste": "Oh gosh my dad has had this at least once, he said he had this horrible pain that went from his back ribs and straight through him. Hope it's minimal for you :(", "gnatlou": "Fuck! hope you're ok love 😣", "stockwell1467": "Get well soon 💋💋💋", "phipp_in": "😱 Feel better! There is a new vaccine for shingles.", "chriss_nyce": "And so the zombie plague is upon us.", "gazcrooksculpture": "Kind wishes 🕊❤️", "mrunal_h": "Get well soon 🙏", "annisonmark": "You are so sexy and hot babe ❤️❤️❤️😜", "thegirlwhotakespicsphotography": "Aww babe I had this to... :( it’s horrible .. get well soon x", "barrypompey51": "Also make sure every visitor was their hands as the winter vomiting bug is at an all time high! Wish we all could do more to help you! 😥", "kydnereida": "🙏✨real honesty yo love you for this x and I hope you get better soon x", "kate_maxx_": "😭 I just got tested for shingle too yesterday", "donjackson4388": "Do make sure you take all the medication my former son-in-law had it didn’t take the pills and took forever to shake it off and he was then very feeble for a long time afterwards. I expect lots of people will share my wish to see you up and about and doing your thing very soon. Look after yourself xxxxxx", "davidvales1": "Wow so sorry girl..", "james.daley3": "Hope you get well soon ❤️", "claytonco799": "😢", "decembersagittarius": "Get better soon❤️", "kierantee": "My mam has them very sore", "manico63": "Take it easy ❤️", "thomasalanchristensen": "@reedamberx. Hope you get well.", "aliceincanada": "Feel better baby girl 🥰💖", "porterbhoy": "Get well soon hunni 😳🙄💯👀💎reed amber💋", "ties_boonstra": "You guys are looking at the blisters?!?? Look at those gorgeous eyes!!!❤️", "thecrudevegan": "Bro I’ve literally got shingles for the 6th time 😂😂 mine is fucking ugly", "sophiemilner_fs": "GURL GET BETTER SOON! At least you know what that nasty shit ass infection is ♥️♥️", "mhmthssn": "Hey, get well soon!♥️", "chris_mf_twin": "Awwww that sucks", "steveyunker": "Been there. It sucks, but it gets better."}