{"interzone55": "Hot pics are nice obviously, but when people only see hot pics they must start to feel disatisfied with their own lives. I'm lucky I suppose, I've almost never given a shit about how I look and the car I drive etc, but not everyone is like that and so a good dose of reality on Instagram can only be a good thing.", "1lollipop22104": "You are still a Goddess!", "fatposipeach": "ahhhh so that’s why barely anyone interacts/follows/talks to me 😂😂 i’m very TOO MUCH my honest self🤭😂", "rohannaberry": "Following BECAUSE of this post ❤️", "50shadesof_compassion": "Fck no ...I want to see the real stuff 🙏🏻 I follow cos I luv your content ...glamour or not 😍", "lotus_dmj": "I think you’re an amazing human being Amber and appreciate all aspects you share with us 💜💜💜 stay true! Always xxx", "d.strudwick": "You make me laugh and question how I look at life, seeing the 'real you' is just as much why I follow you as how you make me think about my life. Your a real person who gets sick the same as us all. Just get well soon and always be the person you want to be. As you say people stop following you when you post some things. Thoes people aren't worth worrying about. Sending you hugs and hope you feel better soon 🤗", "intothenight13": "I blame the chips in your pants! But seriously, I followed you since Vimeo. I'm here for your highs and lows and completely appreciate you sharing the reality of your life. The people here for just the fantasy are probably douchebags IRL anyway. 🤘❤️", "carootj3": "Yay for honestly and real life! Bye shallow men who only want to see nakedness. You are sexy, even with an outburst (hope you get well soon!) 💪🔥♥️", "walkinghomme": "👏🏼👏🏼👏🏼", "rams_box": "Hey @reedamberx my gf @sofia.mesz and I love all your real talk💪 keep it coming since we all can learn and share these kind of feelings. 😉", "krahlandreas": "you are more sexy you are know", "melahe83": "Go girl!!!", "jeklahh": "Look good to me", "sayu_kobayashii": "I'm glad and thankful, that you're doing, what you're doing and are not afraid of loosing followers or whatevs. You inspire and empower probably not just me, but many other women. Men also need to see, that even the hot and sexy chicks on the internet have inperfections, it's only natural and human. There need to be more people like you, acting human online. Nonetheless you're gorgeous either way 💖", "camillereindorf": "Well I saw this on explore and am now gonna follow because I love how raw this was. Keep going and being you!", "amity_to_hill_valley": "I hope you are feeling better. Your post made me feel sad. I enjoy every side of your account. Pompholyx sounds mean and yukky! X", "alexbryandanielofficial": "😲", "drsmashlove": "You’re gorgeous tbh ❤️", "coolhandhayes": "🖤Yer a livin👏fukking👏MIRACLE🖤", "kimraluna": "I found the same thing with my followers... the more I post the REAL me the more followers I lose. I lost over 2k when I came out of the closet. It hurt but also made me feel grateful for the people who stuck around and supported my journey. Keep on doing you!! I love you content!! 💋💋", "doctor_uzbek": "You are ❤️ the way you are regardless", "afkerins": "@reedamberx I just have to say, I’m a mental health nurse, mum, married woman and have a male friend to thank for letting me know about your profile! Possible he’s a typical guy, and checks out your sexy self photos. No idea!!🤣😂 I’m open and pretty non judgmental about most things, but have always struggled with discussing sex, and all things related. Thankyou for being your real self, as well as instagram famous. ❤️", "0pen_m1ke_kn1ght": "This is a beautiful pic and you being your real self is the best thing there is. Screw sexy pics. I'm sorry that followers are that shitty. Love, support and hugs.", "ilan_swang": "I am a boy not a pervert😂😂 I am a listener of @comecurious and I want to thank you for all that you taught me❤️ Keep going like this because you bring a lot of help to people like me for example 👏👏", "rufus234523": "Be yourself! And I hope you feel better soon miss 🌹😍💋", "phils_pick_n_mix_videos": "Hope it clears up fast for you 😘", "karvo1023": "I think your work is so good that I hope you never fall for some extra followers/likes. I like what I learn and I share it with my girlfriend, so THANK YOU for your work ❤️", "andrewdavidweber1st": "The honesty is what I followed you for. I try to follow lots of other people who lead lives of all sorts because I find human beings pretty fascinating. I try to be as honest as possible about myself on here and love when I find others that are not afraid to bear their humanity. I post songs with mistakes in them, and love when I see other people post without makeup, or share a memory we regret. It helps us to learn when we see that other people struggle too. It makes our minds more open, and diminishes the inferiority complex that so many are plagued with because of this digitally enhanced world we live in. This is refreshing! Go you!", "therealpaulie": "I just had to say yes you are attractive. Yes you are glamorous, but you ar. What you see is what you get", "paulj060669": "Reed your only human your beutiful no matter what keep posting 👍👍👍", "roxaneaccardi": "@reedamberx SALUTE TO YOU.... you are exactly what we need in our life!", "razixs": "Cheer up", "kittyunderhillx": "Ugh THIS. I'm so sick of it! ❤️", "louvmeplease": "💓", "nigelshinnorsphotography": "Unfortunately you get all sorts of people who will follow people on Instagram for different reasons. Some will be for specific reasons such as the glamour side or some for the reality side. It's unfortunate when people only want to see specific content and thus unfollow when other content is posted such as your reality disclaimers. However I think it's better to be yourself and express what it is you want to express. At the end of the day the people who unfollow don't seem to be interested in the awareness and message your trying to spread. Also when you are true to yourself you eventually attract the right people and your followers will grow again and it will be people who want to hear your messages.", "oh_hey_its_rach": "I follow you for the realness. I find following people who post the fakeness and only the 'good' parts of their life very boring. It's sad when you see someone constantly talk about how positive things are, and push products they use onto people. Because to me, you don't see a real person. Keep being you, I'll be following", "marinaxmaya": "I LOVE your reality disclaimers and it inspires me. Went through a hard time towards the end of last year and it was so mentally draining trying to maintain my social media presence but it wasn’t something I wanted to share either because it was really personal to me. Your posts do motivate me to show my true self and it’s something I hope to do more of this year. P.S. My audience is 95% men 😅 xxx", "j.andrew6": "I think you still look cute and sexy in that pic! 😍😍", "trooper1876": "Reed, like many I started following you for the racy pics, chatter and lifestyle. But, over the past couple of years I've grown fond of everything about you and your presence on the web. All I need do to realize life is not without the occasional wart or blemish is to look in the mirror every morning. Those who don't want to see such things should probably stay away from the internet. To be honest, there are undoubtedly millions of racy, titillating pictures and content on the net. Yours is unique and most interesting. Please continue to do you, Reed--don't think of changing. 😘", "luluerglis": "Best 😂", "brum.boy": "💯 me 0121 yes 👿2020 u being good girl😂😂", "zombie_biker22": "I follow a gorgeous girl who doesn't lie to me😘.", "joelordaz831": "Reed I love what you do. I’m right behind you girl", "ciarmail": "your posts are always an interesting read to this male follower", "arkansasdaverudabaw": "Keep doing you! If they leave this page wasn't right for them anyways. The world needs more honesty", "renee_lunamossdesigns": "I also hope that you feel better soon🌞", "bigdog6322": "Be who you are. If people don't like it, that's their problem. Not yours.", "subterraneanhomesickalien85": "That’s so sad 😞 I appreciate the content you choose to share, especially the honest bits because that makes those of us who aren’t ‘perfect’ and who are weirdos🖤 appreciate and love you even more!!!", "calenjvanstone": "Keep up the realness. It’s appreciated by the real ones. ❤️", "itsmrsmtoyou": "I follow you because you make me feel better about myself and remind me that it’s ok to be me 😍", "stormfire102": "Rather u showbur real self the be someone your not", "horseman618": "....plus the being at peace with your mental health and knowing it's ok to talk about it is helping so many people. Keep it going, sod the followers that leave", "katy_sheets21": "@reedamberx you’re amazing, you’re beautiful, you’re real and not afraid to show it!! MUCH love to you ♥️♥️", "diemondbeats": "Only started following you a few days ago. I mean, you're hot, but I'm actually following you for these kind of posts and because you're honest, real and funny. Qualities that I struggle to find on the outside world, especially with the majority of women. Everything is starting to feel so fake lately it's disturbing. Keep being you. F*** the whole analytics things.", "slingshot900": "It's instagram... most people are just here to look at pretty pictures for light entertainment. If you don't want people to follow you only for sexual content, start another page without any sexual content and see what you end up with. Those followers will be there for the meaningful content", "mrsimondh": "You still look absolutely beautiful ❤️ xx", "zingo_zang": "At Least Your Being Honest...A Lot Of Times It's People Being Whatever Makes Them Look 'Perfect'...Well To Me You Are 'Beautiful' Just Like That Because It's Normal...x😘😊💖", "missladylamp": "Wow people actually go out of their way to unfollow people for posting something that’s not even out of the ordinary? People really be doing that? I don’t understand because I literally thrive off of pages that post both. Like @staceysolomon and @jacjossa. Just continue to be you reed. I’ve been following you since waaaay back in the day. Probably remember me asking for a “communication curious” on your live stream once. I’m a huge supporter and I hope you never stop posting what’s real. Everyone needs to face reality.", "sohbetmekan35": "❤️", "rossipaolored": "In quanto maschio mi sento coinvolto. Io ti seguo perché sei divertente, simpatica, irriverente e vera... (Ok ovviamente anche sexy sia chiaro 😉) sul resto... Meglio perdere certa gente piuttosto che averlo come follower. Vai avanti cosi 👍 you are the best. Sorry i don't speak English very well 😅😅", "xxpparis": "I liiiiiive for people’s reality on insta because it’s so rare!!! Pls keep posting the realness!!!! X x", "davidb0473": "Your reality is what you make you appealing to some of us Reed. You keep it as real as you can my dear and most of us will be the happier for it!", "zos.2": "هاي من وره الجلغ ام العيورة", "pokerface_69": "You're so inspiring, and have an attractive personality!", "telavized09": "I’m a 17 yo girl an ur #realitydisclaimer are amazing! The amount of things u have taught me (biggest being body confidence and acceptance) whilst I’ve been following you is truly incredible. You are breaking down so many stigmas and taboo topics so thank you for that. So yeah, keep posting whatever u feel like cause ‘sexy’ or not, ur posts are helping myself and others realise, acknowledge and accept that we don’t have to be ok all the time, sometimes ur puking and that’s ok (not really I hope u get better soon but u get the point aha)🖤", "gilbrius": "Keep on trucking 👊🏽", "romeofthesouth": "I follow people for various reasons whether it's looks, content, similar interests or as an advocate. I rarely unfollow unless said person has gone in a severely different direction as to why I started following in the first place.", "raebearlawl": "I love how real and honest you are, it’s SO refreshing to see.", "adreenaangela": "I have the same every time I post about feminist issues!! I see it as a sign I'm doing something right...", "adammichaelap": "Just dont base your life on Instagram. No point being arsed about what people you're never gonna know think", "abuxompony": "Let them go - more room for us .. besides yes everyone deals with this on insta . It’s why everyone is depressed and living in authentic lives . I say be u more often and attract the right fan base . 🙏❤️ @reedamberx", "slaybynight": "I follow you for all aspects of you, Reed. The sexy pics, the not so glamourous real life events like illness, the important topics you bring up, LGBTQ issues, and more. Keep being the real you and hopefully you will have enough loyal fans who will stick with you through thick and thin. I know I'm here to stay. 💜", "tioflounder": "Still 🔥", "mhrd.sh": "I like the real u even more💜💙", "cramberr": "The followers you had that don’t support everything that you stand for, were in the wrong place to begin with and you don’t want judgmental and hateful people following you 🤷🏻‍♀️ much loveeee ❤️😌", "will_attenborough": "Keep doing the real stuff, it’s wonderful! The honesty is such a comfort :)", "wickedazura": "Whats really interesting to me is that I lose followers whenever I post a very sexy photo to IG but will get crazy amounts of likes... these men \"like\" the post then unfollow. Ive gotten dms saying they love the content but \"cant support what im doing\" 😆🙄 sexism amd anti sex work sentiment in all its convoluted forms.", "murdock6589": "I'll engage with you. I think you are a truly stunning woman, and what makes you sexier is your genuine honesty and expression of the true female form. I have seen many pictures that you have posted of you being you and I think you are more beautiful for it. I wish more women would see you as an inspiration to embrace their true self. Of course make up and sexy outfits are great but only when the female is wearing this to accentuate themself for their own happiness. True beauty is deeper than skin. Always be you because that is truly who you are.", "arstroid": "The human being has these things. I don't see any problem, after all we all have skin. Encourage and remain as you are. Great!!!! 👏👏👏", "darrell.edmondson.33": "True followers fans of a person don’t leave when things aren’t what they expect life isn’t always glam", "weegingerprincess": "My followers are mostly men but my account is almost always dedicated to uterine trouble or makeup... whatever, either way you look like a damn snack in this pic and any other 😍", "inthecagemix": "I follow for the real life real stories real you 💯💜", "johancanelo": "SUPER INSPIRED! You are a Fuckin' Rockstar, love what you stand for! Keep the realness up!❤️🔥 ..hope your health improves!!! #muchlove", "thesexdoctor": "I posted about World AIDS Day this year and lost the most followers I’ve lost in one go recently. Saddened me! But then also good riddance 👋🏼! Always love your posts and think the variety of raw honesty, body positivity and perfect pics is 👌🏼", "buckley4579": "I know hunny I'm currently having cbtxxx", "_dewang_sharma_09": "Less followers rather than fake ones 😀😀", "lucky_silver23": "I still think you're beautiful regardless! It's not just your looks but your honesty too 💕", "heres_layla": "I love your truth and honesty Reed! I think you’re awesome and love people who are their truest selves. If people don’t like that, then that’s on them right!?! Get better soon 💖", "gazcrooksculpture": "Hoping you feel better real soon 💐🕊", "lazarospasdekis": "This a very cute and very real photo at the same time ! I hope you feel better soon !", "joshj3nkins": "Those stats don’t surprise me", "courage.in.progress": "This is so inspiring to see....I also feel guilty of high light reel and really want to show all of me....thanks for having the courage to be seen fully 🙌", "missmarissalalo": "I think a massive percentage of men are on insta just to wank. Sadly it’s that simple.", "toolorjesus": "I agree with everything you are saying it's unfortunate but at the same time everyone uses IG for different reasons and your unfollowing trends just shows The reasons for those individuals. Some people use it for inspiration, to look at and share art, to zone out, to advertise, to reach out to others, it just to look at hot chicks. I do it for 5 of those reasons haha.", "rambling_pete": "I love the sexy pics, but I appreciate your honesty about real life issues such as relationships or physical 'imperfections' so much. Sad that not all guys feel the same. Keep being real x", "moffat605": "I follow because you are also a very nice lady and not just because you are beautiful, so sorry to hear that you are unwell and l hope you feel better soon 🙏", "buzzyandtherainbow": "You are fuxking lovely darling!!! Brace and beautiful. Genuine and true!!!! 🌸", "manico63": "Wow Reed, look at all the positive responses. Proof the World ain't so bad 🙂", "fiorayn": "Hiiii🌱maybe being real makes you lose followers but it also makes you win another kind of them. For example, I discovered you for this post and how I liked it😍🌻Keep being yourself, the world needs more people like you.", "fidelio13200": "Hi Reed the only thing you have to do is please take care of yourself and recover from your illness. Of course at fiesta I follower you because youre a pretty attractive and fun girl but I understand Its impossible for someone to be like à glamour model all the Time and Its only a part of yourself. The only thing you have to take care is yourself as someone sauts « Heath first » personally I’ve appreciated to read you because It proves me you’re really a True person and a beautiful one inside 👏❤️🌹", "peeweesmith86": "I follow you because love your post 💗💗💗❤️", "drewwyllie": "Eughhh I needed to hear this. 👏🏼 Wise words resonate deeply, keep being authentic and true to you because that’s what we love 🔥🔥🔥💘", "chrismasonx": "You will wake up one day until then question what Society has giv you or embrace what you have already don’t let your self get distracted from your ego 💯", "nickyjones2019": "Yer man comes to the for he'll help u throughout this, and you'll soon be back to your jovial sport go girl were all waiting ,sexy and horny looking get well our little darling, ask boyfriend to give you a sloppy powcer (kiss) from all of us,GET WELL SOON AMBER.🤒🤧😰❤️😘😘😘MWAH.", "gr0kbot": "Love seeing everything you share with us. Best to you, ma’am!", "shineyandsexy": "And from what I’ve seen you post I don’t think you’re really bothered about losing a few small minded followers..", "sotraps": "I like to follow posts and accounts like yours because they are inclusive, open minded, and honest. Thank you 🙏🏼", "chef_keif_a_lot": "Still wonderful! Feel better soon!!!", "gronnff": "I like you because you're real and you educate and help people. Keep on doing what you're doing", "miksan70": "❤️", "yeungha89": "Keep fighting the good fight 👊", "alburaqi": "You are too beautiful in every aspect and with or without anything💛💛", "filmengineuk": "Get well soon ❤️", "lummysteve78": "Reed I love how real you are with everything and I hope you feel better ASAP babe!! ❤️❤️🙏🙏😘😘", "joesmith7232": "No such thing as perfect we are what we are we ant what we ant love us or hate us xx", "woolyblue": "If they don’t like you at your worst (ill) then they don’t deserve you at best hope you are better soon I follow you because or your lack of fucks keep it up 😂👍", "tayaepp": "Blemishes are beauty as is shows the reality of life. Your imperfect qualities are what make you unique and worth it. Don’t stop sharing girl! We are in this together!!! 💙", "andresilvabullett": "Kiss and make it better? 😜", "lauragolgotiu": "With every post and photo i grow closer to your instagram (i cant say \"you\" because i dont know you in real life). I like how real you are, i like that you post both good and bad aspects of your life. Since i found comecurious i am very grateful, as i learned a lot from you. I like your style and i dont think that i will ever have a reason to unfollow you", "feministgoodsco": "Yes! Definitely see this too", "stupotcrow": "Just started following and love real people :) keep up the the fun posts x", "seejosiesmile": "I just lost a lot of followers recently for the same reasons. Keep being you because that's what is worth being here to see! I'm not interested in surface bullshit, just the gorgeous person you naturally are. 🖤🖤", "inplaceoffallenstars": "🤘", "rahul.lalwani_impulsiverider": "Get well soon", "etiennecarter": "👏👏👏", "virginiaannstanley": "You have inspired me more than anyone to keep it real and add reality disclaimers to the pretty churched up shit. Really appreciate you.", "harls1x": "🙏🏼💕", "starwarsbeauties": "Makes us love you even more. I started following you because of your glam work, but fell in love with your account because of your real talk about mental health, about sexuality and now phlegm. Keep up the good work 🌠💖 from a male!", "thefemmeproject": "If we continue to engage as humans online, we need more real talk, real bodies, and real life on Instagram. There was an alarming opinion piece in the New York Times yesterday about teen depression and suicide, which is now the second leading cause of death among young people. It didn't necessarily make the corellation to the impact of social media on those stats, because unfortunately, no one knows how to approach studying it. Anecdotally speaking, I know that social media has a huge impact on my self esteem, positive and negative. We are more than our follower count and number of likes. And in the end, the ones that stick around for the real talk are the ones that count. ✊❤️", "jayyco.13": "This the realist girl you'll ever see!!!!!", "prowanart": "I seem to automatically get double the likes/followers when I draw sexual stuff. It’s frustrating but I can’t compromise everything else I do. Truth it up kiddo, fuck em! 👏👏💪", "lymekhaleesi": "Poor angel rest up! Wrapping you up in love and light always ♥️ we love all sides of you!! 💋", "_shawnsanderson": "Keep posting the reality, it makes the fantasy even sweeter! Your hot pictures are gorgeous but I’m always captivated by your words and your insight. You’re brilliant, get better soon! ❤️", "raewneric": "😎🕶️😂🤣😂🤣😂🤣😂🤣😂🤣😂", "lordmelvynevery": "Well said, I say more real life post fake stuff does nobody any favours it makes people think that every thing & everyone should be perfect & it's not 👍❤️✌", "campi.al.alba": "Can I like this post more than once?", "olivaemusic": "Nicely said", "m.lopezxo": "Fuck all of those who unfollowed, your account is freaking awesome I love it you talk about deep important subject and in the same time share stupid funny stuff keep the great work and don't change for none !!!! Love youuuu💕💕💕💕", "holliejjjjj": "I just LOVE you", "cattrill_66": "❤️ Reed it makes me feel sad for you to feel this way because your beauty is so much more than skin deep to me you are away beautiful and away will be if people can't see this thay need to start with at least a eye test 💜💜😘😘💋💋💕💕💕💕", "barrypompey51": "I follow you for you reed and I care if your sick both mentally or physically! Nobody can look like a glamour model day in day out! I suffered all my life with mental health issues after being raped by a teacher! Reed showed me another side to things and I got help! She is gorgeous! But she is a kind and caring human one I class as a friend! 💖💖💜", "trainer77777": "Keep on \"getting down to the real nitty gritty.\" Your honesty is refreshing. Get well soon.", "daniel_bullstep": "❤️", "sinbad_cc": "Hey reedie it’s ok Hun just rest up and get urself better and back to normal health. That’s the only thing that matters. Get well soon xx", "rachelmariep7": "👏🏼 😘", "linleygene": "Get well soon! ⛑ ❤️", "roca.feller": "Still would 🤷🏼‍♂️😊😉", "paigeyleigh54": "I absolutely love this. ❤️ I love the real side.", "phreyya": "Thank you for showing both the beautiful sides of you! It does make a difference💕💕", "soda_and_villains": "What these people unfollow you for is exactly what I follow you for! You are so incredibly honest and because of that you’re inspiring me to try be honest as well and show my reality via social media. Thank you. Sending so much love from the United States 💜", "isamarfree": "👏👏👏 i loviu girl! Thank u for ur words", "mymilliem": "💖💖💖", "the1philmorley": "All my posts are horrible so I can comment on the loss of followers but I appreciate the real posts more than the 'made up' ones. Keep doing what you're doing 👌", "smithsmith42ryu": "Lovely Reed, the reason to follow you ( apart that you are 🔥🔥🔥) is you are real and true. Intelligent frank and honest . Time that everyone realises the Instagram is mainly fakery. In the real world nothing is perfect. Get well soon", "wlammy": "Love the real you!! (And the sexy selfies are also the real you!!)", "happyhil": "I hope you will feel/get better soon🌼", "hippie_katexox": "Yep 100%, I don’t have many followers but I gain followers after posting either a revealing pic or a pretty/posed one... then when I post anything else my followers go again!! I think a lot of people (90% men) are very fickle and literally use Instagram for hot/sexy pictures and I’m so very much like I cba with it all so just do what I want 😂 I think the true followers will stay but the fickle, superficial ones will go. I say good riddance 👊🏼💪🏼", "nyemathjay": "💗💗keep staying real 😇😇", "geaninnette": "Hope u get better soon! Wish you a fast recovery!", "nickjtyrell": "💖", "lescha_4": "Love it 🔥", "daren8892": "❤️", "zo.ster": "I’ve started to delete people that only show a lavish lifestyle. Keep being you. I love it 🧡", "hipposleek_j": "I follow not because you're a fantasy, but exactky the opposite. You're real, you show life as it is, not a heavily edited ego driven lie. I love seeing your honesty. So much power in being out here, vulnerabilities and all. Keep doing you, we need more of that! 🙌💖", "the_ateam88": "💙💙💙", "mick938": "Still beautiful now matter how you look, hope you feel better soon x", "annakat_ze": "Thank you for sharing this. 💕", "evasirlin": "This is such a great message. Thank you for sharing💗", "frank.marcha": "I would rather see the real you in all its facets than fake smiles,tits,lips and asses.. those woman are hollow😉", "bodybitsbrighton": "omg I have the same!! I post about freeing sexuality from the male gaze and comfort in your own body, but because i also post nudes i have majority male followers lol!", "minxy.a": "I LOVE seeing the real side of everyone I follow, I think it's beautiful to see how everyone goes through the same things. Still, I also notice how people only want to see sexy and perfect on most profiles. I loose followers every time I post a non-naked picture but I just tell myself that I rather have real followers who like me as a whole, than thousands that only like my boobs xD", "luuontheloose": "No. In fact, it's the imperfections that matter most. It's you. Not some glossy version of you that I don't know. I tell my students all the time: Be your authentic selves. After all, there's only one of you, one of me, etc. Let's leave a legacy worth being proud of, and that can only be done by being authentic from the inside out. How else am I going to know the real you? You shouldn't just be the hot girl people give casual hearts to. We should understand one another as friends. But lay that foundation through honesty, and all the acne and phlegm we have.", "jesshake_": "❤️❤️❤️", "big_tibbz": "Imperfection to you is perfection to others you should embrace to gain followers", "t___metz": "Speak your mind, don’t let any amount of followers ever change you.", "hello.little.daffodil": "I eventually unfollow accounts that don't feature the real side of people because I don't think its helpful for me just to look at the ideal version of people", "valentina_stif": "💖 That's my girl!", "tony.houghton.967": "Hope you get better soon", "alan_devlin": "You're beautiful xx", "armz_korleone": "🤝🤝🤝🤝🤝🤝🤝🤝🤝", "minniequinn_x": "Your words are spot on. I have just started my account for sex and body positivity and already (within 1 day!) I can feel and see the pressure to appear as just a hot girl in undies. That's not what I'm trying to do at all. I'm so glad there are people like you on here serving up real truths, because you're totally right, to only show your best self isnt positivity. It's shocking that you lose followers for being yourself, especially when your beauty is inside and out! ❤️", "mariadeelena": "Brave! Thank you for posting this 💜 sending a hug!", "youatyours": "Hey Amber, sorry you’re not feeling well. I wish you a speedy recovery! I have actually found the same thing in what I do but I think (can’t be sure) that’s it’s also the men jumping ship after I put up posts about all the “fluffy” stuff (body confidence, fears, intentions for the year etc.) instead of a juicy bum pic! I’m quite fortunate (or maybe it’s through my own making) that for a business based around women essentially getting their kit off, the majority of my followers are women! 95% of my engagement comes from them too. So, like your page, maybe there’s something in the genes/jeans that doesn’t interest the men enough! Overall though, I’d say that you losing the people that aren’t keen on the stuff you post beyond the hot pics are definitely worth losing because your profile will grow faster with genuine, fully engaged followers. Like me! Love your stuff. Don’t stop ❤️", "guys_ig1": "I follow you warts and all but I keep following you as you are a real person and have real problems and that I can relate to especially mental health worries I am a manic depressive and seeing someone who isnt afraid of shouting about there own mental health is a very endearing quality. Please keep the warts and all image its important 🙌❤️", "carysdufort": "One of the main reasons I follow you is because you embody the true balance of masculinity and femininity. You are yin and yang, light and dark, and that’s what makes you stand out. Nothing is good all the time and it’s so refreshing to see somebody who is constantly learning to be comfortable with themselves and share the journey so others can feel more comfortable too.", "aleahbaxter": "Appreciate the honesty x", "hannamarijan": "💯💯❤️", "rominafa_": "👏🏻👏🏻👏🏻👏🏻❤️", "amyharpr": "It’s women like you paving the way for us to love ourselves entirely and for THAT I am thankful. Adore you 💚", "shift_by_marvin_lee": "Yer still hot when sick and having other health problems. 💜", "rowan06g": "Maybe it’s because people tend to use social media as an escape from reality. Though Instagram doesn’t really help, with longer posts like these you have to actively choose to read more by clicking under the post. Subconsciously reinforcing the idea that the substance of a people is found in their image rather than their words", "m0rph01": "Still here, not going anywhere. 😊 😍", "emilynardini": "Your caption is so so true beaut. People who feel like you probably feel scared to put their ‘true self’ out on here because of the IG standards we put on ourselves. A caption like this can hopefully make people realise, just be you!!! ❤️❤️❤️", "alexandraroach1\nVerified": "Verified", "aniahelsinki": "You are still a wonderful begins and it is amazing that you are true to your self 🔥", "hanldw.x": "You still fine as hell!🔥 Yeah I get it when I post anything to do with my friends or something I’ve done in work that I’m proud of. I’ll loose followers (mainly boys) because I’m not posting a picture of just myself 😒", "tracykissdotcom\nVerified": "Verified", "abokz_": "😂😂😂", "carminamasoliver": "❤️❤️❤️", "littleminxn": "❤️", "msmayafelix": "i relate to this so much! I know that the posts that will get more likes are me in my underwear, but then all the comments are boring samey sexualised compliments from men or gross strings of emojis.. but the real, interesting engagement is always from women. Especially if I post something honest or vulnerable. I’d rather have that, but it definitely isn’t what brings in new followers and likes 😂 at the end of the day I just have to ask myself ‘what do *I* want to post regardless of the response it gets?’", "asheleylynn": "The realness of your page is why I follow🤩", "nostradumas1973": "Genuine people are cool people.", "larry__diamond": "I always find it very refreshing that you have the disclaimer. The glamour aside i find it inspiring to see sexuality treated correctly by a new generation and i have a daughter on the way so it fills me with hope that free and cosmopolitan culture can continue to grow.", "beaubyron90": "Nothing but real talk! 🙌", "muddin02": "Realness is best, keep up the goodness! X", "into_awsumness": "@reedamberx you're going to be alright. Here, some love all the way from #India❤️❤️❤️", "recluse_420": "Perfect isn’t real though! And real is true beauty ❤️❤️❤️", "royneary1977": "No doubt, I love seeing the sexy posts you share, but you're so much more than just those types of posts. When you and your guy were at Hedonism, which is a place i hope to visit in my lifetime, I was taken in by the scenery both of the place and the both of you, but you were also sharing your aspects of your health, mental, emotional and physical health, near daily and it wasn't all roses. I didn't like that you felt ill, just like now, but seeing you, ALL OF YOU, as you are human after all, endears you. I love that you are the way you are and will continue to. I hope you feel better soon.", "cervezapodrida": "I love your profile, since you're so real and down to Earth. I'm non binary and I wouldn't show up in your statistics because well, social contract sucks. I've been following you for years and you're very inspiring! I know you care about followers, but maybe those who leave because of these posts didn't even deserve to be here in the first place. Cheers! ✌🏼", "jack9425": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "moggietri": "I find that strange, that people unfollow you. I follow all sorts of people, sports stars even peoples pets. Sexuality, colour doesn't bother me. Insta is a bit of fun for me. I like real posts as it reminds us we are real", "phoebe_simone": "Ya still cute & sexy 🙌 hope the outbreak isn't too painful & that you feel better asap! 💛", "dimazelenkov": "and women do not want to come in fantasies? let me lay out acne and see how many women except mom likes ❣️ my post.", "pepitalaconchuda": "F*uck Idiot Monkeys!🔥", "becky.j.s": "If I could follow you again and again I would 🤘🏽🖤😚", "aalves": "I think that the curated versions of people are a way others like to escape reality - social media is a double edged sword or being a place of community but also very isolating and impressionable on one’s mental health. I think that you gotta take it for what it is and keep engaging with those who are truly interested in your message/mission/values etc. Girl fuck the people who don’t want the real Reed! They aren’t worth your energy when there are faaaaar more individuals in need of your shared truth #fuqthecrustymen #youbeyouunapologetically", "joozeffff": "😂😂😂😂", "katfoodd": "HONESTY IS JUST AS SEXY (if not more so) THAN A NUDE SELFIE!!! Fucking love this❤️", "faiepdeoiad": "Your still beautiful though", "hannahmacc93": "I love seeing the real side! I enjoy your pics and your content and personality, this is your own personal account as well so you should post whatever you feel like! I love seeing your LGBTQ+ content and I’m sure plenty others do! 🏳️‍🌈💜", "pete.6618": "Get well soon Reed", "avdrom3da": "I'm the opposite. I started following an account cause I liked the girls style and make up, but quickly unfollowed as every single photo had the same fake smile and photo perfect face. It was way too fake for my liking.", "philstringer86": "Wow you look sexy reed amber sweetheart ❤️❤️", "crzycarl": "Much love for you..", "thomasalanchristensen": "@reedamberx. Just take care of yourself and get well. I am not perfect and that is the reason I do not post anything on Instagram. I know women see me as a hideous, repulsive and worthless creature.", "simwise": "Mate, I’ve given up on Instagram 😂 I stopped trying to grow followers on here as I was finding the same thing happening (gain a bunch only to lose them from showing my personality) and actually the amount I have are perfect for me as they are mostly active and involved. I’d rather have a small amount who understand who I am than loads of strangers who will unfollow me for being real. @itsgemmaedwards deleted a bunch of her followers and was loads happier afterwards, I think we all get so caught up with quantity that we forget it’s quality that’s important x", "oloni\nVerified": "Verified", "erika_leadbeater": "Got A LOT of time for this!!! 🙌🏽Toxic positivity is a thing! Thank you for being authentic in sharing the good, bad and ugly! Keep sharing the truth queen. We are here for it all 💅🏼", "alyssaalcatrazz": "💜💜"}