{"gaz.jones79": "@reedamberx every man as their fantasy but you have to respect the womens wishes", "swills43": "Is it not a preference?", "claudia_bzz": "I swallow usually, but I like it to drip out of my mouth to... 😇", "happyhedonisthuman": "It's to who ever is doing the job. My partner she usually says yes especially when I eat fruit 🍍🥝🍓🥭😍😂💯🤤🤷‍♂️", "tommyrose__": "I'm actually allergic to semen, so I have to spit now. But whilst I didn't know I had the allergy I was all for swallowing. Makes me sad I can't now!", "gennfrancis": "Hell no! ✋🏽🤣", "lymekhaleesi": "In the old days swallowed always felt as tho it was a sign of endearment and passion (like when he would eat me out and absolutely enjoy every lick and taste ... that would TURN my the FCK on!). No since all my nausea and horrible TMJ I actually just recently started to miss giving him head! There’s just nothing like seeing the one you love deeply enjoying your touch and getting lost in the sensual sensations you are providing them! Thank you for sparking my desire once again... maybe he will get lucky soon 😉 The TMJ is such a bitch of a barrier, I’m fearful my lock jaw is so tight I might hurt him lol but I think you and Florence are spot on: Open and Honest Communication is key ♥️", "amandajohnson_84": "Incredibly sensitive gag reflex because of bulimia when younger. I'd love to have a mouth full but my mouth says nope! And that's not sexy and a total mood killer. 😂", "nando_silva5": "Beautiful ☺️☺️", "vibhu_is_me": "I will fuck you", "kangruibo": "Neither! But come up and kiss me with your mouth full. 👅A nice deep open mouth kiss with a mouth full of cum. Always recycle! It’s sooo hot! Sharing is caring😜 Definitely a subject you should cover on your channel. Cum kisses 😘", "thefastelaine": "I have never had the pleasure of performing fellatio. As a lesbian when you go down on a woman you kind of do both depending on how wet you get her.", "freetoesy": "haha !!", "joshn95": "Whichever don't mind either I'd rather they not do it when they don't feel like it just off putting", "percings11": "This pic is so hot", "sertsikicihakan44": "Have you ever eaten a Turkish dick?🔥🔥🔥", "hltbone03": "Swallow 😘😘😘", "mikechampp": "U should swallow every time if u love your man", "martufilmann": "Both", "sk8bruno4fan": "@daniitrixx", "maja_mittelfinger": "Did u guys use lube for that shot? 😁", "marcusrastasenior": "Simply the best looking woman in the world💯😍😍🔥🔥👍👍👌👌💎💎👑👸🌎", "katelizabeth_rose": "Love that you and Emily are working together!", "lastraven1986": "Depends on the context I've always been a fan of gargaling and bubbles myself 😂", "natalia_vladimirova555": "Very nice your face my baby", "tri_cam_coach_": "Both.... some experiences are sexier when you swallow, other are sexy when you open your mouth and let it drip out 😈", "rhiwnantfarmwelshblacks": "Beautiful yummy", "damien66677": "I think it depends on what mood u are in babe xx", "mrs.leatherworker": "Swallow is cute 🦄", "n_beaches": "Swallow 100% of the time!!!!", "paulj060669": "I think it should be what ever you want to do your choice", "eljoeypr\nVerified": "Verified", "gavmoody78": "Always swallow", "anthonymullarkey5": "Swallow every drop❤️", "weegingerprincess": "I'm a swallower bit now I'm worried about the reveal later 😂", "doyouknowjenna": "That picture is so beautifuuuuuullll oh my", "jacklainggg": "😍😍", "sophie.bramley": "Whatever you decide! And besides, either way you literally made them cum so it shouldn't matter if you want to spit or swallow", "frank.marcha": "Only spit when required 🤪", "missmarkham93": "Filthy!... in a good way", "patrycjaaolejnik": "For me it's like if my partner would immediately go wash their mouth after going down on me", "jlesford": "I like this 😃", "420exotics_": "Definitely swallow 😋", "rinaellisx": "Swallow 😈", "luluerglis": "Swallow protein 😂😂❤️", "filipealphawolf": "❤️❤️❤️", "soboo.boo": "Both ..depending on what I fancy doing with it in the moment 😍", "cluelessmoomin": "@chavo4207 @joshyboyd @majinbae18 a question for the ages....", "linleygene": "I believe it's up to your partner! My x used to swallow! .its actually full of vitamins! And she loved it! I will keep my helmet on with my penis peeled! Lol ❤️💋", "gr0kbot": "Neither. The answer is facial.", "andresilvabullett": "You should do whatever you want to do! You’ve got the power!", "b.cordeiros": "For me it depends on who I’m with and the mood, mostly I swallow but I’m not against spitting hahahah", "5by_five": "Whilst I'm personally a fan of swollowing technically you shouldn't do either because that pickle should be wrapped even for bjs 😅 it just takes one liar unfortunately. Even in a long term relationship. Do as I say not as I do moment? 😂", "kidflip360": "Tell me you thoughts 💯", "jason_carpets": "It's up to you if you want to, you should feel no pressure in a relationship", "missmarissalalo": "I always swallow, as I believe anything that is a major contributing ingredient to creating another life, must be of some value. Like a magic protein shot. 💚", "caroline_montt": "I honestly don’t like swallowing, but I’ve done it once and I pretend to lol.", "petedunckley": "Spit, swallow or swap?", "onemanrace": "Lot of people overestimating how much protein is in cum 😂", "g3orginajevon": "Always swallow", "uhshavaughn": "Neither. Don’t want it in my mouth lol", "big_tibbz": "🔥", "unlucky_vampire": "Facial", "phils_pick_n_mix_videos": "I swollew im a classe bird 😋😋😋", "mahnaz1380m": "Swallow 😋🤐", "intothenight13": "Honestly doesn't matter to me. I make sure to ask if it is okay to finish in there in the first place. 🤘", "iwide0pen": "Honestly it’s their choice. Can be a little disappointing when not the same page. 🙁", "fittonchris": "All my exs have swallowed as they liked it. Your videos make me smile so looking forward to watching it", "cattrill_66": "😊🤤maybe a hot salty gargle will halp your tonsils get better 💋💋💋💕💕💕💕💕 if not let just get rid of the tonsils and then you can swallow what ever you want 🍌🥒🍒😊💜🥰🥰🥰😘😘😘😘", "philstringer86": "Nice picture look beautiful xx❤️❤️", "emilymartin333": "You should do whatever you want to do and not be pressured by others", "michaelalea_xox": "Swallow always 😍🤑🤤 protein baby", "metalmickey1973": "You are so beautiful xxx", "_shes_maria_": "Swallow", "oloni\nVerified": "Verified", "porterbhoy": "Reed amber💯 awesome ⭐💋💎♥️😘", "elsieandfred": "You should do whatever you wanna do, I have totally changed how I feel about this with age changes, various lovers, boyfriends diet (who remembers Samantha is SITC tricking here into drinking wheatgrass shots? 🦋", "lensational_uk": "How are you doing today Reed?", "gyboconsultancy": "YES 😍", "barrypompey51": "Glad to see your looking a bit better! The pictures you posted must have been you & Florence filming today! 💖💖", "sdm0687": "😍😊", "minniequinn_x": "Honesty time. Literally just had a banging 69, he came and I swallowed. Waste not, want not! Definitely always swallow, not only is it sexy but it's just convenient haha.", "niletac": "Whatever you decide you want to do. And it shouldn’t be pressured. Ever. Swallow the load or spit that shit out. Plus everyone tastes different and you just can’t hold it in. Your body your choice", "imo_ortiz": "Swallow 😉", "lilbruzeevurt": "Oh my days", "wendyclxxr_": "it's not going in my mouth at all unless u want me to puke on u 😂", "dimazelenkov": "this is not drooling?", "bruno_locci": "Beauty", "niknak3122": "Love your eyeshadow!", "sabrinaleighsauter": "Swallow. Zero waste", "rockamollydesigns": "Spitting is a filthy habit 😁", "r0bar00": "An ex-girlfriend of mine (and still a very good friend), when a pervy cab driver asked her the same question once upon a time, replied ‘I gargle, mate’, and succeeded in shutting the cab driver up 👍🏼"}