{"salter_lovelife_x": "A male female combo working their way up your body, licking and sucking all the way ❤️😍", "shrooomcap": "😍💖N💖I💖C💖E💖T💖I💖T💖S💖😍", "shy_abusa": "Do you mind reposts with tag?", "alexthegeordie": "I know because you have told me, but I can't say on here 🙊", "u_did_not_so_i": "Your nipples are damn hard 😂😂", "zingo_zang": "Whatever It Is You Must Be Cold...???😜😜👅😉💖x 😂", "yash_5992": "You might be thinking abour that Intense and Sensual moment with your fav Superstar..", "fastphil61.pa": "Goldfinger", "inderjeet5714": "Sooo sweet", "elminloves": "Snape! ✨", "tony.houghton.967": "Thinking about the calls your going to get today on 66", "xtina235": "Great photo 🔥", "tklfanpaul": "Looks like you are thinking about anticipation to me! Perhaps your feet just got massaged so they are really sensitive and you’ve been told your ankles are about to be tied together so your soles can be teased with light finger tickles. You want to touch yourself but know the tickling will intensify the more you do. Oil and a hair brush are ready to be used as you come close and this is what excites you most?!", "mrrkyaa": "To the thought having 10-15 oral orgasms", "emmak_michell": "A lover tasting and eating you from underneath a skirt. Being bent over and spanked. ❣️", "devanholt": "❤️❤️❤️❤️❤️", "andresilvabullett": "must be cold 😉😘", "bigjohnb": "I must get the central heating sorted!!! 🤣😂🤣.....😘", "simonwellavize": "This hard nipples being nibbled and suckled by a “lady friend” whilst your clit is being rubbed by a rock hard monster cock just before he enters you with one hard massive thrust, filling your tight pussy and driving you closer and closer to squirting heaven. 😉😍", "__orko777__": "Gushing over ... my little ponies? 💘", "justleighsteele": "Hmmm, maybe about being sexually sacrificed on an altar in the forest with dozens of white taper candles dripping wax and incense and smoke and people in hoods and capes and the flicker of candle lanterns hanging from tree branches all while under a full moon? Or maybe that’s just me 😍", "bourbeon": "Voldemort wearing nothing but a tail butt plug", "photographer1223": "So artistic!!!", "johncaldwellphotography": "Looks to me like you’re thinking and feeling into the 1970’s vibe you’ve got going with your sunglasses and sexy gold outfit, and trying your best to get a cover shot for the x rated video you’re going to make. J😊", "shanerhead": "Obviously me", "fabianomcgrady": "Me", "superjneil": "Canes chains and trains", "rayansuar": "❤️❤️❤️", "nicholson4968": "Me 🙏🤣🤣🤣🔥🔥🔥🔥", "cckkjsh": "also getting gang ba*ged?", "minniequinn_x": "One of the animated Disney princes", "mrlake83": "Seeing another man and a woman enjoying themselves in public and trying to get away with a little too much 🙌🏽😉", "looping1979": "Thinking to your followers jerking off to you and all these cocks ejaculating because of you.", "shaun_knows": "Jesus I'm loving the nips, generally want to play with my self now 😂🔥", "jxenius": "Daddy", "decembersagittarius": "Being on the beach of Jamaica 💙💚", "das_kristinchen": "The return of the soviet union, comrade", "agp814": "🔥🔥 Your amazing", "adam.turner.12764874": "Yummy ❤️", "anthonyhary": "Glorious", "ser.severus": "Fuckin ARRTT", "trainer77777": "Bugs Bunny?", "marcusrastasenior": "Prettiest hottest sexiest fittest😍😍😍😍😍🔥🔥🔥🔥🔥👅👅👅👅👅💪💪💪💪💪", "frankgutcher": "A slow sensual tongue lashing....❤️❤️❤️", "andresmatu": "🔝🔝🔝🔝🔝", "rcorpuz73": "Hedonism Resort and Margaritas?", "blacklabel1056": "I would think it is likely a couple of my comrades in the fire service. We all know of the tremendous hose skills firefighters possess.", "_rosesgold": "Ice cream? It’s obviously ice cream.", "alunmartyn": "🔥💋❤️😉", "samthethird_": "😍😍😍", "kedaikonromakneneng": "your thinking about taking an advantage in a blind guitarist.. forcing him to play \"while my guitar gently weeps\" while u exploring his body 😁", "parisxhk": "❤️❤️❤️❤️", "potatoattack101": "Damn that shirt! Work it girl. Love your body confidence 🤗", "chriscollicott": "Pancakes bacon and maple syrup 🤤🤤🤤", "ozone75": "Being pleasures over by a group of men?😛", "kaiwatts1": "You're thinking. \"I can't wait to buy a few cans and go and get shit faced with my friends in the park on a summers evening with a few tunes playing out on someone's phone. Laughing uncontrollably at something that happened years ago that you all remember which happened at that one festival \". I can't wait either!!", "rechain87": "About me, while I was down at your feet 🦶 😈❤️", "rusty24488": "Are you touching your own sensual soft skin.??????.😘😘", "mikey_bleakley": "This picture is amazing 😍😍 I dont care what you're doing just keep doing it 👍👍😘", "dieddugs": "Ugh youre gorgeous", "cattrill_66": "💜🔥🔥🔥don't know if I'm right but I'm going for barbarella and aliens things from out of this world just like you look works for me every time 😍😍💕💕💕💕💕💕💕💋💋💋💋", "batangglorietta": "😍🌹❤️", "youseesaf": "Just jizzing over the thought of the Deliveroo driver ringing your bell 😉", "niamh.owen": "Kidnapping 😮😮", "dar.b03": "Omg...so sexy! 😍", "dirtyunclegary": "Sucking on your toes.", "dimitris_ntov": "Me?😈", "dank_side_ov_the_moon_": "wat ever it is got them nips going full everest 🔥👌", "the.brave.new.world": "Being kissed from your hip bones down to all over your thighs", "fiona.sgr": "you look sooo good", "leeshabarber": "Being stood on by someone in boots", "david.townsend.39904": "The ghost of Jimmy Hendrix, came to look at your guitar. Saw you and couldn't resist a little pleasure while you slept. 🎊", "filipealphawolf": "Baby, you’re amazing! 😘❤️❤️", "linleygene": "Duchess! Your thinking about your sexy body ❤️🔥🔥💋", "aysiaeliz": "Girl where did you get this TAWP", "dazzay79": "You getting f**ked hard with people watching", "big_tibbz": "Epic", "philstringer86": "Nice picture look beautiful wow you look beautiful reed amber send my love to you and your family and send kisses to you ❤️❤️xx", "crescentsmile_": "how good your labia feels in your hands maybe :)", "tones_cookies_andshyt": "Owwww", "scottcook850r": "Thinking when kfc will reopen lol", "betancourtjessica_": "❤️😍", "lilymariagoodchild": "Why your boobs so good doe", "vikkiberetta": "My strap on in jamaica 😜 miss uu💕", "porterbhoy": "💯⭐ reed amber looking gorgeous and sultry 🌹🌹🌹🌷", "_undercover_poet": "A fella dressed in your satins beggin’ for a peggin?! 😈", "do_you_like_bisketti": "Jodie Whittaker!", "donnamayx": "Someone playing with your feet!", "kosmosgirl6_": "Sensual woman ✨❤️", "4peeeter": "Obviously thinking of me, dam hot 🔥 pic", "m.o.l.l.y.g": "Joe from You🤷🏽‍♀️😂", "grimshaw3": "People on the island"}