{"supertonii": "As I sit here looking at the bruises on my legs, feel the tightness in my chest, a faint pounding in my head. It reminds me of my determination, my zest, my fight. A warrior spirit who can find it hard to fit in, fighting against her own learning curve, sending out love from within.", "alexthegeordie": "I am intelligent witty and charming and every day I learn to be more open-minded and accepting of people who have different ideas to me.", "ugghnonames": "This is terribly hard to admit but I'm really good at my career field. I hate saying that but it's good for me to tell myself. Thanks for giving me the opportunity.", "caitijoey": "💕this is a beautiful idea✨", "nigelshinnorsphotography": "I won't write one about myself but instead will share one I found before. Never found out who it was for or from but it would be nice to be on the receiving end of it I suppose. \"There's something very special about you. I noticed you the very second I first saw you. You have a very unique face that's so exotic I can't explain it. you're more than just attractive. There's something very unique and original about your look.\"", "bing___bong____": "I’m taking better care of my mind and body than I ever have and I’m certainly feeling myself lately! 🔥 Quite enjoying the confidence, energy and sexy spirit that comes with self care. I rock 😝🖤", "cristinapilo": "Im strong, confident, sexy and beautiful and I deserve everything good that comes my way. 💖", "dalyoung66": "After losing my dad and sister within 3 months of each other I've discovered just what a strong person I can be mentally. I honestly didn't think I would cope with there loss and had a few dark days to start with and being there for rest of the family..I really am quite proud of myself as I'm very reserved by nature x", "munyitree": "My furbabies are still not with me but I got out of a terrible situation. It was and is a hard thing to do but it goes to show the strength I haveEveryday that I learn this, I am stronger and kinder to myself whilst also learning what I actually want out of life for myself.", "louise_duke": "Im beautiful, kind and caring, I can pick myself back up when I go through hard times or feel low, I have grown in confidence and got stronger over the years, I no longer let the negative opinions of others affect me so much, I deserve to be happy, I can do this!! 💪🏼 ❤️", "maddierobinsmua": "Thought of u today lol \"funny mouth\" story?? lo....l love from india reed..... u beauty 😘😘", "doc_mabuse1": "😍😍😍", "martine.metta.beausoleil": "Right now, tonight I can say that I love my whole self... I’m loving the procrastinator, the self sabotaging me and the tightness that blocks me from deep breathing... this shadows have been a part of me all my life, 44 years... and today I finally accepted them, forgive myself for trying to push them away and I love my whole self... my yoni egg is helping me in building healthy boundaries and slowly but surely loving myself entirely, as I am 💗💗💗", "patrick.buddle": "Hi Alfie didn’t realise you was a holy woman haha", "sarsonjames": "Today I started a new job. My first proper job not in the service industry. I am proud of myself for making this step.", "emjg86": "Right now, I am proud of myself ❤️", "natajack": "@eleighb7 @_kessiemay @chloewood23", "_kessiemay": "Hand built, my empire is my own and it's built with love and morals", "miss_black_reign": "I am a survivor - going through hell but staying positive and determined I will come out the other side stronger 🤗🤗", "iam_melodi": "Love you", "lastraven1986": "Dear me, how you doin! Love me!", "mcnab_parsfan_thfc_ps4": "I am mental (but in a good way) I try my best and treat people as I'd like to be treated (but if you fuck with me or my family & friends you'll see a part of me that frightens even me (inner demon : aye what he said) )😆😆😆😆😆😆😜😜😜😜😜🤪🤪🤪🤪🤪🤪🤪🤪. Keep moving forward all", "altyri95": "I generally feel like crap about myseld but the 1 constant that I do like about myself is my beard.", "speedospee": "I have great taste in women because I love you 😍😍😍", "jack9425": "❤❤❤❤❤", "thetrexorcist": "I work something cancer patients, and here's something nice a patient told me last week when she gave me a plant last week: \"There's something about you. I saw this little plant coming up under a tree in my garden and instantly thought of you. Take it and think of me; nurture it, take care of it, give it the same love you give your patients, and it will grow to be beautiful just like you.\" Of course I had a massive cry in her arms in the middle of the waiting room in front of some coworkers about 10 other patients. But it is the first time someone has given me something to take care of. Happy to report it has doubled in size since she gave it to me :)", "bethanyeallan": "Despite my past addiction issues I actually have really strong will power, and I always try my best to come from a place of kindness ❤️ this thread has made my morning! X", "cordero90": "Hello beautiful how are you?", "dellezchi": "Perfection ! 😘", "sashshots": "Your smile matches your great bug heart. Beautiful and warm. Have a great day.", "ahsiathomega": "I'm a very reliable bloke, I spend my time doing for others. And I'm a pretty amazing father.", "quantummanagement": "You are stunning @reedamberx ❤️", "simlude": "Every time I guff I feel proud to be me 💖", "matt_j_france": "I am really good at making lists and getting organised", "cattrill_66": "🤗allways go the extra mile for those who help me ❤️❤️reed", "khurnrhall": "Im a cheeky guy who will never give up in my worst dark times, i will help anyone and i have a good sense of humour, plus i look young for my age", "daniel_keys65": "🔥", "_lifeoftaylor": "You’re so incredible, so blessed to work with such positive and beautiful people 💙💙", "david827mitchell": "@reedamberx absolutely stunning amazingly beautiful", "bobomacinsta": "Your beautiful, kind, your body is stunning, feet are on point 😉👣you have an amazing smile and look like you’d be fun on a night out 🥰🥳xxx", "marcusrastasenior": "Wonderful woman of the world forever💯😍😍💗💗🌹🌹🔥🔥👍👍👌👌💎💎💖💖💋💋💞💞💕💕💙💙👑👸🌎", "dotty.rude": "I like my sense of humour and yours too btw ;) and Im a good listener who always trying to help.", "design_huddle": "You are good enough!", "anabgc_19": "😍😍", "jessic_aa": "I’m an introvert and I love it", "leaj25p": "Ive come from nothing, told I’ll be nothing. Now I’m an accomplished documentary filmmaker, helping to spread my good vibes and intentions though my films. One being In Focus, helping to shatter misguided stereotypes of women in the adult industry, in a positive and progressive way. ( oh im such a big head)", "andy_smoky_wright": "I am a good friend & listener", "itswatty": "I try to be kind and I'm always there for the people who need me.", "axo_mx": "Good listener and dancer here too 🙋", "its.me.chris.palmer": "Lovely unassuming photo but very 🔥", "sixty6mag": "@reedamberx you are an amazing inspirational young women. We have watched you battle your own demons while inspiring young women to express themselves and fight through theirs. Never underestimate the impact you have on the world around you and keep being you. Love you. From all the @sixty6mag family. 🖤🖤🖤"}