{"blacksheepclubco": "😍😋", "young_artist_does": "@young_artist_does smh tbh", "bellababy9697": "Gorgeous thank you for being a positive role model ❤️❤️❤️", "sandy_floss": "The negativity on this post is ridiculous, the whole point of this was that you should feel comfortable in your own skin. Always hyped on the body positivity posts @reedamberx 😁", "baroness.natalia": "Reed, you're honestly so unapologetically confident and it's so inspiring to me. Thanks for helping me feel beautiful and sexy. You gorgeous girl xx", "parisxhk": "Ur amazing! Love u ❤️ ignore the negativity they’re idiots 🚫", "notkyra": "You're my favourite human being 🙏🙏", "supertonii": "Weird how there’s so much negativity on a post about body positivity. You look great, Reed and the message you’ve been trying to send on IG has been incredible. Please keep doing this 💖💜", "kirsten_holland_": "ahh please stop being so god damn gorgeous and fit !!!! this post got me like like :0", "littlemisstanz": "Girrrrrrl you just keep doing what you do cause I’m sure as hell picking up what you’re putting down. What a total babe and a beautiful person inside and out. 💜", "hasan.porkar": "😜💦", "chupa_chup00": "😘😘", "insta_ladies_feet": "I only like the one on the left better for the view of your gorgeous toes xxx", "igfeet25": "Would I love to suck those toes.. he’ll ya", "kushnfeet": "FEET SEXY AF", "footworshipdean1": "Sexy and beautiful with nice feet", "tombolainkd": "Always a fittie! And ya know why? Cause you’re the realest (is that a real word?) grrrl our there ✌️", "kenneth5718": "Prefer u naked", "wlammy": "I just love you so much 🙏", "clarkey196608": "You are just a great human being @reedamberx", "cattrill_66": "💜💜 just the next great look 😘😘did you say it comes in yellow and black 🤗🤗or is that a jcb ❤️❤️😘😘😘😇😇😇love colin", "9.5s9": "استغغرالله وأتوب إليه صلو على النبي محمد🌷🌷", "adam.turner.12764874": "Very sexy", "gray8687": "You look fit and gorgeous as hell and sexy as hell", "gary1445": "So beautiful", "tiarobertsxo": "Love you and your vibe so much😫💜", "peeweesmith86": "Looking sexy 😍😍😍😍🌷🌹", "yupitsmebergy": "👍👏😘", "dante_espanol": "Bir sokuş, kaç kuruş?", "matteodiclemente996": "Beautiful", "stephenbarry86": "@reedamberx beautiful sexy pics looking really gorgeous ❤️", "markawalsh90": "You look sensational, absolutely, stunningly beautiful,", "leannep_": "💛💛"}