{"david827mitchell": "@reedamberx wow absolutely stunning amazingly beautiful ❤️ ❤️BIG FAN", "buttered_paranoia": "I think all bodies are good bodies but I personally tend to find most attractive what my partner currently looks like, and she and I have been eating a lot of sweets lately and I have to say I'm really digging the squish lately 😁", "gavanellie": "Women of all shapes and sizes are beautiful.", "jo.anne3624": "Do any of you hear from mikaela witt these days?", "stevenlobel3": "Sexy 😍💦", "richardplato": "you look amazing", "lastraven1986": "Out of curiosity what is your opinion on the other side of the spectrum the shaming of those that choose to have surgery as far as I'm concerned it's up to them but there are some nutters out there giving hurtful comments on every picture because they aren't \"natural\"", "wwe7072110": "Woooow 😍💦", "baroness.natalia": "Anyone wanna join a chill gc?", "3ren_ozdrm": "@reedamberx fuckk you", "chickchico": "Ur lips", "reedamberx": "Shaming ANYONE for anything is wrong. There is nothing wrong with getting plastic surgery as long as there's body honesty. This post is about photo manipulation but you do bring up a great point. I follow and adore @alicia_amira posts about her body and journey with surgery which is truly wonderful 💖", "alwaystiredzzz": "FKCN queen🙌🙌", "fabas0406": "Que buena estas 🤘🇲🇽", "jamesbrewer3": "Very well said xx", "hiclamour": "Preach that truth 💖xx", "pro6lemboy": "💘💘💘", "hamed_nos": "Fucking hot💓", "adamlehreruptown": "You certainly don’t need photo manipulation to be beautiful", "bobbydavidhewitt": "Reed has the best tits I've ever seen. And the best nipples. Ever. And that's a lot 🤤🤤 seriouy, I wish we didn't put so much pressure on girls, boob wise... I don't get the bigger is better claim.. Love a lovy petite pair as well... But reed's... Omg ❤️❤️❤️❤️", "noogie7": "I din't usually like latex or pvc but this is pretty good", "rhiwnantfarmwelshblacks": "Perfection stunning shiny sexy", "ladislav_znava": "Beautiful Red", "greatsexmatters": "Awesome post. Live happy, healthy and always horny... and life will be grand!💜❤🧡", "terrymasters": "I love you as you're right now.", "nodderw": "If you’re happy we’re more than happy 😍🔥🔥😘", "getcoral": "💕 beautiful", "killeroftenchi": "😍😍😍😍😍Stuning", "timbo1324": "@reedamberx would be more than honoured to meet you in person because your so beautiful and gorgeous and stunning", "ianmichaelpowell": "First pic waaaaay better", "adam.turner.12764874": "Very beautiful", "404ariellenotfound": "This pic is, I hope people realize, inhale vs exhale. Our bodies look so different at any second or angle and instagram creates a standard of what we think we should look like. I love this pic 😩", "pixelromancedotcom": "Reed, you look great on the left! x", "amiralifearofgod": "😍♥️🔥", "lummysteve78": "Happy Tuesday Reed you sizzle and scintillate in every shot and are truly stunning!! #PrettyinPink #LushInLatex #RacyReed #LoveIt 🔥🔥😍😍❤❤", "mdavison906": "Pritty in pink xxx", "oceana_celeste": "Looks so much better without the shop! Love you lots xoxo", "drmakween": "You’re my spirit animal😻✨", "the_garyldn": "Mmm pretty in pink", "oscaryappert": "🌷🌷", "cigu86": "The shadow 😂", "shogoracle": "You are a stunningly beautiful and sexy woman. Filters may change your appearance in a picture but true beauty is always in the eye of the beholder 💕💕", "vizualography_": "👌👌👌👌🔥😍", "bigboy_brum": "Stunning body in pink latex 🔥🔥🔥", "tarqoos": "Both pictures look good 😍", "wakedsleiman": "❤️😍", "joozeffff": "Honey 👌🏻🥀", "jamesfett2013": "🔥🔥🔥🔥", "rudd473michael": "You look Absolutely Incredible in that Pink Latex Dress of urs Mistress Reed ❤️❤️❤️❤️❤️", "billytully_": "Yum 🙏🏻", "taylorannemade": "I like the left soo much more, it looks natural and like you. It’s nice that you are showing the comparison.", "barrypompey51": "You look stunning reed in both pictures! No wonder young people growing up have mental issues regarding their body shape etc! What the media etc think is right changes all the time, one minute you have to be super thin, then with lots of curves, and even a big butt! But at the end of the day it's your body and what makes you happy, a partner whether it be male or female should take you for you the person, the personality! Not because you have big boobs or legs that go on forever or a six pack! That's one thing I like about you and others like you! The person inside is more important than the one on the outside! So reed keep being who you want to be not what others expect of you! ❤️ ❤️", "ilciosmii": "Can I cum in your mouth?", "furkanbadir": "Right real , left photoshop ❤️", "szexbox.hu": "🆒👑💋", "superroo80": "@reedamberx stunning 💓😍💓", "speedospee": "You are fine as fuck.", "lu6fer_morn1ngstar": "💯💯💯❤️🔥😂", "shootatmine": "stunning", "kyomichey": "Love this Reed! So true! So minor but so damaging to a lot of people! I think if people stay honest with themselves and others it will help massively! ✨", "erocdog": "Happy women always look extra fine 🐶💕", "ved6675": "Looking hot🔥❤️", "leni.sohodko": "Love this post❤️", "dazzay79": "Absolutely flawless 🔥", "quyakalashnikova": "Such beauty milady @reedamberx 😍🌹", "mc_darez": "I think you look great without the touch up 🔥", "marvolo_again": "What a message!! 'I hope our next obsession is to just be healthy and happy no matter what shape or size we are.' Self-love takes many forms and self-appreciation is part of that 😍😍😍", "samflastichughesmusic": "I'd wear that", "peeweesmith86": "Amazing 🤩🤩", "manico63": "It's sometimes hard to feel good about yourself, but I find if you can smile the world smiles right back at you. So remember to smile into the mirror every morning.😍", "craig.overton.54": "You are sexy and beautiful woman", "sherwood.mick_1971": "Gorgeous ❤️😍", "eugenebanks": "You are amazing", "cdwc72": "Always interesting posts. Instagram has made it worse I think with multiple filters etc. People seem scared to show themselves in case someone.whom they perhaps will never meet,says something derogatory about their appearance. A lot of people are fragile too so criticism can be very damaging mentally. So bravo for continuing to post positive messages.", "dellezchi": "😍", "c8t_gee": "Either way you have fantastic shoulders. Keep up the body positivity 😍🦄", "chloeisidora": "💕🙌💕", "pixie_ramen": "To be honest I think the original looks way better anyway", "opal_skies_": "Is it bad that I couldn’t see the difference at first and thought the second on looked normal😣😔", "critchleytrevor": "Beautiful just beautiful and hot sexy lass love and God bless you ❤️❤️❤️❤️❤️xxxx"}