{"damn_jazmyne": "I absolutely love your show .... I wish I could play in your show ! I love u and your such a dope person Issa #insecurehbo #iloveuissa #frthoiwannabeinyourshow🤣", "chavonna_": "I just need to be a part@if this show already, auditions?", "5th_avenue_ct": "I am so addicted I cannot take it", "michelletasioni": "I watched the entire show in a week granted that i still had to go to work during this pandemic definitely, eased my stress after a long day.... loved it, such an amazing show amazing acting, much blessings to the entire cast and crew and production theme. Can't wait to see more...", "sandy.c.s.c": "This season got me! So amazing that it has me rewatching from the beginning!! Great writing, great soundtrack, great acting and cast. Thank you! 👏👏👏", "sasi_casi": "My favorite💜💜💜", "cyin_thya": "Can issa have a win please, like a major win , her life is beginning to depress me", "ericaawoodson": "Thank You For Coming Back. I Hope You & @jayrellis Get Back Together And Start A Family. I live For Happy Endings 😍🏆💝", "bfortda4th": "top 3 show ever !!! #insecurehbo", "justme01281": "❤️❤️❤️❤️❤️", "twanjide": "❤️❤️❤️", "dema.82xoxo": "When it comes out in Italy? #season4insecure #skyitalia", "garrettmogul": "If only the Awkward Black Girl from youtube could see this.🥺♥️", "natch_lee": "I LOVE this show, but the episodes are too short!!! @issarae 😩😩", "shelisechilds": "Dear Issa, Yaaaaassss I love the show! But I need more then 27 mins 😫", "philly_boone": "Make ya show hour long frfr", "pverbs31.ebony": "Ok so we need more than 30 mins sis. This is killing me. I know im not alone. We need 45 mins to an hour.", "obeytonioo": "‪Hey girl, I know you’re busy, but... I’m dying. Can you put me on an episode next season? ‬", "nova_orion_nebula": "Kelli carries that whole damn show and y’all abuse her character. Give us her story!!!!!!!!!", "missprettytania": "Can you extend the shows to 1 hr? That gives me enough time to see how Nathan got you fucked up..", "sweetjennyc": "Just wanted to let you know I love the show! Binged it a few weeks ago and all caught up! It's makes me smile and belly laugh!!!! 🔥", "amyjordan671": "Love this show. I am so glad that it is back on. @issarae", "queenubia92": "❤️❤️ i low-key miss issa rappin in the mirror as much as she did in the 1-3ish season. But i still ❤️❤️❤️😍 INSECURE🔥", "brandi.ferguson.927": "The best show ever I’m hooked", "ybarrerab": "Love you sooooo much!!! You are the fucking QUEEN!! Regards from Barcelona!!!", "juniorlimaleitao": "Issaaaa❤️ I love watching you in Insecure!!! The show is AMAZING!!! Kisses from Brasil 🇧🇷 😘😘😘", "amyrashaan": "Bravo 👏🏽 Encore 👀👀👀👀 ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "mercyjasmine89": "😆😆 Sis you should have named it Awkward because you don’t seem insecure in the show lol 😘😘 but I think there was a show called awkward before. Either way I absolutely love the show and so happy it exists. It gives me major feels ❤️❤️", "hodgesknight98": "👏👏👏👏👏", "me_and_tv": "😍 I’m so #excited! Going to wear my #teamlawrissa #tshirt when I watch #tonight!", "muffy_girl86": "Ok Issa I see you this season is hella good 🤣🤣", "_abrownskinthing": "Tell me why I sat here and waited until exactly 10pm.", "un.a.pologetic": "So....i love the show, but i can’t do this anymore! We need your long shows at least 45 minutes with more depth and detail!!! I can’t keep doing this! 😭", "___brooklyne___": "Can Insecure please go to an hour?!?!? We need more!!!! (I know u already said no, but we don’t have very many good shows to watch!!!)", "natural.young.and.gifted": "👏🏽We 👏🏽need 👏🏽longer👏🏽 episodes👏🏽", "tiastylz9": "Issssssssa please tell me you gave us more than 8 episodes 🥺🥺🥺🥺😫😫😫😫😫 I’m gonna watch all 8 anyway and be satisfied but say it ain’t so sis", "wankurdank": "I love you Issa 😍", "baeleeeeeeee_": "Please don’t ever give up or get tired of making insecure !!! Please !!", "spiritualfairgang03": "Binge watching as we speak🔥", "lois__lane": "Season 5 we NEED an hour sis!! 😩🙏🏾", "cmonican": "@issarae is David coming back?", "ranafouda_": "I’m waiting until Ramadan is over so I can watch 🤦🏻‍♀️", "thisiskay805": "I only watch HBO for Insecure. Wonder if there are other shows on the network featuring us....hmm.", "bre_moss": "Bing watching first season❤️❤️❤️❤️❤️", "__journeywithme": "I love the show and I just ordered your book awkward black girl but, baby! I need these episodes longer 💕 @issarae", "andreeaxdede": "I love it ❤️❤️❤️❤️❤️❤️❤️", "mekagyrl": "@issarae @yvonneorji @the_a_prentice UHHHHHH I NEED TO KNOW WHAT HAPPENED WITH DRO AND CANDICE! I have a theory on the whole open marriage thing, but we found out Candice was expecting but I still have questions. Like was there really an open marriage? What were the rules? Because I feel like messing with childhood friends would definitely be against the rules. Will there be answers to these questions this season or nah? 😂😂😂", "californiaadreamm": "Binge Watching All Seasons On Demand 🍫💯😘", "conversationswithkarima": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 Okaaaayyyyyy", "ajes10": "@issarae I would love to know where I can order the white t-shirt you wore with your head piece in episode one season 4 before your event started at the apartment?", "laquittaedwards": "Absolutely love it!!❤️", "all.aboutautumn": "Can Lawrence & Issa pleaseeee make it work", "pareedatsme": "Girl where is Daniel and Nathan but mostly Daniel I miss him😩", "prettybrwnprincess": "Where is NATHAN!!!", "kosherdietic": "Just from watching it 👌❤️", "ohhhm_": "YOU BETTER GET GREATER DICK THIS SEASON😍😍😍", "thisbonggurl": "Loving this season. How can this show be so relatable..i am tripping girl ! Love and hugs", "goddessvonda": "I love this show", "kekeb1love": "@issarae HOW CAN I AUDITION FOR YOU??", "queenn_chancee": "Favorite Actress", "elyssizzle": "This show is so so so so GOOD. Please keep making new seasons!", "melanin_viral": "Its amazing but why its so short 😩😩😩😩is like a pub 25 min really during lockdown please try to increase it like 40 min its ok💕", "flowersnhoney_": "Why 30 mins Issa?!!! WHYYYYYYYYYY 😭😭😭😭😭😭", "rara_amira00": "I wish it was an hour long 😊", "ajdiggs": "Can I just know where ya'll get your wardrobe???", "smessas": "Where is Daniel?!", "prn.cessmel": "Need to have it aired on HBO in Canada!! 🇨🇦", "meg.elisabeth.gorniak": "😍😍😍😍😍😍😍😍", "amor_jose": "👱🏽‍♂️🙌🏽❤️🔥", "such_a_diva_ms_liz": "🔥🔥🔥🔥🔥", "today_we_win": "🙌", "therealjaywash": "@insecurehbo @issarae heard you looking for music and artist I left an inbox a few weeks ago would love a reply", "quayyyyyyyyyy": "Ummm where’s Daniel 😩", "thuglife_1989": "@issarae can we please go back to hour long episodes. We neeeeeddddd moreeeeeee lol", "darsaii": "Issa can we get an hour? 😩😩", "pretty_trinigirl": "Hi Issa can we please get hour long episodes next season? I cannot get enough❤️", "styleyourselfaccordingly": "I need to know....will there be quarantine episode...if so I wonder who issa would be quarantined with...hmmm lawwwrence?! ❤️ This show", "itsalightskinthing": "New season is everything so far !💙❤️", "divayvettecpa": "❤️@issarae❤️@jayrellis❤️#2gether4ever", "mattfbraverman": "@robinthede 🏳️‍🌈🎓💪🤩🗽🇺🇸🇮🇱🌈", "queenzwhouplift92": "Sooo can y’all please explain what went down after Nathaniel went to Issa apartment??", "s3lf1sh1": "💯💯💯💯💯💯I LOVE this! 👌🏾💜💜", "abovetheclouds.21": "Ending the episode with case of the ex was brilliant. I love the sound track!", "prettyyymsjj": "Tonight’s episode‼️‼️‼️‼️💕💕💕💕🎉🎉🎉", "litebrightyella": "Omfg this whole new episode is my current situation 😂😂😂 shit just blow me i love you isssa❤️❤️❤️❤️❤️", "kwaugh08": "Are you bringing Daniel back??? I waited so long just to see him again @ylannoel", "nailaeb_": "So who’s responsible? @insecurehbo or @att ? I can’t even watch the show from last Sunday on demand. It aired last week....I should be able to watch it now. I have to wait for a replay to record it. So mad. Now I’m two episodes behind.", "ggg_godsgloriousgirl": "Just finished watching!!! Sunday night Episode 3. Yes!!! Look like its hope!!! #TeamIssaLawrenceGetBackTogether #AndStayTogether #IAmHereForIt!!!💞💖💋", "michelleyoswa": "Favorite show ever!!!!", "allysonwonders": "Why is it only 30 mins?", "unstoppable_tee": "Please make this show an hour long!!! #Iloveinsecure", "dream.neek": "Omgggg tonight's episode was so 🔥🔥🔥 I could relate 1000% and the ending had me feeling emotionssss!!!", "one_joi": "30 minutes ain’t enough sis! I swear this is my life on TV. 😩", "doing_marvalous": "Omgggggg I love love love this show great job🙌🏾🙌🏾👏🏾👏🏾👏🏾👏🏾👏🏾❤️❤️❤️❤️", "mikewhitaker03": "@issarae My Wife and I loving Season 4 of \"Insecure\"! I love the Male Characters \"Lawrence\" & \"Chad\"(Neil Brown is Hilariously Funny) you created for the show!", "glamgodess85": "Love this show!😍", "22.paola": "Girl I loveeeee ur Show Da Bomb, wish it was an Hour longgg..❤👍", "chicafromthewest": "Your story is very inspiring 💯 Makes me wanna keep pushin", "ezduzzit5280": "Started watching, dope show", "loretta_mi": "@issarae I’ve binged watched three seasons in one weekend, awesome show! 🙌", "facesbydom": "😍🔥🔥🔥 Thank you", "chasityj_manicurist": "Sooo i never had HBO, but thanks to Quarantining i was able to binge on all 3 seasons and catch up!! Woot Woot, lol.", "britron4eva": "I’m in love with this show! ❤️ LOVE U ISSA!! You da 💣", "tallcuteone": "Hats Off 😱 🎩🖤🙏🏽", "nathalier0d": "@issarae girl. Why 10pm. No one can stay up that late on a Sunday.", "ameriaamarmommy": "Love tonight episode but Issa you getting late and later we gotta work in the morning did ❤️❤️", "iremdoingthings": "how are we supposed to wait a whole week after tonight’s episode!!!!!!!!! 😭😭😭😭", "youknow_likethecar": "WHERE IS NATHAN 2020???!!!", "shahloolla": "Signed up for Hulu ONLY so I can watch season 4 😍", "theillestgemini": "I just started watching this series and I LOVE IT !! 😩😭💖 you’re so beautiful and your smile is intoxicating 😍😁 @issarae", "mackenzieevita": "Obsessed with you never watched the show but watched your ig videos and your just the best 😩😩💕", "rai_schuck": "Omg lover", "hotpenmusicwriters": "Slaughtering prowess!", "vt_mayana": "Fuck me dead bury me pregnant❤️❤️❤️", "megggana": "DROP THE WHOLE SEASON SIS 👏🏽 WE AT HOME BORED 😂", "suesaye": "Can somebody tell me when will @InsecureHBO be on netflix UK", "ni_anse": "🙌🏽🙌🏽🙌🏽", "ohhdaly": "Im obsessed with your show. I wish it was an hour. All my friends are in it. Equal to my life with my friends. 😍😍😍😍😍😍😍😍😍😍", "sinadevi": "Wooooo", "latishajtherealtor": "I’m living for this season 🔥🔥Press my booty button 😩😩😩 😩😩", "okie_beatz1": "🙌🏽🙌🏽🙌🏽🙌🏽 wooohooo!!!!", "revolutionarykinkz": "Waittt was your Halloween costume based on Spike Lee movie \"School Daze\" 👀👀", "maggie_bush": "Dear @issarae INSECURE IS EV👏ER👏Y👏THANG👏 I hate when each episode ends cuz I be wanting more ((insert greed)) but that’s how 🔥 it is!! Keep winning...we are here for all of it 💪🏽💪🏽💪🏽", "diba_mwamba": "@issarae I love u😘", "_amazon_fit": "No more 20 minute episodes, or ima low key stop watching", "fonz_83": "We need 1 hour!!!!", "fierygemini": "Love this show!!! In season 1, I was so praying u 2 would get back together. Daaaaamn, it was like I could feel ur pain! That, my love... GREAT ACTING!", "crisleidymessana": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "poochie_82": "I just want to say SCHOOL DAZE!!! You killed it ❤️❤️❤️", "ibrisard": "I have binge watched. I am now hooked. This is 🔥🔥🔥🔥. A fan for sure. @issarae you are a phenomenal genius.", "blacq_expressions": "Issa we need an hour love!!! please! ❤️❤️❤️", "beeaux_": "Issa the suspense is killing us all😩", "5_11_urbanbeauty": "Omg the best show ever!!!! I’m so ready for this!!!!!!❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "woo_121": "Will Nathan make another appearance? @issarae", "victoriadashmua": "It goes on every sunday ?", "sincerely_lauriel": "Dope 💕", "smply.divine": "😩 Why is the show like a porno now 😢😢", "dslayyedit": "I love @insecurehbo, Issa you need to have @lawrencehrobinson on the cast!!! Next season 😁", "darlingnikki08": "This show needs to be an hour. I can’t handle 30 min anymore", "kisfor__": "@mechamedelara aaaaaaaaa", "thebrittney.b": "Can we please get longer episodes 🙌🏾🙌🏾🙌🏾", "kraytvt": "🔥🔥🔥🔥🔥🔥🔥🔥Just watched 👍🏿", "naturelsoul1": "So... I’ve just watched episode 2 and I’ve had enough. Issa I’m ready for you to make a full film lol. #getittogether", "hunnybeebell": "ISSSSAAAAA! HOUR EPISODE US PLEASE!", "thikadenasnicka": "Issa we need to talk about this season ma’am I’m not happy @issarae 😩", "deseriehudson": "You’re going to notice me one day and when that day comes. We’re going to be working with eachother. #watch", "youngthick.ro": "Issa I love you. Butttt these episodes is to damn short !!!! I need more", "dkeys55": "What was the Halloween costume Issa wore on episode 2? Anyone? 🧐", "jazzyflightlife": "@issarae ima need more then just 30mins. Of insecure 🤦🏾‍♀️ I need that full hour shit too good for just 30 mins. Like Forreal.. @issarae", "peti_kroker": "Get back with Lawrence please", "brpd1627": "I love your beauty to the stars and beyond my sister. Your smile is everything.", "dianashoney": "Girl these 30mins are killing me !!!😭But I love it can’t stop won’t stop!!!😝", "sann_man": "Hi! Is there a specific reason there aren’t previews to the following weeks episode anymore ?", "antho_maniac": "Man whyyyyy is this one the more expensive package all the sudden!!! I don’t have access anymore 😭😭😭😭", "stylenina": "Love the block party vibe 😍😍", "antoinenocap": "Is Laurence back?", "jaymie_bgm": "We still need it to be an hour!!!", "melnvee": "🙌🏾🙌🏾🙌🏾", "victor.lewis.311": "🌹@issarae love your show..i hate the.love scenes as a fam.👀👀💯🔥💪😜😜", "beautiful_anomaly": "😭 we miss daniel and nathan", "therealerinlucas": "Nah I’m pissed! The episodes are 27 mins!! We waited 3 years for 27 min episodes?!! Come on ISS!! I’m not watching the show for a week!....I’m lyin Ima watch it next week...but I’m real life hurt about these short episodes. @issarae @issarae @issarae", "siimplykayy_": "WHY ARE THESE EPISODES SO DAMN SHORT 😭😭😭😭😭", "connieanneholmancoaching": "I am feeling HELLA jipped!!!", "chas_s_c": "I’m so glad your show is back! Issa bringing me back life while I fight off this coronavirus!!! 👏👏", "breannah_tajaey": "Issa come on hour long episodes please!!!!!", "sweetladyd215": "I AM LOVING!!!!!THIS NEW SEASON!!! OMG!!! @insecure.hbo you cut this show...well..that's bit going to happen so need for me to go any further.. Thank You @issarae for a well written show. I've been laughing and talking to the TV. LOCE IT!! KEEP UP THE GOOD WORK!!", "suziemaraj": "Hi beautiful Queen @issarae I love love your show, it's entertaining a testament of ladies true life struggles. 🔥🔥🔥🔥🔥♥️♥️♥️♥️♥️", "triciamauro": "💜💜💜", "sara_bond19": "Hope you and Daniel get back 2gether!!!", "jay_jay_bih": "❤️❤️❤️❤️❤️❤️", "g_mcmurray": "👏🏻❤️👏🏻❤️👏🏻❤️", "iamtirzahlanett": "Binge watching Insecure right now. It's soooooooo good!🔥", "famegrabber": "🔥❤️", "huxlayhux": "Insecure... Ouawww this show is amazing🔥🔥", "nicolebmanuel": "I just binge watched all the seasons. When is season 4 coming to the UK??💔", "ms_prettii": "Can we please get hour long episodes next season 😩", "laniquaellis": "We need hour long episodes!!!!!! 🥴", "lola_jayy": "OK so I need them to give you an hour. I already been waiting a whole week to see it. All excited and stuff. And then it be gone. I'm sick of it. I need a full hour please ma'am. Thank you. Happy Sunday @issarae", "ipassion4_fashion": "Issa I Need A 1hr Now", "couchandbans": "Tripping on this @issarae 😂😂😂😂", "luarabaia": "@viviantthz", "mzztiamo": "💥We Ready💥🖤❤️", "clutch_byrose": "🙌🏾🙌🏾🙌🏾", "karahpeters": "@issarae I never ever ever want Insecure to go away. I was feeling so down missing my friends... turned this on and felt like I was with my girls. You bomb, sis!👏🏾👏🏾👏🏾", "diamonda._": "@reckless_rah All I know is these episodes better be an hour & half AT THE LEAST 😩 IM rewatching now. All excited n shit.", "__inamoramento": "🔥🔥🔥🔥🔥", "rondasimpson.skincare": "Yasssssssssss I’m so ready!", "sophiestarsham": "❤️❤️❤️❤️❤️", "gracem14": "I kinda want Lawrence back with Issa and I feel like I’m Issa and molly rolled into 😂🥴😫", "luvnbasketball7": "❤️", "latreeseisland": "I'm so late on this show. By but girl I absolutely love you! Your such a beautiful talented woman! I'm still on season 3 lol but I'll be all caught up by tomorrow. Looking forward to seeing more off you on the big screen!", "_jasmine_wolf_": "I’m obsessed with this show 🙌🏽💜🔥🔥", "kissez_mz_proper": "I ain’t gone lie i didn’t start new episode hbo want 15 a month 😩already paying 192 😩a month for some weak ass channels but I swear @issarae I can’t wait to watch it I’m gonna order eventually bc it’s my fav show love you girl such great inspiration 😘😘😘😘", "jessicaarbdanial": "❤️❤️❤️❤️👯‍♀️ @km_potter", "ariellederwonn": "This whole releasing 1 episode at a time thing has got to stop!", "deviltoinstinct": "I’m still stuck on season 1 ✨💥", "lomojas": "Hey! Did you watch it! @uniquekeda", "kikibrowneye": "Started to watch from season 1 again just to be all in season 4😍😍😍! On of my fav series", "davidslauren": "What is happening on showmax there is only 1 episode 🤔", "afrigoddess_": "I LOVEEEEE THIS SHOWWW😭😭😭so much", "jenbeezy06": "@issarae excuse me ma’am, can you keep filming this show until I die!? Cause a bitch can’t live without it! It is my LIFE!💕💕", "azemiist": "Thank u lord! I needed this sesson 😂♥️", "laquishia_laquishia": "My favorite!!!!🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️", "goetsch25": "@lizzietracy", "whomsafar": "I love you", "don_kruler": "We need to see a movie!!!! This looks like a movie cover", "aj_cxc": "👏🏾👏🏾👏🏾", "kristiannediehl": "I love this show so fucking much!! Genius. Issa, Thank you for your realness, creativity and ability to put smiles on faces of those having a hard time smiling right now ❤️ #laughhardaf #lovethisseries #thankyouissa", "manuellasamar": "@mellinbloom 🙂", "thaistigre": "❤️❤️❤️❤️", "msglynnis": "I just binge watched all 3 seasons!!🔥🔥", "malucamala": "🙏🏽 Thank Goddess!", "that_cali_9irl": "My favorite show!!!🔥🔥🔥❤️❤️❤️👏🏽👏🏽", "tdrenice": "The COVID19 stay at home order lead me to find stuff to watch on TV. I do not regret watching all seasons to date. Awesome writing! Great work! Give us MORE Issa🤗😍🙏🏾", "omar_ortiz8613": "i Watched!!! So Happy iNSECURE is Back!!!! Love you iSSA!!! ❤❤❤", "wonder_gods": "Nice editing on this poster. 🔥🔥🔥💯", "xoxo_jasminerenee": "Yay!!!!!!!!", "cearacriolo": "🖤🖤🖤🖤", "thelatreshasimone": "I am admiring all of your natural hairstyles currently on “Insecure” !!! I’m def getting inspired with different ways to style my natural 4c hair !!!!", "beckglatz": "Can we watch all episodes all at once (binge) 🥳 or one at a time? 😞", "stephanie_gurrola": "@dejadenise14 we missed it! I’m gonna watch it tonight!", "revenantmedia": "Bingeing all the seasons now. Sorry I'm late to the Party Lyft. Thanks for letting me stay! ❤️🔥🙌🔥❤️", "saffington_": "Wow perfect timing. I see what you did there", "jstar_2004": "Can we get a breakdown of how your natural hairstyles was achieved? We need this during corona!!!", "professionalsoulsnatcher": "NOBODY cares.... U been cancelled🤡", "cinderella_00088": "✨✨✨🙌🏽", "anissa_mza": "😍😍😍", "moncriefmentality": "🙌🏾It was everything can’t wait til next week! The TSA dude though @issarae 😩", "jussyl1": "👏🏽👏🏽👏🏽👏🏽👏🏽🔥❤️", "just___jen___": "@issarae yassss bih this is my show I was soooo open watching and mad because the episode ended so quick. Don’t stop this show is bomb you and molly remind me of my girlfriend and I 😘😘😘", "__katiekatiejojo": "@__katieofficial__", "iam_scotmonic5": "🇺🇸🇨🇦Dm if you need 💰💵", "s.l.eee": "Bitch the show started and you ain't say nothin'.. you know NYC we dealing with that Corona virus... I got caught up.. but I'll be watching tonight... 🎉🎉🎉🎉🎉🎉", "e4will": "🔥🙌🏾🔥", "andressaisvetkol": "Amo🙌", "ramlaofficial": "Please check DM 💕", "sherilola": "You go girlllllllllllll", "tnicky__": "Thank you for giving me a show that I can love, relate & learn from! You truly have a purpose & you’re definitely using it for your greater good! 😇🙏🏾 @issarae 💕", "godschildchrissy": "It was amazzzzzzzing 👏👏👏👏👏🏿", "divaofthenation_key": "Yess 🙌🏾", "1_stylish_jaii": "🔥🔥🔥🔥🔥🔥🔥🔥🔥 Love it and YOU!!!", "kyraotvandblackyogi": "It was so good! Season 4 is about to be juicy!😘🔥🔥🔥🔥", "john_jcksn": "@issarae you could've let me play that security guard part. 6'6' 255💪", "simoneifill": "Early BIRTHDAY GIFT..LAWWWWD knows I NEED it🥳🎂♈️", "caitmariemclucas": "Love this show!!!", "feliciaqueen86": "Issaaaaaa🔥🔥🔥", "chrissydoll24": "This is my show❤️❤️", "montina_latrice": "New comer to #InsecureHBO and I LOVE IT!! Love the reality, the characters and the sound track(s) are AMAZING!!!!! Congratulations on another season!!!", "djjuice_z": "GIRLLLLL!!!! 30 MINUTES IS NOT ENOUGH!!!!!!! IMMA BANG ON HBO TO GET YOU THAT DAMN 1HR!!🙄", "kurlykween.ca": "yalls smashed it out the park!! can’t for the rest of the season to air!!", "queenrnb86": "like how did you squeeze so much drama 34 min 1st episode....girl!!! xoxo", "motherkaylen": "Let me go watch this!", "king_waun": "I’m ready to appear on the next season @issarae !", "fu_senior": "Can you please do a comedy @masterclass ?", "_chauncyharut": "🎈🎎", "buta_yay": "Never disappointed! Episode 1...ooowee!", "nisha.boo": "it was amazing . you’re amazing queen . keep on shining !!!!", "aymck100": "🔥🔥🔥🔥", "anime_ambivert": "Bitch you know we needed this. You a real one, let me go do my praise dance 💃🏾💃🏾💃🏾💃🏾💃🏾", "joeyyfromtheleaf": "I make music and model and Would love some support, no pressure tho 😊❤️ ill support you too #letsgrow #bigsupport", "lambodamedump": "Yo B!! First Episode on the come back was fucking little 🙌🙌🙌🙌🔥🔥🔥 Much Love 👑", "paigepicasso": "🥺", "nicolecane": "Love it ❤️❤️❤️", "abiolaxo": "Yasssss been ready!", "zuuukame": "💛💛💛💛💛💛💛💛💛 @issarae", "keylatakeyla": "Finally 🗣❤️❤️", "ohlorddess": "We love you!!!!! ❤️", "_thebull3": "😩😩😩😩", "ogechi_araraume": "Yayy", "themillieboo": "Why isn’t this show an hour!!!!??? 😫😫😫😫😫😫😫😫", "monet____29": "🙏🏽❤️❤️❤️", "ladywicked315": "@gabriellamarie1020", "mrssearl71": "FINALLY....YES!!", "_chelsealately__": "Just when I thought I wanted to go outside, I’m going to be in the house even longer now😭", "krisy_kris_": "Yaaaaaaaassss 🙌🏽❤️🙌🏽❤️", "detached02": "Why am I just now into this show lol binge watching from season 1 now and I freaking love it.. I'm just mad I didn't watch sooner", "_akyaira": "She has on the shoes @mrsjred78", "tdee17": "Need longer episodes!", "silver_lino": "Where can we watch this in the UK 🇬🇧❓❤️", "ocitythadon": "My girl making me start from season 1 episode 1 & I can’t lie this shit too funny 😂😂😂🔥🔥🔥", "mademagaro": "@anquelica y yo sin HBO 😢", "dyslexia_advocation": "I’m gonna need the rest of the episodes released. Ain’t nobody waiting a week - folks binge watching. We’re shut in - what are we suppose to watch?!! 🤦🏽‍♀️😂🤷🏽‍♀️", "barbzzzzsss": "YALL MIGHT AS WELL DROP THE WHOLE SEASON SO US FANS CAN BINGE WATCH THE WHOLE SEASON 🗣 😩", "teejay.allday": "Hey Issa! I loved it! But I was so distracted by your earrings in the scene with the orange suit, first there were two rings, then there was one ring on one side and two rings on the other, then the one ring was on the left side then on the right side, Was that on purpose???? Sorry got a lot of time on my hands these days", "iammichellesummer": "@franciscah29 Omg!!!!!! Yesssssss💯💃💃💃💃💃💃", "iam_sammie": "@_goldie_suga 🙌🏾🙌🏾🙌🏾", "charlotte.emma.mary": "When can we watch in Aus?💜", "mrs.hynson": "Hey Best Friend, tonight’s episode was so good. So happy the season is back!!! See ya next week! Bye girl 👋🏾", "jylanthia": "Soooo happy ur back🔥", "its_me_knya_": "why are all of IssaD's lovers bums/whack-a-doos, and all of Lawarence's are A+ babes body-goaled to perfection? if last night's overweight lover was supposed to be a head nod to body positivity for men, we really would've loved to see that in Lawrence's women... ALL of them were body-goaled to big booty-flat belly perfection, and that juxtaposition of Issa-Lawrence lovers is HELLA WHACK :/ We see overweight, sloppy, thugged out looking men with beautiful, smart, body-goal women all the time. It would've been better to see Lawrence with chicks with fat bellies, and not beauties of perfection because THAT is not realistic! lol But all issa dudes were bums (the dude who steals her wifi and was willing to steal her adapter during her hoe phase? and Daniel squirting in her face? come on, ya'll!) What's the underlying message yall want us to take away? She can't do better than bottom of totem pole dudes? lol Except for ghost bae! BRING HIM BACK! And go ahead and throw away that whole sex with heavy D! (dang, he could've at least been attractive -_- AND it wasn't even good sex? lol Honestly, why yall giving Issa the WORST sex life of ALL the characters? lol) stop it... for our sake, please", "joshbaze\nVerified": "Verified", "verses28": "@issarae Thank you", "lozzaram": "Any news on when it is available in the UK please @issarae", "only_des82": "@5_9_fine_as_wine I am so excited", "reginayfavors": "Are you going to do behind the scenes episodes and put them on video, etc? I think that would be great. Love your work. God bless.", "mjanene": "💯@word2ben_frank @simplycourtyy will be awesome additions. You’ll see! 👀 Love the show! 😇❤️", "inevitably_finessing": "ISSA!!!! 😂😂😂😂😂 BRUH WTF?!?!! #IBetYouOwnAllYourOwnClothes 🤣🤣🤣🤣", "_whitfield_": "@moalex83 yooooo!!!!!", "sade_w1": "I LOVED the first episode!!!", "colossus_cam2": "We need Longer episodes!!💯💯🔥🔥🔥", "mzjonesvj": "This is my show", "blessed_even_on_my_worst_days": "😍😍😍🔥🔥🔥🔥", "caramel_coco_chanel_36": "just watched the new episode its gon be a good season", "bold2thebone": "Welcome back @issarae !!!! @hbo We really really needed this right now! Please renew our girl as many times as she wants! @insecurehbo 💙💙💙", "badgaldanyel": "😍😍😍😍😍", "_lovedanika": "Sooo, I just watched the first episode and I LOVED IT!!! But girl, why aren’t the episodes an a hour?? #HBOinsecuredeserves an hour !!!!", "ambiienichelle": "Great season opener!!! I'm anxious for the rest of the season", "chrissyo_21": "Tonight’s episode was AMAZINGGGG!! I love this show & can’t wait for next week’s episode 🔥🔥🔥🔥", "__.ilx": "The premiere was sooo good !!", "bro_day27": "I loveeeeeeed the first episode can’t wait to see rest of the season !!!!", "life_by_gigi": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "jfmarenda": "Loved it!", "shajcohen": "Finally!!!👏🏾👏🏾", "vee_cee_elle": "Thank you for giving us more eps, I will stop asking for an hour. Tonight's ep was good but emotional (for me). Candola seems super sweet but I miss Issa w/ Lawrence! Im holding out hope for those two...cant wait to see. Ep 2.", "anthonyjlang": "So good!", "elbarnold": "❤️❤️❤️❤️", "loltimcar_than": "My visual crack! Watching it now!🔥", "1hard2please": "Yay 29 mins to go ♥️♥️♥️♥️♥️", "nrolle24": "Came wait!", "yoitsespo11": "😫😫😫😍😍😍", "_naturally_me": "@makeup_byashslay_s", "crazy_dimples213": "Issa we need HOUR episodes. 👏👏👏👏", "nottheaverage_virgo910": "The show returns in Spanish on hbo?", "hon3y_sweet": "🗣 ITS OOOOON!!! 😍😭", "hilary_bankz": "Obsessed 😍🔥", "cecy_fervenza": "Geniaaaaa❤️🇦🇷", "favafuqboi": "How tiffany still pregnant after 2yrs", "jessiemona": "I thought it was an hour 😩😩", "nina_danielle47": "Came out swinging tonight 🔥🔥🔥🔥🔥", "sanneriber": "Can’t flipping wait🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼😍😍", "lazifair2": "@toniibroyale", "chickenandwhiskeypodcast": "@jdeauxthagroove @iamrobhollywood returns tonight 😂", "bella_elle23": "@51shadesofpey_tone", "__jfresh": "Can’t wait 👏🏽✨", "loc_of_luv": "Confirming 9pm central time?👀", "docbhits": "Yes 🍿🍿🍿💻🤗😁", "juliew7444": "❤️❤️❤️love her show", "_kayvicki": "@the_queen_bri tonight 😫 and i gotta be at work at 3:45am", "dejasivadllc": "@shortnsassy85", "xoxojoi_": "Ready!!!!", "sarahsaucin": "YASSSSS @tichannajuana", "therealsaucy.c": "Yesssssssssssssss‼️‼️‼️‼️‼️‼️", "porschiie": "Today is the day !!!!! So excited 😁😁😁😁", "scottiephilip101": "Hi I’m in a foreign country right now for deployment and I would like to watch although we’re aprox 10 hrs ahead how can we see it?", "shandrikaharper": "Can't wait❤️❤️❤️", "lensalenoir": "@zamrawit yaaaaaaaaas!!!!!!", "socialistbae_": "Girl, I just cancelled my free HBO subscription. Now I gotta actually pay for this shit...You know this COVID is messing with our Coin", "jocceyj": "So excited 😭", "oliviamg": "I googled “women millennial shows” and found this to watch. It is cool to watch a show about working women navigating relationships and careers.", "cheylaflare": "pleeeaaaseeee drop the names of the designers you and molly be wearing in each show‼️‼️‼️ 🔥🔥🔥💧 💧 💧😩😩", "oscar103064": "@issarae Please do a series where You catch lufe changing Debilitating Sexual Disease, PLEASE! You drop your draws and JUMP right into sexual with Men you've broken up from, tge same Men Sleeping with other Women!!! For Every Man you have Sex with, your actually having Sex with SEVEN (7) of their Partners, Partners!!! In the Southern States of the US, HIV-AIDS is GROWING EXPONENTIALLY, amongst BLACK MARRIED WOMEN!!! I watch this show fir the FIRST time, and was ASHAMED that BLACK Educated Professional Women are portrayed in this manner!!! You Are ACCOUNTABLE for WHAT you put OUT, even if it is your Method of Income!!! Wise UP!!!", "suppadav_whc": "@issarae I'm not too thrilled about this insecure new season soon as I get into it you change networks then I pay for that Network and it ain't even no episodes on there so I'm a little pissed off still about that money I wasted subscribing to HBO. I know you might not care but I'm so secure💯💪🏿✊🏿✌🏿", "iamkelseyj_": "@beccachoate", "nl_moses": "Yessssir", "justmejanis": "@grizlypierceling Been waiting... Ready...", "sehleemah": "Do you know when it will air in Amsterdam on HBO?", "soggiornante": "This bet not be no COVID-19 hoax...nor #insecure of seasons past #Fantastic #insecurehbo", "kim_rich": "@allthingsjuliamarie", "d3lasoul": "@vane88a tonight!🙌", "aceunleashed": "@lorraine5m AHHHHHHHHHHHHHHHHHH", "lilskippynikki": "PM😩😩😩 I was just about to call HBO and tell them my show hasn’t loaded yet....it’s only 10am here in philly @issarae @jayrellis", "mstanyalachelle": "@jayallday1017", "tonytonitvne": "Who are all these new people ?!", "bevvybooo": "🔥🔥🔥🔥🔥🔥", "anez77": "I can not wait!!!!! Just saw the 3rd season again today.... READY!!!💓💓💓💓💓💓💓💓💓💓💓💓💓💓", "zamadiaaa": "Those shoes are 🔥", "rockii_10": "Too excited", "meerz.a": "Just binge watched all of Insecure now I don’t know when the new season drops in the UK 😫😢", "badgirlpreepree": "@kanshu05 weeeeee", "tiarrrra_": "Fckin right I can’t waiiitt !!", "pheyichasis": "Yesss!!!!", "char_la_vie": "@laurenterrill_ ❤️", "prettynpearlz1908": "Just subscribed to HBO tonight!! Let's Goooo", "natkat214": "Rewatching S.3 gearing up for tomorrow! BTW episode 7 of season 3 is Emmy worthy 👏🏽👏🏽👏🏽", "clarisssaj": "@ari.jack tomorrowwwwwww", "aanthaa": "Well clearly u having that block party this season ... let me get my Carlo Rossi poppin", "lulu_sopretty_91": "@j_in_gemini I found it Yasss!!", "michal_workeneh": "Finally 🙏🏾🙏🏾🙏🏾", "kathrynscarlettbrooks": "@jjoshdougg", "iamsamfine": "#CantWait!!!", "justicekent": "Yes babyyyyyy🔥😩", "brian_l_king": "Yes Issa, will be watching!", "navneetjohal60": "🔥🔥💯💯💯💯💯💯💯💯💯💯💯", "yesher_": "Just subscribed to HBO again😂😂", "jojo_rosaey": "Anyone know when s4 is airing in the U.K? We desperate over here 😩", "pinkwarrior43": "Watching Insecure for the first time...my new obsession...gotta get caught up! @issarae", "mandy97125": "@purple_dray The wait is OVERRRR 🙌🏾", "_iamladiamondcovington": "I’m so hook to this show I never seen it and today I was laying in bed and I came across the show on HBO and I have been binging all day.", "miss_shawty1": "@charlie_vassell 😏😍", "_shannymay_": "🙌🏾🙌🏾🙌🏾🙌🏾", "applemoi_mimi": "Yes yes been waiting", "erimakos": "@issarae it took damn too long..... I was thinking about whooping ya ass, hmmmn that sweet as of yours........ @yvonneorji can't wait to watch you fuck up in this season....... @jayrellis my man, my main man........ The booty man....... Hope you get back to that sweet ass, and kick the ass of that her high school punk ass bf, the shitty music producer......... OMG, I can't wait", "catrellsligh": "Let's goooooo", "aguitada": "Yesssssssssssss! An Easter blessing.", "yg_rin": "Where. Is. My. Season. 4?!!! I can’t find it 😩😩", "lizetteee": "@dariomazon @trulyyrocio", "_callmemommariot": "Can’t wait!!!! 😂😍😘❤️🙌🏽💕🤩", "biggroove_": "@curlybmj", "yoyeeezzzy": "Yes", "ericka_psicologa_org": "👌👌👌", "kyracole1": "But is it an hour tho??", "kyana_nelz": "YASSSS", "marciemeee": "I can’t wait!!!!!", "seauxl_beauti": "@blasian_j.lenae Sunday", "moraestyta": "👏👏👏👏", "samtoldmee": "Can’t wait 😍", "kelseyalyse": "CANT WAIT", "thugqueen_4life": "Leimert Park we here 🤗👏", "glowingupinnuevayork": "Honestly, perfect time 💛 binging (AGAIN) on Sunday!", "sbrownsugar47": "Yess I just binged watched this show, I love it I'm hooked", "cha.landis": "Finally !!!! you was boutta kill us 😩", "perfection_3_": "My name is koranie Katelyn and I want you to mentor me. I have been writing since I was 12 and the hardest part for me is not knowing weather it's good or not and I am completely blown away by your work and your spirit and your personality. I love insecure keep on paving the way for women. Hopevyou reach out", "tolliverica": "@browsxveronica 🥳", "biznessboi\nVerified": "Verified", "_jnuff": "Check DM from 2 years ago", "carols_castro": "Amem, sis!!", "_jenny__n": "Yaaasssss!!!! 😍", "debbiebritish": "Ok so we finally got this in the U.K. Adrian & I haven’t laughed so hard since forever! Thankful 🙌🏾🤴🏾👑 @martinique23 @missallison__ @dazzlingdanielleforbes @hazeleye01 @courtenaylovee @jewellery_life_uk @yssisa @gordoncoacoabrown @rozay_2020_ @tishlondon", "julianmonterrey1": "Nice", "_chimaaaa": "Thank you😭😭😭😭", "naomi.v._": "@issarae I can't wait🔥🔥🔥", "dulbee_": "Yassss🙌🏼🙌🏼🙌🏼", "ricky_tagafau": "🔥🔥🔥🔥🔥🙌🏾🙌🏾🙌🏾", "aichamarieartistry": "Omg finalllyyyyyy I’ve been waiting for this 🙌🏽🙌🏽🙌🏽🙌🏽😍😍😍😍😍", "xonikkie": "Issa, girl, how can we get the bingo cards!!!", "angieattheflea": "So ready for this. Was also ready to watch Photograph on Amazon. Amazon got some splainin to do...", "bazfiction": "@insecurehbo Hey! From Australia here. Was season 2 and 3 ever released on DVD? I’ve literally waited years lol because the stores here (@jbhifi) have only ever had season 1, and I’ve been waiting so patiently...", "smokeyjo86": "Is it Sunday yet?????????? ☺️☺️", "jjesleeann": "YESSSSSSSSSSSSSSSA", "jammie_cler2": "Can you release all the episodes at once please since they are only 20 minutes long and 8 episodes ♥️😩😩😩🙏🏽🙏🏽🙏🏽🙏🏽", "jasperandoakrealestate": "Finally!!!😍😍😍", "missgirl87": "@issarae I’m so ready for this 🙌🏾🙌🏾 Wine has been purchased . Got me feeling like beychella is up next 🙌🏾", "jojos_world22": "Yes!!!!!!👏🏾👏🏾👏🏾", "luciabarnes": "👏🏽👏🏽", "helenakurt": "@danicadragicevic @tyty_blessed you gotta watch this show! It’s so good", "shawnhilton1": "love u baby, i would love to join your cast yall all seem hella cool and fun ima get to work with you one day @issarae ima manifest it see u in a couple months", "aprissylilmissy": "@issarae I demand Insecure on Netflix! What are we waiting for? 💁🏾", "nicespice1000": "@hbo please note I paid for my subscription for this show only! #insecurehbo @issarae", "_busy_bee": "Can’t wait!! Binge watched season 3 again this evening!!", "leasamarie_02": "@vashan81 can't wait sista. Just need some wine", "angelgoddess80": "Fantastic 💖", "lodays3": "@karlamac_24 I’m ready", "kayintoronto": "One thing to look forward to @alana_france", "venusscorpia": "Yay!! Just binge-watched all the seasons and I am sooo hooked! 😁", "rae_ray3": "Yes!!!❤️❤️❤️❤️", "a_d_e_a_v_u_y_a": "Thank God u are back", "beanzinooooooo": "We been waiting on you queen issa 🙌 😘", "batw_travels": "I’ve been waiting for this", "rockpilekyle": "@laurarank", "siendoli": "😍😍", "the.one.and.only.salibux": "So excited. Your show is very well written and super entertaining! <3", "sexitinie": "🔥", "mzaqt": "Can't wait!!!!", "annesophiethellier": "Ahhhhhhhhhhhhhhh Issa and Insecure are coming !!!!!!! Can't wait !!!!! Insecure is one of my favorite show ever !!! Love from France", "justthacia": "Yes the day after my birthday 🎉🎉🎉🎉🎉🎉", "trendzxox": "I'm ready", "kennalove": "@_16leesa", "veealeman": "@notaliekid I miss youuuuu and watching this show together 😭😭😭 #brokenpussy #iseeyouaatwork #iseeyouathome #iseeyouinmydreams", "_ladykaii_": "Love the show! Love the cast! 💜💜😊😊🤗 Issa in the show isn’t with Lawrence ik and Nathan is in the pic perfect I love him too but pls ISSA MAKE LAWRENCE STAY FOREVER. HE HAS TO BE A PERMANENT ACTOR IN THE SHOW IK THE LOVE IS THERE YALL JUST HAVE TO FIND IT PLS!!😂💜 @issarae Again love ya lots", "dynamitedivaqueen": "🤗🤗🤗", "gregandcherylclarke": "💙💙💙💯💯", "1take_nesha": "So ready 🗣🙌🏾", "sfs1718": "You are a beautiful person inside and out and such an inspiration!!! Am rewatching INSECURE to get ready for the upcoming season- so excited!!!", "thepeopleareoui": "Bless up on the coffee shop!!!! 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "tiffaneeblu": "I cannot wait!!!", "justmorganxo_": "Literally the only thing that’ll get me through quarantine 😭😭😭", "piccolena": "Thank god for some good news.", "agent_divina": "👏🏽👏🏽👏🏽👏🏽 👑", "saphialouise": "Ugh finally!!!!", "matrixinception": "YEEEES! 🔥🔥🔥🔥👏👏👏👏🔥", "simplymshaywood": "@issarae you ciuldbt film season 4 too. We are going to have you wait 2 years for it now 😂. #isitsundayyet", "msflipped365": "Something to look forward toooooooo!!!👏🏾👏🏾", "soyloca": "Will we see Daniel", "mrs_le_chavez": "@jubilee_phoenix_apple @huynh.polly_", "j______ermz": "I’ve been waiting 🙌🏾", "blakyssgl86": "😍", "erijamesjr": "Yes!!!!!", "shxxnbean": "WONT HE DO IT 🙌🏾", "scola_selemani": "Oooh🔥🔥😍😘", "sharee_b_": "@amazing_missnita @miss_tgood", "monicapallin": "Can’t wait!! 🤩", "ionela318": "Sooooo excited!", "saundraberry1026": "Yesssssss ❤️", "dvqaaa": "ready ready", "ladyzfoy": "SO EXCITED!!! 💖😄💖", "uwouldluvme2": "🙌🙌🙌 Yay!!!", "pretty_woman117": "@issarae FINALLY 🔥🔥🙌THANK YOU", "lepetitfriday": "Can’t wait!!!!", "spartsammy": "ok we get you", "cherylcarrdr": "♥️", "its.taiii": "Yessss 🔥🔥", "ne_neng": "@mariah_jenise", "ethiopiawit_girl": "Yes can wait we need it", "a.rosay": "I love your show! ❤️", "therealmissti": "Can't wait", "laylays7": "@bilanay can’t wait for your birthday quarantine watch party 🎉!!", "m.er.c.i": "On my birthday 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "yal_yayalen": "@madz_lor @lele_duchelle @ilariepriscille @pamsjenny 🙃", "thecalifa": "@issarae you should let me on your show I’m funny sexy classy and hood as fuck...", "_soelema": "@ms_nathasja 🎉🎉", "deez661": "We need you soooooo bad👏👏👏👏😍😍😍😍🙌🙌🙌🙌 @issarae @insecurehbo", "yoshpopsetc": "Let’s go🙌🏽🙌🏽🙌🏽", "miss_springtime83": "I can't wait!", "jiennaloveice": "We readdddyyy!", "spicycleopatra": "Yesssss", "fancyassjaay": "@quitabeeeee @thequirkybrown @awwwwlawrd @facelikemia 🙌🏾🙌🏾🌺", "luvlove3": "👏🏾👏🏾👏🏾👏🏾Yessss", "blackgirlsrock30": "I’m soooo ready!!!!", "misstipper\nVerified": "Verified", "naturalbeauty_35": "Yasssssssss finally finally FINALLYYYYYYYYY", "ordeanz": "I'm soo excited !!🤗🤗🤗", "wendisticalwande247": "Yaaaay", "lichis79": "🙌🏽🙌🏽", "1dakyd": "💃💃💃", "riddleemthis": "🙏🏾", "queenicita": "Bout damn time❤️", "lylaflow_": "Can't waiit", "just.snm": "👏🏾👏🏾👏🏾👏🏾", "ohmy_caprisun": "Can’t wait 🥺🥺🥺", "vegansaint_nikki": "By damn time", "hey_nora_": "🙌🙌", "jmanuel83": "I can’t wait !! 🙌🏼", "myrabhardy": "The Best show ever!!", "cynthiatraynham": "@dkmitch2 @cnicv soooo ready for this", "sandraftparker": "Thank goodness! Just in time!", "contribute100.dn": "Can’t wait!!!", "mellyfran": "🙌🏾🙌🏾🙌🏾🙌🏾", "ms_xac_iyn": "@daramichelle time to get HBO again 😂😂😂", "thatgirl_samrawit": "YAAASSSSSSS", "joi_notjoy": "Finally 🙏🏾👏🏾👏🏾👏🏾👏🏾", "somewhereovertherainbow610": "Good to have a little bit of light in all this darkness! 🙏🏻 🙏🏻 🙏🏻", "ghostwalker320": "Yesssss I’m about to be on the bouch watching lol 😂😂😂😂", "msbrittportlock": "🎉🎉🎉", "4muchrayray": "finally ! we ready 🔥", "dougquepromo": "😍😍😍", "clyons639": "I'm so excited 😍😍", "arhbynahstargyal": "😍❤️❤️❤️🙌", "ericgwey": "@vanecan", "iamnaambo": "Can they release all episodes so we binge watch in this lockdown? @insecurehbo @hbo", "neshanesh10": "Just in time👏🏾👏🏾🐐🔥😍", "moiona": "@thebonnymoore WHO PUT ME ON😩👌 I can’t wait 🥳", "chante_u_stay": "Yyyyeessss", "vapingmecrazydotcom": "Mazel tov on your new season. I already set my DVR and I’m ready. 💃", "icolas_age": "@cat_harper11 !!!", "vanessa.i.o": "Whoooop!!", "siruti\nVerified": "Verified", "dmsintl": "I started binge watching the first season as of yesterday. Until the new season arrives. Looking forward to it. Bored and housebound", "karyh05": "@gracexherrera", "mrs.kim100": "Yes lord", "travelluxy_": "Can’t wait!", "napturaldeelight": "@issarae I cannot wait for my life to begin again, yes! Just when I thought all hope was lost. Cannot wait for another dope season", "adship3g578": "😍😍😍😍😍", "ms_enebel": "I have been not so patiently waiting and FINALLY! 💃🏽", "eunoi.aa_": "👏👏👏 yessssss", "swagga_rite23": "@corkylucky7 🙏🏾🙏🏾", "patticakes2point0": "@terribledarible 🤩", "drelasoul_": "@ovojello be ready", "c.r.y.stalxo": "@itsbellalewis 💃🏾💃🏾", "mzvicious": "Will it be available in Australia!? I’ve been waiting patiently 🤞🏽", "moonwillow14": "I need this 🙌 right now, just to escape reality 😩", "sweetpea41185": "The day after my birthday!!!!!", "lovelyy_denise": "Can’t wait‼️", "damolao_x": "Finally 🙌🏾", "joshydogg": "I’m hella hyped for this!!!! Can’t wait to see this!!! Been a big fan of this show from the beginning. I’m a film student at Sacramento state university and graduate this spring. I’m a young Latino film Maker Director. I would love to be apart of this show in any way I can contribute, looking for the experience to get my hands wet, grow and learn. I recently wrote, directed, was the main actor in, produced, & edited my first feature 30 minute short film. I would love to play a Latino character on this show! I would love the opportunity to meet with you and show you what I’m about. I’m just a young brown Latino man looking for a chance to show what I’m capable of doing. @insecurehbo @issarae @hbo", "marielaantoniettab": "Siiiii 👏👏👏👏👏👏👏", "caneyekickit2": "🙌🏾🙌🏾🙌🏾", "onlyderah": "@lisafolawiyo_studio @lisafolawiyo 💃🏾💃🏾💃🏾💃🏾💃🏾 is the jacket ours ♥️♥️🙌🙌", "sabretoothtigre": "Thank you for this gift! 😭", "sarah._.mvc": "@issarae Can’t wait!!! Insecure, my crush 😍👏🏼👌🏼", "datortle": "💚💚💚💚💚", "lovebugzmommy": "♥️♥️♥️♥️♥️♥️♥️♥️FINALLYYYYYYYY", "mattydatopic": "YESSSS OMGGGG", "ashleighdallen": "@faialofa.turner", "n__engelhart": "Finallyyyyyyy🎉🎉", "tiffthe1andonly": "❤️❤️❤️❤️❤️❤️❤️❤️", "lilldhai": "👌", "mz_khole": "Finally", "thereal_pookie": "😌😌😌", "yona8626": "Yes yes yes 😍", "boyfriention": "ITS UP THERE", "portroch": "SCREAMING!!!!!!", "mary_maicyo_o": "I can't wait 💃💃", "vanessamarkous": "Thank the Lord", "maaynavibes": "😍😍😍😍👏🏾", "sopheeyaah": "So ready!!❤️", "na_illest": "Is it gonna automatically upload to HBO play?", "avviva_imade": "Issa!!!!", "fabulous_fabricsankara": "Yeh💃💃💃", "tiarichtia": "Yesss Iss 😍🙌🏾😍🙌🏾", "cola35_": "👏🏾", "cressenceleocadie": "🔥🔥", "musicalaries7": "My only bday plans #insecurehbo", "relli_rells": "Yayyyyy!!!❤️😍", "deo_nette": "🙌🏽🙌🏽🙌🏽", "niiiyyyaaa.__": "Fashooooo!!!!!", "shenayunique": "Finally!!!🙌🏾", "monsieurlab": "🔥😍🔥😍🔥😍", "gumboyaya": "🔥", "henryh79": "👍🏾👍🏾👍🏾👍🏾👏🏾👏🏾👏🏾can't wait!", "jadaiah54": "If I could afford HBO I would watch you. BUT GO GIRL💯💯💯❤️", "babygotgreeneyes": "It's been in my calender for months--i CANNOT WAIT!!!!!", "ayamajb": "I. Cant. Waaaaiiittt!", "krystalchanelle": "How do I watch this in the UK...??", "kenisha_myanna": "Can’t wait", "teetot_55": "👏🤗😎 Finally, can't wait!!", "datmomma": "Finally 🤪", "harlemchickindc": "Yes, your worth me keeping HBO sis!", "mrroy2you": "Best news so far this year!!!", "colah09": "🙌👏😀", "itsmoerrr": "Yessss! 😩✨💜💜", "ilovejazzykay": "🙌🏾", "apjsmith79": "Been waiting on this", "rafireavis\nVerified": "Verified", "alishakelley22": "Best part of this Quarantine", "raebee3": "Ratings bout to be #Lit", "talmonique": "I couldn’t be happier 🥺❣️", "nmontovou": "I love youuuuu", "knightworking": "@mschristinaknight ahhhhh!!!! Thank gawd!!!", "talitacmosta": "@lluckiq", "gwennij354": "Are you going to give us longer episodes? Those 20 minute episodes be blow in’ mine! 😏", "missk25": "@myniguez @deltadiva03", "nneka.johnson": "Finally 🙌🎉", "keepitthick": "Ohhhhh shit!!!!! Wait a min!!", "kimani.virella": "Yessssss🎉🎉🎉", "polishedtoperfectionmakeup": "Can’t wait! ❤️🙌", "lynnreussite": "Isaaaaa😍😍😍", "mysteriousmauve": "Oh thank god.", "kiyah_shannon_82": "❤️❤️", "chocolatelovejones": "I can't wait!! 💕", "staceyy_watson": "@trouperstef I stocked up on popcorn so I’m ready 😂🙌🏾", "msdimplz_29": "👏👏", "saritabonita180": "I’m cheesin so big! I only have HBO for this damn show. #worthittho", "pauleena.c": "@kc4hunnid_ @lisalionheart84 You know what we’re doing on Easter lol", "jacqueline_82": "@promers - yay, something new to watch during all this locked down stuff", "gabitcho": "YAAAASSSS GOOOOOWD!", "manifestsdestiny": "Don’t play Bih!", "bruhbruh87": "Me and my quarantine queen counting down the days! @karamel_t", "nycsoul27": "Yasssss💙", "plant_de_lady": "@slaughternaut", "thepopularpapi": "Finally TF", "hannabees": "At least I get to watch my favorite on my birthday", "morrison_coco": "👏👏👏👏❤️❤️", "camilla.vonice": "🙌🏽🙌🏽🙌🏽🙌🏽", "xuxazuzu": "@lolascocina I need to catch up!", "keyparks": "Yayyyyyyy", "demsum": "🔥🔥🔥", "losbann": "Well....guess I'll turn the HBO back on.", "psasser1": "So excited ... cannot wait", "being_mpiloe": "Please don't make us wait this long again", "flr709": "Can't wait 😍!!", "gottabethe1": "❤️🔥❤️🔥", "danielle.parent.921": "Finally!!!!!!!!!!!!!!!😍", "jus1ghana": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 Yessssssssss", "fresh_eats_llc": "Period!! 💜💯✨🧘🏾‍♀️", "keezwitnokeez": "Yeesss come on issa..lawrence..daniel..and molly..Im here for it", "laurinlee531": "@milameric34 🙌🏽", "jessw_to": "So happy about this!!!", "ohhhheykels": "Thanks", "look4g": "Friend @iammedw you ready!", "tryn03": "Thank goodness. We all need a good laugh right now ❤️", "_jamesw93_": "Yasss!! 🙌🏾🙌🏾", "melandolly": "This makes me so happy. I totally forgot this was coming back after all this stuff going on mow", "desweetestmelanin": "Yeeeaaaaaasssss!", "queenmadams": "Best thing about the shut in is that I get to binge season 4!!!!🥰🥰😁🙌🏾", "be_cause.i.am.yas": "Yeah!!!! Can't wait girl!", "yvette_slp": "Finally something to get our minds off this Pandemic for awhile!!! Can’t wait!!", "_nadeerah": "I cant wait🔥", "primavana": "I'm so over you for taking so long !!! Ugh! *Rolls eyes *", "jhonorio": "Can't wait!!!", "stephee_brink": "Yesssss! Can’t wait!", "kissmyiink_": "Yessssssss 😜", "wearepushblack": "🙌🏿", "kjaycross3": "🔥🔥🔥🔥👏", "ehi11en": "I can’t wait!!! Yeassss!!! 👏👏👏👏👏👏👏👏👏", "successready": "🚀🚀🚀", "ccsmommager": "🙌🏾🙌🏾🙌🏾🙌🏾👏🏾👏🏾", "reneeafram": "@aliyah.young", "maliciouslydiane": "@primadxnna_gia !!!!!!", "2023_millionaire": "Yes 🙌🏾🔥😍😍can’t wait", "quiera_borders": "🔥🔥🔥🔥 Feels like ive waited my whole life for this season!!! Its a countdown now 💕💕💕💕", "trish_pena": "Can’t wait!!! 😍", "codebari": "❤️", "pinkladee8iw": "Pumped!!!!🔥🔥😘", "jazmynnon": "@lianenoriko !!!! Do you have HBO again? If not, I gotchu fam", "oguchinicole": "Oh I have been waiting for this moment... I'm so happy 😍❤️", "ohthatssirena__": "YESSSSSSSSS", "alvestah73": "So ready for this! 🙌🏾", "lovemeles": "@_october24th 🔥🔥🔥", "sonso.r": "@420.isa guess who gon be glued to tv", "jenny_beautiful0514": "Yeeeeeeeeesssssss", "truefoodie82": "Super excited!!!", "speedydrjs": "😍💚💚", "gabbycita_03": "@amritajhas 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "ka_mya_": "🙌🏾🙌🏾🙌🏾🙌🏾", "prty5mile87": "@knightparker28 🙌", "getuamercedes": "Can’t wait 😍", "dre_la_mont": "@issarae let me play an extra or something in the next show help a brotha out 💪🏾😂💯", "taycentric": "Yesssss", "kickbackconversationspodcast": "Checkout our video podcast about @insecurehbo first 3 seasons recap and what we want to see going forward for season 4 from a black man's perspective! Episode available this Friday", "kizzyboomboom": "🙌🏽💕", "lucylou_lovinlife": "Yesss thank you!!! 🙌🏾🙌🏾🙌🏾", "malika_black": "About damn time!!!", "pinkdiamond40": "Yay!!!", "car_d_rich": "We need this", "chrissyloves_1212": "Can’t wait @issarae 🙌🏾🙌🏾", "cheekz86o": "@noister79", "chibama06": "Pure 🌊", "nine_oh_yo": "Can’t wait!", "ama.__x": "Yaaay 🎉🎉", "_neisharockstar": "BUT GOD 🙌🏾", "bammbella": "@relax_bxtch @shunxii 🗣🗣", "coelingual": "Thank f-ing god.", "peanutandmama": "@loving_simplyme its almost time!!!", "thefstopny": "@gracemiatta @dmitri_brown", "_simplyamazingg": "Yesssssssssssssss", "hair_fever": "Yasssssss", "deedeebomb": "Yay!!!!", "just.stephanie": "@wonderwoman_brittany I’m sooooooo excited! Like my “heart skipped a beat” type shit! 🤣🤣", "jdw9009": "Finally!!!!", "jademarlow_": "Just what we need 🖤✨", "mercedesdaone": "Can y’all just release it today... I finished everything else", "crystaah78": "Can't wait", "hzathaproducer": "🙏🏻🙏🏻@issarae saving my life !", "tothefiveboroughs": "Thank GOD you’re coming back!", "anjelica_arcadia": "Can't wait for it.💓💓 Loving this fit!", "loveashxo": "Cant wait!!!!!!!!!!!!", "tiffanyneman": "@doctor_jays I needed this rn", "stayfocused_09": "🔥🔥🔥", "thebrandirussell": "Can we have all seasons up front since we’re #stayinghome? PLEASE!! cc: @erinpatrice23", "hillaryfierce": "Oh thank god something to look forward to!", "lovemedina23": "Love you issa", "marciawingfieldhill_is_chill": "Let me cut it back on...", "perrymic": "Can’t wait!!!!!❤️❤️❤️", "anthony_ant": "Looking forwardddd🔥🙌🏽", "ceecee_itsme": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "slh86": "I hope we get more than 8 episodes!!! We deserve it for waiting this long for season 3! 🙄🙄🙄", "ftennant47": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "cutieonduty7": "Soooo ready!!!!", "viveca_h": "Finally!!!!!😁 🙌", "iheart_dawn": "Yayyyyy 😍🔥", "abiba_sarah": "@cjlayne", "_segua_": "@enuluv okay!!!!!😍", "jayrellis\nVerified": "Verified", "maddygirl32": "Can’t wait!!!!", "mrsromeister": "God bless America! 🙏", "ivy_wambui": "💃🏽 @brianski_", "yinnarukami": "Finally !! 🙏🏾", "yvetteeful": "😩😩", "seshetaweavesrainbows": "@damadefuerza @pixiedoctor it’s time!!", "mrsfrost_2u": "Can’t wait !", "jrenae01": "FINALLY 🎉🎉🎉🙌🏾🙌🏾", "omika_wilson": "I’m so excited", "cottongrly": "Yeeesss been waiting👏👏👏", "kayy0208": "Finallyyyyyyyyyyyyyyyyyyyyy🥇😭", "terrijvaughn\nVerified": "Verified", "tarajemille": "I am soooo excited! Waiting with bated breath. 😃", "neablu44": "🙌🙌🙌🙌🙌🙌FINALLY!!!", "melisjweitz": "@ms.sece 😱😱", "zakiyyahlady": "Me too! I❤️U Issarae!😍♥️💞💞💞❗️💋", "roadrunnaszn": "😭😭😭😭", "pmdizzle": "@juris_doc_dre", "tiff_willing": "Fiiinnnaaaallllyyyyyyyyy 😍😍😍😍😍", "jjo326": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "sekou_4": "O yea a brother been waiting 👏👏👏👏👏", "vickyyyf": "LETS FREAKIN GOOOO!!!!!", "bnharris08": "I.Cant.Wait!!!!!❤️❤️", "razzberryz_": "Yyyaaaaayyyy😍😍😍", "therebelwithoutacause": "Let’s go! ❤️❤️❤️❤️❤️❤️❤️", "reenalanece87": "Been waiting like it’s my taxes..😩🙌🏾", "nicholas.dennis_": "Can we get a spin off of Lawrence tho", "almondiiee_brown": "Yess!!!!FINALLY!!!!", "crownedincurls1001": "yasss! 🥳🤩😜", "glam_mini": "It airs 24hrs later in South Africa for us regular people on @dstvza thanks to @mnettv but that's okay. Still gonna be in the loop and that's all that matters #cantwait #itsbeentoolong #whatsalockdownwithoutinsecure #letsgetit", "killuminaaaaaati": "YESSSSS", "refihhh.loe": "WE READY!!!!💥", "mrsguffie": "👏👏👏", "themulattomarauder": "@bmatejas thanks for putting me on 🥰", "kysfinest39": "FINALLY!!!🙌🏽", "biancavictoriajoseph": "Yes yes yes", "_kaylaaah": "YESSSS SNATCH MY WIG 😭", "kinglovingstein": "👌🏾👌🏾👌🏾", "roro_sarfo24": "Yes❤️", "stonyblessing": "Okay, I was already jumping out of my socks ✨😌🥂 ...buuut @noahyesa YESSSSSSSS 💪🏾✨ #BigBlessings", "tomoss87": "Thank you sweet baby back ribs!!! So excited 🎉🎉🎉🎉", "mayashnap": "Yay!!!!!! ♥️", "tianagabi": "My god... is my niver. Congratulitions. Thank you @issarae ❤️❤️❤️😘", "joneztre": "Bout time", "_mabasically": "😻😻😻😻😻😻@aseh__seventxxn 🙂🙂🙂", "bluupeacock": "I Can.Not.Wait!!!", "stoneybaloney3_": "TFG FOR THIS BEACON OF LIGHT IN TIME OF NEED", "averilarmstrong_": "🙌🏾", "samueldhladhla": "🏆", "v7n7s7_": "Yes Auntie!", "realcsweet": "🙌🏽", "babycola69": "Dang I need to catch up, I was hooked by Season 1 turn the hubby got rid of HBO BUT I WILL GET IT BACK Just for this show❤️", "cynwebs": "👏👏👏👏 Hurray!!!", "dablkrdaberri": "This just made my week so much better! ArmyNurseLife!", "__lovejonzz": "Yesss lordt 🔥🔥🙌", "virgo305": "@fuk_yo_picz", "claralaurelle": "😭When's it on Netflix UK", "3tatts4me": "Let me see if I can subscribe to HBO app 🤦‍♀️", "tamara.johnson.90281": "Yeeeeaaaahhhh!💯", "mrsjenkinss35": "Finally...", "christeenuh88": "Yaaaaaaas!!👏👏", "thedjtwalk": "Yusssss", "kiiiasia": "Y I ain’t see y’lan in the trailer .", "dreacalifornia": "Bro I can’t wait to lmao @vicen_rios", "jenniferrenaye": "WOO WOO 🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️", "msjls8": "Yesssss @heybgee", "breewil_": "Yesss honey!", "missmachuma": "The can’t waitness in me is dying", "zacharymarthinussen": "This show you need to watch @carina_deolive", "chocolateurfav": "I don't forgot all about this show, n cancelled HBO tf, took 2 long", "brown_cocoa_": "We appreciate you for this 🙏🏾", "teaira_c": "🎉🎉", "falosmile": "Ready!!!", "_karmaa": "🙌🏽🙌🏽🙌🏽", "yenmijares": "Yenis Mijares I want to see HBO on Sunday at 10PM.", "st.acy2249": "Getting ready. Love this show. Missed it a lot.", "livealilwhore": "fckn finally", "fit_rozzi": "I AM READY!", "conselhosdanadia": "Can’t wait ❤️❤️❤️❤️❤️", "beautiful_usable": "This and @killingeve in the same week?! I die.", "galacticarrolla": "Aaaaaaaaaah 🔥🔥🔥🔥🔥💃💃💃", "uma_ariiana": "@nisia.tomar", "jojo_choo": "Cc @liline.97 😁", "daddyeii5": "Watching😘🌹💙", "beztdayever": "We need this now more than ever 🔥", "chou_audrey": "Yasssssssssss 🔥🔥🔥🔥🔥 @dee2thejae @dee2thejae", "dominicanamericana": "😭😭🙏🏽🙏🏽✨✨❤️🧚🏽‍♀️can’t wait!!!!", "curtisddavis": "🙌🏾🙌🏾 #leggo 👏🏾👏🏻", "1.dkcc": "🥳🥳"}