{"ltfranklin38": "🔥🔥🔥🔥🔥love it thank you", "parksdumas": "Super dope mailman. 👑❤️", "preshnicholas": "Y'all made Magic! I love the movie", "ameliag5587": "I love this movie and the soundtrack Lordt I fell in love 🥰", "iammyownlove216": "@issarae the movie give me LIFE❤️ so raw so real so BLACK LOVE 😍😘", "drericadnp": "Issa I want you to know I just got done watching your movie The Photograph. I finished my last semester of graduate school today and I watched your movie to celebrate. It was absolutely beautiful and amazing! I pray that you will read this because I want you to know that we are here and we love you! We will continue to support you no matter what!!! You just keep on dreaming while you are awake!! We love you! ❤️", "jesuisjeniece": "😍😍😍😍😍😍", "bukkkkky": "You guyz killed the movie😍😍😍", "iammycreator": "HA! ✌️❤️", "justjerria": "❤️❤️😍😍😍", "sugarcrashdbd": "I opened this instagram account just to ask Issa Rae where I can find the names of the artists for the artwork in Mae's apartment? Anybody? Please?", "therecudonlyb1": "@issarae, @lakeithstanfield3 Ya'll did ya'll thang in this movie! The chemistry seemed effortless. Great acting !!!🔥🔥🔥🔥🔥", "iireal4u": "Loved this movieeeeeeed!!! OMG!!", "prn.cessmel": "Was *such* a good movie! And the soundtrack was 💥 too! The last movie I’ll see for the next while 🥺😷🦠", "uramberoasis": "Was able to purchase on prime today 😆😆😆", "queen_royal400": "🌹🌹🌹", "preshi3": "Loved it.", "_gummybearss": "I just watched it and it is incredible ❤", "seams_byminah": "I love this movie so much❤️❤️watched it twice the first time ń can't stop thinking about it n my love life", "d_luxury_": "Hey tv bestie, I absolutely loved the movie 🖤", "muonnah1234": "Loved it... Lo❤️ve u guys💕💕💕💕💕", "sayeedasflutesong": "It was bomb. Actually my last movie before COVID. 👌🏾👌🏾👌🏾", "zirkanadi": "the photograph what a movie i loved it", "showstoppingdiva": "GODS PLANS CANNOT BE STOPPED 😇💯👑❤️🚀⭐️🎉", "rae_rae_monet": "A great movie!! Great job guys", "iamkevindlofton": "Excellent film 👍🏽💯", "mzztiamo": "💥We Enjoyed💥Great Movie💥", "schneikafb": "Absolutely loved it! 💖", "just_zama_mkhize": "Cinema’s are closed in South Africa, I was sooooo looking forward to watching it! 😭😭😭😭", "or_landau": "❤️❤️", "_special_____k____": "loved this 😍😍", "conniemcdaniel3418": "I loved this movie went to see when it came out in movies beautiful.", "chatman2s": "Quarantined and watching all seasons on HBO. One of the pluses of the pandemic: I actually got to watch #insecure for the first time and I love it! I’m always laughing 😂 through the craziness. Your “Broken Pussy” song though lol 😂 😂😂😂 @issarae keep the funny coming and stay safe!! 👍💕", "mr504ike": "The Photograph Wow.. I really enjoyed every moment. I felt all the emotions ups and downs.. Great job... You have a fan for life👍🏿 Beautiful Black Queen😍❤️👏🏽", "clutchyourcloset": "Check out my new blog post about the movie! I’m so glad it comes out today and I can rent it during the Quarantine. 💕 The link to my “ The Photograph” review is in my bio. 💞💞💞🙌🏾🙌🏾🙌🏾❤️🔥", "i_luster": "Ughh this movie came out at the worst time! I hope they do a Re-release of this movie! It didn’t get it’s just due!", "ohh_dogg": "This was a great flick. 🙌🏿🙌🏿", "shotwhisperer9": "♥️", "_aliciabeautiful": "Yessss serving looks ❤️❤️❤️", "punasty": "@stephfrycki 👀", "bonke20": "❤️🧡💜🧡❤️🖤🖤🖤🖤💜💜🖤💜💜💚🖤🖤💙💜💚💚⭐️❤️⭐️💚💜❤️💜💜🧡⭐️❤️❤️⭐️⭐️🧡⭐️🧡💙🧡🖤🧡❤️❤️❤️🧡💚🧡💚🧡💚💛💚💛🖤💛🖤🧡💚🧡💚🧡🧡💙🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡⭐️🧡🧡🖤🧡🖤🧡💚🧡💚🧡🧡🖤💙💙💛⭐️💛⭐️💛⭐️⭐️💛⭐️⭐️❤️🧡❤️⭐️❤️❤️⭐️❤️⭐️❤️⭐️⭐️", "queenrnb86": "i love the hair!!! & he so cute!!", "godsproperty211": "I loved the movie!!!", "1_stylish_jaii": "Amazing movie❤️", "virtuous2mommyfamily": "A new favorite movie🦋", "theartoftaj": "This movie was so good.. 🤗🤗💞💞", "_scotty89": "🔥🔥🔥", "nicbydesign": "Obsessed with this movie, will it be released to tv like some other current releases @issarae", "blackboardwiththadezzy": "Loved the film you did a great job Lakeith was fantastic too y’all had great chemistry.", "pennigeb": "I couldn’t wait to buy this on dvd as soon I was out the damn theatre!!! 🙌🏽♥️🙌🏽♥️🙌🏽", "qtpie031976": "@issarae will this be released soon?", "kizzaayy": "This movie!!! >>>", "nina.mosley.1997": "I LOVED this movie. ❤️❤️❤️❤️", "kalypso_red": "@modelgirl2008 the movie we were talking about", "chrissytinaco": "I won’t lie to you. I was so excited to see and I was so disappointed in it. It felt rushed. It seemed there was a longer storyline but there was budget cutes to things were cropped out and thrown together to having an ending. I don’t think it was well thought out. It had way more potential then what was given.", "bycapablepeople": "@stellameghie @issarae @lakeithstanfield3 ... both the writing and direction made its way from a understanding and kind heart. It can be complicated when the budget (studio) and the production are of two opposite opportunities ( sewn together for comfort) overall for the best outcomes. That being shared as my opinion.... the two main characters (+intro/sub character) tone of voice adds to their (real for real) natural demeanors in the \"making the film\". Both @issarae vocal pitch+ and @lakeithstanfield3 vocal flow~ forms something more than is expected, not unexpected...almost \"quirky coolness\" to the \"t\".😉 So much to take away and run with and only to celebrate a wonderful depiction of change, movement, sadness, hope, passion, discovery, disappointments, love, ..and much love. One to grow on, \"I wish I was as good at love as I was at working.” I wish I didn’t leave(the) people (that I love) behind so often.\" JOB WELL DONE!", "k.newbey": "Can y’all get together and make beautiful brown babies that be akkin too. Just bless the world in the best way for us, pleeeeaaase 🤗🔥💛😂", "princeyoel": "Beautiful film! Lovely, touching black love story, and loved you and Lakeith together ❤️👌🏽", "tierralashai": "I love that relatable and diverse loves stories like this are being made with people who look like you two 🖤🙏🏾", "ugonextt": "Great film!!", "blessedbeyondmeasure___": "OMG😍,,,,, Loveeeeeeeeeeeeeeeeeeeeeeeeeee you guys😘", "justarnile": "Loved it!", "tshiamofaith": "It was absolutely beautiful 🥰💕", "left.hand.kenzie": "A beautiful love story...blew my mind💕", "nnens": "Loved every single second of it!", "blackbarbiesouledition": "Issa please make this movie available on Amazon Prime. I was not able to see it prior to social distancing.", "justginalove84": "💯🔥🔥🔥IM SO IN LOVE with this movie 😍👏👏👏👏👏. I haven’t felt this way since I saw “the notebook”. Now we have a love story that will become a classic. Love all who was involved with the production of “The Photograph” 👏👏😍🔥", "amberstylezcutz": "So beautiful 😍", "beautifullmee1": "@issarae although my jealousy of this hit a sky rocketing murder rate I love this lol lmao", "leratogantsho": "I wanna see this again ❤️😍", "ke27_55": "I loved this movie!", "missletishaj": "@issarae they are literally tryna sabotage your movie in the UK. No marketing and majority of the screen times are on weekdays showing at times when people are at work. Weekends you can probably get 2 or 3 cinemas out of the whole of LONDON showing it. They hate to see Black Love. Please try and get them to sort it out 😫😫", "vdayy": "I was so distraught to find he was in a whole relationship. Truly ruined my Valentine’s Day lmao", "treila_d_marshall613": "🤎🤎", "thebabyinchrist": "I loved it 🥺😍😍😍❤️❤️💯", "legacyimpactinc": "Saw it ! I got so many messages out of that movie. The generational cycle of things. And you broke it ! 💗", "keletsomaine": "This movie was absolutely amazing! You two in it were just... right! 👏🏿🙌🏿", "persisttheatricals": "@issarae you and @lakeithstanfield3 were absolutely amazing on the screen would love to see you two onstage in a play. Your chemistry is sizzling.", "humblyangel": "Added to my short list of movie favs today! Thank youuu!!!", "t.herron4": "Yes you got him out of the sunken place😁", "itsjqboo": "I love you and will always support you, but please archive this photo it’s hurting my feelings. 😖😭😭😭😭😭😭", "msgjj_70": "relevant movie", "realerdenreaal": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "kamil_kobani": "💞", "thee_.kjjayy": "I wish I was the male version of her", "meeka_bre": "Loved the movie! ❤️", "skinniminni85": "I still need to see this 😩 #cantwait", "sidneyjustice4": "GET OUT LOL", "onyiudeh": "Great movie 👏🏿👏🏿👏🏿", "majorkeypub": "😍😍😍", "blackgirlsjuice716": "I left that movie floating. great of young black love story of trust forgiveness and chance ❤️❤️", "beautiful_soul9": "That movie was so dope 💯", "mistee_wants_to_know": "Thank you. The movie was great and so happy it came out before the virus. #misteewantstoknow", "prettyasskerr": "I live for couples like this", "ttrailblazerr": "I thought homie was gone kill you the whole movie 🤣🤣🤣🤦🏻‍♂️ smh he can def play the joker though 🃏", "basseyworld\nVerified": "Verified", "alishasweatt": "Whew when is the wedding ?", "halohoopz": "The movie was DOPE BOI FRESH💯💯", "fancinanc": "Issa you’re the first celebrity I’m writing to like I know, but I had to. Your movie did something to me last night. And on a first date. Smh 🤦🏾‍♀️ I don’t know if he’s gonna call back but I don’t regret a single tear. Lol. 😂 Thank you for portraying the struggle to give and receive love as a Black woman sometimes. And for showing how that habit is passed on generationally at times but it is still possible to heal. To break those generational curses and live fully again. Now I think Black men could still do a little more to stop running and show up like Cameron from Love is Blind...but that’s another post for another time. Thanks for being you Issa. Your art is saving lives out here chile!! ❤️", "lorethaskid": "Yall should just go together in real life", "psychiczya": "It was delicious", "remy_lebeau1979": "👏❤️", "smilesbywrapstar": "I do not have a favorite movie but I think this one is about to be it! Thank you all for this story! 😍", "evhargrove": "I saw The Photograph today, and LOVED-ED IT! 💯💞💗👏🏾", "joreezee": "Great movie", "shanell_price": "Love❤️ this movie just seem it today", "big_homey_305": "Love the movie took my lady with me and it was a magical night.", "ngreene93": "Saw The Photograph last night and absolutely loved it!!! ❤️❤️❤️❤️ So much chemistry between these 2! 🔥🔥🔥", "trigga_tmg": "Great movie love you ❤️❤️❤️", "anw185": "💖", "lola_xoxo1972": "I loved the movie ! Great job🌻", "mrssoxy_monroe": "LOVED THE CHEMISTRY!!! OMG 🥰🥰🥰🥰🥰🥰", "0fficial.kyicer": "I’m was an AMAZING movie ❤️❤️", "dpskipallen": "I really liked the Photograph and the lovebirds looks really funny.", "colby_brown_orange_boy": "🧡🍊🧡🍊🧡", "sheneepecora": "I love The Photograph 🖤", "shakur.x": "😍😍😍😍😍😍😍", "in_denise_world": "Absolutely ❤️ Loved this ..", "pacific_coast_tone": "Amazing film! Loved every single frame of it!!! 🙌🏾🙌🏾🙌🏾🔥🔥🔥 #thankyou", "ahaddadb": "You SLAYED in this 🔥❤️", "iamqueencrys": "Lawd that man fine", "ms.focused.one": "I loved this movie! ❤️", "curlygirlmemoir": "♥️", "reachin_nirvana_": "Yall would make a dope ass couple", "annetta192": "Great movie 👍👍👍", "niknik1623": "Mos def to me considered a classic. No full on crazy drama. It felt so real even though it was a movie. Ms. Issa you are truly blessed with a gift and thank you for sharing. Insecure is MAJOR🙌🏾 I also appreciate that my celebrity crush Lakeith was your male lead. He is so #DOPE and I'm done #stayblessed🙏🏾", "jpanther143": "A film to see over and over again", "karyyouman": "👑🖤", "hoosierq_": "Topped my date night off ✊🏽🖤", "mysstownsend": "Ridiculously gorgeous", "nationwidedream": "Yes girl yes. Drip drip drip", "kellzie4949": "Great movie. I enjoyed it", "mingmingthing": "It was sooooooo gooooodddd I seen it twice 🙌🏾💕💕💕", "tanettalynette": "Hey! ❤️", "iam_simoneau": "@issarae Dope movie!", "quasarkai": "❤️❤️❤️", "a_whitney_h": "Just saw the Photograph last night this movie is so bomb, it was visibly beautiful & every piece of music is now my favorite great job @issarae 👏🏽", "kingnora_85": "Loved it🔥🔥🔥", "originalshavonte": "Two absolutely stunning people 😍😍 and the movie was excellent! Loved it!", "alexnmason": "I saw it last night and loved it. I want to see it again today.", "iim_niahh_": "🤩🤩🤩", "luvshai": "I absolutely loved this movie❤️ thank you so much for your role in it. My life story was played out on the big screen. I’m so proud of you for all of your accomplishments.", "kim_lomax": "Awesome movie❤️", "_swa.zy": "❤️😍that's a very nice movie went for the premiere yesterday", "treetr3e": "Just seen The Photograph and I loved it. It was a real black love story. Not one that was instant but one that was real.", "jamialorena": "Can y’all do us a favor.. get married & have some babies 👀", "ijego": "❤️💕❤️", "mrs_law_wife": "The new Love Jones Couple for the nee millennium ❤️❤️", "gi.anna_": "Seriously The Photograph is now apart of my all time favorite movies. Thank you", "badd_bunni87": "Such a great movie🎉🎉🙌🏾🙌🏾🙌🏾", "skydavishigh": "Wᴀɴɴᴀ ᴄᴏᴍᴇ sᴋʏᴅɪᴠɪɴɢ ᴡɪᴛʜ ᴍᴇ ғᴏʀ ᴍʏ ᴡᴇʙ sᴇʀɪᴇs?!", "gailwerner": "Cannot wait to see this movie!", "shawynagraham": "💕", "0nna_spaz_": "The movie was dope! @issarae you're drop dead gorgeous!🙏🏿😍", "quincyab8": "Hella dope !!! Thank you all !!🔥🔥", "shondra_gettingfit2": "Loooove the movie‼️‼️‼️", "jaysunexpectedjourney_": "I WENT TO GO SEE THIS WITH MY WIFE AND I HAVE TO SAVE IVE NEVER ENJOYED WATCHING A MOVIE AS MUCH AS I LOVED THIS ONE!!!!! ❤️ AMAZING @issarae", "chrissyg72__rn": "👏🏽👏🏽Loved the Movie.", "a_quohtable_life_": "Good movie", "presidentmayo": "Such a great movie!👏🏿", "jlw725": "The Photograph was such a beautiful movie, well done @issarae @lakeithstanfield3 ❤️", "lipstickgem_80": "Amazing flick❤️", "brad1new": "Just proof our movies can be made with positivey my focus was on your eye and smile the whole movie. Just beautiful. Keep making those type movies and I don't have a problem sending 13.00. And great VALENTINES DAY movie. 😘 ❤️🔥", "jaina_bundage": "This movie was amazinggggggg", "prettyramss": "My parents ❤️", "im_me_ok1": "Just saw your movie. It was excellent 😍🙏🏽😍Your beauty was so breathtaking 🔥🍫🔥🍫🔥.Keep shining.Much respect 😍", "iampreciousrule": "Love the movie! A classic love story", "arianaa_xox": "Can you two just be together in real life?", "bredbutterfly": "Seen it! Beautiful", "sista_redd13": "Great movie! You and LaKeith were incredible. 🖤🖤", "lisagirl.40": "I live this movie 😍", "icywhatyoumean": "Yall lookin like somebody mom and pops", "jirehbreonholder": "Saw it twice already. So good!", "exoticprincessb": "🔥🔥🔥", "sols_off_mute": "Iconic mogals. Love what you do, how authentically you represent for your self, the message and the beings that is us-ness. And I appreciate you. Thank you both.🙏🏾💓", "solidseveral": "I felt like I was watching my brother make it with Mae. He trusted the process. I’m the anxiety character of my family. Getting hired to fall in love... that’s for some people and not for the others.", "icee72": "Absoulty LOVED THIS MOVIE!!! Saw it with my oldest daughter for our Valentines movie tradition & I had just lost my mom two weeks ago. This movie touched alot of different emotions. Needless to say we were both in tears at the end!❤ @stellameghie @issarae", "deloresred78": "AWESOME", "itssimply_bee": "Amazing movie", "rebitup67": "Just watched “the photograph”. It was amazing. I truly loved this movie @issarae", "shantiaaaa_______": "GIRL it was BETTER THAN THE NOTEBOOK!!! ❤️❤️❤️", "rufuschambers3": "Bravo!!!! Beautiful movie! #blacklove", "kellyjohnally": "I really enjoyed this movie 🙌", "bigtaydo": "Watching now", "ghettod1984": "Just seen it it almost made me cry", "alumniroyale": "💯💯💯🔥🔥🔥", "cmonts1987": "This movie was EVERYTHING!! You two killed these roles! So so proud of you! It was absolutely brilliant. ❤️", "chanelxevans": "Just saw it. FUCKING AMAZING!!!!!!!😪", "bougieboard_phx": "Such a great movie❤️", "lethalshooter\nVerified": "Verified", "richiemadisoninteriors": "🤎", "iammarcusemel": "The Photograph was the shit. 💯", "m1nd_vs_h3art": "I loved it", "nalareign516": "I cried 5 times. That movie did something to me. It was good though. A must see. AND alllll the melanin was 🔥🔥🔥😍😍", "_ijeabalum_28": "Go girl!!!!❤️❤️❤️", "brokematerialgirl": "My husband", "chefnette38": "Your movie is what black love is all about. Congratulations. @issarae I would have went after him to, he is fine. ❤️❤️❤️🔥🔥🔥🔥", "lhasa_view": "Well done @stellameghie", "rosiebonds": "Damn he fine", "k__muse": "Loved It. 🙌🏾❤️", "ms_freeman83": "LOVED IT!!!", "inevitable.oncology.cra": "What a Beautiful Movie!!!! #BlackLove", "prettia13": "Going to see it again. 💗🔥", "awesomelinlin": "❤️❤️Just watched the movie It was amazing.", "davidsrachleff": "The Photograph is brilliant, beautiful, touching & heartfelt. Thank you, Issa Rae! ❤️❤️❤️", "shea_305": "Awesome movie!!", "fittarrahtw": "Loved the movie!!!💞", "mochamap": "Is there a soundtrack ? The music was 🔥🔥🔥", "eplleseed": "This was so great, guys! Thank you", "terimeowlittlefeather": "Saw the movie today with my sister and we absolutley loved it. The music was great. Just like watching your show on HBO its like I need another episode to follow. Get some rest and hopefully we will see you in your next project. Such a fan and congratulations on your work.", "flirtygranola": "Can't wait to see this!!!", "reneemarietm": "Great movie! I cried 3 times during it! ☺️", "aka20grand": "Saw it! Loved it!💗💚", "_winning4ever": "Loved it!! 👏🏾👏🏾👏🏾", "c0mput3r_n3rd": "Amazing movie. You did your thang", "sweettingz92": "You give so many young black girls life , thank you for being you . Thank you for being relatable . ❤️❤️❤️❤️❤️", "1hotrah": "Love it", "islandsupreme1": "Saw this movie last night with my husband on our 20th anniversary 2.20.2020 and I’m absolutely in love with this movie. The plot, the amazing cast, and the on screen chemistry were all phenomenal. 💪🏾🖤", "comeze2": "🤩🤩", "transitions2020": "Movie was everything 🔥🔥🔥", "ms_brinizzle24": "They make a beautiful couple ❤️😍", "keamalvo": "Great movie... dang yawl was giving me vibes 🔥🔥", "kimpossible1738": "Great movie", "msevh": "I absolutely loved this movie. It was too cute and so real...", "_jazzlohizo_": "Better be sexy!! Jk, love you guys❤️❤️", "deejuzsaying": "💚 Love the show💚💚💚", "mskeshababy": "Loved this movie", "glbonly1": "Thank you", "the_power_of_the_dm": "great movie", "life_is_life713": "🍫🍫", "realfrontlinemillionaires": "💙💙", "fancybowtiesplus": "Loved the Movie. I told my husband there’s got to be a part 2. 🙏🏽💞🙌", "mrskeshspeaks": "It was so DOPE...going back to see it again!", "daneque1": "😍", "illjp_": "Beautiful cast, beautiful locations, beautiful movie", "kdb_customs": "Unless you plan to pay back all you took you should def leave me alone", "jacquescolimon\nVerified": "Verified", "ashleyezzyy": "Bring @lakeithstanfield3 to insecure!!!", "ahiter55": "Follow ahiter55", "_romellav": "Great movie🔥🔥💋", "kelvinwootenproducer": "🚀🚀🚀", "mssassyifunasty": "Yall look good together 😍 🔥", "__sadiemae____": "Such a great movie!!!!😍", "brandonfernandex": "🧡🧡", "minkedbyforeign": "Hey Issa! Check out our cruelty free mink lashes! Head over to our website with the coupon code FAM & save 5%! (www.minkedbyforeign.com)💞", "evolutionman23": "Great Movie💯🤲🏿🙏🏿", "justteejames": "It was amazing. You are a treasure. 🤎🖤🤎🖤", "brianna_prettiebrowneyez13": "Excellent absolutely beautiful movie bravo to the whole cast❤️❤️❤️💜💜💜", "passion4planners": "Beautiful movie!", "babyzexclusive": "It was Literally such a good movie , I'm in luvvv💞", "_traceylorraine": "I @issarae I saw it Tuesday and I must say I saw a different side of your acting and I love it, and that man @lakeithstanfield3 😍🥰😍🥰Amazing actor award well...", "studangel09": "Y’all make an beautiful couple!! @issarae", "munchiesonthemove": "Seen. 💓💓💓💓💓", "ugh.sucka": "❤️", "shayseverything": "✊🏾✊🏾✊🏾✊🏾✊🏾✊🏾✊🏾", "reel2reel4real": "Phenomenal Movie", "edalston885": "💪🏽💪🏽💪🏽💪🏽🙌🏽", "tc242michaels_": "Susssss the movie was amazing! @issarae", "therealestate_maven": "Love the movie! Great work ❤️", "dalisa88": "It was a beautiful movie @issarae", "layabaya88": "Absolutely love your style! 😍", "_plondon_": "Sooo y’all go together right 👀💖😂", "donnruff": "Bravo Bravo 👏🏾 👏🏾...only 1 problem tho..all that dope music in the movie and y’all didn’t play J Cole “Photograph” at all 🤦🏾‍♂️ that’s the perfect song for this movie", "sweetie_jazzypoo": "Loved this movie!! Loved the chemistry 👀♥️", "rue_snkrs_tees": "Great movie!!!!!", "msshe25": "The movie was soooooo dope. Great job yall!!", "6figurechasermrjaco": "Dope ass movie I loved it @issarae", "_teesmoove": "I can’t unsee Get Out rn 😭😭😭😭😭 y’all fab tho 🔥", "ms_sebastian": "I could not stop staring at your PERFECT teeth while watching the movie 😂", "fallon.shelby": "I just saw the movie today with my sister. Y'all did that!!! We loved it, the music was awesome. We were raving at the way it was so visually stunning as well. Taking my cousin to go and see this weekend. 🔥", "stanleyparrish": "Y'all did a great job! Thank you", "teamarie469": "So good!! 🙌🏾🙌🏾", "yurithdreyna": "I love this couple 💗 she’s so gorgeous", "tawnytaylorlive": "I love black love!", "songbird149": "Loved your film @issarae", "apryl_mayy": "Loved EVERY minute of this movie!! Black love movie with the highest regard. #notraumanodrama", "thelightrhyder": "I Like this Photo. It melts my cold, black heart.", "sugarfigure22": "🔥🔥🔥🔥🔥", "msundrstd1": "This movie made me smile from ear to ear! It’s sad people are so cynical and envious of others that they can’t enjoy a movie like this. It was simply fantastic! Keep making wonderful content like this. The world really needs these types of movies. I really need these types of movies!", "iamshaliya": "LOOOOOVED THE MOVIE! 🔥🖤🔥", "rocwithme4once": "This movie moved my very soul!!!!🔥🔥🔥🔥🔥", "brenduhhh8": "🤴🏾👸🏽🙌🏽🙌🏽", "cinaandalex": "Loved it! 🙌", "koreanblue87": "Loved it ❤️❤️👏🏾✊🏾", "aristocrat_ish": "One of the best movies in decades!!", "dtmpezzy": "Great movie 🙌🏾", "rogero_": "#ThePhotograph was beautifully shot. The people were beautiful. The score was beautiful... I really liked it.", "art.of.divine": "Never thought she was cute but in these movie commercials she is bustin.this pic too.not gonna see a feminist laden chick flick doe", "kicksbringmejoii": "What an excellent, tasteful display of black love.. This movie was everything @issarae !!!!!! And by everything I mean, excellent picture, well written, well directed, deep, relatable, romantic, the list goes on.. and don’t get me started on the Soundtrack! Your soundtracks are always perfect! ⭐️⭐️⭐️⭐️⭐️ #abgfan #insecurefan #day1 ❤️❤️", "tomboy614": "OMG... The Photograph 🔥🔥🔥❤️❤️❤️", "majlite": "🙌🏾🙌🏾", "tygeryvonne": "💜💜💜💜💜💜💜💜", "cocoavriel": "This was amazing! It’s nice to see a GOOD romance movie with talented actors to whom you can relate. Beautifully executed black love story. 🖤 Kudos 🥂", "bubblez617": "Great movie saw it in theaters on vday!", "magnoliapeach_91": "😍😍😍😍", "mssha_slays": "It such an amazing movie!!! I saw it tonight!!! 😍😍😍😍", "samiraonelove": "I 🖤🖤🖤 the movie!", "teesgottahaveit": "A Queen & her King! Thank you @issarae and @lakeithstanfield3 for this Love Story #issamood #seeThePhotograph", "brilliant_beautiful": "Loved the movie!!!!!!", "perfectlyimperfectmr_capell": "Great movie @issarae", "youbettaknowdebbiemcintyre": "Simply Beautiful Movie🤗😍❤", "fellyfelt": "Trash movie feel to sleep it", "carringtonmelinda": "Enjoyed the movie 🔥", "nancynya_": "Going tomorrow!!", "aspoonfulofsuga": "I enjoyed the movie....that soundtrack though,🔥!", "optimisticwins0303": "I just saw The Photograph last night. I loved it. His answer to your question in the last seen, \"being pathetic, \" is such a reality. It made my right eye , tear up. If you can get, Get It!🦋", "rainedrops_onme": "We loved the movie! The writing, the lighting, directing and the sheer looks on your faces captured our ♥️. The way he looked at you in Paris, how he had to “catch” his breath, was chilling. I must watch it again to count how many times the word LOVE was used. Although I don’t think it was said a lot, but the actions were truly there from the first moment he took that 🦀 out the pot!🥰🥰", "itskhaiibetch": "😍😍😍😍😍", "ladyzee11": "Great movie ❤️🌹❤️ Just saw it 😍", "quacyxcole": "Great movie, I enjoyed It. 👏🏿", "rita_alyse": "Amazing movie! In and out! ❤️❤️❤️", "talithaed": "OMG! The Photograph was GREAT! You all did am amazing job! ❤️", "soamazing_sheis": "❤️Great Movie❤️", "cynthiamarie72": "You guys look like the perfect couple.", "misscocobulls": "💯🔥💕Loved It", "mal_jr2": "I’m Issa Rae future", "ms_jblessed": "🔥🔥🔥🔥🔥", "allahsfavorite": "Movie was soooo 🔥🔥🔥🔥🔥🔥🔥🔥", "reinavi": "Ya look related 😍", "chocolatet1": "Great movie! Soundtrack was fiya!!🔥🔥. Loved it!🥰🥰", "queenlbabi21": "I did and it was sooo good I really enjoyed it!", "yowee_": "It was soooooo good!! I can't wait to see it again. ❤️❤️❤️❤️", "chocolateteaforme": "👏👏👏👏", "spoiledinlove_": "Fuck around and get it😂😂😂😂😂", "jusbeindestiny": "Don’t be flirting with my man on set 😭😭😭", "ghenry925": "I saw the movie today. Loved it. Insecure meets love Jones 2.0. Wow wow and wow. I love you and proud of you. Now hurry up with Insecure lol @issarae", "errosoul": "Saw it, LOVED it, y’all killed it - and the soundtrack?! My God. You can do no wrong sis ❤️❤️❤️.", "sarahsrandomzzzz": "Loved seeing you in the movie ❤️", "maserati_hd": "Wonderful Movie🔥🔥cast was excellent", "whenkrysspeaks": "I loved the movie and y'all in it.", "gorg_n_fab": "Such a beautiful heartwarming love story!!! I loved it!!!🙌🏽🙌🏽❤❤", "dayummeesy": "i hope y’all get together irl.", "valentinemimi": "Just saw it. Amazing movie❣️👏🏾", "themain.t.opic": "Can’t wait to see this film,,, Thank you for being such a dope force of creativity and light .. More power , More Blessings 🙌", "tianna_bfree": "Love, Love, Loved this movie! 💕", "imarib23": "Beautiful portrayal of black love", "mary_mac81": "Just saw the movie! Instant classic! Loved it!", "blaqsugar44": "Looooveded It!!", "mamistacyy": "Gorge😍", "mrssmith032020": "Soooooo good!! Thank you for making this movie!👏🏾🙆🏾‍♀️❤️", "jaelthegreat": "Loved every moment of it. ❤️❤️❤️❤️❤️❤️❤️", "unapoligeticallyme": "Dear @stellameghie & @issarae, I wanted y’all to know that #ThePhotograph resonated with me on so many levels. I was extremely emotional throughout the entire movie and I found myself crying before the characters started crying. I see myself in “Mae” and “Christine,” and I believe the pathology of Black mothers having a hard time showing love and affection to their daughters really put my own relationship with my mother in perspective. I know many other Black women can relate to feeling unloved by their mothers because their is a lack of affection and our ptsd (post traumatic slave disorder) that was created from our enslavement in this country. Then the relationship that “Christine” had with “Issac” made me realize that I might be missing out on a chance to find love with a Black man that I have been friends with for almost 20 years because of my fear of losing him and losing our friendship. Thank you for making this beautiful art piece of BLACK 💕 LOVE. This is definitely 1 of my favorite movies of all times. Thank u Issa for choosing to show Black women as our authentic beautiful selves. Also, thank u to the entire cast & crew for creating & being Black excellence. Peace & Light", "deception_anton": "Really enjoyed the movie❤️", "carishathediva": "Sis I lovedddddddd the movie!!!! 🔥🔥🔥🔥🔥🔥", "qui.dancee": "LOVED THIS MOVIE!! 🙌🏾✨", "houstonsj1999": "❤️", "brigittejbarrow": "Saw it on Valentine’s Day and LOVED IT!!! I kept wanting to rewind it! 🤣😆🤣. So I plan to see it again in theaters but can’t wait to watch it over and over at home once it’s released digitally or on DVD.", "iambracquael": "@issarae I was so mad when you took off time to act and didnt do another season of insecure but Im glad you did now. You're just so talented. You and @thereallakeitstanfield3 did yal thing it was epic.", "officiallymagiic": "🖤", "quawana.lashawn": "Y’all look so good together ‼️❤️", "donnysmoove": "Y’all bodied", "dijah73": "Saw it today. Loved it! You’re amazing!", "coifrejuvenator": "Saw it last night.... Thank You, Thank You, Thank You!!!! It left me wanting to watch it again and again💯... praying for a love so pure, innocent and true...thank you!💞💕💞💕", "eazymoneysniper12": "Issa good ass movie", "caleb_negro": "#Atlanta", "jdvyc": "Me muero por verla 💕💕😍", "kat.lashawn21": "Loveeeeee the movie 🔥👏🏾👏🏾👏🏾👏🏾", "just_keeya": "@issarae I loved EVERY SECOND of this movie!!! It was a love story inside of a love story ❤️❤️❤️❤️. Im@going to see it again !!!", "apryllreign": "Loved the movie!!!❤️", "booshebeauty": "I’m obsessed with this movie❣️❣️", "untroubled_candi": "@issarae I saw it today, it was so good!❤️ ❤️❤️❤️🔥🔥🔥🔥I love your talent! Really brought me through the screen.😊😊😊", "dinakm_": "It was sooooooo good 😩♥️😍", "el.vile": "I’m confused anyone else see this movie and not love ?", "s.whitejr": "Good job on the movie 🙏🏾", "_mztricia_": "Great movie! I enjoyed it.", "chinadoll2cee": "Saw it!!! Love loved it! ❤️❤️❤️❤️", "jmichellejorden": "Was a great movie", "p_n_j_fitness": "Beautiful Movie! 👏🏿👏🏿👏🏿", "speak_easy_mc": "Great movie!", "london_morayo": "@moyo_akin I wanna watch this movie", "thecomplimentking": "Saluut! We need this. Trulle. Thank yus.", "mz2sweetcherri": "Loved the movie...😍", "philip_bey": "Great movie 🍾 forever will be a classic.", "mo3_beauty": "The photograph was dope and you two look really good together.", "___tamekia": "One of the best movies I’ve seen in a long time... Christina reminds me of my mom... After all these years and watching this movie I finally understand her. Great film. 💕", "raelniko25": "if he was with a white girl or he put his son in a dress they would be ALL OVER every media outlet and on everybody interview panel", "chehar": "LOVE!", "izzoyaknow": "#DopeMoive", "kendrajaliah": "The movie was beautiful. My mom and sister loved it ❤️❤️❤️", "shayd0918": "Girl y’all did the thing with this movie! It was so good 😊. Made me so happy. ❤️", "twistedkurlzz": "I enjoyed the movie very much @issarae", "thisis_taylure": "Pure 🔥🔥🔥🔥🔥", "daicallherlove": "👏🏾👏🏾👏🏾👏🏾", "mr.canty": "Loved❤️", "pride1980": "Excellent movie ‼️ left me wanting more... 😩💯💪🏾🥰💐💐💐💐", "insatiable_craving": "Amazing movie. I cried so much throughout the movie. ❤️❤️❤️", "kimmykaye_deans": "Absolutely loved this movie! B👏🏾👏🏾✊🏾✊🏾🖤🖤 @issarae @lakeithstanfield3", "desigiles": "I didn't enjoy it. Where were the Louisiana accents? The two leads weren't compatible. Isaac's house was waaay too neat for an old, single man in a Louisiana ward. His walls were perfect! The paint, the decor, all too neat and perfect for the area.", "imaclassicgirlthemovement": "Loved the movie!!!! Great chemistry!!!🔥 💯🙌🏾❤️I wanted MORE, more of the story line!!!! Music & vibe was on point!!!!👌🏾👌🏾", "ejssweets1": "Loved it #thephotograph! Y'all were🔥🔥🔥 on screen. Thank you for a love story I can relate to!🧡", "theyhateme_lol": "I LOVE THIS MOVIE SO MUCH! Thanks for bringing us a beautiful black movie! 👌🏽👌🏽💙 @issarae", "kaeto516": "Great movie!!", "unikoqui": "@chairetlee_ dacht eerst was jij 😭", "_brandii": "Beautiful movie!", "ayeveetei": "LOVED EVERY MINUTE OF IT! Question: Is the club from the film in New Orleans real? Name? 👀", "msthangtu": "♥️♥️ 🖤🖤 💚💚", "a_blues4becky": "Loved loved loved this movie @issarae ❤️", "nmontricec": "Looooved it‼‼‼", "heyitsjustkrys": "😍😍😍😍", "classy_lady35": "I saw it tonight..you look stunning in every scene!!!", "cemocafiycafemnjoli": "♥️♥️♥️♥️ Loved the movie", "myspikey": "Loved it!", "capsterdam_plutocracy": "💯🖤🔥", "ooh_shayla": "I enjoyed the movie can't wait for your next film to come out", "courtneyrose20": "Just saw it! Love you guys so much ❤️ And I’ve been a fan of you since ABG. My fave! @issarae", "kmwjrjay5": "❤️ next one", "blackgirlknitclub": "😍😍", "fredee26": "Loved it 💕", "thechocolatecouselor": "Amazing movie!! Such a different vibe!! The music was incredible!! We loved it!! 🔥😍❤️", "jennimomo22": "Thank you for this movie. 💛", "sweetnik452": "Picture Perfect 👌🏽 from beginning to end😊 everyone did a great job 🎥 🍿 🎥", "_jalisa_": "The movie was so great, I really loved it. I’m going to see it again", "_nenejaiwakanda": "❤️👑❤️👑❤️👑❤️", "iilove.smuchz": "Loved this movie!!!!👏🏾👏🏾👏🏾🙏🏾💋", "drewcilaj": "Is this your hair? What is this hair? I need this hair? I couldn’t keep my eyes off this hair! It’s so textured and soft looking! Please Share the details on this hair!😍😭", "loveforthree": "That movie was fire. I loved it. Black Love all day. You two were fantastic. 💕💕", "savantfurlow": "Yall kilt it.", "darlingnessa_": "😍😍😍😍", "qukenda": "The Photograph is definitely a must see", "alexis_glorias": "@issarae Hey! They wouldn't show it in Norway😭 hope it wouldn't take long before it is on Netflix... 🙆‍♀️", "unodeepbitch": "LOVED IT", "lamidewealth": "It was awesome.. your chemistry was off the charts @issarae", "mothopromiised": "It’s too much 🔥", "jalenton502": "BEST movie!!! #thephotograph @stellameghie", "loriah1": "Saw it. I think I need more about these wonderful characters. So much left unanswered. Netflix series??? #BlackLove ❤️", "trulysogreat": "LOVED IT!!!", "kia_lashe": "I’ve seen it twice! Such a genuine love story. I love it!!", "serenadavis70": "Oh my goodness they showed this preview after every other commercial on tv..", "plaid_daisies": "Is there a #ThePhotograph book coming out with all the pictures taken throughout the film? Definitely would purchase", "patisetwo": "💪✊💪🙏💞", "nomadfad": "YOU LOOKED TF GOODT❗️", "african_bowties": "I think half of y’all got paid to say all these nice things. The actors didn’t even have real chemistry. Wasn’t believable. Actually fell asleep for a lil bit, opened my eyes and my bf was sleeping too. The movie was ALRIGHT, but it’s not worth the hype. It could have and should have been on television and not the theaters.", "letlastyleyou": "Saw It. Ready to see it again. Well done 💕💕💕💕💕💕💕", "casandra.jpg": "10/10", "haiderahollins": "@thisweekinculture did a private showing and a Q&A after. They'll be reviewing the movie in full on their podcast so subscribe and listen! I loved the movie 💕💕", "brieannhanley": "Just watch \"The Photograph\" tonight. I loved the movie you all did a great job. Love you and your work♥️", "datboichaunce": "Great movie 🎥", "futurenurseneezy": "🙏🏽Amazing movie Issa 🔥🔥🔥🔥🔥 thank you all for showcasing black elegance", "yhamabutterfly": "❤️❤️❤️❤️❤️❤️ @issarae I loved The Photograph!!! The vibe was like nothing we have felt in a long time. I loved the playback between the mother and daughter's lives. I felt finally something real, not exaggerated or unrealistic... real relatable love stories and the the healing of generational habits. 😘👏🏽 Oh and Rel was too funny! 😂", "imalearnu": "Very well done", "toneetony": "🔥❤️👍🏽😎 #SeeThePhotograph", "uncorked_and_uncensored": "I need these two together in real life❤😄 Loved the movie!", "_chaotic_beauty": "Just seen The Photograph loved it 💙", "sophisti_kdee": "❤️❤️❤️❤️", "mstmj2u": "The movie was great and the soundtrack is 🔥🔥", "kerrip96": "❤️❤️❤️ great movie", "iplzm3": "New single HARLEY QUINN 🌹 OUT NOW LINK IN BIO🎸🔥", "dqtpye": "This movie is EVERYTHING", "akobartels": "Love the movie @issarae. It was beautiful 👍👏", "linamarielove": "🔥🔥🔥🔥👸🏾🤴🏾Loved the Movie Awesome! We need to see more of yall!", "hamp316": "My wife and I really enjoyed this film. My boy @robertglasper killed the music score!!", "blackmenoflabor": "I love our photo in the Essence Magazine", "aggiekat1920": "I love, love, love you and y'all together. The chemistry is real. Such a beautiful thing. The movie is definitely one that I will see over and over. Wish there was a book. So proud of you and what's to come. Keep grindin (my kids don't like me to say that)🤣", "nicolemcrowder": "Saw this tonight and absolutely loved it ♥️ Thank you for this beautiful film, for the story, for the beautiful portrayal of black love in so many iterations ✨✨ Will be going back (back forth and forth—couldn’t not do it ;) with even more girlfriends this week", "cynnny_cyn": "Absolutely loved it!", "buymechanel": "Loved it!!♥️", "netramichelle": "It was such a beautiful movie♥️ I want y’all to be together in real life🤷🏽‍♀️🤩🥰", "story.tellher": "❤️", "monaawisaa": "I loved the movie...", "tj_smoov": "Just saw the movie last night. I'm blown away! What an artistic expression of love, 💙 time, 🕰and music 🎶🎵 This movie is a classic and one that will be played for decades. To see this kind of story being told and this kind of beauty being displayed on the big screen was nothing short of incredible. Thank you for giving us art. Go #seethephotograph", "_zubechi": "You guys again", "hdotannah": "This movie was absolutely incredible ❤️", "laurendevin": "Saw the movie today!! Just as amazing as I knew it would be. Probably going to see it again!", "blessed_kryst": "This movie was amazing! ❤️❤️", "stunnadave213": "Movie was trash. 🗑", "lolapineapple89": "@issarae your movie had me in tears 😭 I loved it", "jzaudi_22": "Loved the movie!❤️❤️", "the_qc_gentleman": "@issarae great movie!!!!", "_rasirjohnson": "✊🏾", "itsanewj": "@issarae Loved you in the movie. Thank you 🖤", "manhattansis09": "He’s so sexy 🤗🤗🤗🤗🤗", "_denishalm": "Loved it 💕", "gdot757": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "mona_lyssa30": "I want to sincerely thank you for a wonderful and beautiful movie for our black love culture we so desperately need it. I have been on cloud 9 since. I really enjoy your work and very much proud of you. Thank you! Thank you! Thank you! ❤️❤️❤️", "remymapromoteam": "🔥", "loganadams2993": "This reminds me of the Queen and Slim pose", "karenlaw101": "I loved the movie 💞", "love_temp": "The movie is so 🔥🔥🔥. I definitely plan to see it again! ❤️ #blacklove #lovealwayswins", "b.onamission": "@issarae, you gonna do a q&a on this movie???", "psychomotor_": "#goals", "kaeroshon": "Love it, I cried in my hoodie 😩", "accentgardening": "Hey @issarae @lakeithstanfield3 @stellameghie will give you movie review after I ck it out ⚘⚘⚘", "blessedjw": "Went to see it two times loved it gave me major love jones vibes😍", "alicia048": "This film was soooo good. I went through all the emotions ♥️♥️♥️ @taooftito", "theveganbourne": "Best love story since Love Jones. I was so moved, I teared up. Bravo", "smack1003": "The Photograph was a beautiful movie 💜 Loved every minute.", "tdaniellep": "Now Issa...you know you are wrong for not wrapping up your hair in those bed scenes. ❤️ The movie!!", "grandmommaneek": "LOVED IT! ❤️❤️👏🏽👏🏽", "ladiviv": "Excellent movie! Great chemistry! Hubby and I loved it. Gave a Mobetta Blues feel. Yessss @issarae .💪🏽💪🏽", "sandsdaniel4": "This is the first blak movie with no conflict,plus still ends with a happy ending.", "oh_thats_kee": "I love the movie😍", "johnlewisdawkinsii": "L O V E #oneofthebestlovemovies", "aviah_adaora": "Sis I'm so glad u didnt take that bait joy dished out about that Chris rock movie", "queenlavyc": "An amazing movie! Much needed for our day and time! ❤️", "starrskigh": "I loved it!💕 xo", "erikacerese": "I saw the film last night, it was all that I knew it was going to be😊. You guys did a great job!!! I Absolutely love the movie and the music all throughout was spot-on. There's so much more I can say about the film but I don't want this to turn into a dissertation lol. just know I Loved it and can't wait to see more from @stellameghie , you and other amazing black artists/actors that keep us in a positive intelligent light. Thank you😘✊😊🤗✌", "hasna_t90_28": "@issarae went to see the #photograph and it was good! Thank you we need more black love on screen!!! ❤️😍😘", "cle_believeland": "Just saw it! Loovveeddd it. My eyes are all red and puffy from crying.. ❤️❤️", "jozeiy": "I live in Paris, where can I see it?? 😭😭 I've been waiting 😍", "blaire4ever": "Everything! 🙌🏽", "tiggz_star": "❤❤", "thesimoneeliseevents": "LOVED the movie!!! 🔥🔥🔥", "woodruff82": "Saw it last night. Amazing!", "yolandarichemond_": "The ending was bad . I wanted more 💘", "the.vivacious.vixen": "I saw this last night and it gave me Inkwell/Love Jones vibes. You looked so pretty, and the soundtrack is dope. 🔥🔥", "langevinetres": "LOVED. Just pure perfection.", "thetinalouise": "This movie was more than I deserved. Loved every second. Storyline, casting, artwork, music, lighting, Kendrick v Drake, and chemistry!❤️❤️❤️❤️❤️❤️", "jennyrod19": "My hubby and I really enjoyed the movie. I think he has a crush on you now 😂", "natasharollerson": "The Photograph: I’m so sad to see all of the harsh criticism directed at this movie. I loved it! You know why? Because it was a normal story that could have been plucked from the everyday life of any African American household. It wasn’t about slavery, drugs, gangs, being a player, or stealing. I understand why those genres are entertaining. But, the World needs to see us just being US. Sadly, black lives need to be normalized. We need to be depicted as In love, successful, driven, positive AND HAPPY! I loved the complexity of the characters. Thank you for this unicorn of a film. 👏🏽👏🏽 @issarae", "bitter_sweet_fiery1": "I loved this movie and I'm going to go see it again. 💖💖💖", "monbkv": "Ma’am while watching the movie, I kept thinking of how stunning you are!!", "unlvangel": "Loved it! Watched on the 13th for Galentines Day!", "allierouss": "🙌🏼", "jbeee___": "Can anyone tell me the name of the bar they went to in New Orleans?", "briyoncebish": "so much prideeee. thanks for creating this space ✨😍", "mzscorpiostar": "Whyyyy was the sex scene NOT good! WE WERE ROOTING FOR YOU 😩😭", "mrs_ljohnson21": "Loved the movie!!", "simply_tlo": "😍😍😍", "mdawnfloral": "Such a great movie!!! I really enjoyed it. It's the 2020 Love Jones!", "__itsdriaa": "I loved the movie so much but I also got really sad afterwards thinking like damn “if only this could really happen if this was my reality”. Great movie thank you 🙏🏽👏🏾 @issarae", "moniexox": "My husband and I went on Valentine’s Day it was so good to see black love represented 💕🙌🏾", "minister_michelle1": "The movie was amazing!!!! You all were fabulous!!!! I luved it!!!! 😇😇😇😇😇😇", "kiki.mo83": "I loved the movie!", "gotustarstruck": "The movie was everything 🙌🏽", "3cool": "Great movie. 🙌🏾", "black_tyde": "This movie is amazing ⭐️⭐️⭐️⭐️⭐️", "nelboogie81": "Epic movie, The moment he saw you again in London, his reaction, PRICELESS 😩 , that hit me in my soul REAL TALK!!!!", "wingedone1111": "Saw it last night. So beautiful and necessary.", "legaljazz87": "Love this movie", "kreativelye": "Seen it...LOVED IT!!!🙌🏾", "vida_w124": "Loved this movie!!!", "itsdhenagain": "Beautiful movie...", "jaflygirl": "Watched it loved it👊🏽👊🏽👊🏽👏🏽👏🏽👏🏽👏🏽💜", "chasanblac": "Such a beautiful movie ❤️❤️❤️", "lady.nanice6": "Y’all did that💞", "adriennedwp": "❤️❤️❤️I loved it!❤️❤️❤️", "southern_butter_pecan": "@issarae @lakeithstanfield3 ...The fact that they showed a BLACK man being vulnerably in love!? 😍😍😍 The way he looked at her! His reactions in the end! I was just in awe of this movie! Also, I love the fact that there was no real traumatic plot. All black love stories aren’t sad or stem from a terrible past. Sometimes it’s just simple and beautiful. 🤎🤎🤎 Not super sexualized. No black woman with an attitude and cheating insecurities. Just showing that its okay to ask questions. There’s just so much GOOD that I can point out about this movie! 😩😩😩😩 I digress! Thank you for doing this!!! This was lit!", "glowree82": "This is a Beautiful movie! Loved it. Will see it Again!😍😍😍", "meshawn1974": "THANK YOU FOR #MAE &#MICHAEL💙", "kismet829": "I enjoyed the movie", "gracious4sure": "Why don’t you guys just get married?", "mahoganyhanks": "I absolutely loved this film!!!! You all did amazing. Thank you for sharing a beautiful, healthy, black love story with the world. My new favorite romantic film 💕", "kemperpope": "🔥🔥🔥", "sincerely_jessi": "You are perfection @issarae ✨this movie was EVERYTHING & MORE✨✨✨", "visuay": "Thank you for the journey and the lessons beyond just relationship love. Enjoyed the work. Rooting for you at the box office opening weekend. Bless", "keithdrudolph": "Watched Friday, considering watching again today 👏", "divalo67": "Loved it❤️! I want you two to be in love for real.", "xoxo_jesslampkin": "The Photograph was amazing! I loved every minute of it!", "brandi_ontherocks": "Loved it! 🙌🏾", "imgodcreation": "I so hyped to see this movie", "stylesbyimanid": "Such a good movie enjoyed every bit of it", "nikerbell": "🔥❤️", "p.entle": "@boittty", "youngsinick\nVerified": "Verified", "1finezeta": "@issarae The Photograph was 🔥❤️🔥", "lovejones328": "LOVED the movie!!!😍😍😍", "sierracollinsphotography": "I absolutely lovveeeddd it! I want to see it again!", "officiallyme_cecemarie": "I loved it! 😍❤🔥", "mrstdwilson": "It’s so good!! I left wanting to know more and see more of the relationship. My husband even enjoyed it. He stayed awake the entire movie. 👏🏾👏🏾👏🏾 oh and the soundtrack 🔥🔥", "shameca.kelley": "I dug the movie!", "evapearl1": "The movie was ANAZING!!", "luv2hate_ash": "Not only was the movie awesome but you were as well! Thank you for being you, for being amazing, for being a role model to our little black girls, for being a role model us for black women! When I look at you I see myself. You are making us proud❤️", "deelo_s.o.a": "Great movie ! 🔥", "_immensebeauty": "Such an amazinggggg movie! ❤️", "loves2laughkimberly": "Such a great movie! Loved it!!❤️❤️", "sir_curli": "Just saw this. 👏🏾👏🏾👏🏾 Not even trying to suck up but you guys were amazing and YOU ARE EXTREMELY BEAUTIFUL Ms @issarae", "the_joshua_johnson": "#power", "tico_dasickest": "Did isaac divorce angela or did she die?the movie never said @issarae", "ddjohnson34": "Valentine’s Day Pt. 2...my husband and I saw The Photograph tonight & LOVED it!!!!!", "214_the_lover": "Movie was🔥🔥🔥", "14_t0dd": "Awesome movie you guys had great chemistry", "andtherewasbeauty": "Saw it yesterday! Repeating this week. LOVED IT! @issarae @lakeithstanfield3 #thephotograph #loveit #love #blacklove #mylove #myloves", "mzteesha": "Just seen this movie tonight and I LOVED IT!!!!! My Girl did her thing!❤️❤️❤️❤️", "love.light.laughter.rainbows": "❤️❤️❤️❤️", "pvilles": "❤️❤️❤️", "procstar301": "Very good movie 👍🏽", "nataliemacklin": "Going AGAIN tomorrow.....whole different set ❤️❤️❤️❤️❤️", "monichi08": "I just saw it last night with a friend .. OMG! 🙌🏽 Loved it .... the new Love Jones, Black Renaissance coming back! 👏🏽👏🏽👏🏽👏🏽 To cast, crew, producers etc.", "joann_richmond": "Loved it!", "hortonati": "\"You eat boiled crab?\" 😅😌", "uniquelyreese": "💯", "6sdoh3": "Met all my expectations!", "shes_pretty_amaz0n": "Loved it !!❤️", "dezree_quest": "I love you both so much😍❤️❤️❤️❤️", "nobodyjonesboutique": "😍😍😍", "ritchell_ritchie": "Saw it Friday 😍", "ms_pridge84": "😍", "featuringkiara": "AYYE OL DUDE FINALLY GOT OUT", "rubywag": "Beautiful JOB!! WELL Donor, like a New LoveJones...Please reach out to me as I'd LOVE to collaborate with YOU! 614 824 8125", "mzdrsdlee": "Ummm did yall buy out Del Amo AMC cuz its sold out!?!?!?!?", "alonam14": "Excellent movie I enjoyed it", "mishikoulenn": "LOVED IT!! ♥️ Watched this lovely film at IPIC Pasadena. It was the perfect Valentine Day date movie. 🌹 🌹🌹", "authentically_tish": "The movie was awesome💜💜", "ladiequeenpisces": "Ok @issarae i love The Photograph", "teemareedotcom": "I did yesterday @issarae loved it. What a wonderfully different way to tell a love story and the soundtrack was fire too ♥️", "benmbuli": "🔥👌🏿👏🏿", "angellarosemariebernard": "Saw Your Movie Last Night ❤️ It", "prestonpartyof4": "It was phenomenal!", "johbella": "Beautiful🙌🙌🙌🙌❤️❤️❤️", "dreambig00712": "🔥🔥🔥🔥", "tysie33": "The movie was so dope great job as always @issarae 👏👏👏", "soulntuition": "Imma go see it!!", "ktrishawn": "Wonderful movie, Loved it!!🙌😍♥️🔥", "cgwindomnorman": "I saw it i saw it geez", "sensational.bnicole": "Job well done. Loved the film. You are beautiful and look like the gorgeous @lisaleslie 😘😘😘", "1browndee": "❤️❤️❤️ the movie. It was a real conversation topic with my bestie.", "_i.ntrovert": "I didn’t get to see it Friday 😭😭😭 breaks my heart 💔 but mark my words I will see it this week.... or whenever I do!", "chrissy.olivia": "What a beautiful movie🥰", "therealsaniyah_": "it made you really realize a lot of things in relationships. Trying to commit. Love. Seek another ones attention, time,effort, dignity.... It was just a lot to take away from that movie and one thing I could relate to was when he told her he was leaving to london and she didn't know how to tell him how she truly felt but when they went to the concert and she was explaining to him that her love lies for him whenever his feet land. Love doesn't just leave because sometimes we may have to leave from each other but that doesn't mean call it quits. Bring back that old love, when u ask your grandparents how long they have been together and they say 30+ years. Through all them years they been thru hell and back but what thing that didn't break them nor take them away was The LOVE they had amongst each other.", "_britneymoore": "Just finished watching, I loved it! And the music as well 🥰", "majorj24": "Just saw the photograph and love love love it Great love movie", "iamninasimone": "This movie was everything ❤️❤️❤️❤️❤️", "justsoq228": "Just saw it tonight at the Theater!! Great to see black love!", "chocolako": "Awesome movie. Loved it ❤️", "halima_huss": "One of the sweetest movies I’ve seen in a long time. Timeless 🙌🏾", "jjenos": "Goodness", "kemmmiii": "This movie was IT", "goldiewollman": "Loved. Every. Second. 🙌🏾✨", "modestitgirl": "It’s was amazing. I’m happy he took the time out to take me to see it", "setoe1908": "Went last night great movie ❤️", "mrschantellef": "I need this soundtrack on vinyl PLEASE 🙌🏽😍❤️✨", "sheresenw": "❤️❤️❤️", "socialbutterflierfly": "😍😍", "qbqt85": "I just saw it and thought it was absolutely beautiful 💕👏🏾👏🏾", "bnmlove25": "Yes I'm ready fr this movie", "carameleclair": "Loved it ❤️", "thecandacealvarez": "Saw it today! So good 🙌🏾", "cmjamerson": "I loved The Photograph. It was beautiful and real on so many levels.", "msblackloveblack": "Seen the movie last night it was good!!!", "geegee.jenkins": "This movie is \"THE BOMB\". This is a must see. Great job.❤️❤️❤️❤️❤️❤️❤️❤️👏👏👏👏👏👏", "funbarbie007": "I really fell in love with this film...Cant wait to buy it for my collection❤️", "eph.see": "I JUST DID AND I LOVED IT. CONTINUE TO NORMALIZE BLACK ROMANCE FILMS THAT ARENT CENTERED AROUND TRAUMA 🖤🖤🖤", "jayrice83": "At least you're with a black man in this one.....", "valerieerobles": "It was so good! 👏🏽", "the_dre_bradley": "@issarae you are BAE", "super_woman001": "Great movie!", "mahogany_soul88": "My Lordt!!! That movie was everything!", "serious_progress": "I need to see that movie...💖", "selanalavonne": "Just saw it. Really good and teen friendly😍. Quite a necessary narrative on the cinema landscape. #blackromance💕💯😍👏🔥", "blessed_designs_by_tj": "saw it last night!! Loved it‼️‼️‼️", "donmershay": "This movie was everything!", "love1only01": "Amazing movie 👏🏾👏🏾👏🏾👏🏾", "mscr08": "@issarae I seen it and loved it!!", "hone_aw_nee": "😍", "veals504": "Great movie! Parallels so may women.🤎", "geekgirl1022": "We loved your movie!! Great date night movie with my hubby. Thank you!!❤️", "angiebwillis": "Just saw it and I don’t think it’s overselling it to say... IT IS THE BEST LOVE STORY SINCE LOVE JONES⭐️⭐️⭐️⭐️⭐️. Haven’t seen that many beautiful brown people in one movie in... well... EVER. Kudos to you and LaKeith. 👍🏾", "raenelldionne": "I saw the movie. 👏🏾👏🏾❤️ loved it.", "anthonyallioo": "Was a dope movie proud of y’all but.....what’s good with Insecure and Atlanta?", "auntieshaunda": "You two were brilliantly PERFECT in this movie❤️❤️❤️ Hands down now #1 on my favorite movie of all times😘", "b.r.a.y._": "Well yall ultimately did that! YOU!👏🏿👏🏿👏🏿✨✨✨✨", "badubasics": "It was magnetic 💫", "tofi_14": "Sooooo goooood❤️❤️😍😍😍🔥", "qu33n_jellybean": "IT WAS SOOO GOOD ‼️ Going to see it again❤️❤️❤️", "flair_style": "Great Valentines Day date. Really enjoyed the movie. Fantastic job showing real love and all the complexities that come along with it.", "passions2612": "I just finished watching this movie 🎥 its awesome 👏🏾. It was sold out yesterday so me and my boo saw it tonight.", "foreverfrugal2": "Just beautiful", "tia__b": "Loved it Issa!", "jamiya_isaiah": "❤️it!!!!!!", "a_j_jenkins": "Great Movie ❤️", "rabsonmbunda": "I have lost so many times, but I always wondered where are these people saying they invested just like me always earn. The day I knew a real Manager still existed was when a friend of mine directed me to this great and honest Manager Mr Dlamini... He is really a God sent to me, so I promised him to share his good work and honest services to the world. you can contact him now @fx_henry_dc", "sweetredbone": "I freakin loved the movie, totally going back to see it again!!", "belle_femme__bouclee": "Absolutely loved. It’s an instant classic", "the1socialite": "Phenomenal job!!! Such a great story, great acting!!! We need more films like this (cc: @stellameghie @willpowerpacker ) 🙌🏾🙌🏾🙌🏾", "kgbethlehem": "I love this fucking pic!", "msdnicole": "LOVED IT!!!", "eyeleanonjesus": "❤️🔥🙌🏾", "amandamc94": "Would love to see you in a remake of Pretty Woman @issarae (with an urban flare)! along side @idriselba 🙌🏽", "victoriashari": "Had so many questions.... Was his ex girlfriend Mae's half sister??? I need a sequel and prequel. #AdoredIt #Classic", "worldwiderae": "MOVIE OF THE YEAR NOMINEE ❗️#WeDontLieJustToSocialClimb", "carita_yvonne": "Great movie 🎥 ready on part 2 🤞🏾", "annejoldersma": "💕💕💕", "chellzmb": "Y’all fine", "quinn_nicee": "Very good movie. Watched it yesterday on valentines days on a date", "shanaashlee": "Soooooooooo loved it.", "esanel": "Loved it!!! ❤️ 👑🙌🏽 @issarae", "ms_dhc": "This was such a beautiful movie!", "lov3r0f_me_lanin": "You were glooowwing the entire movie!!! Loved it 😍 loved y’all 👏🏾🔥", "braids_by_deeeee": "LOVED it!! 🔥🔥❤️", "cubantrueblood": "Love it!👏👏👏👏👏wao wao wao❤️👏👏👏👏👏AMAZING MOVIE ❤️", "igobycourtney": "This movie was ALL the feels!", "meshawnfreemanfoster": "@issarae the movie was a beautiful juxtaposition of two stories melding into one. Excellent acting, cinematography, and soundtrack! ❤️", "tkburwell": "Great movie", "traesure": "I saw it yesterday and I really enjoyed it.", "ninaplusdylans_mommyfox": "It was amazing!!! So well acted!", "brownize11": "LOVED IT!! ❤️❤️ beautiful love story @issarae", "hazdej": "Omy goodness 👍 I REALLY enjoyed your movie 💯💯💯 PHOTOGRAPH was a real love story and you 2 were 🔥🔥🔥 on screen 🤭😍🤭", "ted.hargrove": "Amazing movie. Love @issarae + @lakeithstanfield3", "cindypooh10": "Loved the movie!!!!", "mrspennybags01": "Nice movie", "miss.dominique_": "Loved it ❤️", "simone.b__": "Saw it ! Loved it ! ❤️", "diamondinrough_": "Loved the movie!!", "the_wife_of_an_angel": "You are stunning 💕❤️", "timmibutterfly": "And exec producer credit also goes to...👏🏽👏🏽", "_jtruth_": "Cant wait. I’m a big supporter of both you and @lakeithstanfield3", "carmelleggz": "Thank you for a movie my daughters could go to 💜💜", "tfabulous13": "When you going to host @nbcsnl ?", "imakingskid15": "Seen it and it was goood", "lynettesonnier": "💜", "bipolarrud3bytch": "Movie was AMAZING!🙌🏾❤️", "b00kofsamuel": "So beautiful to watch, and a such a relevant message for me", "dimari_77": "Can’t wait to see this! You two look so gorgeous together. ❤️", "warrior_soleshealer": "AMAZING, BEAUTIFUL, INSPIRATIONAL work. Thank you for all you brought to the screen for our hearts to embrace and our souls to be touch. Thank you for sharing your gifts. WELL DONE. @stellameghie @issarae @lakeithstanfield3", "stavon48": "I like your style I like your show I'm Proud of you keep doing what you do", "danilott1022": "Everyone did an amazing job!!! ❤️ The film was beautifully written, directed, shot, acted & edited. Thank you sis. This was needed.", "jayworld1015": "Omg such a great movie @issarae ❤ I cried like 3x", "mesheeka": "Loved it!", "66tnette": "I just came from seeing the movie, I love black love 💯❤👏", "shannonhart1978": "Tomorrow sis!!!!", "godsworld1": "Love the movie 🔥❤️🔥❤️🔥❤️", "makings.of.malisa": "Such a great film ❤️", "bussssie": "❤️❤️❤️❤️", "benvon7": "❤️ it", "meshaun76": "❤️❤️❤️❤️❤️❤️❤️❤️", "jalincosey": "You are so gorgeous😍😍", "rini_tin_tin": "Phenomenal!! And you have the best teeth!! Love it♥️", "tondbruce": "Thanks for making me laugh, cry, reflect and everything, Iss! ❤️😍❤️ Movie was 🔥🔥🔥🔥", "gianna_manjardiii": "Soooooo good. Y’all killed it!! 💜✨ Magic", "nmartin1470": "❤️❤️❤️ watched it today! The music, the dialogue, the story was fantastic and most importantly the chemistry was 🔥🔥🔥", "reeseecup01": "Loved it! I teared up at least 4 time...ok I cried damn it!!", "ptothelar": "❤️❤️❤️", "miss_fentay": "I loved it! Going to see it again!", "lois__lame": "This was soooooo Good Issa ⭐⭐⭐⭐⭐", "speaking7s": "Movie was GREAT! Proud to be BLACK! Thank you for this work of art👏🏾", "pinkypearl08rn": "Great movie!! 👏🏾👏🏾🔥", "seesmittyrun": "Dope ass movie!", "thekayshavonproject": "👏🏾👏🏾👏🏾👏🏾👏🏾", "jazzlee97": "🔥🔥🔥🔥", "krlywa": "Wonderful movie!!!!❤️", "nnmanning40": "Truly Enjoyed it! Good to see Black Love on the Big Screen 🖤 #LoveWins", "mzedotsoul_": "This movie was everything ❤️❤️❤️", "alethiamjackson": "It was such a beautifully told story❤️❤️❤️", "tatiannamott": "I thoroughly enjoyed it! Nice and simple and relatable ❤️", "rosewriter62": "My 2 faves❤️❤️", "freddiefred1914": "Great Movie", "sheebieshack82": "Beautiful outfit", "ginacoconato": "I cannot wait to see this movie!!!!! 👏🏽👏🏽👏🏽👏🏽💕💕💕💕", "j_stephon": "Great movie", "_.bigspeaker": "Great movie! Love music with movie!", "niktoopretty": "Such a great movie!!! I wanna see it again and again!!!!", "melisatorrence": "Love The Photograph❣️❣️📷", "shaquellak": "🙌", "fe773": "This movie was so good 👏🏽👏🏽👏🏽", "mssljackson": "This movie! Perfection!!! 🙌🏾❤️ Thank u!!! 😍😍😍", "kenglamyada": "Loved 💗 the movie... we needed this kind of black love movie", "intelligentlybeautiful": "It was amazing! A MUST see! Love to see a cast that looks just like me! ❤️🙌🏾", "bossgurl_nijah": "It was AMAZING!!!!!❤️❤️!!!", "fabvargas_": "👏🏽👏🏽👏🏽👏🏽👏🏽", "jcandykisses": "Love it!❤️❤️❤️❤️", "unsungh3r0_": "Tremendous work as usual!!!", "headnurseincharge1908": "The movie was awesome!!!", "misspozo2": "Loved this movie !!!", "bianca_octavia": "The movie was beautiful 🥺", "taleof2cities": "🙌🏾 You two did that!", "curious_s0ul": "I lovedddd the movie so much... I was really into the movie and then I would get sidetrack at how beautiful your hair looked on you. 😍😍😍😍😍", "musasquandary": "😍😍😍😍", "michelleigomez": "It was fucking amazing to see you in the role of a curator at the Gugg 😭😍", "gloperrydmd": "Loved the movie ❤️", "soprano_mo": "@issarae It was a beautiful film! I love you so much 😭❤️", "lovehopefaith32": "Omg that movie was soooo good", "cjbjhart": "The movie was sooooo good!", "renaissance_mom_nd_wife": "This honestly is my new favorite love story! I think it surpasses love and basketball", "shakira307__": "You so funny 😆 i loves it", "gsquared1031": "Such a beautiful movie!!", "tamarasmiles": "It was so good", "mrs.musselman": "🔥", "atoyagarner": "That movie!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽😍😍😍😍😍😍👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "overjet78": "“Just so you know, there are people who don’t procreate with just white people.”....yeah, no shit, racist bitch", "miss.kjasper": "I’ve seen it twice so far. 😩", "car1914bear": "Cant wait going tonight.", "elms_and_arms": "Just saw this and I have to say, Amazing Job!!! This was such a beautiful movie. As someone who is still dealing with my mothers death it definitely hit a personal note. Thank you for making a normal movie about black people and the lives we live.", "dyme_hayes": "I seen the movie yesterday I loved it made me cry a couple of times ❤️❤️❤️", "pr3ttyeyez_21": "Excellent movie!!!", "maimoxi": "This was so good 🥰🖤🖤🖤", "of_the_soul_": "Seen it yesterday! It was a whole vibe that movie ❤️👍🏽💪🏽", "keoblk": "Thank you for such a beautiful love experience!", "she_melodic": "Dat bouch tho!", "chantai1": "This movie was AWESOME.....I loved it ❤️❤️", "natalie_larose2": "❤️❤️", "brianbronski": "Just watched it this afternoon and loved it.", "deebee203": "This movie is incredible!!! My new \"LOVE JONES\"❤️", "ms.ros_yk": "Just saw it...absolutely loved it! ❤️", "missbutterfly24": "This movie was EVERYTHING!!! We so needed a black love story..like some real & tangible that we can truly relate to! We don't get them enough....this movie gave me ALL the feels! Love love loved it! Thank you @issarae & @lakeithstanfield3 💜💜💜💜💜💜💜💜💜💜💜💜💜", "tarajiphenson\nVerified": "Verified", "lionness_c": "Such a great film! I loved it!💕❤️🔥 @issarae @lakeithstanfield3", "svepps": "It was so good. Saw it last night ❤️", "ib__fly": "LOVED IT, I wanna go see it again already", "strypezlcmg": "Tough Movie 🔥🔥🔥🔥", "demegates": "My husband and I just went to see Photography and we both loved it. He's not at all into romance or love films but was enthralled by the acting, soundtrack and art. @issarae PLEASE let me know who the artists are of the pics in your apartment in the film. They're beautiful works!", "twylajackson7": "❤️Issa 🙌🏽", "andreabspencer3": "You will not be disappointed! #thephotograph ❤️", "nurse_niish": "I love this movie 😩🙌🏻", "teamblacklifestyle": "Great movie! Vulnerability and communication!!", "jacquigwilliams": "Loved it! 👏🏾👏🏾👏🏾", "itsnatbitxh": "bae you look good asfff 😻😻😻😻😻😻", "phl918": "❤️this movie! Great job! @issarae @stellameghie", "sondra_withano": "Saw it... loved it🔥💕🔥💕", "suthernhoney": "🎩 off 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 #blackromcom", "allofmebea": "🖤🖤🖤", "sbthegr8t": "An awesome story. Killer soundtrack", "queharris_": "🖤", "_smokeyeyeassassin": "Loved it!❤❤❤", "tri_tri31": "🔥💓🔥💓🔥💓🔥🖤🖤", "kivonshe": "I really need to dissect this film w someone who knows film and studies nonverbals. The pure awkwardness, the questions behind the looks in the eyes, the unspoken fears, the body language. This movie showed how dates really transpire. How we can connect so hard w someone it’s scary but we can’t let go but scared to take it a step forward.....UUUGGHHHH SOOOOO BEAUTIFUL!!!!!", "haitianspartan": "Yes sis this movie was everything!! Thank you for this beautiful portrayal of black love ❤️❤️❤️", "mo_scorpion": "🙌🏾💯🔥❤️❤️Loved it.......cant stop talking about it just nice simple Love ....", "giftedhands47": "Great Job y'all I absolutely loved the movie. It makes me now want to find Love", "tootsie_lil_diva": "❤️🤗", "debose41": "Movie was dope🔥✊🏾👏🏿", "natgotphat82": "@algae_713 -- LaKeith is SO HANDSOME 😍", "darling.dionne": "I loved everything moment of this movie ♥️", "ttcage": "My husband and I loved the movie! It was beautiful!💜", "itsmeakeem": "Wonderful movie!!! Loved it", "toyanherdamnego": "THIS MOVIE WAS PHENOMENAL 👏🏾👏🏾👏🏾👏🏾👏🏾 the story... the music... the acting... just amazing", "5j_mommy": "❤️ The movie!!", "thischicks_story": "@issarae @lakeithstanfield3 phenomenal movie😍", "sasha_belle_vue_esq": "Great film, well done 👏🏾! Want to see it again", "the_kenyadanielle": "Saw it yesterday 💕💕💕", "cindersmagazine": "❤️❤️❤️❤️", "ashleymarienn": "@triniana__ we loved it!", "sweet2bchocolate": "My two favorite people and my best friends in my head...❤️", "blackaboutitqueeraboutit": "Just left the movie with my girl. This was so beautiful. Beautiful black people, beautiful music, beautiful scenery and beautiful story. Be proud!! Well worth the one year wait for Insecure 😂❤️✊🏾", "luvnunn3": "I absolutely ❤️❤️❤️ everything about this 🎞 from the chemistry of you 👫🏾 to the comedy and the Vulnerability. A true work of art🔥🔥🔥🙏. Thank You for this piece.", "veethegreat5": "❤️🔥❤️🔥❤️🔥❤️🔥❤️ Still in my feels, loved it", "tylerdixonross": "The Photograph was such beautiful portrayal of love. So amazing.", "divine_ariyana_goddess": "Saw it yesterday @issarae going back to see it again Monday ❤🔥😩💫👏🏽", "loso_johnson": "Loved it", "rosalindwortham": "Can’t wait to see your movie 🍿 ❣️", "just.julius_": "This movie!!!!! #EVERYTHING 🖤🙌🏽", "brown_diva81": "Phenomenal❤️🔥👍😍", "rikkishacandler": "Saw it last night. Loved it!!", "begietancollection": "Loved it!!", "ayoempowersyou": "❤️❤️❤️ Movie was great!", "stacyarnold916": "The Photograph was so beautiful, deep, layered, and thought provoking. I loved it! Thank you.❤️", "omazing_o": "Photograph is the best love story on film I’ve seen since Love Jones. From the story line, casting, and how it was directed. I love it all. Great work."}