{"the_meggo_": "I’ve been going through exactly the same. Thank you for being so open about your experiences 💚⭐️", "sassyblue748": "PS I love that you are about way more than fashion and makeup..you talk about quality of life matters too. Thank you for everything!", "caddyizzle": "This speaks to me so much! I held off on getting checked for sleep apnea because it has so much fat stigma to it because I kept telling myself I have to be a fat person with no health problems in order to be valid and worthy. I finally got checked and they told me that I truly could've been someone who died in their sleep because my numbers were incredibly high. Your openness has helped me so much on my own journey of self-love.", "ellathecupcakequeen": "I love that outfit!! Where did you get it?? 😍", "tinyhumanhouse": "I'm afraid that weight loss will be suggested for my foot problem so I've just been suffering with it for the last few months. I am afraid it will trigger me into a hole I've worked hard to stay out of. I haven't had any good doctor experiences, so it always seems better not to bother. I hope your visit gave you what you needed and that you're feeling better now/soon.", "bonnie.m.f": "🙌 I am claiming my wellness, starting yesterday, no matter what that needs to look like. I am Dr and fat phobic as well. With probable body dysmorphia. I guess i will find out 🤷‍♀️ but it took a serious scare to make me step forward. I will continue. And I am thankful for voices like yours 😍💕💗 wishing you all the wellness 🙌", "kim.rose19": "🌹🌹🌹🌹🌹🌹🌹❤️❤️❤️❤️ I have gone through this everyday,God Bless both of you.", "katewarters": "So grateful you posted this today. I needed to hear it badly! I had knee surgery last week and recovery is hard. The rehab exercises make me feel so weak and incapable. Even moving my body around or up and down stairs on crutches is tiring and uncomfortable. And when it feels hard, I am inclined to be angry at myself, to tell myself I deserve the pain and challenge, and to see it as my penance for being fat. But you are right. That’s just my own internalized fatphobia. This may be hard, but my body can do the hard work and I deserve to let myself be positive and encouraging as I heal. Best wishes to you and your continued journey to well being. Thank you!", "kelseybearbaby": "I literally just did this. I got chronically ill for 2 months before my boyfriend finally made me go. The first doc. A damn bitch dismissed me completely. Saw me for 30secs before weight loss surgery/pills came out her mouth. And when I said I don’t want to talk about that. I’m not interested. I was rude for getting an attitude because she CONTINUED to push me to talk about it. She had the audacity to say. Sweetie don’t get an attitude about it. Took me 2 more docs before I FINALLY found treatment that worked.", "ellytheknight": "I'm so glad you were able to work through the negative self-talk. I know it can be rough.", "singingbron": "Thank you so much for your post and for your vulnerability in putting this out into the world. I've spent years avoiding doctors for fear of being told to \"just lose weight\". At the start of this year when I had some blood tests done, I was genuinely terrified I'd find out that I was diabetic because I'd spent so long not taking proper care of myself. When it turned out I WASN'T diabetic I realised that the reason I thought I would be was because I believed I deserved it, that it would be the fitting punishment for the \"crime\" of being in a body my size. I was so sad to discover that I'd been thinking that way about my body, so this year has been a process of ACTUALLY looking after myself instead. Now I have an amazing HAES-supportive doctor, dietitian and therapist, as well as a pretty awesome dentist, ob/gyn and optometrist... all the health providers, lol! I think of them as Team Bron - I know they're all on my side and helping me be the healthiest version of me in the body I have, not the body that diet culture wants me to have. P.S. Your yoga mat is pretty! (And so are you!) <3 :)", "randallsixx13": "Self acceptance in these cases is suicide.", "awgir": "Damn that soo impressive and positive. U give me some hope for better days 💕", "victorialoses100": "This happened to me too. I was so in denial of needing desperate help with my pain and thought they would just tell me to lose weight. She did nothing of the sort and it turned out my back was fractured and my spine was losing its curve. I hope you never have to go through this again! Tell that voice to shut up.", "roccolococo": "Hello sweetie I think you look very sweet to me are you single honey 🌹", "rezq481": "I am thirty-six years old because of my size I have not been able to get married", "theinbetweenqueen": "This helped me with the fatphobic shit my mom’s been saying to (I think purposely) engage my ED lately. Thank you always ❤️", "slimcitymarie": "I am so proud that you pushed past your fear and seeked help... you are worthy!!! 💜💜💜💜", "lornafolan81": "My doc contacted me after taking my bloods saying my numbers are way too high as opposed to some years ago. but some years ago I was restricting like mad...I'm kind of at a crossroads as I fear illness but also obsession and restriction...I don't want to go back", "mrsinghcouldnotcareless": "You do realize ur not this size eating any less than 7000 calories per day. It's ok to be in trouble and ask for help but to call normal self intervention shame is not appropriate. I would call u stupid but ur not. I mean u did figure it out early how representing urself as a savior for fat people u could earn all the money without any actual work. 7000 to 8000 calories per day? How is that normal?", "duffneyryan": "💥 Adorable, confidence ⚠️", "jose.miguel.rojas": "💙", "copykat93": "@everydamndayfitness would love to hear your take on this", "moodydudey": "Body positivity is tough. Coming to acceptance of self is a constant challenge regardless of weight. I recently lost 100 lbs for health reasons (familial stroke risk, borderline diabetes, unpredictable high BP, sleep apnea, autoimmune disease compounded by extra weight, to name a few). I fought listening to my doctors. My husband loves & accepts my body at whatever size. I had to come to a place of peace to decide I wanted to live the longest life possible. I’ve been really small, really big & everywhere in between and I’ve never loved my body at any weight. So I decided to focus on my health instead & feel so much better. Funny thing is, I see beauty in all sizes & shapes in everyone except myself, which is why I love your confidence. Do what you need to for yourself, not because of pressure from doctors to lose weight or from fans to keep weight. Follow your own instincts about what your body & soul need and figure out how to love yourself no matter where you are. Your beauty has nothing to do with your outer shell. Your body is just a garage to hold your car & your car will always be beautiful and shiny 🌟", "kimiecakez": "Thank you for posting this message, and being real that self love is a daily struggle sometimes.", "toupslove": "Where is this suit from", "worthyfigures": "Addressing this issue at @fgt_fatcamp this weekend of how to be an advocate for yourself in health care. Getting extra inspiration from this post! Thank you for your vulnerability in sharing.", "monimoana": "Gosh you’re so wonderful 😍😍", "rens_007_": "Beautyfull ❤️", "mayakern": "Ohh I feel this a lot 😭", "mleczkomatik": "Deformed, distended body.", "buttasnstuff": "Simply Beautiful", "annielaurahandmade": "This is exactly what I've been going through for so long.", "beyondyoga\nVerified": "Verified", "kalaidescopedid": "Love these pics and this post, we can do this together! We have our annual physical in a few weeks, going for the blood tests this week. We decided we will keep a tee shirt on for exam...just can’t quite deal with being naked. 💕", "michael_1484": "👍", "lamai_bird": "Maybe you want to share what has helped you with your problem? Sure many folks would appreciate 🙌", "heidishartrandnewell": "Yes yes this resonates 🙌🏻🙌🏻", "estrela_ak": "You are inspireing, you make the world a bit more beautiful 💜 please never think you deserve anything bad what happens to you. Dont forget that you are a insperation for others and thats helping other people to. Keep up beauty 💜", "andrebrixhe": "For me you are very beautiful. I like women with shapes 😀About your health, perhaps be a BBW isno good...but to smoke to drink to be a skinny is no good too 😣I know BBW who run 20km😊I hope you the best, be happy 💗", "megthompson44": "Thank you so much for this! I recently had to go to the doctor for gallbladder issues that have been bothering me for a few years. (CN: WLS) Every time I discussed it before, I was told to lose weight. The last time I was told to get weight loss surgery. I stopped going after that, until this past July. It was scary! But I do not deserve this pain. You’re right, that thought was a lie. 💕", "caffeinebasedlifeform": "I needed to hear this. I do the same. Fear of doctors and fat shaming have prevented me from taking care of me. 💕", "krisisawesome": "This is so relatable. Sending all the love 💜💜", "shelly_m__brown": "Cute", "aklu.mode": "Needed to read this today", "paranoic_princess": "@carolina_abr", "rosa_zee": "All. The. Feels. Thank you for this post. ♥️", "jmize1984": "Good color on you! 🔥", "rizzle_mashizzle": "I did that for years; avoided doctors and would stress majorly over just having a pap smear. Only recently have I started to address my health. Long way to go but I’m over the hump of ‘what if??’.", "jolierc": "I love you so much!!! ❤️❤️", "fattestmermaid": "Thank you for this. I was talking to my partner just today about needing to go to the doctor but fearing the worst because I’m fat. I think the first step to me getting to a doctor is seeing a therapist, so I’m going to try and reach out before this weekend. It’s people like you, and like my spouse, who remind me that my body is worth the effort, even if it doesn’t feel like it sometimes. ♥️", "sortedslytherin": "Thank you for all of your posts. Just seeing you and reading your thoughts and advice has done so much for my journey of self love and acceptance. You are irreplaceable to our community ❤️", "kimberlypaxton": "Thank you ♥️♥️", "kelleezblanca_type2": "Good for you girl💕", "alissalarraine": "I had a *male* doctor for an STD check once say that he wasn't there to judge me and we're all just living on the planet and I swooned", "alessandro_cestana": "😍😍😍😍😍😍👣💋💋💋💋💋💋", "madolyn.fatolyn": "I love this so much because I struggle with the same thoughts about doctors. Also, I love your yoga set! It looks super great on you.", "kayleighann88": "Glad you could ignore the voice and carry on 💛 x", "ladylovelyloxxx": "✨🙏🏻✨", "meg.sells": "Man, I had to convince doctors for half a year that my LEUKEMIA symptoms were real and not just me being fat. Advocating for yourself is scary, hard, and exhausting. But please do it folks. If you need help or tips— reach out! I love you fat bitches(TM @fatgirlflow 🥰) and am here for you!", "cloudydacie": "I hateee hate hate going to the doctor for the same reason. I’m actually switching doctors because of it. The most important thing for me to remember when I go in is to advocate for myself. I even write out lists of topics to focus on of I need to so I can stay on task and keep her from straying and bringing up my weight when I came in to talk about totally separate issues. I try to be vocal and assert my power over my body from the beginning so my doctors know what I’m about. But all of that is hard asf and you and all of my fellow fats who fight the anxiety and go to the doctor are so brave and I want us all to keep doing it and refusing to put up with abuse from medical professionals ❤️❤️", "fancy_tomboy": "I appreciate you girl!", "jgrundy0926": "I almost bled to death earlier this year because I put off going to my doctor in fear of being fat. I know I’ve gained weight and I was so ashamed that I let myself get to that point before I had to do something. People say “just go to the dr” but it’s not that simple when you struggle with your weight.", "the15roses": "🔥🔥🔥🤣🤣🤣🤣❤️❤️❤️❤️", "the_tao_of_tara": "I am struggling with this lately in a major way. I feel like even the chairs in a doctor's office are judging me. \"Maybe if i was smaller, I could fit in this chair\". It's awful. So many doctors have dismissed my symptoms as weight related. I am fortunate to have found a primary care & a few specialists that hear me & see me for more than my fat body. Now if only I could silence the voice of my internalized fatphobia. Loving myself is not a thing that comes naturally to me, but I am learning.", "katiefaye2": "I was recently diagnosed with crohns, I was misdiagnosed for 10 fucking years. I would go in and tell them it was getting worse, and they would brush me off and tell me to watch what i wat and go dairy free/gluten free. It got so bad I finally called a specialist on my own and find this shit out. It is so hard to know tb", "earthscribelife": "Beautiful bound angle! ♥️", "tracyknight4": "Just take it day by day! I have 6 doctors! And every time I go to see one of them, my butt cheeks draw up! Lol. But they are there for a reason, to help you stay healthy. Its scary, but you have people who love you that will be there for you when it is scary. It'll be ok, and if it isn't, you've got your friends and family who love you. 😉", "mominthecloset": "The little voice is a mighty beast somedays", "scdathykchoco1": "💜💜💜", "raspberryjorts": "ur new haircut has me like *lesbian* ur so pretty 😍😍😍💖💖💖", "scarletmay13": "Your hairstyle and you are so adorable, omg!!!!!!!", "happily__me_": "I have struggled with the same put off going to the doctor, stopped taking medication and I ended up in the hospital. I recovered and took my diabetes seriously after that, I still love to eat and have a serious sweet tooth sometimes but I control myself and I take my medication and keep my doctors appointments. I know I’ll never be thin and I’m okay with that because I love me, all that matters is I’m healthy, pages like yours has helped me so much with my body image and I am grateful for you 🥰", "kylaaflynn": "All doctors are going to tell you it's not healthy to be over weight , it's just science . But you can find an amazing doctor if you really look , from my experience women doctors are the best . My general practitioner Dr. Is a woman and she's seriously amazing . Takes every concern I have seriously and it's like talking to a friend every time I ask for advice or have an issue . All you have to do is look for a doctor and keep looking until you find someone that you are comfortable speaking to about anything and is also sensitive to your needs . Please though don't think all doctors are insensitive a-holes my doctor before this was a man and he was an asshole .", "ashleetaylorwilson": "Work. I just started working after being a stay at home mom and I work at amazon such a fast pace environment. I gained a little over 100 in the year and the past couple of days I've been thinking \"should I even do this\" \"I'm sure everyone thinks i cant do it\" but I can keep up with everyone body type I work with and its exhilarating. Its makes me proud in myself.", "realdeal_doc_dooley": "We (healthcare providers) have SO damn far to go 😕 ... one of the symptoms of depression is a change in appetite ... when I ask the question [have u noticed any changes in your appetite?] about 90% of the time the person responds with a negative comment about their weight or shape ... I have to reframe and really let the patient know that I am not asking about weight (or judging their weight) ... but really want to know how their appetitive has been ... because irrespective of weight or size changes in appetite might be a part of changing or unstable mood or be part of disordered eating ... as a small fat with the privilege of being a healthcare provider I have the privilege of not being dismissed very often ... I agree with asking other fat folks what providers they have had good experiences with ... ❤️💛❤️", "yumaratz": "I am so happy that you overcame your fear and went to the doctor. Doctors by and large are not fun and it is sometimes hard to remember that you are in control of your health and treatment.", "queen_lizzieiv": "STRONG AND STUNNING", "steffiefresh": "👏🏻👏🏻 And that outfit is 😍😍", "alwysleepy": "Completely off topic but did you ever find a good scary movie? Bc I can never find a actually good one myself", "dank.snugs": "I totally dread going to the Dr because just the act of even standing on the scale (even backward) is so triggering for me! I use E-visits whenever I can! Godsend!", "_herperfume": "I just DM'd you about a local doc who is amazing that me, my fat mom, and my fat partner all see.", "corrluv777": "💜💜💜 hope you get better soon", "loo00ren": "you are so cute and so beautiful!!! oh my gosh!!", "lvernon2000\nVerified": "Verified", "missjess_s": "Ahhhhhh I get this times 100!! Wanna know something so weird I've done and it's totally helped. I find my drs online and i pick a dr who's fat. I've had really good experiences with this. I know it means I'm profiling to some degree but it's made the anxiety about going less.", "hannitashouse": "Good job overcoming that fear and advocating for yourself ❤️", "mbraunpetsitter": "My knee Dr fat shamed me and then cancelled my knee surgery. Recommended gastric bypass surgery. I am afraid to go to a dr now", "rachel7leo": "❤️❤️", "abracadaverx": "I haven’t been seeing your posts for weeks but I was just thinking about you today, and now this came up on my feed! Feels like some supernatural forces are at work lol 💖", "theboponanny": "Amazing post! Thank you for talking about this. I just shared on my page! 👏🏻👏🏻💕💕", "tanilovesyou": "I 100% understand this. I had severe stomach issues but doctors kept saying I was just eating too much or should lose weight and then I'll feel better. The acid in my stomach burnt a hole in my stomach lining but no, the agony was because I'm fat. Also I had a hip accident years ago and have tried to get help for it and doctors kept saying it was because I'm fat and if I lose the weight it won't hurt. How am I supposed to lose weight if walking causes me pain? It's bullshit. So what I'm fat? I still need healthcare", "allyouneedisluff": "Ugh 😭😭😭 This hits so fucking hard.. I’ve been struggling with this very subject for too long. Thank you for your vulnerability is beautiful and a precious gift. 💞", "presses_and_dresses": "I relate. I was horribly fat shamed at my ob/gyn office two years ago... fast forward a year I was having two week long periods and really needed help but waited months because I had gained weight and figured I deserved it 🤷🏻‍♀️ someone else finally advocated for me and I got the help I needed. Ugh... the struggle...", "felipechiquito4gmailcom": "❤️❤️", "low_fives_": "Needed to hear this so bad today. I moved to a new state and have been dragging my feet on getting new doctors because of fear (and a little bit of that internal negative voice) of what a new doctor will say to me. Thank you for this reminder that I deserve medical care just like everyone else and that I am my own best advocate!", "danielle.bex": "I'm struggling a lot with going to doctors. The thought of paying someone to dismiss my concerns makes me sick. If there was a way I could not pay them if they did 0 exploratory work and simply suggested weightloss then I think I'd feel better. As it stands, doctor's have no fiscal incentive to ethically treat patients of all sizes and it makes me real mad. Also health problems make me vulnerable... I'm such an up front and confrontational person but when it comes to my health the voice in my head says \"no that's on you\". I know it's not true but if I go to the doctor and they reinforce that perspective... I die a little inside. I just want the world to be better already.", "mandycreasy": "I've ignored my health for so long and am terrified to address any of it. Thank you for sharing this. It's reassuring to see I'm not the only one who struggles.", "larsyfarsy": "Cute color 💙", "totoatoz": "I have multiple diagnosis but still have people treat me like it’s my fault. And I am my own worst enemy. I have been self conscious my entire life. Have never been able to get past it. I hope you can. You deserve better 😘", "bs1874_": "💔💔💔", "theformermissrappe": "I’m a type 1 diabetic. During my pregnancy my specialist would constantly confuse me as gestational or a type 2 because of my size. Very annoying and potentially dangerous. The bias has the potential to kill people.", "cgrimm": "I WAS JUST TALKING ABOUT THIS TODAY! Sorry for yelling. I just get this", "owlloveu4eternity": "You’re so precious!😍", "samanthasweet64": "I can so relate. I have an invisible illness and when I am really sick, doctors generally just see my sweet plus- sizedness rather than listening to my symptoms. I learned that my best advocate is...me. Proud of you for advocating for yourself!!", "goo_ooder": "❤️❤️❤️", "mriafdez": "You're such a wonderful soul, i just thought you should know that 💙", "nerdy_nettie": "@fatgirlflow something I always ask my doctors or ANY medical personnel I come in contact with is this. “What would the course of action be if I was thin?” Usually they say “oh some labs/scans/tests/etc” to which I reply “great! Let’s do that!” It ensures that they are thorough, not being lazy doctors by writing it off as weight, and I am getting the care I need. Often we have found my issues are indeed NOT due to weight. Finding that if we were not thorough I could have become really ill. Hope the question I’ve shared with you helps you along your journey. ☺️💕", "andimjulie\nVerified": "Verified", "themaverickess": "i just love everything about this 💛", "freedomofflow": "♥️♥️♥️♥️♥️", "sayshesclassy": "Also, what's currently getting in the way of me fully loving and accepting myself is indeed body related... I feel like I can't really live the life I want because of my health and appearance and ability or lack there of. It kills me, but I'm even considering stopping dating because like... who would ever sign up for this? Ugh. I know that's bullshit but it's still in my head... sorry for rambling.", "dcgirlnjersey": "Self acceptance and self love are the goal that we all aim for. Some days it’s easier than others. I’m happy that you jumped over the hurdle to self care.", "croyster912": "Being fat and chronically ill i understand this challenge all to well.", "stirlingjudith": "That’s a beautiful color on you! Happy Monday!", "fatpositivetherapy": "THESE ARE SO CUTE", "silleefoot": "I can really relate to this❤️", "vers1971": "Did the Doctors treat you well? I hope so. I have the same fear. That they will say to themselves \"who cares if you are sick, your a fat and deserve to be sick.\" Ugh....", "roseybeeme\nVerified": "Verified", "comfyfattravels": "I do have things holding me back from taking good care of myself. Not necessarily health wise. But as you know, Im struggling with just getting myself OUT into the world enough. You inspire me to remind myself I deserve the best.", "d.ruch": "I research doctors before I really need them, this way I've established a good doctor.", "heatherbladen": "Thank you. I needed this today!!", "devachka.ludovico": "❤️❤️❤️❤️❤️❤️", "itsmekellieb\nVerified": "Verified", "debicet": "I super relate and want to validate your dr/health experiences as traumatic in hopes of helping you to celebrate your own courage and honesty in moving forward to take care of yourself! It’s a really big deal!! 👏👏👏🌈💜", "jennysusie76": "Having a pacemaker at 35, and now 43 along with a host of other diagnoses, and sleep apnea, cardiac anerueysm, blah, blah has really sucked and then to be fat is another thing. My family doesn't have many fat people so I've always been the black sheep and everything that is wrong with me is because of my weight 🤨. Well I'm not totally buying that because when I was at my leanest at 160 I was born with a bad heart and still had health problems then too.... Ahhhh, amazing huh?!? 😉 I so know how you might feel going thru all the medical stuff. It's alot to take in. Being fat might not help the situation, but I believe there are other parameters and just causes that could be to blame as well. But usually when you're fat, everything is conveniently blamed on that 🤦🏼‍♀️ I hope you stay well. I'm just loving this yoga outfit!! Nice❤️👍🤗", "discovering_kay": "@fatgirlflow please take care of yourself I am glad you choose to change for the better. You're such an inspiration to all for what you just said.", "karma_strikes_back": "Have a great start into the new week ☺️", "brealynntaylor": "Such a great reminder 💕 Also I am obsessed with this yoga set! You look so great."}