{"jesuspd615": "It’s unhealthy to not monitor your weight if you’re obese. Don’t believe me? Ask a doctor.", "leereignssupreme": "❤❤❤❤", "michelleberthels": "Hell yes! 🙏🏻", "dontaskalex": "I’m a plus size woman, always have been and likely always will be, so I understand your struggle. I’ve also struggled with eating disorders and mental health issues. I hate the idea of being policed when you’re just trying to exist, and the idea of plus size women “promoting obesity” for simply existing on social media is disgusting. Im not saying you do this, but, there is something to be said for promoting the idea that you can be healthy when morbidly obese. I believe in loving yourself at any size, and I know that getting to a “healthy weight” or BMI can be extremely difficult. Lately I’ve struggled with plus size women promoting the idea that being super obese is OK, purely from a medical and statistical standpoint, because there are a lot of serious health issues that can arise, including death, from this. Does this not send the wrong message to followers? This is in no way meant to be an attack, but simply an attempt to understand. Where do we draw the line between self love and acceptance, and refusal to acknowledge the damaging effects that being extremely overweight can have?", "benourishedpdx": "👏🏼👏🏼👏🏼 YESS! So great, may we repost with all due credit to you? ❤️", "hotfatgirlsanssbbwanbbws": "🔥🔥Hot🔥🔥 and sexy belly", "miraweiner": "Thank you for representing all of us! ❤️", "karin.modig": "❤️❤️❤️", "ken.vroman.792": "Your so very sexy. I just love big beautiful women. That is more of you to kiss and love.🥰", "bigten0102": "I love it!!! Very sexy and arousing!!!🔥❤️😍👍", "ercan_sengun": "I love this", "keepcalmbbw": "💐💐💐💐💐💐💐💐💐", "by_stilist_": "🔥🔥🔥🔥", "cudzichmags": "This is promoting premature death. Very wrong", "mahmoud.gilani_bandare.anzali": "❤️❤️❤️❤️❤️❤️❤️❤️😍😍😍😍😍😍😍😍😮😮😮😮😮💚💚💚💚💚👄👄👄", "kasirga1221": "😍😍😍🔥🔥🔥", "morgenleawful": "This is a beautiful picture of you. It is my favorite by far.", "annaszabojdmba": "If people don’t like your pictures, they can simply unfollow you. Why do they message you about their not liking you? 🤯", "aryazahedikia6": "Hi my favorite Love life I'm happy with you marriage and injures life with you and have your bonds all work home makes foods drink Drive shopping all I payed and anything you liked bayer for you💕💎💍🕺🌞💐👌💋👍😍💥🎂🌹🙏🏿🌹🙏🏿🌹🙏🏿 my No is 1+8182135283 Arya 🇺🇸🥂💃💍💃💗💃🇺🇸", "miki.corleone23": "👍👍❤️😍❤️👍👍🔥wow", "kevinpicklepants": "🙌🙌🙌🙌", "laurenfitzhugh": "OMG! @deb_traynor this is the Fred I was telling you about. First thing I saw when I logged in tonight. 💜🧘🏻‍♀️", "visceral_man": "👏👏👏👏👏👏 u r beautifull, yes ! 👏👏👏👏👏😍", "willebaere": "Wonderful fat belly", "danielledanner932": "I love this photo. I want to have the mindset you had in this photo and the same mindset you had when posting this pic. You’re gorgeous and thank you for this beautiful post ❤️", "travelling_tana": "🤮", "johnbrown5131": "No body's business until your legs are amputated my Lord Beetus.", "whitehorsediane": "Your beautiful and u radiate positive energy and vibes. Keep being u always. Stay positive, strong and beautiful. your blessed.", "lepperjesse": "Omg absolutely amazing #perfection... you are beautiful", "multifandoml0ver_caylee": "This made me cry happy tears since for years now I have struggled and still do with problems with my weight. Mainly because my ex husband verbally abused me by calling fat smelly stupid and lazy but your words have helped me a lot thank you so much for sharing them.", "marcysmeltdown": "@fatgirlflow do you see a direct correlation between having to use a cpap and excessive weight and if so .. why would you choose to make life physically harder on yourself instead of becoming a more comfortable weight .", "kimhoneybeewood": "I love youuuuuu! 💜💜", "expodentalanda": "I love you dude my body is changing as I age and I'm getting a mpre saggie belly I was always so afraid of it but fuck it my body is mine and to hell with who dosent think its amazing because I fucking do. Respect baby!❤️", "elenamugrosa": "❤️", "kristy79_7777": "😍 you are so beautiful. And incredibly inspirational.", "slowgrrl": "You're beautiful regardless of how your body fluctuates and in every state. 💜", "kkellyyyy": "I love your attitude, the positive messages you share and you’re a badass bitch. That’s all there is to it. If we all wasted our entire lives worried about our weight and looks, imagine how much we would miss out on. Rock on, lady. You’re an inspiration", "lucypitto": "@kienan_555", "rhondafayeweir": "👏🏻👏🏻👏🏻Love you and what you do for our community!!! Showing representation and always sharing ❤️", "maanfifthfl": "Confidence is sexy", "hollyjollyface": "Thank you.", "morgan_hayley_inspire": "Love these so much👌", "shauntabiawills": "All the yeses in the world!! 😘", "mindset_v_perspective": "🙏", "hopeinseattle": "You are so wonderful, Corissa! Thank you for sharing your light with us. ❤️", "rosebuddud77": "So happy to see a body that looks like mine.", "viperbrick": "Gorgeous, thank you for sharing yourself with us.", "katelynscottboudoir": "You’re so incredibly stunning. 😍🥰❤️", "karenj70": "Go girl well said. Get sick to the back teeth of it all the time ❤️", "manavshail": "Attitude👍...admirable lady...", "hjwdewit": "You're so beautiful 😍", "romero6013": "👏👏👏👏👏👏👏👏", "mommyiloveyousobig": "Well said!!!! 👏👏👏", "ananstesha": "😮", "chklit74": "People are insane..can’t imagine inboxing someone over there fupa", "evening_banshee": "I think you are absolutely stunning and look happier than ever!", "mstx42day": "😮😮😮😮 this takes guts!", "bertusbunschoten": "😍❤️❤️👍", "polishpolishpooolish": "I never understood why people comment on big bodies with concern, 'cause in reality, they don't give a shit...", "bathorysbubblz": "Is it bad that the 1st thing I noticed was your room lol. I wish my room was this", "juldamasceno": "Maravilhosa", "glitteryfemme": "Yes!!!!!!!!! Exactly how I've been feeling this week especially 😭😭💗💗", "belinda_georges_": "Amen", "theviviennerose": "A-fucking-men", "bodlibkc": "YES 💜💜💜🙌🙌🙌", "michael_1484": "👍", "positivelylime": "💚💚💚💚💚💚", "vaidehichaubal": "You are the best! Love the confidence and I look up to you!!", "daiynemc": "YASSSSSSSS, YOU BEAUTIFUL FATTY! ❤️😍🔥🤩 💕 You are a constant source of inspiration, and I am endlessly proud of how fiercely you love yourself.", "jemvt": "@candorella2", "smashalee_jerkface": "More power to you. I never knew about your eating disorder, not that it's any of my business but it gives me a certain level of understand being that I'm trying to live my live and keep my ED in check. It's difficult because I am in the process of losing weight for health and my own reasons and I'm trying to keep my ED in check but also feel myself going back to destructive ways and make the numbers on the scale go lower. Thanks for sharing.", "blackmagickmomma": "I 👏🏾love 👏🏾 this 👏🏾photo 👏🏾 so 👏🏾 much! There’s a softness to your face that carries such a glow when you deliver these very important messages. You’re so beautiful and your haircut is gorgeously adorable. And I love you. And I’ve been praying for you extra as the days get colder. 🖤 You’re so amazing and I can’t get over how incredible you are.", "nevanevita": "@noe2803_ read her! We could discuss what she's saying about people expectations❤️", "lghshortstay": "You look just like me, my body is amazing, as is yours xxx", "meganspry5": "🙌🏻👏👏👏 ❤️🤗", "taftchrista": "*posts picture of body on the internet* “Guys quit asking me questions or making comments about my body”", "saijamelander": "Sooo beautiful pic 😍👌🏼", "westwardho1975": "Your beautiful xx😍", "ctofine": "💙💙", "heidishartrandnewell": "Ew gross people do that?! 😭 Your space is so important and valid. ❤️", "phylixia_": "💛🙌🏻Big dot.", "spacebrat_": "You’re incredible and your example is always dear and empowering to me. Keep being you, whoever that may be! 👏🏼👏🏼👏🏼❤️", "thetrampire": "Your belly looks like mine!! ❤️❤️❤️ I feel so represented right now. You’re beautiful.", "stripeycat": "Beautiful lady. How very dare anybody question you. Wtaf does it have to do with them. Keep on doing what your doing. The positivity helps me EVERY DAMN DAY 🌟🌟🌟", "miss_kayla_nicole": "@fatgirlflow where did you get your undies!!!!!!!!!", "fatfeministmich": "It’s ridiculous and so rude that others would message you and comment about this! 😠", "rivi57": "💝💖💝💖💝💖💝", "thandiwh": "🙌👏🙌👏", "thomasmann71": "Gorgeous", "goatersue": "I think you are beautiful inside and out ignore all the negativity you have been an inspiration to me I have a real problem excepting my looks and body still do I hate the way I am 🌸", "arthurhinz": "😍😍🔥🔥", "shellyhassdenteufel": "♥️♥️♥️", "kimber.michellee": "I could not agree more!!!! 💜💚💜💚💜💚", "bettiepumpkin": "👏", "chainpuriamustafa": "Love you so much💋💋💋💋💋", "its.just.the.start": "Ps. My weekend was bomb! 🖤", "anne.med.e": "❤❤❤", "zeeshan7654225": "❤️", "madgor": "Wow!! You amazing you 🤩✨❤️", "_jreadman": "I wish I could love this more than once! 🧡", "melthephotog": "💞Thank you for posting this!! I am struggling with some of the same issues. People thinking that I should fit into their perception of beauty and health. I am now at the point where what matters is how I feel and how I see myself. Hope you and J had a wonderful weekend!! 💞💞", "martinifontaine": "A. You do not have to answer to anyone and B. You are lovely! 💖😍", "magdushka80": "👏Very well said. Totally agree.", "ms.vivian89": "Hey lady💜💜", "surfgirlsunshine": "👏👏👏👏👏👏👏", "voimatasapaino": "❤️", "mollieart": "❤️", "discoveringcasey": "🙌🏻🙌🏻🙌🏻👏🏻👏🏻👏🏻", "ladysmallsteps": "Your words do resonate a lot with me! 🙌 Making me reconsider my relationship with my own body a lot... ❤️", "redlou1978": "I wish I had this much love love about myself to accept myself as I am..but seeing women like you does help 💕", "lifewithbabyqueso": "Thank you for posting this. You have no idea how much I needed to see your beautiful body and soul today. ❤️", "26kleisen": "👏🏻👏🏻", "beautiful.nobody": "Why are you not trying to overcome your overeating? That’s an eating disorder too...you’re ruining your health and body", "snuggly.snail": "Omg I love your hair", "kiss.niaa": "& you said what you said ! 🔥❤️", "andrebrixhe": "I like very your words I hope you the best in your life", "p_wretty": "Thank you! Beautiful shot!", "sweethomevermont": "Oh my goodness, girl. You are a powerhouse and a goddamn relief! You. Do. You.", "samwardcares": "What a stunning photo! And that lighting? *chef’s kiss*", "samanthasweet64": "Girl you do you! You're fabulous. You made me realize that I spent way too much time NOT walking around my own dam house in my underwear. Thank you!", "iwilltaketheride": "👏👏👏", "sophieezhno": "AMEN TO THAT!!!!!FFS!!❤️❤️wonderful said and so true....just gonna hang myself on every word you say and use the argument myself...I meet this myself way to often...", "mmswetnam": "Amen Sister!!!!", "phantombelle": "❤️🙌", "nasioumaria": "👏That' s right girl!kisses from Greece", "_mrym.zoraghi_": "I LOVE U TOO FROM IRAN💕💕", "rosemaryandquartz": "Those undies are so cute!!", "carlamlawson": "@elon", "griseldiaz20": "You're beautiful and you always be!", "kmw_plus": "💜💜💜", "monilonge": "That's not really fair.", "studentolife": "You showing your body helps me to accept my own. Thank you. 😘", "karindelana": "Why is it so hard for people to mind their own damn business???? I am constantly confused by this.", "amywito": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "trayteerig": "Well said! Looking fab!!!", "radically_ky": "PREACH", "diamondgirl1974": "I am sort over what people think of me and my weight. I live for me.", "debicet": "Yas GRRRLLLLL speak your truth 💜", "mysticstudios": "Are you a ring because you lookin so damn precious?! 😭💕", "justrosa00": "Awwww!!!!! Well put!!!!!!!!!!!!❤️❤️❤️❤️❤️", "rociochiocastellon": "Keep being the best version of yourself!!!", "alexisdavinalove": "You are a beautiful and inspiring being and I so appreciate your perspective and willingness to share your experiences. Thank you for brightening my IG feed.💕💕 This shot is also so amazing", "liz_fashiontalents": "Go ahead Beautiful, you got this 😘😘😘😍❤️", "lindabarney2016": "💋 👏👏👏👏👏👏👏👏 bravo", "keepitdiosa": "😍", "jennysusie76": "You are so awesome and so fucking brave!! I am inching your way getting back to finding myself again and so tired of being tired about explaining my weight gain or loss and always expecting a good loss. Nope, move along!! You are the real deal. Thanks for being such a positive and true page and person I should say lol to follow. Oh btw, there must be some real,bored,idiots out there to take the time to message someone; something derogatory or negative. Wow!! Crazy.", "awkward_beautyy": "You are gorgeous, and I wish I knew you irl. I need your kind of positivity around me!", "pamela_really": "I think you are STUNNING! 😘", "sassymamanc": "Absolutely adorable. I love how you are so comfy in your skin. I wish more women realized how truly amazing they are!", "evathimgren": "❤️❤️❤️", "marissadev": "Somehow it is both comforting and scary to see someone who looks like me just being themselves in their underwear and letting everyone look. Please don't ever stop!", "ilovemywomenfluffy": "🙏", "dizondana": "Can somebody give you an amen?!?!! You, are perfect.... strong , capable, eloquent , kind and beautiful.", "copperkilt": "I love you", "jschoon83": "Gotta be at least 380 😩😍", "excessimagery": "Amazing 😍😍😍", "cara_witha_gh": "❤️", "faith_walkerz": "👏🏽👏🏽👏🏽", "gunz.d": "...you cut your hair!", "lvernon2000\nVerified": "Verified", "artistshelleymouber": "#loveyoself #zerofucksgiven #fatfemmesarefab #gorgeousphoto 🖤", "pattiu2": "Gorgeous! You go girl!!!!", "sleepyybabe_": "💜💜💜", "jackiepetersonphotography": "I read a quote the other day from someone... I forget who but they said, “Does anyone know or remember Rosa Parks weight when she sat down on the bus? Or Malala’s weight when she spoke up for a girl’s right to education? Nope!” It’s time we remember what is important. And the work you are doing is so needed and important. Thank you ❤️❤️", "boutiqueplussizebarbie": "@fatgirlflow i see you beautiful, lovely & gorgeous, you look real & happy like a Lot of Us, thats the important.", "jayadambird": "Holy shit I know I shouldn’t be surprised that ppl DM you to lecture you about your body changes (or not changes)—this is a trash world full of garbage people", "thisbrunetteblogs": "@thegarciadiaries thisss!!!", "ambie52": "Well tell then this will, I flip my hair and check my nails, how u doing .... Don't let anyone bring that smile down. Ur gorgeous and don't u forget that. U have love that shines through that pretty littl head of URS. U may not be that idle size 2 or that normal size 5 but show cares.. laugh it off baby girl. .. we are human and last time I checked. U have a wife that loves u and don't care what u look like. So tell them haters to keep hate. Cause they can kiss allllll that. Sexiness tell they can't kisses it any more. ❤️❤️❤️❤️", "grantkristina": "Thank you❤️", "blackloviesolid": "❤❤❤", "sherrb1": "👏👏👏", "notsorry_mrsjackson_": "Love love love.", "bonniemcglothlin": "You look beautiful girl!!❤️", "kourtnei_wu": "❤❤❤❤", "daughter_no5": "❤️❤️❤️", "clairevicky7": "Roxane Gay said it best, paraphrasing - ‘you don’t know the why and you’re not entitled to know the why...”", "whitneysweet_writes": "The curve of your back to your bum looks amazing. And, thanks for sharing your tummy, which looks just like mine❤️ Boo to people who are too nosy.", "that_comfy_phat_chick": "❤️❤️❤️❤️", "carlamariebr": "Love you and this post! ❤️", "inspiraci0n_natural": "No hace falta demostrar nada a nadie, solo a uno mismo. Yo comía en desorden, lo que se me presentaba y decía amarme tal cual era, no importarme los estereotipos... pero en verdad solo estaba comiéndome mis emociones y eso me trajo enfermedades, por salud baje un 80 % los azúcares refinados, harinas y grasas y todo cambio, ahora no puedo creer como decía amarme, matándome día a día. Ahora debo reparar mi salud pero me siento de maravilla, no me peso, no me mido, no hago cosas locas... solo me amo y me lo demuestro.", "ewp1985": "You're beautiful! People can be assholes.", "erinvictoria77": "ALL people deserve respect. Size should not play any part in that. You keep rocking your life girl, and inspiring the rest of us to do the same 💕", "jameygyms": "Yeeeessssssss. This is everything! 💗", "cgreer0812": "🙌🙌 ALL OF THAT THO!", "lowcountry_mom": "🙌🙌🙌❤️❤️❤️ Love u!!!", "norcaligirl": "👏👏👏👏👏🙌🙌🙌🙌🙌🙌", "tiny.lantern": "you’re stunning. thanks for this.", "havesumhope": "👏👏👏❤️", "healingserendipity": "yes yes YES to this ♥️", "missbig_juicy79": "You’re stunning! I wish like hell social media existed as it does now, when I was in my 20’s. The message that you pass is uplifting and beautiful and wonderful and great and kind. Thank you for being you!", "coco_penexplore": "And we love you too! ❤️❤️❤️🔥", "sugarharlot2013": "I seriously love what you said here!!! Thank you for this❤️", "vintage805": "❤❤❤❤❤❤❤❤❤❤❤", "woodsyjewels": "Indeed!! Preach!", "journey2lovenika": "Alllllll of thisssss!!!!!🙌🙌", "ajj48fan": "🔥🔥🔥🔥🔥 you are absolutely beautiful❤❤", "amham88": "I just want to know who had the time and energy to give a fuck what other people's bodies are doing. Like, get a damn life.", "hellcattsnow": "🖤", "dani_jo_clark": "You are beautiful and I follow you purely because I think you would be an awesome person to hang out with and I love your positivity and how genuine you are. Thanks for being you 💜💜", "kell_longfell": "Good for you! You’re beautiful! 🙌🏼🙌🏼🙌🏼🙌🏼", "princessgmac": "I absolutely HATE that people think they have a right to speak into yours, or anyone’s life when it comes to health, body size, sexuality, anything! It’s rude, it’s hateful, and shame on you to whoever is doing it! I think you are rad as hell and thank you for making a difference in the world! ❤️", "silversarah17": "👏🏻🙌🏻", "carlogirl": "You've gained weight? I really had not noticed. Weird that others have and that they felt the need to message a complete stranger about their body size.", "banannasavage": "I LOVE this", "kristinneedsaname": "*buy not but lol", "high_five": "🙌🏻Yes to all of this!🙌🏻", "missmegandaniel": "Omg girl you’re not lying. I’m five months pregnant and I get comments about how I don’t have a baby bump as a “skinny girl” would, and it breaks my heart...as though my experience is not valid. People have no idea how much their words and speculation can hurt. You. Are. Brave.", "nadiabokody\nVerified": "Verified", "theskinandwaxingstudiowindham": "Rock on girl", "strong_in_the_broken_places": "I love you, you're gorgeous. You and others like you are the main focus of my IG. I hated my body because it was not the \"norm\". Beings like you have helped open my eyes that yes, I am beautiful just the way I am. I am so sorry you have to deal with all the nitpicking of blind individuals. All bodies are beautiful. The people housed in those bodies are even more beautiful! Thank you for always being present and transparent.", "_christiewhite_": "1. love this. 2. love you. 3. fuck the people who disagree with 1 or 2. ♥️", "strawberryeliza": "Wonderful, always 💜", "motoluvchi": "@tovar1983andrea", "mayorofstruggle": "Can we talk about how beautiful this room is tho?", "rachelmariefox": "Fuckin preach 🙌🙌🙌🖤", "kter_2_tonja": "❤️", "itsnaiana\nVerified": "Verified", "runneryogichasingbreath": "Love it! Keep doin what makes you happy girl! 😍", "sue_s_g": "❤️", "comfyfattravels": "Continuously proud of you babe <3", "shereadelsol": "Wow, you’re perfect 😍😍", "misssnowwhitexx": "Amazing. 🌹🌹🌹🌹", "khavanicole": "I love and appreciate you on the regular.", "ehwhysmom": "I think your pictures are beautiful. My body is similar to yours. I'm trying to understand how I find you beautiful and me not (I have a million words going through my head but I'll refrain out of respect). Thank you for sharing your pictures.", "lavme83": "💙🙌🏽", "ss_katriel": "I should show this to my mother", "adrienneec": "👏👏👏👏👏👏👏👏👏👏👏👏", "amockusx3": "Girl, you're a queen❤️❤️❤️❤️😍😍😍😍😍", "riseandshinemissy": "I don’t even know why people can be so terrible. Buuuuut you are not and I love you.", "chickenofpeace": "In my older age now I have come to the conclusion that I don't give a shit what people think and if they don't like how I look then don't look at me. So, you're fat...so am I. 💜", "danmw": "Fuck. Yes. Also, I think i you’re so rad x", "thecellosinger": "Straight facts 👏🏽I really don’t see how anyone’s body ever became anyone’s business. Ever", "kaylyn.mingua": "I love this so much 💖 thank you.", "rach_adele": "Beautiful reminder ❤️❤️", "evrblue": "You're a beautiful person and a lovely spirit. Thank you for sharing your life and experience. You give me hope that someday I will be at ease in this body and the space it takes up in this world", "misbehavingdonkey": "I’m not sorry, commenting on other people’s bodies and being that observant of weight gain/loss is plain creepy.", "jarz3momma": "Way to go", "happyisthewitch": "You inspire so many people, me included. Fuck the trolls", "plaidsquatch": "the only thing i think when i see you (or anyone on social media tbh) is how tall you are in relation to myself- i always perceive people to be way taller than me unless they are actual babies 😂", "mrmustacheaa": "👏👏👏👏👏", "shanniwanny": "👏🏻👏🏻👏🏻👏🏻", "magpiemagnus": "Omg this brick 🧱 place❗️❗️love it", "queenofcoils": "I just want to take a minute and say thank you for being your amazing authentic self. I am in awe of your bravery & seeing your post and messages on my feed mean the world to me and help me normalize and appreciate my body just thr way it is, no changes needed 💜💜💜💜💜 Please do not change a thing despite all the BS your making the world a better & kinder place 💜", "jessyhausner": "I’m grateful for you ❤️", "vickiv9413": "I love what you stand for", "brokefatgirl": "Corissa (my phone tried to change your name to croissant, just thought I’d let you know), THANK YOU for writing this post. It is imperative that we call out this kind of behavior bc it’s invasive and gross!!!!", "cara.sergio": "And I feel like my own fat belly shouldn’t be anyone else’s goddamn business. This body survived childhood sexual abuse, survived childhood physical abuse, is in recovery from alcoholism, PTSD, & depression. This body got sober, lost, and gained back a hundred pounds, in the past 7 years. This body had two cornea surgeries. This body gets up & goes to work every day. This body manages to smile at people even as I know they’re working to gaslight me. But most importantly, this body is in peri menopause, a land of fluctuating hormones and ever-changing moods...so I could very easily tell you to kiss the fattest part of my ass the next time you ask me if I should be eating something.", "riverbottomrose": "🙌🏼Thank you. I get fat shamed daily, from my own siblings to cashiers at the darn craft store. My size does not give you the right to police or abuse me. I’m so frickin’ over it. Been obese since I was one and on diets since age 9. Even had my guts cut open all in effort to lose the fat strangers hate me for. I’m over apologizing for existing or taking up space.", "willisjackson85": "Beautiful", "fatgelfling": "i feel like whenever a fat person becomes an online creator people mentally box them in at whatever size they’re at and expect them to stay that size, even given the nature of fat bodies to, ya know, literally become more fat. it’s a weird conundrum because it’s absolutely rooted in the viewer’s own fatphobia and nothing else, but if that’s the case why follow you in the first place, even when you were smaller? you still spoke about the same stuff. did the reality of your words and beliefs not hit them until now? also how does your body at any size even affect anyone else’s life that they’d need to message you? i’m cranky about this lmao.", "plussizepioneer": "This! This! This! ALL OF IT. 🙌🏻🙌🏻🙌🏻 Thank you for sharing this very important PSA, beautiful! ❤️", "abbyyy.alexandra_": "👏👏👏👏😍😍😍😍💙", "kali_bopo": "Hell yes!! ❤️", "holliejoyjoy": "🙌🏻❤️🔥😍", "fabulousdarling14": "I think you are amazing. Even when you talk about struggle, you radiate joy and light. Stand your ground, never back down. To hell with the people trying to trigger negative feelings - you are FABULOUS! ❤️", "whitneytheinvincible": "This is such a beautiful photo of you. 😍", "annachubbybanana": "You’re gorgeous at every size! 🙌💖😍", "lianabethw": "you were one of the reasons I decided to get my plus sized upper tummy tattooed. I’m going Friday ☺️🖤✨", "taylorlynnekelly": "It’s so absofuckinglutely refreshing to see a beautiful woman my size and showing it off and not afraid to take a picture and tell the world to go to hell if they don’t like it. You are an inspiration because I don’t see my body type out here often and knowing you love your body makes me feel like maybe one day I can too. ❤️💕💐", "plussizedbarbie_13_": "Your simply perfect! ❤️ us big girls are beautiful head to toe", "roowill": "💙💜🧡", "embachild": "Happy #backfatsunday to you too! Thanks for always speaking up 📢🙌❤️", "bullystyles": "🤤", "photofridakahlo": "❤️", "rachaelmarie72": "💖💖💖", "swansons.lawrence": "Can I just tell you that out of every photo, caption, thought, and sentiment that I’ve seen and read from you through the years, THIS is the most honest, lovey, wonderful reflection of confidence, Grace, and just being a kick ass woman that I have EVER read!! Bravo to you!! ✌🏻", "kingstreet2372": "You do you and you don’t need to please anyone doing what makes you happy. I love when people are confident and unapologetically themselves. It’s refreshing to see. You do inspire others to love their bodies and not hide the beauty that’s inside and that’s something special!! 😊🧡", "tapsandtomes": "My husband is going thru an exercise journey, and I'm proud of him, but bc of that everyone is like \"are you doing it with him? How much have you lost?\" Its making me so self conscious, and I dont normally bow to that. I don't weigh myself, i let my body dictate what it needs. That is for reminding me to shut down the voices and comparisons.", "alli_fett": "😍😍😍 Beautiful!!!!", "gcima0918": "🙌🏽🙌🏽🙌🏽", "______abbae______": "hey I haven’t forgotten last Sunday’s post! I hope you did some self care today! ♥️", "charity_irene_lee": "Gorgeous🔥🙌💥😍😘", "mrsbishop.png": "You are perfectly you at any size, shape, color, or beyond! @fatgirlflow", "cedar.willow": "Yes, Corissa, YES! 👏🏽👏🏽👏🏽 thank you 💛💛💛", "meghita": "I think you and I could be twins 👯‍♀️", "ivydanielle75": "You’re a beautiful person. Thank you for all you do. I’m a work in progress and find encouragement from your post.", "q_strom_99_walker": "🌼🌼🌼🌼🌼🌼🌼", "dmanwar007": "You are so beautiful and amazing lady I love every crease in your body and your mind set I get you I get where your coming from my wife is plus size I like the big girls with the big belly's and big bottys so fun to run your hands all over nothing wrong with your body at all Clarissa you give my wife confidence", "gnarlytrinkets": "🙌🏻Thank you for this 💖", "bubblegum_bxby": "Beautiful photo! Keep living your truth! You are so awesome! And jay too!", "bodyposigracie": "I have so many family members who comment on mine and others weight as if a number is always their main concern, I’m sick of everyone being so caught up on the status of others bodies.", "tracyene": "I love those brick walls. And the soft curtains against them!", "queen_sirus": "Slay queen", "grayvolution": "This caption speaks so much wisdom ☀️", "mezzo_sarah": "💗💗💗💗💗💗💗", "dog.mom.of2": "Amen! Much love to you 💕", "imeaniguess96_": "I needed this so bad ❤️", "sebastian_gomez_lopez": "😮😍😻😍😻😍😻😍😀", "kylaaflynn": "I don't understand the point of monitoring your weight . My family including myself never had scales , I always found it odd when I went to someone's house and they had a scale in every bathroom . Yes my weight goes up and down a lot but I've gave up dieting a long time ago . There are way more important things to worry about than your weight . Even more so now that I'm a mom to a almost 3 year old boy . I barely have time to take a shower between working, caring for him (and my husband) haha and keeping my house clean . Not super clean but clean enough . Anyone who is reading this who checks and keeps track on their weight .Listen it's not worth it ! And it's so pointless 😊", "memyself_andi007": "🙏❤ you looks great and u do u!", "cooperbobby75": "Your beautiful and brave you can alwayd block the ones that are hating ma'am and forgive me for speaking my mind please dont hate me for it i just like your fastion tips and stuff it helps me spoil my lover to the maxs your a dream girlfriend love what you do you so rock at everything you do", "luellaarbre": "I love this 😍", "leahboneski": "❤️❤️❤️❤️❤️❤️❤️❤️❤️ youre so inspiring!", "prettyologist": "I love you! Just wanted to say.", "yumaratz": "You tell them!!! Live your life for you, never for others.", "just_this_chick": "God, yes. \"I am just a human person living my life and hoping that sometimes what I have to say resonates.\" IT DOES. ❤️", "copperinwonderland": "What a great face you have 😊", "youdntknomylife": "💜", "lattesandlace__": "You are gorgeous!! 💜💜💜", "biancafigueroa0303": "I follow you because I’m a big girl and it’s hard for me to get motivated to walk outside. I find you amazing! You are always so happy. Stay true to you!! People hate that’s what they do. You look gorgeous ❤️", "cata.plussize": "I don't care about your body size, i care about how gorgeous u look on every picture!! 😍😍 ❤️❤️", "jackadossett": "You are such an incredible inspiration, and I know you will never let anyone tell you otherwise and that is truly an amazing quality! Keep being you!", "mkb2mkennethb": "Simply gorgeous.", "hlbarnes": "You are amazing!! And look beautiful! 💖✨", "meyomarrufo": "Hell yeah! Im tired of explaining/justifying that I'm ok with who I am. Dont like it...dont look.", "tres__leches": "👏👏👏", "breathe_m3": "🔥🔥🔥😍", "kamiorange": "I love the lighting in this photo and how it highlights the dimples in your skin! This is beautiful! 😍😍", "fairiesandfancies": "We only got one life and we sure as hell ain’t gunna live it for anyone but ourselves. Let fat people live their lives and be happy.", "femmeinfloral": "I’ve followed you for a couple years at least and I can’t even guess whether people are assuming you’ve gotten bigger or smaller, I really can’t tell. Who pays that close attention to others’ bodies?!? You’re gorgeous as always though. I’m femme and my partner is non-binary and we are both fat so we always joke that you are J are our more-famous twins.", "alixmelton": "I love this. Thank you so so much ❤️", "rainbwfriend": "THANK YOU FOR THIS!!!!", "hakunamakeda": "This is a gorgeous photo ♥️ Thank you for sharing yourself with us!", "sheluxie": "I'm new here, but I think YOU'RE rad as hell!", "songforbaby": "Beautiful ♥️", "_monique_246": "Yaaas baby 🙌🙌😍💜❤️", "drvixenne": "You are incredible! Thank you for constantly sharing these gems of wisdom! 🙏🏼✨", "vegantraveleats": "You keep doing you girl. Their reaction to you living your life is a direct reflection of their deep unhappiness and insecurity (I know you know this already) but wanted to send some love 💕💪🏼", "modernvintageclassic": "Thank you for this. Keep being you, whatever size , weight, or fucking beautiful shape you may be", "tteixeira2013": "Thank you for showing it’s okay to just be- whether or not anyone else thinks it is 🧡", "tiffany_fetzer": "How did you get to that point? I obsess over it so much that I have turned into a binge eater which then turns into me hating myself 💔", "cheezermouse": "It saddens me that anyone would reach out to someone like that. I am so glad that you are standing up for yourself. I think you are amazing."}