{"vdelmonico": "Your story was raw but needed. I also liked how you reminded people it’s ok to feel how they feel. You were still respectful. Thank you for sharing.", "onealbracken": "She is way too cute", "lifeaccordingtokeeks": "I got stigmatized at the doctor on Tuesday and after I left the building, I had a panic attack where I couldn’t breathe. It was one of the most dehumanizing experiences ever. All I wanted was a potential solution to my ligament being repaired so I can have a quality of life- not a referral to a nutritionist. 😢", "_nobodyaskedforthis": "Xoxo", "thatnorachickonyt": "Sending love ❤️ I can relate so much to this. I've been treated like absolute shit by doctors because of my weight.", "erinnichole1223": "When people come at you with their claws out and teeth bared, it’s blatantly obvious they are being defensive due to their perception of the matter. But they don’t seem to be aware of their misperception, their reactivity is clouding their ability to think rationally, to remove themselves and their personal experiences from the topic of discussion. Seriously people, take a step back, breathe, calm the f down, open your mind, listen and contemplate, seek first to understand then to be understood. Love you, cous! Hugs! 😘", "saxitlurg": "I am going into the healthcare profession right now, and my oath to myself is to Be Different. I am so sick of how health care workers treat fat people", "mleczkomatik": "Cry harder, reality does not give a fuck.", "johnbrown5131": "Is a heroin addict in tune with their body? Is an alcoholic in tune with their body? Why would an (obvious) food addict be any more in tune with their body than another addict?", "yumzo": "Love providing healthcare for sick people, just not when they make themselves sick and don’t contribute back to the system ever.", "fatsnotfit": "So sorry that you went through this. Doctors are science and fact based and will never be able to understand that our \"feelings\" and our ability to just love who we are is what counts. Who cares how long we live? Science be damned, we have the internet to teach us what we need.", "catherinemlea": "I am so, so sorry.", "csbees.rescue": "Its harder on staff to move morbidly obese patients.. harder to find what's actually going on because of the high percentage of fat covering the organs. It is more risky for fat/ obese/ morbidly obese patients to be put under anesthesia because of the increased risk of complications. It's more expensive to treat obese patients because it takes more medicine and resources to treat them. Is that being biased? Not on the part of the Dr. They want to help you, but first you have got to want help yourself. You can love yourself but that means taking care of yourself and especially when you are entrusting the care of yourself in others.", "randallsixx13": "Why do you talk about going to the doctor so much?", "kingderrick215": "Very sexy 🔥🔥🔥🔥😍😍😍", "federica.rodi": "Anyway, weight could be a problem. Now you are young and active and it could be ok but what if this will cause you ilnesses like diabetes, joint pain, back pain, or heart attack (due to cholesterol)? I mean you can and you should be yourself but you need to be real too. What do you want? Then you can start. Ah and you don't need to count calories. That's a bullshit. You need to eat correctly, this doesn't mean be on a diet, this means learn what to eat, how and when. But the first place where you are fat is not your body, it's your mind. It's like you are a butterfly in its cocoon, you are protecting yourself 💗. Let go and spread your wings. Whatever you decide, I send you a big hug", "nas.ser91": "😮🌹🌷🌹🌷👏👏", "wayneaspe": "Big beautiful woman", "ahmedborham79": "Beautiful 🌹😘", "ptbh16202": "I want to see more skin 😘", "by_stilist_": "🔥❤️❤️❤️", "mahmoud.gilani_bandare.anzali": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😍😍", "losingmyself_08": "I dont think that a doctor telling you that your obesity is a high risk for you its fatphobia...... doctors are supposed to diagnose and tell us whats better for our health, he is not insulting you is just giving you a diagnose and the risks it implies...", "kate_radtke": "I’m so sorry that you were treated that way. ❤️ Keep doing you girl! 👏🏼👏🏼👏🏼", "therdnutritionist": "I missed your stories, but I’m so sorry to hear about your experience. Thank you for your vulnerability. Highlighting this completely unacceptable behavior is both important and unfair.", "dark.red.lotus": "💖", "gracecregann": "What happened", "mollymccarthy007": "I only saw what's left up on the stories right now, which isn't much. But I can tell it's awful and I HAVE BEEN THERE. I'm sorry you were pyt through that, and happy you're getting so much love and support right now.", "curvesbecomeher": "I am so so sorry you had to experience that. Because of my multitude of chronic illness and my recent Diabetes Type 2 diagnosis it has been nothing short of traumatic every time I knock on a doctor’s door. Holding space for you and sending you all the love. We do not deserve this.", "nickerbonk": "I walked in a new doctors office and the doctor asked me if I was always this fat. WTF is wrong with these doctors.", "_kaylanichole_": "Thank you for sharing even though it was painful. I like to think of myself as very self aware but you opened my eyes to a privilege I didn’t even know I had. I am so appreciative to you for that. ❤️❤️", "lacroix.mary": "It's sickening how medical professionals treat fat people. The amount of doubt and ridicule and lack of treatment all because our bodies don't fit onto some BMI scale (that has it's own flaws) is a massive problem that needs to change now. I'm so sorry you dealt with that and I'm so sorry you feel like you can't bring J with you. My heart breaks for you", "the_thrifty_business": "When i went to the Dr’s she automatically assumed my husband was fat. Her exact words were “is your husband fat too?” My husband is actually not fat. When I told her he works out and is muscular she kinda smirked and changed the subject. Dr’s are horrible to fat people. So when you have partners that are both fat it’s 2x the amount of horrible! There bias is now on you and your partner if you both happen to be fat. It’s just awful.", "michael_1484": "👍", "funkyflyy": "This makes me furious. I am sorry!", "wistfulthinkn": "I felt this so hard. I’ve been to so many doctors appointments and to the ER multiple times I’m just the last month. It’s taken a lot for them to take me seriously and I still don’t feel like they 100% do. I hear stories from thin ppl in my life who say they’ve gone into the ER with less symptoms than me and had a more urgent response. I try to ignore this. I don’t want to play victim I want to believe these doctors want to help me but it’s hard to do that when they can’t see past your weight. Now that I’ve had every “fat” disease test and proven it’s not a typical “fat” issue they’re showing a little more urgency but not much. It’s humiliating and unmotivating. I’m so sorry you went thru this and I hope you find a better doctor. Mostly I hope this doesn’t deter you from seeing doctors like it did for me in the past. Lots of love mama ♥️", "fragments_of_fi": "I hear you, I see you. Thank you for your vulnerability. You are not alone. ❤️🙏", "ephemeralquiet": "I am so sorry you had to go through that and fuck that doctor for making you feel less then and like you weren’t a real person with a real issue you’re still overcoming because you are fat.", "yourfriendmags": "I affirm and support every single feeling and thought you had and are having. But specifically here is a story from my life that affirms your experience: my husband is straight-sized and I started bringing him to appts with me for emotional support. I was shocked (duh) how much more traction he would get from doctors when describing my life and body. The oppression is real.", "mand0linn": "my heart hurts for you. so glad you've gotten a lot of affirmation and support through this 💕", "beckyjacombs": "❤️", "1_tea_1": "Lately I've discovered the power of the word fuck off. I recomend it! I have no more patience for morons. Some people trully hate fat people and they will say it to your face.", "irene.cobb": "I just watched your story. I'm so angry for you and sorry this happened. Thank you for being so raw and sharing your experience. It's so important to let our voices be heard.", "socalrd": "Sending so much compassion your way 💗", "cheyennegilstudios": "Sending you all the fucking love I can today.", "cynyounker": "Eating disorders are nothing to joke about (I also have one) and I'm sorry you received such awful treatment from someone who's sworn to \"do no harm.\" You are beautiful and you did not deserve that. <3", "arwengillett": "I am so sorry this happened to you and then I see all these comments from fellow fat folks who avoid healthcare despite medical issues because of our fear of how we are treated and many times misdiagnosed (ie. no my ear wax issue is not related to my weight) and it enrages me. I am not usually pro naming our health care villains on the social media, but it would be nice to know where the worst monsters are so we can avoid them.", "emilinecouse": "You should report that doctor to the medical board.", "gypsypirateleah": "I just saw your story and I am so sorry that you had this experience at the doctors office. No one should be treated like that and I’m appalled at the doctors behavior. My heart just breaks for anyone who has an experience like this. Thank you for sharing your experience even though it was painful- more people (especially those in smaller bodies) need to know that this happens and that it is completely unacceptable. Sending you all the love in the world ❤️❤️❤️", "sweetjaneland": "I can't stand that that horrible doctor put you through that abuse. You are a wonderful person and you deserve so much better.", "willebaere": "You are very good looking", "sportseditteam": "Thank you for being so open with your experiences 💕✨", "kellycoxsemple": "I’m so sorry you had to go through that. 🤗 Every time I encounter negative doctor situations (suggested weight loss as treatment for eczema, infection from a torn fingernail, poison ivy, sinus infection [all real]), I remember this so-not-funny joke:  Q: What do you call someone who graduates last in their class at medical school? A: “Doctor”  There are many (TOO many) practicing doctors whose medical opinion isn’t worth the paper their degree is printed on. Whose biases inform their treatment plan. And whose lousy bedside manner makes everything screechingly worse.  Too many of us fat folk have stories of how the medical establishment mistreats us, doesn’t believe or respect us, and very literally endangers our lives with thoughtless, callous, ineffective, and sometimes fatal treatment options. As a community, we need to learn how to effectively advocate for ourselves in the face of such dangerous ignorance, and teach and constantly support each other in that endeavor.", "kit.auner": "Best wishes to you, sweet soul.", "marieantoinettewasright": "How dare that doctor belittle you and the trauma you have endured. No doctor should ever make you feel this way. Sending positive vibes and I hope you can find a doctor who will listen to you and not judge!", "dispatchgurl70": "This pic is so beautiful and love your positive attitude❤️❤️ thanks on behalf of #anotherfatgirl with some Latina flava!!", "grasping_at_straws_": "Sending you love 💗", "hogwartswitch": "I cried listening to your story. No one should be denied proper health care. Over ten years ago I tried to get diagnosed with Pcos, for variety of symptoms I had. My Dr. at the time told me I was \"just fat\". So I ignored worsening periods for many, many years, believing I was \"just fat\". In 2015 I was diagnosed with stage 3 ovarian cancer. My oncologist tells me it was probably growing for 5 to 6 years at least. By the time I went to the Dr for help I was so sick that I couldn't ear solid foods and had lost 60 lbs in one month (now THAT was a shitty diet!), couldn't stand up long enough to take a shower, and basically felt like dying (and my oncologist said I was about a month from dying).", "shellyhassdenteufel": "I don’t generally watch stories but I just made a point to go watch yours and I’m so sorry you had to endure that doctor’s ignorance. So so sorry, like my heart is breaking for you. I have some understanding of having had restricted eating in my past and being lectured about my weight at every dr appt regardless what I’m there for and regardless of positive test results. It’s a terrible terrible feeling, you were absolutely right to call it dehumanizing. I wish doctors could understand, I wish they would treat us like human beings. You deserve so much better and I’m sending so much love your way. ♥️ Also, I hope J feels better soon!!", "tehini_cmt": "Your story moved me in ways I cannot explain. Thank you for being so raw and open about this terrible experience 🙏🏽", "sheluxie": "I've been in those shoes a few times myself. Sending hugs...you are still RAD as fuck! 😊", "bellz107": "I’m so sorry that happened to you.", "sarahdiane5": "I’m sorry you were treated that way. That is completely unacceptable and I wish doctors who behaved this way know how damaging it can be to a patient. You got GREAT test results back and for that I am glad ❤️", "spookycal_": "Corissa, thank you so much for sharing and sending you tons of love ♡", "fakebutokay": "So much love & power to you. Nobody deserves to be treated the way you were. You're an inspiration, a teacher, an icon, & just a rockin' regular human being. Sooo much love to you & your partner.", "lindsayofisher": "Thank you so much for sharing... Such reprehensible and beyond inexcusable behavior from ANY healthcare practitioner!!! I’m so sorry you had to experience that. Sending all my love ❤️", "jennabodenblogs": "I’m so sorry this happened that’s absolutely disgusting treatment. I can not believe that a medical profession who took a vow to do no harm believes this behaviour is acceptable!!!! Please stop apologising sweetheart you’ve done nothing wrong xxxxx", "iamyourruin": "The people who troll these kinds of posts for the express purpose of trying to drag others down are honestly some of the most pathetic individuals. Can you imagine having so much free time and THAT is how you choose to spend it? I pity them. You are lovely and full of light 💜😘", "haddiesjourney": "It's shocking and so saddening how the doctor spoke to you. Surely it would have been way more appropriate to discuss the underlying eating disorder you mentioned, having eating disorders from a young age.. Like asking do you still consider yourself to have disordered eating and finding out if there is an underlying cause so that you can work on that? And providing you with a service to slowly help you get your body moving like you asked, Weight is not an issue, but disordered eating is. You can be fat and healthy.. You can be skinny and super unhealthy.", "surfgirlsunshine": "I'm so so sorry that happened to you, it's so awful xx I'm a huge fan, having been following you're account for years now, and I just wish that everyone would treat people with kindness and respect always, no matter what they look like 💛💛💛 sending you all love and good vibes from the UK xxx", "deadlifts_and_redlips": "I’m so sorry you had to experience that. Sending you so much love 💗", "louise.g.millard": "Are you going to make a complaint against this doctor? I am so angry at the way you were treated. That doctor needs to be evaluated!", "martynkaxlis": "I'm so sorry honey 🌺💕", "fatgalhiking": "Make sure you write as many bad reviews as you can online for that doctor. I feel like reviews go a lot further than a complaint to a company that might be loyal to them.", "mizz_carter0613": "I love you girl you have helped me thru so much you have no idea! Thank you for everything you do and sharing so much with us! So many of us can relate!", "madalingiorgetta\nVerified": "Verified", "madocato": "The last time I went to the doctor, I was trying to tell her that my blood pressure meds made my legs and feet so swollen that it was painful to walk. Her response was, “well, diet and exercise is your prescription then. Because if you don’t lose weight, you will be on pills for the rest of your life.” The only other pills I was on at the time were my anti-depressants and birth control. Now, I am on nothing because that experience was so bad and I haven’t lost weight and am terrified of going back to the doctor. I’m so sorry. It is a fight for lives. I wish doctors could see that by coming to them, we are being proactive and scare tactics and BLATANT insensitivity are the opposite of motivating. We deserve dignity and respect and TREATMENT DAMMIT. I’m so sorry for what you went through. I’m just so sorry. ❤️❤️❤️❤️❤️❤️", "mycolorfulsquares": "💕", "nicolahaggett": "I am so sorry you experienced that - you did absolutely nothing to deserve it. I am hope you have support and are doing OK. 💕", "danielabellaps": "@rebeccascritchfield", "sarah.qq": "Take care of your health", "cryptosforthegirls": "♥️♥️♥️♥️", "jacobsunderpants": "Just watched the videos - what an awful experience 😢 I'd request to see a different doctor next time, save these videos and make a complaint! Because doctors shouldn't be able to make you feel less human and they should be held accountable for that! Sending positivity and love your way - you're inspiring and beautiful!", "nadsofry": "I’m sorry you had to go through that. I know it’s not easy but I’m also so so thankful that you shared this experience with us. Growing up I’ve always been bigger than the other girls and was even put in a weight loss program for teens at age 14 where they put us all on sibutramine (appetite suppressant) for x amount of months, do calorie counts and make us do workout diaries. I was actually a very healthy teen, i had no underlying health issues but because of my weight the doctors thought it was a great idea to put me in the program. I did started having headaches during sibutramine but everyone insisted that that’s “normal because of the pills” whereas me just being a fat girl was not. I hated that experience, and that experience have scarred me from hospitals ever since. I’m now 28, and planning to start a family with my husband soon and my mother has been on my case about losing weight else because she has her doubts that I’m able to house a human being in me when I actually have a healthy and very regular period cycle. Which is disappointing because she was the one who felt that I absolutely needed to be in the program as a teenager just so I’d look “normal”. Your stories took me back to that. But it also highlights the fact that we need to keep talking about how dehumanizing people for their size is rampant in the medical world and we’re perfectly within our rights to sought sound advice that doesn’t include a “If you don’t lose weight you’re gonna die” solution by incompetent and complacent medical practitioners. Sending you love and light, my love. ❤️", "chiyuki47": "Same stuff happens to my mum and Ive seen eating disorders and dieting fads,my grandma being really happy when I'd lost a couple kg (because I stopped eating wheat (I assume that was part of it + less bloated) but I also was forgetting to eat for a few weeks and oddly wasn't getting hungry so it's not healthy at all!), And how so ppl talking about weight loss/calorie counting, and the vs that some doctors spout for no reason, and Ive had many people walk past my mum and make jokes, ask their parents why her arms are the size they are, ask me if my mum was pregnant (innocent little kid was probably just hoping :) but eek), and recently my mum has missed a couple periods and her doctor assumed she was a pregnant lesbian but my mum hasn't been with someone for years, and they weren't discussing her sexuality/romantic preference at all. Heck. She's had test done for blood pressure etc and cholesterol, and she's fkn healthy. We have stroke and something else in the family, and she has sleep apneo, but she had that when she was younger. I'm sick of hearing that doctors have upset her by telling her that things will happen cause of her weight etc it's good to have even more awareness about it though. thank you for sharing. And I hope people are better to you", "marire": "♥️♥️♥️", "juudsfood_life": "Yes girl🤗 you are so beautiful! I love this picture and what you are wearing 😍👌", "jennypug88": "Sending you so much love! Good on J for pointing out that you are a model as well 😍 xx", "hillycooke": "That story! Makes me so furious at the ignorance, the fat phobia and the bullying. So sorry, and sending love to you 💗", "neus.oliveras": "I can't believe what happened. Being straight sized person I really have to thank you for sharing this story. I am so sorry. Sending you lots of love and hugs!", "elnegromagnifico": "I just watched the whole thing. I’m so sorry. Nothing infuriates me more than someone in medicine that isn’t understanding, at all thoughtful in what they say, or unwilling to listen.", "krg0131": "love ya 🖤 so sorry you had to go through that", "amalielee\nVerified": "Verified", "cathymorganforman": "When I was pregnant with my last child, I was treated like a high risk pregnancy due to my size, and was made to go through extra testing and monitoring. One nurse even told me that my child could die because of my size (26), which made me feel extremely guilty and depressed. Not once during that pregnancy, nor during my first two, did I ever have high blood pressure, high blood sugar, poor blood test results, or any signs of fetal distress. I was only put through all of it because I was fat. It really upset me, and made me feel horrible. My heart goes out to you ❤❤❤", "rileyaceofspies": "I just wanted to say that I have so much love for you and I’d like to tie that doctor to a windmill and also definitely have her medical license revoked but windmill first.", "curveekitty": "Some people honestly shouldn't practice medicine. I can't believe this happened to you.", "freddiemercurysmustache": "I’ve never forgotten every time this happened to me", "dkhateeb": "My heart hurts for you and the fat community. As a fat physician I am keenly aware of the fat bias that exists within the medical community. Medicine needs to do better. Physicians take an oath to \"do no harm\" and clearly the physician you met with has violated that oath.", "katherinekoroll": "I just discovered you today through a friend who shared your story and holy hell I’m so sorry for you experience, it’s appalling. Thank you for sharing and for teaching a deeper understanding of what many people go through. Sending so much love 💛💛💛", "makintigh": "Ooooohhhh hellllll noooooo. You find a new doctor. That isn’t ok. Please file a complaint with the office manager - that is no way to treat a patient. A doctor told me to “stop eating boxes of donuts” a couple years ago. I was in the office, similar to you, TRYING to be proactive and return to exercise. So sorry. I’m mad AF for you.", "mrsde3kids": "That was awful, sos prey for you x", "dn_yl1778": "🌹👏🔥", "the_meggo_": "That is so shitty. I’m so sorry. Also, know this: the way you share your experiences has changed my life and protects thousands of us from self harm. How? You remind me that in such situations the fault is not with me. For the first time in my life I no longer turn the anger inward. And that is in part because of you. Thank you. 💚", "bubblegum_bxby": "I am so so sorry you experienced this. Your story made me cry. I’ve had a dr experience like this and it makes me sick. No one deserves to be treated in a dehumanizing way just Bc of their body. You have all my support. Her opinion means nothing and if she ignored the results of your tests she’s clearly not even a good dr. You are a beautiful, strong inspiring person thank you for sharing your experience and being so vulnerable. ❤️", "youneedtoconsider": "Where can I read your blog posts?", "emilyrose_3212": "I am so sad that this happened and is happening! I had a wonderful primary care physician in upstate New York who understood my eating disorder recovery and never talked to me about weight loss and idk where she learned but I wish every physician could be as amazing as she was. I recently moved to Central Florida and have put off getting a primary care provider because of this very reason. Sending love and hugs 🤗 and hope that change is coming.", "emilieever": "Sending love and support and outrage.", "criedwolvess": "I’m sorry you were put through that. I don’t understand how some people can be so inconsiderate and lack sympathy for others and yet work in a field where they help and listen to others. I would have lost it, I would have called her out so fast on her behavior!", "wiccanhomestead": "I identify with you so much. I avoid the OB/GYN specifically because I don't want to deal with their crap. I was treated horribly last time & felt subhuman after leaving. I don't want to ever go thru that again. Thank you for being brave & standing up for all of us", "jlcan36": "I had this sort of experience with a female doctor once I was there for anxiety yet she proceeded to tell me how fat I was and I could “hardly walk..which wasnt true..and that “no employer will hire you because you are fat” which also isnt true ..she was awful I relate to how little you felt with this supposed doctor,and I am sorry it happened to you.NOONE should ever feel dehumanized when they are looking for help..and its ok to cry its human.PLEASE make a formal complaint about this doctor their behavior is not ok and you could maybe save someone else from the trauma you unfortunately experienced ❤️", "bbrant.oa": "@feararipe", "freja.vilja": "Last time I was pregnant, my doc asked out of nowhere if I know about carrot sticks and also brought the \"because you can't sit around eating donuts all day\" up 🤷🏼‍♀️", "hodayoga": "Sweetheart you are beautiful 😘 Thank you for sharing your experience I watch your stories and your crying makes me cry❤️", "dutchpalms": "Thank you for being so vulnerable and sharing your truly horrific doctor experience. I am literally shaking with anger on your behalf. Sending you all the love and strength I can ❤️ O", "strawberryeliza": "I had a bad fat phobic day too but it came from a little kid whose parents are probably teaching him those things. I am so sorry you went through this. But it did give me some comfort to know I’m not the only one facing these struggles. We’re not alone in this.", "doglady2018": "You ARE a model!! ❤️❤️❤️ With an amazing ride or die partner ready to slap a bitch for hurting you even when so sick. @comfyfattravels gets a hero bell today! Seriously though you are both fucking heroes everyday and I love you. ❤️😘", "o8seahag8o": "💖", "ashleysaskiw": "♥️♥️♥️", "alisonmonday": "Thank you. Thank you for sharing this horrible experience. Thank you for shining light on what many don’t know.", "_cilantropist": "I cannot imagine the courage to share your experience, but I am so glad you did. As a straight-sized person that wants to practice from a weight-neutral HAES perspective, it breaks my heart and infuriates me that some so-called professionals could provide such unethical and HARMFUL “care” (I don’t even want to call it care because it’s just not). Thank you for sharing your experience, and although I recognize I could never fully understand, I empathize to the best of my ability. You are so brave for standing up for yourself and speaking about these situations that way too often happen.", "auntiemegababe": "I was watching your story today and so angry for you ... you deserve so much better. I think what made me extra angry is the hand motions. Like could that doctor be anymore immature? I hope that your inbox gets flooded with suggestions of better, more caring doctors or med students whove learned that kind of bedside manner is inappropriate. No one deserves to have the emotions you had brought up from your history brought up like that doctor did.", "organicskytherapy": "🙏🙏🙏🙏🙏🙏💗", "rockoutwyoursocksout": "I literally have to prepare myself for savage abuse everytime I see a doctor-but i straight write that check and i can also fire that doctor! They work for me! I love that you share this! I wish all this fat liberation was accessible in my teens and 20s! Im sorry you had experience that. I straight tell them that my body is in homeostasis due to yoyo dieting my entire existence and im living my best life. My body knows survival- -im a goddess of wilendorf!😘", "aprilc2181": "Please find a different doctor pronto!!! Not all doctors are soooo unprofessional!", "kassidees": "Thank you so much for sharing your story, your life, and your experiences with us. You are doing such important work and YOU MATTER SO MUCH. I'm so grateful for you.", "fcampbell232": "So sorry, you were treated that way. ❤️❤️ you are loved.", "k.en.zo": "Can we possibly get a new doctor, like she was so unprofessional 😭 I’m so angry , sending you love 💜", "cassidiaah": "@fatgirlflow @comfyfattravels thank you for sharing this, I know how terrifying and scary it is to be this honest and emotional with the world. Your stories today were heartbreaking—yet so relatable as a fat person dealing with our healthcare system. I got so emotional watching this and remembering that I’m terrified of going to the doctor for these very reasons, and that so many others as well are terrified because of a world that treats us like we’re a problem. My heart is with you, and I have learned so much about self-love from you. So thank you, a million times thank you for sharing this because sometimes we all need a reminder that these kinds of experiences do not define us— no matter how terrible they are. you have so much love and support around you, always❤️🙏🏽", "jennybella16": "There is no way in hell that doctor shouldn’t be fired and licensing to ever practice revoked for the malpractice and unethical, cruel treatment you were given. I refuse to believe that in a world where everyone lives in a body, that this is the fucking best we can do. I mean to practice this way means to actually ignore logic based on a bias that was formed about how fat people cant be healthy. Fuck that and fuck that doctor. Everyone deserves to have accurate, inclusive, supportive healthcare providers that support people in whatever goddamn health endeavor or symptom of illness that we PAY them to help us with. If I’ve learned anything over the years, doctors are not authorities on your body and cannot make health determinations based on weight. Sending all the love. ❤️", "thirdwheeled": "Sending you so much love and support your way. 💜", "weightsnbakes": "That doctor sounds horrible. I hate that you had to go through that.", "brokefatgirl": "My heart is BREAKING for you. I am so so so sorry this happened. That doctor should literally be fired like tomorrow. I don’t care what her excuse is because there is NONE. Not one reason that makes what she said and did excusable.", "ennasusproject": "I just saw your story. I'm so sorry you had to go through that. That person should NOT BE PRACTICING MEDICINE! Jesus. I am so sorry. I hope you are able to find a different doctor. I know that's another uphill battle but wow. This is pure cruelty. You deserve health CARE. And that certainly was not it.", "eatassdiefastt": "I'm a fairly small fat person, i only weigh 275lbs. and yet even i experience fatphobia that makes me scared to go to the doctor. it sucks when i go to the doctor to get put on a migraine medication and she instead puts me on a fucking weight loss pill with severe side affects that just so happens to /also/ work for migraines. i cant even imagine how much worse it must be for larger people, and i hope you're doing alright after the horrible shit that you experienced today. I'll be sending positive vibes ur way. 💕", "tiffany_brook": "I am so truly sorry you had to experience that. Some Drs are truly the worst people in the planet. I am a fat person. I know it. I don’t need to be told that every time I enter a Drs office. One once told me I was the healthiest fat person they have ever met. Yeah. Ugh. 🙄 but I have since found a Dr. a gynecologist at that who gets it. He understands that there are issues women have losing weight. He has never judged me in this and has never once told me that I needed too. It is refreshing not to dread those appointments. You are beautiful and a model and need no validation from her. Sending positive vibes and love for you and your partner. 💜", "mollee_soo": "Thank you for sharing your story and for putting yourself out there and for verbalizing your struggles. When I started following more body positive accounts, I learned that I wasn’t alone in my battles with doctors and fitting in clothes and wanting to conform to that thin body image that is pushed upon us. When you said “I don’t care how long I live, I just want to be well”, oh man that hits home. I just want to feel good about my life and not give a fuck about what others think. But sometimes it just takes one word to knock me down and then start over. But that’s the key. Keep going. We’re all rooting for you ❤️❤️", "platyguin": "The number one reason I haven't been to see a primary care physician in YEARS despite having some of the best health care benefits. Your experience isn't the exception and its fucking horrible. ❤️❤️🦇", "benjamin.d.hall1": "A damm fine looking lady!", "msolberg28": "❤️❤️❤️", "jennyofark": "❤️", "stephalopuff": "I'm so sorry you were treated like absolute shit - I am so sick of doctors/healthcare providers being fatphobic and completely insensitive (that provider needs some training around patient communication along with patient history considerations, to start). I've dealt with a multitude of condescension and similar comments to those in your story ❤️❤️ It always adds a little extra sting when *everything comes back fine*/you're healthy.", "lexinimmo": "Thank you for being vulnerable with us and for your strength. I relate to what you’ve been through and it’s so fucking helpful to hear stories like mine. You are worthy and valid. You’re amazing 💖🙏🏻", "shellybo": "Watching your story broke my heart and made me so angry for you and for all of us. You deserve so much better. I’m so sorry. Love you.", "ctofine": "💙💙", "ashleyandhercat": "I have a chronic injury in my foot for 4 years and havent seen a doctor for it, for no other reason than because im fat and don't want to be dismissed. Im sorry the doctor put you through that. I dont know what the solution is to fix this problem in healthcare, but \"don't be fat\" isnt the answer. I feel you.", "maddiemaren": "Sick to my stomach watching the story. You are loved!", "mcarroll411": "Went through something similar. It’s an awful feeling. Sorry you went through that. ❤️❤️❤️", "notsolittlelamb": "If you put a douchebag in a lab coat or give them a badge or a pulpit or classroom or an office in a big white house---they are still just douchebags. Small minded. Pathetic. Stunted. Ignorant douchebags. Colour, ethnicity, education, election, religiosity or economics do not make a human being emotionally intelligent or intellectually curious or....GOOD people. I'm SO glad you had someone in that room to speak up while you gasped for air after the gut punch.", "qymerasage": "I'm really sorry you had to go thru that. It took a fat doctor to actually have a humanized app that didnt go straight to my weight and nutrition plans and shit. Fuck them really.", "katieh233": "Fellow fatty in Ed recovery. Sending you so much love and healing, thank you for being brave and sharing your story.", "samjoward": "I'm so sorry you went through that. Your story made me cry, but I am glad you shared it. Uncaring healthcare providers are the worst, and no one deserves to be treated that way. Unfortunately there are too many people in healthcare that act and think just like that. I hope you feel better soon, and I am glad that your test results came back good:)❤️❤️❤️", "thehighesthousewife": "Together baby! #fatgirlsrule", "_aldale": "I’m so horrified for you and ill about this. It’s JUST NOT RIGHT!!! 😡 This so-called medical professional needs to be called out and reported for ethics violations.", "raiuchka": "Damn. Thank you for sharing your story. I'm so sorry that your doctor engaged in that harmful, ignorant behavior.", "falkorajewelry": "I’m so sorry this happened :(", "amberautomatica": "God my heart just aches for you. I’m so sorry you had to go through that even after telling the doctor your history. Sending you love, babe.", "jessyhausner": "I am SO SO sorry this happened to you.", "debbibach": "I’ve been through the healthcare gauntlet as well and it is awful. I now have a wonderful physician who sees beyond my weight. I love her.", "fatbabetirade": "I literally cannot right now. I am angry shaking after watching that story. As a medical professional, I CANNOT even with fat-phobic doctors. It is such bullshit and I’m getting angry all over again typing this comment. You are amazing. You are the reason I started an Instagram to deal with my insecurities and I’m sorry someone made you feel less than today. Grieve this. Take your time. And then keep kicking ass. ❤️🔥", "cleestandish": "Just watched your stories and I am beyond ENRAGED at your doctor. And this is EXACTLY why I am absolutely terrified and wary of going to the doctor. Because heaven fucking FORBID that I ask to be treated like a human being who is asking for help. That's not allowed unless you're thin, amirite? Omgggg. So pissed for you. I am so sorry. Thank you for sharing this. I adore you more than ever and I am so beyond tired of all of us having to fight to be twken seriously because we aren't what society deems as \"ideal.\" Sending so many hugs while I rage. 💖", "nutellawithaspoon": "sending all the love 💛", "m.eg.a.nn": "Sending so much love ♥️♥️ you are not alone!", "jennyyy73": "Sending love ❤️", "brieinatree": "💜", "saruki.42": "I am so so sorry you had to endure all the bullshit today. It always baffles me when I come across doctors who are so out of touch with their patients. Like damn you went into how much debt to be this fucking hurtful? To better days 💚💚💚", "ohheykatiedee": "Thank you for sharing. I cried with you while I was watching because I could feel every single part, because this is my experience, too. And I’m sure for so many of us. Why is it this way? We have to keep fighting. Thank you for being vulnerable and showing the world a piece of what we deal with. ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ sending hugs. Good fucking riddance to that doctor.", "mombodspod": "I’m Enraged for you. I’m Here for you. I support you. 💙💙", "jackalope1984": "I am so incredibly sorry you had that experience. I hope you have the option of reporting that doctor and finding someone else", "xosroch514": "I'm so sorry that happened to you today, I wanted to cry with you ! Your an amazing person and you have inpisred me so much to be myself and not be ashamed of who I am, thank you for sharing your life with us❤ your an amazing beautiful soul❤", "joycouvlou": "I have been following you for a while. You are amazing!! Sending you all the love and support...", "divinecheshire": "I just watched your story and I send you all the validation in the WORLD for your experience and your story.", "kristieep": "I’m the last person to disrespect doctors and nurses but fuck that doctor.", "cafe_johnsonia": "Sending you so much love! I cried while watching your stories. Been there too often myself. It’s the reason I’ve gone back to school to become a doctor. Literally every woman I know has been fat shamed by a doctor and I thought, “What the hell? I’m gonna do this and try to effect change.” 😘", "vickyekoz": "My god. I am so sorry this happened to you! You are such an amazing human and you DO NOT deserve this behavior, no one does! You and J both have helped me with accepting my body and even being proud of my body. I’m SO over the scare tactic bull shit! I wish there was a way I could take your pain away!", "laetermichelle": "So sorry that was your experience! My heart goes out to you! ❤️", "fairiesandfancies": "Im proud of you for talking about it. My bestie has shared some horrible stories and I have my own about being treated horrible by doctors. People need to realize it can cost a fat person their LIFE.", "countess.of.blood": "❤️❤️❤️", "giacat3": "💜💜💜 . You're so amazing", "daigle.bagel.cream.cheese": "I know exactly what you’re going through. Sending lots of love ❤️ Every time when I go in for something a routine as my birth control shot or flu shot they ask if I have PCOS symptoms, depression, do I need blood work for diabetes and this is literally every time I go in. Yes I’m fat, yes I have a medical condition that contributes to it but honestly all I needed was a flu shot. #immorethanmyhypothyroidism#immorethanjustmyfatness", "whitneywaythore\nVerified": "Verified", "kierajwilson": "The impact of your life is far more important than the length of it. I think I speak for thousands of people when I say - your life has an immeasurable worth because of what you’ve done for your community. We love you. I’m so sorry you had to go through this.", "wordssave13": "You deserve so much better then that dumb fucking doctor 💜💜💜💜", "courtneymarielane": "Thank you for sharing and know that your apologies are never necessary when crying or when telling your truth. I hope you find a doctor worth your presence and trust. ❤️", "birchsalondenver": "I am overweight as well and binge eat. I consider that an eating disorder. I feel it is anytime you are not in control of what or how much you are eating, and it affects your body negativity. That being said, a Dr should never push themselves on you like that. They are there for guidance when asked. Not to be judgemental. They can give results and tell you what to expect.", "redlipchic": "😘😘😘", "chantelleroy": "Sending you love and positivity. It was so hard and triggering to watch your story but it's a fat person's reality. You are more than your body and the way you move it. You are more than the food you choose to put in your body. And not being able to take @comfyfattravels with you is bullshit. They are your support system and they deserve to be there as much as any thin person. Fuck this \"doctor\".", "alyssa_bartz": "Oh Corissa, I have been in your shoes and I am so incredibly sorry. I actually haven’t been to a doctor aside from urgent care, in years. I am terrified of what they will say to me now since I am much heavier than I was last time I went. I was told I was fat each and every time I went to the doctor from a very early age and after years of hearing that I decided I just wouldn’t go anymore. I am fully aware I am just hurting myself by not going but I rationalize that by telling myself it’s the only way I can protect my feelings and mental well being. It’s absolutely appalling that we don’t receive the same level of care or the same basic human decency that a smaller person receives. We live in a disgusting world where all of our issues, even when we are proven healthy like you were today, must be because we weigh more. I am so so sorry this happened to you today. I have never had an eating disorder so I can only imagine how horrific this was for you. You are strong, smart, beautiful and worthy of happiness and the best care a doctor can provide. Thank you for sharing this story with us. I know it wasn’t easy. ❤️", "_christiewhite_": "sending you all the love!!", "totoatoz": "I am sorry you were treated so shitty. I wish doctors spent their time being supportive instead of tearing us down. 💗", "bodlibkc": "💜💜💜💜💜💜💜💜💜💜💜💜", "belangeah": "I am so sorry you were treated like this. We hear you and respect and appreciate you. Thank you for sharing this experience. ❤️", "jessandhen": "i'm so sorry you had to experience such callousness. the doctor sounds at best completely tactless and i really appreciate your willingness to be vulnerable and share with us.", "jociemj": "❤️❤️❤️❤️❤️", "theselemonstho": "✊❤️", "meganb1226": "I'm so sorry you experienced this... Sadly I can strongly relate to everything you said. But it also reminds me I'm not alone and that my experiences are valid, it's not just me being dramatic or overreacting, or being too sensitive. Lack of empathy from providers is so, so pervasive in the medical field and is harmful af. I am so thankful to you for being so open and vulnerable, our voices and truths need to be spoken and heard ❤️", "spaced_out_rae": "Holy shit been there so many times. Just watched your stories.. and just hit me right in the fat gut created by diet culture and all the crappy doctors who gave all the shitty advice that had me bouncing from diet to diet to eating disorder to another eating disorder. My endocrinologist that I see for PCOS just finally stopped being a dick after explaining (what feels like the hundredth time) about my history, the level of stress I deal with on a daily, lack of sleep, depression, etc.. after a fucking year. Report those shitty doctors to the state's medical board and whatever group they work for. We all deserve actual medical care, and what was said to you was not medical care. I hate people. I hate this happened to you, and continues to happen in general.", "rosie_petrichor": "Tomorrow I’m co-teaching medical students about how to take patient histories. Best believe I will be including examples about weight stigma!", "suzysenoia": "@fatgirlflow big HUGS from Georgia. Love you bunches sweetie. I too have an eating disorder and would never wish it upon anyone. And also have depression and fatigue from anemia. What else? I have always not liked myself. Just wanted to send y’all love and string, positive vibes. Continue getting better. I wish I had a partner to be there for me everyday but I’m alone.", "maitycakes": "@fatgirlflow sending you so much love ❤️ thank you for being willing to be vulnerable and share what happened to you today. You are inspiring to us all", "veroushka22": "My heart is with you! 😘 Just because we have a mouth is not a reason to say whatever goes on ours minds without showing any empathy", "eye_luv_pez": "🧡🧡🧡 No one deserves to be treated so poorly, especially by someone who is supposed to be there to help. Last time I went to my GP was to get a new referral for my fertility specialist. She made me stand on the scales and then suggested stomach sleeve surgery, like it was nothing. Like she was suggesting a nice place for a coffee, not life altering, incredibly intrusive and expensive surgery. It’s like “seriously, just print the referral and piss off”", "eastcoastfa": "Its borderline unethical for doctors to put undue mental anguish on you and J. The doctors are just parroting what society deems healthy and also most likely taking money from diet lobby and speaking engagements therein. Hopefully the tide turns soon and they will be no more bullying of fat people in doctors rooms. Hugs your way ❤️", "jem.nason": "First-I fucking love this picture! 😍  I just went to check your stories, and...oh god my heart. I have no profound words to share, only pure, heartsore, unflinching support and love. This is inexcusable, absolutely. I really hope that you’ll feel strong enough again to take the person YOU want to your appointments with you. The person who makes YOU feel good. Love to you. So much love. ♥️", "aniriot": "I support you and this post. that is some fucked up horrible bullshit that no human should have to endure. 💜", "exercise_at_my_size": "Just watched you’re stories, I’m sorry that that happened to you. It sucks that so many of us fat gals have had a similar experience. I now have to bring my very very thin husband to doctors appointments for “backup” on the things I say which is just...insanely sad and wrong that somehow he is automatically believable because he weighs 145 pounds vs my “untrustworthy” 270. I also love this picture of you. As I was scrolling I saw it and simply thought “beautiful”.", "chell.jpg": "I'm so so sorry that you had to deal with that. Doctors need to be able to LISTEN to their patient's concerns or not be a doctor at all. But based on those gestures they were making, they need to learn to just be a better person bc that is so rude and inappropriate and def not professional.", "plath63": "Wow. That was so hard to watch —- because I have been there and feel like I understand how you are feeling. It’s disgusting to be treated and talked to like that and I am very very sorry you went through that.", "sydneyamaris": "Thank you so much for sharing ❤", "hancmayhew": "I just watched your stories and couldn’t help but think of my own similar experiences. I’m so sorry you had to go through that. Thank you for talking about this, I know it’s not easy. Especially when there are plenty of people who are on the internet with the same mentality as that doctor.", "blcktinabelcher": "I’m so so sorry that this happened to you. That’s a massive amount of bullshit. My heart aches for you. Can you report that doctor? Like that person shouldn’t be practicing medicine whatsoever.", "caseylane031602": "I'm so sorry about what you went through. But thank you for sharing your experience. Hopefully it helps open people's eyes. Also, never feel like you have apologize for crying!!! ❤️ Real life involves lots of tears. Sending you lots of love.❤️", "snot__face": "Glad I didn’t message then cuz I wanted to! So I’ll just leave this comment... thank you, I love you", "scarebear146": "Sending so much love because your amazing and that doctor can eat a sack of crap. ❤️ Just dealt with a fatphobic doc last week and I want to shake these guys and be like “Can you hear what you’re saying because you’re being awful.”", "iamcathryng": "Thanks for sharing today. It was a tough day for me too, and it was reassuring to know that I'm not the only one who is still being hurt by this shit on the daily and that, as a community, we have each other to lean on. I hope tomorrow is better for you than today has been.", "natalie.is": "Just watched your story and am crying and also fucking furious. I’m so sorry you had to go through that. So so sorry *hugs* ❤️", "fayeluna728": "You are amazing 💜💜💜💜", "angellinha.alves": "Eu não consegui entender o assunto por causa do idioma. Mas seja o que for, te desejo o melhor que há. Você é muito linda além de tudo", "sarahmikayla": "Just watched the story - heartbreaking. It also makes me mad as hell! I hope you are someone else reports her!", "ieriepierie": "Lots of love from The Netherlands 💕", "funnytooloud": "This is an absolutely stunning photo ❤️", "adrienne_laura": "Thank you for making light to something that happens every day. I don't know any fat person that hasn't dealt with this at some level. We are all fighting everyday. We have to celebrate the wins we get. I appreciate your spirit so much. ❤️", "croyster912": "You look like a goddess in this picture. Like one of those old timey ads for olive oil", "mypetdevil": "I am so so sorry. I dont have words. I'm just so sorry.", "larsyfarsy": "Girl girl girl, was this in KC? Like half my relatives are doctors there, including a cardiologist at KU. 1) I want to know who this %#+%#@*% is and 2) let's get you a wonderful new doctor!!!!! 💜💜💜💜💜💜💜💜💜💜💜💜💜", "nadiabokody\nVerified": "Verified", "emma_p_pinder": "THANK YOU 💛i have recently had my first negative experience regarding my weight and healthcare!! My GP actually has zero ocncerns for my health, doesnt believe in bmi and treats me well, but i was recently refused care at a hospital, while 5 month pregnant due to my bmi!! I cried for about 3 hours after and it makes me want to be even louder, because of they're doing it to me then theyre doing it to others!!!", "yourmotherwearscombatboots": "I just read and listened and watched. Fat is not the worst thing a person could, not even health wise. The medical community needs a hardcore reality check with how badly they treat fat patients.", "slugpug": "I so appreciate your vulnerability. Sending lots of love", "thehollylaine": "I’m so so sorry. Please fill out the survey they send you or contact whoever runs that practice. They take the surveys very seriously at my hospital system, so hopefully they will there too. My heart is breaking for you and every other fat person that doctor treats.", "definitelynotlaney": "My doctor threatened to stop treating my disease if I dont undergo the hospitals weight loss courses which leads to having stomach surgery. He says by me not losing weight I'm purposely making self worse and staying in pain. I dont know what to do honestly. I go oct 17th to my first class.", "dani.the.viking": "So much to love about this photo ❤️ thank you sharing your story today", "suewickson": "(((Hugs))) I have had very few supportive doctors over the years. I went to a pulmonary dr for my asthma and the first thing he did was hand me a brochure for a weight loss program before even asking why I was there 😡", "rhondastarks": "I’ve experienced bad doctors everywhere. My son had a very difficult case which had strange symptoms and you can’t imagine the number of doctors that just want to medicate and get you out and onto the next patient. Finding someone who truly cares AND knows their stuff is rare. This story broke my heart for you girl and I’m so very sorry! ❤️", "greenekangaroo": "Okay but wheres the office inquiring minds that are handy with butane torches would like to know", "ae.roberts": "I was a size 12/14 in the hospital at age 24 with an insane gallbladder rupture (something that had never happened to me before ever, never had gallbladder issues in the past), on my way to get an ultrasound to see if I needed emergency surgery, and the attending doctor said that I was faking and that it was because I was fat. This was after a lifetime of disordered eating, as well as a lifetime of PERFECT HEALTH. I almost checked myself out of the hospital to go home to die. I still regret that I never complained or used my voice to advocate for myself - meanwhile my gallbladder was spewing bile into my body, poisoning me from the inside out, and had absolutely zero to do with the fact that I was fat.", "sh.allen": "I’m so incredibly sorry you were treated this way and I know how badly it sucks. I hope you’re being gentle with yourself", "sarahbright79": "That doctors comments were horrendous and one of the reasons I personally avoid going to the doctor. Because I know I’m obese and I know they’ll comment on it. I’m sorry you dealt with that bullshit today.", "claircampbell46": "Just wrong when you are fat doctors feel like all problems are because of this fact. Could literally go in with a broken arm and they would tell you to lose weight. Pisses me off. Hope your ok 😙", "ohkraylee": "💗", "rassat88": "Your story was so heart wrenching. I’m so sorry you had to experience that. That doctor should lose her damn license. She is unbelievably uneducated.", "andimjulie\nVerified": "Verified", "cgrimm": "Yasss girl! You’re more inspiring by the day. I went in for increasing depression and suicidal thoughts (had to have a referral) my doctor, I SHIT YOU NOT, gave me three Netflix suggestions to watch and told me to sit in the sun more because “obesity is connected to depression” BITCH, IVE BEEN FAT MY WHOLE LIFE, this wanting to kill myself, THAT, THATS NEW... lets handle that maybe. 😒 two years later, I STILL HAVENT RECEIVED A PSYCH REFERRAL... but I know what diet plans my insurance covers and what Netflix shows to watch to “motivate” me to eat better. I’ve been a vegetarian for 13 years... Sorry, end rant. I get it. I get you. You are doing amazing", "jamie_jetaime": "So very sorry this happened! I also HATE seeing drs. I actually avoid even though i have known major health issues. 💖💖❤️", "shesjustbeingashley": "It is not the first time. So many of us have been there and it’s complete bullshit. I am so sorry you had to experience that! This doctor should be reported to your insurance company. I hope you never go to them again!", "hejhejnatalya": "I just watched your stories after seeing this post and wanted to add my support. I’m so sorry to hear you had such a terrible experience.", "fatgelfling": "literally just cried watching your stories holy shit. i hate how we all have to be on the defensive and constantly advocating for ourselves when our doctors should also be advocating for us to be as happy and healthy as we can be.", "goddessvenusflytrap": "I am not a fat person but I’m overweight and I get this treatment too—I have extremely low iron and a blood doctor told me to lose weight....to make my iron....higher......? Which would do the opposite really... it’s frustrating and being a woman on top of all of this—no one believes us in any context. I’m sorry you have to go through this, I hope you find a kind doctor who looks past your weight and J’s weight. Love you. Sending hugs. 💝", "fancy_tomboy": "I’m so sorry this happened to you. This happened to me twice. I stormed out (made a whole scene) and reported the doctors. I’m sure nothing was done but I did my part.", "teejcee": "Much love and hugs ♥️", "leftcoastlady": "💗💗💗 Thank you for sharing your story. I hate that this happens so much. The medical community needs to do a better job at empathy for a lot of communities who don't fit what they consider \"normal.\"", "danielle.bex": "Thank you for sharing. Sending you all the love. 💕 I'm so sorry the world is shit.", "palegingerpear": "Hugs... I’m so sorry you had to deal with this", "gendertroubled": "you’re saving lives by living your truth. fat-shaming shit doctors will never know how deep your river runs. this fat babe is so glad you’re here and so grateful for all the heart work you do to stay here. ❤️", "kayla_bunnie": "Everytime I go to the doctor they always have to make it about my weight. I hate it...it’s not my fault I have PCOS and it makes everything much harder when it comes to weight loss...they always assume I eat a lot and assume I’m not trying... How about instead of assuming they listen to what I have done and try to help instead of get mad when I’m not as skinny as they want me to be and then fat shame me...I cry every-time I come home from the doctor because of all this shit...I HATE seeing a doctor...😞😞😞", "femme.supreme": "Love you a million times over my cosmic soul sister 💕💕💕💕💕", "jmackabitch": "❤️❤️", "retropinup1980": "Love you.💙❤️💜", "andersonrangelvital1982": "Lindaaaa❤️😍🌷🙏", "benourishedpdx": "We are holding your story tenderly. Hoping you have lots of comfort and care after such a display. Thank you for sharing so vulnerably ❤️❤️❤️", "juliegazuli": "I watched your stories today in horror. I'm so sorry you had to go through that. Fuck that doctor!! I am dreading an upcoming appt myself.", "hannahisdead": "I'm so sorry that happened to you 💖", "nicknack518": "Thank you ❤️", "katherine.agnaarsson": "Thank you so much for your stories today. Seriously.", "thegayseawitch": "Thank you, thank you, thank you. 💗", "loa_qween": "That so called \"doctor\" is a piece of work. When I hear and see that this happens, I'm so grateful that my doctor is so chill and never brings up my weight. You're awesome! 🙌💜", "plussizepioneer": "Sending you all the love ❤️❤️❤️"}