{"mpbb_": "Wooooow😍😍😍😍😍", "samleonetti": "Your little thigh tattoo 🤩🤩🤩🤩", "silly_acrylics": "@fatgirlflow Thank you for showing belly self love. I'm happy to be a part of the #bigbellycrew with awesome women like you.", "fostermamaeva": "Cutie pie❤️❤️", "theadventuresoflittletom": "That is a ROCKIN’ Sternum piece, my friend!!!💜", "oldatl63": "@slimgahzillionaire", "negarrison06": "So much YESSS! Mass high fives to you, your self love and the impact you have on others!!! Big bellied beauties are just as beautiful as every other curvy voluptuous plus size body shape!! Keep being amazing!! #uncagethetum", "moonprismp0wer": "I got a “me” tattoo after seeing this. Love it so much ✨🦄", "fjrjfj949525jdjd3": "❤️❤️❤️❤️❤️❤️", "ispyabrownbair": "So gorgeous💗", "snoozindusan": "You are so brave!♀️", "danielledanner932": "This is way too cute. Stop it rn!", "julie.a.wheeldon": "All I see is a beautiful and happy smiling lady xxx", "lepperjesse": "Simply beautiful", "winedivatiara": "Yaaaas hunty werk!", "plush_illustrations": "you have such an amazing smile :) I only found out about your instagram a few days ago, but you have a great account!", "sorensen6358": "Dødlækker hængemave med dejlige strækmærker 👍✌💋💋💋😘😍", "evelynsmom222": "@tjstudy3125", "joenessnyc": "Sooo cuteeee", "alirezashafiee1355": "💋💋💋💋😘😘😘👍👍👍", "tajudin_javana": "❤️❤️❤️", "muratartirir": "🇹🇷🌷💞🌹🇹🇷", "byhandscreenprint": "Nice I like it", "mahmoud.gilani_bandare.anzali": "❤️", "zoe_mitch.19": "I absolutely adore your confidence! I aspire to have that much confidence in my lifetime", "thorenstein": "I have so much admiration for your ability to love self. My acceptance of my belly has been a life long struggle. I'm just too tired to continue hating my body for the rest of my life. Here's to one step at a time.", "tatudemommie": "I love all of you but especially the sparkle in your eyes😍", "raspberryjorts": "yeehaw!!!!!!", "taylorlynnekelly": "It’s refreshing to see someone with a body that looks damn near close to mine. Struggling at 29 with loving myself and seeing you do it is absolutely beautiful ❤️🙏🏻", "taylalalalor": "Love that hat!", "nigeria511": "Those people who see the beauty in you when you can't see it yourself.😍", "iambekahboo": "You are so very beautiful! 💗", "sfbaseballlover18": "You are beautiful. The worrds that came to my mind when I say this pic were: soft, smooth, inviting to touch (consentual of course and not sexual, but purely from a tactile perspective). And the way your face glows is amazing", "thegigidrip": "Much love ❤️❤️❤️❤️", "amberricelmft": "I love this. Thankyou for sharing your beautiful photo with us!", "stylinity": "Your style is stunning! We'd love to feature your amazing looks on our shopping site and other media channels (Instagram, Facebook, Twitter, etc.) so that more people can shop your looks. Reply with #StylinitySquad if that's a yes from you and visit https://www.stylinity.com/general/termsofuse #StylinitySquad for T&Cs ❤️", "bloody.berry": "when i first saw a photo of you i was so shocked because i have the same figure, and i didn’t know how to love myself yet. thank you for being a beautiful inspiration, and for guiding me towards loving my body—- big belly and all 💖", "shesjustbeingashley": "Good for you! It makes me feel like I can do it too. Posting things like this makes such a difference for so many people.", "cherrythecheesecake": "Oh man this is so gorgeous I can't even!!! 🙌❤️🔥😍", "madetobebee": "YESSSS 👏❤️", "boredrom": "Confidence is sexy", "thatwiseboy": "DAMN you’re radiating 🔥", "jessicarabbit909": "I can't even look at myself in pictures 👏👏👏", "icelebratestretchmarks": "- art. ❤️❤️❤️", "musbnyc1": "I wish I was that brave!! People say I have a cute face... like what about the rest if me!!! @fatgirlflow", "nicotron3000": "At an unusual loss for words. Thank you for this beauty in which I can see my own reflected.", "bnmlove25": "Sexy🔥", "kimmehjean": "The tattoo on her leg 💘 😍", "alextrex86": "Holy cow, you look disgusting🤢", "schapman1969": "🔥🔥🔥🔥🔥🔥🔥🔥🔥👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "yay_its_carol": "I just love this photo ❤️ it makes me look at my big belly differently. Thanks babe 😘", "louisekwame": "This is me!", "arcoirissa": "You look so darn happy. Belly is cute too but that look on your face is everything!", "survival_of_the_cutest": "You are stunning, and this photo is so important to me. I never fat girls with bodies similar to mine, and I struggle with feeling like if I'm going to be fat, I need to be proportioned more similarly to other plus size women I see. This is the first time I've been able to see how insanely gorgeous a body like mine can be, and the first time I've felt normal and included in a long time. Thank you so much for this ❤️", "thenaturalselector": "I'm not to this point of confidence yet but you are so inspiring I might be brave and try. I get so down on myself that I don't look like the advertised plus size women when I'm naked because you can't see my body the same way. I might not look like them but I'm just as beautiful and so are you Corissa! 😘", "lamaido1": "Love your belly ❤️😍❤️😍", "luckyzillacomics": "HAT!", "paintchipsfromthewall": "You’re radiant 🎉", "em_bot_9": "This shot is gorgeous! Brimming with confidence and joy, all that natural light reflecting off you. I plan on getting a chest piece in the same spot. Who did yours and did you cover your breasts while getting it? I’m a little nervous about this part.", "songbird9279": "I wish I had this kind of confidence.", "dollykamdarkhokhani": "I have a stomach just like yours and i feel the same", "rainbowequinox": "Where’s your bra from?", "dn_yl1778": "😍😍😍🌹🌹🌹🌹", "katiedeluxebbw": "Cuuute pic 🔥", "michael_1484": "👍👍", "hjwdewit": "Wow, sexy girl! 😍", "thatnorachickonyt": "So inspiring 💙💙", "stripeycat": "Thank you. You are amazing. I want to be able to see my C-section overhang belly and not hate myself one day 🌟", "my.courageous.life": "When I look at this photo I see an incredibly beautiful woman who is carefree and fun. The hat is bomb AF!! And your hair looks amazing!", "missblisswow": "You are beautiful 😘💖 I’m still having body issues at fifty, you are an inspiration!!", "fredericwhatelse": "So pretty👌", "raymondsmith83": "Hello beautiful", "raciray": "I love you!!! 😍💗", "mindset_v_perspective": "Seeing happiness upon your face highlights your beauty and sexiness", "victoriaforthemasses": "You’re an inspiration to this sister of the BIG belly crew. Your journey of growth & self love is awesome.", "jose.miguel.rojas": "Delicious. 🖤", "nicolettemason\nVerified": "Verified", "shellyhassdenteufel": "Love that tattoo!!!!", "slime_osu": "This motherfucker smashed my city", "mythicalmae13": "WOW your stunning😍🔥 Makes me feel so inspired. I wish i was that confident with my body. I need to learn to love myself more.", "shalala1672": "I want your confidence, I'm working on it but not yet where you are!", "fatfeministmich": "You are so wonderful ❤️", "shamelesscurveloi": "Cute 💯", "maryang81": "Beautiful 😍", "manavshail": "😘 beautiful", "brandongist28": "Nice belly", "wilburandnizzamyhre": "That ME ❤️ tattoo is so tender. ❤️❤️❤️", "kendrakantor": "Not only do I love you for sharing your body for those of us who struggle to love our own...I love to see tats on big belly people! I keep thinking about getting a sternum or side piece but feel so worried about how it looks.❤ yours is beautiful!", "shotgunwitch": "❤️🔥❤️🔥", "princess_kingdom": "You look beautiful 😍", "wild4you4ever": "❤️❤️❤️❤️❤️❤️", "trayteerig": "🔥🔥🔥", "lianabethw": "your confidence has forced me to look at myself differently. You inspired me to finally get an upper tummy tattoo at the end of the month 🖤✨🙌🏻☺️", "yesthishere": "Our best us always shines brightly ✨", "benjamin.d.hall1": "I love the curves and the tattoos! Pure beauty!", "lokobueno": "Naw that is fantastic u somebody who like it", "d_ay_d_ream_ing": "Seeing you owning it has made me start seeing myself differently thank you", "lovingallcurvywomen247": "🔥🔥🔥🔥🔥🔥🔥♥️♥️♥️♥️♥️♥️", "sheluxie": "I'm always hiding my belly, super self conscious of it...teach me your ways!!", "iitzel97": "Slowly, but surely I will get to this self esteem level 🤞🏽❤️ I love seeing this on my newsfeed! #PlusAllTheWay!", "remember.felix": "Fucking perfectionnnnnnn you are 🔥", "chefmom4923": "Beautiful", "aiden.the.phoenix": "@peanut3731 This is who I was talking about.", "jenelleybeanszucs": "Your smile seriously lights up this photo! You're fucking gorgeous girl! This photo makes me feel better about my belly! (I have a similar overhang thing going on)", "3wildflowermama": "You are beautiful. And you remind me to take a step back and look at the beauty in things", "bbcrazypraise2": "YES HUNNNN", "kelliclash": "@fatgirlflow I love this picture. It’s so raw, real, and beautiful. ✨ PS 🖤 your chest tattoo", "ae.roberts": "Lord, do I feel you on the “ill fitting bra” - post baby, this bod will never be the same & trying to relearn how to love it has been a process. One step forward and three steps back ❤️", "datarikitariqat": "May I ask who makes your bra/do you recommend? 😬😍", "bonitaaaa23": "Wow I really needed to see this. I have been embracing my belly button not pulling and tugging on my shirts and blouses , tanks when I'm out . Lately I'm like fudge it Idc anymore . This is my body and my belly and it ain't going anywhere . For long time I was ashamed of my body and how my rolls looked and skin hanged . People would tell me I should wear shapewear even at home , at first I accepted it . Then questioned why I should do that . I appreciate you sharing this , helps me so much to see a body that looks like mine 😍", "thrilled_to_be_me": "I love this!!! ❤️", "beckywaldmann": "You are gorgeous", "strolling_through_on_a_cloud": "Could you be any sexier???", "emmigizo": "I get that so so much. I feel very at ease with ME when I see I'm not the only woman with a belly. Thank you for that intimacy. You're adorable!", "belovedbridges_mrs": "Omg you’re so adorable. This is everything", "venustusphotos": "We have the same awesome belly!!", "dawnniiee_": "I wish I could feel this way about myself I am trying but it just isn’t happening :( and it’s effecting my marriage 😢 he sees nothing wrong with me it’s not him it’s me😢", "valorandmyrrh": "I totally struggle with my tummy. It hung before I had 2 csections 13 months apart but now it’s worse. I struggle to be positive about my body because I just feel so damn unattractive but you look so happy and fierce in this photo! It’s encouraging to me.", "redefining.wellness": "@lauren.arrow ♥️♥️", "goldengoddesscreations": "What a gorgeous photo of your belly 😍", "coco_penexplore": "You inspire me SO MUCH! You are simply GORGEOUS....here and always! 🔥😍", "honeypositano": "Incredible!", "amytatton": "You’re so beautiful!", "callalilly2": "I'm not this confident yet....working on it.", "fer.nanda.guedes": "I fucking love u. My body is similar to urs, and my belly always bother me, you are helping me so much in the process of loving my body, thank u girl 💖you are amazing", "juliakrisla": "❤️❤️❤️", "the_marigold_kitchen": "😻", "duffneyryan": "😍 adorable", "tjc2193": "😍😍♥️♥️♥️", "sophieezhno": "❤️❤️❤️❤️❤️", "jamezriot": "You real pretty", "underneath_we_are\nVerified": "Verified", "supersonicgay": "You are so beautiful, I could actually cry!! What a goddess 💕💕", "the_thrifty_business": "Cute as a button. And That hat is everything!", "itsmekellieb\nVerified": "Verified", "leann.elizabeth12": "Love love love - you look so happy!!", "miss.heidi": "You are such an inspiration!! Thank you", "vineyardwickandbath_": "Beautiful", "jennsvach": "💗💗💗💗💗💗", "yamalo17": "Yesss I always felt the same way 😭😭❤️!! Love this 😭❤️", "mcneil.jennifer": "You are luminous!!!!", "angwdbs": "Need this today!✊🏻", "querencia_seeker": "@fatgirlflow THANK YOU FOR POSTING THIS!!! I have the exact same belly. I am a confident woman, feel sexy and beautiful, but I always wish my belly was smaller. It's really the only thing I'd change if given the option. Plus size models never have big bellies like us. Sexy, curvy women in the media, music videos, etc never have big bellies like us. I often feel that people say curvy women are so sexy up until they have a big belly, then it's like we're no longer sexy. It's heart breaking. Thank you for showing that us ladies with big bellies are Sexy too!!!!", "callmeandee": "You are seriously amazing, I’m crying 🥰 that belly 🙌🏽 that smile 🙌🏽 I’ve never felt represented this way, thank you 🎉", "kimberly_722": "So 🙌 for the body positivity! Something I struggle with. But can we just talk about your smile for a minute! You're energy is so infectious!", "tiny.lantern": "thank you so much for the ways you share. your belly is gorgeous.", "teresajayy": "I've never seen someone who looks like I do... this has really helped my low self esteem. You look beautiful, as always. Thank you for showing me someone who looks like me. ❤️", "kyla.rose": "😍❤️😍❤️😍❤️", "catastrofae": "🌟", "jenny.fbt": "This picture and the caption, are the best thing I had to see today so far. You're stunning and inspiring. Love you🖤👩🏿‍🦱", "hey_requena": "You are REAL! I love this! Because you teach us to be brave and REAL too!💖💖💖💖", "momma.starnes": "Get it, girrrrrl!! You are PERFECT! 💗💗💗", "xsaltyaestheticx": "This is magical 💖🌟", "allieeveronica": "You are such an incredible positive influence for so many! I love your smile in this photo ❤️", "jeremie_lynn": "Seeing pictures like this makes me love and appreciate my body even more. You don’t see a lot of bodies like this. And when you do, people hide them. I appreciate you so much. You have no idea how much you helped me 💙", "crankynicole": "Your confidence gives me hope!!!", "cat.cadet": "Thank you.", "michele55mouton": "Thanks for posting!", "sarahbxth": "This is such a cute picture, but more importantly you look like you’re glowing! You look vibrant and happy and free! I love it.", "a_be.you.tiful_mess": "This photo gave me confidence. Hubby always says how beautiful I am, but I never loved how I look. You look so beautiful, it has me looking at myself through new eyes", "skull_iegirl": "Thank you for this! I've been feeling like shit about myself since I watched @billmaher last night talk shit about fat people. I used to think he was smart but he's really just an ignorant #dick when it comes to the topic of obesity. I'm tagging my super sexy husband @kombucha64 as well because there are men out there who love big women! #foodismydrugofchoice #ideservetobeloved #fatgirlflow", "anihilatebeauty": "I am so happy to see a belly like mine that hangs and hides my vag. A belly that hangs that most people call a fupa. A belly that has been filled with probably amazing tasting food. More images like this in my feed will definitely help me lesrn to love myself and no longer cry when I read stories or captions of others realizing their self worth. Right now I cry, because I am still in that negative head space and even though I try to be active and am not as large, I still deal with things like hidrantis supertiva(severe acne like bumps and scara all over my belly and boobs and inner thighs and booty). I feel like my body hates me for being plus size ans yet I hate my body for being plus size, its a really sick cycle. @fatgirlflow thank you for helping me to learn to love myself. 🤗😘🤗", "susanrichard": "This is truly amazing you are truly amazing! I struggle with my body image. I am getting better with all the positive talk about body images now. I thank you for your love of yourself. You are beautiful 💕", "createallow83": "I LOVE it!!! You have a gorgeous belly😍😍😍🤤🤤", "alejandrazabalaok": "Amo esta foto!", "hlbarnes": "This photo amazing and you are gorgeous!! ✨💖✨", "nightking1006": "😋😋😋😋😋🔥🔥🔥🔥🔥💋", "themaverickess": "ya gorgeous!!!!!!", "fatshionablyrae": "Free the BELLY!", "juliestartsover": "I needed to see this today. I am so self conscious about my belly. When I sit on the couch, I hold a pillow on my lap, a weird attempt to hide my belly. To deny it. I even do this when I'm alone, and I always feel disappointed in myself that I can look at other bodies and appreciate their beauty, but when it comes to mine, not so much.", "_.kidf": "this is the best thing I've seen all day", "sandason77": "😩😩", "xxmisshannahxx": "You absolutely radiate joy and I love it so much! Thank you for repping big girls in such a positive way!! 😍", "drtist102": "Beautiful pic", "chriscrawford71592": "I am here for it ❤️❤️❤️!!! You're smile gives me LIFE 😍😍😍!", "wondergirl83": "There are no words to express how much I appreciate this combination of celebration and vulnerability. This may be the closest thing I have seen to a body, a stomach that looks like mine. Representation is everything. This reminds to continue taking up the space I deserve and to be kind and gentle to all the parts of this body that carries me through my day and through this amazing life I have created.", "toupslove": "Love u!!!!!!!", "_vampyrix_": "Gorgeous!! You’re so freaking amazing!! ❤️❤️❤️", "soul_cookies": "Babe ❤️❤️", "johnwaynes_teeth": "I used to imagine cutting mine off, holding it in certain ways so I couldn’t see it, pretending it didn’t exist. I’m trying to come to terms with it existing right now, then hopefully I can appreciate it.", "janejane47": "Ive battled my weight my entire life.. i had gastric bypass 10 years ago lost 180 pounds gained 50 back and it had stayed with me.. I'm so glad to see ab positive role model of loving the skin your in.. Keep doing what you do and keep inspiring me to just love me no matter what size i am!!!💗💗💗", "cobigrowsstronger": "HERE FOR THIS, LOVE THIS 💖", "jenniferlegge86": "❤️🔥❤️🔥❤️🔥❤️🔥", "nztebs": "❤️❤️❤️", "d_nakhole": "My favorite, you never seize to encourage me!!!! 😍😍❤️❤️", "riotcurves": "stunning!! 💓", "lil_rebelqueen91": "❤️❣️❤️❣️❤️❣️", "plussizepioneer": "You and your belly are so beautiful! Thank you for being authentically you always ❤️", "q_strom_99_walker": "😍😍😍😍😍😍🌼🌼🌼🌼🌼🌼🌼", "fairiesandfancies": "What really shines in this photo is your smile💜", "crazyaboutmyjellyroll": "💜💜💜", "fatbabetirade": "Girl, yes!! I created this account for just this purpose!! I hope one day I can go belly out!!", "bobss427": "You are amazing. Nice belly, smile and tattoos.❤️❤️🔥🔥", "jamie_jetaime": "Stunning!!!!!!! ❤️❤️❤️", "fabulous_as_always": "I sooo needed this!! Thank you for helping ease the thoughts I’ve been having lately....", "lauraaamcg_rny": "QUEEN 💖🙌🏻", "thoughtleslie": "Beauty", "crudebella": "🖤🖤🖤", "koaowla": "🔥🔥🔥 big belly club folx unite ! you are stunning.", "chelcielynnn\nVerified": "Verified", "gbeardsly": "This is a gorgeous photo and I think it is one of those that expresses the beauty of the person in an amazing light", "cleestandish": "Thank you. Just when I am having a down day or being really hard on myself and not giving myself the love that my body deserves, you allllllways come in for the assist with a post like this one. You truly are a positive influence for me. Thank you 💖", "lisalinkphillips": "You look radiant!", "alixvaliente22": "You are inspirational and have sexy ass tattoos❤️", "bridge_enginerd": "😍", "chainpuriamustafa": "Love you so much💋💋💋💋", "vegantraveleats": "💕💕💕", "greenikim76": "You are absolutely beautiful!!", "lee.scheffey": "❤️💜❤️💜❤️✨✨", "fatgelfling": "do you not pull your undies up to your belly button like i do? 😂 i find it so uncomfy when they’re under my belly instead of over it", "kali_bopo": "Yes!!🙌🙌🔥", "_cabrona_virus_": "Holy shit that tattoo is gorgeous and so are you-I love that bra where is it from?", "heidishartrandnewell": "Your photos changed how I see myself. 😭🙏🏻 My entire life I have been ashamed of any time when I had a belly that hung over. I think the correct term is belly apron? I have one now and I make sure to look at myself naked every day to remind myself I am amazing. Thank you for this and for being amazing. ❤️", "kimwoods": "You so cute!!! 🔥🔥🔥", "mattty1973": "Hi beautiful", "inkdavidson": "Gorgeous 💗💗", "lissabeeating": "Also, you are enchanting and forever the most beautiful star in the universe 🙌", "softbodytendermind": "Hell yeah 😎👌", "curly_endo_mom": "You have inspired me..", "janetconroyquirk": "Gorgeous! I love this so much!", "megamammma": "😍🔥", "sarajayne.poletti": "Um also I LOVE your tattoo!! 😍"}