{"soul_cookies": "Found it!!! @acceptingme_ 💕", "ralukard": "😍😍😍🔥🔥🔥🔥😻😻😻😻😻😘👑", "sheilaburnham": "What is your favorite 26+ size bathing suits? (Since you are THE bathing beauty!)", "crudebella": "🖤🖤🖤", "just_eat_the_doughnut": "Yes this 100%", "willebaere": "You are Not to big for nice cloths", "marcel_love66": "sexy👅👅👅👅👅", "daigle.bagel.cream.cheese": "Thank you for this list 🙌🏻 I’ve always felt so stuck with Torrid but I’m at the end of their size chart and always have to order online. I like baggy clothes especially tips so I’m excited to literally spend all my money on these brands.", "trinacraftinista": "Ahhhhh youre so cuuuute!", "thu_adidas.08": "Kiero lamertu pedazo coño asta k t coras y m domines", "mattyb148": "@treyaustin40", "tbabi1986": "@fatgirlflow ur beautiful i wish i had the confidence that u have to wear the stuff i wanna wear but i dont.😔 and its so hard to find clothes that fit and tht are comfy.its hard when u dont have any money to buy plus size clothes on line.i love ur style i love the stuff u wear u rock it.but i just dont have the money to buy good plus size clothes.ur an inspiration❤️😍", "wayneaspe": "Big beautiful woman ❤️❤️❤️", "freyaaguilera1": "I wish to have someone like you @fatgirlflow 😍", "murat_urwerk": "Ateşim Çıktı 🚀🚀🚀", "oktay_aydn_antlya": "👸😍💫💥❤️👏👌", "syilmaz_02": "🤗sexiii🤗", "andymd2012": "Where is te link?", "janette54_": "@manschey", "pat.stl": "👍👍❤️❤️", "kimmed17": "it's not just limited places anymore, it's also a change in what these places consider plus size. ive lost 40 lbs so I can get a little more from Walmart (they actually have cute things) but in some brands my 150lb 5'8 daughter can wear a 2x-3x 🙄 and something else I don't understand, I'm 5'2 WHY MY PANTS GOTTA BE SO LONG 😂 it's like to get a good fit I have to get \"regular\" length because trying to find petite length in my size is a whole other beast", "ctgirl072": "@shopchicsoul @glitzygirlzboutique", "voyaging_vagabond": "Saving this post when my savings account doesn't hate me as much. 🤣🤣 Also you're a total babe! ❤️🙌", "btharas": "Thank you❤️", "cupid_and_psyche_by_becky": "Venus, Additionelle, and ELOQUII are all awesome too!", "dumpstrqueen": "Girl you are an inspiration to me every single day. Love the content and your amazing spirit 🧡🧡🧡🧡🧡", "chrissyweeks404": "@draperjames goes up to size 24, and yes they are expensive but very well made. In clothing you get what you pay for. I make most of my clothes myself so I’m very picky about what I’m willing to buy. I spend way more making my own clothes than I would buying them.", "xdflo_": "I wish more companies made larger bras accessible. :(", "caxhetona": "I love that cardigan! Looking amazing as always! 😍🔥🙌💜", "chainpuriamustafa": "Love you so much💋", "footman5976": "Beautiful pic", "ashstephens87": "In Australia, Kmart and Big W go up to a 26 but their range is very limited", "tonyavictoria": "Torrid ❤️❤️", "hellish_delight": "Hey I'm from Ireland and we are same..has only in last 10 years shops have started doing plus size or brands like simply be have opened shops in Belfast. I love a clothing line called @yoursclothinguk its amazing and have sizes up to 30 I think? sensibly priced compared to simply be and Evans clothing", "askdrding": "Universal Standard goes up to 40, and I love the quality. @universalstandard", "dollyshot": "thank you!!! 💜💜💜", "addin_hot_men": "😳😳😳 Damn", "dollypurrtonandme": "Thank you for this post. I have had the WORST time trying to find professional trousers that I like. I have tried on upwards of 20 pair and no luck. The struggle to find clothes is so real.", "partandparcelhq": "We’re new! 🙃 Clothing, community & a way to earn a living for plus size women (14-36) who want more! We would love if you pay us a visit✨", "smashley.greenlady": "Did you include @eshakti in your list? They go up to size 36W, have great funky and fashionable designs, and the coolest part about them is that they let you customize and tailor anything! So you just need to know your measurements and you can type them in, and they will tailor the outfit to your exact measurements! They also customize, so if you don't like the hem or neckline or sleeves of something, you can change it in the ordering process. They really are Fabulous!", "moscow_1917": "Come my direct👄", "megsparkle18": "My biggest issue is when I don’t find clothes in my size, the prices are outrageous! I can afford to pay 30 bucks just for a pair of pants that might actually fit me. Sometimes they are even more than that... it’s like they think big people have the money to pay for the stuff ...", "mowens84": "I've been shopping Woman Within and there selections have been going beyond just basics. Also Roamans has extended their sizea on some cute selections to size 42-44. You're beautiful. I love this pic.", "seattlerainartist": "@theplusbus @twobigblondes are amazing consignment shops in la and Seattle the latter has an online store", "arthurhinz": "😍😍😍🔥🔥", "donald_stanley_": "Hi Corrissa! Donald Stanley is a size inclusive brand. We make clothes to your measurements no matter what size, shape or sex you are 💚💚", "marsimeli": "Catherine’s. Great sales. Beautiful clothes and quality fabric.", "scottishlass83": "In the UK I get my clothes from @yoursclothinguk they do some lovely clothes for plus size women", "gayscarletttttttt": "🖤🖤", "jodibirkemeier": "Www.plusisus.com. she has clothes made up to 6x theres a membership fee like costco but when you only pay 14.50 for a size 6x because of it you gat your monies back easily in one order. They are good quality too", "lolainthedesert": "I’ve had some luck with Target’s brand Ava and Viv, but I never find much I like in stores. They have a large selection on line. I’m very happy with their tanks and tees.", "highly_undermedicated": "Gorgeous!", "lauren.b.jonas": "@partandparcelhq up to a size 36!", "benson_twins_mama": "You’re so beautiful 😍!", "jacquiewy": "Big Sisters Closet! It's in toronto, but their shipping is reasonable, world wide... and the fashion Fridays where they model the new arrivals is amazing!!!!", "brittd882719": "❤️", "kimikowakamatsu": "@universalstandard has changed my lifeeeeeee", "adriellealdrich": "Eshakti.com is where I get all my dresses and now shirts (sometimes torrid) I even got my wedding dress from them!", "michael_1484": "👍", "iloveatattooedman": "Check out @curvy_club_ !!", "miss_lopez_if_ya_nasty": "It really is a struggle. Especially now that I've put on more weight in my lower belly I feel like I want longer shirts. I'm much over due for a new fall wardrobe.", "lisajane43": "I think you always look absolutely fabulous & whatever you wear you look stunning 🔥xx", "dn_yl1778": "🔥", "hjwdewit": "Wow, ovely picture 😍", "mery.magica": "🌷 bellissimaaaaaa", "charmcollector73": "Try shopping in the UK for anything over a size 18. It's terrible.", "sallysquiggles": "Love this image 😍😍😍😍😍", "singsinshops": "This is such a beautiful picture. Thank you for posting, it made my morning!", "naptown_chrissy": "The Avenue and woman within. You have to pick through for the best styles but I have always been able to find great pieces.", "kootena": "This Canadian one woman brand makes stand sizes up to 5x but will custom make any size at no extra cost. Also supports all gender expressions https://origamicustoms.com/", "alexis_snailmail": "Eloquii goes up to 28 and I’ve had good luck with getting dresses from them", "alwysleepy": "Ok but where’d you get your cardigan from?", "chubbychicknosweat": "Oops, I have sizes (panty sizes) 8-17.", "chriscrawford71592": "The only place I know of that sells plus sized stuff is @destinationxl and they are astronomically high 😭😭😭!", "kerrychelle": "Thank you for this! ❤️", "gordon.perkins.9235": "👿👿👿👿👿👅", "bonniekatewolf": "@nooworks do a much bigger range than almost anywhere I've shopped.", "angie.w.74": "I'm older but still like to look stylish. I like Catherine's, torrid (but it makes me mad because they never carry a 5/6 in store), and Avenue. I wear 30-34 depends on the fit.", "dresshorde": "I so appreciate this resource!! Thank you for putting it together and keeping it up to date! ❤️❤️❤️", "btnlongwood": "Don't forget Kiyonna and Igigi for dresses ❤❤", "danielledanner932": "Too cute. Stop it", "tattooedmomof4angels": "I need stores that fit my tall plus size :/", "lulathrift": "YES. I sell on Poshmark right now and I’m trying to put a variety of plus size and extended sizes in my closet - especially ones that are actually in style! I’m a 16/18 and I struggle to shop certain closets that stock my size, so I want to make sure that a majority of people can shop secondhand in my closet. Not a lot of pieces, but I’m striving to add lots more! 💜", "willisjackson85": "Beautiful", "bighskins": "@ladyvolup", "infamous_grey10.24": "Torrid for sure 👌 I got my prom dress there (and felt like a queen might I add)", "oceanluvngal": "The options are even more limited in Canada, and 30-40% more expensive usually.", "mumma_to_5_monsters": "Australia doesn't have many plus size store options, most stores I shop at go to a size 26 and the clothes are dark and ugly or are to tight or have no stretch!", "mgn_wallin": "@fatgirlflow it’s even more limited if you’re a plus size gal AND you’re pregnant.", "strongbrooklyngirl": "I have been shopping online @shopchicsoul they have the cutest things and most of their clothing is sized generously.", "alwaysfullfiguredfabulous": "The pic is aww inspiring", "_allison.m.clark_": "Old navys plus size isn't too terrible. I'm a 24/26 and I've been able to find some nice fitting dresses. The pair of jeans I have fits kind of odd on my thighs though", "lesann77": "@fatgirlflow I love that you do this and Thank you for doing so!!!!", "sailingjen": "I haven't been able to read through all of the comments to see if they've been mentioned, but @alicealexanderco may be a good option. There typical size chart only goes up to a size 30, but if you are larger, supposedly they will work with you to make clothing that will fit you.", "malenamdelizc": "I use 26, 28 and 4X. Old Navy (online only) has comfy legginngs and tunics. I also adore Yours Clothing, Torrid, sometimes Walmart has cute stuff (mostly Terra and Sky, I think is the name). SOMETIMES I find a 3X blouse at a Marshalls/TJ Maxx that’s roomy enough and I make it work.", "passportsandpizza": "Beautiful", "themrsdixons": "When i was a size 24 i shopped almost exclusively at walmart for the price alone. But now at a size 30 i go with torrid when they have sales. Just my size is a brand that is pretty cheap and great for regular everyday tshirts.", "chellie1975": "I love you so much, you're confidence and beauty together are stunning. I live through you 😘😘", "dandicane": "We are soooo limited where I live. My options are Walmart, Pennington’s, oldnavy and additionelle. I could online shop but I get nervous about the fit so I have to shop where I can try things on. Also I find it so $ to shop plus size! Some plus size stores charge $80+ for a shirt and $100+ for a pair of pants! I want to go to any store like most people and buy off the rack for the same prices they pay and I can’t!", "chubbychula89": "Goddess in the flesh", "cattybobatty": "Have you seen @marielle.elizabeth article? She gets this.", "curvystreets": "I love universal standard and they go up to 40. They are pricey, but their clothes are well made. It’s worth it to get on their mailing list bc they have all kind of secret sales. They just gave everyone on their mailing list $44.44 credit today bc it’s their 4th year in business!", "evrblue": "SWBFlorida has @curvexchange Plus size resale shop and they ship anywhere.", "curvexchange": "We are a plus size resale boutique in Florida but we ship all over the US and PR. We even do funky fun live sales Thursday's on FB. So fun!!! Check us out!!!", "_laura_ess": "I love Modcloth, StitchFix, AdoreMe, Torrid and Hot Topic. I also like Forever 21 for their super cheap ($5.80USD) leggings that are always out of stock - they're (obvs) not great quality, but I live in them when I'm home. I like Eloquii every now and then, they have good sales and I can find a lot on ThredUp.", "lovingallcurvywomen247": "🔥🔥🔥🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️🌷🌷🌷", "halfhollywood": "Your cardigan is BOMB- where’s it from??", "ulybaybalb": "Thank You 🙏🏾😍", "kslady88": "I’ve gotten work pants at maurices. They are my favorite. Jeans too.", "rwheeler1022": "Torrid for their 6X bottoms! That made swimsuit shopping so much better for me. I haven’t had much luck finding them in the store, but online’s been great. I’m a 30 bottom and I’ve gotten some great skirts from ASOS. Their sizing can be a little hit-or-miss, but when it’s “hit,” it’s great. ModCloth dresses and elastic bottoms fit me very well.", "marconiarrizza": "I usually buy my clothes online, since most places in person don't have stuff in my size, and even then it's difficult sometimes, especially if there's something specific I want. That's why I've decided to save up for a new sewing machine and just make my own stuff. It saves a lot of time and disappointment, plus I can bring some of my own visions to life~ 💕", "alliesweezy": "What about @orieveryday ?", "jenny1116": "And one for the haters all the way in the back! 😘", "genevieve_yyj": "Blue Sky in Vancouver ships. Their sizes are very generous. I am a 4 Torrid and a 2X at Blue Sky. All ethically made with natural fibres!!! I highly recommend these well made clothes. @blueskyclothingco", "how.to.train.your.erin": "I always find great stuff at Ross dress for less!!!", "maem.oe": "@smart_glamour has basically unlimited sizing but advertises as 15x+ I believe. I have a few dresses from therehey are pretty affordable and cute! They also carry lingerie, which is extremely hard to find in plus sizes.", "ohohmyheart": "I can only afford the terra & sky label from Walmart. They are coming out with some cute options to where I don't feel like I'm dressing like an old lady", "the_amber_show_": "Anyone got tips on finding size 32/34 dress pants? Preferably not ponte material. Like actual dress pants 🧐", "ldylovlybrit": "I used to swear by Torrid, till I bought leggings that came with holes, and I bought a super cute hi lo blouse/tunic that I as I was wearing started fraying. Being a size 30, they sell nothing my size in my smaller town, I order a lot from womenwithin.com, got my winter coat from them, also I go to walmart to the mens department, I buy a size 2x and a 5x and then I sew them together like s cute longer version of a peplum blouse, cause even with torrid I can never exactly get something to fit my figure comfortably :)", "jessicalynn84": "I haven't shopped here yet but I really like how earthy and flowy their clothes are anniecloth.com; they go up to 5XL in the plus size option!!! 🙌🙌😍", "digi.meow": "I stopped shopping for clothes because I have pretty low self esteem right now. Bad brain days. When I did, I pretty much exclusively went to Torrid. Have you noticed that a lot of small shops and makers don't offer sizes above an XL?", "thebabyarri": "@bitesizedmuffin", "productivityshark": "This photo is 🔥🔥🔥.", "caitlin_rose93": "Where is your sweater from 😍😍 @fatgirlflow", "janice7458": "Target has great plus size clothes. Very stylish.", "jamie_jetaime": "Hi! I’m sorry options are so limited. Thought i’d share... I’m with the designer/owner of @generosemx right now. She sells internationally. Up to size 6x.", "andie.gram": "THANK YOU! I’ve gained some weight over the past year and I’m now a 4 at Torrid and it’s really hard to find places that have my size.", "softbodytendermind": "I loooove this photo. I was just showing my husband a giant sweater and informed him that when I'm old enough to be cold all the time I'll be making up for my Hot Years that exclude sweaters", "vicki47348": "Woman within!", "kylaaflynn": "I love Rainbowshops.com , there basic tees are literally my favorite black tees I own . And there dress shirts and jeans are amazing !!! They really in my opinion made the quality improve in the past years as well . And they are so inexpensive you can buy a whole wardrobe for super cheap !", "empathyforgoonies": "Snag tights have saved my life. Just tights but still amazing", "ifralick": "I’ve been getting the Dia boxes for about a year and love them. Lots of new brands in 30/32 in the boxes. I’m not sure if Dia makes them or what.", "mikalalucille": "Where is your sweater from in this pic? Read all the comments and I don’t see anyone asking yet. 😂 Please and thank you!", "brrrenduh": "Your sweater is EVERYTHING! Where is it from? @fatgirlflow", "eye_luv_pez": "Does anyone know what the size comparison is to Australian sizes? I know a US 4 is an AUS 8, but does that carry on into plus size too?", "theviviennerose": "I look forward to checking this out! Thank you!", "iheartmytwinz": "Roaman's and woman within are my go-to for online shopping. Some stuff is a little pricey but if you shop at the right time you get awesome deals!", "margalarg8": "eShakti saved my fucking life for a wedding I was in this summer - they carry size 00-36 standard AND you can customize the hell out of everything, including sending in your own measurements", "katiemariecrafts": "@alicealexanderco goes up to a 30, but will also work to accommodate you if you are outside their size range or are multiple sizes across your body. They are pricey, but I'm excited to support them. Definitely for when you want an investment piece, because plus size bodies are worth investing in.", "dayngerussscurvz": "fullbeauty.com", "liblibby": "Honestly I’ve been surprised with my local Walmart where they recently started carrying 4 and 5x in store. I am loving the Tera and Sky brand—at least the ones that show up at my store.", "kellybellyohio": "Wait is premme taking it away or are they going away?! I never even got anything yet 😭😭😭", "whitneybadjones": "@universalstandard is phenomenal", "killerkatsfromouterspace": "Yall know any AFFORDABLE places for plus size clothes?like torrids great and everything but that shits expensive i cant afford to spend 90 bucks on 1 pair of jeans", "momster.gina": "Awesome. I just shared your link everywhere and will check it out. What's worse for me is that I have a condition that makes me not symmetrical and I have a list of things I need in a dress and cannot wear pants right now. So very long/tall maxi dresses that are not form fitting, are made with stretch, do not have a zippered back or open back, are affordable, over sz 30 and big enough for my boobilage is... not easy to find 😂", "danmw": "You look beautiful ❤️", "angelaalba_": "Omg this was me today. I was crying today in a Torrid! A TORRID! Only sizes 1’s and 2’s in everything I wanted.", "chanielleatrice": "So...you’re gorgeous. That is all. 😍", "mandersonsays": "@smart_glamour", "taas9292": "Pennington’s and Additionelle are my go to. They go up to a size 30.Their semi annual and tent sales are to die for.", "kndickmann": "Where is your list?", "thevegantiff": "Thank you for this list!", "shesprettybig90": "I’m a size 28/30 and sized out just about everywhere. I recently hit up Forever 21 with my boo who is a regular sized person and she needed some basics. I took the opportunity to peruse the “plus size” section and found that they’d added some 4x pieces. Not a whole lot but I did find 3 cardigans (very thin material) for under $10. Also Walmart had removed 4x and now added it back and I’ve picked up some decent jeggings there as well. It’s tough but not totally impossible. The struggle is real 😓", "jess.shill": "RIP Premme 😭😭😭😭😭😭", "orbberb": "Lové", "parabeks": "Love this pic!!! 🔥🔥🔥", "jemvt": "@universalstandard @asos_loves_curve @anthropologie plus line", "sarahbright79": "Old Navy and Torrid are my go to for 28/30.", "_daniellemcallister": "Hey @fatgirlflow have you tried the amazon brand Daily Ritual? They claim to go up to a 7x and most of the reviews say it’s actually true to size or runs big.", "schapman1969": "🔥🔥🔥🔥🔥🔥🔥👍🏿👍🏿👍🏿👍🏿👍🏿👍🏿🔥🔥🔥🔥🔥🍾🍾🍾🍾🍾🍾", "hamandmangos": "24-26 here, Torrid, Lane Bryant (work pants), Amazon's Daily Ritual brand has basics that go up to a 7X, also Walmart's Terra and Skye plus (up to a 30 I believe)", "shelbeysue": "That cardigan!! 🔥🔥", "bam.peesly": "ThredUP goes up to size 5X, or 32. I haven’t shopped there but I’m about to send them some stuff!"}