{"llalubhai155": "❤️❤️❤️", "cisse_foundation": "I love your lovely shape", "ken.vroman.792": "Oh yeah,I love your big beautiful belly. I would love to see more of you and your sexy body.😍", "mohamad_moridi65": "تو خیلی خوشگلی😍😍😘😘", "serhatkidil82": "🐄🐮🐮🐮🐮", "roxizaman": "💝💝💝💝💝💝💝👍👍👍", "muratartirir": "🇹🇷💞🌹💘🇹🇷", "akhof32": "🔥🔥", "manuelbowielifestyle": "Love you Mom💋", "deborahlansbury": "Awesome x", "ali.f688": "جووون", "kino_lifestyle": "😍😍😍👌👌🔥🔥🔥🙌", "bbwloverjohn": "Wauw what a lovely belly", "latinosweetpotato": "Building a comprehensive queer network to feature stuff like this ie inclusivity. I am not an adverister just an anarchist open trans dude doing some non profit stuff. Message me if interested it is not sexy but i think its purposeful", "_emwallet": "Fat @_emwallet", "bbw_love412": "Good morning beautiful 😍", "solimanmohamapor": "😍😍😍😍😍", "hiksyarm": "KUSUKANYAAA🔥🔥🔥❤️ @aisyongg", "alwayssaladin": "Hi coco, i love you so much", "srahthesun": "To accept my midsection and “belly” and that it isn’t just flat. All I keep thinking is I should have the body of a flat board. (Nothing wrong with that body type) but that isn’t MY body type and I keep thinking I’m less and less beautiful because of my curves and bumps", "recep_ozer02": "💋💋💋❤️❤️", "hortega1995": "I love you 💛", "har_dent_laboratory": "Very nice 😍💗💕", "godsonofhouse": "lovely♥", "johnnybatta": "@maxsheldrick", "miraweiner": "💕💕💕💕💕💕💕💕💕💕", "parfumerie_syba": "https://27e6f9qyj9y7qs77mjwgyg1k8a.hop.clickbank.net/", "october_baby85": "@jcraw126", "barbie_nonhledlamini": "My name is Barbie herbalife distributor I help people to lose weight Belly fat Gain weight Gain muscle Skin care.sports and fitness Also looking for PPL who wants to makes extra income either full time or part time😁😁 Are you interested in any...or do u know anyone interested??", "yilmaz_yilmaz2019": "Seksi😘😘😘", "bryanevetts": "Hey babe let get freaky n get off together. Hmu", "the.sky.was.all.violet": "i grew up thinking i was the Only Person who got stretch marks during puberty / the only person who had them who hadn’t had a baby... reminds me of this message! this representation is so important ❤️", "nosratx": "Love you", "vahidbooty78": "🙌🔥", "hamidahmadi.61": "👏👏👏👏💋💋💋💋💋", "mahdipacman": "Beautiful Woman In This Picture", "livinwithcolor714": "I absolutely love you for living in your truth 👑 Thank you for opening doors for women like me🤗😘🙌", "mariafischer159": "Hi! I used to have a flat belly. My stomach was actually the only body part on me I really liked. Then I gained weight because of a medication I have to take. Now my belly looks nothing like it used to. And I still don't like it. I like your photo- you are the living proof that it's possible to like and accept a bigger belly. I hope that one day I will be able to do the same with mine. So thank you for being my role model!", "hossin13591398": "Ilove youuuuuuuuuuuuuuuuuuuuuuuuuu", "miki.corleone23": "❤️😍😍❤️🔥", "kazimirerofeevich": "you are very beautiful😍😘💕❤️🔥🔥🔥", "shayan.r.z.s": "😂😂😂", "liusa57897": "Wow I’ve been struggling so much with my hanging belly in the last few months like I look in the mirror and I can’t with myself, but when I see confidence exuded from every angle of this picture it just reminds me that we are all beautiful.", "feng.chien.chang": "I think this might be helpful: https://www.youtube.com/watch?v=GIZkyhyCp24&t=34s", "alwomyn": "I love this so much. When I first saw @tessholliday on the cover of Cosmopolitan, I wept. The thought of seeing a plus size body on the cover of a major magazine when I was young, overtook me with emotion. It would have changed *everything*. Now, the bopo community on the internet (like you 🧡) is my sacred space. My safest space. Where i come to get fed. You’re a part of that, thank you. 🌻🌈💜", "shelbylounails": "I started following accounts like yours to see myself and how amazing my body is. It worked 👍 Representation matters!!", "pyrytblue_and_crew": "Yes it would have been so different. And this is why i follow you and so many others who are trying to change the images we see! Thank you for posting, you are helping me to accept my own belly! 💜💜💜", "judy.gill.7758": "I am almost 60. I have a belly. I have been a widow for 2 years. There has been no dating because of the belly. Makes me sad. Very sad.", "joeflan93": "Have a look at what @unskinnyshero is doing with the @bigbellybook I can feel a collab coming on!!! X", "j_penaa": "You are beautiful 💖🔥", "totes_morg": "You are so beautiful, bodies are beautiful and you are inspiring ❤️❤️", "tiffanyintoronto": "🙌🏻🙌🏻🙌🏻🙌🏻", "cooltwou76": "Very beautiful lady", "karaelizabeth1216": "Your are absolutely gorgeous ❤️❤️❤️", "spinningmagpie": "Yes, absolutely so very different", "daintydumpling": "100% hands down would've been different. I wanna see fat people as love interests in tv shows and movies and it not seen as the butt of the joke. I wanna see fat models in mainstream media. I wanna see so much more. But it's definitely movinf the right direction. Thank you for sharing ❤️", "danieldannydanidan": "I literally love all of your posts ❤ Media needs to show people of all sizes (fat, skinny, and all in between) and not just people who are sticks. I know that if I would've seen positive things depicting fat bellies I would have always been more confident and I wouldn't have struggling with eating disorders thinking that I have to be a stick. Thank you ❤", "water_mamma": "There was literally a photo of a person showing off their waist cincher DIRECTLY above this one and it was profound. The photo with the waist cincher has the person looking at the camera. The photo here has the person looking within with Joy........very very interesting!", "jenniferwilliams637": "Are you truly ok with the way you feel? I’m not the weight I’d like to be and I know if I lost it I would feel so much better. I’m not sure I could ever except that feeling as my permanent life. No judgement. Just curious.", "jamie_jetaime": "My life would have been very different if i had seen fat bodies repped when i was young. Nearly all of the photos of me at around age 10 have my belly torn out (actual physical photos). I was made to feel shame for it from every corner of my life. Thank you, Corissa!", "girljoys_": "this makes me so happy to see. a body type just like mine being shown in such a beautiful and radiant light makes me feel like mine can be shown in the same way 💗", "leenapentti": "I had big-bellied women in my family growing up, but being fat was always just something to feel guilty and ashamed of, and that was what I grew to know. I'm 40 now, and accepting my belly as it is, is still a struggle, but I'm much more okay with it now that 20 years ago. I saw this photo, and all I thought was, there she is, looking so beautiful. I can see the beauty in you, I hope to get to a point where I can see myself the same way. But seeing photos like this one does help, and I love you for being a rolemodel for us! 💗", "prettiundead": "Thank you so much for sharing ❤️ I love seeing your body, cause as you said in your post it’s like mine", "curvily": "Beautiful 😍", "dave_b_soul_official": "🔥🔥🔥🔥❤️❤️❤️❤️", "madetobebee": "God I love seeing other fat bellies. Thank you. ❤️❤️❤️❤️❤️", "miraclesuitswim": "♥️♥️♥️", "paracerc": "I see your belly and I think awesome! I see my own and I think it's disgusting. Why can't I see your belly = my belly? I am still reeling over a photo that accented my double chin. It was taken days ago and I haven't let go of it. I needed to see this in my feed today. Thank you. ❤️", "officialamethyst.rose": "You make me love me more. ❤️😍", "rafanter": "Love", "julie_luvnlife": "I love fat bellies. I just want to reach out and rub yours. It is calling my name. 😘", "cpresss": "I’d like to petition this be added to all underwear campaigns", "wesssan": "Omg. Thank you. If I saw pictures like this one growing up, I think I would have been stronger knowing there were more people out there looking like me. Thank you. ❤️❤️", "eilidh_0612": "My mum and dad have struggled with being over weight for most of my life. All I ever really heard growing up was “Oh I need to go on a diet I’m getting fat” or something along those lines. I had never seen fat represented so positively ❤️", "auntbethanyb": "I'm here for it!!! 💞👏", "mammadukes3": "Thank youuuuuu ♥️", "foodpeacedietitian": "Thank you 💙💙💙", "j.m.vx": "Thank you! I am learning to just exist with my belly and it’s been difficult! Keep shining ✨", "velestariana": "For me it would have been a world! To see empowered fat women.", "liciaaa.so": "You look like me. 🤯 what a concept. I really don’t know how I would’ve turned out if I had see myself represented", "brittania": "100% agreed. I was just telling my friends that the whole journey of starting to actually love myself was exposing myself to beautiful fat bodies like you and so many others that inspire me. That I crush the doubts and fears in my head with your experiences and your beauty. So thank you ❤️", "gayscarletttttttt": "You're glowing 🖤🖤", "oxlynettexo": "I have a belly just like yours and I always hate showing my SO or anyone my belly , but the more I see of yours the more proud I feel", "chloe_balliet": "Crying reading this and the comments. I’ve been following many body positive accounts for YEARS and overcoming the shame I feel around my belly is still such a struggle. But every time I see a body more like mine, especially when I see a belly that looks like mine, there’s such an emotional response. I feel so grateful, relieved, validated, and touched with hope. Thank you 💖", "bradip.a_nan.a": "I can't find the words to fully express my gratitude. For years I looked at my belly and didn't understand why it was so different from the others. My life would have been decidedly different💛", "thefatbombus": "Thank you thank you thank you", "nataliemeansnice\nVerified": "Verified", "aliceimschlaraffenland": "❤️❤️❤️", "manavshail": "Shail", "fatfeministmich": "It’s so absurd, I remember starting to feel ashamed of my belly at like age 8-9. I was a skinny kid, but of course like girls do, my stomach had a rounded shape at the bottom. And that stuck with me forever. The more weight I gained, the bigger my belly got, and I hated it more and more. It’s taken a lot of hard work over the last two years to get to a point where I don’t hate it anymore! I don’t love it either, but I try to be in a neutral relationship with it. And I am aware of how political my belly is and I use it. I wear clothing that shows it clearly and I don’t try to hide it. Because god damn why should I?! Everyone needs to see all the different body shapes that exists.", "amysalloway": "@dammitphilomena Exactly exactly this. Ditto for me. Pear-shaped large people are seen as attractive and acceptable...apples are not. That's been like insult on top of injury for me. If I had seen apple-shaped bodies being worthy of love at any time in my life, my body image might be far less negative and punishing.", "jhaphoullebidu": "belly cheers!!!", "cara_witha_gh": "😘💕", "highballemy19": "Yes I do think my life would have been different. All of my friends and family are slim and I used to think they would be horrified if they saw my belly because they must never have seen anything like it. I'd avoid anything that I thought might mean someone would see. I am trying to unlearn that feeling now - but I think just knowing that other people had bodies like mine and people didn't reel from them in disgust and even found them attractive would have made a huge difference to me.", "qimzel": "My life would be 100% different!! I always got comments from everyone around me, close or not, about my weight.. How lovely would it have been to be able to say to them \"but look at this beautiful person!\" instead of them shoving pictures of magazines with \"perfect people\" in them in my face.. Thank you for this! 💜", "meltybrain": "Yes. Allllll the yes. I want my kids to see alllll the beautiful bodies. I didn’t. All I was exposed to was negativity and that has impacted me so much, in so many ways. I want to show my daughter and tell her how joyful you look.", "paovlov": "So beautiful ❤️", "inconvenientlyhuman": "Yes definitely! And one question I ask myself is how do I make sure my daughter is seeing a wide representation of bodies - I know what a difference having a diverse Instagram feed has for me, but then I realised that my 3yo doesn't have that kind of influence so I need to find ways to make sure she is aware that all bodies are good bodies. So far I do it in the way I talk about my own body and other peoples bodies. I want her to not only grow up confident that her own body is okay, whatever size and shape that may be, but also to be an ally and know everyone else is okay whatever size and shape they are, and automatically see people beyond their bodies rather than that being a first point of judgement, which is what it still is in society today. Thank you for sharing your gorgeous belly (and all your other posts!) xXx", "redlou1978": "I wish I looked at my belly like you do yours...I hate it! I always wear clothes that hide it, just because of how low it hangs. In face I laid in bed crying because there is literally no part of body I like..I try to diet and fail, the only thing I like is going to my exercise class which is tough,but I feel much stronger since going there, and I get told by my partner and friends that my body shape has changed, but I don't see it. I'm going out Tuesday and I'd like to wear a jumpsuit, but all I see is my fat and will most likely end up wearing my usual clothes that hide it. I love watching your Instagram posts and you look beautiful 💙", "ashsav.king": "The things like this that you say truly make me look at myself in a completely different light. A light where I’m allowed to love myself. I really really appreciate you. 🥰", "ahyira": "💚💚💚", "kittii_cattt": "i was just thinking about this today its very rare to see bellies even in body positive accounts they always cover it with high panties or show just ass like its still a sexual thing to please men to be big but with no belly everyone seems to be so belly phobic 🤔thank you for posting this ❤️ you are an inspiration😘", "kennaalana": "You inspire me. Thank you for being you in such a public way.", "_charlottepettis": "😍😍😍😍🦋🦋🦋", "dawnniiee_": "I wish I could have your confidence ❤️your so inspiring", "kimmijoy86": "🖤🖤🖤 it would've made such a difference to me, mentally/emotionally, to see fat bodies & especially bellies because my belly is the biggest part of my body. If I'd known it was ok to be fat, I wouldn't have punished myself for half my life with dieting & over-exercising! I'd be much healthier, mentally & physically (all the years of extreme diets has caused things like IBS, low iron & other vitamin deficiencies which I'll have for the rest of my life).", "janeemoonlight": "Loving this photo! Looks like mine! I love your page!! 💕😍🙌👍", "colleenneedham": "Beautiful! 💖", "lauraspeeckaert": "I think so. It took me ages to appreciate my body and when I first saw bellies like mine, my first instinct was 'ew'. Pictures like these and people like you have made me appreciate and enjoy the beauty of them ♥️", "ninaluciernaga": "♥️", "plaidcandy": "I just remember that my dad had a belly, and my mom would comment to us about how it grossed her out . And then I got a belly and thought it must be gross. Seeing happy belly owners and deciding bellies can be cute is such a huge thing. 💕", "feeleevi": "@fatgirlflow hello beautiful I'm so happy see you showing your body and feeling shameless. You know they've been showing us fat bodies and big belly and stretch marks like something very bad is going to happen to you if you be like that. They never said that fat bodies exist and it's ok your worth doesn't change because you are a human and for many reasons you are in this shape. #love #yourbigbellygirl", "brandongist28": "You should post more bellies", "dammitphilomena": "I spend so much time and anger and insulting myself because I am not the \"cute \" kind of fat with a flat tummy and big hips...instead because of my pcos I carry my weight in my belly like yours...I would have hated myself less to have seen bodies like mine", "crazywolflady": "If only this was a thing for me 20 years ago!!! Everyday is a self acceptance struggle, thank you for showing me that we are all beautiful", "msmegcc": "I love her @plus_natali", "q_strom_99_walker": "😍😍😍😍😍😍😍", "emmaincanada": "Yes, I wish my stretch marks and my rolls were in magazines every day. I hope my children can embrace their bodies better than I ever did.", "boo_you_whore88": "You are so beautiful girl! 😍❤️. Thank you for posting this. You have no idea who important it is for women and girls alike to see this. 👏👏👏", "killerkatsfromouterspace": "Sometimes i feel sad cuz tho its more common now to see big bellies i rarely see one that i feel looks like mine i have a certain roll under my boobs thats very prominent my belly isnt all smooth my body i often feel isnt \"the right type of fat\"", "_lettee": "Well said 💚", "agnes_kozma": "Im so grateful for your presence 💕 i agree with what everyone else said about representation so ill just add a personal story... it was because of you that like 3 years ago i started to have fun with bikini \"photoshoots\" like every summer we take tons of photos by the lake with my bestie and its the best thing ever and i stole poses i saw from you lol and also i remember clearly that when i started to feel really self conscious i closed my eyes and pictured you and thought things like \"okay im corissa now i feel sexy' 😂 okay this sounds weird written down like this i apologize 😂", "querencia_seeker": "Please don't stop representing for us big belly gals ❤️❤️❤️", "kittyxofxdoom": "You are a freaking ray of pure sunshine. Look at you❤️", "_lifeslittlelyrics_": "Ty ty ty. Its so important to see all body types represented.", "chrystinecrash": "My gosh yes. Life would be so much easier, and so much less shameful if fat bodies were seen as much as and in the same ways as thin bodies. I'm losing that shame finally, now that I'm nearly 38. Thanks for sharing your belly 💜", "priscillz": "Thank you", "amelia_mariah": "I grew up in a community (physical + online) where the only celebrated fat bodies where ones in hour glass/ pear shapes. I am not intending to be divisive, but as a fat woman with my belly being my biggest curve I always felt like I was the wrong kind of fat. Seeing images of “apron” bellies and round bodies in a beautiful light helps my self esteem immensely. We’re sexy too 😊❤️", "sweetz051": "I have this and I have trouble finding clothing for myself because of it, just pants though", "iheartcephalopods": "What a special opportunity we have now, in the time in which we live. My life would've been magically different if I'd seen bodies with bellies like mine! Thank you for the good you do! 💜", "organicskytherapy": "It would have changed my life!!! And possibly saved it as god knows what all the restrictions, deprivation and diets have done to my body! Maybe id be a healthy person if i didnt buy into the thin is health mentality! Sadly im ill, disabled and overweight! Yet being “healthy” im sure cause parts of mg condition!", "bodyimagewithbri": "This is everything 🔥", "totoatoz": "I wish things were like this when I was young.", "khavanicole": "It would have been life changing.", "meandmine82": "Why can’t I love mine ... 4 babies and I look at the foul over hang disgusted still .... I’m really trying.", "xxmisshannahxx": "😍,🥰", "kacieouimet": "❤️💜💜💜", "born_a_swan": "I love you! 😭😭😭😭😭", "mrsbeardsly": "It truly amazes me how someone I will likely never know in ‘real life’ can effect me so profoundly. I’ve worked my whole life thus far on loving, appreciating and talking about my body without shame and you and @comfyfattravels give me so much encouragement by just being yourselves. Thank you. 🖤", "thecuddlyantelope": "I couldn’t love this enough. Thank you for putting yourself out there and representing so many of us who don’t have the confidence to put ourselves out there like this.", "angwdbs": "Thank you.", "tifffannyyy": "@mrsjenniyates", "jessmunro1994": "You're such a beautiful inspiration 💕 I hope I can love my belly just as much soon, I can't seem to get over the insecurities and self esteem issues that have been instilled in me since I was a little chubby preteen", "euro_gamer_girl": "You are so beautiful", "vallebre": "Your belly looks almost the same as my belly, and seeing it has been instrumental in me confronting my self-hatred that stems hugely from my midsection. If seeing your belly made me happy for you, if I thought you looked beautiful, why couldn’t I extend that to myself?  I’m not there yet but I’m trying every day, and this helps so muсh. Thank you.", "jenbencollins": "Thank you! 🙌🏻", "elenamugrosa": "Yes love love LOVE this", "heather_bragdon": "I appreciate your posts so much. They make me feel better about being me, a fat me.❤️", "violett_rage": "What an amazing perspective!! Thank you❤️", "your_mom_says_hey": "Beauty💖", "leedobecka": "As an author and burgeoning YouTuber, I don’t have a big following yet, but what you’re talking about is why I post pictures of my mid-fat body on IG every so often. 💫 I’ve had friends/family say it makes them feel good and THAT is an awesome feeling. ☺️💜", "maggiemcgill": "Your belly is absolutely magical 💕", "somouse21": "Do you know about @shoogsart they take incredible photos of fat bodies. I feel like you must know them but just incase you don’t. Go, bask in the beauty that is bodies like ours!", "camibakerdavisjr": "My life would have been SO different if I had EVER seen one fat body represented as being happy and beautiful", "miriquitecontrary": "Need more fat belly!!! 😘", "p_wretty": "Samesies", "curvystreets": "Beautiful", "sunlashine": "@fatgirlflow Maybe you do, maybe you don't but give @shoogsart a follow. They are blissful representing bellies. And I am so happy to have it on my feed!!", "care_bear_k": "My mom was the primary example of a fat woman in my life, and she spent my childhood escaping photos or cutting herself out of them. She NEVER showed her body, even at home... I think my world view, self image, damn near everything would be different had she loved and shown herself to the world. I’m not blaming her, but I wish she would have been able to do that for herself and her daughters.", "lieslbinx": "Yess bellies ruuuule!! It’s got to be one of my fav parts of my body! They can be so soft", "sevgili": "❤️❤️❤️", "deadwitchwalking": "Fucking THANK YOU for not photoshopping your skin to be flawless. Seeing bodies like mine has made me a lot more confident, but lately, I've found myself obsessing other the things I don't see on those bodies. I see pictures of people, belly out and proud, and I think, ”Wow, she's beautiful.” and then I start doing that dumb human thing where I compare myself. My fixation was slowly switched from size to the skin texture and discoloration on my body that I never see on these other beautiful fat people. So thank you for showing that.  I adore you and every little ripple and mark on your skin. 🖤🙌", "theblugoldfish": "This platform is the sole reason I finally realized I too could wear a bikini and embrace my body. Even then though it's always been a struggle. Thank you for doing you and helping destigmatize the fat body", "tinyhumanhouse": "I'm getting there. I'm getting there.", "just_this_chick": "Gaawwddd. Thank you ❤️❤️ WE EXIST 💜💜", "mizz_carter0613": "The most beautiful picture I have seen on Instagram 😍😍😍", "itskrishna_time": "I’m glad I’ve found a fat influencer who has the same belly/body as me. I kept seeing fat women who had these “perfect” curves and rolls, women with a “acceptable” fat stomach? And I felt kinda left out until I found your page! I’m so grateful to see you loving yourself, it makes my day every time🌞🌞", "missbellablitz": "To this day I love seeing bellies like yours, like mine. I hate my belly, but I love yours. And I feel like that's a good step towards loving mine as well.", "piggymag1c": "Thank you 💗💗💗💗your posts inspire me to love my belly and all of me!!", "hamandmangos": "Ever notice that \"plus sized\" lingerie models never seen to have bellies?", "songbird9279": "Definitely ashamed of mine. Not sure how to get over that.", "zords_wifiu": "My son weighed in at 12 lbs when he was born (T1D for added adventures!) so my belly is sorta double, my abs bisected to make room for him so they sit off to the sides and the skin is really soft and stretched, I had well over 100 stretch marks that were angry and red and sore after he was born. I had to learn to love my belly the way that it is. If there had been better representation when I was growing up it might not have taken me so long to let it go and accept my body. Beautiful humans like you are helping me to see myself with love rather than harsh animosity, I’m beyond grateful, there just aren’t enough words. Thank you for being you! 💙", "danielledanner932": "You and white are 👌🏼 ❤️", "bnlusk9.17.11": "Beautiful 💙", "momster.gina": "That’s my belly and upper legs right there. 🙌", "jodimelzl": "I am 60 and I can tell you that when I was in my early teens there were no plus size models there were no pictures of bellies. Twiggy ( talk about the opposite of fat!!!) was popular and we all wanted to look the models in Glamour and Seventeen Magazines. I was a size 14 then (I’m a 22 now...and my mom thought I was fat. If I could have seen anyone like you or remotely resembling my body anywhere it would have changed my life! I’ve lived in hatred of my body and cannot look up in a full length mirror. Thank you for putting this picture up! You have such joy and confidence ! And you are beautiful. It’s very helpful to womenloke me. ❤️", "smithscratch": "I’m def on IG to see bellies (and booties) like mine, so thank you!💕", "ktw.all": "I often think that I’ve maybe never actually seen a fat pregnant belly!", "abbeyolsonn": "You 👏 are 👏 thriving👏 hope to be like you❤️", "christaneka": "❤️❤️❤️❤️❤️❤️❤️", "ralislel": "Awe. So much cute 💗", "nrolbiecki": "I applaud you & your beauty inside & out... as i sit here waiting my skin removal surgery cuz i hate my body & everything about it", "drtist102": "❤❤❤💕💕💕", "blk_hrt.drk_rts": "Absolutely love this 💕", "j9pants": "You inspired me to take a belly selfie in my office. I’m going to send it to you!", "teasewithhoney": "💝", "schapman1969": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "naesthread": "💕 it would of most certainly helped young nae, as it does now 😍 🤘", "bsummerbeauty": "I just wonder why I can look at you and see nothing but beauty.. but cant when I see myself.. it's such an odd thing. ♡♡ ya", "arthurhinz": "😍😍😍😍😍", "guiltyzombies": "That's one thing I hate about most plus size pages is that they show girls who are yes chubby, but their stomachs are still mostly fat. I've struggled with my weight since I was little. And all of it goes to my stomach. My tum looks just like yours and until this day I struggle with it. I can't wear shirts that are shorter and show my tum off because I get so self conscious. So seeing this and someone who is secure about it is so nice.", "ashmichelle.c": "We are belly twins! 😂", "gateway__shuffle": "Thank 💜 You ⭐️", "_theopaque_": "You have the purdiest belly and I’m so in love with you 🖤 thank you!", "fostermamaeva": "I love that belly!❤️❤️❤️❤️", "badbadprettygood": "I completely agree with everything you said! I also just want to thank you for always being so loving with your belly. You were one of the first people I found on social media that embraced your belly, and because of that, I knew it was okay to love mine, too. Bellies are beautiful ♥️", "fashionreclaim": "The only belly I saw when I was young was my mother’s and she was constantly dieting and complaining about it - not exactly a belly positive role model. Now as an adult my belly is MUCH bigger than hers ever was and I’m okay with it and my chunky apron. ❤️", "peachstunnly": "This photo feels like snuggling my comforter in the morning with the sun shining through 💛", "jessyhausner": "Yes! My life would have been very different.. representation is so important! Thank you for being you ❤️", "kristinamamaknits": "❤️❤️❤️❤️❤️❤️", "aportuguesegirlinmontana": "We all spend too many days hating parts of ourselves... when the opposite, is always the answer... To love more. To love ourselves. Hating those parts will not make us to feel better, but loving those parts.. that's where our real beauty resides. ❤️", "uncomfy_fat": "I am painfully aware, and ashamed of how much space I take up in this world. Thank you for showing me moments of clarity!💕", "floralpatterneddreams": "It's so empowering to see your photos and think \"Wow, that's true.\" It makes me think that maybe I don't see myself the way everyone else does, or maybe even see myself how I truly am. Maybe I'm missing out on the opportunity to see that the parts about myself that I tolerate or dislike really are just that - parts of myself. I deserve to be loved and seen and to enjoy life with my belly too.", "marajanemichno": "These images are so beautiful and help me to see myself in a beautiful light. Thank you!", "mental_health_reminder": "You are beautiful, real, and an breath of fresh air. Thank you for representing the less-seen beautiful body type. You are doing so much good ❤️", "kearasmomally": "God I wish I had your confidence, grace, and love for myself. I just wanna hide from everyone. I love you! Beautiful!", "spooky_fckface": "Yesssss. My belly looks just like this 🖤🖤@fatgirlflow thank you so much for doing this.", "kristymccoig": "Thank you for this picture. I carry my weight in my belly and am learning to love it!! ❤️", "chflan": "Thank you ❤️", "susanandersonmusic": "I can’t even imagine what it would be like to not constantly be aware that I don’t look right...too big, don’t fit, unattractive, perpetual “before” photo. I’ve never even considered what it would be like to have all of that taken away. What a world that would be. So grateful for what you’re putting into the world.🙏", "stuffshethinks": "💓💓💓💓💓", "womaninread": "I remember the first time I saw the commercial for Pitch Perfect and seeing Rebel Wilson just be a regular fat person instead of the mom or angry neighbor or the sad side character. Seeing someone with a similar body type on the tv and knowing other were going to see it and her character was unapologetic with being fat, felt so good. If I had seen that as a child, I can’t imagine how different i would see myself now.", "brownpositive": "Your belly looks almost exactly like mine. I never get this type of representation. Thank you so much for this. This means a lot to me because lately I’ve been struggling with body image again.", "modernvintageclassic": "I love to see your belly because it's helping me love mine", "nicotron3000": "😍❤️😍❤️", "the.bubblegum.witch": "This is so beautiful and important 💖😭", "nicxpaige": "I love you & I love this, I honestly have the same belly shape/ body shape and I’ve felt really rubbish about it but seeing this and your positivity just has made the world of difference 😩💚", "feymoonstone": "💜I'm starting to become neutral about my belly, but the thing that frustrates me the most is finding things that properly fit the belly including but not limited too underwear, bathing suits, body suits and generally anything that goes on the bottom. Nothing seems to be designed with bellies in mind even so called \"custom plus lines\".", "roberto_artiste": "♥️♥️♥️♥️", "ladyfurpatterns": "You should start an Instagram page called bellybabes", "the.chaotic.life.of.bri": "Yaaas!! 👏🏻👏🏻👏🏻", "myfriendstaci": "You are radiant 🌞", "babyruth728": "I had an art class at 16 years old with live models. The first one we had was a plus size woman named Aviva who was 5’2” and likely a size 24. She carried herself with such grace and she was so fun to draw. Until that point I had never seen someone that full figured nude, and it was really beautiful to have that experience.", "margotmeanie": "I can’t imagine how differently I’d look at myself and the world if I had access to the representation I do now. I’m just happy it’s happening and that I can take and apply what I get to see now and know I’m part of helping the the landscape for youth today.", "ladygreenetea": "Love this. Love this message. I struggle with my belly. Definitely would have helped seeing representation when I was younger.", "nerv0us_laughter": "All bellies are beautiful!!! I’m the same way, I’ve been so ashamed of my stomach for far too long and seeing other women embrace their natural bodies has helped me so much. Now I’m more comfortable with what I got and I’m willing to flaunt it!!", "nztebs": "❤️ thank you!!! ❤️", "bubblegum_bxby": "This is such a beautiful photograph! I love how happy and peaceful you look ❤️", "cedar.willow": "Gosh darn I love your belly! Bellies for all! More bellies yes yes yes!!! 😄😄😄🎉🎉🎉", "teclea": "Thank you! Thank you for sharing yout beautiful belly with us.", "jessi.so.messi": "I got one right here girl 💕", "nicolecmaple": "Following you has changed my life, my belly is very similar to yours and finally seeing someone in beautiful pictures that had a similar shape to me was so relieving! This diversity is so important, especially within the fat positive movement, because there's no \"one way\" to be fat or be shaped! Thank you for your work! 💗", "blackrhino2": "🔥🔥🔥🔥🔥🔥🤤", "amandalee684": "Thank you....thank you...thank you!!!", "ladyvirginal": "Definitely. I rarely see bellies that look like mine even now. I've got a double belly. Its hard to get tops to sit smoothly over it and it makes me super self conscious.", "felicityfoodandlove": "Keep connecting. I love you. As do so many xxx", "abbey_christine": "❤️❤️❤️", "comfyfattravels": "I definitely feel that way about my belly ESPECIALLY about never seeing any fat bodies in motion. We jiggle ITS NORMAL", "jen.allyson": "I Iove bellies so much too! So soft and comforting. ❤️", "angie.w.74": "Growing up I saw men's bellies but never women's bellies unless they were flat and perfect. What's funny is I'm attracted to a nice soft belly on a man and loathe my body. I wonder how I would feel about my body if I saw women's soft bellies?", "tricksypixiemeg": "I love this photo. You look so serene 💖", "fairiesandfancies": "I love this picture and peace on your face 💜", "seafoam_films": "YES!! So so much yes. 👏👏👏 Beautiful ✨✨✨", "sossitywrites": "yes. and thank you so very much 💖", "grasping_at_straws_": "Yes!!! I remember HATING myself as a kid. Even in first grade because I was always bigger and there was no representation of fat bodies or if there was they were always the butt of the joke. It took years, a massive eating disorder and two kids before I finally woke up and said “hey this body is a GOOD BODY. You have literally put it through hell and it’s still performing, still going strong and it doesn’t deserve this. “ And slowly I stopped differentiating between me and my body. And now I love myself, all of me and I try so hard to watch how I speak and act in front of my children and what they are exposed to because I don’t ever want them to feel that deep shame and sadness I felt. Anyways I came to your comments just to tell you thank you. You are appreciated and amazing. And thank you for reminding us to be present and mindful and grateful and kind to ourselves and others. 💗", "sammypie101": "Thank you.......and 😍🔥🔥", "alifereframed": "So different. I literally cannot imagine growing up seeing diverse bodies. I think it would have changed my life.", "staccmarie": "💜💜💜💜😭😭😭😭 thank you for teaching us ti embrace our bellies!!!", "debicet": "I can’t explain how much it has helped me 💜💜💜. Thank you for your willingness to be vulnerable with us all", "drvixenne": "HERE 👏🏼 FOR 👏🏼THIS. 👏🏼", "aelurine": "Forgetting other people look like me has been detrimental to my mental health", "tracyx127": "That’s the hardest part for me to love is my belly. I’ve accepted my chubby thighs and fat arms. My belly is what holds me back most days.", "kelseahabecker": "YES!!!", "samantinha_k": "🔥🔥 You are so beautiful", "chriscrawford71592": "Yo this is so important. I only saw one body that's like mine and that was my dad. He represented everything I wanted to be and that changed when he died...but I see people like you carrying on the same type of kindness and self love that he had and it gives me hope that maybe I'm not as flawed as I thought 😊.", "katharyn_weddington": "You are such an inspiration! Absolutely beautiful!! 💕", "repulsivemarieee": "💜💜💜💜💜", "bubacarrdrammehg": "So is it possible to reduce it ? #if not is all good just be happy with it", "nicholekoonce": "Your belly was one of the first that I saw when I redid my feed to only follow body positive grams. I had always been so ashamed of my body...never allowing myself or lovers to touch my belly...as if it wasn't a part of me. I have a similar shape as you and to see you in all of your beauty helped me see it in myself. Thank you for inspiring my belly love. There is nothing more enjoyable than cuddling with my husband and him rubbing my underappreciated belly. You are an inspiration lady, to far more than you realize. Thank you for being bold and helping me to do the same!!", "hollisrendleman": "Magic, indeed!", "princesskyra_bbw": "Watching Lizzo perform, I cry every time. To see a body that represents mine doing something that I wish I could have done. It's so amazing. And I'm so thankful for the new generation of women and also the fat women who have finally realize they can be free and let go. I'm so so thankful to all of the pioneers who are finally getting us representation, because young fat women are going to grow up with so much more self-esteem than you were I ever got to grow up with. And the world is going to be better for it. Thank you for sharing your beauty with us💜", "nikki.clemmer": "😍 mind if i use this photo for a painting reference?", "tfbtay": "Don’t feel like I’m fat enough to be fat & beautiful . Don’t feel like I’m thin enough to be thin & beautiful 😬", "dionysiac_": "🚨🚨🚨🔥🔥🔥Beautiful 🔥🔥🔥🚨🚨🚨", "vitaminc3c3": "❤️", "alexanderlilly19": "❤️💗", "hlbarnes": "I think your belly is amazing and beautiful! I have also spent WAY TOO many years ashamed of my midsection. I have never in my life had a flat stomach and used to feel like this was something wrong about me. If I had seen bellies growing up it would have made a huge difference!! Seeing bellies as an adult has given me the courage to love myself and my belly. I wear crop tops now and no longer fear my \"belly line\" in clothes. You have been a part of that for me, so thank you!! ✨💖", "tbabi1986": "💖💪 god i wish i had your confidence..but unfortunately i dont.😔", "rosemaryandquartz": "You are such a babe!! Such an inspiring badass babe!", "theselemonstho": "I think my life would have been a LOT different. Especially if the only uncovered big belly I saw (my mother's, let's be real) wasn't self-shamed constantly.", "melissjones73": "My 8 year son loves my belly. Had 4 kids . He thinks it's soft smooth and beautiful 👶👶👶👶", "stayathomedragon": "It me! your tum is way cuter than mine though. 😍", "fatbuddhababe420": "I second this belly platform! My belly is without a doubt the one part of my body I struggle with the most", "kassidees": "Yes! 🙌", "kali_bopo": "Oh I do believe it would have changed so much!", "klyn_michaels": "Your posts make me so happy! That someone is taking a stand and showing a truth about bodies! Thank you for showing how bodies truly are, and that’s it’s okay just to be yourself! ❤️", "samlichtenstein": "This literally made me cry. Thank you.", "loveyoursca": "Love your belly 💓", "samanthajwhalen": "😭🙌 thank you."}