{"pavoninescales": "Oh! I can't really wear rings anymore because my finger joints are too swollen from multiple dislocations, and the rings themselves cause subluxations (weirdly), but this is such a wonderful solution. Imma start doodling on myself and figure out what I like!", "cass_alicia": "Ah I love them! I've always loved finger tattoos like this and at some point I want to get some too!", "itsmehevab": "Damn you make me wanna get some. Tattoos everywhere... dunno why im nervous to do fingers. Looks good! ❤️❤️", "sapphiresplendour": "That’s so so so beautiful ✨", "shellynu85": "I adore this!!! Even at my skinniest, I battle to find rings that fit, and this is the perfect way around it! (Schedules a quote for next week)!", "mi55_fabulos": "Looks like mehendi or henna", "plantbabefit": "So pretty omg 😍😍😍", "bone.girl": "They are really lovely😍 I got handpoked tattoos on three fingers last summer and I love them more every day. They make me feel feminine and special ❤️", "ladyspinsterscontemplation": "These are so pretty!", "arielx219": "Gorgeous! 😍 I Love finger tattoos!", "mamaissues": "IN LOVE", "ambercurvemodel": "Love ❤️", "oxlynettexo": "Awh these are so beautiful 💖💖", "jennysusie76": "This looks so awesome!! I don't have one tattoo lmao, which if you knew me is weird haha. Looking lovely!!😊😊", "creedlee": "🙌🏾", "mxsophiec": "I love them & that idea. I also have bad eczema in my fingers so this is a great tip! 🖤", "andreaskibsted": "You mention you have eczema, you haven’t been worried it might get triggered by the tattoo? It’s something I worry about myself... also, if it flares up and you scratch, will the tattoo be ruined? (Sorry, tattoo-virgin here🤣)", "gabbyd89": "And now I need some finger tattoos!!! 😍I love this!", "abbie_thee_pony": "Btw TOTALLY showed my tattoo artist this pic for inspo for my new finger tatts 😘🥰", "mariaschap": "@marissaalawton this is so tempting", "daddyzgyrl10": "Soooo pretty!", "fatlittlefingers": "Love love love!! ❤️❤️❤️", "crisol5577": "Beautiful love it👌", "sheawitzo": "Stunning!", "island_neni96": "Loving 😍 I always wanted to get my fingers tattooed on and this moon style is so freaking Gorgeous and mind blowing !! Rings put pressure and hurt my finger's so this would be a great alternative to not wearing rings 💖💫", "fatgirlstraveling": "OBSESSED!!! @auaulynn!!!!", "thecosycottageinn": "I had super bad eczema on my hands too! Turns out, it's a result of celiac disease (for me). Blew my mind! I stopped eating gluten and my hands feet and legs cleared up! I hope yours clears up one day too! 🤗", "emlang87": "I’m honestly obsessed", "nadiabokody\nVerified": "Verified", "gallagherrosem": "OMG I WANT, I can never find rings to fit my chubby lil sausage fingers but this is a permanent decoration, I’m obsessed 😍", "liveauthenticallynow": "These are gorgeous 😍🌙", "rajaaaaa": "Love this!", "barefoxbeauty": "🤩🤩🤩", "itswamboi": "@theculturedcow this looks like something you'd be totally into😂😂", "roses_n_cloves": "Nice! I can’t tattoo anymore but there is a berry ink that functions kind of like henna. I love using that to mark up my skin - I get to adorn and it doesn’t mess with my immunocompromised self.", "julie_hoffmann_45": "I love them. I want finger tattoos but don't know how to decide what to have. Is this all your creativity?", "viewrainn": "I want finger tattoos but I work in a kitchen. I wash my hands constantly. Seems like a waste.", "courtneynbrown": "@sydneymbrown fuck me up that’s so cute", "rainbowmadfate": "🤩🤩🤩", "_devinonearth_": "So pretty!💗💗🙌💗💗", "felimarie_": "Holy moly I’m obsessed", "blkrd_tab2": "Love love love!!! 😍", "plaidsquatch": "yessss love the lil aries symbol- for funsies once i wrote \"chub rub\" across my knuckles but i kinda like it", "tenderfish": "beautiful!!!", "thriftyfatty": "L O V E", "shelbylounails": "Omg I need that Aries accessory 😍", "horsmanlindsey": "In love", "juicy.plum.rds": "😍", "lotus.blossom.rising": "Beautiful", "cateyikes": "these are amazing", "itsmefifid": "Ooooh I love these ❤️❤️❤️", "enbymxmma": "I loveeeeeee omg", "indecisivespice": "welcome to the club!!!", "chriscrawford71592": "😍😍😍❤️❤️❤️🔥🔥🔥!!!", "cookielicious_cupcake": "Beautiful 🖤🖤🖤🖤🖤🖤", "doglady2018": "Mind blown!! ❤️Obsessed! I need similar ones now! RA means that my fingers swell and shrink periodically or are sometimes just too painful for rings, but this I could do! 😊😊", "vyvoom_": "💖", "moistgreenorganic": "you did it!!!!!", "feathersheathers": "I was able to get my finger tattoos to really stick by not getting my hands wet the entire time they were healing. I know it sounds gross, but definitely do it! I just had my S.O. bathe me while I held my hands up and out of the water.😌", "kali_bopo": "I love🔥🔥🔥", "emmajb_w": "I LOVE!!!!!", "selflovecenterstage": "So pretty. They look great!💜🌙", "jenny1116": "So cute I love this", "joeyjo422": "I love them!! 💜", "chami.rivero": "Love it, did it hurt?", "cloudykitchen": "But also that manicure 😍😍😍😍", "hhayesx": "These are SO cute!", "commiesharefest": "Love!", "browneyedyogini": "Loooovvveee!!!😍", "cypressmoonbeam": "I love your new tattoos and your nails! 😍 Adorable!", "sumajanedark\nVerified": "Verified", "memyself_andi007": "Wow those look dope!! 👌👌😍😍", "karmayogakim": "Oh they’re so lovely 💕 #ariessister", "saucychick": "I love it🔥", "jaimela77": "I love them!!!", "angeliqueplus": "Gorgeous!! I thought it was henna at first but its permanent? So cool!!", "loa_qween": "Love it!! 😍😍", "alanismilesofficial": "Ohhh wow... I don't think I can stand the pains... They're beautiful ❤️❤️👍", "ksabol18": "So pretty! I've thought about getting finger tattoos! 💜", "tcolemanisms": "I’m just going to live through you this week. Like, I want all of this. 😍", "loveyoursca": "oh love these 😍😍😍", "squadfem": "They are super lovely!! I’ve been wanting to get my fingers tattooed for the longest time! You suit it so well!", "nonbinaryogi": "@heatherm528 😍", "bubblegum_bxby": "These are amazing!!", "m.a.d.i.s.o.n.1211": "So pretty!😍", "plussizebarbieofficial": "A moon is my next tattoo! They look bomb!!", "leonies_lab": "GASP!!! These are SO PRETTY! I love rings but I have lymphedema so I can’t really wear them because my fingers swell. I even had to take my engagement ring off this week the swelling got so bad 😢 I think I might smell a solution!", "cassy.pennington": "I’m inspired. Love them.", "becky_loves": "Nails and hand tattoos 🔥😍", "katykabloom": "Love!!!! Dots dots dots! 😍", "islandgalplans": "yessssss!! i love finger art so much i have mine done too for the exact same reason!! soon going in for more bc they’re gorgeous 🙌🏻💕", "lynda.mac": "obsessed", "lilmissbridget": "They are so cute but I heard hand tattoos fade fast. Is that true? I’d love a 🌊 on my finger!", "cindycruzperez": "I've been thinking of doing the same thing", "lee.scheffey": "GORGEOUS!!!! ✨", "vitaminc3c3": "Cuuute", "jupiter_jasper": "💚💚💚", "rosebud2188": "Ohhh I love this!!! I’ve been wanting ginger tattoos.", "cleah.jean": "Dang girl you went all in! I love them so much", "moxiemoth": "Oh man it’s so pretty", "princessgmac": "OMG! Love this so much!!!", "thisflonghouse": "I love this and want them so much.", "nomnivorous": "Aaaaaah I LOVE these!!! I love rings but I lose them or am lazy. These are so cute and perfect and omg so into it.", "yaytaydanielle": "YAS!!!🔥🔥🔥🔥🔥", "yumaratz": "Very cool!", "boxthestars": "😍😍😍", "shantelleclementine": "They are stunning!! May I ask how much it hurt to you? I’ve been considering some finger tattoos!", "mnowicki332019": "Show me your back tattoo :)", "arithirlwall": "i love them 💕 but won't the eczema ruin the tattoos?? (just curious cause i've got it too)", "maggiemcgill": "So so so cute!!!!!", "krystal.settle": "So cute!!♥️", "hey.there.valerie": "I seriously LOVE this!!!! 💗💗💗💗", "lianabethw": "I tattooed my fingers last month! I also have bad eczema, I was so glad it was mostly clear while healing", "chel_bell89": "OMG I love them! 😍", "abbyf20": "@fatgirlflow so cute! Did it hurt getting tattooed on your fingers?", "frau_n.oder_so": "Awesome, I love it! 😍", "shellybo": "💗 them - getting @whatswrongwithmollymargaret vibes too", "moose.mece": "Ohh I love this, also this idea is great! I have a hard time fitting rings on my fingers and even if I do they are not pleasant to wear... Also are you an aries? 👀", "javabarfies": "Omg jealous 🙀", "abby_eg": "These are adorable!! I would love to get finger tattoos but idk if I’ll ever be brave enough 😂", "amanda_blaine_o": "Beautiful!", "kristin.is.cool": "So bomb!", "notorious.b.i.itch": "Gorgeous! I've been thinking of doing something similar and now I'm SO jealous", "ninagirlie": "GORGEOUS! I've been wanting to do the same.", "cbritwum17": "So awesome!! 💕 But how was the pain level? That’s what freaks me out about finger tats...", "kimhoneybeewood": "Oh gosh! That's so pretty!", "hurricanehal_": "Omg omg omg", "mommagoose09": "Just gorgeous. I have wanting hearts and maybe I should be brave enough now.", "badbetsyb": "😍😍😍", "schmalyssa_irl": "This is so pretty!!!", "mjmdarkqueen": "Cool 👍👍👍 Don't be sad of not wearing rings. Even without eczema, they have the big disadvantage of getting stuck whenever you reach into your purse to look for something. 😉😉I know what I am talking about", "adairmuench": "I love them!!!!! So cute! 🧡", "sarah_anne_whelan": "I love this idea!", "tayyylertot": "What a great idea!!!!", "maadeleinesophia": "Beautiful! I’m going to use this as a reference, I’d love to do the same!", "swhit128": "The eczema has kept me from wearing wedding rings too! I don’t know if I’m brave enough for tattoos 😭", "fatgirlflow\nVerified": "Verified", "roseybeeme\nVerified": "Verified", "dreadpiratemegan": "This is so inspiring- I totally want some now! 👀", "srsly_why": "okay but we gotta talk about those nails too bc WOW", "luellaarbre": "OMGGGG", "softbodytendermind": "Wow that's so cool!", "kfoleywellness": "Stoppppp omg you have the best aesthetic 😍😍😍"}