{"reza.masroor001": "Have fun day madam💖", "mami___carolina": "I just found your instagram, you're so beautiful ❤️", "francyel.amorim29": "😍🙌🙌😍👏🙌", "heib_1974": "❤️❤️🔥🔥🔥😍😍😍👏👏👏🔥🔥🔥🔥❤️❤️❤️👏👏👏😍😍😍", "angelscaribbeankitchen": "Big girls need love ❤️ too don’t hate 💯🙏", "anigrrrl23": "I want you to know I watched all six episodes of this show I had never heard of before specifically because of this post and I just wanted to say thank you because it is amazing and I would never have discovered it otherwise!", "_natebreezy": "😂", "lucamolteni98": "Che merda", "hadi_462": "👅😘😘", "9452.viktor": "😍😍😍😍❤️❤️❤️❤️😍😍😍 beautiful photos", "docentsat": "Nice prenses", "eto.saeed.41845": "❤️❤️💕💕", "caddymanvw": "🤢", "d.schiavon1": "Si ma essere fat ha I suoi limiti e non sono pochi", "morteza2888": "😚😚💋👅", "azm542812020": "Hey you hey prans hey love you are very nice your bodi is my wish love you so much are you reply my post please please", "armoragainstwonder": "may i ask wat channel the show is on or online platform? i would look it up but really having feelings of overwhelming information today. (it's ok if u don't respond!) can't wait to watch that show it sounds wo derful", "helisotherpeople": "SO TRUE!!! Such a powerful show.", "marcelo_sousa_oficial": "Que mulheres gordinhas", "laidoutdatsun": "Awesome pic", "liztonis": "😢😢😢😢", "crisol5577": "Only be happy forget this misery world.", "mashud288": "👏", "yadi_999_": "💋💋💋💋💋💋💋💋💋💋💋💋💋😛😛😛😛😛😛😛😛😛😛😛", "anil.rajpoot.902266": "Very sexy bbw breast🔥🔥🔥👙👙👙💋💋🌹❤️💣👌", "alx_funes": "😂", "wolfben1978": "kiss me", "ravibhawanai": "Very sexy", "keepcalmbbw": "💐💐💐💐💐💐💐💐💐💐", "m352708": "سلام آخ هش", "master_p_aka_phillip": "Get it o🔥🙌", "yolanda.mentor": "✊🏽🤟🏽💗✅🥂 🍾 • #Respect ___ #Respeito •", "yousif_salah_abdallh": "I tell her on your page, I want to marry you, beautiful glamorous, please reply", "carri_2323": "Yes I’m watching Work in Progress. Great show", "serramcclain": "It’s an amazing show!", "divaliciousbetti": "Love is love..congrats on finding each other xo", "mynameispappii": "What about beautiful 🌹🌹", "ziyad.albdrany": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "30099hs": "👌👌", "arsham.bayatii": "پشمام", "diezaroa": "Oh! You make a beautiful pair 😍❤️😍💕😍 Seeing people in love and happy showing their love anywhere, whether on the street or on social networks ... it's beautiful. I'm very happy for you! 😊", "mywholeotherworld69": "@fostermamaeva I'm poly 🔥", "vahidbooty78": "Follow me😍🙌 @fatgirlflow", "prsjwydyrn": "👏👏👏", "shalala1672": "I love you two and look forward to the day that I find true love💓", "radically_ky": "Yes!!", "halisdelal": "🔥🔥", "abolfazlheydari68": "موندم چطوری کیرش میرسه به کوس این😂😂😂😂😂😂", "syilmaz_02": "👍👍😍👍👍", "momozain.zain": "So beautifully", "columbuscurdnerd": "Ugh, Work in Progress is SO good. Haven’t seen the most recent episode yet but feeling seen is so beautiful", "fatgalhiking": "What a beautiful couple 💗❤️♥️🔥", "blossomed_selflove": "💗💗💗", "not_an_orchid": "Thank you Corissa for giving me hair inspo today! I’m meeting with my ex to sign our divorce papers and I was feeling really overwhelmed about it but I watched your YouTube vid on divorce this morning and I feel so much better about it being okay to allow myself to be emotional. ❤️", "eartha.kitsch": "So in love with this show for all these reasons and more. Thank you for being part of the necessary representation we sorely need ❤️", "carmenzofia": "😍....", "lurodo3000": "❤️Very close to where I’m at that part of town is very unique. ❤️", "sassafras_pants": "💕💕💕💕", "tararxa": "Love that show!!!", "just_a_bre": "Maybe there is hope for me.", "bearcent": "one of my favorite parts of the show is when Abby is yelling at people in the bathroom and says “look around you, you’re fucking ignorant!” so I randomly shout that throughout my day. i have the same issues in the bathroom. abby is relatable as heck", "tutti_crisp": "🎉🎉🎉", "elizabeth.mcgrath.3114": "It’s awesome you’re enjoying your authentic self and being able to embrace it!!! Much love 💞", "cursivevendetta": "You make me wanna cut my hair!! 😍", "leonies_lab": "Wow I had no idea such a show existed!!! I must watch it!!! I’ve always felt like I was completely left out of the media that I’d never see someone like me. I’m tearing up just thinking about it. You’re completely right, representation is so powerful", "organicskytherapy": "You keep doing you! love is 💗 forever! I know it in my soul! Ima straight chick and have always been an ally since my bff in highschool came out to me! I was sooo green i really didnt get what gay was (stupid sheltered family) i was just so happy someone else liked boys too🤣 but laughter aside he later told me he was contemplating suicide do to all the rejection and having to hide his true sexuality. He stated if it wasnt for my acceptance he may have taken his life! If i can do that for just one person then my life was on purpose! I just don’t understand the haters and homophobes! I will forever be an ally and love will always be 💕 love! Thank you for being so real with your followers! Its vulnerable and beautiful🙏", "fostermamaeva": "Any interest in polyamory??? I’d like to join that shit!😍", "ashleighamberboudoir": "I freaking love this post ❤️", "dreaareguy": "Wow wow wow I love you both so much 😍", "mythicalmae13": "Beautiful 💗 love from New Zealand 💜", "cassandove": "This is so tender, I’m in tears. 😭", "plantbabefit": "The world is changing. I think it’s awesome that we no longer have to be surprised that something can just be lovely and happy! ❤️ You and your partner deserve all the love and support in the world, just like anyone does 🌍 🤗", "janelkpage": "Work in Progress is one of my favorite shows right now! I’m a cis, straight woman, so even though it’s not my story I love seeing so many un(der)represented groups living and loving freely!", "queerwegoagain": "This is everything! 💛", "electricblueo0o": "You guys are sexy af! Is it creepy or weird of I say that these pics got me aroused?", "emmamcmack": "That episode made me cry too. Those moments of vulnerability when you are navigating intimacy with (what feels like) a really big secret about how bad it gets.", "octopuscanfly": "You are incredible and so inspiring 🙏", "_christiewhite_": "i love this. and i love the love that you and @comfyfattravels have. so inspiring! ♥️", "sallysquiggles": "Love photos of you and J together, you are such a beautiful team 😍", "stuffshethinks": "I have got it check it out! Thanks for the rec, and thanks for sharing your thoughts! 💓", "heather_bragdon": "You are so inspiring. You make me feel like it's okay to be me...no matter what that is. ❤️", "q_strom_99_walker": "🙏🙏🙏🙏🙏🙏🙏", "itsjuustliz": "It's AMAZING", "stellaroads": "I'm crying this week about my job. I hate it and it's time to move on. I'm scared to death, turning 40 soon. It's not the age that scares me, it's the starting over... I thank you for encouraging the vent... better things are on the horizon....", "peteysilhan": "You two make such a great couple 😊", "mrs_ekker": "My favorite couple! We are all best friends in my head ❤️❤️❤️", "gpetruccelli": "Your relationship is inspiring and beautiful. Keep sharing the love!", "perrybiz289": "Thank you for the suggestion and thank you for being you!💚", "eliziyoga": "This is stunning. I have to get into this show.", "rae_b_h": "You humans are just the best!♥️😍", "dahubs40179": "You are both such beautiful souls. I'm thrilled you two are together and wish you both so much love and happiness.", "lmaroney78": "Waiting for a kidney transplant 💚", "kateybecca23": "Crying because my dad has just left to fight the bushfires on Kangaroo Island (we live in South Australia) Its just heart breaking the devastation the fires have caused 😔💔", "sapphiresplendour": "Both of you make me feel like love is within my reach too", "gaylordtravelcard": "I love these photos of the two of you so hard ❤️❤️❤️❤️. And yes... Representation really matters. I am so sick of seeing non fat queer bodies.", "iambettymabel": "I LOOOOOVE THAT SHOW!!! ❤️❤️❤️❤️❤️", "lesleynj14": "#loveislove 💞", "samrosey": "💖", "manuel.gh.923": "Beautiful Girls😍", "jazzmynejay\nVerified": "Verified", "curvee2": "I LOVE THIS! It’s sssssooooo refreshing to see this!", "killerhoneybees": "I wish I could watch it! I don't have access to Showtime and it's a major bummer. 😭 I'm so glad to hear it's as good as I hoped though!", "poufmouf": "❤️", "kingkribi": "oooooh i’m definitely gonna have to go check that out!! thank you!", "ctofine": "Love you both. 💙💙", "niniebambini": "Good for you two🌈♥️", "pinmq": "Yessss I am loving Work in Progress!!!", "margotmeanie": "I haven’t even heard of it and now I’m gonna queue it up!", "michonnicole": "Crying cus I'm falling in love with a woman for the first time (she's always been with women) and she's breaking my dumb heart and idk what is happening to meeeeee 😭😭😭 also you're so cute I hate you. 🖤", "shelby._.lyn": "Y’all are the most adorable couple I have ever seen!! And seeing y’all has empowered me so much! Both you and J have made me comfortable in my own skin and in my own sexuality!! Thank you!!", "trutrulov": "You two look so beautiful together 💕💕", "thegooeylouie": "these photos are so intimate I feel like I just walked in on you guys! very beautiful though", "ladysasquatch": "The show is such a delight!", "wnate07": "Lovely 😊😊😊😊", "ritaemk": "You are such an adorable couple ❤️❤️❤️", "aldavemadem": "You two are just beautiful 💕", "theogermaine\nVerified": "Verified", "flash_my_kitten": "You guys are so cute 😍😍", "el_suizo2": "Vous êtes trop mignonnes 😘😘😘😘😘😘😘😘😘", "goo_ooder": "💯💯💯💯💯", "elwassaoi": "😂😂😂", "towfab": "Vous êtes trops belle votre amour est magnifique ❤️❤️❤️❤️", "kt_and_the.crew": "Work In Progress is THE BEST!!", "broadthatmobbs": "❤️ crying for Iran, crying for Australia, crying for the the Ukrainian airplane victims, crying because I just started my period an hour ago 😭", "cosmicvulture": "Is that the big fig mattress? Y'all still like it? we are so desperate for a mattress that doesn't end up flattened under us within 2 years", "l_y_n_d_s": "This is just beautiful. ❤️ I love the look on your face as you gaze at J.", "bloomiebloomie": "Work in Progress is so damn good. I am preaching about it to folks cause I need it to be renewed like a zillion times more than the L Word.", "an_empath_rebuilt": "I just love y'alls love. It gives this fat queer boy hope ❤️", "le_ballvini": "I cry every episode, but the last one really got me too. My heart just swells with pride and love. And I cuddle my spouse extra tight. It’s such an amazing show. 💞", "smelly_rumbles": "Also crying about to every episode because I have never felt so seen/ represented even tho I don’t share all of abbys identities. The show is brilliant and I appreciate you sharing your perspective/ the impact it has on you ❤️❤️❤️", "zeezaleez": "It’s an excellent show and also gives hope to those of us who haven’t found love yet, are not in their 20s/30s and are not straight size (add any other label that is not what society deems “the morning). I love it. And Theo is so cute!", "oxlynettexo": "I love you both ❤️", "deannr78": "I LOVE this show. When Abby and Chris start having sex, I turned to my wife and said, “this has to be the most accurate depiction of queer sex I’ve ever seen” honestly I don’t anticipate the L Word nearly as much as I do This show.", "jamshid.khojaste": "Love", "zhumbaaa": "Wow it’s amazing guys 🤩🤘🏻", "mo_o_re": "More of this 👌🏽", "marmotland": "My partner and I keep turning to each other and asking if this show is real and not just some happy dream.", "danielle.bex": "I haven't watched it yet but I think I'm going to pick it up. I had a similar experience when watching Todrick Hall's Forbidden. There's a love song between two high femme folks and I just started balling", "kerry.michelle.o": "You two are such an inspiration thank you. 💜🏳️‍🌈💜", "shesjustbeingashley": "I’m always rooting for the two of you. ❤️", "arthurhinz": "💓💓💞💞", "chriscrawford71592": "So important to see that kind of positive love and happiness in the media and irl 😍❤️😭🔥!!! Y'alls love is so wonderfully human and honest that I just CAN'T 😭😭😭😭!!! But for real I do ❤️ you and J!!!", "pretty_eyes71": "Health and money issues 😭", "quiethappyfatty": "You two give me the feels daily!!! I love you both so much, it's so amazing when 2 incredible people can join together and be the power couple that every one needs!!!! ❤️❤️❤️", "thebrunetteflamingo_": "💓💓💓", "blairfs": "Thanks for the recommendation! Will check it out!", "leftcoastlady": "Love that show!!", "liz_bug": "Yes!!! All this. That show hits home I’m so many ways. We love it too.", "beauty.shambles": "I cried because I’m in love. With someone who respects me and my values, who treats me like a queen and lets me shower him in love. 💖💖"}