{"dollykamdarkhokhani": "I can totally get u.. I am the same. I am terrified over check ups because of the same things u spoke about.. thank u for putting it up here.. now I know I am not alone 😔", "jarz3momma": "I completely understand and appreciate you posting this. I've grown to hate going to the doctors.", "oh.geri.oh": "It’s hard to find someone to take you seriously. I found a “larger than normal” doctor who’s realistic. The problem is when you’re overweight that’s all they focus on. If your head hurts = lose weight. Toe nail came off = lose weight.", "erinnichole1223": "I know an amazing ARNP in Highland that happens to share our last name if you don’t mind driving an hour to see her. 😉😉😉😘", "simpl_pz": "❤", "kristyfwalker": "I'm morbidly obese, disabled and hate myself. I stay in deep depression all the time. I've become agoraphobic because people are so mean. I can't find clothes that fit. I can't exercise because of my disabilities and weight. Most days I'm ready to give up💔😢", "rebeccawiggins": "❤️", "jamikins75": "Proud of you Girl.", "annaszabojdmba": "I left you some love on your YouTube depression video.", "mashud288": "Nice", "verowebs": "🤢", "godinagodwin": "Hujambo😍😍😍😍", "lonleytravels": "Life will only get harder as most obesity related diseases don't start to kick in until 40-50", "necro_86__": "Hope you find the help your looking for. 👍", "pinchita818": "😢", "dheerajkumaryadav97": "Wow beautiful looking lady... i will like to be your friend", "tryryche1981": "You are very beautiful ❤️❤️❤️keep you head up", "das_hanf_maedchen": "I love this❤️", "mohammad_tabandega": "جون", "markadam512": "Love the big boobs!", "md.mahade.58173000": "👌👌❤️❤️", "thedivinesupreme": "YOU ARE SEEN AND SUPPORTED 🙏🏽 TOMORROW IS ANOTHER DAY ❤️❤️ I’m going through the same shit right now, everyday is hard. We don’t know each other but Sending all love and positive energy your way. 😊", "alexisxarriaga": "Girl! You got this! You are beautiful! Just take it one day at a time with patience and kindness toward yourself! We are all rooting for you! The haters just reflect how they feel on the inside, so fuck them!!!!!🙏🏽🙏🏽", "lost.in.a.good.book": "🧡💛🧡💛", "delukious": "I’m so sorry you’re struggling. Thank you for sharing something so vulnerable. Your post is definitely helping someone.", "sangawamaya": "💪🏼", "jeremydolce": "🖤", "slouisemartin": "I admire your confidence to speak out. You are not alone with these feelings ❤️", "gothicc_grrl": "Doctors have gotten so much better about treating their fat patients, and I'm grateful for that 💕 like yes, please treat the issue I came in for, instead of focusing on what you think is wrong with me, kthx 😂", "uteless_wonder": "I feel this so deeply right now as I navigate my own health concerns. Every appointment brings panic and it IS exhausting. Sending lots and lots of love. We are here for you. 💗", "paigen42": "Doctor stuff is so hard. But you are worth fighting for! You deserve to be treated like a person and to get the treatment you need for your ailments. I know you already know that, but just know you aren't fighting alone. Thanks for being a visible presence and fighting alongside the rest of us.", "amymarkscouk": "I hope today is better ❤️", "roseybeeme\nVerified": "Verified", "inguanezruth": "Lots of love from Malta 💖", "mleczkomatik": "Eat less. Problem solved.", "carpenterkoch": "Just remember the world is better and less gray with your very existence. You matter!", "rosebudismyname": "This is so relatable and so important to talk about. Thank you for talking about it openly. Sending you love and hugs from London!", "ragnarock_": "Oh so much this. So many of us here with you 💕 you being so visible gives us confidence and power", "kushalshukla03": "Naughty at 30", "yadi_999_": "💋💋💋💋💋💋💋💋💋💋💋💋", "sondagsmy": "The one with values! it’s so hard sometimes ❤️", "ourthopia": "Good vibes to you from Portugal . take care ⭐⭐⭐", "edm.rainbowmom": "🌈💜💙💚💛🧡 Oh hunny bear, I've so been thinking of you lately and hoping your ok. I know we are strangers but you matter. The hatefulness in the shtty mean comments shitty ppl say online piss me tf off. I relate so much when you speak of these struggles. I have dealt with my mental and physical health for years. I totally relate to just being fckn tired. It's hard. I recently got a new therapist and pyschologist and it is draining. Just know you have a community of ppl who understand your doing your best and you take care of you. Much Aloha 🧡💛💚💙💜🌈", "halidou.sina.3": "Hello how are you 👏🌹🌹🌹🌹", "laurafrancesallen": "💕💕💕", "sugarharlot2013": "\" my values feel hard to live sometimes\" whoa...this!!! I completely relate to this post.", "goodluckcharm112": "You are not fat you are beautiful and you", "kate_isobel_cherry": "Thankyou for sharing this ♥️♥️♥️♥️♥️", "nick_atsaidis": "Oh boy, i feel that. Its good to know im not the only one, but my heart goes out to you. Take if easy carissa, dont let anyone get you down ❤️❤️❤️❤️", "justineimbruglia": "I’ve been avoiding doctors too for the same reasons. I’m slowly starting to go back but each time I have to push myself. I just wish I could find a doctor who treated me like a person and not a problem that needs to be fixed. Just know you’re not alone. There’s lots of us who feel this way. Also following you and listening to the stories you’re brave enough to share helps me a lot. ❤️", "geeky_theresa": "Same I get stigmatized because I’m fat", "wickedwitchofthecape": "💜💜💜💜 Hard relate. All I can say is keep looking after yourself. Sending love", "maddyy_love": "I told my doctor the second I walked in on my first appointment that my health is not completely determined by my weight. He's AMAZING!!! he realizes health is not simply the number on the scale. I was traumatized as a child when my pediatrician would call me fat and tell me anything and everything that was wrong with me was because I was fat. I could stub my toe and it was hurting because I was fat not because I hit it against a door 😂 blood work and vitals are more important than your weight. I'm so thankful my Dr sees this and doesn't treat me like a fat lazy blob. He even went as far as to tell me I'm healthy.. keep your head up, the struggle is real but you're strong.", "dana73mod": "good job!!", "kilecasey": "Sending light and love!", "heyevelien": "Sending you all the love❤️", "dvnuh888": "(((((fatgirlflow))))) <—- old skool aol chat hug 💕", "edwardscarola": "Sending hugs ((( ))) ❤️", "gina1bina": "💜🙏", "acornsforunicorns": "I'm different in a different way, but seeking help from mainstream sources has repeatedly left me feeling isolated and ostracized... there just aren't enough resources for people that fall outside of their boxes. I hope you find what you need. Thank you for sharing ❤️", "allyouneedisluff": "I feel this so deeply. Especially today. I greatly appreciate your vulnerability, it makes these feelings less hard. I hear and see you. Sending you all the love.", "emmabvedovag": "❤️", "jennynicole722": "Thank you for being brave enough to share your life with authenticity. You're not alone. I've struggled with this too often too. Thinking of you 💕", "marymadeup": "This shit is soooo hard! I'm currently avoiding the doctor because my regular, amazing doc is on maternity leave and her nurse practitioner is a hateful, fatphobic bitch... I have to suck it up and go, though, or they'll stop refilling my prescriptions...", "loand_behold_": "You are incredible and I appreciate everything you do!! Thank you!!", "julie_hoffmann_45": "I'm in exactly your place too. I have anxiety every time I have to see my Dr. He weights me every time and asks why I haven't lost weight. Then he sets a new deadline for weight loss and the amount he expects me to lose in that time. I've decided I won't be going back to him. So now I have to find someone that I can feel ok with. Thanks for putting your thoughts and experience out on the internet because it helps people like me know I'm not the only one getting this treatment 💖", "alisharivera76": "I understand", "lucillenat13": "💕🔥💕💕💕🔥💕💕", "aelienshe": "I've been putting off seeing a doctor for a while out of fear of this exact thing. Sending you so much love. ❤️", "comfyfattravels": "“My values feel hard to live sometimes” DAMN i felt that. Thank you for sharing your vulnerability with the world. Im so proud to know you.", "rubyreddead": "I've been trying to get myself to start seeing a doctor semi regularly and I can't bring myself to do it. Same with other healthcare workers :/ like I need a new dentist but my teeth are bad and I'm scared to be shamed about my teeth along with my body", "keegss6": "I’m sending my love wholeheartedly 🥰❤️ — you are beautiful and perfect just the way you are. Remember, there’s always light at the end of the tunnel.", "scarlettsixgun": "Did you get what you needed from seeing them? Take care today. Xxx", "heidishartrandnewell": "I hope this doctor continues to be unflinching in their support and treatment of you 🙏🏻❤️ I did the same cycle of seeing doctors, being told to lose weight to be less depressed, not being less depressed, and not going back. I finally found a great practice for my fat pregnancy and a therapist who is willing to listen.", "ann_parkhurst": "I will be 48 years old this year...have been overweight my entire life but never negative. Bits my body and it does great things for me. This last year has been the first that a new specialist said your weight is not the cause of everything and ignore anyone who tells you it is. I seriously almost cried. He was so upset that I had been blamed because of my weight for problems that obviously had nothing to do with size. Please let this be the way of the future.", "andysou05": "sending you all the good things 🧡 I hope the doc was responsive and kind.", "thresa.ramsey": "Sending you kindness and encouragement and all the good vibes. Hoping you find answers and just a reminder that you are “value” wishing you better days ahead doll. 💕", "geenalucero": "Sending love your way beauty! You are such an inspiration! 💜💜💜", "kxngugly1k": "Speak Yo Mind💯💪🔥", "kimberly_m_stewart": "I can relate to the point of exploding into tears while reading this. So often, you eloquently say things that I feel in my soul but struggle to put into words myself. Thank you, thank you. Sending thoughts of peace and love your way.", "paigezieglerr": "💛💛💛💛💛", "ziyad.albdrany": "😘😘😘😘😘😘💋", "halie1221": "Please keep sharing. I avoid doctors at all cost. I will let myself be sick for weeks before I finally reach a breaking point and go to the doctor. It’s bad.", "shelbylounails": "I feel you. I need a doctor who isn't such an idiot about weight...tells me everything (lab work, vitals) looks great but \"we need to get your weight down, do you want WLS or something?\" FFS 😑", "lcrate41": "Functional medicine. That is all. Leslee", "kelleezblanca_type2": "If you find yourself a kind and understanding doctor all this won't be hard anymore. And your trying to care for yourself and that's why it should be hard it's just change. Change for the better right? Be kind to yourself and help yourself. Much love and kindness to you💕", "elizaheb": "💜💜💜", "mettashowers": "You teach me. You inspire me. I am 54 and wish I had someone like you in my life when I was late 20s early 30s. I love who you are !", "sirenitallenita": "Ugh, I wish this wasn’t how it was for you. I feel the same though... I finally broke down and went to a dr after I had a fall because I thought I’d fractured my shin. The dr literally poked my shin, told me I was fine but asked about my eating habits (“do you binge?”) and wrote me a rx for an appetite suppressant. I was mortified and only go now if I know I need some kind of meds that I can’t get OTC. Not ok. 🤬😩 wishing you strength and peace ❤️❤️❤️", "carlogirl": "I am so sorry. I'm thankful I've always had great primary docs. If anyone in the Kansas City metro needs a primary doc, Tara Clark at St Luke's Primary Care is excellent. I've been her patient for over 10 years and followed her to multiple different practices.", "ctofine": "Sending you all my love. I’ve got chronic pain and other issues so, I absolutely know how hard finding the right doc is. I’m lucky. My PCP is an angel and I wish I could clone her for everyone. Sending you hope and joy, as well. 💙💙", "marinajane1969": "And HERE comes the #hatred. I have walked in your shoes and done the same thing with the same experiences with so called ''doctors'' who can't see past the fucking weight.", "sheyenne_dillehay": "Girrllllll I feel this. I just made an appointment to see a new doctor next month and I am SO nervous. I haven’t been feeling the best, I’ve been SO down and just straight up struggling. It is so hard finding a good doctor. I just want someone to understand. I’m not lazy at all, i don’t sit around and eat. I’m never home. I pray you get some much needed help from your new doctor!! I’m so nervous to see mine.", "softbodytendermind": "This shit IS hard. Hang in there. 💙", "s4ndi.h": "It is because of people like you, who share their stories and struggles, that I now have a little courage and expect more from my health care providers. Thank you 😊", "jenasjourney11": "I feel this so much more than you'll ever know💙💙 sending much love.", "mikkiberry40": "0 I understand, its the same here. I was just recently diagnosed with psoriatic arthritis and it’s all down my arm ,legs , feet, ankles and hands. Yes I’m fat but if i cant walker because of this psoriatic arthritis how can i lose the weight.It’s so hard to feel Beautiful .", "blushycatt": "I know the feeling all too well. I haven't seen a doctor about anything health related in a very long time. I still don't plan on seeing a doctor. But I know my health is a problem I am on the same boat. Best of luck with your new adventures with self care and health. ❤️👏", "tarabrookeinreallife": "Wow. Everything you said! 👏👏👏👏 sending you love and positive vibes. Thank you for sharing your life with us. 😍👑", "lizzywends": "I am always so happy to read your posts and admire your strength and transparency and rawness. You are remarkable and giving yourself today and everyday and trying to bring love to you is everything! ❤️", "deewattage": "I always follow up my question to a doctor with... and if I was the ideal body weight what would you suggest... cause that's the treatment plan I want.", "unskinnyshero": "Sending love ❤️", "alexyoga_uk": "💗💗", "lovedontlivehere_41": "🙏🏾🙏🏾🙏🏾🙏🏾❤", "sophknighton": "Needed this. Thanks for sharing 💘", "karmamamma": "That’s why they call it a practice.. they’re practicing on us!! ✌️", "amylawson01": "Be kind to yourself ❤️", "violetkm13": "I understand this so much. Keep trying til u find the right doctors... cuz once u do.. its worth it. You can do this😍🤗", "streganona_": "Im pretty certain i have sleep apnea but i haven’t sought treatment in part because i’m afraid of just being told to lose weight 😞", "ezcpainteroftheworld": "Flowing that love to ya! 🌟 It’s been a real hard few days for me too. We got this! Glad you found supportive medical care people. ⚡️💗", "taraparks77": "Same. Today was hard. Tomorrow.", "victorianachos": "Stay strong out there babe 💜💜💜", "mollyp1969": "Sending you so much love. 💜", "schmidtett": "Thank you for sharing...I hope tomorrow is easier and this new doc works out for you.", "journeyofstacy": "I feel you. No matter what i go for the doctors first comments are I need to lose weight. It is so frustrating. I got to the point where I didnt want to go for an earache. I hope you find a good doctor!", "rosewaterspritz": "I feel this so hard as I’ve been navigating doctors and health stuff as well. Sending you so much love 💕", "kylaaflynn": "I used to have a doctor that every time I saw him for anything would say have you been walking , playing sports and would literally pick at my weight every visit . My weight fluctuates from 170-185 and I’m actually fine with it , more than fine I’m at peace with it . And I’m definitely not going to go on any diets to make myself miserable . I changed doctors a year ago and randomly picked a female one and she’s amazing . Takes everything seriously and guess what never never mentions weight loss or my weight . Sending good vibes to you , changing your mood and mindset is hard but sometimes you need a boost even if it’s medication to help you through it . I’m glad I decided to speak out concerning my mental health and I’m not ashamed that I take medicine for it because it helps , a lot .", "mairimmh": "Sending you thoughts & support, you’re doing the right things by finding a helpful doctor then listening to what your body needs today 🌸", "misfortunateme": "I was just talking to my mom about this the other day. Every time i go to the doctor the focus is on my weight, nothing can have anything else to do with anything else. Spoiler alert this sort of fat phobic mindset allowed congenital arthritis in my SPINE go untouched for DECADES. At my last physical my doctor asked me if I was eating fruits and vegetables. And I had to stop myself from saying “what are those” of course I eat fruits and vegetables. Maybe my weight isn’t because I’m a lazy and gluttonous woman, perhaps it’s more than that. (It is) and the medical industry continuing to ignore that makes me RAGE. I’m sorry you’re going through it. Just know, you never have to do this exact day again ❤️", "panda_mony_": "💕💕💕💕", "lizirishgroup": "It is a struggle to find a doctor that doesn’t lecture and actually listens. Not everything wrong with me has to do with my weight, it makes me wonder what skinny people’s doctors say to them.", "lauren_nstuff": "Most providers are only listening to symptoms to prescribe medications to hide those symptoms. They don’t actually have the time to do a full deep dive to get to the root of the issue 😕. I had IBS, debilitating PMS, depression, anxiety, migraines and chronic neck pain. I’m now free off 5/6 thanks to a Functional Medicine practitioner! Seriously, look into it! Thanks for sharing your struggle. It helps us all feel less alone. Good luck ❤️", "nique1995": "Sending all the love! Take care of yourself and do what what makes your body, soul, and mind feel good ❤️", "shellywilson1378": "Sending love and compassion to you soul sister.", "movementmakesitbetter": "Being brave and taking steps thats awesome. You are awesome. 💕", "mz.klw": "One step at a time.you got this sis!!❤️", "melsuchawitch": "I get where you're coming from. I recently saw a new doctor, and she blurted out \"So, weight loss surgery...\" before even saying hello or good morning. It hurt a lot, and was dehumanizing. Sending love your way. 💙", "majesstic1991": "I've been feeling this way, a few blood tests and it turns out I have an underactive thyroid, can cause depression, anxiety , aches and pains, brain fog etc along with many other things! Hopefully this is something they can test you for as well and you can be on the longish road to recovery xxx", "nztebs": "Thank you for sharing. And thank you for being here, as you, as you are, perfectly acceptable, lovable and worthy of support and dignity. Last time I went to the doctor I sat in the waiting room weeping as the fear of fat phobia overwhelmed me. I asked the receptionists if they gave hugs and was blessed with the response of one lovely lady who just held me until I felt more calm and more safe. So grateful for the people who still know how to be kind. Sending love and hugs. ❤️", "natashakeel2018": "Raw, vulnerable, beautiful, truthful. You are so many things. Sad is okay too. Always. Tomorrow WILL be better. Today calm just kiss our big butt's", "thecosycottageinn": "Thank you so much for allowing us in today and sharing such a vulnerable side of yourself. ❤️", "sarah_fromearth": "♥️♥️♥️♥️", "mpenny226": "Voicing exactly how I feel. You are not alone. I haven't been to the gynecologist for a few years for the same reason. I'm going to brave up and get to one soon. I just want a doctor who listens and takes me seriously. I work in healthcare and I have seen a lot. I know exactly how you feel. Plus this year's winter is a struggle.", "donnienow": "😢", "m.eg.a.nn": "I'm so proud of you for going to a new doctor and advocating for yourself. It's so, so hard. I see you 💖", "delifritoexpress": "#followforfollowback #follow4followback #following ❤️", "mclachlan.j": "💕", "emmaincanada": "Your today is my yesterday. I posted about it, and I find the words I get from both friends and strangers are very comforting. Today is much better, and I hope tomorrow is for you too.", "missmegandaniel": "🙌", "jacqueline.anzalone": "I am with you, 100%. I want to pour my heart out here, bc it feels safe, but even still, I can notIt sucks. I am in pain, breathing, most days, and NONE of it can be helped bc my bmi is too high.", "cad086": "It’s so hard finding a fat friendly doctor! Sending love", "kordakinder": "So goddamned hard! Why do drs have to be so mean, I’m so happy you found one that at least was kind today. But it’s so emotionally exhausting!", "seelizshine": "❤️❤️❤️", "mith33": "Thank you for reminding everyone that hard days come, and hard days go ❤️", "shellyhassdenteufel": "I’m in a similar situation... and appreciate you sharing. I hope things get better for us both. ❤️", "liviehibbs": "That’s super hard to do! I’m really proud of you! My heart is with you, be kind to you ❤️", "katiemariecrafts": "I feel for you! My friends and I have been talking a lot about our fatphobia in medicine experiences lately. It's hard. I hope this new doctor works out!", "kelsisaurus": "Take care of your self. I’ve had difficulties with doctors because they just don’t believe the severity of my mental because when I have a good day I’m so happy and bubbly. I had to fight to be medicated to help with my long list of mental health. They just said try meditation and exercise forgetting that exercise triggers my ED. Just be extra kind you yourself today.", "noblessh": "I’m sorry today was hard. And sorry healthcare has been such a struggle. You deserve better. You deserve to feel well. Take care of yourself, find support and advocacy in your healthcare if you can- sounds like you’re on the right track with today’s appointment!", "efffatphobia": "Oh how I understand. I saw a new primary doctor a couple weeks ago and was so anxious before hand. I had avoided going to the doctor (and I'm a nurse) because I'm tired of being fat shamed. I had a pleasant experience and was so thankful for her!! I'm SO sorry you're struggling. Thank you for speaking up about this.", "thefattestbarbie": "The struggle is real! I am so grateful my fat husband and fat self found a family doctor that doesn't just think any problem I have is because I'm fat. Every time I see him I count my lucky stars.", "faeriethusa": "Sending you positive vibes. I’m sorry you’re not well and I appreciate your authenticity. I hope you get the care that you need & deserve. ❤️💜💜❤️", "nana_afia_996": "❤️❤️you", "lbf1976": "Take baby steps, improve one thing, whether it's a healthier breakfast, lunch or dinner. Or it can be trying to get a certain number of steps a day. Baby steps. Overhauling doesnt work for me.", "racheljop": "I recently got an actual diagnosis for depression-related fatigue. My doctor wrote it down on paper. It's real. Your struggle is real, it is valid, and you are allowed to give yourself permission to take a break when you need it 💕", "hello.krizzy09": "Do you have any suggestions on how to find a fat friendly obgyn? I am really struggling with trying to get to the drs without being denied birth control due to my weight", "paracerc": "I absolutely can not be weighed. After suffering for years from an ED and now mulitple other health issues I realize all my anxiety is in a number. I close my eyes and ask the nurses not to say it, speak it, or mention it when they put me on the scale. Here is the thing I have learned, everyone feels this way about something in their lives. Maybe it's spiders or snakes, but for me it's a number. So they all understand. I've never had anyone refuse my request and I find it makes my appointments go so much better.", "vintage_apple_pie": "Awww 💗💗💗 I feel similarly. Have you tried to find a ‘Health at every size’ Dr in your area? I think the website had at one stage a list of Drs who work from the HAES principles. I’m sure you’ve already tried this. Sending you much love 💗", "cazannesapiano": "🤗🤗🤗🤗🤗 sending you all the LOVE and support on the world.", "big_mama_with_da_locs": "One day at a time darling we all struggle at some point just don't give up💜💜", "ladydut": "Your doing a great job!", "manderin0822": "I love you. I'm sorry today was rough. You're an amazing amalgamation of lives and stardust. Every storm runs out of rain. ❤", "radical_reesie_d": "Oh man, I feel this. Three years ago I gained 30-40 pounds in a matter of months. Turns out I had a serious autoimmune disease messing with my hormones. Got diagnosed, got treatment. Fast forward a year later and I’ve gone from feeing miserable to feeling fantastic, having energy, and fitting into my clothes again due to the swelling in my body disappearing. The scale has only budged about five pounds or so, but I don’t care, I feel great! I go to the doctor and tell him how great I’m doing, and he just frowns at me and goes, “well, you haven’t lost as much weight as I would have liked you to.” So yeah. Now I’m paranoid of doctors. Middle fingers to that guy. 🖕🏻 Please, don’t let anything get in the way of your health (in ALL its forms: mental, physical, emotional). Even when it’s scary. You’ve got this ❤️❤️❤️", "scarlett0613": "@fatgirlflow I know how you feel I was literally minutes away from getting kidney stones removed after years of putting up with the pain only to be told that the surgery isn’t going to happen, a few weeks later I got a $4,000+ bill for absolutely nothing. Needless to say I still have the kidney stone a few years after that Embarrassing situation, and a complete fear of doctors for any reason what so ever. It’s depressing.", "lexiwilkinsofficial": "Stay strong. Not every day is going to be a good day, and that’s ok. Take a moment for YOU. ❤️✨", "authenticallycyn_": "Sending hugs and positive vibes!!! It sucks that you had to feel that way!!! But as a woman who has been 400+ pounds and has dealt with some horrible doctors you are not alone and you don’t have to put up withs any Uncomfortable situation that is based on another’s perception of YOUR HEALTH! Even doctors are clueless but I just want to say Thank you for your transparency and for sharing your story!!!! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "klyn_michaels": "It’s really hard to find a Dr who will listen, but I know they are out there! I hope you find the right one who treats you with the respect you deserve!", "jjohns225": "Thank you for talking about health stuff. I have been ignoring the doctor for a solid doctor and I'm REAL scared about trying to be serious about it.", "miss_mereditho": "I’m just beginning this journey too & it’s hard. Sending love & healing 💓", "beccamp90": "I struggle with the same thing... I am almost at the point where I’ve found doctors I trust who don’t blame what’s going on for me being fat. I still struggle daily and I know how you feel- it’s healing for me to see people opening up about the same issues. Sending good thoughts to you 💕", "bissybooters": "Thank you for being open about your experience. It's helpful and means a lot to know I'm not alone because I get that frustration so much. ❤️", "beccalikescookies": "Love you SO MUCH 💕💫", "theskinandwaxingstudiowindham": "Well at least u look cute ❤️", "fatgirlposing": "Thank you.. For talking about how hard it can be, for being you, for being vulnerable", "ppolcene": "Sending you all the love, sweetie!", "amyraekennedy": "I used to use Doctors appointments as a reward for weight loss. Like if I lost 50lbs I would treat myself to getting the suspicious looking mole on my back looked at. Seriously fucked culture!", "spaced_out_rae": "I see an endocrinologist for PCOS, every 6 months. He's \"the best\" in my area, and every time I see him, he tries to make me feel shame. Just saw him a couple of hours ago and he asked me if I have considered WLS, and I flat out told him I wasn't interested, and why. He looked stunned, but moved on. It's frustrating, it's dehumanizing at times, but I've definitely learned that if I just stay consistently blunt, it's easier (no matter who the doctor). Be direct, be blunt, say NO as often as you need.", "debicet": "Sending peace and rest for your soul today 💜", "bai.noelle": "you are a force and i am proud to call you my boss and my friend . i look up to you so much and i hope you know how proud i am to know you . take it easy today !", "mujermaravilla78": "❤️🙏🏼😘 I definitely know this feeling", "jenn_n_juice83": "I'm the same way. Thank you for being brave", "bubblegum_bxby": "I’m so glad it went well, that is genuinely one of the worst things to experience is the unfair power dynamic with medical professionals. I hope you get the care you deserve and that you start to feel better ❤️", "abaenormal": "🌟 massive support and love to you🌟", "msladykayla": "💜💜💜", "memyself_andi007": "I hear ya! Hope u get the help u need and its nothing bad ur going thru. Well wishes! 💜🙏", "katysalsa": "I have true health anxiety because of a fat phobic doctor that unnecessarily scared the hell out of me when I was 24. I’ve never been the same and I struggle with going to the doc. I’m so proud that you went to the doc and are talking about this stuff.", "leatherandglitter": "I get that, being overweight myself and having health problems is hard, it can feel scary and lonely. The one thing that I find that helps me on the day I struggle, meditation. It might not be for everyone, but it helps me to relax and recharge. When I feel good inside my mind I'm much more likely to make better choices for my health. I hope you feel better soon 💕", "lifeisjustaknockknockjoke": "❤️", "artistshelleymouber": "Oh my goodness do I know this feeling well. I’m so sorry you’re having to go through this- it’s a trauma we have to keep revisiting when we’re treated so insignificantly. If you need some well weathered supper- don’t hesitate to DM me. I’m glad you’re doing self-care...that’s so important ♥️", "allthingsnicolemay": "I’m in the same boat. I’m sorry. Fat phobia is real and so freaking infuriating. Here for you.", "cleestandish": "I feel this soooo deeply. Sending tons of love💖💖💖💖💖 I'm also glad you bring this up because it makes me (and so many others) feel less alone in this super-difficult-to-navigate topic. All of us who follow you love you to pieces and appreciate everything you do and your ability to be vulnerable about shit that is fucking soul wrenching. Thank you, from the bottom of my heart.", "okay_allison": "“Like... in my soul I’m tired” is a phrase I’ve uttered entirely too many times in my life. Thinking of you today babe and I hope tomorrow feels better 💕", "whitneysweet_writes": "I feel you. I hope this new doctor is the one for you. 💜", "caitlin_rose93": "Feel this so hard, especially this week. Been going through similar things. Sending positive vibes your way ✨", "terrifast": "Hang in there! You’re very inspiring to a lot of people and being vulnerable and admitting life isn’t perfect makes you relatable. Thank you for being transparent, instead of fake. Take care! 😘", "chockycakes51": "Be kind to yourself x", "kellynking": "Hugs to you ❤️", "april.lauraa": "You’ve got this beautiful! Like all the days before, you’ll pick yourself and keep moving forward. Sending lots of love ♥️", "missweeks": "I cancelled my physical last week because I could bear the thought of another doctor telling me to lose weight. It is soul crushing and so defeating. Decided that I’ll go to a functional medicine doctor instead because they tend to look at the body as a holistic system and tend to be a bit more open minded and realistic. Fingers crossed 🤞🏼 You are sharing the heart of so many xxx", "jgrundy0926": "I almost let myself bleed to death early last year because I didn’t want to go see my OBGYN due to my weight. Trying to find a doctor that is honest but kind and wants to listen is hard to find. Sending love from TN.", "telainae": "I didn't go for seven years because of stress and shame and just not wanting to feel unheard and unseen, or being seen (and feeling) like a failure for not being able to \"control myself,\" or some combination of all those things. I know how brave you were to make an appointment and go. ❤❤❤", "faithwad": "Hope just sharing helps. Love you", "jbcunn72": "You really need to appreciate your self .. never look down on your size because alot of people all try to look towards u .. it what your heart decide , not what you outer parts makes u look like", "diegobh_art": "Your picture itself show it is being hard my dear Corissa, but don't give up my Lady. Being to doctors is quite a thing I have being coming and going through many years with different doctors and of course most of them the first thing is to say less fat. Well I have to say to my latest one I have answered that I take my life as it comes and that I am not looking for being bigger neither thinner, if the tide makes me go thinner I go if it makes me go bigger I go taking care of not much to be because I don't want to struggle. But beyond that, just take day by day dear, is the best we can do. If I come to have a bed day, I just have it, because is normal to have bad days, life is not a 24/7 smile and joy. We want that of course but is hard too to make it happen ALL time! Sending all the best love possible and awesome vibes to you my lovely @fatgirlflow ... Just that flow...", "goo_ooder": "❤️", "progressmom68": "Bless you, honey. I started a year and a half ago trying to take control of my health and find fat-friendly providers. It’s not easy. But you’re worth it. You deserve the best of care just like everyone else. I’m so proud you took such a scary step today.💕", "andimjulie\nVerified": "Verified", "felecia_kingdombillionaire": "I understand. I can go to the doctor and say my thumb hurt and they will work in the fact that they feel I need to lose weight. Like wtf does that have to do with my dang thumb 😂😂", "aprilmarches": "Super relatable 🧡🧡", "aijea": "I feel this weariness as well, lately. Good on you for taking care of yourself, beautiful. That is you living your values. 💖", "chriscrawford71592": "How is this my experience with every doctor in my adult life 💔?!?! I'm sorry this happens to good loving and kind people like you...", "amy_vrpm": "I feel ALL of these sentiments so deeply. On top of it all, my body is failing me and I have a disorder of the fatty layer and the doctors just do NOT either #1 care or #2 take the time to learn. Most often it's both. Sending you strength and love 😘 Also, we should connect more virtually, you seem pretty damn 🆒 💕🙋🏻‍♀️ Hi from Seattle, WA ✌🏻💗", "modernvintageclassic": "I so hear you. I just had an MRI on my knee after dealing with a combative patient at work (I'm a psychiatric nurse) reading up on the results what I got is \"basically this torn mensiscus happened because I'm fat\". I'm soul tired, too.", "fancy_tomboy": "Take care honey", "nursemurderer": "let today be hard and know that it may still be hard tomorrow, but you’re gonna try it again ❤️❤️ rooting for you.", "supersnazzykristen": "Congrats on your big step of courage! That's a lot to be proud of! 💛💛💛", "ogwolfbri": "❤️❤️❤️❤️❤️", "danielle.bex": "I feel this deeply. I have a list of doctors appointments I need to make. I just really cannot wrap my head around paying someone to make me feel more isolated and broken when I go to them for help. ❤️ Thanks for sharing.", "danniraec": "It’s really hard. Sending you support ❤️", "lostmoosecreations": "Totally understand lovely... I never go to doctors for same reason, even when I went for my ears syringed once the first thing they said... wasn’t hello, but we need to weigh you🙈", "margi6999": "❤️ Much love to you, always", "kevinao": "Sending big hugs to you 💕", "dammitslade": "💜💜💜💜💜💜 sending love to you.", "catherinemlea": "Sending love. For anyone who might be interested, google “how to speak up against fat phobia - tips for navigating conversations that dehumanize fat folx.” It’s a pay-what-you-can ebook that has lots of practical suggestions. I wish there weren’t a need for people to advocate for basic human respect, but till then, I promise to push for fat positive healthcare and to talk to everyone I know in the medical profession about anti fat bias. ❤️", "hannannogram": "💜❤️ Sorry you're struggling, thank you for sharing with us your community so we can feel less alone - you deserve to be treated with kindness from your doctors so good on you for seeking it. You're so right that tomorrow will be better, but it's also good and healthy and wise and true to say it's hard so good on you for honesty and vulnerability. Pain and struggling and discomfort are okay to talk about, thanks in big part to y'all who talk about it and normalize it! Sending love from Minnesota 💕", "thecurvyyogateacher": "No mud no lotus and girl you a lotus keep pushing through 🌈x", "tanilovesyou": "I understand and empathize 💜💜💜 it's sad that this is a reality but it is. I pray that you get the help you need and deserve 💙💙💙", "girlletgo": "🧡🧡🧡 youuuuuu😘", "thekgz": "Oof, this hits home. Sending you love and light ✨", "agatha_marie98": "Today is hard for me too, thank you for sharing ♥️🤙"}