{"la_rosss": "@rosiee.rosee", "hoeson4four": "You shouldn't promote being fat, it's not healthy", "lavme83": "💙💙💙", "mondowaf": "Um.. No... This is unhealthy. 🤮", "brook_stein": "Heart disease will get you soon enough", "whitegirl_magic2": "What are you going to do when diabetes takes your feet and you cant get your snacks ? They are going to have to cut a hole in the wall to haul your fat ass out on a flat bed truck", "foldedright": "disgusting inside and out", "labellalaurita": "i love this message! we are here to stay! ❤️❤️", "dharam_teches": "I can reduce your fat", "tattoos_and_yoga": "So this didn’t age well....? 🤷‍♀️ it’s March 22 and we’re about to be in the fight of our lives, but good thing we celebrated obesity while we could, right ? 🙈 People, wake up! Obesity is unhealthy and we’re seeing the consequences in real time. They’re already rationing ventilators and it’s just going to get worse. Covid patients with diabetes, hyper tension and cardiovascular issues are dying. Guess what contributes to these conditions? Obesity! Please recognize that your life is worth more than this. No, i don’t hate fat people. My mother is almost 400lbs and i am TERRIFIED for her because if she gets covid she is going to have a hell of a time. I’m saying it’s possible to love yourself AND take responsibility for your health. Please please please stay inside and take quarantine measures to try and protect yourselves.", "inactive5643874": "🔥🔥🔥🔥🔥", "joaohe5632": "Linda😍😍😍😍😍", "sighclopss": "🙏@rhiannonhabkouk", "leinonen71": "I don’t think speaking bad will help. Everybody has the fulll right to live her life as she wants🧡Wonderful that you love you body but it is not healthy to have overweight. I think, or acually know, that a healthy lifestyle can make you love yourself as well. It is wonderful to be able to run, exercise, eat healthy and have a ”normal ” weight. Cut eating sugar and flour - and then enjoy life! I wish I had known this simple ”secret ” years back. Sugar and flour makes us overweight and depressed and gives us inflammations in the body. Love🙏🧡", "amir_montazem1987": "💋💋💋💋💋💋", "callmedadawg": "I literally fight and support a fat woman. Simply because I lost my virginity to one and I prefer to only date them. So I understand and appreciate, what they go through daily. Plus size women just want to be treated like everyone else human. Not told day to day, by none professional doctors. On how to eat, how to live, and educated on being fat.", "rckapas": "Damn you are sexy", "marcysmeltdown": "#worldobesityday ??????? Realllly . This is ridiculous dangerous and a disaster waiting to happen mostly because these people who look up to you aren’t all lucky enough to have perfect health, much like yourself. Having to sleep with a breathing machine is in no way the picture of health or comfortable. I always hear obese people talking about how comfortable they are in their skin.... but are they really ? Yourself and your community talk about diet culture being deadly for people but how is the message you’re sending any different . Heart disease if one of the leading causes of death for women among other things and obesity aggravates the condition so why would you even suggest or advertise being overweight ????", "joliedodue": "Love the pic and the speech 💪", "valerissa__official": "PlussizePower😍💪🏼💪🏼❤️❤️", "anaheiki_rising": "You are radiant!!!", "laurasparklesfairy": "😍😍😍😍🤗🤗🤗😘😘❤️❤️❤️", "ladykakashi35": "❤️❤️👏🏻👏🏻 Yaaaas 👌🏻👌🏻💜💜", "t3rng": "❤️❤️❤️❤️❤️", "lez_chillll": "You are amazing. Seriously. 😘", "shesjustbeingashley": "Yesssss. Thank you!!", "dickalan": "But you can admit that your chances of getting diabetes are drastically higher, and heart disease is something that you always have to fear, I'm all about body positivity and accept you as a person, that's it. World obesity day, what a fucking joke", "luvbug8872": "💖💖💖💖", "haidar_balboa": "Wow", "simplyamy44": "LOVE, LOVE, LOVE!!", "fearless40ishfatgoddess": "Would you please follow me? I've just started this IG for fat, over 40 moms. I could use the support. Thanks ❤️", "itsjuustliz": "YES THIS IS EVERYTHING shared 💕", "chriscrawford71592": "😍❤️🔥😊😭 you kick ass Corissa!!!", "murkydepthsdyes": "❤️❤️❤️❤️❤️", "angelblake4eva": "So beautiful like a goddess", "annalenapgr": "🙏🏼", "letsgetthisscottiestarted": "I love this so much", "katanafatale": "Thank youuuuuu💕", "violettewings": "👏👏👏👏👏", "awadkins_66": "u are beautiful", "hjwdewit": "Your body is your body and you are so beautiful 😍", "leenapentti": "One of the biggest mistakes I've made in llife has been putting things on pause for until I get thin. I'm not doing that anymore. 💗💗💗", "zpankovcin": "Obesity isn’t an epidemic?? It cause heart disease, high blood pressure, heart attacks, diabetes, strokes, gallbladder disease, osteoarthritis and so many other health issues that accumulate over time....", "koolkonfidence": "I know girl i know", "iamsosoart": "😍😍 Thank you 💓 for the wonderful post", "s_colemania": "I love this....’obesity isn’t an epidemic. Shame, medical malpractice, and diet culture are’....yes!!!!!!!! You’ve summed it up perfect. Someone put this on a sticker or something!", "brandongist28": "Sexy belly", "biglatinct": "👏🏻👏🏻👏🏻✌🏻", "sapphiresplendour": "Hugs to everyone", "khawaja6276": "very nice and so beautiful", "stadjer94": "🤮🤮🤮", "smxffy": "not only is this empowering and iconic but it's cute as fuck too❤❤", "kirstyhlovell": "Thank you 🧡", "mau_hit": "Being unhealthy, developing cardiovascular issues and making yourself more prone to diseases is NOT “self love”.", "metalli_g": "Your beautiful words keep me strong. Keep representing us girl ❤️", "thepinkwondersjourney": "😩c’est plus fort que moi je dois te tag Zaber @fruitysassy ça c’est un désastre. Le monde qui crée un image ‘normal’ du monde quadruplement obèse. It boils my blood. C’est pas sa te et c’est pour masquer la vérité dans le fond. Omg fallait que je dis ça à quelqu’un lol", "yummymummy40": "❤️", "thepoisontart": "If you get any cuter I'm gonna DIE! 😻", "living_la_vida_jenni": "Help me be like you!", "alexasimitzi": "How is obesity not an epidemic? So science is wrong? It’s still unhealthy to be overweight", "taylorwolframrd": "Love these pics and your words! 💕", "megthompson44": "The JOY in this photo 😍🙌💕", "abbeysjourneyx": "gorgeous 💛", "el_suizo2": "Mmmmmmmmmmm sexy body 😘😘😘😘😘😘😘😘😘😘😘😘😘", "dotandrose": "Yes!! All of this!!", "arisbel7": "🤣🤣😘😘🔥👏👏😍😍😍❤️❤️❤️", "kristenlynnette": "You’re perfect as you are! 🖤", "tofumom": "❤️❤️❤️❤️❤️", "jennysusie76": "Beautiful!!! You're awesome!! 😍😍", "nick_atsaidis": "Thank you for this, your amazing, i so needed this in my life right now 💜💜💜", "umarmalik777": "❤️❤️❤️🔥🔥🔥✊🏾✊🏾✊🏾✊🏾", "trexcrossing": "Goddess 👏🏼", "ok478": "I needed this reminder today! 💖", "ally_margie": "You are the reason fat activism and self acceptance is a part of my identity. Thank you!", "tishasweetcandy": "Beautiful", "lorakgrady": "Thank you for all that you do 💖💖💖", "andersonrangelvital1982": "Gostosa", "melsuchawitch": "I'm not exaggerating when I say that your words have saved me from a dark place quite a few times. Thanks for reminding me that it's okay to be me, the way that I am- fat and all. 💚💙🖤", "_bopo_mama_": "💗💗💗", "embraceyourbodyintuition": "The expression on your face in pic #2 made me squeal with delight ♥️", "ellcina": "You are such a damn gift. Ilu.", "xxfuffyunicornxx": "Say it again...louder for the people in the back 🙌👏🙌👏 I couldn't said this better, darling ❤️❤️❤️", "totoroto0927": "very very beautiful💕💕💕love", "beththompsonryan": "Love you💕💕", "victoriadonelda": "proud that you’re my mom 💜😌", "efffatphobia": "😭😭omg I love you. Thank you for this.", "songforbaby": "♥️♥️♥️", "taracampocia": "I shared your post because it meant so much to me to hear these words today. You said it better than I could. I hope that’s ok.", "fakebutokay": "I assumed it was a random holiday like national wine day or something, cuz all I seen are cute bellies on my timeline all day. 😂😂 I LOVE this for you. Kidding aside, thanks for smashing this fatphobic holiday & bringing it's shitty existence to my attention. Fatphobia is harmful to all. 🤟🏾", "jess_smith_86": "@fatgirlflow thank you for being you and allowing us to be us ❤️", "mom2magnus": "Oh my goodness! This is the truest and most beautiful thing I have ever read/heard about fat bodies. You are amazing, thank you 😘", "alanamantonyoga": "❤️😍", "sydsativa_x": "@whatxwhatnot", "dn_yl1778": "💎💎😍😍🔥🔥", "theoriginalfootographer2.0": "💯🙏🏽", "meghantonjes\nVerified": "Verified", "ladypalerider": "Beautiful positive words in a society so inclined to stay negative and doubtful", "erin.dodge": "💖💖💖", "bridget.sundeen": "I love you so much for this post and everything you do for us in the fat community. 💗💗💗💗", "cherubmermaid": "❤️❤️❤️", "laconchadetu34": "So beauty belly", "venustusphotos": "I love a belly!", "cat.hatfield": "I fricking love this!!! I wish little me knew what I know how.", "mustangsallytwo": "Thank you for tagging me, friggin love these pictures ❤️", "slumberpartypizza": "I love this!! You’re the best!! (And adorable too!) 💗💗💗", "lieska.guzman": "Thank you ❤️ love u", "markat826": "I think you'd love hearing Heather Mae sinng her body anthems. @heathermaemusic", "happyfattransman": "You are a beautiful ray of light! 💕 I am very thankful for how you share yourself so openly and loudly even when it is difficult to. Thank you for thinking of me and for helping me along in my own personal journey.", "_.kidf": "This was a wonderful and inspiring captuon, and fits well with the picture! I love these posts, they show me the good in people. Keep doing your thing!", "fatgirlflow\nVerified": "Verified", "hooksnsnoots": "Hell's yes ❤️", "aaliyahnica": "My inspiration in life 👏🏽💕", "raven_illusion": "As I struggle through another bout of depression induced body image issues I really needed to see this. I stopped posting on here because I felt that my body wasn't worthy to take pictures of and show to the world. I'm a fat, gay, cis woman and I feel when people look at me that don't see anything but the fat part. Thank you for proving to me, it truly is okay to love me.", "styleisstyle": "💙😍💙😍", "tonimakesdinner": "You are radiant 😍", "hayliejeaan": "💘💘💘💘💘", "marcus.rodenbaugh": "Love this ❤️", "jewelz0901": "❤️❤️", "kellybellyohio": "Love you friend!", "thomastraore9": "Maman sita", "nikwojo.mua": "True beauty!! So Beautiful", "rens_007_": "Wauw wauw Delicious 😍😍😍😍😍😍😍", "natalieinthecity_\nVerified": "Verified", "kmw_plus": "You are so soft and beautiful. Thank you!💜💜💜", "diegobh_art": "Have a wonderful day enjoying yourselves bodies!!! Self loving is something that we must daily work on!!!", "trashyleslieknope": "Thank you so much, you affect my life in such a beautiful and positive way and I look forward to see your posts in my day.", "gayscarletttttttt": "All of this! 🖤🖤🖤", "leave_me_alone_pizza": "Oh wow. This hit home. I lost over 100 pounds and kept waiting for my life to start, for my self love to kick in and when it didn't I developed an ED. I have since gained all my weight back and I'm in recovery and loving myself in THIS body right NOW.", "cosiho_m8": "😍😍", "hubbytoyoli": "Sexy", "meg.boggs\nVerified": "Verified", "sensiblyyou": "💗💗💗💗💗💗💗💗💗💗💗💗", "mehrabharandi": "@fatgirlflow Obese people are kind❤❤❤", "d1nonlymague": "Where u get d sweater", "ericamouchnutrition": "Amazing words and love all the new-to-me accounts you posted! 😍", "hazardouswaist": "YESSSSS", "peteysilhan": "You have an absolutely gorgeous body. Keep being the true you that you are 😊", "readytostare\nVerified": "Verified", "cindybeckdesigns": "Thank you. 👏🏽👏🏽👏🏽", "danielleisanxious": "Thank you for this. You are truly amazing 💚", "katie.wanders.happily": "If you take one glance at my profile, you’d see the difference you’ve made in my life. You have me the strength to wear the things I want and I’ve become so much more confident for it! ❤️ of course I still run into assholes that want to speak down to me in public for no reason, and it stings, but I have your posts to go back to and re-center my mind. So thank you ❤️", "margotmeanie": "I adore you and these words 🖤", "carlosbeggs": "Loving this picture! You look radiant 🙌🏻", "madetobebee": "You’re truly so wonderful. ❤️", "em_is4cr": "I just Love you💕🙌🏻", "beck_clasen": "you inspire me everyday :)✨💓", "meg_slate_": "😍💞😘🙌🏼🤗", "xmarthin": "Yaaaaasssss!!! 👏👏👏👏👏", "hollyvond": "I wish I had your confidence", "g.argel": "😍😍hermosa mi amor te ves deliciosa", "aryazahedikia6": "Hi my heart owner 🌞🔥🌞God bless you I'm happy with you marriage and injures life together💗💍 👌💎👍I lives in long beach California and I can make you happy fully service your life", "jazziwald": "Beautiful ❣️", "_allison.m.clark_": "My heart ❤️❤️❤️ love love this and you!", "chayjoshlivy": "following every single one of you fucking wonderful humans!!!!", "georgiagogglebox": "❤️", "hakunamakeda": "Thank you for being a champion for yourself and all of us 💖", "geekpurl": "So much 💗💗💗💗 to you babe!", "hannannogram": "Yessssss say it loud say it proud!!", "liblibby": "I love how much you love on your belly in photos. I recently had a photo shoot and I LOVE HOW MY BELLY LOOKS IN THEM! Sweet bellies deserve all the love.", "wholebodywholetruth": "Thank you for your voice!", "chubby1esbian": "🙌🙌🙌😍🤩❤️", "dammitslade": "💜💜💜💜💜", "softbr0": "bless fat babes worldwide ❤️❤️❤️❤️❤️❤️❤️😍😍😍😍 truly magical", "luellaarbre": "Honestly you've always had the BEST belly photos ✨"}