{"annmarie2718": "I would LOVE to hear your outdoor stories and knowledge! I am definitely an outdoor girl, and feel same about representation and equipment issues for fat humans.", "jerseyjayellekay": "i would LOVE this! my husband and I have been talking about wanting to get some beach/camping chairs, etc., but so many of them are painful for me.", "harlequin_nikki": "Yes please!", "mirandalynchh": "Yes!!! I completely agree. Have you found a good kayak by any chance?! I have been dying to get one but scared bc of the limit ):", "littlefevers": "God yes. I have similar suspicions about myself. But I don’t know how to make the world an accessible place for me.", "fine_as_i_am82": "Thanks for posting where you got your sandals- they’re cute!!", "ehwhysmom": "I'd read it! 👏", "morosemermaid": "Yessss", "khrystinaa7": "Yes PLEASE!!! I've been feeling this way the past few summers too. Any suggestions would be amazing 💕", "angelicamar1e": "I would be SOOOOO into it!!!", "cassandove": "YES, FAT FRIENDLY OUTDOOR LIFE. If you ever find plus-size-friendly kayaks PLEASE let me know! Kayaking is one of my favorites but I haven’t found a good plus-size kayak EVER.", "zazzyzkt": "Oh hell yesssssss", "agnes_melissa": "How long have you and Jay been together? You two seem very sweet with each other ❤️❤️", "janetrsutton": "Yes! I feel this and would be super interested!", "joynado": "Absolutely!!", "route66foodtruck": "Relax & paz 👏👏", "theghouliestghoul": "Yes please!", "that_girl_candice": "Yes, please!", "the_eclectic_e": "💙💙", "andiegetslost": "Yes please!", "tarahjeanking": "Yes!! For so many years I felt incapable of doing so many things outdoors (and in) because of my size. I finally had my lightbulb moment about a year ago when pushed to ride a bike on vacation. IT WAS SO FREEING! And I am able with THIS body to do so much more than I thought I was able/allowed to do. More of this and more support for people in this place is an important and needed conversation!", "christinedrawdy": "Saaame!! Outdoors stuff just isn't fun.", "maraze79": "Yes. Definitely!", "andersonchakal31": "⊰🌸⊱┈──╌🦋 qυe caracтerίѕтιca oυ poѕтυra de vιda você тeм тenтado мυdar, мaѕ não тeм conѕegυιdo? você pode adιar мυιтaѕ coιѕaѕ na ѕυa vιda, мaѕ não a decιѕão de ѕer aυтor da ѕυa próprιa нιѕтórιa. aғιnal de conтaѕ, a vιda é υм grande lιvro. é ѕυa reѕponѕaвιlιdade eѕcrever ѕeυѕ тeхтoѕ. penѕe nιѕѕo! ⊰🌸⊱┈──╌🦋", "sharpamy": "Hell Yas! Please! I live in PNW. All people do is outdoorsy things.", "stevibee_kc": "I would love to read about how to make it easier because I love being outside but lately the summer just feels like pain and makes me not excited for it anymore.", "meganladusky": "Yes!! Omg please do this. I just moved to Colorado from Missouri and I would really appreciate something like that.", "bluegraygreen17": "Super into it!", "alyssaleeflorence": "Where is this?! I live in KC, and this looks like a dream! ❤️", "thatsannie_ohyeah": "You should follow Sarah Robles. Fat Olympic athlete and she's passionate about outdoor accessibility.", "fatwxwoman": "Yes! I've been wanting some outdoor sandals but don't know which ones are best for wide feet b", "mandeelokins": "Please please please!! I love outdoors, but as I have aged and gotten fatter I am finding some things hard or impossible!! I miss gardening and bike riding!!", "lauralew83": "YES. I would love it. I too love being outside, but find it hard to get myself out there. I want to know what hammocks/ lounge chairs are most comfortable. I want clothing that is comfortable that won't make me sweat more than I already do. I want a bike BADLY but don't know where to start to get one (let alone if I can even ride one anymore!!!!). I want a swimsuit that doesn't look like a muumuu, but also my boobs are not spilling out of it I move. I want to see your suggestions!!", "fat_mom_coding": "Yes please!!!! I miss being outside as much. Lawn chairs and outdoor spaces aren’t made for me so I stay inside mostly.", "johannab83": "Damn I needed to read this. This is exactly what I need to do. ❤️❤️", "sarahbellum89": "Hell yes! This is something that I have struggled with being in a larger body.", "kerriquist": "Yes please!! I spent my entire childhood outside, in the sun and water. It didn't mater then that my chubby belly poked out of my bathing suit. Now I'm 45 and scared to wear shorts. I still love the idea of being outside but sometimes the logistics are difficult. You are so inspiring and I would totally love ideas for getting back out there. I miss the beach!!", "reesycup30": "I agree I love being nature. Around people not so much", "endlessokra": "I, too, am an outdoor fat 😍", "dcgirlnjersey": "Would love to see this!", "dog.mom.of2": "Yes to all of it!! About the shoes.. I typically wear a women’s 11 wide and love chacos, but the women’s wide still weren’t wide enough so I found that men’s wide are wonderful!!", "stormolsen": "🙋🏼‍♀️", "saralinkousstephens": "Wide width shoe’s are the hardest to find!", "la_rosss": "YES!!!!!! Ah that would be so helpful and reassuring", "killerhoneybees": "Yes, please! I live in such an incredible place for outdoor fun (Portland, OR) , but being fat makes it really difficult to experience fully a lot of the time.", "allyouneedisluff": "Absolutely! As my body grows and changes it gets harder and harder for me to enjoy outside activities because of an expectation that I put upon myself for the things that I “should” be able to do. It’s hard to break down that mindset. But I completely agree with you and nothing is made for fat people to actually enjoy the outdoors. It especially resonated with me when you said kayaks, over the summer friends of ours who live on the river we’re having a kayak trip and I felt such a shame as I said in every single kayak and couldn’t fit in any of them. Like hello fat people want to kayak too! 👋🏻🚣‍♀️", "phibetaclam": "Yes", "queerbutterfly": "Omg!!! Love this!! I’ve been doing the same the past few years!!!!", "sassyyetsimple": "ugh I would love to get some vitamin d and fresh air but I live in Florida where it is uncomfortably hot the majority of the year. and when my thinner friends are like “oh it’s hot but it’s not that bad” I’m drenched in sweat and panting. I’m also pale af & have the tendency to get sunburnt within 15 min outside. the struggle is real. 😫", "ashleykorine": "I’d be really interested! I love the outside but finding a way to be comfortable is a fight I often don’t want to have. Especially when it comes to things like floating the creek and hiking.", "kirsty_harp": "This caption! 🙌🏻 I have felt the same way my whole life until recently! Now I just want to live outside it seems like. Please do share!", "sugarharlot2013": "Yes please!", "tassauudestaan": "Yes please ❤️👌", "faeriethusa": "🙋🏼‍♀️I’d love to read what makes outdoors easier! Last summer I bought an “oversized” camping chair & it changed everything. I no longer felt worried my chair would break or felt uncomfortable squeezed inside a plastic chair. I’d love to have other ways to change summer time for me! Thanks Corissa! You e always been an inspiration to me ♥️", "ginger_smythe": "❤️ THIS IS EXACTLY HOW I FELT ❤️ now I love being outside, because I do what I like, not what I think others want to do.", "bsummerbeauty": "I wanted to buy a Plus size beach chair.. Tell me why they are like 100 or more.. for bigger weight chairs.. yet we have 400 diff varieties of other chairs under 50", "goslingsarmpit": "Same, appreciating the outdoors shouldn't have to mean hiking up a mountain and being super uncomfortable. I love being in nature and travelling but sadly the world isn't all that accomodating. It's exhausting being made to feel guilty for taking up a little extra space.", "d_ay_d_ream_ing": "@fatgirlflow that's awesome! I just watched the last video u posted I left a comment. Then, I read some of the others and it made me sad how they totally misconstrued everything. I don't know why they would even watch other then to be hateful on purpose. I got it, I understood and I received what you meant. 🤗", "tonyarichardson_": "I live in Missouri and I just... get it. Thank you for this. I never knew how I felt.. but, this explains it.", "houseofbodypositivity": "Love this ❤️", "colleenoakes": "Yes!! I do feel like the outdoor sports world is especially not built for bodies like mine.", "ladybuchness": "1000% please do!", "chantalpeppler": "Omg please write about this!!! ❤️", "helenirenelear": "There are swing gates on the fields here that I can only just fit through, if I stand tall and breathe in. It's embarrassing. And don't get me started on what outdoor clothing sizes... Thought I was onto something because I found size 22 walking trousers that would just fit...no...they fit my size 18 girlfriend 🙄", "sophiamccue_": "Please x1000 I would love to be outside more but it’s tough. It hit 102 today in AZ and it’s hard to enjoy outside when nothing is made for your size and it’s hot as hell", "gillianwildgoose": "Yes please do! I identify so much with this post.", "lipgloss_glitter_tattoos": "It wasn’t until this quarantine, that I’ve learned just how much I NEED the outdoors. It’s kept me sane! I used to hate the hot weather now I crave the sun and sweat! I truly believe it’s because I’ve learned how to accommodate myself in the outdoors!!!", "ragnarock_": "YES please!! I feel exactly the same 🌈", "il_giraffa": "Yesss!", "cescabeckett": "Totally relate to being solar powered ☀️", "missveryemergency": "I would be SUPER into this! Have found exactly the same experience over the last couple of years. Wearing shorts has honestly been the biggest revelation within that.", "alwysleepy": "I wish I could wear chacos but my foots too wide, even with the wide option 😅😭😭 what’re some cute, wife friendly Sandals. And yes I have birks.", "sheyenne_dillehay": "Yesssss!!! 😍", "heathereclarktherapist": "Yesssss please 👏👏👏", "lynxbochum": "Schöne Grüße aus Deutschland. Tolle Beine 👍👍😉😊", "q_strom_99_walker": "🌼🌼🌼🌼🌼🌼🌼", "missweeks": "Gorgeous day there ❤️", "uncleburt_": "I would definitely read your fat kid outdoor tips! 💜🕺🌞🌱", "everyoneisworthyoflove": "YES!!! 🌞 I relate to this so completely and totally! I am realizing how healing the sun is to both my body and mind, and finding ways to make it a priority!", "racheldotbaker": "This made me tear up 😢 this encapsulated so many of my feelings about being outside especially in the summer", "spacejellyontoast": "would be very very into it, i fuckin love the outdoors", "vyvoom_": "Yes!", "__bellagram_": "YES PLEASE!", "soulshinekate": "A thousand times yes! I am also fully solar powered!", "teachernxtdoor": "I'd love to hear. And this looks comfy!!!", "libbifern": "Couldn’t agree more. Thanks for sharing and PLEASE share more. I want to learn how to put my fat body in the nature that I love.", "annachubbybanana": "I would love to hear about that 💖💖💖", "grasmi15": "yes PLEASE", "taysia_louise": "YES please tell us all the things!!", "shellyhassdenteufel": "YES, I’d absolutely love some tips because being outdoors is usually uncomfortable for me! I have a 13 year old and want to do more “outside stuff” with him easily!!! 😊", "mariahonfire3": "Would love to hear your writing about this!!", "acciocoffee": "So into this! I love the beach and the water. I live in San Diego - it's gorgeous and meant to be enjoyed. I am confident. I live to be in my bathing suit - pants be damned! But, when everyone is in chairs and I'm sitting on my beach towel... or I have pinches and bruises from a too small kayak seat ... it kinda sucks.", "itsme_jenjen33": "Totally", "lorahkay": "Yes! Super into it!!!", "emmaliznm": "I wear men’s wide Chacos, and have for 17 years (but only had 3 pairs). They’re now my every day shoes. 4 stars. Would recommend!", "mslindsaym": "I love being outside, but not necessarily in traditional outdoorsy ways. Like I don’t love intense hiking or camping but I adore the beach and sitting out in the sun reading, I love kayaking for fun on calm waters. Seems like being outdoorsy needs a rebrand. 🖤", "mals_your_pal": "Wow I resonate with this soooo much.", "bourne_bubbly": "Yes 💗", "jennifermalveaux": "Yes!", "tofumom": "Yes plz. I always think “going outdoors” would be nice but... I HATE hiking, and ...like you said... chairs, sandals, hammocks... not usually my size.", "joziechen": "Yes! I’m a plussize person but growing up was not. I find getting out there harder now that I am plus size.", "missyann0509": "I struggle with this too. Would love to read about what you’ve done to make this easier!", "coffeeq2hrs": "Yes!", "i.glitterally.cant": "We are so twins! 👯‍♀️ I feel this so much and am on the same journey ! Please share !", "kcfish97": "nice shoes you wear", "em_coolwhip": "Hell yes please!!!!", "jorose415": "Definitely yes please! I love being outside too but struggle to enjoy it because I move slowly and don't always have clothes/shoes that make moving comfortable.", "kt_teller": "YES", "coffeekidsandkait": "THIS. I just started contemplating how I will always saw summer is my least favorite season — I actually love almost everything that summer brings: warmth, longer days, more time outdoors, beautiful scenery, lots of ice cream. What I dislike is trying to dress my body in summer. Feeling like it’s unacceptable for me to wear shorts because I don’t meet the standards set by society, so sweating to death in cropped jeans. Having so many cute tank tops that would allow me to feel flowy and free, but immediately throwing a sweater over them to hide my arms that others find disgusting.", "nancybj2": "Is Perry Lake in or close to Lawrence?", "tteixeira2013": "Do it I need help- I love it but struggle to make it comfortable", "veebirddd": "Yes please 💘", "liskiss9": "Yes please! ❤️", "andrialea22": "Needed this. Living in Texas and dealing with the summer heat, I always wanted to be outside and feeling a part of outdoor life. I caught myself shying away from riding bikes, bathing suits, inner tubes, etc.", "maker.maven.jessie": "And Perry Lake is one of the best places to be outside! 🙌🏼 And yes please write more 😍", "mypetdevil": "Yes please", "jiji_darling": "PLEASE. i want to bask in the sun with birds and bumblebess but im fat and its hard.", "feymoonstone": "And the things that are made for people of our size are ridiculously expensive so many people can't access them because of money .", "kerrishc": "Yes especially those wide width sandals you found!", "fortunewearylove": "I have had this same struggle! My thin friends all wanted to do super hard hikes and bike rides and I just couldn’t keep up! It felt humiliating, especially when they became frustrated and stopped inviting me. How I hang out with people who are either have similar ability levels to mine or are at least patient with me going my own pace. It’s been super tough during covid-19 to get outside as much as I’d like, as I live in a very “active and outdoorsy” city and all the parks and nature areas I love and that are accessible to me are all either closed, or full of other people. I’d love to read about your experiences!!", "agingersjourney": "So close to my home. Good spot to be.", "constantsunset": "Would loove to read about this yes!", "dani.n.wonderland": "Yes plz! Im a very large mom and would love to learn how to enjoy being outside with my son", "tara_bean": "YES.❤️", "nogoodlover": "Yes please!", "jessalyno": "Yassssss!!!", "andydanelle": "Yes! Please! I feel like this is the direction I need to go, I just need some direction.", "cait_minus_weight": "100%", "ssingerm": "Yes please!!", "kbdebolt": "THOSE SHOES THO!!!!", "nerdy_nettie": "Yes please!!!💕💕", "meghancmoloney": "Yyyeeeeeeessss I grew up camping but things like shorts and swimsuits and hiking and sleeping bags seem impossible now.", "amanda_jensen6": "i never knew how i felt about the outdoors could be articulated.. thank you so much for this 🥺❤️", "liblibby": "What a dream. Yes. So much more about accessible outdoor life. Ryan is going camping this weekend and I’m trying to decide if I wanna go with.", "jennsvach": "💗💗💗💗💗💗💗💗", "lilysanchezm": "this is...so near and dear to me. please please write about it.", "baileemarie": "ABSOOOOOOOOLUTELY!", "chilltash": "♥️♥️ My heart ♥️ ♥️", "kathysavory": "Yes, please!", "sleepyybabe_": "I want to be in that head space. I feel this in my soul.", "madelyne.elizabeth": "Yes please 😊", "amberlyndee": "Yes yes yes", "nichaela.m.b": "One million yeses! 💕", "bijoux77": "Yes please!", "gateway__shuffle": "💜", "sadierex": "Yes please!", "bonnie.m.f": "Yes! Please!!", "croyster912": "Yes please!!", "jessimallow13": "I love fresh air and being in nature, but there's just so few outdoor spaces that cater to big bodies. I would love to hear about the things that make your outdoor life easier!", "musingsofafox": "YES PLEASE. I’ve always been a fat outdoorsy girl but my husband hasn’t always been plus size. We went snorkeling in Hawaii last October and he fell in love with outdoorsy things but he’s definitely feeling the accessibility roadblocks. We’d love all the insight and experiences you have to share!", "goo_ooder": "Yes!", "sobergirl6": "Yes, I'm a big girl and I get uncomfortable.", "bremine": "YESS PLEASE", "andrea_the_photog": "Yes please! 🤩", "amg8055": "Are those @chacofootwear ?? I want a pair so bad but I don’t think my feet will fit!", "theteacherkaty": "Hell yeah! I'm outdoorsy as FUCK and always looking for fat friendly outdoorsy things!", "xmarthin": "YAS!! I struggle with this myself. I want to be outside, but it can be so difficult. Like you said, even just finding sandals... such a pain. I'm also pale AF and burn to a crisp so a lot of times it hardly feels worth it to go outside for such a short time with everything I need to do to get ready for it.", "muffintop4lyfe": "YEEEES!!!! Omg so much yes!!!! I got myself a fat people hammock last week and it is amazing. Steel stands are amazing 🙌🏼", "geekpurl": "I’ve been looking for kayaks. I love kayaking but the class of rescue and recovery I took with REI a few years ago was in a sea kayak that was not made for larger bodies. I barely fit in the damn thing, could not use the splash guard at all and could not get back in the kayak when we did the demo for recovery. Plus the guide were half my size, there was no way they were getting me back in that boat. SOO I found out there are such thing as open kayaks and I’m sure that will work best for me. So far I’ve only found them with weight limits up to 450? I think, last time I looked but I’m planning on looking into it more.", "meljahs": "Yes because I love your trike adventures, it makes me so happy to watch! I wanna be back outside again too 💜💜💜", "missjess_s": "Absolutely share!! ❤️", "lookatthatpumpkin": "Yes!", "amylanta": "Yes yes yes‼️ I'd love to read more about fat-friendly camp stuff... Air beds, chairs, shoes, etc.💖", "trustthefatgirl": "I wish I could like this a thousand times. ALSO! Totally gonna like you a kickass hammock.", "ucancallmealg": "Yes, very much so. I also live in Kansas, so we probably have similar climate. One thing I would like to request is how to avoid mosquitoes. It seems like they love me and I hate the bites. Suggestions?", "mand0linn": "I would love that soooo much!", "ambsaceamber": "Yes please! Outdoors is the best!", "mrsrachhhh": "SO INTO IT. I can relate so much.", "roseybeeme\nVerified": "Verified", "kazsnz": "I have recently been challenging myself to get into some of the outdoors stuff I was too scared to try because of my size. So my gorgeous hubby is teaching me to ride a dirt bike. But you wanna know how hard it is to get dirt bike pants for a chick who is only a couple of sizes into what is plus size according to my country.... Don't even get me started 🤔😲", "bhoward12": "Tell us everything!!!", "captainem23": "Yes please! Honestly made me tear up a little bit how much I identify with this. Its been stuck in my mind that I have to tell people I don't like the outdoors- but that doesn't have to be true, does it? Thank you!", "paigeirene": "Yes!!!!!", "betht_in_show": "YES!!!! I would be so into it and honestly super grateful for tips.", "ria_d79": "Yes, please!", "spaced_out_rae": "Definitely understand this, would definitely be into reading more.", "andie_2020": "🙋🏼‍♀️💓🌈🧡", "bubblin26": "Yesssss!", "gawdshutup": "Definitely interested!", "kristycjohnson": "Yes!! Please! I’m struggling with exactly this. ❤️", "ashleycan__": "Yesss!", "noraconqueringitall": "Yes!!!", "pittsburghtrash": "Yes yes yes!!", "rachelm1230": "Yes please", "ashleykonop": "YES! Tell us more!!!", "s.stacie_": "These photos are so cute! I relate to what you’re talking about so much!!! I myself have had these same issues and on top of it my own insecurities! It felt so good last summer to really reach a new breaking point and truly enjoy my summer. Is chunky people deserve summer and the same festivities just as much as the next!", "_ethereal_siren_": "Where are your shoes from? Super cute"}