{"chriser50": "Gorgeous", "ashreenoran": "I am in love with this swimsuit!!! I love mustard-y goldenrod yellows and these bottoms are the perfect color! You look fantastic! ❤️", "karolinealicea": "Love it", "poppy_france": "Really needed to see this this morning. Literally just got a message from my mum telling me I'm getting really fat and looking really big and need to lose weight (I'm size 16 5'10). Thank you for being such an inspiration 😢😍💕", "emmasantee": "LOVE so cute and flattering!!", "swimsuitsforall\nVerified": "Verified", "fatgirlflow\nVerified": "Verified", "nicopdance": "😍 damn", "cadillac_colton": "@whiteskinkeithsweat", "belleandrews_mua": "That color looks great on you!! So cute!", "blackswim_": "Simply beautiful", "johnsondrewm": "Call. 8015773022. Drew📱📱📱", "isabellabashir": "I purchased that same swimsuit this year. It look absolutely adorable on you.", "megerliz": "Beautiful as always!! Also can I ask what camera you’re using? I’d like something compact for all my fat girl travels and that looks perfect! 😘", "krazy.kokonut": "Finally bought this same swimsuit!!! I’ve got the floating ribs so a fat roll right there... hoping I can get the confidence to wear it!! Love it", "lynncoyne4131": "@gabifresh", "extraextracurve": "I’ve been eyeing this @gabifresh suit for so long!! I need to just get it!! Haha looks SO CUTE on you!!", "luckiix": "FUPA!!!!👍", "novemberreign_": "🔥🔥🔥🔥", "w00ds_": "@xglitterxandxgoldx", "1happy.mama": "Very inspiring", "oilslife_yl": "I saw this post around the time you posted it and at first I thought \"they make fat girl bikinis?\" I had never seen a true bikini for anyone above a size 14. You inspired me to search for a suit I actually liked and not just an old lady tankini. Because of you I found my own fatkini and rocked it at the beach in Mexico. Thanks for putting yourself out there.", "shootkas": "Wawe ♡♥ very good", "alwaysaby": "That suit looks amazing on you!!", "tlbbrooklyn": "That top is dope!", "the_happy_mess": "You look gorgeous! Love the orange-white combination! 🧡", "chasijernigan": "I want it!!", "theresameire": "Let's go for a swim", "talya.elaine": "@allymachala SHE BOUGHT THE SWIMSUIT 😍", "lilbabytee1064": "Gurl I love your swagger", "curvyology": "Cute!", "poetrylover1980": "Wow!!", "the420mama": "Love your tattoos! ❤️", "bossytacokitten": "The top is to die for!! You look amazing", "feminist.qween": "This is so cute!!! Your confidence is so amazing and it spreads!!!!!"}