{"pineapple4tra": "@jouan87. These are some cute suits you could rock .", "saraluijkx": "ze hoeft dr oksels iig nooit te scheren @emmaschimmelpennink", "emmaschimmelpennink": "Hahaha omg echt he, kan wss ook helemaal niet @saraluijkx", "slygrrrl": "Those are all adorable!!!!", "behind_all": "VERY HOT GIRL AND TOO SEXY", "jonathanperiphery": "No one should be supporting someone who is morbidly obese and can process through daily life, it is unhealthy and in safe", "leighannsjams": "@fatgirlflow your amazing #youtube videos have helped me love my body more and have inspired me to wear what I feel good in instead of what I \"should\" wear as a big woman. Thank you for being awesome! Oh, and I bought my first bikini yesterday! Eeeek!", "__nataalieee": "Come get yo girl @aunnnest", "svcn.ermydn.mtn": "@ozgekuvel", "waad2442": "@ssdds12341234", "thelma_dhalluin": "Ton régime à marché @lola.petit", "kellymulderx": "Love them! Especially the middle one is so gorgeous 💕", "ehsan_mzk": "Active body..yumyum...suitable", "vanessapines": "@bellestrange", "mammamonie": "This picture has just made my mind up...I'm getting my under bust tattoo,I've wanted it for years but was waiting for 'next year' 'when I'm slim' well I'm doing it! Thankyou for your awesomeness x", "dood_itspennylayne": "Love he middle and last one!!!! Post the sites!!!", "fsaqijjhh": "Wow", "beyoutifull01": "Ughh, I love you so much! Your so beautiful!", "beachlizard83": "@jendrzeej you will prob get in an awful car accident because you have a bad soul 😜", "mua2be_ms.peazy_new.orleans.la": "💖💙💕💙💟👙", "felipechiquito4gmailcom": "Bella", "confettievents_kc": "@fatgirlflow that geometric print!!!! Ahh I'm in love and must order now!!!", "torstoltberg": "😍", "azinn__a": "@farnoosh._.shahpouri berim gaaaz 😍😁", "farnoosh__sh__p__": "@azin_ami ino niga un kheli khube", "mahnazghasemy": "@donya_tavakolii 🙄🙄🙄", "fussybroad": "@fatgirlflow Grrrrrrrrrlllllll. I followed this picture from Tumblr WHERE IN THE WORLD did you get the bikini on the right? 😱😱😻😻😻😻😻🕶🏄🏼 Maybe try tagging the pictures with the brands you got them from?? I tried scrolling through the comments hoping someone else would've asked or said but so far haven't found anything and your comments are kinda a bummer to read through with all the trolls guarding your bridge.", "slothlete": "@parishart this is just like the tatt I wanna get!!", "marilubx": "I agree with fussyboard ...tagging pics w brands!!! Easier from for us...u look gr8...!!!", "sxntey": "Beautiful❤", "nck_92": "@lisassink", "tahadi_": "@asma_nikoee کدومشو دوس داری", "9clipwopo": "... @moe_money400", "sconygirl22": "You look great in the geo print", "caronogues_": "MALA @caronogues18 hoy ya paro jaja!", "__miss_jr__": "@72nadia29 omidvar baaaash😂😃😃😃", "nadia.jafari7229": "@__miss_jr__یا خود خدا خخخخخخ من کجا اینا کجا،گوریلین واس خودشون", "briarneraeee": "@xo.emmy.ox", "tessakoepp": "@sarahjoyburton", "shereenlaff_": "@frecklesxo 😳", "gonegirlfreckles": "@shereenlaff__xo 🙄", "bnaleieha44": "@jo_jitsu34", "lovefoodloveme83": "Girl, you're killin it! Sad truth: ppl love to feel 'superior' by saying there's something 'wrong' with others. You're amazing. You're living life like you want and it drives others insane. They envy your emotional freedom, they crave it. #keepslaying", "kaitycaroline": "@aine_oliveira empodere as gordas", "joaopaulolinooficial": "😘adorei", "earlthzig": "This is awesome! Just your energy and confidence gives me motivation to become confident! By the way, I never thought I'd ever wear a bikini, but I love the one in the middle. Where is it from?? @fatgirlflow", "pix6570": "Where do u find your suits at?", "lizfalconer_": "Hey @fatgirlflow where did you get the swim suit in the middle from? Looks beauts x", "chaneldior1913": "@lizfalconer_ forever 21", "_caseylee123": "@chewy_44", "juanabeltre": "Estan aqui en republica domini cana", "csalgado5": "@rhian__jane me this wknd", "consavalos": "Todo empezó cuando se le rompió el pantalón de trabajo..no se...digo.....@caronogues18", "rideone27": "😱😱😱😱 @dita.puspaa", "dita.puspaa": "Hmm :-( @rideone27", "fmsweets_": "I wish i got your confident 😭 i still don't have the confident to wear sleeveless tops let alone bikini. But i would love to rock a cute ass bikini like yours.. maybe someday lol", "tazminstone": "@ryanvalley", "radin.zarin": "👍👍👍👍👄👄👄👄👄😙", "cristovaoperes_": "@yasmiim_liima", "xiomaligallardo": "@diany_medina", "veerlemazer": "@anishadevriesx", "andrewslens": "Think she got those undies on backwards", "newtergirl": "@cheeks657 I see this", "_6filthy": "@fatgirlflow great mindset and all but you won't live past 60 being fat as fuck", "sawyer___jacobs": "@folded.grace people just ignore the truth and glorify things that are bad. And then when you're not even rude or disrespectful they call you a hater. It's like talking to a brick wall. I back you up 100 percent, everything you said was spot on👌.", "jejebernss": "@fatgirlflow you're so amazing! I love this post 😘😘", "yagosuarezz": "@matilde_domingues", "_lucyleigh": "She's so pretty I wish I was that pretty. 😞😍💘", "zahrakuulle": "I like the first and second the second mainly cause of the design looks really good on her", "rose.nuala": "Your life won't be long if you keep your current weight, that kind of obesity leads to heart disease diabetes high blood pressure mobility issues etc etc lol @fatgirlflow #unhealthy #bingeeatingdisorder #respectyourself #losesomeweight", "fatgirlflow\nVerified": "Verified", "cozy_cuteness": "@folded.grace I have a couple questions are you a doctor? Do you see what she eats or drinks? Do you know if she exercises? Because if you can't answer yes to all these questions then you need to hop the fuck off her shit if you don't like the way this beautiful lady looks I'm a big girl myself I workout I drink water I don't eat a lot guess what I'm still fucking fat it happens and I'm not in bad health so it's not for you to judge someone when you don't know their life all your doing is making yourself look ignorant by assuming something!! @fatgirlflow you are beautiful don't let people bring you down because they are wrong sad and must have a sad miserable life", "josefavelazquez": "@marianameade", "lil_miss_vong": "@jbellpht", "masondavis241": "@ursa_major72", "ladyj8419": "@folded.grace @fatgirlflow just put your fucking ass in check!! 😂😂 👊👏👏👏", "abayne38": "@folded.grace what a pathetic person you are.", "maria.kbz": "Morgen breite ? @tobias_ze", "marianazamora": "@alonsocerros", "tobias_ze": "Cute! @mck.108", "silviapbaile": "I love your happy face wearing them, that's the best thing :)", "pnwmamato3": "You look fabulous!!!", "kieratheloser": "YESSSSS GIRL 😍😍😍", "strawberrywolfwoman": "Love the one in the middle", "yitmarakamat": "Super cute", "pundinheimer": "Never in my life have I ever seen something I didn't like or agree with & start harassing that person because of it. I see people making bad choices every day - but it's not my place to comment on other people's lives and choices. I love that we have such a strong community, and that we won't let some little fuckwhit with a small mind (and who knows what else small....) bash on anyone! Woo woo BOPO power!", "wigsmom1981": "Love it!! I bought my first 2 years ago after living in tankinis and I love it!! Want a new one this year", "watercolorgiraffe": "That middle one is amazing @fatgirlflow !", "uti_zo": "@naypurpleray", "hawthlauren": "The under boob tat looks so cool @floraflabulous", "slavini01": "@otololaura", "calebklingner": "@waggy2", "floraflabulous": "Agreed @hawthlauren I think about getting one all the time but I don't think I could deal with healing a tattoo there. I know myself and it would most likely get fucked up from wearing a bra.", "brooklynnvictoriaa": "aw you look stunning", "henejhdwbydudbsk": "I wish i had as much confidence as you❤️", "pablobeltran151": "@erny_beltran", "sierra.fazekas": "I want one like the one in the middle! It's so nice!", "jxdef25": "For someone with the username mother nature's psychedelic son, you're not very enlightened.", "dorithgout": "@amberijsselstein lekkerding he", "amethystnrubies": "Hopefully you won't let some obsessed body policer with nothing better to do than run his/her mouth get to you. You look wonderful.", "blueeyedmommy84": "I like the middle one", "louiseismoi": "Love the middle one 💖", "kirzimaria": "Where can I find the middle one?😊 @fatgirlflow", "r0sarium": "I'm so mad I missed out on that second one!! @forever21plus please restock!!", "madisonanzivino": "ur tattoo is cool af!!! ur so pretty!", "emma_gli": "@julymalou fatkini", "fiercefatfirefly": "I didn't know you were inked too! Awesome @fatgirlflow", "jaminorris": "@fatgirlflow where did you get the one in the middle????", "jnp80": "Always has to be one troll that can't leave well enough alone and let somebody be confident and happy with themselves. Agreed? @folded.grace", "dolljay92": "Gorgeous 💕", "tzirda_yallo_": "@sheli_452", "mother.natures.psychedelic.son": "Yeah yeah blah blah. Hope you have fun dying at 40 man. Ignorance is bliss they say. Bye ✌", "eek375": "R u single", "shrinkingmissmelissa": "Love those suits !!!", "so_runs_the_world_away": "You look amazing in all of them! 😍✌😘", "kieran_21": "@joshr_27", "helenascblack": "Love the middle one and LOVE your ink!", "jdartagnanlove": "Love the blue and white (left).", "ceallaigh24": "Checkered one is so damn cute and retro!!", "klaarrissa": "@_ahsiaaa", "seachel_85": "@rynni_d she's got your tattoo!", "sarahjstofel": "Gorgeous as always @fatgirlflow", "propheciiii": "Mhm @dirtydee83", "oddities_and_entities": "#2 is my fave! ❤❤", "kearasmomally": "Pretty baby with a killer tat!", "cydneyjoplin": "@tianakwill", "emilyelizabethroeser": "The second one kinda makes me think of Steven Universe.", "jessydez": "Ahh I'm so happy the top i sent fit you!! I was worried if it got to you or not lol", "erindidrichsons": "@meaghanrochelle", "im_just_d_": "OMG SHES GORGEOUS 😍😍😍😍 AND THAT SWIMWEAR 💖💖💖😍😍😍😍😍😍😍 @faat_queen ..WE NEED THIS IN OUR LIVES FOR THE SUMMER 💯💯💯", "huffle_fluffin": "You look like the definition of summer!", "another_mrsgarcia": "Love it! You are totally killin it👍👍", "fiveorsixgirls": "You've really given me the confidence to get one!! Bear in mind i am a LOT older than you.❤️", "maddyline.schmidt": "@ashleyfoleyyy", "andersonrangelvital1982": "Linda", "special_jour": "Canada Jamaica", "gihcamp75": "😍😍😍😍", "ija.rmg": "You are super adorbs!! 😍😍", "the_curvyplus_corner": "Love it!!! @ysaaaabel ❤️💕", "short_n_stacked": "I want the last 1", "fatgelfling": "I'm always infatuated with every picture of you because you're the cutest most happiest cutie that ever lived 😍 I'll be buying myself a fatkini this year for sure. Thanks to you and your lovely self.", "meech5150": "Very beautiful", "tinitamaria80": "I bought my first \"fatkini\" last summer and now I have 6! I will never go back to the one piece :)", "fwarg": "that middle one tho!!! 😍😍", "rachi_ray": "😍 i admire you so much and literally live for your videos.", "rogalitycheck": "you're so beautiful <3 thank you for being you"}