{"valemaderoo": "@renata_peraltam yo", "lennertalbers": "getuige zijn? @lottemortier", "bam.peesly": "I just bought their unicorn dress. I'm so happy 😭", "tooturntserena": "@ally.bivens", "chasehodgson": "@walkerwwood", "thekatchats": "Where is this suit from ?? :) Super cute", "kalybray": "@aliedwards6 I love this bathing suit!", "aliedwards6": "Me too! 😍 @kalybray", "_giadinardo": "@frankiepace22", "_kaycilaree_": "Had to steal this look!!", "88d0n": "@markmcgoof", "ehsan_mzk": "Very good.. Champion", "lauren.grindey": "@chloe.robertss", "ragu_lb": "Hey @fatgirlflow where's this donut Cozzie from I need one SOS SOS. ... Help?", "isabae94": "@srollens13 follow this girl. Also the others I tagged you in #bodypositivemovement #effyourbeautystandards", "alhernandez85": "Speechless single or taken ?", "audrey.ruffin": "DONUT touch her body bitch it has donuts on it eat her up for thanksgiving dinner there brought more than enough to go around", "mustangsally42": "A lot of junk in your trunk!!!", "milostereo": "@amae_collares papudo 2018", "amae_collares": "@milostereo lógico", "dr.sandhu74060": "I love you", "amethystxocean": "Omg you radiate joy and your tattoos are all amazing! 😭😭❤️❤️", "musebeauty.co": "Nereeeed @jen__morrison", "yagottahaveahobby": "@whatangiesays she is adorable! Wish I had half her cajones", "whatangiesays": "@yagottahaveahobby this bathing suit is everything", "the_beautytour": "@fatgirlflow that bathing suit is AH-mazing", "nicholleb": "@arlenebartlett this swimsuit 😭💖", "tzilamichaeli_sheela_fashion": "Love it", "souzachristina36": "Ong u have a hibiscus on your shoulder. I want one too.", "darlingiknow": "yessss I got one of these in ufo print after seeing you and becca rock this stuff!", "aleexluu": "Yessss mamma!!!!!", "ahlamm90": "@slman2077", "a_semro": "Yas!", "lilbugwings": "@kdenning22 @offixial.tyler i know u want this fat ass", "themilitantbaker": "@hamburger.time ME TOOOOOOOO", "firmansyah9076": "Wowww", "acabanillas10": "@danielatreco", "danielatreco": "Ponte a trabajar @acabanillas10", "lolamichellecreative": "Oh no!! I missed the link in your bio!! Anyone know where it's from? She makes me NEED it! Lookin' beautiful mama!", "daddy_glowed": "Look like you got a diaper on😷 hell naw", "annneway": "Yaaas kwane", "thibault_villard": "@charlineseverino", "jen__morrison": "@mobile.session.style bathing suit 😍😍😍😍", "miss_behaves": "@wildesage its a company called cow cow.. just google and should come up. They also have an amazon store for those they may not post to.. maybe try there @_taaylorrxo", "amelia_mariah": "Wish I could strategically arrange my fat 😂", "jamieedav11": "@hollyyy.__ @evieridler this is u 2", "menopausal_munchkin": "@fatgirlflow delete comments like Holliday too. Yup another grand role model in the making.", "descobrartemim": "@oh_damnit", "mcmanymoons": "Meh, too skinny for me", "aln_1982": "I can't believe people look at your photos just to criticize. That's the joy of social media..you don't have to look at what you don't want to see..what I truly think it is, these people who come on here to say such horrible things are so pissed off you are not sitting in the corner somewhere being ashamed of yourself for being heavy. I was once 267lbs. I am now 152lbs. I thought losing weight would bring me this ultimate happiness in life.. It didn't. What did was finally accepting myself and being happy with me. Regardless of the scale. @fatgirlflow keep on posting. Keep on being you. Keep on being beautiful. No one deserves your attention on here that is being negative. The best way to get back at the haters is silence. Its golden. You're a beautiful human. Thank you for sharing your world. Now I must got eat a donut 😘😜🍩🙌", "stvincent08": "I ordered this suit! I'm so excited to get it.", "nondepieke": "Love this!!", "carol_acf": "You're beautiful!!! I loved the suit!!!", "meika4": "That suit is a must have", "sara.auroraa": "Im not fat shaming or anything but please lose some weight! I want u to be healthy and live a long life with people u love! You have great confidence and stuff like that but remember: being overweight is NOT healthy at all😖", "helloamykins": "I bought this suit because of this post! It's so darn cute! So are you!!! 💕🍩", "adelamer52": "nice", "dianesparty": "I need this suit. I'm also in the \"no butt, all gut\" club.", "carissacordoni": "@naomiharrop", "fatgirlflow\nVerified": "Verified", "jollyjose88": "@maya.grella is that a block of cheese tattooed on her back ?", "blondie.and.the.brunch": "😂😂 yes👆🏼 @fatgirlflow 🙌🏼", "nitzan_ullo": "אני עוד שנתיים @liorkadosh", "suttonsway": "Two steps ahead of you", "georgia_may18": "@kateemulgrew", "maryhydes": "@jrobbins92 @nikkismolinski", "casskoehler": "@lesliegreen888", "battling_em": "I had a tumour and was in hospital for 3 years, forgot my own name, totally had to begin my life again. And I'm considered 'overweight'... Yet that's no fault of my own. Despite me doing something about it, if people want to do this, it's up to them surely? Like I don't care it's their Instagram isn't it? 😴💪🏼", "soft.thorned": "@touchdownsmile THIS SUIT", "pleasantlypearl": "@caoimhe_3x She isn't promoting obesity. She's just happy and comfortable in her own skin.", "thepatriciamarie": "@rumbleinthejungle24 My husband who has never been overweight in his life has thigh chafing. 👋🏼", "y.f24w": "الله يعطيني ربع ثقتها بس 💔😿 ذي دبيبه @fahody_sa", "janessajsimpson": "@jessotting", "hannahvilks": "@clintdog", "jane_0717": "@stevefamine", "ponnyhumla": "Apparently, if one is overweight one promotes obesity just by existing🙄.", "brownsett": "@brenthazelton", "hmille03": "Smfh if you don't like what you see then keep scrolling instead of bashing people based on the looks who fucking cares she happy in her body an that's what matters so go back to being somebody's dog bone and keep scrolling ✌️🖕😗", "nikkialkharanda": "😳 I want this bathing suit @_al_essandra", "m_maryam32": "@jack.rj.nielsen @1unstableportal you guys talk as if you know what it's like to be overweight. Losing weight isn't as easy as snapping your fingers and eating salad. Many times obesity is caused by genetics and metabolism problems. Don't you think she's tried to lose weight? Sometimes it just doesnt happen. She's living her life happily and perfectly aware of the health risks she may be facing, she's not fucking stupid. Vaping is also \"glorified\" and that's certainly not healthy. So stop being the fucking fat police and get a damn life because she clearly has a better one than you skinny bitches lol.", "jacknielsen.24": "I'm not saying u have to be skinny but this is too much", "quoteinpictures": "@mmaryam4 If you consume high amounts of energy from your diet, particularly from fat and sugars, but do not burn off the energy through exercise and physical activity, much of the surplus energy is then stored by the body as fat. #science ! Obesity does not happen overnight. It develops gradually over time, as a result of poor diet and lifestyle choices. While there are some rare genetic conditions that can cause obesity, such as prader willi syndrome thers is no reason why most people cannot lose weight.", "lisaw2002": "@martymo12323 @magiec I think we just found our bathing suits!!!!!", "fenix1122": "Omg!!😱", "caoimhe_3x": "Y r u promoting obesity ?¿", "kwhyel13": "@a_whyel", "celinealhasan": "@duniaammari how do people promote this? This isn't healthy or good in anyway wtf", "petopastorino": "Un chirlo con slow, lo mejor para arrancar el dia @fedesabanes @sr_peeg", "acrowbitch": "You're so beautiful!! Aaghhhhhh you're goals!! 😍😍😍", "serenkocacinar": "@yunusozdurnaa boyle olcam sayende😏😏😏😏", "yunusozdurnaa": "Ahaha sana hepsi yakisir :) @serenkocacinar", "aliplb68": "@furkii68__ big mama", "martycha329": "Would help explain a lot when we hit the beach @lisaw2002 lol", "moh__traore": "Sisi @ipbilal", "amilewski": "@_mandaaalynnn_", "magnoliadelight": "@nevergrew72 donuts?", "shereadelsol": "I need this!", "jhn7834": "Hlo", "ivyaction266": "@kevinrush", "bitterfountain": "Fat and happy, nice.", "chrishnacool": "@sangsoury1", "dazz_t": "Hot and beautiful to 😀😀👍", "suhaila72": "@froozan_f اشوف اﻻ موضة", "froozan_f": "بلا ارف 😡😡😡 @suhaila72", "adityayadav1656": "It's natural Beaty I like it", "chandlerbing269": "Full figured? You mean FAT. Why are we promoting such an unhealthy lifestyle! What has this America come to where this is acceptable", "fedesabanes": "No nos olvidemos de los comienzos .. @sr_peeg @petopastorino", "goodlifemaral25": "اههههه", "izabellelazara": "@kendoken713", "tmacelwee": "I was so fricken excited when I saw this in your haul, but that excitement quickly turned to sour disappointment when I realized they don't ship to Canada 😭😭😭😭😭😭💔💔💔💔💔💔💔", "mandyoh": "Your ass and belly are perfect FYI", "s.s.a.dxb": "You are so sexy, amazing and pretty.. I like your body 😍", "cafenegroporfavor": "@fatgirlflow I love that look! You are so pretty 😍", "dr.baharostovar": "@zohre.ostovar 😏", "rachiecakes503": "Yaaaaas Queen you are speakin my language", "ultrastime_official": "@gabipv27", "loaitpristije": "Sexxxx", "sanneclaudineborn": "Amazing! 🔥", "gordafabulosa": "@gummiebear1972 i wasn't this please", "joywayfinder": "I have the same areas. Where do you buy pants/shorts from? I have the hardest time finding ones that will fit a flat booty but also a nice round belly.", "ang.vaughn": "SLAYING ❤️❤️❤️", "christinehorvath_": "@er_chinn 💘💘", "highadenyu": "@seemteem", "rumbleinthejungle86": "@deardough I'm not fat shaming in the slightest I ask a simple question , yall glorify the obese body and make It sound super fun , but in all reality it's not , is chaffing a happy thing are sores from chaffing a happy thing that's all I asked , I wasn't bullying , when anyone proves y'all wrong you immediately call bullying .", "nappyalien": "@rumbleinthejungle24 Do low attempts at fat shaming people make you happy as fuck? Does it bring joy to your life? How would you feel if this was your own daughter someone was bullying? Stop being a pathetic piece of shit and find what makes you happy.", "lore_andmore": "@rumbleinthejungle24 what makes you think she has thigh chafing? I am very similar in size and wear bikinis and never have a chafing problem.", "margotmeanie": "DONUTS!!!!! Eeeeeps! 🍩💕", "mustangsallytwo": "Girl you look adorbs!! 🍩🍩🍩🍩", "rubywednesday13": "@rumbleinthejungle24 any body size can get chafing- and there's a plethora of resources on how to manage it. You can consult the Google or your friendly neighborhood runner without sounding like a dick on Instagram. Move along.", "sammiiihehehee": "@sheilamau \"94她😍\"", "scallywag_sharla": "May I ask what size you ordered?", "glitterk5606": "Me too girl! Still fabulous :)", "pomonasgreenhouse": "This is the happiest picture 😍", "woowbbwj": "😍😍😍😘😘😉😉", "fauxromantix": "Lawdy, lawdy! I love this so much", "angelodean23": "What is your favorite clothing brand @fatgirlflow", "brittpysar": "Adorable ❤️❤️❤️", "lnjr.bd": "بطل اوووووووووووي", "danixdarko": "it's a donut bathing suit! @daygodonutt 😍", "veridian82681": "@crystalicious042206 I love her suit!", "crystalicious619": "@veridian82681 doughnuts!!!!", "kidnapsnap": "def just bought this you look bomb", "larisabrusky": "@macmerpy 😊🍩", "itsajoycefullday": "Yessssss 🙌🏼", "chipelo": "Why you gotta be so cute tho????", "ithadtobemaine": "You are so.frigging.cute. Amazing. That picture radiates awesomeness.", "kimmie_crump": "Love it", "cr1xlee": "LIVING FOR THAT SUIT!", "thatoneyogi": "Love", "jellyfishcandy": "That swimsuit is the cutest thing ever!!!", "chelsea.belle_mua": "OMG we have like the same body! :) rock it, beautiful! :)", "cristy6521": "preciosa", "dchalle": "You are fabulous!! Xo", "katieklassified": "This bathing suit is on its way to me!", "ashleymccaskill": "I love you so.", "dazzling_jams": "I NEED this suit!!!!", "paul.g775": "Cute enough😍💕", "ferocious.b": "Love the suit!!! (And your sass 😂)", "dollyleigh": "This suit is so cute!!! So are you!", "iamkatiefierce": "So cute!", "thegeniuszonepodcast": "Your gorgeous and so inspirational! ❤️❤️❤️", "ehsan_jp1984": "Awesome", "kathystorms": "Love the suit!", "katepayntergram": "YAAAS!!! 🍩💕👏🏻", "zzsman_1005": "And sexy as all get out! Your ass and belly are perfect as an FYI 👌🏻😊😘", "fwarg": "donutbutt!!!"}