{"peachypipes": "I love you and your posts put positivity and love into the world. Keep on doin you ♥️♥️♥️", "alimujtaba595": "So sweet and beautiful my angel", "mechanicshopfemme": "I totally feel this. My guys laugh at me when I come to work with my hair down wearing nice jeans or a dress because they know I'll be asking them to take a bunch of photos of me that day hahaha.", "kellielan": "It already has. Where have u been??", "shiftmybody": "Really loving your confidence! 😍", "sarah_12_488": "Oooh what camera and lens do you use? Pretty picture.", "torstoltberg": "Cozy💚", "lifeofmoga": "That caption is so true 😂😂 I don’t trust people who lounge is jeans! It’s not right!!", "lillyvstheworld": "Slay all day ❤️👌🏼", "kamy_s_corner": "Being obese myself, I try my best to lose weight in order to be as healthy as possible. Self love isn’t about staying one way because that’s the way you are now and because you can’t be bothered to change. That’s just acceptance. Self love is working your butt off to be the best version of yourself, whether that means checking your attitude, losing or gaining weight or getting help for any illness, mental or physical, you may have.", "kayb1992": "@fatgirlflow actually, I think you can't handle the truth. These so called \"haters\" are just saying it as it is. It's not right to glorify obesity. You should firstly cover up, no one needs to see all your flab hanging out, and secondly you need psychiatric help if you think it's ok to be this way.", "leereignssupreme": "The ambience 😍😍", "itsyourgirlliz": "@fatgirlflow you are everything I want and NEED to be 😍😍😍", "shawncastillo219": "Super cool", "brittjam_": "@rascandas", "jessherrera24": "Jeans love them where are they from your the cutest by the way!!!", "sean5_anthony": "I love everyting about you", "lilywhitestylist": "@bs_has_weird_frens the message she’s sending ? She posted a picture of herself. Leave fat people alone. An “unhealthy” person deserves to love themselves just the same. To love yourself doesn’t mean you can’t change.", "jameskaufmanart": "This is so gorgeous. I need this in my life", "katfisk": "This is the perfect mental aesthetic for working from home! stinky and covered in crumbs doesn't matter when you look as fly as this in your head. 👌💜", "pineappleunicornmedia": "You give me so much inspiration and I am grateful for you because you are the reason I started learning to love myself!", "alves.lac": "Its beauty is of a rarity and precise ..", "fattitudethemovie": "Just noticed we will both be at flyover fest!!!", "asanzie": "Hahaha!! Weekend realness!", "kadebish": "Yo I really envy you that you’re confident enough to post pictures like these. If I were to do that people I know would crucify me. Why do people have to be so nasty? Like the worst thing you could be is F A T? I know I shouldn’t care what others think but how do you do it? I’m not even that big I just have a ton of stretch light marks and heavy ass double chin/midsection 😐", "stylesocialshop": "Beautiful ❤️", "kellyyyyjeann": "@giiibabyyy", "just_this_chick": "I love this honest 🤣🤣", "thejunebuggirl": "I adore this photo. It's so nice to see trendy blogger photos of girls in every size. Thanks for doing what you do.", "browngalmal": "That sweater is cute!", "velvetsagephoto": "So so pretty!", "rose_frost50": "I love all of your photo shoots! ☺️", "takashi_empire": "U rock girl 😘😘🔥🔥", "daynuh.t87": "Stunningly beautiful.", "maryjeanpetrosino": "Hey girl where do you get most of your clothes from Like what’s your go to store", "65saeed65": "😘😘😘😘😘😘", "hma_vata": "hahahahahahaahhaha thats how I think I look....but nightie + snacks is how i really am", "bettykroll": "I have those big white furry pillows! 😃", "axcxmx": "You always look so comfy oh my gosh. House/clothes/life goals", "thecurvytrini": "Ahahahaha omg there is nothing in the world I love more than my nightie 😶", "briannafunkhouser10": "@fatgirlflow I definitely will I'm so excited! 😘", "bs_has_weird_frens": "No she chooses that lifestyle. I understand genetics and that some people are naturally skinny and some are naturally fat, but no one is naturally obese. She maintains a life style of doing nothing beneficial, soaking up medical care, and soaking up drastically more resources than the average human. It does bother me. She also is saying it's okay to be obese, and it's not. No one should think that. There is a difference between self love and self pity", "aunty_corrina": "I really love your attitude!", "sickk_alice": "ILY", "paradise_classe": "It's toooooooooooooooo !!!!!!", "spammaccesther": "Pretty! Where did u get it jeans? Do they have a in size 2?", "hayjay37xx": "😂😂😂😂🙌🏼🙌🏼🙌🏼🙌🏼", "breexzxx": "Oh my gosh, I just found you and I am obsessed! You are beautiful!", "hargrovekristin": "Daaaaaaaamn. You are gorgeous 🔥", "malukagirl": "I love this aesthetic. So chic", "akresisamuel": "Hi I really love you so let us chat on WhatsApp(+2330241015648", "q200mio500": "Hi corissa i love you 😙😙😙😙", "benambadshah_": "Omg so big thighies", "rao1825": "Beautiful picture", "bold.becky.lou": "😍😍😍", "cialitra_": "SAME", "swingwingate": "👍💋", "nataleensohot": "@naomimartell", "tonya320": "😂 I like to pretend mines similar to that as well...but that’s okay. Pretending helps me be more productive 😁", "abdellaoui7987": "Y are so pretty...", "lorribell1964": "Saw yours and had to have one. First crop thing I ever owned..", "state_farm_bris": "Goregous", "fryd4249": "Beautiful as always", "hexvenus": "Omg I wish I looked this adorable at home haha", "tres__leches": "@milkywayheart", "beckyx191": "Same", "ajedmonson10": "Thank you for this!! Now I know I'm not alone ;)", "blueorchid32": "I love you always THANK YOU for being our voice!!", "lorump": "I feel this caption deeply 👏👏", "curvygirllingerie": "Post or live stream...", "divayenta": "Looks like a Pottery Barn ad!", "gogoluff21": "@mieyulhaikal_hs @lovemelly_hs", "chriser50": "Beautiful", "perksofbeing_____haley": "What is this filter❤️❤️❤️", "smallerrors": "i would love to see the actual look as well (if you ever feel like sharing!)", "nikkitrudell12": "We love the aesthetic but we appreciate the real life accounts. Mainly because of how accurate and relatable they are to us. 💁", "sincerely_rad": "Haha, Instagram-worthy. What were you snackin' on, Princess?", "trulove1443": "Omg you look soo beautiful I love your clothes too", "kizendra": "Where do you like to buy jeans? I struggle to find any that fit.", "_samny": "I do that regularly. My depression has been kicking my ass and I barely get the energy to do shit! I wish that I could CHOOSE to do this once in a while as opposed to just being unable to stop myself from being this way. 😔 Don't take that for granted. I'm glad you had a restful day. ❤", "because.ihaveto": "🤣🤣🤣", "umarmalik777": "Dirty nightgowns are the best", "katmareva": "Where do you get your jeans? As a fellow big girl it is hard to find jeans my size"}