{"stceagle": "Nice Bell bottom pants.", "hface44": "You look great! But I'm not crazy about the jeans. The flair is just a bit weird in them 👎🏼", "cheriecrowe": "Bells forever", "chriser50": "Beautiful", "reesa.tree": "You’re adorable, those jeans just don’t do you justice. 😉", "slater2220": "You are a good looking woman you are a Angel", "volup2": "Cute pants!", "awika42986": "Love", "littlecc_ladys_lets_talk": "Nooooooook", "reillyseesthings": "Not my fave for me to wear - something about loose ankles gives me the heebs after all of these skinny jean years! But do you girl - like it, wear it! 💓", "celebritysue1956": "I wore them in the 70's. Are they the same pair reincarnate?", "khrysthesofa": "I NEED THOSE JEANS", "theresameire": "I lived through the late 70s and hate bell bottoms TO. THIS. DAY. But I'm a. Not fashiony and b. Not you, so wear em if you love em!", "elgatogomez_art": "I need these pants!", "lghshortstay": "I really like them on you. Because you have lovely thighs you can carry them off xxxx ❤️", "curvy_polarbear": "I LOVE BELL BOTTOMS! I seriously have been searching so hard for bell bottoms! 😍", "laureldickmanwrites": "I think they would be terrible on me at my height, but I dig them on you. I keep seeing these little bell crops and I'm like NO! but I dig them at full length on you.", "karimov3259": "Привет", "shikeyamorris": "Please tell me where u got these amazing oants👑💗💗💗💗💗", "brittjam_": "@rascandas", "incredible_insomniac_": "I love these", "chickenofpeace": "No", "vdolls_": "Fabulous xoxo 💕🍬 💕", "jessielee739402": "🤩🥀🌹❤️💛🤗", "pompomchee": "LOVE THEM !!! 😍❤️❤️❤️", "mimiprin": "There cute", "torreshunny": "Wear them with some wedges or platforms .. hellz yes!! ❤️🔥", "courtneyjoyphotography": "They are unique, but they are awesome!", "mama.is.a.witch": "I love the bell and the seam detail between the bell and the rest of the pant leg. Super cute.", "lizouellette35": "I dislike them", "sbosko": "Yea, I'm not liking them at all either... but your hair is super cute. 😊", "stycki_t": "I dig 'em!", "alves.lac": "Very beautiful..", "kellie.tipton": "I've noticed you and your sweetie being more public lately.. do you think you'll address it in a YouTube vid? ❤", "wonderingsteps459": "Omgosh, I love those. They need to come in talls", "gypsyclipper": "I think they look amazing! You look awesome!🤗👍👏💪", "torstoltberg": "Looks fine", "amor.amour._": "YouTube link not in bio.", "gmm1023": "Not my style. But you look cute in them", "bexj30": "They look like mermaid tails 🧜🏻‍♀️", "stemple_13": "I really like those jeans on you you look great", "punkrocksnl": "Cutie kitty down there", "mirandagartin": "What I really love about this page and the body positivity movement is that they prove you can look good in anything regardless of your body shape. Any person any size can and will look good in anything.", "lalaloserpants": "I think theyre awesome :)", "harmonylove543": "Luv them u look cute😎🌺", "weezyftaylor": "I think there could be a time and a place for these. They don't look unflattering for bad on you, they actually got you very well. It's just I think if need a specific occasion...🐱", "voodookiss": "Not my favorite.", "tresjolie3": "Those jeans confuse me too. It's a no for me but I'm sure you could make them work!", "cncld__ccnt": "They are kinda weird... but I don't hate them, either. I think that one is up to the wearer (as are most things lol). I'm thoroughly confuzzled...", "viktorija2581": "Нет такие штанишки не очень🙈🙈🙈", "mxperspective": "I do hate them. Sorry, but honesty y’know", "karm_a": "Really cute!!", "punkr0ckprincess": "I was a 90s teen so anything with a huge flare I am hella into haha", "purdygirl7282": "Totally dig them and want a pair for myself.", "lindseylightensup": "they look like the little boutique pants they have toddler girls wearing these days. I don’t think they do anything for your legs. But, that’s just me", "26kleisen": "I like flares, although these are more like mermaids tales. Kinda fun.", "hippieambervintage": "I think they look amazing!", "takynhobjj": "Você é linda demais!!!😍😍😍", "missdre525": "I love flare jeans ! One of my favorite styles for me ! @fatgirlflow", "kandidly.kerry": "Stunning. I love them", "doglove1983": "I LOVE those jeans!!", "live_vi.kerry.ously": "Mmm not really into them! They are ok, but the peice at the bottom puts you out of proportion. But the better question is...do you like them? If you do, then do your thing gurl!", "bohemianlaxity": "Love love love! I hate skinny jeans and anything pencilly with a passion. Love my boot cuts and flares. I think those jeans are crying out for some embroidery", "veeillustration": "Okay I’m about the flares 😭♥️", "pinkpolo121": "Really like these. Where are they from x", "artistikdiva": "Saw a girl wearing these who was plus but had a small waist. I thought “oh that’s who they are made for “ I feel like they’d look weird on me because of MY particular figure.", "loveswarn": "to flare and there yo big", "gablealdade": "Que mulher linda!!! Amo seu cabelo", "mrsstephieg": "You're beautiful.. these jeans are wrong, the flare should be higher up.. it cuts your legs and makes you look short. It looks like fish fins .. your to pretty to wears these please don't.", "theresajcp": "The pants are odd. I feel like you can get better flares somewhere. You are too good for these pants!", "echakhaled": "Lucyu @virdareghaal", "asanne87": "I think they look great on you 😊😊😊", "babyruth728": "The proportion on the legs is off somehow. The dark wash is nice and it looks like the rise is pretty good.", "jennsbananas": "Omg I love them and you totally rock them!", "glh_89": "You girl are gorgeous though", "chenilinter": "I'm not into them, but you are beautiful.", "spirit.moon.love": "Love your bell bottoms jeans thy are super fab!", "mypetdevil": "totally into them", "sparkle.n.fade": "I love them!", "runawayrosie_": "I think they're kinda fun! They're like the jeans version of a Saturday night fever costume. They're definitely a specific look, and I don't know that if necessarily rock them, but I also don't hate them on you, so 🤷🏼‍♀️ wear them with a sense of humour?", "suzyqinwny": "I'm not crazy about the jeans I'm not quite sure why", "bekahbeem88": "@fatgirlflow loving the 70’s vibe from these!!", "stylish.stephanie": "I love them!", "hairbycaseyj": "Mermaid pants. You look like you have fins. I think you're adorable", "mlb_bird": "Welcome back 1970!!! 😃", "ang.vaughn": "V into this look for you!", "star_angel_baby": "They remind me of the pants Jennifer Lopez wore in the Selena movie. I love them. You rock those pants good!!!!", "qimzel": "I absolutely love them!!", "nessinoonah": "#mermaid", "xxpoeticpunk17xx": "You’re beautiful so they look beautiful.", "stronglikebullbaby": "They look like clown pants", "cherlnell": "I am trying to find me some like that.", "amplewords": "No no no no...you are dying a slow death", "aletheajbrown": "Love em maybe with s heel to give you a little lift and peekaboo those ankles 😍😍❤💕🌹🌺", "ssulfaro": "Love them! Very 70’s wide bell bottom vibe. You just need a peasant blouse and a big floppy hat.", "elisakaren13": "No. Burn.", "sheryl_lynn_serenity": "Makes you look short", "autumnleighbailey": "These fall on that fine line between love and hate for me. Like, I’m super confused lol. you look cute as hell though.", "haute_mommie": "Nope", "janeyrocket": "I'm not a fan. Of course I broke a toe tripping over my bells in the 70s so I am maybe biased against them. 😂", "mollielucpicard": "Imagine with a chunky platform sandal from brass plum", "rochellefatleopard": "I love them , you & @nataliemeansnice make me want them 😩", "leaomgee": "Nah. You can get a better looking pair of flares. The break on these feel like it's in the wrong place.", "chrisanneee": "@fatgirlflow gorgeous 😍 what kind of camera is that?", "sskatharineleee": "I’m reaallly digging these! Getting out of my skinny jean cave to love on more styles", "hannahshayee": "Those are actually so fucking cute", "misspunkypie": "Definitely an interesting look, but not my personal favorite, I feel like the proportions are off.", "thejoyfuldays": "I think with wedges these would be cute AF! That’s the only way I could wear them at least, I’m way too damn short lol", "ivoryhealthcare": "Sexy", "gabriellae95": "These are made weird.. love flare jeans just not this pair", "hraewill": "They remind me of those Matilda Jane little kid pants I hate so no, I'm out lol.", "shamaun.sumon": "So beautiful", "samoodeee": "LOVE LOVE LOOOOOOVE me a good bell bottom 😍😍😍", "saoishell": "they'd look way cuter if they were a lighter blue and started fanning out at the knee", "smarterthanyouraveragesprinkle": "I had a lighter wash pair like that in middle school. It had rivets down the side, I wore it till it couldn't be anymore.", "catcancraft": "Oh man, Delia*s vibes are strong with this 😝", "gabeeella": "I don't like the fit of them. Maybe the flair out should have been a bit lower? It makes the leg look shorter than it is. But you always look lovely and make things look great", "paigekeeperofbeasts": "Calf skirts 😂 I’m not into them but they seem to be v. fashionable these days", "hollyrh1227": "I think that they are cute and have potential... you could alter them. But as they are they seem like they are too big on you.", "natural_blessing": "They look really cute on you!", "thecookiearchitect": "I'm not in love. If the flare started 6\" lower?", "peggys74": "I love flare jeans !! Love them !! Wish skinny jeans would vanish for good !!", "curiouser_etc": "Nooooooope", "jackspade755": "You look good in everything", "motherduckinggingers": "I am not digging the flare. But everything else is fabulous and shows of your badass bod. If anybody can work those, it'll be you", "afunctioning_fox": "I think if the flare had been lower and a little less flare they'd be 10/10 but o still dig them and give them maybe a 5.8/10 not too low that I would never wear them but not high enough to be a staple", "somebeach84": "Not crazy about the jeans but your hair looks amazing! 😍", "nikiknits": "Feels like what Carmen Miranda would wear on her day off! BUT if you love them, totally wear them 😁.", "sydsativa_x": "I would get the bottoms of them sooo dirty", "ricola2333": "Those are everything 😍💖✨🙌", "cleanestpineapple": "I think they’re cute, but I have zero fashion sense.", "kayleighloren": "I feel like the proportions are just slightly off on them. Like if the flare was just a bit narrower or if it was the same but started a bit higher on the leg 🤔 idk", "hoarderofthemakeup": "I just got jeans like that & I’ve had so many compliments!", "rachlharless": "nooooooo!", "thelindanator": "These are cut strange and don’t look like the bells they should be. I’d pass. You deserve better. ❤️", "lovey1313": "I’m all for if you like em, rock em. For me personally, I would pass.", "winibird1315": "Nice haul!! Thanks.", "stephssismyname": "Each leg looks like an hourglass", "bsizzle95": "I love! Im here for these pants 💕", "tolazofya": "That reminds me how much I was all about my flare jeans in college. I approve.", "chubbystruggles": "I want to hate them. I really do. But I just can’t because they are SO extra and they look SO cute on you", "fatfiercefutch": "These are cute but I... I don’t know why?...", "themrsdixons": "Love the jeans", "cals_momma": "yes to bell bottoms", "missmollydollygoldstein": "Cute!!! They remind me of a pair Madona wore in a concert video a long time ago", "waterswife": "Oooo I love them!! You rock the shit out of those jeans, girl!", "420witch": "I love a good bell bottom!", "pretty_eyes71": "Oh my fucking goodness! I always wanted huge flare leg jeans, but could never find them in my size. 😍", "muyfifi": "Cute jeans!", "alisonofagun": "I want to love them but I do not!", "lcrate41": "i know they're outside your comfort zone. but they rock. may i suggest a cute pair of metallic heels?", "findingevie": "@fatgirlflow They dont really look like bell bottoms, thy look like they were a dress with a ruffle bottom cut and sewed i to pants. I mean i think you could rock a potatoes sack but for me these pants are a total miss.", "l00nylovegood": "Honestly I was JUST thinking about how much I want ridiculous bell bottoms back. These are great.", "nataliemeansnice\nVerified": "Verified", "the_official_clown_queen": "I love them, cute and retro i think it would pair good with some chunky boots and a cute hoodie or sweater!", "skyofsonnets": "Yesss to all bellbottoms!!👍🏻❤️💕", "crystadarr": "I agree with @breeziebrimstone. They seem to make the legs look shorter. For me...I don't need my legs to look any stubbier than they are 😆 but if you decide to keep them, I am sure you will style them to look great!", "thebigbeautyslayer": "Those are really cute i just brought something like that", "finally_bopo": "This will really date me, but when I was in college, the bigger the bell bottom, the cooler the look. I wore huge bell bottom jeans with platform heels!!", "simplyamberh": "Love them!! They are cute on you!!", "heymisspatty": "Into them! They look so cute on you!", "krissykaat": "I think they just make you look shorter than you already are. So cute tho!", "ginger.loves.fred": "I think they are weirdly adorable. I also like them with a plain white t- maybe more of a v neck men's cut with rolled sleeves, though? I think they would look cute with some simple jewelry, flats, and a floppy hat. I don't wear make up and spend 90% of my life in pjs, though, so I may not have any idea what I am talking about. Lol", "sunnidaze53": "I love the jeans. Im all about the bell bottoms, the 70's vibes❤", "sku11conbow": "Love!", "xo_angelina": "Super cute!! I think it's just weird to see any jeans that aren't skinny jeans these days but I'm ready to bring back the flares... you look 🔥🔥", "jill_grun": "Ha, there is something a little weird about them but I don’t hate them", "spirallingout": "I want them!! I love flare!", "e.laner": "As my nieces would say, “No tanksh”", "pardonmewhileipanic": "Omg bell bottoms finally are coming back again lmao", "hilarybilary": "They’re cute! They’re only weird because instead of naturally flaring, the decorative seam above the flare is like HEY LOOK HERE 😂", "breeziebrimstone": "I dunno, they look weird... personally I wouldn’t wear them... seem to make ya look short... but hey, rock em!!!", "stonecoldcassie": "freshman year me is eating my heart outtttt", "ehdez_": "I loveeee 💕❤💋", "distantrelative_": "Nah :/ they're 90's and not the good part of the decade", "laurenmaggie": "I’m not mad at it 🤔", "sloth_willow": "I really like them.", "bunsarunski": "I kinda want them.", "mistylouwho": "I adore the jeans!!!", "clepetar": "Nope!", "sincerely_rad": "I don't hate them, but maybe too mermaid-ey", "ladycaribou": "True bells!", "elise_tupper": "@fatgirlflow you do you babe, but my vote is no for those since you asked", "sarahjuly810": "I love me a flare jean, but these babies are hella bell bottoms. Lol 👍🏼", "halle_hathaway": "LOVE THEM❤️❤️", "tarockamyworld": "I think the jeans are cool!!!", "chasijernigan": "I love these pants", "majarihtar100": "Yes girl you slayy ❤❤👖"}