{"borjloo3": "🌸🌹💋💕", "salah_bassas": "@fatgirlflow please speak me", "shazam_shazam_shazam200": "Mmmmm", "turbogian": "💓😙😍", "thickassthighssavelives": "I can’t love this enough. Thank you!!", "amelya.kr": "@anirarlyjenner", "the.sober.phenobarbiedoll": "💓💓💓", "luisalvertomartinez": "Muy linda mujer", "humanity.0202": "beauty sexy .❤❤", "laceystone83": "Seriously the most beautiful and adorable pic ever", "samanthamilam0007": "Love it!!", "icenyucel": "😘", "jelle________": "@dimma_vv", "life_is_a_beautiful_lie626": "Is this a before and after pics of her when she was fat then became healthy?", "mrs.dandelion": "LOVE this top. I’ve been dying trying to find a plus size crop top! I’d love any recommendations!!!", "domitilla_navarro": "@jessicaaaaam", "zmnkwjf": "👍👍👍👍👌👌👌👌😗😗😗😗😗", "itsnoteasybeingmebigchris": "Beautiful", "elementalrose1803": "U look like a goddess!", "theartistkotahmoon": "💜🌙", "williamburries": "2532892234 bill", "schreckwalter": "Bellygirl", "sellessa": "@diegovespa_", "pixiedustandsunshine": "I’m reading this on a day when it was the most impactful and important thing I could have read. I can’t thank you enough.", "zurioliviam": "you’re incredibly beautiful!!!!! it’s amazing to see such beauty both inside and outside a person", "pinkfrosting23": "you give me so much life @fatgirlflow", "boldbutterfly8": "💜💜💜👑💜💜💜", "ehsan_jp1984": "Cute belly", "chocolatebutterfly1604": "Thank you, you are truly inspirational", "schapman1969": "Yes ideed", "_sheenamarie": "💖", "radical_reesie_d": "I’ve always loved this photo of you ❤️ Degree or no degree, eight years of college is A LOT and an impressive amount of education. I say this as someone who has spent the last eleven - yes, ELEVEN - years in college about to FINALLY get my doctorate, but man academia really sucks sometimes. I don’t know what happens after April 27. And that’s terrifying and also incredibly exciting at the same time. I’m glad to know I’m not the only near-30 year old who’s been completely uncertain of what’s next! You are beautiful and wonderful and so so inspiring 🌈❤️🦄⚡️", "amandamccarthyx": "You really are an inspiration ♡ literally just now in bed i was just looking at myself and wondering what the hell I'm doing at 25. I got married but always felt there was more I'm supposed to do yet at the same time felt that I ran out of my chances to do things! I know this probably doesn't make much sense...but thank you ♡", "shamaun.sumon": "👌👌👌👌👙", "stephanie_dawn88": "You got a PhD in You ❤️❤️❤️", "camokt": "I’m in love with that tattoo!!!!! You’re beautiful", "davey_8131905": "A beautiful child of the forest", "imaybeabitch_butyourmomsahoe": "You're awesome", "riyadsamir1973": "ووووااااااو", "thekatandthespoon": "Well this was well timed and much needed. I have fibromyalgia and am in need of a career change. Are you able to support yourself by just blogging? Do you have any advice you would be able to share?", "tamaryacoubian": "Needed to her that today, much love! 💕", "a_shweeii": "I love this! You look so free!", "sammyofawesome": "That tattoo tho! hawttt!", "mrscarpenter_est2015": "Thank you for the encouragement", "magalii58": "Needed to hear this! ❤️ thank you", "harusenpai3328": "Lindaaaaaaaaa", "karzan_4141": "Hhh Love", "fabulouslyfallon": "I needed this inspiration this morning it was literally the first thing I opened this morning! I’m pushing for my dreams and goals! I want a job I enjoy!", "tho7882": "Amazing xxx", "wilde.beest": "I love your tattoo, and your outfits are always on point! Thank you for always being so sincere and positive in your posts😁", "gouzalbrahim": "الله أش.هاد الزين.", "mis100kilos": "Visiten mi Bio 💋🔥💥💫🌀", "kshellrude": "So hot. Just beautiful. And inspiring to see someone with a body like mine love themselves", "itslikecheela": "This is beautiful! Def needed this; something to remind me to continue being great!", "rao1825": "Woooow beautiful picture", "rachlharless": "youre an inspiration", "__amanda__lorian__": "Beautiful image & you a Queen 🙏👑", "sassychunkamunk": "The 8 years of school with no degree resonated with me. I'm 25 and mental illness has left me pretty much disabled for the time being and I feel like a failure. Thank you for reminding me I haven't failed🖤", "jasonmaek\nVerified": "Verified", "robin_fadobey": "Nice looking", "essoukrimariem": "You're an inspiration 😍😍", "venisponce": "But how did you make a living doing this? I desperately want to branch out and become more creative but how??", "bagga.amrit.italia_": "🤗🤗🤗🤗🤗🤗😍😍😍😍😍", "martynkaxlis": "Much love to you, this is super inspiring 💓💓💓", "koroshkabir7345": "سلام", "salimahmad20122": "Very beautiful", "sozsamanali": "@miinnnaa dlishi ba xoy xosha", "juicytaurus": "I remember this is how I started following you", "stu393": "Love the pic", "jillnye_thescienceguy": "Beautiful", "r_a_stark": "I can't adequately express how much I love this photo and how much this post resonates with me. Thank you and blessings to you!", "zanneyoungblood69": "Ya have became in of my most favorite people ;) You are always so real! It's okay to be real and say that on certain days we are not okay or happy every minute. You also encourage people to go after their dreams, to pursue what makes them happy and to chase what brings your spirit freedom!you encourage many to love the body we are in....and that says alot! Regardless of our size or shape, all people have a hard time loving themselves and ya try to help people walk through that! ;) I hope you continue this journey and live life to the fullest! Best wishes sweet chica! ❤💜💚💛💙❤", "missdanielove": "💗💗💗💗", "mayamoonpoet": "You goddess yes!!", "julphilam": "Love yiou baby Mon coeur je t'aime 😍😍😍😍😍💓💓💓💓💓💋💋💋💋💋", "proof4life627": "Oh my word I think I love you Kiddo", "spurarkar": "...wOw...lovley pic...👌🏽👌🏽👌🏽", "crescendeo_man": "You go Girl rock out with all of your dangerous killer sexy curves of yours", "thequeenwithinme": "Your belly looks so soft. Like you give hella good cuddles.", "the.olivia.bee": "This was much needed today. Thank you, you're lovely ❤", "laurainnis": "If you aren’t just the cutiest patootiest thing I’ve ever seen, I don’t know what is. I love this picture of you and I adore your belly! You continually inspire me to challenge my own belly not-love... slowly, I’m getting there... ❤️❤️❤️", "ol_kg": "Wow, I feel you on the 30, with a lot of college and no degree! Love your posts 💖💖💖", "gruss.vom.jodi": "I love your tattoo! ❤️", "bluegraygreen17": "You are magnificent. Thank you for sharing yourself with us!", "pedxing713": "I'm a newcomer to your blog, but I've enjoyed it so much. Reading it has helped me branch out of my comfort zone (experimental crop top and a bikini are on my list of things to try) I'm terrified but I know I'm not alone. :)", "hector_luvs_coffeeeee_": "🍷🌺", "bucknakedsoapcompany": "I need those jeans 🤗", "emilyoliviab": "Love your everything 😍", "becanderson5": "Girl you’re stunning! So proud of you xxx", "coralkittyy": "❤️", "thorson_boudoir": "Yes!!! All this made me so happy 💖", "timmywiththebluedresson": "Your belly is so lovely and sexy. Own it girl! 😊", "curvestyles_fashion": "I think this is a kind of beauty!", "audleyirregular": "Wear what you wanna wear and don't worry about judgemental people. I wear them all the time and get shit for it, by teens that judge me in public, but they don't matter at the end of the day. 💕", "isabellabrusilo": "You look so cute and happy 😊 I aspire to be that level of happy 👌🏻♥️ @fatgirlflow", "softbodytendermind": "💙💙💙💙", "little.miss.alexandra": "I’m 26 and have a bachelors and no career to show for it. I have had health issues and have made not so wise choices and was shackled by guilt, shame , and fear. Up until recently I didn’t have the confidence to try. I’m glad I’m not the only one to have blossomed later in life. Thanks queen! You’re so beautiful!", "ambrosiaminge": "You are an inspiration! Thank you SO much for being so innovative and honest! 💖💖💖", "lorribell1964": "#nailedit", "bradi_fisher": "Beautiful", "yourmotherwearscombatboots": "Love this photo", "crab_helltime": "I am so glad to have found this account. You’re incredible. Thank you!!!!", "conniepeterman": "Wish I had your courage", "motoluvchi": "♡♡♡", "beetlemancy": "Man. That's where I'm at now - almost 30, still not graduated because of medical issues, feeling a bit stuck and like I'm taking up too much space in more ways than one. Thank you for this post, I needed the positivity!", "paige_m_chandler": "This is amazing I really loved reading this. I've been doing this new journey as well and I've been struggling lately but thank you for this❤", "liaebillyn": "Linda", "whitneytheinvincible": "Thank you ❤️", "nvidious_me": "I love ur tummyyy!", "takynhobjj": "😍😍😍😍", "richardli899097": "Hey and Your Belly is so big and sexy! And. Cute!", "_aurihdz_": "Eres increíble 😍", "chronically_keri_luv": "😍😍😍😍", "maegeandd": "I really needed this today! Thanks for sharing.", "lovelyletxo": "So cuteeee☺️", "rob_ballantine": "Yesssssss to both picture and caption 😍😍😍 @caitlinjill", "ladygreenetea": "I’ve loved watching your journey Corissa! Glad you are happily being your authentic self. Wishing you the best as always!", "satsukithesweetest": "👍👍👍", "kimmyrayphotography": "As long as you are healthy, i say..... beautiful ❤❤❤ your confidence is inspiring.", "thepluslifeblog": "A wonderful story of finding yourself and living your best life. I just turned 32 and am inspired by what you’ve been able to accomplish. Thank you for sharing your journey!", "gordonadrianne": "Thanks for taking so many risks and being such an inspiration for many of us! 💙", "cualla33": "Beauthiful!!!i love your tattoo", "felicia1220": "Your confidence is contagious! And I thank you for that.", "lowcountry_mom": "Thank you for sharing. I went to college for about 8 years as well with no degree to show for it and no money or financial aid to go back. We find our way. Lots of love", "_mississippihippi": "@fatgirlflow I needed this today. 🖤", "drtist102": "Looking good! Amazing pic!!!!! 😍😍😍", "rinaa.michelle": "Gorgeous! 😊", "pikagirloffical": "What website you use make a blog? I want do the same", "tiff.porter": "Out of ALL of the plus size bloggers, you are my favorite!", "mehran_sharifat": "😍", "funkychunkyy": "Yes to loving authentically while growing YES!", "giancarlomorrison": "Soooooo fucking cute!", "pia.a.c": "@isa.j.49", "heidishartrandnewell": "At 27 almost 28 I am just now chasing my actual heart dreams. 🎉🌻 Every plant grows and blossoms differently and I love when we share our real stories we represent all the different ways people can bloom. 💚", "felimarie_": "Omg woman crush every day!!", "amethyst_bliss": "Stunning 😍", "bam.peesly": "God I love your tattoo so much. You’re making me want one there even though I freaking hate my torso. But I love the way your tattoo looks so much, it’s so pretty!", "saucychick": "I needed this pep talk today", "yumaratz": "I saw this when you first posted it. I thought that you were very beautiful, strong and confident. I have followed your blog and YouTube channel for some time, my opinion has not changed, you are,still beautiful, strong and confident. Please keep it up.", "chas_so_fresh": "I love this pic❤ you look beautiful✨", "illaheemoon": "Love it.", "veradoes1": "Love love love!", "spooky_fckface": "What a babe 😍😍😍😍💖", "jilllepire": "This picture is everything!!! I love it!!", "dreamcatchingbebe": "A true angel!", "alysonmcc": "I love you BB. You’re amazing and perfect and I love you with my who heart. Also let’s never wear bras again and take pics of ourselves and put them on the internet so everyone knows goddesses do exist💜", "comfyfattravels": "Im so incredibly proud of the human you are❤️", "sad_but_rad90": "I’m just starting my journey of living authentic, I quit my job today an hour into my shift, I’m going to do whatever it takes to make myself happy & continue to work on me and my mental health Because a happy healthy me comes first", "volup2": "Bravo!!!", "joeyjo422": "Thank you @fatgirlflow this is what I really needed to hear/read. I have 4 years of college and not a career because I have a chronic illness. I think I need to change my dream. ❤💛💚💙💜", "luellaarbre": "So proud ❤️❤️❤️❤️❤️ I can't believe it's been 3 years since you started this chapter. heart beams for you 💕", "estovadeamor": "i am so happy you dear to do it, and that that huge step made you the free woman you are now... we all have issues, upssidesdowns but too many people die without showing what they feel, think or believe... happy 3rd anniversary!", "owlloveu4eternity": "I’m so proud of how far you have come and how much more beautiful you get daily. I adore every single one of your photos. You even inspire me with my imperfect mom belly. I love talking to my best friend about you and all the other IG ladies I follow that are plus size like her. I try to build her confidence by showing her she’s beautiful just like you. I hope that my best friend can one day grow as much confidence and self love as you have. Love you loads!!!! 😘💋💋💋💋💋", "margotmeanie": "I adore you and I’m so happy we both took a scary plunge into the murky confusing waters of blogging, I’ve found a true kindred spirit in you and I have the internet {and our guts} to thank for it! 💗 you’re beautiful in all ways!", "jill_grun": "I ❤️ you", "naomie_shepherd": "Beautiful 🦋", "neoqlassicalart": "😍😍 I’m dying this photo is everything!"}