{"kingderrick215": "@fatgirlflow I love your thighs 😘", "el_cocho_507": "Como quisiera poder estar a tu lado para robar un beso amor", "annapoppzz": "Omg ive been wondering about these. So happy to see a review about them on big thighs... now to have money so i can buy some lol thank you for reviewing them", "michaeldavis339": "that fat adipose tissue", "osminmartinezosmin": "Ummmmm babi nekl", "weeed_215": "🤱🏼🤰🏼🍼👀💍🧖🏻‍♀️💫🥥🥜", "driss3843": "Wach raky and the original", "damondame916": "Love them curves", "anna_phylactic_shock": "I’ve been meaning to buy these for like a YEAR. Coupon code was just the kick in the pants I needed to get em. Just placed my order!!", "ohsolovelyonline": "Ooooo I ❤️ your dress!!! 😍 So pretty 😊", "bigfish19603": "HI SEXY", "jlang59": "Beautiful pic. Love the thigh..., very sexy. Love sexy legs and thick thighs. 🌹🌹🌹", "jacqka.scopio46": "What a beautiful pic ...gonna have to definitely sketch this one ♡", "gurdansinghkalsi": "GORGEOUS CURVY BEAUTY", "theotismorrison": "Thickoliscious Thickoliscious Dazzling Delicious", "sarahlynnwood_fam": "@jbwood89", "d.t.1763": "Me too", "jciarlo68": "cellulite", "alexx_fernandex_": "@jiya6363", "kaity83": "@fatgirlflow hahah I love what you wrote! I feel the same about my thighs! My husband loves every inch of me and he and endearing term for them hahaha.... he calls them his baby prosciuttos lolol. He is first generation Italian American.. so you know... hahahah", "megzmerritt": "I need this dress 👗 where is it from???", "muhammadzubair919": "Like this style", "schreckwalter": "I love your thighs... and the rest of your beautifat body‼️❤️", "brendabuttabing": "...", "f.korkmaz2550": "Live hunger now cime okay", "cc11395": "Should I go by measurement or pant size? I see your comments that maybe you should have sized down one, I'm a pretty true 26 pant but the measurement would put me at the top. Maybe @bandelettes can let me know?", "missmollydollygoldstein": "You have sold me!! I'm totally buying a pair!!!!", "sunflowerkelly": "I ordered a pair and am excited to try them out! Thanks for the discount code. I live in MS (used to live in Lawrence though!) and really hoping this helps combat the sticky humid summers!", "caseylane031602": "So my thighs always rub and chaff really high up, probably the highest point that would still be called thighs. So I would have to pull them all the way up to my panties I think. Anyone know if they still help there?", "ganralph.artist": "🌹🌹🌹", "alexk.png": "Ew", "leereignssupreme": "😍😍lover!", "hssain0": "😙😙", "yoonasmommy": "Obsessed with that dress!!!!", "thebookishraven": "I just bought these in the F size! I've been wanting to try these for a while but was worried about the fit (I'm a 22-24 in pants) but now I'm so excited!!", "hbpalindrome": "Where", "woodlandteatime": "I’ve finally been convinced and ordered a pair yesterday with your code! 🤞hope they work for me", "kristxn311": "They didn't stay put for me at all unfortunately.. but more importantly, I'm obsessed with this pic of you!! It is so beautiful and romantic and timeless... Gorgeous!!", "punk_flamingo": "I’ve refrained from ordering because I just really didn’t know the best size to get or if they’d really stop the chub rub. I’ve worn cropped leggings under my dresses for years but on hot days the extra layer is sweat inducing.", "26kleisen": "The lace ones still chafe my thighs, but there seem to be smooth ones as well.", "m.dechesser": "I didn't even know such a thing existed-thanks! I stumbled across your Instagram this morning and I love it. I'm 47 and last year I left a teaching job at a military academy because (sadly) one of the reasons was that I was tired of watching men treat the teachers they found attractive (i.e. slender to skinny in revealing clothing) better and with more respect than they did the women they considered \"unattractive\". You have more courage and self-esteem than I ever will and I'm looking forward to your posts. xoxo from Italy", "upbeatannie": "@fatgirlflow where are your shoes from??? I need a pair! And that dress!?", "scuffeddocs": "Please post more of where you buy your clothes!!!", "ohmslewis": "@jennifermwitek", "trashprincessforlyfe": "These are literally thigh savers. Wearing one now!", "moseymel": "Wish I had confidence like that!", "js_photography2012": "Thank you for showing that a plus size girl can show off her sexy thighs too. You are awesome and I love the new photos you have been sharing. Keep up the great work.", "o.k.whit": "I love your outfit!!!", "jmiller1536": "Love the dress, where did you get it?)", "cody.howling": "@storyofstorms", "indiefishsteak": "Exciting! I’ve wanted to try those for a long time but was really hesitant. Lovely pic also 😊", "kathleenlisson": "That’s great!", "funny.fat.fabulous": "Amazing! ❤️", "_kei.k_": "I just bought two pairs and I'm so excited for them to get here! I can't remember the size I got, but the styles I got were one of the lace ones and the unisex ones, both in \"nude\".", "sherrijonesriggins": "Why is everything you put out so sexy lately. There is more to a woman than her sexuality.", "readytostare\nVerified": "Verified", "mbr_25": "I wish they worked for me cuz they are.soncure. I bought two pair and they just don't stay up :(. Btw, love this pic, you are gorgeous!", "cami_renee_d": "I need to try those, I’ve avoided wearing dresses because of the thigh chafe issue. Btw this is an amazing shot, Vintage vibes and I can imagine a vineyard beyond that building. It’s wonderfully romantic.", "plussizescuba": "I tried them and loved them the first 2 hours but at the end of the night I had tiny raw spots on my thighs from squishing thru the lace 😥😔", "oobilah": "Love the dress! You look fabulous", "shaylassweets": "Love this picture! 💖", "coraz_closet": "The nude color looks so pretty!!", "vintageortacky": "I love how they enhance your outfit!!", "debicet": "Gorgeous creature! They are so pretty it’s hard to believe they work! Thanks!", "muddypockets": "That dress though! Where from?", "brasschanteuse": "Yas! I’ll check them out! I love my undersummers but sometimes it’s too warm & humid to wear shorts.", "portraitdude": "Breathtaking curves... Can't... Handle... This... lol #sogorgeous", "crystalsofaltamira": "Are the shoes danskos? Lottas? Hasbeens? So cute!", "lunchladycateringllc": "@fatgirlflow what are those cute shoes?", "jillianvaldez84": "I got some but they didn’t stay up and I still chaffed", "imkagram": "The smooth ones are soooo good too! I used to wear them for 11 hour waitressing shifts no problemo and such a breezy bum", "findingevie": "Beautiful photo!", "get_slizzard13": "I just ordered mine!!! Can’t wait to get them and try them out!! 😍😍 #demthighstho", "gil.isabela": "Gorgeous shot ✨", "acsann_brows": "I saw these in an ad the other day and was wondering if they were worth the try!! Glad to hear you like them!! Might have to try them now for myself!", "vicesmithh": "In love w that dress!", "shauna_aisling": "Lovely @fatgirlflow I need to know where you got that dress?? It would be fab for the summer 😍", "luxury_rider86": "😍😍😍😍", "thekingsqueen12": "Bandalettes AND Kix'ies roll straight down the minute I start walking. I seriously feel like a freak of nature because I've never seen anyone say they've had trouble.", "fatgirlflow\nVerified": "Verified", "bignewt2012": "Beautiful beautiful", "jenny.coxmooneyham": "I wanted to try them, but my thighs are bigger than the size chart for the biggest size. I am a 22-26 (depending on brand) but I have big thighs (34 inches at the widest point)", "jacenmesser": "Need these now", "sassypants_2020": "@fatgirlflow Where are your shoes from?!", "poohbearleiter": "Thank you!! For the code & for trying these out for all the big girls in the world!! I was afraid they would roll 🙄 can’t wait to get these and try them!!", "ladyfreelove": "Oh yay! I’ve been wanting to try these. Wasn’t sure how well they worked!", "chloe.pitt": "this is beautiful!! what filter did you use ?! 💗😁", "eddienygma__64": "Great thighs great look great you lookin real goode", "aubsboggs": "Love this picture, and I’ve been wondering if those things actually work! Yay! I hate wearing shorts under skirts, but if I don’t my thighs will punish me. Clearly all I needed to do to make my thighs happy is give them some stretchy lace ❤️", "joaopaulolinooficial": "😍@fatgirlfow I love women chubby love of passion💖", "z.trox_": "Where did you get those shoes?", "queensizemind": "This picture is everything!😍 the dress, you, the shoes, the scenery!😍😍😍😍 Everything!", "streganona_": "how much of the thigh do they actually cover? i wanna try them bc i’ve been having so much trouble finding good shorts but i chafe at the very top of the inside of my thighs and the middle too... if that makes sense lol", "fullmetalfuckboymoving": "You are so beautiful and inspiring 💕", "lokobueno": "If those are your panties I love the color did u design those yourself ❓", "skyelo.ren": "How long did you wear them?? No chafing?? They didn’t roll down?!", "paisley_window": "TAKE MY MONEY!💸💸💸 just bought some using your code!! Thank youuuu! 💖", "allendkranawetter": "Sexy", "kel_low": "I’ve wondered the same. Thanks for trying it out for us... I’ll definitely purchase some now. What size did you get ?", "notablenormalcy": "Well, I’m gonna try these now.... so much cuter. @doasindough", "miisskyliinamariiexo": "Oo I was to order a pair :)", "simoneregina_": "What size did you get?", "hananhakmani": "So beautiful", "myssticglowxl": "It's so cute!!! I love it!! 😍💖", "amyaimlessamers": "I love bandalettes! Just bought them and the lace shorts a few weeks ago. Summer dress ready!", "jessica_kane": "Saves me EVERY TIME! 🙌🙌😍", "ladieairam": "By the way you are an inspiration", "sociallyamber": "Beautiful!", "sarahnthropic": "I LOVE my bandelettes. I have big thighs too and they are even a little loose!", "wilde.beest": "Your shoes are super cute 😍", "canadiankittenn": "@spazforlife", "rubenesque_life": "Love this post! I got thighs for days and never heard of this product. Running to check it out!🏃🏾‍♀️🏃🏾‍♀️🏃🏾‍♀️", "mechanicshopfemme": "You're thighs are incredible. I tell me girlfriend all the time how much I love her thunder thighs!", "_blushingbutterflies_": "Bandelettes are life savers and life changers!", "littlemrsbutton": "OMG NEED", "frenchfriesandfairytales": "This past year I feel in love with my legs and thighs and it’s seriously a revelation!! 😍 love this photo!", "jamesahawkins": "You have some sexy thighs", "hippiechickokc": "Where did you get that dress??? Swoon!! Looks so cute on you.", "account.disabled.xx": "YES, FRIEND!!!! My @bandelettes are the best purchase I've ever made!!!! 🦄", "marisanachronism": "they're so cute!!", "sumajanedark\nVerified": "Verified", "nikiknits": "Jealous! I tried bandlettes but they just kept rolling down 😭", "megnmar": "Really?!?? I wanted to try them as soon as I saw the ad! I have to wear shorts under my dresses or my thighs rub together with a love /hate relationship! I always thought I was just too big for everything so this is very promising!!!!", "seisenbart": "You inspire me", "organicskytherapy": "Omg! Thanks I was sooo wondering about these😍and stuck wearing cotton bike short like things under all my dresses but sometimes I just want to have less on me! I can’t wait to try these😁", "rachiedoodledo": "Love your shoes love your thighs love you xxxxx", "sarahlynnox": "Omg I've been searching for these.", "leandria888": "im so happy to see this. theyve been forever in an open tab... but im about to buy some now. :)", "imagine728": "@tiffb2388", "pistolkiss": "Size?", "lady_ean": "Are they super different than shorts? I’ve thought about trying bandelettes but wasn’t sure", "maggiemcgill": "Stunning photo! Seeing thighs that look like my thighs is always exciting 💕", "trexysteph": "This gives me hope because my thighs are similar to yours and I thought sure they’d bunch up or roll down on me! Thanks for the review—I’m going to look into@them. 😊", "aliciasanchez": "ooooh! can’t wait to try them!! *writing this while wearing a skirt and biking shorts* also these shoes are so cute!", "tonsablush": "Ok this photo is truly art!", "pacificmidnorthwesterner": "@pat_macooter they don't work for me, either. I've tried different sizes and styles and they're just not for me :(", "saraaaaa_allison": "Do they not roll? I’ve gone to men’s sport-tech style boxer briefs for under my dresses because anything thigh-highish always rolls. Like thigh-high stockings don’t stay up on me either for the same reason. (Thanks thighs.) Do these not do that?", "curvygirllingerie": "They compliment your outfit, too.", "moose.mece": "I've been using them for a while and it's surprising how well they work. Seems like they have a lot of sizes too. +1 for bandlettes ✌️", "yumaratz": "So beautiful!!!", "tessdeviateswildly": "Do they make that annoying swish swish sound when walking? It’s why I won’t wear tights or panty hose.", "theshanz09": "I’ve been wondering about these I have very big thighs", "jesslacombe": "I’ve always wanted to try this product out but wasn’t sure how it would work on an 26/28 body type. Definitely gonna try them out now. You look fabulous sister.", "damn_the_torrpedoes": "Omg adorbs", "therelatablefatgirl": "Every spring/summer you bring out those shoes and every time I’m jealous lol 💜", "chubbystruggles": "I’ve been dying to try out Bandelettes; they look SO cute with this outfit!", "mulsmulsss": "Are your thighs bigger than the size chart? Bc mine are like 2 sizes larger than the biggest they carry based on the chart but like, I realllllly want some for an upcoming vacation! Lol", "thehannahsafrit": "Thighs are something I’ve never liked about myself. But now I love mine", "high_five": "I’ve been nervous to try them because it’s hard to believe they would stay up. But I think it’s time to get a pair!", "amandawiththelymedisease": "Is that a fucking toile dress?!?!? I want one! Where from?", "shopkodablack": "Wow, this is such an amazing and beautiful picture! <3", "just_me_being_me_71": "I love your shoes!!!!", "femme_frankie": "bandalettes are such a game changer!!!!", "beckylovesflowers": "🤗", "margotmeanie": "Thick thighs save lives!!", "carogaff": "just bought mine!!", "the_huntswoman": "THIS LOOKS LIKE A PAINTING!", "sisu_and_finn": "#plussize #thighs #thickthighs #moretolove #curvy", "pat_macooter": "I think I'm the only one bandalettes don't stay up for 😂", "palankfashion": "😍", "comfyfattravels": "Those thighs are my FAV😍😛", "captivatingly_bri": "These are brilliant, and I'm getting some. I can't believe someone didn't come up with that idea sooner! 😂", "magl84": "I love ur 👠"}