{"ladybug_mambo": "I’ve never heard anyone else put this into words so well. I feel this all the time. Go you! You’re rockin that outfit! ♥️👍", "sparkle__toes": "@fatgirlflow yas girl yas! I am working on this right now myself. Even with my face. If it's not a certain angle I don't like it. You just inspired me to roll this ball even more. While I've acknowledged I do this, I don't actively try to push my boundaries. Seeing you sitting there, slaying it and looking gorgeous af, makes me want to show everyone all my gorgeousness!", "anxietygirl92": "Terrabone!!!", "re_used_muse": "I feel no issue with my body but feel discomfort with chairs and hear them strain. I kid myself into trying to ease into them and to sit lightly as if there is such a thing", "sayshesclassy": "This means so much to me because same. Same fears. Same challenges. Same. ♡♡♡", "cathys6319": "Thank you, thank you, thank you! I’m working on it!", "ilovehanson": "Love this so much! Also, now I'm craving hush puppies!!", "whyddadleave": "You gonn die", "ahbab2135": "🌹🌹🌹🌹🌹🤦🏻‍♀️", "barberawallinger": "XOXO", "r.i.pblanca_": "#rp", "livingwithkami": "I love this so much, thank you ;~;", "inotdene": "Your gorgeous!!!!", "jehieli_g": "😭😭 I wish I could have at least 50% of the confidence you have! The selflovery you have! And the bravery you have! I so relate to your story... I have a good life, a perfect husband who loves me for who a I’m and the beings we became since we are togheter... but there’s still something in me that doesn’t allow me to love my self the way I’m, physically speaking... I still avoid to look at myself on photos or mirrors, just from the neck up, that’s it... I really want to be free in that aspect and not give a fuck about what people say or think about me (pardon my french🙊)... I will get there, just dont know how to start... XOXO 😘 Blessings!💫✨ P.S Sorry about my bad english, I’m from Mexico 😜.", "metalmomdc": "Thank you for this! It helps me and countless others.", "mobopo7": "Hell yes 🙌🏻", "nooralhuda__": "@heyitsmemaddybee", "jamiesierrarex": "Now tell me where you got those pants! 😍", "turkoguz21": "Very nice 👍", "osirismendez9": "😍😍😍😍😍😍😘😘😘😘😘😘😘", "didnnelps_haras": "Except that isn’t you!! That’s what you have allowed to happen to you! The real, true you is trapped in there under an extra 250 lbs that she has been buried under. Exercise, clean eating, and in extreme situations the assistance of the medical community. This isn’t you and it’s sad that you’ve let yourself go so far that you’re convinced on that 😞", "bonitaaaa23": "I resonate with this post sooo much . I have a hard time looking at my self fatfromside pics . Also pics that other people take of me , like i don't recognize myself.", "ughtam": "@_lilclot", "auntavia_jackson": "🙌🏾", "andersonmaine0": "Looking good", "vulnerableandloaded": "#effyourbeautystandards @effyourbeautystandards", "fatbuddhababe420": "I relate to this hardcore.", "tenderfish": "i so struggle w that side view. i will try this for sure. you are amazing and beautiful, yay!", "jenlyn1925": "You are so beautiful 😍", "lexiloveleo": "Love! ❤️🙌🏾👍🏾💋👌🏽", "absolutlyarleen": "You are a role model! 🙌🏽", "adriattack420": "This hit me really hard. And I have tears in my eyes. This post is really powerful & extremely important for bbws all over. Thankyou for your inspirational words.", "c0rganic": "This photo us super cute and the filter is so aesthetically pleasing, Lol what app did you use for the \"dust\"", "jenoinidaho": "Thank you! This is so difficult for me.", "glamorousmichelle": "I can relate to this so much! You are so amazing , thanks for sharing this ❤️", "positive.janneke": "O girl. You are inspiring me so much. You put the words in the spot. I am working at it. To say to myself I AM ME! Thanks for the boost. ❤️", "thamiordunha": "Amazing! 👏🏻👏🏻😍", "tlbbrooklyn": "Yes!! ❤️", "peachypipes": "Adore you - thanks for making this world better ♥️", "beauxjay": "My god, you all are a tremendous group of beautiful souls. I've never seen such support and encouragement... It's just awesome. The very best to all of you learning to live yourselves. I envy your strength.", "divayenta": "And as you do this you are adding to all of our healing process . You are a beautiful and amazing woman warrior!🙌🌹🌹🙏🏻", "alves.lac": "Very beautiful.", "misstiddle": "I needed this. Oh how I needed this. Thank you and you are truly a blessing to have on my feed! 💛", "hearttrees": "Corissa, I just hope you know how inspiring you are and what an impact your self love has had on my self love. Especially since once on tumblr you told me your degree is in social work like mine. Thank you for being a constant source of positive and unapologetic beauty ♥️♥️", "nony_bonony": "Yes, Queen! I love this!", "snacky_o_nassis": "I feel this so 👏hard 👏", "godfreeblackvegan": "❤️❤️❤️❤️", "cnp_california": "I appreciate this post, it provokes lots of thought. No matter what size, we all have to make friends with our bodies and ACCEPT ourselves. Thanks for being a leader in this department!!", "faiththroughpcos": "I have so much love for you and this post. ❤️🙌👏👏👏", "tbrooke115": "I think it’s great what you’re doing and you’re giving people the inspiration to be confident in their own skin. But I used to be obese and I still have weight to lose, but nobody is happy fat. I also gave off the illusion I was happy, confident, but I wasn’t. I refused to be trapped in a body that I hated. But nobody is happy being fat.", "bendingwall12": "Good on you! Keep doing this, trust me it helps not only other people but yourself also", "noemie_berla": "I see nothing wrong with your side ^^ you are beautiful by the front and the side and all the sides", "adorkable1224": "I thought I was the only one who did those things! I would avoid mirrors and taking pictures cuz I didn't like how I looked. But I have accepted myself, at all angles!!! Yaasss girl! 💜", "cristibellee": "Your incredibly beautiful....", "_antagonistka_": "❤", "anselmolisa": "I totally understand. 😕😕 I never have pictures of myself, (and never from the side) I'm always the photographer cause I hate the way I look in them. Even when I do take a picture I rarely post them. 😔 You really are an inspiration for me and many others. ❤❤", "rodriguezbabeww": "You are truly an inspiration.", "pointy.chin.diaries": "Thank you thank you thank you!!!", "lulu19781978": "...e odio vedermi nelle foto😢😢", "_froken_jessi": "Thank you for being you!!!! You are such a powerful woman! ❤️ I am so glad that I have the opportunity to follow you here on Instagram. I'm just one of many people you inspire and help by just being yourself. Thank you!!!!", "chockycakes51": "I wish I had an ounce of your body confidence. Think you are fabulous 😊", "martynkaxlis": "Hero", "akimithing": "Yep, you look great!!!", "about_a_french_curvy_journey": "Thank you so much for this very authentic post, it helps. I am not there yet, but it helps to see people showing the way and sharing their thoughts. Thanks 😉💜", "a.grutta": "Why this body so fat??????", "the.never.artist": "Just thank you💜", "chefanniercornelison": "So honest, and so lovely! ❤ keep being a badass goddess ❤❤❤", "thatlyxx": "Ugh I wish I could do that to", "nancy.wc": "You are truly wonderful 💖💖💖", "nathinnice": "You clearly want looking at the side pics. Cause you got snacks allday 😂👌", "parlezvous_": "real shit.. I feel the same way", "jennsbananas": "@mirandadesiree92 #mirrors", "succ.ulents_": "I just found your account but you're honestly such a queen!! This post is super inspirational to me and it means so much that you posted it. So beautiful inside and out 🤗 💞", "naturalbeauti34": "Thank you for just being you showing off your body I have self confidence issues and I'm just learning how to love my wholeself dimples and all lol", "mkecoffee": "I think I would have to muster up the courage to say something 😉 Here's hoping!", "xcharlesiax": "Thank you for sharing this!! Clearly resonates with so many of us 💜 also are you in Lawrence? This looks like terrebonne", "mrosemt": "This means everything to me right now 💙", "kathleenlisson": "Beautiful truth", "bbwtexastreasures": "You are beautiful ❤", "26kleisen": "Love this approach and am working on it too. #cuteAF360 Beaut pic of you!", "stephanieo422": "The first thing I thought when I saw this was.... Dang she’s at Terrebonne in Lawrence Kansas. 😂 love their food!", "khavanicole": "I LOVE THIS WITH THE FIRE OF 1000 SUNS.", "salah_bassas": "@fatgirlflow beautiful body", "mel.liloquent": "I HUGELY struggle with “me from the side”.. so thank you for sharing this. I needed it 💕", "fringeish": "Plucked from my brain. It's so good to know I'm not alone. ❤", "brautality": "Omg you are so cute ❤️", "bestkesscenario": "🌈♥️", "sehustlerosen": "I love you for this ♥️ Thank you. You are so beautiful. 💕", "debbie122009hotmailcom": "Your very pretty .", "hashbrownemotions": "You are just too cute.", "asema_kaymetova": "👍", "kabazohadji": "Love much fat lady", "soullovehealing": "🦋🦋🦋", "_sara2198_": "I struggle with the same thing.. I haven’t yet learned to love myself but I noticed I HATE the way I look from the side weather I’m standing but especially when I’m sitting. I too would take pictures purposely, stare at them and try to tell myself I was beautiful and it just never... worked. Still working on it but you honestly have some of the best self love for yourself and that’s how I hope to be about myself one day. ❤️", "ladyfreelove": "I think I struggle with this too, of being present in my own body. I either have an idealized version that’s not true, or I look down on negatively on my true form. I don’t revel in myself as I am. Thanks for the perspective.", "angela.jasz": "🙌🙌🙌❤️", "shane_eric": "that position is the best! :P", "jkalea": "Yes!!!! You are gorgeous, and enough, and perfect, exactly as you are in this moment!!! 🙌✨", "thelittlebiggirl_": "This literally made me cry so much , thank you this is what I been asking for all along !💗", "samkimgrimes777": "❤️", "ambrosiolupe": "Thank you ❤️", "sarasmiles408": "I needed this today, thank you! @fatgirlflow", "saintloopey": "Thank you for this. I have exactly the same reaction to myself “from the side”, and it’s something I need to work on.", "chloefairchildcooks": "This is soso good. My three year old adores taking pictures and often captures angles I didn't even know I had. My goal has been to always enthusiastically, authentically be able to tell him I loved that picture of me, because I do. I really do. I love seeing me how he sees me.", "awwyeahteatime": "I didnt realize how much I avoid looking at myself from the side this till I read this.", "901megan": "👏🏻", "citrusfriennd": "yr so unbelievably gorgeous and strong. ive struggled with my view from the side for so many years and yr love and positivity astounds me", "beardedlady62": "That's the way you glow, Ty fgf", "aubsboggs": "Thank you for sharing this. My new summer goal is #fatfromtheside pictures. With all the work I’ve done to love myself exactly as I am without needing to change, pictures are still one of the hardest things. I’ve also really loved #vbo (visible belly outline) pictures, to remind me that my belly, stretchmarks, rolls, and all, is a beautiful thing worth taking pictures of.", "laurench": "Hoooooooo boy this resonated with me like getting hit with a semi truck full of feelings I avoid. Thank you.", "ibreakfortrees": "Fucking LOVE THIS", "tiarraaa___": "I really really needed more people like you growing up.", "robingrae": "I love this so much. I’m just praying that some day I’ll be ok with posting a picture of anything but my face.", "claudianerinacortese": "Looking gorgeous!!!", "topperazzi": "I feel this so hard...I’ve learned to looove my curves from the front but am always less happy w pics from an angle. Gonna work on it 😋", "brito1782_betao": "Como se diz aqui no Brasil. Você tá gostosa.Com bela auta estima.", "justkeen": "This. Is. Everything. Thank you for Sharing.", "freddiemercurysmustache": "Relatable. Love this.", "bridget.sundeen": "This is truly inspirational to me. Thank you!!! 💗💗💗💗💗", "adoods": "Such an inspiration. I look at this picture of you & think, \"she's so pretty, her outfit is so cute,\" etc. I don't even consider you thinking of your body as flawed, even though I do it to my own body on the regular. Thanks for sharing your experience & being a great role model to everyone trying to be better to themselves ❤️", "missj.xo_inked": "You are so beautiful, inside and out please keep on shining ✨🙏❤❤❤", "taytroyer": "Gosh I love you and all you have to say", "jasminerustymom": "Thank you for this. Thank you for your powerful words. I feel lighter for having read this ❤️", "walla_walla_weirdo": "So cute.", "kayla.benton": "❤️ ❤️ ❤️", "q_strom_99_walker": "Sexy @fatgirlflow", "lilitheflower_": "I love this 😭❤️", "for_daloveof_belkis": "* what if i were ok with me as i am? Then i realized I probably never will, and it's sad. I know it is. I loathe my appearance too. Sometimes i feel cute and then I see my reflection and I'm just so disappointed... Anyways, i admire how evolve you are, how you embrace yourself and work at doing so more and more. You are so strong. ❤", "jimziebarth": "You are a gorgeous woman, you go girl", "iridessence": "I've been working on this myself.", "treetoplolo": "You ROCK! (And I have the same pants covered in Cat hair.)", "brittanyprice": "Just when I think I can’t love you more, I do. Thank you for sharing.", "_forever_emma92": "I still do this sometimes. I've been working on myself,loving myself. Just like I used to hate people taking pic's of me,I'd want to do it myself so my double chin didn't show. I'm starting to give no fucks about others negative opinions about me. You have to start the growth with loving yourself first, after that you can take on the world head strong.", "juicyfruitcreep": "this. so much this.", "deverarobinson": "I love this!! Your posts are always thought provoking and give me something to examine about how I view myself. Thanks for the positivity, you’re more encouraging than you even know.", "insightful_bliss": "This is the most honest and beautiful thing in the world! I aspire to the the same this was self actualization for me 😗", "citrus.b0y": "You are so beautiful thank you for sharing this. It reminded me to love my angles that I'm afraid and ashamed of, reminded me that I am beautiful from every angle just the same as you are.", "lovelystarlite": "OMG this is me. I can totally relate. We are so used to pick our body apart, we sometimes forget to love it. Great trick to challenge yourself, I might try that!", "missriss12": "💓", "jencatwho": "You are amazing and I can not say that enough!", "heartflood": "Thank you so much for this. 🙏🏻❤ You are such an amazing human.", "sdotzler47": "If I could meet you I’d die.. you have been my biggest inspiration over the last two or three years. So much so that I am having my boyfriend do a photoshoot of me next week. I have never done it but I knew it was time. Seriously love you and I don’t even know you ❤️❤️❤️❤️", "no1saw_": "I’m starting to do this myself. I’m starting to get over the omg i look so —- in this! To fuck it this is me.", "bekahleah7": "Beautiful and perfect❤️❤️❤️", "shanniwanny": "🙌🏻🙌🏻❤️", "djkoldkutz": "This really resonates with me. We have similar bodies and I love seeing how beautiful you are, because it helps me to see myself that way too. Before I even read this caption, I saw and loved the photo and I thought to myself \"that's kinda what I look like from the side, huh? So cute!\" And then I saw your caption! Just, THANK YOU. You're great. You make it easier for me to love myself. ❤❤❤❤", "angelicariverao": "yes love this 🙌🏼", "seisenbart": "I understand your frustration so so so well. Im working on it too. Thank you for every day, every post, every time you are you.", "dtregs": "Amazingly inspiring", "motherofcats95": "Raise your hand if you thought it was just you who felt this way and were totally ashamed of it ✋🏻", "cialitra_": "can this be a movement?!", "tiffanyylange": "So inspiring!", "becagrhm": "😍😍👏👏👏👏", "misscarolynjoy": "Thank you thank you thank you!! 💓 When I saw this image I thought “ oh my gosh, she’s so cute/beautiful!” And then I looked up from where I was sitting on the edge of my bed and saw a very similar reflection in the mirror. I generally have a hard time seeing myself sitting down, but maybe if I keep seeing posts like these I’ll see myself as beautiful from all angles too!", "music_lover1030": "Your post is so helpful, thank you for sharing 😊❤️", "algernonheadley": "Say you bless pretty girl sweet !!!!!!!!!!", "monicamonie1230": "😍😘😍You really made me feel even better as a plus size 😚😚🤗🤗 Thank you for those beautiful words 🤗😁😍", "anderwilson": "This is one of my absolute favorite photos of you. I feel like there is so much in your body language and face. Looks like something we’d discuss for an hour in art history class. This should be framed somewhere. I. Am. In. Love.", "shelbydleal": "thank you for posting this. you are my future self. I am slowly accepting my self at all angles. seeing this post helps me know that we are not alone. #bodygoals #bodylove thank you!!", "summersausagewoman": "INSPO FOR LIFEEEEE", "skyefree": "Thank you so much for this post. I struggle with this a lot.", "looksbylucy": "💖💖💖💖💖💖", "ellosaddabet": "I lovet his post- thank you...", "yumaratz": "You are beautiful from any angle. Don't be afraid of yourself or what others may say.", "sapphiresplendour": "Hahahahahaha I love this so damn much", "xxtdomal_": "so cuuuuute", "almaglyph": "Bless this post. Bless you.", "nataliemeansnice\nVerified": "Verified", "comfyfattravels": "You are such a beautiful human and you’re teaching me so much❤️", "norcaligirl": "This is too fucking real. I avoid side views like the PLAGUE. This makes me realize I need to love myself from all angles because no matter what angle you see me from- I am wonderful me. Thank you! 😘", "samstoutreporting": "Fucking yes. I know this exact feeling. Just because you feel ‘smaller’ from the front def doesn’t negate your whole fucking being. Fat from every side. Yes fucking ma’am!!!", "tandraleann": "Thank you for being so real! You inspired me to buy my first pair of overalls & I LOVE THEM! I was so afraid of what I would look like from the side but I love them and love how they make me look! 🙌🙌😍 thank you!", "gypsyclipper": "I'm 51 years old and my brain is so full of hurtful comments and negative thoughts. You are saving so many people years of shame and self loathing. You and your family should be so proud of the huge changes you have brought to people all over the world. GREAT JOB🤗👍💪✌️👏", "asanzie": "💛💛💛💛💛💛 thanks to posts like this, I’m appreciating my body so much more.", "tittysweat": "YES", "queerbigfoot": "Thank you Corissa! Without you and other fat positive babes I would be in a dark place with my body image - you are seriously one of my heroes and you are amazing from all angles!! Always! 🙌🙌", "turtletoast_": "we are the same size similar body shape and it really makes it easier to love myself by admiring and seeing how hot you are and thinking hey maybe I'm hot too? 😂 I'm trying to post more photos of me that I would normally hide or delete and it's tough and scary but it's helping thank you so much for being you 💖💖💖", "soy_evahernandez": "Ay chica a mi me pasa , temo tomarme fotos por que soy muy grande , pero estoy dejando mis complejos , un abeazo grande", "therelatablefatgirl": "I love this and can totally relate. Thanks for sharing this - btw you look like a total babe. 💜💜💜", "ivydanielle75": "You are beautiful!", "jenny_blue_eyez": "Thank you!!! 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "jessica_kane": "Yes I love this!!!! I agree, at first was jarring, but now I’m like hell yeah sis! 💣", "boundless._beauty": "This is still my biggest struggle with self-image. I like to think of myself as confident and comfortable in my body, but even just last weekend I walked past a window and caught my side-reflection and cringed a little. I tried really hard in that moment to correct my thinking and looked directly at my profile when I walked past the next shop window, but it was hard. Body positivity is a journey, and I may not be at the final destination yet, but I’m working on it!", "captaingoodsoup": "You know what’s funny, I have the same problem with “side phobia” but when I saw this pic, the first thing I thought was I love her sense of classic style and how does she always get her hair so perfect.", "kassann": "Inspired. I loathe my reflection. But I don't want to be harnessed in that head space any longer. So I'm challenging it. You are amazing and beautiful and maybe if I can see that in you I could see that in me.", "aubrilamlifestyle": "@rebaadailey @rallison.90 idk which account you use now but read this post 😭😭😭", "tinkvan": "You are so beautiful girl 🔥🌻", "girlletgo": "✨✨“My tremendous multitudes” ✨✨ . multitudes of light and positivity and warmth - what about those multitudes? Or your multitude of inclusion and encouragement, affirmations and love? Or maybe it’s your multitude of hugs and belly laughs and quick wit? You’ve definitely got them tremendous multitudes, sister, some of them matter more to me than others 😉❤️ #bestsisterever", "high_five": "This is such a good approach to accepting and normalizing your own body to yourself!", "lesleyrau": "Thank you @fatgirlflow for keeping it real. Every time I read your posts I’m closer to that place that you’re in right now. ❤️", "kevinporter79761": "You look beautiful.", "jamesahawkins": "Well I can tell you that you are beautiful", "gigi_beautycurves": "I'm so proud of you its very hard but you are a beatiful woman", "funny.fat.fabulous": "I love this so much! Thank you for being genuine and vulnerable. It's so incredibly meaningful to me and to others who are struggling. ❤️", "katstroudofficial": "I’m loving this shot of you and so Much Yes!!!! ❤️❤️❤️ No Bad Angles!!!", "rob_ballantine": "Love love love love love LOVE 😍😍😍😍 @caitlinjill", "mashamashavee": "Gurl. This post is so REAL! I felt/feel ever word... thank you for this post #embraceyourreality #lovetheskinyourein #lesbianfattiesunited", "megsal04": "Bless you. I need to get better at this.", "kalyndab": "I love all of this! I have the same aversion to those angles of me. Moving towards acceptance is always the goal!!", "mandy0678": "I think you're beautiful from every angle!❤️ Keep being you, and pass some of that self confidence this way!!❤️", "iyohabestman07": "With this kind of pretty size i will die for you... I so much love your size😘😘💋❤", "sundaydrivexo": "You're an inspiration to me always. I look in the mirror and see trash, but never look at anyone else that way. Maybe I'll challenge myself to new angles too!", "dallasdyal": "this makes my heart full", "kristinmeow13": "It's funny because I did the same... and then I realized literally 98% of the population saw me from my bad side. So fuck it. They see it, I might as well see it also.", "sumajanedark\nVerified": "Verified"}