{"cigarmike3": "Sexy and fine...voluptuous goddess!", "adiposenarnian": "I mean, its mostly just a little cosmetic smoothing and lightening: less than a lot of women do with makeup. I mean, i wish they hadn't shrunk your pretty hips, but eh. The main thing is that the smoothing and lightening pretty much eradicated your dimples, and THAT is a crime.", "dwayneanthonyrose57": "Hi baby lllove", "joserra1209": "😘😘😘", "farshid6547": "Heavenly 🌹 🌹", "kimberlyfuentess": "@enny_suzel", "ktwothetee": "Looks like the only editing was lighting etc. this is all due to the photographer, light, flash, etc and has nothing to do with how you actually look. You weren't airbrushed thinner, taller, etc. Photographers always edit photos for lighting and such, even when taking scenic shots. No shame here. You are stunning", "tonylewis1984": "Lovely", "sas_1359": "20", "_babak_27.good": "Vooooo", "victoronon": "Hi 👋 baby you look 👀 very sexy", "mirandashattered": "Are your nipples showing? Lol", "joneblaze2012": "LOVELY", "moslem.hy": "Beautiful", "darkdayzareova": "People are definitely reaching over this, how utterly ridiculous 🙄", "wilkesdb": "Very stunning", "jhull41": "Wow!", "mystikfae21": "Honestly i just thought it was lighten and maybe a lil smoothing on your thighs a bit but still looks like you! If it was heavily done then ur legs arms and belly and breast would have been way over done. I see many plus size women in ads and such and a lot dont even look plus size to me at all! Then i think, Damn i must be a disgusting kind of plus size because I dont relate to the plus size gals I see. So most of the time Im thinking the ladies still look slim. And who knows maybe its photo ahopped.", "jciarlo68": "cellulite makes you PERFECT .", "boqassim55": "💟💗💖😍😚💟💗💖😍😚", "schapman1969": "All i can say is eye candy", "gorockabout": "Honestly the original is much sexier. Can't fix something that is already perfect. You're a pretty woman. No need in messing it up.", "djamelmess": "Sexy and pretty lingerie", "ashley.seider1743": "Just looks like they evened out your complexion and brightened the pic a bit", "gracefullysavage": "I would have gone with the photoshopped image as well. It's lighter and brings more focus to your amazing expression and the lingerie.", "niesses": "The body doesn't look changed to me. The photoshopped picture just has better lighting", "kittii_cattt": "You're so pretty", "sapphrican": "I think the Photoshop definitely enhanced the picture because the focal point is the lingerie, and the added light certainly only draws more attention to the lingerie, but your stomach looks slightly smaller in the picture to the left. I don't think that making peoples bodies looks smaller should be a goal when it comes to Photoshop, but the lighting change definitely helps and is aesthetically pleasing.", "elgordocholo": "nice body", "ashleigh_dunn_": "Both are beautiful! The slightly photoshopped one has a more pleasing light, I have have done the same 😘", "bam.peesly": "Touch ups are fine if they're like this. It's just lightening to make the picture look less dark and drab. They're not changing your body or anything.", "sosam1012": "@blahblahblahsucka_man you should keep your comments to yourself. If you don't like it, don't look.", "cosmixhoney": "Its not like its crazy photoshopped. Editing is part of photographing. Almost EVERY photographer will edit their photos a bit, some more than others. It just looks like they smoothed your skin a bit, fixed the lighting and some other minor things. I was in college for photography and find ot ridiculous people make such a big deal over it. Photography = editing. We were taught photoshop from day one.", "trinakinna": "I think it's all about getting the best quality image for the add, your body looks the same, the photo was just lightened and adjusted to show your features and the product more accurately, lighting can be difficult to work with and I think they turned out beautifully", "myjourneyfrom84": "You can tell that the photo was touched up... they slimmed the arms behind the elbow and pulled in on your tummy on the sides and bottom to make it smaller as well as brightened the pic and smoothed out the small imperfections in your skin tone... you are beautiful in both... personally I don't feel it NEEDED to be touched up but whatever floats your boat... both are beautiful...", "whitegrlinacrowd": "Photoshopping aka blurring out your cellulite is harmful for girls because they think even if they're your size or bigger that they should NOT have cellulite. The whole body positivity rant you went on is now null. You don't think someone misrepresenting your body is wrong. If you're a beacon of body positivity truth then you should maintain some standards to support that. The original is perfect for exemplifying a real, true body. The edited version is not.", "sunni.hva": "I'm sorry I just can't deal with this anymore", "instajamilyn": "@kittycanuck Exactly.", "juandorantesr_619": "Hermosa", "maria.l.ortiz3": "I can't even see too much difference...and if you want to do some retouching, than go ahead and don't worry about what others have to say. I think you're already brave and confident in enough to post a pic with lingerie on, I wish I could be that confident...so, a little retouching won't hurt anyone 😉 @fatgirlflow", "jadielue": "That top is so cute!!", "msanabee": "Curious how many people opposed to ps take photos with flattering angles, wear makeup, etc...I don't see a difference", "mellyelly_": "Seriously, don't most ig users use filters...?", "chelcielynnn\nVerified": "Verified", "jeremyzeger": "Wow! I think I'm in love", "bellymoss": "i mean honestly youre fricking perfect either way", "lyricalblueswing": "I understand the lighting changes and cropping. But reducing your arm size and the appearance in your belly is unnecessary and just feels off putting when so vocally promoting body positivity. Especially the arm size because as an individual who struggles with accepting that portion of me it reinforces the idea that you can't be in sleeveless items without some shame. I don't see any other reason to reduce the size of your arms. Just my opinion on how it comes across when I see the two side by side.", "allycatastrophie": "They did a very tasteful job of making it an ad. It looks like nothing other than lighting was changed. Don't let angry people on the internet dictate your artistic expression through modeling. An photographer is going to do what he wants but what you have on your personal page can be the total truth. Ps how do you get involved in this? Check my page and see if I would survive!!! ❤😄", "mcgirliegirl": "No retouching, it's not real, and gives people like me unrealistic and unfair standards. You are beautiful without the retouching.", "pittsburghtrash": "It looks like he just changed the lighting", "merci_non_merci": "and not to be rude to the photo editor but the underwear part they photoshopped looked better before the editing anyway", "plaidsquatch": "so i had to reeeeaaallly look for a good few minutes- it is really subtle, but like folks have said, once you see the smoothing and color correcting and cropping and repositioning of body parts, it just makes you go \"what was so wrong with the original?\" looked plenty cute and boudoir to me- when you see the difference, you just end up asking yourself why- unless you're turning folks into fairytale or scifi creatures and drastically making a difference for artistic and whimsical expression, why mess with it? it's the subtlety which seems so sneaky- and it's not questioned much 'cause it's telling us how much \"better\" folks can look- and it all just comes back to why- and i didn't go through all the comments so i didn't see anybody saying you're trying to fool us so i don't get the \"haters gonna hate\" comments- i see a lot of good discussion otherwise- and i don't think anybody said so either but i think it's important to mention that the photographer isn't a monster or any less of an artist for photoshopping in this way- they're just doing their job, it's just unfortunate that photography as an industry has a long history of grossly misrepresenting humanity", "becky.bitz.bbw": "Screw what anyone thinks Hunnie you're beautiful no matter if your photo is edited or not honestly I can't really tell the difference the left is just more zoomed and cropped but both beautiful keep it up beautiful represent for us BBW models still in the shadows", "cronxdogandme": "What a hypocrite", "gabbieteama": "The photo is fine. The retouching was light and didn't change your body shape, which is what can mess with people the most", "miss_gottalottavit": "You look killer in both!! The way they Photoshoped the left photo gives me hope actually... They re touched it to fit the feeling of the professional add that you where being featured in.. in no way did they edit your beauty!!! Get it girl!!!! 😍😍😍", "11_usagi": "There are subtle differences that do matter I think... Although first off - both photos are beautiful and you are beautiful. At first I just noticed that the photo on the left was lighter which I feel is fine to simply lighten a picture. But it looks like your belly is smaller, on the left of the photo it bulges over your bottoms more on the right and you have some cute ripples on your left thigh on the right but on the left the ripples are gone. It's small and subtle but it's still taking away from the body positivity movement, the fat acceptance movement and just you because you are perfect as you are without any edits! How can we push these ideas of beauty at all sizes and that all bodies are beautiful when you took away 2 of the things that come with being fat... This was just my opinion ^___^ I still love you though~", "dennistolliver": "@trinylein", "danielleaj13": "I don't think any of us have any room to judge if we use the filters on here or Snapchat!", "_katrinagleeson": "Tbh all that I can tell is that the lighting seems different.", "neelamjani143": "👌👌👌👌👌", "aplpi": "It's just the lighting that's changed. :p you look great in both", "mistress.nina": "Cute", "smershton": "I don't find the editing overly done, it's a cute cropped photo with a bit of color correcting due to light and maybe a tiny bit of smoothing.... Whatever, haters gonna hate. If you were doing a crazy amount then I think it's an unattainable standard you'd be promoting, but I like this photo a lot and makes me feel better about myself because I see more variety in bodies on Instagram. You are lovely ❤️❤️❤️", "pinksquidink": "I have no problem with photoshopping that corrects colour, contrast, brightness etc. However, and especially for someone promoting body positivity, I do start to take offence when bits and parts of the actual person start to get removed and/or altered such as in this photo. The tummy area has noticeably been altered to droop less and wrinkles and cellulite have been removed from the leg. Changes via photoshopping, no matter how small, do NOT promote body positivity! Just my opinion.", "heathiedoodle": "The change I notice most is in your triceps area. I would prefer people promoting body positivity no reduce the size of their body and your arms are definitely smaller.", "leoniesopretty": "But why we gotta see titties tho....no different than the Kardashians 😩", "sssuperbecca": "I see color correction and a crop but your body doesn't look retouched. Your skin looks like skin and isn't all blurred out and they didn't change the shape of your arms or legs.", "eveboo408": "Where can i do some modeling like that? #Ifonly", "amoure_jones": "The only fixes I notice are with lighting and cropping nothing else. As an editorial I believe it's okay to add some touches of light , brightness or highlight if the picture is too dark.", "okpara.ojiugo": "Sweet woman with sweet body", "fatgirlflow\nVerified": "Verified", "leannebrunellecoach": "Just looks like the brightness was adjusted, other than that I don't see anything.", "lipgloss_bitch": "Damned if you do, damned if you don't.", "babyruth728": "It's basically a lighting correction and a bit of blur which could be achieved with body makeup anyway. It's not like they shaved your body size down or anything...", "the5thcellar": "I cant even tell the photo has been retouched - you look amazing!", "desireej1015": "There's quite a few touch ups I noticed. But nothing changing the photos integrity. Believe me if I knew how to touch up I'd be doing it lol. I love the skin I'm in don't mean I can smooth a tiny spot make the picture look better lol People need to get over it and stop finding things wrong in life. Seems this day in age there has to be someone mad about something. We are a disgusting society.", "jinjair": "I can hardly tell either. The photo on the left is lighter, less shadowing but other than that I can't see a difference. Beautiful photos!", "annathemostawesome": "I dont see any differences. You are gorgeous and dont have to defend yourself against ignorant humans. 😘", "pudgiegal": "I only see a light filter on this? I don't see any smoothing or slimming done? So no issue.", "fauxromantix": "And a crop. But honestly, all photography is about editing and what goes in and out of the frame. Cameras are not just truth devices. Cameras are an art supply, a tool of representation.", "carla.barrybetker": "Something many people also need to remember is that the model does just that....models. He/she have done their part. The editing and post production work is done by the hands that sell the product. People need to realise that it's not the models fault if something is portrayed differently than it actually is. Yet people are so quick to judge and point the 'photoshop' finger when much of the time it's out of the models hands. I'm very plus size and had a boudoir shoot. I love my images. It's my real size but my skin tone is smoothed and I look fucking fabulous! Lighting is key. That's why you will NEVER see me take a bathroom selfie. Worst lighting ever. So if a touched up image or good lighting is going to make me see that I am awesome, then so be it! And by the way....as a photographer myself, I do see the photoshop touches from one image to the other and who the fuck cares. It's part of the biz. You are fabulous! 📸", "__annajay": "The fact they slimmed your belly down makes me mad but doesn't hurt my psyche. It is weird to me that you rant and rave about being body pos and then your photos were photoshopped. I get they're a pro but all you have to do is tell the photographer no photoshop. I dunno. It bugs me but isn't damning.", "sarahrahski": "I do not think photoshopping is inherently bad as a tool for altering a photo as a whole (e.g., cropping, brightening). I don't even necessarily see it as inherently bad to use it for smoothing or slimming if that's what you want, but I do see an issue with it being used that way on someone who so enthusiastically supports and advocates for body positivity, especially without a disclaimer. I honestly don't think it's body positive to use photoshop to alter your body. It doesn't make me feel anything about myself, but I can tell you the unaltered version makes me happier seeing someone so real--so like me--looking so beautiful and badass: bumps, cellulite, stretch marks and all.", "artofchelsey": "I'm a graphic designer and do a lot of photoshop work... and this is very minimal in my opinion, it's hard to even tell... with that being said, I also don't see why any body modification was needed at all. Just playing with the lighting and brightness would have been suffient on improving this", "jwalidea": "I'm never a fan of touch ups that take away from natural features. Editing for things like brightness, contrast, color tone is one thing. But smoothing, using spot treatment, or effects to slim bulges... That's what creates unrealistic body image and inherent body shaming (and that's what was done here, in my opinion). I say this yes, as a guy, but also as a long time fan of yours, a long time supporter of body positivity, and a professional photographer myself.", "delicate.goth": "Personally i think if youre going to preach body positivity you shouldnt shop ur photos. But thats just me. We have to love ourselves, flabby hips and spotty tums and all. 💓", "nathinnice": "😍😍😍 oh my goodness you slay", "_theworldisonfire_": "The only differences I really notice are lighting, fixing exposure, etc and s tad bit of touching up in the under side of arms. This small stuff doesn't bother me, if they shaved off inches that would be a different deal.", "skyg74": "Looks the same to me", "keriann_h": "Honestly, I don't really see where anything was touched up. You don't look any different in the one on the left to me.", "caffinatedgoldengirl": "No! To me it honestly just looks like the turned the brightness up. They didn't alter your shape or make you a different person like most touching up does. Which is the art of photography, making the photo best not altering people. This is great to me", "megnmar": "You look great in both photos! Pretty much the photoshop gave it more depth and rearranged your underwear a bit, which honestly, why not make your gitch look a bit better?!", "makeupntantrums": "Anyone having a go at you is missing the point of who u are and what you do. Either pic is fab...because of the confidence you are embodying. No amount of photo shop can add or remove that!", "rubyreddead": "It's the little things that matter, like seeing your cellulite and the sag in your arms in the unretouched photo. It's important to me to see real unretouched photos to remind me what real bodies are supposed to look like because we see enough totally unrecognizable shapes on retailers websites and in the media all day", "sarajeanettegeorge": "I don't think there's anything wrong with photoshop as long as it isn't being done in a way that shames the person. If it is done in a way to make a person look thinner or their skin color different then I think that that is a type of body shaming. There's nothing wrong with a photographer lightening a picture or making minor changes.", "blkrd_tab2": "I see one lighter than the other. That's it. No biggie to me.", "2queen_b": "Don't think it's a big issue. I honestly didn't notice. Also your fans who follow you closely know that almost all of your photos are not retouched, and knew that this was a special circumstance (because we read yours and the photographer's blog posts.) It's part of the photo the artist created.", "miaraven70": "Can't really tell you're beautiful either way rock on!", "laurenwags1019": "No issue. You're beautiful. The Photoshop isn't making you into someone you're not, I think we all deserve to present ourselves in the best way we can. Which the majority of us do either consciously or subconsciously with lighting, angles, filters, etc. And no matter what, haters are gonna hate, so might as well make yourself happy. Rock on 🤘🏻❤️", "arkenjay": "One looks a little lighter then the other but that is it. Nice phots", "bttf_80": "I think there is absolutely nothing wrong with presenting yourself the way you want to. Why do people have to judge EVERYTHING!!?", "annamintymae": "I don't care what you do with your photos as long as I get to see your gorgeousness in my feed. You and your amazing personality brighten my day. Love you girl.", "gloomeh": "O.o all I see is a lighting difference , but I love this photo !", "giuliopanzera": "@nehehehele99", "indigostarchild01": "I honestly can hardly tell the difference but that's because it's not it's over photoshoped and believe me I've seen over photoshoped (some) of Tess's stuff is way too over Photoshoped, I love seeing the natural body because as a teen I did not have plus size role models that I saw in catalogs or on the Internet that were not touched up or over touched with Photoshop I think if a young girl was to see you as a role model it would be better for her to see you in your natural form then to be photoshoped because she is still going to question whether or not she's beautiful by those standards because she is not as smooth even if she may be the same size as you so there will still be some self-doubt and self-hate being created in one form or another.", "melyssarn": "They're both beautiful, and so are you", "ksala1023": "I didnt realize the original posting was photos hopped but side by side you can see the very obvious differences. To be fair, the original photo did need lighting retouched but don't see the point in shaving areas down, smoothing skin wrinkles, shrinking widths of areas, especially since you are a plus sized woman selling plus sized clothing", "mer_yannuzzi": "I'm curious what the retouched. Doesn't look like very much", "nikishagr": "I noticed something was off with how your belly looked in the altered photo after seeing the video of you dancing in the blue shorts and camo shirt. The altered photo gives the illusion of having a flatter stomach. I never noticed the arms, but now I see how awkward they look in the altered photo. I guess the issue that some may have is the why Photoshop when you are someone who is for body positivity (and someone who in the past has shown how much they love their belly)", "flower_potts99": "I think making changes for a clothing ad is necessary. You're selling clothes, not your dimples. As long as you still post untouched stuff regularly, I can't fault you. I've been following you long before you started this blog and I would be so disappointed to see you give up your message. Some of the most joy-inducing pictures you have shared are when all of your so-called imperfections are bared. I want you to keep pushing the envelope on what we call body positive, walk your talk, and don't ever give up on inspiring us all!", "prettybbw.alisha": "Personally I don't think nothing is wrong with a little touching up. Both pictures are still you and it's not a big deal to me. Keep doing you and being your confident self. I'm a new subscriber and I love your videos.", "nikonanette": "It's hardly noticeable.", "crushtina": "@luellaarbre I agree with you 10000%", "oddities_and_entities": "They definitely did more than was necessary - I would have simply brightened you up - but I had to stare hard to really tell what else they had altered. You are beautiful as you are!", "jensen.kim96": "I like them both. I like you and what you stand for. You are an amazing woman!", "miamaclaine": "I didn't even notice the small changes until they were pointed out in the comments (like the arm difference). I think both photos are lovely & I guess I just think the small changes are unnecessary if anything. Lighting correction/enhancement is always fine by me - even though that can make a big difference. Maybe I would be bothered if I thought you were someone that consistently represented themselves in a very altered way but I really REALLY do not see that in your content. It's something to think about for sure.", "_ellenisdead": "Photoshop used to alter body shape is dangerous because its presenting a person not as they are in reality and is therefore saying that their body, no matter what it looked like originally, wasn't good enough and needs to be \"fixed.\" Photoshop used as a shortcut to alter makeup or lighting (as it seems to be used here) is okay because it just uses tech to do something quickly what would otherwise take hours.", "long_gone_to_another_day": "I really see no difference other than light. Light matters in a photo. Both are lovely.", "mamajack_": "The fact that you posted this side by side 🙌. I think people are a little salty about your rant.", "embellished_dame": "You know what!!! Ppls always have something to say! It takes courage to do what you do! The fact that you are a plussize women and on Instagram standing proud with your head held high in your underwear is Body Positive enough for me! Don't let anyone take that a way from you. You are gorgeous in both pictures and to be honest I must be blind because other than a slight lighting adjustment I still don't see the difference between the two pictures! 👑💯", "sara.joann": "I agree with many of the people above, this looks much more like light correction and brightening up your skin then an attempt to make you look unrealistic or not like yourself. I think you represent yourself so forward, you're so honest with who you are and how you look and you're proud of it. Shit, I use filters on my photos! It makes me feel more comfortable about skin blemishes or lighting issues and honestly, I think the problem would rise if you were using photoshop to change your body shape in an attempt to be a \"presentable\" fatty like our society praises and you DONT do that. I barely see a difference. And your willingness to be open and put both pictures by one another and have an open discussion with those who look up to you is SO important. It really shows that you care and that you are trying to present yourself as honestly as possible.", "cherubmermaid": "To me it just looks like the lighting was fixed a bit , it didn't change your body really .", "goshcallie": "Umm... These are both gorgeous and you look like yourself. I'm sorry, are we calling photo editing (as in adjusting the brightness and warmth) photoshop now? Bc I feel like that's very different. I wouldn't worry about it, you babe.", "sweaterfuzzy": "You look beautiful in both pictures. The retouched one looks brighter to me which doesn't seem like a big deal to me! 💕", "bandstattoosartandmorebands": "Honestly the only real difference I see is that they lightened up the picture so it shows you in a clearer light. The original is a bit dark but in the other I can see your face better. Both look great though.", "kandikalistar": "You don't have to answer to anyone. Your life, your way. 💕", "prettywheniread": "To me, it looks like mostly what they did was help smooth out the redness in your skin, which happens to everyone, and which I, personally, would want to have photoshopped on myself, too. They left you quite naturally beautiful and did so little to who you really are. Your confidence makes your photos, photoshop or no. You're beautiful always. 😍💋💕", "karenbbon": "Wow. I had no idea that one was photoshopped and one wasn't until I read the description. I don't think the difference is significant enough to bother me. Some retouching never hurts a professional photograph.", "anitstagram": "There's a difference between Photoshopping to change features of your body and Photoshopping to enhance certain aspects of a picture like the colors, which I'm assuming is what was done to your pictures. If it's the latter, I think it's perfectly fine. And if people smooth their skin a little or put a filter on their photo because it makes them feel confident, to me that's no different than someone putting on makeup.", "luellaarbre": "Colour/light correction aren't equal to morphing the body to look drastically different (more \"appealing\"). Photoshop has become an umbrella term with everything falling under it equaling..bad! And it's just not really like that.", "itsalimazing": "I wonder why these plus size beautiful women never have cottage cheese and stretch marks... Is it photoshopped ???", "kittycanuck": "My approach is that it's OK to improve lighting, smooth out colour, remove the odd unsightly blemish (like if I have a big pimple or razor bumps) or stuff like that, but making me look thinner is a no-no. They didn't go to crazy here, but they did make your arms smaller and made your belly look smaller, which to me is unnecessary. You looked perfect in the original and photoshopping you in that manner sends the message that there was something wrong with you. Its common practice, but I think more of us should stand up against it.", "glynnaelaine": "It just looks brighter? No different that touching up an Instagram selfie.", "queen_muva20": "I'm so jealous of you having no stretch marks. I didn't get so lucky 😞", "senoritaruth": "Looks great! I think there's a lot of room for improvement before one even tiptoes into false representations. You look super pretty, and fixing the lighting only improves that. Great job, nice post ❤️", "ktxy_": "😍😍😍", "bgorissa": "It only really looks like brightened up. I don't see so much of a difference", "keilakandid": "Yessss hunny!", "dafuq747": "I think you look beautiful in both! And the only difference i see is the photoshopped one looks like the brightness was amped up so you could see the photo better. Honestly I didn't know you had been photoshopped in the first place and it doesn't matter too much to me because not much was changed and you still look very much like your original and beautiful self", "shesaworkinprogress": "I can barely tell a difference! I think whatever someone wants to do, they should do just that.", "rebekah.elizabethh": "I'm against Photoshop when its to a large extent, but this just looks brightened up (which I don't consider Photoshop) and maybe smoothed out a little. There's absolutely nothing wrong with it in my opinion(: and you look gorgeous btw", "smartglamour": "It definitely doesn't look unrealistic but the more I compare the two the more I notice the changes. They made your arms smaller, raised the rise of the bottoms you're wearing, and smoothed out the skin on your legs and belly. I use photoshop only for light correction on SG photos and draw the line at airbrushing anything. I think it'd be more helpful to viewers to see skin \"imperfections\" etc because smoothed out even skin is just rarely the reality. But I wouldn't say it's portraying an totally unrealistic standard of beauty.", "nicolecmaple": "I can see a few places where some stuff was smoothed, but not drastically by any means. I don't think it changes the message, and I trust that your goal is to be as real about this kinda stuff with us as possible, so to me it's not a huge deal. I do love seeing UNphotoshopped stuff more because it feels good to see fat bodies represented in a real life way if that makes sense? Either way you're amazing 💖", "rhonda_fay_323": "My husband is a professional photographer and uses photoshop to fix things like acne or uneven skin tones or maybe bad lighting that could not be fixed in camera. Sometimes just fixing the lighting makes things appear altered if you will when really the subject is the same. There's a difference in altering size/shape and enhancing what is already there."}