{"venisponce": "Gorgeous!!", "malinulvnes": "Thank you for posting what nobody else dares to post. Just found ur page and daaaamn girl! Such a beauty!🙌🏻🙌🏻💃🏻", "madre127": "I love that swimsuit!!! I admire your words... So encouraging 💞😁💕", "bksmomma22": "You're such an inspiration. I wish I had your courage", "kissingkaida": "I wanted to get a tattoo like that, under my breasts - I was told I didn't have the right body type, aka too fat... But you seriously just put all doubts out of my mind because you and that tattoo are absolutely freaking adorable!", "arabaladeseree": "2. You don't have the right to do. Be big, feel however you want to feel about yourself but leave diet 'culture' (people who want to lose weight) alone. If you don't like it, don't look.", "theresameire": "I wish I was right next to you in a gold bikini!", "roseybeeme\nVerified": "Verified", "kokunkaldi.gelll": "Are you waiting for high tide!", "mrstrotter1972": "Damn! This pic is giving me life! Your rack looks fantastic!!!❤️❤️", "melissamaedmb": "Beautiful! Rock it girl.", "a.33.k": "Beautiful", "perenellesaboariaealquimia": "Hi I'm a Brazilian woman and I'm looking for someone to inspire me to dress in. You are wonderful! I loved your style and your Tattoos! Thank you!🌼🌼🌼", "garota_plus": "@garota_plus", "jemrosew": "@sinj95", "mariah_rios10": "Love this", "haley_hunt99": "I love this picture and your bathing suit is so cute. If you see this, will you tell me where you got it?", "artofdianna": "Need this suit asap", "lucyinthe.skyy": "I need this swim suit where can I get it", "meagannicole.volumetwo": "@tactical_charger", "prolifesciencebabe": "Yeah girl! You don’t owe anyone anything, but you still look super cute in that suit! 💙", "schreckwalter": "Lot of a fat Piggy 🐷 ‼️❤️", "msh3rsh_th3qu33n": "I love this as❤️❤️👑", "teenabugg": "Omg that bikini!#!", "gautaminator": "Loved that tattoo", "miss.ranty.saurus.rex": "Damn Right! #preachitsista #fatgirllove #bodypositivity 👏🏻💖", "badgernui": "Gorgeous and I love your bikini! We’re off to Rarotonga in Oct. currently swim suit shopping 😁⭐️", "gasponce": "❤🙌👏 #yes! To #everything this #pic and this #caption! And #thankyouforsharing❤❤❤ 😍", "alvarez_coya77": "HERMOSA", "karmat82": "That looks like a beautiful, pristine beach. Where is it located, please? I’ve always wanted to go into crystal clear water. Or is it the country club pool?", "nony_bonony": "Yes!!! You are amazing. I love the bikini! ❤", "khavanicole": "Mama I love your page!!! Yes!", "melslate38": "Great picture! I think you are BEAUTIFUL!!!! I would love to hang out with you and J!!!", "nj_nurse0305": "Beautiful!!!", "mamahavok3": "Cute! 💕", "hector_luvs_coffeeeee_": "🌻", "jlopezcuellar": "I gotta keep that iN mind!", "khaleeqbacha": "Good styl", "soraia1346": "Fantástica!!!!", "sipoo70": "What beach?", "musickjunkie": "I love everything about this.", "mzree92": "Omg your soooooo beautiful!!!! Love your confidence.... also that tattoo is amazing... 😍😍😍😍", "delleb25": "OMG I love this❤️ and that tattoo has me ready to get one there to cover up my 19 year old mistake lol Love!!", "rn4doc": "@fatgirlflow ❤️❤️❤️😍", "myheart_mysoul": "@jadiefrankenstein The first paragraph is everything 🙌🏽🙌🏽🙌🏽", "applesnazz": "I finally had the balls to vaca by myself but was so insecure I never went to the pool in my brand new kini 👙😏😞", "angelic._brat": "Your suite is so cute 😍", "emwednesday": "You look amazing! You give me courage to sport fatkini this summer! Love the tattoo tooo!", "_karolinaa.c": "Omg this is so cute!!", "sun_culott": "Thank you. I really needed this right now ❤", "selfieforselflove": "WOW 💛💫", "_lizzyfoshizzy_": "I love this pic omgggg ❤️ you got me wanting a tattoo as well :)", "shelbylaine7": "Hi you look perfect and you've got modeling down and I adore you okay bye ❤️", "kailurrrrr": "I love you, and I love this. ❤", "pamellauker": "I Love how perfect this is! You look stunning!", "ms_foss": "@livvythinksthat", "johnyiannis": "Great post", "letsdance87": "Beautiful and I will keep saying it ..go girl x", "iamelliephant": "This picture is PERFECTION! I love everything about this! And your tattoo is AMAZING.", "jennifersmagicaljourney": "Thank you. We are on vacation at the beach right now and getting on a ship tomorrow. this is just what I needed to read. I felt like I didn’t deserve to be here wearing a bathing suit.", "aughralita": "I get to exist and people should respect that! What a great mantra!!!💟💟💟", "d_._i_._r_._g": "But you are attractive. Very. My problem, besides being overweight, is my severe anxiety, and a lifetime of self esteem issues, have caused me to constantly pick at my cuts, to the point where every single cut is bleeding. It's as if I'm purposely wounding myself over and over again. It's so bad, that with all my visible scars from picking, and all my current cuts, I am so ashamed to go out unless I'm fully covered. And now with summer coming, I can't where shorts, or a bathing suit. I end up covering arms and legs, and am so hot, I start sweating, but won't ever take my layers off. It's so depressing, which in turn, starts the vicious circle all over again. I just want to be comfortable in my own skin, but don't think it will ever happen. Thanks for listening. ..", "tam_buk_2": "Where are your sunglasses from?", "darefashionusa": "Yes! We all should be allowed to exist, just as we are. ❤️", "pixies_in_pixels": "That tattoo! 😍", "fragglequeen_": "The last time in went swimming was about 20 years ago😔", "witchwithnofear": "And yet you are lovely still. 😊", "jlukaszczyk82": "Hey beautiful!!I love that bathsuit may I ask where did u get it?😍", "wise_crone": "You are so cute", "bigcleanbeautyqueen": "Amazing reminder!! So often we move out of the way of others first while walking, or apologize when we bump or brush against someone. That is the space my body is taking. My space!! And I am entitled to it. No more apologies. 😊😊 💚💛💜", "tiff.porter": "I love it! Don't owe anyone your story. They can ask if they want to know!", "cathys6319": "Thank you!!!", "origamicustoms": "I love this !!", "stoutek": "@laurrossy daily reminder that you don’t have to look “presentable” for anyone! 😉", "norney_girl": "Absolutely needed to hear this today. Cheers darlin 🥂", "angiedavis1600": "Your gorgeous and I love you ! Keep on doing like you do ! ❤️", "hmongvillagegarden": "You’re adorable!", "fwarg": "you’re so happy you glow, it is absurd", "keiraleilani": "Thank you! ❤❤❤❤❤❤", "high_five": "Ahhh love this photo so much!", "frenchfriesandfairytales": "#goals", "motherduckinggingers": "😍", "annyeongaimee": "I really needed this right now. Literally just got home from the store and on my way there some people in a car drove past shouting and laughing at me", "pipin132": "❤️❤️❤️", "layed_2_dagawdz": "Mood", "lacunagrrl": "This pic is amazing!!! Beautiful!!!!", "allendkranawetter": "Beautiful and sexy", "missdanielove": "I LOVE THIS ❤️", "softbodytendermind": "Yessss", "algernonheadley": "Say yeah !!!", "savingwss": "@liyahhhlove I am currently obsessed with her.", "veridian82681": "You look great!!", "asanzie": "PINUP sexy ♥️♥️♥️", "cleanestpineapple": "I needed this today. 🖤", "lexiloveleo": "Yes ❤️", "misslindseyxox": "Yeeeesss B! I love this and love you in all that sunkissed glory 😍😍", "rnmforever": "❤️❤️❤️❤️❤️", "tararaekuyper": "\"You dont owe anyone attractiveness\" GACK!", "biafurtados": "@alexandrismos vc segue ela?? Eu a acho incrível e se vc não a conhece, eu te apresento! 😍😍", "haleighrmaee": "Love it beautiful", "thedanishlifenow": "Wow - I wish I could set my mind to that 🙄💕", "thatgirl_withbighair": "Going to the pool today for the first time in years. I have a two piece and I'm ready to rock!!", "stephaniebrookbank": "Omg so gorgeous!!!! Love that bikini!!", "hayyyat555": "Wow outstanding", "ms._lynettew": "Beautiful", "kimiecakez": "I love you in this suit. You are so adorable!!!", "heathermaemusic": "Love this shot!!", "mduff_94": "😍🙌🏻☺️💕", "lorribell1964": "Great reminder!!", "drakes.turtleneck.sweater": "You look adorable!!! Love it!", "beapuns_": "I audibly gasped I love this photo 😍", "jayykitten": "GIRLLLL NEW FAVORITE PHOTO OF YOU 😍😍 Super cute", "nerdygamerfitnessboi": "Well said! We exist and should not ashamed🙌🙌🙌", "caitlinjill": "@rob_ballantine", "liivkaap": "Oh man the positive vibes that stem from you are crazy. Love it. 💕", "riseandshinemissy": "Where is this?", "buckalution": "Amen! I finally embraced the bikini this year and it is amaaaazing. Wtf had I been waiting for all this time?!?!?!", "fat_girl_reviews": "Love your ink and everything about this picture! ❤️", "ricola2333": "Yaaaaassssss 💞✨🙌", "girlletgo": "I love you, and this gingham suit 😍😍😍", "shatter_day": "#wayswimsuitjelly", "fdonneys": "😍😍😍😍", "yumaratz": "Awesome words, but also remember, you are stunningly beautiful.", "diaryofaperfectionistwannabe": "Absolutely beautiful!", "christine_delk": "❤️❤️❤️", "parttimesadgirl": "Girlllll this is such an incredible photo! You look amazing 😍😍", "jan_can_keto": "This pic just embodies summer. I love it x", "miriamlurry": "I need to find a good bathing suit... it's a struggle every year 😫😫😫😫", "thecurvytrini": "You are just fabulous 😍", "stylesocialshop": "Stunning! Looking amazing girl! Obsessed with this suit😍", "jbeoin": "YES!!! 😀", "stitchmixer": "It’s my horrible cellulite that keeps me house locked. Fat is even cute in my opinion when one has smooth roundness. My cellulite is simply so very ugly all over that I refuse to show myself to people. I haven’t had a swimsuit on for years. :(", "comfyfattravels": "ur so hot in all ur fat glory!!!", "susannscheurer": "You look gorgeous in that swimsuit❤", "y.e.w_empowermentspeaker": "Dat tatt doe..🔥🔥🔥 love it", "jkmumu": "@butterflywings16 I recently lost 75 pounds (personal choice, not pushing an agenda), and when I tell people what complete strangers have said to me in the past, they cannot believe it. Moo'ing at me, yelling from cars, asking me if I'm \"hungry.\" I'm still not a thin person, but I guess I lost just enough weight to be off the radar with these types of people (not why I did it, though). I even have some trust issues because the same people who are perfectly civil to me now could be the same monsters who told me I \"looked hungry\" two years ago. It's fucking unbelievable how people think someone else's body is their business to comment on. We're all gorgeous. Our bodies get us out of bed in the morning and move us throughout this world to live and love. I'm sorry that happened today. Those assholes have to exist in their own shitty minds every day with their own crippling insecurity. I'd take some body fluff ANY day over being trapped in their minds.", "amethystxocean": "This pic makes me so happy it filled me with sunshine and joy ✨😍", "kyla.rose": "I just ordered a bikini, it will be my first time wearing one in a very long time, I feel nervous but kind of excited! 💕☀️", "kiwii_bird_": "Yes, glorious.", "quartermoonco": "Hell yes!!! Ps wherever this photo is looks amazing, the water is so clear 😭 and you’re radiant!", "stoneanvil": "Yeah!! Beach babe! You look amazing and they should be so lucky to gaze upon you!", "gcarolapa": "😍😍😍😍😍😍", "chubbystruggles": "This is AMAZING oh my god 😍", "hayleyhermsofficial\nVerified": "Verified", "lady_ean": "It kills me anyone would not see the beauty and joy of this radiant human!", "ohiopeach82": "YAAAAAASSSSSS 😍", "mynameisafruit1980": "I need this. Thanks for inspiration!", "tonidmtlilley": "Love this 👏🏻💕", "gritsnyc": "WHERE DID YOU GET THAT SUIT????", "xoxoxoxoireland": "Beautiful!! What beach is this?? The whole pic is dreamy", "swflower": "I love your bathing suit- where’d you find it??!!", "do_not_follow_me81": "Gorg😍", "carinavd": "Tão linda! ❤️😍", "olivia.louise94": "I love this so much. I’m glad I followed your page 💖", "pengo65": "Loving this!!! Just gorgeous! 😍😍😍", "mrshaselgrove": "I needed this right now. After being called a list of negative words directed at my size by a complete stranger today xx", "amazinamy": "Love this!! Slay girl!! 🙌🏻❤️", "heartmeetsleeve": "Yes! Needed this reminder as I head to the beach today 👏🏻", "shellymc": "You are SO DAMN HOT", "rmchurchill": "♥️♥️♥️♥️🎨", "photo_troy": "Yes please!!! 😍"}