{"dieselsanddeadlifts": "This is what perfection looks like", "ataviatatiana": "Corissa, you class my life! You inspired me to start blogging. Check out my blog, link in my bio! I would love the support :-)", "brautality": "You are so cute 😍!", "jamie_jetaime": "Love teeny tini ‘kinis!!!", "madame_feuerfuchs": "Such a cute bikini! You are looking awesome!", "ruth_haricharan": "This is such a cute bikini. And such a strong message. I find this so hard. Caught myself choosing not to wear a crop top because it would show my belly. And so I decided to wear it anyway 👙🧚🏻‍♀️", "surajthe6644": "Awesome", "nellie1rene": "Beautiful kini beautiful girl 💞", "mzdalloway": "❤", "d_ay_d_ream_ing": "@rheaicci1421 i need her confidence", "shamaun.sumon": "Sexy 👙", "megfence": "I wish I had as much confidence as you do ☹️", "jacksonandwells": "We have 26.. Check out our plus size swimwear!", "claudiaelisagh": "😯😯😯", "quieromemucho": "You look beaufifull with that bathing suit", "truyouwithconnye": "I want your confidence! I have never been confident in myself to wear a bikini. I go between a size 6-10. Flabby in tummy area and I have always been amazed and envious of people of all sizes that can rock a bikini!! You go girl ❤", "snark_a_saurus": "I actually just bought this suit because of you. Thank you for helping me to find more confidence in myself 🖒❤👙", "bobby_da_funk": "adorable", "scottjnova": "Sexy picture and I love your caption 😍😍❤️💋", "brittneloveshair": "How do you build up the confidence to do this while people constantly give looks? I’d like to have it!", "theluellabcompany": "\"Beauty is Confidence\" OMG I LOVE this!!!", "andie__june": "This bikini looks so great on you that I just bought the top today!", "dixie_sgh": "Where did u get it?!", "bettythebarber": "Yass, I love seeing women embracing curves. inspired", "mrk_maurice": "She leaves the pool and the water level drops to half", "ginaprovost": "You’re gorgeous! I’d never be able to put something like that on.", "pencilinherhand": "I am too scared to remove my cover-up at the pool (it is similar to a parka!). You give me hope that I have the power to increase my self-confidence.", "cnp_california": "Fits beautifully! What are you even talking about 🙄💕", "madetobebee": "LOOOOVE IT!", "destinylynn2011": "Totally wish I was comfortable in my own skin like you are. Being a bigger girl was a struggle growing up because I was bullied for being a bigger girl. But I learned to stick up for myself also too. But still so uncomfortable in my own skin. Do u have any tips on how to become comfortable in my own skin?", "fritzfischbach53": "Very beautiful", "thetotsandme": "Get it girl! Love the tats!! 😍", "alves.lac": "Beautiful.", "la.tachuela": "Beautiful!", "agentbbw": "Love it", "leah.talley1": "I wish I had your confidence :(", "ashleymccaskill_creative": "I love this one!!", "xena117": "@fatgirlflow we're twinning girly with the bottoms", "persephoneparr": "So cute!!!!", "jan.warrior31": "You are soo sexy!!! Hot piggy", "acommunistunicorn": "You look super cute in that. 😍😍", "gasponce": "❤❤❤❤🙌🙌🙌😍😍😍🔥🔥🔥you look #superadorable and #freakingcute! #awesomelyhot too!", "prairie.queer": "Where is this bikini from? It’s so darn cute!", "monimoana": "I love your tummy!!!!", "mariovilla4201": "💣", "strong_and_humble": "It fits you perfectly!!! I love it!!! Where did you get it? ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "somewhere_under_the_rainbow": "Yes! This needs to be the summer where us fat babes rock even tinier bikinis! Love this look! #FuckFatPhobia", "born_a_swan": "You look scrumptious in it woman!! Rock it!!!", "instagrossss": "Yas queen and you look damn good too! 🙌", "mommadukes1004": "Thank you for helping me", "cuddlykat": "It is an awesome bikini and you look beautiful it 😙👍#winning", "ladypirateking": "You so cute!!!!!", "khavanicole": "I am so in love with this.", "sugarlove6": "I agree enjoy you. Very pretty suite", "jjtome0609": "😍", "zurioliviam": "look at that bikini body🤩😍😍😍", "q_strom_99_walker": "Sexy @fatgirlflow", "kris10dz": "😍🙌🏼🙌🏼🙌🏼", "26kleisen": "Smoking! #effflattering and #fuckflattering are my fave hashtags. 😉", "camokt": "I want it! It’s so cute. I’ve looked online. Can you send a direct link?", "ericaglasier": "Yeah", "arizona_jen": "You're an inspiration! Super cute pic ☺️", "thefeministdietitian": "I love your tattoo!", "jensen.kim96": "Hey I have that same suit!!! So cute!", "lkennady": "#ineedsomeconfidence #youinspireme", "fatclubpodcast": "😍🙌😍🙌😍🙌", "kykristy31": "@fatgirlflow I absolutely love your tattoo under your boobs! I am wanting to get something there too! 💞", "freddiemercurysmustache": "Hell yeah, girl!", "softbodytendermind": "Omg awesoommme", "jennsvach": "❤️❤️❤️❤️", "talkn3rdytome": "I literally found the top to this at a thrift store and it’s my favorite bikini top this summer!", "yamalo17": "Super cuteeeeee 💗❤️😍", "mashamashavee": "@fatgirlflow FUCK YES!!!!", "yinglingwagner": "I have this suit too!! ❤️👙", "carlyrose84": "Good for you! You look great!!! I wish I had your confidence.", "ricola2333": "🔥🔥🔥🔥🔥🙌🙌🙌", "thatlyxx": "Ugh wish I could have that confidence you have 😢", "kscohen": "You look ah-mazing!", "brito1782_betao": "Linda demais", "cherishgonzales": "YOU LOOK GOOD THOUGH", "portraitdude": "You are suchhhhh a BABE!!!! Ugh be my best friend NOW!", "kaleighjo": "So stinking CUTE! 💕", "farah__hmc": "@srh_gbl mzl chwiya espoir", "marvamaker": "You look so adorable!!! YES YES YES!", "gloriann4": "Hell yeah girl!!!! You look awesome!!! I love when people wear what they want and toss everyone else’s opinions the mother freaking curb!!!!! Rock 👏🏼that 👏🏼teeny 👏🏼tiniest 👏🏼bikini👏🏼", "sebastian_gomez_lopez": "Mmmm sexy", "hpismyhomeboy": "I think it fits you perfect and is adorbs!", "kmstamey": "So gorgeous !!! 😍❤️ love your new video about confidence", "jennifer___diane": "😍😍 oh my goshhh could you be any cuter...", "mummy2threeboys": "Love the confidence you have <3 It looks super cute on you :D I have bought my first swimming suit in a long ass time, for when we go on our family holiday usually i just sit and watch but this year i thought fuck it, I am going in that pool and enjoying myself with my children. It's time to stop giving a fuck what other people think and enjoy life xx", "katerichel": "You are so beautiful! Where do you buy your suits?", "sammi_jo14s": "WERK MAMA!", "asanzie": "You seriously look babelicious. Bikini goals every day.", "forevajess6": "Wish I had the confident to wear a bikini, to insecure to show my belly :(", "skyebleu13": "I adore it. Following you and some others has given me the courage to buy my first bikini top in many many year. I put it on and I felt like a million dollars. Now to get the courage to buy bottoms 😁. Thank you for helping us bigger girls realize we are still gorgeous and can rock anything we want. 😍", "jennsbananas": "Gurllllll", "radical_reesie_d": "You look so good in this! Your belly is so perfect and smooth and mine is all cellulite-y and has always been that way even when I was skinny and I’ve never had the confidence to wear something like this... but I want to so bad! 😢 you are goals ❤️", "stylesocialshop": "Love it 😍", "chezboop": "So, soooooo 🔥🔥🔥", "hayley_keaton": "I’ve been on the self love journey for a while. Just bought my first bikini in YEARS and wore it on a lake trip. While there I had a talk with another woman who was literally hiding in the bathroom telling me reasons she didn’t feel worthy of wearing a swimsuit in public. I was able to start a self love/acceptance convo with her, and she actually listened. We had an amazing weekend. Watching you (and other body justice/self love/acceptance bloggers) has helped me examine what I truly believe and what I want to stand for. A side benefit of that has been the ability to love myself a little more. So thanks for that! PS—love the bikini! 👙", "seerachrun": "What a beautiful shot!", "heather_learns_makeup": "😍", "defiantscribbler": "Looks great! I ditched the high waisted bottoms for a lower profile and it suits me so much better! I like to feel the air on my tummy 🌈😙✨", "dietculturesucks": "@_lanadelross another great account! yay for insta feed diversity", "a.l.y.s.s.u.m": "Team #wewearwhatwewant for life! You're rocking that bikini 😍😍", "mrsgoller13": "This suit and you are amazing!!!!!!!! Love the floral@prints!", "owlloveu4eternity": "Have you tried dresslily for bathing suites? My bestie and I want to order from them but wanted to know what the quality are for something like a 5x.", "anapfruas": "Love it on you", "sunnidaze53": "You look so beautiful and that swimsuit is so cute", "do_not_follow_me81": "Fits perfectly, too sexy gurl!!😍😉", "joniedelman": "I also love that tiny bikini.", "yubabasbaby": "WORK!", "eyesopenedtothetruth2020": "You are so awesome! I love your confident, positive, empowering and adorable you! I wish I had your self esteem.💗", "lyons_mama_89": "U look so beautiful in that swimsuit!!! Where did u get it from?", "iamelliephant": "Soooo cute! Those colors are incredible.", "kaynettia": "I bet it would be awesome to hang at the pool with you guys 😆🧜🏽‍♀️🏊🏼‍♀️", "tyra_banked": "Oiiiiiii been looking for small bottoms in a 3x!!!!!", "shana._.banana": "Ummmmm u look friggin wicked CUTE!!!!! 😍😍😍", "bodyliberationphotos": "Aaaah I love it! Aren't happy accidents the best?", "yumaratz": "What do you mean \"like\" the sexist human on the planet. You are! And yes, that bikini looks awesome on you.", "hayley_bailey_kipper": "You look absolutely amazing 😍😍👏🏼👏🏼", "kailurrrrr": "I've been such a fan of you since the tumblr days, and I'm soooooo glad I found you on here. I got a two piece for this summer as well and I am SUPER stoked about it!", "artofchelsey": "you look super cute!", "tayannex": "I may have missed this part but where is this suit from? It looks amazing on you wish I had the confidence!! ❤️", "rkwfab": "🤩🤩🤩🤩🤩🤩", "lisalinkphillips": "You look damn cute!!! Isn’t it nice when we can love our bodies in spite of ourselves? Awesome!!!", "spirit.moon.love": "I love it it’s really cute love the lil bit of detail color is nice and you look great in it ❣️💗🌸", "cannabliss_s_d_": "I have the same suit !!", "bobinrob23": "You look awesome. 🌺", "whitneytheinvincible": "So pretty!!!!", "mrswarneke": "Love it! I showed my bestie your insta and YouTube and explained how finding your social media literally changed my life! She bought a bikini the same day 😁❤️", "mandermay": "@ladykadventures love how she rocks this swimsuit", "rogue_unicorn93": "This is the kind of quality content I signed up for!", "fatbuddhababe420": "❤️❤️❤️❤️❤️", "js_photography2012": "You should feel like the sexiest human being on the planet because you look amazing in that suit. 🙌", "mslindsaym": "Looks like it fits fabulously.", "libramoonbat": "You look gorgeous, and I fucking love you for sharing it. 😍💓", "amyslingsby": "Floral bikini = awesome!", "loadingyellow": "This weekend I wore a bikini for the first time in a decade. Because of you I built a bit of confidence!!!!", "norcaligirl": "Yes boo woooooork!!!!", "mbryant290": "I wish I had just 1/2 the confidence you have! You're awesome!!", "griseldaquevedo62": "Well I love it! and that self esteem you have for knocking down those walls of i don't care!!! 😍😍", "thatoneyogi": "I love it. So cute!!!", "torstoltberg": "😎😎🤘", "tiny.lantern": "you’re stunning in this suit", "mindybayko": "SO CUTE OMG", "lauralovingherself": "THIS IS CUTE AS FUCK", "yogashrinkmom": "I want to be brave too!", "jessimacar": "This looks like it was made for you! I love it! I want to find the right bikini this year. I'm done hiding in a one piece when I want to be freeeee!", "amazinamy": "Adorable!! Rock it girl!!", "akimithing": "Fucking love this on you!", "monicamonie1230": "You look so amazing", "ames511": "I wish I had the courage to wear a swim suit. I haven’t in years.", "benmoussa.abdallah": "I am So happy to be among your friends", "stacim0171": "You are beautiful and confident. I love this. 😍😍", "unlikely_kylee": "🔥🔥🔥", "torreshunny": "Yasssssss gurl!!!", "ladyvirginal": "I sooo needed to read this. You are awesome and an inspiration. I just ordered a new suit for a beach trip next month that I absolutely fell in love with, but I've been so worried about what other people will think. I know I need to just own it and not give a damn what anyone else thinks!", "_strawberryfields_forever_": "@fatgirlflow. Thank you for being you and showing the world that you're beautiful at no matter what size. You're an inspiration. Everytime I look at your pics, I'm like.. This woman is awesome and so cool! I love your message about body positivity. Thank you. You're a phenomenal woman. 💯💜 I wish I had friends like you.", "iamjulietjames": "you totally rock it!", "rebelgr00mer": "I got that one too! I felt soooo torn because I had a tiny bit of bulge over the bottoms but I decided fuck it I love it!", "uncledaddymax": "Lot's of beauty", "photo_troy": "Yes please!!", "lavenderlamplady": "Since I started following you the other day I’ve been really empowered! I don’t mean that as a back handed compliment, you just really rock and I love how positive and adorable you are!! 🧡🧡🧡", "stephanie_dawn88": "I have the same suit 😍", "peachypipes": "You’re the coolest ♥️♥️♥️", "mamamandabear": "Can I share this on @weartheswimsuit?", "tiffanyistwisted": "Adorable as usual! 😍💜", "maiicaires": "Linda 😍", "plussizescuba": "❤️❤️❤️", "mrsmurphyc": "It’s super cute!", "spaced_out_rae": "I love you for the massive amounts of body positivity you spread. I strive to be as positive and confident as you. Thank you for enforcing that my body is okay, and I shouldn't feel bad. 💜💜", "comfyfattravels": "I like biiiiiiiiig smiles", "chloetonihayward": "How do I like this more than once?😍", "lvernon2000\nVerified": "Verified"}