{"wjb773": "@je_suis_cece u need a pic like this!!", "thecurvytrini": "Ahahaha I am the same way my closet is bursting 😶", "valentinortega4419": "Omg luv ur stretch marks beautiful", "krinnyk": "Oh my goodness that tattoo is gorgeous! I'm in love with it, the coloring is amazing", "undateableblackgirl": "Summer time fine! ☀️", "nique1995": "Why do I freaking love you so much...? oh yea because you’re freaking amazing", "lydialouise21": "@fatgirlflow amazing tattoo for starters also I just bought the most beautiful bikini from @simplybeuk it’s from the brand @curvykate and they are specially for beautiful plus size bodies 😍💓👏🏼 xx", "ljeviesmommy": "You look adorable! Maybe it’s not a swim swimsuit top?! Just sun!", "bronte_shutter101": "I was about to say the same thing loooove the tattoo 😍😍 and also your photos are so inspiring", "gee.gen": "Stretch marks in the sunnnnnn!! 😍😍😍", "lara.jane.ny": "Love that color! Nice ink. I have yet to find a single swim suit or bra that fits my chest correctly! Sigh.", "hazemalaze": "One of my favorites is from boohoo! I also got one custom from @allihalla that is absolutely stunning and tailored to my body!", "serranochili": "I have 0 swimsuits", "riseandshinemissy": "You are the most perfect angel ever.", "phatgirlsareprettytoo": "Where is the swim suit from beautiful?", "thegracencurtis": "😍😍😍", "ryersonvalley": "I’ve been jonesing for an underboob tattoo but only seeing them on skinny girls...THIS IS DRIVING MY DREAMS!", "brandi.primeau": "I love your tattoo ❤", "alikaytessner": "Where is this suit from, I love the color!", "zmnkwjf": "👍👍👍🙋‍♂️🙋‍♂️🙋‍♂️🙋‍♂️😗😗😗😗😗😗", "lgibbs609": "Love your tattoo", "emilyrose.hale": "@mrsemmagreen ❤️", "meagannicole.volumetwo": "@tactical_charger", "lara.tamsin": "I know you mentioned doing one but have you done an in-depth blog on your tats? I gotta know about the process with the chest piece, especially healing underneath the breasts, with bras, sweat, etc. I would love to get one. I’d love to hear about all your pieces 🖤 @fatgirlflow", "astralglam": "Why I can’t find any cute swimsuits! I just want a nice high waisted bikini that doesn’t cost like 70 dollars because ya girl is broke 😭 and international shipping please, I live in the EU. Any suggestions @fatgirlflow or babes of the comment section? ❤️", "waldxn": "It’s always slim pickings in the plus sizes but i got my suit from @Walmart this summer and last and both were pretty 🔥", "katesmart90": "Rose gal", "lulu19781978": "È stupendo questo costume. Lo voglio anche io!", "steffi_gtoday": "I Love this Image. Very sexy 😊", "godfearingman6060": "Beautiful!!", "jpm_jen": "I get mine at Swimsuits For All. Great photo!", "_mississippihippi": "Where's that suit from @fatgirlflow", "frannamstyle": "No such thing as too many! I’m always in #tattooenvy Your art is incredible. Oh and the banging bikini makes it even better 👌🏽", "wanderlusty_adventures": "Torrid... pricy but they hold up well and a lot of them come with under wires and removable cups. Only downfall is you have to try them on in person because some cuts allow for more boobs than others. Generally their twist front tops allow the most", "isawthefireworks": "@femmenistfatale", "maltesegirl62": "Cool tat", "manojkumarmanishkumar": "Hii sweet Hart", "caitercait": "Omg your ink 😍😍 want an underboob tattoo so badly but finding it difficult to show the artist that part of my body but I just love them!!", "jessicaclaire_______": "City chic is a bit of alright :)", "mi_randa_gurl": "I love this! Is it comfy? For true to there size ?", "leedobecka": "Perf color suit with your tat! 😍", "plussizepioneer": "I just absolutely love your sternum tattoo SO much! 😍", "d.rosyyy": "Love your tattooooooo❤❤❤", "tattedgirl628": "Torrid has really cute swimwear!! I just ordered one the other day hoping I can get enough courageto wear it", "tx.hillcountry_ranchhand": "That’s the one beauty thing ever", "ravvan.sadge": "Love okokokokokokokokok", "ssbbw_amber": "You’re getting BIG!! Keep gaining it looks good on you", "punkr0ckprincess": "I love that tattoo! I have always thought I didn't have perky enough boobs or was too fat to have a tattoo under da boobs but every time you show yours off...I feel myself get a little more like....\"I can do this....\" Hella going to make that happen ....thank you for the bathing suit and tattoo inspiration!!🔥🔥🔥🔥🔥🔥", "mimir25": "Love this pic!!", "theshortversions": "You’re right, the color is amazing and so pretty on you.", "abrakittykadaver": "Can you please show me what the front looks like while standing up? I just ordered it and have HUGE boobs and I'm worried how it will look. I don't want them to fall out. PLEASE!!!!!!!! You can DM me", "serwendipitous": "That color, @fatgirlflow !!! I’m so into neutrals that blend with my skin and that color is just about right for me. Beautiful!", "kerrishc": "I just got a swim suit from eloquii and it's great. Fits nice, comfortable, holds the girls in and has the front cut out so its is a stepping stone into a bikini. Not ready yet for the full thing yet!", "eleacia.thesing": "I cannot get over how amazing your tattoos are", "fat.girl.in.a.little.space": "@lanebryant I get all my swim and lingerie from them. #cacique is the only way to go for me.", "kacy2phones": "Ugh I hate tops with bands that roll constantly! It's so annoying.", "kmarie130": "I love you.... and that color 🤤🤤🤤", "gogoluff21": "@melly.heart @mieyulhaikal_hs", "that_fitish_bish": "Damn that tattoo girl! #hottie", "somewhere_under_the_rainbow": "Omggg in loveeeeee. Also from one merbabe to another: there can never be too many bikinis! But..if you ever need to get rid of any, look no further! 😍😍😍", "yumaratz": "287...probably not enough, but that's ok. They still look awesome on you.", "the_aura_sphere": "@fatgirlflow I just bought the same swimsuit 🤗❤️🤗❤️", "bzimmer5": "I cannot like this post enough! You look fantastic. Love the suit color with your tats!", "ladyfreelove": "I got a gorgeous galaxy print from @torridfashion!", "andimjulie\nVerified": "Verified", "allisonsadventure": "I'm OBSESSED with that skull tattoo. I've wanted one similar to that for sooooooo long!", "__kellbell": "Torrid!!!", "doggymomof2": "You should do a swimsuit closet sale!!! ❤️", "herbanhealing": "That Looks so comfy, where’d you get it?", "lizjosephine": "@missmelaniecolette 🙌", "angela.jasz": "Beautiful!!! I wish I had more swimsuits, but I can't justify buying them cos I don't go in the water often (maybe once a year?) or do anything where swimsuits are appropriate clothing 😂😂😂", "diegobh71": "I have to say it, I'm obsessed with your tattoo and of course you look gorgeous. J you have a. It is by your side!", "stephaniebrookbank": "Love the color!!!", "juliananotari": "@fatgirlflow uhmm where did you get that?? It's soo cute! Was it in your recent video? I may have missed it.", "_fatandpretty": "I’m in love with this picture!!", "youre_so_clothes_minded": "Gurl I'm loving all your tats 😍 beautiful artwork on a beautiful body 🙌", "liagp6": "Hot 🔥", "laciearmstrong": "ahhhh love !! i hope you do a haul !!", "itmustbebunnies": "This is literally my favorite picture EVER.", "kdrae_benito": "Swimsuits are my weakness!", "wallflower_analyst": "I'm obsessed with your tattoo😍", "samanthamoats": "I got a suit from @gamiss_official last year that I'm OBSESSED with! I was thinking of getting another suit from torrid but I was like 🤷🏼‍♀️ I'll never wear it because I love the gamiss one so much!", "muss306": "I am obSESSED with this pic of you! SO. MUCH. FUCK. YES.", "libramoonbat": "I loooooove that color! You look great!", "mala_babee": "Your tattoo is gorgeous ❤️", "therelatablefatgirl": "Love how the color matches your tattoo. Probably very unintentional but magical when it works out lol.", "peekatl": "Hi! 👋🏽 What are your thoughts on the new trend of high cut bottoms? I just bought my first ones. I’m use to my back fat being out. Maybe even my side fat but this front fat reveal is new for me.", "gameandglam": "Have you tried Simply Be’s Swim?? I love it because it makes me feel fab. I also love this color swimsuit ✨", "groovyretrotarot": "This color with your tats tho = perfection!", "oh.hey.its.chante": "I’m loving that body art!", "itsbriixox": "@brittodea_ can I get an under boob tattoo k thanks", "worthyfigures": "This is the first summer that I am beyond thrilled to out bathing suits on! I decided almost a year ago to quit hating my body and just love it. Of course I still have days where I struggle but this is probably the happiest I've ever been with my body. I'm not as my skinniest, but I am at my happiest. Weight does not have to have anything to do with how you feel about yourself!", "ladyvonfaber": "Your tattoos are so beautiful dude 💜", "sarleiwag": "@justbenjamin_", "who.is.shawn": "Yes", "sailor_succubus_": "I wish I could afford several swimsuits. 😧 I love my swimsuit but having more options in my closet would be nice. Rn I have a black and white one strap tankini with skirt bottom from walmart. It's pretty basic, but I love the one shoulder and shape of the skirt. I don't show much skin because I my skin is really sensitive to the sun.", "emily880": "you’ve given me the confidence to buy my first bikini this year!", "myrabeautyxo": "Love you tattoo !", "angelomarco21": "Love that bikini!!!", "lovelyss.findsconfidence": "Oh I love it! The tattoo, your body, that bathing suit!!! 😍", "whit_the_goddess": "@simone1021 look at this tattoo.", "sick_sad_flake": "I love your tattoo! I just got my first bikini in like 15 years yesterday on sale from Torrid", "bestkimever": "Such a cute swimsuit!!!! I wish they made tops more size friendly though. Drives me nuts how the band rolls up!!! You look supah hot 😍", "_jillian.allen_": "Zaful!!!!!😍", "chaneeeeeeeeezy": "Yaassssss", "mozmarr": "@bobbi_bee011 sooooo want a tattoo where she has one. Omfgggggg stunninggggg", "jamie3737": "@swimsuitsforall and Target are my go to. Target has tons of new plus sized options this year.", "emlang87": "Your tattooooo😍😍😍😍", "judi97115": "Great view😉", "from_kathys_closet": "@eloquii and @torridfashion are my go to shops for kinis. Great tattoo 🙌🏼❤️", "lindsaythebish": "I’ve been getting mine from forever 21 plus for a couple years but was disappointed in the selection this season. I bought a high neck top and I LOVE IT. I’m not worried ab my boobs popping out!", "q_strom_99_walker": "Sexy @fatgirlflow", "gizmoxbaybee": "Gorgeous and your tattoo is amazing btw!!", "princesscakep0p": "Thanks so much for sharing this photo and letting your stretch marks show. You are gorgeous and seeing your beauty helps me find beauty with my own body", "__dcfx__": "Gorgeous! 😍 Also, do you have any tips for keeping your swimsuit bottoms/ underwear in general from rolling down? I can't seem to keep mine up! ❤", "plussizescuba": "Looking great! And man I love that color! I buy mostly from @swimsuitsforall - I know nothing fancy but I ❤️ them", "thebodyoptimist\nVerified": "Verified", "comfyfattravels": "Also your stretch marks are beautiful", "ab3rz0mbie": "Omg I want this suit.", "rosemaryandquartz": "I’d venture to say by the end of summer that’s all you’ll be wearing. 💖💖💖", "bhiggs071016": "You look great and i agree love the color but the top i feel would be weird on my chest and I just got my suit from torrid...still nervous wearing it for the first time. Its a 2 pc. And im very self-conscious so we shall see how it goes :/"}