{"shams_little_life": "Girl you look great, show em we can rock bikinis too and better", "nj_nurse0305": "I wish I had the confidence you do. It’s hot as hell here in Syracuse went to fireworks last night in jeans ugh!! Was dying. You are beautiful!!", "lisalee68": "I think you are incredibly sexy girl!!!!!", "khavanicole": "Such a babe.", "lioness_soroyal": "😘", "ryn_auntj_and_uncles": "@1livelaughlove85", "emilyfartis": "@but_consider_this", "tom_p86": "very beautiful", "problyeating": "@jack_yuh_yeet", "mypetdevil": "People actually message you about wearing a bikini while being fat? But why? I don't understand. Do they not get your whole vibe? Why are people so awful?", "koutouajeanyveskadja": "hello beauty, you leave me speechless, you are a real goddess besides being glamorous and sexy, I would like to get to know you better if possible", "khaleeqbacha": "Freat porsnolity", "llljess": "I see you at the pool all the time. I’ve said HI a few times! One day my toddler person will give me five minutes of peace so i can Chat with you.", "shittinsharts": "😍", "muhseger": "So sweety", "eric_billings931": "@dominikcarver", "splithoofrivera": "I think water shots and sitting shots are the best and you gave me the best of both worlds 😍😍", "syahrul_building_45": "Beautiful", "ame.lia.x": "Now that is what i call pretty proud strong women! :) hope u like me 2😃", "v_beleske": "You’re an ugly pig promoting obesity. You are a disgrace to women on earth🤪", "sophieisafatty": "@lloydfolks_ in her natural habitat", "kihdkazu": "1v1 me running up the stairs", "immerkwaad": "@annewuijster_ It's easier to pretend to be proud about being fat instead of taking responsibility about your health", "young.meat": "Eat a salad nigga", "nique1995": "I freaking love this picture and this suit! You looks smokin🔥 and more importantly happy 😊", "nicki_g775": "You go girl!", "greeneyesofblue": "@_nenagins_ I see you.", "rhaunabear": "Love the bikini 👍", "cialitra_": "lol smol legs", "c4taurus": "#Fat&FaV!!!", "the_other_hillary": "Beautiful", "reddragonflystudio": "Love it. After years of feeling I couldn't wear a bikini..I tried one a few years ago. Its glorious...feeling the water on your tummy is a delight. Everyone should try it. Experience life.", "strawbellli": "prettyyyyy 😍", "ssbbw_amber": "You should keep getting fatter and eat even more, you could easily get to the 600+ club. 😍 it definitely looks good on you!", "sebastian_gomez_lopez": "😍", "sextina": "I hope this suit is from adore me bc I just bought it 😍", "lucyfire777": "You look fabulous! I wish i was that confident wearing a Bikini 😍🙈", "emozionemare": "Splendida", "hazemalaze": "Yeaaaa rock that kini!!! Don’t let nobody tell you shit", "alybgoode": "What a cutie!!", "han_roene": "❤️❤️💯 you inspire me", "klaudyzel": "Thicc snacc", "ditzys": "It must be exhausting for so many people to stay pressed all the damn time 💅🏻 You're a ray of absolute sunshine. To hell with anyone who ever tries to dim your sparkle 💫", "cambam25": "You look as cool as a cucumber.", "carissakeepsitsogroovy": "I wish my belly was so smooth", "hiiigher.livin": "Love it!!!", "itschristinayvonne": "Send some of that confidence and bravery my way girl!", "madstylechica15": "Cute", "wowaz__": "Вы не хотели бы Похудеть ? Бесплатно", "redefinecoach": "Own your curves babe! You are gorgeous. ❤️", "jennmasterj": "Killin it in that suit. And with that hat?😍", "witchy_cwp": "👍🏻👍🏻👍🏻👍🏻👍🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻 I wish I was you x", "whitneytheinvincible": "I love that green suit!!!! Where did you get it!?", "ktjmxrse": "Jealous of all the people that have time to message you about something that doesn't concern them. So much free time.", "mrs.chaygeron": "That bikini looks AMAZING ON YOU! 👌", "mrs.davidson_": "I envy your confidence beautiful! 👏🏼👏🏼👏🏼 Rockstar.", "q_strom_99_walker": "Sexy @fatgirlflow", "glamghoul": "You’re so cute and look bomb!!!", "crazyaboutmyjellyroll": "❤️❤️❤️", "jazzyjay1022": "Queen!! 😍👸🏻💅🏽", "ms.ks_music_": "Beautiful!!!!!!! Love Love Love your bikini! You’re stunning 🔥", "petite_machine21": "Ahí la llevo, me faltan como 300grs para estar como ella 😪", "evelyn_siciliano": "Que issso", "torriepickron": "You look beautiful! Love your confidence....it shines through!", "fat.jenny": "I can’t get over how cute your round tummy is 😍😍😍", "tinyelmo82": "#Inspiration #Beautiful", "thebossfamilyband": "That colour is fab on you!", "findingbuddha": "😍😍😍", "brandistardust": "@fatgirlflow I ordered the bathing suit but I'm curious about the bottoms. I ordered the high waist but I think you have the bikini bottoms - any feedback on how well they stay up over a bigger lower belly? I love this green so I can't wait to rock this!", "monimoana": "GORGEOUS!!! I know I've said it 1000 times but I have to say it again: you are a rock star!!!", "rochebrice": "😍😍😍😍", "theresameire": "All ypur pool shots have me feeling like the dad from Friday! \"How come every time I wanna go in the pool YOU in the pool? Wearin a bikini, swimminall around? I like to wear bikinis! I like to swim around!\" Instead I'm stuck at home with broke AC and a baby pool.", "girlcalledkris2": "You look so happy, and honestly, that's all that really matters 😊✌", "alicia_annettes": "Beautiful", "gaudy_mermaid": "I feel like we are secret besties! I am so inspired, thank you for joining me in proving not all phatgurls struggle with bad self esteem! #chuubyandproud💋❤", "kelsieonfire": "You look so good girl!!!", "jennydecki": "Beyond jealous that you can wear a trucker style hat in the heat and not immediately be inferno-levels of hot. It's such a great look and you are rocking it as usual!", "amya95": "My daughter, who is 12, saw your pic yesterday and immediately said you were pretty! I have to agree.", "motherduckinggingers": "You look so beautiful and relaxed!", "khrysthesofa": "Giirrrlllll. I wish I was swimming right now. 😭", "dzeron425": "Yessss queen, I love you and I want to hang out and maybe eat Taco Bell together K thanks lol @fatgirlflow", "synapsefizz": "Omg that looks so refreshing! Girl earthy colors are YO THANG!!! 😍😍🔥🔥🔥😍😍😍", "lottiew30": "U literally have the confidence i wish i had! You’re absolutely amazing! Xxxxxxxxxxx", "zirzeppelin": "I'm in love", "misanthr0pic_13": "You are my hero 😊 you look awesome! I wish I had your confidence. 💜💗💜", "bye_bye56789123": "So adorbs!!! 🙂🙂🙂", "ej_siler": "You are beautiful! You have inspired me to try a bikini and my girlfriend agrees and says I'd look hot in one.", "tayytheisen": "So cute wow 😍", "drtist102": "Looking good!!!!", "missdanielove": "WHY ARE YOU SO CUTE?!! ❤️ I love it!", "kshellrude": "Youre gorgeous and a total inspiration to me.... thanks for doing the hard work of being a super babe and letting us see ya being the SHI T!", "mandagulbransen": "Yes girl! Fuck it up!", "munc11": "Yassssss! Livin' your best life!!!! Go girl!!!!", "sillykmc48": "Babe 😍", "amanda_rose_artistry": "Where do u find your bikinis! I have such a hard time finding cute ones that fit", "resolutely_rachel": "So jealous I'm not in a pool right now! Enjoy!", "pirates_lyfe_4_me": "Good morning queen! 🤩 May you forever give no fucks about fat hatin haters 🙌🏼 I so appreciate you and @comfyfattravels realness", "ivydanielle75": "I totally wish I had your confidence. I haven’t worn shorts or a bathing suit in over 15 years", "aluiz627": "U look AMAZING!!!!! I wish I had that kind of confidence.", "soulfulwomyn": "❤❤❤❤ Yassss!!!", "yus_adams": "You're such a babe! 😍", "rockoutwyoursocksout": "Yaasssssss! Slay!!", "april.lee.rose": "Mermaid ♥️🧜‍♀️", "gigigotdat": "Tell em girl!", "thelizard_queen": "Godddd you are gorgeous 😭😭 I say this all the time but I'm feeling this \"holy shit she's beautiful\" in my bones with this picture, I feel shaken", "justjazzb": "You are gorgeous and I would love to be with you", "strong_and_humble": "Love this soooooo so much!!!", "jamie3737": "Did you get the high waisted bottoms? Im debating between them.", "hector_luvs_coffeee": "🌞🌷", "p.a.u.l.a.p.h.o.t.o": "Be fat-yourself ❤", "thehouseofgoodwin": "Love you!", "xoxo_fallon": "So inspiring! Gorgeous! 😁😎", "shahd199718": "💜", "arianemarie12": "Same here girl! I shouldn’t have to cover my body to please someone else. They simply don’t have to look!", "mandaroniii": "You look so beautiful and lovely in this photo! And can I just say that you and J are friggin adorable, y'all make me smile with not only your love for each other but also the beauty you radiate from within!", "missyann0509": "Yeah girl! I bought my first bikini this summer! So excited", "martynkaxlis": "Fuck that, you look beautiful & stylish 💗💗💗", "rosemaryandquartz": "Personally, I love the bikini.", "kirsti83": "Love the colour of the bikini, let the haters hate and let the good times roll, you look amazing go on beautiful lady you slay xx", "thecurrentnatural": "This is the cutest picture❤️", "kaleighjo": "So. Darn. CUTE! 🙌🏻🙌🏻🙌🏻", "bai.noelle": "fat is beautiful and so r u !! a sunshiny babe", "iftheapocalypsecomes_beepme": "♡♡♡", "bigrob1968": "You look fabulous!", "whitbear_": "Period❤", "summer.lawrence1": "Not to be insecure about being in a 2 piece I’ll get there 😍😍😍😍", "erin_hernandez_": "Why do people get so salty about people enjoying the summer In swimwear?? 🤔🤔🤔", "jessydez": "Goals! 🙌🏼💕", "farmerfemmeesq": "Where’s your suit from?!", "emilytebbetts": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 hell yes!! Slaying that bikini too!! Do you mind sharing where you got it? I’m looking for a similar kind of bikini!", "taliana": "This looks so refreshing on a hot day!", "beautyglamournl": "Thank you for doing this, you let the people see that you don't give a fuck and you're beautiful!!", "miryamplum": "You r rocking it!", "ashleighj85": "Out here living your best life in a bikini. Suns out, tums out 👍🏻", "jessperry96": "You look amazing I’m crying 😭", "raeraefawn": "I love this whole look. Also, so jealous of your pool day. It is hellishly hot here in Upstate NY and I'm trapped in the office.", "natalieinthecity_\nVerified": "Verified", "yumaratz": "Oh, you are killing it in that bikini!!! It looks fantastic on you. Keep posting more.", "cheyennegilstudios": "Fuckin riiiiight", "fdonneys": "Hot!!!!", "jj_jeminii": "😻 you look so good", "comfyfattravels": "Lookin so fuckin good babe. Also nice lil appearance by @alysonmcc in the back there haha", "mariacristina4201": "You are an inspiration to me...its because of you that i started looking at myself in a different way...thank you...kisses from a fat girl from far away", "tonsablush": "You are such a cutie pie!", "nolatrees\nVerified": "Verified"}