{"nicolafarndell": "Hi, I’m Nic from the uk, I think I actually gasped when I first saw your page - fat AND gorgeous, how can that be??? And now, slowly, slowly - I’m seeing it and feeling it - you have brought confidence and sass to so many of us. You are a shining ⭐️ and truly beautiful in every way! 😘", "vignor67": "I got my fat and proud T shirt today. Love it", "marcomazzilli": "Interesting posts 😃", "bethkwood": "Hi Corissa! I’m Beth. I found your content while looking for 3-4x fashion. Most plus size youtubers/bloggers I viewed only shopped at stores offering sizes 1-3x exclusively. A category I don’t “fit” into. I live in the smallest province in Canada and have only 1 store that offers 1-5x clothing. To say that I feel alone and excluded is an understatement. So I view your content to get a sense of inclusion. I stay because I adore your love for people of all sizes. It’s helping me to start loving myself and see my value. Something in all my 29 years I haven’t done. Thank you 💗", "mollytinsleyceramics": "Hiya ! My name is Molly and I’m in Perth in Western Australia. I make pots and homeschool my three boys. I follow fat yoga pages because I am amazed and in awe of how young women have taken body positivity and run with it. I grew up with advice on how to hide your body (parts), lose weight, shave off and be ashamed of your fur, and generally shut up and sit down. I L💜VE watching women stand up and be loud and not be ashamed of anything about their bodies. And now I’m crying 😭I am a wet hen and proud of it.", "noleyreid": "Hi, Corissa. I’m Noley. I found you a couple of years ago and love that you don’t apologize for taking up space in this world. Watching your YouTube hauls, I usually stare more at you than the clothes. You’re just so pretty and cute and I love your hair and cheeks and tattoos. Whew. Okay, about me: I’m a writer. My latest, third book is a novel all about food and body image and, ultimately, is an indictment of the ways our society misshapes our relationship with our bodies and food. It’s called Pretend We Are Lovely.", "randajjj": "I’m Randa (said like MiRanda, but no Mi) 🤓 I’m here because watching you and your radical realness on YouTube for the passed couple of years has aided strongly in making me feel better about the human that I am. Right here and now.. and now and yep, still now. Despite whatever the hell pursuit or journey I’m on that day or week, or moon cycle.. your presence and words and like mindedness, makes me feel like there are still safe spaces for us to come and relate and just be. Whoever and however it is that we want to be. I appreciate your content and your mind. Thank you for offering a sense of security to those of us who otherwise may not have ever been brave enough to just be, as we are. ❤️❤️ Much love from the Midwest.", "hanem13": "My name is Erin and I live in Vancouver, Canada 🇨🇦 I’m here because I feel like you’re the real deal. Like we could be friends, hang out at the beach all day and chat about all the gorgeous, fat babes we see. I’m not all that comfortable in my body; mostly around thin family and friends. Although, with my wife and how I see myself, I feel pretty good. I was really into sports and in good shape until I had my “babies”. Then a few years ago I lost almost 100 pounds. Then gained it all back. Now I’m working on loving me for who I am and not giving a shit what others might think. Not an easy thing, but I’m learning it takes practice and love. You are such a positive influence and we are lucky to be a part of your journey❣️ Interesting fact- my last name is a day of the week.", "shelbyonstage": "Hey howdy hey, I’m Shelby. A fat girl living in Orlando and working for Mickey Mouse !! I spend a majority of my time at Disney trying not to die from the heat or playing video games !", "hardxcandy": "@fatgirlflow I follow you bc I think your lovely and I like how confident and happy you seem. I’m petite, skinny, and attractive and I sorta hate it bc my whole life men have looked at me for just my appearance, and girls have hated me for it.. and I have been through a lot of domestic violence & sexual battery bc of it. I just try to be myself and don’t like it when people see me for just my appearance. Interesting fact about me- im an artist. I love the ocean, I work on the beach. During the summer I swim a few times a week. The serenity of the crashing waves on the sand is where I find my peace.", "osoflexy": "Omg I can’t @tracwrape", "mislisabeth": "@mislisabeth love the page from buffalo, by. Add me everyone 🤗", "crotchlessyogapants": "I'm Kelly. I waited to comment on this post because I am old and I hate typing on my stupid phone. I deeply love black t-shirts, boyfriend jeans, and Birkenstocks. I dyed my hair blue-green and I still can't decide if I hate it.", "kristyfwalker": "Hi I'm Kristy. I seen your post and I added you because 1 you are beautiful! 2 I want to have the confidence you have. 3 I'm looking for women like myself instead of this fake society we live in saying you have to be skinny. I have a major problem accepting my weight. Even to the point I've become agoraphobic. I have had people be so mean in public that I hate interacting with people. I love your clothes right now I can't afford any but they are lovely. I think you give people like me a ray of hope and I'm trying to accept myself", "kariadamskeaskew": "Hi I just found you and my goal is to learn to love myself just as I am. Interesting fact about me??? How sad that I can’t think of one thing 😕", "cat_gizzy13": "Hi! My name is Catherine but I’m called Cat by almost everyone I’ve ever met. I just found you today on Here thru @whitneywaythore ‘s post. Love the clothes, what I’ve seen so far ❤️. Fact: I love to bake and want to make it a career if possible and if the stars are aligned for it.", "ariesstrong777": "Hi i'm Luz! I'm excited to follow you! Have a great evening!", "joemama1017": "Hi!!! I'm Jaimie and I'm SO GLAD I found you! I am really into my husband, my son, my dog, and makeup! I cant wait to get to know you and all that you do! Thanks for representing the bigger crowd! 💋🖤", "mrs_whitney_davis": "Hi there 👋🏼 I’m Whitney. 29 from Las Vegas. I am plus sized, always have been and struggle to find cute clothes! Ha! I’ve been married to my giant 6’5 husband for almost two years, and we just started trying for chubby babies! Lol. I literally stumbled across your account today, and I absolutely needed to find it. My self image isn’t always the best, but following pages like yours help me every day! I love it!", "camilaprincipe_": "@raquelsantiagoprincipe", "annmarie2718": "I just found you a couple of months ago, and I ❤️ your vibe! I am raising two teenage girls and I am the ED of a theatre education program for children and youth. Fat activism is an important element in both of those roles for me. Thank you for being a role model for young creatives like my kiddos and the little humans I work with - keep it coming!!", "keiraleilani": "Hey girl! I'm Keira. I am 100% obsessed with everything you do on here and thank you for not only fighting for the fatties, but also bringing up intersectionality and privilege. Your shirts are 🙌🙌🔥🔥🔥 and your photos are gold. ❤❤❤😍", "xpinkyxgirlx": "I know this post is a few days old, but I wanted to introduce myself. I don't remember how I found you, but it was instant love. I love your positivity, you're style and the fact that you're about building each other up. You have an adorable personality and I really look forward to your posts and insta stories. I spent 97% of my life hating my looks and my body. Seeing your posts really inspires me. Random fact...umm I can sing!", "watson.figs": "This page makes me ridiculously happy and inspires me to have more confidence in myself. Not a plus sized goddess, but I struggle a lot with ED and BID. I’m working hard to conquer those issues and practice self love. This page rocks and thanks for being amazing.", "fancyanna47": "Hi I'm Anna. Just searching for attractive bbw's on here one day to Annie and get some style guide i can across one of your pics and was interested. I love what you promote and i think you're cute. Thanks for the great work, keep it up.", "mickeygetsmini": "You look so lovely, girl! ❤ I love this look! Us plus sized sisters have to support each other here. Liked! 😊👍", "janeemoonlight": "I'm Janeé and think your adorable and love your photos!! Love your content and how you are just yourself!! I seen you on TV the other day it was cool! Have a great day!! One fact about be is I'm funny!", "hipfat": "Hiya, I’m Hannah and I’m a queer nonbinary fatty living a great live in west coast canada. Im also an artist and a plant mama! Ive been following Corissa since they were a sw on tumblr and they were my first body representation/bopo staple in my journey 💞", "rubbertrampartist": "I'm Blaize Sun, the force behind the Rubber Tramp Artist blog. I live in my van about half the year. The other half I live in a 40+ year old fifth wheel out in the desert. I've been fat forever (with a couple of periods of being thin when I literally had dreams of donuts and suffered from frequent colds). I'm an old lady still working to accept my body the way it is.", "xlunarlulux": "I'm Lu. I followed you because I love how confident you are and you give me encouragement to be comfortable in my own skin. Fun fact! I'm just a nerd that loves video games. 🤣", "snewjo": "I’ve been following you for years, not to sound like a creep haha. I loved yours and @comfyfattravels tumblrs from way back in the day (did y’all know each other back then? 2013ish - I was calderonbeta, tho I’ve abandoned it since) You both really jump started my self-love journey back then with your confidence, style, and attitude. I saw myself in you and I’ve followed your rise ever since. I feel weirdly proud of you?? Haha, I’m just really happy that you’re successful and happy. And your fashion resources probably saved my personal sense of style lol. I don’t engage a lot but I appreciate all you do. :) Thank you 💖💖💖", "imperfectporkchop": "Hi I'm Haley. I am here to surround myself with images of bodies like mine because it keeps me grounded and happy. And I've found your words about fat acceptance particularly helpful.", "torinoodles": "Hi! I’m Victoriah, a fat babe who does neuroscience research on fat mice 🧠 I’m here for your constant flow of positive energy, as well as your desert boho chic decor vibes!!! Last year I started following more and more babes you share my experiences navigating the world while fat, and it’s been a great ride so far 😸", "alexislubbers": "I’m Alexis! I’m new here. Still trying to be okay with my image. However, I have a kickass job where I get to mentor adults with developmental disabilities and I’m super proud of that. They make me feel like a million bucks every day 😋 also getting married in 32 days! Woot woot!", "ej_siler": "Hi I'm Erica! I'm here because beautiful women like you have helped me learn to accept myself. After growing up being told I was less because I was fat, I've learned my true beauty. It only took about 39 years lol. But at least I'm getting there. Random fact I find my center by drawing or writing in my journal. I also read magazines from back cover to front cover. 😊", "jacky_van_zeijl": "Hi I'm Jacky 36, live in the Netherlands and find you posts freakin fantastic! I have the same body type as you but lack the confidence to put on a bikini...but I'm getting there..no wearing skirts and dresses without a legging or panty's yeah!! Love this post keep on going!", "adelemum": "I’m here because I love your vibe. I just lost 71 lbs over the last year, bit although I’m in a better place health wise I still think of myself as a fat girl. When I watch your videos I like what your laying down. I learn things from you.", "plahozcal": "Hiiii I'm Paula, an animation student and amateur illustrator ( art account @abbies_inn ) and I'm new here! I decided to start following more plussize and bodypositive accounts to charge my self esteem with good vibes and you are one of the accounts. I really like your aesthetic and confidence :) I send you a really huge hug!", "danielleisanxious": "About a year ago I removed all the toxicity from my Instagram and followed only accounts that made me feel happy and inspired. That’s why I follow you 😊 An interesting fact about myself is that I feel I need to share because it’s like a badge of honour is I struggle with depression and anxiety and am currently in the middle of a bad episode. But following folks like you and seeing your daily inspiration makes the hard days a bit easier 💚💚", "unapologeticallykat": "I'm Katherine. I've been following fat acceptance blogs for about 5 years and have started following them on Instagram about a year or so ago. I'm still working on being confident on myself and vary between a big ol fuck you to diet culture and struggling with disordered eating thoughts/actions. I really value the anti diet messages you provide. I'm going to try to get one of your awesome shirts x", "oneprplrose": "Hi I’m Roe! I’m trying to unlearn diet living, and honor my body-in whatever size it is! I love fashion and make up and am exploring both...trying to be bold in a world that says I should hide. Interesting fact...I’m not sure I have one...yet. Lol", "saidylic": "Hello, I'm Sandra. I found your page through other body positivity accounts and I really love it. I'm 20 years old and I've spent 3/4 of my life hating myself and how I look (possibly more). IGs like yours make me see there's another, more loving, more positive world out there. I want to be a part of that. In my free time, I love reading, listening to music, my dog is always with me, I love animals and I'm stubborn af when it comes to the things/people I love. Hi, Corissa! :)", "anna_de_rosbourg": "Hi! I'm Anna and I live in Munich, Germany (that's where the Oktoberfest is). I'm not sure how I found you, but I think it's through @curvily. I'm plus-size too (because of an array of health issues) and one of my biggest passions in life is makeup design and I've also worked as a MUA in the past. Feminism (the inclusive, intersectional kind), fat activism, human rights are all causes dear to my heart because I know that the bigger they get, the more they will bring humanity forward. I don't really have fat friends, so I like having role models like you or Tess Holliday and many others on the internet at least.", "mailin.klinger": "Hello, my name is Mai and I‘m here because I love your feed and your style! ❤️🧡💛🔥a fact about me, i am an acting student in Berlin struggling with Diabetes Type 1, but I am positive and loving my life! 😍🌼bis bald (see ya in German 🙈)", "moxiemoth": "I'm Moxie and I'm chronically ill (fibromyalgia) and I'm coming to terms with my fat body and learning to style it and love it. I love seeing your posts about just existing and enjoying life while taking up space the way society doesn't want us to. Thank you! Random fact, I have a big skull collection ☠️", "benavidez_williams": "I’m amanda and I really appreciate the clothes you preview. It’s helped me find some cute clothes to wear :). I also live in LFK!", "newinheritors": "Hi I’m Sasha! I stumbled across one of your posts on the discovery page and looked at your insta and was like yep, I need this babe on my feed. I do my best to follow more plus size folks bc I can get really bummed seeing only thin people. I’ve been working on self acceptance since 2014, and I’ve come a long way but my weight fluctuates a lot and for the first time in my life I’m over 200lbs and sometimes that weighs on me (HA!) because it makes me feel not so great health-wise. So right now I’m trying to find a balance between being healthy, but also loving my body the way it is and knowing that I don’t have to change it for society. I live in Toronto, Canada, and my fun fact is that I’m about to start my fourth year of college, in my third program, which is a post-graduate certificate in copywriting :)", "fat.girl.lives": "Hi, I’m Katie! I love your pics and account, just part of my body posi insta feed which is literally changing my life! I myself have an account with which I aim to normalise fat people enjoying food, check it out if you’ve got a sec ☺️ Thanks for all your work and great content🧡💛💚💙💜❤️", "engvallbirgitta": "Hi I'm Birgitta from Sweden. I wanted some role model since I gained a lot of weight after reeching menopaus. I am now trying to love The new med. I love what you are doing so please never stop ❤️", "tchiii": "Hi, I'm Maureen, from Clermont-Ferrand in France. I'm a proud mom and I have a lovely husband and cats, and fish, and axolotls, and geckos, and... giant African snails! Sorry for my english it's school grade. I have found your ig by hazard and I'm happy. I'm a fat girl who have a lot of problems to accept herself and see women like you help me a lot! So, thank you!", "quainquie": "@fatgirlflow Hi, I'm Martina, from Switzerland. Last year it was a particularly challenging year for me. I always fought against myself, my body (which took too damn space), my mind (I wasn't intelligent or brilliant enough), my nature (I have to do this and that to be accepted by others and society more in general, even if I like books and hot cocoa and hate discos). But after getting my university degree things got worse: I realized that I believed that earning a top degree would have given me a feeling of being important, worthy, in a highly demanding society. It didn't, so I decided that I needed to focus on myself, not on things, to get better. I started looking around for people I felt connected to: and I found you. Your kindness and energy are amazing, and your message of worthiness just got me to tears. When I look at you I see beauty and confidence, and you became such a role model for me. Most importantly (I hope it is not too much): you show me that big girls can love and be loved. I always had boyfriends (few) that told me that \"I was a good person, sadly not beautiful\". Now I understand how mean they were, because you showed me that beauty and brains belong also to us, the fat people. Thank you, Corissa! ♥️", "anjajelen": "Hi! I'm Anya, an aspiring plus sized fashion blogger from Ljubljana, Slovenia, a small European country that is still struggling with accepting plus people, but one step at the time some people are changing that. Thanks for sharing all the positivity with the world, love your IG!", "sunsets_and_next_days": "Im Lindsey, Love this account!! Wish I was brave enough to make my profile public. You are awesome!!", "kirakirst": "Hi I’m Kirsten and I’ve been following you for years after I found you on YouTube: the first fat positive person on there I had seen who talked about stuff I liked and taught me so much when I was very very new to the bopo movement. I continue to follow you because you absolutely radiate light. You are most always smiling, but when you aren’t I’ve appreciated the raw vulnerability you’ve allowed the internet to feel with you. I’m a SAHM who used to run a blog and I’m thinking about starting it back up because I just got released from therapy yesterday and have a new lease on life! Fun fact about me (I guess) is that I’m polyam and my partners are meeting in the flesh for the first time in 2 weeks 😄", "sincerely_rad": "Hiiiii, my name is Mary, I like your body-positive messaging and good, fashionable, queer vibes. Makes me happy. I’m a dork, artistic and happy. I’m a good friend.", "coolghostboy": "Hi I'm Charlotte!!!! I followed you because I need some beautiful fat people in my life for inspiration. I struggle a lot with image and relationships with food but you've always showed me big is beautiful!!!! You're literally the cutest thank you for the positivity in my life I've so desperately needed :)", "nerdinplussize": "Hi! ✨ I'm Minnaleena, a plus size fashion designer and influencer from Finland. While in fashion school i found you among other fat positive bloggers in tumblr and something clicked! Your content has really helped me look at the world critically and start being more open and honest abt myself to others. Do thank you! 💜💜💜", "elvisbabygirl": "Adore you and can't wait to read more on your website. Are you in LA? Need an assistant? Dream job!", "deesview": "I'm Datondra, nice to meet you", "rachelgaussoin": "Hey Corissa! My name is Rachel and I’ve been following you for a very long time. I love following women who are confident and love themselves especially plus size women because I’m trying to learn and grow from y’all ❤️ in time I hope to love myself and all it’s fluffy glory. Thank you for all you do 😍 and tell your love thanks for all they do too!", "cpereida21": "I have a little girl crush on you!! Lol I just love the confidence & the awesomeness that come out of your picture. Seeing your post is a great reminder for me to know it's ok to love the way we look .. my name crystal from chicago, I'm a mom & a wife just trying to show my kids it's ok if you do a little dance to put on your Jean's lol", "mitchell_perkins": "omg ur so beautiful !!", "queenlaurenf": "@fatgirlflow Hey! I’m Lauren, I’m from Alabama. I’m here because I love your positivity & confidence, I love how unapologetic you are for being yourself. I hope for some of that charisma and confidence to rub off on me! You’re beautiful ✌🏻❤️", "tizzyliz23": "Hi there, Corissa! I'm Latisha. Fun facts about me I have a pet rat and a theatre degree I don't use. I love fashion and movies and I paint every once in a while. You're one of my favorite people that I follow. I'm honestly so happy whenever I see you post here or on YouTube. It's just so refreshing and encouraging to see someone who looks like me just being herself. You're super adorable and inspiring and informative and a bright spot on my feed 💜", "kcbrandi": "👋🏻 I’m a FL born, IA raised girl now living in KS. Had weight struggles my whole life. Lost 50 pounds over the last year by trying to focus on my health, but a bigger and less measurable part of my goal when I started was to be able to accept myself whatever I weighed. That’s where accounts like yours come in. The more women I see loving and accepting themselves and their bodies, the more normal it becomes for me. And I start to think I can too. It’s a work in progress. Seems that all women are supposed to pick themselves apart. It’s refreshing to see the opposite ❤️", "ajbixauthor": "Hi, Corissa! I'm Amy. I'm a gender fluid fat human, who uses she/her pronouns. I stumbled across your IG and found it really body positive and inspiring and validating. Your posts often remind me that, hey you're fat and fat is okay. You inspire me to be brave and do hard things. I went to a queer event in nipple pasties in June. And a few weeks ago when Lane Bryant was doing a sale I bought a bikini like I've always wanted but never dared, not even a tank top one, the kind with itty bitty Barbie-style boob triangles. So I like coming here and seeing your posts. I like the posts of you and your partner together. I like getting to know you because y'all seem cool and goofy. I like finding new resources for clothes that aren't just random shit I picked up off the clearance bin at Walmart because I'm unworthy of anything more costly than. $5 (I'm getting better!) And navigating plus size clothing is a nightmare I don't have time for. If, part of what we come here for is a platform of things we'd like to see, some places that have less femme-girl clothing, or clothing resources for plus sized non-binary people. Because I don't imagine I'm the only one struggling with this!", "plantsimp420": "I'm Natalie, a college student. :) I follow fatgirlflow because as a plus size young adult I need more body-positive and especially fat-positive representation and positivity in my life! Gotta unlearn all the bullshit somehow... ;) Looking forward to buying FGF tees with my next paycheck- #treatyoself", "chouettedebruxelles": "Hi, I'm Sieglinde from Brussels, Belgium (once dubbed 'the hellhole') by that creepy guy living in the White House. I have grown up with an alcoholic and mentally abusive father. He was angry and bitter and piled his hurt onto everyone around him. I grew up feeling like I was never good enough. I hated my body because it took up space. I just wanted to be able to hide from everything and everyone, because I felt I just wasn't worthy. But being 1m81 and big, it's kinda hard to hide of course... Turning 30 at the end of 2016 changed something in me. I realised I wasn't the failure I always thought I was. My father had been dead for a couple of years and I was finally ready to start letting go of the pain and the self hate. I started looking for people who inspired me on social media... And I found you! (I believe I first discovered you through a drawing the beautiful and talented @full_of_freckles_illustrations did of you). You are so raw and honest, and your smile is just one of the most beautiful things. Thanks for being one of the people on my path to self acceptance.", "wiisabby": "Hiya 👋🏽 I’m Jaleesa! I’m here because I’ve made it a point to fill my instagram with beautiful, inspiring Plus Size bloggers like yourself. It helps me with my self confidence and helps me be real with myself in this social media world. I’m a single mom of three struggling to be happy. I dream of doing what you do, but have always been scared. Love your page, keep inspiring 💜", "dieannabee": "Hi my name is Diana and I actually discovered you through @comfyfattravels posts. Which was brought up in a podcast I was listening to. (I wish I remembered which one) I super enjoy both of your ig stories. I just love seeing fellow fats living joyful lives and you two are the freaking cutest.", "steph.a.garcia": "Hi! I’m Stephanie and I’m a new follower, love your style! I work at an LGBTQ+ Center in California and I’m always trying to find ways to diversity my feed and find amazing accounts like yours. 💕", "jvangsness": "I'm Janyne.... trying to be body positive. I'm pretty good at building others up, but am having a hard time with myself. I'll get there eventually, thanks to others like you, @vintageortacky and @margotmeanie", "nique1995": "I’m Dom! I’ve been watching you for at least 2 years (maybe more), I love your personality, energy, and that I can come to your channel and gram knowing it’s a safe space free of diet and weight loss talk (because honestly not even body positive channels are free of that anymore)... fun fact about me I’m a musician I play multiple instruments and my goal is to own my own motorcycle one day ❤️", "etc.treats": "I'm Emily. Recently found you and am loving your posts. I have multiple chronic pain conditions and really struggle with trying to lose weight; would help if I could find exercise(s)I that didn't exacerbate the pain... I'm blessed with a fianceé who loves me, not just my size. Thank you for your confidence and positivity. Will definitely have to check out your merch! ❤💋", "livinglaurenslyfe": "Also, I’m Lauren. I’ve started using my IG as a way of self-acceptance and self love. And following instas like yours that motivate me and remind me I am worthy is why I’m here!! Interesting fact is most of my family is Taurus men and I’m the only Taurus woman 🤷🏼‍♀️ haha super random but ya!!! Keep doing you boo!!!!! Love your stuff 🤗❤️", "kimiecakez": "I just live following you because you Are brilliant, adorable, and positive!", "jbeoin": "Eeee! Love introduction posts! 😃 I love both your accounts that you mentioned and love seeing all the joy and full, beautiful lives of my fellow fat folks! It's such a wonderful thing to see on my feed each time. Oh, also, hi, I'm Jessi. 😄💕 An interesting fact about me is that I have been called the hamster whisperer because of my affinity for the tiny fuzzbutts and my intricate creations for them out of cardboard and craft sticks. lol 😃", "callmecorgs": "LFK fat girls 4ever.", "ailene.silence": "Hi corissa 💜💜 it’s ailene, a long time follower and fan from tumblr then Snapchat and now here. You’ve given me tons of inspiration and at times personal advice. I’m a piano teacher and I’m also fat 😋", "yogashrinkmom": "This post excited me because I'm a fairly recent follower of your account and I keep thinking to myself, \"who is this lady? \"...lol. I'm Inez and about two years ago I was \"born again', but not in a religious way...lol. That was when I essentially decided to adopt the mantra, \"fuck it\", I was going to make myself a priority in my own life. I was going to find myself and essentially find a way to be kind to myself and to care for myself the way I do for others. I've grown in confidence and strength - I'm still working on a whole lot of other aspects of me - and I purposefully seek to find confident women like yourself to keep me going on my path. So thanks for the inspiration!", "emmalinesh": "Hey Corissa! I’m Emily and I adore your photos. I’m so impressed with and inspired by your joy and beauty in every photo you post. I’ve always felt beautiful but never believed that other people saw me that way, especially when I see pictures of my own fat body. Thank you for giving me and other women an example of fat girl beauty. Representation matters so so much. Question, I’ve seen your modeling photos at impish lee and I wonder how does one get into modeling? I’ve always wanted to try it and I’m absolutely clueless.", "annathemostawesome": "Im a 31 year old from Sweden who desperatly needed to see people of my own size on social media- so tadaa! Thats why im here 😍 a couple of years ago i just got so sick and tired of always being ashamed of my body and the hate i gave it, so i just told my self to quit that shit and it worked! Ive never looked back (but sure, i still have bad days and thats where the whole bopo movement on ig comes to the rescue!) 💚💙", "carousel0909": "@nicole0700 this is who I was talking about. She’s a badass 💖", "jarose2589": "Hi 👋 I’m Jen and I’m a fellow fat babe! I am here because your confidence, intelligence and over all positivity are something I appreciate and need on the social media’s! I appreciate everything you share and bring to what I am viewing whether I’m scrolling through IG or watching a video. Fun fact? You’re one of what my girlfriend calls my “online wives” because I’m always watching your videos and showing her your beautiful pictures!", "casey_sunshine": "Hi! I’m Casey. I followed you because of a recommendation from @shesallfatpod, I’m pretty sure. I like following you (and other gorgeous body positive folks) because it’s important that my instagram feed contains real people, and people whose bodies look like mine. An interesting fact, I guess, is that I am an ordained Lutheran pastor and it’s important to me that the people I care for (college students and other young adults) know that they are beloved just as they are, and that their bodies and their choices are theirs alone.", "_kjh93": "Hi! I’m Kelly, I’ve followed you for several years now to the point where I’m not sure how I found you? Tumblr? YouTube? Who knows 😂 You’ve been such a great source for positivity for me. You’re funny, real, and relatable as fuck. I love to keep people who promote things that make me happy on my feed. I’ve never really understood when people say Instagram negatively effected their self esteem, if anything this community brings me more confidence. I graduated a little over a year ago with a degree in Women’s and Gender Studies, shortly after I was in a wreck that totaled my car and injured my back so other plans are on hold while I work in retail.", "yumaratz": "Watch your YouTube all the time and love when you post photos. Please keep them coming!", "biggirlshow": "Hi Corissa! Loving both accounts! We're a team of all female identifying creatives working on a comedic web series with a confidently curvy female lead. We finally put our foot down and said, FINE! WE'LL DO IT! We're also working on an interview series with bopo advocates so if you're ever in NYC hit us up!!", "fringeish": "I (she/her) am a sociologist, my focus is privilege and power. Just moved to Toronto from Honolulu. My 3 year old son is a cancer survivor, so I have been dealing with the mental and physical fallout of that for the past 2 years. I am fat and loved by others, trying to love myself. Love your account and your style!", "semi_kind2afault": "Hi I'm Krystin! I grew up being dressed as a boy because no one wanted to find girl clothes that fit me, so I've only started finding my feminine side about 5 years ago (I'm 30 😌). I love this page because you're proving that all of the fashion statements I grew up thinking weren't for me are actually cute af on us! I've recently started being super comfortable with tight shirts and I absolutely love bikinis!! I'd love some input in raising my kid to love her body! I think I'm saying the right things, but she still has a lot of issues with it. I was hoping my confidence would flow over to her. She's only 11, so maybe she'll get a little better in a few years? 😥", "olivia_martin_8": "I’m Liv, I come to your page A LOT!! You help me so much with feeling confident about my weight and how I look. For so long I felt guilty for having any confidence because of my weight and I have recently started to accept myself the way I am and you have helped me with that a lot. Thank you", "mrpetrin": "I’m Michelle. I found you through a podcast with @chr1styharrison . I am not (yet) a dietitian, but I specialize in eating disorders & nutrition. I believe in (all) body (and food) positivity. I love seeing your posts which normalize bodies that don’t get enough time in the spotlight. 🙃", "margotmeanie": "Hi, I’m Margot. I’ve been crushin on you for years and think you’re pretty keen. I love that you’re about that building each other up life. Random fact, I can do a triple loop with my tongue.", "lindseyfellrun": "hi i’m lindsey, i’m here because i’m fat and bitter. i want cute clothes too dammit.", "kristi__rae": "Hi! I'm Kristi a newish mom from Vancouver 🇨🇦 I was bullied and struggled with my weight my whole life and am slowly working towards a healthy balance of acceptance/love and health :) I discovered plus size accounts (and yours!) On Instagram and it changed my life! Seeing these bodies as beautiful helped me feel better towards my own ❤ I also discovered plus size sites to buy clothes that were actually awesome 🙏 fun fact, I saw Titanic 17 x in theaters!", "typhoidtaylor": "Hi I’m Taylor! I follow you because I’ve really struggled with self confidence and you’ve really helped me gain a lot of that. I’m a non-trad college student at KU (aka I also live in LFK)!", "sammicassel": "Body positivity has significantly changed my life and I now look to Instagram for that daily dose of badass women who don't give one fuck about anyone's opinion of them because it reminds me that I'm allowed to be strong, confident, have a voice, and take up space. I've found that reminder in you and your account. Thank you for being a shining light, you're amazing!", "jbrichey": "I’m Juliet. I’ve struggled with my weight off and on my whole life, but have gained about 30 lbs in the last 3 years due to depression and anxiety and some unexpected major life changes. I am finally in the upswing now I think - but am struggling to be “ok” with who I am now in my new fatter body. Some days I do better than others. I’ve been following you for at least 2 years I think. You e made such a positive impression on my life. Thank you for being you.", "karenandher5cats": "Heya, long time sub on YouTube. I live alllllll the way up in the mysterious Canada. ( east coast). I love kitty cats and because of your wonderful channel and confidence. it has helped me step out of my own head and low self esteem. to finally give myself the acceptance I needed to rock clothing. Thank you for putting yourself out there into the internets to help people like myself who struggle with how they look/feel when wearing clothing. ( or nothing at all ) Xo", "nerdy_nettie": "Hi!! I’m Annette. I don’t have a blog/YouTube/and so on (power to the chicks that do!) I’m trying to keep my identity while wrestling with PTSD and panic disorder (I don’t say that much because I feel it can cause eye rolls lol). My husband and I have been in love since we met in college at 18 (now 33) and he was female. He has transitioned and we have our little love. She was diagnosed with a catastrophic illness so we pour all our love and resources into her. Which I do with all love because I ADORE her. So I don’t post much about make up or clothes etc. because we just can’t afford those things. But we afford TONS of love and I’m happy as a queen! Can’t remember how I found your IG but I appreciate all your posts and insight! ☺️☺️💕🌈", "_ladypictureshow": "Hiya - Mariah here! I love your aesthetic and everything you represent. I work as a developmental disabilities advocate and I'm from a super small town filled with even smaller minds. I'm trying to change the way the people in my life see fat babes by wearing what I want, how I want. Also a huge fan of your tattoos - I just got my sternum piece a few months ago and I love showing it off 😍", "lissethc13": "Hi Corissa! My name is Lisseth and I’m from Texas! I recently discovered your page and I’m so happy to see all the positivity! You have given me more confidence to not give an F about what anyone thinks! If I want to wear a two piece I most certainly will 🙌🏽❤️", "the_other_hillary": "I’m Hillary! I’m learning to love myself exactly the way I am; bipolar, anxious, angry, cutter, fat, and SURVIVOR. I tell myself everyday the saying from The Help: You are Smart; You are Pretty; You are Important. Fuck the media. Fuck society. I am who I am and that’s beautiful.", "foreveryourfatfriend": "My name is Haley. I live in TN in a somewhat large city. I found you the first time when I joined tumblr. The day I started instagram you were the first person I followed. I work for a plus size retailer, which I consider the frontlines for helping women change the way they feel about themselves and their bodies. I have also been trying to get rid of my comfort zone by doing, wearing, and saying things I want to but never would have done 2 years ago. Thank you for helping me on my journey. And for helping me to be ready to influence others.", "iamlauriesomma": "Wow girl. This pic is insanely gorgeous", "lindseyfarnsworth": "I'm Lindsey. I'm new here and found you because I was searching for bodies that look more like mine and who owned it! Even within the plus world I feel like I mostly see hourglass shaped women and that's decidedly not me. I've always been a big girl and carry most of my weight in my belly but that hasn't stopped me from loving fashion and living life. I'm a recently-back-to-work mother of 4 and have seen my confidence take a nose dive in an office full of very thin women constantly dieting and talking about dieting. I wanted to seek out a healthier (ahem!) community for myself to combat the feelings of low self worth I'm struggling with (it seemed a little easier to be body positive when I was a stahm interacting mostly with people of my choosing!). I also sought out anti diet, body positive social media because my daughters are built much like their mama and I want to be a good example to them and teach them to honor their bodies. Thanks for all you do to promote positive self images!", "msbrat411": "It took me almost 50 years to accept myself. 2 kids and 2 grand babies later I think I’m finally there. People like you made it ok for me to be me. Growing up in the eighties there was no platforms like this. I’m thankful that young girls and women see all different bodies out there. So THANK YOU.", "mindful_economist": "Molly, Ithaca NY, phd student. Love your account. One day I too will (hopefully 🤞) feel comfortable enough to wear a crop top in public! 😁💗", "lizsutherland7": "Hi, I’m Liz from Halifax, Nova Scotia. I follow you for a plethora of reasons but the main one is you always make me smile :)", "disgruntled_avocado": "I’m Chloe! Interesting fact: I can be a human water gun thanks to the gap in my two front teeth. I followed this page because I was having a really tough time loving myself- even just liking myself. Society tends to push certain standards on us; even when those around us don’t, and they love us for who we are, it can still be so unbelievably hard to accept our own bodies. Your page has helped so much- there’s so much love and play and beauty and strength. You’re one of my heroes!!!", "jezebelexpress": "Love this! I’m Jezebel Express, I’m a dancer and burlesque teacher based in NYC. I believe glamour is for everyone, and I’m trying to use my platform to help other people feel fab (esp marginalized people who have been told that they don’t deserve fabulous). Also, I live in that Fat Bitch shirt, so THANK YOU! ❤️", "killersfann": "I’m Kaylin. I’m from Texas and I love thrift shopping. I love your page and YouTube channel and everything you stand for. You and Jay are awesome to watch. Thank you for doing what you do.", "theejessicarobin": "Love this! I follow you to KEEP my confidence. I’m Jessica. I don’t really have a lot of fat friends (aka only one close one) so I rely on social media for that connection. I love seeing plus size babes rock amazing, fashion forward outfits and not give a fuck about what the haters say. And I just love how supportive the plus size community is. I wish it was everywhere!", "mollyp1969": "Hi! I’m Mary. Soon-to-be 49 years old (Aug 9) and like @xsydmoorex I am filling my IG feed with more plus size women so I can see ME represented and learn to ditch the diet culture. Fact about me: I love, love, LOVE to dance. Especially ballroom!", "rachel.danae": "Hi there, I’m Rachel! I’m a fellow lover of all human forms and I think you are freaking awesome! I found your IG after hearing @themilitantbaker speak in Tuscon and being like, “damn this is a refreshing worldview.” It has been wonderful realizing how many people like you are out there breaking down the body hate prison we’re cultured into! Keep shining! ☀️", "mandy0678": "My name is Amanda, and I'm here because I love your style. I love your confidence! You inspire me to wear things I wouldn't normally wear!", "angelaalba_": "I’m Angela and I create art about body diversity 💗 I’m here because why the hell wouldn’t I be?! You’re awesome😁", "lovelystarlite": "Valérie, Québec City, learning to own my body because of accounts like yours! Keep being fabulous and spreading the word! ❤😘", "adamsel_in_this_dress": "Hi, I’m Ann! I love your Instagram and think you’re adorable. I recently started a plus size style blog, so thanks for mentioning the #fatgirlflowfam tag!", "chel_of_ra": "Hey Corissa, I'm Rachel :) I can't remember how I originally found your IG, but I'm so glad to be here! I find your way of life to be very refreshing and inspiring. I plan to order some goodies from you soon. All your posts are so positive and lovely 💜❤️💚", "bubblegum_bxby": "I love you so much! I’m here because I feel like so much of the bopo community can veer towards being very negative, one sided and judge mental orrr completely the opposite where it’s sugar coated non political self love content that has nothing to do w intersectionality and bopo. And I feel like you do such a great job finding a balance where you do great fashion vids but also really talk about important issues dealing with not only the bopo movement but also intersectional feminism. And you and j are also just absolutely hilarious!!", "tinsleymj": "Morgan, currently in Emporia KS but from the Kansas City area, love that you’re someone out there that looks like me. I have a channel on youtube that is primarily makeup related called Tinsley Trials", "tericarl": "Helloooo! I’ve recently made my insta public! I’m a single mom fighting for my kids. Tall plus sized theatre type who is putting her life together and just wants to be fucked on a regular basis by a person who will help pay the mortgage. Plans to open my own business before I turn 36. And I’m hilarious as hell. 😘", "lifeofthehydes": "Hiiiii!! I'm Jaime ✨ I'm a wife, mama, hairstylist/salon owner, fat babe, quirky, ecclectic and am here for aalllll the positive vibes! I've always struggled with depression/anxiety/and body confidence and this page is a nice daily dose of good vibes! Thanks for all you do for us fellow big babes! XOXOXO", "heartflood": "Hi Corissa! That is a lovely name. 😊 Mine is Erika, and I'm here because I'm done waging war with my own DNA. I love seeing your posts so much!", "xsydmoorex": "My name is Sydney!! I’m here because I made it a goal to follow more plus size folks this year so that my insta feed will be full of people who look like me. Fun fact I’m in college majoring in women’s studies!", "wander.free.and.queer": "Were Danella and Allie! We are two plus size queer women who are traveling full time in our RV! We’ve loved following your journey and are excited to be connected through the vast IG world! We are learning about how to be more #bopo as we navigate life on the road! 💪🏼🏳️‍🌈💪🏼", "victoriadonelda": "Hi, I’m Victoria, your child.", "sillymonkeycookiecompany": "I love your posts and admire your confidence. Your feed always has something nice to say and I’m so inspired. I’m Dulcinea. I live in Tampa, but am a Texas native. I’ve struggled with my weight my entire life, but got worse about a year or so ago when I “accepted” we couldn’t have any more children (we lost our son and only child in 2013). I’m learning to accept my flaws and just be. We also run a custom sugar cookie company where it’s my hope we are honoring our son with every cookie we bake and decorate.", "thatcurvywoman": "Amazing pic😍💜💖💞💕💙", "bam.peesly": "My name is Alison. I came here because I love your tattoos, and I stick around because I love your point of view.", "heyseantaylor\nVerified": "Verified", "superdanielleworld": "I'm not new here, been following for over a year for sure 💜 but I'm Danielle. I mostly followed you because you were the first youtuber I saw that had a body similar to mine. I stayed for your personality and all the fun clothes! (& bikinis of course)", "ehwhysmom": "I'm Michelle and I want to look at myself in a mirror.", "roseybeeme\nVerified": "Verified", "fatalchemy": "@fatgirlflow Hi!!! I am keeley, fat girl since forever and ever. Just here for community and to cheer on other round bodies navigating a fucked up thin world. I am a restorative yoga teacher, I help women love their bodies a little more through movement and breath work. Thanks for being a strong voice and role model for fat girls.", "snazzyflab": "My names Mal, I've been a follower of yours for a few years, I came for the fashion and stayed for everything else you represent! Love the social dialogue, and the anti diet conversations I've been able to start from help from fellow fat babes in the fgf fam. An interesting fact about me is that I can do the splits?? and bake some fierce cookies.", "kasey_in_wonderland": "I am a somewhat new follower that loves what you represent! My name is Kasey and I’m also a new(ish) plus size woman due to circumstances but I’m learning each day to love the body I’m in and not shame it for not being what it once was. I also love to travel and have done some solo international adventures that have also helped build up my single woman confidence 💕🙌🏻 Your posts are inspiring!"}