{"adamdonnie72": "Definitely delicious", "lclavol": "This might sound dumb but what does it mean to be acceptable fat?", "godfearingman6060": "You look amazing my love, wish u were single, I would love to no u better.", "va.va.vieve": "This really struck a chord with me. I definitely don’t fit the mold of acceptable fat. The only time that I feel like my type of fat is acceptable is when I say I’m trying to lose weight. That’s when people get encouraging and accepting, even if it is fake. Until then I’m less than human, if people aren’t just looking straight past me it’s only to express how revolted they are by my very existence. 😢", "szzsuuzs": "Thank you! You're beautiful!", "glendac77": "I got my first 2 piece with the encouragement from your posts and @comfyfattravels. I've yet to try it on. In scared to death. I know I should just wear it and enjoy..... how did you just do it and was you nervous at first too? Thanks to the both of you always giving us bigger women the words we need to hear. Thanks in advance if you respond", "asanzie": "Appreciating this self awareness! And that red top with your tan!", "queen_b7976": "Alot of people find me unacceptable fat because I dont just have a big butt and hips. I dont have the fat girl flat tummy. I have a divided fat girl belly(rolls) but after 4 c-sections(3 of them up and down) I probably never will have that flat fat girl belly but I'm ok with that now. I have 4 kids who love me and an amazing man who loves and appreciates me just the way I am and even with my belly I look pretty damn good!!! U are inspiring girls and women across the world...keep it up girl!!!", "alexisinbklyn": "Where can I get those leopard bottoms. I’m having a leopard print moment this summer.", "lindseylightensup": "I will think I’m acceptable fat until I get in the dressing room and realize the trendy fat girl clothes aren’t designed for my body because I’m not hour glass, my boobs aren’t huge, and I don’t have hips. So pretty much all of Lane Bryant’s and torrid’s clothes look like shit on me. 😩", "ness_tex": "I’d love for you to elaborate on this post. I’m not exactly sure what you mean by “more acceptable” and why do you feel this way?", "smarterthanyouraveragesprinkle": "I feel the same way. I've thinking about the privileges that I carry with my body type. I've been told I \"carry myself well\", which typically means \" you're fat but not like those other fat people\". Yeah not really a compliment if it puts down others.", "eahl176": "First of all, you're so beautiful. But also, I have to thank you for your unabashed confidence and advocating for inclusivity and acceptance of all body types. After years of hiding major self confidence issues and dealing with them by avoidance and wearing whatever hid my body the most, I bought a two piece bathing suit for the first time today. I was absolutely dreading how I was going to look in it knowing how much I hated myself in all my full coverage pieces that I hadn't worn in over 5 years. Well I tried it on and have never felt more confident about myself, not just my body, but myself as a person for having the courage to go through with this. I have deprived myself of going to pools, lakes, fully enjoying trips, for the past 5 years because I have been so terrified of people seeing me in a bathing suit. How ridiculous is that? And now I have a bikini that shows the part of my body I'm the least confident about and I love myself more than ever. How is that even possible? Honestly, without your influence and what you stand for I would've never discovered this for myself. Thank you so so so much.", "glitteratwork": "Very brave to discuss privilege and the implications of privilege I struggle everyday with my image because I am overweight but also because I am a black woman and now I see my facial features such as full are hyper sexualized and I’m told I’m taking provocative pictures simply because of my features????? It’s a crazy time to be alive I tell ya!", "west_marin_yenta": "This is the most thought provoking thing I’ve read in ages. I’m going through my own weird time as I’ve had a double mastectomy and opted out of reconstruction and it’s left me missing my before, “privileged fat body awesome tits” in my now my current body. Food for thought for sure. You are awesome.", "devilkhan2599": "Sexy girls sexy body 😍😍😍😍😍😍😍😍", "xenathediva": "@slayinginbrooklyn SimplyBe has some cute ones! https://www.simplybe.com/en-us/products/ladies-swim-bottoms/p/TY048#v=color%3ATY048_LEOPARD", "ffsnotanotherblog": "yasss!!!!!", "khaleeqbacha": "V nice", "sinimannerstuff": "Amazing honesty. Like that 👌👌", "transforming__me": "Hey! So as a fellow fat girl... I’ve never heard of fat privilege... what does that mean? In what ways has your body been advantageous to you in ways that other fat people haven’t experienced? Thank you for educating me! ☺️", "heath_bar15": "So like it amazes me how you’re so confident! I’ve been trying really hard to get comfy with my body but you look amazing and happy. Do you have any tips?", "missmegandaniel": "Thank you for this mama! It's a meaningful discussion to have for sure. I think we all need to be willing to examine our own privilege and highlight it so others have a chance at acceptance. Go girl?", "trans_fat_alchemy": "Yes, it’s very interesting. I follow many different kinds of body positivity and it have noticed that it’s “ok” to be fat if that is the only thing that’s “off” or it’s “ok” to have hairy-pits if in all other ways you look like a model. It’s like we are allowed to get one thing “wrong” and we are considered ‘quirky beautiful’ but more than that and it’s too much; I am yet to see a gloriously plump goddess with a stray body hair - and this kinda makes me kinda sad.", "ibullit23": "So there is a thing as \"acceptable fat\"? How about just \"acceptable\"? Fat, thin, muscular, whatever you call it (labels are bullsh*t), as long as you're breathing and have a heart, YOU ARE ACCEPTABLE! You go, gurl!😉👍", "pamorous": "Ok girl you are ON IT. Srsly thank-you for all you do with your presence and posts like these that are hard. I have rolls and they’re not the “acceptable fat” kind and I can’t for the life of me try and justify ever showing my belly (do I even have a belly button?), but love seeing others fat bellies and bodies and loving themselves so maybe just maybe I can try and at least be okay with my “unacceptable” one🤗 so thank you again🙌🏼😘😘", "rae_b_h": "I am only 5 ft and 240 and i look like a round ball! Ha! I want to wear a bikini so bad but I just don't think I'm there yet! Maybe soon... I love following you and your posts are so fun! Keep it up!", "zoecocobeauty": "Omg YES. I’m 100% happy that I’m a pretty proportionate fat girl, but as a kid I didn’t know this was even a thing! I tried making friends with other fat girls, hoping to make myself feel better about it but a lot of them didn’t like me. I didn’t make any sense until a popular girl in high school scorned me bc her boyfriend (who I wasn’t even interested in) made a pass at me. She told me, “the only reason boys even talk to your fat ass is bc they all want ed to bang a Hispanic girl with huge tits, but they won’t want to be with you.” That shit scarred me, but honestly with a lot guys, she was right. I’m still sexualized today for it. It’s “ok to be fat” to some people if you’ve got curves or your ethic. It’s the dumbest thing I’ve ever heard. Fuck that, We’re all beautiful no matter what. I’m glad women of all types of lumps and bumps are coming out of hiding, y’all deserve just as much praise and love💙💜❤️💛💚", "rochebrice": "😍😍😍😍", "titty_mcboobles_": "@angbomb @mynamesaretaken @mrs_hortorti this is exactly what I neeeeed. Sunbathe and stay cool without having to actually swim 😍", "somewhere_under_the_rainbow": "These conversations are so important to be having- the only point of having privilege is to leverage it for others who haven't been afforded it as their birthright. Thank you for continuing to speak truth to power when possible (& for continuing to bless us w pool photos)", "mancubandmommies": "At 4’11” I am not an acceptable fat. Especially after having my son almost 2 years ago. I am proportionate I think but see all the women I follow on here and who I admire as beyond beautiful and strong and wisssshhh I could see that in myself.", "rikalyons": "Idk if you’ve ever answered this or not but do you ever wish you were smaller ?", "sadierex": "When I was 18, back when livejournal was a big thing, I would join the \"hot or not\" groups for bbws. The men LOVED me and the women hated me, I remember at the time it hurt because I didn't understand my priviledge as a pretty, young, smaller \"acceptable\" fat (I was maybe a size 18/20)... I felt like I didn't belong anywhere, I was too fat for \"normal\" people but too small for fat people. I'm 32 now so in that time I've since learned about priviledge, gained confidence (I had none at 18), discovered body positivity, etc... and realized that for many of those women those groups were a haven where they could get positive attention for the first time... and while it sucks I felt hurt by them, it was totally understandable that they weren't thrilled with me coming in and how the men responded to me because I was an acceptable fat. Even now, I'm a size 24/26 and a 3X-4X depending on the thing... and a lot of days I don't feel like an \"acceptable fat\", especially as I gain in my stomach... but I still recognize I have so much privilege as a white, conventionally attractive, plus size woman. Not as much as I might have were I still my pre-pregnancy size 20, but so much more than others.", "ehwhysmom": "How do you start acceptance? What's the very first step? Wanting to know because I have zero good feelings about myself.", "reader.68": "Thank you for saying it like it is, there is such a wide range of us; it’s nice to know that you get it. ❤️", "11_usagi": "Yeh one thing for me with some fat women who talk about wearing a bikini confidently seem to have flatter top portions of their stomach whereas I have a bulge. So sometimes I don't feel that would be tret the same. But we're all different and we all have something different to bring to table. You bring representation to lots of things, the things you don't someone else does. But any representation is good!", "jokayxo": "I strive to be like you", "blackcoffeeandpaperbacks": "I loved this post! The honesty in it is so apparent. I think acceptable fat is a true concept as is attractive fat. Reading other comments about people who aren’t as femme fat really resonates with me because I gain weight in my belly and not my butt which I find always clashes with my femininity. Thank you to you and @comfyfattravels for your amazing work. ❤️❤️❤️", "bria.summer": "I love you so much.", "kt_and_the.crew": "This photo AND post is everything. Thank you", "jordyn_lynn25": "Holy shit thank you!! This is so important not just to me but for everybody. I fucking love you and this.❤️", "lesbeauxmetaux": "Love that combo!", "missjessicalorena": "Can someone clarify what B/D etc bellys are? I think I missed that part.", "kztelynn": "Do you think it’s a bit fatphobic when people say things like “I wish I was as confident as u!” ?? Because in a way it’s like they’re saying “Wow someone as big as YOU is confident? IMPRESSIVE!” But then again fat people get so much shit about being fat that it kind of is admirable that we’re still confident af while dealing w/ negativity from society.", "cedar.willow": "I appreciate you! 💛💛", "shotsofglitterr": "I feel like up until a couple years ago I was acceptable fat, maybe I still am a little bit. As I gained more and more weight, I think I finally lost some of my “good looks” and people started realizing “oh wait, she is fat” so now I don’t get that as much. I have always been “proportional” where no one part of my body seems to take on weight more than others, though I am heavier on the bottom than on top. I guess what I’m saying is I understand the acceptable fat thing you’re talking about 😅", "kristen10271973": "I thank you for making me feel ok, not great, about my body. You have such a positive body image!!", "simoneregina_": "I'm glad you're so open about this!", "brandi_leanne": "You've encouraged me to order my first bikini. As a 5'5\" 350lb woman I never thought that I'd ever want to be seen in a two piece bathing suit. I was always made to feel that due to my size I needed to wear a freaking swimdress because that's all I could seem to find in my size. Well you know what....I don't care what anyone else thinks. I'm fat, i'm healthy, and i'm happy and that's what matters.", "bsummerbeauty": "Tan goddess", "blackbirdsingxx": "Thank you so much for saying this. There are so many body posi people who forget about fats that don't \"fit in\" and it's super frustrating. I'm a bigger girl but I have small boobs and a small tush. I also don't wear makeup and try to dress cute the best I can with the paycheck I have. Just... thanks for shouting out. It means a lot ❤❤❤", "kshellrude": "What is an a belly b belly c belly or d belly? Or maybe I made the first two up? I just saw someone posting about their b, vs d..... I have a belly. It's being. Tha", "torreshunny": "💋❤️", "_xx.beautiful.disaster.xx_": "I've only been following your account for a short period of time but I've been here for quite a few posts and I feel the need to tell you just how much you inspire me. I'm only 17 but I've been fat my entire life and that has really affected the way that I view myself, I like to think I am beautiful and worthy just the same but my insecurities and the expectations of society still get to me. I some how let it get inside my head that fat and beautiful are too adjectives that don't coexist and that because of that I won't find the love that I deserve. But following your account, seeing your confidence and your beauty and your happy relationship, has given me faith again. I'm trying to work on my body, lose some weight, just to feel healthier but I've also grown to love the body I'm living in and see the beauty of it. So thank you, thank you so much for the positivity, self love and inspiration that you display. Thank you.", "katerichel": "Also it’s just crazy how much people think numbers matter. You and are the same size with an 100 pound difference due to height and weight distribution, and does that make either one of us better than the other? Not at all. Every woman is great just the way they are and if they spend time worrying about looking a particular size or obsessing over pounds then life will pass them by (as you’ve said before). I’m so glad to have found your account! ❤️", "nikky22204": "I've learned so much today: fat privilege, B/D bellies. Thank you everyone for having this conversation in a respectful way. Very refreshing! Stay fierce ladies 👸", "carriesheeshee": "Hearing you say this means more than you know! I try everyday to love my body and regardless of the journey I am on, if I lose weight or if I don't, my main goal is to feel comfortable in my own skin. I often times find myself looking at the pages of people like you or the beautiful @tessholliday and wondering what I am doing wrong and why I can think you all are so beautiful and still not think so of myself. Hearing that you struggle still with self image and even acknowledge your \"privilege\" makes me feel like I'm not doing so badly after all!", "soulshinekate": "Thank you for this post. I am on the \"small side\" of plus size these days, but being not very proportional (double chin since childhood thanks Mom and a big tum) I've always had a hard time fitting with either crowd. I've been working on just being me and thankful for anyone who's inclusive and encouraging of that. Your page, @fatgirlflowfam and @comfyfattravels have helped me so much in the last couple months!", "marshmallows.n.moonbeams": "I love your swim suit!! And all your summer pics have been so awesome and you look so pretty!! Xoxo.🖤", "kimdeg33": "You know, I was just thinking to myself, \"self, why dont any of the fat women I follow on Instagram look like me? Do I not even fit into this group of people??\" I am completely disproportionately fat, and it seems like every beautiful fat woman has a large bust and/or butt and a flat, fat stomach, where I dont have anything like that. Sometimes that is ostricising. Knowing that you acknowledge that there is even privilege amongst fat women is inspiring and so comforting. I have never seen anyone post anything like this. Thank you for this.", "staceycoplin": "You are fierce and flawless! Whoooooo wooooooo", "ashmjong": "I got excited before I hit send LOL, I agree! Basically so long as you are \"proportional\" even though we face a lot of shit, its just not as bad. I have a big belly, but the way my fat falls makes me more \"acceptable\" then some women and that is just so wrong but it is a real thing. ALL fat bodies are acceptable and lovely but some for sure face more marginalization than others. This is such a good topic!", "fat_mom_coding": "Yes I love this!!! The hardest thing to get across is that admitting you have privilege doesn’t negate your struggles and hard work.", "youfatterme": "Do you mind being asked if you're tall? Pure curiosity. I think you're great, btw.😀", "treetoplolo": "May I ask how tall you are?", "madderandfatter": "I stg I was just thinking about this today when some asshole parked uncomfortably close to my car. I could barely get the driver side door open. So you know my 400+ pound ass could not fit. But I was able to get in through the passenger side door, lay the seats down and climb across. Which I’m sure was a sight to see since I’m 5 fucking 9 and I drive a Mazda 3 (so small). So I was mildly annoyed but I can’t imagine how it would feel to someone who wouldn’t have been able to do that. I know a lot of people who wouldn’t have been able to do that, fat or thin. Privilege and accessibility is a hell of a thing.", "do_not_follow_me81": "💖", "sciencetimebree": "I'm short and my 400 looks very different from yours. I also have a B belly instead of a D belly. I'm surrounded on social media with body positivity so when I go out to the real world and get treated like a worthless nonhuman I'm like oh yeahhhh the world even has varying level of acceptance of fat. Is my fat different fo", "beachyjeep": "Thank you for showing me that someone of my size can wear a bikini and I never felt sexier then when I had that black bikini from adore me on ❤️❤️❤️ love from Alabama", "mandyoh": "I also zoomed into your toes...is that weird? Idc", "adukporaphael": "Sexy", "pinkslinky": "I have been toying with the idea of coining “invisible fat”. I am an almost 50-year-old woman, so a lot of the time I feel like, as a person who wouldn’t qualify as a cougar, I just don’t really matter at all. I’m not seen as much of anything. (which is why I’m rocking bright purple hair)", "mamatwotattoos": "I think you are awesome! However , how does privilege connect with the size of your body? Can you clarify ?", "fiftyshadesofawkward": "@fatgirlflow YEEESSSS! 💅🏽🙋🏽‍♀️💁🏽‍♀️ #thankyou for highlighting the uncomfortable-ness of privilege", "jamiesierrarex": "❤❤❤", "calandmer": "I wish one day I can see myself as I look at you. As a gorgeous strong woman that gives a shit about what other people think. You are a huge role model to me. Thanks xx", "simply_shaniaxo": "Question! How do you get your legs so tan? No matter how long I lay in the sun my arms and chest burn/turn red but my legs are so far behind a few shades lighter", "heathernobert": "Hey girl I really admire you! Are you really in Lawrence KS? I love that city", "sayshesclassy": "I love you too, boo.", "brandistardust": "I often wrestle with the idea of good fat vs bad fat all the time. Having a boyfriend that appreciates my body also opened up a whole world of me noticing and comparing myself to other big girls and questioning if I'm the \"right kind of big\" or when I look at instagram at a girl who has a flatter stomach or a bigger, more round ass than I do. As confident as anyone is, we still question ourselves. I always say that we may not always love ourselves but we should always forgive ourselves. It's amazing to see so many #bodypositive women out there of all shapes and sizes and feeling like we aren't alone. We are a tribe of strong, beautiful women!", "everyonehatescallan": "Love your suit! 😍"}