{"vika_k__k": "😵🤮", "654321ron": "Very beautiful and very sexy women ❤️💯💯", "djinyi": "@lavoash That tattoo is ADORBS.", "statusviatoris": "I love your tat!!!", "bobmarleywifey": "@fatgirlflow U are PERFECT! THANK U,for posting these pics..u seriously give me hope that I can still be accepted as i am being a bigger girl. I LOVE U FOR THIS!😍😍😍💜💜💜😍😍", "asikulali": "Soooooo lovely", "moonlight.tarot": "Say no bottled water 🚫", "turkoguz21": "🌹🌹🌹💋💋♥️♥️♥️", "bigfish19603": "Hi BEAUTIFUL BLESSINGS TO YOU", "rens_007_": "1000 kisss for your sweet body", "giron3345": "Wow", "aritra3374": "Cutie 😍😘", "schreckwalter": "Sweet and mighty belly ‼️", "jackmanantrigg": "Can l say 1 thing dam u are so sexy love your body", "sew_gay_embroidery": "@bringmehomenyc please read the description", "jose.miguel.rojas": "Sencillamente, qué delicia! 😘", "muhseger": "Awesome big boobs", "blackjones20": "Pretty!😍", "seyedshiraziiiiiii": "عاشق زنهای چاقم", "daniel.bbw": "I can't take off my eyes of your hanging belly and fupa.", "kittkattkitten": "The water tastes bad because they add stuff to it to enable it. It says on the bottle that it's purified and such. I dislike all the water like this.", "radical_reesie_d": "Girl! Treat yo self to a Brita filter and refillable water bottle. Tastes wayyy better than bottled water!!! Personally I’m not a fan of any bottled water, it all tases like plastic 😬", "tchandubangura": "I love you belly", "nekodameow": "I effin love this so much!!", "torreshunny": "🤣 it so does taste like feet!!! I think that too!! ❤️", "holliefay1981": "LOVE how you do side angles not just front pics. You always rock and always look great and you inspire me to not care about people’s opinions of my body so that I don’t have to suffer this English heatwave covered up like bed @fatgirlflow 😘", "wimmerwerner": "Hello my dreamgirl", "shooglet": "So cute", "sweetest_honeyy1": "I admire how confident you are ❤️❤️❤️", "leave_me_alone_pizza": "Holy shit. The story just posted with you going to get a waffle, made me laugh SO hard. Bless your heart! 😘😘", "kellybellyohio": "Sweet baby angel ❤️❤️❤️", "miss_sydney_jane_": "Queen ✨🙌🏻🙌🏻✨", "nerdyvt": "Loving the colours!", "soul_seeker_az": "Because it’s tap water like most of the other bottled water. 😑", "luhluhlisa": "Yaass queen! Always wearing such adorable outfits. Not to be outshined by your amazing confidence!", "_rain_gatherer_": "Your tummy makes both my partner and I smile! I rarely get to see plus sized women with a similar shape to me and it’s always a blessing when I do!", "a0k": "Dasani tastes like feet because it’s literally run off from the machines making Coca-Cola. Not joking. Been to the factories when they were my client.", "inanityandthegirl": "I love all the beautiful and positive vibes in this entire section. So much love for you all xxz", "skyofsonnets": "I haven’t found any brand of water I actually like. 😞 also, fucking iconic picture babe. 💟", "sehustlerosen": "Arrowhead water tastes the best to me, idk why, I think it’s magic. 🤷‍♀️", "forkliftoperation": "Aww, when are the quadruplets due??? You look good for 7months in!!", "valerybrennan": "Okay I am here for #influencersgonewild 🙌🏻", "dionysiac_": "SLAY QUEEN!!! 💖💖💖💖💖💯💯💯🔥🔥🔥🔥✨✨✨🤘🏾 #CONFIDENCEGOALS!", "magnoliasistersmedia": "I think your trucker hat ties this look together! Really cute!", "violetsandpeaches": "I wish we could hang out. I love your energy. You are so much light.", "samcerra": "Dasani is disgusting 💕", "angelette_thequeen": "@fatgirlflow fu*k all the haters love. Keep doing you and keep pushing through. #fatgirlpower..lol Love what your doing!", "leahsamec": "Just watched your Insta story and omg why is that so accurate I can't handle that some people think they can just say stuff like that. Preach sister, we are not here to be objects for other people to decide if they want to do the dirty with or not!", "natalie.is": "YES!!! #downwithdasani", "sirius_mayhem": "Honestly, y'all going to her page is probably going to help her get more exposure from page traffic. Why not support each other on the page and ignore this vile human.", "hippiechickokc": "Drink alkaline water. Or filter through a Berkey!!! It tastes AMAZING!", "fluidfatti": "1. i keep coming back to look at this pic bc GOTDAMN slay mama i’m trying to get on your leve  2. fuck dasani water", "megtran2000": "Just voicing my opinion. That's what we do around here.", "triks41": "Yea. Dasani is the worst! Smartwater is the best, but Aquafina will do in a pinch, lol", "fknvibesxo": "Stay glowing beautiful 😙❤", "scarylittlepumpkins": "‘why’s it taste like feet?’ 😭😂😍 this made me do a lol. Love this.", "justineshuck": "Hahahah yeah Dasani sucks", "misshaylee22": "I absolutely love Carissa😍", "morganlouise.plus": "Ugh agreed. Dasani is the WORST. U in that bikini is the best tho 😩", "sireinaintentions": "I love that ‘ME’ tattoo! It’s so cute! 💜🤗", "betharoomagoo": "That me heart tattoo! 😍❤️", "jlmyers1211": "You. Are. Fucking. Fabulous!!!! ❤❤", "katrina_faith4": "Aquafina QUEEN!!!!", "laura387": "I love the ❤️me tattoo!!! I might have to get one like it! Also you look amazing 😍😍", "victoriadonelda": "my icon 💜👯‍♀️☺️", "littlemisslunabell": "Genuinely don’t know how you put up with the losers and the morons. You’re my idol. 😘💜", "chas29__len": "Yaaassss!👐👐👐 Dasani is the worst! Also, I am in love with your '💓 me' tattoo....I'm feeling inspired", "savourydeputy": "@megangertler it's a shitty thing that you are one more person who thinks that your desire to fuck or not fuck a woman is: 1. Relevant 2. In any way related to her value 3. Something that you feel comfortable putting out there when you are talking about a stranger. YOU ARE FURTHERING THE PATRIARCHY. Consider what a complete fool you are making of yourself. Think twice next time.", "purenightmare3": "Girl you are slaying it ❤️👑❤️👑❤️", "nicolecmaple": "If you're gonna come for Dasani can we at LEAST talk about Arrowhead???? It's so salty???", "riots.b4.diets": "@megangertler If you cannot control your thoughts, so be it. But why would you feel the need to say it? It wasn’t kind. Nobodies day was made better by that comment. You didn’t improve her life in any way. What was the point? I’m so sick of people on the internet saying that they are “allowed to express their opinions” sure you are. You are allowed, but what kind of shitty person feels like they SHOULD say something like that? Do you feel good about the comment? Are you glad that you typed out that you find her less fuckable now? Seriously! Do you fee good about that?", "admsunshine": "Just want to echo that Dasani is foul and your tattoos are beautiful!!!", "heyjen11": "You have the cutest belly button! 😍😍", "jschoon83": "I miss you being on BigCutie’s! 😍", "abeanabellabird": "You are so damn rad! Like seriously! And your sternum tattoo is life. I always said “when I’m skinny I’ll reward myself with a sternum tattoo” wtf kind of nonsense is that?!? How about WHEN I FEEL LIKE IT ILL GET A DAMN STERNUM TATTOO BECAUSE IM AWESOME?! Yeah that’s better.", "crazyaboutmyjellyroll": "❤️❤️❤️", "sailorsheri": "@fatgirlflow you’re a doll, I adore you, if I saw you at a pool, I’d drag a chair all across the pool deck and plop down next to you, put my trucker hat on, lather my fatkini’d body in SPF 30 and make a new friend. Hi. My name is Sheri.", "40rtypluss": "Oh wait, this photo was supposed to make me want to have sex with you? My bad. I must be too innocent, because I just saw a beautiful lady enjoying a drink on a hot day! Sheesh . . . some people. Haha", "gee.gen": "Goddamn goddamn!! Drinking that water and looking like FIRE!!!", "queenn_anxiety": "I love you! I'm kinda down. Wore a crop top to town and got lots of looks and omg look at her... 😭😭", "marymadeup": "Dasani water is so gross!!! You, on the other hand, are beautiful!!!", "lavender.lovegood": "I never understood why some bottled water tastes bad! It’s effing WATER. Anyway you look fab 🤘🏻", "unapologetic_poodle_314": "I wish I had this confidence ❤️ you go girl!", "curvesbecomeme": "This bathing suit looks amazing on you.", "curvylogic": "Yezzzzz", "420lemonboy": "You look gorgeous Corissa, those colors looks astonishing on you!", "chrissyyjayyy": "I fucking love you!!!! 💕", "sad_but_rad90": "I do believe I have failed to mention how much I love your underboob tattoo!! & your tattoo was actually made me realize I need to stop waiting to get mine & ive finally started saving for it 🖤", "sixtytwochevy": "Love your bikini babe look and vibration", "sweetgems76": "Love your bikini top, where did you get it?", "fathippiequeen": "I love the love me tattoo", "leahj03": "Dasani water is disgusting! I’m so glad someone else thinks so too.", "kasey_in_wonderland": "Thank you for being such a beautiful inspiration 💕", "sonatural1": "Sooo you just gon be naked in these streets ALL summa!! 😍😍👀", "amberbria": "I hate aquafina. Water tastes different. I don't get it.", "q_strom_99_walker": "Sexy @fatgirlflow", "fdurands": "Wowwww !!! Hot!", "red1983": "@fatgirlflow Such a cute suit!! Where’d you get it??", "miss_hysteria": "Okay loving it and wondering how the hell your bottoms don’t roll down under your belly. I can’t wear bikini brief anything without my jiggle falling out whenever I sit. Or move. Or breathe haha", "socixlpxth": "BEAUTIFUL", "fatbabe_maggielynn": "Why is everybody hating and focusing on the water but i mean look at HER 😍", "joniedelman": "Serious question. Do you sunscreen your tats? I have been super diligent with mine but I have no tan and that’s a bummer because I get dark real quick.", "imperviouslady": "Dasani water is so bad!", "kittierone": "Dasani is so gross right?! I thought it was just me!", "gracelenhart": "Nvm @fatgirlflow ... Found the answer in the comments! Keep rocking it :)", "allisonsadventure": "I FREAKING LIVE for your tattoo under your boobs. I NEED IT", "mandyoh": "I wish I could take a #coordinatingnails pic with your top 😍", "thekosherkitty": "Yasss! Gorgeous!💘💘💘", "rachelshadoan": "SO HERE FOR INFLUENCERSGONEWILD", "stormycoconut": "@fatgirlflow I love your suit! Especially the color of the bottoms. 👌🏼 Also, Dasani is disgusting because it has preservatives in it...in. The. WATER. Look at the bottle and you will see the ingredients. Who puts preservatives in water? I'll just take straight up water, no preservatives, thanks. 🤷‍♀️💁💦", "spiritofjael": "You betta. Yesssss", "paige.elizz.k": "Lookin so BEAUTIFUL!", "aria__winchester": "@fatgirlflow I've been told dasani has salt in it...and that's why it tastes awful", "the_other_hillary": "I thought I was the only one that thought that about Dasani!!", "howdy.j17": "I wish I had your confidence 😭", "mikejwestel": "I love this picture. You are gorgeous! Your curves are fantastic and your confidence is very sexy.", "lucythesupergirl": "It tastes soooo bad! How does anyone even prefer that over, like, normal water? 😖", "cialitra_": "lmao yes.", "qurvequeenkey": "Where did you get this suit? 😍😍😍", "redbone_carter": "Damn bish i wish we lived closer together bc i would love to do a photoshoot together", "calliecampbellsays": "Yessss girl!! ❤️😘❤️", "beatgrrl": "Dasani water is gross.", "originalsurlytemple": "I hate Dasani, too. It’s Municipal water.", "alyssabee__": "where’s that bikini from? very cute", "audra.liz": "Yessss queen!", "plussizescuba": "Hah I love Dasani 😂😂 but I love your new hashtag!! How do you know if you’re an influencer??? 😂", "kshellrude": "Mamacita you are so incredible. Truly I adore you", "randomlysmile": "Arrowhead is the water I think tastes disgusting, but my mom loves it. Funny how tastes are so different!", "bignewt2012": "🙌👍😎", "peachypipes": "Dasani the WORST (you da best!)", "thenayaelizondo": "@vulvatriltastic now I’m obsessed!!!", "zenncity": "She wasn’t lying when she said Dasani tastes like feet", "girlgotcurvesuk": "😍😍😍😍😍", "bigcleanbeautyqueen": "Love this!! Fatkini's all the way. 😊😊", "goofyfan1984": "such a beautiful tummy :)", "caitlinjill": "@rob_ballantine", "chelseaissocool": "@shamelessly_jessilynn I'm loving the top.", "alliemalliefallie": "Can I just say...I love your tattoo on your upper thigh!!! And just generally love your posts!! ❤️🌈", "yumaratz": "That bikini is the bomb! You look fantastic.", "chelcielynnn\nVerified": "Verified", "bolt._": "I get so much confidence from you and other influencers. IG has honestly had such a positive impact on my MH since I started following strong wonderful women like yourself. Thank you for all you do and thank you for taking the time to do it when you don't have to....please believe that you change lives. Even old almost-40 year old ones like mine xxx", "fenweather": "🍰😍❤️", "beckysuesweet": "Babe!", "katstroudofficial": "YES!!! lol #influencersgonewild Love It!! 😻❤️", "carissakeepsitsogroovy": "Girrrrrrrl can I suggest a super affordable reusable steel water bottle that will keep your water ice cold and refreshing without the unnecessary waste of plastic bottles 😘 #takeya", "_betsymck_": "Sooooo adorable. 💗💗💗", "softbodytendermind": "That looks like it fits so nice. When I get tummy coverage it doesn't go into my apron cracks", "ashmjong": "That \"<3 Me\" tattoo is amazing! I LOVE LOVE LOVE that you post pictures where your tum is the center of the frame and not hidden. It makes me feel SO good to see other babes with tums! <3", "giarcher": "Beautiful and really inspiring 😍", "bigrob1968": "You look good", "im_not_fred_gwynne": "I just love you!! Every post you make brightens my day. You have helped me see myself in a while new light. I've stopped being embarrassed to be in photos or videos. I've started wearing whatever I want. Seriously, Thank You.", "talesofsummer98": "Sadly in my country you literally cannot find one bikini in a size larger than 14 US -_-", "rochebrice": "😍😍💋💋💋", "ultralaurel": "Your ❤️me tattoo is officially my new favorite tattoo ever.", "bigboysarecute": "WE LOVE YOU ❤️", "adukporaphael": "Baby .I love you so much !!! U married?????", "rosemaryandquartz": "I love this bikini and this angle.", "heyseantaylor\nVerified": "Verified", "lauren.pedigo05": "How do you do that? Be so happy and confident? I cried today by just back to school shopping because I’m not you’re average 13 year old girl. Please TELL ME YOUR SECRETS!!💖", "applecatbanana": "@fatgirlflow how you get your bottoms to stay up?? Your look fab, mine always roll down underneath my kangaroo pouch lol thank you for representing!!", "banannasavage": "I LOVE THIS PAGGEEE FUCK YEAA I WISH I COULD DO A PHOTO SHOOT WITH YOU @fatgirlflow", "fun_not_found_": "Where is this suit from? I’m actively swimsuit shopping for my honeymoon! Helppp 😅", "cassiedanielle73": "I love the Me tattoo!!", "itsyourgirlliz": "Why can’t I have your confidence and style 😭", "joseph___psl717": "Yes you do have that flow sexy.....your fucking gorgeous", "jessydez": "You’re still my #fatgirlgoals 💖😜", "cassydink": "Im happy with my body, i just dont have the confidence. How do you do that? How do you not care what others think of your body? Im struggling with that.", "andrewmiller1982": "😍😍😍😍", "stela2121": "She is the definition of ZERO🦊TO GIVE!! IT'S A BLESSING!"}