{"astold_byjassy": "For me it would be being more comfortable with wearing clothes that I actually like. Since I’ve gained nearly a 100 lbs in the past 4 years, I’ve lost my sense of style and confidence bc I’m not use to being this big. So I wear things that are socially acceptable simply bc I don’t want to be criticized but I’m taking my style back and saying PHUCK Society!", "kaywinnetleigh": "Allow pictures to be take of me. I am missing from every physical memory my nieces and nephews would have left behind. If anything happens to me, it'd be like I never existed for them.", "alittleshortforastormtrooper": "I would wear bikinis , tank tops/thin strap tops, and shorts, I’m working on not caring so much about what others think and trying to be kinder to myself but it’s a long process!", "michael_lucinda": "@dannnyx", "vignor67": "I think i wuld sunbading and swiming", "readr123": "My bmi is under 24 but I still can't do the thing I most want. Body shape does not solve anything; but for the same reason it shouldn't be allowed to spoil anything either.", "insideoutbeautytribe": "I would dance at a club", "fortaleza_bikini": "J'adore!", "xmarthin": "I'd go to a water park and take all the water slides! Part is me and my mental block, and part is the weight limit on them that I surpassed when I was like 14. :/", "socially_awkward_penguin78": "Wear an outfit that doesn’t require a bra. I don’t like my breasts", "_space__cowgirl_": "3 words. Belly. Button. Piercing.", "mitchell_perkins": "SEXC !!", "chloe.graham_": "Ur so pretty omg. You inspire me so so much!! I love how much confidence u have!! YOU GO GIRL!", "domi.nska": "@paulanxo patrz, grube też piękne 😂", "shamaun.sumon": "Sexy body and lovely girls😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "shmoopsiepoo329": "Cute suit! Ugh you are adorbs! 💖", "smarterthanyouraveragesprinkle": "Take a dance class", "yeetingdanicohn": "My eyes.", "the_thrifty_business": "Maybe I’d be able to love myself more. Growing up a big kid I always thought that wasn’t allowed...", "maxi_la4": "That question hit home. Wow even though I think I’m more or less comfortable this just showed me how normal it is for me to „just not do these things“ ....", "tanilovesyou": "Post pictures of myself. I never post full body pics and barely post selfies", "audrey_christie": "It was so hot here today! So jelly of your lounging in the pool mode 😍", "antimony13": "I would wear crop tops and get one of those beautiful tattoos under my breasts like in the photo", "marymadeup": "I would definitely wear a bikini. And crop tops. But every time I think about it, I hear the voices of my dad and my sister talking about how \"gross\" it is. My sister is big too, but she talks so much shit about other big girls. It's really sad, and not just because I think my big ole tummy is cute AF!", "martinifontaine": "Sure wish I could get a tan like that! 🤩", "keqqy": "Go swimming more.", "leilasmom23": "I would stop being so bothered by my double chin. I would stop contouring every day to try to hide it. I would wear sleeveless tops and not sweat to death in the summer wearing sleeves and cardigans. I wouldn’t be so ashamed of my belly line in my pants that causes me to only wear tunics that cover it....", "aliciahibbert": "Definitely wear a bikini!", "sharonlane1018": "I really dont know. I've been in the house for so long because every where I go all I get is stares. I'm so proud of you and how comfortable you are. You give me inspiration", "jae_lomarcus": "I would not wear a tank top under all my clothes to smooth everything out. I’m always hotter because of the extra layer of clothes", "11_usagi": "I think this post just inspired me to do what I want. I've brought my first bikini on holiday with me. I've started wearing crop tops. But the doctor one especially. I've avoided doctors because I know I'll get the rant. But I should do what I want. If I'm going to a doctor I'm actively trying to look after myself, why would that be a bad thing?", "landy_lucienne": "Go topless and ignore my bras.", "sarah_lou_375": "Such powerful questions... and sadly, at 43, I don't know what my answer would be. Thank you, Corissa, for being so inspiring. I plan to think on this today and make changes.", "sherrydermittdeering": "I would just be 100% Pretty..not just the \"You have such a beautiful face if you would only lose weight\"..Really?? I'm supposed to take this as a compliment..?😣", "thegracencurtis": "😍😍", "j.summerset": "Be naked in my own room. I can't even be naked in my own personal space without feeling ashamed. I want to just sit on my bed naked and read books and drink rum and cokes, while listening to my records. I want to do that without that not so little voice in my head going \"ew cover up.\"", "honeyngold24": "Girl you livin yo best life😙", "fayeelizibeth": "Go to a rave. I love dancing with people, but I was always under the impression that fat people weren't welcome at raves.", "therealmrsharry": "I would be in ALL the photos with my family instead of hiding behind the camera. As it is now, anyone looking at us from pictures alone could be forgiven for thinking I don't exist. So I would allow myself to be part of our history in picture and not ashamed to be documented😊", "glendac77": "Love myself and start to finally live my life how I deserve 😭", "fancyanna47": "Keep my husband and find my female soulmate together.", "motherofhumankids": "Definitely wear a bathing suit. After 3 C-section's and awful recovery and deep red stretch marks, I'd love to feel confident enough to wear a bathing suit again. Or to not feel like an embarrassment to my spouse or kids in public settings.", "shellyhassdenteufel": "Definitely go to the doctor...at all.", "lizzie_florence": "I’d spend less time putting makeup on and feel better going bare faced!", "sanchococaine": "Express my own real thoughts. Delf hating space free up!", "abbyf20": "Wearing a bikini in public...I have one that I really like, it’s actually probably my favorite swimsuit, but I only feel comfortable wearing it around my immediate family 😕", "kristen10271973": "Go to the dr for sure.......i always feel so judged and uncomfortable there!!", "dogmom_7296": "I would wear sleeveless and not hide my rolly polly arms. While I'm getting better I still catch myself tugging at my sleeves or tucking arm a certain way in pictures.", "sunsets_n_moscato": "I would wear crop tops!! And pencil skirts!! All the damn time!!!", "q_strom_99_walker": "Sexy @fatgirlflow", "adele_no4": "💯 percent wear a bikini and not think about my tummy ever again!", "kindofkae": "I would dance without fear of who's watching, wear all the skimpy things I wish were for me, feel free to exist in spaces \"not made\" for me. 💞 Bikini is definitely my next step though and it's thanks to beautiful confident inspiring women like you. Thank you. 👏", "rubbertrampartist": "I'd wear mini skirts with unshaved legs (and my legs are really hairy) like I did when I was younger and thinner.", "kathryneporter": "@eastwoodlaflare I love you", "ashweesabrina": "I need that suit @fatgirlflow ! Love ❤️", "somewhere_under_the_rainbow": "Love the resonace of this - it connects deeply to my latest post actually if you want to check it out! 💜", "candiescreations": "That is a freakin cute bikini", "abbyc5": "I would go to the doctor and actually get treatment for my chronic illness without getting shamed and ignored because of my weight.", "vixpereira": "Go on more dates for sure (dating men in my body is terrifying). Singing in front of a crowd/people in general. Feel empowered around my loved ones instead of JUDGED -sigh- 💖 it’s a journey", "spongebobsarahpants": "Not have to experience ridiculous anxiety wondering if your boyfriend is gonna cheat on you like the last Asshole did", "venisponce": "Wear shorts in the summer!", "crescendeo_man": "Unfortunately I can't say what I'd do on instagram but my 2nd choice would be live a life with stress, anxiety drama and fake people in my life who's only pretending to be my friend for their own personal gain.", "mrsvonpang": "Post more pics that show my body as is. I don't really show my fat body in pics very much because trolls/pervs and people judging me on that. I post face/head only or super flattering angles. It's not that I care what people like that think, but I just don't have the energy to deal with it.", "adelemum": "Great question", "mumskull": "Get tattooed from head to toe.. legit. I want a body suit so badly.", "bettykroll": "I’m not afraid to wear tank tops, short shorts, and bathing suits, but for some reason I just don’t have the nerve to wear crop tops. I know so weird right! PS where did you get your bikini? Totally in love with the leopard bottoms! ❤️💕", "lunchwithdahmer": "I’d probably take more photos with friends/let friends take more photos of me without fearing how I’ll look in them.", "october_dream": "Definitely going to the doctor without fear of their bias.", "superdanielleworld": "In my time at college I would have gone out with my friends more. In my mind, parties and clubs are only reserved for the conventionally attractive people", "hello_kristie": "Go kayaking and paddle boarding. They never have kayaks being enough for my hips or life jackets big enough for my boobs. Wah wah.", "hanem13": "Feel comfortable and not anxious around my skinny family😞", "bbkeeper": "I told you your fly ass is slimming dwn", "carry_on_girl": "I would wear all the clothes I own instead of having things I buy then don’t wear for years and eventually accept I’m never gonna wear it and get rid of it 😭 hoping that doesn’t happen to a crop top lace up skirt set that’s been neglected 😭", "mypetdevil": "I would most definitely wear a bikini and I would also eat whatever I wanted whenever I wanted and not feel guilty about it.", "miss_gigimarie": "Mine is simple....I never wear tank tops in public & what I wouldn't give to be able to leave my house with my arms out on a sunny day! Maybe one day I'll find that kind of confidence....you inspire me @fatgirlflow! 👏🏻", "ms.lostinspace": "You have gotten a serious tan this summer looking fab as usual xxx_x🌻🌻🌻", "jvantland": "I would sit comfortably in front of other people. Not trying to suck my stomach in or keep my legs from filling up the couch cushion or my bum from spilling over the waiting room chair. I would just be in space and enjoy my life. 💛 Thanks for the reminder that I already can.", "lesleelidesign": "I would date and dance and go to pool parties!", "minervaparadigm": "Crop tops. Those pretty waist wrapping ones like Soncy carries, with high waisted jeans.", "molletsdepoulet": "I'd wear less clothes (or less full-coverage clothes) in summer", "tkayloves": "Well, let's see, this has been my year of just being me. This year I went to a nudist resort, I also got and wore a bikini, and short shorts. The biggest surprise was that i found out that there are A TON of dudes who like my belly. (like, not the usual scummy dudes but handsome, sweet, successful, dudes I thought were way outta my league and never have given the time of day)", "zoee2102": "Wear tank tops without a sweater, cut my hair really short, wear shorts, travel, dating apps...", "amygosnell": "Not think twice about my flabby arms and wear tank tops everyday of summer.", "the.emerald.jones": "My idol", "_betsymck_": "Go swimming every single day. 🏊🏻‍♀️", "nellskeez": "Go out dancing.", "thekaycoleman": "I kinda do what I want anyway 🤭but for me, it's crop tops and burrito bowls for LIFE! LOL", "shymes26": "You look fabulous! Enjoy the rays", "qimzel": "If I would still be in this body then I would still be limited because of chronic illnesses.. If those would magically disappear I'd want to go to the zoo/somewhere in nature and take a walk..", "katfisk": "Go to the doctor, go on dates, and wear less clothing in the summer. I've come so far in my journey to allow my body to just be, but there's still a ways to go. Maybe I'll make that doctor's appointment. Thanks for the wonderful questions!", "theejessicarobin": "If my body didn’t hold me back it would be to do like roller coaster rides, zip lining, water slides. I didn’t realize how much I was missing out on until I found that I exceed so many weight limits :/", "_ava_noir": "Take a front spot Spin class, instead of hiding in the back.", "kimbahley": "I would do stand up comedy.", "comfyfattravels": "Honestly it sounds so simple but i would ride a bike lol", "tgat818": "This is such a great pic!! I love it!", "_darktranquility": "I'd wear more dresses. And although I'm a autumn/winter person and very pale for sunbathing, I'd go to the beach/pool for once. I never go.", "sonatural1": "Def wear crop tops!!! 😍", "grunge.witch": "Wear dresses/skirts without fear of chub rub, go almost naked during summer", "saidylic": "That hits me at the very core. All of this. I'd do all of this and more. I'd be so happy.", "salliedanielle": "Wear shorts. I’ve been dying in this 90 degree weather in KY. I always say I will but I end up chickening out", "reconstructing_melissa": "Wear shorts. It’s not cause my legs are fat, I can handle that. It’s my veins. Sigh. Someday.", "kittycooterbone": "First of all, I’d probably be less afraid to leave my apartment. I’d also rock the cute clothes I actually want to wear.", "stygian.depths": "I would post pictures of myself at my fat angles instead of trying to do the slimming method... I love myself pretty hard but that's my biggest hang up. You inspire me daily, Corissa. 🖤🖤🖤", "kalvirsowhat": "I would never wear bras, I dont for the most part now but I hate them and wish I had the guts to bra free 24 7", "miss_petru": "I would honestly go on dating apps!", "bubblegum_bxby": "Definitely go to the doctor more.. and not constantly think of all the judgmental thoughts I assume people think when they look at me. Also beautiful picture and I hope you’re feeling better 💕", "kendall.legac": "for suuuure i would be going to doctors more regularly :/", "_christiewhite_": "reading this made me tear up because it’s SO true. it’s like i would be free to live. you’ve sparked some deep thought this morning. thanks for being you. and for sharing you with us. ♥️", "cassy.pennington": "Doctor for sure. They all want to give me a pill to fix the fat and never have listened to me. I’ll go and too often leave there with an offer for phentermine and in tears because the fat doctor called me fat.", "audreyduff3": "All of the things", "sheilaburnham": "I would travel more! No more airplane anxiety..", "kztelynn": "ALSO. Just wanna say that you posted this pic already!", "jessicabailey1829": "Chillin' like Matt Dillon. Hehehehe! : )", "kristin.is.cool": "Never shave a fucking thing again!", "jenasjourney11": "I would definitely wear a crop top or maybe a two piece swimsuit. I dont usually stress too much about eating in public I mean everyone eats uk? What would you do??", "sarahthe.great": "I would sing in a band", "jools2511": "I would wear a bikini!", "yumaratz": "Live a much happier life!!! It would be amazing if we could just stop or ignore the fears that we all have. Corrisa, you look beautiful as always in your bikini. I love the leopard skin.", "nikkiqueengilliam": "Love your bottoms!! Supa cute!!", "strong_in_the_broken_places": "I would own it!!! I would be the person that is stuck inside. She's a bad BITCH!", "luellaarbre": "Do you ever leave the pool? Is there where you live now? 😍 😝 Also, I'd definitely see a doctor more. That \"they're going to tell me to lose weight\" fear is always there hovering.", "mommapanda118": "Go to a topless beach and dance 🤗", "fdonneys": "Super hot 🔥🔥🔥", "frk.roven": "I would wear fitted clothes,and stop hiding my body", "szabo_lillus": "I would finally talk with my mom about something else then my weight...", "pftcpgramusr": "That pool looks so relaxing. Where is that at?", "choufanny": "I would wear a crop top without bra and go topless at the beach. Basicly let my boobs live their own life haha."}