{"blessedmama_x4": "@emilyalexxis this is the article I was telling you about", "kimberly_latrice": "❤❤❤", "carissa.ahava": "Just read the article, it’s wonderful!", "jcmaxfield": "Congratulations! This was awesome!!", "fashionyourlifeofficial": "Congrats Corissa! Wonderful article ❤️", "marvamaker": "Bless you sweet woman. You are so very not alone.", "angiesuearnold": "@mcgrawspawscle she is the model on the article you shared. I LOVE her.", "sumindo": "@fatfaatama", "kcrtu": "Wonderful article! Thank you so much for sharing your story! Also, we need to know where you got that FANTABULOUS swim suit! #need :)", "true_ceanji": "@princesssunshine13", "ja21mia": "Fat shaming is wrong but because this is such an emotional personal topic for many, giving the hard facts appear to be taken as shaming and right away dismissed because people are too sensitive to the truth. The author tried to bring metabolism into it by saying it can slow down when you lose weight, body fat, etc but made it seem as thats the end of it. Metabolism is obviously not stationary, it can go up/down based on diet, exercise, environment, etc. Which is why you adjudt accordingly. Thyroid and other medical problems aren’t to blame in most people, lifestyle is. For those who do have medical issues, there are also ways to adjust your lifestyle to minimize its dangers.", "shelly_m__brown": "Your awesome. This stuff is life changing 🧡💚", "huffpost\nVerified": "Verified", "youfatterme": "@fatgirlflow Holy shit! I found this article on msn.com today, and, my goodness, it was the most public fat-activist thing, and the most personally validating thing I've ever read! Also, you look amazing in your picture as always!", "therealkellyfernandes": "I 💯 get you!", "coffeegal17": "I saw this yesterday and said omg I know her. That’s awesome!", "goodwitchmama": "@elizabnelson read this caption❣️", "talking.with.talya": "So authentic, as always. Love it! You’re wonderful. 💜", "abduel88": "😍😍😍😍😍😍😍😍😍😍😍😍😍", "mingqua": "Have you tried exercising? Eating healthier?", "revivaljewelrystudionh": "❤️❤️❤️", "crinkled_mazy": "This is hella cute", "bootysweat58": "Your delusions are truly appalling.", "heatherxmae": "❤️❤️❤️❤️", "lauralu2": "Where did you get this swimsuit!?", "shamaun.sumon": "Wonderful 😘👌", "pretty_eyes71": "I loved the article and you are an inspiration for me and loving my gorgeous fat self! ❤️", "wandering.rv.adventuress": "Thank you!!! The article is amazing and so are you 💖💖💖", "amoiste": "I read the article, it was so well done. Thank you to you and the others who opened up and shared your stories. ❤️ Great article!", "beth.l.dougherty": "I started reading it because I saw your photo on my fb feed, and I thank you for doing so.", "leahdahlia_": "I teared up a hundred times while reading the article. Thank you so much for sharing your story. I am so excited this article has reached people beyond the body inclusive community, because we already know! It’s everyone else that needs to get with it.", "salbee_downkernow": "You’re wonderful X", "foodpeacedietitian": "Thank you for sharing this part of your lived experience.", "kathleenmfrank": "What an excellent article!", "stephanie.bux": "Love the photo, love the article. It’s so important.", "wendells.world": "I really loved this article. Thank you lady ❤️💜❤️💜", "evolving_women": "Absolutely incredible", "cass_alicia": "1. You're fantastic and ilu 2. I just read the post and everyone needs to read it. It's fucking important.", "fattyboomboompod": "😭😭😭😭😭🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "magpiedeet": "I read the article yesterday. Thanks for sharing your story 😘", "workwithwhatuvgot": "Excellent article! You chose a great picture of yourself too!", "sstillie21": "I’m so proud of you there are actual tears and I’m so grateful for what you stand for. 100% love!!", "marshallme": "I loved this article and the photos!", "sweetvanessaleigh": "Wonderful and necessary. 💕💕💕💕", "knippy_knip": "Great article! Thanks for sharing your story ❤️🙏", "m762": "🔥😍💯❤️😘💯❤️😍🔥😘", "stoneanvil": "Amazing! My mom and sibling and I shared it in our group text and I got so excited when I recognized you! You’re gorgeous!", "krystalrenaes": "Thank you thank you thank you for your story and for being you. ♥️", "spirit.moon.love": "Seen this this morn and wntd to say congrats you look beautiful and I loved the message in the story ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️ #loveyourselfalways", "mama_chickita6": "Saw this article today and read every word with awe and recognition. Awe for the pure honesty in the entire thing and recognition and validation of the things I’ve been feeling in my own life. Then I come on Insta and it’s you! I am hopeful that this is the beginning of true change💜", "kat.buhr": "I loved the article!! I was so moved by your experience and honesty. I cried and sent it to my mom 😭", "pai_hel": "A great article! Thanks for sharing! You’re an inspiration 🙏", "ms_mjl.hobbies": "Thank you for sharing this article. It resonated with me to the point that i will print it out and translate some of it to take to any new doctor in the future. I also decided to call them out on any fat-shaming behavior because they need to learn. Lots of love to you 💛", "aliansroar": "Fantastic article, thank you for sharing your story!!", "hello_dollface_muah": "I read this!", "debby_nl": "This is such an amazing article. I saw it on my twitter feed and immediately recognised you in the picture. The article was so eye opening and refreshing to read. And I loved the fact that everyone got creative control over the pictures that were shown. Thank you so much for contributing to this article and telling your very personal story. I love following you, you are such an inspiration to me. Lots of💗 from The Netherlands", "sarahlouiseainscough": "💕💕💕💕", "mymovementjourney": "Such a fantastic and improtant article 💕💕💕", "kyla.rose": "Really great article!", "deejaythequeenjay": "I read this article today and felt tears well up in my eyes. I felt understood and represented. It also gave me hope that we can change things. Thank you for all that you and your partner do, it is truly appreciated!", "valjotaylor": "I read the article and recognized your beautiful body/self. Thank you for being vulnerable and exposing some parts of your truth. I thought it was an amazing article. ❤️🙌❤️❤️❤️❤️🙌🙌", "lookatthatpumpkin": "❤❤❤", "vikki_perry": "I loved the article. Thank you.", "liveyourwell": "Just read the article! Loved it! Thank you!", "patrickanimaddo": "Wow beautiful", "portraitdude": "Had to say it 3 times!!! 💯😘😍😍😍😍", "jesire1950": "This article was my life. It was validating and made me feel like someone heard me. Love it. Also, love that swimsuit you're wearing. Thank you for everything you do.", "moveandbefree": "Already came across it on twitter. I loved that article. Well done to everyone!", "nieceyleone": "This article was so very good. I shared on my Facebook page. I think everyone needs to read it.", "gallivantingtortoise": "My personal trainer actually shared this article and I was so incredibly happy to see you!!! It also made me feel much more comfortable with this trainer, to know that she is working with me for strength and wellbeing, not weight loss!", "plussizescuba": "Ahhh I love the joy and happiness in this picture and the honesty in your words. You look beautiful", "nebulaandthevelvetqueen": "I read the article and it made me cry especially the part about how the trauma of being fat in society is more harmful than just being fat . Thank you so much for inspiring us all and speaking out and being so beautiful inside and out 🌙🌒💕", "delightfulwithemma": "Thank you for being part of that article", "muyfifi": "So beautiful and I enjoyed the article too.", "caffinatedgoldengirl": "♥️♥️♥️", "doctornursesierra": "Thank you thank you thank you for your contribution to this article. It is immensely important. Studying to be a medical professional, I struggle with the explicit and glaring medical fatphobia that is lectured at me every day. Combating fatphobia on a daily basis personally and professionally is exhausting and demoralizing, and I am so excited to have this article as another great resource to help the fight.", "mochaadream": "You deserve every bit of this glorious moment girl!!!! 💗💗💗💗", "sara_lee6": "I thought that was you!!!!! Amazing girl!!! 💜💜💜💜", "jasminekokoszkahair": "My mom reposted this article today saying it opened her eyes, and that was something I didn’t know I really needed to see. Thank you ❤️", "hayley_keaton": "It was such a powerful article, and I loved seeing you a part of it.😘😘", "genale77": "That article was amazing. Great job and beautiful picture!", "fatmoonwitch": "I could not agree with this more. Fat acceptance set me free.", "patrreesha": "You’re beautiful and following you has made me see more beauty in all bodies, even my own!", "imsarahconley": "This piece made me feel so many things that I'm still processing, but it's important ready for everyone, not just fellow fats or the people who love them. Every. Single. Person. I'm so delighted that your joyful photo was the first featured because it's important for others to see.", "joeyjo422": "I couldn't finish reading it. Too heartbreaking 😓", "kaciesuttonxo": "💙💙💙💙💙💙", "freeasfox": "The article was amazing! I’ve been sharing it with EVERYONE! It was exciting to see you included!", "lframe": "This was an amazing article and spoke to me in so many ways. Thank you for sharing.", "peyekyadi": "Ok love", "ancidoc74": "This is an incredible article! Will be shared widely! Thank you!", "allyouneedisluff": "BALLING 😭😭 No truer words! What a warrior goddess you are! So thankful that you exist and have the opportunity to reach so many humans on such a powerful platform! 🙌👏💞💞", "copperleaves717": "That article was so good!! I read it before I saw this post and I’m SHOOK", "gladdicaproblematica": "I shared the article on my fb and my friend pointed me to your insta. Thank you!", "nerdy_nettie": "I wish I could love this a million times. Thank you.", "_caribbean_butterfly_": "Congratulations beautiful!!! 👏👏👏💛💛💛", "kellymackenziesinclair": "Thank you ❤️", "katey747": "Great piece!", "schnickelfist": "Amazing! <3 Thank you for sharing, and educating.", "biancaboomboom": "You are extraordinary 💜", "b.nicholem": "I cried so many times reading this article, it was incredible and so, so, so important. Thank you being involved in such an important discussion. Your posts snap me out the funk I get in when something doesn’t fit or someone makes a cruel comment about my body and I just appreciate you and your positive and powerful energy. Fat acceptance allowed me to step out of this self hating bubble I was in and finally love this body I have rather than allowing others perception of my appearance determine my worth. Thank you so much!!! 💖💖💖💖", "meg.elizabeth.uczy": "@girlky This woman is my idol.", "debibob": "Excellent article!!! Thank you for being vulnerable and real and authentic!!!", "bittersweet3386": "💜 preach girl 💜", "beamerkathy": "You really are a special woman. I'm so glad I've found you and I feel like you inspire women everywhere to be the person they ARE and make no apologies for not fitting into a society-created mold of thinness. I wish I'd known someone like you 30 years ago....my self-confidence and acceptance of myself would have been so much better and it would have changed my life!💜", "thosecurvygirls": "I have never seen elegance go out of style😎", "curiouser_etc": "I opened Facebook today and the first thing I saw was this picture and that two of my friends had already shared the article.", "muffyroberto": "Just read it and was so validated 💖 then read the comment section... ugh 😑", "nolatrees\nVerified": "Verified", "q_strom_99_walker": "Sexy @fatgirlflow", "emoodie8": "Fat is truly in just ask me I love fat women And have always been attracted to them", "colleen_gid": "Thank you for sharing your story! It was a great read and I was super excited to see your picture there!", "amaliavavala": "I saw this article going around and your picture accompanying it and felt proud like I knew you!!! This is huge and you have such a wonderful soul, this article is life-changing and so important, thank you for your voice and your light 💜💜💜", "victoriadonelda": "so proud of you! your story has inspired me to be more honest about mine 💜", "carollettucetomato": "I don’t know why I’m avoiding reading this article. I recognized your picture even in the thumbnail of the news story on my phone so it must be good, so why am I nervous/anxious to read it? 😕", "szs189": "You are inspiring", "jennyromero_28": "Ahhhh! That is sooo cool!!!", "valarmordollars": "I thought she looked familiar!!", "liblibby": "I’m so fucking proud of you.", "esrichman": "Me to my sister today: \"I follow her on Instagram, I can't believe I'm in a huffpost article with her!!! Also, damn that bikini is everything right?!?\" ❤️❤️❤️❤️", "heathernobert": "Loved the article!! Shared it on social media today ♥️♥️♥️ Thanks for being an inspiration!!", "shop.luella": "SO AMAZING!!! 🙌🙌🙌", "taylor.m.lambert": "This article was on my news feed. And I was like I wonder who this is then I open insta and I see you and i was shook.", "mandaroniii": "Thank you so much for posting this and sharing your story. I cried both sad and angry tears reading this. It feels nice to know I'm not alone but I wouldn't wish such mistreatment on anyone. If I had a dollar for every time I was mistreated by a doctor, including a time where I confessed suicidal thoughts and was told \"lose weight, you'll be light and those feelings will go away\", I'd be rich! I never seek medical attention now unless it's something so severe I need to go to the hospital. I had a panic attack earlier this week because I thought I had strep throat and would need to see a doctor. Nobody should ever have to feel that way.", "glitterarian": "\"I demand respect because the lack of it almost killed me\"- hit me hard, I definitely feel this. thank you. For everything, for being strong and vulnerable.", "tianash": "Thank you. I read through with quiet tears streaming down my face after reading SO MANY accounts that are so similar to my own experiences with the medical system. Thank you.", "voluptuousrdhd": "I read this today too. Wonderful article!!", "adnama.ppt": "Wow, so informative and personal. What a great read. I am so glad I found your ig and have seen your beautiful self pop up on my screen!", "stylesocialshop": "LOVE this ❤️", "stevibee_kc": "It was so good and so important! Well done! 💜💜💜💜", "synapsefizz": "❤️🎉", "danielle.bex": "This article was really great. When you talk about your struggle with disordered eating it really makes me feel like I'm not alone. Fat acceptance saved my life too. I have really complicated shit with food and I fucking hate talking about it. I'm trying to summon up the courage to put something out there about it but it's hard as fuck. You're fucking amazing and I'm so glad to have found you. ❤", "luellaarbre": "So much love for you , endlessly ❤️", "jameygyms": "❤❤❤🙌", "localtaylor": "Powerful article!! Proud of you for showing up! 🙌🏻🙌🏻🙌🏻", "spaced_out_rae": "I read it today on my lunch break (and printed it out [23 pages yall!]). It was fantastic article. I bringing copies to my pcp and my endocrinologist.", "lisaloyd10": "I read the article and was shocked!! I thought it was going to be a pat on the head, fluff piece- and was so surprised to be wrong!! It hit so many of the things I had went through, and still do!! I am so proud that someone publicly called out the medical field for how they treat people who aren’t in the ‘clinical’ normal!!", "bigsdefiance": "I’m 11 months (shit, today actually) in recovery from BED. I, too, had my childhood happiness stolen from me because of my constant need to not be fat. Thank you for speaking out publicly!!!!!", "julievargas5384": "I'm so happy you found your way out of that dark time & here you are...an inspiration to so many!!! We'll be here to support you when you're struggling!! Love the pic!!! Sexy!!", "lilith.405": "Same! I can so relate! ❤️❤️❤️", "shamora_t": "@graham0612 @van3ssajoy thought you would be interested", "allie_j_b": "Amazing 💛💙💜💚", "scintillasunrise": "❤️ ❤️ ❤️ your article", "sarahontheisland": "I just finished this article and it is brilliant. Thank you so much for being part of it! You are a seriously marvelous woman. ❤️", "pocketparadiseskirts": "You are beautiful, inside and out ❤️", "plussizepioneer": "I READ THIS TODAY!!!!!!! Such an amazing article! I cried many times!", "sherry_smiles": "❤❤❤❤", "rainbow__lightning": "This article was such a validation of everything I've felt going to doctors as a fat woman. It's always awful and I feel like I'm not fully listened to, even if my weight isn't brought up. Thank you for everything you do! You are such an inspiration and you have helped me so much on my journey to love my body no matter what it looks like.", "_betsymck_": "Yessssss!!!! 💗💗💗", "socialworkcorner": "So proud of you!", "hiphipmurray": "This article just validated everything I’ve every experienced. I once had a doctor diagnose me with PCOS with no symptoms, just to give me a PCOS medication that caused weight loss. My now gynecologist was shocked when I said I had been diagnosed with it by this “doctor” because I had none of the typical symptoms. My eating disorders destroyed my digestive system but everyone including doctors thought I was fine because I ‘look so great!’. People need to understand that everyone’s concern with our weight is hurting us in more ways they can imagine and damaging our health more than the few extra pounds. Thanks so much for sharing your story for this article, and every other day on here. Instagrammers like you are the absolutely #1 reason I was able to accept myself. And now I’m so much healthier and happier.", "margotmeanie": "I’m so proud and honoured to know you! You’re fierce and eloquent and smart as fuck. You have the ability to form thoughts I have into cohesive and thoughtful statements. 🖤🖤🖤", "plusmommy": "Yes to all of this. Such an important article and your voice is so needed. 🙌", "peachypipes": "You are a hero 😍💪", "chels_e_lately": "This article was soooo good ❤️🙌🏻", "almanch": "Awesome article! I loved it!", "tizzyswan": "This article was one of the first things I saw read I woke up today (on HuffPost stories) and it was 🔥🔥🔥! So powerful and well-written. Love how the author called out the medical community specifically, hope people take notice and fat acceptance becomes more normal because we fucking NEED IT. ❤️❤️❤️", "shesabadbamajama": "How honest and real! Love your words, your beautiful outlook on life! Continue to grow and help others! You equal AMAZING!", "sharondeshotels": "Loved this article, cried at this essay.", "mamaj1976": "You're such an inspiration 💕 I hope one day I have the level of acceptance you have 💕", "mommyisweird": "Holy Shit. That was a great read. Thank you.", "meagain0301": "@hsgroves", "teamboleyn": "I saw you in the article and I thought, “Hey! I know her! That’s my instagram friend!” ❤️", "yumaratz": "By the way, I'm loving that green bikini on you. It really looks good with you skin tone.", "torreshunny": "🙏🏼✨You go gurl!!! Be vulnerable but strong !! Xxoo", "demi.dujour": "This article > everything ever said 💯💯💯", "xavierbourgeais": "Magnifique 👍😍👍", "lilredcookbook": "Thank you for your article", "bajanbird": "You rock🧡🧡🧡", "not_december": "I love you so much thank you. Thank you so much 💕 I'm so happy you exist. I'm so grateful your sharing ur story. It means so much.", "cassy.pennington": "I saw you today shared on Facebook in a positive light. :)", "chefsamalama": "I read it as soon as it popped up on my phone. It was so powerful! Thank you for sharing your story!", "soy40grit": "Thank you. For speaking on this. I’ve watched you for a while now and your smile never allowed me to even fathom you went through something like that.", "heathermaemusic": "Sitting in a doctors office right now and crying after reading it because, oh my god, I was there too. I’m so glad you’re here. I’m so glad you gave life to your body and mind again. And thank you for sharing. This article will help so many. ❤️", "66_888_46993": "you are an amazing person. someone i can 100% relate to. Thanks for being an inspiration not only to me but to fat people everywhere. We need to see mpre fat people with your confidence. Its takes alot to be comfortable in our skin. I wish I had your confidence...one day i will.", "nikkeechocho": "I just read the article and came on to give you your props girl! Thank you for sharing, being courageous and giving me another role model 💗", "girlletgo": "“I demand respect because the lack of it almost killed me.” You inspire me Every. Damn. Day. I love you so much. It’s inspiring to see how the simple act of loving oneself can radiate so many ripples of love to those around you. You are a force my dear sister ❤️", "raisedbyclowns": "I love you! Thanks for speaking your truth.", "nicolecmaple": "The article was amazing, you're amazing! Thank you for being such a light!", "raeraefawn": "This article rocked my world today. I'm still stunned. I feel like I have options other than trying to change myself. I am tired of decades of trying to fit myself into a perfect package. I don't know what that means. Hopefully it means I will just stop admiring and loving all of you in the fat acceptance community from afar and join you.", "ginnyatchison": "❤You ARE brave and the respect you demand is absolutely valid in my humble opinion 💓 As I know, being fat is exhausting, all-consuming. But one thing I've come to realise, mainly amongst the online community of other fatties, such as myself, is that we are probably the least demanding humans out there. WHY?..because all we ever wanted was to 'blend in'. To go about our business without feeling somehow, that we are different. We didn't ask to be challenged, we don't ask to be treated any differently, but we are. Society got out of hand, it collectively intimidated us. Our eating disorders and other complex mental 'unwellness' was and is a reflection of how we are often screaming inside because we detest ourselves on the outside. But, little by little, because of strong humans such as you and many others in our community, we are breaking down the barriers and allowing self-love and a confidence we never thought we had, to shout out to the world that it doesn't f***ing matter what size we are, we are ALL beautiful. We are ALL fabulous and we ALL want to just live a happy life, free from judgement and stigma. It really is that simple! 💪👭👬👫❤💗❤💗", "rquigl03": "You’re my spirit animal. Thank you!!!! 💖💖💖💖", "itsshannongrace": "This photo, your story, and you are beautiful and inspirational... and fat and happy and full of love! ❤️❤️❤️❤️", "allisonkimmey\nVerified": "Verified", "ushshi": "🙌🏽🙌🏽🙌🏽Proud of you for this and publicly disseminating your struggle. fat acceptance saved my life too 🖤🖤", "asocalledfriend": "Dom of @brckhmptn tweeted about your article. Damn, worlds colliding rn.", "janeemoonlight": "You are so beautiful and we love you! Keep fighting! 😁😍", "kailurrrrr": "I love you ❤❤❤", "lieslbinx": "💖💖💖 Yo I randomly found this article in my news feed this morning and was so excited, surprised (to see this is a main stream publication) and emotional! Congrats and thanks for sharing so much of yourself! 💖💖💖💖💖💖💖", "welcometomle": "Amazing ❤️", "milenarussell": "This is so heartwarming! Self love is a tough path to follow, but I am really glad to have people like you to look up to! Thank you ♥️", "subterraneanbunnypig": "That article is 🔥🔥🔥 thank you for being a herald of change for us all 💞", "kevinao": "Aww i love this x", "bri.gambino": "😭😭 Literally tearing up because I felt the exact same just 6 months ago. Like I was physically dying. The way self-love heals is unbelievable.", "megandmsk8": "Naturally gorgeous girl!", "jennsvach": "💗💗💗💗💗💗💗", "sara_marie83": "@sexeee_lexy", "calliej225": "Ditto. 👏", "dayna_stokes": "Love the bikini pics! I would love to wear one, but my confidence is complete crap lol", "alysonmcc": "I wish people also understood that this never goes away. We learn to heal one part of ourselves and it makes way for more pain to be exposed. Life is just one never ending cycle of learning to love yourself and it’s so fucking hard, and also I’m so glad that you have shown me how possible it is. I love you babe, keep shining a light and leading the way.", "magnoliasistersmedia": "I’m happy for you! Congratulations!", "ladysasquatch": "Fantastic article and lovely photos 💥💋", "hakunamakeda": "You already had a special place in my heart, but this article really really made me wish I could hug you", "wahidjemaii": "I love you", "encyclopaediabrown": "Read this article, cried over this article, sent this article to everyone I know. Thank you for sharing. 💕", "jasmineannsmith": "I just saw the article and thought, that woman on the front looks familiar! I’m also reading Intuitive Eating which goes over the science of how pointless diets are in detail. I love seeing this all come together.", "kfoleywellness": "I was so glad to see you and this was such a great article <3", "oooohhnnoooo": "So grateful for you and your story! I have been trying to tell people this stuff for years. I’m so glad modern culture is finally starting to believe us!", "dirtymcd": "🙌 🙌 Incredible article! Thanks for sharing your truth!", "cedar.willow": "You are courageous and powerful! Kudos to you for sharing your truth and getting it out there to so many ppl. This photo of you is gorgeous!💛💛", "ohheykatiedee": "I read the article and related so much 😭", "do_not_follow_me81": "Was soooooo excited for you when I saw it!!! You're making a difference, keep on shining Ladybug💜💜💜", "adelemum": "How do I find this article I’d love to read it."}