{"sageandclovers": "Ugh. I love the shirt. Just wish I had the confidence to wear \"Fat\" as well as \"Daddy\"😧", "snackincbus": "Obsessed with this photo!! So much joy and cuteness!!", "laineydrane": "FDIA (fat daddy I am!)", "courtyb74": "✋🏻✋🏻✋🏻✋🏻", "mycahdarling": "Oh me please! I would LOVE ONE. And I would wear it with great pride ❤", "southsideshankiee": "I definitely work what I call my “auntie-dad” esthetic 🤘🏾☺️💨", "renaud824": "Hi BEAUTIFUL", "larisasaez2006": "Mi pregunta es: ¿Que necesidad a esto?.... no lo entiendo.", "theartistkotahmoon": "That is too sexy 💜🌙", "andresrizorodriguez": "Mmm", "danimayfieldandfam": "Love ❤️ your hair! But really just love this pic", "baklava_babe_": "I absolutely love your style- both clothes wise and house design! And your tattoos!!!", "snowydaffodils": "✋I'm fairly new to the fatgirlflow. I mentioned on one of your hard days about how awesome it was that Jay didn't tell you not to cry, etc but how she just loved on you and comforted you to just express how you were feeling. I'm new to the whole \"HEY, you're gorgeous just being you!\" I'm 44 yrs old, married with 2 daughters (6 &7yrs) and was shocked when my 1st grader came home asking me if she was fat because other kids were calling her that. She's got curves like a teen (gonna be beating off whom ever wants to date her eventually)but I'm able to show her positive self love through you and others. I tell her that people come in all different shapes, sizes, colors, and attitudes. Thank you for being a strong, positive woman who helps me through these growing pains. Which btw, you ROCK! ❤👋", "_marvolo_riddle_": "@rachcederwall", "evawildkatze": "OMG", "misha_moo_72": "I love your self love and confidence x", "melissadeq001": "Thighs like sausages, calves lije roasted hams... what a porker", "peterse.hayden": "👏😍", "billy_hill1979": "Outstanding sexy photo", "thehiddenroom123": "My god you're so sexy", "kyle.bates.378": "Luv ur sexy tan", "alexmambazo": "Sexy!", "bbkeeper": "U killem", "madar3286": "کیرم تو.کوست ،کیرم لای سینهات کیرم تو.کون نرمت🔥🔥🔥🔥", "flamingo_queenz": "😬🙆‍♀️🙆‍♀️", "herwild": "🖐️😳", "trose1230": "Is it too late to sign up? I just really need a shirt I feel free in", "emmers.jpeg": "Always have joked that I wear the pants in the relationship even with men haha 🤷🏼‍♀️ I guess I should just admit I’m a daddy already haha😂", "body_positive_phat_chic": "I want it #Sexy", "mema1_mel": "✋🤚", "saltycharliestudios": "🙌🏼 all the right kinds of too much is what I like to call myself!! i would wear that PROUD~", "tonyanicholeplussize": "Omg love 💜💜💜", "morganinstereo": "🤚🏻 this fat bitch right here", "april.lee.rose": "🤚💙 🤚", "yaschas": "hfksjs this would be honestly amazing for my more masc-leaning days lmao", "hacheregilda": "Me! 🖐🏽 #nonbinary", "reclaimingcas": "🙌", "stormycoconut": "Ummm...✋️", "delilahmom": "🙋‍♀️🙋‍♀️🙋‍♀️", "feministfaerie": "*raises 🤚 * I have a shirt that says baby girl ! Why not add one that says daddy to the list 😂😂😂", "c0rganic": "🖐🖑🖐 me me lmaoo. It's definitely not beyond something I would wear though", "thenameismelodyy": "🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️", "tinsleymj": "💯% have complicated feelings 🙌🙌🙌", "hannahrivers11": "Gender ideologies are fabricated, you can call me daddy if you like! 😉😘💋 #callmedaddy #transgirl", "leiht.drofwarc.nosylla": "Ughhh, you have mad charm - it even comes off in just your pictures <3", "theybythebabe": "You are LITERALLY my inspiration to get out of bed and SLAY today. Thank you for helping me out of my depressive slump! You rock!", "nikaandaubs": "Meee🤘🏼🤴🏻🙋🏻‍♀️", "cindibarbara": "🙋🏼‍♀️", "ginger_amelia": "Love this!", "miss.mama.mercury": "I'd love this shirt, my boyfriend would love this on me 😁", "avianchild": "Gurl I am LIVING for your hair 😍😍", "vixmix": "🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️ I’m trying to get over the word fat 🙉 it’s so hard!", "shani_85": "✋ Low key. High key. Any key. I would LOVE to have this shirt!! It looks so good on you 😊❤ @fatgirlflow", "blue_birdii": "🙋‍♀️ I'll be Daddy", "hector_luvs_coffeee": "🌞🌸", "mmarie024": "🤚🏼🤚🏼🤚🏼🤚🏼🤚🏼😍😭", "instaa_brann": "Because imma fat daddy too 😍😘", "_mrs_laporte": "Holy shit. ✋✋✋", "kirschbluetenschwarz": "You know you damage your heart, your bones, your brain...", "bethbear3112": "Yes 🙌🏻👋🏻", "thatssostephanie_": "✋✋✋✋✋✋✋", "rachaeleeee": "🙌🙌🙌✋", "farmher4": "✋ I hope to find my confidence in all I do like you. I try to take a step out if my comfort zone at least once a week and wear something I would normally think was \"not ment for me\".", "wickedwoman531": "Love it. 💚💚💚💚💚.. So enjoy your posts.", "geez_gentry": "✋👋 ✋🖐👋", "coastalmouse312": "✋ for sure", "achemistandhertools": "🖐️🖐️🖐️Majorly lol", "betsy_salzman": "🙋🏻‍♀️", "a_williams0330": "Do you have any ‘big momma’ shirts?! Bc that’s what I call myself... lol 🙈🙈🙈 I would totally die for one.", "_camsavacados": "👋🏽 I mean.. why not! 😌💖 @fatgirlflow loving your feed ✨", "tamerawr": "🙌 this is so good", "plumsfan": "Orange is my favorite color and I've liked the t-shirt since you first told us about them. Also, this is such a great picture as joy is radiating out of you.", "kirsten_martina_d": "✋💞😘✋", "believe_always_and_always_": "🙌me please", "swooten76": "🤞", "johnfoor5870": "Nice photo xx", "nsbchick": "🙋🏻‍♀️", "gapeach26": "I loveee itttt!!!!", "sewcraftybyshelley": "🤚🏻🙋🏼‍♀️", "cecchinal": "SO CUTE. I imagine myself wearing this tied up into a crop with ripped jeans! 💫 🌈", "charlesnelsonreilly": "✋help", "_tampicoooo_": "👌🏽 I'm good with weird!", "briaorgeron": "👋🏻👋🏻 I just don’t know if I can rock it! 😰", "justaweebee": "I’m not a daddy but I have a fat daddy. 😇😌", "ceruleanhoneymoon": "✋🏻✋🏻✋🏻✋🏻✋🏻", "chantal_m79": "👋 would feel like a Daddy baseball fan but hell its cute as!", "baylimaejones": "Love this 😍", "bopobear_sal": "👋🏼👋🏼👋🏼 Right here! Right here! Corissa! Pick me, pick me! I have to be honest, even identifying as a male, me and my partner have had some deep conversations about the use of the word! I think discomfort can be present at time but eventually we realized that we both enjoy it, and if it feels good then do it! Right? P.s. I am so excited to say I won a give away from @realxoxolib of the pronoun pack and it made me so happy!!! Me and my partner show it off all the time! P.S.S. I love your page and everything you do! ❤️", "brananalee": "I'm crying because I feel soooo much joy from this one picture...thank you thank you thank you for embracing the beauty that is our gorgeous selves!!! I've alway been so sesitive about my body especially my lil donut 🍩..But Im embracing it more than I ever have. So thank you for spreading the love and helping me be my best me!💚💜💙💛❤🍩😍😍😍😍😍", "twinbody": "We sent you a DM earlier, would love to know what you think of it ❤ @fatgirlflow", "jackieslava": "👋🙏👋", "elena.a.lopez": "🖐🖐🖐🖐🖐 love this picture I need some confidence lol", "je.ssicas": "i mean i’m not a daddy but this is still very me", "crazyrhinoladyofficial": "✋✋✋✋ but like, I wanna be into it.", "hipfat": "🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️", "caitlin_rose93": "👋🏼 I feel conflicted but feel like I have to have it. I also am an extremely proud Irish and these are my colors 😂😍🇮🇪 @fatgirlflow", "justme_47": "✋if feel wierd wearing anything that says fat, I know I'm fat and hey I'm a proud fat girl, but society still likes to make fun and criticize us", "sas_sigel": "✋✋✋✋✋🤚🤚🤚🤚🤚", "meeganniccole": "I was gonna buy this shirt, but I didn't know if I qualified as a Daddy. 🤚🏼🤚🏼🤚🏼🤚🏼", "sergeant.pish": "My friend calls me daddy so why not? I'll be daddy if it means confusing the hell out of people.", "mskellykirk": "Haha super uncomfortable calling myself daddy and actually having \"fat\" on my chest. That is ridiculous I know! But there it is 🙈", "zombiepearls": "Yep 🙋🖐️but man that shirt is soooo cute!", "olgunulas": "Offf", "unrulytresses": "🖑🖐🖑 I mean, I like and use papi, but only for my partner lol", "qimzel": "✋🏻Definitely feel weird about it, but I love my fat bitch and fat and proud t-shirts so much I might just need this one to add to my collection 🤞🏼💜", "winzer93": "✋", "killerkatsfromouterspace": "👋Meee😂 i can call other people daddy xD but i feel awkward about calling myself that i feel im not cool or suave enough to pull it off lol", "duffeylove": "The color of this shirt is outstanding 🤲🤚🤲🤚", "favejewellery": "🖤🖤 great 🖤🖤🖤", "the_other_hillary": "I think it’s good to embrace our masculinity even as women.", "sadieqmiller": "lmaooo mood 🙋🏻‍♂️", "rixy_thiccness": "✋🏻 it think this shirt is hilarious in the best way, my friends would get a real kick out of it 🙈", "daynasalmon31": "YASSSS! 👏🏿👏🏿👏🏿🙌🏿", "arlo_in_wonderland": "I need one so people can be like ‘what’s with your shirt I don’t get it’ and I can be like ‘I don’t get it either but this amazing chick on IG that I follow helps me feel better about my fat face it to me so imma rock it!’", "liv3love33": "Loooove this👏🏻🤚🏻", "tanilovesyou": "🖐👧🖐", "duckwheelchair": "I don't think I could pull it off, but still raising my hand ✋", "xavierbourgeais": "Magnifique ventre 👍😍👍❤️", "jasmynejasmynejasmyne": "🙋🏻‍♀️", "candice.n.moran": "Me", "the_tao_of_tara": "I definitely feel things when I imagine wearing the shirt but also i really want it.", "ephemeralquiet": "✋🏾", "mahlija": "I would love this shirt. I am trying my hardest to be comfortable with my stomach and seeing you makes me feel like I don’t have to be scared or ashamed of myself. Thank you!", "sugarpillz_": "👋🏻 just call me Daddy. ❤️", "skully_gully": "🖐🏻🤚🏻🙌🏻👐🏻 Never thought of myself as daddy but, now thinking about it, I'm on board.", "emlyves": "It’s a complicated relationship 😂", "wzgsmom": "I love it! And you are beautiful!", "katie_nicole_kitty": "YOU’RE SO CUTE", "nixoooooon": "since coming out as nb I’m using more masc terms for myself and tbh I wanna try this one I love it", "jockey_coxswain": "Femme Daddy here 💁🏽‍♀️", "q_strom_99_walker": "Sexy @fatgirlflow", "citymoogle": "it’s a shirt with a very clear meaning for me 😅", "sweetcheeks36": "I secretly always wanted my girlfriend to call me Daddy lol I called her Daddy but I’m like “hey i wanna be a daddy too” ❤️❤️ #wannaBeFatDaddy", "janicenichole": "🤚🤚🤚super weird but it's dope", "verbum_amator": "🙌", "africansun57": "Love it 👍🏾", "styledonadime": "👀👀👀 Hmmm not quite sure I could do it but I want to", "feels_like_alice": "Awesome top. Xx", "thatgoldengirlbeauty": "👋🏻👋🏻 I feel a little awkward.", "andydanelle": "✋ I want to be daddy material!", "tararaekuyper": "Can I be a Fat Daddy in a tutu? With hairy armpits?", "mashavolzhskaya": "🙋 dat's meeeee", "ohmygod_becky_look": "Omg I need one", "marymomarymo": "👋🏻 i feel weird bc i'm still confused about all the levels of my queerness. but i like to call myself cat dad when i take care of the cats", "swearwolffen": "Need it so hard. No qualms i am daddy", "noellebates": "✋", "danielle_hawkins12345": "👋🏽 heyyy", "bellemeansbeautiful": "👋🏾 but oddly empowered as well 🤷🏽‍♀️", "deedess40": "Think its different and unique the unexpected is always the best way to go✋❤", "thunderqueen19": "Yessssss I need 🙌🙌🙌", "becka6549": "✋ yes! I don’t feel weird though, I live for that shirt 😍😍😍", "alorr2s": "🙋🏻‍♀️", "raes.of.reds": "🙏👋👋 100% love it but feel conflicted about it, like everything in my life lol", "cousingreenberry": "Oh absolutely! 🖐", "curlllssss": "I need one in my life! Flawless babe 😍🙌🏼 @fatgirlflow", "jadynparker_": "@crysalex30", "curvyncontoured": "🖐🖐🖐 I'll be talking to my self and say damn daddy lol I could be doing a full makeup look and say that! I know how you feel about fall, but i am excited to be able to wear my fat babe sweater again! Love this new clothing!!", "chunkeebee": "I need this shirt.... This is what I call my husband !", "jessicamariaevans": "YOUR SO TANNNNEDDDDDD ☀️☀️☀️☀️", "adorable_emo_scene": "I mean yes? I would love the shirt. Never been called daddy before 🤔", "jazminerevere": "🙋‍♀️🙋‍♀️🙋‍♀️ I'd love one! @fatgirlflow", "hazeldereon": "Honestly i love being called daddy", "torrarian": "✋🏼 I would rock the threads off that shirt 😏", "bridgetterobertsonrealtor": "🤚🏻", "riskingg": "@the48layerdip", "stubbyy_thumb": "Oh dear god, I am fat, queer as all hell, and though I sometimes feel weird about it, I LOVE referring to myself as “daddy”. BLESS. THIS. CONTENT. 🙌🏻😭👌🏻🧜🏻‍♂️", "sugar.hole": "👏🏽👏🏽👋🏼", "niagotideas": "✋🏾 yess its me, having complicated feels about embodying both my femme-ness and also giving much needed space for my heavy switch energy! Also socialization around fatness and feeling the need to take up less space/appear less threatening sometimes makes it feel safer to exist in a more palatably femme way. This shirt is such a needed reminder of what it could feel like to exist as my whole self...plus i’m an excellent daddy 💅🏾", "hulabetty15": "🙌", "carrie86": "Yeah. A little awkward. But thinking about wearing out with my boyfriend makes me LOVE it!", "sleepy.eyes.clxb": "I do call myself daddy lol", "jessathebel": "👏👏👏👏👏👏😘", "sammyofawesome": "✋✋✋👋👋 I needs itttt", "pswrczk": "🖖🖖go for pulp daddy🖖🖖", "dollphilosophy": "Ive always wanted to be called daddy but ive never asked ayone to call me daddy lol👋👋", "wjb773": "🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️", "ashley.antidormi": "Ya hi me 👋", "colofthewilde": "I shouldn't feel as weird about this as I do considering I'm full of dad jokes. But I love these shirts.", "african_queen07": "🖐️", "5pmwakeupcall": "👋🏻👋🏻👋🏻👋🏻", "akikobiko": "Yisss", "mrsbecker84": "Need this T-shirt and I don’t feel weird about at all!", "tuesdayswithlove": "Living for this picture 😍", "frankiedarlingg": "Omg I was LITERALLY just saying I needed this shirt! My pronouns are she, her and sometimes daddy 🤩", "manojkumarmanishkumar": "Beautiful Pic", "haylor_tayes": "🙌🏻🙌🏻🙌🏻", "bsant": "Yasss!!!! 😍😍😍", "unicornsrock1218": "🙋🏻‍♀️", "briannakirkendall": "🤚", "_blacklatin_": "😯🖑", "rastababy1065": "🖐🏿", "peafraser": "🤚🤚🤚", "miss_williams513": "👋 I’m so conflicted but so absolutely in love with these", "teenabugg": "Haha! I'd wear it!! Btw.....you are so adorable! I love your feed!", "thecosycottageinn": "This is the cutest photo I've ever seen! 😍😍😍", "laura_loves_to_laugh": "I wanna call myself daddy dr", "mid_nite_rogue": "I feel weird calling myself daddy but I do not mind at all if someone else bestows that title upon me 😁.", "mrs.kennedy": "Me! 🙌🏻", "sirius_mayhem": "I think I may need this in my life ✋", "thesexualphilosopher": "🖐 *me raising my hand*", "theonetruemes": "👋 💕💕", "mosleygirl1979": "I feel weird but you make it look so cute and your tan is everything @fatgirlflow", "peginestor": "Wow, I love your tan! You look so summery and free! Love you!", "zoinksitscourt": "🙋🏻‍♀️🙋🏻‍♀️", "thatgirl407": "👋 daddy seems weird to me. But that's me.", "colleengrimmmm": "👋🏻👋🏻👋🏻 I think I can get used to being called fat daddy lmao", "stephie_nic": "🖐🖐🖐🖐", "liznoelphoto": "I feel weird and I wanna FACE IT HEAD ON 😂", "yofreshmamma": "@fatgirlflow 👋👋 since I am mom and dad. I need this shirt.", "suzie_magnificent": "Yaaasss! And he loves green!", "lalilunas": "✋✋ even tho I AM the Daddiest (your smile here is so damn infectious)", "shawbeckie1": "Yes, yes, yes!! My feels are all twisted about it, but I think I need this shirt.", "e.laner": "🙋‍♀️ I volunteer as tribute! ✋", "hannahfartz": "i feel like i’m a fat baby but would love to claim daddy as a new title. i think i deserve it.", "sarabland322": "🤚 yass! Complicated and cute!", "yesaurielle": "More of a Zaddy then a Daddy, BUT I GOT A BELLY THO ✊🏾✊🏾", "thesaltlifewife": "I actually think that fat daddy sounds super cute and I loveee the font on your shirts girl!", "o_obrandy": "I’m daddy af not even gonna lie 🤣🤣🤣 nothing feels weird about it actually 😂😂😂🤷🏾‍♀️❤️", "yumaratz": "Looks so good on you. I saw J wearing one, too.", "millennial_messiah": "Omg! So.fuggin.KEEEEYUUUTEÀ", "lifeisjustaknockknockjoke": "🖐️🤪", "weshaxo": "Need 🤘🖐️🖐️", "shelleyshambles": "👋I want to embrace my fat dad vibes", "kenzielove91": "✋🏻 and p.s. you are magical 💃🏼", "ehwhysmom": "This shirt is amazing. I was tempted to buy it but can't justify it. I'm both mom and dad to my son but that's the extent of it. You're so sweet to gift others❤✌", "kjoy94": "I may be lesbian but I’m the more girlie of the two of us but I’m also the fat one she’s the skinny one 😂😂 🙌🏻✋🤚🏻🖐🏻👋🏻🤘🏻I’ll be daddy if i have to be 💚", "ashleyy_._rose": "Literally me. I don't even care what my bf says!!! 😩😒❤", "havokprince": "🖐️ But I love it.", "soul_seeker_az": "👈🏼🙋🏻‍♀️💓🙋🏻‍♀️", "bbyboar": "🙋‍♂️🤔", "xillixa": "🖐️", "phatgirlsareprettytoo": "✋✋✋✋", "athena0423": "🖕 gender roles! Love this shirt!!", "leedobecka": "🙌🏼 Hey @fatgirlflow I’m fat and although I still have some kind of imposter syndrome about my gender fluidity, I’m slowly embracing it more openly. My very first binder just came in the mail today, too! So yeah, this feels perfect. 💜", "thepfafffamilyfour": "I'm Normally momma but this shirt is giving me vibes!", "muffindanishfreak": "✌ like I feel like I could rock it depite me feeling weird about it 😂", "nadireginatto": "@gihbisetto aprende como faz uma foto sexy 🤭", "th3shoshow": "all of the hands raised ✋✋✋🤚🤚🤚 (because I’m the mom friend)", "janellemackmusic": "Yasssssssssss 👏🏽👏🏽👏🏽 i need one of these shirts !", "iambettymabel": "Love!!!!!", "a_saltycupcake_": "I don't have a \"dad bod\", I have a \"father figure\" 😘", "shevswarbrick": "🤚", "tricerahoe": "✋✋✋ I need this so bad it hurts", "geekygirlguide": "✋✋✋I love this shirt...but daddy, but I would still wear it.", "santina.davis.96": "🙋🏼‍♀️🙋🏼‍♀️🙋🏼‍♀️", "admsunshine": "🙌🏻🙌🏻🙌🏻", "hannahspelledbackward": "🖐🏼🖐🏼🙋🏼‍♀️ready to bring dad vibes to all the family bbqs", "everycurlandcurve": "I high key want this shirt to help boost my Big Daddy Energy. 😂❤", "vitalvagabondclt": "I love the style of the shirt!", "unrmeg52": "You get your tum so tan in the summer!", "muckymum": "Who's the Daddy????!!! Waaaaahhh it should be me!!!!! Daddy, daddy cool!! Way to change up your humdrum mum feels! X", "sydneygracebell": "✋I need to connect with my inner daddy.", "hopeinseattle": "✋🏼👋🏼", "hobbitfemme": "🤚🏻 OMG PLS", "proudmum87": "🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️", "cbiscuit.xo": "🙋🏼‍♂️", "heathernobert": "🙋🏼‍♀️", "pamela.r.d": "😬🙋🏽‍♀️", "lauraboo1982": "👋 why do I want this to share with my man?! Kinda love that idea.", "mrsvonpang": "Are the \"fat babe\" shirts on sale too? I'm totally a babe, not a dad (tho some may call me a bitch). Your tummy looks super cute BTW", "j.luhv": "I KNOW IM DADDY. I just need the shirt to tie up the look 😂", "luminarycounselingpllc": "Ooooo. 🙋‍♀️I have super complicated feelings about being called daddy...and I love that shirt! Looks super comfy and love your style here! Keep on rockin’ there. Love what you’re putting out there!", "plussizeadventures": "✋🏼Haha. I'm not even shy but I don't think I could pull this off.", "pittsburghtrash": "🙏✋✋ I'm femme daddy 🌈*?", "missalyssaross": "🤣🤣🤣🤣 This! So much this!", "tanyatopia_too": "I would rock the hell out of that shirt! Lol don’t know if I could get the dude to call me daddy, but I bet my girl tribe would be down!", "liblibby": "👋 I feel weird about it but I want it anyway.", "meg.sells": "🖐🏻 Nerve wracking to broadcast it in the Midwest. But I am a daddy. And want the world to know!", "helloamykins": "✋🙋🏼‍♀️", "fer.nanda.guedes": "OMFG I NEED IT", "i_am_tbray": "✋✋✋ I call myself \"daddy\" when talking to my bestfran, but to everyone else I'm \"mama\"", "nicoleincolor": "🤚🤚🤚🤚🤚🤚", "lesjohns3": "🤚🤪 I so so love this shirt but like you said I feel complicated about calling myself the whole daddy thing but I would definitely rock it cuz I'm a proud fat babe😘", "hipsthatsinkships": "✋ Def feeling complicated. I love it but do I get to wear this as a cisgender straight woman without hurting or offending anyone?", "svetsv2": "🤚🤚🤚🤚", "jujujuicifer325": "holy fucking shit I call everyone daddy, how appropriate 😂", "harley_butler": "🤚BIG DAD ENERGY", "rogueclown": "yesssss. i feel this so hard. \"daddy\" is such a masculine word, loaded with all that means...but on the other hand, there's a certain subversive awesomeness to being nonbinary and claiming the confidence that \"fat daddy\" conveys.", "madelyn__p": "yesss 🙋🏽‍♀️🙋🏽‍♀️", "frenchfriesandfairytales": "I just adore you!!", "strph": "🤚🤚🤚 at times I say “daddy liiiike” when talking about myself in the 3rd person and the coworkers look at me awkwardly. 😂", "_bad_betty_": "Pick me pick meeeee 😍", "squidpais": "highkey love when a girl calls me Daddy, it’s sexy as hell 💖💖💖", "prettykitty385": "🙋‍♀️"}