{"blackeyedbliss": "let that fat flow!!!", "ppbkrbopo": "💙", "sillysonysoso": "Kansas??", "maester.pink2": "You are disgusting.", "emmasimone_": "Bras are the devil. #burnthebra 😂", "darionfox": "Wish I could see it all", "seif_giovanni": "Www sweet fat ❤", "nique1995": "haha! I love this soo much! I genuinely hope one day I get to meet you because you are kick butt person! <3", "amelia_mariah": "I havs given up on clasping bras. I just pull them on over my head 🤷🏾‍♀️", "devilkhan2599": "Amazing and lovely body 💙💙💙💙💙💙💙", "dutch.v.d.linde_": "😂🔫", "mundymike": "@supremegentlemanmeme", "mandypv_": "Ew", "drewmac4": "That’s a sexy back💕", "annportugalm": "@monse57 look", "ssiriano": "No ones bra fits! I believe this with my whole heart.", "schreckwalter": "Tempting fat and fleshy ‼️❤️", "matador1980": "👅❤", "muhseger": "Lindos so big body curvy", "chadroyroyster": "Yes", "franciscoalmonte713gmail.com_": "Rica lengua🔥🔥🔥🔥", "yossipossy": "@miss_minass", "deesview": "I'm with y'all @chickenofpeace @fatgirlflow , bras are instruments of the devil!", "jbdarnell1229": "I are so adorable!!!!", "ahmed_alasmer1": "😲😲😲😲😲", "mldsignservices": "check out them curves xx", "macweenie": "I can back this movement! ❤️🖤❤️#backfatsunday", "ebad_zuwak": "Wow i want it", "adukporaphael": "Wooow looking gorgeous and lovely. I wish to meet you . Where you from", "elknarpd": "Oooooh i love your Kansas tattoo!!!", "forkliftoperation": "Can't even imagine the smell or skin cell buildup between those.... yuck", "panderrsnatch": "So, the tattoo on your back.. are you from thw KS side of KC???", "naomisarah101": "How do I get this confident. I always so ashamed of how my body looks. I'm the exact same size as u an I look at u an think ur body is amazing but I can't see myself the same xx", "hayyyat555": "Bbw", "olfa_ghazouani08": "T9azzz ha tofla", "rubbertrampartist": "I have a Kansas tattoo too", "beamerkathy": "I love your screw it attitude! I'm working on it but I was born to be mild so changing is really slow......hopefully, I'll live long enough to morph into that state of mind!!", "yumaratz": "You just go with your bad self!!! You wear and do whatever makes you happy.", "foxyfattie": "GROWN ASS WOMAN 👏🏼👏🏼 ILL FITTING BRAS 👏🏼👏🏼👏🏼 YASSS😍😍😂😍", "firstgod7752017": "Hi bby", "temmyat": "Fat back Taffy you sure look good to me", "nedraym": "You give an old woman like me hella confidence..... well, I'm working on it. LoL", "jen.allyson": "You are beautiful and loved and lovely.", "bloke058": "Looking good sweetie", "leyafrost": "Bras are a bitch find because I'm a 48C-DD (depending on the brand). I love me a sports bra any day, whether it's gym day or not! 🙌 I usually go without a bra unless it's a family event or going to the gym! 😋 My breasts are too big to not go without one in front of family though and I know I'd get hell for it. 😐", "sandritad81": "@lynn67n1", "peacebrooks29": "Lmao! Girl we belong to the same club cause my bra be rolling up too, lol 🤣🤣🤣", "sleepy.eyes.clxb": "I'm so embarrassed by my back fat lmao", "curiousmagpiebydesign": "Incredibly gorgeous 😘 xxx @fatgirlflow", "q_strom_99_walker": "Sexy @fatgirlflow", "missdanielove": "You’re a badass & I want to be you when I grow up", "just_this_chick": "Ok, I have to know. That bra looks uncomfortable as fcck. So...why?", "ferocious.b": "Rock on!", "chickenofpeace": "That brazier looks painful...just take it off! I hate bras.", "mayamoonpoet": "YUS", "oreos_vodka": "This how many fucks l wanna give ❤️", "cuddlykat": "You keep doing your thing 😘", "_lizjovita_": "What is that tattoo on your back of?", "kylaloftus0322": "Your awesome & very sexy! 😜😍😘", "cleestandish": "You're so fucking fantastic. And you make me continually work on being happy with myself. Thank you 💗", "averagealicia_": "I mean they make bra extender clips but you do you 🤷‍♀️", "sophie__hendy": "You’re such an angel wow❤️", "crescendeo_man": "@fatgirlflow You're So Glamorous in phenomenal I admire your self confidence big girl power ftw", "rens_007_": "Let me hold u", "brittanypaige_____": "@clk._ is this me", "kd_bayham": "You give me confidence in myself ❤ to not give a shit about what anybody thinks and strut my stuff.", "countthewayz": "❤❤❤", "priceless012": "Baby, I change in my car as is I weighed 120lbs.", "extra_nadia_": "You are so freaking awesome", "biggthingzpoppin_": "Lmaooo!!!! Love uuuuuu Corissa and ❤😫 yr hilarious", "catlustrous": "COME ON BACKFAT!! 😍😍😍", "ghostingmyself": "You give people life. If you aren’t an example of what heaven will be why the fu*k would anyone want to go?", "roxybebop": "Perfection!", "pepefuckingsilvia": "soooooo fucking cute", "pittsburghtrash": "\"I'm a grown ass person who will wear ill fitting bras if I please\" 👏👏👏👏😂😂 hahaahahahahahahha!!!!", "melina.rouleau": "That bra strap is hanging on by a thread", "april.lee.rose": "Cutie!", "vitalinali_ego": "😍😘", "mrs_lillian": "My bras never fit right either lol 😂", "emilymanin": "@oohhkatrina love🖤", "sydneybutlerrr": "Plus size B cup here and the struggle is REAL....companies think just cause we’re plus size that we all gigantic boobs. I wear sports bars at this point too because they fit better.", "cheshyrechelsea1620": "I love you thank you so much for posting this. This is by far my most hated aspect of myself but you look so beautiful an happy in this. It's inspiring", "kailurrrrr": "You are literally my favorite ❤", "dya_co": "My life in one pic", "mlj302": "I love that you don’t give no fuck I too am getting there. So love all your posts and hashtags @fatgirlflow ❤️❤️❤️❤️", "esoteribull": "I aspire to this level of \"fuck it\".", "thejasmineswinton": "❤️ thanks for posting. I just adore your confidence!! Reminds me I have it in me too.", "alexdaboss123": "Yassss girl. I love it! Zero fucks given is the best way to live life! @fatgirlflow", "_betsymck_": "The cutest!!! 💗", "debbiesaraceno": "Absolutely the best!!!", "selincino": "You are so Dare. I can’t wear like this. Because I have sooo much kilos :(", "finessecurves314": "Yessss! I’m digging this hashtag!! Lemme pull mine out!", "mermaid_monique": "You're absolutely amazing! 😍😘", "no1saw_": "Exactly why i wear sports bras. Regular bras fit poorly and have gaps in the front. They don’t make plus size bras for A cups. 😑😑", "rozzy_xyz": "Ok!! 😊", "chriscrawford71592": "You make me feel like its okay to like my body. And that's like so hard for me! But I'm trying! Thank you for showing me what true inner love and self compassion looks like. You keep rocking Sunday boss! Love you❤❤❤!!!", "alexisinbklyn": "Omg I love you.", "olive_juice_forever": "Noooooooooooo", "mycahdarling": "Yas queen ❤", "lieslbinx": "Yessssss! Love this", "filigreeandstone": "I threw out all my bras and wear bralettes. I read a study that said bras are bad for you. Not that I needed an excuse mind you.", "__._._.samantha._._.__": "Do you know why they make shirts?! To wear them now where one!!", "ashleighj85": "Your level of zero fucks given is where I aspire to be someday. Happy Back Fat Sunday!!", "body_positive_phat_chic": "You go my sistah👍🌷❤", "frenchfriesandfairytales": "I looooove back fat Sundays!!♥️♥️👏🏼👏🏼👏🏼", "softbr0": "cutie ❤️❤️❤️", "wanderinggyppsy": "needed this. thanks 😄", "shahd199718": "😍🤤🔥🔥", "thegem_in_i_": "This caption though 🗣🗣💯💯💯😍😘👏🏼👏🏼", "zelda_bear74": "I wish I could post my pic here💞 love yours!!!", "chayjoshlivy": "i stopped wearing regular bras about six months ago and now i only wear bralettes that are super comfy cause fuck society 🤘🏻", "r2_y": "😍😍😍 lovely", "comfyfattravels": "hey nice tongue", "portraitdude": "You babes make my day, every day. Oh how I wish I could find my person like you two!", "christsmisfit": "I love her! 🤣🤣🤣 @urfriendjamie read the caption.", "seattlesaphires.lowcarb.world": "👍", "certifiedhonorarypunkrocker": "um?? why are you so gorgeous?? you go gurrrlll!!! xx", "bigrob1968": "Beautiful", "bigmamaboo": "Lol I love this!!! I actually had to go up in size around and down in the cup size in order to find a bra that fit. I used to be a 44DD and now I wear a 48C. Bras are the DEVIL. I own", "_sarusch__": "💕", "copperleaves717": "Honestly once you read a certain boob/band size it’s impossible to find a good bra ANYway!! I bitch about my bras constantly bc they don’t fit well, but they’re like my only choice. You could try an extender? Just to make it more comfy.", "lorienradar": "I love it! And your tattoos are brilliant!", "belligerosy": "Omfg I hate it when ppl comment or make unsolicited suggestions about my underwear. Like well done your bra fits probably idgaf stop telling me what I need I am GROWN!", "lotusblsm25": "As long as the ill fitting bra is choice and not lack of knowlegde! #DoYouBooBoo #LiveYourBestLife #YouCute xoxo", "beccagerrish": "It's Sunday - why are you wearing a bra?! 😂", "cialitra_": "so back fat *is* beautiful 😂😍 I mean I only don't like it when it's on me but", "realgear4realguys": "Love it Girl!", "kahla_91": "It makes a huge difference when you are in the RIGHT 😉 I work for Soma and my entire job revolves around getting women in their correct size.", "sassy.asshhh": "Imagine being this hung up on someone else's underclothing. 🙄🙄 I hope you're having a lovely Sunday, @fatgirlflow", "fly_milf": "I wish i didn't have to wear one period!!! 😂🤦🏽‍♀️", "ellagould97": "❤❤", "sernasaurusrex": "If you can switch to bralets, with out clasp or under wire. It'll change your life. ♥️ Also love your beautiful back fat! 😘", "elisakaren13": "A good fitting bra makes life 2000% better."}