{"krinnyk": "❤️❤️❤️❤️", "orv_vosgah": "you are nice. i love u and very beautiful. you are very sexy. wooooowww❤️❤️❤️❤️❤️❤️😘😘😘😘😘😘❤️❤️", "stephaniebrookbank": "That color is so pretty!!", "jadziagiraffe": "Tay is the absolute best!", "gasponce": "#loooove❤️✨", "devilkhan2599": "sexy body 😘😘😘😘😘🔥🔥🔥🔥🔥🔥", "ultimoboyscout": "Your belly is great", "shamaun.sumon": "Lovely body 😍😍😘😘😘😘😘😘", "brian13card": "Hot Sexy body", "chrislslycord": "God that body is the most beautiful body 😍", "hadiqarhha": "❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥😍😍😍👅👅👅👅", "bbwlovr2018": "What a hot body! 🔥🔥", "_rbn._": "@_schwartz_1196", "muhseger": "Love your boobs", "benniedorsett": "🔥🔥🔥", "ola_roy": "Nice body shape tho", "tom_p86": "🔥🔥🔥🔥🔥🔥", "navneetbansal3": "I like dress", "alvaromaver30": "I love you", "anner9727": "😋😋😘😋", "lillias_to_a_lilly": "😒 ugh hey buddy give this queen a little respect !", "glenwillard": "So beautiful and sexy looking love to see more", "manfredstollner": "b e a u t i f u l 😋", "estrela_ak": "You are always fierce 🍂🍁😀", "_lindsaybee": "This shot of you is amazing, as is your cute thigh tattoo 💖", "izaagudelo": "you are an example, a great person👏", "simplyvernice": "This response surprises me. They’re showing acceptance and this is the reaction?", "linhdo2511": "Beautiful 😁😁", "talpohates": "this “me” tattoo is the best 😍❤️", "hrhkellybarclay": "Confidence is beautiful", "q_strom_99_walker": "Sexy @fatgirlflow ❤️❤️❤️", "marieantoifatte": "I‘m currently in one of the down phases of my bodylove. I desperately want to get working out again but I can’t get myself to do it 😣", "samjamcam2012": "Beautiful 😘", "peppermintgee": "This could literally be me just a few shades lighter lol", "charliechimp007": "Absolutely beautiful xx", "sara.kaltai": "sexy lady", "molliemcbitter": "I’m SUPER curious how your upper arm tattoos felt because I have a similar arm pain from poking or grabbing like you mentioned in your tattoo video.", "weloversize\nVerified": "Verified", "2_fucking_hoots": "You are a savage ass queen. I hope one day to have even 1/3 of the confidence you do. Keep slaying my life babe 😙", "naima_le_chkare": "you are big", "portraitdude": "I love the tattoo!", "my_nigga_los": "😍😍😍😘😘😘", "leave_me_alone_pizza": "💜💜", "lyxke": "This is very much solid advice 😌❤️", "kscohen": "You are stunning!!", "segara.bengbeng_bali": "I like a big girl....", "elly_may_mccallon": "I want to love myself this much. I don’t know that I ever will though 😭", "miss.whatsername": "I have that bra and panty set in black, and I love it!", "queen_disclaimer": "Hey , how are you ? Me and my girls are staying in a shelter we have been for the past two months . I've managed to save up enough to move out I was trying to raise money for furniture for our new place since we lost our old furniture .or if you know d any UNDER THE TABLE JOBS that can help me earn the extra money for the furniture please let me know or if you could share the link in my bio to help raise funds . Anything helps 🙏🏾❤️", "classyenglund": "this pic is so pretty 😍", "amandalee684": "Love love this!!", "kimberly_m_stewart": "I usually skip commenting because I’m all kinds of shy and never know exactly what to say. But, I’m trying to be less shy and show support and gratitude to amazing folks like you. Thank you for sharing this message and all the vibes you put out every day! Your posts truly help me along my journey to loving my own body.", "mcgeehankelly": "I stood butt naked in front of my bf of 4 months today 😁 i dont know why i hadnt before as he has clearly seen me naked in bed! But to just stroll right past him in broad daylight seemed so scary as he is very buff and i love his body! But he definitely didn't have any problems with it haha now he's gunna have to be telling me to put clothes on haha as i love being naked at home x", "chriscrawford71592": "You are excellent and unstoppable!!! Never falter!", "b.nicholem": "This made me want to schedule a time to get my own photos done! I love that you’re so comfortable and confident in the body you have —it makes me strive to be that each day in regard to my own body! You’re just incredible @fatgirlflow! 💖💖💖", "tuh.rinaa": "Yaaassss 😍😍😍", "sincerely_rad": "Thats some nice undies!", "terepecas": "Where you buy your clothes?", "foxyfattie": "Yesss 😍😍", "curiouser_etc": "I’d love if you did a tattoo tour. You’ve gotten so many new ones since you last showed them off and they look so good!", "trutrulov": "Girl your bra and your panties match you winning!!!", "blessedbythree_": "LOVE YOUR BODY POSITIVITY. 🔥🔥🔥🔥 LAWD YESSSSSS.", "robingrae": "You are so inspiring!", "rosiecabral": "Thank you for this post. I gained a lot of weight after my last baby. I’ve been struggling on how I feel about myself. I’m not sure what to do, but I know I need to feel ok about me before anything else.", "yumaratz": "Damn girl!!! You are gorgeous!", "sugarpillz_": "Omg I wish I had your confidence. ❤️", "peyekyadi": "Ok", "barbershamel": "Wooow 😱😱😱 very hot ur body ur sexy 🌹🌹", "saoishell": "I adore the little thigh tattoo! You look beautiful💛", "ivydanielle75": "I love the fact that you are unapologetically you! You are beautiful! working on having that same confidence and self love. ❤️", "somewhere_under_the_rainbow": "Love this! (& get naked around yourself!) 🌈", "emmajb_w": "❤❤❤❤❤", "drop__of_golden_sun": "Gorgeous!", "lovelystarlite": "Your body and your soul are fire! 🔥", "rosemaryandquartz": "Super cute undies!", "this_is_erica_b": "“Bodies are cool af” Truth!!!", "jannettexo": "I look at you and I get so hype because you’re so beautiful but then I look at myself and feel horrible 😩🤦🏽‍♀️ you’re radiant.", "missmermaidezpublic": "Beautuful pic 💕💕", "aimeeaurora_": "You look aMAZING 👏🏻", "kathryneporter": "Thanks for helping me love me.", "amersist": "This picture is 🔥🔥🔥🔥", "karenbgz": "i kinda look like you and seeing you so beautifully comfortable with your body makes me feel confident too. you look gorgeous ❤", "goodbodieskc": "Fun fact: while going through these I kept singing Ms new booty.", "curvy_ariel": "Ahhh I love this pic ❤️❤️", "breezybalanceyoga": "Any space you happen to be standing in exists in that moment to allow you to be whoever you are - be YOU! prance around & laugh out loud 😄😃👍😂", "megaloser7": "I’ve been contemplating doing a budoir shoot for my fiancé, but I haven’t talked myself into doing it yet. Maybe soon!", "luellaarbre": "Yesss need more fat bodies with this style of photography ❤️❤️❤️", "jorgearellano_2": "😍😍😍", "anapcliz": "Keeping people like you in our side is like massage in the self-love!"}