{"hasselburgh": "You're not \"brave\", that is what a fireman running into a burning building is. You're delusional & quite frankly obnoxious/annoying/disgusting.", "wnabeperfect": "No one really thinks you are confident or brave.", "squeennurse": "i hate hate my belly stretch marks and scars. I feel like if they were gone, I'd look better. but then I see you and i see someone confident, \"flaws\" and all. I am in awe of you. 💛", "brian13card": "Very Nice and Sexy", "singh12517": "Message me all", "chrislslycord": "Yes!!! Love all of that 😍 😍", "trish_alee": "I need your confidence! 😍", "riseandshinemissy": "I am really sad that people really get some kind of gratification coming after @fatgirlflow. Like I know in theory it is not even remotely a reflection of her and is more so about their own self hatred but damn it pisses me off.", "brown_honet": "Big 🍑", "omg_its_valdineia": "Parabéns você é linda", "smalltown.countrygirl": "IF Y’ALL AIN’T GOT SOMETHING POSITIVE TO SAY ABOUT THIS GORGEOUS WOMAN YOU BEST HOP OFF BULLYING AND IGNORANCE IS NOT TOLERATED HER THIS IS A SPACE OF LOVE. Y’ALL CAN’T ACCEPT THAT CAN YOU? NO CAUSE SOME PEOPLE JUST HAVE A PROBLEM WITH OTHER PEOPLE BEING HAPPY. SHOW’S HOW MISERABLE YOU ARE.", "williamsims66": "💕💕💕💕💕💕💕", "muhseger": "Yum my yum my boobs", "blackjones20": "Love😍", "lauro_diaz_90": "Nasty 🐖🐖🐖🐖🐖🐖🐖🤮🤮🤮🤮🤮🤮🐖🐖🤮🤮🤮🤮🐖🐖🐖🐖🐖🐖🤢 🐖🐖🤮🤮🤮", "jmrbphotography": "Love your hanging belly, so sexy!", "mswd.604": "😋😋😋😋😋😋😋🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️❤️", "livingmybestlyfe247": "You look the same", "graces_blessing": "You're FREAKING Awesome🎀🎀", "ashmjong": "You need to write a book! <3", "chloephatkat": "You are stunning! 😍 Thank you for your honesty and bravery. ❤", "whatsupchyall": "Why can’t I have this type of confidence?!!! Amazing and beautiful to see a woman loving her body. I’m not there yet but hope to be!", "sincerely_rad": "Hero", "michelle_galaviz": "❤️❤️❤️❤️", "cutlipspeer": "Ive been following you for awhile now your youtube channels and everything. I think you are beautiful and amazing!! You help me with my body image..i am too a heavy girl and i have been ashamed for aling time...you are helping me to embrace it. THANK YOU❤", "stlcardfn71": "👍👍👍👍👍👍😍😍😍😍", "shamaun.sumon": "Amazing darling 😘😘😘😘😘😘", "tealeavesandtarotcards": "🙄😒🤢", "mama.k.nz": "Love it! 😊❤️", "deadopumpkin": "That’s not a sustainable body - the lifespan of that body is severely limited", "cuticlepusher": "Not only do you have a rad bod, but your lingerie game is amazing!", "corinne.landucci": "Wow!! Thank you @fatgirlflow for allowing me to see the beauty within myself. Your words really hit home for me. I always look for that damn good picture and I just realized \"why\"..screw it. They are all me. I need to love all of me. I will love all of me ..and if no one likes the way I look, then Fuck em! They can go somewhere else. I think your attitude and positivity are absolutely amazing. Again, thank you for helping me open my eyes!!! Love ya lots hun!! 💟💋", "deserieh": "Also in the tradition of Aretha- R.E.S.P.E.C.T. There is no need to go out of your way to insult someone or be an asshole. If something does not appeal to you, there's no reason to open your mouth about it. Feel free to pass on by with your opinion unexpressed and keep it to your own damn self. Nobody needs your negativity.", "orv_vosgah": "💝💝💝💝💝", "curvjness": "mindset is everything! love it! there's all kinds of beautiful in this world😘", "hay_et_94": "i love your confidence and the fact that you made peace with your body ,i wish i had that", "duskonig": "LOVE!!! Love the post even more than the pic! You are awesome! Thanks for sharing!", "lesleynj14": "Oh I hear ya loud an clear, it takes way too much energy to waste time worrying about HATERS", "oshea2567": "You should be proud of your body. Also if you love your body you should take care of it. Your beautiful body and organs don't need extra to have to carry arou d. Diabetes, high blood pressure, and certain types of cancers are associated with having too much fat on every body.", "sisi.loves.peep": "please may i have some spare confidence?😪", "tilee18": "Gorgeous!👑👑❤️", "lupippin": "👏🏼👏🏼👏🏼 Your words are just what I needed. Thanks.", "charmcollector73": "I wish every human could feel this. I've never EVER been ashamed of my body regardless of its size. BUT I have done as you've as you've said and tried to pick the best photo and you're right....They're all the best photos. Thanks for that ♥️", "26kleisen": "The only sustainable choice is to be yourself. 💪", "skyebreeze21": "YES!!! ❤❤ Love both the photos", "__jojo_s__": "❤️", "artim6476": "Fascinating 👌🏽", "sophie__hendy": "Ahhh so beautiful 😍💜", "neyllaraquelldepaulataborda": "Uau ! Disse tudo, parabéns gata!👏👏👏🤔", "supersonicgay": "You're so lovely, thank you for this. I needed to see it💖💖💖", "xavierbourgeais": "Sublime 👍😍👍", "evelyn_siciliano": "😩🙈", "missladitasha": "@fatgirlflow 💝💝💝💝💝", "summer_and_eden": "Body positivity aside. You and your girlfriend look like you both have gained a lot of weight recently. So do you guys eat whatever you want? I thought body positivity was to love yourself but to also and try and be your best self, as in healthy? Not love yourself to a early grave.", "slyedwards": "It’s always easier to see the beauty in others before you see it in yourself! I am taking notes here and am gonna stop taking 100 selfies to get the one perfect shot. I am me and I am beautiful in every one!! Thank you @fatgirlflow for your body positivity and sense of humor!!!", "michibo1998": "Girl you the best realist bitch on IG", "neelamjani143": "🔝🔝🔝🔝🔝🔝🔝🔝🔝🔝🔝", "ready4joy": "Yaaasssss girl!!! 🙌🏻🙌🏻", "reneatonya": "This is literally me and I love you for this", "__alu_x_": "This picture is disgusting.", "theselflovemamaxoxo": "AMEN🙌🏻👑🔥💕💜", "ccorinnef": "💖💖💖💖🔥🔥🔥🔥🔥", "cariadbooks2015": "Beautiful this month iv been working on me but my biggest problem is myself iv not learnt to embrace me my curves I have a photo shoot booked next weekend and we'll it's scary. I am me but I'm scared of me.", "miss_marylola": "I love this, I love the confidence and the boldness to just be yourself and don't let the public dictate how you feel. I'm beginning to learn now how to love me as I am😊 Thankyou for helping x", "debbibach": "I love this", "northern_hi_jynx": "Oh my god girl. What you said. Is exactly what i'm going through right this very moment. I'm right in that energy flow swimming along side you. I don't have it in me, not to just be me, anymore either. A lot of people really don't want you once that happens. The greatest thing in the world happens when it does though. The ones who stay. Or enter your life and do want you. Are real. Love and light to you. All day every day. 🖤👊💜", "mariasydow": "Love this and love ur lil tattoo!", "ashokkamliya": "❤️❤️❤️❤️❤️", "ginnyatchison": "You and @comfyfattravels are helping me a lot with my struggles relating to body image/confidence and I wanted to thank you💗 And by the way you totally rock the belly hang and flat booty👍👍🎉📸📸🔥🔥💯💯✔✔", "mstjames_2007": "I know that's fucking right. Fuck theese haters your beautiful inside and out", "lizard.cheeks": "❤️", "lovelynessa520": "I admire you. I wish I could get where you're at. I just do plus size outfit of the day and nothing else. Lol", "biggredd510": "Do ya thang girl!!🤗", "afrheaux": "Love it!!!!!! 💗", "katherinelutz23": "🔥❤️🔥", "lvurlf612": "You are so beautiful & inspirational.", "martinifontaine": "❤️🔥", "mamakiwi97": "My butt used to look so nice but I started gaining weight and it started looking a bit awkward, but it's super lifted from the side and flat from the back. I hated my butt there for awhile because of seeing all those girls with big nice booty's but now I realize all it is is confidence! Thank you so much for helping me realize this!", "plussizescuba": "😍😍😍😍", "lavme83": "💙💙💙", "artofchelsey": "be inspired by the magical booty & words of @fatgirlflow to love yourself a bit more today my friends ❤️ @trishipants & @oflairegan 🙌🐼", "thatoneyogi": "❤️ yes!!!!!", "peppermint_shears": "👍👍👍👍👍👍", "trutrulov": "I just dont give two s$%t of what people think. I love my body every lump bump and curve.", "chriscrawford71592": "You are an excellent human being! 10/10! Would high five!", "shannon_shortcake": "Gah damn I love you!!", "alysa.mamun": "💞💞💞💞💞", "sayshesclassy": "I'm tired too! Onward and upward for fatties living their best lives!", "muckymum": "#notallheroeswearcapes You are awesome!!! Love the photo but the caption is positively transformative thinking for so many. Thank you so much for being one of the many fantastic folk on my newsfeed to constantly uplift, support and normal ise my body and all bodies!! xx", "mariacristina4201": "You look stunning...", "roeteddy": "So beautiful 👏❤️👏❤️👏❤️", "lovelyletxo": "Reading this really touched me... Because I want to model & be someone on instagram so bad, but every full body picture I take, never gets posted because my stomach doesn’t look flat, my cellulite looks bad, my double chin is showing.. So I spend an hour in my long mirror sucking in, turning certain ways, changing angles, Just to get a decent picture to actually post and it’s exhausting. Then I come on instagram and I see the Effortless Beauty of True Confidence in Your Pictures💖 and I pray that one day I’m able to let go & embrace my insecurities too. I Want to Love MySelf... Double Chin & All 🙌🏻 Thank youuu💕 Your confidence is contagious and I hope to catch it ALL😍☺️", "myinvisiblebff": "Y e s Q u e e n. Beautifully said 💕", "yumaratz": "It does not matter what angle you shoot the photo, you are still beautiful. Haters will always hate, your decision to ignore them is wonderful.", "actitudplussizepr": "😳🌸 💕", "kacy_caldwell": "@dvnmari", "sillykmc48": "I really needed to see this. ❤️", "bloody.berry": "you inspire me so much thank you", "djkoldkutz": "THIS CAPTION!!!! HOLY SHIT!!!! ❤", "redwitch84": "You are so beautiful.", "beipr80": "👏👏👏👏👏", "katfisk": "Hell yeah ❤️", "sweet2guns46": "Our body is just the jacket our soul wears! Love yourself", "comfyfattravels": "Luh that bod", "eilluwtfad": "I. FEEL. SO. SEEN. thank you 😭 you're a wonderful bean", "chelseyleighwhite": "Thank you for this! I’ve been down on my belly hang but this has given me new life 🙌🏻🙌🏻🙌🏻", "wanderthewoodlands": "@rachel_rae_924", "barbcole7": "Love this!🖤", "beyourjoy": "Amazing post! Love it you’re amazing", "hair_doll24": "This seriously gives me LIFE!!! I think we’re right around he same size and I LOVE being naked. Or minimal clothing as possible. My mom has always wondered how and why... and it’s simple. I was given this body, and I ACCPET IT! All of it! ME FOR ME! #YASSSSSS", "terihofford": "This .is what I've been saying👏", "miss_hysteria": "Hey there body double! Looking fucking hot 😘", "beardlovinbeerqueen": "That lingerie is fucking hot gurl. U go", "frededemakhiota": "😘", "music_lover1030": "This caption! I love it 🙌🏼❤️❤️ \"Every photo taken of me - no matter how I'm posed or captured - is me.\" Wow, I totally needed that ❤️❤️❤️", "moxiemoth": "You're gorgeous and badass and you inspire me every damn day", "wildercoes": "Yes. Yes. Yes. I needed this. I want to be like this. You are simply phenomenal. ♥️", "mrbnatural": "I was just thinking yesterday how I should post a photo from a boudoir shoot I did that was from a “less flattering angle” because fuck the idea of flattering angles.", "stormienikk": "So beautiful! I needed to read those words today 💖💖", "fatfiercefutch": "holy fuck, Corissa, i (and my belly hang and my flat ass) needed this authenticity badly.", "cedar.willow": "Yesssssss 💛💛💛💛", "sarahlouiseainscough": "👏👏👏💕💕", "tvancort": "❤️❤️❤️", "peyekyadi": "Hot..Muuuuuaa, Ilove yuo", "saniily": "Great!you are inspiring!😍", "hd_sanjo_frm": "😍😍😍😍😍😱😱🤩🤩🤩😘👌🏼👌🏼🤤🤤🤤🤤🔥🔥💖💖😱😱", "andrea_nicole_0818": "Thank you for your unfiltered self! Angles and society be damned! ❤️", "jennsvach": "💗💗💗💗💗💗💗💗"}