{"claudio_distasi88": "🔝", "patty_keen": "@area51employee what a sight to see. 😘", "bootysweat58": "Absolutely repulsive", "gilliscloutier": "Wow! Beautiful!❤️", "poi_send": "Continue loving your curves", "goretropam": "@cutelittletexan thank you!!!", "thegamechanger73": "🙌🙌🙌🙌🙌🙌🙌📸", "sadlergerald": "Can I get in with you🍷", "futaba75580": "❤️❤️❤️❤️❤️❤️👅👅👅👅👅👅👄👄👄👄👄👄👄", "virigarcia77": "sex🔥", "navneetbansal3": "I like bbw nude photos", "jwyhtm": "🔥🔥🔥🔥", "ramezramezmehrez": "Tu es belle ton corp m excite tellement j adore vous m attiré beaucoup mon coeur", "kyle.bates.378": "Sexy goddess yum", "hortelamagnata_80": "Curzao gostoso", "steve.sausen": "❤️", "daniel.bbw": "I wish take a bath with you, 🤩😍", "y2595": "😢😢😢😢😢😢", "bdllhbdlrhmn63": "🔥", "nq8884": "😍😍😍😍🔥🔥", "tho7882": "I love you naked", "_emilybtlr": "@allthefinuffthings", "cutelittletexan": "I’m gonna get hate, but I don’t understand why you wouldn’t want to take charge of your health and lose weight, gain muscle and feel a million times better. Fat activism movement won’t last very long since most of them are just going to die from diabetes or heart failure. Why not take charge of your body and put it to good use? Being obese isn’t sexy darling.", "kraftonjr.robert": "I'd love to wash your back for you sweetie", "pelonroker": "You are gorgeous AND stunning😍😍😘😘", "aziz.zraika": "I really hope and also I want to find a lady like this lady for a serious relationship because I love ladies bbw", "sisi.loves.peep": "you’re so pretty i’m 😡", "jose.miguel.rojas": "Rica!!! 🔥🔥🔥", "maik_fuehrer_": "Very nice big woman 😍🤗🤩", "om_booody_": "@shknooonia88", "bsrdyy346": "👏👏👏👏👏😍😍", "tamosiunasrolandas": "Wau can i with you babe😍😍😍😍😍😍😍😍😍😍❤️", "duisenbaevshaimerden": "😚😚👍", "ginger.tucker.33": "Beautiful", "romildocabral": "@julianojoaquim", "shaumerden_duisenbaev": "😝👙👙👙😘😘😘👍", "therealbodypositivity": "But maybe we have a right to be pissed off at your message, because you haven't done anything besides eat too much. What the actual hell is supposed to be inspirational about eating yourself to death? Which is exactly what you'll do. My grandmother did just that. My dad's on that path. Two of my uncles did just that. You know what would be inspirational? You admitting you have a problem with food, and fixing it, and changing your entire health and fitness level. Showing others that it's tough but it CAN be done. Before you say I don't know what I'm talking about, oh, I do. I used to be 320 lbs. And I used to cling to the \"body positivity\" movement too. And I too said I was healthy, it wasn't affecting me, all of the same nonsense you and others project. Well, further medical tests showed me to be pre-diabetic, my liver was turning into fat due to my diet, my heart was enlarged, and I ended up with uterine fibroids. I got really pissed off that the \"body positivity\" movement brainwashed me into believing I was just fine the way I was. I WAS NOT. You can be beautiful at any size, and I absolutely agree that everyone deserves respect, but I have a big problem with you telling impressionable women not to change and that losing weight for any reason isn't body positive. Losing 160 lbs CHANGED MY LIFE. I no longer have foot and joint pain. I sleep better. Stomach problems are gone. Liver is healthy again. No longer pre-diabetic. I can run half marathons, lift, play tennis, and do sports--something that wasn't possible when I was heavy. Has it dawned on you that your message will eventually KILL women? And can you sleep well at night knowing that there are girls out there who NEED to lose weight to save their lives but they see people like you and decide they're just fine, and they die young?", "chrislslycord": "And you have the most beautiful and stunning body 😍", "schreckwalter": "Wunderschön 😊 ❤️ Beautiful rolls...", "abduel88": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "nanieslove": "❤️❤️", "bbwlovr2018": "Super hot! 😍😍😍", "_rbn._": "@_schwartz_1196", "shaw_lori": "You are stunningly beautiful, gorgeous, and empowering ROCK ON SISTER!", "sabaa51": "❤️❤️❤️❤️", "chocolatebutterfly1604": "Yes hunni love love love the confidence😊", "tenderfish": "😍😍😍😍", "candacecakes": "You're such a beautiful human! 🌹", "mikelattore": "Delicious big lady", "joannamae0712": "Amazing how comfortable you are with your body. I wish.i", "hlc425": "😍", "mrs_stonergrannylogan": "Gorgeous", "bebahh_coronado": "Any tips on not super expensive bras that are good with back rolls lmao i love this woman", "ashleighcerise3204": "You go girl💞", "elleyaya": "Love love love. You are amazing.", "chimere_rogers": "Lawd Honey now I’m all hot and bothered sheesh your beautiful", "indianafox91": "☹", "umarmalik777": "Absolutely perfect 🔥🔥🔥", "cynthia_anne13": "I have a nearly identical body... thank you for making me feel normal!!", "ericastardonkey": "So butter pecan tan ! 😘", "nadirtbike": "I was eating pizza then i see this. I dont want this pizza anymore", "body_positive_phat_chic": "Girl rock it❤️👍🏾", "sgoolesby06": "One day i hope i can be completely comfortable with my curves as you are , u go girl", "trujillolatisha92": "I admire u so much I wish I could learn to live my body as much as u do I inspire to be just like u", "fashionyourlifeofficial": "❤️❤️❤️", "rdhiraj9358": "💋", "stadjer94": "'For as long as possible'... so until you die of a stroke or a heart attack?", "hannaheartless": "I wanna snuggle", "pinkmoonpdx": "RAWR!!", "anniebird_k": "You're so cute! Go on with your bad self.", "lindseymcruz": "Ooh girl! I love it!! Beautiful!!! ❤️🙌👏💋", "katieneuhof": "Ur just so cute!!!!!!!!!", "ms_lady_d22": "That’s right girl!!!!!!!! 😍❤️", "kezia_lane": "Perfeita😍😍😍😍👏", "isthegrassgreener": "You look fabulous!", "jensammen": "Wau du bist eine schöne Mollige Frau", "ruizzcollado": "😍😍😍😍😍😍", "akimithing": "Get it sister!!!!", "suziepuss": "You are truly beautiful. You've definitely have it💋", "hernandezmoises23": "Le mamo su culo y sus tetotas caidas", "meganxxstar": "#backfatsaturday is the best thing I've ever read 😂😂 I love it!!!!! Your so confident!!! 💜💜", "mjnewman79": "#idol", "thatoneyogi": "Love love love😂", "motherduckinggingers": "😍😍😍 incredible!", "elly_may_mccallon": "Goddess 😍😍😍😍", "the_king_zarek": "Ohh hell nahhhh", "alisonrachael": "Wow. You’re amazing. I hate my back fat and this post just made me try to love me a little bit more! Thanks!!!’ 😘", "natty_c6": "Inspirational you go girl", "kp_mushygoddess": "You are glorious!!!💕😊", "mullinsklan": "Cute", "cassy.pennington": "🤗", "sebastian_gomez_lopez": "Ufff! 😮😻", "hannah._.joxoxo": "🙌🙌🙌", "liblibby": "Hi! I need a bathtub pic!", "lesleynj14": "👍👌 always be you😉", "sly__84": "You are so gorgeous!", "orv_vosgah": "wooowww. You are so beautiful I wish I was there", "nicolafarndell": "You have made me understand that we can be ‘fabulous AND fat’ and not just ‘fabulous BUT fat’. My liberation is down to you 😘💕💕", "pauladatkinson": "BEAUTY.", "martynkaxlis": "So lovely! I love how happy you look as well 💗", "sfbaseballlover18": "God I love this so so much. 💕💕💕", "lifeoutsidecalifornia": "Thank you for this!!! Our bodies are SOOOO similar, and I'm on my journey to self-acceptance, and you look SO INCREDIBLY FABULOUS in this pic in particular. You're helping me combat those horribly negative critics in my head. So again, THANK YOU! ❤", "darthona": "Fabulous.", "duskonig": "Love, love, love! Do your thing! Thanks for sharing, but more for being such a positive, practical, fun, vibrant voice for change! (And that goes for you, too, J!)", "fat_fly_brilliant": "😍👑💅🏾", "sara.kaltai": "ill never ever understand why people show hate towards other people who are just living and celebrating their own life and body. All i can come up with is that some human beings are not yet able to evolve outside of the tiny, restricted world they have created for themselves. In that world is a very tightly defined idea of what is beautiful, acceptable, worthy and those things are limited to what fits into a narrow world view. Anything that doesnt fit into their stereotypical tiny box causes a tremendous amount of discomfort and therefore anger and bullying behaviours come out. Ive lived with those people from childhood because im a different color so i totally understand how it feels. Life is so short.... 80 to 100 years if we are lucky. You are beautiful and joyous and evolving, keep doing you.", "hagglar": "@nathankiddle1 happy #backfatsunday", "noahboltonn": "lubly @sethboltonn", "rothkoevans": "You’re so stinking adorable!", "supreme_super_nova": "You look amazing!!!", "missybaker936": "💕💕💕💕💕sexy and confidence 👏👏", "nolatrees\nVerified": "Verified", "yumaratz": "Why be angry at such beauty. You are an inspiration to so many and I will always like and follow.", "memesforvalidation": "iconic!!!", "arbuchinger": "Fucking A, you're cute! And I needed this. Thank you. My cute back rolls dont get nearly enough love from me. 💜", "talesofsummer98": "I miss my tub -_-", "nuances_dune_ronde_": "So gorgeous", "gypsysoul25387": "Go girl!!", "tru_p_h": "Representation matters so damn much! 👏👏👏 Love getting to see 'ourselves' reflected in your life. Not just the 'acceptable' when we're dressed in form-fitting clothes BUT when we're nude and all of our curves and rolls are on display. 😍", "antonioffeitosaffeitosa": "Boa 👏👏👏", "naresh1721": "Wow 😍😍😍", "momof2boo": "😍😍😍🙌", "missteetee65": "🙌thank you", "connies_cuddles": "🌸Awesome!! lol \"throwing these rolls\" lol love it!!🌸", "felimarie_": "#wce omg 😍😍😍", "stronglikebullbaby": "💜💜💜💜💜", "fabulousdarling14": "Gorgeous! 🎆", "deesview": "You betta tell em, I'm bout to be on my half naked flow. Maybe I'll get your confidence one day soon. #btw, you're a damn goddess, #baf ❤️❤️", "kaffdaextraordinaire": "😍😍😍", "ron_r_lew": "Yummy", "amydiane59": "I ♥️ you! Your beautiful and proud of you. That’s all that matters.", "heathen.oakbeard.vbc": "Keep it up x", "melthephotog": "YOU GO GIRL!! Love love love your posts!! You are a beautiful soul!! I am a huge fan of both you and J!! The two of you make me smile.. ❤️❤️❤️❤️", "raman_offical": "❤️❤️😍😍", "linda.doggroomer": "I wish i had this much confidence! You lookgood👌🏻😍", "nigelrudkinart": "Stunning image", "mellbarc": "I wish I was as comfortable as you in my skin.. I admire you for your openness and confidence!! plus so jealous of your tan! (living in Ireland, not enough sunshine 😀🌞🌞)", "xavierbourgeais": "Ouhaaaaa trop belle !!! 👍😍👍", "lulipants": "🙌🏻", "sayshesclassy": "You're just the most. Of all good things.", "meganhultz": "🤟🏼", "whitneywaythore\nVerified": "Verified", "stlcardfn71": "Daaaaaam🌷", "bg_eljefe": "Who’s the Model in this picture she is Sexi as Fuck", "martha_dalla": "You are so funny, I lost it at \" My fat ass is going to be throwing these rolls around\" hahahahahah I can't u so cute.", "dra.johannam": "Looking fierce", "brandyareeves": "I can't decide what I need most... your confidence, or your tub! I'm thinking both!", "jtesouhaitequedubonheur777": "Sexy 🤩", "lusty.lashes": "Looking gorgeous and naturally sexy 💜", "teringpeuter": "@cinteresting", "esrichman": "Thing that just came out of my mouth \"when I look at her body, I don't feel bad about mine. That's why representation is important goddamnit!\" 👏this👏is👏so👏 important!", "infamous_grey10.24": "I wish I had this much self confidence 😭 keep being an inspiration girl! 💞👑👑👑", "comfyfattravels": "jfc how do you just be like that", "sapphiresplendour": "I wish this was around when I was 12 but I’m here for it now thank you corissa", "folutrends": "❣️😍😍😍❣️❣️😍😍", "tattooedtype1": "Bad ass girl!!!", "2v634bbbb": "Damn you a snack😍😍", "chickenofpeace": "💜🤘👍👏🖤", "abiola.04": "Can I be this beautiful", "crazybeautifullover29": "I wish I could be like you and just not give any ***ks you look amazing..", "bobmarleywifey": "@fatgirlflow I wish I could jus be this fierce. You are everything amazing! Thank u for setting a great example for young women, I needed u when i was growing up! So glad your helping women everywhere. 💜💜", "khavanicole": "I love this so much 😍😍😍", "thecraftymagzco": "💖💖💖", "writer_dreamer82": "You gorgeous 😍", "lactosefreemik": "Ur such a positive force!!!!! I love it !! Also your photos are always so fucking nice holy fuck", "encyclopaediabrown": "Jaw fell fully open as I whispered “Yes, girl!” You’re not only doing the most, but reminding me what a bombshell I am.", "mal.zen": "O my damn. My my my....... Delicious", "yamalo17": "Yasssssss girl!! Beautiful picture 😍😍❤️❤️🔥🔥", "thebigdewshow": "Wowowowowow hot dammmmm that's hot!!", "luppicoco": "@alejaoo_ rico!!!", "terrielynns_world": "I WISH I had your confidence!", "vitaminc3c3": "🙌🏼😍❤️🌈🤤", "skorkki": "I only wish I could have seen myself as you see yourself which is beautiful.💖💖💖💖💖", "a.l.y.s.s.u.m": "If 12 year old me only had this kind of body positivity in my life... keep being you Corissa. You're a freaking inspiration ❤️❤️ much love", "barbersmolz": "YASSS QUEEN", "cats_adventuring_now": "Loving your ME tattoo!!! ❤️❤️", "my.random.musings": "You go, girl!! 🙌🏼🙌🏼👏👏", "_lettee": "You are so tanned! ✨", "r.i.pblanca_": "💕👅👅👅", "alves.lac": "My dream... Rsrsrs...", "sumajanedark\nVerified": "Verified", "superdanielleworld": "I need a photos hoot like this 😭", "gertnice_gertrude": "A bangin picture", "citygirl.m.11": "💞💞💞", "kacy2phones": "You are SO CUTE! 😩😍", "thatweirdmomfriend": "👌🔥🔥💗", "spanishliza_": "Back fat Sunday lol what", "theselflovemamaxoxo": "Yasssss QUEEN👑🔥💜", "vonnotkisha": "Yessss!!😍😍✨✨ I love this so much!❤️", "theirlcalla": "I love rolls ~~~", "thriftyfatty": "Honestly daily asking myself what would Corissa do 🙌🏻", "jorgearellano_2": "😍😍😍😘😘😘", "misscarolynjoy": "I just love you so much!💓", "chase0006": "Big girls always winning 😮🤤😍 Damn girl", "jessilmizell": "Looking like a fox 🦊", "petriname": "👏👏👏👏 I fucking adore what you do! Thank you, thank you, thank you! Everytime I see your content I get more strength to be a proud fat woman in my daily life.", "teaching_and_fathering33": "@teppie86", "tessvhaar": "Yes yes and more yessss!!! 🔥🔥🔥", "kshellrude": "Mama! So hot❤️❤️❤️❤️❤️!", "yourgirlcici1": "Girl..you better get it!!!", "thekingsqueen12": "Hot damn, sis😍", "fluidfatti": "i almost shared a #backfatsunday but then chickened out!😭💀 LOVE THIS SO MUCH THO!", "jessbanderson": "Love!!!!", "joshua.aka.superman": "U are an incredibly beautiful masterpiece u are a beautiful work of art @fatgirlflow 🌹💐", "realgear4realguys": "You look just lovely! The confidence is just as beautiful!", "david__holmes_": "Magnifique 💙💙💙🌹💋", "ricola2333": "🙌🙌🙌🙌🙌🙌🙌✨✨✨✨✨✨", "kristy_cobratits": "I don’t know how anyone would see this and be anything but enamored! You, lady, are gorgeous! 😊", "chaotic_cori": "This caption is everything 💕", "amersist": "You are looking 🔥🔥🔥 and like a whole snack :)", "no_victoria_no": "Please do, you're a total babe!!!", "billy.ware22": "I love this, babe", "q_strom_99_walker": "Sexy @fatgirlflow", "chriscrawford71592": "🔥🔥🔥 badass!!!", "vivalaerica": "FUCK YES MAMA! 🤟🏽🤟🏽🤟🏽🤟🏽🤟🏽", "qrida1": "Ooooo la la❤️", "mcesparon": "😍😍😍😍😍 Sizzling!!", "jlcan36": "YAS I love this! Flaunt that jelly 👍🏻😘", "here.for.the.aesthetic": "Dude I fucking love you❤🤘🏻", "ilovemywomenfluffy": "U look amazingly beautifull. Your body is your body. U love it that way. Why? Because God bless U with a great body 😘", "elnegromagnifico": "Keep on keepin' on!", "luellaarbre": "Omg", "keepitdiosa": "Beautiful"}