{"agnes_kozma": "I would have been the same. I always feel like I have to say something but when the situation is happening, I completely shut down. I feel like speaking up, confronting them.. would be rude? In the situation these thoughts are holding me back, like it is not societally okay to just start talking to them... and I always regret it. But I think next time I will try to speak loudly and sarcastically, acting like I dont talk to them knowing full well that they can hear me... but this is passive aggressive kinda so idk. 🤷‍♀️🤷‍♀️ thats why i hate these situations... they dont give a fuck about others and im still stuck with these thoughts", "plantpiper": "You are PRECIOUS and perfection and I would have said something to them about how gross it is to be so ugly in public.", "magnoliasistersmedia": "I haven’t read through every comment so I may be repeating and not adding, but I’d have had a conversation with J about the opposite points that they discussed and maybe even sprinkle in some points of contention that “perfect bodied people” face. I certainly would have spoken about how shameful audible ignorance is and that if people don’t have a clue, they should whisper.", "cadessabacon": "I went to an endocrinologist asking to be tested for hypothyroidism as I displayed almost all of the symptoms. After running blood work he said everything was fine and that I needed to just lose 100 pounds. Fast forward two and a half years and I have a miscarriage due to hypothyroidism. My OB, who is amazing, said that I probably have had it for years and that my numbers wouldn't be that bad if my thyroid was healthy two years ago. She thinks that the endocrinologist didn't even do the right tests because I am overweight... Fat shaming has been a part of my life since I was a chubby teen, but that hurt the most.", "stephanie.bux": "I often wonder if I should say something - sometimes I do, sometimes I don’t. I can’t even define what’s different when I do 🤔 I guess in certain situations I think it’s just not worth wasting energy on - especially when I‘m not my strongest self at the time. Other times I don’t even think twice. And I firmly believe people don’t even realize that by saying these things, they hurt people. Some speak to me about fat people in a bad way and I‘m like „um, you realize I AM FAT PEOPLE“. They then say „well it’s different“. I tell them it’s not. It doesn’t happen again. That’s why I think there’s - at least sometimes - no intention to be harmful there. 💖", "guinwitpen": "I'm pretty positive ppl know they're being terrible and are doing it anyway. I get that a lot of folks try and frame things as \"they didn't know what they were doing\" or \"they would stop if they knew how much it hurts to be on the receiving end of those comments\" and I get that ppl want to be positive about how ppl are in general and frame these experiences as outside the normal realm of accepted public behavior. But they aren't. These are normal and acceptable comments by societal standards. They're horrific and traumatizing and they are absolutely meant to be that way. The intent is to shame us into thinness, or into reclusivity. Fatness is a social justice issue and, like all social justice issues, the salve is systemic change. I mean, screw all weight-and-size-based notions of worth, but my bet is that these ppl knew what they were doing and knew it would be upsetting when they did it. You absolutely have a right to be upset. 100%. And how I react when I am targeted like that changes from situation to situation. Sometimes I say something. Sometimes I don't. But I think that all social justice and liberation-based struggles tend to give the benefit of the doubt to ppl where there should be no doubt that what was intended was harm.", "hpefulhufflepuff": "My husband and I were out to dinner one night and everything was fine. Then a handful of emt's came in and sat down a table down from us. They started talking about calls they had been on and shocked, every one they talked about was how gross/uncomfortable it was to deal with fat people. I remember hearing them say things like how disgusting it felt to touch one woman to get her on the gurney, and how it took so many people to lift her onto the hospital bed. I saw them sneaking glances at me the entire time but I never said anything because I'm too timid I guess. Not to mention when we went to a theme park over the summer and were with another couple. We were in line for a ride and a group of kids behind us started screaming about \"Look how fat she is, that's so gross! I bet she weighs 1000 pounds.\" This went on for about 15 minutes. I wanted to get out of line and just leave but I couldn't because it was a one way kind of situation. The bad part is that the parents were there, they just never said anything. People just fucking suck sometimes and I wish I were braver. My husband is hard of hearing so he normally never notices things unless I point it out and I never do until later.", "sedate_chan": "no one needs to or obligated to call you by some silly pronouns. And what business of yours listening in on their conversation. Talking about bodys is not hateful you just want some excuse to play the victim. It’s freedom of speech don’t like it that is just to damn bad. Stop being fat and maybe peoples words won’t hurt your precious millennial feelings.", "ashycoe": "I'm so sorry you went through that. I recently went to a new Dr and legit he walks in & suggests weight loss surgery without even asking me any questions or trying to actually get any kind of medical history. He must have just seen the number on my chart & walked in with that being the only option for me. I also have family members who think they should tell me what I should be eating which has caused me to have real problems eating around them or talking about health/food in general in their presence.", "soulsinger": "Your adorable!", "sad_but_rad90": "Im pretty sure I would have wanted to say something but *Anxiety* would not let me. I have this terrible habit of allowing people to treat me like shit", "lexierra": "I get that it hurts but you had no business eavesdropping on other people. Mind your own business", "rachel_hallahan": "It’s such a shame to, not only have that mindset, but to not be aware of your general surroundings in public when talking about sensitive, hurtful subjects. Any body is a bikini body, cheers to you and your partner. ❤️", "ahmed_hassan_r1": "So pretty woman ❤️🔥", "jrealtalk17": "They were doing it on purpose. I had someone on an airplane stare at me while asking the flight attendant what the rules are for fat people on a plane needing g to get two tickets. I wasn't even next to her, and I was flying with my two small children - so I had plenty of room. She just wanted to be a bitch.", "indiefishsteak": "I adore this picture! Being comfy is a beautiful thing. And you look cozy and gorgeous. Sorry for that experience. I tend to feel that I don’t have the words to sway someone who will not hear me over the thoughts in their head. But who knows.", "quantumpeeper": "I had an incident like this and I said, “Me: Hey I know you don’t know this, but if you talk negatively about your weight and fat like its a bad thing in front of someone who is a bigger person, it could seem like it’s shaming. I know you would never do that on purpose, but it’s hard for a person who’s had weight issues to hear someone who’s thin talk about being fat as if it’s a thing to be sad about.", "i_am_viraga": "Actually, scientific studies have shown a correlation between obesity and lower IQs", "curve_babe": "Beauty 💖", "gina1bina": "💜", "the_thrifty_business": "I ordered this and it’s on it’s way! Thanks for the code! 😍", "yourclearrose": "Just curious, would you ban everything that's offensive? People have the right to say that they want or have an opinion. I think it's pretty hypocritical i", "tomas.ratke": "Wow!", "holtallison": "@fatgirlflow I love this outfit in your pic. Idk if it’s pjs or an outfit but girrrrlll! In love with it! Where did you get this??", "mashamashavee": "I find people truly believe that if they tell us\"the truth\" in any way possible, it will somehow \"puss", "aquarianamber": "I always end up thinking I’ve heard people incorrectly when this happens and convince myself it’s nbd when it kind of is. Thanks for sharing bc now I feel less hyperaware for noticing this stuff and maybe I too will ask to be moved next time!! 💓", "ericajamie08": "“You know, as human beings, maybe people should trying being more KIND instead of worrying about smarts or looks.” Say something before you’re moved, let them know they’re in the wrong. Say it loud and clear and glare right at them. People like this making the world unnecessarily hostile are just the worst.", "ashmjong": "Idk, I could be a self absorbed twat but I often find when people are talking loud enough for me to hear about how their fat friend should try to lose weight that (while they may have a fat friend) they are often intending for me to hear it. Basically them saying this to me under the guise of talking about someone else. My SO has been seated waiting for me and has noticed normal conversation and then how it changes to fat once I am seated. I like to loudly talk about the damage people can do by fat shaming and the over all failure rates of diets. I used to think just ignoring people would make them reevaluate but I'm tired of assholes being assholes lol.", "asanzie": "💛💛💛 hugs!", "momiik4": "I would have said something only bc youre right they probably had no odea they hurt someones feelings or could and until someone does tell them they might not know. I had a horrible sotuation happen where i was ejected from an off-road vehicle and taken to the emergency room while I was on the table and couldn't talk lying there everyone cutting off my clothes trying to help my broken leg Etc when they thought I obviously couldn't hear them in the middle of all this they were making fat jokes about my body telling the nurse good luck finding something under a roll etc etc I stayed in that hospital and acted like I was okay until they discharged me and then I had to go to another hospital to fix myself worst experience of my life so now anytime someone hurts my feelings I speak up.", "lissaclaire": "You say you want to respect their space, but they intentionally didn’t respect yours. I think you should say something only if it won’t hurt your mental health. I’m sorry that happened. ❤️", "demandaleigh": "I would have POINTEDLY asked to be moved, and made it clear for them to hear why. What is WRONG WITH PEOPLE! Are they so deeply unhappy in their own lives that they cannot allow others to exist in peace?! This really miffs me, I am so sorry they interrupted your breakfast with their rudeness.", "iamfatsoiamright": "People can talk about whatever they want. If you felt insulted you aren't truly okay with being fat. Haters gonna hate", "prayforaliens": "No. I've had experiences like this my entire life. Saying something doesn't change their minds or personalities. Fact is: you're living YOUR life. Not someone else's. If other people are offended by your looks, who fucking cares. It's your life. YOU decide what words you hear have meaning. Don't give weight to words belonging to people who don't deserve your time. My outlook: Yeah, I'm fat. Many people don't like it. Do I care? No. Cause I have people who love me and most of all... I love me. And no one else's opinion of myself matters more than my own. I run my life. Not others. Power to my fellow fatties💜", "myershotelbar": "You’re such a beauty, inside & out. Love you and them.", "jameygyms": "I would have said something most likely. Otherwise, I may have gotten a little passive aggressive and spoke loudly about how people talking smack about others within earshot is rude. I hate being passive aggressive though (I try to be open about it all instead).", "kimmysutts": "I've just had life saving neurological surgery in the UK. My surgeon one of the best in the world didn't put off my surgery or saving me because of my weight. He has never made my weight an issue of my tumour although other medics have. I work do many things in my life that impact in a good way on people however I have noticed how people think 'fat bashing' is acceptable now. If I'm generalising I'm not trying to. I was told by a medic that if I lost weight my medical condition would somehow disappear. My condition is a brain tumour that has grown over my CSF pathway. This has nothing to do with my weight but I was made to feel it was...", "kayrawl": "This has happened to me when I was out with a very very veeeeeery skinny friend of mine, probably my thinnest friend. I cant remember if I brought it to her attention but here’s what iiiii did 🙃; I literally stared at the women fatshaming until they looked at me and then I just, stared. I didn’t smile. I just looked in between all of them. And they stopped. It wasn’t the most effective, but it worked and I didn’t have to listen to that specific brand of their bullshit. It endured in other ways but just shitty friend gossip. Made me feel really bad for their friends. Glad I’m not one of them.", "sleepyybabe_": "@fatgirlflow @comfyfattravels 👆🏼", "designerintheavl": "I think you both are wonderful smart and kind and willing to stand up to this bullshit. We are so much more than a fucking bikini bodies!! I love you both and I believe there is enough space in the world for all kinds of humans and their bodies. All bodies are such good bodies. I am so sorry you had to hear this 💩 at breakfast!", "kstn7": "Blerg. Sorry that happened to you. I think it's equally possible they did it intentionally, hoping to 'educate' you indirectly, or were oblivious. To the latter possibility, I can't count the number of thin friends and aquaintences who have so earnestly complained TO ME (3x their size) about their weight or fears of gaining weight or how some other someone is fat now etc etc and it has always perplexed me, because these are all people who loved or liked me. I think self-hate is a given is this cultural context, so they assume I'll 'understand.' I never said anything, but in retrospect, wish I had. With your situation, I think I would move - which would be as indirect and yet obvious as they were being. If they're strangers, it just seems to me that it would more likely be wasted breath and your energy and light should be saved for those who matter to you, or even just for yourself!", "artemis_blac": "You should have just changed tables. Public spaces are not safe spaces. People can talk about whatever they want, no matter how it makes you feel. Maybe they shouldn't, but it is within their right as a fellow human.", "itsdaileytime": "I've dealt with fat phobic people for 50 years. I feel like I've earned the right to say how I feel. I would've stood up and shut those women down. I so appreciate what you're doing for people like me 💙", "mashavolzhskaya": "I love you and your IG is literally giving me life as I learn to navigate life in a bigger body. I love you and J and how you two are hunkering down in \"middle America\" and living out your values. It is so powerful. It is sexy. And you two are charming as hell, to boot! Anyway, I had a similar experience with having to listen to toxic diet talk while working out and it was unpleasant, but it also stuck with me that I am so lucky to not live in fear of food any more.", "zoeleparque": "I'm sorry that happened to you. People can be so cruel. Keep on being you because you are AWESOME just as you are!", "liv1307": "😍😍where did you get the outfit??", "kiyonaherrera": "You both are way stronger than I lol because I would have said more than enough to then other women.", "jojored21": "What boring people they must be if that was what they found to talk about. Clearly very insecure about themselves. I would have absolutely said something. Please don’t give these inconsiderate eejits another moments thought. Although sounds like they need lessons from you on acceptance.", "ladykatharinew": "Yes, this recently happened to me at a family event. I tried my best to ignore them completely and talk with others. However, it felt like they were trying to mean girl fat shame me. Or anyone in the room who wasn’t perfectly thin. I’m so tired of everyone critiquing other bodies! I’ll come be friends with you guys, so I don’t have to hear that crap! Seems so ingrained in our society, that no one seems to care if they hurt others. But ignore them! You are beautiful and in love!!", "emma_p_pinder": "I would have wanted to say something but probably wouldnt have. I once had a guy stare at me while i was trying to take off my jumper and my top was hooked in and i ended", "great_dames": "I’ve got two postgraduate degrees and I’m still fat... smarts has nothing to do with it", "tarsha6996": "I was thinking about something similar today ..I was wondering if the people that are like this use those discussions to justify and satisfy why they put themselves through what they do to maintain their appearance ? And maybe they are so easily hurt that conforming to what is perceived as \"normal\" is the only way they can exist ??... just some random thoughts that invalided my brain today 🤣🤣 You two are gorgeous and those people were not beautiful at all..in fact, I don't like them.😂", "bsummerbeauty": "I went to a dr. For foot pain from work... he suggested gastric bypass!!!!! I was like ummm no thanks", "misslulumuggle": "I think it would have been perfectly ok if you decided to interrupt their conversation and let them know they were hurting your feelings! We should not let other people go around saying fatphobic comments (we wouldn't it they were racist/homophobic/transphobic/misogynistic, right?). It shouldn't be anybody's job to lecture others about it, this hatred shouldn't even exist! But maybe speaking up in situations like this could make a difference in how/what others think about beauty standards! Sometimes it only takes one comment to have a great impact on a listener :)", "rociosecrets": "Those two women's freedom ends where yours begins. Don't give them the power to bother you. It's sad but the reality is that they are unhappy. The power to be happy make us invincible! ❤️", "sexsealady": "@fatgirlflow it’s like this..gf those hatters sitting next to u knew what they were doing and did that ignorant mess on purpose they are mean spirited Period. You see ur size has nothing to do with ur personality. Hell i love my sz and it’s not a sz 2 by any means lol. I love the skin I’m in, i love me and u and ur boo love each other. And just because ur eating doesn’t mean ur not doing anything healthy in ur private lives. But truth be told so what if ur not, it’s no ones business. Diva live ur life and keep smiling.❤️", "savannahsbolduc": "Yessssss! My husband and I were flying to Denver a few weeks ago and the guy in the seat beside our (it was a 3 person row) saw us and instantly went straight to the flight attendant. Even took someone’s seat in front of us to not sit beside us (we’re both bigger people). Long story short he got moved back to beside us but the guy who’s seat he took got moved to first class so he went back to his “original” seat 😂 I was just excited I could stretch out!", "pira927": "Hate that type fake people very shallow they have no filter or care there hurting people feelings", "reconstructing_melissa": "I don’t know that I would have said anything but they would have gotten the worst of my RBF for sure. It would have been a very active bitch face, in fact. 😆", "rob180bhp": "Unfortunately a common story through all wakes of life / be confident and be your self regardless of size or shape we are all equal", "liebhabereien": "I like to give you ❤️❤️❤️❤️❤️❤️❤️❤️ to compensate such stupid hateful talk and I admire your patience with bad behavior", "danielle.bex": "I have a similar story related to homophobia with me and a former partner. It was really rough and I have a hard time knowing howing how to react. It was hard because while it seems very obvious to me that the conversation shift was prompted by my presence.... It's a private convo they are having at their table. I had someone once ask me and my friend to change our topic of conversation because she didn't want to hear about it over her breakfast (we were having a convo about STI risks and sexual health). It felt really shaming and shitty to be told that I couldn't talk about my life with my friend over a brunch we had scheduled to catch up. Our convo had nothing to do with her but yet we were being asked to change topic by this total stranger. If someone were directly talking about me, I would definitely say something to them. Where someone decides to put their bigotry on display likely prompted by the sight of me, I tend to leave it alone and try to distract myself.", "mama.k.nz": "Do you know what actually weirds people out in this type of situation? Look over at the person who has just loudly commented on people of size, and say something like \"I just have to tell you, you have THE most gorgeous hair! So beautiful!\" Cue total confusion/embarrassment... keep your friends close and your enemies closer.", "talesofsummer98": "@trakkfx: lol - \"eavesdropping\" by definition is \"the act of secretly or stealthily listening to the private conversation or communications of others without their consent\" - doesn't really apply here, does it, if people shout out their opinions in public and you cannot just turn your ears off ;) But nice display of your stupidity. I won't even comment on the silly - change yourself so others won't bully you - part. Now go back to your parents basement and continue your sad life :)", "_cosmoqueen_": "Today I was cashiering a little kid called me fat and their parent didn’t even say anything about it. He just ignored it. 🙃", "ginnyatchison": "Ignorant & sad. You can bet your buck I would have said something. I'm fat and it would have hurt me too❤♥️❤♥️", "caddyizzle": "That comment about hoping nobody broke your heart made me wanna cry ugly tears. My heart gets broken by stuff like that so often. All I want is to exist & live my life in the body I'm in & it never ceases to amaze me how many people have such a problem with that.", "trakkfx": "And you don't think eavesdropping is rude? Lose some weight and maybe you won't be triggered by the most trivial of things.", "mrosemt": "I work in a middle school and every single teacher/admin talks about their diets ALL THE TIME. It really got to me today and I thought all day about saying something to just my co-teachers, that I'm in recovery and their diet talk is triggering. But all of a sudden it was 2pm and I didn't say a word. Instead I visit yours and other warriors' pages for solidarity. Thank you for that, it means everything.", "brianna_lea86": "A few years ago, my husband and I stopped at Olive Garden on our way home from an amazing vacation. We were seated somewhat in the middle of the restaurant. Some teenage girls were sat at the booth behind us and they instantly started laughing and obviously taking pictures of us. We were mortified. I was on the brink of tears the entire meal and just felt so violated and uncomfortable. Looking back, I wish we would have asked to be moved or I had said something to the waitress or these girls. It's sad that some people are so brazen in their hate for others.", "chelsquishbud": "I probably would've said something. It would have been totally polite, but with a sharp edge. And if that didn't work, I'd straight up shame then for being rude. Cuz that's how I roll when people are assholes. On any topic", "ispeakfluentcoffee": "I’m so sorry this happened to you but also glad you posted this. I’m so sick and tired of the mentality that us fats are “less worthy” or “less intelligent” or simply “less than.” Drives me up a fucking wall!", "leorafulv": "@peacelovemaria that story breaks my heart. I'm so, so very sorry that you had to go through that. That sucks.", "kaiteygirl_boymama0807": "What a sad, petty life to reduce oneself to worrying about other people's bodies!", "oldsmobabe": "My sister used to brag about how thin she was even after 4 kids and how with Child #1, she never had to buy maternity clothes because she could \"just use Roberta's (that's me) regular clothes\". 😡 (We both still lived at home during most of her 1st pregnancy.) Anyhoo, she was going on one Thanksgiving dinner about how much smaller she was than me and her stomach was flat, blah, blah. 🙄 I said, \"Well, there is a major downside to you being so thin. If there is ever a natural disaster or apocalyptic event where food is scarce, you will die before me.\" 🤨", "no._username_.needed_____": "\"Maybe she should let her smart, overweight friend lecture her on how a BMI doesn't define self-worth and self-confidence. We are all not on this planet to decorate other people's lives to their expectations of esthetics\" - That would have been my comment towards J in a matching tone of voice after overhearing the conversation.", "annaw23": "You are so sure! 😍 Sorry those mean people ruined your breakfast. If I was there, I’d support you if you wanted to confront them! Don’t let insecure, unkind, fearful people get you down! ✊🏻", "antoniobarra.4": "Bellissima", "debicet": "I am so sorry that happened to you both !! ❤️❤️❤️❤️", "vandermolen.massage": "Your sweetness and positivity and awesomeness and amazing fashion sense and empathy and kindness and sheer sexiness puts you leagues ahead of those shallow bitches. Don't let them get inside your head - they probably sensed the deep, intimacy and connection you two have (and one that they aren't able to achieve with anyone yet) and were insanely jealous of your enormous comfort levels with yourselves. Not everyone feels comfortable in their own skin the way that you radiate that you so obviously are! Keep shining bright!! You are SO cute!! You are so savvy and smart and steady rockin'!! 😘😘❤️❤️👍👍😍😍👏👏", "makintigh": "Girl that tan is amazing. ❤️🔥", "bbw_layla": "I think it’s only appropriate to say something if they’re talking about/to you. Otherwise what other people say at a table near you isn’t really your business.", "mrsbreez": "The short answer: people should care and be aware. However, they are not. Racial comments/conversation are more frequent and explicit now and it angers me the things I have to explain to my 3 year old because of other people’s ignorance", "indubitablyzara": "I probably wouldn't have said anything, but I would've regretted it later.", "lokobueno": "I look fuxking great", "halfhollywood": "I don’t know if I would have said anything, but I think ideally I would! You nailed it when you said hateful shit shouldn’t be said in public. Perhaps these ppl didn’t perceive what they were saying as hateful, but it was. And if they want to perpetuate hate speech they are free to do so in one of their own homes, not in public where others have to be subjected to it.", "mzfusion29": "Love that outfit you got on❤️😍", "jeremie_lynn": "That’s incredible frustrating. It happens a lot to me when I’m out to eat with my mother. When I notice people watching me, I just flip them off but it still hurts", "short.trips.and.tips": "Ps you're adorable", "hayley_keaton": "Well, imo you didn’t owe them anything and protected yourselves the best you could. I’m sorry you had your breakfast interrupted in such a hurtful way. ❤️ (Honestly, as a straight sized person who occasionally feels the need to step in during situations like this, I would have likely gone over to them and said something.", "spongebobsarahpants": "Im a pretty outspoken person so I probably would've said something", "jinxies.jj": "I have not said things to strangers about shaming people for their body size, or just speaking negatively about someone's weight, but I have told friends, family and people I know that it was generally hurtful, and even hurtful to me, and tell them that someone has probably spoken about me like that. I have felt like saying things to strangers though! I am sorry that happened to you, that is hurtful! People really should work not be so mean about bodies.", "beckywaldmann": "Going through an ugly period right now (about everything associated with me. Breaking my own heart). Your last paragraph was like a hug to me. Thanks.", "tina5x5": "I get where you are coming from. But, you can't control other's behaviours or words... You can only choose how to react to it. Dont let stuff like that bother you. You know who you are and you dont need to validate your exsistance :) peace and love :)", "skybrawler27": "People talk with no regard to who is around them and they do not realize their words may affect someone around them. It’s unfortunate that people do not think about what they say in public. I am not saying people should be senators but we should be a bit more compassionate to those around.", "alissalarraine": "Where. Did you get. That shirt?", "dogluvr87": "Sucks that this happened. This meditation is definitely in order: https://youtu.be/92i5m3tV5XY", "bloomiebloomie": "I was in a bathroom stall listening to 2 women talk about their “friend” and how she needed to lose weight and how they weren’t sure if they should say something to her. I flushed and came out and told them maybe she didn’t think fat was a bad thing that needed to be fixed. And it was terrifying and empowering, but also there was so much more I regretted not saying, like how they were just generally terrible friends. They didn’t respond to me, I’m sure they were in shock.", "adie6472": "😍😍😍", "mslindsaym": "Recently someone who is friends with a friend say in front of me making fun of “backfat on those cheerleaders” I just looked at her shocked and then I left the table we were all eating at. I said nothing but you’d have to be an idiot not to know why I left. I’m a size 16 and she’s making fun of women who are a size zero for being fat. People can’t be that ignorant, I believe it’s outright hate and that deserves to be walked away from.", "shelly_m__brown": "You're awesome and you don't need to put up with that. Very hard to do something in the moment though.", "copperinwonderland": "You can make whatever choice feels right to you but please know you don’t owe them or anyone else your labor, particularly your personal lessons gained from abusive persons such as themselves! You look lovely in this picture!", "ilovemywomenfluffy": "Give them a taste of their own medicine. Let them know what is real. Let them learn a lesson or their lesson.😘 Karma never dies. 🔁", "wirmuesstenmalreden": "Last week a sat in a restaurant with 2 fellow fat friends, we were talking, laughing and having a good time and suddently a white woman stood behind us and took a picture of us. We were so shocked, the guy who served us too, but we didn‘t say anything. I don‘t know why. I normally would stand up, smack that dumb telephone out of her hand and „talk to her“. But i was so shocked in that moment i just couldn‘t", "claudia6390": "😍😍😍You look beautiful", "xlunarlulux": "You bet your pretty ass I would have said something. I do NOT tolerate shit like this and I WILL say something if I hear or see it. I can't stand people like this, it is NONE of their g'damn business how someone chooses to live their life if said someone is doing absolutely no harm to anyone else. Shoulda sat on the little twats until they turned blue. 😒 .. Ahem! Sorry, I just get really heated when I hear stories about inconsiderate morons.", "steflova_theketocupquake": "Even though they were in the wrong, if it’s not part of my conversation I keep moving or ignore it. Why? Because it cost me 0$ 0 cents to mind my business. Move spots? I would and they would’ve got the point.", "nic.nac.391420": "Adorable", "omg_it_speaks": "I would've ordered them a side of bacon", "laura_kiora": "Hi Corissa 🙋🏻‍♀️ I can’t work out from your post vs your additional comments here - are you saying that you guys were sat side by side with them and they ostentatiously, deliberately began TALKING very LOUDLY and POINTEDLY about FAT people (like that! With obvious awareness and eye contact of/with you both) when they saw you? Orrr were they having a conversation that was demonstrably in full swing with or without yourself and J being the catalyst? It sounds pedantic I know, but the reason I ask is - if the former, you should definitely say something if in a similar situation again and should certainly have been entitled to move - in that scenario they’re basically singling out and bullying you whilst you’re trying to enjoy your breakfast, which is completely unacceptable. If the latter, however... whilst showing themselves to be fantastically nasty unpleasant people, they’re as entitled to discuss their “friends” (who needs mates like that seriously?!) as you guys are to talk about whatever you’d like at your table. You could say that it’s akin to overhearing foul comments that should be shut down whether they’re specific to you or not - racism, misogyny, homophobia etc - but then you get into a whole separate thing of whether size joins those things as being utterly non-negotiable or alterable, OR, also, if we’re allowed to police other people’s conversations when they’re among adults and aren’t actively trying to victimise anyone in their immediate surroundings (no matter how truly horrible they are as individuals - they’ve paid to sit and chat just as you have). It’s a genuinely sticky one with valid if tediously well-trodden moral/ethical/logistical arguments on both sides depending on the specific situation. None of which negate however - let’s be clear - that yourself and J felt shitty and that’s crap to hear. Hope you had a good snuggle when you got home - fuck ‘em and don’t let it ruin your favourite brunch spot. 👭🍳🥓🥑", "poisonapple87": "Not to change the subject but where u get those cute pjs from?", "amorousvixen": "People don’t care if it hurts feelings because it’s something they too could go through and feel entitled to talk about it. Critics of others weight and dietary habits feel emboldened and like they are doing a public service if they can cause enough turmoil in another human to get them to skip eating.", "ynestel": "One time I was waiting in line to try something on at H&M and two staff members working the dressing room were gossiping about someone’s weight gain. When I got to the front of the line I told them how inappropriate and hurtful their conversation was and they legit told me they didn’t realize that it could be hurtful. I even asked to talk to the manger who said that I was right and they need better training for staff. I know you were in a different situation but I think some people are so ignorant to fat phobia that they don’t even know they are being fatphobic.", "nichaela.m.b": "Argh i can soooo relate, thank you for sharing like you do, it’s so comforting to feel like I’m not alone, I’ve very rarely stood up for myself, this kinda thing happens to me allllll the timeeee! One of the worst that I’m still kicking myself about not reacting to him, was when I was waiting in line to board a plane, the guy directly in front of me was trying to take my picture with the face camera on his phone, but he was trying to hide it by pretending to take a selfie (I’m not crazy he defo wasn’t taking a selfie, I was the only person in the frame when I saw his phone!) as soon as i noticed I turned my head so my face wasn’t included but why the hell did I not say anything? Grrrrrrrr people!", "marvamaker": "@fatgirlflow you are adorable it is true!Even if you were ugly you and your partner deserve to have a decent going out experience. It's hate speech. It is being prejudice and it is wrong! I am glad that I found you on Instagram. If I had a child I would want her to be as courageous and thoughtful as you. I hope your day got better. I hope those idiots get an education.", "lil_gee_whizard": "People don't realise at all. That's the worst thing about diet culture, it's just the air we breathe. Fat people aren't treated as human, and it's sad to think they probably didn't even register you were there at the table next to them 🙁 I hope you both don't let their narrow mindedness play on you though ❤ their critical thinking skills are well below par if they're not able to question our fatphobic culture, so who's the idiot now!", "jessiicaa22": "Something like this just happened to my husband and I. We were seated outside on a patio at this new trendy little taco/food stand thing, and they sell glass bottle soda’s in all kinds of flavours. Well they happened to have my FAVOURITE one since I was a kid, I haven’t had one in YEARS! I was sitting quietly speaking with my husband enjoying my drink waiting for our food when another middle aged couple sits beside us.. and starts to LOUDLY say there are 40g of sugar in the soda I was drinking and they are so happy they chose water because clearly the sodas are so unhealthy... 😒 there was a lot more health related talk but you see where I’m coming from.. I wanted to cry. I immediately became this big ( ) in a crowd. My husband and I stood up and asked for our food to go immediately. We ate in the car in silence 😫. I just really don’t know how people can’t realize that there words can hurt people so badly. I’m still hurt over it. I wasn’t harming anyone, in anybody’s space, nothing. Yet they decided to intrude into what felt like MY personal space. Looking back I wish I would’ve stood up for myself, but I just didn’t quite know the words to say other than the obvious “I’m so hurt”. I’m really sorry you also had to go through this. I will definitely remove myself from any of these situations going further. It’s not worth it to sit there uncomfortable!", "margotmeanie": "Ugh, that’s so frustrating. What I tend to do is take the passive aggressive route and clear my throat audibly, then I talk about how rude people can be in public and if people are *trying* to be passive aggressive themselves how SHITTY they are, making sure to say it loud enough that I know they can hear. I’m just so tired of people being clueless and mean {on purpose or not}.", "kasey_in_wonderland": "What’s really sad is how people aren’t even cognizant of how insensitive it is to say this around fat people. Some of these people would second guess making comments of that nature around people it could harm, but when it comes to fatness they don’t even see the people around them that it could affect. 😢", "oregan_trail": "You’ve probably already answered this but I’m too lazy to scroll. Where is that too from?", "wandering.soul47": "Im sorry you had to listen to such ignorant people! As for me I have finally come to a point in my life to where I can look at people like that and show them that they have no power over me. That they are only showing their insecurities and ignorance. I know that its not possible for everyone to do this. Sometimes the best thing to do is ask to be moved and let them continue to make complete asses of themselves. Sending ❤ and calming vibes 🎶", "maggiemcgill": "Wouldn’t have said anything but I def would have angrily live tweeted", "watson.figs": "This angers me and hurts my heart. I’m a slender athletic babe with a chubby fiancé (I like my men with meat on them bones) and he’s always telling me how people throw the insult of “fat” in his face. Those gals are empty. They only long to be as rich in soul as the two of you. I would’ve spoken up. They clearly wanted to make fun of (which ok wow what are we 10?) y’all and you would’ve been within the right to shut them down", "yamalo17": "I’m so sorry that happened to the both of you. The asshole in me would’ve said something... I can’t seem to help it. People need to know their impact on others. They didn’t have to say any of that shit. I definitely think this is a lot of projection. They hate their own bodies so think only certain bodies belong in bikinis 🙄🙄. They obviously need to work on themselves. Btw you look beautiful in your picture ❤️❤️❤️", "wenderellainky": "I have. Sometimes it’s been rude and irresponsible as I was focused on humiliating them and making them hurt like they hurt me. And other times it was thought out and meant as education because I have realized ppl are just uneducated even if they think they are educated. I’ve found for me I’d rather approach them calmly and debunk their myths rather than humiliate them and myself in the process. And although it’s taken years the world is a kinder place than it was even five years ago when it comes to fat ppl like myself, and yes we still have a long way to go but I’m hopeful.", "fvalerio84": "Beautiful", "vintagecitylady": "Sounds like their comments come from their own place of insecurity. I have started, as politely as I can, saying something like “I’m sorry you have a bad relationship with your body but so glad to hear you have friends and loved ones comfortable in their skin. I would be happy to help you with resources if you want to learn the same.” It has gone pretty well the 3 times I’ve done something like that. The classic “The only thing people hear when you judge people is how judge mental you are” works when you’re in a 🔥 mood, too 😂", "t_liane78": "A friend of mine was caught in a very similar situation where she overheard 2 girls talking about how fat their friend was when the friend had left to use the bathroom. She was torn, and ended up staying quiet as well. I think I would have too. Mean people really suck.", "motherviolet": "Asking to be moved is definitely a good choice. It also sends a clear message that restaurant management values your comfort while showing awareness that those people are being problematic. Nudge their confidence a little.😘", "caileydarling": "I have simply said ‘excuse me, I am fat but I am not hard of hearing’ or ‘i am fat, not completely oblivious to what is being said near me/about me’ while making very ‘stern’ eye contact. it has always quieted people but really, i know they’re just going to talk about how fat AND bitchy i am when i leave so sometimes i just say nothing and try to brush it off. sometimes i am less direct and simply start a conversation with whoever i’m with (loudly) about fat acceptance, how cruel people can be, and how misplaced that cruelty is. it is sad that fats have to have so many tools in their arsenals to shut down this kind of behavior but it is the reality of the world we live in. it pops my little bubble of fat positivity. i surround myself online with people like you and j and curated a space where i feel safe and heard and empowered and it is jarring to go into the real world and have to hear what i have worked so hard to shed from my life just by stepping into local restaurants. i’m sorry y’all experienced this and i’m glad you’ve got people you can come back to and unpack experiences like this and find support and understanding.", "yumaratz": "I'm truly sorry that they hurt yours and Js feelings. I would have said something and asked to be moved. It is so very sad that being rude and disrespectful of others is starting to become normal instead of the exception. You and J should not put up with it. And yes, you are cute!", "soft.thorned": "I want to make little cards for situations like this that kindly tell people to shut the hell up and learn some respect.", "sadbadradboy": "Ugh, I’m so sorry your breakfast was interrupted and disturbed by such a toxic conversation. But you don’t have to feel bad for not saying anything. It’s not your responsibility to enlighten those who need enlightening! You’re allowed to conserve your energy for YOU and that’s ok! 💗", "comfyfattravels": "Tbh i wanted to be a snarky bitch but thats just the scorpio in me i think", "mypetdevil": "I think you did the right thing. They weren't talking to you. If they were being loud and obnoxious or made comments to you that's different. Totally different.", "andie__june": "I feel your frustration and I have been in situations where I wanted to say something as well. Maybe im cynical and sensitive but I don’t think I would take the chance to talk to someone about what they are saying because I don’t know if it would change what they think/I don’t want anger or ridicule directed at me. But that’s just my own hang up!", "thebeautifulbanker": "I'm so sorry that happened to you. I don't know if I would have said anything, either. You had every right to, but sometimes the emotional toll of the confrontation just isn't worth it. There's no right/wrong answer. Just what's right for you in that moment. Much love to you both. This week has been hard enough without having to deal with that nonsense.💜", "goo_ooder": "Because saying something could have incurred both of you more violence, do not feel bad for not saying anything. I wish that a thin ally/ decent human being had been nearby and said something to them, it’s really unacceptable. I am sorry this happened.", "xnyhcx": "Ugh!! This photo is everything!! 🙌🏻🙌🏻🔥", "purenightmare3": "You should have showed her you in your swimsuits and told her she’s mad because LOOK HOW BEAUTIFUL I AM!!! ❤️❤️❤️❤️ (coz girl you look AMAZING in your bikinis) xx", "ray_and_company": "I try to speak up when I have the spoons.", "devon_beaver": "It sounds like they have their own issues regarding their bodies- i probably would have said something, if for no other reason than to just show them that words can hurt, and that people can wear whatever the fuck they want- regardless of what society deems acceptable", "hakunamakeda": "I’m so sorry you had to experience that. That’s shitty, and I used to get that all the time. “You’re so smart, you can do everything else why can’t you do this?” And for a while I started to believe it. It’s so fucking shitty.", "doinmything67": "You are nicer than me!! I’m past trying to speak to incredibly rude women so I just mean mug!! You’re beautiful!", "kimmaandco": "It happens and I usually am disappointed in myself for not speaking up. I often feel invisible. Maybe fat is a superpower if we look at it that way? The power of being invisible.", "sarahjmurdoch": "It’s amazing to me how if those two women were talking about how much they hated POC, disabled people, gay people.... you probably would have said something. But it seems like open season on fat people. It’s societally acceptable to shame and mock and hate."}