{"khan5870": "Nice", "mirella_brik": "Where's the bottom peice?? @jesstrianni @phine.9 ...HOLY MUJIKU CALLATU", "girlwiththefro31596": "Yes you give me life", "d.e.yarb": "@fatgirlflow I have a big belly that hangs down too and it's really awesome to see you embracing it! I want to be the same way!", "gragra_of_three_": "You are beautiful. I say this respectfully but being large myself its so unhealthy", "ajhay_khan": "nice", "pedroblackjunior": "💖💕💖💕💖💕", "boqassim55": "💖💗💕💓💘💖💗💕💓💘", "violapearcel": "No one will stop you, not even diabetes! Yay!", "samanthaspuff": "Awwwww I hope you feel ok. I don't want your tummy hurting", "warrenddee": "Every woman should have a double belly and rolls Bbw's rule", "shawnbrown1675": "You are so sexy", "marie_kat92": "Um.....?", "abdulwasiuaderoju_": "Wao....I love it fat!", "jaichaudd": "@lau.spam08 woww a minspire vraiment", "elizondo5811": "Sexy", "pftcpgramusr": "Your belly is so cute! 😍", "cowboysandangelsuptown": "😍😘", "hydeparkuptowner": "Bellies are beautiful!", "sebastian_gomez_lopez": "MmmmmM", "antonio.cordeiro.77377692": "Linda", "feistymomma345": "@uhmbri", "mickey.mackey": "The first thing I thought when I saw this photo was \"Damn, she has more room tattoos. Lucky ass.\" You are extremely beautiful. Keep doing you. ❤", "zeb6561": "wow", "anita_c_126": "@mickey.mackey hahahahaha!!! I love that!!!", "x.crazyhazy.x": "Your*", "spurarkar": "wonderful", "anwar.shaeda": "Fuck fuck of of love fat", "jhull41": "Hi", "rahayunis_": "@desniaekaprianti", "sanu_lanjewar": "I wana loovee u ....", "the.samz": "@betel_geuse", "gruliya_666": "Lovely belly💎", "rebecka120": "You love yourself and i love You ❤❤", "ceciliaa_41": "Je t admire vraiment 💋💋j aimerai être aussi jolie et fière de l être ! ! ! !", "ucarsu_rasim": "👅👅👅👅👅👅", "kimberly_lj": "I wish I were as confident as you!!", "armoni2334": "Zairewalker fat girl", "shineonmyloves": "Killer. You're fucking killer. That magenta.", "zhsjzhhzhz": "@mb_brr", "imjemimarose": "@jazz_mc_", "rubyredraspberry": "@fatgirlflow I thought this posting is about the bikini? I guess it's cute as you say but I don't see the bottom...", "fatgirlflow\nVerified": "Verified", "mx.tokes": "SOOO CUTE! Hurray for fat bellies!", "spacedkelly": "love the colors, love your ink, love your belly! rock on!", "mandykay1082": "I said it once and I'll say it again! \"boom bam God damn!\" xoxox *jealous*", "leighgion_of_doom": "you are my psychic sister!!!!! I have been yammering the pay few weeks about how I am fucking OVER high waisted swim wear being the preferred bikini for fat people. I dug so deep on Amazon for low rise string bikinis and put them on my wishlist and was like \"HELLO EVERYONE YES ITS ME, GET ME STRING BIKINIS FOR MY BIRTHDAY, FOLLOW THE LINK, THANK U AND UR WELCOME\". I LOVE THIS LOOK ON YOU!!!", "cass_alicia": "Yaaaaas.", "jousifbakr": "Very beautiful body", "_cutiebellame": "😍😍😍", "moneya_elbrambaly": "@rony.mohamed.1840070 🙈", "mujhoy016": "Envy you sooooo much... i wish i have the confidence you have.... 😢", "medwin1968": "LUV LUV LUV your belly. ...But when did you grow horns??", "thesparklelee": "You look stunning!!", "mamamercenary": "This pic is everything! I of course love your gorgeous belly, but can we just talk about how great you look with those horns coming out of the side of your head....Legit mythical creature vibes boo! Love you!!!!😍🤗😋😂", "rolandeu": "Beautiful and sexy", "bodyposipanda\nVerified": "Verified", "evakarlikanova": "that's just unhealthy..", "thatlyxx": "😳😭😭😭😍😍❤️❤️ how to be you??? Wish i could do things like you do", "wishfulthinking365": "I just got to feeling comfortable in a one piece after having my son. I aspire to be as comfortable in my skin as you are! That suit is adorable💗💗", "haulin_ash37": "Eva. Priv... No what's unhealthy is your ugly personality.", "sumptuous37": "Confidence is key", "portraitdude": "I love it!!! Love the ink, too!", "hamidamin36": "Butiyfull", "mesa_wall_bed_company": "@jon_from_the90s @alexspillwater", "yonniestengelsmith": "I use the diaper rash cream under my boobs! It heals the irritation.", "allie_lydy": "@not.star I haven't but I'll give it a shot! I'm skeptical because my thighs get so sweaty in the heat that I feel like it won't hold up.", "sojohello": "So beyond glad that I saw this photo AND read the comments! Chub rub will be the death of me! It is so painful and so I end up always wearing shorts under skirts, but then I'm worried about them showing :( ruins the fun of wearing the skirt!", "kissedbylich": "@aelurine these comments have some chub rub advice I've never heard of before my interest is peaked I'm always ready for alternative solutions", "lozza_don1": "I L♡VE your confidence so so much!", "_lettee": "Oh my god, you beautiful, inspirational person! I want to paint a painting of you!", "jennypug88": "Beautiful 😍", "fatthighsandfrenchfries": "You are so perfect!!", "bellabloodyqueen": "Stick deodorant and then some cornstarch. 👌", "k0rnbreadmuffin": "I've been using deodorant between my thighs and under my boobs for years. I never thought about putting it under my belly. When it gets sore, I usually put baby powder to help it and it works after two times. I'm gonna try the deodorant thing because I wear my undies under my belly. Not really by choice TBH because they'd roll down anyway. Haha.", "legalgeek": "@a.e.luster I like to use the ChafeZone Anti-Chafe and Blister Prevention stick, but Body Glide works just about as well. Both products are available on Amazon.", "_dimmie": "@a.e.luster try to find a product called 3B Action Cream. Its to prevent chafing and I swear by it. Theres also a Japanese cream called Oronine that works well", "renaissancerogue": "@fatgirlflow @a.e.luster also this is weird but diaper rash cream helps with chub rub breakouts!! It has SAVED my poor thighs in the summer months! :)", "mcommemaureen": "@a.e.luster @fatgirlflow In France, I use a cream for that : Bariederm by Uriage", "lena100100": "Ужас", "kate_winifred": "So cute 💖💖💖", "ehsan_jp1984": "Mmmmm very nice and lovely", "not.star": "@allie_tiger_ have you tried baby powder? I use it during the summer and it's such a life saver tbh", "rasoul.the.great": "💋💋💋💋😍😍😍😍😍", "missgreco": "I always put deodorant under my boobs, muffin top and between my chunky thighs. It's a life saver .. sometimes I'll but gel deodorant and baby powder on top (can get both at dollar tree) works just as well. So sweat and anti chubrub 🙏🏻", "ohsnap509": "@allie_tiger_ I SWEAR by A&D ointment. Or even the Wal-Mart off brand. Not Desitin though. It's ALL I use during the summer, sometimes even in the winter under my belly & boobs. I use to use just baby powder but I felt like halfway through the day it was gone. & all I wear during the summer is skirts & dresses! So if chub rubs a problem, I'd try it out! It's under like $3 too!", "feministkilljoysupreme": "@lightscameratassea your comment is so extra and I love it lol. Keep spreading that love boo", "beeblebops": "I love my big belly and everyone else's! :)", "1nw0nderl4nd": "Help me! I cannot STAND the feeling of anything under my tumtums. It always rubs and gets sore. :-(", "agwanemo": "Very nice sexy pics", "uniquelyedgyoils": "@fatgirlflow I never thought to add deodorant between my thighs! Amazing!", "curvesbecomeher": "Big bellies for the win!! 💛", "gothtrophywaifu": "YAAASSS QUEEN!!!👑👑👑", "brandondarragh24": "Sexy", "niesses": "This photo is actually giving me life. I don't know how I existed before this picture.", "giftzygiftfeeyha": "Sexy", "bigrob1968": "So beautiful and sexy!", "incredible_insomniac_": "Your belly is like my belly! It's so nice to see!", "dixielross": "Get it, girl! So cute! 💕", "ps_from_ts": "Wow. The relief at finally seeing an actual belly being all loud and proud and shit. Thank you x", "sheisfunny": "@crusty_mouse", "pandangela": "@azfullhouse", "staceylauren7": "Girl WORK IT! this is awesome and you look stunning, much love xxxxxxxx", "rebeccaesther": "You look gorgeous!", "kookyredhead": "@fatgirlflow I freakin' love Modcloth. So many cute options for us big bellied gals!", "caseyjeannez": "@kimm_jaeger she says my fav word 🙆🏻", "anibaeash": "Yaaaaas boo! That color is PERFECT on you 💕👌 and girl you always look hot, I hope they are paying you to talk about this bc now I want to go out and but one.", "erinbywayof": "I've been eying that top on ModCloth, putting it in my basket and taking it out. For a small chested plus size gal, do you think it would be a good fit? It looks like it might be too loose/flowy over my small boobies.", "sincerely_cher": "You are so beautiful!! I'm in awe of your confidence. I wish I was as unapologetic as you are. That's what I strive to be one day-Unapologetically confident!💕", "maquswoon": "Yess i have missed your beautiful belly 😊😇", "caylie_1989": "That color is phenomenal on you!! Wow!!", "mollielucpicard": "I LOVE THIS", "_g.e.r.a.l.d.i.n.e_": "BEAUTIFUL! 💚💛💜", "meegwun": "So gorgeous, always", "mbacvk": "What a beautiful woman 😍 what a beautiful smile 😍 what a beautiful tummy 😍 what beautiful thighs 😍 you are a perfect woman 😍 I would love to marry you 😍💘", "celiamoretg": "You are beautiful!", "jam_s_gram": "Girl, you made my week! ❤❤", "brandondavid90": "Wow you look amazing and hot", "andysomber": "I've been on the hunt for a plus size swim suit that isn't high waisted to almost no avail, this makes me so happy!!♡", "caitwinntv": "Alright awesome! Plus your tattoos are so cute!", "jaime_lgl": "Fuck what people say u look cute and sexy with ur belly", "freshdaisy": "Get it girllll", "margotmeanie": "My devilish babe! 🖤😈🤘🏻", "courtneyallisandra": "@fatgirlflow just cried a little when I saw the notification 😩 thank you!!", "readytostare\nVerified": "Verified", "joclynng": "I wish I could be that confident/comfortable 😔", "luellaarbre": "Qt. Is that a new tattoo??", "bellymoss": "ANGEL BABY"}