{"simms1231": "I bet someone is beating her walls senseless. Can’t blame them. She’s a hottie", "the_real_elmalo": "Absolutely loving this👌😍", "xjamesgunnerx": "Sweetheart you are absolutely Curvlisious", "alex_1976_bi": "Looks really pretty and sexy. ❤ 😘", "carusolinda": "Bravo, you beautiful woman!", "transformingtara": "Where did you get this bra?", "blackjones20": "Queen😍", "audreystylesme": "“It’s a perfect expression of who I am in this moment” 🙌🏻♥️😭 This really resonated with me", "oliv.miguelangel": "Hello baby", "leti.pacheco44": "You're a queen ♡", "hernancastaneda35": "Mamasota", "prasun.roy.180072": "Let me 💋💋💋💋💋💋your belly ,", "ohrencoel": "Absolutely amazing body ❤🌹", "jessewiththegoodhair": "Whoa Lady!! I was just scrolling thru the pics of you in that pretty dainty dress and .....BAM!!🌪☄️ Jus spilled my Puppachino all over myself. 😩🌷", "smiley714714": "Awesome tattoos on a pretty lady 😎😊", "karem.ale.7374": "Hy my frend", "georgeare84": "Y like you and your belly😍😍💖💖😘😘🔥🔥🤤🤤🤤", "bluie_lee": "I love your confidence & how you embrace your body. I still am secure to show off my body, I need to be brave like you.", "aussie_tigerr": "gorgeous figure ☺", "rehanorlon": "XXX", "jmrbphotography": "Gorgeous belly! 🤗", "daniel.bbw": "You are fucking cute! 🤩😍", "samanthaheeney": "@levi_livingstone24", "whitneyrose.2": "This is the picture that changed my life. After seeing this - seeing a tummy that looked almost exactly like mine - everything that I thought I knew about my body was challenged. I started reading more about fat activism and the anti-diet movement and filling my Instagram feed with more and more bodies that looked like mine. I just can’t even begin to tell you how much this picture affected the trajectory of my life. From the bottom of my heart THANK YOU for posting this and for sharing your life. ♥️", "katiem254_": "Needed this💗", "hosaynderakhsha_berlin": "I Love your body ❤️❤️❤️❤️❤️😍", "nomad_chiro": "@eissatthelabel 💕", "mrshasretdean": "You go girl! You are amazing and whilst the bra looks ace, nothing looks as good as happiness. Keep doing you 👌👌", "bootysweat58": "kaylacontant No, because I'm not bitter. Thanks for your concern, though, fatass :)", "lealealovescali": "Thank you for helping us retrain our minds that there are no perfect bodies and we should just love whatever body we've been blessed with! #SelfLove", "camilla_viitoriia": "@camillavitoria0", "adiyaman_kemal": "Yerim seni", "dehganmusic": "Omega sexy", "asya_gold91": "Unhealthy", "stephen0711": "Yummmmmy ♥️♥️♥️♥️", "lunabelle_1": "I think loving yourself is awesome. But promoting unhealthy lifestyles kinda makes me upset. My mother has been extremely overweight for a long time and her health has suffered severely. Up until her Bariatric surgery I thought I might lose her. She has lost over 100 pounds and I'm thankful for that. It makes me feel like some people (not you necessarily) spit in the face of things like that. It really hurts. I'm sure that is not your goal and I wish you the best. I just wanted to share that personal story.", "trin.schip": "I envy your confidence.. 😍", "efsearfoss": "I bet your great in bed", "em_bot_9": "OMG that tat is gorg", "antonia.burduja.7": "I appreciate you but still you have to be the best version of yourself, and also the healthiest. 🤗", "scubaemiliomndz": "I love your hanging belly is lovely!!! Warm pussy!!", "williamsims66": "I love your thickness 😍😍😍😍😍😍💕💕💕💕💕💕", "linhdo2511": "Beautiful 🍻🍻", "nooralhuda__": "@heyitsmemaddybee read the caption 🙌❤️", "crazzyy_pat": "Three Six Nine - Damn You Fine 💪😍", "davidtweaver": "And that ink is off the hook!! ❤️", "korly_07": "👍👍", "nataliestrei": "So gorgeous!! 💕", "brad_winston": "Lose the weight. In no way is this healthy or attractive. You are enabling this unhealthy lifestyle. Shame on you. Bitch swine", "jaffacookies": "Wow👀", "muhseger": "Nice big belly", "sofis_place": "WTF is this?? Is this serious?", "r3sp3ctme337": "Why are people on here hating on her confidence? I feel like your ass hole should really find something better to do with your time. I mean get a grip she is happy and yet you people are trying to bring her down that horrible and you need to be destroyed. Girl in a bbw and what you're doing isn't easy I applaud you and your confidence. You haters that clearly need to get some confidence i can bottle some and sell it to ya js. #teamfatgirl#r3sp3ctme337", "geri_gelmiyen_yill_7886": "🔥🔥🔥🔥😈😈😈", "emelia21": "@yinaneo Check this beauty out ✨❣️😘", "jatinder_khokhar": "U r so hot like me", "bold_lion612": "That's a nice belly😍🤤❤️", "papertreesandlimousines": "😍😍😍", "az.iz1604": "🔥🔥🔥🔥🔥🔥🔥", "pomonasgreenhouse": "Thanks so much for this. You never see fatties with hanging tummies. They're all big butt no gut fatties and I need some representation! Because it's really hard to love a big tummy! But this photo is beautiful and reminds me of me, so again, thank you 💕", "lisahastings72": "U look amazing ! Xx", "willinspirit": "💚💚💚💚", "monsiffaycal": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😍😍🔥🔥🔥🔥🔥🔥🔥🔥🔥😍ileve you😍🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "autleav": "Your belly doesnt look cute it looks sickly, help yourself.", "fancydancer95": "I just wanna know how bad your sternum tattoo hurt 😩 yours looks so perfect on you, I feel confident enough to get one now.", "torstoltberg": "So cool", "santarris": "Isn't this just as bad as promoting anorexia?. 😳", "deji.isikalu": "So cute", "simplyamy44": "I am a 3X or 4X depending. I think we may be belly twins. lol. I love your confidence. Your heart. Your beauty. Thank you for all the plus size positivity.", "mii.medusa": "this whole post, your expression, you, your body - just beautiful🌹it really touches me", "prop_b": "Sexy self", "teringpeuter": "@cinteresting", "thelittleredfarm": "Your tattoo 👌", "melis_liss031": "@fatgirlflow how did you get to that point? Where you just love you and don't worry if judgement is happening?", "allpeacherrthang": "A", "rachcro1": "It’s so refreshing to see people who look like me, on social media! You are amazing!!! Xx", "staceymarion84": "OMG so many beautiful comments I can't like them all. However what I will say is you look amazing and I a loving the confidence. You inspire women with pictures like this. Xx", "laurenriley_84": "Teach me! I wish I could love myself, the way you love you. It’s so hard.", "luzmarinaacunamendez": "😳", "swervvybeth": "Your belly looks so beautiful!! 😍", "mochalove714": "Your winning👑!!", "wynnrainey": "O My !", "a_n_a_k_i_l_l_s": "🙌🏼 yass girl!! 😘❤️", "edlo888": "@fatgirlflow you are glorious, beautiful, an amazing light x", "allyouneedisluff": "😭😭😭💞💞💞 Pictures like this are so fucking stunning and important! Thank you for being vulnerable and amazing.", "abbyalowry": "@lkichemsiowaleather2015 I’m reading this over n over bc I needed this today and wanted to share it w u", "curvywordy": "This is such a stunning picture 💗", "therealeileen4566": "What an inspiration you are! I just found you today, and I'm so glad I did. I love your confidence.", "girlgotcurvesuk": "Incredible and so beautiful. ❤️", "bawdyloveclothing": "Damn. LOVE this shot 🙌🙌🙌", "ppbkrbopo": "Stunner 😍", "thejessgillis": "❤️😍🙌🏼", "livaliittle": "i’m so glad i stumbled on this account. so beautiful!! ❤️", "_annie_darling_": "Yaaaaaassssssss mama!!!!", "kayr78": "I wish I had half your confidence", "anniebird_k": "Great shot, great face, great body! 👏 😘", "ms.jannalee": "love this!❤️ rock it girl", "lizzielolalot": "I love this. You look amazing and also so happy. I just wanted to share something with you that I hope could make you feel great like it made me feel great. Check out www.booborbust.com and their facebook group. You may know already but you could be wearing a comfier and better fitting bra. That one doesn’t fit, you need much bigger in the cup and smaller in the back. Advice is only there if you (or anyone else reading) want it. Keep being great ❤️", "thickthighsandplanerides": "These are the pictures we need to see. Thank you so much for sharing!", "jackadossett": "Thank you for being such a great model for others. I truly believe and hope that this is way the world is going ❤️", "kelseahabecker": "This is so beautiful—the image AND the words. ❤️❤️", "radicalxismosa": "“I don’t apologize for it” ✨✨✨", "vyv_vet": "I want to be there at that place of peace thanks 💪💪💪💪", "_lasirena___": "I love this so much. !!", "beckysuesweet": "😍😍😍", "joelle0521": "I have the same body thank you for being so inspiring!!!!", "brytheartist": "Beautiful belly💖💕👏", "kurtzcrafts": "Also, that smile! 😍😍😍", "arantzetazeta": "Thanx", "melvis333": "💓💓💓💓💓", "jameygyms": "💗🙌😍", "thickfit.selflove": "I love this so much!", "mrscarpenter_est2015": "Love it!!", "caitlindubs": "The look on your face makes me think youre up to some mischief! 😍😍 (Belly is super CUTE)", "choppers_for_life": "😍😍😍😍😍", "thedivakurvescollection": "💕💕💕", "elly_may_mccallon": "I love you so much. Thank you for being you ❤️", "mari_schwar": "Totally amazing. ❤️ Thank you for sharing!", "lobstromonous.art": "Thank you for this. I needed it today ❤", "anielle1903": "Ur such a beautiful woman💕💕💕", "buttercreamblondey": "♥️♥️♥️♥️♥️", "mammatessy": "I have a belly like that! 💜", "hjwdewit": "Wow, you are so beautiful! 😍", "trans_fat_alchemy": "💜💜💜", "kornelijazilinskaite": "👌", "mhmdbwmhmd1769": "Wow", "meryemezah": "I wish a can show my body the way u do such an idole", "duskonig": "❤️. Simply ❤️. That is all. Thanks so much for sharing your pic and your perspective!", "samrosey": "This is truly wonderful, beautiful, and amazing! Thank you 💖", "shahd199718": "😍🔥🔥", "blaquemajick_5150": "So sexy girl !!!", "lindabarney2016": "Beautiful and bravo x", "cuddlykat": "Beautiful pic, love your cheeky smile, probably because you are at peace with your body 😍💜", "vitaminc3c3": "Beautiful sentiment. Thank you for your openness and your confidence. You inspire!", "heymavensxo": "Your belly does look so cute!! 💕", "samantinha_k": "I want to like this a million times 👏", "bigbodyskii": "I love a cowgirl", "biggredd510": "You are beautiful", "keribowman99": "The most BEAUTIFUL thing any woman can have is confidence - and baby girl....you’re killing it!!! Hot hot hot! ❤️XoXo!", "paovlov": "You look so happy, what a beautiful way to caption your picture. ❤️", "lovelierbitofmuffin": "You are simply beautiful", "goddess_of_fok": "EPIC 🔥", "gasponce": "#yesyesyes #loooove❤️✨", "prestonsiegler": "😍 Yay for chunky chicks with tattoos! I have a bouquet of roses on my sternum , and I love yours too! Mine reminds me that I'm a work of art, imperfect but still beautiful and worthy. Beautiful, beautiful,beautiful picture and meaningful words ro match!❤ Thank you for sharing your light with the world", "creaturesandcreations": "I have been having a hard time with my weight and weight gain that happened due to illness, but reading this has really inspired me. Thank you for being you and showing you can love yourself, so that others who have similar stories and body types might find it in themselves to seek that kinda love.", "cammy_cam1627": "💕💕💕", "titty_mcboobles_": "@mynamesaretaken love this", "reneatonya": "@jigglypuffjazmine where'd my third boob go?", "ihocuspocusfocus": "😭❤️❤️❤️❤️❤️", "moxie_dee_garnet": "You do look exceedingly pretty here. You always look fab but you can really see and almost feel the feelings you said you felt in your expression and stuff. I hope I can love my body that much someday. Your confident acceptance of yourself and love for yourself is super freaking sexy.", "sarah.brayshaw": "Thank you for sharing your beauty, inside and out, with the world. 😍💕", "wearretheweirdos": "Radiating beauty", "tom_betancourt": "Beautiful honey", "prettysadbaby_": "You make me feel like I can be confident with my little belly.", "joshua.aka.superman": "Extremely gorgeous 🌹💐", "crescendeo_man": "@fatgirlflow you've always done the best at rocking the best self confidence in body positivity plus pushing the envelope setting the bar higher ❤️❤️❤️😍. I couldn't be more prouder of my fellow Kansas bbw goddess", "spacedkelly": "GIRL YES. YES. I am so inspired by how hard you work, and how much you have done for yourself and for all of us.", "tanya3313": "“It’s a perfect expression of who I am in this moment” ❤️👍🏽", "fatisnotaviolation": "Thank you for being here. You give so many of us a kinder & gentler way of seeing ourselves. And we don’t know anyone who couldn’t use more of that in their life. ❤️ Adore you!", "christine_delk": "💖 Gorgeous", "maryjobellavialovessalbellavia": "Thank you🙏", "plussizeunicorn": "@gobefatoutside omg I thought this was you ❤️", "redlou1978": "You look beautiful! I'd love to be able to look at my body with as much confidence and liking for it! There is not piece of my body I actually like...well in fact I just wear a mask that makes me look like I don't care and that I'm a person...but inside I feel lost, alone and hate how I look...so it's lovely to see that you can accept yourself as you are! ❤️", "andrewjohnson904": "Mama mearer you look so sexy ❤️", "instaseanogram": "Dear god", "jmichaelthaartist": "❤️❤️❤️❤️❤️ beautifully crafted", "rokkers": "You look absolutely bloody adorable", "meganowens4109": "More power too you. 🙏🙏🙏 I have hated my body most of my life. I have starved it, excercised it, criticised it..gorged it..finally, I am trying to accept it, not hate it and eventually love it. I am in awe of you and all the body positive warriors..💜🍁💜", "q_strom_99_walker": "Sexy❤️❤️❤️", "nikkers298": "I love your tattoo!!!! Gorgeous. And so are you ❤", "darthona": "Just plain gorgeous", "dear_brandy": "That was beautifully written. ❤️", "thebohofoodie": "😍😍😍", "blouintopguns_": "Cowgirl sexy 🔥🔥📷💗💓💕", "curvegenius": "You go girl!!!! Nothing like inner peace with YOURSELF🙌🏾🙌🏾🙌🏾😻😻", "ellytheknight": "Absolutely beautiful photo and post. You're amazing.💕", "analak19": "I wish i had half the confidence you did! 💞💞", "cher5656": "I’m inspired to continue working towards loving myself as I am in this moment “my body is my body and this is me!💗💗💗💗”", "oliviagrace151": "Beautifully said! ❤️ I struggle everyday with my body and seeing your pictures makes me realize that I am who I am and every part of me is beautiful..", "britnifarace": "The glow 😍 the belly 😍 the smile 😍", "lesliechilder": "Thank you. Seeing these photos is helping me in such a way that I haven't even fully come to terms with yet.", "beyourowngoddesss": "You’re so beautiful and lovely!! You’re contagious!!!🥰💛💛💛💛", "ninaasianbbw": "Hot❤️", "carlykaxt": "You are such a cutie patootie!!", "plusmommy": "Breathtakingly beautiful - your word and this photo ❤️", "fluidfatti": "i needed this so bad thank you for sharing your life, body, and beauty with us💖🖤", "zo2showtime": "You are the fupa queen", "maadvillaain": "that’s A CUTE ASS TATTOO <3 ON A CUTE ASS BODY!! ☮️💗", "dejajourney21": "I love that dang near every comment is positive. You're amazing!", "makeupandballet": "You are beautiful!", "joanne_macasaet": "lovely😘", "darionfox": "Nice belly", "kimglot": "You are just a beautiful human, inside and out!", "ripleydeweyjacksarah": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "shellyhassdenteufel": "❤️❤️❤️", "sandallover": "Beautiful plus luv that tattoo", "claudiapsiq": "Thank you so much for being an inspiration!", "mysonsawyerlee": "I finally found another women who has the identical body figure to me and looks beautiful! Thank you!", "ashtonhopezis": "Love this you look amazing!!! And you are so inspirational 🥰🥰", "hellokeary": "Wow this is so beautiful. Thanks for sharing 😍", "myershotelbar": "❤️👏🏽💋", "tamu_girl02": "Where is the bra from?", "tracyknight4": "I'm pro-fat people and I'm just as big as she is but I don't think I have the courage to do what you do!!! You're my hero!!!", "snarkandsass": "You are so inspiring to me because we have a very similar body shape. Thank you ❤", "basenji_brittany": "❤️", "thugmiss4life": "Sexy ass‼️‼️‼️ 😘😘😘😘😘", "miaraven70": "I wish I had ur confidence", "kailurrrrr": "Your body is so much like mine and that gives me hope that I'll stop hating myself someday ❤", "sfbaseballlover18": "Everything about this make me so incredibly happy. And you do look damn good in that bra and hat!", "kalyn_lioness_keto": "💖💖💖💖💖", "vileinsect": "I never see photos of peoples full bellies when they have the kind like mine, the kind that overhangs proudly and hugely! So wonderful to see this gorgeous photo and read that you had such a positive experience.", "ohitsmedusa": "I'm trying to love myself this much and it's so hard for me 😭", "loree.lytle": "Your joy and happiness and your selflove is so apparent! 💗", "cristinaangelicag": "❤️❤️❤️❤️👏👏👏", "chase0006": "WOW 😯😍🔥", "xo_cara_xo87": "Love your confidence...i'm hoping 1 day I could be too (slowly getting there)Keep the positive vibes going!!🤗", "ferwilliams89": "I wish I could build this confidence up. I wish I could feel this comfortable in my skin.", "britbabe1": "That bra though 😍! Where’d you find one like that?", "elise_tupper": "Goals. In every sense of the word. 💖 @fatgirlflow", "makeupnikki": "Amazing! Love this 🙌🏼", "la_supreme_8": "Omg 😍😍😍 Thank you! You inspire me ❤️", "fancy__necromancy": "The words....i cannot find them.", "stacejaedisco": "Fuck yes!!! This means more than anything for me. Learning to accept and let go and know that what it is, is what it is. You are powerful ❤️🔥🙌🏾", "andreavhera": "Precious ❤️🙌", "histficchic": "❤️ you are an inspiration", "amylovestosmile": "This brought me to tears. So beautiful! 💗", "chriscrawford71592": "I wish I saw people as confident and badass as you when I was younger. I absorbed so much self hate and loathing that it still hurts to look in the mirror most days...but photos like this that exude such inner strength self comfort and happiness make the hard days a little easier. Don't ever stop reveling in these moments Corissa. Keep being the wonderful amazing you That you are! You're making so many lives better and happier including mine! ❤🔥❤🔥❤🔥!!!", "jazzmynejay\nVerified": "Verified", "cattoos_tattoos": "I love this post.You are a a beautiful curvy woman and in this pic all I can see is your huge smile.I aspire to have your confidence ❤️", "limpster13": "LuV the Flow", "liblibby": "Oh my god Corissa. Like, is it ok if I want this hanging on my own wall?? You are so free and loved and it shows.", "auntieandria": "I can't wait to get to that level of loving myself!", "arie_damasco97": "You're amazing! I wish I had as much confidence as you... someday! 💕 #Workingonselflove", "kyla.rose": "😍✨💕", "emmy97xox": "your belly looks so cute, it looks cute like mine, i love my belly, it’s big and squishy but i never show anyone but seeing this just makes me happy that others are happy to show there belly babies to the world ♥️ i love you and the message you send, sending tummy boops 💖💝🎀", "makeit_rahne": "I adore that you have that underboob/torso tattoo. I always say i don’t wanna get one cause i don’t have the body for it. But it looks so good on you", "heyjudette": "Gorgeous!! (Also I seriously want that hair 😫😍)", "ciree_rachelle": "💯💯💯 Not cause u big sexy but cause u look damn sexy 🔥🔥🔥", "vallebre": "We share a near exact body type and I could have wept with joy seeing this. Thank you thank you thank you for being a reflection of beauty I can see myself in.", "d.rosyyy": "Lovely words!!!!😘😘😘😘", "miss_jamie_loo": "Gosh ! Your so amazing 😍", "alexethecurvymay": "Love the chest tattoo too! Damn girl, did yours hurt as much as mine did", "carosaucdo": "❤️", "princess_kingdom": "Stunning", "rebeca4r": "Thank you for helping me love myself", "lieska.guzman": "I want to be like you💕 also want a tattoo like that !", "lando_60": "You look beautiful😘😘❤️❤️😍😍", "naturestwist": "This is such a beautiful shot. 🙌🏻❤️", "halfhollywood": "This is such an amazing picture. “My body is just my body” ❤️", "beyond_goodness": "I loveeeee this soo much I appreciate you appreciating yourself ❤️😍😍😘", "shaw_lori": "Love this shot, and you are beautiful!", "havenmichellee": "Love this 👏🏻", "missbellablitz": "I adore you and J and I aspire to be this comfortable in my own skin. Thank you for sharing, always. You are appreciated.", "amandajanesanchez": "Simply beautiful ❤️", "halle_hathaway": "You are EVERYTHING. THIS IS EVERYTHING❤️", "mamaj1976": "This made my heart smile! You inspire so many of us, I'm so grateful to you 💕💕", "modernvintageclassic": "I love it because you look genuinely happy 😭😍", "glendajean13": "❤️", "ynerissa": "First thing that caught my eye was your bra 🤣. Share the details!!!", "natalie.is": "I know lots of people have already made this comment, but it is incredibly profound for me to see a body like mine being unapologetically featured on social media. Thank you so much for sharing yourself with all of us, and making us feel like it’s okay to just be. @fatgirlflow", "the.bubblegum.witch": "Girl. This literally made me tear up. I'm 90% in love with myself, but mostly with my facial features, breasts, height etc but my BIGGEST insecurity is my \"fupa\" and,to see you out here unapologetically loving and living for yourself is just so inspiring to me I can't really put it into words. Thank you so much for being who you are and letting us know we're not alone in this body type! 💕", "momof2boo": "😍Thank you so much for this❤️", "ariauna_rodriguez": "@fatgirlflow love your confidence ❤️💕❤️💕", "zoemichellee__": "you have helped me become more confident and comfortable with my body. you’re stunning & amazing. i love you. thank you so much ❤️❤️😭", "juliegazuli": "As someone with a very similarly shaped and sized belly, thank you for this. I am not yet at the point where I can be so embracing of my body. But seeing and reading stuff like this is so helpful!", "_mollythedolly": "I love everything about this picture.", "princess.buthelezi": "👑🌺💞💕❤️", "mont7404": "You look beautiful inside and out", "__v__a__l__": "You inspire me everyday ❤️❤️❤️❤️❤️❤️", "sly__84": "You are wonderful and I appreciate your honesty. It's helped me tremendously just by following you and reading your words. Thank you! 💜", "brittanykuss98": "I absolutely love this", "cakestokale": "I love this so much. Thank you for sharing. 🖤🖤", "mel.sack": "So beautiful! Also I LOVE your tattoo!! 💙💙", "stephsteph18": "I love these posts! They inspire me to love my body! Despite being slender, I’ve had my fair share of shaming, perhaps the most common being: “Bones are for dogs. REAL women have curves.” To the bitch that said that: REAL women have confidence in who they are regardless of how they look! Please keep sharing your gorgeous body and positivity! You’re a real inspiration! 🙌", "alexanj80": "I wish I had as much confidence and self body love as you. No one can fully love you if you don't love yourself. Thank you for sharing", "chayjoshlivy": "you are beautiful and fabulous 🖤", "nedraym": "You are most def a Shero!", "iwannasmoke": "Omgee I thought you were naked😂", "stronglikebullbaby": "💘 LOVE THIS", "yumaratz": "You are beautiful! When I first saw the picture, all I saw was your smile, it just lights up any photo of you. I don't give a damn about your belly being out or that you are in a bra and panties, all of you is beautiful, but that smile is definitely killer! Keep posting and I will keep following.", "danmw": "For all those reasons, this is beautiful ❤️", "qpcos_": "Love this! 💕", "silversarah17": "beautiful shot. makes me wanna buy more underwear lol.", "rens_007_": "Delicious 😍😍😍", "denitoval.112": "🔥", "__._._.samantha._._.__": "❤️❤️💓💓🔥🔥💜🤤", "lieslbinx": "Gorgeous!! 💗💗💗", "comfyfattravels": "You are stunning babe💕", "asanzie": "What a perfect moment 🥰", "speaksginger": "I love this sooooo much 💕", "mom2gigi": "Good for you! Some never experience this", "tayskyew": "Shook! B/c you're so beautiful & also because my name is Tay 😊😍", "curvychicxo": "I ❤️ this! You look beautiful 💎", "andrewcssb": "@greghutch08", "spaced_out_rae": "🔥🔥🔥 Beautiful as always. You look great in a hat btw!", "laurenmaggie": "Absolutely amazing 💕", "kayrawl": "Your body looks like my body and I have never had representation that IG gives me. I cannot tell you how thankful I am that you love yourself and share that love with others. I have found a new way of looking at myself recently and it’s because of pictures like this and people like you.", "designerintheavl": "Cutie! Our world needs so much more love for our bellies!", "fatalchemy": "This photo brings me such joy. Absolutely gorgeous. Thank you. I wish I had these images to see when I was young. 💛💐👏🦄🌅", "tershie2": "Where is the bra from???", "mandirashell": "It makes me feel amazing to see someone with a belly like mine love themselves completely.Thank you so much for sharing, it means so much💖", "turbophat": "You look incredible 😍", "hello_kristie": "Belly twins!!! Love this and you!", "alynnemily33": "Love love love love!!!!!", "therebeccasky": "I cant like this post enough! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "takeitfromamy555": "Thank you 🙌❤️", "penneranna": "Beautiful. ❤️", "leslielearningcurvy": "<3", "thrashon": "Nice roses 👌", "amysselflove": "So. Much. Love. For. This. QUEEN. I love you!! ❤️❤️", "haus_wife_666": "Looking like a snack! 😢❤️👏👏👏👏", "xlunarlulux": "I admire you so much for this. To be so accepting of your own body when the world is so judgemental towards it. Too often we're told we need to look a certain way and have a certain body type to be beautiful.. This wordly body is merely a temporary vessel. Keep being you no matter what. ❤️", "arte.tony": "❤️❤️💋💋💋👑👑👑❤️❤️", "hi.molliee": "My son just saw this on my phone and he was like \"why is she naked?\" And I was like \"because she wants to be.\" And he was like \"oh...she's really pretty!\" And then ran off. Lol so I hope no one ever gives you shit for being \"indecent\" because even kids don't give a fuck. Lol", "plussizepioneer": "You are a goddess! I love your tummy! ❤️", "tattooednj720": "👑👑👑👑👑", "lindseymcruz": "❤️🔥🙌", "gordita_goddess": "😍 yes", "positivelylissa": "You are beautiful, and this image shows how confident and amazing you are. We all deserve to feel so comfortable in our skin! ❤️", "fastnyc": "I wish I had the confidence that you have ❤️", "morganlouise.plus": "Cutieeee💕", "riplyofficial": "👏🏾👏🏾👏🏾🖤", "pauladatkinson": "BEAUTY.", "cialitra_": "oh gosh I'm fake crying :')", "xavierbourgeais": "😍❤️❤️❤️❤️❤️😍", "shelbylaine7": "This is a great picture and I just adore you so much ❤️ I never thought of wearing a hat with my undies but now you got me thinkin' 🤔🤗", "mbryant290": "I have no self esteem, no confidence in myself. I wish so much that i could feel the way you do. Im trying but its hard to do. I have been made fun of and laughed at my entire life and that shit messes you up for life but seeing you love yourself and your body makes me want to try even harder to love myself. YOU ARE AWESOME!!!!!!", "lcrate41": "Thank you. Inspiring.", "bitchesgottaeat\nVerified": "Verified", "em_coolwhip": "This photo is so beautiful!!!!💖", "yeehawhmt": "Dayum beautiful", "joyateverysize": "💗Peace is beautiful 💗", "delainey_moon": "❤️", "weiss.baby": "♥️♥️♥️♥️♥️", "lakeisha_robison20": "Beautiful girlie!😍❤️love your confidence!!☺️", "brooksbeauty": "You look gorgeous girl! ❤ you make me brave.", "virtuallykat": "That seriously made me tear up. I love what you're doing with your platform, it seriously changes the way I feel about myself and I'm forever grateful 💗", "itsshannongrace": "I'm in actual tears. Your words and your belly are beautiful! Thanks for constantly being a source of inspiration. ❤❤", "coco_penexplore": "This is such a GORGEOUS photo of you! You inspire me so much! Thank you ❤", "nigelrudkinart": "Wonderfully happy, accepting, and at peace image @fatgirlflow - lovely", "u2.world.exclusive": "Very sexy fat babe.", "madderandfatter": "You’re goddamn beautiful in any size shape or form. I legitimately love you and your wild ass.", "bksiwnf": "👅👅👅👅👅 yesssss", "unicorn_op": "Yasss queen!💪🏼🖤", "peybug_99": "Thank you so much for everything that you do and all the body positivity that you post. It really means a lot 💚"}