{"retronuevojewelry": "Do you have a light box? It helped me when I lived up north.", "imaliteraljoy": "Feeling for you ❤ I'm so in this fucking boat", "fatfuckingnancy": "Thank you for sharing. We are all vulnerable. We are all here. Sending peaceful thoughts out into the verse.", "emilie.morin.f": "❤️❤️❤️ Wishing you comfort until the light returns", "polkadots_pinkmartinis": "@fatgirlflow hang in there doll! Seasonal affective disorder sucks balls. I go through it every year and now I think one of my kids has it too. Sending you much Love and Light💕", "victoria_2.0\nVerified": "Verified", "madilynn23dix": "Try tanning or taking extra vitamin c and d. The depressions comes from a lack of vitamins you usually get from the sun and being outside.", "avaemasaniai": "Sending love from California ! ❤️ You’re not alone", "beckyavery2": "Frickin no sun sads. I have that too. And other time sads. But definitely the no sun sads. And the period sads.", "stephanieraevh": "You're doing everything right. You've gotten through it before and you'll get through it again. Take things one step at a time. You've got this 🙏", "az.iz1604": "💕🔥", "justkathy_927": "@fatgirlflow this broke my heart to read. I'm sorry that you go through this. Wish I was near to give you a great big hug. Thank God you have a wonderful partner. Love you girl. And thanks for writing this. I truly believe you helped save someone.", "allysmiles_": "Hello I am with you! Seasonal depression on top of my already existing depression is so hard. We will make it through this season. We are loved. We are cared for. 💜💜", "cassinprogress": "I feel you hon. I see you ❤️", "nazenin3684": "قشنک", "harlequin_nikki": "Thank you for sharing ❤️", "hasan.nagilo7609": "سلام دوست عزیز خوی حسن زاده", "mementocori": "This is me", "ytuaebgib": "I understand", "sh1nebrightlee": "❤️❤️❤️❤️❤️❤️❤️❤️", "finoulacairns": "You make everyone around you proud by getting up when you feel like you can't, talking about it when it doesn't make sense to yourself and being able to admit when everything isn't okay. So just take it day by day even minute by minute and things will become a little better ❤️ x", "emagreceruivinhaa": "Hi can I invite you tô see my Page? I tell my story how I llst over 50kgs my eating habits and how I keep up with the work, hope you like it! @emagreceruivinhaa", "jewlztay": "SAD absolutely sucks. When we made the decision to move, we moved further south. It has helped, but I'm still dealing with it. It helps to be in sunlight for at least 15 minutes a day and up my Vitamin D. There are also bulbs that you can use that supposedly help. Positive vibes to you and anyone else out there who needs it.", "1buoy2gulls": "((Hugs)) love & prayers!", "_karomontoya_": "Depression hurts it sucks to be the one to worry about everything and anything but we can all get through this by just being there for one another I know it helps me seeing posts like this because I know I'm not the only one who thinks I'm crazy bless you and your heart we will overcome❤️", "carb_zilla": "Same feels. 💗", "luluvaz1": "I wish I had meds!", "_sa.lee_": "I love your posts so much. Thank you so so much for writing all those things that go through my mind as well, that i can't put in words. Never forget, that u are a loved woman. Greetings from a very inspired german girl! 🍃🌻", "april.lee.rose": "I have bipolar disorder so I’m teetering on the edge of major depression all the time. It’s a full time job to try to convince myself that everything including me, is ok. I understand the fight. I know you feel like you don’t have anything left to fight with but you do. You’ll get through it. Remember that it DOES NOT LAST FOREVER! Dm me anytime if you wanna talk. ⭐️☀️🌼🌈💛", "kerrychelle": "Me too.", "__b0nita__": "Wow...this!!❤ Thank you for reminding me that I'm not the only one going through these kind of feelings right now❤", "ruth_gray": "Hey you crushed a watermelon with your thighs and you are AWESOME. Happy or sad, you seem like an amazing person to me. Hold on to the hope of lighter days soon.", "channi31": "@crystal_joy_13", "cecilialadouce": "Courage ma biche ❤️", "life_in_plus": "Oh my.....I feel sad also...I read what you wrote and I see myself except that I'm single mum and I don't have anybody to tell that I feel deeply sad 😔.", "shorty0195": "All I can say is get out more , exercise, eat healthy, have treats, socialists and interact with other people, that’s the key, put on your big girl pants on the outside and own it like a boss !!! I suffered and conquered, it works xx love ya", "nickysw1982": "I always crash after Christmas/New Years. I always have so much to do that I’m distracted, but once it’s all over, I can feel that darkness creeping in. Sometimes I look at my husband and in my head I’m screaming “please stop it from coming”, but I know he can’t and he’d just feel guilty. You’re not alone, there are so many like us. I think all we can do is just do our best to hang in there together and find a sort of solidarity in falling apart and then picking up our pieces again. It’s not much, but every little bit counts. ❤️", "sheila_faye": "Omg, every year I start counting days till the days get longer. My kids tease me but they know it's real. Let's have a toast on the 22nd!", "mrstotty_": "You have literally helped change how I see my curves. Thank you for that. I know it can get hard during certain times of year, but you will get through! We have faith in you💖", "marta_edens": "Depression sucks balls! One day at a time.", "wellnessforthewin": "Okay thank you for this. ♥️♥️🙌🏼🙌🏼", "horror_queen4": "Thank you so much for this honest post! I needed to hear this today. I'm so sorry you are going through this, but it's really nice to know I'm not alone.", "vareagan": "I too have SAD, Seasonal Affective Disorder. No irony there. Most of my family has it. We are from the wayyy North East where they grew up with a shit ton of snow and dark at 3:30 caused a major lack of Vit D and not much to be Happy about. Im from Mass. Now in Southern Mass so it's a tinge better on snow and cold. Nonetheless we are incredibly short on Vit D as well. I too have 0 desire to run out there when it's 17. My hubs goes to work at 3pm it's dark like an hour later and all I can think is, \"Oh must be time to get ready for bed\". Infact my bed feels like refuge. Safety. It gets me", "sz.xo": "Thanks for writing this. I am really feeling the SAD this year but mine manifests as agitation rather than sadness. Hurricane Suzanne in da house and everything is wrong and the world will never be right. But you're right, We'll get through it because we have before!! ❤️❤️❤️", "chronicallypositivejustbecause": "And I thought it was just me...", "medicallyanantique": "Girl you GOT THIS! 😘", "ljm81": "Try feeling that way year round. Thats the clinical depression monster that sits on my back. Its a horrible nightmare. I wouldn't wish it on my worst enemy.", "kristenoakley": "Me too.", "italiataouma": "Wasn't until I moved to live in the tropics that I realised I had seasonal depression all this time I thought nothing could help me and then something so simple and natural released me - sunshine and warmth. Sending you a billion rays across the ocean xxx", "angela.rose.86": "I feel ya girl 😢❤️", "isumusic1997": "I sympathize so much with you. Self care is so important . Thank you for being real with us. Just know you're not alone.♡ lack of light is also a hard struggle for me. One thing we use at home for a couple of hours a day is a therapy light. I highly recommend it to anyone who struggles with loss of light. It does not fix everything but paired with good nutrition, water and meds it can e helpful. We can all do this♡♡♡♡♡", "duskonig": "❤️❤️❤️+++ I’m sorry this is happening to you, but whether you know it or not, you’re a heluva human being in so many ways and no affliction can take that away. Thank you for sharing your struggle and keep on keepin’ on! ❤️❤️❤️+++", "temairshamsul": "Love you Lady! Same here! ((Hugs))", "snausberry": "Try watching the SBSK channel on youtube. without fail you will smile, laugh, cry and feel unbelievably grateful.", "lucyfire777": "Thank you for being so open about this❤️ the World needs more People like you💪 my man is also struggeling with Depressions and winter, especially christmas Time, makes it worse and stresses him out.", "sassyblue748": "excellent job reminding yourself that even though it sucks and hurts, it's not permanent or even unexplained. I've really been struggling myself for a few weeks now..I'm always depressed but it and my anxiety are seasonally worse. Thank you for sharing your truth...you got this!", "sammirow": "I am bi-polar and have major depressive disorder and anxiety year round, however it always felt worse in winter. In the past couple of years it hasn’t been as bad. I forced myself to find beauty in the season just as I do with the warmth of summer, flowers in spring, and fall foliage. Not sure where you are located but i am in New York and I’ve noticed that wintertime places a sense of calm out in the world. It seems as though everything is just a little muted, and when you sit and take it in, it can be a beautiful thing. Hopes that you to start to feel better soon. 🖤", "melie_k": "Sending tons of love and healing vibes 💕💕", "kkanard": "Right with ya. Ty for sharing your vulnerable sadness. Today I could hardly get out of bed— can’t wait for the solstice and light! ❤️", "everyoneneedsselflove": "Stay strong💖 I'm here for you if you need me. Always know that you are loved ❤️ i am so proud of you", "maquillerartist": "Energy! My finger hit the button to fast...sending you some energy! ❤️🌈❤️", "selesnyaconclave": "I needed this ❤️", "natisaninja": "Ugh. I am feeling this kinda way rn. I had a pretty good day and still found myself sobbing on the drive home. Thanks for this. ❤️", "etilliii": "You make me hate myself less and love myself more. So thanks. ❤️", "thelowlowstyle": "Right there with you. I’ve burst into tears every day this week. ❤️", "kawartha_girl99": "@fatgirlflow I so know what ur going thru right now... in the past few months I've lost my brother and mother to massive heart attacks 😭😭💔💔... I had just started liking Christmas again after loosing my dad 13 years ago and now this... I'm so broken inside... I don't know if it will ever heal..", "roowill": "I hv been fighting it too .... It was ok until it wasn’t. And then I started to cry and now I am holding my breath. So I will send you positive energy & pray that 1/2/19 comes quickly 🙏🏼💙💜", "casablanca.mostafa": "You are very beautiful", "radchani": "Wow. Grateful for your vulnerability and honesty and courage and leadership. Grateful for you.", "mary2ana": "thank you for sharing this 💗", "robs3ss3d": "Honesty is a beautifully crafted double edged sword that not everyone can weild so bravely. Hold strong girl! Thank you for being exactly who you are.", "miss_sydney_jane_": "So so so so much love to you", "prettiestar88": "💖💖💖💖💖💖💖", "sayshesclassy": "I am with you. Though my depression is routed in more than just the weather. But man I am a mess. Thx for being honest", "mishaheij": "I feel you!", "moxiemoth": "Oof I'm right there with you sister. It's like, just hang in there until the damn sun comes back", "jultotheski": "Feel you", "darlindidi": "I relate to ALL OF THIS ! It’s hard boo 😫 the constant self coaching in our minds is exhausting . Our sadness meter is at high frequency right now . But I take comfort in knowing that good days will be coming . It won’t be like this forever . 💛", "beardedlady62": "Chubb hug", "missmollydollygoldstein": "*big hugs your way* 😘💜", "christy_lynn412": "I experience this as well. I hope you find peace as the days pass.", "kaitylately": "Weep it real girl", "sincerely_rad": "I feel you, sister", "croyster912": "Come to Texas it's sunny! Turn shit into sunshine!", "rawbeats1182": "Thank you for reminding myself and so many others that we are not alone. Your authenticity is so refreshing!", "aledaviila": "Thanks for sharing this with us, and remember you’re not alone ❤️", "schneckertins": "This is hard but you had the courage to write this and YOU did that. Vulnerability and honesty is beauty even when it hurts or is hard to process. Right there with ya friend. Tbh reading this made me feel like “ omfg thank god there’s someone who can relate”. ❤️", "swanksister": "❤️", "clarkmaleah": "So proud of you for reaching out instead of retreating into your head! This winter is hard. The dark is extra dark and long. SAD is no joke.", "luckymarita": "I wish the weather was the reason for my depression. I don't know why ( this happens to me at least 6 times a year) but I'm sure it's some muscle memory of a past trauma. I really understand your symptoms and sympathize. I was talking to my brother about this and we both agree that growing up in Hawaii has made us appreciate a rainy day. I hated mainland summers where it wouldn't get dark til 1030! Rant.... But I hope you feel better. Be proud of anything you do to get out of ur funk. I know how hard that is. Stay strong sister!", "babyruth728": "My mom had seasonal depression. She always used full spectrum light bulbs in the entire house and kept them on during the day and evening which seemed to help. The bottomless pit feeling is pretty terrifying. Thank you for telling your story. It’s important.", "itsraemarkable": "The sun is coming soon! She always comes back and with all the love she had before. Also I have recently realized that I give my self way to much shit about being a good adult.. My aunt told me recently that it’s ok to do things that might seem less like the ideal adult behavior if it means you life is easier. For me, I hated food shopping and cooking breakfast. So I’ve started using the free grocery pick up like they have at Walmart so I don’t have to go in the store and I’ve started buying those uncrustable things because I like peanut butter and jelly for breakfast but don’t feel like making it. Those things seem like such stupid things to hate.. like be an adult and make yourself a sandwich. But I don’t have to.. because I’m an adult and can do whatever I want. Give yourself this kindness. Being an adult doesn’t mean you have to conform to societal standards. You are the queen of not taking societies bullshit. That can apply here too.", "bellymoss": "hey I love you. have u tried daylight lightbulbs??! I have one in my lamp at work and it it is like a happy light but cheaper. I swear my seasonal depression is less crushing this year because of it. just a thought. I can link u the ones I got.", "margotmeanie": "I feel this in my BONES! The sun is down by 4 PM and it’s killing me. Couple that with dark grey Vancouver skies, and it feels like daytime doesn’t even exist anymore. We’ll make it through this, we gotta hold onto every tiny moment of joy or light and cry when we need to. 🖤🖤🖤", "moonshelle": "Thank you.", "mcarroll411": "You are not alone.", "lovelylyn85": "Im sorry hun. 😢", "beessknees": "I feel this so hard! I seem to forget almost every year how hard my depression is going to hit. I think it’s just important to take as much time as you need for yourself and be patient. I hope you get some time with a puppy in the near future!! Always seems to help, even if just for a few minutes. ❤️", "theconnectioncorner": "sending love.", "mxkaimcn": "💚💚💚💚", "spaceboi86": "Winter is so so hard. Know that you are cared about and admired. No one expects you to be happy all the time. Im glad you have a supportive partner. Winter will pass. Spring will come. I've been crying a lot lately too. I just keep looking at pictures of this past summer and reminding myself that I'll feel good again. We just have to stick it out and be as patient as we can with ourselves. Sending love. ❤️", "miiichellep": "I’m right there with you girl. You are a strong bad ass boss bitch and though I don’t know you personally, I think your are amazing 🖤🖤", "joolzfashion": "It’s a shit time of year. Soft & gentle, one minute at a time, we can do this xo", "hashbrownemotions": "I understand this wholeheartedly. I’m going through the same.", "fairiesandfancies": "The world needs this kind of honesty. 🙌💕", "resilientfatgoddex": "Super relatable! 💚💚💚 Thank you for sharing.", "laurenmeverhart": "I feel this.", "sharondeshotels": "As a fellow sufferer, I feel you. This, too, shall pass.", "mallorykaitlin": "The bitch of seasonal depression has hit me hard today, as well. I’m thankful I read this to know I’m not alone. You are so wonderful, thinking of you 💘", "tab.bottini": "You are not alone 💜", "vyv_vet": "🖤🖤❤️❤️ @fatgirlflow", "lizlegenza": "So sad to read your feeling so low. It’s hard. I’m not as bad this year but know the depth of this sadness well.... sometimes all you can do is let the time pass, one day into the next, just reminding yourself that each day is one day done and one day closer to feeling better. It’s so so hard and I’m feeling for you...", "dianapacilio": "yeah girl, it’s all about acknowledging those feelings and letting them run their course while knowing they’re not typical or who you are. being able to separate yourself from your mental illness can be extremely helpful at times like this. u got this. it’s not forever. thank you for all your work and for being just like, p rad.", "katrina._white": "((((HUGS))))", "just_kellybobelly": "❤️❤️ I get it. Right there with you. It DOES suck!!! I feel like I'm in a pit. A dark, dark pit. Totally get it. ❤️❤️", "jessicadiane5": "Needed to read this and know I wasn’t alone 💛💛", "queenoftacostx": "Sending you love!", "mellopaton": "Thank you for this post. I find it very hard to manage my mental health in the winter as well. I literally was looking up when the days gets longer because I need a timeline for this shit ending.", "the_dufflepuff": "sending so much love your way", "iamlshauntay": "How much can I relate to this... been struggling for a month or so now. People think that because I'm functioning, I'm okay. Keep your head above water for as long af you can darling. Thank you for your vulnerability. You're reminding so many of us that we're not alone. Love and light to you.", "persephoneparr": "Aaaaaawwwww. I know it super sucks, keep on snuggling, keep on keepin on and it’ll get better darlin’. You are not alone. You have soooo many people rooting for you. 🖤", "jannettexo": "Thinking of you and sending positive vibes 💕", "elizajogram": "Resilience is a mighty river you’re pulling strength from and it’s inspiring me and thousands of other people with seasonal affective. ❤️ Thank you.", "lolainthedesert": "I understand ❤️ This is me...365 days a year", "jilleatsapples": "Same. I still really struggle but I use one of those SAD lamps and it helps a bit", "quirkyfashionsandcollectibles": "I pray you live in year round sunny weather! If only in your heart, mind, and spirit... but maybe even better in reality too!", "marshallme": "I know not everyone has the ability to do this, but I literally MOVED across the country to fight SAD. I got so grumpy in the winter, so I moved to SoCal. I can’t believe lack of sunlight and cold weather can have such a physical and mental effect on me.", "jam_s_gram": "I'm in Michigan and seasonal depression kicks my ass every year.", "odetoanartichoke": "i’m going through this, too! it’s so real and you are absolutely not alone", "sweetcheeks36": "@fatgirlflow my 19 year old daughter has depression.. man I think the worst part about it is how depression robs you of all the good things in life, things she “should” enjoy like parties and shopping she couldn’t possibly care less about. I’m happy that you have @comfyfattravels to help you keep your head up. I wonder if they ever feel helpless like I do? I just wish I could make it better. Just wanted to let you know I FEEL your pain seasonal or otherwise depression is a MF. Xoxo", "radical_reesie_d": "Thank you ❤️ I am in the exact same place. There are brighter days ahead for both of us.", "tinkvan": "Sending lots of live from a fellow sad girl ❤️❤️", "iamthatallengurl": "Sending hugs, light, & sunshine!", "lovelynessa520": "Its amazing how many people feel this exact same way. Im sorry you're hurting emotionally right now. I feel the same. I don't know why I feel this way. I sometimes feel ashamed because I have everything I need... food, clothes, clean water, a warm bed, both parents, my brothers etc. But still I feel empty. I can't shake this. I don't think it's a seasonal thing either, it's a true sense of emptiness. I grew up knowing God, so maybe I need Him in my life again, or a vacation or to run away. Lol I don't know. I hope you feel better soon. You're beautiful and just so you know... many care for you. ♡", "macarolitho": "Feeling this, love you, proud of you. Reach out if you need anything. 🌟", "dollykamdarkhokhani": "Awww the warmest hug to u my love @fatgirlflow it takes a lot to write this here for all of us to read and that itself speaks about how strong u r.. i loveeeeeee uuuuuu and u inspire me every single dayyy.. love uuuuuuuuu ♥️♥️♥️♥️✨✨✨✨✨", "empowermentphotographer": "💗💗💗💗💗💗💗", "bshelton76": "All. Of. This. It’s hard to get out of bed some days. Better days are coming. Until then, I’ll take my meds and drink plenty of water. 😞❤️", "rilesrunswild": "Thank you for sharing this. ♡ Please take care of yourself and remember you are precious and human and things will be okay.", "oneprplrose": "I’m glad to hear you are treating yourself gently and crying when you feel the need!!! Seasonal depression sucks...I have ptsd so it’s year round but def harder in the winter...sending positive thoughts your way!!!!", "twitterlessalexx": "@kaates_ maybe I just need to wait out the next 3 days and I won’t feel like I’m carrying around a pile of bricks and remembering every little thing I’ve done the wrong way.", "aliciasanchez": "💕", "adelemum": "🤗 hugs", "rvlvr64": "Hope this sadness passes soon.", "rubbertrampartist": "Not much i can say to help other than i am wishing you love and hugs, hugs and love. Just keep on keeping on and thanks for keeping it real.", "jesslamala_colocha": "I have this feeling year round... I always found it interesting that people feel like this during the holidays. Hope sunny days sneak in for you 💜", "lizsutherland7": "Thank you ❤️ I’m not myself right now and am struggling to find the energy to pretend. As you said, I knew it was coming but it doesn’t make it any easier.", "liivkaap": "I feel this with my whole being. I just talked to my therapist about it. Thank you for being so open about these feelings💕 “Soon the darkest night will end and the sun will rise again”. Sending you love & strength.", "amyslingsby": "🌸", "jasmynejasmynejasmyne": "I got a little sun lamp for next to my couch. It’s done WONDERS for me! You got this lady! The sun will shine again and so will you 🤗🤗🤗", "cdizzle1970": "❤", "leslie_raine": "Sending you love and strength to get through this season. My husband has it and I am never prepared enough.❤️❤️", "lillias_to_a_lilly": "I'm not sure if this would help but since my husband and I suffer from depression that gets worse in the winter we use a light box in the morning", "bhappy247": "Sending love & light your way❤️", "plussizescuba": "💜💜💜💜💜", "arcticlungs87": "I feel that way in the spring when it starts getting lighter and warmer. Hang in there! ❤️", "marina_carstens": "I'm sorry and I've been there. I hope you make it through quickly. 💕", "strong_in_the_broken_places": "Thank you for sharing. I also struggle with anxiety and depression. I'm so glad you have J to help you get through the potholes. I just have my pillow and my stuffy. I cry at night after everyone is asleep because I cant answer the questions. I dont know why I'm sad! It's a culmination of so many things. Gentle hugs and love to you my friend.", "elementalrose1803": "Blessed be. 💗", "ctofine": "Sending love and light and hope 💙💙", "emily.kelding": "You're not alone. It's hard to even function this time of year. Hugs to you darling. ❤️", "ninajean": "The sadness, whatever the cause, sucks. Sending love xxx", "ladymissbeca": "It’s been a hard year. I’m sorry you’re struggling. Personally, I need the light back as much as I ever have. I’m glad you’re still here 🖤", "heartless_kellz": "❤️❤️❤️💞❤️❤️❤️❤️ sending so much love to you. And praying for the depression to lift. Your loved and appreciated by many. Continue fighting and love all the people around you!", "thebrandymelville": "Please take care of yourself, even if it means things others don’t understand. Also, try 1g of magnesium a day, and make sure those vitamin d levels are up. Sending positive vibes your way! 💜", "peacefulmama3": "Sending you lots of Love and Light...💕💕💕", "vdelmonico": "Sunshine ☀️ for you. I get flipped out going to and from work in the dark. I usually work through my lunch so I can leave a bit early to have a few shreds of daylight otherwise I’m crying on my way home in rush hour. You are not alone!!", "movementmakesitbetter": "Man... Im so sorry.. As someone who suffers with anxiety i have found yoga helps me a lot.. To just connect to my body. Hang in there, youre not alone", "softbodytendermind": "Hugs and love to you. You are doing amazing!!!", "rrrrrachelrae": "It seems so extra bad this year for me. I just want to stay in my bed forever😫😫😫", "awehmeyer": "I hear you and appreciate you sharing this. I honestly thought about buying one of those artificial sunlight light things to see if it would help. (Do they even work?) My anxiety is through the roof right now and it’s having a domino effect on EVERYTHING. You’re def. not alone! We (meaning your loved ones AND random internet strangers) got you!", "aholden12": "❤️❤️❤️ I so needed to hear that I am not alone in feeling that way this time of year❤️❤️❤️", "rubywesley_": "i relate to this caption so much, especially lately. this semester of school was extra hard for me and a friend helped me finally realize that i should talk to a doctor about going on meds. my mood has been so crazy all over the place and i can never seem to control it. thanks for being open about seasonal depression and reminding me that it’s ok feel this way but to remember that i will get better ❤️", "cassy.pennington": "I’m with ya. We got this.", "nerdygamerfitnessboi": "You got this. We are here for you too, don't forget that💖💖💖", "missflirtyfleur": "Thank you! I am also so sad right now. Going to go get a glass of water and try not to focus on it", "bodpos_beauty": "🌺🌺🌺🌺", "chayjoshlivy": "this is me year round. my depression never takes a day off, unfortunately. i hope you feel more like yourself soon 🖤", "nikkums042": "For SAD which is an actual disorder. Seasonal affective disorder, they suggest a light lamp or taking vitamin D. Where i am from we sometimes dont see the sun for a month at a time. Lots of rain, so ots quite common here. Hope it helps.", "side3ffex": "I go through the same thing. I haven't left the house in a few days. Today I actually did my hair & make up telling myself I was going out but I couldn't do it. I'll try again tomorrow...", "asanzie": "One day at a time. You are doing the damn thing and getting through it and I am proud of you. 💛", "streetsmart.rd": "Needed this today 🙏🏼 thank you", "frankihanke": "This caption 👏👏 yes! Me! I am STRUGGLING! But also I love this season so I feel guilty that I’m not enjoying it also... 🤯", "crotchlessyogapants": "I am the weirdo who is happy in the winter and depressed AF in the summer, but maybe one of those sun lamps might help? I used one for a while because I have a \"circadian rhythm disorder\"--I tried every prescription sleep aid, every non-prescription sleep aid, all the \"don't do anything but sleep in bed\" bullshit, and was down to 4 hours a night. Resetting my clock with the lamp was life-changing. I tell this story because I was skeptical as fuck that some stupid light would help, but I gave it a chance and it did. According to my sleep dr., it needs to be 10,000 lux. I hope you can continue to take care of yourself and get through this. Depression sucks ass.", "coco_penexplore": "I definitely understand. I suffer from generalized anxiety disorder and have many days where I’m scared to do anything. Sending you so much love and I hope that you have a good self-care plan, lots of loving and patient people around you and just good gentleness ❤️", "doinmything67": "Well honey after years and years they at least acknowledge that SAD is a real disorder and we are not just crazy or hormonal or out of control! The solstice is almost here and I can’t wait. A tanning bed helps too!! #kansaswintersucks", "katiedeluxebbw": "❤️❤️❤️", "amberkarnesofficial": "I just tell myself that feeling the shit makes me fully human. And it makes the good times shine brighter. Hang in there.", "barclay0201": "💙💙💙", "houstonhooey": "🤗 💕💕💕", "mamafierceblog": "Gentle hugs, friend. Thank you for sharing. ❤❤❤", "carpenterkoch": "So simple.just breathe slowly until the need to cry passes. You are beautiful and strong. Be brave.", "bkufchak": "I’m in a depressed season too - thanks for sharing. We’re not alone!", "nerdy_nettie": "Hugs darlin’. I have PTSD and panic disorder. I completely understand the ebb and flow. How sometimes everything is just darkness and we are trying to find the light switch. Sending you all the love and light I have. Because sometimes it’s nice to know others like us are holding the line too. ♥️", "baby.got.soft": "Wow just started crying when I read the days will start getting longer so soon. Clearly I am right there with you. I feel like I’m wading through rocks right now, and I know it will pass but I feel you, it hurts so fucking bad some days.", "vitaminc3c3": "It’s ok to be sad. Thanks for being so real. ❤️ To you both.", "rontanamo_bay": "I am FEELING THIS. You’re not alone and we will be ok. That perfect spring is waiting somewhere.", "meginharvi_": "Sending you so much love. I can total relate and it’s hard as fuck but you’re a super star! You got this 🧡", "sitting_pretty": "💛", "wild_rose_yoga_mo": "I feel you! 💖", "mister.lucy": "This is exactly the situation I'm in. I always count down til the solstice cuz at least then daylight starts coming back. But yeah, I'm bone crushingly sad. 🎉", "leah_lovegood": "I am right in this boat with you girl. I'm having a hard time finishing this year. I love you ❤", "rachelillustrates": "Sending you so much Love 💗💗💗 You are such a badass and you will make it through this.", "geekpurl": "Remember to light your Yule log and ward off your terrors in the darkest, longest nights.", "jorxa": "🌈🌈🌈🌈🌈🌈. Thanks for sharing with us. Feel better soon!!! 🌈🌈🌈🌈🌈🌈", "yumaratz": "You are definitely NOT failing as an adult or a person or a woman or a friend, you have a disorder that rears its ugly head at the most inopportune moments. Your family and friends are there for you to cry on and use for the support you need. Never, ever feel like you can't lean on someone when you need it. You are strong and beautiful and will soon be dancing around in your bikinis and being happy in the warm sunshine.", "beebumsinbloom": "You're not alone ❤️❤️ I found myself in the exact same state earlier. I could barely even move. I just cried and my husband came home and gently walked me through my mindfulness steps. You've got this. ❤️ You're right, it ebbs and flows. Thank you so much for sharing with us ❤️ it helps to feel not so alone", "caseiiandjunior": "Literally me. Had to do school run, had a cry then chucked on clothes while thinking and trying not to cry and be present and involved but I just couldn't. I went to autopilot, for clothes on went and took my child to school and I came in, sat down cried, debated a day wine (didn't but really that's the mood) and sat on my couch for three hours. Like I just don't want to move /but I do because not moving is failing and not doing/achiebibg/being an adult/not being a lazy fatty/bad mum", "katieallencoaching": "I feel you and am in the same boat right now. Sending hugs ❤️", "apeach_intexas": "That part where you said you feel like you're failing as an adult...damn, that hit home. Hard. My depression prevents me from doing the most mundane, \"adulty\" shit and I hate it. But we are NOT failures. We just have an illness. We wouldn't think someone with a physical illness was failing as an adult if their sickness prevented them from doing little things. The best, and sometimes most difficult, thing we can do is cut ourselves some slack. Like you said, you've gotten through it before and you'll get through it again. We can do this. ❤️", "samantha_kay_75": "Thank you for talking about difficult things. Sending you love ♥️", "plantvibz": "Thank you for sharing with us❤ here is my share...I struggle HARD every year.. This year...I broke my ankle.. Sitting here listening to the rain in a dark room very dependent on others unable to get the medical help I need has me feeling pretty low. I sat by the window watching most my plants drowning from this rain storm just sitting out of my reach. The things that give me a tomorrow to look forward to..I pictured the tingly happy feeling I'd have if I could walk out and save them. Then I realized I'm being shown a life harder then my usual for a reason. I'm going to remember that feeling of physical defeat forever and make myself get up and do something even in the times my mind tells me NO and to just give up..", "anunsafetaco": "You're doing great! Sometimes taking your meds and being sad is about all you can do. As a fellow depressed person, I get it. We're all here for you, as cliché as it sounds", "deannr78": "Im right there with you right now.", "bevinsparty": "I too struggle seasonally with depression and am so light sensitive. I am having a lot of days whrte staying alive is the only mandatory to do list item and I also treat the dark times with tender care because night is worse for my thought spiraling. Sending tons of I hear you and this sucks and I'm glad you're talking about this your way!", "cookielicious_cupcake": "All my love and light. Thank you for this truth. ❤️💙💚", "quee_ni_cole": "@fatgirlflow I feel this post in my soul", "_sonia_tremblay": "Sending love 💜", "chyna876": "This is the time to turn to God, my prayers are with you", "cedar.willow": "Sending you encouragement and support. This time of year isn’t easy and can really mess with us. Hugs. 💛", "_pinkalicious": "💜", "julie_alyce": "I really *feel* this. Thank you for sharing, it makes me feel not so alone 💜", "orangebarrelindustries": "❤️❤️❤️", "no_victoria_no": "Preach! This time of year is hard for me too. You are not alone. And remember, the sky is always blue, even when the clouds make it grey. It doesn't fix anything, just reminds you that it's ok to feel the feelings, you are not your feelings, and it too will pass. ❤️", "thepoisontart": "Depression lies, whether it's because of circumstances, a lack of neurotransmitters, or because the SUN IS GONE. Store-bought neurotransmitters are great. I like to pair them with the thin Oreos - the proportion of cookie to filling is perfect.", "xlunarlulux": "I know how you feel. I lost my Mother to lung cancer 14 years ago on 12/14/04. Its always the hardest around this time of years, but you got this. You will beat the darkness that is trying to creep in, I believe in you. ❤️", "tapsandtomes": "Right there with you. It hit me like a ton of fucking bricks this week. Had a panic attack in the work parking lot this week.and had to come home halfway thru the day. We will get thru this. Seasons are temporary.", "joeyjo422": "Awe depression is the fucking worst. I hope it gets better soon", "bree311": "💜💜You are such a beautiful soul and I hope that love and support holds you tighter than your anxiety and depression. We all support you and are here for you @fatgirlfedup . sending lots of positive love and energy💜💜", "kedaspoetryservice": "You’re incredible, and I hope you always remember that", "riverbottomrose": "💗Sending love & thanks for sharing. Been struggling with anxiety & depression since childhood. Really feeling it this December, lost a loved one this year.", "aprilmgonzales": "Awww I'm sorry love! I know all to well how you're feeling. I'm here if you ever need a listening ear!", "melissamaedmb": "I’m with you", "victoriadonelda": "I have been telling myself for WEEKS to get through the solstice and somehow i’ll be okay eventually 😩 I feel this so very hard. I love you. The sun will shine in Kansas again 💜", "myboysmyjoy18": "May not mean much but you make the world a better place. We are thankful for you and pray for better days ❤️", "plaidcandy": "Thank you. I have SAD and I always think it won’t be that bad and it is always awful. Here’s to the hope of longer days.", "danalsullivan": "I struggle every year. Thank you for sharing this. Normalizing this kind of stuff is so helpful for me. ❤️❤️❤️ I hope your tomorrow feels a little less hard, but if it doesn't that's just exactly as it should be, and that's okay.", "epigeneticskincare": "I hear you", "wildflower.journal": "❤️❤️❤️ beautifully said.", "inna.zayka": "Thank you for sharing", "roseybeeme\nVerified": "Verified", "ssiriano": "The awareness helps, but that doesn’t mean it stops hurting. ❤️", "thefatgirlsings": "It's so hard this time of year. I get it too, not as severe, but enough that I can empathize complete. One moment at a time is all you have to worry about 🤗", "rue.lew": "@littlepearlnaturals oh my god feel it", "jameygyms": "So much this. I am with you. ❤", "mamahavok3": "This is a stressful time. You just take care of yourself and do what you need to do to get through it. Keep telling yourself that this too shall pass, and it’s ok to just do you. 💕", "lizajames.holley": "💚💚💚", "samoodeee": "This venting is so important, thank you! I found that the subtle difference between trying to hold on to happiness and living a joyful life has helped my anxiety a ton! I may not be happy all the time but the moments of joy in my day are starting to even color the sad moments like \"look at me! A beautiful complicated human who can cry and feel everything SO HEAVILY. How fucking precious am I??\"", "fyeahmfabello": "I’m proud of you, babe. Let me know if I can support you in any way! ✨", "fattymph": "Depression is the realest. Thanks for your vulnerability. 💕", "ailurophilewithstyle": "😞😞😞 I’m sorry Corissa, I completely understand and appreciate your openness 💕💕💕", "rachelfribeiro": "And thanking u for puting it into words", "plantcuriousgirl": "One day at a time or minute by minute. Take care stay safe and try to focus on the beauty of nature - hold a flower, leaf whatever in your hand and breathe really look at it - try as impossible as it is to see beauty every day in even tiny things - like feeling your breath or the breeze on your face. Try to simplify things for now - as you are overloaded and your bucket full.", "comfyfattravels": "I know this is hard. Im proud of you for being true to you."}