{"threeat14": "Heeeeeeelp i cannot find this dress online 😭", "luxiebeauty": "😍😍😍", "dr.kiai2016": "💋❤💋❤💋❤💋", "rxcnolasco": "💞😍😍😍😍", "correyxfitness": "😍", "rhrz13631385": "👌", "aeisa2010": "So beautiful lady 😍", "h03z.love.babygirl": "😍 love this on u", "yourlovelene": "I love that dress I would get married in it", "nazenin3684": "ناز", "rosana5955": "🤣🤣🤣🤣🤣🤣", "marissasburritos": "You are a gorgeous beauty. Us phat girls need to feel the love. Because we are gorgeous. Thank you for this ❤️", "mazelomi": "عسل عسل", "abdelstair": "Vip", "mwj1873": "You have nice face and skin color .. but you have to eat healthy and loose weight bebe", "raydhinak": "Ugggh so cute", "blackjones20": "Love u😍", "officialphara0hdadon": "❤️❤️❤️❤️❤️", "rashidsimba26": "#dresscode 🔥 @fatgirlflow nice", "muhseger": "Super belle", "puputcibro": "@anaitidar", "halliesigwing": "I loooove", "_emilybtlr": "@allthefinuffthings", "hetties_lashes_and_beauty": "Good girl 💅🔥", "feet_and_wings": "Beutiful woman 💚", "mi_chael831": "Gorgeous", "vandelson251268": "❤️Meu sonho de consumo 😍😍", "iam_onorme": "I'm in love with anything fat because according to scientist...the pussy won't be that big😜😜😜😜😉😉😉💝💝💋💋", "vitanimazursky": "I love this so much. Ethereal 💖🥰", "ricardosanchez5593": "LINDA MI AMOR UN BESO LOVE YOU 😍🔥😍😍😍😍😍🔥🔥🔥🔥", "golden_aimeee": "Such a gorgeous dress 😍", "antonialima.oficial": "👏👏👏👏👏", "groovy_oils": "Just now seeing this... such a perfect message and so relatable to some of us. Thank you for being vulnerable with us.", "ricmardson": "😍😍😍❤️", "iksy.iks": "Ja jak wrócę z domu @thepathoftotality", "plussizechunt": "Morbid obesity isn't healthy nor", "mossylaneboudoir": "Beautiful!", "alexmichaelmay": "Oof this made my heart swell. How I identify with those feelings having always been tall and...well, not tiny or dainty like “the other girls” in my life. Love this so much. Your heart, your mind, your vulnerability ❤️", "bjair0240": "❤️", "ja_ne6175": "You looking so nice", "hmgm1962": "Beautiful", "urdarlingcarling": "Gorgeous and breathtaking ❤️", "mia_trautmann": "💕", "957hsyn": "❤️❤️❤️❤️❤️👏👏👏👏👏", "sprinklemama": "So this is everything today!!", "ashleymccaskill": "This is beautiful my sweet friend 💕", "the_peach_hat": "you look lovely", "theverbalthing": "You look like a fairytale princess 👸🏼", "janessasary": "This is so beautiful and so well said.", "bagga.amrit.italia_": "🤗🤗🤗🤗🤗🤗🤗", "malwinasumper": "Graet dress❤️❤️😍😍", "zekeriyetopcuoglu": "👄🌹", "lexinimmo": "So beautiful!!! 💖 #standuptobeautystandards", "az.iz1604": "❤️", "saraa_smirks": "I took a screenshot of this. \"My femininity isnt about smallness and that i dont need to feel tiny or dimunutive to be soft and sweet.\" That hits the nail on the head! 🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "aziz.zraika": "I really hope and also I want to find a lady like this lady for a serious relationship because I love ladies bbw", "lizlegenza": "❤️❤️❤️❤️❤️❤️ I have had such similar thoughts - it’s kinda crazy to me how you are so able to articulate things I’ve experienced and pondered etc ( and still am!) and I adore!!! This dress!!", "ang.vaughn": "An angel ❤️", "janice7458": "Very pretty dress", "anapcliz": "Oooooh!! So cute! 😍", "mama_izzie": "You look fantastic mama", "harpergreylifestyle": "You look like a fairy princess! Gorgeous 😘", "robingrae": "Gorgeous", "katerichel": "You and your post are phenomenal 💕❤️ thank you 🙏🏻", "ashtonhopezis": "Love this you’re glowing!! 😍😍💕", "maugeridany": "🎨🎨🎼🎼🎼🌺", "jazzmine102": "We are unfortunately as women told to be sweet, fairylike, small equals feminine a.s.o., wich is so wrong! Femininity, if we even feel we need it, is what we define it to be and claim it to be. And I know it isnt easy when society has so unbreakable norms and discourses that dictate a certain look, genderrole, lifestyle etc, but I think you are doing a great job and I really like your picture!", "get__back__up_karina": "Beautiful. What’s the name of dress?", "jessica_auclair910": "Gorgeous! Do they ship to the US?", "amylsays": "I love your message in this post. It has taken me a long time to understand that \"I am large, I contain multitudes.\" That means strong, soft, commanding, gentle, sweet, fierce... And it's always great when we can find something to express one of those facets in a way that feels good. You look beautiful, not because of the dress, but because your expression shows you're feeling yourself. <3", "shellyyyyb": "Love this dresssssssssss ❤️❤️❤️", "ruthannebeverly": "Serving classy fairy vibes in tulle, looove it, you look amazing! 🔥", "stephanie.bux": "Literally looked at this and first thought: OMG she looks so sweet 😃", "inner.monroe": "Great words", "moonlitpath91": "You look lovely! 😊💕", "elsycasanova21": "Quiero buscar un vestido así @yeximassacre.osorio", "april.lee.rose": "💛🧚‍♀️ 💛", "ialban": "“Here’s to big tough bitches” ✊", "rubbertrampartist": "You look so romantic!", "breakingnbettering": "Stunning🙌", "nocornflakegrrrl": "I feel this so much! I've always been \"too much\" to be delicate or elegant, or at least that was suggested to me my whole life. And I still feel the effects that had on me. It feels like I'm stuck with cute as the most tender I'm allowed to be. Which is why I love this picture even more!!! You are the fat fairy I aspire to be 😘💜💜💜", "youfatterme": "Angelic!", "diamondsinherthroat": "This dress is amazingly beautiful, you look glowing and wonderful 🖤", "mandixchartier": "You look so beautiful!?🖤", "choppers_for_life": "😍😍😍", "caitlin_rose93": "Relatable af and gorg😍✨", "britnifarace": "Fairy princess vibes for sure 😍💖", "qmoab": "This!! 😍😍💞💕💞 To read this expressed from another human bean is amazing! Thanks for being vulnerable enough to express it for us other big tough bitches ❤️", "allasunder": "I feel the same way! I've recently realized how much I limit myself in my dress and in life based on my perceived idea of femininity. So much so, I find myself not even allowing me to wear my partners oversized and hella comfortable t shirts because they make me \"look\" and feel manly, but only because of my size overall. I am so thankful to you and the other bloggers and commentors for letting me know I'm not the only one. You are the greatest @fatgirlflow! And thank you for always being so transparent with us.", "bally_hayer": "Nice dress 😊", "blanka_hohn": "😍", "foggyballoon": "You look like a swan", "vandermolen.massage": "Dreamy, delicate, romantic, soft, pretty and sweet - you look like a Christmas angel!!", "her_royal_fatness": "You look like a cream cheese frosted cupcake 😭😭😭 I love it", "indiefishsteak": "So pretty and flowing ☺️", "alfonso_belda_fotografia": "You are a dream😇", "cleanestpineapple": "You’re a doll 🖤", "helena.slamova.7": "😍", "theresameire": "Princess realness", "kristyk_fatgirl": "😍😍😍", "marta_edens": "Hey girl, ive bn a fan n following u everywhere. This last video, u look so pretty. I wish i could afford the clothes u buy sometimes. I started watching u when u did rue21 n i buy it after the video lol anyway i 💜ur fashion hauls.😍👗👚♈", "iamkate1022": "Sooooooo pretty ❤️", "cdsmith80": "Why is it so expensive 😭😭😭😭😭 I love it so much.", "fatterinpersonn": "This post🙌", "river_dani": "I relate to this post SO much!", "kimdoogle": "You look so regal. If only I could afford that dress 😩😂💛", "26kleisen": "Lovely dress. Let me reassure you that, contrary to popular belief, one does not have to shrink when getting older. Rather the opposite! #takeupspace #agepo", "everyoneneedsselflove": "Aww you look so gorgeous in that dress💙💙 work it girl💖💚💚💖💛", "barclay0201": "😍😍😍", "hey.there.valerie": "Love love love this!!!", "caitlynnelizabethh": "You look like a fairy 😊", "sandra_grudowicz": "I love that dress ❤️", "sayshesclassy": "I relate to this on every single level. Thank you for this!", "pointy.chin.diaries": "Thank you for this, absolutely beautifully put. You are indeed very soft and feminine, and you should be very proud!!", "foxxispade": "Thank you..its always so nice to know my feelings are shared by others🌸🌸", "chantelleroy": "I want this dress. And I feel the same way ❤️❤️❤️❤️", "coralascetate": "You should set up a hugging booth. You're make millions.", "q_strom_99_walker": "❤️❤️❤️", "lindseymcruz": "👏🙌", "kiskmw": "I love this, thank you for sharing your authentic self! Love ya❤️", "lethakenney": "My whole life I never liked what I saw in the mirror. I was tall, fat, broad. I was told I could never wear high heels. Told I was masculine. It’s great that you share yourself this way. I’m happy you feel feminine and delicate. I hope one day I can feel the joy that was captured in this moment. You are truly beautiful and I’ve watched your YouTube for some time now. I rarely make comments but I wanted you to know this touched me. Thank you.", "strong_in_the_broken_places": "You have just described the feelings I have about femininity! I have always felt that I couldn't be feminine because of my size. I tried to describe to a male friend once that he made me feel feminine when I was next to him. He didnt get it. I'm learning to embrace myself. I did a boudoir shoot this year for my birthday and it was amazing! I look at myself and think \"wow, I'm a freaking goddess!!!\" I just take it day by day and learn to love every part of my body. I am woman. I am a goddess. I am enough!!!!", "tracyknight4": "I know exactly what you're talking about @stacey._____ I wear big baggy clothes, sometimes men's because they are thicker, or because their T-Shirts are longer and they cover your butt lol", "spacebrat_": "Omg so beautiful and darling 👏🏼💕", "katiefuller66": "Wow such a gorgeous pic of you!! Love ya! ✌❤", "imkellyscreename": "Slay 🙌🏼", "comfyfattravels": "I love you and im proud of you", "tamarahelenelizabeth": "You look amazing! 😍", "dogluvr87": "I love all these off-the- shoulder dresses, but what do you do to hold \"the girls\" up?", "frizzo_beeating": "So sweet and so cute. you are precious 🌸🌼😍", "melissa_mainsqueeze": "You look beautiful!", "shelbylaine7": "Ugh you look like a forest goddess wow ❤️ look at how perfectly perched you are 😭 wow", "quessicat": "😍 This is a true dream dress. Faerie Queen situation.", "ginnyatchison": "Very girly, love it💗", "smokenstars": "I needed to hear/read this! !👏", "kelliclash": "Big bitch power! 🖤 This dress looks so beautiful 😍", "mustangsallytwo": "This is so dreamy, I love it ✨", "weiss.baby": "this caption is so important wow", "randomlysmile": "I love it!!! It works perfectly on you.", "missjess_s": "❤️ this so much!!! I am 5' 7\" which isn't super tall but being taller and fat has always eliminated feminine dainty feelings. I think is great to not associate smallness with femininity. And you and the dress look great! 😘", "loved_junk": "Gorgeous!!!", "samantha.slopes": "Fabulous", "katiemariecrafts": "All of this!!! I just caught myself wishing my body was more dainty, because that's how I feel inside, but I need to get it through my skull that I can be delicate and feminine and tall and plus size and bad ass all at once.", "mamato4zs": "Stunning", "stacey._____": "I feel like I've discovered something similar about myself recently. I always thought I looked more masculine because I'm bigger and I have a big stomach and shoulders. I wore baggy clothes, sometimes men's clothes because that's all I could find that would fit and hide my body. But I don't feel masculine. I want to feel feminine and wear pretty things. I feel like I'm being more myself recently and not hiding, even though that's easier. Thanks for all you do!", "margotmeanie": "This is so beautiful! Thank you for sharing this lovely revelation 💗", "vitaminc3c3": "You are beautiful and eloquent and lovely! 🌷", "taylor_442": "You look beautiful! And I need this dress in my life!", "b_ridgettttt": "GORGEOUS", "pheonix6560": "I feel this so much. I realized recently I think the reason I love super feminine decor and small everything (small houses, small cars, small dogs etc) is because I’m constantly trying to shrink myself down to fit the mold. Working everyday to unlearn that..", "sunnidaze53": "You look so pretty ❤️ and I love this dress", "penneranna": "You look totally pretty.", "sophie__hendy": "An angel ohmy ❤️❤️❤️", "deerwoman_la_gordita": "Girl you are KILLING IT you look like a beautiful fairy princess 💚💚💚 I love what you said, the feeling of being delicate and floaty and vulnerable doesn't have to be mutually exclusive to being a proud, self-posessed brick house mamacita😍", "rosemaryandquartz": "You’re so angelic. This dress is lovely but you make it beautiful.", "baltimore_babe87": "@fatgirlflow ut so beautiful! I wish I have ur confidence", "islandgalplans": "this resonates soo much 😭💕 thank you for being a voice and having the words i cant ever seem to find myself ❤️❤️", "watson.figs": "You literally look like a fairy queen. This is gorgeous! I’ve struggled with the feeling of daintiness for most of my life so seeing other babes finding it and slaying it gives me hope! Keep rocking!", "shaw_lori": "FYI you are SLAYING IT in that dress!", "ilikeweirdos35": "😍😍😍", "omg_it_speaks": "I want this dress", "leedobecka": "I love this post and I’m excited in a similar but opposite way. I’m gender queer but most people at work (I feel) see me as a ‘straight’ girl with really short hair. At our upcoming holiday party I’m going to dress full on masc and I just know it’s going to feel amazing 💫", "gaymoonmomma": "You are so gorgeous! You make my heart happy😍❤️", "kristinneedsaname": "This spoke to my sooooul ❤️", "trans_fat_alchemy": "Delicate fat fairy princess! 🥰", "peacefulmama3": "You look Fantastic 💕💕", "asanzie": "Soooooooooo ethereal and lovely!!!!! ✨✨✨✨", "poodrey": "THIS 🙌", "wildsagestudio": "So kewttttttt!", "thrashon": "So dainty and graceful 👌🔥❤️", "williamsims66": "Damn 😍😍😍😍❤️❤️❤️😍😍❤️", "_tinyrose_": "You look so beautiful! 🌸", "feymoonstone": "I guess I don't need this dress as city Chic doesn't carry my size. But it's gorgeous!", "rachfriend": "This hits home for me so much. 💕 Gorgeous!", "lovelypenelope": "This dress fits you perfectly. You're so beautiful and creative", "shamelesscreature": "WOWOW I LOVE THIS YOU LOOK AMAZING AS ALWAYS 😍❤️❤️❤️", "cwcaityy": "I can not possibly like this enough!! Perfectly put into words 💙💙 an inspiration for all of us to know our worth and beauty as women regardless of our size. Love it! 💞👑", "cassy.pennington": "It’s lovely. But that price tag is too much for this momma. #wishlist", "luellaarbre": "I'm going to buy this dress immediately ugh you look like a fairy princess", "sarahontheisland": "Oh this photo reminds me of a John Singer Sargent painting! Enchanting. ❤️", "curvily": "Love this so much! Delicate was the first word that came to mind when I saw this pic too", "shelika_sugabutt": "Beautiful baby❤️❤️❤️❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "bentleysimiiko": "YOU ARE BEAUTIFUL!!!❤❤❤", "confetti_rebels": "Oh my gosh! Stunning!!", "heavyglowno.3": "Such a beautiful picture. 😍", "chayjoshlivy": "this is freakin gorgeous 😍", "mynameisjessamyn\nVerified": "Verified", "itsshannongrace": "I relate to this so much!! 💗💗", "yumaratz": "That dress looks heavenly on you because you are an angel sent to earth. You are beautiful just as you are and do not need to be \"small\" to be beautiful.", "soft.thorned": "look at this princess.", "dbow30": "You are absolutely stunning, girl!", "kiernita": "That's a gorgeous dress!! You look so beautiful in it.", "femmeplosive": "SO stunning!!!!!!", "mayadanielle": ":”) you look like such an angel here", "katstroudofficial": "Love!! Absolutely gorgeous 💕", "darling.darkling": "Princess fantasy 👌🏻", "yaschas": "this is so ethereal ❤️", "uno_pasta": "Lagi apa say", "faithwad": "Wow. Gorgeous", "alysonmcc": "Can we just live in each other’s sun pools on our couches and eat Oreos in fairy princess dresses? I think that would make winter 1000000x more tolerable.", "jdellen": "I am in love with your dress!!! So flowy and feminine!!", "songbirdali": "I love this so much.", "tarahnova": "Cuuuuute dress!!💓", "vivianbviola": "Que vestido lindo que foto maravilhosa❤️❤️😍", "bunsarunski": "Gorgeous. 💕", "kimburrzz": "This dress on you is so beautiful.", "lovekatherine_24": "You look like a beautiful fairy!! Love this pastel pink on you and the dress obvs 😍😍🙌🏼🙌🏼", "maryburgers": "Oh i love this so much", "thefattingtonfrisk": "You!! Are!! A!! Dream!!", "hezisarmsbendback": "Gorgeous!!!💗💗💗", "_mollythedolly": "Do you which style this dress is? It would be perfect as a wedding dress for me!", "blcoledavis": "Beautiful! Reminds me of @zelieforshe.. you should check out her amazing pieces!!", "katiejosample": "This is the most beautiful and aesthetically pleasing photo", "mamaissues": "GORGEOUS!!!!!!!", "jessy_jew": "You’re beautiful.", "myoldfriend2010": "You are beautiful. ❤️"}