{"roxananoeminunez": "Hermosa mujer!!❤️", "shischultz": "Love that belly", "12ed13eard": "This shit is fukin disgusting..... Stop stuffing your face n get on a damn diet. Some freakshow shit.", "mika_pufy": "This so wrong , you look very unhealthy. Love yourself enough to be healthy, I am pretty sure that is very tiring to be so heavy. I appreciate your confidence , you are beautiful, but this is wrong , you are encouraging obesity and a very unhealthy lifestyle.", "mirhamedkermani": "🌸🌸🌹🌹🌹🌹", "greeneyes_so_fine_": "Thanks for giving me courage💕🙏🏽", "blasian.barbie89": "@comedianliplock547", "muhseger": "You are very gorgeous sexy", "hapa_meli": "I just love your energy 💕", "maik_fuehrer_": "Perfekt Girl 🤩🤗", "khalifnetsc": "Love your smile", "sean5_anthony": "You make sense to me", "bustergingin2003": "No matter how you word positive thoughts and vibes about self acceptance ,the mirror doesnot lie.Please help your poor body .Your heart would be struggling daily as would your joints and skin folds .For your health and to live for more than 10 years .please seek help.Keto is saving so many overweight people", "tankshoots": "Amazing", "lara.tamsin": "Right there with you. I moved a mirror because I never have to see my belly... now I’m trying so hard to feel the self love. Btw - LOVE this photo SO much 😍", "sirmaxwell70": "Sexy", "chevymanjerrygmail.com_": "Damm you look absolutely amazing and sexy love the whole view", "authorchic1992": "Yes girl!👑❤️", "knotsinmyhair": "I feel like my body looks similar to yours but it's so easy to find you beautiful but not always myself. Funny how it's like that. ❤️", "briannanicoleborland": "@trentknows", "gregory_hearts_andrea": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "_dark_n_handsome": "So sexy AF🔥🔥🖤🖤🖤", "kattyv3": "@hatterist ❤️🔥", "strawberrikoo": "you are so beautiful ❣️❣️", "bert_real": "❤️😍🥰😘😉🔥💯💗💖💝🇨🇼", "jasminederichs": "I love the tattoo💜", "sadlergerald": "I can handle it 🍷", "dwaynezolinski": "Sexy", "nikzadelmira": "لایک", "cesarorantes81": "Hermosa", "danielle_doll44": "@vinablaire just like you showed yours🤗", "letty.reynaldo": "Great pic !! Love it💚😘", "missssjt_": "😍😍😍😍😍", "drizzyrosee": "So prettyyy", "sydneyboo_bear": "@fatgirlflow I wish I had half of the confidence to love my body like you do ! You are so beautiful and you’re confidence makes that even more so . I pray that some day I can feel as beautiful and sexy as you do !!!", "reinitapositiva": "You're so damn cute! I envy your belly bravery, they are #goals.", "jorge.machado.1967": "❤️👏", "jojo_20ss": "@rwnlwdyh 😂😂", "markwilliams8751": "Do you wish to be a member of the great Illuminati and start receiving $500,000USD monthly and be popular among others and have riches and famous,,this is the only opportunity of being a great member of the Illuminati message me on what's app +13512070381", "chickens.0": "chickens 🐔", "sergio.amaral.64": "❤️❤️❤️❤️❤️👄👄👄👄👄👄👄👄👄👄👅👅👅👅👅👅👅💦💦💦💦💦💦", "lilbump6": "Beautiful", "j.d.spearhead": "Sexy lady! ❤️❤️❤️❤️❤️❤️", "vinablaire": "So we are just gonna encourage obesity? K.", "kimberly.quinones": "BEAUTIFUL strong woman", "riabtsevakira": "🙈", "sunshine.bopo": "😍 thank you for this. Just what I needed!", "habitualcurves": "@fatgirlflow I genuinely appreciate you posting this. I always enjoy your posts, but this hit me right between the eyes. I struggle so much with this. I struggle with putting myself out there, even though I have the experience and results to back it up, I immediately feel like I’m not pretty enough/skinny enough/smart enough...you get the picture. The point is, by sharing your struggles, you have encouraged me to put myself out there. You’re enough. I’m enough. We are all enough. Thank you for sharing. ❤️❤️❤️", "jlow9395": "🔥🔥🔥🔥😍😍😍😍😍🔥🔥🔥🔥😋😋😋😋😋😋😋💙💙💙💙💙💙", "_wobblybits_": "Such a strong picture 🔥🔥 I loooove your honesty and vulnerability 😘", "arnodebie6": "Butiful", "purenightmare3": "You fucking OOOOOOOZE confidence and grace and i fucking love you ❤️", "b1gl1997": "Beautiful sexy goddess😍😍😍", "sdotzler47": "You are so stunning and gorgeous. I wish I had the confidence to post pics of myself just happy like you can. I used to but I lost it after an abusive relationship. My goal in life, and this is true, is to be as confident as you and just rock my body like you can. ❤️", "hawaiihasmyheart": "Perfect❤️", "hector_luvs_coffeee": "🌞🌹", "barrierogers": "Thank you, thank you, thank you! I needed this today! You and your spirit are beautiful!", "georgeare84": "If you oil it up it wold be more gourgeus. Y love oiled giant bellys 😍😍😍💖💖🔥🔥😘😘", "berrypluslife": "I am so here for this belly love.", "shamaun.sumon": "amazing", "shiny.pretty.69": "Omg you are so beautiful! You are an inspiration ❤️", "franklynn_swadley": "Gorgeous! 😍", "1985quelighmeport.navarro": "👌👌👌👌😘😘😘😘😘😘😍😍😍😍😍😍💋💋💋💋♥️♥️♥️♥️♥️", "elloydfelipepuseymitchell": "Beautiful. I love you", "march4thandrecover": "YAAASSSSSS! Love u and the great message. The power ours. Love your tattoo!", "bethelizabethuk": "Holy shit this photo is beautiful 😍😍 and this is such an important message", "mayakaalani": "You look simply GORGEOUS and you make the rest of us big girls look GORGEOUS too.that took a lot for you to do that and I f ou r one is proud of you.HAPPY VALENTINE'S DAY SISTA..you INSPIRED ME 🎉🎉🎉 CELEBRAT YOURSELF LOVE YOURSELF ALWAYS NO MATTER WHAT.", "nomeames71": "I need your confidence", "grace_eatz99": "💓💓💓", "chelleb0977": "🙏🏾💯😍Thank you so very much! This made my day, I lack this kind of courage and strength! I needed this....God Bless you sista! 💪🏾", "velvet_model": "This is so cute and I love the lighting. ❤️", "onecookielater": "Thank you for being a lamppost in the dark. Keep shining. ❤️👑👌", "lady_m_lingerie": "👌👌👌", "thebopowitch": "You are not alone. 💖", "heftycurves": "Your smile is contagious!!!", "howling_gem": "Wauw, picture perfect. ❤️❤️❤️❤️", "coolcurtis1016": "Very sexy", "yumaratz": "I think that we all feel that we are not worthy sometimes. You have the courage to admit it and ask for help, that is absolutely fantastic. Many people suffer because of fear of asking, we think that we will be less for asking or made fun of. Your words are sure to inspire! If you need help or support, ask. You are beautiful and I just love you smile, it hosts lights up the place.", "devilkhan2599": "beautiful 👙👌👌👌", "tammykarman": "Happy Valentines Day XoXo 💋", "ivan_acibe": "😱 guao que cuerpo tan Lindo y jermoso 💗😍🌹", "caitanobezerra1": "Top!", "curly.since.77": "So out of left field but I love that bra!!", "sagedfibers": "😍😍", "ron_r_lew": "Sexy😍😍😍😍😍😍", "re.al365": "Wow", "omidvare313": "Ok", "tamra_is_her_name": "YOU R BEAUTIFUL!!😍😍😍", "lawrence.jones.520125": "If I didn't have an eye for beauty, I could never justify my admiration for you!", "mema1_mel": "You're Gorgeous! I needed to read this today. A lil down today.", "hkfauks": "😚", "omg_its_valdineia": "Linda", "givesafeck": "❤❤❤", "lassale99": "❤️", "hadi.m.92": "mmmmmmm😍", "chriscrawford71592": "❤️❤️❤️😭😭😭 inspiring words!!!", "trans_fat_alchemy": "Bloody gorgeous!! 🖤🖤🖤", "westm65": "You luck fabulous 😎", "shahd199718": "Hot😋", "babyfatgirl00": "😍❤️", "afatminimalist": "This is such an amazing picture. Beautiful!💜💐", "elizabeth_pel_": "This is the confidence I strive for.", "jose.miguel.rojas": "... awww!!! 🔥🔥🔥😘", "papertreesandlimousines": "💯💯👌👌💛💛", "26kleisen": "Well said, and well done asking for help.", "nickyewen": "Great shot!", "cat.hatfield": "I needed this. Thank you.", "thebigdewshow": "This is a fantastic and hot picture wowowowowowowow", "imel_yani": "❤❤❤", "punkprincess09.01": "I love your page and you are so amazing! Keep it confident girl & keep inspiring! ❤️🙌🔥", "ahappybun": "You are so gorgeous and a huge inspiration for me. You have no idea how much finding you a while back meant for me. After I gained a lot of weight suddenly I lost all of my shallow \"friends\" and every conversation with family members since then has been about my sudden weight gain. I always felt confident in myself enough that the weight gain didn't bother me much, but the constant tearing down from people who were supposed to be the support in my life was weighing down on me. You made me see that there really are people out there who should just love you for who you are, and it's worth it to love yourself no matter what others say. 💕💕", "richard_phi": "Nothing sexier than a confident woman", "ninaluciernaga": "♥️♥️♥️", "scubaemiliomndz": "What a cute belly!!!", "allyouneedisluff": "You are just such a vessel of light! ✨", "terihofford": "👏👏👏👏👏", "mansoor.nuri2018": "Fuck belly", "beyourjoy": "Such an important post! We all need these reminders ❤️ also I love your heart tattoo", "chef_ethan_g": "I love you positive a d appreciate it fully. You are loved and beautiful and helping others to see it in themselves", "t_liane78": "That hat with your hair and smile is just perfect. Thanks for these posts, always a good reminder to try to live and love myself more.", "tattooed_momma87": "You inspire me to go through with my sternum tattoo!!! 😍😍 How bad did it hurt??", "supersnazzykristen": "Thank you for asking for help. I have a hard time with that.", "summers.vonhesse": "You are so beautiful, your vibes are just amazing🙏💖", "amanda_marie_lockett": "Babe, you’re so beautiful! 😍 I just adore you so much!! ❤️❤️❤️", "dezziqu": "Where do you get your bras? I'm in desperate need of a new one", "deafjustin_": "Cute", "greymutton": "🤮🤮🤮", "lrl_jackson_art": "Oh my god, this is so perfect. You look so wonderful and happy. This might go on to inspirea portrait 😅", "nogueiraantony1971": "😍❤️😍❤️😍❤️😍❤️😍❤️🔥🔥🔥🔥🔥🔥", "beckeyfehst": "Seeing your belly makes me so happy. I search the internet for people with my body type and end up feeling so alone. I just love it. THANK YOU", "meyomarrufo": "Loving this picture! I want to be that bold!", "corlewrites": "Wow this is the exact post I needed to see today. This is what I've been really struggling with. Thank you for this 💕", "comfyfattravels": "Constantly so proud of you❤️", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️", "ambercurvemodel": "❤️", "aliceinmommyland": "Thank you 💕 I see curvy women all over IG but not enough big belly honesty 🙌 Mine was always *there* but ever since my c-section it’s here to stay!", "leonies_lab": "Omg I really needed this today!!! I really try to stay positive, to practice positive self talk, to remind myself of everything I’ve been through and that I’m a badass babe. But it’s so hard sometimes isn’t it? With the weight of society and media constantly closing in around us it’s hard to stay strong. And sometimes I can’t. Like today. Just had a nice cry. So I can’t begin to tell you how much this post means to me. It changed my whole evening and I think that’s remarkable. ❤️", "chimere_rogers": "💖💖💖 I NEEDED TO READ THIS TODAY AND EVERY DAY", "trexvonschweetz": "Perfection, would love to see a video from you on cheap department store (ie walmart, target, ross, etc) clothing reviews... would be nice to see a girl my size do tryons n stuff i could afford. Also if you or anyone reading this knows of anyone our size doing this please let me know. ♡", "lexii_lala": "Thank you for making this post it's so hard learning to love myself", "cherubmermaid": "Needed this today ❤️", "darthona": "Ugh. I feel this hard.", "raptisaurus": "Your joy is so amazing in this photo", "mellahalliday": "So PRETTY!!", "sanna_bourne": "You’re so cute!! 😭❤️ love your posts. Feeling capable!! 💪", "fujoshinaruto": "🙌👏👏❤️💗🤗", "pengo65": "😍😍😍😍 I love the confidence you show in many of your photos.", "softbodytendermind": "I love this pic because we are belly twins and I love this caption because I feel like this today", "bigreese35": "💖💖💖😍 awesome", "luellaarbre": "Pass some of that tan over this way", "lavender_kitchen_witch": "Thanks for this. I really needed to hear this today. I’m struggling hard with self love my physical self and my mental/emotional self.", "princeinferno5": "You are absolutely stunning!", "fattrunk": "Someone was good hair! 😍🦄", "cassy.pennington": "May not be the same help I had to break down and ask for last week. I posted a Vlog but didn’t share it on FB or IG. Still worried about judgement. It’s that just so dumb? My help, I hope, comes in pill form. And praying it really does work. And yours too, whatever it is. Hugs.", "emilyalworth": "Your smile is sunshine 💥💕", "kl.harris": "Self love...that’s what I struggle with on the daily!"}