{"morteza2888": "💋💋😚😙", "rajput_rohit_rk": "love u", "mayarhiyana": "Love. Love. Love! You are both so beautiful, thank you for sharing 🙌🏼", "confetti_rebels": "Go girl!! Love these tights on you @fatgirlflow !!", "chasethewaist": "Love this + keep going 👌🏾", "joans_upsetti_spaghetti": "Does anyone know a account in here where I can order edgy plus size cloths?", "bloodmilkwomen": "🌸🌸🌸🌸", "j_o_n_as._": "@xoxo_annii.leniii04", "hamilboothe": "@marrbarrrrr", "lipsticknlinguine": "Checking my language all the time.. not just about my body but about myself generally", "katrinagrillo": "@helefab_", "jacindalarson": "@fatgirlflow what size are you wearing here? How’s their sizing?? Thx for your help!!", "the_spirit_boy": "@monaebdrup check this feed", "muhseger": "I love this photo", "lassale99": "Génial", "thynameisdani": "Adore this! You are an absolute goddess 😍", "thatsouthernyogi": "@jamiegillis_ we need matching outfits tho these are cute af", "laura_eliz42": "@adelle_n_f read it", "frankieclaire": "Mhb", "empressofpettiness": "Competent*", "adilouirrak": "Bebee sports", "daniel.bbw": "I love your roundness! 🤩😍", "bianca_lovesplants": "I love this shot so much 🌻", "92cody92": "Both very cute", "anjeanocyte": "Te, this is us @joannariza 🤣", "kauherte": "Not trying to start shit, but why do you have to force yourself to change your language? It might be that she can do some things better than you, that's not a problem unless you decide it is. Something like the crow in the last picture just does get more difficult the bigger you get, on the other hand you can very likely lift more weight than her. Powerlifters actually use their giant bellies to bounce off in the squat. Different types of bodies have different strengths, but hers is very probably more effective at yoga. Doesn't mean you shouldn't do yoga, just means that poses are easier when you're lighter and smaller. That's why handstand artists are mostly under 5.3\" in addition to being very lean.", "seif_giovanni": "Wwwww 😍😍😍😍😍😘😘😘 amazing body", "fawninretrograde": "I’ve just stumbled across this post (following after I’ve written this) and I am truly in awe of everything you have written, as a plus size woman who started yoga this year I have been so hard on myself for not looking how the other women do & to read this post and realise that my body moves differently, looks differently & that there’s a beauty in embracing what my body can do & to stop comparing it to the bodies of others brings about a real sense of achievement in how my body has been doing in Yoga!! You are an inspiration darling 💕", "soymarijosee": "👏👏👏👏👏", "sarah.jessup.35": "Cheers for the great post @fatgirlflowgreat! BTW I love effective vs ineffective- what a great way to change my view and approach to things 🙌🏽😊", "eddy_wz": "@_denie vives julgando teu corpo comparando com o das outras.", "kiiddds": "@sid_miku_", "peachy.x0x0": "This makes me so happy ❤️", "adv_golden": "🌹🌹🌹🌹", "supersayan2137": "Maybe start to work out to be healthy not whale", "emmymilly": "Oh my goodness! Thank you for normal people yoga!!! I have 3 size 8 sisters (Australian, so American 4) and we all love yoga and it’s sooo refreshing and encouraging to seeing people above a size 8 doing yoga! Thank you so much 😍😍😍", "charlottekessie": "@mrsbradley160618", "adulting_like_a_child": "@buddha_pants catch a clue. Your clothing should not stop at large. All sizes do yoga and everything else you make your jumpsuits for.", "geodeswimwear": "Love this! ❤️", "iridalydia": "Your words are very inspiring. 😍 also that dusty cherry color looks stunning on both of you 🙌", "5892erhan": "Tosun", "constancahc": "This is a cool way to see things in. I’ve also been learning to think of behaviours, thoughts, etc in terms of ‘helpful’/‘not helpful’. It’s just more to the point than all those other adjectives we tend to use", "starheartedphoebe": "& sisters are the best!", "everyoneneedsselflove": "💕", "xhaudhary.xunaid": "😂😂😂😂", "australiansexologist": "@janayanewchurch_", "zil66doron": "so sexy", "amy_marie_la": "Wow this helped. My sister is a fit little sixpack having, tiny everything. Cute little thing. When we work out together sometimes i feel awkward standing next to her bc we look so similar in the face but I'm easily 2 or 3times bigger than her. It's gotten easier but some days i rather not work out with her.", "hellodarlin80": "I just LOVE THIS. 💙💙", "tabitha.wills": "Yes yes YESSSSSS!!! Mmmm, this is so fantastic. What a wonderful reminder!!", "plussizeitaly": "I love it🌈💓", "shopkurvekouture": "Love this❤️", "shhop.arayeshi": "❤️", "alfons_dak": "Fat girl ❤️👎🏼🏥🙄", "fatgirlflow\nVerified": "Verified", "kurvenrausch\nVerified": "Verified", "justjasjas": "I love this!! Thank you :D", "jacc_lynn": "I really love this, so much. I’ve been incredibly self conscious about the way my body moves at every weight my entire life and it’s such a horrible mindset. It shouldn’t matter how I move, it should matter than I am moving! I think you both look amazing in the outfits and the poses and now feel more confident in starting yoga again myself. Following your instagram has help me a lot and I sincerely thank you for that. 💕", "jette.carlottaa": "You aren't really fat like you called yourself in your name❤️❤️❤️", "madrigal_junior": "@xivanthebarberx", "adreeneyc": "Beautiful!!!", "prissess30": "Love this post", "eedd7777": "The quueen number one the word", "ellytheknight": "I love this so much! I have a habit of talking negatively about my body too (self-depreciation became a survival technique for me a long time ago), but I find the best way to stop is to remind myself that when I speak badly about my own body, I'm also speaking badly about every body that looks like mine, and that makes me stop. Sometimes it's easier to love other people. 😅", "bnlusk9.17.11": "Beautiful ladies! 💙", "chloe_vondyke": "Thanks for posting this! I took yoga training & I was so self conscious the entire time & instead of focusing on my practice- I turned inward to self doubt & loathing- I was so aware of myself compared to others. If I would have just let it the fuck go & just be, it would have been so much better.", "breezybalanceyoga": "You do YOU... it's YOUR yoga journey 😍", "divajeanine": "I know you aren't a bra fan, but how is the support with the Girlfriend bra with plus size boobies?", "theconnectioncorner": "💛", "kristy79_7777": "Your beautiful lady. And truly inspiring, I gave birth in June and I've been struggling with the weight gain. I've always been a big girl but it's affecting my back it hurts. You inspire me to except myself and then I can move forward 2 perfect myself", "lovebug1028": "❤️❤️❤️I love it👏👏👏", "ameliatavares24": "Courage👍👍", "thecosycottageinn": "I love that you and your sister have the same body type just in different sizes! 😊❤", "timo.soma": "وزنك زايد .شعرك مجعد .عندك مشكله فالعلاقه.تبغى تستعيدى انوثتك .....الحل عندى منتجات طبيعيه 100%امريكيه الصنع .امنه وفعاله .بس حاكينى خاص", "pirata_bra95": "😍😍😍", "rebecca.tree": "You and your sister look amazing! And your living room does too! 🌿", "minervaparadigm": "I love that language shift. Q about the leggings, are they opaque? I’ve been struggling to find plus leggings that don’t show the sheen of stretched spandex/Lycra or my skin through them!", "shawn_bon_bon": "Cute leggings!", "fluffyruff87": "Wow I love this post so much. 💕", "kshellrude": "So good 😍😍😍😍💕💕", "thatlyxx": "Ugh just what i needed to hear ❤️", "pinkpudge": "@aimee_richardson21 😘", "cialitra_": "yes!!! 🙌🏽🙌🏽💖💖", "squish_sniff_knit": "Beautiful ❤️👏", "jens_topia": "Love this language check!!!", "rubbertrampartist": "Thanks for sharing this photo! I'm a lot bigger than my beloved sister. When I see photos of us together...well, it can be really hard for me to look at the difference in our sizes. Thanks for normalizing a size difference.", "tracirainbolt": "Gorgeous!😍", "maquillerartist": "Both beautiful woman! Thanks for sharing. 😘", "tiarraaa___": "I need more people like you in my life💖", "tolkenblackkid_": "💪🏾🌹", "indiefishsteak": "Yay effective! That word really helped me years ago too ☺️💜", "shelbylaine7": "❤️❤️❤️❤️ love this", "hjwdewit": "Wow, nice story. Thank you for sharing", "patypink": "💙😘💙😘💙😘💙😘💙😘💙😘", "_hersociety": "Both looking gorgeous!!!", "pointy.chin.diaries": "These are stunning!!", "blackmagickmomma": "I love your love for everything and everyone and I just am so happy you exist. Gosh you’re terrific. ♥️♥️", "learningtolovesarah": "I love this !!!", "girlfriend\nVerified": "Verified", "nfactorial": "This. THIS. This. I have no words other than THIS. ♥️♥️♥️", "halfhollywood": "I love love love this photo set. And am beyond happy @girlfriend expanded their sizing. I’ve bought a few pairs of the XXXL in the past and it just doesn’t quite cut it. I have a feeling the 4 or 5x is gonna be 👌🏼Corissa, thank you forever and ever for continuing to represent bodies that look like mine ❤️❤️", "petrichor.poison": "This is amazing 💖 I’m probably really strange but getting comfortable calling myself fat and big and being able to laugh at it instead of get upset, doing this really helped me to cope in public. Laughing at myself and using the words that used to hurt me to make myself laugh has helped me so much 💖", "birkenstock_lover831": "Love that color 🔥🔥🔥", "jenisforlove": "I’m going to start using effective and ineffective! Thank you for that, and promoting leggings as pants bc yeah they are! 🙌🏽🙌🏽🙌🏽", "poptartshibe.queen": "You both look so happy and beautiful!", "sandee_xo_hilaria": "This is amazing!", "yesgirl.me": "❤️❤️", "brandi_janine": "🤩😍🤩😍💕", "iamthelao": "I love this post!! 🙌🏼", "chagh_pasand": "big like👍👍👍👍👍👍", "browneyedyogini": "Which leggings do you have on?", "lillianambrose": "@fatgirlflow would you mind explaining more about using effective/ineffective when talking about your body? Would love to learn more about positive self talk!", "missriss12": "I started taking yoga classes a few months back. While I’m fairly confident with myself, admittedly I felt out of place. My body didn’t move like all these other long and lean ladies’ did in the class. I had to modify the moves or just stay in child’s pose if there was certain pose I couldn’t do at all. The instructor was incredibly kind and accommodating but it still took a lot of self talk to feel comfortable with being the only fat girl in class. After a few classes, stretching at home and remembering I was doing this for myself, I started to be more comfortable. Yoga has taught me to listen to my body and to connect with it in ways I never have. It’s truly amazing. This year I’ve been trying to actively not assign “good” or “bad” to body descriptors, specifically mine and remembering that my body just is. I always love your content. It somehow always gets me right in the feels 💞", "mistressvioleta": "What a body-affirming post. 💗 I have long heard therapists use “effective” and “ineffective” as opposed to more judgmental words, but it didn’t click that I never tried using them myself until you asked that very important question. Thank you for this. I love the vibe you share with your sister.", "bellamcpherson9613": "Wowza TWO bad ass Yogi babes blessing my timeline😍😍💖😍💖😍💖😍💖", "glimmerspecsworld": "Love this post and your profile!😍", "mydestinyisdefined": "@fatgirlflow what size bottoms are you wearing!? I want a set! 😍", "q_strom_99_walker": "Nice", "wyrdyspook": "Thank you for this ❤️ it helps me to remember that I'm ok no matter what size I am. Plus the fact you always cheer me up 👍🤗😁", "nicki_alberts": "@_jessmont this would be us in our matching sets doing yoga. I just need to learn yoga... but I’m sure you could teach me jelly. 😍", "fromsarahlex": "Omg I love this!!!", "lisalinkphillips": "I love this so much.", "inspirationgatherer": "I needed to see this today. It’s so hard to be a larger body in a yoga studio full of standard bodies and not be consistently comparing your body to someone else’s. Sometimes it’s not even in a self-judgmental way - sometimes I’m just trying to figure out if I’m doing what I’m supposed to be doing with my hands or legs or what have you.", "monicalowewpg": "@yogaforeverybody Do you follow this account? Thought you would appreciate this post!", "chubbiwubbi": "I'm obsessed", "gol.goroth": "Yes! I’m training to become a counsellor at the moment and you really don’t realise the importance of using less judgemental language with yourself until you realise how often you do it. It’s so important to remember that just because something isn’t useful for you at the moment doesn’t mean it’s bad and it certainly doesn’t make you a bad person.", "juicyjayfox": "Omg this is sooo sweet!!! And I love how your talking about choice of language @jessicawallace @jeneefoxxy", "laadyofthelake": "💪🙌❤️", "lorribell1964": "Love this", "stceagle": "Nice photos.", "jo.fairy75": "@breathingspacebodywork shall we do a yoga photo shoot too? 💗💗💗 this!!!", "kaleidosteph": "Do you mind sharing where you got your leggings from? I have a hard time finding size inclusive ones.", "asia_the_remix": "Get it, bea 😍 I always enjoy your messages, you nuggets of wisdom if you will!", "thandiwh": "These photos are so beautiful 😍", "ladykatharinew": "Woohoo, you are both sexy yoga goddesses! Yes, every body is different and things don’t work the same for each person! It is challenging not to define your body by what other bodies look like or can do. Especially as a disabled person. But we are all different, and that’s a good thing!", "nicolecmaple": "This is so adorable and pure 😍♥️", "burris_2210": "I can’t ever find legging that stay up over my tummy do you have a brand that U love that doesn’t roll down @fatgirlflow", "feymoonstone": "Ever since I was little I wished I had a sister, but I never got one lol.", "hayleyhermsofficial\nVerified": "Verified", "yay_its_carol": "@merelwildschut @juliakaas @sigridnynke ❤️❤️❤️❤️", "felicia1220": "@fatgirlflow How do those leggings fit you? Do they tend to roll? How do the thighs feel? I'm a big girl and have trouble finding leggings and work out gear that fit like I want them to!! 💜🍑", "natalieglitter": "I have a very thin sister and it makes it hard to be comparing one another all the time. Thanks for this post to make me feel like my body is just as effective as here. Love y’all both!", "yaire_official": "🔥🔥🔥🔥", "thefattingtonfrisk": "This is so amazing! 😍😍😍", "allysmiles_": "Needed this", "betaniavg": "Beauties both! 🤗", "j.badaman": "This is cool! 👌🏽", "mandyoh": "🤩🤩🤩 This makes me so happy!", "danascamera": "Such a great post!! Love your words!", "thenyoutellme_ruthann_": "Love this ❤️", "maryam.haircut": "💋💋💋💋💋💋love you", "jessiejames1331": "Love the message! And the studio space ☺️", "junglehousegoods": "But can we start a fat yoga class at Jungle House maybe?", "movementmakesitbetter": "Yes! This is why I am dedicated to getting my cert to teach buti to larger bodied people because there are things you can't ask a thin person for help with \"hey what do I do when my stomach is in the way... How do I do this pose when the fat on my side body hurts to be compressed that way.... Etc etc.. I want to be that person people can ask. Love this post!!!", "fiercelittleginger": "@haethor 😘", "taylorwolframrd": "Yoga sissies 💕 @mallorystiffler", "ja.imebutterfly76": "Thank You for giving me a reflection of my own body so that I can see how beautiful I am! 🥰", "justicekf": "It’s really really nice to see representation of such a loving relationship between sisters in differ bodies. I have 2 and each of our bodies are a different size,shape. And out movements and activity levels are all different. This is heartwarming!", "flashbookbridal": "That last photo is just the cutest!!!! ☺️", "yumaratz": "All bodies are different and move differently than others. Like you, I learned that my body is not the same as others and theirs is not the same as mine. It. As I age, I cannot do today, what I did 20 years ago and I have to keep reminding myself of that. The both of you are beautiful.", "shaynelotusphoenix": "I have to say to me (a yoga instructor) your poses look the same.", "nervousinjuly": "New goal. Reinvest more attention to my language when referring to my body or others. 💛 Thanks Corissa for the great reminder", "beebumsinbloom": "I honestly needed this right now. I'm so self conscious about how differently my body moves and this picture is so beautiful because I see two women who are supporting each other both beautiful and my insecurity lately has been just, whew, bad. Your posts and your sharing have just, really been such an amazing support system? Even if its indirect. Thank you so much. Truly.", "meahgss": "Omg you’re both just SO stinkin’ cute", "theslamichelle": "Thank you for posting this. I was just trying to do yoga this morning and I quickly gave up because I was judging my body and comparing it to those I was seeing on the video. This battle to love myself and my body is so exhaustingly difficult. But thanks to you and other influencers I continue to grow and continue on this journey of self love and acceptance.", "valetardes": "😍🙌🏻", "slarsen526": "I definitely compare myself a lot. I used to ask others if I looked like other people or was “as fat” as others. It’s horrible. I have been working on being kinder to myself as well as not comparing myself. I see others as beautiful regardless of size or weight. I’m still working on myself though. On a side note, those leggings and bra sets...which ones are they? I love them! I struggle to find sports bras that fit me well. I also can’t decide between a classic rise or high rise legging either. Thoughts?", "tonyyul703": "Honestly I LOVE BBW", "madderandfatter": "I followed your sister because I’m a creep and I love you both and this makes me miss my @nikyep", "chayjoshlivy": "you are both badass and inspiring!"}