{"director8500": "😁😁😁😁😁😁😁😁😁😁😁🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹🌹", "amydkhdawndly728": "اف اف", "xx.xtay": "@renzocamposs", "khldbwmwsy8": "🌷👅👅😙😙💋👄👄😙👅🌷🌷😙😙😙😙😙💋💋💋👄", "saraaaelizabethh": "🙌🏼👏🏼", "roystonslater": "Looking fabulous in your jeans😘😘😘💋💋💋", "the.cox.corner": "Oh my god SUCH A RELATABLE POST..... Honestly, when you are a plus size it is the biggest struggle ever trying to find a bra, because they can fit perfectly on your actual breasts but then they are pretty much always like this around the back 😭😭😭😭", "geogeskounga": "Un bon weekend au Cameroun m'arrangerait beaucoup", "gurdansinghkalsi": "BEAUTIFUL ATTRACTIVE FATTITUDE PRINCESS", "ms_curvylicious": "Nice", "cockneycook": "I wouldn't put you down xx🔥🔥", "royyanti77": "😇", "ouraganfab": "😘😘😘", "muhseger": "Gorgeous eyes gorgeous boobs", "foroshgahe_mobin_o_novin": "❤️❤️❤️❤️❤️🙌❤️🙌❤️🙌🙌🙌🙌🙌❤️❤️", "mario_soare1212": "Eu quero", "chadroyroyster": "🔥", "callan_rush": "Inspired", "ca.lvin6555": "Nice ass", "irahim521": "💖💖💖💖👍", "jessnmarleigh": "Yes!!!! 🙌🏽 I always thought I had a funky body shape because all the bras slide into my back fat. Let’s show this to those “expert bra fitters”. This is how plus bodies be sometimes. Embrace it! Cuz we sure as hell have! 😜", "patrickperry6882": "You are gorgeous forget the ignorant self hating losers", "mrg317": "I used to work at a bra store @changelingerie in Canada, and we literally would tell our customers, if your bra isn't showing your \"back fat,\" it's not the right size! And then, since I teach Pilates, I'd say, \"But if you want to tone it up, come see me at my side job!\" :P", "simoerrhby": "So hot", "do.uglas3760": "The baby I would love you and you to be friends", "behnam34506": "👏👏👏👏👏🙌👏👏👏👏سلام", "elismar.silva.5015": "😍😍😙😙😙😋😋🌶️🌶️", "korosh.farahi.7": "Wow, I want to do it from behind", "nikzadelmira": "لایک", "loboo1963_": "Corazon k Bella guapa y Hermosa estas mami", "singhhp73": "😍😍😍🌹🌹🌹❤️❤️❤️❤️I like it babe your beautiful eyes 💋💋💋💋I love you babe", "drajidarajino": "❤️❤️❤️❤️", "samirsamir8077": "😍🔥🔥🔥🔥", "_baaby.bella": "For a long time I thought my bras weren’t fitting me right but I’ve finally accepted that they’ll always go into my back roll unless I lose the weight 😬", "khosropourakbari": "Salam", "leah.marit.wellness": "Gorgeous ❤️", "litarobinson10": "@diiantaesavageeee", "varzeshvarzesh1111": "🙈😍😍", "inthemiddleofnowhere31485": "🔥💕🙌🏻Yaaas ! Girl get it .", "devonsmith80": "Take it off🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "ravindra_pr": "💋😍💋😍😍😍wow💋💋😍really beautiful💋💋😍😍😍Love you dear💋💋💋😍😍💋😍😍very hot 💋💋😍💋💋💋💋😍kiss you💋💋😍💋💋😍", "suaxkid": "❤️💗💙💋💋💋💜💛💋💋💋", "juancarlosfernandezcarlos53": "Eres una mujer muy interesante y hermosa 💖💖😚😚🇦🇷🇦🇷", "pozaandrescarrasco": "👏", "mbphotographybend": "@life_as_corinne 🙌", "jorge.machado.1967": "👏", "imdaone43": "Nice pic 😍😍", "towfab": "Magnifique", "positivelybig": "My bras ALWAYS go into my rolls, I’m glad it’s not just me. 🤩🔥", "genzo679": "❤️❤️❤️", "aprildawn1284": "I just wanna say how much I love seeing your posts in my feed because they scream positivity and reassurance and I’ll be damned if everyone doesn’t have you and/or your boo projecting self confidence, love, and contentment. You and @comfyfattravels seriously make me feel not alone and give constant inspiration. I hope you both always remember how important the work you do is. ❤️❤️❤️🔥🔥🔥", "karl199": "You look so sexy ❤️", "yasinfnisis3452018": "Hola😍", "i_weigh\nVerified": "Verified", "ptrsn_given": "😍😍😍", "lil_anita_six9": "Wow disgusting", "cortney_carey": "♥️♥️♥️♥️", "ilalaloveu91": "I love this. My mom has made comments before about my bra giving \"gush\" in the back...not realizing that I have the gush with or without the bra! Thank you for the confidence and sharing it with us! ❤️", "rezaahmadi7468": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kslady88": "Im going to have to start using these hashtags", "hannah_rae_of_sunshine": "🔥🔥🔥", "aeisa2010": "Beijo toda 😍", "vespertinadiaria": "I dont know how you dont find the bra going into the rolls uncomfortable. Im plus size as well and when my bras roll down into my rolls, they pinch and dig into me. Its so annoying when they roll down! 😖", "dehganmusic": "Oòohhhfff Eat your boobs gooood beautuful Love your sexyy wooooowwww", "otherplanets": "WHEN will someone reinvent the bra for actual fat people??? If only market driven innovation was actually motivated by the underserved market that we are 🙃", "elegantesites": "👏👏👏👏👏So, you’re beautiful girl!", "amylanta": "Omg! I ❤️ the statement \"please consider that you've just never seen someone as fat as me without their shirt on.\" 👏👍🙌", "quixoticparody": "You look great. The haters are going to hate no matter what. Society in general sucks if you dont conform. Do you! I'm so glad you have the confidence to do so. #bodyconfience #bodypositive #winning", "miss_sarahharris": "I love this! ❤", "dibyendudubey": "Excellent", "mari__amelia": "Yesss 😍😍", "dizzfattie": "Totally feel you on the bra thing. Even the bras with the “support” band that are more wide cant hold my fat. It just rolls out as I move about throughout the day lol", "rachmmath": "Didn't give the bra a thought was to busy looking at the hot butt 😍😉", "riladespe755": "😂😅", "kayandthetwins": "You are absolutely fabulous! I love your honest posts 😊 x", "miss_soulfood": "❤️", "26kleisen": "Would be great if they find a solution for that though.", "findingmelody": "You’re so inspiring 😭✊🏻💖", "yamalo17": "Yassss to back rolls 😍🙌🏾 & the jeans are hot af 🙌🏾🔥", "doglady2018": "Your radiant beauty and unconditonal positive self regard are a constant inspiration to me. Also, that hair! Love it! ❤️❤️", "dlstaff99": "Gorgeous 🔥❤️", "cowboysandangelsuptown": "🙌🏻", "stormcrowe_x": "My 1st instinct is \"Careful with your nips around the plants!!\" 😉", "julie_hoffmann_45": "@fatgirlflow why is it that when I look at your body I only see beauty, but when I look in the mirror I hate/criticise what I see.", "jose.miguel.rojas": "...😘", "justkathy_927": "You rock", "somewhere_under_the_rainbow": "\"This is how my body works. Please be chill,\" may officially be my new tagline 😂 loveeeee it, loveee this, loveeee you!", "amylatrese": "The crazy part is... I looked at this and said 🤔 \"maybe I should try to tuck my bra under my roll instead of trying to force them flat across them because all it does is life up and roll.\"", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "hashbrownemotions": "You are just TOO CUTE! 🖤", "raspberryjorts": "I was looking at the cup and I was like it looks like it fits fine lmao", "chayjoshlivy": "seriously fuck bras! i only wear cloth bralettes now when i absolutely have to, threw out all my actual bras over a year ago and haven’t looked back since.", "daequan.knox": "🌹🔥😍❤️", "oliab": "Same.", "thefattherapist": "My back fat eats all my bras too. 🤷🏻‍♀️", "itsthefatunicorn": "I want a bra that is wide in the back--like sports bra wide--hooks in the front, cleavage boosting, and comes in all sizes and all colors. Lol 🦄", "angelmed17": "Exactly. Yessssss! Bras dont ever NOT roll up under my atm", "virgomariaa": "@fatgirlflow THREE things!!!! Thoes snake plants!! And I see a Zz but thoes moonshine sansevierias!!!", "comfyfattravels": "Youre hot and your butt looks great❤️", "nadiabokody\nVerified": "Verified", "v.wetlaufer": "Ohhh that bra I’m fat rolls problem is so real. One of the reasons I stopped wearing bras.", "spleenifer": "Haha yesss! I've got the hungriest rolls...always eating my damn bra 😂", "ducshka": "Your a beauty 🤓😊🌺", "varnishandvine": "😍😍😍", "chriscrawford71592": "The prettiest person 😍😍😍!!! By the way those jeans are 🔥🔥🔥!!!", "tfuller2010": "I wish I could be as beautiful as you!", "diemmeblack": "@fatgirlflow Love this. @torridfashion jeans are fantastic.", "metallicleoraa": "That just means that someone needs to create a better bra!", "yumaratz": "Corrisa, you look amazing and yes, your butt looks fantastic in those jeans.", "beckyblackkkk": "#pleasebechill = mood always 👌🏼", "si_hoss_": "The struggle is real! My favorite bra that actually doesn't roll up is the 360 Back Smoothing Bra by Torrid... Which fuck \"back smoothing\" but it's got a wider band and where the strap attaches in the back is wider. It's the first bra I've ever worn that doesn't roll up into my rolls and therefore it's SO much more comfortable!", "ninobrown332": "I love your rolls.🔥", "bloombras": "@fatgirlflow we would LOVE to get you a Bloom Bra to try. We cover 28C-56L and are designed specifically for curvy ladies like us ❤", "mandixchartier": "Looking hot girl!! 🖤🖤🔥🔥🙌", "qhathryn": "I know the feeling with the whole bra sitch! It's so hard to find bras without the damn side boning, which does nothing but constantly stab me to death!", "matthew.winston": "Beautiful 🌹", "crotchlessyogapants": "My whole life is trying to find a bra that doesn’t do that because it hurts. I mostly just bralette from @tomboyx @torridfashion @catherinesplus.", "ashleejayeh": "How I wish I could wear a real bra again. 😪 Companies don’t care about superfats with small boobs.", "bby_goil": "Thank you so much for existing!", "elevatorootd": "Those are the premium torrid ones from your video, right? I bought a couple pairs of the sky high skinny jeans and they have revolutionized my jeans life. I keep having to fight the urge to buy like ten pairs in case they are discontinued 😂😂", "rosemaryandquartz": "Personally, I think bras just suck ass.", "allainac": "❤️", "lrl_jackson_art": "You are looking the bomb here! Loving the confidence!", "tammykarman": "🔥🔥yesssssss to Sunday😍😍"}