{"jjeat0n": "Ok so I'm gonna be the dick here and say regardless of how you feel about yourself it's still very unhealthy, at the end of the day you can be content and happy with your image but it is still extremely unhealthy for your organs to be dealing with excessive weight, you can get mad all you want but facts are facts", "cinnamon.muffin_": "I just hope you’re healthy, and since you’re happy it does indicate that you are living a healthy lifestyle", "galaviz_anthony": "You should be", "tabithafaith": "I love or this so much!", "suga_suga84": "i love when i see others rocking their VBO... but i wont rock mine. I think it won't be cute on me .... i think mine is too big..smh. i can't stand i think like that.", "roystonslater": "And looking fabulous and beautiful 💐💐💐💐💐😘😘😘😘💋💋💋💋💋", "auntieerica1984": "Where do we get this T-shirt?", "paul_gwen": "Please help me find this t-shirt I’m in the uk 🇬🇧 PLEASE....", "erichgreub": "👍👌💯😘😘😘😘💖💖💖💖💖💖", "mysticstudios": "Girl! My fat kawaii ass needs this in a pink!!!! 💖💖💖", "nazaninmhd1075": "@hasti_taghizade", "itsemilyrios": "such an inspiration ✨ fat is beautiful and #effyourbeautystandards learning to love myself everyday. thank you for this! let us plus size women redefine these unrealistic beauty standards. let’s celebrate the bodies that we are in wholeheartedly! 🥰", "debzdragonz": "I hate my arms gut i wear slimming garments each Time i leave my home .so painful but i feel better . I found you after reading a very interesting article on line.", "nardia_elizabeth_": "Please can you share link for shirt I can’t fine :( oh does it ship to Uk?x", "becky690": "I love this shirt where can i order one", "thaantagonyst": "Hey i love this shirt and would love a man's version of it to rock! Is that a possibility @fatgirlflow props to @whitneywaythore for showing off the shirt and being basically the ONLY positive representation of the #plussizecommunity on 📺 regularly!", "hollywilliams494": "@missflirtyfleur this freaking shirt it so rad!!", "yourphantomgirl": "Можно мне такую же крепкую любовь , как ее ремень", "lovely_eyezz": "Where can I get this shirt. I've been looking for one.", "emrldeyez": "@fatgirlflow when will this be back in stock?", "katieridgwayettman": "@mlhuttenhoff the new shirt I have on the way. 🙌🏼💪🏼❤️", "caitlenjustcant": "@fatgirlflow how do I get this shirt?!", "mellyxiii10": "Where can I get this???", "xo_michellelynn": "Are you ever planning to restock this shirt? I’ve been wanting it forever", "sonya_da_boss_": "That's really one of my most insecure areas Honestly", "msnmjl": "@kerrylynch88 no she has not just named it a VBO hahahahahaha", "thetysonpaigereel": "😋", "tj_georg": "As a person that has dealt with my own insecurities I empathize with the feelings of the stare. I appreciate the idea of dressing for yourself and not for others. Do you have any idea that allies can do to support the body positive movement?", "hydekris": "You're beautiful", "zaza1ferman": "🌷", "birli97": "Selam 90 0534 7077673", "eedd7777": "I am love you beautiful", "mags_tags": "I still struggle with this. I’m fat and very tall and I only buy clothes that cover my vbo. It’s very limiting honestly. I hope I can get to a place where I don’t feel the need anymore 🌸", "mi_lfjourney": "I hated it. I got rid of it. I'm still heavy and hurt all over.", "lyiss_may": "First: how do you get those waves. Second: I wish I had your confidence ❤", "pix6570": "I want your T-shirt where can I get one?", "megandeede": "This post really speaks to me.", "madbrazen": "I'd still smash and play with your rolls", "varzeshvarzesh1111": "😍😍", "lawrence.jones.520125": "I love looking at you in this picture! I think that you are so beautiful!", "eddie.1217": "It's sexy ,, I love it on u , baby", "bristolwild": "I struggle with separating what I \"like\" with what is \"flattering\". I can't get my head around how I could like something that isn't flattering. Isn't that why people like a certain outfit (other than comfort)? They like the way it makes them look? I like the way a tshirt tucked into jeans looks on thinner people but on me...it isn't flattering. How do I start liking things that don't flatter me?", "tacogeek23": "I really needed to ready that. I need to start celebrating my body instead of being ashamed!! You are awesome and inspiring!!", "dariusmjackson2003finsta": "You sexy", "trwhiten": "😍😍Your a cuties", "liviateixeiralts": "Que linda 💖", "visiondiet": "Hi I never mean to be that person to advertise my page on someone else’s page but I’ve recently made this page to get myself out there and this community has been so amazing but getting to where I want t be is hard so for anyone who’s interested I will be uploading outfits and such and maybe creating a YouTube Chanel feel free to follow it would mean a lot 💛💛💛", "suzijamie": "I hate how i look. I feel so uncomfortable, I wish i had more confidence in myself", "isabele.capeles": "I hate my tummy lines, specially the C-section pouch", "norcaligirl": "Pencil skirts and bodycon dresses. Not there yet.", "thickgurlwithweights": "Love this shirt so much!", "_wobblybits_": "I felt the same way when I started wearing highwaisted pants. Though, I have yet to find the courage to wear jeans like you - I definitely will get there, but it’s a process for sure! You look great, btw 😘♥️", "faeriethusa": "I like VBO way more than other names for it!!! I would wear all the shirts that aren’t 31” long or longer. I’d wear all the non-tunic things. I’d wear a jumpsuit! I’d wear cute jammies with matching tops that I don’t currently wear the tops to because they’re too short. So many things. Thanks for always posting about the hard for us to talk about things. I’ll work on loving my VBO. 😘", "stu393": "Your so sexy x x x", "janice7458": "Such confidence", "the_other_hillary": "Crop tops!!", "ha.rold6730": "More cushion for the pushing baby", "jasmineledoux": "I'm extremely insecure about it especially since I'm only 20 and most girls that are and around my age in my town are really thin or average weights. I like high waisted jeans and cropped tops but hate how it looks on me so i usually just get t-shirts in the mens section because I feel a little more secure in baggy shirts.", "kristiedaniels_": "Needed this post today! I’ve recently moved to Luxembourg, and like a lot of Europe, fatness is uncommon and frowned upon. I left the house feeling fly and two or three ‘looks’ and my lower stomach are enough to rocket the anxiety and want to make me head home!", "quixoticparody": "That's why I started Instagram a few days ago. To figure out and push my comfort zones. You're right! I'll try to keep that in mind when I do where that sheer top or bralette in public.", "bo_leta": "I am terrified when it comes to my VBO. I hade it anyway possible and also try to hide my back rolls. I am working on slowly becoming more comfortable with it all, luckily I have a partner that loves and encourages me to wear things that show those things off from time to time! It’s a slow journey!", "nicolearndt92218": "I'm so sick of trying to hide my fat rolls..seriously it's been really bothering be lately. I'm trying to get over that fear but its hard", "bigdiffbabe": "if i wasn’t worried abt my VBO i would try wearing rompers/jumpsuits", "autotheoryqueen": "👑", "op4945": "Looking nice", "grace_eatz99": "I NEED THAT SHIRT 😍", "dang_mari": "Me 4 years ago: •I've always been fat, likely always will be, and there ain't nothin' wrong with it. •I'm way past using minimizers to hide my belly. But why am I hiding and minimizing? I'm awesome. It's time to rediscover pants. Haters be damned! ~However~ my clothing choices are limited not only because of size but because of disability. So I mostly wear leggings and tunics. Sometimes jeggings. But that I wear pants *at all* is a big step for me. VBO held me back for so long.", "kslady88": "This makes so much sense. I’m going to work on this this year.", "ladymissbeca": "I’m working on VBO acceptance. My lower tummy is my biggest part, so just finding things fit is super tough. I did recently find jeans that mostly fit, so it’s a work in progress.", "atvt2010": "This is interesting. I have an hourglass figure with a big belly that sticks straight out in the front, sort of like a baby belly, so I'm not uniformly squishy. I usually cover my VBO because I dont want people to ask me about being pregnant (I'm not). I also wear long shirts/tunics that elongate my look because it draws attention to my hourglass more than my belly that way. I actually think if I was a different shape of squishy I would be more ok with it.", "stephaniewithintention": "I love love love this! Thank you for your honesty and downright awesomeness!", "arvyiskindofharsh": "Yooooo I had this revelation not too long ago too and honestly, it's so liberating. Ive struggled with my body for a long time and often ended up wearing things that were uncomfortable and I hated. Finally, I was like \"I know I'm fat, everyone else knows I'm fat, why do I even bother dressing like I'm trying to hide it?\" Now I just wear what I want, things that are comfortable and make me feel good. 💖", "nocornflakegrrrl": "If I weren't afraid I would wear ALL the latex/pvc/vinyl dresses I could find. Bodycon in general. I would feel so slutty all the time, in a powerful way. 😍", "suus.s71": "Coming at the age i am today, i realise its me who is judging myself almost all the time i look in the mirror and notice my vbo.. i don’t remember getting comments about it from other people(accept my mom... yes still in my late 40s!🥴) so i’m slowly letting go of my own judgement... some days i succeed better than other days😉 Love your smile😘", "caldonia.crow": "I hide it, for me its not aestethically pleasing for my eyes, so I skip tops that are snug over that area, etc. Since im apple shaped and my legs isnt fluffy and phat (wish they where tho) it looks wrong on me. If I was more pear shaped I wouldnt hesitate. 😊", "ohaimeehey": "I’m still struggling to accept my VBO. I would love to wear jeans but I still feel so self conscious, especially after my belly changed from having a baby, and it’s even more noticeable. How can I learn to rock it?! 🖤", "jennifer___diane": "I needed to read this today! 💞", "laoise_lee": "This👌 today 🙌 thanks! 💪", "mrs.shortandstout": "I neeeed to work on this 😩 it’s something I really struggle with", "mypetdevil": "I want to wear high waisted jeans or a body suit under jeans or a skirt. I have a hard time with my VBL because I don't have hips. And am not hourglass shaped. I try to be more comfortable. It's hard.", "hannahisdead": "Ive given up caring about my VBO! You're going to see my belly no matter what, might as well love and embrace it! I love wearing soft clingy skirts. Having an office job means i have to hide it more at work because I've literally been sent to HR over being fat. But, also, im fat, you're going to see that shit in a muumuu or a mini skirt and i can love it regardless.", "imkellyscreename": "Ordered. I see and appreciate you 🦄", "cat_gizzy13": "I always wear long shirts to hide the FUPA. My husband hates I call it that but damn it that’s what it is. I would love to wear a two piece bathing suit or a cute crop top.", "unicornisms": "Damn. Yeah.", "ninajean": "I still have love/hate feelings about mine. Especially because sitting all the time as a wheelchair user it’s exaggerated and not as lovely as I want. I’m working on the love tho xxx", "soft_shark": "Tucking my shirt in to high waisted jeans like I use to almost everyday! Some days I get a nice case of the fuck it’s, and do it. ♥️", "bigrob1968": "You look beautiful!", "beckeyfehst": "For me its not that I want to hide it but that jeans are painful. My belly droops to atleast my mid thigh and I has a c section so there is some numbness and sensitivity.. Jeans tend to cut my belly into two sections and cause pain. So I wear almost exclusively leggings.. Which also have issues because I can only find one brand that doesnt work their way down with every step. In the summer wearing dresses makes me so happy. I literally hate clothes because I am always physically uncomfortable in them. I used to be fashionable but now its just about finding clothes that are tolerable and fit.", "digi.meow": "I would wear more pants. Jeans, leggings, skirts! I love those things, but I am SO self conscious of my belly 😢", "makeit_rahne": "I would try crop tops and high waisted bottoms. I feel so self conscious if my shirt isn’t long enough to cover my whole belly. On a normal day you can see me constantly pulling my shirt down", "rn4doc": "@fatgirlflow I love this pic you look so beautiful 😍", "jenlynn53": "Thank you for talking about this!!!!", "helloitsmxnasty": "I have a weird relationship with my belly. I've had a low hanging apron-type belly basically forever and it's not easy to love. In addition, the top half of my belly is pretty round and pokes out so I always felt so... out of proportion. Like, I'd see other large fats who had one or the other and it seemed more easily acceptable as far as clothes and style etc were concerned and here's me with belly for days and feeling awkward and uncomfortable in my body. Me and my belly have a better relationship now, but it's a 20 something year work in progress and I accept that it won't always be easy to love her, but she's mine and we're stuck together so why not make the best of it all, right?", "m1ssroe": "I have still not excepted all 300+lbs of me. I don't see it as beautiful. I see other women, slim or thick or fat as you say, as extraordinarily beautiful. But when I see myself I'm disgusted. I see my beauty inside. Not out.", "jessmeowka": "VBO is an issue for me too especially since I’m not a “”flattering”” hourglass or pear shape. I looove denim minis but the vbo stops me wearing one 😫", "adventure_ecologist": "I would stop hiding behind hoodies and oversized baseball tees. I would start wearing more fitted button downs because I think that looks fly AF.", "t_liane78": "Love it. And honestly you can't win even by trying to play the \"rules\" when I was nearly 100 lbs lighter I showed a picture to my mom of me finishing up a 5K. Her comment: \"aren't you embarrassed to have your tummy showing like that?\" Running a damn race, way smaller than I am currently, and all she saw was the outline of a tummy under my shirt. That game isn't built to win. It's built to make us silent and invisible. Fuck that.", "rolandwilliam78": "Hello", "downthesamehill": "💯😭", "cafechick80": "What are your favorite plus jeans?", "bam.peesly": "I hate mine 😭 I think everyone else looks good except me. You look awesome. Every other fat lady looks awesome. I look...not good 😕", "savardmusic": "I need that shirt 😍", "axeo19": "These are my exact thoughts put out into the world lol I still don't have the balls to let it all hangout! Love your confidence 💖", "kaj_ay": "Yeahbsolutely. 💖", "mrosemt": "I just bought my first pair of jeans in years bc of you! Love them, love y'all!", "idetektiv": "I'm still super uncomfortable with it, but I've also finally made that realization that no matter what I wear people will know im fat so I need to stop limiting myself! My first step is to find cute pants that I feel comfortable wearing without a long shirt.", "halfhollywood": "Jeans don’t bug me anymore but I’m still pretty self-conscious about wearing clingy, tight things- I had this super cute maxi skirt that was clingy and form-fitting and I noticed how many more dirty looks I’d get when I was out and about. I got rid of it, but I wish I hadn’t 🤷🏼‍♀️ Fuck those fatphobes.", "blackjones20": "Queen😍", "foxyfattie": "Yesss!! I’m slowly getting out of my comfort zone by showing VBO more. Screw it!", "sly__84": "I can't remember how I found your page, but I'm glad I did! I struggle with my weight and wearing \"flattering\" clothes sometimes, but I can always count on you and your posts to reassure myself that I shouldn't worry so much about things like that because I'm worrying my life away. You've helped me tremendously, and I love you for it! 💜😘", "megthompson44": "I’m trying so hard to get to this place. I’m afraid of my VBO but also want to tuck in my shirts! I’m practicing. You inspire me!", "coralascetate": "Crop top", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️", "tea_and_jesus": "I hate my VBO, and try to hide it as much as possible 😔", "corithafagan": "Hi wanna be able to wear high waisted shorts with crop tops", "dthcplvrms": "That shirt is everything!❤️❤️❤️", "mlrice1119": "I’d try a bodycon dress or a crop top or a 2 piece swimsuit", "601959sah": "🔥🔥🔥", "bbkeeper": "Bikini", "marshamclennan": "Over Xmas holidays I ripped the butt of my jeans & last week I cut them off to shorts now it doesn't sound like a big deal to a lot of people but I haven't worn cut off short shorts for over 20yrs!! I love them! And I've had so many positive comments!! So many women saying they wish they could do it too!!. My answer is that they can!! I'm feeling more & more as I'm older that if people don't like what they see then don't look!!", "brownskincutie81": "@fatgirlflow I used to be so self conscious but now I let it all hang out. There is no secret that I am fat.", "organicskytherapy": "THIS IS A HUGE ISSUE FOR ME😭no matter how much therapy I have (granted I was a therapist myself for 15yrs) and self love practices and accepting my new shape (5yrs of being disabled and limited mobility due to chronic illness) after being very physically fit, I don’t know what else to do but as soon as I See my VBO I freak out and even avoid going outside if I couldn’t find clothing that wouldn’t show it! I FEEL HORRIBLE ABOUT THIS BECAUSE I KNOW I SHOULD TOTALLY ACCEPT HOW I LOOK! And it’s completely ok and wonderful! I love IGs like yours and other plus size models but when I see myself I got crazy and don’t accept it! Totally ashamed :( and truly sad that I’m ashamed cause I know I shouldn’t be!!! I HONESTLY DONT KNOW WHAT ELSE TO DO! If u have any advice please please please IM me or reply as I should be able to feel totally fine about my VBO if I’m fine with others yet somehow I fall short at accepting my own :( any advice b appreciated 🙏", "alizabel": "I am not comfortable with my VBO. I’m saving this post because I want to work on it! You’re right: they already know I’m fat!", "saj100077": "I wear long button up cardigans with everything to hide my VBO", "meeganniccole": "I am so self conscious of my VBO. My man tells me not to be so ashamed of the way my body is. I'm slowly, but surely working on that. Especially seeing you be so free with your body, it gives me hope. ❤❤", "irreplaceablelov7": "😍😍😍", "tamina_xoxo_": "Omg... dresses, the ones that flow out because I can see my belly jiggle when I walk. I’d also love to wear one of those cute high waisted two piece swim suites. I also always wear cardigans or kimonos because I’m very self conscious about the back fat 😢😒", "jewel.mailloux": "Basically anything bodycon. But honestly my arms are my biggest hangup 😕", "madteapotsbro": "I can’t wait until my size is back in stock for the shirt!", "soulshinekate": "I really struggle with my VBO. It doesn't help that that's where I carry MOST of my weight (like seriously look preggers compared to the rest of my body) my goal for the summer is to slowly work in getting more comfortable with it. I gave up my tank-top-under-every-shrit addicted a year ago and I feel like that was a big step. Thanks for being you and always inspiring me to push myself further into self-love!", "bec_radford": "Do you ship to Australia hun? x", "leavemealone.fr": "I have two big rolls but I’m still very scared of my vbo with the lower roll because it’s much larger. I’ve been trying to be more comfortable with it so I can wear more of what I want to instead of what I think will hide it best.", "thisis_myactivism": "Honestly I love the way my belly looks in tight clothes ❤️", "rayrarose7": "I have the same issue of showing my vbo and my legs so I'd love to wear more skirts and bright colors almost all my clothes are dark I'd also love to wear skin tight clothes as well especially since I'm a huge anime fan and want to cosplay a lot of characters that wear skin tight clothing", "cattiechu": "Wow I had the same realization about a year or so ago. Oh no you can see my fat rolls, well yeah is that the end of the world? I am fat, people know I’m fat wither or not they can see my fat rolls. It’s been such a help getting dressed everyday now that I don’t think I need to somehow physically disappear or something.", "cat.hatfield": "I did the same thing!!! Like i could hide that I was/am bigger than everyone else. I am trying to love myself as is. You help me with every post!!", "khalimacintyre": "This!!!! Thank you.", "babsbookaddict": "I am getting more and more ok with the VBO. My super cellulite thighs and butt are harder to love. I am slowly accepting that pants don't have to be thick enough to mask my cellulite.", "c0rganic": "Fortunately, I’ve never been super insecure of my tum, despite it being quite prominent lmao. I literally tucK evrYTHIng In ahaha I’m not gonna sacrifice my fashion preferences cause of a little pooch", "bsummerbeauty": "I very rarely share my vbo... I feel like ppl stare.. I've worn a few shirts tucked in and threw a cardigan over it. It takes time to become comfortable.. but posts like this help ♡♡♡ thank you", "faith_walkerz": "Omg I need this shirt", "sophiexylia": "Letting go of my VBO is a journey I just started. The first two times I wore high waisted shorts that showed my stomach, I was bullied by strangers. Trying to not let cruel people set me back, but I’m a work in progress. Seeing things like this helps, so thank you.", "kristenjean.fleming": "Love this!! I’d wear more bodycon dresses and pencil skirts.", "nekodameow": "I’m fairly certain that this post has inspired me to finally wear that tight little black dress I’ve been dying to wear but didn’t have the courage. This post is so amazing, thank you!!!", "yumaratz": "You are a beautiful woman and really, I never noticed if your belly outline was visible or not.", "strong_in_the_broken_places": "I would love to wear tight fitting skirts and dresses.", "abbie_thee_pony": "I’m on a journey to loving my VBO 😭😭💗💗💗", "beautybyronron": "I’ve always been afraid to tuck shirts in because then you could see my belly outline 😢 I’m really going to get a shirt I can tuck in!!", "vitaminc3c3": "❤️", "amorenourishedlife": "Thank you for posting about this! 🙌 @fatgirlflow now I know the name for it haha. Always been my biggest insecurity but shes such a cutie, were becoming friends 💕 interesting to see how thighs, stretch marks & cellulite are becoming normalized but big(ger) bellies are still shamed, even in the bopo world. 🤔", "songbirdali": "Girl, I love you so much. I'd wear shorter shirts. As it is now I may as well be wearing a dress with some pants and I hate it. I'm not there yet but you're inspiring me to say fuck it and just do what I want. #inspired", "shelbylounails": "PS I think you are so cute in this picture! Not *in spite of* being fat, just so damn cute period 💜", "sparklesandstretchmarks": "You look awesome, I love that tee! I’ve been trying to stop dressing for what’s flattering and just wear what I like myself, I think my sticking point is body con dresses though - I haven’t done that yet x", "rmhbernoff": "I used to be terrified to tuck my shirts in, but I fully dgaf now and life is so much better!", "comfyfattravels": "I would certainly tuck in my shirts more if i wasnt so weird about my vbo!", "matthew.winston": "Sexy 🌹", "chriscrawford71592": "I've grown a belly over the past few years so I know that one of my issues is the internalized shame that comes with that but also the shame of most of my clothes not fitting right...I need new clothes is what I'm trying to say lol.", "lil.ranch.life": "For VBO I would wear more crop tops. I also want to get more comfortable showing my back fat cause I love backless tops and dresses!", "adventuresofbanchee": "Love this!! And love the photo - that outfit is bangin! I might have to buy one of these shirts! ❤️", "aurora2306": "I didn’t know it had a name! But I’m still so very conscious of my outline.", "alittleunderrehearsed": "I'm gonna go ahead and admit that my VBO is currently my biggest struggle to love about myself. I wanna wear bodycon dresses, pencil skirts, and all the clingy fabrics! One day at a time, I will get there.", "fatfunnyfree": "It's a process, still working on on it. It's there reguardless lol. Funny how when I look or notice others the only thought I have is how amazing they look.", "yes_darlin": "Thank you for this!", "awhisperoflight": "I'm slowly (read: super duper slowly) starting to feel comfortable showing off my VBO, but I have fairly narrow hips in relation to my belly, so I still feel kinda awkward??? I feel like I look like a circle with stick legs. Lmao. If I was more comfortable with my body, I'd wear tighter shirts and/or crop tops, as opposed to the looser/baggier shirts I wear normally.", "delarosa42": "Crop top...I really want to wear one and feel comfortable wearing it! 🙄", "luellaarbre": "I'm cool with it in everything but jeans ? Tight dresses and stuff are cool or underwear or even naked.. but feeling comfortable in jeans still eludes me haha. 😂😭 Love seeing other people in theirs though", "fromsarahlex": "I absolutely love this pic and that tee 😍", "alysonmcc": "Also your belly is great❤️", "the_girl_who_screamed_wolf": "THIS IS STILL MY BIGGEST HURDLE. I seriously struggle with my VBO. Why? Cause I've been conditioned to, yes. But also like you said, when I was younger in particular, it was like if I could cover that one thing, I could pretend that I wasn't (and that everyone around wouldn't think I was) fat. HANNAH, EVERYONE KNOWS YOUR FAT 😂", "jilleatsapples": "Amen! I’m rocking a VBO rn 😏", "tealypooh": "YOURE SO CUTE OMG @fatgirlflow", "adamsel_in_this_dress": "I’m so over caring about it! I’m fine showing it off.", "chloeleeanncoppin": "I'd wear tshirt & jeans for sure ❤️ I currently stick to tummy tuck leggings and tunic tops to hide my belly ☹️", "katiej_mua": "I would try more form fitting dresses. I feel like everything I wear right now is oversized.", "urethrafranklins": "You are seriously such a fucking icon. You’re such a beautiful human being. And I definitely look up to you. ❤️", "juliegazuli": "Thank you for this reminder.... I struggle with the whole 'muffin top' thing (although I'm more like a '3 tier wedding cake top' lol). But I'm working on being neutral about it!", "chagh_pasand": "big like", "redwitch84": "More body tight dresses and skirts.", "sayshesclassy": "I would wear dresses like bodycon I think", "simoneregina_": "Also HOW DO YOU LOOK THIS CUTE IN A LAUNDROMAT?!?!😍", "rebeccakaufman8700": "I 100% am currently trying so hard to allow myself to wear high waist jeans with a “shortish” shirt without wearing a long undershirt to hide my lower belly....I have a 2 roll belly, so a crease at belly button and roll over and under....it’s tough not wanting to hide both those things.....", "dazedglonutt": "For a long time I was terrified of my visible belly outline. I always wore baggy clothes to cover it until now. I mean, I'm still insecure sometimes, but for the most part I'm just like, \"no one gets to choose what I wear for me. I'll wear whatever I want, regardless.\" One thing I wanna try is form fitting dresses. One of my biggest fears. (Also, side note. My mom and I love your posts and your realness. Thank you for being you. ♥️)"}