{"centurycity1": "You are living in a fantasy world. You look slovenly and morbidly obese to normal people.", "ruhr_pott08": "😂😂", "vahidhoseini13951367": "❤️❤️❤️❤️❤️❤️😘😘😘", "am_it9159": "Awesome", "sexybrilliant_devinakaur": "#SexyBrilliant 💗", "davidfitzpatrick99": "Amazing woman", "j_analog_koldmath_music": "🔥🔥🔥", "clingankesha": "Love the dress and boots as well", "kmiannaeem": "Beauty 🌹", "klvaughan_11": "Accepting being fat which is something that can be controlled is ludicrous. Travel the GLOBE - you will not see women like this anywhere. Share some of those calories with the rest of the world!!", "evan.malott": "Ewwwwwww yuck", "r_o_c_k_y_x.z": "Wonderfull💕💕💕", "fatgamer3": "Poor little dress 😢", "jamesesarl": "Disgusting fuck", "jacobbamidele2019": "Absolutely beautiful", "aidanduggan_": "@davemrussell7 I know how u like dem", "aisatsana444": "Fat", "deanjacobson_": "Why anyone would be proud of a chronic health disease escapes me. You don’t see people parading their heart disease around, so why should it be any different from obesity?", "young.meat": "Eat a salad", "ivonice_braz": "Linda", "sueperb7076": "Love the outfit", "katiecloydblog": "@kayla_nichole90 could I be more obsessed?! She’s the beeeeessssstttttt.", "aussieloverofleather": "Love the boot colour", "christi_g5": "You’re so beautiful ❤️❤️", "geogeskounga": "Un bon weekend au Cameroun à mes frais", "_vampyrix_": "You rock this dress and you’re absolutely beautiful. 💕", "qcxz9oy5": "Omg NICE YOUR ASS 👅", "wladidgenas": "#vladidzhenas", "molly.mayhemm": "This is 🙌super cute. Love the colors.", "carloajunan_": "@kayleighnicolek", "zustermel": "@carooostende leuke jurk weer", "ottun_aj": "baby u are beautiful", "e_ma_zing": "Where are your boots from?", "centsofstyle": "Looking like a queen 😍", "lawrence.jones.520125": "I just wanna love on you forever!", "paul_gwen": "Have just started following you , I’m a 58 year old woman who’s been overweight my whole life and worried what others think about me , my god I wish I had been more like you .", "alisezgin359": "Sen nasıl bir afet sin güzellik🔥🔥🔥🔥😍😍😍", "the_healthier_curvy_gal": "Adore this look 😍", "genzo679": "😍😍😍😍", "kabaoriguinal": "Like❤️❤️", "duisenbaevshaimerden": "👍", "kenedxman": "Beautiful", "drajidarajino": "❤️😍🙌❤️", "missblisswow": "You are gorgeous!! Every time a pic of you comes up I smile!!! I am trying to love me as I am but so hard. You are a great inspiration 💕", "kingsammysilver": "😍😍😍😍 You look incredible!", "nycsubway1904": "You look sweet cute andbsecy❤️❤️❤️❤️😍😍😍", "solar_ari": "Gorgeous 💕", "vishouswrath": "Best thing I've ever seeeeeen~", "leneeslash": "Only girls commenting lol god damn why is this in fitness?", "schreckwalter": "BEAUTIFAT❤️‼️", "plussizeteranaeloveshauls": "Beautiful", "subtlefeeder": "Nothing wrong with that angle.....if you got it, flaunt it", "blackjones20": "Queen😍", "be.hush": "Your gut touches yours knees....👏", "thewandering.unicorn": "Thanks for this beautiful and powerful post. On my journey to body acceptance learning to love my #fatfromtheside has been the hardest. Love this gorgeous pic and your positive posts 💜", "abigailsavannah": "Goals on goals on goals on goals on goalsssssss", "anjeanette.carter": "O. M. G!! This ensemble is gorgeous! Especially on you!!", "iowaqtpi1": "I loooooooove this pic!!! Your so happy and the dress is adorable!!! Oh my gosh so stinkin cute!!!", "shauna.pigeon": "New IGzine! Follow and like @bodycontentmag", "lisakennymusic": "That dress 😍 those boots 😍 SLAY 🔥", "artan_music_orginal": "عمویی چن تنی😂😂", "bhappy247": "You look happy & beautiful love this pic! 😊❤️", "menge_belaynesh": "Big sacks", "qimzel": "It's my most feared angle! Still a long way to go to love it, but working on it ☺️ you look absolutely stunning! 😍", "kris10dz": "😍", "dmw8718": "هاي شايله خمسه ابكدي", "wesssan": "U'r amazing!! I wish u lived in Sweden so we could be friends and spread some good wibes together 🙌🌟. I have some fat friends but they dislike their body and wish it to be different... I just wish I had people around me with lots of fat on their body and just loving it. Or atlest accepting it. That would make my road to embrace my body easier. U know what I mean?! 😗", "esma.turan.12935": "❤️❤️❤️🔥🔥🔥🔥🔥🔥", "raja_m_umair": "@changyzkhan dakh lo apna future😂", "daphny_kylie": "I love your captions ,and your whole vibe ,hope to reach that level of confidence", "towfab": "😍😍😍🤔", "hjwdewit": "Wow, so lovely this picture", "mirandafaithbuis": "@kim.606.bell I want to feel like this. :(", "imaliteraljoy": "You're gorgeous 😍", "strawberryeliza": "Ugh teach me how to love myself like you do", "analog.teague": "🙌🏾🙌🏾🙌🏾", "the.trash.blog": "Slay sis that pattern looks so good on you🙌🙌🙌", "brianna_lea86": "I love the hashtag #glorifyingobesity!! Own it! :)", "stephawilson1": "I struggle to find boots that fit over my calf. Suggestions?", "brittanykuss98": "question! have you ever bought jeans from old navy? if so are they true to size? i’m a 26 at torrid so just wondering if you could help at all", "vwwtiturui": "Es linda sexy", "ladypoots": "OMG I love that dress so much", "mcdowell66666": "I have such a crush on her it’s crazy, lol", "justinekay88": "Slayyy all the angles!!🔥🙌🏼", "eat_a_mango_bitch": "this dress !!!!!!!! so good 😭", "zaenal230381": "Nice", "cannoeldice": "Thank you!", "chumblybum": "I think you're honestly one of the most beautiful people in the world. 😍", "mrsjc_2u": "@fatgirlflow,😍😍😍 your boots are life!", "georgecostanzassister": "🔥🔥🔥", "kar_del30": "@fatgirlflow - this....everything about this....the words, the positivity, the smile on your face, the hair, the dress, the angle....everything is absolute perfection. ❤️", "13.kali.love13": "Gorgeous", "mustangsallytwo": "Yesss girl!!! I want this dress so bad, you look amazing!! Can I ask what size you got?", "rhondastarks": "Beautiful dress and boots combo! Love this...gorgeous you!", "_its_rachel_schulz_": "Beautiful ❤️❤️😍", "alli.paige15": "@fatgirlflow i wish i had just a fraction of your beautiful confidence 💕", "deaad01": "This post is EVERYTHING! Thank you for helping me grow a little closer to loving me in the body I have. 😍", "siddharth_3405": "Moti", "wolfwiththegrayeyes": "Ooo I needed to read this. It is so hard being non binary and fat. They expect me to be this lithe androgynous thing. And I am just not. I am fat. I am fat and lovely and wonderfully weird and I like it that way.", "tissell1979": "Where did u get those boots????", "truth9983db": "@fatgirlflow just wondering how you deal with health issues? I love you and love your message but I just can't feel sexy when I'm constantly sweating from being fat, I'm out of breath and I have chafing...how do you feel sexy despite all that?", "sincerelykatex": "For all of those comments saying “glorifying obesity” - Just because someone is over weight doesn’t mean we cannot practice self love. It does not mean we have to hate our bodies. It doesn’t mean our bodies are not beautiful. ALL bodies of ALL sizes are beautiful. Let’s lift each other up instead of putting others down bc someone is different.", "invadeherkim": "Where'd you get the boots? Big calf boots are impossible to find", "melanie.username": "Checklist for today: Glorify Obesity. Check!!!", "sweetsher27": "Absolutely fantastically gorgeous🌿🦋🌸#LOVEITALL", "sarahjean0717": "That dress!! 🔥🔥🔥🔥😍", "feefers25": "HI thank you for the teary eyes from this. I love this. I feel myself getting to this after so many years of feeling the opposite. 💖 It's so BEAUTIFUL and I love our bodies! I love that you're gorgeous and you FEEL it, too! I feel like there is so so so much strength in us realizing how powerful and lovely and sexy these big soft bodies are. No one can stop us once we realize how fucking HOT we are! 😁🤣", "lindahortytorty_1": "Live the dress you look great", "bria.summer": "Always and forever my favourite content creator. Thank you for everything you do and all the ways you inspire me.", "inscrutably_ll": "@vanetian_besos", "alex_pettyfyer": "I absolutely love this picture", "fabrizio_pimentel": "It’s so pretty 😍😍😍", "wilburandnizzamyhre": "Plus the hair. And the smile. You always exude not just confidence but happiness. Making me know that both are achievable.", "nicolekr1": "You look gorgeous and that caption was exactly what I needed to see today. ❤️ I appreciate you and your posts so much", "nadiabokody\nVerified": "Verified", "trashmastercake": "💓", "jose.miguel.rojas": "Mami...😘😘😘", "glamghoul": "Gorgeous babe 💕", "curvystreets": "Gorgeous 😍😍😍", "kendra_pi": "an actual masterpiece. wow.", "vanpaulin922": "THIS IS EXACTLY WHAT I NEEDED TO READ TODAY! Thank you!", "a.grutta": "Oh my God!!!!!😥😥", "blcoledavis": "I looove this dress! 😍", "tvancort": "This is so beautiful I don't even know where to start. ❤️❤️", "bopomatic": "I love this", "boldbutterfly8": "I love that dress...you are wearing it..its not wearing you #sexy💜👑💜", "leave_me_alone_pizza": "This dress is so cute!", "twan_who": "🤷🏽‍♂️", "tararaekuyper": "Ample Glory 💥boom that's a brand waiting to happen!", "lanarosesh": "Where did you get the boots♥️", "alexisinbklyn": "You inspire me to be my fucking self unapologetically in all forms.", "elismar.silva.5015": "🎉🎉🤗😉🥂🍾😋", "lizhartjames": "😍😍😍😍😍😍😍💯💯💯💯💯💯💯", "jacquiee_ohh": "Beautiful✨💞", "mlanderson41": "Those boots though! I love them and so enjoy your posts.", "grandmasterspook": "My new goal is to be able to write this about myself and KNOW it 💕💕 looove your power", "softbodytendermind": "You are making those stripes look AMAZING", "sophisticatedcurves": "Beautiful!!💖😍", "nixoooooon": "I LOVE YOU thank you for making being fat and taking up space easier", "daisyalea_flower": "Omg I love this whole outfit!!!! Gorgeous!", "vientosbabe": "@fatgirlflow where did you get those fabulous boots?", "itsshannongrace": "Ooohhhh this dress is sooo cute! Gimme!!", "mandastewart_": "You are my favourite person, I love reading your posts ❤️ you inspire me to love myself unconditionally, and you have brought me so much hope 💕", "torreshunny": "🔥🔥🙏🙏🙏Yasssss bishhhhh", "joeyjo422": "I love this pic! Can you do a QandA on YouTube? If so, I have a Q!", "fantsypantsanna": "Im dying at #GlorifyingObesity 🙌🏼🙌🏼🙌🏼", "adamsel_in_this_dress": "You are stunning! Love this.", "bluegraygreen17": "This is such a cute dress! And yay for being able to love ourselves from all angles!", "yumaratz": "You are gorgeous, and I'm loving that dress and boots outfit.", "anfrasier18": "ugh queeen!!!", "comfyfattravels": "I love love love your ample glory", "trans_fat_alchemy": "Can you get any more gorgeous??! 😍😍", "yungfreezy": "🔥", "tlbbrooklyn": "That dress! 😍😍😍", "frederic_razananirina": "💋🌹😘", "scoantares21": "This pic is hypnotic", "ikneadu2018": "😍🔥🔥", "janice7458": "I think you look great. Nice dress.", "fdurands": "Me encanta tu cuerpo", "daleyspring": "🙌🙌🙌", "curlyhairedshordi": "love this combo! gorgeous!", "elise_tupper": "@laadyofthelake 🔥goals", "no_victoria_no": "Serving looks in this outfit and looking gorgeous at any angle as always ❤️", "sassynachnicole": "Girlllllll 😍", "brandoncoyas": "Hi babe", "erin4thenguyen": "Can you share boot deets? 👀❤️", "sumajanedark\nVerified": "Verified", "etlifereview": "You look absolutely stunning! Thought I saw your S/O in town the other day, but I was mistaken. Would love to meet you two!", "sassymissmaddi": "@lizzobeeating self proclaimed “bad fatty” who is extremely knowledgeable about the body positive and fat positive movement and all of the controversy surrounding good fatty and bad fatty", "maryharpermoore": "This is what I need to hear 💖💖💖you look amazing and I cannot say it enough I am the shape I want to be and I have always ashamed to be myself until recently but man, I am really finding awesome women! That dress looks stunning on you too!!!", "q_strom_99_walker": "Sexy", "chubbychula89": "Cute ass fucking outfit. I loove it", "katiej_mua": "I LOVE those boots🖤🖤🖤🔥🔥", "jonas__bodin": "😃👍", "yamalo17": "I love this dress on you 😍😍😍😍!! And I use to feel the same now I’m like damn I look good 🤣🤣🔥🔥", "llh_526": "I just love your posts. I look forward to them. You are a beautiful beacon of light❤️❤️", "metallicleoraa": "Really nice pic!❤️", "gem2324": "😍👏👍", "velvet.curls": "All angles are good angles.", "mommagoose09": "That dress is magical in you.🎆", "hayley_bailey_kipper": "Why are you so wonderful 😭😭💞💞", "jakob501": "🔥🔥🔥", "cassidiaah": "Sexy as fuck!!!!! we Stan a confident queen living life unapologetically! Beautiful🖤✨", "destinedbydesign": "Stunning!", "selflovefinder": "Love!!!! 💛", "matthew.winston": "Very beautiful and sexy 🌹", "northwoodsamy": "I was having a rough self esteem day but seeing this picture and you owning and rocking how stunning you are is so healing. Thank you for putting yourself out there ❤️", "thriftyfatty": "I swear you always come through with the captions right when I need them", "ray_and_company": "Yes yes yes! Thank you for sharing this, just what I needed today. And you look so cute in this dress!", "breebee77": "I love this sentiment! And this dress! I need it!", "emily.kei": "✨", "reh_2021": "I wish we had beautiful affordable plus size clothes I'm the UK xxxx you look beautiful in this lady xx", "fanny_bunny_honey": "You Look great 😊 and we can see that you feel sexy and you are. I wish I could think the same about me ! I feel always better when I’m reading a post of you like 😍 thank you !", "amberdoylelowe": "❤️ those boots", "liverne_the_brittany": "Ooh!!! That dress on you, love it!!!"}