{"ptrsn_given": "😍", "purasvida1978": "😍😍😍😍😘😘😘💖", "cforchrist": "You are amazing no matter what ! Humans are so much more than bodies and faces ! Society is wrong, don’t allow them to dim your light. When these bodies waste away, that beautiful spirit will still shine 💖", "klvaughan_11": "😢😢😢😢😢. Put down the fork and you will see what happens. Share some of those calories with the rest of the world!", "ali.m3363m": "👌👌👌👌🎉🎉", "nikolay_sineshekov": "😨", "elicates": "I threw up a little in my mouth. Total degeneracy.", "p.linkola": "So you imply the possibility that obese people might reclaim the term “obesity”. In the same way that queers have reclaimed the term “queer” and black people have reclaimed “colored people” (adjusting it to “people of color”). To that I would ask, have you ever been diagnosed with Narcissistic Personality Disorder? Because how else can you be such a fucking arrogant asshole. While you’re at it how about reclaiming the phrases “type 2 diabetes,” “cancer,” and “excessive body odor.”", "sbah43235": "❤️", "leah_tude": "I guess a \"pc\" way of telling someone to fucking disappear off the face of the Earth.. fuck that", "rolandoriveraresto": "Beauriful you good look 😘😍🌹 Prince", "bylj.fashion": "🌹", "solassystem": "Basically people trying to tell fat people to hide ...? How dumb ...is being yourself and just having a social media account with photos of yourself on it somehow glorifying obesity?! Makes no sense. You’re allowed to exist and be happy about it and celebrate yourself geez", "hannah.liter": "@anni.srin", "jikabom": "Look dm plz", "aziz.zraika": "Super sexy lady and body I love y bbw", "midgy30": "@fatgirlflow where did you get those boots!!", "laurencutrone": "I am obsessed with this entire outfit. You are phenomenal!", "babyruth728": "It’s the same as when I hear ‘all lives matter’ or ‘fake news’ I tune it out because I know there’s never anything important coming next. It’s just bias.", "softbodytendermind": "Glorifying obesity to me at its simplest is making fat look goodwhich is threatening and scary to people invested in systems of power, so they sling it like an insult", "yrneighborhoodtaurus": "YOU'RE AMAZING AND THIS IS A LOOK", "le_ballvini": "This dress is 🔥💞👌🏼", "linsue72": "Let those people sound like Charlie Brown's teacher to you-in one ear and oit the other!!! Just keep being beautiful and doing you girl💗", "whitneybadjones": "It’s a narrative we’ve been taught to hone in on and keep us dismissed and marginalized", "strong_in_the_broken_places": "I ❤❤❤ this dress on you, but I would be terrified to wear it. I wish that wasnt so. I would love to rock that!", "11_usagi": "Huh that's a really interesting question. The word fat or curvy, thick, plump, etc etc I'm happy with. I love. I actually enjoy being called them. It's like claiming what I am and they make me feel sexy or cute etc. But I've always took it as a negative to say \"glorifying obesity\". I think just because I've always heard it in a negative way, where fat has changed in some sense that phrase I've never seen used outside a negative context. So it's actually really nice to ask myself why that is. I think for me obesity itself is a medical term. So while the word obese or obesity never bothered me they felt very medical and dehumanising. The same as if a doctor used only medical terms when discussing something compared to saying it in plain English, I'd feel like a number. So obese makes me feel like a statistic. Whereas fat feels emotional, warm, comforting, sexy.", "ambrosiaminge": "I suspect this is the same person who left a post-it on my windshield that said ‘All lives matter’ in response to my ‘Black Lives Matter’ placard. 👏🏼They👏🏼just👏🏼don’t👏🏼get👏🏼it👏🏼", "victoria_instas": "Glorifying obesity is the daring act of being larger than society wishes without an eating disorder, shame, or constant attempted capitulation to beauty standards. In other words, you must hate yourself or be thin at all costs, and glorifying obesity rejects that dichotomy. I’m happy to see people claim labels or terms that feel right to them. 🙌🏻💓", "miss_steak": "Ohhhh! So pretty! 😍", "chanie456": "That dress tho! #slay 👌🏾", "lawrence.jones.520125": "I just wanna hug you right now!", "catvandever": "I think glorifying obesity is when you dont acknowledge the comorbidities that can coexist with being obese. I was happy and fat at 380lbs. Seriously happy but my health was declining. So I lost 100lbs and feel so much better. And am still fat lol. But you at some point have to admit it isnt all cake and sprinkles and other shit exist.", "siddharth_3405": "Moti", "leezycurves": "You look insanely sexy in this dress I absolutely love it wish I had your confidence please don't stop xx", "26kleisen": "This dress looks awesome on you!", "kfle5gma": "Wowwww sweet women", "vintageortacky": "Love that dress!!", "elismar.silva.5015": "😋😋🌶️👅", "jamespottersinvisibilitycloak": "@isabellaschp i'm really really sorry you feel that way, but people judging you is not on you, it's on them & a society that profits from & encourages fat hate & body insecurity.", "lauraspeeckaert": "Those shoes too❤️❤️❤️❤️❤️", "nat.tat.tatalie": "What they really mean is, they don't want us taking up space in exactly the same way they do, and being comfortable and confident in our bodies in exactly the samd way they do.", "prosevillarreal": "Ok take 2. lol I didn't realize you can't make paragraphs on Twitter. 1. You look fabulous in that dress. 2. I don't like the term glorifying obesity because it just shows the flaws in how society views women. The term was created as a way to diminish fat women who are part of the body positive movement. No other branch of the body positive movement is attacked like the \"fat women\" section. A thin woman, taking about how she is struggling with the negative views on her real or perceived flaws, and working towards body positivity is applauded. A fat woman finally achieves her goal of being on the cover of a magazine is attacked and labeled as glorifying obesity. Why? Because there can not be anything loveable about fat women, according to our society. I also don't believe in the reclaiming of words, regardless of what derogatory term it is. Reusing the word, is one individual saying they accept the word and that the word can no longer hurt them. But it continues to be damaging to millions of other individuals who haven't found such acceptance. It also fails to prove a point to those who use it negatively, because their brain will never comprehend that the words are used in anything but a negative manner. Furthermore, by trying to reclaim, glorifying obesity, you (general you) keep that term circulating in the vocabulary of society. And it spreads from one person, town, generation to the next. Continuing the cycle of this hurtful and hateful term. I'd rather people say,. The negative use of glorifying obesity, can no longer hurt me because I have come to love and find glory in who I am. (You, we, they, them, are used to mean a general group of people. And are not used to direct my comments at any individual).", "mrsangiebabe": "I think you look great..fck them", "schreckwalter": "Beautiful and sexy with a tempting fat belly‼️❤️", "ikneadu2018": "😍", "_depaysement___": "😂😂 you say you don't need validation but the moment someone disagrees with you, you block them lol Rational debate isn't for you if you're gonna ask for people's opinion and then block them", "hanna_corinne": "👏💛💛💛", "mostly10": "to me, it seems that it's always used to blame fat people for being anything other than miserable about being fat. unless a fat person is posting about losing weight (not even about health - solely about weight loss), then they're trying to convince others to become, or stay, fat. no one says a peep about thin people \"glorifying unhealth\" when they post pictures of eating unhealthy foods, or being inactive, or smoking, or drinking, etc. but gods forbid a fat person is smiling. 🙄🙄🙄", "juliaxlewis": "🔥🔥🔥🔥💥", "vwwtiturui": "👏👏👏👏👏👏🔥🔥😍😍😍", "pacificmidnorthwesterner": "The “o” word still feels so marginalizing to me that I can’t even reclaim it. But I’m so thrilled that you and others are. After all, I was so pissed when I read about women calling themselves “fat” in Bust magazine 15 years ago. It took me almost a decade of immersing myself in fat positivity before I could call myself fat without feeling my whole body flush with shame. Now IDGAF, I’m fat and that’s fine! For now, “glorifying obesity” makes me think of Gwyneth Paltrow or Oprah profiting off body hatred or teenage boys and Susan’s and Karen’s on social media getting really mad I’m stealing all their healthcare 🙄 It makes me feel 🤬.", "tumtum18": "The assumption in this phrase is that no one would want to glorify fatness, hence the medical language of obesity to make it sound like we are celebrating something “unhealthy” as opposed to just delighting in our body diversity. So much is problematic about the assumptions here 1) fat = unhealthy 2) unheaLthy does not deserve glory. I try to glorify my chronically ill disabled fat body as much as possible!", "esma.turan.12935": "❤️❤️🔥🔥🔥", "anna_de_rosbourg": "Honestly, I don't think that's a thing that really exists most of the time. The people who use it usually mean \"I think you're ugly, I hate fat people and I don't want you to be happy in your body because I need confirmation of my disgust\". Coming from women, it also often means \"You represent what I've been conditioned to hate, steer away from and torture myself not to be. If you can feel beautiful and confident in a body you should hate, then all my efforts, all my torture and starvation are vain and meaningless and then therefore so is my life. So I will bully you and hope you fall back into line and hate yourself and feel ashamed to exist like a good fatty should.\" The only times I can think of the term actually meaning what it says is when it comes to people fetishising obesity. But, unless they're actual feeders and feedees, these people do very little harm. They just love fat, who cares? (Caveat: they can fetishise fatness as much as they want, almost everybody has fetishes, as long as they don't reduce the object of their desire to just that: an object. As long as they see the person and treat them as such, no harm done. It's the objectification that comes with fetishisation that is a problem.)", "alwomyn": "FLAWLESS", "katiedeluxebbw": "Interested in answers! ❤️", "sapphrican": "i think ppl essentially mean \"normalizing fatness\" when they say it, but obviously they don't mean it in an empowering way. it's a phrase that automatically makes me roll my eyes because i know ppl mean it in a \"being fat is sloppy, gluttonous, and disgusting and you should be ashamed for supporting anyone who would condone such a lifestyle\" type way which is bullshit.", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kiskmw": "Simply gorgeous!!!!", "ladyt_au": "It firstly means, to me, that they either don't know what it is like to be fat in this world or hold shame for having been fat. After that it demonstrates that they equate fat to worth or an imagined moral standard and we should stay in our lane. 'How dare you be happy/successful/sexy when everyone knows fat people are lazy/undeserving of love/disgusting.'", "treegz": "Yasss this outfit 🔥", "thecosycottageinn": "A fat person bucking the body currency and using their own form of tender! ☺❤", "timmywiththebluedresson": "You know, I never thought about it too much at first. It always sort of bothered me in a bad-faith-argument kind of way. But as of think about it more, it seems it's always used to further the perception that fat = worst thing ever, and it us always from the \"nice people\" who are \"just concerned for your health!\" and I have less and less patience for it. The argument that the agenda to glorify obesity exists implies that people are making fat \"cool\" in such a way that other people will wish to emulate it and/or not feel the need to \"better\" themselves by losing weight, and, across the board, that just feels a lot like an \"undeserving poor\" narrative - a way to force perception that some people - born of human flesh and minds - are inherently not human.", "leahrosss": "I think it’s usually used when someone is pretending to care about fat people...as if they personally care about our “health”. The bottom line is that they’re passing judgment and hiding it as a concern, meanwhile they truly couldn’t care any less about fat people they just hate to see fat people happy.", "christinaamughan": "Looks way more flattering on u than the online store model😅 I had to double check cuse I was like no that's not the same dress .... u definitely wear it better😏❤️", "fujowkid": "Gorgeous", "janeemoonlight": "I'm not sure how I feel about it 🤔 on one point if someone thinks I'm glorifying obesity by me being productive of my body then that's wrong. From a medical stand point or health stand point I don't think glorifying anything unhealthy or to depardize ones health is healthy, but then it depends on whose talking, it's a tough one. I'm on a self love journey to be the best me mentally and to me that is most important. I do think obesity is a term loosey used by doctors to describe anyone over 120lbs and 5'3 is bullshit. Or it's about being healthy inside or do the best we can, regardless of what our outside looks like. And 🖕diet culture", "alannalikebanana": "I think for me when I first heard it (saw it in text form) I got hung up on the word obesity as well. I think the world pushes us to be afraid of being “fat” as if you are less of a person because of it. People have compassion for other lifestyles, why are we still fat shaming? Additionally, when I heard the term, the part of me that has narrow mindedness (implemented by years of the “industry” and society) kind of cringed. I immediately went to self care in regards to medical health and joints, diabetes, etc. HOWEVER, being OPEN minded and truly understanding what it *actually* means and how the term is being used, helped me understand its WAYYYY beyond that. Its not promoting carelessness its promoting mindfulness to actively love yourself regardless...thats what I got out of it anyway 😊Also, I truly admire the gusto it takes to be so comfortable with ones self. I struggle with it every single day!", "lorribell1964": "So cute", "chelseyleighwhite": "People who say fat people are \"glorifying obesity\" are the same ones who say that \"racism isnt a problem\" or \"people lie about sexual assault\". Its all cogs in the machine of white supremacy to keep certain groups marginalized", "ms_foss": "@fatgirlflow Love this! Where do you recommend shopping for coats and lightweight jackets?", "withasliceofjess": "I've come a long way with this language. I used to believe it was used by the medical community because of all the \"risk factors\" that come with being overweight. Isn't that what we have always been told? But I've never once heard a medical professional use this term and more often hear it used by folks scared of fatness(their own or others). I appreciate your efforts to take back this term and make it loving. When all fat people are unhealthy and dropping dead at 30, they can have it back. Until then.... let's all evolve.❤️", "tanilovesyou": "I think it is so crazy. People being happy doesn't mean they are promoting an unhealthy way of living. When very thin models post pictures of themselves are they glorifying anorexia or bulimia? When white people take pictures of themselves are they glorifying white skin? If someone with self harm scars takes a picture of themselves are they glorifying self harm? Of course not. We can be happy with ourselves and that's all there is too it. We're not promoting any kind of lifestyle or choices, just posting a picture we're happy with and there is absolutely nothing wrong with that.", "ravenclaw.cris": "I love the term. I think it’s hilarious. It’s not like fat people, like myself, are forcing food down others’ throats in an attempt to make them fat as well. If living my life like any other human being means I’m glorifying obesity..... Then goddamn it... I’m glorifying obesity. Lol", "sincerely_rad": "1. I love your dress 2. When someone says “you’re glorifying obesity” it means they noticed that you, who they think is obese, you exist, and you’re not expressing shame and dismay about said obesity. So, just existing", "roguetriesherbest": "“Because I like looking at myself” ☝🏼THIS It’s basically this. When someone who’s obese likes looking at themselves and puts that before what ANYONE else thinks, it’s called “glorifying obesity.” It’s when someone looks back and says, “but I like me, I don’t want to change” that you get the “LE GASP” At this point I’m kind of like, call it what you will, I’m calling it me being happy. And if my body changes over time? I’ll still be happy, because I like me right now, and I want to continue liking me “right now”.", "elizabethpaintshernails": "My hubby and I spoke about this exact idea at breakfast this morning. When trolls see fat people being happy and loving themselves, it makes them batshit crazy angry. How dare we love ourselves and our bodies, they think we should be ashamed. And when they wrap it up with, \"fake concern for our health?\" Oh hell to the no!"}