{"freekinstacy": "I LOVE nipples, can I suck yours?", "radhe4964": "Nice tattoo design🔥🔥", "salahpanika": "Best tattoo", "hamdi1465": "Tattoo nice😳😘👏👏", "dumas1992": "I love your ink work! It’s so amazing plus you are such of gorgeous sexy woman, with all do respect ✊ ok ❤️😍💜🙏🏽", "glennelridge": "Sexy 💋❤👏🔥💯💞", "aeisa2010": "To kiss all day and beautiful lady 😉😍", "ouraganfab": "💗", "domenicodalterio_": "Sexy..❤️🙈", "madaridhafid": "toop de forme jadore cette forme toop ❤️❤️❤️❤️❤️❤️❤️❤️👏👏👏👏👏👏👏👏", "paolodamiani4753": "Wow", "muhseger": "Lovely big boobs", "alma.ghanimati555": "خانم گاو", "mamamurch": "That hearted \"me\" tattoo. I love that.", "hica0018g": "Te quiero comer", "dehganmusic": "Okkket beautufulll sexy wwooowww sezy Eat your boobs oohh 😍😍😍😍😍😍😍👍👍👍👍👍🔥🔥🔥🔥", "majid.khan1989": "😍😍", "jerseypearl94": "You are so gorgeous!! Also love your tattoos!!", "sergeyvolgogradmoskva": "Буэээ", "harleneveotte": "You are very beautiful and such an inspiration, thank you ❤️", "bbwlovr2018": "So hot! 😍", "lily.mii_": "Cute photo 😍", "mehboob_rehman255": "Beauty", "malikafeyan792018": "Very lovely white body angel💋💋💋", "saber____n": "😋😋😋😘", "my.rh1832": "لا تضيعوا الفرصه واخسروا من وزنكم 💥 اليكم. ..اقوي منتج تخسيس في العالم والشرق الاوسط والحاصل على اكبر نسبة مبيعات في السنوات الاخيره 💥💥 كلين ٩ ،،،مجموعه التخلص من الكرش ،،،،مجموعه تنحيف مصغره💥💥 🌟تنظيف كامل للجهاز الهضمي 🌟التخلص من مشاكل القولون المزعجة 🌟تنظيف الجسم من السموم مما يساعد على تجدد نشاط الجسم 🌟تنظيف الجسم من السموم مما يساعد على إشراق البشرة ونضارتها. 🌟تخلص الجسم من السوائل المحتبسة في الجسم 🌟راحة .. خفة .. نشاط .. مع كورس متكامل يحافظ على بشرتك من الترهل بعد فقدان الوزن بل يبقيها نضره وناعمه وذلك بفضل مكونات تعمل على بناء عضلات رقيقه تحت الجلد تعمل على شد الجلد والحفاظ على رونقه منتج طبيعي وكل مكوناته طبيعيه ١٠٠٪ وليس له اي اثار جانبيه ✅ للاستفسار مراسلة على الخاص #ملاحظه توجد خدمه توصيل لجميع محافظات العراق والمملكة العربية السعودية وباقي الدول😍😍😊😊👇👇للطلب وتس https://api.whatsapp.com/send?phone=966572909527 #عمليات تكميم #بنات ﺯﻫﺮﺓ ﺍﻟﺨﻠﻴﺞ زهرة الخليج#جروب جده #جروبات الرياض", "jasminboeh": "https://youtu.be/1QCJsbf8bRw", "kingraph58": "❤️❤️❤️", "gianmarcocardillo_official": "💪", "inay3211": "Merhaba bayanlar ismim Mustafa izmirden 48 yasındayım jigolo arayan bayanlar ekleyin tanısalım WhatsApp var +90544 493 6196", "jeyko_valenci": "@alejandro_valenci", "shiyas_hamid_": "😍😍", "saud11109": "#sxsw", "hectoralba2227": "Estás Rosas nesecitan un jardinero", "saraaaelizabethh": "You are stunning!!!!’ 😍😍😍", "samirsamir8077": "❤️😍🔥🔥🔥🔥", "dannyboggess1951": "Yummy yummy", "crazy_car_fan": "I'm not in to tattoos but you have such a beautiful body I could look at them all day!! You are really Cute and deliciously sexy. Xx", "thewhatifprojectprogram": "I LOVE THAT I GET TO SERVE PEOPLE WHO ARE DOING EXACTLY THIS - LIVING THEIR BEST LIFE!! I LOVE & ALL HUMANS DESERVE TRUE SELF LOVE & EMPOWERMENT!!!Explodes my heart 💓 Are you on Instagram? Who wants some more sharers & carers? (Read steps Below)  1- follow me here: @claudinejaneismyname 2- post YOUR own handle/ insta username below for others to follow you 3- follow a minimum of TWO other people and reply to their comment DONE once followed  Happy Following, Sharing & Caring😊🤩❤️ #lotus #health #happiness #harmony #home #humour #habitat #heart #honour #humility #honesty #hope #hullabaloo #empower #empowerment #sharingiscaring #empoweredwomenempowerwomen #empowered #selflove #growth #confidence #mindset #bossbabe #journalling #selflove #choosekind #bekind #selfcare #yoga #namaste #freedomisnofear 💕🙏♥️🙌", "ramos__444": "👍👍👍", "220.380": "🐄", "royalhemanthb": "Lovely", "king_watt": "Kingwattclothing.com", "llrqy2126": "🔥🔥🔥🔥🔥🔥🔥🔥", "cockneycook": "I covered in them they express a person, be proud of yourself and your body, it's not what other people see you as ,it's knowing who you are I think you look cute a smile and frighten people,don't stop being happy with yourself, it's a strength negative people will understand, London luv xx🔥🔥🔥🔥", "jd.holloway.58": "😋 amazing", "nataliaovdina": "You are incredible 🌷", "heidi_3008": "@corentin_nclet tu voulais t’abonner j’ai retrouvé son compte", "gilbertosilva1968": "Gostosa bom dia linda", "juanterrenoshermosilla73": "❤️❤️🤩❤️❤️", "keirsgirl13": "@amberbradshaw92 the first one 😍", "dibyendudubey": "Excellent", "kenosbest": "Looking at that pose my day just got better! 🔥", "semt_cukur3": "😍", "starscrem86": "Me encantó esa foto.Sos muy linda 🙌", "vwwtiturui": "🎊🎊😍😍😍😍😍😍😍", "purasvida1978": "Sexy anor😍😍🔥🔥🔥🔥💖", "ayaelmahdy": "❤️", "zeynep_bzkrttt": "Gt", "omiritus": "Uff.. i like u and ur tattoos ❤️❤️😍😍", "rudicarter90": "Adore the stomach one @fatgirlflow I’ve been thinking I shouldn’t because I’m nowhere near flat there but yours looks amazing so maybe I should just go for it!", "lecurveactivewear": "I love your tattoo, super sexy!", "smarterthanyouraveragesprinkle": "I few years ago I decided to go meet my (now former) boss at a parlor across town to see the process.... on the way there I got rear ended in a traffic jam. Needless to say I'm still tattoo less but may get one eventually. Thank you for explaining the process in your video.", "niccc716": "🤔why", "mardobb": "@whyareyouyelling also relevant", "closewithghosts": "Your tattoos inspire me so much. They're all different but work together & I always wanted a tummy piece but worried about it, but seeing someone with a similar body shape and wicked ink has made me feel like I can totally get one 🖤", "kea_ton23": "U ugly", "veronicaaabrown": "❤️", "yasser_shd": "@yazid_lionel", "kuinke3": "Похожа на мою вторую половинку ❤️❤️❤️❤️ @dionova__", "andre.1242": "You are beautiful never forget that", "eye_luv_pez": "I’ve only got the one tattoo so far, and due to poor placement, it now has a stretch mark splitting one of the letters in half 😂Not something I thought of when I got the tattoo, but also not something that really bothers me that much. It doesn’t change how getting the tattoo made me feel or what the tattoo represents. Xx", "rcarvajal84": "My belly tattoo is scheduled for this Saturday at a convention and after watching the video I'm scared as hell about how much it's going to hurt! Especially bc I'll have to have it all done in one sitting. Ahhhh! I'm doing it anyway though!", "maggie_nddk": "I absolutely love your me tattoo. I may get that soon tbh", "effing_logic": "That’s always been crazy one is my favorite! Also did your sternum hurt? I always wanted to get mine done but with my chest hanging so low I never thought I could do it ❤️❤️❤️ you’re amazing though!", "amydkhdawndly728": "به به", "lolasubordinary": "I desperately want more tattoos but have been putting them all off after I heard people in my local tattoo place laughing at how a heavy guy had collapsed the table/chair they had had him on to tattoo. It broke my heart hearing this and I felt so uncomfortable in a room full of thinner people, trying to be there for my partner, whilst these people laughed.", "jaredalonso29": "@_ceciliamabel02", "bernita_offical_": "Beautiful", "hkhm.dl4": "Hsi hani.god nays", "juliegazuli": "Watched the whole video and loved it. I'm just starting on my tattoo journey at a relatively later age and I have lots of plans. To me it's an important way to reclaim my bodily autonomy. Thanks for sharing!!", "hogglife330": "You yummy", "damnn08": "❤❤❤", "ka.nat8288": "Красата 😍👍", "kate_isobel_cherry": "So beautiful 🔥♥️", "rahulsinghs8": "Love your pointed Nipple", "5280_vixxen": "So Beautiful I love your confidence 💗💗", "oh_chronicpain": "Love your ink. Gorgeous 💜", "ol_kg": "I love the \"I've always been crazy\" tattoo 👏👏👏👏💛", "chrissymama1976": "Omg the “ME” tat is the fucking best ! @fatgirlflow I want to steal this and do it too !", "lunimar84": "Thank you sooo much for this video and for showing your tattoos. You and your tattoos are beautiful. Did any of your tattoos have trouble in areas with stretch marks? I love the look of the chest piece but I have large stretch marks there and I’m nervous about how that might affect the tattoo.", "amothprefersthemoon": "@comfyfattravels well now nip nops is what they are called now. Love that ♥️", "littlebow_pink": "These are gorgeousness!!!!", "stinna_gammelgaard": "I got my upper tummy & between boobs tattoed this year. After looong consideration.", "rkeef27": "Just got my huge thigh tattooed and was worried about it changing as my weight fluctuates. But I said fuck it and did the damn thing 💕😍", "hosein_61af": "😍😍😍😍😍😋😋😋", "jaime_lgl": "Girls with tattoos 😍", "babyruth728": "True! I’ve got a tattoo on my side and it’s lasted through a 50lb weight gain and two pregnancies on top of that. It would take an incredible amount of gain or loss to warp a tattoo. Like, maybe 100lbs or more.", "saeid_omidvar2": ".", "sarazork": "Love all your work, it’s beautifully done!!! 😍♥️ I’ve definitely gained a lot of weight since last being tattooed and the only thing that’s affected them are stretch marks. But no warping at all other than that!!!", "thebabewiththepower3": "Sexy as fuck. 🙌", "songbirdali": "I just made an appointment for my first one YESTERDAY. How dare you know what I needed... 😂 Can't wait to check it out.", "jennavivepalacios": "I got my first tattoos barely! A butterfly on the upper arm and a rose between my breasts. Girl my confidence has gone up so much! I was always ashamed of my body but now I'm in love 😍 I admire my naked self in the mirror and hype myself up, like yes Queen💖 thanks for being so inspiring and part of my self love journey ❤️ @fatgirlflow", "cmaguilar00": "@ymt91__ I so imagine you getting something like this done and me falling in love with it 😍😍😍", "kendrajcooper": "The one on your stomach is gorgeous 😍", "carlymarie.t": "I have been tossing and turning with anxiety about getting tattoos. Part of me really wants them, the rest is terrified I’ll regret it or they will look terrible on my body. Your video really helped, thank you. You are so beautiful and so are your tattoos! 💜", "itsraemarkable": "That first picture makes me want to be photographed like that. You look beautiful and effortlessly so. Thanks for reminding me it’s possible in a world that tells me it isn’t.", "artofchelsey": "I loved it! Didn't even realize you had so many.", "irvingharker": "Cute tattoos", "of.the.fae": "No word of a lie, you are the sole reason I have got the guts to start considering an upper tummy tattoo! I now can’t wait to get my upper tummy done now, but I was originally put off it because I’m fat... but no longer! You’ve helped me to come to my senses for sure 😂 ❤️", "irreplaceablelov7": "So beautiful", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "snackincbus": "Looooove this video concept/ your awesome tattoos/ the softness and joy in these photos! ❤️", "matthew.winston": "I’m always crazy 🌹😜", "trwhiten": "Damn Your smoking hot 😍😍", "yourgirlcici1": "Girl! You better work! You're gorgeous.", "jjohns225": "I say the real plus side of being fat and getting tattoos is you have more canvas!", "dawnalee123": "Beautiful❤️love the “me” heart ❤️", "sincerely_rad": "This is a good topic", "theboponanny": "😍😍😍😍", "kaleighrose23": "I do think my tattoos have changed shape as my body has, but that’s a beautiful thing. None of them is “warped” though-strange question", "sumajanedark\nVerified": "Verified", "yamalo17": "Oohhh I’m so excited for this video😍😍. I only have one tattoo due to money more than anything & I want more so bad😭😭😍😍", "yumaratz": "Just watch your \"Tattoo Tour\" video and it was awesome. Your trip to the tattoo shop is almost the same that both my wife and I use when we go.", "comfyfattravels": "bloop. nip nops.", "chriscrawford71592": "You have like the most awesome tattoos ever 😍😍😍🔥🔥🔥!!! Its giving me tattoo inspiration!!! I want to get a few but I'm scared of needles lol.", "men.of.size": "Beautiful. Love that gun!", "aliciagon829": "Hey @fatgirlflow! What is the bird symbol called on your wrist!? That looks super similar to one my grandpa had!", "wander.free.and.queer": "This video only makes me want more tattoos immediately. I’m trying to convince Allie to get her very first one! 🙃", "mexicanaandhercamera": "aw, I love your 💘 tattoo 😍😊", "ashmjong": "Lmao Kay fam. I got some Kimya Dawson song lyrics tattooed on my butt when I was 18. I gained a lot of weight and it looked like it was blown up. When I lost a lot of weight you couldn't read it. Now that I'm roughly the same size as when I was tattooed it more or less looks the same.😂😂 Idk if it's because it was my butt cheek but I enjoy telling this story. I love your tattoos, they suit you well!😍", "thesmokingreylady": "Admittedly I've always wanted a chest piece but was afraid I was too fat... I'm growing so much (mentally) maybe its time I take that leap too!", "curl_girl_usa": "I 💜 love ❤️ that first pic = sexy, cool", "elismar.silva.5015": "😍😍👅🍉🌷🍓👅🍓"}