{"alhamdulillah___________1112": "@ganiyeva8888", "sywsh4336": "🙌🙌🙌❤️❤️❤️❤️", "omarmohammadi8699": "💋💋💋💋💋", "presi.dent.3781995": "Beautiful", "gemzee47": "Thank you for this post.", "jydjyddjytnxs": "Hisexi", "andrerodrigues514": "Delicia", "ohheyitsrenae": "@linzyjones this is Corissa who is dating J from @comfyfattravels and she is another wonderful follow and has cool clothes that I am forever jealous of", "stile_compresso": "💓💓💓", "slickcajayy": "@fatgirlflow you’re beautiful and inspirational 💖", "leereignssupreme": "You look amazing!💖💖", "loveenanz": "😍", "rediscoveryourlight": "You have such a gorgeous smile 😍❤", "david__holmes_": "I love you m'y bbw ♋️💋💜🌹❤️💙", "htchmmmhgg": "Hi", "gregory_hearts_andrea": "🔥🔥🔥🔥🔥", "kadem.alkaesar": "👄😍❤️♥️♥️💋🌹📞📞🔥🔥🔥🔥🔥", "_dark_n_handsome": "Sweater & panties🔥🔥🧡🧡🧡; and beautiful deep bellyhole", "_rajlakshmi__patil_": "Need that orange crop sweater", "muscle_juiced": "Your ankle hurts because your morbidly obese and wont change it....", "kensjunglehome": "Take care of your health ❤️", "kyle.bates.378": "Sexy goddess", "manuelgaraygomez": "🎉🎉", "poli_finger": "wonderful", "therealbodypositivity": "Uh, your ankle randomly hurts because you’re morbidly obese. It’s called gravity. Your body isn’t meant to have all that extra weight. So maybe rephrase that to say “my ankle hurts when I haven’t done anything because my fat is crushing my body and I refuse to admit that’s a problem.”", "nd_2361": "س خاله هستم فقط بزنگ دختردارم از 18تا 29سال مکان هم داشت باشه مشکلی نیستی 09054672763", "azad__sultan": "😍😍😍😍😍", "dehganmusic": "Oooh Love my big butt big bellied blo wsy ooohh Love my foot full pod poly ley plump and sexy your👍👍👍👍👍👍👍👍👍👍👍😍😍😍😍😍😍😍", "0918107m": "Why are you so upset 😍💋💋💋💋💋💋😍😍", "fk_seiko": "❤️😍", "parviz.marivani3421": "عشقم", "cuddlykat": "Celebrate you lovely ☺💓", "goingcrazyinlife": "What I hate is, when you say something is hurting you are straight away met with a reply of \"you should lose weight\"", "aw918": "@lauren_wall13 ..?", "arielroblesgonzales": "Gue ey gorditas bien rica nena sabrosa nena", "siirikoppanen": "👍🏼👍🏼", "h_a_f_s_1989": "🌹🌹🌹", "haydarsafa2": "❤️❤️❤️❤️nice baby", "tgabbs": "1-I totally appreciate the message you send out on this platform. As a smaller person I even get made fun of so I understand it happens on all sides of the spectrum. But my only issue is with embracing your size (which is great and confident) it doesn’t change the fact that this size can lead to health issues. And I know people will get butt hurt by that but at some point when will people who are overweight want to change for their health? Fuck changing their size for other people or what they may think. Others don’t matter. But at least for health reasons, no?", "damainballa": "Tummy is flawless", "samer.as.77736": "A love you xoxo", "rwpower75": "Beautiful! I reacted the same way as the cactus in the background.", "wilmerjesussanchez": "Qué bella y hermosa ❤️❤️❤️❤️❤️", "kaiba247": "Super sexy and beautiful", "rao1825": "Beautiful", "salimnsib": "❤️❤️", "kerwinjames44": "💋", "lutfuunlu48": "yo😍😍❤️😂😂😂😂u're so sweet, baby, you're wonderful.", "eliseking_x": "Are you angry that your ankles hurt because you are overweight ??", "shamaun.sumon": "😘😘😘😘😘", "ebad_zuwak": "Some more", "khavanicole": "Yes mama. ♥️♥️♥️", "angelicasauve": "Thank you for being one of the realest, most badass creators out there. Your posts inspire me everyday! 💖", "missybaker936": "❤️", "stephanie.bux": "Uh first off I totally get what you’re saying here. It’s not like self love just comes easily all hours of every day 🤷🏻‍♀️ Second, where are those undies from? 😁", "richard_phi": "Yum", "charlie.lotts": "Cactus #goals tho... also, I love your tattoos!! They’re all so beautiful", "nogueiraantony1971": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "elismar.silva.5015": "😋😋😋", "nathanielneyland": "😍❤️🔥 sexy lady", "marwaummuabdullahi": "@zahraaluul", "_herperfume": "I'm so delighted by this photo and to learn of a cool new greenhouse to visit!", "marmalade_thighs": "@hilarymoskowitz this caption is so much more perfect than what I was saying the other day", "truecedar": "I've never thought about it this way! I love the idea of a commited relationship with my body so much! Thank you for this post ❤️", "skorkki": "WOW😱😱😱😱just WOW!!!!we love you Carissa!!!!!💖💖💖💖", "like_k_light": "Thanks for putting this into words...❤️", "66_888_46993": "Man, I really appreciate you posting this. I've been struggling hard and this post brought tears to my eyes. You are an amazing human. Thank you for existing ❤️", "sincerely_rad": "That cactus just has the biggest hard on rn", "siddharth_3405": "Moti", "burtwarcl": "omg i'm visiting my friend in lawrence right now and i apparently need to go here cause it looks amazing", "nerisssaa12": "Love to confidence. U look great❤️❤️@fatgirlflow", "vwwtiturui": "💞💞💞💞💞💞💞💞", "statusviatoris": "Your smile and that cactus makes my heart melt ❤️", "radicalcuteness": "Instead of „jungle house goods“ I read „jungle house goddess „ and that‘s so accurate! You look so beautiful and soft ❤️", "lisajane43": "I think you look absolutely amazing 😉 xx", "karateman.05.18": "LOVE❤", "karim100w": "I want fat Women", "stephlynn_xo33": "I love you and this post!! You rock!", "adoods": "Love this! Also, are those TomboyX undies?? If so, how you feel about em?", "salisbury.anthony": "Hot stuff ❤️❤️🔥🙌", "ladymissbeca": "God this is exactly what I needed 🖤🖤", "wifey_and_momma": "I so needed to read this.. Thank you so much for just being you.. ❤❤", "mandixchartier": "What brand panties are these? My Ass needs them", "muss306": "You honestly have no idea how much I a-DORE you. It's hard to put it into words without crying right now, but like, your honesty is so fucking refreshing and I had a moment (naked, of course) where I was like, \"shit, I look fucking GORGEOUS\" and then it dawned on me that I had internalized the love you have for your body and spread it to my own similar-looking body. The way you talk about your body (both good and bad) is SO IMPORTANT. With each picture you post, it helps me love my own body more and more. P.S 100% cried a little while writing this, couldn't hold back. I love seeing someone who looks like me , love their gorgeous body. ❤🧡💛💚💙💜", "movementmakesitbetter": "👏💯😍", "moody_black.30": "😍🌹", "janetconroyquirk": "“I love you and I am going to work through this with you.” I’m in tears. The beautiful kind. Thank you. And you look fantastic! 🌸", "simoneregina_": "I felt this so harddddd!! Corissa, you always speak such beautiful words of wisdom. I'm so happy to have joined your little corner of the internet 💕", "segardsanders": "Belle...sexy !!!", "jen.allyson": "I love this so much. It’s a message that all of us need to hear and embody. Thanks for being a shining example of self love.", "shellyhassdenteufel": "❤️❤️❤️", "ginaxxrae": "I really needed this today. Thank you 💜💜💜", "fairiesandfancies": "Okay like me too, like I got out of the car and my ankle hurt so bad I had to limp? I’m like WTF IS WRONG WITH YOU JUST DO YOUR JOB ANKLE. 😂💜", "cheeky_snowbird": "You’re so wise 💗", "amanda_marie_lockett": "Love it!", "tracyknight4": "You've written everything that I've thought or felt at one time or another! Bravo girl!", "benzoxo1215": "First you’re beautiful. Second, where do you get your underwear?", "brandiowl": "Totally off subject but I love those undies!", "mistakenlotus": "Yes, I feel the most comfortable that way. I'm a big girl to and I dont give a rats ass about the comments people make. It did for a while but not anymore.", "erwampler": "Oh man this is beautiful and totally made me cry. I love the idea of being in relationship with my body and choosing to recommit everyday. ♥️♥️♥️", "tripleb.10": "I just love to see your post and watch your YouTube videos. You have inspired me to love me for me and live my body. I just want to thank you and wish you happiness and love, Becky 💜💜", "softbodytendermind": "Lol omg I tried to say perfect", "matthew.winston": "Sexy 🌹", "anneandkathleen": "I love this so much! The relationship we have with our bodies is so important. 💛💛💛", "jessicajadeyoga": "Panties twins 💕", "betterdeedsthanwords": "I think it’s important to acknowledge that health needs change as we age. Mental health and personal acceptance are just part of overall health. I’ve had to increase cardio, decrease portion AND start a multivitamin just to feel normal after having babies. Listen to your body. Make small adjustments. You’re just fine tuning. 💕💕💕", "q_strom_99_walker": "Sexy", "sobergirl6": "You go girl. I've been fighting with my body my whole life.", "analog.teague": "🙌🏾🙌🏾🙌🏾", "lauro_diaz_90": "🤮🤮🤮🤮🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖🐖", "iyeza_lesixhosa": "Yeeees baby girl. This post is everything 🙌", "ricardosanchez5593": "I LOVE YOU LINDA MI AMOR 😍😍😍🔥🔥🔥", "comfyfattravels": "I luh that tum", "empoweredplussizedmomma": "❤️❤️❤️😍😍😍", "beebee_sanchez": "Oh, thank you for this.", "windygoo": "Beaurifull❤️❤️❤️❤️", "sumajanedark\nVerified": "Verified", "magicmysticmermaid": "Thanks for loving your body...it helps me love mine.", "redefining.wellness": "YES! This is exactly it. Thank you ♥️♥️", "mkb2mkennethb": "So sweet", "watson.figs": "This post and your plant babies make me so happy. ❤️", "marriceanthony": "so cute.", "sparklesandstretchmarks": "This is gorgeous and i needed to read this perspective today, thank you ❤️", "katelynfoehner": "You are such an inspiration! I love how raw & honest you are!! 💖", "vaibhav.cliqe": "Love it😘😘", "margotmeanie": "Thissss. I needed this."}