{"mamsellens_stol": "love this picture of u and love ur writing 🌻💐🌷", "auntmere": "Yes ! Me too ! It’s very hard when those around you don’t understand . I had a 2nd grade teacher force me to walk a girl who was vomiting down to the principles office because she just thought I was making a gross face about it. My body was in panic mode and being forced to be in that situation did not feel great and I’ve held onto that memory since .", "myvdb": "Yes i have emetophobia. We can handle a lot more than we think!! Yay you for coping with it this weekend 🥳🥳", "lanahar": "I have it too..I will have a full on panic attack if I feel like I'm going to vomit😞", "sparkle__toes": "Where did you get that onesie? I must have!", "ahealthymakeover": "🙋🏻‍♀️ emetophobe here - it feels like I’m the only one sometimes. It’s hard for people to understand. Thanks for sharing!", "hfamigletti": "OMG...just reading this my hands and feet are sweaty and my stomach is in a knot....I'm glad to know I'm not the only one suffering from this ❤️", "carriehall727": "I have emetophobia and anxiety. Not a fabulous combo. Like many others have commented, some of it is about losing control. Some of it is because vomiting is just plain nasty. I spend the majority of flu season on high alert and start having panic attacks if one of the kids says their stomach hurts. Even talking about this gives me anxiety...which makes my stomach hurt...and then I have anxiety about feeling sick...", "amylikescrafts": "Meee! I so rarely hear about emetophobia so thanks for mentioning it. When my bae was sick I burst into tears because I was simultaneously scared and felt so guilty for not being able to help 💔", "amorphehexe": "I have emetophobia so bad it's so hard!", "wildflowerpanda": "So much of my life revolves around my emetophobia since I was a little girl!!! I hate it so much!!!! Trying to make progress but it’s so hard. Love helps in so weird way.", "sbah43235": "❤️", "daniel.ospina.334": "I didn't know u were gay!! But that's good still 👏", "gabi_wiltshire": "@andrew_deshon", "yourphantomgirl": "Колобки", "donald.dejean.7": "2 beautiful queens", "sportif4187": "😈😈😈", "luishumbertoescobedo": "💋👅💋👅", "gugu_life_": "@akinom_seuz", "_josipa_jukic_": "@aimla87", "beetboxes": "I was the 6,666th like 😂", "sea.legss": "What are you wearing??? So freakin cute 💕", "_dark_n_handsome": "Cute picture of you and her", "fernandaramospaula": "@patriciacoelho226 eu e vc", "riseandshinemissy": "Also, if one more person tells me: well no one LIKED to throw up....I will die.", "so.this.is.38": "Me too!!! I feel like the worst mom, because when my kids are sick I can’t be anywhere near them. I run from the room and shut my eyes and plug my ears and cry while trying to yell soothing things to my poor puking kid. Luckily it’s always happened when my husband is around and he cleans everything up. I buy commercial cleaner that kills norovirus and rotavirus and clean everything. I feel sick for days and make the whole family go on a bland diet! When I have had to clean up vomit I sob and dry heave the whole time 😞", "headleyalgernon": "😘", "bigbodyskii": "Beautiful", "mountain_._mama_": "I still have an anxiety attack every single time I have to vomit.", "itslittlekarl": "I have emetophobia, and have had it since I was a kid. It's awful, and has taken so much from me. I'm so sorry, this weekend must have been just hell for you!!", "driving_ms_dooley": "I didn’t know that this was a thing. I have dealt with this my whole life. I convinced my doctors to prescribe me anti nausea pills and I never am without them. When I find myself without them I am throttled in to a panic attack. My mind is blown and I somehow feel a sense of relief and validated. Thank you for bringing awareness to me. ❤️", "ellalabellaaa": "Why are you guys so cuuuuute😍😍😍", "erhmaler": "Honestly I believe I have it?? I never knew there was even a thing until now but goodness is it right on target!", "ladycaribou": "I have it too. Since I was little. And now my meds I have to take first thing in the AM sometimes make me nauseous I have to work through it sometimes daily. My husband has gotten so go at helping me process through it all as quickly as I can. Once it’s past I’m good.", "littleseedmama": "I do. It used to be completely crippling but it’s gotten slightly better over the years. I think having a son with reflux helped me face that fear. It’s still there but I have to power through for him. Every time we come out the other side completely fine and the fear becomes the tiniest bit less. I don’t know if I’ll ever be free of it though.", "moody_black.30": "🔥🔥🔥🔥", "jilleb163": "I have this too (and have had it since I was 3) and for so long I thought I was the only one in the world who felt that way. Thank you for talking about it ❤️", "gnubaum": "My emetophobia used to make me so anxious that it would make me sick. This often sent me down a spiral that could sometimes only be broken through iv meds of vomex and some calming meds.", "shaqutus": "I have emetophobia and it has ruined almost last ten years for me 😭 it's connected somehow to a social phobia so that every time I leave the house I'm afraid I'll vomit! Especially if there 's a lot of people or I feel like I can't get out (can't go to movies etc). Kinda like panic attacks. At home I'm usually fine especially if it's just by myself but guests make me anxious and afraid... 😵", "rosebudismyname": "Oh man. I didn't know it had a term but YES, I have this ☹", "nadiabokody\nVerified": "Verified", "hlwatts": "Yep. I feel so guilty because I can't even take care of my kid properly when he's sick. I get tunnel vision and start to pass out when people get sick.", "alkaline_healer": "I wanna set you free", "victoria.hope.370": "❤️", "saxitlurg": "I'm so sorry you're going through this. I hope you're feeling better from your sickness at least 💕", "crystal.patten": "I have emetophobia and it’s the WORST. I’ve been dealing with it almost all of my life, but it manifested into an eating disorder (anorexia) back in 2010/2012 and resulted in me losing 90ish lbs. 😫 It’s gotten better since then, but I literally just had a panic attack earlier this week when I felt super nauseated while I was out and about with friends. It’s just so exhausting and frustrating.", "amymichellehogan": "YUP, me.", "mahdi_pouran": "👌👌", "bodpos_beauty": "💜🌺🌺🙌🙌", "emma_p_pinder": "My sis has emetephobia and agoraphobia!! This gives me hope for her as she works on her stuff x", "aelurine": "I thought it was pretty normal to fear vomiting and fear/hate being around other people doing it. Like I don't wanna be around it at all and I get anxious whenever my partner has hiccups (it sounds like he might barf but never does) but I assumed since vomiting is gross no one likes to do it", "strange.nothingness": "Ow and I definitely can't be around sick people🤢 I only do that with my kids", "somewhere_under_the_rainbow": "I remember fearing vomiting as a little girl but not to the phobia extent and also then got Crohn's Disease which sadly involves a lottttttt of this. I'm glad you got the support you need and now you can give your partner the support they need! Working through fears is SO important, especially when the mind-body connection is involved (a big ression I became a somatic therapist honestly). 💜💜💜", "camilleashcroft": "Oh yes definitely have that. Even someone coughing a little too hard makes me severely anxious.", "fatgelfling": "is anyone not scared of vomiting??? like it’s a scary and unpleasant and absolutely horrifying experience.", "shrilltrillty": "My emetophobia is so severe that I have never flown, don’t have kids, and am obsessed with even slightly out of date food.", "yumaratz": "Sending you love and well wishes!", "beaddist": "This picture is honestly the best thing I’ve seen today......so happy, so beautiful!", "_rhianna._": "I’ve shared this before but I’ll share it again. My bff told me about activated charcoal. It's been used for ages for stomach bugs and food poisoning. I did a bunch of research on it and then went out and bought some tablets. It has already been a lifesaver. Anytime I'm exposed to someone who is sick OR I am feeling unwell. I pop 2 of those bad boys and it has worked wonders. Do you own research but it has really helped with my anxiety and phobia. The only thing you have to worry about is if you take any Rx or vitamins you have to take the charcoal 2 hours after since it absorbs everything. But seriously last stomach bug we had no one vomited. Only some diarrhea and if you are like me I'd rather shit for a week vs. throwing up. This pill has literally changed my life. My anxiety was getting so bad I couldn’t hardly leave my house.", "hellosunshine417": "My husband does! He is so scared of throwing up that he has panic attacks when he feels nauseous. He hasn't thrown up in 19 years! I feel bad for him sometimes because I am always nauseous and I get sick a lot. He takes care of me though.Such a sweetie pie. Healing vibes for @comfyfattravels!", "jess_cleland": "Yup...I didn’t even know it was a “thing” till a few years ago. I slept with a bowl from around age 7 till maybe 10 because of it and have also starved myself because of the anxiety. It’s comforting to know that other people deal with it, too, and it’s not a fear that many people talk about or acknowledge. Thank you.", "seaneendana": "I have it!", "sidhequeenmab": "Oh my gods, I never knew there was a word for it! I've been struggling with this for years. Vomiting would cause me to have panic attacks. My brain wont even let me eat leftovers I'm so scared they are gonna make me sick 😩", "truantwave_": "I have it as well 🙋🏻‍♀️ and it’s awful. If a coworker is sick, I go into full panic mode and I’m FRANTICALLY trying to use hydrogen peroxide wipes on every surface. I won’t eat, and if I go out to eat I just am so careful with certain ingredients or dishes because I’m too scared of the risk. Even little things like that feel like such a weight day in and day out.", "jerk_nugget": "although i am afraid to vomit and i've said many times that i wish i were able to, i wouldn't go so far as to say i have this phobia. however, when i was 16 i had major (but planned) jaw surgery and my jaw was wired completely shut for seven weeks. during that time i believe i experienced a small glimpse into what people with this phobia must endure and it was truly all consuming and horrible. i was just constantly terrified that i would vomit (esp as nausea was a possible side effect of the meds i was on) and choke and/or aspirate and die because i couldn't open my mouth. (which again isn't the same but just that constant fear occupying your mind and body, ugh.)", "shellyhassdenteufel": "I have emetophobia and it pretty much runs my life. I can’t seem to get it from under it and I’m hurting the people I love with all the things I won’t allow myself to do. 😢 Thank you for posting about this relatively unknown phobia.", "bam_itsanna": "I have the same phobia!! It sucks but we can get through ut", "neonboyfriend": "I have an ED directly related to emetophobia!!! Since age 7 or so. Therapy and meds have helped tremendously.", "samanthadawn89xo": "I have had emetophobia since I was 14. Absolutely terrified. Cant be around anyone when they are sick. Even when my children get sick I have to have someone come over and clean the mess up. I also have an anxiety disorder. So everything combined in pure hell", "tonyamichele78": "I've had this fear since I was very very young and still battle it today, this flu isn't helping matters :(", "lolainthedesert": "My daughter suffers from emetephobia. It’s heartbreaking to see her go through an episode. 😢", "sumajanedark\nVerified": "Verified", "kalesann": "This is the cutest picture 😍💕🥰", "poetry_in_motionn": "OMG I've had this my whole entire life and never knew it had an actual name!! and I thought I was the only person in the world with this!! MIND BLOWN.", "melrob95": "I’ve had it since a little little girl (45 now). No one knows really except my mother who doesn’t realize that is what it is but often talks about my panicking as a young kid when I had nausea. Any word of the stomach bug and I’m an anxious mess for days.", "teejcee": "I never knew this existed, what happens if you get the stomach flu? Would this also make you addicted to cleaning? My goodness that awful, when I googled it, it said people scream and freak out and cry all the time. That’s a terrible way to have to live ☹️", "lillieintheskywithdiamonds": "I’ve had severe emetophobia since I was around two.", "cloudydacie": "I have a mild version of it and even at a mild level it’s awful, I can’t imagine what it’s like for you guys who have a more severe form of the phobia", "evelina_may": "How do you deal with it? My partner was ill recently and I just couldn't cope. 😢 I felt so so bad. But I couldn't go near. Had to bleach the place. Was shaking. Emetophobia rules my life and I don't know how to stop it.", "nurmenjenni": "I had really bad emetophobia when I was younger. It was so bad. Later I developed an anxiety disorder and when I was working with that I realised that it my emetophobia was the first symptom. It was all about fear of losing control. I have worked with these issues for years and the emetophobia has lost most of it's power over me (it sometimes creeps back for a while though). But as I said, I have an anxiety disorder which means that my mind is really great at finding things to fear and get anxiety for. So when I get over one thing, something new will appear sooner or later. So it's a constant work in progress. But yeah, it's possible to beat the fear. Just keep up the good work. 😍", "birli97": "@birli97 90 0534 707 76 73", "abusheland_apeck": "❤❤❤", "bridge_enginerd": "YES. I am always lamenting that nobody even talks about emetophobia. It manifested as a full-blown eating disorder when I was younger, and nobody knew what to do with it because they didn’t know what it was...so they ignored it and waited for me to “just get over it.” I have spent most of my adult life healing from feeling like my mental illness was a massive burden on everybody else (and from feeling like I am a freak - I didn’t even have a name for it until grad school). Thank you so much for talking about this.", "kitty_mae88": "@kelseyann621 us", "daigle.bagel.cream.cheese": "I haven’t vomited since I was 13 because I’m so scared of it. I’m almost 28.", "witchynerd": "I didn't know the was a name for this, but that's 100% me. Thank you for teaching me something today. ♥️", "rainonrisa": "Ugh yes me. It’s paralyzing. I’ve been trying for years to figure out the root fear or trauma to try and get past it", "mo_o_re": "The sweet joy in the way you look at eachother 👌🏽", "rosewaterspritz": "I have that phobia, too. It’s fucking hard. I’ve never heard anyone else talk about it. Thanks for bringing it up. It’s v hard when a partner is sick for sure. ♥️", "sigh_twombly_": "💕💕💕", "allysahn": "Yes!! I have had emetaphobia for as long as I can remember. As a kid it was absolutely debilitating. It still is a major struggle for me.", "tammykarman": "You are such an inspiration 💕thank you! Happy St.Patricks Day ☘️", "shawnalovespoppy": "I also have Emetophobia @fatgirlflow", "synapsefizz": "I had to look that term up. Not to be insensitive to your fear but any time I’m sick I immediately make myself empty my stomach because I don’t want to be surprised by throwing up when I’m not prepared to do so... this stems from throwing up school lunch all over the bathroom one day in middle school and being teased for it for the longest time and having my teacher and the janitor talk shit on me when they didn’t think I was in earshot. 😐😐 I’m currently battling the flu day number three and I’m miserable. My stomach has been empty since Friday— this chick is HANGRY 😒😒😭😭😭😭😷🤒. Feel better soon!!!!", "kyliesky": "Meee! I also think it’s part of the reason behind my ED.", "comfyfattravels": "Im just so thankful for how much youve been taking care of me when youre dealing with this too. Youre amazing.", "lemonemslie": "Y'all are too cute 😍", "juicyjayfox": "Sammmmeeee 😢", "thegirlfromtomorrow": "I have it. Such a hard thing to have. If I hear someone has a stomach bug the anxiety is strong. I'm hoping it'll be the next battle I fight! Adorable pic", "alyssa.s.murphy": "Omg me! I have this weird disorder where my esophageal sphincter is really tight. Like, I cant even burp. I haven't thrown up since I was 8 (I'm 31) and now I am TERRIFIED to.", "ironicleaves": "Y’all are precious!!!💖", "nallepakko": "Fellow emetophobe here 👋👋 it suuuucks. I'm also wotking on coping wirh it and trying to find out what's behind it. Forces and a speedy recovery! 💚", "bam.peesly": "PS where did you get those jammies 😍", "bruinsfan226": "I wanna be a part of that cuddle session", "yamalo17": "This picture is 😭😭😭😭 & thank you for sharing with us Corissa @fatgirlflow. ❤️🙏🏾", "twinklelights.gif": "Me!", "mxtah.rogerstheyborhood": "Fyepunk", "deeb321": "Where did you get that jumpsuit??", "subro.pie": "Me!! Its such a violent mental struggle wanting to help loved ones in situations like that while also being so gripped by fear that you can hardly function 😭 Bless you and J, I hope you both feel better soon ❤️", "ruizzcollado": "👍👏😘🙌", "croyster912": "This is the best picture OMG!! You and @comfyfattravels make me wanna fall in love all over again.The look of pure joy you both have!!❤️❤️ When you are scared look at this picture and it will bring you Joy!!!", "q_strom_99_walker": "Cute", "gloriatrillo": "I absolutely did as a kid. It faded by 15-16 but it was at its worst around age 11, and I remember being simply paralyzed with fear. The book \"My Age of Anxiety\" is a fascinating memoir of this and other issues that I read while on temp disability for anxiety a few years ago - it's really great, and if you're ever looking for a really easy but informative case study I definitely recommend it. I actually walked into a Barnes & Noble the day it came out and requested it, and they had to open a new shipment box to fish out a copy for me before it even made it to the shelf - but.it was worth jt", "acook02": "Great photo!", "stephsteph18": "Oh god I’ve always have a phobia of vomit 😟😵", "katherinehafssol": "Love goals 💜🥰"}