{"omarcisse60": "Nice", "da.mar.a": "😍 Love it", "theaember": "Yes! I have been trying to find dining chairs options for my fat body and those of all the fat friends I want to have over to my house. It's driving me nuts. I saw these gorgeous, tufted dark jewel toned blue banquette seats on Pinterest, but obviously, you can't actually get them for sale anywhere. Plus, though the size looked accommodating, the legs looked less than sufficient. Ugh. I'm so glad someone's gonna fucking talk about this.", "sebastian_gomez_lopez": "😻", "jordan.nicolesmith": "I love seeing fat babes in cute clothes that might actually fit me, but I’d rather see fat babes who truly happy. So glad for you! ♥️", "jillbergantz": "I’m trying to be more brave about this— posting me, dressed for everyday, in the clothes that make me happy, in the body I have now. Thank you for blazing the trail! ♥️", "xxpixierayxx": "I'm happy to hear you're putting yourself first and everything else can follow. Social media shouldn't govern or dictate someone's lifestyle. It's always great seeing people just being themselves. As much as you want to help others, you still have to prioritise yourself so this is fab :) Plus, we really should be very aware of how damaging Fast Fashion is to the planet (and the wallet lol!). Having core pieces that last a long time then seeing how they can be upcycled would be great, plus eco friendly ^^ 💕💕", "marvamaker": "I like this outfit the best! Thanks for keeping up the work. You and your sweetie are lovely humans. Your visibility is so important.", "ray_and_company": "Okay speaking of hygiene things, I just found a big ass loofah that suction cups to your shower wall to SCRUB YOUR BACK and I really want it. It's on amazon, it's not cheap but I can't imagine how good it would feel.", "being.rayne": "😍💛👏", "shaw_lori": "@comfyfattravels and @fatgirlflow y'all are too adorable", "luluvaz1": "...even if you don't model the clothes (or purchase them) at least tell us who to watch, and what videos to be aware of... I follow only about 5 fat fashionistas..they are hard to find", "pswrczk": "😍😍😍", "biancakarina__": "I am so here too. I gave up fashion blogging mostly because it was frivolous and wasteful and very exhausting. Looking forward to the change 🤗", "estrela_ak": "To be honest, i love the pictures where you don't wair any clothing, they are pure and beautiful💕. Just like this one ^", "openupthelens": "I love this and thoroughly support you! Sometimes the emphasis on fashion in fat positive communities - though important! -can make me feel shitty that I just don’t have the money, and I think having more wideranging lifestyle topics is important too! Plus of course, doing what makes you happy rather than what’s expected is always better ❤️", "beaster_87": "👍", "paparazzi_princess1984": "@anxious.oiler", "schreckwalter": "Tempting fat upper arms ‼️❤️", "_dark_n_handsome": "Love your amazing tattoos... How tats do you have on your beautiful sexy body", "wakel.wakel.5458": "WhatsApp 9140310610 love your so very nice beautiful fec", "katysalsa": "I’m so here for the deeper content. The social justice-fat bodies content. Your voice is so powerful, and while I like an occasional clothes haul, I’m much more interested in hearing about what’s on your mind. I love the videos of you and J too :)", "ranbir172": "Nice big boobs", "abdel.tian": "I'm in love", "fred_baby_81": "Total respect to you for this decision. It has to be real. I get so depressed with the constant show of new things which for the most part are unaffordable and that lifestyle is unattainable and fake. Much rather see people happy in their pjs and everyday situations than promote perfect images which brands profit from. Xxx💪🏻", "fostermamaeva": "Thanks for being authentic. Clothes are fun, but we watch because we cant get enough of you. Rock on sister friend.", "summers.joy": "Cool! Change and growth is good! We are here for it!", "greyhamrobot": "I can't get over how adorable and happy you like in all of your posts.", "bsummerbeauty": "You do know alot of ppl came for fashion but stayed bc of you. Me being one of them I'm all for a lifestyle channel and content!!!! And I'm also a Jean's and tee person and if you ever find cool Jean's and tees wed like that too.. ❤️❤️", "khonkala": "❤️ Furniture, self care, & lifestyle resources for fat people! Yay! Whatever you vlog about will be awesome, because you always bring your authenticity and enthusiasm.💚", "ally_margie": "We love a bath queen 💫👏🏼", "akeelaray": "You are really beautiful...", "heylolitahey67": "I’m so excited to see your new direction 💛. I love your content, but mostly I love to hear your thoughts about stuff. You’re one of my inspirations to wear whatever I want, get whatever tattoos I want, and to just take up as much space as I need/want. So I’m super excited to support your new direction for things. ☺️", "aneerbas": "Here for any and all content you put out. ❤️", "gypsyintheskye": "Much love for whatever you do. I’m glad I found you. I could say so much more but I’ll save it for the right post ❤️", "jilleatsapples": "Omg would LOVE your reccs on comfortable and affordable kitchen chairs bc I’ve been on the hunt w no luck", "laurenjacsmith": "❤️❤️❤️", "shaynalou": "Love this!!", "bridge_enginerd": "You do you, and I will always show up for it!", "babyruth728": "That pressure to always have new and current clothing on is crazy. No one actually dresses that way (unless they’re super famous) and I appreciate when social media accounts show their own style in a genuine way. Maybe I have a similar style dress and the post shows me a new way to combine it, rather than something else to go buy all the time so 👏🏼👏🏼👏🏼", "greenekangaroo": "This makes me happy. I feel like every fat blogger I follow feels railroaded into wearing fashionable clothes that half of us can't afford and another quarter would never even wear. (Jeans and tee shirts forever.)", "libby_ehxo": "Can't wait to see your new endeavours!! Xx", "babybeile": "it’s all the more beautiful when you stay true to yourself, i’ll be here no matter what! love you 💙💙", "marygraceking_": "Speaking of hygiene...what deodorant do you use? Right now I use dove/secrets clinical strength because I sweat so much at work, but its 11 dollars for half the size of a normal deoderat stick!!", "allasunder": "I glad you are getting to a place you feel comfortable saying and doing how you feel with your platform. I am looking forward to the furniture info and I hope that you do still show us affordable clothing when you can or want to.", "peaceloveandlush": "Stunning!!", "dana.jackman": "You’re always allowed to evolve! I can’t wait to see what’s next! ❤️❤️❤️", "rhondafayeweir": "I’m excited to see what is coming up next", "spaced_out_rae": "Support thos 100%, excited to hear/see more ❤️", "greeneyedgyrl": "I’d like to find a bathtub I can fit in!", "hargrovekristin": "@fatgirlflow let us know if you want to do a clothing purge!", "madderandfatter": "Corissa! I am so excited for this. Fuck all of the clothes.", "kassem_arfin": "💋😍", "hancmayhew": "Thank you! ❤️", "vicklynngibbs": "Do what makes you happy! We’ll be a long for the ride. Thank you for working as hard as you do!", "mashavolzhskaya": "❤️ makes so much sense! Thank you for the transparency", "soapboxsadie": "❤️", "livingwonderfilled": "Love it! You’ve got to stay true to you 💕", "alagie823": "❤️😂", "carine.mnayer": "Hey keep going ❤️ sometimes all of us reach places away from our goals but here in this situation our determination plays its job so we just have to adjust our path and keep going until we reach the GOAL ! hii from Lebanon 🙋🏼‍♀️💗💗", "bekahmccarter": "I just found your page the other day. In that short amount of time I have found so much more representation than I have my entire life. I just wanted to say that I appreciate what you're doing so much and I appreciate you. I love your page. ️ ❤️", "mrsb055": "It’s so funny that you are going in this direction because for months now I haven’t been wanting to consume hauls and fashion vids all that much. Part of it is broke🤦🏾‍♀️ and the other part is a bit of an evolution I guess. I wish you so much joy and positivity on your new direction and I’ll still be here cheering you on and watching.", "riladespe755": "Nice", "moody_black.30": "🔥🔥🔥", "whitniewilliams": "I am so here for this ❤️", "alessandro7280": "😍", "vwwtiturui": "💞💕💖💕💖💕", "alan.hyde.14473": "Beautiful photo so sexy x", "elizabethchristine___": "Oooh excited for this new direction!! ❤️", "pammieplusparks": "Girl, I have been having some eye opening experiences this week in the hospital regarding advocating for my super fat body while in the hospital. If you want to tap into some insights regarding how to keep your body clean, comfortably clothed, and transported inside the hospital and how to deal with EVERYONE asking if you thought of bariatric surgery....when you are battling a super severe case of the flu and bronchitis that are directly related to a virus and not body fat... then hit me up, 'cause sister's got stories. #hereforyou", "bounce_n_jiggle": "Loving your connection to yourself and your authenticity.", "beessknees": "YES! I love that you’re taking your account in this direction. There are plenty of fashion influencers (which is great to say that after so many years of no representation) and I think it’s noble to go beyond and talk about the intersections of identity. Now that the conversation on body positivity has been started, I think it has set the stage to talk about fat politics and accessibility in a more accepting environment. I look forward to the future of social media as a platform to have conversations that are normally not facilitated. So basically I support this choice and I look forward to what’s next for you!!", "witchywendywoo": "Sounds great to me Corissa! I love seeing you in jeans and a T shirt. In fact you've kind of made me fall back in love with jeans. I've bought some dresses for work so enough already - I'm not fashionable either! Let's talk about other stuff. Just don't go away we'd miss you too much xx", "tatianadenisova4318": "👍👍👍", "anglerfishanglerfish": "Amen to being a \"jeans and tee bitch.\" I went to Catholic school from kindergarten until graduating high school, and even now in my 30s I basically wear a uniform because I know what I like and feel good/comfortable in (which are not the same thing, so I'm happy to have options that are both!), And fashion has very little to do with it. Anyway-- you always seem to look cute as hell in whatever you are (or aren't) wearing, so you do what's best for you!", "jenni1103": "Cutest, always. How the heck does any hairstyle always look amazing on you?! Also, the pure joy you impart daily in this space makes me so joyful to be present in whatever way I can for its changes. ❤️ thank you for being you.", "lcrate41": "No. I like the bleep bloop...Leslee port angeles wa usa", "poppy__and_mattie": "You are awesome. Love this and supporting this 🙌", "beamerkathy": "Actually, I just enjoy....you! You could show me anything or talk about anything you want and I'd still follow you. I understand what you mean about the clothing consumption. I know there are a lot of people that love it but it seems like such a waste of money and a little too \"surface\" for me. I can't wait to see what you have going on....p.s. love the new haircut!💙", "serwendipitous": "@fatgirlflow you are the first stranger I ever eyeballed with a body like my body looking beautiful in clothes that I hadn’t considered on the table for myself. Some of that was access, some of that was internalized fatphobia I was participating in. This was years ago. Seeing pictures of your body that feels so close to my body, looking unequivocally, non-negotiably beautiful was a fucking revolution. I write this to make sure that you know that your work then was powerful and your work now will be, too. I’m here for it. Viva la revolution, baby. ❤️", "lizmcfiz": "My favorite videos of yours are vlogs/ talking about whatever the hell you want, it's like hanging out w you 💟", "agnes_kozma": "Can't wait to see what the future holds 💕", "leahsamec": "YES YES YES YES YES AND YES 100% behind this, you go girl! 👑", "caitlinryvlin": "I love your raw truth and I see you and want more of your gorgeousness everywhere! Global domination I’m thinking 😊", "raisedbyclowns": "You’re the very best.", "tallica1014": "😊❤️", "tararaekuyper": "💖", "aportuguesegirlinmontana": "Yay for the new content! I'm going to miss your videos on YouTube (especially the swimsuit hauls!!!! 👙😍) but it's not because of that that I've been following you since Tumblr. Keep it real and do what it feels right for you, were going to love it anyway. ❤", "nervousinjuly": "The whole caption. 100% support 🤘🏽Some of my favorite videos you've done were just life topics", "rebekahlynnb": "Self care/hygiene resources and lifestyle resources!!!! FURNITURE for fat bodies!!!! HELLLL YEAH I AM HERE FOR THIS ❤️", "missautumnatic": "Love this and your page!", "sayshesclassy": "SO HERE FOR THIS 🙌🙌🙌 I try not to get caught up at all in the fashion piece but the temptation to gain followers can be real at times. But tbh I'm just about activism, visibility for fatness and disability... mostly that! Love you friend!", "girl_bear_yssa": "I'm so excited! I've been following you for ages on my older account, and I love you. I'm ready for whatever you got! Side note.. I'm not sure if this has been said, and if it has, I'm sorry I missed it, but are you continuing with your store? Funds were low for too long, but now I need one of your crop tops!", "rubbertrampartist": "Your hair is super cute in that photo! Thanks for all you do!", "fairiesandfancies": "I support this so much! ❤️❤️", "abas.rezaei.ir": "💋😙", "hannahisdead": "I love this! Know ya self and grow ya self 🌱💖", "ginnerbot": "I think any step that helps anyone feel like they are being more authentically themselves is a good one - love your work and will be staying tuned!", "_betsymck_": "Algorithm boost! Also, I love your content so much, and I have no doubt wherever the winds blow you it’ll be fabulous. BTW I used your promo code to get the True&Co bra for myself and my wife and OH EM GEE. Best bra ever!! Thank you for recommending them! 💗", "jessbanderson": "I am personally so stoked for this and your upcoming changes. I follow your platform not for fashion but the way you bring self love and inclusion to this community. ❤️ As a minimalist, multiple pieces of clothing and a large wardrobe are not my style 😅 Thanks for all that you do! Xoxo", "october_dream": "This is awesome, honestly it helps so much to just see a gorgeous fat woman living normal life and not always perfectly made up/stylized. And other issues are important to normalize and destigmatize.", "vintagecitylady": "Also, you’ve made me more confident not to feel so out of place when I’m not in a dress. I bought jeans this year because of you! I wanna be a tee and jeans bitch!", "donyomar": "Nice 👍🏽", "hellosunshine417": "Yes!!! I have been seriously wondering where to find solid furniture. We have been through soooo many couches in the last few years, I'm over wasting money on furniture not built for my glorious behind 👏", "mack_n_chum": "I like it the best when you talk about pieces you’ve fallen in love with, that you wash and wear then tell us how the material or fit changes and what you adore about them still, and if the fabric stains. And honestly it’s something about your no fucks given, your anger and your tears not to mention the view of your genuine self that keeps me coming back for more even if I never plan on buying a single item you show me. 🤣", "trustthefatgirl": "Hey, hi, hello. This is your monthly reminder that I FUCKING LOVE YOU AND YOU ROCK. Seriously though, you have been and always will be my fat girl inspiration because you are so upfront and honest about your struggles and your failures and your goals. We are with you every step of the way, whatever that way is for you. #fatgirlssticktogether #likefatthighs #becausewerehot #andpowerful ❤️😂😘❤️", "high_five": "Yesssssss so excited for you", "subterraneanbunnypig": "I'm here to see you and your attitude and your love of fat bodies, idgaf what you're wearing 💞🤷‍♀️😄", "emilyruthless": "Grow on glow on ✨", "hello_kristie": "I’m so on board with this. Also PLEASE help me find a couch that will not break under superfat bodies. 🙏🙏🙏", "cierraswall": "I fucking love you. You’re such a huge inspiration of mine. Thank you for always being so real and raw with your following. You’re total goals. Keep on keepin on babe!!", "thislittlejellybean": "I’m a newer follower and have so loved seeing all that you have to share, and am looking forward to everything you’ll be bringing moving forward. Your photos and words bring me so much joy and a sense of comfort, and leave me inspired to live life with love and ease. So yay for you and all the things you are doing/want to do! ♥️", "courtyb74": "Can’t wait for the FURNITURE! I would love to hear about your thoughts/experiences with brands and see what is out there!!", "songbirdali": "Really excited about this! ♥️", "fatgelfling": "looking forward to whatever direction you take 😊", "deaad01": "I am so very excited and looking forward to the new content. There are lots of body positive fashion accounts, literally hundreds! The expanded subject of living life and being comfortable as a fat women is exactly what I want to see! BRAVO 👏👏👏", "andie.gram": "as I have (VERY recently) discovered, there are plenty of plus size fashion insta accounts. you do you lady!!", "strong_in_the_broken_places": "I am super excited about the self care/hygiene things you are going to share! ❤❤❤", "hulksloth": "This new direction sounds great!", "amberbria": "Definitely need help finding a fatfriendly sofa. Lol", "comfyfattravels": "bleep blorp for the algorithm", "halfhollywood": "I love this. So excited about the change!", "anneandkathleen": "I’m excited to see what this change means!", "sarahontheisland": "Thank you so much for all that you do! You are a light no matter what you choose to focus on. Excited to see what’s next! Blessings, beautiful one!", "nikky22204": "Here for your authenticity and genuine, honest discussion. Excited to see content you are passionate about ❤️", "beebee_sanchez": "I would read the hell out of info on cute furniture that is fat friendly! Looking forward to what comes next.", "fatfiercefutch": "honestly overjoyed for you ✨🙌 please do what you love, and we’ll love it (and you)", "memesforvalidation": "I support everything you do 💖", "mozzie_610": "Oh man I love this so much. Those things are definitely things I personally will benefit from. Plus I love seeing you do anything that you feel passionate about because your fire makes this world so much brighter!!!! Thank you so much for going after what you want!!", "ksheble": "Jeans and tshirts are life.", "serocreates": "I can't wait to read your new stuff! I hope you know that so many of us are here for more than just fashion. Thank you for building this community!", "matthew.winston": "Nice 🌹", "strawberryeliza": "The clothes consumption is a thing that really bothers me about fashion bloggers and I’m always so conflicted about following people even though I want to see plus clothing on fat bodies like mine. I am happy to hear this news.", "somewhere_under_the_rainbow": "I realllllly resonate with this. & recently did a little nude in the tub series myself! ✊", "miss.whatsername": "Looking forward to the future of fatgirlflow! 💜", "momster.gina": "Fashion is nice for others, but I really don't care for it much...I'm all about the other stuff you mentioned! Game on! ❤👏🙌🔥", "imsarahconley": "I've been struggling with this for so long, especially since I moved home, but I finally feel like I got over that mental hurdle. I've always believed that having great style doesn't take a huge budget, so I've been pushing myself to practice what I preach. I haven't had anyone complain that they can't buy what I'm wearing, which was my biggest fear. I hope that you can get to a place where you feel content expressing your style without the pressure to purchase. Your voice is so necessary! 😘", "ams_237": "This all sounds great! I love it! Thank you for staying true to you 💕", "chriscrawford71592": "Yo this is such a big thing for me. I struggle with clothes a lot and letting go of stuff that doesn't fit and finding stuff that does fit that I like and trying to accept my body the way it is. Its so difficult but you and j inspire me every day. So thanks for putting this kinda thing into words. Ps love your haircut!!!", "yumaratz": "Awesome!!! Cannot wait to see your new format and all that you can show.", "fluidfatti": "i’m so excited for this new era of content (i hate that term sometimes but just ready for whatever energy you’re gonna be putting into the world)", "momasof22206": "I love your new hair do!", "kayrawl": "Sounds AMAZING. I cannot wait to see what you have to share.", "hopeinseattle": "🌻 Love this.", "a.page.cesare": "Omg furniture for fat people 😍😍😍 just spent a fortune on a mattress and bed frame that are supposedly made for bigger people and I really hope they last like they say they will", "namascray": "❤️❤️❤️", "zeeshan7654225": "❤️💋"}