{"manicpixiegrrl": "Sometimes the tummy just needs to breath too ❤️", "curvygirllingerie": "Beautiful", "valerighetto": "Beauty!", "heatherrussellyoungblood": "😂 I love reading trolls comments", "metalmomdc": "@cesca_sellars24 and other trolls: just curious: do you want people to go out dressed in long black dresses with paper bags on their heads? What are you aiming for, and why in the fuck do you follow BoPo accounts? Bet you bullied nerds in elementary school, too.", "dan_johannsen": "@tanner_sam", "sarahbanksg": "Nice", "heidirimoore": "Not ugly?", "shereadelsol": "Message", "ucantwearthat": "Ugh some of the comments are just ridiculous! You have the cutest belly and you absolutely should love it. I adore you and everything you stand for! @fatgirlflow", "ladyjasper1": "Girl!!! I wish I was like ya. I'm always tucking it and stuffing it to hide my big ole belly ! Get it girl!!!", "lavme83": "❤️", "ilovethemxoxo": "Your awesome keep being awesome just the way you are 😊", "milehighpeach": "This message is beautiful. High five for being true to yourself. Fuck the haters. You do you, boo boo!", "hamedmahmoodi3364": "oooooom", "frankstrovocci": "Love your photos 🔥", "kangkiply": "Sex", "tina_palazzo": "@kristina_leroux - forgot ey ...", "pedroblackjunior": "😍❤️😍❤️", "aricanteam": "💋💋💋💋💋💋💋💋", "miekeacoleman": "How much weight did she gain", "babymaybemama": "I can only lurrrve your belly bby", "hmoooode_prince": "Hot belly", "_rhianna._": "The thing I don't understand about the people who comment about \"glorifying obesity\" is that we fat people are literally just living our lives. Same as you. You don't know anything about a person based off a photo except for what they are showing. A photo of me in a two piece would get them same comments but I'm actively losing weight, which is what they want. But to these people I'm glorifying obesity bc I'm out enjoying life. Stop ✋ stop making fat people feel like we can't live out loud just like everyone else. Stop judging our health and lifestyle. Please.", "mypepeisbiggg": "Yes!", "thomasmoralesbraun": "@jprobson1", "brownnskinnhoneyy": "Body appreciation😍 and yall wanna talk about weight , well let me tell y'all something , y'all don't know why she could be doing to lose her weight but guess what. She's comfortable in her self for now and isn't beating herself up about it . sometimes you gotta be content with your situation for the time being . with that being said. 💪💪 love it", "sabi.hernandez": "I literally thought this was a pregnancy belly! I was about to say congrats🎉", "haleyjanese": "@emmaleekeatley", "915am": "I u g", "francesca_sellars99": "And can people stop saying fat phobia , it's not a fear of fat people , it's a concern , and when you live in the uk our taxes pay for obese people to get operations and gastric bands and healthcare for what they causes so people have every right to have a concern and look after themselves", "nataliemeansnice\nVerified": "Verified", "craftymum02": "Mine saw some 🌞 today too", "monsigar": "Ohhh your body is so cuteeee", "_inestagra.m": "👅👅👅💦💦💦💦💦", "__rose__xo": "This \"fatphobia\" shit is extremely stupid. Learn what a phobia is before combining two words and adding a meaning to it.", "yakaveli264": "I need all that", "_.mickey.jean._": "I feel ya girl!", "fighting_bulimiia": "Jfc you're so beautiful.I'd like to be able to assume my body as you assume yours.", "myko.mel": "*med student", "viktahhh": "Fat people are no different than fit people - both sides are doing it to make money and promote crap on Insta. Stop acting like y'all changing the world you're here to make money off the poor idiots who follow you and buy the junk you promote. Sick of the Insta losers and the Powders and shirts and makeup. Please just stop.", "boopdiva33": "?", "1bikini2bikini": "@indigofire1o9 @ctorres_94 It was hateful when he assumed that she was pregnant, and she wasn't. And then he still felt the need to post his comment. 👈WHY? What purpose did it serve to make that comment? If not to be cutting and demeaning. What was the point of him saying that? I hope you know you have much to learn and someday (hopefully) you will look back on this comment and cringe at how absolutely cutting you were. I hope nobody ever treats your children that way.", "rmarie790": "My stretch marks are the same! Same color as my skin", "tvitarelli": "Why in the right fuck do you haters follow her if you have nothing nice to say??? Boggles my mind like why waste your time writing messages??", "tvbath": "The only people that are \"fatphobic\"are anorexic people other then that it's a simple preference, nobody is afraid of fat people, or fat for that matter and can quite literally be terribly unhealthy, too much of everything can be bad for you even water", "rakkaustarina": "You are so beautiful! Your belly looks like mine and I love it! 😍☺️🙏🏻❤️", "warrenddee": "Big belly women rule Bbw's rule", "sharozkhanbhai2056": "wow", "miia_and_dolls": "❤️", "missmollydollygoldstein": "💖💖 What is up with all these haters??? Yes Im fat as well! And I was constantly bullied throughout school by bullies like you! Bullies like you were the source of me being sent to a family therapist because I first tried to kill myself at the age of 9 to end the torment I got on a day to day basis. Ive been heavy, and Ive been slightly thin, and Im trying to better myself and get healthy. But just by looking at someone who is \"fat\" gives you no right to comment on their health or appearance! And what I just said", "greaterbritton80": "It's an act of rebellion to display what society insists you cover up. Existing as you are in any given moment is not \"promoting obesity\" it's just living. Everyone has the right to the sun on their skin! #YOLO", "shrinking_jammers": "No. Freedom of speech is your right to say things without fear of persecution from your government. By using it as a blanket excuse to be rude to people you're making a mockery of everything it represents. I have heard every insult under the sun. I don't a safe space, I'll be here all day to remind you that you're a dumb cunt @_me.du.sa_", "gabrielacavalo": "You r gorgeous and amazing ❤️", "marla.vi": "I quote @_me.du.sa_ . Its not fatphobia. Its just unehealthy. I hope for your life you'll change and keep health hab.", "morgan.evilyn": "Your tattoo peaking out like that is so cute!! Keep rocking! ❤😜", "polkadot_britt": "You can't post a picture with a belly without all the town idiots coming to vomit up their useless opinions. Love you girl! Proud of your self love <3", "kayyleighh___": "Holly shit yes, love this! 🙌🏻", "tetejanet65": "Oooo shit for a second. I that u were pregnant. ..dammm😷😷😷", "send.knee.pics": "Obesity is mostly caused by eating disorders. You shouldn't be celebrating obesity. obesity can lead to heart disease, type 2 diabetes, bone diseases, and even death.", "ember.mae.insta": "You do everything you are supposed to to be healthy and still end up with heart problems and or other heath problems! Hell you can walk out side and get hit by a car and guess what it has nothing to do with your weight! Why should anyones weight effect their happiness, life is a journey why would you wanna spend it being miserable, if she/ and anyone else is happy with who they are, let them be! Its no ones business but their own!", "supertightbutthole": "It's not a phobia, you're disgusting. It's like when people don't eat shit, they don't have a shit phobia, they just have common sense to dislike disgusting. Nothing about you is healthy, lie all you'd like, you're still a human joke.", "_m3dvsa_": "10 years ago women fought for curves and realistic bodies not to be judged on tv and on the streets. Now you fight for unhealthy. because okay I understand that there are bodies like this out there, but it's unhealthy on so many levels. Call me fat phobic, see if I care. I go running a lot and I still get tired on a couple of stairs. How about you? I am sure that you only move around and start heavy breathing. and no. I am not saying that you necessarily do that. But I have seen videos of fat acceptance where those women just talk and start being out of breath. just for talking. Health is not at every size. Go watch MeMe Roth. She knows what's good.", "lupinelady9": "@_me.du.sa_ why are you even here? @ctorres_94, why are you commenting at all? She mentioned nothing about weight or health. It doesn't matter what she eats or how little she exercises. This post has nothing to do with any of that. It's about not being ashamed of your body. She's unapologetically showing that she's got just as much of a right to exist in whatever state she's in, regardless of your opinions or prejudices.", "fatgainer42": "Damn and who cares what other ppl think u wear what u wanna ur beautiful 🙌🏻🙌🏻", "themadcutter53": "@1bikini2bikini God love those little scardy weanies!! 😂😂", "tiffany66b": "OMG I love you! I am a work in progress. I want to be Ms. DGAF someday too!", "iowafa98": "🙌🙌🙌🙌🙌😍😍😍😍", "bumbles_bald_man": "Just beautiful. What a belly!", "findyourbloom": "Beautiful ♥️", "spurarkar": "yummy tummy...😋😋", "amandasloskey": "Thank you!", "maddog_black": "😙😙", "just_this_chick": "@fatgirlflow you are so fucking extra, i love love love it!!!", "shamaun.sumon": "😘😘😘😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋😋 sexy", "joywayfinder": "It is cute! It looks like mine and I should think the same thing but I don't always.", "leahrosss": "Wish I had your confidence! You rock 💕", "thedirtygentleman": "Beautiful and amazing...nothing sexier than confidence", "fanii_xox": "Wish I had your confidence !", "meljahs": "Yes, same! I love my belly and I feel constricted and uncomfortable in high waisted anything but sometimes I get uncomfortable because I'm stuck in the thinking that I'm making others uncomfortable...but I have to remind myself that if someone else has a problem with my body, that's just it. Their problem, not mine. And I deserve to be comfortable and feel good about myself 💗 thank you for sharing!", "brookesfitliving": "Thank you for your positivity❤ You look great:)", "tardywardy": "Yay! Twinsies!! My belly is free right now and man it feels good.", "larafacao": "So proud!!!!!", "juketrip": "i need youre confidence, youre amazing", "regiangelicar": "Bomb💜", "_karolinaa.c": "I hate low rise, not because they make me uncomfortable but cuz mofos roll down all the fucking time 😂", "taliiii_deee27": "I can relate. I have never ever worn a two piece. Never. My stomach is several shades lighter then say my arms because it literally has never seen the light of day lol. I don't think i will be confident enough to show tha belly. But i admire your confidence", "waldxn": "Bless belly love💕🙌🏾", "ohthatskris": "❤", "bigadw77": "Sexy belly!!", "bishpls": "My stretch marks look just like yours. ❤️", "maliavideography": "Thank you thank you for posting this. My stretch marks look like this too, after being on my beautiful tummy for over 6 years. Thank you.", "wednesday_fattams": "Let that belly out to play girrrrl 😍 I'm loving this!", "abbeyrose_2000": "Absolutely gorgeous!! 💗you go girl 💪🏻🙌🏻😘 x", "mckayla.darling": "Hey you're lucky, my belly has rolls so even if I tanned my belly the creases would remain white 😂😂😂", "alixmelton": "I want to get back to this place of self love ❤️❤️❤️", "moondrunklove": "You're beautiful. Thanks for inspiring me to love my belly more!", "thesaltlifewife": "Big bellies are still beautiful bellies! 😘", "hakunamakeda": "😻😻😻", "ashleewelsh_": "Needed this! Thanks girl ❤️", "reviewsby_l.a": "I only wish to be that brave.", "shoobymc": "This is amazing. I love it. And is helping me love my belly too!!", "ps_from_ts": "Thank you, thank you, a million times, thank you.", "mothmadam": "Beautiful and inspiring", "_gesiana__": "👏🏻👏🏻🔝", "thekatchats": "Get it, girlllllll 🙌🏻🙌🏻🙌🏻💖😘", "norarobertsfan6969": "😭😭❤️❤️", "empathme": "I just watched your latest video: loved it!!!💓💖", "rachelmerkle3": "My friend's three year old son just wanted to pet my belly today. It was SO sweet and genuine. Just all love. Too cute.", "ghostfacehila": "Bottom from torrid? I have it!!", "swansons.lawrence": "Such great comments!!✌🏻", "veradoes1": "You're absolutely gorgeous! Thanks for being so real!", "vic_tor_y_a": "👏🏼👏🏼👏🏼", "gemma2194": "❤️❤️❤️❤️❤️", "dontrunwithscissors37": "U go💕", "mandy0678": "You inspire me my dear!!"}