{"shamaun.sumon": "Fantastic 👌👌👌👙", "fatshionablyrae": "BODY!!!!", "ennerglow": "I wish I had your beautiful tight skin 😍", "be_positive.be_you": "We have just come across your page and we love it!! Its amazing,keep it up! X We are a group of girls from girlguiding UK focuseing on ending the stigma around periods and also encouraging positive body image for all. If you have time we would love you to take a look at our page to. X", "trekkie1tim": "Let's go sweetness I'm game❤️❤️💋💋", "chadroyroyster": "Sexy", "dry_dos_anjos": "Você parece com @thaiiscarlaoficial", "michalwilson8084": "Very nice", "ecevittas": "Wooow super 👅👅👅👅", "priyajasmine22": "Wishing I was as confident to wear a bikini atm trying to lose 15 more pounds 🙃😅", "bigg173": "Super sexy", "yourdreaminblonde": "Omg you are so cute", "nicatmededov045": "😍😍😍😍😍", "greenlionri": "You slay", "darkautumn_photography": "🔥🔥🔥🔥", "_dark_n_handsome": "You're absolutely so sexy and gorgeous as fuck", "stumpycoppedge": "🔥😍😍🔥", "91mala_mi": "👏👏👏👏", "crisewerton_santos": "Yor is beaultiful and wonderful", "elissetha": "Up until I saw your page, I thought that all body sizes are healthy and beautiful. BUT now I realize that fatter is better -> fat = more skin = more space for tattoos = win :-D", "neverl0seyourself_504": "Slayyy beautiful.😍", "muhseger": "Perfect body", "thebralesslife": "Absolutely gorgeous", "pebblesyou": "U are so awesome I wish. I had the Courage to ware a two piece", "schreckwalter": "Sooo sexy ‼️ ❤️ still getting fatter ⁉️", "adoods": "Excited!! I bought a super cute bikini when it was on sale this winter, I'm so ready to finally wear it somewhere other than around my house lol", "i.am.ana.victoria": "Curves are so dope babe💋", "bigbodybreathe": "No. Where do I go ???😰", "keemosobie_.pro": "Your so hot , when you hit the water it starts boiling..", "jasminaelfar": "Amazing picture😘", "undateableblackgirl": "Yasssss honey! You are summer time fine! 🦚", "hengki695": "😍", "t_raw_mero": "Can I have some of ur Confidence Pahhhleeeez", "annathemostawesome": "Im so ready i can hardly wait 😍", "nickeymichelle": "Gorgeous! Love your tats! 💕", "remikokollari": "😍🔥", "chlonnn": "You look amazing!", "kevinao": "You look gorgeous !!", "sunshinebringshappiness": "I'm Hella excited for swimsuit season👙😍 and you look amazing! 😍😍😍", "bratschebread": "I’m about to buy my first bikini in my adult life !! Every body is a bikini bod!", "0jgoh": "You're looking sexy👄", "big_girl_chronicles_": "Heyyyy!! I am Diamond Zhanae, and I have vlog called @big_girl_chronicles_ . I am here to serve the positivit(ea) for the plus size community . So please take the time to check out and FOLLOW my crazy blog and please write in with all your crazy antics so I can share your BIG GIRL Chronicles.", "millereight": "Your skin has such a lovely sun kissed glow", "jns_852003": "This suit looks so nice on you", "koalaity_avocadess": "❤️🙌🏼❤️🙌🏼", "nicolearndt92218": "You are goals!!", "akimithing": "Friggin amazing 💖", "wiisabby": "So cute!", "cook_it_cait": "You're so gorgeous ❤️", "nerdy_nettie": "You glow! I’ve got two bikinis I’m excited to wear while camping and swimming with friends. Honestly I’m a bit nervous about wearing them at the beach. I’m gonna do it, but I’m nervous. Like how to handle people who may make comments, especially in front of my little one. 😞", "emmy97xox": "i don’t even own a swimsuit 😂", "arab_larimi_ali": "Gorgeous so cute adorable dear friend", "nicestofjays": "@fatgirlflow YASSS hunnie!!! I have a black top to strap my girls in and fun asssss bottoms alllll 2019 🙌🏾🙌🏾🙌🏾", "everyoneneedsselflove": "Cutee💖💖", "dodyrousso": "❤️", "93bravery": "I’m so stoked to be in water again too. I’m promising myself I’m going to take advantage of living like 30 from my apartments pool", "sarahjuly810": "You look like you’ve lost weight, did I miss something here?! Either way, you look stunning Corissa. 🤩", "shbpetersen": "I really wish i could shop for a fatkini, but the bottom is always to short so it ends up sitting under my bellybutton and I really just cant do that 😑 Hope to find one some Day ❤️", "fisheyface14": "Fantastic💞", "bishopvesimms": "Can I take a swim with you?😘😘😘😍😍", "_vampyrix_": "Your ink is utterly gorgeous. You are too!", "brandiowl": "I want your confidence 😫", "erikrolley": "Sexy 💯 💯", "rheabean": "Do you find the top of this bikini supportive enough? I’ve had my eye on it for quite some time and I can’t commit to actually buying the suit 🤦‍♀️ what are your thoughts on AdoreMe’s swimwear?", "mzria63_chargergurl": "I wish I had the balls to wear a swimsuit 😭😭", "aportuguesegirlinmontana": "Can't wait to see your swim hauls for this Summer!! 😊", "ginnyatchison": "I get a little nervous about the beach during summer, that's where we go as only live 30 min drive away. I have a little swim skirt which I bought last year and love. Loose skin at the tops of my thighs is honestly not to be embraced and of course, I'm all for body positivity. When I was 100 pounds bigger my thighs were juicy & fat and looked great I felt. But now they are slim but ugly at the tops inside the thighs and it breaks my heart honestly. Same with my arms and tummy! I lost a lot of weight, not because I was miserable being large btw, far from it! But for health reasons as I'm now mid 40s and I needed spinal surgery which they were not wanting to do at my previous gorgeous size. I'm still plus size though a UK 16 and am happy at that! ♥️💗♥️💗", "lauratrad444": "you are stunning", "liz.henry": "I can’t wait to hit the pool this year. I’m also whispering “sooon.”", "kacy2phones": "I have my cute lil suit I bought last year and wore exactly....TWO times! This year I’m hoping for so much more beach/pool/hot springs/lake action in my life!", "yumaratz": "Beautiful photo of an absolutely gorgeous woman. Cannot wait for you to start doing swim suit hauls.", "jordynruth": "In October of 2018 I moved to an apartment complex with an indoor pool (& outdoor too, but it's been closed since we got here). I cannot tell you what being able to go down & swim whenever I want has done for my mental health, but I am spending far too much on bathing suits!!!!", "sapphiresplendour": "This is adorable 💕", "theartistformerlyknownasftya": "Are you going to get more tattoos? They really suit you :)", "fantsypantsanna": "This photo is so cute. Love the suit!", "crawfordlauren0": "I, adore this. You look fantastic! ( this may be the first year I get a fatkini and I am so nervous/excited)", "riosmama90": "You look GREAT!", "vlachance021": "I just got brand new suits from cupshe and I am counting down until i get to wear them!! This bikini is beautiful on you ❤️❤️", "georgecooly87": "Can I pay", "deborah.kinsleysmith": "I really wish I could have your courage 🥺", "rive.ra32": "I'm way too insecure of my body to wear even a one piece but I am excited for the hot weather 💗", "fiwinston224": "Hi you okay", "rafaeltenorio1": "Perfeitaaaa💕", "sayshesclassy": "Cannot WAIT to show off my new scar at the pool and beaaaach", "kristiewithanie": "I have my own huge pool (I really need to organize a Boston area curvy girl pool party) so I got myself a 2 piece tankini for when company is here but when I have no company I just chunky dunk.", "ashleejayeh": "I looove this color on you, so freaking cute!! I took some fatkini pics in the pool yesterday and am honestly obsessed lol.", "kitchen_witch1117": "STUN.NING. 🔥❤️", "bigdiffbabe": "i tried to go swimsuit shopping earlier this month but guess what... none of the plus size stores at the mall had any out. meanwhile, all the stores that carry straight sizes have at least a small section out already lmao", "soph_opera": "To be honest I'm a little nervous, even though I'm normally excited. I had a skin thing removed off my belly in December and the scar is worse than than the original thing was and it STILL hasn't faded!", "oliviamcgougan": "WHERE DID YOU GET THIS SUIT? It is AMAZING!😻", "seachel_85": "This is cute 🙌🏻 love the ‘suit color", "rao1825": "Cute", "myboysmyjoy18": "Yes Body!!!!! You look great!!!!!!", "_theopaque_": "I need pool weather 😭 I need a pool!", "frumpypaintbrush": "Omg you look amazing! One of my goals is to finally wear a bikini this year", "geeashlee": "My life goal is to wear a bikini and feel good in it 😭", "arisbel7": "😘", "goddessofstuffandthings": "I tried today at target but no plus sizes! 😒 to the websites I go! Cannot wait for bikini season.", "pittsburghtrash": "I'M. PUMPED.", "alexandriax93": "Ooh I love that cut of bikini on you! So gorgeous as always.", "grux_crush41": "You look so sexy!!! I love! I’m a 2x and I wish I had the confidence to rock a bikini! I never have worn one. I just had a baby too and I’m so dreading trying to find a swim suit. 😭 You look beautiful and I want this confidence!", "_mississippihippi": "@fatgirlflow i dont know how to push myself through the anxiety of other people seeing my big body. But I want to feel free in a fatkini so badly.", "gmfrogman69": "You are the most beautiful woman I've ever seen!!!! You come swim in my pool you won't need your suit😘", "men.of.size": "FRESH 🙌", "comfyfattravels": "Lookin hot hot hot", "singsforthethings": "You look amazing! Love it 🙌🏼", "mariakaye4": "I'm looking for a good suit now☺️", "kyle.bates.378": "So sexy", "joeyjo422": "Hell ya! Got a new bikini for my honeymoon!", "maggiemcgill": "Seeing you at the pool brings me joy so I’m also looking forward to it!!!", "kruthp18": "Have never worn a bikini (tanking wearer 4 life) and wish I wasn’t so nervous to wear one!", "sandason77": "🔥🔥", "tiffany_fetzer": "Damn I wish I looked like that in a bathing suit, you look fantastic!", "elismar.silva.5015": "😋😋🔥🔥🔥", "liblibby": "I started looking at swimwear just today! Old Navy has some stuff that I’m obsessed with!", "luellaarbre": "Nothing has caught my eye yet but I can't wait to get new swim😭", "lovepassos": "You are gorgeous and inspiring ❤", "o.hhhok": "Where did you get your bikini?", "heather.next.door": "You look amazing in this picture! I love it😍", "fujowkid": "Absolutely gorgeous", "venutianbeauty": "Got myself a fatkini for the first time in my whole life. Gonna try to rock it at the beach in May. Full on fat mombod for all the world to see. Eeek", "matthew.winston": "Beautiful 🌹", "hurricanehal_": "I was gonna say “you tan already!!!” But then read caption. SOON!!", "garciavegaaa": "You are such an inspiration to me.", "typhoidtaylor": "the pools at several apartments in town are already open.....", "q_strom_99_walker": "Sexy", "sydstrickland_0": "any one know where this swim suit is from??🤩 @fatgirlflow"}