{"mariasofola": "Powerful ❤️🙏", "xl_yoga": "Lovely!", "annachubbybanana": "I’ve been experiencing the same thing as I just turned 30. I like that you say you still do self care, it just looks different. It’s hard not to judge my current self care on what I used to do!", "journeytocenterofbody": "Wonderful post! Thanks for your honesty and openness. I’m older than you and agree that aging is a bizarre process! And it’s hard to appreciate the person you were but still work hard to leave so much of that person behind.", "em_bot_9": "So beautiful, thank you for sharing🔥", "the_broken_bard": "Thank you. <3", "mrscarpenter_est2015": "I am 52 and yes I dont wear makeup. I dont paint my nails. I am happy and content. I have found peace and its wonderful. I love the life I have grown into.", "amy_sandford89": "100% me. Btw you look fab! I wish i had your confidence.", "charlottekessie": "@_helendale we’re making space for who we’re becoming", "moonbeam.gardebring": "✨🙏🏽🙏🏽🙏🏽💗💗💗✨", "cya_thia": "Been feeling this at 33. Trying to remember that change is normal and not to be afraid of aging... I never thought I would fear growing old, but be it nature or nurture, I can’t help but stress out. So basically, these honest posts help me feel normal and thanks 🙏💖", "xavierbourgeais": "Sublime 👍😍👍🇫🇷", "dawnym_27": "I’m 47 & still growing up! Just heard all you said loud & clear! 💯🙋🏻‍♀️👏🏻", "_dark_n_handsome": "Mmmmmm gotdamn, looking so yummy, delicious and scrumptious naked", "gracetibbets": "Still freakin hot tho 😏", "franciscoalmonte713gmail.com_": "Ufffff 🔥🔥🔥🔥", "damainballa": "Love ur body!!!!😗", "michael.joa1966": "💋💋💋😘😘😘😘😍😍😍😍❤️❤️❤️❤️❤️❤️🔥🔥👌👌", "lcrespojr": "Omg wooooowwww yummy and delicious 🍒🍆💦👅🔥", "mswd.604": "😋😋😋😋😋😋😋😋😋😋😋😋😋😋🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️❤️❤️❤️❤️❤️", "am.irhosein1963": "👙👙👙👙👙👙👙👙👙👙👙👙👙👙", "goran7698": "❤️❤️❤️", "solimanmohamapor": "😢😍😢", "djbigkahunadj": "Baby girl do you.... And know it is appreciated the way you share for us..... Ty lovely", "fatterinpersonn": "🙌🙌🙌🙌", "dianerbananers": "Yas! I have had the same thoughts lately. I will be 33 in a week and compared to 5 to 10 years ago my hair is cut short, I don't wear makeup on a daily basis and my idea of self care is snuggling up with my wife as our son plays with his cars next to us. Growing up is definitely weird.", "foxxispade": "So true..thank u for these beautiful words💜💜🌴", "audrey.grim": "I've been feeling this way, and I really needed to hear this. Its self care, just differently", "strangebitchcraft": "you are so strong and such an amazing inspiration. you’re gorgeous as fuck and such a badass! 😍", "mcneil.jennifer": "I love everything you said. I always took baths and then at 33 I just stopped. I am 46 and just found the peace in a bath again. Thanks for the reminder that change is growth, it's good.", "soul_cookies": "I love that. ❤️", "shavanzar": "Such a lovely,sexy and beautiful looking woman.", "swimfreelittleminnow": "Thank you for this. 💋❤️", "marvamaker": "Growing up is so very weird indeed but so full of love and adventure. Glad you are embracing the wonderful parts of getting older. Too many people focus on what the left behind and not on what they gain with age. I am 54 and my life has more love and learning then I ever imagined.", "omarcisse60": "Véri nice", "fujowkid": "Gorgeous body", "cait1920": "Perfectly put, I really needed to read this 💕", "fliss_sews": "Thank you! Though I was never one to spend much time on my appearance some days I question it. I am a teacher and I rarely wear makeup, I try and think would a man be worried about these things... if it’s No I stop caring... I am 38 in a few months....", "izzatsirwan": "Wow very nice l like Ass you so much 🔥", "keeblagangsta": "You just realize as you get older what is important, also as I've gotten older I feel like I have less time for such things. Our job on this planet is not to look aesthetically pleasing to society ♥️", "tony_truelove_1979": "Beautiful", "allymilleroo": "it just looks different now....I love this!! xx what a stunning photo xx", "michelleriddle": "Wow, I totally relate with this post on so many levels. I use to bathe 2xs a day with no exceptions", "taftchrista": "Do you have plans for any more tattoos?", "anoopbhagania": "😍😍🔥🔥", "kennedirooth": "This is so gorgeous. I love your words.💚", "thelifestylelab.co": "I’ve been feeling the same the past few years. I’m 24 and it seems like I see my highschool photos and think that I used to take my self care much more seriously, but when I think about it for real; I take much better care of myself now. I allow myself to heal, and play, and get dirty with adventures, and laugh until I can’t breathe. My hair, skin and nails have never looked messier but I’ve never loved them this much. Beautiful post Corissa ♥️ you just made my sunday morning! I’m still waiting to hear back about the 10 day body wellness challenge. If you still want to join, I’d love for you to be involved!", "aff_aff.aff91": "That’s too much sorry", "irenevgn": "You re perfect! ♥️", "jessshc": "I still do all those things cuz thats what i like and what gives me self confidence. Do wtv the hell makes you feel good girl. If not doing those things make you feel good... its all about how u feel!!!!!!", "live_and__let__di": "This totally spoke to me. Change can be bittersweet. My care time is early mornings with coffee on the deck, under the umbrellas, planning the next garden adventure. And you reminded me I desperately need to make an eye appointment. Beautiful post", "seahunter12345": "I let myself go because I had children and I work and I'm bloody tired because I haven't had a full night's sleep in over a year.", "sadk74": "💗 Thank you for sharing this!", "noahboltonn": "@katelynjohnson._ 🤤🤤🤤", "just_this_chick": "Thank you for this. Growth is development, for sure. It looked different to everyone. 💜", "vip_remont22": "😍😍😍", "rightdailyself": "Oh my gosh. I'm already dealing with all of this and I have been in my early 20's!!! It's so harddd", "xoxoevi.805": "I so relate to this in every way ......", "sareencat": "Oh yes how this resonates!! At 21 I was always fully made up and coiffed, matching underwear sets, literally polished to a tee. Went a bit grunge look late 20s cos I was at uni, handbags and full face makeup weren’t the thing, fast forward to my mid 50s and self care looks like no dieting or weighing myself, eating well, moisturising and either going bare faced and loving it or going full on with lashes and all!! Choices", "estrela_ak": "Such a pretty picture 🌼", "butterfly_9512": "😇🙏🙌😇💋🙏😇🙏💋", "whineanddice": "I love your feed. You are so inspiring and always help me feel better about the things that bother me. Stay strong, stay beautiful and keep being you❣️", "joan_parsons1": "I feel very seen by this. A fellow 34 year old woman taking care of herself.", "richard_phi": "😍🔥🔥🏆🏆😜😜😋😋😋💋💋", "hjwdewit": "Great picture with the nice fall of the light.", "kadem.alkaesar": "👄😍😍❤️❤️♥️💋🌹📞🔥📞📞📞📞🔥🔥🔥", "miss_smitten_kitten": "I needed to read this. Thank you. ❤", "uncx270": "Your Sexy sweet Body is a dream 😍. My dream💋💋", "suzisim11": "Thank you 🙏🏻 I’ve only just clocked onto this same sort of belief myself! Living to be happy 😊", "k917p": "My 😍", "mrs_grangrade": "❤️🔥🙌😍@fatgirlflow these words are forever trapped in my heart. Thank you for sharing because I understand exactly what you mean.", "marsyhoops": "I needed to hear this today. Thank you 🖤🖤🖤", "skrillaking420_lee": "Very sexxy beautiful👸🏻@fatgirlflow", "lucielaroussedraws": "What a gorgeous picture, I really feel your words. Self care has changed for me too: no makeup most days, comfier clothing, I'm not trying to please anyone but myself with my appearance and it feels fantastic", "jungletiger160g": "I understand and it's amazing to see you bloom into the wonderful person you have become I love you and J you both are awesome and wonderful together love and kisses to you both😍💞💋💋", "filigreeandstone": "I think we need to look at those words more literally. “You let yourself go” let them sink in and resonate. And think. Yes!! I let myself go in different directions. I let myself go be who I really am. I let myself go free!", "hey_gagici": "wow this is absolutely beautiful, you words are amazing and you are just as gorgeous. I never even thought of seeing it that way. don't get me wrong i.m still a kid but this is extremly profound and reassuring. Kind of eyeopneing for me at least, thank you❤❤❤", "nigelrudkinart": "This is an incredibly thoughtful and reflective post and a beautiful, gentle image", "mery.magica": "Bellissima", "naughty_inappropriate_mum": "Love it ❤", "jazz_tafari": "In love with all of this 🙌🏼💕", "felipechiquito4gmailcom": "Muy bella❤️❤️🔥❤️🔥❤️", "hoquqzan": "Ê", "hichemspain": "Ohhhh yes yes yes", "bigbodyskii": "Can I join", "awholestory": "Needed all these words so much, thank you ♥️", "ameathyst_e": "So beautifully said", "lindsay.marconi": "I did the over-the-top body care routine too and I let a lot of it fall away. It’s exhausting and I can’t keep up. Now I try to think, “Who is this benefiting?” and if it isn’t overwhelmingly me, I’m gonna have to pass.", "kindofdelightful": "I’m 26 and feel this on such a deep level.", "ki.cas": "This is so beautiful", "tabbithap21": "Thank you for saying that. It's what I needed to hear right at this minute. Blessings 💕", "hanruth28": "So true. I used to get excited over new make up, now I get excited about a new kettle or toaster! What we need from life is always shifting. I think the older we get the less we people please and the more we prioritise what makes ourselves smile x", "stephaniebrookbank": "I feel this so much. I'll be 35 this year and I have changed how I take care of myself so much....being a mom is a big part of it.", "elle.naturelle": "🙌🏾🙌🏾", "cierraswall": "You’re fucking inspiring. Period.", "witchynerd": "I hear you, I see you, I feel you. Getting older and seeing yourself change is strange.", "trarondaa__": "That was lovely. Thank you so much for sharing.", "foggyballoon": "Uhhhh I let myself go and I'm 18 lol. But I have my life together in other ways. My hair isnt done but my homework is. My shoes arent polished but my resume is. I've prioritized, like you.", "26kleisen": "Good choice to dare to change your ideas. 💪", "julirama723": "I initially thought the same thing about myself in my 20s vs in my 30s... but then I realized that for me, it was actually more of an acceptance of who I truly am vs performative femininity to offset my fatness (which can be construed as masculinity.) I no longer feel like I have to do X, Y, and Z to pass as acceptably fat. I’m not saying that it’s wrong to want to have nails done, hair done, everything did all the time... I’m just saying that for me, it wasn’t authentic. You don’t owe anyone an apology for the fact that you’ve changed and you’re presenting yourself differently to the world. You’re still worthy and deserving respect and you’re still hella beautiful as far as I can tell. ❤️✨", "cheeky_snowbird": "It’s more than ok that you share. It makes my world a better place. 💜", "nervousinjuly": "I like this message a lot. I feel like we really change our actions to fit our needs as we mature. Love the part where you talk about planting 🌻", "bleedingheartsworkshop": "Loved and related to this but hadn't found the word for the feeling until I read it. Thank you!🙏", "femmebeeating": "I definitely feel this. Same.", "spoopykitty": "Beautifully written.💛", "divajeanine": "Yes! Beautiful and heartbreaking! Thank you for putting that feeling into words! #41isthenew41", "aubstock": "In my 20s I was on a every 3rd day shaving my whole body routine. Now I still shave my legs but rarely and shave the pits but the rest is au natural!!", "amanda_marie_lockett": "It is and then suddenly you’re just not the same person anymore... you evolve and set boundaries and stand y’all in your beliefs. It’s a very freeing process. Google the “emotional scale” very eye opening 🥰", "garciavegaaa": "🙌🏾🙌🏾🙌🏾", "kelseahabecker": "Love this. So good.", "abas.rezaei.ir": "👄👄", "sarahontheisland": "Such a beautiful statement. This is so true. I happen to think that you are incredibly beautiful, and a big part of that comes from how much you let who you really are shine through. Thank you so much for all of the light and honesty you share with the rest of us.", "axcxmx": "This makes me want to cry because I'm constantly telling myself that other people will think I'm trash if I don't do everything to \"look good\". Thank you for reminding me that I'm still worthy of compassion and love when I don't have the energy to do them. 💕", "lara.jane.ny": "I love that we always happen to be on the same journey at the same time. You’re a goddess, all the more now that you’re letting it come through without the trappings we felt. I can’t believe how much time I used to spend blow drying my hair! 🖤", "tanyaenfuego": "Growing up is weird, thank you for this!! ✨✨", "chunky.trash.panda": "@fatgirlflow I feel this so much ❤️❤️", "radically_ky": "Perfect", "bbgulrot": "Real 💖💜🌳", "peepalfarm": "Yeeeesss! 🔥 I just turned 30 and spent some time reflecting on this. I started to panic but then I realized...my priorities are different. And that is a GOOD thing! 😍 my priorities now blow my 21 year old ones out of the water 😁", "duskonig": "Doesn’t matter if we’re okay with it. Your page, so you get to do what you want with it. But love this. Love all of this! Find what works best for you and be that! (As long as you ain’t hurtin’ anyone, of course.). Do you! Be you! Thanks for sharing!", "anip6262": "Miss you my dear chubby 😍😘💕💋", "metallicleoraa": "If all of that didn’t happen in your thirties, you definitely wouldn’t be ready for how things are in your forties. 🌸", "marlytrumpet": "😍🔥😻", "denisereiland": "I feel this!", "alessandro7280": "😍😍", "ravvan54": "Fakn", "kellcat2go": "Girllll, You give me strength!🌹🌹", "jlow9395": "I would love to know you?", "renaazpeoplez": "🔥🔥🔥👑🍷", "littlemissesvee": "I needed to read this. Thank you", "benzoxo1215": "I adore you and couldn’t agree more. 💕", "aelienshe": "Growing up is weird, and kinda great. I'm here for all of this.", "journeyofcurves": "This caption is EVERYTHING. Thank you for this beautiful reminder. ♥️", "momismakingit": "Not going to great lengths to meet the unrealistic beauty standard set by society is not letting yourself go. It’s letting yourself BE.", "samantha.slopes": "💕💕💕", "lizply": "Thank you for sharing this. I’ve been down on myself because the amount of effort I’ve put into my appearance has changed over the past few years. So the thought that maybe the way I take of myself has changed because my priorities have changed helps me feel so much better. 💕", "abbyyy.alexandra_": "Absolutely LOVE this. Thank you.💕", "kassem_arfin": "Wow💋💋😍😍", "fancy__necromancy": "I love your shower & this definitely resonates with me. I'll be 33 this year & I'm just like ,\"how did I get to be do awesome?\"", "xxmisshannahxx": "💜💜💜", "brandongist28": "Sexy belly", "_sara_jane_77": "nicely said 💜", "willteachforbooks": "I can not love this post enough!❤️", "fluffy_bunny_1117": "❤", "iglesias_yoselin": "I felt how raw this is. I love this. Thank you❤️❤️❤️", "_geralartist_": "I have a knot in my throat from reading this. I didn’t make these connections before", "chadroyroyster": "💯", "healing_nourishment": "Wow, I needed this so badly. Just today I was looking through old photos, even from a couple of months ago, when I would do my hair and makeup everyday. I got a haircut that didn’t take any styling, I’ve made space for a slower morning instead of doing my makeup. I’m just in a season in my life where these things aren’t important to me at the moment and I’ve found a lot of freedom and love in that.", "juicyjayfox": "Soooo weird. I LOVED THIS. I turned 30 this week and have been dealing with the changes. Also god I want to post a photo like this sooo bad. You empower me ❤️", "suzannaholguin": "❤️", "vincentboere": "❤️❤️❤️😘😘😘😍😍😍😍", "eatheptravels007": "Absolutely precious", "sumajanedark\nVerified": "Verified", "kimatthecreek": "Growing up is super weird.", "liblibby": "I live for this shit. I love the way that aging sloughs stuff away and leaves a clearer vision of who we are and what we love. 💜", "sierra_whitfield": "That’s what matters girlfriend YOU GO BOO", "croyster912": "Growing up is weird and hard and beautiful!", "jennifer___diane": "Oh how I needed this today! 💞", "mary.elizabeth.mcg": "This is so comforting and inspiring. I love this post so much", "adoods": "I feel this HARD. I keep repeating a song lyric I love, \"time can't leave you the way it finds you,\" when that voice creeps in comparing myself today to who I once was. Growing up is so weird & so beautiful.", "jenny1116": "Saaaaame! This was really beautiful, thank you for writing it ❤️", "alwysleepy": "I must be letting myself go at 22 lol but your words are so beautiful. Always leaves me in awe.", "chriscrawford71592": "Being a grown up is so bizarre and painful and lovely aind wonderful. Its just one of those things that No one can prepare you for and it's just such a pain when it hits you full force. I'm gonna be 27 this year so 30 is on the horizon. And I see folks like you just going through it and accepting all the good and bad that comes your way and it's so inspiring. I'm a lazy ass most days but when I do get stuff done it feels like such a huge exhausting accomplishment. And I'm getting grey hair. And I've gained weight (which my whole family is on my ass about) and I'm changing! Maybe for the worse, hopefully for the better. But you and J are just so honest about all kinds of Shit. And all of life's ups and downs can be insane but you two take it in stride. That's amazing and important! ❤️ you guys so much.", "losangelesmidwife": "Thank you for sharing this— it’s beautiful!!!", "bonnie.m.f": "This is beautiful. I was gonna skip the post honestly, cuz the all too familiar body made me uncomfortable (I have issues a plenty, as well as rolls.. ) but your words are divine and I had to stop and thank you for them 💜💙💚", "manaworks": "YES👏🏽TO👏🏽THIS!👏🏽", "ali_hudson_": "This is so relevant and beautiful ❤️", "plussizebarbieofficial": "Beautifully written", "pheonix6560": "This is so relatable", "rodriquez78": "Thank you for this❤️", "inthemiddleofnowhere31485": "Self care and self love are different from person to person . I think as long as we take some moments for ourselves we’ll be a okay .", "javabarfies": "Thank you for this", "midwest_hippie_chick": "Yes to all of this.", "anglerfishanglerfish": "Yes yes yes. All of this. ♥️♥️", "chamomilf": "What an incredible passage. Thank you for this.", "shelly_m__brown": "Well said and so true.", "letsdosomethingamazing": "This is amazing, at 30 i’d give anything though for a bigger tub to just soak in like twice a week though. 😭😭😭", "comfyfattravels": "Youre such a magical beautiful being and just fucking brilliant", "hossamhassan577": "need lick this stomach", "penguin_gloglo": "As we age our needs change. And as long as YOU feel recharged/loved/secure/peaceful/mentally and physically healthy, then THAT'S what self care means to you at that age. And that is absolutely nothing to feel bad about.", "maadeleinesophia": "I ALWAYS appreciate how vulnerable and raw you are. 💕 Love seeing it 😘❤️", "jwmurray47": "Such a beautiful body", "carolinecatlin": "👏👏👏👏👏", "kelliclash": "@fatgirlflow This is exactly how I am right now at 34. Well said.", "jcoop8484": "Love! Thanks for sharing!", "vbecky06": "You're perfect ♡", "jadediana86": "Lovely", "deepeyeroll85": "The shift from caring so much about how it looks to other people to what love looks like to YOU. 30s will do that for you if you're lucky enough.", "teacrumb": "At first glance, I thought this was a picture of an ancient fertility goddess idol from a museum. 😍", "alysonmcc": "I’m so lucky to be able to grow up with you💜", "tlherglotz": "@fatgirlflow Best description of growing older, ever! 💝", "lilahskye": "🙌💕", "betsywrites": "You inspire me. ✨", "artistshelleymouber": "And it continues to evolve- I’m almost 50 and the daily struggle to remind myself that it’s ok now to love myself is real. All of the ppl that criticized and shamed me (family) are gone so trying to retrain my brain. But I love myself more now even though I don’t curl my hair or get mani/pedi etc- so I totally agree. The kindness we show ourselves will provide the base for your future ☄️🔥☀️🌈", "jenponton\nVerified": "Verified", "joeyjo422": "Growing up is super weird. I'm almost 30 and my hips are getting bigger. I feel tired more easily. Growing up is awkward.", "spiritplatypus": "Love all of this.", "shannonkardassh": "This is a really gorgeous photo doll💖", "daiquiri.king": "This is really beautifully written! thank you for sharing ❤️", "q_strom_99_walker": "Sexy", "shellybo": "I’m almost 36 and this really resonates with me. 💗", "yumaratz": "We all change what we do and think. That's just a part of the journey.", "nailsforqueensnyc": "I turned 36 in January, and IT ME. 🖤😱"}