{"fostermamaeva": "You crack me up!", "sayshesclassy": "I needed an auntie like you when I was young! So amazing who you are for these babies 👏", "venustusphotos": "In my son’s classroom once a kid came up to me and said “your belly is big!” And when I responded “I know, right?” he was visibly shocked.", "imaliteraljoy": "👏👏👏 YES! LOL you're so adorable ❤ 😂 you're an amazing influence on those kids and fuck anyone who says otherwise", "hannah._.joxoxo": "My five-year-old nephew from the time he was three until now has always commented about how big I am. My sister, his mother, is a very petite and short woman, I am very tall and plus sized. To him, my size is cool. He always told me that I am a “big girl” and I always tell him “thank you”. I know that he is not commenting on my size because of my “fatness“ but because I am very different looking from my sister. Kids will always be curious and honest with the things they say, my nephew has never once said a hurtful thing to me about my body or myself. I know he loves me and that I’m his coolest aunt😎✨💕", "woahphelia": "This made me tear up a little. Love ur work and ur cute beach ball belly 🏖", "lawsontl42": "A friend’s little girl once said, out of nowhere, “You’re fat.” She was not being mean, it was simply an observation. Before her dad could freak out, however well-meaning, I replied to her, “And you’re not.” That was the end of that. She went about her business. That day, at least, she didn’t learn that fat was a bad word.", "chelsieriot": "I couldn’t love this anymore 💕💕💕", "fatgirlfierceness": "🙌🏼 I think about this frequently with my nephew. I hope as he grows he never thinks fat bodies are bad or gross. I will never talk negatively about my body or fat around him. I hope it makes a difference.", "melony_smellony": "Can only become more clean with more pee!!! #ammonia", "nsbchick": "My youngest nephew always jiggles my belly or my arms and says \"auntie Ash why are you jiggly, do you have jelly inside?\" To which I always reply \"No, bud my jiggles are made of watermelon sour patch kids.\" He thinks it's the most funny thing, and now his jiggles are made of gummy worms.😂♥️ Its a weird thing but when you're trying to teach that bodies are ok at anysize to children, who observe everything making them laugh is a good way to instill that mind set. Because they will always remember those moments that made them laugh.", "finethick_madam2412": "This! 😍😍😍😍💜", "ale_71281": "💖", "bigcleanbeautyqueen": "Love this!!! When I first wore my \"Fat Babe\" shirt my sone said \"Mom, you're fat!!\" I said \"I know! Isn't that awesome. 😊😊\". I was always so afraid if the day my kids realized I was fat. So I decided to make sure they never felt bad for being honest. We talk about all different shapes and sizes and what people look like, but always in a positive way. I tell them I love how soft and squishy i am because its more fun to hug them. 😊 I emphasize that our bodies do not define our worth and that no one person is better than another. 💚💛💜", "kate.thecursed": "What a beautiful story, thank you for sharing ❤️", "ginnerbot": "💞💕💗💗💗", "missautumnatic": "Love this and you. The 6 year old I nanny once referred to me as a \"chubby little hamster\". I'll take it 😅", "va.va.vieve": "I think it’s beautiful and healthy to teach youngins to love, respect and enjoy people of any/all size. By normalizing it we’re removing the stigma and hate. I can only hope more people will do the same with their children. Then maybe one day this world truly will be a better place. 💕", "motinuss": "PREACH THIS", "p.linkola": "Should we quit warning kids about crack cocaine, slippery ledges, and hot stoves, as well? I guess not, because that wouldn’t necessarily help you paint your gluttony as something virtuous. SHAME ON YOU FOR TRYING INFLICT YOUR DISEASE UPON CHILDREN! YOU ARE DISGUSTING!!!", "doingyourbestwhiledepressed": "this was cute but I’m 100% judging anyone who pees in the pool 😂😂😂", "mrsinghcouldnotcareless": "Those kids are lovely", "hippieambervintage": "I wish I would've had a role model like this growing up.", "shesjustbeingashley": "Kids are the best!", "littleblue_s": "So much yes to this❤️😍", "chardoiron": "My kids say the same to me! They talk about my big butt 😂 and I say \"I love my big butt! I am always comfortable!\" And then \"if we all looked the same life would be so boring!!\" 😍", "callan_rush": "Awesome", "taylorkendal": "My nephews tell me that they love my ‘squishiness’ because it means I give the best cuddles. It makes me feel so warm to know that they don’t judge me and love every bit of me. And just the smile on those faces say that your little boogers love you so! 😊❤️", "erica.jo.41": "My whole family is larger. When my son was little he would tell people that \"fat\" was a bad word and would scold them. He had never said one rude of hurtful thing to anyone about their weight. He is such a loving and accepting child!!", "wrtrgrl77": "❤️❤️❤️", "lorakgrady": "I love this. The other day, my niece saw my @fat.mermaids T-shirt that says \"Big Belly Energy,\" and when I entered the room next to her, she ran in front of me and threw out her arms and shouted, \"Presenting the beautiful big belly Yaya!\" I've never been so proud.", "dee_vorah_": "😍😍😍😍😍😍 yes!! My daughter always says my belly is big when she sees it and I tell her yes it is and that's okay, and I let her know that bellies can be big or small or in between that its okay and that no matyer what we are still beautiful. I was not raided like this I was raised with someone always commenting on my weight pp", "rachfriend": "YES love this!", "hamadi_knt": "❤️❤️❤️", "alexisdavinalove": "F#$k yesss! Love this so much.", "mail.britton": "The group I have begins to hug me longer, embrace who I am as I embrace them. Sadly, every year I get a few parents . . . We all know that long up and down look. I use to go home and cry after that look. Now, I thank God I have the courage to \" expose\" children to the person I am not the person some of their parents see. I Subistute teach now. Making more than I ever have. I walk into a room filled with \"she is so big, she is moving\". By the second hour. . YES Ms. Britton! I need your help Ms. Britton!", "fatfeministmich": "How precious they are, and so lucky to have you as an aunt! ❤️", "iederedageenbeetjemeer": "❤️", "qrida1": "Very true, we ALWAYS tell our children \"Don't listen to ANYTHING negative someone says about you! You know who you are and you know the TRUTH!\"", "littlekorina": "I’m auntie Koko too. 💕", "gerellynne": "❤❤❤ I love this! Kids are born to love... people are taught hate and intolerance. I love to see loving people teaching children to love others of all shapes, sizes and colors! 🤩🤩❤❤❤", "kndickmann": "Preach!! 🙌🏻🙌🏻", "kimmaandco": "Look at all that JOY! ❤️", "jacqueline.anzalone": "You are a sparkle my dear.💗🙌", "amandad7": "Love this! My 6 year old daughter always tells me how soft and squishy I am! But she says it in the most wonderfully endearing way; “omg I can’t stand how soft and squishy you are!” As she hugs me violently like I’m a loved and comforting body to her. Let my body always and forever be a comfort to her ❤️", "cuddlykat": "Yes, yes, 100% this!! Normalize real bodies in real life 👍😍", "magdushka80": "Absolutely well said! True words. 👏👏👏", "krissonfire": "This is so funny, because just yesterday my cousin’s son was telling me “you’re not as tall as daddy” that’s right bud “but you’re bigger than daddy” yup, that’s also right. And he just like... had to take a moment to let it process 😂", "earthtoamberr": "I love this! I couldn't imagine being the me I used to be. The one that would hide in shame if a child mentioned my size. My 5 year old loves my belly. He loves how squishy and cuddly my fat is. He even tells people \"my mommy has a belly like a bowl of jelly\" and gives it a big hug.", "find_me_in_the_future_": "The “Pee Pool” hahahahaha", "angelic._brat": "YES!!! ugh 😭💖", "jamieannie030506": "I absolutely LOVE this! My kids have grown up with me being a fat mom and they loved cuddling up to mom's squishy comfy belly. I miss those days as they're now teenagers!", "spacerockette": "I think you're showing them not to hide and to be kind and loving to themselves and others. I show my son my belly every chance I get. 💜", "gollybrittany": "being an aunt is the best. 😊😍", "tant_feminist": "Word! 👏🏻👏🏻👏🏻👏🏻", "ehlillingston": "We all need an Auntie Coco tbh 😍💕", "mominthecloset": "@somewhere_under_the_rainbow trust you do want one of these pools it has been our go to every year of my kids life and quite literally will fit a lovely adult floaty top to bottom and allow you a lovely refreshing day in the sun😂🥳♥️♥️♥️", "26kleisen": "👏🏻👏🏻", "rottenoranges": "So well said girl! You’re super inspiring 💫💛", "emma_p_pinder": "Judgement and prejudice are learnt behaviours!! My mum used to get me and my sisters to hold our breath around \"fat\" or \"ugly\" people so we didnt breath their germs!!!! I never even realised how fucked up it was til i was in my late teens!!!", "melissas_bumpy_road_journey": "Yes yes yes and yessssssss 🙌💕", "kimburrzz": "This is so true! My neice, was 3 at the time came up to about year after my son was born and said aunty you have a big belly! And i said i know isnt it beautiful! Your cousin lived in this beautiful belly not to long ago, its amazing and beautiful. I hope that she remembers that and see beautiful in all things.", "moxiemomma1415": "My daughter says she likes my tummy because it’s soft and cuddly. I have distinct memories of laying on my moms big, soft tummy and arms. It was the most comforting place to be. I always saw my mom as mom...not fat.", "mein_wollkorb": "I laughed so hard. 😆Thanks for being so open and honest. 😘You are absolutely right!", "copperkilt": "I love you", "janessasary": "😍😍😍", "laceyj5567": "I teach preschool/toddlers and every time I try to be honest about my body size/the differences between me and my straight size co-workers people get so uncomfortable! They always say “haha no you look good Lacey.” I didn’t say I didn’t look good I just said I had a big belly!", "divina_proll": "The then three year old daughter of a friend once said to me: you are fat. And i replied: and you have brown hair. We both liked it. My friend was disturbed, for she wanted to lesson her \"don't say that, that's rude. \" what makes this rude is us. The simple fact is just an observation. But telling young kids that this is rude tells them that they can hurt someone with just this simple fact. We talked about this quite long and this young lady and i have a special connection nowadays.", "swansons.lawrence": "This.....I want this caption on my store windows!!! Thank you for making the world a touch better!✌🏻", "somewhere_under_the_rainbow": "Yes yes yessssssss to all of this - including this inflatable pool that I need in my life asap!", "artistshelleymouber": "You’re the path to normalizing ALL bodies...those people are ignorant but they will learn. ♥️", "just_call_me_s": "Love love love this post..... yessss sis 😍", "sarahmannxo": "This has been so important to me since my niece was born. She’s only 1 and a half, but I don’t think it’s ever too early to ingrain in a child that they are beautiful. I want so much for her to not grow up being ashamed of being bigger like I was. I don’t want her to have to hate her body for 20 years before finally learning to love it. She’s going to grow up knowing no body is created equal, but all bodies are created beautifully as long as her aunt sarah is around. THANK YOU for this!", "yamalo17": "I love this so much! I love the pureness in curiosity in which kids ask questions. Like friends kids who love to lay on me bc I’m fat & squishy & comfy 😍🤣❤️. A long time ago it would bother me but now I realize it bothered me at the time bc of my inner fatphobia. My fatness is good & not bad! And kids instinctively know this❤️. Thanks @fatgirlflow for showing this ❤️❤️", "dezziqu": "I call my daughter coco ♥️ also my kids have only known me as fat and they love to jiggle my arms and legs ... Like just casually walk over and start jiggling me .... My middle kid whines *it's just so fun* when I tell them to stop 🤣 my oldest taking pictures Christmas morning had me so disgusted with myself but I realized .... He doesn't see my belly hanging out of my jammies ... He sees his Mom opening the gifts he took time to pick out and spend his allowance on ... And when I'm gone he won't look at the pictures and think wow mom was fat .... He will remember the feeling of those moments", "discovering_kay": "You're not a terrible influence at all you're a great one by living your life and loving yourself, it's people that hate the way they look and harm themselves because of it even being skinny. So being just who you are, you're doing great and can definitely save a life by them looking up to you", "jdellen": "Love this!!!! 💖💖", "meg___8": "Omg love!!! You are an amazing, beautiful, kind, compassionate influence!", "samdylanfinch": "This gave me so many feelings. I grew up around fat folks who talked about their bodies like it was a plague that I’d eventually succumb to. I became anorexic so early on in life because there was this endless stream of “”warnings”” from everyone around me. I do wish I’d had a Coco of my own to let me know that I had nothing to be afraid of, and a full life worth living and a body worth honoring. I hate what this fatphobic culture has done to the people I love, and I hate that so many of us have inherited it over and over again. Thank you so much for being what the world needs. I know it wasn’t a peaceful road to get to a place where you could be, and I’m in awe of you and grateful for you. ♥️♥️♥️♥️", "quirkyfashionsandcollectibles": "Message😭😭", "klare_voyant": "I tell my sons that all bellies are beautiful bellies and just like people they're all different. ❤️", "maggiemcgill": "This made me feel all the things ♥️♥️♥️ I wish I could see my nieces more to normalize my fat bod.", "randaatho": "I love this SO much!!!", "divadelux": "Where did you get this cute inflatable pool? 💕🌊", "_sophiack_": "Love love love", "lauralew83": "😍😍😍 I love when my kids mention my belly. And my squishy bottom", "brielleranae": "🙌🙌🙌", "carrerasauruswrecks": "When I fist started working with children I remember being super hurt by them asking about my big belly. And then I realized they hadn't been conditioned to hate fat yet so it was just an observation they were making. I'm so glad I was able to come to understand that because it made it so much easier to educate them. \"You have a big belly.\" \"Yes I do. Some people have big soft bellies and some people don't. All bodies are different.\"", "hispaintedgirl": "I love this!", "anneandkathleen": "I love this so much! So sweet! My nieces are my world and I love knowing they get to see someone with a disability and know that it’s normal to be different. 💛💛💛", "fashionschlub": "All the heart eyes for you for this! 😍😍😍", "_theopaque_": "Yessss. I’m the fat person for my niece. She often asks me “neisa? Why are you so fat?” And I reply “I’m just made like this.” And then she smooshes her face in my belly. She likes to play with my arms and jiggle my bum lol. She loves me and my hope is that that love for me, translates to a love for other fat persons as well as she grows🖤", "jelisawuzhere": "Is this the one from wal mart? Mine deflated but it was so much fun while it was up!", "mother_of_the_wolfman": "👏🏽❤️👏🏽❤️👏🏽❤️👏🏽❤️👏🏽❤️👏🏽", "croyster912": "Beach ball belly ❤️ it. Yall are cute", "nomeames71": "@fatgirlflow you are so inspiring", "q_strom_99_walker": "Nice", "dancing_baker_": "I feel like maybe the biggest lesson is that Aunti Coco loves herself and believes in herself and is beautiful in many ways and accepts herself just like she accepts the babies the way they are, pee pool and all!", "yumaratz": "Girl! You are speaking the truth!", "pizzaeatingdino": "@dragonflyordie", "111mph": "love you so much it hurts", "ipostshit369": "I’m a chubby Moma and auntie, (my sister is a runner and super fit)I absolutely love this post! My nephews love me as is, and hell, I’m fun, silly, and give zero f*cks. All bodies are amazing. Thank you for being such a positive voice 😘", "ladyfreelove": "Yes! I always try and refer to my belly as “my beautiful belly” around my daughter so hopefully, she’ll grow up always thinking hers is beautiful too.", "sumajanedark\nVerified": "Verified", "mama_trum": "My daughter says she wants to grow up and be fat like me because she likes my belly and it’s fun to snuggle it. 😆😆", "cattoos_tattoos": "To them aunt coco isn’t a dress size or a weight,she is a grown up who will be silly with them,make them giggle til they hiccup or snort or both,and will always love them whether they are fat or thin,gay or straight or any other person on the wonderful spectrum of humans ❤️(Hope this makes sense)", "thia.orr": "I have the same pool for my 3 kiddos. I get in it with them and I'm a size 22/24...im a big momma and as long as they have been alive I've always been a big momma....my kids have love no matter your size or color.....unfortunately my oldest son has hit that age where outside influences (school peers, bullies) have swayed his own feelings of himself to be negative and hurtful. He was a very chunky kid, like his momma he loved food and with the meds he took they only added to his craving to constantly eat, hes 11 now and after being bullied for his weight he shrank losing 40+ pounds....I'm still working on himself being comfortable in what ever skin he is in and loving him self....the tarnish and damage kids have done to his self esteem leaves lasting scars, but these are scars we can all learn to overcome. ❤️", "sarahjmurdoch": "But what do you say to a kid that is fat that got teased about being fat. As a body positive person, I know that being fat isn’t bad, I use fat as a word to describe myself... but what do you say to children who are being intentionally hurt by the word?", "alwysleepy": "You’re honestly so amazing. You’re so genuine and you truly teach body positivity. That it’s ok to be who you are and to be happy. You radiate such positivity energy. I truly hope to find a friend like you who would lift me up and empower me like you do over social Media. Truly an amazing women 💜you", "mamahavok3": "How fun! You are a wonderful role model! 💕", "glitterarian": "You're totally setting these kids up to be amazing people! I used to babysit for a family who was dieting and the 1 yr old developed an eating disorder from watching her parents. One morning she begged me to lose weight so I wouldn't die. It was pretty heartbreaking and I'm so glad to know that you're helping these kids be healthier kinder people.", "brealynntaylor": "This post made me so happy I teared up", "mishshelly___": "How great would it be if parents or any adult in their life started explaining that stuff early so that the chubby kids at school don’t get picked on.", "brianna_fu": "My niece would point out how big my legs are and things like that and her mom was always embarrassed. It's such a reminder of internalized thoughts about fat bodies. She was stating a fact - my legs are big! But adults assume that it is rude instead of an observation.", "kelliclash": "@fatgirlflow You aren’t a bad influence in my eyes. You are teaching love that isn’t dependent on looks/characteristics. 💕", "cyr.cryptid.drag": "I love your account. I am a 21 year old trans man working on unlearning all the body hate I was taught as a kid. My parents put my on diets as young as 8, because all that mattered was my being skinny, not healthy. Their reasoning behind it was \"I dont want you to look like your aunts and uncles\" which now that I'm unlearning all that hate I feel much happier, now worried about always looking hot or never having a double chin. Seeing fat folks loving themselves is giving me so much inspiration for self love", "magicpug": "The PEE POOL! Auntie Coco is the best.", "thenattyjoshow": "When did those babies get so big?!", "querencia_seeker": "Ohhhh I love this post!!! My body is very similar to yours. My little nieces and my son make comments about my \"big tummy\" and I completely normalize it. Fat, big, jiggly, round etc are all just descriptive words. Just like they have long or short hair, or are tall or short. All normal! Just descriptive words that hold no personal value. I want them to know they can make comments about my body and ask me questions etc and they'll get answered and not hushed. Or told they're being rude. Kids are curious, kids want to know about different shaped bodies. It's ok.", "belleofthebawl85": "I'm a fat mom and MY mom was a fat mom and my sister is the fat auntie. My mother never shamed me or my sister for our bodies or for what we ate and I will forever thank her for it.", "iamlauriesomma": "I love this so much. I was raised around plus size people who outwardly hated themselves. It made me hate myself when I too became slightly bigger than all my friends.", "mzkandis": "Awesome!!! I saw this pool and others marked down and couldn’t imagine if my larger self could be comfortable playing in it with my kids! This is why representation matters. Thanks!", "sunnidaze53": "My daughter is 6 yrs old and I have always taught her that ppl come in different shapes, sizes, etc.. I even went out and bought the Barbie's that have different body shapes to show her that even barbie has friends that come in all sizes. I follow so many amazing bloggers and YouTubers and she watches along with me that way she can see how beautiful everyone is.❤️ Thank you Corrissa (hope I spelled that right) for always sharing a little piece of your world", "lacroix.mary": "Wow. If only every kid had someone like you in their lives. I know I sure could've used it.", "nerdy_nettie": "I wore my first bikini ever, first bikini out in public, first time swimming without being covered in layers, today! Took my little love to the pool and we had a blast! She is more worn out than I am 😂Still nervous for the time someone decides to make a comment. But it felt SO good to swim and feel the cool water everywhere! Thank you for showing me HOW to live my best life and be happy. By being you and being willing to share so much, you have turned on the lights in a dark room. THANK YOU! @fatgirlflow 🔥💕🎉", "cowprintg0th": "My niece loves to lift up my shirt and trace her little fingers over my stretch marks and whenever I get dressed she’ll walk over and pat her stomach and then mine and say “belly.” 😭🥰 it makes my little heart explode.", "almalety90": "My 5 year old is bigger and I'm big too..he always ask Mommy why is your belly big I tell him everyone is different sizes some people are short some all tall some are big and some are small.. he's like ok .. he goes back to playing", "babycarrot": "I love that.", "thislittlejellybean": "Yes yes yes yes yes!! 🙌🏼🙌🏼🙌🏼💕💕💕", "knarley_charlie": "This is so cute 💕", "thespianaf": "So much love. You’re a role model for more than just the littles! ❤️", "pms911": "I look forward to your posts. I've been slow to accept my squishy parts, and I'm finally freeing myself.", "chriscrawford71592": "You are like, such a force for GOOD in the world 😭😭😭?!?!", "adoods": "This caption is beautiful & wonderful, also I want \"all these babies know is that Coco won't judge them for peeing in the pool\" printed on a poolside coverup", "rebellevintage": "Love 🖤", "blssingss": "Not to mention warning them about being fat literally guarantees they'll have some type of disordered eating when they grow up", "amyhatvany": "I would love this a zillion times over if I could. ❤❤❤❤", "amelia_mariah": "I love it. But TiTi (short for auntie) ain’t sitting in y’all pee! Lol At least let it be some chlorine 😂", "kirmariemeetsworld": "Can we talk about how cute it is they call you coco?! So cute ❤️", "igotnailedbyamanda": "So much this!!!", "sheemthedream23": "Amen", "janetconroyquirk": "Love it! 🌸 Beautiful.", "grand.dame.queen.beast_": "I used to be really uncomfortable when my daughter would hug and kiss my stomach but now I just let her. Shes 5 and going to school and learning things from other kids that sometimes I don't have control over. But I can teach her to love herself, by loving me and all the parts of me,and by not pushing her away when she wants to hug my fat. It's kinda beautiful to see myself through her eyes. She thinks I'm soft and jiggly and when she's extra tired she loves to lay on my belly and knock out. It's beautiful.", "madison.lizann": "I don't get the focus on \"don't be fat!\" People should focus on \"take care of your body!\" This separates health and self care from size. When I was younger I thought being healthy was about staying thin and keeping your body in a desirable state. I had no idea that I should take care of myself because that's what my body needed and it would make me feel happier. Now when I do something like exercise or eat a healthy food I think about it'll make me feel good and how my body needs it. When I do something \"unhealthy\" like eat a sugary snack or have a lazy day I remind myself that I don't need to beat myself up over it. It's so much easier to take it one day at a time now.", "mama.is.a.witch": "🙌", "xmarthin": "This looks like so much fun! Love this post!", "flossiefarms": "My 3 year old likes to point out my “squishiness.” I do my best to just accept it as a factual observation. Yes, I do have a lot of squishy parts. And they make me a comfy cuddler and excellent hugger.", "dogmom_7296": "❤️👑 #auntiesbabies #auntieduty Aunties are the best!!", "ashesarms": "Love this!!!! 👏🏽✨💕 And where did you get this pool at girl I need one like this for my kiddo and I @fatgirlflow", "the_peach_hat": "this is the cutest picture!", "lilgorditaa": "My son always tells me he loves how soft and comfy my belly is to lay on. It is the greatest thing to have a small one that you are able to instill good, healthy feelings about bodies. 🖤", "motherviolet": "It is the easiest thing to tell them that beauty comes in all shapes and sizes.", "tasha_rhines": "My daughter has grown up to call every belly “beautiful” Every tummy she squished as a baby she would kiss it and call it beautiful now If I say “I’m fat.” (Fat isn’t a “bad word” in my household) She’ll tell me “you forgot the beautiful, fat AND beautiful mom!” She’s got a little tummy of her own and she loves to show it off! Lol ☺️♥️", "ketaagiggles": "Yes!!!! More of this! Now THIS is beauty! No judgement...all love ❤", "lizeller82": "Your nephew looks just like you!!!! So sweet!!!", "northwoodsamy": "My daughter comes up to me and uses my belly as a drum. No judgement, she just thinks my big belly is fun 😍", "jessy_jew": "❤️👏🏼👏🏼👏🏼❤️", "makafuif": "🤗", "margotmeanie": "Praise every word of this!", "joeyjo422": "That's awesome! I wish bodies were normalized for me as a kid👌", "deannahmarieg": "@fatgirlflow girl, I gotta say that you are truly an inspiration. I’m so happy I stumbled across your page months ago. You’ve helped me find self love, and it’s a beautiful thing! Thank you for being you. Your message is so positive and uplifting 💕", "kmw_plus": "YAAAAAS THIS MESSAGE NEEDS TO BE SHOUTED FROM THE ROOFTOPS🙌🙌🙌", "noistheanswer": "I have 6 nieces and nephews who all love my belly. Since they were tiny they learned to find comfort in living and hugging on my belly. That taught me to love my damn belly! Kids are innocent and generally love everything... it's us adults that teach them different. ❤", "the_marigold_kitchen": "Yesssss I wish I had had adults in my life to do that for me too💕", "amirabree": "I have 2 nieces who have commented things like that towards me and everytime they're met with positive framed facts just like you did with your niece. I think that's the best way to handle it cuz kids understand the world by processing similarities and differences and that's totally okay. But talking about them appropriately and kindly shows them how to talk about differences to themselves and others.", "bai.noelle": "💗💗💗💗💗💗", "mommyiloveyousobig": "Yes! When my kids mention my tummy, we rub it together and talk about the good food I love to eat. ❤️"}