{"leenapentti": "I need short overalls, and a cookie, ASAP. You look so cute and happy!😊", "thebitterblend": "Go you! Yes queen. 👑", "totoatoz": "What a wonderful thing 💗 I am so happy you found this! Keep on going girlie! 😍", "nicotron3000": "😍😍😍", "lavendersaturday": "Good Lord, you are precious! 💗", "rockoutwyoursocksout": "Yay!!!!!", "lilmisleah": "Keep on being you Doll😘💖 Shine on, don’t let no one dull your sparkle🌈🦄", "ekgobi": "those overalls (shorteralls??) are cute AF!", "denise6593": "Honestly i don't know how you folks that put yourself out there on social media deal with all of the bullshit comments. People are so hateful ...because ?? Because you look different than they do ? It is sickening how some peoples children act .", "ladylovelyloxxx": "✨✨✨🙌🏻✨✨✨ We have a right to exist! 😩", "heyitswhitlavonne": "That’s so cool! I’m so happy to hear you can comfortably go back to YT now!", "leereignssupreme": "😍😍💕", "axrevolutionai": "Part of social media is the reactions of others. If Donald Trump and Hillary Clinton can handle millions of people judging them and their entire identity, past lives, choiced, appearances, etc A blogger who only reaches a few thousands at a time should be able to do it herself. Instead, you'll pay money to have your comments curated before they even reach you. There's no point to social media without accepting the reality of the people viewing you and generating your revenue, whether that reality is positive or negative. Social media is now faker than wrestling, at least the wrestlers can handle boos.", "dsabrowsky": "I just watched your youtube vid, and I wanted to tell you that while I understand your reluctance to post hauls and be a \"fashionista\", I wanted to say that I so appreciate all of the videos that you have posted in the past. You were the first place I found on insta/fb/youtube that showed me that there were other options out there besides Lane Bryant and Torrid, which at the time were the only 2 places I knew to shop. So, for what it's worth from a total stranger on the interwebs, I do truly thank you for that. And seeing options for my fat body has helped me tremendously. I also have your Fat Bitch tee and LOVE it.", "katnipped21": "Thank you for all that you do!! Also, where is that amazing white T-shirt from??? 🙏🏻💕", "peachypipes": "Just watched your new tricycle/changing shit up/breaking down personal walls YouTube vid and it’s the best one you’ve ever done. Obviously you can’t please everyone and it’s unfortunate that not all of your followers will understand your need to grow outside of the original structure of your online presence format, but I find your continued evolution inspiring and interesting and, like, the whole reason for life (growth! change!) anyway just letting you know this old bitch is always out here cheering you on 💕", "candice.n.moran": "Where did you get those overalls? Super cute!", "intallgrass": "You look so good in these, that I now want to find some overall shorts!!😍", "endlessokra": "Anyone on here have suggestions on where to find plus sized overalls like that????", "foodfreedomnurse": "I love your summer overalls!", "shaw_lori": "That cookie looks awesomely delicious! F#@k the haters! I don't have time or energy to waste on them. I'm trying to live my best life and that doesn't involve a character assassination from someone who has not walked in my shoes.", "jarednevin": "I actually have rules around stuff like that. Because I’m fat I can’t: eat in public, wear clothing with food pictures or words on them, have tattoos with food related imagery, I never say “I’m hungry,” and I always make sure I’m the last one to pick up my utensil and make sure to leave at least one bite on my plate is to appear like I didn’t eat everything in front of me because I’m a pig. Ha. What a world.", "akaward_ball_creature": "You are so amazingly beautiful! I run a tiny little art account and I was wondering if I can do some art of you?", "nat_a_lie13": "I have bee trying to find overall shorts like this in 26-28 and I can NOT find them anywhere 😭😭😭 You’re gorgeous though!!!! 😊❤️", "fitnessprotectionllc": "This is GORGEOUS!!! You are gorgeous!!!!", "mountainpossumwitch": "Yes! I love this and can't wait to see new videos. Honestly I've just not been reading comment sections since doing that on Facebook would suck me in and then I'd spiral. On here it's not as bad it seems. But yeah YouTube, no, the same as Facebook. It really makes me feel good to see someone else built like me and looking so happy and good. 🖤🕯️", "ally_margie": "It’s because of you that I take a stand for fellow fat people, sticking up for your body and other bodies was never something I was taught and you have completely changed my mind about what it means to be fat in today’s world. Thank you 🖤", "hamadi_knt": "Favorite beauty", "cursivevendetta": "I hope you are aware of even a little bit of the impact you have on people 💗 thank you so much", "cateyikes": "i love your glasses! They look so cute on you💛", "whitneyontheweb": "Ummm... how dare you bring this much fabulousness to my feed this early in the day? You look great, and your confidence is inspiring!", "rosydoesstuff": "@tessholliday 💖", "elizabethpaintshernails": "My 70 year old hubby is not as active as me (50), but I constantly make him look at the comments on fat peoples accounts. I told him the amount and the degree of hate toward happy fat people is INSANE. The Alabama dance team post on Nike nearly made me walk away from social media. I cannot give it any energy. So glad there is a company doing this for you..", "carlamariebr": "I haven't been able to find an overall set like that in years! Last one I had came from Disney and Pooh on it! I wore the hell out of it!", "wrecklessghost": "You look so cute in overalls and it makes me feel good, I tried to buy a pair of overalls, But my belly is so big that I was worried about the imprint of my belly but you look so good that it makes me want to try again", "fashionschlub": "Hope it works for you and you can return to vlogging. I think you were the first woman I followed who was doing plus size hauls, I’d never HEARD of such a thing!", "tinabeardengibbs": "People are SO rude and mean! I say do what you want and do what you love and wear whatever the hell you feel comfy in! You're beautiful inside and out. Folks just dont care to get to know the inside and judge the outside! BTW, where did you get your overalls love?! They are just adorable!!!👍💜💜💜", "tomcronin6248": "@jackosull04", "hkymylsby": "😍🔥😍👏❤️", "aportuguesegirlinmontana": "Yay!!! I honestly miss your swimsuit hauls during summer season (I started to wear bikinis because if you 💕) and all the other videos that cover issues like mental health, bodypositivity, etc. Can't wait to see you and J collaborating again. I really love you videos together. It's a joy watching you two!! ❤", "cari_sma_ohneh": "I just don't get it... You're chubby, kind and cute. You're not “promoting fatness“ by saying “Y'all should gain some weight!“ It's just you, living your life. Why are people so offended?", "maggiemcgill": "That’s AMAZING", "ritarosas_": "So beautiful 💖💖💖", "monpetitfleur528": "So glad you're back. I missed you👏 😍", "subtlefeeder": "You're doing it all right....rock'n those bibs", "farmerfemmeesq": "Yessssss short-er-alls! The perfect summer outfit. ❤️", "erinm05": "Loving this outfit you have on so much!", "cmmcneilly": "You are amazing!", "naamacommander": "I’ve been watching for years. Yesterday I wore a lovely veggie print jumper from @modcloth, it showed my belly. It was challenging for me to say fuck it it’s comfy. It’s a part of your body. Rock it. I did on a first date rocking not only my visible belly lines but also my recent mullet. I felt amazing. Thank you. You’re one of the women who make my life easier. I am ever so grateful.", "kimmysutts": "Just be who you want to be it's your life body shaming seems to be the okayish norm right now. I'm on a strict diet doing really well but it was my choice to do that. I've had people say things about my body within ear shot no shame at all..x", "trustthefatgirl": "Aww YAY! Thank god for good people and great ideas.", "26kleisen": "Hope it will work its magic for you.", "hey_lee_eliz": "How r u so fucking perfectttt 😭😍", "moxiemoth": "So fuckin’ cute. Love🖤", "amandaadams": "Okay I’m obsessed with this pic of you 😍😍❤️❤️🙌🏼🙌🏼", "myfriendstaci": "What. A. Gift.", "zeeshan7654225": "❤️", "vintage_apple_pie": "Oh awesome!", "lamai_bird": "Thats good news. The amount of hate on youtube is incredible indeed.", "dodsonhope72": "Sometimes ppl don’t believe me when I tell them the crazy shit I’ve encountered just being me...I’ve never learned to let it go bc I think it gives the haters more power. Keep doing your thing", "wolviewarrior": "And that’s how the cookie crumbles and date I say: how the fatgirl flows @fatgirlflow", "spiritsongstudio": "I love this photo! Your joy radiates straight into my heart ❤️❤️", "crazyaboutmyjellyroll": "💜💜💜", "imayoungoldlady": "Please never stop posting. Your pics and posts give me life❤️. I love seeing pics of you eating and wearing clothes and existing ☺️☺️", "lieska.guzman": "I’m having a hard time existing atm 😅❤️", "softbodytendermind": "Real talk tho are those hot skin tight overalls comfortable", "nogueiraantony1971": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "bigrob1968": "Love the overall shorts", "lvernon2000\nVerified": "Verified", "curvysam": "I often hold back filming videos talking on YouTube too. It’s funny what fear does to us.", "blissfullflow": "Yaaayyyyy!!!!🙌🙌🙌😍💖", "xxscorpion_queenxx": "🤦🏽‍♀️ppl just need to mind their business, while u post what ever the hell u feel like😘, whats the point of following someone and not liking what they post yet continue to follow.. WHAT KINDA SADIST shit iss thattt lol😂😂🤦🏽‍♀️", "croyster912": "❤️ you in these overalls", "nadiabokody\nVerified": "Verified", "darlingactually": "You are so gorgeous I just 😍😍😍😍", "cheeky_snowbird": "So happy for this! Also, you’re super cute in those overalls.", "annalannabanna": "I hate seeing ANYONE eat 😂", "jared.love.3388": "You're beautiful", "nrdydino94": "Yay i can't wait for you to post new videos on YouTube ive missed you so much ☺☺☺", "nanci.with.an.i": "I love that this tool/company exists. I hate that you need it. Thank you for doing it anyway~~ that takes courage. Thank you 🖤", "pinesugar": "So. Much. Joy. ❤️❤️", "princessgmac": "It really breaks my ❤️ that you and J get so much hate! I think that you both are super freakin amazing and I’m so grateful to have found ya’ll on the insta and YouTube!", "hllohmiller": "💗", "yumaratz": "Can't wait to see you back on YouTube, I've missed you.", "trexvonschweetz": "This is one of my favorite photos of you. You truly inspire me all the time. I need me more people like you in my life. You are an amazing person. Much love. 💕", "abstractflowers_": "you look so cute in those overalls!!", "hannitashouse": "Yay!", "hollyjollyface": "Love this so much!", "laurapopephoto": "Thank you for being you!!!!! I love your content and seeing you live your best life. I’m also plus size and it makes me sad that there is such a stigma for just existing in our own bodies. But again, thank you for being such an awesome advocate! 💕", "hair_doll24": "The pool post was literally my favorite post ever!!! It helped me realize that it’s ok to be big. My 3 yr old has been verbal about people’s stomachs and she notices that mommy and daddy have bigger bellies than some. I kind of started getting emotional over it. But after your post, you taught me to approach the situation with ease and remember that it’s life and it’s ok to live!!!! I also just purchased my first 2 piece to wear in public!!!!!! BECAUSE OF YOU!!! I used to wear them when no one was around. But now I’m actually excited to few comfortable and cute at the pool. Thank you for that!", "kellielan": "Yeah I was brazen today. Went to dillons with no bra😮 the sad thing I noticed that it wasn’t men acting like fools, but other women?? Why?? We all have tits. So mine are big and look like mangos and not a melon. So my nips point to the floor. Who cares. I hate to say that u inspire me because that is a big load to carry, but I figured that if u were bold enough to go without a bra then I am bold enough to take a lesson. Thank u for being positive. U and J. Thank u both.", "br96ydee": "this photo makes me wish i hadn’t thrown away my short overalls 😭", "thekatandthespoon": "This photo is just so adorable and happy. Thanks for making content 💜", "caseyla64": "Where are these overall shorts from 😍", "moodydudey": "Your beauty comes from loving yourself just as you are & not apologizing for being your best you. Other people’s anger & ugliness come from their fear of your self acceptance, which is pretty sad 😔 Skinny doesn’t mean better or beautiful. I’ve know plenty of skinny people with black hearts!", "suckerpunchkid": "❤️❤️❤️", "maniacal_kat": "You are so joyful ☺️", "racheybean12": "I wish I could like this photo 8 billion times and then frame it on my wall. You are STUNNING and you always give me the boost I need to remember my self confidence. You the real MVP. 😍", "littleladyhook": "People seriously got their paintings in a wad over that photo of you with your niece and nephew? None of their business? People are insane.", "comfyfattravels": "Well i know you know ive had my fair share of attacks from trolls when a brand has reposted me. but this tool is super sweet and I really hope it becomes common practice for people to utilize it. We need it!", "elizabeth_pel_": "Where did you get those overalls? I’m currently hoarding overalls and need more. 😂", "luuhcavalli": "Perfect ♥️♥️♥️", "alostpleiade": "This picture is so goddamn delightful. 💕", "iamtheeviitwin": "I love you! Thank you for being you!", "jilleatsapples": "Fyi my favorite word to use and spread is Niblings! It’s the gender neutral term for niece/nephew. Plus it’s adorable!!", "vespertinadiaria": "Do you know of a good place to get plus size panty hose and tights?", "pilgrimsoul732": "can I say just how adorable you look here!!! 😊", "heymavensxo": "Love this! I was kind of patting my belly because I was trying to figure out if I was having menstrual pain or if it was a pregnancy symptom {hashtag infertility life} and my niece asked what I was doing. I said “I’m just saying hi to my belly!” She patted her belly and said hello. The she said “hi vagina!” and looked to gage my reaction. I looked down at my crotch and said hi vagina too. Then we went back to making shopkins out of clay.", "watson.figs": "These overalls are giving me life and I’m 100% here for it. Slay it queen!! 🦄", "purplehippie94": "I missed you on YouTube 😭 im so happy theres something out there that will help with those hateful comments cause we are all literally just trying to exist and be happy. Nothing wrong with that.", "logicalluminary": "What a wonderful service!!! Definitely looking forward to your return! 🥰", "larsyfarsy": "Overalls + Birks = iconic pairing. Loved your CYG interview. I'm a KCMO girl and I think you're cool!!!!", "jayadambird": "Ooh I’d love to work for them doing that! Looks like they aren’t hiring now, but I signed up for the wait list.", "100.000.000.001": "So cute 💕", "spirit.moon.love": "Your the cutest 💗", "adventurouskitter": "@shesallfatpod a mod to assist with mailbag?", "nikolemarone": "It is your life. Live it the way you want to. And yes @fatgirlflow, people do have an issue with plus sized people eating. Especially women. Doesn't matter if it's pizza or a salad. People will watch me eat. Which confuses me. Eat and also exercise. Anything that shows I exist and am living my life. It's so fucking bizarre. I hope you know, we support an", "fat.designer": "Love this!! ❤️", "jmize1984": "Where did you get those overalls? I haven’t found any in my size in years.", "mandysandy46": "@fatgirlflow Your body is beautiful and you look so sweet❤️", "thvnderstcrm": "wow this is literally the cutest !!! 🤩💖", "q_strom_99_walker": "💋💋💋💋💋💋", "janessajaylene": "So cute and carefree I love this pic!💓", "classyenglund": "where's your denim overalls from? 😍❤", "kyla.rose": "That's such a good idea!! I try to avoid looking at comments most of the time because I'm really sensitive, I'm posting a selfie each month this year as part of trying to be kind to myself, & right when I posted one someone felt the need to comment \"you must know you look ugly\" and I cried over that, I know people get more hate then that but it still hurt, I deleted their comment & moved on but still, it's no fun getting hate from some stranger !", "saucychick": "So excited!!!!!", "fantsypantsanna": "I just can’t wrap my head around why people do that. I unfollow people all the time when their ideals don’t match up with mine. That’s my right. I NEVER spew hate at them. Their opinions, lifestyles, politics, pants size.....that’s their prerogative. 🤷🏻‍♀️ I just don’t get it. THERE’S AN UNFOLLOW BUTTON!", "nepenthesenuts": "Wow you are literally the cutest person alive 😻😻😻", "jessaa87": "I LOVED and fully related to the pool post. Keep it up lady!", "cowboysandangelsuptown": "🔥😍", "liblibby": "FUUUCK YESSSS!!", "shannonleigh013": "💖💖💖", "love_summerdawn": "OMG, that cookie looks so good!", "_colombianyankee23_": "Where did you get your overalls 😍🙌🏽♥️?", "petalau_fflur": "Glorious🌻"}