{"papersaurus": "Oh my happy fat goodness! I have always wanted a trike, you have inspired me to finally get one! Thank you!😍", "abs0lutely_g0rge0us": "Oooh where can I get this bike 🚲??? I’ve been wanting to get one for the summer..tricycle seems like a great option!", "hector_luvs_coffeee": "🌞🌻", "revingeclassics": "That Bike is DOPE🔥💜", "jacqueline.anzalone": "LOVE💜", "healthymama24": "@fatgirlflow where did you get that bike?", "clumsy.genevieve": "I don't do bicycle anymore for about a decade now, I gave up after broking my arm a 2nd time... A tricycle would be AMAZING, I WANT IT!?!!!", "k_twinger": "I wish I had a tricycle like that, love it! I got a 7 speed, 26', Schwinn cruiser for Xmas. The weight limit is 275, and I am currently 270 and 5 ft 5in...at first I could not even swing my leg over to just get on it w/o falling over and crashing. After moving the seat down as far as it would go, straddling it, and very slowly and carefully putting one foot on the peddle, and pushing off (of course after many more painful crashes) I can now ride it and get some decent exercise. But I'm very shakey and nervous because i cannot just stop abruptly w/o crashing. To stop, I have to start a block ahead of my intended stopping point, take my feet off the peddles, and coast while balancing all 270 lbs of me until the bike stops on it's own lol. It's not until then that I can actually squeeze the brakes, and slowly and carefully swing my hamhock of a thigh over the seat to \"dismount\" and get off my bike....... and after 6 months of this I still fall half the time lol. I go through all of this crap because for the few minutes that I'm upright, cruising down the street, music blaring, wind in my hair, it's almost magical. And I love it! **Moral of the story** is if I could afford a kickass tricycle like that, or if more fat people friendly bicycles were made, and were AFFORDABLE I wouldn't have to kill myself every time I went through the process of riding my not-so-fat-girl-friendly but affordable bicycle.", "appleoferis": "I want a tricycle and that outfit!!!", "kaylajayloo": "Cutest ever!!!", "comfortforward": "FUCK YEAH look at you go! My brother in law fixed up one of those for me for Christmas and it’s so fun! I never learned how to ride a two wheeler so it’s extra sweet 🎉", "p.linkola": "Yeah... once again proving that you obese and mentally ill anti-health cult bloggers are literally giant toddlers.", "be.hush": "Please don't break it.🔥", "claireleblond": "How did the trike break?? 😭 I was seriously considering it", "hellokellyj": "This is the cutest 😁", "unicornrainbowglitter": "I don't feel comfortable on just 2 wheels, but this is perfect! 🤩", "aliyah91": "🎉🎉🎉I've been looking for booked the I could ride to bring my son to school in the morning but the reviews all day that they're not worth it ☹️☹️😔😔 hopefully your bike will have some great reviews, I miss riding 😭😭😔😔", "pegsterhuot35": "Omg I want one!! You look so happy and care free! I need more of that in my life 😁", "golden_yogini": "@carrieonfriend @lizziegohl Ummmm badass bitties just got a new look for our bikes 🚲 I want a tricycle! 💗💗💗", "oddreykahin": "You and @croc_del_unskinny are bikini twins!! 💜💜", "whereiamhome": "This is my whole future dream summed up 🌹", "cavyoufeelthelove": "Ahhh! I got a trike this summer and LOVE it!", "nikki_theamazing": "Omg I need this so I can ride with my girls!!!! 🔥🔥❤️❤️❤️❤️", "kalisto_zenda": "Have you looked into the Workman side by side cycle", "signorahappy": "What a great video!!", "zai.naba.146": "🌹🌹", "ellytheknight": "OMG YOU GOT ONE!!! I just learned these things existed like a month ago. Wish they'd been around when I was a kid.", "julia.peculiar": "Love this so much!!!", "travel.love.live.laugh": "@1rhondafleming", "sweetmeganleigh_": "This is what joy looks like. 🎉", "cafferkyjennifer": "So fun.. thanks for sharing. I want one! Have you seen Trikke carving scooters? I’m considering one.", "bulma.lee": "This is the cutest most sweetest video! 🖤", "tiffy_b22": "Omg you look so cute 😍", "leighcjones2018": "@morgiedurham me this summer", "kelleewhy": "Cute suit!!!", "neptuneorion": "I need one! I have issues with my hands and leg due to surgeries and this would be an awesome alternative because I can't balance on a regular bicycle! Also you look cute asf in the bathing suit! Very pin-up! Have fun!!", "starrlynnjones": "Cuuuuute!! Bike bikini babe!!!", "the15roses": "🤣🤣🤣🤣🤣🤣❤️❤️❤️❤️❤️", "yeahjamison": "Where did you get that swimsuit 🔥🔥💕💕💕💘💘💘", "thebralesslife": "Fucking awesome", "miss_me_monica": "Yep!", "loulouslife": "You look so joyous! Have fun!💕💕", "kaylkehne": "That suit 🙌🏻🙌🏻", "madetobebee": "I HAVE BEEN BLESSED", "funnyfatangry": "So adorable", "simonerobertasantos": "Aí que fofo", "jenfaria92": "Love this!!! I finally saved up to buy a bike from @worksmancycles now I’m just waiting for it to be delivered. Haven been on a bike in at least 20 years", "talieteakle": "My mum and I bought tricycles last year. She hadn't ridden a bike for over 40 years. I love riding with her and hearing her saying to herself \"this is marvelous\". Best feeling in the world.", "marisanachronism": "living for \"fat babe tricycle gang\" yes, please!", "tenderfish": "YASSSS", "kristina.fabian.art": "yey :)", "poorlilchicken": "That’s awesome !", "nicolettesessin": "I wanna go on a bike ride with you!!!", "pollywhistle": "Yes yes yes. I'm saving up for one for me (also fat babe) and my two dogs! You are rockin it. Makes me even more determined. 😍😍😍", "goodbodieskc": "Hi can we use this for your couples session", "shotgunwitch": "Just a few days ago, a Facebook friend got one of these. You are the second one I've seen. I so need to get one. It would be great to be able to ride the neighborhood with my kids. Can I join your gang??? 😂😍", "kayleighann88": "Love this 💛 x", "mwynn1180": "I have this exact same tricycle!!!! I absolutely love it. I’ve never had a bike before though and my neighborhood is hilly, so gettin myself and the 50lbs bike up a hill with no bike legs is... interesting!", "hornella_josephyne": "@merveille_ornella mais voilà", "danu.stinson": "i am living for this video", "baking_through_bed": "I can’t stop watching this. Your unbridled joy is bringing me so much joy. Thank you!", "em_bot_9": "Can’t stop watching🤣💓", "this_addiction_1234": "Love this! 💗", "johannab83": "❤️❤️❤️❤️❤️", "cirquedulindsey": "Yassssss", "cell_dawg": "@escot I want one 😘", "maraschechter": "You look amazing and so happy!!! ❤️✨👏🏻", "idaesther31": "Esta es la bici q necesito", "moss_folkfacepainting": "Omg if I was closer I'd LOVE to be in your gang!!! 😍", "purplerose771": "@poorlilchicken I need this!!!", "bigfatfeminism": "Omg! An adult trike!! I love it!! It’s not something I’d ever considered before but now I really want one 😂", "cat.cadet": "I am just besotted with you!!", "saturnsonic": "Wish you'd ride down my street 😍❤️🎸", "nikki_lynn28": "YEEESS GIRL!!!!! IM LOVING THIS! You are fabulous!!!", "croyster912": "This is like a scene from a movie!! ❤️", "emberlina_artist": "I need to be in your fat girl tricycle gang!!!!!", "motherduckinggingers": "I I lovvvvvve this!!", "kandyfoxx": "I have been researching bikes for 400+ for a few months and holy cow are they expensive!! Excited to see what you think", "mach_bh": "I’ve been wanting one for years! Do you think the weight recommendation is true?", "angelica_santiny": "👏👏👏👏beautiful", "barclay0201": "This is what joy looks like 😍", "caitefosho": "I've been wanting one for forever!", "b_b_bubbly": "😍 OMG I NEED THIS IN MY LIFE!!!", "mrsnightmar3": "🔥🔥", "lanabare": "😍😍😍", "voluptuouscatturamagazine.uk": "❤️❤️❤️", "janice7458": "So joyful.", "tomybailon": "Funny 😁", "kellypierce4496": "I've been wanting a 3 wheeler too! And that purple bikini is to die for! 😍🤩😍", "jessicabailey1829": "looks vintage circa forties LOVE ❤️✨👍", "brklynshoebabe": "I want one!!", "aspen.the.tree": "YOU'RE SUCH A CUTIE IN THAT SWIMSUIT ily💖", "alpinebutterflyswim": "😭 sooo perfect!", "gigigotdat": "Ur happiness is the ultimate goal❣️ Go head baby girl 🙌🏽💪🏽❤️", "leeo_______": "There is a rumor that all fat people have bad joints ?? Is it true?", "_beautypalast": "Love IT", "donnaboyeshamrick": "❤️Go girl!", "javabarfies": "Omf this is beautiful", "mmustafa_khattak": "😆😆😆", "dcgirlnjersey": "@jerzeejinx you need to make a video", "ms.voorhees13": "Omg I want one so bad!", "bigbody_allah_86": "💜", "starleen80": "Oh.my.gurd!! So cute!!!", "sebastian_gomez_lopez": "😮😻", "mamaof3jent": "Are you from Portland Oregon? @fatgirlflow", "jessicadarling.xo": "WOO!! ❤️😍", "prettyforabiggurl": "💚💚💚💚", "fatfeministmich": "I love this so much ❤️", "meggie_muggins": "So cute!", "chrissie_geee": "Your joy is palpable ☺️", "misskittykaos": "Love everything about this 👏❤️👏❤️", "wyckhamavery": "I have dreaming of a tricycle for years!! I never learned to ride a two wheeler but it looks so fun!", "fatlasstravels": "Love this SOOOOOOOO much! AMAZING! ❤️", "nattty_rose": "Aw🤩 I strive to have your confidence❤️", "amylsays": "I want to join the fat babe tricycle gang!!!", "seriousmoonlite": "So fabulous!", "troublebubble20": "YOU ARE THE FUCKING BEST 💜💛💜💛", "sarahsleepyhead": "Where do I sign up to the tricycle gang?! Love it 😍 😂", "lionesla": "😂😂so cool bike man hahaha", "kattyv3": "@fatgirlflow This is the best video! Gorgeous!!", "floorgirl": "Wow! How am I nostalgic for another fat women's current summer 🤣", "aloragreymoon": "OMG!! How frigging happy are you in this video. Makes my heart happy to see such joy!! I'd join the crew!!", "beauty_lu_leal": "👏🏼👏🏼👏🏼👏🏼❤️❤️❤️", "michinanin": "omg in love 💕💕💕 have fun", "onealbracken": "Damn it 😍. Looks like a dream come true to me", "u.m.g93": "♥️🔥", "eri_artistically_foolish": "This is too cute! Can I draw you on the tricycle? Seems like a challenge to draw the tricycle! I've always wanted one with the basket in the back", "curvy_ariel": "Ok where can I get me one of these 😍", "weepingangel81": "I love it!! So cute!! And I just looked at the price of the bike and had a heart attack! That is ridiculously expensive! I do hope you get to review something a lot cheaper because I would love to get a bike!", "femmeicon": "SO CUTE", "roam.her": "💕💕💕💕😍Love this so much", "26kleisen": "Have fun!", "laulauatlimi": "This is amazing! 👏🏻👏🏻🎉🎉", "clarissametallcosplay": "That's fantastic! Would love one!", "b.i.m.c.h.e.n": "❤️❤️❤️❤️❤️❤️❤️", "infinitejoyangie": "Tricycles are awesome. Rode one on Mackinac Island and have wanted one for home ever since💜💜", "nic.nac.391420": "Yes to this all day!", "soniagrijalva52": "Jajaja!!!!!!!", "marvamaker": "You look so cute!!!!!!", "fat.fem.flawless": "This is life goals right here. 😍", "everycurlandcurve": "I got my first bike in years and I feel so free. It has helped with my anxiety, I go on a ride everytime I feel like things are getting too stressful. It's not a tricycle but it has a basket and I love it! Your tricycle looks so cute!!", "thisinsecurelife": "This is so much better than a bike! You are so joyous!!😍", "wildlotuswoman": "I absolutely love this!! Gooo girl go!!!!!", "spacerockette": "YOU LOOK AMAZING! And that looks like so much fun, that smile 🥰😍💜💙💚💛", "samsilda33": "Awsome! Loving it!!! 👌 😍😄", "anne.med.e": "@miss__aliice åh kanske är en sån här cykel vi borde ha 😍💗 Du har ju varit så ledsen pga punka mm", "haysfoster": "Omg 💗 that... I want one", "supersnazzykristen": "Oh joy!🤩", "ban2016mar": "Sexy rider 😊❤️", "angelaalba_": "This.. is..... ammAAAAAZZZINNNGGG", "vwwtiturui": "💖💖💖💖💞💞💖💞💞💕💕", "melsuchawitch": "This is perfect. I freaking love it.", "p_wretty": "Love this so much!!!", "snooozyq": "@goldfieldsgirl", "beebee_sanchez": "I have been jonesing for an adult tricycle. You look like you're having an amazing time. 😍", "qimzel": "I just feel like shouting \"wiiiiiiiiiii\" when I see this 😁", "nikky22204": "I want to be in your gang! LOL. I love everything about this video 💜 I think I might need that bathing suit-super cute!", "terrielynns_world": "I envy your confidence 💖", "orfhlaidh": "All the joy you spread is lighting my monday morning i swear", "khavanicole": "OH MY GOD I LOVE THIS MORE THAN ANYTHING I HAVE SEEN TODAY. 😍😍😍", "fatshionista": "OMG MOOOOODDDDD💜💜💜💜", "cleva__girl": "Omg LOOOOVE", "astasn": "I love this!! 😄😄♥️♥️♥️ I live in Denmark (deffinetly bicycle-land), and we need Fat Babe Tricycle Gangs 🥰🥰🥰", "wytchcrafttas": "This is the fhxking cutest thing I've ever seen. You are like the embodiment of Hilda by Duane Bryers 😍😍😍😍", "clarkmaleah": "Serving suburban summer kids on the block realness right there!", "stl_citygirl": "@colemantcr_bawss 😍", "minamewu101": "💕I need one ! 💕", "mommagoose09": "💕💕 I am jealous and want to ride with you standing on the back yelling \"whee whee!\"", "amandainoak": "I would like to be in your biker gang pls 😍", "the_carrie_anne": "I’ve been watching a trike for years! I have balance problems and vertigo so riding a two wheeled bike has never been something I could do. ❤️ This whole post makes my heart so happy.", "debideb59": "Cutest, ever!", "rosieblackheart": "OMG I love this, and now I want one!", "hay_leymc": "God you're cute", "somewhere_under_the_rainbow": "OMGayyyyGawdddd I'm. Innnn.", "k.en.zo": "Lol dumb question do you have to know how to ride a bike to ride one 😂", "samanthazyski": "My daughter: She looks happy. 💜", "fullstyleinc": "We effing in!!!!!!", "juicygirl811": "This is too damn dope 😍😍😍", "ulybaybalb": "🔥😍", "becky_yellow": "I just had a similar experience and I was also scared to try! But I was so so happy when I just rode off! You go girl 💕", "kimmy_some_more": "Goddamn you’re adorable! 🖤", "ashoori_6370": "😂😂😂😂😂👍", "serwendipitous": "Yes yes yes yes yes dreamy film / frilly bikini / kick ass trike this is everythingg. Totally down to join the trike gang! Patches would be freakin RAD🖤", "sequoiamakes": "This is too fucking cute!", "mayakaalani": "i want a tricycle", "plump_n_artsy": "❤️❤️❤️", "monflash": "If you ain’t gonna support me like this this summer Fuk out my life ❤️🔥❤️ @jayemmare @hazybonesmarie", "va.va.vieve": "@cakeman96 is ride bikes if you got me a tricycle! 🤩", "nerdy_nettie": "I’ve been trying to find a bike that will hold my weight for YEARS!! Let’s do this!!", "heathermaemusic": "OHHHHHHHHHHH my god. This is next level joy! So excited for you!!!! 💕💕💕💕", "ladysublime109": "I've been wanting a bike also but worry the affordable ones can't hold my weight. You look so happy and I wanna be in your gang.", "lcrate41": "Patches we need patches. Congratulations! Bikings fun! I ride all over town and strangers stop me in the coffee shop because I'm smiling whenever they see me while I'm riding. Best wishes. Leslee port angeles wa usa", "hannahis2extraa": "I LOVE YOU OMG🥺🥺🥺🥺🥺🥺🥺🥺", "susancarico": "I want this! But live on gravel roads so... 😬", "ace061982": "@fatgirlflow I want one so bad.. I am so scared to get on one with my Fat ass but I have always wanted a tricycle", "beccamaekillyou": "SO CUTE! I didn't know tricycles were a thing!", "chantelleroy": "I am living for this!🙌", "adventurouskitter": "This video was everything I needed today ❤ I love your page, you are amazing 🙌", "corgifairy": "I love this", "hargrovekristin": "@heimerlzoey this is what I need 🙌🏻", "losutherland": "This is amazing because I want to do the same thing and I am glad someone else is doing it too! Please give more reviews and such I would love to know more!", "micahrose": "I’ve been looking at trikes because I want to carry things around in a cute basket. Also...can I join the gang?!", "chosennfree225": "Super awesome!!!!!!!🔥🔥🔥", "beeleeive": "So CUTE I thought this was a vintage video so cute", "jlcan36": "Ive been wanting a cute fattie bike for so long! 👍🏻", "jolierc": "Omg you are so fucking adorable", "alycebh": "I want a tricycle so bad! You make it look gorgeous and funner than I imagined.", "nickitoyra": "Bought a bike today and didn’t even think I’d FIT on the thing. Amazed myself by riding it .5 miles and didn’t die!!! It felt so great to be back on a bike- it’s probably been at least 15 years for me too. I’m all for the #fatbabebikegang ❤️👏🏼❤️", "david__holmes_": "Top women 🌹🌹🌹🌹🌹💜", "lillian_bustle": "Hooray!!!", "just_this_chick": "THIS IS SO CUTE OMMMGGZZ💜💜💜💜", "sapphiresplendour": "Never have I seen anyone this cute and being this cute on a bike well doneeeee💕💕💕💕💕", "kerryparkes77": "Oh my god I love this!!!!! I need one! @fatgirlflow where did you get it???", "justmecat": "Um yea, love that suit and the bike!", "mayamoonpoet": "Incredible! I was just looking at one of these for myself today! It’s been a long time since I was comfortable on a bike I am sending you so much love and thanks for the inspiration to look up these companies and hit that order button! 🏍😍✨♥️", "powertoprevail": "I can’t even tell you how many times I’ve watched this and it keeps making me smile so hard!", "dangerouslyinchub": "Omg I have also wanted one of these forever", "gingilocks": "This is so freaking cute! Your happiness is contagious! All smiles over here. 😍🤩", "itscynt": "I bought me one too and I love it! I recently moved to Florida where the 3 wheel bike is really popular! Now what I haven’t done is ride it in my bikini! That’s powerful:) I love that idea but I don’t know yet! I’ll stick to yoga tights for now! Lol.. But I love that you did it @fatgirlflow ❤️💪🏾🔥", "annielaurahandmade": "What brand is this one? I was given a Schwinn trike and the moment it was assembled, I knew it was flimsy. It felt like it was gonna break in two.", "parenting_hq": "Classic love love love this ...Go biker gal catch that breeze!!!", "synapsefizz": "Look at your sheer happiness and enjoyment! YES!!!! 😍😍😍😍 that looks so fun! You and @unskinnyshero are adorable in that alpine suit!!! I am SOLD with this little ruffles on the butt! I’m ordering next week on pay dayyy! #beautiful #summerisawesome", "plaidsquatch": "THAT IS SUCH A CUTE TRIKE OH MY GOURD", "juliansmami": "Best👏thing👏ever", "ally.sonofagun": "I was fully hoping this video had sound! 😆 💕 love this. love summer 2019. LOVE", "girlletgo": "I LOVE THIS SO MUCH!!!! OMG!! I wanna go on a ride with you!!", "jenngetscurriedaway": "Love love love this!!", "g33k_boy": "You've heard the queen song, right? \"Get on your bikes and ride!\" 😂", "stephyvilla0202": "Omg I have been wanting one for years!!! I think we need tricycle gang shirts!!!", "sithrenity": "I’m loving this! My bike was stolen but a trike would serve me way better anyhow! I can’t wait to hear which company you went with!", "bobdogx": "I wish i was that seat", "whitewino_": "Omg I love this!!!", "doochecanooe": "You're such a boss babe! 💛", "susanenneking": "Brakes. Your mom only hopes you know where the brakes are!👀😂.", "aubsboggs": "I just got my first bike in years and OMG I LOVE RIDING BICYCLES. I can’t stop. The only thing that keeps me from riding all night long is the lack of street lights in my neighborhood and the number of coyotes that live here. Like, I could probably out-bike the coyotes but don’t want to take that chance 😂 my bike isn’t a trike but I’d still love to join the fat babe tricycle gang 💕 my new bike is basically my dream bike (forest green cruiser with tan wheels/seat/handlebars) but I’m pretty jelly of that sweet tricycle. So much room for transporting activities! And picnic baskets! And small animals! 🚴‍♀️🐥🦝🐿🦔🐇🐈🐕", "kellyloubega": "❤❤🙌🙌", "mrsxwolverinecalijungle": "I had a bike like that😢", "nikiknits": "Holy crap, you're the cutest thing ever 😍😍", "trisharaestahl": "Omg I love this😍❤️❤️❤️", "annmarie2718": "I want to be in your tricycle gang! I fell in love with trikes when I saw so many at Burning Man. Congrats!!", "roseoznz": "truly “the picture of free, untrammeled womanhood” 👏", "thespianaf": "LOVE! ❤️", "hollyrh1227": "I have one too! Mine is turquoise! I LOVE it! My husband is a an avid cyclist and I wanted to join him so this was the best option for me. Of course I can’t ride as fast as he can but we still enjoy getting out together. I am hoping to transition to a regular bike once I get my confidence back up. Have fun and enjoy!!! 💜💜💜💜", "anderwilson": "Cannot like this enough! ❤️💕", "chelouisa": "Omg I would like to join the fat babe tricycle gang please! 💗 Getting a heavy-duty trike is something I’ve daydreamed about for a long time. Really looking forward to your future reviews!☀️", "mag.estes": "This is the best! I have big dreams of taking my girls everywhere in a bike trailer but the bike I have is 👎🏻 and not meant for big butts.", "miryamdelirium": "@margerad1 THIS COULD BE ME!!", "sararobertson31": "This made my month.", "shevswarbrick": "I love that swimsuit so so much! 😍💜", "orangejuicechugger": "I loooove this, so cute", "laceystone83": "OMG you are so adorable", "bai.noelle": "omg the tricycle !!! so freaking cute", "ajj48fan": "Omgeee i love it! Enjoy ...now i want one!!!", "brietamzinn": "Sign me up!! This is freaking beautiful!", "shaynalou": "I have been wanting one of these forever!! Now I have to do it, it looks too damn fun to miss out anymore!! You look like you are really enjoying yourself!!", "danielleimperfected": "You look so happy! And happy is THE most beautiful thing. 😍", "australiansexologist": "Haha! This is so beautiful 🌈🥰", "yaytaydanielle": "OMG I LOVE THIS. I MISS RIDING BIKES 😭😭😍😍", "schneckertins": "Omfg you are the god damn cutest!", "troubledjedi": "@hers28 @miss_me_monica time to get on the girl tricycle gang", "sonoranflora": "Amazing!! 💜", "towolfie": "GORGEOUS 🦄💖", "sunshinejcortez155": "I love it ❤️", "gone_missen": "I love this so much this is my aesthetic wow", "gennidubuque": "Babe on the move alert! 💁🏼‍♀️👙 🚲", "fluffydhru": "That bikini is everything", "jenjiffy": "I’m joining the gang! I have a tricycle AND IT HAS A BASKET", "khsanders126": "I will be in your gang!", "coralascetate": "Pig june", "miranda_jean_precour": "I'm over 300 & ride a normal bicycle. It's got good tires & very stable. You can ride a bike at any weight.", "glitteryfemme": "Omfg I need one!!! 😍😍😍 this would be so fun to ride around on by the beach 🌈💗", "ashmjong": "Dang! You look so fucking joyful! I wish I didn't live in the middle of no where and the roads could handle a trike! 😍😍", "24k8m": "Yes please do some reviews! My bf and I are trying to find bikes that will hold us. I don't need to become a YouTube sensation when it breaks 😂😂😂", "jay_niclle": "I love this", "umarmalik777": "So damn amazing and adorable!!", "colunga_art": "I love how happy you are! Go gettem' gurrl!!", "nixoooooon": "oh my god I didn’t know they made these for adults???? I’m gonna cry I need one", "cassy.pennington": "That bike...and you..are precious", "hopeinseattle": "Yes!! 💜", "courtneylittle22": "You look so happy yayyy. ❤️ that trike is too cute!! Never knew I wanted one, but suddenly I feel like I need one!", "shelbylounails": "I wanna be in your tricycle gang!", "lillias_to_a_lilly": "These bikes are a game changer for ma chubby figure. I also have coordination and balance issues. It's a bit scary at first but it gets better every time you rid it. As queen sang....fat bottomed girls make the rockin world go round!👍👍👍😊💙💙💙👍💙💚💛🧡🖤💜", "jenniferhicks": "Glam!", "joyeandpain": "Congratulations to you. Hopefully you can find one up to 400lbs that’s cost efficient", "rhino_louise": "I will totally join your fat girl biker gang! #trikes4life 🙋🏼‍♀️", "kristy_cobratits": "Gaaah, you look so happy! That makes me smile! 💖", "chellen525": "You are so damn precious, I love this!!! 😄", "weodots": "@fatqueer_adorababe", "jmize1984": "I desperately need one of these bikes and to live in a super small town where I can ride it to get grocery’s, and to the park so I can sit and read!", "pointy.chin.diaries": "Yeeeeeeesssssssass", "goshnicole": "AHHHHHH I WANT TO JOIN!! 💝🦋💘💕", "willwrite4coffee": "GROWN UP TRICYCLES!! OMGOMGOMG", "cialitra_": "AAAAHHHAHAH 💖💖😭", "jacqueeliz": "This is truly the most adorable thing! 🚲 ❤️", "_firstlady_13": "I love you my Dream is to be on a bike again 😘🙌", "huneybunnie64": "You look awesome on your bike ! You go girl ! 😁👍", "madi_081998": "I want one", "bl4kk4t": "oh honey, fat bottom girls make the world go around! this is awesome.💜💜💜", "gamechanger73": "Awe", "spiritsongstudio": "This is so freaking awesome!!! I want to be in your trike gang! Fat Bottom Girls make the rocking world go ‘round! 😍", "originalsurlytemple": "SO fun!! I love the joy emanating from you in this video!!!", "invadeherkim": "Your joy gives me joy! Do you feel it's sturdy enough? I'm over that weight limit. 😃", "torreshunny": "That suit is adorable too!!!🔥❤️", "fratekick": "You’re the cutest woman alive.", "emilyeternal": "The joy in your face is everything", "moxiemind": "Amazing!!", "cayl_salad": "I'm down for the fat babe tricycle gang. I never actually learned how to ride a bike, I was too stubborn. I fell off once, my dad yelled at me to get back on, and I walked home. That was the end of that.", "sabsisfierce": "Sadly, I never learned to ride a bike in the first place, is this an option for me as well with the extra balance factor or should I first have to learn on a traditional one?", "kendallrayburn": "The cutest!!!!", "leilanidavenberry": "I have an ez trike and love the seat:)", "cream.and.stars": "Hilda vibes!! I love it", "tinyasskitchen": "So cute!", "tinkvan": "Omg I want one soooooooo damn cute 😘", "margotmeanie": "I need to join the tricycle gang and I need a jacket!", "thegrayagenda_": "Wow coming to steal my freaking heart!!!! Such a cute video!!!✨✨✨", "geekpurl": "Omg you are adorable!", "simply.myself13": "I want it! Where did you get it??", "rachelshadoan": "Um you are stunning and your joy is radiant", "liblibby": "YESSSSSS!!!!! Look at you go!", "wilderness.within.studio": "I just wanna say, your account gives me life!!! THIS makes me smile and gives me warm fuzzies in my heart. ❤️❤️ thank you!!", "mama.is.a.witch": "I wanna join that gang! 😍", "fantsypantsanna": "This clip gives me so much joy!!!!", "cakelynnebrady": "I keep watching this because your smile is infectious. 😁", "ashgravesroesler": "YOU ARE ADORABLE this video is the cutest thing ever 💕💕", "collectivethread": "Yay @fatgirlflow we need more big people on bikes! Just got a fat tire bike and i love it! Fat people are underrepresented in the bike world lets change this!", "leoniemereana": "This post made my day! You look happy and free! Enjoy!", "crawfordlauren0": "You need streamers for the handlebars!!!", "andimjulie\nVerified": "Verified", "sayshesclassy": "LOVE IT", "lizmcfiz": "THAT FUCKIN SWIMSUIT WISH I WASNT POOORRRRRR 😂🖤🖤🖤🖤", "caliabbygram": "🤗", "the_owlish_miss": "I love this SO SO MUCH", "_mrs_kay": "Cool!!!!! 😍😍", "losangelesmidwife": "@packer_of_lunches what I need", "brynnknits": "You are the absolute cutest 💖", "jt.stacy": "I fucken love you! You are always so full of laughter and joy! 💕👍", "anneandkathleen": "The joy you are exuding is so precious! This looks like a lot of fun!!!", "mandyoh": "😍😍😍 You’re the cutest. Now I want a bike!!!", "aijea": "This is The Best! 💖", "joeyjo422": "Aww this is great! I love it! 🏳️‍🌈💜", "ashlyb_larsonfarms": "I so desperately wish this had sound! Your laugh always sounds so happy. 😂💛💛", "tlbbrooklyn": "Okay, I am officially obsessed with this bike. 😍", "amyslingsby": "That looks like fun.", "oceanluvngal": "Holy heck, I love this so much!!", "a.l.y.s.s.u.m": "summer goals ☀️☀️💜", "mishshelly___": "I would love one of those, I’m far too clumsy for a regular bicycle. Also you look super adorable and happy.", "nervousinjuly": "Spring time biking 😁😁😁!", "alexmichaelmay": "Omg you’re soooooo cute!!!! And this is so wonderful and lovely and my heart is soaring for you and this is just the beginning!!!!!", "party.hand": "i used to have an adult tricycle and it is truly so fun and so much more accessible!!! hope yours brings you so much joy", "sadierex": "Also, how did I never think about weight limits for bikes? We bought mine used and I just assumed it would work. Had to get a different seat and could still probably use a bigger one but I totally just assumed the bike could support myself plus my then large toddler in a kid seat.", "zombri_d": "Where does one apply for the fat babe tricycle gang CAUSE MY BODY IS READY", "whitneytheinvincible": "Pure joy ❤️❤️❤️❤️", "kjcampbell19": "So much joy! ❤️❤️❤️❤️", "color_addict_makeup": "Love this!! I'd love to ride a bike again. Last time I was on one the back tire blew out on me and I haven't been back on one since out of fear!", "gregrenck": "This clip is pure joy.", "imayoungoldlady": "You give me life! Damn!", "duzal68": "Omg.... That is fabulous ❤️❤️", "sheemthedream23": "I would love to get a Trike. Looks super fun .", "jenniferarkansas": "❤️ ❤️", "1chilledrose": "I would so get a trike and join your fat babe trike gang!😍", "merry_moonchild": "Cuute!! So awesome!", "spirit.moon.love": "I love biking tho hard on my knees! But seriously how cute! You look adorable in tht suit and riding the bike💜💜💜💜", "teresa_lutz": "You look so joyous. I want to buy a trike and join your gang.", "notyourgirl.andrea": "I love this so much. Your joy is infectious. Thank you for sharing it with us. ❤", "littlemeatloaf": "You look so happy!!!", "mayapassmore": "Love love love this 💛💛 also, that colour purple is so so good!✨", "teamrobbins": "Can I be part of the trike gang? We can totally get vests! 🤣🤣", "thatpurvisgirl": "@whitegirlgarcia", "beccaella3": "This is officially my favorite thing on the Internet today omg you are wonderful!!! 😍❤️😍", "jessm.fit.femme": "You look so happy 💕this post gives me joy", "liz_calloni": "💜💜💜💜💜", "motherviolet": "This is amazing. Probably the cutest thing I have seen all day!🚴‍♀️💓", "thrashon": "Do a wheelie!", "mandi_pants80": "I love this!!!", "samlefaye": "🙌🏻 I want a bike like that so bad", "wednesday_fattams": "@D_Mike_83 BABE how cute would I be on one of these!? 😍", "softbodytendermind": "I love it", "katzenmiaumiau": "Omg I love this so much!!!!", "kelliclash": "@fatgirlflow First of all, you look so happy and cute 💜 and YES to a tricycle gang 🙌🏻", "puffmuffn": "THIS IS EVERYTHING", "flawed_til_death": "I want one of these so bad but a bitch is POOR as fuck.", "jdelong7": "This is best, most joyful video!! 🙌🏼💗", "mmmstover": "Get it girl! I haven’t ridden a bike for any distance since wrecking when I was 13. (I’m 32) but a trike?! Yes!!! That’s what I want!! What brand is yours? Where did you get it??", "hanna4breakfast": "This is awesome! It’s so dang cute, can you put things on the back part? I’m imagining a big bouquet of flowers or a picnic basket", "frankenstitcher": "I want one! I never learned to ride a bike!", "abaenormal": "Fuck yes!! I bought a Worksman last fall and I've been riding it every week since! I tried a bunch of cheaper bikes for years before, but they would never support me properly and I would stop riding eventually bc I'd get super discouraged. I knew I loved riding and that it was my ideal way to be active, so it was well worth the price for me. Plus, it got more expensive trying to replace the cheap bikes every time I decided to ride again. I hope you love riding your trike, it looks like you're having so much fucking fun 💖", "maribellemead": "I'm legit terrified of bicycles... literally everytime I get on one I have a major injury.. yet never have that problem on a Motorcycle.", "alysiathegrownup": "This is AMAZING and so damn JOYFUL and I just love it so so much", "a_wallflower93": "This is beautiful!!💜💜💜💜💜", "dixoctobre": "Omg this is the most joyous little vid I’ve seen in a long time, I can’t stop watching it ♥️♥️", "q_strom_99_walker": "❤️❤️❤️❤️❤️❤️❤️", "44samallen": "Omg I want a tricycle now. 🙌🏻❤️", "beautifulxfeet": "This is glorious! 😂👏🏻💜", "ty_gambino26": "🤤🤤🤤", "lieslbinx": "Omg!!! This is awesome", "its.me.koekoe": "😂😂 This is sofa king cute🤣🤣", "lynseyskram": "This is adorable.", "dananallama": "Fun!!! I need one!", "audraelizabeth": "This is so cute and exciting! Congrats on your bike!", "talk_curvy_to_me": "Nice! 🙌🙌🙌", "bye_bye56789123": "This is both the most adorable and most fierce thing I’ve seen in forever! 💕💕💕", "infinitely_keshia": "I will happily join the tricycle gang! I've wanted to ride a bike for years but have been too scared to put my fat ass on one!", "evelyn_siciliano": "🙈🥴👎", "thisplusthatstyle": "This is so 🔥❤️🔥❤️🔥❤️🙌", "oneprplrose": "I wanna join your tricycle gang!!!! Why do I have to live so far away?! 🤬😂", "piixiieleaf": "That’s adorable my first trike was a 3 speed torker it was amazing 500 dollars but amazing", "sweetsophia27": "Love this!!! You exude confidence and look incredibly happy 😊", "brettglann": "Love this! But how do you store it when you’re not using it?", "gnomecottageaz": "Nice bike!", "imciarra": "A whole mood 🔥", "sweatbeforetears": "This is the loveliest thing I’ve seen all day!!😍💖😘 I want to ride a bike.", "crazyaboutmyjellyroll": "💜💜💜", "cher5656": "Come biking through Canada and this sexy disabled girl will jump onto the end of the line 👌🏻👌🏻😜👏🏻", "elle.bradberry": "This is so cute!! I love how joyful you look! 💕", "fattymph": "omg I want to join the fat babe bicycle gang!!!", "modernkansasmama": "All I ever wanted was a trike gang! 😍😍", "omgitsstephc": "Can you please update us! I got a trike that looks very similar to this and haven't been able to ride it due to the seat not staying in place. I just had it tightened it yesterday. I haven't been able to ride it since the tires are flat. I really want to get it up and running 😬", "phoebesfatshion": "Fuckin love this!", "creebytheway": "I love it 😍😍😍", "girlwithoutcancer": "I love trikes, my nana had one. It was great!!!!", "palegingerpear": "I want one badly but the cost is holding me back", "xx.paciprincess.xx": "You are so cute! ☺️💕", "th3shoshow": "Omg I want one", "puffstuffmagazine": "I love this!!", "bri.luginbill": "You are incredible!!", "strong_in_the_broken_places": "I ❤ this soooo much!!! I have wanted to ride a bike for many many years! I'm happy to know there are options out there.", "thebitterblend": "Yes! My queen!", "omg_it_speaks": "Omg so cute!", "cassidybrowncreative": "The pure joy on your face! 😍❤️", "bigstupididiot": "This brings me such joy!! This looks so fun and you look amazing!!💛", "sooziespore": "LOOKS SO MUCH FUN!!! 💓💓💓", "ennywhales": "This is #summergoals 👏🏻", "kresgie": "So super cute and I love that bathing suit!!!", "deesview": "Get it girl 👏👏👏👏👏👏❤️❤️❤️❤️", "our_happy_pace": "😍😍😍😍😍😍", "286to160": "that's awesome!🔥🔥🔥", "sach.pea": "Pure joy. Thank you.", "with_this_body": "Joy!!!", "fishnuu": "Omg this is adorable 💕", "sunnidaze53": "This is the cutest little video ever. I love the 2 piece bikini as well❤️", "taylorannemade": "Yes to everything in this video!!!", "tovapatricia": "Your joy in this video brings me so much joy! Also that swimsuit 👌👌👌💜", "mrskimmycakes": "😂😂😂😂😂 I love it 🔥", "lyxke": "Look @ the joy 😍💕✨✨🚲", "miss_hysteria": "Seeing the joy on your face 😍", "mama_trum": "I’d give anything to feel that free and joyful.", "chel_of_ra": "Lol you torquing the handle and leaning back and all slyly grinning like it's a motorcycle is beyond adorable 💜🌈❤️ if I were closer, I'd totally join that goddess gang! . I've had some bad bike experiences in my life, and it's made me super paranoid and afraid of bikes. I'd love to work my way over that fear. This is inspiring to me!", "betterdeedsthanwords": "Yaaaaas!! #noboundaries", "chriscrawford71592": "You know I never learned to ride a bike...too anxiety provoking lol...", "xl_yoga": "I've got a trike and I'm fat and 56. I'm having troubles steering with the roads being concex(?) lower on the curb than in the middle. Any tips from other trike drivers? I'll join your trike gang.", "samasourasrex": "I can ride a normal bike, but I'm so scared of losing my balance and crashing that I don't. This looks awesome 😍", "amyaimlessamers": "Omg I neeeeeed one of these!", "yumaratz": "Look at that gorgeous and happy smile!!!", "ericastardonkey": "Y u so cute tho !!!", "mamaj1976": "Love it!!", "bodybuffering": "Omg this is the cutest effing thing ♥️", "missbig_juicy79": "I can’t love this enough!!!! I loved my trike when I had it! #iseeyourollin", "ebonylouise83": "Omg can I please join your awesome gang?!", "thefattingtonfrisk": "Oh my god, I NEED ONE! Very much looking forward to more reviews!!", "mwooding": "I love this video so much 😍", "oldsmobabe": "You look so happy! 💖", "flash_n_trash": "I love this so much!! I am way too unstable to ride a bike but a trike would be so perfect! Love how happy you are in this video ✨💕", "_terah_": "Omg this is so damn cute! ❤😍😭❤", "katykabloom": "Amazing! My mom has always said she wanted a tricycle with a little basket. This is super cute 🌸", "excitedyelling": "So cute!", "hlbarnes": "This video made me so incredibly happy 💖✨", "citymoogle": "I have heard good things about the Workman bicycles.", "ladysith13": "I always wanted a trike!! Congrats. Looks awesome.", "gigig44": "@residente87 now this is the bike I'd like", "goddessofstuffandthings": "Omgggggggg I need a tricycle ASAP I hate regular bikes.", "caileydarling": "god i would love to ride a bike. a few years ago for my birthday i asked for a bike from my parents and they got me a lovely one. it clearly wasn’t working for my weight the tire was nearly flat when i’d sit on it. it was also way too short and i am 6feet tall. i ended up having to take it back to the store and my dad 100% didn’t believe me when i said the bike wasn’t right for my size or weight and he totally just thought they’re all created equal. i’ve seen some trikes around second hand and i wondered if i could maybe ride one of those but i’ve never tried. i’m at just about 415 pounds so i am super worried about getting a bike that is rated so much lower in weight but seeing you ride this is bringing me joy.", "cleestandish": "I fuckin need a tricycle. Can I join your gang? Lol", "kaiapapaia": "Absolutely love this 💕", "allieamo": "Omg so jealous!!!", "fortheloveoffilm31401": "Oh i LOVE this so much!!!💕💕💕", "myboysmyjoy18": "My dream!!!!b", "fairiesandfancies": "Cutest video ever goes to..... YOU❤️", "lizply": "you look so free & happy I LOVE THISSSSS", "service.dog.atlas": "This is what pure bliss looks like. I’m so glad yr thriving!!!!", "meghks128": "I love this so much❤️", "cm23221": "💕💕💕💕", "mashamashavee": "OMG I've been DYING for on of these!!!", "leslie.nicole89": "I want to be a part of this fat babe tricycle gang!! Looking for a trike now!", "lexiloveleo": "@taygeaux 💗 we need this bike 😍"}