{"smith.melanie": "this is so fucking cute and i NEED more fat love!!", "strong_in_the_broken_places": "I absolutely love seeing the two of you together. I have to admit because I would probably stare. I would want to talk to you but would be afraid that I'm not worthy.", "ebonylouise83": "You know it's true love when you're willing to share your snax!", "garner.poetry": "🔥🙌❤️Your love is beautiful, y’all are beautiful Thank y’all for being an inspiration", "oliverparkerisadad": "Y’all are cute ❤️", "fabulousdarling14": "You guys are just radiating with happiness and that makes me so happy too! Keep shining! ❤️❤️❤️", "xchubbykitten95": "I just wanna say thank you. You are the reason I'm not so ashamed of my body. For years I would hide, wear long baggy shirts, all black, and never wore any swimsuit without a cover up. After I found your Facebook page, you inspired me to just love myself and wear what I want. Sure, I still wear black. That's almost my entire wardrobe, but I got my second bikini with BRIGHT BLUE bottoms instead of black, I wear crop tops and leggings, and I just don't give a fuck. Thank you for that push.", "trutrulov": "@yarkosky this could be us but you don’t want all this goodness", "luckeecristeen": "Your happiness outshines all the shade!!! I love your pictures, they always give me that \"feel good\" feeling. Thanks for sharing your life with your followers", "sleepygrl79": "You know what I see when I see pics like this? Two people who love each other and that is what this world is about. Fuck the haters. You two make me smile!", "beckyavery2": "I’m hungry for Cheetos now.", "sbah43235": "❤️", "lorna_ash": "I think I would look and think fuck my life I wana live it like that giving no fucks as to what ppl think its my life my body I will wear and do what the hell I like 😍❤️😘", "decorno": "oh my god this summer mood makes me so happy 😍 😭", "quirkygirls": "Which lake is this? Looks so fun, I miss lakes! 💕 u both", "mistressvioleta": "This is the sweetest thing ever, ever. 🥰 So much love for y’all. If ever I were to make the mistake of staring, it would be in admiration. I love the way you act toward one another. It’s tender, completely unabashed, beautiful. It normalizes my own fat relationships and bolsters my confidence to be real and vulnerable anywhere. The love is worth it. 💗", "saltymermaidmomma": "Any tips on where to get floats for plus size? @fatgirlflow", "_thejazzyone_": "I would be looking because I would be thinking, “wait, that’s J and Corissa! I gotta go say hi and tell them how ADORABLE they are 😍 and get a picture 😂” people staring are just wishing they could be as happy as you guys look in this picture", "v_mercedes_machado": "Don’t know what else to say, but thank you", "suziwitdauzi1980": "I don’t know you but I wish I had been there ❤️❤️ ❤️🤭 . Btw I can feel what you said in my gut . 🤭All my love 2 y’all.", "nicolegoedman": "You two are so gorgeous together! 😍♥️", "dimps_k_85": "I can’t like this enough. May we all be so free and loved 🙏🏻", "edm.rainbowmom": "@fatgirlflow dude I legit wanna go swimmin with ya'all. 🥰🏊", "owlloveu4eternity": "Your love for them is everything. You both are goals for me and my relationship. I love seeing you 2 together. That’s all I ever see is the love and the beauty you both are as a couple and as individuals. ❤️", "dixoctobre": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "minttemple": "I have never slammed a like button so fast 🙋🏾‍♀️", "wingardialev": "Главное наслаждайтесь жизнью и друг другом, а всё остальное не важно!👍😊😊😊😊😊", "sayshesclassy": "I love y'all A LOT", "maddross97": "You guys are seriously inspirational ❤️🥰🤩", "dani.n.wonderland": "Naw girl. I think its more about the fact u eating cheetos in the water with absolutely no fear of getting them wet. Like, Im scared for you! 😮", "taenerys.targaryen": "💜❤️💜❤️💜 giving me life!!!!", "shelbyeazell": "This is the cutest 😭😭😭😭", "bronte_shutter101": "💜", "lchoward5": "😍❤️ true love!", "sarahbright79": "They’re just jealous of your Cheetos. I know I am.", "bethelizabethuk": "I swear you two are the cutest couple i have ever seen", "eclectic_anomaly": "Your love is so beautiful and I enjoy seeing all that positive energy in your content ❤️", "nicolettesessin": "All I see is love. And a possible cheeto + lake water disaster 😘", "mrs.rachael.reagan": "😭😭❤️❤️❤️", "laughinggoddessapothecary": "You two are living your best life and I love it! 😍😍🌠🌠😊😊", "downthesamehill": "#relationshipgoals", "david.outland": "❤️", "rrawfa": "God look my way so I can be enjoy the summer with somebody I love and a bag of crunchies.", "ladysith13": "#relationshipgoals 🖤🖤", "tinkvan": "Love you two😘😘❤️❤️", "diegobh_art": "That's why I like y'all!", "fancy__necromancy": "I love that you're feeding each other Cheetos *sighs* I need dis", "ginnyatchison": "Those looks you get are on them not you!🇬🇧💋", "fatfeministmich": "You two are so beautiful ❤️", "babybeile": "omg this is adorable 😩✨", "fullheartfoodie": "Adore you both in my feed. 😊", "the_vagina_whisperer": "What floaty are you using? Is it a chair type! Been looking at one", "mrsgoller13": "Y’all are so fuckin adorable 💜💜💜💜💜💜💜💜💜💜", "kellielan": "I wouldn’t worry about it. As long as u and J r happy screw everyone else🧡💙❤️💚💛", "mrsscott0508": "Love all of this ❤️💙😍", "somewhere_under_the_rainbow": "Resonating with all of this plus adding extra looks for my \"interracial\" love! Eff the haters & enjoy your cheeto love!", "hanecdote": "😍😍😍", "towfab": "😍❤️👏", "cleveriguess": "I love this. I LOVE THIS. You’re cute as heck together!", "sunhustler": "Livin your best fuckin life!💖💖💕💕🔥", "ban2016mar": "Love is Love dear and who ever have a problem with it they can go fuck them self, this is your life not they’re life, this your lover your body your life don’t care on what people say because In the end this is just jealousy seeing two big people love each other and they’re happy that’s jealousy right, so just be happy and keep smiling everyday. 😊❤️", "danilovespie": "Y'all are so cute!!", "statusviatoris": "@fat4fat is the best hashtag ever 😭", "ronipeskin": "I can only hope to have what you two have together", "p_wretty": "I love this and your posts so much. ❤️❤️❤️", "free76597": "Oky", "this_sminks": "Your both too cute here 💖", "klausi_60": "Beauty ladys ❤❤❤❤❤", "elfalone": "LOVELY!!!!", "zee_zore": "Or if they are like me maybe they don't know whether to disturb you or not to ask for your autograph/picture 😘", "raw.gingerrr": "Haha doritos in the sun 👩🏻‍🦰👌🏻 aaand in the water.. living the good life", "sarahlouwho7": "You guys get looked at because you two are so adorable together. 😀", "keatingmelanie": "Freaking adorable", "mlbozzuto": "You two are awesome!! 💕", "christa_boychuk": "Livin’ your best life!! 💖", "cookwithcourt": "I love👏🏻", "alchemyportraits": "Gaaaaawwwwddddddssss! I love all of this so very much!", "kate_isobel_cherry": "You guys are soooo fuckin' cute!!!", "family.friends.geekery": "Aw you guys are so cute. Just keep rocking your awesome selves.", "dahubs40179": "You two are absolutely amazing together. I wish you both so much love and happiness!!", "zoemack10": "I need this kind of relationship. Being fed hot Cheetos in a lake", "trustyourbodyproject": "Obsessed with both of you", "26kleisen": "😍😍", "mooseshiloh": "Love is love and you guys are beautiful!", "hildar95": "These pictures are so fucking cute it hurts me", "sapphiresplendour": "Makes me so happy", "mimir25": "#lovewins 💗", "vitaminc3c3": "Y’all are so cute it kills me 😍", "lacyibrahim": "😍", "kayliemorbid": "I will fucking stan forever 🙌🏻", "laura_s0529": "And can I just say that I fucking love it that you guys are shamelessly eating Cheetos. As opposed to something like carrot sticks as society might expect. Love it.", "alissachuu": "Ahhh! Makes me SO happy to see J enjoying the lake! I know it makes them nervous. Happy you’re both happy! ❤️❤️ enjoy that water! Looks so relaxing 😍", "chriscrawford71592": "Yo the love is so real in these pics 😍❤️😍❤️!!!", "bam_itsanna": "Wow this pic radiates love", "tararaekuyper": "🔥💖", "milamamalove": "Maybe it's because anyone can see how much you love each other 💜💜💜", "debicet": "I love you two together ♥️🌈♥️", "that_one_chick_liz": "if you’re happy who the fuck cares what other people think!! y’all are a beautiful couple", "paigezieglerr": "I love y’all together (I mean I love following both of you individually as well, but together you’re just honestly lovely) If everyone could find a love like this then the world would be a better place ❤️", "micheleloguereynolds": "I get a lot of looks being a plus size woman with a skinny husband. F**k them I’m living my best life and we are expecting our second child in October. Do you forget about the haters 💯", "clarissad505": "I think it's because you're having a great time and miserable people hate on anyone loving life. They'll make up any reason why we shouldn't be having fun. Sad really.", "cassy.pennington": "One day...when I’m slumming around in Larry Town...I hope to see y’all. I’ll point and stare and run in slow motion for a hug! Adore you both dearly. 💜💜", "nrulason": "I suddenly have a very strong desire to be on a lake on a tube eating Cheetos, an experience I have never wanted before this moment. 😂", "clarajmoses": "Ya’ll are SO cute!", "obviouslyaninfluencer": "Glorious lovelies, both of you", "libblash": "Live your life 👏🙌", "cherubmermaid": "Yall are the cutest ❤️", "syrod80": "🤣🤣🤣 love it!!!", "ello.ellen": "💕💕💕💕💕💕💕💕", "gabibooksit": "Y'all are living!! 😍😍😍", "beccahl0414": "Y’all are cuties! They are just jealous!!!", "bai.noelle": "when am i meeting J!!! too cute to handle", "badbetsyb": "Love you both 💛💛💛 Stay Gold", "impishlee\nVerified": "Verified", "lexiloveleo": "♥️", "pepper.saltzman": "In just want someone to feed me Cheetos in the water", "bsummerbeauty": "I look at you and see two humans living life", "the.unschool.life": "Girl give me the scoop... how do you get into those floats? I can't do it too save my life! 🤦", "keegancrawf": "I love this post", "crazyaboutmyjellyroll": "💜💜💜", "fem_gent": "Damn. Now I really need Cheetos.", "caitlynsiehl": "love you both 🌸", "bl4kk4t": "i was thinking.. see no one is even paying attention.. i should get out of my head more.. 💜⭐ enjoying your best life!! 😻💜💙💚⭐🌙", "jesswestlove": "I love it! You two are the sweetest!!! 😘😘😘", "mema1_mel": "Y'all are awesome! I want to be hangin out with y'all!", "justmecat": "That water just looks SO refreshing. Jelly.", "shanooooie": "Y’all are so damn cute. Be seen!!", "tarableigh": "That is a really beautiful caption. Love is so fucking beautiful.", "oldsmobabe": "Let 'em look! 😁 This life is a one-way ticket! Enjoy every moment of it!", "samrosey": "Beautiful love 💖", "aiden.the.phoenix": "I want to meet you both. ❤️", "marvamaker": "This is beautiful. Have a terrific fourth you two cuties", "ninapoirier98": "My golly this is goals.", "ellawakened": "This picture makes me so happy. Love your best life babies❤️❤️", "ladylovelyloxxx": "✨🙌🏻✨", "juliansmami": "First of all 👏👏👏 ❤️😍❤️😍 Can you just teleport to nj so I can hang out with you guys", "angel_baby_1980": "Best pic ever ❤️❤️", "myvibes22": "I am the biggest (FAT) person in my family and group of friends by a HUGE amount. I always feel the need to compensate by always looking out together and “perfect”. I figure if I look decent people won’t have as many reasons to talk about me behind my back. It’s sad really. I have an angel of a husband that runs to the store if needed. I always tell him, if I could just throw on a ballcap and go I’d go everywhere.", "jacquiee_ohh": "😍😍💞💞", "shellywilson1378": "Living and loving is all we can ask for. When people stare at me my husband says it’s because your beautiful. Oh thanks babe. The end.", "yaytaydanielle": "I wish I wasn't so dead ass terrified of open water cause sometimes it seems so fun! 🙃", "thiccpizzaqueen": "This is precious! 🧡", "worstedwarlock": "You both look so good together!!!!!💖💖💖💖💖💖", "martinifontaine": "Jealous of all of the above! ✨✨✨", "crabbeyallie": "Y’all get looks because you’re so fucking awesome. So many people aspire to be just like you. Let them look and see what true love and happiness looks like", "barefoot_lauren": "Ya’ll are honestly so inspirational both as individuals and as a couple 🥰", "sincerely_rad": "@lez_hike49", "amy_carol": "Summer goals!!", "spacebrat_": "😭😭😭😭❤️", "weezyftaylor": "Hell yeah. Y’all get that shit.", "hairforthebooks": "❤️😍❤️😍", "hurricanehal_": "Where is this???!!!", "katattack0_0": "Or they are just so overwhelmed by the sheer amount of love and acceptance they witness when looking at you two that they can’t comprehend it because of their own lack of such things so they stare!", "sdotzler47": "Seriously can’t wait to find love like this damn❤️", "fostermamaeva": "I want to hang out with you so bad! I love you both. If you come to Los Angeles I'd absolutely want a meet-up. You both are my favorites!", "watson.figs": "Ughhh lake day looks amazing!! Y’all are seriously the cutest!!", "amysselflove": "My heart can't handle this amount of love and beautiful-ness. I'm gonna bust. Brb, just writing down J & Corissa being GOALS ❤️❤️", "croyster912": "I would look at you to because y'all are so gosh darn cute together!! ❤️❤️", "imsocooked": "Just adore both of you 💕", "recoveredfeminist": "Y’all are damn cute together.", "arwengillett": "Friendship, floaties, and lake Cheetos!!!!! You really are living your best life!", "sassy_cat": "This made my heart sing 💓🌟💓", "sassyzaz": "❤️", "spacecadetchu": "We deserve to take up space too! And to figure out happiness! 😘", "hannitashouse": "So happy-making 😊", "samwaters967": "I love it!!! So glad you both are happy!!", "katykabloom": "I love your love ♥️", "hollergoblin_": "I love your love 💕", "death.becomes.han": "😍😍😍💗", "thebabyarri": "@bitesizedmuffin", "beaveranastasiahausen": "#RelationshipGoals Y’all are fkn awesome! 😍♥️😘", "lieslbinx": "Wow wow wow I love this 💖💖💖 also damn I really wanna get in the water with y’all 😂😂😂😂", "jennifer1576": "I think they’re great pics. Happiness and enjoying life caught in the moment 😘😘", "xlunarlulux": "Most people fail to understand that no matter what body size we have or what gender we are, we DESERVE to be happy. As long as you are happy and healthy, that's all that matters. 🖤", "hollyenelsen": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "gbeardsly": "Y’alls love is freakin’...well...lovely!", "thefattingtonfrisk": "Bless these photos 😍😍😍", "pretty_kitty420": "Yasssss, eat those Cheetos, swim in that lake, don’t wear any clothes, screw em all, y’all look happy as fuck ❤️", "citrus_fiesta": "honestly they're mad they didn't bring the cheetos with them...fuck this is the life y'all 👌🏻👌🏻👌🏻🤟🤟🤟🤟", "dobetter_consulting": "❤️❤️❤️", "mollyzilla6": "Fucking Killin it. ❤️", "dandoescrafts": "Man y’all are just all kinds of goals.", "margotmeanie": "Damn I wanna be in that lake hanging with y’all!!!", "the_newnicole": "you look happier then lots of people on the beach!", "em_coolwhip": "literally this made me tear up, i never see people like me represented in relationships and this is fucking awesome I love both of you guys so fucking much 💖", "torii__fix": "😍😍😍", "alyssawes10": "So cute 😭😭", "amberautomatica": "GOALS AF FOR REAL", "caralazara": "😍😍😍😍😍😍😍😍😍😍😍😍😍", "snewjo": "🥰🥰🥰", "xxjoannaaaxx": "@fatgirlflow @comfyfattravels y’all are fucking precious 😍🖤🙌", "jenacahobson": "Maybe because you're both super cute and wear awesome clothes 🤷", "thezoehyde": "That is our favorite floaty 👌", "jenponton\nVerified": "Verified", "aquietflower": "It's so cute 😭😭😭😭 this post made me so happy ❤️❤️❤️❤️❤️❤️", "juliegazuli": "#adorbs", "ebzibop": "wow 😭✨💙", "mandaroniii": "Y’all are just precious! Also this is my ideal day, except I can’t eat Cheetos anymore 😭😭😭 and there’s no dairy free ones that even come close.", "thebitterblend": "Yes! Y’all give me so much life!!", "nicolecmaple": "You two bring me so much joy!! ✨♥️", "natalie.micale": "I just happened upon this account about 3 years ago, and you are now in my top 3 faves. I love you. I love your love. I love your love of life. Just fucking keep getting it.", "cutetrashfruit": "When I was young I thought I would never have a happy relationship because I’m fat and queer and I just want to say thank you because y’all are life goals and if I think about it too much I’ll cry so JUST THANK YOY", "whitneysweet_writes": "My husband and I get stared at too. We just exist in our love bubble and forget everyone else.", "dreaming_with_grace": "These pics are everything! I’m obsessed!", "comfyfattravels": "Well goddamn this is real sweet", "paigebcarpenter": "This is literally my life as well with my also fat, ftm spouse. I don’t care either! I love showing people we can have so much fun and be super happy all the time, “despite” being fat and queer.", "annachubbybanana": "Wow you guys are adorable!!🙌", "lovelystarlite": "Who cares because LOVE ❤️", "virg_leo": "The best humans. Beautiful!!!", "advo.k8": "Ugh I love you two so much 💕💕💕", "janice7458": "2 normal people enjoying the sunshine.", "strph": "So much adorable 😍😍😍", "notvcreativename": "I love y’all so much. 😭", "lillias_to_a_lilly": "I love the 2nd pic my husband does the same thing with me and French fries. 😊❤️😊", "yumaratz": "Make no excuses to anyone!!! Live your life for you and what make you happy.", "hippie_gypsy_yoga": "Keep living your best life boo!!!✨💕", "moistgreenorganic": "when you two get to laughing, it’s infectious. blessings ❤️", "usernamesevenpoint0": "Damn straight I'd be looking... Cheetos are my favorite and I'd be super jealous.", "notorious.b.i.itch": "Yall are so fucking cute ❤️❤️", "mrs.perez_3": "Love is love and our weight shouldn’t matter.. love isn’t perfect because it never meant to be.... keep on trucking guys", "k.en.zo": "Life doesn’t get better than this 😩 , cheetahs, bae, the water, AND floaty that seems to be comfortable", "l.ml20l": "❤️❤️love y'all such good inspiration to me", "mk_ultracool": "I love this! You two are so cute together!! 🌸💗", "maggiemcgill": "This is so cute I’m audibly whining", "fullagrace78": "Jay...again in water like nobody’s business!! You’ve dealt with your fear so wonderfully! 💛", "laura.obrien": "Love your love for each other 💗", "dani_jo_clark": "The love I have for this picture!!!! You both rock. ❤️🧡💛💚💙💜", "junglehousegoods": "Take me with you next time!", "_monochamus": "Looks like heaven!", "deweydecimator": "#livingthedream", "linzisherod": "CUTE", "muffintop_mermaid": "Live your best life boo💙", "writingjordi": "These photos make me so happy 😍", "itsfriggenval": "I love this 💜 I wish I could get into this beautiful mindset.", "mmmeganfisher": "You both are goals! Your relationship makes me smile :)", "_cactusjackie": "It’s probably because y’all are cute asf 💕💕💕", "mandixchartier": "This is the best. 🖤🖤🖤🖤", "faeriethusa": "These pictures make me smile. Y’all are adorable individually & together. And I’m a bit jealous of these lake days!!!!", "stefasauruss": "I cant handle how fucking cute you guys are", "mjlawson10": "I’m in love with your love. ❤️", "mommagoose09": "I would just stare cause of your adorableness 💖", "shellyhassdenteufel": "♥️♥️♥️", "jennapeneueta": "I mean, what kind of looks? They might just feel like they cant look away from genuine love 😍❤️", "teganver": "❤️❤️❤️", "georgiapower81": "So beautiful ❤️❤️❤️", "dthmtlsheryl": "These pictures make me SO happy 😍❤️", "bfranklin09": "You two are so sickeningly adorable! I love it!", "jadediana86": "For sure couple goals", "_emysaurusrex_": "This most makes me fuzzy inside. 🐻💗😍", "lenabug527": "❤️", "eminwv": "💙💜💚💛❤", "tinaphobic": "❤️", "dr.jess.plans": "Best life indeed!! 😍", "kaylyn.mingua": "I love this 💖💖", "natalie_rose_wooten": "Y’all are by far the cutest couple ever. 🏳️‍🌈", "jacibird": "🙌 ❤️", "femme.supreme": "Oh my god these photos are true love"}