{"alexsilin7": "Wait a second, whales don’t belong on bikes...", "kristen_rose_lynn": "Just came back to Insta and I’m realizing your account is the ONLY one I like every post on. U r a star!", "thecuddlyantelope": "This is just awesome", "marcel__ware": "🤦🏽‍♂️ Lose some weight .", "smiley8riley": "Where is this bikini from? You look incredible 😍", "littlemsbold": "You look so fierce 🔥❤️", "wowu_0000_888_yt": "👎👎", "bailobajolalluvia": "@n0e_diaz @pau_ntvgera Nos falta actitud a nosotras Pau 🔥😂😍", "suatcikikci7160": "Tosun tosun maşallah", "negosantanagpc": "Me da uma carona ?", "mdu_1": "😘😘😘😂😘😘😘😘😘😘🔥🔥🔥🔥", "alistefan1k": "@stephstef610", "tqy8405": "Iloveyou", "frankiboyfour": "👍👍👍", "cleestandish": "I got a trike because of you!! Thank you for sharing 😍 Now can I join your biker gang?!?!?!", "rhondagilmore77": "@fatgirlflow where can I get the fanny pack?", "tidalmel": "You are so beautiful 🌻💛", "danielabellaps": "Hey. I was thinking to buy something like that for me. It's really comfortable ?", "ravvan54": "خخخخخخخخخخخخخخخخ خخخخخخخخخخخخخخخخ خخخخخخخخخخخخخخخخ", "lizajames.holley": "Literally the cutest", "moonflickerstone": "Whoa!! You look beautiful!!🌸💜❤️", "abi.wag": "Oh. My. God. Is it a fanny pack?!?!!", "beckeyfehst": "I feel like a major issue i need addressed with a bikini is the bottoms have a large back and small front but with my low hanging belly and flat bum.. I could wear them backward more comfortably.", "chflan": "I bought a bikini because of you. I’m not sure what I’ll do with it lol! I’ve put it on in the bathroom so far...thank you ❤️", "f.andresoares": "😍😍😍", "raligalr": "This is officially the most joyful-super-fancy-fun picture of all time. Could not love it more. Thanks for the happy. 😍", "annachubbybanana": "Looove the tricycle and smile, and that bikini is dreams!!🙌😍💖", "sweet2guns46": "I want a bike like that", "simoneregina_": "Fucking need this bike NOW", "thatx1xgirl": "Whats the band for ?", "mama_c_34": "New bikini in line am in if u do", "funny.fat.fabulous": "I love the joy in these photos! You are so happy and it's amazing. ❤️", "gurdansinghkalsi": "BEAUTIFUL BBW GIRL", "geovov": "Do you know what your ties look like?", "moreolgabernice": "Seeing you being fat and happy and enjoying life is giving me life! Love these.", "chockycakes51": "My goal in life is to ride a trike in my bikini 😊", "sbah43235": "❤️", "goddessofstuffandthings": "You're really making me want a tricycle", "amanda_marie_lockett": "Omg! Yay!", "mohsen_saeedii_": "😂😂😂", "plussizehansi": "I loooove this 🙌🏻 😍 So much happiness in one photo ❤️", "_habib_mansuri_": "Do you have manner stupid old female are you wearing a 👙 and do the cycling infrant of whole crowd. Shame on you........", "breezycakesl0l": "I really hope it’s some plus size fanny packs or some plus size biker short collections 😭😍🥺", "amandacmckay": "❤️❤️❤️", "bagga.amrit.italia_": "👍👍👍👍👍😍😍😍📸no 1 😄😄😄", "longo4010": "I have to buy a bathing suit this week for the first in what seems like 10 years. Where to even begin!?", "adventurouskitter": "❤️🙌", "alycebh": "I’m so jealous of your trike!!!", "amersist": "Tricycles? 🔥🔥🔥🔥", "damnm00nchild": "You look so beautiful where do you get your clothes and such I love them ❤️😍", "wslukastyle_": "@damaris.adamo", "makemesanguine": "YES 🙌", "samrosey": "So joyful 😍😍😍😍", "heeyyleee": "Where did you get that bikini", "filigreeandstone": "I am getting one!! What brand is this one??", "spindyk": "I’m so hoping it’s either more bike shots (I’ve wanted that tricycle for years!) or that funny pack you’re rockin.", "f.elicityc": "I’m just tryna figure out where you got the tricycle 😭", "jayconlee": "I want to meet you in real life. You are an inspiration.", "yamalo17": "Loving the bikini & is that a fanny pack 😍??!!", "funnytooloud": "I sooo want a fat fanny pack!! 🔥🔥", "probserika": "if it’s a fanny pack I’m down to buy I can never find a fanny pack that fits me :(", "all_about_bri": "Yess queen! I would buy that bikini in a heartbeat!", "justinekay88": "Yass excited to see what it is!", "joanosterberg": "I knew it!! Plus size fanny packs!!! I’m getting one. 😍😍❤️", "sarazonah": "Such a QT!! Love this pic!! 🙌💕", "alysita0": "Line of fanny packs!! 😍", "malukagirl": "God I love this pic!! Just pure joy 💜💜💜", "plump_n_artsy": "Soooo cute! I want that tricycle!", "amelia_mariah": "How is the trike holding up? I know you mentioned the recommended weight in a past post. Super interested in a sturdy bike or trike", "croyster912": "Omg stop it!! You on this trike with a leopard bikini the best thing all day!!", "gauchet.martin880": "❤️❤️😮😮😮", "softhandplastisol": "Um is this a three wheeler? I don’t know how to ride a bike (fear of balance) so this would totally work for me! 🙈🙊", "yosemite_slam_vcdd": "I love this woman", "thegigidrip": "You gotta bring back the fat brat shirt!", "likesay": "This has truly inspired me to get a bike for my own again. I had one of these in my teens and loved it. Found a blue one on Amazon I'm going go get! ❤️", "scdathykchoco1": "💜", "_emmadee_": "This pic is so damn pure and joyful 😍", "sassidyycassidy": "Please call them Fatty Packs🔥 Fat is our word to reclaim😍", "thelifeof_aria": "You are killin' it babe. 🔥🔥 wish I had an inch of your confidence. Here in Australia, the fat shaming is out of control and it seems as I get older the worse I feel about it. Maybe time for a relocation to somewhere more forgiving. ❤️❤️ thank you for my monday boost x", "heartbrk.hotel": "IF YOU HAD A UNDERWEAR LINE? Bitch I’d holler and spend all my dollars 😩🗣", "_fauxsisticated": "This is the cutest picture in the world! I’ve wanted one of those trikes forever!", "tittysweat": "FANNY PACKS?", "the_thrifty_business": "You are beautiful-Your neighborhood looks so picturesque, too!", "hopeinseattle": "I love this photo so damn much! 😍", "ebonylouise83": "Question about the seat on this bike...how much does it hurt your butt?", "curvybellas": "Love it!❤️", "cortneymosher": "@keeleymosher tricycle!", "daigle.bagel.cream.cheese": "I need that bikini", "chriscrawford71592": "I would die for a masculine and non binary swim line from you and J 😍❤️😍❤️😍❤️😭😭😭!!!", "meg.boggs\nVerified": "Verified", "jennchiladas": "I love this so much", "rachi_ray": "Okay but I need this bikini 😍😭🔥", "kimiecakez": "Yaaaaassss you should. Make a fat bitch bikini and a tie dye happy fatty bikini💓💓💓", "moonchik68": "You look like you're having the time of your life. 😊 I bet that feels amazing. ✌", "somewhere_under_the_rainbow": "I'm bad at guessing but think I'd be greatttttt at collabing on a bikini lineeee 😉😉😉💜💜💜", "adamsel_in_this_dress": "You are seriously so adorable!", "j_fantini": "Wait, so where'd you get this bikini?!", "crazyaboutmyjellyroll": "💜💜💜", "anneandkathleen": "Fanny pack?!", "q_strom_99_walker": "💋💋💋💋💋💋💋", "hashbrownemotions": "Fanny pack?!", "margotmeanie": "I’m living for these joyful tricycle pics! They emit such joyful whimsy!", "candice.n.moran": "A plus size fanny pack?", "andie.gram": "living your best life", "hannah_rae_of_sunshine": "Is it that fanny pack?!?", "chayjoshlivy": "oh god please tell me it’s a fanny pack for fat bodies cause i can never find one that fits my waist!", "kayla_sandusky": "Omg I love you 💕", "drewmarywhite": "Okay, but where did you get the bikini? 😂😂", "nomnivorous": "Ok but I want that bikini and that bike! I've never really been able to ride bikes but that one seems doable.", "jaymmeer": "Waiting on that future bikini line!", "river.universe": "Oh bless, this is fucking adorable"}