{"din_astna": "👍", "champhuklal_gada": "Dadaji... @rytash good to see your dadaji.... m in love with your dadaji... great words for great person by great person... proud if him...", "k__i__r__t__i__": "I just lov d way u express urself !!! Salute , rytash!! Some1 who just don't care abt anything , just lives her lf , enjoying it ,❤❤❤", "garima.gdhingra": "Beautifully written 💕", "radha_aaa": "Beautifully written! I can read the pride and honor in between the lines.", "121krupadave": "Aww my goodness😍😍 today I got to know that you are also a Gujarati... I'm so happy to know that bcz I'm also one 😂proud to be a gujju", "debosenn": "I could feel the love for your grandfather in these lines..Hope we all be good humans like him😊", "ayoobfamily786": "Adab Komal didi (rytash)..Bhaut hi khubsoorat pic didi, ismein aapka pyar aapke pyare dad a Jii ke liye saff dikh raha hain😊❤. Death is completely a true thing jo sab ko ek din aani hain. Kya likha didi aapne is topic par, superb gyan hain😊👍. Shubrarti. Apna khayal rakhna didi aap 😊", "sanjana4you": "That’s sosososoos adorable ❤️❤️ @rytash", "preetamrai": "♥️", "sarita984_": "This is such a beautiful writeup! ❤ love to you & your dadu", "meghana_karne": "God bless u too mam😇😍", "natasha.mistry": "Lovely post. You are very lucky to have such a beautiful family. Best wishes", "karna.hariyani": "Soo good to see Dr rathore l. I have been blessed by him several times :)", "fatimamulla87": "N U R One Of The Fearless Soul I Had Seen, Always Be The Way You Are Today !!! @rytash", "sprightlyvishal": "Amen", "_garimajoshi": "I just love you ❤️", "seemasharma_12": "You are a fearless soul Rytasha didi", "priyanka.0124": "Your grandfather is great", "rhythm_state": "Y u making me cry ryda???", "sarikagangwal": "Love it 😘", "p.rare.na": "Reading this gave me goosebumps. Great soul your dadaji.", "mitesh.04": "I wish I had a superlike option for this click and caption @rytash ... Kaka is the most soft spoken person with a tremendous will power (as he can smile and tackle any situation graciously).. ♥️", "nautankikhush": "👌👌👌👌", "vikasraghavunofficial": "Respect..", "the_dream_queen": "❤️ rytasha 🤗", "chandan2104": "Hi @rytash.. still i don know ur actual name..if u could reply me ur actual name i will think my life is worth..waiting desperately for ur reply @rytash", "eathealthydrinkwaterliftheavy": "Oye teri yar ajj ta emotional HI krditta, this happens when words directly comes from ♥", "i.am_sonubadola": "Hi@rytash ...you are great ...really your post are inspiring and full of reality", "magoobourgoin": "Touching picture, touching words ❤️❤️❤️🙏🏻🙏🏻🙏🏻", "srabana_mukherjee": "Nice jory", "monisha_8": "Beautiful! Good souls teach good lessons. Wishing good health to 'Dadaji'.", "priyanka.jadhav_": "This is soo amazing... A great story to hear before the night ends and for new day to began... ❤❤❤Lots of love 😃", "itspihusand": "This is just......you know what I mean!♥️", "anahitauberoi": "Raitasha... Your grandfather is beautifully special. And so are you.", "minnienuts": "Your dadu is great", "farhinkureshi23": "It's so touching m just crying @rytash", "preetika_d": "Your post today @rytash reminded me of my paternal grandfather, who left us three years ago. I remember him telling my mother on the deathbed that she was a wonderful daughter in law, a mother who gave him grandchildren of whom he was very proud of, and also he happened to say Sorry to my mother for any mistakes which might have had happened during his lifetime knowingly or unknowingly. I miss my dadu because I remember how I used to play with his oh so little left hair on his head and many other things.", "shafefandi": "What a beautiful post ❤️ thank you for this 💕💋", "gtfilms.in": "Grt words..", "utkarshsps": "Truly wonderful post. Just one thing mam. As u have written \"of course he's my dada he cares about planet\". Plz don't connect traditions and customs with environment pollution. It hurt people's religious sentiments. Although even i want my all organs to be donated once I'm dead but its not becaude I think Hindu traditions are some bad or something like that. Its about choice. And traditions are something, specially in Hinduism, which have scientific reasonings. Plus you can't blame rituals and traditions for being environment unfriendly even when we are using phones, AC, Fridge, 2 wheelers, Cars, ATM, etc which harms the environment. Or we are supportibg industries which are harming the environemnt. I don't mean any offense to you ot anyone here but just thought I should atleast speak up. And yes, i felt truly inspired by uncle. Thank you for sharing his life story. :) @rytash", "vmaggiemahajan": "Undoubtedly this awesomeness is inherited - me not a big fan of your TV show but really enjoy your Insta post - thanks for sharing such a cute family moment", "frauleinteenaa": "I was touched by your words...your dadaji is truly a noble soul....it must be so divine to have non orthodox elders to guide you and support you.", "bansalpinka": "@rytash I think after reading you post, I too will tell my kids or grand kids to take up electric incinerator for me. Your dadu's thought was really wise. Taking up stand against rigid custome and society needs a lot of courage. 🙏🏽 RIP", "rahuldaconqueror": "One of the best things to read and feel on internet today(for me atleast).", "akshata_2414": "Inspirational. Now i am more obsessed about my goals😂 Ur grandpa was a real angel. And how proud should he be to have a granddaughter like you!! I am gonna \"killll it\" for sure. And about the Electric incinerator thought, man that was the wisest decision everrr! Thank you Rytash di for giving such courage and good thoughts to the people! Luck and love to you!!!❤❤❤", "tamannakukreja": "It's so touching we see the situation in ur words @rytash", "mehaksharmaaa": "Beautiful!!", "sophia0673": "True words", "varunanewatiya": "Deep❤", "beyondthethoughtss": "I am soo touched.. My nana used to say al these things when he was alive.. Life is beautiful gift❤ @rytash You'r such a pure soul..", "1_akshkaur": "Wonderful..", "manojsaini001": "चरण स्पर्श", "harsimran713": "That's the best think I've read in a while.... you're awesome ryt and so is your family", "eatdarlingeat": "This was beautiful", "oyemeghaa": "❤❤❤", "haranshh": "❤👣❤👣❤👣❤👣❤👣❤👣", "shw8ster": "It takes an undying spirit and an unbelievable zest for life in order to accept the present and live the way we're actually supposed to, minus the bubble of selfishness, greed and materialistic shenanigans. Kudos to your Dadu, he's one of a kind 💕", "vswaprita": "What an amazing person your grand father is... May he live healthy life..🙏", "smunjal7": "Uff 😭❤️", "sanyogita305": "Wowwww", "chingri_bhaat": "Reminds me of my late maternal grandmother, who left us in 2014. My Dida called us all and blessed us- on her deathbed she asked my mom to ensure that she was well dressed- red & white saree, with red lipstick (her favourite) she was so beautiful and I miss her so much! Your post beautifully summed up what I feel for my grandparents & hope to make them proud! 😁"}