{"daniellevanier\nVerified": "Verified", "amyupchurchh": "I'm Amy from Stratford-Upon-Avon, I'm only 16 but Im absolutely in love with your style and fashion choices. It's so nice to see people, like you, share their beauty with such a positive attitude!!", "saimassalon": "Thanks. Enjoy. My cousin and I were thinking of coming to Devon or Cornwall on holidays but it's so far to drive that I'm voting for somewhere on the west coast of Scotland instead. Last year I booked a house on the Mount Stuart estate on Bute and it was beautiful with a field of donkeys, horses and cows outside the Victorian building. My husband and I drove to Dorset for my friend's wedding as she lives in a tiny village there and it's a fair trek so Scotland seems easier.", "microchild_": "Hello, I'm Shannon, originally from the island of Guam now living in Los Angeles. I'm a curvy jazz singer in love with your bold and daring style. Thanks to you I have declared 2015 the year of the bikini! I'm turning 25 and it'll be my first ever :-) thank you for the inspiration <3", "scalescoleen": "I'm Coleen, living in Hawaii and trying to spread the love", "sassygal.k": "I'm Kelly and I am Colombian's Girl I love tour photos and everything about you. You are stunning. Someday I want tobe model and activist body positive", "dontcallmemela": "Hi @daniellevanier . I'm Melania and I come from Italy, Southern Italy! 😃🌊🌅 Of this IG I love your confidence and love seeing that you talk with your followers 👍, you're an inspiration to me as I mentioned in an another post....Keep it up! ❌❌", "abitofjess": "You're adorable @whatlauraloves !!! Thank you so much ! I am not on Twitter unfortunately (Now I regret😫) but my blog has the same name as me : \"abitofjess.com\" ! I will leave you a message on your blog with all my details ! You are truly a star ! 💋💋💋❤️❤️❤️ thank u again !", "whatlauraloves": "@abitofjess aw wow thanks so much Jess, best of luck for your blog. Send me the link on Twitter.com/whatlauraloves and I'll be happy to share it with my followers xxxxxx", "alissaraehill": "🌀🌀🌀", "_morenamiaa": "Hi lovelies! I'm Vanessa. I'm from Caracas, Venezuela! Im currently studying Museology and Art History. You are absolutely inspiring. I would like to see more ootd's. Much love, 💖💓", "thatbeautyandstylelife": "Hi, I'm Sarah 😊 I'm plus size and a fellow blogger. Your style is very sharp! X", "filipa_lourenco_s": "Hey. I'm Filipa, I live in Lisbon and I'm 22. I found your blog through Callie's blog and what I love most about you is your daring style :)", "curiousrobyn27": "I'm a married, plus-size lady human from Cape Town, South Africa. I'm a journalist, freelance writer and blogger. I also game and watch far too many Friends reruns. :)", "meredithgypsyglam": "I'm Meredith, a plus size actress and blogger touring the US! I love your looks and makeup 😘", "fattrophywife": "I'm Raylin, I live in Northern Alaska, ex cam girl turned wife/mommy, I just enjoy following other happy/successful plus size women, it adds a lot of positivity and inspiration to my life, living in a world that is so anti-fat, it's important to not feel alone in the battle.", "thewierdandcute": "Hello. Ny name is Mary and im from Norway. Im a plus size mom. And like to see other curvy ladyes like them self, i dont like my body. But trying.", "gicsome": "Hi! I'm Gisela and I own a ps clothing store in Argentina. I just started following you yesterday, so I'm taking my time to stalk you properly hehe. I love your sense of style and how amazingly put together you look. As I told you on FB, if I ever manage to look as put together as you do, I'll die a happy woman", "_xhennax_": "Hey, I'm Emma, I'm from SE London and what I love about your page is how confident you are with your style and that how much of a positive influence you are on those(including myself) about being happy and confident within yourself about everything in life 😊 following your IG has started to help me realise that I can be me and really not care what other people think (well I'm starting to lol long process but it's starting so thank you!! X)", "justanlagirl": "Hi :) I'm Linzi, 31 and I followed you via FFFB. I adore your style and you really do inspire me to wear braver stuff!!", "lifeoflongfoot1975": "Hi my name is Heidi I'm 39.. Nearly 40 plus size and love your style and like @justanlagirl trying to be brave..", "mascha.maggy": "My name is Mascha, 43 years old from Holland. Love your style!", "lyric_jazz_me": "Hi Danielle, I'm Jane, I'm 31 and live in Warrington (in between Liverpool and Manchester). I have a 2 year old little girl called Lyric. I love your IG as it always is so inspiring, both as fashion advice and in the confidence dept too- your inner beauty shines through in all your pics. I started following you and a few other plus size bloggers as I am aiming to find peace with my body once and for all, it gave me the most beautiful daughter so I need to love it for that!! Keep doing what you are doing! x", "___columbiagla___": "Bonjour. Je m'appelle Gladys j'ai 27 ans et je vis en Belgique. J'adore ta page car j'y trouve plein d'idées d'accessoires make up coiffure et tenues et surtout je te trouve très jolie... Donc tu es une réelle inspiration de la mode pour les rondes... Pour tout ça merci.", "mollken": "Hey, I'm Mollie from Warrington (in between Manchester and Liverpool). I'm 19, a size 22 and bloody love your IG/Blog! You've helped me realise that I can wear what I want, regardless of my shape and also to leave the leggings behind 😂 I'm super fashion conscious and actually enjoy shopping now rather than dreading it! Also down to your fab photos and posts I've found the best places to go the best things, so now I actually get compliments! Ahaha! Anyway your fab and gorgeous! Loads of love hun xxxx", "kc_marie_1986": "Hey :) I'm Casey 29 from Columbia, SC. I started following you because you give me courage to take chances in what I wear. regardless of size I'm a beautiful woman. thanks for being you.", "rebeh26": "Rebeca from Costa Rica, in search from some plus size inspiration I found you. Thank you for making me realized that I can wear whatever the eff I want! ;)", "_anastasiaaaaa": "Hi, my name is Anastasia, I am 15 years old. I started reading your blogs recently, I like how you try to trim clothing. It's fine when a person has a taste in clothes.😊😄😗", "curious_outdoor_photography": "I'm Demitri I live in Seattle Washington. I'm a project manager. I love your pics and the inspiration you give to women.", "emilyruthless": "Hi @Daniellevanler I'm Emily from Ohio in the States. I love following your positive attitude, while maintaining sass and class! Just helps me remember I'm allowed to be more than one # worth of awesome. <3", "sekinat_sanni": "Hi. 😊 My name is Sekinat and I am from Nigeria. I love your confidence and kindness. You really do appreciate others regardless of whether they are bloggers or not. Your style speaks mostly of strength to me and your gaze is so Brave and Awesome as well. In short, I love all that you are and all the unity among the plus size bloggers. Your Soul is absolutely beautiful, So I was captivated . ❤️❤️💋", "janelbettell": "@daniellevanier hello my lovey im 25 from se London work for debenhams head office fashion based i have to try the size 18 bikins swimwear and lingerie on for the girls all the time and quiet enjoy it yet to post a pic in them 😳so thought why not try blogging (all new to me duno what I'm doing tbh lol ) and spotted U and love your style make up enjoy Ur posts very 😘 ️xx", "shnmcq": "@daniellevanier I will definitely keep my eyes peeled. Thank you for writing back! Enjoy the rest of your journey on the train! 😊", "84_let_go": ":-)", "miss_chell87": "I'm Laura from Derby. My body confidence was at 0 after the birth of my daughters, but thanks to you, Callie and Georgia i'm learning to embrace my body! I found you via @rachel_hope87 :)", "daniellesan05": "Hi! I'm from Brazil and I really appreciate your style and your self confidence! That's an inspiration ;)", "krkeeny": "Hi I just recently started following you. I'm from Ohio in the good old USA. I love all of your plus size clothes you wear and your makeup! I've just recently started realizing you can be plus sized and still dress well! It's bloggers like you that helped me see this! Thank you :)", "rachel_hope87": "@daniellevanier like @misschell87 says, you @calliethorpe and Georgia are fabulous! It's so nice to be able to have girls like you sharing your style and confidence! It's definitely made me a bit more confident in myself 😊😊", "francy.andthesea": "Hello!!👋and nice to meet you! I'm Francesca 33 from Genoa Italy..honestly I don't remember how I found you, but now I'm hooked..I like your confidence and attitude and even if I have a different style I like your ideas/opinions/posts.. And loooove the make up! 😁😉", "lilroundbrownie": "Hey I'm Michaella from west London I love your pics and I feel like our fashion sense is similar so it's great to see what you can throw together. Most of all I follow you for inspiration as I hope to some day achieve your level of body confidence and pick my outfits cos I love them not always cos it's what I think hides my lumps the best 😘", "ivory_d_wine": "Hello, I'm Hanna from Finland. I love your pics and ladies like you are my heroes! I love your confidence and the way you look! <3", "binaporter": "I'm Christina! 24, mother to a 7 year old, living in Porter, TX! I'm a SAHM and I'm starting photography hopefully going full time during the summer! 💖 absolutely love your photos! Great inspiration 😊 I love how the world is changing, gives me hope for my daughter to grow um in a more loving world!", "fullerfigurefullerbust\nVerified": "Verified", "qimzel": "Hi! I'm Kim, 33 and I live in Belgium :) I love that you're just you! It's so inspirational to see a fellow spoonie going about her life and to see a fellow plussize woman dress the way you do! We still have a long way to go here in Belgium with plussize fashion, they're mostly tents.. Thank God for webshops! I love the brands I learn about through you :)", "realifeisized": "Hi! I'm Sara and I'm from Chicago in the US! I love your confidence! I've started blogging about ps fashion and amazing women who are kicking butt at their own lives. It's a pleasure to follow your IG!", "msjess3": "I'm Jessica, midland Texas, USA. mommy of one learning to love my body again. I love your confidence and fun demeanor. Plus, that eyebrow game is trill!", "fernanda2877": "Paola 37 New Jersey, USA, I am a housewife, I am a plus size, and my daughter too, I love everything, I am a happy person, I live my life without rules, lol @daniellevanier", "madameferreira": "Sandrine, France, 36, married, mother of 2 ... Ex realtor now taking time for my kids...fashion and design addicted..started following you by chance, and liked it! Love your style and the fact you are not sectarian about size... Your style is not defined by a size ;-)", "dammilove": "Hiya I'm dammi... from south London would love to know how you got started in the bloggersphere . .. love your style. It's daring at times, sophisticated and just fabulous really... I'd love to see an evening/red carpet look and work wear ... stay beautiful and fabulous xx", "imsoofrancy": "My names Fran 😊 I work for an online fashion company and live in manchester. I am so passionate about the plus size industry and love meeting new people who are too 😊 I'm about to start a fashion blog after being inspired by you and other bloggers that i have been following 😊😘", "loveable_kay": "Karla, 26, from California... I'm a nurse.. I love clothes, heels and make up haha and just about everything you post on IG, We have similar taste.. I've always been plus size and I have always been confident with my body and I love that you do the same and show girls that it's ok to not be a \"normal\"size, all women are beautiful... Keep up the fabulousness 💁", "taiyita": "Hey girl! I'm Claudia, from California and been following you since forever. Love your style, I've definitely purchased a lot you've featured but give it my own little spin. Thanks for being such a fashion inspiration 😘", "carlywrightt_": "Hi, I'm Carly, 31, mother of 2 young boys, near Edinburgh. I'm plus size and adore your blog and IG, never fails to give me inspiration. I've lost my fashion mojo a bit as tend to live in my 'mum' uniform of jeans and baggy tops but blogs like yours are slowly helping me get back there. Keep up the good work! C x", "aliboopuff": "Hi I'm Alex, 27 live in Wickford and work in Stratford....follow this page because you have the most amazing gift of putting things together I would never think to put together and they always looks fab, your make up is always flawless...and you have become a big inspiration of mine ...I'm becoming braver with my fashion choices xxx", "sara__benni": "My name is Sara, i'm 17 and i'm from italy. I love your style, all that you wear i think that's amazing and so you ispire me to be like you. You are such an ispiration for me!! I'm a plus size too and i'm so happy to see that a plus size girl can be beautiful and can be an ispiration for a lot of people. Thank you so much xx 😘😘 @daniellevanier", "begrandsure": "@daniellevanier I'm clodagh from Ireland, I'm 19 and in my 3rd year in college ! I love your instagram and I always look into what you're wearing and get a few pieces myself 💕 thanks for being fabulous 💕🙈🙌😍🎉", "fatkneadybitch": "My name is Makayla, I'm 25 and I'm a disabled fat femme from the US. I've made a conscious effort to surround myself with women whose bodies and attitudes about them match my own, and I have been following you for more than a year. But what caught my attention was those brows, girl! Always perfect!", "uberhellie": "Helen, 24, Glasgow. Love your impeccable taste & the fact that it's super eclectic, so I love seeing your looks. Makes me want to take more pics & doll myself up more because you look dyno in everything you put on and it inspires me to try new looks! Also love that you rep for the plus sized ladies such as myself 💖 maybe more makeup themed posts would be good as your makeup's always stunning but I'm loving your IG as is!", "ashley_o85": "I'm Ashley 😊 I'm from Arizona down in the states. Yay international followers! 👍 I have a love for makeup, fashion and most importantly amazing, talented, strong, beautiful people. And you fit the bill my dear. Love your confidence and beauty. ❤️💋", "charliciousxo": "Charlotte 19, Walthamstow/Bournemouth. I found you after reading buzzfeed's list of top plus size bloggers, you've inspired me to carry on being creative and brave with the way I dress, it's so nice to have some beautiful plus size women to look up to 👯", "rachedwards77": "Hi I'm Rachel from Norfolk I'm 38 and I really love how you show me that you can be stylish and fashionable without being a size 10 I take a lot of stylish tips from you! Your make up is amazing as well (I can't copy that I'm rubbish! Xx", "xlupita.x": "Hey there! I'm from California, 18 Mexican-American. I love everything about your page! Your looks are always on point, thanks for being an inspiration for many of us! :)", "the_wild_daughter_of_the_moon": "Liah from Costa Rica. Love your looks.", "f_may": "My name is Faye I am 30 and live in West Sussex- I am not plus sized I just love your style and confidence. I often do not feel confident when shopping for clothes and never know what I should get/ what suits me- i love to get ideas and inspiration from your posts as you always look fab 😬👌", "miercoles15": "My name is Melanie, I'm 22 years old and I'm from Barcelona, Spain and what I like about your page is the confidence that you show, it's so great! :D", "rrrooarr": "Hi! I'm Anne-Sophie, 35 French Canadian, and I love your sense of style and wonderdul taste, inspiring me and giving me self confidence. I also love the fact that you're friend with @fullerfigurefullerbust whom I also follow! You guys are just wonderfull. ❤️👠👙👗", "bellajoei681": "Hi I'm Joei 37, from Bloomfield, NJ - USA, I love your bodyconfidence, makeup , & def dig your style!", "macl333": "Hi, I'm Julia 30 from Germany. I used to live in London before and whenever I see pics of u, it reminds me of my second home. And of cos I like ur Style.", "bonnieboo89": "Bonnie, 25 - west wales - you make me feel a little braver with my fashion choices and I want to see more of your beautiful face! 😍 haha", "sallysparkel": "@daniellevanier I'm in South London plus size hairdresser... I love watching you styling outfits.. Very positive 💖", "shabeeshoo": "From France 😍 29yo . @stephaniezwicky mentioned you and @calliethorpe on her blog . I've taken a look at your's and I've decided to follow you on Instagram 😉 😘", "elizajo": "Hi I'm Liz from birmingham, love your page as it sparks a little confidence in myself", "_classycurves_": "hey babe👭 I am Steffi, 25 and I live in Germany. After a London trip I found your page and you always remind me of london and the wonderful ppl there. I love your style and I think you are a beauty inside and out. next time Iam in london we need to hangout ❤️", "asimplemachine31": "Mary Jo, 32, from Kentucky. You're an inspiration to us girls and you're so beautiful! Learning daily to love me for me. Follow me back :)", "davinyah": "I am Davinya, in my twenties, from London. I love your outfit combos and your attitude, inspiring me to wear whatever I want and love my body.", "daisyhollands": "I'm Daisy and I love that pic! I'm a (new) PS blogger. I live in Shropshire. I love your outfits and your attitude. :-)", "sw.mrsweir": "I'm Amanda 31 from glasgow :) x", "incaseofbrit": "I'm also on a long train journey @daniellevanier let's be train buddies. Further more our hangout is long overdue 😊", "free.dom.found": "Nombi- live in Harare, Zimbabwe. (Southern Africa)", "stargirl1_": "Hi there, Im Marie, 24, Czech rep., student of University of Defence ;)", "danielle_mann_": "Danielle 32 from Sth Oxford. Just adore your style and your make-up! You ooze confidence and as a curvy girl it's just so refreshing to see someone 'think outside the box' 😘", "dora.mlinaric": "I'm Dora, from Croatia but live in Denmark :) loveeeee fashion, make up and SHOES 😄 And I love your page because you inspire me to be confident and positive and just be me 😊 love everythinh about this page, don't change xx @daniellevanier", "malenefl": "Hi! I'm Malene. I'm from Denmark, 25 years old, a new mom and doing a bit of plus size blogging. You're a great inspiration to me ☺️", "clair.r.75": "Hi I'm Clair from Leicester & I love your page,always something interesting going on...keep up the good work @daniellevanier 💭💭", "bikehfoul": "Hi ! I'm Kelly, 24, live in Paris, love all about fashion and makeup and you did it right so in love with your style, you're amaze ❤️❤️", "zawszepetite": "Poland loves You!:)", "paquisserie": "Im Léa from France !!!!!!! I love youuuuuuuu", "amandaredfern2": "Hi lovely, I'm Amanda, I live in Stoke-on-Trent & im a size 18. I love everything about this page you are a true inspiration my dear xx", "katieandbabies": "Kate south east London 28 - loving your look your attitude and dem brows 👌 since I stumbled upon you quite some time ago you've inspired me to think outside the box fashion wise - I look at your old outfits on a regular for inspiration before nights out/events I'm going too! 💁"}