{"see_fairer": "Flawless😍💯", "mrsanniesinclairbonner": "Hope you start to feel better soon lovely. Can highly recommend counselling/CBT - I found it very helpful in letting go of some baggage and generally feel much happier in myself. Also an old favourite that always helps me feel better, a visit & some quality time with my mum - they make everything better ❤️😘", "style_mum": "Oh babe, I’ve just read this! You are an absolutely incredible person, one of life’s gems. See you tomorrow my darling for a squeeze and catch up ❤️❤️", "lisafeesa": "I think this time in life is soooo hard.. I really struggled in my 30s and constantly compared myself to others and felt like nothing was going my way - relationships, work, friendships .. but it does get easier.. keep doing what your doing and things do have a habit of working out.. and maybe get some therapy or find something that you love doing that quietens your mind - painting, music, new sport.. wine tasting ?!? Whatever just be kind to yourself and have faith that your bloody amazing and things have a habit of working out.. they did for me 😘😍xx", "karen200391": "❤️❤️❤️", "emer_a": "You are so amazing at what you do and an inspiration to so many of us, don’t doubt that because you’re going through a difficult time. And therapy is always a great option!", "lihoujazmin": "Yes to therapy. It’s changed everything for me. The best place to start is just to start. Once you’ve determined the kind of therapy you’re looking for make appointments and shop around. Don’t be discourage if you meet a professional or two that’s not the right fit. Keep trying - someone will stick. Thank you for being so open and vulnerable on this platform. It’s inspiring ✨", "akraften": "💗💗", "jlcan36": "Be proud of yourself for taking the step to even consider therapy 😘..just find someone you can talk to comfortably who listens and respects what you say ❤️", "helencravenradio": "Danielle - @shazneyspence_successcoach is utterly wonderful at helping people with those open tabs; sort things through, create amazing vision boards, seek clarity. She’s calm and brilliant x", "laurenpops": "Love u 💗", "everydayjoyandme": "❤❤❤❤", "the.positive.pineapple": "You are on your own wonderful path girl, never compare yourself to others! Try your GP as you first point of call - ask to be referred or ask if you can refer yourself as that is also an option. Google is also a good way of searching places nearby to you that offer the services you need and also finding out what kind of therapy is best for the things you want to discuss as there are so many different types. Hope this helps you Queen 👑💕🍍", "theneonorb": "You’re a babe who inspires so many ladies out there and makes us feel like babes too. Have you ever met with a life coach? I’m motivated by goals & like to be given practical work and my coach has really helped me navigate stressful times to fully understand myself & my wants/needs again. Also, Brene Brown.", "jessontheplussize\nVerified": "Verified", "shaun_oskooie": "Mo’ money, mo’ problems 👨‍💻", "suepollard1070": "Ah we can all get overwhelmed sometimes, most of the time! And social media doesn’t really help even though there are such lovely supportive communities 👍🏻 but you have taken the first step by acknowledging you need help which is a good start. You can ask your gp for advice too. Take care of yourself 😘💖", "melafrique": "❤️", "h_e.l.e_n": "Go for some therapy! I have found it invaluable whenever I am stuck. Don't worry where to start, just make a start and a therapist should have the knack of helping with this. Have you ever tried writing down your thoughts? That might close some tabs for a while???", "beatlin": "❤️", "siaalex": "It’s as simple as googling Psychotherapist in your area. It’s the best money I ever spent. It’s their job to help you make sense of it all and giving you the coping mechanisms for the future. It feels like a big step but honestly everyone at some point needs that little bit of help @daniellevanier 💗", "beetourist": "Thank you for featuring this beautiful dress! I bought it for myself for my birthday and I feel a billion bucks in it 💗", "pinkrumba": "I have this lovely dress! It’s so gorgeous isn’t it! 🤗💕✨💙", "ohmamajohnson3": "Still obsessed with this look 💕", "mrs_santos_to_you": "I totally get this! Therapy was so helpful for me. My faith is what grounds me. Praying when my mind spaghetti (what we call it in our house when everything gets messing in our head) I is essential oils for calming too! Also reaching out for the support around you is so important! ♥️💗", "fisayolonge\nVerified": "Verified", "wendyk70": "I’ve had to have therapy because my anxiety was way out of control I’m so glad I did I had talking and cbt I was lucky to be able to self refer myself to local services ask your Gp hun xx", "charlieuk87": "I tried Hypnotherapy, its a great way to sort out the chaos of your thoughts and feelings. It deep delves and helps you find your own way to deal with things and addresses the pushed down, ignored feelings. I went in really sceptical, thinking I had one issue I wanted to address when in actual fact it was a completely different issue that was causing my pain and stress. It might not work for everyone but always worth a try. Hope this helps 💜", "bethbluu": "Love this! 😍", "lauraleighchapman": "I googled a few key phrases, spoke to a few therapists over the phone, before a trial meet-up session with the one I felt the best bond with. It was one of the best things I've ever done. We worked together for a good few months and it was life-changing. Don't worry if the first person you try isn't a good fit, someone will be right for you. Do try it. Love and all good wishes 🧡", "lizzydive": "@daniellevanier But you are my favourite. I just think you are such a kind, beautiful and funny person with kick ass talent for fashion and beauty. All advice I take from you. Believe me. You have to decide if you are still enjoying this? Is it something you want to do? You are exceptional at it. But above all, does it make YOU happy? Xx", "ashleylouisejames\nVerified": "Verified", "ozontheruneating": "A profound pschychedelic experience will help you on the right path", "magentawillow": "Work wise, you are awesome! You have the best Instagram and work on the most amazing campaigns! So don't worry over that. As for the other stuff, see if you can find a local CBT practitioner, ask your gp to point you in the right direction x", "mizzp1971": "@daniellevanier it’s hard to open up or even know where to Start but I would go to your GP first and have a Chat and ask them to Refer you, I have had Counselling and CBT, both helped but I definitely need more, like you I live with Chronic Pain and have had the last three Weeks off Work, not in a good Headspace and you feel like everything is caving in, but one step at a time Lovey, with your Job and being Self-Employed you’ll hit the Highs and Low, it will Pass, never look at what the others are doing, their Truth is not yours and we only see what they want us to see,it’s hard but look after you, Sending Love,Hugs and Good Vibes ❤️❤️❤️", "frockmeimfamous": "Sending you all of the love my angel ❤️❤️xxxx", "zeewarriorprin": "Sending you lots of love 💕 ❤️", "lucylucydot": "Do it - a therapist will help you unpack the boxes and feel better 💜 https://www.bacp.co.uk/search/Therapists", "megan_rose_lane\nVerified": "Verified", "kittyunderhillx": "Oh pal, I really sympathise. Modelling’s not been so busy for me at the moment, I’ve been uninspired and don’t want to post anything. It can really get me down. Honestly, counselling has been something that has helped me so much along the way, I would definitely recommend it! I’ve heard good things about Better Help. I found my counsellor on counselling-directory.org.uk but they have trained therapists in there too, and you can search depending on how much you want to spend/what area they’re in, and their areas of expertise too. Hope things feel lighter and easier soon ♥️♥️", "ajodudu\nVerified": "Verified", "amyduffin1991": "CBT is amazing, I have gone to see an incredible woman on and off over the last seven years. So hard to get yourself geared up to go but having an outsider perspective and realistic/manageable strategies has helped me deal with traumatic experiences, my perfectionist character and most recently with my fibromyalgia. Sending you lots of well wishes 💕", "ellencking": "100% recommend therapy. I think that everyone should have access to it and be able to go, just to hash it all out with someone completely unbiased who will be able to pick up on certain threads in thought patterns and help you work out reasons and coping mechanisms. It's improved my life so, so much. I'd recommend psychodynamic therapy to start with! Have a think about the sort of person you'd be happy to talk to (for me, it was a youngish woman) and see if there are any in your area. You can usually do a taster trial session to decide if they'll work well with you or not. Good luck!💕", "inforapound": "Finding the right therapist can be hard but it's so important, so my advice would be to keep trying different practitioners until you find someone you click with and who gets you.", "rockonrubyxx": "Your account is one of the one so enjoy following the most. You are gorgeous, beyond stylish and refreshingly honest (we’d work with you in a heartbeat! 💕😂) I think therapy isn’t maybe talked about in the UK as much as it is in other countries, but still very much a thing. Sounds like you maybe just need a bit of clarity and calm to get back to feeling like your normal self ❤️❤️❤️", "jooliewooliee": "I completely understand! I’m feeling the same.... anxiety is hideous and it rules (at times) everyday everything...... I constantly put myself down and constantly wonder if I’m doing a good job (I have my own business too) all I can say is you’re totally awesome, amazing and a true inspiration! Don’t ever stop what you do! Sometimes you do need to unpack your head and repack. I also suffer with chronic pain too.... but for what it’s worth I think you’re doing fabulous ps see a counsellor the CBT it will help you enormously! Xxx", "dianasaladpot": "Basically you pick a therapist from a list like the tabs you have open - if you’re paying instead of waiting forever for nhs - and see if you click. If you don’t that ok, it’s like friends or jobs, sometimes you need to try a few. Your first might be a great fit but if it isn’t you move on after a few sessions.", "shelbyplus": "Therapy is one of the best things that ever happened to me. It feels super daunting to find someone you trust, but sometimes you click right away and sharing those things becomes natural. Don’t let the fear hold you back from trying, it’s worth it❤️", "jenmell73": "No advice at the moment. Just a little virtual hug. 💖. Ps. You smash it all the time!!", "emmanuellejeannette": "Life can be a lot sometimes. But therapy can really, really help. Find someone you feel comfortable with. My therapist really helped me organize, and deal with, all those open tabs in my head and really just gave me some tools to make them less overwhelming. 100% recommend. ♥️ I can only speak for myself (but scrolling through the comments makes me feel I'm not the only one who feels this way) : You are an absolute queen and I love you and your content. You never fail to inspire and put a smile on my face. That being said, don't worry about your followers, we ain't going anywhere. We all need some me-time every now and than. So take good care of yourself! Lots of love 💕", "thisismeagankerr": "Sending you a big ol hug Danie. I got referred to my therapist by my GP, but I also shopped around a bit because the first few people I just didn’t connect with.", "kayyyciaaa": "I’ve heard Talkspace is really good. It’s accessible, you can text, call, or video chat with a therapist of your choosing. I think it’s pricy (I’m not really sure) but I listen to a few podcasts who run ADs on Talkspace that offer discount codes (for example, The Read, the Friendzone, Gettin’ Grown, etc.) I hope this helps and I hope you feel better. I’m in a similar boat and I’ll also be looking into seeing a therapist as well. This sounds cliche but just tackle one thing at a time and celebrate the small wins and try and do something to get you out of your comfort. This is what I try to tell myself when I’m overthinking and being super critical of myself. I hope you have a wonderful Thursday 😊❤️❤️❤️", "carocaro72": "Check out These Three Words by Jess Van der Hoech excellent book. It’s anxiety babe practice bubble breathing and be kind to you xx", "tabitharjones": "Always write down bullet points of what’s on your mind on a piece of paper before you go to sleep to help your mind relax and to sleep well. A tip from my Mum and you know Mum’s know best!", "life_with_ivycoco": "Oh gorgeous girl I totally feel you! ❤️❤️", "mslanebarry": "Good luck Danie, you'll get there xxxx", "thispositivepsychologist": "There’s a few things you can do... if you google IAPT in your location you should find a website for your local NHS service - you can self refer. They will most likely offer you CBT (which I rate but I am biased being a CBT therapist myself) I know that in the service I work in we would be able to work with you on all the topics you mention. You could go private... if you want to DM me I can maybe recommend someone in your area or at least point you in the right direction x", "sarahlouwho82": "I just started seeing a therapist last month, and it’s amazing! I got her name from a friend. I actually got a few names from a few friends and then did a little google researching to find one that felt right. Good for you for looking for support. It took me a long time (and a lot of anxiety to be totally honest) to finally take the step and I’m SO glad I did it! Best of luck to you - sending you lots of good vibes 😘", "williamjwade": "Keep your head up angel and keep shining you’re doing great I tell ya x", "mama.lupi": "Honestly therapy saved my life. I can’t recommend it enough. Try it. Nothing to loose. Talk to a few therapists then choose. I spoke to 3 before I choose the one and three years later ... she’s my solace. I love it. Xxx", "emzskye": "You can self refer to nhs therapy just a simple google search for your location and you will find one. It was the best thing I did! Shitty work life was having a massive impact on my day to day. My anxiety went through the roof. On the phone weekly session for me but there are so many options out there! It help me massively just to focus on the what’s and why’s and the things I had no control of. Speaking to someone you don’t know is sometimes the best thing. I wish you all the best. You are amazing ♥️", "claire_h_williams": "Firstly - sending big hugs! I’ve been through this (and still going through it somewhat). I’ve had a lot of issues, have a Adenomyosis and fibro, anxiety and stress cause me to have tremors and seizures...it’s really affected me. I’m freelance and as you know, time off means no money. This has caused such a vicious cycle of crap. I’m in debt due to not working, feel that my life’s on pause, my new marriage had been hit hard by all this...I had too much to work through. I needed guidance so decided to get a life coach. She helped me tackle each of my problems and work out goals. We really talk about everything; goals, motives, fears etc. Since we started I started studying part time, managed to incorporate a bit of exercise, focus my career goals and also push for a much needed operation (which I’m super close to getting). Having someone to listen, guide and also hold me accountable (in the nicest way possible) has changed my life xxx", "shertpants": "Psychology.com has a search function (at least in the US) where you can search by postal code and start off with a list of providers. Maybe there is something equivalent in the UK at the very least! That’s how I found my current therapist and she’s my total rock. Hoping that you get some peace soon 🧡❤️", "madam.jilapi": "@daniellevanier - you are literally excellent at what you do, please don’t doubt yourself to be otherwise. This culture of forced positivity and constant #killingit #bosslady vibes 🙄 has us all anxious and doubting our skills and wondering if we will ever be / do enough, so also please also don’t feel alone. To pick myself up from the dumps it always help me to spend some QT with my friends. And yes also more structured channels like therapy (with a good therapist) can over time help develop better coping techniques. Besos!", "elizabethpaintshernails": "Quiet a loud mind. First, give yourself a break, we all struggle. Second, therapy is usually a great idea, but if not therapy I highly recommend journaling. Nothing crazy- it can start as a to do list. It helps me.", "lovebeyondstars2015": "You look so amazing in that beautiful dress. I hope you find a lovely person to talk to. You spread so much joy: you deserve joy right back.", "jstoriesforever": "❤️", "mariavdp1": "Maybe start with some on line stuff ....there are amazing websites that have counselling options,self care strategies and programmes to work through", "sarajeano": "Still the best at what you do. Been following you and @calliethorpe for years from across the pond. 💜", "bryoneycook": "Any good therapist can and WILL deal with those things. Bear in mind many free services/NHS services depending on where you are, can only offer time limited therapy, so anywhere between 6/8/12 sessions. It really should be guided by you as to when it finishes and the one thing my clients said to me when I was on the 6th session (I was a student counsellor at a charitable organisation - loved it but 6 sessions flies in with each client) is that they often felt they needed more time. Also, don't be frightened after an initial meeting with a counsellor to not take up their services - the therapeutic relationship is important and it needs to be someone you gel with. There are lots of different approaches too, but not one approach fits all, so Integrative or pluralistic counsellors are skilled in many approaches - helpful when theres a lot going on. It sounds a lot, but honestly it's best if you don't feel comfortable to find someone else. The Counselling Directory is really good and generally has accredited counsellors, meaning they have either studied AT least to PG Dip level or have been assessed on over 450 hours of client time. Spot the Counselling nerd here. Ultimately, just look after yourself 💜", "staceylauren2910": "Hi Danie, I don’t know if this is an avenue that could be possible but... I work in advertising for a magazine publisher and they are always encouraging us to use a charity called NABS (national advertising benevolent society) they offer talks, workshops and therapy sessions all free of charge. It’s for media professionals but seeing as you create content and work on ad campaigns, you could well fall under that umbrella. A few colleagues have used them for various things and honestly can’t rate them enough. See if they can help 💜", "elle_c_emm": "That third para. I could have written that. I don’t even know which bit of my life to tackle first 🙈 And how do you make the headspace to try and start unraveling it all yourself to find the starting point? Sorry, I know that’s not advice, but please know you’re not alone x", "kidscookingandcosy": "The ‘Priory Group’ can be a great place to start if you want highly qualified therapists. For each site you can access all staff, from therapists to Psychologists and Psychiatrists, and read the description and qualifications of each to find the one that sounds most suited. We’ve used the Priory Group twice across our family for different reasons. Because of these experiences I embarked on a Psychology degree which I finish next year. Powerful stuff when you’re in the right hands. I believe you can also contact the group and they can help you find an appropriate practitioner too. Wishing you well xxx", "katiemaymedley": "👏🏻 THE RA PY is the best 🤘🏻 Go see ten of them for free half hour (normally standard), choose your one ☝🏻", "isabel_hendrix\nVerified": "Verified", "gaynormrandall": "Wow some amazing advice here and if you think that therapy will help you, do it. Also I was thinking pack your bags and go stay with your parents for a while, maybe even go with them for a little Holiday if you can because Whenever I see you with you’re parents, you laugh uncontrollably you have thee most amazing relationship with your family and they may just be what you need, the people you love and who love you the most and with them your back to being who were before all of this before everything and maybe u need to find that Danielle again to find yourself again and then you will remember what it was you wanted to do with your life and realise how much you have actually already achieved so bloody much. For the record I think your amazing 😍and sending you lots hugs 🤗 xxx", "handeacon": "I found my current therapist on www.counselling-directory.org.uk, you can read about the kind of therapy they offer and shoot off multiple emails to multiple different people, kinda like window shopping for a therapist. it's a fantastic resource xxx", "ccatherine_collins": "Definitely see someone if you are thinking about it! Your regular doc should be able to refer you or do your own internet search before hand if you want to look at your options. You won’t always click with your first one and that’s ok - it’s ok to try a few people if you need to... someone you are comfortable opening up with is the most important thing! Just try someone and go from there. Good luck!", "bethprice245": "I’ve recently started counselling, it’s early days but I think it will be helpful. I used an online directory to find counsellors in my area who specialised in the type of things I wanted to address and then contacted a few I liked the sound of. Most will offer a free telephone consultation so you can see if they’d be someone you’d be comfortable talking to and if it’s a good fit. I went for someone who offered a mix of CBT (coping mechanisms for anxiety) and humanistic (looking into what events in your life contributed to your issues and processing them healthily) therapy. I’m glad everyone is becoming more open and mental health and I think therapy needs to be normalised 💕", "lipstick_and_flick": "Something I find helps is to write down the thoughts that keep reoccurring. Then, categorise them - do I have any control/say in this? If not, I write next to the thought ‘there’s nothing I can do’. If I can do something about it, I prioritise and make an action plan with small goals a day. It might not work for everyone, but I find the visual reminder of what I can and can’t do really helps to focus my thoughts. Hope you come through the fog soon. xx", "fromsarahlex": "Was not prepared for this level of amazingness. Sending you so much love x", "gomcp": "The 1st thing to do is recognize that there is an issue & to STOP feeling guilty about it. Take the time to take care of you, worry about the rest LATER 👍🏽‼️", "_shazea": "the first thing you will have to do is work out what you want to work through first! if it's your fibro your doctor should be able to refer to you to somewhere like health psychology or pain management clinics but with everything else you're describing it would be more cbt based unless you want to try generic counselling/therapy to sus it out first! id recommend finding somewhere that is self referral first as they're usually quicker than the waiting lists xx", "inpolife": "❤️❤️", "sineadcuddihy": "Definitely! Everyone should be in therapy, if they can! Ask around, talk to your GP, google - it’s a bit like internet dating, you’ll get a good sense of them online and then see if you click when you meet in person. 💗", "kittycowell": "Love you mate. Have you tried the WYSA app? I was using it for a bit and found it great. I also think trying therapy is always a good shout. It might not be for you but it could be life changing. Xx", "janberry7": "It’s okay to feel overwhelmed by it all. Finding a therapist will be life changing in a positive way! I only know you are worth everything dear- ask friends for recommendations and search until you find the right fit. I’m a social worker talk therapist and I predict you are an excellent candidate for talk therapy! ❤️", "sallysquiggles": "I would strongly recommend therapy. I had some after miscarriages which lead to a massive breakdown... Therapy really helped me to organise my thoughts about many things but also gave me some coping strategies for my anxiety. You may benefit from speaking to your GP who could point you in the right direction of the right therapist. Really sorry to read this but just know that you can manage your mental health, the very fact the fact that you have asked this question shows that you value it and understand it needs care and attention as much as anything else. Sending you all the love and good vibes, trust yourself xxx", "bisbiserka": "Your GP may have a pain clinic or know one in your area to refer you to on the NHS- the therapists who work there will be specially trained for chronic pain conditions but will also have general therapy qualifications so can deal with all the other life stuff too & won't force you into talking about just your pain. If you want to go private look at the BACP therapist directory- all licensed therapists from any professional discipline in the UK will be on there", "roiseg": "Therapy is always a good idea. And finding a good therapist is a little bit like dating... if you’re not feeling it with the first one you meet shop around til you find the right fit.", "stephaniedjl": "Sending you love, beaut ♥️♥️ a therapist sounds like it could be a good idea, finding a good one takes work though. If you’re not looking to go through your gp & be put on a waiting list, some places have websites with bios you can read through xx", "katemelsom": "Therapy is essential. It’s been incredibly important for me at different points in my life, and I wholeheartedly recommend it to all. You have loads of great recommendations on here, so I won’t pile in. But to say, talking about what’s going on for you, dedicated time for your heart and mind, is some of the toughest, most worthy gifts you can give yourself. Life changing. Wishing you strength xx", "aashgasm": "I find that you try many until you find the right one. I have a therapist now that I love but I tried many I didn’t! BE HONEST with yourself and with them about all your bad habits all your anxiety. The best thing a therapist can do is be there for you and help you feel assured and they can’t do that if you don’t feel the right vibes and you don’t keep it real. Just my little piece of advice.", "carms887": "Therapy is a bit of a minefield, as a therapist I would say find one that fits for you, you have to be able to build a relationship with them to feel comfortable and safe enough to open up all the things you want to explore. There are many therapists and it depends what you want to try. I'm an Art Psychotherapist and use art making as a way for people to express their emotions it gives opportunity to explore things in a none threatening way and without emphasis on needing to verbalise everyrhing", "monaseyesbeauty": "Awww my love I hope you are feeling better now. You are slaying in this gif by the way. If you ever need to talk I’m alway here. Seriously!!!", "v.w.h.m": "Yes!! Go see a therapist, best decision of my life and i keep seeing her when i have low points in my life... sometimes life is just overwhelming and who says that you have to come up with the answers yourself or that your friends or family might have them? Research therapists before you go and find what suits you. My therapist always is really gentle with me at the start of sessions but also knows when i am feeling sorry for myself and just need a kick in the butt! Ask around if friends have had good experiences with their therapists. Stay strong and remember , you are not alone❤️❤️❤️", "megan_grey90": "I love following you, you are fabulous. Keep going lovely xx", "_kom_": "You look fabulous just so you know 😘💕", "kinlochbervie": "Maybe try a phone or video chat therapist first - see if you like it. It’s definitely good to talk about your feelings with an impartial party. They are good at perspective...and then go put with your friends and have them remind you of how awesome you are!", "mrshayward17": "Also find that getting outside and being in nature (even if it's just sitting on the grass in the garden or having a walk around the park) massively helps me to feel calm and to put things into perspective when I need it! What you're feeling is so, so normal, you're honestly not alone! Big hugs hun Xxx", "crawshawmike_": "Have you thought about a therapist and a good business manager/mentor? You seem to so creative and full of ideas. May be you need someone who understands you, how you can work and keep life in balance and how to find a structure to help you move forward. Most importantly you need to be you and continue to do the great stuff you are doing here.", "kellyblade": "Sending 💖💖", "sulsworld": "I know how you feel babe", "tricernarwhalicorn": "Therapy has been so valuable to me and my life. I wouldn’t be here if it weren’t for therapy. You can shop around and hold out for the therapist that clicks with you. Good luck! 💖", "theweewanderingscot": "@daniellevanier it’s like you just described my every worry and feelings of anxiety over it all at the moment. Just know that you are not alone. Mercury is in retrograde for me till the end of the month and it has me all@over the place. I did however go to a mindfulness class the other night for the first time ever as I felt I was in some serious need for some help in managing all the open tabs in my head. In the class they taught me some tools on meditation and how to be present and selective with my own thoughts. It was super helpful. Our worries and stresses in life are just our stories affecting us and if we try to take ourselves out of the stories and look at them with an outside perspective it makes things much easier to manage. Stay strong lovely lady. I hope you find some way to ease your mind soon xx 💙", "nicoleocran": "Sending so much love ❤️❤️❤️", "emyas73": "I can relate to this post soo much the last 6 months have been really hard for me emotionally and mentally.. it’s hard because we have a front which we all put on and don’t let anyone in and see the real us. I know it’s of little consolation but I think you are incredible, a great influencer, a trend setter and basically you make this world a nicer place. Hang on in there and we hope to see your beautiful face and heart ❣ smile 😃 always 💖xx", "victoriajanemorris": "You’re wonderful. Keep being you! Talking is always good 🤗", "samantha_editor": "This 🙌 i think is so common for people of our age. So much pressure to be everything to everyone and go at 100mph constantly and it's exhausting. Hope you feel better soon x", "mrsmalikthe1st": "❤️", "gayleb1979": "A good life/career coach type person might be of benefit too x", "parkyv87": "Sorry no great tips @daniellevanier that won’t sound too condescending/cliche but know you are a great person and from what we do see of your life you seem loved by the people around you and great at what you are doing. My mind has run away with me in the past but it did stop and I caught up with it! Talking defo helps, chat to someone, anyone. Hope your back soon 💞 xx", "accessible_rach": "No one is rushing you just thinking about you, I got referred for CBT from CFS clinic but it wasn't for me I ended up paying for a lifestyle coach who was amazing and I still email her now if I need a rant ....take it easy lovely xxx", "stickysweetdanish": "Mindfulness and meditation are great tools, too. Know that you’re not alone in all of this and so many of us can relate ❤️", "samantha_nivia_": "🔥🔥🙌🏻🙌🏻", "elenalucie": "Love you so very much DV 🖤 If you look at the counselling directory website you can search for therapists based on their areas of expertise, it’s really helpful. Therapy is worth a shot if you’re struggling to know where to start addressing things. You will move through this, I promise.", "inmysundaybest": "La la love yewww ♥️", "jessiicalucy": "💖💖", "gtgmcg": "I’m a MH commissioner so I’m happy to have a chat if that’s helpful. DM me. To be honest initially I’d point you to your local IAPT service. It’s free but you might have to wait a little bit. It’s predominantly CBT based but for a lot of people doing CBT helps to get the best out of counselling or therapy. IAPT will also provide sessions of 1 to 1 therapy too. I found it really helpful in a very stressful period in my life.", "bottrill": "Babe I found a therapist through @welldoinguk they have a personalised matching service which I can vouch for, it’s obviously a ££ investment but I’ve had a few sessions with mine and it’s definitely something I want to commit to every single week and probably long term. Pls DM me about this stuff if you want to because it’s overwhelming and shit and difficult to know where to begin so if I can help at all I will. All my love 💖", "the_colour_file": "Hi lovely lady, so sorry to hear you’re struggling and well done for your courage in reaching out and telling people. I honestly think that therapy is the best money I’ve ever spent (well, that and IVF 😆). I went into therapy with the thoughts tangled in my head like spaghetti but I don’t feel like this any more. Such a relief. I think recommendations are always good. And someone local, if you can: in my experience it makes the whole process easier to stick to. Love and strength xx", "kmhmmh": "I also live with chronic illness (fibro and ME/CFS). Therapy has been a huge help in managing my life with illness. CBT, boundary setting and addressing the grief/loss of ‘healthy me’ were all extremely helpful. Best of luck.🙂", "ashleighbrashagram": "Take your time there’s no rush, we will be here when you are ready. Do what you need to do to keep your mental well-being sparkling✨ And just in case, love you 🤗🤗🥰😘", "almassbadat": "I can definitely recommend my therapist - she’s so gentle and listen so well, and is so intuitive too. Let me know bubs. I found her on baatn.org - took a chance xx", "leighhutchi": "I’ve had therapy through the NHS and free from a local charity. I’d recommend it to everyone. Brain dump on someone who has no pre conceived opinions or judgements on you who’ll help you put things into perspective. Big thumbs up from me ❤️", "swanjackson": "You are not alone...start with your GP...discover your options...Ask for a referral. Don't get disheartened. ..The fact that you are talking about it and seeking help are major achievements. ..good luck sweetheart!", "curatorpolly": "Troubled or not, you are looking resplendent my darling! ❤️👊", "colourmeinkindness_xo": "Where’s your dress fromn😍😍😍", "rxcmillion": "✅✅✅", "fromnicolawithlove": "Mindfulness and CBT ❤️", "captainchar": "Therapy has been the best thing I decided to undertake this year. I've done CBT and some other forms to treatment in the past but I could never quite get to grips and like you I felt more and more like I had a bunch of stuff going round on my head but nowhere to sort and order. I did a lot of research and finally decided on a lady and quite honestly she is amazing. Just to have a space and a time set aside to chat through all these open tabs is amazing. I chose to go privately so I was in control of how many times I could see her and even make it more of a long term thing but obviously you can do this through the NHS too.", "becks_things": "Get yourself a lovely notepad and pen, honestly it’s changed my life. Every morning I get up and write down what I need to do, even to the smallest detail like putting a wash on, to the bigger things like work and feeding my teenagers 😬😂 But it stops my mind from spiralling. I wake in the morning and my head races and I panic before the day has started, but now I have a cuppa in bed and write it all down and it instantly calms me. It’s such an achievement to strike things off throughout the day, and the notebook comes everywhere with me. Lastly, the calm app, it’s a life saver 🙌🏼🤩", "campbey": "You are so loved. You have been on my mind for a while based on your input on insta . I knew something was troubling you , sending you much love get on a plane and visit your brother take time out . Xx love to you and your family xx", "iansangala": "Ah man! Daniiii man 😭 Keep your chin up, you’re such a boss and have so many looking up to you, including myself! If I could achieve even 10% of what you’ve achieved, I’d feel over the moon! Check iMessage x", "unique_rosch": "Here for you always Danie ❤️❤️ Thank you for sharing. Life is bloody hard and we should own that shit! Mindfulness has been helping me lately 100% It just requires a conscious effort to do it, even when you can't be arsed because you always feel better afterwards 🙏🏾", "whatagemcurve": "Sorry to hear you’re having a tough time, I’d definitely recommend seeing someone to talk things through, it’s worked wonders for me and helped keep me going ❤️ You can use the Bupa treatment finder (even if you don’t have bupa) to find CBT practitioners/psychologists in your area and they all have blurbs about themselves and their specialist areas to help you choose the right person. Hope this helps ❤️", "heathereighty": "Therapy is a really good idea but remember there’s lots of different types of therapy and if you try one that doesn’t help, remember there’s others out there. I hope you start to feel back to yourself soon. It’s bloody hard. X", "graceynoms": "Finding something that works for you which might mean trying a few things - book an appointment with a GP and await a referral for therapy - in the mean time write a list off all the things stressing you out, then separate them Into what you can change and what you cannot change right now , then priorities them all and see if there is a check list you can create and slowly tick anything off. download an app called headspace which helps with meditation - anything that helps with breathing is always a bonus as well as exercise. Remember it’s a marathon not a sprint ❤️❤️❤️", "itisjustjody": "This is going to sound very cliché I don't mean it to at all. Close the tabs , one at a time, and in your own time. Your honesty and openness is the perfect place to begin. Thank you xx", "shellymc": "Omg, definitely do therapy! It's amazing and everyone can benefit from it if they are open to it. It can take time to find a therapist that you click with but sometimes friends have good recommendations! Also mindfulness and meditation were a gamechanger for me in terms of quieting that busy and sometimes critical internal traffic!", "traybo77": "First of all, sending a huge hug 🤗 A good therapist can take time to find. Firstly go to the BCAP website, as this will show you accredited therapists in your area and what issues they cover/types of therapy they offer. Try to get recommendations from people you know if you can. I’ve had about 4-5 in the last 10 years. Some I only saw once, but my latest one I’ve been seeing for a year and she’s literally saved my life. The most important thing is connection with that person, if you don’t feel that you can be totally honest with them, or the relationship just isn’t ‘right’, move on. I knew from my first appointment with my current therapist that she was the one, as I didn’t stop talking. Good luck lovely and we’re all here for you 💞 btw your content still rocks! Xx", "zedk": "I see @the_thomas_connection and would highly recommend her", "kerry1803": "Big love for sharing & being vulnerable on here that’s not easy 💜!! Honestly I wouldn’t know where to start with finding a therapist (Im considering doing the same after receiving brief counselling through work) I hope someone that does can help! One small thing that really does help get all of what’s going on in my head out is my @the_positive_planner it has great tasks (if that’s what you call them) that help you process what’s going on & it helps set intentions for the day & reflections too. I’d also recommend following @annamathur if you don’t already she’s incredible & maybe able to help on the therapist front. 💕😘", "glambyruna": "I feel this all the time and I ask the same question. What do I do? Do I need to talk to someone. These thoughts worries alone are draining. Thanks for sharing.", "beepotts": "Bacp.co.uk is one of the best places to look for accredited private therapists who are registered. You can search your area, issues etc to narrow down who/what you need. Journaling is a massive help I find - writing things down and seeing them in words sometimes helps make things clearer to see or understand. ❤️", "lizzie_mcfarlane": "Mindfulness an 8 week course was my first step. It was a gamechanger for switching off my brain. Doing things you love is so important. Regarding a councillor its important to know that not all councillors work for everyone. You have to find the right fit. Think dating but for therapy 😂. But once you find the one you are off. I still go but have gone from needing it weekly to every few months. If we always succeeded and had our shit together we would take it for granted. The darkness makes us appreciate the light. I am thinking of you. Sending lots of love and hugs ❤️❤️❤️", "trixibelle_": "❤️❤️❤️❤️❤️ Just sending love and strength. You’re one of my favourite internet strangers. You’re such a strong, smart, go-getting person I know you’ll find the right help and it’ll just help you become even more excellent than you already are.", "mrs_shepp": "Sounds like therapy could really help you. I personally found it really beneficial. Love to you xx", "rhymeswithsailor": "Therapy changed my life. After my dad died I had all this pent up guilt over instances and I was sure it would haunt me forever and warp my relationships. My therapist helped me look at these situations in a different perspective which took the biggest weight off my shoulders that I had ever felt. I can’t speak highly enough of it. Best investment I’ve ever made in myself", "manlikepam": "What’s for you will always be for you , try not to compare yourself with others , your path is different from other people , remember that your family and friends love you for who you are not what you are . You are an inspiration to thousands of people , hold your head high , tomorrow is another day , have a drink eat some chocolate and get back on your horse 🐎 xxx💋💖", "abzieabditch": "Therapy is incredible. Massively regret stopping to be honest and hoping to re-start soon. Those tabs definitely start to close when you work with a counsellor who is good at their job. Go for it- it could be the best thing you’ve ever done for yourself. X", "dolly_pawton\nVerified": "Verified", "chloeincurve_\nVerified": "Verified", "georginagrogan_\nVerified": "Verified"}