{"jaopos": "I've been using this and I had really high expectations but it's kinda disappointing..it helps but I still needed to wear shorts to be really comfy :(", "maroomagazine": "Can you stop? 😍 I mean...you are just 🔥🔥🔥🔥🔥", "louleeg": "I bloody swear by it!! I never used to wear dresses to weddings but this summer I totally did!! Life changer xxx", "dollybabii": "It’s soooo good, worked everyday whilst I was in the blistering heat in Texas and in-out of the pool 👌🏾", "elthornto": "HERE SHE IS", "janberry7": "I need to try this! Thank you for the recommendations ❤️❤️", "h_morgan__": "It’s great for underboob and I even put it on my toes under sandals to prevent blisters (they normally blister immediately).", "ellieparish": "Literally saved my summer!", "frockmeimfamous": "Omg I need this for holidays!!!! 🙌🏻X", "hannahj.lewis": "Your body! 🔥🔥🔥", "justine_from_reading": "@jennifleur82", "chloeincurve_\nVerified": "Verified", "just_keep_swimming2412": "Daaaaaamn girl! 🔥🔥🔥", "delanop97": "That ass 🚨😍♥️", "talalinstructor": "👍", "ivyverdure": "😍😍❤️", "mammuforyou": "The best 💖", "aoifeeot": "Is it supposed to stay really wet? I second guessed myself the first time I tried it and washed it off. Didn't want to risk it...", "shaunanitsch": "I got this for my sister's wedding in Slovenia where it was 35 degrees and it was the best thing I ever bought!! 🙌🙌🙌🙌", "sionsyn": "Absolutely game changing product 🙌🏼", "ogariolondon": "💚", "see_fairer": "Love this shot😍✌️", "__annie__bananie__": "@jchulia ☀️", "mags2712": "@daniellevanier it is absolutely amazing!! By far the best out there!! Best money I've ever spent on a product! You can tell the difference if you forget to apply it xx", "lynnie_pinnie": "This is fabulous stuff @daniellevanier I’m now running low so will reorder 🙌🏽 also love the smell and found I haven’t been bitten by mossies as much because of the citrus scent 👏🏼👏🏼👏🏼💕", "pashtie": "This is the product I was telling you about! @danielledcfd", "kezra87": "Thanks for the code :) just ordered can’t wait to try out at my best friends wedding xx", "neverrtooldtorock": "I am allergic 😞 fucking sucks", "samantharhiannonwilliams": "I didn't rate this, I just find that all of the topical products can't tame my thighs 😬😂 absolutely adore @snagtights chubrub shorts though!", "charlotteroberts3770": "Got this few weeks back,life saver wore a dress first time in a long time with no chaft shorts felt so good! Lasted all day would defo recommend also used with new shoes that rubbed my feet before I used ivyverdure xx", "felicityhayward\nVerified": "Verified", "ashleylouisejames\nVerified": "Verified", "accessible_rach": "Tried it love it promote it always 😘", "missljsimms": "This girl is on fiyaaaaaaaaaaaaaaaa 🔥🔥🔥🔥 this girl is on fiyaaaaa-yaaaahhh-yaaaaaaa 🔥🔥🔥🔥🔥 but your thighs won’t be!!!", "_tinyforest": "It smells so good too!!", "thefatfunnyone": "I’ve used this for 18months/2years and it’s hands down daaaa besssttt shit", "lornaluxe\nVerified": "Verified", "dianasaladpot": "Love that it’s water resistant! I didn’t know that 💦💦💦", "samtylers": "Oooo I use this after @jessontheplussize recommended it and it's great and yes you're right it smells amazing!", "blooming_lovely17": "I can vouch for this. It actually works. Your legs slide together but it doesn’t last all day so bring it with you 👍🏻", "queenbeady": "Every single day of the week girllll!", "amo_schoe": "Thanks for the discount! Just ordered some for my holiday. Really hope it works for me 🤞🏻", "marianaperezmora79": "Awesome 🙌🙌🙌🙌👏👏👏", "jencraven_": "I used it in mallorca and didnt get any of the usual rash, I also used it in the tops of my feet last night so my new shoes didn't rub and it worked amazingly! Xx", "carriejm": "@cherylmackie", "trixibelle_": "It has genuinely changed my life. I hate wearing shorts under dresses when it’s really hot - completely defies the object. It is the only rub-on thing I’ve found that works (I’ve tried A LOT). I swear by it now.", "_stacey87": "@lucynunny we love this 💖", "itscorallee": "Yes yes @ivyverdure is the one! 🌿", "nanook20": "Am going to order some now. I hate chafing and would love to make it a thing of the past!", "traceycurly": "Just ordered thank you!! Hoping it will withstand the sweaty hot weather of Seville in a months time! X", "colourmeinkindness_xo": "Legit just brought this ready for my holiday to cyprus! I’m excited to use it! Also thank you for the discount! X", "hurnae90": "Will have to get some of this for when I'm going to Florida. Chub Rub is rife when I go there lol x", "hayzmalins": "You've literally changed my life right now #chubrubrelief", "michaelaefford_photography": "I need this!", "anna.rosa.cahill": "I started using @ivyverdure this summer and it’s been a thigh saver. I’ve loved this summer wearing dresses and shorts and not having to worry about the dreaded chub rub.", "betsyandmummy": "Just ordered to give it a go ❤️ thanks so much x", "carlcunard\nVerified": "Verified", "meganlouisejenks": "@daniellevanier I have this and it’s so good! I’m currently on holiday and I’ve forgot to take it with me and I’m really feeling the chub rub I want to cry! I’m so glad you think it’s great as well I love it!🙌🏽🙌🏽", "em_clarkson\nVerified": "Verified", "mariahedez": "Just bought it. I hope it works nicely, I welcome other ideas - the thing I use is everything but sexy.", "calliethorpe\nVerified": "Verified", "krazeegal": "I have just ordered this and go on holiday in 2 weeks.....can't wait to try it! ❤️ #NoMoreWaddlePlease", "handbagsandgladrags1": "Yes it works well but wish it was odourless. I find the smell on the skin to be off putting.", "wee_frumpy": "This stuff is excellent", "katierosekilby": "Love this stuff 🍋💛", "brasilnality": "What a stunning picture 😍😍😍😍", "stephanieyeboah\nVerified": "Verified", "mandy2435": "Lovely photo hun 😍😍😍💜💜💜", "curvycampbell\nVerified": "Verified", "saffydixon": "This is the best idea ever 🙌", "fromdonnawithluv": "Ah yes the waddle 🙈", "gailcoles2808": "It’s amazing stuff 😍 I couldn’t be without it and spread the love far and wide!", "emmyjo27": "Beaut shot 👌🏼🧡", "scaffers82": "I personally didn’t find it to be long lasting but it does smell nice!", "katiebakercowling": "Tried and tested-won’t go anywhere without it!!! BEST THING EVER!", "ellieyasminjones": "iRelief is the best for chub rub! Wouldn’t use anything else. So easy to apply and I keep it in my handbag during the summer", "ammyyy_c": "I suffer so bad with chub rub especially as I have dermatographia as well, will have to give this ago. P.s photos are beaut! X", "jakebearcub": "Cutie with a booty!"}