{"frannamstyle": "You are a warrior! ❤️", "clarity_london": "Strong post 👌", "ellieboa_": "Sending love from another fibro warrior xx", "onetrickvegan": "I relate so much to this, thank you for sharing ❤️", "fashionbellee": "You’re a babe ❤️", "nicolahickton": "Totally get this! X", "kittycowell": "So important. Well done on being so open. 💕💕", "bobbivance": "Well considering there are days when you literally can’t move. You still smash those opportunities that come your way. You do a fabulous job and helping others feel their best, this is why we love you darling x x x", "theoriginal_bon": "I think you're super inspiring and totally amazing. Keep fighting the food fight x❤️", "massiv1985": "Hot 🔥", "calliethorpe\nVerified": "Verified", "bethelizabethuk": "Been struggling so much this week with pain stopping me from gettimg anything done. Not being productive makes me feel like such a failure but trying to remind myself that getting through the day is achievement enough.", "nellgaff": "I hear you and send positive energy across the globe 💗 🌎 to you", "lcrate41": "It does get better. 30 years in to fibro. Best wishes. Leslee", "jfphillips155": "Thank you for this post. I've suffered with chronic idiopathic hives for almost a year and you're right - pain is exhausting and frustrating. I've had to give myself grace on things so many times.", "kathyrichey1": "Yes, in my biggest flare ever! Day 5 and still in agony, it’s hard not to get angry and depressed. So I give in for a little while and then divert myself. Being in constant pain is exhausting! It’s all about little victories and truly making the best of good days!", "jlcan36": "I always love how real you are..it is hard and isolating to struggle physically and mentally but the plus of social media is how it can connect us to positivity and other people to show us we arent alone ❤️..keep being you 😘", "stevie_marie12": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "mizzp1971": "Thank You for this Post @daniellevanier on top of #Fibromyalgia I also have #Osteoarthritis, I work in the West End two days a week and this week I couldn’t do it, my Future scares me but I take each day as it comes the good and the bad, Stay Strong 😘😘😘😘😘😘", "hansmollman": "❤️👏🏼", "frankixo": "I needed to read this today. I have M.E & fibro and have since I was 13, soon to be 28. & even though I've had it for so long, you never get used to it. You just learn to fight harder. But the dark days are the worst. But we are not alone and you are such a role model to people with chronic conditions. Keep doing you doll. So much love 💕", "belsfashionedit": "Oh gosh you poor thing 😩. Sounds horrendous. So glad you have family and friends around. You manage to look totally fabulous too ! X", "monica_jewelrystylist": "Try Super Malic, an apple derivative. It is a wonder vitamin", "bellabarbie123": "I can def relate to the mental health aspect of this! Thank you being brave enough to share! You are helping others like me feel less alone and embarrassed! 👍🏼❤️💯👑", "rayray_k__": "🙏🏻❤️", "theislandersdiary": "Thank you so much for sharing this post, as I suffer from chronic pain as well I love that you use your platform to show your truest self, the good and the bad days and inspire others me included. Thank you 💕", "selflovemonster": "I relate to this so much 😭", "theweewanderingscot": "I love posts like this. So real and honest. As a fellow fibro sufferer I can totally relate to this. But it’s always hard to be honest and open about it when not everyone will understand the sadness that also comes with the constant pain. It’s another demon in itself to deal with. Whilst it’s never nice to hear about other people having to deal with similar issues, it is comforting to know you are not alone. Thanks for sharing with us @daniellevanier 💙", "mazarinstone": "Much love to you.", "allykatswonderland": "❤️❤️❤️", "bethany77b": "Thanks for sharing. I can do relate to the pain. It is nice to know I’m not alone. I enjoy all your posts. 🥰", "rachisabbott": "\"I grieve for my life before Fibromyalgia\" is the most relatable line I have ever read. Keep going 💓", "jamessteel1986": "Love you, Patty xxxx", "selfishcurves": "ILYSM 💕💕💕", "v.w.h.m": "I needed that.... thanks❤️❤️❤️❤️", "cal_silver": "In solidarity with u Danielle. Had Fibro 10 years and ME 3 and pain is depressing and sucks the life out of u. We need to focus on what we have and the great people we have supporting us. Keep positive and thank you for your uplifting posts and go getting personality ! 🙌🙌🙌 x", "angelinoasis": "Soo pretty 😍", "jessica__harris15": "@kellylepugh i don’t want to have to tell you again you need to follow Danielle she has fibromyalgia as well & her stories are so open and honest. 👌🏾💕", "jazzmynejay\nVerified": "Verified", "sugsean": "🔥", "flyingnics": "Big love DD! You’re 100% smashing it xx", "jaxie1970": "How did I not know you had Fibro? I love this post, it's like pages from my story!! Thank you for sharing. 💗", "aletheappp": "💜💜💜💜💜", "suzan.ismailoglou": "❤️❤️🙏", "thelifeoflouanna": "Needed this today ❤️", "katie94p": "Thank you for sharing! I also have fibro, and the struggle is so difficult and it’s hard to put into words how it makes you feel. It’s always nice to know you’re not alone 💜", "kt.eliza_": "This 👏👏👏. Debilitating period pain wipes me out every month and I lose work over it and constantly get pressures from any job I'm in to not take the time off. That then snowballs my mental health and I'm in this constant cycle of anxiety and depression which have got me to some really dark places. Just means that anything else that happens that's a bit shit seems huge and means I shut myself away for weeks at a time. I wish there was more understanding for Chronic pain and just because you can't physically see it doesn't mean it's not happening. Big shout out to anyone suffering and if you ever want a cheer up I'm happy to provide a meme exchange service with you guys 😂💖.", "cat.hair.in.my.coffee": "I’m with you Dani, it’s flipping tough. But you’re smashing it you really are. Don’t let those feelings of doubt in. Much love ❤️xx", "moll_maguire_": "Always looking amazing though,so stong💞💞💞,", "debinpei": "❤️🇨🇦", "sulsworld": "Powerful 🖤", "poppyhld": "You are amazing ❤️", "curious_outdoor_photography": "You are beautiful and strong. Fibromyalgia sucks. It’s good to have downtime and focus on you.", "luiselkes": "You are everything ❤️", "healo": "❤️", "luluhighlighter": "Yesterday evening was one of the worst pain days ive had and those are exactly the feelings i have living with rheumatoid arthritis. Im at home most days feeling the words you expressed about living with chronic pain . thank you for sharing much love to you💞💞💞", "1louisealina1": "Thank you. I’m depressed that I can’t work and ‘live in the world’ because of my fibro but I’m aware I’m super lucky that I can live with my parents (in a big house so we don’t get under each other’s feet!) 😍", "loligetsmodern": "❤️❤️❤️❤️❤️❤️❤️❤️", "duffygriffiths": "I totally get it! I suffer with a back problem which causes sciatica which can be really debilitating! I have a 3 1/2-year-old daughter which I always feel I’m letting down because I can’t do all the things I want to do with her! I’ve been back at work for a month now after being off for 4! Waiting for a injection into my spine, 🤞🏻it works! The painkillers make me tired, unmotivated and gain weight! The joys!!! 😘", "marshaellemusic\nVerified": "Verified", "cherry_blossom_vegan": "❤️❤️❤️❤️", "bevmapp": "Beautiful photo 💕", "curvy_roamer": "I LOVE YOU, I LOVE YOUR ENERGY, I LOVE YOUR PRESENCE, I LOVE YOUR DETERMINATION. YOU my friend are inspiration. ❤️", "hattiebourn": "❤️❤️❤️", "stickysweetdanish": "You are loved and appreciated by so many babe. Thanks for putting this into words and out there. It’s so important to end the stigma on both chronic pain conditions and mental health ❤️❤️❤️", "abigayle_laura": "@olympiabeautyek read caption 💜💜💜", "barb_bfd": "Thanks for sharing your fibro story, which is my story. You're a bright spot in my hard days❤", "kimbowhiting": "🙏🏻❤️🌈", "_hbp": "❤️", "itsmekellieb\nVerified": "Verified", "andrewbarber23\nVerified": "Verified", "glodimiessi": "Cute!", "nicolawrighty": "♥️♥️♥️♥️", "bykatrinasophia": "💕💕💕", "hoddy3112": "I so wish there was more the medical world could do to help. It must be so frustrating. Imagine what you would be like if you you were on full power!!!! Actually I am not sure I could cope 😉", "jasmins.view": "I just adore you. You strong, beautiful woman. ♥️✊🏻 be proud!", "muinatabdul": "Ugh you babe ✨✨ I can’t imagine - sending love!! ❤️❤️", "si_obhan_": "I know exactly how you feel as I’m in the exact same boat. Unfortunately I’ve probably left the house 4 times in the last four months. I used to walk a minimum of 12 miles per day and now I often can’t even manage to use the stairs. Fibromyalgia and arthritis are the absolute pits. Sending love to you 🥰", "whittyl86": "Love you lady, I too feel your words...I know exactly how it feels and lucky enough to have a fair few who truly understand x", "fannyvonfabulus": "I have Fibro too, as well as arthritis and COPD, so i k ow those feels only too well. At the moment i'm lucky enought to be able to work a 9-5 for a full week, but at 39 years old, i can already feel time running out for me to be able to continue that. It has a huge effect on my depression, especially this year, as i battle to make peace with that fact. Having an amazing support network has been the single kost important factor for me not giving up completely. Thank you for sharing, and for all that you do. You're an inspiration to so many of us 💕", "lindsay_grace95": "❤️❤️❤️❤️❤️", "lyfenblknwht": "I feel the same 💓", "maroomagazine": "You are a continue inspiration and I feel quite a lucky puppy to know you ❤️", "runanother": "Sending you love and hoping today is a good day for you. ❤️🌸❤️", "leannefindler": "It’s like you have read my mind. Thanks for sharing. We’re not alone 💗 xxx", "mossonyi": "Love you 😘♥️♥️", "everydayjoyandme": "❤❤❤as always thank you for sharing. You are such an inspiration xx", "hilde__1909": "🙌🏻😘", "gaynormrandall": "🙌🏻🙌🏻🙌🏻❤️❤️", "wvrio": "♥️♥️♥️♥️", "idasey": "❤️❤️❤️❤️❤️ Thank you", "sallysquiggles": "What a post, 👏 I love your honesty 💋💋", "cherri_anns_world": "💗💛💚💙", "xlrosx": "@xalittlepieceof", "mcarthy50": "Well put If I hear another 'You look fine' I will hit someone Take care of your self Danielle", "emyas73": "Thank you for as ever being open and honest and not pretending that life is one big glitter ✨ ball .. I’m suffering chronic depression and anxiety at the moment and you never cease to make me smile 😊. Thank you again and I’m sending love to us all 🦋", "missalexlarosa": "I love you so much 💜💜", "iansangala": "The greatest! I love you ❤️❤️", "soleasecas": "Thank you 💖💖💖", "styleidealist": "Thank you for sharing Dani 🥺❤️so much love for you!", "laurennicolefk": "💛💛💛", "emmyjo27": "Great post my love 👌🏼🧡🙌🏼 xx", "kazfoncette": "🙏", "raydenofficial": "@byanygreens__", "shelley.selwood": "Thanks for sharing this and being so honest. I am in the same boat as you and look at your stories and posts thinking how can she do so much with a chronic pain condition! I can't even manage to make myself go swimming twice a week. Without your honestly I'd carry on being sucked in to the same negative and unrealistic view of things. It's weirdly comforting to know that you have the same shitty feelings. Stay awesome Danielle you are a real inspiration x", "belladaviesheard": "Your ability to connect and share your full experience makes such a difference to so many people. We love you! 💫💫", "charlotteroberts3770": "🙌🏻😘", "elbielou": "In solidarity ✊🏼 22 months and 8 surgeries/ procedures later my life is completely transformed. I’m weary. I’m perplexed. I’m angry that I feel ashamed that I’m not the super woman I thought I was. I’m torn between stating the fact that I’m in pain vs concealing it because no one wants to hear it anymore. I didn’t choose this but “pain is the new black” in my world. I’m fighting so hard to keep up and at the same time stay afloat all the while knowing I can’t swim . It feels like a solitary place -but gratefully w posts like these I’m more aware that it’s a community that will eventually find each member and help support each other. I wish you pain free days, peace, and perseverance ♥️🙏🏼", "inthebrando": "❤️", "meganowens4109": "I hear you ! I also have chronic pain and often feel isolated, frustrated, sad...less. But...we are warriors, brave and determined. Bad days are just that..we are not bad, nor lazy..self care often means saying no to things we we would like to do. But its ok, its ok to take care of you. Sending love to all the warriors🦋🦋💜", "michellejulietnaylaa": "Cute", "sian.snow": "Look at you 😍", "style_mum": "Oh baby 🙁 can I hot desk from your house soon and we can freelance from the sofa together!! Love you ❤️❤️", "emfurey": "❤️❤️", "_larissa.demarco_": "❤️", "sonj08": "Thank you for everything you have said and know that we are here for you & understand. I suffer from anxiety & chronic major depression. I have suffered 3 major breakdowns & had 2 suicide attempts. I haven’t been able to work for 8 years and am lucky if I get out of the house once or twice a week. I have put in 13 stone in weight and have also become agoraphobic. I often look at social media and get sucked into the “I’m not doing enough with my life” and then I realise that, one, at the present moment in time I couldn’t cope with the “perfect life” whatever that is and, secondly that I am lucky to be alive & that I must try to make the most of what I have. But saying this to yourself and doing are two completely different things. Stay strong @daniellevanier you are an inspiration 💕", "rachfriend": "I feel this in my soul. ❤️", "emmatamsinhill\nVerified": "Verified", "em_clarkson\nVerified": "Verified", "emmalouwhite": "Sending love.", "charlottebakkes": "Thank you so much for sharing this ❤️", "hannawears": "❤️", "felicityhayward\nVerified": "Verified", "char_bailey_": "You’re good for my mental health😊", "lucypegler": "❤️❤️", "thepinkjellybaby": "Yes to all of this. I constantly feel like I’m doing nothing with my life apart from feeling tired of it all, it good to know you’re not alone 💗", "chloeplumstead": "❤️❤️ love you", "ellessechar": "❤️", "missljsimms": "Sending you support, love, understanding and validation. You are an inspiration to me I adore your work and cannot wait to see what the future holds for you. I wish so much success for all your future endeavours #wekeepeachotherstrong", "amyduffin1991": "Thank you, your posts are helping me on my own journey with fibromyalgia and I am incredibly grateful for that 💕", "brasilnality": "Thanks for sharing this babe 💖"}