{"ashleylouisejames\nVerified": "Verified", "spottyj": "Oh my god i thought it was just me!!! My life is a mess atm!", "thecrooksnook": "Yep.....Walked into my late parents house to find awful water damage due to a pipe break.", "ginathompson14": "Naaaaa", "luciajac": "You’re so fabulous and such fashion inspiration for me!! 💕", "jarodz3931": "Pretty lady ❤️", "curvy_roamer": "100% believe in this shit... dont worry it’ll pass soon. 😘👏🏼", "sarahlouwho82": "I didn’t believe in it all until I started teaching - now I’m a full believer in the ability of the full moon to totally F with everything!", "karine7702": "You are gorgeous and yes totally #mercuryretrograde #deepbreaths", "thepetiteavenue": "Omg is that why mine was early", "janberry7": "Hey universe- give her a break already!!!❤️❤️❤️", "shaun_oskooie": "Hey stranger", "fiercelyempowhered": "But somehow you still look flawless! I don’t know if I believe in it, but keep going girl because you inspire me!", "hommesequipe": "💥🔥❤️", "daphnekknows": "Gorgeous girl", "ulyavasilenko": "😍😍😍", "s00shila": "I was thinking \"pfft, no\" as I don't believe in astrology but I have actually been questioning my sanity this week, so.....", "asetina23": "Это платье невероятно! Прекрасный принт, очень вам идёт!", "almassbadat": "literally was hysterical last night to find out it was a bloody full moon 🌕 just like damn I can just about get my shit together on earth 🌍😭😭😭😭😭", "nimiblackwell": "I’m not into astrology but I feel like I need to be because I feel this on a deeper level 🤦🏽‍♀️", "ebloggersuk": "😍", "makeupbytammi": "Mee🙋🏾‍♀️ my hard drive dropped down the stairs and i lost all my content and then my shower stopped working had to call a electrician, so far this mercury retrograde has been pretty crap😅🤣🤣💜", "maryamsofia_": "Yes mercury in retrograde is fucking me right up lol. You look fab btw 😍", "iampranks": "I just love your confidence", "ceebrie": "On the plus side, you look incredibly fit", "emyas73": "My life is 🤯🤯 right now .. 🤪ps as ever beautiful 🦋", "style_mum": "That dress is a bit of me 😍😍", "sulsworld": "Stunner 😍", "joco9000": "Didn’t used to but this year✋🏼yes", "harrryjane": "Sexy mama! 👏🏼😍", "culturecurves": "Life is truly being a dickhead ex at the moment but we will get through this, girl. ❤️", "taaambam": "Babe, don’t blame it on the sunshine, don’t EVEN THINK about blaming it on the moonlight. Deffo don’t blame it on the good times. Blame 👏🏻 it 👏🏻 on 👏🏻 the 👏🏻 boooogie 💃🏼", "plussizekatylou": "Full into the agreement it’s down to the moon! Life’s crazy anyway but more so in this fill moon x", "vickyvamvaka": "Oh yessss i believe!!! And you look amazing, as always 💖", "valentinadez": "When I see those type of texts I normally laugh into tears 😂😂 you should try", "pixiecosmina": "Beautt🖤🖤", "mayblake.curve": "🙋🏾‍♀️🙋🏾‍♀️Swap the large glass of wine for prosecco and things sound strangely like mine atm. Period n all. As for the exes 😒👋🏾👋🏾😂. Think your friends may well have a good point for sure. 💕", "frannamstyle": "TBH never really paid much attention to it, but OMFG life is just fucking with my melon right now. #sackofshite", "georgieeswallow": "Beautiful. 💓", "the_alisejane": "Looking goooorgeous 💛💛", "naters24": "100000% believe in it! I didn’t until I went into my current job- the moon, stars and planets honestly determine everything", "nataliebou": "Frankly my life is so all over the show right now I’d believe anything! Just go with it ✨ xx", "vonkanrules": "That's exactly what my sister and I just said: All this sh*t, it must be because of the full moon...! 😅", "carrie_cracker": "It's a thing. Drove to work then realised I'd left my handbag at home, ran over my own foot with my office chair, accidentally dunk my hair into my soup and had crusty hair all day. FML give a girl a break 😩", "beetourist": "You are beautiful and I'm sorry for the shitty things in your week but astrology is bullshit and you are way above this nonsense xx", "tarajennings": "100% ALL about it 🌑✨ 🔮 don’t make any big decisions in a retrograde, the world ain’t right 😂", "elliwmai": "Yes, sis. Hold on tight for another week 🌝🌚✨", "chloegracelaws": "Mercury might be in retrograde but least you’re looking 🔥", "lukeheywoodstyle": "You’re gorgeous don’t let the world slow you down beaut ❤️", "rachiew1982": "🙋‍♀️", "prue_dp": "Oooh yes!! 💕", "heathereighty": "Is it bad to say I think it’s a load of shite? If someone’s a dick it’s because they are a dick not because the moon. But you know to each their own 😂", "mrs_vince": "🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️🙋🏻‍♀️", "iansangala": "You look so pretty!", "simonandnik": "Yep. Weird energy in the air. We live by retrograde! All will get better when it’s out don’t you worry 😘😘😘", "mini_egg_monster1979": "@daniellevanier mercury retrograde is renowned for all of what you’ve mentioned, especially the exes rearing their horrid little heads - those useless fuck boys 🙄. I can’t bear those “Hey Stranger” texts! Stranger? Yes! There’s a reason for that my friend........and it’s you!!! 🤣🤣🤣🤣. Chin up Lovely it’ll all be over soon, in the mean time get yourself some lovely rose quartz and give yourself lots of self love xxx", "andreamsbig": "Yep 🙌🏼 🌕🔥😧", "ataamilas": "Omg yes mine is! Been feeling so off lately and like everything is just wtf :)", "stephanieyeboah\nVerified": "Verified", "lornaluxe\nVerified": "Verified", "megan_grey90": "Beautiful 😍", "chumagqoli": "🔥🔥🔥🔥 though so the loser ex makes complete sense", "lovethepopband": "Stunning 🔥", "sophiawho": "🙋🏻‍♀️", "verhexen234": "Mercury retrograde. It's real and it's bitchy! 😂", "elenalucie": "Totally fucking believe in it!", "muinatabdul": "😍😍😍😍😍😍", "bevj2603": "😂 love this! Also love your outfit! Where’s it from? X", "needoll": "Yup! Ex’s always come out during mercury retrograde! Looking stunning 💗😍", "themelissashannon": "Mercury Retrograde at its finest work 💗😘", "swanjackson": "Chaos...my life is Chaos..definitely something planetary going on...", "charley8x3x1": "🙋🏼‍♀️ absolutely 🙈😩", "char_bailey_": "It is the moon babe . It controls the whole sea and it deffo controls us . Can we talk about my period pain and tooth ache please and all next week I’m cuddling you 😊", "cbirdy485": "Me. It defo had an impact on my life! X", "bethanyelstone": "ITS THE TRUTH MAN FFS", "miss_maartje": "Yes and yes 🧙🏻‍♀️💕", "dididelight": "Yes very much so, I was made redundant a few weeks ago and trying to find a job has been near on impossible. Being at home is killing me. (I cant get past the recruiters for an interview which is the main problem) I hope things pick up for you @daniellevanier xxxx ❤️", "knittykittybangbang": "Mercury retrograde messing with every single device/platform plus SURPRISE! Period too 😑", "felicityhayward\nVerified": "Verified", "sandrappreciation": "I believe you are a GODDESS 🤩", "wonderingtheplanet": "Very true! 💫", "rachvmorton": "Yaaaass Queen 🙌🏻", "brasilnality": "Stunninggggg😍😍😍😍"}