{"chantelleayanna": "Been feeling it too recently. We got this!!!", "jlcan36": "You are wonderful ..comparing yourself to others is just human nature but ever small accomplishment even the most simple mundane every day things are worth being proud of.when you are depressed even just taking a shower feels like a huge feat..go easy on yourself and celebrate the small victories 😘💓", "mrs_shepp": "Be kind to yourself and don’t be afraid to ask for help xx 💕", "stephio25": "Sending you love ❤️❤️❤️", "paigejoannaa": "You’re so strong and things will get better darling! I know the darkness that comes with having long term health problems but you’ll get your spark back 💖🌟 xxxx", "thefrugality\nVerified": "Verified", "everydayjoyandme": "O gosh this. All this. So much love to you x", "justthefwordblog": "Just had this exact convo with a friend. It's so natural to feel that way and frustrating af! You've killed it this year yet again. Cannot wait to see what the new year has instore for you. Soft hugs ♡", "gomcp": "I can so relate ☹️! It’s very easy to say “do not compare yourself to others & their achievements!”, but hard to not do. As someone dealing with this myself, I can honestly say there will be good & bad days. Do not give up 👍🏽👍🏽👍🏽‼️", "dianasaladpot": "I had a meltdown last week and basically stayed home all week except for Tues. I just can’t right now - I’m sure the election isn’t helping but yeah chronic pain just makes me feel I’ve got a dead end life. There’s people would look at me like well you’re earning good money (which I am at the minute) or would look at you and go oh but she had a clothing collection this year. And yes it’s true. But it all feels tinged in shit like what more could I be doing if my body wasn’t a let down of pain all the time that anything nice is still covered in a smile that’s part grimace. It’s all just a big wet fart frankly.", "lindseyholland_\nVerified": "Verified", "bm.arnborg": "You look smashing! 💖", "fatgirlfashioninspo": "Looking super sexy Dani 😍😍😍", "jturnerlowe": "I love this classic look!! You look fabulous and I hope you’re feeling better today! Please know that you’re on the right path!!", "sophielondonlovesla": "Love youuuu ❤️❤️❤️❤️", "theweirdone_xx": "Genuinely the skirt of DREAMS. I want to live in that skirt 😍 You look lush ❤️", "galleryxxl": "You look wonderful though. Stay strong. Hugs from Dubai 😘", "amymoo94": "Sending love and light to you ❤️❤️take care xxxxxxxxx❤️❤️", "actuallyfee": "I HEAR YOU ❤️", "sam.howse": "Everyone has some form of struggle in life even if a small or large one. Never feel alone we all have them. Your such a inspiration to all your followers , friends and family so be proud yourself not sad. Go have best Xmas away drink laugh be merry xx 🎄🎅🎉", "leanda_dawn": "I've been feeling anxious and extra depressed despite the antidepressant that I'm on. There's so much going on around me right now. I don't leave the house very often which is not healthy either. But I know there's a light at the end of the tunnel. I just keep going. Even getting out for a few hours makes a difference. I went to my nephews college recital last Thursday and this Thursday I have to go to the campus to take my final. So, hang in there. Stay home if you don't feel like it and get out when you can. Sending love and hugs from Tennessee!💛💙❤️💚💜", "bethelizabethuk": "You're doing amazing and look incredible 💜 totally get the comparing thing though. Forever doing it even though I know it makes me feel lile shit", "rachelpaula": "Hi Danielle: my name is Rachel and I write for the TODAY show in the US. Just sent you a DM", "jeanettewiehl": "@isabellawiehl", "yazziederr": "🤗❤️", "lornaluxe\nVerified": "Verified", "sarahknapman1": "Gooooorge 💙💙💙🔥", "sallysparkel": "@daniellevanier oh bless u hun.... good friends can help pick u up❤️ hope u had a fun day today ❤️", "etouaismagueule": "I don’t know who you’re comparing yourself to but you’re one of the best influencers out there 😘", "vickyvamvaka": "I feel exactly the same as you..especially the last couple of months... 😢", "ladylou30": "@daniellevanier you look just great. I really must make it a NYR to wear long skirts", "janberry7": "I feel ya babe. It sucks to not be able to just live your life like others especially when you’re so creative smart and full of dreams with ambition- I hate it too! I lost my career my home everything to disability but damn we aren’t gonna quit are we babe?!! Here for you ❤️❤️❤️", "100womeniknow": "Relatable! Thanks for your honesty 🧡", "curvy_roamer": "This makes me sad. Sending so much love to you. ❤️", "denise.emelle": "Kudos to you for having the COURAGE to be vulnerable, being open that you're struggling, in a world where members of social media typically only show themselves at their prime. Thank you for being real and authentic. And your outfit looks superbly polished and chic. You rock. ♡", "magentawillow": "I think you need to speak to your GP x", "jencraven_": "❤️❤️❤️", "inmysundaybest": "Sending big kisses and hugs my love ♥️", "postmodernpoppy": "You look terrific! Glad you were able to be with a friend. Thanks for sharing your struggles.", "nickyj2011": "❤️❤️❤️", "frillsnspills": "Sending you lots of love, life is tough ❤️❤️❤️", "pamjeanknowles": "Danielle- You look great in this outfit! As always thank you for keeping it real here. Insta pictures are not real life. I also am in the dumps and in chronic pain. I have a zero bullshit tolerance which is difficult as I work in customer service. Lol. Our pain ridden bodies sometimes rule our brains and in brighter days it’s the reverse. Hang in there sister.", "zoebarkerdesign": "Brave to admit, I often feel this way and battle similar demons myself. It’s so hard in today’s world not to compare ourselves but you are a talented, beautiful lady so give your mind a break and allow yourself to be happy 😘", "style_mum": "Oh baby 😔 love you loads xxxxxx", "gemmaslittleworld": "Sounds like a perfect day! You look fab!", "shamckk": "💕💕💕", "mischief.mayhem.mandy": "I feel you, I’ve been the same this last year for a different reason, and it is so hard. Stay strong and keep slaying bc u look fabulous, love this outfit💕💕💕", "amyduffin1991": "You are so real and relatable - I’m sorry life can be so tough, but if it’s any consolation, I’m pissed off too 🙋🏽‍♀️😂 and, you have got me through some of my darkest day’s this year. You are pretty inspirational in my eyes 🙌🏼💕", "gaynormrandall": "Gorgeous 😍😍", "_halfway_to_paradise_": "❤️❤️❤️", "katierosekilby": "🧡", "joco9000": "It’s so so hard you are doing your best❤️❤️❤️xx", "styleidealist": "So much love for you Dani ❤️ I can relate so much, just know how amazing and inspiring you are ✨✨ you’re my light on this app! X", "see_fairer": "Your clothes line dropped this year! That's really a huge accomplishment! You ARE AMAZE BALLZ", "jessica_lobo": "You’re amazing ✨✨✨", "jessontheplussize\nVerified": "Verified", "oddsandtrends_": "Sending love! I get how you feel, having a chronic illness does make life so much harder but you are doing great 💕", "healo": "❤️ ❤️ ❤️", "iamsherrylsinclair": "You look gorgeous & I'm so grateful to you for being so vulnerable & honest about how you're feeling right now. Baby steps & one day at a time - as you say, the great days we can have are so worth it 💖 sending you love x", "v.w.h.m": "Sending you love and light❤️❤️❤️", "shannon_on_on": "I think you are amazing ♥️", "lourdesdiaz1135": "I’ve been following you for awhile and think you are amazing!! Smart hilarious beautiful inside and out!! ALL of us have ups and downs!! Do as much as you can when you can but never ever give up!! Keep fighting!!", "beautyrocksblog": "Honey you are amazing ❤️", "leggyblonde1415": "You’re so strong❤️ keep going beautiful, I hope things work out well 😘", "marianaperezmora79": "Sending you love and a big hug ❤️❤️❤️🙌🙌🙌🙌", "angellinarowe": "I could of wrote this! You are so loved.", "imogenchristy": "You look banging in that outfit!! Glad you had a good day! I can’t relate to the specifics of your experience but I definitely can to the bubbling feelings. Hope they get less frequent and less intense for you and that you have more and more of the good days xx", "curvy_lady_and_the_chi": "Looking lovely lady!! Also sending hugs! Feel better soon 😘 x", "asos_lesley": "❤️❤️❤️", "kaydeebeeaitchess": "Awwwww Danie dead brave if you to admit it so openly. Wishing you all the love at this time of year. I remember how you’ve always offered to be there for people at Christmas time when it gets on top of them. Hope it’s being reciprocated x", "beauty_marked81": "Sending lots of love & hugs your way beautiful. I'm here if you need anything 😘", "char_bailey_": "Real friends face time while they’re trimming their pubes 😊", "sallysquiggles": "Gorgeous photo of you. I admire your honesty, it's not easy to be so open about something that makes us feel so vulnerable. Wishing you peace and recovery and, most of all, joy 💕💕💕💋💋", "lashawndillon": "🙏🏼🙏🏼🙏🏼❤️❤️❤️", "lucycarlyon01": "Sending love and light ❤️", "charlotteroberts3770": "Always remember your doing amazing,keep being you and when your body needs to rest don’t feel like your not doing what you need to do think your body needs to rest and get back at it the next day or when you feel ready big hugs xxx", "billiejean82": "I think you’re amazing. ❤️", "showpony.archivist": "L❤️vin this 🔥 lewk", "judybraun": "Thank you so much for sharing this. I feel in a similar place (minus the chronic illness) where I’m disappointed I haven’t achieved enough and worked hard enough and really don’t know what’s next. So, thanks for sharing - you’re not alone. And when we have the good days, we need to embrace them. And thrive. And I’m glad you had a great day. You deserve all the great days. Sending you all the love and support. 💕", "stephlee29": "Sending huge hugs, you’ve absolutely got this! 😘", "deliambp": "Ugh, ILY and I don’t even know you. ♥️✨ Just keep in mind that you’re more important that you could ever imagine for people from all around the globe. But yeh, I feel you and you deserve to feel however you need to feel. X", "hannawears": "❤️", "rxcmillion": "💎💎💎", "hannahlewin_": "You are a beautiful soul. Sending all my love ❤️", "ladyvictoriajane": "You look gorgeous 💞", "lizzydive": "Keep going and being amazing! 😘🍾🥂", "_kom_": "❤️❤️❤️❤️", "anastasia.furrow": "I adore you so much! I’ve been struggling with the exact same things the last few weeks! Thank you for sharing your experience...it helps remind me that I’m definitely not alone with these thoughts. Sending you love and hoping you get as much rest as you need babe! 💖", "plussizekatylou": "Gorgeous lady, if I could give you a big hug and make you see how by being so honest and open you’re a huge inspiration to so many 🥰✨❤️", "nic_kinde": "Entirely feel you. Fibromyalgia, joints pain from hypermobility and the grinding horror of the election and the news is really digging me a hole. Thank you for talking about this struggle, you are so great, and I really appreciate your thoughts about fibro! 💕", "joannateq": "Love you, Busty 💕", "fashionbellee": "You’re amazing, keep going beautiful ❤️", "maroomagazine": "Love you!!❤️", "yazmarley": "😍😍 Style icon", "retroashlat": "You just do whatever you need - you’ve a whole community of people behind you ❤️", "danieleinlondon": "I hear you ! And I can relate. You are not alone 💞", "becca_watson95": "Thank you for your honesty 🙌🏻 I’ve been feeling the same way lately and seriously your posts/stories always bring a smile to my face! Appreciate you so much ❤️", "griffind00r": "You've just articulated everything I'm feeling right now. Always seem to happen at the end of the year, think it's something about looking back over the year etc. Sending you lots of positivity and know that this feeling will pass. 💜 you're an absolute queen Darling x", "dididelight": "Hiya Danielle, always hear if you need a chat xx I'm sorry to hear you aren't feeling yourself at the moment. Try and not put this additional pressure on yourself and take each day as it comes xxx ❤️", "colourmeinkindness_xo": "Where’s yours skirt from 😍", "__kiki.t.j": "Huge hugs lovely 💕 There will always be those dark days but I really hope you start having more great days than dark ones. xxx", "remiafolabi": "Sending you love beautiful ❤️❤️", "needoll": "Appreciate your honesty 💕 how you feel is valid and you’re allowed to complain about it x", "jooliewooliee": "O no bless you xxxx you’re amazing but you need to make time for yourself and put yourself first. You’ve achieved soooo much, don’t ever think you haven’t. I too live with constant pain and run my own business. Be kind to yourself always xxxx", "nimiblackwell": "You’re a queen. You’ll be OKAY, just keep doing you 😘", "kristina_delish_bacon": "I can relate ❤️❤️❤️hugs", "angiecvk": "Hugs 💚💚💚", "_jugs._": "Exactly how I am at the minute 😭", "_daniellemcallister": "You have every right to be pissed off. I love that you share your struggles along with your wins because it allows us to see your real life. Btw love the movement in this photo.", "simonandnik": "Stunner 😘", "greekangelb": "Chronic Illnesses SUCK! Depression is a big part of it for me too, lately it's got worse but you just put on that fake smile just to get by...yhen", "italianvickalina": "This will pass... ❤️", "barb_bfd": "Rooting for you Dani. Your honesty means so much to us in similar positions.", "beepotts": "Keep going, good times will be just round the corner ❤️", "naomi_g": "Sending loads of love 💓", "allen_michelle7": "❤️❤️❤️❤️", "ralston_85": "We love you Dannie ❤️🏴󠁧󠁢󠁳󠁣󠁴󠁿 sending lots of love xxxxxxxxx", "meganlooney05": "Much love to you.", "jjw1007": "I sympathise. I’m in the same boat, have chronic illnesses also and am struggling big time. Feel unmotivated and have no direction. You inspire people everyday, never shut yourself away! Stay strong xx", "georgiedoes": "LOVED seeing you 💜 more fun times soon please x", "belladaviesheard": "Sending you a big squeeze 💫 and you look PHENOM X", "monitoress": "❤️❤️❤️❤️❤️❤️", "fromsarahlex": "Sending you so much love. You know I GET it so if you ever want to chat, I’m always about. Love you lots xxx", "dilbatross": "❤️", "calliethorpe\nVerified": "Verified", "bailyvanb": "You are such a role model for us here. And talking honestly about those dark days we all have to go through makes you even more one ❤️, I'm sending you loads of love and light. And strength💛", "sandralaw99": "Ah Dannie we all feel like that at times and it’s hard to get out of it but surround urself even in ur house with things and people U love and try get out as much as possible chin up 💕", "beckyandthejets_": "Solidarity, sweetheart 💖", "mandy2435": "Looking fabulous hun 💖💖💖", "iansangala": "There’s a beauty in not always being in control, you’ll be just fine, don’t stress :)", "mummasueelswood": "Sending big hugs 🤗😘", "janemcinnes83": "Beauty😍", "unique_rosch": "❤️❤️🙏🏾", "stephaniedjl": "Sending you all the love, beaut. It’s hard out here ♥️♥️♥️♥️", "lukeheywoodstyle": "Look after yourself beautiful! No matter what, make sure you make time for yourself. Self love is the first and foremost most important thing! Sending you ultimate love and hugs right now ❤️❤️", "sybillagram": "Hugs Danielle. You inspire the masses, believe that. We all (most of us) feel the way you are doing and especially this time of year when we look back. Even with your illness you are STILL DOING, so 💯 for that.", "gtgmcg": "❤️", "chloeincurve_\nVerified": "Verified", "ailis_brennan": "So great to see you my love ❤️❤️❤️❤️❤️❤️❤️", "kittycowell": "You look lovely. I'm angry for you also. But I'm so happy for how incredibly well you have done and are doing. 🖤", "chloeplumstead": "Keep going babe. ❤️", "howste": "Fabulous ✨"}