{"xbuzzyx": "Most people who have this op seem to have problems :( hope your on the mend soon x", "daunteley": "Praying...", "polar_coaster": "Abdominal surgery is Sooo rough. There's so much going on in there If you think about it. Nearly all of our vital organs are squished into that small space and then surgery exposes them to the world...it just leaves room for many and more issues to arise while fixing an original issue. It's very unfortunate that while fixing one potentially fatal diagnosis another serious illness arises due to surgical complications. No surgery is without risk and as long as you trust your doctors, their staff, and the hospital you will be fine. Never be afraid to advocate for yourself and always follow doctors orders :) feel better soon!!!!", "curvy_roamer": "Feel better 😘😘😘😘😘", "uk_reash": "Aww get well soon. I wish you good health.", "cassybhairo": "I hope you get better soon xx", "missannastomosis": "This is such a big mess all over... I really really cross my fingers for you, that it has an end soon and you can concentrate on recovery.. You really took everything that could go wrong with abdominal surgery.. Most of my patients are in the same situation at the icu and I can at least relate to the exhaustion you must be feeling at this point now 😥", "lechicboheme": "I hope you get well soon!!!!", "angi_look": "Hope u get better soon. Had also a rutine appendix surgury in June and had to have a correction surgury in october, sadly i still suffer from the pain a had before June :( get well soon :)", "ohhellolyss": "Sending you so much love, strength and healing. I'm so sorry that you're going through this darling. Truly does hurt me to see you like this. Keep your head up and send out only the most positive of vibes and energy into the world to bring you back to good health. So much love from me to you ❤️❤️", "nondepieke": "Feel Better!", "daniellevanier\nVerified": "Verified", "ruthhbarry": "@daniellevanier I'm so sorry Danielle. I've followed you for awhile and have always been so inspired by your spirit and style. This is absolutely awful and I'm sorry it's happening. You have someone sending you good vibes and prayers from Massachusetts. Xoxox 💐🌺🌸🌻🌷🌹", "mashelle_my_belle": "Omgosh! Hope you are feeling better", "the1kristamonroe": ":(", "carpenter_brute": "I literally feel your pain. I've just had my gallbladder avec golf ball sized gallstones removed after critical illness. Feel better soon! 💚", "honorcurves": "Oh my goodness I am so sorry to hear you have not been well!!! sending love and positive vibes your way.", "rvbencoatl82": "Hope you get to go home ad stay home!!", "mizwoochic": "Sending my best wishes!!! 🙏🏾🙏🏾🙏🏾🙏🏾", "nicdp86": "Hope you're on the mend. This does worry me as I've been told I will need to have my gallbladder removed. I've had an abdominal scan and due for an MRI next week but they have said its to be removed. I'm scared to eat or what to eat or over do anything incase I have another flare up! All this for my 30th birthday 😩😩", "bitz_of_mitz": "I am so sorry this happened to u love...but I'm so glad you're so much better now. Haven't been on IG very much and decided to see how u were doing.😉❤️", "fofana.buba": "Oh, sorry my dear", "wright.evie2": "The exact same thing hapennd to me except I have to go into hospital every 4 weeks and I'm in there a week @daniellevanier", "ursulasam": "All my love❤️", "pollypollypollypolly": "Hope you're ok Danni xx", "francy.andthesea": "😔😔hope you'll feel better very soon!😌🌺🌸🌷🍀", "clumsy_87": "❤️❤️❤️", "psychicschaumburg": "Hope you feel better", "april_thorpe_": "Sending all the well wishes in the world 💜", "theimelda.jackson": "I hope you get well soon! 💕💕💕", "autumnredsky": "what a nightmare! I hope you get better soon x", "mrrrdth": "Found you randomly and had to comment. I'm so sorry you've been going through such an ordeal! I hope you're on the upward swing now and feel better quickly.", "qimzel": "Boy, haven't you suffered enough lately! I hope you'll get some relief soon!! ❤️", "saraheast777": "I would honestly take the Dr/Drs responsible for the original operation to the cleaners for neglect!!!", "jasenomade": "👊💞", "yfat_bar": "Hope you'll feel better in no time🌸", "chaoticcat": "Get well soon. Hospitals are bloody awful. I should know I work in one.", "cookiebandit1": "✌😮😍", "agemlikenoother": "Get well soon ❤️", "joyfuljoy1981": "Get well soon @daniellevanier I had my gallbladder out in Feb and had a few complications, although nothing compared to the awful time you've had. I'm now feeling almost back to myself again. It does happen, it's just going to take time. Rest up and I look forward to seeing you back to your fabulous self Asap xx", "k_tita": "I feel for you, I was in a very similar situation earlier this month. Soldier on beautiful, I know it's frustrating but you can do it! I hope for a speedy recovery. Much love and light 💕", "agnese.venturi": "So sorry get well soon", "frannamstyle": "Ooooh no! Horrendous! Had mine out 10 years ago & a v similar story. It takes time but you will get better. Big (gentle) hugs xx", "sararie255": "Wishing you a much speedier recpvery", "nicole_dsouza": "May God bless you", "3amoor_al3shry_23": "❤ gad bless u", "mymomemtsinlife": "Get well soon. Stay strong.", "bbw_fit": "Get well soon and hope your eating you greens 💕💞💗💓", "bereosornio": "Get well soon. Love from Mexico 😚😚", "me_he85": "Holy crap. That's terrible to hear!! Take care. Thoughts are with you", "catherinethegrreat": "I am so sorry. That's awful for you. Get better and enjoy the buzz from them painkillers as long as you are there.", "peexo": "Sending all my love, been following your ordeal through Twitter and just want you to get better! Stay strong, you're doing amazingly well ❤️", "creoleladycousins1966": "Prays for strenght", "nickyj2011": "Gosh, so sorry you've been so ill. Miss your usual smiley, fun posts and pics, but hopefully you'll be up and about and out having fun in no time. Perhaps a holiday is in order? ☀️☀️☀️", "milena.takes.pictures": "Hope you feel better soon! 🎀", "noeksz": "So so horrible.. Hope u will feel better very soon!😘", "v.w.h.m": "Hoping you get well soon and leave all this hospital stuff behind!💗💗💪🏽💪🏽🙏🏽🙏🏽", "mpenger": "😰", "jezra_m": "Awww hunnie😘... Sending my strength, love and a hug for you Hun. Keep strong you will be all better soon 💋💋💋", "marissachavstudio": "Get well! 💕", "rachaelfromthebridge": "I'm so sorry. I hope this gets sorted soon 💗", "katenolan6": "Sorry to hear you're still having such a hard time, if I can do anything please let me know, even if it's just a virtual cuddle 💕 take care and positive thoughts coming your way 🌟 x", "k_y_l_i_e_m": "OMG bab that sounds horrendous. I do hope you recover soon and can go home and live a pain free life. Get well soon xx", "qurlyquilt": "Hope you feel better soon!", "francycobo_h": "Praying for you to get well soon!", "curvydutchie": "Get well soon ❤️", "sandez8": "So sorry to hear you're going through all this. Stay strong! Wishing you a speedy recovery.", "dianadoodlebug": "Oh you poor girl. I hope you get home soon. Best wishes ★", "creme.de.la.femme": "💟fingers crossed you get out there soon, much love to you Danielle💟", "_katikins_": "Oh you poor thing 😮 I've been wondering how you are, so sorry that you're having such an awful time. Fingers crossed you start improving soon 💓💓", "frogprncs1971": "You poor thing!!!! Praying for a quick stay this time", "groxley_": "Hope you recover asap ✨", "thebiggerblog": "OMG 🙏🏻🍀💕", "isabellazeebee": "Get well soon!", "misssabrinafairchild": "(((((Hugs)))))", "kirsty_broadmore": "Poor babe", "angelanicolasa": "Feel better soon! Sending healing thoughts your way.", "milkwithnosugar": "I was thinking of you last night, and I'd hopes you were on the mend. Sending love and gentle hugs xx", "beryl_paws": "Get well dear", "insertname.1970": "Sending positive and healing vibes to you express.", "louiseismoi": "I hope you feel better soon xx", "sarcastathon": "Big hugs and I hope it's over soon for you ❤️", "ironsapril": "My heart goes out to you @daniellevanier may you heal soon {{HUGS}} 🤓", "lucylovesfloral": "@daniellevanier get well soon, you still look fabulous xx", "tmtsx": "Hope you feel better soon💐💐💐", "sarajeano": "Sending positive thoughts.", "vivatramp": "💜💕💜💕", "imbeingerica": "Oh God Danie - all my thoughts are with you x", "here_is_me.l": "Praying for for you!!", "katrinaloveridge_sew_sheppey": "😷💚", "omirithomas": "Get well soon hun.x", "daniellegenese": "Prayers are with you", "djkaseynova": "I hope you get well soon! I've been in the hospital before for similar things but I can't imagine being there for so long", "jamie_t_83": "Get well soon, 6 procedures in such 3 weeks must be awful :-(", "ramblingmads": "Hope you get better soon and back home for good.", "heyloriellis": "Oh my! I am so very sorry. Praying you get better asap💕", "justlovelylittlethings": "Aww hon, so sorry to hear you're going through such a tough time! Really hoping you get better soon lovely. Sending get well hugs!!! 💕", "april_ionson": "Oh my God! All your suffering-I feel for you Danielle. Hoping you can look back on this experience one day and see your own strength shine through. Thinking of you and sending you some reiki-you popped into my mind today and now I know why! 😣🌟🌀🌈💜", "biggirlslovefashion2": "😔 Feel better soon!!!!!! ❤️❤️❤️💪🏼💪🏼💪🏼", "curvesinacardigan": "Omg that's terrible! I hope they can sort it out and you can go home and feel better soon!", "claire_meets_world": "This is soooo rubbish. I really hope things start looking up soon x", "stickysweetdanish": "Sending you all the hugs ❤️", "katedrama100": "Can't believe what you've been through. Stay strong xx💗💗", "stelthegirl": "@daniellevanier omg! Can't believe your still unwell 😁 get well wishes to you xx", "harlow_au": "Hoping you are back on your feet and feeling a million bucks in no time 💕", "franceslwilson": "Sending you hugs and healthy vibes xxx", "laurennicolefk": "Oh no! Sending all my healing and positive energy to you. Get well soon xoxo", "shelleykoppelaar": "I hope you get well soon. This is so terrible :( x", "miss_vidal": "Sending you love and power 🙏🏻", "aneshasylvia": "Wow girl you are having a serious rough go at this! Sending love and prayers to you.", "essbeevee": "Ugh, this sucks so much! I feel terrible for you. Really hope you get home soon and put an end to all this xxx", "therealgilpina": "@daniellevanier Get well very soon. Lots of prayers going out to you!❤️", "fauxreal79": "I hope you recover quickly and don't need anymore surgeries. It's scary for sure. You're in my thoughts.", "chubbycartwheels": "I'm so sorry you are having to go thru all this sweetie.", "kazikaren": "Can't imagine how you are feelin'..just hope tomorrow is better for you #smallsteps ❤", "_boobee": "HOPE YOU FEEL BETTER SOON !!!!", "missmjcollins": "Ohhh my goodness, you poor thing! Get well soon", "nadialemrini": "Get well soon, beautiful!!! 💜", "susiesaurus90": "Sending love and positivity your way. Hope all is sorted soon! X", "fatinthecity": "So sorry love , hope you feel better soon.", "elthornto": "Sending all my love magical girl xxx", "mademepretty": "Thinking of you lovely 💓💓", "sueeee_": "<3 sending you hugs", "bereccaleigh": "Sending you positive vibes. You can do this xxxxx", "aaeeiikkrr": "Get better soon! Sending you some positive vibes 😊", "theblackpearlb": "Oh babe, I can't even imagine what you're going through 😔 Sending lots of love and hugs your way beautiful ❤️❤️❤️", "nam_40": "Oh get well wishes to you as that sounds crappy! 😘", "thefatassgirl": "Get well soon babe!!!! 😘❤️", "mrsroche2017": "Why would you not go to another hospital ? You deserve better treatment", "dontbearunaway": "Oh no get well soon!", "mayralouise\nVerified": "Verified", "amberinred": "So sorry to hear this! It's not fun. I hope you have lovely people nearby who can make it bearable for you X", "artandlove": "Sending you warm wishes! I got my gallbladder taken out two years ago and believe me I know the pain is horrible! Hang in there!", "missclassiccars": "Get well soon!!! ❤️🙏🏻❤️", "sirramoanbruce": "Get well soon", "tastebudchick": "Prayers coming your way! *hugs*", "shopnavyjane": "So sorry, feel better❤", "cheesecake1979": "Oh lawd, this has been going on way too long! I hope you get consistent good care till you're 100%.", "kellyteigan": "I was just thinking about you earlier and hoping to see you post on social social-media. I'm so sorry that this is happening but I'm confident that you will be better very soon. Sending all the positive vibes💙", "mrsgregsie": "😯 I'm so sorry chicky, it's bloody ridiculous what you're having to go through. Sending you shed loads of positive thoughts, cuddles and kisses!! 😻💖😙 and crowns .. cos fuck yeah ! 👑👑👑👑 😜 xx"}