{"gtgmcg": "I pretty much live in variations of this outfit, swapping Bretons and band T’s with my blazers and jeans", "cmburnley": "Love the simplicity of this... can’t find the blazer on dp I am in desperate need", "nicnoohitch": "Hi Dan, just come on through our girls will sort you out x", "rubydoozstyle": "Gorgeous!! Xx", "ohheychez": "I love this look so much 😍", "amandamcq100": "Looking gorge! Love it all!", "mypeachylife": "I love this outfit, you look absolutely gorgeous! 🔥😍 I am so inspired by this look 🤩🌟", "briolarose": "Is the blazer DP?! I love it!! 😍", "oddsandtrends_": "Love this look, very smart casual and ready for anything!💕", "laurentbesserve": "Super belle 🖒🖒🖒😍😍", "lindamartin92": "Oh this is fabulous on you! 👌 I love it. 😍🔥🔥", "strangerminds123": "You look cute", "bitz_of_mitz": "LOVE!! You look good anything! Really liking how fitted the jeans look!😍🙌🏻❤️", "chezboop": "Love how you've styled the white open back shoes for cold weather, so cool 😎", "themysticpixy": "I just found you through @paigejoannaa ‘s insta stories & I’m not sure how I’ve not seen you before. My life is now complete 😩😍💖", "nicolegraham031": "Looks bloody fabulous.", "jim_jam_jaime_lynn": "I’m desperate for some plus size skinnies that are mid/high waisted and don’t lose their shape after a few hours. Any thoughts?", "flawless_waist": "Love your page 😍 Keep it up!", "roshanpns983": "Nice pic 😱👌💞💖...", "nadianeb": "Honestly, it would be so refreshing to see some clean cut, well-fitting, classic styles! I love everything you do, but I have been thirsting for a plus size take on timeless style. This outfit is wonderful and looks absolutely gorgeous on you! ♥️", "janined80": "I need this jacket. Do you have any details so I can search for it online??", "markimiche": "Wow! You look dam hot and beautiful dear", "naser_mansr": "Very still", "aijazbaba1965": "👌❤", "gerrietvd": "I like it!! 👌🏻😘", "guinnivere": "Looks really great. Simple as well as elegant at the same time😍", "nnsonosemplice17": "I like it very very much", "curvygirlthin": "Uniform x I love it x", "jillipie": "@daniellevanier which jeans are these? They all seem to have names!! 😘", "meggie1614": "This is like my perfect outfit! (Except I’d probably go with a black tee instead of white) It looks great on you! ❣️", "cerilouise36": "Gorgeous ❤️", "grb08": "Amazing! Can we please can we have link to jeans? Xx", "bribriou": "You look great! I ❤ this outfit from top to bottom!", "ted1ble": "Crisp 👌🏻", "victoria_mccairn": "Classic denim combo 👌🏼 Love the blazer ❤️", "tenneillepitt": "That blazer is everything! I LOVE this look! Those jeans are wearing you honey, and not the other way around 🌸🤗❤️👖 you’re my style icon! AND....your hair looks gorgeous, so rich in color depth 💓💓 #canwebebestfriends 💁🏻‍♀️", "cheryl_and_the_bennetts": "@daniellevanier looks amazing but then (and no brown nosing intended) you seem to pull off most looks x", "hollyiow": "I know exactly what you mean ! Took me ages to wear blue denim! Looks lovely and like you said ‘timeless’! I’ve not tried any #dorothyperkinscurve yet xxx", "kellyytoland": "Banginggggggg! You give me life Danie 😍", "jessica16xo": "I am loving that blazer!!!!", "officialellemartin": "@daniellevanier I literally just took 2 blazers out of a bunch of clothes I was planning to sell because of this post 😂", "hannah_key89": "Can’t find the blazer, is this DP too? Recent? @daniellevanier", "lippyinlondon": "I love this look, really suits you and you look 🔥🔥🔥👌", "haikofio": "Bellissima la giacca!!!😍", "tomslizzy": "Gorgeous, loving your style 😁", "marielouise331984": "😍 @daniellevanier what an amazing look. I am always looking for the perfect tee as I get the infamous belly roll when I wear jeans. Your look is seamless any recommendations for a great white tee?", "katya_coldheart": "Love this look", "taniakamkel": "Love this look!!! 👌", "grungekittyphotogeek": "You look SO lovely!", "heart_rachel": "I love this! So effortlessly chic. The blazer is perfection and the shirt and jeans fit like a glove.", "aggyjoe85": "Love this on you. Honest to God I wish I had your confidence! You look amazing in everything you wear xx", "emilylenax": "Love this look x", "calliethorpe\nVerified": "Verified", "lizziedoll": "LOVE!", "lottiehope": "I love this look on you, it may be staple on others but it’s a different look on you & it’s great!", "xarirou": "Let’s be honest - you make everything look amazing!! Love this classic look!", "aimz1108": "Such a look!! 👏🏼👏🏼👏🏼", "nixiwoo1": "You look amazing!! I wish I could get jeans to fit me properly!", "themaryjones": "@daniellevanier I bought these jeans yesterday & wearing today. Sooo comfy & def need to size down. Now I want that jacket too!", "socialmediatrix": "Love this! So simple and chic! It’s true that this has been a bit of an Instagram staple for a select group of women and body types, but it’s so classic it should be available for everyone and you ROCK it!", "plusequals": "Absolutely gorgeina - as always tho let’s be honest 💘", "hdmarie": "Love it!", "gem_curtis": "Loving this outfit on you, and feels like something I could maybe pull off too!", "justbeingkal": "Loving it ... perfect casual classy outfit 👌🏻", "ninabeena999": "You look fabulous 😍😍 @daniellevanier", "gemma_lupton": "I had a mini obsession with wearing jeans and blazers a few years back. Might have to dig them back out again after seeing this outfit. You look fab x", "rainbowsrosesbl": "That's such a great look on you! I tend not to like that sort of check, but it works so well with this outfit that I may yet be persuaded!!", "martacolacoo": "Stunning! Amazing outfit dear!", "shopyewdee": "Awesome :)", "dorothyperkins\nVerified": "Verified", "vaneschkavuillaume": "Love it 👌🏽", "nubiasangel": "Love it you look gorgeous as always though!😍👌🏾", "avocaswim": "My go to style. Suits everyone from 20 to 60. Dress down with Stan Smiths or Converse too.", "lottielamour": "You look babely - sometimes the classics are the best! 💖✨", "ladyirenevintage": "Mmmm...Dorothy Perkins jeans!! Who knew? Yeah, I love the denim blazer too just don't think jeans don't suit me and find the good fit for a short and curvy like me it's a miracle!!", "dudugasa": "Sexy momma😍😍", "helenaimees": "Love this! A classic outfit like this and a fun lipstick are an instance confidence kick for me. Must locate some awesome blazers...", "tonicoakley": "@daniellevanier 😍 I love this combo my hang up is short tops hate my belly!!! I would need to wear a shirt with this!!! Dorothy Perkin denims are the best literally love them!", "emzi63": "Looks fab!!", "pobbadist": "Love this!", "sammykay92": "I Love This Look! 👌🏻 I Have Wanted To Try Something Similar For Ages But I Don’t Think I Would Pull It Off! 🙈 You Look Amazing As Always Tho! Xxx", "ahmadahmad1871": "👌", "jannyosull": "Your not helping my spending ban 😭 loooove the blazer!", "marni_rose": "This look would look great with heels 👠", "mcrmoshents": "I love it, so different from what you normally wear but it really suits you!", "julideozer": "Whats DP jeans fit like?", "lauriewinkless": "Love it!", "lyric_jazz_me": "Oh wow 😱 you look amazing (as always). Jeans look SO GOOD!!", "shannonbarnett1": "Peng 😍", "rufeyroo": "Looks lush, try with a pair of cons too?", "notsoplussize": "You look amazing! x", "chloepierreldn": "Buff", "nickyj2011": "Oh wow, those jeans look fantastic! I have been looking a getting a pair of jeans and may give these a go. I haven’t worn jeans since I was about 25! 😲", "caros_little_corner": "Love it ❤️ you are gorgeous and sooo inspiring!! 🤩", "whoistanja": "Love 😍", "siancarousel": "Looks so good! I need to rock this look more. Also THOSE SHOES!!!", "itismarg": "Really classy, love it on you!", "sarahgalasko": "It’s great and very stylish! Jacket is ace", "valerie_mg_healy_": "Yes! You look fabulous in jeans!!!!", "naomi_g": "Looks good lovey! I wear a similar outfit almost daily! Just so easy!", "jacqueline_caplan": "Oooh I’ve not shopped in DP for ages. Game changer. Love the blazer", "miss_comma": "I love this!! Such a 'chuck it on a look amaze outfit' 😍🤗💗"}