{"emilysmith1997": "Love that top! Can’t seem to find it online 😩", "inmyjoi": "Obsessed", "kittycowell": "You look awesome I love the clashing patterns. 🖤💘 And don't worry I spent the day trying to hide from the sun at the @queensofthestoneage gig!", "claire.tex": "I don't wanna be out in the heat! Sometimes indoors is best but the sun makes me feel guilty too. That's why I love gloomy weather 😊", "mxnmrtnz": "@daniellevanier that’s it! You’ve convinced me. I’m getting these pants. They look amazing on you 😍", "fashionably_famished": "Love the dots and stripes🧡🙌🏽", "jrstrose": "❤️", "caragenie": "I had to work so i guess that counts too but i was looking out the windows with puppy dog eyes", "fashiontweet": "Imma need these pants and tomorrow is my stay in bed day.", "laurennicolefk": "Yesssssssss😍😍😍😍", "kinlochbervie": "All. Day.", "ksveno": "@daniellevanier can you please share were the stripy rainbow 🌈 top is from? Tia", "kerryannaldo": "Dhillon Wines! Ps you look ace x", "cocoamande": "I’m staying in for a couple of days. I’ve a long term illness and I just can’t hack the sun like I used to. Looking fabulous as always @daniellevanier xx", "chloeplumstead": "Gorrrrgeous 😍", "snazzy_men": "🔥👌🏻", "law1sfab": "You look fabulous!! I love that tee, I stay in a lot I can’t cope with too much sun it gives me headaches lol xx", "hannahgodown": "Love these mixed prints ❤️❤️", "la.grossedame": "Magnifique !", "jaz_m_ine": "Love everything about this !", "fazal_6666": "Lovely pic", "the_alisejane": "Love your look!!", "mariesouthardospina": "Print mixing so marvellously on point 😍", "corrina_christina": "@lisacunnane just scrolled through this bloggers post for a half hour! You might like her !", "mizzp1971": "@daniellevanier I spent the Day on the Sofa watching the Football, every attempt to get out the Front Door was Thwarted by Ice Cold White Wine #sofadaysrock 🤩", "tmtsx": "Yep🙋I had lovely lazy sofa day too. You look gorgeous btw!", "mouthygirl": "Currently all dressed up and just painting my nails.", "bblogrt": "This photograph looks amazing - use our hashtag bblogrt for a free repost!", "anothertattooedbaker": "I'm currently in Spain visiting family and spent the whole day on my butt... Only went out for tapas. Looking Beaut as always Doll xxx", "gaynormrandall": "Omg 100k 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 go girrrrl 😘😘😘 you look bloody amazing xx", "emillennial": "Spent in on the sofa, with the blinds closed. AND I AM FINE WITH IT.", "kellyaugustineb\nVerified": "Verified", "giingerellla": "Yep thats also me 🙋🏼‍♀️🙋🏼‍♀️", "mrs.jonesb": "I didn’t today but I CAN’T WAIT to do it tomorrow 🤗🤗🤗 @daniellevanier", "curvesncurlsuk": "I was in an extremely roasting hot hospital most of the day, but it was totally worth it because I got to meet my nephew 💙👶🏻", "sugalocs_1": "I went outside only to hang the washing!", "daniellerubykk": "I stayed in all day 🙈 the heat is not my friend at the best of times I’m also 32 weeks pregnant with twins no way was I gonna b in the sun. I didn’t make it to the sofa tho I laid in bed 😂🙈 xx", "lynseydoris": "I’m still in my PJs from last night! I slept until 330 in bed, then moved to the sofa, back to bed again then back to the sofa! My pain has been awful today so that’s my excuse!", "nicole_bette": "Love the pattern mix! 😍😍", "kelly_of": "I slept all day, bad fibre flare, woke up so dehydrated! Now watching Titanic, my favourite film! ❤", "cateygee": "I had laser eye surgery 2 days ago so I've not been out since then! How are your eyes now since your surgery?", "amyfuchsia": "Amazing 😍😍😍😍", "maisnatas": "I have those sneaks in Black they are the most comfortable shoes I’ve ever owned!", "girlwithcurves\nVerified": "Verified", "_larissa.demarco_": "😆👍 yes, I did the same today 😋😋", "wearshelives": "I’m in Canada and it’s the middle of the afternoon here haha, but V sunny and I’m about to go watch a movie at the theatre...inside a dark and cold room 😂", "jacqueline_caplan": "Love staying in. Self care comes first x", "gailcoles2808": "Spent the afternoon snoring on the sofa and have eaten my body weight in fish and chips watching the footie. There, don’t you feel fabulous now? 😂😂 the pressure to be fabulous, sitting in a glorious location, sipping Pimms was too much .... so I passed", "georgetteharrison": "This is a lovely outfit. X", "dianasaladpot": "I stayed in bed. I’m ill but if I wasn’t? I’d have stayed in bed", "coffee.and.curls": "So fantastic", "anishaoram": "I stayed in bed till 10, food shop then chilled out on the sofa. I needed a day to myself!! X", "onyxzen18": "I went out for lunch with a friend, but tomorrow I will be on the couch.", "paige.2210": "Ive had a really bad fibro day and done literally nothing all day. Now waiting on someone to hopefully bring me food. 😅✌🏻", "kellouhar\nVerified": "Verified", "simmant6881": "Am dieing for you", "ni_no_ni": "👆🏼", "nesayem": "Did the same! No shame! Had a little Bake Off Australia marathon :)", "thesmilingsweetheart": "Oh yes boo. I’m staying in! Ease that guilt and treat yo self!", "sus_flower": "😂😂😂😂😂Snap!👌", "richardnixon86": "I’m in love with your shirt!", "hollieplus": "Yeah. I went out. To get fish & chips. 😂", "josie_pointer": "I spent my day on the sofa as my IBS was flaring up, watched some Netflix.", "foolishmule": "Yep. Getting my money's worth of Netflix 😂", "gingerelder": "@daniellevanier as a ginger I hid in the darkest room of the house!!!", "mariellemachado": "did the same and feeling a bit guilty too, specially cause i’m in scotland and nice sunny days are basically a myth 😪", "fleur1923": "I did the same yesterday. Pretty much the whole day on the sofa sat in front of a fan trying to cool off. And today I only left the house to go to the supermarket! No shame for either of us! X", "chelcity1": "Had to go to the beach bc who knows how many times I’ll get the chance this summer! But love lazy saturdays too!", "katietreggiden.1": "I’m with you! 🙌🏻", "maartje.adriana": "This is a LOOK and a half!! I spend almost every Saturday at home so I know how you feel Moomoo 😘✨", "anasnowdon": "I’m currently wearing this tshirt I love it so much! Makes me feel like a kids telly presenter haha", "mrskatiekoo85": "I popped out this morning shopping then came home and chilled on the sofa watching csi lol 😝", "queensandcats": "All day on the sofa. Yesterday, today and probably tomorrow too. It is ok. And besides there is a Football World Championship to watch.", "laranotcroft": "I went out for about an hour, but then came home and have been binge watching Marvel Runaways", "susie265": "Avoiding the sun too, was out hanging laundry out but apart from that I've been chilling, listening to music, with my fan on in my front room. Staying pale and interesting as they say lol!! Too hot for me I'm afraid. So don't feel bad, we all need to just chill sometimes.", "debscky": "I don’t even feel guilty about it, went to Tesco got snacks, had a nap in the garden. Not a fuck given today xx", "louby1988": "I did that too! Slept most of the day 🙈 xx", "tobiannbrown": "I did watched all the twilight films 😀", "appleshapedheart": "Me too. Over did the sun yesterday and had a three hour power nap on sofa instead!!", "esthergram__": "I did the exact same don’t worry🙋🏿‍♀️", "caroline.c.wilson": "Yep... tidied up for new fridge freezer coming. Watched the hubby fit it then put some washing down an had a nap... 😂😂", "k8ifer": "I went out in the shade and sorted out some plants but I've spent most of the day feet up watching GLOW on Netflix.", "kellyblade": "STOP IT @daniellevanier MY BRAIN CAN'T HANDLE THE 🔥🔥🔥", "nicoleocran": "Definitely didn’t stay in but I’m literally a melted mess, I wish I did! 😂 But can we talk about the buffness that is this shot tho? 😍😍😍", "beckymace_": "Yep, stayed in all day.. going to stay in for the rest of the night and consume vast amounts of sangria and tapas x", "laurafletcher1975": "I've done sweet F.A today! @daniellevanier 💚💙💜", "dunja_w": "I spent the day on my lounge bed outside. Now watching a movie and then it’s off to bed🙈", "jessica_chelsey": "I did the same thing! And with the curtains closed 😂 don't worry bout it! 💖", "ami_pawlak": "Stayed in and baked cake! 🙈x", "bobbivance": "Fantastic combo babes x x x", "nataliebou": "Yep stayed in too. This weather is too much for me after a long week at work. I managed a walk to the local shop and back. And I deliveroo’d an icecream. 😳 felt awful when he arrived, I live up a hill. I tipped big.", "gingergirlsays": "I went outside to eat my bagel but the sweat was distracting me too much so I came in to enjoy it in peace. Food before sun always", "cam.williamss_": "Simply gorgeous! Can we chat about getting you pair of eye wear and featured in our brand Just check my link and fill out the form", "mrsanniesinclairbonner": "That shot is a dream 😍", "beckypoppins82": "I did 👍", "cazdurston": "I did the same... even had a Chinese takeaway for dinner. Ain’t even mad", "lucy_earnshaw": "I went outside and fell asleep for ten secs then came in and thought I’d burnt so sat in the sofa for hours before realising it was our purple voile curtains in the kitchen that had given me a red hue! 😂 plus this weather is here to stay for a bit so there will be other days x", "booksnbrooches": "My ME kicked my butt today, spent most of today on my bed xx", "anoukmerkelens": "Yaaaaaaas I did 🙋🏼", "bally_hayer": "I stay in all day ...Loved it ...", "kateslouisesaunders": "Me? & it was to clean 😭", "gemmanelson77": "🙋‍♀️", "csbadgery": "Been napping all day 😂"}