{"theverysimong": "I WANNA WIN!!!!", "mrsanniesinclairbonner": "I’d love to wear the floatly, midi skirt situation that is so popular right now but because I’m short they seem to be more maxi and lose the chic-ness and look ridiculous. HELP PLEASE!!! Ps you look bomb 😍", "bambinaaa": "My cousin is getting married in September and I’d love to have a great outfit for the wedding! I’d like a long dress, a wow dress 💖", "gembellfield": "My birthday is coming upppp and we are going for drinks at pergola!! Would love a new outfit that fits me well and is a bit bolder than what I’d usually go for (all black)!!!", "lauraacupcakes_": "I want to know how to wear crop tops or coordinates!! I’d love to win this! ❤️", "kimwim": "Help!!! Over 50yrs and under 5.4!!!", "appyamy1998": "This would be amazing, I’m a chunky monkey but I’m short like really short so when I where certain clothes they all just look weird because everything is long, I also have my graduation soon which I don’t know if I should go because I don’t know what to wear and I never look good in anything, I wear the same black jeans and a top style everyday and it just depresses me I can’t find anything nice that actually suits my body 😑!!!!!", "annieiswellcool": "I’m in a band and am plus size and could really do with some advice with stage outfits! Would love to win this", "louisew01": "Formal work wear that isnt a square trouser suit xx", "lilysmummy21": "I’d love some help getting out of my jean and tshirt mum/work rut 😘", "monieuw": "Hello from The Netherlands. Can i enter as well? I have trouble finding good trousers. I would love to meet you. So inspiring. Thanx Monique", "100womeniknow": "I’ve always wanted to make a statement and wear a cool coloured power suit or a colour co-ord outfit for events! But haven’t quite managed it yet, I’d love some styling help! 💖", "ljhodgson": "I would love to win this experience, with my new found confidence this is the perfect way to stride out of my comfort zone of black on black with your help (you have already inspired me to do so with the M&S stripey summer dress) but I would love to see what creations you would put together for me! I have followed you and @calliethorpe for so long and would love to be part of your girl gang 💁🏻‍♀️", "binge.to.bopo": "I find it difficult to find plus size clothing that is stretchy, not clingy, and actually shows a bit of cleavage...I feel like a lot of it is too high necked or frumpy - how can I throw together a look that’s classic and trendy but also comfortable and will stretch as my body bloats and shrinks?", "ambzrose_x": "Hiiiii Danielle I’m entering the competition because I need help with poses and what I mean by that is when I’m ready to take a pic of my outfit for the day (especially when I’m feeling myself lol) I can never crack that pose I’m so awkward in them and just can’t do it I need your expertise to show me how it’s done 😂😂😂 so plz let me be a winner and help me dodge those full body pics making me look like a plonker 😩❤️🙏🏾👏🏼", "theabbybible": "You literally glow like the angel you are in every gosh darn pic!!! 😍🙌🏻", "becloub_": "Shoes 😍", "vickil68": "Rocking the @marksandspencer dress!! Love it 😘", "courtzmelv": "You look incredible!!!", "occhiospy": "Erm hello dream outfit 🙌🏼💕", "kristina_j_hawker": "@daniellevanier what undies do you wear under this? Just bought and very see through but so flattering so deffo wanna keep it!", "agnese.venturi": "Just hang with u! ♥️ maybe a look for the office... something minimal", "pearlgrey7": "Beautiful", "blueskygirlie": "Turning 45. I don’t want to be seen as ‘mutton dressed as lamb’ yet at the same time I still want to be as fashionable as I was at 21...🤔 It seems so easy but it really isn’t.", "missklettandthesea": "OMG! I would love this so much!you are so funny! 🤗 I have a wedding in october and I haven't got a dress yet,please help me!x 😘", "georgiclark": "This isn’t an actual entry as I wouldn’t be able to get there! But can you please give me some inspiration of how to dress office appropriate but still look good? Right now I feel like it’s all so boring!", "blackheartcreatives": "Eeee! So I have a christening coming up and I don’t want to look frumpy, I’m obsessed with looking like a fat frump and sticking to the fat girl uniform I’m completely uninspired by clothes at the moment too. Help me Dani!", "nelsons.maymays": "I'm a size 22 that carries weight around the middle like a sad punctured tire. I've got my graduation black tie dinner on Sep 22nd and need some help!", "allthatbeaut": "I’ve forgotten how to dress for work!! I go back on 17th September and I literally don’t know how to style myself so I will feel comfortable but also like a professional badass at the same time. Would be phenom to spend some time with you and rediscover my confidence. Xx", "staceywils11": "Hey! Soooo I messaged u a few weeks ago to say I finally got a jumpsuit and loved it but I still haven’t had the confidence to wear it. Long story short I nearly lost my life 3 times in the last 11 months. I have a stoma bag huge scares and have gained a couple stone! I’m wearing same things all the time like high waisted jeans and culottes. I wanna be able to throw on a jumpsuit or midi dress and seize the day! Obvs I wanna eat Percy pigs and those bloody gorgeous yum yums too! 🤞🏻🤞🏻🤞🏻 xx", "khloecarbdashian": "I’m desperate to work on more casual looks with basic items! Help!!!!", "katherine_95x_": "I’m always wearing trousers. I love skirts. But I’m horrendous at styling then and struggle to get them to work for my shape. Would love to be able to work it! With a skirt, forever wearing a t shirt and Jeans.", "dee_newell_83": "Swimwear or just something comfy to lounge about it", "jecfree": "Colour! I love it, but never know how to integrate it into my wardrobe! Definitely need help getting out of the black jeans rut!", "rosietypewriter": "Dani, please help! I'm going to a wedding on 1st September in Italy and am going to be standing up in front of everyone! Have a backup dress but it feels too tight after holibobs 🙄", "nishiv_": "Yesssss! I love this! I live in dresses in the summer and leggings the rest of the year. I haven’t worn jeans/trousers for a few years now! I have no idea how to style them for my (very annoying) apple shaped figure! X", "lelmottershead": "I just want to explore fashion and be more adventurous with it! 😄", "oknotperfect": "I’d love to be able to style wide leg trousers. I can never make them look good. Please help 😞😂", "glincho": "I have an interview next week and find it so hard to find professional clothes for chunky gals that don’t make me look really old/ frumpy/ unfashionable. HALP?!?💓", "pscharlie_sw": "Spending the day with you will be amazinggggg!!!! So i am pretty confident in everything I wear however I cannot pull off/ wear trousers! I wear jeans and dresses and leggings! Trousers are so difficult for me to style! Helllppp!! Good luck everyone! Xx", "briolarose": "Hey! Primary school teacher, Mummy to a 3 year old and recently divorced... all by 35 (lucky me). I feel like with the end of my marriage I’ve lost my identity and all the things I used to love about myself have suddenly become flaws. I need help reclaiming who I am xx", "cemdavis": "Hi Danielle, this is a great opportunity but I’m a guy so what the heck let’s give this a go. I’ve got this thing, whenever I go shopping it’s either 2 colours I go for pink or blue, t shirts, shirts or tops in general I stick with those tried and tested colours. Frankly I need help to get some different colours in my life plus I’m 35 and need to start dressing my age 😂 thanks for reading and best of luck to everyone x", "victoriacoops35": "This is amazing Dani! I would love your help to get ideas of keeping outfit choices looking my age 33. I can’t be with you on the 28th though. Looking forward to seeing how you all get on 💕💕", "kelseyplusm": "@daniellevanier Hiya! How can I show a bit more leg/thigh but still feel sexy and powerful? After losing 10stone, I'm left with excess skin on my legs so I tend to lean towards the midi length or longer on my bottom half. I'd love if you could help me style an outfit that I feel confident in that's shows more than just my knees please ❤", "anuadebajo": "Hi Dani 👋🏾! I’ve got my first ever photo shoot for the cover of an industry magazine celebrating diversity. I’m so excited but I have no idea what to wear. I’ve always been confident in my plus size body but lately it’s been hard to maintain the fierceness. I just want to look and feel good and represent for those who look like me in an industry where there aren’t many of us. I would love it if you could help!", "lulandina": "I would like to do that \"effortless chic\" kinda look that you do so well @daniellevanier ! I love trainers, but don't really know how to wear smarter, more classic items with them.", "grinch85": "I'd really like help with an outfit for 'date night'. After having two children in 2 years i can't remember how 'me' looks anymore. We are going to a gig and I really want to look nice and feel confident walking hand in hand with my husband 💏", "tierneys_canvas": "Hi Danielle So one thing I struggle with is getting the right length skirt for my height i am 5’3. I find it hard to get skirts that isnt too short or too long and one that i dont have to go up a dress size to accommodate my pumping thighs & ass. The skirt then ends up being too big around my waist, and i have to wear certain style tops to cover that the waist is too big. If i get skirt in my size they all tend to be too tight in the thigh/bum area & ride up or look too short. Also how to style with the right flat shoes or knee boots (i dont do heels) ... i love that look, but no idea how to do it. Be great as an autumnal outfit. Good luck everyone xx", "chloematildaxo": "Hi Danielle, I’m looking to the style queen you are for some advise on workwear my corporate company has been ‘business dress’ for the 7 years I’ve worked here recently we have gone to ‘Dress for your Diary’ so days with no client meetings we are ‘business casual’ I’m really struggling to address ‘business casual’ please help as I love your style ❤️❤️❤️ xx", "misspattydifusa": "My parents divorced and now they are remarrying (to each other again 😂😂) so I need something for my parents 2nd wedding this winter, something classy that says ‘daughter of the bride’ x", "tamsinjacklin": "Wow what an opportunity! My style query is jackets and layering. You make it look so chic yet effortless, would love to hear your advice! I struggle to step away from a safe navy cardie - how boring! Thank you xxx", "staciemac_plusmodel": "You look amazing. Love the Figaro in the background my fave car of all time! Help me @daniellevanier I renew my vows on September 15th after being married for 10 long, wonderful years lol. I have 2 dresses now in my house and there still not right I want somthing white floaty and special but not too weddingy (not sure that's a word) I see lots of slim girls in pretty boho lacey numbers and i love that look but I'm just not sure I can pull them off at a size 18. 🙈", "chronically_just_me": "I’m a secondary school teacher (all teenage boys, god help me) about to start a new academic year, I also have Rheumatoid Arthritis and Fibro (joy!) so really in need of some smart but ultimately comfortable clothes for work. I live in black leggings and baggy, unflattering black tops to hide everything I hate (but I’m trying so hard to learn not to) about myself. My steroid moon face, weird steroid fat distribution plus weekly injections (just like @chloeincurve_ ) don’t help with self esteem. Plus shoes... oh my god, work shoes are the bane of my life. I can’t wear heels (thanks arthritis) and flats give my stupid wonky ankles no support. Basically, I’m clueless and want to start the new school year on the best possible footing.. so to speak! Confidence is at a real low, so I would love, love, love to have your help! ❤️", "bushybroweth": "Yes dani", "localuna85": "I would love the opportunity to get styled by your fabulous self! After 33 years, I am finally accepting my body for the beautiful thing it is. I have really started to push myself into wearing things I would never have dreamt of before because I believed I was too fat. And you know what, it has been so empowering. Following you and other plus size bloggers has really inspired me to wear what I want, not what I think other people want me to wear. So anyway, I am heading to Chester races in September. I want to rock a formal look, but with my personality on show. I love a bold, bright colour, or a loud print but don't know how to make them sophisticated. Your look is very classic but also very unique and reflective of your personality. I want to be able to do the same for more formal situations. #fingerscrossed #marksandspencer", "sarahsunflowerxxx": "Hello! I’d love style advice for my apple shape, fashion seems to focus on pears! 😁🍏🍐🍎", "hollyofalltrades": "Ooohhhh exciting! Love a cheeky bit of M&S! I never know how to style skirts! I’m great with dresses and trousers but I never ha e the confidence to rock a skirt and you do it so well! I’ve got a few YouTube events coming up that I’d love to wear a skirt like an absolute boss to! Plus I just want to hang out and eat Percy pigs! Ha ha. 😘", "saalene": "You have made me obsessed with M&S tooooooo. Honestly. I love M&S. I saw a dress in there the other day and I’m contemplating it but I’m not sure and it’s long and I’m not so long but should I or shouldn’t I?! You always open my eyes up to styles I wouldn’t normally try and when I do I love them!! Also please teach me how to be a bit more adventurous with styling plzzzzz. Love ya x", "laurenciabutternutsquash": "I don't know who I am style wise anymore! In my 20s I was a size 16-18 Bettie Paige wannabe. I'm now 31 a size 22 mess with fibromyalgia. I don't feel I have the energy to return to my pin-up roots but I don't know my style direction for my age, shape and life! HELP! 😣😣", "julia_nutty_bird_nouveau": "@daniellevanier Having Endometriosis & Fibromyalgia I sometimes struggle with comfort & style & being plus size & 40 + I still want to be trendy, stylish and sophisticated. I would love to step out of my comfort zone of just wearing black tunics & leggings. Please help!❤️", "rbex91": "I’ve been eyeing up some Marks’ stuff for weeks. I’m a teacher and i find it hard to find appropriate clothing for my height and size. I’d love a fitted and smart jumpsuit I could wear again and again, but not too tight on the body. Would love this chance to try some new things out!! Xx", "charlottelouisebarker": "I can’t work out smart casual dress like going out for drinks with friends outfits! I think it’s because I’m so busty that all tops either looks over the top fancy or massive and baggy or too clingy and self conscious ... I just wanna look fab and put together without being too dressed up or too casual 💖 help meeee 😘", "emillyy_x": "Ive got a wedding next weekend and not a clue what to wear as I’m awkwardly in between 2 sizes! I’d like to embrace my curves more but nothing too revealing... I’d love your help!!! 😘", "evans_lauren01": "My husband has just (finally) opened a showroom and store (he does flooring) and I'm going to running the showroom. I'm in desperate need of office/smart casual outfits. Im sick of feeling like a fat blob in everything. I want to look and feel stylish and I don't know how to do it. I'm in a rut as I hate my tummy so normally my clothes have to hide it but I feel it's now sculpting my chances of looking my best. I need help! You ooze style and class and I'd kill for your sassyness. I'd love for you to turn me into a bad are boss bitch! 😂", "brittanypay": "I’m not sure how to wear flattering trousers and top combo and look cute but still be comfortable. 🌺", "alefinka": "I want your help to gain confidence to rock curvy fashion style!! 😄😄😄", "brooklynsmudges": "There is a measure of beauty that God has given to us all. Then there are those who possess beauty beyond what is given. You my dear are the latter. #bewell", "karajanelle_": "I am a size 24 and only 5ft 2 but even more complicated I am all body and boob and no legs. Even petite is too long. So I want an outfit that means I don’t look like that. I look in proportion, comfy, rocking it and still can be a Mum xx", "the.melicia": "DUNGAREES!!! FOR THE LOVE OF GOD, DUNGAREES!! 👖🙏", "holly_rhiannon_": "Wow! Sounds absolutely perfect! 🙌🏼 I’ve been a plus size full booty girl all my life and have always been proud to show my curves. As I’ve got older, had some ups and downs, met my husband, got married and now looking to start a family sometime in the future I’ve tried to loose a few pounds. Enough to build my confidence when it comes to that ‘beach body’. I’m experiencing health issues with girly problems and feel a few lbs will help also. But unfortunately where my weight fluctuates it’s completely changed my shape my problem area has now become my ugly and very wide, un attractive tummy. I would be lying if I said this hasn’t thrown me a bit with my outfit choices and most importantly my confidence. Just a little nudge in the right direction and a pep talk will do me the world of good just before I head off on my much needed hollibobs! I’m sure I will feel much more ‘beach fierce’ with your help. Thanks for the wonderful opportunity 😘", "bellakoko": "I follow both you and M&S, I absolutely adore both💕My enquiry would be regarding disproportionate shapes. I have very big legs and have always struggled to find trousers etc even before I was plus size. I’ve just resigned myself to leggings because of how upsetting shopping for bottoms can be. I would love so much for this experience to change, even if it’s for with 1 store! 🤞♥️", "jasminbrandramjones": "Can I nominate my mum? She's had breast cancer and a double mastectomy and sometimes lacks confidence in how to style her new body shape. Would love to win a lovely treat for her!", "stephanierabbitt": "I always try and dress to my size, spending hours trawling the internet for that “perfect outfit” but even with all the selection out there I can’t help but feel larger ladies like myself have a harder job to make looking good effortless, and the high street shops for me have become a mind field, I tend to feel intimidated going into them and trying things on as most of my past experiences haven’t been good, either I’m looking in all the wrong places or I’m trying on the wrong style to suit me!? So It would be great to have some guidance on how to shop from the high street, with someone with style like yourself, and especially @marksandspencerfashionpr ❤️ I already love there food, would be amazing if I could love there clothing range too and not be afraid to try something different instead of just the plus and curve ranges online. Xx - good luck to everyone entering, such a great competition and opportunity, thanks @daniellevanier ❤️", "carlahardingart": "@daniellevanier as someone who also suffers from fibromyalgia I struggle to get the balance between comfort and style, I would love help good fabulous while in pain. @marksandspencerfashionpr this is a great competition!", "dionneviolet": "I'm in dire need of some back to school work clothes. I teach at a secondary school in South London and I'm 26. Finding clothes that are school appropriate and look good is difficult in curvier body... And I want to look sleek AF when I head back into the classroom and show the world that fat does not equal frumpy!", "rolufss": "I’m struggling to find outfits I actually like for going out. I’m working on my MA dissertation and don’t care what I wear to the library, but my brain is stuck on how to put outfits together for going out w the girls without hating everything I have in my closet!", "dianasaladpot": "I’m going to Curve Fashion Fest in November (aren’t we all!) and all of my friends are bloggers, I want to look cool but feel comfortable and not overheat or find myself thinking about my outfit instead of the day, especially with my wife hoofs!", "silvertailor": "If I’m totally honest I feel I’m not great at being a girl.....I’ve got 2 weddings later this year and always feel like a kid playing dress up when I try to style myself so any and all help required! 🤞 xx", "charlenezorah": "Well its my birthday on Wednesday and im turning 31 mum of 3 and i have no style so i need advice on how to dress stylish and tendy but comfy too x", "mellysadler": "It’s my 30th bday in December and want an outfit to look good in x", "itsonlydanielle": "All I wear is jeans and a hoodies and it’s so boring 😭 I’d love to be able to wear something I’m confident in, and look good. But I just can’t seem to find anything", "annapaola": "I am fat and my arms are thiiiiick, how to style (and rock) outfits when they all fit at least a little wonky in the shoulders/arms part?", "harriethandbags": "All my friends are currently getting married (myself included) and I never know what to wear! I want to find something that flatters my arms - everything is always sleeveless! X", "chantelle_wood_": "I'm turning 30 in October and I'm having a party! I'm already having nightmares trying to find an outfit! It's hard work being the fat friend haha xxx", "hayleydavisx": "I have my hen do next June.. I’ve struggled for years with my weight and would love to wear a jumpsuit/dress that really suits my style & figure. 😍 what an amazing competition I would litterally love to hang out with you your stories have me howling!!😂 xxx", "arnoldoceng\nVerified": "Verified", "amaiastarring": "I would like to have more ideas for cool and fashionable office looks :-)", "libbyjaneduncan": "I'd love some help with styling for potential work looks. I've recently graduated, having the daunting return to work I'd love to feel great in what I'm wearing and confident. I'm 28 so worked before going to uni...I hadn't even heard about body positivity then, so just used to dress to hide my self. However, now I want to say f**k that and be stylish just the way I am ✊ I lovvveeee your style!! You always look fabulous 💕", "roseonyi": "Firstly I adore your style!!!! I would love to find the perfect floaty dress I could style up or down! I've never been able to find a dress that suits my bust (I'm a hh cup!) And my waist being a size 14 please help!!! X", "zeusrush": "What do you do when you're 4ft11 but LOVE calf length skirts/dresses but are told SHORT GIRLS SHOULD WEAR KNEE LENGTH!!!", "jodieo266": "Wow 😍 amazing! I love that dress. I’d love to also start being more “brave” with colour. I always wear black (as pull see on my profile) and buy outfits but never know what to put them with and how to make them pop so yours and @marksandspencerfashionpr help would be amazing! I’m never sure how to dress my curves but still look young/trendy x", "looa88": "I don’t have a event I’m just awful at putting outfits together and stick with the monotonous daily outfit of jeans and a boring top! My boobs are pretty massive and that limits me to the things I can wear! Help me please Danielle your fabulous and maybe some of that can rub off on me 😉 x", "andeejoan": "Hi Dani, I love following you because you prove that plus size can be stylish! Plus your laugh cracks me up! I’d just love to feel put together for once. I always feel like I’m just wearing what fits and not what reflects my personality. I feel like as soon as I put anything on it looks shabby and frumpy. How do I dress with style for my plus size figure? Also, I’m in my 30’s now and really struggling to dress like I’m a fully grown woman, please help! x", "bhargab757": "Cute", "shineaiduk": "I want to be able to move to Teach 5 year olds whilst looking adulting amazing at work in September to bag a promotion pick me", "staceyjd1": "I just always feel like I try too hard with my outfits. I'm not comfortable with my size (even though I wish I was and I wish I could see myself the way I look at others) and I never feel like I quite get it right. I would just like a simple classy style.", "afatgirltravels": "I’m finally getting settled into a career and finding it really hard to find an “office style” that suits my super casual personal style and that I feel comfortable in. I like to dress relatively trendy (eurgh) but have a bit of a fear that in a corporate environment I won’t be taken seriously. Help!", "reddoorponderings": "What a great idea!!! I would love some help with stylish but not boring interview outfits. Especially ones that don’t require me to wear heels! Help🤓", "janopeg": "My wardrobe is mostly monochrome with a few splashes of colour. I’d like to wear more colour but I just don’t know how to commit to colour. I’m a stay at home mum approaching my 30th birthday, so I’d love to go into my 30s colourful and fashionably!", "laurennchance": "Exciting! So I’ve just got a promotion at work that will involve a fair amount of travel and socialising! Really need to update my AW wardrobe, and I struggle with big boobs which can mean following the newest trends is difficult! ☺️", "sazzmatazzzz": "I'm 6 foot tall and struggle so find dresses where the waist is in the right place so I want to wear skirts but I have no idea how to style them! Help!", "wanderingangie": "I would love to find out how to style my body shape. Tbh just understanding what my body shape is would be amazing. I would use this to gain confidence in my style choices and try new and different things. I would love to buy myself new outfits for Christmas parties that I feel amazing in, rather than just comfortable.", "ebeckwith074": "@daniellevanier I've just ordered the dress you are wearing. I've liked it for awhile but was not sure about it as the model is so skinny but seeing you in it today has made me order it. Thank you xx😊", "misshollieb": "Since I got ill and in the wheelchair, I’ve totally lost my sense of style. I used to wear things that showed off my hourglass figure but I’m sat down now in the chair so feel it’s pointless. I’ve been living in leggings and cardigans and want help to feel sexy again.", "laurenelizabeth212": "I’ve recently become less and less in love with my body- I’ve slowly been putting on weight due to a diagnosis of PCOS and have lost all motivation to exercise and eat healthy. Clothes I used to love no longer fit and I’m finding myself by bigger sizes and just thinking about how I can cover everything up. I absolutely love fashion- always have but being bigger now I don’t know how to dress for my size and rock it! I’ve followed you for a while now and love your open honest posts and your style -oh and your lovely family! 😊 I would be so excited to have a styling session with you and hope that some of the confidence you have could rub off on me! Fingers crossed 🤞🏻 xxx", "c_mojo": "My birthday 😚😚 come help me change my punkish look to more professional 😁😍😍", "claire_eckersley": "Jeans...the absolute style struggle of my life. I can never find a pair I can feel comfortable and confident in. I have big hips and a big bum but a smaller waist and I wish I could just find the perfect pair of jeans x", "bex_hilton": "I’d love to find the right dress for the legal part of my wedding next summer! Thanks @daniellevanier ❤️", "bethchalloner": "I have a number of fashion problems! I'm very bottom heavy and I struggle with trousers and bottoms....my arse and thighs are huge but I'm happy with the skin I'm in I just need help picking what works for my shape! Your style is fun, sophisticated and flattering and I want that too! Please help me out! 😍", "rosiemx_": "I’ve just been accepted to start my teacher training course at university and would really love some help with a more school-friendly wardrobe. My style is really modern and alternative, so I definitely need help making myself look more sophisticated and professional ✨❤️", "bloggersarahl": "I’d love you to update my style. Feel stuck in a clothing rut", "claireabella_x": "Curves petite and wanting to be on trend and fashionable Xx", "the_real_alice_in_wonderland": "Now this is so exciting! I was made redundant 3 months ago and finally secured my dream job! I start on Monday 3rd September and need a fabulous new get up to wow on my first day. It's been donkeys years since I had to 'dress up' for an office job so a little help could go a long way 😍", "zemporter": "Please, just help me get out of jeans! Can’t seem to find an alternative to jeans for work without going OTT. I’m still dressing in the jeans and converse I did 25 years ago but I don’t want to look frumpy either. I Work for the third sector which means I can get away with casual but I’ve taken it too far.", "leighomahony": "Yassss💕Any help with introducing colour, all I wear it black!", "rachaelabloomfield": "😘😘😘", "miss_diva_to_you": "@daniellevanier need your help boo!!! I have a wedding on 31st August where I’ll be meeting my boyfriend family for the 1st time! 😬😬😬 His sister is getting married and I’ve almost considered not attending as I’m so nervous about what to wear...! I’m a curvy girl and I really want to embrace my shape and feel confident and I would absolutely love for you to style me as I’m always copying your outfits 😂🙈...thank youuuuuu!!!!", "stilllifewithlisa": "I’m a shorty, but have tall aspirations and I love the callouts with a chunky, boots and jumper look. When I wear this look I feel very short and square which reflects my shape. However I love the 70’s vibe I know this outfit can deliver. This autumn and winter I want to wear some fabulous boots, a pair of callouts and a jumper and feel like a sexy woman who is bringing the 70’s groovy vibe into the now 🌟 your guidance and a whole lotta fun would be 👌 Lisa xx", "margaretlbeggs": "Hey! So I live in Hawaii with my husband. He’s in the Air Force and we’re stationed here. I’m plus size and I can normally come to peace with my body, but I really struggle when it comes to the beach! I really would love to get help with wearing a bikini! 😬 right now i only wear one pieces and they’re usually pretty conservative. I would love a beach outfit that makes me feel sexy and would love to try a bikini, i just can’t figure out how to style one. I see other plus size women rock them all the time, and I see awesome beach looks with beautiful jewelry or hats. Please help me get out of my one piece rut! Love your page and I love sofa chats! ♥️♥️", "alys_case": "Help me pleasseeee. Over the last few years I've gained so much weight, all my friends are getting married and some even having babies and I'm still getting takeaways on a Wednesday night.... I've got a hen party coming up and so far I've returned 5 outfits (in the one week I've spent looking so far) 🙄 all of my friends are beauty goddesses and they are all tiny with boobs and curves in all the right places. The hen party also includes a spa and the thought of getting into a swimming suit gives me the cold sweats I'm freaking out as my self esteem is at an all time low. You always rock everyoutfit and I'm so envivious of how you seem to radiate confidence, I love it! 🤞🏻🤞🏻", "judayone": "Wow. I’ve always struggled with my shape. A true apple well actually more a cute barrel on thin legs. So I’d love help to know what suits me best. I’ve got good breasts big tummy and good legs and bit older than most I’ve the gorgeous women like your self Danielle, want to look gorgeous and confident like you hun. I’m a kiwi living here and love marks and spencer. I need help just to get good jeans. Yes thats it for me Jeans jeans Help!!!", "ted_and_mum_": "Hey @daniellevanier @marksandspencerfashionpr. I don’t have an event or anything special planned I would just like to feel myself again,be able to step out and feel pretty so anything that glams up my school run,food shop or working would be fab!! Can’t wait to see the results of the Comp and good luck everyone 😊xx", "therealcherieb": "I wish I could do this! But I couldnt go to London! I would just like to hang out and try on clothes. Maybe try mixing prints?!", "morfio101": "Im struggling to transition from my 20s and 30s dress sense!! Also as ive put on a bit of weight so i live in tshirts and trackies. Make me fun and funky for the love of all things fashion!!!", "jo_s_smith": "I’d love to have the style and confidence to celebrate my boobs!!! After all I grew them myself 😂 I’m morphing into a muddled and middled aged woman’s body and hiding my boobs makes me look grumpy and frumpy. Big love from Devon 💕", "hopegostelow": "I find my self only ever wearing jeans and a T! I’d love to wear something more exciting!", "suzycue70": "Hi danielle...I'm addicted to following you and you have slowly instilled so much passion in me to accept that I will never win slimmer of the year.!!..having lost my mum and best friend in as quick as 9 weeks I am now without my personal shopper as she was my guide with being proud of who I am....curved and cuddly! I've not managed to buy an outfit since that works for me and having just found out that in 7 weeks my dear brother is taking me on a dream holiday to canary islands ( mum was my holiday buddy for years) it is my first foreign holiday without her and I want to rock them shores! I'm struggling to be confident to find and select an outfit that's not just a baggy dress...or to wear a swim outfit without a tee shirt over it!🙄🙄...your Italy shots were amazing and you looked beautiful and soooo passionate to embrace your \"you\". I would love to be given that special understanding and guidance to feel happy with me again....and to post amazing pics amongst my holiday snaps that are of me....not of buildings and sea! Would be a true lift and dream to meet you...and be given that one special outfit that sings my curvy personality.😍😍...keep up the amazing passion to your followers babes. Xxx", "harriet1380": "What a lovely competition. I would love some styling help. My body has had a bit of a rollercoaster recently; I lost almost 10 stone very quickly to be eligible for NHS fertility treatment but got pregnant just before it started (yay). I know have a super gorgeous boy (turning 1 on the 9th September) but I put all my weight back on during pregnancy and after. I'm now completely out of touch with my body and personal style. I'd love an outfit (that I can breastfeed in) for my boys naming ceremony/1st birthday in mid September. Xxx", "hannahla_la": "I’m a single mum And working hard to build a career in NPD. Work keep sending me to presentations at head office I want to look fashion ward and smart on a budget. How do I build a capsule work wardrobe & maybe turn some pieces from work to date? (hopefully)", "lucie8998": "@daniellevanier Please style me!! I'm your typical fat girl wearing black clothes and hiding in jeans forever!!! Need to embrace my look as it's not going to be changing! Seen as the diets keep getting thrown out the window! Plus we can drink Aperols!! X", "clairyfairyt": "I'd love to wear trousers that aren't jeans!!!! I am so over denim but they are my go to for everything! Xx", "i_am_v_br": "I have a black-tie destination wedding to go and I am not loving the options I found in my size (14/16). I am excited about the event location (it’s in Puglia, Italy!) but I never feel great in “occasion wear”... Help!", "mags2712": "I would love some help with choosing an outfit for a wedding I am going to. I always struggle with dresses due to my height- I am short at 5ft 2, maybe 5ft 1.5 but who is counting! And also being top heavy does not help to get the right fit overall! It will be amazing to win this!", "samcgrorey": "I’d love to know how to boss office chic! I want to be fun and quirky in the office, at the moment I feel really boring and wear the same old dark colours and kind of clothes constantly xxx", "kellouhar\nVerified": "Verified", "lind.aphillips": "I struggle with putting together smart and more importantly comfortable work outfits that aren’t dull and boring!", "dionne_helene": "I want to be able to wear a dress with sneakers and not worry about my bingo wings basically.", "jess1a": "Heading to the USA for a two week holiday and really want to look fashion forward but comfortable. Live in dresses and really love jumpsuits and trouser but don't feel comfortable and confident to wear them.. Hope you can help @daniellevanier and @marksandspencerfashionpr ❤️❤️❤️❤️❤️❤️", "cfhutchy": "I would love to win this as I just gave birth on Sunday and really struggling to know what outfits I can wear that will@suit and flatter my new post partum body@shape!", "kellymerrick90": "Love this ❤️❤️❤️ starting a new job after 12 years in the same one. What to wear on day one??? 😍", "kathuband": "Im pregnant (baby due in october) and i am hot/cold/hot all the time. Help with layers for while the weather is changable and i am changing size would be amazing. Thank you 😊", "cindersworld": "Big boobs, so I look sassy and classy and not frumpy and dumpy please 👍🏼", "emcat12": "How do I style a big tummy? The sort of tummy...i can't see my fanny tummy 😂", "ruthieboob": "I need help trying to wear tighter fitting dresses and skirts and being comfortable showing my VBO!", "r.i.davies2": "Love your style & the way you make everything look so effortless and chic. The fact you are wearing fashion by M&S is a plus. For me as a mature plus size woman it would be confidence to change the necklines that I wear. All the body positivity that I see and that is endorsed appears to be coming from the younger woman .", "laujay1984": "Need help with jumpsuits im 5’9 so some jump suits feel and look like there cutting me in 2 in certain places....... please help as I don’t want a camel toe", "claireedickson": "I turned 30 this year and I have no idea how to dress. My wardrobe consists of mid-length polyester dresses and leggings. I feel embarrassed going into work each day as I have no idea of the latest styles or fashion. I love your style and this page makes feel a whole lot of positive about my body .....I just wish I knew how to dress it.", "ms.statenplease": "I would love to celebrate my waist more and feel comfortable with it but i never know how to and be a professional!!!!", "gemmalc83": "I've got a holiday coming up and I would love some guidance on swimwear and cover ups as I'm very conscious on of arms and mummy tummy 🤞🤞🤞", "katie_c1983": "I've been working on my self confidence and building my career, but I'm always the biggest in the boardroom and not many fashion outlets stock boardroom staples for curvy girls. At 34 years old I end up looking frumpy - or like im off to a wedding! I'd love to know how to look fresh, vibrant and smart for work. I suppose I'm looking for Power Style guidance! Would love to meet you and the team xx", "deedeesmithy": "What's new this season to transition from summer to autumn so I can stay on te", "iced_jems_": "I’m struggling in my transition from my 20s - 30s. I was much more insecure in my 20’s so really went for a full in vintage look as a bit of a costume really, but as my confidence has grown in my 30s I want to experiment and try more edgy looks whilst still looking like me. Not someone who is going to a fancy dress party. I don’t really know where to start. Plus I’m like 5ft nothing ha ha Please help 🤷🏻‍♀️😘", "rebeccaandherboys": "@daniellevanier This is me to a tee I’m 38 two kids and I’ve totally lost my way and it’s our 10th wedding anniversary soon and I’d love to feel like me rather than mummy when we go away for a coupe of nights chid free", "maisywhipp": "This would be an amazing opportunity! I’m currently studying a degree in comedy and with this have started performing stand up! I’ve recently performed at the Edinburgh Fringe festival which was amazing and from their I’ve booked a few more gigs that are coming up in September! As I’m still new to it I’m still trying to decide on my style, how I want to look and come across to an audience! The only thing I do know is I want it to be powerful and with a bit of a statement. But I would love to have your help in deciding on my outfit! Some of my fave bits of clothing have come from M&S in the past so this would be perfect!💖💖 p.s LOVE this look 😍🙌🏻", "hjk2242_": "What an amazing competition you always look so amazing. I need help with a work wardrobe that is smart and practical. I teach nursery children with special educational needs and disabilities but still want something stylish and fun that reflects me. I don’t want to confirm to a uniform of leggings and t-shirts as I need to attend meetings and support children and families. Any and all ideas welcome x", "loiswynh": "My hips are SO hard to style. I love midi/maxi skirts but can never style them as I’m always so self conscious about my hips. I’ve recently become very body positive and thats due to amaaaaaazing influencers like yourself and @calliethorpe 💕 both of your styles are just complete inspirations but it doesnt matter how much i try, i can never get myself to rock the midi/maxi skirt! X", "alisonhoward_": "💜 this outfit!! I would really like to wear more skirts and would love to have a statement skirt in my wardrobe that I could style a few outfits around but don’t have a clue where to start! I love your style and the latest @marksandspencerfashionpr pieces are fab, couldn’t think of anything more exciting than this! 😍", "charbum1011": "Dreaded first date 😬😬😬", "sammykay92": "OMG I Would Love To Win This!... Unfortunately Traveling That Way So Short Notice Wouldn’t Be Possible 😩😩😩 I Just Love You & Your Inspiration Tho.... Good Luck Everyone! 💕💁🏻‍♀️ xxx", "wholelottashaz": "Hi Dani! My query is: What on earth should I wear to an interview? I find it is such a fine line between looking smart and not looking like I should have been a guest at the Royal Wedding! I also find it challenging to dress as a ‘younger professional’ - particularly as a plus-size gal. Would love to see what you could put together! 💕", "mel_jeribe": "I’ve had a bit of a self image crisis recently if I’m honest. But I’ve got a new job role and could really do with looking a bit more like a competent grown up! 🤪 I could do with some help ditching the trainers and jeans and looking more “don’t worry I can manage this crisis, I brought my own power point” ish. I’m sure that’s a thing!!", "lilycainstudio": "Style Query: Necklines! I have trouble with necklines and proportion. I’m 5’11 and kinda Apple/heart shaped. But I am tall!! Having a great neckline is key! I don’t it too low so my boobs are literally attacking people but at the same time, I don’t want to look like I have a high neckline either (it makes the girls 🌝🌝 look bigger). What tricks or styling tips do you have?", "lidjarb": "I would love a staple dress that I can wear over and over again in the transitional period between summer and winter, I have had some in the past but I seem to have worn them to death, I love a midi and optional extras that have something about them but have struggled to find ‘the one’ recently! 🌻", "magentawillow": "I have the dreaded apple shape but am busty too. How can I find a daily casual look that isn't frumpy and doesn't make me look pregnant, when my belly actually sticks out further than my boobs! 😂🤔🍏", "sianmcdevitt": "I absolutely adore you! And would love to spend the day eating Percy pigs and you making me look pretty in clothes that I would never wear...alot of my clothing is black...and I wanna jazz it up a bit I know Its SO common for plus size girls to wear black and I don't wanna be one of them...I wanna make heads turn and I walk about! So! Please give me the chance to come and hang out with you for the day it would mean the world to me! 💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗🙋🏼‍♀️🙋🏼‍♀️@daniellevanier", "lushcious_laura_life": "What a lovely competition x my style query is that it’s my 35th birthday next Wednesday (29th) and I would love advice on a fantastic outfit to make myself feel special on the day and to match my age xx", "jeni280": "Would love help with my work wardrobe! I work in a corporate office so have to look smart, but would like to incorporate colour and fun into my work outfits!", "emsby_by_the_water": "I need to not wear leggings! Plz help x", "missjoyski": "You look amazing 😍😍 I’m struggling with finding professional outfits. I’m about to start my teacher training and am worried I’ll just be stuck in black trousers and a plain top. I’d love to learn how to break some colour in there, look current but still professional 🙈", "sa.rah4919": "Absolutely stunning and I love the dress 😍😍 @daniellevanier xxx", "j9yb": "What’s the biggest size clothing M & S do?", "katieesberger": "Wow!! What a fantastic giveaway!! I would like some help being on trend. As a mid 30’s woman I feel stuck in a rut and want to be on trend again, rather than dressing in the mumsy style that I seem to have fallen into! Xx", "lori1992_": "Well with Christmas coming up and all the cute things that come with ie Christmas markets I’d love to rock a skirt with boots and nice coat but not sure what goes! And tbh id just love to hang about with you and get loads of laughs and maybe grab an aperol! Ha! Xo", "msmeandonlyme": "I cannot for the likes of me learn how to style my body shape !!!! I need your help!! Most times I feel confident in what I’m wearing but I feel like I could really do a lot better!!! Doesn’t help that I can’t decide what body shape I am either lol Help @daniellevanier 😍😍", "meganowens4109": "Dam I live in Australia...", "ashleylouisejames\nVerified": "Verified", "graceyybaird": "This is amazing! I have been trying for my entire adult life to wear wide leg pants without looking frumpy/getting a frontal wedgie situation/still looking fashionable, it's especially hard since playing rugby means I have large, muscly thighs, that stand out in a trouser, please help!", "todays_forecast": "I'd like a smart casual outfit, something for the everyday. I'm really hung up on my midriff & hate how much bigger my boobs are since giving birth last year so some advice on how to dress my new shape would be great ✌️", "lulugeorgiou": "I adore you and your Instagram (big sofa chat fan right here). I had a beautiful baby boy 12 weeks ago and am now not feeling entirely confident with me or my body. I know I have grown a baby and have to give myself some slack, but I have gone up 2 dress sizes and have very few things that now fit. I also have a friends wedding coming up soon and would love some advice on how to style my new shape and give me that bit of confidence back. Thank you so much for running this competition!! Xx", "itydarling": "Best way to transition from summer to autumn style? I’m stuck in a rut at the moment and would just love some tips!", "nthabymetsi": "Dress that fit both my butt and body without looking saggy at one point.", "emer_a": "This is two queries rather than one but I am short and round and I want to know a) how to wear midi skirts/dresses without getting round and b) I want to stop hiding my tummy but instead show it off ie by wearing more form-fitting clothes and I’d love for you to help me do it in a way that looks good!!", "julideozer": "It's my birthday soon and I'd like to wear a dress or jumpsuit but can't find a style that suits me...", "siadw": "I’m not too bothered about the clothes, I just want to have a fun day! 😂 I guess my question would be that I’d love to be able to find more elegant outfits. I’m pretty much the opposite of elegant and when I see people looking so chic at work I can’t work out how to be too! I’m so fussy (about materials and I don’t wear trousers/shorts) so I need a right kick to get out of my comfort zone!", "sophiawho": "I would LIVE for the chance to be styled by you!!! M&S is my absolute obsession right now too... I've got a wedding in France in September that I'm singing at and I cannot for the LIFE of me find an outfit that says both 'best dressed guest' AND 'non chalent fabulosity' so would love some help... god love YA! Soph x", "92h.a.n.i": "As a plus size girl I always feel conscious about tucking clothes into jeans or wearing crop tops with jeans or anything tucked in which will the show my belly shape etc. Because of this I always wear flowy long tops over things or skater skirts. Any suggestions on how to feel and look good styling tucked in tops etc would be amazing. I love your confidence and any help would be a bonus xxx", "angellinarowe": "I’ve put on 3 stone in the last year or so and have tried (failed) at every diet under the sun. I know I’ve still got curves but I’m constantly hiding my pear shaped hips and bum in shapeless skirts/dresses which I’m sure isn’t doing myself any favours, I would love to feel confident to wear something more age appropriate, I’m 26 and currently dressing like my mum to hide the body I can’t understand how to dress. I have a huge family holiday in 3 weeks and the thought of a whole week not being able to hide myself is honestly feeling me with fear. I would love to learn some basics on how to compliment my shape and ultimately look forward to this upcoming vacation and feel confident in my everyday.", "balfourallen": "Hello!! As mummy to my challenging disabled son fashion is my happy place but my body has changed beyond recognition over the last few years as a result of breast cancer, bilateral mastectomy and reconstructive surgery, then recently I have been diagnosed with Graves disease so have put on huge amounts of weight. I still LOVE clothes and want them to reflect my personality but don't know how to embrace and flatter my new shape. I really don't want to give into the voice in my head which is telling me to wear dull figure concealing tents. I need your help please!!", "lipstick_and_flick": "Such an incredible opportunity! I think my biggest struggle is with trousers. I hate my legs with a passion and only wear skinny jeans as an easy option when I’m not working. At work, however, I’d love to be able to wear trousers that are stylish, comfortable and actually make me look half decent. 🤞🏻😁", "oliviajlongglover": "Wedding Dress?? Other than this being my current struggle in life. I really lack confidence with the tops of my arms. I want to be able to wear a short sleeved dress without having to put a cardigan over the top yet feel comfortable and not self conscious. Would love your help and advice. xx", "sarah_victoria_griggs_": "Jesus Christ super star - dreams can come true. I’m + size & just feel like shit in everything I wear. Would love help finding what suits me best🤞🏻🤞🏻🤞🏻", "susankeirn1978": "Not only do I follow you for your style tips but also your accent. I would LOVE to ditch my family and have you teach me the ropes in styling. I currently have a mom vibe going on. I’m turning 40 this year and NEED assistance!! Please Help me!! 😘", "ladylou30": "I just want a bit of extra help to figure out how to look good in the last year of my 30s and be confident in who I am and what I want to wear into my 40s to feel my best x", "carathunderthighs": "I can’t wear shirts!! I would love some advice on getting a style with a cute button up, collared shirt. Also non-jeans trousers, I would love to venture away from my high waisted stretchy skinny jeans. Thanks Xxxxx p.s. pick me! 🙋‍♀️🙋‍♀️🙋‍♀️", "lilcashley": "Still not over the new hair color", "theepicnina": "I would love to wear skirts! I love how they look on other women of similar size to me, but I always think they look stupid on me!! Am I styling them wrong or choosing the wrong skirt for my body shape?", "laurajwasley": "I love funky trousers - cullottes, printed ones, cool coloured ones but never know how to style them, like AT ALL (same applies for most of my wardrobe really 😂) I just need some of your guidance please 😂 also, love you, your sofa chats and all your pics and posts, you are someone I really admire and look up too! Keep doing you my lovely ♥", "jessica_noone": "Love a killer work outfit that focuses on my legs!", "oobilah": "Breastfeeding! I used to live in dresses but now they're off the menu and I don't know what to wear! Finding feeding friendly clothing is really hard", "s.t.e.p.h._x": "Wow! Just wow..... you look so stylish! I’m a size 18 and would just love to meet up with my sister in law and husband’s two young, trendy cousins and not feel like the frumpy one.... I’d love an edgy, put together look with an air of ‘just something I threw on, love!’. I’d love to feel pretty. x", "ch_rlotteg": "Omg!!! I am such a huge fan of yours, I would love to be styled (and desperately need it!!!) for a friends wedding next month, I’m already so stressed about it because my height + boobs make everything so tricky. You’re the best, I have been following you for so long, thanks forever for making my life more joyful xxx", "thea.brain": "Hello! So over the last couple of years I have gained a lot of weight and am now a size 22. In light of this, I’ve had to start from scratch with my wardrobe and try and work out what suits my new body size and shape. I am broadly happy with my wardrobe for work, it contains fairly flattering and reasonably stylish pieces: I have a jumpsuit that I like, cool trousers and cardis etc. However, when I’m out of work, I’m lost! I literally schleb about in old leggings and oversized jumpers. I’d really like to wear jeans and nice tops and generally start to cultivate a cool casual aesthetic but I really need some guidance. Please, please help!", "abihulatt": "Oh hey Dani 🙋🏻 So I'm a primary school teacher who formally loved wearing lots of print and colour but am stuck in a clothes/style rut! I would love to try a new look under the guidance of someone fabulous like YOU! Also, I love m&s...a good chin wag and Percy pigs! X", "r_obina": "Back to work after 14 years at home raising 4 beautiful children. Need a work look that fits a dress code that, doesn't make me feel 'old' and looks on trend without looking like I'm trying too hard!", "katie77x": "Love this competition how exciting! I would love help knowing how to wear a jumpsuit if that’s how you describe them, I always feel like they never show off my curves and make me look slightly frumpy as I carry weight around my tummy!! Help is definitely needed! Ps you always looking smoking hot Danny love ya xxxx", "ormakapay": "I’ve always wanted to be able to rock a super tailored look (like a suit) but due to my height and curves I’m not sure where to start and would love some help 😅", "nailamaia": "This dress is amazing! I need help finding decent bras that fit me properly!", "rose30alexander": "I have my mother in laws funeral in September, and I would love to feel confident enough to wear something other than leggings and over sized tunics! My dream is to wear a jumpsuit or skirt and top, with out someone asking when my baby is due 🙈🙄 I am not embarrassed about my size, but I am embarrassed that I don’t know how to dress it! I would love your help, it would make my year! Xx", "itsamiedev": "Well I mean who wouldn’t want to hang with you for the day! Absolutely fabulous personality and sick style sense!!!!👌🏻💕", "nataliemeansnice\nVerified": "Verified", "marvell0usmarie": "I have a wedding to go to in Santorini, and the dress I bought has a broken zip. What do I wear instead? I want to dress up but wear something outside of the traditional ‘wedding abroad’ box - help me Danie 🎀", "rosieposieohlordy": "I need help in figuring out what is the best dress for a noon wedding with an evening reception..", "bethy_wolford": "I’ve just got a promotion at work and I need to look more smart casual and I’m struggling to find the balance...how do you know you’re not crossing into either boundary? HELP!", "town.called.alice": "Hi Dani, have been following you for a while now and I find that you are super relatable... and your fashion sense is unreal! I have arthritis, so whenever you talk about having down days with your illness and not being able to get out of bed, I know how that feels! So, the look I would like you to put together for me is a first day at a new school look! I’m a teacher, and I’m starting a new school in September. I started teaching 8 years ago, and stayed at one school for all that time, so I want to make a good impression at my new school. In addition to just moving school, my new role is a leadership role and I would love an outfit that is smart enough to look like a leader, but casual enough to sit on the floor with the kids! I’m really hoping you can give me some good tips for balancing the smart/casual look and am hoping an outfit from @marksandspencer will give me the little confidence boost I need to strut in to school on my first day! Thanks!", "contact_ejl": "Navigating a dress code at work I call “business quirky”. Retaining a fun, creative side with a business appropriate look. And, as an events manager, comfortable, yet funky footwear. The dream!", "sarahig77": "I need some help with giving myself a total make over. X", "abi_waters_7": "I’d love help with finding a go-to autumn outfit that will get my out of my usual jeans and jumper - need to get out of a clothing rut! Xxx", "mrs__hssmith": "How do you emphasise a small waist, and hide a larger tummy... I like my silhouette but struggle with my mid section AND prefer to keep my arms covered up. So the ‘eBay’ dress everyone is rocking this year I’d have to throw a cardigan over 🤦🏻‍♀️", "ashleamay_": "I have put on a lot of weight and although I have learnt to be a lot more accepting and more comfortable of my size I have no idea how to dress and never feel confident in my outfits as much as I did when I was slimmer. I need serious help on what to wear and how to style them! 💕", "acurvygirlsworld": "I’m coming to London next month to visit my best friend. She is always on point with her outfits and looks amazing. She wants to take me out to a drag brunch and I have noooooo idea what to wear? Please please help 💖🦄💖", "taylamayisabellex": "I’m training to be a teacher and I have no idea what to wear!? I don’t want to emphasis my boobs but I also have tattoos I’d like to cover up but still look fashionable 🤔 I don’t even know where to start - especially when I don’t want to look frumpy! Haha", "close_jk": "This would be amazing! You are gorgeous and I love your style! It's been a long long time since I felt sexy and confident while going out. I'm (still) single (36yrs) and frankly a bit daunted by the whole dating scene. I'd rather just 'hide' and that is showing in the way I dress. So if you could help me feel sexy and confident wearing a fancy dress/outfit, that would be amazing! So I can get out there and don't feel afraid to be seen.", "j_will_do_": "So this is a tough one! Other than the fact that I would love to spend the day in London eating Percy pigs and drinking aperol 🍊🍾, I do have some very personal tricky conversations that I need to have, sooner rather than later, so that I can get out into the big beautiful world and be me and be the best most confident version of me! It will be sore and wonderful all at the same time & it would be awesome to rock up looking like the me I want to be! 💁🏻‍♀️🦄👟🌈👖🗣😘", "emmalois88": "Hi Dani, I’m loving jumpsuits/trousers but I’ve only found one that works for me. I’d like some smart(ish) but funky ones for starting back at work (I’m a teacher) in September but struggle to get them to fit. I’d love to wear something other than skirts/dresses and tights. Marks and Spencer’s has been part of my shopping life since I can remember so would love the opportunity to be styled by your fabulous self and such a great shop. Thanks! Xx", "foxyroxie66": "Black trousers are my issue as well as jeans, they either fit on the bum and then bag at the waist or vice versa", "myfhollers": "I’m a teacher and I’m always struggling to find comfy yet trendy work outfits that are different from the crowd 👍🏻 love you lotsssss xxx", "tazmeena": "I would love to wear cute little dresses and jackets but always end up looking pregnant or butch..... helpppppp meeeeeeee", "thisisldizzle": "That dress !!!", "chanellover86": "I’ve put on even more weight since being in a relationship being content u know how it is lol I’ve lost my spunk my spark I need it back and I don’t know what wear again used love sequins dresses help help help help I feel like losing me", "jrb1990": "Hiiii @daniellevanier my fashion query is being a plus size women I’d love to feel confident in wearing high waisted trousers/ skirts.... I see other women looking so sexy and confident in them, I just wouldn’t know where to start? I have spend hundreds of pounds on them but too scared to put them on. I’m sure you being a style queen will be able to advise! 💕💕💕jess xx", "vikkicam": "I'd like to find good jeans or trousers I can wear for everyday casual wear. I never get jeans that fit properly and i wear black trousers to work so end up just sticking to leggings and I'm bored of it!!", "rachel_b26": "I had a friends wedding earlier this year and didn’t feel comfortable in front of everyone in the outfit I wore. Now, in a couple of week I have a christening to go to where all the same people from the wedding will be. I want to look and feel confident and show them what I’ve got. Love you and your style. X", "katedevonlove": "I'd just like to look less of mess to be completely honest with you. 🤷🏼‍♀️ bored of looking like a sack of potatoes. Honestly always wins! 🙈😂", "jterry62": "Just can’t do trousers at the moment - plus size, over 50 and enjoy fashion...", "peski_": "My query is how to mix trend led statement items into a basic everyday capsule wardrobe and rock it please! 🙏", "northwestmonkey87": "I would love to know how to modernise a work outfit for in the office? I am a bit too casual at the moment!", "stcyrmm": "I have recently been accepted into a Primary School leadership course. However, to do this course I have to complete it in my own time so evenings and weekends. I am more than happy to do this as I love my job! However, my induction full day conference is on the same day I have an evening wedding invite! I would love to know how to pull an outfit that is smart for the conference but then can go straight to the wedding reception afterwards. I am hopeless with accessorising to help change the vibe of an outfit and would love some help!", "neeruslifestyle": "Want to wear dresses have changed shape in the last few years due to a slip disc so I’m much more top heavy now and want to know how to style myself", "chloerachelmcclellan": "@daniellevanier This would be a total dream! I am so lucky to be heading to Sri Lanka on the 1st Sept, (extremely well deserved holiday, if I do say so myself) and I am searching for some classic, cool, and fun pieces that will work both in the Sri Lanka heat and layered up for an unpredictable London Autumn. Prior to a holiday, it's time for the usual, body crisis, which I am desperately resisting, but any help would be so greatly appreciated! In need of some jungle, beach and Tottenham Court Road chic!", "jazzmynejay\nVerified": "Verified", "saraknight1986": "@daniellevanier i admire your pictures every day! I would love to have more confidence in my size, i try to squeeze into smaller sizes when really they are just unflattering and i need to come to the realisation that i can look beautiful in colour and something i would usually look at and say no way! I have recently started a new job so would love some smart work wear to really show confidence! I also have a nightmare when it comes to xmas party time! A show stopper outfit is needed! Help me!!!!", "the.life.of.rini": "Where do I start! I love jumpsuits but with being 5’4 I’ve never really tried or worn one! Also with have a bum, thighs and stomach I’d like abit more confidence in dresses xx", "amycourtney": "I’m off to Vegas in a couple of months to get married!!! Spent so much time organising everything and getting my dress etc, that I don’t really have any outfits ready for the other days! Going for a week. It’s going to be hot, but want to look nice and put together and funky! Some ideas of pieces maybe I can mix and match and wear casually during the day but then dress up for evening celebrations! 👏🏼🥂😌🙌🏻", "catherinepowen": "Ermergherd! This is legit a dream competition for me! I ❤️ M&S having grown up in Canada with British parents and grandparents so having all my knickers posted to me from Sparks! My style dilemma/query would mostly be how to wear colour and current trends without fear and confusion. I am heading to Canada in September to meet my baby nephew for the first time and would love to win this bad boy to help kickstart my campaign as the cool aunt from England. 😘❤️", "laura.k.nagel": "Oooo I’d love a new outfit for job interviews! Or help finding the perfect jumpsuit, hello. Anything to celebrate my curves, really. ❤️❤️", "lipsticklori": "OMG... I would love this!!! Sadly, I have a work commitment that I can't get out of on Tuesday afternoon 😢 I will instead dream about you finding me some trousers that are comfy and that I don't hate. Good luck to everyone else!", "erinleighandco": "I don’t know how to dress my post baby body - I want to wear classic pieces that I can mix and match sort of capsule style as I’m on more of a budget now but don’t know where to start! x", "just.catherineh": "Bomber jackets ( like 1950s high school style) there is a beaut one on Joanie at the moment which I want / need but what will it go with for autumn? Xx", "kirstyleanneuk": "I absolutely LIVE in dresses and I find it really hard to mix it up and wear trousers. Okay so I wear jeans occasionally, but I’m really not sure how to style them so I end up in just jeans and t shirt 99% of the time. 🤷🏼‍♀️🤷🏼‍♀️", "appleshapedheart": "Woo hoo. Would love your help: I can't dress for my shape: always end up looking like candy floss and I'm so shit with footwear... So even when I, sort of, put a look together I never know what shoes to wear with if and it all turns to crap!!! Help me!!!!? Xx", "christinacpearce": "Hey Dani big fan, just wondering how to find the right pair of trousers when I have straight hips and a tummy. I always struggle", "ruthbuds": "I need stylish simple outfits for work that I feel comfortable and confident in. I work with adolescent females who have various issues and I need to show them through example that it's okay to not look the same as every else but that we all deserve to look our best. X", "notsomumsyme": "@daniellevanier when I became a Mum 9 years ago I lost my style, I would love to find the right clothes for my body shape now and be a less frumpy mummy and be a more stylish 34 year old mummy ❤️", "madphilomena": "Hello lovely x I think where I need help is that I get stuck in safe items - which I’ve worn for decades - when I go shopping I feel like there’s inspiration for girls in their 20’s and looks for older ladies, but I’m not sure where I belong when I’m approaching 40. I love trends and style but don’t want to look silly - it’s the balance between too young and too staid! Totally up for colour, print, pattern! Help me! Show me - me - through your eyes 😊 I do have work to do on Tuesday but to hell with it, one life, this sounds fun and useful and if you pick me I’ll be there ! 😀", "melfr8ncis": "@daniellevanier I’m about to start a new job and desperately need help on a plus size look to give me confidence and feel stylish in my new career.This 46 year old Mum needs help!😘😘", "ooginboogin": "Dani! I’d love your help with trousers. Never wear them and haven’t done so for about 15 years. I’ve seen so many lovely peg leg style trousers in the last few months in some amazing colours but I’m scared I’ll just be left feeling miserable trying them on. Would love your help! 💜", "lucymilbmusic": "Hi Danie! I am DESPERATE for a killer suit/anything tailored to wear at work and for meetings - help a girl out! 😻😘", "laurasstar": "I always hide my arms, but I hate adding a cardigan. I'd love help to find the perfect outfit, I also like to wear things that will slim my waist... But most of all... I would LOVE to mix patterns, and do accessories like you do! Your posts have already changed my confidence and my tastes... plus I haven't tried Aperol yet... who better to try it with!!?", "lizzydive": "Hi Dani! I'm such a huge, mega fan of yours and absolutely love your style!!! Thank you for offering such a fantastic opportunity! So exciting and brilliant! I've been invited to a friend's Wedding reception in September but it's with a twist. It's a mini-festival/Theatre/Cabaret extravaganza and I would LOVE to step right out of my comfort zone and be bold. I am a curvy size 18-20, large boobies, tum and bum. I either go for 1950's look for a wedding or a floaty number to hide the curves. I'd like to rock up in something fresh, funky and new. I always look through your posts and go: \"YAS QUEEN...AMAZONG!\" You experiment all the time and it's awesome! Your expertise would be greatly valued x 1 million! And Percy pigs. Scrummydiddilyumbum! Thank you so much! Keep doing what you're doing. X", "academictraveller": "I was offered my first academic position today (lecturer in criminology) and it is my first job in the UK! 😊 I want to be chic, stylish and powerful and start off strong. I moved here from Australia and gave away the majority of my clothes to friends. Please help me slay and start to get together a wardrobe for work!", "betheleanor_": "I live in black and need to add some colour into my life!!", "rashaai": "Would love to wear skirts but unsure what style suits me as I’m a pear 🍐 shape 😊", "jessicajaneshelley": "I’ve always been so under confident in myself and my body that I’ve not experimented with anything other than dark colours and shapeless styles and I’m soooo ready to learn how to inject colour and pattern into my wardrobe but it’s so overwhelming I have NO IDEA where to begin 😂 I’d love to learn a few styling basics and become a sassy fabulous lady like yourself 💃🏽", "ramblingmads": "I am a weird shape and I need help in finding clothes that flatter and pull the eye away from my unloved bits. Do you think you could help??", "tarfers83": "I had a baby last year, and have totally lost my way with style and fashion and generally seem to have no idea what to wear other than leggings, leggings and baggy t shirts to hide my new mum bod, particularly my tummy area. I'm heading back to uni to complete the final year, and think I need loose but smart clothing for my placement but also suitable for looking after my little girl in the evenings and over weekend, but no idea if thats right??!! I used to love colour, yellows, oranges, etc as they compliment my skin, but have just lost my way recently. HELP me knowledgeable one x", "yorkshirelibs": "I’m totally stuck in a style rut! I’m either in scrubs at work or jeans and a t shirt. Two of my besties are getting married next year and would love to feel my best! ❤️ ps you look amazing in this dress. I ordered and took it back as feel it didn’t suit me 😔 wish I’d kept it now!", "blooming_lovely17": "I’ve been sat trying to think of specific things where I feel I need help but all I really want is everyday kind of style, something easy & casual to wear on my school runs & something stylish to wear shopping. I really just love a nice tshirt and jeans but I always feel sloppy xx 🤔🤦🏻‍♀️", "hisdoryan": "Omg this sounds like my dream competition! I've put on a bit of weight this year due to ill health and none of my work clothes fit me any more. So I guess my query would be how do I dress my new body shape for work?", "clareesme": "I’d like to understand how I can wear less feminine clothes and still love my look. I’m pretty curvy so I tend towards girly dresses and skirts but I’d love to rock an androgynous look more often!", "sarahbrooks483": "My problem area is my thighs, I don’t feel confident in skirts and my go to workwear is wide leg high waist trousers but just feel like I need a good shake up style wise. I do tend to get stuck in a rut outside of work too and have go to jeans and blazer combos for heading out and about. I’m 5’11 too so struggle to find tops and dresses that don’t come up too short...I’d love for you to help a girl out to feel sassy again xx", "gracieliciouslou": "It’s my cousins wedding at the end of September and I recently lost two stone and would like to celebrate by wearing something exciting to the wedding that I wouldn’t normally wear, try a new look out and not just wear a traditional style wedding guest dress!", "katy_lily_": "This was be an amazing opportunity! I work in a school and would like a chance to find clothes that are smart but also able to show off my figure!", "georgie_o77": "Oooh how l wish to win this!! Ever since my size changed during/after pregnancy l struggle on a daily basis with finding clothes to fit me and look good. I don’t know what to wear anymore, what fits me properly and where to find it. I haven’t been out properly in nearly 4 years because of this... 😕 I always love your outfits, l go to the shops you tag in your pictures and then l freeze looking through 😞 l’d love to have a nice outfit to go out in and feel like a queen in it. One can only dream 💖", "hollachel": "Would love a new look#dani to the rescue#get instyle#never to late#anything goes#all shapes and sizes#strut my stuff", "fionairvi": "How exciting! For me, my style query would be smart but stylish for work. I have struggled hugely with my image for as long as I can remember, always stood out for being larger than everyone else. I work in HR, and without wanting to stereotype I am sure we can all imagine how beautiful, slim and stylish everyone is. I would like to find my place in the office, not trying to be a size 8 but dressing well for my size and being stylish in my own right. I love your confidence and I know I could learn an awful lot from you! I hope whoever wins has a fabulous time ☺️ xx", "rocksamiiee": "My 18th birthday is coming up soon and I’d love to find an outfit to feel really confident and special in on my birthday, an outfit I can remember. Something to show off my waist and hips:) x", "yindaabee": "I have nothing to wear for my birthday next month! I’ve gained weight due to steroid treatment for Lupus and I’m finding it hard to dress for my new shape. I find it hard to put stylish outfits together. (If I do it’s by accident.) I’m a mismatched I’m kinda girl at the moment. I like to be comfortable (I’m in pjs more than going out clothes) I like pockets and I’m not afraid of bright colours. Or leopard print. Love leopard print. Fab competition! Thank you.", "kirstyr2013": "I can never find a good look to match my shape for work! I’m 5’1, huge boobs & a bum but a small(ish) waist! Everything I love doesn’t suit me because I’m too small, or doesn’t fit my boobs properly, or fits my boobs then hangs round my waist 😫!! Xx", "lu.___.____": "I'm a nurse so live in a uniform and hair up at work. When I'm out of work I feel like I have the uniform of checked shirt, skinny jeans and vans! I wanna expand my wardrobe a bit more and be more adventurous! ♥️", "pixiegirlpaula": "I'm feeling overweight, old with a bad dyed ginger Bob and I dress like a 5 year old boy. I'm 45 and live in vans, baggy jeans and dinosaur t-shirts carrying a backpack! Jewellery is usually silver skulls? What could I wear which doesn't look \"try to hard\" with a touch of retro, funkiness and is ladylike? 🎒👓👟💀", "gemmamelody": "I need help. Full stop. I’m retraining as a beautician. I’ve worked in childcare for years and feel with the right input I may have a shred of confidence. My probs are my bum- hate it and it feels like everyone has a nice one except me. And my tummy - hanging and flabby 😬 I’m 32 and my mum always said her 30s were her prime. I wanna feel that!! Thank you, Gemma", "theothergirlmooney": "Just turned 40, Work in a uniform so outside of work what do I wear? Mum uniform for school drop off and clubs? What suits my changed body and my lack of confidence in going out clothes? I’m stuck in a wardrobe rut 😱😱😱", "amyam_87": "This is just amazing! I just want to be stylish. I love shopping, clothes and fashion but end up stuck in a rut all the time. My query is, where do I start?! How do I find my style! Help me out wonder woman! ♥️💛 xx", "hoddy3112": "Oh wow - this is such a great comp! I would love the chance to get some advice on what to wear! I have no idea what suits me or what is trendy... I'm in the middle age mum trap. I've spent years in jeans, t shirts and converses.... no style no shape and no idea😟 I need help! I love following all the stylish women on insta and can only dream of looking that 'with it' 😂", "georgie_flanagan": "Amazing! I would love to know the best styles to flatter my figure since having my 2 kids. Clothes sit on me different now and I want to feel confident again ❤️ love that dress you’re wearing too!", "shaaznotshaz": "Hi Danielle, I’m on maternity leave with my second baby and am due to go back to work in two months. I’ve suffered from postnatal depression this time around and even though I’m well in the road to recovery my confidence has taken a knocking and I’m not sure what suits me or what I even like to wear now. I’d love some guidance on clothes that I can style up and still be comfortable and not look like my appearance is an afterthought. 🙏🏽", "tashabee86": "Omg YES Danie! So I work in retail and as a plus size gal I feel I’m not getting as excited by trends as I should be as I feel that certain things won’t suit me. Like I would LOVE to be able to pull off paper bag waist trousers but I’m terrified, I’ve worn jeans or leggings for too long now! So basically, * how would you reignite a passion for dressing for your personality as a plus size woman?* xx", "sjkelly15": "I would love to have a super stylish interview outfit, I always struggle with jackets as I think they make me look manly, but would love a sharp tailored look, and feel like a top notch lawyer or something! Also would be great to get some style advice 😉", "guinnyvere": "I would love help styling a pair of jeans and finding a nice pair of jeans for my body type! I would particularly love a casual \"mom jeans\" look style x", "sammiellen_": "Firstly YAAASSSSSSS!!! You are my ultimate style icon and that's not me just blowing smoke up your delightful behind but the truth! My style query is two fold, firstly I would love to incorporate white into my wardrobe but I have zero confidence in wearing it without looking like a complete heffa and my rolls showing 🙈.. my second would be being able to pull off office chic, in particularly a good power suit, I hate wearing officey trousers because I feel like no shape suits me so I don't always have the confidence I need when at work. Please work your magic with me 🙏♥️ xxx", "amychurch87": "Pretty much all I want is to feel confident enough in myself and what I am wearing to go without the cardigans that have been my constant companions for as long as I can remember! Please help! X", "tolotolo": "Hello! So I would love help with what to wear on holiday in the day! I can just never pull off feeling great, comfortable and confident and mostly feel like a hot sweaty mess!", "slb.ltu": "Genuine dream come true!! There are a lot of queries but it’s mainly to do with masking my bottom tyre...if you know, you know! I struggle with fitted trousers, jumpsuits, skirts as they all seem to just highlight the bottom part of my belly. It makes me super self conscious and means I always end up going for the same style...skinny jeans and an oversized tee...HELP 🙏🏼🙏🏼🙏🏼", "slimming_world_carolyn": "I’m a guest at a wedding in September. I haven’t seen most of the people who are going to be attending for 8+ years and I’ve put on quite a bit of weight during that time. I feel frumpy in pretty much everything and basically avoid shopping, so I’d love it if you could help me find something that I feel confident and attractive in for the event.", "soph92brown": "This competition is a great idea!! I’ve always stuck to skinny jeans but it would be great to have a more relaxed ‘mom’ style jean that flatter the tummy area. I would also love to wear colour!", "katiemundyyyyy": "Iv pretty much dressed the same since I was 17 and really want help with finding clothes that I feel comfortable in but give me a more grown up look! Like I love jumpsuits and think they look super 🔥🔥🔥 and classy but can never find one that fits my shape 😢 so I would love your help!", "tiggsybabes": "I've just turned 50 and don't know how to dress to go out now I'm older. I live in jeans, t-shirts and converse or boots at the weekends. I don't how to to glam it up a", "lima_giles": "Yes babes @daniellevanier basically we need to sofa chat and fibro chat !! All whilst you try to make me with my fatty boom boom ting going on ,look a little better !! I’m up for anything but would be good to get me back to being a bit dressier !! This would do more for me than you would ever know !! Thanks babes ! My acc is set to private but please don’t let this stop you !! 😘😘😘", "essveejay66": "Hi @daniellevanier what an amazing opportunity. However I don’t want to enter (you wouldn’t want a menopausal 50 something women on your hands). I just want to ask that you plead with the lovely peeps at M&S to have some of the items that you wear actually sized up to a 30/32. That dress you’re wearing stops at 24...it’s just so frustrating/maddening when that happens. Us bigger girls need some love too!! I know you’ll fight our corner Dani. Can’t wait to see the result of the competition- the winners will be so lucky xxx", "lottielaughter": "Hi Dani I’m looking for help with getting my work wardrobe together. I work in a large office and just want to go into meetings looking my best. I am slightly larger so just want to make a good impression though don’t really know where to start... would also be great to meet you!", "jdedm": "Since having my son two years ago I’ve put on 4 stone. I don’t know how to flatter/dress my new body. At the moment I’ve given up trying to loose weight as that is putting a strain on me mentally. I feel the best why forward is to learn to accept and work with the why I am at the moment. I’m struggling with my stomach most of all at the moment", "_emii.p_": "Omg this couldn't have come at a better time !! @daniellevanier I have a first date next week and I'm nervous af with no idea what to wear. It's been way too long since i wore a dress that fit my style so i need all the help i can get !! I need your style expertise💕☹ @marksandspencerfashionpr", "martacolacoo": "Absolutely stunning!! Love the bag and the dress!", "iamanitapowell": "Hi would love to fully understand how to dress and creating a more curvy hourglass like shape, while minimising my apple shape stomach. Also I have OK toned legs but I am over 40 and I want to know how to show off my legs age appropriately. Hope you can help.", "ellielou_curvesandall": "I love your style you always look so amazing. I'm a mom of 2 i have to do the school run and unless i have plans for that day I seem to feel a mess i want some nice autum styles but outfits that suit my age (32 october) instead of leggings shirts leggings jumpers jeans tshirt. I struggle to feel comfortable im always feelin as tho i look horrid. Please help i need a boost", "annastefanou": "I have an Australian wedding coming up and I would love to look lush. Also I would like to be able to clash my outfit fashionably and not be always so matchy matchy. Btw following you has been ground breaking for me. You’re the best xx", "_charlottebutcher": "Ah what an amazing competition! Actually squealed when I read that it was a chance to meet you and get your advice!! I would love to gain more advice on how to dress when my least favourite body part is around my tummy and so many styles don't seem to flatter it! I feel like my wardrobe has lots of great pieces but I need outfits that work well together! Lots of 💗 xxx", "_emmarobinson_": "This is fab!!! I’d love help with finding my own style again... since having my daughter 2 years ago I feel like I’ve proper lost my mojo... I know what styles I like but just can’t seem to get it totally right very often!! I absolutely adore your style and have such a passion for plus size fashion and flying the flag!! so this would be a lovely prize for me personally ♥️ xx", "kaddi_wendel": "Hey there from Germany 😊 I just gave birth to a baby boy 3,5 months ago and am now having troubles with my after baby body... I’ve always been plus size and never afraid to wear stylish things but I would love to feel sexy and confident again! Maybe you can help me surprise my man with a look for our „first date“ after having our lovely son?! I would really like to come over and spend the day with you 😉👍🏻", "jessiecrow": "hi dani, i need help with work appropriate clothes (for a smart casual office where i always feel too casual!) and in particular CULOTTES! i just dont know how to 'do' culottes! HELP! 😘😘😘", "melissa_teague": "How do you wear backless/low back jumpers when you can’t (Or don’t know how to) go braless with bigger boobies ? X", "_ohabigail": "Sadly I can’t enter as I’m not available on the 28t however I still have a sneaky style question 😊 I’m an apple shape (well more melon 😂) and would LOVE to wear dungarees but not sure I can get away with it? Drawing the eye too much to the middle? Busting out when sitting down?! Are there any i could wear?", "willma268": "I have big boobs and hug hips, nothing ever fits!!! What's your advice on the perfect go to outfit? I always end up buying the same things and looking frumpy 😭😭😭", "emmacall83": "I’m going to a wedding in October but I’ll have just got back off holiday, what can I wear that’s time of year appropriate but shows off my skin!!! I LOVE colour HELLPPPPP. Xx", "__katieprice": "I’d love to be able to figure out how to style more form fitting/‘sexy’ clothes. Every time I do it I just feel frumpy and silly. I have fairly big boobs for my height and I want to highlight them without feeling vulgar. I’m 20 years old and I just want to feel hot? I feel like I have to dress either like I’m 14 or 40 🤷🏻‍♀️", "katy_liz_white": "Since becoming a mum I’m stuck in a rut wearing supermarket clothes, buying stuff when it’s 25% off and finding that nothing really flatters anymore. I’d love the chance to be shown how to pimp this plus size bod from jeans and a nice top, to something more glam... I’m up for anything. 💁🏻‍♀️", "daniellerubykk": "Just had twins three weeks ago 🎉😍 but have completely lost my style been wearing leggings n horrible tops for weeks on a good day when I get dressed it’s usually pjs 😂🙈 would love to find me again find a style that suits me I haven’t got a clue helppppp 🙈😘", "reasimone8": "I would love to find a new style/outfit that brings together the pre baby and post baby me as I have a large case of lack of identity going on atm xxx", "blubbatina": "Wow how amazing! I have serious trouble with underwear which makes anything I wear look awful. I love your style and love how you ooze confidence with your clothes. I am not confident with how I look and I know it’s because I don’t wear the right thing for my shape. Would love your help on coordinating a look!", "tanyafxxx": "Oh I’m devastated @daniellevanier I’m in Cyprus I would definitely of wanted to be in with a chance to win this.. although we might need more then 5 hours 🤣 and id prob request we then went to your wardrobe and played dress up - fuelled by pink gin spritz! Can you do part 2 in September pretty pls xx", "tashakellyie": "ah if only I wasn't in Ireland 😭😭😭😭 and could fly 🤣🤣 whoever wins are some lucky beauts", "the_hnah": "I’ve always been confident with myself, my size and my style up until now. At the beginning of the year I got really ill and it’s resulting in a lot of surgery that’s changing my body drastically. It’s not so much the shape, more the additions - a permanent tube in my stomach, a belt (that I’m dreading) after spinal surgery, a swollen (slightly gross looking) stomach... the list is endless. I’ve stood in so many dressing rooms over the last few months and cried because I just can’t see ME anymore. I get that I’m not my illness, etc. etc. But when it’s something so physical, it’s hard to see past. An opportunity like this would be welcomed with open arms - even just getting me back on the road to liking myself again would be amazing.", "caggy24": "Working in school, I need something smart yet flexible, help! I either look like I’m having dinner with the Queen or hitting the gym 🙈🤣😩", "skinnerleanne": "I would love to pick your brain! I have always been heavy and short. I’m only 5 foot tall and have trouble with finding clothes that don’t make me look short and frumpy. I’m 34, I run a hotel in South Kensington and would love to look like I belong there.", "welshellie": "Hello - I am going on the holiday of a lifetime in September to Barbados. I haven’t had a photo taken of me on holiday for ten years as I am never comfortable in my clothes. I would really like an outfit that I feel happy photographed in. It might not seem a big deal to many people but for me it would help with my confidence. Thank you", "sazgiffordmatthews": "@daniellevanier I have everything crossed that I get lucky and actually win a competition for once 😜 I would love to pull off a pleated skit and tshirt look, however I'm always super conscious of it highlighting my stomach and hips.... as well as my arms! I see other people and just think to my self I wish I could look that way 😍and then just lose all my confidence. X x x", "danidoesbooks": "How can I move away from only wearing trousers and still flatter my shape?", "alulawhite": "Trousers! Skirts! Basically any form of separate that isn’t ‘oversized sweater and leggings’. I have ZERO idea how to break up my body and I love the idea of giving it a go: culottes... paper bag waist... palazzo... so many options, and I’ve not a clue! Help please darling ✨💕 Xx", "topbird1981": "Every day, I look like I’ve covered myself in glue and thrown myself into the wardrobe of a crazy lady. I am sadly working at the hospital on Tuesday so I will just satisfy myself by getting inspired from the likes of you, @jessontheplussize, @whatlauraloves and @calliethorpe 😍👌🏻", "nic_kinde": "This is so exciting! Ok - so I have huge boobs and find them a real emotional and practical struggle, as well as extra back pain thanks to my fibromyalgia (solidarity love 💕). I also love masculine cuts and androgynous styles but I can't ever find a way to wear them with my massive tits! It's really frustrating. I bet you could sort me out and make me feel the sharp business bitch that I really am, not like Mrs Trunchbull", "vickthorne": "I’d love some help with workwear looks that aren’t centred around black! I can’t seem to put anything together that isn’t black trousers or a black dress. I love colour but can’t pair colours up and no idea what colours to wear next to my red hair and pale skin. Help me pleeeaaaassee!! 🙏🙏🙏", "elenavictoria91": "How to do effortless casual - especially with trousers. I'd love to wear a white shirt or top or a Breton top with jeans but I just don't know how to style it without feeling frumpy. I have quite long slim legs compared to the rest of me and I don't know how to balance my shape when dressing casually! Xx", "miss_wallace85": "OMG......OOOOOMMMMMGGGGGG! Just chilling with you @daniellevanier would be a prize! But woop this is an awesome one.!! I am a pretty confident plus size woman, but I do find myself feeling conscious of my belly, I’d love to learn ways to dress to divert the eye or disguise......#deardanipleasehelp #ilovem&s #percypigsarelife ❤️❤️", "haddersworld": "My style queries is how can I wear a nice relaxed Jean that suits me! Skinny jeans are the only ones that suit my shape! But would love a more baggy trousers that are comfortable and look great I’m 5.8 too!", "chloepierreldn": "YOU LOOK SO GOOD!", "mrsjmburrage": "Would love to be able to wear jumpsuits that suit me!", "alicevictoria4691": "I’m a mid 20s mum with no fashion mojo what so ever! My daughter is kitted out but for Mumma it’s leggings and a top day in day out and would LOVE something super stylish but also comfy! Xxx", "natalyawillimott": "Hi! I’m starting university in September and would love to have some fashion tips on how to develop your own style and comfortable and confident in what you’re wearing because I’m suuuper uncomfortable being plus size and going to uni x", "_laura": "I’d love to know how to dress for proper evening events. I’m nominated for a massive award and I just have no idea where to start.", "emhmcc": "I’m singing in a local showcase in September - it’s very laidback and friendly but for me it’s a step towards proving that I really have conquered the stage fright that stopped me from doing solos as a teenager, and so is a bigger deal in my head. To help me ace it I’d like an outfit (probably a dress?) that I feel really and truly comfortable and confident in - one where nothing can go wrong and, obviously, is something I can breathe in! ❤️", "withlovelilyrose": "So pretty. Love this dress and bag on you", "carolinaplussize": "Beautiful! 😻 @daniellevanier", "amiives": "Love your style Dani and would love to learn how to put together work wear, shirts, trousers , dresses etc in a way that still looks a bit edgy and stylish. 40 something mum, looking to look stylish and not frumpy.", "annatmknsn": "This is amazing!! Okay, my style query is that I have my graduation coming up. I’m absolutely terrified about what to wear, I’m going to be standing up in front of kids of people and it may be the last time I see some people! I’m scared I’m gonna look so ugly and just not wear the right thing! 😫 I just don’t know what suits me, I feel like anything I put on is atrocious and I can’t find anything 😭 HELP ME DANIE 🌟😭💞 love you ❤️", "bitz_of_mitz": "Oh I wish I could enter but I leave for FL on Saturday!😩 by the way, you look GORGEOUS!!😍😆🙌🏻❤️💖", "bexmcbutterpants": "I love love love faux fur but feel like it makes me look more like cuddly child’s toy than chic fashionista. Looking for best fur (“fur”) looks for plus", "gem_p_2015": "Have been invited to a wedding reception in November but usually turn down events as after having 4 children, I can never find anything to suit or flatter my figure xx", "themrscoulson_666": "I love your style ! Total goals 🔥❤️ I really struggle with stylish on trend work wear. Black trousers and a top only get you so far and let’s face it’s it’s a bit boring. I’d like to jazz myself up ready to head into Autumn taking a step out of my comfort zone x", "cherrypieni": "I’ve just started working in a corporate environment, how do I dress smart/appropriate in a way that gets me taken seriously but still be fun/youthful and most crucially, not end up looking frumpy and twice my actual age? Even if I don’t win I’d love some help lol cos it’s a very tricky balance I’m not quite getting right!", "yazzi_durkz": "Hiiiiii, okay so having an end of summer garden party in September. Haven’t a clue what to wear, wanna look amazing obvz lots all my nearest and dearest will be there. Plus another special one 😉 helpppp please !! X", "miltonmaxwell": "Just turned 35 today, no clue how to style my changing shape post children... help!!", "fairylightsandwine": "oh wow, such an ace competition! i'm a secondary school drama teacher and plus size gal and i'm looking for clothes for the new academic year that are smart but also that i can move in when teaching without feeling restricted. any thoughts or help would be greatly appreciated! ✨💖", "hannahk8l": "I need help with my work wardrobe!! I find it a real struggle to put together outfits that are professional without being frumpy. I love your monochrome styles and need your help!!!!!", "lynseybaker25": "Would LOVE to be able to wear prints! I am super hippy and have a big bum so never think prints suit me! 😕", "kelly_loving_life": "I need help and advice 😳", "nicolaejones": "Trousers! How on earth to style/find the perfect pair of trousers! They never fit quite right or I just feel dreadful in them 😬 xxx", "elle_dean": "I WANT TO WIN!", "kayleighprentice": "Either my body isn’t made for leather jackets or I just cant seem to find the right one... I really struggle with leather/biker jackets as they never zip up across my chest, are puffy and big on the shoulders, long in the arms and tight across the back!!! I have spent about 10 years looking and yet to find one!!", "kittylover_heart": "I would like some advice on what to wear to work. I’ve just been promoted and want people to take me seriously however I need to feel comfortable also! 💖 and would love a confidence boosting chat with you too x", "josie_pointer": "My style query is that I'm starting my final year at uni in September and I want to walk in feeling and looking like a girl boss. I always love what you wear and would love to have the courage to wear pattern on pattern or loads of colours. Thanks x x x", "alsoknownasboos": "So for years I've always been the biggest out of my friends. It may be all in my head but all I want is to look as lovely and sexy as they do and don't get me wrong I am sometimes a confident plus size woman but I struggle struggle struggle with what to wear to parties, cocktails with my gals or date night! I end up buying something new every time and feel uncomfortable or feel I shouldn't be wearing what I want to. I just wish I could feel more like me and yet the clothes I choose or feel I have to wear don't always reflect the real me. Any tips would be great x", "msbettsy": "I’m fed up of wearing black and shapeless clothes. I want colour in my life and to feel confident in a super stylish Danie inspired look🍸 I may just cry a little 🌟", "ghickes": "Absolutely skint (plus size) soon to be student! Panicking about freshers and nights out what to wear! And wondering how to look stylish at the same time as being comfortable for exploring and studying in my new University city! Xxx (please help!❤️)", "gailcoles2808": "I am going to the USA for the 1st time in October. I’ll be in San Francisco and want to look fab and funky in photos but comfy too as there’s lots to see! I love the new sporty range that M&S have but as I’m 58 and a size 22 how do I carry that off? Well 58 until the 28th August because then I’ll be 59!!", "mrssnook": "I have just lost my way & my confidence 😫 was always super confident but I had a baby last year and I’m approaching 30 and I just really don’t know what to wear anymore and hate everything I try on 😔 I need your help 🤞🏻❤️", "kimwood1984": "I've lost a lot of weight and I'm finding it hard to choose what to wear now my shape has changed but I'm also an older lady who doesn't want to dress like her mother I'm feeling very confused and could do with a helping hand. Xx", "sarsbars": "Hi! So I have recently lost 6 stone and while I’m really happy, my arms are just awful. Nothing I do at the gym can tone them and im finding it really really hard to dress for summer whilst trying to hide them :( I think this is a problem a lot of girls have and we need HELP!!! ❗️❗️❗️❗️", "aayoola": "I have the absolute biggest thighs life has ever seen but a smaller waist so can never find bottoms to fit and look good one me....I'd like to wear trousers/jeans more often that flatter (not necessarily hide) but when I look in the mirror I'm like whoop who's the hottie 🤷🏾‍♀️", "jenny.leigh.illsley": "I've recently found out I'm pregnant with my first baby and I need some help finding the perfect outfit for when we announce to our friends and family in a few weeks time ❤️", "amy_short_89": "I’m going away on Holiday next month and I would LOVE to rock some form of bikini 👙I’m tired of going for my usual All Black Swimsuit! I’m all bangers and no bum so find it really hard to find something to balance me out!! 😘", "miss_smiler84": "I love fashion but whenever I go clothes shopping I get fashion block and I don't know how to dress for my fuller figure. I love colour but I live in black and ive recently just had a little baby girl, shes 8 weeks old, and I now live in unflattering clothes or my pjs. My question is... I believe I'm an hourglass figure what shapes, cuts and items of clothing would suit me? And will be practical for a young Mum to wear? Thank you 😇🍀💗", "farhiya7168": "Hiya looking gorgeous as ever!! I’m not a body confident person 95% of the time I have no idea what to wear and just end up wearing the same outfit it is just a struggle . I would love to experiment with colours especially suits but I’m so damm scared to try them on, this would be my step towards that.", "jooliehep": "I am 40 something and stuck in a casual style rut.... all I wear are jeans and t shirts! Please help me to learn how to dress stylishly while casual at the same time!!", "annakguzy": "Please help! I’ve just qualified as a teacher and would love to wear trousers to school without looking frumpy. I currently live in dresses and want to change up my style to look less like a tall toddler and more like a sophisticated grown up. I’ve seen so many cool pieces in M&S but can never seem to figure out how to put the whole ensemble together without looking like a lunatic!", "paulacambridge": "I just don't know what suits me I buy by looking at what suits other people. I have good boobs but hate my stomach !! I get it wrong daily HELP", "francescaadamson": "Love to be able to pull off tucking tops into trousers. Always think looks more styled and formal on everyone else bit feel like an idiot when I try", "thisissnooziekate": "How do I best dress my belly- I love it and don’t want to cover it all the time with baggy things...", "sej199": "Oh my goodness! This would be a dream come true. I really struggle with going ‘out out’ outfits now I’m 35. Something that says sexy and fun but also stylish and classy. I need your help @daniellevanier xxxx", "nats1602": "As much as I need tips for styling on the outside, I really do Danie, help me! My biggest thing is finding a bra that supports me whilst not being a boring white or black basic sports bra. The trouble is I have a large band size but relatively small cup size and struggle to find styles that fit and feel like 'me'. Help a girl out!", "fiona100995": "Hey, I'm turning 45 this year and I am having real trouble with finding a style that I feel comfortable with. I'm so tired of wearing jeans and a boring top. HELP! Please x", "egiffy": "I love dresses and wear them to formal events but struggle to make them more a casual piece. I see girls rocking dresses with flats/trainers and casual jackets and i just don’t know how to do it! I would love to wear a dress on a day to day basis especially for going back to uni in September as a mature student! What a competition! 💕", "jess_gissing": "I always just end up looking so boring and samey with jeans t-shirts and converse. I’d love to be able to wear more out there items and stand out a bit more!", "scotttohavefaith": "I've just been made redundant from a largely home based position and am now going through interviews to try and find a new position. I'm nervous about finding office wear that suits my character but is also appropriate and flatters me. It's not a type of clothing I feel very comfortable in so would love to be styled in a way that will give me confidence moving forward in my working life.", "jasminsangha1986": "I Would love to be styled for smart wear for work with jeans. I work in a very fashion conscious office but I have no idea what I'm doing. I really don't like my long middle and short legs. Buying and styling jeans is a nightmare. They constantly fall down and I have to the the jeans jump ( hold the side and pull them up) and because of my long middle finding tops is really tricky.", "becky_anne_campbell": "Workwear for me as a plus size woman is my biggest pain, I don’t want something stretchy! I want something tailored and comfortable and chic!!! Please help :-) xxx", "kaywhittle125_": "Oh where do i start im so bad at putting colours together and just general picking clothing. Ive gone to town feeling positive and happy then i hit the shops and i get so confused i dont know what to pick i don't know how i could wear that with that . Not sure on bright colours they scare me . In the end i shout at my husband and come home with nothing and cry . I just need some help with putting things together and wearing colours . Im sick to death of wearing jeans black ones . I need help so i can stop moaning on to my gorgeous understanding patient husband . Im 5ft 3 and wear a size 20 - 22 xx", "caros_little_corner": "First of all I am totally in love with you and your style...meeting you in person would be a dream come true....and I really would love some help and advice on how to look smart for business and feel comfortable too ❤️", "natlawro": "I have my boyfriends birthday bbq/night our coming up and I’m bigger than I usually am so conscious about being in front of his friends and need a banging Danni Vanni outfit!!🤷🏼‍♀️x", "hele_an": "This sounds fantastic. I'm looking to change careers and really want to get that whole smart/cool/casual look down. You know casual trouser/nice shirt/top with trainers. I barely own one pair of trousers as I just cannot find a pair that isn't too tight or baggy so it actually fits and flatters. Shirts are either too heavy or don't fit round the waist but are too large at the bust. I feel like I either dress for an office setting which I don't work at or I'm in leggings like I'm hanging out at home! Nightmare!", "jaycamilleri\nVerified": "Verified", "anycoloursolongasitisblack": "I’m most comfortable in black, more so now I’m at the largest I’ve ever been. I’d like to get some positive input on some colour, that isn’t so much on the neutral spectrum! Ta!", "the_original_christina_breen": "you had me at percy pigs. but alas, last minute flights to London from New Zealand would cost the same as a mortgage 😂😂", "bonbonboz": "My daughter gets married next year and I can’t find a mother of the bride out that’s me. I’m 45, still love fashion but it’s so hard to get the right balance for this! Not trying too hard or look at me but not totally 😴 either. I want to feel amazing on this special day I’d love some help x", "originalbajanghal": "👏🏾👏🏾👏🏾👍🏾👍🏾😘", "charlieee0492": "I would really love some help with finding & styling smart casual trousers that fit right! I love how practical trousers are, esp. for my job as some days can be super active...but I’ve yet to find a pair that is both comfy and stylish! So I definitely need your help! And it would be fabulous to meet you in person - sounds like the best day 💗", "myworldlifeinpictures": "Hello there, I would like to ask how to help style a body with a terrible stomach... I love the tucked in t-shirt with jeans and pumps style, pretty much the girl next door kinda Look, but I always look frumpy and in all honesty boring. I know it's a simple look but it's quite hard to get right, and i always think less is more and when it's done right 😍. If you have any tips to help flatter a curvy girl id really appreciate it. Thankyou xxx", "paulaharper_07": "Great competition. I would like help with casual styling and adding colour to my wardrobe.", "becabot": "Wow, what a great opportunity. Ok so for me it’s balancing my boobs- I just always have an issue of needing to highlight my waist and chest, but I don’t want to look too ‘look at me’. So I’d love to know what styles suit curvy hourglass shapes, but don’t end up looking too dressed up. I find I’m constantly stuck between ill-fitted but comfy or dolled up to the max.", "rosi230373": "You look bloody gorgeous in that dress with your new hair colour 💓❣💟", "gemmaslittleworld": "I would love an outfit for curve fashion festival. I'm always wearing dressed and really would love to try tailored look and even more masculine!! I love your style and know you'd be perfect to style me! I would love it! 💗💗💗💗💗💗", "patternmagpie": "I so want to enter this but I have work commitments on Tuesday! Gutted! Maybe I could pick your brains anyway though?! I have my first ever black tie event to go to in October. It’s with my husbands work colleagues that I’ve never met. We’re going to a marines boxing evening so I’m imagining lots of glam women! I’m 6ft, I’m wobbly everywhere! I’ve had 2 children in the last 3 years and my shape has totally changed! I really try to be stylish but dressing up makes me so self conscious! I just look like a burly trucker in drag! (I don’t mind that look at all - but it’s not the look I’ve usually tried to achieve!) I’m not mega girly so I was thinking of a jumpsuit. Could you recommend any good ones? Ps. Great competition! xx", "laura_james1980": "Hey, how fab is this! I am a 6ft, plus size mummy/wife/professional. with PCOS and find it difficult to dress girlie without feeling a bit like I look like I am in drag. Everything seems to be too short and as soon as a I go too feminine I can feel mumsy and it hides my personality. I very much celebrate me. I don’t want to hide from the world. I often dress confidently but I need a softer girlie look at times without feeling like I am in drag or look mumsy. I love colour, I love life, I love fashion but would like a different look. It would be amazing to have you do a do-over. How awesome would that be. Buzzing at the idea of it. 🐝😍", "anishaoram": "My style query is I would love to know what styles and colours suit me, I know a few basics and stick to those but beyond that I wouldn’t know where to start, I would also like to look smarter for work but without trying to hard !", "kingshill_girl": "I would love some help with my belly being large and relatively skinny legs I don’t feel my shape is ever really celebrated or styled in any way other than skinny jeans and a floaty top 😫. I have just turned 40 and long to be cool rock chick Mum but most of the time I am just supermarket slob mum. So yeah, help with school run / part time office job that is pretty casual style would be amazing and time with your royal fabulousness to boot?! Well sign me up please!", "youpenga": "This is so exciting!!!! Thanks for the opportunity!! For me, well, I guess I always feel like I don’t have the RIGHT curves!! Most plus size models we see are boobs and bum and flat tum! I feel so far from that ideal, but I’d love to rock something more figure hugging and not shy away from what my mamma gave me so to say!! I lost my confidence in allowing more of my silhouette to show! So that’s what I would hope for in this chance...a chance to embrace ALL of me even more! And of course you know how amazing I think you are, so it would be an pleasure to get to meet you and the M&S team! Percy Pigs for the win!!! And fingers are crossed! 💕", "amydonjuan": "I’ve just got married and I feel like I’m not grown up enough to be a wife! I want to spend a bit of time changing my style / image. How do I dress the part? Xoxox", "rachael85x": "I have a wedding in November in a treehouse resort. I don't know wheter a dress would be too cold, but what is my option. I'm so confused and due to belly worried I'll look horrible.", "traceycurly": "I would really like to look less frumpy. In a complete style rut and just want to know how to piece together a smart causal trendy look! Xx", "annie_mc_eats": "I’d love to know how to minimise the hip & thigh area plus accessorise the dress above ☝🏻in navy for a wedding in September 🤷🏻‍♀️xx", "kellyjanes": "Hi @daniellevanier I would love to come have some fizz with you whilst also celebrating plus size bods 😍 I've always been the fat friend and have never been shopping with my gals because bless them they can't offer me helpful style advice. I'm bored of wearing all black! I'm 28 and it's time I celebrated being a plus sized babe ❤️", "pallycakes": "😍 percy pigs and fizz hello. I would LOVE to be styled for my brothers wedding. I always find it hard to dress up for fancy pants occasions. I always go to floral and id like to change it up! Im doing a reading at the wedding and would like to feel sassy on the alter. @daniellevanier @marksandspencerfashionpr", "hannahdakin_stevens": "Hun going New York, Las Vegas, Atlanta and Miami for my honeymoon I have to clue what to wear. Need something stylish but comfortable for walking around *cough* who am I kidding, I’ll be in some bar people watching! Loves 💖", "mama.lupi": "Sooo. Having suffered with endo all my life and after 4 failed ivf I had a hysterectomy to get me out of pain recently. Quite quickly I’ve developed a menopausal middle. I’m bigger anyway but how do I dress this new body?", "ebunawokoya": "Good luck in the competition guys 🤞", "eihpos21": "How on earth do you wear winter clothes with big boobs and not end looking like a total frump?! I always fail at this, end up looking bloody awful. So some help would be FAB!", "courtceg": "I need a teaching outfit! I struggle with dress pants and suits!", "charlottes_fit_focus": "Ooo I’m going to give this a shot! ..... So I’m nearing leaving a job and fingers crossed I’ll have an interview or two or three to attend very soon! What do I wear to show sophistication yet have a feminine edge to it to show off the curves? And feel comfortable too! And most of all, feel confident! 💁🏻‍♀️💃🏻Don’t think that’s too many boxes to tick? 🙈", "keziafrancesca_": "You are amazing!! And I always love how you dress and always manage to look so well put together. I would love your help to step away from the leggings! My whole wardrobe for the past 5 years has consisted of black leggings and a long top! Help me break away from this cycle pleaseee! xxxx", "katkit_24": "I need HHAAAALLLLPPPPP i have a SMEGGAAA work event coming up where everyone is dressed ver ver ver fancy! I have no clue about what to wear and I need some serious advice! You always look so FABULOUS! pleaseeeee help maaaa 😂😍😫🙃 xxx", "howthehellami40": "Since becoming disabled after a fall in which I broke my back I’ve put on a lot of weight. I’ve lost all confidence and have no idea how to dress to flatter a more curvy figure. I would love a trendy look for the school run that doesn’t take too much effort. What a great competition. Good luck everyone 🙏🏻🦄", "deegz602": "I would love to have a suit for work. Like a funky trendy one that I can slay in! I always feel like I look like a box when I try to find one. I would love your help with this! 😘😘 xx", "sophiesawtell": "I would love to be a lot more braver with my every day choice in clothing. I used to be more daring but now I stick to dark colours with mostly jeans. Also I love looking at accessories but haven’t got a clue what suits me! I would so love to be styled by a pro 🤗 Help lol! X", "marilena_173": "@daniellevanier I usually wear jeans and a top, I would love to change my style, be more confident and feminine. I would like to start to appreciate myself and feel beautiful.", "gin.genie": "What an absolutely amazing comp 🙌 Would soooo love to enter this as a wee 5ft 3inch-er who always has a problem when it comes to dresses (too long/too short/body length never right and let's not even talk about cleavage!) But I'm up at hospital with my dad all day on the 28th. Good luck to everyone who enters, the winners are gonna have the absolute bestest day 🤗. Really hope you do another comp like this in the not too distant future x", "sherrifers": "Im fed up of black trousers and tshirts at work 😭 after 5 years at uni and 1 year in-work-training to get my license I finally start my big girl job at the ripe old age of 31 and I'm dressing like a bloody nun. Help me.", "some_girl_from_essex": "What a wonderful opportunity 💕 I have always struggled to find a style that I feel is ‘me’ and I’m so honoured to be asked to be a bridesmaid for my youngest brother’s wedding... it’s a beach wedding, no set colour or style which is giving me anxiety as I don’t know where to even start looking... I don’t want to let them down or myself, for once I want to feel beautiful in my own skin... I’m 39 years old and it’s taken me 39 years to admit that out loud 😳 Good luck everyone and honestly, whomever is lucky enough to win will so deserve it ❤️", "aliboopuff": "I Live in dresses they are my comfort zone as they hide a multitude of sins and if I wear trousers it had to be with a long top to hide my \"apron\"....but I see plus size babes all the time wearing crop tops, pencils skirts, wiggle dresses that are tight on the midriff and they look hot as f**k but I just don't have the confidence and swagger to put something like that together and wear myself....please help! I think you're fabulous 🤗", "sararie255": "I don’t own a pair of jeans 🙈 I’ve never been able to find a pair to fit my strange shape! Would love some help with this (and everything else. I have zero style!)", "justmegs_plustwo": "Oh bloody hell I need your help! Since having my twin girls, dealing with PTSD from their birth and generally just living in a \"mummy bubble\" for two years I have no idea who I am anymore. Other than a pair of jeans, t-shirt and mum bun I'm stuck! I need to get my mojo back & I've no idea how! Xx", "kickine": "What an amazing competition. I think it's literally majestic when I see a well put together outfit. I literally. Just. Can't do it! I'm a mummy to a 3 yr old, completely lost a sense of style (didn't have any to begin with! Tbh) I don't have time on my own to think about clothes, but I'm forever wanting to branch out and be a cool mum! I've lost 4 stone lately. And no idea of my size anymore. I'm like.. 2 different sizes!? Nothing fits me ha!", "onechronicmumma": "I’m about to have pretty major surgery (proctocolectomy) and need clothes that will be forgiving on my scars whilst I heal and can be worn to accommodate a colostomy bag... but obvs don’t want to look like I’m in my pjs. I’m claiming my life back with this op so want to dress like the real me!", "kellyg2211": "Hello! I am going to be a bridesmaid for my sisters wedding next September, all the other bridesmaids are a lot smaller than me, I don’t want my lack of confidence and being the ‘bigger’ bridesmaid to even enter my thoughts on my sisters (who is also my bestie) most magical day! I want to enjoy every single second of it! My sister is trying to find a style that will compliment everyone and we are leaning towards the multiway maxi dresses from @marksandspencerfashionpr but am quite short and don’t want clingy material! Any suggestions? Many thanks x x", "bean_mother": "Oh wow. This would be amazing! I’d really like to up my casual game. I live in jeans/shorts and trainers but would love to try something different to suit my shape (big bum, smaller waist, small back, big boobs) whilst still looking a bit cool and casual. Thank you and fingers very much crossed!! X", "daisy_kirkwood": "I want a look that says I’ve made an effort without trying too hard, something that is right to wear to loads of places (from dinner at the Ivy to the cool new bar in shoreditch). Amazing competition, I love both you and M&S!!", "si_obhan_": "You look ruddy lovely in this dress!!!", "shona_loves79": "I’m turning 40 soon and really struggling to find a style that suits me, I feel stuck in a rut, don’t feel I can wear similar clothes I wore 20 years ago 🙈 but equally don’t want to dress like I’m 40! I’d love some help finding a new look x", "ashweemarwee": "Ah! I’m so bummed! We’re coming to London for our Honeymoon on the 30th! 😭 So close!", "laurastuart8": "I have a big night out on 1st September with all the girls. I’m larger then all my friends and the least trendy out of us all. They are always on trend I always want to turn up looking chic and trendy, like you always look. But I struggle to piece a striking outfit together. I always wear the same thing and my wardrobe largely consists of black clothes. @daniellevanier please help me and put me onto the path to enlightenment. I absolutely love the polka dot, stripe, print, nautical look, but really don’t know where to start 🙏🏽🙄💕🤞🏼 x", "sianekerr": "I start my first official teaching job this September and would love a trendy teacher outfit for the first day of school. I am six foot and size 24 and I love fashion but find it hard to find clothes to fit my body type.", "blondie912": "I struggle with outfits that suit my height and shape. Being 5ft10 and a size 20 I struggle trying to find clothes that fit and are long enough for me. You see a cute top and be like yessss and try it on and it turns into a crop top! Great competition! Xx", "redlesmarie": "Hi Dani. Great prize. My problem area to dress is my stomach. I’m wearing jeans and floaty tops constantly. Love the way you wear skirts and dresses and can dress them up or down. I would love to change up the wardrobe and have more variety. That would be the area I need help with. Xx", "hayleyhall_uk": "Yessss! I’d love your help with trousers. Apart from jeans I haven’t worn them in a decade and I have no clue how to make them work for my arse and hips!", "katiemaymedley": "BABES! Are you coming in to pads? 😍 let me know I want a squeeze ❤️", "strawberryketts": "Hey DV! Talk to me... A skirt & a top. Like how do you do it!?🙈 I just can’t seem to get the combo right! I adore seeing babes in skirts & always see lovely skirts then BOOM I put it on & all is see is the base of a Christmas tree! 🎄🙄 I need to discuss this at length whilst eating Percy Pigs 🐽", "pureheartsgang": "Gurrrll 😍😍😍 you look phenomenal", "clareeldershaw": "I’m 24 and haven’t worn jeans/trousers since I was 15 (9 years!!) because I don’t know how to style them to my bodyshape(/wouldn’t know what suits)... I’d love wear some cullouts or patterned trousers to an event but just don’t know where to start xxx", "awpatts": "Ah I wish I had all these lovely reasons. I just also think m&s is baller but generally out of my price range. I want to learn some more about bringing summer dresses into the winter to extend the wear of my clothes though!", "oddsandtrends_": "This sounds so great! I'd like to know how to pull off a pair of trousers and style them - every time I try trousers on I feel frumpy and take the outfit back off. I'm not sure if it's the way I style them cause I can style jeans and dresses easily enough just not actual trousers. As a plus size woman the last thing I want is to feel frumpy, I try to remain stylish and sometimes it would be nice to get out of my comfort zone but look damn good when doing it. Good luck everyone! 💕", "maai_style": "Super cute dress!", "missylamour": "I don’t have a style query as such I have loads! Following you over the last few years has made me see what I would like to wear, but I get confused and never feel completely comfortable when I try something new. Ive had a long journey getting to accept myself and I am slowly getting braver with clothes, but would love to pick your brains about what you think would work etc. Also, if nothing else I would love some percy pigs and I am open to an aperol or 2! X", "bigbadjujuu": "I would love some advice on what to wear to work in an office. Interested especially in culottes or tapered trousers.", "davica_farrell": "Love this comp. I am due to do a cruise of the mediterrean and want a gorgeous outfit for my day in Santorini. I am struggling to find something that accentuates my silhouette and something fun. 🤞", "lollyalexander": "Would love to wear tie waist trousers !! Xx", "notesbyness": "I have a lovely curvy bum and big boobs which I spend most of my time hiding and just hit the wonderful age of 41 ... I want to feel beautiful and confident so I can wow the man of my dreams and put me more on my insta ... I need help feeling desirable and in need of rocking my curves more xxx", "mcdermottc83": "Do you have link for this dress x", "_stacey87": "Oh this is amazing! I would love to wear trousers, I do not even own a pair 🙈 only leggings or floaty skirts to hide my tum, @daniellevanier you always look so good, would love some styling input xx", "sophielizlou": "Love the idea of this so much!! I love my boob and bum, but no keen on the in between bit!! What kind of things should I be wearing to show off my fave bits and not the rest?", "italianvickalina": "What an exciting competition for you to be a part of!! I’d love to nail a smart casual look without relying on jeans all the time!! I feel like I work with what I’ve got but it’s usually jeans and black swing tops. Enjoy the day xx", "jd01g": "I Love clothing but don’t really know what suits my size, shape and skin tone. M&S always have lovely clothes but don’t know what would suit me.", "doragreksza": "This is so amazing! It would be lovely to meet you and have a real life sofa chat 😊 the amazing M&S outfit would be an added bonus! I was absolutely devastated when they closed all their stores in Hungary 😩 What I would love to figure out finally is how to find an elegant white shirt that is not holding on for dear life near my boobs but also doesn't make me look like I am pregnant 😀", "lydia_coombey": "Suites!! I’m lost 🤷🏻‍♀️! Skirts or Trousers? Patterned or Plain?...and don’t even get me started on which shoes! I would love to get a suite to wear to work and/or special occasions. Or just a Wednesday! I’m just not sure what would suit me (get it 😏).", "ornamentalondon": "I Love the way you wear a dress, but every time try one on.... arghh... I can't seem to make it work. Always a challenge with Big boobs (yay!) and generous size ☺ although I do have a genuine dislike of my ankles!!! I would love to surprise the hubby by wearing something other than black trousers a blackish top and if I'm feeling daring a grey jacket . A 👗 and colour OMG!!! it would be like one of those outrageous mega makeover shows!!! He might even 😢 haha probably not.", "missbigg_": "Hiya I never really know what suits my shape ( I think I’m an apple maybe a square lol) I’m very large busted which is also hard to find something that’s not always stretched over them. I’d love help and advice to be that cool Mum not the Mum that only has work clothes or that will do outfits. I rarely get to go out but I do like to experiment with make up when I’m free. Although I’m still learning haha xx I’d love your help as well as Marks xx 💋", "claire_skelly_": "Hey danni I have started a new job and I’m sticking to just black ( always the same) I see your posts every day and what you wear. I think yes I’m gonna buy some different clothes ... but I never have the guts to do it. So if you could help that would@be amazing 🙌🏼🤷🏻‍♀️#imstuckinblack xxx", "rubyboo83": "OMG😆 so many questions!! I want to wear skirts, I love pleated skirts but I’m just not sure how to work it, would love to make it a winter wardrobe staple! But I’m not slim and don’t know how to style it for my body shape!! In fact all I do is hid under baggy!! HELP!! I wanna try it all 🎉🎉🎉", "mrscave87": "@daniellevanier I was only thinking the other day maybe I should ask for you fashion advice, so this is perfect...since becoming a Mummy for the first time a year & a half ago I’ve lost a lot of self-confidence particularly when it comes to how I dress, I’m smaller than before I was pregnant too, and also funds are of course now very limited so I’m stuck with misshapen old clothes that aren’t doing me any favours physically or mentally lol! I desperately need some advice on a few staple items that don’t cost the earth, that I can dress up on the rare occasion, but also are suitable for running around in the day after my wild little boy that still make me feel fun & young. I love the idea of more trousers/culottes and tops, but am quite short and very conscious of my mid section. Any advice (HELP) would be hugely appreciated 🤞🏻😘 xxx", "kilabradders": "I’ve got my graduation coming up and am hopeless at styling myself, it’s a winter graduation and I like to keep my arms covered because of the bingo wings, would absolutely love to win this experience as I would be travelling from Northern Ireland 😍", "jessalbone": "Aww this would be amazing Danie! I've just secured a new job role and the office environment is a lot more 'business' than it was at my last work place. I'm in need of some outfits for work which are comfortable... and which you're not going to totally melt in when the heating is wacked sky high! xx", "jenelectro": "🙋🏽‍♂️🙋🏽‍♂️🙋🏽‍♂️- style query - what to wear to a mid summer wedding?!", "inthesky83": "Hi Dani, thanks for such a great opportunity! I got married in April but I am travelling to Karachi in December to celebrate the marriage with my husband’s family. I’d would love help in finding an outfit to wear to a dinner my sister in law is throwing for me. I would love to find an outfit that suits my larger size, respect the modest local customs but still look f*cking amazing! Xx", "stylemesunday": "Fitness!", "taaambam": "I go to work in the same boring clothes and never feel sassy or fashionable. I work in a school and find my ‘workwear’ makes me look frumpy and older than I am. I just struggle to find a classic look that doesn’t age me. I cover myself completely at work and it doesn’t reflect my day to day outside work looks and I just can’t find a happy balance. I’d absolutely LOVE a day of nibbles, natters and Percy pigs ❤️", "mytwenty_1": "Hey! I have a friend's wedding to attend in December! What can i wear that's winter friendly but also appropriate for a big event like this? I usually prefer dresses for weddings but I'm open to options. I just want to look great and be warm enough to enjoy the day.", "lucemac_": "Would love a killer look that will turn heads for a José Gonzalez concert at the Royal Albert Hall in September. I’ve lost some weight recently so all my clothes are starting to look a big saggy! Pep me up with your vibrant sass! 😚 x", "hena__x": "I would love to win this!! My biggest problem is trying to make things fit around my tummy! Just don’t want to look like a lump! X", "parisjayde12": "I love super casual looks- I call it \"boy chic\"lol but I REALLY struggle with taking my look from day to night! HELP!!!!!", "renepoos": "I’m off on our first family holiday in two weeks, and have totally lost my way with anything fashion wise. I’m most struggling with swimwear, and finding it difficult to find something that makes me feel good and helps me rock my mum tum xxx", "curvyhunii_88": "Hi Dani xx so its my darling dads 60th this friday 😱 ive got this floral flared midi dress but not sure how to style it at all 😑i mean what shoes would look best.. wedges, flats? And i wanna cover my arms but a shawl looks odd I just don't know any feed back wether i win or not would be great 🤘🏻ya gotta be in it to win it ☺️☺️☺️ x have a lovely day hunii xxx", "chloe_hwk": "Oh what a cool opportunity 😮 errm cullotes and trousers for someone with feeling uncomfortable with her fupa 🙋I have a huge party with my boyfriend's parents in Sept and feeling very uninspired to start looking for an outfit. I feel like the fat daughter in law so would love to feel special. Thank you for the opportunity, Percy pigs and day with Dani!! X", "sxhawes": "LOVE YA TOO ❤️ I’d love your help with my lower calves and cankles! Please, please help! I’ve suffered for years, lost all confidence 😢 #obsessedwithM&S", "jasmineeec": "How excitingggg!!! I would LOVE an amazing outfit for our engagement photo shoot! I’ve never had anything like it doing and I feel like I don’t know how to do anything that isn’t super casual! X", "ashleighbrashagram": "WAAAAH NO WAY’! I have this dress in EVERY print! #obsessed and I absolutely adore marksies!!! So chic and I just can not fault their products and style! Literally made for everyone, perfect! 😍💗💗💗🌈🌈🌈😍 I would love to win this after having a chronic disease thrust upon me 11 months ago, it caused me to lose a lot of my confidence and made me severely anxious to the point I didn’t want to leave the house! I’m getting there now, slowly but surely and I think one of the main reasons was following you and other bloggers. It’s amazing how many women are supporting other women. Long may it continue! 🎀💗👯‍♀️👩‍❤️‍💋‍👩❤️🧡💛💚💙💜 GOOD LUCK TO ALL YOU WONDERFUL LADIES 💃🏻😘", "niamh__harnett": "I’m really self conscious about my boobs 🙈😂 I’m really top heavy and would love advice on how to wear tops/dresses that flatter that rather than always wearing turtle necks that go past my forehead 🙈😝", "tollyjall": "Apart from WOW! Yes please! I've a wedding to attend second w/e Sept. A cool, country marquee event. Need to look gorgeous, but would like to be a bit quirky too. I would struggle to pull this off without help as I'm a bit extra (tall 6'1\"/curvy size 20/22). Plus bubbles and Percy! 😍@marksandspencerfashionpr @daniellevanier", "lozzakiddabean": "Suits! I wanna rock a colour suit that I can wear for work (I’m the weird Drama teacher 🙈) or for a night on the tiles 💃🏻 also trying to find a shirt that fits on the boobs 👌🏻 xx", "mrsabbywatkins": "I need this so badly! 42 and still haven’t found ‘my’ style. I have so many clothes but nothing to wear! Not sure I’ve ever put anything on and felt amazing 🙄", "glasgow_ghirl": "40+ years old, with the mind of a 25 year old and neither can find trousers or jeans that flatter the hips and ass that Kim K would envy. Ok maybe not 😂 but the struggle is real. Help! X", "iamthemrscollins": "I’ve just hit 40 with 2 small kids... I just need some help. I’m just wearing trackies, leggings and anything that’s comfy but boring. Help me please Dani HELP ME! 😩😩😩", "amyfuchsia": "This dreeeeeeeessss! Gorgeous", "_sarah_hughes": "Hi! I would love this prize. My style question is... I am 43, my usual style is alternative - but as I get older this gets harder. I would like to stay stylish, alternative and also ready for the office as I am a CE of a mental health charity. I’ve got to grow up sometime but don’t want to sacrifice my inner hippy. Would love your help ❤️", "charlruddock": "How do I not look like a constant frump 🙃 I wanna be a trendy plus sized girl like you and others I see on Instagram but all I wear is black clothes (which I love) but I’d like to know how to style colour x", "charlio88": "I would love to be able to find a skirt that would suit me , I have tried so many skirts on but can never find one that I feel comfortable in because I am more bottom curvy and I find that it highlights my bottom area more which I don’t want stick out more than it already does haha! I would to find a nice floaty skirt for a night on the town for my friends birthday! Thank you xx", "just_sy_": "Hiya! I'm a new mum with a new fluffier body shape, I'd love a smart casual but cute look for the office as I'm due back to work next month, I may be impossible to style as I have a smaller top with large derriere and tummy... Can you please help me rock a new look? Love 💛 @just_sy_", "kdrage": "I really struggle with finding something fun but professional to wear in the office. I’m plus size, size 20 and tall, 5’11 and I love dresses, skirts and trouser/blouse look but I always opt for my same boring chino/t-shirt combo. I would love help in upping my game! I play the part, and want to look like it too! Thank you x", "eloisewebb93": "This sounds like the absolute perfect day! 💘 My main fashion issue at the minute is that I start a new job in September and for the first time I have to wear workwear! I’ve always had to wear uniforms in the past so I haven’t got a clue how to style workwear pieces. I’d looooove to meet you, I have so many questions and share your deep, deep love for Aperol 🧡🍊the Percy’s are a bonus", "ralph_mumma": "I also LOVE Marks and Sparks.. Thanks to my lovely Nanny - I was raised spending hours browsing and it’s one of my fav things to do! You rock trainers and it’s something I always feel like I can’t wear with anything. I’d love some help with an evening style- the world ‘cocktail dress’ gives me cold sweats and we have a cruise booked with several formal nights. 💃Plus size 20/22 and 5ft8 😁 xxx", "ellalouise18": "Hiiiii Dani please tell me how to be a fashionable, hip mama, like what can I rock on the school run that makes me look cool but also that I have my shit together? ❤️", "emma_erton": "If you can pass on any of your style tips it would be beyond amazing!! I love leather look pencil skirts and trousers, but just cannot make them work! No idea what I'd wear with them either?! 🤷🏼‍♀️ I would love to have a going out out outfit that's hot and rocks but always feel pretty frumpy. I need a look to bring the boys to the yard!! Fairy godmother Dani, please help!", "justtinaaa_": "I have my dad's 60th birthday coming in November and now three months before I am wondering what should I wear?! It will be such a good opportunity to have someones oppinion what should I wear 😍😍😍", "smallkate23": "💜 love this! I need advice on outfits for nights out, as a plus size girl I struggle with wearing and heels, and most of the time end up wearing flats with plain colours and shapes! I want to know how to liven up my nighttime wardrobe and really separate it from my day time look?! Help!! Xx", "taylorchelseaskea": "As someone who has suddenly found herself a size 18 after losing 4 stone, I would be so grateful to have some style advice around dressing in clothing such as jumpsuits and trousers to flatter my stomach (which is an area I would love to feel confident about). I find that I steer away from a lot of clothing and limit myself to dresses because I'm almost scared of my tummy. Now that I have lost some weight, I really would like to explore my sense of fashion more and would love some help to overcome this hurdle in order for me to be the best version of myself.", "sioned_mai": "Love the dress in this pic! 😍We’ve got a great new smart/casual workwear policy which I love but I’m struggling with looking like I’ve not made any effort whatsoever or looking frumpy and much older - not ideal when I just want to be comfy and wear stuff that would fit my personality. I’m the only plus size girl in the team so don’t feel that I can always pull off some of the awesome bits my lovely colleagues wear so any help gratefully received!!", "xxleannexx11": "OMG ! This competition is amazing. I love how you style your outfits and always look great. Not only to be styled by you but to meet you would be amazing. I always wear leggings and everything I normally wear is black ! I have a over hang from having two c sections with my children. My first c section was a life hurdle for me I lost a lot of blood and ended up in intense care I stopped breathing while they rushed me to theatre luckily the amazing hospital staff NHS saved my life. when I came round I was expecting a normal c-section scar but unfortunately this wasn’t the case. I have battled with my weight ever since, I would love to be able to wear something other than leggings and feel completely body confident. Xxx", "ginandgriddle": "Skirts! No matter what type I don’t seem able to wear them, have tried lots, all different shapes... yet I see skirts on lots of different size people who all rock them! My office is casual so I love in casual wear - jeans etc, I’d also love some advice on taking it up a little so it’s slightly more formal or put together ... especially when going somewhere after work. Thanks!", "edenapplet": "From one Dani to another, I’ve lost my confidence since gaining weight and I just want to look like an autumnal goddess! ❤️", "elljwint": "I just can’t get jeans right, I seem to always have mega thighs and a muffin top in any style no matter the size 🤣🙈 I only have about a 26inch inside leg, a huge bottom and a wonderful mum belly. Please find me some jeans! X", "missnatashaterry": "What an awesome giveaway 🌈 I need to win this, neeeeed!!!! I had my 2nd baby nearly a year ago and I’m getting married in 2020 (yes you’re invited, @daniellevanier) I’ve lost the baby weight and starting to feel confident again. I love all your looks and would love to get back into the fashion game - especially after being pregnant for most of last year! 🤞🏼✨🤞🏼", "mrszchilds": "@daniellevanier my little girl is 2 and since having her I've had no time to myself and any money I do have I spend on her... obviously! I really struggle with what suits me and I don't know what to wear for my body and my post baby body!! I'd love to be able to look amazing especially as she's starting nursery soon and don't want to be a frumpy mummy... Thank you 💜💜", "tasha.dunham": "I’m going on a family cruise next month to celebrate graduating this year and my parents 30th wedding anniversary. Im worried because I have no idea where to start with swimwear. I haven’t owned any for the best part of 10 years and I now feel confident enough to rock it again but need pointing in the right direction. We also have formal evening dining on the cruise and I would love to find a formal outfit that suits my body. I don’t often wear dresses but would love to find either a beautiful and unusual dress or suave suit (like green velvet or something different) to feel amazing in. Sending all my love and positive vibes to you 💖💖💖💖💖", "charlottesavagemakeup": "As an MUA and a plus size girly I pretty much live in black my whole life. But I want to invite colour and pattern in my day to day! I’d like the person I am on the outside to reflect who I am on the inside. I want to take some fashion risks! ✊ xx", "kellbellsadventure": "My biggest problem is I hate wearing heels. I’ve a few weddings coming up and would love an outfit for them. Unfortunately I won’t be able to get the 28th of August but would love this next time.", "lottieloveshercurves": "Hey lovely 😘 I would love to have help getting myself styled for my friends wedding at the end of September! This is the first time that I haven’t been a bridesmaid for one of my close friends weddings its my close friend of 10 years and I’m sooo excited to wear whatever I want 😍however I am the fat friend out of all of them and for once I want to feel really good and confident and want people to say wow! Please help I would be so excited to meet you also 😊😘 plus I NEED to have my also fave tipple of aperol spritz with London’s finest connoisseur @daniellevanier 💕🧡🍹❤️😊😍😘", "lookbackandlaugh": "I like to try and stand out with my fashion sense but being a bigger girl I get quite self conscious about standing out too much and working in fashion I want to keep it creative but also stylish. also I’m a fan of mainly dresses and want something to make me look smart but creative and fun! Arty chic! I always come to your insta for ideas how to mix it up but still am lacking with putting together a complete look! 💖", "justinethompson92": "After loosing 4 and half stone I have no clue on what to wear or what my shape is what to show off! Desperate to get out of jeans and baggy jumpers!", "janelevans": "I have been trying to make a real effort to be fitter and healthier this year, not going to lie it’s been a struggle but as a result I’ve lost three dress sizes. I’m still no twig but having been used to wearing the same clothes for years I now feel a lot more confident in myself but have no idea where to start in finding a style for the new me and I really want to get out there and enjoy wearing clothes again instead of always reaching for the black and stretchy!!! 💕", "kmariee85": "I have recently split up with my partner and need a style makeover, something that doesn’t consist of PJ’s and housecoats. something I can wear on a date which is glam but comfortable x", "katieemma33": "Hi Danielle, I would love to be shown how I could take a dress and wear it in a casual way but then just change a few accessories and really dress it up. I have never been able to switch from work to evening drinks with ease and would love to have the \"know how\". I love your posts and the amount of confidence you have and, based on some of your previous posts, I finally had the confidence to wear a bikini on my honeymoon this year 💛 thank you, and fingers crossed for all who have entered xXx", "charlottenewellpr": "I ♥️ M&S and have loved following your style journey! From #sofachat to our shared love of aperol, it would be lovely to meet you and to get my curves styled! I’ve always struggled finding a good pair of jeans, it would be amazing to get your help 👍🏻thank you for the opportunity!", "csbadgery": "Wish I was available on the 28th! Good luck to everyone and please share your advice as there are a few issues I identify with posted in comments!! Great opportunity thanks @marksandspencer", "saraalicejefferson": "I love culottes, I have 2 pairs in the wardrobe that i constantly try on and can never seem to style right, help me! They just sit in my wardrobe crying out to be worn and I can then weeping to be freed to the outside world", "bluebelle_bish": "You look amaaaazing! I realise that’s not the point of this, but you do!", "gam_pounds": "Hey Dani!! So I recently turned 30 and swore to myself I’d embrace my body, mind and soul! No more pondering what everyone else thinks I should wear or what I think people would like me to wear. I did EXACTLY that! I then got married last month to my fantastic husband and I felt FABULOUS on my wedding day. We’ve got our honeymoon booked in October and we’re jetting off to Zante in Greece. I would LOVE LOVE LOVE some ideas for some gorgeous pieces! I’ve come to embrace every bit of myself but would love to try something new. I have my good and day days with my wardrobe but would love some hints and tips on how to try new things! I’d particularly love to put a Greek outfit together for our honeymoon! 🧡☀️🥂", "milliemils705": "How do I dress casual? I'm either a total slob or glammed up, either for the office or going out... Where's the middle ground?", "retro_annie": "What a fantastic prize! Would love to spend the day with you and M&S. I am always looking for style inspiration and know what I can wear and what I can’t! I often see cute tops, bottoms etc but if I put an outfit together in my head more often than not it looks like a dogs dinner when i actually try it on!", "evelynkeryova": "I struggle with jeans! I know, that is probably very unusual! I am plus size and I usually wear black tight jeans or jeggings because I just cannot wear the regular blue ones! I just do not like how it looks like on me especially in the upper parts (if you know what I mean). Maybe you have some ideas how to pick the right ones or how to wear jeans in style? 🤷‍♀️ Other than that I love wearing everything, crazy colours, different prints and patterns and I am #bodypositive ❤️❤️❤️❤️ hope to spend a day with you", "georgiebbbbb": "After having my c section I have a new mum pouch that I’m sporting.. I love that you always rock the bold prints and look amazing! Would love a well structured outfit by Danie to flatter my new figure! 💘🎉", "clairehilly243": "My work has changed our dress code policy from smart to smart casual & im struggling to find a balance between the 2! Help me @daniellevanier & @marksandspencer !", "ionadavis": "I haven't worn a pair of proper trousers in 10 years and I starting to think that's silly...", "francessca_olivia": "I really struggle with finding dresses that fit both my hips and boobs as both really big and would LOVE to know how to dress for both, what a wonderful competition 😇❤️ x", "arrie_1991": "Since having my little boy my body shape has completely changed and I’m really struggling to find a style and shape that suits my body I have a wedding coming up and I just can’t find the right outfit without looking like I’m wearing a sack! Would love to have your help in finding something that I feel confident and comfortable in ❤️ plus I’m a massive fan of your style! XXXX", "fortyfiftyfitty": "😭😭😭 I’m on holiday next week. Hopefully you’ll be lovely and do another one next year - just in time for my daughters Uni graduation 😜", "themakingofmartha": "How do you look so effortlessly stylish on holiday? I tend to get stuck wearing the same shorts and tshirt or play suit every year. I’m going to Thailand with my partner in October and would love to find something to wear on date night that is stylish but doesn’t make me too hot. I’d love to meet you and get some tips 💙", "the_girl_who_draws_things": "I’d really like help to find a dress for a wedding I’ll be attending in November that’s flattering and I don’t feel self conscious wearing", "laurabenjafield": "I’ve got an autumn wedding coming up with many a glamorous person in attendance. I am not one of the aforementioned glamorous people. I would love to have you help me find the perfect thing to wear that doesn’t make me hate the sight of my stomach and or arms in it. Many thanks and much love x", "socialmediatrix": "Oh to hang with you would be a DREAM especially the Percy Pigs! I think my style query is ways to wear dresses and skirts without feeling overly feminine - my style is quite androgynous and I quite want to find ways to bring a more masculine twist to a traditionally girly look!", "itskeziahhh": "My arms and stomach are my most ‘trouble’ areas! I would love you to help me celebrate my chub and makr me feel comfortable in clothing for once. I would love to just find some cute casj smart clothes that I could wear in the evenings for a drink or whatever with my friends", "mskarinae": "I really struggle with casual trendy outfits, like I’m either dressed up or like in a simple dress. I love the look of jeans and a t-shirt that’s trendy at the moment but I’m not really sure how to interpret that onto a plus size body without feeling sloppy. I think if I feel to casual I look sloppy, which may be a mindset I need to get out of but I’m sure theres a way of styling I’m just not getting", "babushkajones": "Would love to know how to style my big bum, large belly and no boobs combo body!", "cocopintura": "I am so excited about this competition!!! I cannot seem to be able to style bodysuits so would be happy to have some help!", "lindsaychadburn": "I’d love to be able to pull off a white look like you do so well but I feel like I never get it quite right. I have struggled for years to find my style and still do so a gorgeous white styling by you the fabulousness u are that would be amazing!!!!", "belladaviesheard": "I would LOVE to better understand how to wear trousers, which styles suit me and how to work it with a big bum and short legs as I find it incredibly hard to know what looks good and how to put it all together! Love @marksandspencerfashionpr trousers but don’t seem to be able to get it right ❤️", "maha1991": "Beautiful", "emmylauren_": "My fashion query is that I’m searching for outfits to wear to my trip to India this October. I need something stylish, that’s respectful and modest (I’ll be visiting temples etc), flattering to my size and shape, and lightweight in the heat. A tough feat right? I’m struggling and I need your help! 💖", "what_claire_did_next": "@daniellevanier I’m constantly in my work uniform, I struggle to find an everyday style that suits me outside of the midwife scrubs! HELP! X", "helsmcp": "I would like to add some jazz in my autumn wardrobe that isn’t my usual black polo neck and high waisted jeans combo! Some sparkle or some print that I can wear on a day to day basis!! 💫🖤", "marydale84": "Hey I’ve always felt dowdy in classic work wear, and my work have recently stopped us wearing any kind of jeans but I end up hiding in black trousers and shapeless black tops because I’m not confident enough to wear fashion outfits to work. I love the paper bag trouser look or wide leg trousers with bright stylish shirts but don’t know what would suit me! I’ve recently taken on a new role which I’m loving but need to be smart and confident and need to be helped to be pushed out my comfort zone in a good way!! Please help me! xxx", "mrs.jenny.g": "Anything glam. I have never felt glam or sexy all my life and would love for you to make me feel that way. (Or something close to it anyway!) x", "amyelliot31": "I’ve never really had the confidence to wear a dress without tights or leggings unless it’s ankle length! I would love to find something that I can dare to bare!! 😊x", "sarahmarigold": "Hi Dani, im stuck in a style rut of jeggings and baggy top/ shirt since having my daughter 3 years ago I’m just not as body confident as I was, had my son 12 weeks ago and already fallen back into the same old uniform! I’m a size 14/16 and 5 ft 2, I would love to be styled in a jumpsuit as I’ve never found one that suits my weight and height! ❤️", "whatkatysaid": "I carry most of my weight on my back and stomach. Because of this I struggle to wear alot of things. I want the confidence I tuck items of clothes in trousers but feel conscious due to my gut and or back fat. How do you overcome the parts of your body you dislike? ❤️", "ninabeena999": "I am desperate for outfit ideas for work especially with autumn fast approaching! I have to be smart but comfy as on my feet a lot! It needs to see me through day to evening as work shifts so can get chilly if on a late. I really need your help @daniellevanier ❤️❤️❤️❤️❤️", "louisenmartin": "I fly to Miami to attend (and officiate!!!) my brothers wedding in 4 weeks and I have no clue what to wear! Help!", "lifewithlinzi": "I really struggle with easy day to day looks that are suitable for running around after 3 children but also keep me feeling like \"Linzi\" rather than \"just mum\". I'd love help finding the perfect casual look. P.s you look so beautiful here ❤", "bryoneycook": "I was recently diagnosed with PCOS after an 18 year fight to get a diagnosis and the symptoms, including facial hair, some major pain and really severe PMS symptoms are worsening. My confidence had plummeted to non existent, and I no longer feel myself, I feel frumpy and sad. I see nice things to buy but not having that confidence is making it hard to have style. I also have a vbo but a tiny bust so often struggle to work out how to flaunt my best bits (whatever they are?!). Please help me find my style mojo, and who I am again! I have a dinner date with the fiance at a fancy restaurant soon and I haven't a clue what to wear. I want to work to bring back that confident woman I once was! x", "miss_gorman_": "Yass! What a brilliant competition 😉 would love some tips on the best way to rock a dress and trainers sort of combo. I have a small chest and waist and would love to learn how to dress to flatter that feature 🌟💃", "mooopa_molly": "How do you style trousers for an everyday look? Ps, I think you’re the bees knees! Love ya insta stories!", "jardinelife": "I am the queen of comfy and dressing down mostly in black.. now a mum of two I’d like to look a little more put together and not like I’ve been pulled out from under a rock.. I want to be know how to put together an outfit that’s comfy but chic and classy too that doesn’t involve trainers...although never turn my back on that crep life !!!!", "blacktype77": "I’m presenting at a big meeting in the USA in October. I work in IT which is so male dominated and casual (shorts and flip flops in December 🙄) that I’ve forgotten how to look business like! Help me make an impression, exude confidence and feel I can hold my own with the rest of my (all male) team. I’m thinking trousers but I struggle to get them to suit/ fit me so would love your help", "ionis_journery": "I want to mix up my style cause all I seem to wear is leggings and a top all the time and I have no idea what I can wear different and look nice", "claire__goodwin": "I’d love some more ideas on casual and cool 😎 clothing. Something for evenings and weekends that’s practical but a little more than a grey top and jeans. Can you help? 🤷‍♀️", "immybawdon": "Hi Dani, absolutely love your dress here! I’ve just opened my own little café, and struggling picking stuff to wear! Love the vintage and classic style but don’t know what to pick 🙈 I need help!xx", "sa11yjw": "Going back to work after maternity leave in a few weeks.... Haven't lost the baby weight, infact it's not even baby weight it's I like to eat food and drink wine ALOT weight but anyway.... To be fair I look like a total bag of knackers so if I could find something to stop me looking like a bag of knackers when I go back it would be amaze balls!! I live in leggings and drool over beautiful dresses!!!", "englandkirstie": "Would love this. I struggle with my weight and always end up wearing baggy or poor fitting clothes. Would love help with day to day wear. Smart casual", "la_sunlight": "Danie! M and S! Help me! (pretty please 😁) I have been stuck in Mum mode for eight years now and my wardrobe is getting more, and more....dull and practical. I think, I'm using being a mum as an excuse, when actually it's my self confidence. I'd love to look in the mirror and feel fabulous, hell even a bit sassy and fashionable. Would love to meet you and join you xxx", "carameline84": "I’ve recently lost a lot of weight (10stone!) and have therefore taken on a body that I’ve never been used to before. I’m the girl who was a size 16 in yr 7! I’d love some advice on styling my new self and maybe give me some ideas of alternative styles I’ve never considered!", "lucyfrancis23": "Hi Dani, I've got a friend's birthday party coming up but not sure what to wear , it would be really nice to get style tips or have u style me for the occasion cheers 😊", "sam_elliott_culture": "Hello, I work for a Museum and we are due to launch our brand new Egyptian galleries on the 21st September. I am struggling to find an outfit that’s smart, classy and reflects the cultural and creative sector I work in. I would really like pockets too as I will be snapping with my phone so it needs to be close to hand. Have bought a few things but nothing is 100% . Hope you can help - I use M&S lots too", "caroline_louise": "Oh wow!!!! I would like some guidance on how to dress to my body shape and with what works for me. I would also like to be able to step away from the ‘safe’ black wardrobe and add more colour. Plus...learning what would be good for me to have as regular ‘staples’ that I can dress up and down would be awesome!! @daniellevanier pls pick me as we could double up and have a style day followed by one too many aperol’s! Plus we both rock a Mikayela Lyons necklace.... just saying 😜 😘😘😘", "laurafletcher1975": "@daniellevanier I have a very rare week off from my disabled son that week so, YASS I'm free and would love to travel down. My biggest fear is showing my legs, I only wear skirts/dresses if they're maxi length or in winter so i can wear thick black tights as i have varicose veins! I'm visiting my hubby who works in Liverpool whilst I'm free so he's promised me nights out while I'm there also going to my first festival on Sat 1st Sept so could do with help there! Love you! Lx 😘🖤🖤🖤", "lyric_jazz_me": "Ohhhhh my, this is EXACTLY what I need. I’m 34 and STILL don’t know how to dress for my shape. I’m a mum of two so dress for comfort but just feel like a frump. I’m trying so hard to accept my body as it is, so I don’t want to cover it! I need a confidence sooo bad (thanks narcissistic ex husband 🙄) xx", "zazzle88": "I really want to be able to wear jumpsuits but I struggle so badly to put together a kickass outfit that looks cool and fits well. Would love some help with that one!!", "lillymaydry": "I really liked your post on the recommended basics for our wardrobes! I loved your choices but sometimes have difficulties in finding these clothes in real life and if I do, they can often look frumpy on me. I like my clothes to transition between work (teaching) and weekends and I would love your help in looking more elegant and effortless.", "alexandralibby": "id love to know how to style literally any other trouser that isnt a skinny jean🙄 culottes flares patterned trousers any of them! i feel like my legs are so little but big and everything just makes them look 10x bigger im so stuck in a funk of black on black and getting sweaty knees from skinnies needs to stop x", "cbirdy485": "I would love a day styling! I would love a night out look that would make me stand out from the crowd. @daniellevanier I love your attention to detail. I tend to stick with jeans and tops at night/weekends. This season has been hard for me as I’ve not felt comfortable in whatever I wear.", "katelyngreatlyn": "Hi Dani, this would be the dream! I'm a London based mom who needs help finding appropriate work stuff (smart casual) that makes me feel confident and put together but I can do nursery runs in! Also mega Percy pig fan 😍 😍 xxx", "roisins247": "Oooh would love to win this. Its my 30th Birthday Party on Aug 31st and I would love to wear something super glam and start off my 30s the right way. Im a short pudding and curvy so sometimes find it hard to pull of the really nice trousers because I have to get them taken up miles. Love your style x", "amf93": "My style query is about trousers. I'd really love to wear more tailored trousers but I'm not really sure how to style them without looking like I'm working in the office all day! That and duster jackets, I always feel like I can't pull them off but would love to wear one as part of an outfit!", "lindsaaaayyyy": "So delighted to see you work with M&S. I've worked for them for a long time and love seeing these pieces on a plus size body styled to perfection! 👌", "museinthemaking": "I'm pretty comfortable in my style but I always feel the need to be in heels to look dressed up/professional...I'd love to be able to feel great at work but not have to rely on heels...I need to strike the balance between rocking pencil skirts and crop tops or looking like I've rolled out the gym! @daniellevanier help!", "emma.get.moving": "Colour! I constantly head back to black and blue...how to get some brightness and colour in my life!", "lambleyy": "Holla! I’d love you to help style my very peachy rear!! I’m always so aware of it and I’d love to actually embrace it!!! I’m so conscious of it being too in your face, but following you and other lovely plus sized ladies has helped me to start to love my body.... I just need help styling myself!! 😇😘 xox", "curvynounzie": "Ah I wish I could enter! 😱💗 You look amazing btw! Saw your dress online and loved the navy one. Good luck to the lovelies", "roshanpns983": "So nice pic🌹💞💞💞💞🌹", "kayproudmore": "heya what an amazing opportunity my style query is dressing for a night out and venturing away from my usual jeans and nice top ive got my brothers birthday party in october and i would love to try and pull off something a bit more glam and maybe even colourful i i tend to stick to my mum uniform day to day so would love to feel a bit more dressed up than usual 🍀good luck everyone x", "jstradling": "I’m 55 and curvy and would love advice on an outfit that could take me from work to a night out in early autumn... I like to look fashionable but dread looking like mutton!", "bethany.c.caldwell": "I am dying for a good leather moto jacket look! (PS it’s my birthday on the 30th. I’m from Canada and this is my first birthday away from home so this would be the BEST gift!!) 🤞🏼🤞🏼", "stylehasnosize_official": "This car!!! 😍 #oldcarlover", "aimes_w_uk": "😍 exciting!! I have my honeymoon coming up soon and finding something to wear and look amazing in would be fabulous!!! X", "fromdonnawithluv": "I would like help getting my mojo back as I seem to be stuck I a complete style rut. I always see you looking fabulous and wonder if I could pull it off x", "hey_neenshc": "Hell to the yes, what a brill giveaway! Randomly I have the 28th booked off already so I’m good to go 🤓🤓 If only it was a struggle for a single event! I’d love to be able to rock a pair of trousers, but I seem to be stuck when finding a pair that can cope with my thunder thighs. I LOVE denim, but denim does not love me. So help with trousers and denim would be amazing. 👖👖👖", "georgina_eva": "Eekk okay! Well I wouldn’t say no to an all pink, penny pig look! Haha 😜 I would love to feel confident in some bold colours and patterns on my legs, have mastered the patterned top and dresses but trousers and skirts are always so awkward! I’m a large figure and adore showing my cleavage but drawing the attention elsewhere every so often would be a great skill to learn. 😄😍", "becky_smith_photography": "@daniellevanier Help! I feel like a frumpy mum, I've recently lost 3 stone's in weight and I don't have a fashionable bone in my body! I'd love to win this and I'm in London for my wedding anniversary which is the 29th ❤", "wordsandmd": "Hey Aunty Daddy! 🤗🤗🤗 wish I was in London to meet you! Good luck everyone!", "sineadvh87": "I really admire your confidence & how comfortable you are in yourself. It's nice to see somebody believing in their own kind of beautiful ❤️ I'm off to Dubai and need some inspiration for holiday outfit and being nearly 6ft it's hard to always find trendy trousers that fit well so it would be great if you could help! Good luck to everyone else too xx", "georgie_t29": "This would be amazing! Also the day before my birthday! I would love for you to make me feel comfortable in swimwear,i’m bigger than my friends and always feel self concious in it 🤦🏼‍♀️ xx", "charley8x3x1": "I can always make an outfit work for going ‘out out’ and mainly ‘smart casual’ too if it involves dresses or skirts! I completely fall apart when trying to work jeans or trousers into an outfit for either occasions x I would really love o find that perfect fit pair of jeans or some really on trend or classic trousers which can be styled up or down! Any help would be appreciated xx", "louleeg": "Ohhhhhhh what an opportunity! I would love this! I have a big issue with having hardly any boobs but have ALL the tum and arse! I would love your styling to make me look utterly gorgeous. Ohhhhhhh what a fabbo thing to do xxx", "beckyannbarber": "Wow, I'd love to know how to style a for work, I've have been promoted and want to look stylish while suites and booted! This is finally a competition I could take part in during the summer holidays!", "themaryjones": "OMG I would LOVE this!!! As a working mum whose now the wrong side of *ahem* 35 I just feel like I look rubbish in everything. Am trying to step out of my comfort zone of jeans & a T and try things like nice dresses (have just ordered the one you’re wearing in the above pic) but always feel like they just don’t look right on me. I’ve ballooned in size over the years so my confidence is pretty low. Would love to know what styles/colours best work for me and finally have the confidence to look in what I wear before the BIG bday next year x", "sugarchips21": "I’m 40 on Sunday and going back to work next week after 4 months off sick. I would love some help with my new work wardrobe so I can feel good going back. Thank you! ❤️🌈", "franchesca_mcdermott": "Hi Dani, I love love your style and you always look so amazing! I feel like I’m stuck in a black leggings rut ! Would love to either be styled to wear more long skirts but would appreciate any fashion advice from you & love M & S 💜 what a great competition xx", "heathereighty": "I’m 38 and trying my hand at online dating. I have a coffee first date next week during the day. I’m size 22 and I’m so prone to hiding behind black clothes. I’m just not body confident. I’ve no idea what to wear. I love this dress! I’d probably end up trying to hide my legs with black opaque tights though! Argh.", "rebeccalillian_": "It’s mine and my partners one year next month and we want do something really special for it. We’ve both had abit of a shitty year and that has really knocked my self confidence down. I would love to have you style me in something to wear, I have a bigger bust and it’s hard for me to find something to look nice! It would be so lovely to get some style tips from you! I love your fashion and you look amazing in everything you wear. Fingers crossed 🙊❤️", "kaye436": "This is such a fab prize! I have my friends wedding in November and looking for a lovely outfit! You always look so beautiful and confident in everything you wear. I would love to feel more comfortable wearing strips one thing I would always avoid as always feel it doesn’t suit! Fingers crossed I get you meet you ❤️😘🤗 xxxx", "becka29_d": "I never know what are the best tops/ shirts or even dress are to wear with my larger chest! Everyday is a new event! Would love some tips and advice! Tons of love xxxx", "sandralaw99": "I would nothing better than u styling me for work I always struggle to try and see what suits and it’s becoming a nightmare to shop please pick me I love ur style .... have I grovelled enough lol", "tinpanally": "This would be fantastic! My wardrobe is so pedestrian - would love to know what to wear to work and still look like me!", "jackiek35": "I'm constantly in black and I need some colour injection..I'm afraid to stand out from the crowd as my confidence took a big knock when I got sick..so I'd love some advise on colour and different styles for my shape..", "carolinebeec": "I’d love to know how to wear layers while looking put together and not like I’ve just piled everything on that Ive found in my wardrobe. Especially with autumn coming. Xxx", "leannec87": "I’m a new mum and would have to ask what could I wear that is practical without being too “mumsy!” With my new body shape, there’s not too much I feel comfy in now and all I tend to wear now is a dress and leggings xx", "selfcarequeen_": "Hi Dani. I always seem to wear leggings and a top, because I’m insecure about my tummy. I’m a UK size 16, and I want to be more adventurous with what I wear. My body sometimes makes me feel low/depressed. I want to celebrate it, but need more help! Xx", "molthorpe": "I’m currently stuck in a rut of wearing the same culottes and or t shirt dress everyday in and out as I’ve lost a bit of confidence in myself recently. Would love to get back into some jeans/trousers and maybe some jumpsuits (especially with colour!!!) but at the mo I’m just worried about VBO- need some style advice and a bit of a confidence boost!!! 💓", "baileytiafern": "I'd LOVE ideas of office wear, I work in an office and at the moment it's casual wear until September, I need office ideas plssssss!! Ps love ya 💗", "em_ski84": "Fab competition! I can never nail smart casual 🙈 I've got a rather large bottom that if I cover I feel I look frumpy and short but if I have a shorter style top I'm massively self conscious. I don't ever feel comfortable really , unless I'm in my work tunic and black trousers X", "miriamawada1983": "Hi Dani, I'm stuck in a style rut. It's always the same sort of look I go for, mostly black to be honest. I'm so bored and sick of everything and just don't have the inclination to bother anymore. You are such a style inspiration, but I need to find my style again. Any help you can give me would be greatly appreciated! Lots of love. Xx", "victorian_don": "In two weeks, I take up the post of 'acting assistant head' in my school -note 'acting' lol I need to IMPRESS! As a class teacher, I don't think a day has gone by when I haven't worn black leggings! I'd love to wear dresses with NO LEGGINGS! Please help Danielle! Oh and I love Percy Pigs! x", "healo": "So I have my sons baptism next month and I love to stand out. But really want to do so, but obviously be respectful to the event. I also want to cover top of my arms as I am having a thing with them at the min. So yeah, something that’s pow, but comfortable. Colourful, yet modest and covers my arms. Help.....also I could do with a mummy break and have some fizz hha x", "hannah_rb93": "Every time I see a picture of babes in high waisted trousers/pencil skirts etc I think “damn she’s buff” but I’m too scared to commit and wear them cos of my fanopy (fanny canopy) or VBO if ya like. I want the confidence to get my fanopy out for the world to see and be like “hey, look at me, I’m fat and I’m sexual and here is my fanny canopy”", "theadventuresof_felicity": "Jeans - I only seem to wear jeggings at the moment out of fear of proper fitting jeans. Then the inevitable baggy knees start. I don’t have a specific occasion! Just life 💛", "kerry1803": "Oh I wish I could enter this but too poorly to travel at the moment 😭. Good luck ladies this sounds like such an amazing prize!! x", "sophiablack_": "Yasssss Queen. People are always surprised when I say my outfit is from M&S but I love their stuff! Anyway, I always have an issue getting clothes to fit over my large hips and for that reason I never EVER wear trousers. Always in a skirt or dress. Don’t even own a pair of jeans... can you believe that!? I always feel over dressed for occasions because I always wear a dress so would love to learn the right style and shape of trousers to fit me. Can go casual or smart then! Would love your help ❤️", "zriva24": "Hi Dani, I absolutely love your style. I’ve been shopping and tried in so many jumpsuits, in so many different styles and I just can’t find any that I feel comfortable in. I feel like a giant baby in a romper suit, yet everybody else looks so stylish in them! I need your help!!!! I’ll bring Aperol?? 🍹🍹xxxx", "bally_hayer": "Hi, I have a big bust .I want to wear the off the shoulder tops (Bardot style) but never have the confidence and found the right bra. Sat it my birthday and the 14th Sept is my son we are going to FriendsFest.Love to wear a top .Please help", "alexross_19": "Love your style , completely out of my comfort zone but you always pull it off. Recently put on weight after a back operation and need holiday clothes ! Always a struggle and rarely feel comfortable in swimwear or a small amount of clothing ! Going to Morocco in October 👙 - and would bloody love to meet you and crack up in person, rather than over my phone screen 😂", "kimmy032": "I’m starting a new job in September and only ever been provided with a uniform! Can you help me with some workwear inspo please? 😁 x", "itismarg": "Goshhh wish I lived closer. Good luck to anyone who will enter!", "ditadeluxe": "This is so exciting!! My style query is how to incorporate skirts or anything other than jeans into everyday wear! Love you ❤️❤️", "stefascope": "Hello. I’m plus sized and a primary school teacher. I’m on the management team and need to look professional but also want to look classy and put my own spin on things. Outside of work I’m pretty adventurous and would like this to overlap into work mode. I’m bored of dress and boots combo. Any advice or help would be welcomed x", "jellywtbelly": "Such an amazing opportunity I eekkked out loud ☺️ so I think I managed to pull off dresses pretty well and I never feel conscious when wearing them. However I struggle with just about everything else and feel awkward and uncomfortable 😣 I’d love to feel comfortable wearing trousers or a shirt or basically anything else 🙏🏼 thanks so much and good luck everyone 🍀", "mrskatiekoo85": "I’m so gutted I can’t enter😭 I’m moving to Walthamstow that day. I’d love to hang out with you. Bugger bugger bugger xx", "francesca.espinosa.baster": "I would love to feel confident wearing colours specifically prints & patterns without looking like a hot mess & drawing further attention to my stomach! Also would just be super cool to hang out with you & have a drink whilst having sofa chats in the M & S PR room haha", "staceylouisebrink": "I'd really like to feel more comfortable in t-shirts and also skirts. Id like to find some more on tend plus wear clothes I always feel quire formal x", "mrsdeftangel": "I had baby no. 2 10 weeks ago and everything is out of place! My mum is 60 in 6 weeks and shedding the baby weight isn’t happening. I’d love to look like a yummy Mummy for her party! (Not the baggy top & jean shorts wearing mum of two I’ve become) x", "mrs_quai": "My husband is in the raf and going away for 3 months in September , we have his Christmas ball when he gets back and I need something amazing to wear ❤️xx", "kayby88": "I have pretty big boobs and I feel that certain styles that I love and would like to wear often look ‘frumpy’ because of this. I don’t dislike them and would love to know how to dress them better in general! Please help! 🤞", "laranotcroft": "This is AMAZING! I'd love your help. I'm bloody 41 years old, size 22-24 and still have zero idea of what suits me. You always look so incredible so this would be an incredible opportunity 🤞🏼🤞🏼🤞🏼", "_ktsmth": "Argh Tuesday is my birthday but I’m back at college for my last lot of prep for the next 3 ACA exams! Absolutely gutted because I would’ve LOVED this - I think you’re bloody fabulous and would’ve loved to pick your brain about lots of different bits (very self conscious about my arms and legs to the point where I live in (at least) knee length dresses and cardis even if it’s 50 degrees and don’t own a single pair of trousers!), and obv would’ve scoffed all of the Percy pigs in the process. Hope you and the 3 lovelies have a brilliant time, fingers crossed you do something like this again soon xx", "anothertattooedbaker": "Hey Danie...sooo... I am meant to dress in 'formal wear' for work and have spent the past 3 years avoiding wearing trousers because I can't find anything that makes me feel incredibly self aware of my hips and junk I got crammed in my trunk... I would LOVE to feel 'smart' and chic at work or out of work... just too scared to know where to start looking. My trouser size can range from a 20+, depending on the shop. Help me? I'll bring Aperol? 😁", "victorialearmonth": "I always struggle with round neck or high neck tops due to a larger bust! So would love some help with that - also, I shy away from colour, when I really want to wear it!", "jo_rolstone21": "I would love your help @daniellevanier I got to Dubai in September for friends birthday. The colour theme is black/red dressy and I have nothing to wear so far. I’m conscious of my stomach and don’t know what style to go for ❤️"}