{"wendyk70": "Much love, get well soon xxx", "is_this_katie": "Sending love 💜", "charleyvanpurpz": "Salad n chips yeah I got you!!!!!! I love n miss you bum bum!!!!! ❤️❤️", "agemlikenoother": "Sending love 💕 hope you feel better soon xxx", "kayyyciaaa": "Sending you a lot of love and positive vibes, get well soon ❤️❤️", "debabynoov": "❤️", "biggirlslovefashion2": "Sending lots of positive energy your way! 💪🏽💪🏽💪🏽", "runanother": "Praying for you🙏", "francycobo_h": "Get well soon 🙏💕", "stephanietaylorstudio": "Wishing you a steady recovery. How scary! Please post updates when you feel well enough. But take the time you need to heal! ❤️🙏🏼", "maylene99": "❤️❤️❤️❤️", "luisachristie": "Sending you so much love angel! Hope you’re feeling a bit better now and on the mend. Lots of love xxx", "ami.ma.belle.monde": "Loved watching your insta stories. So sad to see you unwell....Hope they can find out the cause of your illness/pain. Get well soon.", "bbwgeneration": "Sending strength and light ✨", "mama22mama22": "Hope you feel so much better really soon girl zx", "lghshortstay": "Hope your feeling better now xxx", "milawears": "💕❤️💕", "cara_louise": "Don’t want to be annoying but I am wishing you the best of luck with your health journey and I really enjoy all your posts from far away in NYC. You are such an inspiration to me!", "tmtsx": "Sending you get well wishes 💐💐💐", "thingymagigi": "@daniellevanier Shouldn’t really be thinking this way but “Salad, Chips and Aperol Spritz” is my kinda slogan tee 👀 #merch", "taillepluscom": "nice place and nice woman!", "stylebyj": "Awww get better lovely lady hugs 💕💕 it’s horrible to get ill when on holiday. Hope you will have quick recovery", "vanessa_nijs": "Amazing, nice shot !!😍", "giovannamenard": "Looking amazing😍😍", "misstachou": "Get well soon 😚", "lucilla28m": "Get well soon!!💪🏻😊", "rivkiestyles": "💕wish you better x", "franniebabij": "I love that dress!!!!", "jobridge_amor": "😍😍😍", "lindamartin92": "Oh no 😩 Get well soon. 💕", "megxico": "im so so sorry you’re going through this 😭 stay strong babes.", "idrisbashir119": "You look excellent and charming", "lesleywrankmorecsi": "💜💜💜Sending lots of love and get well soon xxx", "nicky_reid60": "I’m so sad you have had to go through this darling. Happy Dad is now there to bring you home. Thank goodness for Bobbi being there - an 😇 angel in your time of need. Everything will start to improve from now on - sending do much love 💕 Xxxx", "amandamcq100": "Take care & I hope you have a speedy recovery xx", "zezetteepouse_x": "💕💕💕💕💕💕💕", "mpenger": "❤", "katie_emma_gundogdu": "get well soon 😍", "esmeedeleeuw": "Net de zus van @frranciss toch @thijsberest", "chezboop": "💖💖💖", "boosey1978": "Wishing you a speedy recovery xx", "alexmichaelmay": "My friend in so grateful for the update, we were all so worried! So happy you’re headed back to London and for bob and dad. WE LOVE YOU!!!!!!!!!!", "gabrielegz": "Yeeees babe you look amazing😍", "plussizeapproved": "hope you feel better sooooon!!!", "katherine.hanlon": "Get well soon. Sending you lots and lots of good wishes xxxx", "cooperloves": "Glad your gonna get home! Let me know what hospital your in! I’ll come and see ya and give ya cooper cuddles! Xxx", "carey1069": "Sending prayers🙏🙏🙏 for a speedy recovery. I'm so sorry your trip took a wrong turn but you'll get to do it again. Bobby, you're an amazing friend!!!", "josal79": "Get well soon xox", "nataliemeansnice\nVerified": "Verified", "jess_rolls": "V sending love. Glad you're home and hope you're doing OK. Please message back how you're doing 💓💓💓💓💓", "isabel_hendrix\nVerified": "Verified", "bitz_of_mitz": "I’m sooo glad you’re home and hope you feel better. I can only imagine how horrible you feel. Sending lots of love your way Danie!!😘😊❤️💖❤️💖❤️💖", "monikah1003": "Hope you feel better soon and that you and Bobbi can have a new, muuuch better holiday at a later point ❤️❤️", "tweetypieplans": "Sending loads of love and virtual aperol spritzers 🍹💜🍹💜🍹💜 🍹😘", "jojo011980": "💗", "hannalee1980": "Sending you love 💕", "sarah_.lcy": "Aww so sorry to hear your not well 🤒 sending you a big hug and lots of well wishes. Hope you have a speedy recovery ❤️ xx", "ellisjo": "Big love Dani! How are you doing now the NHS are looking after you? Xxx", "lifewiththeburrows": "Lots of love 💕", "laurensimm0n5": "Get well soon 💕", "leanda_dawn": "Praying for you! So sorry you're going through this. Stay strong!❤❤❤", "camiforero1": "Lots of love from Colombia 🇨🇴, hope you get well soon love! 🙏🏼❤️@daniellevanier", "jenesaisquoithe": "Sending you love and positive vibes. I hope you start feeling better.", "nixiwoo1": "Glad you are back in the uk. Sending all our love xxxxxxxx", "rickyorr": "Sending you so many hugs and kisses and hope you are up and about as soon as possible. 💖", "nesayem": "Hope you will feel better soon! You are so strong! ❤️", "claudiaexplainsitall": "Get well soon gorg 💕", "glamazon2you": "Praying for you 🙏🏽. Feel better.", "gabifresh\nVerified": "Verified", "grsf": "You don’t know me, but I’m thinking of you. ❤️", "chiiizus": "Get well soon Dani ❤️❤️", "danieleinlondon": "Lots of love and get well soon ❤️", "kazzaloulazza": "So sorry to hear you’re so poorly poofoot 😞 You poor thing, your Dad will get things sorted! ❤️❤️", "tessholliday\nVerified": "Verified", "georgiakellybrown": "Sending love gorgeous!! Xx", "allumnicole": "Oh bless u. I hope you feel better soon. 😍😍❤️😀", "alisonbraganza": "Much love and here’s to a speedy recovery 💕", "ellewaggers": "So much love to you. It will be a distant memory one day. Hope you get the proper care here. Thank goodness for bffs and amazingdaddies xxx", "catherinerebeccax": "I’m so sorry, glad you’re home & get better soon 💕", "lyndsay_saunders": "Wishing you a speedy recovery ♥️♥️", "iamqueenfal": "lots of love for a quick recovery! 💖", "anitram6887": "Wishing you a quick recovery love...", "disneymaman": "Sending prayers and positive thoughts!! I hope you get some answers soon and get well!! 🤗🙏🏻🙏🏻", "kersi2112": "wishing you a speedy recovery!🤞🏻Look after yourself & take it easy.💐🍇💞", "dyosamystica": "Awwww! Feel better, @daniellevanier 😘😍", "megxek": "I am so sorry to hear this. Hope you feel better soon!!", "jessandthebandits": "Thinking of you 💜💜", "claire.tex": "Thinking of you Dani! I hope this is all over soon and your recovery is quick!!", "honorcurves": "Sending love ❤️", "rachaelfromthebridge": "Awe I’m sorry 💕", "aashgasm": "You’re got this strong sassy sexy lady!!! Sending prayers and love from America!!! Keep us updated as you undergo treatment in London! ❤️❤️❤️❤️❤️", "feteandflora": "So glad your dad and Bob are with you. You are such a strong woman, I know you will get through this. Glad you are going home ❤️", "wellroundedfashion": "💕💕💕💕", "aayoola": "Anyone know what happened to her to make her this unwell?", "_suzy_": "Oh no. Get well. Sending Love from the States.", "tiagow_84": "Hope you get better soon xxx ❤️", "fashionmeetscurves": "Thinking of you and hoping you start to feel better soon!", "appleshapedheart": "Hope everything goes well. Feel better soon xx", "sharonwetjens": "Get well soon 🌻", "gil.isabela": "Sending you a lot of positive energy, get well soon ❤️", "everyday_veganism": "Really hoping you feel better soon and you can put all of this behind you 🤞✨💕", "travelrarekids": "So glad you are home you will sorted in London. We would never go to Greece as beautiful as it is the healthcare isn’t great and my son has a rare disease. I hope you get well soon.", "daphnekknows": "Just noticed that you are in Paros, the island where my grandma came from 💖", "gracieliciouslou": "Glad you are back on home soil, sending all of the healing vibes x", "ashatalks": "Thinking of you x", "_stacey87": "Get well soon 💖", "emarieburge": "❤️❤️❤️sending you lots of love! Hopefully now you can get it all sorted out and be a bit more comfortable.", "antlife": "Hope you feel better soon!! Sending best wishes!", "katkit_24": "💜💜💜 absolutely adore you and Bobbi so sad to hear your trips been a mare! Get better soon!", "lovebeyondstars2015": "Sending you all the love for a successful surgery (or maybe NOT--British doctors are excellent so perhaps you'll get a different diagnosis). 💜❤️💜❤️Bless your Dad for rescuing you.", "luciajac": "❤️❤️❤️", "tamron_little": "🙏🏼🙏🏼", "karens.insta": "I’m so sorry you’re going through all this! Thank goodness you had sweet Bobbi there and now your awesome dad has come to save the day! Keeping you in my thoughts and prayers. Sending love and hugs. Get well soon! 🙏🏻❤️", "macl333": "Lots of love !!!", "leannegreygoose": "Sending much love so sorry that your holiday turned out this way, we are all relieved that you are coming home safe, praying you have a speedy recovery and will be back to your bubbly self ASAP 🤞🏼🙏xxxx", "tracy_shirley": "Hope u get sorted soon.xx", "princesshollielou": "Sending so much love 💖❤️🙌", "allaboutlisad": "Wishing you a speedy recovery! Worst vacation EVAH! (Said w a Brooklyn accent)", "rianne_ward": "❤", "aproposofabsolutelynothing": "Hang in there and sending you get well vibes for a speedy recovery ❤️"}