{"daniellevanier\nVerified": "Verified", "mrsdeaks88": "How lovely of you 😍 Merry Christmas to one of my favourite insta girls xx", "tmtsx": "What a lovely message💞merry Christmas to you😘🎄", "moondustbynia": "You literally are the best human @daniellevanier so glad I've had the pleasure of meeting you 💜 merry Christmas to you 🎄 xx", "onyxzen18": "heart. I had help from my cat Luke.😻 I hope you have had a wonderful Christmas!", "sheedaaaaaaaxo": "Aww that is so sweet! I hope everyone had a merry Christmas!", "mollielucpicard": "That's so sweet of you! <3", "isa_la_dingue": "X Merry xmas merci 🎄🎅🎉", "himynameishollie": "You're so kind @daniellevanier absolute idol", "lucycarlyon01": "I didn't see this yesterday @daniellevanier but you truly are one of the best people I know/social media stalk and talk about like she's a friend 😍", "instachamalam": "You're a doll! All the best in the New Year.", "sowhatimadiva": "That's so lovely of you @daniellevanier ♥ Merry Christmas, love ☆", "belladaviesheard": "I saw this a couple of days ago and just thought what a beautiful, beautiful soul. Merry Christmas xxx", "nastaranmarie": "❤️", "harri_golightly": "So pretty", "larakingdraws": "Loveeee the spaghetti strap/ top combo! 😘", "nataliebou": "You are such a lovely person x", "_areweawake": "That's such a lovely thing to do @daniellevanier. So kind.", "dancelovesingh": "You are so beautiful and such a kind spirit! Happy holidays to you.", "kellouhar\nVerified": "Verified", "geoffreyeleveld": "A very Merry en wonderful Christmas to you and thanks for make de live of anger", "poochiecoutureshow": "@daniellevanier. God. Bless you sweet girl from south florida.love your page.inspiring", "sylvig_igid": "You are gorgeous inside and out. Bless you sweets", "_sarah_hughes": "That's such a kind generous offer. Happy Christmas x", "stefaniestanzione": "Love this xx merry Christmas 🎄", "dr_bebere": "And i forgot the most important : Merry Christmas to you too! ⛄🎄🎆🎁🎊🎄", "macl333": "You r so lovely! Xxx", "jess_rolls": "NYC V NY 🗽👌💕💘 having a lovely one V. Big hug to you and Familia Vanier. Annie Rolls and Jonathan visit for new New Year. Speak soon or get over here!", "rachelll_lynn_": "Aww you are so sweet!!💖", "lolilia33": "@daniellevanier You truly are such a wonderful person. Your friends and family are so lucky to have you in their lives 😚 Merry Christmas to you and your family!", "charlottegygax": "I've read you forever and a day, you are a beyond gorgeous human. This has made my heart burst with joy. I wish you every good thing forever and a day 😘💘🎄 xx", "madamn_jamise": "Oh yeah and you look stunning.. like always.. btw.. CHEERS!", "glamazon2you": "❤️️❤️️❤️️ Happy Holidays.", "gloomologyyy": "This is the kindest thing. You're such a gem. Thank you for being a source of constant inspiration, and in pretty much every conceivable way. Merry Christmas! 🎄💕", "filledudimanche": "So touching...", "neddles_pedals": "@daniellevanier you are the best. Merry Xmas to you and the rest of the fam!", "lilpixieuk": "That's a lovely thing to do, you have a great heart. Hope you are having a Happy Christmas x", "dinca_the_cat": "Happy holidays and Merry Christmas🎄🎄🎄🎁🎁🎁🎉🎉🎉", "curvesncourage": "that is a lovely message. sending big warm hugs to you. x", "rosi230373": "Merry Christmas. Enjoy 🎅🎄👼", "esjelief": "That's so sweet! Merry Xmas babe!", "kris.attard": "You re the sweetest 😘😘 merry Christmas from malta :) xxx", "ems_blonde_ambition": "How beautifully kind of you. Merry Christmas. Xxx", "xhtac": "Merry Christmas Dani! You are the best! 🎄🎁😘🍾", "daisyellenivy": "❤️", "b1j4l": "This is one of the kindest things I've seen/read all day. I needed this today. Especially now. Thank you x", "zedwarlow": "You're just too lovely Danielle 💖merry Christmas x", "cat2082": "Lovely message.. feeling sorry for myself this Xmas 😓been diagnosed with gallstones which has taken my love of going out and eating away from me! This has depressed me no end and has definitely made me feel isolated from the usual christmas joy and festivities this year. Hope you're having a lovely day with your loved ones xx", "anastasia.furrow": "You are truly the sweetest soul Dani! 💖💖💖", "lopro47": "A truly wonderful gift you have offered , I'm sure people will appreciate you and the time it takes. Have a really good day", "junesees": "That is a really lovely thought. Thank you Danielle", "beccabluebonnet": "That's such a kind thing to offer 💖 hope you're having a wonderful holiday!", "sarah_barlow": "Happy Christmas gorge @daniellevanier 🙌🏻🎄✨🌟⭐️💫🌛", "rebekahroy_": "Cheers! 🍸🍸🍸", "bronteeolivia": "Such a lovely lady. You look amazing 🎄🥂", "kelboz": "Bless you that is so lovely x", "sarah_the_colourwitch": "❤❤❤", "bex1605": "Grace not farce xx typo", "womenrisecoaching": "That's so lovely! And such a thoughtful post. Happy Christmas Danielle x", "laurenpops": "Aw so kind 💗💗💗", "miss_maartje": "💙 you are the best", "maieiciodo": "Bless you that's so sweet have a great Christmas Hun", "hidzb": "Such a kind offer. Christmas isn't always a joyous time, whether it's due to work, illness, mental health, grief, or many other things. It's wonderful to know there are thoughtful people out there. Thank you for being you xxx", "venetoula": "pretty velvet!", "hannahbananablog": "How lovely! Needed this 💙 Merry Christmas xxx", "tashaggreen": "Merry Christmas! Your hair looks gorgeous! 💚❤️", "faithmodelling": "This is a beautiful thing you are doing and I hope you continue to have such a great heart. Bless you.", "daniellekgardner": "Love this.", "kittycowell": "💘", "x_sgl": "Such a wonderful thing to do. I've followed for a while and have to say you are a beautiful person, both inside and out. Merry Christmas, to you and yours. Keep being you ❤ xx", "miss.velvet.storm": "Thank you doll. Loved seeing this message between the 'i hope you have fun with your loved ones' messages. ❤ Needed to see this message 💋", "sangrheaaaa": "Aw! How lovely of you! Such a babe! 😘", "laurenaquarius": "You are a beautiful human ✨", "emilyfemmely": "🙌🏻💖😘", "dilbatross": "This is so lovely! ❤ happy Christmas to you and yours 😊 xxx"}