{"blooming_lovely17": "I always say this, so sorry, I always need help with everyday outfits. Nothing fancy, just a nice school mum outfit...but I need 5 days worth lol 😂 xx hope you feel better soon. I know it’s such a struggle x", "travelrarekids": "Styling someone in their 40’s? 😊", "bailyvanb": "I woul love to read styling tips/help from you 😍", "beckymace_": "I bloody love that top.🔥🔥 I love your content, you’re one of the only few I actually watch your stories all the way through. Whether you are posting about life, outfits / things that you are loving. Babes just anything you are ace xo", "danielleprudhoe": "I'd love to see some fashion advice on what to wear to a wedding in the winter. I'm struggling atm to find something and I love your style!", "x.gracey.private": "So stunning😫😫😫😫❤️❤️", "sunnyvonbirch": "Love your fashion inspiration but you also have a fabulous sense of humor mixed with authenticity so whether you share parts of your family or personal life I enjoy your point of view. You also have a lovely speaking voice so more videos on any topic. I believe that you def need to protect your private life but I think you have a great balance so I would enjoy more sofa chats lol 😘", "vanessa_nijs": "Lovely😘", "chrissywg93": "Outfit ideas on a budget would be great.", "kayyyciaaa": "I’d love to see styling tutorials, for example, three ways to wear a certain top, jeans, shoes, jackets, etc. I’m in the middle of revamping my style to look less high school and more adult.", "warriormom_za": "Oh also how you handle life's rollercoaster and negative stuff that comes your way", "magentatossa": "I would love to read styling content from you. Tips and fashion inspiration would be great too! xo", "jeromejohnsonn": "Relationships and Rum", "emmaharrislingerie": "We’re (obviously) more interested in fashion content - the more lingerie/loungewear/sleepwear the better! 😉", "magentawillow": "Autumn and winter styles. All the Leopard print and the gossip on your life please because I'm nosey!", "_stacey87": "I would love to hear more about how you started with blogging/modelling, also an autumn/winter capsule wardrobe would be amaze! @daniellevanier xx", "misha_cosplay": "Wonderful", "sianawestley": "You are actually SO beaut!! Love the shirt too 💛💜", "breynartistry": "Have you done a room tour? Because those videos are weirdly my favorite and I feel like your space is gorgeous", "wonderkat289": "I love how you mix and match new and old pieces. How do you know what to keep and what to toss?", "acaballeroatx": "🌹", "qimzel": "More about how you deal with fibromyalgia.. Bring some awareness!", "adoseoftammy": "Such an inspirational women 👑👑👑👑", "alana_odea": "Would love a series of 'best places to buy....', especially if they are online & ship to NZ 😉", "coffee.and.curls": "Makeup tutorial!!!!!", "ladina_schillig": "I would love a guide for some cute bathing suits! It's quite hard to find something that fits bigger cups than a DD.", "jobridge_amor": "😍pretty", "vivrkrawat": "💞 wow looking beautiful pretty girl🔥", "latailouisa": "Love your apartment decor! More of that pls and dating stories, more fashion and beauty xx hope you feel better soon lovely 💕", "lovebeyondstars2015": "Neighbourhood walk about. Walk out your front door and just narrate. Maybe meet your brother, Bobbi or BumBum on the way. Visit sights in the hood.", "bloobadi.blahbadi": "I love it all, but I think I love your fashion and personal content the most. I hope you are getting what you need and I’m sending all the good things your way. ❤️", "hannahdakin_stevens": "Fashion 💯 🔥", "knippy_knip": "Would like to hear more about how you deal with your illness, the ups & downs, how it affects your work and social life. ❤️", "mdnewm": "Colour and print clash. I love it as a trend and would love to see how you would style it! Or anything to do with hair and getting it nice everyday without spending ages on it", "kellyblade": "How your style has evolved from when you started. Maybe do updates on older posts as to how you'd style similar pieces now? You could so a series of them 😊", "brasilnality": "You look stunningggg😍😍", "jenkettle": "Beauty tips, you always look flawless x", "gigi_burnham89": "Interior for sure!!!", "smarmy.knife": "Stunning 😍", "imkagram": "Also on what kind of laptopbag I could use for my heavy 15” as I feel my bright fjallraven is not always the most professional looking choice but it’s too heavy for my nice leather tote.", "chelcity1": "I would love to read about a few pieces I can buy this fall that will make the biggest impact in my wardrobe + different ways to style those pieces. Hope you’re feeling better!!", "paigejoannaa": "I’d love some autumn style ideas as your style is always perfect! Xx", "hannahrosemarie": "Bita lifestyle, bita styling and a bita personal cos you’re good craic!", "meganowens4109": "I love your style. Any tips you could share would be wonderful. Actually, anything about anything would be good.🤗 How are feeling lovely?💜", "mhightermorgan": "Your confidence. Your openness to sharing your life. Your realness.", "eryninwonderland": "I’m into short form content these days so I love round ups. From random anything-that-catches-your-eye, to the best 5 of one item x. I always end up buying from your links. For video content, love it when you try on on shopping haul at home and talk through what you do and don’t like. And always, always more sofa chat. Hope you’re feeling better!", "wanderlust.juniper": "Review of Ashley Graham’s collab with pretty little thing!! (If you’re into it of course) it looks so pretty but I’m curious on quality!", "v.w.h.m": "I need a make-up tutorial from you ASAP🙌🏾🙌🏾🙌🏾that cat-eye needs to become my trademark!", "laurenpops": "Some detailed candle reviews please 😂", "nic_kinde": "I need some really down to earth makeup tips / tutorials, and I've been waiting for yours!", "chloepierreldn": "Oh shessssss back 💕💕💕💕", "helenaimees": "I loved the detail in your story earlier about colours that would go. That might sound stupid but I hadn’t thought of the suggestions you gave. I love that detailed styling note- it helps me shop wisely and wear what I already own.", "jessicalaurel": "Ahh, I literally had this exact outfit in mind. I have those jeans from Asos and have been looking for a snake print top to pair with it for my next blog post! What are the chances? 😂", "cherrypieni": "Gorgeous! Winter work wear (that isn’t all black) would be amazing. Xmas gift guides that are a bit different/fun, anything really", "veronicas86": "Literally anything babe. I will read it all!! Maybe some more relationship and family stuff, I've fallen in love with your parents and feel like I miss them...😂😂😂", "naomibaxtermua": "Love this shirt! 💗", "claudia_gttz": "That time you were: tell me what you want I will find it for you. So people were like: I need a dress this color this shape and you were like.. here are some links. That was so nice.", "themakeupmaestro": "I’d love a post on some of your statement jewellery", "emmy_chapin": "The old biddy in me wants relationship & personal advice but the adult in me wants to hear about how you manage your business & if you have an agent. 😂😂😂", "kdbennett": "I really love when you do styling recs, favorites. Maybe what inspires your choices. Of course, if you just did a blog on your life and permanent #sofachat I'd be wildly entertained.", "reevo0705": "I would love to read/watch how you put your outfits together. Any rules you stick to and what basics are key to always have as a base. I also love hearing about your family, maybe some advice on how to deal with a parent who has been through it with illness. Xx P.s I live for your stories, they make my day 👑❤️", "sarah.clarke.35110": "I like wot you do now so more of same stuff........beauty, fashion and ur funny family x", "ginnielynnie": "I'd love to know how you got into this, where you get your confidence, how you've built your career xx", "sssuperbecca": "I’d love styling help. I have some great pieces but then when it comes to actually putting together outfits I feel like that’s where I run short. Maybe ask people to send in images of the pieces that they’re trying to wear and you could help accessorize/give ideas for styling", "s.w.beauty": "The blouse is everything 😱😍😍😍🔥🔥", "elthornto": "Omg you are so beautiful", "anishaoram": "I love your guides on how to style certain key pieces, love your stories about your friends and family, especially Bobbi and your mum. Love that you are open and honest about your life. I haven’t followed you for long but you are definitely my favourite blogger ❤️", "acsimon": "🔥😍", "lottielamour": "I’ve just had this same issue too and I’m actually writing about the shit situation I’ve been battling with. I figure if I talk about how I dealt with it, it might help someone, yknow? 💜💜💜", "_heyyylauren_": "I'd love to know how you pack for your vacations and work trips. I love travelling light, but it's more of a challenge since I'm plus sized. I'd love to know your approach 😊", "thesmilingsweetheart": "Flipping stunning!!!", "csbadgery": "I think styling help would be amazing. I love your \"picks\" in your stories and then how you would style them!!!", "starrykat": "Lifestyle content would be great!", "ashleighbrashagram": "this though!! 😍🔥😍🔥😍 I would really like personal shape style advice, even though I’m plus I struggle with this and current trends/fashions and how to apply them. Also some lifestyle stuff, what you do day to day, friends, dating, More sofa chats 😂😂 literally though. Anything 😘", "bigail_c": "As someone who admires your unique sense of style I'd love to see any posts about the fashion faux pas in your past/any of your wardrobe staples! Old photographs are a bonus (and of Bobby too ofc) xx", "styleidealist": "Soooo....I wanna hear about this man tbh 👀lol", "peski_": "Please help me discover plus size brands killing it in the mid to high end slightly more \"grown up\" lewks (without dressing like my nan obvs) - I need ya Dani!! Xx", "rxbynhartley": "You look gorgeous! Maybe something on relationships or maybe even a Christmas inspired post? X", "hey_neenshc": "I’d love to see your ideas for trainers that you can wear with anything. I’m desperate for a smart white trainer I can wear in the office. And also maybe a red or leopard print one? Or maybe a brogue that is as comfy as a trainer? 👟", "kiddkaryn": "I'd love to see some styling help with everyday looks 😁", "sulsworld": "This photo is beaut 😍", "marchandpowell": "Yaaaaas I like this look, best look.. very autumn 🍂..", "mrs_shepp": "I love the fashion content. I love seeing how fashion can apply to you and me! 😘", "fromdonnawithluv": "Like to know more about you and your life. X", "mandi.art": "How to style and transition wardrobe pieces between seasons!", "katelou94": "I'd love to see some every day fashion. I love all the clothes you show but not brave enough to wear them for work etc xx", "jacqueline_caplan": "Ooh I love this look 🙌🏼👌🏻😘", "sallyv__": "Top tips on how to become self employed, at what age and how you achieved it 🧡", "lozmk1": "Makeup tutorials you always look incredible xx", "theplumvine": "Beautiful Creature ☺", "emarieburge": "Styling tips! I’m always struggling with what goes together! I love this look!", "rone_scheepers": "Ooh! Styling help would be great ♥️ Maybe a shop your wardrobe thing where you make new outfits out of pieces you already own? Key pieces for the chilly weather? Love your style so would be really interested x", "sjkelly15": "Love a beauty one, like more on your regular toiletries, like deo/make up remover/shampoo, the usual forgotten suspects, always love a recommendation", "thingymagigi": "@daniellevanier I actually really want to know how you do your hair! You always have gorgeous hair and as someone who can not do hair, id like to know. Products, tools etc. Also a section on tops and jumpers etc that are plus size and have the length for a plus sizer...", "hanninstevenson": "Ok here are a few, plus size restrictions (even though im confinent and us is there anything you think doesnt fit us at larger sizes?). Your health, I seen on stories you have Fybro, how does that affect you as a self employed woman. What about actuay talking about an inspo drought you may be in. Thoughts on aesthetics and cosmetic surgery. Just a few things I'd stop and read 1💖 hope you are feeling better babe xx", "gaynormrandall": "Looking insane beautiful lady, anything you write I will read. 😘😘😘", "jenn1capps": "You're so beautiful. And one of the reasons I began to follow you is that you show me how a \"bigger\" girl like myself can style fashion, makeup, etc. And your photos are amazing! Plus your stories are always fun and I love your accent (typical American thing to say but it's true lol). I'm so sorry you got sick and have not been feeling like yourself. Please don't give up blogging bc you inspire me and others every day❤️", "lauraleighchapman": "I'd love to hear more about how you choose things to add to your wardrobe each season and/or if and how you curate your wardrobe in general xx", "amydonjuan": "Your wardrobe staples / must haves. How you shop (whole outfit, general style or individual items). More about your beautiful hometown! And love when you include your parents and Bobby. Also recipes from your flat mate cos 😍😍😍 food envy", "margaridabasto": "Absolutely gorgeous! 👌", "h_morgan__": "Maybe how you organise your style? How do you keep track of items and trends? Do you rely on memory and social media? Or does being in the industry provide you with all the cues you need to be organised?", "lou_wiseman2011": "Styling through the off days?xx", "sandralaw99": "Styling please danni", "kirstyr2013": "I love your style, but it’s not suitable for my workplace. I’d love you to try and fancy up boring work clothes xxx", "ms_h_allen": "Your hair and makeup! You always look so polished!", "ami_pawlak": "Xmas gift guide and style for Xmas / work parties 🎉 🥂love reading ur blogs! X", "charleyvanpurpz": "My most beautiful everything is you Bum Bum ❤️😘😘😘", "roisinmcd": "That top 😍 defo clothes and also self confidence.. you always look phenom x", "laurafletcher1975": "@daniellevanier I'll watch anything you post tbh!😘🖤", "shertpants": "Hi @daniellevanier I would LOVE to see styling tips. Recently I have felt totally uninspired when it comes to my wardrobe. I have so much awesome clothing but I’m just not matching the right pieces and therefore, getting dressed in the morning isn’t as exciting as it used to be. Would love to see how you style current trends!", "alicepem": "Fuck off this is sick🔥", "jasminhannington": "DATING", "hanniecita": "You have such beautiful skin, some skincare would be lovely", "georgi.lawley_06": "Beauty and lifestyle", "the_alisejane": "Cool!! 🙌🏻", "borderlinebadgal": "Love this look!! 😍", "cvp_ii": "Oh okay back and beautiful!!! 😍😍 Bum bum your beautiful beautiful woman 😍😍😍😍😍🥰🥰🥰🥰🥰💓💓💓", "bernieg2041": "Absolutely beautiful stunning", "irene._.campbell": "Can you cover staying covered this winter but still looking good x", "chloeturnip": "Defo more styling and more Bobbi! Hope you’re feeling better x", "unwrittenchloee": "Style! You’ve always inspired me! Show me all your clothes! But I’d also be interested in seeing you on YouTube! Your insta stories always make me giggle 🖤", "alanna_a_white": "Office style. Suits but fashionable... anything so I don’t have to look boring and dreary in meetings anymore.", "ninabeena999": "Christmas party outfits, hair, make-up, accessories @daniellevanier every year I struggle 😕", "hayashiram": "your make up is always on pt. would love some tips!😘", "betsyandmummy": "All of the above! Love all you do x", "gem_bem": "Styling tips jah jah x 🙌🏼", "chloeincurve_\nVerified": "Verified", "gaelmomof3": "Buying on a budget", "she_loves_vintage": "Jeans!!!! I struggle to find ones that fit properly. You look fabulous by the way 😘", "sarahjacob84": "Styling .you just take it to the next level and I'm getting do much inspo from you x also make up looks x", "susiechelle": "Relocated and job hunting ... interview outfits would be good! 😉", "lauriewinkless": "A bit early, but what about an Xmas gift guide / shopping ideas. A fashion collab with Callie. More stuff about you and your lovely fam. Tips on working with brands. A challenge where you have to spend less than £XX (pick a number) and create an entire look. Reproducing iconic / high fashion looks with small budgets? X", "ceriieowen": "Present inspirations for all budgets x", "fleur1923": "I would read anything from you! But if you want ideas, I'd be really interested in any tips you have for using things you already have in your wardrobe to create new looks, rather than constantly buying something new when you want to change it up (which is what I do!). And on a personal note, I'd love to hear what you do to lift yourself up if you're ever feeling low. It's something I struggle with so it would be great to get a different perspective xx", "everyday_veganism": "Hope you are feeling much better ✨ Would love to read a blog about autumn/winter style and beauty tips for the changing weather! 💕", "theverysimong": "Oh, and also, me and you, trying things on in the fitting rooms... YES!", "rike_lotharsdottir": "Fashion! Cute shoes for cold days... 🙏🏽", "lschim": "Styling!", "emilyx92": "Fashion and lifestyle 👍🏼", "bally_hayer": "Styling, Personal, (Everything) 😊👌🤗", "sammil3igh": "I’d love to read your recommendations for affordable “capsule” professional clothing for plus sizes! I’m trying to build a professional wardrobe but I’m struggling to find comfortable, quality clothes (especially tops) that don’t break the bank!", "joannacorleykerr": "Where to buy Trousers that actually fit properly please and thank you 🙏", "emsby_by_the_water": "A mix of them all. But how to style for different events. Fashion on a budget etc... x love ya stuff....x", "clarenoursegrant": "Your fibromyalgia? How you live with it, how you were diagnosed? X", "allaboutthatbass.blog": "Styling 🙏🏼", "mrskew82": "Blog whatever makes you smile and laugh. As much as I’m a fan of all your work, as you have an incredibly happy and warm personality.. with a bite. You’re amazing Dani. Shine on 👌🏼🤗😘", "maeve_madden\nVerified": "Verified", "isabelspencex": "Personal/lifestyle xx", "raquelwatdahell": "Love your shopping segments! Just ordered that leopard red dress from ASOS - who is this new stocker @collusionstudios? You should do a colab ❤️", "wildershoresoflove": "I quite like your dating and lifestyle etcccc", "laurennicolefk": "Babyyyy. You look soooo gorgeous😍😍😍! Personal and lifestyle content...basically anything and everything"}