{"pattifarnham": "I hope you are starting to heal ❤️❤️❤️ @daniellevanier", "ellievevers": "😍😍😍", "meaghan.king": "Yes! My favourite brand!", "theplumvine": "Your skin Is glowing 🙌🙌🙌🙌🙌", "arellum": "Love Soap and Glory ❤️", "bethcub": "Your skin babe!!", "sarahgilligann": "Loooovveee soap and glory 😍😍 they always smell so nice, already love their ‘Breakfast Scrub’ I need to try their new range ASAP!", "thisismeagankerr": "They sound divine AND I checked and they’re cruelty free, yay! Will have to see where I can find them in NZ", "jellywtbelly": "I love @soapandglory products and this looks lush 😍", "thecosycottageinn": "❤", "miss_maartje": "Soap and Glory stuff always smells soooo good 😩", "megsays_": "I’m OBSESSED with this range!", "melissaswardrobe": "The body butter is the best thing ever. Going to stock up now!", "zoebarkerdesign": "Aghhhhh I almost bought this exact one today but walked past as I was in a rush! Totally regretting it now 🤦‍♀️ hope you’re well beautiful lady x", "jessalbone": "They do the best Christmas giftsets! xxx", "mummy_of_4_people": "@daniellevanier my daughter bought me a soap and glory set for Christmas and it’s amazing. I used it as part of my self care as it’s smells amazing 😍", "katyyjadexx": "Soap and glory sugar scrub in the one 🤤😍 you look gorgeous!!", "michaellamary": "Off to go and get this right now!!! @soapandglory", "mrsflorabell": "Ooh looks lush! I’m a firm devotee of The Righteous Butter bodywash, it makes my skin so smooth 💜", "booksnbrooches": "I love soap and glory and you look so good 👏👏👏👏👏", "dianasaladpot": "Ooh I need a body butter for after the shower!", "kittycowell": "How do you do a post like this and look so naturally great?!", "fashiontweet": "Ooh I wonder if they sell in the US?", "csbadgery": "🤩🤩🤩", "primrosebigwood": "Lovee their products! Always smell so good!", "_thenads": "It’s amazing!! I want to lick myself after I use it 🤣", "zizzo____": "I’d buy anything from her @sarahwigan I wonder if she’ll be our best friend??? 💕", "africagem": "I love @soapandgloryusa", "zeewarriorprin": "That smile 😃 ❤️", "thebusybree": "Ooooh, I’ll have to give it a try! Looking beautiful Danie!", "lauriewinkless": "Soap & Glory's body scrub is the absolute best one I've ever used. Huge fan of their products!", "vivrkrawat": "💞 lovely pic pretty girl💞", "curvysam": "Sounds like heaven. Maybe I should come back to the UK for Christmas again #anyexcuse", "ashatalks": "Beautiful", "bailyvanb": "Sounds awesome 🤗 do you know if it's available in Germany too?", "diddyduck_": "Definitely need to try this for my super tired dry skin 😍xx", "jazzmynejay\nVerified": "Verified", "scarletsaunders": "Sounds delish! I want some! 😍", "misshollieb": "Yummm. Top of my Saturday shopping list now 💖", "emilylenax": "Ooooohhh will have to try this range I love soap and glory!! Love the monogrammed @christy_home robe too xx", "katiesayerrr": "Ooo new packaging", "emucy": "Love a bit of soap and glory. Hand food is the one x", "michelle_mck": "Oh awesome! Excited to try It and you look smashing !", "clementmarfo\nVerified": "Verified", "lourdesdiaz1135": "Love their products!! 💕💕💕", "imogenchristy": "Love soap and glory! Such good quality for the price and lovely packaging. Will have to try the new range! X", "nataliemeansnice\nVerified": "Verified", "ray_bo_baggins": "I love the smell of the Flake Away body polish so much, so excited to give this a try", "ted1ble": "Proper love Soap and Glory, plus Caroline Hirons rates it which is encouraging 💅🏻", "chloeincurve_\nVerified": "Verified", "amandacashen": "Ive always wanted to try their products! 😍 😏", "jamessteelcooks": "Absolutely cannot wait for you to give me a sponge bath with these products! 😂❤️", "zoewarlow_": "Literally one of my favourite brands EVER", "jfphillips155": "Can't wait to try it!", "becvann": "You look amazing! Glowing! Unfortunately @soapandglory does not agree with my skin. X", "thevintagevxn": "Love their stuff!", "laurzrah": "Need to smell 😍", "kdbennett": "Love @soapandglory! You look super hydrated and fabulous!", "griffind00r": "👑", "katno10": "Can't wait to try some 😀", "lucy_earnshaw": "Sounds blooming amazing!", "baileytiafern": "I love soap and glory😍 a Christmas must have!", "cursedtea__": "Coat me in it please!", "the_em_edit": "I bloody love soap and glory xxz", "thisisjessicatorres": "You have me really wanting to try it", "h_morgan__": "I love Soap and Glory! The Christmas sets last nearly all year, and the peach cleanser and body butters are the best around 🍑 🧖🏼‍♀️", "kittyunderhillx": "OMG YES I bloody love soap and glory!! 😍😍", "itsmekellieb\nVerified": "Verified", "beckyandthejets_": "If I didn’t like you’d so much I’d be annoyed by how fit you are. Hope you’re starting to feel a bit better, sweetheart.", "lottielamour": "I love me a moisturiser! You look so cosy here too 😍✨", "curvyliving": "😍so gorg , love S&G 💕", "thekenchster": "Oooh does this have a different smell to the normal S&G range? I need some summer back in my life! xx", "ourtimeofthemonth": "Loooooving this hair!!!!", "calliethorpe\nVerified": "Verified", "badbadprettygood": "I love Soap & Glory!", "rebs_85": "Beaut!! You look so fresh faced and glowing ✨", "allthatbeaut": "Ok I need to try that body moisturiser!", "_stacey87": "Love this stuff 💖💖", "victoria_mccairn": "Yum a new scent!! 😍", "anastasia.furrow": "I LOVE their products!💖", "nicolettemason\nVerified": "Verified", "ellieyasminjones": "I need this in my life! Looking slay by the way 🔥🔥 xx", "laurenpops": "Oh maybe I need to try this, I usually use the Hawaiian tropic one x", "kellyaugustineb\nVerified": "Verified", "theblackpearlb": "Haven't tried this collection yet, but I bet it smells amazing! ☺️", "kellouhar\nVerified": "Verified", "unique_rosch": "😍😍😍", "ju_boos": "Ooooo neeeed it 💋💋", "bryoneycook": "Ooh, just had the bathroom done (well whole house), and once finishing touches are done this is on my to buy list!", "laurennicolefk": "😍😍😍😍", "carley_h17": "Love me some @soapandglory", "elthornto": "Looking like an angel as per xo", "elenalucie": "I looooove S&G body butters, they smell so flippin’ good 😍", "hollieplus": "Ooooh yes please. X", "happyvaness": "Getting all of it 👏👏👏👏🔥🔥🔥", "missalexlarosa": "Oooh! I wish IG had a smell feature! @soapandgloryusa is one of my favs for sure! 🙌🏾", "theverysimong": "Buying it now 🙌🏼", "amybh21": "😍👌"}