{"wifey_q": "Defo a big night in! 😙", "rubyboo83": "Currently BIG night IN, all about the cozy 😊🥰", "ted1ble": "Big nights in forever ✨✨Always has been, I just pretended for 24 years in the middle I liked going Out Out. In in until end of days🚪🛋🛏", "itprill": "Burn that candle at both ends!", "renagr": "Now in my thirties im definitely in! Twenty’s was a big time out decade🎉🙈", "naoreilly28x": "In in in!!! I rush home from work every time I'm on a day shift because I cannot be late for fresh pajamas, my hubby, sofa and a nice brew ❤️ nothing beats it", "shopgirl3415": "Big nights in ❤️", "9monicdiazl": "BN in💕", "heart_rachel": "Night in! I’m secretly 85 years old, so I’d rather lounge around with good food and good company. My party clothes are like, totally binding. 💁🏻‍♀️", "thisismeagankerr": "Night in for sure!", "emmarzombie": "Nights in 100% every time", "mazarinstone": "I love going out to eat in fancy places, but then I like to come home again. My idea of hell is a nightclub.", "itismarg": "In in in!!", "charlmccarthy": "Innnnnnnnn ❤️", "bitz_of_mitz": "Both! lmao!! Love staying in most of the time but I do enjoy getting ready and going out for a big night!😆", "sarah_anaki": "In", "the_original_christina_breen": "I'm a night in girl mostly", "gunmetal_lace_dwntwn": "✔", "lana_cam_": "Nights in! 😍", "becvann": "In! I like to think about going out and being fancy and drinking cocktails etc then end up in my happy place on the sofa with a vino. Lol x", "whitesagewellbeing": "Big nights in hands down.", "thebiggerblog": "I’m such a bore, in!! 😂❤️", "dididelight": "bit of both x", "sofeejay": "Big nights in 😍", "lastudiobanane": "BIG NIGHTS IN but an amazing big night out every once in a while is what memories are made of.", "nolwazinkwandla": "I'm craving a big night out. But I typically prefer a big night in 😊", "metallicat_maz": "Big nights in fo sho!", "styleandgracefull": "Mostly in...with an occasional out❣💃🏽", "niki_yesthatishowyouspellit": "I think in this context it's which do you prefer 🤣 I'm at the age now where I enjoy being in more that going out.", "dylllancec": "big nights in for sure", "juliacaesarzeppelin": "I love both, but each at their time. Aaaaaaand usually, a crazy night out is followed by a cosy night in! 💗", "tanyabyrne": "Team In 🛌", "sonnyturner___\nVerified": "Verified", "debzlouiseblog": "Night in, with too much wine so you end up spontaneously going out at midnight 😂", "thesmilingsweetheart": "In!!! 1000% in. Lol.", "blanchedevereaux": "Both! Usually a big night in is preceded by a big night out 😂", "glittahmama": "In!!! With Chinese and pyjamas!!!!!", "jollygood_time": "It depends on the weather jajajaja sometimes is lovely to stay un bed watching a movie or at the balcony drinking a Tequila sunrise. Sometimes i love to go out AND dinner in San Telmo or Palermo. I'm from Buenos Aires.", "amandagoldthorp": "BIG NIGHT IN 💯💯💯💯💯💯", "carolannehunter": "For me defo big nights in... Im a single parent of a child with complex needs.. He's just 6 years old. If I get respite it's a bubble bath, a hot cuppa and whatever I like on TV. The small things mean the most xxxx", "itsamepandabear": "Big night in, always 😂", "binge.to.bopo": "Big Nights In - most definitely! Though I spend most of my night ‘in’, I’d much rather a friend of mine say “I’m having a house party” instead of “I’m throwing a party at ___”, or “wanna come chill in mine and sleepover?” Rather than “shall we go for dinner and drinks somewhere?”", "katierosekilby": "Big nights in💖💖", "cocoamande": "Biggest night IN! X", "jemwwatch": "In!", "sharika_in_the_kitchen": "IN!!", "lauramissblt": "Deffo a big night in.", "xlrosx": "Big nights in all the way as I don’t like crowds and I get more anxious at night.", "cassattack2e": "In", "modern_fudging_family": "I really enjoy staying in every weekend 😍 but love an occasional night out! X", "rechauz": "Big nights in", "dollybabii": "IN! 🙌🏾", "aggyjoe85": "Big nights in ALWAYS. I can be arsed with people xx", "mayah.camara": "Big nights in! Must be a sign of getting older lol. I do love a night out though but I’d rather have people round mine", "lovebeyondstars2015": "In", "theweewanderingscot": "I like a big night out when I’m on form and my fibro is not given me jib. However, a big night out should always be followed by a big night in to recover 👍🏼😂", "lornaluxe\nVerified": "Verified", "v.w.h.m": "50/50", "jacqueline_caplan": "Ooh I like a bit of both. But I love being at home.", "tierneys_canvas": "I prefer big days out & nights in now xx", "dawnlangler": "I always use to big nights in but this year changed after loosing 8st and feeling confident in body for once I'm enjoying life and making up for missing out in my 20s", "angiecvk": "In 💯", "chrissywg93": "Big nights in! ❤️", "susie265": "Now I'm nearly to big 5-0, OMG how did that happen lol!! I would say nights in, but in my 20's and early 30's, it was def nights out all the way so enjoy it while you can, I do not have the stamina and hate hangovers so I don't drink much these days, very boring I know! 😁", "ksabol18": "Big night in!!!", "wifemumteacher_iow": "In! All the food, all the gin, all the friends. Add a sofa and you're done!", "muinatabdul": "Love both! But as I’m getting older nights in are more my bag! Can make cocktails, wear whatever you want, listen to your playlist. Possibilities are endless! ✨😍", "elisabeth.moore": "I think I use both?", "charlotteftrump": "*which do you prefer. Big night in! 😘", "booksnbrooches": "Nights in. Thousand percent", "oddsandtrends_": "I love a night in with the right people. Living alone I have a lot of nights in alone and they're old news but when I've the right company I love it. But occasionally it is nice to go out and dress up💜", "zeewarriorprin": "Big nights out!! Because I hardly get to do them and when I do it’s an absolute blast!😆", "styleidealist": "BIG nights in 🙌🏾", "alsoknownasboos": "NIGHTS IN👯👯👯👯", "abbieelizabethpotter": "IN😍", "mandi.art": "Big night in most of the time, but that makes the few big nights out spattered through the year extra special.", "becks_things": "Big nights in 🙌🏼😍", "ohmamajohnson3": "I like about one big night out a month. Other than that I’m all for big nights in. 💕", "nuamtimp": "Cool 💛", "francesca.espinosa.baster": "Big nights in ALWAYS!", "abbygarcia": "I’m a total hermit/ homebody. In.", "mmccann66": "Big nights in...100%!!", "jerseyjulia": "Out", "carey1069": "Definitely big nights in, now that I'm almost 50. In my 20 's and 30's it was big nights out only. Staying in would've been punishment 😂", "_katyboo_": "Cosy night in definitely ☕🥃", "theblondescouseone": "After 3 weekends on the run OUtOut I'm super excited for a weekend in! I'm so excited to see my eldest nieces this weekend and to have girly pamper pjz and movie weekend! Xxx", "mother_toddler_teens_": "Big nights in with my family snuggled up good food movies / games night. All the best fun is with my brood 😍❤️😊", "bronwynrhiannonx": "GIMMIE THE NIGHT IN ANY DAY 😩.", "gaellita_sz": "Big nights IN! Definitely. I'm such a grandma already and I really enjoy it 😂", "beth_mead2": "❤️Nights in", "fromsarahlex": "Nights in, every time. The bf, my pupper, blankets, sweets, film, best times. I’m such a homebody", "inspector_gretchen": "Big nights in🤩although I like getting ready for a big night out😅🎉", "kirstyr2013": "I love a big night in! Comfy pjs, warm thick blankets, movies, my husband & son all snuggled together 😍💙 xx", "emer_a": "Big nights out are unreal once in a while but a big night out cannae be beaten", "benpechey": "Big night in all the way babes ❤️", "sarahjoy2245": "Big nights in!! 😍", "magentawillow": "Big nights in every time!", "hey_neenshc": "I’m so torn! I love both. Mostly a big night in, but also, with the right people and the right thing to do, a big night out is 💣💣", "the_emma_jeffries": "I love getting ready for a big night out but when I'm out I want to go home so if you could have a party at home that would be perfect XXX", "ezzl": "Gotta be staying in! Any excuse to take my bra off 😂", "neverrtooldtorock": "Big night in for sure, had my share of nights out but now I'm more a nights in person", "tracielcarson": "Normally nights in, but tis the season DV, so big nights out", "shardube_": "Big nights in x", "tuitefruity": "I used to be all about the big night out but since hitting my 30’s a few years ago i’m all about big nights in 🙌🏼 xx", "some_girl_from_essex": "Both! They both have their time and place to be enjoyed ❣️", "agemlikenoother": "Big night in", "jojo011980": "Big nights in! Can’t be doing with all the pushing and shoving in bars and the rude people (can tell I’m getting old) 😂", "goldengraham1819": "In, for sure. Good friends, a game, comfy clothes, face masks. Perfect x", "selinahilverda": "Since you're giving us options, it's 'which' ;)", "monika_klink": "Big nights in!! You can get just as sloshed with just as many friends, but with the money you save drinking at home, you can do brunch the next day ❤️🥓", "nat_nnh": "Big nights in! ESP now when it is cold as hell in Scottish Highlands! 🙈😁xxx", "theepicnina": "Big nights in", "looking4lynne": "I’m am now at the age where I prefer afternoon drinking and then going home. So is that big afternoon out and then a big night in? Xx", "carriejm": "Depends on my mood but love a bit of both. Definitely better on a night out of I manage a disco nap first though! ❤️", "chelsea_nurse": "Depends who with!! And can I find something to wear which I find sooo stressful haha", "sio_bray93": "Big nights in xx", "sonyalovesmakeup": "Big nights in always", "littlemj26": "Big nights in always xx", "sarahdeans65": "Night in x", "daniellelouiselove": "Big night out Any day! I love the idea of cosy nights in but I get so bored after a couple of hours. I love a good nap though! So a relaxing bath and a massive nap before going out and i am good to fucking go!! 😂", "blooming_lovely17": "I like it all. It’s good to do something different each time because variety is the spice of life 😉 xx", "lucycarlyon01": "ALWAYS big nights in, I’ve hit 30 and become hugely grannified x", "clayrebenzo86": "Big nights in ✌🏼🍂❄️☕️🍿", "lynnie_pinnie": "I love nights out in the summer and nights in in the winter 🤷🏽‍♀️", "ginnielynnie": "In!!", "allumnicole": "In. Definitely in. Especially now it's getting colder 👍😁", "bally_hayer": "I prefer big night in ..But I do like a a big night out .", "allen_michelle7": "Big nights in xxx", "jude2602": "Love both but the recovery time for a big night out is a killer! I'm 40 now and it takes so much longer to get over a night out. Love a big night in with my friends - no dressing up, no makeup, just relaxing and having a giggle", "seggler": "Nights in. That cushion is divine 😍", "nadeterri": "Big nights in! So I can enjoy & hear the company I’m in rather than spending the night yelling at it 😂😂xx", "jennyrose05": "Big night in all day errryday", "sara.l.craig": "Big nights in!!!", "misscarlyenco": "Both!", "carley_h17": "In!", "emilyread130": "defo nights in!!", "lottielamour": "Depending on what mood I’m in! At the moment, it’s big nights in 😂", "kaylidena": "Definitely big nights in! Bottle of wine, tasty food and good company all under a cosy blanket", "lindi_lad": "Big night IN", "charlieee0492": "Mostly in...but an occasional big night out is also great!", "ruthwrites_": "Erm well both. I love being home and entertaining by cooking, drinks etc but I love getting dressed up and going for dinner and drinks. Maybe not a full night out, no clubs for me 👵👵", "mysderberg": "Definitely big nights in! Would much rather have a dinner party or a movie night than go clubbing!", "judayone": "Big nights in every time 😎🥝❤️", "k8ifer": "I used to love a big night out but just can't do it these days. Perfect would be big night in but at someone else's house! Or does that just count as out??!", "cbirdy485": "Big nights in are life", "sugarchips21": "I’m 40 and I love going out (even if I don’t do it as much). I’ve noticed how it’s a thing to prefer staying in, I get it, but you should deffo get out there and get on it sometimes!", "mrskatiekoo85": "In. I am such an old lady nowadays lol", "danojo": "Definatly big nights in.xx", "yindaabee": "Big nights in never really been a big night out girl but once in a while for celebrating is okay.", "mintydevine": "💯 BIG NIGHTS IN ❤️", "curvyliving": "Nights in 100%", "whatagemcurve": "Big nights in - less people to judge me once I’m singing after too many wines! 💃🏻💃🏻💃🏻", "mypeachylife": "Big nights in!! 💗", "abijensen": "In!!! ❤️", "sallypierre": "There’s room for both. And each one makes you appreciate the other more.", "ruthies_battle_begins": "Big night in.. X", "thepinupboutique4": "Nights in for me, I get freaked out by big nights out now (anxiety + I’m an old crank)", "gemmamelody": "Theres a time and a place for both 💃🏻", "bloomiebloomie": "In", "1louisealina1": "I like getting ready for a big night out but then I want to stay in and chill! 🤣", "claire_eckersley": "Big nights in x", "alvaek": "Big nights in for sure🙌🏻😍", "ellieansell_": "Always IN! But I am closer to 40 than 30 so that’s no surprise really!!! 🙈", "mrs_chloeanna": "So in! Love it all cosy 👌🏻👌🏻😊", "hannamolen": "Big nights in!!", "beingamylouise": "I love me a big night in, new fluffy pyjamas, slippers on, takeaway & a cuppa tea... heaven 😂🙌🏻", "emilysmakeupandnails": "Big night in ! X", "unique_rosch": "Big nights in OR daytime outings cos I need my sleep 😂✌🏾", "sallyv__": "BIG NIGHTS IN!!!! 100% 😊", "martygiovannelli": "Nothing beats a big night in! Especially this time of year 🍁🍂⛄️", "allie.ab": "Big nights in xxxx", "ellieyasminjones": "Big cosy night in all the way! X"}