{"kangland1": "It's definitely true unfortunately all social media goes this way eventually, the other day I was thinking where are all my friends with their weird memes?! Or the interesting bloggers and artists I follow (like you!) I didn't personally know anyone on my feed, just big celebrities and adverts- I mean of course I want to see what Paris Hilton has been up to like any sane human but not every hour?!", "shannon_on_on": "I thought I saw all your posts, but went and looked at your profile page and realised I have only seen about 60% of your recent ones. And the more I think about it, I don't see your posts unless I'm going \"far\" into my feed (i.e. checking insta at the end of the day/early morning), yet posts much older than yours by other profiles seem to take precedence on my feed. I'd say your suspicions have definite merit!", "lovebeyondstars2015": "It shows up in the feed. Perhaps some ppl just watch the videos and don't bother scrolling down the pics anymore? (I'm not a video person.)", "fried_megs": "I seem to miss a lot too. Being in Australia with the time diff with Europe and US I find so much is generated overnight that I just miss heaps - plus now it gets sorted by popularity not chronological which IMO sucks. Every now and then I got to the actual pages of my favs and realise how much I've missed. Also I watch your stories and you can't like those, can you? How do you tell who's watched?", "_sheenamarie": "I see the majority of your posts. I think I see the things I click like on the most, which is cool and all but when I follow new accounts there's no history of me liking their posts so they never show up in my feed and I legit have to go through my following list and click on each person if I want to see their posts. I also hate that when I sign in and out to my other account the posts are all mixed up and not in time sequence and it drives me nuts. I miss old Insta so much.", "seggler": "I never ever see your Instagram posts, but I follow your story so I see that every day and I guess I don't notice that I miss out on the actual posts? If I don't see your posts, I can't like them and that means Instagram won't show more of them to me. The time difference in Australia doesn't help either. I haven't enjoyed Instagram since fb took over. I never get to see my friends posts' and rarely the bloggers I follow. It seems to be a mix of sponsored posts and those brands that pay for the sponsored posts, boring!", "sshavonn": "I see your posts, but I also don't follow many ppl. interesting to hear you're having this issue tho...... love you btw!", "streetie74": "Exactly the same as @seggler. I never see your IG posts 😭", "onyxzen18": "You show up on my feed.", "frauthommes": "Even with turned on notifications I have to search and like The last pics you posted. You never show up in my timeline. Frustrating", "prillyjv": "your post was always visible at my tl, but mostly at random time. Sometimes i saw your 11hr ago post. Just like this one, Even though i was on insta lastnight till i fell a sleep", "emmahaha": "I always watch your stories so therefore still feel engaged, but in reading your post it did make me realise you aren't in my feed at all... I do have to search for you to see new content, or when I'm blatantly looking got inspiration to steal your style.", "hopegostelow": "I never see you on my feed anymore but always watch your stories", "kyliemm84": "I see your posts occasionally but def not as much as I used to. I tend to search for you these days because I miss your face! I'll definitely check out this notification thing!", "booksnbrooches": "I have to search for you", "montse_pb": "My feed is very strange, sometimes I see things that were posted 1 day ago and miss things from today. Or doesn't make sense at all", "jkcs_84": "Where did you get those sneakers", "ragu_lb": "@daniellevanier you still pop up in my recommended feed so that's a good sign that people are still engaged 🤗 I agree RE different brands, its alarming how many people feel they can't shop outside of the 'curve' hashtag. There's fuck loads of fashion to be had. But I guess that was part of my point of quantity of brands / styles as opposed to quality of style. But that's not on you, just one persons opinion. 🤗 x", "daniellevanier\nVerified": "Verified", "trillputa": "Probbaly because you bought so many fake folllowers that the likes don't match .. happens to the best of us", "thisismeagankerr": "I think the algorithm is shit. I like or comment on all of your posts when they come up so it should show them to me regularly, but nope. I usually have to go searching for them and then end up liking 20 pics in 20 seconds like a complete creep 👀", "uk_reash": "I rarely see your posts I literally search for you and like the pics in a batch, which is what I'm just doing now.", "margedtrumper": "I see you for sure through your stories", "ellieansell_": "Your posts still show up on my feed, although now I tend to watch stories with my 30 second insta fix rather than scroll through pictures. Stories have definitely changed how I use/browse Instagram. Are people maybe just like 'like happy' these days generally? If I don't engage with a post (in the form of a like or a comment) it doesn't mean I haven't seen it or appreciated it. I often engage more with posters who reply to positive comments too. A lot of (dare I say, mainly bloggers!) I follow often only reply to negative comments with snarky replies on here, which puts me off engaging sometimes. Hope this is helpful!! 👍🏻👍🏻", "stefaniestanzione": "I always see your posts! I'm wondering if that's because I like most/all of them because I went back to look at your feed just now and I haven't missed any 🙂", "supersizemyfashion": "I've experienced the same, it's very frustrating. I don't see you on my feed often.", "ohhellolyss": "I see your stuff sometimes - but def not as often as I used to - so more times I find that I have to search you up by name and then see your page... it's whack as fucckk", "lori1992_": "@daniellevanier your stuff shows up on mine as I think it's because I watch your insta stories all the time lol! Although I have dm'd you and you've not seen it? But that could just be cause your busy xo", "5arahrella": "I'm just not seeing your posts in my feed, which is annoying because I just looked at your profile and I missed so many great pics. But I'm not about to turn on notifications for everyone because that would be freaking nuts. ya know?", "sweet2thecheeks": "I've seen the same with my posts, hardly any likes anymore and I couldn't work out why!! Thought it was because I got boring but I guess we're in the same boat! @daniellevanier 😩", "girl_from_mars_78": "I watch your stories instead of visiting your page and liking individual pics. I find that since stories became a thing, I like a lot less posts as I just stay up to date with stories", "andreuhz": "Whereeeeee are your sneakers from", "valerie_mg_healy_": "I see your stories", "ashlynblockhead": "I see everything you post", "nazareena_poet": "Need those", "talisaeva": "First stories are usually ones users click into the most so that's why you come up on my Instagram stories, sometimes you come up on my feed but most times I have to manually search for you cause I love your stuff 💕", "watchfulweaver": "I only see ur pics when I come to ur page", "laurenpops": "Always snooping on you anyway 😉 but annoying when you see someone's post from say 20 hours ago before you see their post from 1 hour ago in your feed.", "vintage_reflection": "Your quality is high and still amazing pictures it's the algorithm, I think most people are taking a hit. I keep feeling it, drives me crazy!", "jwafn": "I turned on the notifications, so they always come on, but to be fair, I mainly watch the insta stories because they're funny, informative and give a 'real' perspective (if that makes sense). I'd look on the 'normal' insta page if I needed outfit inspiration or I'd just head on over to your blog. You do regular stories (which is great), so maybe people are like me and just head straight to that...🤔", "michellewolfe76": "You're on my feed", "luisachristie": "I don't see your posts in my feed at all, but I see your stories!!", "shoegal1973": "I see you 😗 x", "jeweledcookies": "I see you sometimes but I just manually went to your page and liked a crap ton of photos I've never seen before. So you're not getting pushed fully? If that makes any sense lol. Anyways I'll be sure to stop by your page to make sure I'm seeing and liking all your content. We won't let these rat shisters shake you down lol", "_sarah_hughes": "I think it's stories, I tend to watch that - have stopped using snapchat because of this too! However I do also scroll but maybe just once every couple of days now - stories take the time. Not sure you can like stories 🤔 content always high quality 🌈", "janinarhalseth": "Btw, I don't have notification turned on", "missannastomosis": "You're in the first places everyday.", "mria_wanders": "Quickly checked your profile page. And I'm definitely not getting all your posts.", "ericafmstyle": "Babe!! I saw this!! But honestly! Like we were saying I have to manually search you and then cyber stalk like 20 of your pics I have missed!! So frustrating!!🙄", "ohrachelalice": "You always seem to show up in the first few of my stories (that's what sent me here) and looking at your feed I am definitely missing your posts!", "grace_lyonsie": "I thought I saw all your posts but then just clicked on your pics and there's ones there I haven't seen 🙁", "shabeeshoo": "Instagram has been facebooked 😳", "moorestyleamorebeauty": "I see you in my feed. I don't know if you use a lot of hashtags, but I've heard that some people are being shadow banned.", "cherryvidal": "I always see ur posts without problem in my feed", "mindfuljojo": "This is first time I've seen one of your posts for ages x", "thatbeautyandstylelife": "I always search for your account, you never seem to show up in my feed x", "k3181": "I don't see many of your pics come up these days,I have to search for your page , the ones that do come up on my TL are days old x", "april_ionson": "I dont see all of your posts in my feed anymore-this one was tho, and i periodically check in what you've been up to ya Gorgeous Artsy Minx!!! Lol😘🌸💖", "kmazza08": "I always see your posts. Keep it up ❤️", "wonderkat289": "I realized that I don't see you much on my feed... although I do watch all insta stories before I scroll through my feed. But now that I looked for your page I see that there's a lot@of content that I don't see.", "makirenton": "Less than half of your posts end up on my feed despite liking your pics quite a lot and checking your stories, which in expected \"favs\" algorithm would mean I would have you on my feed. 😒", "thulisamkhencele": "These are super dope @daniellevanier 💜💜💜", "msbettsy": "I tend to watch stories first. You seem to always be in my first few stories. I then scroll down about ten pictures and that's about it. If you're in the first few pictures I will like.", "emily_.simmons": "I can never see you on my timeline, but your always the first few people on my story. But love your insta posts!", "mollken": "I have post notifications on for you as I NEVER SEE ANYTHING otherwise 😨👎🏻 it's the same for friends/family/other bloggers like I miss so much without the notifications!", "mhightermorgan": "I see your posts. Please keep them coming!", "lifewithlinzi": "I hardly get anything in my feed from you or @calliethorpe I watch your stories and search you", "tweetypiebabe1": "I view your profile via your stories because I know people like you and Callie post a storybook a day so since you guys are always in my story feed I'm always checking up. My feed is so cluttered with things I don't necessarily want to see and things I really am engaged with show up three days after it's been posted it's ridiculous.", "shazzymcfc": "@daniellevanier I always tend to check out eveyone's insta stories first & then start scrolling down, but you are rarely showing up in my feed & neither is @calliethorpe @fullerfigurefullerbust I usually have to manually search for your pics. I find Instagram frustrating now that nothing follows on in time order anymore 😩 I only found this post because of your insta story, it didn't show up on my feed & I had to check your page out to see it. I love all of your insta stories though, along with Callie's & George's 😙💕", "phoebe.montague": "I think it's the way myself and possibly other people are using insta, I prefer to watch people's stories than scroll through pictures xx", "my_little_happiness": "I have the same problem on instagram like you. I hope it changes soon, the more it is like this the less i like social media", "rosi230373": "I don't know, I am not very aware of insta technically... Don't you post a bit less and your posts may have changed also, maybe your looks are more casual??? I still love you though and you are one of my eldest 11 yrs old daughter absolute favourite, she thinks you are a total beauty😘 Keep being yourself💕", "emilysmakeupandnails": "Babes is so annoying it's all because of the Instagram algorithm. Your posts always show up for me but I also search for you incase I've missed stuff. I wish they would change it back to how it used to be", "parachutingelephant": "I certainly don't see as many posts as I used to - sometimes I don't see things until two or three days later!", "fromdonnawithluv": "I see you on my feed. Love your posts ❤", "bethcub": "You always show up on mine - worth bearing in mind that dms also count toward the interaction between accounts which improved algorithm visibility. I do this for a job now v 😭", "trixibelle_": "I very rarely see your posts on my feed", "farahchaudry": "I never see your stuff in my timeline anymore :(", "erika.dannielle": "I rarely see your posts anymore 💔hoping Instagram fixes their post visibility issues soon!", "mrs.jenny.g": "The posts arent in time order anymore. (Dont know whether its my settings?) I only found this because of your insta stories. X", "jenbirch": "Not that often on my feed!", "highlystrungdoll": "I see your stories, but your posts don't always show up for me. It doesn't seem consistent!", "emmererr": "I see all your posts but I just started using Insta and I only follow like 80 accounts so maybe a factor", "rachrholley": "I see your posts and I love em!", "yulischeidt": "The more people interact with your post the more they'll show up in my feed. The more \"real\" comments (ones that are more than 4 words not including emojis) will also help your post get pushed into people's feeds. Essentially the algorithm promotes post that are already performing well.", "sarahloulife": "I have you on notification alert but I still see your stuff when I'm scrolling through my feed.", "maddy.w.14": "You're in my feed x", "nicky_moore86": "Hey Huni I've stopped liking your pics , sorry I've actually stopped liking every one only because I only watch the insta story's now , very rarely do I scroll down my feed , and if I do it's a quick look 👀, I will try and start my liking again lol xx", "carlene_ostedgaard": "I have to search for you manually since I don't know if you'll come up in my feed", "mrscharlotteyard": "I watch your stories everyday but never seen your feed. This is a rare moment!", "cooper_rebecca": "I'm not receiving all yout posts, so I'm turning on notifications, will see uf that helps", "allthatbeaut": "You're only occasionally coming up in my feed - but when I go into your profile you've posted way more than I've actually seen. I'm hating this new algorithm as suddenly people's posts from 2 days ago will pop up in my feed when I refresh it, which seems wrong to me! Xx", "jcplusfour": "Have notifications on but I still don't see your posts (or many notifications for that matter))", "sarahhurn": "I think it's because there are more and more people so less likely to see xx", "laura_and_rich": "This is the first photo that has appeared in my timeline for months. X", "theweewanderingscot": "@daniellevanier your stories always show up regularly. But this is the first feed I've noticed of yours in a while...", "marymarywilko": "Yeh you don't appear on my feed much xx", "lucylufo": "I see all your posts but I do regularly watch your stories and click on your profile.", "sarah_the_colourwitch": "You rarely show up in my feed anymore, I feel like you used to show up a lot more. Seems like the algorithm isn't right. I see a lot of accounts that I care less for, more often. Maybe it's on me to clean up my follows?", "queensandcats": "I get every post in my feed, no problems.", "katearora": "I see ya!", "patriciagordoncollins": "I can get caught up on stories but my feed is also lots of adverts and I see about half a dozen new posts then it shows me stuff from days ago", "itismarg": "The quality is never the problem with your posts!", "ch32": "I rarely see you on my feed now :(", "caz020519": "This picture showed on my feed but I rarely ever see u on it anymore", "shesmiledyes": "I see you on my feed regularly ☺️", "milly_moonshine": "This is the first time I've seen your account in weeks..", "bekahallmark": "I always see you on my feed, maybe post more often so people are more likely to see you on their feed xx", "curious_outdoor_photography": "This showed on my feed, but I have seen a drop, and I think it does fall on Instagram.", "lyric_jazz_me": "It's because the insta algorithm is shit. Someone pops up and I think oh they've not been on in ages, look at their feed and I've just missed 3 months 😡", "mummy_of_4_people": "I see you on my feed on a regular basis x", "roseplusone": "I search for you (daily 😳😘).. Rarely see you on my feed 😞", "emma.d84": "I hardly see you anymore 😕 x", "emmawaters88": "I don't often see you on my feed only on my intesterstories", "hanniecita": "I see you, but to get every post ive to look for you. No loss in qa", "tazmeena": "I see all your posts (I've just checked your page and have seen all the recent posts on my feed) but I'm more of a lurker than a liker I'm afraid. I'm like that with all my IG follows though sorry! X", "monaharlem": "I don't see your posts frequently anymore just like with most of the accounts I'm following. And I have the same problem. The likes per picture are down to 1/3 of what it used to be before the algorithm changes. I'm frustrated. Of course I'm wondering if people aren't happy with the content I post anymore. And even if the engagement only fell due to the algorithm changes it's still frustrating.", "lippielovin": "I always see your posts. It may have something to do with me only following 62 people though 🤷🏾‍♀️", "elerixoxoxo": "I think it's to do with stories. I just look at them now to keep up to date rather than looking at and liking posts xx", "wholelottashaz": "I generally get about 80% of your posts, and if I haven't seen you, I search you! 😂 Deffo the update/algorithm change tho. Your content is always fab, really isn't you! 💕", "anaispenelope": "LOVE it !", "em_ski84": "I see some posts but not others so I tend to go direct to your page to catch up hun xx", "memilies": "it's definitely the algorithm!! 😔", "ebrulillustrates": "I have noticed a huge change in my likes I get too, I sometimes post and literally I get zero likes. Even though I'm not a huge account I can tell something is up. It's irritating.", "sidstine": "@fullerfigurefullerbust is all over my feed though.", "debabynoov": "You show up, but not always with a very recent post. I do search for you on a daily basis, almost stalk like 😂😅", "claire_eckersley": "I have notifications turned on for your posts but I don't always get them. You don't always pop up on my feed either. Seems to be hit and miss xx", "garnerstyle\nVerified": "Verified", "cryingatwingstop_": "I don't search for you, so I just went and looked at your direct feed. And I'd say maybe every 3rd or 4th photo shows up in my feed. I hate the new algorithm! *turning on post notifications*", "_certified_mind_blower": "I barely see you in my feed. Have to go looking for you. Fallen out of love with IG lately with every update x", "plusequals": "I see quite a few of your posts doll! Perhaps not all of them but I see this one! 💗 your content is ALWAYS fab 💜💜xx", "thecurve_comms": "Yeah I keep you top of my manual searches. Never see you - or any of my faves - in my feed anymore. It's so frustrating! Big love though, your posts are awesome as ever xx", "yagirlshaq": "You don't show up on my feed for days at a time. I always have to search you except for one of instances such as this, the same thing happens for Georgina and Callie. Turning on post notifications now.", "bodypositivejessie": "You popped up on my feed", "sophieeloise89": "@daniellevanier the last post I saw was you holding these 😯", "kittycowell": "I see your posts usuallyyyy but I interact with you a lot. Also nice kicks! X", "cerrraaaa": "I always see your posts and your stories first because I like everything you post or watch your story first. ❤️❤️", "kevinbarrios_95": "Tienes pantobillos?", "tracey_devina": "I can see you 👋🏽👋🏽👋🏽"}