{"dlearyous2": "some people are so down on them selves, they have to bring others down to feel good", "mele2541": "Yo people can try to do that to me bur I'll be fuckwitt shaming them back! Get your whole big fat beautiful greek life girl 😎", "kirstyr2013": "You are a queen!! Those ignorant dickheads will get the karma they deserve 😍 xxxxx", "jamessteelcooks": "So beautiful I could literally cry xxxxx", "nannallauritzen": "What do you say to them @daniellevanier ? I'm always lost for words in situations like that. You look amazing as always btw 😍", "africagem": "You look amaze balls!!!", "sham_xoxoxox": "Beautiful 💖💖", "fionamcalla": "Can I ask where you got your bikini bottoms @daniellevanier?? Any I see online look less high waisted these look perfect!! By the way, middle finger to these people....🖕🏼🖕🏼your playing a huge part as to why I'm buying a bikini this year and not a onesie 😂😂", "ahmetcan_kayra_2": "😘😘😘", "msgonzalezblogs": "Hot mama!!! 😍", "ollypolly19": "People's ignorance can be unbelievable. Stay stong.", "jesennia.r": "I think your gorgeous an looking great in that bathing suit. I can't even believe those people thought other wise", "furry_style_vdk": "You look gorgeous 🍓😚😘", "alelllima": "😱❤💓❤💓❤💓💓❤", "gurpreet.preet.58910049": "sexy", "farhad.life": "😲😲😲😲😲😲😭😭😭😭😭😭😭😭😭i want you 💋 👅 👅 👅 👅 👅 👅 👅 👅 👅 👅 👅 👅 💪 💋.💋💋💋💋💋💋💋💋💋👅👅👅👅👅👅💋💋💋💋👅👅💖💖💖...", "saifdahy": "💖💖💖💖💖💖💖💖💖💖💋💋💋💋💋💋💋💋💋💋💋💋👅👅👅👅👅👅👅👅👅👅👅👅", "ernestodanielclara": "Ummmmm", "nicolemccordick_": "True beauty 💖", "driffilljerimy": "Very sexy and nice feet", "gauthierparks": "Holy shit!! You're so hot!! You body is so beautiful and your spirit is as well!!!", "besparza58": "People who shame others are obviously not happy with themselves or their life. God gave us all what we've got. Power to us👍", "sjsu1974": "Don't ever lose 1 pound to destroy that gorgeous hot body", "katfisk": "I love love love that you called their asses out! 📢", "girlwithcurves\nVerified": "Verified", "mortgages_by_chelsey": "Jealousy is an ugly thing and your beauty radiates from the inside and truly beautiful is something people like them can never be. Don't ever change ❤❤", "meeukee1": "What assholes!! 😡😡", "getxomujer": "You are gorgeous!", "lisagaynor": "You look amazing!", "b_r_tt": "People are the worst of they don't understand it they shame it but just know you've inspired hundreds or more women to accept who they are and enjoy life, myself included, fuck the haters!", "jeweledcookies": "Also YOU LOOK AMAZEBALLS ON THAT BOAT BIH!!!", "kiyonaskloset215": "You look great represent #teamfluffy", "fullbeautystyle\nVerified": "Verified", "cooperloves": "Total babe! 😘😘😘😘😘😘", "iamkristabel": "Yes they need to get in the 🌊🌊🌊🌊", "thisisldizzle": "Hawt !!!!!!!!", "lindseyholland_\nVerified": "Verified", "foreveryoursbetty": "Girl, you on fire! FUCK THEM! 🔥❤️🔥", "stwmkt": "So so beautiful!! 🌸💖😍🔥", "judayone": "Gorgeous total gorgeous. I'm getting a bikini because of how great you look. You rock", "kityounot": "You are my hero, Danielle Vanier 🙌🏻", "valflickan": "So sad that we still need to put up with people's ignorance! Let's all make them sorry for their asshole behaviour! 👏👏👏to you! ❤️", "sharonsparkle76": "Fuck them all...you rock 💪❤✊✋✌💛 xx", "wearethedaughters": "You're absolutely stunning girl 🙌🏻", "djfritzo": "Nice pic! Enjoy it while you're young... bbw over 40 isnt as fun!", "jackelinccorahua": "If they can look how awful people they are to make you feel uncomfortable they would be feel sick of themselves. Everyone is special and unique, we all are an amazing miracle of life. People who don't understand this will always critic others maybe cause they are not happy as they see themselves. Go ahead you are gorgeous my dear I've been looking your feed and love it 😍❤️loves from a Peruvian girl living in China 😘", "deedogar74": "Disgraceful. I've experienced it all my life. Shame on them all 😩", "lizziedoll": "Well done u!! This is one of the reasons why I hate summer! And don't feel comfortable at the beach. It is a shame we can't just enjoy life and it's simple pleasures (such as going to the beach) without feeling targeted and made fun of.", "curvesinacardigan": "You are a queen! 👑 Changjng the world one happy swimsuit snap at a time!", "honeybee664": "@lottielamour haha their are probably people who would pay good money for that!! 😀😆", "anjerla": "You look hot as hell though?!!", "kettllee": "Well done you for putting them fools in there place how dare they pass comment it's so sad that this is the way of the world luckily you are comfortable in your own skin but so many other people are not and these foolish comments can destroy someone's confidence and it's not acceptable you did well not to push them off the boat 😂", "thickthighsandplanerides": "I am sad you had that experience though Dani. I wore a bikini on a boat trip in Malta last autumn and had that fear; I was so relieved it didn't happen, but the anticipation isn't much fun. It's a truly shitty person who gets any pleasure from making another person feel shitty. You're kind, you're generous, you're strong, you're beautiful, and you deserve to take up space and wear whatever you want to. Enjoy the rest of your holiday @daniellevanier. x", "debbieellenep": "Looking like a kabillion dollars of fabulous 😍😍🔥🔥", "gam_pounds": "SLAAAAAAAAY GIRLS! I agree with @calliethorpe push them into the sea! wash their negativity away!", "philvanier": "😘", "farshidtaji7299": "Cute always", "kathzpaul": "You go, girl! Shame on them!", "_larissa.demarco_": "💪💪💪", "rmchurchill": "You are perfect and so beautiful! ❤", "exploringlife_onmyterms": "Thank you", "queenpavonine": "SLAY QUEEN! 👑💄💅💪💜👭 people's critiques tell you *everything* you need to know about them and say nothing about you.", "thetajinderkaur": "Keep slaying dear and calling people out on their bs! 🌺", "t.ba.dee": "Thank you for standing up for you/ us and changing the narrative out there !", "plus_elegance": "👏👏💜👏", "shannon_on_on": "As I've got older I've realised in those situations that I am not the problem, those people are! Mind you, it's taken until my 30s to realise that and I hate that prior to this realisation other people's opinions on the way I look held me back (and still do sometimes). We only have one life and it's too short to spend either worrying about assholes or being an asshole. Keep being you, you are amazing! ❤️", "curvygirlzrock": "Mama... what they give is what they are... u look lovely and super beautiful skin ;)", "the.emerald.jones": "You are a great role model!!!!", "bonn.martinez": "Get it girl, and you look amazing! 😘", "onyxzen18": "Keep calling them out on their rudeness and supidity! You are strong and beautiful woman with friends who are the same! You all look beautiful!", "phoebeboothh": "youre SLAYING honey", "vas995": "🙌🏽🙌🏽👏🏾👏🏾👏🏾", "nenettedu35": "So biout .. forget those angry people", "purdygirl7282": "I hope you tore them to tiny shreds. Enjoy your holiday 🤜👏💋", "cm879305": "I am proud that you stood up for yourself and by sharing your story, you actually stood up for the rest of those who have experienced such disrespect. Thanks and you are beautiful.", "susiechelle": "It's terrible and makes me angry that people have the ordasity to do that . I have a very skinny niece and she was skinny shamed . She was walking along the beach with her boyfriend and they shouted at her \"eat a meal love\" \"skeleton\" etc she was distraught and said it ruined her holiday . She wants to be curvier and just can't gain weight. She is so unhappy with herself and needs strength. We live in a cruel world full of some beautiful people. And one day the mean ones get karma!", "tracy_shirley": "I know how that feels..but I'm now at the age where I don't care..so what if I'm wearing a bikini on holiday..n I'm not as slim as the rest..I deserve to wear what I what and be comfortable in the heat.its a sad world we live in when people still body shame", "gabbynats_": "Firstly babes, YOU LOOK BANGING! Secondly - how dare someone try and make you feel uncomfortable when you're just trying to have a good time?! I'm glad you put them in their place. Most people wouldn't have the courage to stand up to them and they met their match", "paulaflorestf": "You are beautiful!!!👏🏽", "georgie_o77": "I would have chucked them off the boat 🙈 What vile behaviour!!! Hold on to your strength and zen, they're not worth a second of your time xx", "adinamonette": "Well I think your bloody amazing ! I feel you've been holiday inspo for a lot of women 😉", "jeannieb_77": "You're confidence is so refreshing to read about. I just wish I had it to...dreading my holiday 😩", "viesilencieuse": "Fuck those people and their miserable lives. If they were actually happy in life, they would be happy to see other people being happy and enjoying themselves. You look amazing!", "tarahjeanking": "I wish I had a friend like you to encourage positivity and body love in the face of those types of bastards!", "v.w.h.m": "#kissmyass #stopbodyshaming #inspirationalwoman #🙌🏾", "lottielamour": "YAAAAS come through girls!!! Imagine being that insecure in yourself to project your fears onto other people???? Crush their skulls with your thighs and slap them with a titty 💪🏻✨", "lozcounsell": "Holy shit, what scumbags! But how much they must hate themselves...", "lucindarella_b": "Clearly they are utter twits! You look gorgeous x", "virginiag2012": "Some people just don't have manners!", "kellyril": "Bloody rude!!! You look FABULOUS 💖💖😉", "chuspitruski": "It's very simple: just block and report without replying a word.", "gakoo78": "❤️💋😍💋📞❤️😍😍📞❤️😍", "carolinesweetascanbe": "Ppl have so little respect these days. Just ignore them and enjoy yourself. If they only knew how their pathetic, petty behavior made them look like imbeciles,smh😔", "drichsw18": "Fabulous 😘", "happygal71": "❤️", "sarra25": "I don't get what's not to love about your body! Looking gorgeous as ever!! Love your confidence it's an amazing thing yo have no matter what shape or size you are 💕", "fhakimian": "عالی بود", "madamn_jamise": "YOU LOOK LIKE FIIIIYAAAA!!! 🔥🔥🔥DAMN", "lady_cmh": "What total see you next tuesdays. Similar comments over the years have scarred me emotionally. Those past comments were always received when I'd made an effort to dress up and was *shock horror* visible to the world, rather than hiding away in the shadows in baggy plain clothes and no make up. Like another lady commented above, a blog post with advice on how to handle these situations would be so amazing. There are so many women and men (and kids) who don't have the confidence or words to speak up. Much respect that you girls didn't let it ruin your boat trip, stuck with them in a confined space must have been horrible. Thank you for leading the way, and talking about this issue...", "fullerfigurefullerbust\nVerified": "Verified", "whatkatydo": "I think you're a fine piece of ass 💙", "laurenpops": "It's such a shame some people cant keep negative and hurtful comments to themselves. All we can do it keep putting out kindness and positivity 💗😘", "creme.de.la.femme": "Absolute babe, can't believe anyone can think anything other than that ♥️", "greekangelb": "#HatersGonnaHate x", "alicegillett": "I'm sorry Dan - some people are such fuckwits. You should have pushed them overboard! 😂😂😁", "fantsypantsanna": "It is always shocking to me that anyone would suggest a fat person do or wear something different because of their size. Is if it's anyone's business. Do you, gorgeous. Life is meant to be lived, no matter the size.", "lenainred": "Insane that people behave that way. But then again, look how horribly some treat others. I will say, when I saw this pic, the 1st thing that came to my mind was \"va-va-voom!\". I seriously thought you were the most gorgeous thing. 😍 So it just depends on who's looking, I guess. @daniellevanier", "hdmarie": "It makes me so mad that people think that sort of behaviour is acceptable. I'm not as strong as you so when this happens to me it really knocks me back. Idiots.", "cali_2_cle": "#goals ....this photo is beautiful!", "tinajammy": "@rtighani", "calliethorpe\nVerified": "Verified", "mmccann66": "Glad the fucktwats didn't get you ladies down!!!", "curious_outdoor_photography": "What a bunch of assholes", "ohhellolyss": "You better come allllll the way through with alllll of this fuxking glory. Fuck what small minded people gotta say. Hurt people will always try to hurt people. Fuck em allllll. You'll forever rise above because you've got a heart of gold", "datsmoll": "👏🏻💞", "janemcinnes83": "Sounds like they were having a shit time tbh. Probs couldn't handle u girls clearly enjoying each other and life 😚😙😗", "victorstew8": "Screw those ninnies! You look gorgeous! #doyoubooboo", "kaye436": "💛💛💛💛💛💛", "andreaharrisonhair": "So sad that people still do this stuff , I wish I could say I'm 😳 but I'm not . Fat seems to be the safe resort to discriminate against , happy well adjusted people can see everything and let it go by .. they don't comment or judge .. we need more of those .. you look beautiful and thank you for outing on a bathing suit and going on in public ., every time we do that we condition society to acknowledge that we live happily too ! 🌈🌈", "segeltorparna": "You and your friends look stunning. They have bad souls.", "carambola": "U go girl", "claire_meets_world": "Some people are beyond ignorant. You look gorgeous x", "debadebz": "Wow you look amazing . I'm a UK 20 and live in bikinis on holiday and iv never heard a bad word . Or I just don't notice 🙈This makes me angry . Enjoy the rest of your hol girls and keep being and looking fabulous 😚😚", "darenaoladele": "Gorgeous 💕", "leeleelove96": "Yassssss!!! You look amazing!!❤❤❤❤🔥🔥🔥🔥", "amydonjuan": "But you look bloody INCREDIBLE?! 🔥🔥🔥", "walidsharif": "You're amazing ❤", "scottyunfamous": "Issa snack 😍", "nanoochka": "Would you consider doing a blog post sometime about how exactly you respond to comments like that when they happen in person, maybe with advice about recovery after an incident happens and self-care? I am confident and love myself, but fuck, it's hard to respond sometimes when someone catches you off guard with nasty remarks to your face. It makes me so mad that I just end up glowering silently and later thinking about all the things I wish I'd said if the cat hadn't got my tongue. Being able to shut down fatshamers to their face is a talent I definitely don't have but wish I did!", "lghshortstay": "Wow you look amazing,", "traceyantunovic": "Looking amazing so enjoy", "iamplentywoman": "You look fabulous. It's just too much for insecure people to witness such confidence and class.", "cocoliciousness": "I can't even with those people. Enjoy the holiday and pushing people off boats is a fun pastime.", "rosi230373": "Disgusting people and miserable souls. It's all bad education. No one is perfect but as parents or other relatives, we need to educate new generations in some way.", "sanwitteman": "So sad! Before judging look in the mirror! 😐", "mrsmalikthe1st": "@charlottelouisepreece ugly hearted bellends 😂 quote of the century!! Hee hee, brilliant 😂", "nikki_ranger": "💙💙💙 This is why I love you 👑☄", "heyoliviaa": "👏🏻👏🏻👏🏻", "janinarhalseth": "You're so freaking awesome!! 😍💕💕", "magentawillow": "People really piss me off! My husband went to the pool today and had some 18 year old yob comment to his mate \"look at the fucking size of that\". He pulled him up straight away and the kid tried to make out he wasn't talking about him. You look amazing and we'll done on not letting these arseholes bring you down x", "isolatedheroes": "Whah absolute horrors! You and all your girls have looked absolutely amazing all holiday! Slayyyin that holiday wardrobe 😍🙌🏻☀️🌴🔥🍹 xxxx", "swiftyknickers": "Wankers. You're a beaut x", "stylehasnosize_official": "💕 for you and your friends", "henselrachel": "💪🏻💪🏻 you girls rock it every day xx", "filledudimanche": "Well said. You are beautiful 😚", "okkimberley": "💪🏽💪🏽💪🏽💪🏽💪🏽💪🏽💪🏽", "jcplusfour": "To hell with them. You are Rubenesque - and look at all the beautiful paintings Rubens produced with beautiful, curvy, voluptuous women as his models, considered to be some of the greatest paintings of the female form ever.", "emmabh88": "this makes me sad to hear too, you girls are an inspiration to everyone. this post shouldnt have to be posted, but I get why you did it. you girls rock, hope you're having an amazing time and give all those motherf****rs something to really look at 😜 xx", "fashionmeetscurves": "Ugh! Damn people! Would love to hear what you said to them! Haha", "rebeccalgarcia": "Looking fab in that bikini 🙌", "emmzlene": "Vile behaviour 😞 you are fab. Enjoy your holiday 😁x", "allisoncquigley": "You are beautiful, they are sooo jealous they have nothing better to talk about", "hays1978": "This makes me so mad. Who the hell do these people think they are and why do they think anybody cares what their opinions are. Good for you being the better person and being comfortable in your own skin 😉😉😘", "arellum": "I was just looking at this picture thinking 'aye carumba that girl looks spectacular' and then to read about your experience unfortunately there are ignorant people about but I'm glad you put them in their place xxx 💕", "norazaneta": "🙌🏾🙌🏾🙌🏾🙌🏾", "elizabethfellis": "Gorgeous!!", "charlottelouisepreece": "This makes me sad.. it's a shame there are small minded, ugly hearted bellends out there that stoop this low! So glad you didn't let it get to you, you look amazing 😍", "sarah_sourit": "You go girl!! 💗", "essveejay66": "Wankers!! Like they're so fucking perfect!! You feel like saying \"I'm fat not deaf\" You are beautiful you are loved and you are valued!! Plus you have great tits! ❤️❤️❤️", "kaylie19": "I find you to be one of the most beautiful people...inside and out. I'm so inspired by you!! I look forward to your posts and stories. Because of you I've tried to embrace my curves more. I think you look stunning no matter what you put on your body...to be honest it's not even fair! You are perfect lady!", "leighhutchi": "👏👏👏👏👏👏👏👏👏", "sammy_loves.x": "@daniellevanier good for you, you look amazing as always..... they clearly have sad little lives, glad you stood up to them 😘", "chris.southgate": "You my lovely and your friends look beautiful . The haters are the problem , simple, you shine In all your gloriousness whatever size or weight you are , live your life and turn away from the haters . Enjoy your holidayxxx", "mushypeasandmintsauce": "Absolute babe 😍", "inspiringmullet": "Uuuuugh people suck. Why are they even paying attention to you when they're on a fucking boat on vacation??? Good for you for calling them out! ❤️", "chelseaevans_": "What an absolute queen you. I cannot fathom people like that. Thank goodness you are above that sort of thing, but what about those who haven't reached that level of body positivity? It could crush someone. God I hope they have a terrible holiday to go with their miserable lives. Keep being the inspiration you are girl, you look bloody amaze just as you are ✨💖", "charlotteroberts3770": "Some vile people out there,glad you don't let them dull your sparkle,your beautiful inside & out,and your an inspiration to meany girls/ladies out there x 😘", "tubbyhermit": "How absolutely awful in this day and age!!! @daniellevanier I hope yourself and your friends made them feel uncomfortable for the whole boat trip. Lovely to see you having a great time. 😊", "lally3001": "I love the photo 😍 but as I started to read I couldn't believe the photo and words could go together. 😨you're a goddess, I would have loved an afternoon on that boat. Xx", "lrnew": "You slay everything. End of ❤️❤️❤️❤️", "k1rsty42": "Why do people think it's ok to do this? You all look amazing 👑why do they care what you're doing/wearing... keep doing what you do... I'm a long way off being where you are, mores the pity 😔 but one day!! X", "teddybearkambeitz": "Fuck the haters you rockin that look", "naomi_may93": "Keep doing what you're doing, you look incredible 😍😍", "lovehearts_dawn": "Help guys xxx", "jejewells": "Good for you!!! ❤️", "jencraven_": "Yaaaas! I wish I had your confidence, stuff like this has happened to me too many times, even on my hen do some blokes outside a bar started shouting about how fat I was, wonder what her husband will look like etc. So much so I took all my sash off and wanted to go home :( you look amazing ❤️ xxx", "sandraruales49": "Congratulations", "shirlyy_girlyy": "Fuck negative people this whole world is going crazy....... you're happy that's all that matters🙏🏻💋stAy strong 👍💕", "lilywhitestylist": "Gorgeous and classic 😍", "bubblyemmua": "Yes girl", "sarahjanegray_": "Maybe they just can't handle those bazookas @daniellevanier !!! Looking gorgeous as ever x", "lottelondon": "Which I had your confidence spent my last holiday hiding under a towel as I walked passed sniggering girls who thought I was disgusting. I have days were I'm ok and then days were it makes me hate myself, but thank you for giving them a collective finger from us all I'm trying to get there x", "teaganandrobynsmummy": "How fucking disgusting.... you ladies look amazing on your holiday. I'm going away in less than a month and you have truly inspired me to give zero fucks xx ❤️", "unique_rosch": "Stay beautiful inside and out whilst those people cry inside because they envy your happiness 💕💕", "ceebrie": "Fuck them. You look incredible", "alimjxx": "My mum always said that all the time people are talking about you they are leaving someone else alone, more fool them coz it looks like you are all having a ball on holiday. And in the words of Taylor Swift the haters gonna hate hate hate and you should just shake it off. #daniellevanier.💋👍👭👙💕", "sunny_leith_lassie": "Thank you for leading the way and getting the petty haters told! Like you say, not everyone is strong enough to take their crap so I'm always thankful to hear when inspirational girls like yourself get them told!! Btw, you seriously look like a golden goddess so I'm assuming it's just jealously that's lead to the pathetic comments 😏 Keep slaying and sharing your fabulousness to encourage us all to do the same!! 🙏🙌💞😘", "liztigerlily": "I hope you continue to enjoy your vacations. You look fabulous!", "allaboutlisad": "💖Thank you 💖", "5allyanne5": "You look bloody fantastic 🏖", "_cbrandx": "you look INCREDIBLE 😻😻", "town.called.alice": "It absolutely devastates me that people do this. You're such an inspiration and your boobs like incredible! Stay slaying. You've made me feel a lot happier about myself and have given me lots of clothing inspiration! X", "catwoman6413": "You are a beautiful person inside and out. Ignore stupid people. Unless its too close for comfort let them have it.😊😁😂", "v.5578": "You rock, girl!", "madamelavampire": "Hero ❤️", "anastasia.furrow": "Go ON WITH YOUR BAD SELF 💃🏻 🙌🙌", "badinens": "✨⭐️✨", "thebiggerblog": "@hoopy30 yes and that too!! ❤️", "muddlingthroughmythirties": "Bloody hell thats awful. Even if you are strong enough to deal with it, you shouldn't HAVE to have that sort of shit taking up precious time or occupying your mind on your holiday. Fuck them, and good for you - you're looking fierce 🔥 X", "theslumflower\nVerified": "Verified", "alongthekurve": "Beautiful. That's what you are. 💖💖💖", "catswindlehurst": "Girl you look fucking radiant 🔥🔥", "shelbizz": "I love you! ❤️ thank you!", "lappiah": "I've literally thought how gorgeous you have looked in every photo. Just because they are too insecure, small, and petty to live their best life, doesn't mean you shouldn't. Twirl all over the haters, girl!", "sadhbhflood": "You're an inspiration 💗", "becsd": "It's because of you, and others like you (@gracefvictory et al), that I have bought my my first ever bikini for my holiday in a few weeks. I feel great in it and don't care what anyone else thinks! 💕Thank you for being so strong and inspirational 💕", "ybaag": "love this ❤️", "antonio.lt": "Mmmmmm", "sophiie.ward": "💜❤️💜", "terri_hotpinkskulls": "You are amazing!! Thank you for posting.", "styleburden": "Yes! Good for you, gotta go high when they go low! Fat solidarity! 💕", "deiikii": "Can't believe it! You look awesome! 😍👏🏻💓", "kronizz": "Thank you so much for taking the fight for all of us! You are stunning stunning stunning in that bikini ❤️", "seeyaimout": "Power ❤❤💪🏻", "tracielcarson": "Preach that shit DV, for every word you spoke out, there was a word inside someone else that couldnt be spoke out. In awe of you and your strength. X", "hoopy_gram": "You look fierce AF. 🔥 🔥 🔥 💪", "cheesecake1979": "You look fucking fantastic. End of.", "abudai85": "I'm so sorry that happened. I find it so sad that people would say something intentionally hurtful to another person. I also find it horrible that you would do that to someone clearly enjoying themselves. Why would you want to spoil their joy. Assholes!", "littlepandafeet": "You look amazing in that picture it is beyond me why anyone wants to waste time by being negative about another persons appearance, hate comes from ignorance and fear so they just look dumb now x x", "tahiramusic": "🙌🏆", "glamazon2you": "You are slaying in this pic. ❤️🔥Remain #unbothered. Fuck em!!", "tbirdarthur": "They are nothing but bullies!!!!", "modestefinds": "No thanks. I don't want to imagine being that sad thank you very much. I'm watching your holiday posts (which are hilarious!) and ALL I see are three fun loving stylish beautiful women having a blast! Let's keep it that way. Those people are nasty bigots and I have no desire to walk in their cheap shoes, not even for a second! Stay beautiful, funny and sassy We're all watching you, not them 😘😘", "julie.diana": "You look smokin hot...end of....", "socialmediatrix": "Oh fuck those people. I hope they're proud of the way they spent their holiday; utterly pathetic. You look pure 🔥🔥🔥🔥🔥🔥and good for you for not letting this pathetic shit phase you.", "flavia_la_chicca": "They are trash . They dislike themselves. But they ruin other people 's lives and must be punished or reprimanded for that", "nailmami": "So proud of you @daniellevanier 👍", "scott_warren_explores": "You look amazing.......and put it this way......it took them to comment on you to even notice them! Keep rockin xx", "emillennial": "It absolutely breaks me to think that people who aren't strong would be destroyed by thoughtless, heartless scum. Tell them all. Keep up the fire. You look amaze. ✊️", "claire.tex": "I love your confidence, appreciate your general awesomeness and get inspiration from your great fashion sense!!", "miss_maartje": "This is why I love you - you always keep your head up and take the higher ground. Wish I had a shred of your confidence 🙌🏻 have a great rest of your holiday Moo 💖👌🏻", "katedrama100": "👏🏻👏🏻👏🏻👏🏻👏🏻👊🏻", "chenai": "Yes! 🙌🏾🙌🏾🙌🏾", "kandikalistar": "People can't handle others living their lives happy and fearlessly. I literally get fat and slut shamed daily. It's not my fault they have so much learned hate and misery they want to project it onto me. It shows what fuckbags they are yanno? Thanks for always standing up for yourself and others because the more we do it perhaps the more desensitized they'll get to fat bodies living like the rest of society. Fat is the only form of bullying left that is totally acceptable by the majority … why?! Fucking ridiculous!", "wherearemydragons11111": "Honestly you look luscious and I'm sad that people are so rude.", "mrsmickp": "Bastards! You shouldn't have to deal with this! This makes me so mad! You look stunning xx", "antoinette.t_b": "You look like a goddess, holiday agrees with you 💖✨", "maieiciodo": "The usual grown men and women that are so malicious about others appearances! It's disgusting, It's not acceptable in the least. I can't believe these people can't comprehend that the person they are shaming could be dealing with an ED, anxiety, depression PCOS, other illness etc! Or the fact that they're fucking happy with themselves! Get over it!", "kittycowell": "You joking? People around the boat? People are so pathetic. You are amazing. Love you xxx", "hausofmandymeow": "It's so sad that you even had to do that sort of thing. What's wrong with people, why can't they mind their own f-ing business?! Hope you were able to enjoy the boat trip anyway 💕", "rhealubich": "You go girl!❤️", "alvarezv87": "Fuck them, you look great!", "kimberleylbthomas": "🙌👙🔥🔥🔥🔥", "ms.ld5": "Well said . U look fantastic as usual .😀🎉❤️", "monitoress": "Sorry you had to put up with this shit on holiday but nice one for calling them out 💪🏻", "pinkacetra": "You're gorgeous and this is beautiful", "jasminsangha1986": "You look bloody amazing. I'm loving the holiday outfits by the way. You look incredible x", "javanandre": "Yes Dani. 🙌🏿", "antoniaemily": "You look incredible my darling. Karma will get people like that for sure. Hope you're having the best time, looks amazing!! Xxx", "keiralander": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼👊🏼👊🏼👊🏼👊🏼👊🏼 YAS queen! @daniellevanier makes my blood boil that we have to breathe the same air as these vile bullies. Continue to slay girl, you are fantastic. X", "maria_mary_hen": "Disgusting way to behave and think! Sadly, when it happens to me I get too upset and wouldn't know how to respond, well apart from a punch in the face 😂", "timetoglownow": "You look amazing!!!", "shenika_aretha": "@daniellevanier this is why I ducking g love you and @gracefvictory. Both beautiful women who believe that both genders should be able to wear what ever they want without be frowned upon and fat shamed. I love that you both always spread so much positivity are so passionate for standing up for what you both believe in. So much love and respect for you both- I've actually gained so much confidence from both of you. So I thank you. You look absolutely beautiful and I love that you wear your clothes with so much sexiness, confidence and sass! Xxx", "sinfullsinderellaa": "Boobs on point there😍 Serious envy on this figure you're rocking 🙌🏼", "sunnyvonbirch": "When people project their own self hatred on to you ... it is most appropriate to hand it back where it belongs. You are a beacon of light and your sensitivity for others not as strong is admirable. Sorry you had to endure this while on holiday. Enjoy your well deserved trip xoxox", "heenagarey": "❤️", "kizziii": "You look amazing! 😚", "charleyvanpurpz": "Bum bum Boobies on fleek!! 😍😍😍😍😍😍👀👀👀👀👀👀👀😍😍😍😍😍😍😍💜❤️😁😁😁😍👌🏾"}