{"remiafolabi": "Beautiful! 😍 Glad you had the best time with your mum, the stay looked amazing ✨", "sadhbhsadhbh": "An angelv", "deirdrekenny29": "You look beautiful so glad you and your Mam had a great time 💕", "courtzmelv": "I’m so glad you had a nice stay with your mum! Your mum actually sounds very similar to mine! Also, you look like an absolute queen 😍🔥", "nurse.shieldy.jl": "Drip drop", "bl0ndebiscuit": "Omg looking super gorgeous 😍", "tini0970": "You look beautiful and glowing- I enjoyed following your documentation of your stay at this obviously wonderful hotel...and I love how you love your mum and how thrilled she was to be there with you 😍", "luisachristie": "You are such a gorgeous angel wowwww 💕", "glasgow_ghirl": "Oh my God!!! You look fabulous x", "iamsmiles1108": "Wow 😍😍 now that’s a look, love love love!! Xx", "____soizic_____": "Quelle classe !", "hannahxjayne_": "Absolutely gorgeous photo! 😍", "antonia.jade": "You look gorgeee😍😍 & the place looked beaut, glad you had a fab time xx", "anastasia.furrow": "Your stay looked like a DREAM!!! 😍😍", "mnsbelle": "well damn Danielle this made my heart flutter. what a delight yourself and Mummy are 😍😘🔥", "kiritinnorath": "Gorgeous! Those colours are stunning on you.", "cothrom2003": "You look terrific 🔥🔥🔥🔥", "sarahmadelinesmith": "Oh yes! Gorgeous pic ❤️", "london_phog": "Okaaaaay! Those legggggs tho! Beautiful!", "sardar.ss33": "Gorgeous 💜💖💖💖💖💖💜", "joannemarieroberts94": "Where is this swimsuit from please 😊finding it hard to find any decent plus size swimwear 🙄xx", "our_family_rocks": "You are so beautiful and just look totally gorgeous in this swimsuit 😍 Thank you 👏 for looking so great, and creating this Instagram page/blog. It helps plus size women everywhere realise how damn hot we can look and not have to conform to being a certain size.", "as.ad6566": "Hi iyloveyuo tomatch toooooo", "gemma_lupton": "Hot damn - you look amazing! I've loved following this little break with your mum. You remind me so much of how me and my mum are together 😂😂😍", "lucifurious": "SO happy for you guysss, gorgeous women deserve the besssttt 😍😍❤️❤️❤️❤️", "bitz_of_mitz": "I enjoyed watching your stories!! I always do! Glad you two had a wonderful time!😍😆😘❤️💖", "inmysundaybest": "You and Mummy V are my favourites ♥️", "krystalsx": "Unreal 💕💕💕", "taaambam": "Looked like such a memorable experience to have with your mumma - and look at you here! Beaut 💖", "eda_travelcounsellor": "So amazing to have mother and daughter time! I’m taking my daughter away this weekend for a spa break and I can’t wait! 👩‍❤️‍💋‍👩", "curvy_roamer": "I’m here for this. Also here for your mum who is the cutest babe ever 😘", "calliethorpe\nVerified": "Verified", "2bdanniellarose": "So flipping gorgeous ❤️", "sophiawho": "Love 💕", "leambru": "Marry me, off corse after my divorce with @valley_of_valium, May be we could be a three couple...", "chloeincurve_\nVerified": "Verified", "megsays_": "God you look DIVINE ✨✨✨", "brooklynsmudges": "OMG You're so FREAKING adorable", "the_berkeley\nVerified": "Verified", "gaynormrandall": "😍😍😍", "katerina_jane": "you are beautiful ♥️", "tykoonadventures": "Vacation looks good on you girl, treat yoself! 😍", "jennifer.buckingham": "GLAMOUR INCARNATE 😍", "thecurvytrini": "Looking gorgeous and what a special thing! So happy you got to spend this time with your mum ❤", "mischief.mayhem.mandy": "This is a beautiful pic, both because of you and the room 💕", "shaf_kader": "Very pretty 😍", "gailcoles2808": "Positively glowing 💕💕", "brasilnality": "So so cute! Hope you both had an amazing time 💖", "littleanina": "that bathing suit is stunning😍😍😍", "roma_vas10": "You are blessed!!!", "thatsnishi": "Wow 🔥🔥🔥", "see_fairer": "😘💯", "maroomagazine": "@daniellevanier I am so happy for you! I live here in Uk and my mum is still in Italy and I miss her so so much. You inspired me to treat her as soon as I see her! Also...I sent you a Dm. Do you mind to have a look? Thank you in advance darling!🤗🥰", "kitschyanna": "Fit.", "doryhead19": "I lost my Mummy nearly 15 years ago, I miss her dreadful, you keep enjoying special times together I ❤️seeing you two together you have the most amazing relationship xx", "lindseyhendo": "Mummy and Dani content is a fan fave! 😍", "alexmichaelmay": "Aww I love this and you both deserve!", "charalexanderpr": "Can’t tell you how thrilled I am that you got to see the Berkeley that I know and love and how dedicated the team are to making memories. You’re welcome back any time (both of you!!!) Thank you for documenting it so beautifully 💖", "d4wnieee": "I love following you @daniellevanier and it’s always extra special when you share you family too, especially Mummy, she is just wonderful xx here’s to many more moments like this xx", "charmaine.charmant": "You’re so cute lady!", "_holly_brails_": "I will definitely be booking a stay after your stories! It looks amazing & you two deserved it x", "badinens": "🙏🏼❤️", "katznutz": "Wow, this place is fab - and you are too! Say hi to your lovely mum! 🙋🏻‍♀️💕", "chanelambrose\nVerified": "Verified", "lidjarb": "You both absolutely deserved it! 🌻🌞🥂", "nataliemeansnice\nVerified": "Verified", "king_awts_cartoonist": "CHECK OUT MY PAGE FOR QUALITY CARTOONS CHARACTERS 🎨🎨🎨🎨🎨🎨 SUCH AS 🔥🔥🔥🔥🔥 MIXTAPE COVER,💯💯💯📸📸📸 ALBUM COVER AND LOGO DESIGN💯💰💰💰💰💰💰💯💯💯💯💯💯💯💯💯🔥🔥🔥🔥🔥🔥🎨🎨🎨🎨🎨🎨🎨🎨", "fromheadtocurve": "This is how life should look 😍💕💕", "henryjwade": "By your stories it looked like a lot of fun", "ooh.beautybyj": "You look absolutely beautiful ☺️😍❤️", "agemlikenoother": "Your stories looked amazing! I’m so please you both you had so well deserved Mum / Daughter time 💕 stunning as always", "nearandchar": "I loved following along! Your mum looks like she’s a hoot!!!!", "monikah1003": "Omg you look amaaaazing here, and the swimsuit is everything 😍😍", "lucy_earnshaw": "Looked amazing and so deserved for you both xx", "kellyytoland": "You look stunning in this picture!! You look so happy ❤️❤️", "emfurey": "ACTUALLY GLOWING 😍", "iamkristabel": "Va va VOOM ❤️❤️❤️", "hinovafox": "You look@stunning and I was so happy to see a great look at the whole vacation! You and your mum are adorable and you are both so lucky to have each other ✨❤️ cheers to the @the_berkeley", "cvp_ii": "Beautiful", "katie_munro8": "Looked amazing x", "kelly_of": "Love Mummy V!! Hope you've had an amazing rest ❤️", "mariellech": "Aw mothers are so important! So nice you can do this for her 🙌❤️ and you both looked beautiful and happy in your stories", "lady.lynch": "Oh em geee!!! You look amazing 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "sk8sara8": "You look fenomenal you just shine in this one", "primrosebigwood": "That sounds so so lovely!", "emilyx92": "Stunning 🔥💥", "alice_lovesu": "Stunning person 💕🔥💕🔥", "lauradarlingtonn": "Where’s the robe from please? It’s unreal! 😍", "naomi_g": "This picture is beautiful! Glad you had a lovely stay! 💓", "rxcmillion": "👏🏾", "kerryannaldo": "So glad you both had a lovely time. Can’t think of two ladies who deserve such a treat more 😘", "abas.rezaei.ir": "💙", "xxdaniella1xx": "U look gorgeous x", "laurennicolefk": "So sweet. Hope you both had the best time. Also you look fitttt", "katierosekilby": "This colour really suits you Danie🔥😍🧡 so glad you and mummy v had a lovely time, most deserved xx", "imteddybless": "oh my god this looks incredible!!!!!!!!!", "mrspumbber": "How is the sizing on this swimwear please? Its stunning xx", "blogging_about_beauty": "You are so so beautiful! You have been my #wcw for ages! Every Wednesdays I post you!! You're so hot girl!!! 💖💖💖💖💖💖💖💖", "appleshapedheart": "Your mum sounds like mine. An absolute legend!!! I'd be lost without her 😍", "jodiejen10": "Well hey there picture of amazingness 💕 @daniellevanier xx", "fromsarahlex": "Absolutely loved your Stories, your mum is such a babe. You look fiiiiine 😍", "yasmin_rsl": "Gorge! 😍", "peexo": "So beautiful!", "shishi15": "Glowy Queen 😍", "laurenpops": "So glad u had a gorgeous time 💗 well deserved for both of you xx", "gemmaslittleworld": "It looks so amazing!", "bumble72": "Loved your stories, loved your mum!! And you look amazing!💝", "kittycowell": "What a bomb shell 🔥", "elle_c_emm": "Looks absolutely stunning! Beautiful!! (And that red M&S dress? Wow👀)", "walidsharif": "You little superstar you! 😍", "hollieplus": "Thoroughly deserved ❤️", "somewhere_under_the_rainbow": "Sounds heavenlyyyyyt plus you're glowing", "messybunsandmindfulness": "Treasure her 🌼", "sasssysunshine": "This pic 😍😍😍😍😍", "em_clarkson\nVerified": "Verified", "nicoladye82": "I loved your stories and your Mummy. ⭐️ I think I’m going to have to save and treat my daughter , she’s been in hospital for over a year and that looks like the perfect way to celebrate her 18th birthday. Danielle your stories and your body confidence have changed how I look at myself. Lots of love to you and your glamorous mummy. Well done @the_berkeley xx", "jasmins.view": "looking stunning 😍💥💣", "lisa_mc_x": "Hi where did you buy your costume from please. Thanks xx", "styleidealist": "I’ve been loving your stories so much 😭❤️ looks like you had the BEST time 🙌🏾", "hollylane_": "You look insane!!!! Love this", "jessipink": "loved seeing your stories! I declare myself fan of your Mum!! 😁 loved seeing you guys enjoy everything! Lots of love from Spain 😍", "curvyliving": "This is so beaut! Glad you had a lovely time, looked fab! ✨✨", "iamalexandriamaria": "Been LIVING through your stories. Looked so beautiful lovely ❤️", "lorraine_haigney": "OMG you look unreal first of all, and this is such a gorgeous picture too 😍 a total framer!", "jamileaurora": "Such a lush pic! Those slippers! 😍"}