{"sunbeamsjess": "Sending love ❤️❤️❤️ Hope you feel better", "bethelizabethuk": "Hope next week is better for you 💜💜", "rachfriend": "Gorgeous photo, I hope things turn up and your able to rest. 💕", "rcox1223": "I'm right,there with you, had the worst week of my life, day after day was terrible,news.", "alenabrom": "❤️❤️❤️❤️❤️❤️", "charleychopsbayern": "❤️ good thoughts and vibes ❤️", "feministgoodsco": "Sending you lots of love and good vibes!", "curvy_roamer": "Sending all the love to you bb girl! Don’t forget how fabulous you are ❤️", "mildredromeri": "😍😍😍😍💓😻", "eve.stylianides": "❤️", "sweatpantsnstilettos": "It’s every valley that you pass through that really makes you appreciate the view from the top. This too shall pass 💖", "vicsanusi": "💛💛💛", "totallytonirenee": "Sending positive vibes your way.", "falota": "❤️❤️", "hannahxjayne_": "Sending you all the love! I hope you feel better soon ❤️❤️", "sarahjsole": "You look absolutely stunning here. Cling to the strength you give to others. It’s ok to take a little back sometimes xxxx", "stellies_afro_chick": "🤗 I'll send good vibes and hope the ancestors bless us with money", "erinehm": "Oh my dear, I’m sorry. You’ve accomplished so much this year already though and it’s not even Easter!? Your M&S shoes, your Navabi collection... not that you can’t have a shit week, but I find when that’s happening for me, it helps me to look back at what I have done. Humans are terrible at remembering the good things. All this on top of chronic pain too... you are a wonder. Just let this bad week slide away like water off a gorgeous Mandarin duck’s back. xx", "heftycurves": "💗💗💗", "likeroxane": "Adorable 😍", "chloepierreldn": "Golden thooooo ❤️", "jodiejen10": "Life is pretty shit at times, but for some reason it’s thrown at the good ones, don’t know if it’s because we are meant to be able to cope, better who knows. But sending you loads of positive vibes @daniellevanier xx", "courtzmelv": "Ah I’m so sorry to hear your mental health hasn’t been great, and I’m really hoping you’ve started to feel a bit better now lovely 💞", "char_bailey_": "Glow up", "see_fairer": "May next week be better for.✌️", "sgreengrove": "❤️🌈❤️🌈", "alexander_m_munalula": "❤️❤️❤️❤️❤️", "tabitha_46": "Look after yourself, you are very precious and of course I will send lots of positive vibes your way, hope the darkness passes soon ❤️", "daniellevanier\nVerified": "Verified", "casibird": "You inspire me every time I see your instagram posts. Thank you", "isakrysmanski": "You look soooo pretty in this dress ☀️☀️☀️☀️ 🧚🏻‍♀️🎀 Germany loves you - lots of greetings from franconia", "kelly.josephine": "Sending lots of love and good vibes your way ❤️❤️❤️", "julietonner": "Aw hope you feel easier soon! ❤️", "kellyblade": "Sending hugs from me & boops from Chuck 💖💖", "hayley_bailey_kipper": "Sending you love and strength ❤️❤️❤️❤️", "mpenger": "❤️", "sugsean": "I hope you're well lovely. Don't worry it's all gonna be good and you know it always turns out good even when it's really bad keep your head up hope you're doing well. Looking forward to catching up the next time I'm back in town", "lilpixieuk": "Sending good vibes your way hun x ✨✨✨💓", "stasb26": "Hope your ok Hun drink all the Aperol if all else fails 🤷🏻‍♀️xx", "sammmilne": "😘😘😘", "ljhodgson": "Happy thoughts being sent 😘", "monieuw": "Sending positives vibes ....😘", "mischief.mayhem.mandy": "Just breathe ☀️", "meganowens4109": "Oh lovely..positive vibes to you. Hope things improve...💜💜", "kayyyciaaa": "❤️❤️❤️❤️❤️", "alexmichaelmay": "Awww Danie we love you! Sending all good vibes", "marshaellemusic\nVerified": "Verified", "rrrrrachelmay": "All the positive vibes!! ✨💖✨", "baronessnewlove": "💖💖", "kiskirarizona": "When I see your stories or read your captions you make me smile so many times. you give away such a positive and good energy! Sometimes a week like this is exhausting but I’ll now you know how keep on slaying and what to do in these situations. Sending you much love and positive vibes from Germany. ❤️ Cheers to almighty Aperol 🍹", "cocopintura": "Sending you positive vibes ❤️❤️❤️", "lottiehope": "🥺😘", "iam_jadrew": "More beautiful👗🇬🇧🇬🇧👠👜👜@daniellevanier", "taliajanson": "💙💙💙💙💙💙💙💙", "dyosamystica": "Feel better, @daniellevanier 😘", "soleasecas": "🙏 Hope everything will be better soon", "jasmins.view": "♥️!", "lifeofbodie": "❤️❤️❤️❤️❤️", "so_cindylu": "Big hugs and much love", "susiechelle": "Oh no I wanted to pop round for a cup of tea and bikkies!!!😩🤪🤣", "abzieabditch": "All the positive vibes being sent your way ❤️", "jayneraisb": "Still looking fiaaaa tho", "mummasueelswood": "Sending big hugs gorgeous. Next week can only get better. ❤️❤️", "curvygirlchic\nVerified": "Verified", "daisycakess": "🧡🍹", "mrsmogwi": "Sending hugs xxxx", "fashionably_famished": "Sending positive vibes to all the Danielles out there", "shennners": "You are fab 👌 my fave fashion blogger by far. All power to you 🧡", "messybunsandmindfulness": "A good week is coming 😘", "brookssl": "Sending virtual hugs and loves xx", "sandez8": "Positive vibes to you 👍👍👍", "emmyjo27": "Such a gorgeous pic of you, lovely ☺️ sending hugs from me and Winnie xx", "bevmapp": "Still beautiful tho 💕", "benpechey": "Sending all the love my darling - thinking of you 🌟👑💝", "lee_sacha": "Hang in there....ride that sh..ty storm and get ready for a lit one that will catch up of guard and sweep you up and away into a good place ... (and if all else fails just set up a PO Box 😂) joking. 🌸🧘‍♀️🌸", "kittycowell": "Mate I feel ya but you look bloody epic and beautiful here. You are amazing. Such a babe and such a positive spirit. Sending you all the PMA. 💕💕💕", "betheleanor_": "Oh no! Sending lots of love and looking forward to seeing you next week 💕", "trishdishworsley": "Sending all the good vibes across the pond from Canada! I hope you get Aperol AND Prosecco AND ice (cuz who wants to make ice in a time like this!) Be well❣️", "_peace_by_nature": "❤️", "curvyliving": "💖💖💖", "360degreestyle": "We all go through this shit!! Adult life is a TRAP 🤣 sending lots of ❤️❤️❤️", "thisismeagankerr": "Oh matey *hugs* Sending you loads of positive vibes, hope things are looking up for you soon 💛", "ewakrukiewicz": "Hope next week will be better!! ❤️❤️", "hayrr": "💗", "salt.lemon.and.lime": "Sending you loads of positive vibes xxx", "lizzydive": "Sending big love sweetie. Hope you're okay? X x X", "nishiv_": "Sending you lots of love and Aperol, obvs! 🍹🍹🧡", "joeydarlinn": "✨✨✨✨✨✨ all the good vibes", "lghshortstay": "Hang in there 💋", "kitschyanna": "Ommmmm good vibes ❤️", "bailyvanb": "❤️❤️❤️", "dannijeanlomas": "Big L O V E ❤️ feeling ever much the same so virtual hugs to you xx", "eklparker": "💕💕💕", "courtneyrosebutler": "I love you! Sending positive vibes bby", "miriampoulsen": "This seems like the right point in time to thank you for your work. You make a difference. You matter. You’ve helped me so much with my self image. Thank you. ❤️", "frockmeimfamous": "Sending you SO much lovely beautiful girl!! ❤️❤️❤️", "nicoleocran": "Oh love, I’m sorry ❤️ you absolutely deserve a break and alllll the Aperols 🍹🍹🍹", "precisioneventsuk": "sending love and light💖💖", "angieslens": "Sorry you’ve had a shite week. On a positive note, you look radiant in white x", "freyavandeneynden": "OH fuck, that isn't fun. Hopefully you can relax a little over the weekend. Go and hug your adorable mum/nieces, cuddles help! 😘🌻", "reevo0705": "Sending lots of love and Aperol 🍹", "stephelswood\nVerified": "Verified", "mizwoochic": "Positive vibes on the way!!!!", "brasilnality": "Feel better 💖", "hannahlouisef": "very angelic tho ❤️", "sasssysunshine": "You look so stunning tho. Sending positive vibes your way! ❤️❤️❤️", "jennlynnbobenn": "Oh no! Me too! Hang in there!", "neverrtooldtorock": "Hang in there and remember better times to get through the not so good times. Sending tons of love and good vibes you way from the Netherlands 🤗😘", "rockonrubyxx": "💔 Hope you’re ok!!! Xxxx", "anilkumarmlg1": "Beautiful", "jerseyjulia": "You look beautiful though! Sorry you’re not feeling great.", "iamnatalieruhl": "Sending good vibes! Hope you can relax over the weekend and next week will have happiness and good things in stock for you!! 💜💜💜🧡🧡🧡", "julia_nutty_bird_nouveau": "@daniellevanier Hang in there!! Those thoughts and feelings are only temporary, although they can feel totally overwhelming.. You’ve got this, girly! Just a glitch in the matrix. ❤️", "mandy2435": "Sending you lots of hugs hope you feel better soon xx 💕💕💕💕💕", "chelseacate": "Sending you heaps of positive vibes, be gentle with yourself and remember you've got this even if it doesn't feel like it right now Xx", "ashleighbrashagram": "Ugh hope your weekend turns your week around 🙃", "_suzy_": "Hope things get better! ❤️", "sulsworld": "Sorry to hear it babe! I’m sure good news is right around the corner 😊🙌🏾🖤", "alfiebsmith": "Sending positive vibes your way Dani! ❤️🔥", "bally_hayer": "Sending you lots hugs and hope you get some @aperolspritzuk 😊", "1louisealina1": "Fibro fist bump!👊", "iammissjay": "But you’re still a buff ting 😍😍😍", "curvycampbell\nVerified": "Verified", "linzijadedavies": "You’re so beautiful inside and out! I am a long time fan but have never commented before. The best thing about you is your love of Aperol 🧡 positive vibes your way x", "joys2220": "Hope things get better💝", "kirsty.jones.125": "Your fab ❤️💋", "annegorah": "Lots of love!!! <3", "laurakb2": "Mines not been great either! 😘", "aneonoelle": "♥️♥️♥️", "emyas73": "Sometimes life is bollox but you know something YOU ARE STILL ROCKING IT xx 💕🦋", "imogendeannebrodie": "I’m sending lots of positive vibes, gentle hugs & love to you, lovely. Do everything you can to make yourself feel better and look after yourself and your mental health the best you can. You are a beautiful soul & a beautiful person. ❤️", "clarenorm81": "Lots of love x", "leggyblonde1415": "❤️❤️❤️hope you have a great weekend with lots of rest and @aperolspritzofficial ❤️❤️❤️", "gemmatalbot": "Sending positive vibes babe ♥️♥️♥️♥️♥️", "joannateq": "Love you, Busty McGee 💕", "abas.rezaei.ir": "💙😙", "anastasia.furrow": "Love you so much Danie!!! 💖💖💖"}