{"originalsurlytemple": "I would love some plus size whimsical dresses!! Peter Pan collars, pastel colors and sweet designs.", "the_book_of_eleanor": "@danieleinlondon @georgeatasda used to do some AMAZING plus size \"confident curves\" tights. They came up to my boobs, had no annoying seams that cut into your groin/butt, totally roomy in the butt/thigh, wide range of deniers, lasted forever, relatively cheap, and no \"bum, tum, thigh shaping\", as if every fat person wants to feel like a sausage! Unfortunately they discontinued them last year but I have been told by their customers services that they'll be back on the website soon so might be worth keeping an eye out for those!", "spice_chest": "The problem that I see even with Asos and Violeta by Mango (my go-to shops) is that they just make the same cut for 20+ and for 8, which often result in a weird fit. Take a new knit dress by Asos Curve, for example: 1026041. The girl has a great body, but the dress pulls up at the front and bulges at the back, simply because the cut cannot accommodate the breast! Duh.", "cmburnley": "Proper fitting tights!!", "themakeupmaestro": "Gucci belt 😫", "lottiepounds": "Affordable and pretty underwear in my size and anything tailored or from Zara.", "curvyway": "Funky suits (blue Leopard print for example!) preppy skirts, flared funky pants (glitter, leopard again, pinstripes with matching jackets) high quality basic t-shirts, the ones that are made from stiffer material. More and more outrageous, funky and fashionable jackets and blazers (im done with the navy and black ones, i want prints and color!) more belts and different sizes of bracelets!! Huge sweaters like the ‘80’s, oh and anything that looks like Gucci ;-)", "danazphotos": "More high waisted pants and the \"paper bag\" style! I also feel like every plus line is so edgy or sassy. I don't want a see through shirt that says Slay. I want a nice shirt I can wear to the office!!", "myfhollers": "Nice v neck plain tshirts that are not too tighr 👌🏻👌🏻", "roiseg": "Good quality leather jackets, everything COS does just one/two sizes bigger, ankle boots, a really nice kimono dressing gown (have been on the hunt for this last one FOREVER)", "galleryxxl": "Shots skirts dresses above my knee", "katecarrington28": "Strappy pretty underwear that doesn't even come close to covering my boobs (never mind supporting them) in the largest sizes in most shops 😭😭", "full_moon78": "Nice bra's", "emmarzombie": "Knee high boots that fit around my huuuuge calves", "blumstagram": "And I can't tell you how much I wish Zara did plus size. Although maybe it's better for my bank balance that they don't...", "kyliemm84": "Where do I start!?!? I just wish that size wasn't an issue, went shopping on oxford street yesterday and came back with trainers, fragrances and accessories - would have loved to have been able to buy and try on clothes! I wish all high street brands had bigger sizes. I'm getting so fed up with being restricted to buying online only - and when clothes arrive from 'plus size' brands, it's either way too short or doesn't allow for boobs as well as fat! 😩😩😩", "pingerrain": "cheongsam. its one of those chinese mandarin collar body hugging dress that only looks good on slim people. 😔", "clairemugs": "Wish torrid was available.in UK as the shipping is waaaaay too.much", "mindfuljojo": "Really good quality classics. Like a great quality black t-shirt, classic sweater and black dress that's not fast fashion. You can ship from universal standard in US but some of their stuff isn't a classic style and it's expensive dollae against the pound. Think like Gap or Banana Republic plus size!", "chocfudgecake": "Just give us the choice smaller sizes are allowed!!! Of different lengths, cuts, colours etc no more polyester give me cotton, silk etc fabrics that feel luxurious and flow over lumps and bumps, no more elasticsted waists! Finally designer brands in larger sizes please!", "ruthhbarry": "Everything from Zara. And a really nice shearling reversible coat or vest or jacket.", "yulischeidt": "Simple, minimalist basics! Why is that so hard??", "justinegior": "Blacktie gowns & upscale cocktail dresses that are chic and youthful with structured dramatic details. No more matronly formal wear.", "shelbyplus": "Giant oversized cozy sweaters!!!! These do not exist for us, I s2g! Also quality flannel shirts that are not fitted. I just want to be comfy for fall🍂", "indrasalcevica": "A classic biker leather jacket- i am looking for years and silk socks for really big cicks. but honestly, it seems to me that produced everything is just a problem with proportions, cuts and lengths!", "oliviaphillips1": "Skinny jeans that are actually tight all the way to my ankles that aren't too long and turn into weird bell-bottoms at the ankle because my legs aren't fat all the way down 🙄🙄🙄", "sasswithplus": "And classic blazers that actually fits and doesn't wrinkle anywhere when buttoned 😔🙈", "demps___": "All kinds of boots and wellies PLEASE. If you have shapely calfs then it's a hard task. I would love to see some of the plus brands produce a shoe line 👢👢👢 x", "josie_pointer": "Normal sized high street fashion available in plus sizes!! Fed up of all these ruffle tops and skirts that make me look like a granny", "anisijaaaa": "High knee boots", "biggirlslovefashion2": "I find it really difficult to find normal traditional blue jeans! It's such a simple item but in plus sizes the brands tend to 'spice it up' with distressed looks or undone hems and so on. I want a classy pair or regular dark blue jeans 🙏🏽", "sequinkitten": "Thigh high boots that look like the Stuart Weitzman suede, flat ones (or even if they just made them for wider legs). I adore the sweater dress look with thigh high, flat boots but they don't make them for us. Most of the boots just look tacky, are high-heeled or cost a ridiculous amount of money.", "_evansalexandria": "A really nice, well tailored long coat suitable for girls around 5\"4'. I've searched and searched and gone to plus size stores, but they're either not wide enough to do the buttons up naturally, OR have pretend buttons and other attachments that give the impression it's not the same coat as available in regular sizes and style. Think the classic Burberry trench coat.", "sammytvr": "Oh and knitwear without butterflies on them!", "serendipitous_maximus": "Definitely Active wear, especially Sports Bras! No one seems to be able to make a supportive bra, that doesn't give me Uniboob but still keeps the girls in place. And for the love of god, why are the straps all less than an inch thick and dig ditches into my shoulders?", "victoriacoops35": "Fashionable jumpsuits for the summer girlie styles and then funky fitted jackets and shirt dresses for winter.", "amira320": "Bras that have a large back strap, the cups come is large sizes but the back straps are always still too small even for the smaller cup sizes like C & D. Also tailored trousers for work that aren't too tight or too wide leg. And a proper winter dress coat.", "saradarmoore": "A good quality real leather jacket in a classic style. No stupid embellishments. Great quality, well cut jeans. The perfect cut, great quality tshirt. Just great quality, well cut for plus size basics.", "mizwoochic": "Basically the ish one sees in Zara but in plus size.", "curvysam": "Body con dresses with decent straps so you can actually wear a bra", "honeybee664": "Pretty floral dresses in cotton fabric.", "ntaylor1846": "bloody nice blouses! that fit my boobs but arnt baggy around my waist x", "andrea.ulla.madeleine": "I have huge boobs (thanks hormones and w/e) and just a good looking button-up that doesnt look baggy just because I have sisters up top but still wanna look smart. I already have to size up and boobs plus big upper arms make it difficult to find good looking shirts", "96arthurg": "Deff amazing on trend work wear but also workour clothes", "edgeworthington": "Work wear - went shopping for a suit today for a forthcoming interview - and found nothing suitable in my size.", "missylamour": "Pretty bras. But for bigger girls with small boobs! Frigged if you can find a good selection in a b cup over 46/48!", "becky_vs_world": "Tailored workwear. I wear same boring stuff everyday for work as im never inspired", "jenjennifer": "A button up. One that actually buttons without popping open at the chest if it's fitted at the waist and isn't super baggy at the waist if it's fitted at the boobs. Places like ASOS are making it easier to buy plus size trendy stuff, but I'd like to see more of the trends in plus size available everywhere. Especially in patterns other than large floral.", "hannahkomp1": "Dungarees, high-waisted jeans. Seen someone mentioned skinny jeans that are skinny at the ankles - 100% agree with this! I also find it hard to find comfortable footwear in particular daps and boots, I'm a UK Size 9 but I have a clubbed foot so my feet often swell so I need wide shoes and sometimes even a size 10. Would be great to have more of a choice in shoes and trainers without paying loads of money.", "dharrisballing": "Fisherman-style cable sweater in tunic length!!!!! Pretty kimono make of real silk, french terry jeggings (have one pair, never found another!), lightweight, curvy full-length coat that skews classic-not-cheap. Cotton undies that don't rip at the waistband.", "bridgeemery": "White, skinny jeans that aren't so thick that you feel like you're wearing a cardboard box, but also aren't so thin that al your cellulite is highlighted.", "thecurvyblog": "Beautiful lace plussize bras and panties! Or at least i cant find any 😅🙄 more usage of silk and cashmere products 😍", "roundraglanroad": "Blazers, thigh-high socks that *actually* stay up, and anything with big shoulders and balloon sleeves. Whatever you make, though, for the love of god: please ship internationally!", "chippytownlass": "Nice shirts that do up across big boobs but don't then hang down off them like a dinner lady's tabard!", "itskeziahhh": "Dungarees that ain't right in my hips and to small for mt boobs!! A nice leather skirt with a bit of stretch that doesn't look horrible and like a plastic bag", "leesh.laub": "A classic, timeless blazer", "hollys.graphics": "A long trench coat like long and elegant and sexy", "meowwsummer": "Wide/plus boots that are comfortable", "amoj.j": "Workwear for the office that doesn't dig into my stomach 😭 would love some nice black slim fit trousers and tops that are are bit longer so they cover my bum", "_emma1729": "I wonder sometimes who the hell designs some of the outfits I see in the high street shops. I hate shopping. I don't do somethings sometimes because I can't find the right clothes. And that's from going out with the girls too going to the gym. Your on to something if you could sort this out. 🙏🙏🙏🙏💕", "mrsmickp": "@daniellevanier dresses for work that are long sleeved (past the elbow) and sit below the knee (mid calf length). Which would save me wearing a cardigan as most dresses are short sleeved or dress isn't long enough past knee. Or trendy wide fit trainers or slip on shoes", "kayleighloren": "High-waisted jeans. Also, as a tall person it's so hard the find cute shoes for over size 11.", "jen_bunniii": "Dannnnnnie, skinny jeans that are actually skinny at the ankle, Asos curve & RI are the only two places that actually fit right! Also the lady who made the comment about Tailoring... would pay big money for that so please ask her to quit her job and make it 🙂 as always love your style and outfits keep blogging ❤️", "mayah.camara": "Mini skirts that are a little lower in the back and still sit cute without your arse being out lol", "cerrraaaa": "Long tees that are actually wide enough that have cool graphic or fun sayings", "karenburrows1": "Short sleeve Tees with a decent length sleeve, A line anything and quality jeans that fit...", "lilykittee": "A pretty bralet or a thin knit jumper that isn't clingy", "the_bennie_show": "Mini skirts that are a bit lower on the back, camo trousers and cool utility jumpsuits/boiler suits. Leather dungarees!!!!", "bearfacedclaire": "Good quality tailored trousers!!! Tartan in my absolute dream world 😊😊", "thefox77": "T shirts or tops that are always too short! Long line stuff occasionally comes out and is ok but normal tops just a little bit longer to cover the boooooobs! And all the other bits 😊 love this! Xx", "thebiggerblog": "A perfect preppy skirt, checks and all", "tillywilz": "P R I N T S. P L E A S E. I've got a thing for jersey tops with a scoop neck detail. I can find this top in block colours, but I would love to see more versions of this with an all over print 😍 the scoop neck is so flattering for me - v-necks are overrated 🙈😜", "t.rain": "I have a lot of trouble finding high waist jeans that are skinny throughout the leg and fit well.", "moo_and_2": "I'm plus sized and have marfonid habitus ao not only am i an 18 i have arms much longer than my frame and lipodema (excess fat) on my upper arms. Finding anything that fits properly is a really big issue and soul destroying 😞", "cla1recooke": "Tall options in plus size. For some reason brands think of your tall your also small/have no hips/bum", "mummy_of_4_people": "A coat that doesn't make me look massive 😞", "rachelharding79": "Love your ring!", "katerolo14": "Lounge wear. X", "oknotperfect": "Clothes with bold prints. And pinafore dresses that women with big boobs can wear. Also jeans with pockets that actually cover your bum cheek and not just a small section. I could go on.", "drmelbell": "A leather jacket, can't find one long enough or with detailing", "carlyw1984": "Wide ankle, fashionable ankle boots. Think I've tried every pair simply be and Evans have to offer but most won't zip and the few that do wouldn't fit over trousers.", "charlieee0492": "Tailored trousers & skinny jeans! They never fit quite right! The only pairs I have dig in to my tummy really painfully - sad times!", "loobie2390": "Oooh... bold prints and bright colours thank god for Monki or I'd have no clothes!!!", "j_w83": "Work wear this isn't polyester always scared my chub rub will cause a fire with it rubbing together 😂. Wide calf boots that aren't wide in the foot as my feet are the only part of me that isn't wide!", "the_little_pink_hippy": "Petite length and plus size would be amazing!! I'm short but need a plus size and can't ever get clothes to fit me!", "jex_nicole": "A proper pair of denim jeans that are actually tight in the waist so I don't need to wear a belt that bunches the waist together just so they stay up 😭", "traybo77": "Extra wide fashion footwear, for feet that swell", "leni_mount": "Thigh high boots with flat heel. Calf too narrow, ankle and foot always too big", "hottie__tati": "Jackets that's aren't so wide cut and long. Jean jackets and leather bombers that are actually cropped in the back and not so long and boxy that they cover my butt, because all plus size women are not tall!!!!! I hate the long sleeves and all that", "svmleigh": "jeans that are actually fitted at the ankle. i find plus-sized skinnies always have the baggiest ankles 😭", "bloobadi.blahbadi": "Bohemian, LONG embroidered tops in light fabrics (not polyester) that are not skin tight or a tent. The ones I find are always too short or way too big. Just loose, flowy, easy and I would love a long embroidered denim shirt. I'm always looking for simple jean jackets and leather jackets without embellishment that hit just above the hips and a lovely long winter coat in a more exciting print or that has interesting details.", "madeline_meunier": "I totally agree with @fatfemmefabulous ! Silk would be amazing !!! ❤️", "mimmielkisal": "Classic coats, jackets and trench coats for work or occasion wear l", "debbiewebbie6": "I'm probably the only one, but I'm plus sized but have small boobs, I struggle to get a nice bra! Not many places do a 40b!!", "_stacey87": "If you bring your own range out life will be MADE!!! Use some of us followers as models 😘🙋🏻 @daniellevanier", "sarahdeans65": "Tights that am not pulling up every two mins x", "aleonak": "Black leather jacket that isn't either a giant tent or a squeaky tight mess I have to fight to get out of", "blancesque": "Stylish coats. I'm honestly struggling to find on trend coats this year 🙄", "fashiontweet": "Literally every piece of clothing in better fabrics. I need cotton, cool wool, cotton based jersey. If I get another piece made of polyester I’m going to scream.", "danieleinlondon": "Oh and tights!! No one makes decent tights. I've tried everything in the UK none are any good.", "velveteenfemme": "Serious sports luxe pieces that aren't just the same mesh top & leggings combo. Sheer pieces with loads of embroidered detail. Ankle boots that are made to fit super chubby ankles 🙌", "eyaafe": "Would love a decent white shirt. Fits the bust and isn't sheer or see through!! I don't want to have to wear a cami underneath", "beckyjaynegj": "Dresses that are made in material that doesn't cling like jersey. WITH SLEEVES TO THE ELBOW. omg gimme sleeeeeves. Also any tops that actually go to a length that is long enough. Not cropped.", "_tinyforest": "A beautiful and supportive but reasonably priced bra?! Shirts or jeans that aren’t jeggings", "karenmckinven": "Clothes from Zara, designer brands", "chris.southgate": "Goddess dresses , not a good luck with a big tum but then what is", "sallysparkel": "Anything that isn't a bloody kaftan !!!!!! Bloody nylon with gold thread 😱😱😱", "roseplusone": "This is SO BORING! But outdoor wear 🙈 like walking trousers,fleeces etc 😂", "molliecampsie": "Mom jeans plz sort us out", "_aimeejoanne_": "Always searching for good tailoring!", "leopardandtartan": "Definitely jeans @daniellevanier, wide in the thigh but still fit on the waist.... Impossible to find! Shirts with wider collar sizes, big means big everywhere not just waist!!!! 😘", "sam_elliott_culture": "Cigarette/ slim leg trouser", "kim.brebner": "Modern Bohemian style (like freepeople)with lots of detail and trims. Literally cannot buy it anywhere in the world.", "theblondescouseone": "Hoodies that dont have a tiny head hole like i bought a xxl i would like a bit more room in the head space haha", "gueldenesmaedchen": "Boots, fancy bras, tights, blouses😣", "april_ionson": "The boyfriend blazer in grey, with boxy shoulders and long enough to cover the booty!! Normal arms, not cropped, but slightly nipped at the waist for a teensy bit of shape!! I've seen close, but somethings always off and i've been looking for three fricken seasons now ugh", "rachleahy": "They make plus size jumpsuits but when you're the big belly, no hips kind of plus size, they look a bit shit 🙈😂", "gailcoles2808": "Smart trousers! If they fit around my Buddha belly I look like I have the 7 dwarfs giving me a good time around the groin and thigh! Oh and a beautifully tailored white silk shirt!", "hannahhen82": "Just clothing that isn't primarily made out of polyester would be amazing", "k3181": "Forever searching for quality stylish boots in a wide width e.g. Like Steve Madden , carvela", "lollya85": "A biker jacket/ any jacket with fitted sleeves. I have large upper arms and struggle to find a jacket that accommodates them and fits elsewhere", "lifewithlinzi": "Plus size tops that fit huge boobs! I'm a 18/20 but a 34J and I have to buy 22+ tops and then they never fit right", "chrissywg93": "Skater dresses that fit over the boob area! So many just stop mid boob where it should be lower. Totally eliminates any waist I may have and can create an annoying uni boob look", "simplyeddi": "They have some dark jeans with paperbag waist and a peg shape leg on Asos white. I love them but I need a 20. I keep looking at them and lusting.", "jenirayner": "Really nice trendy party wear that has sleeves but doesn't look your nan would wear it !! Everything appears to be sleeveless ! 😫", "stellaboonshoft": "Fitted dresses in fabrics that aren't jersey/polyester. dresses that don't have a fucking cold shoulder lol", "ewatson07": "Defo workstyle clothes- tailored trousers and shirts. Also jeans- I'm struggling more and more to find a good fit jean- boyfriend style or skinny, river island used to be my go to but they seem to have gone downhill x", "patriciagordoncollins": "@finding_rose omg yes 🙌🏼🙌🏼", "daisy_mae_robb": "Denim jeans - that actually fit. That don't go baggy after a few minutes, that actually fit at the waist and in the leg. Actually, any kind of highwaisted trousers/a line skirts!", "labelsforlunch": "Anything by Gucci", "selfishcurves": "work-appropriate jumpsuits, cashmere jumpers or boyfriend cardis under 100€, gloves in many colors, simple smooth not wired and not padded tshirt bras and matching panties. And most of all a nice red long robe with NO frills or prints. Been looking for one for years. Thanks for asking ❤️", "milawears": "Never experienced owning a pair of tapered trousers that are made from a decent fabric that fit all areas well... there's always a compromise! X", "mgnlghx": "Tailored pieces blazers and trousers etc not work wear like fashion prints and colours x", "mich.girbest": "Bikini!!!", "ainhoavdc": "Jean overall!! Regular/affordable shops in Spain only have small sizes 😭", "makirenton": "Comfortable work clothes - especially shirts, that fit nicely, smart trousers, jackets..", "chloeturnip": "Actual nice vinyl skirts and trousers!", "town.called.alice": "Trousers! Short people can be big too and often the larger the waist the longer the leg!!", "gtgmcg": "I would love a well cut slim tailored suit or YSL style Le Smoking in black, graphite grey or midnight blue. Very slim cigarette trousers but also a wide leg available too. No one seems to do this or think a fat woman can wear slim cut tailoring well. We can. If I was to win enough £ I would leave work and start a capsule line of edgy tailoring instantly", "xxx_stephanie_morgan_xxx": "I find it hard to get jeans that fit me nicely because my thighs are quite big.....also a body-con dress.", "dianasaladpot": "Silk anything. I adore it but finding it in fat? 🙃 I would guess @gtgmcg ‘s answer would be my second choice: non polyester tailoring", "ellewaggers": "Properly funky tights", "nolwazinkwandla": "A top that shows off the cleavage without being tight around the tummy", "molthorpe": "Struggling to find a nice longline camo jacket without some sort of outrageous wording or embellishment on it 🙃😩"}