{"karuna_vashist": "It's so beautiful", "deba_0000": "She is thinking of the blue chaotic waves and feels them more real than the reality she dwells in...", "sunainashenoy": "Is it finding her peace despite outer turmoil?", "sundermishra_9898": "Woww🔥❤️❤️❤️😍😍😍😍💞💞😍😍❤️❤️❤️❤️", "m_mousami": "Inspite of all wounds she had ..the pain doesn't make her weak she still stand for herself", "klausmikaelsonnnnn": "Abe tumse acha toh meri choti behen sketch krti h..😕😕😕", "leenabhasin80": "I think I need a haircut🤪", "delaneyshifali": "Ugly", "deepuyadav347gmail.7243": "Take care", "the_dressmaker__": "Waooo", "cherishingmum": "Reflecting on the beauty and chaos of life❤️🌈", "haspreetaujla": "Why her ass not on the table", "hemantgrover20": "I don't know what she is thinking but this art work is shit on a serious note", "aanyashroff1600": "Don’t know who is more beautiful either you or your thinking", "ashishsinha1186": "The next target..to win over..;", "scorpionshine": "@tahirakashyap it’s a decent start but it would be so awesome if you gave impetus to artists who don’t get any appreciation for amazing art work they do. You perhaps can enable so many of them! Waiting for your reply to this. Have a safe one!", "jishnu.ck.568": "Nice", "disciplined.awara": "😍🔥wow", "good.singflowers258": "👼💜👼", "_apurvasin_": "Thinkin if my a*s isn’t on the bench... how am i sitting?!", "thewritinghuman": "Thinking about what is new hobby that i am gonna be busy on😍😝😍", "ananya_gusain": "❤️❤️❤️❤️👏👏👏👏 beautiful", "rashmi_2791": "She is dreaming of having rest, to sit and relax. Which some women dont get. 🤗", "zoyaayy": "Love the background ❤️", "august_neha": "She is thinking, sleeping with wet hair is a good idea to get the bouncy hair 😜", "studysharegrow_2020": "its nice", "netri_barot_2002": "💕💕💕💕", "karen_the_kapoor": "This is my whatsapp dp now. Absolutely beautiful 😍😍", "hiddencouple": "Can I include you under essential services during quarantine,cause its not possible to survive without you my sunshine 💝", "parwanavivekanand": "@tahirakashyap she is thinking kash dunia ruk jati thodi der..( andar ka bhuchal )", "arunaai_mahi": "5 crore", "bhavsarvarun": "Happiness Always Sarround from girl @tahirakashyap", "divya__vig": "Hoping for a new dawn", "nehabhattacharyya": "When did I grow up😘", "vedisha12": "The scars on her body can’t scar her soul which still radiates positive energy.", "joselinelal": "Lockdown khatam hone k baad ghoomungi kab 😜😜😜🤣🤣🤣 @ayushmannk", "sharanya__nair": "Wow ma'am!!! That's such a beautiful piece of art!!! ♥️🌸", "angrymonk7": "She is sitting on the edge probably thinking about the adventure or the Dreamland she visited .. she is happy. @tahirakashyap", "atishisengupto": "Why would someone insult the van Gogh's style that way😶😐", "maroohami": "She is thinking about life cycle", "humeras_artistry": "Sitting on a bench eyes closed as the background says lots of tunes playing in her mind", "upasana_2407": "👌", "_.ananyeahh._": "Planning things to do after quarantine 😂😅😆", "smitichhabra": "At last i can sit in peace with no fear of getting more bruises.", "the_heart_is_what_matters": "Beautiful painting", "mjfarooqi89": "Yeah kiya bana diye ho", "just.nail.it.k": "Maybe she is thinking what pose to make, since she is being clicked 🤭🤭🤭 @tahirakashyap", "art_zoyamanan": "💕💕💕💕", "isha_sachdev13": "Wow , Amazing 🌼", "shikhamishra_shil": "Beautiful 👌@tahirakashyap are you going to have exhibition in the years to come?", "ziba_by_vidhi": "Wow!", "sparshahegdee": "Amazing", "reshma5045": "Van goh feels and thats a compliment", "sarkar.sushmita14": "Save the world from Covid-19", "khushbu24": "Everything around that girl is like a rollercoaster yet that girl is still holding her dignity no matter what is happening around !", "qchougledr": "Amazing 👌👌", "nutribondbyhudashaikh": "Beautiful ❤️", "sadia1784": "This one is coool❤️❤️", "soother_divine": "@tahirakashyap she doesn't really seem to busy with her thoughts ....she seems to be free of chaos created by thoughts ....she seems to enjoy the nature with a free spirit", "_soniajhinkwan_": "Thats really beautiful!", "shraddhayuna": "She's thinking when the quarantine is gonna end...lmao..,😂♥️😚@tahirakashyap", "sushma_luckygirl": "World 🌍 will heal", "raybluebird": "She stands out in all that chaos❣️like she always does❣️", "sswats20": "Wow!! 👍👍", "_.adv_.toor": "She is bruised like me,!! N she is smiling,!! It’s like she is sharpening her weapon and telling her assaulters that it’s not over,!! She still has life in her,!!", "ruchika_10": "I think, a lot of things are going in her mind and she is cherishing those past monents of her life and happy about her life...😊😊", "anjum9144": "Wow beautiful", "king_vinay4": "@akashn7071_ bhai dekho ye bhi bana rhi h.....ab to bana de tu bhi🙏", "palette_of_colours": "I have my free art workshops on my page do check them out", "mannalii": "Sticks and stones won’t break her bones @tahirakashyap", "poojasaxena_": "Allot of bruises are there on her body and allot is going around the world and she thinks whether this world will accept her or not but she doesn’t know that all what she thinks about is all in her head.", "roo_sg": "@butterscotch_and_stethoscope reminded me of your quarantine art!", "indu_inshail": "😍😍😍Amazing yaar.", "theviz02": "Still you can't beat majnu bhai", "rishi_mtb": "🌟", "_preedee": "Chaos around Calm", "amit_rajput_vip\nVerified": "Verified", "nomadic_wildflower": "Imagining new day with lots of positive hope...", "parishajindal": "Broken", "1483.pooja": "❤️", "kewani_heena": "Chaos outside!Serene Inside🙌", "suryavanshipraveen": "She needs someone to sit with her and listen her. She wants love.", "nimishaagr": "How to feel peaceful in a world full of chaos!!! ☺️ and I lovvvveeee the colours here!", "vas_dawn": "So talented", "ashima_25_arora": "She is probably thinking and saying it aloud in her mind \"Bring it on Life, I am game\". Looks like a brave girl to me⭐", "riii_4250": "❤️❤️🌻its beautiful like you mam", "sneha_._chakraborty": "♥️", "sunidhirana": "She is thinking that when the corona virus will get finished ... ☹️", "shweta_7874yahoo.co.in": "U made it??..its so like you😂😂...so like you.", "shivangi_chanana": "Did he ever miss me? 😒😂", "prithsingh": "Chanting \"Go Corona, Corona Go\"", "happy_feet_94": "i think she is just breathing. :) @tahirakashyap", "satwinderkhaira": "Such a talented woman🙏🙏🙏", "babar91099": "Iss Paint kay Peechay Ye Gorgeous Lardki kon hay ? @tahirakashyap 💗", "reematyagi0305": "Ive come so far, i never knew i was so so strong😇", "chhayajani": "Her physical scars r visible, does anyone sees d scars on her soul...", "human_noreligion": "WOW", "naveearun10": "Wow... Loving it on many levels !", "rahul7090": "❤️❤️", "cool_diva21": "Wow u make amazing paintings...so colorful and gives positive vibes", "samikshachoudhary1995": "Lockout k baad shipping kya krni hai", "mriduuuuuuu": "She is thinking about how to save the world. 🌺", "manjushreerajaram": "So many thoughts to think but feels like she wants peace d most .", "sanju_gadale": "🔥🔥", "tezeswari": "I maybe alone, but I am not lonely !", "pearlmoonlight": "Nice", "floridmaven": "I can handle the chaos!💙", "she_found_colors": "Nice.. its kinda your version of starry nights...", "vish1009": "👌👌👌👌", "beenasudin": "In this solitude also she seems to be in peace with the world❤️", "abhishekchakrabarti5": "I can definitely see shades of Starry Starry Night in this, @tahirakashyap ma'am", "minakshi_shirke": "why me ?", "drjyotsna88": "Which is a bigger storm.... the one in the head or out in the world??", "vartikagairola": "I'm the best!! And I can do it😍", "shashi_07_original": "Amazing drawing mam....🔥❤️🤘❤️", "alexander_supertramp2.0": "She is in pain in the midst of chaos, with her smile intact.", "ritz_zzzzzzz": "😍", "gautam_simanta": "The lady symbolises your conscience. With time it has become fragile sort of tearing apart. The background feels really moody agile and melancholic. Maybe an allegory to spectators around you who judge and comment on you that you don't quite acknowledge. Yet the calmness of the lady symbolises your way of dealing things. Long story short, the calmness amongst an agile storm is what makes you, YOU.", "isha_kaloya": "Beautiful 👌", "priyaarya36": "I’m in love with you tahira ❤️❤️", "swatisaini": "Beautiful", "ayushmannkian": "She is just relaxing for a moment thinking abt what she has to do tomorrow because she is a mom n she is never free", "rathimanvi22": "Admist in her chaos", "ishbinnidhi": "She wants spin in the realms of outer world", "sanaasajan": "She’s chillin", "thesoulfulempath": "Wow! This is beautiful 😊❤️", "anjaligeetarora": "How amazing i am ...what a beautiful choas of colors ..nmrk", "drminal_bhanushali": "Very beautiful😍", "anjali_shere": "When will this corona go? She is thinking that!", "susmitadas19825": "Can u make a family picture with khurrana family PLZ .", "mahek_rj": "Teach me this art! 😍", "divyavaddani": "@tahirakashyap are those bruises on her body?? I guess she is thinking of Freedom", "swagsuch": "She is thinking it's actually only between the Almighty & me ❤️🙏", "aman.arora007": "Speachless painting tahira. Ma'am....", "etishakohli": "messy painting", "naikshreyasuresh": "Chaos in her mind...@tahirakashyap", "mayank._.009": "This is nothing but your past during cancer🙂", "itimesinsta\nVerified": "Verified", "kuma7004": "❤️❤️tahira mem so proud of you love you so much❤️❤️", "__gracie__a": "May be thinking about , when will this COVID-19 leave our planet earth ,🥺", "amirzaidi96": "Hair color 😍😍", "sky_moon_star_nothingness_": "You are a fab painter💗💗", "sweetzpat": "Beautiful painting😘❤️", "mansi_mendiratta_10": "Thinking about a lot mess of things in her life which created a cloud of disturbed thoughts but they will be clear when she chants Nam MyoHo Renge Kyo and a better picture and wisdom will ponder", "_arkaan_0105": "@tahirakashyap it's amazing😍😍🔥", "amrataanil": "Wow, can I have it @tahirakashyap ?", "sukanya4754": "Awesome 🤗😍.... She is thinking \"I hope now we will respect each living creature in this universe, and understand the importance of how to coexist with love and happiness!!\"", "anujamishra1357": "Wow so good😮👏👏", "atulk__s": "Reminding her beautiful moments😊", "shanu_shawani": "❤️😍", "priyankapakhetra": "She is thinking about deaths due to corona virus", "komaljoharle": "She is breathing as pure as Mother Earth right now 😇", "avanip.1409": "What if I am actually fine, I just can't see through it ❤️", "parullchaudhry\nVerified": "Verified", "farahdubash": "I guess she’s thinking that this is the way my heads going to spin if people don’t stay at home today! 🌏😘😆🙏🏻❤️", "iamrahi.06": "She wants to chill on that bench with that BACKGROUND ♥️♥️ @tahirakashyap", "ravidubey_obsessed": "That’s so fabbb 😍😍", "hamsavenichidananda": "A woman who is ill treated by the men in the society and is thinking whether she will get justice if she raises her voice.", "sudhir_shad_mastfakeer": "I think... She is following janta curfew and waiting for parlour to open so that she can go for smoothening to get rid of her noodles like hairs", "titas_basu": "She is waiting for the epidemic to end 🙏🙏", "ayushmanniac__": "Amazing😍😍😍", "achala_nupur": "In the midst of off this commotion....I am still STRONG, Courageous and full of HOPE AND LOVE ! 💚💚", "nikkiwalia5": "She is in a wind down mode & thinking about all those times when she gave her power away and also about all those times when she thought she has hit the end of the road but it really wasn't the end.", "dhruvilbarot3004": "Healing process @tahirakashyap ❤️", "itsthesumer0001": "Wao🤩", "ishu.goswami1996": "Mam it's very beautifully just like you ❤️😍😘", "banodeishant": "200 rs", "power_as_me": "Did I see a Van there", "siddarya9": "Omgggg @tahirakashyap 😍😍👌", "bhargavipp": "How colourful life is 💕", "thefilmyofficial": "😍😍", "jaswirkaur\nVerified": "Verified", "tanu_dsp": "She is thinking , analysing and deep diving into her inner strength.....so that she could once again conquer her world.... love#the courageous lady#love womanhood", "sukhmani90": "Scarred beauty slaying in style!", "local_videshi": "Love that she is curly haired 💞", "rucha1094": "The bruises on me have all made me strong.. I have cried for too long now... To the world it will just seem as a girl calmly sitting on a bench.. but nothing in my mind right now defines calm.. there's a whirlpool destroying their realm..", "kalpana.rana16": "'This is Me'! 😇", "sharma.aparna9": "Itna talent mera sab digest kaise krenge!? 🙄😳 corona plz jldi se go na! 😏😣", "palakgarg21": "Naice.✔✔✔✔", "__itsaneeta": "👌", "aryanrajput217": "Cool ma'am...👏👏👏👏😘👌", "tanu_priya_264": "😍", "ishagujral2018": "Spreading colors of happiness around😊", "kumkumhore": "Love the.painting💕🌹", "sumaidkhan.sk": "👌", "ayushmannk____": "So beautiful 😍♥️✨", "_the_photo_factor": "Staying home and staying safe", "anujaahluwalia": "What next?", "taapsee\nVerified": "Verified", "be_wat_u_wanna_be_": "What all is happening in the environment all around🙏😊", "ameshizm": "i think she popped an extra tab", "soumya_kk": "Kitna sukuun hai gharpe 😇", "roseleen77": "She is enjoying her ME time at last. Not allowing the chaos outside to disrupt her peace inside", "findingshanti": "😍😍😍", "ankitasarmo": "Carefree 💁🏼‍♀️ & Positive", "komal20to77": "A very pretty one!! In all the chaos around trying to calm down and pray for the world to be the same again!! And she’s looking so lovely which shows that she’s positive that it will happen soon!!!!", "tanishaamukerji\nVerified": "Verified", "mansithukral": "Just where to begin to heal my soul?", "priyam_pratyush_sahu": "Corona go...go corona 😂😂😂😂", "simplynupur": "She is dragon king's daughter thinking why grown ups can't understand what 8 years old can understand that is oneself of self and the environment", "tahira_amara": "She is confident,knows she can handle anything ❤", "j.jayalakshmi21": "Awsum", "jessinda_mathew": "May be thanking the almighty for all the wonders of life ❤️", "nishant_tiwary25": "Beautiful👏👏👏", "mohanty.seenu": "She wants to write a new story @tahirakashyap 🌼", "tusti175": "Excellent", "mokshmendiratta": "@tahirakashyap @ayushmannk there is so much to learn from you guys. Love u ❣️❣️❣️", "archanaapania\nVerified": "Verified", "deepika.koul.58": "@tahirakashyap she is waiting for her friends after the social distancing ends ☺️", "resh_nirvana": "She's thinking of her young age/college days or tough days she has gone through ..may b", "arpitasoodsonar": "\"Well! I am the brightest star of the universe ready to spread sparkle all over my life\"", "karankilam": "Those scars seem to me signifying a fight well fought by a brave girl.. against all the troubles and turmoils in her life.. and now she sits peacefully awaiting for all the positive vibes and blessings.... Ps: let me know if that was right..?🙄", "muskaansamtani": "Finding her own calm in the chaos", "i_am_rabbayyy": "🔥", "aasthachiku": "Or maybe she is thinking nothing and living the PRESENT MOMENT.", "sammaerajaiswal": "She’s thinking about, where she was and where she is right know perhaps a proud feeling for her😘❤️⭐️", "zisuzie": "Resembling a lot of van Gogh's starry night vibes ❤", "singhshashi090": "She maintain social distance ... to avoid spread of corona like all of us .... ❤️❤️ .", "im.r.bhatia786": "Wow nice", "ayushmannk_lovers": "😂She is thinking : When will I get my noodle-like-hair straight?...Great Work Ma'am👏", "chakori_shukla": "She is thinking \"sochna kya jo bhi hoga dekha jaega\"😊😀", "sainyaaylani": "When will she have wings since she wishes to fly ☺️😍", "nagendrabsingh": "@tahirakashyap @ayushmannk @aparshakti_khurana I think she is asking how does women needs to be respected and going thru below thoughts in her mind-  If we must celebrate a day for women, let us celebrate freedom from stereotypes, from expectations, from idolisation, from sacrifice... Stop congratulating women for being the secret behind a successful man... Start saluting them for being successful. Stop saying the mother is sacred for all the sacrifices she makes... Try to reduce those sacrifices! Stop telling women they are beautiful... Try telling them it's not important to be beautiful! Stop praising her roles as mother, wife, daughter, sister... Celebrate her as an individual, a person, independent of relationships. Stop justifying her necessity to multi task.... Give her a chance not to! Stop these constructs which are aimed at making her strive for an impossible balance... Let her be inadequate... And happy! Stop making her look at herself through a conveniently male viewpoint. Let her be imperfect, whimsical, irresponsible, boorish, lazy, fierce, opinionated, loud, flabby, ungroomed, adventurous, unpredictable, unprepared, impractical....", "mdjakerul33": "Painting is charming", "lovika89": "She is feeling lonely n sad.", "karman_jithushmann": "Seems like she's listening to some kind of music...which gives out positive and peaceful vibrations...introspection and retrospection❤️ This is beautiful😍♥️", "___.maisha.___": "My body is full of scars but still I dream. I dream of a happy life which indeed I deserve. 🙂", "poojasaini1410": "She is feeling all those positive vibes around her after doing morning gongyo 😇", "cuteemalvika": "❤️❤️❤️❤️", "thepoeticmusingsofann": "It's so nice having no humans around #socialdistancing", "kiranpratyusha": "Hello mam. I am a big fan of yours. You inspire me. A lot. Off late u are posting pictures of your paintings... I am simply in love with them. And this particular is awesome. I so love this one. I wish i could have this to adorn the walls of my home. Please do keep sharing your art work and other works too. 😘😍", "shikha736": "reminds me of...im just a little bit caught in the middle...☆Lenka", "mumz_the_way": "She is exploring the different colours of water.. “pani da rang” 😂😂 @ayushmannk", "anki_sim0n": "She is doing #selfquarantine and is in peace♥️", "chaubey.ji.ki.beti": "❤️", "aforakhilesh": "She is thinking \"Bas coro-na\"", "jigyasa.mishra": "Realising quarantining ain't that bad!", "singh_sneha_10": "Maybe about you mam because u r so awesome .lots of love😘😘", "yash_chitkara": "@tahirakashyap 👌👌👌👍👍👍😊😊", "prerana_gandhi_": "Awesome😘", "beingmyownherosince1997": "The positivity that patience would bring.", "rathirishika": "Kaash exam cancel ho jaye 😂😂", "rohithjoshi3": "I guess she is waiting for someone", "avanee_deo": "Inspired by the starry night !?♥️", "castingchhabra\nVerified": "Verified", "a_h_parmar_1999": "Amazing......😲😲😲", "chinkitaagrawal": "Why are people not sticking to guidelines of government and risking everyone’s life @tahirakashyap", "thepradhan_": "She is calm amidst the violent sea❤️", "amazing_anj": "Sending thoughts to everyone that we shall over come together #corona", "princyyyyyyyyyyyyy": "she wants to sleep", "roshnisharma2024": "This earth is getting its space and so do I", "shiprahr1985": "She is thinking how world has een changed. I could go back in old times❤️", "chetas8090": "She is arguing with her own thoughts! 💭", "hirensakhareliya": "😍😍👌", "kunjan_._parmar": "Awesome", "_sonakkshi": "This us fabulous 😍", "kaira8365": "Corona 😢", "upma111": "Wow❤️"}