{"shiningstar0901": "More and more power to you🙌", "sidrajputk": "Fighter!", "aartikashyap201": "Nice kashyap ji", "786._saurabh_being": "तुम क्यों जा रहे हो दिल को तोड़ के,, प्यार की गलियों में मुझे अकेला छोड़ के,, और क्यों हमें बदनाम कर रहे हो, प्यार की गलियों में नीचे गिरा के,! एक बच्चे की जिद की तरह, रोने लगा हूं, आवारा की तरह तेरी गलियों में मैं भटकने लगा हूं ! हां समझा इश्क तेरा समझा प्यार तेरा फिर क्यों तुमने बेतन्हा का आईना, दिखा दिया! मुझे एक ख्वाहिश थी मेरे दिल की बेपनाह तेरे प्यार की गुलाम नवाजी तेरे जिक्र की, फिर क्यों जा रहे हो मेरे सपनों को लेके! क्या तेरे इश्क में मैं बिकने लगा हूं, कि किसी के प्यार में , सर झुका दूं फिर भी क्यों गले कटता नहीं क्या मेरे प्यार की कोई औकात नहीं,, या मैं तेरे शहर में अकेला हो गया हूं ! इस भवरे का कुछ तो करो खुदा! Saurabh Lyrics 🙏🙏🙏 please help sir", "siddhi_mesta_volvoikar": "Wow...such an inspiration you are😘", "shabrez_ghosi": "Bhai kyo kari farhan akter se shaadi🤣", "meenalbindal": "Hi @tahirakashyap ...it's so cajoling n inspiring to see women who have faced the scare of the big C n have come out of it has warriors..I am one of them too..really good to see u back to ur gyming...my diagnosis n treatment happened last year n my initial strength at the gym was zero...but today after 6 months on the floor I m strong...you are very strong n will reach ur target soon...lots of sunshine to u.", "muhammedayaankhan": "Mam my advice is that don't do ego lifting.. everyone has their ability to lift.. A part from that you have gone through surgery soo lift light weights only... slow and steadily you can increase your weights... all of the sudden don't go to heavy weight .. im saying this with my experience as im in a fitness field since last 10years ... may god bless you with good health and soon recovery.. all the best", "dr.ravi.patel": "C. Yes weight matters when lifting, but optimal form is more important check out my post regards to shoulder and chest workouts. I would recommend having your set done at 40-45 degrees instead of 0 degrees. You are prone to shoulder injury with that form at 0 degrees. Just thought I should let you know. Keep working out 💪🏼 Cheers💯", "koubyzak": "❤️", "chavannnn": "Strong woman 👍👍👍👍", "shanu_shawani": "❤️", "maialbeli": "You are 🔥❤️", "jasgeetkour": "True inspiration ❤ God bless always💕", "bhangrababies": "@tahirakashyap I’m a survivor myself stage 3 that too, you can go beyond 5 kgs on the surgery arm, the only thing is that it eventually starts to weigh you down. Irrespective of what the doctors say or said post my surgery, I still picked both my kids who were 2 years and 8 months at the time weighing a whole lot more than 5 kgs The body adjusts accordingly give it time and nothing like yoga and exercise to get the flow going. Wishing you health, happiness and love always ❤️", "asmita.nakhate": "❤️❤️❤️❤️❤️", "anywhereonthisplanettravel": "So proud of u.. nmrk 🙏", "aditi.kamra": "Inspiration to many 🔥 , more power to you ❤️", "harisom91249": "Cute", "surbhi_sawhney": "You are just perfect in all aspects of life bhabhi..... True inspiration to everyone 😍", "ritikansingh": "Sensei is with you & chanting for you. Gave me goose pumps! Been practicing for 11 yrs", "suby__20": "Love you lady💕", "priyammvada": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "binduksingh": "💕", "ayushmanngalaxy": "💕💕💕💕💕", "dr.pankajchandrapalariya": "Very good", "_preedee": "I'm so adopting this headband look. Too funky Harish!! Love it. 💜", "pramam_successfull": "Hats off to u, after fighting with cancer it's jus a 4 kg dumbell ur a hero 😍love ur dedication .", "rads100": "You look great!", "gitsybaby": "Wow Tahira. Slaying it!", "sunita_madhuri": "👌👌👌👍👍👍", "koke_penned": "Soooo sooo much love and light you’re an inspiration gurlll keep goo gooo goingg", "rennu_jaiswall": "🔥🔥", "deathbychocolateeee": "Leggo!❤️❤️❤️", "poojashreya_7714": "Keep going 👌👌👌😘😘😘", "lakhan_mhawar": "The woman ❤️❤️", "shreyaesthete": "GIRLLLLLL 💪💪❤❤", "_vinni_tyagi": "😍😍😍😍", "shomstar0714": "😚😙😚😙😙😚😘", "yogitakdalvi": "@tahirakashyap I am also a gym addict and have my left breast mastectomy and reconstruction surgery in two weeks. Your post gave me more confidence of coming back. Have been doing my gym and Yoga during chemos so helped my sanity levels stay in place. Thanku for posting this video.", "sumati.vadhera": "Way to go WONDER WOMAN ❤️😍👍👍", "ritz_1011": "More power to you Tahira... ❤️ ..", "wordsmithbynight": "So cool 😎", "little.miss.bell": "♥️♥️♥️ so and steady wins the race. 👏👏👏👏", "archanasinghdeo": "U r an inspiration", "hero_pitaji": "On point D, try Radhe Radhe. I use it when I do the heavy ones - helps. Really. 😊", "ananyadas0421": "❤️ Tahira😊", "komal20to77": "Awesome Tahira!! Can I join u too?? 11ish??😝", "faisalsoomar": "All the best", "sreyancu": "🔥♥️", "roopadara": "Who works out with glares on....", "being_polo": "Your zeal for life and everything is inspiring to us! Thanks @tahirakashyap ma'am for such wonderful posts! 💝", "arpita.durga": "Can't agree more on the point D.. 😂", "pilot_mommy": "we r super proud of u .. u r n inspiration to millions... keep it up girl😘😘😘", "apoorva72": "Go ahead... Slowly slowly they will allow you to pick more weight too", "bandana_narzary": "You're the strongest will soon be able to lift 5kgs and more. Love you 😘", "the1antara": "Mam, u are an inspiration for all woman, who had faced difficulties in her life, bt still has hope for best. #apnatimeaayega 🔥", "kashyap6480": "Love you guys and your positive outlook 💕", "neeti.tewary.singh": "Hi, I underwent breast cancer surgery two weeks back. My surgery was for the right breast along with some nodes removal from the right underarm. After how much time could you do weights in the gym. Please guide me. Regards. Neeti", "sure__sunshine_": "Awesome", "dishaarora3427": "U inspire many....U simply rock♥️♥️", "silent_knight_70": "Oxm 🔥🔥🔥", "ayushmannk\nVerified": "Verified", "dimple.bhanu1984": "Best of luck", "maahi.mahendru": "U r an inspirational", "charusuneja2": "May the Gohonzon give u more power n energy each day❤️", "aayush_khan96": "Keepgoing mam💪😘❤", "sanjoli__saxena": "😍👏👏👏", "arpita.rey": "@tahirakashyap U already look so fit tahira.", "tanishapatil19": "😍", "iamsonalibendre\nVerified": "Verified", "drsukhjeet13": "More power to you ❤️", "surbhi_berry": "Super love to the most strongest u @tahirakashyap 🙌🏻❤️🧿🧿💃 love u", "anand_parulekar": "@tahirakashyap - u r true inspiration", "chinkitaagrawal": "I think its always about how much more u can push urself now in current circumstances rather than thinking what u could do before....and with tht attitide one day u will be able to beat ur prev records....", "lisaraniray\nVerified": "Verified", "makeupmiraclesbymamta": "💖💖", "saiyami\nVerified": "Verified", "sharmaaarna": "Hugs and luv 💕", "_.butterscotch07.__": "❤️❤️", "_naik_prati_": "More power to you ❤️🌈", "jeelan________": "😍👍👍👍", "khan_sultan_x": "💪💪💪❤️", "magical_square01": "Lovely tahira 🔥", "kiara_mamta": "Superb, more power to you ❤️", "fatima_ashwaq": "❤️", "birdie5505": "You are amazing!! ♥️", "ritikab17": "You go gurrrrllllll!!! Been following your incredible journey! More power to you! 💥", "anushka_s_fc": "Inspiration ♥️", "surabhi005": "I absolutely adore your sprit Tahira! ☺️ Really refreshing posts! 🌸 You go Girl!❤️", "biggest_fan_of_ayushmann_": "You are an inspiration to all 😘 love you and we all love the way you are right now", "lisamishramusic\nVerified": "Verified", "asmitajagwani": "You inspire 🔥❤️", "manisha_._w": "Giving so many ladies a complex, you go girl👏👏👏"}