{"talhajutttz": "sexy boy", "snehuthecutie": "ek toh gand mein cancer hai muh bacha ke kya karegi 😂😂😂", "amanbinsk": "Sirf trivedi bachega 😂", "sp10_2258": "Kitny pyare baal hyn💛", "abhinav_the_gabroo": "Ye Jo mask pehni ho na wo v China se hi bn k aaya h 🤣🤣", "kulkarni.imrankhan": "https://youtu.be/slm0iz_Bjqc", "_.sidd__": "Don't wear masks unless u have the disease or are regularly in contact with a person who has one....save it for the docs and nurses who actually need them and would benefit from them...as an influencer spread the right message...not how fasionable masks are...🙄🙄🙄🙏🏻🙏🏻", "amir_nourollahi2": "کورنا است", "bhat_ayat___": "Kafir loog Apne fashion ki padi hn ...loogu ki Jaan ja rhi hn.... bloody hell...", "jyotsna.kumari": "Mask won't help if your own hand touches your face elsewhere in case of exposed to infection.", "_nikhilg_": "I think you should try pressing that clip over your nose so that no gap is left. That way it will serve its true purpose to protect you rather than making your left profile look better. Thank you...", "duttasarnali2": "Ain't these Masks too are made of china?? 😑", "rotalks\nVerified": "Verified", "nehabhatia007": "@vishant05 @sharma.akanksha @ridhi5", "prateeksunnyreborn": "So now u feel unsafe because of masks or riots, decide first. As ur husband supports Shaheen bhagh and fellow Bollywood headless chickens like Amir's wife feel unsafe are u also one among them. I just rolls down through insta and saw u putting these types of panic pics. Plz stop this shit business and get a life.", "m_aadill": "@imsqln", "ssmriitti296": "Mera khauf😈", "antara_mazumdar": "Tahira, please do not travel, you are still immunocompromised. The masks are not full proof. Stay home as much as you can.", "parishay.noor": "corona", "lavanyalav83": "wht her hair style name...can any one tell me plz", "shanu_shawani": "❤️❤️🙏", "eshu__manohare": "Looks like Mary Elizabeth Winstead 🔥", "aaryadevs": "Earth ki bohot chinta h na to sabse pehle gharo see Ac nikal ke feel do", "marcyjulka": "It’s been around for years. Btw, I’ve been to Delhi and never saw anyone going out of their way to smile at anyone. As for the “Whats happening to my Earth?” Lol have you seen the trash Indian people throw everywhere on the ground?!", "sadaam_daing": "What is the price of ur mask mam?? @tahirakashyap", "arastu_chattopadhyay": "Why do dumb people have so many followers. ??", "parulsurana22": "May you have corona virus 💯", "namiijaiin": "And fyi Mask can't protect 😀", "ishasankmani": "Seriously?? Are you some other planet or what???", "maryammaryam1482": "https://play.google.com/store/apps/details?id=com.creeks.worldmapproject", "meenaljainn": "How dumb! As if you didn’t know about the virus before you entered airport.. why do you even have travel duh!! @tahirakashyap", "somreeta_2209": "@tahirakashyap ..Pls don wear masks..doesn't help at all instead harms you..its a complete wrong information among general public specially in countries like India..coz of which businessman's r earning in crores. Plz visit CDC (center of disease control) or WHO for authentic guidelines and information", "themohitsharma00": "Felt same kind of things today while going out on road.. thought I was thinking odd.. totally relatable ma’am..😔", "itushar17": "Chodo yaar kuch nahi hoga apne ko 😄", "uniquemaulik": "@tahirakashyap listen/remember @jaysean 's 2012 song 😀", "televistatv": "You are fashionable🙂❤️", "dark__aks": "❤️", "arrrmaann": "Ma'am are u the daughter of @anuragkashyap10 ???", "cathykimchi": "Just saying, the masks don’t help, don’t prevent you from getting coronavirus. Masks are only for people who are sick to prevent spread to others. Now countries actually fighting coronavirus don’t have enough. I work for one of the major hospital centers in the US and we are rationing masks every week.", "sherryoscope": "Collective Prayers and Healing for Nature. As humans, even our prayers are selfish. We ought to pray for Mother Nature. We need to start a collective prayer group that pours in good will for our planet and plant trees or atleast indoor plants at the same time!", "a.r.khan235": "Jabran shekhi mar rhi h or kuch nhi h", "the_dark_muse": "If you had anxiety seeing people wearing masks, why are posing in one?", "lensophilic_creativia": "😄😄😄 Mask cant protect you from corona virus...dont be brand ambassador for mask and hand sanitizer companies 😄😄😄", "_shaina_06": "It's corona time", "rekhapathak862": "Loving your hair cut", "onlineastrologerservice": "bring your love back by tantra and ilam, powerful vashikaran mantra of love vashikaran to win love back. Indian love vashikaran white magic kalajadu indian astrology real love vashikaran spells and tips to bring love back.Pure Love vashikaran 91-9811294421 vashikaran mantra love spell call 91-9811294421 to the real love blackmagic specialist- 91-9811294421 astrologer.solve all Problem only in 24 hours done of marriage or breaking of any marriage, Dispute with lover, 91-9811294421 Cheating in love, 91-9811294421 Get done of marriage or 91-9811294421 VASHIKARANSPECIALISTFORLOVE WORLD FAMOUS BEST INDIAN GUJU JI INDIA AMERICA CANADA AUSTRALIA UK / INTERNATIONAL SERVICE WITH NET has taken advantage of the captivating black magic, THE GURU JI 31YRS EXPERIENCE Love Mantra to get your lost love.vashikaran Expert to solve love problems, 91-9811294421, breaking of any marriage, children's go out of order from parents, Home conflict, interruption in marriage, get rid from enemy, foreign tour, movie... More or Modelling Career, Kalsarp problem, caught sight (Nazar Lagna) etc 91-9811294421 Problems are like as follow Like jadu-tona. Vashikaran mantra love spell call 91-9811294421 to the real love blackmagic specialist astrologer Breaking of any marriage, Dispute black magic specialist astrologer in United Kingdom, with lover, Kalsarp problem, caught sight, home conflict, 91-9811294421 interruption in marriage, foreign tour, Financial Assistance solution, 91-9811294421 Be free from enemy, Intoxication, Divorce problem solution, Marriage life problem 91-9811294421 solution, Control your lover in hand by Vashikaran, GET Problems SOLVED BY (GREAT ASTROLOGER) World Famous 91-9811294421 Astrologer Guru, Love Marriage Specialist.your love relation Beak, Molviji, astrologer, guruji, Swamiji, loveguru, babaji 91-9811294421 World Famous Love Vashikaran Specialist, Love Marriage Specialist, Love Vashikaran Specialist Aghori babaji Vashikaran mantra to control family 91-9811294421 Love Marriage SpecialistIntercast Love Marriage Specialist, Interruption In Love Marriage SpecialistLove Marriage Success Mantra Get Your Dream Love Back, Vashikaran Mantra For Love No1 Spell Caster In Lost Lo", "ayushi.garg": "@sharmachetan711", "reshmiofficial": "Babe🔥", "coach_west_724": "Calling my stock broker ASAP 😂 Be safe", "kashyapaniket02": "Feared from #Corona", "injesustagram": "Absolutely agreed 😪 humans are the worst people who made Mother Earth disappointed always", "shefali_sanjay_tambe": "This is coronavirus fear.... nothing is wrong with the environment... this is need of an hour😊", "parvathyo13\nVerified": "Verified", "janardhannived": "😷😷😷😂", "anuraagsablania": "hats off to caption ! but mask is worn wrong 😂upside down", "yashparpate": "Simply don't eat non veg, animals aren't meant to be ate", "iamshamsali": "سلميلي ع زوجج", "sameer_kadoo": "In a panic and worried, you posed for a selfie... wow!!", "ishady96": "Jo ho raha hai acchey k liya ho raha hai yeh corona virus se atleast animals ka jaan toh bach raha hai", "storywithinastory": "Smh anxiety attacks 🙄", "thechetanmenaria": "Notnki👎👎", "sandipan__": "N95 ?", "aakash_99_": "Don't do overreacting because in 19 century millions of people died from different leathel disease and u r crying for just a cold😂😂", "usama_xam1": "😂", "shades_of_spry": "@tahirakashyap So true! This mask is representative of loss of trust on people that who knows who would be carrying the infection .... this mask is representative of loss of faith in yourself, faith that assures you that you will be fine and that when death has to come, a mask will not be able to fight against it anyway!", "nm._93": "😔", "gauravtaneja_99": "Avoid Chinese people and Chinese products.", "impeccabletanu": "@tahirakashyap FYI: https://www.google.com/amp/s/www.forbes.com/sites/tarahaelle/2020/02/29/no-you-do-not-need-face-masks-for-coronavirus-they-might-increase-your-infection-risk/amp/", "vikram.singh.7773": "Rip 🙏", "tuhin_re": "🙂🙂🙂🙂", "adwaith_0_3": "Hello, I'm Laila Ahmadi from China, Faculty of Medical Sciences, Zanjan University  Corona virus arrives in any country sooner or later, there is no doubt that many countries do not have any diagnostic kits or equipment, so  Please use as much * natural vitamin C as possible * to strengthen your immune system.  Don't worry, C gets rid of it a lot, and that's fine.  Also make sure to use more yellow wood  In addition  Tell yourself and your children that they are all supposed to be HIV positive and * don't touch anyone and don't regret it *. The virus currently contains no vaccine and no specific treatment  Unfortunately, due to the genetic mutation that made it very dangerous  This disease appears to be caused by the fusion of the gene into a snake and a bat, and it has acquired the ability to infect mammals, including humans.  It is important to keep the message on your greatest acquaintance: Professor Chen Horin, CEO of the Beijing Military Hospital, said: \"Lemon slices in a cup of lukewarm water can save your life.\" *  Even if you are working, you should take a look at this message and pass it on to others! Hot lemon can kill cancer cells! The lemon cut into three parts and put in a cup, then pour hot water and turn it into (alkaline water), drink it every day will certainly be beneficial for everyone. Hot lemons can release the anticancer medicine again. Hot lemon juice appeared on cancerous tumors and cured all cancers.  Treatment with this extract destroys only malignant cells and does not affect healthy cells.  Second: the acids and carboxylic acid in lemon juice can regulate high blood pressure, protect narrow arteries, regulate blood circulation, and reduce blood clotting.  After reading, tell someone else and transfer it to the person you love and take care of your personal health.", "dhhavallala01": "I think u r from Delhi...and what's so funny if everyone is wearing the mask...and right now you r living behind your husband's ie mr Ayushman Khurana's shadow...he is a big star...these days and u r...", "aliza_khaan68": "Really this all is unbelievable n very scary😔😔😔I so wish God forgive our sins🙏🙏🙏", "jain.shubham": "r u crazy @evita_dalmeida asked me comment", "putts1986": "If you stopped eating, what you are not supposed to like a bat.. or an eel.. crocodile..I think earth will be in a real good shape..I have never heard by eating veggies people's health or earth was at any risk!", "aurasparklet": "Your mask isn't completely covered around your nose area's...which can still have chances of risk...the one's that doctors recommend they are made of cloth which absorbs the droplets from inside even if you sneeze and doesn't let outside particles touch ur nose or mouth", "s_h_a_v_e_t_a_a_a_a": "Pinch the strip on nose for proper seal", "verma_sachit": "it's because of coronovirus u dumbo", "sahar.salehi.s": "You are the first one that I've seen concern about the corona in India i guess India is safe and you don't know how are we living in iran with a lot of fear and isolated", "shobhnaawsthi": "Non-veg khate ho🙂????", "theshilpashetty\nVerified": "Verified", "1483.pooja": "I u Tahira mam❤️❤️❤️", "sameernavlani02.official": "O pagal it is #corona", "negotiations94": "@Jenniferaniston", "razyrazyraz": "Don’t You Think The Riots Should Be Stopped! What is Indian govt doing here! Are people of Delhi that inconsiderate that a riot to display an act of hate is exercised in amidst of a viral outbreak! Seriously what’s wrong with people! 🤷🏼‍♀️🤦🏼‍♀️", "dplus_alphar4": "The funny thing is, the coronavirus outbreak is not airborne. It gets into your body through contaminated liquids. That mask isn't going to do anything.", "akhileshakshay07": "Nobody is forcing you to wear", "coachjdworld": "I pray for 🌍 ♥️", "arpita_behura": "True", "sia_s7": "China virus", "barkhagsh": "True said Mam we are suffering each n every day 😣", "bodycafe.in": "*Coronavirus Alert*  The best way to fight the virus is to use hand sanitizers. But the pharma companies & pharmacies are seeing this as an opportunity & selling the sanitizers for 300, 400 & 500.  A startup from Bangalore has come up with this innovative idea of delivering the sanitizers directly to the customers to bypass the pharmacies & big pharma. They are selling it for INR 99  Fight the pharma & the virus, buy before the stocks go out - https://bodycafe.in/product/sanitizer/ @bodycafe.in", "_kanchh": "your humour 😅👌", "stylemantraarabia": "👏", "fitnessscoreboard": "दुनिया खत्म होने वाली हे😥😐", "ayesha1310": "Be safe.", "paztailor1": "U only wear a mask if ur infected with conrnvirus not because u don’t want to be infected , unless ur protecting urself from other elements like the pollution etc 😉", "chosgyal_ladakhi": "For rich people like you wearing mask and showing off is probably publicity, but those who get infected it's about their life..", "joaquimgonsalvesofficial": "The fact that we still have those riotd going on amidst the wake of this disease is even more disturbing to me. You would think a global pandemic would finally knock sense into the heads of our governments/people/heck even the terrorists. Like how much more proof do we need that we are all one people in one solitary planet. Sorry you had to have anxiety because of this. Glad you had a friend you could call. Stay strong!", "s_a_n_g_e_e_ta": "Y u went to delhi mam come back", "anjum9144": "Yes keep praying and take care of your self too and care about Whts going in city stop it if u can", "tafzeelmohamid": "Delhi is not safe in coming of days and weeks.", "travelista_sujata": "Take care while traveling 🙌", "_f_azadeh_": "To all dear Indian muslims:We will be your voice while all the world are keeping #silence India has been known as the land of 72nations! Don't let this brutal silly yellow hair guy take away muslims from this territory. It is not only a question of believing in a religion, but it's a matter of humanity and inhumanity! So what is the reaction of Human Rights Organization? Are they blindfolded? I don't know about ur own religion! But now there is a battle between humanity and inhumanity. The humanity is being sacrificed these days in india. Stop killing muslims! We thought india was a land of peace and love. So why they abuse women and children? Stop violence against muslims", "menariamit": "Ayushmaan ko bolo ek pollution par bhi film banaye", "reemajain282": "Corona is an animal virus.. I think Louis Vuitton maximum products are also made of leather...what an irony", "i_am_sarah_loi": "😍😍😍😍", "piyush_mahamuni": "Frankly speaking you don’t care about the world. You just wanted a caption to go with your picture. Stop travelling by private jets that will save fossil fuel. Change is from within.", "mohammedshahz4165": "Doing ban on hijab. . .China and USA ... now you all are in the hijab rightnow😂😂 this is the miracle of (Allah )subhanawu taala....", "_knock_to_zenith": "What is so funny and claiming it the new fashion??.I mean its a very sensitive issue and not a new trend to be followed", "rjpinky002": "the world needs collective positive visualization 🙌🙌🙌 a healthy world a happy world 🙌 free of diseases and worries🙌 and thus we defeat corona virus🔥🔥nmrk", "stuu643": "@karmasphere", "disha_rawat_cute": "Aaj man kar raha hai ki koi agar mere Santan ko Apne munh mein badle", "iamsonalibendre\nVerified": "Verified", "suri.rahul12": "@tahirakashyap Hello Tahira welcome to Delhi ... take care of yourself ...", "achtungreems18": "Nmhrk !", "pratik.dindorkar": "Technically you should not allow for any air gaps .. your glasses seems to allow that . .fails the purpose of these n95 ... Would you suggest travelling to delhi though?", "sara_____4_": "To all dear Indian muslims:We will be your voice while all the world are keeping #silence This shame will remain on you and your country forever Freedom,security,justice are for all humanbeings. @amitshahofficial Stop your violence and racism against innocent muslims India has been known as the land of 72nations! Don't let this brutal silly yellow hair guy take away muslims from this territory. It is not only a question of believing in a religion, but it's a matter of humanity and inhumanity! So what is the reaction of Human Rights Organization? Are they blindfolded? Incredible india! At the country of diversity and democracy There is no room for muslims! This is hypocrisy! I don't know about ur own religion! But now there is a battle between humanity and inhumanity. The humanity is being sacrificed these days in india. Stop killing muslims! We thought india was a land of peace and love. So why they abuse women and children? Stop violence against muslims", "dream4568home": "What’s happening to earth????? Celebs asking???? Bollywood needs vanity for each person, with pump up AIR conditioner, everyone has a private CAR; with multiple cars at home, used to use multiple PLASTIC water bottles till now. The psychology of never repeating clothes promoting fast fashion. It’s IRONICAL Bollywood is asking that India is polluting????", "anshu_sharma977": "Ma'am please don't wear mask with your specs like this. Please wear it in a proper way. Take proper diet and hygiene and do yoga and meditation daily. That will help you to boost your stamina more.", "bimalpasayat": "Ho jayega sabko corona virus. ..wait . Paiso ke ghamandi ,unch nich dekhne wale ,khubsurat ke ghmandi ,religion ved bhab sabke sab ko bina ved bhab kiye wager ,sabko mout degi .. Ready ho jao sab mar ne ke liye..janm li ho ajj nhi tho kal marogi he ishke liye rona dhona kyun .😊", "patilgm": "Give up everything and find some caves don't lecture people here 😏", "yennuwarpurnima": "💯", "polar_billi": "Corona is not a threat to delhi i guess...", "bujji1556": "Stop wasting masks.. there many who needs them. 😢", "sunil_43": "Avoid air travel especially unnecessary, atleast till disease is unfolding", "geetikachand": "Awww. Don’t worry Tahira. Our collective prayers will heal our planet. Keep the faith!", "preethid_souza": "😘😍", "simplynupur": "This is Delhi n we love it as it is... Let's fight to create peace n security of land.@tahirakashyap", "docshweta05": "Nam myoho renge kyo🙏", "annieesheikh": "Love your hair", "shriniwas17": "❤️💛💙", "jy8230": "🙏🙏", "udmatthar": "I am praying earnestly for each life to be healthy and happy @tahirakashyap NMHRK🙏 we will win✨", "amanjeetshahi": "NMHRK🙏🙏", "_.butterscotch07.__": "💛💛💛💛💛", "rishi_b_theofficial": "Hope you don't bring any such virus 🔙 to Mumbai. 🙏", "banisonal": "This is a safety measure nothing related only to delhi its worldwide.. Understand the severity and stay safe", "itsmegh6": "❤️🤓", "gopal_galani": "Mar ja", "ghughutiii": "May lord shiva bless us all", "diamirzaofficial\nVerified": "Verified", "_anishajoshi_": "❤", "docanjukapoor": "Stay safe and bless you. Don’t worry this too shall pass", "suhi666": "Human s paying for their greed , jealousy, 😂", "itsrisharma": "Go Vegan. Save Earth!!", "_divyansh_d": "Corona virus Is not a man made virus so don't blame us aliens", "madhu1085": "Collective prayers will definitely work! We are the land of Shakyamuni Buddha 💪🏻🙏🏻 #nmrk", "akki_kayokai": "Only collective prayers could save, NMHRK!! 🙌", "rvikhana": "#NMHRK", "divya.pikale": "NMHRK 🙏", "juhi.purohit.355": "NMHRK💐", "biswajit.mahanta": "NMRK", "ravidubey2312\nVerified": "Verified", "monathadani": "Agree collective prayers would work !! Let's pray for all 🙏🙌 @tahirakashyap", "dr.pankajchandrapalariya": "🔥🔥🔥", "himani.gour": "Nmhrk ♥️🌼", "priya_bhagwat_18": "For the Natures free of cost air we have to pay now (mask) becoz of us only 😑😐", "sammaerajaiswal": "So it’s something to worry about and take strict safety measures We should wash our hands Thoroughly and don’t stay too close to those who have a cold or cough 😷 etc and @tahirakashyap mam stay strong mam you can do it we all love you a lot !!!!! 🙃🙃🙃🙃🙃😘 NMHRK🙏🙏", "bodhisatva_naheed": "I love your 'left' profile 😀", "nehakhanna6": "Nam Myoho Renge kyo 🙏", "ankitafancy": "Everything eventually is temporary !!", "being_yashii": "#nammyohorengekyo🙏 ☺️", "rishukashyap1921": "Nam Myoho Renge kyo🙏🙏", "anubha_oberoi": "Nam myoho renge kyo....🙏🙏🙏", "cherry_sharma2203": "You can buy mask, get safe from Delhi riot but I still pray for poor people who don't know what and why these things are going on.", "deepuyadav347gmail.7243": "Take care", "nidhikantpathakofficial": "U r much pretty and more beautiful then the bollywood celebs.. ayushmaan bhai is so much lucky to have u.. god bless u both.. love u both.. ❤️💖💋💋 @tahirakashyap", "danny_msic": "Lets chant vigorous daimoku towards corona virus to go away peacefully globally 🙏🏻😇", "runaiiadnstagram8": "Mask is not going to help to prevent this virus. Mask is needed only when someone has already been exposed to this disease and he/she should use the mask to stop spreading.", "munna_maikal777": "Beautiful 😍 😍", "avtarasi": "Rich ppl r so scared of dying. 😂😂 chill it's really ok. :)", "navratanchayal": "Mask me or bhi haseen ho gyi ho..😍😀❤️👌", "chaipio_biscutekhao": "take care, siestra 💓", "flower6fleur": "You are such a cuty and hilarious. And a real fashionista at heart 🙂💜🤳🏽", "kyariaan": "Nam myoho renge kyo💞 we need to chant chant chant🙏", "rav.ankita16": "👍", "anupsoni3\nVerified": "Verified", "_sarahxjain_": "❤️❤️❤️❤️❤️❤️", "nishthabhatnagar25": "Lets pray together", "mahek_rj": "But y did u go to Delhi despite these conditions? 😢", "ritu_ritu_4": "Be careful mam @tahirakashyap", "naureen_rhnhotmailcom": "Stay safe I can only say that... U have recovered from a very critical illness pls stay safe and use hand gel and take vitamin D for strong immune system... 💪💪💪💪💪.. Bohat dua", "swati.kaushik": "Cool mat bano. Aapne mask dhang se nahi pehna", "tushargogiaa": "Also keep Bacilol disinfectant spray before using any public table or chair", "i_am_aswal": "Take care ma'am 💝", "pooja_shroff_official": "The left and right you rock any which way!! @tahirakashyap ❤️😘", "boy_of_banaras": "stay safe @tahirakashyap we love you♥️", "sukriti_vk": "“When great evil occurs, great good follows”", "ashwanigupta6545": "Nature’s fear🙏", "kalakaarsingh": "Kitheeeeeeee Tahira di????", "tannaz1902": "Nam myoho renghe kyo", "kungfuankit": "Nam Myoho Renge Kyo 🌺 @tahirakashyap @ayushmannk", "_deepali12": "@rishi_gt", "durejatanya": "NMHRK 😇✌🏻🙏🏻", "home.veg.recipe": "Ma’am that not the right way to wear it.. if it’s for protection from Corona.. you have to seal the rim.. won’t protect you otherwise. 😷", "kulbirbadesron": "Really Wts happening to our earth ...let’s pray for it..", "vaikumar_435": "Take care Tahira ma'am stay safe @tahirakashyap .", "imagemundial": "Love your Humour and fashion for sure 😍😄", "kastureemulay": "What the fuck? Use your celebrity status to educate people.", "philosophersazkaban": "Dystopian fantasies but this? 🤔🤣🤔🤔🤔", "being_ayushmanniac": "Take Good Care Of Our Mann's Woman 😻♥️..... Rise And Shine ♥ @tahirakashyap", "kumarsand23.ayushmanniac": "Take care mam!! Too risky to travel on airports these days..stay safe 👍", "raghav702": "😢", "adinepal": "@batman_aayush taw jastai😂😂😂", "neha.skhandelwal": "It's really chaotic in Delhi 😣..riots.. Corona... pollution...", "msmoodynsassy": "If you don’t know why ppl around you are wearing mask than don’t travel", "petite_penseuse": "hugs for panic attack induced by anxiety, been there, hate that. loving the hair, though.", "pie7197": "❤️❤️", "archanaapania\nVerified": "Verified", "consciouslivingwali": "Try living low waste, make conscious changes at individual level. Choose brands that care about sustainability. Eventually your followers can get inspired and slowly it would make a change. Charity begins at home. #zerowaste #everybitmatters #sustainability #circulareconomy", "pilot_mommy": "for us .. flying everyday is scary but job is such .. god bless us all", "sometimesioverthink": "#nammyohorengekyo ❤", "dj.cooks": "Faced the same at the Kolkata airport today!", "borntorule1204": "Well said", "altruistic__ananta": "Be protective ma'am 😘 Your careful supporter& well wisher - Ananta 💗🦋", "anu_melbourne": "❤️", "neemaadhikari": "👍", "panizrahnamaa": "Aaaaah , gladly corona hasnt reached india ... thats something to be really grateful for 😔", "bipinspkk": "Love form Nepal", "shanrana18": "@tahirakashyap , where r u in delhi?", "vaibhavj_": "♥️♥️♥️", "_sonakkshi": "😭😭😭😭😭", "chandni_kadmawala": "❤️", "priyankabhatia123": "Let's chant abundant daimoku..so that everyone will be safe and healthy", "jaysamuelstudio": "🙏🙏😉", "monicamurthyofficial": "Wear a N95 or N 99 mask! That filters the carbon out plus provides better protection @tahirakashyap"}