{"smrutikanetkar": "@tahirakashyap I really loved the caption... It can inspire so many people out there who are shy and unhappy with their appearance.... You are such a sweet person and beautiful as well... You and @ayushmannk both are lucky to have each other... Get well soon", "pa.nkaj8696": "Hot", "shruti_sharma1430": "😍😍🔥🔥", "aayushi.laddha": "@tahirakashyap I feel you. You are completely right and sooo awesome for doing this.❤️", "anusha_bhairaddy": "Caption though !!❤", "kingkhan6721": "You are looking so hot and sexy 🔥🔥🔥", "mostlyhungry_": "@pup_n_fluffy", "sandiprkz": "Wowww 🤙👌", "mahesh_kochra_": "👌👌👌", "rennesingh": "@roohi_5 Bhen read this", "bagchipopy": "You are looking hot.", "jayshree.sagar": "@tahirakashyap.. Can Feel you.. ❤️🔥", "amitrapria60": "Sexy and hot body", "_prachi_11": "You are truly an inspiration ❤️", "veronicas_ink": "This is the first time I have come across your profile @tahirakashyap and trust me scrolling through pictures this one pic got all my attention because of obvious reasons (you are absolutely stunning). And the caption is something, something that I have been missing out on for so so long. And I know I am not being kind enough to myself. And this post is going to be a U turn for me. Lots of love and blessing to you and your journey of loving yourself 🤗 😘", "lhfdylyhz": "حلوه جمال ٥❤️❤️❤️❤️❤️❤️❤️❤️❤️", "nisha_hello": "Everyone doesn't have queen life like you so be kind to your future generation", "electrasinspace": "❤️🤗🙏🏽", "hetajatin": "My god u have an amazing figure who said u r size 10?❤️❤️ Lots of love to u", "rih_llove": "Sagging ass", "abhijat0777": "❤️❤️", "prajkta.k": "U said.... Love myself like how ur parents Love you... But what if our parents torture us for being so fat , ugly or not smart enough. & Always reminding us of rejection... ???? Then how can I love myself ? I torture my body and loss 20 kg. But after some time automatically gain 15kg.. ... It's not only about weight.. but in this environment I really can't appreciate myself nor Love myself. 😐", "threefourth_redmoon": "❤️", "drnidhibadiyani": "Okay size 10 is absolutely perfect 1stly ! 2ndly - i say “who cares” for the world ! My ex saw me on IG with a hot pic & said aah u wouldn’t get a good decent boy if u post it !! Haha like seriously- dude that’s why you are my EX & not my present !  3rdly- yes i agree with her completely, Love yourself! Some pple might judge 👩🏻‍⚖️ you & say she is so self obsessed- again- haha- “ WHO CARES “  Live the life you want to, the way YOU want to, The right person or your people won’t judge you & those are the ones whom you should care about ♥️ Cheers 🥂 to #bikini 👙 Cheers to #beingaWoman & Cheers 🍻 to #SelfLove & #KeepSlaying 😎", "lu.t.ful": "Wow, Well said. Thank you for posting this! So many women and men can relate. I, too, had to take the time to tell myself I am enough and worthy and loved because I am me. I, too, looked into the mirror with disgust when I wore bikinis as a teenager. I, too, still look in the mirror and critique every microcentimeter of my body. And from the depth of myself I found solace and complete acceptance from myself because external validation is fleeting and cheap. #selflove", "abishk_sh": "Positive Vibes 💕", "nisha3p": "@jamie.55_", "roy25sumanta": "@psadavartia", "soodpriy": "Want to buy a bikini for myself after reading ur post. Wearing is would b another story:)", "ankupanwar": "U r beautiful.. Not just in ur bikini picture... But ur heart is beautiful.. I feel so", "hey_wild_child": "😍", "shachi_7": "More power to you!", "nirmalrawat_snr": "Aisi pic upload kr k kya fayda..??", "madhurimaaaaaaa": "@giriniharika @shaivyasingh_05 this took my heart❤️", "arpita.23": "Well said 😘", "fathima.rau": "Hi", "ja.vikas": "🔥🔥🔥", "sugandha_singh_": "Love yourself ❤", "medha_jain": "@saketagarwal1994 full caption", "banapriya": "You are such beautiful beautiful beautiful girl @tahirakashyap @ayushmannk god bless you", "as315202": "👌👌👌👌👌gjb fitnes😍", "theaashka_desai": "Beautifully written! 💚", "boymorgan2k": "Such a sexy figure...n wow ass", "nirvana_prb": "This pic of urs tells lot about u...i believe u r still not completely confident about ur body...but at least u have tried to break the shackles and I appreciate that.", "feriaah_8": "❤️💕👏🏼", "deeptimohanofficial": "So empowering ! Appreciate this message!", "avipsa_rc": "It's inspiring 😍", "neetugi": "🙏🏼👌👍", "gunveenmanchanda": "Caption💛 it's really so good🌸", "pujabhutani": "Wow..The most honest post I have read..It's really very inspiring...It takes lots of guts strength to love oneself unconditionally.. it was straight from your heart .. keep loving more of urself mam coz you are very special and beautiful...", "rajani_prabhu": "@tahirakashyap dis post.....I mean...ds is d best way sm1 put forth hr tots...exctly...wdout filter. ..so soulfully connecting ... Thank u for ds...n man..u r an inspiration...hv u evn tot dt exactly d way u ...is smthn millions myt b wishin fr?? U r beutiful ...wdout doubt 🤗😘", "vinootahinsingh": "Thanks for this post....your thoughts echoed mine....just that I am still in the phase of not accepting the presenting me n avoiding looking into the mirror....hope I too get of this phase soon🙈🙈🙈", "sanchi_gupta": "So proud of you", "rasha_iix": "عاريه وتتفلسف😂🔥", "theemotivegirl": "Beautiful and such a straight out of heart post. A post that voices the journey and sentiment of every woman. Love, respect and gratitude to you.", "reenaveen": "💕💕", "findingshanti": "I re read your post 5 times, because this sounded so much like me from a time, and sometimes even now! Thank youuu for sharing such an intimate part of you,i am sure it resonates with most people and thank you for putting up this stunning picture!❤", "___aman_kaushal_": "Eassy 😂", "spr8129": "Wow that's so cute girl superb", "in_da_pursuit": "Wow! What I see and what I read, both are quite beautiful. In fact damn hot 😊", "priyansha_raturi": "@tahirakashyap beautiful u❤", "ronakrajput_87": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "sureshidly": "@tahirakashyap size 10 or not mind10 it is", "_._.humera_ali._": "POST& CAPTION💯💯💯💯💯💯", "srishtikapoor2k": "@tahirakashyap u r slaying....", "suranjan3828": "Ooo so sexy and hot mam ap to india ki shan ha, you know indian calture", "akkired4": "ASS babe", "isunnyshah": "Omg Smocking Hot .. Super Sexy", "shreyaesthete": "Read this twice. I feel much more empowered than ever before. Thank you Tahira. Sometimes, all that we need is to be reminded of such little but integral things. :)", "yusrachoco": "Hottie♥", "bandana_narzary": "Love you love you love you love you so much ma'am I am a biggest fann of yours and yours writing", "haripriya.murali": "❤❤❤❤❤", "sanyacurlyfry": "All nicely written, but is size 10 really extra? I thought i was skinny when i was size 10. And why is size 10 not bikini size? U look perfect here n so does size 10", "sandra_mary_thampi": "Wonderful words👏👏", "mohdaamiransari": "What a nice caption... wonderful..", "drsreeig": "Really appreciate your confidence and beauty!!! You are in great shape", "nidhi.sidhu": "it doesnt matter what u wear sweetie ...ur beautiful inside out tahira...stay like this 4ever...it always motivates me 😍😍😘😘", "rahul_arora_zira": "What a click!! Awesome 😘😘😘😘. Caption 👌👌 Love u dear", "_lotus_pink_": "Inspiring.. Plz keep it up 👍", "grm.khushi": "Beautifully expressed . Commendable ..... hats off", "amit9lalwani": "Post it from the front...and keep posting more pictures....like this", "nishhanair5": "Feeling Proud ❤️sooo happy and thankful to you for posting it @tahirakashyap", "____voyager": "o man! i can relate with every word u wrote! the most striking being when did i lose the plot and cynicism🌻", "parag9901": "A big salute 👌👏👏👏 at first look i didnt find ur post intresting or as i said found smwht disturbing but after reading the story behind this one click... 🙌🙌🙌 i dont hv words to express my feelings... it is the story to motivate and cherish those lives who are confined themselves behind the bars of culture and social pressure. @tahirakashyap 👌👌👌👌", "happinessdojo": "💕", "monikapandita_": "Self love takes so much dedication...loved this post :)", "lifeofanextrovert": "What a beautiful post! Much needed. I shared with my colleague at work also. Totally love oneself", "rudrapratap_rocky": "Fabulous look 💥", "sachinrerapanday": "Wow wow you just took my heart. So much sexy. You just board at my heart and now it's flying with you 😘💝", "aakritiahuja\nVerified": "Verified", "imadhu_priya": "Caption👏", "aparna03nov88": "This post and the picture both are so amazing. It inspires in itself when you start reading.", "writetokarishma": "Vry true ..and you look fab😊😊", "shivani.awasthi.bodas": "Beautifully penned down 💚", "komal20to77": "So proud of you..really inspiring!! U look fabulous, stunning, hot, awesome, amazing!!!😍😍", "_monicabaudino_": "And you are the cutest and a Beautiful soul 💕💕", "simply__sherry": "♥️♥️♥️", "tanvikgmakeup": "U look stunning and not because of the good body that u have but because of the amazing attitude ! God bless u and more power to u!", "jaysamuelstudio": "My next cover girl#regardless u such a sweetheart x", "ssmightyjoe": "Wowww super damn hot @tahirakashyap", "guneetsaraon": "You look fabulous 😘 and an amazing message 👍", "aditii.gupta": "Absolutely stunning. 💕", "__ramandeep": "Sexy", "rochakkohli\nVerified": "Verified", "prama0207": "Appreciatable", "aparajitaz": "Much love @tahirakashyap - never let someone else define what you are and should be 🤗🤗🤗", "tanyaganguly83": "So pinchable. 😅👌💖 And thank you for sharing your story.", "rajnimehendiratta": "Wowwww", "pranjal__s": "Awwwwwh! You look fabulous Tahira 😘!", "prerna24s": "You go girl", "snehaholics5555": "U r body is beautiful and perfect it is literally goal .. after having 2 babies you have maintained your fitness", "sharmitabhinder": "Perfect ....the body is when the mind is", "dipinderchadha": "Awesome click...", "amrataanil": "This post and you- beautiful inside out 😇", "___tricky.mind___": "Raxian xoino ci", "kashyap6480": "I never knew you were so beautiful 😘😘", "sharinb": "Stop deleting. <3 lots of love", "priyanka.ah": "Way to go", "kamaldeep_kour": "Beautifully written by a beautiful gal..U look amazing..More power to u..", "priyanka20chopra": "Looking awesome babes..and very well said..inspiring 😊😊👍👍👍", "vamashah1": "Love what you have written!", "swapnilrai1204": "Wanna fuck your Ass baby @tahirakashyap", "swar1980": "You are beautiful Tahira!!!", "urvip18": "You look absolutely gorgeous! ❤️❤️ and that caption 😍", "hpbassan": "Wow, how beautifully expressed", "abhishek_official07": "Gorgeous", "swetagaggar": "Thank u so much for such a inspirational post!!!! Each and every sentence is so freaking true... we stopped loving our self bcz we don't fit into a particular size n it doesn't really matter as long as we r fit... #ilovemyself #selflove #roadtorecovery n yeahhhhh U are looking really very hot😍❤️", "rahulsharma8336": "Hot 🔥 🔥 🔥 baby", "ishabhansali": "🔥 🔥 total girl crush is happening! 😍", "rathiinayak": "💟👍", "ishabismaad": "So true 👍👍", "prad.bldt": "Ohh..my gig so beautifully penned down... loved it..", "saniya.shukla": "Woman, you just inspired lives! 😘🥂 #morepowertoyou", "shrikant_kommawar": "Looking stunning😍🔥🔥🔥🔥🔥", "ivadhera": "@tahirakashyap to never be ashamed or embarrassed about where we are right now is the first step to blossoming :)", "salonishahhh": "❤️", "yheryprasticha": "Sexy bgt", "yogamegsg": "I have always maintained that our bodies are like little children, the more critical, harsh and tough we are with them, the more likely they are to go astray. Pamper, nourish, embrace every step of the way. My beautiful Friend you were , are and will always shine. The bikini adds that extra sparkle😜😘", "reemabhasin": ":) proud of you... this is the only way we can protect our girls from falling prey to this shallow world #confidentmommysexybaby", "sidhu8477": "You look smoking...!😃", "mansisanghavi175": "Tahira❤️❤️❤️❤️ u look damn hot!! same journey same road..hopefully this day will be soon..cheers🥂", "_adya_sha": "u look amazing!! like honestly😍", "akshayrawtani": "@harshita_ahuja caption", "abhay.kashyap.108": ".📯📯📯📯", "shikha._.sharma": "True!! Love Yourself !✨", "being__star27": "🔥", "rishabh__0001": "👌", "rishubajaj5": "What a message💕"}