{"prettygrewal": "@tahirakashyap stay strong and kudos to your bravery and courage. God is with you. Get well soon.", "angatvaat_2020k": "👌❤️😍", "subhaniwaqar": "My mother is also suffering from this disease... Let me know, is there chemotherapy after/before this surgery.", "gau9532810195": "https://youtu.be/ZU3N41HCcAE", "jannat_sumaiya": "Bravo. Duas for you 💖", "shalusharma05": "😍", "arora.sweety00": "Loads of luv n blessings Tahira. More power n gud health to you dear. Be a winner 😘😘", "swatiguha": "@harpreet.kaur06", "dakshita08": "Love and light to you always❤️", "madhurima_negi": "Dear ma'am hope you are now doing fine...may god's blessings be with you and your family always..just wanted to know what were the early symptoms that you felt before actually getting diagnosed?? @tahirakashyap", "gleefulglorious": "Salute to your spirit much power and strength to you girl 😘", "ridhiridzee": "Will chant for your winter to turn in to Spring! 😘", "luthrasarabjeet": "Once i read the article about bonding between u & ayushman bhai featuring how both of you supported each other before & after getting married..that bonding between you two will surely take you out of this on one beautiful day, you will came out stronger like you always be.", "i_am_that_one_disciple": "Nam myoho renge kyo... What a living example of transforming every suffering into joy and karma into mission...", "jellybeanjumpingjack": "More power to you. Breaks my heart. @findsakshihere", "dr.dipeshkmajithia": "YES VERY TRUE 🎗AGREED👌🤘👍🤞", "iqraameer28": "More power to u 🤗😘👌🏻", "gayatriiic": "Hello ma'am! We will be honored if you could spend some time with the patients and share inspirational thoughts at the event at ACTREC, TATA MEMORIAL HOSPITAL, Kharghar. Very inspired by your story! More power to you!!!", "houseofblendeddrapes": "love!", "bagchipopy": "You are very brave Tahira", "singhpinki8": "Get well soon", "deven__sharma": "Yuppp cancer can happen to anyone but few people have financial potential to deal with it that's major problem @tahirakashyap", "rafiahhaque": "NBC m", "siddharthmanu": "Tahira we are chanting for you all across the world and we truly admire both of you!", "24_priyankaanand": "@tahirakashyap - are you practicing Nichiren's Buddhism?", "minarsandpa": "Iron lady salute god bless u", "yourstruly_vibhu": "Bravo...we admire you...", "p_manasi": "Hats off to you..it really brings courage to all.. . We all love you... Be happy always... 😘", "rsmange": "Get well soon ma’am. Lets knock this cancer out soon. Someone very very close to me is battling for his life due to cancer. I am sure he will pass through it too. More power to you. Cheers", "underconstruction7": "So sorry to hear about it ma'am may God give all the strength to u and to your family.Get well so soon ma'am.", "amreen.reader": "You r inspiration @tahirakashyap", "asihagujar": "Dear Tahira, on behalf of Helping Hand, a non profit organisation started by the best known oncologist in India, Dr. Suresh H Advani and Mrs. Geeta Advani would like to honour you for your courageous, frank and fearless statement. We would like to invite you for our annual event to be held on 15th Nov where we honour all our survivors for their bravery. Your presence will help motivate our patients and bring confidence and reduce fear. Request you to kindly accept our invitation. You can email me on asihagujar19@gmail.com", "staranise407": "Thanks Tahira, just a wake up call to never ignore slightest of symptoms, my aunt was also diagnosed with same, in her case she felt excessively tired all the time and incessant cough, hope for a speedy recovery for u", "miss_rakhee1": "Take care , You are an inspiration !👌👍💞🔥", "paawun.pangotra": "Thank you for sharing! This is enlightening. I salute your spirit. Much love and may you recover fast! God Bless", "mayukhare": "Wish u a speedy recovery love", "shavyds": "Lots of love and more strength to you girl! I admire your strength in such difficult time. Stay strong..... And take good care of yourself 😘🤗", "dietcarenutrition": "Lots of love n appreciation for the strength u have .. take good care of urself dear 🌸", "deeveenair": "I pray for your good health. Really admire your spirit Ma'am :)", "smritidhingra": "Your take on life is amazing!! Its so hard to keep ones wits on them during difficult times but you are handling this with so much positivity. More power to you and may you have all the love, strength and luck as you get through this. 💕💕💕", "sanju9098": "Prayers for u", "amy.hallan": "Wish you speedy recovery!❤️", "narindergill1": "Keep up the spirit", "chintanrr": "Hello @tahirakashyap, I had dm’ed you a video link. Sincere request, please check it out. May be helpful.", "tanveeagrawal": "Read your hashtag. So you chant NMRK? I have been following you for so long, and now it feels like a deeper connection. More power to you 💝", "21_ankita": "#respect #GetwellSoon💞", "navjotsimmi": "Blessing from my side !! Stay strong !! Love ❤️ you", "biggest_fan_ayushmann": "Salute to your spirit!!! You are an inspiration love you🙏😘", "khannamyra": "Nam myoho renge kyo!🙌", "twinklerkhanna\nVerified": "Verified", "richa_dua": "Wish you strength and speedy recovery 💐", "superboy_aatish": "Get well soon", "priyanka.ah": "Way to go..respect", "sofiyamustaq": "Get well soon", "kalakaarsingh": "@tahirakashyap di reading the article felt so good. Admire how you pour out your heart so effortlessly. Keep empowering! #RockOn", "pujaparekh": "You're such a trooper! Stay strong 💗", "geeta.singh83": "❤️", "marriedtodesign": "Didn't I always say that YOU are the real Superstar!! #rocksolidfriend #chosenone", "sehr.rana": "May you NEVER lose this spirit! 💪💪💪", "ishabhansali": "😘😘", "um_hussain1216": "More power to u!! Get well soon dear ❤️❤️❤️", "bansal.monica": "Salute to your spirit n positivity 👍You are a true inspiration ..love n hugs @tahirakashyap", "radhikajmerashah": "@tahirakashyap u are truly inspirational 😘proud of u 💞", "aviralmgupta": "#inspirational", "umi_sofi": "More Power to u Mam @tahirakashyap Get well Soon🙏", "harleen_820": "Hats off to you 🤞🙌🙏🙏💝", "sylify": "Prayers and Great health ahead extended towards you. 😇", "richachadha25": "Outstanding spirit...😂", "aditikhannamakeupartistry": "You are amazing 🤗😘", "suchetakaushik": "@tahirakashyap kudos to your attitude 👏👏❤️ stay strong dear", "hrishalsrivastava": "May you get more strength to fight against this situation👍 Get well soon and fast recovery 💐🍫 @tahirakashyap", "pravejsahare": "🙈", "shameek18": "Best wishes @tahirakashyap get well soon!", "dr.divleen": "Love love love ur article @tahirakashyap", "kritikabhatia9": "Mam you are inspiration to youth and salute to your confidence and will power society need people like you ..love love love❤️❤️❤️❤️❤️❤️❤️😘😘😘😘😘😘😘😘😘😘👍👍👍", "vikkasm\nVerified": "Verified", "deepinder_patwalia": "Love your optimism @tahirakashyap ...you get that from your mom and her indomitable spirit", "ceeoindia_socialwork_official": "@tahirakashyap . Our good wishes are always with you. Get well soon and be an ambassador to defeat this diseases.", "indiaepilepsyawareness": "Proud of you!! Spread the positivity!! #indiaepilepsyawareness #breastcancer #breastcancerawareness", "nishhanair5": "❤️👍🏻 @tahirakashyap", "divyanshud1994": "You are a warrior! More power to you!🌹❤️🤩✨", "surajravigoswami0021": "Salute hai apko Dil se and don't worry everything gone be all rght", "maseeha": "Love ur spirit 👍💖keep going", "ayushmannkhurrana_italy": "Love you 💕", "neetimohan18\nVerified": "Verified", "_._.pink": "You've inspired me in ways you can't imagine ❤️ Thank you @tahirakashyap", "lailawasti": "You are a warrior! My dear Tahira!", "bandana_narzary": "Love you 🙏🙏 .. Wishing you a speedier recovery ..", "gauriv29": "Hats off.!!! 👏👏", "sakshi.upadhyay02": "beautifully written.... Hats off to your spirit...", "_monicabaudino_": "Big hug Tahira. You are great. Love you. 💘💘", "asmitajagwani": "You inspire ♥️♥️♥️♥️", "prachee_shah_paandya\nVerified": "Verified", "pavanireddy11": "Lots of love ...get well soon", "halfacupofhappiness": "Sad...I pray you get well!", "aizakhan_official_18": "Zindagi dukh sukh ka sangam hai", "vipulrungta": "Get wel soon", "sahil7xd": "God bless you mam.....🙏🙏🙏 I'll pray for you 🙏@tahirakashyap", "amjadhadiysfzi": "allah aap ko sihat de ameen", "ashnabhatiajain": "More power and love to you 💐💐💐💐💐💐💐💐💐😘", "abhinavsirji": "All the best mam our best wishes are with u and u will recover soon u are a inspiration to all out there as u are fighting with it @tahirakashyap"}