{"khan_masuda": "Love it.. . Alhamdulillah at all times.. . #kifarakpaindahai .. . 👏", "voraramesh66": "Ayushman is gay and tahira is trangender ...she has penis", "sukabha": "Your seven year old son is more open minded and caring than I'll ever be.", "nishasinghyadav": "Me too done the same mam.(bald).. I donated my whole of the hair to the copewithcancer.com n I'm enjoying this time with no hair and with that wig and than with cap.. And the reactions people give all the time.... Peeps are like.... Ye kya? And i confidently say just to change the mind set of... Beauty is within you not in ur hair... My smile is still the same.... 😊", "bollyfact": "Nice one ❤️😍", "barshaghosh28": "🙌🏽🙌🙌🙌🙏🙏🙏", "krish.0511": "Jai bajrang bali", "ahdabesk": "😍😍😍", "aprils313": "Thanks dear but the new hair looks healthy and full ! What did u do ?", "nancy_middha": "🙌 a massive salute to you girl", "iam_anku07": "😍", "soniyankee001": "I m going through my second chemotheraphy..I can relate to every word you have written and it gives me strength .", "abhijeetpandav": "❤️", "kafeelkhan904": "Looking gorgeous mmm", "farahnaaz19": "👏", "monika_soni02": "You're such an inspiration ma'am👏🙌", "harsh_singh1710": "👏", "dhruvesh97": "U have tremendous courage.Salute to u", "_bhoomika_urs.02": ".....lots of love...💓😘😘💓🔥", "harshaljawa7": "@soch_station", "shivaani20": "@tahirakashyap really needed this now. Thank you for everything.", "thepragmaticsoul": "You're such an inspiration ma'am❤️", "sonu18_abhinav": "Beautiful🌟🌟🌟", "sanskritichadha_": "You go girl!!", "heena_shharma": "You're so inspiring Mam. What a lovely post for all ladies out there concerned about their body and beauty.🙌 you've inspired millions of people by winning over this lethal disease. That's the beauty of a women who is strong and sensible and knows what she can achieve. ❤️ Your pretty face is the outward reflection of the beauty that you have in your heart.", "aartikush": "Brave strong courageous", "24_palak_003": "🔥🔥💣", "siasurbhi": "You pulled off this disease with immense strength, courage and grace. More power to you. I am a Buddhist practitioner myself and when I read your posts about how Nichiren Buddhism kept you going, my faith in this philosophy grew leaps and bounds. I have never seen anyone carry off a disease with so much vigour. 🙏NMRK!😊", "yashoo4588": "U look bold n beautiful lady😍👌👌😘.. god bless you with best of health always", "deepan_grover": "❤️", "shiv_gaur11": "More power to you ❤️😍🔥", "sunil_jangra139": "You are very good and you will soon be healthy😍😍😍", "sanjaysubramanian_": "#morepowertoyou", "a.p.a.r.n.a.a": "❤️❤️❤️", "shreyas_yewale45": "Brave Heart💯💖", "myhmd1556": "You amazing 😉", "sukhvirkaurbajwa__": "❤️", "karishma_m029": "Your strength is breathtaking! Thank you for showing the real you on the insta reel! Much much love and loads of appreciation for you!", "inderpreetdutt25": "U r way Tooo beautiful 👌", "nishu_parmar456": "U r the good soul nd true insipiration. More power to u ❤️🙏", "charvi_jain1236": "Such a beautiful woman. Real beauty 🎇", "nikikarora08": "You look stunning now, always and forever💖 @tahirakashyap", "iankurkesarwani": "@tahirakashyap you and your words are so so beautiful❤️", "kubbrasait\nVerified": "Verified", "yogitakdalvi": "I am recently diagnosed with breast cancer stage 1 and reading you has given me so much power and positivity. In any way can I chat with you , I have so many questions... need someone to guide me.", "akanksha.dugar": "🔥🔥🔥🔥💕🔥🔥🔥🔥🔥🔥can gg c🔥🔥", "tanukushwah": "Being a cancer crusader myself who has gone through very similar stages as yours, I always wanted to do a similar post with my photos from stages of loosing my hair and then eventually growing them back. When I look at them I dont feel any difference, in all stages I look at myself as the same person with same smile.. the hair made no difference, no matter long, short or bald! Your post reciprocates the same feelings that i always wanted to share but somehow never had the right words to pen them down..i wish you a good health and lots of happiness in life! #staypositive #staystrong", "sidmehndiratta06": "You genuinely look better bald and with short rather than those long hair atleast i like you seeing this way your face glows like this", "varsha6671": "So courageous you are ! You are an inspiration!", "asha.sehgal.56": "♥♥♥♥♥", "krishnansunita": "😂", "r.e.n.j.u_r.a.j.u": "💕", "pallavipujala": "Feelings.....wish you good health dear.", "irshadali.shaikh.7355": "ALLAH apko sehet ata farma", "rohit.dhore": "❤️", "joevy6": "My daughter just finished chemo a month ago, for ovarian cancer (she’s 29 year old). I will show her this posting, as I know what you wrote will definitely be something she can relate to, and appreciate. Thank you for your honesty. Cancer has changed a lot of things for her, some that she wishes it never did, (like losing her hair.- because it, too, was her “identity”), but cancer also gave her so much - she worries less, and enjoys life more. She knows that life can change just like that, so she enjoys every moment, every day, and she takes nothing for granted. Cancer tried to stop her, but it didn’t, it actually fuelled a fire within her, and she’s unstoppable now. Again, thank you for this posting - It means a lot to me, and I’m sure many, many others.", "sulakshahasapurkar": "Ur the strongest women in world ur the great stay happy always", "nourel82houda_": "Mayg god bless u with the best of health❤️", "bombaysunshine\nVerified": "Verified", "nimitguptajpr": "When you have the power of daimoku you can make impossible to possible NMHRK", "vaismay": "..more power to you ma’am 🙌", "azam.ansari.560": "Don't cry", "danceislifeps": "Really you are a much strong lady. Ayushman really lucky to have you.. keep motivating to others with your strength and positive power.", "priyaghosh728": "Aap beautiful ho.👏👏❤️❤️❤️❤️", "shreyadhan13\nVerified": "Verified", "sayalidandekar": "This is so sweet", "vijayashreevenkataraman": "Love ù sis . U r an aspiration to the world", "richa.punmiya": "U also setting an example for. specially woman, because as woman we always feel there is beauty in looking perfect. With constant comparison of looking good all time, we let our self confidence down. So proud us and yes bold and bald is beautiful.", "himanshu.aman": "As amazing as always ❤️❤️❤️❤️❤️❤️❤️", "punitabhatti": "❤️", "karanvirbohra\nVerified": "Verified", "jenniferwingetisqueen": "We love you so much @tahirakashyap 😙😙😙 Sarita, London ❤", "rooma_bal": "Tahira, lots of love to your every moove", "sprinkling_stardust_": "More power to you darling Tahira 😘🤗 so proud of u", "swatisiyer": "❤️❤️❤️", "kaveetadastur": "You n women like you are fighters 👍👍😘 God bless", "ratna.lahiri": "I conduct breast cancer awareness camps for school students. I use your interviews and write ups which helps in dealing with the subject even better. Thank you so much for being so brave a great inspiration for all of us.", "preethibachu_": "So beautiful ♥️", "sonia_langer": "Sending tight hug😊to one of the strongest and beautiful women❤️", "purva_paliwal": "🙏🙌", "chelsia910": "Kiddos to your courage to post your pics online. Its a great step. Once you emmerge from this battle you will find yourself very tough and seasoned at the same time. Your posts is a reflection of that process , to ultimately focus on what really matters and understand the true meaning of happiness .", "salgiaarun": "You are rocking dear yah young lady.", "bollywood_insta123": "Fantastic proud of you tahira ♥️", "abu_shaikh93": "#Champion", "janardan.sharma.522": "Me juy..nJruij6", "vnakhua": "Salute to U n other women who have come out and shown the power within. WOMEN in someway themselves pull them down on d name of beauty... Hold your backs gals... #bethere for one another.... Kudos to u.. U make us Proud.", "oliviasarkar5": "Very true...well said... Thanks for the motivation....much light and magic to you dear...God bless you🙏", "ritz2502": "U truly inspire a lot of people around andmore power to u 👍🤟", "ranirajni1102": "Your words are just very much true!", "ishrat_ilyas": "@srishtimongia❤️❤️❤️", "dippi_shah_patel": "Fabulous 😍", "simibarha": "@tahirakashyap 🌹🤗 ma'am", "theonlytanya": "You’re beautiful, now & always!", "lightshade5325": "❤️", "mansiii_3": "You boss ladyyyyy👊🏻❤️❤️❤️❤️", "an_ton_ette": "Goosebumps!!❤️", "nainakashyap979": "🌸🌸🌸 <3", "gurvarinderghuman": "Hi Tahira, TOTALLY agree with you, gone through the same journey at the same time as you. Its amaaaazing how this whole experience brings out a whole new POSITIVE person in you. I love my life post cancer, and I got the answer for `why this happened to me'? My best wishes to you :)", "banshareee": "❤️❤️❤️❤️", "parnikawattal": "♥️", "nausheen_binte_arif": "@_s.i.m.r.a_", "grm.khushi": "U r a strong women ...n trust me u look so gorgeous in all ur looks .... coz beauty lies within ... ur thoughts , ur approach towards life is simply amazin .. it’s difficult to accept d change but u accepted it wid Gräçé .... u r truely a women wid hell lot of inspiration.... cheers ... u always remind me of d phase .. Alive & Kicking ....", "krazypal": "❤️❤️❤️", "krishnaprasadbalakrishnan": "my mother is a cancer survivor and i couldnt handle her with a scarf. She was undergoing a lot of self image issues and i could feel it. But then i thought how beautiful life was in bestowing her back to us minus some hair. She could've died fighting cancer. Life lessons. She is out of the 5 year window and is healthy now. Oh and the hair is back. Prayers to you for your strength in sharing. good luck and godspeed to you lady!", "meghaamamgain": "You are a rockstar! ❤️💪", "hemikadinesh": "👑", "shilpa_b_vora": "Salute you👍", "muashraddhak": "You Look Hotter and Stronger than Before Tahira....Lots of Love 😘", "ektarkapoor\nVerified": "Verified", "neerushaa_nikhat\nVerified": "Verified", "ankushkaushik1369": "Very nice dear🤗🤗🤗", "kusumbolia": "good mem", "asjsree": "Your writhing is just 👌❤", "payalsk_": "You are beautiful and so imputations. Reminds me of @annkinskywalker who looks so beautiful with her cropped hair so many years after her cancer survival", "joy_patel_jp10": "❤️", "raghav.gupta.35912672": "❤️❤️❤️💕👍🏻", "jayalakshmi__r": "My 3rd chemo was yesterday...i lost my hair after 1st chemo itself...and i was co pletely disturbed..You are a big inspiration to me..Thank u for ur posts lyk tis...", "aneeeeeshaaaaaa": "You are one hell of an inspiration..hats off. Wishing you the best always,for you deserve it like no other.", "the_shambhavi": "@tahirakashyap No words can ever describe how beautiful you are inside out.. I think pains are pearls for life.. Way to go! Much love ♥️", "soma.basu.5": "You and Sonali are inspiration to many cancer fighters like us .. 💕💕", "susanlimcy": "You're beautiful in every aspect 💕", "shaivz": "@namami_vaish she is so empowering", "chetnach84": "You are very inspiring @tahirakashyap", "ghatevarsha": "Tahira you said right. I too am blood cancer survivor for last 7 yrs. I lived life giving undue attention to looks. But with loosing hair every thing changed. Thanks to Nichiren Buddhism, now I am no more concerned about how I look outside as I know I am trying everyday to be beautiful from inside. And to my surprise I started looking beautiful from outside even more than before. It’s because with loosing hair I also have lost ego and wrong conceptions about life. Tysm for beautiful post Tahira ❤️", "smitarangesh": "You are so inspiring 😍", "preeti_patro": "😍", "bal_satinderjit": "✊ ✊✊ shine on madam !!!", "x_karanpatel_x": "More power to you😘", "vimdev09": "More power to you. 👍❤️", "bollywoodplex": "❤️", "dpch15": "Inspirational...more power to you!!", "gayatriagarkar": "❤️🙏♥️", "najnajida": "🌹🌹🌹", "lisamishramusic\nVerified": "Verified", "drpiyushchaudhari": "Bravo 👏..🙌🙌", "lisaraniray\nVerified": "Verified", "04aman": "❤️", "dhingrasachin96": "Warrior ❤️", "farah_naqvi19": "Keep inspiring you are a strong women!", "dikshakhatri07": "Inspired 💟", "dipikakashyapza": "More power to you Tahira! Super proud 😍", "subiamajid": "Thank you for being an inspiration for everyone ❤️", "adtsinghsharma\nVerified": "Verified", "ashritaachowdhury": "You inspire me with your smile and the way your smile back to Life ♥️ Lots and lots of love and hugs to you Ma'am ♥️Stay blessed and happy Forever ♥️", "your_rv": "💐💐💐💐💐💐", "nedenben129": "@tahirakashyap Hot 💖", "anuradha_nikhil": "❤️", "youssra244": "God bless you ❤️✋", "l_i_t_t_l_ek_i_t_t_y": "D new one z d coolest 😚👌", "simply_piya": "Bravo..", "pinalpatel.engg": "You dont need to write Warning... it's a reality... you faced that with grace... keep motivate everyone... lots of love and respect ❤️❤️❤️", "mayukhare": "❤😘", "bluefairybgmailcombluefairybgm": "U r strong n beautiful ❤️", "guywithanartificialeye": "This is Damn Inspiring! 🙌 More love and power to you! ❤️", "awesomriti": "You’re such an inspiration!", "namrata_chavan": "You are strong and beautiful and bold! God!!! You are a wonder woman!!!!💕🔥", "modupallipavani": "❤❤you are an inspiration", "sab_gol_hai": "🙌🙌", "high_on_life_ever": "Beautiful...❤️", "jyoti.074": "💯🤗💪💪💪🙌", "ilanthropiccheeks9": "You proved that 'you are that one disciple' thank you for sharing ur journey of Human Revolution, ur experience.", "crispsandcrave": "This compelled me to bow u💙💙💙💙u gained more respect💙💙💙💙💙💙more power to u tahira mam lots of love💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙@tahirakashyap", "anii_rinii": "You are an inspiration! Keep going and growing❤😍", "ashnabhatiajain": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "tinajoshi80": "Love you", "_sakshi009_": "You're a great inspiration to many 😭😭 I genuinely love you and how beautifully you've written this story of your life and many warriors . Every single word is inspirational and giving strength to love of inner self♥️ Tbh I was not aware of you but now I read every words write and I've become your fan🤙 you're a beautiful soul❣️", "shambhavisawant": "Warrior queen ❤️", "anjalee_123": "Super woman u r", "_ghost___r_i_d_e_r_": "❤️❤️❤️❤️❤️❤️🔥", "anusha_rh": "❤️❤️ ❤️ ❤️ ❤️", "ecoconscious_mumma": "Such a wonderful n powerful post! More power to u lady!👍", "anummoiz": "Brave at heart❤️", "shruti___20__": "U r so strong women... proud💕👍@tahirakashyap", "nikhil_sachan_19": "💓", "i_sha_18": "Woohoo💪", "dr.iqrakamal": "Lots of love and prayers!! May Allah always bless you tahira°❤️", "tanvichordia98": "More power to you ❤️", "jigarchauhan.910": "नारीशक्ति🙌", "_cheema_canada_": "the ones in the beginning were as adorable as the ones in the last 😍 ayushmann paaji is blessed to have you", "spratyush079": "@tahirakashyap ayushman sir loves uh lot.......", "drjayganesh": "Beautiful always inside and out !!❤️", "nc.nixie": "You are SO Brave. So proud of you. So courageous and fearless. Deep respect. May you recover soon.", "rajjo__0": "U’re such angel for us mam🙏", "asifasalian": "I’m a Brest cancer survivor & I love your courage , I have been following your posts, love them ❤️👍", "tamana4ever": "@roncheryl1 @deepanangia", "ssheenworld": "You are one beautiful soul and that's what should matter most, with or without you are gorgeous! Sending lots of strength and positivity 💕", "ankita.p_94": "Hey Beauty", "thesuitcompanyindia": "Nam myoho renge kyo", "humairah_reyaz": "💝💝💝💝", "shahanazahmed618": "U r really an inspiration ma'am very few people will come forward n talk abt wht they are facing more power to u ur family n ur kids hope everything will b better n best in the coming days", "srabonti_hasan": "Inspiration ❤", "sunnychahalrana": "Check out those cheek bones and jawline! 🔥💥", "ghuman_k": "You are an inspiration @tahirakashyap 👏🏻such a strong and beautiful woman💪🏻💗🎀more power to you ❤️", "kwati_accessory_pandora": "Sending❤️🌹👍🔥👏🏻👋🏻🙋🏻‍♀️👸🏼", "cristiano_fayiz7": "💪", "sanfaaflal": "Girl power ❤️", "cyashaswi": "Truely a biggest inspiration ❤️❤️❤️❤️", "raag_ongaku": "✌🏼", "awish__badlani": "Biggest fan of you 🤞♥️ @tahirakashyap", "roshnigurungclosetssecret": "You are such a rockstar and big inspiration! ❤️", "suchibasusengupta": "You are beautiful from within... Rest is just a visual impact.... You are beautiful 'cause you thought process is strong, confident and carefree.... Love your words the most... Cheers to life🍸", "king_raaaa": "Inspiration you are for many 🙌❤️", "amira_seq": "Boss lady 😘😘 Love you to the fullest 🥰 All Power 💪 You Rock Gurl🦸", "seebu_beebu": "You are an amazing epitome of strength! I always get inspired by your posts. Wishing you lots of love and blessings.. 🌷🌷", "sreejoni_chatterjee_": "you are an inspiration 🐕💛💛💛💛💛💛🐯", "pratspinkiee": "@tahirakashyap you look gorgeous in every frame🤗", "ruchi61662018": "I am in so much awe of you. You are such an amazing inspiration to not only for the people going through this but also to all women who lack self love and acceptance of themselves . This is so true that if you are beautiful inside it radiates outside. Thank you Tahirakashyap for being such a positive energy on all. Kudos to your good health and happiness always. May you be divinely blessed on all levels 😍🙌❤️", "ankursrivastava23": "Inspiring to many! More strength and blessings for you 😊💐", "liquid__chef": "@tahirakashyap huge respect and full power to you 💪🏻", "findingshanti": "❤️❤️❤️❤️", "sohiniichatterjee": "More power to you ♥️", "_whosthatmiss_": "You Braveheart 😘", "sharvari.joshi757": "Amazing @tahirakashyap... Just a supporter of everything positive!! It's time we change the way we look at pain and beauty!! You took one as a challenge and concquered it and took the other from an mere image to the unbreakable spirit!! Thanks for doing it!! I wish you a good fortune!!", "meyvismehwish": "Pray for ua fast recovery maam😇", "amazon130a": "more power to you❤❤❤", "writetoshilps": "More power to you lady boss! ❤️Love your writeups! 💕", "reshmyr": "God bless Tahira. Keep inspiring ❣️", "aich.reet": "Grace...", "twnkltwnkl17": "You are getting more and more beautiful. 🥂😃", "tanisha_jain16": "@tahirakashyap a bravest and strongest lady ever seen", "rachanakarnik": "Your beauty lies in the confidence that you wear and that makes the first two pictures the most beautiful of the lot ❤️", "rupinder.oberoi": "Tahira you are pack full of courage love n positive energy..keep it up ..love u", "rimz2012": "Ur Internal beautiful 🤗🤗❤️", "little.miss.bell": "❤️❤️❤️❤️", "iamsandeeprajput": "Beauty🌺", "jatinlubana": "Tahira The Champ! ❤️", "dhar_dharbadhar": "more power to you", "kiranbhatti2171": "Heyy...going through the breast cancer journey could have been miserable if i hadn't watched u going through the same like a lioness...still watch u for extra dose of motivation...lotsss of love", "swatzzzzzzz_space": "@tahirakashyap you have tremendous courage and strength and you might not be even knowing that how many women out there are getting inspired by you. You are showing us all face of acceptance to our mindset.coz that’s what bothers the most— our own mindset! Loving yourself & Living our life is something to learn from you. Stay the rock solid woman that you are. More power and blessings ♥️♥️", "barishs.a": "Lots of respect and love! More power to you❤️❤️", "mithali.ranka0409": "Your just amazing", "jasleenkmakker": "Beautiful soul💕 stay blessed@tahirakashyap", "urbancompany_beauty\nVerified": "Verified", "yeshahaha_": "Bravee ♥️♥️♥️♥️♥️", "id_ar_heena_s": "You set New Beauty Trend 😘💋 Very inspiring", "saif_8891": "Dua krte h hum ki aap jald se jald thik hojaaye Sister❤@tahirakashyap", "iampriyadarshini": "U all r true fighter and inspiration for us 🤗❤", "aninditas09": "You are an inspiration to all us ... thank you @tahirakashyap 😍😍💕", "nupurlala81": "You are inspiration... #love & # respect", "prerana_jadhav421": "You are an inspiration mam🤗", "deepika_ganeshan": "💜", "nagmamakkarsharma": "👌👌👍👍🙏🙏", "23shikha": "😍😍😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "swetaakreddy": "More power to you.. what an inspiration 🙏🙏", "kreshma_2205": "Dear @tahirakashyap i am from Mauritius and i look up to you as a role model. It was truly the most difficult battle which you tackled like a warrior. Thank you for making all women proud ❤️", "subhamoygooner": "Inspiration mam🙏", "angelangel4703": "Fighter ❤❤ you", "swethavbs": "Rockstar Tahira lots of respect n love to you 💖", "_thetorpidsoul": "Strength 🖤", "gurinderjit2001": "Inspiration 💪💪🙏🙏", "sixyardsaga": "You Rockstar!! ❤️", "romi_baweja": "U r 👌👌👌👌👌👌👌👌👌👌an inspiration", "ssanjeev821": "👏", "sareen23": "Respect and you are def a fighter and beautiful@no matter what", "arunima10": "Beautiful and brave post.. love", "nilimakhare": "Strong 💪 Girl, 💃 we all are with you", "surabhipurohit": "More power to you!", "pawalichakrabarty": "Though I have not gone through the life changing journey of chemo like you but from a young age other peers ( mostly girls) used to call me tomboy and unconsciously I related feminity with long hair and tried to grow my hair long even though my parents liked my short hair look. Now when I see Superhot people like you wearing short hair with confidence and how much attention that actually draws on your facial features I am inspired to return to my short hair days again 😍😍😍😍", "shivsimha": "Rock on maam🧚‍♀️", "mahaksshhii": "Respect.", "kruti_talatiyahoo.co.in_": "Lots of love ❤️", "sarahsahibzada": "💪🏻💪🏻💓", "tanyakhan040": "Really proud of u", "kaps.8008": "Truly an inspirational post for all. You stayed strong in those moments of your life. You battled, you fought n you won. Now you deserve all the happiness for yourself,,God bless you always @tahirakashyap", "romiiiroy": "Mam the women are marginalised at every point depending upon their beauty..But your posts are inspiration to the women who r fighting on a daily basis to prove their worth beyond their physical appearance s.Yes your body and soul both are important..but your soul stands above everything..loads of love mam @tahirakashyap 😍😍", "surbhishridhar": "Each and every pic is so beautiful❤️u have surely inspired every one to love it up , each and every phase ! Long live gurl💛💛", "madhu14j": "Hats off to you ❣️", "lilmissjisha": "Very position approach towards this evolution @tahirakashyap . Being a stage 3 breast cancer survivor I also underwent same situation. I too was obsessed with my not so long hair but they we're good enough to make me look pretty but later after I went bald during chemo ( I went to salon myself and asked them to shave my head) I realized that it's definitely not about the outer beauty but it's the beauty which lies within you . It's about how you see things and what you perceive. Thanks for this amazing write up. I can relate. 💞", "jug1308": "Strong women proud 😍😍 we will always support you babe 🙏🏻🤜🏻🤛🏻", "shaheen_23": "You are an inspiration to all.Thank you for sharing you journey.😘😘😘", "sinthia1712": "You are such an inspiration 💙 MashaaAllah 🌸", "suvarnadaneshshah": "More power🙌👏", "ketanchangediya": "❤️❤️❤️❤️❤️", "manambhatia": "Mine nd urs treatment started nd completed together ... I always get inspire cing ur post💖", "iamgcool": "More power to you @tahirakashyap♥️", "alicia.bertha": "What an inspiration u are @tahirakashyap Amazing ❤️ more power to u", "ensaluja": "You are bold and beautiful- more power to you.", "_ashi___": "💋💋", "poonamjaved": "💞", "liceemss": "Love u for being a great inspiration for all women in this globe be in who going thru this phase or not.. one or the other way everyone are in the battlefield and wanted to win victoriously 🥰😊👌🏻👍🏼", "reenachopra.art": "Ure looking your best right now!! Bless you and lots of love!!", "sarah_elizabeth4_": "Love your confidence", "diviyaa30": "U r a fighter....", "moumitamoon": "Love you tahira💜", "iamnishasuyalaggarwal": "Love you", "varuniac_simran": "Beauty❤️", "a_butler5": "🙌🙌🙌", "sharinb": "You are a magical woman with real power and beauty 👩", "sapster1810_esmeralda": "@tahirakashyap more power to you! I’m a survivor and totally get you!! God bless", "_chocohead_": "Ow.. Inspiring🔥🔥🔥 👌", "pr.incess3377": "Hats of to you maam May God bless you and your family May your deserve all the happiness of the world 🌍 Keep smiling Stay Healthy And Be strong as always LOTS OF LOVE MAAM 🤗💋💋😘😊😊", "juhayner_sweetheart": "More blessing to you dear ❤❤❤", "kaningili": "Thank you very much for sharing your journey this openly, it’s both inspiring and humbling. It encourages us to revisit our own views and beliefs around beauty, the way we communicate our truths(to ourselves and others also). it motivates us to accept ourselves as we are thus others. 🙏🤗", "fledgling_0": "❤❤❤❤", "thebookreporter": "God bless you and yours ❣️❣️ stay strong", "only__dhamal__": "🔥🔥🔥🔥🔥🔥", "arpithaashwin": "More power to you gal😍", "jattti08": "Brave and strong women i ever saw Love u and must say you are the real beast 💪💪❤️❤️ May God gives u more power and bless u🙏", "amjadhadiysfzi": "wah wah", "veronica_fashion_studio": "Hats off to u ,you have been very brave", "iamsonalibendre\nVerified": "Verified", "blushy_aleesh": "Wishing you a speedy recovery", "__annanya7__": "Love you❤❤❤n super proud🙌", "sheetalhs": "Grace 😍", "g_y_p_s_y_g_i_r_l_": "You are really an inspiration ma'am....", "iamshivshankar": "👌👌👌👌👌👌", "nikitadave8925": "👍", "aboveallglassceilings": "That was a beautiful message!! Immense power to you superlady!! 😘😘", "susmitha_reddie": "💕💕💕💕", "meenalyyadav": "@tahirakashyap mam you look beautiful in short hair...", "sudiptaxghosh": "I have seen my mom fight cancer and she made me a stronger person with her battle with cancer. So I am confident Virajveer is going to learn so much more from your experience and you can ever imagine! More power to you. You have been an inspiration.", "ruchigaur28": "Have been experiencing this with my mom, she always had long hair. This month she went through her first cycle of chemotherapy and it has been tough for us and her. Your posts give us strength and positivity.... 🙏🏼", "maryamrauf": "More power to you 🤗", "sirireddy2212": "U r a fighter", "swagata.nath": "You are such an inspiration to all the warriors out there. 💜", "sara67890134": "This post made my day..lots of love to you🤗", "rityac": "So beautiful🥰", "proudlyvulnerable": "@tahirakashyap more power to you..", "harmonious22": "❤️❤️.....Love you Ma'am..... The positivity which you spread through all your post is deeply inspiring.... Thanks a lot.. ♥️♥️", "shivani_gaonker5": "True inspiration maam❤️hv a speedy recovery", "shy_mithai": "You look gorgeous in all of your pictures! Hair or no hair! 💕👍🏼", "kainaz.n.turel": "❤", "gandhanaashok": "❤️❤️❤️", "jeanqatar": "❤️❤️❤️❤️❤️❤️❤️", "luckeysabharwal": "Ur real fighter 👍", "pratibhaposwal": "❤️❤️❤️", "a_peaceful_chaos": "💗", "varsha.lakhwani": "More power to you ! You have actually proved that it’s the mindset which affects everything in life ! Wishing you best of health 💗😊", "hetajatin": "U r such an inspiration to all...I also actually think...that ..males..whether they are fit or fat..it doesn't matter (I m talking bout people out of film industry becoz there even males need to be slim fit and having perfect body ) but in normal lives wen it comes to girls...they need to be slim ..fair... perfect in height...bla bla...we need to be conscious about our body is a complete different thing but wat bout those girls or woman who are inherently fat or due to some other reasons they lose their perfect figure?? They are laughed off by people...without thinking wat the woman or girl would undergo emotionally or mentally...these stereotypes should actually be overcome...if a boy or male gets bald without any reason ..just for summer issues or as a part of style it is welcome but if a lady wants to do...everybody starts talking...", "soashi": "That's strength all love to you", "jayjaan107": "❤️❤️❤️❤️", "ranin_ali": "Brave human...stay strong😍🙌", "gopikadevi": "Beauty and strenght😍 inside out🙌", "rupal_07": "🙏🏻", "mnhp_mirchandani": "Ur beautiful d way u r ❤️ @tahirakashyap", "sweta1306": "Very well said.. u r a rock star.. hats off !", "abhijeet_page": "Real life Fighter ❤️❤️", "sherenvilyakeneatha23": "Aku mau nangis.... @msalsabila01 @adityaadvn aku gx iklas... Gx aku suka ini.... Dear Tahira mam I Love You So Muchhhh Be Strong Always 😘❤️❤️❤️ from Indonesia 💙🖤❤️❤️❤️❤️", "priyanka20chopra": "Dear you are beautiful and and an inspiration for all of us....lots of love..😘😘😘", "travel.work.karma": "@ayushmannk how did you find this beautiful strong woman 😍🙌🏻💪", "shavina_shaviii": "🤗❤️👍", "sukriti_vk": "❤️❤️❤️ You are precious with or without them!", "15fries": "❤️❤️❤️❤️", "shwetamittal09": "Really inspiring 🙏", "afiablogs": "Thanku for this! Love from Lahore.", "ayesha370khan": "Mam thanks for sharing firstly. You r making everyone alert abt their own health. Love you 😘❤️♥️", "thehumanbeast.010": "🙏🙏♥️👍", "bandana_narzary": "You are the true beauty", "sanikaviral": "Love love love!! 💕❤️", "sny_1518": "I respect u mam🙏 ,,,, 💕😍 inspiration for youth @tahirakashyap @ayushmannk", "shiprahr1985": "Super power girk", "mmamta__": "❤️", "poojasharan": "@kanishka.7", "amitp11_12": "Forget about perceptions... U gave a tough fight n eventually won it... That matters... Proud of u... God bless u... 👍😌", "shosinsta": "🤗so proud of u girl", "gaurab_rebirth": "Salute 🙏👏👏❤️", "bomo_19": "❤️❤️❤️", "_naik_prati_": "❤️", "avii.sharmaa": "Strong 💪❤", "alankritii": "@upasnatiwari", "bhawnamunjal1": "U r strong, u r beautiful n u r inspiring so many women around💜 a true rockstar u r @tahirakashyap", "spoorthy_shashidhar": "Rockstar ❤", "_priyansuuu": "More power to you❤❤❤❤", "kouladitya": "Hope you are good now ! Bholenath bless you", "anisahmadsheikhsheikh": "God bless you", "manika_goswami": "❤️", "thebhukkadsahaab": "You are a true legend 💯😘", "cambridge_doc": "it never matters to me Tahira😍 😍😍", "mcginncheryl": "You have been a great inspiration kudos dear", "srishtimongia": "Being a bone cancer survivor since the age of 12, i have been following your posts since some time. You have been a source of immense courage and inspiration! Love your write ups and everything you do to bring about the much needed change in mindset.", "anjanadesai555": "Your an inspiration mam", "tanishapatil19": "Mam u r grt😘💯❤️", "makeupbyrimanimahajan": "Such a brave attitude. You looked beautiful in all your phases🤗🤗🤗more power and strength to you", "rajanabhinand": "More power to you.. Inspiration..", "rajnimehendiratta": "Strong women god bless you", "deep_thi": "So much love and respect! To help the next generation see things differently and better is probably the best thing we can do. May your son go ahead and spread his positive knowledge about beauty. And much much much more power to you♥️", "fashion_esta72": "You are a lady dapper 🥰 much love coming your way all the way from Netherlands", "simplynupur": "Real beauty lies within @tahirakashyap", "ekgufra": "You are standing tall just like the Great Mountain!! 💓💓", "_d.ee.p.i.k.a": "Inspiration 👏", "deep_geetika": "Stay blessed. Keep chanting. May your bank of fortune overflow 🙏🎉", "fashion_enthusiast_aloy": "🍸🍷👑", "vatsala_23": "@tahirakashyap My mum is going from the same phase.. can feel it.. Thanks for such encouraging words!!", "humble.as.dust": "Hey Tahira, I really hope to meet you one day in this lifetime. Properly. So I can just give you a warm hug. Your raw authenticity is very inspirational. Most of us if not all have unglamorous lives. There is a mystical divine reason for that - human existence is difficult and very raw. We all have an ego that needs to grow and a shadow that needs light upon it. That's all for now. I love that idea of changing karma into mission. That's a very lightworker thing to say, lol. May the force be strong inside of you. Also, maybe look into diet and supplements to help your body heal and remain healed xxx", "dkbharathan": "❤️", "labanya.d_namesake": "In each frame you look beautiful", "kavs.99": "U're such an inspiration. You've showed us that to be the best version of ourselves is actually to be the strongest version of ourselves when we're going through either our ups or downs. You've showed us that to be the most beautiful version of ourselves is to have the most self acceptance and self love in whatever stages of life that we're going through be it good or bad. I truly admire your goodself Tahira ma'am. You're such a blessing to us. Hope to meet you someday. Love from Malaysia @tahirakashyap 😙❤", "_biyasgram_": "This post is so damn inspirational !!! And every word of it speaks ur Courage and motivation which u want to spread too all the women out here!!! 🔥💕", "continuitysalon": "You look amazing. Loving this sleek pixie on you! More power to you @tahirakashyap 💪🏼", "guuunveeen": "You lady, are an inspiration for many💛 stay blessed!!!!! We love you", "sneha195": "More and more power to you!! ❤️", "i_nitinrawal": "You are brave but some people hide their gray hairs till death 😂😂 even The tinny Beard", "hiteshipatel27": "You are strong and beautiful inside out ❤️ This is your biggest strength that makes you more beautiful! Strong is beautiful ❤️❤️❤️❤️", "sakshijain911": "Been through it all....it wasn't easy but wasn't even tough once I realized that life is much more than beauty. Life is beautiful. Like you and me. ❤️", "sakshihandababbar": "You’re the most beautiful being I have seen ever ❤️", "chitrakshi_poojary": "Inspiration!!!", "shrutikochar": "❤️", "sudeshna_20": "Tahira, you are such an inspiration to all. And yes, the mindset is changing in a lot of ppl....n am glad about that😍", "dipti.bharwani": "Beauty is in the heart soul and eyes not in the hair... its just an accessorie that god has given ..", "deshmukhpallavi32": "Loads of love", "thakurmunish1990": "RESPECT", "sunshinness": "Love you anyway", "nishita.chauhan.30": "Beauty is having good mindset.....more power to your beautiful heart.....❤", "mukherjipritha01": "More power to you ma'am. You are an inspiration to all of us. You are a true warrior. ❤️ #noscarstoyourbeautiful", "rajasreebose": "Braveheart😍😍", "hrahila": "You are a powerhouse of strength! You are so inspiring.lots of love to u😘😘😘", "amita_pathak_sachar": "Look at you, getting stunning day by day❤️❤️", "nehavsrivastava": "♥️", "charishma.ck": "You are one wonderwoman! More power to you! 💪🏻", "preetybhor": "You are an inspiration to all🤗❤️", "im_mashinka": "Worth reading... More power to you beautiful lady", "archiejain": "You are a hero", "just_another_dreamer_leo": "Hair no hair woman u r so strong. All my prayers to every cancer patient in ds world. Hope dey all r as strong as u r. God bless u", "_.gouri": "Much love lady ! ❤", "digvijay.s.chouhan.3": "💪🙌❤✌", "aarzoosidhu": "Journey. U r a hero a survivor", "narenchauhan12345": "You always beautiful forever", "shreya_sudarshan": "💝💝💝💋💋", "deepalid10": "You're amazing and a great inspiration 💖💖💖", "fierceneha": "Yes acceptance is the 🔑. This is what is Changing karma in to mission😊 you’re a genuine disciple of Sensei. Thank you for inspiration!!!", "nyaripandya": "I can only say... you are very strong dear...and more strength to you. And yes the photos shook me from inside!", "d_for_dory": "God bless and more power to you , thanks for sharing ! 😘", "aishwaryagham": "This makes me feel so so strong! Thanks for being the strength for thousands of women out there! Beauty lies in the perception and how beautifully have you been battling this tough time! Loads and loads of love!", "karansinghchhabra\nVerified": "Verified", "thedimsimway3": "@tahirakashyap more power and love to u Mam!!! We loved u then n love u now!!! 🙌😘", "thesunshinewoman": "Wow...you are amazing🔥", "catching_up_again": "God blss u..🙌", "c.h.a.r.m.y.g.i.r.l": "You are truly a inspiring women.... Luv u lotts Nd lotts mam ❤️❤️", "styliciousbysam": "Every moment in this journey has been in inspiring❤️ more power to you", "sometimesrohan": "Wonder woman! @tahirakashyap 🙌", "s.n.i.g.d.h.a_05": "♥️", "debalina.majumdar": "Love you! More power to you! ❤", "sheorandeepika": "❤️❤️❤️❤️❤️", "vishupandhi": "😘😘😘😘😘🔥🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️", "mitalibanik": "Lots of respect and love ma'am", "shweta_sulabh": "You are extremely gorgeous!", "beingsiv": "You are such a huge inspiration not for women's only but all of us.Beauty is expressed by heart not by size,shape, colour or any other things.We are glad that we got a beauty like you.Thank you mam......🙏🙏🙏🙏@tahirakashyap", "henna12bains": "Rockstar 🤗 love love n only only❤️❤️", "shivangisuri": "You’re a trailblazer ❤️", "srivastavamone": "Ur amazing and extremely beautiful lady 😘", "sidhu8477": "Love all of these pictures... inspiration! Respect!", "sej.uti": "Such a blessing u are to all the other brave hearts", "pgoutami": "@tahirakashyap Yeh raastein aasaan nahi hotey ..aur mushkil mein khilna fithrath ban jaati hai ..Yes with all the pain physical n emotional u have changed perceptions for sure ..😍Strong at heart n mind 🙌🙌🙌💖", "ronak.jain.925": "U aren't strong.... But much more than strong ! More power to you🙌🙌🙌🔥🔥🔥 @tahirakashyap", "simmrann_21": "God bless uhh ❤️ u r such an inspiration ❤️❤️", "dr_anushree.lavania": "More beautiful than ever, with this heart and strength❤️❤️", "amelia.crownsuperiorhomes": "👍👋", "kgpoonam": "@tahirakashyap ... more power to you, lady 🙏🏻", "harshitabajajj": "❤️✨💫🤗", "amykaybee": "Super gorgeous , super woman😘❤️", "mohnahanda": "❤❤❤More power to u!!", "anuradha.bhadane": "It's the thought that matters ... is what u define !! You are in your own way creating a beautiful ripple effect of unconditioning thought patterns !!", "ruchika.ratra.9": "Thanks for spreading positive vibes you Wonder Woman❤️ Much love🤗", "tina_pareek_basole": "Well said Tahira... You are a superwoman.. More power to you !!", "duskyandshort_": "You are beautiful inside out. The lenght of your hair doesn't define your beauty but your strength and courage does ❤️", "kanika_2580": "🙏🙏🙏🙏🙏😇 god bless you", "gratitude_happiness__love": "U are amazingly strong woman....u rock. Thanx for sharing ur journey....more power to u ...lots of love sent ur way ❤❤❤", "sun_oo7j": "Aapke courage ko salam.... love you maam...", "helloiampratu": "You wonderful woman! ♥️", "aviralmgupta": "Always interested !! No matter what !! 🤗😍", "trishachakmaa": "💖💖💖💖💖💖💖", "egupta\nVerified": "Verified", "hindsonu": "😍😍", "brinda297": "Inspiration😘😍...may God give lot of power to deal", "fabby_writz": "More power to uu @tahirakashyap 😍💝", "chinkitaagrawal": "Beautiful approach towards life and most amazig way to inspire others and make them feel secure too.... @tahirakashyap Congratulations mam u have truly conquered the cancer both physically and mentally....", "itsharleensethi\nVerified": "Verified", "mohinirane21": "You are an inspirational person❤️❤️", "asrakhaleeq13": "Beautiful in every single frame ❤️ more love and power to you stay blessed tahira jan❤️❤️🙏", "cas_2425": "You look great! Wish you speedy recovery!!", "sonali1014": "You are such an inspiration ❤️😘", "lilyahluwalia": "You are a huge inspiration of fearlessness and may God bless you with such positivity always. Wishing you permanent recovery soonest.", "neeta265251": "You are healing well👍💕", "renuu_dhiman": "❤️❤️❤️", "gaurav_arora124421": "Amazing", "aainachakotra": "Turning poison into medicine ☺️ you truly have implemented this saying by president Daisaku Ikeda 😊 you are an inspiration to millions of people 😊", "pilot_mommy": "super proud of u girl ... 😘 u were looking great", "paridhibhatiya": "😘😘😘 we looked up to you in college and we still do! You cease to amaze each day", "garima02puroht": "You are beautiful girl 🙌🏽🙌🏽", "kanika.bhatt": "Hats off to u gal", "kamalika2710": "Love them", "vidhikakertalwar": "I can totally relate to it , I am myself going through these metamorphosis during my cancer treatment and it redefines the essence of who the real you is and the not the aesthetic you.#fromthismomenton #bringiton #breastcancerawareness🎀", "khushbookg\nVerified": "Verified", "_darshuu_9_5_9_9": "Inspiration of many mores💯❤️❤️❤️", "niharika_chouksey_official_": "Inspiration 💕😘", "saga_shinde": "👏👏👏👏", "barkhakathuria": "Soooo coooool😍😍😍😍 god bles", "sija_narayanan": "❤️", "tanyaganguly83": "Tahira, you brave, brave girl! 🙌🙌🙌💖", "hadise__es": "😍😍😍", "nidhivyas23": "U are suchhhhh an Inspiration...god bless you ALWAYS", "sujibliss": "You are amazing @tahirakashyap !! You are beautiful!", "r0hitsp45": "@tahirakashyap 😎", "stellarxconte": "you're so beautiful, such an inspiration. Thankyou❤️", "ntyagi863": "@tahirakashyap hatsoff to u. I am a doctor doing internship now a days. I always read ur post. There is so much inspiration ur posts hv. I really appreciate ur efforts to share ur experiences and battle of cancer. As a doctor i know very well there is a loads of stigma, fear and misconceptions in our country people hv. Ur story is worth sharing and it will be motivational to such patients. Ur posts from ur scar to ur alopecia and ur recovery hatsoff lady. 👍👍👍👍👍 our society need much inspiration from the real fighter like you 🤗🤗🤗", "crazy_crab05": "❤️", "happypotamous16": "❤️❤️❤️", "daisydays_10": "✌️", "jhilik_12": "❤️", "shaguftakalim": "I am not a doctor; but as far as i know n hve dealt with bc frm close quarters u had stage 0 that is dcis.. wondering why did the onco prescribe chemo.. did u opt of for the oncotype dx test? Or was yr grade very aggressive..n pathology report had..Her positive or tripple negative. I dunno the details n am nobody to judge..was just curious since i hve loved ones suffering..watever be the case i just wish u a healthy n happy long life..", "falguniymehta": "👍cheers 💕", "luke_coutinho\nVerified": "Verified", "sukanya_mukherjee_": "Omg!! You are a massive inspiration ♥️♥️♥️♥️♥️♥️", "ankit.giri": "🤘🤘🤘🤘", "harshitha_reddy09": "😍", "kalakaarsingh": "Be blessed always @tahirakashyap di! Many derive so much strength from you including me. ❤️", "snehasaleem09": "Love you 😍", "puneetkpardal": "Love the #ki farak painda hai", "shubhangani_mathur": "You are my superwoman/ wonder woman all at one . Much love to you 🙏💕❤️🦋", "iheenalalwani": "More power to you🙏❤️", "mandirasometimes": "Much power and blessings to u!!", "f.a.tima_ali": "❤❤❤", "i_richaparmar": "🤗❤", "varsha3992": "Keep inspiring!❤️", "priyapune1985": "tahira..u r d most bravest girl i have ever met n seen..I ve my aunt who suffering with same problems..now she s also battling brest cancer..u r young n healthy.. keep.it up tahira 🙌", "tamannathakur444": "More and More Power Ma'am💕", "faizasuboor": "So inspiring", "simrankhurmi": "Such an inspiring post 💖", "_jigsawww": "You are a boss lady! Strength, courage and grace personified. And may I add, you look fine as hell! ♥️🤩🙌🏼", "gardenofmuse": "Wow! Truly said. Ki farak painda hai.. love!! 😘😘😘", "bombayness": "😍😍😍😍 winning it!", "anjumattar": "Kudos", "ankushgoyal07": "🤗😘❤️", "frienatic__": "💙💙💙💙", "shetty_yashvini": "❤😍", "gunjan_tarani": "You're an inspiration 😭❤️ I WISH EVERY CANCER PATIENT IS AS STRONG AND POSITIVE AS YOU ARE ❤️ keep sharing such vibes always! ✨🌻", "rosyrambani": "❤️❤️ You are an inspiration ❤️❤️", "travel_via_dream": "You are beautiful as your thinking mam !! Respect 🙏", "dreamzun": "You and all Women are beautiful 😘🙏 and so are all Men and God's creations 🙏😘😍", "vishalidevik": "❤️♥", "shubhada.borate": "Tahiraaaaa maaam , no words for u , pretty women &biggest inspiration 😇😁", "bee.caesar": "You are one hell of a woman. Mesmerised 💪🙌", "sharayu231193": "Hello mam.... do u really think that yh hairs ke vajhse aapko koi like nahi karega?? Mam u fight with cancer nd thats what we people appreciate the most... i know may be u will have lots of msgs nd comment which hurts u but remember the love shower on u by ur family nd friends.... we salute u for ur achievement.... lots of love and strength to u mam.... GOD BLESS YOU ❤ U R MOST PRETTIEST MAM 💖", "stuffednstarved": "you are a superstar!!!! Everyone should read this. And everyone needs to understand self acceptance like you do Tahira!", "arjunwahi55": "You are an inspiration, Tahira! You are deeply in my Daimoku and I know you will conquer the universe! All the very best😇🙏", "somyasnehi": "❤️", "pooja_prasad555": "More power to you!you are such an inspiration.god bless", "_ayushmannkhurrana_instafc_": "YOU'RE AMAZING!! MORE POWER TO YOU!!! 💪🏻", "rahat.sajnani": "I respect you for your bold and brave attitude! Be You", "rabab.imam": "Hail!!! 🙌", "silverdagi12": "Hi, that is a wonderful post! Just also subscribe to my friends @ kini.kana. They also tell about selflove. I have tagged them in the latest pic. See you soon! 😻", "mamta__navani": "Our blessings r always with you.. Soon u will be recover with happy results 👍❤", "kshitijasddesai": "More power to you!!! Rock it!", "b_shirisha_rao": "Superwoman❤️❤️❤️", "hukam_singh_septawas": "😘❤️", "rohinisharmamishra": "You are beautiful , with or without the hair ..and so is everyone around ❤️ May you be blessed with good health and happiness💗", "seriousdisorder": "❤", "shabari_saha": "You are an inspiration..love you mam..", "believe_risshi": "You are a champ and an inspiration to many.. Take a bow @tahirakashyap", "apatel78": "@tahirakashyap - you are beautiful in every stage of your transformation- thank you for your inspiration and your positivity and glow- I live in another part of the world to you - but feel connected to you and your positivity when I read your posts on days when I have no juice left in me to soldier on with this breast cancer and chemo. Keep inspiring, keep smiling and stay well xxx", "kashyap6480": "Growing radiant with each passing phase.Love you enormously.♥️😘", "sandeep.9t2": "Awesome", "sumitabhdas": "You are brave bold and beautiful, no matter how and what !! Be strong 💪🏻", "mehakchaggar": "❤️", "ajantha_19": "You r a warrier ..you are an inspiration♥️", "pie7197": "😍😍", "karmasphere_12o6": "Superwoman", "pandey_ji_ka_ladka_1": "Hindi?🤔", "aditi.dev": "Hey warrior, you look damn pretty❤️❤️", "meghna.bhalla": "SUPER WOMAN OF THE CENTURY🌻", "nikkesha1": "So beautiful and inspiring. 🔥", "pallu.neru": "Ur very beautiful . 💜and so are your words.", "pragnya_mohanty8": "A big respect❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤😍😘😘😘😘", "rudhrakshjaiswal1\nVerified": "Verified", "vikram2517": "@tahirakashyap u r brave.. Whats next??.. Its time to fix the mind thr meditation", "jasminek06": "More power to you, stay blessed😍😊💫", "exalted_v": "😍😍", "mehararora9": "You look so damn pretty in every single picture 😍"}