{"beautywithinplants": "I love this!!", "fkrwnhsn": "🔥🔥🔥🔥🔥🔥🔥🔥🔥💋🔥💋💋💋💋💋", "blandine_creations": "@themfr92", "built_2_survive": "@geneva_la_jade", "luvtodig": "I love the dance at the end! 😘", "alisha.friday": "27 and never checked myself before until right now watching this video. 👏🏾", "klausgocrazy": "I miss my mom 😪", "dingygingy": "You’re amazing for putting this out there!!!!! 👏👏👏👏", "bonnerbabyd": "@kween_mitch", "krillanp": "Thanks for showing us how to do this. I love the Dance at the end 🥰", "shaheryark82": "why you remain nude?", "lifewellnessbk": "🙏🏿🙏🏿🙏🏿Thanks for this guidance!!", "m1yl55": "🙌🏾Thank you lady for this IMPORTANT message and willing to be FREE in sharing it!!!! U are an angel 😇 😘", "eileentruax": "Thank you, thank you, thank you!!! ♥️", "mercy_1889": "🌟♥️😘", "stephaniesmahoney": "I see you have scars on both of your breasts, did you have breast cancer in both of them?", "rebeccasandwiches": "Thank you!! All the pamphlets etc don't say what to do if you have big boobs that always feel lumpy - yours was the most helpful explanation in years! Gratitude ❤️", "karlos_cruzmar": "@luuna.xl", "maryjay8898": "Thanks you sweetheart 👏👏🙏🙏🙏🙏🙏🙏🙏 for the important message🙏 but please how can someone knows if she as cancer after checking her self", "curvefluidity": "@theonlydshani check yours please or I’ll do it for you 😘", "annakochetkova": "Thank you for this. It is lumpy deeper so I could never trust my self exam. It makes sense now what you say! Thanks!", "r.m.ess": "@miss.congolese", "npolen93": "@karol.huertas.c", "ekres28": "Thank you for posting this!!!", "her.atmosphere": "What is the lump supposed to feel like exactly because I can’t tell if it’s a lump or muscle @ihartericka", "2warriorslifestyle": "Thank you so much for sharing this! 5 days shy of being 27 & for the first time I’ve seen an actual demonstration as to how to do these at home! 🤯", "criswishofficial": "Thanks for sharing", "marisrain_": "❤️❤️❤️", "robin.wallace": "In May, I woke up to a painful lump in my breast... After decades of not doing exams, I've now learned to do so, and how to do so. Even with so many women in my life, like you, who have had breast cancer, I still felt like I was in the clear since my family history doesn't put me at high risk. In November, I go back for my 6 month follow up. Thank you @ihartericka for being a fierce stand for women's health.", "dime.eme": "👏🏽", "furbydebarrio": "Thank you!!! I didn't know how to do it 😊😊😊😊😊", "hcansevdi": "I love you baby🙏❤️🌹", "breastcancermagazine": "REGRAMMED at @breastcancermagazine THANKS for sharing this #BreastCancerWarriors picture :💪🏻)", "decobroad": "@empatts", "dr.zabaleta": "👏👏👏👏👏👏", "thelittlebigmac1897": "I-is it still nudity if you’re nipples aren’t there", "betsynilan": "This is awesome! You are an incredible advocate. Thank you for all you do to bring awareness to the importance of breasts self-exams. I work for @getintouchfoundation and we teach breast self-exams too! I know there are some organizations and medical professionals that are sadly against breast self-exams, but a voice like yours continues to inspire and empower. 🌸🌸", "trans_in_color": "This is SOOOO IMPORTANT! Many people do not realize they need to do breast exams. I’m constantly telling trans men that they ALSO need to do self exams. Thank you for being a voice. 🖤", "tanya_beautydiva": "Awesome page , I admire you ❤️", "maud.emmanuelle": "Thank you !!!! It’s so really important ❤️", "el_malhablado": "You are beautiful in all its expressions❤️😍🔥", "secundrabeasley": "Just did my first mammogram exam using your method. Thank you for keeping this post up.", "iyanamonet": "This video is powerful!", "towie_towizzle": "🙏🏽❤", "origeechee": "I love you for this sis- got to take care of them boobies 👸🏾", "josefinamariaguerrero": "@micaela.tedeschi", "wenndyconde": "🔥🔥🔥U are wonderful!🔥🔥🔥😍", "albinsrt": "Thank u to be real ♥️", "samicalifornia": "thanks for this", "tashaxxcampos": "thank you for being so strong for yourself and all the women out there. thank you for not letting breast cancer, your scars and the way your breasts have changed, define you. Your strength to not only embrace what you’ve gone through, but trying to help other women is beautiful.", "taysia_louise": "Thank you so much!! I have always put off doing these because I had no idea what to look/feel for. I accidentally found a lump last week and that spooked me enough to wanna look into it then bam, this video appears. Really appreciate this!", "staccsup_fto": "💙", "nikkiinfinity": "@kacierainey !!", "msblisspics": "♥️ Thank you.", "ko_libri19": "Great girl. Love you somuch. But for someone who have a grain in the breast. How this person can check her breast and not felt suspicious? ?", "mildredsanchezo": "@meilingaquino @bielka.benezario @mariateresasanchezo @marielasanchez.123 @_lbenezario @carmendiaz1883 @ortiz_nurys @ketorecovery_ @👀👀👀", "anyuramakeup": "@yeilove", "rosariocastillam": "Gracias por educar 👏", "riscoarjona93": "👌🏽👌🏽💕", "khaljavi": "FANTASTIC. THANK YOU 🖤", "kellysn11": "Wow!! ❤️❤️😍😍 Gracias, eres pura inspiración 💋", "loreqwm_": "❤️", "fabianacordi": "Genia gracias 🙌", "animalcarephoto": "You are the boss!!", "alexandra.plans": "❤️❤️❤️❤️❤️Thaanks!!👏🏽", "lola_quintero": "Amazing !!! Thank you", "liliandherband": "Thank u", "albiwithchili": "Thanks you !!! you are a wonderful 💣!!!", "kaiaharem": "Thank you so much💛💛💛", "borjapr_": "Tus pezones se han ido con Marta Del Castillo", "kimberericaj": "I have regularly checked my breasts for many years. I found a lump when I was 34. I was lucky that it was precancerous and I just needed to have the lump removed but if I hadn’t have found it then it could’ve been much worse.", "valentinebosch": "😍😍😍😍😍", "shxanda": "Your amazing mami.... love the energyyyyyy ❤️👏", "_mushhx": "Queen 🔥", "zanecony": "It’s interesting how the nimble plays the role of sexualizing the breast without it seems so normal", "aap_style": "🙏🏾🙌🏾💪🏾🔥💜🦋❤️😘", "emlouiii": "Brilliant! So important check early!! Knowing how to self exam and the signs of breast cancer meant I got diagnosed early at 24. Saves lives!!! You’re a hero, so empowering as someone who’s had a bilateral mastectomy too 🖤", "sarahndipitiy": "Thank you for the video!!! Never knew how to do it even though I know you should", "llanisia": "Yes🗣🗣🗣🗣", "nalliiii": "❤️❤️❤️💪🏻💪🏻💪🏻 thanks!", "gatabajolalluviia": "Loveit💞💞💞💞🌹🌹🌹🌹🌹", "victor_pitu": "❤️", "quartzandbees": "Thank you for this!! I didn’t even think to check in the shower!", "nearlife_experience": "🔥💖", "ayesejla": "💕💕💕💕", "okshawty_": "bad ass bih! luv this", "out_with_lanterns": "Does anyone know what age one should start checking? Is it a puberty thing? I was never told to do this as a kid. Also, is it better to stand or lay down, b/c my ob always has me lay flat.", "rachelleflowers": "❤️❤️❤️", "littleartistelie": "Thank you for sharing. This is one of the best examples I’ve seen and the information is invaluable as a 25 year old who has never received proper instruction or education on breast exams.", "enlitenkoppte": "THANK YOU ❤️ And thank you for pointing out the part about surface vs. deep tissue, I've been scared so many times by the tissue lumps 😬 (they have been checked and cleared btw). My grandmother died from breast cancer when I was 2 months(my mom was 18), so I definitely take this very seriously. ❤️", "lizethey": "I’ve had multiple breast exams performed by doctors, but not ONCE have they checked in or around my armpit!! 🙄 Checking every shower from now on. Thank you for this!", "anayyyyyya": "❤️", "chocolatinaruiz": "I love you 😭😭", "lulutenant": "This post is amazing, thank you! I went in to my gyno for a lump that turned out to be a false alarm and she basically shamed me and told me I should only be checking at certain times of the month to avoid a scare (I guess at certain times you’re more likely to have swollen nodes?) the whole experience made me pretty uncomfortable, tbh. I’m commenting to see if anyone here can recommend a good obgyn in NYC?", "busterblitz": "If you had to describe the lump you felt then, how would you describe it for breast self exam newbies? I’m 32 and I do remember that my health class covered it but I was like 15 (and surrounded by upper class men and was 💯 not gonna ask for more clarification at that point in my life)", "zoe.dakis": "I wasn't really sure how to do a self exam and I was too embarrassed to google it. Thank you 💕💕", "choicesforsexualhealth": "❤️❤️❤️", "nielsdottir": "Really, thank you for showing it! I always thought you had to check the deep tissue, so this was extremely helpful!", "_missmoons": "Thanks so much for sharing it’s so important thank you ❤️ 🙏🏾", "karimamii": "Yes sis! Yes I love this 😩!!!", "pina_bash": "I didn’t know how to do a breast exam before this video. Thank you ❤️", "graphicsprocessingunit": "thanks for the reminder omg", "nadiaalcs_": "😍😍😍😍", "tiptoewalker": "Thank you for posting this , now I'm reassured that I'm doing it right! Hopefully this stays up, since it's clearly educational! 💯", "elsagmzz": "😍😍😍", "uy_k_vertigo": "Gracias", "theloudmouthblackgirl": "@theestallion", "iamthatlove": "LUV ur energy gurl! Real realness on display.", "agirlhasnotane": "Because of this post I finally learned how to do a self exam at 25! Thank you queen 🙏🏽", "amakagrant": "Best video of all time!", "emma.carolina": "❤️❤️❤️!!!!", "synaptic.sylvie": "Thank you for sharing", "licia_nicolee": "Hey when you do self exams how do you know what the lump will feel like vs the natural lumpiness?", "brittneymaye": "I knew that I was supposed to do this, but I had literally no clue that this was how! Thank you for creating this!", "cancer_dr": "@ihartericka I love you 💕", "ketaagiggles": "What you are doing is so valuable. Thank you so much!", "jackarouge": "Thank you thank you thank you", "lynons": "@cest_dans_la_poche", "leaisbats": "💜 I love you! Thanks for doing a demonstration!", "customgender420": "i've never seen a demonstration before and i really appreciate this post. i have a lot of anxiety about this and this video made me feel so much better 🙂", "melaninmasalah": "I dont know what I'm feeling for. Smh I need help .", "_drizzylys_": "😭😭🙏🏾❤", "maenahfritz": "Thanks for the awesome video! I’ve never really understood from illustrations and written instructions what this was supposed to look like!", "irisvonk": "What is the best time in your cycle to check?", "thewritegyrl": "👏🏾👏🏾👏🏾", "aa.adrianaterren": "❤️", "ndjocu.davies\nVerified": "Verified", "baileytemaipi": "@ait6 👏🏽👏🏽👏🏽", "1goddezz": "U r awesome", "expressedreaction": "Amazing 😉 ... and beautiful", "ihartericka\nVerified": "Verified", "coachcrystalrocks": "Thank you thank you thank you!!!!! Everyone I know with breast cancer found their lump themselves. It's so important to know your body, report any changes, and keep pushing for answers if your medical team brushes you off. And don't forget - lumps aren't the only symptom to watch for. Any noticable change counts! Thank you again @ihartericka !", "genesys420": "Thank u Goddess!!", "pansytarot": "Thank you for everything you share 💕 so much love", "6floorco": "Thank you 😍🔥", "wxlfgaang": "I often feel weird pain on my chest and in my armpit but I don’t really know what I’m looking for when I’m checking. I can’t really tell what’s normal and what’s not", "jasminehett17": "@charlieseer !!!!!!!!!", "chocotoya": "Love this, so important to raise awareness!❤️", "onlyemonie": "💖💖💖always", "vanessadesa_": "@jacobferreira25", "mad.slut.problems": "This scares me so much...even though I see you so vibrant & alive😭", "wellbeing_witch": "Thank you so much for this, its so important! I have never been shownhow to do this and I am 28yrs old and breast, bowel and ovarian cancer runs in my family! Is it okay to share this on my story? 💖", "angela_ventures": "😂🤣 I wasn’t prepared for the happy ending", "kurdwurld": "@sleazy_dee69 @shan.clare.d @nikkicola89 @plannedparenthoodnlshc", "danmhill": "I had a fibroadenoma, so glad I got it checked out properly to stop me from worrying but keeping it all in", "milly.glynn": "Important!!!!!", "x_dragonlady": "What will something abnormal feel like? I get stuck cause as you said the deep tissue is lumpy so I’m afraid I won’t be able to tell the difference", "wintheempress": "A queen 🙌🏾thankyou", "alexauder": "🙌😘", "hayley_keaton": "Thank you for demonstrating (and normalizing) this. I’m 37 and wife of a cancer survivor and I STILL forget/avoid self breast exams. Off to do one, now.❤️", "tiger_kriger": "Really helpful!", "sara__raine": "Thank you so much for showing me how to do this. They never taught me in any fucking school.", "jerkzeelilac": "thank you for this!!", "wildey89": "Here for this 🙌🏻", "lisalaadams": "👌 💕", "jen_noel15": "Thank you so much for sharing this and making yourself so vulnerable ❤️", "elemoon__": "Thank you queen !!💓", "gaykakn": "even physicians often don’t know how to properly examine for lumps. this is so important to know and share!!! thank you 💟", "gmrakadeh": "@coppafeelpeople", "gracee_ellisross": "Thank you for this!", "que_em": "THANK YOU! I’ve always known I should do them, and try to, but also often skip them because I don’t feel like I know how to do them properly and for some reason feel embarrassed and anxious about that which makes me avoid it. So I really really appreciate this; this 1-minute video is going to change my relationship to this part of my health going forward. ❤️", "celestial_jazz": "You remind me to do self examine when I forget. I'm going to put reminders in my phone now. I appreciate the time and love you put into your teachings", "kelson83": "💜🙌🏾💚🙏🏽", "hirondelle_8.0": "🙏", "m_m_manuel": "🙌🏽", "iamchloenicole": "*saves* thank you so much for this, truly ❤️", "amalie_soderberg": "Thank you 💫❤️", "mahi.davi": "Thank you!👏👏👏", "jolines_tia": "You are wonderfull 💞", "ceddywiththegoodhair": "@storitelling I went to undergrad with Ericka. You’ll love her profile! We are here for you !", "thevegandefiance": "SOO IMPORTANT!! thank you 💛💛💛💛", "salaseinikaitani": "@irihapeti_tamahou so it can be near ur armpit😬", "princessempath": "Queen ❤️❤️ Thank you", "tyg450b": "I’m on my period and, with my breasts naturally sore right now, looked up the best time to self examine. Apparently, a week after your period. ♥️", "ruggedflix": "This is sooooo important. Thank you so much for being so open and wonderful about this. 💕 I've dealt with multiple cysts in my breasts and now weird fibrous lumps. We cannot take our health for granted.", "emilyshiraz": "this is SO fucking important", "biancadgodden": "Found this post on another page and I wanted to thank you for this! I have seen pamphlets and felt fake jelly breasts that are supposed to be what a tumor would feel like but nobody has ever SHOWN ME. Thank you thank you thank you", "phillipafenty": "Thank you for posting this⚡️", "meow_miiix": "Good reminder! I do one once a month, and have since I was a teenager. Back then I figured, being familiar with my breast tissue would only make it easier to notice a lump, if one should occur.", "nate_nastyy": "I got mad love for u❤️❤️❤️ beautiful", "bitchyy_mcflyy": "Thank you as always Ericka 💜", "kokicchiouma": "I feel like they should teach students in school how to self check for breast cancer lol", "cosmictr4sh": "Thank you ♡", "gaiaw.xyz": "Thank you for showing this. Doctors never show me and I've only seen diagrams. It's obscene the way they treat Black people they identify as women. I have undiagnosed health issues because doctors assume I am healthy because I ride a bike as transportation and eat healthy food. But there is so much more to it than that. So again, thank you.", "taylorhart": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "gonnadowhatiwant": "Thank you for this! You’re amazing.", "jazzafine": "🙏", "nora.wilhelm": "This is superb and so relevant on so many levels ✨🙏🏻", "jennasaisquoi2": "Thank you that's a helpful tip :)", "pg3teen": "hi i don’t know if you’ll see this, but when you first start out and don’t know your normal texture, how do you identify what’s normal? i know that’s a difficult one lol sorry!", "omgitsrachel": "Thanks for the awareness <3", "calimack3": "Thank you so much for sharing this!! I really appreciate the visual as it's so much easier to understand than pictures. I truly appreciate your work!", "lollybananasloves": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "malibudarbe": "@theestallion", "youwillbespock": "I’m 20... that means I’m not too young to start checking? I never thought I would have to worry about this until I was an older woman", "bunnymadisan": "Wow I have never seen a video on how to do this myself - I live in a household where I could NEVER ask my mother/grandma/etc to teach me. thank you SO much - you are so important", "she_spotlight": "Thank you.", "lonewolfliz": "Radiant soul 💛 Thank you for this video, my Dr. wouldn't show me how to check because I have anxiety & she feels I would become \"too obsessive\" with checking.", "ak__the_great_": "Real talk tho? I've been checking my breasts A LOT because of you @ihartericka . I was able to track some changes, since I was having lots of pain and tenderness, and had a very good record of my symptoms before I went to get a checkup. We are all fwends here, so I will willingly admit that I missed, 6-8 scheduled appointments (whispers, more like 8 or 9), but I did go in eventually. The doctor who I seent only been a doctor for 3 yrs, but we came up with a plan to return in 6 weeks if things have not resolved.", "town_hag": "I talked to a nurse practitioner once at a gyno appointment and she said they didn't like to encourage people to do self examinations bc of some random reason, I forget bc I was kind of shocked and confused! So anyway, thank you so much for this!!! ❤️", "bodykindfestival": "What a bloody brilliant video ❤️❤️", "meaty.okra": "Ive literally never known how to do this ive just mashed my tissue down into my ribs and hoped everything was normal this is SO helpful.", "harla_esque": "Thank you, you powerful soul 💞💞💞", "ak_philotimo": "You are so f—ing beautiful for sharing this!", "oh___hey": "Thank you so much for this Ericka!! I've always wanted to see someone else properly doing this and also seeing you so it makes it less scary!!", "kameeeelia": "@maryam________ibrahim we need to do this", "aewillis777": "Glad you are still here. I’m 2 years out from my last treatment. Grateful that I got that mammogram. My invader was hiding. We live!!! We win!!!", "thefreshfinch": "Thank you so much for this!! I never knew where to start and if my initial lumps and bumps were my normal but I guess getting a feel and doing more frequently will help me become more confident 💖", "legendofthesiren": "Thank you for posting this! There are many people who are still in households where nudity and tits are taboo. This information and video will hopefully reach even them. Honestly this has been the most helpful thing I've ever seen and read regarding the subject.", "detachablegemini": "🙌❤️", "adriel1shere": "This is honestly beautiful", "gravityandgracemovement": "I love this. And I love you. Thank you🙌🏾❤️🙏🏽", "emi.not.emmy": "👏👏 thank you!! You are amazing trong and beautiful!!!", "austriaunavictoria": "Thank you for the reminder!!", "wwwooook": "@theestallion", "incan_princess": "My mom was just diagnosed with breast cancer and I’ve been really thinking about doing self-checks myself but couldn’t find resources to know how exactly to do them. Many thanks for sharing this ✨", "thunder_poodle": "🖤💛💚❤️", "its.only.a.phase": "Thank you for posting this! ❤️", "joyshalove": "Thank you!!", "aprangenbergart": "I ❤️ this combo of wisdom, experience, compassion, and fun. U r a rockstar ✨", "alibreeninsta": "@loveletterlifestyle I want to showcase this kind of real self care....", "getcomeandgone": "So necessary!! 🙌", "nupsterr": "@theestallion", "mygiddyjaunt": "I can’t say how much I needed this tonight, thanks for the smile’s!!! ❤️❤️❤️", "briannalfarris": "Amazing ❤️", "stareyedcharlotte": "Never thought this could be such a damned sexy ritual. 🔥🔥🔥", "beccaaa__17": "Thank you for actively demonstrating what literature fails to show IRL.", "rocioaa.mmexpression": "So helpful thank u sm❤️❤️", "ieobg": "Thank you for sharing , 💯💕🙏🏾", "chaia.kreisel847": "Is this a man or a woman?", "faraisimoyi": "🙌🏾🙌🏾🙌🏾", "laalanik": "Thank you so much for demonstrating how you do a breast exam, I really appreciate that! I’ve always done the two finger circular massage motion but I’ve never thought to do a surface kind of tapping like that, I’m gonna try that next time ☺️", "dancelittledancer": "Thank you. 🖤", "lilcuppatea": "I have never seen a real-life demonstration. thank you.", "luna_onion": "💙", "erinvthomas": "1) this is so helpful 2) i still don’t understand what I’m feeling for. It does feel lumpy deeper as you say.", "greer.mcnally": "Did one! Thanks for the reminder!", "idontwearpink": "Thank you so much for sharing!! This is SO helpful ❤️", "justsheherhers": "I appreciate you and all you do for our community Professor Hart!!!🖤🖤🖤", "iampattytalbert": "I'm smiling", "vermilion42": "So smart to know your body and pay attention, don't ignore anything...my cancer never showed up on even 3-D mammograms, but it did in the biopsy😂 BMX whew! It is scarier Not to find it, than to find it early!", "tara.yo": "Super helpful. And fun", "erikaoliveira0": "@dona.juliana", "dominiquedanyel": "SO helpful. Thank you! 💛", "lazingara_bmore": "Thank you for the reminder.", "wya.cowboy": "What a mf queen", "aracelinesss": "ive been doing this wrong for years :o also, I sometimes find it painful, but doctor said everything's fine. Should I get a second opinion? thanks 💞", "margs_nicole": "Thank you for this reminder. I try to check my breasts at least once a week, and like you said, usually do it in the shower.", "mushr00m.days": "ummmm who tf let you be such a goddamn god", "earthycollector": "💛 doing now", "laurendaeger": "Thank you for sharing this ❣️", "carrieshuffles": "You are the greatest. 🙌🏼", "celestew72": "Thank you @ihartericka for doing this and for all your education work. I have Fibrocystic breasts so it’s always really confusing to me doing a self exam because I think everything is a scary lump and I get paranoid all the lumps are a new lump and I just can’t tell the difference. My grandmother, aunt and mother all had breast cancer at different points in their lives so I feel like I’m constantly checking mine but never feel confident that I know what I’m doing.", "jasonantoniokelly": "This is so important!! Thank you!! I don't care who you are, how small or big your breasts are, if you think \"I'll be fine, no one in my family has had it\", if you wear bras, go braless or a chest binder, ALWAYS CHECK!! It's better to be safe than sorry!!!", "martinah_aa": "💘", "darksideoftheboob": "This was very helpful thank you thank you!! You are saving lives right here!! 🙌🙌", "jvli.a": "@bazardecomuna uma paz", "littlelouiseloveshair": "@ihartericka cuuuuuute underarm hair 😍💕", "morticia_godiva": ".*cues Big Ole Freak and does self exam*", "brittany_nicole": "Is it true that the best time to do a self exam is right after your menstrual cycle?", "myorgasmiclife": "Just checked mine! Thanks for the reminder!", "lex_behonest": "Finally instructions I can understand! Thank you so much for demonstrating", "k8lyn.aariel": "Just did mine while watching you... thanks for the reminder Ericka‼️♥️💯🙏🏽", "buckangel\nVerified": "Verified", "icallmeprincess": "I was today years old when I did my first breast exam watching this video. I'm 36 God bless you woman", "oldowllady": "Thank you for this 🙌", "mellytesta": "Thank you for showing your body and talking about this.", "fearthemarnster": "!!!!! You are amazing - thank you 💓", "zanisankofa": "This is frightening and empowering. Thank you.", "raisehellandhowl": "Thank you for this reminder! ❤", "kyhsopen": "Perks of having no nipples? Freely posting your titties on Instagram. I stan .", "girlnamemusic": "GORGEOUS!!!!🙌🙌🙌🙌🔥🔥🔥❤️❤️❤️", "rossshon": "Awesome presentation !!! ✊🏾✊🏾✊🏾", "pink_amy_pink": "Followed along!!! Thank you!!! ❤️❤️❤️", "englishchef_turned_2_art": "And thank you for sharing", "elibarrraz": "This is a great example! Thank you for the strength and greetings from Mexico City!!!!!", "officialmrmoore": "Awareness", "rainvaldez\nVerified": "Verified", "kelikinet": "Why is this song perfect for a breast exam!?!?! Self care and self love all in one!!🙌🏾❤️🙌🏾", "jock_powerviolence": "😍😍😍😍😍😍🔥🔥🔥🔥🔥", "itsnadege": "🙏🏽", "detailedjourneys": "Thank you for sharing this ❤️", "carijeffries": "@kirstietravels", "daniela__bdhk": "Thanks!", "privateyez": "Thank You", "alexandradanae": "Thank you for this!!", "yourmidwifebri": "Self exams are not recommended anymore... but knowing your breast is, does that make sense? Notice for color changes, new dimples, rashes pain, bleeding, changes to texture. Touch your body, know your breast and what they look like. This goes for all parts of your body. Go to see your midwife or gyn yearly make sure they listen to you and give you time to talk.", "stephaniemadeit": "This is awesome thank you 🙏 just did my self exam!", "ari_frami": "Do you do this every day? My doctor said i should do it on the second day after i get my period but i keep forgetting", "yasminamattison": "Thank you for sharing!", "thebazaarbohemian": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 Just checked, Thank you 💪🏾❤", "finnley_mallory": "Cancer is a bitch 🖕🏻 but look on the bright side if you don’t wanna wear a bra you don’t have to because no pointy nip nops", "dashama_n_dexx": "Thank you", "k_doy": "@marloook @emmalemmababylady", "revere.reis": "🙌🏽🙌🏽", "cathlingrace": "Thank you for this!! I’m embarrassed to admit that I’ve never really understood how to do a breast exam, and as a visual learner, this is SO helpful!!", "asitwere": "🙌🏼", "righteousdew": "Yes!! Thank you this is v helpful!! 💖💖💖", "aimiintardis": "Thank you for this! No one ever shows how to actually do a self breast exam, it's always confusing diagrams! Now I actually know how to do them!", "messmarshall": "This is super helpful, thank you for sharing. Xx", "chinyere": "Thank you for the reminder I just did one.", "deadnettle": "thank you for this. honestly one of the best examples/explanations i’ve had, and it’s so simple! thank you for sharing!", "planesworkshop": "This is so incredible and helpful. This has honestly changed how I will check from now on. I did not know about the importance of focusing on the surface. Thank you so much!!!! I feel enlightened and not so scared about how much it will hurt to check. What an inspiration you are! ❤️", "shannawms": "👏🏾👏🏾👏🏾 So helpful!", "turtlefoxhey": "this is important, thank you for sharing!", "bunnymichael\nVerified": "Verified", "breatheinstars": "Thank you @ihartericka ♥️You’re out here saving lives. Saving and sharing!", "more_jam": "Thank you for this! 😍✨💣", "seafoam___": "Thank you for the reminder💖", "becdwyer": "@l.etish_.a @monzc_ @melmiller1001 this chick is the fucking best! Check yourself 💕", "tresgem": "Gracias daughter from another mother to keep the awareness a live 🙌", "fun_skeletor": "This is so helpful. Thank you for the reminder and the tips! Those are all the things I run into that make the whole thing confusing :/💛", "whatsda_t_lc": "Is burning on the breast or nipple area an indicator of something abnormal?", "rachaeleduddy": "Holy hell I feel like I’ve been BLESSED finding you today.", "__alltherightweaponry": "Yes! You're amazing💓🌹💓🌹💓", "bantu.bae": "Lord please check your axillas!!!", "lola.rose.eros": "Thank you!🌈💖", "evaparrell": "Thank you <3 going to do the same!", "jnnywstndrf": "Most helpful thing I’ve seen in a long time. Made possible by your whole self obviously but also lack of nipples which is so dumb @Instagram change your policies ya big dumb toe jam smelling excuse of a company", "ericam8x2": "I found a lump about 2 days after my period. It disappeared (maybe just a cyst) but i still went to the doctor. She didnt find anything else. She offered to send me for a mammogram but since I'm only just 30 with no family history she said my risk is super low and mammograms can give false positives. So I'm on my next period since that happened. Gonna check for more lumps after it ends. If anything shows up again i'll probably pursue a mammogram. Blegh 🤷‍♀️", "marbenymachillanda": "Gracias, es muy importante", "rachel.blaze": "This is a perfect example, I have been fumbling with my own at home breast exams and seeing this is so helpful! Thank you!", "eemmamaxwell": "Thank you so much for the video AND caption ❤️❤️", "abby_ramona": "Hi! Thank you so much for this. When my mom taught me at 13, I found an abnormality THE DAY after and ended up getting a (benign) tumor surgically removed by the age of 14. I ❤️❤️❤️❤️ that you included the age you started checking because a lot of people think that breast cancer only affects older people. And glad that you said 'chest' because males can also have breast cancer! I just resonate with so much in this post, ahhhh!! 😍", "hot_wax_": "Best to do them on day 5-7 of your cycle!", "breebree_55": "I have some symptoms of inflammatory breast cancer and swollen lymph nodes in various places. They will only do an ultrasound bc I'm 22, but i know that, that isn't a great screening method and is specific for diagnosing after something had been found. Do u have any advice I would really appreciate it because I don't want to wait for something worse to occur for them to finally give the screening I need to then tell me I have only 3 to 5 years.", "kasspulido": "Thank you for this", "shellyy__shellyy": "🖤🖤🖤", "jensaye": "Does anyone have resources on self exams for large breast. I see example of people raising their arms to pull the skin more taut and lift the chest. My saggy boobs stay right where they are 😂", "radicaltherapycenter": "So helpful! Ty 🙌🏽", "lillatchka.sp": "This is Really helpful because I never know exactly how to do it, but now I do! Thank you!", "jewtime": "@tatertwats_", "femmebeeating": "Thank you!!! I needed the reminder.", "kissstrina": "Thank you for posting this", "amberinthought": "Thank you for the demo idk what I have been doing 😭😂", "stefanibraiki": "thank you for posting this! i have been doing mine incorrectly and focusing on the deeper tissue and couldn’t understand how i was supposed to differentiate between a ‘normal’ and ‘abnormal’ lump ... this really clarifies things.", "jhollidayhealth": "Ohhhhhhmg, I love everything about this!! Thank you for your fearlessness and generosity in posting. It's a good reminder, and informative! I had to check again... the internets say it's ideal to check at 3-5 days after the start of a period, so this is great timing for me. ❤", "pignolia": "THANK YOU THANK YOU THANK YOU!!!", "wheat_from_chaff": "❤️❤️❤️", "_arieljean_": "I really appreciate this video, much more informative than the cartoon images that show you how to do one 🤦‍♀️", "maybeokayno": "Check them boobies @ctsweet82 @crissyreneee", "sarahdauer": "Honestly this is the most helpful exam guide/advice. Thank you so much for sharing. I feel so much more informed and empowered to do breast exams after watching this. I", "cinnamonrosepriestess": "Thank you ♥️", "sutopiasue": "Thank you!! I am so happy to see others encouraging everyone to do self exams and to know their Bodies best. I have also had a double mastectomy and I admire your power and voice.💪🏼✨💪🏼✨", "lei_evolution": "Thank you so much for this! 💜", "otterlytof": "Thank you thank you for this! Need to see more of this on peoples’ feeds. ♥️", "candyandcurves": "Thanks so much for this - I never knew about focusing on the surface! ♥️", "hauntedfurby": "Thank you for sharing this important message!!", "akneadedtouch": "Thank you for sharing!", "brujeteo": "since i was 13 ive been afraid to touch my boobs, and also others touching them in a way that feels weird. actually some partners have told me that they have felt something weird in one of my breasts, but i havent dared to touch it or have it checked by a doctor", "hippysunflower1": "❤️💓❤️", "ashleemariepreston\nVerified": "Verified", "mydharma_yoga": "@ruby_brahene", "kellie.schneider35": "And men need to do them too 👍🏻", "piinkay": "I noticed a lump in my teenage years doing this. Thankfully nothing and still no issues.🙏🏾", "trash_kitty0": "Thank you! I use to be unsure if i was doing it right. Thank you for being so amazing.", "ganjayogamontreal": "You're one of my heroes, wow!! So real and vulnerable and powerful at the same time 🔥🙌😘😘😘😘😘", "nele_maas": "Is there another approach needed while breastfeeding? Or when pregnant or postpartum without nursing?", "sustainablebk": "🖤🙌🏾", "sarahkiva": "💜🙏🏼 Thank you this I regularly check them now since I started following you years ago 🙌🏼", "watcrtribc": "Thank you for the reminder!!! 🖤", "shannonsorensencreative": "I didn’t know this about the surface! I found a lump deeper in that ended up being a fibroid. I was digging in deep. 😬", "hipsdntlie40": "Yaaaaassssa teach them Sis🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌", "et.hoe.pian": "of course I was shirtless when I saw this & did it alongside you via screen...thank you!", "ericaballoo": "@mermegs Now we know!", "tyieshazhane": "Wow !! I never really knew how to actually do it you really helping a lot of people rn you’re a blessing", "sharon.mccue": "🙏❤️", "e_hughes_poetry": "I'm so scared to do these, of potentially finding something.", "mariadizzia": "Thank you 💕", "aroseasis": "May I please share this on my story?", "alex.haller": "I needed this reminder. Doing mine today!!!", "strongwithcyd": "🙏🏽🙏🏽🙏🏽🙌🏽❤️", "jeniaron": "You help us so much every day. Thank you for being wonderful. ❤️", "withlovefromciara": "Thanks for the tip about feeling the surface rather than the deep tissue!! I often press hard and feel lumpy tissue and don't know if it's healthy or not. Blessings ❤️❤️❤️", "slugsville": "do you know anything about doing breast exams after having top surgery?", "maddicakes510": "Thanks!", "emmawondra": "❤️❤️❤️", "emiwee707": "Thanks for this!", "courtneykaayk": "Thanks for sharing! Was checking along with you 🙏", "cueenkotton": "You eat a my job alot(ruedix)🍃🖤", "bandnamecallit": "Thank you! I had no idea it was better to focus on the surface, this changes my whole way of examination 😅", "amx899": "@princess.sparkle428 I love this 💕", "projecthealthybody_": "Thank you!🙏", "colelovitt": "I also discovered a cancerous tumor when I was 28 by doing self exams. Thanks for posting this ❤️", "agalnameddanielle": "Very helpful! Also fun to have a partner “help” and turn it into something sexy and nice to have a second set of eyes on the lookout.", "trystennjames": "Really important as a transmasculine person that I saw this video when I did. Thank you Ericka for everything you bring to this world!", "mirz112": "This is so helpful. I always feel like I'm doing it wrong", "lafioux": "Thank you, you amazing amazing human!", "fern_elsi": "this is really helpful that you!!!", "taraamackey\nVerified": "Verified", "kathleencollins": "💕💕", "amyjaybirds": "This is the most useful video on the internet and it's only allowed by Instagram because of your surgery scars which is just ridiculous", "thejasminebperspective": "My doctor encouraged my mom and I to stop doing them as long as we got mammograms. This video makes me want to ignore that advice though lol. I’ll be watching this again!", "plexi.glasso": "is there a recommended time in one's cycle that is best to do a self exam? I've heard right before your period, right after, idk if it even matters🥵😅", "montanocrochet": "Yasss! We need more of this! Love you and your beautiful soul.", "aprilmeijoon": "Thank you for the reminder, it's been a while since I did a self exam!", "trashbouquet": "I’ve never done a self exam and I just did one now. Thank u for this reminder!", "rachel63095": "I had no idea I was supposed to focus on the surface, thank you!", "aorists": "this is v v helpful and useful, thank you!!", "vaary.naice": "Thank you!!! This is so important!!!", "nsmith114": "At what age should you get your first mammogram?", "artreel_": "This post is everything 💫", "reesiss": "thank you so much for this ♥️", "emmatheawkward": "@ihartericka I've been checking my boobs since I was an early teen, I'm 39 now and only once have I found anything suspicious. Thankfully it was only mastitis, but it still scared the hell out of me! My mam on the other wasn't so lucky and after having a lumpectomy and radiation treatment, she was given the all clear. Unfortunately it came back and she passed away 6 weeks after diagnosis. She never had a lump this time and they actually treat her for gallstones before they did anything invasive. when they did it turns out that the cancer cells had spread over time to her gallbladder, liver, spine and pancreas. I'm not allowed HRT, as that's what they think caused my mam's BC in the first place! Ladies, men and all non binary folk, check, check and check again! Know and listen to your body and don't be scared to go to the doctors about anything, just go to put your mind at rest!! @ihartericka, I love your feed, I'm sorry I've waffled on! Big love to you xxx", "_oliveia": "Omg ive never seen the proper technique to do a self exam and am so glad i saw this? !!", "glitterandhotsauce": "Thank you!! I never could figure out how to check myself I always ask my gyno to do it, but I will start doing it myself more often now.", "fern.oxley": "Thank you 🙏", "karenn.priscilla": "Thank you Queen🙏🙏🙏🙏", "schneckertins": "Thank you for the reminder! We need youuuuu. Thank you for what you do ❤️❤️❤️", "loveytheawakenedarcher": "@ihartericka Thank you for always educating & enlightening us 🤗🖤✊🏽", "aude.blueberrydany": "💖💖💖🌞", "nblvblbavery": "REALEST HOT GIRL S***!!!!", "bad_botanista": "never had self-exam advice turn me on so much! 😂 is that really all there is to it? I’m prettttty high risk and 33yo; it’s about time I learn how. @ihartericka do we really not need to worry about the deep tissue? Ive usually hated that but I thought that was where things usually start... 🤔 so we’re only looking for very superficial lumps? Also you’re my idol 😆", "jessieraemonclaart": "This is so helpful thank you!!! I have teeny tiny boobs but I feel like I've been doing it wrong my whole life because no one ever showed me what to do", "quartdrew": "Thank you 💖 It’s crazy that I’ve only ever been told how to do a breast exam but never actually SEEN how to do it", "sophie_hines": "SAVING THE WORLD BY EDUCATING WOMXN + FOLX", "dominantmammy": "Thank you!! 🖤", "m.trouvaille": "Yes! And after your period (If you get one) so you can really get a deep feel past the swelling period.", "killerhoneybees": "Thank you! I always thought I had to do it lying down; but it felt so unnatural and I often palpated too deeply. In the shower is so much easier for me!", "yung_clitoris_": "Thank you!!", "mira.b___": "THIS IS SO HELPFUL OMG! \"focus on the surface\" no doctor has ever given me this advice and I have very fibrous breast tissue so I'm always feeling lumps and getting really scared. I'm also breast feeding which makes my breasts even more lumpy. I constantly freak myself out when examining my breast tissue, and I never knew that it was more of a surface lump that I should be looking for. Ive had my OB give me a breast exam in the past and they always just tell me \"you just have fibrous breasts\"... but that doesnt really help me know when it's an actual problem... Thank you for the explanation and your story. This could save someone's life!", "little_tranquility": "Thank you for this 💕💕💕", "malikabmke": "Did you have to have radiation?", "pualanastyle": "💯💯💯💯💯", "shaynejudge": "THIS IS SO VALUABLE!!!! Thank you for sharing this with us all and for demo-ing, this is seriously the best thing shared with the internet!!!! 💖💖", "dfordarkoa": "Thanks for this tutorial!", "lexy_off_hiatus": "💪🏿💪🏿💪🏿🙌🏿🙌🏿🙌🏿", "nina.daro": "This is so helpful!! Thank you!!", "howlandrose": "This is so good 💗👌💗", "rowena_kosher": "This is really helpful, thank you!", "angelley_bean": "Thank you for this! 💜", "elenacpotter": "This is wonderful info, and it also looks like it feels nice to do 😌✨💕", "sarahhaiderk": "Thank you so so much 💕", "jessie_gray": "Ah thank you for making this! I try to self exam but idk exactly how to do it. Once again you’re so wonderful for putting in the work for us 💕", "posefx.tea": "Oh that focus on the surface of the breast bit is tea! Thank you so much!!💕", "_run_fatgirl_run_": "This was the visual confirmation I needed that I haven't been doing this wrong the whole time. Props to society for making it weird. 😑", "salines_boutique_formentera": "Thank you!!!! ❤️", "hilarycs": "Thank you!!!❤️", "moreilley": "🗣 Break the internet!!!!", "em.er.jade": "This is so helpful and needed. I’ve literally never seen one done and I didn’t know how to do one. Thank you for this.", "sunny_sonja": "👑💯", "raddadissad667": "Wow i love you 😭💕💕", "chelle_1023": "This is a amazing! I have shared it with so many people so far. I think you’re so unapologetically you. It’s inspired. Thanks for sharing! 👑", "smashfinallydidit": "What did the lump feel like? Sometimes I wonder if I'm feeling \"something\" or just fatty tissue.", "kari_aist": "@emmma.ammme", "cynthiaerivo\nVerified": "Verified", "moonchild111__": "@ihartericka hi! Thank you for posting this. What do we look for.. Lumps.. And tenderness? I get tenderness in my armpits sometimes.. Though I think they're boils.. How do i distinguish between something serious and maybe a normal boil..", "big_dyke_enrgy": "So serious until the end 😂❤️❤️", "nicolevbenvenutti": "Thank you!! I’m never quite sure if I’m doing them right so seeing how to conduct one is a huge help!! ❤️", "beelovedacres": "💜💜💜💜", "nkeestyles": "Thank you Beautiful. I too found mine during a self exam. I appreciate your vulnerability 😍 many blessings to you", "elemenoopeee": "Thank you so much!!", "daredevilbean": "Phew ^^ thanks :3 Now I can exam myself well . I always freak out because I don’t know how to do it well .", "caimarison": "Oh, I didn't realize it was peripheral that you should be looking for - good to know!", "carlsbarkley27": "You make self exam more like a ritual of self love and preservation, and honestly this is how we should be taught to do this", "vntoniaa.aa": "😻😻😻", "ladywoody": "My mom celebrated 3 years breast cancer free last weekend! Thank you for this. EVERYONE should check their chest routinely.", "bhawksnipes": "❤️ Love youuu 😩", "emlyvvn": "Ooooh 😍You are beautiful", "theafroqueeen": "And this is why we STAN.", "morgan.morris._": "Thank you @ihartericka ! This education is so important. I will be following this from now on! Thanks for everything you do/share with the world. 💕😇", "emmatamlyn": "Thanks so much for this Ericka...it’s crazy that we’re all learning such a basic thing from Instagram. Can we share this?", "darlinllozano": "Thank you for the reminder & the education (as always!) ✨", "vesi_llc": "Thats not sexual at all my grand mother is a cancer survivor right now God bless all servicers you included", "shsush4177": "No one has ever told me to focus on the surface. Thank you for that information. I have often wondered how to differentiate between the naturally lumpy deep tissue and something that’s not supposed to be there.", "danydolllovesu": "Thank you for this 💕", "prncsslyssaart": "❤️thank u for this queen", "disabledmakers": "Do them every time I wash, my family has all had breast or ovarian cancer so I'm a bit paranoid", "laine032": "God Bless You. Thanks for demonstration on how to self check", "beezzzkneez": "Thank you. I get a text reminder every month but it’s always struck me how there is little guidance on this. Also loved your dance at the end, made me smile 💜", "tarynshultz": "@tmurphy133 ♥️ her. Love your titties so don’t forget to check! 😉", "iam.cierraurso": "Thank you for showing the technique you use! This is so important for people to do on a regular basis 🙌🙌", "mstiffanyrueshaun": "❤️ you!!!!!!", "mariastara": "Thank you!!! 💖", "bgolden22": "THANK YOU for this. I was laser focused on the technique in what you were doing and when you started dancing, I couldn’t help but smile so big and involuntary started dancing along haha I find so much value (and fun!) in following your account. 💛", "madape904": "That shit got me horny", "lbow15": "Literally saved and bookmarked this until I know I'm doing this right. Thank you 💕💕", "mahveda": "Thank you queen", "darcie_cd": "Thank you!! I’ve been attempting to self exam deep tissue which is super lumpy for me. This is soooo helpful!!", "somer.time": "I appreciate hearing that the deep tissue is sometimes lumpy! How much are self breast exams supposed to hurt? Sometimes parts of my breasts almost feel bruised. Is that just sensitivity or pushing too hard or a concern? Thank you for sharing this important habit!", "bean._": "This this this this this this this", "katienumi": "i thank the ancestors for them❣️ stay blessed", "nnekalynsey": "Thank you for sharing this !!! 💪🏾🙌🏾 Powerful 💓", "stephalopuff": "Thank you for showing a video of how to do a self-exam and giving the tip of focusing on the surface - I never understood how the hell I was supposed to decide what was a lump or what was regular breast tissue, since like you said, deep tissue is lumpy and bumpy by nature. 🤷 These are basic ass tools we should be learning in health class to save our own lives so thank you!", "chaninicholas\nVerified": "Verified", "ree1330": "Yess!! I have been doing mine since I was 17. Thank you @ihartericka for spreading the word!!", "_mackenziesullivan": "Would love if you could do this with us every month. I knownicouldnuse the reminder", "hannah_macintyre": "My grandma was diagnosed a few weeks ago so my family is making sure we’re doing self examinations and getting proper check ups", "discipline.ctrl": "I always though you should do it lying down, is sitting up ok?", "queendomcultivation": "You are a gem 💎 Thank you for this guidance and energy this morning! 💕", "msbalwaysluv": "🔥🔥Queen! The Real deal Queen!🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️ 2xSurvivor Here!!", "thesunmoves": "🙌🏽🙌🏽🙌🏽", "eve_wtw": "ur amazing", "zequeeirdo": "I checked myself with you like a mirror. Thank you❣️❣️", "lauren_omalley": "Thank you for the reminder and for the direction. No one has ever explained it to me this way... re the surface and not the deep tissue that tends to be lumpy. 💞", "patriciayanesweetbreads6": "Thanks for the reminder. Yes self exam 🌟 en la ducha o despues! Each month! 🌟", "reganmaria": "Thank you!! I do self exams weekly!!", "sgardnerstyle": "Yasssssss Ericka!!", "sweetpennymas": "🙏🏾", "sophiemck__": "Self-examining as I watch this. Thank you so much for such an important reminder 💕", "moosebuckets": "Suuuuuper important post. Thank you so much 🖤", "marcijnyc": "🖤", "flowerwolffmusic": "Ur existence is soo revolutionary ❤️🔥", "sarahewheelerr": "I LOVE YOU SO MUCH. Thank you for being incredible, always. 💕", "elisev510": "Takes shirt off and follows your video.🙌🏼", "brumble.bea": "Thank you so much it's the first time I see it \"for real\" and not in description or vague drawings. Well I've been shown by professionals too last time I did a check up (had a painful deep lump which actually is an \"extra\" mammal gland). I didn't know about the surface thing, will keep this in mind ! 👌", "leen_witit": "YES THANK YOU FOR THIS.", "jo_cherry_b": "Thank you for sharing how to do this", "cycleseeds": "So touching!!!!!💗Thank you for sharing. Also I wondered..have you ever received lymphatic drainage after surgery? (Please also tell me if this question is too personal✨)", "lenoraderoypaul": "Thank you", "kat.reb.dot": "Thank you so much for the video tutorial and the tip to only really feel the surface. I have tried to do self exams many times but when I feel the lumpy tissue I just assume I wouldn’t be able to tell it apart from an abnormal lump. Definitely checking today. Again thank you so so much.", "nancybartekian": "Thank you for this!", "jennabrig": "Yes it’s so damn important to do! Being aware of your body, my mom was misdiagnosed, but knew something was wrong and went again. She was only 34 when diagnosed with breast cancer. I’m always talking to my drs about it and advocating for myself. So true about the armpit so often over looked!", "wildenlondon": "You beautiful amazing person! Xx", "jreyrus": "This is so helpful. Thank you.", "deliabrown": "❣️❣️❣️", "chlopatra": "Are you looking for certain shapes if you have lumps when your doing a self exam?", "khysles": "Huh, I thought it had to be way more detailed than that. Thanks for doing this!", "hedonist_utilitarian": "Thank you for the reminder. I never do them but I did one while watching your video. You are a total rock star! 🌟", "insightandconnection": "Thank you this is really helpful!", "authenkitticity": "💕", "mamamakwa": "I 💜 that you use your nipple-less breasts to educate on this platform!! YAAAASSSSSS 👏🏾", "dariawashington__": "Queen!!!! 💕🔥", "holly.metcalf_": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "xoyourfriendmichelle": "I love you. Thank you for the reminder ❤️", "scuba_fly_chick": "This. Is. Amazing. Thanks for being awesome", "allneonlike_": "Thank you for clarifying about the focus on skin. I’ve always focused on the muscle and fat in my breasts, not the skin.", "nikkivpraze": "Thank you for the reminder! I’m always wondering if I’m doing it right, so this video is really helpful. ☺️", "fbrusoe": "@ihartericka what if your afraid or not comfortable checking?", "nadya426": "I've been telling OBGYNs since I was a teenager that I feel uncomfortable doing breast exams because the lumpy deep tissue doesn't feel good when I poke it and the lumpiness stresses me out. Not one of them ever told me this. Not one! Doing my self exam right now in front of my work laptop.", "venusmichele79": "Doing it with you. Thank you", "pasta__elf": "My mom found a lump in her armpit, it was late stage but she made it thru and is now 10 years in remission. Check armpits as well for sure. Thank you for this <3", "sanpellenegro": "your lil happy dance after made my heart happy 💕", "c0smicjacuzzi": "This is so wonderful, thank you!!!", "thejuliegillis": "I have done them, but my tissue is also dense. Going in for a second, diagnostic, mammogram today. Hoping for good things.", "proxima__": "Really appreciate the reminders and vid of how you check! The last OB/GYN I broke up with didnt perform exams nor did she demonstrate how I should after asking", "giiiotto": "Hey all 👋🏼 my mom was diagnosed with breast cancer at 34 and my doctor has advised that my sisters and I go for our first mammograms 10years before my moms diagnoses year so I should be going for one at 24 instead of the standard 25. I’m in Ireland and not sure if this is internationally recommended but just passing on what I was told!", "joynerbel": "Thank you for this 💕 I'm a part of a long line of women who have been diagnosed with breast cancer young so this is something I need to make a habit!", "brick_city_homeschool": "Get it. 💃🏾💃🏾💃🏾", "supermallano": "Thanks for sharing this useful information. I found mine 9 years ago exploring my breasts. I’m sure I’m alive because I told the doctor about the lump...It was bad...cancerous...don’t forget to exam you tits my friends!💜💜💜", "kennedy_is_a_sparrow": "Thank you so much for sharing your experiences and knowledge! You inspired me to make a post as well of a concern I had last year and what I learned about \"dense tissue\" and potential false signs as a result of tit torture. Thank you so much 💜", "mccleaniacs": "Yay! I did it with you, then dance party end, yesssss!!!!! ❤️", "plussizevintagemadame": "Fantastic post. And thank you for clarifying about the focus on the surface. 💜", "miguelmeloq": "❤️", "cassloop": "The dance at the end is 🍒 on top 😂 You're the best", "boiledweiners": "really here for how you examed yourself entirely on beat 🔥🙌🏾", "berriesup": "thanks for the reminder !!", "movedbythestars": "Needed this reminder 🙏", "dadsfave": "She kills it!!!!!!!🔥🔥🔥🌈🌈🌈", "marymcschultz": "This is both super empowering and informative!!! 👏😍🔥", "_emsudden": "@msanii_mhyanna", "where.theres.smoak": "You are such a good influence", "timiljones": "A vibe", "m_e_o_w_w_o_w": "Thank you darling for showing us the proper technique!", "therealsvetlana\nVerified": "Verified", "africabrooke": "Thank you so so soooooo much for this!!!💛💛💛💛💛💛", "laurazambora": "💗", "katiemfrench": "LOVE you and your spirit!! Thank you for reminding us how important it is to check ya self 🖤", "lilyazehner": "Thank you for the reminder and modeling! May I share?", "dolly21_": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "izzy_alba": "Wow this was so useful! Just great to see it pop up on my feed and be able to exam-along with you! 💕 Reminded me to do one for the first time in too long 🌻", "jaionthemoon": "this is great ah i've tried to do it before but had no idea what i was doing", "allthatisbraw": "Thank you for this 🙌", "eatdrinkfrolic": "Thank you for sharing this! 🙏🏾", "michet_model": "You really a ‘big ol freak’ for that 👏🏼💕 an important reminder!", "stasialoves": "Sending you sooooo much love for this!! Thank you for sharing. ❤️🧡💛💚💙💜✨🌈🌈✨", "zjlord": "Thank you for this", "_swagatha_christie_": "Thank you for this. I always wondered why my doctor was so delicate with exams while I was at home smashing my blobs, now I know why!", "shandiilyse": "This is so amazing to see and such a good reminder!!! 😍", "girouxmar": "Thank you🧡", "jessies_gal": "Thank You For Sharing & Showing !! #breastcancerawareness", "katieiskeen": "Thank you for posting this! I’ve never seen a video on how to do this only pictures that don’t make much sense. 🙏💕", "jduhloyz": "Thank you for spreading awareness! Self checks saved my aunt 💕", "_missrich_": "Thanks for actually showing us how to do it! I hate those diagrams with arrows pointing in the direction they WANT us to check in. 💕💕", "jennerosity604": "Thank you for the reminder and the video demonstration!!! This is great!", "inkindspace": "👏 The best!", "thejoyexpert": "Thank you so much for sharing your wisdom and experience! I’ve never seen a self-exam video.", "vaccacio": "Self examination is critical and most of us fluff it off. Had I not noticed, what I call a sensation in my left breast and underarm, I don’t know that I would still be here. May I share this post?", "iggyforanarchy": "Thank you for showing people how to do this! No one ever taught me how to examine myself so it’s very helpful! 💕", "alexnunnone": "Thank you for the reminder and explaining the best way to do this 💕", "duchessofwindermere": "I found a mass doing a self exam also, a doctor said they didn't feel it, 2 years later they saw it on a mammogram. Trust your instincts and always get a second opinion.", "raine__raine": "Thank u", "savageinnature": "You are so dope!! Thank you!🙌🏽❤️", "psalm45_1": "I love you! Thank you 🙏🏿", "http_katesweeney": "🔥🔥🔥📣", "cicicarruthers": "Thank you for doing this!", "lizard_found_joy": "Wow. Since 13. Thank you for this ❤️", "bonbonkati": "@tunnerintasi", "priyala11": "Thank you for sharing!!! I didn’t even realize that you aren’t supposed to focus much on the deep tissue. 🙌🏾🙌🏾🙌🏾", "birdgerhl_": "Thank you for the demo and reminder! 🖤", "wildcaprisun": "I’ve been doing checks in the shower for the past two years but I purely don’t know what I’m supposed to be looking for", "mahoganygray": "Thank you so much for showing this. 💕🙏🏿", "angelica_j": "Thank you so much for sharing this !!!! The technique and just doing it !!", "holcwil": "And a reminder for people with breast/chest tissue:🔻 IT'S NOT JUST LUMPS 🔻. Any changes to your chest should be monitored! This includes (but not limited to); sores, redness, rash or itching, dimpling, discharge (from nipple/surrounding), inverted nipple and/or indentations ❤️", "waffle_pockets": "Thanks for the reminder, I did mine in the shower this am!! Is it ok to repost this?", "_itsellyyyyyyy_": "I loooove you so much—thank you for doing this! 🙏🏽💥💕", "ashmjong": "I've never seen a self examination done before, thank you! That was very informative. ❤️", "alejandra_leclerc": "❤️🌹👑", "jjcurls85": "Thank you for sharing this!!!!!!!", "cupcakenoire": "Thank you so much for this! Actually created a reminder in my calendar for the same day every month!", "stinkygravy": "What’s the best time in your cycle to do an exam?", "sarahdayarts": "thank you so much for this, i’ve been walking around for 10 years thinking i was doing this properly and it turns out...no, no i wasn’t 😬 thank you so much.", "moniqueruffin": "You’re so beautiful. Thank you", "karolscorner": "hi angel! ive had two breast surgeries and have a bit of nerve damage. do you also have that? i find that when doing breast exams it’s a bit painful so it’s hard to focus on what my fingers are feeling for you know? any tips?", "zoecorn": "Most cancer is found in the armpit area! Very important to check there at the very least!! Good tips", "ninashahin": "Thank you!!!", "beautynfeast": "Thank you for the example!", "blackwithplants": "I love you so much. 😍 Appreciate your truth telling.", "santxpapaya": "People say it’s like feeling for a marble among rice. Is this really a helpful tip?", "sadie_17_04": "@coppafeelpeople @mrsgifletcher", "aftenstierne": "❤️🙏❤️"}