{"david.slez": "Fuck you", "sammy_k112": "And you have a mental disorder you retard", "itsbrunosoares": "🤡", "wheckses": "Tf is this clown shit y'all really think you're enlightened 🤡🤣👌", "_.shayanmalik": "U lady, are fucking retarded", "irisishere88": "I say this respectfully, \"any gender\" that gets their period means: they were born biologically female. Never male. Period", "joshcamilo10": "So how do i get mine?", "williwong_ranch": "Some people sure are triggered in here. I could put this a lot of ways, but I'll just quote Live Science: \"there are not only females who are XX and males who are XY, but rather, there is a range of chromosome complements, hormone balances, and phenotypic variations that determine sex. It is important to remember that sex and gender have two separate definitions and many cultures include more labels than simply male and female to identify others.\" News flash, sex chromosomes don't equal external genitals don't equal internal organs don't equal hormones AND NONE OF THOSE EQUAL YOUR GENDER. If you have XY chromosomes (male 🧐) a uterus/vaginal opening (female? 🤔) and an ambiguous looking urethral orifice (femamamalefem...🤯) then explain to me again how any one can say only women menstruate 💀", "kidkutty44": "Also, any gender can become a squirrel", "lilsleepysusboi": "ok retard", "claire_sophia1": "People think that they mean that people with a penis can get their period but I think they mean that people with a vagina who don’t identify as female can also get their periods (I.e. trans men, non binary people, etc) I may be wrong but that’s my perception of it", "ourland_ourplan": "Bitch are you retarded?", "morgan_grabinger": "Gender is not in your brain, the sexual organs and parts between your legs tells you whether you're male or female, how is that hard to understand?😕", "jed.shafer": "How dumb can u be🤔. Might want to rethink that dumbass", "kingstonclassic": "Whew chile. Yeah, I’m on the wrong part of the internet again", "leo_the_lionheart24": "@arijet read these ignorant comments. If only these transphobes knew what our students already know about the world of gender and assigned sex spectrums 💅🏼🤗✨🔥", "chicken333.222": "Do you know how dumb this is? Women can’t feel like women now, it’s only females who get periods", "puddytootz": "Only a female can get a period. Males with fake boobs and fake vaginas cannot. It’s the shedding of the lining of the uterus, soooo go back to school and stop being stupid.", "sincitypresa": "I didn’t know this many delusional people existed 😂😂😂😂 .. the best is the ones that think a man can get pregnant as long as he was born a women 😂😂😂😂😂😂", "730ant": "@ihartericka you’re a different kind of special 😂🤦🏽‍♂️", "blackqueen_cleopatra": "THIS IS NOT TRUE!! Why are women making exceptions for the Trans community?! A biologically born women will get her period and her identifying has the opposite sex does not change that. A man identifying as a women does not mean he is going to start menstruating from his penis. What the fuck is going on here?!", "caila._rose._": "🤦🏼‍♀️ only females get periods", "wolfpack_ironsquig": "@peppermintju @cbrjunkie @love_mimi55 WHAT THE FLYING FUCK?! Ericka you are one stupid ass to get a period first you must have a reproductive system.......🤦🏽‍♂️WHERE....WHERE!!!! An OVARY can produce an egg 🥚 *ding ding ding ding!!!! You Psycho", "theoretically_human": "@ihartericka post all genders can get periods. You all: sending transphobic dm’s and comments. PG&E announcing they are taking off Venus symbol to be more inclusive. You all in the comments, dm’s, emails and hand written letters to their headquarters: tears of joy and praise.", "maryammarie456": "Just because a woman calls herself a man doesn’t make it true. It’s still a woman this far the reason a menstrual cycle exist in their bodies. XX chromosomes have menstrual cycles and XY chromosomes do night. If your birth certificate says female without any Issues with your reproductive systems, u have periods, if your birth certificate specifies you as male then no you won’t have periods. Stop making shit like this okay.", "silverjaii": "It’s not just women who bleed or can reproduce 🤷🏻‍♀️ from what y’all transphobics are saying, if a women doesn’t have her period, she’s not a woman. That’s not true. And even though we’re discussing gender over sex, intersex people can also bleed! Anyone with a female reproductive system can bleed and have kids, no matter how they choose to express themselves. Men, women, nonbinary folks and everyone in between has the right to a safe period and safe birth!", "samalphin_": "shut the fuck up", "avigreenwald": "Ur wrong sorry😕", "amandaisyourqueen": "Incorrect", "niecyneysmith": "You guys are dumb", "kimberericaj": "Some of the comments on here are truly awful and so many people completely misunderstanding the post. And also not all women have periods!", "joshdunf0rd": "No", "tcr80": "@ihartericka News Flash! You are Wrong!!!! You are a Idiot! We don’t live in fairytale land! Just because you say something, it doesn’t become true! Only WOMEN born with a Vagina and FEMALE reproductive organs can have a period. It is a FACT!", "clarkman44": "You dumb as hell", "brad_mccool": "It says you're a sex educator in your bio. Thats sorta scary", "mattpjames88": "I'm honestly confused as fuck. Can some1 please explain. Wether or not we label man or woman, x or y, boy or girl, male and female, 1 & 2, up or down, yes or no or left & right only 1 type of human can get there periods right? So what should we call that type of human then????? Because I'm lost. Because the human who can get their periods is different to a person who can't. The person who can get pregnant is different to the person who cant. The 'word' gender is technically in our brain as you mentioned as we had to have a word that categorised those who do and do not get their periods or reproduce. Think of the word 'human' is the category term we use to differentiate humans from Animals or plants 'gender' is the term we use to differentiate the 2 types of humans male or females (there are only 2 types of humans which include the shedding of your lining because 1 can and 1 can not). At the end of the day you can't put feathers on a dog and call it a chicken. They will always be different. To think going under the knife to add or remove something changes what type of 'human' you are is nonsense. Identify as you will but you can only ever be 1 or the other. So on the tampon packet instead of male or female lets put \"does\" because lets be honest one does and does not need it. Let's change mr and Mrs to can and can't. Because 1 can reproduce and one can't. We need labels or everything has no meaning and will be called nothing", "william_watler": "Im a 14 year old boy and i had my first period yesterday! Trump is a fraud! I like joe biden!", "lockwood.chase": "50% correct", "_cella._": "Delusion makes the truth a lie and a lie the truth", "mashondatifrere\nVerified": "Verified", "mini_grant_1015": "ANY GENDER CAN GET A PROPER EDUCATION TO PREVENT FROM SAYING DUMB SHIT LIKE THIS", "bminormusiq": "Wtf is this bullshit.😂", "____butterpecan": "You’re a fucking idiot.", "q_3344_": "You get your period because of your sex. Not your gender. You fuckin lunatics. @ihartericka", "nickbrown712": "What if the gender I choose is male?", "anthony_novach": "🤣🤣🤣", "stacy_sass_": "I just found the stupidest insta post ever ! #stupid", "nicnac904": "How? Pls explain how a biological male had a menstural cycle.", "no_name_for_this_00": "What an uneducated idiot", "mz.imshadow": "If you are bleeding out of your dick that ain’t no period. That’s cancer. Get to the doctor not aisle 21 of Trader Joe’s you lunatic", "mcdebida": "Correct. Gender is based on your chromosomes. Hope this helps.🙄", "anastasiaelizabeth_": "@brooke_jilaine lmao I can’t 😂😂😂", "dptrell": "@ihartericka that is the most uneducated, idiotic statement I have ever heard. You obviously failed your science classes or from the looks of it ditched them and threatened the teacher to pass you. Btw, study again why ONLY FEMALES have periods...very easy to understand. Penis or Vagina = He or She....DUMBASS!!!", "boycott_beyonce": "You might have cancer if you bleeding from your penis", "men_zo_knee15": "Nope", "thatdamnartpage": "You are a fucking moron. Never seen a man have a period. And yes if they had a penis at one point they are a man.", "sophizll": "Stop destroying my gender 😤😖", "alex45102": "Imagine being so stupid that you think someone’s feelings can defy basic biology", "gapkid_": "Your a fucking 🤡🤡🤡🤡🤡🤡🤡", "preston_herrington": "@henrywestfall correct", "cameron_simpsonn": "You are very confused 🤦🏿‍♂️", "joseph_stockman21": "Hey you should try reading a basic biology book", "chrisfromtha6": "There’s only 2 genders, and only one of those get periods", "bananerz420": "If this post makes you upset/uncomfortable ask yourself why you are so insecure in your own gender identity that the way someone else identifies bothers you? Why are you transphobic? Why do you defend the gender binary so much? What limitations have you set on your own life due to your insistence of trying to live within the gender you were assigned at birth?", "huntererickson93": "@borracha85 Read these comments.", "alondrahauser": "I feel like the trans community is taking things to far. I’ve respected you guys but now it’s getting out of hand. You can’t just fantasize about having a period a period. It went from wanting to use your gender bathroom to what are your “terms” now menstrual cycle ? It’s like you guys aren’t satisfied. Theirs bigger issues in the world than someone misgendering you or wanting a “period” all this money being raised by the community why can’t we do the same for children in the hospital or full the bus for students who can’t afford school lunches?", "maryjanek90": "🗣say it louder for the transphobic folks in back (and front)", "z1k01": "@ihartericka my brain gets period, I can’t find any tempon for bleeding on my frontal lobe, any suggestions as to where can u get them !", "poubelle_deprimee": "Yes but you need to be a biological female .", "pictureme__rollin": "No a man born a man cannot get theyre period 🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄🙄", "mommy2layla2018": "😂😂😂😂", "saffronelwilliams": "when your boyfriend, husband, father, brother whatever male in your life gets their period give me a shout, I’ll wait", "matsweeper": "🤦", "cerriann_t": "Umm, only females have a period. Fact.", "crispyangle": "Only people with XX chromosomes can get their period so only women can get their periods sorry to break it to you all", "ricci.sauce": "True 😄", "thegoofygoober01": "Only women get periods", "rock_n_roll_joker": "So how do you describe the different genitalia to someone if we cant say it's only female? I hate confusion.", "mm.dibble": "Only females get periods ✔", "byasofsky": "Kys🙄", "johnsmithington12": "This is some whack shit. You people need help 😂", "alece.jpg": "Cap", "brescullark\nVerified": "Verified", "breaamie": "God told me to just back away from this post 😭💀😂", "horsesaresquishy": "i would like to see it", "deanspence_": "No wonder aliens won't visit us, get a grip and grow up", "bishopsinegal": "Mental illness on display. #GetWellSoon", "bcturner27": "Are we talking about “periods” of hormonal/changes?", "chloegosling97": "I'm all for equality and that but this is stupid", "vpuggsy": "This is the most stupidest shit I've ever read in my life hahahaha bye", "freyamasonx": "Fuck yourself", "fordy6699": "Absolute fkin dogshit. People that talk and think the way you do will be the down fall of society. Be gay, be straight, be a fkin bumble bee, but my god talk fkin sense. Only biological females can have a period. That is that. When I bleed from my ass it’s cause I’ve wiped too hard on my piles. Not cause I’m menstruating. Anyone agreeing with this stupidity is deluded and completely unaware of reality. Tits, the lot of you just fkin tits. #science #humanbiology #talkfuckingsense", "ambrioo": "LOL nope sorry!! You need ovaries to experience that type of pain!", "canmax_auto": "Enough is ENOUGH with the BULLSHIT.. any GENDER DONT BLEED ONCE A MONTH. Only a WOMAN.. a natural born woman. Bleed once a month. I am not going along with this political correct shit. A MAN, TRAN CANNOT WILL NOT EVER, ever ever ever bleed. Unless they put catchup down there and it’s still want be blood.", "jengaknowsbest": "Ain’t nobody bout to play with y’all ppl😭🤦🏾‍♀️", "piarasharvey": "Fucking morons", "kennakristy": "I hate this woman lol she’s so stupid.", "leonzandi": "You’re a fucking idiot 🤦🏽‍♂️ Honestly, I’ve met some retards in my life but you take the cake mate. And yes, I said “retard” because you are acting like a fucking RETARD 👏🏼 I’m embarrassed to be on the same planet as some of you people SMH", "og_ashbash": "Just because you put on some heels and go to the doctor for some hormones doesn’t make you a woman. You are NOT a female and no I’m not a transphobic but It’s literally biology. Logic. Just because a female gets pregnant and calls herself a dude doesn’t mean “men” can give birth. Yall getting shit twisted around here. Most females were happy with having transgender people coming out but when they think they understand what REAL woman go through and cry around about pads and equality bullshit . Yall start to look really stupid. And another thing, gender is in yo head?????? That’s literally the most stupidest shit I’ve ever heard. Bitch, when I was a kiddo I thought I was a cat, ate my dinner on the floor and drank my water from bowls. So am I cat??. #hoesmad #staymad", "eliasmom10316": "Never knew a man who got their period.", "gjgjangus": "Ah, nothing says constructive discussion like someone deleting comments that respectfully disagree with your own opinion. Let me paraphrase: if you do not have a uterus, you will not get a period. A menstrual cycle is not a state of mind lol. It’s a physiological process that allows for pregnancy. And women with male sex organs will never have a menstrual cycle. Delete all you want, Ericka. But your post right here is simply non-sensical and not based in scientific reality.", "miss_britt._": "Nope. Not true. Only females can. Scientific facts! If you're a guy with a period, guess what... YOU'RE A GIRL...... Y'ALL ARE SICK!", "mikeradnor77": "Only biological females can get periods.", "psytech_f3": "This is the fucking dumbest post I have ever fucking seen. A woman and only a woman can get a fucking period.", "lemieuxbrandon": "Nah, you people are straight up dolts. A Very sick society of mental patients. 🤷‍♂️👌", "honeybeezzz25": "So you deleted my comments .....Mental illness!!!", "puppies_and_piercings": "Are you fucking serious man? Hope you don't get pregnant is all I'm sayin", "cleanandpress1": "Omg only women get a period...IT IS FACT. What the fuck is happening to this world. If you have ovaries then you get a period. If you have a penis then you don’t. Wake up", "kmdudich": "Imagine how much money you’d have to spend on tampons or pads if you ACTUALLY got your period!🤔", "loveofsyn": "You will always be my favorite page after this", "smiley_kimmy": "No offense if I see you with a tampon or a pad you're a women in my eyes . And that's my opinion the same way you guys have yours.", "raaaaacho": "Are you fucking stupid", "adrianatiffanyyy": "So because any gender can get their period the logo on “always “ has to be removed ? When realistically only a FEMALE bleeds once a month ? Yeah okay 🤷🏾‍♀️", "sambroughton83": "My willy is bleeding 🥺", "lobo.privvvvv": "Fuck up", "jack_golley": "Ummmm but I have a penis ?", "orlandolees_": "Only 2 genders 🤡🤡🤡🤡", "the.vegan.dietitian": "Cannot understand why anyone would object to this. Or even if you don't understand, why anyone would care so much to make a nasty comment.", "tickle_me_pink_bitch": "Oh, I get it! at first I was like what?so women who are now men so pretty much women can get pregnant (trans men) I mean😌", "jessieemariee_": "How???", "sir_awesome_215": "@bob_mitim", "infused_by_love": "You a bloody idiot!!!", "mikeriley_music": "😅", "kaylaween": "@catdaddyyee", "johnwong_8": "Any gender can get a fucking education to prevent your dumbass from saying things like this", "katherine_pn": "This caused such an outburst of ignorance and/or transphobia on Twitter....your statement is actually pretty damn simple and idk why people get so mad and stubborn about it.", "niks.08": "@ihartericka i noticed in your bio that u r an educator.... So can u plzzzz educate me as to how ANY GENDER CAN HAVE A PERIOD??? Cuz if this is the case biology classes have severely failed to teach appropriate facts... Since it is taught that only a FEMALE (by birth)can have a period #confused", "desertdaimond": "@a_musevintage", "clare_miklaunus": "Regardless of your gender, if you don’t shed endometrial or uterine lining, can you still have a period?", "emmaolswing": "@ihartericka you’re the best", "magamuttsmama": "I am super grateful to be educated on this subject. I'm learning and extremely grateful to all transgendered for being courageous enough to talk about this. It's how we all learn about each other and knowledge is never bad. Thank you for teaching me gender has nothing to do with the \"parts\" you were born with. ❤❤", "squidneyray": "Thank you for this!!! I remember sitting at a table with a group of cis people I had just come out to and saying every bathroom at a workplace should have tampons/pads available and someone straight up laughed and asked why a men’s restroom would need them and I was like 🙄😑", "bpd45": "Dumb", "thenamesmarissa_": "@chantalbarron I think you would really like this account", "sonny.2g": "Y’all some beyond retarded and sick people 🤣😂🤣🤣🤣🤣", "m.joy__": "Gender IS what's between your legs. You can be a woman and pretend you're a dude all you want but you're still a woman. All this gender warping bullshit is an agenda by the elite. They chemically alter our dna with vaccines and geoengineering, through our food and water supply. We are being engineered this way. Men can't get their periods, why, because they are men. Why are we pretending and fighting for this? We should be fighting against the elite who are doing this to the masses. Wake up. Get your mind right and where it needs to be.", "chaprho": "Holy hell I thought these comments were ignorant but the Twitter comments are so hateful and violent. What sad peopleI'm so sorry.", "lilcangs": "Disgusting", "seinmaestro": "Some explainnnn", "mayachatt": "@bush_productions @katinthefridge @cadallimore the sex educator I was telling yall about the other night xx", "natalie.shorr": "Someone want to explain?", "videla791204": "Spreading estupideces! Imbecile", "iamking_mummert": "Your a dumb human!💯 All jokes aside this is legitimately the stupidest thing I’ve ever heard makes no sense at all.", "nimbleonion": "Why are so many people bothered about other peoples genitals and reproductive systems? That's between them and their lovers. We dont owe anyone an explanation for being whomever we need to be.", "loveiscourt": "These comments are pure hell. @ihartericka I’m sorry your experiencing an extreme amount of foolishness under this post. My goodness.", "omgitsrachel": "Lol I wish mine would start already. I’ve had spiked hormones for like a week and a half now.", "_i0dx_": "I agree with the statement any gender can get their period because sex DOES NOT equal gender, however what individuals get their period IS determined by biology. It is a physical process is it not? Given I'm a cis-straight male and all, but I'd be incorrect in saying I'd ever have a period since I'm incapable. Correct?", "expressionsbyvidya": "Yessss❤", "agotavera": "Well I suppose not the cis males at least, and I wish they could understand the pain of period and the sudden change of hormones! Maybe they wouldn’t be such dicks to us after all if they did understand", "stormemw": "@jlow1839 😃", "howardrosie": "@blossombella", "zachdriver_": "There are 2 genders: male and female, anything else is a mental disorder", "celiac_and_salty": "AND ANY GENDER DESERVES SNACKS AND PEACE ON THEIR PERIOD", "craftyplantpeople": "💚💚💚", "kia__sophia": "❤️❤️❤️❤️❤️❤️", "katiepix40": "Stupid 😂", "leah_jr92": "@2dogz_elissa thank you! That makes a lot of sense. Reminds me of an article I read about how we view color varies a lot culture to culture.", "thalassa7s": "💜", "crunch.wrap.supreme": "i think they mean: anyone with a vagina/uterus could have a period 🤦🏻‍♀️", "peachzelf": "Cis people in the comments just make me sad :/ like bro I’m just trying to exist seriously please", "isabelle.c.roberge97": "Everybody experiences pms", "moonbeam_maddie_": "There are only two genders. SCIENTIFICALLY prove me wrong 👇🏼", "thestiproject": "👏👏👏", "scdline1991": "@ihartericka I'm so sorry that you are beyond ignorant but only females can get a period", "localhopeful": "Started my period on period day 🤷🏻‍♀️", "moonlexight": "I wanna see a man bleed and experience a real woman’s pain. Record please @pocketspetergriffin 😂😂😂😂😂😂😂😂😂😂😂 stupid asf", "brittthart": "Wow these comments 😓", "other_surrealities": "I have mine right now and am not female.", "xiumintty": "Correct🔥", "_danifree_": "*I’d", "mais_29": "Okay - y’all can have mine. Period. Sick of that shit anyway. The worst 5-6 days every fucking month.", "hijadecoca": "@mariel.tavariz fue el día de la menstruación en usa", "missfield999": "Gender is not sex!!! Separate things. Do some reading people. Any gender can have a period! 👏", "johny__lingo": "if the period were talking about is the one where u bleed from ur vagina, dont you need a vagina?", "know.your.cycle": "💯🖤🔥🌀", "maryweitzer": "Thisss🙌❤🔥", "bearpajamas": "And also on that topic: people of any gender can be period-less", "karen_michelle76": "Um...if you’ve never had to worry about what you are wearing because your 5 pounds heavier with water weight, cramping so hard you’re sweating and might bleed through your sanitary protection then fuck off. This is such horse shit.", "martha515": "Just another reason period supplies should be accessible (free!!)", "lilyahatcher": "@lizakennedysmith", "sammbamm09": "Who even wants a period lmao they’re the WORST.", "luminex2307": "So what's a period then?", "sid_from_above_1975": "This is hilarious (and v affirming) for my non-binary face to see first thing when I sign into Instagram cause mine started today", "skarnskas_wifeeyy": "Okay so I'm not talking talking shit. I'm just confused as too how this works?? What is your theory or evidence? I don't even know how to ask this without offending anyone 😮😉", "danger_bones": "It never fails does it? Ignorant folks who are in NO WAY educated about sexology, biology, physiology, psychiatry, etc. love to come on to an educated person page and dig their heels in about what they actually don't understand or made any attempt to learn. That's called stupidity. Stay ignorant if you don't understand or refuse to learn and take it else where. Some folks don't want to be stupid. 🤗", "bethserafina777": "🔥🔥🔥🔥", "landofinkandgraphite": "I see some of y'all are really letting the point of this one go right over your heads (and refusing to google the terms nonbinary and transgender,,,)", "bi__cyclist": "@periodmovement", "misterlucian": "It was the merciless gendering of periods that made me hate mine, not the physical experience!", "tazzylamb": "@piersmorgan", "m13ren12": "@lastdaughterofkrypton", "kieranblake": "Just telling my 4 y o that any gender can have a baby. He accepted it no question! #teachthemearly", "sophie.holt.90": "Just how fucking stupid are you that you can't understand basic science? Only people with uteruses can have periods. If you don't have a period then you're not blessed with the devil's waterfall. And constantly repeating yourself doesn't maks you right. It makes you sound stupid.", "cancer_dr": "What is the period? What is the oatjophysiology so we can be ok the same page !! What is gender ?? @ihartericka I want to learn from you that’s why I ask", "jess.whetsel": "👏👏👏👏👏👏👏", "jolinejolinejolinejoliiiiine": "Nation Period Day?!? How have I gone all my life not knowing such a day existed. Fucking beautiful and noted.", "darastarks": "This post comes just as my period tracker gives me the unwelcome reminder that my period is due in a day 😭", "judecwolf": "PERIOD(.)", "carrieshuffles": "Can I just tell you that my 4 year old who knows all her anatomical parts as well as periods was singing Lizzo’s “Tempo” today (clean) and said “___ it up to the tampon.” She’s adamant its tampon and I’m juuuuust gonna let it be. 🔥", "ayaxnjyhjtjx": "No bitch", "johnnysjoys": "Thank you for this post. Thank you for speaking up. I’m sorry too see so much ignorance and transphobia in comments. Some people would rather remain in their ignorant bubbles than exist respectfully with other humans, many of us who happen to be trans.", "bryandied": "your telling me i can bleed out of my penis😐", "deborahfinkle": "Dear Erika,I don't understand it but I'm here to listen and learn. Is there a place with further explanation?", "ihartericka\nVerified": "Verified", "nopeitsjustmax": "👏🏾", "migsmind": "Thank you for at least explaining to your followers 🙏 some other influencers seem to really struggle with that", "rileslovesyall": "💜💜💜💜💜💜 so true. some of these comments tho 🙃🙃🙃", "megakeen": "Any gender can get PMS 🙌🏽🙌🏽🙌🏽", "healingailinghearts": "🔥🌟❤️", "amaznnay": "Someone help a sister.", "mohawktheeducator": "True. But I wish I didn't lol.", "kel_lutt": "🙌🏼🙌🏼🙌🏼", "britneybarsalou_": "this is the stupidest i’ve ever read", "megnickmick": "@shethinx 👀", "lghtly_hmmrd": "I took up the suggestion to have pads and tampons visibly available in my bathroom. They're in a classy turquoise glass jar - please help yourself fellow bleeding humans.", "mfrenchbrown": "Yeap.", "jikes1975": "Yup 🙏🏽 and any gender can feel any way about this whole body having a period thing. I’m just saying feeling about one’s period are varied regardless of gender too. (I may be a person with feelings about my period. 😂)", "hisnameiskirk": "Hey Coty! @theoxfrd", "fasteddie118": "I get mine every two weeks", "accidentalstars": "💗", "therightcall_": "Moron", "olivia.gelsinon": "🙌💚 thank you all for this very brave conversation. It’s so informative and empowering 🌈", "marys_book_picks": "💖💖💖Love this! Thanks for posting! (And I'm totally shocked by all the horrible comments) we all have so much more work to keep doing.", "gofolkyourself": "Yes thank you I got mine today in celebration I guess", "ellecams": "How are so many people following this account and don’t know that gender does not equal sex? I’m a trans non binary person who was assigned female at birth. I still get my period, but I’m not a woman. I could potentially get pregnant, but I am not a woman. Telling someone their gender is nothing but transphobia.", "jasmine.a.a": "That means ANY GENDER CAN GET PREGNANT", "sugacake88": "Can someone explain to me how a cis man can have a period when they don't have a uterus? I am genuinely worried I missed someone...", "earthy_pleasures": "What about cis gender men who identify as men? When do they get their periods?? Asking for a friend... ok I'm asking for me.", "baxm1": "@s_kolesnikow 👏👏👏preach it", "gold_hanger": "Lol", "zee.grace": "Huh? 🤔", "grandpawrecksie": "Thank you!!!!! ❤️💯❤️💯❤️", "christyinclt": "Also, periods suck sometimes.", "tvancort": "SERIOUSLY", "amenakaya": "👏🏽", "alli_deer": "I keep wanting to take a Sharpie to public bathrooms that have signs that refer to “feminine products.”", "the_original_dolo": "@ihartericka I get what you saying but not alot of ppl at first gonna catch on to what you mean. I was in my room for like 20 mins like \" I haven't had my period since puberty, my body broken\" then realized what you meant 😂", "sociallyconsciousstrega": "SO sick of all the well-meaning people who only try to empower WOMEN to embrace and destigmatize their periods. Not all women have periods, not all people with periods are women. Period! Thank you so much for emphasizing this.", "hellogoogy": "Well THIS nb body certainly chose to celebrate in full force 😂", "svssy_": "Lucy you got some splaining to do. Wht men are having periods and if they are can they having babies too?", "brittanysiewertt": "@jaymesiewert 😑😑", "_jae.3": "This off topic had a dream with you telling me about wanting to start a family with your partner.. you asked for advice & in the dream you guys wanted at least 4 kids", "sarah.epperson": "💯 💯💯", "theykeepbees": "Oh shit I got my period today.", "ignantintellectual": "Whew Chile cause mine is HERE!!! My God tuhdae.", "hippyheartgypsysoul": "Been flowing for three weeks", "cyclesjournal": "🙌🏽🙌🏽 yes!! 🌹🌹❤️", "livedexperiencecounsellor": "Yessss 👏🏻👏🏻👏🏻", "brinley4u": "👏🏻", "annabelleiwu": "Wait how? Sincere question here please!", "erosbespammin": "as a trans guy who’s on his period rn, this is so needed and people really forget this✨❤️", "smoothbutters": "How does that happen? Serious question", "sefiasco": "There was a company that was making pads & tampons for people that wouldn't trigger dysphoria, forgot the name but v cool"}