{"chicago_peanuts": "I wanted to ask you if I can share this video?! This is amazing, so many people need to start examining themselves!💚", "lolahaeven": "HOD Is Great 🙏🏾🙏🏾", "isarosenbloom": "You are freaking amazing! 💖", "kmdudich": "Your mom would smack the shit out of you, cuz", "_megan_yes_that_one": "Thank you, this is the best video on self exam I’ve ever seen. The pamphlets could never explain what you just did. Thank you,", "p2ina": "you are amazing 🙏🏼", "2sweaterpuppies": "@roudsarinotsorry", "mzlexi06": "Thank You for sharing, I'm literally sitting in bed mimicking your movements. My mom is a two year survivor she had a bilateral mastectomy and during everything I would send her your beautiful pictures to keep her spirits high. Thank You🖤.", "paigerien": "This is such a beautiful service - the video and caption. ❤️", "chicanlover": "@sibyllekian", "skinny_minny_87": "I am a breast cancer patient myself I am now a survivor", "doulaalexisyogimama": "Thank you for posting this @ihartericka I’m getting my first ever mammogram tomorrow-I was advised to do it over a year ago bc of a family history, but I’ve put it off bc I was breastfeeding. But I will admit your openness about your breast cancer experience inspires me to want to better prioritize my own healthcare. Thank you for sharing so much of yourself 💗", "sexeandorgasme": "Merci de me rappeler de le faire, et oui chaque mois je devrais le faire mais j’oublie alors que c’est tellement important bravo pour ce tuto magnifique", "zjlord": "Grateful for all the ways you both choose to show up.", "nighs_life": "😍💜💜💜💜", "lightwatt100": "Omg can I repost this? This is good you show your husband doing it with you", "alexandra.plans": "❤️❤️❤️", "thecornerhouseat2": "Thank you. Thank you.", "balanceandrootplacenta": "There is so much joy in this video I had to give my partner a big smooch and a hug when we watched it’s what we needed aside from the song of my dreams! 😍", "jbreezii": "An award", "mschief18th": "Thank you for this❤️", "sheis_dmadison": "Love this video! 🙌🏽🙌🏽🙌🏽", "missjellybean_1": "Hi quick question did you smoke or are ate edibles when you went through your treatment?", "tiquitita_amor": "Thank you👏🏼👏🏼👏🏼", "jessstitchedit": "Wow! Love the info. Thank you for this. ♥️♥️♥️", "shitthead": "Thank you for making this 💕", "survivormoda.rachel": "#3, #5 and #6!!!! 🙌🙌🙌", "shelleyrosebeauty": "@de3drabram", "rinnyrn": "Thank you for sharing this! ♥️", "lessx5": "If your a woman shouldn’t you be covering your tits up though? Or do u have to wait for the nipples and then you cover it?", "_.al3xis15": "this video everything 🖤", "yourivfsupport": "♥️♥️♥️", "_themoonproject_": "💗💗💗💗💗", "s_p_y_d_e_r": "Thank you both for this video!!!", "tiyashakrishnatrey": "Thank you so much for this video", "the.k.tribe": "😝", "life_undecorated": "Thanks you for this.❤️", "dspeaksleo": "Eb is a fool!! You supposed to be inspecting your breast!! Lmao!!", "bestofbothworldsdoula": "@ihartericka you are such a beautiful soul! Thank you so much for being so open and transparent about your life and journey. You are truly an inspiration! ❤️", "ile_materno": "👏🏾👏🏾👏🏾", "jehleejeh": "Your exams are so helpful in spreading the word! Thank you for being so transparent and honest about your experiences and the knowledge that come with that! ♥️", "yo_itsyaya": "💕💕💕 Thank you for this!! can i repost? @ihartericka", "savvychic101": "I love this", "the.adventure.folk": "Thank you so much for sharing yourself in the way that you do. Such bad ass babes 🧡🧡", "tranquilitybaseacu": "Thank you for sharing!!", "casia_sings": "❤️❤️", "gorditachingona": "Thank you for sharing this and reminding people to self-check. For years, my older half sister refused to do self-checks and visit a doctor. Fear kept her away. In her early 50s she was diagnosed with cancer and underwent a double mastectomy. Thankfully, she is alive and doing well. I can’t imagine what people with a family history or a diagnosis go through, but I know it is important to work through the fear and take care of yourself.", "a.ship.of.theseus": "@eat_drink_and_be_bekah ❤️", "_jenniferwinter": "❤️This! The part about advice on diets and treatments from the “I know someone that survived from doing *this everyday” people is a horrible problem. I am so glad someone said all of this. Until you are facing cancer, you have no clue ❤️", "peppertogether": "You are incredible! Thank you for the beautiful message and important reminder! 🔥❤️", "juanitavhb": "S T R O N G ❤️", "adam.sacko": "@jchanearts", "witchnails": "I've literally never seen this done, in person or in video. Thank you so much", "elle_sange": "G*d bless", "seejosiesmile": "So important! Thanks for sharing! 🖤", "freeworld30": "So informative. Thanks for this and song too❤️", "sietskedrijver": "Wauw!!", "asapphirewithsoul": "I'm ashamed to say that at 50 years old I've never once thought to check my neck when I check for lumps. I will now! Thank you! ❤", "peacefromnat": "@jessaguti", "_amy80": "❤️❤️❤️", "laursruth": "SO important! Thank you💗", "hollymatii": "What sorts of things are you looking for that are out of the ordinary, how do you know if something is ul?", "tarasitaguzman": "This is so well written and I really appreciate you making the note to people who might otherwise say something to fill the silence to feel better about themselves. Thank you", "paradisefitnesswithcarly": "Thank you for this 🙌🏼🙌🏼", "ashleyvix": "Looovvveee this!!! 🖤💫", "lvanna_mz_420": "@mariagdl", "angryblackwomom": "Hola! I am B. She/themme pronouns. I’m non-binary, queer, black & a solo parent - think single mom on steroids. 🙈⁣ ⁣ I’m a writer & scientist trying to find a way to be employed using my knowledge of the human body & society at large especially with regards to sexuality... aka a fancy way I’m saying- I’m talented & totally broke. ⁣ ⁣ The truth is I left blogging/writing 5 years ago to focus on my terrific three year old terror. Now I don’t know where I fit in this new realm because I prefer to use my words & wit than wrestle with a camera. C’est la vie. ⁣ ⁣ BUT I STAN YOU & EB, your work, your podcast, your plants, & your relentless pursuit of inciting important discussions on race, gender, & sexuality.", "dreamalittledream_ofme": "Thank you thank you thank you! As a fellow breast cancer survivor (not a fan of that term but I don’t know how else to refer to myself) I look up to you for articulating my experience so coherently.", "dynamicdiva85": "I was diagnosed earlier this year, and #3 & #9 are CONSTANTLY being told to me. This is why I hate sharing with people! Thank you for being so candid 🤗❤❤❤", "maceyybee": "as a brca 2 girl this is everything. thank you. 🙏🙏", "unluckee15": "Thank you- I been checking my breast incorrectly- I truly appreciate you", "shy_876": "💕💕💕", "sheilabobheila": "Thank you so much for this. I hope you don’t mind that I share it. 💛", "_87mt": "💙❤️💙❤️", "jell.belle": "Thanks for sharing this! I had my family doctor teach me how to check myself like 3 years ago but I def don't so it as often as I should. Thank you for the reminder and positivity! ♥️", "mercy_thee_toad": "I have quick question in relation to #3. If someone was to refer you to an article that was written by doctors and asked you to probly show your doctor that article, would be that rude?", "fmorrissette": "Thank you", "julialoggins": "🙏🏻💕❤️💜", "debbiebanjo": "@realasrey", "roseyjay17": "So why has the guy got his shirt on???", "elizchar": "@rukiyamichele", "hanbullivant": "Thank you.", "small_sustainable_steps": "Thank you 🙏🏼", "flow.days": "❤️❤️", "makeupongigi": "this is so important and nice of you to share. Thank u. Love u ❤️", "myebrittany": "Thank you for this visual! So, many resources say to look for this or that.. But your video (on 2 very different people) speaks 1 million words on how to actually do it. ❤️💜 Thank you again!", "kkakers78": "I appreciate you! I am currently having my last chemo treatment the I have to do radiation! Everyday has been an emotional roller coaster but I have made it through. Thank you for this!!", "naturallymylife": "So important to know and see, thank you for sharing!! 💕🤗", "kishasamone": "@itsashp follow", "kircur": "Self exams are not necessary and cause some of us with health anxiety extreme worry. My doctor has offered to take that responsibility for me and I gladly hand it off.", "muskokarach": "Thank-you! A great educational video on self breast/chest exam!", "tiffanystmi": "Thank you 😌", "spicybreads": "Omg you're BEAUTIFUL, magnificent, intelligent, amazing, and thank you for this post!!! I'm so glad I was shown you from @i_weigh ❤️👏👏👏👏👏", "fxrkry": "You’re so beautiful 🥺 Ik it has nothing to do with the post but I love seeing you laugh and smile 🥺🥺🥺", "wrex_n_effects": "THANK YOU! May I share?", "raquelle_b": "@jrvandasselaar check this out! probably some of her reasons for keeping it to herself", "yeahiknowwhatyoumeanbabe": "This is FAB😍😍😍😍😍😍😍😍", "lilmissylilmissy": "Thank you so so SO much for posting this! It is extremely helpful to SEE an example of how to do a self exam! 🙏🏻❤️ Much gratitude.", "rollinwiththehomies": "❤️❤️❤️❤️", "handmethatpencil": "😘 I would add that even the ‘winners’ of a battle with this shite disease lose so much... It’s not a competition against other illnesses, each story is heartbreaking 😞 Each. Story is someone’s life and reality... #survivingstrong", "elton_gomeszn": "@edna_fernanda_ @solly_.__", "krayons.n.tequila": "And I've made back to the top💙💙 love your beautiful journey 💙", "dadsfave": "I love you♥️", "hantron_fultron": "Thank you, thank you, thank you!", "captbecks": "Cc @linzobrownie @princessfiowner1 @dugondu @debbie_chokolate @chi_adore @queenomoye @omowinnie", "judyxycline": "Your such an inspiration, love you harrrd😘", "sass_____bebie_____": "@iamrandycarlie look", "nessa_ellen": "I love all of this advice. For me, I rarely ever self checked because I’d get skeeved out by doing it. I’m a cis gendered woman and I don’t have dysmorphia, but I am weirded out by innards so I never did it. Fast forward to 34 years old, I was nursing my youngest and had, what I assumed, was a persistent clogged duct and only that. Nope! LIME SIZED TUMOR!!! So I was dxed with metastatic breast cancer and at 37 I’m still going forward. I’ve had a double mastectomy with no reconstruction and TBH I think it’s not an option that’s pushed enough. Pain is lessened, healing time is lessened. It’s a really good option for those of us that don’t want to add extra, non essential, innards 😅", "rollinginreverse": "Where the nips go?? Tf 😂", "leyna_grace": "Thank you 🙏🙏🙏🙏🙏🙏", "keithallums": "😍beautiful ❤️❤️❤️", "alehstar": "Thank you for sharing", "adelaidelemonade": "I love Ebony’s face in the video! Also, thank you for 6, 8, 9, and 12. They really spoke to me about my experience with my mom going through it now for the second time ❤️", "1real__yugin": "Very sexy!!! Wow 😍😍😍😍", "djvlechtjuh": "I've never seen people check their neck too. Armpits yes, but neck not, how does that work? How do you check your neck? Cause your glands are there naturally so how do you feel for the difference between a lump, an overactive gland and just normal glands? Thank you so much for normalizing this and all your work! 💖", "itzpapalotl74": "Thank you for this @ihartericka seeing a self exam actually demonstrated is so helpful!!", "theinediblebrontenoelle": "I find it difficult to know since I've been breastfeeding two different babies over the past 3+ yrs. Everytime I check now I have little lumps and bumps and it's a bit unsettling. Because I didn't check before having babies I have no idea what is normal", "wellerjess": "Well said 👌", "omoh___tee": "God bless you❤️✨", "eekchilly": "❤️❤️❤️", "yoniijoao": "❤️❤️", "pammy_pureblack": "@outubrorosamz @andraa__massamba", "c_laice": "@isabelllaice", "chan7821": "I love you two. 😭😂😍❤️", "p_ahsinet": "This is so helpful!! Thank you 🙏🏾", "thenomadicpisces": "Incredible points", "kowalabearhugs": "🖤❤️", "dahlial": "Totally watched and followed along!! 🙏 Thank you", "emh2018": "Thank you for this beautiful video! It brought awareness to myself! 🌸💕 As I watched your video I also checked my breasts for lumps! Thank you for helping me be more aware! I’m proud that you can help bring awareness to other people about breast cancer. You’re a warrior!!! 💕🙌", "goldvn.king": "Much gratitude for teaching me how to check my breasts eye have always tried to check but didn’t know to. Quick question what am eye feeling for? Not sure if I’m feeling the sac that is my breast and just happens to be firm on parts of the inside or if they are Actual lumps", "guardian_vibe_angel": "Thank youuuuu", "thathippie_kitty": "Oh my gosh, Ebony 🤣🤣🤣", "culturecurves": "Now THIS is a PSA! I will have to start doing this for real.💞", "jorja.joycelyn": "what do the lumps feel like because boobs are naturally strange feeling", "clairewongy": "Thank you for posting this 💕😘", "deliabrown": "I can relate: #3 & #5 @jennycolen @power2theflower", "weeabiscuit": "I literally just copied y’all and checked myself... and then I danced, too. Lol", "mmarge3": "When you are moving your hands on your neck, are you checking your thyroid?", "kthekreative": "👏🏽👏🏽👏🏽👏🏽", "ace_mclovin_91": "Knowledge is power", "decepticat": "You're both the frickin' CUTEST", "lulu_prupru": "🙏🏼🙏🏼🙏🏼🦋💓", "stacyann_lawrence": "I love you both ❤❤", "chetneyscakes": "I stumbled upon your post by way of a rp & all I can say is thank you. I am literally in tears, as a “co-survivor” still assisting my mother thru her journey I have find out it harder to keep it together emotionally, especially this month. This journey isn’t for the faint at heart. You’re beautiful inside & out. Thank you for sharing 💕", "youbydrew": "I Love this!! This is Beautiful and you’re Beautiful 🙌🏽🙌🏽✨✨", "fitfatandallthat": "This I love... thank you for this", "leo_the_lionheart24": "Thank you so much for including the gender spectrum. I had breast cancer and I’m trans and nonbinary and just the gender shiat about killed me. I appreciate you sharing all these important reminders and thank you for doing so! 🤗🔥", "binetikuponyambele": "♥️♥️♥️🙌🏽🙌🏽🙌🏽🙌🏽", "tiffbrwneyez_bossfa": "❤️❤️", "coreen.cottam": "Great video and excellent advice. Thanks so much 👏👏👏", "hermajesty_thee_queen": "❤️❤️👏👏👏👏👏👏 thank you.. I never do this cuz I really didnt know how or that I should.", "built_2_survive": "Warrior 💪🏿👑", "renmercer": "For as long as I’ve been alive (30 years), no physician or OBGYN has ever taught or showed me how to examine myself, despite my family’s history of breast cancer. Thank you for these reminders, lessons, life saving advice.", "pearl_samoan": "I love you two!", "mamabird____": "Also along with #3, STFU about cancer patients who use their traditional medicines along with western medicines to help themselves heal. You don’t know how sacred and powerful our medicines are, and their body is not yours. We were scientists long before we were colonized.", "lcoxcreative": "After joining insta just over a year ago this is hands down the BEST video I have ever seen on here 👍👏❤️❤️❤️ well done and thank you x", "thelenarosebox": "Thank you! 💕I appreciate you both!", "heather.labrea": "Thank you for sharing this 😍", "wloski": "GURRRL 💪💪💪💪", "cherrypurlsmerry": "Self exam is how I found my cancer. It is essential!", "vikinglatina": "I don’t want to be rude but what happen to the nipples ?", "ambermeade": "Just saw this on @empoweredbirthproject such a great post end thank you so much for taking time to share it with us", "jamiimidwife": "💛💛💛", "popularhermit": "This video is so awesome. I hope it is ok to repost it. When I watched it, I started performing the exam with y’all. I have never done one,myself, before. Thank you", "radis_04": "💜 Merci 😍", "northwoods_hill_farmers": "I love you two. ♥️♥️", "ashinspires": "I love you two!! And hey Ebony!!", "beaditwearitloveit": "I would love to customize some healing crystal jewelry for you sis. 😍 @ihartericka please take a look at my page and dm me", "adjusting_my_focus_": "Thank you for this!! Sharing away right now!! 😘", "sacred_birthright": "❤️", "twotreesyogajen": "I LOVE YOU TWO", "pignolia": "❤️❤️❤️❤️❤️", "naiandersonbruno_": "@wyllmasantoss", "squishirus": "Thank you for this content. This is a reminder we all need. 💚", "afrikhana1996": "@xexalinda @afrotchily @tchily.ze @sheila_nangue @aoanisalvaterra @solange_ramos_ @curva_de_rio @bela_rosa04 @", "salynacole": "Love this! And thanks for the reminder bc I’m DEFINITELY missing some spots 😱", "lexiibelle36": "Your are Beautiful sis💯💯💯❤️", "glowconfidently": "Love This 💗", "jesskeepinitsimple": "This should be a commercial.", "smltown": "This is perfect! And the expressions on your faces....beautiful!", "kissmyglitz": "Much appreciated 💕", "pareishia_mytv26": "👏👏👏👏👏👏", "thesmartplan": "You. Are.Amazing!", "diandmas": "Y'all. ♡", "la.carranzista": "beautiful! 🖤🖤🖤", "fkawlo": "Thank you! This was so helpful. I realized that I have only ever read manuals on how to do a self exam or have only kinda sorta seen how my physician does my exams. It’s so helpful to see this actually done! It gives me a much better idea on how to actually perform a self exam❤️❤️ Thank you, thank you!!!", "samitotv": "Brilliant 🖤", "_newyearnewerii": "🙏🏽🙏🏽🙏🏽", "lovelyritah2": "❤️❤️❤️", "tauota20": "💪🏽💪🏽", "nathaliekalae": "🙏🏼🙏🏼🙏🏼", "mstootie08": "❤️❤️ I love this! Thanks for sharing!", "jupitersttal": "You two are just everything 😍😍", "ms_r_dvaark": "Thank you.", "jennabrig": "Sending you all the love thank you for making this amazing educational guide and video. My mom has been cancer free 20 years, yet still has complications from it and just had to have another surgery due to nerve pain and scar tissue. I wish people knew even though it’s cured the pain caused by cancer never really is.", "queenhandy": "Thank you for this post. I'm very guilty of referring to fatty chest tissue as \"breasts\" and this is a very appreciated reminder. The work you do is fantastic. Thank you.", "melodylarch": "@roseupassociation look this vidéo for cancer vidéo for 1er october #fuckcancer love 😍😍", "ambareeeee": "Love your video. Keep going strong. Thankyou💜", "dave.boredom": "@forrestluvsjeni", "marinaaasensio": "Ayyyyy love", "spygirl337": "Thank you", "eemiiiillyy": "Honestly have never seen a video or seen a demo on a real person and not a cartoon. I'm glad you made this, I now have an actual realistic understanding of how to check.... lol honestly I leaned my tablet against a wall and washed the vid a few times and followed along with y'all, and I finally think I know how to do it right. None of the \"instructions\" I've read ever mentioned the armpits or neck either. Thank you! ❤️❤️", "vicente_con_v_de_valiente": "You are wonderful. Thank you for those fun and educational videos.", "nurturingbirthandbeyond": "Beautiful and powerful and necessary ♥️", "amethyst_point": "I really appreciate you. I had multiple nodules that ended up being hyperplasia and took it out almost two months ago. I feel so much better and your story ran through my mind when I had the multiple biopsies then surgery. It gave me strength and courage to know all you’ve been through. Sending love ♥️", "yogawithamal": "Loooooove this", "buddhabrarian": "This is the best breast cancer awareness message EVER! As a survivor who experiences a lot of unsolicited advice/judgement, as well as a lot of fetishization/hero worship, I especially appreciate your naming those “don’ts.” 🙏🏻", "livingsavory": "Great message. Great video. Y’all totally rock! 💖💖", "s.hooshmand.m": "@azadehafifi 💖", "anjalii_sinhaa": "Thanks for this👏", "katieclausen.artist": "1. Allow cancer fighters and survivors to be who ever they wanna be. Don't allow your perception of what \"a person going thru this looks like\", fuck with OUR days. Some of us have hair, some of us don't. Some of us get chemo every week, some of us every month. Some of us have support, some of us don't. 2. Shut up about your aunt who had a mole that she thought was cancer for two weeks but it turned out okay. We don't care. 3. Fighters and survivors can do drugs, have sex, be angry, be kind, not want to talk about it, want to talk about it, smoke a pack a day, choose to have chemo, choose not too, it's none of your business. 4. Fault in Our Stars isn't real, cancer doesn't look like this. 5. If you only think about the treatment of cancer in westernised countries you are excluding the majority of cancer suffers. If you want to donate to a charity, donate to the individual like Ericka said, or find somewhere you could put money towards a new MRI machine etc. 6. Global cancer rates are based on statistics where everyone has access to screening and medical care. So they aren't true.", "waladshami": "Thank you 🔥🔥🔥💕", "misslebz89": "Thank u for this ❤️", "neshiaamoe": "@by_anymeans_bruh", "maryam._.sedaqat": "👌👌👌👌👌👌", "canyouseem3now": "Oh I didn't know you had to go up to your neck! Great information erika", "rv_clitterbeastculture": "Thank you!", "puneapuuu": "Thank you so much👌👌👌👌👌😘❤️❤️", "londiee": "@crazeejuju69", "ms.kay.k": "❤️", "jiji4u": "I just love you💖❤️💖❤️💖❤️ u r just gorgeous🌹🌹🌹🌹", "ddonaa": "❤️", "miarose428": "Yes yes to number 9! Thank you!", "wholestorygroup": "Ebonyyyyy 😭😭😂😂🙏🏽🙏🏽🔥🔥", "vancartier": "Thank you. ❤️", "carlislesl": "ALL OF THIS...for so many reasons..THANK YOU. 💗", "superdeluxemktg": "So helpful!", "nadougat": "@mamalolo_ @sandmug @clecle_uwin @minetteuzi", "k.joyz": "Can I ask about #5? I never felt like a hero or “so brave” but was put there by some for going through it. How is it ableist? Maybe that is why it bothered me.", "dannybruce_": "Is this process suppose to hurt so much all the time? Or am I just super tender?", "dania__may": "You’re truly an inspiration 🙌🏻❤️", "sagelyherbs": "In love with you both ❤️", "amycleanshouse": "♥️", "veenenaa": "Thank you sm for this ❣️", "instanena": "The most informative video and words I’ve ever seen on this topic.", "keshia_rae": "❤️❤️❤️❤️❤️ Facts! Especially #6!", "fosteringjourney": "Yasss!! Let's make these into post cards and mail them out ;)", "pinknacl": "It’s like a party you want to be part of", "danydolllovesu": "Thank you! 💕", "with_an_essss": "Pink Fund is a great charity to give to that does give to families dealing with a breast cancer diagnosis with day to day costs. And mostly run by volunteers. Just saying", "pazwarrior": "💓💃🏾", "iam.stevierose": "Thank you for being the embodiment of informative and adorable, that's all🌹", "brittanycocina": "💕", "algemmell": "I didn’t do anything heroic to survive cancer either, but I am a survivor. My co-survivor though.... he was... IS heroic for helping me get through.", "nurselola73": "🙌🏼", "critchcakes": "My great grandmother had breast cancer in her 40’s, she’s 94 now! Certainly not a death sentence.", "stalking.sarah": "For survivors still dealing with bills: @thesamfund gives grants/funds to help young adult survivors (up to age 40, I think!) move on with their lives. I’ve been involved with them for years — they are legit! They negotiate down back medical bills, pay the rent you got behind on when you couldn’t work, get you a gym membership so you can get strong again, etc!", "simonelovesfitness": "OMG Ebony reaction took me out 😩😩😂😂😂 I’m still not doing this. I don’t know why smh 🤦🏾‍♀️", "rasheedah.z.h": "♥️♥️", "exhibit_she": "💗", "stephanie_akf": "💕💕💕💕💕", "danaeinthecleve": "Thank you for these reminders", "days_of_dean": "More thorough instruction than I've ever received at the gyno; thanks!", "jaclyn_chung_": "✨💪🏼❤️💯", "oravafinka": "Last year I found out I’m brca2 inherited from my mom who had melanoma and bilateral breast cancer. There’s very few information abt what to do (I don’t want to take preventive chemoterapeutics neither preventive mastectomy) and I’ve been living in a deep despair ever since. It’s even worse with people around me not understanding or telling me I have nothing to worry about🤦🏼‍♀️", "pacificmidwiferypractice": "This is a wonderful video - thank you for sharing this!", "mothersisterfriend_doula": "❤️❤️❤️❤️", "darksideoftheboob": "Thank you!!!", "ritabcdefghijk": "❤️", "emilinaalbis": "🙌🏼 🙌🏼 Also, please don’t try to suggest that oncologists are in it purely for money, some are, but most aren’t. And pleeeaaase don’t talk about some random, bullshit research article you read on how chemo is really just a ploy to keep people sick and that “natural medicines” are just as effective.", "melissatmsw": "Thank you❤️", "fabab13": "Matthew Knowles just diagnosed with breast cancer!", "koolasjas": "Thanks for the reminder.", "grace_ewuraesi": "I just love this - it’s so instructional and fun! @disha_inspired", "the.sacred.self": "Thank you and sending you both so much love always 💕 this post is exuberant with both joy and information ✨ always in awe of you", "svssy_": "I’m crying thank you for sharing and you’re journey my aunt had a tough battle with breast cancer even had hers Brest removed and still died. I appreciate you for just giving hope. An optimistic light", "rocka_scott": "💕💕💕💕", "lrn2wardjustice": "Thank you! Will pay you some for this education once I'm working again!", "miamikris11": "💗", "jme_rae123": "This is 🔥🔥🔥🔥🔥", "hannah.stacks": "thank you for sharing 🙏🏼", "megawhaat": "Hi Ericka, do you have any suggestions for someone who is very uncomfortable with touching their own body?", "olsonila": "Thank you!", "ieobg": "Thank you for always sharing knowledge 🙏🏾", "charliewould": "This is amazing and so important! I’ve never used that technique to check myself, I’m going to from now on! Thank you ❤️", "sheila.c.brown.5": "❤️", "bkargb": "👏🏽👏🏽👏🏽👏🏽 thank you for this!", "crowns_areforme": "🙏🏻❤️", "curefoundation": "👏🏻👏🏻👏🏻", "teresabroxholm": "❤️❤️❤️ yesssss🙌", "__sandrine27": "❤️🙏❤️🙏", "simply.steph23": "I love this so much! Thank you for the reminder!!", "morning.panda.xo": "Thank you for posting this. My family have a history of breast cancer and I always worry about it. Doctors and schools don’t teach you how to do this properly and half the time I feel like I’m aimlessly prodding my boob in fear. Next time I check I’m going to make sure I have this video up to guide me. Thank you ❤️", "sky16th": "@yahlivermeire", "vermilion42": "All of these!!😁💖 Thank you! You're an inspiration to Me because you're such a dedicated educator, and it's kinda my thing too, I've just got to be a little less shy about this smart info and share it!", "callalilykisses": "This was so informative. THANKS LOVE! This will def be apart of our Annual Breast Cancer Awareness Brunch", "gaaabby_ruocco": "#12💫💫💫💫", "aimsify": "Love this and your energy♥️", "whenwildwomenrise": "👏👏👏👏👏💛💛💛💛💛", "afromermaid": "i saw what y’all were doing and immediately joined in! thanks for the reminder@❤️👏🏿", "carlitarobin": "October 🎗🎗", "jessanddogsandstuff": "Thank you so much for taking the time to share this and for your vulnerability. That is not as easy thing to do nor is it something you have to do, and the impact of your words and your sharing is so valuable and I am grateful for you. I just also have to mention how adorable Eb is in this. Come on! 🥰", "nova_on_site": "this is amazing. in so many ways. i cant begin to thank you both for the conversations and awareness you openly share.", "hubcap_molly": "💜💜💜💜", "wesmyersusa": "Kevin Hart’s teacher @rjsinko19", "jedonnemaperruque": "Thanks for your video 💓", "thespalon_ja": "Why did you examine your neck?", "faiche_stiabhna": "This is some of the most radical content out there. You both rock! Thank you for all your work!", "visjegerdien": "❤️❤️", "100pctmixedgirl": "💓", "fatfemme": "v important!!!! ❤️❤️❤️❤️❤️", "zoe_mariedavies": "🖤🖤", "thiskayjohn": "@capt_ioane 🖤", "manogliamarlowe": "Thank you so much for everything you do, despite the amount of emotional labor people I'm sure try to subject you to. As a large chested woman this has been my fear, nestling in the back of my head, so thank you for educating us.❤️", "kitkatkatalina": "Yessss 👏🏼👏🏼👏🏼👏🏼👏🏼", "yo.she.web": "Thank you for this!", "mom.bod.love": "Thank you for this! I fear self-checking so much and you just put Whitney to it and now I’m like, “I think I can, I think I can.” 😂❤️🙌🏼", "coachlatonya": "Love this. Thank you🙏🏾", "bookishbird": "This is adorable AND informative! 😍💕", "balletmeli": "Thank you best caption and post I read about breast cancer. ❤️ all of them especially 3 and 5 . Lastly, ❤️🎶 in the background .", "tdotrenae": "Loveeeeeee this 💕💕💕", "_helloangie_": "❤️❤️❤️ all of this! Thank you for posting ❤️❤️❤️", "hood_montessorian": "💛.", "classyallthewayjes": "Thanks for the imfo now I must do mines!❤️❤️", "just_mandyr": "Ebony is also checking his neck, and I haven’t seen this as part of a check before-is that a check of lymph nodes? Weird lumps? (Also, I’m having trouble finding his handle to actually tag him, sorry!)", "captiancommunism": "🙏🏾💙i love this", "jbaybay29": "Check in on people you know going thru cancer treatment. I’ve been disappointed with how many people close to me don’t check in with me at all.", "ishtastic_3": "🖤", "unhinged_salty_dame": "And please don’t tell us that there is a cure for cancer but there is a conspiracy etc etc and ‘they’ are hiding it because it makes more money to treat rather than cure. 😡. And don’t tell us breast cancer ‘is the best cancer to have’ !!", "shirleycurlyy": "No words needed! #killed 🔥🔥🔥", "ilovemandie": "Wow, I knew to check up in to the armpit but never though to check the glands in my neck, which seems so obvious.. thank you!", "aziveig": "Yo are perfect❤️", "katjuschka____": "and again saving lives❤️", "erinniscrazy4cats": "Loooove this!!! My partner, my best friend and my mother are all dealing with cancer. My best friend and partner are terminal. The emotional toll is extraordinary, and the loss that goes with a cancer diagnosis is unbelievable and not talked about. The magnitude is huge!!! Thank you for posting this and sharing your insights, I hope many listen and internalize. Sending you lots of love and healing energy ♥️💫💜", "milouvanduren": "@esmeevanduren", "abdell.013": "@anasszv wollah haar tepels zijn er afgeknepen gahahahagahagag", "carriejk1": "When I was diagnosed #3 got old real fast. I had quite the debate with my oncologist about #10 when she tried to dissuade me from considering having children b/c I could die someday 🤔🙄 Thank you for posting these reminders.", "emma_ash123": "I love this. I love this. I love this ❤️", "charlotfuckingwebster": "Thanks so much for doing a video, so much easier to understand than text or diagrams of how to check! 💕", "rosh_knee_": "Thank you 💜 #5 is very accurate", "daredevilbean": "....Holy fucks . 💀 IF I ever, I hope I wouldn’t but God knows, have cancer?? I hope it would be when I am not living with family anymore . ;-; I feel like I wouldn’t wanna tell anybody 😐🖕🏼Yes, Ik it’s harsh but I would rather NOT hear multiple more bullcrap I already get for having depression >.> Anyways that aside: this is such a GREAT!! ass helpful list!!! ^^ ❤️ My auntie from my dad’s side had breast cancer but luckily :D She had to get her breast removed . Well 1 of them ^^ .... ._. Before her, my grandpa (dad side again), he died from cancer in the intestine(?) I forgot which one tho. But app he had a year to live :|", "moneybagfiji": "Y’all are so cute", "classic_lola": "🖤 thank you", "niakirwin": "Found a lump yesterday and saw my doctor today today. She thinks it's benign but I'll be checked out at the hospital within 2 weeks hopefully. Thanks for your vids which reminded me to check 💕", "celestialwilkie": "such a cute and informational video ✨", "thecosycottageinn": "Just did my check along with you glorious humans! ❤️", "jrextaylor": "Thanks for the reminder to do this!!", "mckennah": "Great post! And EB at the end is hilarious. 😂", "lou1812ann": "BEAUTIFUL GIRL ❤️", "ajbuck94": "❤️❤️❤️❤️❤️❤️", "sustainablebk": "💯💯💯", "cuseanimalhaus": "Love you for this.💕💕💕💕", "freundeskreis_goods": "Number 12 ❤️", "kocomeow": "I love this! Thank you self checks are so important? For me, I had a lump scare and it turned out to be fibroadenoma. Checking literally is so important our bodies experience and go through transitions in ways we don’t always comprehend. Bless you", "brialleringer": "To number 2. What’s some specific gender inclusive language to use for breasts? I had a hard time finding results when researching", "_mackenziesullivan": "Any tips for saggy deflated breast feeding boobs?", "moule_t": "This is so important! Thank you! 💗", "hannahconda7": "Love that y’all included the neck/armpit area! Super important to feel out those zones as well!", "libbymarilyn": "I love this as a couples activity! Y'all are too cute.", "sunny_sonja": "👑👑", "seasloatphotography": "Thank you for this! Im currently practicing #6 by giving away a totally free self-love photoshoot to a survivor who could benefit by seeing their strongest most beautiful self captured in image form. If anyone is in LA and interested, check out my lasted post and DM me. Much love! 💕", "blackqueerpod": "Thank you for this! Also, y’all are so beautifully dope together 🖤🖤🖤", "vitalonga": "awesome 🖤🖤", "morganrtj": "Thank you for this. I know I've seen it before, but this reminder is heckin helpful 🧡💛", "simply_meesa": "Congrats on being a survivor!!!! You warmed my whole ❤️your energy is infectious 😍🌱", "balicerry": "I still feel afraid to do a self-exam because of the amount of breast tissue I have and my desire to avoid that part of my body altogether. When I had it done at planned parenthood it took the practitioner a very long time to do it because I have so much tissue. I hope that I can move past the shame", "katienumi": "❤️❣️👏🏾", "rubennatal.sanmiguel": "👏👏👏♥️", "theeggisyou": "Thank you for this 🙏🏾🙏🏾🙏🏾", "hunterexploring": "Much respect, Ericka. Thanks for sharing these reminders.", "shananegans10": "You’re awesome!", "carlotaaresus": "🥰🥰🥰🥰🥰🥰", "souzmister": "🙌🙌🙌🙌", "gucci.nut": "also can I just say, this might be a small issue, but when I see those posts that are like share/like if you care about cancer if you don’t do t then you don’t care and you’re heartless! like it upsets me a lot?? my mom had breast cancer and while she is completely clear and ok now, remembering the time and what she went through and how our lives all changed and everything makes me super upset and seeing those posts just reminds me of it and it’s like?,,, are you saying I didn’t care about my own mother because I don’t like your shitty performative post?? fuck you!!! and it,, idk idk it really upsets me sorry for ranting and word vomit hh", "cwat13": "I adore how ebony sticks his tongue out with his efforts! Thanks for posting this—i feel like i am not great at checking bc the doctor told me i have “lumpy breasts” so its hard to tell if anything is different. But i have a new doc and am going to ask her support in how to tell when one of my lumps is one to be concerned about. Thank you! Out here changing and saving lives left and right!", "1mrmr": "Tips #2, #3, #8 ✊😑", "syds808": "incredibly helpful!! thank u so much", "jessmonterde": "Thanks! Love u guys 🖤", "katiekasiawlod": "@matthunsworth fyi", "drjenpsych_": "I love you ❤️", "fluffmanor": "I love this video so much! The couple that checks together...has...sex...together? 😂😂😂 also the throat check is interesting to me is that part of it??", "dazethedays": "@melodymitchell", "mybodywpg": "Thank You so much for this!!🙌🏼❤️", "notyourgirl.andrea": "This is the best! You are the best! Eb is the best! Thank you for this. ❤️", "freckledcrafts": "Beautiful and informative 👏🙌", "cydface": "Great reminder to check, and thanks for the mindfulness/awareness you share. Especially #6 as I’m still learning how to best use my money to support people. 🙏🏾✨", "sus.salinas": "Thank you for all of these... Here’s another one, do not ever tell a cancer patient or their family that everyone has to die. We are not stupid, we are painfully aware, saying this doesn’t make it less painful or scary.", "thedogshouterer": "I have broken down crying in non-related appointments due to pure fear of outcome. 2) \"Being called inspirational robs me of any talent\" -Aimee Mullins I don't like being called inspirational. It happened to me, I had no choice and I have navigated as anyone in this situation would have to 3) I don't joke about my leg to make other people comfortable, I allow them to sit with their bias. I am funny as hell, but you take my lead. Not your clown 🤡 4) pleasure *is* healing", "warlenerene": "I love you both!!!! 💕💕", "gnagnuz": "Thank you 🙏", "africancreature\nVerified": "Verified", "ruthlesslove88": "#13: Cancer is synonymous with evil in the English language. It is not okay to ever suggest let alone think that someone who has cancer brought it upon themselves. We can educate ourselves about the nature of the disease and the ways that the medical industry continues to promote larger systems of oppression that affect our health on the daily.", "moonbeam113": "🔥🔥🔥", "rhiannonnewman": "My mom caught hers early because of a self exam!", "castaneda9618": "Love this❤️", "smokeyowl": "Hot ham love y’all for this and the reminder🙌🏾💪🏾🖤🖤🔥🔥🔥", "lion_hearted_lee": "Thank you for sharing your knowledge. I didn’t know men can also get breast cancer.", "dagpolido": "@bpolidoo", "_skiptomylu": "Thank you for this ❣️", "sacred_tx": "This is literally the BEST thing ever and I love you guys💓💓", "indira_layne": "All of this!! 🗣", "annaaugustefotos": "Love this", "iamsophie_marie": "Thank you for posting this. I have shared it and credited you.", "nordrenehenry": "I love this! ❤️🙏🏽🔥", "senoj29": "This is real talk! Thank you all for sharing your knowledge and experiences.", "mamaberr_": "When my mom was diagnosed/doing treatment she was always so angered by pink stuff - don’t buy your survivor friends pink survivor gear just because you think that’s appropriate.", "alexandra_mc88": "Does anyone know if the self check is affected if you have breast implants?", "im_liamsmom": "I love your transparency and definitely sharing and thanks a lot as a nurse this is one of the best feelings when my patients conquered this illness. Continue shining you helping all - Cancer or Not😘😘😘😘🥰🥰🥰🥰✔️", "slowypants38": "Thank you for this. And also for your words on how to support friends. And also for the rock out at the end. ❤️❤️", "smithpuerto": "@amandahagley 🙌🏻", "treefairfax": "✔️✔️✔️👏🏾thank you for these reminders!! 💛", "melikeydothechacha": "Thank you so much for this. My mom is getting a mastectomy as we speak and I am trying to remember to breathe and believe.", "inkindspace": "So agree @valeskapretelt they don’t and they need to know! @ihartericka all that you do is fantastic!", "rose_xxi": "Thank you from bringing attention to the ways people give .. these large companies like BMW raising awareness about breast cancer are also often the ones creating carcinogens which ultimately causes cancer. All the money fundraise goes towards cure and not prevention, capitalizing off of the illness. So yes, if someone wants to donate they should donate to a person who is battling cancer and not to some fruity fundraising event where survivors are expected to act happy and feel some sort of joy in having battled cancer when it’s one of the single most painful things someone can undergo.", "w3irdo_supreme": "❤️❤️❤️❤️❤️", "carriehoffmanjewelry": "YES to all of this!!", "cancerkitchenboss": "@spiteful_crow I had the same experience when diagnosed with breast cancer in March. It was overwhelming and I know people wanted to help but I really had to do my own research and come to decisions on my own. I’m sure dandelion is great but it’s not going to cure cancer on its own. LOL", "alongstory_short": "@rubmonkey", "valeskapretelt": "Thank you for this. People think they know but they have NO idea. 💜", "bikinipowerbottom": "Do you have any advice for PoC/fat patients being written off by their caregivers about breast/body lumps? They keep telling me I'm too young (26) to have it be something serious because young tissue is too.soft but one lump became 5 in only 6 months", "erickaeckles": "Thank you so much for doing this video and for those reminders ♥️♥️", "seeking.metanoia": "this is such an important post, thank you for taking the time to make it and share with us💕", "mermaidnataly": "Love this thank you for your perspective 🙏🙏🥰", "decobroad": "@empatts Great vid", "mkegrace": "Thank you!", "andbaxley": "I cannot pretend to speak about breast cancer specifically but having been a caretaker of someone with an incurable disease, it is so interesting that people react with cures and new articles about hopeful revelations. There is nothing hopeful about it and please accept the person who is going through it and the caretakers just where they are.", "saraagnzlz": "@alba.centellas", "celiac_and_salty": "Tiddy (not titty) is gender neutral in my opinion. Like boi not boy. Someone correct me if I'm wrong 😂", "nnekalynsey": "Thank you for #12 sometimes I feel like I’m drowning 💓", "mohawktheeducator": "I love everything about this post. I’m not sure if it would be appropriate to share my experience with breast cancer in my family, but a couple of points from your perspective seem to affirm some things that I think my aunt experienced.", "sarahlourdeslister": "@balister77 this reminds me of the pink bench. Much better support here than pink ribbons.", "microcosam": "👏🏼👏🏼👏🏼", "camerashymomma": "thank you! i was diagnosed with bone cancer three years ago and couldn’t agree more with number 3 (and 8! and 9!) thank you for being you.💪🏽", "janie.egan": "Thank you for # 9. Good reminder to keep my personal experience and loss out of the conversation. My loss does not mean that I understand another’s perspective.", "la_vie_toussa": "Thank you for this ❤️", "lollarossa": "Best Breast cancer awareness PSA ever?", "eatliftrunyoga": "I wish every essential oil MLM seller could see this. I've had 2 friends in recent years be diagnosed, and the amount of people sliding into comments, or DMs looking to sell products is so gross.", "lalalala_leslie": "What is some more inclusive terminology in place of 'breast? And thank you for your willingness to shine light where there is none.", "redlotus32": "Wow yes! 💕🙌🏾", "gilleonsmith": "✔️✔️✔️✔️✔️✔️✔️✔️✔️✔️❤️💯", "charlie.pt": "Thank you 💕", "jmariegray": "I feel like I should have known all of this but definitely don't practice it (even with my own mom, a survivor)....THIS IS IMPORTANT AND EDUCATIONAL AND TRUE ASF. As always, you're the best teacher in and out of the classroom", "inpacwetrust": "@_gasolean", "nasdalton": "#6 is so legit. A lot of people think they’re helping with large, nationally organized events, or wearing specific colors... a LOT of that money goes to corporate operations and paychecks. I’m not legally allowed to disclose the organization I worked with, but I felt like an asshole by association. Please! If you want to help, ASK a cancer SURVIVOR or someone who is ACTUALLY going through diagnosis, treatment and recovery, how you can help. Don’t blindly donate to an organization just because they’re big or have an iconic logo. Any organization that can fund a legal claim against “copyright” is maybe not being honest about their support of the cause they represent.", "chinyereezie": "Saw y’all at @joypartybk looking all cute. 🎉🎉", "kellie.schneider35": "Y’all rock ❤️👍🏻👏🏻👏🏻👍🏻💋💋thanks 🙏🏻", "_alenemarie": "My grandmother had breast cancer, she noticed a lump in her breast, went the doctor and they told her it was nothing and to come back in six months if it was still there. She came back six months with black liquid coming out of her nipple. Her entire breast was removed. My mom started getting yearly mammograms done as soon as she stopped breastfeeding at 31. Thank you for raising awareness of how to do self exams and thank you for talking specifically about corporations who profit off of this cancer.", "elct00": "Thanks for showing us how it's done... And I 💖 Whitney. When I was a child I paid $20 to be on the Whitney Houston platinum club card membership.", "beyoutiful_taylort": "Thank you so much! This is so important 🙏🏻", "bantufro": "Adorbs and necessary 💕", "dpbtrae1": "Omg 💜🙌🏾💪🏾! Thank you for this. All of this", "queen_v_phd": "I literally did my self-breast check with y’all just rn!!! I love this!!!", "lovetherainydays": "Chemo and varying treatments effect everyone differently. Some people hide it well, some take treatment harder than others. Please be kind, dont ask people when xyz of treatment is going to happen. Let them live without prodding questions.", "druscilla_foxglove": "Omg y’all are so cute", "moget": "Thank you.", "curvycoutureintimates": "Yes!! Thank you. Sharing now 🌸", "therealmamaboo": "I finally got my first mammogram !!!!", "e_lorena": "🙏🏽🙏🏽🙏🏽❤", "iskra\nVerified": "Verified", "_nelemoens_": "How wild is it that I’m learning on Instagram how to properly do a breast exam? I’ve literally never been shown or properly told how to actually do this. Thanks so much for sharing! It’s so valuable! ✨ Also: you and your partner are cute AF 🌹hahah! They shine ✨", "amy.happer": "Gracias ❤️", "iolanthe_odile": "#3 ! after my dad died of cancer I had a woman stay as a guest in my house telling me how her father in law ate a diet of strawberries and other bullshit and lived another 5 years. 🙄 too much to say to the carer after they’ve just lost a parent", "stefanibraiki": "thanks for sharing this!", "sierra_missed": "💚✨🙏 #retweet", "mel_mercouri": "👏🏾", "enchantedpsyche": "Thanks for the reminder😍", "taraviolet": "Thank you", "almaz_646": "حلوووة انتي 😍", "edwaujonte": "This boogie though!!!! Eb's face! Your joy! So many layers of lovinggggggggg 😍🖤💖👏🏾🥰", "omg_halley": "❤️Thank you!", "jymmi_helix": "Love this thank u", "creep_x": "thank u", "rossshon": "You are a blessing. Continue to inspire and educate the world. ✌🏾", "chocolatebarbri": "Whew chillay a word. And all Imma add is don’t ever come out your face about what a person does or does not eat as a factor in their cancer diagnosis. 🙄 someone said that to a very close friend and I almost pushed her ass down the stairs and beat her with her own kale.", "stephaniemackley": "I. Love. You. Two.", "shestrides": "Just had my mammogram today! Such a good thing ❤️", "alyssa_jeffers": "If you’re unsure of the slightest thing, check it out and ADVOCATE for yourself. I found something, they couldn’t see it on the ultrasound, and they assumed it was nothing serious and sent me on my way. I ignored them and went for a fine needle aspiration of a cyst, and now I have regular appointments with a surgeon to make sure nothing about it changes. Doctors make mistakes - know your body and speak up!!", "lauralushoc": "I’m going back for a second opinion on one of the lumps in my breast as it’s gotten bigger. Thanks as always for sharing, love you guys, always ✨✨😍✨✨", "queensheemee": "💚💚💚💚💚💚💚💚", "oatmilkmaiden_": "👏🏾👏🏾👏🏾👏🏾👏🏾", "kathleencollins": "Aside from this being an important tutorial, Eb’s face throughout it is the best. I don’t know how I got by before being introduced to the light you both bring to the world💕🐢", "ohmygodfrey\nVerified": "Verified", "whitneytheinvincible": "I would say do not give unsolicited advice about diets, treatment plans, etc to sick/disabled people in general... this seems to be such a huge problem for abled body people to refrain from with all kinds of diagnoses. If it’s not your body and/or no one asked you, SHUT UP.", "hollyjean914": "Thank you. 🙏🏼", "withanf": "Would you be comfortable sharing a longer video describing what you're doing/ what you're feeling for in your body? I've read a lot of pamphlets but I still don't understand what I'm supposed to be looking for, what the potential red flags are, and what's considered \"normal.\"", "tanisalexis": "The two of you are some serious incredible magic. Thank you.", "o.a.cardoza": "As always, thank you so much!", "crashingfeministdisappointment": "Everything feels lumpy so I never know what I'm looking for.", "nicole__moses": "This is great. Best advice given", "peglartist": "Eb 😂😂😂😍", "la_vida_natalia": "❤️❤️ Thank you", "cassloop": "Looooveyoutwooo!! 🙌", "maddoxsmommie": "The two of you never fail to warm my heart. Thanks for the tutorial!", "itcatchesmyeye": "Thank you for this learning . I do checks but this is much more comprehensive plus need a bit more Whitney in my life 💜", "rhodielamour": "Thank you for sharing", "breezyblagg": "Thank you!", "jeniaron": "❤️", "secundrabeasley": "I went to IG stories today for this. My new 1st of the month routine. Thank you both very much!", "rochylinsta": "Thank you. 🙏🏽✨", "paige_love_i_am": "LOVE your words of wisdom❤️", "themidnightcat": "🧡", "sickamour": "Omg this is so fycking cute", "lagrossetoile": "I love you", "mirz112": "Eb's facial expressions are the best 😂", "mwrcollection": "🖤🖤🖤", "fluentinliving": "This is some quality content. We’ve got Whitney, we’ve got a cute couple, we’ve got preventative health, and we’ve got a message that involves some critical thinking skills.", "ms.lexiebaby": "Got mine checked today❤️ good health! #savethetatas", "jumaleta": "Thank you! 💞", "spiteful_crow_": "Thank you for including tip #3! When I was diagnosed with cancer last year it seemed like EVERYONE was suddenly an experience doctor offering \"cures\" and it drove me crazy", "beckycate": "How do we get this video in our education system? At no point in ANY of my health classes growing up did they teach us how to check for signs of breast cancer. This video and your explanation above is legitimately the most informative/educational piece I’ve ever seen on breast cancer awareness. Thank you thank you thank you 🙌.", "badnewzxscape": "I love this!!❤❤💯", "livie_dee": "❤️", "_bigmama_byrne": "This explanation is everything you just said is everything I’ve been feeling. Thank you for be so open & transparent through your journey- for all of us ♥️🔥", "muonja": "💪🏿💓", "honeydupain": "Thank you for posting this and I especially leaned on point 9 - thank you, thank you, thank you.", "venussduh": "Thank you! 💕", "xtinarose__": "Thanks for doing this. It’s helped me way more than any terribly drawn diagram ever has.", "sarah.e.bowles": "Yesss thank you so much for showing this and for the language you used to show it!", "mogetsmofit": "This post is very helpful, thank you!", "monicamonfre": "The part about not giving it to orgs hit me so hard. When my sister was diagnosed with stage 4 metastatic breast cancer a year ago people rushed to give money to her and her 4 young children (all under 10). A year later and she’s still fighting the fight with new spots appearing daily. But the offers to support financially have dried up. And it’s not just food. It’s gas’s to drive the 2-3 hours weekly for treatment. It’s the cost of child care. So much. And it’s the stories that I can’t take anymore. And the suggestion of what I should do at 42 and BRCA1. I know what the numbers say. But I don’t want another voice in my messages telling me that I need surgeries like yesterday. And the guilt I feel as the older sister who is presenting healthy. The fear I hold that every doctors appointment could tell me something else. A year ago your page was where I headed to for support and information. Thank you for always being a voice that allows for space to just be.", "croyster912": "Treat someone with cancer like a whole person. More than just their breasts are effected.", "manouschkagr": "💕", "blkncomely": "🙏🏾🙏🏾🙏🏾", "costcomascot": "THANK YOU", "meevans77": "All of this!! As a fellow survivor I plan to share this far & wide. Also- I can’t wait to see you in Minneapolis this weekend!!!", "bysarahmessina": "Thank you ❤️", "kitt.katt._": "I love how you guys are doing this together ❤️", "xtinesoscene": "💕 thank you for this necessary reminder !", "pansypxwer": "When it's a lump does it have to come out of the breast massively or can it be a small lump as well? I've tired checking for lumps before but I don't even know if I'm going it right and it trips me out feeling a little bump and not knowing if it's normal ....", "ez.radical": "I do this every time I take a shower thanks to you! ♥️♥️♥️", "chaoticrebxllion": "I love y’all so much. ❤️😩🙌🏾", "oldbloodjewelrywears": "Thank you 🖤", "annamae9513": "Thank You for #6 I have been preaching this for 20 years I’m a survivor 👏🏾👏🏾", "simplyzoubou": "Thanks for this!!! 😘", "etymologyjewelry": "Incredibly important reminders. Thank you for sharing ❤️", "theealchemist": "💕✨💕✨ thank you", "luvsmutts": "Thank you for sharing this super helpful info! 🙏🏼", "montanafosberg": "This is So Good, thank you!!!", "madape904": "😍YOU'RE FUCKING BEAUTIFUL 😍😍", "littlegem28": "Thank you 💪", "litty_mcc": "Love this!❤️", "jessi.so.messi": "@raising_roarks I thought you’d enjoy this 🤗", "angelley_bean": "Thank you so much.", "plantsarehealingme": "Thanks for this", "apeysays": "👏 👏 👏", "meobaaklini": "Thank you so much for this reminder", "cnbuzzbee": "All of this. Thank you. 😻", "millygrace96": "Thank you Ericka and Ebony 💜 ..from a party boob and bitch tit having person who screams about self exam to every person .period.check your chest and pits ...I had to go back and say umm I know you think this is nothing but this is something ...twice ...even with ovarian cancer detected at age 17 ..they looked at me like I was crazy at age 40 demanding a mammogram ..as always thank you both 💜", "drmontecalvo": "❤️❤️❤️❤️You are a treasure❤️❤️❤️", "missfield999": "This was so so choreographed, it was like an amazing self exam dance! Brilliant", "itsbrittles": "Ever since you posted your first video about how to self-exam, I’ve done it at least once a week in the shower and encouraged my family and friends to do the same. Thank you for the valuable information, as usual!!!", "sweetp0tat0thighs": "Thank you for showing this! I do not always trust the doctor to do it for me. At least now I can do it myself and still go to the doctor and feel ok.", "mahoganygray": "Thank you💕🙏🏿", "dani_d_anderson": "Yes! The commodification of breast cancer is real. Vet organizations you give to and also consider giving directly to survivor/thrivers Don’t forget about stage IV!!! Also, we need more trials and research specifically for women of color!", "leonne11_": "Reminder for folks that menstruate: self exams shouldn’t be done before menstruation when breast/chest tissue can be swollen and tender. When menstruation completes, go for it! 💜💜💜", "thecortez": "❤️❤️❤️❤️", "sharae.gibbs": "Beautifulll 😍", "brsuga": "💜💜💜💜💜", "ihartericka\nVerified": "Verified", "blackboikei": "Eb plays all day. Lol", "wildcaprisun": "Thank you 🙏", "rumpunch57": "😍", "doula.vanessa": "Love ❤️❤️❤️❤️", "420photographysa": "Awesome ladies 🔥🔥🔥🔥🔥", "carrieshuffles": "This is currently my 4 year olds favorite song. Granted, she asks for “Lucy Houston’s love me” song, but 😍😍😍", "sassyblackcat": "Thank you!!", "cocoahunni": "It looks like a game of breast check Simon says ❤️ this was incredibaly helpful thank you!", "the_unturnt_one": "Ebony’s expressions are perfect 😂💜😂", "fracus": "Thanks!", "lindseyhallwrites": "💛💛💛"}