{"bottle_blonde_salon": "Black trans woman suffering from lupus and cant work or afford groceries. Please help my brothers and sisters. Cashapp $tammy9991 venmo @Evaine-Greenberg-2", "blkbellbb": "Black, single, womyn, no work, can’t find work, living on bumfuckegypt @ malikahbriah", "ericadanielleallen": "Cash app $edaniella", "devin.lea": "I’m a black queer single mom. I work part time in a fast food place. My hours are cut in half and when I do go in, I have to take my daughter with me. I have no extra support. Thank you for helping us in need out. I hope this goes a long way for those who get lucky. Stay safe y’all 😭 @Devin-Johnson-198 is my Venmo", "emalinda_93": "Cashapp $highmimadre Venmo @highmimadre I am a worker-owner of a womyn and femme of color marijuana coop. All of our events have been postponed due to the crisis 🌱💚", "vishal_memories": "I don’t know if this is true but I wish it could help me I lost my dad through this covid and my mom is a diabetic and has heart problems . I am trying my best to help but can’t meet since my family are also struggling . Every little help would be a great something for us . I just create the PayPal account just for this I hope god will make you see my message so you can help us out .🙏🏼 . PayPal.Me/ShaktiTVM", "crystal_mandica": "I am a black, female business owner. My husband and I run a non-profit called The Amphibian Foundation. We educate children and adults as well as conduct research and conservation efforts to combat the global amphibian extinction crisis. Sadly, we have had to cancel all of our educational programs. Any help would be appreciated. Much thanks. PayPal.me/amphibians", "baconwrappedunicorns": "@baconwrappedunicorns Venmo:@Caitlin-Grace-7213 Cash app:$CaitlinGraceFeet", "ialek": "Venmo: ialek", "jorginha.m": "Needing some help here in South America 🙋🏿‍♀️ Currently Unemployed and struggling to keep things together. ➡️ Pay Pal: jorgia.macs@gmail.com", "dxntatguy": "paypal.me/guynoah 💙 queer nonbinary disabled black youth unemployed", "gore.hound": "Venmo: hanamose PayPal.me/sweatybritches@riseup.net", "lonnieisokay": "my partner and I both got laid off bc of covid-19—we work in the coffee industry, trying to make rent via art: Venmo: Yolanda-Whisman PayPal: lonniewhisman", "solangenaz": "@solangeaz on Venmo! Have lost abt 1/3 of income and could use a little support in the coming months, but am still in the privileged percent of folks who have some semblance of financial security", "wallahimhot": "🌻 Venmo: @wallahimhot", "dontlookatmegoose": "@lizzobeeating", "yung_scooby_g": "$yungscoobyG I'm guessing I'm too late 🤷🏾‍♂️🤷🏾‍♂️", "uma.goddess": "im a native american, two spirt, poc, drag performer and im UNEMPLOYED. Im also trying to pay my transition in these times of crisis. paypal: paypal.me/theartofsaru", "honey_spiffy": "$HanniyahC", "saphiasalahuddin": "I’m a working student-bartender in San Francisco. I’m now unemployed and my graduation has been postponed. Living in this expensive city ain’t easy and friend passed on this post. Peace and love. Venmo @Saphia-Salahuddin", "angryblackwomom": "Thank you for this.before #covid19, I was just about to start working, learning, & trying to build safe sex spaces for exploration & education at a local sex shop. Now I cant work or use my store discount. Only I can work at a sex shop, be celibate, & get screwed. 🙈", "notimeforkaren": "$imkaydot , paypal - karen@karenfrancois.com", "fiftyshadesofj_": "Literally displaced college student, which means I cant work at my on campus job. now I dont have a job so I dont know how tf I am going to afford anything. (Ik u said we don’t need a reason but I am just feeling stressed and felt like sharing) Sending love and manifesting better days for everyone affected 💛💛💛Cash App: $jdmmcneil Venmo: Jdmmcneil", "redlohh": "I’m a student that was working part time😔😔 I’m supposed to be paying off the dorms Venmo: @kyarajhh", "aziza_sikstar": "@sikstarart out of art shows for who knows how long. go check out my art. commissions welcome. @sikstarart. venmo : @sikstar cashapp $sikstar", "chilla_kills": "@milkandmelts", "milkandmelts": "Cashapp $Milkmelt or PLEASE support my natural skin care small business by shopping online. all sells are beneficial to our business at this time.. link in bio", "ladyblcberry": "$PositivelyNaily my job has cut back my hours and idk what to do", "styledbyjustine8": "Jdizzle88 ♥️ this is awesome!", "undertheoven": "$Iz2y", "navildacosta": "PayPal.me/zombiecoco", "moooo_ology": "Thank you so much cash app: $M0000nique", "soyhenrycervera": "@HenryCervera on Venmo. I am in NYC w/a compromised immune system and laid off from work.", "starringkourtneypaige": "@cashapp $Kourtneyym Appreciate you 💛", "coastlivewoke": "I'm an elementary school garden educator that supports my mom and my sister who are now both without employment Cashapp: $teiahhenry Venmo: teiahh", "ifemadzimoyo": "PayPal.me/ifemadzimoyo, CashApp: $IfetoSA", "morganlily": "venmo: morganlily cash app: $MorganMcGlothan 💞 the black owned coffee shop I work at is closed until futher notice!", "dusty_cloacas": "@animal_wes", "themrwolfgang": "Hi everyone! 24 y.o. queer black trans student with autoimmune disease (myasthenia gravis, rheumatoid arthritis) and it's been a hell of a year. It's taken me a long time to get diagnosed because I was neglected and now that I am I still have to wait months for a decision from disability. I've exhausted my savings and tax refund and have no money for meds, hormones, cell phone, and food. If you can help, I'd appreciate it tons - $MicahWolfgang is my cashapp. Stay safe everyone", "lifeasdariane": "$darianed", "coleszn_": "Cashapp: $ColeSZN21", "shinneytoe": "$Stoniburroughs", "serotoningallery": "$trysttrillest", "c22c88": "NYC BARTENDER - cash app $cri22", "madebykhari": "Cash app $kharijohnsonricks", "shalemar_1": "Cashapp: $ShalemarDavis Venmo: Shalemar-Davis PayPal: paypal.me/shalemard", "brimcdee": "Im a wedding photographer 💕 venmo: Bri-McDaniel-1 / cashapp: $Brimcdee", "wendylease": "@sirkeyes", "kasambasshots": "$sambama", "justcallmeolu": "$justcallmeolu", "omg_diaja__": "CashApp: $DollfaceDiaja Venmo:@Reese Paypal:Diaja.handbags@gmail.com", "midnightmagicinred": "I'm mixed/black, transmasc, and chronically disabled $MidnightMagicInRed", "foolmoons_": "$babefrombrooklyn", "sikstarart": "all of my shows in the next 3 months have been postponed and cancelled. stay tuned to my page and ill keep posting art available to ship. venmo @sikstar cashapp $sikstar PayPal same. thanks", "marialejandraospina": "PayPal.me/marialejandraospina colombian student stucked in Spain. Please any help is welcomed and needed🙏🏼", "naiyaonpointe": "Trulyyy appreciative cuz it’s a Blk queer gig economy health struggle rn. Cashapp: $NaiyaSL Venmo: @NaiyaSL ♥️", "kaylabayla_xo": "$bayla1234", "wayupgoodies": "Cashapp: $WayUpGoodies. No CBD/medicated goodie orders coming in but its understandable, its a luxury. Leaving your job to relocate to help a sick grandparent in another state is \"not a valid reason to quit your job and makes you ineligible for unemployment benefits\". Ived had interviews canceled and cant start my new job until I am fingerprinted and of course ALL of the locations are closed until further notice. 😑 Wife's new job start date was pushed back, also! We are also feeding a growing 13 year old whose mom received child tax credits for 😒. I know an explanation wasnt needed but I needed to vent a little. 😅..Sending light and love to all of you out there!!! 💚💚", "short.one1": "Good evening everyone. I don’t want to say too much because I know we all are in need. I’m a struggling student in Mississippi. Because of the corona virus, majority of our classes have been forced to resume online. I live with my younger sister and single mom. I am trying to help her with bills - with the amount of money I have saved - as well as pay the additional costs for the new software for my courses. I’m not sure where that leaves me on the spectrum of importance, but if anyone would like to help me pay towards my online fees and access to the internet since the surrounding buildings are closed due to quarantine, I would appreciate the help. My cashapp is $MonaeC98. No amount is too small. Thank you so much and God bless us all.", "begoodkarma": "@begoodkarma $begoodkarma", "aksfreestyles": "Cash app $lilsongbird100 💕✨", "positive.obsession": "Thank you so much for this!! Black Queer Here Venmo: @Devonnejackson", "krisnevaeh": "I’m a freelance photographer and creative director. These cancellations payed my rent and help out my parents which in turn makes them struggle now with all this going on. My day job also going to lay me off for April due to this and said their only keep “essential” staff until this all calms down.  Venmo: @krisntyler Cashapp: $krisnevaeh Photography ig: @kriscaptured Website:krisnevaeh.com", "bahbers": "@fashionboo $fashionboo", "littlenomadshop": "Venmo - Anthony_Bryant_ Business - littlenomadshop.com DJ - @ant_boogie_ Thank you so much! 🙏🏾", "dreyafrica": "God bless you❤️ Venmo: @dreyafrica Cashapp: $dreyafrica Oh & I’m a website creator if anyone is looking for one😊", "livlifenow": "I’ve never done this before but this is now the second time I’ve been laid off in three months 😔 cash app- $oliviarose Venmo- $OFranklin ❤️❤️❤️", "_oluwa.k": "Most of my shoots are cancelled because their studios are closing down. I am trying to be determined and purchase a camera to not let my creativity die in these times. $oluwak20 I would appreciate any help give 🙏🏾", "styleisstyle": "PayPal - lydia.okello@gmail.com", "swaveytoooowavey": "Cash app : kendriaswavey they close everything in Austin Texas", "_oroori_": "BLACK FAMILY EVICTED WITHOUT NOTICE ON FRIDAY, GIVEN 8 HRS TOMORROW TO MOVE OUT. Please read our story and share or give if you can.  bit.ly/BLACKFAMLIBERATE", "blkmoonlight": "Venom: @Alandria, Cashapp: $alandria09", "thegirlcalledmagdalen": "Venmo: Magdalen-Rath I am a student without family support and I lost my only source of income as a result of the virus.", "starrchildwild": "Venmo me, Amethyst Starr, gigging musician @Amethyst-Bickham Please and thanks you!", "cosmostokitchen": "Also find me @hibiscus__flower 🌊", "art_bynikki": "Cashapp: $NickeyiaJohnson / PayPal: jnickeyia@gmail.com", "poohbay": "Struggling single mom, recently lost my job. PayPal: graystastytreats@outlook.com", "mahaneela.jpg\nVerified": "Verified", "vibesnfries": "$beaberries", "jennelle_xoxo": "due to severe respiratory complications i’m a high risk queer woman who works at a fire-ems station. my venmo is @jennelle_xoxo 🏳️‍🌈", "ewuraesii": "Cashapp : $smerost", "tristaleebk": "Venmo @TristaLee", "distinctivebodystudio": "$adriennecope I got cancelled today!", "altair_arts_": "venmo: Altair-Universe paypal.me/altairU", "tripleshott": "Venmo: @niasadler", "ms_cinematic": "Thank you @ihartericka Freelance camera Operator/assistant PayPal: ms.srobins@gmail.com", "onomesmom": "CashApp: $iyaonome", "sinaemetry": "$atiyasinae", "_sexkiki": "$SKSTUDIOS", "a_mellow_world": "Cash App: $msrogers1", "mrsdhennin": "Long term substitute teacher. No classrooms = no pay. $MrsDhennin", "gavinodhiambo": "Hoooo are we lucky! I had a two-person Afro Scouse play cancelled here in Liverpool! PayPal.me/GavinodiVino thank you for doing this x", "queen_yacine": "$Yacine17 - cashapp @yacinen - Venmo thank you 🥺", "crystal.chanelll": "I am not African American I am Mexican and Puerto Rican and I am a single mother of two . I am a hairstylist that is not able to work anymore and it is effecting my life and my kids life’s dramatically because I am the only provider for my two children..", "nuh_roo": "I work retail and their cutting hours at my job due to the pandemic and curfew. I just need a little help. Venmo-Nuroou. Cash app-Nuhrou", "xavierscottmarshall": "$xavierscottmarshall Photographer from NY currently stuck in London", "_aliyah_rene": "Cash app: $Afarrow90 Venmo:Aliyah-Royster I just got laid off a few hours ago 💜", "choco_monkey23": "Bay Area shutdown got ya boy broke broke Cashapp: chris91743649 Venmo: asian2014", "neeshybaughllin": "I'm a week late on this 😭😭 but venmo is @anesiabaugh if anyone is feeling generous since all my gigs keep getting (understandably) cancelled or postponed 😪🤷🏾‍♀️", "mbow__": "Trans black artist that just lost my job and access to studio so I can no longer work on commissions I had. I also pay out of pocket for medication I take everyday! Anything helps :) Venmo: Mak-Bowdren CashApp: $MakBowd", "mslanai": "$Lanai7", "_samba14": "Student and freelance writer, my teaching jobs are postponed until further notice since all learning centres are closed now in Germany. thank you to whoever is sharing and to Ericka for the platform 💛🌱 wowww!!! Paypal sabrina-maria@live.co.uk", "blaize.watts": "Venmo @ bedoubleyou 💕✨", "kingyoko88": "You a Star! 🌻", "jatiabrown": "$jatiabrown1 ... I’m a queer black Special education educator at a predominantly black elementary school. They have been thinking about shutting down the school for months before this pandemic... not sure if school will continue", "sarahpierre": "I didn’t even think I would have to include myself but things got real for this single momma with a pay cut. Tia xoxo. Venmo: SMPierre", "jediknight00": "Venmo - JuliaJohnson", "sajeandluna": "Thank you!!! Venmo @sajeandluna.", "thirdeye_ni": "Cash app: $NiEmaBaptista", "lindseyhailes": "Venmo: @Lindseyhailes", "saniyyahsahar": "CashApp: $SaniyyahSahar | Venmo: @saniyyah-griffin | PayPal: saniyyahpp@gmail.com 💫", "n.yallah": "@Nyallah Venmo, cashapp $NyallahN. Black queer artist, had to cancel shows and im struggling to pay rent/survive. Can also support by purchasing some t shirt merch (link in bio). Thanks @ihartericka for extending your network to community per usual!", "tri_sarah_thomps": "FOH & BOH worker, currently unemployed and living in savings, thank you for making this! @ sathomp on Venmo, $sathomp17 on cashapp 🙏🏽💜🙏🏽", "singerchick37": "Unemployed. Looking for work, but everything is on hold. Cashapp: $MayaSRan", "briezepeda": "Lost all three of my jobs due to this. Been supporting myself since I was 17. Venmo @briezepeda", "rosexabby": "Cashapp: $abbyrose195 Venmo: @abbyrose195 PayPal: https://www.paypal.me/abbyrose195", "itsleono": "I’m just a student. I live with my mom and my little brother and she didn’t receive her pay yet. Thanks 🌸✨ Paypal : https://www.paypal.me/NoaaA433", "baddies_studio": "Barber babe: 🖤 @caitthebarberr -Venmo: CaitD", "ivesaudio": "Venmo - @ivesaudio", "ggggavin": "I can donate my box of health food tonight from Sakara life but I need a name and address ASAP to change delivery! DM if you want it", "duh.cr33kuh": "venmo: @cbamba cashapp: $zoonkanani  baby is a uber/lyft driver and as u can imagine during this pandemic...", "cocoabash": "@cocoabash thank you!", "damemasangelina": "Afro-Latina + freelancer artist living in San Juan - been unemployed for over a month; with covid its not possible for me to find a temp job. Venmo - Angelina-Ruiz + PayPal angelinaruiz8@gmail.com 〰️ also i sell my work which can be found with link in my bio. Thank you and stay safe everyone 💛", "iheartgraffiti": "trying to stay positive 😬 Venmo: iheartgraffiti", "seththedrummer": "venmo: @seththedrummer paypal: seththedrummer@gmail.com cashapp: $seththedrummer 🙌🏽🙌🏽🙌🏽 ♥️♥️♥️ 🙏🏽🙏🏽🙏🏽", "byrobaqua": "$ByRobAqua", "priceless__charmm": "Don’t Usually Like To Ask For Hell But Worried. AllI Have Is ACar To My Name And My Child . Unemployed Been Looking For A Job For Months And Couldn’t Receive My Tax Refund Due To Student Loans In The Past... AllI Have Is My Car Which Will Soon Be Towed . I Stay With My Mom And Feel Horrible That I Put Weight On Her Because Of My Hardship And Not able To Help Her .. Cash App: $QuinnPriceless", "whiterknee": "I work for a non-profit that provides creative writing and arts to our rural low-funded community who were forced to close our doors forever today. PayPal: whitchandle3r@gmail.com Square Cash: $whitneychan Venmo: @Whitney-Chandler-6 THANK YOU!", "trinigawd__": "$0mellyGzz -the o is a zero- this isn’t even for me.. they closed my moms job as a teacher and her second job cut hours.", "real_floreal": "I no longer have any income, and I’ve got student loans to pay Venmo; Amaia-Floreal", "charlesanthonyroberts": "Cashapp: $CharlesModel", "digital.individual": "Venmo : Aloncameron", "windchime.hooks": "Venmo: Ogechi-Egonu/ cashapp: $ogechiegonu", "grrrumpyboy": "Black, queer, nonbinary freelancer. Anything helps! Venmo @ NahshonMarden Thank you @ihartericka and best wishes to all!", "passionandpower": "Thank you for this support!$ShellyB20 Cashapp", "brandproductionsllc": "Thank you for looking out for us. Anything's Appreciated! #Artcommunity Cashapp - $branDproductions", "crowdmgmt": "All our @crowdmgmt staff and artists are at a halt and so is any form of income. We are praying for us all as a global community at this time and seeking relief as well as work opportunities from home. God bless us all. ❤️", "patrixgourmet": "$Patrixgourmet", "photoincubator": "Bars and restaurants are closed in NYC so that means no income for a while. PayPal.me/photoincubator. WE'LL GET THROUGH THIS ✊🏾💪🏾💗", "gothmomjeans_": "@Naja-Ferguson (Venmo) small business that I manage but do not own closed for two weeks. No one is getting paid.", "truly_a.d.g": "Cashapp is $Ar1G...anything helps", "magicwaterbaby": "Thank you so much for this❤️Unemployed currently. Cash app: $CasidiRapacz Venmo: @Casidi-Rapacz", "_jputman_": "$JessicaPutman", "_sugarwitch": "$blackfemmelove", "intellects_": "My partner $Detroitturtle", "florence.cano": "Recently moved to NY, looking for a job, but all my interviews were cancelled! Don’t know when I will get to even start work 😰 CashApp: $FlorenceCanonoy Venmo: @florence_cano", "liobumba": "@liobumba the gallery I work at and commissions I had lined up are all on hold for the moment", "netakirsch": "Unemployed queer teacher. Paypal: neta.kirschenbaum@gmail.com 🙏", "woahhussy": "Venmo: @woahhussy cashapp: $woahhussy paypal.me/ramonaknievel  As of today I no longer have my serving job nor my painting gigs lined up after today.", "trevor_ryian": "Venmo @trevor-silva-1 I have nothing now no jobs in the middle of a move have to be out of my apartment on the 1st I could use some help", "_specialaffair_": "Cash app: $SpecialAffair96$ Venmo: Brittany-R19 Paypal: Richardsonbri96@gmail.com - full time student", "princess_bonwin": "$Wrutoe", "vibesb.202x": "@ihartericka $BarbValdes. Bi , Black & Broke. Currently out of a job because I work with children in low income neighborhoods and schools are shut down.", "stylistic1982": "CAshapp: Sostylistichair", "dom.mcdou": "I’m a freelance dancer and it’s all cancelled. Venmo - @dominique-mcdougal", "busie.xx": "cash app: £bNde02 PayPal: PayPal.me/bNde02", "bby.starlight": "$TiandraWynn ❤️❤️❤️❤️❤️", "buu.jinn": "venmo: @Dani-ONeill paypal: dani.eugenius@gmail.com 🖤🌹", "a.melanated.queen": "I am the owner of my own hair business as well as a senior biology major at my local HBCU. Due to the current situation it has hindered my business @goddessboutique0708 from profiting and myself from being able to financially have what I need until next week. thank you for understanding🥰 $goddess0408", "dianaarroyo32": "I’m a mental health counselor and was forced to stay quarantined UNPAID since I went on a birthday trip 😭 Cash App $arroyodiana", "lilaing1111": "Lgbtq trans activist, freelancer, cashapp $lilaing111", "darkbluespeed": "@sueystrada tag any/all black band mates here and let’s recover some of these cancelled gigs so y’all stay on your feet", "itszai_": "$ZaiLien23", "creeseworks": "$ChristopherCreese", "keithreliford": "God bless you! ❤️❤️❤️ Venmo @Keith-Reliford", "jarrelldebose4142": "$Demetrius973 Thanks! Queer black server out of work due to this pandemic ....", "candidlyshare": "@melisthesun", "princevince": "💛💛💛 Venmo @Vincent-Harris", "addicted2blak": "Bodyworker/Community Healer Venmo-Tristen-Winfield PayPal-itstartsinside@gmail.com", "quentin_hernandez": "Fellow creative lost of work due to corona 🤷🏽‍♂️Venmo-rico-3589", "toninicolebosslife": "Had to cancel atleast 50% of my events and paused all International Business cashapp $TNicoleEnterprises", "hvneydrip": "Unemployed! venmo @Nashia-Douglas $ nashisha", "kitkat.415": "Not sure if your still doing this, but could really use the help - I got laid off but can’t apply for unemployment :( cashapp - $dreamsofyoutoo ♥️", "sajw_hmu": "Venmo @Sarah-Ann-JW", "rl.storm": "Black/woman/queer here who hasn't been to work in a week and a half $manifest00", "joshblacc2.0": "$junioreliacin #HELPME 🤦🏾‍♂️", "jocelynr_cltstylist": "$jeyarh. Thank you! 🙏🏾❤️", "jjustice3": "I’m unemployed for however long it may be and stressing about how I’m going to pay my bills. Venmo: Jennifer-Justice-8 anything and everything helps. ❤️. @ihartericka", "traveon666": "Venmo: @Traveon-Rippetoe // thank you! 💕💗", "woke_melaninaire": "Cashapp $Aurorax", "abby_shamir": "CashApp $AbbyShamir I just lost one of my two incomes and I am supporting me and my husband until further notice. God bless 🙏🏻", "ariscestocrat\nVerified": "Verified", "kire_senoj": "$lesterlars -food/catering services.", "manifestjasmine": "Cashapp: $JasmineKH Venmo: JasmineH417 for @africandiasporaalliance 🌟🦋", "nyjeri": "I love you!! I just filed for unemployment and I’m a 1st-generation college student. Venmo: NyjeriColeman 😭💖", "rxw.bxby": "Cashapp- $Bri1900", "jadafowlerr": "Just filed for unemployment. I am a recent college grad. Venmo: Jada-Fowler", "luci88na": "gay latina that's worried abt rent, venmo @lucianabanquero", "ladynparis": "$LondynGlenn I’m a licensed cosmetologist for a hourly payed salon. Drybar We are closed till further notice😰", "pandemic_atthe_disco": "They are cutting our hours at my job and I barley get 20 as it stands ....Venmo: pattitattat31/ cashapp: pattitattat/ PayPal.me/patrie88", "ody_wiggles": "I am unemployed due to the DOE shutting school down. Cash app is $OdetteCas", "thegem.__": "My cash app is $jadethegemmm I'm just tryna make it day by day staying positive but what's happening been triggering my PTSD and anxiety I would really appreciate it❤️", "dewaynegarland": "Cashapp: $GarlandDRoss Blessings 🙏🏾 We will all come back greater than before 💫", "amor_de_sol": "@organically_authentic 💕", "_lead.r": "$Z4Leaders @4leaders 🙏💗", "naxoriental": "VENMO @MirzaShams <3 I am a freelance non-binary multidisciplinary Egyptian recent migrant sound artist.", "adablakebeauty": "$adablakeny (the virus has caused my job to shut down, and limited options for new places of employment ) anything is appreciated!", "ladyyphea": "I need support to secure April's rent my cash App is $F3dora", "iam.stevierose": "$ThatStevieGirl i was already unemployed and looking for work so this is really heavy on me. Financial resources are all but depleted. Appreciate you Ericka and anything anyone can give", "bougieauntindabodega": "Venmo: Babzybee Cashapp: $Babzybee Lost my clients during COVID 19 😩", "knotkewlenuff": "Venmo: annayrua", "jazkat13": "I wish I could help out a bunch of y’all. I can donate $100, or split amongst a few ❤️", "lilmobaggins": "$lilmoepeep cash app💙🙌", "dejah.lynn": "Venmo: dejah-griffin  My job just announced that they’re closing for two weeks as well as my husbands 😅 I also do some freelance photography and design but there’s not much to do right now.", "msshaiqi": "$msshaiqi", "devilmaycrii": "$DevilMayCrii", "basicallychefmaz": "Chef in NJ @brwnboxkitchen DM me for zelle info 🙏🏾💕", "jonosborneartist": "Venmo: @jonfart", "poppa.alec": "🤗", "tell_you_what": "venmo: @tell_you_what paypal: johanna.marie.valdes@gmail.com cashapp: $mariposucia  thanks so much for posting ✨🙏🏽💗", "loveatiya": "ALL of guys got canceled $Atiyalillygassaway", "witchywoman477": "🙏💜💜💜", "selflove_tribute": "i’m a black queer femme in berlin, you can support me by buying my prints i am a freelance photographer, check my page 🖤sending love to everybody", "senpai_uchiha_rebels": "♥️🖤♥️🖤♥️", "q.ssoul": "Small business owner, student, and single mother. PayPal: Quandashia.s@gmail.com 🤍🤎", "rochellepaints": "venmo Rochelle-Dickerson cashapp $rochellle my job just closed indefinitely with no say of compensating employees 😭", "enfantdelunaa": "Brown, queer and struggling as a restaurant industry worker I now have no hours & no income. I’m scared as to how I will buy groceries or household supplies in the coming weeks. My cashapp is $quiaracolon96", "nila_kay": "Venmo: Nicole-lambert-9 Cash app: $nicolelambert", "fatherofzion": "UNEMPLOYED WITH A HANDSOME CHILD IN MY CUSTODY. Here is my cash app: $JAMESBRUCE323 God bless you!", "garryanthony": "$GarryAnthony", "nefersoul": "$knispo333", "carltonvbell": "$paycjbell on Cash App & Venmo Www.carltonvbell.,9’", "dominolae": "$grittymittenkitten", "trasonia_abbott": "Thanks my venmo is Traci_Abbott", "salome_mnspeace": "$salomepeace @salomepeace 💛 check out my art 🙏🏾", "thisisme.s.m.b": "Bless you...Im a massage therapist and trade school teacher. School is closed now and Ive had to close my studio. So both streams are damned right now. CashApp $sominbo1 ... Venmo ChrissyPatterson1120", "jnkiruka": "@nkiru-O (venmo)", "maat_sayang": "$MissJonesPlease currently unemployed with three boys(4,7 and8) was trying to start a cleaning business to help out the elderly... now no one is trying to hire me...smh", "sun_drin": "https://www.paypal.me/KMputu 🙏🏿 freelance and student with rent to pay", "_webuddha": "Service industry ✨♥️ $webailey3 🙏🏽", "nik0elrey": "$nikoliJ", "catsyrl": "Thank you for this 🖤 I’m a student, painter and business owner cash app $HideousCheese", "kallista_slick": "$lista4", "stylingmain": "$trimaingough", "rdr.10": "I’m currently sick and I can’t stop working because I need my bills paid. Cashapp- $Priince6", "leonorseesbeauty": "Freelance hairstylist in NYC $leonordosanjos. Thank you💋💋. Hope you all find peace as well. Be safe!", "ashywillsflatearther": "disabled sex worker abso dying over here 😭 paypal babeworld3000@gmail.com", "warithtaha": "Struggling black queer Muslim artists...trying to eat and make rent in the face of a lot of cancelations...any help would be appreciated...love...Venmo:Warith-taha Cashapp:$warithtaha", "barbarosa_": "Afro-brazillian queer immigrant ballet dancer unemployed atm due to Coronavirus outbreak! Performances cancelled until August! Can’t go back to my country, to my family! It’s tough outhere. Cash app $barbarosa24", "hair_by_gina": "I’m a self employed hair stylist Venmo- regina-tha-queen", "a.ntna": "Mixed Queer freelance artist PayPal: antnaart@gmail.com", "b.lu_ee": "Cashapp $novaazul", "carminatra": "$DMabelle", "gisellebuchanan": "💜 Venmo: giselle-buchanan PayPal: gisellebuchanan@yahoo.com", "_bryant_p": "$bparks3 🙏🏾💪🏾! Thank you!", "peripheralgirl": "paypal/estherjeroboan@gmail.com", "freeform_desire": "PayPal: reignofpeyne@gmail.com 🙌", "thecolorcienna": "Cashapp: $vintagevoodoo", "injoimi_": "Hello, i am unemployed now cash app Kalahisaac thank you for the help no matter how small", "dimple_universe": "Cash app $Bamber07", "nassynaturals": "Venmo @nassy-don cashapp $nassy89 black queer hourly worker who was sick for two weeks with pneumonia before going back to work for one week only to find out that my job was closing for a month maybe more. Taking care of two boys at home, anything helps.", "doseofstylez": "Tbh a week ago I wasn’t really sure of covid19 would really affect me that much but thing have escalated so quickly in the last week! I’m currently working remotely abroad and I’m trying to raise money to get back home. Based on the news it seems like a recession is coming... and anything would help tbh  PayPal: tolu.osideinde@gmail.com", "renajadeee": "Food service worker here! Venmo: @renajadeee / $renajadeee", "momentswithwhit": "Cash app: $Whitney4283 Venmo: Whitney4283 PayPal: Whitney.elinor@gmail.com ✨", "settieunscripted": "Cashapp $settiethedon", "puta.alatrash.69": "paypal.me/alatraash I'm an interdisciplinary artist living in Berlin, refugee and a s*x worker I stopped seeing clients because of Corona. thank you for this", "ayoooari": "@ayoooari I work at a restaurant and just got temporarily laid off", "jess_theartenthusiast": "Venmo: Jess-I-am", "cosiecreates": "$happybirthdaynic ✨", "ophelieelk": "PayPal: ophelie.lawson@gmail.com I am a freelancer journalist working with refugees", "its.jeena_": "Cash app - $JeenaB", "realislandgurl": "Venmo: @AHinds876 🙏🏾", "kaisha_kouture": "Cash app:$kaisha kouture", "swatskiddo": "Owner of @infiniteholistictarot I give tarot readings/spiritual advice. My cash app is $octaviaoliver625 my grocery store day job has been complete Pandemonium since Friday they’re cutting everyone’s hours", "artbyjar": "Venmo @artbyjar cash app $artbyjar", "glayss__": "paypal.me/laysss thank you!!", "aivo_ov": "HEY! I honestly have a 9-5 but they are cutting hours and now we have a curfew. I get paid 5 hours for three days, minimum wage. The stores are raided and there REALLY IS NO TOILET PAPER! If you can, please help.", "bl2ee": "Cashapp name: $bclassy7 🙏🏽", "color_me_nya": "Cash app: $JanyaRoss anything to help support my family; currently unemployed", "morgan.simone11": "Venmo : morganb1111(,4 one's) I work in food service and my hours are cut", "lyiahsimone": "cashapp: $AalyiahGrant venmo: Aalyiah-Grant im a college student who relies on a student worker job teaching yoga on my campus but my school has moved to distance learning, idk what im gonna do these next few weeks/months 🤷🏽‍♀️", "mazhedgehog": "Thank you! My PayPal is maz.hedgehog@gmail.com", "kshaycos": "College student here 💖 I was working a work study job at my school before they gave us a one day notice to leave and told us that we’re doing completely online for the rest of the semester, therefore putting me out of a job. My cashapp is $KharaSmithRussell and my paypal is kharashay@Gmail.com ✨I’m an artist, cosplayer, and future seamstress ✊🏾 we love to see chains like this", "leedobecka": "@whichone99 mama wanted to see this. I wasn’t sure how to share it otherwise", "indigophantom": "Venmo:IndigoPhantom ~ I’m a full time student, I can’t work because of medical issues and I won’t be able to receive my financial aid for the semester. My grandmother has been helping me but recently her job has closed.", "jasminesoulchild": "$jasmineh0709 🙏🏽💙", "animated_aja": "Cashapp: $ajacoinz ✊🏾", "iamstephluvaa": "$Stephy828", "felbaby": "$felbabyy", "beccaloveschicken": "Venmo : $mangoallure Cash app -$mangoallure 🙏🏽", "shawnthewonder": "Paypal.me/ShawnArt", "iknowwhitt": "$WCB28", "salviedabawdy": "Errrrone really going through it🥵, $salviedabawdy ❤️❤️", "visageofgrace": "Cash app $GOLDNNYC", "sunthepisces": "$beonewithsun", "jazellesartistry": "Venmo: @jazelle Lost photography & acting gigs", "tyronekiaku": "$TkiakuMusic", "knewblackbeauty": "@avabryan14 💜 If anyone needs a music video hit my line", "starcatcheractingstudio": "Hello, I’m own an acting studio in Orlando Florida. I love my work and my students, I’ve been through a series of health challenges and nothing seems more challenging than what this virus will do to my household. We appreciate you! Cash app: $starcatcheracting", "lesfreakinfly": "$LeslyeDW An out of state college student struggling 😩", "stolengfsclub": "I’m a Black Queer grad student who works in retail. My store has been closed and I’ve had a major paying photo assistant job cancel. Cash App-$TaleciaTucker Venmo-prettymajor thank you! 🙏🏾💕✊🏾", "itsjustkimnoberly": "PayPal - Cho.Barron@gmail.com My sister is an entrepreneur, owns a mobile DJ service in Seattle - (Magnolia Rhapsody.. check them out) wedding season is really taking a hit. Thank you in advance 😘", "slim.limb": "Literally just got hired at my universities library but now we must move off campus so really anything would help atm Cash app: $kymberlynscales", "ben.knee": "$benknee91 cash app", "herbuddhabelly": "Herbuddhabelly@gmail.com 💃💕", "adeeroberson": "Venmo: @adeeroberson", "brownstestkitchen": "@__mighty_mouse @_bryant_p", "raq_natural": "Love that you’re doing this. Being a freelancer is hard. Venmo- @raqnatural", "03_19_brooke_lynn": "Cashapp $brookelynnacevedo my job closes at 8pm and opens at 6am now due to the corona virus I worked the overnight shift from 10pm-6am and no longer am working for as long this last", "asanniarmon": "I am a Black, genderqueer femme that raps and depends on event planning for income. All of my events have been cancelled as a result of this virus. Venmo: @AsanniYork / Cash App $AsanniYork PayPal: asanniayork@gmail.com", "melissaventuraaa": "Just today my job shut down 😩 plss & ty💕 $Rodriguezmelissaa", "kurlystar_": "$kurlykare , imma stripper my jobs closed for 3 weeks 🙏🙏🙏🙏", "anastasiadoeshair": "Cashapp $AmandaAnastasia 😩", "cipota_chingona": "$Quenia90 ✨anything helps thank you", "rochellefatleopard": "Cashapp : $lovefatL", "live4greatness_": "PayPal : JulianH168", "itsjoshuasamuels": "Cash app: JoshyS11 Venmo: joshua-samuels11", "bottomfly_": "cash app : $janishasbattiste vaginal steam practitioner", "naesirena": "Both bars I work at closed today in compliance with state government mandates 🙃venmo: @shiloh-matthys", "sasajuste": "$birthrightcreations Love infinitely!!!! ♥️", "rae_thebeautyartist": "$beautybyRae Freelance MUA", "sushimilkcos": "Kinda going through hell right now with this whole COVID-19 I work (on-call) at Mandalay bay for a Convention cashier so since our governor put us in a lock down we don’t have Conventions which means I can’t work..i was also supposed to be getting sponsored but a convention (I make handmade flower crowns it also a way of extra income @decocrowns) but since they had to cancel the money that I would have been paid I didn’t get due to the convention being shut down without a rescheduling date. Anything is helpful since I shop at dollar tree lol..hopefully the community hasn’t raid it.. Cashapp: $httpchxe", "b_rocka1": "@nea_boogie", "stunna4union": "Shiiiiit, $lancethefool a bunch of jobs jus said they not hirin no more bc of this", "sha_recejewelry": "Hello Friends, such a burning sensation were all feeling within right now! Times are shifting, and its only just begun. . Myself and many others have been greatly affected by this shift. What we need more than ever is some spiritual safety. Continue reaching out to love ones- share, love, rest, cleanse and nourish as much as you can. . I’m a jewelry designer @sha_recejewelry and life coach @sharece_anissa_phillips . Jewelry is 50% off! DM for details and sliding scale for any other services. THANK YOU! . https://cash.app/$SharecePhillips", "jvyythegoddess": "Cashapp: $jayywash", "shopsoulrebel": "@soulrebeljewelry-cash app/venmo", "yasmeenlp": "$YasmeenPauling I’m a college senior and any money would help towards bills 🥺☹️", "iloveyoufastlife": "Im a bartender in downtown Dallas out of work for 2 weeks because of this $fastlifedavinci", "blueskiesgoodvibes": "$VictoriaShirley", "iamdivulge": "Venmo @divulgeproject", "clye_lew": "Cash app $ClyeLewis I am a Hairstylist 💖", "officiallyedi": "CashApp: $officiallyedi", "ry_browne": "The restaurant I work in has closed and I do not have insurance. I am a trans guy who really needs to get my Testosterone. ✊🏾Cashapp: $everestry", "msbzphib": "$BLACCLLC my job does not have a plan for its employees yet", "ambroise4hcfd2": "$Gdollass", "raymiain": "Full timed student, was laid off from work cashapp $remremi", "alpha_twang": "Thank you so much for this, my paypal is a_la_Sainte_Terre@tutanota.com 🙏🏾", "yazzy_brand": "CashApp: $YazmenBrandon I am resident assistant/ a daycare employee at the ymca in my town and was laid off from both today. I am a full time college student and have been trying to save up and pay off some debt. I am not expecting anything but if anyone would be willing to help, I would greatly appreciate it. I hope everyone is okay out there and is able to make it in this time of need right now. Love you all❤️", "p0etess": "paypal.me/shamn", "mightymightyafrodite": "@ccpmphilly $ADPMPartnersLLC", "jeffreyclarkjr": "JeffreyClark12 for both cash app and Venmo", "zou4mayor": "$zouthapoet 🖤 - cashapp", "stay.ros": "👋🏽 service worker here- Minneapolis just closed all restaurants effective tomorrow and idk how I will make rent. Plz help!  Venmo @Stacey-Rosana Cashapp @staceyrosana PayPal.Me/snrosana", "dccandelaria": "Venmo: Destinys-AnimalCare everyone is staying home no animal care jobs for me :(", "pearliesobad": "$pearl-fit", "jawconcepts": "Cashapp: $iamjessica", "iammo5ive": "$MoniqueBattiste", "mbeauty_byk": "Unemployed- laid off and won’t be able to get work until this blows over $Kwee92", "bolshevikbitch1917": "All my dog walking clients canceled :( Venmo: @Rob-Packnett-1", "memphy": "Venmo: Memphis-Oliver-Murphy Cashapp: $memphiana", "on.mommas": "Freelancer, DJ, event producer, photographer, mom venmo & cashapp : onmommas paypal.me/yessashakelley", "taddbeta": "Yesss, both my jobs are temp closed! Venmo @taddbeta. Thank you!!", "softcoreamor": "$angeliquejaay", "lenamay93": "$lenthegreywitch on Cashapp & venmo 🖤🖤🖤", "222cozy222care": "corona cancellations:(( $xjiinx", "kyanna_shanae": "$408Keelee in hospitality 🤦🏽‍♀️", "vicpreneur_7": "I'm a student, school has been my source of income selling staff to my fellow students now I just sit home stress out because it has been shut down, thanks PayPal: vickymwangitm@gmail.com", "meta.den": "Thank you so much for doing this. Asking for help is not easy. Venmo:: @metaden/ Cashapp:: $metaden", "ihatekdlty": "Cash app $ihatekdlty , I’m broke , no sick days", "neek.x0": "Venmo @ DomKempf Artist: singer / dancer. Everything is being canceled but my bills are still due 😔", "dropdeadkim": "Venmo: dropdeadkim my store cut my hours and I also suffer from anxiety (actually diagnosed) so I’m scared to go outside", "billytheweeb": "Broke mentally ill college student cashapp: $Ayindesmoney", "downtownboogie": "Paypal-- ellealyse@gmail.com", "oldskool_kj": "$mrkjs", "nahum23": "Cashapp: $NahumMeherete thank you all in advance! Hope everyone makes it through this pandemic safe and well!!", "l0ve_l3ss": "CashApp: $DellaTW #caregiver", "juniejunglegym": "I’m a burlesque performer/stripper. Venmo: DeCarri-Robinson CashApp: $carrixferrari", "ayjahpoppin": "$ayjahd 😭😭", "thesocialmisfit": "Cashapp: $NatureeWells beauty entrepreneur", "thosewhowandermedia": "Cash app: $wakkajess / paypal: breakfastatjessicas3@gmail.com", "marfamarf": "Paypal: martha-aaaye@hotmail.com 💛💛💛", "iamchriseley": "Cashapp:$themovehq", "ieshaw_": "$Freckles00 events are being cancelled 🥺", "bharris222": "Briajayy2 @ihartericka 🙏🏽🙏🏽", "afrofaery": "i'm a student and also a music teacher, and many of my students are withdrawing due to the virus and our transition to offering online lessons.. i really appreciate all the kindness support and love flowing through this post 💙 - cashapp: $afrofaery venmo: @helloholland", "all.your.truth": "I’m unemployed and super willing to be employed by literally anyone. But I need help until I can get a job. I don’t know how I’m going to make my car payment. Venmo: emilyclark13", "made_byj": "$jeslopez9 🙏🏾🙏🏾", "ohhimeek": "Freelance MUA/full time book slanger! This is ROUGH. If I see one more work from home post I might scream. Cash app: $TamekaBlackshir #weallwegot", "ashura_mm": "I live out of state and am currently unable to pay for my rent since i have no family to support me out here. my one job that’s supported me is gone. Please anything would help Cashapp: $Ashura18", "51o.aliii": "Cash app: $AliMIsmael", "envygiina": "$reginadacquaviva 😓", "gladilizrivera": "I’m an artist (also currently studying for grad school admission) and currently cannot work because of the virus. My PayPal is GladilizR or gladiliz.rivera@upr.edu", "loveandwork": "bit.ly/38dWyKn", "tahudoacrew": "$DevantePowellDaniel. I’m a full time dancer. Teaching Workshops, doing battles, performances and private class. But now everything is being canceled and the effect is harsh.", "crashgrammy": "I'm a San Francisco city and county consultant and writer who recently got pickpockted for my phone and bus pass in addition to losing several trainings and gigs. Anything helps @crashcash7 on venmo also have a gofundme up and PayPal", "thee.fatbaker": "I am a baker that specializes in cake decorating and medicinal baking (CBD and cannabis for chronic illnesses). My live-in partner has an autoimmune disorder and I'm sick, so we're currently on lockdown. Cashapp: $kelseypearle PayPal: PayPal.me/itskelseypearle", "tamarajadekaz": "Cash app: £TamaraJadeKaz", "cwat13": "@gatasalvajemerch3", "radwolff": "@alexis-wolff-1. Freelance Videographer who specializes in live events and sports", "summerohsnap": "Venmo/ @summer-larkins Single mom of four buying beans and rice by bulk just Incase. Thank you 🙏🏽", "e.yenskii": "🙏🏼🙏🏼🙏🏼 $EYenskii (cashapp)", "ghetto_hippie_": "Im a care taker and the family sent me home 😩 my clothing company is just a baby. We're building our brand cash app $ghettohippie", "amoridesainte": "$luxottiic", "siriustimesmedia": "$shay10833 home black business owner", "polanco_": "Cashapp $Nicollenicky — bless u", "woaj.tony": "Cash App: $WinstonAntoineJr Venmo: @Winston-Antoine", "tyspeaks_": "CashApp $tysart 🙏🏽", "dunscot.face": "Cashapp: $AntDelPo", "therealritabee": "God bless this post and whoever donates! Venmo: @sherrita-Cole CashApp: $SherriAnn PayPal: sherritac@gmail.com", "muva_mrose": "$gabbiemoney i don’t know what I’m going to do. Wasn’t prepared", "rogodwynnmusic": "Venmo, @rogodwynnmusic", "dnelson2": "$deshanenelson", "wyn.powers": "Cash app $deasiablalock they can’t win", "heartofalinguist": "Venmo: RobynGolden I haven’t been able to find a job after graduation. Now everywhere I’ve been interviewing keeps putting freezes on hiring because of Corona.", "madnyct": "I am self employed tour guide and everything is canceled most of my clients are from Europe.", "pledgeobright": "$sennjp - DOE did the right thing, at a bad time though😢", "remakahsay": "PayPal.me/rema690. ✨", "khan.did": "https://www.paypal.me/waqaskhan22", "dnnnlllleeee": "aaaallll my jobs canceled and I am now unemployed. thank you so much paypal: djrosales@hotmail.de", "mulaaatto_": "$mulaaatto", "soulrebelyogi": "🙏🏾🦋✨ paypal.me/soulrebelyogi111", "_in_between_spaces_": "thank you @ihartericka 🙏🏾 venmo: @jaimeolivia paypal.me/jaimeo614", "arienole": "Venmo: arienole; cashapp:$arienole", "brattybadu": "$brattybadu I’m a college student, poet, & model but currently unemployed. Every single dollar is a greatly appreciated 💞💞", "kai.barr": "Venmo @kailey-barrows", "thedevsyn": "$Devontayeforbes", "mya_rayyy": "I'm a premed student now out of a job 💖 please me me out, cashapp:$myarayyy", "high_love23": "$d23wagoner 💕", "urlocalllgrocerystore": "$renegadeyoudabae", "superpaige": "Venmo: Paige-Elizabeth93", "rhema.jordan": "thank you. artist, teaching artist and bartender. $jordanlabbeart", "mesochukwu97": "@mesonwune College student. One of my jobs is cutting hours. The other one isn't giving hours.", "meeahmia": "$meeahmia", "martinejoelle": "🙏🏾✨Freelance nonprofit work is limited... PayPal.me/MartineJoelle CashApp $martinejoelle", "emilydmads": "I’m an artist living in NYC and trying to make ends meet as is. All side hustles involve being in public, and the public is shut down. I give my word that I will be working on my craft at home during this time, and that I’ll come out swinging when it’s time. This is rough, but we always make it through. ✊🏽 @EmilyDMadigan - Venmo", "narlynvenice": "email bomb dropped this AM. Thank you🙏🏾 Venmo: @narlynvenice CashApp: $narlynvenice", "rixz": "Cashapp $emeraldtumbling I own a gymnastics gym, I’ve refunded all dues so families can feed themselves..meanwhile I’m eating avocados and crackers ...🌪🌪🌪", "jellysanscanicy": "Jclayjclay", "art.fl0w": "Friday was my last day at my old job. I was supposed to start my new job TODAY but schools are closed for the next 35 days 🙃 Cashapp: $Elliex24 If anyone is interested I create custom bags and canvases! 🎨👩🏾‍🎨", "pettyninja": "$chinadollslays my makeup business is slow because people think I’ll give it to them the easiest and Nd my regular 9-5 has me out for 2 weeks no pay😢😢😢😢😓", "7jwms": "venmo @sevenseven", "moniqueesmithxo": "Was on the right track with my career, quit my 9-5 to follow my dreams, my dreams are now put on pause until this blows over. But i am putting everything in Gods hands💖 Paypal.me/moniqueesmithxo", "altariq_": "I have my own cleaning business and I am still cleaning please look on my page for more details. Cashapp $leaky94 be safe stay clean", "livingdisplay": "My job just closed for the next 1-2 months and i have no family access. Any help is appreciated. Cashapp: $diamoree Venmo: diamoree", "thuxury": "i was her fired by my racist white boss even though it would be impossible for me to find another job during a pandemic. Venmo is @thuxury", "nevershyxx": "Forever grateful for this🙏🏾🙏🏾❤️ CashApp: $Nevershyxx", "jadore_xo": "This is crazy! Freelancers please stick together. If no one knows the struggle, WE KNOW. Cashapp : @$NeissaD Venmo: @Neissa-Diabate", "julianmanzara": "Venmo @julian-manzara", "jcouturepr": "$jcouturepr", "gee_raffeee": "I have a brand new vinyl business and everything was great for a little. Now unfortunately due to the virus sales have went down tremendously. It’s my first business and I’d hate to see it fail this early. Anything helps 🙏🏾 Cashapp: $anngggiie", "_tillytheartist": "... $tillytheartist , I hope you guys stay safe... 💜🛸", "zandi.beauty.confessions": "Cash app $zandibeauty freelance makeup artist", "tammakastaley": "$tstaley on cashapp and booktammakastaley@gmail.com on PayPal. Im a freelance spoken word artist and sex health educator. 🖤💪🏾 Thank you!", "jadalareign": "venmo @JADALAREIGN, freelancer with all gigs cancelled for the foreseeable future. much gratitude for this platform. sending infinite love. ❤️", "cherry_bliss": "I’m a graduate student in France. My landlord has not decided to give any relief and the city is going on lockdown tonight. No way to make money. PayPal.me/cherrybliss2018", "hilo_house": "Freelance writer/business owner cash app $sasazamani thank you 🙏🏽 for your generosity and creating community in these times of isolation 🤗", "kimmysumony": "cashapp/venmo/paypal: KimmySumony", "tay.lavonne": "🥺 Cash app & Venmo: Shaunte612", "ssuavve": "Due to this bs of a virus I’m now unemployed, can’t pay the rest of my studies, can’t pay my lawyer the rest that I owe, can’t buy medicine for my mom or myself. Anything will help, god bless, stay safe out here😕 god is with us Cashapp: $ssuavve", "ruqayyah_kj": "Hey!! I’m Self-employed, and 2020 has been a rough one, it has hit harder than a ton of bricks. 😭  I’d just like to say thank you in advance for the help. 🙏🏽🙏🏽 Thank you. https://paypal.me/RuqayyahKJ?locale.x=en_US", "purpleauraa": "$milanaura", "jafreakas": "Paypal: jalanejote@gmail.com The struggle is so real atm 😔", "rubinicole98": "Currently in quarantine I’m a latina trans girl and I’m a student/work part time in retail :( $ARTANGELHOE", "desireejaha": "Black femme musician. My gigs and artist residency are on hiatus until further notice Venmo: @desireejaha Cash App: $desireejaha", "indiasioux": "Freelance promotions, in person so every single event I do is cancelled :( $indisioux on cash app", "sunflowervalentine": "🙌🙌🙌🙌", "chaya_labufff": "Venmo: @chaystew", "niceitsndigo": "$ndigojones 🥺💕", "izic2006": "Venmo: @Isaac-Rivera-88 PayPal: izic2006@yahoo.com", "misslizzy6": "Lord knows I was in the cusp of my creative career, I had created such amazing projects for myself and a business that was going to change my life but everything is on pause and now I’m constantly worried how I’m going to pay my bills for next month so anything helps https://www.paypal.me/misslizzy6", "ciaraxdiane": "Venmo: ciara-smith-9 Cashapp: $ciaradiane17", "abbrodrick": "Camera operator whose getting gigs cancelled left right and centre, my paypal is abrodrick23, thank you thank thank you ❤", "__tonixlane": "$Aalane05", "moe.everything": "$moeeverything (cash app)", "semidivina": "@erikitabliss", "hurricanegrill": "Venmo is cashley96", "blissbykiera": "$blissbykiera", "one_hot_milky": "I'm a Black Trans man, unemployed due to chronic injury but not disabled enough for disability, and my partner's job just closed. My PayPal is carmenmcnealey@gmail.com honestly anything helps.", "aries90_": "Single mom and schools are closed! Cash App: $Stg2009", "andre_ninjamin": "$Andre4000", "ks.faure": "$kerstinefaure", "brushana_goddess": "$Sacredkiss", "r_raeee": "My cashapp is $Raewarr2001. Currently affects everyone in my household jobs and child care.", "lordarze": "cashapp $haynar venmo: @ tiltedrose PayPal:princessranyah@gmail.com student & black artist/business owner 💕", "sofeia_eddy": "Please consider donating to the @houseofmarkwest a Black owned gallery in the Bronx. Cash app: $HouseofMarkWest & Venmo: @houseofmarkwest 🙏🏾", "thehomieee": "CashApp : $NevinHawkins Venmo: illaMakeUpArtistry  Freelance MUA in Louisiana , ALL of my appointments have been cancelled.", "unsleepy": "CashApp: $Alenciax Venmo: @Alencia-Zenn Teacher, miss C. Rona has extended my spring break to 3-4 weeks which means a month without pay", "_jt910_": "$JTJ64", "mizuki_senpai7": "I work at a ballpark as a chef and due to the COVID-19 the whole MLB and MiLB has been cancelled until further notice and it's been a little hard not working or finding extra work. I appreciate this so much and will be sharing. Cashapp $BreMMosley", "smileykatxo": "Cashapp- $smileykatxo Venmo- kathleenhall58  I’m currently and actor and a student that works for my school which is now closed 😭 I could really use the help especially since I don’t know if I can afford to go home.", "the_sensual_sage": "Cash app: $thesensualsage. Venmo Thesensualsage", "agrojitt420": "$lildeedick", "thisisyasminj": "$thisisyasminj", "peridotang3l": "I’m a black freelancer. Being stuck at home right now gives me additional time to create art and finish projects so PLEASE feel free to hit me up for commissioned work! Paintings, drawings, charms, clothing, anything! I price reasonably and I ship! I have my redbubble shop linked in my bio and my cashapp is $Laexx ... anyone who sends any type of donation I love you so much and thank you for the support during this crazy time! Love to all the other independent black artists 💘", "mae_is_murphy": "I am a student, full time mom Venmo: maereann 🙏🏻 💕", "craziebutiful": "International grad student running out of funds in the US. $Craziebutiful", "thechellylovee": "oh 🥺 thank you 💞 Venmo: @chellyrodriguez", "aahhereitgoes": "Cash app :$oohok", "truthalexis": "It’s hard times ahead for all of us freelancers and self employed ppl. Hope we can band together and make it through. 💕  https://www.paypal.me/truthalexis", "marstookthemic": "@tamarajadekaz @janeawest @wal3sca @kailyn.icole", "mrproducerface": "I own a video production company that had ALL of our projects shut down. Venmo: @mrproducerface", "sexxylexxy_21": "I’m a fresh out of college graduate, new to New York just moved 2 months ago and got my new job and theatre gig cancelled, cashapp $riaxo21", "missessmalcolm": "$missessmalcolm", "inky_hijinks": "Cashapp: $Inkyhijinks . Ngl this was an awful time to start a new job and because I havent had my first day yet I wont be given 'paid time off' during this and its frustrating as heck;;", "yoga.jones": "I’m a black self-employed female business babe 💕 cash app: $AleynaJones91", "sydneyziems": "$sydney-ziems. just started my business a month before coronavirus. pop-up cancelled. production halted. my other job is on temp leave. my other supplemental income airbnb all cancelled. :/", "cindyelizabethphoto": "Freelance photographer here. Gigs canceled due to social gathering regulations.  Venmo: @Cindyelizabeth13 Cashapp: $Cindyliz Thank you ❤️❤️❤️", "mmm1231117": "Venmo: Tjaxk In Seattle struggling, Jah bless.", "melancholic_melanin_": "Was suppose to start my job since I’ve been jobless for about three months at a preschool... it shut down today. I make jewelry on the side but haven’t got any sells recently Venmo @ ani-24 Anything helps tbh", "fillededieu": "$CydneyCherise 💕", "sgreenboxing": "Black freelancer/entrepreneur Venmo : ShaeGreen68 CashApp : $shaegreen68", "amazelane": "I was holding out, but I’ve had to cancel all my events now too. I sell handmade/handpainted jewelry and my art, and teach intuitive painting @thesacredpaintbrush. Venmo: amy-Alaman. Thank you!", "color.andshape": "$jadagp cash app @jadagp Venmo 🖤", "maxyello": "selling photo prints on my site maxphotostudio.com/prints 📸 @maxphotostudio", "fits_with_finesse": "i’m a full time service industry worker and have already lost hours in the last few weeks due to business slowing down. with covid-19 cases in my city increasing rapidly every day, restaurants and bars in my area are at risk of shutting down which means i will have no income until this blows over. anything helps 🙏🏾💞 cashapp: $llangford27 paypal: paypal.me/laurynash", "wickedgeechee__": "$MsMoni2 my business @moorpower__ pockets got hit twice because of this mess smh!", "shaunte": "Freelancer | Venmo @shaunte", "kwini_rene": "Black Owned Restaurant Downtown LA @poppyandrosela - cashapp - $kwini - Venmo: kwini-Musgrove - our workers are going to extremely impacted with our close this week. - please all support your local business so we can all survive this pandemic! Praying for everyone.", "india.nicole3": "$IndiaNicoleLLC Freelance hairstylist💕", "jessi2000jt": "Jess2000jt", "pallas.amenah": "Venmo @Pallas-Amenah-Morgan ... UNEMPLOYED due to virus outbreak in DC 😷", "janeawest": "wow ~ thank you ~ $JaneaWest", "nagwuna1": "@sexxylexxy_21", "tatycstyles": "CashApp: $tatyannachamere Freelance stylist and photographer. All bookings had to be canceled and job has shut down with no pay. 😭🙏🏾", "ahhdayy": "Venmo: Ade-Kassim Cash app: $AdeKassim PayPal: adeb.kassim@gmail.com Recently lost my restaurant job due to closures, any help is appreciated ❣️", "oflo18": "I’ve been unemployed for a week now Looking for jobs rn is hard af especially in the ny nj area where the virus is spreading like hot cakes it’s been affected me to the point Where I wanna hurt myself. Venmo: Oliver-Flores-14 Cash App: $ElDominicatracho", "thablackgod": "cash app: $rervin24", "jay00789": "$JordanScruggs @ JordanScruggs", "abangaaa": "$AungelleDupard", "itsjustjanae": "I’m a black freelancer and service industry worker who’s out of a job until further notice. Venmo: Janae-Davis / CashApp: $janaebria 🙏🏽🤍", "themysticjane": "$themysticjane2", "lavish.hairgallery": "$AungelleDupard", "artbybruja": "cashapp: $artbybruja", "_dejewel": "$Symphy it would be greatly appreciated. Love and blessings I’m a restaurant worker and freelance artist", "doniatouglo": "Wow! This is simply wow 💛 my paypal is : doniatouglo@gmail.com 🙌🏾", "knightiam_": "I could really use the love and financial support as I have small ones I’m looking after who are no longer in school since they’re being closed in NYC. Any help would be greatly appreciated. ❤️ $knightqueen", "lajeunnak_": "Cash app: $RLorielle", "afrooankali": "I'm a Black, queer freelancer working in events, currently locked down in Germany with a lot of my work cancelled. PayPal.me/CamilleBarton", "aicy_ray": "💠black trans femme freelance artist. PayPal: darsyx@msn.com", "sunkissed.phee": "Cashapp $Phee4", "bangloud": "venmo @bangloud this virus cost me a couple tours as a drummer and a major slowdown in creative consulting in ny", "sagemoondoula": "Simiya-Sudduth Venmo $SimiyaSusduth Cash App. I am a full time yoga and meditation teacher and the studios and schools I work in are closing for a few weeks", "cn.lvv": "Cash app : $ChristineCC197 paypal : Christinecc197@gmail.com .. Im a home school teacher teaching our Colored babies the knowledge of Celf , Environment , History , etc . I also run a small business called @celfcreators helping others cleanse their body as well as encouraging other on Celf Luv .. While this Virus happening No teaching the babies & Helping others on hold ✨", "myowndad": "@hiimmike venmo", "chanimaisonet": "Two jobs were canceled due to Corona. 😢 Cashapp: $chanim", "rosedurr": "venmo: @ roseduran", "chantel_mcneil": "Just got an alert that my job is now closed till the end of the month. That + upcoming surgery! I’m now stressed & worried. Venmo: @Tieagra-McNeil Cash App: $TCMcNeil PayPal.Me/tieagramcneil", "greeneggsandandsam": "Venmo: $SamCorsey I am a freelance videographer ❤️", "sinclaireelise": "$sieljo- I’m at home from my 9-5 and I’m a social media strategist/content creator", "robertafrbr": "Undocumented lesbian immigrant whose job and income is compromised as the family I babysit for is leaving to the mountains for a month. I’m desperate as having several panic attacks. I need any kind of help, but specially freelance jobs. I’m a journalist, writer, public relations and social media professional. I’m highly skilled, I just haven’t been able to find a secure job in the US yet due to my immigration status. Venmo: @RobertaRodrigues Email: robertafr91@gmail.com", "calixontherocks": "Filmmaker with multiple cancelled projects 😭: cash app : $CalixOTR", "_graffitea_": "$yaya1295 it would be greatly appreciated Freelancing visual artist and K-12th teaching artist", "whereshaygo": "Thank you for the blessings...if its not me still thank you for blessing and supporting our LGBTQ+ community. Please checkout the link in my bio for LGBTQIAAPP t-shirts & books!  Cash app: $hae701 PayPal: PayPal.me/nsssh", "rickireckless": "This is wonderful and I’ve shared it. Anyone know of something similar for Latinos and Asians? Thank you", "nightphoenix83": "I’m a independent Massage Therapist and all appointments have been cancelled for the next 2-3 months. Only source of income 😳🤯! Venmo :@EDavis183 💜👏🏾", "youknolaurin": "Both jobs will be closed for at least a month! My gf and I work together so we will not have any income during this time. Cash app $youknolaurin anything helps", "ingraceyoga": "$Jesecca ❤️✨ Thank you!", "socio.trap": "Cashapp:::✨SwaySpyro ✨ please & many thanks ✨✨✨", "flowwj0": "venmo and cash app are @flowwj0 i am a full time yoga teacher and my classes have been canceled.", "jusjust23": "@jusjust23", "_manwiththehorn": "Full time self-employed musician that travels with no work till possibly June. Venmo: Paul-Bailey-26 Cashapp: $manwiththehorn. Thanks in advance.", "zaq_pineapples_": "I have an IT company (Hlsolutionscorp.com) and my main client are schools and libraries. $zaqhill", "muffiinn_": "CashApp $kelsearaesmith Freelance Makeup Artist. 🤞🏽🤞🏽❣️", "roxylalonde": "I’m a Black trans MAC artist and part time sales associate. MAC has stopped allowing color matches and makeup testers, which is what brings in traffic, and haven’t been scheduling freelance artists. They haven’t scheduled me at all, and I haven’t heard from my other job since I moved. I’ve been doubling down on small commission pieces, but it’s really not bringing in much income. My cash app is $PaxColston", "msjlong27": "$msjlong27", "thenakedhustleshow": "$thenakedhustleshow", "onjalina": "Dog walker, everyone's working from home - venmo: onjalina Thank you for this 👆🙏", "wal3sca": "venmo: @walesca", "giannacabrera_": "Venmo : @giannacabrera03", "rakib_7": "@ihartericka it would be a blessing my paypal is rakiya2002@yahoo.com anything would help at this moment. The struggle is real, and we're just trying to keep our heads above water. Thanks in advance if you do. 👏", "sidneedidit": "@sidneeo 🥺🥺🥺", "elleword": "$LyricW cash app. @Lyric-Wills Venmo. Lost every event/ modeling gig/ also willing to barter services", "kayherbert_": "$fashionguruk my orders usually are everyday every hour but unfortunately I’m not able to get ships due to everything closing", "amwloves": "Venmo- amwloves", "luvnmuzik215": "$mamabonaparte", "cupcake.queeen": "I run a small baking business in the Bronx which helps me pay for grad school. In grad school to teach which is also affected due to school closing and hours needed to graduate. Anything would help! My cash app is $kianniii", "encouraginghonesty": "PayPal.me/briamakesthings", "klassickokain2": "CashApp $Kerria8139 Venmo - @Kerrinesha-Adams Zelle- lethilangesculpt@gmail.com Small non invasive med spa @lethi17lange", "jadanycoleellise": "Cash app: $quatzdot Out of my day job in NYC (no PTO) ☹️ Full time recording artist and performer. All performance prospects are now shut down, cancelled and not booking. Please, any amount will help 💛💛💛💛💛💛", "lovinganvil": "Artist/freelancer 💖 venmo coco-corral", "drxyah": "CashApp $DreyahAli Venmo @DreyaAli Thank you 🖤🖤🖤", "kisscole_xoxo": "$KISSCOLE — small family restaurant outside of Atlanta, GA. Schools closed so the baby’s gotta stay at work with us 😩 but the show must go on ❤️", "moesph_oreo": "Venmo - Moesphoreo Cash App- Moesphoreo", "mrphillyphilly": "Hello I'm J. I'm a writer and then list goes on - $GriggerBread", "breukelenkyd": "Photographer/production assistant w so many cancelled events! Cashapp: $Alyone PayPal: alycarreto@gmail.com everyone stay safe and help those who can’t help themselves! 🙏🏾", "lovelylexci": "Lovelylexci - venmo 🙏🏾", "tiellegreene": "Yo thank you...imma mua and bartender in la single mom....smh ...cashapp @thurz", "iambakah": "Cash app $PayBakah", "pinkyapplez": "I'm an artist working as a substitute teacher. Other than today (Monday) I won't have any regular income coming the next two weeks. My Cashapp is $PinkAppleArts.", "kristadeloatch": "Cashapp is $KristaRDeloatch", "yallshouldchoke": "Cashapp : $hephzie12", "mrsmomcupcakes": "Thank you @ihartericka 💛💛💛", "nvjones85": "$nvjones85", "heartspacevibration": "Artist, Advocate & Carpenter in the Midwest. CashApp- $AnyStarr", "queerlatifah": "Cashapp $QueerLatifah", "kazejewelz": "Completely needed representation Ericka. $kazej or PayPal to kazesjewelz@aol.com small business working for myself. Currently brainstorming on how to reach my market even more with low traffic, pushing my brand, hoping I can sacredly adorn some counterparts in healing jewelry masterpieces.", "iamteniya": "Freelancer, dancer teacher/ professional dancer. Thank you so much losing more and more work and auditions everyday 🙏🏾 Krazy_yaya@hotmail.com", "femistry": "CashApp: $Femistry", "mslisacasey": "Cash app: $lisac73 Had my restaurant shut down and am unemployed now 😒", "huggins479": "$DDHuggs 💝🙏🏽 more worried bout my kids we live n rural NC with no access to the free meals", "queentwigz17": "$Absmith", "notyamomma1990": "@AyshaNailah Venmo, $AyshaNailah Cash App ✊🏾❤️❤️✊🏾", "kaya.cheyenne": "Cashapp:$spiceykaii 😩", "yol.gee": "Venmo - @ Yolgie-Pierre , cashapp - $YolgiePierre, PayPal - PayPal.me/Yolgiepierre", "unordinary.spams": "$nanabaddest", "aletheakontis": "@ktempestbradford", "rumairy": "paypal.me/rumairy artist ✏️", "its.dai.dai": "Extra week of spring break and my mom can't afford food I at least wanna get the house a box of cereal $DaishaunSimmons 💕💕 I'd really appreciate the blessings 🙏", "roninsrealm": "$roninsrealm , I am a freelance dj/event curator in Baltimore that throws showcases for local artists in a safe positive environment!! these cancellations are really slowing things down right now, anything is a huge help!", "danii211": "Venmo: @Danyelle-McBroom-1 Almost every show I was working on this month has had production halted. ☹️☹️", "lambbabies": "Cash app $lambbabies became unemployed just as this broke.", "seadydot": "Venmo @Siedah-Thomas CashApp $iedaht", "a.riieeel": "Hairstylist and photographer 😭 $smithe2020", "___jayde_": "Venmo: BananaBabies & paypal: paypal.me/BananaBabies", "uravityxdeku": "I was fired while taking care of an older woman as a care giver her daughter wanted to spend her time with her mother since she had dementia. I just need enough for food or water tbh and maybe gas too $rickanmorty anything helps tbh I'm looking for work now but I really need gas.", "tigresshoods": "Wow this is beautiful. 🖤 Thank you. I'm an artist/freelancer. I will definitely pay it forward. CashApp :$BondJane", "jai_rich": "❤️🙏 Thanks Erica, yall stay safe and healthy. Stay strong everyone.", "yourdeadsister": "Black trans woman, drag entertainers and freelance assistant completely out of work for at least a month. Help if you can. 💕  Cashapp : $blackandbored Venmo : @ blackandbored", "bryskie22": "@xfabrisiax", "norin_rad": "Cash App $ToranFarrow videographer entire season cancelled due to airlines.", "symfani.star": "Venmo: @GoddessVibez888  Paypal: GoddessVibez@hotmail.com  Single Mom, 2 boys  Thank you, thank you, thank you for your generosity ✨🙏✨🥰", "miahkaijerrel": "$NaecoBey - CashApp - PayPal ~ smittyshoney Dermatology Assistant or business has decreased significantly and my hours have been zero to none 😔", "mischiel.j": "Venmo: @Mischiel_Jeffries CashApp: $MischielJeffries Thank you so much for any help you can give.", "danyyb_": "😭😭😭 Cashapp: $Danyellb29", "_ruthzipporah": "$Mocha6", "skyeeblu": "Venmo: Skye-Bennike Laid off for the month. Anything helps!", "tiffey_in_the_kitchen": "PayPal: paypal.me/tbryant12 venmo: @Tiffany-Fulton-6 cashapp: $tiffeyboo I'm a chef educator freelancer going thru a divorce w/ a 6yo daughter", "ka_maiamaia": "I’m a freelancer and all my bookings were cancelled 😢😢😢my venmo is @karen-sawyer 🙏sending love to everyone out there", "darkmoomin": "I work as a movie extra sometimes and I most likely have fatigue syndrome so I can’t work full time and do extra work and but haven’t got much luck lately with found some extra work the past months and I am falling behind in bills, any heavy donations will help, thank you! Crystalsora@hotmail.com", "_s_a_g_e___": "$sageselah", "hectate828": "I don't have cash app my PayPal is ncbassmaster1@hotmail.com got put out of work cause boss closed the shop he don't want to get sick. Craziness", "__swaysia": "CA: $Swaysia", "alexhallfilm": "Wow thank you for doing this! Willing to do an exchange for anything sent! Dope photoprints, also credit in my book! Paypal: alexhallfilm123.@gmail.com  Cashapp: $alexhallfilm6", "carmenlobue": "@Carmen-LoBue artist 🌈✊🏾 + caregiver", "foinedexter": "$orcannyc 🙏🏿", "noelspiva": "cash app: $NSpiva paypal: bnspiva :: thank you!! ✨I’m a St. Louis based freelance graphic designer + brand marketer. i also curate music through playlist/mixes 🙌🏾 help a sista out", "erin.erin.erin": "$erinscoins freelance digital marketer and content creator in NJ/NY 🙏🏾", "panadonia": "@ygcosplay is in need of assistance. I'm not sure of her cashapp but she has a kofi on her page.", "soul.bounce": "One of the few Black-owned and Black woman-owned websites covering soul and R&B music is operated by @buttasoul. CashApp $ButtaSoul.", "babu.bear": "college kid in a college town, can't get that rent paid cause job can't run with nobody up here yknow. working two jobs. one job advocating for my lgbtq folks! other job making sandwiches. neither can perform now and Im outta luck. cashapp: $honeybear1230 venmo: babubear", "chefcooldre": "Thank you! For being amazing 🙌🏾 Cashapp: $ChefCoolDre Venmo: chefcooldre3", "thickkk.fil.a": "But how are you confirming 🤷🏾‍♀️?", "mrsthesis": "$mrsthesis", "ingridtherose": "PayPal.me/roseingrid", "amadijae": "CashApp : $AmadiJae PayPal: amadijae@gmail.com", "kari.of.oz": "Student, anything can help❣️🙏🏾 CashApp: $KariOz", "omarindigo": "Oib2 @ cashapp lost my job and now havevloan debt", "ivorylove23": "@ihartericka cashapp $ivory2310. Thank you! 🙏🏼", "lena_bby": "Cashapp: $lenashea Job closed for a month, supposed to move in a month, and still have monthly bills. This post is beautiful, and one day I hope to be able to be a giver and not a seeker", "talimadavis": "Thanks Ericka for doing this❤️❤️ $TalimaDavis - Cashapp / paypal.me/talimadavis", "sistersoulhealing": "Cashapp $sistersoulhealing", "styledbyyb": "CashApp $STYLEDBYYB Freelance fashion stylist. Almost 5 jobs has been canceled for me so far! 🙏🏾😖🥺", "k_emez": "Kenneth-McQueen Venmo", "xavier.a_perez": "Vemoo Xperez2600", "facelovebycammie": "❤️❤️ $cammieface 🙏🏾🙏🏾", "gatasalvajemerch3": "Venmo: @gatasalvajemerch", "the.cadenza": "black queer student in a homophobic home. struggling to find a job and desperately need to get an apartment near my school to get away from my abusive family. vemno @cadence-reid cashapp $CadenceReid PayPal @crr81@pitt.edu ❤️❤️❤️", "rainanechelle": "Cash app $rainanechelle", "jarrardraju": "3 different jobs check to check , all now unemployed due to a state wide closing and I'm not sure if my landlords will even waiver a fee on rent! PayPal jarrard34@gmail.com", "lucianjamess": "saw this on @chellaman page and am so relieved to see humans in world still being so so kind and giving! It makes me feel a little bit better about life! Current job is cutting hours and my second is unfortunately postponing on-board training :/ cashapp: $lucianjamess", "notgrima": "College student and bridal seamstress here! Multiple brides&maids have understandably cancelled their alterations with us but it leaves me with fewer hours and less this spring, even with my two jobs. I will also do my best to help those who need it more than I do in the comment section 💕 PayPal is pirateprincesstetra@hotmail.com", "valeriesviandinc": "I am a freelance cake maker and food runner in NYC. We are SHUT Down. Cashapp: $ValCarr113 Venmo: Valerie-Carrington", "pahpah_smurf": "I’m a group fitness instructor & 2 of the studios I worked for have closed. Venmo: @abi-pie Cash app: abi_pie", "sadgelinajolie": "anything helps, thank you 💕 venmo: @Aja-Wingo cash app: sadgelina paypal: paypal.me/ajawingo", "mel_l96": "Melissa-larios-1 🙏 😭😰", "ps.i.love.youuu": "cash app: $parissarmstrong / venmo: paris-armstrong-1  i’m a black lesbian unemployed student living in the bay area 🌈", "saturday.oak": "Queer POC here 👋🏽 I own a vintage clothing shop and with pop ups being cancelled, the store I locally vend at potentially shutting down soon (which is where the majority of my income comes from), and me being in the midst of a big move I’m growing more & more worried. Venmo: luckymatch or please check out my online shop on @depop depop.com/luckymatchvintage or the link is in my bio ✨", "ellepierremusic": "@l-pierre venmo, $earthalitt cashapp", "dr4gon_femme": "venmo @mars-gold cashapp $MarsHirshe PayPal mars.gold111@gmail.com✨", "dirtyveganhippee": "I work at a gas station handling dirty money from people who are coughing and sneezing in their hands and not washing them. Cash app: $hicksm6", "earth2ren": "Venmo native_dancer Cashapp $renwilson17", "joey_sadass_": "Freelance graphic designer, bartender for a catering hall, and work a 9-5 as a barista. Shop is closed indefinitely, events are being canceled left and right, and client work is coming to a halt. Cash app $jordysadass", "badbcomplexco": "Corona virus has made it impossible to jump back into making money now that I'm back in the states. Stepping up my content on Patreon but also bless me: $maplebarbie on Cashapp @badbcomplexco on Venmo, dm for PayPal", "darrynadams_photo": "Cash App: $darrynadams I am currently losing hours", "cosplaychoco": "Cash app $msimanij98 I’m a character actor (like princess parties) and a barista. Or at least was. Thank you so much for sharing this around!", "blackcrystalcosplay_": "I work at a hair salon as an assistant, so most of my income kinda relies on tips from clients that come in and get serviced......and so far we've had several cancellations and it's been a little rough. My friends have been helping me out but for the most part, I've been in the house and can't really do much during this time. My cashapp is $loul I'll definitely share this for my other friends as well.", "yourqueerhighness_": "Model, bartender, sex workes- impacted by Nashville tornado and restaurant closed from COVID19 ✨✨ https://www.paypal.me/chelseaanilyah  venmo: chelseaanilyah77", "shydeia": "Cash app: $Shydeia Venmo: Shydeia | sidenote link in my bio to a @blackgirlmagik global wellness initiative with tangible resources like these and a form to attend free digital workshops focused on mental + wellness. Sending everyone so much love and thank you for this @ihartericka", "ladylunastar": "$ladylunastar1 Due to a work place injury, I’ve been out of work and COVID is making it harder to FIND work. Thank you so much for sharing!", "amaizink_art": "PayPal email : anjelvi@aol.com Venmo: maiz-newby-Kilpatrick ✨ I travel for my art projects & design work and can’t travel to higher risk areas to meet with clients. I had a business and networking workshop in Olympia I am no longer attending. I am looking for supplemental income and of course that is on hold since I live in WA.", "angel_born2die_again93": "Paypal: bunny.lapple@gmail.com Cashapp:$bunnymoneychi", "seemsea": "Cash app seemsea", "iancoulterbuford": "Actor, worked as an Broadway front of house staff for two theatres, Assis3tany House Manager for an Upper East Side performance space, and taught dance in schools. All income gone. VENMO/CASHAPP @iancoulterbuford", "kellcunningham.tattoo": "Venmo Kelly-Cunningham-28 Independent artist. In Bergen county jersey where it’s all shut down so. Help pls help a girl out :(", "baddaddyalex": "Venmo: buhnanaz", "dopecurlsbyginger": "Pet sitter/ hairstylist helping my mom take care of her mom and things are 😨 Venmo -@ GingerRachelle4 💜", "topaz_faerie": "@topaz-faerie venmo all my gigs canceled is hurting my pocketsss", "thetroybutler": "Doing what I can to make things come together for me and my fam. Cashapp $tbiscuitss whatever I receive I'm giving 30% back to another in this thread. 🙏🙏👏🙌", "erellaelizabeth": "PayPal: cierragarraway", "naturally_everafter25": "Anything helps....Thank you in advance!!!! Cash app: $KatreshaT", "wavydaveyy_": "@ihartericka $davebazil", "the.sage.one": "PayPal.me/SageStart (Sage Stewart-La Bonté) --- Student / Artist / Educator / Facilitator of QTBIPOC events. Lost contracts due to COVID. Can't pay tuition, or rent for much longer.", "patrick_leshore": "Venmo patrick-leshore cash app Patrickleshore4", "naikachampaigne": "Hey my restaurant/bar just closed for 2 weeks because of the COVID-19 and I need to pay rent/school. PayPal.com/naikaboissinottealexis", "lindsayzae": "i'm a freelancer and small business owner–i sell secondhand clothing on @foundobjective, and i'm donating 10% of all of my sales to a black-led lgbtq center in chicago. my venmo is @rosebit, my cash app is $LZS. much love <3", "kennystgeorge": "Photographer whose bulk of work consists of corporate/company events and activations...a booked event that would have secured close to 8 months of expenses was cancelled about a week and a half ago and the photo studio has been closed as well all due to CO-VID19...Venmo: @kstgeorge87 / Cashapp: $kstgeorge87", "apaupersguide.health": "@heysnousha", "tierraisnothome": "Venmo: Tierra-Murphy I’m a PT barista/ FT student. I’d really appreciate any help.", "ayetash": "@craneconfections 🔥🍪@craneconfections 🔥🍪@craneconfections 🔥🍪 😋 💦Black/Queer/Transgender owned Edibles!!!^^^ they ship!!! 🌙", "yzabeya": "$yzabeya", "nuriahunter": "CashApp = $NuriaSerene", "elvin_soe": "cashapp: ElvinSoe", "alnnareidhair": "Venmo : @alannaereid", "ahopper95": "PayPal lexy9495@yahoo.com ❤", "abena.amoah": "CashApp:$AbenaAmoah/Venmo: Abena-Amoah Counselor at a NYC public school. Thank you🙏🏿", "nomadicgriot": "Venmo: @roni-bynum Cash app: $RoniBradley", "akacleo": "Venmo: CleopatraK Cashapp: @akacleo Good luck to everyone struggling 🙏🏽✨", "zi_3.14": "$ZiTerrence", "0castle5": "Venmo @ Alegria-Gray", "skyecierra": "Venmo @SkyeCierra Cash app $SkyeCierra working in the restaurant industry & now filing for unemployment", "loveandlisa88": "Black business owner! $LFree28", "taryncarterphoto": "Venmo @taryn-carter", "copywritebrown": "I’m grateful for any support - Cashapp $yrbrownvirgo", "queerdoulas": "Thank you so much for this, @ihartericka! So important! We are supporting direct, P2P funding for queer full spectrum birth workers. 🌈❤️🌈", "mexed_beauty": "$akeylamonique (cash app)", "thenetworkking": "Cashapp: $TheNetworkKing Venmo: @TheNetworkKing PayPal: brandonDalexander@gmail.com", "leonetha": "Paypal: thesarahwhite@gmail.com ❤️💕❤️", "forbronte": "Sustainable fashion designer. All of my vending and pop up shops have been cancelled so I have no money coming in this month. Cashapp: $brontelaurent", "sodiumandgomorrah": "venmo @Andrew-Stock-4 🙌🏽🙌🏽🙌🏽", "ninetysix.jpg": "$ChloeWallace", "jocelyn.belle": "Venmo: JLB19 Cash app: JoceLBelle", "jazminelovine": "Paypal: Jazmine.L.Hayes@gmail.com Venmo: Sendmemoneyy  I’m a teaching artist and muralist and my lined up gigs have been cancelled. I see many of my fellow people in the comments. Stay strong. Keep your head lifted. Those who can help, please help. Blessings to you all.", "angelyeldell": "$AngelYeldell", "imkakes": "SeaMoss gel available! Follow me at @Imkakes or @kakeshrbz !  Keep your immune system up babes. Shipping available $kakeshrbz cash app", "ashleysimpo": "$asimpo", "bela.with1l": "Although I'm not in a position now to donate money to my LGBTQ+ family, I offer my support to help those of you looking for additional gig work during this time. I do gig work on the side of my full-time job to help fund my medical expenses. I understand this struggle for so many of us who rely on income streams such as these that lack protection against difficult times. Please DM me and let's discuss how I can support you (or just chat, if you need a friend to lift you up). I'll do my best to help in any way I can. ❤️🌈🤗", "geronimoknows": "Cash App | $AllTheFlyKids⁣⁣ PayPal | paypal.me/geronimoc⁣⁣ Venmo | @GeronimoCollins", "andreacadriel": "$AndreaCadriel", "chris_maffews": "cash app $chrismaffews venmo chrismaffews", "arianna.jadex": "School has me displaced in all aspects & is not even refunding any money😔😔😔 PLEASE cashapp:💲ariannajade", "amarisarts_": "Cashapp $AmaniAmaris", "danibedoingstuff": "Cash app: $dani36r26", "tsedaye": "@ayana.m.evans @domduro", "djshegotsoul": "Thank you so much for this platform. https://www.paypal.me/zazaspaintraining Struggling to survive at the moment.", "dejanayrichardson": "Cash App: @dgrichardson1 @dgrichardson1 Very unemployed atm and need a pick-me-up if you can. Tysm!", "rajaiah_": "My job is effected due to cancellations all over the city and I have loans I’m about to start paying when I graduate in May. I’m not even having a graduation because everything is cancelled 😭😭 Cashapp 💲rajaiahh 🙏🏾❤️", "minqlikethecoat": "paypal.me/spencerlcarter", "fckrenn": "$thefruitfulfairy ! ☘️🧜🏾‍♀️🐚🌍💕💓", "ericakaane": "venmo: ericakaane cashapp: $ericakaane", "bambz_v": "$brianvalencia1221 cash app! Work in hospitality and the travel ban on europe has stopped all of NYC. Thank you 😭", "slaygodlia_": "I am a makeup artist that is on the verge of being unemployed. Work is extremely slow with only a handful of clients these past few weeks and probably will not be able to work due to the malls possible shit down.I picked up a second job only for that to get shut down as well. Anything helps Cash App :$MaliaClark PayPal: malia.clark21@gmail.com", "its.just.remani": "Cash app: $RemaniLizana", "elijah_dol": "Venmo :@elijah-dolan I’ve had a ton of photo jobs fall through because of the virus and my 9-5 wont let us come in..", "brinutbutta": "brizzyb6624 This would help a lot🥺", "chronicallyliv": "@bela.with1l", "chadtrotman": "I am a student at LACC studying music production and a music teacher aswell. And with CONVID in play, my check as been delayed for another month. Any assistance would be much appreciated @ihartericka https://www.paypal.me/ChadTrotman", "imanadione": "Paypal: i-dione@hotmail.co.uk 🖤🖤🖤", "melian.j": "PayPal: melianjunius@yahoo.com Cash app: $Melianj Venmo: Melianj", "laceyt": "Cash app: $NBLT both my home business and part time job have stopped due to corona and serious medical issues.", "obsidian.asmaa": "Asmaa-Amadou!! Thank you", "tlonnellv": "$virgilterance", "laurenpierce_designs": "Venmo! @lauren-Mckenzie-12 single mom two kids one with autism and it’s about to be a dry long couple of weeks.", "lucidjason": "Batninjabw13@gmail.com", "3xeyes": "Venmo @Strawberryzombie1 cash app @sydneymiller88", "tacobell_dsl": "Venmo @tacobelldsl 💕💕💕💕💕 PayPal.Me/tacobelldsl", "moonclit": "venmo- moonclit / cashapp- $moonclit", "sadicka.inc": "https://www.paypal.me/SadickaArthur", "kiss_mypaige": "I work at a cancer center and they’re forcing us to work part time to minimize risk and spreading. Fighting to work remotely but my job “doesn’t require” work done remotely. Cash app: $Paige0418 Venmo: @ Paige0418", "pizza_planetarium": "Venmo: waliuigi420 Cash app: $kychild", "st.vie": "dance teacher here! PayPal @ PayPal.Me/ststvie", "thesadgirlsclubx": "Wow so I am officially out of work due to the coronavirus and can use any help, resources that anyone has to offer. cashapp: $thesadgirlsclubx venmo: $thesadgirlsclubx", "shabakaaa": "$AkuaShabaka (cash app) small business owner and set designer. All of my production jobs I’ve been working on for weeks have been postponed or canceled, delaying payouts for months on end. 😭 💗", "shivawolves": "$Justinlr https://www.paypal.me/cousinthai  I am creative director all showrooms are closed", "zora.grace": "Venmo: wildzorangetree Cashapp: zoraaaaa", "nubiaeman4ever": "Literally lost so many gigs in a few days", "dyoungen": "$dyoungen @ihartericka", "baldbae__": "Hey y’all! I’m a black freelance photographer and I’m having a hard tome booking shoots because of the virus. My Venmo is under my husbands name @william-vestal-1 and my cashapp is $WilliamVestal", "vivalacie": "Cashapp: $vivalacie Venmo: @cierra-bri . Freelancers and creatives, you’re all in my thoughts rn! This time is difficult for us but we will prevail through community. 🧡", "smch143cwh": "CashApp: $sopher2000 Venmo: sopher2000", "thealyshamorgan": "Dancer, tour postponed without pay 😭 Venmo or CashApp: TheAlyshaMorgan", "leaveitalonepasta": "appreciate the support! I fill up vending machines in nursing homes and atm they’re not letting us in. So I’m like shit out of luck rn! cashapp $popus777", "williamsii30": "Teaching artist/ choreographer last 2 shows of the season cancelled and all workshops cashapp $TonyWilliamsII", "kaylalaaaa_": "$kaylaimani27 stuck at school☹️", "porshputt": "I'm a freelance professional dancer and ALL my day/sides jobs are now closed because of the restriction placed on business that can hold 500 or more.I have no income. Venmo: @Porsha-Putney", "bajanbrujashan": "Cashapp : $P00HB3AR98 ; unemployed and just trying to get a few things for my 4 month old baby girl 😔💔", "jazzedki": "teaching artist/performer. the institution I work for has closed down and gigs are getting cancelled. venmo: @kenhoff", "cherishnoemi": "Im a part-time worker, but everything is in stop, don’t know until when. Paypal cherishnoemi@yahoo.com Venmo @Liukabycherish I make handmade accessories and sell it @liukabycherishnoemi", "delly_fresh": "Single Mom, thanks for doing this! Cash app: $adele0605", "catdaddaez": "Freelance here deeply affected by all gigs canceled for the month. Trying to stay strong! Venmo @Tajh-Stallworth", "philip_keith": "Freelance photographer $philipkeith", "svartisen": "Queer freelance photographer, trying to ensure rent and cost of living until clients are back in action. https://www.paypal.me/marina424", "aliyahcarmichael": "$aliyassscash", "qimmahsaafir": "$qaaliyahs", "xeke_the_g33k": "Wouldn't ya know it, right after I quit the day job to focus on music and my massage practice. Cashapp: $Xeke", "otbkey": "$leave2019 partner and I just moved across the country. By the grace of God been barely making ends meet and now my partners hours have been cut in half due to shut downs. .", "kelsey.kellyy": "Venmo: kelseykelly", "elleepiphany": "💛🙏🏾 venmo & cashapp: elleepiphany / $elleepiphany", "musique_central": "Cash app: $MusiqueCentral / venmo: DamaniHolland", "grossmirrors": "Cashapp: $grossmirrors Venmo: miracle-stewart PayPal : /grossmirrors", "ausetiri": "$KadijaChristie", "roguegotsoul": "$roguegotsoul ♥️", "barijim": "Cashapp: $jimmywill", "jaisway": "$arionnajai", "aion_navor": "$captaninplanetmf", "p.loreese": "Freelance Brand Ambassador and most of my agencies events are cancelled. $PariciaBenson", "zawadiungadi": "Venmo: zawadiungadi", "caitgreenlin": "CA: $dancecat1 🌹", "binou.bee.cooking": "Private Chef/ Caterer/ all my gigs have been cancelled for the month. My after school programming is cancelled so no additional income through teaching. No income until further notice. Cash app $chefbeenyc Venmo @chefbeenyc", "sasha_sweetest_clarke": "My business is suffering I work for the travel industry Cash App $ChateauClarke", "joycelynlongdon": "PayPal: Joycelynlongdon@Gmail.com ✨🖤💗", "jetaimebray": "Unemployed. JUST started a temp role when this outbreak started and company closed their offices, leaving me now unemployed once again. $ladylair", "theuncannyimp": "$theuncannyimp 🙏", "ronnieheard3": "$RonnieHeard3", "poochiecollins": "@poochiecollins & $poochiecollins 💜", "houstonselitetrainer": "PayPal.me/Hoops4KidsConroe", "jademowens": "Jade-Owens-3 I’m a bridal stylist and we are closed so I am not longer working but bills do not stop coming and has had to stay in my car", "niathomasny": "I am a freelance visual arts model and every school I work for has closed down. Many aren’t paying me for my cancelled bookings and the ones that are paying me don’t know when I’ll get paid 🙃 Venmo: @WearImAt CashApp: @WearImAt", "24inch_reems": "Self employed nanny & wedding planner. Schools are closing. Events are being cancelled. Things are being put on hold and so is my life. I’m also a young single mom so the panic has definitely hit me. Grateful for people willing to help out others, pandemic or not! Venmo-Rhema-Simms Cash app-$rsimms15", "fujinon.jon": "$icvrus", "go.all.ways": "@vancil / Venmo", "doulamorgane": "Pp: Morgane.Richardson@gmail.com • Venmo: @Morgane-Richardson 💕❤️ Thanks all!", "tru.violet": "🙌🏾🙌🏾🙌🏾", "leezajonee": "thankful for this and to anyone who can/will help. freelance project coordinator all of my programming has been cancelled as well as my birthday plans next weekend. 🥺🖤✨ cashapp $leezajonee", "nishea.baebae": "Venmo Shea-baebae cashapp $sheabalajadia 🙏🏽", "saint_oms": "$cashapp: glothdad"}