{"starmagicjohnsonjr": "This is disappointing, but not surprising in the least. Have you heard of @punk.black ? I'm hoping that they can be the 2nd coming of what AfroPunk used to be.", "love.meggie": "@sami_jaax this is what I was telling you about.", "nikajewel": "@shomadjozi I didn't realize Afropunk had changed so much. Is there anyway to engage the organizers?", "bxtchkrft": "@_prissv_", "itsautumnm": "@americahatesus seriously read this!!! Shit is the truth!", "mamabear_aj": "@from.the.jungle", "heliaxo": "@afropunk THIS IS A DISGRACE!!! I’m so heartbroken...", "_renalien": "I'm sad that something meant for POC, or so it seems, has changed into another event tailored more towards white consumption. I've wanted to go to afropunk for awhile but have held off not because I feel like I'd be turned away or treated as an outsider but because *as a white person, I have enough things and places.* it's not for me. So it's really shitty that afropunk has sold out and I'm sorry. You have a following or at least some sway it seems; maybe a new event could be created that's more focused on being truly accessible to the people it's for.", "embracing_evonna": "@organicallycrafted @sahasrara2013 caption 😩", "hrglassbods": "You know before moving to NYC 2 years ago I wasn’t interested in supporting ‘black festivals/events’. As a BW I felt some type of way about my decision but it’s because behind the scenes I’d hear whispers of situations like this happening that never got exposed to the public...the BC still has a long 🤬way to go when dealing w/our own! Why owners like the Afropunk guy are still ‘on his knees’ catering to ‘white partners’ etc...baffles me because in the end the community gains 💩nothing! 😤 from what I’ve witnessed festivals like afropunk & Africa festival(to name a few) will begin to fade out. And we have only the ‘owners’ to blame...they’re shooting them selves in the foot!! #sellouts #fakeconsciousness", "imaquariusjones": "I had no idea this happened but assumed it wouldn’t the few times I saw y’all at Afropunk. I was hoping I was just being a pessimist but I knew that statement was gonna hurt all of the white fragility that was hanging out this weekend. I’m with y’all! I’m tired of leaving my gentrified ass home to come to Brooklyn to be inundated with the same thing.", "kaya.bea": "@lotus.noir tala makambu oyo en kijk gaar story \"fuck afropunk\"", "blackchickwithglasses": "@genres_of_art", "jojo_giovanni": "@pmarcelin", "kuela_d.oracle33": "Take this as an opportunity to create a festival thats better than afropunk where it's not compromised and where it's exclusively for melanated folks who need a fun vacation from the \"others\".", "kiarahagudo": "This is very much appreciated. Thank you🙌🏾", "sativayiza": "@ruthnoemib voilà ce qui arrive !", "labella_diamond": "@simonetherealmvp", "ayaba_vibes": "@bsnacksx3", "talia_charidah": "@shakesummburg @c.w.runkle", "chocoghoulz": "Cant wait to see tons of people with a shirt with the same phrase on it next year.", "embrassemoi": "@eausepareavecdusiropdabricot", "soledadmother": "I love your words"}