{"scavypics": "@shibbybtch", "fons1107": "This is so beautiful. Love to you!", "precieuseaaliyah": "Phenomenal woman.", "kitty_whiskerson": "I’d like to honour the younger me in the moment I decided I wasn’t going to let myself die. The exact moment at 15 years old laying on a mattress on the floor in the only corner of my dingy apartment that didn’t leak that I worked nights to pay for while putting myself through high school. That moment, soaked in my own tears and wanting to disappear, I decided to live and I decided that I wouldn’t just live, I’d make my life something special. That tough 15 year old is now 38 and I’m so glad she lived because she grew into a woman who believed she can and believes that every other queer woman can, and will be great.", "julia__clara": "❤️ So much love. Thanks for sharing this.", "kristenkaza": "Thank you for sharing this! Relationships can evolve instead of “end.” Glad you can still celebrate this part of your history", "muvaglowup": "At least that dress is hella cute 🤷🏾‍♀️💋", "onyxnremy": "The ability to be confused by love, broken by lack of, lost in and eventually found by a shared love that is embodied by 2 spirits agreeing to be interlocked on the same forever journey.", "ms.timu": "❤️", "nakiadivine_": "Wow, Ebony is amazing. I need to learn his ways 😩", "nouvel_amour": "Had to come back and revisit this. ❤️", "demiechi": "I think this just changed my life 😪", "warmfemme": "This post is stunningly beautiful and soul stirring. You are an incredible person 💗", "fracus": "I am 63 and you are a role model . Beautiful words", "nl6013l47013": "💖💖💖", "stillcav": "💪🏾💪🏾💪🏾", "lizzyybyrnes": "wow this is beautiful", "berlinerhanseat": "lovely pic (moment) 😍💞", "thechocolatesensation": "This reflection gave me goosebumps! ❤️ Happy anniversary !", "careyinwonderland": "@johanna.elizabetth I needed this so much. I want to be able to honor and thank our pasts because it brought us to each other. Real love is never a waste of time, not then and not now.", "magicbabyvintage": "My husband killed himself two years and three months ago when I was 7 months pregnant with our third baby together. It’s an important thing for me to remember how far I’ve come and where I used to be.", "neiafromthatnola": "@ihartericka your page is so healing and enlightening❤️", "shan.sweets": "Wow I'm in a mental and spiritual transition with love and I needed to see this so I can evolve from the hurt I have experienced, let it go and fully move on. Thank you for this😘", "makirollofficial": "Thank you for this.", "shaywritesforthem": "Wow... thank you for sharing this... I still have major shame over my divorce. I appreciate the vulnerability", "sarabaybee93": "What an angel... honestly adore everything about you! 🙏🏾✨❤️", "burlyqbae": "Divorce is by far the hardest thing I have ever had to go through. Thank you so much for posting this. I want to be at this point some day ❤️❤️❤️", "debora_lust4life": "It's a beautiful photo of a beautiful moment. Happy anniversary! 🎉❤️", "kayloverose": "This is really helpful to hear. Thank you, Erika! 😘", "debbiesnacks00": "❤❤❤❤❤", "macchiatomoon": "Yay yay yay I’m so happy for you", "im_nthenya": "Yes!!! Love you, love this. Happy anniversary ❤️", "simonebaileycampbell": "Our journies are so interesting. Let's honor them. Thank you.", "4purppeople": "Thanks you and yup, honoring endings and being happy for new beginnings today! I appreciate this post and how you kick ass openly!", "jtothezenn": "What a supportive loving partner you have❤️", "eschorrlesnick": "This is so powerful", "leeanndunton": "He’s such a keeper.", "julibeanfeels": "This is so beautiful", "williamb8": "Beautifully said❤️ respect the your experiences and grow with them 😊btw This exact photo is the reason i chose Bryan to photograph my nuptials. He captured your day to perfection", "jamilaslade": "Powerful!!! Love this post!", "l_o_u_i_s_e______": "You are such an amazing person 💕", "brooklynstrength": "This is a beautiful sentiment. 💘 your heart is so big 💘", "dreambeyondshame": "Honoring death and ending and grief is often so absent, when really, it is not a failure but a threshold, a new beginning, something to learn and grow from. It doesn’t mean that the grief isn’t real, it means that grief and love and appreciation and sadness are not exclusive, but all welcome and necessary. I’m so grateful that you are able to share your capacity for this with so many 💕🙏🏼🌺", "rasta__vibe": "💛 You’re golden 🙌🏾. I wish I could honor the endings. But thankfully they were learning moments of my own character.", "a.real.girl": "What a graceful, honorable, lovely thing for Eb to say, and indeed for you to post to share. Thank you so much.", "amberhamlincoln": "Thank you for this 💛", "emdiqui_doia": "Wonderfull! Happy anniversary, then!", "lindscathar": "yessss to this 💜💜💜", "playwelltogether": "💔🙌🏽love", "thesaintbabe": "That's so big of both of you. Do it up <3", "_run_fatgirl_run_": "💗", "mad.slut.problems": "❤️😭❤️😭❤️😭❤️😭❤️", "intellectisbeauty3": "Just beautiful...", "shelnutta": "This is a beautiful post, and so meaningful. Thank you for sharing it!", "clout_aroha": "🙌🏾🖤", "marazapan": "Wow. That's super cool.", "thephoenyxqueen": "This is everything! Thank you for your vulnerability and positive outlook! 💖💖💖", "russianvampp": "Now I’m crying 😭", "plumptastic": "This is so beautiful. I’m trying to honor a romantic relationship that grew me up without going back to that person, who was ultimately not The One For Me. I’m not sure I’m doing that so well! But this post inspires me to feel my feelings better, and honestly.", "100womeniknow": "Beautiful words. Respect you for speaking your truth. ❤️", "agentbrainspit": "You are such a beautiful soul. I swear, every time I see your posts, my eyes just well up. I don’t even know you but I feel all the love you have inside of you from where I am. You truly are an angel. Your power , dedication, love, honesty, commitment... it’s everything this world needs right now. Thank you for being so amazing and inspiring myself and many others to live their best lives just be real about life. And thank Eb for being the happiest , silliest spirit and holding you down with all that love and good energy. I truly smile so hard when I see your posts together. It’s like catching up with old friends. 😊 You two are inspirational and I love you. ❤️ Bless!", "alexzandrao": "👏🏼👏🏼👏🏼💛", "halle_hathaway": "This post is coming at such an important moment in my life thank you. ❤️", "micheyela": "This is so beautiful and healing - Thank you for sharing 💖", "yae3121": "Wow, thanks for the teachable moment!", "katienumi": "Bless up❣️ this is amazing. Eb is so powerful. as are @ihartericka", "cherrypipsqueaks": "Wow. What a big beautiful gesture, from the both of you. I'm in the middle of my family dissolving. 5 sisters and an emotionally manipulative mother, now everyone is talking about what they're owed and no one is talking about love. I want to honour those who can be in the midst o pain and still fight to keep their hearts open, even just a little bit.", "rsti0821": "This is one of the greatest things I’ve read on the Internet. Thank you for your words", "jeniflower13": "@ihartericka this gave me chills. To honor the spaces, people, and places that have made us who we are...all of it...is a gift. Thank you for this reminder.", "yesaurielle": "This is amazing. I love eb's navigation of intimacy so so so so much.", "kaelakenichi": "Both of you are so incredible and inspiring, thank you for being so open on your journey of life and love. 💜", "_she_is_beauty": "That's some true grown woman Shit. 😉", "ericamichelle.jpg": "Beautiful!!!!", "firstlaedy": "@janee_saniaya @tia_beautyy sooooo much positivity & grace. Wow. Who knew you could honor pain in such s beautiful way.", "lovingbotanica": "💖", "marsfergy": "I want to honor the six years I spent with my ex, all the adventures we shared, and all the learning we inspired in each other. I still wonder if he is my person. Few of my family/friends were around to bear witness to the love we shared, so when it ended, that loved seemed to just vanish and it’s made it hard for me to honor and mourn what I lost 🖤", "lakeishatitwell": "Spoken with so much matureness and humbleness.... love it.", "lucassilveira\nVerified": "Verified", "nicolevscott": "❤️", "aqua_slvt": "You two are the best, hope today is soft and gentle with you 💖", "soulwithbeauty": "I want to honor my ex husband for trying in his own way even though we couldn’t quite work it out. He will always be an important part of my history, aside from the fact that we have children together. He didn’t believe in therapy and didn’t want to go. He did his best from his point of view and I have to respect and honor that, even though I have moved on. Thank you for posting because the guilt can be a killer sometimes.", "prisi95": "This is so powerful. Thank you.", "irischarmsyou_": "The black woman is everything. How was you in grad school, going through chemo post surgery and planning a wedding. You are everything!!!!", "avocadoeva": "this is exemplary. thank you for sharing.", "theepugilist": "Wise words.", "catlehrburnside": "You and Eb are national treasures I swear. I had a short-lived marriage that I always feel like I should brush off, but it mattered and it's a part of who I am. I didn't even know I needed this post -- thank you.", "thefword527": "This is amazing 🙏🏼", "feministfresh": "Never thought about it like that. This is dope. Love you both.", "lisanelsonlevine": "So beautiful. Honoring what has passed. Thank you love for your wisdom.", "lezzielue": "That’s beautiful", "wavejade": "This really moved me. Thank you for sharing :)", "vinvinlives": "That's the level of emotional maturity I strive to be at daily ❤ it's beautiful to memorialize a pivotal moment in your life and to have your S.O. respect it also.", "facebymickie": "This is beautiful and reminds me so much of us @issa_aceboog .. we reached a space where we can talk about past relationships/loves without underlying feelings of jealousy or side eying .. and it’s an amazing thing. Did nothing but make me love you deeper ..and appreciate the good & bad in the past because it led me to you. Our love is progressive and powerful. This made me a little more grateful of your raw honesty.. and how much we’ve matured individually and together . 💖💖💖", "etulee": "Permitting myself to mourn that loss has def been an exercise of self care and self love. ❤️ Thanks for sharing yours so openly.", "sarahsariah": "This made my heart stop. It’s been a year now since I got divorced, sold my home, moved 3 times and I look back on my wedding day 11 years ago. And I still love the memories of that beautiful day. I Love what you said about honoring our past. Thank you for your unbreakable spirit, your strength and your hope! @ihartericka", "sunlightseeker": "You are more powerful than I thought anyone could be 💕 thank you for being strong and vulnerable, raw and brave", "thelocdbella": "I think I just fell in love with Eb a little harder. Y’all just! Dammit... lemme go dry these thug tears. 😘😘", "tender.roots": "What a beautiful and evolved statement to share 💖", "mag_walk": "I got married 4 years ago in August and we split up last fall. Seeing this post gives me a lot of hope and inspiration to honor that time of my life. Thank you for that 💜", "ebnybrownbeau": "Would you do it again?", "trinette_ray": "I love you and Ebony.", "sexualempowerment": "Beautiful to be able to honor it from the other side. And that your believed did too? Amazing.❤️❤️", "addiparedes": "You are amazing and I love reading your words. Thank you for being you 💚✨", "dangertang": "What A Beautiful story. Have you ever heard of hand fasting? It's where they got \"tying the knot\" from. It's a ritual where you pledge to be with someone for a year and if it doesn't work out after the year then you part ways. Kinda reminded me of that with your \"celebration of the ending\" part.", "sasadi": "❤️ love that you honor this. Our past makes us stronger and allows us to become the people we are. It’s not always beautiful and there are many hard parts but the beautiful moments are definitely worth celebrating or at least remembering and paying homage to!", "e.a_killa": "Love this girl. Word!!! Nothing but love and light the universe giving you what you need, when you need it. ❤️❤️❤️💪💪💪", "katesk106": "This is beautiful. Thank you so much.", "rayychichi": "😭 beautiful inside and out!", "gwenniemack": "You are so blessed to have each other", "celestialsunflower_": "You are incredibly inspirational in a myriad of ways. I ended middle school & began high school tending to my mother who had breast cancer at the time. I was her caregiver & my younger siblings part-time parent as my Dad had moved out two years prior (divorce), while still trying to do me at 15. Now at 22, I’m learning to be grateful for my parents marriage and divorce & my mother’s illness in a new light, rather than feel like it took something away from me, it feels like I was given a gift of perspectives. I would like to honor the memory of those days that I felt like I was never permitted to be a child, like my mother didn’t deserve to lose a marriage, all of her hair & two breasts at once; like my Dad was to blame for so many things; though it was some of most dark & trying days, it was the most fertile ground for growth to find the light and gratitude in it all. I no longer blame, or “why me?” days away. Thank you for being open and for sharing. Thank you for making a space for us to open and share. Thank you for being you. Sending you all the love I possibly can thru this lil screen 💓", "roomforthenight": "This is refreshing as hell to read", "myssminerva": "Today would have been my 4 year anniversary, too. ❤️ It was a beautiful day in New York that day.", "hello2katie": "Awww Ebony is the sweetest.", "hannah_mae97": "My parents have been divorced for 4 years. It was a nasty one. I suggested we use their anniversary to celebrate our family. Not the ending of my parents marriage but the beginning of our family!", "sianteuse": "Beautifully said. 🌹", "lizvitale": "Beautiful sharing. Celebrating this with you, as well as my own leave-taking!", "ethereal_moonchild": "Thank you for this. Today has been a weird day of emotions for me- thinking about my break ups/divorce and I really needed to see it from this perspective 💖", "gingerphobia": "@sarahsokolmillinery relevant", "mmiesse1": "This is perfect! Relationships have their time. Just as all human lives do. It's so great to value the current, past, and future of our always-changing relationships.", "corinaluck": "You’re so inspiring!!!! Every fucking day!!!", "eternalegg": "❤️", "theellechase": "Beautiful post. Thank you for this. 🙏🏼", "anniedebg": "E", "wildflower_10407": "This!!! So beautiful thank you for sharing this, I admire you’re strength and you’re truth. Currently going through a break up and this was truly enlightening❤️Peace and blessings Queen!", "youth_seen": "All of this vulnerability and strength. Thank you for sharing and letting us honor with you 🖤🖤💜💜", "hannah_christine96": "Best post I’ve seen today ❤️ And I can agree, “thank goodness for therapy”! #truth", "wmichelld": "💜👏🏽", "lilyazehner": "<3!!!!!", "sarahbixler": "🙌🏻", "shoshannarose1": "How deeply compassionate, tender, graceful and honest. Thank you for this. ❤️", "miss_lopez_if_ya_nasty": "I love the both of you and how raw your emotions are and how you allow yourself to feel them without embarrassment. Eb also is an amazing person. I think I just fell in love with you both. 😍", "emmaluna111": "Honoring the death cycle today. Sometimes parts of us need to die. The trees and the upcoming Equinox into Full Moon remind us. On a systemic level, hatred is starting to die a slow, painful death that will take many generations. But people like you and Eb, people that do and the work to include and honor those that have been hated and abused, are the seeds of new birth that inevitably come after death. Thank you for your presence and your truth. On a personal level, I'm feeling, experiencing, shedding the hatred I was born into. Being a child in a white, Midwestern, small town, I absorbed much toxicity. It bled out of my consciousness, my actions, my words. Today I'm doing my work to help that die. This", "ivycalifornia": "Wow this gets me thinking so much. Getting divorced at 24-25 was really awkward, isolating, and hard. Even dating later was hard because a lot of people didn’t understand getting married and divorcing the way & timing I did but I am finally honoring & learning from the experience and am so thankful for this post. I still think I need therapy & this post makes me feel better about that too", "candiceanitra": "An artistic partnership which lasted for years & birthed some dope music (of which I am still so proud). There was no resolution though my once partner communicated that he loved & respected me but didn't want to connect for personal reasons. Lots of love poured into the collaboration & I learned a fuck turn about how I used my relationships with black men to validate me & over compensate around unresolved shit with my emotionally absent father.", "honourdrew": "Wow!!! Thank you for sharing!! Love this message!!!", "luminarynails": "So meaningful!", "jendawsonart": "Gratitude is everything.", "sex_novelist": "I want to honor the memory of my friend Charlie. He was an awesome man and would give his last dollar to a stranger. He was killed last year by a drunk driver and it has been hard for me to not be bitter.", "spelledbrittany": "i really appreciate these words. Thank you for being such a light.", "bark4kisses": "💓💓💓💓💓💓💓💓 Beautiful", "mary_glenn_aka_mom_mom_": "so thiiis Ellen Degeneres wana be is the reason you hate white people. makes sense now.", "msnaluyima": "Gaaaawsh! Can I say you looked amazing? Incredibly so considering everything you were going through. Queen", "butterflews": "Interesting idea on honoring the end of previous relationships. I hardly acknowledge that they happened with my SO. Sort of a he-who-must-not-be-named dealie. @khaleeefa fodder for Club?", "mama_cook": "This is so beautiful and I love Ebony even more because of how amazing they are to you! #dreamcouple", "lifeofchrissy": "Your transparency is just beautiful ❤️🙌🏽👑", "trainlights": "So sweet of him", "rencocofeid": "This is amazing.", "choosing.amy": "Wow, I think that made ME fall in love with Eb a little more! 😭", "babyface323": "thanks for sharing love. deff needed this 💓", "photosbybrenda.trinidad": "I love all of this ericka. Xo", "argen.tinx": "Your heart definitely pushes me to keep learning and opening up to the universe. Thank you for this. 😊 As Eb said, happy anniversary.", "dra.johannam": "Beautiful thank you for this.", "taashamac": "Wow, this is so inspiring! You are such an amazing person. How do you do it? This is something I’m currently struggling with myself, honoring my and my partners memories without allowing mixed feelings and awkwardness to override. Thank you for this! ❤️", "1900jezebel": "This is beautiful", "stuzoclothing": "LOVE THIS SOOOOO MUCH!!!!", "otasha18": "All the way from the warm and sunny Caribbean I want to say THANK YOU for sharing this and making me feel all kinds of goodness and even more warmth and sunshine. More blessings to you! Ashe! @ihartericka", "kaylajensenaharlan.me": "Such a beautiful thought. I really honor your words. @ihartericka", "beyondyourdefinition": "Wow thank you for this", "godhelmuniverse": "Ebony is truly one in a million. A real man. Hell, a real human! We could all learn from his example.", "neauxla_dawlin": "I honor it", "ccynhen": "You are everything! Thank you!", "khadijaknowsbreast": "Wow beautiful.", "drpierreisme": "Learning to honor the end of relationships and love lost allows us to honor the love we want. I learned this lesson the hard way, these words helped remind me that pain doesn’t last always...LOVE DOES ❤️", "mrschachkes": "This is so humbling and beautiful as are you.", "queen_wilmah": "Wow just wow", "safespaceforwomen": "Beautiful photo, even more beautiful words. ❤️❤️❤️", "deliabrown": "❤️❤️❤️😍❤️❤️❤️", "kacimial": "❤️❤️❤️❤️", "thewarmfruit": "Whew. This. It’s beautiful and honest like most things should be", "flychk1913": "Wow honoring the ending. My journal entry for tonight", "jan.l.bee": "Beautiful 🖤", "sarobi007": "Beautiful", "missparker50": "Beautiful 👑", "teamwoodnote": "💛", "fromthesoil_tothestars": "Oh, I am taking this so deep into my heart!! I am honoring the ending of a magical and beautiful relationship today, and until it no longer hurts. Thank you for this empowering and fresh perspective @ihartericka !! Happy anniversary and blessed union with Eb💜", "barraderiche": "What a wonderful post <3 so inspiring!", "urbanbuppie": "Ugh. This is so vulnerable and real. Thank u for sharing all of you. It’s healing sis", "madelines_mantras": "Thanks for sharing Erica. So well written🙏🏼❤️", "2wokegurlspodcast": "This is beautiful.", "therealfunkycolemandina": "God this is so advanced, and never occurred to me as a possibility. Something to truly consider for self-healing if nothing else.", "_melody_9518": "❤️❤️❤️", "littlemsjessiesue": "Phenomenal 🤘🤘🤘💕💕💕", "lakecia_hammond": "@raychoyo", "justinebursoni": "This is beautiful.", "big_leafmaple": "Powerful! Thank you! 💜", "kristilynnshort": "We should be able to honor our past loves even with pain. If we didn't we wouldnt have our current love. You're amazing!", "afrocenchick": "Y’all are such an amazing unit. Happy anniversary sis 💕 and shout out to Ebony for being Ebony!", "bde.veaux": "That’s so beautiful. The relationship the two of you have is so rare, but so pure and true . Thank you for this ❤️", "followthelita\nVerified": "Verified", "not_a_girl_enby": "Glad to see people honor their divorce 🙌🏾 mine was abusive and domestic violence situation but I celebrate the hell out of the divorce and marriage cause it is healing to me", "alexandramcgonagall": "This post is amazing. I honour the mostly amazing time I had with my ex and the joy and love I got to experience because of him.", "cocolayne": "❤️❤️❤️", "gillsaks": "This!!!! Thank YOU and EB for honoring love and memory and history and grace. What a gift this post is and what a gift you are to us all 💛", "jspoteveryday": "I'm going to run with that. Honor the ending of a relationship. Thanks sis.", "danikabrysha\nVerified": "Verified", "getcorinacorina": "Thank you for sharing that! These are precious moments in our lives that often get tainted or tossed aside when things don’t turn out the way we’d expect. And you do look beautiful bald!", "gathonimwaura": "You're the most gracious being😍😍😍!!!!!", "stormbutlerhall": "I was thinking of posting a break up post, me & my girl were together 3 years and still can't seem to let go quite yet but want to commemorate our lives together!! Love this post!", "sammyjorocco": "So beautiful said ❣️", "labruxapg": "I learn so much from reading your words everyday. Open heart and letting light in at its finest. I honor you today (and always). ...and, Eb is a m@gical star.", "bananabenny": "I always take the day I lost my first pregnancy to reflect and remember my journey to motherhood. I think our society sells a narrative that conception/pregnancy/motherhood are all the most natural things a woman can do and so they come naturally and simply and elegantly. It took 2 years and dozens of invasive tests for me to get pregnant and then it was gone. I think I almost mourned the loss of that idyllic narrative as much as the loss of the baby. When I got pregnant again, I was so afraid and sad and still grieving. And then I had my baby and spent months trying to connect and feel that lightning bolt of love everyone tells you you’re supposed to feel. I realize now that my love for my child came like my love for my husband. It built as I got to know my baby as a person and now 2 years later, he is the light of my life. Anyway, I take that day every year to remind myself that letting go of narratives, letting go of the “should,” is painful and in its own way a death. But from that can come the biggest love.", "boisquire": "I needed this so much today, thank you.", "kingtexas": "🖤🖤🖤", "dirtylola": "I am trying to do that now. I don’t want the messy pettiness that it can turn into. I also know that all I can do is keep my side of the street clean. It has been hard. Not fighting back or being mean each time I’m hurt yet again has felt like weakness, but I’ve realized that the easy through this is to fight and give tit for tat. It takes strength to move through this pain and the carelessness of those around me with my head held high and eyes on the light at the end of this dark tunnel. Thank you for being a guide through all of this by sharing your journey through the pain.", "drea_dnur": "Incredible.", "maggielattrace": "This is so beautiful❤️", "vanitybeauty_aly": "I needed this today. Thank you!", "steviebonbon78": "I learn so much from you! You and Eb are so lovely!!!", "halfbreedhippie": "I love you ❤️", "sgardnerstyle": "Yes friend. Divorce sucks. They are painful and completely devastating. I love that you and Eb both honored an important part of your past in this way😘😘", "smlacy": "Ohhh I understand this so well ❤", "spottiehottiedopalicious": "😩 tears! Real tears! Ebony is one of thee dopest people ever!", "ladybacktoblack": "Thank you for being so open and honest. I am still dealing with a breakup and I hope to be as gracious as you someday. I am slowly getting there but it is a long and painful road. Thank you for being so candid.", "bridgetbadore": "Wow ♥️", "bc_noir": "@jesslynblue this is so beautiful/interesting", "w3irdo_supreme": "This is so real.. this is so Beautiful 🙏🏼... Thank You...", "me_again_gb": "💕", "0hs0flii": "now this is true healing", "dalyblueart": "Wow I needed to read this", "maryjane_spliff": "Beautiful", "nathanielacole": "Thank you for sharing", "deadnettle": "damn, that’s powerful- needed to hear it. thanks for sharing.", "lunebjorn": "Thanks for this. Remembering good times with a friend who's grown apart.", "abbamarei": "Jesus. You out here giving me hope and light with my own bc diagnosis. Thank you for your generosity and continued work.", "singingcello": "Oh this is absolutely beautiful. Thank you for this — your words are hitting home extra hard right now. 💜", "whitneyt27": "This is so powerful - and Eb is out here being the man of all men with his ever so thoughtful heart. #myeyesareleaking", "amanda_trusty": "Thank you so much for sharing. What a beautiful sentiment, allowing ourselves to celebrate what has been, even if it’s over.", "fi_mad": "I love this. I have only allowed myself to be in two relationships and they were both incredible people. I could never be with someone who bad mouthed or looked badly at my past relationships as they are a part of who I am today. So lovely to see someone honouring a past relationship rather than slating it as we do often see.", "bethditto\nVerified": "Verified", "yoguibrownesugah74": "This here gave me more inner strength. You humble and magical soul. 😘🙏🏾", "jonezen_": "I’d also like to honor my marriage and subsequent divorce. It’s a shame that there are no real rituals for hard things like being a post-partum mother, going through divorce and many other forms of grief and loss.", "wanderandwhimart": "Now that is a magical, beautiful, unicorn of a partner ✨", "sianaarrgh": "💛💛💛💛💛💛💛💛💛", "newsiespaper": "You could write an incredible memoir", "cmcc.pickens1": "What a beautiful post! Thanks for sharing ultimately raising awareness to an unnecessary issue. We should celebrate find the silver lining in all life experiences.", "andreafer.03": "@daliaxox", "speakgirl360": "Whoa!!! As a woman facing her 2nd divorce and feeling the way I have been lately, this means so much to me. So much healing in ur words. Thank u for always being open and real. Thank u for ur words.", "t.c.ndc": "Wow! Thanks for being brave.", "gallifreyalily": "“What black person doesnt look good bald?” THIS IS SO TRUE! It’s the cheekbones and the confidence that black woman have that makes them absolutely rock anything. I adore this post. Happy anniversary, well done for powering through the chemo and everything else life has thrown your way 💕", "orchiddelerium": "You have a wonderful perspective on what could be a very bitter point in life. Thank you for sharing, always💙", "darknsoulless": "You're so fucking beautiful", "stephi_badu": "❤️", "slandorta": "This is amazing.", "fishwife96": "@theeggpoacher how gracious i am re ladies", "iara.kaiser": "What beautiful words, and what a mature and incredible outlook on life you have, you and Ebony. I love you both ❤️", "the_blonde_abbydoll": "😍 this is beautiful!", "alto_acumulus": "Woooow!! Ive only recently started following you and am soooo glad I got to see this!! This is such a beautiful photo, and omg, the fashions!! 💜✨", "reflectionperception": "Powerful. Thank you for sharing and thank you to Eb for giving us an example of how to love, wholly and beautifully.", "theplussizequeen_": "Love this 😍😘", "blauren._": "@lovieolivia thought of you. 🦋", "trillestshadeofblue": "Agreed ✨💙🙏🏾 bless you", "morganleighw": "This is amazing, thank you for posting.", "mcyd": "I never comment on anything, but as someone in the middle of a divorce and grad school this post was a true gift. Thank you", "brekfast_at_tiffanys": "Yes to all of this... definitely something I needed to hear today.. you are so awesome 💙", "alixgerstein_pilates": "Beautiful Erika.", "ra__wr": "This is beautiful ♥️", "shanteparadigm": "So beautifully said my sweet friend!", "aceyogala": "You have no idea how much this post means to me and what I’m going through currently! Thank you! Maturity, at its finest indeed @lenawaithe ✨🌊💕", "miz_bayou": "Thank you for sharing this ❤️", "chericlouds": "that’s really cool. everyone pay attention to this! 💘💘💘", "lexxorrr": "This is so beautiful. 💕", "modernmermaid": "Today was also a (previous) anniversary for me. I needed this message. Thank you for your beautiful testimony 💞", "nassynaturals": "What a beautiful post, I am inspired an educated by your page daily but this post truly speaks to me. Thank you for sharing!", "jypsyjeyfree": "All of this", "angelica8pace": "Thank you for sharing this! 💜💜", "itsjacksonbbz": "Thissssssss", "priscellajaen": "Amen. Love is beautiful in every cycle!", "extracrispypls": "Wow. Thank you for sharing.", "katerimorton": "Thank you for sharing this. I'm so glad you've found a person who celebrates all of you, and all the things that made you. 💛", "jewellouise_": "You are so inspiring and motivating to me on my journey towards becoming a better “me”. Thank you for being you in a time where being true to oneself and others isn’t valued as much as it should be. 💛💫 I haven’t started honoring a memory that I once considered my most painful memory. But this post has encouraged me to start seriously consider doing so.", "jimanekia": "Love you boo", "imanisasa": "This is the most beautiful experience I’ve had on insta in a long time. Here is to less devastation.", "artreel_": "That last statement! 🌻Like shit", "roxie_rogue": "Wow. This post is amazing", "blacktranstv": "GROWTH ⚔️🖤", "michelle_guash": "This is so beautiful ❤️", "sophie_antoun": "You look so beautiful Ericka!", "lisasaidz": "Thank you for sharing this ❤️💪🙌❤️", "lauralushoc": "@ihartericka the truest love is allowing the other heart space to acknowledge significance in their journey thus far.. #EbbsaKeeper ✨❤️✨", "nuffintoofancy": "That floral crown though 👌🏼", "veruca88": "💖", "weirdorwhatever": "This has me in my feels💓💓💓love yalls Love!!", "_nique_dom": "❤️❤️❤️", "brightdollface": "Today I have therapy too sis! @ihartericka Thank you for this post and space to share!! xoxo 💕💕 Today I want to honor that in 6 days it would've been almost 13 years together with my ex fiance from childhood who I left due to it being toxic and him abusing me as he then became an addict. I'm a domestic violence survivor and today I want to honor that my experiences and pain shaped me who I am today despite the abuse. I had the strength to walk away for me and love myself more and so I want to honor this today. 🙏🙏🙏❤❤❤ blessings to you sis thank you.", "wrighh.ter": "Wow. The testimony in this is huge. 😭🙌🏾", "sayuhmandaplz": "I love this caption so much and it is so true. I agree. @jennas_world", "sierradub": "this is everything I needed today. Thank you💕", "andriabenet": "❤️", "luckylocs": "Wow. Thanks for sharing.", "hanibee.a": "🙌🏼", "slanglotz": "That’s a beautiful way to not ignore your past. Milestones from past relationships and what feel like past lifetimes can be so triggering. Lovely to see a good story embracing it. @xwives.club ❤️", "outerspacytracy": "👏👏👏👏👏💘", "virgietovar\nVerified": "Verified", "theannehodder": "🙌🏽 👏🏼"}