{"theechocolatebunnie": "Amazing!!!!", "morgs1127": "AND you live in BK, where I reside, so that’s just even more awesome 💯🙌🏼", "eileenybeen": "I love you🧡", "steph.l_photos": "So beautiful 💕", "stealth_asian": "@zuleika_sheik this I'd Ericka, I was telling you about her tonight!! Check her stories for her and her partner's podcast, it's BRILLIANT", "yogacandi": "Such powerful and true words, and you're so beautiful inside and out thank you for sharing angel ❤️😊💕", "veronyyogalife": "This Is so beautiful", "secretultram": "🙌🏽 Yes to everyday consent!", "leenagjoka1114": "WHY DOES THIS HAVE TO BE SO BLACK AN WHITE? 🙄🙄🙄🤷🏻‍♀️", "tonie_burke": "Divine xx", "z_sweet_evey": "You are absolutely gorgeous!!! 💕💯", "coraliejames_art": "I'm very sorry this happened to you. It's totally not ok for a practitioner to do anything to you that you haven't asked for or given clear consent to. I had a naturopath suddenly 'crack' my neck using a jerking action like a chiropractor. She was not a chiro, I prefer not to get chiro, she gave me no warning, I expected advice about herbs not physical manipulation. I told her to stop immediately and take her hands off me. I was quite young at the time but I knew she should have told me her plan and got consent first. Totally not ok. Your body. Your choice. I don't care what they think is best. They have to ask first. You are so right. Consent. Always.", "_lady_light_": "White acupuncturists are slimy. Appropriative trolls.", "aqsassyy": "Beautiful🔥", "capricornwoman_": "@hoolacarola", "smooveoceanskai": "May I share this to my story?", "paulineemiliesommer": "This is so beautiful", "matt_taxi_69": "What was the point of this story to highlight who was white and who was black? You could have had a powerful message about consent but you loose it in your race focus which is 100% irrelevant when dealing with consent.", "xxkayelzxx": "You sound so bitter honestly", "madalynalina": "Yes! Yes to consent, yes to doctors offices, yes to having informed practitioners.", "molatlhwes_child": "@mindless_lee isnt she beautiful", "murphydunn": "gorgeous gorgeous woman", "thegoldengrenadine": "I actually had the same thing when I went in for a massage and accupuncture last week. It was the day before my wedding and she said \"I'm going to do cupping on your back to get rid of the tension but it'll leave little marks so I won't do it too high up\" but I was like \"I'm not sure I want that as I never came in for this\" but she did it anyway and it left some big old marks on my back which are visible in my wedding photos. Like, why pressure people into things? Just give them what they came for and be done. Glad it got rid of your cough though and you are feeling better", "cancer_dr": "❤️❤️👌🔥🔥🔥👌👌", "xxblove": "Wow! Your courage, 💪🏾strength, & ability to find bliss during a traumatic/ dark time in your life is absolutely inspiring❤️ God bless you Queen ❤️🙏🏽", "balinea\nVerified": "Verified", "gritglitterandgrace": "I Looooove this! @riversshirley", "ulovearw": "So I was literally in Canva making a post for my next journal writing prompt and decided to come to your page to see what was new. Please let me know if you mind my usage of this photo. Two things: your detailed experience is what others go through on a regular basis and their voices aren't heard...countless times...and it makes peiole cower back when someone just tells them what is going to happen...power and right to choose is taken away...just as you mentioned; with our hair, our bodies, our belongings. Consent definitely goes beyond sexual bounds and thats a huge message people need to hear! 💜💜", "meowizzza": "If it's okay with you, I'd like to repost this in support of breast cancer awareness month 🌹", "natural_onyx": "Yes so much in this society that we don't really consent to it's ridiculous", "astridisfamous": "Omg I saw this forever ago I can't believe this is you and I met you!!!!!!, 💜💜", "eve_jamami": "😍❤", "bwheeler3481": "This is sad. Making it a #white #black thing. In my opinion you’re not helping anything or anyone. In fact it seems like you’re interested in starting drama. You went from not being comfortable with the mannerism of the “white” receptionist to being at ease by simply seeing the Dr was black, then morphed your “no consent” cupping experience into a RAPE issue. How? @ihartericka why? My next thought is, what you be saying if the Dr was a white human. From my end of this world you’re very privileged to be seeing an acupuncturist and to be validating yourself by picking apart the process is a sign. If you didn’t want the cupping you should have straight up said NO. If you need to be heard, we hear you. Still sad to see the step backwards in one love.", "_rainbowroads_": "💟💟💟", "wildberryautumn": "That last point - practicing consent in everyday encounters - really hit me. Thank you for sharing! 💗", "blackgirlinom": "❤️", "motivatemewellnessbox": "Great post and reminder about consent!! So important for people to remember consent should apply to all aspects of life! And on another note, this image is beautiful!!❤ would you mind if we share it on our page for breast cancer awareness month (crediting you, photographer and MUA)?xxx", "choosing.amy": "One theme of this evening’s therapy session was exactly this. Not just in physical and sexual ways but emotional as well. My therapist called it (of course with the disclaimer that it’s not to take away from sexual assault) “emotional rape.” When emotional safety and personal agency are violated. Happening chronically, to the point that one loses or is unable to develop a sense of self and boundaries, not knowing where one ends or begins. It is a pervasive societal/cultural issue for sure.", "amy.zell": "I would love to better understand your perspective on why white people shouldn't practice acupuncture. Could you tell me a bit more about that?", "kazoodelee": "Thank you for sharing your story, I thought I was alone. 💚 I had the same reaction when I was getting these weird bug bites that would swell to the size of my palm. The dermatologist I went to decided to do a punch biopsy the second time I saw her (I had no idea what it was even after their halfhearted explanation). I ended up with two stitches and crying in the bathroom afterwards.", "leigh_jewellery": "Informed consent for medical practices and procedures is HUGE. There is such a history (and ongoing, of course) of practitioners tut-tutting women instead of giving them the whole truth and listening to them. And one doesn't have to look hard to find how much more pronounced this is for Black women and WOC (Serena's birth story put this on a few white-people-radars, at least)...", "bellamcpherson9613": "So important!! 💕 Sending you so many good things for your pure soul and important message!", "soaringphoenix333": "I’m so sorry to hear that you had this experience. As a professional healing arts practitioner, I make it clear to my clients every time that they are in charge. And I always, no matter what, honor their requests.", "omgitsalikacray": "You’re absolutely right", "flowersrisin": "I love you. You make me better. ♥️", "sensualsunchild": "Cupping always leaves the worst marks. She knew that, she’s a professional. So sorry this happened to you! Practitioners should always hear their clients concerns especially when your paying them for that service. ❤️🍂🌻 sending you some soothing body love n fast healing for yo wounds", "empowermentensemble": "Thank you for sharing. 💚", "boomerangnika": "why is it bad if a white person does acupuncture", "finalmile.ink": "You are gorgeous. I love this photo and body paint, very well done. I specialize in African African Areonip tattoos, custom colors chosen and applied to match your skin and hair. If you want to see projected nipples again in 3D, with African American areola's to match, I'd be honored if you would consider my work. Also, hot off the press my new publication to help breast cancer survivors: CANNAZINE graphic novel for adults, see Areonip photos... www.cannabisartank.ink", "tattedup_weirdo": "Wtf is up with your reverse racism??!", "kristinbasanta": "Not sure why white folks practicing acupuncture is bone rattling but, I 100% agree with the need for ongoing consent. I'm a massage therapist and I would never do anything a client doesn't want. I tell them that they are in control and welcome to speak up at any time and tell me to stop if they don't like something. Unfortunately, I have heard many stories of massage therapists doing what they wanted instead of what the client wanted and that is a violation and assault.", "dauria": "@molly.always ❤️", "lucikeepsitmovin": "✊🏽❤️", "mjlifestyle": "👏🏾👏🏾👏🏾👏🏾 #practiceconsentdaily", "kcatha": "Yes! Totally agree. Consent in everyday encounters."}