{"tone_police": "Bahahahhaa", "florcyx": "“....but I’m 1/64th Cherokee”", "craftymama77": "@wonderhopey right; I get that. I don't think I understood the post initially, but it all makes sense now. Thanks for prompting me to do a second read-through.", "priest.00": "YOU DID THAT", "phi.va": "21.) Young white people who identify as “activists” because they “planned” their schools ‘March for Our Lives’ bc it’s “in”. 22.) White people who identify as allies/activists because they said that one thing that one time. 23.) White Jews who pull the “Jew card” to avoid addressing their complacency in white supremacy.", "pompompous": "🔥", "frogkd": "Not 100% related since I’m white so I don’t exactly have a lot to say on race that hasn’t already been said, but, the thing I’m getting pissed off at as a trans person is when people are like “wow isn’t it awful what trump is doing to trans people. This administration is really terrifying” and then I’m like “yeah I know, would you like me to give you some info on where you can volunteer or donate to?” And they get all uncomfortable and kinda back out of the conversation. Like okay Sharon just because you’re a registered Democrat doesn’t mean you’re not still cis, white, and documented so why don’t you show those us that you actually care rather than just letting the world know how oh so woke you are.", "damn_the_torrpedoes": "When white women use their biracial children to excuse them from owning their own racist tendencies.", "pheonix_rising_876": "They go vegan 🌱 because it’s cruelty free but don’t advocate for liveable wages for farm workers or workers in third world country", "alannajones": "Reading extensively about POC and WOC and lecturing friends a few beers down (annoying and not productive) but otherwise staying too quiet and shying away from calling friends and family out because of the fear of rejection. Having a ‘work’ (read: white employer friendly) twitter and a ‘private’ twitter where you can be ‘outspoken’ in a space where it makes no difference whatsoever. (These are both me. The first issue I’ve been aware of for ages and have worked (am still working) to change. The second has only just occurred to me now as I read all these comments, and here I was thinking I was doing ok when really I’m STILL working hard to protect my own privilege and maintain my status within the system that benefits me - literally the definition of white supremacy 🤢.)", "ohayitslj": "The entire non profit industrial complex and all white saviordom that runs rampant in the whole damn thing. “But I am saving THESE communities! THEY are (insert deficit language of choice)”. This whole post is amazing and I haven’t stopped laughing . Eb’s costume has me on the floor waking the dead with my laughter.", "superfunkynath": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "_genius_child": "Teaaaa", "m.jeezy6": "@elizlove", "starblurst": "Who was the activist that met with Trump to bail out one person? When I try to Google it only shows up with the $12 Billion farmer bailout :-(", "blackaquafina": "When your job talks about white privileged you hear a white person say I feel attacked 😂 then you have to intervene and say I feel attack when you say the word ghetto like it’s cool nah", "sjr0b": "@yungbobbyflay", "gabreezy_21": "@cindylisbeth__ @flamminhotchelle", "kimmiecorvino": "I’m dying at the 3rd photo just being white Hahahahha", "aminieb": "THIS", "shybuna": "Whew, comprehensive motherfucking list!!", "mx.samsantos": "Calls themself a feminist but looks down on sex workers.", "sarah.e.bowles": "😂😂😂 yasssss the best!!", "whatrwordsworth": "Sharing the same few quotes from MLK Jr on MLK Day.", "jesselyn.jade": "😍 😂 Omg I love you", "jenni_marlo": "I was so confused lmao", "pitterxxpatter": "21. Wants more cis women CEOs or prison guards. Worked with kids of color at their volunteer gig that one time.", "vxnzmxc": "When has amy Schumer been advocate for all women of all backgrounds? Like she’s slyly kinda racist.", "thatangryhippie": "Posts protest pics on their social media without continuing the fight when it ends", "brownblaze": "That’s it, Halloween is done! 😂😂😂 #factsssssss", "wilderbagco": "🙌🙌🙌🙌", "abnormalbeaux": "WHEW SHIT I WAS NOT PREPARED 🤣🤣", "lucyrowing": "@gatsbea BYOM", "hayleywilliams42": "truuuuuu tho", "kshelton": "Says slavery was a long time ago and we should be over it!! Also my favorite “this is not who we are” then proceeds to be complicit in everything that says this IS who we are and always have been", "francis__dot": "@_stillwerise", "sharynaholmes": "I’d rather turn into Thing from The Addams Family than extend a hand to whiteness and agree to forget the past. The past is here today in insidious, evolved forms.", "vallen67": "I forgot it was Halloween and was so confused by your shirt!! Then the quote. And then I finally was like “ ohhhh!” 🤣", "_zoe.c_": "@sustainable_humans_being", "elyse.fox\nVerified": "Verified", "kristengmerek": "Thank you for calling these \"actions\" out. You are inspiring me to continue to educate my community and strengthen my awareness as an ally. The ego of white feminists can be \"powerful\" but you snapped that bull shit right in half.", "muchachafanzine": "THIS!!! 🙌🏾", "bethazon": "Thank you for this ❤️", "kariri.lee": "this entire post+comments has me checking my entiiiireeee self thank you!!!", "gaytheglowinggray": "21. Praise other performative activists for doing next to nothing", "mm44rrzz": "Really loves Obama", "preezilla": "Omfggggggggg stop 😂😂😂😂😂", "necia_media": "Yes! May we repost?✨", "mahcheeko": "Screen printing the future is female on tee shirts created by a sexist predator pedophile with known labor injustices.", "vamosqueda": "Truth 💣 💣 I cant even keep up 👌👌", "gardens_n_ghettos": "@activist_hat", "etmafrance": "The Gemini energy around you popped out in this post 🙌🏾", "breebianca": "THIS IS PERFECT 🙌🏽", "lolaslostnfound": "Holy. Shit.🙌🏽🤣😂🤣😂🤣💖", "spiltmilkdotmom": "“ I don’t see color... I only see_____________”", "jplaydoh": "21- Was all “oh my god, did you watch 13th yet?” and is now posting nonstop about registering to vote and “if you don’t vote, you don’t get to complain...”", "ashleylanemuller": "Bloop!", "thepeanutbutternutter": "Self-diagnosed colour blindness", "furiiiosa": "ICONS", "mjs_reads": "@its_shawnzay this costume is like the idea we were talking about but more well developed !!!!!", "sis_of_theyam": "😂😂😂😂😂😂😂😂😂", "nashaka_": "@elzazzin !", "thewaythru": "I want this post and all the comments as a reference manual. 👏🏾👏🏾👏🏾", "deedo_mcnugget": "This is so awesome!", "malice.n.wonderland": "You win Halloween!!!! ❤", "bounce_n_jiggle": "Best!", "bambampresents": "Post selfies everytime they/we hang hang out with PoC", "decolonizing_fitness": "OMG THISSSSSS!", "nowhitesaviors": "Doesn’t understand why they should compensate Black women for their time and emotional labor and feels entitled to demand that we be a personal guide to walk them through the scary jungle of becoming anti-racist. Centers their emotions and how “hard” it is for them to realize their role in perpetuating white supremacy.", "unravelpodcast": "Amy schumer sucks #sorrynotsorry", "hazelgems25": "That might the only smart thing Amy Shumer has ever said.", "vseugenio": "Yes, yes, yes to this post and comments!!! 💖💖💖", "islander_georgia": "Can someone please explain to me what is problematic about the “this is America” video?", "whatailsyoutraveler": "The fact that the third slide is just plain whiteness is probably the funniest joke I've seen on Instagram in a while tbh", "darknsoulless": "Ooh that's a good one", "drag_them": "Im gonna drag 20 year old ignorant me with box braids and quote myself “my friend did my hair, and she said it’s not a bad thing, and she’s black”...thank god for continual growth", "liagutierrrez": "Writes “still not asking for it” on naked breasts for Instagram post or protest march, but doesn’t quite know how they feel about rape and violence committed against sex workers, “because, well...... it’s inherently exploitative, right????”", "pansy4pansy": "This is hands down brilliant", "parkhere": "@ocfoxy", "_mysticbitch": "So real. Thank you for this", "lexrosenbaum": "@hankspocket", "i_am_the_wallrus": "@harilaoud how great is this", "croyster912": "Says very racisist comment then says but I have (insert race) friend's", "pettiforerin": "@gabbaccino", "flowerboythriving": "\"black people love me\"", "feminine.fire": "Praises Nike for their Take a Knee campaign/ blm, while Ignoring Nike simultaneously benefits from slave labor and capitalism", "wavywednesdayyy": "😭💗 Ugh your mind", "commandofitnesscollective": "This is EVERYTHING and I wish a MF (WP) WOULD dispute it lol", "mollylovern": "Advocating against sexual violence but not talking about white supremacy", "prettyinpunk.co": "\"Every purchase of some #blacklivesmatter art from my white owned small business, drawn by my white ass, helps raise money for black people. Yes I give a solid 5% of profits, keeping 95% for myself. But y'know I'm raising awareness... [of white supremacy and how pervasive it is]\"", "lkwood83": "Plans a \"protest brunch\" @hskohn47", "mulattocosmonaut": "@cpowe24", "beemrandi": "21. Say they want black women to help \"educate\" them but get upset when those black women request funds for their time and effort. Also saying yoga quotes but not understanding points.", "abbyfgarland": "What does #16 mean, “we need to follow black women”?", "hopscotch15": "That second picture took me down. 🙌🏾", "daphne_crane": "YES", "barefoot_bella": "Nike", "_steph_84": "Wonderful human!", "beeolson44": "21. Raises money for \"the less fortunate\" but also tells you to watch out for \"those sketchy people\" on the street.", "alli.flute": "you are an inspiration. i am in awe of you 🙏🏼☀️", "the_dollyrose": "21. has a lot of real strong opinions about black folks and our use of the n word... #whoaskedyou", "nubiarae": "I wasn’t ready for bae’s costume 😂😂", "exorcisecaution": "Says you're exaggerating when you say you could die without access to resources for your disability/illness, like when you say you could die without access to single use straws (I was once on a high frequency ventilator for a week from aspiration pneumonia and almost died. I'm not exaggerating.)", "theenubian": "🎯🎯🎯🎯🎯", "jacq.tran": "*gets called out* \"you need to stop being so divisive.\"", "brendalynking": "Whyyyyyy is Ebony Deray!! 😂😂😩 so good y’all! Love you Erica!! 💛", "tinabelike": "A draggggg", "stewhpeas": "LOL! I love y’all!", "chaalyall": "❤️ This @ihartericka", "themelissadenizard": "21. Says that they believe in “equality” but still thinks that capitalism is the best system", "nancydr00l": "@micmacminaj", "monicayfotos": "Says they support Black womxn, Black Trans Womxn yet are following only a couple of them. And uplifting and get super excited if their fave white feminist speaks out once on an injustice.", "bruja_baby": "I did several double takes on this pic! I was sooo confused at first...you killed it. I’d like to add “tone policing muthatrucka” to this list.", "katerisvec": "Ppl who refuse to acknowledge the ways they've been problematic in the past/continue to be problematic bc their image matters more to them than real activism", "d_photo": "OMG, look @ajkodonnell who does this sound like?!?!?", "wanderinggold": "Constantly shames poc for not choosing to vote.", "mybodywpg": "21. “I’m not racist but...” (uttered immediately prior to saying something racist)", "ssalluzzo": "Calls themself a feminist while chewing on the tortured corpse of a fellow “female.” Doesn’t give a flying fuck about the oppression and murder of billions of non-human females every year through the patriarchal “animal agriculture industry” (which is also coincidently the single greatest single threat to our “Mother Earth”).", "courtgarrity": "This might be a dumb question but is the last image supposed to be just blank? Or is my instagram not showing whatever it is?", "turtley_leah": "21. Sees an interracial family/mixed baby and says “now THIS is how we’ll eliminate racism” followed by some comment that racism will “die off with the older generations” 🙃", "pointychest": "lmaoooo ebonyyyyy killedt", "jendawsonart": "I died. Then Rose from the dead. Lived my life and died again.", "monroepao": "21. Says: “I don’t see color” repeatedly, convincing themselves that ignoring it is the same as healing and actively engaging against racism...", "they.them.ryse": "🙌🏾🙌🏾🙌🏾🙌🏾 Yuuuuuuuuup all truths", "madelines_mantras": "YES YES YES🙌💕thank you for this Erika, you are a huge inspiration to me!", "i.am.caitlin": "21. Is pro-police", "elisabethtrask": "Gladly shows up to the women’s march in pink pussy hat clad, but holds a sign saying trans women aren’t women ***", "frivolous_k": "This is awesome", "sierracreates_": "YESSSSSSSS THIS POST GETS ME", "ziggybombastic": "😂😂😂😂😂😂😂🤣🤣🤣🤣🤣🤣🤣", "heyitsmekita": "Decides to become a martyr and resign from an Anti Violence agency whose employees are all poc excpect the director, uses the reason, “because they are a cis white lesbian but in reality she was just tired of doing the work and wanted a good excuse to quit. But it sounded better to be a Martyr and be in “alignment with racial equity and racial justice values” but in reality was the most micro aggressive and dismissive of Anti blackness", "feelyourmind888": "Is for equal rights but tone polices POC because love is the answer", "scotbot88": "I really want to add to this list but also, while I get the importance of calling people out when they are being disingenuous or when their ignorance is leading to continued oppression or denies their part in said oppression, but at what point does that become counterproductive? I'm not saying there's no place for this but it just makes me wonder if imperfect allies and activists are better than none", "sosylviadid": "💀💀💀👻🎃", "criavolver": "Works for a not for profit but always has side comments to say about their clients who are likely people of colour and poor.", "graciebenn": "21. Goes on voluntourism trips every summer and exploits communities for Instagram likes and in order to assuage their white guilt", "uhhhdele": "Claiming to listen to black/queer/poc/disabled/erc voices but not doing any work to actually engange with them + when they do actually engange w/ them (esp their critics in these communities) they give a bs apology and out themselves as unable to think/read critically", "kaelynrich": "Is perpetually joke-apologizing for their race/gender/sexual orientation with self-deprecating humor which they use to distance themselves from their own complicity in oppressive behaviors: “I’m sorry white people are the worst! Haha!”", "mayaesb": "Is quick to name the synagogue shooting in Pittsburgh as white supremacy but has never engaged with the difficulty of how/when judaism intersects with whiteness, and makes “jokes” about how jewish own all the banks", "slutofthemonth": "This. Is. GOLD!", "permasamra": "*tells people not to vote because the system is broken* never having actually voted themselves because they weren't really a 'political person' until the women's march *grammar polices woc's words esp.* *white woman with dreadlocks teaches a class about being a white ally and charges for it*", "b.nicholem": "“You know, I voted for Obama both times. I thought having a colored man in the office was great.”", "gaiea": "Can you please say more about the “this is America” vid and no. 16 “we need to follow black women”? I want to learn 🙂 sadly I’m not getting those two points 😔", "haileyjustbee": "@iamderay", "tanikaray\nVerified": "Verified", "burdpeppa": "This 💖", "julia__clara": "Yes and guilty @summerrrlyn", "doc_lnp": "Has “tokens” that ain’t ever been invited over...", "hannah.gundi": "Obviously there is a whole lot wrong with this picture (all lives matter, love, saying Amy Schumer said that quote LMFAO) But do you think the pink hats and the “future is female” shirts and other symbols like these are bad because they tend to represent white women who are only per formative activists? I understand you’re painting a very accurate picture of these women but as someone trying to legitimately be intersectional and an ally and as educated as possible, is it dangerous for me to use any of these symbols/participate in marches, etc? Would love to hear anyone’s thoughts.", "isa_bee263": "\"We should just be nice to one another\"", "oshun\nVerified": "Verified", "stephaniemadeit": "\"Give me a very detailed step by step to do list of how I can easily stop oppressing you so my guilt goes away and I can feel good or in the \"right part of history\" 😩😭😠", "baeavery": "is a TERF and consistently stresses reproductive organs in their cutesy feminism art", "betsyruscoe": "@lana.a.a.r I’m SCREAMING they won Halloween", "mx_marjorie_marie": "Sitting on the board of a non profit with hippy anarchist white people who insist there is no hierarchy in the organization when it’s time to give credit and respect to the black women who run the shit and actually engage, live in, and are matriarchs of the community they serve. Liberal racist colonizers who spout statistics about health and disparity while actively preventing positive change in the communities they proclaim to care so much about.", "simransw": "21. “I don’t see race. We’re all the human race.”", "_oro5_": "I love y'all ❤️❤️ tell eb hit me !! @ihartericka", "cbabruzzese": "Buys their pink pussy hat at Walmart...", "nykkster22": "When they say, “I don’t see color.”, but keep an inventory of how many black friends they have. Or when they say they CAN’T be racist because they have or do date and fuck black people🤨😒. You are the fucking 🐐 for this! Here, sis hold out your pillowcase so I can pour all this candy in! 🍭🍬🍫🍭🍬🍫🍭🍬🍫🍭🍬🍫", "corinanh": "This is incredible", "labellemel28": "This is epic 💞💞💞", "annierosen": "Kind of unfair to put a @patagonia vest in the mix, given that they are company that actually does a lot. The opposite of performative.", "futureclown": "Stands idly by as anti-Semitism is spewed Until 11 people are killed in a synagogue -then blaming alt-right ...", "theetee1": "❤️❤️❤️❤️❤️❤️", "galu.dibaba": "That damn Patagonia vest 😂", "galynuhsmeeth": "Free space: Fundraising/profiting off of the traumas of a specific group or community", "apollo7dior": "Y’all woke", "ihartericka\nVerified": "Verified", "bemnistired": "EBONY WITH THE BLUE VEST ALSKSKDKKX", "lumartn": "@kfitzmedia I feel like you’d appreciate @ihartericka", "britbrit.h": "✊🏾✊🏾✊🏾✊🏾✊🏾", "tammakastaley": "As if the shirt “The Future is Female” didn’t day enough for this post! Whoo chile, the accuracy. 🗣🗣🗣", "inclusivelove": "I love you.", "bouncedatashhhh": "@ms_nixon Girlllll the post, caption and ENTIRE comment section is a podcast...or a series 🤔", "boks_creates": "@nfinit3_l0v3_504", "willmederski": "🙌🙌🙌🙌🙌🙌🙌🙌🙌", "goddesstribebuilder": "Gonna add *Post artsy memes about supporting trans folk with lengthy caption /then shame trans folk for making gofundmes for survival and sustainability", "messengerofluv": "how are you gonna quote amy schumer tho...?", "plus_garum_ferre": "Thinks racism started 24 hours after 2016 election when not actually asking “WHEN did this country get so RACIST?”", "theykeepbees": "Also, is white and uses the word “woke” as a self reference.", "spiritual.bae": "Y’all Win 😂 21. Self-proclaimed ally, gets tagged in problematic post by followers. Goes into harmful denial. Blocks lots of folx. Has a moment of self-pity. Desires to make up for the problematic post by shouting out the newest black race educator / activist (they don’t know the difference) that they’ve recently found onto their large white ass platform and this is the extent of their new found self-proclaimed ally ship. Followed by I’m learning, this is hard...followed by silence, and we never heard from them again. FIN!", "assatataughtme47": "Not the blue vest Professor!🤣. But frfr every damn thing you said.", "mayamoonpoet": "Whoop there it is 👏🏽👏🏽", "teamarie28": "Dying!!! 😂😂😂 ‘‘tis the season 👻💀 💁🏾‍♀️", "patience.sings": "I'm sicka yalls!!!! 😂😂😂", "sin_lubricacion": "Damn, im realizing a lot from reading this about my complicity in performative activism. I will do better. Im so sorry.", "itswalela": "Lmfao I love this", "redstring_journey": "👏🏽❤️✌🏽 lol at #18 😊", "witchdenver": "👏👏👏👏🤣🎃👻", "jackieballeva": "21. Has never attended an event, signed a petition, or engaged in any education or general discourse without posting it on Instagram for validation 👻", "datcraftygal": "I just love yall more and more each day 😂❤️✨ This is great! Lmfao", "hersheysmilez": "LMAOOOOOOOO this may be my favorite Halloween looks!", "idabgoodnwell": "A READ!!!! Yes!!!! @mrspersonality5", "styleisstyle": "💀💀💀", "eeelsi.e": "Is ur halloween costume a white feminist? 😂👍🏻 amazing👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "iischristy": "Wowowowowow I’m shook!! 😭😍🙌🏾🙌🏾🙌🏾🙌🏾", "wheelofashes": "💀😂💀😂", "zeeshelton": "“If you want to help end racism why are you so mean to white people? We’re the only ones that can really help you”", "sassy_latte": "I needed this. All of this. I can’t stop laughing, whoopin, hollering, clapping, screaming... ALL THE PRAISE", "choice2bhappy": "Yess!!!", "najma_luv": "@dieguaco", "go_ahead_and_gag_bitch": "I'm Screeeeaaaming 😭😂😭😂😭", "sherrybomb85": "The vest 😭😭😭", "servesage": "Loves black culture but not black people", "yamalo17": "😭😭😭💀💀💀💀 deceased", "naimitaj": "Casts one black person and one Asian in their film/runway show and pats themselves on the back for being Sooooo diverse", "xenia.ranae": "This is iconic 😂 Eb wins Halloween for sure", "ellamig": "@ken__z_", "cocoabash": "100) Grant applications", "fatfemme": "😂😂😂😂😂😂", "suzannecorumrich": "“Voice for the voiceless”", "adriennewhoo": "Will say \" I'm still learning...I don't know enough to day anything... While taking no steps to learning \" Also this entire possssstttt", "rhiannonnewman": "24. Calls themselves an “intersectional feminist” but doesn’t know who kimberlé crenshaw is/still doesn’t include black women in their feminism", "jewel_thegem": "Nailed it 😂", "dayvidyou": "🎉🎉🎉🎉🎉", "loveaprilkae": "Omg this is so amazing.", "kiryat": "💀🤣 Rolling", "carlyarmadillo": "wowwww 😂", "fr.ickk": "21. Thinks because they have POC in some aspect of their life that are automatically not racist", "devriebrynn": "This is fucking brilliant.", "deeeebo_x": "Screaming lmao!!", "slynbutter": "👏🏾", "gracieann_h": "Puts on a panel about “diversity in the workplace” and everyone on the panel is a white cis male (actually happened at my office)", "ekcloudy": "Thinks that because they always vote democrat they’re doing their part.", "journeyswithjenna": "“Have you read The Secret”?", "mashapastukhova__": "21. Dates a POC as a white person and asks their permission to say the N word.", "princess_teelynn": "😍🔥🔥🔥", "resilientfatgoddex": "21. Or whatever number we are on... Uses quotes from POC, talks about “love and justice”, but doesn’t have the structure needed for their business to make their business safer for the POC they attract.", "kyra4pres": "Christians that say, \"Jesus never talked about race\" and was \"apolitical\" and use these statements as reasons for their \"colorblind theology\" and \"not discussing politics in the pulpit.\" Meanwhile ALL their Pastors in leadership are white, they hire ONE black musician so that their music department has \"swag\" and \"soul\" and then they get away with being labeled a \"diverse\" congregation. 😒😒😒", "anamoaba_": "💀😭 you’ve won halloween!", "battymamzelle": "Ooh girl I was SO CONFUSED until I realized it was a costume. Nearly gave me a heart attack quoting Amy \"I prefer consensual\" Schumer!", "deecane": "21. “Nobody’s perfect”", "k_pmz": "😂", "amyjowisehart": "This is important.", "trinidy.tierra": "Oooh yes", "mjgraboys": "\"Kanye has no right to _________\"", "adultbabe": "OH MY GOOOOD you’re both so perfect 😭👏🏽 🎯 (and the vest 💀)", "bbadpr": "WHEW 😭", "kscowy": "@es_jessa", "cynicalpinay": "yes!", "calamity.cupcake": "Posts a triggering news report about a racially motivated hate crime, then tags all (five) of her black friends in the comments to drag them into the comment war that ensues with her racist white friends, then says “I can post whatever I want, it’s my page!1!!” and blocks you when you tell her why that’s fucked up, ~then~ attacks you in a text and tells you to “get over it” and in the next sentence says she wishes she weren’t white. *takes a deep breath*", "magic_maike": "I'm sorry but I'm not quite sure what this means ? Maybe my englisch is just not enough? Is this talking about one specific person???", "glynnis": "WOW 👏🏽👏🏽👏🏽👏🏽👏🏽", "sambot253": "Best plain-speak rundown of performative activism 10/10 will read a", "bold_brazen_article": "Insisting on POC being nice to them because they baked them a cake once...", "simply_c4": "Need justification/explanation why Black lives matter, then saying “Blue lives” matter too", "riiiiitab": "YOOOOOO THIS TEA THO!!", "schardsofglass": "Hi. Sorry to bother you - could you explain about the \"This is America\" video? And is it just the video? Or the song/its production in general? Thanks!", "crimson_fig": "Bwahahahahahaha I LURV YA'LL", "sbootykibbles": "I choked when I saw you wearing a pussy hat. @ihartericka this is pure gold", "nocturnalreignbow": "Ebony as Deray!!!!!!!!! Lmaooooo bruh I’m cackling at work right now LAWD!", "kellyshoestrings": "😭😭😭😅😅😅❤️❤️❤️❤️💀💀💀", "sydmosley": "This is a READ.", "iamrachelricketts": "This is the best thing I’ve ever seen thank you!! I have to deal with SO many of these pricks. Thank youuuu 🙌🏾🙌🏾🙌🏾", "cindyleealves": "WAIT ... I just seen the blue vest 💀", "oxtail_tiddiess": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "shriekingviolets": "I can't believe yal skewering folks like this for Halloween! I LOVVVVEEEE it 😂💙💙💙", "chelleorc": "Creating \"pro-black woman\" social media pages that only show oiled up dark-skinned women or thin light skinned women or \"thick\" brown skinned women, all of whom only have that Coke-bottle shape, are feminine presenting and over-sexualized/over/deified.", "cindyaooo": "21: “We must be resilient in these difficult times”", "leosoul2": "For the culture...", "digirolamo.rose": "IM ALSO DRESSED AS A PERFORMATIVE FEMINIST LMAOOO I’m dressed as amber rose 😭😂", "mtroisfontaines": "This is amazing."}