{"badeoye": "👋🏿👋🏿👋🏿", "jewelsbykelly": "Thank you so very much!!I love them and I love you.For your courage and pride.I will be following you", "carlyflower86": "@grace_goodd 😚", "tammakastaley": "I’m suppppaaa late to this post but I said id come back to introduce myself so here I isssss🤗 first name’s Tammaka (TAM-UH-CUH). No, it doesn’t mean anything in Swahili or any language from my knowledge and research. It’s just some ghetto fab shit my mama came up with. Lol. Bomb af right? Right👅✨ my name is one of my fav things about me. I’m queer (bi-sexual and Pan-romantic to be exact), cis Black woman. Also, I’m non-monogamous and currently in a polyam relationship of 2 years. My 9-5 is at a TRIO education program at a university where I live, which is Columbia, SC. I am also a spoken word poet and teaching artist so my other work and passion is running a small community based business called Love On Purpose where I provide workshops on how to use art to create social justice with the intention to dismantle racial and gender oppression. Currently in grad school getting my masters in social work. I enjoy food, thrifting, and bashing men online. Glad to be present in this space. I’m manifesting I continue to learn a lot and become certified as a sex educator as well. Heyyyy yall❤️👋🏿✨✨🤸🏿‍♀️🤸🏿‍♀️", "cbdandcoffee": "Thank you for your service in the field of sexuality 🙌🏼", "marilluch": "Hello from Southern California. Been following you for about a week or so and I love it. Thank you for posting, sharing, all of it!", "patfrom1stop": "Translantic Slave trade sis ? Where’s the proof this actually occurred, also black ? That makes you non descendable don’t allow anyone to label you empress you are Aboriginal American", "kaymcdpohl": "Hello @ihartericka and everyone. I am Kay Mother of five, wife, and CEO/Owner of Global Tax Service. (A very happy Sagittarius) I also enjoy being a mentor to many young women. I came across your page and was taken by your openness. Your self expression it heart warming❤️❤️ Thank you for sharing so much of who you are with the world😘😘", "negri_0815": "@ihartericka heyyyyyyyyy! 😍😊", "childofpluto": "Im sorry i just discovered yall but im a baby social worker who wants to one day be where youre at💜💜🌹", "merryv_323": "Hi !! Found you via @rachel.cargle & I am here to watch, listen, & Learn. With gratitude.", "sameole_ky": "Thank you for all of this!", "sagrado.space": "I work in non-profit now - wow never heard someone say it as non-profit industrial complex - if you are open - can you share more about that?! I am feeling it! It’s a beast", "mosey_leee": "I started following you because I am watching your interview on CNN as I type this!! You are an amazing person!!💕", "lose_roy": "Looking so beautiful😍", "bchealthline": "Love this pic of you... and love that Ebony is from the Bay Area. Thanks for sharing! 💙", "leannecmiller.artist": "Dedicated follower here, beautiful legs, strong person 💜", "labelsoncommand": "@ihartericka hello I would love to meet you and your partner one day...", "clurgur": "Sagittarius too 🙋🏼‍♀️ hey hey", "ashleyhandelyoga": "@ihartericka hello, and thank you for the warm welcome to your platform. I am also a Sagittarius, and a white woman looking to learn and act by uplifting and paying reparations to people of color in any way possible, daily. To reduce the violence I inflict, and to check my privilege and internalised racism, daily.", "theleelasutras_": "Hi! New follower ! Thank you for your posts. #pisces", "bd3004": "👅👅👅👅👅👅👅👅💋💋💋💋🔥🔥🔥🔥😍😍😍😍💏💏💏💏💋💋👅👅👅👅👅👅👅👅👅", "shetribeconnect": "lovely to meet you! ❤️", "amandeburger_art": "Aka perfect!", "kyra4pres": "Can you remind me of why you left NPOs again? Do you think there's ever a time where the NPO can work?", "its_glamouriss": "Hola! Just found your page today but already obsessed after listening intently to your story about voting. I hadn’t heard any convincing non voting perspective prior to today. 👀 you’ve woken me up love! Im from Chicago. I’m sexual but don’t identify with any subcategory. Femme. Wild heart and mind. Black/Italian/Greek/German. Always seeking growth and can’t wait to be educated. I love the community of followers commenting on this. 🙌🏽 Excited to get to know you better!", "azuaintuition": "Cool. This is fun. Just dropping by to say thank you. Been here for a minute and want both you & Ebony to know I SEE you fully. The work you do is appreciated. My name is Azua. I’m Black, a motherless child & both my kids are Sagittarius! I live in Hartford, CT and MAKE a living as a Healing Artist. My views on the intersection of healing/spirituality & social justice/racism are so connected and you have helped to influence that. Sooooo....THANK YOU!!!!! With Love & respect ✊🏽", "5050by2020\nVerified": "Verified", "cat_ze_cat": "HIIIII, I‘m from Switzerland 🇨🇭, your posts are great ! Thanks a lot for all those informations. 🧡", "rileyandlunaadventure": "Hello! I am a former SLAA/SA residential assistant/counselor. I am also a card carrying member of SLAA. I have worked in addiction and the foster care system. Recently I have had request from others to look into sex therapy (so glad I found your page). I'm a sagittarius as well and am married to a wonderful man. Pronouns she/her.", "brittrfillmore": "I would love to sit in on one of your classes! ❤️", "bec.mueffelmann": "Hi! I'm Becca from Durham, NC. I'm a bisexual woman, she/her. Here to listen and keep learning more of all the things I need to learn from people of color. 🤓", "2wokegurlspodcast": "Hi, We’re from Houston and we talk about u a lot on our show lol. Thank you for sharing so much and teaching.♥️", "t_minus_gymtime": "What does “black freedom” mean to you? Im@genuinely curious. Thanks for your time and understanding in advance.", "hp_chino": "Hi (smile)", "amespurple": "Hi Ericka! I’m Amy - a queer deaf person. I’m an activity for anti-racism and anti-ableism. Feeling pretty fragile with the anti-Semitism and blatant racism in the world these days. People like you give me strength.", "gwenfordfaulkenberry": "I’m Gwen. An ignorant white female English professor, author, and Evangelical Christian, married (to a white guy), and mother of four who wants not to remain ignorant. You are brave and strong.", "sawhitwalt": "Hi @ihartericka - I’m a white cis woman from Texas, just hear to listen and learn, and will also refrain from commenting unless specifically asked - thank you for doing all of this ❤️", "snoreofbabylon": "🎀hello!🎀", "vietfullofrage": "@ihartericka 👋🏽 I’m Viet. She/her/hers. From LA. I’m a psychiatrist and work in mental health jail diversion. I love your posts and am trying to unlearn everything I’ve been taught in my medical training. Thank you for putting yourself out here. I know it’s exhausting work. ❤️", "bethazon": "Hi! I'm Beth. I'm a white, queer (bisexual), cisgender woman (she/her) pronouns. I have type two bipolar disorder. I'm a public librarian, yoga instructor, and reiki master. I am an active talker but becoming a much more active listener. I love asking questions and I enjoy being wrong, being surprised, and being kind. Also cheese. I really love cheese.", "keera.bee": "Hi I’m interested to learn how you began your sexuality education business. Also I’m interested in sexuality education.", "its.el.now": "Ah, these comments are amazing! I'm El (they/them) an androgynous, non binary, light skin biracial organizer. I followed you awhile back because it was the first time I'd come upon another poly, kinky, POC. I stayed for the self-love, sharing of a black femme's experience, and lit recommendations. I'm working for a \"non-profit\" (that I believe you worked for in the past). I'm quite unhappy with their practices and tokenization of queer students of color. That's in addition to their super problematic backers. I admire the way that you command control over your work and I really hope to get there later in life. Any advice on how to do that? Thank you for choosing to be vulnerable on the internet. You don't have to and yet you do anyway. 💕", "opheliesecq": "Non binary femme ??", "phoenix_is_rising": "Hola!!! 👋🏼", "mosey_kim": "Thanks for the work you do! I'm 🇨🇦 living in SF and here to listen and learn.", "doodilydoart": "Hola, everyone :-). I’m Bethany - plus size, artist, chihuahua mom with a green thumb, lover of adventure and music, huge supporter of LGBTQA (and anything else associated w it that I may have missed), not super kinky but not 100% vanilla, fierce friend, gem and mineral enthusiast, rock hound and knowledge seeker. I dream to travel the world and make art in any way I can. I have a medium depression called dysthymia and see a counselor regularly, as well as take medication daily. I am an advocate for kindness, fairness and truth.", "lauren_nicole_whitburn": "Hi! Thank you for the intro, at the risk of sounding over the top (which I am often 😂), I'm in awe of you. I'm a Canadian single mama, mental health advocate, activist and small business owner. An intersectional feminist with a shit ton to learn. I was raised in a white middle-class bubble, and at 35 have realized how much unpacking and unlearning and re-learning I have to do. So grateful for you and your work, and pumped to check out your podcast!", "clare.m.ap": "Hi! I have never ever commented on a post like this. But I’ve learned so much from you so I just want to make sure you know. I’m studying health education and I want to make sure I’m constantly challenging its core narrative (which puts the burden on the individual and rarely addresses the structural racism that has created health disparities). So I’ve been following for a while and I think everything you say is so badass and so smart and I’m lucky to follow you. Thanks for everything you do because it’s really far reaching. I’m trying to figure out how to be ethical in an unethical world (nonprofit, higher education) and you inspire that. If you’re ever down to chat more about health education I’d love to do so, but for now just know you have admirers! PS I’m also a may Gemini so thank you for that distinction", "jessiejames1331": "You both sound like a power couple!! Can I ask what is “the May version (Gemini)”? Because that’s me! In addition can I ask why you identify as black? I was listening to “explained” on Netflix and an African American man simply stated “if people would like to call us by our preferred term Instead of what makes them comfortable, that would be cool” - my follow up to that question is does everyone have a different preferred term and should I be asking individuals? I don’t want any of this to be offensive, I’m trying to get an education", "tempsvivre": "Oooo💜💓", "bbaileyk": "Hi! My name is Bailey! I am a mama to 2 girls. I am here to learn and help raise my girls to be better woman than the generations before me.", "clairelithagan": "been following you for a while and i’ve learned so much from you. thank you for helping me — and so many other white people — learn to face our privilege head on, and refuse to ignore it. also hello to ebony from a fellow gemini ;)", "sarlejeffries": "Hi 🖖", "wizard_aunjel": "Yooo! My name is Aunjel. I’m a Black, queer, trans-masculine healer based in LA. I’m married, poly, kinky, geeky, and an Aquarius. . My business @transformative_massage provides trauma informed bodywork that is body positive, gender affirming, consent based, and accessible. I’ve centered my practice on QTIPOC and use my platform to provide sponsored bodywork for those who need it but can’t otherwise afford it. #selfcareasresistance . I appreciate both you and your work. Peace! ✨🔮✨", "karinelipstickqueen": "Beautiful 😍", "beautythroughthebeast": "Adore you, I learn so much from you ❤️", "scremilyjane": "Hi!! I'm Emily, a queer social worker in Toronto, I've been following and learning from you for a while and I love and appreciate what you do! You also give me hella femme fashion inspo 💕", "katiekatielady": "I’m Katie, a photographer and writer in Washington state. I’m learning so much from you and all the comments here. Had no idea about my silent complicity with white superiority until finding you through @iamdaniadriana’s feed and finding myself many parts ashamed and frustrated by my narrow views of feminism and equality. I have quietly been learning and taking in your perspective and am humbled and grateful to have your voice and thoughts as part of my life. I’m listening. Thank you ❤️", "yyyjellila": "G'day from a little place called Tumbarumba in Australia. I am on Wiradjudi land. The name Tumbarumba means\"hollow sounding ground\". Everyday I am surrounded by some of the most beautiful native flora & fauna with mount Kosciusko watching over us. ⛰🌲🌳🙌🏽♥️ Thank you so much for being someone so real in among all the other bs I do my best to avoid. Strength, transparency, intelligence & emotion is something i always see when I your posts come by my feed. If I can learn more from other's experiences, such as yourself, I'm a happy women. 🇦🇺💌 There would be many people in Australia who would benefit & be inspired if u ever came for a visit. The smell of gum leaves is very therapeutic", "vanill.citron": "Hi. I’ m french and breast cancer survivor too. Nice to meet you on Instagram !⚡️", "philawriter": "❤️", "unruly_mag": "❤️", "gabriellamozelle": "♥️", "nicoletouchthesky": "Nice to meet you again ☺️☺️", "tpowerhouse1": "@ihartericka Hi! Ty for this post, I’m among those recent followers finding you through research I was doing with regards to our societies view of sex and it being such a taboo as well as the naked body particularly with regards to the body & “slut” shaming that exists today. You were among 5 women in an article I came across being celebrated as the leaders in this general space and naturally began following you. I thank you for your work but also for being courageous in showing your body, being brave enough to put yourself out there that way, nothing but respect! If ever something an average Jane like myself as a follower could do to help your mission, It’d be a pleasure! #respect #womensupportingwomen", "jodyolympia": "I’m new. Here to listen/learn. Raising 3 young white/Asian boys and just want to do it with all perspectives in mind. Your vulnerability is astounding and the most beautiful/brave thing I have ever seen. Thank you.", "venusmichele79": "❤❤❤", "lucairis": "Hi Ericka , from Australia here! Been following you for a while now, always reading and learning and am very grateful to have the opportunity to learn from you. Thank you.", "shaheedanu": "Luv ur plants🤗", "madeupofmemories": "you’re so lovely ❣️ i can feel that sag energy for sure, my moon and rising are in Sagittarius :’)", "there.is.a.field": "Thanks for the intro. Barbara here from Central Victoria Australia. Passionate about learning how to understand and deconstruct my white privilege and construct my intersectionality and like @violarandom won’t comment unless asked.", "strongdelen": "Hi from Western Australia, I'm Delen, grew up between Congo and France. From what I've gathered for now, the ancestry goes back to Central and West Africa. Even though I'm stuck at uni right now because maybe I'm not that courageous and revolutionary and I'm still trying to figure out how to live my passions while eating, I'm a writer/poet, I have a blog (NtimaDelen) and am thinking maybe going on the Ytube. The goal is to share the lights and the shadows and fight against the Whitriarchy and oppression patterns even from myself. I discovered you and Ebony's platforms after the Afropunk thing. I'm in awe of you and the worlds and new perspectives you keep blessing on us. Thank you 🌟", "melinda.carrera": "Hello! New follower, bay area but moving to wyoming. So excited to listen to your podcast!", "dawnsamermaid": "I am Dawn a 54 year old divorcee! Also cancer warrior, English born, Canada raised, heart belongs to a Welshman from 32 years ago! I believe in red threads that bind us! I detest greed, liars and hypocrites! I believe in soulmates and in a love that is worth fighting for!", "thefostersfive": "Hey! I actually should’ve followed you years ago when @tiffanyprovenzano told me to. But just stumbled across yesterday! Happy to have found you, and to expand my language, knowledge and understanding. I’m hoping you post about when you travel so we can attend if possible!", "lolaroxyandthem": "Hi, Ericka (& Ebony)! Nice to “meet” you both! I’m Jamiylah!", "krizbell": "Thank for this intro- it’s inspiring me to write such an honest something. You’re a Shero to me. ✊🏼💯❤️🙏🏼🎉🌈", "geezohpeten": "Hello! My name is Amy. I am many things but these days am mostly mom, wife and advocate. My day job and life passion is working with survivors of labor and sex trafficking. I am looking forward to listening to your podcast.", "unbeweaverble": "Hi :) I am a cis white woman in America here to listen and learn. Just started following this week! I love everything I've seen. You are beautiful, insightful, and wonderful in so many ways. So nice to meet you!!", "seizazen": "Hey E+E! I'm Caitlin from Portland, OR. Obsessed with dogs, Japan, and the Victorian Era. I've been following y'all and listening to hoodrat to headwrap for awhile now. I've learned a lot and really enjoy your conversations. Keep it up! 🔥", "kelliroh0110": "Omg loved the “Gemini - May version” 😂", "thenutritiondominatrix": "I’ve been following you since after the first Women’s March, but I don’t often chime in. I’m here to listen and learn, you have opened my eyes to so much that I always knew was there but didn’t really see- and it makes me uncomfortable but in an important way (if that makes sense?) and for that I am grateful and honored that you share your experiences with us 💕 thank you", "ladysasquatch": "I was so stoked when I found out you were a Sag! I really appreciate your posts. ❤️", "laurenluvsbooks": "Hi fellow sag sister! The best sign! 😉👋🏻 Love learning from you & Ebony on the daily. Thank you for all you do. 💛💛", "brittney_odette_yoga": "I had no idea you have a podcast !!! Cannot wait to check it out", "chelebelle2": "Greetings and salutations to all. 25 years as a library worker. Only child. Confirmed spinster. House head. Started my own internet radio station as a gift to myself for my 48th birthday this past August. Peace✌🏾& Blessings 🙌🏾!!! all. #CheleBelleRadio", "thewanderingtreeelf": "Heya from Western Australia. 👋I love your continual strength, drive, vibe, compassion and sharing. Here to watch, listen, learn. Thank you for creating a space that allows for such positive growth. 🙏 You are utterly inspiring. ✨💖", "afrocenchick": "ILY", "anneface": "HI ERICKA!!!! Thanks for the intro. ♥️", "violarandom": "Hello! Here to learn and lurk. Won’t comment unless asked for white lady perspective or donations. I learned from Kinfolk Kollective.", "codepuffin": "Hiiiiii 😊👋🖐👋🖐👋 What a lovely intro post on one of the best feeds 🦄🦄🦄 My name is Amy and I'm from South Africa. Thanks for sharing yourself on social media. I learn from you almost every day. 💜", "georgiakscott": "Hi! I’m Georgia, cis female pansexual, and I’m a Leo. I’m just here to listen and learn, only speak when I’m spoken to. My sister recommended I follow @rachel.cargle and I found you through a recent IG post! Really enjoying your posts 😁", "deadbirdparty": "I've been following you for a while; your work challenges me in neccessary ways and i am super grateful! Also i love seeing you and Ebony its like couple goals. Literally the cutest.", "joyahevony": "Hi I'm from New Jersey. And I first saw you from thesextherapist post. I just love your energy your fun but no nonsense way. I stay to myself all the time but just now trying to break out. Not sure who I am but working on learning me. Thank you for being you and showing that being me is ok and not to be ashamed of my kinky side. I am a work in progress.", "misstwerkology": "I emailed you, you inspire me I wondered if you could help me with the undereducated ignorance I'm facing in Europe with cultural appropriation and history for dance, \"twerk\" as they know it but it is so much more. I am beginning lectures but I wondered if you could offer any support with the topic in particular of black women over sexualized and capitalism with white privilege. I know I touched on more than one but it's important to me that we need a change. ❤️", "yabetteswank": "Thank you for the work you do. I love being educated by your perspective", "instakittyamy": "Hiiiii 💘", "pignolia": "You are amazing.", "_ohthatsashlin": "Thank you🌻💛", "alongstory_short": "I get all in my head whenever i have to describe myself in words, now that I’ve realized how much better I am doing it with my body and actions. I’m a former journalist who became a massage therapist eights year ago. Listening to and responding honestly to your story is the through line between those two. I have an eating disorder, but sought recovery one year ago! I am learning what I am beyond skinny — and trying not to sound like a ted talk when sharing.(also trying not use humor as a shield). I am trying to call injustice and racism whenever I see/feel it, especially when I see it in those I love — including me. I am the lady who always holds up the line talking the cashiers. My husband was my editor. He’s good at putting structure into chaos, without stripping the chaos of its energy. I’m from a small town and got the f out as soon as I could. Live outside of DC where I flip off the NRA headquarters while doing errands and find comfort in displaced Midwesterners, podcasts, comedians who call out the bullshit, Insta, British crime shows, dancing like I missed a call back to a video, and our dog Laser. I’m the kind of person who buys Glow n the Dark bubble bath at Ace Hardware so she can spend a rainy Friday night in the tub. I love that I’m here on the thing (planet) at the same time as you are and get to connect. Thank you. Now I gotta go grab a Halloween treat and eat it naked in the tub.", "msfitz65": "Thank you for the intro, new follower and very glad to be here. Will be listening and learning, emphasis on keeping my mouth shut and doing my personal work.", "emilyjonesgreen": "Hi!! I work on a college campus in a student services position and doing all I can learn how I can best advocate for my students. Thank you for all that you’ve shared!", "bluereisun": "Wow!!! Learned something new. You're POLY!!!", "always_sam0.o": "HIII!! I love this post and all that you do. I too am a social justice warrior 🙌 Thanks for all your inspiration and passion 👏", "blackvelvetwinks": "Greetings Ericka. Let me start by saying “Thank you”. When I was 1st diagnosed with breast cancer I was scared shitless. After having my surgery I started following you. I saw one of your pictures (I looked down at my chest and said) wow, she looks just like me/I look just like her. It’s a refreshing feeling to know that I’m not in this alone. Your topics are very interesting I might add 🙂. Blessings to you 😍🤗", "drdani010191": "Hi name is Danielle. You are the type of Sexuality Educator that I am trying to become. I admire your work.", "_acceb___": "What an honor and privilege it is to have follow both you and Ebony, and continue to, over the years🙏", "olympusmonsvii": "omg my feelings about the non profit industrial complex are tingling right now bc i just vacated that universe and fuck i was lost.", "natalow17": "Hi! I’m Natalie (she/hers). I’m white & Latina (and a Taurus), from Kansas City, and I’m currently in the last year of my master’s program in social work! My career focus is on the reformation of the criminal justice system and the development of more community programs & alternatives to prisons. I’m currently interning for an independent organization in NYC that visits prisons upstate to inspect conditions and talk to incarcerated persons, and uses that information to advocate for change on many levels, but especially focuses on policy reform. I started following you just a couple weeks ago, but I already love the community and conversations that you cultivate here. Thank you for all the incredible work you are doing.", "psalm45_1": "Heyyyyy!", "vincy_p76": "Hi from Brooklyn by way of St. Vincent. I’ve been following for about 2 years. I was searching for other ‘survivors’. Not only have you inspired me you’ve given me hope, and shown life after. The fact that you do not sugarcoat ANYTHING is admirable.", "stephosc0pe": "Hiiii!!! I’m one of your new followers. Thank you for the intro! I’m Jewish, mostly hetero, she/her, Nurse Midwife. Specifically as a person who offers healthcare for vaginas, I have a particular duty to stay aware. I’m following you to stay tuned into perspectives other than my own so that I can be a better midwife and citizen of Earth. Thank you 😘", "moonknighting": "Ok I'm just gonna point out something no one else has....", "iboostclotheshoe": "@ihartericka i sent you an email awhile back i was wondering if you received it or if it was an alternate mode i can contact you ?", "ktduffyincorporated": "Hi! Im KT -they/them fem nb artist and prof. I usually never reply or post, just here to learn, but I wanted to take this opportunity to Thank you and Eb for being a daily part of my ongoing education here, on the podcast, and thru the literature y’all introduce me to. Been following for a minute and I commonly have these lovely moments with students where we connect over the topics and ideas on your platform (all the students follow too 🙂) Huge heart explosion thanks to y’all from Chicago 💜🧚🏻‍♂️🙃", "bellacoola": "Hello! I’m Belle, a v new follower from Australia 💛 You are strong, brave & inspiring ~ I’m learning lots and I love it. Thank you x", "hanphetamine": "I have been following you for a while now and I love the perspective you bring to and your passion for not only justice but change. The conversations you provoke are ones that need to be had far more regularly, so thank you for being such a loud voice in that movement.", "corena_regina": "♥️", "laurynmont": "Hi! Lauryn from Indy:) I’m a new follower, found you from Glennon’s IG. Thank you for your voice and work.", "heatherlindsy": "LOLing at the May gemini distinction, me too and it makes a difference!", "gogogadget_dick": "I love this", "zisle": "Thank you or everything you are and do! I am a multi-discliplanary artist whose company Miscellaneum Studios produces comics, video games, music, workshops, events and more. Our mandate is to provide next level entertainment while rerpresenting black, indigenous, POC, women, the LGBTQ community and other marginalized communitues in a positive light. Z'Isle is a zombie comic book series (with no sacrificial negroes!) And Abdul Lateef and the Distraction Machine is the cyclepunk survivalcore band that creates the comic's soundtrack and performs shows!", "karenmusaeus": "Hi from Norway!👋🏼 I really appreciate the insights I get by following you. I thank you and wish you and Eb all the best✨", "wes.leslie": "👋 hello!", "jsbachgirll": "Hi! I really like your page. Thank you for being who you are!", "iveynyc": "✋🏾 hey @ihartericka ! 👏🏾 Love your work !", "deejoy6": "Hi, great intro! Was just introduced to your work. I’m Gemini, June side.", "dc_twin1": "Hi! Afro-Latina teacher working in the East Oakland!!! Woot woot! Started following you a couple months back! You are amazing and do such amazing work. It really helps inspire me to keep growing and continuing to do the work with high schoolers.", "ericadrosenbaum": "Hi! My name is also Erica. I'm a law student in NYC. I started following you just about a month ago but have already learned so much about the work I and my fellow WW need to do. I am so thankful for you & Ebony's work and knowledge-sharing. I love seeing you two laugh together, too. Thank you for the work that you do♥️", "eroticren_aryn": "I’m pretty new to Instagram but I love all your post. They are extremely inspiring to me as someone who wants to work in sexuality. so thank you.", "drag_them": "Hey Ericka 💋 I’m Meredith or Ryland (when writing). My lineage is mostly Irish and I’m a fourth and fifth generation North American. I’m an independent sexuality educator as well. I’m a lifetime member of the working class and have experienced active unemployment for the past six months. Sometimes reading your posts are challenging because my privilege as a white person makes me think I have the place at the table to participate in some conversations. I think you for that challenge and reminder to listen twice as much as I talk. I invite you to follow my journey as I have followed yours for almost two years. While not all of the communities which we belong are the same it is an honor to also be a part of the non binary femme and sex educator communities with you. I am also intersex (XY, type CAIS) and poly. Thank you for your constant inspiration and for being anti-racist, anti-ableist, pro-reproductive justice, pro-choice, pro-sex worker rights, and culturally inclusive.", "vinciblethedocumentary": "This is awesome! Thanks for sharing. I love how much you know about yourself- admirable 💗", "ernapple": "Hi! I’m a Support Worker, photographer, and also have my own Theatre Company. We educate audiences on the importance of acceptance and inclusion for people with different abilities! Located in Toronto, Canada. I love your page and stories! And your clean eating videos are amazing! Lol ❤️🤗 Thank you for all you do!!", "setthemtittiesout": "Good afternoon. I have enjoyed your following you. You take us on a journey through your posts, and as such, I look forward to riding shotgun on this roadtrip of a life of yours.", "jmkmirkes": "Thank you for sharing your self and story. I am a straight, cis gendered white woman and I am constantly working to unlearn my racism and other bias. I’m near to learn and listen and I appreciate you sharing your time and energy with all of us.", "psychiczya": "Hey hey nice to meet you. Are you from NYC originally? And I’m a Psychic Medium & Writer formerly Fashionista/fashion journalist", "playwelltogether": "LOVE", "its_car_uh": "Hi I’m Cara! I’m an English and sociology major and your perspective on this page makes me read literature in a different way than I was taught !! I am constantly looking for systems of oppression that characters face and the ways characters are presented by authors who don’t share their identities. I’m really really grateful", "julianaluna": "Hi, I am Juliana Luna. Brazilian. Of Yoruba ancestry, known only by DNA test, also product of the Transatlantic Slave Trade where my ancestors came to this part of the world in boats under inhuman circumstances. I am 32 years old, I , like @findingpaola hate Work related titles, but I go as Yoga teacher and Wellness/ self care advocate for black people in my country/ community. I’m fluid in my mind, body and soul. Having some Osun, some Yewa and some Esu allows me to move through the world with blessings upon blessings being showered all over me. Normally people ask: what do you do to get paid? To which I respond: I trust. 😂 I admire you and your partner so much Erika. You are true inspiration nowadays. Thank you for your work. ❤️ ✊🏾", "balletmeli": "I am from Miami, but I have moved around a lot living in different counties in the state to even out of state. The last 2 1/2 years I have been living in Miami with my family. A 3 year breast survivor who switched careers from mental health to audit medical records around the time of my diagnosis, and I am now in school studying to audit medical records and applying for jobs in that area. Taking life one day at a time. ❤️ you and EB and have been following you for quite some time. Have a great weekend", "iambscutt": "Hi, my name is Betty and I am from Haiti. I love reading your posts because English is my second Languague and you are my perfect English teacher. I lean so much every time I read your posts. Sometimes I have to pull a dictionary to learn the meanings and in turn use the words in a sentence😄but, that’s okay because that’s what Education is all about. You also teach me the importance of self esteem and self acceptance. I can go on forever but, I will give the space to someone else to reply.", "chopchopstab": "Ahh I didn’t know you had a podcast tooo!! Definitely adding to my list 😍", "kimmy.hale": "Hi :) I’m a pagan massage therapist in Portland, Oregon. She/they pronouns. I always need more sex educators in my life, and I love your voice in this world, Ericka.", "eggs1314": "New follower- grateful for the work you do and trying to do my part as a cis female wife, mama, lmsw therapist to listen and learn", "drina_f": "I’ve been following you for a while, but haven’t had the nerve to say hi lol... I love you and Eb and all of the work that you both do! As a black educator, I’ve learned a lot to help me be mindful in my interactions with my students, as well as spotting the bullshit from adults in my work environment. Please come to Virginia!", "itsnotchristina": "Young white settler woman living and studying in Mi'kma'ki (Scottish invaders called it Nova Scotia, Canada). Been here for a bit but don’t engage in discussion as I’m here to learn and reflect to lead me to helpful and constructive action. Absolutely love the podcast (seriously should be followed by everyone). Eternally grateful for the work done here by both you and Ebony", "olive_ahh": "Hello 💕✨", "yofrancypancy": "Hello thanks for sharing your story and life. I don't remember how I found your page. But I love the cute things you an your partner post together and appreciate the space you have created in addressing of oppressive institutions. A little about me. I am a queer woman from savannah ga, usa. I moved to colombia South america October 2017. Here I live with my Colombian girlfriend and I'm an ESL teacher. Living the best life I can.", "seedesignconsultancy": "Hey from Australia 🇦🇺! I followed you yesterday after you kindly took the time to pass your wisdom and advice on to @glennondoyle happy to be here to be apart of your journey and to listen and learn. Thank you ! Xx", "jack68bass83v": "A woman who reads...now that is partnership, wifie material for me!", "konceptualk": "Hey! Been following you since Bonnaroo!! I’m Krista! I’m currently on the track to become a manager one day for starbucks but always had a dream to study Sex Therapy and become a sex therapist for kids up to 21, but couldn’t afford my MA so I stopped that dream! I am still figuring out who I am as I am opening up to letting men into my life. You give me so much wisdom! 😇💝", "jamessimsiii": "❤️❤️❤️", "angel.moth": "HI! I'm a mixed race mexican-white/mestizo, cripple, artist femme, from the west coast 🖤 have known about you for a while, but only started following you on Halloween!", "tortuguitaintheclouds": "❤️❤️❤️", "mary_jane_xo": "I love this picture! & I love following you. Thank you for sharing your perspectives. I can’t get enough- always learning. Especially your stories. Love to you both!❤️", "madmadyxx": "And your work 🔥", "monikajane": "I’ve been following since last year, but wanted to take this opportunity to tell you how amazing and intelligent I think you are!! I continue to learn from you and challenge the way we are told to view the world by the few that have historically controlled the conversations. Also, I had a dream that I saw you somewhere and fan girled out so hard I couldn’t figure out what to say... maybe I shouldn’t watch your stories before bed lol. Anyway you give so much and as the recipient I’m glad you shared your Venmo because your labor shouldn’t be free!! 🖤", "frejafray": "❤️🧡💛💚💙💜", "gisellemt86": "Hi! 😊", "aquarianamber": "Hi 👋 been following you since your unfortunate experience at afropunk. Thanks for the book recommendation 💕", "steph_margolin": "Hi! I’m the student who saw you in the hallway on Tuesday at CSSW and acted like a weirdo bc I was so excited to see you, and you so graciously smiled and said hello👋🏼", "guerrilla.gryp": "Been following a while and did not know about this podcast. Consider me subscribed!", "curlyhairedthinker": "hi! I’m a Latinx law grad from Canada! My practice is human rights law but deep down, I just admire your strength to come forward and tell your truths ❤️ not to mention, calling out structural oppression. Love from Toronto ❤️❤️", "coolkatgelica": "Hola! Im also a Sex Educator. I’m looking forward to listen to the podcast. ✨✨✨", "jackiesvibe": "@chelseykorus", "mo_fletch": "Ericka! Thank you for this intro - I’ve been following for a while but love learning more about how you see yourself and your work! I’m Morgan (she/her), work with @ggenyc (I think we prob have some mutual friends☺️, and also work with @ladiesgetpaidnyc as a salary negotiation coach cause I want to obliterate the wage gap! Happy weekend♥️", "oranges05": "I have a question - and I of course Don’t expect you to take the responsibility of educating me, it if you feel like it, I’d be very appreciative. What does it mean to be a non-binary femme? And how then, does that work with your pronouns? I’ve looked this up a little but still found it a tad bit confusing.", "chiara.illustrates": "Hi, I want to be a better ally and my friend directed me here. I love your posts. They are very formative and informative. Thank you for what you do. ❤️", "kweenikki": "Hello!!! I’m Nikki, nonbinary femme as well 💛 pansexual queer born in NY but raised in CA. Half Greek and half korean. Working on getting an MFA in film, have some activist background. Always looking to read and learn more about everything!! passionate about the cause. So excited to be here!", "kikiome30": "I am a teacher as well. It is great how many things can be reached through teaching. I hope you come to Argentina. I am an immigrant. I left everything in Venezuela. One day I picked up all my things, took my kids and started a 7 day trip, land and air to get to Buenos Aires. It is great to read your post and see your pictures. It teaches me about diversity, strength, life... I just love you", "matriolu": "And you are so beautiful! 😍", "chizilla": "The world needs more fierce, sex positive Sag femmes 👏🏼", "itshollyagain": "I’m a sex and health educator by trade currently working at a domestic violence agency and living in the Hudson valley area (moved here a little over 7 months ago from Cleveland Ohio). I’m a bisexual woman living with Lupus", "jaclynjoslin": "Hi! I’m pretty new to your page but find myself getting on IG just to see your posts and stories. Excited to learn you have a podcast as well, I’ll def check it out. Thank you for all you do. ❤️", "juicyjenks": "Hi! I’m a sensuality specialist and sex workers rights activist living in atx. Love your work and so grateful you so generously share your wisdom with the world!!!! 💗💗✨", "huffy_ladddy": "I've learned a lot following you, and I love all the conversations you open up. My question for you, do you have any poets you really like to read? Do you know of any poets that talk about sex in an educational ways? Thanks for the work you and Eb do! 💕💕💕", "vallen67": "Hello. I am a new follower. I am listening and learning about gender ID. My oldest recently came out as trans/ NB and learning and hearing different voices helps me affirm my child as best I can. I lurk mostly to take in the knowledge and info. 🙏🏽 Thank you.", "kjbriddell": "Hi! I’m Katrina- also new and here to listen and learn and do the work. From DC/PA.", "ehayesro": "So glad you did this—I didn’t know about the podcast. I have the first episode queued up for my commute.", "opjamus.prime": "Eb is the ultimate homie Everytime u post with him it's a hilarious time y'all are the GOAT.", "youngadina": "Hiiiii Ericka! Def hart you and value the work and existence of you and Eb! 💙", "leighhendrix": "Hi! I’m newly following on this platform, but have encountered your work in the world. They/them pronouns for a non-binary white queer theater maker and college instructor.", "bysarahmessina": "🙌🏼", "lilian_o_": "Hi you are so inspiring. Love you", "thafoodist": "My friend Gemynii speaks very highly of both you and Ebony, as well as your work. Very refreshing, insightful, entertaining and all-around beautiful to see. Glad I followed.", "krck22": "hi love u both ❤️", "lmcindc": "Hi, I'm Laura (she/her), a white woman who grew up outside of Philly (Widener was in my backyard!). I'm loving your feed, your style, your boldness, your work. Working to deconstruct my own racism and biases while working in very problematic systems (K-5 public schools)", "marire": "Hi from Oslo, Norway 😍👋 Thank you for this wonderful space! And I sign up for the dreaming of being able to attend one of your lectures one day ❤️", "_bailk": "Ugh love your work. I’ve been teaching sex ed at planned parenthood for just under a year and I am totally obsessed with the amazing work you do. Looking everywhere I can to build sex ed curriculum that is less cishet and white 🍑💚", "cornelius_mackie31st": "❤️🔥🔥❤️🔥🔥❤️🔥🔥", "hannah_belfastbanana": "Heya from Northern Ireland. Been following you for a few months... lurking in the comments section and learning a GREAT DEAL. Thank you for all you share.", "france_seas": "Hi QUEEN, IM.BINARY, CANVER SURVIVOR, ONE NIPPLE, NOT BLACK, INDIGENOUS RACE, LONDONER & Mum to three political activists. I received a magazine which you were on the cover of. May 2016 post mastectomy. I grew into me from there. Xxx thank you xxx", "andii_poison_ivy": "Hi! Nice to meet you too. I'm Andii from the UK... I'm 32, mum of 3 and sometimes model. You are so inspiring! Keep it up😙", "1photoperdayexceptsundays": "😍😍", "ashleeknottsntp": "Hi from Rhode Island. Been following you for a little while now and just love everything about you (and Eb). Thank you so much for everything you do. ❤️", "yungxnashira": "Hi! I’ve been following you for a nice chunk of time. I’m currently a senior in undergrad. Your page constantly inspires me, a black queer survivor, and I aspire to be as open as you are about your challenges and your story. 💕 alsoooo you and ebony are #baegoals for me 😭", "alessandravoice": "@ihartericka well I’m kiiinda new to following you but I’m Alessandra, we knew each other in Miami at UM. I’m so happy I “re” found you on here and Facebook. I’m learning so much and I’m so grateful to you and Ebony! You two are hilarious but also make me think and adjust my thoughts and actions on a daily basis. Thank you!💓", "farsi_anarchist": "Hey, big fan of your work, and Ebony's as well! Thanks for all the inspiration and education you do, (and for doing this intro as well, for the opportunity to say so). Pretty new here, super shy, queer and grateful for your positive message and outlook. Best vibes :)", "pkkoro": "Hi from Bloomington Indiana! I've been following you for a bit now, but I wanna thank you for not only standing up for the communities I'm part of, but more importantly always keeping me learning on how to help those I don't belong to. You're really an inspiration and a voice this and future generations need 💕", "marinarthvader": "Hola from Spain 😊 thank you for your work! ❤️", "virgo_visuals": "Hi! Super new follower. My name is Bar, I’m a photographer, and live in Maine ☺️💖", "t.c.ndc": "Hi I'm Tyler or TC.. I'm a queer person living in Washington dc. Please use He/They. I take a main interest in writing queer narratives or listicles for queer folxs. I currently write for Lesbionyx. I have a femme pan partner not on IG. I am differently abled according to mental health and love to help people understand how these differences affect those living as queer. I also work in restaurants with a background in culinary arts and hospitality.", "rororulez": "Ww here. Followed you recently and appreciate the posts and videos. Look forward to further hearing and learning + unlearning white supremacy. Like someone else said, I'll keep to the background and support financially. ❣️", "vmkirin": "Sagittarius- nowwwww I know why our energy felt so powerful! 💜", "whenthebevybreaks": "Very excited to learn and grow with you! Thank you for all the enlightened content ! 🎓👠🌈 ♐️", "curly_hair_sarah": "Hi! Long time follower, first time commenter. I can’t thank you enough for everything that you have taught to me about what it means to be an ally!", "beksbonnie": "Love it. Monstera momma", "hugh.know.it": "i’ve been following you for a while but it’s so cool to see your whole bio!! it just reinforced my super positive view of you!", "caroborrero": "💖 Hola! From Panamá, you inspire me. ✨", "irockmyscars": "Hey Girl Hey! You truly continue to inspire me! I'm a two time Survivor and was treated unfairly at my job... so I left and started a nonprofit. Why give more of yourself to someone else's cause? #positivebodyimage #irockmyscars", "maddieles": "Longtime follower but that underwear and shoe combo is 🔥. Thank you for the reminder always! 💕", "welissamilliams": "@ihartericka I would love if you came to the West coast! You and Eb are needed everywhere ❤️", "basilmelon": "Your house is so cute!", "tanisalexis": "Hello from Vancouver Island Canada. You both inspire and kick my ass regularly. Thank you so much fpr the AWEsome work you do. ❤️😍", "vanperez_": "Can you come to Arizona State Universiry please and thank you", "steviebonbon78": "❤️❤️❤️❤️", "oprah_gucci": "Of course you are a fellow Sagittarius 💜💜💜💜", "ash_therese_stylist": "Hey! Ash living in Brooklyn! Been following for a bit! Love your podcast. Met you at new women’s space! See y’all around from time to time! Thanks for creating this space!", "jaburr": "@kymbahh_", "very.freaky": "Heylo! Black queer nonbinary performance & visual artist, event organizer and porn producer/performer from Seattle over here. Not sure when I started following but I love all your work & really appreciate seeing other black nonbinary folks living out their truth ❣️🙌🏿", "cryingzerosandones": "you're so beautiful. I'm also non binary (he/they afab) and a Sagittarius!! i am pansexual and an INFP-T. currently in school studying art and looking forward to go to graduate school in early 2021!", "imani_bani": "How did I not know about the podcast. Looking forward to my drive home today", "zoeelena93": "Hi! I so appreciate your internet presence, thank you for your time, your emotional labor for the education of others, and especially for sharing your light with the world ✨", "upinthewilderness": "Please come to Australia! 💕", "antidoteshop.co": "I love the joy and love you bring to your work. Your analysis is so consistently on point, and you have amazing taste in shoes. I’m a Black queer femme medical sociologist in New Orleans. I have multiple chronic illnesses— my work addresses chronic illness and spiritual meaning-making in the illness experience among Black women. I also sell botanical wellness products and healing crystals for emotional and spiritual support! Let me know if you need some more minerals in your life 🙃💎🍃", "cyoray": "but what’s Ebony’s sign??", "lffitknitter": "Hi 👋🏻 Hope you have an amazing weekend, Ericka! I’m Laura in Dallas. I’m forever grateful for this work you do as I know it is difficult, never ending, and at times soul crushing. Thank you for sharing your journey with us and encouraging me to look in the mirror and wisen TF up 💕💕💕", "ali_the_mombian": "I’m Ali and I teach Sociology in LA and Orange County, CA 😊 I’m applying to doctoral programs right now to study Sociology and Gender Studies. I grew up a biracial kid with giant frizzy hair and a white single mom. I met my dad, (a black man), when I was 26 and since then I’ve felt a sense of strength in my identity that I never felt with my mother’s racist, conversation relatives. I LOVE connecting with other queer POC who are as passionate as you and myself!  My wife was diagnosed with stage 3a IDC breast cancer this last March and when I started following you, I was so relieved to see another queer person who could relate to our story in some way. Survivorship is extremely white, cis-centered! I appreciate your natural beauty and openness on social media! The world needs more strong people like yourself and more survivors who are willing to give others hope 😊💕 It is nice to meet you!", "social_butterfly.77": "Hey boo happy i found your page ☺ your cancer survior sister, you encourage me everyday", "tyreenawaves": "Awesome, thx for the info. Great to know more about you. Love learning from you. I'm a white New Zealander living in Christchurch with our blended family & pets. On a bi-cultural journey to bring restoration & harmony to Aoteoroa (NZ)", "lora_adele": "Hi! I’m Lora (she/her), Just wanted to say I’m a breast cancer survivor too (I’m on radiation right now) and seeing your topless posts empowered me when I was preparing for my surgery ❤️ Also love learning from your posts because they help me to think outside the box, challenge myself, and learn from a different perspective 🙏🏽", "djsuburbia": "Hello from Orlando FL!", "osas_ohsahs": "What a Great intro. Great job sis.👏", "sljuls": "Hello. I found you via the incomparable @rachel.cargle and am very glad. I won’t say much, but I’m watching and learning. I might occasionally send you appreciative replies to your stories. I’m a SENDCO (special ed leader but in a mainstream school) in London - I don’t think you have my job in the states. Anyway. Keep on being amazing xx", "50fiftyclown": "Hi from South Texas! 🙌✊", "juleskutner": "Hiiii!", "missparker50": "Hey beautiful 👑", "nobodynowhere_": "Hello from Scotland 👋", "soulwithbeauty": "I am obsessed with your real ness lady and Ebony’s support and his own wokeness.", "megtrev": "🙋🏼‍♀️ from Canada. You're such a bad ass and I consistently enjoy learning from you. Thank you for sharing your truth so open and honestly 💗", "teandoranges": "Hello from Minneapolis. Love your work here! Thank You!!! Outspoken survivor/bullshit-caller of GOPChristianRight. Empathetic atheist. Public library worker.", "hilstar221": "Hello! I am Hilary from Virginia, also a Sag 🏹 Here to listen and learn! Deep bows for you and all that you do and all that you are. 🖤🌱🌻🖤", "kennyscrap": "beautiful soul", "rebapyrah": "Can’t wait for you to come to Toronto 💜", "peacecreatura": "Hiiii love you thank you for always sharing", "togrammarie": "I love the way you live, there are so many things that you have to teach to soooo many people to make them more peacefull and openminded... stay you, im very impressed by all of what you are, your freedom 😬😘", "eleeevabet": "if you're not following Ericka and Ebony, you are NOT doing instagram right. 😘 Prepare to be triggered fellow white people! (it's good for us to be uncomfortable--process it and do better!)", "c.d.r.e.a.m": "Keep doing all the things. Obsessed. As a breast cancer warrior and thriver, so inspired by your feed.💕", "pripee3": "Hi ! I can’t remember how or why I followed you but I found the things you post interesting. I am a woman (she/her), a brown person(Indian to be specific), and a person with a disability. I started a non profit called DIYabled to educate people about disability, the civil rights of people that live with them, and what a communities role in the protecting the rights of all people that live in it. I try to keep an arms length with social media but when I do enter I very much enjoy what you post. ❤️😊♿️", "eviemichal20": "I’m Evie (pronounced like the Pokémon)! You might’ve seen me comment before on your page. Androgyne and all pronouns work. I’m a Marxist-Leninist communist dedicated in aiding with the destruction of the oppressive structures from which I️ benefit. I️ appreciate all that you post and I’ve learned so much from you already. Just hoping I️ can pass on that knowledge to other white people.", "aidsfoundationchicago": "🧡🧡", "captain_marvenello": "Hi! I’m Mikaela (she/her) Sun sign Sag, Aries Rising and fellow breast cancer survivor. Your comfort level with your reconstruction is something I aspire to. I dream of being topless and proud one day. Thank you for sharing your space with us. 💗", "maggybearlovesyou": "Hi Ericka!!!!! We go by many names, MJ, Magma Jane, Maggie Jane, Magic Jane, Nijay... whatever’s clever! We are white, currently exploring and unraveling and working to dismantle at rapid rates the White Supremacy Culture and violence that lives within me and around me. We identify as gender expansive and non-binary and prefer to be called they/them pronouns. We also often refer to ourselves as we as well as I! And we’re just at the beginning of our journey of gender expansion and white supremacy culture dismantling. I am truly so grateful to have connected with you here and to learn from your sharing and educating. Thank you. Thank you thank you thank you 🙏🏼 we live in Portland Oregon. Life has been shifting in major ways for us and I keep asking to Spirit to show me the way to use my privileges to be of service to the highest good of all people, particularly and especially those most marginalized by white supremacy culture and colonization and heteronormativity. You inspired us last night to explore Columbia’s MSW program. I called the admission office today and spoke with a person named Todd at length and I felt heard and appreciated and welcomed in my sharing and queries of this systemic dismantling. I am so grateful for the privilege of looking into planning a trip to come to Columbia for an info session on December 3 (as well as visit grandma in MA) and truly, your existence and beingness and radical justice enacting have inspired us to use all of our privileges and powers to be of service to those who are most marginalized by the systems of oppression under White Supremacy Culture that I have and still do benefit from. I am truly so beyond words grateful that we have connected with you here. 💛🙏🏼🌈 thank you, Ericka. 💛🌈🦋✊🏼", "p.s.kaguya\nVerified": "Verified", "glo08": "Yaaaaay for Sags! You’re ahhhmazing.💚", "rachelmrcphoto": "Hi from Boston! Shutterbug, writer, queer femme. You are incredible and thank you for your presence here!", "captain_misandry": "Helloooo I'm an American enby overseas in the Netherlands. I'm grateful for the work you do and the chance to learn from you!", "r0s3p1nk": "Hi from southern Kentucky! I'm a bi/pan poly mother trying to raise sex-positive and culturally-sensitive kids in the Bible Belt. Thank you for being here and sharing your perspective, and I hope you have a GREAT weekend!", "physicsandcoffee": "Hi! I have been a follower for a few months. I am queer, a scientist, a (throat) cancer survivor, and a daughter of immigrants. Listening and learning. You and Eb are such a great couple!", "d1fg": "Hello! I am new to understanding gender bias and what being non-binary means. I appreciate your truth", "4lethea": "Kia Ora from New Zealand. Love everything you do. ✌️", "knowyourgirls\nVerified": "Verified", "sonnifery": "Hi from Italy! :)", "ahoykatie": "I’m a sag too ♐️ yeah!", "garden_britt": "❤️❤️❤️. Hi 👋🏾 👋🏾 I’m Brittany. It’s a pleasure to read your posts! You give me so much to think about daily! Keep doing what you’re doing !!!", "mariegroucott": "Hi from Reading Uk 🇬🇧 Good boobs from someone with 1 left!", "cathyvannest": "Hey from NC ✨You are brilliant and stunning and glorious and I’m so honored to follow / learn from you!! Hope to meet you one day!! 🙌🏼🤟🏽", "lyricallyvisual": "Hello there. I am D.d. I work with the government engaging in HIV health services work (Ryan White in Particular). I am also an adjunct professor (psychology & human services), new twin mom, hella assertive, and love following your page.", "spooksandspirals": "I think that would be an amazing and extremely rewarding career! Do you mind if I ask what you studied in school? I am a student and really want to have more than one career (a Jill of all trades if you will) and that path has always interested me. And is that a tattoo above your knee? I’m so obsessed with that placement!", "lagrossetoile": "Hello I'm an Australian living in France, your account is wonderful and I'm also here to just read and learn although I sometimes can't keep myself quiet (Gemini tendencies 🙃)", "queenbellanoir": "I knew there was something extra special about you that I loved ... 🏹♐#Sagittariusgals", "_neaux": "Kaylin (she/her), Leo, creative writer, journalist, occasional singer. I’m student at the new school and I’d love to see more teachers of color at my school and would love to one day be in one of your classes", "diva_is_queen": "You are a major inspiration!💡💡💡💡💡💡💡 #awesome", "b.collier13": "My friend..U b BEAUTIFUL..U b POWERFUL..Ub INSPIRATIONAL ✌", "holcwil": "So great to hear about you guys! I'm Holly, she/they WW from London currently living in Bristol, UK. Recently married a white American, and privileged to be in a position to complete visa paperwork both ways. I would love to hear you talk, if you're ever over here. Blessings from the UK! 🌻", "ali_baba_ants": "Heeeeeey, Im Alisha. Ive been following you for awhile and finally signed up for your newsletter. And found your Paypal to pay you for all you and Eb have taught me. I love listening to you laugh in your Instastories and I'm really hoping that a group/school near me brings you to Maine so I can hear you speak in person. Maybe take you both out for potato donuts (its not as weird tasting as it sounds!)", "stashandknit": "Hi! I’m Sarah (she/her) from Toronto but currently living in a tiny city in Canada. Here to listen, absorb, and learn.", "ezpeasygood": "Hi! I’m Elle. I’m Deaf and work mostly in Disability Justice. Your work has helped me unpack and reframe my thoughts on EVERYTHING. Thank you.", "susie.wildin": "Hello! Thanks for the work you do!", "justsheherhers": "🖤🖤🖤I appreciate you & Ebony, and all that y’all do got our community.🖤🖤", "suleero": "Hi! Everything you talk about is very interesting. One post on book recommendations for aliens like me to understand and help, please! Especially addressed to teenagers... if possible. I am a teacher in Spain. Btw Love your beauty.", "persimmonthief": "Hi! I just followed and am also a nonbinary Sagittarius ♐ thank you for sharing your space and I hope today is magical and calm for you!! 💘", "melaniezoeyishere": "HI ihartericka !!!! I too am a plant mom- and a female filmmaker living in LA. I’ve created some sex positive films - @whyidancefilm is mine. my latest film Spanko is about a teacher who finally explores her fetish! 🍑 my newest work is about my experience living in a chronically ill femme body - navigating the medical system - bc in the past year I’ve been fighting hard for my Ability to Function. I’ve also worked as a Jewish educator to teach kids what Judaism is, and about how our oppression must inspire us to fight for justice for all, especially the most vulnerable and BIPOC. We must do this and so I still have so much to learn. I know you from UM, many lives ago, and I am so glad to hear you here, it makes my Hart hopeful and happy. HI! Melanie", "foryourtmi": "Hi from NYC and thank you for your work!", "serpentfire": "Hi!! I’ve been following you for a few months and absolutely love everything you post. My name is Devany and I am currently living in Toronto, Canada. I make tarot cards, sci-fi type art and I write. Very happy to be a part of your corner of the IG world ❤️", "floating.sky": "✨ love y’all ✨ thanks for educating public on non binary topics!", "heathersoucy": "Hi! New follower via @rachel.cargle. Thank you for sharing with us. ❤️", "_flylight4lyfe_": "🙌💪🏾💪🏾", "chiarasignori": "Hi from Italy! I talked about you and your job during my final exams in high school 😘", "to_clairify": "Hi! I’ve been following you for a while and learning a lot. Still have a long long way to go and your work consistently reminds me of that, so thank you so so much. I’m a queer non binary femme student and avid reader studying literature looking to grow in my ability to listen, act, and understand the world around me.", "heidishartrandnewell": "Hey! Im Heidi. She/her. I’m a Recovering White Person who has been blessed with privilege of education and access to, well, anything I want, so now in my late 20s, I am now understanding that my passion to help people must include ALL people. I hope to help elevate voices of those who aren’t acknowledged in most straight white Christian circles 🙏🏻", "missmeadowsoprano": "Hi Ericka! I’m Alex. I’ve also been following you for a while and appreciating the hell out of the work you do. I’ve been listening, learning, and trying my best to implement that education in my rapidly gentrifying surroundings. I think your work is absolutely ESSENTIAL and I am so thankful for you and Eb sharing your knowledge with us 💗", "andreasorlie": "Hi👋🏽💕 Very new follower from Norway, but every day I gain new perspective from reading your posts and stories! Hope one day I will attend one of your lectures, if not in person maybe via livestream?☺️", "mommamacbeth": "Hello from Kansas - I’m a new follower. It’s nice to meet you!", "misskatlin": "Hi! I’m pretty new to your page. So far, I’m loving every little bit of it. I noticed recently how white-washed my feed has been and in an effort to get a more diverse perspective I came upon your beautiful face and a few others. This is probably the last you’ll hear from me. I’m hear to listen, learn, support when I can and keep my mouth shut. Thank you💚", "scrappyunicorn": "Thank you! Nice to meet you and learn a bit about you @ihartericka 💜😊👋", "alexandradanae": "Hi! Thanks for the intro. Looking forward to listening and learning 💛", "printeretto": "hi @ihartericka i started following you in september after i was diagnosed w breast cancer + looking for a queer perspective. thank u. your posts help 🌱💚🍂❤️!", "topeshonekan": "Hey from not so sunny England. You are doing amazing work 💪🏾", "mambopamboworld": "Hiii! 💕💕 from Nairobi Kenya! Thank you for inspiring, educating and opening our minds! You are amazing!", "withlove5": "👋🏼 Hola !! I just want to say thank you for sharing your journey. You guys are great 😊", "prajgariah": "👋🏼👋🏼👋🏼 I love following + learning + being inspired by you and Ebony. 💖🖤", "the_melanin_mrs": "Well I’ve been following you for a while. And I work at the non profit you left. 😩😩🤦🏾‍♀️ I briefly met you when you did the intro for the gender free bathrooms. And you were gone right after that. 😩😩😩", "iischristy": "Tryna get like you so Brb I’m gonna do some leg work in the gym. 😍🙌🏾", "vetiver_lbaker": "i wish i could take your class, but im West coasting.", "brytentheartist": "Hi!!! I'm Bryten. I'm a 16 year old black girl. I'm queer. Newly single. Ready to go on a date with all of my halloween candy and netflix. and someone who takes so much inspiration from you. thank you for giving me a daily dose of very black, beautiful and queer empowerment and helping me love myself even more with every post💕💖💓", "iamjendon72": "Newish follower 🙋🏻‍♀️. Really enjoyed your humor and seeing the glimpses of what you bring to your sex Ed classes. I’ve been listening and learning from you. Thank you.", "jmariegray": "Plants are almost as gorgeous as their Mama ♥️ been following since the summer, love and respect your work (and eb's)", "raubasti": "💗 Hello!", "1151west_wash": "Hi! New follower - thank you for having me! I look forward to learning and growing. ♥️", "envick": "Hello! I’m a human rights based medical simulationist and I’m very very grateful to see and hear some of your work here.", "mynamescodybarr": "hi! i started following you after you strut like a force of nature during NYFW. i was excited to find out there's WAAAY more i can learn from you and your followers beyond how to be confident in my own body. i appreciate and look forward to your stories that force me to think about topics that make me uncomfortable. the more i learn and listen the more i realize my discomfort is absolute garbage and a privileged mechanism to avoid discussions and lesions THAT MATTER IMMENSELY. thanks for telling it like it is. i want to be a better person and i think the discussions and action that spur from your IG is helping me make that happen.", "12minimooster": "Hi, I'm Muireann, I'm Irish (although living in Switzerland). Just here to listen and learn :D", "anglebbz": "Hi from a white passing, queer, low femme settler! I’m an artist with PTSD in academia right now. Im just starting to teach and I’m excited to hear your thoughts on education and breaking down oppressive systems in classrooms!", "zaria_belle": "My fave part of all of this is \"even tho @instagram is one of those structures\" 🥊😖🙈🌠 oh and #sagittarius (our season is almost here❣️) @ihartericka", "mmarella": "I’ve been following you for less than a year and I’ve not only learned so much about all the topics you shed light on but also better ways to be more aware of what is being said around me, to me and by me. 🙌🏽 Keep up the amazing work", "tara_ann_moore": "New follower. Here to listen. Reading and researching to learn. Thank you.", "secretultram": "¡Hola! I am Mariann, from Los Angeles, CA USA. Part of my identity (Korean American, Mom to daughters, partnered with a man, manager at a woman-owned business) is being one of a team of ministers at a largely white, justice-loving church who are on their journey of awareness and decolonizing our worship space. We’re taking active steps and have a long way to go. 👂🏽👂🏽👀💗 So glad to be invited and welcomed here. ¡Muchas gracias!", "ben_casserole_": "You're such an inspiration. I love this!", "samaliarose": "Hi!!! I’ve been following you for some time. I’d love to meet you one day.", "findingpaola\nVerified": "Verified", "chanti_bk": "I just love you my fellow breast cancer survivor .. you inspire me everyday as you live your life 💜", "kalitate87": "New follower, happy to have found you!! 😍", "1sewwhat": "Hi", "mercii_me": "Hi there ho there! 👋🏽", "fringeish": "Is there a way to pay you and Ebony for your work? A patron or paypal? Sorry if I missed it posted elsewhere. ❤️", "twoforthebar": "Hi from Vancouver, BC and thank you! 💖", "spideyleshi": "HI! I love your page & all the work you do! My name is Ashley, I’m from a totally different place (Chinese-American who grew up in China, now lives in the Bay Area) but I feel grateful to learn so much from you♥️", "west.coast.wanderer": "This photo 🙌😍🙌", "youresuchabetty": "Hello! I am new-ish to your page. We interacted a little last night. My name is Betty and I’m a born and bred first-generation Bostonian. I’m a social justice troublemaker masquerading as a suburban yuppie. Nice to meet you 🍓", "k6mil": "Hi Ericka! I been here but I appreciate this intro and your note about the non-profit industrial complex — very real and often overlooked.", "astridisfamous": "THOSE UNDERWEARS!!!! 🖤", "lovemomotaro": "😘😘", "kennaconfetti": "Hi, I’m McKenna. I have an obligation seek education and information so that I am a more caring and inclusive neighbor. I appreciate you sharing all that you do.", "fatou_nte": "Hello from Paris ! You guys are amazing 😉", "maliabeth": "Hi! Thank you for the intro!!! I love following and learning from you.", "saturdaysareforsexy": "Thank you for that intro Ericka!", "audeveofeden": "New follower here, nice to meet you! 🤩", "noori_artista": "gods you are BRAVE. And a spectrum of things but damn... BRAVE.", "mohawktheeducator": "Intro post is a good idea. I don't know who the fuck be viewing my posts that I don't follow back, and rarely comment lol", "booksfightback": "I’ve been here awhile but always love learning more about you and Ebony. Also, fellow sag 🏹", "spoileralertchick": "Nice to meet you. I found your IG through your modeling and was happy to find all this wisdom. Three women in my life fought breast cancer and only 1 won so your story my faith in survival and thriving. Im also out here in Barbados quoting you on a regallah. Much love ❤ thanks for sharing yourself ❤", "amaliaefowler": "Hello! New follower and looking forward to being here. Thank you for all you do", "darknsoulless": "Do you know how nice your legs are?", "molridia": "Hi! Ya'll are great. ❤️", "justcallmenats": "Hi! Been following you for for some time and love you. Love from the UK x", "laughingmuse": "Hi! ❤️. I’m Thalia. I’ve been following you for a little while but lurking and learning. Hopefully the heavy emphasis on learning, although you inspire me as well! Thanks for the work you do!", "haniyayyyy": "Hello! I’m a new follower and I’ve learned a lot just from this short time I’ve been following you. Thank you for everything, sending you love 💗 💕", "askangy": "👋🏼...i'm new. Thank u for sharing. Yay this inspired me to do the same for new folks too.", "mysisterskeeper.rnr": "Hello from Montreal & Manchester!! 🤓 You are a revolutionary and I love that you challenge and introduce me to different viewpoints!! ❣️❣️❣️", "spokentruths21": "Hi! Sending peace and 🖤 your way! I throughly enjoy following you. Keep it pushing mama. You and Eb are 🔥", "brooklyn_smurfette": "Hello. I want to say thank you for paving the way. I look forward to listening to your journey. 💙❤️💖💜💕🙏🏿🙌🏾", "__jellin": "hi hi thank you for all you are!!!!", "superfunkynath": "Hi from Spain... From another mama surviver, renamed interstellar Unicorn ( was the only one of my kind here, until 2 years ago...) My lineage as yours is my resistance... Just shared some of your stuff over here let’s see if they get it... Big up for the amazing work... ❤️❤️❤️❤️❤️", "guarantee_gfx_designs": "Good day .. I am a graphic designer and I do any sort of graphic design such as Cartoon music video, cartoon pictures, Logos, avi's, Flyers, Mixtape covers Animated nicely.. DM if u need one.. I Charge on affordable rates... Looking forward to you ✔️✔️✔️", "mafo6617": "New follower, here to learn...much gratitude and love for your work❤️", "samiyashakir": "I look to forward to waking up to your posts. So much respect for all that you are and do. You are legend! ♥️", "mascara_boi": "Hiiiiiiii! Love your posts and transparency ❤️", "sarajayne.poletti": "My partner is my sometimes photographer, too 😉 Nice to meet you!", "vitonga": "LOVE YOU THANK YOU KEEP IT UP KWEEEEEEEEEEEEN 💅🏾🌈🌈🌈🌈🌈🌈💜", "ohthatsgracie": "Thank you for the intro. New follower here 🌟", "raven_ember": "Been following you for about 6 months now and have received the most education from you that I ever have in my life, I’m a young person living in an extremely white town, doing my best to dismantle misogyny and racism in my own life and community, I am forever grateful for all the work you and ebony do, and the genuine change you’ve made in my life and the way I perceive my own education and roles in these systems of oppression", "brcamazon": "👏👏👏", "scottishpaul1": "❤️", "pintsizenurse": "Follow Sag ♐️♐️♐️💗💗💗", "rubennatal.sanmiguel": "♡♡♡", "death_decay_and_sequins": "Been a follower for a while and just want to say thank you for helping me realise what i can do to try and implement change as a white female. I'm in the UK but I hear from my friends that there is so much work to do here as well so i will keep spreading all the information I can to help.", "serenakabatzinn": "Hi!! ❤️🌈🌈❤️"}