{"alittlebitsofternow": "🧡🧡🧡", "whenthebevybreaks": "This is beautiful and liberating and thank you for sharing!", "tiredart": "❤️", "_artistichair_": "💖", "luminatingruminating": "💗", "quest_ct": "❤️", "pignolia": "Thank you.", "lora_adele": "Are you BRCA positive too?", "campmolly": "💛💛", "childofelderblood": "Every time I’m weighed I tell the person this, I don’t want/need to see the number, they can look at it, write it down, silently judge me, but I don’t want that stupid downward cycle of anxiety and depressed thoughts, so I turn away. This has been such a saviour to me, to take back control of this.", "misskatlin": "You display self-love in the most important ways and I love and thank you for inspiring my own self-empowerment. 💚", "michelle_bee18": "❤❤", "teslacenterfold": "❤️", "naturally_fitlondon": "Sending positive vibes your way 🙏🏽", "ashangrila": "Yaaay good for you Ericka ❤️🙏🏻 sending u a big hug", "always_sam0.o": "🙏👏", "ongthbf": "ها ولج خبله", "ceylonbluesapphire": "White coat anxiety is real, tangible, & studied in professional health schools, yet it is never really mentioned to patients. Thank you for sharing this great example of patient advocacy!", "mcclkathryn": "Wow! This is fantastic- when next I’m at the doctor I’ll practice this. I have chronic conditions so I’m there so often I just put up with it", "kadiesurri": "Yay! For health and no negative news.", "lilcosmic1": "I've been in recovery from my bulimia for 6 years. I only gained the courage to refuse stepping on the scale about 3 years ago. There have been multiple times where nurses will actually try to argue with me and almost force me to weight myself. It's really irritating. It makes me angry that the nurses I deal with don't know how to work with someone in recovery. I've gotten sassy about it and as soon as they say \"now let's take your shoes off to get your weight\" I just reply with \"I can give you an estimate\". And of course my blood pressure is high after that too! 😤", "poet_ifrica": "💓💓", "darkbluespeed": "@grace_abundantly THIS IS YOUR RIGHT!", "erinsummer1": "A few weeks late to this, but I’m a new survivor. My weight is consistently an issue in relation to my cancer. When I was first diagnosed, I was scared people thought because I was a bigger woman, that I almost had brought it on myself—like hello it’s fucking cancer. Now that I’m done with treatment, it’s like well what’s your next step? And all this pressure to lose weight. And what if I don’t?! Lol, you know? As I stand here looking to my new normal like a giant abyss. Thank you for highlighting this. It took me years to love my body...And that same hearty ass body just walked cancer treatment like a dog. One foot in front of the other.", "onesweetkitty": "Take it a step further and ask if it can be skipped. I started doing this a few years ago and I’ve only had push back a couple times, but they ultimately let me skip it after I told them my weight.", "twitchywitchygrrrl": "💜💜💜 thank you for this.", "mrsallisonrau": "💖", "hannahmathers": "❤", "amylubbs": "💕💕", "createhealshare": "Yaaaasss to advocating for yourself.", "nbarozco": "❤️", "kimsalerno": "❤️", "a_fern_in_the_gully": "❣️💐💞🥖thank you Ericka for being such an amazing person and educator, I appreciate you and your work immensley. Wishing the best for you and Ebony", "itsemilyjo": "I started asking for them not to tell me my weight a couple years ago and it helps my anxiety A LOT. Sometimes it's the little things.", "dsrn": "Dang. That place always makes me nervous as well! It’s a strange paces cause they might tell you may be sick. walking in there is a ptsd Attack waiting to happen", "breezym93": "I went to my dr appt yesterday and as soon as I stepped into the room I felt a rush of anxiety I hadn’t while I was in the waiting room. It sucked and my blood pressure went up to 141/86 and just the week prior I had been at 121/79 or something. Grr it left me jittery all day! I’m glad you had such a smooth dr appt! You deserve the best because you put up with the rest :) Next time I go in, I’ll practice the same exercise and own my visit! 🙏🏾❤️", "the_lez_bear": "❤️", "katienumi": "such an awesome thought. wishing you the best for 2019!!", "lori.sara": "❤️I usually just check your profile tho and don't wait for the algorithm", "masademar_": "❤️", "jencomas": "❤️", "thisisnikkinicole": "Thank you... I'm goin to take this advise in my everyday life and lessen my anxiety encounters @ihartericka", "yesitsdimi": "Well done, you're doing good all around", "johannagomez\nVerified": "Verified", "aubiibear": "💚💚💚", "sarahdayarts": "hell yeah ericka ❤️❤️❤️❤️", "dinaragab": "❤️", "debianazulmira": "I always stepped on the scale backwards at the doctor's office for about 5 years. If you just do it they don't ask questions normally. I'm at the point now with enough medication and therapy that I can look at the number and regardless of its up-and-down fluctuations it doesn't give me the same anxiety it used to but it's still there. I get it love.", "qiyonce13": "❤️", "maryannstagram": "♥️", "allbodieshealth\nVerified": "Verified", "emmaquigan": "💓", "wheelsandwhiskey": "💜", "sohairtherapy": "❤️❤️❤️", "jesicomelately": "❤️", "norinicole": "Woo hoo! Happy to hear your checkup went well!", "_ellitt": "YES oooo this is so smart", "bridgethegap5": "💓xx", "halfblackmagic": "❤️", "bbbbbbb.bb.bbbbb": "❤️", "lauralovingherself": "Out of curiosity, have you been tested for the BRCA genes? I only ask as my best friend has just found out she has the gene and was told it's responsible for a lot of younger cases of some cancers, one of which was breast. She had surgery for a pancreatic tumour 7 years ago and they literally only told her last month that she'd tested positive for the gene. Apparently it isn't tested for routinely and most people aren't aware of it's existance so I wanted to make sure you are!", "enolamusic": "This is soooo me next week! I’ve been feeling this way all week since I did my blood work for my oncologist. Thank you for sharing boo! I’m glad I’m not the only one. ❤️", "martasnaefridar": "💖 Proud of You 🙌🏻", "steviekicks_": "💕💕😃😎", "bethlovesmoz": "So happy to hear this. Also in February, I’m going to refer to my scanxiety as an anxiety party because it seems better that way. An oncologist all clear is a wonderful feeling. Love to you. ❤️", "joleenouvel": "❤", "notlexipatterson": "❤️", "bounce_n_jiggle": "Brava!", "thediscowalrus": "❤️❤️", "baring.soul": "❤️", "sazzlegazzle": "💖", "sheldridge": "❤️❤️❤️🙌🏼🙌🏼🙌🏼", "iwantapineapple": "❤", "itsjnm": "We should all do what works for us more💛 #thankyoumoreplease", "amandadenness": "❤️", "aleyza___": "Yeeeess💖💖💖💖💖!", "goo_ooder": "❤️", "archie_bakes": "Glad your appointment went well, and thanks for sharing how you navigated the weigh-in", "lagrossetoile": "Your oncologist is right, you have been looking phenomenally healthy and relaxed in the last couple of posts - stay that way!", "korc.can": "💙💙💙 its gonna be ok", "joralcord": "💖🙏👏☀️", "gasponce": "#yay well done <333", "vintagevegelover": "We will all find little tricks to ease some of the anxiety... it’s just finding them .... x", "gloomiegal": "❤️", "lizzie_archer": "❤️", "e.obioma": "❤❤❤❤", "i_am_rayj": "Im a nurse and make a conscious point when I weigh people to say, this number is just your relationship with gravity! It doesnt weigh what an awesome person you are. Its just a dang number! Glad you are well 😊", "compu_karen": "❤️", "youcancallmeow": "Last time I was weighed for my cancer check in the nurse said ‘wow, have you gained a *ton* of weight recently?!?’ And I’ve been dreading going back. Thank you for the reminder this isn’t how it has to be ❤️❤️", "thatdopehippyshit": "❤️", "danika_vincent_": "❤️❤️❤️", "am.gallegos": "💜", "katrinarin": "❤️", "jessie_walnut": "💓💓💓", "sokosea": "❤️❤️❤️", "thekatjams": "Yes!! I love this so much 💕💕", "erinjoycemcdonald": "💜💜💜", "selima325": "💓💓💓", "estherdstanford": "Great news! I recently started saying no thanks when nurses ask me to step on the scale.", "raiz.y.flor": "❤️", "hello.krizzy09": "❤", "manyblankets": "thank you for this brilliant wonderful post", "sarahhfai": "♥️", "lalalatia": "I broke down in tears reading this the anxiety never goes away???? Every time I go for a follow up I’m drenched in sweat my heart is rapid and it’s hell. I just keep hoping it gets better I mean I’m doing the work to try and make it reality but I’m glad I’m not alone.", "smol.fat": "Yes yes yes!! I don't think most people realize you don't need to be weighed. The last nurse I had was a bitch about it and purposefully showed me the card with the number on it, even after I told them not to tell me. Like, thanks, super helpful🙄🙄🙄", "dreamlesseye": "❤️", "lliblil": "@yearnfortheurn", "serpentfire": "Ugh YES!! I recently did the same thing by NOT going to a third follow up appt with a new doctor who would know nothing about my history (long story short - dealing with an autoimmune disease that presents like cancer, so I’ve been super worried about that) ...a doc who would most likely fill my head with things I already told my usual doc that I have no interest in talking about. They’re doing their jobs so they sometimes forget about our anxiety, and how certain info affects us long-term. So as you said, we have to advocate for ourselves. Good on you! Fuck yes phenomenal health news! So happy for you! ❤️", "blackthumbbotanicals": "❤️", "acta.actanonverba": "❤️❤️❤️", "mayreet": "❤️", "artsymarie": "Fuck yeah! I get follow up scans every 6 months following my eye cancer treatment (and lots of other eye appts in between) and every appointment is triggering. My oncologists office measures in kilograms which doesn’t really register for me. That’s a great idea to turn around! I have trouble advocating for myself at times in appointments when my anxiety/ptsd is triggered, but I’ve been working on it. Hugs 🤗 to you 💜", "gigitahini": "❤️", "martha.c.daniel": "❤️🧡❤️", "kimberly.michelle_": "Thank you for this!", "sophiabush\nVerified": "Verified", "sonyamarxdances": "❤️", "bria1.0": "❤️", "lo_mckensie": "❤️", "lavenderqween": "💜", "the_jennerator": "Love this post and your honesty. Thank you for inspiring all of us!", "julianagrassia": "❤️", "ashveg": "❤️", "olboikino": "♥️♥️♥️", "tonimakesdinner": "❤️", "katharina_thomas": "❤️❤️❤️", "lorainford": "❤️", "_rilks": "❤️❤️", "survivormoda.rachel": "💗💗💗", "kimjuliehansen\nVerified": "Verified", "angel_lavelle": "😍", "chikychorres": "❤️", "r_____b": "❤️", "levibenjaminlewis": "👏🙌👏", "kiki_na_art": "Legend x", "dvonschwerin": "❤️🌱🌵🌿❤️", "ms_a_renee__": "Yes that anxiety is too real. 2 year survivor and still gets nervous after labs and mammograms. sn: I see I’m not the only one telling the nurse assistant that I don’t want to know my weight. Lol", "kieranblake": "@honeybellwest made me think of you. 💪🏻", "locustlightfarm": "Good good good good good!", "drea_bolt_art": "💕", "odwallafemme": "Everything about this is amazing!! Last time I went to the doc my blood pressure was high too right after hearing what my weight was after years. I was like “taking blood pressure after you weigh a person....interesting” hopefully it made them think about it. I told them it’s always good when they take my bp at the dentist, no scale, so", "confessionsofa21stcenturychick": "❤️", "rachierach___": "I actually just decline to weigh myself. I just say, “I will not be weighing myself today. Thanks!”. I haven’t weighed myself at any doctor’s appointment in years, *except when I was pregnant.", "reedjessicalynn": "♥️", "littlecassieopeia": "❤️", "to_clairify": "❤️", "godhelmuniverse": "Yes!! Just because they went to med school doesn't mean they know everything!", "sorry.not.heather": "this is so good. proud of you for protecting yourself!!!", "birdsongbrooklyn": "💜", "soulful.nutrition": "🙌🏾💖🙏🏾", "mx.olh": "This is awesome! Thanks for sharing this and helping motivate the rest of us💕", "subwayreads": "I work at a clinic and a lot of patients ask to not see! Glad you found something that worked for you!!", "magsmoynihan": "❤️", "daynadono": "😘💕💪❤️", "tdub0110": "So very true! If you can't advocate for yourself, than no one can 💖💯🙏✴️do what works for you.", "sarahlundberg": "♥️", "marymcinema": "❤️", "mystralgurl": "❤️", "whishb0ne": "Love it! So valid", "tinsleytj": "❤️", "foodfreedombodylove": "🙌🏻🙌🏻🙌🏻", "violetcells": "♥️♥️♥️♥️", "cassiebanjo": "I did this last time I went as well! So powerful 💖", "umlaah": "❤", "jasminemondshine": "❤️", "mynamescodybarr": "❤️❤️", "adamenotalady": "Hooray for the good news and good health!", "briest": "❤️❤️❤️❤️❤️❤️❤️", "virg.gal": "Exhaaaaaaale and have a peaceful night.. nothing like a deep sleep after Onc says you’re doing great :)", "bperformer": "❤️", "the_salonlounge": "Thank you. I will start working on my anxiety for my next exam before 2019. 👌3 years clean record so far!!!", "waffledump": "2019 is the year! Thanks for sharing!", "rey.thesongstress": "❤️❤️❤️", "hairbysusy": "💜💜💜💜💜", "samanthanicolefonteyne": "💗💗💗", "konceptualk": "You are stronger than what your mind tells you.", "mel_cole": "❤️", "_verxnica": "❤️", "_acceb___": "Congratulations Ericka 🙏🙏🙏❤️❤️❤️ and I do the same blind weigh-ins when I go to the doc!!!", "fireflyhealing": "Ahhh yes!! Big big congratulations for being such a strong advocate for yourself. And big congrats for a healthy check-up.", "mghsmith": "Woohoo!!! Love to heat that it’s all clear scans.", "singleparentsalonetogether": "💕💕💕💕💕", "myneckmybackhurt": "Thank you for sharing this!! I’ve been building up my courage to have a conversation with my PCP about why she has the BMI chart on her wall when it is not at all evidence based. She has more or less respected my repeated boundary on weight loss/diet talk but I’m nervous about it still", "heyitsbeffay": "💛", "queer__binch": "❤️", "ahbramey": "❤️", "moberdorfer": "❤️", "aliciakadventures": "I get so much anxiety about going to the doctor. Thank you for sharing this. It makes advocating for myself in a stressful environment seem so much easier. 🙏", "theofficialerinblack": "I LOVE this. Thank you for sharing and being so open here. 💕", "jenniferc00lidge": "@ixtliawakening ty!", "hotlegsharriet": "❤️", "chloeamorel": "Thank you so much for this!", "samanthalindsay": "YES. Good job for the self advocacy, unwanted comments from providers are such BS. I don’t fuck with the scale any more, not even at the doctor.", "julia__clara": "❤️", "mahoroheidi": "👏🏾👏🏾👏🏾 For taking steps to manage your anxiety! Thank you also for sharing your no-weighing script. I’m getting ready to go to a new doctor and have been practicing ways to advocate for myself from a HAES perspective. Reading about your experience has been so helpful!", "classyallthewayjes": "Thank goodness you’re ok good job. It’s always a blessing !💪🏾💪🏾", "sammplss": "❤️❤️❤️", "naima__amall": "So happy to hear you made out well love and light 💛", "like.i.came.by": "❤️", "crimson_fig": "✨🖤✨", "adri_nicoleee": "❤️❤️", "cheese_and_picklesss": "This this ❤️❤️", "rileyandlunaadventure": "❤", "chronicallyerica": "Yay for phenomenal!!", "thefatsextherapist\nVerified": "Verified", "soultrainian": "Wow I always just close my eyes and hope for them not to say it, but it makes me seem like I’m ashamed of my weight. I’m not it just but that number & the discussion around it that usually happens at the doctor gives me a ton of anxiety. Heading to the doctor now and totally going to practice this!!! THANK YOU FOR EVERYTHING", "linnaebae": "❤️", "dirty_deeds_done_for_creeps": "❤️ such a great idea, thank you so much for sharing!", "naturalisticexpectations": "❤️", "riddellmkm": "It means so much that you share this. Thank you.", "theimmaculatewitch": "Way to go! That's awesome that you advocated for yourself like that! I've been working on that too 💗💗💗", "l_zawacki_m": "♥️♥️♥️♥️", "resetrefocus": "❤️", "heatherwaxman": "❤️", "itakepicturesofstuff1988": "Can confirm, had chemo today, and since having a major procedure that left me super sick, I'm 25lbs lighter and never.felt.worse. The numbers mean nothing when it comes to how healthy you are...also I'm living with this shit in my body so even \"being healthy\" is a new normal that means new different things. The cancer world is hard, but thanks for being the advocate you are ❤️❤️❤️", "lizziedrippinn": "❤️", "wheelofashes": "❤️❤️❤️❤️❤️", "cheyenneleskanic": "❤️love to you. Tapping techniques to release trauma and left nostril breathing pranayama help my daughter going to her hematologist office. (It helps me too and in a thousand different ways)", "wendboon": "So strong", "hipfat": "❤️", "carol7403": "You have to set limits if you’re going to get through these oncology appointments in one piece. Brava!", "ohthatsgracie": "I'm happy for you 🌟- Good job, older @ihartericka, and thank you for sharing the words you used with us. Now we can all practice :)", "tkjcollins": "Every time the nurse asks if I wanna know what the scale # is when I get weighed I say no. For the same reason. Rock on, woman♥️💪🏼", "rachi0head": "🖤🖤🖤🖤🖤🖤🖤🖤", "meowmeowlawl": "❤️", "lornajanemartin": "❤️❤️❤️", "juliebherenow": "I go to mskcc - I do this every visit with the scale- but last visit- while she didn’t tell me the number, she came back to weigh me again to make sure it was right saying, ‘it went way up’ - thanks nurse! I haven’t been weighed since my surgeries 5 years ago- who needs that shit on top of cancer?! I know my soft spots and my jiggles- they talk to me. On that note- I also don’t check my breasts/ don’t need more bad news- gonna schedule mammo on January tho’.", "kira_n_m": "❤️", "_maurr": "❤", "alwaysmelcat": "❤️", "pamela_prediger": "Omg that is perfect. I had surgery on my ruptured Achilles 3 weeks ago. Before surgery they weighed me, I had my boot cast on, I said, let me take it off...she's like, oh no just get on...with my big effing boot cast. Needless to say I was pissed. I love love love your response to the Nurse.", "vermilion42": "Congrats!! Just had mine last Friday, I'm good till June and I love your idea to get a true BP reading, that's good info. I always try to make them let me sit for a minute and have my feet on the floor.", "rikkilynne": "❤️❤️❤️❤️", "blurredbytheheat": "💓Yes!", "msalykake": "Glad to know I’m not the only one that gets crazy anxiety whenever I go to the hospital. Thank you for validating cancer survivor/thriver emotional rollercoasters.", "moontwerk": "💕", "allie.plummer": "So happy to hear this good news for you. I hope the new year continues to bless you with health and happiness and thank you for all your work. You are an amazing force and we need you! ♥️", "begoodkarma": "I didn’t see it, until the story prompt. 😭 ❤️❤️❤️", "hruggi": "💗💗💗💗", "indigo0o0o0o": "jets: cooled", "stampnicole": "❤️", "flyinglikeabumblebee": "❤️", "bluth_ish": "Yaaasssss!!! So happy to hear that u advocated for yourself & that u r doing well. I will never forget your “Benign Benign Benign” dance from a while back. Much love to u & your turtle. ❤️️🧡💛💚💙💜💖", "leeniebeen": "I am so grateful for what you share here, thank you ❤️", "ashmarie2112": "I stated no thank you to being weighed and the nurse told me I sounded like her grandson when he doesn’t want to do something 🙄 My doctor however shared it is unnecessary to be weighed at each visit! Good for you!", "nataliebrannigram": "❤", "larisajeannie": "💕💜❤️💚💙👏🏼", "charlotte.gianna": "Taking care of your health sucks sometimes. Still waiting for a callback from my colposcopy for results, and cervical cancer in the family doesn't help the brain game. Glad to hear it all went as well as it could!", "hannahhunt.png": "❤️", "bethanybumbleb3": "💕", "dillllnpickle": "@ihartericka I feel you!!!!!!!! I had a second time in two weeks biopsy done. Cancer Betta not come back 💯.", "lacoronaofqueens": "❤️", "makelemonadewithlupus": "❤️❤️❤️", "glynnis": "❤️", "neicy_godsproperty": "🙌🏾🙌🏾🙌🏾", "saint.lexis": "❤️", "mashelbee": "♥️", "katerimorton": "YESSS 🙌", "yohanajunker": "I absolutely love how you love yourself into being WHILE helping so many of us to have the courage to do the same. Thank you, thank you, thank you.", "cheesybunnie.84": "I love this whole post so so much 🥰", "hopefulfemme": "❤️", "stephaniejohnsen": "Thank you for sharing this. ❤️❤️❤️ I’m saving this post and want to remember to do this next time I go to the doctor. I love what you said to the nurse, “Not denial” and the number on the scale has no correlation of overall health. 🎯 🙌", "wild_hunt": "You are a light. And I hope you made it through with ease. AND. As powerful and inspiring as it is for you to stand up in that moment, it makes me fucking sad and angry that you have to educate the nurse in a vulnerable moment for you. Thank you for sharing your experience so that we can learn from it.", "jocelyn.lavon": "♥️", "jnnsin": "❤️", "hiikaree": "❤️", "lyiahsimone": "❤️❤️❤️❤️❤️", "somewildbee": "Thank you for this. 👏 I have severe doctors office anxiety from a few pretty bad experiences and as a result, my BP tends to skyrocket. Someone mentioned I could ask to have it taken at the end of my visit and I was like “whoa - what!? I can?!” It felt like permission to do what makes me feel most comfortable in a situation where I feel like I have very little control. Wishing you all the good health in 2019! 💛", "sunshine.autonomy": "Love you so much. Thank you for sharing this and modeling advocating for mental health at these stressful ass dr appointments. 💓", "taraviolet": "❤️", "ixtliawakening": "Yes! Yesterday was a BP followup appointment for me and for the first time I refused the automatic cuff administered by the assistant. My arm isn’t shaped for the auto cuffs and they just hurt and hurt, only to need to be redone by the doctor manually after. This is the first time in ages I’ve left an appointment without bruised upper arms. I’m sad it took to 31 to realize I could say “I will not allow it to be done the way that hurts me because you mistakenly think it’s expedient”.", "oliver_yvng": "❤️", "zkateryan": "💪🏽💪🏽", "asap_bergy": "Yessss. in canada they give the weight in kg which i dont understand as ive been trained to value my worth in pounds. but i stopped asking for the conversion awhile ago and never looked back🙌", "clinknows": "❤️", "bootasha": "I had a traumatizing experience at a new physician’s appt when I got sutures removed and they pressured me into a check up so that the appt would be free (aka they could double charge my insurance). I was body shamed twice. Once when I requested to not see or hear my weight and he said it out loud anyway. And a second time when he verbally expressed confusion at my low resting heart rate because apparently you only see that level of fitness in “athletes and skinny people” - his words.", "lj_duff": "❤️❤️❤️", "melissasmores": "♥️", "12lizzie12": "OMG THANK YOU FOR THIS. I had never though of asking to change that routine into something easier for myself ... You are a fucking goddess 👏👏👏", "funnybitch054": "It feels good to know that l’m not alone in this. And that a person like you, a strong, smart, inspirational person, can feel it too. Thank you @ihartericka", "mrdresskode": "Thank u for this", "cosminomena": "❤️", "macrenee31": "❤️", "katjuschka____": "thank you for sharing that and I am happy for your health❤️", "thenancydenisshow": "🙌🏾🙌🏾🙌🏾🙌🏾 #BigGirlWays 💙", "rowena_kosher": "I always step on backwards to protect myself from tiggers for my ED. And they always comment on it! Very frustrating and anxiety producing. But I will continue to advocate for myself 💪. Thanks for the reminder!", "voodoomamii_": "♥️♥️♥️♥️♥️♥️♥️♥️♥️", "rising_of_a_phoenix": "❤️ this makes me happy to read.", "candiceanitra": "Genius!", "jazzyfaye.24": "YES. I have gone 2 year not weighing myself and tell every doctor that I do not want to know my number exactly for the same reason.", "hayhay.cannoli": "So glad you're healthy and doing well! Sending so much love to you! 🌹❤️🌾", "missmeltingpot": "As a fat person that also deals with anxiety, my blood pressure is always slightly elevated at the doctors, and I’m curious if you’ve ever needed to defend this to your doctor/care giver? I got to the point where I got sent home with a blood pressure sheet to track it at home. I guess basically my question is, do you have any advice for a fat femme on dealing with this type of thing from doctors? Not sure if you face the same issue, but I figured it would be worth it to see ❤️ any sort of doctor visit always feels like a battle defending my health versus what it’s perceived as because of my size 🙄 and my anxiety makes it horrific! The battle to make my care center respect the fact that I don’t want to see my weight on the scale was already painful enough", "books_and_critters": "❤️❤️❤️❤️❤️❤️", "frumpypaintbrush": "I always just close my eyes and hope they don't say it out loud 😩😩", "malaikanicole": "❤️", "arianna.spiller": "Hell YES!! My natural mentality when I go to a doctor is always just be passive and do whatever they tell me, no matter what. Thank you for being an encouragement to advocate for myself and my mental health", "gracieann_h": "❤️❤️❤️", "moutarde": "❤️", "samanthahorn": "Go fly high on those good news vibes ♥️♥️♥️", "josierosarionyc": "🙌🏾 glad you advocated for yourself", "miraweil": "❤️", "andee.moriah": "I have had this exact interaction with a nurse more times than I can count. Thanks for sharing, feeling encouraged to stand my ground for my needs as well.", "awesomeeveryd": "Yes! Advocate the hell out ta yourself!!!", "05x.88": "Go WOMBMAN! ❤️", "altair_arts_": "❤️ i havent looked at a scale in 2 years and its been so good for keeping my anxiety down at doc visits. here to a physically and mentally healthier 2019", "elyseholladay": "this is amazing 🙌 stay healthy in all ways ❤️", "kellyshoestrings": "I see you. ❤️", "shellbygrein": "Saving this post for future appointments. Thank you for sharing!", "gteyez": "Oh my feeling the same way. Haven't had a good night sleep since Saturday. Up coming appointment tomorrow 🙄", "emilymoonbeam": "❤️", "ifurie": "Yes!", "kelz_sure": "❤️", "ajs721": "YES! I stopped looking at the number in the scale shortly before getting pregnant and it was best decision I have ever made for MYSELF. 🙌🏽🙌🏽 FIVE years later and I still step on backwards", "shanhautman": "🙌🙌🙌", "xoxo_ash2019": "@bokiemon", "youngseedssun": "Cheers to health ✨ (and what that means to you)!", "divagirlrn": "🙏🏾♥️", "xenia.mit.x": "Here goes Ericka, being all goals again! I never founs the nerve to say that to my nurses/doctors but I might try next time. (Actually, I have been trying to push myself to do it for years but never actually did it.) I am glad youre good! Keep blooming Ericka🌹", "youfatterme": "I quit weighing at all at the doctor. I only will if I'm going to be prescribed something that is dosed by exact weight or if I ever need surgery. I refuse to open the door to any argument about my body size. They don't need that number most of the time, and I don't need the anxiety that comes with dreading the fat scoldings providers hand out so freely.", "hopebroidery": "Saving this post to re-read the next time I have to go to the doctor and be weighed. Thank you!", "lilnoosh": "💛", "jennytortilla": "♥️♥️♥️", "chloebrougham": "I love this so much and can not wait to utilize this approach", "maiafeliu": "I have thought about doing this so many times, but have been embarrassed or worried about being “difficult”. However, due to my anxiety around being weighed, I just end up not going. You’ve inspired me to advocate for what I need. Thank you for being you! ✨", "3lez": "💕thank u for existing", "celestial_jazz": "I'm looking for a new primary and I'm letting them know how I feel about the BMI chart and weight (I'm nervous about it). Thanks for sharing this.", "lauralushoc": "✨😘✨", "leahtro": "Congratulations!!! ❤️❤️❤️❤️", "nuggetsgurl3": "💕💕💕💕", "odd.bird": "Happy you dealt with it and that you’re healthy. Today was rough for me but I’m better after a hot shower ❤️", "bellasongm": "So much truth to all of this - reminds me that being anxious before scans and oncologist visits is valid and real!! 💞🙏🏻", "bysarahmessina": "❤️ For you and so you know I can see your posts.", "str8.4pay": "❤️❤️❤️❤️", "annagnes_christian": "I love this and now will do this. I get the same anxiety from knowing a number that says nothing about how I treat my body on the daily. Thank you for sharing.", "lex_medina_": "🖤🖤", "ggbostini": "❤️🙏🏼 You’re so brave to be on this journey and share it. Double brave!", "_pinkcavity": "❤️", "everettmeow": "❤️", "nope.not.even.close": "❤️❤️❤️❤️❤️❤️", "beunboxxed": "💜💜💜💜💜💜", "froggie544": "❤️ fantastic! Your advocate for yourself will educate providers on how to treat future patients. Thank you!", "damn_the_torrpedoes": "Sooo good. So good. I deny being weighed at every visit."}