{"barbaricmedia": "What people don’t understand is that if you went to a yoga class once and a white person didn’t move a mat — that is the SAME as colonization, and that white yogi is undoubtedly a member of the Nazi party. It’s just true.", "immutable_love": ".The accuracy.", "pammmgutiii": "@santizo628 and then the lady today explaining that yoga moves came from her modern dance stretches 😂", "tony.hu_": "Reverse racism at its finest. sad that people accepts this 😔", "linamarie24": "Same goes for @stagecoach. Very fn year someone puts a damn tarp down so 2 people can sit with no one around them 🤬 Then they wanna fight when you step on their “spot” 🖕🏼🖕🏼🖕🏼", "pura9": "And have a problem with Yoga being connected to Hindu culture. If you are going to cook Indian food, you will need Indian spices!! 🤣", "sarah_pag": "Your intitled to your opinion but I feel badly as you obviously haven’t taken in the teaching of a yoga practice by making these comments. They feel ignorant to me. Where is it you have been practicing for 8 years to feel like such an outside? Maybe try another style or studio. Have you given any thought about what the person on their mat may or may not being going through. Yoga is a practice to go inward. Maybe it was just a bad day for them. Why so quick to throw in race? So much anger out there we come together to practice together to solidify our connective ness. We are all human beings your assumption of a persons actions is really just a reflection of your own issues or insecurities. Furthermore, do you know where the practice of yoga comes from? “White” people are not the problem “ignorant angry” people are.", "native.hohaia": "@pray4lillian", "jeffrey_memphis": "After looking at your profile I have reached the determination that you are extremely racists. You also seem to have a penchant for being recreationally offended. The world has enough hate and separation, we don't need social justice warriors slinging mud at people who's ideals misalign with their own. Please learn to love EVERYONE or I'm afraid you'll have become the prejudice cancer that you so vehemently hate.", "notbrandongaspar": "@maybebiancagaspar 😂", "modernmommyjazz": "@barbeebritt", "okgurliseeyou": "Whew chile....", "lexicooks_fr": "Omg 😮 This hit the hammer 🔨 on the nail experienced this my first yoga class a few weeks ago", "mj.kahn": "@awww_dre", "anairrda": "I don't understand why the colour was important here. It happened to me both with black and white people and when I told one friend, I have never mentioned the colour. It's about being polite and caring about the others, I don't think we should make it an universal rule. I discovered your profile via a make up artist and I was curious, but I think you are racist, definitely against white people. We should promote equality, equity, human rights, not the supremacy of one race. It seems that for you it's ok to talk bad about white people and see them as the lowest race, but when white people do that you act like omg. What would happen if someone told the same story, but replace the word white with black? I think you will be very angry and talk bad about whites. Hope you see the problem. You are definitely not promoting black people rights, but their supremacy, which is exactly what you think white people have. You should be promoting the things that I have mentioned at the beginning.", "kayleesummersunflower": "Where do you live? Based on all of your posts it sounds like every white person who lives there is terrible. Where I live (in CA) I never see racism. There are white people, hispanics, black people, asians, etc. Most people are nice to each other and no one ever brings up race. Maybe it's just cause we live on the west coast where literally everyone hates Trump lol. You should come to Cali!", "nick_papagiorgio_from_yuma": "How did you ever survive this supremacy?!? 🙄", "anastasiaelizabeth_": "@brooke_jilaine if this is her argument then I equate illegal immigrants to people who didn’t pay to be in the yoga class and no I will not be moving my mat for people who didn’t pay to be in the class", "bronzebeauty2": "They act the same way when driving in traffic.. white folks will not let you cut in front of them. They act as if it’s a life or death situation.", "hazlebeck": "“Yoga classrooms in general are a great observation into white supremacy at play.” Thanks for clarifying that you’re joking, I thought you were being serious lol", "hippiisoul": "(Also I used the 💪 as a generic symbol for strength though it looks more white 🙄 do you have advice on Emoji discrimination?! - is there an Emoji shade that is non-discriminatory?) I really do love hearing what you have to say! 💘", "sophia.florida": "@blythieblue", "logan_bongard": "and this is what is wrong with the world", "amanda_j_rose": "I was in a class recently and the teacher was walking around, politely asking everyone to move. Everyone (various genders and races) moved politely until she got to this middle aged white woman who got so angry she was almost crying. \"WHY ARE YOU PICKING ON ME? WHY ARE YOU TARGETING ME?\"", "cavanaughty_": "Spot On. 🤦🏻‍♀️", "__._simon_.__": "I hate white peoppe", "kreepinonyourcap": "@sarahcrosley 👍🏽", "madhomer99": "Way to be a racist and an ignorant human being. “Now Red, white, black, tan, yellow or brown, it really doesn’t matter we can all get down and do what we like!” A little Digital Underground from this white 44 year old who has had ZERO special treatment due to it. Get a life and be happy instead of worrying about being held back.👊🏿", "emiandcats": "@geraldineahsue", "nata.leero93": "All I got from this is that your conclusion is that white people can be extremely egotistical", "findaname99": "Not in my yoga class since 12 years", "laqueen_noir": "🤣😂", "conradvalor": "White people get punished for ever deviating from their assigned spot, so big surprise there. :/", "n.eondemon": "Any non-colonised yoga classes in Seattle?", "yari1012": "@bellavidadanij GIRL!!!!! This is so fucking factual.", "anna_lopinski95": "Wow this is super racist. Thanks for spreading more hate and ignorance", "whatsnewlu": "came to peep the white chicks arguing 👀", "decmoto": "yeah don't think she realises white people was just doing what everybody else was doing", "valentinalbertoj": "❤️❤️❤️❤️", "faizahmua": "Lol", "francesca.fresca31": "Pathetic post !!!", "cesaramg1990": "I just tell them to fucking move over and they do. White people be staying scared.", "jorge_hernandez2000": "@vilanunderdog Read these comments. They’ll help you with your psych project. Lots to diagnose here.", "kirsty_beckett": "@milli_bh 😂", "whatwhatintheguts": "Very well put!!!! I’m white and for years, have had an on and off relationship with yoga classes and this is one of the reasons. What a bummer that these classes that are there to promote peaceful vibes can suggest otherwise. I’m gonna keep trying when I have the time to get into a studio and hopefully if everyone can spread that kind of mindfulness of sharing the space and moving around, we can get back to those namaste vibes we’re seeking ♥️", "domo_osso": "@joshkrameryoga pls read thank you.", "galic4girl": "Oh goodness YES! I OFTEN have to check this level of nastiness through my Namaste!", "franciathegreatt": "I don’t even take yoga and I fucking know. But yet, when I’m at the gym I’ll move my mat over to make room for anyone WITHOUT being asked.", "kyle_g._": "Ask them to move it", "fluffbar": "😍", "mcohen117": "This is the best post I’ve seen all day (ok, all year!!). It’s upsetting how often I’ve seen white women act this way towards the WOC I see in classes.", "koroit_": "Omfg this reminds me of taking the bus (I'm white myself too tho) and when it's really full noone wants to move to an empty spot to make space for more people like as If that spot is cursed or something", "amanizzzz": "Ahh I’m doing a 30 yoga challenge and THIS HAS HAPPENED TO ME EVERY SINGLE DAY. to the point I have almost walked Out of class. The worst is when they put their mats literally in front of mine so I can’t see myself in the mirror or when they are too scared to leave their coat in the coat rack and bring it into to class taking up SO MUCH SPACE.", "not_an_ancap": "Oh man I hope y’all are stretching before making this reach 😤🤧", "thugzofficial": "Yoga is not for black people anyhow. Mediation is", "chickyparm": "HYPOCRISY", "princessnokia\nVerified": "Verified", "djeeezydik": "What in the hell", "eclectic.intuition": "I remember when I was in a class and a woman came to me and asked if she could “squeeze” in next to me. I said, of course, there’s plenty of room! because there is enough. For everyone.", "thisisstarchild\nVerified": "Verified", "what.kels.sees": "@katherynwinnick - I don’t want to drag you or make you feel bad, but I think you would benefit from observing the conversations that took place in this comments section. Taking a tour of a slum that doesn’t allow tourists and sneaking videos is 100% not okay. You’re taking up space that’s not meant for you. If you want to discuss this further then you can always DM me. There are some resources that wonder WOC have created that assist white people in doing anti-racism on themselves. Every white person can benefit - including you.", "joannmurph": "🖕🏼", "lianna_la.tejana_": "This happened to me and I’m a white passing chicana. This white girl was trying to hold spots for all her friends and said very loudly “well people can just move when they get here” and I gave her the nastiest look like bitch I am not moving for the 5 ppl you’re trying to fit in a two mat spot! I really value my personal space and I HATE when people totally ignore it or run over it. I don’t want to be forced to go somewhere else or practice at home 😓", "nneggy": "@itsrahni!!! This!!!", "bohemian_in_bali": "Where's the like? 😂", "xojunexo": "Truth", "sepats": "@eem4771", "rachella805_": "I recently went to a Kundalini yoga class that was 99% white people and they tried having me fit in a corner. (I’m not white to white people and I’m not brown to brown people- great thanks!) They wouldn’t even make room for the 2 white people that came in after me until they were asked to rearrange their mats 🤦🏽‍♀️ they came to a class about raising self awareness, but can’t even assert what’s literally right in front of their faces! SMH and not a single black person was in the room. I don’t see that this behavior is toward black people specifically. I think that, like you’re saying @ihartericka, it is just built in so deep. @iamrachelricketts was a guest on #reclaimthepodcast by @iamthaissky and that forever changed my perspective on this. White people (even if you’re only half) have inner work to do! Honestly, racism is all over the world. Society is increasingly becoming that which they hate. We all have work to do and it starts with compassion, listening and digging deeper into what we resist (ie: “but you don’t know me and I’m not racist” = you are unaware of your racism and will be so, until you dig deeper.)", "brookitaspivey": "Yea but I’m not sure if that’s because they are white are because most people dare confused when strangers talk to them in public....I mean maybe it’s just white people are confused..:but seriously have you ever been in a dance class or anything where the teacher wants people to get in line! Ppl are very confused!", "bklynbooface5000": "Dude——— I feel this so hard. Fucking move over skankie faux hoes.... also the elitism around fashion in a yoga class. 🤮🤮🤮🤮", "adrianthadoll": "YES BRO OMG. Coming from a WHITE MAN, I agree. This happens a lot on areas like school buses, where they think they have jurisdiction over one particular seat.", "buddha.and.i": "Fellow wyt people stop trying to separate yourselves from this issue. This is our fault, and it's our responsibility to take accountability instead of deflecting. White supremacy IS EVERYWHERE. Denying this doesn't help a thing.", "almacarrillo": "I was walking into a coffee shop and completely unaware anyone was behind. Once inside, this white woman yelled at me that I was rude because I didn’t hold the door open for her and let her walk in first. Cause she can’t be an independent woman and open her own damn door.", "mom23gr8ttots": "maybe ... just MAYBE... the problem is YOUR approach. Maybe instead of TELLING you could try ASKING. #mannerscount #consideryourapproach", "lindseysmithy": "@vianeydro this👌🏾", "ashimoo21": "@fbfwellness @kelli.immerse.yoga Hahahaha", "kiersey\nVerified": "Verified", "tita2wild": "Love this", "civicmediacenter_": "This is so true. You could teach a whole sociology course based off that statement", "unpolishedjourney": "This is powerful 💫", "devvyrwash": "Experienced this the other day. It’s maddening really.", "dannisapp": "Yeeeessss! I had a white woman tell me that I couldn’t place my mat near a vent because it was close to where she wanted to put her mat. She even got up and went to the front desk to “tell” on me. Of course, white people “white peopling” they asked me if I wouldn’t mind moving. There was literally enough space for both of us. When I said, Yes I do mind. He picked up my mat and moved it to a new spot. I picked up my mat and left. I am almost positive that EYE was seen as the problem.", "chizilla": "Also see this on the subway ALL THE TIME", "_biancacrystal": "Yea they hate moving. Smh. Or will take front and center. Like where is the teacher supposed to go?", "jennagadille": "oh wow. yeah, you're right", "nikkilaes": "This exact things happened to me the other week. I think the difference is that I actually pay attention and when I see someone doesn’t have enough space I actually move my mat BEFORE they have to ask me. White people have been so ingrained with the “finders keepers” mentality that they even enact this greedy, entitled behaviour during the spiritual practice they are appropriating to help them gain a spiritual conscious. We have a long way to go.", "regineromain": "🍃#bayo🍃", "yassine1973": "😂😂", "kaz_even.ie": "I'm going to yoga to check this out. Very interesting. The British colonised Ireland and 7 million of us starved to death under British rule. {there was no shortage of food). I like your profile. It helps me understand, thanks for sharing and being strong 💪", "c4minho": "what's wrong with those people? I would kindly move my mat and probably even start a chat with the person in the end of the class!! just why?!", "poolhert": "Hi @ihartericka and all followers! I’m still quiet new to this page and still need to learn and understand a lot. First of all I want to Thank you for this page. I truly believe it makes the, often toxic, space of social media a better place of understanding and inclusion. A lot of things you talk about are not even on the (feminist) agenda in Belgium, where i’m from. So i’m learning a lot. With this post, however, i’m experiencing some difficulty. I find your description very recognizable but, to be honest, to all people. People can be rude AF, especially when it comes to claiming places. I feel that it’s kind of troubling to link it directly to white supremacy and colonization. By saying this I don’t want to descredit the fact that white supremacy & colonisation are still omnipresent. However, I think these examples might forget rude attitudes of all people in general and not exclusively white folks. Am i completly wrong or did I misinterpret this post entirely? Would love to understand. Thanks a lot and love from Belgium! ✨", "yollyfinette": "This ! Just encountered this at a waterpark here in Dubai - the space claim mentality is next level", "mcspazypants": "... or any “festival” that preaches “love for all”. The hypocrisy of hippies and their circle jerk of egos🤦‍♀️", "uglyinahotway": "ooh i wrote about this https://www.buzzfeednews.com/amphtml/aishamirza/until-white-women-ruined-it", "lucygooseynyc": "I HAVE BEEN SAYING THIS MY WHOLE LIFFFFFFE! The entitlement! 😤", "kimgotsauce": "Yoga itself is a colonized practice. I struggle with it b/c the culture and practice from which yoga originates is important - I don’t know how true it is to itself when taught to appropriators by appropriators. That is just a question of its legitimacy - how do the REAL yogis and their community benefit from what has become a BILLION dollar industry. I enjoy yoga practice but it’s also not cool.", "transformationyogasc": "Thank you! This is exactly why I hold healing spaces for people of color that are marginalized, underserved and underrepresented because we need our own safe spaces for healing. We don’t come to practice yoga or any other form of self care/liberation only to be pressed with more oppression and microagressions. I held a specific class for women of color Sunday only to have a white person comment how racist it is she was not allowed to attend. There are over 20+ yoga studios here and suddenly this black created and led one is racist because you can’t attend this particular class? 🙄🙄", "taviastraveladventures": "😂😂😂 ok I thought I was crazy that's spaces in general", "marcimoberg": "Thank you for sharing this and naming something so true. I’ve been teaching yoga for years and I always find it so frustrating when people are resistant to making space for other mats. NOW I’m seeing this through a whole different lenses because of your share. Thank you! I will keep this in mind and share in my own way with others when I teach and practice. 🙏🏼❤️🙏🏼", "giselle_makeup": "I’ve experienced this!!! It stopped me going to bikram yoga in Camden.. the passive aggressive white women were too much for me", "pretinhany": "I love this post. That's exactly right. But it's the whole holistic health, wellness and spiritual communities. I don't feel comfortable in those spaces with white folks. They simply take up space and co opt EVERYTHING they can with no regard.", "balissimo": "THIS!!!", "caitlin.leahy": "Thank you for this post 🙏🏼❤️", "camillemydarling": "Just started a new yoga class today. Im ready to start the observations up close and personal. 🥳", "kangskre8tions": "Facts. The practice has already been colonized.", "gingerphobia": "This is literally what goes through my head when I witness that lmao", "kimstringsmusic": "I cant speak for all white people. Only the ones in the class I was in.", "ashfigaro": "The amount of tolerance white people have is minimal for people who put up with their bs for so long", "cleet0n": "Ahahaha I laughed out loud! It's always the ones wearing the matching sets who never seem to sweat too!", "shaunalhoward": "This is why I LOVE @thetreesouthla ♥️ #SkinFolk #BlackGirlYoga #MelaninYoga", "jukiejones": "God, YES", "betaniavg": "It has totally been colonized. It’s white washed yoga. I was just talking to my sister today that I’d love to train to be a teacher but not by white folks. Any suggestions? Go directly to India? 🤷🏻‍♀️", "lyss.amor": "💯 Thank you for calling this out! I found this way less common in mexico, central and south america. People are happy to move over to welcome more members of the community. Unless of course, they were classes led and taken by a predominately upperclass, colonial savior complex, privileged group of people. This spiritual tourism bullshit. Suffocating a people and fragmenting their culture-to fuel economic machines favored toward the wealthy, feeding self serving ego power trips, all while saying its for the highest good of all beings. So sickening!!", "amy.ike": "Keep practicing your yoga and gift em with a smile 💗😊", "wiccaphase_springsteen": "EW", "rachaelgorjestani": "It’s fascinating to watch people “practicing” yoga without any sort of mindfulness at all. students texting. others looking at texts on their Apple Watch. Privilege for sure. I often find that people completely zone out. Taking. It. All. For. Granted. And yes, white women acting entitled.", "eastbay_ladyk": "This.Is.Spot.ON! 👏 Entitled micro aggressions. @mountain_grrrl", "homosweatual": "TEEEEEAAAAA", "csillagzsuzsi": "Sorry but it is bot true. In our yoga classes we move our yoga mats #happily whoever is coming. To much #hatred against “white”. P.s: I have been practising yoga for 14 years now", "itsmechelseabee": "Wow this is so real. Admittedly I never saw it as a white issue because I find the same resistance when I have to ask, but I guess it boils down to a deeply rooted sense of entitlement.", "hannahgrace513": "YOOOO YOURE SO RIGHT!!! This has actually happened to me at multiple yoga classes. And IM WHITE TOO LIKE DANG FAM", "landofinkandgraphite": "Take a shot for every pressed ass white person who thinks addressing a microaggression like this is Hating On Whites or whatever other shit they're claiming", "drkjwade": "Sheesh. Deep.", "ashleyekers": "🙌🏽🙌🏽🙌🏽🙌🏽", "jessca__g": "@closet_jock", "queenofqi": "I can’t even begin to verbalize all the things that want to be said. ⚡️⚡️⚡️ Thank you", "cmaglio": "Damn. This is me. Why does my head feel like it will explode when I’m asked to move my mat? The colonization runs so deep. It’s like a gut reaction. How can I be in community when my instinct is to claim space? Thank you for sharing this observation and holding up the mirror. I will continue to work to decondition my white supremacy.", "amyrath1801": "Wow", "b.collier13": "👌", "gwenyeageryoga": "😂 It’s so true. People can be almost maniacal about this, and it’s a huge yogic lesson if the teacher takes control of the classroom, which absolutely should be happening. Unfortunately, there are way too many inexperienced teachers out there. Studios make money through trainings. I have black friends who teach yoga and make a point of following lots of Black women who teach yoga and otherwise, bc yoga really is so white, the “leaders” and many practitioners. But there is a strong community of black women teaching whose perspectives I want to know and I believe if you’re a feminist you should. Like, all yoga teachers should know how to teach all sorts of bodies. 🙏🏼❤️", "sasheriuk": "😢", "mama_for_mama_": "I fell asleep in savasana once and woke up to the next class coming in. I took a minute to wake up stretch and when I opened my eyes a half naked dude standing over me asked me to move, I was in his spot. The rudest awakening ever. And people not moving their mats to make space for the next person. If this is how people behave in a yoga room I can only imagine how they behave outside the room. Like Sunday morning after Church is let out and the parking lot becomes a bunch of assholes. Take your faith and your yoga with you when you leave PLEASE FOR THE LOVE OF PIZZA", "kim.k.hicks": "Oooooooh!!! Yes. As a fat person too.", "alaviva03": "@thefreckledjab GIRL!", "fitmommon": "Or be on time 💁🏼‍♀️", "thefreckledjab": "@spokenwordyoga 😂😂", "adelaidelemonade": "Yes!!", "mims_pantaloons": "I appreciate the calling out of colonization of yoga and the space white people (esp women) up. Just one of the many reasons I dislike yoga. Also the holyer-than-thou bullshit my fellow white women get around yoga has got to stop.", "mommyotground": "Smh 🤦‍♀️", "allysun_wonderland": "I’ve totally witnessed this! Where do you think it comes from??", "kersasaur": "@luciamattea", "nicha.ratana": "bless you ericka <3 @akareesyflow !!", "chloebachus": "This is exactly why race is an issue 😵 Why say \"white\" person, I would move my mat, and I would also open the door for someone no matter their race... Not a fair statement to put ALL white ppl under the same umbrella 🤷", "sssiimmoonneee": "not just yoga and similar spaces but try watching people when working a service job... middle aged white ladies taking up everyone’s time w their coupons as if they’re entitled to anything they want and on our supermarkets busiest days. rly makes me examine myself as a ww when out in public spaces", "lizloveslizz": "This is so accurateeee", "theebethany": "Girl. Ain't a lie told!", "this_empowered_life": "My first thought when I read your caption was that you said you told her to move her mat. I think if I was told to anything by anyone I might give some nasty looks. Lol but- giving the benefit of the doubt as assuming you asked, I’m sorry that this happened to you.", "thedivinetime": "Period!", "idatheren": "Hahahhaha I'm dead", "aacapinurass": "IM SCREAMIN", "ibadona": "Yes @ihartericka come to @urbanasanas", "iamnotthatkaren": "@iamsylvialane", "riverhousearts": "🙌", "monasteror\nVerified": "Verified", "yesitisbeautiful": "As a yoga teacher of 6 years and practitioner of 9 OMG THIS IS THE ABSOLUTE TRUTH YES. It’s older rich White women in EAPECIALLYYYY ughhh", "polyforglotten": "why white people feel like they deserve any space in a yoga class is point blank the best example i give for cultural appropriation and colonization. white girls who suddenly think they’re shamans and gurus because another white girl taught them how to stretch and called it energy alignment. headfuckery", "dra.johannam": "💗💗💗💗 love this", "marissy_89": "@addz4prez omg", "soheyl117711": "YESSSSSSS", "spacekittyx": "Damn, this is accurate.", "growinginjerseycity": "As a white person - the looks i get are Horrible so i can only imagine. When i do ask people it’s like why are you in the class if you are going to be that proprietary. Aren’t we here to Om together?", "lunagraceisbelllove": "@susannabarkataki", "liza101": "The best part about this is we have a mat, that is literally all the space needed. It is spelled out for us by the use of the mat. I don’t need anymore space than the mat. I also notice this on public transit, in movie theatres and cafes. Your seat is your seat, not yours and all of the seats adjacent to you.", "songbirdforlife": "OMG, this is so true. I was in a class yesterday and watched this exact thing all around me....", "susannabarkataki": "Yes. This is so on point. The micro reflects the macro. Yoga, like so much other indigenpus knowledge, is itself an appropriated site. So it follows that the actions within that site would follow in that vein. Grateful to you for this.", "roxyek": "🤣🤣🤣🤣 spot onnnnn", "rhodeeroo": "This is absolutely brilliant.", "shakirah.lifestyle": "@morfit4u_ant", "mgbutterfly9674": "So true, I was just at a museum where all the Egypt statues had there faces/ nose cut - removed. Down the hall Roman statue not touched.", "sarahede_02": "Oh shit thats so bad and sooo wrong!!", "8pkastianpk8": "Living for these posts 😂📢💯💯📢", "krista_radness2": "As a white person this drives me nuts when I go to a yoga class. I don't understand why people just can't be kind to others. This is why I don't ever do yoga in the studio that is crowded", "mrsmegangeiser": "Is there any chance these people are just assholes?", "so.emo.fell.apart.finsta.2.0": "I always move my mat over for people its rude not to, we're all there for the same reason", "lifeof_andrearose": "Well I'm glad I've never been to a yoga class. People are so rude!!!", "1331bucklehorn": "🎯🎯🎯", "leorisingyoga": "This right here is quite accurate @brescullark @cynthiaerivo", "weird.kid.harm": "👏🙌", "fungi.fieri": "@erinkellar came to tag you, saw you already saw this", "tamrynstorm": "So true. I’m curious, in your opinion, what is the best way to engage in practices that emerged from other cultures? For example, i am close to taking my Acupuncture boards (white cis female) in California. I went to a Korean university and studied under many races and ethnicities. Soon, I will open my own practice and honestly don’t know how to best may homage to the cultures that I have learned so much from while not also being guilty of appropriation? Or is it a given that by practicing yoga or eastern medicine you are by nature appropriating/colonizing a cultural practice? Really quite curious and not sure how to respectfully engage.", "thisislema_": "The more elite the gym class the worst displays of privilege. Yoga is the tip of the iceberg. I’ve seen some mind blowing behaviour over the years.", "penelope_ls": "@elyse_f", "healing.grayce": "I took a yoga class not too long ago (mind you, yoga is a form of mental health and wellness for me as it is for many people, a way to relieve stress), and the teacher came up to me, the only black woman in class and said ‘way to go sista!’ I almost fell out of warrior 3, like EXCUSE ME?! I dooooont need microaggressions whilst simultaneously trying to heal from them.", "visavae_211": "Their passive aggressive/lets be aloof bs is triggering af.", "nosceteipsum2015": "Facts💯", "mominatu": "I love you so much never stop spreading the truth babe", "la.femme.sage": "The entitlement smh", "simply.amplified": "@ballaratyoga", "deliabrown": "🤣🤣🤣", "abelliniart": "Truth.", "eileen_braybrook": "Woah this happens all the time! I laid on an empty, studio owned mat and was meditating while waiting for the class to begin and this lady taps me on my shoulder and says ‘excuse me that’s my mat’. There wasn’t a single thing (bottle, prop, whatever) to indicate that this space was ‘hers’. AND there were other empty mats all over! I moved for her (whhhy?!) and was so upset and angry for the whole class. I would never think to interrupt someone’s meditation even if someone WAS on my mat! Yes she was white and I’m mixed.🤔", "bouncedatashhhh": "Legit thought I was the only one that noticed this", "xcharlesiax": "@subiniaa", "toylsan": "Damn acting like you wanna throw your mat on top of theirs", "ainemcgeheemarley": "@everoni17 omg I literally thought about this last night when Mandy asked people to move and only like three people did 😮", "ritchiet1": "👍🏽👍🏽👍🏽", "anajae_1": "Baby if this isn’t the truth!!!!", "3arabiiiamiia": "This is a big reason why I don’t even go to yoga studios, they are all run by white colonizers who appropriate the culture and westernize it. I am desi and it’s impossible to find a southeast Asian owned yoga studio in nyc or most places", "gab.soul": "eh it could also just be ego", "sparkly.samurai.cat": "At a pretty full yoga class last weekend, the teacher asked the group to put back their duplicate props so that everyone could have some. I passed one of my blocks to the woman beside me. I hoped to keep my extra blanket because I get damn cold in yin class, but soon I got up to hand it to the teacher too. She was wrapping blankets around mats to use as make-shift bolsters, it was that busy! When I sat down the woman across from me still had two of everything, and she wasn't the only one. So sad. I just practice yoga at home most of the time, but I go out to classes for the sense of community, for the power of practicing in groups. This gets lost when people jealously guard props that they are borrowing and won't move their mat to make space for others. Btw the class was mixed Asian, Indian, and white.", "asifhai123": "@ihartericka that & they are selling me yoga right back to my mutha lovin’ face. Like, I never heard of it. I like tell them, “guess what? This n***a knows yoga & I came this country chainless.” They don’t know what do to but move the fuck over. Love you my sister @ihartericka . You give me love strength & hope. I’m getting back to my street people. Keep the love flowing. #muslimsknowyogatoo 👊🏾❤️🙏🏾", "ladylivvvy": "Ha! Love it", "daria_ann_poet": "I’m sorry. If it gives you any hope last weekend I had a pretty crowded class and the two white men I sat between had no problem moving over. It was a pretty nice communal space overall. But I do always look over at the one or two south Asians in class and wonder how they feel being led in this practice by a perky blonde.", "iamauntiesocial": "Omg lol @gal_bundy !🤣", "aboutabear": "I think we’re raised this way. There seem to be a lot of contradictions in what (white?) children are taught. “First come first serve” and “the first loser is second place” seems to reign supreme over “sharing is caring” and “love your neighbor as yourself”", "raquel_simone15": "💯💯💯💯💯💯", "cowboyduck": "Thank you for this, a lesson I’ll be more aware of for myself and others ❤️❤️❤️", "chinaparadelo": "All the time and just one of the reasons I’ve started doing that shit at home.", "amylrangel": "My yoga teachers used to say if you touch your neighbor, it’s good luck. 😉 even when the class was empty it was about coming together. ♥️", "melanin_goddess_joli": "*known", "_heathercopter": "Sad. 😔. I have not noticed but maybe I will pay more attention. Erika I’d move my mat to be closer to you! Your energy is probably pretty bad ass!", "precisely_mp": "@hmccollester something to consider in your spaces", "blackgirlinom": "💯", "sabertooth_beard": "Lmfaooooooooo so many time @yttp2", "wakeuplulu": "I see you @ihartericka . I hear you. I support and encourage you to take up space, as much space as you need or simply desire and to KEEP it. Resist Black Women & Girls! My daughters and I stand in solidarity, actively, Calling Out this fuckery DAILY, consistently, eternally. Thank you for this post and your emotional labor. 🌸🙏🏽🌸~Kirti", "stephwigney": "T H I S👏🏽👏🏽👏🏽👏🏽", "rhondaj.jarvis": "Where do you go to yoga? Lol", "monst.ana": "Your and all the stories in the comments! What the?! Yes, yoga practice is totally colonized. I’m sick of those white yoga teachers alias pseudo peace makers though.", "sarkuroll": "I love when they try me. Just so I can say no to them Sand see the shock on their face when a minority doesn't do what they ask lmfaooo", "emmamcmack": "Reading the comments and realising that every damn yoga class everywhere is full of the same thin, entitled, wealthy white women stealing culture, making a valuable practice elite and exclusionary, and shaming people who don’t support that model. And having the fucking audacity to describe themselves as spiritual.", "black_geek_omega": "That's why they're also bent on colonizing space too 🙄", "tiffywiffyiffy": "This is why I seek out yoga taught by Black women. I’m hesitant to go to classes with all white women. It’s stressful and toxic. I’d rather not do yoga at all than feel that burden", "evolvingdivainc": "@beardadminservices the entitlement conversation we had", "unbeweaverble": "@rosieinspace maybe a talking point for class?", "kdoubleyou_el": "@raquelsaraswati", "triciadonegan": "Try my studio as my guest, (for life) we like people who like to practice yoga in the lower east side. We have everybody and all bodies, the list goes on, most importantly I also teach yoga at the @girlsclubny DM if you wanna @ihartericka #❤️", "backrhoadz": "Incredibly large facts", "marissa.morgan.jimenez": "Every space. Saw a fellow white parent get in a yelling match with a group of POC over standing in line for Black Panther. He was accusing them of cutting but had already told me he wasn’t even there to watch the movie but was just dropping his kid off so he could see something else. I didn’t say anything to the white dad and by my silence, I was complicit in his racism.", "kxbeltran": "This post hit me like a bag of wet clothes. My experiences are usually with yt folks who like to take up a whole table in the library with their bag (logo forward), expensive computer and one iPad, multiple espresso drinks and organic pressed juice who get super pink and bothered when I politely ask twice if they could possibly make room for me since all the other tables are full. My $150 used chrome book and my Brown self are not worthy of the 12 inches of space I need on a group study table or the one seat I could fill in order to do my homework in the library because I can’t afford WiFi at home. But, the yt person I asked to accommodate me gets to be offended 🤬", "suzanne.wagner": "Wow, this is so spot-on", "ingredients_for_the_heart": "I can relate to this too well. Yep also in my yoga classes. I live in one of the whitest utopia, Portland, Oregon. Basically white people colonized my space all day long. 😠", "_ms.emily": "I'm laughing and confessing, I once had an instructor about a decade back, put me in my place, when I asked if he could limit the class size and bring some candles or something to make the vibe better. He told me to research what a yoga session looked like in India. Meaning... no a.c., no foam mats, no twinkly music mix and crowded. Never forgot it. Take away, like most things we've colonized, we dropped the soul, purpose, and spirit, to suit capitalism and comfort for white people. I'm white, I've been the grumpy white person, not wanting to move my mat. Had to check in on wtf was I doing with my namastayin' like, I honor the spirit in you as I do in myself, but not enough to move my mat! Lol. Still think about that instructor all the time.", "lala.parisd": "Woa what wow", "bforbrianabforbrave": "Same with making space at the pool. White people act like they own everything and have the audacity to get pissed when a brown person wants some damn space.", "amyanahata": "A similar thing happened to me last week. We were doing a pose in which we reached out on the diagonal, and my hand landed on my neighbor’s mat. She sighed audibly and spent the rest of class folding her mat in various ways to avoid me. I’m white. She was not.", "youseelogic": "🙏🏾🙏🏾🙏🏾 Namaste 🙏🏾🙏🏾🙏🏾", "ayshandthat": "Yes they hate doing this! I used to think they probably hate me a new starter coming in and taking one of their spaces and then I thought I'm paying for the class the same as them why do I feel like this!", "kcsorg": "For REAL !!!!! 👏🏼👏🏼 @musingsandmovement @auroraarcher @goldenbuddhayoga", "lynnedelaneymclaine": "#practicingyogawhileblack ❤️", "snoeptjes": "I always liked following you because of your critical world view but I’m sad to see you generalizing. Assuming that billions of people all over the world ALL have the same negative character trait of hating to share their yoga matt because their skin colour dictated their mentality is a little bit too simple. Don’t bash people based on their skin colour. That only spreads hate and hopefully is not what you stand for.", "ms_creighton": "Love this analogy", "mad.slut.problems": "Like sharI got community space on the damn train🤷🏽‍♀️like I’m invisible n shit🔪👏🏽 #TakeYourBMWIfYouCantShare", "lauraevay": "Oh, is it this bad? Sounds terrible. I will pay attention to it from now on!", "shelbysember": "@dustydayne @stevieraegibbs", "justjessnico": "THIS 🙌🙌 such a simple and upsetting truth", "alyshalynn": "Lolollll - so truuuuuuu👌", "noori_artista": "I practice yoga at home, and also teach dance classes where women and people of color are welcome and NORMAL and ACCEPTED. I hate seeing the pain cause walls, that by the time they get to me either they doubt what I offer OR act like it’s an oasis. I totally wish to be an Oasis, though. That’s my goal.", "fine_forager": "Shit. I have totally been that white person who doesn't want to move their mat. I will shape up! 💚", "benjaxley": "This is entirely true", "ashtagggz": "Thank you for expressing this. Recognizing the impact of the way you utilize space is a huge growth opportunity, especially when entitlement is so deeply ingrained. I know I don’t always get it right and I appreciate posts like this that remind me to consciously check myself.", "the_shakta_oracle": "Wow. A lot to reflect on in terms of my own feelings of the opposite...fear of taking up spsce in places. 🌿", "olive.and.om": "This is too true!! Every class I have ever been to, people are soooo weird about moving their mats!", "sugaring.brooklyn": "OMG! 🙌🏼", "cutebuttired": "I would compare the same thing to my time working at Disneyland. Trying to crowd control white families is the worst. 🙃", "adventurehealing": "That is a very sad judgment that you are making. It would be best to actually test people’s opinions before spreading some more junk around.", "jessbag": "More free and sliding scale yoga studios/classes need to exist because it would (hopefully) keep the most entitled people out and reaffirm part of the original spirit of yogis sharing their practice with the West in the first place. I think if they knew it would turn into goat yoga, beer yoga, Lululemon and white ladies taking up (more) space, they might have changed their minds. You deserve access to peaceful yoga practice and spiritual enrichment just like anyone else. I didn’t mean to rant, but people’s entitlement riles me up so much. How white women see themselves as the ultimate oppressed group while walking all over everyone else is just vile.", "ohthatflo": "SHARE YOUR SPACE, PEOPLE. IT IS FOR EVERYONE.", "foldedright": "The best solution is to just not be around wyt pipo in these situations.", "fi_mad": "I was taking a bikram yoga class in what is perceived as a middle class part of London a few years back. There were a couple of men present. One was a heavy black guy near me at the back. My first thought was omg good for him. As the class began he was huffing and puffing with the exertion of heat and changing positions etc. I mean it's not exactly easy for the fittest of folk. Anyway our white middle class thin teacher exclaimed loudly 'excuse me could you die a bit more quietly at the back please' to him. He was too exhausted to reply. I was mortified. I didn't say anything but should have. I ended up leaving the glass early and never returning. From then on I actually picked carefully the location of yoga classes I attended.", "reagandaavis": "I think this should be towards everyone, not just whites. I mean I’m white myself, but I’ve just realized a lot of people nowadays are so angry with everything. No need for hating on someone you don’t know and especially don’t hate on someone who has a different skin color than you. We all should treat each other equally.", "jackarouge": "🤯 boom! #mindblown", "kylie_kyle_": "White ppl dont know what personal space is. Going to publix and they expect you to move. Im too petty for that and make them wait till im done.", "kyleeiw": "Just because a few white people act that way doesn’t mean you have to bash the entire ethnicity. Says a lot about you too @ihartericka", "musicalbrocade": "Went to a meditation class and the right woman next to me ruined it bc the class was full. She came in late and just splayed out everywhere like there was so much room. Kept tapping me and getting my way when changing positions. Was doing ridiculous PDA with her husband. Like her entitled energy ruined my 2 hour class. I was so highly aware of her but I could tel she wasn’t of me", "erinysfuriosa": "My (limited) experience of this by other white women in yoga classes also suggests classism as another layer of these enactments of white supremacy", "sonoranrosieherbal": "Americans are rude as hell - especially over privileged white people.", "bklyntaylor": "#trueyogastory it’s so ridiculous 🙄", "justicelovemagnetic": "Hahaha so accurate", "big.ler": "This is so interesting. I remember having this problem with sleeping bags at slumber parties when I was little. I hope I wasn’t a contributor.", "janine.fournier": "@stephaniedawnelizabeth I was literally thinking of this when you said yoga in cali.", "marisajacqueline_": "💯💯💯💯", "laurahesp": "Wow timing really is everything. I manage a restaurant and today this white guy with dreads pst his ass who’s a yoga teacher literally walked in past the line and sat himself. I couldn’t help but think about his entitlement to ALL spaces and him just walking around like he owns the world. Deeeeee-scusting.", "marinaleightatelier": "LOL! Ugh.", "xo_jaslin": "I'm Indian and this is why I'm scared to go to yoga studios!! I shouldn't have to be but it doesn't help that I dont have a gymshark or lululemon set lmao", "queen_riese": "I’ve seen this as well. Very disheartening.", "_leslierae": "I always feel out of place in a yoga class hats why I practice at home 🤷🏽‍♀️", "metroidbear": "@bondisaurus #whitesupremacyisEVERYWHERE", "ashatangerine": "THISSSSS 👏🏽👏🏽👏🏽", "amandajhunter": "@margoyoga 🙌", "pauladatkinson": "Taught yoga for 17 years & watched this happen all the damn time.", "kaylerz007": "THIS. I experienced this on Saturday. I also feel invisible at times in those spaces which sucks bc I loveee practicing yoga", "risdonroberts": "Holy shit. Thank you. I have totally been this white person.", "lilybellevedere": "I recognise the behaviour. I’m in a wheelchair, and I have to get people to move all the time. White people will literally turn sideways, as if the fact that they’re now a few inches slimmer is somehow enough room for a wheelchair. I have to ask them to move three or four times before they’ll actually take steps in any direction, and if they still insist on just pressing themselves against the wall, I tell them “ok, if you want over 100 kilos over your toes, that’s fine by me!” And then they still have the audacity to tell me off when I graze their shoes. I’m also white, and I really worry about my shitty race.", "malindricks": "Wow! Ande vele😱yho!!!!", "cotton.top": "YES YES YES", "vallen67": "I regularly take class in a mat to mat situation. You can tell the new person bc when you ask them to move over they look horrified. Honey. We will be mat to mat. You will hear me breathe and depending on who you are next to -they might just fall on you. Move over. The teacher however is very good at being clear- we make space for everyone. She will give up her spot if necessary.", "uncommonrobin": "It's one of the reasons I just completed a yoga certification. We all have a right to physical wellness, and I'm definitely creating a space for all, not just skinny white women.", "suzysuzanne1975": "I see this often. So very often.", "c0rdero_87": "@ihartericka 💯💯💯💯💯", "emmaflorestattoo": "Truth.", "kirrasyogamum": "As a white woman, a yoga instructor, a mother, a lover of life and ALL who share in it.... I see many things in my classes, not much color however and unfortunately. I’ve asked and been asked to move in a space before, but not just because a black woman came into the room. This kinda hurt 😞 love you though and I understand your point.", "i._am._m": "I've seen this many times up close and personal. I'm usually perceived as a cis black male, despite the fact that I'm gender non-conforming, and I get looks ranging from fear to down right aggressive when I ask someone to move their mat. So I practice at home.😒", "sea.changer": "This has always EFFING bothered me. The entitlement and mat rage is gross.", "joyahevony": "What is yoga good for? Really would like to know.", "mykeydenise": "I had to do this yesterday. Ma’m there’s three feet to your left, move...", "naimahbeeema": "Yupppppppp", "aceyogala": "As I teacher, I happily move ppl even without asking, most of the time, if they can’t hear well that day for some reason. I moved my mat in class the other day three times, because it was full. I noticed most ppl were hesitant and I said, “yeah, can you move your mat and make space for your fellow yogis who are making their way in now.” Not asking them to co-sign a loan for my home? Move your mat, Sandy!", "olympusmonsvii": "what a great analogy holy shit i hate it", "dayvidyou": "Omg! So accurate! May I share?", "sedaisysroom_": "😭😭😭😭 That’s why I had to walk out one last week. Absolutely ridiculous and disgusting the looks some women gave me.", "kar_heart": "🤣", "nikknikknikknikk": "@ihartericka and let’s not forget...Gwyneth made Yoga hot, so #entitled #delusional", "nowhitesaviors": "LMAO THIS SHIT RIGHT HERE. But they have not a damn problem telling us to move. Had a white woman literally come up to me out at a bar/club here and ask if she and her friends could have the table I was sitting at with my friends..... THEY BE TRYIN US", "the_luciferous_shift": "I rly love you...", "mizironbox": "This is waaaay too true. I have taken a yoga class with White women who will stop the class entirely if a move is too difficult for them and and go off on a long, whiny tirade about what moves they aren't able to do it and what the instructor should do to make things easier. 😒", "amie2": "My friend is Iranian, she was asked to wipe down some white lady's mat at the start of the class. My friend was caught off guard and was cleaning her own mat at the time so just agreed to help. it didn't click, for either my friend or the lady, til the start of class and my friend sat down on her mat to reveal: surprise, I'm not the cleaning lady. White lady legit looked mortified....but did not apologize. Honestly what is there to say? Sorry, I am a horrible racist? Dunno what it is about yoga specifically that brings out horrible white habits.", "schreur.as.schit": "@dan_sure 🙌🙌🙌", "stonecoldmaty": "This is a weird example because so many people take yoga classes or participate in the art. I’ve been to classes where there’s only like 3 white people", "kristen_roberts_esq": "This is wild! And sooo accurate. I get asked to move so much. I wonder if it’s why I have such discomfort going to yoga. I always feel unwelcome", "jaali_co": "The amount of \"silent\" fights I've had on the sidewalks of America... I've learned to take up space and have ppl move for ME. It's amazing. I've been damn near pushed into the street bc white ppl won't share the space. 🙄😑", "houseofsaddletree": "😂😂 It is so true!!! They give a look as well. Smh", "burger.heaux": "Just as I was about to sign up for a yoga class. 😒😒", "katycakes2012": "Thissssss🙌🏾. Facts", "twotreesyogajen": "PREACH", "thewanderingbarista": "I’ve never felt more judged and unwelcomed in a space that claims to be welcoming (and I’m a white woman) than I have in a yoga class. “Spiritual” people who can’t make space or send a welcoming smile your way. Precisely the reason I practice at home, in my own comfortable space.. sadly. I’m sorry this happened to you. It’s not right. Thanks for bringing attention to it", "muddpaint": "Not this white girl...", "grammatique": "🙌🏽🙌🏽🔥🙌🏽🙌🏽", "camill3_3lizab3th": "As a white yoga teacher, I can say with absolute certainty this is the most dead on thing I’ve read in a while. Literally just told my class last night (which is always packed - meaning people should know by now they will have to make space), that if they can’t make space, they have no business practicing yoga. #byyyeeeee the yoga community is jam packed with white supremacy and privilege, to the point that I often question my own role in it and want to find another line of work. Until I figure out what that is, I often speak to my classes about the ways in which yoga has been colonized and stripped of its true intent and am even going back to school for a masters in women’s spirituality with a focus on decolonization. I don’t totally know what the answer is, but thank you for continuing to highlight this stuff.", "auntienay.nay": "I agree. It’s an entitlement complex.", "strange.blushing": "I see this happen too at the front of the city bus allll the time. Not only does this behavior bar elderly and disabled folks from accessing a seat, but it denotes a hierarchical entitlement to the \"top.\"", "jjsyrup": "Sad, but true. actually how I met a friend because I moved my mat w/o making a stink about it.", "elicia_g": "boop", "cloudsandrainy": "Oh get over yourself.! If you take everything any white person says to you to be a racist remark or have racist connotations then you are pathetic! You are the one being racist assuming all white people hate anyone and everyone of colour and think down of them. Get over yourself! And yes I'm a white female so you are going to be racist toward me and tell me I don't know what I'm talking about because I'm white. And you know what idgaf.", "isalovesart": "@paulavsello", "boomerangnika": "oml i've seen that happen too! and people of color or in general minorities know no different than to move aside because they BEEN used to it. i swear i just wanna take their yoga mat and SLAP EM WITH IT", "eliana.chinea": "Pure facts. Incredibly annoying to witness their annoyance. 🤦🏽‍♀️", "beevle": "I can’t afford to take yoga classes, but if I ever do in the future, I will make room without complaint.", "kiranspirations": "THIS!!!!!", "fireflyhealing": "SPEAK IT LOUDLY", "mskelseyglenn": "Had to excuse myself from a heated conversation with my grandmother for that exact hard headed resistance mentality.", "brittanny": "I watched white instructor take a class with us once and she completely blocked the woman behind her and then told the Asian man in front of her to move so she could see it in the mirror.", "stormridden4": "Definitely have experienced this, also have gone to classes where we had to overlap mats to fit everyone in and you had to *gasp* step on someone else's mat during the practice. Each studio has a different vibe for sure and I like studios that can roll with the flow and welcome everyone", "lindsayjozulick": "This always blows my mind!! And one of the reasons I would rather practice at home! ♥️", "joannacifredo": "👏🏽👏🏽👏🏽👏🏽👏🏽", "eve.fortune.d": "It’s so fucked that this sense of entitlement and these micro aggressions play out in yoga, an activity that was appropriated by white people, predominantly women, from another culture.", "waffle_pockets": "Seen and heard", "hotgyaldanny": "Girl I also had an interesting experience at white yoga", "truephoenix55": "🙌🏾🙌🏾", "hsulace\nVerified": "Verified", "samanthakayea": "Thank you for making me aware.", "ziaaukia": "I’ve definitely experienced that! Smh", "dominiquencole": "Maaaaaaaaaaan listen!!! #stories #igavethemmamaeyes", "crybaby_clubhouse": "I was just reading about this idea of never giving up space- I hate it so much! It's so selfish! This POC was talking specifically about how WW never move out of the way for her, she always had to move, then she decided to stop moving and see what would happen. One WW in a grocery store literally just hit this WOC with her cart, multiple times, and then sighed in annoyance at the WOC! For shame! The selfishness of whyte ppl knows no bounds. Decolonisation is the answer!", "mayakabat": "This is so real. Seen it so many times", "aubreynrhodes": "@gwynethpaltrow s are everywhere", "amy_heals": "TRUE> Why I take yoga classes in Harlem with people that look like me!", "wickedpist": "🤣🙌", "terina.scia": "HAHAHAHA @nypursuitofhappiness dying", "katehockett_flowermoon": "@stephlityoga", "rainy_bari": "I do yoga at home. I know I do alot of stuff wrong because I'm a beginner but I won't put up with BS like that. I live in Oregon and the entitlement is stifling out here.", "hollieluton": "it’s been abundantly clear to me that yoga practice in North America to me is totally colonized; it’s white people appropriating culture and making money off it and it’s so elite and expensive, occurring in gentrified locations almost exclusively (at least in Vancouver). It is so sad to think of the origins of the practice compared to what it is here.", "robberdaughter": "@besol99 @anyeechka", "imasnaggletooth": "I’m amazed you can step foot in a yoga studio. Goes to show what a better, more evolved human you are than me.", "jerethkluis": "Happend to me all the timmmmee not only in yoga!👀", "consciousandaligned": "@ihartericka no lies detected. Next month I will have taught yoga for 10 years. I’ve taught in both the Southwest and the Midwest. I have asked students to move their mats to create space for latecomers and folks have looked at my sideways as if I have suddenly stopped speaking English to them. 😒 I guess the ‘namaste’ doesn’t extend to all of the practice. 😔 It is indeed a sight to see. 😡", "anitaw19": "Yes! I’ve watched this happen so many times. 🤬", "ambreezyg": "You could use your influence to unite people but you’d rather divide", "nonbinaryicon": "😂😂😂😂 Swear it’s actually a madness.", "monicamonfre": "Truth. And then when there are markers on the floor and mats are still placed wherever. When I ask people to make space for a mat the looks are sometimes so angry and I’m like you came to a public yoga class. To be around people. To flow in unison and in community.", "dylan123.maya": "im sorry this makes no sense at all", "esquelifestyle": "As much as I hate it - I stopped going to yoga classes because of this. From being called the name of another Black person in the class, to the mat situation and just the over lack of respect for personal space - it no longer fed me. It ended up adding more anxiety then what I already lived with. So now I just do my practice by myself or with friends/family until I find a safe space in my city.", "preventionmeetsfashion": "Or walking down the sidewalk.", "alishanandi": "Lol i believe you 💯 I was about to say, just look at how white peoples colonized the practice of yoga. You beat me to it😂", "adriennesacu": "I agree with this 100%. I also wonder if these white women are subtly (or maybe not to subtly) pissed that a black person is telling them to move. White people have been telling black people to move out of their way for generations and now they feel defensive when a black person tells them to move!", "jamiecatino": "Truer words never spoken", "evadocoutokane": "@sandeevag lol", "myalambrecht": "Oh my god #truth 🤦🏼‍♀️", "guayabakitchen": "Fuck. 🙌🏽", "channyboo_xo": "The cart in the middle of the isle 😂", "designedbydg": "Why is this soo true", "summersnyder": "This isn’t even the first time I’ve heard of this 😭😪", "jennywhoa": "Grocery stores, too. White people can’t seem to resist gentrifying even PERSONAL SPACE. I STAY having to insist upon having my personal space respected. When I ask them to back up off of me on line, they act as if I asked them to donate a fucking kidney 🙄 They huff, the puff but I get my fucking space. The entitlement is enough to make me murderous or at least lose my appetite.", "sassquatched": "Or and also any Whole Foods parking lot", "jessharbeck": "@yogaworks #truth", "gelinatarantino": "Preach", "ms_eskay": "Its like they have a Columbus bone(gotta claim what was already there)", "nadya426": "Side note / product plug: the beautiful Anasa yoga studio in Oakland on MacArthur, opened a few years ago, owned by two local black femmes. Bonus eat lunch at world famous Everett and Jones BBQ across the street after! Many of their teachers are white, but many are not, and one of the black femme teachers is also a postpartum doula. (Not suggesting ww don’t also colonize black-owned spaces.)", "gabrie_alea": "Omg I’ve really experienced this! They smiled but had such resentment in their eyes. #nottryingtogeneralize", "chelliealwaysdreaming": "Great ideas to help reconnect to what's important. Start with the land. Every inch holds the blood of the oppressed, so that should help with perspective ❤️", "blessedbeyondmeasure_39": "This right here!!!!!!! I experienced the mat move last week. And I did not move!", "yasminthemachine": "@the_diviiine this makes me think of your experience at the @armatureworks_tampa yoga 😥", "mylight_myflow": "THIS is so true! I've seen this happen on many of occassions. Truly the worst though are the white folks who come in (and are clearly new to the space) but are taking up the most.", "karmic.kelsea": "👏🏼👏🏼👏🏼👏🏼", "queenofhaerts": "😂", "moon.scholar": "I went to go see an exhibit of Kehinde Wiley and this happened exactly. Trying to see the artist as a black person, asking white people to move over and make space for me. They would hustle, practically run, in front of me to see the art. Bad bad bad.", "looinga": "🤣🤣🤣🤣🤣", "ebnanahh": "This type of behavior is why I haven’t been to a yoga class in years. So much talk about “holding space” for each other with glutinous insular behavior in practice. I’m going to try to get to your class ✨🙌🏼", "_justnamz": "REAL. FUCKING. TALK. Try putting your mat down next too close to someone and going to use the bathroom only to come back and find your mat moved. My eyeballs are going to roll out of my head, this is so accurate ohmygodddddd", "msindiarose": "Whew chillay, the truth!!!", "thewildkindness": "I just read a series of posts about appropriation of yoga in @hownottotravellikeabasicbitch stories. Really good food for thought, ideas for action and so relevant to this post and it’s comments", "alpha_wande": "I've been seeing this a lot! White people take up so much space. Whether or not it's occupied they will impose themselves in all spaces. It actually frustrates me", "msholmesmusic": "@elizajayn lol", "dontgabalot": "This happened in class last week and the white dude chose a spot too small for his mat. Instead of choosing a different spot that he fit in, he made a WOC move her mat.", "igobymal": "😩😩😩😩😩😩😩👌🏾", "kdbe133": "SO TRUE - it is amazing how people purportedly there for “mindfulness” can act like such brats right out of the gate, without a second thought to it.", "j1tt3rbug": "So real, as a mixed race Indian woman I ALWAYS feel weird taking up space in a yoga class - doesn’t seem right. I only practice at home now.", "faharibazaar": "I think here in America, people are generally not taught to share or see themselves as part of a whole. And even though everyone preaches that sharing is caring, it's never practiced. The mentality is me, me, me. I have witnessed this lack of sharing or consideration when you walk into a room for a meeting/workshop and people are already seated around a table. You can see how agitated and defensive about space people get when they have to move a little to make room for an extra chair. It boggles my mind! I grew up with over 20 siblings, aunts, cousins, grandparents etc. With so many people in one compound, you learn from a very young age to make space for others, to consider others, to feel responsibility for others, and to share with others. There was never \"me\" when I was growing up. So that by the time you are an adult, it bothers you that you have space and someone else doesn't. You feel when others are hurting. You ask yourself who hasn't eaten when serving food for yourself. And you don't think that you matter more and so deserve to take from everyone else. I see this attitude that people have about sharing as a lacking. I always tell people, \"you can't teach what you don't know. You can't give what you lack.\" If you don't learn to share or be considerate when growing up, you will never be able to give those things to others.", "lexrosenbaum": "Never read anything more true!!! 👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "msbinks101": "😂😂😂😂😂 I see this all the time at Yoga for the people . Facts upon Facts 💯", "_paolacespedes": "TUH!!!!! SPEAK ON ITTTTT", "goddessra": "LMFAO NAMASTE 😂", "leicester_nell": "Happened at a restaurant to me and my family . Can’t believe in 2019, this is actually a thing .", "alessandravoice": "I hate that shit. That has happened to me too, it’s like “Oh was this YOUR spot? You own this are!?” 🤪🤔 @ihartericka", "nikki_uptowngirlthreds": "Omg. Yes. So true. Don't be late bcuz they don't want to move. 😂", "mosey_kim": "This is exactly why I practice yoga at home.", "priest.00": "This happened when I went to my first pound class", "_lifeofshi_": "That type of behavior literally occurs at any public place! Like I can’t tell you how many times I would be respectful, say excuse me, and a yyt person just stands there as if me asking for space is SUCH an inconvenience, then I when I get loud it’s a problem. It’s like you literally have to be disrespectful to get respected. Whether it’s passing through a crowd, asking to sit down beside them, having them move their stuff. Like damn. I’m not trying to be the “angry Black woman,” but fuck if that’s what it takes. 🙄🤦🏾‍♀️", "blk.theo.logy": "What address do we send gifts to again? I had it then I lost it 🤦🏾‍♀️", "bruteusmaximus": "I guess this is a global thing, because I saw this last week. And they put their mats down in the most inefficient way to begin with and then are surprised someone wants them to push over. It boggles my mind every time.", "missbirney": "Dying. Witnessed this hardcore this weekend, ruined vibe of class. This weekends yoga practice brought up a lot for me, wondering folks thoughts of giving land or neighborhood acknowledgements to gentrified neighborhoods. I’ve been recently introduced to acknowledging native land when beginning a group gathering. Just an idea...yoga teachers in gentrified spaces or neighborhoods might be informative and respectful to remember the history of the space or neighborhoods your teaching/practicing in. Plus asking if their is a longtime member of community joining class has a prayer or reflections or lead the land acknowledgedment to share about the neighborhood/space we are currently practicing in.", "carissaabrown": "damn, i needed to read this", "metheinterrupter": "AHAH. Dun out ere 💀", "kshelton": "Damn!!!! This is SO true. This applies to so many situations!!!", "wwwdotcalm": "went to a yoga class that ended in her pitching a group yoga trip to belize to yt women who were overjoyed peace was only 800 dollars and a weekend away 🙄", "katienumi": "yep! this. i see this way too much", "tns_9304": "🙌🏼", "rosebudcbd": "Yessssss 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "lollybananasloves": "Womannnnn you AINT lying..😂😂😂😂😭😭", "lunamatatas": "Yup. 📣📣", "aprildawnreigart": "So much truth in one place!! 🙌🏾 I’ve had enough of what happens in the yoga studios available to me! Enough, I tell you! I’ve started practicing with videos at home...", "kristyabero": "@ijallen", "moondoulaempresss": "💯🤯", "mikaelaaaagrace": "Ooh interesting", "badgaltreetree": "WOW. You’ve opened my eyes to the deeper meaning behind something I see far too often... thank you.", "tall_wonder": "@danielletridenti", "baldblackbarbie": "This analysis is everything.", "darkskiesandbutterflies": "@ihartericka This is the soml on public transit. The other day I was on a bus that was super crowded and I was in the corner and a ww came up next to me and grabbed a handle bar that I was holding on to (because it was the only spot I could reach) and looked at me expectantly while stepping forward to try and move me back. Btw, there was no room to move back. I stared at her and she immediately said \"sorry.\" Yeah lady, I'm not moving, I literally can't move, stop being a colonizer 👀", "vikunia_illustration": "Oh my you’re so right. I’m embarrassed", "godeeplive": "Honestly, lately I WILL STAND THERE UNTIL THE PERSON MOVES. Yes I will. Every single time.", "sidewalklove": "soooo true!", "alphaspearl": "Hahahah wtf is wrong with people?!?! Even for simple things, letting their ego rule their every action...Sad", "goldenganjagoddess": "So much for Zen serenity and Peace to be shared with the World. Its all about taking for yourself. Namaste, my Black Ass! They must stay away from minorities as much as possible. 🤣😂", "life.on.marsh": "😂🤣🤣🤣 fucking #accurate 😂 as an instructor it's infuriating. Y'all gotta practice more of that non attachment. No one's entitled to \"their spot\" 🤣", "veenice05": "On the train as well. NYC. 4train especially if there is a Yankee game one WM pulled me over to make room for a WW. 🙄", "freshorbust": "OMG THIS IS SO TRUE.", "chunkyandfunkymaddie": "Yeppppppppppppppppppppppppp. Also why is it so hard for people in the yoga class to make space in the first place? Like they know they’re gonna have to move when the class fills up and someone needs a spot, but will act offended either way.", "lsmvo": "Srsly! Acute observation 🔥🔥", "eclectic_cle88": "Wow not surprised tho", "danascamera": "Yes! I hate having to ask anyone to move their mat, creates some real anxiety in me. I usually won’t go to a yoga class if I think it will be crowded because of this reason, I am not a fan of getting there 45 min early to claim some space. And if I notice people are coming in and we’re running low on space, I will move closer to those around me to make more space for others and the ones I move closer to end up scootching away from me and sighing lol.", "bde.veaux": "They’re taught to believe that everything belongs to them. No working to get it, but simply expected and assumed. It’s ridiculous — they need to be checked.", "naushonyoga": "As a full-time yoga teacher for the past 15 years I see this ALL the time. Its my job to literally make them move it and show them that THIS is the yoga practice, not something else. I’m still doing this work myself constantly. Really appreciate you posting this.", "theaxltd": "LEGIT ⚔️‼️👏🏽👏🏽👏🏽👏🏽", "krinhoh": "💯💯💯💯💯💯", "sophiadanger": "The first 10 ppl to get to yoga class camp out like there aren’t 20 other people coming all equally entitled to share the same space 😡", "scarlet.riverrr": "YESSSSSSS", "yooo_itsnicole": "Girl! Lately been contemplating going starting yoga teacher training. I needed to hear this. This exact experience is the reason that we need to safe spaces to practice, to breathe, to live, merely exist.", "nelydaja": "@ihartericka so true!!! And I am a yogateacher now... wanted to reconquer the space. Lets see how this goes..! 🤷🏽‍♀️last time in yoga-class a person even preferred to remove his/her mat to the back of the room instead of making space for me beside her mat. SMH", "shmilz": "Yes! I have been so turned off by yoga classes I end up only doing it alone", "vertamaloney": "if this ain’t a word!!! and how about when there is floor space for days and a white woman decides to put her mat so close to mine that i can hear her food digest and quite literally feel her thoughts?", "sonalifiske": "Yup. A great reminder, because I was conditioned to always step out of the way first or accommodate, whether that was walking on a sidewalk, in the ladies room or the boardroom. Officially done.", "__robinjohnson": "Yes yes yes. Has anyone hear heard of hip hop yoga?? Yoga itself has been colonized for ww on diets, and now a new brand of “hip hop yoga” is super trendy (at least in NYC). DOUBLE APPROPRIATION 🤮🤦🏻‍♀️", "ggbostini": "I live to avoid conflict and attn in anyway in public (anxious introvert strategies 101), when I took group classes a decade ago, I’d go to the front or back corner, no one could tell me to move.....but I saw this all the time. Ppl were very territorial of their matt placement. Even throwing down a mat to ‘reserve’ the space and coming in 10 mins late. I agree this is the epitome of ws & world & also just straight up entitled privileged ppl.", "kaybar1": "OMG yes!", "jamie.weiss.71": "It is not the same thing but I took a barree class..and had to stop going after they played \"This is America\" by Childish Gambino. I found it beyond hypocritical that a room full of white women, most who sport blue lives matter tees, were bopping this to not realizing or caring about the message or the song.", "hair_by_gina": "Repost!", "jennydeluxe\nVerified": "Verified", "estoycambiando": "They forget surprisingly fast that yoga philosophy and practice comes from a southern country, long before they invented one of their new yoga styles of their own.", "beyondthebinary92": "Ughhhh wow... well said 👍🏽", "greenbrooklynbrand": "That’s deep !!", "talialune": "THIS 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "lagrossetoile": "The whole colonised yoga thing is pretty intense too. Watch what happens if an Indian person makes a suggestion to a bunch of WW that yoga is maybe not theirs to say yoga is for everyone with. You'll be knocked down by all the violently flying love and light", "ushamamii": "@anarosa__x", "shavisnax": "It's so true ! Used to teach bikram yoga in Seattle. (Not that anyone needs a cosign from me)", "thefitbritt": "Amen!", "thefreeblackgirl": "Gurl! The accuracy", "undzinebeauty86": "This 🙌🏾", "priscellajaen": "✨🙏🏼✨!", "sashanlenz": "The comments are eye opening. I don’t practice yoga so don’t know first hand but. Eye opening. 💔", "nsdc": "Yep have experienced this for nearly 20 years...you’ve probably also heard “but this is my spot” 🤦🏽‍♀️", "katie_r0se": "scroll through #whitepeopledoingyoga to see more of the colonization of the practice play out", "mandycunzy": "💛", "radafl": "It's like manspreading...whytespreading", "115kaki": "🤣🤣🤣", "fitbykylie": "This genius thought is the perfect analogy to get white people to understand. 🙌🏼 “united we stand or divided we fall” should be recognized for all humans and living beings, not just a specific population.", "looshloosh": "👏🏿👏🏿👏🏿 They get so offended. Om and move your shit", "nih.lis": "Big facts", "joelles411": "😂🤣🤣", "horizontalwithlila": "From my 12 1/2 years of yoga teaching experience: Absolutely.", "clareraw": "Or take any subway in NYC 😞", "nolatrees\nVerified": "Verified", "afflictednj": "so true", "taracioletti": "It’s a disgusting sense of entitlement and pure selfishness. 😡", "iamcwells": "You need to come practice @urbanasanas feel the love from all. Check the site and come to class!!! 🙏🏾", "lillyotoole": "@kagan.ab another powerful instagrammer and an applicable post", "_treeoflife": "THIS 💯💯💯💯", "bethazon": "That's unsurprising and super shitty. Im a WW and yoga instructor and i always teach my students that part of non attachment and non violence includes sharing space with others. That space doesnt belong to any individual, and certainly not a white person.", "sarlejeffries": "🙌", "katjuschka____": "love you!", "thewaythru": "So. True.", "_lyd.a": "!!! Thank you for saying this. this is so relatable it’s so ironic the kind of culture that manifests in certain yoga environments", "anchored_n_righteousness": "Or when they are walking period they don't move at all and when I knock on down they get mad", "meganbirnstein": "🎯", "christannchanell": "Omg! This. ✨", "yunique.yunique": "You must have been to sacred on a Sat! Ughhhh", "sexpositive_families": "Mm 👏🏾👏🏾👏🏾", "youknowumoh": "Spot on", "herbs__to_heal_a_broken_heart": "Oh, shit. This is the truest.", "taylor_morganxo": "Agreed!!!!!! 🙌🏾🙌🏾🙌🏾", "nadi_amarena": "My partner is a yoga instructor and had them read this. They made a face and said “ugh oh yea they will bitch about not getting “their spot” too”", "dabeebs": "Yeah I co-sign this. I’m white and I’ve totally noticed this. Sigh. It’s going to take a complete reparenting of white Americans for them to unlearn entitlement.", "maybe.maybenat": "And most of the teachers take their training at a beach resort in Costa Rica 🤔", "beautyasametaphor": "We can totally relate! come check us out ✨", "kristinmb": "👏🏻 yep", "erinelizabethcole": "THIS 👏🏻👏🏻👏🏻", "kmsinfj": "As a yoga teacher I can CONFIRM THIS!", "iloveyoufun": "A word.", "herbanhealing": "Ha, this was my life for so many years.", "slutofthemonth": "True story. I went to class last week and when a ww came in looking for a spot, a wm chose me of allllllllll people to ask to move and make room for her.", "ghetoflower": "Over and over again.", "kimmiecorvino": "I notice this when driving too. Like when you’re merging or changing lanes and people fly up to make sure you can’t. I never understood why people were like this. Now I totally have context. It’s just another aspect of our white supremacy. Fuck.", "monie_gee": "This is why I had to stop going to white owned studios or only going if it was a class for Black/POC femmes", "bitterbettynyc": "GIRL 🙌🏼", "mercii_me": "Yeeeeep", "lyleomolayo": "Deep af! That’s why I only do meditation/yoga publicly in orange w @doxdiggla . It’s a black space uncolonized . If you ever in nj and want to meditate, heal, do yoga, he’s def the plug.", "its.baeeeee": "this!!!! ugh!!!! i’ve had it happen so many times like wth", "youngseedssun": "u ain't never lied. one part of my practice i haven't be able to digest.", "stuckonthetipofmytongue": "So real", "aaaaancora_imparooooo": "I have tried to explain this statement many times over! Perfectly put!", "iamfathajazz": "Wow!", "leslie_rd_910": "Cultural appropriation to the biggest degree 😏😏😏", "yazzila": "@founddave", "burrosvivos": "im not speaking for poc, but i think we’ve all noticed how white people take literally everything created by poc", "adjnyc": "💯💯💯", "eliiiselehr": "This constantly happens in my place of work. I work at a busy coffee shop in Minneapolis and usually us white people will take up a damn booth seat and camp out for 5 hours but when I ask the customer to move to a smaller table because a family or larger group of friends walks in and want a place to sit. Usually I get a lot of attitude, eye rolls or even sometimes a no. But I make them move anyway.", "melancholera_23": "YEP.", "sonyamarxdances": "And yoga as a larger practice/how it has been colonized and taken over by white women is actually super interesting/sad/revealing. Like in a lot of ways it has just been made into another tool for diet culture, or a way to monetize “self care” and make it more exclusive and even more far removed from the original, meditative, spiritual practice created by POC.", "sinaemetry": "this happens ALL the time!", "tanichols": "THIS!"}