{"eve_wtw": "this >>", "idkwhatimdoinsomebodyhelp": "First of all, you can fuck off with the whole white passing privilege, don't matter how pale i am, i still look Arab and i still get taken in for questioning at the airport, i still Face Racism on the daily, secondly there's nothing great about having your ethnicity fetishized, even though no one fetishizes arab men btw, and tf do you mean by don't say \"what about us?\" if y'all have the right to stand up against the system that oppresses your people then we can too, one more thing about the whole white passing bullshit, many ppl call arabs white passing but forget that most arabs are either brown or black, besides we're not the only group of people of color that arent black that don't benefit from this fake bullshit you made up, desi people, Asians, even latinos, none of us look like white people", "suze_muses": "What are your thoughts on it^^", "jhegarty420": "I always felt weird about the term poc but never really knew why. I thought it was just me being racist somehow lol", "archer_creations_": "I never though about the term POC like that, should we also stay away from saying like “artists of color” and say black, indigenous, etc. artist instead?", "keepitkrisp": "What should I say if I respectfully call someone black instead of a person of color and they get mad at me for not using the term POC ? Serious question , I’m not trolling", "valentinaa_gut": "Just curious, How would reparations work?", "onomesmom": "And being brown in skin doesn’t make you black. You are not treated the same as actual blacks. Using POC is just a way to be dismissive of actual black people. Dark skinned people from India are treated better than blacks in America. No you cannot relate just because you’re skin is not the color of milk", "yytrium": "\"with white people/organizations\" headass", "alliecmoore": "I’m very big on making white people more aware of how poc are oppressed and their own subconscious (or conscious) racial bias. i talk about this topic a lot so i have to address non-white people pretty often during these discussions. should i reframe from saying “poc”? and if so, what should i use? non-white could be an option i guess, but it makes it sound like the two groups are just white people and non-white people and i don’t like the way it comes off considering i’m fighting for social equality. i don’t want it to seem as if they differ from one another. what would be a better term to use?", "ro.al.jo": "Can someone explain #9 to me as I don’t think I’m getting it.  To me, it seems like last sentence isn’t related to the rest of it? But that’s probably because I’m being dumb and not getting it.", "eemilyycx": "Where would we get the money to get reparations?", "martianphoenixbeats": "Blacks are the indigenous. first on the planet. Proven by nature & the oppressor's science.", "karistaughtme": "Yep", "janthony7417": "Understand most , how about we stop saying nigga altogether?!!!!", "alqalifah": "Things to do for block people: stop crying", "ianwestart": "Good lord this is dumb as fuck", "erin_clement": "damn got the whole squad laughing", "heatheryackel": "Afrolatinx representation ♥️", "song_of_songs__": "Thanks dad. Please tell me what to do next I can’t really decide for myself", "jellyfishdenovo": "Reparations aren’t the move, the much more direct and effective solution would be to eliminate capitalism altogether", "vacant_wall": "Okay some of this is just ignorant shit and comes across as arrogant. If someone grew up in a black neighborhood and had black friends their whole the n word is just second nature. Like that’s not appropriation, you just grew up like that and it was accepted. It’s more complex than that. I said it as a teenager because that’s the way me and my friends talked, there was no mal feelings anywhere, we were all just friends. That’s partly my culture too because I literally lived it and contributed to it.", "ari_ahnaaa": "Question with respect to blackfishing and hood culture: Is hood culture only tied to the black community? Would it be appropriating if a NBPOC grew up in the hood and shares the same culture?", "the._.sage": "Don’t agree with all but most", "lovelee_kc": "I thought ‘people of color’ was a proper term y’all fought for people to start using instead of black, colored people, etc.... 🤨", "lizstaylit": "tbh the black community has to also start respecting black people. no more africans vs african americans / afro-caribbeans vs african americans / afro-latinos acting like they're not black because of internal self hatred.", "joseph.gillett": "Some of these are good but most are kinda wack", "makai.__": "One of the most retreaded posts I’ve ever seen", "heartbreak1191": "Lmao who gave her the green light to speak for anyone", "aketia": "@lbrunsonw", "sf_jelly13": "I have an indian coworker who uses the N word ALOT. I call her out but she always says because when blacks were getting shipped into slavery Indians were too and since that happened shes aloud to say the N word. I've googled the hell out of that part of history. Can someone help me/ tell me shes wrong?", "finewinelikeadime": "@patrickmasoe", "guuraamala": "black indigenous Australians x", "digitalshane": "Thank you for doing this labor", "melanatedsocialwork": "@thebeardedsocialworker", "rprob": "THIS IS SHIT RACIST ASF🤦🏾‍♂️", "greentea_gummies": "\"stop saying the n word\" i agree but my Tourettes Did Not", "aggressively.okay": "on #9, yeah bc i definitely love being fetishized and the fact that people like asians purely for the “sex appeal” really feels beneficial to me and my self respect", "robloxmaster_420": "But you just used the term POC in the title slide...", "theberryflare": "It’s wild Bc they did it again last night at the Super Bowl, it’s wild it’s the same person", "mamatortuga": "🙌🏽💯", "ladiistarrdust": "It’s 2020, and white people using derogatory terms should have been done alonggggg time ago. R-E-S-P-E-C-T", "lavander.kay": "I'm sorry but a majority of this is bullshit", "krsty.jpg": "How about a part about how being black and oppressed doesn't give you a right to be racist towards other POC? As an Asian woman I have been experiencing quite a bit of racism from my black neighbors in the wake of the CoV outbreak.", "mscosmosis": "Thanks for this! ✊🏻💙", "xoxo_ash2019": "@authorvirginiaw please go through all of their highlighted videos", "afro.red": "!!!!!!!", "dolly_rocket": "I’ve really been wanting to help out and speak out against injustice, but I feel like what I’m doing isn’t enough.", "chains.n.voodoo": "What is 6 about?", "cmykilla_": "🙄🙄🙄", "texas_thesurfer": "Not ever thing is about yall lmfao", "salmon_guy_": "9 and 5 don’t roll with me", "jaypin1975": "🔥🔥🔥🔥✊🏽✊🏾✊🏿 THANK YOU", "aleadecastro": "👌🏽👌🏽👌🏽", "meeshell_c": "🔥 Love this! While I’m a proud POC = Minority! I never will know what it means to be black or brown in America. Period. -🙋🏻‍♀️", "saunteringsassy": "Thank you for so clearly exposing the issues with the term POC- it has irked me for so long and this explanation helps me articulate what’s wrong with it ✊🏾🙌🏾👏🏾", "sir_sproutboi": "Indigenous people really haven’t benefitted in anyway under white supremacy and/or colonialism... im speaking abt native americans and hawaiians specifically. They also were brutalized and systematically locked out of housing and so so soooo many other oppurtunities. I dont say any of this to steal the spotlight or say “BUT THEY WENT THROUGH STUFF TOO” but im saying that this post almost sets it out like theyve actually seen benefits from anti-blackness when both native americans and native hawaiians are disproportionately affected groups in america (granted the differenc in population does make a things slightly difficult to compare) - from a half black/half white american. We need solidarity, not blanket condemnation and erasure", "7atomic_powerloop_": "What does she mean by black indigenous people? We are indigenous to Africa of course and some of us have some native American admixture. But we weren't indigenous to the Americas. I don't think that's what she was saying but I felt that needed to be clarified. I could be wrong about what she meant though", "averi.dei": "How does one petition the state for reparations to be given to black folk? What does that look like? Coming from someone who wants to contribute and be aware of things I can do on my part to fight white supremacy", "lynettespam": "BIPOC= Black, Indigenous, and POC. First time I learned it I haven’t stopped. Black and Indigenous people should definitely be differentiated from the rest of POC. I even think BIPOC is too general but still better as we find new ways to discuss topics like it", "_redshanks": "Let’s also give bonus points that Latinx ppl can be white and are not automatically “POC” just bc they were not born in the USA. And that goes for a lot of other immigrants as well. If a cop pulls you over and would assume you’re white, chances are you’re white. If everybody thinks your white when they first meet you you benefit from that.", "incassable_jules": "Wait I have a question about number 11 can someone please explain to me what \"lumps\" means", "hxrxs__": "#2 was on point I can’t stress it enough at the end of the day they still don’t like you!🤷🏾‍♀️", "zagnews": "@fucked_up_spongebob_pics - the more you know :)", "imnotanegirlffs": "No one should say nigga or nigger :)", "of.ale": "STOP BLACK FACE & FUCK GUCCI & PRADA", "badbave": "@bloomsyyy", "ebehaywood": "I really like how this topic is bringing certain things to light! I rarely comment or ask questions on insta, but what is your take on white/caucasian people using significantly darker skinned toned emojis when communicating? I've had white friends in the past that have used such emojis, and even though I've read forums and talked to people saying that it's ok, it bothers and enrages me, bc I'm a African-American/Indian person myself, and am really dark in skin tone as well.", "sarasofija": "What term do you think is most helpful and supportive to use that’s not POC? Use NBPOC to be specific? Thank you!", "torijustori": "Thank you for the bonus slide. I asked about this a few years ago wondering if the term POC wasn’t a way we (white people) were ignoring a persons actual origins and it ended poorly. I’m happy to see someone who is often categorized as a person of color speaking out about it being problematic.", "fatima.ohoho": "I’m sorry I agree with most of this but reparations from the state for black people? For events that occurred in the past or recent events? How would they hand it out? Can you explain more about this in depth please? Sorry I don’t mean to be malicious I just want a clear answer on how that might go about.", "zoeandpea": "I’m Latina, white passing. Thank you for this and especially #10.", "kmitchellwrites": "@ruthjones07", "monaetheartist_": "@frankie1915 I needed this ✨🌸 I felt it all ❣️", "lauralynnleonardi": "@christiano2424", "spazzmaniaa": "Thank you ✊🏿👍🏿", "heresahottake": "As non-black latinx person I co-sign all of this. Some blog needs to post your words in article format to make it easier to share. Thank you ❤️ @remezcla @wearemitu", "notorious_f.a.t_": "I may be misunderstanding 5, but how do I teach my white passing biracial child (1/2 Haitian 1/2 white) about her privilege? I try my hardest to expose her to both cultures it’s such a grey area.", "languageweaver": "What is black fishing?", "larissa_nour_fuhrmann": "@daralnaimart thought of you. check #11", "teesaddy": "I read it. “Messing with my blood pressure” lol. Thanks for the post!", "hatimsiddique": "The amount of self importance and entitlement in this post is disgusting. Keep doing you though, just my opinion.", "siobhanatr0n": "@augustusknightt", "charliekilo": "👏🏽👏🏽👏🏽👏🏽", "lizardbud": "Holy crap I never realized how much weight \"POC\" had, glad it never really caught on for me and thanks for enlightening me!", "_lucyred": "@tica_jen tell Kevin #1 😅", "david.hyrman": "Also, this is a totally serious question btw, what does it mean to \"acknowledge ones priveledge\"? Like what constitutes acknowledgement?", "eri_sax_": "I don't think I wanna read these comments 😭", "humanities.and.more": "\"take up space\" ?", "ls_on_the_record": "Hello Ericka, I very much appreciate this post as someone who is Mixed race, white passing, and ethnically Latino. There’s a lot to unpack here regarding identity and I agree with most of what you said. Excuse the scatteredness of the following argument, but I hope it makes sense. It could be due to my privilege which is why I’m sensitive to the matter, but I take issue with the idea that “hood culture” is owned by the black community exclusively. I think geography and the history of diversity in urban areas might suggest a different narrative around this. I’m from NYC, born and raised in a diverse, mixed race family and community. Since the 1970s, My family lived in nearly ever hood that has contributed to “hood culture” through the evolution of hiphop, fashion, comedy, television, etc. (Think South Bronx, South-side BK, Flatbush, Coney Island, Jamaica) I think the evolution of hiphop narrowly, but effectively is a good example for how “hood culture” is defined overtime. I think it is often forgot the contributions of NBPOC to the creation and development of hiphop. It’s root in blues (black), Rock and Roll (black), but also in Caribbean music (not always black). I guess I’m just trying to understand why those contributions shouldn’t be celebrated and if that is the culture you were born into, why shouldn’t you be able to proudly claim that and how can you be expected to disconnect from that part if your culture?", "reytaino809": "Agree with all of this. However, I am pretty sure JLo has a substantial amount of african DNA. Like me I am over 30% black and even though I dont look it I am black", "licmisikri": "Thank you for this💖🌈", "sonyaphilip": "number 10", "asuenizagamelle": "I’m white. I don’t wanna cause anything but my ancestry really isn’t my fault. Our society has made me hate it SO fucking much and that’s how it’s supposed to be I guess? Hating your own race is not okay unless you’re white. Being racist is not okay unless you’re being racist towards white people. I’ve accepted all that but it still seems wrong. Grouping all white people together and saying that we “don’t like you” is so false and it is the same thing that certain racist white people do to y’all. I understand that this kind of post has good intentions, but it effectively makes white people feel like maybe this (hate) is what you stand for. And I’m not denying white privilege!!! I’m really not!!!! But judging someone before you meet them and hear their ideas polarized this country even more. Not everyone is out to get you.", "slynbutter": "@rdanah since the other one disappeared. Have this one!", "dayanitaramesh": "Thank you for this ♥️🙏🏾", "yesitsdimi": "Love it", "marley_cou": "Re: 11 — Do you think there should be a term for non-white solidarity? (Since both terms non-white and POC are in relation to whiteness). I ask this as a person of mixed Asian, Black, and white heritage. I have been calling myself a person of color since no other category would fit. I love this list. Thanks again for taking the time and energy to do this cuz a lot of this shouldn’t have to be said 👏🏽👏🏽😭", "dan_yeet_ella": "white-passing privilege is 100% real. i might be mixed, but i’m still pretty light skinned (since Armenians aren’t that dark). my hair and eye colour give it away tho", "toxicpick": "Recognize that all Black history may not be the same. Black Jamaican history is different from Black American history. And what you can get away with saying in Jamaica may not be appropriate in the US. Context matters. (Using Jamaica bc grew up there and most familiar with its history.)", "ruth.a.roni": "Why is the concept of not calling Black people Persons of Colour so hard to understand? Maybe read the post again before asking Erika what it means.", "crialunar94": "Gracias por esto bella❤️🔥🔥", "francesmroman": "@mrodofficial @hereisgina @jlo", "ouijawada": "Thank you and even once NBPOC are aware and not catering to whiteness or maybe even resisting white supremacy outwardly this doesnt mean our work is done. Often we will conflate our experiences with black folks and while we are not out there using the n word we still are appropriating a black identity/proximity to avoid acknowledgement of our privilege. We have alot of work to do within ourselves and within our own community which is filled with anti-blackness.", "clori.w": "Wait is poc a derogatory term? I thought it was the polite term", "mariosaurus_": "Everybody just needs to stop being so soft and we all have to get along. By being nice and chill and stop maddoggin people. Forreals we just all need to get along, no one is better than the other. If you see someone poorer than you or wish trash clothing stop being mean. Not every black is poor, not every white guy is rich, not every mexican is illegal. Stop putting each other down. Simple as that", "luvleggo": "Question: if poc is too generalizing, what term can be used when the topic is literally about every person who doesnt have white privilege? Non-white?", "thee_candidate": "Queenlish", "esterparussini": "What does \"blackfishing\" means? Could you talk about it please? 🙏💫", "sheldridge": "Yeeessss", "empressnextdoor": "Thanks for updating, I just couldn't \"like\" the image even though I bookmarked the caption", "warnerswholeheart": "Thank you for defining #4, and thank you for all this information", "princeofviana": "❤️❤️❤️❤️", "123flola": "Lots of people asking about use of POC which has me thinking, I wonder if white people’s preoccupation with the term is because of our preference/tendency to say ‘POC deserve...’ rather than ‘white people should...’ Really, the only times you would want to use POC instead of a specific group is when you’re talking about white supremacy so maybe we just need to get better at saying true, negative things about whiteness than aspirational/humble things about ‘those who are non-white’ or another vague term. Another way for white people to lean into the discomfort and do the work. Thank you for this post.", "naomi.cairns": "Thank you so much for this! ❤️❤️ Please anybody feel free to contribute their thoughts to my comment! I totally agree with not referring to Black people as POC because it takes away from the fact they are Black, but surely Chinese, Indians, Afghans etc etc shouldn’t be grouped as POC then as well? It still has no depth. I feel just because they aren’t Black or white doesn’t mean they have morphed into one category.", "emilyywoulds": "also white girls need to stop black-fishing, it’s not a ‘natural’ dark tan. I just don’t understand why they’d want to do it when they know the pain and struggles black people have been through, it’s honestly borderline racist.", "mrs.jesskaah": "This is rad. Thank you. (What’s black fishing?)", "emmyloohoo": "ALSO take a stand for black women/mothers/children/babies right now in America. Black women die giving birth/postpartum and during prenatal care more than any other group of women, are given less care and focus and less necessary medical intervention than any other group of women as well. Your health and your family is the future and blatant racism is trying to erase that literally allowing you and your children to did in one of the most developed countries. Take a stand for better medical care for black people, they are affected by poor care more than any other group.", "ajs721": "@ihartericka Thank you. Thank you thank you. I needed this post!!!", "yilan.batista": "Hi Ericka! I really appreciate this post and the energy and time you put in to educate your followers. I just have one question about the cover image, and you or other people in the comments can respond to it if you would like to -- I completely understand if you don't want to, however, as it would be using your time and labor. Anyways, my question is why did you make the distinction between non black poc and indigenous people? I completely understand why lumping everyone into \"poc\" can be problematic, and why some black people prefer to make the distinction between black people and non black poc. But why the further distinction in the non-black poc community--why the further distinction between non black poc and indigenous people? Thank you to whoever chooses to respond to this.", "thestarsinger": "I would add to this: begin to hold yourselves accountable to the anti-racism and empathy standard you have for white people toward you for yourselves toward Black people and begin recognize, acknowledge and take seriously the anti-blackness that exists within your community.", "mercyhill22": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾🖤", "mixolidia": "Did you post this on Facebook? I have to share this on my timeline.", "vhoecke": "Thanks for sharing. Lots to learn from your comments.", "stacybedi": "I have a vague understanding of the n word, is it possible that you could maybe explain more in depth on your igtv?", "nostalgia_junkkie": "this is wild", "survivormoda.rachel": "Appreciate you, @ihartericka - thank you for always educating us! 😘", "tallykat3": "Okay so I'm a little confused on using the term POC because in the post Itself and the description you use the term POC and NBPOC. So I was wondering when is it okay and not okay to use these terms and is it more okay for certain people to use the terms than others? Btw this post is wonderful and super informative thank you helping educate people (including me)", "dianne_young": "Im latina and I just LOVE when fellow latinxs are anti-black just to please white people 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️ 🙄🙄🙄 like u really are stupid we will always be second class citizens to them.... We might as well be supportive of each other", "ukiinomis": "what term (if any) should we use in place of ‘poc’? or should we just refer to people by names and pronouns? but then what do we do when referring to communities?", "sami8443": "I am so confused by who this is directed to... white Hispanics? Asians? American Indian? Or light skin people with African heritage? Are we talking black in the color of skin or African Roots? I just wish people would stop conflating race with ethnicity.", "zkeller758": "reparations for what??", "laurzavez": "(not trying to sound like i’m coming at you aggressive) aren’t you going against number 11 when you say ‘non black people of color’ in your caption? i’m genuinely curious. and how should we categorize people who aren’t white. by just saying non white people?", "jessmcarey": "Different people groups should definitely learn to be better allies to each other, respecting and engaging in each other's history and speaking up on issues that pertain to communities other than theirs. While American history intentionally hides full history, giving black history only a month rather than integrating true full history into it's norm, I'm happy to learn other ways to respect and be an ally to black communities. I have noticed though that I rarely see this being reciprocated from all ends. This month especially, it's about black people, and that shouldn't be taken away from. In general, I also think everyone can do better advocating for communities other than their own. As a Mexican American, I am curious how we could all exist better in representation rather than compete with each other for space and pedestals. And though we could speak literally with skin color, I don't think any other community, Hispanic, Asian, Native for example, is \"closer\" to whiteness. For those concerned with assimilation, I see the effort of trying to be. But wouldn't whiteness want us to think of ourselves on a \"scale of whiteness\"?", "theafroqueeen": "Lmaooo but Jlo and Motown tho???? And she used to say nigga too 😴", "yzlm_": "So into it, I can’t even describe. Thank you for that dope statements ♥️ @ihartericka i needed this and i know lots of people in my community here in Germany would need to read that too, so I would love to translate this in German in order to spread the word, tagging you and your original Post. Also: i would love to add a perspective to it: When it comes to anti blackness it also exists with people of color, specially addressed to black women* Inter* Trans*. POCs proclaims to share lots of experiences about discrimination and racism as black people do while in the next moment to marginalize black women*inter*trans! So fuck no, we ain’t a community sharing same experiences if you don’t care about black women*inter*trans. Period. Same also to black cis-men!", "theysheher": "YES to your #11. I am not a “person of color.” I am BLACK, and that’s how I want to be identified.", "tiny_pine": "*all [good] music TBH ❤️❤️❤️", "katertotthegreatertot": "Gunna go ahead and add *stop aligning with police*. This is a major fucking problem with Arabs.", "ceesando": "all of this ✊🏾", "toenopawfull": "I’m a middle school teacher and about a third of my students are black. When I hear them use this word I try to engage in a conversation about the history, and how ugly words are always a little bit ugly. And how that word is used now to stereotype black Americans as “hood”. I don’t tell them not to use it, but that it is their choice and their history — i don’t know if I am doing this right. Any guidance, would be SO MUCH APPRECIATED. (And I’m willing to pay - nothing for free, but I don’t know how to google this responsibly)", "1ofmylittlemoods": "Hello angels!! If anyone wants to donate to my Venmo i need to escape my toxic situation!! VENMO is larkblackson. 🦋🦋🦋🦋🦋", "stringbeansoup": "yes, and really importantly the white passing privilege. if someone is white passing, you are white to everyone who does not know you", "get.it.wewe": "👏🏽👏🏽👏🏽", "d1fg": "Amen", "decolonizingtherapy": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "o.arbulujr": "✊🏽", "coolvegandad95": "Fun fact jlo said the N word in a song and the black rapper (sorry can't remember who) in the song w her was cool with it 😑", "garretthomestead": "Omg I never thought about #11. Ericka, your posts are seriously making me question everything, WHICH IS GOOD!! Thank you for your willingness to teach us.", "thetanyambass": "#10👏🏾", "chetzygram": "@chocolatelimejuice @hi.itsesther @sangeetasarkar chat and chaat about this??", "_lady_light_": "Miigwetch for having the patience niijii ✨", "sierra.monae": "Number one is my biggest goddamn pet peeve! I abhor usage of the n word by non-black poc--ESPECIALLY LATINXS. I work as a substitute teacher in a school district with a large Latinx population, and all I hear is the n word spilling from the mouths of middle and high schoolers. I try to address most of the time, but seeing as I'm not their \"real\" teacher, my words have no influence. It's especially infuriating when the students say it out loud, freely, and their white teachers reply with a simple, \"Watch your language.\" 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "yesladypheonix": "yup i’m not with the term POC or “colored people” i’m sticking with original ppl", "diosadejas": "Thank you so much for credit!!💜💖💞", "wannahaveakiki": "👏🏽👏🏽👏🏽👏🏽👏🏽", "ihartericka\nVerified": "Verified", "themelissadenizard": "@wannasworld is the founder of Blackfishing, I think", "n.yallah": "AMEEEEENNNNNNNNNNNNNN", "hestiasfirepit": "if i got this right, should i as a white person stop using the term poc? and if yes what else could i say? just non white people?", "kazejewelz": "And here we are @jazzydexclusive !! idc if Diana Ross married a white man, place blacks at the forefront where they belong. Her story is relatable to others I'm sure pertaining to interracial dating, however I'm more concerned with entitled representation. we have to choose which narratives matter when celebratory events are in session off the backs and talent of us!! I believe we can compare this to what you just showed me last night honey, with the Nicholas brothers. We started it FIRST! appropriation is also allowing someone non-us to represent on our behalf continuously. there's a plethora of us to be chosen. Have the others Stand in solidarity on the sidelines if you wanna support 👋🏽", "iixxguise": "“Most music.” Damn right.", "dontbeeaskingmehowtosaymyname": "Pay us #reparations. Immediately. Unload some of that unearned generational wealth. Start with me, click my #linkinbio to send the start of your reparation payments. Then make sure you regularly spend money at Black owned businesses from here on out. Start amending your hateful history and the actions of your ancestors by changing your own actions. Take responsibility for your apathy and both conscious and unconscious actions that ultimately work towards withholding the system of racism. Admit that you have the power, as a white person, to eradicate racism, which was created by white people. And stop trying to say stuff like, “Whew, chile!” That one isn’t as important as the rest, but it still needed to be said lol.", "qtpocpersonals": "Thank you for this", "wannasworld": "Hello @ihartericka, thanks for including #Blackfishing in this post. @diosadejas and I created the term #Blackfishing in November and it went viral (justifiably). You can check my profile highlight on Niggerfishing to see my articles and info on this!✨", "108hopedealer": "I've been sharing all of my black entrepreneur friends in my ig stories to help promote their businesses. We should frequent black owned businesses frequently but this is a great opportunity to highlight them and gain more exposure. ❤️", "leesareneehall": "👏🏾👏🏾👏🏾👏🏾👏🏾 All of this!", "creature.callie_": "I think we (anyone but especially white people) need to talk about what makes us uncomfortable bc a lot of white people need to feel uncomfortable before they can understand or make a change in their actions.", "layinthefire": "Why did she even accept to do this? Yes, it’s bc of money but still. 🤦🏽‍♀️", "shmilz": "YEY THANK YOU ♥️♥️♥️", "franksnobeans": "Here for all of this. But we also need to keep in mind that black people without American heritage / ancestry coexist with Black Americans and contribute to Black culture as a whole, including hood culture. Otherwise, we further perpetuate the idea that blackness isn’t global and is specific to America. (Referencing 7)", "vivianacapacete": "LOL", "american.technocrat": "Imagine implying whites can't like non-whites lmao", "rockingwealth": "🗣️🗣️🗣️🗣️", "lesliemahtattoo": "👍🏼👍🏽👍🏻", "luminouso": "another one: just because you live in proximity to blackness a.k.a the hood, doesn’t give you the green light to appropriate and use AAVE. (looking at you, nonblack latinxs. 🙃🙃🙃)", "nyah.binghi": "I believe @wannasworld founder of the term blackfishing", "shumbooisadog": "**Most music tbh** 🙌🎶", "witchdoctorpoet": "and stop saying the fucking n word!!"}