{"kianabah": "Thinking black people are the only race that has a certain body type like “thick” lmfao okay 😂😂 it’s like me saying that middle easterners are the only people that have an hour glass figure", "iambabydessy2": "I’m sorry to disagree but as a Mexican American I thought I’d say something. I don’t think it’s right for black people to claim the word “thick” considering all races and ethnicities can have that certain body type. Black people as well as myself love the idea of equality but somehow want to claim a word as their own, I’m sorry but that makes other races feel excluded and I believe it’s wrong", "vjsijsjd": "Anyone can be “ think /thicc” no mater what race they are omg 🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️", "formfitsfunction": "Asinine.", "alienationsociety": "I’m TM’ing the term, but only white ppl can license it.", "sina.raeesi": "You’re really fucking ugly and full of shit.", "olli_3d": "Ewww what happend to her breasts 😂😂😂", "tatsgill": "Thank you, I had recently self-published a book with “Thicc” in the title not knowing it was an AAVE word. I have now changed it and I’m grateful to you for the information.", "_chronicallykinky_": "thank you, i was not aware of this and i appreciate being educated on this topic! thick/thicc: officially removed from my vocabulary", "jon_nels": "I love me some thicc white women.", "a.tajana": "So let’s just recap this.. you can’t use A WORD unless you have a certain amount of melanin in your skin. Ok yes, that makes sense. But then some black people are skinny.. so can they use that term or does that belong to white people only? I’m gonna need more info on this, like a masterclass or a manual would be great", "bd3004": "😍😍😍😍💋💋💋💏💏💏💏💗🙌", "nullacaine": "Soooo heavier white women who actually use the word \"thick\" because it's a way to make them feel more comfortable with their bodies and fight fatphobia can fuck off ? 🤔 I KNOW it's important to some of you. I just don't get why you choose to stop people from using a word that helps them with their body image... why don't we just stop bringing each other down ? I'm all for teaching people where that word came from though.", "hcansevdi": "Thick black women gorgeous👍🙏", "dr.toasterstrudel": "Let me just say first of all that I love what you do and I'm not trying to hate on you or anything, but I am going to have to disagree with you on this one, because as someone who is not super skinny and white, using the term thick/thicc is better for my self esteem other than saying overweight or big or something like that. I don't think that we should not be able to use words like this because of our race.", "swicegooddingle": "Thank you for informing me so I as a white woman can DO BETTER.", "aniwanders": "For real? Thinking some words are only for black folks (or white)only puts distance between people. It's the opposite of integration, kindness and tolerance. Don't get it.", "holliehamby": "@chelsea__x17", "addicksbrady": "Fat not thic", "justinahariya": "@secret_tizi", "wilsonkelman": "This is an honest question, why does the term thicc/thick belong to black bodies? I'm not meaning to sound ignorant or anything I'm just very curious", "april.lucas": "No disrespect here but the word “thick” means a girl who isn’t fat nor skinny, but is well proportioned, has the right amount of meat on the bones and in the right places. So why can’t a WHITE woman allow herself to call her ‘thick’? It may belong to the “black bodies” but at the end of the day it is just a word and is definitely not offensive in any way... white women should be able to call themselves “thick” specially if it makes them feel good about themselves! Regardless of the each other’s skin, we should be supporting each other as women.", "vsagisasori": "what word should i use to feel comfortable with my size if those popular phrases can only be used to describe the race the slang originated from? hiphop is a black genre and rn hiphop is POP aka POP CULTURE. the thicc movement validates my cottage cheese ass. ya im white and ya most people might say im slim but i tore through two pairs of jeans this week with only my right inner thigh meat. i also stress about what flatters my body like a lot of women. this statement feels more hurtful than helpful but maybe im just too privileged and i will never understand 😣", "raiibella": "And this picture is horrible", "banglesslordfarquaad": "ok but can you actually say WHY and HOW it’s pertains only black bodies? bc u posted something saying that it does (when ti ny knowledge it doesn’t) but then didn’t provide any evidence as to how it only pertains to black bodies?", "itshoeyzoey": "honestly not all people in races are the same this is very hypocritical everyone wants to be equal in this day in time but everyone feels entitled like they are owed something bc of all the controversy surrounding equality if u want to feel whole donald trump nor the vs company apologizing is going to make u feel that way all bc of their views on things u put us all into a group like we hate you or don’t respect you but u are human just as i am and i do believe we are equal i hate how society is and the factors of equality bc it is fucked up however change starts within ourselves and u cant change how ppl move or act towards you u can only change how u move and react and the word thicc derived from an English adjective no one person owns a word every word we use is derived from many languages and english is one of the hardest to learn many “thick/thicc” women have evolved into using that term bc the term fat was thrown around body shaming if u want equality and to feel equal you have got to use that as a platform bc bashing one race for using a word that every race uses when nobody knows the first person by their full name who used it is not it to strive for peace our society has so much hate in it and its bc ppl think they are a higher power than the ones surrounding them so shed light on how u can make all women feel beautiful in every race and there will always be controversy and always someone who has something to say but there is no pure people anymore we are not all just white or asian or black or indian we are a mixture and instead of pouring negativity into situations like this provide positivity and uplift everyone", "worlds_best_gram_": "You look hot and there's nothing people can do about it xxx", "d.i.gital.damag.e": "@thethiccgram", "gabthadab": "I am trying to see where you’re coming from, Thick means thick and thin means thin. It’s another way to speak about someone’s weight/ body shape and if it’s spoken in a way that makes you uncomfortable you can remove yourself from that situation - we have to pick and choose our battles. Like someone said above black Americans are still losing their lives every day to senseless police violence and racist attacks. I’m not saying to let it go forever. I’m just saying let’s prioritize", "_daniellita": "Words don’t belong to any particular race u fucking nimrod. Freedom of speech means anyone can say whatever the fuck they want, even if it hurts ur fragile little feelings", "kayleesummersunflower": "I never realized the word thick belongs to a certain race", "ellestmagnifique": "@eatweedzzz this is it! The comments were also super helpful in educating! 🤗❤️", "eliza__tesch": "One question I have is is it still ok for people of colour who are not black to use the term thick if they truly appear to fall under the category thick and understand the meaning behind it and the history and how it’s appropriation by those who don’t have a right to it is problematic? Could cultural appreciation be a thing in this case or is this term solely to be used by those who own it due to the problematic history surrounding the treatment of black bodies and the term thick being used as a way for these ppl to counteract that?", "mis.jenny.anthrope": "😂", "tiltedreplica": "Dang I never knew this. Can anyone tell me the backstory / etymology of the word so I can show up better?", "sunkissedface": "Dude this is stupid the word thick/thicc can be used for anyone it’s a word used to describe the curves or well thickness or someone let me know when being thick/thick specifically tailored to the black community. It belongs to every and any community. So thank you next. I’m really disappointed to have found your account through snapchat as an ‘account making body changes in society’ and then see this. Thank you next.", "eviebatson": "Thicc don't mean fat though? If you fat your fat.", "exfoliate.hate": "You are everything. Beautiful", "annabelle.rhodes": "so can white people still be thick?", "sam1414": "Didn’t know this, but will stop using it incorrectly!!! Thanks 🙏 ❤️", "javiesworld": "So i walk into Sephora and see a pic of my “bestie in my head” and was all excited and ish 😂😂😂😂😂❤️", "typically_me_kimberly": "I don't unterstand.. why does thick/thicc belong to black bodies? Sincerely don't get it 🙈", "leyvemealone": "didn’t know thicc was aave. thank u", "bropittopany": "This photo is moving in so many ways.. Your body is STRONG, POWERFUL, AND STUNNING. You're caption though had me dissapointed.. Copied straight from Urban dictionary. Thicc. (Pronounced Thick) The appearance of a very seductive female with a large ass, in most cases the woman will have a pair of large thighs. No body type belongs to one race.", "strictly_rachelle": "⚡️⚡️⚡️⚡️", "happyhaley._": "I like what you stand for but that’s just very racist. You can’t say only black women can be thicc. That’s like me saying you can buy our hair and wear wigs instead of your natural hair. Call it a weave or not, doesn’t make black people own it. deadass don’t pose as a “public figure” if you aren’t trying to support the WHOLE public. This post honestly made me very very sad. Definitely not fallowing you now.", "lizzardj94": "I’m confused. Is “thicc” not just a slang word used to describe curvy, voluptuous bodies? Where does race come into this? (I have never used the term before, just a bit confused, please be nice to me) 🙈", "philippparose": "I adore your picture and the grand courage that it radiates, however, as a Hispanic woman with a naturally large ass and thighs I find this a little close minded, bodies do NOT belong to a race, and you will NOT discriminate and accuse women of cultural appropriation because of their body shape.", "the_long_wool_coat": "Well language is a maleable and always evolving. That's how words are added and fall out of use naturally with time. And saying that some groups should stop using a word that is already integrated to the current zietgeist because of its origins it's somewhat naive. But that's like judging black people because they were apropiating the originaly British word thick and making it a part of their vocabulary and that's ridiculous. If hispanic and Frank cultures were to claim cultural apropiation of words that were already part of the English language and making it not okay for non hispanic or French descendants to use them, then you would loose more than half of the English vocabulary.", "amylouise_murphy": "@stephaniemurphh", "beccanielson": "Hi 🙋🏼‍♀️ as a white girl who has used the hashtag thick/ thicc, I just want to know how/why it belongs to black bodies? What I mean is, where did the phrase originate? How did it evolve over time? Is it ever acceptable for a white woman to use it? I’m looking to be educated, not berated. I don’t want this to come across as if I’m arguing against you/ asking for proof. I’m curious about the history of the word and it’s connections with society, and would like to learn so I don’t make the same mistake again. I’m still learning about cultural appropriation, and how to appreciate not appropriate. 😘", "donellacandra": "I'm trying to figure out why all these vvhite people are being so obtuse over this post (except I'm not cause, hint: vvhite supremacy and anti-Blackness). Y'all know damn well that when someone says thick/thicc that it's not a vvhite woman that comes to mind. You also know that when you first heard it used to describe a curvy woman it was said by a Black person (or someone who appropriates from Black culture). You. Know. This. So stop acting ignorant. Also, Ericka is sharing facts with you. If you want to keep using it no one is going to come put you in jail or cut out your tongue. No one is going to come beat your tail although with some of y'alls responses I guarantee you you have given Black people more than a few reasons to do just that. Anyway, Ericka is letting you know that if you use that word then you are appropriating and being unoriginal, what you do with that info is up to you. You can stop using it and be a decent person or you can decide to not be a decent person. That's your choice. And if you're just posting to say \"whatever, I'm gonna keep using it\" or whatever else rude, anti-Black, hateful thing you want to say. No. One Cares. We don't need to hear your voice, you don't always need to take up space with your nonsense. But thanks for making it clear to us which of you are trash people.", "thecatalyst818": "I hope this post is also directed towards the cacophony of black dudes I've watched since the early 90's call any & and all ethnicities of women who have some kind of meat on their bones thick.", "kocomeow": "Amen! To these truths and your beaut 🌈💓🤙🏾🌱", "annarennie": "Not trying to disrespect or invalidate - but I’m genuinely wondering why? Why can’t a white woman with a similar body use these terms? Thank you for your feedback ❤️", "ki.fin": "I’m white but I’ll never act like that I know my place", "vendulatarabikova": "it’s just a word. it doesn’t belong to anyone", "narna.lino": "Oh wow, did not know this.", "vikster2307": "@ahhhlisa_campbell", "ashpluslil": "Oh please", "peachingg_": "Can someone please explain to me how thicc and thick “belong” to the black society now(being AAVE) Didn’t get to see what was posted on her stories?", "violet.femmes": "And what if a POC uses the term thick/thicc to describe or compliment a curvy white person? Thank you for your thoughts.💜", "abidkhan4893": "Niec💋💋💋", "chrissiee.dp": "how can a bodily characteristic be assigned to any specific race? a genuine question, not trying to offend just tryna get educated:)", "ariannaroq": "This is ridiculous. Thank you for taking a word and turning it into an “issue”. You are the reason racism still exists in this country. Wouldn’t it be nice if we didn’t bash people because of the way they were BORN? Ridiculous post, ridiculous the people apologizing to you.", "useleamy": "Lmao this is stupid af. Why would a race claim a word ??? You're literally erasing the identity of slime and skinny black people , not all black people have huge butts and huge tits.... Same goes for white women.", "sjdndjfopfm": "Please don’t use this pose or take selfies. Both are owned by white people. You are so ignorant and disrespectful and I’m educating you. Therefore also give me money via PayPal or Patreon for educating you. If you can’t handle this leave the planet", "anton.svard": "i am just one little thicc whiteboi if i cant use that word you better stay away from Reading and books cuz My color made that shit!", "wafiqtheadwanatos": "Saw this online and your account name so I HAD to come here and just make sure you know that you’re an idiot, bye now. Sincerely, not a white person who thinks your obsession with cultural “appropriation” is a stupid fucking idea that you’re wasting your time with and you use as an excuse to spread even more hate in your own retarded special way, if you want to say fuck you to someone, do it, here I’ll show you how, go fuck yourself.", "amirgod2": "😐", "albadre281": "💩💩💩💩💩💩👺👌", "deanmontague": "‘I’m gay and we invented spilling the tea and throwing shade amongst many other terms adopted by the straight community, I have previously been marginalised and discriminated against for being gay therefore I take offence if you were to use our phrases’ See how ridiculous that sounds?? Nah, we let you use it because we like to share the love, as should you be celebrating other thick men and women and be happy that you were able to give them a term to not make them feel fat 🤦🏼‍♂️", "caitlinrmathews": "Being white I never even thought twice about the history and true meaning behind that word. I wld like to apologize for using it in a jokingly manner in the past, and will definitely not use it again. Ty for always opening eyes and educating💜 ur beautiful!", "slgrieshober92": "@lisaaawiltseee", "paninifuckinchowder": "I LOVE YOU so much!!!!", "selfcare_after": "Thank you. !! Also, fat falls differently on black bodies.", "kianna.luna": "I thought this page would be a safe space, but I’m on here being attacked for being mixed with black.", "rinleymel": "@tl914", "ms.bines": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "gschuda_": "Soooo just because I’m white and i very well am thick, i can’t say it cause I’m white? Hahaha smh 🤦🏻‍♀️", "hannahsb32": "@sneak_apeak dis", "godismath": "would u highlight your pre grammy convo??", "pumpkin7o2": "First off it’s women of many races using the term thick. Not just white women. This has come from pop culture and from the help of your black men encouraging it amongst women with comments to women of all races “damn you thick” etc. Like anything else the problem starts at home. Oh and I don’t say it cause I just don’t talk like that 💁🏼‍♀️", "sdslhbrhy": "😙😙😙😙", "brodyhass13": "Why does it have to be black or white we’re all people. Good lord", "jenydalry": "Thank you for giving your time to educate. I am a curvy white woman, and I know I’ve used that term. I’m so sorry. I certainly won’t use it again to describe myself. Ignorance isn’t an excuse. I’m sorry that so often the burden of dealing with this kind of appropriation and the education of other people lands on people of color. White people, we gotta do better.", "wiskenzin": "I can’t stop laughing at this shit. Like what? It’s a humorous word 🤣🤣 some people are really caught up in their own worlds ... or Lala land", "bethandthebeat": "See I’m South American (Guyana) but light skinned and blonde hair. I’ve been called thicc by other people. I’ve never called myself thicc but is being ‘black’ about heritage and family or purely skin colour? I just thought it was a general term like the word thot or something idk. I’m not asking for an argument just tryna be polite and gage other people’s opinions", "jonlmonty": "Uh yah I agree you can keep your \"thickness\"", "kellie.schneider35": "Your beautiful, I’d never have the guts to post a picture of myself like this! Way to insecure 😟 with myself and my body! I hope one day I’m able to do so!❤️👍🏻✌🏻", "sadracernest": "Shut the fuck up", "forras.zsofi": "I'm from Central Europe so neither English nor American culture are native to me. What does the word thick has to do with skin colour? I thought it was just a word describing size", "crayolaclassic": "Ahhh you're going to speak at bard! We so could have used you when I was there...", "tadow.sexuality": "Yasssss🔥", "llamasintrees": "This thread has been an education. Thank you.", "astral_alignement": "White un-educated person here, I've used thick numerous times to describe my thighs etc (more in a body shaming way to myself) I'm not up on \"Thick..Thicc\" so should I now not use the word? It's been a descriptive word to me for years as a kid and usually comes with the saying from my nan \"lovely lass...thick as fuck\"", "shelbychristine16": "I had no idea! Will absolutely stop using in the wrong context, especially referring to myself.", "annahurleyx": "We're I'm from thick just means stupid 😂😂", "sstockey": "can you repost your stories on this topic as a highlight for folx to check out? thank you 😘", "mamalungz": "Just wanted to let you know that you are beautiful 💕😍🙌🏻", "instukate": "Noted. I’ll abstain. Thank you for the insight.", "leontinemay": "This really highlights how cold and impoverished white English has become. I guess that's what happens when a group of people obsess about speaking \"correctly\" in order to preserve cultural and class supremacy. We stifle linguistic cleverness and innovation, and then when we're totally starved for feeling and wit and expressiveness, we turn around and steal words from the same damn people our language rules have been excluding. It's infuriating and depressing.", "boogieformee": "👏🏾👏🏾👏🏾👏🏾", "drpamela.rd": "Thank you for educating!! I did not know that", "saelarbie": "I have never heard of thicc before but I'm called \"thick tall\" all the time by blacks and now I also call myself thick 😂", "madison_shayann": "Thick/thicc are words they do not belong to anyone. White women have thick bodies just as well as black women. Not sorry. 🤷🏼‍♀️", "s0ckertass": "I know this is a very Usa centeralized discussion and I really friend it enlightening but I need to just say that some languages use thick/fat interchangeably and for these people it’s really hard to judge the word as an innovation. I didn’t even understand it was a thing before reading this post I actually just thought people labeled them self thick/fat like someone being tall or short. But I will be more careful around the word now that I know! Just be careful judging people that are just translating their native languages ❤️ (and I live in Britain were the word thick means stupid so its a challenging word all around for me to get a grip on in translation)", "uctrish": "You know I’ve been guilty of this and I’m going to be very mindful of this. It’s these things that we don’t realize we do and how negligent it is. Thank you again for educating us 🙏🏻 I come to your page daily, and many others, so that I can honestly be the best ally I can be. I want no part in backpedaling society.", "rysingh098": "@ihartericka amazing", "auxsombresheros": "🖤🖤🖤 !!!", "smokedbeans_": "I had no idea that this was specifically for black people. I am white and have used this term before, and i am sorry. Will not be using it in the future and I'll be letting my white friends know as well!", "katietunn": "Thanks for posting this. I started describing my thighs as thick as it was the first time I’d heard a positive word used to describe having fuller legs. I had no idea that it was appropriation, thank you for teaching me to do better 💙", "rockn__girl": "I think all that chemotherapy made you lose your mind 😕", "kennnny.m": "Thick is thicc and vice versa, regardless of skin colour. Don’t segregate yourself. That’s reverse-discrimination.", "goldilocksg\nVerified": "Verified", "fluffyskittles": "im kinda sad with this post. I personally don't _want_ to stop using this word - I've had black women call me thick & it's helped me combat my body dysphoria/accept my body shape & with this post, it feels like I've been kicked out of a space I didn't realize til now that I appreciated. like I'm at the point of tears. but you're right & I'mma just chill in this uncomfy feeling and will away my anger while I erase that defining word from my vocabulary. appreciate the work you do, tho it's painful sometimes.", "lyricishellarad": "You're fucking trash or just plain stupid 😂😂😂 white people, Asian people, Mexican, Indian anybody can be thick. Just like anybody including black people can be skinny.", "chris.levens": "So your saying black women are the only ones that can be \"Thick\"", "m_illegalstonermom": "Thick is definitely of black culture, as far back as the late 80s, as I recall. I was a bit offended when my ears heard teenage white girls co-opt it. White people: you don't own everything, quit acting like it. Asshats.", "_ann_lawrence_": "Thickness refers to body type not skin color", "meitnerium268": "Thank you for posting this, I’ve never done this myself but now I know not to ever in the future", "exotic513": "🙏🏾🖤", "mx.perfection": "i hadn't realized using thick/thicc was offensive. is the word curvy also offensive like thick/thicc? (btw non-black poc, you can admit your fault it isnt that hard, -a white passing poc)", "coolvegandad95": "Which of your stories should i watch to learn more about this?", "luminatingruminating": "💗💗", "bedroomactivism": "👏👏👏👏👏👏", "marjoriescott": "I had no idea. Thank you.", "lucinafox": "Ty!", "streetscapenyc": "Erika, let me start by saying I love what you’re doing. You’re beauty, your energy, your strength, your resilience, everything. But sometimes there are discussions on here where I have more questions than answers. Like, how does putting racial restrictions on a word like “thick” result in progress toward a world with real equality? And to dig deeper into one of the replies, if bi-racial folks are not black, can they use the word? What about tri-racial? What percentage of black gives you the right to define yourself as such? 2/3? 1/16? I worry that these types of rules and definitions take us deeper into the systems that created and supported racism and white supremacy in the first place. Identifying the problem and searching for solutions sometimes require different tools. Thoughts?", "steph__spain": "Your friends are sooo accurate. Black men call me “thick,” yes, but that doesn’t make it my word. I may use “curvy,” I even use “chubby” affectionately. I cringe like crazy, and I call it out, when white girls use hashtags like thick, thicc, thiccums, etc. What really makes me 🤮 tho, is white girls with bios and hashtags full of terms like “luv chocolate men,” “swirl,” “interracial bae,” whatever. It’s gross. I have let other ww know that those words are objectifying, fetishizing, dehumanizing, and diminishing Blackness to sexual desirability. I get told I’m racist for criticizing interracial relationships. It is not the relationships that I’m honed in on, it’s language that is co-opted and/or dehumanizing. My ex husband is Black, and I didn’t marry him OR divorce him because of that. He is a whole, complex, imperfect, insecure, lovable, generous person, carrying his own traumas and stories that make him who he is. I would never reduce his stories, identity, manhood, or even his sexual charisma, by describing him as dessert. I feel like I am the only person seeing this as a problem sometimes, because Black men still pop up in my DM’s asking if I like 🍫 . Sorry for the whole rant here. I am hear to listen and learn. I’m happy to delete this and address it in a different space if that’s better. The convo about ww and language on social media set me off. I don’t know if I’m wrong to let the “swirl” stuff bother me, but it does not feel right.", "mjaadanielson": "I have ALWAYS FELT SO UNCOMFORTABLE WITH THIS and now I know why ❤️ thank you for your work", "dscopuss": "Hey bodayyyyyy 😍🔥🤩", "_aryk_aryk_": "I love this! I do have a question though (and honestly, I’m pretty scared to ask. I’m scared that I might get attacked, especially since I am a thin white woman, so please be kind and help educate me) Why is this term specific for black women? Why can it not be used for any person (male, female, non-binary, etc) who is physically “thick/thicc”? I’m genuinely just curious! Thank you.", "eliseetmoi_": "Ur inspiring and beautiful woman. Ur body is incredible ! Ur a model for us ! So inspiring ! Love u ❤️", "annaw23": "@ihartericka can you post your Venmo info again? I'm having trouble finding it on your page. Thank you!", "sophieef11": "Thank you for this info. I’m white and I’ve been guilty of using this term. It stops right now and I’m researching the problematic use of AAVE by white people to ensure I don’t make the same mistake again in the future.", "maggiethemeliorist": "R.I.P Thick/Thicc - a fat white chick", "amethystxocean": "I am guilty of this. Duly noted, I will stop this.", "misspollypepper": "Thank you for bringing attention to this. I’m definitely guilty of it (and mostly because other people have described me as thick and so I started doing it too not thinking about it or understanding).🤦🏼‍♀️ Im entering the fitness industry and definitely see a lot of it there and will do my best to educate others!", "ghetoflower": "🖤🖤🖤🖤🖤", "laurenswim": "I see frequently in the gym / weight lifting community the shirt “thick thighs save lives” and I’m so glad to now know who this belongs to, and know I’ll never own it, wear it, say it. Thank you. And you look absolutely amazing as always❤️", "arwynm": "I mostly see \"thicc boi\" applied to dogs on the internet... I guess I'm following the wrong people? Or the right ones? I didn't know this about these words, thank you for this!", "chel_of_ra": "So even if I identify with those describing words, I'm not supposed to use them because I'm white? And this is a chance to create more space for black people and POCs in conversation and vocabulary?", "shellymcunningham": "Thank you for asking us to work on being better people—even though it shouldn’t be your job to do so. I am here to listen and learn—even if it’s uncomfortable or difficult.", "galletogi": "We must listen. It costs 0 to be respectful and just not appropriate from things that are not ours like let's just be considerate it's easy and it's better.", "illyjanky": "@elysiaaruby", "karalmss": "Thank you for posting this ❤️❤️❤️", "iithyy": "I’ve used this word before to compliment friends but I’ve learned and I’ll stop. I’m sorry.", "_kaswartz": "You give me this picture motivation!!! 🧡", "mamablackmon": "Thank you for giving space for this dialogue. This helped me SO MUCH. As a white person who is petite I have never really had any awareness of this word and I was lost as to why a term referring to shape couldn’t be used by other people. So many people have clarified that for me in here and I am so appreciative. Always learning, always growing.", "miacatriona": "Thank you for posts like this! You are really helping me as a white person educate myself and confront my privilege! I am also in awe of the way you conduct yourself in such a smart and self confident way.", "incensetrapandyoga": "🖤🖤🖤", "caitlinrosesweet": "Also why are super skinny people using it?!?!", "joceheardlynn": "I guess I'm just wondering where black girls who aren't necessarily thick/thicc fit in? I have always been concerned about my voice and my interests and simply who I am labeling me as white because it has in the past. Even tho clearly I am black. But recently, men of various ethnicities tell me I am not thick enough. Make comments about my little booty and my little titties. About how it's not what they are into. And it makes me feel even more isolated. I know that curves and being thick is something cherished and celebrated by my people and please dont get me wrong, I celebrate it too. I really REALLY dont want any of this to come off as me being a hater because I would never want this to be misunderstood. I guess in a nutshell, I dont see black girls like me (someone who is not very slim or thick by any means) being celebrated at all really. I know this post was meant to educate white girls and I hope it does. I just couldn't help but read and feel kind of down because I know I'm not the black girl you're talking about....anywho. you are gorgeous and I love seeing your posts!", "d_nice42": "I've definitely been guilty of using thick. Imma cut that shit out tho now. I've learned everything I know about body positivity and acceptance from black femmes on the internet. Every white femme in my family hates their body and use negative words to describe their weight. But there is a difference between learning from and taking. Thank you for your work ❤️", "samiwilson_wellness": "🙌🏽🙌🏽🙌🏽", "catspi66": "Really glad to know this now so thank you v much.", "ashantidoll": "Wow thats an interesting topic.", "newheidibell": "Whaaaaaa??? I had no idea... I just did a painting yesterday with an idea for a new derby name... Nevermind now. Any black women out there want a cute painting that says “Thiccy Biscuit”? I’ll give it away for free, just pay the shipping!", "chelleorc": "Thank you! I've seen white women do this too in the strength community when they get a little bit of muscle. Just stop.", "ultraaveragehkr": "✊🏾🙌🏾", "collinghome": "Yes!", "amberamal": "👏🏻👏🏻👏🏻", "paphi0": "I am (a white) European, English is not my native language, neither have I ever lived in the United States, but still I would like to fully understand this. When I learned English at school, we were taught to always say „fat“, not „thick“, as the latter would be the rude of both words (whereas in my language we also have both expressions and the use is exactly reverse). After some googleing I found that „thicc“ is an African American spelling, but - although I most probably wouldn’t ever comment on other people’s bodies anyway - I would really like to know why it is the word „thick“ in general? Is it simply because of long time passed on use? And don’t you consider it rude? Is the rude connotation to the word just a myth maybe? Please don’t get me wrong, I am not asking for proof, but as mentioned before, I would appreciate to understand the matter. I just recently found your account and there is obviously still quite much to understand and learn for me…", "ponythem": "Thank you for educating me as a white passing person to not use this word!! I may have used it in the past but no longer ❤️", "original_gata": "Beautiful, @ihartericka ❤️", "maggierosehi": "YES !!! EDUCATE ME !! YES !!!!", "sassyclassymemagrasse": "My bad for bringing negativity ❤️", "kinawicks": "Get it. And a breast cancer survivor??!! 🔥💖", "hvlnv": "What Do they mean they need sources?! First of all, white people always wanted to be black as early as the Victorian/ enlightenment period when all those white women were wearing those dresses that made their behind look big idk what period that was but come on now.. white ppl always been appropriating and wanting to look like us", "syndrome_air": "I’ll stop and never again.", "pumpupthespacejam": "💎💎💎💎💎", "aheartlikeastonecottage": "Ericka- THANK YOU. I am guilty of this and have never even considered the word’s origins before (hows that for white privilege, huh?🙄). You are so right. I appreciate your post so much and this word is hereby dropped from my personal vocabulary. Thank you for helping me become more aware, day by day.❤️", "criavolver": "I’ve seen this sort of language used among the white fitness industry. A lot. It should stop. But I feel like white peoples only want to feel uncomfortable to reach their weight loss goals instead of achieving and building a world of respect of others and their experiences.", "_champagnemamiog_": "🙏♥️💛", "steamed.clean": "@rita_therese__", "etsinthecity": "❤️", "powerliftingnerdbabe": "Thank you so much for this! English is not my mother tongue so I was not at all aware of the history of thick/thicc.", "afromermaid": "❤️❤️❤️❤️👏🏿👏🏿👏🏿👏🏿😽", "thehattlet": "If you search the hashtag ‘thicc’ on Instagram, almost all of the results are (slim!) white women 🤦🏻‍♀️🤦🏻‍♀️🙄🙄 Face fully in palm. As a fat white woman I’ve never felt an identity with the term ‘thicc’. Full figured, is my go-to self description. Fellow whites; learn your rightful place and step off a culture that is not yours.", "eddiejareljonesx": "Chileeeee that mowtown and JLo situation was a chop! #bookblackartist!", "tayler.moon": "❤️❤️❤️❤️🙏🏾", "metastatically_spirit": "You are beautiful. I did not appreciate JLo doing a rendition of Motowns greatest like Tina Turner. Horrible.", "brutusbakeshop": "@theawkwardscone", "nlkaplan": "I had a very hard time watching the Grammys. I ended up turning it off because after the Dolly Parton performance, I felt so embarrassed to be watching it.", "msdsantos6": "🙌🏾✊🏾✊🏾", "koi_core": "BRAVO 👏🏾 SIS BRAVO👏🏾👏🏾👏🏾🔥👊🏾✊🏾💯💯❤️🌹🙏🏾", "badddates": "I’m white and have been guilty of using thick/thicc. Gonna stop now that I know better. Thank you for the info.", "laylafsaad\nVerified": "Verified", "rachelmariaofficial": "For the white people that want proof, why don’t you believe the proof when it’s related to climate change, gun control and violence, or police brutality? Choose when to ask for proof and when to ignore it smh", "deadasskaja": "JLo doing the Motown tribute at the Grammy’s is one of the many examples of how they’re pushing pushing black people out of even their own genre", "ohk80": "I know this to be true and am so embarrassed by it. 🤦🏻‍♀️ Thank you for bringing light to this!", "choxolate_vixen": "@paninifuckinchowder lol please reconsider your statement and take a look at me, my mom, and my sisters and say we are not black. We're all African-American/Thai-Chinese descent. They may not look \"black\" but they share the same blood as me and we are full sisters. I am BLACK and Asian. Yes biracial people are black. Wasn't Angela Davis mixed?", "farahtales": "Thank you for making us aware of this! Which story highlight, if you don't mind me asking? I've been through several but there are so many I'm not sure which heading to look at.", "lateef_omar_martin": "Le sigh. It never ends. Thank you for holding it down!!", "phillipafenty": "we were sprinkled in here and there but overall meh", "itssssam": "The world would be a better place if people regardless of their skin tone just looked at people like humans instead of race. We All Bleed Red, We Are All Born The Same Way, And We Will All Die.. We were Not put on this earth to judge anyone.. Problem is No body knows how to compromise and get along and just love everyone for who they are. That's the problem #I💓All", "zuzu.valla": "💞💞💞", "aliyachaplin": "This is the absolute TRUTH!", "kiertorata": "@uulasa learning new stuff 😏", "aftenstierne": "🙏🙏🙏", "jezra_m": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "still_hilma": "So Whites take the word \"plump\"", "omgshesommm": "yas momma 💗", "mayamoonpoet": "👏🏽👏🏽👏🏽", "ofsaltandearth": "@gracefituk", "clittany": "Talk yo shit, sis! I am so fucking tired of these hellmans-americans appropriating everything.", "korc.can": "Many middle eastern women are \"thicc\" so to speak. But they are not black. Just saying.", "americahatesus": "reclaiming our diction. 👏🏿", "oshunsweetnsour": "🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿🙏🏿", "alltopieces": "I see a lot of my fellow white queers (mostly thin white queers!!!) doing this. Thanks for posting 🖤"}