{"soulbayyblessings": "Brilliant and Beautiful cover #theoneandonly #GraceJones #theoriginal #stillgotit", "iamcharityprice": "I just want to say that I LOVE MY BODY WAND. 🤟🏽", "ursalee": "@daunanicole you would like this insta account 🙌", "futurowoman": "This photo is amazing, and I also am super jealous of the long cord on that magic wand. Like, how did I miss the option for that long cord? ;)", "rose_annabelle_roxy": "Why feel guilty of pleasuring yourself??...Enjoy yourself and body.", "hostenashley": "Love the Grace Jones pose. And your message is on point. Too many people grow up with just wrong sexual values. @jamillah_73", "andreapatriotasl": "👏👏👏👏", "leacrazybambi": "How much I loved reading this!! ❤️", "karmacloud9": "I need more of YOU in my life 🙌🏾 thank you for sharing and for caring 💚👌🏾", "ladylibra333": "Thank you for reminding me. I recently was re-shamed and also have been struggling with how to approach the masterbation talk with my kids. I'm also realizing how much stigma and shame I'm still holding on too. Reading your post and reading all the comments has given me a positive self-loving nudge and much needed direction. thank you for using this platform to reach so many souls that need to be reminded that the human experience is a beautiful journey with no room for shame. ❤️", "emelinejunelyons": "👏🥰🌺", "feministandfluid": "Question: How do I talk to my 3 year old son about masterbating? Im literally at a loss for words. Especially ones he can understand. I did not realize they could start this young and I would love your expert advice. Thank you!", "veggidog": "This is so important, you’re an incredible beautiful being. ✨💕 You inspire me so much.", "eihcraquibete": "@dendeniisee", "jpacephoto": "Would love to send you a personal email or DM about this @ihartericka 😊", "becdwyer": "@l.etish_.a 💜", "leila.niii": "@coolbreezywinds", "lalasfancyshit": "👏❤️", "alichabot": "@itsbrinleybeach ‼️‼️‼️‼️‼️‼️", "s.silvieta": "guauuuuuuuuuuuuu love the picture!", "doulaslife": "I have a 2 year old. Before I had a todler I didn’t know todlers and little kids ca masturbate too.", "_4maria4_": "@cheerishh.m your people", "karendee5": "Love this picture and your explanation!!!", "trdmrk79": "I come from a very religious family, and was told not to play with myself. I did anyway and I used to get super ashamed after masturbating. I do not recall when it stopped, I too may have prayed after... But I remember vividly feeling incredibly bad for feeling incredibly good, I remember the shame I felt felt so tangible. I don't think my mom ever put right asked but I did start young at, least 8 years old. I still masturbate alone and I do like my gf watching me play with myself. She's a lil shy, but I'm working on that. 😜😅", "wildlilpeach": "@phoenyxjones 💗💗", "buenamota": "I love you", "thegenderdiaries": "I love this photo Ericka! You are a beautiful human. 🌈💖", "movedla": "WOW. This photo is EVERYTHING. And thank you for the post...release the shame!", "steviferg": "I've had to learn to not be ashamed that I'm just not into it. I'm not broken. It's not that I \"haven't tried the right thing\". I'm asexual, it's how I'm wired, and I'm just as valid as the people who enjoy doing all the things. 🖤♤💜", "kirstywhitenstudio": "Oh my jee!!! I loooooove this ❤️❤️❤️❤️❤️❤️❤️❤️", "themelanatedmexican": "Interesting spin on #gracejones #islandlife album.", "godeeplive": "Grace Jones!", "beccarisa": "I started masturbating very young to self soothe. I would lay on my tummy with my hand between my legs. it was fairly l discreet, despite me not knowing what i was doing. one afternoon, my parents had friends over. I was watching a movie in the living room, on the floor, with one hand between my legs. my parents saw me and quickly told me to stop and got upset with me. their tone made me feel like I was doing something SO wrong. I still grapple with the shame surrounding loving my own body and creating my own pleasure. sigh. thank you for talking about this topic. it’s so important!!!!", "madskeeeener_": "Growing up I thought that it was only normal for guys to masturbate.. 🤦🏼‍♀️", "the.prickly.pear": "Love this so much.", "karley_marx": "Icon!", "yungflox": "MOOOOOOOOD🔥🔥🌻", "_therevlondon": "The way that this BLESSED me!!!!!!! Thank you.", "cinnamonbunday": "🙌", "titinevos": "Love this!!! Your gorgeous", "crimson_izzlar": "💗", "naimalynn": "😍😍😍", "kontheinternet": "I've learned a thing or two about masturbation over the years: I've noticed that I have better sex and more frequent orgasms the more I masturbate. So I try to make a point to do it regularly just like yoga or reading. I've also found that masturbating to start my day is a hell of a lot better than caffeine! Yet magically masturbation to end the day helps me collapse into bed and sleep like a baby? What a gift! I've also lesrned that I own my own body and my own masturbation. My emotionally abusive ex husband used to scream at me if I didn't tell him I had masturbated. He would demand photos and videos every time. During those dark years my masturbation and body existed to please him. I wish I had realized then that my pleasure is no one's but MINE. If you're in a relationship where your partner demands ANY control over your body or your masturbation, time to kick his/her dumb ass to the curb because you deserve and can find better!", "greer.mcnally": "Thank you so much for this post ❤", "blue_fairy_magic_": "I still don't really know how to masturbate... In my 30s", "mollena_lee_williams_haas": "This Photo Is Everything.", "anothertamilqueen": "😭❤", "burnashburn": "The world needs to hear this 🔥👌🖤 Thank you!!", "happysharks": "I didn't even know that people with vaginas physically *could* masturbate until maybe sometime in my teens! And then after that I had no idea how it would be possible! I definitely knew the word \"penis\" as a kid but nobody taught me the word \"vagina\" until later (at least as far as I can remember).", "trineamazon": "This is the most awesome pic I ever saw! Love just everything about it. Thank you! 🔥", "streamwaterveins": "Preach preach preach preach preach!!!!!!! 🙌🏽🙌🏽🙌🏽", "seattlelite_in_paris": "I remember hearing that masturbation can desensitize women, I used to feel like every time I did it I was driving myself toward a numb clitoris. I now know this is so untrue and if anything helps you find what you like and helps you know your vagina better ♥️", "austyles_beauty": "Till date I don't know why I always feel distant from God if I ever even think about doing it.", "spanneroo": "This photograph is amazing 😍 love your work!", "7suneyed7": "I just started taking Prozac for depression and it has killed my desire to love myself. Mastication used to be my go to for stress relief, to wind down at the end of the day, a boost of happiness and energy. Talking to my doctor at my next appointment because I can’t live this way!!!", "jessiebcle": "This is beautiful!!!!", "nanci.with.an.i": "🖤🖤🖤", "caleigh215": "🙌", "estefaniatrujillopreciado": "Currently going through this with my little sister. My mom always made me and my sisters think that masturbation was wrong. I am trying to ensure that I challenge that mentality my mother has on masturbation, so that my sisters are not affected. So thank you for sharing!", "ammieloris": "Still learning and unlearning. Being wholly myself means taking ownership of my body.", "chrivicanna": "🌌that pleasure should be welcomed and celebrated. Continued exploration of your body is exciting 💓", "jtothezenn": "I had to re teach myself how to orgasm post lots of sexual violence. It was a lot of work to take my power my sexuality back. Unlearning things. My body is not shameful disgusting nor for others to abuse", "backyard.lobotomy": "💕💕💕", "melodic_low": "😍😍😍😍💕 LOVE THIS!!", "liittlewiing_": "This has given me so much encouragement!!!! Thankyou!!! Lots more unlearning to go but have come so far and finally letting myself enjoying get deep into this practice!! It has helped me embrace all of me and love all of me cos I’m allowed to feel amazing 💓💓💓 honestly life changing stuff in my experience. Thanks for making space for us to all talk about it openly 🥰", "littlewave1": "@shellybendor תקראי", "lilyjane17": "I love this.", "be_squared_art": "Tremendous ✊🏾🖤. Fortunately all I’ve learned is better ways to pleasure myself. I feel sad for those who think pleasing themselves is wrong and/or leave it up to other people to please them. F that!🤣", "emmafellenstein": "I definitely grew up thinking I would burn in hell for masturbating. As I've grown up and educated myself, I discovered that masturbation is a f*cking miracle. The fact that my body can produce /that/ much pleasure all on it's own is magic. I've unlearned the shame, and grown closer to myself in the process. I've learned to love my body in so many ways, and coming to terms with the beauty of masturbation is one of them.", "amaury_voslion": "💥💥💥", "giselle_makeup": "Yessssssssssss", "pepper__annie": "AMEN", "thegivingsea": "a whole grace jones pose 🙌", "selah_genesis": "Amazing..#preach", "artbyrasheem": "Also are you reading Pleasure Activism?", "cainneisable": "🤩 BEST!", "kimstringsmusic": "@yourpleasureprincipal", "boygeonce": "Ugh I remember trying to quick masturbation after 8th grade. Ugh and during reconciliation I never told the priest about it even though you gotta tell him all ur sins bc fuck that", "ariannemayer": "LOVE this post, also the Grace Jones album cover nod 🔥", "coconutwata": "You are dope!", "piratecakes": "Such an amazing photo! I've had to unlearn that I need an original fantasy to give myself pleasure. Sometimes other people's stories are enough.", "aureliamoon": "I have had to unlearn that pleasure is only for others or that pleasure means you love someone. Not even close ha I’ve been enjoying reclaiming my pleasure for myself 💋 thank you for sharing sharing!", "amilee94": "Legit a page out of my life", "katienumi": "Thanks❣️❤️👏🏾", "kayveeeee": "Thank you! I went at least 5 years of my life thinking \"girls don't masturbate\" and boys only did it because they were gross.... simultaneously feeling guilty about my own \"indiscretions\". I still have a vivid memory from a party when a handful of my female friends joked openly about masturbating and I was overcome with relief that it wasn't just me. THANK YOU for using your platform to normalize and encourage self love/pleasure 💓", "melly.shines": "I had to unlearn that sex and pleasure were only for \"pretty girls.\" I had to learn that my fat body deserves sex and pleasure, too, and that I am not unattractive or unworthy of a sexual life because of my fat body.", "krisbailey_birthbusiness": "Did NOT know that fun fact !!!! Kudos to you !", "lilymeiweasley": "Yesss 👊👊👊😽", "madmadyxx": "❤️❤️❤️", "ernapple": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "biffin__": "Just talking about sex. Period. I was so ashamed.. still am sometimes. I’m learning though, thanks to you❤️", "diarmuid_9": "I’m sorry, but if you lead a talk to children under 10, telling them masturbation is a good thing, no wonder the principal was upset.", "texancajun214": "I remember always feeling like something was wrong or weird about me because I didn’t finger myself when I masturbated and I never liked toys (until I found the clit stimulator with the suction lol)", "piedmontprovisions": "This image. These words. So powerful. Thank you!", "p13.face": "THIS PICTURE IS S T U N N I N G", "hannah_cifuentes": "Grew up with the ideology that masturbation is a sin as well. Plus having impure thoughts was a sin. Also that my body would cause good men to stumble. Passionately against religion and god being used to shame anyone- especially children- about their body or sexuality. Thank you for this post❤️", "bellesmay": "THIS☝🏼You’ve encapsulated what needs to be said & spread SO well 👏🏼 ✅ ⭐️", "kaylynnmarisol": "@rlujanloveless @hannahpaasch 🔥", "awesomazingly": "Thank you for sharing the healing you are doing I feel it deeply. ✨💕", "__leeshy__": "When I was in primary school, perhaps 6 years old, I'd often place my hand inside my underwear as a sense of comfort. I don't recall why.. perhaps the same way a child holds a \"blankie\". I remember my teacher yanking me out of my safe little bubble with her disgusted tone, demanding I go wash my hands. Probably totally relevant, but the shame and sense of being \"dirty\" that I took away from that experience is not something I even realised the depth of, until this very moment. Your post. It's interesting how these things come to the surface.. sometimes doing something as basic as scrolling through Instagram over a morning coffee.", "elizabethvargasisababy": "That I shouldn't need it while in a relationship is a big one. Took me a long time to be comfortable just saying, okay, I'm going to masturbate now. Well. I'm still not quite comfortable with it, but being brave.", "karin.a.hendriks": "I remember a few years ago in school when guys were discussing whether or not girls masturbate and this guy thought he heard one girl say yeah I do (she didn't say that btw, not that it matters whether she does or doesn't) and her boyfriend then proceeded to call her a slut and shame her for it 😔 made it real awkward to be honest about it for all the girls in my year after that", "secretcoconut": "Wow. This is powerful.", "natalieatsplants": "I think that’s a good point about being in a relationship ending most people’s self exploration with their body. 🙌🏾", "lalalapascale": "I had to unlearn so much when I had my kids. I didn’t even realize the extent of my programming until I found myself wanting to freak out when I would catch them and had to forcibly stop myself from shaming then went online to find ways of unlearning and re-educating. I even found sex talks difficult with my three girls. Which was strange to me because I always thought I was an open person. I still find I need books and dialogue templates when I have talks with my kids or myself because the programming and internal shame was so ingrained. Also finding great material can be difficult because there is so much out there but it is obviously not created equally.", "drewbeck": "Yaaas", "joyahevony": "I'm still tryn to unlearn.", "jomcitrus": "💖💖💖‼️‼️‼️🔥🔥🔥", "kelvin_hashtag": "🙋🙋", "bethserafina777": "Thanks for this beautiful picture and post ❤️ Fortunately I was raised with an awesome single mother who was very open about masturbation being a normal part of life. I have learned that coconut oil by the bedside is helpful for lubrication while masturbating, as well as during sexual encounters. #coconutoil4lube #masturbationisnormal", "just_mandyr": "I’ve been trying to unlearn the ideas that my pussy is gross, my desire is gross, and my body is shameful-sometimes by being too lumpy sometimes too provocative.", "daughterofravens": "💖🔥💖🔥💖🔥💖🔥💖🔥💖🔥💖🔥", "fleshallamesh": "💎💎💎", "cfoxrun11": "I remember when I first had an orgasm from masturbating thinking I was pregnant. I cried for weeks until I got my period because I didnt know how to tell my parents. I was so traumatized and convinced that orgasms were bad, I didnt allow myself to have another for yearsss. I needed to unlearn sexual guilt and embrace it for what it is. Natural. Normal. Fun.", "lvalcantar": "This is EVERYTHING!", "sexualhealthwithdee": "I hope it's okay if I repost this <3 Let me know if you don't want me to!", "weird.princess.peach": "😭💕", "nicole__moses": "So inspiring", "radhicka_": "Definitely still carry that shame, but I've learned to become aware of it and dismiss it, though it takes a lot of effort and emotional labour. I received little to no sex education, so I didn't even know I was masturbating until I read about the clitoris. All I knew was you can masturbate with a penis and had no idea how it works for vaginas, and I was too afraid to touch those parts because my culture is so hush about sex/pleasure, especially for people with vaginas. I have a long way to go but I unlearn a little more everyday. Thanks for always being such a big help in this journey!", "samantharise": "Also, sending this my high school’s wall of inspiration committee", "femalenickmiller": "When I was younger and discovered masturbating, I used to do it and then pray to God (and I don't believe in God) for forgiveness and that if it would just \"work\" this time then I would never do it again. I was 14 and hadn't had a speck of sex Ed (because they taught abstinence in my school and my mom never talks about anything uncomfortable) so I had no idea that it was healthy for you and in no way \"bad\" or \"disgusting.\"", "_zoe.c_": "Yes!!!!!!!!!!! #thisPicThisPost", "kateo_sullivan": "That I wasn’t fantasising about myself as a woman. I was fantasising about women. Gotta love that internalised homophobia eh?", "yva_music": "Yes! This resonates with me so much (I was bullied and teased about masturbating at a very pivotal age) and I love to see this being talked about more openly. You’re amazing and I learn a lot from you. Thank you!", "wiseguy_2020": "The picture makes me think you’re the Pleasure Fairy, who’s magical power is de-stigmatizing masturbation and helping young kids get over their internalized shame about their bodies.", "songbirdforlife": "This is my absolute favorite so far. 🌼", "magalilegleye": "Amazing breathless pictures 😃", "midwife.on.the.run": "@dsorg12 this is what im talkon bout", "aquariuntay": "im writing a paper on this for one of my gender & women’s studies courses!! & this is so important to talk about yesss Ericka👏🏾👏🏾", "jendawsonart": "😭😭😭🙌🙌🙌💓💓💓", "jeffmannes": "May I reshare? :)", "mswilltigre": "Coming from a a girl who loves her church... Christians have THE WORST doctrine on earth, and it has seeped into so much of our culture. The \"churchs\" thoughts around sex are also EXTREMELY DETRIMENTAL to the human condition, hence why people reject this religion. My journey is, I am finding and loving myself first, then allowing a God in that I can actually trust. He has revealed to me He is nothing like how I've been taught or told... he is inclusive, loving, no duality, no shame, no fear. NO HELL!", "elicia_g": "i will never not love this so hard", "elarkyy": "I have struggled with a restrictive eating disorder since the age of 8, and the struggle of weight changes and hormone damage along with the hatred for my body had me in the mindset that I didn’t deserve to feel good. When I went into treatment as a high school senior, I gained the weight needed for a baseline of health, and it was essentially delayed puberty. My hormones were high, and that’s when I first began to find pleasure for myself via masturbation. I still find myself holding guilt and shame around learning about my body - when I dislike my body/myself I find it hard to allow myself to do what feels good and natural. It’s my 23rd birthday at the end of the month and I’m working on being okay with finding pleasure on my own, for my body, and rewriring in my mind that it’s natural to want to feel good, no matter how I feel about/towards my body.", "cristalsharris": "I had to unlearn that it was someone else’s job to give me pleasure.", "vesi_llc": "This is so confusing tbh idk what to say help me @ihartericka", "pufffropro": "The part about not masturbating while in a relationship hit home", "greenscarf1440": "✨Ps. She probably needed it in big letters because maybe she struggled with it too 😅✨", "soulfreedreams": "Sexy ass", "issatrae": "Is this... available....for purchase? In print? LARGE print? 😍😍😍😍😍", "helloimnelle92": "🙌wv", "transformationyogasc": "That it was okay and I didn’t need to “repent” after “doing it”. My mother actually explained that it was natural, she was a nurse although we were considered “religious”. After that I stopped repenting and explored as often as I like!", "morgan.bp": "Iconic", "kaybar1": "Brilliant! ❤️", "hippysunflower1": "😍😍😍", "montanafosberg": "Yessssss! What a wonderful thing it would be if we err taught it is not only ok but imperative that we be the first to touch explore and love our very own bodies! Yes to teaching young people to know their bodies the Best!", "anessalarae": "👏🏾👏🏾👏🏾👏🏾 Yaass!!! 👑", "la_filosofia": "💕💕💕 so comprehensive and well written", "mdcolbee": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "thcjoburg": "🙌🏽💚🔥", "sendinglavenders": "Omg I LOVEEE this photo!!!", "feministwynn": "LOVE THIS", "titaniaartmodel": "YESSSS to this image and everything you shared in your caption!!! I was the Black girl who asked for forgiveness every time. I was taught that my body didn’t belong to me, but to a God outside of me. I’m still unlearning 💜🙏🏿💜", "transqpoc_and_doge": "@queenjeyla look at the majesty of the wand 😏", "miss_crystalinne": "I was raised Christian and at a “women’s night” with my family I begged for a book. Some of it was about sex. It was actually a book that through testimonials claimed mastrubation would ruin your life and especially your marriage to a man because he wouldn’t be able to satisfy you the way you do it yourself. Including a story where a husband yelled “why don’t you just do it yourself!” When he couldn’t get his wife off. It terrified me for years. I now know it’s total bullshit and you can have your own pleasure and you can do it with partners and your partner should be willing to try to learn about you body, not scold you for it. It was one of the most harmful things that stuck with me even after I left Christianity because it seemed more connected to general relationship advice - because I didn’t have any other sex positive information about it. (I also grew up around boys joking that only men cum. That didn’t help either.)", "paige.s7": "Stronnng", "wheat_from_chaff": "So badass.", "ana_____italiangurl_23": "👏🏾👏🏾🔥🙌🏽💚🔥", "unfollowww.1.1.1pls": "This is so inspiring and it’s so true there’s so much stigma I feel like nobody has serious conversations about this! It’s always jokingly conversations but when it comes down to the truth there isn’t always that much seriousness concerning this topic and I think that people need to be more open and embarrass their own sexuality and not be scared or nervous and get to know yourself of course only at your own will:)", "styletropicalia": "@verboypiel", "isabelsofiarock\nVerified": "Verified", "politicsandfshn": "Amaaaaaazing 🙌🏿", "lauralushoc": "YES! I can so relate growing up in Catholic ‘masturbate and you go to hell’ Ireland. I’m already talking to my 8yr old about exploring her body, in private, when she feels the need. Love this post and love you and Eb, Erica ✨😍✨", "jennikarami": "DUDE. This. I remember the boys talked about jerking off constantly but it was taboo for girls so I thought I was the only one who masturbated for the longest time 😭 I had so much shame and self loathing until I realized it was totally normal!", "pumpernicole": "I am still unlearning. I remember masturbating as a kid and the wash of Christian guilt afterwards was so forceful I’d get nauseous or have panic attacks. Now, as an adult I have an extremely hard time disassociating those feelings and still struggle to enjoy hand stimulation from myself and my partner.", "naima__amall": "I’ve had to unlearn similar to you . I once left a vibrator out by accident and my partner saw it and both of our reactions where interesting I was embarrassed 😩 they seemed to be shocked that I had one lol 😝 and questioned if they were enough which made me feel guilty . Now I know it’s ok I even joke with my teenagers who definitely want me to shut up 🤐 I just want them to know it’s all good !", "thebopowitch": "Definitely also thought masturbation was a bad thing. I didn't masturbate until I was 19 and would only use a vibrator because I convinced myself that using my fingers was too \"dirty\". 😂", "ultra_momma": "I have had to unlearn all the Catholic teachings about sex. I found my sexuality early & found masturbation early on but carried guilt & shame for so long. I knew by age 8 that I was pansexual but had nobody to talk to about it or the tools or knowledge to know what to say. The guilt associated with women & sex in the Catholic Church totally fucked me up....but I am on the journey of unpacking it all.", "the8thplanet": "@samlevsonart thats us", "cottoncandymajinboo": "Omg ily 💓🙏🏽✨", "iamsheadiamond\nVerified": "Verified", "dspeaksleo": "Love this!! I had to unlearn that masturbation was something \"loose\" women did. That the practice of masturbation was not something black and brown women participated in. Those practices belonged to \"other\" people. So much to unlearn and still more to go. Thank you for this.", "rohlandarkspawn": "🙏🏽", "tanisalexis": "Thank you. You've taught me to have these conversations with my daughter and it has been such a safe reassuring space to learn from. Ericka, seriously, THANK YOU! 😭😘😍", "sophiawallaceartist": "Iconic", "andsheshere_": "That it was a “backup” and a “lonely choice” I also had to teach myself that I was allowed to be responsible for my pleasure rather than wait for the magical partner that would unlock it in me. I’ve given myself some of the best orgasms of my life lately and I’m low key mad I just started learning how to bless myself lol", "cristina298": "You're coming to LaGuardia community college?!!! I'm so excited!!!!", "shaunbrown\nVerified": "Verified", "femmeniste": "🙌🙌🙌", "sirm00re": "This is legendary you do know that right?????!", "beth58610": "👋👋👋", "bleedingartsclub": "i had no idea what i was doing was masturbating. but i knew if i couldnt sleep, i could do that, then pass thee eff out. i love this photo of you sooooo much. you are a magical human. ✨", "ophelia_obscura_obtuse_xqzmi": "❤️❤️❤️", "stellarose90": "I went to a Christian school from kindergarten up to 8th grade. When i began to explore my body, I would immediately feel shame. So much so, I would cry and pray for a hour or so afterwards. Even when I realized that exploration of my body was okay(around 16), I still would feel guilty! It took an additional 4 years for that guilt and shame to truly go away. It’s actually quite infuriating to realize that many of us, those who received abstinence-based sex-ed or none at all, have to unlearn toxic,fear-based bullshit before we can truly discover our own pleasure.", "emilyodesser": "this is such a magical picture", "raquee_zy": "I was in an emotionally and sexually abusive relationship with someone who watched hard core porn liberally, and in the MySpace day’s would put various porn stars on their top 8 before me. I was 15, still exploring my own sexuality but grew extreme resentment towards porn and the sex work. Primarily because he would point out parts of my body and humiliate me in front of his peers, comparing my body to those of women who are of age to be having sex. Whatever his agenda was with porn, I always assumed it as cheating but underneath that were so many layers that I did not recognize. I had faked orgasms til I finally got my hands on a Hitachi massager that my mom had bought for its original intended use, after exploring porn for myself and realizing “wait, you can do that with THAT!?” Anyways, after that I started to liberally masturbate (something I internalized to hate my ex for) I realized I had so much to unlearn but it was so relieving. Fast forward to now, my partner and I openly communicate about masturbation without any attached guilt or resentment towards one another. At first he would say things like “it’s not better than me though right?”, but really I can’t compare him to my self-pleasure. This photo is so awesome, and thank you for your share @ihartericka ❤️ happy masturbation month!!! Year!!! Millenium!!!", "rchelle13": "This absolutely magnifies the fact that the ridiculous catholic church sex ed program i received as a child was part of the confusion and shame i felt as a young girl. 5 and 6 years old i was with mostly boys and they knew everything about their genitals and we knew literally nothing about ours except the peroid stuff and getting pregnant bit. Pleasure was never a part the discussions and it took forever to figure put where my clitoris was. It doesn't help when your biology teacher is tell the classroom that you pee out of your clitoris!!!i was like wtf are you teaching its not the same place at all!! That wss 11th grade bilogy. In a small town catholic highschool. That would expell queers just for touching", "bonnie_mitchell_law": "@polie_law follow ericka on ig! They’re an amazing person!!", "ruben_lealjr": "@lezlielokz", "_alison_nosila": "There is a @pen15show episode about it, thought I'd share for others who need to cry-laugh it off, sometimes we heal through comedy//thanks for posting 💞", "hobryant": "#MAYsturbation", "nadya426": "I was lucky to grow up with a very pro-masturbation mom, but I was also sexually abused at a very young age. Now that I am a mom I am suddenly being hella triggered by my two year old son masturbating because I have all this fear around adults acknowledging child sexuality. You think you've done all the therapy and then boom surprise! So I am working on unlearning my fears about correctly supporting my son's relationship with pleasure. I am grateful for the privilege of my insurance covering a psychologist.", "cultivatedreams": "Wow... this post just made me realize I still have shame/guilt I need to let go of because of religious programming about masterbation. I wish that every child had the chance to have you as their sex education teacher 😭 Seriously tho, if this was the education that children (and the adults the turn in to) had access to, we would live in such a healthier world! Thank you so much Ericka for this post and for ALL of the work you do! 💗💗💗", "rubennatal.sanmiguel": "♡♡♡☆☆☆", "iamlakeiaclark": "@ihartericka ❤️❤️❤️❤️", "mrcarl007": "Sounds like I need to unlearn some things and learn some. I need help lol", "sanders_hergrace": "I remember the intense guilt I’d feel after masturbating bc I‘d been taught that God was ALWAYS watching and I was like shit God u rly didn’t need to see that", "sister_dlyn_maryjane": "💗", "auggiesmom422": "Masterful piece of art!!!!🙌🏾", "simoneedithbassa": "Everything is said", "whatisthehalflifeofloneliness": "I was lucky enough to be born into the Unitarian Universalist church where comprehensive queer inclusive sex ed is part of the Sunday school curriculum.", "ned_nedd_and_neddy": "I recently learned how to masturbate because of the stigma around it. I was basically taught to be afraid of my vagina but the day I learned she was a beautiful part of my body was the day I became more liberated. I love your posts ❤️", "azuleyada": "LOL I love this. Like a Greek statuette, but make it masturbation positive.", "perfumistasf": "💙", "joannariedl": "Magic wand ftw", "ruled.by.mercury_": "I always felt societal pressures so intensely as a child. I felt so incredibly guilty for exploring masturbation at a young age. I thought something was really wrong with me. No one ever told me it was okay to play! 🤷🏼‍♀️", "mkjpepper": "One Church program taught me that when you masturbate you bind yourself with a demon...because there’s no human there to bind yourself with. 😑", "rockyb4you": "Amazing !!!! 😍😍😍😍😍", "drcandicebaker": "🙌🏻 Yes!", "mallikor": "Check out the last post made by @salty.seagal - female pleasure taking the backseat is ingrained for so many people by their whole environment", "brianna_fu": "I had to unlearn the shame associated with it. When I was young it was used as the gateway to abusive behaviours perpetrated against me. It takes a lot to take that back.", "talking.with.talya": "This is amazing. Thank you for sharing your story. My goal is to empower people through their sexuality. I’m with you! I ❤️ masturbation.", "shannonsorensencreative": "SO much to unlearn, and so much to teach our kids, who are naturally curious and should learn to explore their own bodies however they feel comfortable and safe. Ugh, the amount of shame and suppression growing up and even into adulthood is insane. I used to watch Dirty Dancing on VHS after school before my parents got home. So many feeeeeelings as a 9 year old. Haha", "dee.millionz": "#Iconic 🔥😍👏🏾😘🙌🏾", "hannahgrace513": "Literally all of this!!! 🙌🏻 love it. Keep educating the people🙏🏻❤️", "croyster912": "This all this!!❤️ Masturbation is self care", "freeakanrican": "🐆🐆🐆meow", "sheran_55": "Foundy the blondey", "glitch_inthematrix": "YES!! ALL OF THIS! My religious upbringing caused lots of sexual issues, any form of sexual activity in a premarital context was shunned and shameful and wrong which was especially difficult to process as an assault survivor.", "ellis.greer": "That it’s ok to use lube", "nartustrust2": "There's no wrong way to cum !!!", "suzspencer": "The magic wand changed my life! 💗❤️💗❤️🌋", "nicolecostello_": "FUCK the bible. Truly. If more people masturbated the world would be a better place 👏🏼", "jldontlivehere": "My little cousin was 2-3 years old sitting on the front porch playing with her vagina at a family bbq. Her dad went up to her calmly and said something along the lines of “if you want to touch yourself that is healthy and normal but that is something for you to do when your having alone time by yourself in a private space, not when your in public, ok?” and she was like “ok” shoulder shrug* it was no big deal and I was just so proud of my cousin for not shaming his daughter. My parents literally brought me to a doctor to see what was wrong with me because I was exploring my body as a child. The doctor was like “kids do that, it’s fine” but the situation definitely shook me and made me not trust my parents when it came to sexuality.", "noah.the.creative": "I remember puberty hitting at age 10 and no one else around me had started that young. I had to learn everything about sex & pleasure via porn—the first porn I ever saw was gay porn lol my queer ass would🤣—not being educated wasn’t a surprise as I was raised in a Catholic household in the dirty South. I did feel shame when masturbating and I remember my heart beating so fast every time I would masturbate in fear of being caught! Thankfully my queerness prevented me from wanting to engage in heterosexual sex and my chances of being pregnant were nonexistent...but damn folks please don’t leave children in the dark!", "wonderfullyartistic": "I appreciate this post and u because you are the only black curvy queer female that comes to mind, when I think of others like me. Representation matters! I understand the whole repenting after sexual acts things too. My mother is an evangelist🙄 after I had sex with women I would hope I didn’t die in my sleep that night because I was convinced I was going to hell😂 Crazy how we don’t know each other but have similar narratives.", "krissarie": "Similarly I felt shamed by other students who were also going through the same terrible sex education or lack of as me in a Catholic School. Touching yourself or masturbating made you a \"perv\" in my elementary and middle school. I did end up connecting with one friend who would discuss sexuality, self harm, depression, unconventional families, and more with me. Together we almost had our little club where who we were able to be curious about anything without being judged. Still, we were isolated, bullied, and dismissed if we wanted to discuss any of it with other students and even our school counselor.", "kamifrench": "Fuck yes!!", "imkegobel": "Still feel weird and guilty after I masturbate, so still in the process", "balletmeli": "❤️ Photo and caption. Thank you 👍 Information for all to know.", "j_a_zarifian": "I’m 60 and only in the past 10 years have I come into my own regarding my masturbating. But I do remember my daughter at a young age wrapping herself in a blanket and “getting busy”. And when my mom about had a cow, I shut her down then later took my daughter aside and let her know there was nothing wrong in what she did, only that it was a private thing. I wish I’d had me around growing up.", "missbazorn": "I appreciate so much your comment about unlearning that masturbation doesn’t have to stop in relationships, and that your bodies don’t “belong” to another person who we just wait to give us what we need...! I’ve “known” this but reading it here now is a fabulous and powering reminder!", "jyvonnehaskin": "AAAAAAAAAHHHHHHHHHHHHSOME!!!!!!😍😍😍😍💕💕💕💕👏🏾👏🏾👏🏾👏🏾🔥🔥🔥🔥✊🏾", "ardengrier": "@lightlayerproductions", "healthyteennetwork": "Thank you for this! It is so important that sex ed is comprehensive and sex-positive! Great post for the first day of #SexEdForAll month!", "ravynstadick": "I’m not sure about what I’ve learned or unlearned for myself, but as a mother of two young girls, I’ve been made aware of the annoying double standard we put on our teens. Boy masturbation is a trope in movies, and joked about with friends. Girl masturbation is not spoken about ... so, I follow sex positive family accounts here, and am trying to be sure none of that gendered bullshit gets in the way of my kids knowing their bodies, feeling empowered to know that it’s not taboo or wrong or sinful. Such an important conversation.", "megan_t_hicks": "Iconique 🌟", "ro.takeyourspace": "Thank you for this 💛💚", "_hey_toni": "I deadass use to think God would be looking down on me shaking his head 😂😂😂😂", "miss.sweets2019": "yAs👏Thank you💜You are so beautiful💮🌺💮", "ocean_bythesea": "It’s perfectly ok to prefer self pleasure, that you can use it to heal from much trauma. 💞", "robotsoul": "🙌🏾🙌🏾🙌🏾🙌🏾", "ambernicole.hilton": "Goddess💕", "miya479": "❤️ had to unlearn that it is petty and only done because nobody wanted me to be his girlfriend, aaaand that it is dirty and not normal and that if your boyfriend does it in secret it does mean you're not giving him enough of what he craves. 😈", "divatareva": "Wow! Sooooo many of us can relate to THIS post. I love you! I was very lucky my mother was very pro sex, she was on old southern Baptist woman with a new school twist. I used to touch myself so much that I would touch myself in school (elementary) 😳 on top of my clothes...but still...hands on my crotch...infuriated my teacher and I was suspended! My mother did not punish me she laughed in the teacher and principals faces and told them she would talk to me...first lesson...this was a solo act and not a free show for anyone at this time. 2nd lesson came in college when I admitted that I love to masturbate to my dorm mates and was shamed, so disappointed was I that I spoke with brother for a man's opinion and I will never forget ...my little bro told me and my dorm mates ...well if you don't wanna touch it why would someone else! Is there something wrong with that thang!? 😂😂😂 ahhh #ilovemasturbation", "sincerelyjessig": "Literally like they were with us in our wine convo today @betzonblack 💁🏻‍♀️🥂✨", "kcsorg": "💥💥💥", "amandarinorangess": "That masturbating doesn’t make you less sensitive when having intercourse. That you don’t have to orgasm every time. For the longest time I was ashamed because I could only orgasm from masturbation. Because we’re so wrapped into this whole masculinity BS that a man should be able to do that for you because multiple orgasms make them a god or some shit , and then it hurts their ego if they can’t... Now I say: FUCK THAT.", "ninihigherpurpose": "Masturbation was a coping mechanism through my first bat with depression. From there I learned that it help me gain ownership of my own body. That the right to my pleasure doesn't lie in a man", "shandel.parsons": "That it's ok to talk about and do. ❤️❤️❤️", "acuario_1979": "Me super encanta esta foto", "stellasgart": "That shame was passed down to me from a long line of sexual abuse and the church.. luckily we’re part of a generation breaking those cycles and not passing it on to future generations. It’s hard Work to unlearn something that disempowers (especially female) but we need to. Thank you for speaking truth for all of us🌟🙏🌟❤️", "lilpandulce69": "beautiful!!!! 💕", "yourcurlcrush": "ICONIC! 💖⚡️💖", "clasby": "My male friend in 10th grade asked me if I did. I said yes. He immediately turned to a boy who was not my friend and said \"I know a girl who masturbates.\" The non-friend boy looked at me instantly. I shrugged like I had no clue who it could be. The non-friend boy laughed and said \"ew, that's nasty.\" One, my sexual behavior was instantly outted by a male I called a friend. Two, the reaction was of disgust and laughter. 💔 Spent years working to unlearn the shame and rebuild trust in talking to others about it 💔", "stanleyliewapoi": "YES👏👏👏👏", "worldwide.glitteracy": "Ooh wow yes. Anti-pleasure ideas tied into self-worth, desirability and disgust for my own body were and continue to be such huge stumbling blocks gifted to me by a lack of sex ed and openness on the topic.", "dark_nectar_co_op": "I had to unlearn that masturbation was just getting off. That I can develop a true romance, deep vulnerability, self love and care in masturbation...while going into deeper kink/fetish with myself than with my partners. That I can have a higher level of safety with myself than I can with anybody. That I can access the deepest sense of connection with humanity, the ecosystem, my queer ancestors, the secrets of my great grandmothers, and their mothers and daughters, the pleasure as necessary for survival.", "stylescrybe": "So much about this post is just... 👏🏾👏🏾👏🏾 🔥🔥🔥", "maisyns_daddy": "That “nobody else will ever want to touch you if you are one to touch yourself!”", "tactilestudiosltd": "I lucked out on this one. My mom is a nurse, so she was pretty fine with it. I was told it was a private thing to do. Ie, stop humping the pillows in the living room... but that was really it.", "dantorchic": "What helps me get rid of the guilt, was the love I started to have for my pussy. Once I made peace with her, then I unlocked my pleasure and it's so great 😂! Masturbation is life : touch yourself to know thyself 💃", "imawhicher": "That it’s simultaneously ok to do it when I want, and ok to not want to do it. Also, sometimes worth exploring why I don’t want to... How I was not acknowledging the affect of porn on my psyche, self-worth, body image. I never wanted to see my vulva, subconsciously thinking it’s ugly, not porn quality (thankfully that industry is changing, sloooowly). I masturbated with a mirror between my legs the other day and saw myself and was in awe of what I could accomplish with myself. The vast applications of Audre Lorde’s - the uses of the erotic: the erotic as power. It’s on YouTube!", "aeleyeseeeyea": "🙌🏼 Yes. Very much the same!!! I would fall asleep crying because I thought I was such a bad person. Thought I was doing something so evil but couldn’t stop because it felt so GOOD.", "starsnsarah": "I think that growing up as a Catholic school girl...most of the time sex, in all forms was kept quiet and when spoken about, was frowned upon. For me, it was a release, and I learned what I needed. I'm not sure I ever felt ashamed the way that I was intended to. It wasn't until I was in a relationship as a young adult that I had to figure out that another person certainly doesn't mean that you can't still fulfill yourself, that masturbation doesn't mean you aren't also fulfilled by someone else or that your relationship isn't still healthy and normal because you do it. Thank you for talking about this topic.", "anamiree": "❤️💛💙💚💜", "kingaliya": "Every morning before I start my day 😄👌🏿", "garbage\nVerified": "Verified", "arechiga.cassandra": "I had to unlearn alot of Latinx Catholic guilt and shame that comes with masterbarion. For so long I felt like I was the only girl/woman who did it. We all knew boys/men did it becuase they talked/joked about it but the young women I was around never even risked mentioning it. It wasnt until high school a friend of mine talked about it openly! I remember the initial surprise that she was even admitting it lol but the relief that I wasnt the only woman and wasnt doing anytbing 'wrong.' I'm still unlearning so much bs; posting this alone got me thinking yikes who in my family may see this but I rather young folx feel accepted and a sense of community rather than the shame and guilt I felt for so long. Thank you for this🌻💜😊", "the_lost_anna": "i didnt know im doing it, most of my childhood i was just doing what felt right and then i found out THATS the famous masturbation and orgasm and i was so mesmerized by that :D BEAUTIFUL PHOTO BTW!!", "zentuition": "I’ve had to unlearn that masturbation means penetration or stimulation of the clitoris. It also includes the feeling of pressure alone. And not everyone masturbates in the same positions or even naked.", "phillyfledgling": "Grew up in a secular home with lots of silence around sex abd sexuality, then joined a church and added shame and 'holiness policing\" on top of that, got married in the church and was basically taught that NOW I get to be 'legally sexual' like ugh, BIH I BEEN a sexual being but now it's ok because you get to sanction (control) it. Took me a loooooong time to unlearn that. I'm still unlearning. You are helping me.", "justagirlflyingaway": "That it's ok to not do it, it's ok to never want to do it. My body is still a perfectly good body if it didn't want to be touched in a sexy way, even it'd it's just by me. There doesn't have to be some sad internalized shame keeping me from doing it", "epfni_": "I started doing it when I was 12. I remember that I did it 5 times on my first day bc it felt so good and magical. After that, I had to unlearn that there was a distinction btw clitoral orgasm and vaginal orgasm and as Freud put it, the latter is the “normal” one. I had to unlearn that I am a sex maniac psycho. I had to unlearn that I should deny that I do it to seem like a “decent, sane, nice” gal. I had to unlearn that I must be man-like thing bc I wanted it so much. I had to unlearn that females should not want it, enjoy it, be curious about it and especially talk openly about it. There you go :-) Thank you for güvimg us space to talk about it 🙏❤️💜", "shamzillaz": "🙌❤️🔥", "unofficialmika": "I had to unlearn that masturbation was a hush-hush shameful topic, and it was something only men did. I also had to unlearn that there is no \"right\" way to masturbate and there is no \"right\" schedule for masturbation.", "d_d_moore": "🔥🙌🏿", "imas5sami": "My twelve year old son and I were going through many of his questions regarding sex and suddenly he asked me if I masturbate...I said, ‘yes, I do!’ It was liberating for both of us ❤️", "thisisoya": "Love this homage! Please check your dm", "aahami": "Oh man do I feel this sis 🙌 The church uses shame as yet another way to control women’s bodies and it took me 22 years to see through it and forgive myself", "sierrawgarcia": "This is amazing! You are✨", "woley": "👏🏼", "stylesnatch": "The ability to be able to express yourself the way you do is such a gift Ericka. I salute your for the strength you keep pushing out. Queen 👑😍", "kelsey.early": "I grew up Christian and I would always “confess” that I masturbated at summer camps and church events. I felt such guilt and shame after every time. I even did a cardboard testimony and told thousands of people at choir performances that I struggled with masturbation. Now I look back and feel bad that I probably shamed others into thinking it was wrong. But I definitely enjoy it now and feel no shame.", "tylaacampbell": "Iconic", "alice.romanov": "masturbation is super important! and super normal 🙄 it's helped me unlearn shame around sex and female sexual liberation. a great message as always ❤️", "dreamondrifton": "I love that you address these “issues”- I’ve thought a lot on how does a society help to prevent cases of abuse ... well, encouraging healthy masturbation would be one way, and that includes education.", "sangeeters": "@bloodandglittereverywhere 🙌🏾🙌🏾🙌🏾", "sisebah": "@dawdab", "simply_crystaal": "I’ve had to unlearn the notion that pleasure is to be experienced “only for two people who are in love” - fuuuck that, my pleasure is mine alone and I can choose to share it or invite others in if/when I want, and I surely don’t have to be in love!", "theolivetreesandthemoon": "I wish I had seen this post when I was 11!❤️", "devonevansofficial": "This is an amazing post", "gosunnygo": "👏🏾👏🏾👏🏾👏🏾 love this post so much...free the black girl!", "mckennah": "Your skin looks amazing. You are glowing!", "jymmi_helix": "What scripture is that", "eternalegg": "This was pretty similar to my experience growing up and going to catholic school! I started as young as I can remember and was actually giving sex ed to my classmates in preschool, I got in so much trouble once for using the word “sex”. I literally had a rosary bracelet and would pray after every time, which sounds funny today but used to fill me with so much anxiety FOR YEARS because I thought I was born wrong and was going to hell. I found out much later that childhood masturbation is normal, I had no idea that babies masturbate in utero though! Unlearning that being in a relationship doesn’t mean having the rights to your body revoked was also a big one for me, and I probably could’ve avoided some trauma if someone had told me that earlier. Sex ed is too important! We have to stop separating sex from the rest of our lives and pretending that children aren’t sexual beings in some capacity who need to learn boundaries and self acceptance too. Nobody is talking about this. Thank you! 💖", "ms.shadymcgrady": "I got caught in my private time with a huge bear I had and the next day my bear was gone. I had to be more discreet. No one was around to have a conversation with me but then again they probably would have just shamed me.", "jocemite": "I’ve had to unlearn that after trauma, my body still deserves love without any self-shame", "caro_laaaaa": "This is so powerful ❤️ thank you for sharing that!", "kenyattaloves": "🖤🖤🖤", "dfields1": "THIS!! thank you thank you", "common_earth": "this is EVERYTHING i needed to hear when i was 12. (technically earlier, but middle school was when i started to feel all the shame.) thank you for this message!", "hood_montessorian": "I remember being on a camping trip with mostly black and brown youth when I was in high school. We were playing truth are dare and a Latinx girl was asked if she masturbates. She proudly said yes and we all giggled. She said something really profound after we burst in laughter that shit us up. She showed me her bravery to speak up for the ways in which she pleases oneself. I always thought she was dope as shit for that.", "maestra_silvestre": "Yup I prayed for forgiveness each time 😭 felt this. I used to pray and promise I would stop masturbating in exchange for my leg injury to be healed. 😩", "kerialison": "You are incredible. 💥", "julieta_salgado": "YESS YESS YES OMG YESSSS 😵", "sarahkscoular": "😍😍😍", "landofthelivin": "Literally learned the same exact thing. “Masturbating was gross” “Ew why would you masturbate” and whenever the topic would be brought up, people would talk so much crap about it. Until middle school into high school I found some amazing sisters (who I’m still friends with now) that were so comfortable with talking about it. Eventually just started to embrace that shit and say fuck it 🥰", "skyisfly": "I went to catholic school my whole life. It takes years to unlearn the feeling of guilt religion puts on us. Thanks for sharing your experience", "justsheherhers": "🖤🖤🖤", "schmisschmina": "There’s a part of me that believes people, especially women, are more easily manipulated in relationships because they don’t learn about and experiment with masturbation the way boys typically do, so when they experience that pleasure for the first time, at the hands of another, they associate those feelings with that person and not the act. I think that if girls were in control of their own pleasure, they would be less likely to stay in the toxic relationships that so many experience in their lives. I could be totally off base, but it seems like a common thread among women I know.", "joydivisionmackie": "I'm definitely still carry the shame, but I'm trying to better for my child's sake.", "brownboyglow": "Queen 👑 👏🏽👑👏🏽", "new.account.who.r.u": "I LOVE TO TALK ABOUT SEX. ♥️", "hardcore.casual.gamer": "Thank you for doing such necessary and powerful work. ❤ Those kids learned something very valuable that they probably would have never heard from another adult.", "aprildawnreigart": "Yesss! Channeling Grace Jones! 🙌🏾", "ignantintellectual": "Yes, Bih!!", "thisiscmartin": "That a partner masturbating does not mean they are dissatisfied with me as a sexual partner.", "raeleighmae_": "you are such an inspiration and , as a young person that has followed this account throughout several years i have learned so much. the conversation of sex (masturbation is never even spoken of) is such an issue throughout our school because adults don’t want to talk about it. some students, including myself, are trying their best to start the conversation and better the curricular but it is so hard. so many of my classmates are tragically ignorant to the subject bc of the curricular and i wish we had someone like you to talk to not only our students but the teachers as well. thank you for doing what you do, it’s incredible 😌", "groupe_de_femmes": "😍", "paphi0": "When I was at school it was just the reverse: everyone would tell they did, although you could read in their faces that some of them clearly did not, and some didn’t even know exactly what the talk was about.", "ca.rolannie": "Idk why, but my extremely conservative grandma told me and my cousin \"don't let anyone else touch you before your married, but this is my boob and I can touch it if I want to\" 😂 idk how she was half right/half wrong but there was never another conversation about it so I never had that stigma.", "empatts": "@isascribla", "hotdogbooty3000": "💕", "m_a_mcdonald": "Catholic guilt around masturbation was real. At one point I convinced myself my religious themed nightmares were because I masturbated and enjoyed it. Without Catholicism it still took a few years to stop feeling the shame after it. But eventually thanks to Tumblr, Scarleteen and pages like yours i don’t feel any type of shame masturbating even happily married to my partner. In Ontario Canada students have been fighting back and protesting against the regression of the sexuality education programming with success. They wanted to revert to the 1997 curriculum which doesn’t address consent let alone LGBTQIA2 relationships.", "courtney.has.words": "So powerful and important! Thank you!💖", "melanatedmamaof5": "As a mother of 5 I kind of stopped. I literally just yesterday had myself a session and realized I am still a very sexual person. But sometimes I just have to cut out that time for me. It was really good! And then when my husband came home we had even more amazing sex and now I will probably go home and do it again! 😁 (say all that to say I am slowly relearning to love my body and my sexuality again..my libido dipped every time I had a baby.)", "kapstigram": "@alicetomefernandez stunning", "collitosway": "I am so thankful for you! Such an important topic. Thank you thank you!", "iflooks.couldkill": "@talking.with.talya", "frequincys": "That you should not talk about it or do it.", "rachfactor": "This really needs to be talked about in elementary schools. I wish I had done that more when I worked in them.", "lexiccarson": "Your Instagram is such a safe place for all of the shame we’re asked to carry for being human. Thank you.", "fauren": "OH WOW this is a fucking brilliant image/homage 😍 I think the hardest thing for me has been that it’s not just unlearning the stigma put on masturbation specifically, but also unlearning the other myriad ways I’ve negatively internalized the mismatch between my body and what I’ve been told is “ideal.” I would look at myself and only see the so-called flaws. I wasn’t attracted to myself, and I didn’t believe my body deserved love, even (or maybe especially) self-love.", "viajeraaa_": "I love this 🔥❤️ you keeping it 💯. That’s dope. Continue to spread the body positive and sexual positivity!", "emilymahiai": "Thank you thank you thank you for this. 😭♥️", "jackn4pix": "I had to unlearn that it was only fingers or dildo. That the showerhead counts. 😍 That a beeper on vibrate in your pocket counts. 😍 That someone else's fingers count. 😍 That EV.ER.Y.ONE does it. 😍 That it doesn't mean you are wrong, dirty, hyper sexualized, nasty, vulgar, inappropriate or shameful.", "jessdoeswellness": "So much unpacking, so much unlearning, & yet also so much validation for putting thoughts that I had long hidden away into words. I thank you so much.", "cathydinas": "wahhhhhhhh! I cant even right now. You are beautiful 😩🙌🏾❤️✨", "naynay_bunz": "💙💙💙", "bhawksnipes": "OBSESSED 🙌🏾❤️✨ thank you for making me feel more comfortable talking about sex with strangers.", "runtimecomplexity": "I taught kindergarten in Thailand for a while and young kids (3-4yrs) masturbate during nap time! Never stop them! 👏🤘 Also I didn't masturbate until my mid twenties (#trauma) but it's awesome! And this picture of you is awesome!!!!!", "sydniem": "Everything you mentioned here is my song in a different key. I remember my mom telling me that masterbation was wrong but she wouldn't tell me why. It's only been in the last year that I realized a lot of the internalized hatred I have for my body is transferred from my mom hating her body. She's hypercritical of herself and I have been that way to myself as well until recent years It's been an emotional year and it hasn't even been a year. Also, come through Grace Jones tribute!", "ashmarie2112": "How to talk to parents to help normalize it for them. As a professional I know it’s normal but parents freak the f out! If they soak in any message from me I hope it’s at least to cut out the shaming. Just because you don’t understand it doesn’t mean it’s wrong.", "bwatfit": "#MagicWand", "jmariegray": "You're an angel. Also, can't wait to try your brow pencil bc of that good good Sephora sale!!", "americahatesus": "This is soooo🔥", "carson0gen": "Love this. In my middle school abstinence-only sex ed class, the teacher told us to cross out the word “masturbation” in our workbooks because the county said that she wasn’t allowed to say it or teach about it.", "mollizzle12": "Thank you thank you for this post!!! I recently started opening up about my experience (especially with the @pen15show episode on masturbation). I too was ashamed for what I \"discovered\" and wrote myself letters promising that it was the last time, each time. My mother since a young age always said, \"now don't touch down there at all!!\" It took a friend bringing me to a sex toy party in college and convincing me to get my first dildo to understand, \"oh wait, this is actually an okay thing to do. It is my right to do since it is my body!\" ❤️", "sassyblackcat": "Wow. You are amazing", "mortilfjell": "I feel so much of this caption personally!", "haigesallock": "You are amazing.", "twig__________": "@a_stock_boy", "theweeniewaggin": "@linseedoilz", "agreenhouseghost": "When I was 13 or 14, our youth pastor told us we had to fight the urge and not masturbate (or have sex!). I would suffer for months trying not to masturbate. Once I would inevitably do it, I would feel such shame and remorse. I am STILL trying to unlearn these behaviors at almost 27 years old", "kieranblake": "Thank you.", "large_dj": "I love your comment about having pleasure in a relationship. A lot of people do think that way, that to masturbate when I’m in a relationship is almost like cheating and disrespectful. Thank you for your work.", "julia_montminy1": "Thanks so much for sharing this Ericka!", "kolemae": "I have caught every single one of my kindergarten students with hands or looking down their pants in class. It's so normal!* I wish I could shake that into the heads of all the kids, teens, and adults who haven't learned any better. The stigma around masturbation is thicker than my largest dildo. *Normal to be curious and explore your body, at any age! But please not in class 😂", "baddiehoodwytch": "🔥🔥🔥", "grumpyrat_": "Beautiful!!!", "ayasiat": "I’m still too ashamed of myself and the idea of my own sexuality to masturbate, at 25 yo. I almost never do and when I do I immediately feel disgusted with myself, and I was raised in a very non religious « hippie » family", "j.mkey": "You always have the best post! LOVE! ❤️", "bw_faulkner": "How to hold back the initial reactions of negativity/ nervousness/shame surrounding the topic with my son now. It’s been my vow to not pass on the rigid, hateful and harmful way I was taught and (more harmfully) not taught about sexuality. Unlearning that it’s only experienced by those sexually active and adults. This has been one of my biggest fears and struggles parenting. But when you know better you do better!", "boyimhighmove": "Wow, I'm so blessed for this to be the first image I see today ❤️✨", "jeniaron": "You are so healing 🙏🏼❤️", "deborah_arndt": "I never masturbated until someone else touched my vagina. Then I was like well, if he can do it, I can do it. Never looked back 😂❤️", "gingerkidasaurus": "I also used to pray for forgiveness afterwords. I hit puberty super young and their was so much shame and isolation being 9 and horny", "ifurie": "Yesssss omg this image is...✨🔥💕 Had to learn that masturbation doesn't mean my partner isn't enough and that I don't need to hide it from them. And also had to learn that masturbation isn't less than sex. As in penetrative sex with a partner or with yourself is the only right way to have sex. Am I making sense? 😬💩", "verovivaldi9": "@malenacasto q", "charliepeet_": "That it wasn’t dirty!", "sexi.couture": "FUCK YESSS", "_geralartist_": "Masturbation is great prayer.", "afrosemary": "YES", "un_becomingme": "I have unlearned all the shame and “sinfulness” my mom put on masturbation. ❤️ Thanks for being bold and loud and brave- you have helped me so much in my unlearning journey", "czastar621": "@peteholmes", "kathleen.l.c": "Perfect placement/drop of the fun fact 👏", "assatataughtme47": "That it requires porn to do it. FALSE. 👏🏿💚🙌🏿🔥", "destiny_laurice": "Royalty 🙏🏾😭💕"}