{"wakeupandapologize2019": "@ihartericka Very similar - however, I want to address what you were saying about Black women being considered strong -ALWAYS - there used to be a show on BET (I think) called 'The RunDown with Robin Thede (which coincidentally is no longer on air and this show was the BOMB! it spoke of all types of racial things in a humorous but informative way) - Robin conducted a survey with all people of color, like the white doll/black doll study done with children in the '50's -- the topic was which group of ppl could endure the most pain and two pictures were held up - one picture with black person/ppl and one picture with white person/ppl. Most, if not all people chose the Black people to be able to endure pain most, in fact, many doctors do not prescribe the correct pain management to people of color because they 'feel' or 'believe' that Black people have a higher tolerance of pain than their white counterparts. You can find 'The RunDown with Robin Thede' on YouTube if you have not already been introduced to the show. I believe you will love the information that's conveyed.", "naenadine": "I think I can help some white people get this, maybe. I am white and when I was younger I had my hair every color in the rainbow. I have shaved parts of it, and created many hairstyles that literally included Elmer’s glue gel and hours of work to pull off...some very unusual creative things to say the least. People did act like I was from a different planet most of the time, grabbing my hair and making a scene and asking for pictures. It was annoying and I thought they were stupid. Pink hair feels the same as brown hair (and even if it doesn’t WHY are you touching me?!) and I know they have heard of hairspray, so I didn’t get what was happening. None of them were asking questions because they were really about to go do their hair the same way, they were just amused, the way they would be if they saw a circus clown at the grocery store, and they engaged with me to further amuse themselves. Imagine being an average person who does their hair in a usual way and isn’t out here trying to create a masterpiece to be judged everyday but just exist and navigate your day like anyone else, and you get treated that way. That is what happens to black people. A lot. I could stop doing my hair that way and the idiots disappeared. Black people cannot do anything to avoid it, and it’s exhausting.", "our.fam.bam.spam": "This has been confronting for me to read, because I think I do this!! Wow!! Thank you for sharing your experience. I will do better.", "andreak1281": "I get the “girl you got this soooo fucking much” I’m like no I really don’t stop saying I got this!!!! Who gets this one: “ you smell good”? Like bitch! Why are you surprised!?! Every 👏 freaking 👏 day... DANG!!!!", "jesse_lobue": "I love what you have to say.. thank you sistah 🙏", "mcnay.miller": "@itss.char_", "jbrar97": "🔥🔥🔥", "mark.r.sorrells": "♥️", "chocolatebarbri": "The thing that irritates me is it’s as if WW think I *need* their stamp of approval or compliment. I’m very comfortable in my skin. I’m always like bitch I know I’m fine AF, so move along. 🤷🏾‍♀️ It’s like this projection of their feelings- like they know they crave and live for external validation and they are insecure, so I must be the same, too. Nope. Keep it.", "dontstartwithmehugo": "Anybody care to explain how COMPLIMENTS are racist? I’m genuinely curious.", "anne.phetamine": "😭", "maruskaalbertazzi": "I have to say, Yellow looks good only on black or really tanned skin. Tweety effect is round the corner.", "juamoedo": "@thainara.saiane amiga da uma lida", "niecyblues": "yes yes yes i have. thank you for speaking on this in a way that i couldn’t quite put into words as eloquently as you have.", "crystalalexis_1019": "Sooo sexy😍", "itsleannespiegle": "So we are not allowed to compliment you guys?????? Damn .. like it’s called being friendly doesn’t matter what color you are", "surfbride": "😭", "yeza_be": "caption is🤯", "jakeraught": "Shut the fuck up 🤢", "keyairakelly": "I was recently telling my friends how awkward it is that dark skin women are seen as “art” but not human", "tutuwho": "I almost died from an infection in college because the doctor I went to told me, \"You're fine, just get some DayQuil.\" A week later, my tonsils are so inflamed that they were blocking my airway.", "luciagoode": "Always a great thread. I haven't had this exact experience. ... largely because my gear is WEAK. I did have a white woman tell me that she didn't like how my hair was style. My response: My opinion is the only one that matters. ...but last night while out with my ladies, we all pointed out that that \"we\" (inclusive of all who identify) are the only group that has the title \"Strong Black Woman\". ...and many self identify as such.", "joyeux_noel03": "@michael_espinoza1990 read the first set of comments and discussion", "jtumbles": "@ashhh_taylor", "sisterhoodculture": "This FEMICIDE SURVIVOR, activist, Inspirational speaker, Sisterhood specialist IS LOOKING FOR ALLIES. Show some luv 👭🏾 SUPPORT AND FOLLOW!", "zelmathomasdixon": "Thank you for sharing.. there are so many things I’ve thought we’re loving and positive and I’m realizing how fucked up it was. I realize this page is not for me to speak to however I’m especially grateful that you share your reality.", "plus_garum_ferre": "Yes. And it took me awhile to understand why I was so annoyed by “compliments.”", "thestarsinger": "And since when did strong mean you dont feel pain or sadness? I like many BW be on the verge of a breakdown, here people with that “strong” shit.", "hiitsmik": "Yassss! Especially when it comes to my hair 🤦🏽‍♀️", "9sirenscreative": "While I can't relate to this exact experience I can see similarities in my experience as a single mother. People would praise me for being strong and would compliment my success without recognizing fully the immense amount of difficulty I was under trying to be a single mom after moving across the country to a new place with no friends or resources. I was grieving while raising a one year old without any emotional support. People in my church praised me but also were wary of me and unsure of how to hold conversations outside of talking about how strong of a woman I was. Again, not the same experience but your words resonate with me. The difference is that my being a single mom isn't something everyone can see and romanticize at all times. This post has definitely left me with a lot to think about.", "mindfulnessmeghan": "WOW what a powerful post !!", "_doc_mom_t": "bell hooks 👏🏽", "jackn4pix": "I have been labeled \"strong\" to the point of depression. I gave no energy to my feelings- no recognition, no healing, no space. Abusive relationship? Go to work, pay the bills, raise the kids, blah, blah, blah. My attendance was impeccable when I was being hit after hours. I told myself having muy hair set on fire (twice in one night) was no reason I couldn't trim it and be to work on time. What was wrong with me for complaining when nny kids were healthy, fridge full, bosses loved me and bills paid. My initialization of \"I'm not weak\" almost cost me my life. So yeah, when non-blacks applauded the \"black woman strength\" I both grinned and grimaced. I use to wish I was white so somebody might consider helping me. My ex expected physical labor (grab groceries, take trash, help change tire) to his same level of his output because of my strength. COUNTLESS white women in grocery stores have asked me, and subsequently my children, to reach items on an inconvenient shelf. At the library my kids are my own, but the white woman with equal number of kids (and much less control) has two staff members entertaining her children. It's everywhere. 😔 Thank you for this (and many) therapy sessions. 🖤", "authenkitticity": "Recently I had a very real moment where I had to reflect on my own anti-blackness, still working through it. Still trying to do my best for the past, present and future. But man ... It's some shit.", "astoldbytsige": "A WORD 💙👏🏾🔥", "hopperbee": "This happened to me when I gave birth to my child 6 months ago. A white, male doctor proceeded to attempt my epidural twice, digging around in my spine for what felt like ages while I was fighting to keep still through contractions, before calling in his colleague who administered the third epidural flawlessly. I can still hear him saying, “You are so strong, you’re a champ right?” while I was terrified, in pain, and afraid to move for fear of being paralyzed. Before his second attempt, he even told me that he usually gives 10 star epidurals, but mine would like be an 8. I most definitely have nerve damage now and chronic backaches daily. I couldn’t help but wonder if I was a White woman, would he have gambled so much?", "maddymazestudio": "Yes! I took a very strong antibiotic over a month ago and now have tendinitis which is extremely painful. My doctor said it will take time to heal, but gave no instructions. Well, I’ve been been “healing” myself for years and am in search of a orthopedic surgeon myself. I did ask for a referral but was told...” no, you don’t want more pills”...what?! I do speak up and was only seeing this particular doctor for a refill, so I wasn’t holding my breath cause that’s their MO. I am diligent and I fight for myself and my family. It’s a shame it’s a fight at all. With insurance with the doctors and staff to get good comprehensive care for all of us. I have whyte coworkers who see the same person and don’t report the same struggles with the same practitioner....soooo there’s my proof.", "tramalamazing": "I want to shout \"Stop complimenting my black skin. Stop acting shocked when you hear I have three kids. Stop telling me I look 18 (I don't). Stop telling me about your black friend that is too afraid to wear their curls. Just. Stop. Please.\"", "ruthlesslove88": "So late to this convo but yes of course. I love wearing my floor length jacket by Mike Sylla around because it satisfies my need to be dressed to the nines and also has a gorgeous depiction of a black child on the back of it soaked in blood red paint. So uhhh, that nips the fake ass compliments in the bud and keeps them in check behind my back. Literally.", "tiffanyprovenzano": "I’m struck by how many people complimented your (cute but very basic) shoes at the predominantly white (and passing) staffed wedding shops 🧐, but no one mentioned them at the predominantly black staffed Anya Bridal. Keeps reaffirming that we made the right choice for purchase, but I should have done more to acknowledge the absurdity of it all and your feelings towards the constant “praise”. Like chill ladies, they’re yellow slip ons, leave my friend alone, your compliments don’t prove that you aren’t racist 😂😂", "justnettles": "Yes constantly it's always \"you're so strong\" \"oh I love how colorful you are\" (I wear a lot african print and bright colors) I express my hurt or discomfort and somehow they center themselves and are now using me for emotional labor", "smolthyme": "Yes to all of this...and I’m sad/mad bc I’ve internalized this narrative too, so I don’t even give myself the space to be human all the time. Thank u for also calling out that “strength” is an easy way to pretend that one isn’t complicit in violence, & the very idea exists to allow that pretending.", "donedwards5295": "look so good", "new.account.who.r.u": "My head is swimming :(", "queer_uterine_mechanics": "All of this!!! I also view the compliments about looking young for my age in the same way. All that ‘black don’t crack’ nonsense is as harmful as the ‘strong black womxn/person’ myth imo. It’s about a white supremacist and patriarchal view of ageing, erasure of our lived reality and enforces white womxn’s fragility. Can we stop using these phrases. They are not compliments🙄", "itinago": "Yup. T'is so😕", "haneenbear91": "@libbyxxo2 x", "klavecito": "Thank you", "iam_2lebritt2quit": "They compliment my hair when slicked back, side to the left, side to the right, to the front. Heaven forbid I faux hawk my pixie haircut ever! If you're that enamored with it, give my locks the Nobel Prize #notbutreallyIamnotmyhair #justdeadcellsfolks #drseusshairproblems", "elenagoldenbow": "So many of your posts make me say “hold up, I do that.” I’m glad you’re here and showing your perspective and insights and helping people like me learn.", "alto_acumulus": "I’ve noticed (in various other circumstances) that people tend to say ‘woow!! X is soo strong’ in situations when there are no other options apart from this ‘strength’. One doesnt usually to decide to either jump out of a window or just deal with whatever is happening, which then renders the phrase useless. It becomes a ‘nice’ way of acknowledging someones existence. So its very interesting reading your own understanding and experiences regarding it! Thanks :)", "bedroombouncer": "I am now in my second year of figuring this complimenting Shit out. I asked my husband two years ago to stop complimenting me about how I look or how I'm dressed. I know it seams well intended but I always felt that's it's like a power play where I need to be grateful and thankful that someone noticed me or what I'm wearing. Another problematic factor was that sometimes I've felt most comfortable and beautiful and confident wearing regular home clothes, hoodie and trainers and joggers but then got sad when no one said anything about my looks and that's when I decided that others won't have control over how I feel about myself. So now people who are close to me know not to say anything and when strangers say something like \"love yr bag, it's so cool\" I just say \"good for you\". I also love seeing people's face twitch when they say \"that's a beautiful dress\" and instead of being \"grateful\" and \"small\" I just say \"I know\". 😁 Love you and what you do 🙋", "alathariel": "So from all this (about “compliments, not power), what I gather, is it’s the fucking same as men taking up women’s space in public, mayyyybe without the sexual part of it, but certainly with the added bonus of fetishization, othering, and a whole host of other things I can’t understand. How many times did you (all) have to say it before it got into my dumb white head? I really really appreciate your explanation. I was already gonna listen to you (and the millions of comments) of course but now I really get it. Like I think I get it in a way that’s I can explain it to other white people and have them get it? I hope. So I hope they will direct their “but it’s just a compliment!” questions at me instead of you now! Thank you, Ericka!", "jazzyfaye.24": "Yes, just finished visiting Baltimore/DC/NYC and had something to this degree happen. I even had black men who were calling me white because I didn't give them my attention.", "blk.theo.logy": "It took me a hot minute to fully process this bc I had to rethink so many things. In general, because of the PWI bubble I live in, I get these all of the time and I brush it off automatically except for this once instance the other day. I “technically” attend an all girls PWI (they haven’t updated their policy to include trans students but I’m trying to change that before I graduate this year) so most of my exposure to this has been w cishet white women of power. I went to a choir rehearsal that was with our brother school (technically an all-boys school across campus) and this white kid that I’ve talked to maybe once or twice just goes “wow I’ve never seen you in shorts.” I couldn’t figure out why in the moment but I was immediately uncomfortable, took a step back, and told him that it makes sense because we’ve only talked in group situations and he’s never seen me in the spring/summer. I left the conversation right after and went to go find my black friends in the room bc I know they provide a safe environment for me. This whole message pinpoints that feeling for me and as a black woman, it hits home.", "alexfisherr_": "I am a big complimenter and this has given me a lot to think about! Damn.", "kiskmw": "I want to save this post!!!!?!", "uncle_quincy": "Wow", "jodi_galvano": "A few months ago you touched upon this when you had a similar experience in a plant store in AZ and you Eb discussed it and I listened. Last night I was out in New Orleans and so noticed there was a group of women of color looking clearly uncomfortable and I as I was looking for my id I kept noticing they were staring at this very clearly mentally ill white man and he was staring at them and you knew he was being gross and creepy. I told the ladies hey so you know that guy is being gross and staring at you and they said to me (what the fuck) oh yeah he’s been following us the whole of Bourbon Street. So you’re telling me hundreds of people watched this happen and we’re just cool with it? That’s when I really saw the practice to what you preach. Black women are constantly being silenced, and it’s more the time that white folks use that whiteness to make noise and say hey you creepy dude I see you leave them alone.", "juliawhitten": "whoa. thank you 🙌🏻", "iamevolvingwoman": "Ugh, yes. A co-worker over compliments me on outfits every single day. I thought to myself, “why am I agitated with her because of this?” You helped clarify for me what is going on and gave insight as to why it irks me!", "earthtojordi": "Feeling like a damn unicorn everyday!!! You do not have to touch the hem of my garment to get this black magic, but you will probably get an ancestor on that ass with them dirty Vienna sausage fingers! 👏🏾👏🏾👏🏾", "straightgrizly": "I could never put to words why I was so irritated when white women would compliment me; it’s a compliment right?? But this is validating as fuck. Thank you.", "theholliebobollie": "Most helpful for me to not toss “compliments” like this and/or cry my tender white tears, etc has been this analogy: if some cis dude walked up to me and said the same thing about my appearance/said creepy “positive” things about women, TRIED TO TOUCH ME etc, would I thank him? Or back away and tell him to fuck off? Viola. How I feel about those objectifying experiences from men is the closest I will get to understanding how POC feel about whites saying and doing offensive things under the guise of good intentions. White ladies specifically, ask yourselves before you speak: if a strange man came up to you and said the same thing you’re thinking about saying to a WOC, would you be 100% okay with it? If he touched your hair, jewelry, or clothes would you be okay with it? My guess is at the very least you’d be creeped out and wonder what his motives were. Check yourself. I realize this is over simplification but I hope it helps some people gain needed perspective.", "1.abimbola_ezekwesili": "dont show your boobs! its a order", "studiooudizo": "\"who wants to fuck god\" right in the chest!", "maryamajayi": "💯💯💯💯 Recently experienced this in a violent work environment and was repeatedly told “but you’re so strong—you can handle it!” Da actual fuck? I also see these “compliments” as also a shock—like WOW aren’t you pretty and well put together got a black woman...", "ciaratoga": "Oh girl. You know ☁️", "royaleobsidian": "@ihartericka specifically requested that only black folx participate in this thread. Why is that so hard to respect? If you’re whyte and feel defensive maybe stop asking black women to perform emotional labour for you and figure out why you are internalizing this thread!!!", "caraelisetaylorr": "Constantly. Whenever I talk to people about desirability, and how black women are least likely to find matches on dating apps and irl — they always say “that’s crazy black women are so gorgeous” “you’re queens!” “God made you in her image!” “I wish I looked like you!” (The one I hate the most) and then I have to tell them that at the end of the day it doesn’t mean much to spout compliments at us if you’re not actually interested in pursuing an intimate relationship with us because we’re “not your type”. And it isn’t productive for them to tell us we’re the best at overcoming adversity while actively contributing to that adversity. Ugh. I could talk about this forever. Thank you 🙏🏾", "reneeannac": "@mooncheyenne powerful", "dabrownsugasexdoc": "as always, i so appreciate you, your labor & truth telling. 💜", "kenziewiththekurls": "Okay I can defs say I’ve had this experience with my hair and Cobys hair being called “so crazy and cute and fluffy” @boofreaky or just your hair getting a compliment and them looking over at me like “oh and your hair is pretty too” 😭😭😭", "where.theres.smoak": "I do another version of this where I say way too many thank-yous than necessary to a black person who has helped me out. And I just realized it because of this post. 🤦", "jewishamericanprincesa": "@offdutymallcop this is important for us", "kayla_is_my_username": "Also to your question, yes. I’ve had white women come up to me and call my fro “adorable” on my supposedly liberal college campus. I’ve also had white women praise me it seemed just to ease into asking about my hair. Actually had my mother’s coworker, who I knew since childhood, asked me if my Senegalese twists were real and then if she could touch then. Not surprisingly, but hurtful to realize the white people who played a role in my formative years (prominent roles or small & barely relevant roles) don’t claim me at all? Don’t view me as a person after literally watching me come into my personhood? ... The fact that white women ad lib on black lives all time makes their complaints white men annoying. They depict white men as these omnipresent, omnipotent MEN, and it’s always about the manhood but they just don’t contend with the white aspect of that manhood. Roll right over it and into white feminist rantings... But it’s also interesting because that happens in the black community too. When we feel oppressed in some way we roll right over the multiply-marginalized people in our presence. E.g. light-skinned black women don’t address our privilege over dark-skinned black women, we fixate on a generic black womanhood. Heterosexual black people roll over the experiences of LGBTQ+ black people. Like being gay and black is the same as being straight and black...", "theeyjayy": "you put a lot of words to things i’ve been observing in myself and other white people and unable to pinpoint what was happening. ty for sharing", "brittany.johnson001": "Yes I have had this experience. Fucking speak it !!!! 🙌🏿👏🏿", "darcie_rose_photography": "🙌", "chelleorc": "So much labor dropped in this post. #payher", "coraglitzer": "Thank you all for sharing and educating ❤️👏", "unlrnprjct": "All. The. Time. Thanks for this 🖤🖤✊🏽", "smiling_maama": "😭😭😭🙌🏽♥️", "rubybijoux": "I have definitely been guilty of this 🤦🏼‍♀️. I was vaguely aware of what I was doing. Upon reflection, I was trying to indicate or perform as non-threatening and an ally. Thank you, I will do better.", "prajbot4": "🙌🏾🙏", "loveinterpreted": "I find black women to be noteworthy beautiful, as in hold on a minute I need to say it out loud beautiful. Their complexion is usually flawless, baby smooth absolutely no blemishes, some black women even have a natural highlighting to their faces where their complexion is lighter in all the perfect places without even needing makeup, the shape of their eyes and the fullness of their lips AND the curves... I often find myself complimenting black women on their outfits because what I really want to say is goddamn you are flawless but I get a side eye on that one as if what I am saying cannot possibly be genuine but it damn sure is! White skin shows every blemish, has moles and veins and redness, legs full of black dots one day after shaving, bruised up everytime my clumsy ass run into something- black skin shows no blemish, and it literally sparkles in the sunlight.... but I’m not gonna stop someone and say all that so I just say I like the outfit for example. I’m not speaking from an uncomfort, I’m speaking from an awe. And as for not being in the mood for a compliment or not wanting to talk to someone, that’s got nothing to do with race that’s your antisocial ass finding fault. Also, sincerely thank you for sharing this post and all of your posts to open conversations about race.", "beanepi": "YES. And the expectations from this in the workforce. Expecting black people to never be sick or tired or visibly see us as such and ignore it and think we're lazy. Overworking and underpaying the black people and letting white and other people go home early and getting their checks on time.", "justalyciah": "🙌🏾 A word let me check my life", "_zoe.c_": "Yep, had and still do. I had to end friendships with wwm, one in particular, who enjoyed saying that...it’s not a compliment, it’s a refusal to understand that shit is difficult and that shit affects me.", "mrsannablue": "As a white woman married to a black man and raising two amazing black girls, I thank you from the bottom of my heart for sharing things like this. And for all of you commenting and sharing your experiences, thank you. These are the lessons I need to learn and internalize. These aren’t my experiences, and I am genuinely sorry that they’re yours. I understand that the world I walk around in is different for me, and I also understand that I DON’T understand what it feels like to be you. I won’t ever understand. But I need fo hear it and own it and sit with it and learn it, so I can do the best I can for my girls and all of the Black and Brown women I know, love, encounter or stand next to. So please know I’m grateful.", "chad.not.chad": "thank you for sharing your experience, this post brings up a lot for my own self reflection. @k8dooley !", "sierramay_tinuviel": "Definitely gotta re-examine my mindset on this. While I would 100% never ever touch a stranger (that is so creepy jesus), I had been wanting to give more compliments to women, since I always feel good when another woman gives me a genuine compliment. Brightens my day. I wanted to give more compliments to make other women feel good too but I definitely don't want to be making anyone uncomfortable. Thank you for sharing.", "papillon.visions": "Living this on EVERY level possible:physically, emotionally, spiritually...psychologically...politically...economically....ALL THROUGHOUT MY ENTIRE BEING!✊🏾💕", "chickensrbirds": "Well... there’s all of that plus you look amazing - your vibration travels through space/time & you’re fine", "yogakeynyc": "This is giving me something to think about. I dont mind genuine compliments but I do check anyone whose compliment feels creepy or fetishistic.", "kartaykel": "Powerful", "marglaza": "I am increasingly angry and anxious with my climate at work due to a high level of dog whistle racism and passive aggressive behavior. It works to make me feel little and incompetent but also hyper visible and exocitized. Im def not just regular schmegular which would sometimes be all I wish", "samantharise": "Heard, so deeply. Was asks to speak in a discussion on vulnerability, and responded saying white women need to move up and reject the urge to fetishize black resilience, because “grit” and “hustle” and “strong Black Woman” vibes are literally killing us. That vulnerability is brittle beneficiaries of white supremacy culture learning how to absorb and metabolize criticism, to accept the velocity of impact, rather than remaining comfortable (in the paralysis and frailty of adjacencies to power), remarking on the ‘strength’ of women of color. We would not have to be so strong if white women would get off your duffs and stop deflecting responsibility. So prevalent in spiritual bypassing in white wellness.", "promisedlywild": "❤️", "pearlzorn": "@k80hansen", "groovn_roni": "@ihartericka I had a situation like that happen yesterday at work. I was running around helping our customers and a white lady askes me if i would get her a fitting room and I did. Then she requested to move down further so that her boyfriend could be close to see her with the outfits on. I moved her down and was about to close her curtain and she yells out LOUD \"oh my gosh you're so pretty, like so beautiful. You're hair is so curly...is it yours?...you should be a model, like your eye shadow is on point, your skin is smooth...oh and you dont need to fix your teeth (i have a gap 😑). You should be Americas Next Top Model....\" I quickly stoppes her and told her I've tried out for Americans Next Top Model and it was here in Dallas. She then questions me about when it was and where 👀👀👀..... To cut it short, she basically told me she was shopping for all the cheapest shit and to show her. I politely pointed at clearance in the back and told her to have a good day. So I thought it was a nice compliment in the beginning BUT how she kept going and being loud and telling me I dont have to fix my teeth....made me highly uncomfortable and what's not fair is that I couldnt walk away or ignore her cause it would've seemed like I just gave horrible customer service. So yea shit like that sucks", "sacredblooming": "after spending 2 months looking for an external consultant to lead a diversity training at my small white organization, the founder just turns to me and says \"i'm not comfortable with an outside person judging us. Can't YOU (only black person at the org) just do it? we won't even have to pay you! hahah\" bishhhhhh. i shut that shit down quick and we still haven't had the training 😩 shits exhausting but i refuse to do any labor of any kind for free. you beta pay. me. ho.", "southern_northern_belle": "All. The. Time!!", "curlykimmystar": "I almost never got compliments on my hair when it was relaxed or flat ironed straight. But when I went natural almost 10 years ago? I get them from mostly white people constantly! And if it’s super frizzy and big? More compliments from white folks. It never feels genuine. It feels othering, like, wow, your hair isn’t straight, it’s different than mine! Woooow!!! 😒", "elenalakay": "eF that “token black woman” ish right there! Let me tell you @ihartericka These days Im checking every woman (white and black) that comes at me with that, “you’re strong, you can handle it,” shit! You are strong you can take on more than you know. No! No I do not have to take on more! I do not have to kill myself slowly. I can have my boundaries, I can say no, without apology as a preface, without excuse or reason to follow! I hear that so many times while surviving my recent pregnancy... oh your pregnant, that’s how it goes, or one “uping” me with their story... how about, Ima be strong enough to check you! (venting like a MF) L O V E you! 👊🏽", "destiny_laurice": "It’s like the compliment is above and through you, not to you. It doesn’t feel good lol", "azhaayanna": "every friendship relationship airport school job interaction we deserve to be viewed as soft , vulnerable and experience a full range of emotions not your bionic black womxn !!! this shit is so frustrating", "whatsda_t_lc": "My partner and I always say that the compliments of white peoples mean nothing lol. It doesn’t really tell me whether I look good or not Bc they will compliment me when I have a plastic bag over my head.", "ct_jg": "“If black femmes are godlike, who wants to fuck god?” WOW", "_renalien": "Thank you for explaining these issues, I never would have known otherwise. I'm a very complimentary person to everyone around me, (exclusively for clothes and shoes though bc I know body compliments are often problematic) because I know I feel good when I get compliments. I'll definitely monitor myself on when/where/why I feel the need to compliment a person, like if it's genuine or bc I'm feeling uncomfortable. I know it's not for me but thanks again for sharing, I learn more and more with each of your posts.", "sunny_sonja": "👑👑", "manifestkitchen": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 thank you for articultlating what we go through often.", "thethomafam": "❤️❤️❤️❤️❤️❤️ @denatimes this is a great and eye opening read. @rooz739", "don_frankieperez": "@zarinah", "ali_the_mombian": "I’m mixed: black and white. I was told by my mother’s white clients, as a child, that I look “exotic”. As a kid and young adult I took this as a complement. Now I know these statements were made because white women were uncomfortable with the drops of black mixed in with my mother’s white purity.", "quarterlifecath": "@catherinegg", "dmitradawn": "I do human rights work. White folks write me and say ish like: I just want you to know that I stand with you as you fight. Here's the thing. I'm tired. I need to be at the goddamn spa. I don't wanna fight. You need to get off your ass and gather your people because I'm literally getting sick from the stress. You have written me and have literally isolated me further by continuing to center your own comfort and privilege as if this is all my job And I'm on my own. Shut the whole fck up. 🙄🙄🙄", "ambiespino": "Wow if I had a dollar for how many white girls compared their tan to my god given skin tone as if it’s a compliment I’d be hella rich", "messgeorgia": "If you don’t preach. I feel like sometimes, as a POC in a VERY white city, that white people go out of their way to be nice to me so they feel better about themselves.", "soulful.nutrition": "All 👏🏾 the 👏🏾 damn 👏🏾 time!!! Especially about my hair. If I didn’t love my damn self so much, I’d shave my head just to make it stop.", "ari_duhhs": "I was in this uber once with this girl and she proceeded to pull up that video of the little black girls dancing on their way to the pool. The song they were dancing to was on the radio and that’s why she showed me. I had to wonder “would she have showed me the video if I was a white girl?”. Worst part is that I knew she was genuine about showing me, but whew chile that’s not how you try to “relate” to black folks 😩😂", "crispy.wave": "@samssosmiley", "sonalmedia": "This isn’t the outfit from the story, huh? 😜😘☺️", "torchestogether_": "I feel this, experience this almost daily but not had it spoken into words before... it feels like my brain just collapsed in on itself.", "cocotough": "Thank you for this post.", "jilla_821": "Really feelin you on this one 💖✊🏾", "fem_noir": "The continuous “I know you got this!” rhetoric I’ve received over the years as a compliment has been crushing. Because high key NO I DONT/ DIDNT and it was just an excuse not to support me during times of need, or do even the minimum to empathize with my near constant anxiety of failure.", "the.a.league": "“Who wants to fuck God?” YO! This hit me hard.", "cwat13": "@mamacoco6", "lynsi711": "This is why I hate being called strong. God fucking bless you — I am so lucky to be following you. 🙌🏾", "taleof2cities": "What’s funny is I feel I am reminded of my strength by black ppl more than whites. However, this is not to take away from anyone else’s experience.", "mamacoco6": "Yes. If it is not our vernacular (Insert “Girl, yaaaasss!” “Right!” and any other Black Womynx check phrase) they are mesmerized by; it is our hair (whether texture, color and/or style); been magic before it became a hashtag and certainly know that how we move through pain becomes more like a case study than an acknowledgement to the f’ed up BS of trifling folk exercising unearned rights. So yes, tired and over it but, will continue to be a champion for change.", "worstwestern": "Wheeewwwwww this is hit me right in the center of my heart!!", "buhhreezayyy": "Folks consistently ask me why/when I’ll pursue my PhD. I’m scared. I grew exhausted of being told I’m strong so I can handle the amount of oppression & racism in higher education. It’s annoying & I’m over it.", "baby.daddy": "It’s a big reason why I spent years not wearing my natural curls - white women always went overboard complimenting my “Afro” 🙄", "skeeterrobinson": "🙋🏾🎯🎯🎯🎯✌🏾", "b00cocky": "Even though I think you made this story up to have something to complain about, IF it did actually happen, why can't you just accept a compliment, say thank you and carry on about your day? You're so fucking bitter. Not everyone is an angry, miserable bitch like you.", "summbody": "This! The \"strength\" - the making myself put up with a job that abused me, management that gaslighted me, a company that underpaid me while yt counterparts spun in their chairs & watched funny videos all day were paid more than me...I worked myself to the point of almost losing myself completely bc I was \"strong\". I am learning just how toxic that is. I can relate to so many of these stories. Particularly @afrobambino thank goodness you got out. I did as well.", "be_phx": "Why going to group therapy any furthe has been a “no”. Sitting there voicing my pain to have other clients and the clinicians dismiss my pain and “you’ll be ok, you’re strong” BITCH NO! I’m here for resources and support because I’m not and would like that to be validated. Smh. I feel that shit deeply.", "ashantidoll": "Yes to the compliments! But I take it as...white people truly dont have that much diversity where I live so if they see us standing out they compliment very hype as you described😅 I think it's a compliment to us. We stand out. We have a certain bit of individuality others dont as we all know. Yellow looks amazing on black and brown skin she could be in awe. Buuutt tthat doesnt mean that some arent just doing that all for attention. Especially the touching. Ugh hard to tell at times.", "cisboynooooooo": "Thank you for sharing how these interactions make you feel. Just on the thread of \"compliments\" and discomfort, I know that people like me who grow up in predominantly white communities don't always get this. It really is just manifestation of discomfort and a little hint of wanting to prove that discomfort wrong (which is still not the way to do it right)", "shey_dazzle": "Absolutely! And I’ve perpetuated it as well by regurgitating things like “you never know how strong you are until you have no other choice” Only Black women have never had a choice. We’re just expected to be Strong. And then white women idolizing the presumption of strength just to undercut with micro aggression. Currently they’re buying into our magic because it helps maintain their supremacy. If we are Godly they don’t have to view us as having real human emotion. They don’t have to acknowledge our humanity.", "6kween": "Ok this literally reminded me of when I wore a yellow dress to my bf’s dads wedding and everyone just HAD to comment how beautiful yellow is on black skin as if I didn’t know that 💀 someone literally said I looked like Venus Williams like you thought of the first dark skin women that came to mind?? I felt so uncomfortable and they really think that’s a compliment", "thehaleywebb\nVerified": "Verified", "taountay76": "My daughter was born 3 Months early...every single ww in the NICU assured me that she would be fine becuz \"black female preemies are the strongest of all the preemies born 😒....when I would hear it at first, it would calm me down...but once I really sat with it I realized that it wasn't meant to make me feel better, but it was to make me less diligent about her care...it was as if I shouldn't pay as much attention to what care she did or didn't get, her black skin was enough to pull her through...Just as soon as I could get her out of there I did...they thought my child was their newest science experiment...", "martahelmexists": "Yes", "breezebennett": "“Medical institutions think we are strong, too.” Soooo much to say on this...I bring my partner to every doctor’s appointment (even gynecological ones, which while, yes, he knows my vagina in and out, that ain’t exactly how I like them to spend quality time 🙄). I bring him bc I get treated with more respect (SOMETIMES) if my man is in the room with me. Otherwise I am rushed, dismissed, and disbelieved. And I’m often offered multiple prescriptions, but I’ve had a doctor outright argue with me about writing a note for me to miss 2 DAYS of work (a note I don’t need in my role, but I asked for bc I just like having documentation). Basically, “yeah, you’re sick as shit, and I just told you you’d still be contagious for a few days, but nonetheless, nigg*r, get back to work” was his BIG vibe. This was actually WITH my babe in the room w me: we went to the director of the urgent care who 🙌🏾🙌🏾🙌🏾 was a black woman 😇, and she made it clear that the doctor had MADE UP FAKE POLICIES to deny me that note...it was crazy. I ended up w a note for 5 days (bc the doc is petty so when she went to talk to him, that was his passive aggressive ass response: you just told me a policy prevented you from writing me out for more than 24 hours when i asked for 2 days, so now you mad and write me out for 5?! Ok. 😒 So yeah. That’s that on that.", "jahhajjah": "👏🏾👏🏾👏🏾 Since moving to a more predominantly white city (I'm from VA, moved to Denver), the gym I go to I like to go super late night because I dont want white women gawking at me in the locker room. In VA at the gym, I was surrounded by women of all shades, but a healthy dose of black and brown bodies. Whereas here in Denver, being stared at in everyday clothes is only mild compared to if I'm nude around people I dont know. Also, thank you for talking about desirability politics. Dating is tough on it's own, but when you're othered by race/class/sexuality the options are very limited.", "sfosm": "🖤🖤🖤 needed this.", "niaskindaneat": "I’ve noticed this the most as I’ve begun dating again. Like people wanna call me pretty on Tinder but refuse to continue on any deeper conversation, going on first dates but getting ghosted thereafter. Even seeing people celebrate folks like Lizzo on social media, but don’t have any black friends (let alone fat black femme friends). Like oh if I publicly compliment, recognize, or am seen with black women I can’t be racist. It’s white liberal clout to interact with black women even on the most surface level.", "uniqgrace": "ALL. THE. TIME.!!", "notsoobscure": "I mean!", "katy.d.harrison": "@em_scheiber", "j_a_zarifian": "Wow. This was eye opening. I compliment ANYONE who rocks their ensemble. But after reading this I will tone it back. I can’t help appreciating when people are put together, sharp, but knowing that might be perceived as something other than admiration? I’ll take it back several notches.", "mollie_lebel": "Thank you for this!", "chantalaclemis": "SAY IT AGAIN FOR THE HEADASSES IN THE BACK", "seeking.metanoia": "these experiences are so eye opening, im taking my time reading all of these comments and truly digesting the weight of our words, even if we think we aren't affecting someone. i love spreading positivity to others, so i frequently compliment others (mostly femme presenting) on things aside from their body or something beyond their control (i.e. 'i love those shoes! where did you get them?' or 'your necklace is beautiful') but i have never considered how these interactions can impact the other person involved. it's absolutely disgusting that somebody would feel entitled enough as to approach you and then TOUCH you without your permission. i can only imagine how invasive, infuriating, and uncomfortable that would be. i am continuously learning and growing, and all of your retellings of these experiences allow me the slightest insight as to what life in your shoes is like. thank you all for sharing your stories!! this post is truly reminding me how much introspection and self correction i need to do. here's to continuously growing!", "natalieatsplants": "@twinin_in_the_twincities", "mizzmock": "IF THIS AIN’T A LIVING WORDT. 👏🏾👏🏾👏🏾👏🏾", "wishcandy": "Any damn time I need to talk about illness, yt and nb folks need to reply with how strong I am. How admirable that is. “Stay strong!” But I need to privilege of not having to be. I’m crumbling inside, held together with tears and duct tape. I need help and support. Not oh wow you’re forever strong, and if you can do it while being that sick, I can too WOW! (Cuz if I fall, nobody I know can help hold me up.)", "_djbutter_": "Okay ik this has nothing to do with what I wear (my hair is a whoooole 'nother story) but it's when I'm speaking publicly (not with family) I'm speaking properly the shit white people fucking say \"oh my god you speak so well!\" like hearing that in whatever phrase they put it in it sounds like a damn insult like I'm sorry how am I supposed to speak Susan??", "nocturnalreignbow": "I remember having raggedy ass braids in my hair like 3 month old braids, ready to take them out kinda braids. But had white people complimenting me all day on how good they looked. So eager to touch them and ask me how long it took to get them. I’ve never seen another white women in my life compliment another white women on how beautiful her messy ass pony tail look😐", "the_melanin_mrs": "Yes at work. I hate hearing “ that looks good on you....” it’s the worst type of compliment. I actually perceive it as an insult. I, myself had to get out of that notion because I hated the way it came off when it was done to me. I wonder from time to time do ppl even realize telling someone that isn’t complimenting them, it’s actually furthering the mental effect white supremacy has on us. Thank you Ericka and Ebony once again, thank you.", "alexjf56": "Damn. Have not thought of this before. Now I’m trying to remember if I’ve ever done something like this, would I even realize it tho...", "kolbybrianne": "This reminded me of how much people robbed me of my vulnerability while going through the beginning of my divorce. Nothing made me feel smaller than being told how strong I was when I was drowning.", "cristalsharris": "That last line!!! “Black women are strong so white women can remain victims” LORD!", "amani_orr": "@_najha_", "mominatu": "WOW YES YES AND YES!", "awildflowersong": "My takeaway from this post is to do the internal work of checking motives before speaking. Any “compliment” given with the conscious or subconscious motive to validate oneself or be perceived as a certain kind of person isn’t a true compliment, it’s using someone. Of course we cannot with absolutely certainty judge the motives of others, but that is not an excuse not to face ourselves before speaking.", "chadrific": "I get nice compliments from white people who are honestly just giving me a compliment (mostly because i dress more fashionably than most people in my hometown) but I have definitely had the extremely invasive compliments given to me mostly by white men. like one dude chased me down in Target to tell me how good my legs looked and if I wanted to go out. UGH IT WAS SO CREEPY, I was just trying to buy lotion and some office supplies. But I do side eye people that say my name is pretty and don't know who Sade is", "jadetheshade": "Doing my hair is such a major selfcare thing, but the ANXIETY I get knowing I'm going to have to deal with all the white people in class/at work when i walk in, literally makes me feel like maybe I should keep an old style a little too long. It's overwhelming and completely dreadful.", "nataliejjames": "If you are interested in a historical account of Black mobility before the Civil War then def read ‘Colored Travelers’ by historian Elizabeth Stordeur Pryor", "azuleyada": "Absolutely something to think about. I definitely am a complimenter in general as it's my way to relate to people and make them comfortable, but I wonder if I don't over-do it to an inauthentic level when trying to make others comfortable as I project my own discomfort.", "theraeflower": "@courtastr0phe this reminds me of the forest walk the other day when the old women stopped us in the parking lot 😝", "cestlag": "This happened to my mom once {thin and light skinned} when I was younger and I couldnt figure out why she was so offended by the “compliment” but she was always vocally annoyed with how amazed the white women at my brothers’ private school were that she was “so thin after all those babies!” “And you look so young!” I remember being like “dang mommy, that’s not good?” And she was like “what they’re really saying is ‘aren’t you spose to be fat and haggard after all those kids? *we* {yt women} are the only ones who can have 3+ kids and still keep our figures...” much in the same way apparently, they’re the only ones who can travel enough to have precheck access 😂🤦🏽‍♀️", "jewelryjelly": "I’ve had this experience a lot with white people and my hair they go out of their way to interrupt whatever I’m doing or whoever I’m talking to to TOUCH ME and tell me they like my hair i used to tell myself to just take the compliment at face value but in recent reflection i think it’s just white people trying to get brownie points in public displays of “anti racism” It makes me very uncomfortable", "_brandonbogle_": "For sure! This is a notion I'm working on dismantling for myself too. My partner and I were just talking about this a few weeks ago and she was responding that if the concept of strength is just enduring pain then what about that makes someone \"strong\"? If you're suffering why is that considered strength? I've been working on my language in regards to that too. Trying to stay away from telling (black) people \"you're strong so you'll get through it\" to more validating statements or statements of support.", "half__wolf": "\"Black women are strong so white women can remain victims\" I've never had something resonate so deeply.", "squishirus": "I never really saw things from that perspective and it is making me question some of the interactions I've had in my life and how some of the people I've complimented may interpret them. Generally I try to compliment people I see if they have qualities that stand out to me, especially femmes, I feel empowered when other people say they like something about me (colourful hair, a cool garment, interesting make up, something other than how my body looks or something I can't control) but never stopped to think how some people may perceive my comments. As someone with tattoos I know how it feels to have someone try to touch me, it's a gross feeling, I can't imagine how it feels to have someone try to touch you based solely on your race, that's cringey as hell. I'm sorry you experience this so frequently :(", "ginandjenga": "@lodo_bgmagic", "blacmagic_woman": "I feel this so hard, like soo soo hard!", "iveynyc": "@ihartericka So eloquently put !!! 👏🏾👏🏾👏🏾 I used to never have the words for those same incidents that happen to me almost daily. I am often in spaces in which there are 1-2 or no other Melaninated persons... White people’s (especially white women) uncomfortably is palpable - literally making the air thick. The random reach out and touching your person without asking ... drives me nuts !!! I have often ‘lost my shit’ (excuse the language) and fussed out whites who do this. My head is bald 👩🏽‍🦲 and the constant reaching out to touch it without asking is infuriating. Thank you @ihartericka 🙏🏾 for speaking out and up.", "_rowantree_": "@_c.andice_", "_ms.emily": "I've done this. I'm white. I've thought about why I often did it. And it's pretty sad and filed under \"well intentioned\" but rooted in something distorted. It went something like this. I would notice something, I'm very visual, i would be thinking something positive about say hair, or style. But, as you point out here, the degree that I would express that thought/appreciation out loud, was some sort of self serving process of making myself more comfortable. With the statement like, \" your braids are amazing \" I think I was trying to project my self as \" im down\" ... \"im not one of those white women\". The last few years, following you and others, ive for sure become more mindful of the intent behind saying something out loud to a Black woman. it's a Presumed Intimacy with another, to think I can bring attention to their appearance in public. I'm not okay when a man I don't know does it to me, so why would I not bring that awareness to my interactions with others in public settings. so I check myself before blurting out, 'that yellow looks amazing on you' which @ihartericka it does 😘. Thank you for taking the time to articulate this nuanced take on how you experience, comments , compliments and touching from white peeps.", "itskeilavon": "@glowedup @kailachelle @cupofsue @yourmaijestyy caption 🎯🎯🎯🎯🎯🎯🎯🎯🎯🎯🎯🎯🎯🎯", "like__a__villain": "This happens all the time and it always made me wonder if white women compliment each other like this every day. Like, can we just exist in space without this hyper focus that feels exotifying and othering? Damn.", "luper_trooper": "I mean if one more person tries to touch my fucking hair, I might actually have to break their wrist. This is not a fucking petting zoo. And white people telling me “I have hair just like yours when it’s not straightened” .. the blood boils. It’s not my job to give every person I come into contact with a contextually based history lesson", "moontwerk": "I feel like this plays out SO MUCH with Black girls. (Obviously yes I could go on and on about how this happens as an adult but) So much of the narrative is planted into our minds as children. At school, when visiting friend’s houses, just out and about...Black girls expected to behave in such a such way in order to make sure white girls feel special. I remember dressing to impress the popular white girls. But looking back I know they did that Regina George “that is the ugliest effing skirt” shit behind my back. The reason they have this sense of entitlement as adults is because it’s what they’ve been used to for decades...at the expense of Black and Brown girls. Ya know? Like I’m all for raising all kids up and making all kids feel loved and supported but when it’s done in an effort to perpetuate white supremacy it’s just cruel. Am I making sense or am I rambling and not really saying what I’m feeling?", "ihartericka\nVerified": "Verified", "afrobambino": "Definitely! I left my job in an ER, where I was the first full-time Black nurse in their 20+ year history, because I had no support and was always given the “Oh you’re strong, you can handle it” shtick. Even when a patient’s family member shouted across the nurse’s station FULL of staff at me, “what brought your black ass down here to Texas?” a white cis male coworker came up to me and asked, “how could you let him talk to you like that?” My guy, how could YOU let him talk to ME like that?! But it was always from a place of, “I respect you as a nurse,” and never as a human being. And I accepted it because I loved my job and was really good at it, until I started having panic attacks before work, not being able to sleep the nights before my shifts, and getting diagnosed with PCOS, the main cause of which was *surprise* stress. Not from the job, which is hard enough; but from my coworkers, and my manager who couldn’t “fire people just because they’re terrible people.”", "rachi0head": "This whole entire experience is Denver Colorado", "_va.aa_": "I never knew or even thought to think that my action and words as a white woman in a „seemingly harmless“ situation like this one could/would be seen or felt like this. Thank you for opening my eyes. Although I (personally) give compliments to like these to all women around when I think it is appropriate, now know that just because it seems to be okay for ME, doesn’t mean I am not invading a black woman‘s personal space by doing so. This and your work help a lot in educating not only me but so many others. Once again: thank you 💕", "bycatjones": "A fucking word honey.", "fatssoraven": "Should I not compliment black femmes? I’m not trying to troll, I genuinely do compliment all womxn often and enthusiastically. In this case am I actually elating another womxn or am I just giving them a complex as they try to go about their day? No need to answer, I’m sure you’re busy and constantly dealing with comments. I was just curious how my seemingly innocent compliments may be affecting people in a negative way", "aprildawnreigart": "🙌🏾Yes!! When I was in labor for 24 hours...I was in serious distress, they were overdosing me with medications, not listening to me tell them I can’t take all these medicines, I had an allergic reaction, they didn’t listen that I have normally low blood pressure—and ultimately, I became tachycardia, nearly bled out, and almost died at their hands (I’m a holistic health coach marathon runner at the time...should not have nearly died). And the entire time—all the (white) nurses, midwifes, doctors etc continually commented about how STRONG I was!! They kept saying—“you’re the rock star of the maternity ward!!” Because I was going through so much pain!! I. Nearly. Died. At their hands...and they were just complimenting my strength. My son is 8, and I am still hurt and disgusted.", "fr.ickk": "This is very eye opening, thank you💜", "sunnietheeboss": "Seems like LOTS of folk are confused! 😫 Assuming the VAST majority of you are non-trans women (Seems like yall get offended by \"cis\" so I refer to EVERYONE in trans terms. Bonus: Its much easier and takes away ability to belittle folk of trans experience. You're welcome my non trans fam. 💋) That said here is a scenario I'm POSITIVE you'll relate to. You know how when you see a man and assume he's gay. Then immediately get his attention to tell him something about him (hair, clothes etc.) is fierce!! 😳 Yeah that! If your language or even the focus of your compliment is NOT in a lane that you frequent amongst friends and family then why are you \"pretending\" in his presence?! Your answer to that will help you understand EXACTLY what @ihartericka is saying. P.S. Even if that is your normal way with familiar people remember THESE ARE STRANGERS! Don't presume to know what is a compliment or offensive to them bcuz...say it with me...THEY'RE STRANGERS! Its really not that hard I promise...lbvs black folk mastered \"non offensive\" interaction as a survival tool...your survival may hinge on it too! 😜", "the_liftinglawyer": "I was guilty of this for the LONGEST time. Growing up in a super homogeneous environment, I legit did not know what to do with myself around POC. My awkwardness manifested in just being way too \"nice\" and giving weird compliments. As I grew up and out and challenged myself and read more, I came to realize I was only manifesting my own discomfort and I had to get tf over that because I was making other people uncomfortable. The solution was just to treat POC like full human being (SHOCKING).", "johnmillah": "Speaking from a heterosexual black experience *my personal experience* so don’t @ me I find that some of my black male partners will take advantage of my perceived “strength” in ways that are damaging to me and say oh you can handle it or use it as an excuse to not carry their share of the relationship burden relying on my endless strength and all the while praising it 🙄", "xmotorcycledriveby": "Yes, for sure. I find it to be even more so true being a black person that other black folks see as “alternative” I listen to a lot of punk, hardcore and metal and grew up being seen as a freak by my own people, so I often sought comfort in the white punk scene, but as you said, constantly being held to this weird, foreign standard with white folks that fetishized me and I’ve always felt like I floated between both spaces, never fully accepted by each group sucks. White folks want to feel like they are accepting of us and don’t know how to let us just EXIST. Like ain’t nobody going around grabbing, tugging, screaming compliments-at they ass. Chill.", "jyvonnehaskin": "the exhaustion of it all, yes!!!", "city_witch_zelda": "This is so true. I actually had a long post about the fact that I don’t care that you’re butthurt that I didn’t say thank you to your compliment. Me dressing is not an invitation for you to make comments on what you think. I dress for me. You dress for you. All of us look fricken amazing. Done. 👏", "thecannabisdoula": "“But ain’t I a woman? I done plowed and planted, no man can head me!” (My fav life from SoJourner’s Ain’t I A Woman?)", "l.c.lewis": "Yes. Skin tone. Hair. Body type. Personality. And we can tell when it's disingenuous. And there's still white folks in the comments when it clearly said ”black folks only” asking why. Chile... 🙃🙃🙃🙃", "gucci.nut": "And with the excessive empty compliments, it’s all very performative isn’t it - as if that will undo our internalised racism. It’s creepy and pretty obvious...", "denengethefirst": "Yup. All this all the way ✨🔥✨", "carinadesireebrooksking": "I know exactly what you’re saying the compliments are to get you to engage so they can find your why you are there or who you are they feel you either are richer then then or have some sort of position of power it can never be you just are equal to them", "daybroadway": "I have 1000% had this experience. In my experience, They see you in their space and suddenly stumble over themselves to make sure you know they are \"one of the good ones.\" It's just confirmation that you see my skin color, then my hair, then my outfit, then me. In that order. Most times never even seeing that last bit.", "neahigs": "Yes. Grocery store in an isle searching for baking supplies, crouched down looking at different flours. Little girl, maybe four or five reaches out to touch my hair, currently styled in goddess locs. I rear back inside myself and smile at her but step away from her hands and her mother who is at her cart audibly gasps and comes up from behind us, half blocking me from escaping. She comes from around the front of her cart to us and she goes “oh isn’t her hair pretty Jenna? tell the nice lady it’s pretty. And she reaches her hand out as her daughter is in my face and has a fistful of my hair in her hands. And I screamed inside. I stood up, yanking my own damn hair out of a child’s hands and dropped flour and sugar and abandoned my own cart just because I felt like I couldn’t breathe.", "is_she_okay": "Hell yes. When I'm in cosplay ytpipo feel like they can just put their hands on my body. Strangely enough, I get touched without my permission more often in costume than when I'm damn near naked doing a pole or go go performance", "flowersrisin": "“If black femmes are godlike, who wants to fuck god?” Wooowzaaaa. My niggaaaaa Eb! Thank y’all for always seeing us. The niggas and the queens and the mamas and the sources that we are. Love ya more than I can say.", "they.them.ryse": "Yess all the damn time. Comments on my hair, how young I look etc. once had a grown as white man reach out to try to touch my hair at the daycare I worked at... no shame about touching me", "lerinalta": "🗣ONE HUNDRED PERCENT!!! I can always tell when a white person is describing an absent non-white person because they say things like “so beautiful,” ”amazing,” ”powerful” to describe them. As if they offset their own internalized racism by giving these empty and unnecessary compliments. It’s subtle and yet so consistent.", "asa_hndrx": "Sometimes you speak right to my soul, actually most times.", "kazejewelz": "Oh damn!! You struck a nerve with the receiving compliments and it being vastly different w/their counterparts. I've shifted and grown tremendously because I used to allow whites touch my hair, and take pics of me, years ago. who knows where the hell all of those pics are of me and what was done with them, and to think I internalized it as flattery. But the fetishization of us are worth discussions. Side noting our strength. I also perceive our way of coping to being okay because that's what we're taught. I teach myself these things to remain above water, however in my next breath I cry rivers, design jewelry, self care, cook, talk, dance, remain occupied, the list goes on, to heal myself. The narrative does stand though, we are held as strong so we can stand in the way of \"getting over stuff\" to pacify whites in any shape or form.", "decolonizingtherapy": "Absolutely. Thank you for speaking on this. At my neighborhood small gym I’m pretty much usually the only black person there most days. And the white women will usually start saying loudly that their kids are half black and they demand Mac and cheese. I ignore them. Go about my business and don’t make eye contact. Then inside I’m like fuck ya’ll. ✊🏽", "_insearchofagarden_": "This has honestly been my entire life as a black queer femme. Thank you for vocalizing this in its entirety. “Oh but Catherine, you’re so STRONG! You’ll be fine”! Maybe I need a hug and to cry with a tub of ice cream and not be “strong” but be human!", "square_fromdelaware": "💯", "berrysherry08": "Yes so so many. I waited two hour in the ER one just to get pain meds. While the girl in the bed next to me. Who got there like and hour after me. And registered her pain at a 7 while I said 10. Got her right away. It's always the same shit.", "_geralartist_": "Holy shit. Thanks for shaking my brain"}