{"bikini.whale": "people go off and make their own stuff like the bigots whine for and then they have the audacity to be in their lawn. Fuck em.", "lauren___manuel": "Hold up guys we ain’t need to blame the dogs for this😭", "heykerrik": "They need to fence in the yard. It should not be open to the public", "cicimumi": "Like really you value your dog shitting in a place, over a historic black campus?? Truly? You couldn’t just... idk... be respectful?!", "jamilareddy": "🤦🏾‍♂️", "lauren_v3.8": "DC blacks mad tolerant; let the fucker try that shit at Coppin or Morgan State in Baltimore... ⚰️", "fotoz4fun": "I've met dogs that I've liked, but so far never met a dog owner that I've liked.", "friedgoat": "All white people should die", "proghris": "this is literally the stupidest post I’ve ever seen in my life", "a_win15": "THE COMMENT SECTION IS SO MAD LMAOOOOOOOOO", "alkaline.kay": "Woooow white dude SO MAD someone even thought about telling him no.", "ethnic.cherub": "@fashenika", "undrgrndcircuit": "🎡🎡🎡 #undrgrndcircuit", "extraordinaryenglishteacher": "Gentrification at its finest. 👊🏾", "itsjustriip": "White people have no culture so there for they don’t care about it or even THINK that another race has a culture", "kael.saenz": "You’ve created a bandwagon where people can get on and literally hate on other people and call it ok like you’re actually creating more hate and evil in the world knowing damn well what are you doingThis weird mutated bitch or “it” obviously knows there’s holes in her story but doesn’t say thing because she knows that she’s built herself to be this youthful activist type false idol that’s more disgusting to me then Generalizing and assuming that every white person on earth has done some thing in someway to harm you or what you stand for", "reload.relive": "Love how a cis white man doesnt have enough brain cells to understand that HISTORICALLY BLACK COLLEGE was there before him and he decided to move next to it so 'then move the campus' is easy for him to say because moving people of color from one place to separate them is all he knows. 🤷🏿‍♀️", "_mymojosodope": "Yet people from South Central can’t say the same thing. Maybe they can be petty like @USC and put huge gates around the campus", "tacosbeforeheauxs": "I can’t believe he said move the campus.", "create_in2020": "Dogs hate fireworks and loud popping sounds we gonna all be uncomfortable 4th of July everyday all day", "displacedyke": "i am actually allergic to white men. the sheer entitlement........", "_johnsonaliana": "Can never have anyone for ourselves........", "gabbyaguilera": "I can’t stop thinking about this in terms of the “cultural significance” rhetoric people have been using to talk about why they are so devastated by Notre Dame. It’s just such a clear illustration of how “culturally significant” means created by/important to white people", "cornoralley": "What he mean “them” & “they”", "jai_iz_dope": "Move the Campus?!!!!! This Nigga 🤦🏽‍♀️", "pinknacl": "No words.", "houseofsaddletree": "MOVE THE CAMPUS?!? Bald headass bitch is stoopid!!🤬", "lmanijc": "Whhaaaa? I'll be damned. How old is this school? How long has this entitled, bearded man been alive? Ok. Yeah...you work around the campus. Something that's been around way before your gentrifying self moved into the neighborhood.", "black_girl_magick22": "Make it a closed campus like Fordham. Period", "pancakes_bobchin": "This entire thread is just sad for so many reasons", "jennyjuniper31": "Fuck that asshole and his dog! If you’re not a student stay the fuck off campus!!", "atiya_da_bushbaby": "Build a fence around the campus and only allow students and faculty in. Periodt...", "inslomoshun": "I have so many problems with this and I feel a lot of ways. Number 1, most importantly, fuck Sean Grubbs. But as a DC native surviving gentrification, and as an uptown resident, and someone who went to high school blocks away from HU, I am conflicted about the closed campus sentiment. HU has been an integral part of the community and the city. Being on that campus as a kid, not a student, was an inspiration to go to college. Having HU students as mentors was an inspiration. I always felt welcome there as a neighbor and a Washingtonian. The thing is, HU is in what used to be a historically Black neighborhood in the Former Chocolate City. The students in the clip are resisting gentrification 💯✊🏽✊🏿✊🏾 just like #dontmutedc and #imfromhere ... then again as a non-Black POC I get the need to respect Black spaces. And I get the need to re/claim Black spaces and non-white spaces. I just wonder, dang, am I really not welcome anymore? These invaders are really costing us so much. #gentrificationisviolence #wherewegonlive", "dianneekeji": "Move the campus? Really? I’d rent a dog for a day just to have it poop on that guy’s yard.", "galu.dibaba": "@ananendale this guy", "kissmyspaz": "Wypipo strike yet again 💁🏽‍♂️🤦🏽‍♂️🙄", "rorylambertwright": "Curious about the way @ihartericka uses the term “intentional” when talking about how an absence of blackness in any given public space is “intentional”. Obviously systemic racism still exists even though Jim Crow laws with explicitly racist language have been mostly discarded, but I guess I’m less sure of who’s “intention” is being referred to? If I’m not present in a white space, but then I walk into said space, who in that space was trying to keep me out? I doubt it’s that simple, I’m genuinely just trying to unpack the idea since it’s new to me. Would anyone enlighten me? Really love this educator!", "imjustachannel": "I bet he hadn’t even been living there for that long...", "cash_labejia_": "HOW YOU GON MOVE A WHOLE FUCKING CAMPUS BECAUSE YOU DONT WANT TO MOVE YOUR LAZY YOGURT COLORED ASSES LESS THAN 500ft!?!? I’m tired, lawd!!!!", "celihangout": "@tecoyamichelle @dotmcdonald", "malorey1313": "“mOvE tHe cAmPus” bro what!??", "bluecentric": "We had to cover this mess at work. And the fact that this is what appears to be a gay white man making what he thinks is a reasonable suggestion (wrapped in positive language)... when it’s really just peak entitlement and a lack of cultural competency .... is like the most accurate snapshot i’ve seen of gentrified DC ever. 😒", "mohawktheeducator": "I'm sure people would have a fit if black people just started moving in on some Ivy League school or some shit and just walked all thru campus with the dogs like they own the place. How you gonna casually move a college campus? Y'all move! The campus is historic and was clearly there first. My dad went to that university.", "creativeneisha": "That is just code for\" if they don't like it that can go back where they came from\" MOVE THE CAMPUS?! 😡 the audacity...", "britniemorris": "@princekimathi “it’s our community and that’s how it should be”. WHAT.", "evergreenmeg": "That fool is one of them #alllivesmatter and was pretty clear he doesn’t respect that the campus is a campus, was there first and should be respected. He’s got that mentality of white superiority and uses the word “they” but really just means “white people” and how bold to say that the campus and it’s student should leave if they don’t like it. 🤦‍♀️ #shameful It is most likely a conscious and determined choice to have his dog shit on that lawn.", "ifurie": "Infuriating....", "smc_xo_": "White people and their micro aggressions 🤢", "jemapelle.sharin": "Bet if I walked the dog I do not own in a gated community authorities would be called without remorse. So much more could be said but I can’t even gather my thoughts correctly behind the privilege and entitlement they defend themselves with.", "soulwithbeauty": "I have two dogs we bought from breeders and every time a White person tells me “but there are so many dogs that need adopting”, I feel like saying “there are also Black and Latino stuck in our shitty foster care system some waiting for adoption too, so should people stop having kids”. So sick and tired of their righteousness.", "vanamerongen": "Beard boy needs to have a little sitdown and reflect on how dumb that was. We all know he won’t tho.", "_.ruthlessss": "It’s a college if u don’t go there then no need to walk the premises it’s disrespectful to them who wanna walk out n step in dog shit they wouldn’t be wrong if they start arresting for trespassing 🚫", "themaineattractionanders": "My Bed Stuy block was poop free for 9 years. Not no mo.", "whatsda_t_lc": "Then move the campus... wow 😮 a school that has been present for over a hundred years but his white ass is allowed to stay. Disgusting", "lashonwaxoffdc": "Just like they tried to cut off our music and we got them tf outta there !!!! Let’s get this petition going next !! #dontmutedc sick of you WYPIPO!!!", "sweetandspicyjojo": "@theshaderoom", "elyzaloubyrd": "@racheleliza88 tagging you in this for future discussion about something on my mind", "sierracreates_": "“move the campus” bitch what the fuck", "rulis711": "FUCK THAT GUY. Uggggghhhhhg why do wypipo ruin EVERYTHING. Whyyyyy", "africancreature\nVerified": "Verified", "staceyh987": "Some of the Universities/colleges over here in the UK as far as I am aware for example like the cambridge colleges are private and you have to pay admission to visit the grounds of each individual place. Surely every student at every place of education everywhere around the world need to be kept safe, and regardless your place of study being in a city or town if the residents of the city they aren't studying at the university they therefore have no place being there?! Such entitled bullshit ted", "panddaa.po": "Sigh. Dumbass siad \"move the campus\"", "la_mi_ka": "Thank you to this piece of shit for showing everyone exactly what gentrification is ... a continuation of the same attitude that fueled colonialism. I hope somebody beats the hell out of him.", "wrays_nephew_and_dem": "“Move the campus”.... move a whole HBCU because you want your dogs to shit all over our achievements! The idea of “OUR community” only sounds good when it benefits THEIR agenda. FOH!", "celestial_jazz": "Leave it to a colonizer who JUST GOT THERE to say move the campus. No, my dude. You move. Out of DC with you.", "muscle.mechanic": "Entitled scum", "abbacchio_": "Bruh white people so fucking aggravating @inconsequential_primate", "boomerangnika": "smdh", "kemeti_andretti": "What a fucking peasant, Mrs. Mewiththatbullshit head ass “our community” you ain’t slick jack 🐖", "inthemonty": "Fucking insane! Forget trying to “work” with these entitled assholes. I hope the University puts up huge security gates with permanently placed guards wherever needed. It’s an historic privately owned university, not yet another place for you or your pets to SHIT. And I’m a privileged white woman who loves her dog. It’s 100% worse that this is a HBCU #shame That bearded guy isn’t worthy of a dog.", "disneychick66": "Wow😮 beard man is an asshole Period.", "amber_joy1": "@sonja_1988 🙄", "kevmadison": "lmao move your hbcu so my dog has a place to walk? talk about a colonizer, jesus", "hoolzyamama": "So unsurprisingly entitled 😡", "laurajeanblaine": "I nominate \"YOU MOVE, TED\" as a merch slogan", "jsblzr": "Welp! This is some bullshit!! 😡", "vjammiez": "I was annoyed at this display of white arrogance until the telling line that Howard has said nothing. What are they waiting for???", "iamquigley": "Wait! What about the safety issue to the Howard students. I’m more concerned that the campus needs to be secured from random PEOPLE walking through without permission. Are there no security personnel to remind people that this is a school and not a park? @howard1867", "recklesshoyden": "Cannot wait till someone throws up on his front lawn and it becomes 'my' community, not 'our' community. Suggesting someone move t campus is taking gentrification to a whole new level of privelige fuckery 😡", "emmabacon": "MOVE the campus?? Lmfao I cannot with his ridiculousness", "stonefox4evr": "Try that same shit at Columbia...lets see how that goes", "thehungryfeminine": "I've never experienced a college campus being used as a highway for passersby. And that idea that \"well you're here so I get to use you and if you don't like it you can go somewhere else\" is, in fact, very violent.", "avalonstanley": "@the_glory_hole_channel", "zuriadele\nVerified": "Verified", "missstelford": "Weird...I went to UCLA and I don’t remember ever seeing a dog on campus. And there’s a lot of green space and lots of homes surrounding the campus. 🤔", "alanisaurus": "wow just comparing the two interviews is telling", "mx.olh": "LMAO \"it's our community \" until black folks get harrassed by the cops then he'd look the other way. GTFO CHADWICK, Smh.", "q.ivy": "This fool really did just say say“move the campus”...wtf?!", "sierramay_tinuviel": "\"Move the school.\" I'm sorry wut", "niggapasta": "Lolllll nigga said move the campusss", "omolaraoriye": "Wow! He literally said \"move the campus\" an entire campus.", "salimasees": "😪💔", "issavibe_pielcanela": "@shaunking", "oliviablackwell_": "The entitlement. \"Then they should move\" or you can take your dog to the park that is right fucking there instead of making a safety hazard for students and possible service animals.. tf", "freddiemercurysmustache": "Helllll no! Time to ban dogs and the general public from campus.", "cindybelit": "Arrest them for trespassing!!!", "melodrama_llama": "Oh this asshole has me so mad. The actual fuck. But the clapbacks on this thread are giving me all of the smiles.", "tigersturtle": "Nor is it happening at George Washington not too far away", "narufosho": "Wait.... so were just letting strangers walk all up on school grounds??? That’s a safety issue", "asiaaneka": "Fuck Rob Zombie and fuck his dog too. That is so disrespectful.", "drjay_allday": "This is some straight up f*ck sh!t. These students pay tuition to attend Howard. This is a private institution and property. This is not a city park (which by the way have rules about whether or not pets/dogs are allowed). I mean, he basically told the Howard community to go back to Africa. And I still find myself blown with the level of caucasity. Not because I can’t believe he said that, I just can’t understand how a mind rationalizes that this behavior is acceptable.", "kinkswithkekepodcast": "The campus was there before you! Wtf!!!!!!", "yoyowiggster": "@mjtravels17", "crystalsofaltamira": "He said move the campus! 😂 Fuck outta here!!!!", "neiafromthatnola": "I hate white people yall bitches can burn", "oshun\nVerified": "Verified", "thegrassprincess_": "SO. FUCKED. UP. “Move the campus” okay bro.....", "obi_mom_jenobi": "Nah dude-bro it's not \"y/our community\" unless you're a student there gtfo. The entitlement while not in the least bit surprising is still enraging.", "uglychin": "Simply put a sign that says no dogs on the grass and fine anyone who does it.", "peace_me_please__": "They wouldnt like if we hung out in their yards so why cant they stay off the Campus. Since it's an HBCU they have a Problem. FOH!", "blkfeminist796": "White people would do this at Spelman College too,it would be this random white lady running around the campus with her baby. I swear we can't have nothing to ourselves.", "inked4lyfe35": "Together? Sir you don’t pay tuition... why are you walking your dog on a college campus pervert.... fishing for college students much? I would definitely go get all my friends with dogs and walk them in front of his home", "wutang5ever": "This is what I was talking about @chlove10", "chynnadollyogi": "Also synonymous: “move back to your country” “all lives matter” 🙄", "ac3fromch": "HOW U GOT THAT MUCU BEARD BUT GAY AS SHIT! LMFAOOOOOOO CONFUSING", "_miaxlou": "If they're not paying to go to the university they shouldn't be allowed to use their campus. Simple as. Some people are so disrespectful it's INFURIATING", "ultraaveragehkr": "Couple this with the fact that Ledroit Park (the Community next to Howard) is a formerly all yt gated community that wouldn’t allow Howard students to walk through their neighborhoods. Yt ppl just think every space is theirs. 😡", "the_faux_somniphobic": "As someone who has lived in the DMV since the '90s (and is originally from BK), FUCK GENTRIFICATION AND FUCK WHITE PEOPLE TRYING TO CLAIM DC AS \"THEIR\" NEIGHBORHOOD. Bitch, there's no \"our\" because you have not been here longer than Howard AND you weren't here when the name \"Chocolate City\" actually meant something. #ourmyass #fuckyaself", "myfutureselfwillthankme": "Tuh! If it was my yard I'd sprinkle chocolate chips everywhere for fido to enjoy. Idc", "__alltherightweaponry": "I don't really know anyone that walks their dogs through a college campus? This dude /whoever else is doing it, is being disrespectful and they need to know it. LET IT BE KNOWN.", "adoseofom": "“Our” community? “Move the campus” the fuck???", "ericanubia": "Once again white people are disrespectful of black space. It was disgusting that he felt that it was okay to say that Howard should move a campus that was there since 1867. Begone colonizers.", "elenalakay": "Require student ID or guest ID, period! Make the campus safe for students. Residents can go around!", "celiac_and_salty": "Howard is a private campus not a public park??? You can be asked to leave at any time so that right there is enough for you to not walk your dog on campus.", "meanassrai_": "I feel like I will be that black mothergoing up to my child’s school to raise hell. Elementary, Middle, High, and College/University because wtf? I didn’t bust my ass so my kids can have an education for WHITE people to tell me that they dog can shit On their campus where i pay tuition, school fees, dues, supplies, taxes etc... Those young black men & women are there to get an education. Let them do it without being disrespected.", "daisy.badu": "When has “coming together” EVER benefited US!?", "nadya426": "Same thing in Oakland and SF, all the parks where black and NBPOC kids used to play are now covered with tiny dogs sh****ing everywhere. You can't run 20 feet without stepping in it. Not just dogs, but filth and disease have always been tools of colonizing spaces. I seriously doubt any white colony would have succeeded if we weren't so used to / immune to living in filth.", "abbeythevulture": "That’s beyond aggressive. Disgusting. “Move the campus?” How about move tf back out and take your dog and fugly beard elsewhere??", "sankofamind": "Who the actual fuck is that dickhead in the blue vest. They need a foot to the base of the spine, and a good hard shove 🤬", "only1ana1": "Move the campus...whattt...", "anchored_n_righteousness": "Stupid as cave kid they all think like this", "selamariama": "Oh HELL na.", "justdonteventryplz": "It’s not YOUR community. The news reporter basically said the area was gentrified in a polite way. You gentrified the area and as usual believe you are entitled to it. Gentrified is a nice word. This is the modern day version of what the pilgrims did to the native tribes. Fk off.", "tamyraj_": "NO!!!!", "swashbucklingfatqueer": "Of course Dog Shit Dylan has to weigh in. We made our own spaces like they told us too. Now we have to move our people out. Gentrification at its finest. It’s so violent how he’s like “OUR” community. Um, no yt sir IT IS THEIR community.", "melia.meals": "After watching Homecoming and immediately seeing this, I fume and wish to see the HBCU alum portion of the beyhive get this man 👀", "mahoganyrules": "\"I'm gonna walk where I want to walk so u might as well get comfortable or move your black asses outta DC,\" is what I heard.", "basic.987": "fuck that shit. i live in dc. theres literally a public park across the street.", "too.dreamy": "The white people here saying “hOW iS tHIs ViOLEnT lOl?” 🤦‍♀️🤦‍♀️🤦‍♀️ Listen.", "drina_f": "So fucking annoying! And so entitled when it comes to everything 🙄", "naija_marley": "People do that at my college but it's usually not enough to be that noticable.", "_habbathejutt": "Does the person at the end pay tuition?", "phasmatostribum": "My nigga said: move the campus... *sigh* NIGGA YOU JUST GOT HERE!!!!!", "_1_o.o_1_": "Does he want to move the campus and turn it into a dog-park? Because that is some DC shit. There’s hella dog parks and FEW people parks. Also this is the same vicinity where white folks are telling their black neighbors to turn the go-go down! the fuckery is beyond me. #dontmutedc", "liz.t_": "Wow. 😞 You can bet that if the tables were turned they’d have every high up person possible running people out of the yard.", "polytechnique2": "Move the campus?? That college has been there since 1867. Of course when it comes to a space they feel entitled to, they suddenly claim to care about “our” community despite literally suggesting an entire college campus be moved so they can walk their dogs in the space.", "imagodeifag": "@natalirob 🤬🤬🤬 I wanna snatch his beard.", "ms.bines": "Not to mention, the campus was here before this Ted looking ass was alive and his bitch ass pets too. Where they do THAT at?", "selfiebooklet": "I find that white people are like dogs themselves. Hear me out. Dogs are VERY territorial. When they pee on things, it’s almost like they’re marking their territory. White people have that same sense of entitlement, even when they’re not entitled. They HAVE to be apart or involved in some way or else they feel inferior. The guy being interviewed made emphasis on “OUR” but you’re on a historically black campus🤔 So he deemed it as “ours” because again, they feel entitled to intrude on everything. That’s actually how “America” was founded 😄", "100pctmixedgirl": "What a 🤡", "charles_j_johnson": "Woooooow", "jenniferannsteen": "@dariannn__ I’m sure you know this is happening on your campus. So ridiculous, I hope the university pushes back!", "bigspagettimama": "God forbid you go to an actual fucking dog park 😡", "metricdisco": "Is this how affluent white folks are dressing in DC these days", "maxymumbeauty": "Even with the college I went to having a major road that a lot of people have to travel to get to different destinations in the city and also a city famous restaurant that a lot of natives go to, I have never seen anyone be disrespectful to my campus. I think because it is an hbcu, it’s easier to tell who may not go to the school which causes a security problem. Walking or driving THROUGH the campus, I don’t see a major problem. Don’t bother nobody. Now if these dogs are scaring students or using the bathroom on campus then that’s where the problem begins. The dogs don’t pay they high ass tuition!", "blueeyebandit": "I hope the entire campus go and stop on his fucking lawn, EVERY DAY! There are plenty of places to go and of all places they pick Howard’s yard? Having lived in DC and working at Trinity Washington University (around the corner from Howard) I can say one would have to intentionally walk on the yard. The blatant disrespect is not cool", "psshoookaynekia": "Move the campus??!! Wtf is wrong with the whites these days? Like I just-", "recogryphon": "The offender just verbally affirmed the disrepectful, arrogant, angry, hateful, colonizing, psycopathic, psuedo aggressiveness we are seeing across this country. The racism is so deeply ingrained institutionally, further emboldened by the cavalier fire fanning from the highest office in the land. These psychopaths are ready to agitate for an excuse to use stand your ground laws to their benefit. He knows dog on (pun intended) well that's very disrespectful. The action was purposeful. He wouldn't do that at Georgetown, American U, GW or Catholic U. The nerve of him to say something as asinine \"maybe they should move the campus\" is an indication of a mindset that he and others share. Howard U has been around for over 150 years. No you should sell your house/condo and move some where else!", "missusonesixtyfive": "No the fuck it is not OUR community. Show me your residency papers . He was not born raised generation after generation. 🤬🤬😡😡😡🤬🤬😡🤯🤯🤯", "patricia_irvzallinit": "Wow move the whole university to accommodate...the level of entitlement and disrespect that is that statement.", "scarletopalescence": "Anyone who doesn't think this is 100% deliberate is an idiot. Those dogs are shitting and pissing on black history and in a black space. The white people showing up with their pets are 100% aware of what their doing and doing it for racist, violent reasons. And I can guarantee you, DC has set up more purposeful spaces for dog parks than they have for safe spaces for black people so those people need to fuck off and I hope Howard tells them so.", "shanshantel07": "\"They\"?? Blood is boiling!", "kiss__my__rose__": "Did his ass say move the campus no mofo find some other grass for your fuccin dog 🤦🏽‍♀️🤦🏽‍♀️", "i._am._m": "😮 Talk about white privilege!", "graycode": "Literally nothing but entitlement. It’s not ‘our campus’. Do you even go here?! 👀", "flowermami_": "This is fucking disgusting", "la_bruja_masputa101": "That bald bearded colonizer triggered tf outta me. Imagine being that innately violent & entitled, I fear for the students.", "fluffmanor": "Ew that guy is literally vibrating with white anger that he's being asked to walk his dog somewhere", "de.vorah": "Fuck. That. I’m sorry. 😭💔 As a mostly white passing (unless someone calls me a dirty Hebrew — last week :( ) Jewish human I don’t like to take up space here, I prefer to/need to listen and take action, but as a dog trainer and fellow human of this planet I just want to say — I’m sorry. For so much. I’m sorry that these fucking people cannot realize how deeply buried (yet so obvious) their racism is, stuck in the (Freudian) unconscious, inherited anti-black violence, inherited racism they refuse to claim, change, and break the cycle — because it benefits them!!! It is unconscious to the point that they don’t realize it in the most obvious ways!! WAKE UP WHITE FOLKS. I bet it would never occur to this man to let his dogs shit on/ run all around the front grounds of a white church, yet he is willing to publicly speak out about this being acceptable?!?, about it being being “our” community?! I’d like to know what that man has done for “his” community?! It’s only “his” community when he wants to use it (shit on it) for something, and not when anything or anyone needs love, respect, EQUALITY, etc. I bet he thinks everything in the world is “his” community. Stop defending your racism white man, take a moment and listen, reflect, realize your privilege, humble yourself, try to change, pay black and brown folks for their time and energy in helping you change, and get your shit together!! Constantly trying to explain to folks why they can’t let their dogs shit right outside of the synagogue ... they don’t get it. BLACK SPACES DESERVE THE UTMOST RESPECT. Fucking obviously. I’m sorry. I’m listening. I love you. Thank you for everything you do @ihartericka ❤️", "kitty_hardon_": "i dont feel like dogs walking is inherently disrespectful, however, it is disrespectful to tell a whole school to move. as long as the dogs are picked up after and not attacking \\bothering students i feel like its chill. my hbcu’s campus has a ton of cats that roam around freely and its really cool.", "poosieq": "fuck that skinhead", "ashmarie2112": "That white man thinks He is entitled to that property? Is he paying tuition or earned a scholarship to use that space? Disgusting", "dr.shazy_f_baby": "This started before i graduated on 2017 from HU. Students were pissed then. And howard is private so we could def kicked them off", "therapytoatea": "This nerve is so violent. This campus has been here for over 100 years and he legit said \"move the campus\"😂😂🤦🏾‍♀️😐😐😐", "data.seven": "people are paying to go to that campus and/or putting in hard work for scholarships to have that space and people think they can treat it like a dog park?? disrespectful", "jennybruso": "Sure, basicgaywhiteman, moving the entire campus is a totally reasonable idea rather than you simply not taking up space by going somewhere else.", "hoe_of_ky": "I went to a university. But I don’t go to one now. So I wouldn’t walk through campus, that space should be reserved for people who are actively enrolled, staff, etc. I would feel weird being on campus again. I would feel extra shitty if I had the audacity to walk through a safe space for POC and let my dog shit all over it. It doesn’t matter if it’s a public campus, it’s not for you Jethro! I feel like this dude is gonna walk a hundred dogs at a time through there now just to be a prick. 🙄🤦🏻‍♀️", "moonthecrystalchild": "Let us do this to their school, especially if it was historical and/or private, and all hell would break loose. They'll call the police and everything, but since it's a hbcu, it's ok for them to do it. Talking about \"our community\" and \"move the campus\" that campus been there for a hundred plus years.", "theelocqueen": "They not going be satisfied til the students start dropping chocolate everywhere and they dogs can’t stop shitting at home", "blackhair101": "Did this fool say move the whole campus? 😩 If Brent and Sparky don’t GET 🥴@canoosa", "morganharris1173": "@knitspinsew whew. Thank g-d this is getting the attention it deserves so you don’t have to do all the work/emotional labor teaching", "silence_of_the_lindz": "“It’s OUR community” LMAO! What he means is “I’m entitled to your space”. Pathetic", "joydivisionmackie": "@apaulglenn Howard University is private", "kasea__": "This just put anger in my soul.. 🤬🤬🤬", "grumpyrat_": "All people can be so incredibly violent. Please, don’t let these mf’s make you categorize all white people as incredibly violent and racist. I’m not gonna pretend I know how racism has affected your life, and I’m DEFINITELY not gonna tell you what you can and can’t say, but just know that you are a voice of change and if you categorize white people as “incredibly racist and violent,” you’re sending the message that it’s ok to categorize some, but not all. Just a heads up", "mslaurenfitz": "Also shout out to this young black man as an example of the decorum that Howard produces!", "_simsimma26": "That white guy had me fucked UPPP. Cis white gay vibes tooo real", "_d.jax": "Gentrification at its fucking finest! How dare they?! Suppose this was Harvard or Yale and WE began walking across their campus!", "koyukipanda": "AWWWW HELL NAW", "elisegiselle": "Gross and disrespectful. HU is not your space, like everywhere else. Plenty of places to take your animal in DC.", "gaiea": "Wow such arrogance and entitlement from this man. And the whole situation is absolutely violent. I’m so sorry you have to deal with this crap.", "itsmekellieb\nVerified": "Verified", "a_king_named_charles_": "Yo said move the campus 😂😂😂 wow these people are crazy", "adellerg": "Why can’t they go to Georgetown University 🤷🏽‍♀️", "chorey_knows": "Did that elf from Lord of the Rings, really say that they need to move the school? Gtfoh", "fantastlove": "Ugh they are so entitled! Meanwhile black kids get harassed for being on campuses at schools they fucking attend!", "nklaurence": "white people constantly be acting like they ain't the invaders!! move?!?! they were def there before you were", "veronicagarnett": "I’m a Howard alumna and I’m disgusted. Our community? These white folks are just now showing up. I live near Princeton University. I have a dog. Let me find out if they’ll allow me to let my dog piss and shit on their property. You know that wouldn’t go down. But Black folks’ institutions are fair game.", "divinebeauty28": "Since when is a college campus not private property?? At my all white college no one could just leisurely walk their dog and expect us to just deal with it wtf 🤯🤯", "eveydetoree": "“Move the campus”...... what did I just listen to. move your dog walking path!!!!!!!!!! zero respect.", "yooo_itsnicole": "Uggghh you hear how he said “OUR” community. I can’t with the whites. @tylabee", "wolfe.mami": "Move the campus??? What the fuck kind of resolution is that??? I’m done", "addisonaultofficial": "“Move the campus”....????!?", "assatataughtme47": "GENTRIFICATION IS VIOLENCE", "mochaglam": "Whew, chile..........", "noekapp": "“Then move the campus” 🤔 ahhhhhhhhhhhh WT-ever flying-F! Who says shit like that. 1) It’s a private University 2) it’s a private University w/ a history that deserves respect. Take your dog & your disrespectful privilege to a public park", "heqete": "“MOVE THE CAMPUS”????? he actually said that. the nerve. he’s literally asking for racialized gentrification. erasure and DESECRATION of historical black excellence", "syndrome_air": "I would hope all my fellow whites check how close to that white person we probably sound on our best days. I know I have had that same tone before and I have to fight it off when it comes up, fuck that tone, fuck that mentality! This college should be proud of those young people wanting to protect the campus, most kids just trash their campuses because “they pay to live there.”", "summbody": "Get your dogs & dog shit off the campus! If it was one of \"their\" precious schools, this wouldn't be tolerated. Period. Tired of them inviting themselves into our spaces & expecting us to adapt.", "monie_gee": "Did that mufucka say then move the campus?!! 🤬", "milamyles": "Is he for real? “Move the campus?!!” Gentrification taking it to a whole other level 🤬", "vallen67": "Also - but we sleep whole studying at Yale et al and we get the police called on us. Ok!", "spideygirl91": "Omg this is sooo violent my blood is boiling!!! 😡😡😡 \"It's OUR community\", like what???? fuck off forever yt ppl!!!", "jhani8": "Wait, you can’t call 911 for this sort of thing?", "stoneyfamily": "@sunshinejlr he wants them to move the campus....for his dog. 🤦‍♀️😒😡 what a self absorbed racist entitled douche. May his shoe bottoms forever and always be a magnet for dog poo and have tiny grooves that are unable to be cleaned out properly so they always smell. Always.", "erinjbasler": "What the actual fuck. I made a joke last night about how [I didn't hear the term \"coloreds\" growing up] because I was around progressives... And we had already moved into the language of \"dangerous\" and \"seedy\" and \"up and coming\" rather than just being openly racist. Looks like Ted pal grew up in WMass or a similar liberal suburbs situation as well.", "maxwellllllhouse": "Aggressively \"it's OUR SPACE\" fuck OFF JOHN", "sgrhogirl05": "Howard University students need to follow #dontmutedc and continuously have activities on the Yard. Won’t disrupt my almost Alma Mater.", "sirm00re": "Smh we can’t have shit but if we go jogging in the neighborhood we gone get shot at by them smh wtf man", "chelsi.alauni": "“Move the campus”.... 😭😂😂😂 WHAT THE ACTUAL.", "argh_margh": "He don’t have a yard? Like... that a big dog, I know he has a yard.", "jewelenee": "Bro there's literally a dog park nearby on 11th..... like go over there...", "tooflyyyaquemini": "And it’s not OUR community!!!! Georgia Ave BEEN BLACK! U STREET BEEN BLACK!", "nataliestrella": "Dique “redevelopment” aka gentrification 🙄", "baby_andromedan": "I go to Howard and I’m not paying thousands of dollars for white people to use OUR shit like a dog park let alone a place where they feel like they can be period!!!! These whites got me fucked up lmfao 😂😂", "nurselolita": "Smells like intentionally abusive white behavior🤢 The students deserve better👏🏼", "ur_local_assassin": "Talks to dog: \"keep your bitch on a leash he bein ugly again\"", "rabiaseye": "Wtf it’s a university campus! It may be accessible, but it’s not public property or domain. Would they be okay with this at Georgetown University? I think the fuck not. There would be an uproar over the disrespect.", "perechiascoughlan": "If my dog can't defecate there then no one can be there... This idiot", "oftenoftenoftenoften": "Move the campus?????????? WOW. It’s only “our” community when they’re ready to steal it.", "amiramornoir": "Im concerned for the students this is so violent. The administration needs to take this as a threat. I would hate to hear of black students getting physically attacked because a white person’s physical violence gene activated near them.", "diana_alexandra__": "This happens at the Howard Law school too even tho it’s not in the “center” of dc.", "laurashleyakram": "@all_things_torian @passionate_rose7 you see this?!?", "blkmagicalgurl": "if folks wanna join the roasting of this gross ass anti-Black yt fuck, his insta is original_seans_beardom. join the community of Black folks shitting on his social media, and take some pleasure in the results of his audacity to open his fucking mouth.", "thewoodytrain": "What is this man’s social media handle/profile? Dying to see what/how he’s responded to this. Gentrifier. Colonizer. All the same.", "goldenchickie": "That bitch said move the campus!", "ariek.1": "mOvE tHe cAmPuS", "princesstricee": "But why do they have to \"work with the community\" they have already been apart of BEFORE your arrival?! How about the \"Manifest Destiny\" all through your gentrified home and just start using your bathroom 🤔", "spoileralertchick": "That is a security issue. I can barely get on my own campus without ID. Aintshitazzness x 1000.", "prettypleasecanijust": "I feel like getting a dog and wandering around Bentley now, or even going out of my way and driving to Harvard 🤧", "jolenangelique": "Yeah, move the campus that’s been in DC since 1867, makes complete sense to me. People love reacting and never wanna take a minute to process and then respond. Walk your damn dog somewhere else like what the fuck?", "blurredbytheheat": "That is one angry white man. I wonder if the powers that be can just enforce a no dogs allowed policy? 🤔", "americahatesus": "cc: @hellobunni our project is writing itself", "2zero99": "When he said \"'our' community\" he meant white folks.", "bkcpisme": "Move the campus???", "cashmoneyst": "I live 3 mins Away From this University & Theres about two dog parks nearby sooo wth they just wanna cause problems", "woameilhwja": "“”because students calling me out on my bullshit is waaaayyyy to valid for me to take responsibility for, so I’m going to suggest they move a campus that’s been there since the late 1800’s for my personal comfort...because my dog and I’s privilege are FAR MORE important than students getting educated!! I mean, if they’re all smart I can’t pull the ‘black people are inferior’ stereotype!! Then what will I do??”” —- a (not-so-rough) translation.", "servedupsober": "So disrespectful and utterly ridiculous. Howard’s silence maybe suggests a battle they know they will lose. White entitlement drives me bananas. Me and bae talk about it all the time. Dogs in the restaurants, dogs in the grocery stores. Let one of us post up with a pit bull at some of the same places they carry their animals and it’s a different convo.", "cambridgehyphen": "He said MOVE THE CAMPUS. Oh wow. The entitlement.", "apaulglenn": "😂 first of all how is he in any way being violent?! Do you know what violence is? Secondly, if it’s a public campus anybody can walk their dog through. Always tryna play the race card.. even in situations as insignificant as this.", "itsjustangel_": "@markeeva08 we were just talking about have Black spaces yesterday SMH", "yesthatlindsay": "The fucking audacity. If this had been a PWI and one fucking brown child walked their dog through the school and the dog sneezed wrong, every cop in town would be called, they would change laws, they would use force to stop the students. This is some bullshit. I would like to say I cant believe he would respond like that, but yes the fuck I can believe it.", "kelseystojk": "Mega disrespectful. Holy shit dude this is NOT A PARK.", "khaoticthoughts": "I'd like to see how white people would react if someone suggested moving Harvard or Yale!! The balls on this piece of shit white guy! If you're so concerned about your fucking dog go buy a house with enough land that it can run free instead of invading people's place of learning. Historic landmark status aside I see this as an attack on education, they will do anything to try to keep black people from being educated. Smh", "likeanangelbutnot": "\"I don't care how much money your paying your institution and the fact that it's private property, or the legitimate opinion you have regarding your campus. WE ALL MATTER and its OUR community 🙃🙃🙃 get the fuck outta here Ted 🤗", "prisi95": "Fucking colonizer lookin ass", "mrgilj": "Did he say move the campus !? LIKE WHITE PRIVILEGE SICKENS ME ! TF! FOH", "seijigay": "I cannot fuckin believe the caucasity of that man to demand the whole ass campus to move like wtf that campus is not a park for your dog to shit in!!! Just google another route it's not hard!!!!!!", "fracus": "“Our” and “they” ....", "love_yugen": "get on my damn nerves....its that version of diminished existing that keeps a world in the dark ages! SHOW SOME GODDAM RESPECT!!", "theeurbanrover": "Did he just Say move the campus????", "mo.chelle_": "Also.... I wish these reporters would stop saying “redevelopment” its gentrification... ok I’m done.", "shebowtiefresh": "Thats some bullshit! FOH & Fuck them dogs! Find a park to take them...period!", "brasroptional": "So fucking exhausting this shit really is fucked up and it’s going to get down played like fuck but Issa proble@", "quanmichelle_": "Move the campus?????????? Ah, Noooo walk your dog somewhere else. Wow", "rachi0head": "There is no “OUR” about mothafucking Howard University Ted!!!!!!!!!", "char0804": "Yet these same people aren’t willing to “work together” when there are “disturbances” within work hours mind you in “their” neighborhood outside a metro pcs store... cut the shit Bob.", "antigona_sanchez": "Fuck Captain Blackbeard! And his dog! WTF?!", "avid_daydreamer": "It’s all of your community, BUT ITS THEIR CAMPUS/HERITAGE/ SAFE SPACE etc so respect it !! You and Fluffy can step the fuck off!!! Literally", "bunnymichael\nVerified": "Verified", "lilrosie25": "Woooooooooow so incredibly violently entitled. You wanting your dog to shit on the grass of an HBCU to represent the University being part of DC, you're wrong and you're racist.", "rue____": "It ain’t no “our” you don’t pay no damn money to the school", "my.ka.lee": "There’s is literally a huge public park right across the campus. They are being disrespectful AF. Talking about move the campus. Oooooo this shit pissed me off!!", "nyahlevone": "I'm glad Ericka pointed out how violent the act was but let's not forget it was intentional. To get on that yard, you literally have to walk up on a hill away from Georgia Avenue. And he literally was using his dog to defecate on the achievements of black people.", "denengethefirst": "This happened in my former neighborhood when white men started moving in with their gourmet dogs. Sidewalks where kids once played and people greeted each other, to them was just a toilet for their dogs, now littered with shit. I had to move, it was so bad, they tracked that into the carpets in public spaces like it was nothing. #disgusting #entitled"}