{"imstevenx": "@thenomadicnympho I feel like you'd enjoy this page", "juliiabower": "@manuellascotton @_mollywilkins_ @positiffity this is super random but reminded me of phil 232! and i thought this pic was relevant and relatable when it comes to sex hahaha", "liz_arcturian": "Love this! Now this is real 🙌", "beeislemon": "I was watching Burning (a South Korean film) and they go to have sex and STOP and she’s like wait condoms are in the basket under you. And he fishes to get one and acwardly puts it on while the camera is still on their faces and torsos laying on the bed. I wanted to stand and applaud in the theater right there. It wasn’t a funny bit. It was just a cute reality.", "iamjesssanders": "@lilbabyxman", "maru_soup": "U really dont🌝🥤", "tryhardcomedian": "If you all like using period blood as lube just keep doing your thing, I think I might pass up on that one though. Considering I might faint from a little cut, being bled on by my gf would be kind of a turn off (both arousal and consciousness wise)", "nico.anfoo": "Cause people wanna see attractive people fucking, not a bunch of disabled people and weird shit because it is \"inclusive\"", "yourstruly.foundation": "LOVE LOVE LOVE THIS.", "fatgirldessy": "Wtf period sex 😪 dude thats disgusting and disruptive to a womans cleaning cycle. This world is crazy", "divaladybug": "@end_all_beat_all 😂", "kokichikinnie": "im so relieved to know these are normal & that my body just isnt being weird", "kody_folks": "2 words FART PORN", "breeeepad": "@amazingduckum", "amandavrivera": "PETS WATCHING!!!!! 💀💀💀💀", "amlorena": "It's so beautiful ❤️❤️", "rockdriguez17": "If someone changes mind half way through i'd prob kill myself lmao", "igamlynarczyk": "@dalilasdiaries 😂", "suebicho": "@piligilabert me recordó a nuestra plática de chavas y anticoncepción 💅🏽", "bwolftown": "@rixknx", "alejandrajoanna": "@karoluna04 @vanessaponce12", "clockworkmajyyks": "man i've seen loads of this in mainstream porn", "alannaveronicah": "@brendita231 😊"}