{"thhenightcourt": "i agrée with this and it’s definitely a race thing that there was no outcry about the black churches burning but the outcry about notre dame is about much more than it just being an old church it’s an integral part of france and it’s over 800 years old", "issyjuliette": "Both are sad but ya know Notre Dame is centuries old and a Parisian symbol that holds huge amounts of meaning, stop comparing such different things", "chloe_hates_people": "I literally live in Louisiana and haven’t heard about this :(", "mayonaise.jpeg": "They probably covered it on the local new sites but Notre dame was a national landmark that’s 800 some odd years old", "slicedsoap": "i feel like people don’t really understand this... both are very important, but one is getting more attention and support than the other and thats not fair.", "the_bi_wonder": "Bruh I didn't even know Notre Dame was a real place", "bowserjr.2001": "But Notre Dame was a historical landmark and was 856 years old. Those churches weren't. Stop trying to involve race into shit", "the.witching.hour.of.arcadia": "I didn't give a shit when Notre Damme burned down. Worse things involving ACTUAL REAL LIFE PEOPLE are happening everywhere else.", "kimgarcia.3": "I didn’t realize any other church of any religion or race was 800 years old like Notre Dame is.", "khadijaharbb": "And the al aqsa mosque was burnt the exact same time and no one cared. The mosque was 1000 years old and it was one of the most important mosque to Islam, but noted dame de Paris was brunt down before but that mosque was never", "gretayta": "Notre Dame was finished 70 years before colonialism?", "doreyjay": "The media has been silent about a black man throwing a white kid of the roof of a mall. Where is the outrage? It would be 24/7 coverage if a white man threw a black kid off a roof. The notre dame cathedral isn't a whites only church. Lots of different nationalities will go but yes its always a white person issue", "sulafs_too_popular_finsta": "The notre dame is a building that is over 800 years old. The French started to enslave Africans around the 1770’s. I get what you mean as but no, no not everything was built off of the backs of slaves.", "abbyreneebeckley": "@kilgoretroutgirl", "cjguti0731": "Notre dame is a international landmark that has been a staple of christianity for centuries.Comparing it to some church in Louisiana is retarded.", "assialay": "Fuck Notre Dame .", "mangoleira": "The truth is a beast. As someone who loved French culture as a child and recognizes after years of media-studies and analysis how POC’s landmark-violent destructions are ignored while one relic of the past has been ruined through nonviolent means.. well, there it is.", "smoon1822": "@ametoyer321", "jaojaoofficial": "Notre Dame was built long before France ever colonised other countries", "clayton.robert.windon": "Both should be rebuilt, but they should be church matters and should be handled by the church, the pope is a fantastic pope and will probably help any Christian building be rebuilt if destroyed", "zach.3246": "But they were outraged though", "dev0nsuper": "First of all the Louisiana churches have had little news coverage compared to Notre Dame and second Notre Dame isn’t just a church it’s a staple of French culture and everyone knows it’s name. The vast majority of people haven’t heard of these Louisiana churches so it takes up less space in their brain. For many people notre dame felt like something that would be there forever (my parents let me not go on the tour when I went to Paris over spring break because they’d seen it many times and expected i would get to too). You can’t expect people to have the same response to something they’ve never heard of and something everyone’s heard of and has been around since the 12th century.", "luzy.florez": "@laurajayflores Much more pressing matters in the world that need to be highlighted, rather than this building burning down that will (100%) be rebuilt (by the French government who were already renovating it) with or with donations by billionaires. The media coverage, influence of authority/celebrities and money could be spent of things that actually matter...like lack of resources, climate change, poverty or refugees (human being and not a building) dying trying to get away from war...", "balloinmascara": "Also that $300 million Euros got raised in *one* day to fix it just from French millionaires. I keep thinking of your point that if white people wanted to fix things they would — this is another example of that I think", "bennett_2134": "Uhhhhhh since when was France mostly built on African's?", "nesssaaa123": "@emmie.pine v good example of what you said the other day", "maudee": "My immediate thoughts..... when my friend said “be safe out there today” as if every day everywhere ain’t a battleground 🤔", "meri_chat": "My heart is still lies in Notre Dame but it also lies in the three churches, there's enough room in my heart for both", "whitneybbecker": "@dbeck712 also this! 🙌", "_._.daniel._": "WILL PEOPLE STOP BRINGING RACE INTO EVERYTHING FFS", "harrybltrv2": "But notre dame is 800 years old", "badcatholicgirl": "It was not built by black slaves, you fucking idiot.", "msmonipenni": "Yes to this 1000% It's made me physically angry that people have donated over £1 billion in two days for a building in Paris whereas when the Syrian refugees were living in absolute squalor, you had to beg people to help and they were shunned as a nuisance. If anyone denies such a thing as white privilege can take this as the biggest example of how it's still alive and well and ruining humanity.", "theweepingrose": "I am saddened by both for different reasons, for Notre dame, the loss of history and for the people of the churches of minorities that are destroyed by white supremacists. The public should show equal or more support to the churches of minorities that are being harmed.", "krystalrmrz": "The Roman Catholic empire was built on rape, death and stolen money on the backs of slaves. They are still one of the wealthiest entities in the world. I do not feel bad for them. Let them rebuild their own church.", "ellachester_": "4x older than America its a historical piece it’s sad the other churches burned down but this is the Notre Dame", "kaigasms": "The majority of Notre Dame was built 850 years ago... WAY before slavery, etc. So the caption is kind of irrelevant???", "thosewhowanderalwaysfindaway": "I actually just read that the donations for Louisiana’s church fires have spiked and I think you probably have something to do with that. 🖤 thank you so much for putting this out there.", "markusbas": "Because notre dame is 800 fuckig years old! It’s a legendary place", "firstnameandrea": "🗣🗣🗣 @judy25saywhat", "lindasteint": "✊🏼❤️", "bijgraaff": "@ihartericka - Exactly!", "that_kid_diego": "I don't understand how the Cathedral of Notre Dame was built on the backs of slaves when African slavery hadn't been adopted by Europeans yet when the cathedral was first built. It's not a race thing, its the loss of a monumental structure that has impacted France and the world in general for centuries, while the burning of churches throughout the US may be an issue, they are not the same issue and should not be seen in the same light. The only way they should ever be seen in the same light is if the cause of the fire at Notre Dame was hate-inspired.", "simcheongga": "@ihartericka France has Black French people in it. The Notre Dame wasn’t a whites only building. It was a historic landmark that was culturally and artistically important. You show clear ignorance in your post, along with others, over how “little outrage” was given over the black churches. Those three churches were not known Worldwide, or even by a majority of America. The story had a lot of coverage on social media, as most activism accounts posted about it. The Notre Dame however is a worldwide known landmark that draws tourists from all over.", "tara.nicole_": "Facts!!!! Just watched a documentary called 1804 The Hidden History of Hati. Very informative!", "flyingcurls": "@whentwo.r.butts", "dlanodcmwehttam": "Why does everything have to be about race tho", "_brain.damaged_": "That's so hiprocrite to say this", "xoxopeanutbutter": "I mean im sorry that i care i just really loved that church so the fact that it was burning down and falling apart was pretty saddening to me..im sorry if that’s racist though", "cwhitlock23": "Now this is getting ridiculous. It was a historic landmark. And the black churches got plenty of attention. You’re just blind because I saw it on the news multiple times 🤦🏼‍♂️. I’m tired of all this racism crap. White people do not have any privileges that blacks people don’t have. It’s sad because there used to be a time where African Americans were actually discriminated against and tortured. But that is gone and it’s disrespectful to call all of this “racism” when truly it’s not even close.", "r_thrutchley_": "The Notre Dame was built circa 1150 - 1350 and french colonization wasnt until the 16th century forward. We should definitely pay more attention to racism, classism, and the long term effects of colonization, but I think using a tragedy to propel your platform is more destructive than it is helpful", "new.account.who.r.u": "Ima say it again for the all non-black people visiting this page asking me to censor myself and become more digestible for their liking: FUCK THE CATHOLIC CHURCH, FUCK FRANCE, FUCK EUROPE, and FUCK THE NOTRE DAME; let it burn. Do not @ me.", "hotmessteaching": "This. 👏🏾👏🏾👏🏾👏🏾", "karinelipstickqueen": "Thanks for posting! This made me understand why I’m not sad / shocked by Norte Dame fire. I don’t care too much about ancient buildings, I am sad about people regardless or colour dying all around the world in wars, famine etc, this is horrific and distressing 😰", "__ir0n": "It's also funny how a building (no matter how important it is, it's still a building) can receive hundreds of millions of euros in 1 day, but when thousands of people die these big brands don't donate a cent. How many mosques have been burnt to the ground in this last period? The Aleppo Mosque was even older than Notre Dame. But nobody cares. And the same goes with people: how many thousands of people die due to France's colonialism? The hypocrisy. The president of my country said it right: France can't complain about immigrants until they get their hands off of Africa.", "ava_ntguard": "Um you’re going to post the secondary sources you’re making this claim from right? Because I guarantee you African slaves did not build Notre Dame. It was done by highly skilled (and paid) labourers and artists. I’ll be waiting for those links.", "stacdaed_": "Lmao yeah ooh ooh aah aah rAcism", "nickbrenneman": "It wasn't, factually, built by slaves though. Europeans didn't even make contact with Subsaharan Africa until 200 years after the cathedral was finished.", "yammmzzz_01": "I just want to know when is France going to pay Haiti back. That’s my only question/concern", "pazzaruss": "After reading alot of the comments... I dont see why i should now feel bad about the churches burning in America... I did initially. But if people gonna be saying shit then it just makes it hard to ever be unified.", "jaustyle": "To me a church is a church. Not a Black church or white church.", "demented_enchantress": "It's more the black churches I care about", "jaumekubshine": "Maybe that’s just because Notre Dam is famous. Not everything has to be about race ffs", "spotted_in_ny": "If anyone wants to donate, there's a gofundme set up for the churches: https://urlzs.com/6wbK", "lunestudio": "@moonandrock", "mags_sweetheart": "Don't really agree with the post since almost nobody got the new of those accidents, sounds more like we need te be aware that media doesn't always cover up everything that happens", "lucyjturner": "@jasmineshanice123", "deliabrown": "Yes. We all need to check ourselves! Also how about we freak out about the fact our entire planet is burning. 💔", "ludovicaoi": "The sentiment I read from this is “you can’t be sad from this because you did not get sad from that” instead of “I understand you are sad from this but I hope you understand that other non-European monuments matter too.” It’s easy to make an argument when you cherrypicked the examples. “white church vs black church or mosque” when in reality most of the people were shocked in the same way when the Museu Nacional was destroyed by fire or when ISIS and Al-Qaeda destroyed all those heritage places. We’re these examples of impenetrable whiteness? And here I was thinking Bel was a Mesopotamian god.", "survivingrcardib": "Yeah what about when napoleon went to Africa and destroyed the sphinx. Didn’t see too many French people crying then. Yawn.", "a_young_catholic": "And showing sadness with burning Churches if small or big doesn‘t mean you are racist just cause the church got build by whites", "__a.a_a.a__": "This literally isn’t true though, the majority of large news outlets /are/ covering both topics", "pacci_lv": "💯💯💯", "justice.mp3": "I think it’s definitely different. I’m not sad about Notre Dame however there were priceless artifacts and pieces that represent France itself. The crown of thorns that JESUS CHRIST wore himself was in there. A local church is not going to be able to compare. That’s like comparing cutting down a palm tree with cutting down the biggest and oldest tree (with tons of cultural significance) down. It’s not the same", "erinmorrrison": "I honestly do not understand this post.. you do understand that Notre Dame is the most famous of the Gothic cathedrals of the Middle Ages? I mean.. the building is so famous that it has a movie named after it. It’s only common sense that there is more news coverage about it. It’s not that people don’t care about Black churches in Louisiana being burned. It’s simply because Notre Dame is more well known, therefore it receives more media coverage. Both are extremely tragic events regardless.", "kristofferpetersen": "It lies with the Unesco world heiritage site - next question.", "mollflood": "@finnoulala !!!", "kim966s": "as a dutch art student i get really sad from the notre dam burning bc of the building but also the history. in general i dont watch a lot of news and stuff and even if i do we probably wont see stuff like those three churches in louisiana i want to believe that this is bc its in america and i live in europe. i want to believe in this because i dont want all this racism in the world and i just hope im not subconsiously taking part in it", "izzyiscuter": "nigga here be reachin", "_bbbbbbbbbbobby_": "Boring, boring, boring. You always repeat the same stuff and it is not even helping the people and the culture you defend. Sad and supersad that your topics always remember us to hate our culture. Your page is built on hate and autoreferral paranoia. I unfollow and hope to find a page that spread the message of white supremacy without rejecting everything is good on Earth, like empathy towards a city who has lost its oldest church. Peace. ✌", "ftthum": "This is perfect for reflecting on what usually lays dormant and unseen, to question our acceptance and values... this provokes us to awareness, and it may not be comfortable but that is okay. Good on you!", "3vecny": "Please fact check!! Because from one google search I found that Norte dame was NOT built from slaves mostly due to the fact that to build the huge buildings like that, the people building them would need to know what to do.", "pili_lopeznovoa": "Thank you for explaining this. I honestly had no idea about the three Black churches burnt, so I'm glad you could help me get that information, because the media is not providing any", "lolgsdbb": "@ihartericka okay so would you want people to say that the burning of the Louisiana churches doesn’t matter and that you’re making a big deal for caring ??? The Norte Dame is a historical church that means a ton to many people from france (of all races). let people post what they want about what they feel important and you can do the same for the other churches. The Norte Dame is getting so much attention BECAUSE it was a huge part of france. Help bring awareness to these other churches you care for by posting about them in their own light and not by bringing down the importance of the Norte Dame. thank you", "madeleine_03_": "While it is sad and horrendous these churches were burned down, Notre Dame is an 850 year old basically historic landmark which is known around the globe and treasured by many. THAT is the reason it has gotten so much media coverage, it is not a “race thing” or a “discrimination thing”. Also, many people who have not done research, including me, do not know the history behind the building of Notre Dame and the expense of the Haitian, African, etc people. Please think about the VAST differences between the two tragedies before you assume that it is a “racial issue”.", "rozengiu": "There were no black slaves in the 1100s in France", "bashcavity": "a church is a church, i dont see the need to have churches for different races. if theres an explanation that im missing I’d love to hear it??", "_jillianjackson": "WHAT??? I live in Louisiana and I haven’t even heard of this.", "crisftw": "It absolutely is a race thing that I haven't seen ANY news about the churches in Louisiana, but notre dame was built in the 1100's? Either way I'm sad that every news just talks about what happened in France instead of important shit happening here. Don't care much about churches, just suffering people and loss or life/art.", "kramseth": "💯💯💯💯💯💯💯💯💯💯💯💯", "amilee94": "@lexi.dalty", "owen___miller": "How is a 800 year old church with A LOT of historical significance behind it and beautiful architecture that took hundred of years to build being burned down anywhere comparable to 3 local churches being burned down by a racist in in the obviously racist and backwards state of Louisiana? Kinda makes sense why one would be more televised than the other.", "sseji": "probably because it took 200 years to build and stood for 800 years??", "ameenbelike": "this ideology is so fucking stupid it isnt even funny. So the value of one catastrophe can completely be nullified because of another that you claim society didn’t recognize as much? Completely retarded.", "_jenna.wera": "♥️♥️", "sean.woolley": "Why is it always about race, how come people cant just be shitty people doesn’t matter if you’re black, white, yellow, or red, if you’re a shitty person you’re just a shitty person and anyone who says race is an issue we need to talk about is not a part of the solution. And Notre Dame is one of the oldest churches not just a church but a historical landmark for all of human history as it was built in the 1100s till almost 300 years later so yea it will be rebuilt it’s sad when any church get destroyed or vandalized but to say that it’s a race thing is not right.", "plzzzjulia": "Also that the burning by white man is something the outlet hates hearing not tat the media plays with white supremacy but white supremacy was a factor here", "driedsweets": "The building of Notre Dame was done by Europeans as it completed at 1345. Not Black or Brown people . 1697 was when Haiti was ceded to the French. The French did a lot to make amends for the past, and believe that their future is to welcome persons like yourself into their country. Cut them a break.", "connor.dinh": "Saying*", "boltonhuggins": "You ain’t never lied!", "allysanford": "It’s utterly BS that no one has covered what’s happened in Louisiana, I want to be shocked but I’m not because it IS a race thing, my heart breaks for all of it. And the white psycho who is doing this will burn in Hell.", "vodker.n.tonics": "bruh if something like this happened to the pyramids or the Taj Mahal people would freak out too, even tho they weren’t built by white people. it has nothing to do with race, and everything to do with historical significance", "melaina.gill": "Ngl, I think most people are just a tad devastated bc oh idk it’s a beautiful 850 y/o piece of history and work of art??🤷🏼‍♀️", "alicep2016": "Right!! I stopped ‘liking’ it giving a thumbs up when people seemed to lose their minds over a (beautiful) burning building when murdered children get thoughts and prayers, murdered Muslims get an ‘Oh dear’, children killed in ICE detention get blamed parents, LGBTQ+ only get acknowledged if they’re murdered in a large enough group and murdered black people get the equivalent of ‘Look, squirrel’. I’ve visited Nôtre Dame and it’s truly beautiful, but it’s a chuffing building!!!", "fka_tuleerekel": "I heard that it was on fire and immediately thought to myself \"it was probably filled with shit they stole anyway\" 🤷🏿‍♂️", "airykaray": "Yassss 🙌🏾🙌🏾", "sagaravn": "I hadn't heard about the 3 black churches. 😕 (not from the US) Truly hope no one was injured. It must be awful to have your place of worship destroyed, wether it be church, mosque or other. 💔", "ash_sauce": "this post is like when y’all use one person’s murder or assault to ask “where was the outcry” for that of someone else. fucking trash. you look just as fake as the people who fake care about Notre Dame. garbage. fake woke ass post 🙄", "lisakellly16": "@noahpilonn", "peachgabbler": "Billionaires behind #Gucci and #louisvuitton pledged 300 mill a day after notre dame. Yet it took a massive campaign and 2 years to get global clothing brands to pay 30 mill after the #ranaplaza factory collapse that killed 1,100+ Bangladeshi workers making clothes for the children's place and other major clothing companies @cleanclothescampaign", "taylor.jhnsn": "hey,,,, pretty building burn down. i am sad. that is all.", "landen_joe": "Notre dame was built in the 1100s and why the fuck are there churches designated to black ppl? Also i bet your churches were built in like 1970 or something", "ej.rosenberg": "theyre both awful. though,,,, i am not religious but to see notre dame be burnt down made me sad because of the historg. i dont think its a thing between \"black and white\" people. they're both saddening tho", "stephanie_ldd": "Yup. Thank you for pointing this out.", "james.alloul": "Um actually notre dame was built before colonialism so pls get ur facts straight. Not undermining the horrific tragedy of those people getting burned to death, but a 950 year old building destroyed that has helped shape human history should not be ignored for other facts. As much as France has done horrible things to many different people groups, this is one of the absolutely incredible that the country has given our planet", "troyhave": "No I don’t, you need to check where your sadness lies", "jenniferbacsa": "@camille_betoulle hmm", "r.studart": "I feel as sad for the burning of Notre Dame as I do for the burning of the National Museum in Brazil last year (I am Brazilian). Most international papers didn't cover that significant moment in history (we completely lost one of our most important museums) and the problem is not so much that people aren't equally saddened by other similar events around the world, it's that they don't find out about them through the media. Any loss of cultural symbols of historical significance is a loss to our shared history as a species.", "lianopants": "Yessssssssss", "nycitydebra": "Here's how to help the churches in Louisiana: https://www.gofundme.com/f/church-fires-st-landry-parishmacedonia-ministry", "oliviapxa": "Both are terrible tragedy’s, however Notre dame is a historical spot visited by many people (religious or not) and cherished by many. One of the most famous cathedrals in the world therefor hit headlines.", "trevor_oh_man": "What is this disrespectful garbage on my screen", "djnebraska": "#facts", "linkalipski": "Hi. My research on Slavery at the time of Notre Dame built shows that Catholics actually suppressed slavery of christians (at the time it wasn’t a racial thing but religious). I also read a lot about how during that particular time the biggest flow of slaves was towards what they call the ‘Muslim Countries’ and that the highest proportions of slaves were usually natives. Non-natives would die quicker unfortunately and were more used for cruel entertainment I believe 😢. It’s only about the 16th century that African slaves were replacing other ethnicities and religions (from what I read). So Notre Dame would likely have been built by natives slaves and muslim slaves, although I can’t find any information on the history of the people who build the cathedral (between 1100 and 1200 something). I was so curious reading on this I thought I would share. Your post inspired me to look more into it so thanks. For one I didn’t know how worldly a practice it was until recently (I mean it’s still happening in some places but the world has improved) and that the treatment and concept of slavery changed so much throughout time too.", "oceanethecatfish": "The shock doesn’t come from the type of building but from 850 years of history. It’s a national symbol and actually it is famous way beyond French borders. It’s our history, our heart, and personally it’s many many childhood memories since I grew up in Paris.", "snommies": "shit i didnt even know about the black churches", "vale.draws.it.all": "It is not just a building. It is a symbol of the identity of an entire nation. As if the Statue of Liberty burnt down, but worse because of its history and beauty. Of course burning a church in Louisiana is terrible, but burning a symbol as this one is as if the Egyptian pyramids were burnt to the ground (and they were also built based off slavery). I am saying this with the utmost respect but it feels like comparing pears to apples. I am not Christian or French even, this goes beyond its Christianity or Frenchness", "draysterio": "Lol wtf. Yea the black churches burning are bad but notre dame had so mucb significance in the world. Its where Joan of ark began. It where napoleon became emperor. To compare one of the most historically significant places on earth to 3 other churches that just so happen to be black is incomparable. And no im not a racist. I've done a lot in my hometown to bring awareness to social issues and id like to think im an activist but these events habe nothing to do with each other. Stop fiending for something to cause outrage about. You do this constantly.", "whatishernametho": "Okay for one, black people can go to any church they want now. Two, it is THEIR money, if they want to pay for the Notre Dame and not Black Churches, then let them. If people want to pay to rebuild Black Churches, then let them. Don’t tell people how to spend their money, don’t be upset if people would rather pay for this church and not another. If you want that black church to be rebuilt, then YOU can go and ask the Louisiana government to rebuild the churches. Don’t yell at other people because they have different opinions than you. Grow up, and be mature.", "amyeloise96": "@estherellenbryan", "jmariegray": "I had these same thoughts. Definitely had to check my shock and sadness and be like....what else is the news not reporting, what else are people just brushing off.", "ryangadola": "This is the most ignorant shit I’ve ever read. Colonialism happened way after the Church was originally built and assuming the different renovations come from the profits of colonialism is also false. France is a beautiful country because of its rich history. Of course it has its dark spots in history but saying that France was built by colonialism is like saying Germany was built by the nazis. It’s ignorant, stupid, and disrespectful. People are upset because it is an iconic part of pop culture, history, and french culture. Since you’re obviously proud of your culture and heritage why not try to practice some empathy for the french people instead of attacking them for being a historically white country.", "murielle.lalonde": "It’s interesting that every tragedy now days seems to be twisted and blamed on a war against so called “white supremacy”. I guess some people need to find purpose in their life so they chase radical victimization. Is this the society we live in? Comparing tragedies really?", "sarasofija": "And ND will have the funds to be rebuilt anyway, it’s been rebuilt over and over anyway. They had no sprinklers or fire walls in that medieval timer “forest” roof so did they ask for a fire.... Those roofs would burn all the time during its time. Ffs now they get to rebuild it safely. Unlike black and indigenous and muslim communities.", "jerzsey": "💙💯", "majesticpharaoh": "🗣🗣preach", "floorplayyoga": "🙌🏽🙌🏽🙌🏽", "jess.breathe": "@_grave_witness_", "kaufmandavidnyc": "There weren’t African slaves in France 850 years ago when note dame was completed", "hyacinthiz": "I'm shoked and sad not because i'm racist but because of the historical significance that got destroyed.", "decmoto": "hate Europeans don't use things invented by them or live in their systems of goverments", "aquafare": "I MEAN....EXACTLY ERIKA EXACTLYYY", "afromermaid": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "dantorchic": "I'm living in France and didn't even know about this until someone mentioned it on a talk randomly. Like zero fuck given. 😒", "ratty.loops": "I live in Louisiana and I don’t even know this. Wow.", "soulwithbeauty": "❤️", "iazver": "I agree with you 100% about everything except the notion that people disagreeing that it’s a race issue is “emotional abuse”. I feel that saying that is disrespectful to victims of abuse in relationships and belittles what they experience. I say this as someone who struggles to this day with PTSD from an abusive relationship. Granted, I don’t know the content of the messages you receive and I am sure that many are indeed abusive", "baara_z": "All of you here are looking at this from an American perspective and seem to not understand how we see it here in Europe. It really cannot be compared to the lousiana churches. It is a completely different context. Here old buildings like Notre Dame are very deeply embedded in our culture and identity. A symbol of France was destroyed because of an accident. It was a pinnacle of gothic architecture of an immense artistic value. You keep dragging the Catholic Church into this but i can assure you that’s not what it symbolizes for us (at least me, im atheist). On the other hand there are the small, average lousiana churches that were burned in an act of hate crime. Terrible thing, but absolutely not comparable. It is a completely different thing. You keep saying that it’s about race, but ND was built in 14th century long before colonialism, i just dont see the link. Of course French collonialism was terrible but what does that have to do with anything? Ppl are shocked because a building that stood there many hundreds of years before any of us were born, symbol of french and european history and culture and a place that people were coming to see from all over the world was destroyed. Not because they think that “white culture” is better that non-white cultures.", "ana_____italiangurl_23": "AND W.E AND and chruch here bash religion shit them and not shit on poeple spirtual. and didnt and seelectieve outragge and cope diffrent religions diddnt relgiois poeple get down attacked . said poeple inside building burning rip sad and huamsn", "lcsouthwick": "Exactly. It so IS a race thing. As is every other damn. When one group is treated as second class citizens in every fucking way possible- it’s a damn race thing.", "goud.job.claire": "As a devout Catholic of French heritage, why would I not be upset that a location sacred to me was partially destroyed by a fire? I understand you having a problem with the media's lopsided coverage (I certainly do as well), but to the people in the comments who keep saying \"let it burn,\" that is extremely offensive to me and my religion.", "lucadb1": "Notre Dame was built 866 years ago !!! You can't blame what our ancestors did all this tim back, many horrible things are done to people even to this day ... It's not just any church in france it's the center of Paris this the km 0 (mile 0) That is where all the road in france star from ... This is the place where they celebrate the end of world war 2. This Cathedral (not church) has for sure way more history than any churches in the US since none of them are older that the Notre Dame Cathedral. Non the less it would be great if the media raised more awareness from those white terrorist. And showed more what happens in poor neighborhoods (black or white or any other race). There should not be such a word like \"race\" ... actually we are a human race ... not white or black. What European did to Africans all those years ago and still today is disgusting ... but we have to try to past that and come together as human race!", "lilameyg": "yes france was built on the backs of African slaves and that is wrong i am in no way defending them and what happened to those three Black churches is outrageous and wrong and i’ll be honest i didn’t know that happened but believe i am shocked by the events but the difference between the Black churches and notre dame de paris is not the races of those who use/built the building it’s the fact that notre dame de paris is a historical monument that has lasted for 9 centuries with indescribable beautiful and highly valuable pieces of art (as well as religious symbols), the burning of notre dame de paris is not the destruction of some white church it’s the destruction of a piece of 12th century art (that also happens to be one of the main symbols of france, arguably even more so than the eiffel tower, no biggie) it would be like loosing Leonardo DaVinci’s Mona Lisa because it’s a loss of cultural heritage that was left to us. Again, what happened to the Black churches is outrageous and i am in no way whatsoever dismissing the burning of those religious buildings because it obviously is of great importance to those attending the church, but it is important to remember that if there’s a general sadness it is not because of the loss of a church and religious building but above all it’s the loss (ok partial loss) of cultural heritage and the loss of one of the most important pieces of art", "space.candie.baby": "I wish I’d hear more on the news or social media what’s happening in other communities I was just sad cause to me it’s beautiful but I think that bout most churches. But it hurts me more to know someone would burn places of worship on purpose. I’m not religious at all and I think it’s wrong people need their faith and beliefs especially that to them it’s a place to feel welcomed", "jay.bay.bean": "Thank you for sharing this. I had no idea that happened in Louisiana.", "pawfectday": "Amen to that!", "wackydiscolizard": "don’t some people live in notre dame tho", "harianasethi": "I’m sad for the people affected by the Louisiana church burnings, but to criticize our priorities just because it didn’t get as much attention is just close minded. You have to understand that Notre Dame is a historic symbol, regardless of what it came from. I’m sorry but there are more people in the world who care about an international historical artifact than an incident in the US. Dozens of injustices are committed daily around the world that no one hears of. It’s unfortunate but it’s true. Also, I bet any you and everyone in the comments would have visited Notre Dame if you went to France and posted some picture with it on Instagram even if it was built by slaves. Why NOW all of a sudden you care about the history of Notre Dame? If it was that important shouldn’t have something been said before? I don’t understand why has to be the core of every issue in this world, even as a Mexican woman. Can we not be upset about the fact that we just lost a world artifact that millions of people visit every day? I’m sorry but I think we should be able to.", "hayden.klingler": "Notre Dame is a historical monument that’s been around 900 years. You act surprised that people’s attention are shifted to that. those black churches aren’t things that are put on the spotlight cause it’s not global news. That’s something you’d only hear about in the area while any person over the age of 20 99% of the time knows what the Notre Dame is.", "silverfish234": "Yes, it s sad notre dame was destroyed but what sadder is children dying because of poverty and war.", "jessicakehrer": "glad to know we have to pick and choose what deserves sadness and what doesn’t", "lisamoonlove": "Absolutely", "dennis_morgan29": "The problem is that you make EVERY tragedy a reminder of what awful people did centuries ago. I’m not in any way, shape, or form defending what colonizers did. Regardless, this post is total bullshit. Not everything in France was built by Haiti/Togo/Niger people... the Europeans didn’t get to America until 1492, so HOW THE FUCK would Haitians ve involved in the construction of Notre Dame? Same goes for Togo and Niger. Europeans didn’t really invade Africa until later. And fun fact, most of the slavers in Africa where Africans themselves that would hunt down other African tribes in exchange of weapons and various other artifacts from europeans. Africans traded with slaves because in those times, there were African tribes just as evil as the men who colonized America. But if course you wouldn’t know that. You clearly think everything in Europe was made by black slaves. What a joke. Learn some history, then comment about history. Also, the world mourned more for Notre Dame because of it’s historical significance, which is PARAMOUNT to the way Western civilization, including you, thinks.", "s10.vdbogaert": "The Notre Dame is not only a giant church. It was also a building full of art, paintings, statues,... I think that it is sad that people react this way. Yes, it is sad that someone burned down 3 churches in louisiana, yes it is sad that people were used to build this church, but every church has used people. Thats just how it was in that time. If those people cry about losing something, let them cry. It might mean something for them", "otterlydelicious": "I totally had a moment of “omg that building is like 900 years old! So much history....wait...history of genocide, rape, torture, intolerance, hate, ignorance. Let a bih burn!”", "zchieftata": "100%. I don’t give a fuck bout what’s going on over there when no one cares bout what’s going on over here. All my attention on my people here", "thepamperedmuslimah": "Truth.", "kirsten.kae.connelly": "💜", "jerickson85": "Exactly.", "geeteear": "looks like someone wants to start a race war 👀👀👀", "takeaholladay": "truth!! i am not sad for this symbol of western christianity/colonization/whyt supremacy to burn, not even a little.", "dog_eat_dog_": "As european I guess that Notre Dame isn't just a church. It's a symbol. It was built in XII century and survived ww1 and ww2. Seeing a symbol like that burning has broken a lot of sensitive hearts despite the religion they have. Can you figure out this?", "ambrefontana": "As a French who's spent summers in Paris, you cannot compare human loss to a historical loss. Also check your history. Notre Dame was built 850 years ago. That's before Africa was even discovered. You consider yourself to be all righteous yet you can't even take a second to look up some history. Congrats, you're as ignorant as Trump supports.", "tameishiap": "❤️❤️", "thestarsinger": "All people pulling out their half-ass history lessons and anthropology classes to minimize the lives and culture of Black people is how you see white supremacy in action as the living breathing mechanism it is.", "franzwat": "I need to repost this sis'@ihartericka please 🙏", "ashgravesroesler": "Thank you for sharing this. ♥️", "titlivearnaud": "hamadou ampate Bah once mentionned an old african proverb ; \"an old man who dies, it is a library that burns\". Its a bit the same way we feel when we see Notre Dame Burning. This building was part of our common memory.", "jenifferdoru": "👏", "siiamhamilton": "Was just another physical manifestation of European Colonialism and white supremacy. Colonial landmarks are burning to the ground and I’m not mourning the loss.", "reillybrennann": "I can’t", "prose_and_khan": "A friend brought to my attention that the pope who commissioned the notre dame also mandated the forcible conversion of africans to catholicism. I’m not interested in the symbols of a culture that intentionally wiped out the culture of others.", "carlynwhitten": "I am white and agree with everything you are saying. Just want people to know that we exist and don’t want to be lumped in with everyone else.", "_erikamarie": "YES", "la.fillee": "Honestly I didn't even think of the church Notre dame is (I'm not religious), just Notre dame as a very old building and one of the world's most famous sights... some feel sad about this and that's okay, so don't shame them! Even if you say that it's okay to mourn about both, I think that you don't mean it. It's so so sad what happened in Louisiana, my thought are with the people there. I live in Europe and before this post, I haven't heard yet about this incident. You are right, we should bring a lot of attention to it.", "ericapajarera": "👌🏽", "mashfest": "@chelseaitall", "__moreferalthan__": "💯 real 🖤🖤🖤", "logan.j.j": "From what I saw people were pretty upset about the Louisiana church burnings as well", "numpycat": "Actually, I did need to check. Thank you for pointing that out. Sorry that you had to.", "lukapesun": "But it is of great cultural value and historical importance that we wrote into it 😂", "jasmin.tayo": "But why do we make everything a race thing? I'm tired of this.", "brandonsmith.arts": "Facts", "nadia_rondon": "@miguel_andradevaldez somos racializados date cuenta!", "evierusco": "@mollymdm", "skippinreels": "Everybody's so afraid of talking about \"race things\" ... And this is why there are more posts about an old building going up in flames than there are about real things happening to people and communuties like blatant racism and hate crimes. White fragility is a dangerous and blinding phenomenon.", "duhhhellie": "fr", "solassona": "Thank you for saying this. Now let me go break the news to my white community so they can begin the process of redirecting the grief they’re feeling about a gdamn building into something real. I thought we wanted to watch the patriarchy burn, no? 🤷🏼‍♀️", "theroguewarlockmonk": "The only thing I can think of is that scene in bunch back of notre dame where that priest tried to burn Esmeralda and he fell in instead and I as my great granny would I don't give a shit anna half dime.", "dirtybow": "This is so real. Plus, Notre Dame will certainly be rebuilt and allocated lots of resources to do so. I was sad but thank you for helping me check myself.", "_ganjavibes_": "Not to mention all the negative things that actually happened there, corruption ect....the earth is cleansing 🙌 no art shall stand between new soil. Old stories will be reborn into the new world. 🔥🔥🔥💚True 🙏 s Of many being answered when fires burn.", "theprettieyez": "I live just minutes away from one of the churches that was burned down. Your post is exactly how I felt yesterday.", "susebraids": "Thank you for saying this. It pains me when worship spaces are destroyed. Literal sanctuaries are violated, disrupting communities. It breaks my heart. 💔", "chi.tattoo": "France and other European countries destroyed a LOT of African monuments in colonialism times and before...so...yes I'm kinda glad🤷🏾‍♀️", "betaniafeliz": "@ihartericka Thank you for making me evaluate myself every time you post. Do any of your followers attend those churches and have preferences about how to help? Want to help, but not in my historically white way. It's my understanding those churches are  Mount Pleasant Baptist Church in Opelousas, La; St. Mary Baptist Church in Port Barre; and Greater Union Baptist Church in Opelousas.", "rachaeamber": "Yep", "basicstitchdesigns": "Let's not forget about the Brazilian museum fire that destroyed language and cultural artifacts from indigenous people who were destroyed/subjugated by Western imperialism/the Roman Catholic church. Where was the public outcry there?", "smart_perspective": "✨👌🏾Had a similar conversation with a friend this morning. Yes it’s sad but so is raiding the pyramids and refusing to give back artefacts that were stolen and pillaged. Napoleon was the one who shot off the noses of the Sphinx’s in Egypt. How many french nationals are sad or are in morning about that too?? 😐😐 Sometimes you have to afford people the same level of pity and attention they give to you and from what I gather or understand France only cares about their own #PSThisCareDoesNotExtendToTheirColonisedCountries 😔", "rubendavidxd": "Notre dame is one of the most important cathedrals of the world lmao", "madelinmattli": "Wow I had no idea, that is so sad the freaking erasure 😣", "rebeccalewishogan": "Thank you. This is so spot on. 👏🏼👏🏼👏🏼 Sharing with my white followers.", "slynbutter": "Talk the tings!!!", "lilyjane17": "Amen.", "chubby.brown.kink": "👏🏽👏🏽👏🏽", "hotfruitness": "Agree! The French gothic architecture was cool but what does the Catholic Church Have to repent for? Pedophilia and patriarchy and much more. Not to mention it was probably built on the back of oppression and slavery. Just saying. i can’t understand how people think things are more important than people and recognizing the injustices", "emma_raneborn": "What I find heartbreaking is that the Notre Dame is not like those churches, the Notre Dame is older and have more history than some countries (the US for example). I'm saddened that those black churches burned down, that we did not hear about it. Those were probably burned down from racism, something that makes me cry daily. But the Notre Dame is The Church, I'm not religious but Notre Dame is a cultural symbol for all of Europe. I don't think Americans quite understand that and what we lost. This is not about race, this is about history and culture. If it was a white church in the US that got this much attention I would be furious, but dont make this something it is not. It is not terrorism, it is not about race, it was an accident that destroyed a landmark. It is as if Lady Liberty burned", "thee_candidate": "@tswiffa", "hnnfhskdkakd": "when i heard notre dame was burning i wasnt that sad and i couldn't understand why people were so devastated... to me its just a building lmao. those hurt by the colonization deserve better", "kikipike": "Is it supposed to be racist to find out about the destruction of a national monument before I find out about three random churches in Louisiana? Obviously it’s terrible but buildings burn down all the time. Not all of them have any historical significance. And the fact that Notre Dame is a church isn’t what makes it important, it’s the architecture and the history.", "thewanderersspirit": "Last week?! Damn I didn’t even hear about it.", "jwally325": "I get what you are saying but they are totally different things. Notre Dame was built in the 1100s and is the most famous example of early Gothic architecture. It was the seconds most famous church only to the Vatican. It’s significance to the world was way more known and soooo many irreplaceable items were forever destroyed.", "theeurbanrover": "For Really tho😂", "skimdo": "Thank you", "bodhimyteacher": "💔💔💔", "kayladaylamayla": "Still a sad event. Someone’s hard work burnt down:( cur he’s don’t have color. They are places of god.", "thebruja_": "How about feeling bad for the people of Paris? That's why I'm.sad considering they've been thru a lot ..empathy and compassion is needed..we cant have the same mind set as they had before us history will repeat itself .", "erinjbasler": "I was struggling to place exactly why I feel numb about ND (numbness being a whole other issue). The \"but priceless art\" argument doesn't resonate at all. Thank you for helping pinpoint the dissonance (as per usual).", "jrazar": "I’ve also seen more outcry over Notre Dame - especially from public figures - than the 50 Muslims that were murdered in Christchurch. I’ve heard no public outcry about the Louisiana churches either. There are more people worried about a historic church burning than black lives being attacked in churches they might have went to everyday, with their kids and families. This specific outcry, surrounded by all other recent events that get no attention, just further proves that anti black/brown sentiment is raging. Thanks for sharing your thoughts, always.", "wellsoulwellness": "It's an architectural & historical bummer but I also don't really care. I don't care about any catholic church building that houses abuse, secrets and cover ups or that represents such abominations. 🤷🏾‍♀️", "leilalaughsalot": "Wow I didn’t know this :(", "cheezydoesit": "This. Exactly this.", "kamouraskal": "On doit se parler de ça @sannapasdimportance", "theweeniewaggin": "@mindspinn here’s a good read on the point I was making with my post.", "suzanneforbesartist": "I was thinking the same thing. I respect the grief over the historic art and architecture, but churches, mosques and temples that are the hearts of living communities are being destroyed in hate crimes, and that deserves more attention.", "willowdaliance": "Terrorism continues against historically black churches and it is an outrage, to say the least. ALSO- I Had no idea these 3 churches we’re arsoned! Where is the headline????????????????!!!!!!!!!!!!!!!!While I find the burning of the French Catherdral disheartening it does not compare to the horrors I feel of the arson committed by a Deputy Sheriff’s son-“Some of those that work forces, are the same that burn crosse!”zD", "___iamstephanie": "@tresposh", "adam_kraus_18": "Ffs still the Notre Dame is THE church in europe", "proto_.type": "I thought I was the only one", "russie1": "@ihartericka Thank you!!!!! You are spot on", "ahousecalledhue": "Honestly that's how I felt so I kept scrolling I don't even acknowledge that that shit is burning 🤷🏽‍♀️", "mckennah": "I was thinking that this morning too. Thank you for articulating it. Also the fact that the entire world can become aware of something within less than 24 hours proves the power of the media and the people. Too bad it can’t be about things that truly matter. 💔", "jamesbudday": "I was plenty outraged by what happened in Louisiana and sad at what has been buried by the news cycle time and again. I bang my drum for this constantly. You are 100% right.", "kenziewiththekurls": "@boofreaky she’s spot on every freakin time 🙌🏽", "dpdobsonsmith": "Thank you for this important reminder! I’m sorry I have to be reminded. 🙏🏻", "beatupsuburu": "We need more coverage on things like this.... i shouldn’t just be hearing about this now", "woman_king_": "This helped me check myself, thanks for sharing 💖", "mslewan73": "Exactly that’s what my husband and I were discussing last night.", "mswizja": "@sunofman57 🤷‍♀️🤷‍♀️", "orcrug": "🙌🏾🙌🏾🙌🏾", "kieranblake": "Yes. Yes!", "mskeet269": "I thought the same exact thing !", "katertotthegreatertot": "They’re still finding the bodies of native children in shallow graves outside of catholic boarding schools that have been shut down (recently) in Canada. Burn this pos to the ground and never look back. Al-aqsa mosque burned yesterday as well, it is the third most important islamic monument in the world.", "angela_brandenburger": "That’s how I felt when I saw the Vatican. I was a bit sick by it all.", "seafoto13": "Exactly.🗣🗣🗣🖤", "chanel_porchia": "🙏🏾", "amyvirginia": "100%. The moment someone decides to argue against your point is the moment they choose to deny their own inability to value human life, specifically black and brown human life. Thank you for sharing. 🙏🏻", "zelue": "i completely agree and my husband was saying this last night. whiteness is impenetrable and black and brown space are disposable... wow that’s a whole word right there", "playparamore": "@johv zu deiner story auch", "ben_kirton": "WTF 😶. Thank you for sharing this, I had no idea.", "roamifshewantsto": "You’re so right", "der.matthew": "♥️ !!! So true! 👍🏼", "mimosa_mistress": "Thank you for posting. Something was bothering me about everyone posts yesterday and could not figure out why. This was it", "bigblackpants": "My sister and I discussed this yesterday...", "thealyssascott": "I was thinking the same thing", "mamanomato": "I would just like to hear someone sometime say that 1 -slavery didn’t happened strictly in a black (Africa)-white (Europe) domain 2 - slaves were captured and sold by other local traders (also black) 3 - slavery continues to this day in Africa done by Africans to fellow citizens 4 - what has Notre dame to do with all this ?", "revjeskast": "Here is a link that provides opportunity to help these 3 Black churches rebuild. Some here may be interested so I am sharing: https://www.gofundme.com/f/church-fires-st-landry-parishmacedonia-ministry", "sunshineandcoconutmilk": "Thanks for putting this out there. After seeing all the posts about Notre Dame I felt really unsettled and then I realized it was because of the scale of everyone’s grief. It feels outsized and misplaced and 👆 is why.", "tinalovesloki": "that's just spot on in so many ways", "gabcab09": "What I find funny is that you clearly state that you can be shocked and saddened by BOTH, but people are still getting upset when you push their minds to critical inquiry about the news coverage and our very definition of “culture.” I just finished teaching Things Fall Apart for the 10th year in a row. The timing is interesting, and I can’t wait to ask my students to reflect on this.", "shetheeking": "Yo but like. The notre dame was way more well known then those churches were. This isn’t a race thing. If it was 3 white churches being burned down by a black person and the reaction was more severe than that of the black churches situation, that would be a comparison. But you’re comparing THE NOTRE DAME to three churches in Louisiana. The cultural/historical significance is not there. Not because they were black churches. They were just generally less culturally significant than the Notre dame lol. It’s like comparing the destruction of the Statue of Liberty to the destruction of three local commemoration statues..", "thegrassprincess_": "Thank you for saying thissss 😭🔥👏🏼", "ygwspam": "this is literally an internationally recognised cultural monument, calm tf down", "igobydidi": "@motherofindigoandprince", "climbholamel": "Thank you for this. I had the exact same thoughts as I listened to the coverage yesterday.", "lestoner__92": "Girl i feel you. Idc and im not shocked", "baguetti.spaghetti": "Can we just allow people to be upset about Notre Dame without bringing in other events? I am absolutely shocked, saddened and disgusted by the burning down of 3 historic black churches, and I agree that it should have gotten more coverage in the media. There should be no downplaying of how horrific it was. However that is a separate matter to what happened last night. Its just a completely different matter, there was no racism or anything like that involved, and it was not a terror attack. Its just the fact that the Notre Dame was a symbol of France and its survived through German bombing, and two World Wars. Ofcourse people are going to be upset by it. Its universally well known and loved. Can we stop comparing everything to each other? Ofcourse theres worse things that have happened, but just give people their moment to mourn over the loss of the Notre Dame as it was before the fire.", "gordolola": "Wholly fucked", "mauronica26": "@pattycwalton", "patouchka1": "Facts!", "missfee": "Thank you!!!", "miejohanne": "@karenmulleer den her verden 😫", "chocolateenoir": "#RP", "assuredanswers": "❤️❤️❤️❤️🖤🖤🖤", "awesum_opposum": "It lies in the fact that Notre Dame was older and historically more significant than all those churches in Louisiana combined.", "hausofcorvus": "Truth!", "abi.ianthe": "I’m from London. I’m furious at the amount of attention notre dame is getting, when in 2017 a high rise block of flats housing mostly low income people of colour burnt down. Just over a mile from my house. It burnt all the wau through the night. And i can still look out of the window and see its remains. 72 PEOPLE DIED because the government/local council decided that not to spend money on cladding that was not flammable but instead was so flammable that it essentially accelerated the fire. Grenfell Tower burnt for over 60 HOURS before being fully contained and yet people are quaking about notre dame. Yes it’s sad but it will be rebuilt in no time. A french millionaire pledged 100 million Euros to help rebuild yet the burnt remains of grenfell still stand", "lior_vibe_feeler_art": "👏👏👏", "nebulahnature": "This whole post AND caption. LAWD👏🏾", "pancaketheoctopus": "At first i was skeptical about this post and the caption, but it’s really important for us to see that we should lament the loss of all historic buildings, since they are infinitely valuable for all humanity. But this is the problem, historical black buildings that not only are destroyed but that are purposefully targeted in racial violence are not seen as terrible loss for the one reason that they are spaces belonging to black people. This post is not telling you not to be sad about Notre Dame but is calling out how the world stage turns its back to burnings of black churches. I admit i don’t know how old these churches were, but we must also take into account that Notre Dame is ancient and the reason why people are paying attention to its burning isn’t exclusively because it’s in a european country. The historical and artistic losses are also something that, personally, affect me the most. But it would be childish to ignore that the racial bias is the main reason why the attention Notre Dame is recieving is so desproportionately large at a global scale", "norabacily": "@zeikschrift naar aanleiding van je stories tag ik je even. Wellicht ook iets om bij stil te staan?", "skeeterrobinson": "🎯❤️✌🏾", "lynekalittle": "The race thing for me is simple: I cannot allow the inhumanity of others to shape my humanity. I have no horse in this race when it comes to feelings because everyone has the right to feel things. I mourn the loss of history. When looters destroyed the Cairo museum and when bombs take out people and places, I mourn the destruction of life and architectural structures that are lost. I'm a people whose saw attempts at destroying its history because taking a people's history id an attempt to destroy said people. I will never get on board with that. I feel all the things. That is me to the core. And, for myself, I refuse to allow myself or my empathy to be shaped by those I'm openly critical of. My grandmother would be sad today. I am sad today.", "sazzlegazzle": "On a slightly different note, don’t want to be coopting because I think it’s for the same reasons, but there was nowhere near as much public outcry when Grenfell happened, where 72 people died. Particularly as there are about 400 buildings in the UK that still have the cladding on that caused the extent of the fire. People just don’t care do they?", "bigbadbanshee": "Oh come on!!!!!! Ridiculous comment. Notre Damn is a gift to the world of art and architecture and human spirit. NOTHING to do with race. This is inciting a hateful response to a world tragedy for no reason.", "gracesugarskull": "I don't think that's anything to do with back or white or religion itself. Most sad people are sad because is art, a very old master piece full of history, not because is an actual church.", "blacknerdgoddess": "I thought about this, too. Especially after they shared Trump & Pence’s reactions to it.", "kendrahilty": "@gozzip_gurl_xoxo", "pixel_tricks": "I was just thinking the same thing about all the historical and beautiful buildings destroyed in Syria and Iraq. But Notre Dame is the one the world chooses to be heartbroken over.", "rebekkamacht": "Thanks for putting this into words. Had an argument with my siblings about this yesterday and you said it perfectly", "p_cox": "I thought that all day yesterday.... also a mosque burned yesterday (another historic site)but hardly anyone mentioned it. Then I think about how much more cover this gets than human lives being lost every day and I’m lost as to where our priorities lie as a society.", "cinefastic": "Well said. Encapsulates what I’ve been feeling about all the attention the hunchback has been getting. ;)", "tmsmith82": "@lsdenson ✊🏿", "gracelilajane": "Paris is burning ⚡️", "chenai": "And people have already forgotten what’s happening in Mozambique - an entire town underwater thousands dead etc. our tragedies are easily forgotten.", "thepagesintheword": "Turned to my partner and said: ‘Why don’t I care?’. They said: ‘Same. I just don’t have the energy or interest to care about this with the other things going on.’ Most of it is just people getting hyped over what the media shoves in their faces. It’s trending and on all channels, so I’ll give it importance. Little thought to the evil that happens in buildings like that or the evil that built them and pays for their upkeep. Nothing sacred about places like that.", "scott.pocket": "Did they catch the guy who burned the church? I saw that they had a guy in custody but did he do it?", "wiggleandthegang": "I was kind of shocked to see so many people talking about it. Yeah, it’s sad, but a lot of sad, distressing, fucked up shit is happening in the world right now, the least of which is an old building catching fire.", "morestacerae": "It is a race thing. Thank you for all you painstakingly do.", "dierrahughes": "Great minds think alike 🙌🏾", "jennysimonson": "Not to mention all the native sacred land that has been stolen and desacrated in just the last few years here", "radskillz": "💯💯💯💯💯💯💯💯💯", "theo_riviere._": "The reason I wasn’t sad about the black churches in Louisiana is because it wasn’t on the news in England (where I live) so I couldn’t", "marziacelodie": "I'm sad to read that. I'm french And it's not the Church who made me cry. It's the beauty of the architecture and thé symbol of Paris. It's a part on our history burning. I understand your argument but in that moment I find this selfish. Black history is terrible, a lot of people suffered because of white people but to speak about that now and saying all those things... It's pure selfishness", "kasey1290": "@wryprincess read", "sarahmacchamp": "You're so right! The three churches were a blip in the news cycle, with more of a focus on the white supremacist who burned them. There were no tears she'd by the media of the historical relevance of those churches, at least to my knowledge. People were beside themselves today about this church.", "arikahs.jewelry": "Yup I had no emotions... flipped the channel and carried on... especially when I saw that people were crying crying...", "teslaknits": "Thank you 👏🏼👏🏼👏🏼", "mommy61608": "It's pretty inside. But dass it.- Thanks for bringing this up. It's easy to let people around you morph and Influence your feelings. People forget or have never known these facts.", "hunterandraine": "Spot on!! I was thinking about this all day. Everyone is so sad about a building burning, but no one cares when actual people of color are suffering and dying.", "aqua_slvt": "@drgstr", "teganmarie97": "It hurts my heart that they don’t report on this stuff 😔 thank you for talking about the topics and events that mainstream media neglects! Just because it causes discomfort to those with privilege (a fact which I know I am not exempt from) doesn’t make it any less real and if anything makes it so much more important! So thank you!", "theimmaculatewitch": "@scottbbaird there are some really good points in here about the loss of Notre Dame! Take a read!", "thegypsetter": "@ihartericka I wholeheartedly agree and specifically blame social media who dictate what’s “trendy” to grief or mourn. As far as Notre Dame is concerned, to most it was less about a church, but rather a cultural landmark and an architectural gothic marvel. Furthermore, unlike the less-than-savory slave practices that bore Egyptian pyramids and Roman temples, most of Notre Dame’s workers were paid artisans. But in order for workers to cash in on those famously deep pockets of the Catholic Church, a reliable payment system was a must. I however still can’t fathom how structures are more worthy of mourning then human lives, and how equal architectural and historical art marvels have been totally dismissed, such as all the ravage isis did in Syria and the savagery committed by colonial countries against every cultural artifacts in the country they invaded!", "kirstyemma1987": "@li.li.lc made me think", "amyjowisehart": "Thank you for bringing this to my attention.", "larana89": "My thoughts EXACTLY!", "allicat247": "This is why I felt nothing seeing it burn!!!!", "random_blavkgirl": "As I french myself I had the exact same reaction. Everyone being dramatic so dramatic and sending prayers and thoughts for a freakin' building yes its symbolic and culturally important but so are people fucking dying everyday because of France neo-colonialism system in Africa. I'm sorry but i can't even seems to care, when everyone telling me that i should...people were literally crying in my thoughts, everyone was watching tv and expressing their sorrow on social media and I was like yeah...maybe if we were as outraged and moved by our colonial past we would have already paid reparations where its due and we would be doing a collective effort to desmantle neocolonialism. As a french myself I felt nothing. This cathedral is the symbol of white old heterosexual money.", "daisystubberfield": "The nose of the Sphynx in Egypt was shot off with cannons because they couldn’t show that African people were idolised enough to have a monument like the sphynx created in their image. I am upset by Notre dame, and heartbroken for the people who have had their places of worship destroyed, and angry that colonialism and white supremacy have prevented monuments that celebrate black and brown people are not given the same reverence that white architecture (built on the backs of black and brown slaves with no acknowledgement) is. I have to make more of an effort to search for those monuments because they are just as important to humanity.", "allhaillola": "I heard it was burning and was like welp the Catholic Church has more than enough money to rebuild and went on about my bidness 🤷🏽‍♀️", "inshallahfeminism": "Oh, my god! I love you! Thank you so much for saying this! All the outrage — grounded in white fucking privilege.", "bel.kamkaze": "just thank you @ihartericka so much truth in there", "zambianactivist": "It’s funny how people defending their mourning of a church built by slaves are using the fact that it was historic and demeaning the black churches as if they weren’t historic also. News flash, they were. But white supremacy has a huge role on what is considered historic and what isn’t. So thank you for agreeing with white supremacy, people who don’t think that black churches aren’t historic like Norte Dame.", "kristytblack": "Thank you. This definitely made me check my privilege.", "ryan_transforms": "And of course the suspect is a deputy sheriff’s son 🙄 Not surprised", "tristapisani": "Love this post", "enne.chey.92": "@susanhensey", "kelseyeberth": "@_amanda___thompson_", "samantha_rodrigues02": "So you complain about people not sympathizing with the burning down of the other churches (probably because they weren’t aware), but why didn’t you post anything about the burning down of the other churches? #justasking", "laurenrei": "👏🏼👏🏼👏🏼YES. Also the fact that abortion was banned in 3 states and Texas is fight For the death penalty for woman who get abortions. The. Death. Penalty. Our priorities are way the fuck off. You are so damn right this above is absolutely a race thing.", "paper_and_pulp": "Mike Pence on Notre Dame - Seeing a house of God burning is a tragedy. Mike Pence on the Louisiana church arsons - 😶🤷🏼‍♂️", "spideygirl91": "💯👌🏽", "lynsi711": "Motherfucking thank. You.", "sonofruth": "🗣PSA for all the \"valuing your oppressors' historical spaces more than your own\" headasses", "mojomowtown": "Right now, I’m Australia, our ex PM (a white man) is encouraging people to donate their money to a fund for the Notre Dame fire (he also cut foreign aid while he was PM). Meanwhile, 800 year old Djap WIrrung birthing trees that are sacred to the nations first people are about to be bulldozed to make way for a new highway. this is a disgrace 😡", "shylamoma": "@_operadiva this!!! 🙌🏾🙌🏾🙌🏾", "thriftikristi": "I said this exact thing to my partner!!! 👏🏼👏🏼👏🏼", "la_so_nasty_xq": "👏👏👏👏👏👏👏👏👏", "freethabeast": "I wouldn’t go as far as to say I mourn the architecture, especially because I’ve never even seen it, but I can understand how people who have or people who grew up with that as a part of their life feel and they are valid regardless of what their ancestors may have done to other people that doesn’t make their feelings invalid. However I also mourn for those that suffered the loss of the churches in the south. But at the end of the day I look at all of it as a reflection of the state of organized religion and it’s continuing decline as we evolve beyond such archaic institutions 🤷🏽‍♀️", "perfumistasf": "The reality of reminder check most of us needed, thank you Ericka. I’m shocked and saddened by both.", "kati.amberry": "This!!! Seems so many people only care about the tragedies that allow them to post old vacation selfies.", "chakramum": "Lol what about all the ancient buildings destroyed in iraq, where is insta then", "farishaali_": "So fucking true. It angers me that mosques and some of the oldest cities in the middle east lay in waste from the actions of governments and not a single major news outlet \"mourns\" for these structures. Black and brown people and culture is constantly left in the dust and deemed less than by the white privilege and racism that exists at an institutional level. It's fine to be sad but people should definitely wonder why this is \"more sad\" and receives more attention than the rubble and waste caused by white majority nations in black and brown countries.", "chickensrbirds": "When I first heard that Notre Dame was burning i was surprised that I was not sad honestly- Without going into a big tada here right now (which I could just ask anyone lol) I will say this - A revolution requires you breaking eggs at the very least", "lvrsrck": "🙏🏼❤️", "sarah_.j._collins": "Yes what happened in Louisiana was tragic but Notre Dame is a 800 year old church with extreme historical and religious differences. There is a big difference between that and a local church.", "magglio2": "Yes you are right mmhmm keep on talking friend!", "jazkat13": "Was literally thinking the same thing earlier.", "jessiejames1331": "@littlepinch reminded me of your post", "tigersturtle": "Honey, I wasn't even phased. Someone brought it up in class and I said something similar to what you posted and they were like but all the history... so i said 'well your outrage over this church is akin to my outrage over the lives that were lost in the churches and the children who were a used in the name of the religion you represent'. Yeah we stayed away from each other for the rest of class🤷🏽‍♀️", "xx_moobaby_xx": "Christians have knowingly destroyed thousands of culturally significant memorials to non-white, non-western religious groups for thousands of years and the irony definitely is not lost", "abbey8194": "Those churches should have gotten the recognition they deserve and I’m sorry they haven’t. Racial discrimination is a real thing and everyone should recognise that, not pretend it doesn’t exist. I’m sorry for your pain but thank you for sharing what happened to those churches. Nothing about this situation is ok", "allieschwenn": "As always, your posts are a checkpoint in my head that I didn’t even know I needed. Which is embarrassing to admit. Thank you.", "meowbroadway": "@basicstitchdesigns 🙌🙌🙌", "annieroseq": "@mayah_hatcher the Notre Dame was built by craftsmen and paid labourers.", "ourintensivelove": "👏🏼 Amen ... so to speak...", "amandakhiri": "THANK YEWWWWWWW DAS WHAT THE FUCK I SAID!! Why do I care that a state funded hiding place for rapists and abusers burns? I'll fuckin dance. Where's the drum circle.", "akirophoto": "🗣🗣🗣", "hausoflita": "👏🏿👏🏿👏🏿👏🏿 Tf", "loveleeintegrativewellness": "@franceypants75 😞", "sejalbarai": "Ouch! Did not know that! Dammit!", "lovefola\nVerified": "Verified", "newfauxhemian": "Thank you.", "tickledsunbb": "exactly what i thought. where's the outrage and tears for the black churches lost to arson?", "nicolegpatterson": "Check and check. We need more of these reminders. Thank you.", "luv_brandi": "Bloop. Bloop. Bloop.", "shan.ivyy": "Nothing but facts", "y.eso": "You're right, girl 👏🏽", "donna234rae": "Right.", "punkpebble124": "The fact that I didn't even know about the church fires at all pisses me off I'd like to be concerned about those peoples hardship and loss all lives matter my ass #blacklivesmatter", "freddiemercurysmustache": "I think a fair number of people in the US are mourning it because of the Disney movie. Notre Dame might as well be EuroDisneyland’s Epcot."}