{"marglaza": "I’m so happy for y’all", "dr.kholi": "Make sure you give her alllll the things to chew. Like to set a chewing habit for her so her teeth will stay awesome longer than most small dogs. Make a system of consistently giving her things that are hers (and also being in charge of taking them away). So she can learn agency, but also learn what is hers vs yours and that you are pack leader. And you know I could go on and on. 😂 ESPECIALLY when it comes to treats and food.", "trans__mutation": "Ohhhhh my god it finally happened! Of course their fucking name is Baguette 💗", "zoeeatsflowers": "Pit bulls are life but this lil Aries is cute I guess 😭💖🥖", "hoe_of_ky": "Shop don’t adopt y’all! Lol 🙄", "imaliteraljoy": "AWW GEE 😍❤", "eringrahame90": "So happy for you guys! A dog changes your life - mostly for the better. Consistency with toilet training and socialisation was the most important thing for us. And not expecting perfection. Is she/they eating raw or dry food?", "sugaring.brooklyn": "My advice is that you bring this little angel with you next time you come over!", "a.monique29": "Puppies are a lot of work!!! They are just like children they need all the cuddle time, BUT, Structure, Structure, Structure, my baby boy is sooo spoiled but STICK with a routine!!!", "annelise.beach": "@raina_ingrid I want this doggo", "_syzygy_______": "Omg 😍😍😍😍😍", "the.sacred.self": "Omg 😭😭😭 the sweetest baby. Congratulations to your beautiful little family 🥰", "mjexpressions": "@ihartericka as a fur dad of three, my suggestion is simple: patience. 💕 You are now the parent to a fur baby who will never mentally be older than the equivalent of a 10 year old. Lol. Be patient with the nugget, and schedules are a must for any training (potty, crate, commands, etc.) Enjoy enjoy! 🤗 Love y’all to life", "mdcolbee": "One small piece of advice: watch your plant babies! So many common household plants are toxic (some even fatal) to dogs and cats. It's important to look it up and know which and make sure those are out of their reach as puppers like to get into whatever they can. The ASPCA has a good list of toxic and non-toxic plants.", "edenclark": "So wholesome 😍❤️", "lyd.roe": "Omg so cute!!! 🤯", "livinginthisqueerbody": "@khalifashouse", "dya_co": "So y’all just gone surprise us with this baby? 😩😩😩❤️❤️❤️", "sixid": "Wowww I was NOT prepared for this level of cuteness. Congrats on being dog parents! 💕", "debbiesnacks00": "So so so cuuute!!!!!", "j.riceroni": "😍😍😍", "clihkin": "hi if possible can u make a highlights story with your rant about GoT from yesterday? I want to share what you said with a friend thanks 🙏🏽", "hrsmnts_watchambassadors": "Hey Ericka, great Instagram! Love the vibe. Wanna collab? DM @hoursandminuteswatches and tell them we sent you!", "hannah_christine96": "Too cute! ☺️👍🏻❤️", "rhiannonnewman": "Advice: train, train, train and correct poor behaviors early. Establish yourself as alpha and don’t let any bad stuff slide.", "pinknacl": "Keep you panties off the floor!", "secretultram": "😻😵☠️💗💗💗", "misskillemrox": "She looks like my Hazel! Is she a shorkie?", "dionne_______": "Oh that last picture took me OUT! The gaze! The LOVE! 💕 🐾 😭💜", "pidgeo_n\nVerified": "Verified", "ney0nce": "So adorbs", "fragments_of_fi": "Omg... The cutest! 🤩😍💖", "sewer.girl": "This is so wholesome", "motherheartsangha": "So sweet!", "instagrak": "The last pic looking up at Ebony like hiiiii dadddddyyyyyy", "sonyareneetaylor": "GERDDDDDD THAT PUPPY IS SOOOOO CUTE", "croptopgoth": "all three of yr beautiful faces 😭😭😭", "jukeyboxx": "If the pub cries out when you’re trying to get them to sleep in their new space, you can wrap a ticking clock with a towel and put it close by.. It sounds like mamas heartbeat and makes them more comfortable 😍", "vinvinlives": "My heart! The cuteness!!!!😍😍😍", "fridasskold": "Oh no it's too cuuuutee! 😭😭 😍😍", "erickaeckles": "♥️♥️♥️♥️♥️♥️♥️♥️♥️", "destheblack": "Gotta do a doggies date soon!", "wellmade.nutrition": "OMG 😩💔 the cuteness of this little fam", "bzmama65": "Such cuteness (all three)!", "chronicallyerica": "That last picture 😍😍😍", "aorists": "my HEART", "c______yp": "Ahh!😍 So happy for the 3 of you.", "_christievazquez": "Let that baby sleep in bed with you FOREVER. Crate when you aren’t home, but waking up to puppy snuggles is the best choice we ever made", "melonskies": "Congratulations!", "satansblackgirlfriend": "omgggg", "gingerschocobo42": "You three are adorable.😏💚", "itskiki_xo": "She’s So precious 💓💓", "knitwithme": "Just when i thought you could not be more adorable. ❤", "jvolsson": "Soooo cute", "provvelociraptor": "You named her baguette??!!😭😭💓💓💓", "amandabartch": "OMG SO CUTE 😍 lots of patience, positive reinforcement, and be consistent. Y’all are going to be great puppy parents what a lucky baby 💕", "croyster912": "Start training now and keep them away from the plants.", "karamcqb": "Eeeee! Too much cute and beauty in these pictures!! ❤❤ thank you for sharing!!", "stencilista": "Congrats! I’ve been working in the veterinary field for 12 years and the best piece of advice I can share is to get pet insurance! At our veterinary hospital we recommend Healthy Paws or Trupanion. I have insurance for my pets, despite having a major discount for working at a vet. It’s totally worth it, because those babies will throw you for a loop!", "julieta_salgado": "😩💕", "roguepoet_": "Dog daycare attendant here. Take her everywhere, get her used to dogs, cats, people, crowds, everything in between, and as many noises and sights as you can expose her to and as early as possible. Make sure she associates as much of it with positivity as possible. (Carrots are a great non fattening treat to use here FYI) Ignore bad behaviour and praise the hell out of ALL wanted behaviour consistently. You’ll probably see this everywhere but I can’t stress how important proper socialization and the ability to self regulate becomes as they grow. Being assertive is not the same as being “mean” as well. You and your dog can have a wonderful loving relationship and can train without any force while still being assertive and respecting the roles you two play in your relationship. Crate training is a must as well. A well trained and stimulated dog with a job to do, no matter how small, is a happy dog. Check out stimulus challenges on dog training accounts- some of them are really fun and your pup will have a blast with them.", "crystal_cave": "😍😍😍", "maharvie": "Yah!!", "carolinekj0nes": "congrats!!! that’s one lucky pup!! I don’t have much advice since I haven’t had a pup since 2005, but know that it’s okay to make mistakes. at the end of the day, the two of you will always be perfect in baguette’s eyes and you will always be that baby dog’s world❤️❤️", "k.elseyk": "I agree with the comments about crate training— great idea. Also, Kong toys that you hide a treat inside are great for puppy energy and chewing tendencies. I would suggest getting little mini treats for positive reinforcement/reward-based training (sit, stay, come, etc). Teach her to stay out of the area while you’re eating if you want to avoid future begging. Socialize, socialize, socialize!! I would suggest watching some basic training videos on YouTube before issues even arise because they’re overall a great glimpse into dog psychology. Being the best owner you can possibly be is definitely a learning process but it’ll set your lil family up for success :) Good luck!!", "notsosocialsharma": "Don’t let her puppy face get to you. As difficult as it’ll be, be strict now so you don’t have to later. If she’s teething, keep your favorite shoes and socks beyond her reach. Animals don’t care about organic food, feel free to feed them normal dog food or scrapes off your plate but feed her in her bowl at all times or she’ll get used to jumping on you (or your guests) when eating. So excited for all the licks and love that’s on your way. Happy parenting!", "moutarde": "💕Welcome to cuddliest club ever. 💕", "sharlenekemler": "Milo can’t wait to meet his new friend", "skobos": "Positive reinforcement training for everything! Always have treats in your pocket!", "ashangrila": "Awwww soooo cute! The way they are looking up at Eb in the last picture 😭", "jerrickahill": "Baby wipes are a really good substitute for a bath, especially for things like other dog’s drool caked on the fur, or a muddy undercarriage from a rainy day walk.", "fara.oana": "OMG 😲😲😲hope 🥖X starts feeling at home with you too soon ❣️", "itscyndel": "Get X accustomed to brushing ASAP! That soft fur will gets matted faster than you can imagine! I waited too long with my puppy because he would chew the brush 😂 so I thought he needed time to mature, but then training him to be brushed was dramatic! Best of luck with her!", "queenof_melani.n": "Baguette X😍😍😍😍😍😍😍😍😍😍😍😍😍Imma steal the puppy", "emma_bosley": "Get pet insurance now! Both working in the vet industry and having two dogs that have had major surgeries and chronic issues, IT IS WORTH IT. In case you don’t know, pet insurances will either not cover pets or charge exorbitant fees once they even have been diagnosed with something as innocuous as an ear infection. Do it now before that adorable puppy eats something, gets a UTI, or needs surgery. Love to you and your new Baguette! 🥖", "mybodywpg": "😍😍😍😭😭😭", "dumplingsinbed": "@allthingspups is a great resource for free training videos!! Baguette is a real cutie 😘", "nataanii_": "Fuck 🧠🔥👌🏼", "reenbean": "Soooooooo adorable! So happy for your beautiful family ♥️", "science_kristen": "@delukious this is the cutest dog", "rileyandlunaadventure": "All the chew toys! Setting boundaries and teaching them young is so important. You guys are going to be amazing doggie parents and that is one loved baby.", "lisahawks": "Oooh that baby got you", "thebrownbunch5": "Yay!! I have a little cockapoo too. They are so smart, good natured, gentle and eager to please! I would suggest that whatever door you'll be using to let her outside to use the bathroom, put a bell hanging from a string on the door and before you take her out, use her paw to hit the bell and then take her out to \"potty\" and eventually she will associate the sound of the bell with using the washroom and begin to ring it herself to let you know when she has to tinkle lol! 😅 Ours picked it up quickly and it was really helpful to us in her house training. X is adorable!! Best wishes together! 💖😍", "chubbyavrillavigne": "OMG THE FAMILY❤️❤️❤️❤️ this is toooo sweet !!!! 😍😍😍❤️", "vexedinvelvet": "Congratulations! Cutest little pup 😭💕", "de.vorah": "OMG! Mazel Tov!!! 😍  I have tons of puppy advice if you ever need any help! I am a dog trainer and would be happy to give you any info I have! :) DM me if you ever want any specifics! :)💗 Biggest piece of advice — create positive environments and teach puppy to enjoy learning before teaching specific skills or tricks. They need to feel inspired to learn/safe first, that way it feels fun and not like a chore (this is a little different when you train working breeds) . :) Most of it is common sense/psychological once you get into it! 💗  I always remind myself and others not to scold or punish young dogs unless you are absolutely positive the dog knows what you are asking for (and don’t scold harshly ever, as I am sure you already know! Try to redirect vs. scold with young dogs... think “I see you tried that, let’s try this instead”) — so, if you just taught your puppy to sit, don’t say “no” to the puppy until it’s been sitting for months and really understands the behavior. :) 💓💗💓 The two of you will be amazing puppy parents! Congratulations! L’chaim! 💗❤️💗:)", "imgonnawinn": "So cute!😍", "ariesvenus13": "I am going to fucking implode", "nicolee_farrell": "Ahhhh my heart! So happy for y’all 😍", "katiekatielady": "What a doll!! Congratulations on the baaaaby 🥰", "sierrawgarcia": "Aaahhhh! Congrats.🎉", "pinkflame666": "Ahhh 😭😱", "rati_femina": "Omg. So cute.💗 Just raise the puppy u feel is best. With love.", "amarachimera": "Im in love ❤️", "jace_menzell": "It’s dry, but read The Culture Clash by Jean Donaldson. She’s at the forefront of the fear-free/force-free positive reinforcement training tip. All based on behavioral science and fostering confident happy dogs! Guide for everything from potty training to socialization, etc. Socialization window closes at 12-14 weeks, so it’s especially important to take puppy to experience as many new people, things, sounds, other puppies, etc with LOTS of constant reinforcement so that they learn the world is a fun (and not scary) place. Hit me up if you’re looking for more specific resources!", "erika.anne": "CONGRATULATIONS!!!!!! My fave training books are by the monks of new skete - the art of training a puppy and how to be your dogs best friend. Best advice for forming a bond is tie a leash to your waist and have them follow you everywhere even at home - they learn to look to you for what to do 😭 and that most behavioral issues can be solved by letting them sleep in your bedroom so they feel the pack bond. The unconditional love of a dog is one of the best things in life, so thrilled for you 💜💜💜", "kieranblake": "I cannot!!! ❤️❤️❤️ Omg!!! 😭😭😭 so happy for all three of you!!!", "raquel_dia": "If you need a dog trainer, Twahlee is the best @metrodogtraining ❤️", "kadiesurri": "Beautiful pup", "birdsandbones": "Congratulations! The love in these photos is gorgeous, the people - the puppy - so much beauty.", "becoming.emilee": "Ugh 😭 giving me puppy fever. 😫❤️", "saren_grey": "OMG!!! 😍", "sunkissed.fina": "Lil nugget, so cute 😭❤", "mujerplanta": "Ok I fucking love baguette, she def needs her own ig! 🌼🌼🌼", "peaches_nclaire": "Cockapoos are the BEST DOGS YES", "kingagetsherlife": "Love at first sight! 😍", "itsvikkikate": "Eeeep she’s a babe 😭 I have two cavapoos and they’re the best thing in our lives 🖤 When she starts wanting to eat everything in sight get her an antler! They love them and are virtually indescribable! Enjoy her whilst she’s teeny even though it can be really hard work, I’d give anything to spend a day with my boys back when they were babies again! You make a dreamy family ✨", "haileymama__": "😭🙌 beautiful family, congratulations!", "jankuziel": "Ok cutest dang thing ever! Congrats!", "thedevidasi": "Oh my godddddd", "mylesgilm0re": "😍😍😍", "msadetoro": "❤️❤️❤️❤️ - I got my kids, then I have my fur baby- they steal your heart!", "marcijnyc": "CUTENESS OVERLOAD!!", "adventuresinkindergarten": "That’s the cutest puppy ever 😍", "bk.bap": "ooooooohmigod", "leighannmick": "Big Tip! Every time Loaf wakes up, take her outside immediately. They almost always need to pee when they wake up. Even short naps that are one after another. Tinkle!  Saved me from a LOT of clean-ups, and moved potty training along faster.  Congratulations 💓🧡💓", "samanthahorn": "Omg. So sweet!!!", "kitschyfemme": "Gahhhhh that face is soo cute. Awww the best family! Congrats on the pup! Also, May your plant survive their new sibling! 😂", "alaina_francis": "❤️❤️❤️❤️😍😍😍😍", "inheavensname": "So cute", "beyhivemember": "Congrats!🎉🎉🍾 I ❤️❤️❤️❤️❤️ dogs. They make your life so full...trust me", "totallypuppywhipped": "Puppy faaaaaaaace!!", "djcrystalclear": "What a CUTIE PIE!", "gtidiva": "Too cute!!! ❤️❤️❤️", "kristenregier": "Congrats!!! Baguette is beautiful and so adorable😍 I have a cockapoo myself and found he was REALLY high energy for the first year (still is pretty high energy at 4 lol). We had to keep him stimulated and honestly took him for 2-3 walks a day which helped keep him a bit more manageable! The breed is so loving and friendly, as long as you socialize baguette, they should be very good with other dogs (and people) ☺️", "mrz_hudson": "I’M YA PUPPY ADVICE GIRL!!! This pup is THE CUTEST! Tip #1 Be patient and know she’s doing what she knows and you have to teach her how YOU want her to behave ❤️❤️❤️ I want a snuggle!!!", "nadiaisabellla": "Omg!!!!!!!💖💖💖💖", "kafeder": "Awesome👏🏻👏🏻👏🏻👏🏻", "shuturp": "I have the same dog but her name is toast 😂", "girlscoutboy": "Someone has definitely probably mentioned this but- Training from the get go is so important!! The pup has to know they are at the lowest level in the pack and you are the alpha. Otherwise you might have a million and one issues with peeing in the house and biting and barking!", "coach_key": "😍😍😍", "magitaitaita": "Baguette is adorable and has a great name! Things that helped me with my small dog (I had a husky growing up but now I have an Italian greyhound): front-clip harness—mine is SENSE-ation—helps with teaching how to walk without going all over the place, and a dremmel to file instead of clipping nails. Also, get started brushing teeth because smaller dogs have more dental issues and doggy dentists get expensive. Finally, I highly recommend crate training, our dog has a little separation anxiety and it helps having a set routine for us leaving the house. Congratulations from this doggy helicopter mom!", "danielletridenti": "😍😍😍", "ilizahartley": "You got a puppy!!!! 😍😍😍😍 So cute 🐶🐶🐶", "secondcremiatwin": "Congrats on your super cute addition! Also that name! 👌🏻❤️", "mtroisfontaines": "Welcome, sweet Baguette X!!! You darling puppy! How precious. Congratulations to you and Eb! Watch out, that little one will take over your heart! 💖", "saltwaterclub": "Wooowwww!!!!", "lcsouthwick": "Omg adorable!! Maurice the baguettes!!", "geminitheflowergoddess": "WHAT WHAT WHAT!!! YASSS🙌🏾✨", "trdmrk79": "Awww picture 3 is so precious! Must frame it!", "aminsomnia": "Pet pet pet! And brush them a lot too so that they get used to it and don't panic when in the groomer!", "ameliavhastings": "Amazing!!", "missfield999": "As if you two could be any cuter 😍😍😍", "heycaptain": "AHHHHH", "alexisangelini": "We were always told when we got our puppy to ring a bell everyone you take them outside to go to the bathroom and as they matured a little more to put a bell on the door you use to let them out so they can hit the bell, signaling they need to go out! ❤️Congrats, too cute!", "dye_oh_log": "Ughhhh 😍", "eduardoplacer": "What about the plants? How do they feel?", "tarockamyworld": "😍", "inespatrick": "she’s so cute!", "katherinefequetyoga": "Clicker training was a HUGE help for me when training my pups :)", "mjohnxwll": "Congrats you two❤️ lots of good advice here. I second reading books - anything by Dr. Patricia O’Connell, Dr. Ian Dunbar, Chirag Patel, Karen Pryor. Definitely find a puppy class early on as the socialization period ends at 5 months, but make sure to seek out trainers that are CPDT-KA and/or KPA certified. All the best", "adellarp": "Yayyyyyyyyyyyyyyyyyyyyyy", "wanderingfeminist": "😭😭💕💕💕", "knoepf.chen": "Oh my god I caaaan't!!! Precious pupperino 😍😍", "r0wdygal": "Omg baguette", "stellamaunsell": "Oh my Lord I want shared custody of a doggo 😍", "skeeterrobinson": "❤️❤️❤️❤️❤️❤️", "k_a_v_t": "AHHHHHH!!! So happy for you!!! Can’t WAIT for more puppy pics!!!", "beyondrosetta": "😍😍😍 the best book I know about to help humans understand dogs is called In Defence Of Dogs by John Bradshaw, HIGHLY recommended for first-time puppy owners who need to navigate training & bonding with a young dog. aaaaahhh congrats! 🐺🐺🐺", "mx.samsantos": "Aaaah what a cutie pie! ❤️", "jivancaa": "wow i love baguette", "hillycooke": "All the love, right there. 💗", "blxjss": "Waaa so cute", "manuela_ceapoblete": "💜💜💜💖💖💖💖💖💜💜💜💜 heart set to burst! cutest trio", "instasamilou": "Awww yay for bringing such a cute little nugget into your life! I would definitely recommend going to a puppy training class - it’s not just good for you to get expert advice, but it’s great socialisation for your pup in a safe environment 😊 also, you can never give tooooo many (training) treats for positive behaviour. No matter how small, puppies have terrible memories it would seem it it will take weeks and months of treats for them to finally be like “awwww, peeing outside is best!” 🦴", "vinyasa_with_zoe": "You three 😍", "true_to_tania": "My trainer friend made us read \"Before you get you puppy\" - dr Ian Dunbar it's the most terrific education for owners and makes training your new furry family member so rewarding... we couldn't be more grateful...our dog home is so happy and chilled and joyful because 9f understanding each other", "audrainscotland": "So cute!", "georgiasdarcy": "The look of love in that last photo! ❤️ Goddamn you guys are wonderful ✨", "ralislel": "Omg !!!! Yay family !!!!", "resus_christ": "Ahhhh I’m crying. What a beautiful curly baby", "marilynaraujoo": "the 3rd picture is EVERYTHING 😍 Y'all look so happy I'm excited for you!!", "candygreene": "Awwww SO cute! Love that little baguette already 😍", "therecoverycloset": "Oh my, baguette is the best name and you're such a cute family 😭", "bounce_n_jiggle": "So cute, I'm dead.", "thehuxleycollection": "OMG her eyes just melted my soul 😍 She is beautiful. In looking forward to the many puppy photoshoots to come. For advice, I highly recommend getting toys/ puzzles she has to solve to get food. I feed my dog 1/2 his food in the bowl and the rest he has to solve a puzzle for. Currently he has been into a large dice he rolls to get his kibble. Its stimulates his mind throughplay, its funny for me to watch, and most importantly- it's great distraction for at least a few minutes haha", "monst.ana": "The luckiest dog 😭😍❤️", "cocolaosin": "Yo I’m cryin in the club 😭 (in my house, in the couch)", "tadzooki": "wow at first i really thought you were just holding a plush puppy toy", "betayd": "congratulations !! Be mindful that some bigger breeds such as greyhounds (sometimes even labradors) will think your pup is a toy or a rabbit. My pup got attacked on the street by a greyhound still on lead. Just something to be aware of !!!", "withkellybennett": "😍😍😍😍", "kanndissriley": "😍😍😍", "liziswhatitis": "I’m so excited for the stories 🐶❤️", "rainbowvintagehome": "Ahhhhhhh the cuteness 😍😄😙", "maruskaalbertazzi": "I think she’s trying to steal your boyfriend 😉❤️", "livia_von_namibia": "Omg wayy to cute lil teddy dawg!! 😍", "annianarchy": "😍😍😍😍 I’m in love", "caityriley_": "OMGG THE CUTEST!!", "thisrawsomeveganlife": "STAAAAAPPPP😍😍😍😍😍😍", "campbellx": "So cuuuuuute", "hadialaghsini": "Oh my god you’re all so so so beautiful 😍", "rayanarwhal": "😍😍😍", "oshkoshmygosh": "Congrats!!!", "gdejoie": "As a puppy they will shit and pee on your whole life 😭😭but it’ll be worth it. The love and puppy breath kisses are unmatched. Decide if you want them to go outside or pad train cuz once they pad trained it’s hard to switch (my Huey I’ve had since a pup & will almost only poo on the pad inside but pees outside 😂)", "amnaeatsyourface": "Baguette is so so cute!!!!! Congratulations!!!!!! 💕", "ggrraasssss": "Lots of toys and things to chew on!", "j_a_zarifian": "Cutest little ball o fluff!! Just be patient and consistent!! And filled with love!! 💜", "nina_tame": "Oh my heart! You three 💕", "astridmrkich": "Omg!!!! Tiny pupper! ❤️❤️", "rockyb4you": "😍😍😍😍😍", "sonja_1988": "Ooooooooo my goodness! ❤️❤️❤️❤️❤️❤️❤️ Yay!!!!", "lynekalittle": "No puppy advice, except she'll eat all your shoes, but you won't be mad because..sssooo cuuuutteee. I have a #cousinpuppy", "leura__": "OMG SO CUTE!!! 😩😍 Start training now!!! So much easier to teach them early on so they are set up for the future, you will be surprised at how quickly they can learn 😊😊", "eriiiiiiiikka": "Yay!!!", "ceesando": "awww", "missmaxbez": "The last picture of Ebony! 😭", "stephaniemadeit": "😍😍😍", "lizloveslizz": "💛💛💛💛", "mariariotgrrrl": "This makes me so happy you guys!!!!!! Fuck yess 😭❤️❤️❤️🥰🥰🥰", "metricdisco": "Omg so cuuuute!! 😍🐶", "ms.kiki.108": "Use puppy peepee pads to train where they are going to do their business and be consistent with walking outside. A beautiful puppy! We had a cockapoo growing up. Smart and easy to potty train.", "_designatwork": "Protect that beautiful Joy Bird couch with ALL the plastic and liquid proofing. Puppies pee eeeeeeeverywhere. Every. Where.", "destiny_laurice": "Cockapoos are smart and loving dogs! I had mine for 17 years, very excited for y’all 💕", "hi_this_is_tania": "😍 What a darling!!!", "bosstaughther": "Anything that’s cute now won’t be cute 5 months from now seriously just say no ! Owner of two three year old pups one is a Shih Tzu the other a boxer & let’s just say they have WHOLE overnight puppy bags because they are just that umm “spoiled” one only eats out of one bowl you don’t have it he won’t eat literally! The other can’t sleep without a cover 😒✨😩🤣🤣🤣🤣🤣 @ihartericka congratulations being pet owners is fun 💕😍 they are on my insurance 🤣", "healwithbroocke": "AAAAAAHHHHH❤️❤️❤️", "papayedreamer": "YESSS 💘 my advice if they pee in the apartment don’t scold them just clean it up immediately and take them out they will learn by themselves no need for harsh methods 😊", "kelseygoodknight": "Yes!!", "mcmeliacrassanwich": "doodles are the BEST!!! 💕🥖🐾💕🥖🐾💕🥖🐾", "sophie_hines": "Touch their hands and mouth and ears a lot, so when you have medicine or brushing or step on a bee or whatever you can do it easily.", "chavez_ash": "Advice: don’t hold him too much during the puppy phase they become more protective/aggressive as adults. Happened to two of my friends pups and it’s harder for them to socialize with other people", "radele_e": "Hnnnnnngh", "cherylannc517": "Your smiles! 🥰🥰🥰", "teeth_and_other_drugs": "The last pic is so precious!!", "kelly.shaw.nyala": "sweet family!!! #INSPO #TRUELOVE 🥰🥰🐶🐶❤️❤️", "bethannnelson": "Congratulations!!!!", "nikkikiddvocals": "❤️❤️", "therealcurlyhippie": "So freaking cute 😍❤️", "cubanagram_": "Their little face 😭 congratulations parents!! You’re doing amazing", "alemope": "OMG 😱😱😱😱", "musicanimal4": "Squeeeeeeeeee!!!", "_babygold": "Crate training is a must to prevent separation/isolation issues which is stressful for you and the dog. Speaking from experience with my rescue!", "winstonelliott": "So cuuute! 😭", "mini_sar": "That last photo though! and the expressions in the second! The whole thing! I cannot wait for them to start taking on your all’s expressions. 💯❤️🐶", "wasabiseth": "My heart 😩😩😩", "uhohallie": "😭💕 congrats! Sooo cuteeee. My first dog growing up was a cockapoo rescue. The sweetest!", "grettasgirl": "Oh goodness 💯😭💯🤗💯😍🙏🏻 So many mixed emotions.", "charlotteindia__": "Congratulations on the birth 😭😭😭 don’t let the cute lil thing destroy all the plant babies 🙌🏼🙌🏼", "tess_z_mess": "Dog doors are god sends! 🤣😍🤪", "chetah_____": "Hide your shoes girl!", "kaybee210": "awww❤️❤️❤️❤️❤️", "yourfriendmags": "Wow my heart just grew a few sizes seeing you two with a pup. Many congratulations! ❤️", "bizreitsma": "I was a dog trainer for a few years! My number one piece of advice for cockapoos is go to dog parks early on to socialize them! They are a surprisingly territorial breed.", "laurynbesasie": "😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "revtory": "What a cutie!", "yelenut": "a baby !!!", "tanika_nyclifestyle": "omg yesss a complete family", "ohthatflo": "OH MY GOD !!!!", "blurredbytheheat": "🤩", "funneeface": "😭😭😭", "graduatedhell": "They can read your tone! So don’t teach them tricks in a mean tone, do it calmly!", "l_zawacki_m": "I literally gasped! So happy for your family!!", "hollymariegibbs": "Omg stop it. This little fluff baby is stupid cute! Congrats!! 😍💖✨😭", "beautiful_cocoa_": "*screams in Black Joy* yaaaaaaaaaaaay!!!! I am so excited for y’all. Y’all were already adorbs and now the pup just adds to the wonderfulness ❤️", "chivisnax": "Yay ❤️", "evergreener_328": "😍😍😍😍 what a sweet and lucky pup to be loved by the two of you!💖", "amespurple": "😭😭😭🔥🔥👏🏾", "magatha88": "Yay!!!! Puppies are the best/worst 😂😂", "farheenalikhan28": "yes yes YES. PUPPY LOVEEE. @ihartericka I’m excited FOR YOU", "forelly_danyelly": "@ihartericka get Pet Insurance ASAP!!! Along with a WELLNESS plan...you will save tons of $$$ unexpected cost for health are steep! Best decision I ever made. MY Puppy is 18mos, just had dental surgery $872 with x-rays, anesthesia and all...the insurance and wellness plan saved me $800 I paid $72", "audetoutcourtcampeau": "@marika.robert", "writerwrenee": "That puppers tried to kiss you and you friendzoned her. Silly hooman. 😂🏳️‍🌈🖤💛 Seriously though, that’s a cute dog. Congrats! My advice is train her up, just like you would a big Pit Bull. I’ve seen too many small dogs go untrained and unsocialized. They develop a Napoleon conflict and terrorize dogs and people, alike. Someone needs to lead the pack, and they try to fill that role of you don’t. All the Pibble love to you, btw. I have one and he’s magnificent.", "samiyashakir": "Omg I'm melting", "a.contradiction": "AHHHHHHH SO HAPPY FOR U 💟💟💟", "marissa.morgan.jimenez": "You did it!! Congrats!! 💕🐶🎉", "bellasongm": "😻🎉🎊", "romymcgahaniel": "What a cutie. 💕 I would recommend puppy kindergarten and learning to clicker train. It is effective and based on positive reinforcement and it’s is theeeee best.", "thelmaemily": "Omfg", "lalalapascale": "I love how photogenic your pupper is ❤️❤️❤️ what a beautiful loving family.", "olympusmonsvii": "but you cant wrastle with them 😫 too teensy to wrastle!!! 😂", "moistgreenorganic": ".do.not.hold.the.child. at. every.chance. esp. when. it’s. the. easier. option.", "spring_is_here415": "Ooooooh congratulations!!!! 🍾🎈🎊 ❤️", "kellie.schneider35": "Congrats 🎊🍾🎉🎈 Mom and Dad!❤️👏🏻💋👍🏻✌🏻", "kalyptic_cue": "😍😍😍 Yes!!!! Best advice I have about puppies after raising a very active one earlier this year- start watching training videos early and pick a training method/approach you like and get into it. Seriously pups are so much happier when they understand what the heck they’re supposed to do and what you want. So training sets up that communication relationship really early. Good luck with her/them!", "lenawaithe\nVerified": "Verified", "tkay17_": "Congratulations ❤️❤️", "1babydude": "Power of Positive Puppy Training book is so helpful. It ain’t literature but it’ll help you show that pup some basics and bond. Also: Get a clicker. Seems lame but those brainy poodles love that treat signifier! Really helps with the house training.", "faiche_stiabhna": "So cuuuute!!!", "katieamendez": "I taught my dog to potty outside and on command by saying “go potty” every time I could see he was about to & giving him treats when he went outside instead of in the apartment. Ps. I died at the last pic of Eb 😍", "nielson.jpeg": "iconic 👏🏻", "mariannerosen.writer": "That last picture broke me. 😭😭 Only advice I have is dig deep on patience. First twelve months with a puppy is like the first seven years of a child's life compressed. They stage hop in light speed. Advice? 😂😂 Ask not what you can do for your dog, ask what your dog will do to you.", "luminatingruminating": "Omgggggg", "lunaabbott": "‘Cockapoo’ is not a breed but a ‘designer dog’ made up breed. You have a beautiful mutt! I only point this out because backyard breeders make lots of dogs and money off of this misconception. Have fun with your new family member :)", "sierramist169": "Ah!!! So very adorable! They look just like my toy poodle who I also got as a puppy! Definitely required patience (lots of sleepless nights) but so worth it.", "classyallthewayjes": "Cuut!! Omg I want a puppy dog sooo bad 🤗", "magic_arrow": "OMG!!!", "inked4lyfe35": "Awww too cute 💕", "thenapministry": "Omg! The cutest!", "bug_diamond": "😍😍😍😍😍😍", "leahjsharpe": "😍😍😍", "cassirosee": "Aww too sweet congrats 🎉 💜", "lilyazehner": "CONGRATULATIONS!!!!! Simply precious!", "therealjessicac": "Congrats, mom and dad! Welcome to the fam, Baguette! ❤️❤️❤️", "leeanndunton": "Oh my gosh, how adorable. Can’t wait to see all your puppy posts!", "bestnailsclub": "SO PRECIOUS", "dontmakemedecide": "So excited for y’all! Baguette looks so perfect - those Aires babies can be next level", "shyvolcano75": "@sonyareneetaylor i don't think these malt fur... Can we? Is this Anastasia's breed?", "hazelmoon__": "Sooo cute ☺️☺️congratulations 💕", "bangstreetbliss": "Dear lord", "kimefrance": "Ok this pic made my whole year", "madison.bartlett": "Enjoy your new baby! Something I didn’t realize when I got a puppy for the first time was the amount of sleep they need and how important it is to socialize them with people and other animals regularly. Luckily my pup ended up being super friendly anyway, but she spent a lot of time with just me at the beginning and now is sometimes a little overly playful with other dogs and people upon first seeing them.", "rebapyrah": "I AM SCREAMING WITH EXCITEMENT! Congrats you three 💕", "pro_choice": "Make sure there are LOTS of toys/options for the fur baby to chew on! It will keep it occupied and away from chewing on your shoes and other things!", "suedebang": "OMG!!! 😍😍😍", "kaycieg": "Are you KIDDING ME with that last picture with Ebony!?!?! Look at the heart eyes on both of them 😍😭", "radimo.la": "😩😩😩😩😩 the smallest dog on eaaaarrrth", "funqus": "what an angel !!! looks like my puppy when she was a few months old!", "emuhhhleebee": "OH MY GOSHHHH😭😭😭😭😍😍", "lozitzman": "😍😍!!!!!", "justsheherhers": "Awwwww! Congrats y’all!", "renee.martin4": "Congratulations!!❤️🌸😍adorable", "readyourworld": "🥰", "ace_and_gigi": "Oh my gawd 🤩", "andreatangney": "Congratulations! I have a Cavapoo and they’re so darn cute everyone is going to want to pet and my dog has gotten into a bad habit of going up to everyone expecting love. I wish I’d been stricter about asking people to pet him only when he’s sitting beside me. And ya I was soft on crate training and everyone else is right it’s much easier.", "miss.georgiapeach": "I cannot deal with this 😍😭", "crabecca": "😍😭😍😭😍", "whale.in.a.tree.comix": "Congratulations!!! As for advice, just that cockapoos are suuuper smart and need a lot of mental stimulation so puzzle toys are ideal for them 💜 what an adorable bebe!!!", "themiddleagedgoddess": "Divine!! 🧡🧡🧡", "adashofdolly": "Oh my goodness!!! 😍😍😍", "sashanlenz": "Omg ♥️♥️♥️♥️ didn’t think your feed could get better", "heatherrmanley": "All the feels but especially the last picture 😭❤️😩 Congratulations doggy parents!!!", "olivia_ray": "So cute!!!!!", "keeonnachin": "That puppy about to wear y'all out", "sheis_necessary": "😢😢😢😧😧😧☺️☺️🤗🤗🤗🤩🤩🤩🥰🥰🥰🤗😘😘😘😍😘😘😍😍😍😍❤❤❤❤", "kitt.katt._": "FINALLY! Yesss! ❤️", "saundra_leigh": "Oh my goodness! That is one cute puppy! 😍", "garbage\nVerified": "Verified", "anajj94": "Crate training! I house broke mine by putting her in her crate at night/when I was gone and taking her for a wee/poop as soon as she was let out. Can’t praise crate training enough. For travel, visits who are allergic to dogs, cleaning, everything.", "bysarahmessina": "Congrats!❤️", "etrefran": "Beautiful parents", "misiantaylor": "YAAAAAAAYYYYYYYYY I am so happy for uu", "thewaythru": "💛💛💛💛💛💛", "mama_cook": "A cockapoo! Sweet baggy boo💜", "belovedcoaching": "Congrats!! What a sweet addition! ❤️", "ayotsalithaba": "Omg I’m cryinggggggg", "soulwithbeauty": "This is so cute, I almost cried. 😍", "ninakossoff": "omgggg the last picture 😭❤️😭❤️", "birdgerhl_": "Omg that little face 😭😭😭", "blackorchidaceae": "Y’all gone have to talk about y’all light skin baby on the next podcast ❤️👌🏾😂", "nillerenee": "Stop. Please. My kids are asking for a dog and I've been holding firm...but....too cute! Lol", "courtney.en": "❤️❤️❤️", "nykkster22": "😩😩😩", "marsxdavis": "Omg what a sweet little face!! Congrats!", "brsuga": "Awwwww 😍😍😍", "carolinaisawitch": "What a beautiful puppy! 🤗 There are channels on YouTube that make relaxing music designed for calming dogs and puppies, they're fantastic. ✨ Also, Positive Dog Training works wonders, maybe look into Karen Pryor Clicker Trainer! YouTube has a lot too ✨ it'd be a good idea to get 🥖 used to a bunch of sights, sounds, and smells soon as you can to normalize it all - super special high value treats help there! (Bacon, chicken, hot dog) 😊 Best of luck! You'll do great!!", "s.iobhan": "Ahhhhh😍 The name! The floof! The joy!!! ... My advice would be to get pet insurance ASAP— it saved me (financially) and my pups (literally) so many times!", "bethanybumbleb3": "💕💕💕", "dingywabbit": "Stopppppp", "jennatalia_peachemoji": "Best. News. All. Day!!! I love this so so much and am so happy/excited for you two!!! Welcome to the world fellow Aries, Baguette X (their name says it all!) congrats on the BABY!!!! Don’t let them knock over your plants!", "beckycate": "What a cutie!! 😍 Congrats to you and Eb!", "abbeythevulture": "I have a cockapoo as well! They’re very loyal and loving dogs! Definitely go for at least basic puppy training in order to give the little one a good foundation for the family dynamics and obedience. Have fun with your new addition! 🐶❤️", "actuallyitsjustsosa": "Wowwwwwww", "raisedbyclowns": "😮😮😮😮", "taeviasalazar": "Honestly, dog training camps are really cute and effective", "samantharise": "SHUT UP!!!!!! As of y’all needed anything else to seal your Status as THE fucking cutest thing on the internet!!!! L😍VE", "theimmaculatewitch": "Omg!!! Sooo freaking sweet!! 😍💗💗 I have a cavapoo and they don't grow out of the cuteness haha! You guys are gonna be such good puppy parents!! 💗💗💗Get potty training down asap! Peepads can confuse them, bit I know you're in NY so you gotta do what you gotta do. Harnesses encourage the dog to pull often, and a leash attached to the collar gives you more control of the puppet's head and therefore their body and actions. Umbilical training is a good way to burn energy and to get them used to a leash and listening to you.", "liber_rhae_ted": "That's my birthday!! ❤❤❤❤", "mandaaapeaches": "Omfg ❤️❤️❤️❤️❤️❤️", "missalyssamurray": "Such a beautiful family 😩😍", "hoolzyamama": "Yesss!!! Just got my own pup and am on cloud 9! Mazeltov ❤️", "dahnbi_lh": "Oh my goodnessssss", "willow.tremaine": "Yay!", "operasaurus": "Omg!! The way the pup is looking at Eb! 💖", "littlecynner": "Omg she’s adorable 😩😩❤️ keep anything you don’t want to be chewed OUT of her reach!", "looshloosh": "YOU DID IT!!!", "tcmcguir": "If they chew on things say \"no\" and just swap it for something they're allowed to chew, my dog never chews on things because he always has lots of things he's allowed to chew. If they bite, make a high pitched yelp noise, this is what mom dogs do to train puppies to not bite, and it totally works!", "blacknerdgoddess": "Oh Lordt! Such a cutie pie!!", "muffintopz96": "Holy sh ur puppy is so cute I wanna smoooosh their lil face", "chefheatherumlah": "Congrats!!!!!!!!!!! It’s a love fest, and I’m so thrilled for you!!!!!!!! I have a cockapoo too he’s the absolute everything!! Regular schedule is very helpful/crucial when potty and behavioral training, lots of exercise. That is one lucky dog. Xx", "exxstazee": "Puppies are kind of dicks tbh puppy proof by hiding everything you love lol but SO ADORABLE and SO WORTH IT 😍 Cesar Milan “CHHHH” is the most useful tool I’ve used and puppy classes are mandatory! Also Good socialization & exposure 😩 such a cutie!!!!! ❤❤❤", "mixolidia": "@zakgeorge has a free 30 day training course online sponsored by @pupford. It’s really good at starting puppy off right. Also learn to cut their nails and get them used to being bathed as soon as possible. As a puppy the nails are really soft so a small nail clipper will help get Baguette used to the pressure on the nails. There’s a nail maintenance group on Facebook that teaches positive reinforcement to trim the nails. And how to best trim the nails. Cutting off little slivers instead of a big chunk is best and be careful with the quick. Trust me you want your dog to learn to trust the clippers now as you may already know. Also, poo breeds can be deceptive for hair breeding. Talk to your groomer. You’ll probably need to brush their hair daily.", "mraen7": "Be patient & remember that they are literally like human babies/toddlers until they are at least a year old. Get bells for the door to signal bathroom time outside & pay for quality food, saves you $$$ in the long run with the vet and problems that arise from poor nutrition", "larana89": "Awwww😍😍😍🔥💜", "esmebotanicals": "😍😍😍", "loveymorgie": "Bless! Is that a baby poodle of some kind? Omg I’m dying! Your lil family is tew much! Oh my heart 😩💖💜😊😍💋", "s.elleimac": "I’m CRYING THIS IS PRECIOUS 😭", "daddyloveremma69": "SO HAPPY FOR YOU YOU DESERVE THIS HAPPINESS YOU TWO!!!!!! #1 piece of advice is SOCIALIZE SOCIALIZE SOCIALIZE EARLY! Been a dog owner all my life of many different breeds and this is the ticket ! CONSTANTLY SOCIALIZING! Different dogs , cats , different people !", "estefaniatrujillopreciado": "😍😍😍😍", "meatlessinmontana": "Absolutely adorable!!! 😭❤️", "riddellmkm": "Awwww. Congratulations!", "aprilmonet48": "Adorable!", "ailovethat": "I’m obsessed 😍😍😍", "baked_cupcake7": "YAYYYYYY", "lalathegremlin": "😭😭😭", "bruteusmaximus": "Aside from good luck, LOTS of patience and don't let any bad habits go unchecked for too long. Puppies love to test boundaries. Positive reinforcement works best, and enjoy your new addition! I love talking about dogs so please let me help if you have any more questions lolol", "o.a.cardoza": "adorable!!!!❤️❤️❤️❤️Best wishes!!!!", "amandagrams_": "I’m seriously so happy for you! 🥖❤️😭", "suckapunch82": "Sooooo sweeeettttt! I read a puppy book from the monks of newskete (spelling?) and it was actually really helpful for training my pup. That and puppy kindergarten!!! 😍", "onsilver_stars": "My best advice is to set them up for success- anticipate things they might ruin or be tempted to ruin before you leave them. I spent a lot of time with a leash tied to my my ankle- it’s hard for them to get in trouble when they only have a 5 foot radius!", "kelseybraff": "😭😭😭 pure sweet joy", "itsjuustliz": "In LOVE", "lisagarbageface": "😮😮😮😻😻😻", "chantellekohn7": "Omg this is too adorable!!!", "jikes1975": "My 7 year old, who asks for a dog every day, asked how we will know the gender of our dog (that we will get in August). She said, “what if our dog is non-binary. We should choose a good name for them.” She then went on to say how she likes “interesting things like dogs and gender.” This was my favourite bedtime avoidance conversation to date!!!! Very excited to share your post with her.", "raykakumru": "Arggh💜💜💜", "twotreesyogajen": "NOOOO YESSSSS OMGGGGGG SQUEEEEEEEEEEE", "thescrapfaerie": "Tiny pupper 🐕❤", "creep_x": "😍😍😍 Congrats!!!!", "msn_er_rn_totally_blessed": "I’m so happy for you both!!! Having a fur baby will fulfill your lives in a way that is indescribable!!! They truly do become part of the family! I have a cat Sparkle✨ who has brought me enormous joy after my daughter went off to college. The only advice I can give is give that precious baby love and affection!!! That’s all they want. They will fill your hearts with soooo much more!!!! Enjoy your new family!!!! ❤️❤️❤️", "studioloraine": "Congrats! I have two poodle mixes and they are the sweetest! ♥️♥️♥️", "emilygoldhammer": "SWEET BABY X😍😍😍😍", "itsgussy": "Aww! So cute! ❤️😍", "gwennyfraser": "Omg I have a cockapoo too... they are feisty af but the best", "_sandy_roxana": "Please be careful of what plants the puppy is near because a surprising number of plants are toxic to dogs if chewed and since the puppy might be teething for a few months it will bite everything and anything. Also maybe not now but a little later give them a toy that provides mental stimulation. I have a snack mat and snack ball for both of my babies. Last thing, be mindful of what food you buy. Many big name brands add a ton of stuff that is not healthy or unnecessary for dogs to consume.", "laurencfisher": "Congrats!!! So precious and y’all look so happy ✨", "agardenofstars": "I want to love this more than once!!! 💕💕 so sweet!!", "thevillainelle": "What a darling lil family! Congrats!😍😍😍", "soulful.nutrition": "Staaaahhhhhpppppp 😍😍😍😍😍", "mama_yb": "So cuuuuute! Congratulations!❤️", "bde.veaux": "AWEEE 😍😍😍 welcome little one ! Congrats !!", "glitteryfemme": "You both look like the proudest parents! 😍😄💕🎉 im beyond excited for all the cute puppy posts to come!! 🐶🤗💕", "bake.and.destroy": "@xmotorcycledriveby the beginnings of the REAL royal family #wearenotworthy", "tessanbryant": "The joy! 😍", "antiisociialiite": "Excellent name hahaha", "saruh.williams": "the sweetest baby 😭💖", "freeleighamarie": "What a family! 💔💔Enjoy that little bread loaf, lots and lots of exposure to kids in the early days, will pay off later 🥰", "revolutionary_mystic": "OMG staaaaaahp! 😍🐶 Congratulations!💞", "delarosaydelmar": "the cutest family!! & what a dope shirt too!", "takeaholladay": "😭😭😭💕💕💕💕 congratulations!!! my advice is train your dog as a puppy to take pills and liquid medicine through a syringe/veterinary pill popper so that its easier in old age should it be needed. and also to take puppy to the vet on days you have no appts, just to get them comfy with vet smells♡", "minda_price": "OH MY GOSH CUTEST FAMILY. That puppy face! Congratulations beautiful family!!! Also I’m in love with your puppy already 😍😍😍", "renee_morrison00": "Awwww congrats", "ntfloyd": "😍", "_frizzy2barz": "Ahhh congrats y'all 😍😍", "podlingjustista": "I have two poodle mixes and my biggest advice is to get them used to grooming! It’s so hard for them to get comfortable with it unless you’re very consistent, and their hair mats so easily!", "jazzibell35": "💞💕💞", "silentlines": "😍😍😍", "godhelmuniverse": "Poopsiiiiiiieeeeee!!!", "tichswilson": "I can’t believe this just happened!!!! This is everything that is good and beautiful in the world 😭😭😭", "emilyshultz05": "Aww so happy for you both! ❤️", "scarred_jones": "Awww 😍!", "megssnopek": "So cute!!! Congratulations! A couple puppy tips: set a timer for every 2 hours, and make sure to let the pup out - that’s how often they need to pee, so if they don’t do it make a note of it and let them out every 15 minutes or so until they do! (House training is much easier when it’s preventative, rather than trying to react to them peeing in the house). Also, clicker training is so helpful!!!! Grab a clicker and use it for everything, tricks and for them peeing/pooping outside. Give them tiny little treats as reinforcement and it is SO helpful", "brunchatthebar": "STAAAAHP! 😍", "nocturnalreignbow": "Baguette look like a straight up stuffed animal!!! Y’all so cute 😍", "branolive": "Do not use a retractable leash. It gives the puppy too much power, and it makes you and your dog less safe. It also sets up other dogs that may have anxiety to be triggered.", "heatherlarson": "❤️❤️❤️Congrats!!!! Such a cute lil baguette 🥖", "latinavegana": "What a cute little baby!! 😭😭😭", "anarchycomingsoon": "So cute!! Jealous.", "blkmoonlight": "Touch their feet and ears often. I would also just open their mouth a few times like you’re checking their teeth just for the heck of it. This helps with smooth grooming and vet visits. Puppy training for commands. Definitely crate train. Folks like to train puppies to use the paper pads but I’m really not into condoning any potty action in the house. So with crate training, take bby outside frequently throughout the day. Take them with you wherever you can to socialize them with adults, kids, other dogs, babies, folks in wheelchairs or who use other mobility devices, loud sounds, etc. I would avoid giving them any human food unless you’ve made it specifically for them. This helps cut the begging for food.", "briana_marianina": "Is baguettex getting an Instagram?", "aweb80": "Oh the adoring gaze!", "bluecentric": "This is too fucking adorable", "projectreroot": "congratulations on your new family member!!!", "loving_chronically": "Congrats! So happy for you three!!!! That dog is about be wrapped in so much love!!!❤️", "tlikey": "Congratulate fam 🥳", "itsbrennadixon": "Ugh I cant🤩💓", "buhreena": "omgomgyayyyyyyy!!!!!", "spamanthamarie": "Best dog parents ever! Can’t wait to see all the stories to come with this little cutie!!!!!", "k8maiers": "So precious! Congratulations!", "koi_core": "Adorable 🙏🏾❤️❤️❤️🌹", "lara.tamsin": "AHHHH I can’t even take it I love y’all! ARIES ARE THE BEST!! My soul-pup was an Aries - they are the best 🖤🖤🖤", "stillifoley": "And congratulations!!🎉🎊🎀", "mad.slut.problems": "❤️", "thareelkj": "baguette x hahahaha omg!!! The most perfect name ❗️😭", "granola78": "Oh my GOSSSSSSSSSSSH...😍❤😍❤❤😍❤😍❤😍❤😍❤😍❤😍 My only advice is to soak it all in because they grow way to fast. Oh...and hide your shoes!!! 😂🤣", "simonelovesfitness": "Ayeeeeee 😍😍😍😍", "jessieleww": "Omgggg what a cute dog! Stay consistent with training! Once you make a decision, stick to it!", "maggiemills": "😍😍😍😍😍", "username70passwordvixxen": "Cutest puppy in the world!!!", "zoebeigh": "Ohhhh my goodness, it really happened", "libbymarilyn": "Too sweet!", "balletmeli": "❤️ 🐶 adorable", "eviemichal20": "Little Baguette! Love the name! I️ have a shorkie and my biggest piece of advice is to not feed her any table scraps. My dad did that, and our dog is the pickiest eater because he knows there’s better food out there than dog food. Stock up on some puppy training pads and pet stain remover for rugs and carpet. You’re gonna need it!", "nneggy": "😍😍😍😍😍😍", "madelines_mantras": "cutest thrupple of 2019😍", "booksfightback": "SO CUTE", "cristina298": "The pookiest pookie of all pookiedom! 😍😍😍😍😍", "cbhancock7": "❤️❤️❤️", "nyxturna": "That dog 😭😭😭", "mghsmith": "Omg omg omg.", "trishmariex": "BAGUETTE'S FACE WITH EB IN THE PIC! PURE LOVE!!!!!! 😩", "naima__amall": "What an adorable family 😍😍😍", "kristabelle1210": "Love!!!", "kaykaylo": "OMG!!!!👏🏼🌈😭 She looks like my puppy when she was a baby. My dog is also a Cockapoo. Congrats! My only advice, if you can, get her insurance now. My dog got pancreatitis at 6 and has cost me lots in medical bills... Still worth all the 💰 though!", "toylsan": "My feels!! My fellow Aries", "brunegirl2": "😍😍😍", "stazio___": "Omggggggg", "plutoflor": "CUTIES OH MY GOD", "dapontefern": "WHAT??!!! I'm so happy for you both!!! This is so exciting!!! You're both going to be the best parents ever. Look how cute that little one is!!! 🐶🐶👏👏👏🥰🥰🥰", "_stefaniealicia": "Omggggg ❤️❤️❤️❤️❤️❤️", "ang_e_la_la": "❤️👏🏻👏🏻👏🏻 So happy for y’all- I know y’all have been looking into@this for a while", "templexmatisse": "ohhhh my god!!!!!!!♥️", "blackfeministvegan": "So cute!!! Congrats🧡", "cosmicpollen": "Ohhhhh little buttered baaaaaby", "malice.n.wonderland": "And you named them “Baguette”!?! Gaaaaahhhh 😫😩❤️", "cash_labejia_": "Omg. This is the cutest puppy ever!!!", "sadspit": "@pissb0y the only way i wanna be tbh", "phoenixical": "1st off Congratulations to all three of you!! Make sure that you get all of her vaccines! As far as preventatives see if you can get her on bravecto and interceptor. Bravecto lasts for three months and interceptor covers more worms. Purina pro plan puppy is your friend!", "bunnymichael\nVerified": "Verified", "llamabeann": "i lost my best friend, max* -cockapoo* this year after having her for 15 years. had her from when i was 10 years old-25 years. she was singlehandedly the most beautiful part of those 15 years of my life. they are full of love and compassion, i cannot believe the empathy that she had and the light that she brought into my life seems like it will be forever un-matched. i am so excited for you and eb to share your life with this pup. all the best ⭐️", "childofpluto": "😮😮😮😮😮💜", "jeniaron": "😍😍😍😍😍😍😍", "mixaela.mas": "This. Is a beautiful day 😍", "shorthairidontcare": "Ahhhhh! Congrats!! They are so precious!!!", "justylusty": "ssstttttooopppppppppppppp😍😍😍", "adventuresofjps": "Omggggg💜💜💜", "verovivaldi9": "Oooooooh ! So cute !! Congrats, you two ❤️❤️ I’m sure this pup will bring you so much joy and you’ll provide the most loving home ❤️❤️", "tierramalisha": "🔑Kennel training is the fastest way to potty train. She is adorable. Looks just like my baby. @baileybearpup", "azuleyada": "Yaayyyyyy congratulatiooonnssss!!!!", "drea_carmen": "The absolute cutest shit. A+++ name! Love it, all of it. Congratulations!", "hair_by_gina": "💕💕💕💕💕", "pinkheartz1011": "Awwww😍😍😍💞💞💞", "empalace": "OH MY GOD OH MY GOD she’s so STINKING CUTE this is just a fantastic addition. What an adorable wiggly fluff!!! 💜💜", "kath_kc": "The picture with Ebony is EVERYTHING ♥️♥️♥️♥️", "m_a_mcdonald": "Definitely get hold of Linda Michael’s Do No Harm handbook, and Dr Sophia Yin’s puppy book, and her low stress handling techniques etc. Dr Patricia McConnell, Dr Susan Friedman, Dr Reisner etc are all science based behavioural trainers with excellent resources On puppy training. If you’re in California Linda Michaels is in SAN Diego and @steffenbaldwin is LA adjacent. Stay away from Off Leash K9 or Bark Busters as they are all promoters of harmful tools that can damage your relationship with your dog.", "hmalcs": "Dogs with hair like these can get mats in their ears, so if baguette starts shaking their head a lot or itching one ear more than the other make sure to check in the ear for clumps!! 🥖❤️", "vivian2112": "😻", "ebporter": "Awe! Congratulations! Baguette is adorable❤️😍. We have cats so I'm clueless as to how to raise a puppy, but I'm sure you both will be amazing pet parents!", "_lishaamin_": "I am currently DYING 😭😭😭😭😭", "msdsantos6": "Love the name🤗😍😍😍", "phillipafenty": "awww yeahh!! so happy for yall!! what a cute pup😍 welcome to pawrent life💜", "nancypants": "I keep wanting to like this more than once!!! I can’t stand that cute ass family picture!!!!! 😭❤️♥️", "stellacarroll": "@corporate_diva_ omg sooo exciting eek", "nicoler30": "❤️❤️❤️", "heyheyhaleyjo": "My heart is so full 😍💜", "dontyouwantarealjob": "😭💜😭💜", "ggbostini": "Love this! Congrats!! 🎉 🐾🐕🥖", "allicat247": "OMG", "e_run": "Omg too cute!!.. CONGRATS. The sweetest love 💜💜", "isoldhalldorudottir": "This was the best part of my day", "lisasnauwaert": "Omg, you guys! So happy for you two!! ❤️", "bontielou": "Holy fuck 😍", "tljoftlc": "X! Get ready to be lovedddddd fiercely! Congrats", "healingisimperfect": "Wow can’t edit to see more posts about this cutie", "brittanylamelia": "I am so fucking happy about this 😍😍😍😍😍😍 welcome to the fur baby family", "skellykelly": "I got my first puppy back in January. And my advise is to fuck everyone else, because (as you already know) you will lots of unsolicited advice. Love, train, love and smoother that baby as you want ❤️", "kristinals671": "Awwwww!!!!! They look like a little stuffed animal! Congratulations! ♥️", "dancecrazy32": "Luckiest pup ever!", "msblackawareness": "OMGGGGGGGGGGG I LOVE!!!!! 😍", "madremorena": "💗💗💗", "jennabrig": "Omg I’m dead!", "emilylorin": "OMG 😭😭🖤🖤🖤", "_wizardofyaz": "AHHHH I have a cockapoo baby that’s the absolute sweetest- they LOVE cuddles but also need their outdoor time! my pup loves long walks and exploring outdoor areas, which has actually been great for me, too- it tends to get me off the beaten track so we can go on trail runs and new hikes together. socializing them is super important early on and take them on errands with you while they’re babies so they get used to it! Also cockapoos have STRONG bites so get tough toys- they like to wrestle (my fav is the lambchop stuffed animal you find at most pet stores). congrats on becoming pup parents!", "sofiarclz": "Oh my dog! The dream ! 😍 You have a baby dog now ! Felicidades", "melodrama_llama": "Holy shit my heart just exploded", "patchworkpoet": "🌟🌟🌟🌟 @dandydogwalker in Brooklyn have much pup knowledge!", "serenakabatzinn": "OMG!!! 😍😍😍😍😍", "ultra_momma": "😍😍", "livshaa": "I already have 2 and y'all are making me want to get another one 😣 #DogMomVibes", "jenhenla": "Family! Congratulations to all three of you! ❤️", "dwhittlebum": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "shemeetscity": "Aweee!!! SO CUTE! ♥️♥️♥️", "fitmommon": "I have a Maltipoo and they are a BLESSING! Even most of your allergic friends can love on and be loved by them, as they won’t bother their allergies 💖 And they are just about as smart and sweet as a creature could be. My little one calls ours ‘he’ half the time and ‘she’ the other half, so I use ‘they’ 🤗", "thedanielleyoung\nVerified": "Verified", "calbayer6": "💜😍😍😍", "calibrookestrauhs": "Congrats hunnie bunnieeee!!!", "brrawrr": "Food names for dogs are best! Congrats!!!!!", "amyyyyym": "😩😍😍 let me know when a dog sitter is needed, pleaseandthankyou", "justmeliz": "Too cute.....must lay down💕💕. You three look happy", "alexlovesyoutoo": "Omggggggg cuteness to the max—congratulations 😍😍😍", "melissafac3": "That puppy has no idea how lucky they are!! ❤️ Congratulations!", "freeblackgirl": "So much joy in that first photo! 😭", "imagodeifag": "Holy cuteness overload! @natalirob look at this beautiful little family 😍", "stomachfooot": "Aaaaaaahhhhhhh!!!shshdjdieiebdbdjakkwuwuey!!!", "exuvia_intimates": "There are a lot of comments so I may be repeating tips. I would say; socialize them with as many types of situations as possible early on, and just take bathroom breaks every 30-60 minutes and praise peeing outside for a while. ❤️❤️❤️", "brenbuzzedoff": "😍😍😍", "colea7086": "❤️", "fuegoblanca": "Where did you get it from", "lashawnthompsonbeauty": "So cute ❤️", "peaceful_mama_74": "Aw so precious! Congrats!❤️🌻", "johnjohn_flores": "Happiness! ✨💕✨💕✨💕✨💕✨🐶", "saucy27pw": "Oh my gosh! How can do much cuteness be contained in one photo. Congrats!", "bookbabe25": "Like y’all couldn’t be any cuter! ❤️", "ak__the_great_": "😱!!!! Congrats on the new baby!!! Welcome to the world Baguette! 🥖🥖🥖🥖🥖Go LIVE yo LYFE and be GREAT! Also, they were born a few days after me, so come through Aries!!! Do your parents proud! Fuck up the gender binary and teach all yo lil cousins da tricks of da trade! I'm rootin for all three of y'all, ALL DA WAY!!!", "kaylaputt": "😍😭😍😭", "alexrblackstone": "Oh my goodness!!! Save the collars and harnesses as pup grows out of them. You’ll want the memories. Congrats on your little baby!! ❤️❤️", "itsrobean": "OMG", "illster89": "So cute! Puppy advice: cover your trash and hide your shoes", "vconrecon": "Amazing!! Cockapoo’s are great dogs!", "beccapatters": "Take a shameless amount of photos!!! You'll think you've taken enough (of cute days, events, etc), but you'll get to their first birthday and realize that sh!t you never took enough. I have raised 3 of my 4 dogs from puppies and it's the one thing I've failed at with all of them and my only regret", "futurowoman": "Omg congrats to all three of you!!! My aunt had a cockapoo and she was such a sweetheart!!!! My puppy advice essentially is to have patience and get into age appropriate training throughout puppyhood. Puppies are a challenge some days but so amazing and worth it. Yay!!!! So happy for you 🌈🐶♥️", "amandabritannica": "😍😍😍😍 put up anything you don't want chewed on and be consistent with training (my dad always fails on that front because he's a softy). And I'm a big fan of clicker training", "cultivatepossibility": "Oh. My. God. 😍😍😍😍😍", "sharksandpeanutbutter": "best friends.org is a really great place for positive reinforcement training references! it's all under resources 💕", "millygrace96": "Congratulations", "sweetheartstjohns": "😍😍😍😍Puppy magic is real! Enjoy♥️💯", "somearethemelody": "You look so happy!! 😍", "bobbyparmar80": "@amritdhatt this pic alone is reason enuf for a follow", "discoveringcasey": "Awww congrats on the cutest of cutest of fur babies!!", "jru37": "Congrats!!! Gonna have to get your plant babes out of reach! Crate train when not at home (it’s super sad, yes, but it gets easier!)", "delaneybig96": "😭😍😭 Precious", "etothecgirl": "😃😃😃😃😃😃😍😍😍😍😍😍😍😍", "myfitchbad": "so overwhelming!!!!!! shoulda came with a cuteness warning ⚠️🐶❤️", "_ajaimani": "😭😭😭😭😭😭", "tayloroverton": "Sooo sweet!! Congrats 😍❤️✨", "thestoriesofwomen": "😍😍😍", "kiersey\nVerified": "Verified", "girlinthepark": "Oh. My. WORD. 😍😍😍", "choychoylikewhaa": "Aww 😩🥰 that little face 😍", "un_becomingme": "😍😍😍", "kennaconfetti": "Routine. Routine. Routine. Simple one word commands for actions and tricks, agree on terms (sit vs. sit down or down vs. lay down) and be consistent.", "dtursi": "I’ve double tapped this so many times 😍", "michelle_bee18": "😮😮😮❤❤❤❤😮", "deschats_rouge": "May you have too many wonderful years to count. I recommend clicker training.", "stephaniegiovinco": "Congratulations!!", "megan_pen": "Omg!!! X is beautiful!!", "sylviamims8": "Look at that cutie pie! Congratulations on your new addition. 🎉🎈❤️", "rockingmama": "Congratulations! Find a great trainer (online, book, etc) and stick to it. 15 minutes every day and you'll have an amazing friend. Decide what you want 🥖X for (companion, road trip buddy, home protection) and focus the training there. Also have fun! Commands don't have to be stay sit heal. You can make up words. You can use crazy words. The dog will never know! They'll just respond to whatever you train them to. 💜❤️💜", "jfkroep": "We have two cockapoos!! Be prepared to love them even when they are being the naughtiest!", "mad.madam.mermaid": "Omggg the cutest lil family. Baguette the cockapoo better have her own insta!", "isobelamadea": "😍❤😍", "gritlikeseabiscuit": "My biggest advice is WEAR THEM OUT!! Puppies are taking in so much info, and if you don’t give them a task, they’ll find one (usually that means destroying your stuff lol). IQ toys/puzzles are great for your pup and easy to diy! Also, kennel train immediately- it sucks, but it’s sooo worth it! Congrats on your little one!!! 💖🎉", "jasminedavilar": "I’m trying be number 4 😭 y’all are such a cute family ❤️", "bearlygrunge": "i highly recommend the power of positive dog training by pat miller! it helped me raise the best dog when i was 16/17! so you guys can definitely do it! congratulations ‘", "rinn.rose": "Yassssss", "katesk106": "I’m sure you’ve looked into this, but just in case, many houseplants are poisonous to dogs/cats. We had to “cat proof” our plants recently and I was surprised how many are toxic. https://balconygardenweb.com/poisonous-houseplants-for-dogs-plants-toxic-to-dogs/", "chelseythegreatt": "Puppies pee all the time 😂😂 I had to take mines out 4-5 times a day for quick little pees. And smaller dogs are harder to potty train, so be patient. Being patient and understanding is my biggest tip for puppies and for smaller dogs. I have 3 😂😂", "candidlyshare": "Omg😍", "its.el.now": "SO CUTE! Congrats! I have a lot of advice: - Make sure that the pupper has plenty of healthy things to chew on! Invest in sturdy bones. Animal bones are not always a good option (plus they stink up the couch!) - If BaguetteX is biting themself or smells yeasty it may mean that they have allergies to food or environment (esp if they’re from breeder!) Get them seen by a vet!", "beydems": "Socializing is very important and can only be done when they are little. Expose your pup to everything and everyone, provided they are vaccinated. Get lots of chew toys. Puppies can only hold their bladder for as many months as they are old (2 months = 2 hours). I read Training The Best Dog Ever and it helped so much with my pup. Best of luck! The early weeks can be the hardest but patience, consistency, and positivity go a very long way! 💛", "devilspahn": "Congratulations!!!", "theblackplanter": "Omg! Too cute! Congrats on the new addition to the fam", "crohnie_jasmeen84": "Aww woe woe woe😍😍😍", "monstrance.ghastly": "Omg a baby puppy!!!! 😍😍", "northwoods_hill_farmers": "-Crate training works for some families. -Make sure to potty Baguette every hour for her month age, for example, 8 weeks=2 months=potty every two hours, 3 months=potty every 3 hours, etc. and especially after play and eating/drinking. -Celebrate successful potties, (we dance and sing a little song, give pets, etc.). -When dealing with puppies, like with kids, I try to “catch them doing something good”. -Bottle the puppy breath ♥️♥️♥️", "empanadamamii": "This is the best thing ever 😭❤️", "roselauren95": "Just when I thought y’all couldn’t get cuter.... here we are ❤️😱", "katiekane__": "😍😍😍", "where.theres.smoak": "Omg that third picture 💛", "survivormoda.rachel": "CONGRATULATIONS, you two! ❤️❤️ Pups bring so much joy to your life! 👏", "domina_franco": "OMGUD 😍", "leighanndwg": "Oh you done did it now!!! It’s been a long time since I’ve had a puppy around so not much advice to share, but so cute!! Congratulations 💜", "megibella": "congrats! That's my birthday AND @mariahcarey's too sooo ❤️", "thewildkindness": "Congratulations! I got my first ever dog (Cavapoo) last fall when he was eight weeks old. I recommend two books: The Art of Raising A Puppy and The Other End of the Leash. (I did get him as an emotional support animal and was already going through a very hard time when he arrived and the first few weeks were SO hard. I cried a lot and doubted my decision but with support from friends and family I got through, and now consider that very difficult adjustment period to have been worth it). Much love and luck.", "alitroj": "Oh my the fluff!! 😻 congrats 💗💗", "yaicha": "Omg PERFECT BABY! 😭 My main advice is to get it some training classes once it has all its shots etc. We took our baby to Petco Unleashed and they’re great and it was worth every penny.", "nikkitony51": "THEEEEEEE CUTEST 😍", "__allie_": "I’d say definitely be careful with what human food/leftovers you feed them because these breeds can have quite sensitive stomachs compared to bigger dogs, at least that’s what I’ve experienced with me and my sister’s pooch (cavapoo) and the same goes for stuff outside. We made the mistake of not teaching ours to let us open her mouth from young so we’ve had to do it more recently because she’d get possessive over whatever she would pick up and that can be dangerous because you never know what gross stuff they can find/eat. Other than that I agree with who has said general obedience/basic training because it helps a lot in the long run. This is so beautiful, thanks for sharing the cuteness with us all and enjoy the magic of having a little furbabe, lots of love to all three of you ♥️✨🙏🏼", "miawrightross": "Omg THE BABBBYYYYY!!!!!", "kgstel": "😍😍😍😍😍", "thelichenhunter": "Positive reinforcement training only!", "hotbibabe": "Lots of praise & some treats when they poop or pee outside!", "mckennah": "OMG that third pic 😍", "jollygreenjen": "Instagram just got better!", "abbbbner": "Omgggggggg I’m in love with your lil fam 💕", "bperformer": "Omg 😍😍😍", "etsinthecity": "OMFG ❤️❤️❤️❤️❤️❤️❤️❤️", "zoathexplora": "Brush their hair regularly so it doesn’t get too matted in between groomings!", "blackgirlmasculine": "😍😍😍😍", "eyesfullofmoon": "I’m so happy for you guys!!! Not to be a white grrl with a bunch of dog advice but...😬 Take them out every 2-3 hours till they are potty trained and then every 4-5 till they’re like 8 months old... Also I heard you should try to introduce your puppy to around 90 different dogs and people before 4 months to make sure they’re chill🤷🏻‍♀️... idk that many people so I’ve never done it... 😂", "stoneyfamily": "I wanna reach through my phone and hug the shit out of that dog. Baguette X 😍 greatest name ever. I have no extra dog tips but we always had rotties as a kid so when I got my first fancy pants dog as an adult I wasn’t ready for the attitude. It’s funny but also a patience tester. Congratulations on the adorable addition!", "aliciakadventures": "OMGGGGGG ❤️❤️❤️", "paandajean": "What a cutie!! We had fantastic luck potty training our dogs growing up by taking a pause at the door before taking them outside and asking them if they need to going outside/potty/what have you. They quickly associate that phrase with 1) going outside and 2) using the bathroom 💖 congrats on your Aries baby!", "emiveritas": "I’m dying", "abovebelowjewelry": "Omg! Congratulations! Baguette is one lucky pup!", "ellaclitsgerald": "I have a cockapoo. They are obvs soooo cute but keeping up on an ear cleaning schedule is crucial as they are very prone to ear infections! Congrats love that lil face", "yvie_b": "💖💖💖", "michy.oz": "Something my roommates do that I’ve noticed really effective with begging for human food, any time they give their dog human food, they put it in the dog’s food bowl first so it always knows its food belongs in there and not from human’s food in hand .. also sorry if that was already a suggestion", "ashantidoll": "Bread x ? Lolso cute", "prettypleasecanijust": "Advice: SQUISH THE LITTLE BABY PUP AND TAKE MANY PICTURES 😭😭😭💖💖💖", "evilregal31284": "Great book about dog/ puppy training: “The Other End of the Leash”", "kelsitenango": "😭😭😭😭😭 Welp, my puppy fever has spiked", "alexfisherr_": "Im so happy for you all!!💕", "chromat\nVerified": "Verified", "amrieej": "OMG CONGRATS ON YOUR FUR BABY!!", "nicolettemason\nVerified": "Verified", "veggiekales_": "Crate. Train. It will save you so many headaches. Some dogs pick up on it easily without much anxiety. Some dogs struggle. Getting them used to a kennel early on will be the best thing you ever did, they view their kennel as a safe space/home and treat it as such. Positive reinforcement is great too! Treats for every positive behavior they do, whether it’s intentional or not, will help them learn what behaviors they get rewarded for and continue doing them until it becomes natural. I’m so excited for you and Eb! It’ll be hard raising a puppy at first but also SO much fun!", "killzthelights": "Ohmygod. Congratulations!", "odwallafemme": "A precious child!!! 😍", "rowena_kosher": "Congratulations! Baguette X is so cute!! Tips: routine routine routine. Potty routine, bedtime routine, food routine, walk routine! Dogs function well when they don’t have to make too many decisions. And socialize early!", "seafalcone": "They are SO SWEET wow so happy for you both 😩🥰", "poolersmiths": "Ohmygah. So cute. So so so cute,", "neptuni_uxor": "😍😍 touch their feet and ears a lot as a pup. That way they're better prepared for ear cleaning and nail trims!", "iischristy": "So happy y’all got your Baguette. What’s the baby’s size I’m gonna pick up an outfit! 😍", "s.selectah": "soooo cute!! 😍😍 patience, repetition with commands. lots of treats for positive reinforcements. puppy proof your spot to avoid any unwanted chewing of things! also start thinking about if y’all want them to have puppies. a dog on their period is not fun! cockapoos can get big lol", "loki_lethal": "I'm crying!!! I had a dog named Dusty when I was 15 and he was my best friend. I went to school and came home to find out my dad left the door open and he got out. I never got to see him again... but today I see this little beautiful baby and I see my Dusty!!!!!! I'm crying so beautiful Ahhhhhh!", "greshler": "😍😍😍😍😍😍😍😍😍", "drellenrae": "My advice, as a veterinarian, just because she’s cute af, don’t let her be naughty. Crate train her so she can travel with you. Leash train her so she can go anywhere. Obedience train her so she knows how to act. She’s effing adorable. Enjoy allllll the lovin’", "lissajeen": "Omggg so cuuute! I know links dont work in ig but this copy paste is worth it! It's a free puppy resource guide from a positive reinforcement online dog sports training school and it's amazing. Puppies all start out the same and it's just about building your relationship. Have so much fun! https://www.fenzidogsportsacademy.com/self-study/growing-up-fdsa-free-ebook", "lazingara_bmore": "What a love muffin", "emiliad": "OMG I HAVE NEVER BEEN HAPPIER TO SEE SOMEONE ELSE GET A DOG THIS IS SO MUCH JOY", "alexis.lindsay": "😍😍😍😍😍", "whoknowshowtomakelovestay": "Sweetest baby ❤️ Happy for y’all!", "overly_sentimental_duh": "I have a cockapoo — @certified_clyde & he is the best thing to ever happen to me! They are the BEST companions!! So happy for y’all!", "dazedcourt88": "Yay!!! Congrats!!", "ladybirdadribug": "CONGRATULATIONS 🎊 💕", "mariellaegg": "Congrats!! Crate train!! Saved me so many damn potty training headaches. Good luck and be patient 💖", "whatsda_t_lc": "OMFG why is this so cute! Why does she look at y’all so adoringly already! So excited for y’all!", "ailisse_aquino": "What!!! My heart be still. Congratulations", "iridiannc": "This makes me so happy!!!", "victoriagrows": "OHHHMYYGAWWDDD!!", "pure.706": "Soooo cute !!😩❤️❤️❤️❤️", "kolbybrianne": "WHAT A BABY 😭😭😭😭", "messytessie": "Omg 😍😍😍😍😍😍😍", "mgrimoire": "Best puppy advice I was EVER given: a tired dog is a happy dog. Happy=well behaved. Congrats! She’s gorgeous!", "jasonikeler": "OH MY GOD YAYYYY", "goodgreengardens": "I love everything about this! Congratulations, family!", "itszairaduhh": "My life is dogs, I work with dogs so feel free to HMU with any & all questions lol", "sass__hole": "What a precious little loaf of bread. I’ve never raised a puppy before so I have no advice, but I do know puppies are more likely to get into things so I’d recommend reading up on which plants are toxic (ASPCA website usually has a good list) because I’m sure they’re gonna wanna knaw on them.", "kdbe133": "ADORABLE!! congrats and be prepared to fill you phone with photos of your critter from here on out. Advice: PET INSURANCE", "flowerrrr__child": "Ahhhh, sooo cute!!! 😻", "ig4steve": "So happy for you both! For you three❤️. As a second time small dog owner my best advice is to not baby your pup too much. Treat them like a regular size dog and they will have much more confidence and spirit. When we coddle them they become timid and act out in that aggressive stereotypical small dog fashion.", "maisyns_daddy": "If you love something, keep it out of puppy reach! They literally chew on EVERYTHING!!", "messinaeve": "Omg!! 😭", "allisonalcena": "I have been waiting for this!", "selfiebooklet": "Omg🐶", "supamakenzi": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "madalingiorgetta\nVerified": "Verified", "brianajacosta": "So cute! ❤️", "littlebryn": "BAGUETTTTTTTE!! 🥖❤️ I, too have only ever had pitties/boxers but we just brought home our own tiny - so much easier to maneuver, but definitely harder to say no to! 😍 advice would be train to use potty pads/a litter box (yes it is possible! and the greatest/most convenient ever for city dwelling + travel) 🙏 enjoy your new splendiferous nugget!!", "barekarina": "Yessssss😊❤️😍", "confessionsofaplantlady": "Congratulations!!! Puppies are exhausting but super cute. Exercise and lots of snuggles are key.", "_jillianjackson": "Oh I’m so happy for y’all!!! Do some research on crate training. It will REALLY help with the potty training. 🙌🏼", "bmorelizzy": "I got my pit at 7 weeks. Put all yo good shoes up! Be prepared to step in squishy stinky things in the middle of the night and wet spots you didn’t see lol congrats on your new bebe 💕💕", "marybell_30": "😍😍😍😍", "jbakes26": "Aaaaaw! 😍", "hobryant": "😍😍😍", "officialpucho": "Is the puppy named Baguette?", "jimmycartersufo": "That third photo though 😭😭😭😭😭😭", "alystomp1": "💗💗💗😻😻😻", "shultze23": "Congratulations!! ❤️", "northwestmoon": "YAY!!!!! Congratulations!!!! The only advice I have is the calmer you are, the calmer they are, and the only good puppy is a tired puppy. 😂 enjoy the ride!!! 💛💛💛", "gaykakn": "congrats!! so happy for you, that’s one cute ass puppy 😭💕", "truthmagic": "Omg it’s happppeningg", "ashmarie2112": "Take them out every 2 hours. They will cry at night at first if in a cage (ours sleeps in our bed😂)", "unicorn_goddess89": "I sense the sass already!!!", "emiliaduncan": "Omg 😍", "syndrome_air": "YAYYYEEEEEE WHAT A SWEET BREAD!! Congratulations!! Oh my god! 😭😍❤️ My best advice is to get them on a feeding schedule as soon as you can! Usually it’s twice a day depending on the breed, it could be more/less, but generally puppies from breeders are given food all day to eat at their leisure. This can lead to food-aggression/resource guarding which is honestly such a pain for you and your dog. Also treat every toy and food as if it is yours first and you are simply sharing it with your pup. Take toys, beds, treats/bones away randomly and then give them back so your dog knows not to feel anxious about guarding it. This is one thing that can develop early on and it’s really tough to reverse it, so it’s good to nip it while they are young! This is advice I wish I had when we got our puppy! Best of luck, you and Eb will be amazing dog parents!!!", "fanatic4": "Yay!!!!! ❤️❤️❤️❤️❤️", "what.does.real.mean": "Time for white ppl to shiiiiine! ‘Cept me; I’m a cat person.", "flowersrisin": "Ayyyyyyyyy ♥️", "e.eeluz": "Congratulations!💕what a cutie!!!!!", "napollonia": "OMGAHHHHHHHHHHHHHHHH😍😍😍😍😍😍😍😩😩😩😩so damn cute!!!!!!", "cryingbull": "IM READY FOR THIS COMMITMENT 😭❤️", "nessa.l.mama": "Omggggggg 😍", "redpepperflakesoneverything": "My best puppy/pet advice is check for any plants in the house that maybe poisonous to them or essential oils. ❤️ and take lots of pics 😍", "divagirlrn": "Awwwwwwww! What an adorable fur baby! Congratulations!!!!", "yennif.mas": "So beyond happy for you both!! The love of a dog is like no other 💓 things I had to learn the hard way: •\"bitter apple\" spray to use on things you don't want chewed up, •move all your plant babies up high so pup can't eat/kill them, and •socialize early (the more people/places/pups the better). SO excited to watch this little bean grow with you all 😘😘😘", "sankofamind": "Omg you guys are gonna be puppy pic relentless right hahahaha. Very cute little puppy 💗", "jnwatters": "You got the puppy!!!! 😍😍", "michellemacne": "Congrats on your fur babe!", "blackineseplease": "Omg 😍😍", "shimmyshaker": "What an angel!", "pvnderthighs": "Start getting that lil baby groomed every 5-8 weeks ASAP so he’s good for baths and haircuts and it also helps to socialize them and get them used to new people which is great ❤️", "fadhy11a": "Awe💕💕💕", "maestra_silvestre": "Y’all did not", "charstyle": "Ahhhhhhhhh the cutest couple with the cutest puppy🥺🙌🏾💕", "jamiejleclaire": "Yay 👏 Fire baby! 🔥 Puppy tip: As super cute as they are, they can be overwhelmingly hyper. When you or someone else comes home/walks in/is introduced etc and puppy gets excited, riled up, wanting to jump for attention?... turn around, basically keep ignoring til they calm down a bit, shouldn’t take too long, then proceed to say hello and give all the love once they’ve stopped jumping.", "carrotflowerz": "😍😍😍😍!!!!!!!", "char0804": "Aww the cutest!", "__bisoubisou": "Baguettex looks like a stuffed animal so cuuute. Cockapoos are super smart too and pick up on training fast. Congrats!!", "tealoma": "Omfg😍😭", "landafox": "That face 💛🐶💛", "darkskinfluffy": "Awww", "vkachins": "YAY!!!!", "lori_jennifer": "😍😍😍😍", "wakandanqueer": "Puppy advice: it’s like an infant for a while but the more work you do now, the less you do later!", "3mm4_b34r": "<3", "yasminmackie": "Omggg!!!!!!! Babiesssssss", "smatesky": "Oh wow! hi family!", "obritztattoos": "😍😍😍😍 Congrats!!!", "loteria27": "Advice from a small dog owner: socialize the hell out of your pup (once they’ve had their shots of course) and also, discipline them like you would a bigger dog. My German Shepherd and chihuahua got the same consequences.", "ciaratoga": "Welcome little one🙌🏽", "booraw": "Crateeeeee train, it will save your life and grow a respectful, independent dog. Be strict!! Which of course (🙄🙄🙄) is most important while they are their cutest, but the tougher you are now, the shorter your training period (and frustrations) will be in the long run. Also; routine, routine, routine. 💕💕💕 CONGRATS!!", "kelley.green": "Gimme that babyyyyyyyyyyy!!!!! Hooray hooray hoooooorrrraaaaaaaaaayyyyyy!!! 🖤🐾🖤🐾", "momomuston": "Obviously you’ll want to let the puppy do whatever they want because they’re so cute. And you’ll just live your life in the aftermath of that cuteness! Congrats!! ♥️", "kambri_xo": "They are so cute!!", "leonne11_": "They favor both their parents! 😍😍😍", "isntshe.lo.vely": "😭😍😭😍😭😍😭😍😭😍😭😍😭", "tori_borialis": "The way she looks at Eb 😭😭😭😭", "hope.love.lite26": "I’m HOLLERING THEY Are SO CUTE 😭😭😭", "rachel__anna": "Oh yay!! Congrats! My advice is to get pupper potty trained quickly. I set my alarm and took my puppy out every few hours for the first few weeks (and always had treats in my pocket for quick positive reinforcement) she’s never had an accident in the house, and at 10 months will hold her bladder for 10 hrs +", "ashlea162": "Omg my heart cannot handle this!!!! ❤️", "ericansummers": "Cutest family ever!!!!! 😫❤️", "cheyennewj": "@nasraad seeeee babyy!!! This is our affirmation! 😩😍", "perfumistasf": "😍", "sweatsweetie": "Couldn’t handle the cute on your account before and sure as heck can’t anymore 😭💓💓💓💓", "miamia": "🤩🤩😍", "aseatatourtable4": "💜💜💜", "taylorngibson18": "I’m in love 😍", "ms.smashley.rose": "If you look into pet insurance, do it sooner rather than later. From what I understand none of them cover pre-existing conditions, so getting in early is best. And congrats!! What a sweet lil face!!! 💕😍💕", "kellyshoestrings": "Oh.my.god. Wow, how precious! Congrats!!! 💖❤️💖🎊🍾🎈🎉", "miz_liz_85": "Yay!!!", "net.imler": "🤩🤩🤩", "rosyyali": "Omg congrats parents 😍", "_______ec_______": "BEAUTIFUL! ♥️ Congratulations!!", "confessionsofa21stcenturychick": "HER NAME IS BAGUETTE IM CRYING", "msindiarose": "Oh my goodness! Congrats on yalls lil baby", "stuckonthetipofmytongue": "Ooooooooooh 😍😍😍", "meghantonjes\nVerified": "Verified", "rubydanger": "Congratulations!!!💖💖", "jessye__": "Awwww 😫 next it’s gonna be babies and I’m not going to be able to deal with y’all family cuteness all over again😢. I’ve had puppies! So my advice is... schedule schedule schedule! Puppy pads in one specific area and NOT where he/she sleeps. As soon as he/she eats wait 5-10 minutes and take his/her little booty outside. Remember to say “outside” or “bathroom” or “potty time” when you do so he/she gets use to hearing it when it’s time. Don’t come in until he’s/she’s done his/her business and treats when him/her learns that is where they go. Puppies should go outside to potty at least 4-5 times a day. Repeating commands with little treats will get him/her to learn quicker and faster mine were “bed”, “sit”, “stay” and “outside” bed so he/she knows where to go when you both leave the home until you all are comfortable with her/him being kennel trained and potty trained 😊❤️ congrats on your new fur baby!!", "nuncia_maria": "Omg!!! So sweet. We got a puppy in October, and the one thing I would say is stick to your housebreaking plan or you will have a 10 month old who pees on your bedroom floor. (Hypothetically. lol) good luck!!", "tbizzle_sizzle": "Crate train immediately. I didn’t crate train until my puppy got sick and needless to say with was a ruff 2 weeks. The sooner they have their own space the happier your pup will be. 💕 #congrats", "vall": "😍😍😍😍", "missbeckybaby": "Invest in allll the pee pads!! Even with regular walks and outdoor time, small dogs struggle to make it more than a few hours!! Enjoy ♥️", "sabrinadunahay": "i’m in love! what a perfect family photo 😭", "pearlzorn": "Just when you thought this account couldn't be any more awesome...", "guesssomaybe": "Ommmmmmmmg!", "melina_holistica": "Omg yay!!", "cristalsharris": "😍😍😍", "mon.bz": "hooray! 😍😍", "melissau\nVerified": "Verified", "oliviasfayc": "ok cutest family picture EVER. this dog 😍😫", "mariahdalton47": "So precious!! 🥰My cockapoo is almost 5 now but looked the same when we got him! They grow so fast 😩", "jennsolara": "What a perfect little angel ❣️", "old_cheese": "Aries !!!!!! Get ready for a tiring but rewarding experience ❤️❤️❤️", "greer_louise": "Welcome to fur mama life!", "baileybethblack": "😱❤️", "varouna": "I had a loaf of bread who masqueraded as a cockapoo. He was the best dog ever. He died recently, blind and deaf, at age 16. I hope you have as make as many wonderful memories with yours as we did with ours. Congrats on the new addition!", "kabiradame": "😍😍😍", "rochylinsta": "As cute as the puppy is, always remember that you are the alpha. I once (unbeknownst to me) let a little pup get it twisted and let’s just say, there was blood. Mine. Yeah. Love how happy you two look with the little bundle of fur!", "_jessicadoeslife": "Awww! Congrats y’all!", "petitecaja": "Omg how adorable!😍", "saralleeman": "I appreciate this family!! 💗😭✨", "apple_headed": "😱Soo cute!!", "odetoanartichoke": "😍", "katalinakhoury": "Yay ok but tell Ebony I love him he’s so cute and perfect I love you both but I feel like he’s so radiantly perfect idk", "isobel_cooper": "No way!!!! 💕", "rabbischmooly": "Love 💞", "tallbrooke": "OH MY GOD", "mrs_jodiethomas": "Congrats! I have a 13 year old rescue dog who’s only 5 lbs, my forever puppy! Be consistent with training, get lots of exercise and socializing. Enjoy ❤️"}