{"iparkermovement": "How about we just stop policing ANYone’s gender expression and clothing choices and just ask considerate questions instead? Perhaps, “Why do we consider dresses/skirts to be traditionally feminine in the first place? How does that assumption make it difficult for an otherwise male-presenting person to choose that item of clothing despite its physical/emotional comfort, since men acting effeminately, tenderly, emotionally, etc., is so consistently shot down and/or written off from so many sides (including from the queer community)? How do we make a world in which everyone is treated with consideration? What systems are in place that cause these various iterations of suffering, and how do we smoothly dismantle those systems and what systems can we put in their place?”", "domob1tch": "I just feel that people are different in their own way, and if you’re different and know you’re different, you should claim “ I’m just different “ and then it’s all cool. no issues no nothing.. there are women’s clothes, there are men’s clothes. that is what the creators manufactured them for and there’s no issue with that (the trans community has no place to tell the owner of a product what or who his/her product is made for). if a man wears a skirt, it’s a guy in girls clothes. again, there’s no issue with that. be you at all costs. I support someone being themself, hell yeah.. but im stating facts. If you would call that “toxic masculinity” then ion really give a fuck, those are just simply the facts. trying to take power away from the rest of society and claim this and that over emotions is really illogical. just learn to be yourself and be comfortable in your own skin regardless of what anyone has to say to you.(just like anyone else who’s standing out) if you’re gonna express being different, know what you’re signing up for. just like everyone else who’s different... I tried to keep it kosher but tbh this community is getting out of hand y’all went from being yourselves and not bothering anyone to cramming this kinda shit in our faces every which way (not that everyone does, but I just see too much of this). if the argument were left at “they’re just clothes” I would support, but coming out like “if you make clothes for only girls or only boys you’re wrong” is a nogo for me.", "filmlesbian": "i agree that cis white men don’t need to be congratulated for really anything ever, but isn’t it harmful to say that clothing has no gendered implications in society? masculine women and feminine men (and people perceived to fall into those categories) experience violence against them on a daily basis. if clothing weren’t gendered in our present society, wouldn’t that not happen? again, i don’t think we should be celebrating anything men do because when they do things it’s usually the absolute bare minimum human decency like calling out other men for misogyny, but it seems reductive to say that gender nonconformity doesn’t exist as a material thing in society. obviously in an ideal society where gender doesn’t exist, there would be no violence against gnc ppl (because gender nonconformity wouldn’t exist obviously), but right now it does.", "cybercinder.cos": "I mostly agree with this but what does capitalism have to do with society’s gender expectations? They’re completely unrelated, there are plenty of non-capitalist countries where stereotypical gender roles are similar if not exactly the same", "justineeeeee_": "@jwints58", "tirsatalks": "i agree that makeup has no gender, but on your page i often see you talk about femmes (e.g. about people who are cis women). i often worry about us queer folks shifting to a different but oh so similar binary. you cant know someones gender, clothes and makeup have no gender, but we still mark people by what we see, even when we say \"femmes\" or \"mascs\". how do you know im femme if youve only seen me once? are you sure my body fat distribution isnt informing how youve marked me? as queer folks we exist in a liminal space between indoctrination and liberation. im wondering where \"gender expression\" lies on that spectrum.", "imlearningtodraw": "Not to be that guy but gender bending generally has to do with the way one embraces typical behaviors of the opposite gender. Holding people accountable for being ignorant, or bigoted isn’t gender bending; it’s just educating/letting people know that what they’re saying/believing is fucked up. Clothes aren’t inherently gender specific, but clothes have a bias to them which is why everyone dresses a certain way; or if they want to be perceived a certain way they dress a certain way.", "xstylez_za": "Yall fxcking this world up on another level 😒", "gayclub96": "*tries to find n delete the bend that gender comments in shame *", "dreaming_avalon": "I really had to digest this post to understand it and now I think I’m getting the point hopefully.", "bonjonsmovi": "But we can’t/shouldn’t assume that someone is cis, unless they’ve told us they are (and even they they’re always allowed to change their mind).", "poc.punk": "Faaaaaacccctttssssss", "ashleigh.hickey": "I dont agree with this entirely. I think gender bending looks many ways. If a cisgendered man wears a dress, he reinforces that dresses are not gendered...", "charlie_.bs": "I getting tired of this.", "incassable_jules": "Why is it acceptable for a woman to wear a suit but not a man to wear a dress? Almost as if society shames feminine characteristics", "offtracklegend": "Without capitalism we’d all look like North Koreans. No fucking style. Same fuckin haircuts. Stop being an edge lord and research what it’s like to be different in Marxist countries", "blueberrydewdrop": "*cough*jamescharles", "mattwarburton85": "White men BAD!", "everythingexotica": "Idc", "libertarianlol": "Why do transwomen get facial feminization surgery or dress feminine then? Isn't that patriarchal and capitalistic to reduce femininity to features and clothing? Same goes for trans men taking testosterone.. if they're really men why do they need all that if they're just inherently men or women?", "lillineumeister": "@dreadfulmiri Lies mal, auch die Kommentare. Passt zu unserem Gespräch gerade.", "missfield999": "I like to make this point to my daughter. Girls and women wear trousers all the time and have short hair cuts! You can be what you want wearing what you want!", "hayleychester_": "@scott.chester84", "paracelso_": "We should stop ourselves as psychologists in doing the psychology's fundamental shit: to generate categories for every fuckin' little thing. Why do we have to use and to create linguistic absurdities in order to breed what seems strange to us? If a man (but I don't know what I'm saying when I say \"man\", it's that it is said like this) wear a skirt why do we have to call him, her - or whatsoever - a cisgender? That thing, creature, minchia, it has a fucking name and I think we should use it first! He's not a cisgender or a transgender or a gender in general, in any way. He's doing a thing (wearing a skirt, lipstick etc) that is everywhen and everywhere logic, then possible. Common sense may feel upset in front of a scene like that, but we, as psychologists, as experts of the common sense, can't. To name the one cisgender and the other one heterosexual is a defensive operation, something we should strive for make it a past fashion.", "floralverdure": "@katiekazzam", "stephen_cassandra_eyre": "Agree with challenging machismo and transphobia. But if “gender is an artificial construct” then surely makeup and dress (artificial) DO disrupt gender, if gender is nothing but this superfluous artificiality? Saying they don’t implies that conversely you believe there IS an inherent gender and an essence of gender ? (Which is a fair viewpoint also)", "africabrooke": "MY THOUGHTS EXACTLYYYYYY! Thank youuuuuu!!!!!!!", "rachanader": "Damn so true. I used to used with this cis white guy who sometimes wore skirts. Ok cool. But he ALSO used to sexually harass all of the cis women at work making them feel unsafe and anxious and vulnerable. Good for him for wearing a skirt though.... 🤬", "epmakini": "Can I ask: are actions inherently gendered? Are prescriptions as well? @ihartericka This put together separate trains of thoughts together that I’ve had over the years— and showed me contradictions of where I put praise in genderbending. But I’m also trying to poke at my other conceptions. Asking for actions, does that make the actions themselves gender specific?", "madonnatriedtoadoptme": "@intersectional.abc", "chadetatuagem": "@ketrincohn", "scumdad": "@jeniferinnes", "madelinemcq": "Are cis women who wear socially “masculine” styles gender bending?", "rchlmtchll": "👏", "lavenderboy.jpg": "I hate the word gender bending because it only makes sense in a society where gender is this static limited binary thing. Clothing is just clothing, gender is vast and fluid, you can only 'bend' gender if gender has rules and it shouldn't. That being said I do get excited seeing ppl who are either visibly or vocally gender variant because I like knowing we are out there living our lives", "thelmaplum\nVerified": "Verified", "ashveg": "Thank YOU. This is my 4 year old. 💕", "norafelicity": "Thank you!", "aoieoeo": "Yes!", "jodiemwood": "❤️❗️", "rwandalicious": "Bloop", "manalidatar__": "@yopsicles 👊🏼👊🏼👊🏼", "royomo86": "@dabidm", "elliottfletcher16": "🤡🤡🤡", "scholarkardashian": "I am really interested in your thoughts on 'toxic masculinity' Ericka. I'm a masculinities scholar and the idea of one aspect of masculinity being 'toxic' irritates me because our current configuration of gender (as based in patriarchy and colonialism) is toxic as a whole. To me it seems like zeroing in on particular 'aspects' of masculinity allows for a kind of unproductive tunnel vision that ends with us talking ourselves in circles instead of offering options for flexibility in how we see gender. If you ever want to talk about your thoughts on the concept I would be super receptive to that!", "karucus": "This girl is on some shit, how has capitalism enforced clothing and cosmetics to be gender specific? Dresses and makeup have been associated with women for literally thousands of years", "jessicakilljoy": "Yes 🙌", "frabbejeais": "YES.", "nolimitschu": "There are only 2 genders", "wpom13": "The patriarchy can thrive in lipstick and acrylics", "reezyreezy": "@niclare along the lines of what we were saying last night !", "aprilmjt": "@iam_makaylaj Follow her.", "the_cosmic_queen": "Agreed. It's so performative.", "errn.nwa": "@ihartericka black sex ed tools?", "the.gabe.agenda": "I've been trying to put my fi ger on this!!!", "where.theres.smoak": "This is why I find gender ending so confusing because maybe I'm just confused about gender and I'm glad teachers like you exist", "jamie_windust\nVerified": "Verified", "jockey_coxswain": "@missponyweather those dudes on bumble 😒", "ophelia_obscura_obtuse_xqzmi": "❤️❤️❤️", "rachelblanchett": "THANKYOU FOR THIS❤️", "tosha.snaps": "THIS 🙌🏽🙌🏽🙌🏽 My bf wears my clothes and I wear his 😂😂 if it looks cute we’re gonna wear it out! Doesn’t matter if it’s a “women’s” or “men’s” item 🤷🏽‍♀️", "ltlyfe2": "Some of the fakest gender-bending I’ve seen is among white burning man dudes. Like ok u put on a dress and eyeliner but you’re still a creepy tech bro...", "n3tt13g": "💀🙈", "flying_tortuga": "This! 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "partypartynails\nVerified": "Verified", "sevnjames": "Well", "childofelderblood": "Ahh this is so good! So so true!", "maria_gps": "This is wonderful and a beautiful way to look at it however, i feel like it fits in the argument that gender is a social construct and unnecessary, which i think would invalidate the term \"gender bending\" as a whole. If your argument is to end that term in general, i'm all in, and because of the fact that you said that standing against social practices that are expected of your gender is the real \"gender bending\", you tell me that you do believe that the concept is real, and though clothes shouldnt be gendered, neither should actions or responses to stereotypes and gross behavior. I also fully agree that men wearing skirts and people praising authenticity is much more accepted for white cis men and that just... aint it", "lesmo91": "👏🏻👏🏻👏🏻👏🏻", "davidhopper48": "You are absolutely right! I never heard it put out there that way.", "kalimaamilak": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "eastbay_ladyk": "👏💥👏💥👏💥👏", "jordishelton": "@lily_bloomberg I thought u would like", "lynekalittle": "This relates heavily to my feelings when Jaden Smith wore a dress in an ad years ago. I had many feelings about it but mainly because the fashion industry making clothes that fit a thin 16 year old boy is the social norm.", "kar.pe.diem": "I always found this topic confusing, confusing because prior I just didn't understand and not because I didn't agree but because it's not something that's talked about often. Thank you for your voice, and for using your platform to Inform the uninformed. 🙏🏽 @ihartericka", "xoxashleymichelle": "I’m learning a lot. Thank you", "kieranblake": "Yes! let’s not assume because they are changing up their style that we then know all about their inner journey. Let them tell you about their gender.", "lovemolella": "Damn 🙏", "wilcope4": "all of this", "indikenz.lee": "I always take myself at my second thought about people.. 1st thought might be \"he's wearing nail polish. Maybe he is transitioning or gay.\" 2nd thought \" bitch that's pretty presumptuous of you.. no matter what his finger nail polish looks good and its nunya!\" 🤷🏻‍♀️ I'll admit, my first thoughts are NEVER the best thing I could have thought.. sometimes they are racist, fatphobic, or just not nice in general. Check yourself by reminding yourself it's always worth a second thought!", "robbiebadboi": "louder for the folks who claim they in the back but they right there on the front row watching.", "isaac_vie": "I wanna be educated on this topic", "nosreme_longshot": "Such a well put statement. Clothes are just clothes and makeup is for anyone who wants it. To me, gender bending is reserved for costume type work. When you are wearing a character’s costume who has been prescribed a different gender than you, then that’s gender bending. If it’s not a costume then it’s just clothes/an outfit.", "karazhang": "@shantibasu", "dwamdwamdwam": "thank you 👏🏾👏🏾👏🏾", "gasponce": "#yes👍", "bestnailsclub": "👏👏👏", "i._am._m": "👏🏾👏🏾👏🏾👏🏾👏🏾", "lolitathug": "🗣🗣🗣🗣🗣🗣🗣", "vidaglows": "❤️", "cyn_1222": "Thank you! May I share?", "creative.0utlet": "Wow, sis I think you need serious reflection. There is a difference between anger and bitterness, bitterness is never satisfied. And the goal post will always keep moving. Clothes and makeup ARE gendered! Individuals can deny the gendered dimension of their own choices but put them on the streets and you’ll hear a different story. DO NOT erase the power of dress as statement. There’s all kinds of ways to gender bend, and even for celebrities these are TRULY transgressive moves bc most of Amerikkka is not here or ready for it. I’m not a fan really of any one of these ppl and def not defending them for the sake of that, just scared af about the implications you’re sharing to everyday folx out there. Have room to embrace, and to afford different interpretations of their performance. You essentialize and idealize, beyond reach, what it means to effectively or properly do a thing. You’re creating a paradox for ppl, they can only do something if they’re gonna have a thesis on it, so act extensively or not at all. That’s not gonna work in the real world.", "katdoj": "I feel like the whole idea of \"genderbending\" in the first place trivializes trans gender identities in that it is usually cis people (cis white men mostly) getting applauded for \"trying on\" transness when what you think is \"genderbending\" is some people's whole fucking existence!! and those same people using the term or for who it's being used WILL misgender trans folks and do literally nothing to support those who made this whole fucking idea possible 🙄 like as a non binary afab trans person, miss me with any sort of applause for wearing a suit to a formal event. this is NOT \"bending gender\" this is my life?? I think the term should be removed from people's vocabularies but that's just me", "thearaed": "👏👏👏👏", "leilasadeghee": "You are such a high human. Thank you. 🙏🏽", "jjba.scoutie": "when trans men wear makeup/feminine clothing even ONCE they're attacked and called a \"trender\" but cis men get away with it no problem. i know this doesn't really relate entirely to the post but i'm still pissed off about how trans men who decide to be artistic and wear makeup are treated compared to cis men who do the same thing. in no way shape or form should either trans or cis men be attacked for wearing makeup but trans men especially shouldn't be, and yet they are.", "tanisalexis": "SO GOOD.", "fern.galindo": "Hold white men accountable for their complicity in the binary and the patriarchy. Makeup and women's clothes don't dismantle systems of oppression all on their own. They're just things.", "trillo.carlos": "🙌🏽🙌🏽🙌🏽", "tk.c41": "this is exactly what i was trying to articulate yesterday during the met gala!!! thank you so much this is so true", "el_chicanx_de_coachella": "I appreciate this post so much, thank you for this!", "j_a_zarifian": "Everything, EVERYTHING I read opens my eyes and opens my world. Thank you. Just. Thank you.", "janashareswithyou": "There’s nothing gender bending about men wearing heels when men are the ones who invented them...for themselves 😂", "c6969696": "@uma_talvezjulia", "alicat2011": "So then where do we stand on all the accolades for Billy Porter and Lena Waithe? They seemed well covered and received.", "pinknacl": "Pow! I am here for this.", "mayadb": "Thank you thank you thank youuu", "pretty_fatty_bk": "Uuuugghhhh!!! I love this perspective", "ellisrisesinsoma": "Thank you... I learning a lot. Black folks should embrace these conversations openly.", "wyketta": "I been reckoning on this for months now. And after I really took the time to deconstruct things, this makes so much sense.", "allijpal": "Gender is actions not items? Is that an accurate summary?", "girlonthegreenbike": "Yes gender bend norms🙌", "samantharise": "I was so troubled by this theme initially, because I knew there would be a lot of problematic celebration of thin, white queerness (esp. cis white men & women) rather than an out loud recognition of what Black Trans* and Queer creators. Your sharing @mm44rrzz‘ post about AAVE is so in alignment with this. Is this for attention, or collective liberation?  We need Vogue Portugal Lewks on that carpet.", "meow_miiix": "👏👏👏👏👏 my hands hurt from clapping so hard", "xo_ana": "Also still not here for Ezra Miller. It’s like people forgot he made that Darren Wilson docu. My foot still ain’t off his neck.", "orionastrologer": "Amen", "sarapolie": "🔥🔥🔥 thank you", "aespragoo": "This is the worstttt when cis men embrace their femme but are wild blatant misogynists", "ailurosfuriosa": "Hell Yes. This post will be on repeat in my brain for a while. So well said.", "the__m68": "👏🏼 👏🏼 🔥🔥🔥🔥🔥", "justariee": "I never thought of it that way. Thank you.", "apurenoir": "You taking us to church 😍", "bounce_n_jiggle": "Omg yes and thank you!", "silverscreen": "Because of this now perhaps i understand because I feel u unconftable about white cis men crossdressing. Perhaps it is because they want to 'win' a cheap way or because now as they are in a dress it is even harder to adress them about toxic male behaviour. They are like: hey look at me! I'm doing it right! ' and you are like: ok, now you are a dress wearing man who still doesn't put down the toilet seat after using the toilet. You are only looking better whilst doing so.", "ihartericka\nVerified": "Verified", "obi_mom_jenobi": "🔥🔥🔥👏👏👏👏", "sheflourished_": "I love everything about this post, my four year old son has a pink lipstick, and often wears my headband and accessories. - Because he likes to wear and try different things as kids and people do, I wouldn’t stop him, and I make sure relatives and adults around respect him respect his needs as child to explore and play.", "native7979": "I adore men in makeup njewelry Long hair. Courage", "fml_____666": "Thank you for that important thought! Could you explain why you're only holding cis men accountable in this post? Maybe i'm overlooking something, but i think trans men also have the power to question and deconstruct toxic masulinity behaviours, i mean we also profit from it,and should therefor be held accountable. Of coure that is just the case if we perform the picture of men that cisnormativity tells us is right, aka if we pass", "alexxakate": "ty!! does anyone have any advice/suggestions they’d like to share on how to bring this point up in conversation with friends who frequently use ‘genderbending’ this way?", "slutofthemonth": "👏🏽👏🏽👏🏽👏🏽👏🏽", "goldiehawks": "Omg thank you THANK YOU", "pizza_handle": "@lost.in.the_gnar @ genderbender this year", "con.error.fusion": "I totally agree. But that leads to confusion (for me!). I totally think that skirts and shirts aren't girly or boyish. They're clothes!!! So wear what you want!!! But then, what exactly WOULD count as gender bending? You'd just be wearing what you want right? So technically there's not really a need for the term gender-bending right? Gods, please forgive me if I said something ignorant... I just have had this doubt for a while...", "nonmaisohdismoi": "I've never thought guys wearing skirts n make up were doing some \"gender bending\" (waow they deserve a medal 😂), cause i never thought clothes or make up were gender sided, cause in fact, they never been. But in the end, it seems like we are started to free ourself about genders stereotypes, and that cannot be a bad thing for human beings, don't you think ?", "plantfrond": "Yes! You articulated perfectly some of my scrambled thoughts. I appreciate your content!", "charmeeifyoudare": "🙌🏾THAT!! 🙌🏾PART!!", "kindesaurusrex": "Especially considering heels were invented by men for men and EVERYONE wore makeup 🙄", "daisypenman_": "Yes to all of this!! It makes me so uncomfortable. Also — the theme of the Met this year being ‘camp’ made me kind of uncomfortable too as when I was growing up it was always a derogatory term for queer people, especially men. I guess it’s different in the US and in a fashion sense but I was so nervous about watching straight people perform ‘camp’ for fashion points when the word has so many other implications. Lena Waithe hit the nail on the head with her statement jacket. Everything about it hasn’t sat quite right with me this year and your points have put a lot of it into words. Thanks for being brilliant ⭐️", "robinsaurus": "@skullaine 👀👀👀", "mamabear_aj": "🗣PREACH PREACHA!!", "k6mil": "Yes thank godx. Y’all don’t get credit for performing gender congrats", "ruthtzipora": "THANK YOU (as always) 🙏🏻", "sweetp0tat0thighs": "I want to read some literature on this. Could you recommend a book for someone who is just learning about how colonization affects gender?", "maruskaalbertazzi": "My 2 year old loves wearing nail polish. I think it has all to do with creativity and fun and nothing with gender.", "lifeofabagel_": "@mattia_natale", "darthvadenz": "Thank you for allowing us all a spot at your TED x talk. 😍👏🏽👏🏽👏🏽🙌🏽🙌🏽🙌🏽", "hxd.eel": "I LOOOOOOOOOOOOOVVVVEEE THIS! I always viewed the Met Gala as more of a display/show for quirky garments and for someone (normally someone of colour - hello @lenawaithe ) to make the occasional statement because it’s such a big, eye catching event BUT what you’re saying in your post is something I’m learning to implement within myself because it is what it is! As much as we like to see primarily cis white men break the gender norms in terms of dress, we need to remember that this is actually nothing and that there’s more to so called “gender bending” than just what one can wear! I really hope that made sense hehe", "timiljones": "Teach the people ❤️", "blakgaybo": "TY ❤️", "neekatina": "👆🏼 la verdad! Gracias por eso 👏🏼", "chaoticrebxllion": "Everything you freaking post I LIVE for....please keep doing great work. You have no idea—or maybe you do. Lol—of the impact your words have on us, your audience, supporters, etc. ❤️🙌🏾😩", "lornajanemartin": "Yes! Wisdom 🙌🏻", "tsamael": "Were there not gender assumptions before capitalism?", "blqboyrising": "Can you explain which cisgender men you are referring to?", "n.yallah": "Heeeeelllllloooooooo", "noice.tea": "I was totally guilty of this last night. This really checked me on my own hypocrisy. Thank you for this lesson!", "gaytoastwithavacadoplease": "thank you so much @ihartericka. Reading your posts and listening to your podcast and remembering you from when you taught me at Columbia gives me so much life. Thank you for the labor you do in helping us all to decolonize our minds", "nev_shortfornever": "YES thank you thank you thank you", "florals_end": "You were so close to not being racist", "empalace": "Thank YOUUUU 💜💜", "lluluisa": "wow, good point! thank you ⚡️", "nic0tineb1tch": "Idk about gender bending specifically but people like Ezra Miller and Bad Bunny, are breaking gender stereotypes and expectations imo, especially bad bunny wearing those nails to the Latin Billboards Awards, given the fact that there is SO much machismo and homophobia in the Hispanic/LatinX community, I feel like I really helps open the conversation of “is what I’m promoting/supporting really a reasonable way to see things.” I feel like things like this and men “breaking societal norms” in huge events like the met gala it reaches more and it’s more of a “oh shoot” cause it’s an event that catches peoples attention and is very popular, it’s the perfect moment to make a statement.", "jeffren_illustrate": "🔥HIT ME UP FOR ARTWORKS: 🌟LOGOS,🔥 🌟CARTOON🔥 🌟COVER ARTS🔥 🌟FLYER/BANNERS🔥 🌟BUSINESS CARDS🔥 🌟ANIMATED VIDEOS🔥 💰PAYPAL/CASH APP", "sarah_cripps": "🙌🙌", "raininpasadina": "Can you explain where the term non-binary fits into all of this? I’m all for everyone expressing themselves however they want and I get that everyone might not fit into or identify with the male/female boxes we get put into as children, I don’t think there’s one right way to be either gender so I guess I’m just confused about the need for the term? I’m not sure how to phrase it better and I know I’m coming from a place of ignorance on the topic, but I really want to understand", "datdamnnatasha": "She came...she educated...she sashayed! #next #ilovemesumihartericka 😘😘😘", "aquilahlatiff": "@imansaleeem @_tasneemmajeed_", "h.c.___": "Come thru scholar! Wigs, heels, and makeup were first sported by men in the 16th century. But we know how selective memory works. 🧠", "brooklynsouthernbell": "Thank you for this TED X talk", "gemmahpea": "My straight, black boyfriend is a 'crossdresser' and I 🖤 him for it!", "mortilfjell": "Speak on it. I never knew how to articulate this thought. Well put.", "alto_acumulus": "🍌🍆🍑🥥🥝 real food for thought!!", "mashon221": "GREAT LESSON! I have a small example of gendering inanimate objects - eyeglasses. In my 54 years of life, I have only looked in women’s or unisex frames even though I like men’s frames. Now, as long as the frames will work for my prescription, pupil distance, etc. why in the hell would it matter?! Someday soon I hope to rock big bold frames without a thought to their “gender!”", "my_hipster_sister": "I noticed how the hosts of the red carpet show were eager to call it gender bending whenever that happened and it didn't sit quite right and now I have a better understanding of why.", "thebeautifulbanker": "This is so good. So good.", "napollonia": "A WORD. I saw a lot of praise last night for the white cis men in nail polish, lipstick, etc. but the minute Odell Beckham came on the carpet in a skirt he was called the F word.", "youngseedssun": "Thanks for gathering edges this AM", "change_clothes_": "This also goes for calling everything gendered names like “manbag” “mandals” etc when men wear something that has been feminised in let’s face it basically the last 80 years tops - like sorry for thinking men might want to carry items with them daily or have beach appropriate shoes...", "cpt_fakebeard": "🔥Real talk 🔥", "sxnoir": "Agreed", "madelina_monique": "I never thought about it like that, very very cool 👏", "fatgirldessy": "I honestly feel like all of these labels are pointless and stupid. Its been two sexes since the beginning of time and honestly this age has really been blasphemous to gods creation. Dont @ me i said what i said.", "paltaporfavor": "IMO. The met gala is literally a fashion event! Organized by capitalists, fatphobic, anti-black, and mostly white artists. We should not be praising anything anyone wears as critical of the system we’re in. That being said, some of the clothes are cool, they’re just not anything political or transformative of patriarchy, it’s just a fashion show. 👠", "thoseriverrats": "This made me remember how in high school I thought the goth boys in the long black skirts were SO COOL and groundbreaking and giving a big middle finger to gender norms. And now that I'm in my mid-30s I realize they were not (for the most part) any of those things, and quite a few of them have turned into asshole adults who have some super bad and wrong opinions about gender.", "robintemmink": "What/who would you consider an example of genuine genderbending in celebrity/mainstream culture? (If any) Thanks for answering questions 👌💕", "assatataughtme47": "THAT is a LESSON PROFESSOR! 👏🏿💜🙌🏿💚🙏🏿🔥", "snugsworth": "Yup!! And its not up for debate 🙅🏽‍♀️", "mas.0007": "I've never heard this term \"gender bending,\" is there a definition for this?", "oh_no_hiba": "You're one of the people that inspire me the most ! Thank you for sharing <3", "_erick.a_": "Could you define what cisgender means I don’t understand googles definition", "shutupmartha": "Ur saying harry styles didn't singlehandedly dismantle colonial gender norms???? He wore an EARRING", "chloesjarrett": "Not a question, just a big fat thank you.", "purr_is": "Yes!!!! It’s these same men who ‘dress up’ for a specific event/reason, who get applauded then turn around and hate on a man who is actually gender bending!", "deborah_arndt": "Eddie Izzard made a great point about this. Nobody yells at cis women for wearing \"men's trousers\""}