{"betty_lugo": "Ha!", "insta__bone": "When I had long hair, it would naturally dread up. Never once tried to dread my hair, but my hair was trying all the time. I have super thick, curly hair. Should I be ashamed? Am I racist?... Of all the things to divide over. LOL.", "olgaissad": "Dude, it’s just hair. Not that deep lmao.", "kehler_colon_": "RACIST", "gorda_y_que": "https://youtu.be/12ypylYz4wQ", "luuk.tuchner": "Dreads can be seen in such different cultures around the world even before globalisation, dreads is not a black exclusive hairstyle, because at the end of the day it is the result of not washing your hair....", "wabasspro1982": "Indians wore dreadlocks first, Ethiopians trading with them appropriated them", "karenm_quintero": "@sifuentesx", "morgann.tayy": "true they always look dirty w them", "oxox_030": "@fem_fat_ lol", "ck_lucas_": "White ppl with dreads are hot sry🥶", "soulofanafrohippie": "😭😭😭😭😭😭", "sophie.holt.90": "Yeah I say the same thing about black people with white hair. oh I'm sorry do u not like me telling u what to do with your hair?", "valllent1": "This kind of logic is ridiculous.. If we follow this logic, black person shouldn't use whites inventions...", "jaiden_ah": "“wHaT AbOuT bLaCk gIrLs wEaRinG WEaVe? oR hAvInG bLoNdE HaIr?”", "jmoe4343": "Bob Marley just made them popular, its not a Black thing.", "rieka__la.dea.metafisica": "I'm going to say this and I mean it gently and truly hope I don't cause harm but historically the spiritual element of locks is likely Indian and Germanic Vikings and other tribes wore them too", "karyn.n.n": "I just think it’s funny how black people get shit for having locs bc they’re “smelly” and “unprofessional” but it’s actually white ppl with the stank ass hair bc of all the shit they be putting in it", "maxyzgamez": "My aunt who was a hairdresser said that it’s actually very unhealthy for white people to have dreads", "focusfacialcare": "😭😭😭", "greekyogini": "@emmademaree this is the account", "alwaysgofurther": "You Americans are hilarious I swear. Y’all kill me.", "hail_bacon": "@ghostintheshade", "gagooooooooooooooo": "Lmao captionn✂️", "musingsandmovement": "https://www.ebony.com/style/history-dreadlocks/?amp  As cited by many historical references locs and their history, religious and cultural representation span across many cultures and is often in reference to worshipping the Hindu deity Shiva. There are religions such as even Judaism that have forms of locs.", "madhumatt": "👀", "sawbon3s": "@shikiii I lied this is it!!", "assholearies666": "@yunghunnidip basically", "nineteen_seventy_something": "Or you are black person and bleach the shit out of yourself just to look white. Smh 🤦‍♂️", "devmihel": "😂😂", "stev0.d": "@therldk thank you for introducing me to @effyourbeautystandards", "mikelmccorkle": "@haymccorkle_ 👏🏼👏🏼 please read the comments", "laegume": "Honestly I agree with this a lot, although it’s hard to admit it out loud- knowing that I’ll get hate for it. Honestly for a long time it’s just like white people have been shaming colored people for their hair, I even experience this, makes me wanna go bald sometimes, I hate being touched without permission, don’t touch my hair, I’m not exotic, stop. But then when you see them trying to do the same thing we’re doing with our hair- I’m just like,, “Excuse me what the fuck? I thought this was ugly to you? Why copy???” It’s just hhh- so confusing.", "erikatebbensconsulting": "😂😂😂😂😂😂😂😂", "carysjuliatrace": "In a western world with these eyebrows may be discriminated against?", "nudie.mag": "🤣🤣🤣🤣🤣", "lleyton.dacuba": "It’s literally just a hairstyle", "leeofdadbod": "@kadovi 💀", "not_oppressed_or_psychotic": "Yo... @ihartericka - I don’t know how you deal with the shit for brains humans trolling your damn comments, forcibly taking up web space on *your damn page. I keep getting notifications on this thread and I... just cannot. Please, you deserve every fellowship, every grant, every dollar & every coin. Thank you.", "karinnaf_": "😂", "gabyseeeta": "@paisas4lifes", "sophiasmalltown": "@m.a.x.r", "leebogal": "who cares", "avatar.filmz": "So do we cancel thor?", "christina.ptk": "I don't get why humans can't just be humans and do whatever they want. I think everybody should be able to have whatever he or she wants and do whatever he or she wants. Most people (at least in my country) don't do it because of racism, they just like the look and get their hair braided and stuff. I get your point but I don't think that everything in this world has to do with racism, this world is cruel but there are still 'normal' people too. Not to offend anybody but if this is supposed to be a world without racism, then it needs to be a world where people are free to speak their opinion too (concerning the thing you mentioned about deleting every comment defending white people, in my opinion it wouldn't be fair if you'd delete mine). I did not intend to offend or defend anybody I just think that fighting racism against black people with doing it on white people instead ain't a good idea... Please let's all just be a society where EVERYONE can wear, do, be whatever he wants and nobody minds other people's businesses, thank you. (I still get your point, just saying)", "a.tribe.called.black": "This is literally LIFE bruh😂", "sinclairgreen": "I think hair structure is super important. Would you say the same thing if another colored person, from anywhere, with straight fine hair put dreads in? Is this just a white attack? Y'all know Vikings probably had some dreads. There are light skinned folks, like myself (though I come from African decent), who naturally have hair that will not and dread when left alone. What about them? I realize that dreads are a part of a culture, a religion dont get me wrong", "tiny_treeline": "BRUH FOR REAL", "marwaneelouardi": "@nahelbki", "exclusivelykink": "I can't speak for Americans, but here in the UK, I have a good many friends who wear locs and who's ancestors wore locks as far back as spoken records begin. Not all locs are dreadlocks", "tired.art.kid": "What is more racist, enjoying a hairstyle because you think it looks good or telling a specific race that they're not allowed to wear a damn hairstyle because you think it belongs to you", "karenmlndz": "@susprincesss LMFAO", "___alicia_v": "Ur not cool for hating white people", "bean._": "@disco__biscuit29", "tahunter": "@rigatony9 💀💀💀", "salines_boutique_formentera": "I personally don't understand so much why white people does that. But wondering if it's same like black people straighting their hair or using straight wigs...? ❤️", "roseyhoney": "Damn this is #ignorant :(", "keeleybird": "In my early 20’s (ages and ages ago) I wore my hair in dreads. At the time cultural appropriation wasn’t something I was aware was a problem (definitely a problem in and of itself!). This was all before social media and smartphones,etc. I have to say these tools have broadened my understanding of the true reality of inherit struggle that exists for my sisters and brothers who are not white. I think dreads are beautiful and if I am honest it makes me sad to think that all those years I wore them I was perpetuating something awful...in ignorance! I am thankful for this shift of perspective and a deeper understanding of “why” it is just not ok.", "naomibesthere": "Totally confused but everyone has their own battle. I do not agree with cultural savagery but some of these comments seem angry telling people to cut their dreads off. What next should the Chinese restaurant stop selling Thai ice tea or should we stop eating spaghetti at the cook out. Cultural education is way more important. Physical judgement is so toxic. I am not defending some people who need a harsh reality check", "nizrocks423": "🤣🤣🤣 yes", "disclosure.rain": "I left a comment asking what's wrong with people (of any color) doing what they want with their hair, for some reason you deleted it, I think it's very serious that you're using your social media this way, saying someone can't do something because of the color of their skin is basic racism, please think about this", "__katie_may_1": "Dreadlocks symbolise the Rastafarian movement and the Lion of Judah, with the dreadlocks being inspired by the Nazirite’s in the bible who were not allowed to cut their hair as apart of their religious vows. The Nazirites were Hebrew and ethnically Jewish, stories within the Hebrew Bible refer to figures such as Samson as wearing dreadlocks. Rastafarian’s partake in the Nazirite vow which were adopted laws derived from Leviticus, which accounts for some similarity to the Jewish dietary law of Kashrut. Ethnic Jews have a variety of skin tones ranging in dark and light. Dreadlocks do not belong to one skin tone or hair type.", "indigo.persephone": "Lol", "pelzerk": "@danielgoldfarb1", "ejeyoung_": "How embarrassing", "kanagordon": "@elaine_projectpan", "shandacatrice": "😂😂😂", "kaybee210": "⚰️⚰️⚰️💯💯💯", "shuckyouverymuch": "😂😂😂😂😂", "americanpinniped": "Lol my whole town #eugene #oregon", "pixie_dust_fairy_m": "I don't understand... why?", "ericamichelle.jpg": "🕷️🕷️🕷️🕷️Yes", "nainycole": "😂😂😂😂😂", "its_chris_tea_ane": "YES YES YES YES YES", "thorpe.ii": "This person’s name is cultural appropriation and is outright theft of white culture. Bigotry is not okay. #intersectionality #intersectionalfeminism #culturalappropriation Just to be clear that was a joke. It can be hard to tell these days when people exist with such horrifically low IQs", "andrealapizza": "@lilouxontheflexflux point", "gates65": "I'm hollering I hate white folks with dreads! Gross!", "kandis_williams": "@whiterastapasta @devintroy", "bakerbang": "Can I have an Afro?", "meh_luve_kittenz": "💯😂", "pinko.the.damned": "White dreadlocks are called grinch fingers", "alxxeve": "@a_ml_t 🤣", "ninmagazine": "😅😅😅", "bashley_crashley24": "I’ve rethought a lot of things I read on your post and can humble myself to think differently after your thorough explanations. This one I fail to understand. Could you explain what damage is actually being done that white people having dreads are unaware of? No sarcasm at all, just legitimately curious because I’ve heard people explain their reasons behind why they get dreads and usually it’s something very meaningful to them that has nothing to do with race. What are they not seeing?", "anti1christ": "Not defending anybody but do what you want? Even if a whole comunity is against it?", "lindseyfagerstrom": "@_highlymelanated", "katemaryp": "@nick.smethurst ✔️", "ximenabironren": "there’s this white boy in my class and he wears a du rag and i overheard him saying “white guys can wear du rags too!”", "zipblokderby": "Ooo let em have it", "shungababy": "What about black girls with straight hair ? Unless deep unknowledge from me i could call that \"cultural appropriation\" too if i wanted too", "beingflower.pdf": "😂", "jimblebiblestudylord": "Someone explain to me how white people with dreads supports white supremacy. Not a troll just confused", "nelize": "Is it just me or does dreadlocks ON white people look disgusting. It always appears ratty, unkept and filthy.", "aestheticallypleasingcorpse": "I SCREAMED👏", "mahmawitch": "Why throw hate where you are getting support? Someone(no matter their color) supporting black culture shouldn't be met with bullying and criticism. Throwing black culture hairstyles, clothes, etc into the faces of racists should be praised! Trust me, a white person with dreads will piss off way more racist white people than it will piss off black people.", "bittersweett": "I had dreadlocks back in 2006. I'm so ashamed now 😅", "theonlyquixotic": "That.", "hurricanetheresa": "I had cornrows in fifth grade because my family members had them, I didn't realize my skin tone meant I couldn't have a similar hairstyle. I wouldn't do it now out of fear of offending somebody but it still doesn't make sense to me.", "aegala": "@analise.jpg", "daddy_goat666": "😂🔥👏🏻", "parenchymalkayl": "Lol yes. Lookin at you, Portland", "sydney.a.foster": "thatmfnpart", "jourdan_over_here": "@mccoypauley", "doulachristian": "😂😂😂😂😂😂😂😂😂😂😂😂😂", "fatimasees": "😂😂😂😂😂😂", "tinyvil": "@louchkaille, pour vos trophées.", "ricashelton": "I mean no disrespect, but all cultures have dreadlocks. I’m not saying everyone can pull them off but even people in Ancient Greece had dreadlocks, and they were white w red hair. I’m just telling facts, not opinion. And not trying to start an argument", "altguayaba": "Im half Filipino half white. If I do not spend at least 4-5 hours a week combing my hair, I will have a dread or two. I choose instead to participate in life and deal with the occasional tangled lock floating on my head - but this is a natural occurring phenomenon that has repeated itself since childhood. It used to stress me and now I’m mostly proud of it (it has bad days); Because it’s my funky hair and it does what it wants. I don’t know how this will leave me judged but I’m curious to see what feedback your followers have for me if any. Thanks!", "_praisethewitch": "Bahahahahaha i am dead 🔥🙌🔥", "somer.time": "Omg I saw a white guy with dreads while I was driving the other day and I stared him down. He looked very uncomfortable haha", "dunnrightglass": "That's like saying black people shouldnt straighten their hair lol that's just silly", "ambeezeyy": "Bwahahahaha", "allyroseh": "😂", "blackgreywhite639": "I find this hilarious as a white (i am puerto rican but look and raised in a white household) female with dreadlocks.. And i completely agree with you upon the format from which you speak. I started following this page because i want to get over anything that may make me feel uncomfortable as a white person, which it does not. I applaud and agree with what you have to say. So i thought about maybe i should reconsider my dreads. But i cannot, because i would be playing into a system that is playing all of us and turning us against each other. I refuse to be of this world. I also refuse to blend in with typical white culture. I am nature love and spirit, not my skin. I choose to celebrate those cultures that have saved me and brought me to a place of peace and understanding with all of the beings around me and all of the darkness that tried to rob me of such love and understanding. Plus.. My hair locked all its own haha. No chemicals no palm rolling, nothing tied around them to shape them, just time and tearing. I get you i support what you say and if it was said to my face i would agree because in the world you live, it is wrong. But i am not in that world. The best way to tear down the system is to defy it, not play into it and stand next to those it is hurting with full love understanding and support. I promise many posts like this have changed my view on a lot of things, humbled me and forced me to admit i am wrong. Which at this point i love doing, i have an immense love for failing and learning now. i have allowed this post to take time in my heart and mind and weigh and on my personal choices, and it probably still will after i post this just to make sure i really feel what i feel and not just a white defense post. I am against trends and would never put something in or on my body for fashion or vanity. My spirit means a lot to me and i take care of it so i can take better care of the world around me. Love. Sincerely. I dont hope to change minds because your thoughts are valid and important and will bring others to the right place. I just want you to know that some white person with dreads feels you hears you gets it.", "mellywesside": "@daniel_obrien", "the_faux_somniphobic": "🤣😂🤣 #loveit #butitstrue", "underwritteninfluence21": "*sips tea*🤣🤣", "gailm61": "@lovelystitch666 ❤️😂😂", "_lefish_": "Can I ask an honestl question. My partner has been thinking about getting them when he asked his stylist (and for those of you who are curious yes she is black) he called them dreads and she corrected him saying that teen was given by white people implying they were dreadful and instead suggested calling them locks instead? I'm just curious on ya'lls thoughts 🙏", "amilee94": "If Google tells me this is wrong but I want answers how can I get it? I follow you as a white person to better educate myself because Lord knows Society isn't set up that way. I've done my research as I have been interested in Dreadlocks for years, history doesn't state that dreadlocks belong to black people? Indians, Celtics, Greeks and more have dreadlocks predated further back than Black people. Its been a method used internationally to keep long hair maintained and functional. Could you provide the sources you say are so publicly available? So i can educate myself please.", "grannygreygranny": "@Tes sreedy", "zoesimoneknight": "It is a choice. But nah not that for it.", "biggerthanwe": "Ooo this gave me a good hardy chuckle 😂", "ludvigkingfors": "Tru", "domclark_": "@vivek.venkataraman_ @m8pettit", "vetiver_lbaker": "🤣🤣", "misskillemrox": "😂😂😂😂 I looooove him!", "kerenh": "@clowninthemoon ...", "johanneshoekstra": "Hypocritical", "lacyy.rae": "zhavia .....", "messinrotation": "@marie_0211 dommage il était bon en orga 😪", "oohchenah": "Never visit Bristol, UK... the things I’ve seen since moving here 🙈", "miguel2937": "Color your skin is.", "sunkissedmoonshadow": "Yeah my ex room mate who was pretty much a immature and awful toward me has dreadlocks now I saw her for the first time in years this week and I was like “yep, seems about white “ 🤦🏻‍♀️", "therefinedwoman": "Hahahahaha", "thesilen7one": "I believe you shouldn't be ashamed of your body, yes, but we're ignoring the fact that dreadlocks are a natural occurence and has been recorded to happen across the world throughout history", "kbailey92": "Oh god, or cornrows. I'm really sorry, I follow your page for inspiration and I never voiced my opinion until now. White people should never have dreadlocks or cornrows. I'm so sorry.", "lesley_bremner": "@alexandrews13 The truth!!!", "diabellysmelle": "😂😂🤣🤣🤣", "idonthatemenchilll": "✂️✂️✂️✂️✂️✂️", "ineverywey": "And people with unalome and ohm tattoos... Pretty hard to tell people enough is enough with those", "gazillionaire": "@dreameccentric bahahahhaha", "senpai_nicoo": "I still believe fashion has no skin colour, but whatever", "thealyssascott": "YO HAHHAHAHAHAHHA", "anushstagram": "or any other person who isn’t South Asian wearing bindis, “henna tatoos”, turbans, etc.", "mx.m.b.h": "\"cat barf dreds\" that's what I've always called those awful tubular dirty-blonde rats' nest \"dreds\" because they look like hairballs", "aquemini_butterfly": "& mohawks & waves & braids & cornrows & mullets & rattails &...", "catbytheseaa": "@choco_nunu mood", "queen._.mandi": "Facts😂🔥🔥😂", "julierbrown79": "🤣🤣🤣🤣🤣", "justdonteventryplz": "Always loved dreadlocks because of bob marley and when he explained what dreads meant to him and his religion is reason why one shouldn’t have dreads if it’s not apart of your culture race or religion. His dreads meant something. Not a fashion statement or because it was “cute”", "stackyangel": "🤣😂🤣😂", "iamsilenth": "Hahahahaha🙌🏽", "heather.louise.m": "Amen", "may.kuboresha": "I wasn't ready 😂😂😂😂😂", "toni_geurts": "Dead 🤣☠️💀", "lyons.kristi": "It never looks right on white.", "colecocacola8896": "HAHAHAHA yes!", "melaninmonheaux": "I’m a licensed cosmetologist. Caucazoid mats are disgusting. Those are not dreadlocks. It’s matted hair and they need to stop it. I absolutely have to repost some of these hilarious comments though 😂", "ultraaveragehkr": "✊🏾", "sinead_made": "Stop it I'm on the bus 😂😂😂", "beatricebearruns": "I try to explain this to other white people and it never goes well, but I will keep trying 🤦🏻‍♀️✂️✂️", "larynanise": "@gabriella.monett FACTS", "moonbeamk": "Lmao.....", "elladrinksoatmilk": "@zhaviaward", "princexleah": "😂😂😂", "rachelislux": "🍵 🤣🙌🏼", "awesomeeveryd": "LMAO YES", "songforthegirl": "@gheemrev 😂", "_mad_de": "Hahha lol this is hilarious ! With this kind of crap we are never gonna change. Its like people up north should get offended by people who color their hair red or blond??! Dreads has been worn in the north as well not by the vikings but by shamans 🙄", "crystal_cave": "💯💯💯", "littlewinsmusic": "🏆", "scott_free_23": "Dread is an insulting term towards Black People.. The British feared us and they referred to us as the DREADED.. Africans (WE) wore our hair in locs back then.", "claddywood": "BOOOOOOOM 💥💥💥", "halfbreedhippie": "@moniqueasmiley spits tea", "chiconut": "😂🙏😂🙏😂", "lailawoozeer_": "Oh my god this tea what anflavour", "leafcakelife": "😂😂😂", "elizabrumbaugh": "😂😂😂", "alottieweed": "All these white women trying to get free intellectual labor out of black women just because they can't deal with the fact that they did a racist thing. No matter the part of the world you're in, no matter who did them - it is still appropriation and it's still racist. How is this so hard for other white people to understand? I hate excuses like what I've seen above, all feigning ignorance and grilling black women about things they could easily just fucking Google. Hey, white ladies, maybe you'll listen more if it's coming from another white person: LOCKS AND BOX BRAIDS AREN'T FOR YOU. PERIOD.", "itsalrightlittledarling": "I'm sorry I don't want to offend anyone this is just a question becauee I don't know better... What's the problem with white people having dreads it's just a hairstyle isn't it?", "sunriseindisguise": "Also girls in headdresses...", "katie.honor": "as a white girl please listen other white girls that may have gotten offended: YALL DONT NEED THOSE STYLES AND THEY JUST LOOK RATCHET ON YOU. if someone told you they looked cute on you or promoted you to get the style, that someone is lying and not a real friend.", "morganism.3": "@manifestarnold", "mjstreet": "🤣🙌🏾💜", "letty_morris1": "@connorclune", "laurensteury": "please tag anyone in grass valley/ nevada city", "nicoleheinen.nl": "😂😂😂😂😂😂", "b0mbonsito": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "ayaakkad01": "Can someone tell me what’s wrong with white people wearing dreads? Not trying to be mean, just want to know haha so pls don’t attack me", "danielleeugeniaphotography": "Seriously 😒", "devalux": "Dear White Caribbean males...", "melissadlando": "😂", "davecadario": "Isn’t that the same thing as saying black people cant straighten their hair?", "ellachristenssen": "Its just a look they like tho? I’m not hating just saying. Can’t they look like they want? I don’t think they’re trying to violate any culture. If we wouldn’t be able to do something that originates from another culture there wouldn’t be much we could do. Just saying.", "miss.sweets2019": "Hm, I don't understand. Why isn't it acceptable for white people to have dreads? What about Hispanics, or is it only unacceptable for white people? I don't understand.🖖💜🦉", "amelaiaa": "😂😂", "st0nefruit": "My fave is when they use celtic or viking culture as an excuse, u know who else romantisize those cultures? Nazis bih", "ragina__rage": "Yesssssss!", "bigbadbanshee": "@dj_fattony_", "chocolatebarbri": "I guess the thing that confuses me aside from the pure absurdity is why anyone would purposely want to look like hot garbage. And no Linda, you are not the exception. All👏🏾y’all👏🏾look👏🏾a👏🏾matted👏🏾musty👏🏾mess👏🏾. Argue with ya MeeMaw. 😑", "juicyjayfox": "Daaamnnnnnnnnnnnnnnn!!!! Drops mic. I’m in the hair industry and I go on and on about this. I also include braids/singles and corn-rolls in this same category. I sometimes waiver in my own thoughts - thinking - should we be so harsh for someone wanting to express themselves via a hair style - then I remember - and think nawwwww. I ain’t putting that shit in your hair 😩😂😂😂", "ruthkburkeart": "yep.", "emcclureot": "😂😂 Omg YES! Definitely shame for those dreads. Shudder.", "lucassilveira\nVerified": "Verified", "sammygocreate": "@kaylee_jeanie idk why but it made me think of tou", "andrea4775": "😂😂😂", "aliceskyewatts": "I've grown up around people that showed/taught me that- dreads on whoever were complimented and whatever hair on anyone was not judged. I understand culture appropriation but if the white people I know with dreads never knew that it was doing harm or never had intentions of harm only saw it as a hair style, then why are they wrong? Also surely the way that cultures grow and evolve are because they're shared, for example I when I was in India and in certain places the locals place bindis on ur forehead regardless of who u are, is this not just sharing and passing things on? Could this not be the same with hair? (I ask these questions to learn to to cause offence)", "rbl484": "Yes because by not washing your hair is how you get dreadlocks as a white person. So yes.", "svssy_": "😂😂😂", "callmegoddexx": "I agree with all of this except for the investment in shame culture. Shame is a destructive force, not a generative one, and if we continue to use it to motivate behavior, we’ll continue investing in energy that breaks all of us down. Yes, white people love to colonize shit, but I think we can learn other ways of moving through the world w/ desire to care for it and it’s beings fully, instead of using shame and the fear of isolation to drive us into action.", "4350n6942w": "👏👏👏", "caseyvstel": "!!!!!!", "shadyynastyy": "I brushed out my locs because of you (and I mean this in the most positive way!!) thank you for brining to my attention that that hairstyle does not belong to white folk. ❣️", "lowcountry_mom": "😂😂😂👍👍👍", "jmade_ventures": "Lol 😂", "messytessie": "🙌🙌🙌🙌🙌🙌", "meliseymo": "👏🏾😂😂😂", "vaginarchista": "@marcovonsexron", "michhax": "@thejemilaful Deaddd😅😅😅", "ladylibra333": "IMO I don't agree with white people and dreads but at the same time black folks be weaved up in Indian hair... Clearly ain't your hair, but this is ok? Why? Because it's fake? White women do this too. Are they appropriating or appreciating? Is there a difference whether it's a wig or weave or real? Are Indian women offended?🤔 Or is it just simply because of the stigma attached to dreads/braids that it's not okay? Sincerely asking...", "new.account.who.r.u": "I WOULDNT EVEN CALL THEM DREADLOCKS THE TEXTURE OF THE STRAND IS NOT THE SAME WHITE PEOPLE DONT HAVE DREADS THEY HAVE MATTED UNKEMPT DIRTY HAIR. Don’t disrespect the lock.", "nikaiyarae": "@softieshan 👀👀", "_geralartist_": "Humbly and lovingly READ UP: @she_is_of_the_woods @alliedreads", "natalierosegresk": "👏🏻👏🏻🙌🏻🙌🏻🙌🏻", "wanderertii": "May I ask what is the goal here? Where things better back in the days when white ppl didn't have locks?", "amrieej": "TRUTH", "taracioletti": "👏👏👏👏👏", "thesensualnonconformist": "I've seen many comments referring to @ihartericka as a black woman. Please be mindful that Ericka is very open about their identity as a Black Non Binary Femme. ♥️ P.s. this post is everything.", "pleasureshaman": "I truly cannot understand white dreads why do they do this? It’s so .... dirty.", "theprancingbear": "@inked_maloncye 🤣🤣", "jellyjellybobelly": "All I know is that someone in these comments called them “grinch fingers” and I am dead for at LEAST a week. 😩😂", "itsjnm": "@anoeskaschmidt 🤣🤣🤣🤣", "ellenty": "went to go retweet but they deleted 😔 glad it is preserved here though", "sealfisch": "or chopsticks in ur hair (that’s not a thing we do what???)", "jinniemannion": "FACTS 👏👏👏 @carolinejjordann @jackiegargas 😂", "chynamonique_": "@aarondeadalus", "hubcap_molly": "Lolololol", "gigisimms": "@hannah__barbarian SNAP", "ecarteaux": "I had a some white people argue this with me sayin it’s okay because it’s a “hippy thing too”. Smdh. It’s appropriation and I ain’t here for it. ✂️✂️✂️✂️✂️✂️", "ataylo79": "@blusbraidery 😂🙌🏽", "eclectixsoul": "👀", "hazey_fantazey_": "Even the people I would have thought knew better than this go around saying white people dreds are cool. Like please stop. It's our job to call white people out on this kind of culture appropriation bullshit!", "h.hecate": "As a white lady in the crust/hardcore punk scene, I’ve had far too many experiences with white folx with dreads. My now ex had some Drifters, Oogles, Vagrants or whatever you call em’ crashing at his place one night and the one that claimed the couch had dreads. To make a long story short he had lice, we had to disinfect the couch, and when we were cutting the dreads off we found actual mildew in them. To this day I’m still shocked I didn’t vomit.", "rach_grams": "There’s a white woman who works at the coffee shop down the street from my house who has dreads and I always want to tell her to find a new hairstyle. Dreads do not equal “hipster”", "koyukipanda": "Lmaoooooo", "yolandafinette": "Dead", "hair_by_gina": "🙌💪🏾🙌💪🏾🙌", "wild_fire_yoga": "I miss my dreadlocks.", "sugacake88": "I am gaggin😂😂😂😂😂", "cjames139": "@godner 😂😂", "juliuslstonejr": "Hair for us black and brown folk is a hurtful proud sad and sensitive topic. But we as people got to pick and choice our battles if. And if your telling white folks to cut their dreads. Lets get to our people and tell us to stop using bleach cream wearing weaves and perms and go all the way natural.... yet again we have to pick the appropriate battles......oh and please yall i am going to leave this here. I 👏🏿said👏🏿what👏🏿I 👏🏿said.", "naomi_the_anthropologist": "😂😂😂😂😂😂", "cairoamani": "😭🙌🏾🙌🏾🙌🏾 Truer words have never been spoken", "sensicsx": "@shilo.x", "deadly.brunette": "What about the white ppl wearing Native American war bonnets to festivals and raves. They won no victory they are not entitled to feathers. Full stop.", "bloomiebloomie": "I get into this debate with family members regarding their friend and they never seem grasp my issue with it.", "queen__lou": "Lmaooo is wq", "selenasstory": "Period.", "myfitchbad": "Ericka...... you came to speak at our graduation last week and i just feel like saying thanks to you an others for calling Hampshire College the FUCK out! So much respect, always been a fan feelin really lucky to have gotten to hear you speak in person bless you", "meganb1226": "🤣🤣🤣🤣 accurate", "realsabijoy": "💯💯💯💯💯💯", "sshariskahh": "I tried to explain this to a yt coworker and they were not happy. They’re response was “well it depends who you ask if it’s okay”. Then they added “People get henna, so it’s kinda like that”.", "dyme.203": "I did a poll for this question and re results were interesting... share your thoughts: What’s worse? White people with locs or white people with box braids? 👀", "_.lenoraaaa": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "faithkeln": "@trashwise", "teacher_perks": "👀💀 😵 👀 💀", "catherinenestor": "Or all of the little white girls who come back from cruises with beaded braids...", "firesquirrel8": "Haaaahhhhhahahha", "flowshazflow": "Far and away, the most painful part about seeing white people with dreads is the denial of self love. You are beautiful the way you are, you do not need to copy or consume another culture to find beauty or uniqueness or richness. That comes internally. The whole history of dreadlocks (and I'm using this term specifically) is that you are accepting yourself *as you naturally are*, so putting in glue and string and whatever else to make yourself a certain way, defies the very meaning of dreadlocks themselves. I encourage people to love themselves in their most natural state!", "majlindstrom": "😂😂", "jazztheyogi": "Question: what about Latinos and locks? My husband wants locks and even though he's Puerto Rican he's white as snow and I tell him not to all the time.", "__krisanthemum__": "Lmao yup", "_w.a.n.d.e.r.e.r._": "🤣🤣🤣🤣", "thinkuthink": "😆😂😆🔥", "rootedresistance": "@camealashley", "kp2at": "What's a good resource for me to share with my white family and friends who don't believe in cultural appropriation? I literally tried to share what I've learned and what I've seen and they got so mad at me.. please and thank you ♥️♥️", "the.yase": "Hahahahaha", "soulwithbeauty": "White people have identity issues after stealing everything from everyone else. Blacks, Mexican, Native Americans anything they could get their hands on.", "bethandodie": "I mean dreads look terrible on white people so idk why they do it anyway.", "lizziewarren04": "No excuse. We're assholes.", "hood_montessorian": "Lawd yes. When I catch their eye, they want some type of validation for their appropriation. Nah you don't get a Black jigga nod...", "jeniaron": "Hahaha hahaha. True", "sauxy.__": "But when they do “dreadlocks” they aren’t actually dreadlocks. Just long matted pieces of hair 💀.", "charlotte_marieke_aleida": "But why? (I really don’t know) 🤭", "gigi.jr": "Lmfaoooo 😩😭😭 But fr I’m still so shocked every time I see them, which is actually far more often than I’d like to admit. They’re so gross anyway! White hair wasn’t designed for it.", "absterglo": "I feel sick", "jipsioceana": "🙌", "jmsantorawriter": "Normally I'm not about trying to regulate other people's bodies, but WHY DO MY FELLOW WHITE PEOPLE HAVE TO DO THIS???", "kmunro._": "@shantellekia omfg RIP haha how good is this!! Sooo true", "marielle26rose": "@the1sham yuppp", "hanmetcalfe": "Love this so much 😍😍 completely agree", "death.becomes.han": "Amen", "mercedesmaringonzalez": "Thisssssss 🙌🏾", "straponce": "White can wear what tey f*** want and black same who have bariers must be ashamed of himself", "sonja_1988": "👏🏽 Yup. That shit is gross", "felixbeeslyodinsdottirtyrell": "England is so bad for this especially dreads and canerows", "raesdick": "And I oop", "oxx.x": "????", "other_surrealities": "The scissors make me think of Us", "kellirisitano": "Yes.", "jenn.medinah": "What if that little white blonde girl has a 3c type of hair and dreads make themselves everyday (I actually fight to they don’t!) it’s impossible to avoid it!", "mstiffanyrueshaun": "😂😂😂😂", "_johanski_": "@ihartericka sry for this question and for my english. But mean you this serious or is this a joke? Whit people, no dreads", "effortlezly": "It used to bug the fuck outta me that i had a roommate who did this. Her hippie ass couldn’t wrap her high head around why it’s such an issue. I left after 6 months. When I did I told her the dreads looked awful on her 🤣", "letsbloombaby": "😩😭😂", "mary2ana": "@sabina.heinrich 😂😂", "tara_bluecloud": "🤣🤣🤣🤣 Omg I fucking LOVE this.... I locked up at 15 years old, wore my dreads till 21 when I was parting & doing a bunch of dumb shot so I knew I could no longer represent. It was an honor & a huge eye opener to what it really means to wear dreads. As a white chick born & raised in Ifa, I am always defensive & skeptical of any white person sporting dreads... But we all have our own story. I miss mine, though now with the state of our country (USA) I could not lock up again, in respect to the fight for justice/freedom & balance that needs to be won. 💯💚✌️", "tommytryhard_": "Yeah, I hate whitey too!", "6georgiaturner": "@gato_gals", "frombuyingtobabies": "@jordie.jords", "kirsten.autumn": "This goes for non-black people as well I’ve seen too many Hispanics and Asians with dreads as well hanging on by a strand of hair 🤦🏻‍♀️ I bet they say the n-word too.", "ferrissmason": "Trill as fuck! Got in the elevator at my apartment yesterday and there was a white girl with think ass black dreadlocks- shade of vampire. 🙄🙄🙄🙄", "rosie_nickelsen": "@katienope", "fruitgillette": "Are Mediterranean people considered white? And if yes, I get it for Spanish or Italians but for example Greeks? Or west Turkish? 🌼", "cool.cxt": "HWHAHHAHA IM CRYING LMFAOOO", "danielletridenti": "@amylynnmiller", "sunhustler": "100% @lillibelle", "rachel_freegard": "👍🏻❤️❤️😜", "emmakenty": "@fayefun 🤣", "muniba87": "@lindsay.adventures 🤣🤣🤣🤣", "_spongeworthy_": "My mom is a white woman with dreadlocks. We live in Portland, OR. She says she has no plans to cut them, as I often suggest. She’s had them about 9 years. I’ve tried to have the conversation with her about why it’s not cool for her to have them, but she doesn’t want to hear it. My mom is a person who is generally conscientious and aware when it comes to her white privilege and has absolutely no tolerance for racism, yet she believes her dreadlocks are okay because no one of color had ever said anything to her directly about them, so she seems to think everyone just loves them. I don’t. Many others don’t. I don’t want to create extra work for you, or ask you to perform more emotional labor, but if you have any advice on how to talk to her, I’m all ears. My words have fallen on deaf ears, but I want her to hear not just me, but all the people who are turned off by seeing a while woman with dreadlocks, and I want her to fully appreciate why her choice is very problematic. 🖤", "dubbalow": "Its such a contradiction like... i dunno just deep. I was just talking about how an old white lady literally was petting me asking about my hair and if it was real when i was called for jury duty. Took every ounce of me to not pop off in that courthouse", "elizaspaghetti": "@gavinotantaroba", "ladymahogany": "😂", "wise11111": "I truthfully don't care if white folks wanna wear dreadlocks sense so many cultures have been doing it going back probably sense the beginning of mankind. But i was disturbed when i click #girlswithdreadlocks recently and almost all the pics were of white females with one pic being a black female after several white ones. Like how are the most popular pics of ehite females?! That doesnt even make sense to me.", "hoelivia_newtonjohn": "😂😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣🤣😭😭😭😭 I NEEDED THIS LAUGHT THANK U QUEEN", "valentina_sie": "@sebastianandstuff", "moniquemarcelle": "I’m not very education in this, so I can’t defend anything, but I do have a curious question! 😁 What about flat hair and/or thin hair? Is that seen as inappropriate? If a person with an afro flattens their hair etc. 😌", "mar.ailenroc": "Well said👏🏼👏🏼👏🏼", "lafillelee": "😭😭😭😭😭", "caitcait88_": "@christinaarandall ☺️", "memoryfoam": "denver is rampant with this 😔", "masc_sof.t": "@magicisbrown", "bek.eliza_": "The worst.", "ameliaking________________": "Ha! 💯💜", "skyisfly": "😂😂", "thelo_is_a_lie": "the cackle is real 😭🔥", "minous1981": "🙈😂😂", "mille.tonnerres": "Yes Ericka! Now how to make that clear to Estonian people ..... ?", "rayemk": "@notmissscott", "jessicakilljoy": "😂 🙌🙌🙌", "dutchashell": "Truth #fuckTrustafarians", "2020burner": "Lol there’s way more shit to stress over than white people with fuckin dreads ! Y’all are sick , tackle actual issues first . I’m sure you’re the type to be on the shade room too .. smh . So weak minded", "pillow_princess_jordan": "👏🏽👏🏽👏🏽👏🏽😂", "_strawbrey": "They are aBUNDANT in Germany and it makes it very clear that Germany has not yet grappled with their history with colonization yet", "maria.zalez": "Serious question! How do I approach someone about this if I myself am not black? I know someone I’d just love to sit down with and talk to..", "zmar0129": "FACTSFACTSFACTSFACTSFACTS @janiobi @kenthethird @theswaggyblerd", "miejohanne": "@karenmulleer forstår godt det her, men alligevel synes jeg den er svær 😬", "forever.fibro": "Ngl I laughed at this", "theimplord_": "Also I’d love to have a conversation instead of being deleted. 💕", "santa_banevi_photography": "Seriously? I thought people have a free will.", "natasha_toushka": "👌🏽🤣💥 This is everything !", "abbacchio_": "@flyingfistofjuda", "my.little.creature": "😂", "suici.de.u": "Lmfaoo i love this😩", "lagatadama": "I feel the same when I see a black woman with blonde hair.", "lady_from_kibungo": "😂😂😂✊🏾", "georgiamaree9": "😂", "becky_stern_90": "Does this go for white people with afro and yes i have seen it Mohawks braids of any kind If you type in white people and braids articles will pop up saying its k to wear them", "treasure_617": "😂😂😂😂😂😂", "imablackkat": "they're cute asf", "jessdavenportvalencia": "I had this conversation about cultural appropriation with my (liberal democrat) MiL where she said, “But what if [my stepson] wanted dreads? You wouldn’t want someone telling him he couldn’t?!” I was like, “*I* would be the one telling him NO.” Couldn’t get through to her at all.", "daddypuss.rex": "Screm", "steph_janedoes": "@pega_megasus 😂👏", "shorthairidontcare": "Ugh I dated a white guy with dreads in my early 20s... oh the lessons we learn 🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️", "pattydivine91133": "😂😂😂 I like the direction this statement went in", "nerdalert1983": "The worst! 🤢", "vbernal84": "😂😂😂😂😂", "kizzdizz95": "@doggo94 Lmao", "scott.pocket": "My dog barks at white people with dreads. She seriously hates one of our landscapers, ONLY the white guy with dreads", "jyamlet": "@sanchor17 🤣🤣🤣", "anwiilli16": "@hizzmajesty", "brittanylittleton": "L O L", "charmeeifyoudare": "😂🙌🏾😂👏🏾🙌🏾😂👏🏾✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️", "girlnamemusic": "lolololol", "laurentlollies": "@ branded_dreads is literally so cringy and I never see anyone calling them out for how bad they look...and they work with a few problematic rappers I saw...big yikes", "ashy_clown": "Hahahahahahahahahahaaaaaaa", "aunty_vei": "Or any non-Black person with braided extensions.", "miacathrine__": "@olivia_olivier_ 😂🙌", "jrpiv": "Yes!", "korc.can": "Or black men with straight hair are the worst.", "vivivigliar": "Hahahahaha", "mama.yhanni": "😂😂😂😂😂😂😂😂😂😂🙌🏾🙌🏾", "healwithbroocke": "Haahaahhahahhhhaahhaahaha", "georgibw": "@jaymie_lee_fines", "lilnoosh": "😂😂😂", "callmelatasha\nVerified": "Verified", "mugsgitau": "😂😂😂", "queen_moinya": "I had my Latina coworker ask me if she should get box braids. The fact that she even asked me shows that she may think she shouldn't. I told her she shouldnt get then because they will snatch hee edges out. Then she bringa it up days later to our other intern who is Liberian and she encourages her to do. *eye roll*. I told the coworker they take like 12 hours to finish and she said she wont get them bc thats takes too long. How do u feel about Latinx ppl getting box braids, locs, cornrows etc when they are NOT Afro Latinx?", "chantilly.xo": "I think box braids are gorgeous! Even when I was much younger I loved how the black girls styled their hair in primary school. I wouldn't wear them for the reasons others have stated above, but just wanted to say I think you all look fly. White people definitely got stuck with the worst hair of all haha!", "criticalchemicals": "I tell the white people in my life everyday about this shit 🙄 they always argue me saying it's been done in all cultures blah blah blah. Like \"when a black person tells me it's not okay I wont do it anymore\"", "kristen__stephanie": "💀💀💀💀💀", "a.wang16": "@_elyssa", "thespreadpod": "🤣🤣🤣🤣🤣", "thisrawsomeveganlife": "S C R E A M I N G", "blankfrank801": "Or a white girl with a feather head dress at a festival.", "slynbutter": "Delete", "holy_sponge": "@sister_spinster 😂", "_______ec_______": "It’s RAMPANT here in Seattle 😑", "plantbaee_": "Grinch fingers!!!😂😂😂", "paddycakerz": "Ha ha ha! So true!", "anxiklhkpie": "Sorry @huntea_3721", "chaotickatie_": "@venekira you yelling at that new kid at work", "stephaniejohnsen": "Ummm yes! bring the ✂️ to Portland/PNW", "juguayye": "@muskaansandhu", "imheatherbrown": "I live in Colorado and should probably just carry around a pair of ✂️ for this", "cbaldwin39": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "leah_athena": "lmaooooo yessssss", "9_melissa_9": "😂", "_raeghn": "I saw one today and wanted to cut them off for him."}