{"pandazbear": "HAPPY BIRTHDAY EBONY❣️✨", "sitaraslove": "Happiest Earth Day", "yamalo17": "Happy birthday Ebony 🙌🏾🙌🏾❤️❤️✊🏾✊🏾🎉🎉", "casey_meisie": "What a beautiful dedication ❤", "laverdadera": "Eb’s spirit is a gift! Happy Birthday, Gemini!!", "sophia_roe\nVerified": "Verified", "crabecca": "This is the sweetest thing I’ve ever read😭", "juxtaposebeauty": "😭😭😭😭 so friggin beautiful! HBD from a fellow Gem Ebs", "african_king777": "What’s his Instagram", "crumpled.clouds": "Happy belated birthday Eb ! 💕💕", "maryjanek90": "Lmfao at his old white man asthetic😭and your love is so fucking sweet", "felipefloppy": "Yall make me cry, laugh, spit out my tea, etc. thank you for your love and for your work.", "mickisuelovesyou": "This is the best birthday post I’ve ever seen and hope someone someone writes something like this about me! This is just beautiful. I hope my friends and friendships blossom into this. 💯🙌🏻💋✨", "kbx9ph": "You two are a beautiful couple, many more happy birthdays ❤️❤️❤️", "emilytebbetts": "Happy birthday Ebony, you are a gift to this world ❤️", "lori.sara": "Happy birthday ebony!!!!! 😭😭😭💕💕💕✨✨✨ Stay blessed!", "theotnerd": "Happy Birthday, Eb! It’s was a treat seeing you! Hope the day was incredible!🤩", "blacknghostly": "Happy Birthday, I love Ebony!!", "lebone_lamasebe_madisha": "Happy belated birthday to EB ❤️❤️❤️❤️😭😭😭", "pinknacl": "Such a gentle soul🌸", "_equinnox": "Happy birthday to a fellow gem that truly illuminates the world for so many! ✨✨✨", "neyon_tree": "Happy birthday Eb ! You are exceptionally phenominal ❤️", "nicole13rae": "HAPPY BIRTHDAY EB‼️🖤‼️", "tipsyelves\nVerified": "Verified", "caityriley_": "Happppy birthday EBONY!!! I absolutely love the photo with the shorts you look SOOOO DAMN GOOD! Hope you not only have a great day but a great year and keep doing you💜💜", "word.of.goddess": "Happy Birthday Ebony!!! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "la_diane": "The most beautiful caption & dedication 🖤", "brrraabrrraa": "Happy birthday Ebony ! ♥️😻🔥", "rachelmerkle3": "Happy birthday Ebony!!!!", "piupiuvegan": "From a fellow Gemini I wish you the happiest of birthdays Eb!!!!!! I hope you had an amazing day!!! You’re a gift to this world ☺️", "ericanubia": "Happy birthday Ebony !", "michelle_hathaway": "Happy Birthday Ebony♥️. These are the sweetest words. Have a blessed and beautiful celebration.", "livia_von_namibia": "Beautiful celebration of life and love 😍👏😢", "theroguewarlockmonk": "Happy Birthday!", "miki_moonchild": "Happy birthday to dear Ebony! ❤🎉", "kingagetsherlife": "Happy birthday Ebony! Hope it's a special one!", "joh_makes_music": "Happy Birthday Ebony!!!!! ❤️❤️❤️", "rrachaelppotter": "Happy birthday Eb❤️ you are SO BEAUTIFUL", "karwitha_kirimi": "Many blessings to Ebony.", "ohboilin": "Happy Birthday Ebony! Bless your handsome smart soul this coming year and the many after! 💕🙏", "trash_kitty0": "Happy birthday ebony!!!!!🙌🙌❤️❤️❤️🎉🎉", "kandis_williams": "❤❤❤", "queeringqueering": "Ps I wasn’t ready for the Luther Vandross tee 🏆🏆🏆🏆🏆", "knitwithme": "❤️happy birthday to Ebony!", "rose.russ": "❤️", "lesleysaundersx": "Rocking that Birthday Suit, lovely", "gilleonsmith": "HAPPY BIRTHDAY EBONY!!!!!!!", "tequila.enema": "Ain’t no combo like a sag/gem combo!💕 🥳", "change_clothes_": "Such a beautiful tribute. It’s so obvious how much joy and love you celebrate in each other, truly goals! Happy birthday Ebony! 🎉", "bonesteeth": "Happy birthday Ebony!!! 🖤", "neex.k.c": "🎉💕🎉", "marthasmarthaa": "HAPPY BIRTHDAY EBONY!!! WISH YOU NOTHING BUT THE BEST 🎉🎉", "theafrodisiak": "caption got me like 😭😭😭😭", "hannahlboutilier": "Such beautiful words. Happy birthday!", "australiansexologist": "Omfg @ihartericka Gah! This is lovely - the moon thing - 😭 and oh my heart ❤️", "magic.skeletons": "Happy birthday!", "kwrez": "ebony feels like one of those people who feel too special to be real. happy birthday", "shelbemara": "Happy Birthday Ebony!! Thanks for sharing your words and wisdom the Instagram world. Catching you and Ericka talking about anything and everything has become a favorite pastime of mine. You're a gem 💎✨", "modelkatie": "🌝🌜🌙", "abbymosborne": "Happy birthday to Ebony!", "rileyandlunaadventure": "Happy birthday you beautiful soul!!! We are blessed to have you on this Earth. Your wisdom is beyond measure and that booty too.", "kateefanjoy": "Happy birthday Ebony!! ✨🎉", "little.bats": "I’m fucking sobbing. Happy birthday, you universe", "hiikaree": "Happy birthday !!", "morghyn_": "Your wordsssss oh my heart 😭💙 hbd Eb ‼️", "ceewhydee": "Happy Birthday Ebony 💪🏾💪🏾💪🏾 ❤️", "radiantwildheart": "Happy birthday ebony!!! I’ve never met you but I adore your realness, sense of humor, and Gemini sass!", "knucleduster": "Happy Birthday Ebony💕💕", "micaizo": "💓💓💓💓", "kaybee210": "Happy birthday Eb!!!!!", "tea_laura": "Happy happy Birthday, Ebony! ✨", "nickieeb": "Eb is so pure. I just love him. 😩😍 Happy earth day !", "shyvolcano75": "Happy Birthday Eb. You're a class act, a handsome cowboy, a badass truthteller and i admire how you always speak from research and spirit. May you both be blessed today with an extra dash of special sauce for you.", "cassandra.marcial": "If everyone was on the receiving end of love like this, the world may just be a little less ugly. 💚 hbd.", "ejmichaelis13": "Happy birthday Ebony!!", "the_world_according_to_h": "🔥♥️👏🏽 HAPPY B’s EBONY!!!!!", "queenaer_": "I LOVE YOU EBBBBBB HAPPY BDAYYYY", "dysartist": "Happy personal new year Eb! 🎈", "sacthe6": "Happy Birthday, Ebony! 🥳🥳🥳", "debbiesnacks00": "I love this so much❤️ Happy birthday Eb!!!!!!!!!!", "survivormoda.rachel": "Happy birthday, Eb!! 🎉❤️", "scarred_jones": "Happy birthday 🎂🎂🎂", "mercurial.moon": "Happy birthday Ebony!!", "iitsdoriibiitch": "Those photos are so empowering ❤️", "bysarahmessina": "Happy Birthday Ebony! So glad you are on this planet. 🎈", "stephaniemadeit": "😭😭😭😭 I might be crying this is so beautiful. Happy Bday Eb! Thank you for being a light in this world 💕💕💕", "kjoberk": "Happy happy birthday Ebony!!! I am in a daily basis thankful that I found you (both) - you have made me so many things, but better is the main one - eternal blessings and love for you Eb 💕🥳🎈🎉", "lunalight": "Happy Birthday, Ebony!!! ♥️🎉", "instagrak": "WAIT R.I.P. ME @ THAT PIC OF HIM IN THE COWBOY HAT OMFG 🥰🥰🥰🥰🥰🥰🥰", "nataliejjames": "Happy birthday Eb !", "meliatheperson": "Happy birthday Ebony!!! I don't know you irl but I've got a deep love for you. I'm grateful that you share your wisdom with us ❤❤", "___the_black_one___": "Happy birthday, dear! 🖤🖤🖤", "christierohr": "Happy birthday Eb🥳💜 with wonderful words from your beloved. Biggest love 💕", "dreamsmall": "Happy birthday, Ebony!", "kizzybeyonce": "GEMINI SEASON AND LOVE TO EB!", "rabbischmooly": "Ebony wearing hats is a really cute series 👾 happy birthday kiddo 🌈", "jennamgould": "This is so full of love it brought me to tears. Happy birthday Ebony! Thank you both for all of the work that you do!", "cassirosee": "Happy birthday Ebony!!!! 💜💜💜", "her__majestea": "Happy birthday Ebony!! That’s so true about him making people feel seen, when we met he was so genuinely approachable and sweet. Wishing you both beautiful and celebratory times!", "noviart": "YALL ARE SO CUTE💕💕💕💕", "delatorreashley": "Happy Birthday Ebony!!", "boobootiii": "Happy happy birthday Ebony! You’re on my gratitude list! I’m sending y’all all kinds of love and I hope you get to bask in it for a good while. Thank you for all you do and for who you are!", "rocreid_inklusive": "Happy Birthday!! ❤️❤️", "zambianactivist": "Happy birthday Eb! Got the pleasure to meet him! He was wearing awesome ass air forces! 💜💜💜", "trans__mutation": "This is beautiful", "eviemichal20": "Happy birthday, Eb and fellow Gemini!", "bluth_ish": "Yalls love is inspirational. Happy born day to a real G. ❤️️🧡💛💚💙💜💖", "lemocko": "❤️", "amandabritannica": "Happy Birthday Ebony!!", "culourmag": "Hbd king!", "vicky_lifts_weights": "Ebony is such an inspiration to me. Happy birthday to him. ❤️", "olivia_ray": "Happy birthday Ebony ❤️", "alexfisherr_": "Happy birthday Ebony!", "m0qui": "Y’all are so precious. HAPPY BIRTHDAY UNCLE EB!!!!!! (Can I call you uncle eb? You feel like a collective aunty uncle couple) 🔥🔥🔥 Hope y’all have a good day and enjoy the moment. This post was beautiful.", "bee.chrissy.bee": "Happy birthday, Eb! 🍰🍰🍰", "jrmcd": "We have the same birthday! I’m honoured 🙏", "bethannnelson": "Happy Birthday, Ebony!!!", "anothertamilqueen": "😭❤", "lindersurprise": "Happy birthday Ebony!!! 🎉🎉🎉", "angiecole_me": "I love everything about this 💕", "smarvelous.wanderful": "As my homegirl and I scream to each other “Still aliiive!” Happy birthday, Ebony🙌🏾🙌🏾🙌🏾👏🏾👏🏾👏🏾🖤🖤🖤", "thesoniag\nVerified": "Verified", "travelling_sensei_": "Happy b-day Ebony!!! Keep being a real G!", "alexisangelini": "Happy Birthday!", "bitterbettynyc": "Ummmm into this masc hot pants lewk", "jaiwareham": "Happy birthday Ebony!!!!", "katwhispurrer": "Happy Birthday Ebony! This is beautiful.", "breathlessmusic": "Ahh we just adore y’all two! Happy B-Earth Dayyyyyy Ebbbbbb!!", "court_sport_clark": "Why are ya’ll just gorgeous! Black Queer Couples Matter!", "gladysbvargas": "Your relationship gives me so much hope for the future 😍 happy birthday ebony!!!!", "yankeesjenn": "Happy birthday! ❤️", "a_lad_insane": "Happy birthday, Eb! Hope you have an extra special day! I love you twos love for one another ❤️", "_gourmandine": "Happy birthday Ebony!", "veronicanaiomi": "Happy birthday Ebony, my fellow Gem.", "mynameisashnide": "The definition and example of beautiful😍😍", "lapinelazuli": "Thanks for making the world a brighter place! Happy Birthday, Ebony! 🎉", "kaitlinknichols": "What a beautiful post celebrating Ebony. Happy birthday, Ebony! So happy you two have this wonderful relationship together. It’s really heart-warming. ❤️", "abrunk32": "Happy Birthday Ebony!", "alyssaohkeefe": "This made me cry. Bless.", "proud.chismosa": "Feliz cumpleaños y que cumples muchos más 🎉", "ambeezeyy": "Such a touching post! Happy Birthday Ebony! 🎊🎊", "mccalla_hill_art": "🥰", "ericadrosenbaum": "This brought tears to my eyes! Happy birthday Ebony!!!", "justmeliz": "What a touching tribute💙. Happy birthday to your Eb. Following you and Ebony has been such an enriching experience for me and I owe you thanks. Congratulations on another year and p.s. ♊️ is 😍/😡. I know it well😂", "hannamolen": "Happy birthday Ebony!!", "altair_arts_": "Happiest of solar returns Ebony!!🎉🎉🎉", "fille.noire.bavarde": "Happy Day of Birth, Ebony!", "_juliajvdunn": "Have a beautiful birthday, Ebony 🎂", "nastygnat": "Crying ahhhh ✨❤️❤️🥰", "215soul": "Happy Birthday Ebony!!", "kat.hoelck": "Happy birthday to the most powerful and potent man on the gram (and without a handle of his own!) ebony you are a glorious person. I always appreciate seeing and hearing your thoughts and joy. HBD from a random admirer ⚡️", "learning_to_let_myself_be": "Happy Birthday! ❤️🎁🎂", "kayesoundslike": "Happiest of Birthdays to you!! 🥳💝", "aviaoconnorana": "Happy birthday Ebony ❤️", "shanonstewart": "Happy birthday Ebony! 🎂🎉🎁", "kirstenbattin": "❤❤❤❤❤", "rvn.nnwlsn": "😭😭😭💖🤠", "bde.veaux": "Happy Birthday Eb!! ❤️❤️❤️ Get Hyphy!! 🤙🏾💙", "alexisstrain": "Happy Birthday Ebony. Hope it's a wonderful day for you both. 💞", "imaliteraljoy": "What a love letter 😭❤ Happy Birthday Ebony ❤🎉", "nayyirransome": "😭😭😭😭😭💕💕💕💕💕💕💕", "missrepresentationxo": "Happy birthday Ebony! Lots of Aroha to the both of you from New Zealand 🥳🥰🥳🥰🥳", "cyndiramirez\nVerified": "Verified", "kerrlyfries": "best couple. happy birthday, ebony! i hope it was everything you wished for and then some. ♥️", "shablisterri": "Happy birthday Ebony! You are loved!!! 💘💘💘", "nicolelnorth": "This is the sweetest, most loving birthday post (or post to a love) I think I’ve ever read. You two are a beautiful, inspiring couple. Thank you for sharing your knowledge AND your love.", "6kween": "Happy birthday ebony!!! The realest of them all 🔥", "rcs.artsy": "Happy birthday :) that was a beautiful moment in time 💫 thanks for sharing !!", "alejspek": "I’ve said it before and I’ll say it again. Thank you for sharing yourselves with us it’s a vulnerable and scary thing to do! I’ve learned so much from both of you and as a white passing POC have really had to call myself out on some shit that I thought didn’t apply to me . I’m not usually such a fan girl (says all fan girls) and it’s weird for me to post on such highly viewed accounts, but I just can’t help myself. Happiest of birthdays to someone I don’t know but look forward to hearing from everyday! Eb is the special mix of brutally honest, hilarious and gentle. Trying not to cry before I have to be a put together therapist and see clients! I am taking your lessons and trying to apply them in my work as a counselor to primarily POC clients!", "beccapatters": "Happy birthday Ebony!", "the_faux_somniphobic": "Ebony is killing me with that Luther Vandross tee and bright booty shorts; I can't!!! Anyways, tell him I said \"HAPPY BIRTHDAY, FELLOW GEMINI!\" 👏🏽🎂🙆🏽‍♀️", "oaklantathebohemian": "Happy birthday to one of Oakland’s finest!", "ana_____italiangurl_23": "happy bday xo😍😍😍😍😍 💛👍🏽 and honor have yalll sharing trith helping ussss tell him happu bday deserve happiness love and light and guyes kindess and not judgemetnal", "erinrosesky": "Happiest birthday! 💕", "a_butterfly_that_was_pink": "Happy Birthday Ebony!!!!", "o.a.cardoza": "Happy Birthday Ebony!!! 😁", "r._ei": "this is beyond cute", "waitwhhaaat": "Happy birthday Eb! We love you!", "dabrownsugasexdoc": "happy bornday to a fellow twin humyn!!", "mamacrabscastiron": "happy born day ebony! thank you for all you touch and change. thank you for sharing your gifts with intention! and thank you ericka for sharing glimpses of the great love you two are building ✨", "mortilfjell": "Happiest of birth days to Eb. What a wonderful human. 🖤🖤🖤", "kaylasdfghjkl": "Happy Birthday Ebony! ✨", "thetranscapitalist": "Happy Birthday Ebony!", "charlie_delta_81": "So beautiful! Thank you for sharing such a touching piece...Happy Birthday Ebony.", "fiercefatfemme": "HAPPY BIRTHDAY EB!!!!!💖💖💖💖", "warren.inglis": "Happiest of birthdays ❤️", "marion.claire": "This is really beautiful ❤️", "kayyyciaaa": "Happy birthday Ebony !! I learn so much from you and Ericka, thank you for your online presence, it is necessary. Have the best day!!! 😊🎂🎂🎂🎂🎂🎂🙌🏾🙌🏾🙌🏾🙌🏾", "kaysha.honey": "😭💓 the most beautiful thing ive ever read.", "maddiemacconnell": "Happy birthday Ebony! I welled up reading this incredibly thoughtful tribute, Ericka.", "bronnib": "A beautiful tribute! Happy Birthday Ebony 🎉🎉🎉", "theimmaculatewitch": "HAPPY HAPPY BIRTHDAY!!! I wish you all the best and then some 💗💗💗💗", "selima325": "😭😭😭 happy birthday Ebony! 💖💖💖", "nicoleyb": "Happiest Birthday to you, Ebony!!", "damnskippyibesahippie": "This was so beautiful. I'm in my feels and happy birthday Ebony you're a real one sn: you need to write eulogies for POC i WISH someone describes me with that much truth and admiration. Live om strong fam. Also boycotting afropunk bc of y'all 💙💙💙", "blondefade": "Happy Birthday Eb! Such a beautiful birthday dedication to your love 💗", "melanatedplantalien": "Happy birthday Ebony!!✨💙🎉 Bless you two beautiful beings ahh 💚💛🌸🍃🌺❣️", "deschats_rouge": "May you two have too many wonderful years to count.", "thatsrichcomingfromyou": "HBD Ebony! 🎂", "streetie74": "Happy Birthday Ebony! What a gift, he just adds joy and shining light to every day and I'm so grateful we get to see glimpses into your lives and love. We are blessed. Have a beautiful day ❤️", "makelemonadewithlupus": "HAPPY BIRTHDAY 🥳", "talialune": "Happy born day your beautiful soul!!! I absolutely adore you Ebony!!! So much love & joy, today & every day 🎉💗", "shandel.parsons": "Happy birthday Ebony!!🤩🤩", "biologistimogene": "Happy birthday Ebony, and thank you to both of you for curating a space where everyone can learn to be a better human, and an ally to other humans. I know your work is not for MY benefit, but I do appreciate you and the labor that goes into it. I hope your day is joyful!", "dontastorey": "🙌🏾 Happy Bday!", "bkbombchelle": "😍😍😍😍😍 Happy birthday! Tis a blessing to be loved and to love so!", "madamseamadness": "This I beautiful. I'm in tears. This is so beautiful. Thank you for sharing your love with us.", "mara_of_the_sea": "We lovd you Ebony!!", "0hs0flii": "💕💙💕💙💕💙💕", "mckennah": "If only everyone was loved and celebrated and SEEN like you see EB. I think all anyone wants is to be known and oh how you two seem to deeply know one another. This was a beautiful tribute for your love ❤️", "goddess_shante": "Happy Birthday to Ebony!!!", "pos_eur": "wow 😭😭😭 happy birthday!!! im *not* crying", "suici.de.u": "This is literally so sweet. Ebony seems like such an amazing person. Happy birthday boo!!🖤", "dawnjoon": "Happy happy birthday!!!! ✊🏼🎉", "yourfriendmags": "Happy Birthday Ebony!!! What poetry of a post this is about a beautiful human ❤️ Your love for each other jumps through the internet with its inspiration.", "all_llison": "happy birthday ebony your presence lights this world ❤️❤️❤️", "tainamakesthings": "Happy, happy birthday to Ebony!!", "maliq.zyon": "💖💖", "pequenaguajira": "Happy birthday, Eb!!! I hope it's a great day! I'm a Gemini too AND I'm also turning 29 this year! Wild! P.S. I also get that irritable mood, must be a Gemini thing, lol!", "tallahasseeblues": "Happy birthday Ebony!!", "bestthatiknowof": "Want to like this more than once...geminis can be hard to love, but we will give you everything we are if you do", "wowjamila": "This was so beautiful! Happy birthday Ebony!", "goldenlibraking": "Happy born day you beautiful Gemini spirit!! 💛😍😍✨🤗", "squidsommar": "Omg it's my birthday too!!!! Im 17!! We're birthday twins OMGGG 😭😭😭😭 you and Ebony mean so much to me this is so cool to figure out :)))) happy birthday Eb!", "balletmeli": "Beautiful caption. 🎂 Ebony", "yveelicious": "❤️❤️❤️👌🏿❤️❤️Happy Earth Day👌🏿❤️❤️", "paolagpolanco": "Happy birthday Eb!!! ❤️🎂 I really enjoy listening to the videos you are at. Have a long happy life!", "jaslburgos": "Tearing over this cap 😭 Happy birthday Eb!!! 🥳", "liv_garrison": "Happy birthday to a fave fellow Gem! Thank you for all the learning💛", "mollena_lee_williams_haas": "So Fucking Righteous. Happiest Day to a fellow Gemini!", "racheldoeshairs": "What a lovely person!! Glad you two have each other!! Happiest of birthdays, Ebony! 🤘💕", "docturdre": "Happy birthday to a legend!!!", "findingpaola\nVerified": "Verified", "rachrachface": "Happy birthday, Ebony!!! 💖💖💖", "ypsi_skulls": "Happy birthday, Ebony! Your existence is a gift to us all. I wish you joy and prosperity for many years to come... and maybe some shoes that you love and Ericka tolerates, too.", "sisterserpentine": "This is so beautiful! Happy Birthday, Ebony! You are so appreciated and loved, even by strangers like me. 💜💗💜💗💜", "its_natashac": "❤️💛", "mrs_honey_queen": "💜💜💜💜", "shelbyroots": "Beautiful and inspiring tribute ✨ happy birthday Ebony!!", "ro.takeyourspace": "Happy Birthday Ebony :)", "can.i.bee.lamer": "AAAAAA HAPPY BIRTH BIRTH EBONY!!! The whole caption got me 😭 you deserve the world Ebony! 💚💚💚💚", "masc_sof.t": "east oaklanddddd happy birthday to this gem!", "cleelebeda": "Happy Birthday, Ebony. ❤️", "seafoto13": "Happy Born Day Eb!!!🐢🎉🎉🎉🎂🍾🍻🎈🎁🎉🎉🎉😆🖤🖤🖤", "lexilex15": "This is one of the sweetest & poetic things I have read. Y'all love is so strong. Happy birthday Eb, you Gemini angel 💖", "kerraq": "Happy Birthday ❤️🎉🎉", "bookishbird": "Happy Birthday Ebony!!!!!! 🥳♥️♥️♥️", "courtney_h_paige": "Happy Birthday Ebony!! You are so loved and full of goodness. Thank you for sharing your knowledge and joy with us on IG. 🧡☀️🧡☀️", "saratmcd": "The world is so lucky that you and Ebony found each other!!! HAPPY BIRTHDAY EBONY!!! love his dance moves, the encouragement in your work out videos, his BRILLIANCE and kindness. To many more!!! 💕💕", "spideygirl91": "Happy birthday Ebony!!! ❤️❤️❤️", "disfunkshionmag": "Oh my goodness!!!!!! Happy happy happy birthday Ebony!!!!!! I love you and hope you have the most blessed birthday and many years ahead of joy, hope, health, fulfilled dreams, laughter and so so so so much LOVE!!!!! You are such a gift to this world and I celebrate you! 🎉💕🙏🏽🤸🏽‍♀️ -Hugette", "nillerenee": "Beautiful. Happy Birthday Ebony!", "kelaboobear": "Happy birthday to my fellow Oaklander!!", "anna_inspires": "Happy Born Day Eb 🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️", "jeanmattie": "Happy happy birthday Eb! 🥳🥳", "datdamnnatasha": "Happy Birthday, Blessed Ebony, First of his name🙅🏾✊🏾🙅🏾", "robin_mangini": "💓❤️💓", "adinalernerphotography": "BEAUTIFUL!! Happy birthday, Ebony!", "katiekatielady": "What an incredibly beautiful tribute. Happy birthday Ebony!", "livinglife31": "Happy Birthday Ebony!! You are a gift! ❤️❤️❤️❤️", "arwynm": "I love how much you love him and he loves you. Funny how strangers on the internet can affect me so... Happy Birthday Ebony!", "ohsweetvenus": "That made me cry and I don't even know you know you. Thank you Ebony for bringing all your gifts into the world with yourself 🎂", "trixieg.koehlbach": "Wishing a Happy Birthday from Spain ❤️", "iammiss_dee3": "Although I don’t know Eb personally, everything you said feels like zen would be nothing less. Happy Celebration of You!!!", "who_lee_ah": "✨♥️😭", "eliduke": "For a second there I thought this was a @babes_with_plants post!", "gabriellepearl_": "Your love is so beautiful thank you for sharing ❤️❤️ happy birthday King 😇", "kristinmb": "Happy birthday!!! 👑💥🎂", "_whois_k": "Ask ebony if I can borrow some hips, sexy ass. happy birthday❤️", "crohnie_jasmeen84": "Happy Solar Return Ebony and May you be BLESSED with many More🎂🎂🎂.", "is_she_okay": "I wish I could explain how much joy Ebony brings into the world. I'm so glad I have gotten the chance to share time and space with you! 💜💜💜", "ms.smashley.rose": "HAPPY BIRTHDAY EBONY! 💕", "georgina.megan": "happy birthday ebony! this post made my heart melt ❤️", "fmathie": "Just the loveliest ode to love - Ebony you’re fantastic and I’m wishing you every good thing in the world xxxxx", "syndrome_air": "Only the happiest of birthday wishes will do! Happy birthday Ebony!", "jollygreenjen": "Happy birthday Eb! Thanks for sharing your life with all of us.", "andrearoussos": "Beautiful tribute!!😭😭😭 Happy Birthday Ebony!!!!!!!!!!❤️❤️❤️", "kirsive": "Happy birthday Ebony, you are a gift!", "gombo_rio": "😭😭😭😭😭 happy birthday to you!!! Thank you for everything 🙏🏽🙏🏽🙏🏽🙏🏽", "lindseystu": "Happiest of birthdays to you Ebony!!! ♥️♥️♥️♥️", "amjovie": "So beautifully written. Happy Birthday Ebony 💗", "montanafosberg": "Happy Being Born day Ebony! 🎂", "shalemar_1": "Happy birthday Ebony!!", "cherubmermaid": "HBD EB ! 🎉", "lalalanabanana_": "Happy birthday Ebony!!! 💓💓💓", "sniffyjenkins": "Happy birthday Ebony! 🌈🎂This is so beyond beautiful, every word. Thank you for all you do. Bless you both 💫🧡🌿❤️🙌🏽", "kelceyjay": "Happy birthday Ebony! I feel so fortunate to be able to soak up your wisdom on a regular basis, and the love, respect, and support you two share is so beautiful to witness. Hope your Gemini season is everything you deserve and then some.", "kels.beck": "You are a treasure to the universe Ebony! Thank you! Happy birthday!", "lizvitale": "Happy B-Earth-Day Eb!!!!!!!", "elb_muh": "Happy GLORIOUS Birthday", "tkay17_": "Happy Birthday Ebony! May your day and the days to come be blessed! 🙏🏻🙏🏻🙏🏻❤️", "rubywednesday13": "Y’all so cute! Happy Solar Return to Ebony 💚💚💚", "spookysis": "😭😭😭😭😭😭 This is so pure happy birthday Ebony!!!!!", "spacelace": "Happy birthday, Ebony!", "thesammhatter": "Happy birthday Ebony!!! 💚🥳🥳", "iamrachelricketts": "Happy Bday Ebony!!! 💞", "libraryofnights": "Happy birthday Ebony!!! 💙🎂🎊🎉🎁🎈", "ca.rolannie": "Happy birthday!! P.s. Man, you are a great writer.", "nastashia_minto": "This is so amazing I’ve taken photos like this", "angrylilblackgirl": "happy birthday Ebony!!!!", "elishamarie3": "Happy birthday!!!", "tater_tot_eroo": "❤️❤️❤️ Happy Birthday Ebony!", "riannablok": "Happy birthday Ebony ❤️ We are so blessed to have you and hear from you. Thank you for being you. Ps. Ericka you totally made me cry. Such a beautiful image & i agree, that moonbeam is everyone not on this earth giving their own birthday spotlight to this beautiful human ❤️", "queen_of_living": "Wishing the you the happiest of birthdays Ebony! You both are a delight and it is a joy to witness your love, devotion, and kindness. ✨✨✨💞", "veghann_": "Happy birthday Ebony! You’re such a ray of sunshine! ❤️", "thestarsmythic": "Tears of joy! Although I may never know you both IRL, you have made such an impact on me. Ebony truly comes across just as you’ve written - he deserves all the celebration today and everyday. Big love to you both! 🧡💚", "mommyofasunshineandarainbow": "Happy birthday beautiful 🐘🔥🌈😍🌹🌹🌹", "dralexea": "Happy Birthday Ebony 🎂🍾🎉", "thelittlebeast": "Happy bday Ebony!!! It’s truly a pleasure getting to experience Ebony and y’alls relationship through your Instagram 💚✨", "blkwomynreading": "Happy Birthday Eb!! You are dope AF!! 🎊🎉✊🏿🖤", "mollybing": "What a beautiful tribute, and one that sounds well deserved. I hope you have a wonderful day celebrating together.", "flyinglikeabumblebee": "Happy Birthday ♥︎", "amandawatcheswaves": "The love in this post. 🔥", "taylorrericaa": "Happy Birthday Ebony! 🎉", "farrensquare": "Happy Birthday, Ebony. 💯", "negressworld": "happy bday ebony!!!", "babytinc32": "😩😫😭😭😭😭😭😭🤧🤧🤧🥰 that was beautiful! Happy Birthday Ebony!", "taziacira": "Happy birthday Ebony you amazing human!!", "breighlrobbins": "Such a beautiful birthday tribute. Happy birthday Ebony! Keep shining ✨✨✨", "piscescrises": "holy cow what a brilliantbeefcake angel baby!!!", "filltheblanc": "Yes Eb! 💎", "jenniferlyn42": "HAPPY BIRTHDAY!", "seussia": "Happy Birthday, Ebony!🎊❤️", "doomgrrrl": "Happy Birthday Ebony!! This is beautiful 💖", "bee_like_bumble": "HAPPY BIRTHDAY EBONY 🎈🍰", "blquni": "Happy Birthday Ebony! this is so beautiful! Love y’all so much!!! 😩😭😭🙏🏾💕💕💕🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "beemama8": "Happy Birthday, Ebony. We all adore you! 💗", "irreverentvintagegirl": "❤️❤️❤️❤️😍😍", "estefaniatrujillopreciado": "Happy Birthday Ebony! Sending blessings, light and positive energy for you 💕", "tain_aahhh": "Happy Birthday Ebony! <3", "bekindbehonestbeloving": "that is the sweetest birthday message ever!", "epmakini": "@hawaiimolly I’m crying", "kendria_satori": "Happy birthday Eb!", "dariaalewe": "Happy birthday Ebony!!! ✨✨✨✨✨✨", "worldwide.glitteracy": "Just so beautiful; words and human both. Happy happy day Ebony!", "dapontefern": "HAPPY BIRTHDAY EBONY!!!😍😍😍💗💗💗 Wishing you all the best, love, health and happiness!! Love you both.!!😍😍💕💕😊😊🎂🎂🎂🍾🍾🍾🍾🥂🥂🥂🥂", "monroesteele": "HAPPY BIRTHDAY EBONY! YOU ARE A GIFT TO EVERYONE WHO KNOWS YOU! ✨✨✨ LOVE YOU! I LOVE ERICKA TOO! Happiest of Birthdays ❤️", "cobra_mama": "That was beautiful. Happy birthday Ebony !!!", "kittypurrrrrrrr": "Happy birth date Ebony - yalls love inspires so many ♥️🍓", "poolersmiths": "Ebony!!! Have a fantastic birthday. I don’t know you personally, but you are appreciated and amicably lives from afar! You are funny and witty and your incredible mind AMAZES me and that’s just from what I know of you from social media (and that one time we met in public at Furman University). I hope your Birthday week is the best and wish you all joy.", "shainaaaaaaaa": "Happy Birthday Ebony!!⚡️⚡️⚡️", "hebejebejones": "Happy Birthday Ebony, the way Ericka talks about you, you must be the most wonderful and deserving person! Sending love from the UK ❤️❤️", "elsunshinestar": "You two are the best,you both inspire/educate me daily! Happiest of Birthdays 🎂 🌸💛", "risdonroberts": "So so so lovely what a tribute I hope to be blessed enough to be in his orbit one day ✨", "chanellemidwest": "💞💞", "b.kenya_": "Aww man today my birthday too! Stars were born today!", "lol.sade": "happy birthday, ebony!!!🌞", "hazelmoon__": "Happy birthday Ebony 🎉💗", "dyvonne._": "Omg i love that first picture lol happy birthday to a real one !! ✨❤️ praying for many more !", "kal_eidescope": "This kind of love, damn. Happy birthday Ebony!!! All the blessings to you!!!✨", "panddaa.po": "🥳", "actuallyitsjustsosa": "Happy birthday ebony! Thank you for your wisdom and for loving erika out loud for us to witness! We love you both so much. I'm thankful for your milestones! They are a blessing to us all.", "goldenmegz": "Happy birthday Ebony!! ✨🎂", "opalackaa": "Happy birthday to our King", "mcfearless": "Happy birthday, Ebony! All the blessings back to you that you share with the world, one thousand fold!", "landofinkandgraphite": "Happy birthday Ebony!!", "ceesando": "this is so beautiful! 😭😭😭 yes to celebrating every single incredible gemini on this planet... especially this one! ❤️", "nurse.misha": "Happy Birthday!!!", "laurakoja": "Happy Birthday to Ebony! 🌟", "aespragoo": "Best caption! Happy birthday ebony!", "anqasunu": "Happy Birthday Ebony !! ❤️✨", "marcijnyc": "What a beautiful tribute! Happy Birthday Ebony!", "annbanan96": "Happy Birthday!!!!", "buenamota": "Happy birthday ebony!💖💗", "shanmastros": "Happy birthday Eb!! Thanks for your work.", "fractalgems": "HAPPY BIRTHDAY EBONY!! Ericka that gag gift 😂😂😂😂😂😂😂 what you all have is so special 🌹", "amiramornoir": "Happy Birthday Ebony! Looking cute af ERRRY DAY", "moldydillon": "This is so beautiful", "whenchoclatemelts": "👌🏿🌙✊🏿", "dtursi": "Happy happy birthday, Ebony! You deserve all the best things today and everyday, you beautiful human!", "eatatmomos": "😭 This is so muthafuckin sweet! Happy Birthday Ebony!🥳", "sagansandwich": "I HOPE YOUR BIRTHDAY ROCKS AND IS AS BEAUTIFUL AS YOU ARE", "garden.punk": "Happy birthday Eb! Wishing you all the power today and thanking you for all that you do 💖", "lisa_napoles": "Happy birthday, Ebony!", "mtroisfontaines": "Happy birthday Ebony! You are loved by so many! 💖", "meaganangus": "C’mon Saturn return!!", "alto_acumulus": "What beautiful photographs :3", "siobhanisobell": "Such beautiful words 😭 What an incredible love ❤️ Happy Birthday 🙌", "leah.peacock": "Truly a blessed day!! Happy Birthday and thank you (both) for all the work you do, the world is 💯 a better place because of y’all!", "ccynhen": "I love him too! Happy Birthday Eb! May the Spirit surround you today, yesterday and forever tomorrow’s.", "sydniem": "This was so beautiful to read. I'm on the verge of tears it's so overwhelmingly gorgeous. Happiest of birthdays Eb!", "mwansamwansa_": "Happy birthday, Ebony!! 🙌🏾❤️", "quillacuriosx": "Happy Birthday Ebony! ❤️💕 So much love for you. You’re always teaching me to be a better person and expand my knowledge. You deserve it all!", "homiehousepress": "✨Happy birthday EB 💛✨ so happy you on dis earth homie 🥳", "franyc_": "Wow!!! Incredible. Probably the sweetest message I’ve seen someone write to a s.o. That’s beautiful. Happy birthday Ebony! Have a wonderful day and celebrate a bunch. Never stop fighting for what you believe in, listening to your heart and your soul. 🌟🌟🌟You GOT this!", "aubyn.faye.russell": "Happy Birthday beautiful soul!", "neemdreamz": "Happy Birthday Ebony!!!🧡💗 You and Ericka always make me smile and teach me something new every day, it is a blessing to experience your voice and mind through this platform. I hope you have a glorious day!", "chenai": "Happy birthday Eb!!!! You seem so great i wish i knew you in person ❤️", "ebporter": "Happy Birthday Ebony!!❤❤❤", "sarahmacchamp": "The blue shorts are really cute💜", "mrs_jodiethomas": "I love birthdays too! You two are the best together. Always making me smile and happy and uncomfortable and learning. Wishing Ebony the happiest of birthdays!!! 🎉🎉🎉", "ghetoflower": "Happy Born Day🖤✊🏽", "youwantdwana": "Turn all the way up, Eb!!! Our love is a revolution! Happy Born Day, E. 🎊🎉🍾🎉🎉", "cardinalstates": "Happy happy birthday & every Eb Day! Celebrating you!", "ashangrila": "Happy happy birthday you wonderful being Ebony!!! Hope you have a wonderful day ❤️❤️❤️", "nolwazinkwandla": "Wishing Ebony the happiest of birthdays! May today be the preview of what the rest of your year will be, nothing short of amazing. Sending blessings and good vibes to you sir on your special day 🎈❤️💛💜🧡💙💚🎂🍾", "alittlebitsofternow": "(((((OBSESSED))))) HAPPY BIRTHDAY RADIANT SOULLLL", "therealmelanin.monroe": "Oh the feels 😍 Happy Happy Birthday Eb. You guys are such a light ✨", "jaquecoco": "Happy birthday🎊🎂🎉", "shani_vellve": "Happy bday Eb!!! 🎈 🎉", "katelynalain": "Happy birthday! What a beautiful tribute this is.", "girlwiththecattattoos": "Happy happy birthday Ebony!", "r3nnyboo": "Happy birthday to an icon LIVING ✊🏾💕", "worlds_best_gram_": "Happy birthday EB.", "emilygoldhammer": "Damn, this made me tear up. Thanks for sharing your life with us Ebony!", "tanisalexis": "Happy birthday Ebony!!💗💗💗", "jessi.so.messi": "Happy birthday!!!!", "nocturnalreignbow": "Happy birthday ebony!!!!!!! One of the most amazing and funny ass human beings on this planet. You dead ass a real one ✨", "ruthmaariia": "Happy birthday Eb! 🎶🎂", "jessroseby": "😭😭😭 gorgeous HAPPY BIRTHDAY ❤️", "other_sider_girl": "Felíz Cumpleaños Ebony!!!!!", "theamblemaisha": "HAPPY BIRTHDAY EB!!!!!!!!!!! 🙌🏿🙌🏿🙌🏿💓💓🙌🏿🙌🏿🙌🏿🙌🏿", "trelloulabelle": "Have a wonderful birthday!!!", "my_left_breast": "💞 what a beautiful love letter. Happy birthday Ebony.", "chantellekohn7": "This is the most beautiful birthday tribute I have ever read. Enjoy your birthday Eb - the world truly is better having you in it. I hope you got some great obscure records to help you celebrate.", "lieutenantbird": "Oh no I'm crying at work now. Happy birthday Ebony! We all love you", "e_hughes_poetry": "Happy birthday! Ebony!", "k___fina": "So much love! Happy birthday Ebony!", "bperformer": "Happy birthday Ebony!!!! 🙌🏼🙌🏼🙌🏼", "ciaratoga": "💙💙💙💙 Love that last pic of you two 💕💕💕💕 enjoy!", "fluffmanor": "Thanks for sharing this beautiful tribute! I'm glad that with all the hard work that you do you have someone in your life that you love and who loves you so much.💓", "filtered_specs": "Happy Birthday Ebony! 💕❤️", "riddellmkm": "Happy Happy Birthday, Ebony! And thank you!", "godsfromouterspace": "Happy birthday to a legend and icon ♥️", "whatsda_t_lc": "All hail Ebony the Turtle 🐢Happy Birthday!", "daria_ann_poet": "Happy birthday, ebony! “Come celebrate with me that everyday something has tried to kill me and has failed.”", "chackmer": "This is so beautiful! Happy birthday Ebony!!", "cheechandschlong": "Happy birthday, Ebony 🥰", "_samakuu": "BUT DEAR GOD, I’M HERE!!! 💜💜💜 Happy rotation, relative! We are better for sharing this planet + learning from you.", "fallenalien01": "Happy birthday ebony!", "godhelmuniverse": "Amazing", "chaoticnneutral": "y’all make me so happy", "_jae.3": "I got the horses in the back Horse tack is attached... lil nas x and billy ray song (old town roadless was what came to mind with the cowboy hat nice post & have a Happy Solar return E may u have many more 🎂🍰🍨", "ameenagreen": "Happy bday!!", "marikarose7": "This kind of love. What a beautiful person and he is so lucky to have someone who can so eloquently articulate his Beauty ❤️", "joseyxmarina": "Happy birthday Ebony! 💜", "trish_collective": "Happy birthday !!!!!!😭", "songbirdforlife": "Happy Birthday Ebony!", "itsgussy": "Happy Birthday!", "angelamvega": "Happy Birthday Ebony!", "sister_dlyn_maryjane": "💗", "emmarooney": "What a beautiful message ❤️ Happy birthday, Ebony!", "korenbabe": "Happy Birthday Ebony!!!", "bellasongm": "Happy birthday, Ebony! the Gemini-Taurus cusp we all need", "cassidy_maya": "Happy Birthday Eb! Hope he has a great birthday celebration! My birthday is on Saturday ❤️", "lisawinnerphotography": "Beautiful said. And I love The Town shout out! Haopy birthday from the West coast ☺️", "cinnamonbrown18": "Happy Birthday!!🍹🍹🍹🍹", "pleunijacobs": "💕💕💕💕💕 Happy birthday Ebony!!", "celestial_jazz": "🎉🎉🎉 Happy birthday, Eb! May your day be filled with your favorite food, music, lots of rest and a new pair of dad shoes 😂❤️", "the_highestpriestess": "Happy birthday!! 💜💜💜", "butterbeready": "Happy Birthday Eb!! #geminigang ♊️💫", "jjessjess": "❤Happy birthday Eb!", "leeanndunton": "I loooooove your description of Ebony!! 💜💜💜 Happy Birthday!", "allisonhaus": "So beauuutifullll! Happy birthday Eb!", "missfield999": "Happy Birthday Ebony!! 😘", "missus_smog": "Happy birthday Ebony!!!!!!💜💜💜", "flavaduvernay": "Happy birthday 🥳🥳🥳", "simransw": "happy birthday Ebony!!! 💖🥳", "chynnadollyogi": "Happy Birthday Ebony! Enjoy! 🎉🙌🏾🎈❤️", "flowersrisin": "Too early for me to be tearing up like this. I love you both so!", "dan_yeet_ella": "happy birthday!!!", "deecane": "Happy birthday to Ebony, true Gemini royalty! 🎂 👑 ♊️", "_miz.khalifa_": "❤️❤️❤️", "hellosashah": "Happy Birthday! Thank you for being you 💖", "mama_cook": "Happiest Birthday to the greatest!!!", "ruthlesslove88": "Chillsz about the moonlight spirits I felt that too last night same thing into my window. EBONY EBONY EBONY EBONY EBONY EBONY EBONY we say your name to celebrate your LIFE as it continues and will continue to be blessed and to bless us. Thank you for coming. 🖤🦋🖤", "_geralartist_": "Happy birthday to my favorite, most realest well spoken gentleman on the intarnetzzz❤️❤️❤️❤️❤️❤️❤️❤️", "melanatedmamaof5": "Awwww!! So so beautiful. Happy birthday Ebony!! Cheers to many more wonderful celebrations!! 💖💖", "rtbhatt": "😭❤️😭❤️", "msn_er_rn_totally_blessed": "Happy Birthday, Eb!!! 🎉 This is such a beautiful post.", "alex.l.bell": "this is such a beautiful expression of love, y’all boutta make me cry", "softbutts": "Happy birthday Ebony! ❤️🎉", "michelle_ngetich": "@katile_j nataka tu uangalie hawa watu ii dunia manze", "kristiane06": "Happiest of birthdays!", "baldheadedass": "happy birthday, eb! you shining with dem fronts!!! ✨💛", "leighanndwg": "Oh my heart!! Happy birthday, Ebony!", "ssuberman": "HBD!! Thanks for all you add to the world 🌎", "nessa_bess": "HAPPY BIRTHDAY EBONY!!!!", "msholmesmusic": "💜🙏🏽💜", "sierrawgarcia": "Happy happy bday Eb!!!!✨✨✨✨✨✨✨✨ 🎉🍾🎈", "seababs": "Beautiful people", "christinaebohn": "happy happy birthday Ebony! ❤️", "laurelwhale": "Happy Birthday, Ebony! I’m a better person having heard/experienced words from your mouth. Your light is undeniable.", "dips_w": "😍 hAppy birthday 🥳 Ebony", "napollonia": "Happy happy birthday Ebony!!!!! Have the best day!", "chillcoop": "Happy birthday 💜💫", "femenoir": "Happy Birthday, Ebony!! 🎉💜💖💛", "jenbrown76": "Happy Happy Birthday 🎉❣️🎂", "tadowmarie": "Feliz cumpleaños 🎂 !!!", "iamauntiesocial": "🎂 🎉 🎈 💐 HBD !!!", "arinewl": "OMG ... Screaming happy birthday Ebony!!! @ihartericka the way you describe Ebony just touched my soul💙 you two are goals forever and a day☀️#blessing😘", "alessandravoice": "The most beautiful tribute I’m thankful Eb is on this planet and I get to hear him share words all the time. Beautiful soul. ❤️happy birthday to another Gemini I adore", "loganlepper": "Happy birthday! 🎉", "verovivaldi9": "Happy birthday, Ebony ! Have an amazing day ❤️❤️❤️", "shila.soni": "Happy happy birthday Ebony! 💖💖💖 Sending so much love and appreciation your way.", "ameliavhastings": "Happy birthday Ebony!", "mariahdalton47": "Happy birthday Ebony!! The world is so lucky to have you", "granola78": "Happy, happy birthday, Ebony. 🎂❤🎂❤🎂", "saraspondasmile": "Happy Birthday, Eb :)", "ya_boy_shinji": "Happy birthday Eb! 🙌🏽🙌🏽", "velvetwavez": "Happy birthday to a real one 🎂 Ebony's existence adds to the world being better and brighter. It's a joy to see you thrive via social media. Enjoy this day because it's YOUR day 🎉🎉🎉", "weirdnesss": "This is the greatest bday post I’ve ever seen!!!😭😭😭😭 HAPPY BIIIIRTHDAAAY!!!", "vanhult427": "Happy birthday🎉💗", "gardengirl_eden": "Happy Birthday Ebony! You are the fuckin’ best! 😘🎉🗣", "kitt.katt._": "Happy Birthday Eb🍾🎉 We Love Youuuuu✨", "kaml1912": "Happy Birthday Ebody! Here's hoping he has a fantastic celebration!", "eye.charlie3": "I LOVE this last photo of yall!happy b day!", "wyketta": "Happy birthday TWINNN", "margolicolio": "Happy birthday Ebony!!!", "lagrossetoile": "Happy Birthday Ebony and this was just the most lovely thing to read. True love not only supports us, it pushes us to do our best and holds us while we try 😊", "divagirlrn": "Happy Birthday Ebony!!!! I hope you enjoy your day and you have many, many more!", "jordyfae": "❤️❤️❤️ Happy Birthday Ebony!!! 🎂 🎆 💐❤️❤️❤️", "dominiquelayne": "Happy birthday, Ebony ❤️", "devalux": "Ebony, those blue shorts are giving me so much life, happy birthday y que cumplas muchos más!!!!", "taraviolet": "Happy birthday ebony !!!", "ashleyhefnawy": "I’m tearing up at this post, happy birthday Ebony🧡💜💙", "witheringeye": "You're both radiant 🔥🙏🔥🙏", "omg_halley": "🐢 happiest birthday! 💙💙💙", "teamarie28": "Happy birthday Ebony!!!! ♥️", "catloins": "@robferrell2 omg Gemini bday twins", "uche_beeeee": "Happy birthday, Ebony!!❤️❤️❤️", "naushonyoga": "This made me teary. Happy happy happy birthday Ebony!!! We can feel your magic even through this weird little device. You are an incredible being who we feel blessed to know just a little!! 🎉 ✨🌟✨", "kathleencollins": "Happy Birthday, Ebony!! 💕🐢🎂🎉🎈", "hernameisfarai": "Y’all really gon make me cry like this....", "skoy_": "Love", "perfumistasf": "🖤", "goldenlady_____": "I cried, you are both so beautiful", "jocelyn.lavon": "Happy Birthday Ebony!! 🎉🎈✨", "clotildehmb": "If there ever was a declaration of holy love, this is it. 😭", "aquafare": "Happy Birthday to him", "melanin_nubian_queen": "Team Gemini happy Birthday boo ♊️❤️💯✨", "cnarddonaybonch172": "Happy birthday Ebony! 👑 Thank you so much for the priceless education you both give me literally every single day. Your intelligence and kindness seems to have no match. Happy birthday King!", "p.bella.k": "Happy birthday Ebony! ❤️", "astoldbytsige": "Happy bday Ebony!!!! 💕✨ Blessings on you fam 💙", "westy_leaf": "😍😍", "supamakenzi": "HBD EBONY💪🏾💪🏾💪🏾💪🏾💪🏾", "brat4bratwurst": "HAPPY BIRTHDAY EB!!!!!!!!!! 💫💫💫", "em_heverly": "✨💕❤️Happy Birthday Ebony!!!! ♋️", "hopebroidery": "Stop it I’m crying 😭😭😭 Happy birthday, Ebony!", "leggyblonde1415": "Happy birthday to Eb!", "moondrawncraft": "Happy birthday!!! 🙏🏽🙌🏽🙏🏽", "balicerry": "Happy birthday and all love and joy to you both!", "lilcryan": "Happy Birthday Ebony!!!!", "dani_alderete_": "Happy birthday Ebony!!! 👏🏾👏🏾👏🏾💖💖💖🔥🔥🌹🌹🌹🥳🥳🎉🎉🎊🎊🎊😍😍🥰🥰🥰🥰💙💙💙💙💙💕💕💕", "serendipitouswool": "Happy Birthday Ebony Donnley of House Deep East Oakland (The North), First of His Name 💗!! Wishing you peace and kindness always🤗🤗", "absolutebony": "Happy Birthday Ebony💜", "stevou_zissou": "Happy birthday Ebony, thank you so much for everything you bring to this world.", "aquariuntay": "black love is beautiful ❤️", "allspice_222": "Happy birthday Ebony!!!! We are bday twins!!", "sejeia": "Happy birthday 💫 light, love, peace, prosperity, power to ya", "blackorchidaceae": "COME THRU GEMINI ♊️ SEASON!!!!! Much love to Ebony out here always giving us some real n!gga energy!!", "relentlesscheer": "✨🌘🥂", "manuela_ceapoblete": "All the happy tears reading this! Happy Birthday Ebony! Have the most beautiful of birthdays 💖💖💖", "waffle_pockets": "Happiest of 🐝 days to Ebony, a shining star in this world!!", "birdsofashmae": "Wow, truly so beautiful. Grateful for you both.", "jessdavenportvalencia": "This is the most beautiful tribute to your Ebony. It’s making me 😢. Happy birthday Ebony!!! 💕", "weird.princess.peach": "Eb you're from East Oakland! This means the world to me, I am too! It's nice to see queer black people just live. Wow💕 you guys just made my day. So thankful for your birth! 💖💖💖", "jikes1975": "Happy birthday to Ebony who I hope reads every one of these wishes here. Also why you two so sweet? Love your loud love!", "ddomminniqque": "Happy birthday, Eb! ✨", "kiraselinalevy": "Happy birthday, Eb!!", "iconicspirit": "Happy birthday Ebony! What a loving and great post about him. I gotta tell ya. I absolutely love his phrases of real town business and his soaking up game. He is a wordsmith for sure.", "username70passwordvixxen": "Happy Birthday Gemini twin, so much love to you", "daisydevonshire": "Happy Birthday Eb!! I hope your day is full of love! You both are powerhouses! Thank you for all you do and for all you are! ❤️", "criavolver": "Happy birthday Ebony!!! ❤️❤️❤️", "ladysasquatch": "Happiest of birthdays!!!💥💥💥", "cyn_1222": "Happy birthday, sweet soul! 🔥❤️ Have the best of days with all the love, laughter, and celebration an entire day can hold!💗❤️ We LOVE you!", "chelsea___ellen": "Happy birthday Ebony!", "evyan.whitney": "happiest birthday to you, Ebony! you’re one of my favorite people on the internet & I am so glad you were born. ❤️❤️❤️ may you have many many more years & all of the black joy within them.", "kaeleenmaeve": "This is a beautiful piece of writing Ericka! Everything you write is thoughtful, poetic, and moving, no matter what the subject is...but in this case I imagine it’s not hard for you to find the words when they are inspired by such a lovely person! I do not know you and Eb personally but each and every time I open this app and see that you have posted something new I am either learning, growing, motivated, or somehow changed and I am so grateful for the two of you as individuals AND as a couple. You have a powerful love that is palpable and deserving of celebration EVERY SINGLE DAY!! Sending love and continued happiness to both of you. Happy birthday to Eb!!❣️", "destiny_laurice": "Happy birthday ebony! 💕", "thedappermrjaden": "Happy birthday Ebony!", "finally_bopo": "Happy birthday, Ebony!! 🎂🎉", "cyndhia": "The way you and Ebony hold and see each other in love is pure pure magic. Happy birthday Ebony🌞🌻✨🎂🥂", "emiliad": "Happy bday Eb! Thanks for all the joy and knowledge and love you share with us.", "genktastic": "Happy Birthday Ebony!", "rubi_jones": "❤️", "northwoods_hill_farmers": "Too much love. ♥️", "kimmy.hale": "Happy Birthday, Ebony!!", "lillie.isabelle": "Happy Birthday 💙💚", "endomsworld": "This is simply beautiful. The adoration, the love, the intimacy, it’s felt. This is inspiration in itself. Thanks for sharing your love for Ebony with us and Happy Birthday Ebony! 🎁", "juicyjayfox": "Happy birthday you your boo!!! Your words about him hella had me laughing and choking up !!! ❤️", "mararothman": "He came into my coffee shop the other day and was my favorite customer of the week- please extend the happiest and loving birthday wishes from me!!!!", "sicchunt": "Happy birthday to one of the ultimate truth tellers!!!! Hope Eb has an amazing one. So appreciate to have him gracing your IG", "itsmedavidrighthereonyourphone": "❤️❤️❤️", "twizls": "Happy birthday!!! You two are the best couple 😍😭", "alyseruriani": "happy birthday!!", "shamika_sanders": "#teamgemini", "chelsey.vandrisse": "Beautiful ❤️", "ruthstar09": "Happy Birthday Ebony!! Sooo beautifully written @ihartericka!!", "kaleighrose23": "A beautiful tribute and celebration of such a sweet soul. This made me cry. Thank you for sharing pieces of your wonderful relationship on insta for us all to know what we should be working towards and searching for. ❤❤❤", "erkellerman": "Happy Birthday, Ebony!! I look forward to the posts you make about him. He makes my heart so happy. Much love. 💖💖", "notfortv": "Beautiful💕Happy bday Eb!", "vixenhairstudio1": "❣️ “The is it hot Babe” Happy Birthday Ebony ✊🏾", "a.l.major": "Happy birthday Ebony!!!!", "wilcope4": "faves", "beautiful_cocoa_": "HAPPY BIRTHDAY EBONY!!! I know that I have never met either one of you, but in just following you for over the last year, I have come to respect and admire the both of you and love how you both love on each other. I hope Ebony has the best day and the best 29th year ❤️✊🏿", "ascensiongoddess_": "Happy Birthday no insta EB!!!!!!!!!! Thank you for all the FREE G A M E via Ericka's Instagram 💜💜💜💜💜💜💜", "minda_price": "Happy birthday Eb!!! ♥️♥️♥️", "saffronmade": "Happy birthday Ebony! 💗", "uctrish": "❤️❤️ happiest birthdays Ebony and shoo I’m not crying (I am) at this post. What an extraordinary love!", "briragan": "You two are the loveliest couple on IG. Thank you both for all you do to teach us for free on this platform, even when it’s really really exhausting. Happiest of birthdays to you, Eb! Thanks for shining your light in this world!", "prettypleasecanijust": "Happy birthday, Ebony!!! May you continue to flourish and kick all kinds of ass through your own strength and through the care of those who love you.", "samkitty__": "Happy Birthday EB! ✨", "rebeuru": "Happy birthday Ebony! ✨✨", "great_illustrate_300": "🎉🎨NEED A PROFESSIONAL LOGO FOR YOUR LABEL OR BRAND 🔥💡LET'S WORK 📩📩YOU LIKE THE PRICE 🔥", "latoyaj_mua": "Y’all see so cuteeee! Happy birthday ‼️", "imaquariusjones": "Happy Birthday Eb!! Sending a big Yeeee!! To you all the way from ESO", "drxyah": "When you love someone and you think your parents love them more that’s theeee one ☝🏾😉😊 !!!!! Happy Birthday Ebony!!!!!! 🎂 🎁🎂", "luckylocs": "Happy birthday!", "luciaov522": "Happy Birthday Ebony! We share birthdays! ♊️ Gemini season.", "jackn4pix": "Happy birthday Ebony. Didnt know you were from The Town. 😍 It all makes sense now. 🤣🤣 -a fellow Oakland expat", "zolaah_tho": "Happy birthday, Ebony!!!🎉🎈🎈🎉", "fragilewhitegirl": "i’d watch garden weeds grow if it was narrated by Ebony. HAPPY BDAY", "thatniceblackguy": "♊️♊️♊️", "emoliabobbit": "Happy birthday Ebony!", "complexblackboi": "Happy Birthday Ebony💕💕💕💕 you deserve just as much as you give!!!", "justice.truth.love": "this is such a gorgeous tribute — it made me cry 🖤 happy birthday, Ebony! sending you love for your next strut around the sun ✨", "nushkat": "@n_donnelly you expecting this level of PURE GORGEOUS LOVE for your birthday message? ✌️💜🌈", "upthelws": "Happy birthday Eb! I appreciate you and Ericka both and that she’s your social media proxy 😂", "ziaaukia": "My fellow Gemini 😈♊️😈 Happy Birthday Ebony 🥳", "rebeccadudgeon": "The best birthday caption I’ve ever seen. Happy Birthday Ebony! ✨", "chynna_janai": "Happiest of birthdays!", "polysaturatedfat": "Happy Birthday Ebony! He’s so cute in his cowboy hat!!!", "elizabethbarnettandyoga": "wow to this love and life - happy birthday ebony!", "lilrosie25": "Happy Birthday!!!", "welch_macky": "Ebony is so pure. So sweet. Happy birthday", "healing.grayce": "HBD to a real one! ♥️♥️♥️", "princesstricee": "Awww such a moving post... *who's chopping onions* Happy Birthday Eb!!! 🎂🎉🎉🎂", "itsbrittniann": "HAPPY BORNDAY EBONY!!!!", "gigilee82": "Happy birthday Eb enjoy your special day", "l_zawacki_m": "Happy Birthday Ebony!!", "jmemendo": "💗🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼💗", "lizcmurphy": "Happy birthday!🌺", "taiaiake": "Happy Birthday from Mohawk Country, Ebony! 👊🏾", "gaelleelma": "Happy birthday Ebony. We love you. I hope you know how much of a gift you are to this world. Bless your parents from bringing you to this world. 💛", "alcbowen": "Happy Birthday Eb 💕❤️💛💚💛❤️💕", "andrea1nspired": "🖤🖤🖤🖤", "rimrk": "This is the best love letter 💌 Happy Birthday, Ebony🥰", "farmermaura": "So much love!!! Happy birthday Eb!! 💛💛💛", "belifuna": "Happy birthday Ebony!", "jnwatters": "Happy Birthday, Ebony!!!!", "mjgraboys": "Happy birthday, Ebony!! You are so loved!", "clari.cita": "Happy Birthday Ebony!! An inspiration to us all ♥️🥰🌸🌈🍄🍑", "crimson_fig": "Happy Birth Day to one of East Oakland’s finest!! Happy Birth Day Ebony!! 🖤👏🏾🖤👏🏾", "abitofwild": "✨ Happy birthday, Ebony! ✨", "ymrevers": "Happy Birthday, Ebony! 🎁🎁🎁", "axelandra": "What a post!! So much love!! Happy day 🧡🧡🧡🧡", "sayraahh": "Happy personal new year! 💛", "rosiepantsmmmk": "I wish I could like this a million times!! Happy birthday, Ebony!", "craigasaurousrex": "Wow wow wow go Ebony! Happy Solar Return 💕✨", "messytessie": "Happy birthday Ebony! From a fellow Gemini!", "chaninicholas\nVerified": "Verified", "awalk.lemni.skating": "Happy revolution around the sun, Ebony! Continue to shine bright like a diamond to everyone around you! 🎊🎉🎁🎆💝", "iholdmultitudes": "Happy Birthday Ebony and all blessings on your life. Thank you for being you and sharing yourself with us. 🌿", "geekylexb": "❤️❤️❤️", "bizreinhardt": "The podcast is great but you two really need a tv show... Happy birthday Ebony 🎉‼️💞 thank you for bringing us knowledge, looks and entertainment a la Erika’s ig 🙏", "shanshantel07": "What a beautiful caption! And those pictures are everything! 💕 Happy Birthday, Ebony! 🎈", "meredithjj": "Your love is so special. Happy birthday!", "spikedmartini": "Happy Birthday, Ebony!!! 💖💖💖", "daniobuckley": "Happy Birthday Ebony!!", "brooklynsouthernbell": "Happy birthday Eb", "iixxguise": "Happy birthday!! 🎂 ♥️", "sacredb70": "Happy Birthday Ebony!! 🙌🏽🙌🏽🙌🏽", "boyimhighmove": "This made me cry. Long live a Gemini legend! Happy Birthday Ebony 😭❤️🌹", "the_melanin_mrs": "Happy Birthday Ebony. Enjoy and wish you many more. Continue to shine your light in this dark world, it’s much appreciated.", "grettasgirl": "HBD EBONY!! 🙌🏻🙌🏻🙌🏻", "yogakeynyc": "Happy born day Eb!", "squinkl": "Happy birthday, Ebony!! Sending big love to you on your special day 💞", "lowtide.lettering": "Tearing up at the moonlight imagery. HBD, Eb!", "perfectonelife": "Happy Birthday!!", "rchelle13": "Sweetest birthday caption of all time 😭", "heyhaveyoueatenx": "♥️♥️♥️♥️♥️", "jerk_nugget": "many, many happy returns of the day ebony, today and every day! ✨🎉", "moniquecherrelle": "HAPPY BIRTHDAY EBONY!!!!!!!!! 💜", "wombatb72": "Happy birthday Eb! Enjoy your day!!!!!", "m.sassy.leo": "Happy birthday Ebony!", "candygreene": "YES! Happy Birthday, Eb! You deserve everything. Calling y’all later ❤️❤️❤️", "sianaarrgh": "💛💛💛💛💛💛💛 Happy birthday darling Eb!", "salty.world\nVerified": "Verified", "un_becomingme": "Happy Birthday, Eb!! ❤️🧡💛💚💙💜", "displacedyke": "Happy birthday, legend!👏🏾🌙😊", "mical_fk": "♥️♥️♥️♥️♥️♥️♥️♥️", "haruii__": "Ase asee! Happy birthday today and everyday 🍯❤️❤️", "earthaclit": "❤️❤️🤠", "nina_tame": "You two never fail to make me smile, my favourite love story. Happy beautiful magical birthday Ebony 🖤", "indigo.lauren": "This was so beautiful to read. 😭❤️ Happy birthday Ebony! 💫", "peanutandsweetpotato": "Happy Birthday Ebony!", "facetsofmimi": "What a beautiful post, Happy Birthday Ebony!", "kittykatchateau": "Wow I am in love with the last picture of you two. Awe 💗 happy birthday!!", "depirox": "HAPPY BIRTHDAY EBONY!!!!!!!!!!!🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳 (29 emojis)", "paddycakerz": "❤️", "blakeknees": "Happy birthday Ebony! You are an inspiration 💜", "lenawaithe\nVerified": "Verified", "anouskaisonline": "This love 💜 You two are amazing", "msdsantos6": "🤗😍 happy happy birthday Ebony🙌🏾🙏🏾✊🏾", "heyderenikki": "You two are so cute you make my heart hurt 😢😢 Happy Birthday Ebony!!!", "j_a_zarifian": "Celebrate for a month! That’s my credo and I expect everyone to adhere!! 🎉🍾🥂", "isabelsofiarock\nVerified": "Verified", "shesaiddude": "Rock that cowboy hat you powerful Gemini! TREAT YOURSELF EBONY YOUR BIRTH WAS IMPORTANT TO THE WORLD.", "fluffmyllama13": "A very Happy birthday, Ebony!", "sprinkled_with_confetti": "Happiest of birthdays to you Ebony 🙌", "nurselolita": "Happy birthday Ebony! We love you all and wish you a beautiful day full of self care and celebrations❤️❤️❤️❤️", "cristina298": "Happy birthday! 🎂🥰💗", "e.eeluz": "CRYING 👏❤️😭HAPPY BIRTHDAY!", "wildblackmusic": "😍😍😍", "askgoody": "HAPPY BIOLOGICAL NEW YEAR EB!!! 💜", "bookbabe25": "Happy birthday Ebony! The world is a better place because of you!", "sarlejeffries": "🖤 Happy Celebrations 🖤", "brianajacosta": "Happy birthday ebony! 🎂🎉❤️", "lunaandmiel": "What a beautiful soul. We are blessed to have Ebony on this Earth. Happy birthday! 🎉💜", "soucymir": "Happy birthday 🎂❤️", "rn.tm.u": "This is a stunningly beautiful post full of beautiful black love. Equally stunning are Ebony's thoughts and words; always so powerful with his cool demeanor. Happy birthday!", "alexandrawjordan": "All the love to Ebony Happy Birthday!", "_______ec_______": "Have a beautiful day, Ebony! ✨", "heathermaemusic": "HAPPY BIRTHDAY EBONY! The world is better because you exist!", "hairyscaryaquari": "Eb is a fucking icon🖤", "dabaddestdoula": "Damn that made me cry! Happy Birthday Ebony! May the two of you see 90 more! Happy Earth Day!!!! ✨❣️❣️", "_were_all_mad_here_": "This is so beautiful, I don’t even have the words’ 😅😍❤️ Happy Birthday, Eb!", "eliphechainedourre": "Happy birthday", "kieranblake": "....🙏🏻 to find a partner this amazing one day.... #goals", "nimba_gal_": "This is by far is the most beautiful birthday dedication I've ever see. Happy Birthday Ebony👌🏾😊", "brittanylamelia": "HAPPY BIRTHDAY TO SOMEONE I’m learning from and looks up to. And we share the same birthday!!!! 🎉🎉🎉🎉🎉🎂🎂🎂🎂🎂", "the.libra.dia": "so special, so loving, so cuuuute!!! 😍 i only wish to find the profound love you two have! happiest of birthdays... 🙏🏾💖💯", "janesevwalker": "Happy Birthday Ebony! 💕🎂", "mx.samsantos": "Happy Birthdayyyy!! I hope he has a good one. ❤️♊", "giorgiorascon": "ahhh i knew he was a gemini what a king. have the best birthday ever 💘💫💫💫", "mrs.epsilon": "Happy birthday Ebony 🎂", "pinky_and_thegrain": "Happy Birthday Ebony! 🎂", "roze_royze": "Happy Birthday Ebony!!!!! To many many more years Excitement !", "wannahaveakiki": "HAPPY BIRTHDAY EBONY!!!!! YOU THE FLYEST GEMINI WE GOT! KEEP ON SHINING!!!! THANK YOU FOR ALL YOU DO SIR!!!!!!!", "melkasey": "Beautiful, happy birthday Ebony 💖", "veronica_veronica_girrrl": "Ayyyeee...Happy Birthday Gemini!", "wiisabby": "Happy birthday!!!🖤💜🖤", "kaycieg": "A gorgeous tribute! Happy Birthday, Ebony 🥰", "shannonma3": "Happy birthday", "k.santizo": "💘Feliz cumpleaños Ebony 💘", "averagechezz": "Happy birthday! 🎉🎉🎉", "heyitsmekita": "Happy birthday Ebony 🙌🏾👏🏾🙏🏾", "char0804": "This is the cutest thing. Happy for your love. Happy birthday Ebony❤️", "luvee_rosa": "Happy Birthday!!!! 💜", "etsinthecity": "HAPPY BIRTHDAY EBONY. And literally can’t stop laughing at “old white man aesthetics”. You two are the best ❤️", "pumpkinpiexoxo": "❤️", "futurepau": "Happiest Birthday Eb!!!!", "hillielyman": "happy birthday 🔥📣", "qbrandi29": "Happy-day Ebony, 🎉🍯💜", "vannyntinu": "This is so beautiful 🙊😍😫", "julieta_salgado": "💓 Omg that cowboy look 🤠", "_jennylinnea_": "😭❤️", "iischristy": "We appreciate you Eb. My favorite Gemini. This is gonna be a good bday ! 🎈 🖤", "sjbolich": "Happy birthday, Eb!!!! You shine so bright 🌞🌞🌞", "spanana_": "I’m crying at work rn, beautiful love, beautiful person (both of you are). Happy birthday Ebony!", "jordysheff": "happy birthday eb 💗 y’all are so cute together and this caption was beautiful :’)", "mamacass_1920": "Happy Birthday!!!!!! 💜", "slimemold_lord": "Happy birthday, cutie-pie!!!! Xoxxx🎉", "katienumi": "Blessings and happy birthday❣️ stay blessed!", "amber.indigo": "Happy birthday, Ebony! You are a national treasure! 🎈", "_kie_ra": "Happiest birthday to you Ebony 🎉🎂💜", "emilyhbic": "I love Ebony so much!! Happy birthday to an incredibly admirable man.", "creaanna": "💖💖💖", "r_bilbs": "Happy bday Ebony!!!", "environmentaliv": "Happy birthday Ebony! 😊", "srrockos": "Happy birthday! Your words make me so happy. And thank you Ebony for all your work.", "mariel_illuminated": "All over goosebumps 😭😍", "m.a.c_summers": "Happy Birthday!!! ✨👑", "ajayslive": "Come through birthday celebrations and black love!!", "anyadedyna": "Happy birthday Ebony!!!!!", "jwilliamsesq": "😭 seriously I teared up. So beautiful. Love you both.", "erickaeckles": "Happy Birthday Ebony ♥️♥️♥️", "iirenecrooks": "My heart!!!! 😭😍😭😍 Happy Birthday Ebony 🎊💖✨", "nayelixm": "Happy Birthday Eb! Thank you for everything you do. You’re amazing! ❤️", "yemayajust": "Happy Birthday Ebony! 💗💗💗", "brooke.gillon": "Beautiful! Happy Birthday Ebony! ❤️❤️❤️", "crickettoes": "Hibby Burthday, sweet angel boy ! 💐", "blueeyedbirds": "This was just beautiful. Brought me to tears 😭 Happy Birthday Ebony!! ✨🎉", "khloe_janel": "HAPPY BIRTHDAY EBONY!!", "raisaflowers\nVerified": "Verified", "misskillemrox": "I love y'alls love so much.....SO MUCH! Happy birthday Ebony!", "mrshollymayes": "The way you love each other touches my heart so much. Happy Birthday Ebony! 🎉", "n.yallah": "Ahhh happy birthday Eb ❤️❤️", "templexmatisse": "happy bday ebony, thank you for all that you do!!!! you both have taught me so much. mvto (mvskoke word for thank you) 💖", "alessandrina____": "💜💜💜💜💜", "___breeezyy": "HAPPY HAPPY BIRTHDAY", "locdbelle": "Happy Birthday Eb!!🎉", "hilldoza": "Happy birthday, Ebony!!", "wakandawitch": "Happy happy birthday Ebony!! 🎉😍", "brooklyn11224": "Happy Solar Return, Ebony! 💎", "willienillie17": "Happy Birthday! ❤️", "brekfast_at_tiffanys": "Heyyyyy happy birthday ebony fellow Gemini ♊️♊️🎉🎉🎉🎉", "polkadotlibrarian": "Happy birthday Ebony!", "dominicanslovehaitiansmovement": "Happy bornday to Ebony! He fills us up with joy being unfuckablewith! Much love on this day and every day!", "dookitten": "Happy Birthday week Ebony!!!!!!! 💋💋💋❤❤❤❤❤❤❤", "midwifemanda": "What a beautiful tribute to a beautiful soul. Thank you both for your work that makes us all better. Happy birthday, Eb!", "moseiimose": "GEMINI KING I STAN", "saren_grey": "Happy birthday ebony !! 😭", "mxhawkmcfadzen": "✨HAPPY BIRTHDAY!!! ✨ 😘✨🎂✨🎪✨🎁✨🎉✨💝✨", "mynameisjessamyn\nVerified": "Verified", "georginehs": "Happy birthday Eb💕💕", "snowbearlee255": "Happy birthday Eb!! 🎉🎉🎉🎉🎉", "pusssywitch": "😭😭😭💜💜💜💜💜💜Happy birthday Ebony!", "leahreusch": "🧡🧡🧡🧡", "stueckberg": "😭❤️", "sirisrnsn": "😍❤️Happy birthday Ebony!❤️😍", "thurka": "Happy birthday Ebony 💜👏🏾 your partnership is goals 👏🏾💜", "trinette_ray": "Happy Birthday Ebony!!!!!❤️", "garbage\nVerified": "Verified", "anastasiagphoto": "Happy Birthday Eb! 💕", "jamiewinee": "Happy birthday Ebony! Grateful for being able to follow you on your journey even if it’s through a phone! 💖", "oldowllady": "Happy birthday!", "jennatalia_peachemoji": "Happy birthday !!! Hope you get to buy as MANY records as you want today! 😉 💕", "guyaeatsavacado": "OMG WE SHARE A BIRTHDAY AHH HAPPY BIRTHDAY EB", "deadbirdparty": "This is so incredibly beautiful!! 😭💖", "iasikhealingbrujx": "What an endless gift, blessings to you both!", "jaepsych": "Happy Birthday!!!!", "k6mil": "Yes parents!! Happy Bday Eb, May you and Ericka always have the strength and suppleness you all need to shine and support each other.", "maghans_closet": "Beautifully written! I love your love! ❤️❤️❤️❤️", "missvictorine_singer": "🌹🌸🍀🎂🥂🍾🎈🎁🎉", "yourmamadressesfunny": "Happy birthday, Ebony!!!", "manifestdreams": "Beautiful words about a beautiful soul 💗 The part about him making people feel seen when he speaks to them resonates deeply. We need more energy like that in this world. Thank you EB and thank you Ericka! Happy birthday!", "tlikey": "🥳 Happy Name Day beloved 🥂🍾", "sagceries": "this caption is just the most beautiful love letter. happy birthday Ebony 💞", "cestlag": "HAPPY BIRTHDAY EBBBBB!!! We love you!!! 💖💖💖", "martasnaefridar": "Happy birthday Ebony 💖 you are amazing 🙌🏻", "herandthecity": "I love this so much and I’m in love with how you love one another. 😍♥️", "emilymahiai": "Your love for each other is of the mountain-moving variety. Happy birthday!", "ifurie": "Happiest of birthdays to you Ebony. We fully don't even deserve to bask in your shine but here you share it with the world anyway. HAVE A GREAT FUCKING DAY!!! Hope your day is full of fresh Merrells and record shopping😂💕✨🎉🔥", "sarahpalisi": "Happy Birthday Eb!", "nessaposton": "Happy Birthday Eb!!!", "jazzmynejay\nVerified": "Verified", "stylesnatch": "Such a profound dedication😍 how sweet to be loved. Happy Birthday Ebony ✨✨From E and I ✌🏾", "_theimperfectionist_": "Happy birthday Eb!!!🙌🏾", "alex.haller": "Happy birthday Eb!!!", "my.ka.lee": "Happy birthday Ebony!!!! 💗✨🙌🏿", "sequoya_community": "Omg 💛🌙❤️", "laurencfisher": "Happy happy birthday Ebony! Such a beautiful tribute ❤️ yalls love is a blessing to see.", "ailovethat": "Yesss!!! 🙌🏾 Happy Birthday Eb! We are so grateful for your existence ✨We celebrate you today and always ❤️✨", "monie_gee": "Happy Birthday Ebony!!", "izetta.h": "Happy birfday Eb 🖤", "therealmissmilka": "HAPPY, HAPPY BIRTHDAY TO EBONY, YOUR LOVE, as he is a true gift to the world! ✨🌟✨", "chunshine27": "Happy birthday remarkable human being, we are all so lucky to live in the same space and time as you! Cheers to you Eb, and your beautiful love with Ericka. 🌟"}