{"shaisays": "Cashapp: $shaimas99 Venmo: @ayanna-mason-2", "fefe.longweavv": "Cashapp $mcflyish", "ms.emjohnson": "Cashapp: $LizardBreath256 venmo: MrsEMJohnson", "juniorsmommysb": "Cashapp: $HeyyyMrsCarter", "tiffanyaliyah": "It’s my birthday! Cashapp: $tiffanyaliyah Venmo: $tiffanyaliyah", "1ofmylittlemoods": "hi lovelies! I’m a black, mentally ill queer person who was just laid off. I would rly appreciate some financial help!! It was also jus my birthday!! VENMO: larkblackson 🖤🖤🖤🖤", "dawnlogo": "Reparations reparations reparations thank you in advance. Venmo: dwlogo CashApp: $dwlogo", "giovannaalles": "💯", "wheresauntrayray": "I see a lot of self-exalting people here. No “here’s a fund for my friend who has greater needs than I”. This is shameful mooching. And He began speaking a parable to the invited guests when He noticed how they had been picking out the places of honor at the table, saying to them, 8“When you are invited by someone to a wedding feast, do not take the place of honor, for someone more distinguished than you may have been invited by him, 9and he who invited you both will come and say to you, ‘Give your place to this man,’ and then in disgrace you proceed to occupy the last place. 10“But when you are invited, go and recline at the last place, so that when the one who has invited you comes, he may say to you, ‘Friend, move up higher’; then you will have honor in the sight of all who are at the table with you. 11“For everyone who exalts himself will be humbled, and he who humbles himself will be exalted.”", "tamaraquibell5766": "Reparations sweetheart nobody in this day except Muslims still have slaves to this day. Go bark about reparations to them why don’t you!", "texas_thesurfer": "\"Gimme a welfare check\" basically", "nwtnjms": "Venmo: NewtonJames", "darastarks": "Really having a difficult time paying off the last bit of my student housing so that I don't get evicted and can go to school next semester, so any little bit at all helps! Cashapp $DaraStarks and Venmo is True Starks (@ True-Truly)", "kalenbree": "$kalenbree", "sanityforlauren": "$SanityforLauren 🖤🌹", "janaytbys": "Cashapp: $janaytbys", "pixieshawty": "Cashapp & Venmo $ZaireNR", "blackwomanrisin": "Homeless after the death of my mother venmo:blackwomanrisin cashapp:$blackwomanrisin zelle:blackwomanrisin@gmail.com", "itami_syn": "Cashapp: $itamisyn College student studying environmental science", "shay.australia": "Venmo: @Shay-Australia or buy my book on Amazon titled \"Work in Progress: An Explanation Self-Love Today and Everyday\" Thank you @ihartericka for doing this! 🙏🏾", "kiskmw": "Cash app $kiskmw", "ninookay": "$Ninoyayomusic12 🙏🏽", "joshhtricks": "Why do today’s black ppl need reparations smh everyone who feels they deserve money just for being black should be ashamed", "mayashleyj": "On the ground. Bringing progressive early childhood models and community supported motherhood to the community—instead of forcing us to drive outside of our communities to get resources they attempt to lock us out of #thegrassrootsmorninggardenproject 💅🏻", "jazzyishere_": "Paypal: jazzylbryant@gmail.com HELP A STRUGGLING FIRST GEN COLLEGE STUDENT", "des4122": "Yess love this! Queer black theatre artist currently heading a new works theatre festival for college students and emerging artists in Boston (and need funding to pay all of our wonderful diverse artists!) Venmo: @Des-Lynn4122", "she.is.rish": "Venmo Larisha829", "dorrian799": "What a joke", "taylorjtimms": "Venmo: @taylorjtimms", "chellyxchainsaw": "PayPal: pritzy101@gmail.com", "blatinegra": "momma, doula, going back to school this fall. @expectingwonder on Venmo :).", "kimma_wema": "Cashapp : $OkimmaKempson 🎉", "salome_mnspeace": "CashApp is $salomepeace 💛", "daron360": "Cashapp: $daron360 Venmo: @ Daron-Richardson 🌞", "nickmetelski": "I’m not paying any of you shit", "hd417": "Cashapp : $vancehuff 🙏🏾", "arethuh_p": "A day late but still a dollar short: venmo: @Aretha-Pereira", "natyana.alexandra": "Venmo: @natyfonseca paypal: Natyamfonseca@gmail.com 🤠🤠🤠", "jalovelyy": "Cashapp $jalovelyyy", "queentaylor22": "Got accepted to my dream school to pursue a degree in Film and TV and tuition is wild but necessary. Any investment in my future is greatly appreciated $RayloTaylo22", "kendramlee": "Freelance photographer specializing in photographing the black diaspora in all our beautiful forms  Venmo and sqaurecash $KendraMLee or KendraMLee", "theloudmouthblackgirl": "Cashapp: $Sincerlychelly", "salem_afangideh": "Venmo: Salem-Afangideh", "mickss_tape": "biracial recent college grad here saving up to attend law school to be a pro bono social justice & criminal defense attorney to fight for people who have been enslaved by the criminal justice system... venmo is Michaela-Parrish 💕", "jordanisagirlname": "$smit5806 CashApp!", "alnixon": "Venmo @ alexis-nixon i want my acres and a mule tho or at least refunded for my $160,000 masters degree 😭 first generation college grad tho turn uuuup", "cydee21": "Am I too late? Venmo- @Cyd-Watson", "gingersroots": "Venmo: Empress_Asha", "christopher_aziz_johnson": "Living and supporting myself and my ma. Venmo: Christopher-Johnson-36 | cash app: chrisjohnson57387", "crvyambition": "Venmo:@tilusl CashApp:$Lctilus  #curious", "dajaarts": "I'm apart of an upcoming brand called dajaarts our goal is to show the natural beauty of black women thru art, clothes, and health. Come take a look and comment on what you like or don't. We've recently uploaded some 'mascots' concept art. Cash app - dajaarts all donations are so appreciated and humbling", "nickirose_1": "I wish I could help people out financially but I don’t have access to my bank funds. If anyone has any petitions/businesses/art commissions/accounts/things black-owned please link them or dm me I will promote everything I can!!! I know it’s not much but I want to spread some people’s crafts today :)", "zach_durr": "This is childish and obsurd", "siouxmanybees": "Venmo: Elena-Reynoso Cashapp: ElenaReynoso$ PayPal: elenakreynoso", "dwaynesays": "venmo: Dwayne-Hibbert", "aksfreestyles": "✨", "cloudy.leaves": "I'm just a gender queer person trying to get through life while also trying to better it for myself. My venmo is mozzarella-cinderella", "phillygoondevil": "cash app $TajaeBradley, i have a cavity i need to fix and no clinic will take me. bc i don’t live in the city, have health insurance and no source of income. anything helps!!!", "xiucultbby": "$adriannaglass", "a_aron.cole": "I fully support addressing institutionalized racism and the repercussions of slavery but spreading the idea that white individuals need to send African American individuals personal donations is absurd. That doesn’t fix the system. It’s posts like this that conservative politicians use to fire up their base.", "ratchetreiki": "$afftabucks", "anira.j": "$AniraJones 🖤", "tristaleebk": "Doula/artist/storyteller ✨🧡 Venmo: @TristaLee", "pharaohc3": "Happy Juneteenth y’all!!! PayPal: MJCollier3@yahoo.com, Venmo: @Millard-Collier, Cash App: $MillardCollier", "jay__med": "Queer black and chronically ill. Struggling to pay for University bills as well as hospital bills and my medications. Any little bit helps", "fauxsnowcone": "Trying to pay for school after getting my siblings through first! Cashapp: $AJayGhibli Venmo: AJayGhibli", "_nutellathehun": "Cash app : $nutellathehun", "panda.noodlesss": "This is so weird to me. Literally clicked About 20 people’s profiles who are leaving their Venmo and saying they need money yet when I click their page they are living such a lavish life. Traveling, going out to eat, buying cool things...yet are struggling to pay things that are actually important to them? So you guys are asking white random people on IG? We really have to stop this victim mentality yo, we are mentally enslaving ourselves with this thought process. Why aren’t we asking Asian people for money if we want to be real bc they make the most money in America?!", "ethereal624": "Cashapp $CurlyHasani", "msdsantos6": "Cashapp: $dareece6 venmo:@dareece6 support a black doula who provides free & low cost doula services to black birth givers 🤗✊🏾", "jesspettway": "✊🏽Venmo: jessicapettway ✨", "xxloveray": "Cash app: $ravencau13", "orangebarrelindustries": "Great post! Gave some to a woman I follow who always shares her cash app for this purpose and is full of life and humor and beauty and intelligence. I totally believe in and support government reparations and would give money towards that cause, as well. I’m a middle class white woman that struggles sometimes, but I know I got a huge head start and continued advantages due to the color of my skin and the wealth gap needs to be closed!", "sirflower_": "$Rowex nonbinary community birth worker aka future midperson (midwife) in the mix ♥️♥️👽👽. Let's bring this deserving care to low income communities of color as well as my black LGBTQ FAM who need safe space to birth♥️ I'm taking a leap of faith and quitting someone else's dream to focus more on my own !", "keyz2lovely": "CashApp $keikeit930💥💥💥💥💥💥💥💥💥💥", "mardia_._": "Cashapp: $mardiapierre", "jkeath": "Venmo: jessica-keath thank you Ericka!!", "harlemkai": "Born black and dying black  Venmo: harlemkai", "oliviakfun": "Cashapp $oliviaf18 Venmo @ OliviaFunderburg", "theladyalx": "I'm working on my first book, I'm a junior writer on a screenwriting project that's hopefully going places when it's done, and I've already had a writing fellowship named after me ($30-40k; I am working on getting that to more fertile and stable ground, too). I just have to get through the next couple of weeks because I made the decision to go full-time with my writing and my first paycheck from my side gig (& my Patreon) doesn't hit until the 1st. I know I didn't have to share all that but I am really proud of myself because I was diagnosed with MS this past fall and it's been hard as fuck. Cash App -> $TheLadyAlx and PayPal -> PayPal.me/alxpmorgan 💗✨", "tirsatalks": "https://www.paypal.me/tctw", "moyosays": "Black queer working in Southern African focusing on decolonization of education and ancestral trauma for an org that provides a barely livable monthly stipend. Any extra support is appreciated 💕 Venmo: @Lulu-Hawkes", "ajira": "Venmo: @ajira Cashapp: $ajiradarch #tipher", "noah.the.creative": "Black non-binary trans creative🙋🏽‍♂️ Cash App: $NoahFo Venmo: noah_foster", "positivepineapple23": "Venmo: plaidcineaste", "tomspevakdrums": "Lmfao", "djcausticchasm": "cashapp: $5kc5 love & God bless 🙏", "notkylapratt": "$shaynabp", "kof_loaf": "Venmo: @KofiEssel ✊🏿", "juliaundy": "Venmo @Julia-littleblessingsdoula PayPal littleblessingsdoula@gmail.com cash app $juliaundy83", "jafarence": "Marginalization is no joke!  Recent college graduate and Department of Education employee tryna pay the bills and empower the youth 🤘🏾 Venmo: L-Edwards-896 Cashapp: $mochapapi", "jacey.saraii": "Happy Juneteenth! 🥰 I’m a student trying to become educated in aviation, my goal is to become an air traffic controller or pilot. There’s a program my mom is trying her best to get me into but neither or us can seem to afford it, I would love your help guys I’m young & trying my best to figure out how I can push through and become successful 🤞🏾💝 venmo: jaceysaraii cashapp: $thanksjacey", "mxpapitopepito": "Www.Cash.Me/$vicentevalentino www.paypal.me/vicentevalentino venmo: vicente-vazquez-2", "sweetpdz": "Happy Juneteenth💜 Venmo: @dzidzonu-djugba", "spuddd_wavvvy": "$SydNClark because teaching ain’t no joke", "queendq420": "$daniquinn94", "clubeskmo": "cashapp: $gemuyu venmo: adriaelise 😙", "bre.starks": "cash app & venmo: $bcs333 I am unfortunately out of work due to mental health issues. literally anything would be a huge help", "blvsian_pvrsuasian": "💕Cashapp: $Snoopy8 Venmo:@ SnoopyFizzy 💕", "ios8.dmg": "Venmo @djije", "saul__dominic": "Fuck off. You don't deserve \"reparations\" you lazy cunts.", "bean_booty_shoppingcart": "Broke college student studying linguistics/foreign language😪 @ PayPal.me/nubiajohnson", "shayladtumbling": "shayla.tumbling@gmail.com (PayPal)", "sarahmen.des": "This guy’s comment was so infuriating, my mind just shut down. Like WTF!!!", "fixedwithyou": "just got an email about student loans for the one and a half years i spent at school.. definitely can’t pay today but hey. venmo : fixedwithyou", "justevette": "$eclayton3", "diafld": "cash app $diaflood venmo dia-flood 💕", "caitbadamo": "@sinkingxship @tombadamo", "jazmine_joyner91": "Venmo: @ jazmine-joyner PayPal: jazwrites91@outlook.com", "kruella_da_ville": "I'm mad I saw this post extra late :( but cash app: $khamisi26.", "syreneseraph": "$moonmadebih 🌟", "boobootiii": "Happy Juneteenth everybody! Venmo: @Tianna-Fields", "efemerallyfemme": "Venmo: @DanielleNicoleH11", "shayshayphotography": "CashApp:$SNelsom32 🙌🏽", "teenawilder": "Venmo: teenahayashi", "mmmelgol": "Grad student ❤️ venmo: $gomelgol", "delmarvadream": "cashapp $harperrrrrr", "c0unterpvrts_": "My Venmo is cherish-Christopher, I’m a struggling college student working hard to get my degree to be a Middle School history teacher. I want to be able to teach young black kids their history, I want to give them the unwhitwashed truth. I want them to know who they are before adulthood, so they don’t have to question where they come from. I want them to see that anything is possible. Please support my dreams of being a black queer educator.", "theblolzzz": "Queer black and trying to breath in this world. Venmo @ theblolzzz", "worldofzach": "😭💛 Cashapp: $worldofzach", "sidlil21": "Venmo: @sidlil21", "my_my32": "Venmo: @Myesha-Watkins", "___ohthatsny": "$ohthatsny01", "majewell8": "Venmo Jewellmillz Cash app $jmmm17", "simplyy_essie": "Venmo: $Esther1118", "beyonjay": "Venmo @jaymye", "morgreenn": "$morgngreen @/mmg1018 Happy Juneteenth!!!🙌😘", "afriquee_n": "Venmo: @Nneanata-Echetebu Cashapp: $Nneanata Love y’all", "_clarkkent": "$QuanaNi 💕", "ms.tiffany.marie": "Cashapp: $devoflora ✊🏿", "stomachfooot": "🙌🏾 Happy Juneteennth!! 🎊🎊🎉 Venmo: Rawboneymonie Cashapp: $rawboneymonie I'm a digital artist and need to replace my laptop's dying harddrive", "juliancollazo": "Cash app: $15collazoju Venmo: JCollazo677-25 Dual-Level MBA student in Philly. Full-time student and working full-time. Scholar athlete: MVP of CSAC men’s basketball and Scholar athlete of the year. Also Team Captain for 3 years!", "sd.b.c": "Are you fucking kidding? You know how stupid you sound right?", "kalimaamilak": "Venmo: @ kalimaa / PayPal: mskeshiaj@Gmail.com", "mikeishadache": "$MikeishaDache collecting interest on reparations ✨", "mayah_hatcher": "Black digital artist/model/donor looking to move to the east coast to find better representation amongst my people✨ if you can’t pay in $$, pay in references to art exhibits, news/tv networks, etc. And feel free to share my work! Venmo: Mayah_Hatcher Cashapp: $MayahHatcher PayPal: mayahhatcher55@gmail.com", "gooldywigs": "Bar tab?", "no_the_i_is_silent": "Cash app: ialiyahhhh (four h’s) I’m a queer black woman working in nyc and trying to make enough money for school in the fall", "nsadexo": "CashApp: $nsade913 Venmo: nsadexo", "evan_lichman": "My Venmo is Evan-Lichman", "akitahsun": "Cashapp : $akiraterry", "dbritt0n": "Cashapp: $DiamondBritton", "possum.bren": "This is fucking stupid", "motherlypersona": "Cashapp:$KeelyFae, ask about my art or my son,all funds will be to growing their futures🎨👶🏽", "rani.muddhu": "Cashapp $tarotcake", "cvmimi": "$cvmimi ✊🏽", "molly_mosier": "@emdawg_millionaire let’s Venmo Cami", "en_jaye_": "$nastynij29 🥰", "alyssaisliving": "Cashapp: $alyssaispaidd Venmo: alyssx13", "teepez": "venmo: Takara-Perry1", "livedbyangel": "$97angelk", "nanapomid": "I am an African American dancer struggling to pay for a camera to record and I am beginning college this year. I hope to have a career in dancing in one day🙏🏿 Venmo:@nanapomid Cashapp: $nanapomid", "amanijustkiddin": "So Venmo royally screwed me over. They didn’t take out the $200 I paid someone through the app (even though I had $300 in my account ???) then charged a $30 fee to my credit card THEN charged me a week later when I didn’t have $200 in my account (i had around $175) and now they’ve shut down my account and say I owe them $200. So if you Venmo me at @AmaniJKAlexander they’ll take that out of the $200 I owe them and will stop charging fees to my credit card 🤗", "chicoryzine": "Kindergarten teacher/herbalist here. Could always use financial support medicine making supplies, classroom books, and personal wellness. My venmo/cashapp is majorlyminor. Come thru y'all!", "aarynnlang": "$AarynLang cashapp", "phenomenalash": "CashApp: ashleyjdp", "mvxiie_": "Venmo: Max-Asante Cashapp: $maxasante", "teishajenaie": "$TeishaWilliams 🖤", "sunniee_d": "PayPal: paypal.me/d91moore", "justyourlocalmilf": "@hannahsquidward", "fridayforkofi": "Venmo: Papa-Midley", "blackandpodcast": "You don’t have to tell us twice: @JS_Perkins 👊🏽🙏🏾", "amira.tsegaye": "Cashapp: $amira97 ✊🏽", "albert.freeeman": "CashApp: $ALBeBroke", "_toyamoore_": "$toyacobb", "nneka_nj": "Venmo: @nneka-njoku so I can continue to live deeper in my joy. Thank you!", "phoenixical": "Venmo: Sharee-McGriff", "reyesfam96": "$nattycatt76 Happy Freedom Day ✊🏾✊🏾", "amirahraheem": "$Raheamir96 I'm also a struggling college student so literally anything helps ❤️❤️❤️", "chynnadollyogi": "Happy Juneteenth Queen, thank you! ❤️🙏🏾", "dianicia": "Venmo @dianicia", "kennadisings": "PayPal: kutiehurst@gmail.com CashApp: $KenHurst14", "livelovepeacemusic18": "👏🏾👏🏾👏🏾this post is everything!!! Cashapp: @adaeze218", "scootr": "venmo @scootr", "angnlinares": "cashapp is $angnlinares", "belkongo": "Mine is @ClaireAurelie. This would most likely help with chronic illness medical fees. And the stress of living in anti-working class/poor/lowincome NYC", "kit.crap": "I wonder if y’all actually are making money for this", "tiarraaa___": "$Tiarraaaa", "amira.vw": "cashtag $AVPRINCESS", "lucygooseynyc": "Hmmm yesss! https://www.paypal.me/lyssettehorne", "virginsrock": "Venmo: @iiona-virgin", "adriennewhoo": "@lvahey @emilyshultz05 @meatshelf @jewelspules HI YALL. Thanks so much for your support. I have started updating it with supplies. I will continue to update with books but there are def some essential supplies there!!", "juliacancellaro": "@karenshenoudaa pay up", "abby_ramona": "$abbyramona", "_lei.png_": "Cashapp: $lei125 Venmo: lei125", "steeledossier": "Venmo: @jYasss cashapp: $jYasss", "prietaflowerchild": "Afro-Latina mixed race, entrepreneur, business owner of \"Vanna'i Vintage\" on depop, full time college student Venmo:@Lauryn-PrietoSanchez", "faded_fresh": "Cashapp $soooFresh ✊🏽", "bkargb": "Venmo @rashaunda-brooks", "mizan_asha": "Venmo: @Mizan-Willis 🙌🏾", "asocialcommentary": "I feel so bad from r black folx that allow themselves to be fooled into thinking that \"they've made it\" or \"things are better\", it's a form of latent insecurity that only damages the community as theyre seeking outward validation. Y'all can keep your magazines and award shows, that's not an indicator of my work's value. See AfroPunk and the virtual dissolving of the free ticket program, see Kanye hiring majority white or other passing models.", "oh.lateefa": "It's pride month and Juneteenth so help a black bisexual broke college student pay her fees for my summer course. I'm trying to graduate early bc I absolutely hate that school, so help me out. Venmo: queen-lateefa PayPal:jamjam18 Cashapp: $ohlateefa", "rngulledge": "Venmo: @Raven-Gulledge thx 😘✌🏾", "edlross": "hey y’all, i’m a broke college kid currently going through a divorce. any extra reparations y’all can give will help! thanks❤️cashapp & venmo: $edwardneedsmoney", "landofbrooke": "Cashapp: $landofbrooke", "kayla_is_my_username": "Venmo: @The_Cocorunt I’m a college student trying to minimize my debt", "jazzywaggs": "$jazzywaggs / venmo: jazzywaggs bc life is hard", "amazonzed": "Paypal: zoeraeamber", "j.measonjr": "Cashapp: $MajorEason Venmo: @Major-Eason", "chilloutchels": "Venmo: @ChelseaHonea", "13minuteslate": "$13minuteslate", "lo_stanford": "$laurenastanford", "_orangemoonbae": "Trying to start a business and build an empire! CashApp:$astoney2018 Venmo:@nefertarispalace", "limitlessqueerfashionshow": "Love all that you do", "yxnibrmp": "@lilyanzdai Venmo $ayanabrumfield cashapp", "poetic__mess": "Y'all probably dislike being tagged in large groups. But Sliding in the dms have never worked for me.... Y'all are difficult to Flatter. 🤭 Where can I be of use..... Because I am not worthless.... and I have multiple hats. What I know can help Us. As a Black MILLENNIAL with no Children. I'm Just showing my ableness. @jadapinkettsmith @keke @wale @rocnation @morrischestnutofficial @samuelljackson", "afrodite.stone": "How grand it would be to be supported for all the support we continue to give, and not so often receive?! Certainly would allow for some to breathe a little lighter. Amen.  Cashapp is $shelbymaeweems", "organicfreerangeegg": "venmo: cartongrape cashapp: $cartongrape im currently living in a toxic situation and for the betterment of my mental health trying to save money and move out", "khadijahrbz": "cashapp: $khadijahrbz ✨ venmo: khadijahrbz", "mrlifeisrich": "Cashapp: $mrlifeisrich Venmo: overitrich", "nicholelove86": "$stephaniel252 🙌", "yourfavblackman": "venmo: Brandon-Patterson", "notactuallydom_": "Cash app: $DomSav Venmo: Dominique-Savage-2", "lacedwithlavender": "Cashapp $PrincessEngland need money for a new home we living in a hotel and need help PayPal: https://www.paypal.me/AlimaEngland gofundme is in my bio", "dakotasymone": "Venmo: dakotamccann", "crazyt87": "Venmo @tim-leslie-1 Cashapp $Tleslie09 I'm a Marriage and Family Therapist. I work a lot with young adults in the community and also do some work with the LGBTQ+ community in colleges and online", "its_tonybtw": "Cashapp: $YoToni", "oppressivegemini": "Should asians also give money", "chilophobia": "paypal: chilophobia@gmail.com venmo: @ mmclune cash app: $mmclune", "pumpkinpiexoxo": "$TraciGriggs 🙏🏽", "manda_cierra": "$Mandacierra ✊🏽✊🏽", "mortvinny": "Cash app: $DALLASDIAZ venmo: @Dallas-Diaz", "alllyevans1_": "🔥🔥🔥 since this was deleted 🔥🔥I would like to make a few points. The Civil Rights Legislation is what made it possible for you to be you today. So, an \" I hate America\" approach is hypocritical. Next, you said small private donations are not reparations, but go on to ask for money from \"white people\" in general. Which some might consider an \"individual isolated donation\". Again we see the hypocrisy. You did not ask for a rally in support for the black community, you asked for essentially everything that you do not consider a reparation. This is an almost comical post. If you really want change maybe ask people to support more black businesses, etc. Rallying people together is typically a better way to achieve your goals than saying, \"Hey white people give me your money for something you had absolutely nothing to do with and no control over, but like, a person you have never met and is distantly related to you was a piece of shit so, let's see the check hunni\". It is a tacky and absurd request. I stand behind people of all races, sexual orientations, etc. Asking people on the internet to venmo you for reparations. Just silly.", "_a_chanel": "Cashapp $acd123 to support @lifecyclebiking and the emotional health work we do in queer, POC and low income communities.", "_imdatperson_": "For fuck’s sake lol", "heba.a2": "Freshman in college going to one day have my very own law firm so I can help the black community/ minorities know their rights/get afforded legal counseling cashapp:$Heba2 PayPal:heba2", "gaybabyzan": "Paypal.me/xanderjm", "sydneyclxrke": "cash app $sclarkej", "_mmouthygxrl": "Black person still struggling to pay rent. It’s tough out here! Venmo: @mklive", "americanwastoid": "Thank you for posting this and spreading knowledge", "emmainanutshell": "@reyntolds this is hilarious", "thbrittanyy": "Cash app: $brittanytims Venmo: BrittanyTims", "rach_in_dc": "💛", "nastyvegan": "Paypal.me/nastyvegan hey 💁🏽‍♀️", "nickkmotley": "Yes! This is everything. I am about to start college next year (just graduated high school) and have been supporting myself financially. It’s hard to do as an 18 year old, but we do what we gotta do. Kisses to all my melanin kings and queens ❤️. Venmo: nickmotley", "iuification": "Venmo/cashapp @mathewlarosiliere", "fashionshoediva": "I’m a teacher assistant/creative in MS. I currently serve as a 7th/8th grade study hall teacher. Since I’m an hourly employee I do not receive EEF money for materials for my students. I’m trying to add books to my library. It’s tough. Any donations are greatly appreciated. In addition to my work in education l, I’m currently writing a book for young adults and young black women. I was looking for good books with good content with diverse characters. There were none. So...I decided to write one. Cash app/Venmo: Fashionshoediva PayPal: Daphne Patton", "soulisticwellness": "Cashapp : $shirleyjohnson520 Venmo: @shirley-johnson Feel free to send reparations for the past directly to me above 🙏🏾", "quelquefoisphoto": "I am a photographer and filmmaker trying to make a short film about dating rejection as a black woman. Venmo: Lemia-Bodden (thank you, @ihartericka!)", "lilxshippo": "Cash App: $kilovesyou", "plut0nicalchemy": "🌻 Cash app: $plutotarot", "leeshh_": "Cashapp: $Leesh9213", "estrelleeee": "$Est375 🙏🏽", "herandthecity": "UNAPOLOGETICALLY BLACK ‼️Cash App: $thatgirltam", "renaissancegyal": "Cashapp: $fjarain I’m a visual artist too 🤪✊🏾", "_pettymayonaise": "Black non-binary art therapist just tryna pay off my loans & eat 🌸 Venmo: Ariel-Roland-Waring", "jkiillaaaaaa": "@styleofmy_own12", "other_surrealities": "I'm trans and trying to escape abuse PayPal: genesisko09@gmail.com Venmo: Gene Tabak", "nottiredbutsleepy": "cashapp: $Tanya Calvin venmo: Tanya-calvin", "jalapeno_pappas": "@spirited_soul11", "not_oppressed_or_psychotic": "Venmo @indigotshai, Cashapp $indigobrunton, PayPal indieeb@icloud.com !!! 👏🏾👏🏾", "shayretrograde": "shavonnebee $shavonnebee I also sell shirts here: @redwandboutique 🙏🏽", "honeyedlotus": "You already know!!! QWOC Painter! @acj.xi and my cashapp is $lolo365", "quietfeline": "I’m a 17 year old college freshman just finished my first semester. I’m pursuing creative writing and I’d love to publish my own books one day. My venmo is @ Morgan-Faith-6", "sincerelyalma": "I just graduated for college 3 days ago and my student loans are about to kick in. I would really appreciate some help managing those monthly payments and maybe have a little bit of cash for a celebratory dinner. 😊Thank you . Venmo: Alma Musvosvi Cashapp: $AlmaMusvosvi", "ceo.samoney": "$BoujieeFantasies ( cashapp ) boujiee.fantasies@yahoo.com ( paypal ) Thanks 💛", "_karihill": "Venmo: @karihill", "unofficialamandashow": "Unfortunately, I have to retake MCAT again. Study resources are reallllly expensive and I would really appreciate some help funding this endeavor. Thanks 😍 Venmo: Amanda Musvosvi Cashapp: $AmandaMusvosvi", "lucky___yes": "No, slavery has ended. And not only that why in God's name would white people pay us for something their great great grandfather did? Why is it the black community thinks their entitled to a black card. We aren't owed anything by this country unless you have been personally effected by racism, which most of us haven't. It's ridiculous how some people truly believe their entitled, and demanding compensation is even more insane.", "thicc.thucc_cinco.depresso": "$maemas", "denieyplum": "Hey hey budding artist. I can no longer afford art school so I'm trying my best to take the least expense route to my degree. I've also been swamped with vet bills for my sick cat and I will have to bring him back soon as his condition is not getting better. Paypal: denieyplum2@gmail.com cashapp: $DeniellePlummer", "charmaynemoniquee": "Full-time student/ Full-time/ first time mommy. Cashapp $charmaynembutler", "xo.juniper": "NOT FOR ME, for @sssparklepants - venmo @sparklepants", "dr.kholi": "Oh, on Juneteenth, definitely feel free to cash app $khoLi - not just for reparations for my ancestors, or for being a black and queer girl who survived and is now thriving in the south - but reparations for any time white-owned businesses have tried to lower my bids or pay me less than the value that I contribute to their efforts. 💜", "chantel_mcneil": "Venmo: @Tieagra-McNeil Cashapp: $TCMcNeil  Dual-level degree student pursuing her MBA! Two degrees on the way. Working and going to school full time in Philly! Happy Juneteenth everyone! ❤️✨❤️", "cheescakefanaccount": "You are a fucking idiot. I feel in no way that I, as a white person, owe blacks a thing. This idea that just because I’m white should pay blacks money is ridiculous. Should innocent Muslims have to pay money to whites killed in terror attacks committed by other Muslims just because they share an identity? No. I suggest you stop whining about what has happened in the past and continue to better yourself as a person. Absolutely slavery was atrocious but slaves were kept by all races. Hell, blacks kept slaves. The notion that just WHITES should have to pay reparations is racist in and of itself. Grow up.", "whooooorree_from_highgarden": "Venmo: @Margaret-Bowerman Cashapp: $teragramb I’m a gay black woman, who was kicked out at the beginning of the summer and I’m really struggling to get by financially. I hope one day I can be financially stable enough to go back to school and pursue my creative and artistic aspirations. ✊🏽happy✊🏽juneteenth✊🏽", "ittybitttie": "cashapp - $britttanyyyy", "jasmynbrielle": "Thissssss! 🙌🏽 I’m just tryna learn sustainable farming practices all over the world. Help me out! venmo: @jasmynbrielle", "ursalee": "Ursulaleewright - paypal 🔥", "ashantiii23": "Venmo: @ Ashanti-Williams-5", "samaraphonic": "Venmo: Samara-Bradley 🖤✨✊🏽", "joffreymiller": "Cashapp: $JoffreyMiller . Black man with a plan. I love us forreal. Thank you Queen.", "flozzyanne.collection": "yes cashapp $funjennyy", "dwzzle": "Cash app: $DDelonteC Venmo : DwigCarm", "oheytaneasha": "And follow @critiquesfortheculture 💕", "que_hayes": "cashapp: $loveislove225 ✨ #abundance", "east.aj": "Cashapp: $Nuajeorleans", "realdesibee": "Cashapp $realdesibee 🙏🏽🥰✊🏾", "ohjeezroman": "Paypal - mwfro", "asherc.jpg": "venmo: Ash-Etta, cashapp: $AshEtta paypal: burch.natashac@gmail.com", "master.chief.jap": "Do Irish get reparations too?", "simplyyjanay": "👏🏿👏🏿👏🏿", "bella_briii": "Caspapp $bellabriii ✊🏽✊🏽✊🏽", "crownexo_": "$crownexo 🌈✊🏾✨", "blkmoonlight": "Venmo: @Alandria", "teragram.b": "Venmo: @Margaret-Bowerman Cashapp: $teragramb I’m a gay black woman, who was kicked out of my home at the beginning of the summer and I’m really struggling to get by financially. I hope one day I can be financially stable enough to go back to school and pursue my creative and artistic aspirations. ✊🏽happy✊🏽juneteenth✊🏽", "pepitamija_": "Venmo: @ tayduers cashapp: $tayduers", "the.cain.instinct": "https://www.paypal.me/kkheterophobe", "sis.summer": "Cashapp: $styleishernametv starting a clothing business promoting pan Africanism and he uniting. I’d appreciate it.", "jadexsharee": "Venmo: @jadesharee Cashapp: $jadesharee", "brightmo_burgundy": "$MondSankara", "vertigo_potato": "Venmo: littleusername ///chronically ill full time student working 3 jobs trying to support themselves and pay for their care", "tinyangrycrafts": "Perpetually broke queer seamstress over here. ✨ Venmo- $tinyangry Cashapp- @ Carla-W PayPal- okamishoujo@gmail.com", "chronicallyliv": "Queer sickle cell warrior celebrating June 19th for two reasons -- 1) juneteenth and 2) the 10th anniversary of World Sickle Cell Day 💪🏾 🏳️‍🌈🎉❤️ . I create art and educate others about Sickle Cell Anemia, chronic illnesses, and the importance of self advocacy -- when I have the energy I'm a freelance writer 🐢 venmo is madamolive || paypal is o.erkins16@gmail.com 🙏🏾 Love, light, and good vibes to all + extra spoons to any chronic illness warriors out there 💜💜", "esperknows": "$deniroelliott", "briana.j2123": "Cashapp: $Briana2123", "jam_jam_05": "No", "sweet_sentimientazos": "Posting for a black family I know going through it in GA. They’ve asked me to share as they’re navigating unstable housing daily and could use a lot more support! PayPal is: antjuanadams@yahoo.com", "be_easssy": "Cashapp: $jaecof", "therealnormanbatez": "I’m a non-binary visual artist who’s walked away from being over worked and under paid. Cashapp $MASTERBATEZ Venmo Kenyatta-Bosman https://www.paypal.me/DeathDeliveryBoyz", "nupsterr": "Cash app: $IreyahS 💖 help a sista out 😘", "consciousandaligned": "Venmo @ChidimmaOzor", "meekie": "@nywelebynine", "klassjlife": "My cash app is $jaetheartist . I'm a 19 trying-to-be entrepreneur. I'm currently selling my art off of my Instagram rn. A purchase, a donation, anything would help. I'm saving for a wheelchair, a desktop, and audio recording equipment. Much love brothers & sisters ❤❤❤✊🏾", "leilanidablackoracle": "CashApp: $JaidaLForeman PayPal: jaidaforeman@gmail.com I’m a tarot reader and spiritual healer! Dm me and get read today 😤💁🏽‍♀️", "milalankford": "My Venmo is @jklankford y’all!! Happy mf’n juneteenth!!", "blackcraftbeauty_pmu": "Venmo: jwilliams633", "orange_skiess": "I’m starting med school in a month! Venmo: jthelus", "kaylareefer": "Venmo: @Kayla-Reefer Cashapp: $KayReefy 😊", "min.yachty": "Queer Black women here! Currently financially struggling ! Venmo: minthott", "__ajai__": "Queer boi trying to make it in media. Help me continue my work. Thank you! ❤️ Venmo: ajai123", "wariesi": "A QUEEN.", "alexmmcfadden": "Venmo me: @ alexmcf", "rodneyd2": "Paypal: tallulauk@yahoo.co.uk", "becomher": "$CANDICEILOH", "onwueg": "venmo: @MoniQue-Rangell-Onwuegbuzia", "tezla": "Just a black NYC educator out here trying to support my school, my classroom, and tomorrow’s future leaders. Ways to contribute to my classroom at this link: https://linktr.ee/tezla", "nick.dunston": "nick-dunston nicked96@gmail.com 😭", "4m1na7a": "amijdiop", "iamshaunna_williams": "Venmo: Shaunna-Williams 🙏🔮☺️", "53.g4": "Y’all make me ashamed to be black this is pathetic", "allisonalcena": "Cash app is $allimoney. I write. Link in bio", "xaheonia": "venmo: sralorion queer, disabled afro-latinx currently working as many hours as i'm able, living paycheck to paycheck, and trying to go back to school 💕", "fredfreddnfreddy": "Venmo @SigmundFred I'm falling into the vicious cycle created by sudden layoffs, groceries must be bought, and rent is due. I'll eat my landlord later, but the bills are coming soon.", "shhmattea": "All my love to you and Eb! Thank you!! Venmo: @shhMATTEA", "itstherealsarak": "Are you stupid", "zimbabweenie_": "cashapp: $africanarchy venmo: smhlaba", "coachproflo": "Cashapp $daniellemoniquelynch", "gabriellawhte": "Cashapp me🦋😍 $gabriellariley", "theroguewarlockmonk": "Cashapp: $JaiByrdCol", "jasminevivianknight": "Venmo me I a broke queer black artist : Jasmine-Torres-12", "kyle.souter": "Venmo: Kyle-Souter", "cognitivadissonantia": "Cashapp: $GracieuxBaraka Venmo: GracieuxBaraka", "viddyboy": "I'm a filmmaker/freelance video technician, and am constantly amazed at the engrained racism and dangerous mentalities of those in managerial positions in the industries I work in. Let's strive to hold these people accountable for their abuse of power! - venmo: @anderson91", "beyondthisvessel": "cash app: $Oreaa venmo: @oreaa", "_madamemila": "Cashapp: $IAMSHE777 Let me help with some of this white guilt y’all feeling😚", "muse_head_": "Non-binary, pan, black, young, and proud! Also struggling to get to med school, so anything at all is appreciated 💖💖💖 happy Juneteenth, loves", "shari.elle": "Venmo- @sharielle Cashapp- $shariellea", "sweetest_euphoria": "This is too dope! Hit my cashapp, $SumayyahThickThighs, PayPal seraphimlady@gmail.com", "nayo_naise": "venmo: @KamariaWoods cashapp: $KamariaNayo 😘", "blissfulstupor": "Queer black being here working on creating a safe space/community centre in white nashville after running a group for QPOC and black folks for the past few years. Help me better myself and my community 💚  cashapp: $blissfulstupor venmo: @blissss paypal: blisscortez@gmail.com", "ekeme": "Working on getting my degree at UCLA while chasing my dream as an actress!! Cash app: $ekeme venmo: @ekeme PayPal: luvekeme@gmail.com", "lola.rose.eros": "CashApp $LolaRoseEros Become a patron @ patreon.com/lola_rose_eros to support my life and art on an ongoing & monthly basis!🌹", "healingwhileblack": "Working on my MSW and tryna live under white supremacist state violence. Cashapp: $healingwhileblack", "kniaspora": "Cash App: $KhadijaAdell", "jadenamaya_": "Venmo: jadendx 🖤", "arielleavitt": "goofy as fuck 🤪", "kreaytion": "$kreaytion I'm an artist and stylist looking to get more into photography and trying to get my hands on a camera ✨✨✨", "alannahsheri92": "✊🏾✊🏾✊🏾 currently a graduate student in a PhD program struggling daily while trying to reach back to my family as much as possible! Venmo @Alannah-Caisey", "310shawty": "Im an intuitive tarot reader! My cashapp is $honeyqueentarot or you can book a reading with me 🔮✨✊🏽", "kaleidoscopety": "Cash app: $Kaleidoty Paypal: https://paypal.me/tyhargrove", "loveiscourt": "$LoveIsCourt", "iamjusteri": "Cash app : $ErianMcMillian", "kailyndavillier": "Paypal me please! The struggle is real😭: kailyndavillier@gmail.com", "canaldaysigh": "@choiii.boiii", "_zjwalker": "$Z92", "shongay_motsi": "Happy Juneteenth!! PayPal: shon.mo205@gmail.com", "oliviafparker": "Cash App: OliviafParker Venmo: Olivia_Parker Paypal: oliviafparker", "pliverpool": "Venmo: pliverpool 🌈 cash app: $pliverpool 🌈🌈🌈🌈🌈🌈", "nubianfelinity": "Cash App $Treipaid", "lindseyrjohnson": "💥Happy Juneteenth!!!! @lrj896 Venmo @lrj897 Ca$happ ⭐️💥", "taylormalik324": "Venmo: Taylor-Goyette-Frechette CashApp: TMalik24", "maryjamila_": "Cashapp: $MaryJamila", "earthtojordi": "I’m a queer non binary unicorn just trying to survive and THRIVE creating art without succumbing to unhealthy work environments. Any donation and investment helps! Venmo: @ jordiphi Cashapp: $jordiphi", "eggnoze": "Venmo: @ ericart", "barefoot_bella": "$barefootbella", "blackqueering": "🖤💪🏾 non-binary queer black community birthworker/lactation counselor/childbirtheducator/also working on movement in pregnancy for queer and fat black/brown bodies...I'm a parent of Twins living in Brooklyn... supporting my community with family/community building deposit the coins here: HunterDaeDoula(Venmo), $Petitbienriches (Cashapp) ComfortAcrossthespectrum (paypal) 👍🏾", "suhmanthduh": "https://www.paypal.me/moopaloop", "lyiahsimone": "someone support my ongoing pizza cravings pls and thx 😂🍕🙏🏽 venmo: Aalyiah-Grant cashapp: AalyiahGrant", "the_good_vibrations": "Cash App: $EbJoy 🙌🏾", "rated_p_g_": "Cash App: $ItisRatedpg 😘", "mattcwen": "cashapp! $mattcwen", "marisatejeda_": "Thanks! Venmo: marisa-tejeda", "jemmiller": "@jemmiller on Venmo. I will be teaching 4th grade in Watts this fall, just a black teacher trying to get her students a classroom full of resources ✊🏽", "imyagirleva": "Cash app: $emlewis98 Venmo: @imyagirleva", "nwazine": "Black non-binary babe in Texas. Making zines for & by QTPOC! I’m also a local organizer & future sex educator. Cash app: @KaiKashh Venmo: @nwazine", "maddipopz": "Cashapp - Mattyicexp", "dizzysface": "Recently laid off, cashtag: $pxldprkr", "0hluna": "PERIODT! Cashapp $Erinc4r", "daniellethewinediva": "Need funding to launch my wine tee business cashapp $DanielleLAnderson", "fuzsypapa": "This is beautiful", "queen.noire": "Cashapp me at: $KeviniaP ✊🏿", "upenditap": "Venmo @ tiffany-powell-57", "2sparks_beyond": "cashapp ashtbell96 / venmo Ashlyn-Bell-3", "sharea_rea": "cashapp: $harea Venmo: @sharea", "actualangel": "my venmo is (lexie-hamblin) help this black person come up with some money for a security deposit for an apartment 🥺", "shekinah.official": "Again with the facts!! Venmo: @shekinah-camille Cashapp: $ShekinahWeekly . . Also check out my latest post.", "only.niyaah": "$NiyahAshanti", "afrobicontinentalcreature": "@ihartericka I'm a queer continental African navigating life in the United states sequentially. I'm double majoring in International Social justice and Economics. This is my final year and it has been a journey. I intend on creating a clothing line that highlight global issues and freelance after uni. Cash App-$Afropolitan12... Please anything will gladly be appreciated", "joncopes": "venmo/cashapp: joncopes thx xoxo", "nadirahmcgill": "🗣THANK YOU! venmo: @nadirahmcgill", "angelica_mnk": "Hey I have a great opportunity in August! I was granted an internship/ artist residency in France and I’m raising money for supplies and funds! PayPal.me/amaizinkart @amaizink_art would love the support! Thanks for posting also @ihartericka", "ashleyk.music": "Happy Juneteenth! Just a Black Artist trying keep their feet in the pavement CashApp: $AshTheTiny", "curlyblerd": "Cashapp: $stewmks Venmo: stewmks", "beccabun_": "$RebeccaSS", "kayycole": "Venmo: kaylaccoleman Cash app: kaylaccoleman", "deangied": "Hi there! I am a fifth year clinical psychology doctoral student. My mission as a psychologist is to dismantle mental health stigma and increase access for people of color. I also work as an intuitive life coach! My venmo is @deangied and my cashapp is $DeangieD 💗💗💗", "j.ss.ie": "$jessie1882 ✨", "yourcollaredwife": "Cashapp $toytoyroxx paypal:toytoyroxx@gmail.com venmo:yourcollaredwife", "marathecreator": "CashApp: $Marakat Venmo: Maracreates PayPal.me/jamara409", "seacgo": "venmo: @seacgo 💰 app: $Seacgor", "zariathesunflower": "Cash app- $SunflowerGoddess222", "kodaxin_me": "Cash app: $IcessBooker", "moonlightsonata.2": "Cashapp:$SiddiqahMumin", "worldwideavenue": "venmo: @abeni-gwynn-baker cashapp: @worldwideavenue", "thatfitveganchick": "PayPal : adpolitehill@gmail.com", "yanniyoung": "Venmo: yanni-young PayPal: yanniy97@gmail.com ✊🏽✊🏽✊🏽✊🏽✊🏽", "boogie_boiii": "Ase...venmo: Evan-brooks1027", "thenapministry": "Cashapp: $NapMinistry Venmo: TheNapMinistry", "at.mya": "aspiring actress $MyaBvbyyy", "tfrua": "venmo- @ruaosman", "morgamsnith": "my mom’s venmo!!!: @Dana-Bowles raised 3 wonderful kids, virtually on her own, through the most difficult parts of adolescence. trying her very best to put our asses through school, while putting her own wants, wishes, and dreams on the back-burner. shes incredible", "gadderic89": "Or how about let bygones be bygones it’s in the past let it go", "marina.ra.sauce": "I'm out of the country where most of these apps don't work. Commenting so I can find it when I get home on Friday to make some donations ❤️", "berrii420": "$berrii317 Black, creative, rejected, messy, female artist🖤", "tantricsoulbirth": "Venmo - @tantricsoulbirth Cashapp - $tantricsoulbirth PayPal.me/tantricsoulbirth", "simply_tati": "Happy Juneteenth! ✊🏾 venmo: afrotrey paypal.me/tatirey12", "dasiamone_": "$daswarn venmo: daswarn", "honeycharcoal": "Cashapp:$tomme2 Venmo: tomm-e", "nani.wata": "Cashapp $sadiesadie Venmo @Sa-de 🌻🌻🌻", "nisadang.co": "@/$nisadang", "kween.bearth": "Happy Juneteenth!!! Cash App: $KweenBearthZ", "unapologetically.jason": "An artist from Seattle empowering creatives to pursue their passions. Anything helps, it all goes to investing in the art ❤️ Venmo: jason_bev16", "comedybadboy": "my jewish friend wants reparation for the romans... venmo me and i’ll give it to him at AaronAtkins", "bigbdoe": "Help a young organizer 1x $brodywater33", "themixedupwriter": "queer black creative over here 🔥 $NicKay89", "crownednurseamor821": "Cashapp $AuraCoolAmor", "cheyenne_washington": "$chypi", "e_mais": "I am a sick blk trans writer/teaching artist/ dog walker and my account stays in the negatives. Venmo: eddie-maisonet-1 Cash: $emais", "lwrdsss": "nonbinary and trans and queer and just graduated art school ✊🏾♥️🙏🏾 PayPal and e-transfers: lourdesduniam@gmail.com", "alwayssmiling27": "Cashapp: $Queenassata Venmo: @QueenAssata-Stephens ✊🏾✊🏾", "nicole.in.real.life": "Happy Juneteenth! I'm Nicole, just a poor black child tryin to make it in America ✌🏾 cash app:$cquake26 Venmo: @Nicoledhart PayPal: /Nicoledhart", "andyzonesix": "Venmo: andyzonesix, Google pay: andyzonesix@gmail.com, PayPal: andy@eastsideandy.com", "aldeshaxoxo": "HAPPY JUNETEENTH!!!! ✊🏾✊🏾✊🏾CashApp: $christinagissel97", "cstlaith": "Venmo @ alethe Cashapp $AdaezeA ! Qtpoc 🌹", "maryamajayi": "Venmo @maryam-ajayi ✊🏾", "thefreeblackwomenslibrary_la": "Our Patreon and GoFundMe are in the #linkinbio", "tqboogie": "Venmo: Turquoise-collins Cash: $TQc", "kelley.green": "Yaaaas! Venmo me: @kelley-green-1", "losteele": "$Losteele", "mermaidinthemountains": "Venmo: mermaidinthemountains AND cash app: $rainepleasestay", "gabrownie20": "Venmo: gabebrown20", "sikkiiim": "This is SO important. I’m a black woman about to go into college and am struggling financially. My venmo is sikkiim", "shishi.rose\nVerified": "Verified", "adinadee1": "PayPal: adina.welch@zlabels.de", "qualeasha": "👏🏾 a word! Venmo: qwood cashapp : $qualeasha Also please feel free to view my artwork as well and spread to a friend ❤️", "shashashashannon": "Mom of 2 sweet boys living with a piece of shit spouse. Could def use my reparations cashapp: $shashashashannon PayPal: https://www.paypal.me/ShannonJ5 SHOW ME THE MONEY!!!!", "kukachoo42": "cashapp: $JaelinSJones i am a student artist currently the money will go toward buying my adobe suites subscription for the month!", "_lexj_": "Happy Juneteenth! Venmo: Lexi-Jenkins-1 Im an African American history student studying so incredibly thoughtful, informative posts like this one are no longer needed. This needs to be taught in elementary schools to our young children. Grown men and women should not be flabbergasted by the idea of equality", "tinkdafairy__": "$ShasKids", "lovethyself365": "Cashapp / Venmo: lovethyself365", "sugarfootandshugar": "\"Reparations\" should be changed to \"Survivorship benefits.\" Jewish nations receive this regularly.", "indigogomitchell": "Venmo: indigoemitchell", "dominicanslovehaitiansmovement": "Give me the money 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "andsheshere_": "Kelseliv on all the things. Black fat queer femme creative trying to leave a toxic and abusive living situation so I can continue doing liberation work for my people", "river__nelson": "@river_haze", "pandemic_atthe_disco": "Cashapp $pattitattat venmo Pattitattat31", "loveshantiom": "$loveshantiom", "izxgn": "venmo @izxgn ✨", "n.rudolf.r": "👏🏽👏🏽🙌🏽 Venmo @nickraley cashapp $nickraley", "jo_withthe_fro": "Venmo: Educator. Support my financial independence. I@Joelle-Christie Cashapp: $JoelleDupiton", "els_epic": "PayPal: Christina.wynne98@gmail.com Cashapp: $stinabena1998 Venmo: @mels-wynne", "afromayan": "Venmo: Meliq_Kay CashApp: $MeliqAugust", "zele_____": "So do people have to leave life bios in order to seem more reputable?", "claudiaayumi1": "Venmo: @cgivings", "k.yafav": "Cashapp: $kyafav sophomore in college attending Clark Atlanta University Happy Juneteenth!🧚🏾‍♂️🧚🏾‍♂️", "mosesninja": "Mariama_salia Venmo", "abklynmyracle": "$abklynmyracle(cashapp) @myaguirre(Venmo) ✊🏽✊🏽", "authentically__ewe": "Cashapp $rj1053 Venmo rae-jordan", "ancientpotteryshard": "consider donating to a chronically ill self sustaining young woman trying to get through university on her own! Venmo: @thebossbaby cashapp: $americasbaby (it’s true...I’m baby)", "aintyouericjames": "Cashapp: esimmons95 PayPal: ejharrissimmons@noctrl.edu #happyjuneteenth", "fiftyshadesofj_": "Cash app and Venmo: jdmmcneil Queer Afro boricua studying communications, going into my junior year of college. Currently working full time to try and pay for school💛", "deabryel": "Cash app $deabryel 🖤", "sadefola_": "Venmo/cashapp: sadefola www.paypal.me/faadesanya ✨", "billionairevach": "$vachib", "sjames18": "Please consider sending some reparations my way - young black teacher with tons of student loans - please and thank you 💗 Venmo: @Shannon-James-6", "theninjaatelier": "@slimjeff", "nythalia.a": "CashApp: $knamador", "yemaynah": "Getting my masters in teaching and these student loans are WILDtt ❣️❣️❣️ help ya girl out Venmo: @sgneedsmoney", "bradley.way": "This is pathetic. Blacks aren’t the minority anymore duh. White males and female are now and it sickens me that you feel you are oppressed because you sure as hell aren’t.", "neilatheealien": "$neilathealien", "jetziinthesky": "Cash app: $jetzi PayPal.me/jetzi", "samgamfam": "Cash app $sizzyizzy", "kuwilileni": "👏🏿👏🏿💖💖👏🏿👏🏿 cash app: $kuwilileni", "umi_sayssmile": "$kenyawavines", "brujapxssy": "$MadrexX Cuz I have black children", "giveafoxamuffin": "Happy Juneteenth!!! Support your local/internet black witch! Cashapp $foxnfans and Paypal foxandfans. Sending positive vibes and affirmations into this comments section 🙏🏾💚✊🏾 We all getting something special today !", "_crystalwrubel": "Cash app: $drcrystal | Venmo: @crystalwrubel", "pallas.amenah": "I’m a junior in college and an aspiring writer and filmmaker! I’m looking to tell the stories that need to be told in way of ACCURATE representation ✊🏾 Currently struggling to push through financial problems so ya girl can graduate EARLY and my little brother (4 years younger) can attend the college of his dreams 👩🏾‍🎓👨🏾‍🎓 anything is appreciated ~ . . Venmo: @Pallas-Amenah-Morgan", "the.stellanova": "Show producer and dancer trying to make more creative spaces for pocs in nyc! Paypal: stellanovanyc@gmail.com venmo: carmen-mackins", "cherubquartz": "is there any way i can pay reparations without money?", "rebbykern": "Full time yoga teacher out here tryna keep up with bills venmo is @ rebbykern", "thisrawsomeveganlife": "Thank you!!!!🙏", "charles.caesar": "Venmo: @Charles-Caesar Support a gay photog 🖤✨", "cigdeath": "transmasculine first gen college student here! Venmo: @cigdeath ✊🏽", "_hollidayinn_": "Third year pre medical student! cashapp: $hollakrew2 venmo: @Holliday-Crider", "cocktopic": "Venmo : rad_star23 ♥️", "ipulluphopout": "lol who tf is actually going to donate to this insanity", "bri__east__": "Cashapp $brileast (lowercase L) - AA Air Force Veteran, located in expensive ass, gentrified DC, constantly being lowballed and/or looked over for jobs because I’m a visibly identifying black queer. Va sucks at mental health treatment but I can not afford even with my own health insurance. Anything would help, thanks.", "alexandra_okay": "Venmo Alexandra-Bynoe-Kasden. I am a bookseller and single mother and work with schools to promote and encourage literacy and access to books, particularly for our black children.", "pomegranateandaspidertarot": "PayPal aub.shelley27@gmail.com", "community_di": "Cashapp: $dionnenoir", "jessye__": "Hey so this isn’t for me but for two brothers actually! One living in the NYC and just graduated from Pratt with a bachelors in Arts History and 3 minors tryna make it and get a J-O-B in his field. Just got passed over for a job at the Manhattan museum but was offered to train the person they decided to hire with pay for 2 months 🤨 and a brother that’s tryna get his CDL’s and support his babies! Both strong black brothers navigating through white america tryna survive! $BennB just graduated and $Montrell89 is tryna get them CDLs that cost $5100 to obtain he also has a gofundme gf.me/u/tjvfdk ✊🏾❤️", "lahongrais": "I use a countdown app on my phone to keep me up in how long before I can retire with full benefits. Any one who wants to help me achieve that goal early, can cash app me at $Minnie1313. Thank you for your donation(s) in advance. 😂😂", "datcraftygal": "Cashapp : $DatCraftyGal ❤️", "yvesisalive": "This is so important.", "littlebabyjedi01": "IM me if you need help finding a job. Take pride in not asking for handouts y'all!!!", "taknotingsirius": "Paypal.me/Specialk367426 CashApp: $Specialk367426 Venmo: @keisha-Graham-1 birth Doula/ grocery store cashier / mom who needs some ice cream", "oxtailgravy_": "Cashapp: $oxtailgravyy", "letmebrea": "PayPal: letmebrea@gmail.com & Venmo/CashApp: letmebrea 😭🖤✊🏾", "librasolidarity": "Happy Juneteenth!!! Im a Black college study majoring in psychology, I graduate with my BA next semester then I'm off to grad school to get my Ph.D. so I can provide mental health services to those incarcerated! If y'all wanna help a broke girl out; cash app: $imaniispoor, venmo: imaniispoor, PayPal: paypal.me/imanif22 💛💛💛💛💛💛💛", "roseavore": "$rosierose492", "novej.brown": "Cashapp: $jevbrown Venmo:Jevon-brown-5", "roastedscrimps": "cashapp - $jimanib / venmo - jazzima", "astoldbyaudreyy": "cashapp: $oddreyy17 black stay at home mama . fighting to create a network of community healing opportunities. fighting to heal self and ancestors past present and future", "dreyastclair": "CashApp: $MoneyMoneySaint", "neckkaa": "Cash app is $nwanekachinedu I need to pay for school 😭", "mercurysymbol": "venmo @ eden_s", "car0lbaskin": "$lilbabydirt RUN US OUR MONEY", "sweetboispeaks": "Venmo: @clarissacorey-bey, cash app $ccoreybeyy and PayPal is cece915@hotmail.com !", "tyler.je": "Please consider me in your giving this day. I am a struggle college student looking to help my mom pay my tuition. My cashapp is $tylereverj I am majoring in Spanish because I want to become a translator in a hospital to help Spanish speaking people seek medical aid", "jyvonnehaskin": "This message right. here. Wow and excellent, thank youuu!! VENMO @JyvonneH 💕", "thevyouneed": "venmo: @VeeRD CashApp:$VeeDRD", "ashrahmadon": "💕🙌🏽 Venmo: @Ashley-Franklin-37", "rootsheart": "$ThaooAishat35 : cash app, @Aishat-Hasati:Venmo, PayPal.Me/aishathasati : PayPal ✨", "erinnna": "Venmo: Erinnna", "narysce.gayle_": "Cash app £NGayle3", "eboni": "cash app $ebonitapplebum", "al.lexus": "Cashapp: $AllexusCurrie", "a_rtm_s": "happy juneteenth ❤️ $desdakota on venmo and cashapp🌹", "blackpowerdyke": "happy juneteenth y’all!! get that coin! venmo @plantmamma - paypal ebnymart@outlook.com", "camburguesa_": "Happy Juneteenth yall # cashapp :$artsyheau venmo: Bria97", "songaziza": "cashapp: $songaziza", "rashelle.2813": "Cash app $Rachel2813 thank you 💕", "ersule_": "venmo: ers97 🙏🏾", "tashahnicole": "Venmo and Cashapp TashahNicole", "marissalobos": "✊🏽✊🏽✊🏽✊🏽 cashapp: $MarissaLobos venmo: @MarissaLobos", "authenkitticity": "$kittthekatt", "ambitiousjaze": "cash app @ambitiousjaze Venmo: Jazelynn", "dveeks_": "Venmo: @dveeks Cashapp: $dveeks", "maiamacchiato": "Venmo/PayPal/Cashapp: MaiaErvin", "melaninsingss": "$melaninsings", "audrearachelle": "🙌🏻🙌🏻", "adeeroberson": "Thank youuu! Venmo : @adeeroberson 🙏🏾💥✊🏾💕", "thefriendineverwanted": "Struggling post grad here! Creating and working 3 jobs to try and pay off debt. Would appreciate any financial support. Venmo: @niapatterson", "mercurysglow": "paypal.me/mercurysglow 💕💕", "dashthegreatt": "Cashapp: $lowkeydash 💅🏾", "spideygirl91": "PayPal/mystyhearth@gmail.com", "cassmira": "Venmo: @TiaCassmira CashApp: $TiaCMcDonald Graduated from Rutgers this year with a BFA in Acting 🎉 Currently holding down 3 jobs", "iamdeonna": "Happy Juneteenth! Venmo: @iamdeonna PayPal: anderson.deonna@gmail.com", "eatatmomos": "Cashapp:$mwilkins14 Venmo:@eatatmomos PayPal.me/mwilkins14", "guru.kid": "CashApp: $GuruUni Venmo: $STaurus96", "essieshawboudoir": "Venmo: @esther-aboussou Cash app:$essiedolly Paypal: paypal.me/essiedolly", "alltimeisaac": "Happy Juneteenth! My name is Isaac, I have a podcast, @the_table_pod, that is about being black and trying to survive in white ass cities. I do youth advocacy work around foster care and youth homelessness. I also organize to transform structures that young people have to navigate, specifically for black and brown youth with various intersections. Most of that is done outside of my job description Venmo: @alltimeisaac Cash App: $alltimeisaac", "sanyuestelle": "🤗 PayPal 1: sanyu@sanyuestelle.com via \"Friends and Family\" or paypal.me/SanyuEstelle Venmo: @Sanyu-Estelle Square Cash: $Sanyu 🤗", "jeriorliz": "Venmo:jeriorliz Cashapp: lizlizorliz, just your favorite neighborhood travel nurse trying to educate my peers on their medical racial bias. 💕🙃", "nailahfdavis": "I have shirts for sale! Support a black queer artist! Link in my bio, or cashapp ($StudioND)", "t_honey1712": "Venmo: Talisha-Thomas-1", "carmenlobue": "@Carmen-LoBue Venmo I’m an activist and Filmmaker I always need $ for projects, therapy, and travel ✊🏾", "simplykyoko": "I’m a lot of things but what I’m proud of most is that I’m black ! Cash app $kyokoh", "amcsx_pnw": "Amani-Chesimet Venmo bitch 🖤🖤✊🏾", "marrlowe": "venmo: marlowebarrington", "jennaisparadise": "Also support black businesses! @paradiseisearthtv has a wonderful apothecary if handmade face & body care as well as teas!💚✨", "pedestrianpdstrn": "Aspiring black designer here, currently living abroad trying to make a living off of my art one day soon. Preparing to launch my line in a year's time and will need funds to start here since I can't work a conventional job as a non-resident. Would appreciate the financial support! CashApp: tugtuj10. Also please follow!", "soulcial_healing": "CashApp $SweetBeeServices Venmo: @SweetBeeServices", "nikkihillrocks": "Venmo: MeanNormaJean ; and please buy/stream my music. Self- produced and self-released musician helping continue the legacy and education of Black people in Roots and Rock n' Roll music ✊🏾", "thefunksta": "Support my business! @huedshoppe", "youvebeen_hawatud": "CashApp: $HawatuD, Venmo and PayPal: hawatud@gmail.com", "san_francescoo": "@FrancesDean (Venmo) — any and all are appreciated 😏", "nemirabro_": "$nemirabrown", "fullerlyfe": "Just graduated college and trying to get an apartment for my first full-time job! Venmo: @Elise-Fuller-1 Cashapp: $FUNDraiser97", "haroommoe": "Venmo: @tashawna-walthaw PayPal:businessandshopping1007@gmail.com", "jaida.cmmc": "Cash app $JaidaMcIntosh we’re struggling out here, socially and mentally", "awakeningamanda": "I agree that reparations are due! Curious how much you think is enough? Like if the state/government were to do what’s right and pay reparations to every single person, how much do you think would suffice?", "killyrdarlinqs": "venmo: eloixn", "simplydes35": "Cashapp: $GenetteDestiny Venmo: @GenetteD", "tembizzle": "Venmo: @thembaalleyne", "morgansamantha_s": "Venmo: Morgan-Service", "traprincesaa": "$melabellaa", "weather_vein": "Happy Juneteenth!! 💕 Venmo: @ amber_ok", "markelzey": "@markelzey www.markelzey.com ❤️❤️❤️✊🏽✊🏽✊🏽", "sophthesunflower": "@phiabia on venmo babes", "meliatheperson": "Howdy! Please consider dropping your local artist/writer/actress some money this juneteenth! Ya girl has big dreams and is trying to make the ancestors proud! PayPal: meliaelan@gmail.com", "spellsgabrielle": "Venmo:spellsgabrielle. Cashapp:$SpellsGabrielle paypal:gabriellebronx@gmail.com", "ziiomizm": "Venmo:@ZiiOM Cashapp: $Ziiomi preciate it!", "jesslocsjess": "$montezfriend cashapp meeee", "dank_877": "Wtf", "queen_memommy": "⚡️$kweenkeyaa", "yungdebthornberry": "Cashapp: $lilithxlove venmo: coutureconfectionsla", "_neaux": "$kaylinsd", "abundancecult": "Venmo: rosewater333 cashapp: $richblitch paypal: pony3339@gmail.com", "realeyesyou": "Cashapp: $RealEyesYou | PayPal: paypal.me/realeyesyou", "kalopanoramic": "$Kalopanoramic Just graduated with my Undergrad and On my way for my masters!", "dharkmatter": "👏🏽👏🏽👏🏽👏🏽👏🏽", "allanherc": "Hey, this is Allan. You can find me on Venmo: @Allan-Marshall 🖤.", "prince.ofproduce": "Cash app: filltheCUP", "_aliyanda": "say less. —> aliakhc(venmo)", "neonnebulosa": "Venmo -neonnebulosa 💖", "luvsm": "Cashapp: $SaamiyaM 💕thanks in advance.", "lunadoula": "https://www.paypal.me/LunaDoula Thank you! 😘💕", "jessicaoler": "Venmo: Jessica-Oler-3 Cashapp: $JessicaOler", "the_luciferous_shift": "Venmo: luciferousshift-mannee, cashapp: $iamshift", "chlotownbrown": "Happy Juneteenth y’all @chlotownbrown $chlotownbrown", "tosha.snaps": "💕Venmo: toshasnaps", "bahbers": "Venmo & cashapp is fashionboo ❤️", "blacklisted.x": "Venmo: Lindsey-Joy", "serenaajo": "I’m currently singing and performing, trying to make a name for myself. cashapp : $serenajo , Venmo: @Serenajo23", "artistomelas": "Cashapp: $0melas PayPal: selshere.me", "adri_nicoleee": "Cashapp $AdriaunaClay", "kwame_gomez20": "Cash app :$KwameGomez Need art supplies for summer projects and series", "_brycecox": "Venmo: Bryce-Cox-2 Cashapp: $BryceyWicey ✨✊🏽✨", "liyahimaninc": "Cashapp: $sandle22", "winterbreeanne": "Check out my insta for my work student organizer/activist 🖤: Cash app: $WinterMini Venmo: @Winter-Bree PayPal: PayPal.me/WMinisee", "chanlmarshl": "Paypal: Chanlmarshl ... help me pay my rent... always struggling with that shit 😭😭😭😭", "niqxmars": "Venmo @Niq-Muldrow", "oftenoftenoftenoften": "$eliamella3 on cashapp cause I need $30+ until that reparation check hit", "majic.dyke": "🖤✊🏾 Venmo: @majicdyke CashApp: $majicdyke", "djcrystalclear": "Truth", "yamalo17": "Cashapp- $KanoeP Venmo- Kanoe-P PayPal- https://www.paypal.me/KanoeP", "smpsnn": "spot! on! happy juneteenth ✊🏽 venmo: simpsonalexis", "itsjustangel_": "Venmo: @ Angel-Smith-13", "thequeerdoweirdo": "Non-binary neuro-diverse performing artist Lisa-Evans11", "elias.williams": "🙏🏿❤️🙏🏿 Venmo: Coin4EWilliams", "dopameanstudios": "$DopameanBrick", "rochelle_jamila": "Black dancer and healing artist✊🏽 Venmo: rochelle-jamila", "themyielle": "$MyLMyR ☺️", "ashtonabrown": "cashapp: $ashtonbrown52", "byalexishunley": "Freelance photographer that loves capturing the beauty of blackness. PayPal - Alexis.Hunley@gmail.com. Venmo: @alexis-hunley. CashApp: $AlexisHunley", "b.cher_": "Venmo:Brianna-Glover-3", "wavytreat": "Cash app: wavytreat@gmail.com", "yustilka": "💰 👏🏾💰👏🏾💰👏🏾", "tigersneedsinsta": "Venmo @wild-tigers HAPPY JUNETENTH!! Thanx for all that you are and all that you do @ihartericka 💛", "brucephillips15": "Brucephillipsmusic@Gmail.com", "sheabutterbih": "Venmo: @sheabutterbih", "autieshawtie": "I’m training to be a certified peer specialist/supporter & it’s costing me a lot for transportation; I’m jobless currently and my parents don’t support me: venmo/paypal: autieshawtie (cashapp doesn’t work for me!) thank you!", "anaduvergel": "I'm mixed so I guess give me half of what you'd give someone else? Hahah cashapp: $AnaDuvergel venmo: Ana-Duvergel", "baddaydreams": "oop my cashapp is $LanasiaBM and paypal.me/LanasiaM :3", "cryingisfine": "Venmo: @sararivas", "afroliberatedtaste": "Amen. Central Florida Black queer femme activist right here- cloudswithreign on cashapp and Venmo 💰", "la_rosa_es_mi_vida_": "Desde Chile 💪💪💪💪💝👏💝 lo", "darlingjanex": "Happy Juneteenth BEAUTIFUL BLACK PEOPLE! 🖤 please follow my merchandise Instagram page @dope_producex ! I will be revamping and relaunching it very soon. I’ve created merchandise for the expression of others through which I am able to heal myself. My cash app is DarlingJane and Venmo is Janel-Marie. Anything given can help me access very necessary mental health services.", "brialleringer": "Help me bring plant based nutrition to black communities! Venmo @brialle-ringer", "the_dollyrose": "Venmo: @Victoria-Carter CashApp: $VictoriaCarter", "tanajuuh": "Recent college grad! Appreciate the love! $tanajamd for cashapp and Venmo", "ak__the_great_": "Trans queer crip here: Venmo @ AK_The_Great Cash App: $TheGreatAK PayPal: https://www.paypal.me/akthegreat Anything would help! -🌻", "crystodoroff": "Cash app: $crystodoroff", "wishcandy": "Chronically ill artist need to survive a new autoimmune disease diagnosis process ✨ Cashapp: $wishcandy Venmo: @wishcandy PayPal: wishcandyyy@gmail.com 💗💕✨", "thereal_shafiq": "$ShafiqHicks Venmo:Shafiq-Hicks", "shesprovocative": "Venmo, @Markeya-Thomas-1", "garifunigga": "Im Stevie, a young revolutionary on their way to fucking shit up. I educate on the daily, handing out free emotional labor for anyone in need of a quick lesson, an aspiring anthropologist. My cashapp is $uncreativejunk .", "jeanthehueman": "$JeantheHueman ✊🏿", "artxwpn": "Happy Juneteenth! ✊🏿 I'm a black 3d artist & graphic/web designer. Portfolio in bio or here http://artxwpn.com Cashapp: $kris1017 Paypal: PayPal.me/krisyoungboss", "thecurliehippie": "Im the owner and founder of @_beautifuel @fuelgoods & @renaissancebxtches 🙌 all focused around the wellness of our community! Any support is welcome, especially a follow 💖 venmo: @fuelgoodmke cash app: $fuelgood PayPal: wombwellnessmke@gmail.com", "w4t3r2earf": "👏🏾 $brwnskngyal 👏🏾", "girlryann": "Cash app $ryanndalion", "ambramaya": "out here helping pay for dads cancer treatment and paying rent that’s too fucking high!!!!! venmo: ambramaya cash app: $abongra", "romil.yadav": "Cashapp: $Romilyadav", "satanik_panik": "$SummerAzim", "priestlytemple": "CA - $PriestlyPays Venmo - @PriestlyTemple Or if you feel better purchasing a body of work, I have a book of poetry! Link in my bio 💜", "phillipafenty": "psychotherapist specializing in childhood decelopement and trauma; particularly in communities of color. venmo: phillipa-spencer", "gotyouhooked": "Venmo: melgotmoney. cashapp: meljnlou", "bonesandtulips": "Venmo: @ kaylamwilson", "writtenbykula": "Venmo: Rachel-Godfrey-3, cashapp: $rkg314", "autotheoryqueen": "Thanks @ihartericka ! Venmo: @Che-Gossett", "blk.theo.logy": "$mikamathurin PayPal mikamathurin120@gmail", "adrirosembert": "It’s Juneteenth AND my 30th birthday, so I’m extra feeling black today lol. Venmo: @Adri-Rosembert", "queenxamadala": "Working hard in a college system built for me to fail. Anything helps! Cashapp: $Mariedm511 Venmo: danimarie7", "shotbysage_": "Black queer trans non-binary educator ❤️ Cash App : Aidan921 Venmo: AidanAW", "kaleb_maleb": "Cash App: $kalebmaleb", "coloredbeautifully": "Cashapp - $Akilah019", "theartalbum": "Happy Juneteenth! Cashapp: $TheArtAlbum", "seradinveonne": "Cashapp: $SeradinVeonne PayPal: sveonne@gmail.com Venmo:@SeradinVeonne", "arixalli": "Broke college student currently struggling to find a car so I can get a job! Paypal: aallison1999@hotmail.com", "strangeflower_": "cashapp $chantellate 🙌🏾", "cocoa_nibs": "Venmo: @tiannamills", "whenchoclatemelts": "Venmo @ Chinisie", "laurenkellybenson": "Venmo- @LaurenKellyBenson PayPal Laurenkbenson@gmail.com cash app $LaurenBenson- my mama’s white and my daddy’s black so I already get some reparations in the form of my light skinned privilege. Give me half what you would more melanated folx.", "katielovescas": "I'm not sure if my comment went through but Venmo is Katherine.Pruett 😂🙌🏽🙌🏽🙌🏽", "velvetwavez": "Venmo: @ craneco | cashapp: $vlvtwvz | paypal: nyalaallen @ Hotmail | Just a Black enby babe running a commune for marginalized folx, working full time, while also running my own cannabis business. All donations will be used for the commune as we're making lots of repairs ❤️", "niyahmiche": "Cash app is $NiyahMusic Venmo is @NiyahMusic PayPal is niyahmichelleprod@gmail.com ✨✨✨✨✨💵💵💵", "savdemi": "Venmo: Savannah-Demissie 🥰", "misskillemrox": "Happy juneteenth", "naadiraaaa": "Cashapp: $Brianna McAdoo Venmo: @Brianna-McAdoo https://www.paypal.me/BriannaMcAdoo", "arymarv": "Venmo: Ary-Marvray", "jahhajjah": "VenMo @Janel-Holt Happy Juneteenth!✊🏾✊🏾✊🏾", "yesaurielle": "Essayist, poet, and forever sick of white people’s lack of contributions to our work and struggle. Venmo: aurielle Marie cashapp: $elleboogi", "recoveryfortheradical_": "Venmo: mrobinson987 !!! 🖤", "androgenesiss": "$androgenesiss", "femmmeadjacent": "Venmo: Kai-Kahlila✊🏽", "dashaundeniable": "My CashApp and Venmo are @dashaundeniable 💗✊🏾", "mirschxo": "Cashapp and venmo:mirschxo", "cianathealien": "paypal: cianaabooth@gmail.com i am currently a college student hoping to invest in and renovate a van to live in throughout my last 3 years of college to save money by not paying bills and not having a housing fee for living out of state. i've also been learning how to crochet clothes to sell on my depop account and make money, which i will put in my bio when i'm done", "whoisbriellewebb": "Hello, my name is Brielle and I’m going into my third year of college as an acting BFA major❤️ My Venmo is @Brielle-belle", "songofniemah": "Cashapp $Ninihe or www.paypal.me/songofniemah", "mrsdhennin": "This is wonderfully made. Thank you @ihartericka for sharing powerful and necessary information to the masses.", "ms.lezama": "$ElleLezama. I’m an environmentalist & I’m tackling environmental racism in my city through various clean ups I’m organizing my first beach clean up chose far rockaway beach Because when conducting my research on environmental racism I realized the disparity between the white section and black section of far rockaway beach and how the city doesn’t even have enough lifeguards much less clean the black side.", "soverychanberry": "Third year clinical psychology doctoral student trying to make it. Thanks for your support! Venmo: C-Zollie", "nadiathefairy": "venmo nadiarenee cashapp nadiathefairy!!! im homeless and could really use some money 🌿✨💕🍃🌻", "witchdoctorpoet": "Cash app $BolaJuju / PayPal.me/witchdoctorpoet", "drcrystaljones": "Cashapp + Venmo drcrystaljones", "jilla_821": "🖤", "forever29.jpg": "Hardly working or eating while recovering from assault, could use some help this Juneteenth! PayPal.me/AssiyahToure", "doubletapp_mydimple": "Cash app is $VSUDimples, currently raising money to afford my last semester of college for my bachelors degree.", "nadya426": "Fellow white people - I recommend looking up the median income or wealth for white people in your city, figuring out what your percentile is, and comparing that to a black person/family in the same percentile. The difference between those two numbers is one way to look at our privilege, what we are paid by white supremacy. I live in Oakland, CA and my family is a little below the median and that means our income is THREE TIMES higher than the same black family in my city. Something to think about when we try to figure out how much we can \"afford\" to pay.", "writeshello": "Due to an emergency operation for my cat Miles and a lack of money, I am close to being evicted. Any help and /or prayer is greatly appreciated. Venmo: @chrissiemie123", "apricotfleur": "$jmiller96", "blaquegoldd_": "Cashapp: $Lakeey Paypal: Lsteward29@gmail.com", "__shambam": "Venmo: shambam_ Cashapp: $shamirejuste", "snazzafrass": "happy juneteeth!! cashapp me so i can get out of my apartment today $snazzafrass", "trashpandalives": "Happy Juneteenth! I’m literally a starving artist looking to make it in a new city. About to start my fourth Americorps year, dedicated to serving my community while working on my art! Cashapp: $alimashaw522 Venmo: @alima-shaw PayPal: alimashaw@gmail.com", "crystal.kimber": "Hey y’all!!💙 Cashapp: $CrystalJoseph1 Venmo: Crystal-Joseph-11", "eyedbyjoe": "CashApp : JozifIv", "unbothered.tbh": "Fellow black creative new to these LA streets. Cashtag $dlevante 💜💜✨💪🏾", "ashleydavis_art": "Venmo: ashleydavis_art Ca$happ: $ashleydavisart  my therapy appt this week will cost me $30. and is $30 every week after for mental health. I’d love to see a BodyWorker this month for physical health, they’re $60 for a session , would love to pay for my grandmother and great grandmother to get pedicures to get their feet rubbed for elder love , that’s $60, June 19th is when $173 gets removed from my acct to go towards debt that’s in collections—that bill would support for surely financial health, ..... many categories to support here if you want to get specific. healing is multifaceted, let’s get into it. 🙏🏾 I’m always grateful", "chicntender": "Venmo: beef-rift", "aaaaancora_imparooooo": "First of all, all of this!!", "joanieayoadeyoon": "Venmo: @joanie-Ayoade-Yoon", "shezdreaming": "Venmo: bethmg ☺️💓", "preciouslyrotting": "Venmo: @ Ava-Bridges-1", "thechocolatesensation": "Cashapp: $thedundada | venMo: Brianna-smith-3", "the_childlike_empress": "Venmo: champagne-mami-69 Paypal: cosmosisproductions@gmail.com CashApp: $greenkitchenwench", "nicenice11": "$nicenice11 Venmo: Maya-Henry-1", "carolinestrange": "Venmo: @carolinestrange Ca$h App: $CarolineStrange", "kelikinet": "Happy Juneteenth!!! Fund me as I fight for Working class folks in New Orleans particularly Black Working class folks!!! Check out New Orleans Peoples Assembly and Take Em Down NOLA!!! CASHAPP: $kelikinet", "grand.mere": "Venmo @Candise-Ervin Cashapp $ECandise 🤘🏽", "pricejennif3r": "Happy Juneteenth! Cashapp $pricejennifer", "brookeblaize": "Artist/homeless advocate/hairstylist $badbrookie Paypal.me/blaizinghair", "sageswaby": "cashapp: $ageSwaby venmo: Sage-Swaby paypal: paypal.me/sageswaby", "nellie_jellies": "Hi y’all. I’m a struggling college student, drop me something Cash app: $NoelleWade Venmo: NellyWade", "berry.ijeoma": "$berryoptimistic", "kitschycurls": "Venmo: DeeLMT CashApp: $WorshipMeRight", "v_marie36": "Venmo: @vmarie36 Cash app: $vmarie36 PayPal: PayPal.me/vmarie36", "kaiboogies": "$khartsfi on all giving platforms!! 🤪", "allieblablah": "Venmo: @allieblablah CashApp: $AllisonLane", "fightclubis4manchildren2k20": "$bortsfund", "gigilee82": "Happy Juneteenth Cash app $ GIGI3682 I'm a catering but I also give away free meals to single mothers and low income families. I never want to see my people hungry or struggling.", "jessi.liza": "Okaay now! Just recebtly cure of HEP C. Could definitely appreciate the coin! CashApp $JETPositivity Venmo @Jessento", "isawhitaker": "If they're not trying to give us reparations then we shouldn't have to pay taxes.", "jeszack": "@jeszack-og Venmo! 🙏🏾🙏🏾🙏🏾🙏🏾", "jamillah.j": "Venmo: @Jamillah-Jackson Just trying to survive. Car is breaking down and it's how I make income.", "interruptinggirljoke": "paypal: shelovesbooks@prettykekreations", "pettyagainstpatriarchy": "$monskies on the cash app This is the realest shit I’ve read all day!!", "frankieupspace": "@frankieupspace $frankieupspace ty 🙌🏾", "haxxell_": "cashapp: $deauxxi Black young creative independently working on a mental health app for poc struggling in the city", "revolutionary_mystic": "Happy Juneteenth y’all! 💜👏🏽 my Venmo is: meganalexandria  Thank you 🙏🏽", "lightsnax": "Tiffrlewis@gmail.com paypal 👐🏽", "katarinav3": "Venmo: @katarinav3 🙏🏽", "willa.fortune": "@whoshotsamo", "spndyl": "scraping until i’m able to receive an awarded stipend for an internship that’s usually unpaid. venmo — @ KendylBoyd", "itskeilavon": "Ca$H App $KeiB // Venmo: Keiera Bradley //", "pretty_reluctant_hero_": "What", "morgan.bp": "Screenwriter/photog/visual creative tryna keep my head above water with living expenses and grad school expenses hit me on Venmo (MorganPowell) or CashApp ($MorganEll) to support ✨", "bgorissa": "PayPal: marissabissa143@gmail.com", "blakkcupcake": "Venmo: Nay-Bever, cashapp- $reneebever", "mugabs": "I’m a three time stroke survivor. Disabled, Black, Queer and Polygender. Dependent on my supportive family and friends for survival and eternally grateful. Writer who’s about to embark on the last leg of my book tour that’s taken me to 42 cities thus far. Venmo - @Mugabi ; CashApp - $Mugabi1992 ; PayPal - mugabibyenkya@gmail.com", "oliverjjune": "$O8liver Venmo: Oliver-Owens 💚Happy Juneteenth y’all!", "mad_dope_black_woman": "$everydaypoetry", "rounsovillet": "👏🏾👏🏾✊🏾 Venmo: @Tia-Lynn96 || CashApp: $TiaaLynn || Support a 23 year old Black Queer single momma! Raising my 8year old to be authentically herself is liberation! Im trying to relocate to Washington and get connected to the QTIPOC community there 💖", "thebrownbunch5": "\"Y'all made a pink pussy disgusting hat! Make a reparations hat!!\" Where is the lie??? 😫😅😂 This right here is everything!! ✊ Definitely not ever doing enough; but definitely making a donation today. And will be sharing this. Thank you! 👏", "dominiquematti": "$delamom & paypal.me/dominiquematti", "youngadina": "$moneymakingmari 🙏🏾", "krystalcmack": "Cash App: $KrystalCMack", "zionls_01": "Lmao", "valgogh_": "Venmo: Valentina_21", "gracie.annne": "Venmo: Grace-Dunbar-1", "niaskindaneat": "Venmo: @ niadpg", "breeawntah.jpg": "$breeawntah @breeawntah", "magickplant": "my venmo is @magickplant. i could use some food and transportation $$$, and almost my bday 🌷🕊💕", "themorgyouknow_": "Preeeeach cashapp/Venmo: morball_", "it_be_denise": "$PieYump - Cashapp. @DJStar73 Venmo. ✊🏾✊🏾✊🏾", "iamtipjones": "Cashapp @OwnHers 💪🏼", "brandy.bug": "paypal: paypal.me/vaultbitch // cash app: $vaultbitch // hi, my name is Brandy, and I am a black queer autistic girl with other mental illnesses. I am unable to work because of my mental health, and I take lots of meds. I am struggling just paying for my basic needs. I would appreciate if anyone could donate, any amount would help me so much. thanks everyone and Happy Juneteenth!! 💕", "j.asminemonique": "Cashapp: $jmonique504", "gordiahayes": "CashApp:$gordiahayes Venmo:@gordia-hayes", "pjbonga.17": "Hey everyone! I’m currently a first generation college students and really just trying to do anything to help my parents pay for tuition. 💙 Cashapp/Venmo: $pbonga17/pbonga17 thank you! 💜", "themotherofmoons": "2nd grade teacher..Y’all know we already don’t make a lot as is : $themotherofmoons", "blackiechan98": "Its a bad idea to have a large lgbt rally without police protection. That'll open the ability for terrorism.", "malaysiamae": "Venmo + cash app: malaysiamae", "_sabria._": "I'm about to begin my first year of college and definitely have a long way to go as far as finances are concerned to make it to where I need to be. Invest in me so I can continue to invest in my education and therefore my community. Thanks in advance! Cashapp: $Bria1009", "okthen________": "Ink The Diaspora is a platform that was created by me, to offer a safe space for brown and dark skin people who struggle to find representation for tattoos. Giving priority to documenting tattoos on Black and Indigenous queer womxn, trans, non-binary, and gender nonconforming people. Venmo: @inkthediaspora ( I also have Cashapp and PayPal )", "thed_miller": "paypal.me/princesspea23", "shamdunk": "Straight facts, just a college student in NYC. Venmo- hibijam PayPal- https://www.paypal.me/shamdunk", "hypegyal_": "Pay Up. I’m hella BLACK and hella PROUD - PayPal: veesoleprojets@gmail.com. Send those funds 😌‼️", "feministandfluid": "Black mental health activist. I’m trying to start a podcast to provide tips and tools I’ve gained in my mental health journey - it’s a long a** marathon. Currently trying to raise enough to buy equipment for the podcast and access to streaming platforms. Any amount would be f**king amazing since I’m launching JULY 4th. Set a date, and make it happen right? Thank you in advance!", "whit.capri": "👏🏾👏🏾Happy Juneteenth! ✊🏾 Cashapp: $WhitLo94 paypal.me/WLon709", "bcarrie_": "Cash app: $bcarrie, need art supplies and money for illustrator", "morgan.simone11": "Cashapp- $MorganB112, venmo Morgan-Bb", "alexanora26": "Cash app: $AshSheAsh", "m.addi": "cashapp: $maddifrankg venmo: Madison-Green-51💫", "minahstcyr": "Happy Juneteenth from a black bi Haitian womxn :) CASH APP: $RadjaminahStCyr Venmo: Radjaminah-St-Cyr", "kayismagical": "$kayisnotmagical", "supremiacy": "Happy Juneteenth everyone!!! Cash app: $SupremiaBostick", "hellanoire": "Cashapp:$HellaNoire Or Hit The Link In My Bio To Help Support My Journey Of Becoming A Doula ✨❤️", "tiana_ross91": "Happy Juneteenth! paypal.me/MelaninQueen91", "papapete32": "You’re soooo right! I apologize for all my wrongdoings. Here’s my money: 🖕🏼", "flomotionforme": "Venmo: krystal flowers @Krystal-Flowers-3 ✊🏿✊🏾✊🏽", "thebryreed": "Do the right thing and give $$ to a Black woman educator who has given too much FREE emotional labor and equity education to people all my life. I’m tired and broke broke. Cashapp: $BryR Venmo: BryReed", "jmackent": "venmo: jmackent cashapp: jmackent", "a.vuitton": "🙌🏾🙌🏾 cashapp: $Avuitton", "myshelltabu": "Terminally ill mother of two. CashApp: $myshelltabu Venmo: @myshelltabu", "mya_rayyy": "Hey yall I'm Mya, I'm a nursing assistant and going to school to become a physician assistant. I eventually want to become a medical missionary!!! Feel free to drop some my way 💖 venmo: @Mya-Ray77", "inkthediaspora": "Ink The Diaspora is a platform that was created by Tann Parker, to offer a safe space for brown and dark skin people who struggle to find representation for tattoos. Giving priority to documenting tattoos on Black and Indigenous queer womxn, trans, non-binary, and gender nonconforming people. Venmo: @inkthediaspora ( I also have Cashapp and PayPal )", "miss_lenci": "Happy Juneteenth!! Cash app $Finemisses PayPal: befiercebeauty@gmail.com"}