{"linnics": "@aszichild", "sarahspncr": "@lukewintour", "therealwritingflower": "What is non binary?", "sileikis_": "What does it mean for a kid to “identify” as the opposite sex?", "theannoyingbritishgirl": "Aren't most people cis gender though?? My thoughts with raising a child is to just let them like what they like and do what they want without worrying about them being nb or trans", "pelletierluke14": "Lmfao so confuse an already confused human even more? Smart. Leave the kid be and teach them mutual love/hate for all and they’ll grow up just fine.", "jah_model": "Deep", "ashertruepeterson": "This. Brought tears to my eyes. Thank you.", "makesyouffamous": "this can’t be fucking serious", "megtastik": "Do yourself a favor and follow @ihartericka @melissazzig ❤️❤️❤️", "olympia.bal": "@elsakb 💕", "geezohpeten": "How do I talk to my young children (4 and 6) about gender? They are in that stage of everything is black and white. They will ask if a person is a girl or boy. I want to educate them early on about all of this but do find myself struggling with what to say when they are not yet to understanding that a person doesn’t have an assigned gender just bc they have a penis or vagina. Are there any books you recommend that I could read to my children to help them better understand?", "glitteredpony": "This is so beautiful. I’m literally crying right no. Thank you. ❤️❤️❤️", "viola.greenwellness": "This is really beautiful, thank you for sharing ♥️", "ribcagehwy": "if you have a vagina you’re a female. a penis, a male. that’s that", "itsaqween__": "Wouldn’t my child be confused as too why I chose non binary? I understand society portrays vaginas to females and penises to males but then my child would question herself and I wouldn’t want her to be confused as to why other people don’t deal with this situation. I’m asking for future reference because I plan I’m having another child, I just would like to think of the pros and cons when it comes to the questions they would ask in the future", "don_frankieperez": "@_zarinah_tahir 💜✊", "lizzierae": "@jc305", "_wxslxy": "@gibaayub", "wickedguardie": "@jangorik I love you, believe you, and support you, and will fight for you no matter what.", "itsdreydio": "Bad parenting 101", "katie_parker18": "@captain.viola", "quartermorning": "I noticed your pronouns are she/they—could you tell us more about how we should use them in practice? Just completely interchangeably (she sometimes, they sometimes) or is there one your prefer over the other, or a particular situation where you’d prefer one over the other?", "willemstwan": "Lol you people are so messed up, it’s hilarious", "edrzw": "Everyday we stray further away from God and LOGIC. I’m sorry Little Billy you were born with a penis but ur not a boy, ur a Unicorn 🤣🤣🤣 🤣🤣🤣 🦄 GTFOHHHHHHHHHH!!!!!", "activateyourenergy": "🤔🤔🤔", "derekhenderson23": "Wait is this serious?", "thrifterslegs": "The person who wrote this is lumping sex and gender together and it's giving me a headache. You were giving a biological sex at birth, gender identity is usually relative to that, but your gender identity can be completely different than your sex.", "bethanybash_art": "@j.a.love00", "rohitvallikat23": "You can’t be this fucking stupid can you?", "fvckthistension": "i’m looking through the comment section and god, does no one else think this is wrong..?", "roxette_m": "@leeang_selahle ❤️❤️", "lgbt.gaydiators": "It would mean so much if y’all checked out our page! We are a safe space for all and you can feel free to dm us at any time! Have a nice day 💛💛", "shauny_jaworski": "🙄🙄🙄🙄🙄 This is stupid, you're not assigning shit, they're born that way. If they feel they were born wrong later on it life so be it, but no one is assigning anyone shit. This is part of what's wrong with tbe world.", "briannacuesta": "Do you think it's okay to assign a gender at birth until they are able to tell you, or do you think we should all use they/them from the beginning? @ihartericka", "smarvelous.wanderful": "Ive always felt like my gender lives in an in-between place, nonbinary and cis, femme and woman. I know how it feels and I’m at home with that, but it gets difficult when trying to explain to or being read by other people. How I assert my identity and help others see me while also checking myself and holding space for my trans and nonbinary siblings?", "cynnamynbun": "I honestly wish my mom would say this too me. I'm thirteen and non-binary and she says that being non-binary is the equivalent of being an inanimate object.", "phackyolove": "I have a question to all the people saying they are going to raise their children as gender neutral. If they are born as girls or boys and that's what they identify as will you correct them to say that's not what they are? If so wouldn't that be the opposite of what you're trying to prevent? This is just my opinion and I'm honestly not being rude but I believe we are given male and female as a gender to identify to whom we are able to mate with to reproduce. Being gender neutral doesn't really change the overall purpose does it.", "unclenocturnal": "This... is cool to see. As a NB person i start to feel like nobody believes that its real or will understand it. Especially when people always made it out to seem like its an inconvenience to learn how to refer to a person as they/them. So its just really nice to see that there are people out there that accept it and embrace it. Especially to their children 🙌👏", "_studio110": "Came across the page and it's interesting. I'm a parent of a child. He is 4. And I often think, what will i say and how will I react if he wants to be another gender. In my immediate flesh and everyday life world, there is no one around that is anything but cis. If this is a safe space to express my self, I would like to say, I honestly don't want to deal with it. I don't know how. It doesn't seem so cut and dry, or common sense to me. But I also know if my child feels confused about his identity, I would want him to be comfortable being themselves. Sometimes it just seems like word games and indoctrination of some sort. I dunno I hate to be thought of as ignorant. But I thought I'd chime in, with my thoughts.", "evancrosss": "Male, female, or mental illness. Stop reenforcing your child for having identity problems. Don’t force it on them either, let them figure it out", "jasonconcilio_": "YOUR KID ISNT ASSIGNED A FUCKING GENDER U DIPSHIT LMAOAOAO ITS BORN LIKE THAT 😭😭 im gay but i litterally hate the lgbtq community because all of you are like this post", "88mike76": "Every human is born with either male or female dna 🧬. That doesn’t mean you have to act or dress a certain way if you don’t want to, but no amount of want or surgery will ever change that dna 🧬. It’s science. No matter how bad I want to be #BruceLee, I’ll never be Asian. Wanting to #BeLikeMike will never make me black. I can dress or talk any way I want, I can use makeup or have surgery, but I can’t change the science of what I am... #changemymind", "misadvetnures": "coming from a trans man this is transphobic lol stop expecting your children to be trans", "ratthewgilreath": "Ok honestly this is so stupid.", "aowom": "It’s a spectrum 🌈", "reddpirate64": "There are only two genders.", "hermionehepburn": "This is helpful as a newish parent. I have been looking for the words for this thank you.", "ingleberry": "I love this. So necessary 🖤", "everydaywechoose": "Deeply appreciate this post and the ability to learn from you -as a person and a parent. Thank you.", "audrey.fuette": "I’ve always wondered what to do/say for situations like this with young kids. Thank you.", "itschuckmcgee": "@mer.mae.d ❤️❤️❤️❤️❤️❤️", "zuttkultur": "This 😭👏🏼", "st.anger222": "There's only 2 genders", "mah.ja.been": "This fully making me tear the fuck up", "pwilliams.62": "A gender isn’t how you feel lol", "oliverosewood": "❤️🙈", "somewhere_under_the_rainbow": "Gonna reshare this immmediatelyyyyyyy. I feel like also sharing this w folks who assign/assume sexuality at birth. Both are just such effed up projections.", "mrforbis": "I identify as a nonbinary local rapper", "fkndubbin": "Kids never hear that because it’s fucking stupid.", "ladyyaya54": "❤️", "phil.hill.photos": "Still don't think we would impose gender on kids at all, but defo a step in the right direction 👏", "c_laplant": "this is ridiculous.", "lucidarcana": "I dont see a problem with assigning your kid a gender 🤷🏻‍♀️ Especially when sex could be important for medical reasons", "plantpowered_25": "Saw this on @4thtribodies and since the comments are turned off there, I'll say this here. Realest thing I've read all day! Bar none.", "ts.eravictoria": "thank you for this!!!", "soleil.eph": "@naryhither", "jemontoast": "@shaniya_hope this is parenting done right!", "_lotro_": "I love this so much.", "bethencrisdale": "This is the greatest. My 4 year old and I have nightly chats as she goes to sleep and a couple of nights ago this came up. She asked if all girls have vaginas and all boys have penises. I said that a vagina doesn't make a girl, and a penis doesn't make a boy - we are just what we feel and only we know how we feel in our own body. She seemed happy with that before she went to sleep but it's an ongoing conversation that changes as they grow. Undoing CONSTANT gendered messages from outside sources is hard work. She's brought up on 'all colours are for everyone, all clothes are for everyone, makeup is for anyone to express themselves' etc - but it took just one random adult in a store once telling their son pink is for girls loudly to undo so much. The fight against the indoctrination of children to a gender binary and everything goes with it is SO fucking hard and something I never expected would be such an exasperating challenge before becoming a parent.", "femmefresh": "@bigbootiejewdy", "queeringqueering": "😭 it would have changed my entire life to have received that message", "nuncia_maria": "I love this language. This is definitely how I feel, but sometimes my kids will ask questions, and I get stumped on how to answer. These words are great! Love it.", "k6mil": "I look forward to bringing a child in this world", "alex3andra": "I also don’t think people should be shamed for gender assigning. It’s a pretty normal practice and there’s nothing wrong with differentiating the two. I personally do not wish to live in an exclusively androgynous world. Men and women are different and it’s okay. I would never ever shame or be annoyed with my child for feeling she is in the wrong gender if she ever ends up feeling that way. Also unless you have a child I don’t know if you can put yourself in a parents shoes. Just my thoughts on the matter.", "kayelehkay": "Thank-you for this. My 3 yo asks questions about this all the time and while I have been thoughtful about responding in this vein, this language is very helpful! ✌🏼", "anastasiashepherd": "@jeremy.s00 I know Roberto will get that talk ❤️", "imogen.parry": "@estherruss 💛", "mrs_hilll": "I loooooove this. As I am unlearning a whole lot and working toward being an safe and accepting parent, I struggle with confidently explaining this concept to my own parents (or others who can’t fathom gender fluidity/spectrum). I’m someone who leans on data in most areas of my life and so I wonder if anyone has resources or articles or psychologists they look to for their own educations and sharing with others.", "healthyasfock": "@ahhal3xis ❤️", "chxpxrrxl": "Me and my partner live with their two younger siblings (two and five) who knew me when I was out as a trans man, now I'm out as a non-binary butch lesbian and my partner refers to me as their gf and we've had a lot of instances to help shift the gender narrative so it's binary divergent. The lil ones seem pretty perceptive, it's just hard battling with media representation", "yaaahtzeee": "Thank you so much for this. My baby is a year old and I try not to refer to my baby with any pronouns but often it still comes out. We did assign baby a gender... cuz you know how it is at the hospital... and this post really helps me address this topic without feeling guilty about assigning a gender solely on genitalia.", "happyteenageboi": "Kids SHOULD ALWAYS be male or female at birth. I was born male, and still am. If I didn't feel right in my skin then I would have spoken up about it. But we don't need everyone to be non-binary. Plenty of people are happy to be male or female. If they discover that they aren't, then yes, they have a safe and open environment to discover who they are, in multiple ways.", "amethystxocean": "@doedeere to follow up on your previous post about Lorelei and her presumed sexual orientation.", "wearerasa": "Screenshotted to say this with this much eloquence to my 4 year old.", "baronessvondemian": "Why not just refer to children by sex and encourage children of all sexes to express themselves however they see fit? I fail to see how this does anything but reinforce gender stereotypes- femininity means girl and masculinity means boy?", "squishirus": "Every person needs to hear this at a young age. The world would be so much more simple if we weren't put in boxes", "alexandra_barr": "This is probably a dumb question but is being trans and non binary the same thing? Or can you be one without the other or both at the same time?", "navarruh": "Wow I straight up thought this was like a message from you to us but it's not. It's deep. I felt that.", "jodiemwood": "OMG thank you! This is a wonderful script suggestion ❤️❤️", "1.900.mandita": "@sexpositive_families 💞💞💞", "katiebethkerr": "We met and spoke with a person of ambiguous gender at the store today. Based on nametag, I think my 4 year old misgendered them as we walked away. Do you have some", "findamyp": "❤️❤️❤️ love this", "kaykotamaki": "👏🏽", "conchitarosita": "The perfect conversation. ❤️ Kids get it.", "meiikaa": "@chloe_al02 ugh", "you.never.saw.me.here": "Thank you for this!", "sankofamind": "I said this, and my daughter was still terrified of telling me. My kids know I’m queer but my youngest still cried when she told me she was bi. The fear comes from society as well as the family. Sometimes there’s no fix or prefix.", "aubreynrhodes": "This is wonderful", "cheryl_sameit": "Just saw a “gender reveal” at an airshow, the smoke was pink and thanks to posts like this one all I thought was CONGRATS your baby has a VULVA!! 😊❤️😊❤️", "explodingkaite": "Thank you!!!!!!", "5.7viramontes": "Lmfaooooooooo", "opshopsofadelaide": "My son used to say that he wants to grow up to be a mummy one day. We used to say \"of course you can honey, if that's how you feel. You'd be a great mummy\". We don't speak as explicitly as above, but we talk about how things don't have a gender (colours, for example), and challenge any stereotypes about what a boy or girl should beWe do refer to them as a boy and a girl, but just as often refer to them as humans. I think this lays the groundwork for more frank discussions when they're older, as well as allowing free expression and discussion of emotions. If you start early, then the conversation should flow more easily. Little things like talking about Pride, exposing kids to non-binary conforming content (like @flawlesskevin ), discussing human rights in a logical kid way. Take every opportunity as parents to teach your kids mini lessons so that they can build a bigger picture, and hopefully feel empowered to be who they truly are.", "_moynin_": "I met a non binary parent once who had a little kid about 2-3 years old and they told me that her current pronouns were like baby teeth pronouns and they'd fall out and just be replaced with time, same or different", "womb.one": "@thenakto ♡", "2famacdonald": "I adore this ❤️❤️ I am saving this for conversations to ensure my child feels supported", "small.pretentious.vegan": "I'm an afab person who goes by any pronouns and thinks gender is just some wacky harmful construct that limits people. I'm pregnant with my first child and want to raise them without gender and homeschool them but I'm concerned about how I'll be able to protect them from all the bad stuff in the world (sexism, transphobia, racism, etc.) while also preparing them for it. And just in general how to surround them with people who share my ideals as I'm a bit of a nontrusting solitary person. The whole situation is going to be tough to figure out financially but if anyone had experience with this type of parenting I'd love some advice", "gravemorgan": "@irismarble", "saraaeliizabeth": "Love this ! So simply well put", "dra.johannam": "Phenomenal, this should be in plaques in all hospital birthing wings.", "shopmclc": "🙌🏽🙌🏽🙌🏽", "tillieandhenrymomma": "Thank you for this, my daughter is 3 and just starting to ask about gender, asking who is a boy and girl, who has a penis or a vagina. I have been stumbling through how to talk in an open and flexible way. On my to do list is to find a good children's book to help, but this post is such a great starting point! PS ~ if anyone out there has a great children's book please share, if I find one soon I will come back and post it here for others!", "draaaza": "fuck idk where the fuck my life would be if this was said to me in my childhood by a parent", "fasteddie118": "So good to hear", "monimimimomo": "This is so perfect in so many ways! I wish this was socially accepted instead of enforcing binaries on them", "tallahasseeblues": "This is beautiful & brilliant parenting ❤️❤️", "art_as_medicine": "❤️❤️❤️", "stephjreed": "❤️❤️❤️❤️❤️", "melissau\nVerified": "Verified", "carolinearnis": "@emma.coons reminds me of what we were talking about in your kitchen the other day", "whatsallthebubhub": "am going to my room to cry now.", "p_hironimus": "@hironimusjohn ✊🏽", "rainbowtrout2020": "@almhimi33", "laurenelanobrien": "@blancoperro I love this", "w_outanyeffort": "@bee_simple @whats_in_a_james more to consider!", "vinfinity_": "Do you think public restrooms should be organized by gender identity or sex organs?", "ecpurswani": "@sandramprager", "freeleighamarie": "SO appreciated- thank you.", "ingridmillerr": "Does anyone have thoughts on names being perceived as gendered? How do parents navigate naming?", "absnoble": "Thank you!❤️ Working on gender neutral names for an imminent new addition to our family and wondering how else to create transparent space and freedom for the kid’s self discovery and identity. Saving this for future reference 🙏🙌", "msdsantos6": "Thank you for posting this...as a doula I haven't yet had a client not assign a gender and it's something I'm mindful of and also as I think about about having a child of my own. I don't want to assign their gender so finding a partner who shares the same views as I has been hard part😩", "coco_coup": "@ksdoty", "loa.za": "Honestly. Celebrating someone's sex as their gender is just weird. I don't think I'd like to have children, but if I do, I'll just tell people to bring me unisex clothes and toys and decorate the party in colors that are not typically assigned to a gender.", "mashon221": "This is everything! When I grew up EVERYTHING was gendered.", "itsslizzz": "@andrewlunaaa", "redeemed_of_the_lord": "That is amazing", "rylese": "I love the way this is explained. We’re definitely putting more gender stereotypes on our new babe than we had hoped too. But everyday is a new day to show them that they can be whoever they are.", "marilluch": "Thank you for these words. I will use them.", "tarajeana": "@michelley04 a good thread to read that might help explain gender/non-binary to our children.", "thoseriverrats": "I really appreciate this. I have three kids, \"two boys and a girl\" because that's what's \"expected.\" They have a trans cousin which has really opened up the conversation about gender with them. It's awesome how open and understanding kids are ❤", "skye_rire": "As a cis-female, I sometimes feel doomed by my feminine presentation in work and vanilla spaces. My mind feels way more masculine but I don’t feel I have body dismorphia. Yet it’s insulting enraging to me when people, often cis-males, approach me and put all their gender baggage bullshit disrespectful assumptions on me, leaving me to either leave their presence ASAP or rally extra strength I don’t want to use by putting out super masculine “BRO BACK THE FUCK OFF” energy. I hate using my masculinity like that. I’m just starting to explore why I feel like this and I’m curious if anyone has similar experiences. . Ty Ericka for opening this convo space. Learning a lot from reading. 💕💪🌈🙏", "iamashmergon": "No. Do not do this. This is going to completely fuck with the child’s head it’s is not an assigned gender it is a gender. If they’re born with a penis it’s a boy if they’re born with a vagina it’s a girl. Bring them up as a girl or boy according to what genitals they were born with. They can make their own decision when they reach an age to question it. Don’t question it for them.", "shana_ostrowiecki": "Since gender is a social construct is anyone a gender at all? Why do we use labels? By choosing any label are we contributing to societies pressure to form our identity around attributes of masculinity and femininity? Are we allowing binary to be the center of it all and describing ourselves in relation to it? Or are labels helpful for our ourselves and our identity?", "lyric.patel": "my experience with my gender would’ve been so different had this been my family’s narrative. we’re very progressive, but not to this extent. if i had been told this as a kid, i wouldn’t have repressed my gender and his in the closet.", "sambot253": "😍😍😍", "jazztheyogi": "What is an appropriate age to discuss this? My daughter loves being feminine and has never questioned her pronouns. However, we've seen her be almost grossed out when seeing other child who doesn't conform to gender roles and prefers either no pronouns or the opposite pronoun of what society would place. It was almost embarrassing to see her react that way because in our household we accept whatever pronoun the person chooses. However we realized that our mistake was not having these conversations even though it doesn't affect our family directly at least not yet. Therefore her views of gender identity are being shaped by things like school, Friends, tv Etc.", "fern_elsi": "would there be any negative outcome to assigning all children they/them at birth? is that what is being advocated? i just wonder if lack of pronouns could give kids a lack of identity and make them feel pressured to choose a binary?", "citrustree_banshee": "I recently came out to my friends as a non-binary woman. I don't know if I'll ever tell my family. Mostly because I don't know how they will react- and it feels like such a private, intimate part of me, that I want to protect it. But I worry that I'm doing a disservice by not sharing it. Like maybe I'm missing an opportunity to educate or something. My life is so stressful as it is. Coming out as queer was hard enough. I don't know. Don't I sort of owe it to live out loud for those who can't? I feel conflicted.", "ihatethemilitary_": "for a long time, i used they/them for people who didn’t pass as in the binary, for whoever whose pronouns weren’t made clear to me, until my gnc partner who uses they/them told me that they/them is not a default and its use as a default is harmful—it can make people who use they/them feel like they’re just opting out of gender binary with a default when they’re really opting in for pronouns that suit them and feel right. and this totally shocked me as i had never even thought of that, and even went as far as assuming i was doing good by using they/them. now when i don’t know a person’s pronouns i just don’t use pronouns, i say “that person” or their name. but i’ve talked to some of my other cis friends and was shocked that they disagreed with not using they/them for people whose pronouns aren’t made clear. that kind of crushed me and i think crushed my partner. what do you think? a lot of my friends also believe in raising their kids with they/them so as to not assume the kid’s identity and to normalize the non-binary.", "bethserafina777": "@malikcoop 💜 this :)", "_______ec_______": "LOVE THIS. Thank you for posting. Everyone is so generous with their insight, I’ve learned so much from reading the comments.", "kirken9": "Thank you for this", "mr_moonstone": "I’ve been saying dude and bro recently and I was wondering if you had any suggestions for gender-neutral terms I could use instead", "rileyandlunaadventure": "Yessss!!! Thank you for this. I want our child to be able to grow up knowing that their assigned gender doesnt define who they are. It will be hard as both grandparents are highly traditional but I'm putting in the expectation now. We aren't going to disclose the gender in the hope we get a more variety of items for them and have explained our view point on this. My kid will know that they can truly express themselves how they wish.", "sirena_st_jane": "This is a great post - also a topic very near to us right now as we just had a lil bebe. I used gender neutral language throughout my pregnancy (and pushed people when they asked “boy or girl?!” to think about whyyyy they needed to know the genitalia of the human in my womb 🤦🏽‍♀️) but ultimately i gave birth to a human that was assigned female at birth, and gender neutral just ends up putting primary the male-ness anyway (gender neutral clothes are basically boy clothes in the world of baby things)... and in a world that actively works to tear down female/girl/woman identified bodies I wonder if I am doing a disservice to her/them by not modeling that woman identified bodies are worthy of recognition and to not erase that female-ness unless/until they tell us different? Also - to have two woman identified people as their mothers who model very different ways to live in that identity perhaps provides a more broad platform for understanding? All good convo- thanks for making it a permanent post !!!", "themodernhouse_wolf": "Is there a place to say “I call you he/she because biologically you were born with this set of genitalia.” So long as you still make it known that you accept the gender they decide to identify as? For me this is why I call my kids she/he respectively and so that would be my honest explanation.", "melissaherreria": "Thank you", "4thtribodies\nVerified": "Verified", "honeyflavored": "@dylangrant_", "justinem143": "Sis look at this shit👀 @thenellylama", "emily.tamsin": "Thank you for this 💖", "luvlylioness": "I struggle to understand the concept. Maybe because it's embedded so deep. I admit I think traditionally about gender, and I would like to know more. I do believe that people should do what's best for them, whatever that may be.", "jentorborg_": "This is soooooo helpful! Thank you!!", "ferociousflamingo": "I've struggled with my gender and sexual identity and expierence my entire life. When I was younger I never truly felt as if I fit in within either gender and more times than not I almost just felt outside of the typical cookie cutter female bodied/female identified space. Yes there are times that I truly love to wear makeup and do art on my face. But there are other times when I want to rip my breasts off and just be 'other', to be a 'drag king' (but not really it was just how I rationalized it) it's very alienating to feel this way. And sexually, I knew I appreciated both genders but hated referring to myself as any lable like 'bi or pan' because I absolutely hate the idea of defining myself as anything so I started to refer to my sexuality as queer and actually came out to my sorority as such my senior year of college, which was scary. And then this past fall I moved to Wisconsin to campaign and organize for the Democratic party and I worked with two wonderful enby people. They were really cool but it was also jarring to me because I've never encountered enby people before and I also felt that referring to their pronouns of 'they/them' was almost othefing and disrespectful. I however worked really hard to break out of that and sometimes I still slip up but I do all I can to respect it. Only recently have I started to identify myself as gender-queer as well because it just makes more sense. I try to use they/them pronouns though I'm not offended if I am reffered to as a she/her. However I also sometimes feel like I don't know how to fit in with this community either. I never want to take up space that isn't mine. And I also sometimes don't assert my identity enough because I don't know really how to, I don't have a dead name, I still at times enjoy my feminity I just sometimes don't know who or what I am. I am privileged and I am white therefore it sometimes feels weird coming out of a closet that I am only half way in, in the first place or that's how I perceive it I guess. So I guess this really isn't a question I've just never been able to communicate how I feel. And I sometimes feel very lost because of it.", "samsamrepeatedly": "The 6-year-old in my life is really into animal-themed tv shows, and has picked up the habit of declaring the sex of any animal he sees (or imagines). Usually he's right about the reproductive role that animal will play (which is the only real reason to sex any animal), but I struggle with redirecting him about gender. Just because we know that is probably a female deer doesn't mean we know it's a girl... How do you affirm that they're correct but also help them understand that correctness is incomplete?", "rochelle_rapaszky": "@shinysparklywitch this thread is amazing 🔮", "pharalyn": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "msposhdosh": "This is so dope. Thanks for sharing 🙌🏽", "emily.evolving": "I am a teacher for children with significant special needs in elementary school. The kids are in 3-5th grade but their language development and their developmental “age” really varies from 1yr-6yrs. I sat in on one of their speech sessions where the therapist was teaching/assigning pronouns to characters and realized this is a core piece of the SLP’s lessons with my students. These kids are taught, just like any other to look for socialized cues to choose a pronoun (I.e hair length, clothing, colors) and many of my students, like those with autism, relay heavily on those definitions. My question is how do I start reteaching and helping them unlearn these concepts? I started using they/them in my own lessons but worry about what SLPs and their parents will do to continue to reinforce the binary.", "mcfdublin6": "Get real", "ashangrila": "Thank you for this. My upcoming child will hear these words ❤️", "lardverse": "Such a rad post. Wish this was known when I was a kid. Would have saved me so many years of therapy. ❤️✌️", "thehappyvproject": "So well said. Thank you!", "itsjeremybr": "Parents aren’t assigning genders... biology is (until proven other wise by the child in question)", "the.vegan.dietitian": "As a new mum who doesn't want to inflict the gender binary on their child but struggles with the fact the world is so binary obsessed - this is really excellent. Thanks for sharing @ihartericka ♥️♥️♥️", "tanisalexis": "For all the parents for all the babies. ❤️❤️❤️", "fork.bracelet": "😂😂😂", "sirm00re": "Yea no gender reveals for me in the future because i have a son and i want more children and how this world is becoming i want them to have the choice to be who they want to be not who i want them to be outside of being a decent individual and kind and loving and caring and etc. i never want my child(children) to feel like they have to hide especially around me. A LOT of black fathers/men fear their child not being “ normal “ when you should feel proud that your child is themselves! My mindset is to love my child and future children the way they deserve no matter who they choose to be even when they make mistakes because let’s be real parenting has no blue print outside of how to feed educate and protect our children. Outside of that we help them along the way because we too are still growing.", "sammlikebamm": "@mccalle000", "germanodusha": "✨🙌🏽💜", "m.a.d.d.o.g": "Saving this!!!", "dannieeanniee": "L😍VE", "spiritsongstudio": "This is great!! I wish I’d had this language 20 years ago. Thank you for framing this for me now.", "j_a_zarifian": "This is really eye opening and a great starter.", "kriswestendorp": "That's very similar to the conversations I have with my kids and even though they still go by the pronouns I guessed for them I feel like they have much broader gender expressions than most kids raised without ongoing discussions of gender or being around gender diverse kids. Great convo!", "original_gata": "This is so beautiful and what a loving, healthy and compassionate way to approach this difficult topic. ❤️", "scibookie": "What do you do if you don't feel like either gender? It feels inauthentic to claim either one, but I've kind of come to terms with identifying as the one assigned at birth. I'm not sure if that's because of societal gender constructs being so closely tied to beauty standards, or just not feeling authentic in my own skin. But damn, it's weird to be called \"she/her\" when I don't feel like a \"her.\"", "lambxlamb": "I really love this. I've often wondered how I would handle gender if I had a child. I thought I might just use they/them until they told me otherwise, but this explanation makes a lot of sense. It clarifies that the binary is wrong, explains that most people are still clinging to it, and creates an open space to discuss any preferences or questions as they arise. I love this, thank you!", "pugoverdose": "I think it’s funny that some Christians don’t baptize a baby because they wait till the person can make an informed decision meanwhile they are advocating bathroom bills and throwing bs gender reveal parties.", "vermilion42": "It's basic respect and so great to begin teaching them to respect themselves and deserve it from others early!💖", "mackenzie.lotus": "This is beautiful and so needed for parents to here. My kids only 2 1/2 and we already have these conversations", "elms_and_arms": "How do you actually teach your children about the body parts they have then? Ie a vagina and a penis? Like it’s important to know about those parts and how to take care of them. Also there are hormonal changes associated with each as well that they need to know about. I absolutely agree that gender constructs are harming but sex and gender are two very different things and erasure of sex can be totally harmful if one has no idea about their body from a biological standpoint.", "blaster1122": "@falzmi01 @bridgetlynch3 extremely thought provoking.", "bluntspliffs": "To this point my partner and I will be raising our children non binary until they’re old enough to communicate their gender identity to us. It’s the least we can do as black parents! Dress them in gender neutral clothing and not disclose to “family” or “friends” their “assigned gender at birth” which LBH only really means = WHAT THEIR GENITALS LOOK LIKE! Because that’s coded Pedophilia culture IMO and our kids deserve better 💓", "battynatty95": "What is the difference between non-binary and gender non-conforming?", "shanti_peace": "I think of the way I speak about and to my children right now as a placeholder until they can talk or show me (they are very young)... they won’t have to make a big deal about their gender identity or sexuality ever. I’ll follow wherever they lead.", "abbey_christine": "❤️❤️❤️", "faelienwizard": "A child in my who's assigned boy at birth is a girl but they are 4 and dont really get pronouns so right now literally everyone is \"he\". I've been trying to figure out if I should try to explain pronouns, or just go with it until they tell me otherwise.", "womanlymag": "❤️❤️❤️", "andreeasm80": "👏", "megankeup": "Literally crying reading this. ❤️❤️ so special and SO important.", "obi_mom_jenobi": "This is so good. Thank you", "ayeblood": "I know your particular pronouns are she/they and I’ve met a few people with similar. I’m interested in gaining more understanding of why you chose both a female and gender neutral pronoun combination.", "bearlynormal": "This is my favorite thing I’ve read. I don’t want my son to think I think of him as a boy but currently that’s what I see but I know he might be something else and I know eventually I have to explain my own trans identity to him so this felt like a nice thing to read and have in my mind for future! thanks for sharing Erika", "mx.m.b.h": "❤️❤️❤️", "refashionedgarbage": "I’m sure many parents don’t know how to articulate this. Thanks for sharing, and I’m sure it will reach many", "2zero99": "This is beautiful", "blk.theo.logy": "Can someone identify as a non-binary woman? Or do you have to identify as non-binary or a woman?", "sophiawallaceartist": "The obsession with putting everything into a binary is so embedded, people even do it with animals. Anyone else find it strange how people are so interested to learn the sex of your pet? My dog is very friendly with strangers and the first question we usually get is “boy or girl?” This question baffles me. What does knowing my dog’s sex suddenly illuminate? My dog is “male” but I have no idea how he/they/she feels about this. François squats to pee rather than lifting a leg and seems to love bearded men and pit bulls especially. Basically François loves butches just like me. If it’s like this with a pupbae, I can only imagine what it’s like with a baby human. 🌈🐶🐾", "foryourownedification": "Just an FYI, lot of kids books on the subject are written by cis white women who have plagiarized the work of LGBTQIA+ BIPOC. See a couple of them being frequently recommended in the comments.", "korc.can": "Bullshit until \"I use these pronouns\"", "tracyciel": "@simonuribe_", "omali_dia": "👏🏿👏🏿👏🏿", "curlyheights.o": "What’s a non binary life like? Is it simply a choice to not recognize your penis or vagina as the master to your values, belief and roles in life? #pleasebegentleImLearning", "missroyalmarie": "This generation is weird 💯💯💯", "mercii_me": "I love this language ❤️", "sjheartsmj": "Thank you for this. My 7-year-old told me in the car yesterday, after another conversation about this: \"I know, mama. Do we need to talk about it again?\" Always want my babies to know they're safe. 🌱", "thefierywell": "Thank you for this! I am digging through the comments for book suggestions! My kiddo is 4 and I have had a discussion or two with them but I see I have so much more to learn. ❤️", "lulu_organics": "Love this post ♥️", "brennamorgs": "I love this so much!! Thank you for sharing", "mattienewgent": "There are only two genders. Non binary is completely valid and it’s only an absence of a binary gender", "mxmiamack": "I needed to hear that right now", "obglitterator": "❤️", "woley": "👏🏼", "jenerous\nVerified": "Verified", "sarahmacchamp": "Beautifully said. 🙌", "bethteaches": "I love that this post gives parents words to use. As a middle grades teacher, I will borrow some of these words when gender comes up in my classroom. QUESTION: How would you handle having a student who has been known by their peers and on their school records as female, but has asked to be called by a new [typically] male name and he/him pronouns.... BUT you’ve received an email from the parents stating that they are not recognizing the student’s wishes and are directing teachers to continue using the child’s given name and female pronouns? This happened last year. I did not respond to the parents’ email, and I respected the student’s wishes to go by his new name and preferred pronouns. I never got backlash for doing so (probably because the student never told his parents) but I feel guilty for not doing more. I wonder if there are words I could have used with these parents, or if I would have been overstepping my place.", "megsacannon": "❤️❤️ Will be implementing this starting now with my 2 year old. Thank you @ihartericka", "butbiologically": "Omg @qomrade !", "kristen_roberts_esq": "Thank you for this. We don’t always dress our baby in gendered colors or patterns, so we often get “how old is he?” Or “what’s his name?” Or, “girl or boy?” With the last question, we say, “girl, until she tells us otherwise,” and I don’t typically correct people if they assume the wrong gender, because it doesn’t really bother me. Plus, it’s easy to assume when they ask her name and I say, “Billie.” While I still use the she/her pronouns, we’ve already decided to be open and discuss these issues when she starts recognizing them. Honesty and openness is going to be important!", "miss.georgiapeach": "This is honestly so sweet, I've been wondering how I might raise kids for awhile and I think this twitter post is more honest than the vast majority of parenting books.", "jennifereckertbernau": "We love the book Who Are You by Brook Pessin-Whedbee as well as Jacob’s New Dress and Jacob’s Room to Choose by Ian and Sarah Hoffman. Amazing children’s books 💕 Our daughter has known since birth there are more genders than boy and girl and we talk often about the binary stereotypes and how we can help not to perpetuate them. It’s helpful that our family is surrounded by and love many people that are gender fluid and identify in different ways than us, but if we weren’t this lucky, books would be one of the best ways to share and talk with young children! @ihartericka Thanks for all you do 🙏🏼", "pauperazzi": "I love this, thank you. Apologies if this was already asked, I browsed thru comments but didn’t see it. I’d be interested in your and others’ perspectives/stories about what people do when other people gender your child. For example mine is 2 and has a penis. He pretty strongly identifies as a boy so far but we try very hard to select gender neutral clothing and toys so he’s not feeling a lot of influence one way or the other in our choices (hopefully). But when we’re out and he’s got a ponytail and a pink shirt people tend to refer to him as she. My approach to this is not to correct them because I don’t want him to get the message that being called “she” is wrong or bad, and if they press the matter I explain more but if they don’t I just leave it. But I’d be interested in knowing others’ thoughts/approaches.", "aorists": "god this is perfection. thank you. if i ever do the parenting thing, and for whatever reason i couldn’t raise a child gender-neutrally, this is the perfect backup. (although i imagine i’d raise a child gender-neutrally since i’m non-binary too, but y’know, this is a good thing to keep in mind because the world is fucking harsh to anyone different.)", "artisticking": "Thank you 💕", "mynameisashnide": "I was just asking this question the other day!! I'm not even in a relationship, no where near to having a child but I want to be prepared! Thank you for opening up this discussion", "feministandfluid": "Does anyone know of any kid shows that have non-binary or trans people? I’ve noticed that my child has started to really use the adjectives “Boy” vs “Girl” and based on my OBSERVATIONAL research - I’m a scientist and raising a son as a single mother has been the ultimate experiment. I’ve noticed that in the past couple months - he’s almost 3.5 years old he’s started differentiating between boys vs girls.", "dr._bahiyyah": "@ihartericka Help me understand. Gender is man-made while sex is biological, right? why do some individuals take hormones to be the gender they wish to be? Why would one need hormones to help them be a gender that was simply made up? If I grow a full beard and mustache and identify as a woman then that’s what I am 🤷🏾‍♀️.", "takebackyoursex": "I am the mom of two little humans with vaginas. I have an ex husband with a new wife/mother and they are traditional AS HELL {I meant that pun}. I struggle to show my children the non binary aspect of life not because I don’t believe in it, but because I’m the only one. My children will both tell me that what I am saying about gender is wrong. Why? Cause they live with other people and in a society where they are told I AM WRONG. Mom is wrong. Even by dad and another mom they are told that. So it’s a struggle. I am and try for my safe space but am often over ruled. But honestly, the kids say they don’t believe me or I’m weird or that’s just mom being mom {a phrase I’m sure is encouraged at the other traditional home, especially as I’m also becoming a vegan, 👀} but also, honestly, I’ve often heard my kids say: “I’m coming home”. And I feel that. Somehow in the split of my marriage I became the mascot for the rebellion of self love, autonomy, and acceptance and even though my children struggle to figure why I’m so different as a queer witch sex worker who says they can be anything in a world that tells them different....they also know that in this thick scary world; they can come home. {welp I’m writing and now crying so thank you for this space, clearly I needed it ❤️🌈💕✨} #loveislove #genderisaconstruct and #thismomsloveknowsnobounds", "gracecath": "🙌🏼🙌🏼🙌🏼💞💞💞💞", "elise_ogden": "Thank you so much for this.", "payitnomind": "💯💯💯💯💯💯💯", "quinnstagraming": "When do you think the best age to do this is? I am pregnant and I plan on using the societal pronouns but being clear that that isn’t the only way (as stated in your post.) I have struggled with when to make it clear that they have the autonomy with their pronoun and gender.", "dyme.203": "I was in the middle of reposting when I realized @ihartericka actually reposted a screenshot of your status @qomrade 😭👏🏽🖤", "amytatina": "Definitely going to use these words in my preschool classrooms! Thank you for sharing this ❤️", "not_a_girl_enby": "Glad to see more people with theybies and letting kids decided. I wish I knew what I knew now. ❤️", "iamnijai": "🖤🖤", "nickdariushtaubes": "👏🏼💯", "hobryant": "No kiddos yet — saving this post for if/when the times comes!", "reign_check": "What is the best age to communicate this? Is there a right age?", "rominamontti": "So beautiful!", "mirz112": "I absolutely LOVE this!", "celiac_and_salty": "Thanks for posting this. I've been seeing some stuff about how its \"wrong\" to assign your child a gender at birth but they way I see it is, if it's the child's choice then not gendering them is no different. Raise your kids how you want but let them be who they want to be.", "sethmrosen": "👏👏👏👏", "theweeniewaggin": "@linseedoilz", "bexlife": "🙏🏽🙏🏽🙏🏽", "mxleahy": "@geophid_21", "squidsommar": "If you wanted to have children, would you use gender neutral language", "carolinesmiling": "This is the future needed for raising children 💕💕💕", "samcelentano": "One thing I’ve been wondering is is it okay to assign male/female/intersex? Like for the sake of medical identification (until the person says otherwise) can it be appropriate? Just because people with vaginas and people with penises require different care for their reproductive organs... I hope what I’m asking makes sense 😂 for example, i was born with a few gynecological problems as a baby that obviously I wouldn’t have occurred is I was born male/with a penis. So is it okay to label male/female/intersex for this reason?", "dadjokesofficialvevo": "@ihartericka not a question, just an honest thank you from a 25-year-old trans woman who still needs to hear this sometimes. I love, appreciate, and am grateful for the work and the labor you do daily for yourself and the world. ❤️", "angelamorrismakeup": "My youngest child (who has had gender identity explained to him basically since birth and identifies as a boy) seems to have a much better grasp on it all than his older siblings. It’s almost like you can see a year marker with my kids between when *I* began to understand and talk about gender identity and when they all were presented with it. I wish I had been aware sooner. Thank you for posting this.", "mimiriver578": "@ihartericka okay, I will try again. I am a beginner in this, so forgive my dumb questions. what is a non-binary femme for you? and what is the difference between 'queer' and 'trans' ? thx for a short answer.", "karlymortensen": "Omg thank you, I’ve been wondering how to start this conversation w my kids", "misskellymae": "Thank you, thank you for this. I’m learning so much from your account but struggle to find the words to talk to my kids about it. This is simple. Straight forward. And just exactly the right thing.", "reyhanbc": "Thank you for opening up this dialogue! 💟 We’re having our first child and this is something we have been discussing a lot. We’re asking for children’s books instead of cards and have found the following on the topic: Who Are You?: The Kid’s Guide to Gender Identity by Brook Pessin-Whedbee, Introducing Teddy: A Gentle Story about Gender and Friendship by Jess Walton, and 47,000 Beads by Koja Adeyoha, and They She He Me: Free to Be! by Maya Christina Gonzalez. Has anyone else found children’s books on the topic? Would love any recommendations or resources!", "zak.in.action": "Damn. Great language. I appreciate the accountability and choice. 💛✨", "mollzdeep": "What do you start with if your kid doesn't ask you about it? I know the basics of nonbinary but I'm not super up to date on it and I know there is so much more to learn. My kid is 3 I just let her pick things she likes to wear and play with whatever that may be but I haven't had purposeful discussions with her at all. Where can I start?", "g.eege": "gender rlly be getting people all caught up when it doesn’t even exist. but i think in order to REALY understand that it doesn’t exist people need to establish a relationship to the word and then have their own individualized discoveries about how problematic it is. any1 else resonate? not a question but this got me thinking 🤔great post!!", "theehealthguru": "This shit hit hard. Wow", "ruthlesslove88": "I dream of the day when this is just seen as common sense.", "natlablack": "I’m pregnant now, and my partner and I will be having this conversation with our child. Thank you for sharing this, it helps so many people who want to/are having/have had kids!", "touchyourboobs": "🙌🏽🙌🏽", "chashme___baddoor": "@whbutt @omgitsneha", "emilygoldhammer": "This is really great, my non binary 8 year old has been asking why we call their little bro, a bro, when we don’t know what they are until they tell us, and I really didn’t have a good answer so I said “I don’t know, maybe we should use they/them until Eli can let us know?” And they liked that idea...but I’m going to circle that convo around and use this language so they know that I’m still learning the best ways to support them.", "frankie.mxsgendered": "@ama_shipwreck @misss_sassy_pants @prairie__gail @imtoofastforyou @shayaulait I thought you might find this discussion interesting 🖤 caveat that tagging this post doesn't necessarily mean I agree with *all* the *comments* on here, just food for thought", "ashtongattis": "Love this. Adding it to what I say to my kiddos.", "normalpersonontheinternet": "💖💖💖💖💖💖💖💖", "hair_by_gina": "I will be sharing this. What a beautiful way to open the door to that conversation. I can’t wait to be a parent and say this to my child.", "adrianmorel": "Love this✨", "ofcrowsandcrowns": "I thought I was a ninja turtle when I was a kid.", "fleetwood.snacks": "Any suggestions for how on earth I deal with my non-binary step-kid’s TERF bio-mom? 😓", "elleoille.marvelous": "Do you have experience with discussing gender with autistic children? Both of mine are and I discuss gender with him regularly (and he has said “I am definitely a boy”) but he has a really rough time with non-binary language. He understands some people are born in a body people expect to be a boy or girl but they don’t feel they are (and therefore aren’t and we respect people’s identities) but he can’t figure out how people can feel like something OTHER than boy or girl (again regardless of genitalia)", "canisson": "I do this with my 4 and 1 year olds 💕 My 4 year old has told me that she feels like a girl so we go with that (while explaining that if she ever feels differently all she has to do is tell us) and we always say that we assume brother is a boy but we won’t really know until he’s old enough to tell us. She very frequently draws family photos of dad with long hair or mom with short hair and says things like “this is dad when he decides that he feels like a girl inside”. (I of course also explain that anyone can have long or short hair but ya know, 4 year olds.)", "rileslovesyall": "i love this, & i wish someone had told me. thank you for sharing!", "radicaledwardx": "How would you go about explaining the difference between sex and gender to a 6 year old? How do we start building that knowledge and set up a foundation to give our children the tools they need to vocalize and explore their own identity? Thank you for doing this, it's exactly what I've been trying to work on.", "la.peor.de.todas": "Working on this with my 11month old. Nothing radical, love them unconditionally, create safe space for them to be free. Our intentions as parents have been to create a strong foundation for them love to feel loved, let go of our expectations and to build a critical community. #ittakesavillage", "liluggo_": "what is the particular philosophy behind self-identifying, especially since there is so much variability behind each individuals notions around gender?", "catalinawellness": "Thank you", "kristabelle1210": "Saving!!!!! 😍", "sweetteamoonshine": "❤️ this!", "gigi.jr": "This may sound naive or ignorant so please forgive me in advance, but I kind of worry about putting so much pressure on young kids to decide something so important. Do you have any ideas about how to approach that or any insight into how people navigate this with their children?", "thetuckypants": "I understand gender in on a spectrum, and because of you, it isn’t something we can see. A person will tell you their pronouns if you ask them. Are the correct gender words woman/man/non-binary or feminine/masculine/non-binary? I’ve seen you say “masculine presenting” and want to get clear on language that is most affirming and loving. Also, when is the use of female and male correct? For example, I’ve heard cis-men say “I went out with a female last night” and I don’t like it when I hear that. It feels dehumanizing somehow. I love you and Eb and Baguette. Thank you for your help with this", "emilieever": "Ppl", "resetrefocus": "While I like this my only question is why assign them a binary gender at all? I understand their reasoning is explained by the explanation to the child but it is clear they understand the binary to be bs so why perpetuate it in the first place? I understand possibly wanting to protect a child in binary spaces so why not wait and ask the child how they would like to enter and identify themselves in those spaces such as school when it is time?", "fara.oana": "Hi, I have been wondering about hrt and gender, basically if gender is in the brain and hormones are not gendered nor sexed (every body produces them in varying quantities), how can one explain the experience of relief that transgender ppl have when they begin/undergo hormonal treatment? I know this is prolly a multi-layered question and that the answer might be too nuanced or complex for an Instagram comment, but I would really appreciate being referred to some research on the matter as I've been struggling to find any 😐. Thank you in advance, appreciate the time and effort you put into this 🌛🌵", "kkristennnnn": "what has been your experience when your friends have told you that people where disrespecting them by purposely using the wrong pronouns/identification?", "siobhanonfire": "How would I best explain the difference between boy and girl and non binary? ❤️", "soy_a.r.t": "❤️💯🗣", "mgrimoire": "I’ve always wondered how to do this right if I actually had kids. Thanks, @ihartericka!!", "lornamariehansen": "This is incredibly helpful! My 4 year old loves to ask me if people/animals/objects are boys or girls and sometimes I’m at a loss as to how to respond. Now I’m actually looking forward to the next time they ask, so thank you!! 😊", "assatataughtme47": "PARENTING 101!!!!", "sista_daddyo": "Is it weird to be a lesbian but feel like you trans though??", "sadiehofs": "Do you think it would be healthier to raise children with gender neutral pronouns, and do you have any suggestions for how to do so in such a white supremacist gender binary world? *Thank you for your time!*", "ghrg": "this", "kellys_quest": "🎤 ⬇️", "kassssj": "As a sex educator have you found it difficult to try to teach in primary schools or is that an issue of changing legislation around education so that conversations like these can also happen at developing ages? Especially since I know there’s a lot of states who don’t require sex and health education at all 😪", "mysisterskeeper.rnr": "Wow. This is epic. 👏🏿👏🏿👏🏿", "nobodyslolita": "What would the other genders be if not non binary or boy or girl. Is nonbinary like an umbrella term like queer could be for example? I'm so glad you helped change my perspective on gender, I think its just something I dont know.", "gpopprincess": "Do you believe it’s ethical or preferable to assign your kid a gender in the first place?", "chantellekohn7": "This is amazing. Really hoping people take this on!", "zedk": "❤️❤️❤️", "livfogx": "@douglasjweir", "mr.dudette": "oh this is so important damn", "arielwatriss": "My kiddos are 3 and 6. We talk about this frequently.", "aeppich21": "Thanks for this. Was wondering how I was going to talk to my kiddo about gender when shes old enough. Had some ideas but this is sooooo good. 💚", "womenslasers": "I think about how to navigate this *all the time* for my someday kid. This helps so much. Thank you!", "verovivaldi9": "@malenacasto @tuamigoivan @chikonotsteve ❤️❤️❤️", "travdecoop": "@griz_liz"}