{"nopalycopal": "hello! what we've been talking about forevvveerrr in qtpoc spaces. yes about that kink comment.", "baddaydreams": "a kink/fetish for being called out? now that’s some shit", "zaragrewall": "@delisafrancis", "nishea.baebae": "@jualreadynotho Awfuckbai", "sukh.cc": "Literally none. I give 2 fucks about what white people think. That might make me racist because they are the minority in my environment", "laluphika": "https://m.youtube.com/watch?v=rCMCv9W6BZY&list=PLC5PJtWBigV2MVc0HG8Wt1IQU_mFSDepG&index=17", "ina_dddd": "I don’t know who you are or how I came across this post. If my comment offends you, I am sorry, but I am entitled to my opinion. All these stupid— and I say stupid bc I consider them stupid—things that I hear about sex/gender is a whole new level of stupidity. Let me tell you this, when I came in America I saw how all my classmates where divorced with 100 stepsisters from one side and 100 stepbrothers on the other side. I learned about people undergoing surgeries from man to women and vice versa, and learned about open relationships where a thousand people have sex with one another, and a lot of other things including this what you have written. What else is left for you guys to invent? How come me, or my sister, or cousins or all the friend and family I have in Croatia never came out with these stuff? I remember my classmates, and family and friend, all parents (maybe one or two divorced) were happily married and still are, we all knew who was a boy and a girl, we didnt have to go naked to get attention, and did not need thresomes to keep a family/relationship happy. As a matter of fact— because I come from a patriarchal country-I always wanted to be a boy and have power. Not only that— but I didnt want to experience my period every month. Despite my desire being a boy— bc of the patriarchal society we live in— i love being a girl. Since I started to understand, and I was told I am girl I fell in love with the idea of being a girl. So all my friend n family I have in Croatia. Anyway— keeping in mind the way how you grew up— I know u dont understand what I am talking about. This world doesnt really need thresomes and nonbinary and super-binary or whatever u invent. U can call urself all the names or nothing, u still gonna be born either with a vagina or a dick.", "raf_isl": "It must be very tiring being you, seeing and perceiving everything as an act of hatred.", "bb.abz": "@cynthiacortes you’re not following them. Get on it!", "loveaprilkae": "❤️", "french.market.maven": "Your post is fascinating. I agree that SJ workshops should be led by POC. As a white woman who grew up in the 60’s, I’ve seen & heard stuff that even as a child I found horrifying and unjust. That said, my confusion/education surrounding vocabulary (obviously not ALL - some is self evidently not ok by any stretch of the imagination) within both race and gender has been steep. I am grateful to any person who can look beyond my error or ignorance and explain to me, with kindness, why and what the current preferred vocabulary is. Sometimes I am literally blown away by what I learn... then, deep diving into that road serves to open my mind even more. I don’t feel guilty - just ill informed.", "beccaaaadiess": "All problems would be solved if we just killed all white people and y’all can’t deny that 💁🏿‍♀️💁🏿‍♀️", "mindsmine3": "It's so true. It's happening in all fields. I've experienced it as an artist and arts community educator. Say it loud..I look forward to ur podcast❤️🖤💚🔥🔥", "gracecath": "@calliehunt5", "nillerenee": "@cheriseburdeen", "blackwithplants": "Appreciate you and this feed. 🙌🙌🙌", "brandimazesticeon": "That last bit about having a fetish for being called out by black people... 🎯 🎯🎯", "flowerwolffmusic": "Yesss! Truth. I get tired of this shit all the time.", "atouchofjon_": "!!!!!!!!!!!!!!!!", "brescullark\nVerified": "Verified", "dc818_": "@teachallyoucan", "jv_lva": "This absolutely. Thank you. This is the language for how this feels. 🙏🏽", "lindseygeeeeee": "I agree whyte ppl shouldn't profit from it or be spot lighted -- but I've read commentary that sooo much emotional labor goes into black people teaching whyte ppl RJ and WS - so I thought whyte ppl should in some role help facilitate or talk FOR whyte audiences (and just in every day life like over coffee) sometime to alleviate the burden?", "hereismyusername": "Could someone repost Ericka’s Venmo account info?", "meshaylacox": "What does this look like for those of us in predominantly white states and cities who are committed to anti-racism work?? I’m based in Bozeman, MT and outside of a few black centered events I’ve been able to host most of our work is anti-racism with majority white audiences.", "thisrawsomeveganlife": "! ! !", "revere.reis": "This resonates in my soul. 🙌🏽 Your wording is always so on point and on time !", "thehandsofhanifa": "Racial affinity healing groups are essential in the cause for racial justice.", "the_phantom_magician": "THIS THIS THIS. Literally started saying this to friends a few years ago.💯💯💯", "_dactually": "My school’s “diversity and inclusion” group has been full of racial justice being explained to white people at the expense of the POC in the group this week and I’ve been that token asshole trying to stand up and speak out on it leaving other white people’s feelings hurt. Watch me get expelled for this shit when one of them complains about me", "dwwalks": "Ok.. so much here.. I'm just going to say as someone that has been gifted the opportunity to learn Indigenous Circle process and explore RJ work myself, this is a sad reality. So sad that I needed to step back from everything because I was so tired of the nonsense. I really appreciate you opening up the conversation. I truly hope that work borrowing from and or using circle process will always acknowledge what it means to be marginalized. I absolutely will not engage in the work without doing so.", "midnight_marauder_84": "holy shit.", "phillybobbybrown": "Yas this resonates so hard about why so many spaces feel so wrong", "mincermite": "👏", "badgyaljoie": "And a ooop", "aliza77": "There is a group called ‘white nonsense roundup’ on fb. If you tag them on some ignorant white bs, they will step in and do the work of trying to educate other white people. Educating white people is the responsibility of us other white people. And I agree, we should not be making money on this work while centering white feelings. I know that I continue to have work to do to unlearn racism and always will. Cause that’s the reality of being a white person in a racist society. So white folks, if this convo is giving you some feelings and you wanna talk about it, dm me, let’s talk about it.", "numerouswins": "Whew @deee.blaze", "curljane": "Oh crap...", "tanichols": "🗣️🗣️🗣️", "aphenomenalgemini": "Definitely interested in hearing more about this topic. Thank you!", "celizabethforte": "And.... (presumably) well-meaning white people STILL managing to center themselves here asking their (presumably) well-meaning questions.", "birdgerhl_": "Oooof got me again", "shadesofcolouryeg": "💀💀💀💀 the fucking truth. Thank u. ❤️", "raluca_de_soleil": "Is there no scope for white people sharing racial justice knowledge with other whites for free, crediting the BIPOCs who taught them, with the purpose of motivating those whites to become anti racist and thus minimise harm?", "daddypuss.rex": "@moss.the.bard ✊🏾", "tiye.jones": "😂😂😂😂 Still can’t get over mixed black", "foto_quioto": "@ihartericka you weren't sitting in on the discussion in my philosophy class this week were you?", "therealcourtking": "Oh I can’t wait for that fetish part. I got some thoughts on that and this post was 😳🤔❤️. Thank you!", "kali.v.p": "@tayycarter_ @thelittlehemarmaid", "paige_prosperi": "It’s time for white people to stand behind marginalized people wether things have been explained to them or not!", "colt_lightning": "💜", "paget_ross": "@sharanguru", "kenlikebarbie": "BIIIIIITCH!!! This CUUUURED me!!!", "becksters18": "@theangelic_troublemaker", "allaboutalexiz": "@thelouieshi", "huli_agus_": "🔥🔥🔥🔥🔥🔥", "lindsaynosredna": "Wwwwww✨needed to hear this", "jordanisjustfine": "I mean, alright. 🤐", "intergalactic_mom": "@jamoon314", "groovydoom": "damn. thank you.", "theafrodisiak": "the last line is nothing but utter truth & im here for that post.", "preetilisious": "@kali.v.p", "nuhan56": "@caro7788", "zoeeatsflowers": "@ihartericka how do you feel about white people leading RJ workshops (etc) to “educate” other white people? Is that a real thing?", "waverlyrosee": "Yes!!! On the fetish to wanting to be called out. Speak on it sis.", "ahmadkafari": "@kenyahallmusic sis! This tho!!!!!!", "itsjustkimnoberly": "Literally the reason I’ve had to unfollow or mute more than a few RJ accounts (ran by WOC) because at the end of the day they may intend for their message to be for Black people but their account just is a mess of white ignorance and Black people reliving their trauma to “educate” dwhites. 🙄", "askgoody": "So....I high key did that shit tuh'day!!! SMH", "sacredblooming": "@florcyx @evcanela @mslaudidaudi", "cherrystyx": "@luzislovely Whew!", "herbanhealing": "Too much, but I’ve been working hard to change that the last couple years. More focus on us, less on them.", "phoenixical": "A word!", "foryourownedification": "This. Still looking for an outdoor/recreation platform. They “say” they are be for Black folx (or PoC) but constantly center whiteness.", "kreepinonyourcap": "This is so so hard not to do especially as a white passing POC. I'm tasked constantly by white folx for me to educate on RJ issues. My rj work exists profesionally in a white supremacist system currently it's so difficult to get out of that when there are so many white people around you harming POC DAILY. a lady told me one time after I got upset because a white lady said some stupid ass racist bullshit to a native facilitator in a workshop. The lady said, \"her response and reaction if not your problem.\" She was speaking to me as POC to POC, but being bi-racial makes it so that it is half my problem I we always felt that way. It's a protective factor to the other half of me and my black community but then the other half gets burnt out, upset, pissed off, emotionally distressed due to the constant burden of white folx racial justice education. HOW DO I RECONCILE?!", "adoseofom": "Wow all of this. Our school is doing a whole summer class on anti-bias/anti-racism etc and we are an ESL school, black and brown adult students — class is led by 2 whites women.", "kizzybeyonce": "We need the follow up! That kink fetish is sooooo real. Omg, I'd never heard it articulated like that but that is it. Like how can I center myself oh say nonsense and get called out to validate and condify my position as \"Ally\"..ugh", "authorreginadew": "Wow... Damn!", "domandtheworld_": "100% with the fetish/kink, I feel like there’s also this satisfaction that comes with figuring out how far they can push racist commentary. Like how many racist/microaggressive things can I say around this person before they call me out or react", "charisejeanine_": "YES. Woo..and that last part, I'm convinced this is true (at least of some).", "lhakimhealing": "💯💯💯💯💯", "ignantintellectual": "I would love to experience a T4T lead by you and Ebony.", "poetayinmotion": "I very much agree with this. Curious what you think about white people doing work with other white people to decolonize their thinking/behavior...", "maria_la_hinojosa\nVerified": "Verified", "brendamgonzalez": "Omg cant wait to read your thoughts on this call out kink/fetish. Ive been thinking about this a lot in the vein if how to reduce or discourage ability/space for virtue signaling in workshops I facilitate.", "erinthepsychicwitch": "It’s all explaining things to white people... but I’m white - so it’s given in service to keeping the folks of colour from dealing with my people’s idiocy.", "ishtastic_3": "🙌🏾", "mackenz_e": "👏🏾👏🏾👏🏾👏🏾", "francesgolightly": "Calling out myself. But this was also a reminder to me to spend less time arguing with other white people who refuse to understand, and actually GET OUT IN THE COMMUNITY and do something. Time to stop hiding behind cancer, that’s for sure.", "thefreeblackwomenslibrary_la": "👏🏾👏🏾👏🏾👏🏾", "bexlife": "@asha.frost 🖤🔥", "braids_by_kailey": "Waking sleep bitchez up everywhere. Me. I’m that bitch. Thank you.", "alejspek": "But I so love being asked to be a part of every diversity and inclusion board 😵😫 #yourfavoritetoken", "livshaa": "I love you @ihartericka , I swear it's like you're in my head.", "ajenniferyourthoughts": "I have personally experienced this once again within a very popular, very white-centered organization. I appreciate your insight on this topic. Thanks for making this a permanent post.🖤✨💫", "biggest_little_bird": "With the fetishization or kink of it: I can't speak to that exact direction, but I think a similar vein is white people finding places to be called out by Black people as a way to feel like we're \"doing something\" without having to do our own research/self-examination. It's less labor on our part to say \"tell me what I'm doing wrong, call me out\" than taking that work and deconstruction on ourselves. We just offload the labor to those that never asked to be our personal critics.", "micro.human": "I have been in a RJ workshop where white women's feeling started to be centered. I attempted to point out that we must be doing the work and not relying on POC to educate us on these issues - idk if I was able to articulate it well enough for people to understand though. But, my question is what does the ideal balance for this work look like. Is there a balance? I understand completely about not centering whiteness and white feelings and I don't think white people should be leading these discussions but I don't have hope that any of those white people would be exposed to anti racism work otherwise and I highly doubt most, if any of, them have thought about it since last year's workshop.", "lllunazulll": "⭐⭐⭐", "theclauuds": "THIS. 💯❗️", "ihartericka\nVerified": "Verified", "americahatesus": "the former and it’s exhausting. And most of the explanations sought (99%) can be found in a 5 second google search. 🙄", "khysles": "I live in fear of being called out, though I know logically that it is necessary and good, and not the end of my life. But (barring what you have to say about the topic that may change my mind) it definitely does not feel like a fetish or kink for me. Also, I get what you’re saying about white people not profiting from RJ when that money should go to the people working on RJ who actually suffer under racial injustice. But what about people like Robin D’Angelo who speaks to white people about racism? As you say it’s exhausting and traumatizing for racialized people to keep educating white people, so shouldn’t white people be doing that work?", "myheartinasquare": "OKAY!", "mswrightsway\nVerified": "Verified", "adellartemis": "That basically sums up trying to impact policy in any government system", "jaali_co": "Thiiiiiiiiiiiis.", "thewaythru": "“White people have a kink/fetishized for being called out by Black people.”", "_blacksunflowers_": "The former and that’s why I’m so glad to be done with this shit! I’m tired of explaining things to white people that just refuse to google. I’ve been gaslighted, and experienced microagressions and anti-blackness that has really affected my mental health.", "j_a_zarifian": "My job is to talk to the white folk. I follow pages like yours to learn by the things you and other followers write. I don’t usually post as it’s not my place. But I thank you for this learning tool and for mentioning many other sites that I have joined for the learning.", "jewel_thegem": "Exactly why my work will never be for the Whites. They out here learning all the things and racism and anti-blackness is still at it’s peak.", "studiosree": "DAMN. True in so many aspects of life. Not just race. A good reminder.", "cassafrassalive": "@kait.kamalei", "the_real_kyser_soze": "What's the name of the podcast??? I'd like to tune in.", "miguellll.vy": "As whItes being called out by blacks. MUST BE TRUE people crave negative validation and drama", "cravies": "Ooooh thank you for this- this is something I need to look out for in my own behavior.", "kooliajelly": "Hi @ihartericka ! What is the name of your podcast?", "kazejewelz": "I’m always battling on this rhetoric. Someone like me who chooses to only want to include blacks/indigenous/colored on this matter of racial Justice, I’m told I’m being secluded and in order to make change, i can’t segregate when I’m not the one who even implemented white supremacy or racism. choosing to include only those who unjustly identify, are marginalized, and need platforms to essentially heal and grow towards our liberation shouldn’t be controlled by the slightest of yt people. We’ve been commodified greatly for centuries to always feel the need to have whites included in our liberation when they are the primary stagnant counterpart in our progression. I’d allow some type of sole monetary investment with no interference to be applied, and dassit!! 👏🏾", "toenopawfull": "I’m wondering if anyone has a work that i might recommend for white people to start with other than White Fragility — I’ve found it’s a good starting place, but would rather be supporting a black woman in the work... and until Layla Saad’s workbook is released I’m not sure where to point people on their journey.", "iamfathajazz": "You, Ebony, & #hoodrattoheadwrap have been dissecting and rewiring me on this level!", "themelissadenizard": "Yes, to the last part about white people having a kink or fetish for being called out. It’s like some of them feel affirmed for being able to withstand a call out.", "lizhager": "Presses print!!! It's so simple if my fellow white ppl would just pay attention, we need to listen, listen, listen and change, change, change and WE need to educate, educate, educate. This part is on us 1000%", "lindaecruz": "Every...single..day at work. These are also the folks making upwards of the most a year yet cutting jobs left and right because there’s no “budget”. 🤦🏽‍♀️", "bett.222": "OOO THIS RIGHT ON TIME RIGHT ON TIME", "chaoticrebxllion": "Whew....ain’t this a word. 🙌🏾😭", "nomiz": "Omg 💯!!!! @melindaagarciaa @cassandthecity @chischisschissy important convo / consideration. Who is this for?", "flowersrisin": "This was soooo my past struggle as a Black femme with a decent academic background. I’ve crossed over the facade of feeling indebted to teach white people what they should already know and found home in creating conversation with my actual Black femme community. What a journeyyyy 🤧🙏🏾", "hoolzyamama": "Thank you once again! I find myself often explaining to other white people that they shouldn't be expecting marginalized people to explain things to them, and offering my help as much as possible instead, but thats still explaining things to white people... I often wonder where is the interruption in this behavior that's not centered on white people's knowledge/experience", "explaurren": "Would you place social work and RJ in the same category? Been thinking a lot on white social workers working in black communities/with black folx.", "prairie_mortem": "jeez, this was an important callout. i need to CONSTANTLY be aware of this.", "atotaldrip": "Damn", "ifpencilscouldtalk": "Thank you so much for saying this. 👏🏾", "hoopberry": "I took at a look the book me and white supremacy and i was like this will be so helpful for white folks BUT its leaving me alone to wonder abou t my own internalized racism. Where is our workbook? Im grateful that book is out there but that ia a very good question. Im imteresting working through this from a brown perscective.", "denengethefirst": "Wooo! This is a Word today! Seconding everything here and @therealkristaf @liberationdestination Right now reeling from a week of it (3 days feels like 3 mos) in the academy and I’m near the edge 🙃", "mstiffanyrueshaun": "Whew!", "_run_fatgirl_run_": "I think a lot of white people have trouble listening more than they talk. That's not something they need to waste other people's time exploring.", "dominiquedrakeford": "Facts", "zrosaaa": "Thanks for this post!! It makes my skin crawl when white people use the bullshit excuse of “well it’s better to teach and hope others change than antagonize and turn them away just because you don’t think it’s your job” towards black folks...", "thembianaiya": "!!!!!!!!!!!!!!!!!!!!!!!!", "pattydivine91133": "I’m intrigued by the kink/fetish piece. I believe we as human beings have created a collective unconscious addiction to trauma/pain. We usually unknowingly seek it out because we assume it is inherent to life. We feel a level of comfort and safety in pain even though we don’t truly want it, simply because we have become accustomed to it as a part of life. It is a pattern that doesn’t have to be. Thankfully conversations like these that facilitate vigilance, alertness, and awareness allow us to see our delusions so we can instantly drop them and transmute these patterns into ones we can consciously stand behind. Thanks E$ for holding the light for us!", "k6mil": "Yes, and how much of the work is still left in academic jargon, making it even more difficult to reach the populations who deserve knowledge of self / RJ healing work? We must talk to who we’re talking about/to. Ase to all this", "thinkuthink": "❤️", "they.them.ryse": "White people always want to look to the very SAME people they are hurting, colonizing and all the other shit, for they “way” to solve the problems that THEY created in the first damn place. You, your people, your oppressive systems are the ones in power. When will they stop with the learned helplessness and realize, it’s not one single Black, brown or non white persons job to fix what we didn’t create in the first damn place. We are not white peoples teachers, we aren’t animals to study. Figure it the fuck out on y’all own and let us live for ONCE... cause y’all still can’t even let us do that", "sylviamims8": "I completely agree with ALL OF THIS, and look forward to listening to the podcast. I want to see more workshops for Black people to discuss how to dismantle our internal oppression, to discuss issues that we cannot address in the presence of WP, such as colorism within the Black community, and how we learn to uplift and empower each other. Fully understand your mention of WP kink/fetish thing. I’ve seen it repeatedly in which WP return to anti racism meetings, but never do or engage in the work. They’re present to say “I’m a good WP because I regularly attend anti racism meetings”, and/or seem to get a kick out of being called out for their white privilege and white supremacy.", "jilla_821": "👊🏾👏🏾👏🏾👏🏾👏🏾👊🏾", "jessicaaahhhhhhh": "🔥", "beingflower.pdf": "The white people who want to understand will because they will put in the work. No one needs to explain anything to them. If someone is receptive, then they're receptive.", "xoxo_ash2019": "@authorvirginiaw read the caption. This is what i was trying to explain to you yesterday.", "chocolatebarbri": "Whew. A word. It reminds me of what my 80 year old mama says when anyone tries to tell her she HAS to do something: “I don’t HAVE to do ANYTHING but be Black and die!” 🤷🏾‍♀️🤷🏾‍♀️🤷🏾‍♀️ This is why I don’t explain things to white people. Imma call attention to your foolishness, but it’s on you to figure out the whys and wherefores 🤷🏾‍♀️ And you catch this block or these hands if you want to try me. Your choice.", "sarahkiva": "Agree 🙏🏼💜", "luvandkiwi": "Ooo the kink/fetish part. Hit the nail on the damn head", "artsyangsty": "What do you think about white people who face racism? I know several people who live in predominantly poc areas that are literally chased down the streets - sometimes with weapons is what I’ve been told - simply for being white and privileged. Of course the majority who face racism like this are poc (in the west) but this is 100% ignored by all groups and is really rather dangerous. Do we just ignore this? Is it not a race issue just because it’s white people? I’m curious as to what people think about this", "daria_ann_poet": "Wheeewwwww. A word.", "antigona_sanchez": "I just needed to read this. Thank you. So excited to get into the podcast tonight!", "erin.rosecheek.renee": "That kink part though ‼️‼️", "tracycozette": "I speak about this often in the work place in my dept and I know it makes people uncomfortable and even puts me in danger but it is what it is. To stress this to nbpoc is wild in and of itself...their proximity to whiteness and privilege and their inherent antiblackness has them shape shifting when convenient and mammifying Black femmes in the office. Thanks for this battery in my back @ihartericka", "sugaring.brooklyn": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "lagrossetoile": "I think the last point from all that I have seen is spot on. It's like it absolves is temporarily of guilt- we got told we were wrong, we can admit we were wrong, now we can walk off and say to ourselves my gosh how magnanimous and open am I. I am wondering, with all that I've read, whether a better approach for Black people is exactly what you're saying, just block us and go do the necessary for your people, because honestly I really think we do hang round sucking up stuff like vampires. That said, what I have encountered here has forced me to look beyond my own actions and I can say honestly I am better and less toxic than I was. One of the strongest things I've learnt, which I've enacted in my own work, is to give up my voice to someone who knows, and I am doing this now regularly in other work. Whenever I see white people now talking about racial justice if they themselves are not in harms way I just think fuck off and hand the mic over, and I am also trying to fuck off and get out of the way. I don't normally comment much publicly on your account but the last was dead on.", "issatrae": "a real ass fucking question damn. I have legit get guilty on more than one occasion for getting annoyed by someone’s racist/bigoted/homophobic comments from a white person & not wanting to take the time to educate them. I will give them attitude then later be like “I could’ve taken that opportunity to educate them”. But why is that always on us?", "kristin.is.cool": "Can't wait to read more on the last point! Fetishization is so true. I also think lots of ppl are looking for a guru.", "lerinalta": "This is nothing but unadulterated FACTS. 💯💯💯💯💯", "reikijedikatt": "👌🏽👏🏽", "go_shay": "That last part! I feel that way about the theater community right now. So many \"black shows\" are basically struggle porn for white people to engage in a weird white guilt fetish and then leave patting themselves on the back without actually doing any work to dismantle white supremacy. We need to stop making work that asks white people to acknowledge our humanity. Fuck white people, i wanna make work to heal US.", "ms.sativafieldz": "I agree white ppl are into it.", "asa_hndrx": "Ready for the more on this later part !! 👏🏾 also completely agree with Ebony", "pjbonga.17": "@frankoceansbabymother read this 😭😭", "jazzberryjam707": "This is a really amazing topic. I create professional development courses and I really wanted to talk about race in the cannabis industry. Instead of creating an entire course on it, I touch on it in my social responsibility course and point folks to the amazing POC who are doing the work (and doing it with far more grace and skill than I currently possess.)", "b11ackhandside": "WHEW. 🙌🏾", "mamabear_aj": "edges straight snatched! 💇🏾‍♂️", "fammit69": "this is so real. i went to an environmental justice march that i realized upon arriving was by a group run by crackers. tell me why i ended up being put in charge of the whole thing and leading and directing everybody bc these crackers didnt know what they was doing and was happy to put the responsibility of all the leaders there unto me 🙄 a random african who just happened to show up 🙄. like it almost makes me mad and offended how lazy it was- like nobody checked my qualifications or nothing they just rushed to me and handed me the mics and megaphones and put me in charge 🙄", "brown_n_curly": "Wow. Straight up! Also I think that white folks like being called out because because it derails RJ conversations and centers it back on them, their most comfortable spot.", "balicerry": "I hadn’t thought about the way RJ work is capitalized upon by white people in the literal sense. Thank you for this and all of your posts.", "iandamont": "Ooooompf", "arkenjay": "Yes! All this yes!", "favianna1": "Thank you for saying this. I needed to hear this.", "staceymo2.0": "A word!!!!! 👏🏾👏🏾👏🏾👏🏾", "thenapministry": "That kink/fetish part. Yes. My dear friend @therealkristaf has been preaching on this for years! Yess to all of this.", "bria_dorn": "YES!! always putting it in the best words. we don’t exist to validate our experience to the white folk!! or cater to their white guilt. thank you for this", "pineapple_pomogranate": "Lmao I guess this applies to me; in my decolonial work I have focused on talking to white people about racism and white supremacy, like at least planting a seed of thought in their brain because I feel like I might be one of the few oppurtunities that they have in their lives to ever see out of their \"non-racialized\" life and learn the reality of racism and white supremacy. I feel like white people won't ever start examining racism and white supremacy unless they get tipped off by someone who sees the reality of it, which is usually a black or brown person, so that's why I do that.", "ohitsjusttiffa": "That struck me on a spiritual level.", "the_melanin_mrs": "You are absolutely correct. They definitely get off on us cursing them out in some way shape or form. Also I do agree with the RJ issue and the woman’s March 😑 we won’t talk about that because the March was a joke to begin with but anyway. This is true and another reason why I personally feel that intersectionality will do us POC more harm than good. It’s nothing wrong with intersecting I just feel like...... you get my drift. 🤦🏾‍♀️😒", "cindyaooo": "wowowowow", "roze_royze": "Yessssssss !!!!", "vamosqueda": "100000000000%", "pot_la": "👏🏽👏🏽👏🏽👏🏽👏🏽", "king_curtisscottie_saturn": "A real ass question 💯", "alexaphelece\nVerified": "Verified", "cinephile": "The white kink/fetish for being called out (“omg I didn’t knooooow! I’m a good person! But I’m allowed to say this racist shit bc I just didn’t know im so innocent”)!!! Would love to hear you speak on this, pretty certain you’ll be able to articulate it way better than I would!", "bronnysarah": "Thank you for work you do. I have learnt a lot from following you."}