{"the_clinomaniac_guy": "👌👌👌👌👏👏👏👏", "thejoyeetabasak": "❤️❤️❤️❤️", "girinairus": "I would prefer to ignore them. Earlier I would have retaliated but then I realised there is no point in wrestling with a pig. You will get dirty and the pig will love it.", "kuljeetlakra4": "I never agreed more to anyone before on this topic....raw...authentic🙌", "memes._palika_": "Ganja marke ayi ho kya", "the_forbiddenfruit": "So very well said!! Its a little deep for some people to comprehend maybe.. but if you let it sink in, every word she’s saying is absolutely justified and true! 👏🏻👍🏻", "sir_lion_101": "Sorry to say u r hair is goon white let get married 😅😅🔥💖🤣😘❤️", "roloune": "Watch this @_manuniralte_", "anuplahoti": "I would love, if u speak about emotional cheating.", "themoderndesi.co": "@eishachopra what a wonderful talk. You are spot on in stating that we are conditioned to believe that one individual is supposed to be everything for us. Our friend, our partner, our lover , our soul mate etc etc and some people spend all their lives living with that concept and getting disappointed and failing not just themselves but also the person they are with.", "raul_kaul": "Eisha, i respect your opinion and i think you have a point too when you say some one might have a high sex drive or is into multiple partners so its fine as long as they are honest about it to their partner. But i don't agree with the fact that we should consider cheating as an acceptable thing as someone commented on your post! By cheating someone we are cheating them emotionally and thats a huge thing! People don't get into relationships only because they want to be loved and if one day that love stops coming they feel devastated. People get into relationships for companionship(emotional, social etc) and that's such a beautiful thing in itself, there is emotional support and strength one gets from their partner. Yes we shouldn't base our entire happiness on someone but that should not mean that cheating can be an acceptable thing in this generation or generations to come! Please lets not spread this opinion that its OK to cheat!", "pattapumaruthi": "Good work ❤️❤️❤️"}