{"s.behens": "@eishachopra all the best for you and barun🤗🤗 please ignore those fake ids in the name of sanaya that are made only by some of her haters that are BARUN SOBTI fans and do that always to tarnish her image for theindustry people. We are waiting for the show ❤️❤️", "double1nfinity": "This is such a beautiful photo! Thank you so much for sharing it, @thisishowweding. Eagerly waiting for #TGIDF. All the best to you @eishachopra and Barun and the whole team 💗", "caroline_shebs": "Amazing magnificent beautiful Barun Sobti💗 I am incredibly happy that I will soon see his new project. I really like Eisha💗 Very beautiful. I hope these actors like working together. Good luck to the whole team of the web series!", "mm_gala": "You both look lovely together Eisha", "barnieboybarun": "What a hearty smile of bituwa 😘😘 you guys look awesome together and individually like a pair of beautiful and fresh morning flowers in the garden 😊😊😊", "eqra122": "Love uuuuuuuuuu barun miss u 😘😘😘😘😘😘😘", "stgipk": "Best pic yet! 😍😍😍 I love how natural the laughter is and how beautiful u both look together 💞 Best wishes for the show, can't wait to watch 🤗", "adni_shivrun_fanclub": "Barun and Eisha super jodi😍😍😍😍😍😍😍😍😍😍", "nitesh_dubay": "Sanaya irani Barun sobti ki chemistry best forever ipkknd 1 best show", "natidan73": "Fans aunti SI is so mad, crazy like his idol, they asked for job for her, becoze she dont find job for herself, she deverse to act in shamless sperma film with ugly co-star. Si alredy dont like tv shows, that means she dont shoot on it in future. Her fans is cried, they cant do anymore. They dont respect all Barun co-star, aspect SI, they bashed Surbhi Gioti, Ankita Sharma, Shivani Timar, Shahana Gosvami. Attaced Gul Khan. Barun fans dont care about SI, so let u all care about youre idol.", "papatyakokusukadin": "Yaaa yerim ki seni beeen💕", "kanak_9700": "Amazing click cant wait for it after what the folks .😃", "its_me_sagal_200": "This is the reality og so called Barun fans. Creating fake accounts to promote his every show but you will fall flat on the face like shit3 😂😂😂😂 have some shame and make your kiiiiing 😂😜 proud", "anisha._.varghese": "Aww... Look at u guyss.. I am already feeling that vibe..!!! 💗💗💗 Can't wait to watch u guys onscreen..!!", "barun_obsessed": "Wow😍❤", "thequotebuddy": "@eishachopra Big fan of you mam pleaseeeee check my profile💟💟", "ahmedovavenera": "Baruunn😍😍😍😍😍😍😍😍😍❤❤❤❤❤❤❤❤❤😻😻😻😻😻😻😻😻🔥🔥🔥🔥🔥", "jpjinadari21": "Barun💜", "mirkhan6232": "barun", "daisylife11_": "Beautiful candid pic. Waiting. Loved your work in ceogiri", "kittukrystal": "Superb pic , hottest togther ,eisha u hve firecy persona ,Barun nd u both gona kill screne ,can't wait for series", "srinish_fanpage": "😍 This. Cant wait for. samar Sonali", "dileklatrak": "😍😍😍👌💕", "rinkijyala": "Love❤❤❤❤❤barun should be on insta!", "offli3ne": "We are so excited. Can't wait to watch #TGIDF all the best guys ❤❤🔥🔥", "mernamarcoss": "We are waiting for you🙈🙈💘💘💘💘", "barunsobti_rubble": "All the best #BarunSobti #EishaChopra, eagerly waiting for #Samar #Sonali in #TGIDF love you❤", "thephoenix018": "hi @eishachopra..plz ignore there negative comments here..u knw how internet access n being anonymous gives ppl freedom to say anythn...plz kindly ignore... Loving Samar and Sonali already... all the best for #tgidf 💕💕💕💕", "khanamsalma595": "Barun....😍😍😍", "deeps_sankar": "U both look lovely 😍 waiting for samar and sonali 😊", "ramiliamuliukova": "You go with your Sanaya Sigal. Far to you she already said she does not want to be an acto, What kind of a psyche are you behind Barun and Aisha. you have nothing to do. You Segal psycho time for a psychiatrist.", "sunshine_1__": "All the best", "sima_rijvi": "Barun😍😍😍😍", "leylaperihan": "We wish you all the best of the Great Indian Dysfunctional Family team and we look forward to your fabulous array with excitement.", "zaur_a.i": "Barun and Eisha looking so hot together 😍 Waiting for this awesome couple.", "camilacabello_instastory": "Some people using fake account/new account as Sanaya Barun fans and left negative coment in here !! Only stupid people who believed that's Sarun Fans !! 🙏", "shawmila_qh": "Baruuuunn 😘😘😘❤❤❤ thank you for sharing dear @eishachopra 🤗 best wishes for you and Barun 😘😘", "avikra": "You both look lovely together Eisha. Looking fowrad to the series.", "dd8846211": "Lovely", "gayathrimanglavil": "I am waiting impatiently... You both looks amazing together and lot of positive vibes in the frame", "kanchan_somar": "Waiting for Samar and Somali 😍😍😍", "rumki_1793": "Can't wait for #TheGreatIndianDysfunctionalFamily", "asuman.koyun": "Great a pic Sonali and Samar 😍waiting #TGIDF #Altbalaji", "shreyyayaya": "Besstt😍💯", "divya_jagrati": "WWW.DIVYAJAGRATI.COM", "maihh97_": "😍😍😍😍😍😍Lovelyyyyy", "fatima_barun": "Samar❤Sonali😍😍 #TGIDF", "sano447786": "Love ❤ you Barun", "barunsdiwani": "You look so good together 😍😍", "barun_stykrn": "😍😍😍 çok tatlısınız siz 😊🙋😚😚😚❤👏👏👏", "sanayabarun.fan": "Waiting for you guys😍😍", "alaa_world_": "So beautiful 😍😍😍😍❤️❤️❤️❤️😘😘😘😘", "sobtiboy_": "Lovely pic", "amupuri\nVerified": "Verified", "ritikkashwani": "Love widout laughter is Nothing 👎", "reh12222": "Okk i will tell you #barunsobti is so unprofessional and not dedicated to his work he quitted most popular show of television #isspyaarkokyanaamdoon he hearts all of us we all loved #isspyaarkokyanaamdoon very much but he quitted he didn't care his fans", "divyaparthiban": "Love u #BarunSobti 😍😘😘😘😘😘💗😘😘😘", "givemepeacepls": "Sooo good 😭😍😘😘", "anniekasabyan": "Oh, so beautiful pic😍😍😍 @eishachopra & #BarunSobti good looking together😊 waiting for web 😍", "emofopatsiii": "😍😍😍😍👏👏👏 @eishachopra", "themodishallure": "pretty"}