{"punefoodiesaga": "Super❤️", "dilsher_silwaal": "This is something... Jise dekh k... Anyone want to be real vulnerable not just those tricks, youtube get marriage strengthen videos advice.... Just real and most simplest way to be in love....As they call it ,The all time honeymoon effect. Beautifully portrayed the understanding in a relationship.", "dv_1544": "Loved both the series, awaiting for more 😍", "rahul_chaudhari1985": "I am in love of this show!!", "drutihiran": "You & me = home❤️ @__weirdone_", "ravi_rana0508": "Just love your work :) Big fan!", "suyash.xd": "Just an awesome serious😘😘😍", "shubhamtyagi_97": "For a moment I forgot that its a script .. it was so real @riya_t19 I just love this show", "hitesh_1729": "Best youtube series i have ever watched...i just love it so much and always wait for the next episode its like it should never end😍😍😍😍😍❤❤❤", "an_aero_girl": "Whenever a second season of any webseries comes... We feel disappointed.. ! Because we expect a lot more.. Just like in lil things.. Happened.. But this time this one webseries come back with a big bang.. There was a lot to learn.. In this second season.. Much more honest ..n exciting.. N true colour of life n relationships.. ! Thank you . @veerrajwantsingh so natural acting.. ! @eishachopra i guess you are like this in your life !", "aartideshmukhh": "Fav scene❤", "mohit_pise": "One of the best part of the series", "_riddhieee": "The last scene though!! So beautifully developed and captured the Alzheimer’s issue and amazingly showcased. Very subtle, very heart wrenching!!😭♥️", "divbhandari": "I justtttt finished watching and was waiting for next week and then I get to read that this was the season finale! 😣🤐", "navya.mukund": "One of the best scenes of the entire season..lovely❤️", "janani_jayavel": "Could you plz be in touch... Bcoz ur words are so soothing! 😊😊😊", "sohivanstu": "I love this series.....can't wait for more!", "milindbhawsar": "Simply beautiful", "imkamal28": "@bandooni.jyoti ❤️", "inclined_creatively": "When when when is the 3rd season coming ? You know its one of those series which should be on netflix or prime. Awesome cast. Fab job", "artislove_923": "@vishnu.16793 💕", "_swastik_12": "@netraa_16", "_1crazysoul": "i m alwys ready to watch this series of yours,like eagerly waiting type scene hai", "shivsimha": "Beautiful🔥🔥🔥 u both rock....thank u both for these gems💎💎", "manasadeerao": "I'm so sad that season 2 ended so soon. Gonna miss this show so much. That excitement after coming from school/tuitions every Wednesday and seeing a new upload will be gone now☹. Pls make season 3 soon where the sharmas and solankis meet", "mariettevalsan": "Beautifully done!", "vanita_07": "Will miss you guys, this season surely had a lot to teach💜", "harshbarjatya": "Amazing 👌👌👌.... I love it.... Big fan of @eishachopra..", "kunalchhatwaniunofficial": "I cried too.. knowing that this was the season finale..🙁", "bhaduri_rima": "In love with the scene ❤️❤️❤️❤️💕💕💕", "chiraaag_31": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "arpita.mohanty.1848": "I just love this scene even the full episode. Love you😘", "thegirlfromambernath": "@eishachopra loved the second season and the last episodes end just made me cry. Leaving it on an emotional note was very touching. Hope that season 3 comes soon. ❤️💓💕💖", "sanchitmittraa": "Last episode was best! It touched my heart and Ma'am you both @veerrajwantsingh @eishachopra helped so many of us. This web series taught me that how can anyone can face any situation with their family. Good luck for the future!🙏", "mlkonatinoal": "Great ♥♥♥♥♥♥♥ Hope you all the best with your work gorgeous @eishachopra", "baji3798": "@eishachopra mam i have become a fan of yours ❤️ There are many other characters in there but mam u bring that magic and it seems like u are letting us know how a wife a girl n more to that a woman is and how we men are supposed to love thier existence in our lives ❤️ Much love to u and this season is must watch , I just loved it !! Great Work & Love u 💋❤️", "ajitghadge": "@eishachopra I had never got involved in web series but the day I started watching the very first episode of #whatthefolks I don't know when I got involved in such a way that I felt so bad after watching the last episode It was like after food shelter and safety the very first thing I desperately want is the episodes of this series. Lots of love to all the family members who has brilliantly done their roles and I wish viewers including me would get the same starcast in next season too. Last but not the least desperately waiting for the next season. Please be soon ❤️❤️❤️", "laraib_ansari2000": "Love your work... 💜💜💜 sending love from Pakistan", "eshabhavsar": "Love this episode alot 😍 and the last conversation of yours and nikhil was love ❤️😘", "rishikeshpatil05": "Kudos guys Kudos!!! Such a chemistry & soo much of resemblance... Awaiting for your next season 👍", "deela06": "This is one of my fav scene from season 2 💗", "kunwarsahab_royal": "Or aapki mehnat rang lai", "official_aks10": "Thts not fair it was Lill heart breaking episode.... n CNT believe u all end up at this note... please ADd +ve vibes in it", "subha_jit15": "Again I m gonna miss this show... Comeback soon guys...", "alpha_a_n_u": "This conversation was a soul substance. After a long time I came across something really connecting ❤️kudos team", "_renuka2023_": "Loved the entire series💓 #dicemediawhatthefolks2", "chandni_yadav2003": "Hey u look stunning and I love your Series...", "skongara": "Great show, fantastic scene and even better performances. Way to go.", "aaaaakaaash": "One of the most striking scenes of the entire series. Great work by @eishachopra and @veerrajwantsingh in pulling this off.", "anannyaa_r": "I love your dedication! When you share your insights to the scenes and such amazing ones all i think is that - this is how hard i ll work, by giving it my 100% Thanks for inspiring me multiple times in multiple ways🙏", "purusachdev": "SEASON 3 DEMANDED WITH IMMEDIATE EFFECT. 😭😭 @eishachopra @kritivij @veerrajwantsingh", "benjamincartel": "I’m happy with you too. I hope your work situation improves. 🙏", "vijnitesh": "Congratulations to the entire team! Awesome work by everyone and sad that's the season is over :(", "sneha_sonawane": "Will miss u🤗", "saifzaman1994": "can I get goodluck from you for my upcoming exams Please", "marziakarim": "Please come back soon with the next season 😢", "priyanksinghai": "Fan of this. Yew guys inspired me", "s.a.ni.k.a": "Season finale is it over already 😣", "shat_iz_krazy": "Very beautiful scene and the segment of the series... Loved evry bit of reality potrayed in this season as well as the frst! N ur acting is awesome throughout👌😍😘.", "chetna9shangari": "Awesome show in all forms I love the show these kind of shows must be made ❤️👌🏽👌🏽👌🏽👌🏽", "dinesh_bakshi_7884": "Awsome Finale 😊👌", "puneetsampat": "It was an amazng episode this one. All of you are brilliant. The content is fabulous showcasing the vulnerabilities of each character. 👍", "___mermed___": "Sigh ♥️ this is home ...you and me... How crushingly beautiful ✨", "anonymous__1210": "Damn the next moment I'm watching it 😍😍 #exited and this conversation 😍😍💫💫🙌 really could feel that bond 😍💫🙌 don't want it to get it ended tho 😭😭😭", "vedanshi0257": "@devanshi.pathak", "_vikkipedia_": "Best scenes!♥️", "jay24soni": "I love your chemistry with Veer.. And you look so cute..", "isaurabhmittal": "We just loved the finale. Such intense writing overall has won our heart. My wife n I are always waiting for the next episode and will miss no new episode coming next week. The ending of the season was equally heart breaking when Anita Google the medicine name. All the best!", "sudipa____": "Can't wait for the 3rd season 😍💕", "free_between_a_and_n": "U guys are amazing 😍😍😘❤love this season 💞❤👍", "falguuuu": "As in don't tell me this is the last episode 😑", "siddhi.bhatt12": "Loved this scene! ❤️👏🏻", "ptp_dd": "U and me this is 🏡 ❤️ “US” is home❤️.", "kunalrajput17": "Waiting for next season..", "____aakash____._._._": "You two are the best! So is @kritivij ❤️❤️❤️", "milindthatsall": "Whole heartedly waiting for season 3 ♥️♥️♥️,its not just a series its a box of emotions created by you guys♥️🤗", "mistake_manager_09": "Looking forward for the third season", "vishal__khanapure": "❣️", "abhii_wise": "Wtf is an amazing series with different level of maturity content. @eishachopra thank you for an awesome series ma'am.....hands down its one of the best series.....!!♥️", "twinklejuhi": "Lvd d series....waiting FR nxt one", "rachitamshra": "I am sure everyone cried after watching this .. so did I and so many others .. but this was just the best", "n.o.w.s.h.a.d": "You guys are really do acting very well and most importantly, both chemistry is so perfect and seems real. Want to see more collaboration in coming future.", "golu.gram": "The best episode. ❤️", "_bemnu_": "Best web series in ages ! ❤️", "madalsabhattacharya": "My God I love them so much ❤️", "nushykagram": "You guys were amaze", "venkatsridhar5": "Awesome finale.... 👌👌", "shubha_tiwari_": "Had tears in my eyes... watching this... Something that always had been in me... that what exactly is love...in any relationship... be it with parents, siblings or my partner...❤️", "___shrishtiforever______": "♥️♥️😍😍♥️♥️🖤🖤🖤🤗🤗🙈👻👻🌏🔥😇❤️🖤❤️🖤❤️😻😻😻😋💃💕💕💥💌💌💫💫💯", "salman_khansb": "Humne to full episode dekh liya kal hi😊 @eishachopra", "_sunanda97_": "One of the best scenes from this season❤️ can't wait for 3rd season already! I hope that there is a 3rd one🤞", "mimsdebi": "I love you both!!", "ankita.bharti_": "I love you. You're my favorite character. Lots and lots of love from Shimla💋💋💋❣️❣️❣️", "hheenu": "Such a wonderful show👍.. but why does it have to end so soon☹️", "_sara_ansh": "@sharmasimi21 I missed you while watching this whole episode", "prannoynaskar": "Amazing starcast, great storyline", "onmytinytoes": "Aaaeee you'll got matching PJs! ❤️😄", "hunkmunda": "Dont understand the end about the medicine", "happygrapher_hrushi": "Loved it ❤️", "navdeepsoni": "Finale 🤔", "mel_150901": "Loving this couple😘", "__mr_deeevvvv__": "@__tisshh__", "__shweta__8": "Loved binge watching this season... Made me actually cry and smile at same time.. Bond and chemistry of all the relationships shown really touched my heart...", "meghna_shahi": "Hey, it's an amazing series.. Saw the finale episode yesterday night and must tell it was so real n goood that i never wanted it to end!! The story depicted is something which is relatable in today's life, and you guys created magic with so real acting which kept the audience connected to the show🙌Anita and Nikhil is love 😍❤️", "__wingardium.__.leviosa__": "It was soooo relatable....👍👍👍", "i_am_fayyazkhan": "Next season??", "niharpuri": "Nailed it", "iamsamar17": "It was really awesome..❤️🔥 Waiting for the next season..", "ankitcjoshi": "This all is so unrealistic. Lol sitting in that open terrace posh apartment they are talking like as if they are so middle class. Actors are good but very poor piece of writing. It sounds so fake. And one thing I am really pissed at that whats up with so much of hinglish in eisha's dialogues? Feels like a story about townies Lol Giving false hopes to the audience and setting a benchmark for certain kind of lifestyle ultimately making people feel like underachievers. I personally feel that @eishachopra is really not given the kind of role which can do justice to her acting potential. Hope we get some better writers in coming years.", "ashvin3616": "It was really awesome and waiting for next season", "ekanmolratan": "Why ooonnnnllllyyyy 6 episodes???😢", "dennygodhani": "This scene are superb every line are mind blowing Sir", "a_blaaaah_nari": "Thank you guys for this scene. Was so relatable! #FavouritePart. 😘💙", "vishal.tak": "You are awesome, I watched this series because of you, you and your screen husband are soul of the entire series........I am huge fan of yours........Love you😍😍😍😍😍😍😍", "shahidbhandakkar": "It was wow", "arun_ittianath": "Me and my wife 😍😍😍", "kriti_sharan": "🥰♥️", "19_apoorva": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "aditya._.ra": "Best episode till date!!! 😍😍", "ash.ki.asha": "NGUHHH watched it late late at night and loved (but hated cos ending) it so much. Thank you guys for such a good show ❤️❤️❤️", "asthajain5": "@eishachopra this was one great finale with so many emotions and lot of feels!Kudos to your entire team for putting together an amazing show and superb dialogues & writing! Keep up the good work. 😇😍", "occlumen": "I must say very real and from heart acting by all...you rock it completely @eishachopra .", "salonigupta217": "What an amazing episode it was!! Kudos to the team ❤️", "aaban_shaikh": "It’s not easy as everyone thinks 💭", "in_comes_aj": "Loved it👌👌👌👌🥂🥂🥂🥂", "chandana_srinivas_": "Best of all 💗💗💗💗💗💗", "dodhiaamit": "Genuinely loved this episode", "umeshhcsoni": "U jss left us in tears.....", "bghuman95": "I love this to roles nikhil's & Anita favorite your acting mam🎀✌️✌️✌️", "best_indian_astrologer_31": "[[[[[[[[[[[[[[[[[[🌹माँ भद्रकाली ज्योतिष केंद्र🌹] +91-8054417981)( बंगाली शक्तियो के माहिर){astro meghraj shastri}get immediately solution for your all problems}{A to Z समस्याओं का समाधान } 41वर्षो का अनुभव{} contact now=+91-8054417981 call&whatsapp", "swainsiddharth": "❤️ you guys are the best. My favourite on screen couple. :) Well done on creating a very relatable and a feel good show. :)", "kr_stud_55": "When is the next season of WTF waiting for it 🔥", "danny__teamdd": "💓💓", "saurav_mukherjee": "When is third season", "praveen_cyssan": "Lov u darlo", "sonuverma22": "Best scene of last episode", "divya_devshree_puri": "Please tell me there is more episodes yet to come after this....", "hii_m_ajay_______": "It is awesome 😃😃", "simply_shravan": "bestest scene for couples", "unapologeticlymyself_96": "I cannot believe how time flew away and sadly it was the last episode 😔will miss seeing u guys", "sakina.2811": "Why does such beautiful series have to end??", "_kangkanakalita_": "💕", "suyog1_1": "The cofee was real, so were the tears....👌😍", "nehaansal9": "Lovely💕", "vaishnavi_kirtany": "Such a beautiful season.. It has all my heart ♥ you guys rock..", "kunal3438": "Saved forever ❤", "sharmii._.ii": "This episode is my favourite💓", "richa55agarwal": "You're wearing matching pyjamas awwww!❤️", "chitranshikhandalkar": "You guys are love. You are the main reason for me watching this. Tons of love! ❤️😘", "ig_enc": "Mam watched both seasons but this was really a very emotional ☹☹😣😣", "beingastray": "I like the matching pyjamas 😍", "prakrati_j": "@eishachopra @veerrajwantsingh this scene, just took my heart 💓💓💓💓", "ratan_nayak": "Nice episode 6😍👌", "keyurmodi93": "Best line Was ... \"This is the Home\" 👌👌👌👌", "nikhilsugandhi": "The best 10 mins of the whole season. Coffee, early morning talks, understanding family issue still being mum about it. Beautifully created, scripted and more importantly acted. @eishachopra, thank you for creating such a wonderful moment.", "_alma__perdida_": "This webseries just stole my heart for forever!! 💜💜", "thedecemberlady": "U guys are amazing", "ig_adarshsinghal": "@eishachopra @veerrajwantsingh you guys are love😍😍❤️❤️", "brownguyclicks": "This is one of the best no-nonsense YouTube series I have watched till date. How you end each episode with an intrigue of wanting it more. The mood, the well scripted dialogues, the delivery, the cast and the overall production. With WTF and Little Things, Dice Media has a fan in me. I wish the entire team continued success. Keep on the good storytelling. You will always surround yourselves with a good audience. Cheers. 👍🏼👌🏼", "soumyashri.bose": "Loved every bit of the final episode❤️", "rid_bhargava": "This episode is actually so relatable to real life because we really can't figure out who can we share our feelings with or will they understand. This scene is the beautiful and I guess you both make it best and worth it. ❤️ You guys😊", "pratikhiray": "Awesome!💙", "satyaki_16": "Love you guys the entire team of what the folks.Would love to see Anita and Nikhil in all upcoming seasons.Hope you guys come soon❤💙", "shivering.bong": "@samantasnehasmita", "jaya_pandey___": "It's so real that we can't resist watching.. finally Indian series are also becoming practical and worth watching. Absolutely in love with this season and waiting for the next to come. eishachopra you have a long way to go.❤️", "shriyyyaaa": "This scene had sooooo many feelings..Love you both soo much and WTF series too💕💕😭😭❤️❤️", "alokrajk89": "Man this season was such a letdown, compared to the last one. So sad!!!", "priyanknalwaya": "The best 5 minutes in the whole season!!!!", "abhishek_wazalwar": "♥️♥️♥️", "vaishnavi_bhartia": "❤️❤️❤️❤️", "adi_19186": "This season was very heart warming.... Pls Pls keep this going seasons to seasons", "_bunny25_": "@eishachopra I showed this series to my family and there expression was like awesome. They said me to thank you and your team for this series.", "theweissguy2121": "@anvitavaibhav_2109", "saiira.ali": "That's fabulous", "anjaana.humsafar": "Totally Loved it💞💞...you both looks real🌼", "amann_mojo": "this scene❤️🔥", "varad__1602": "Besttttttttt scene in the whole world 😍😍😍😍❤❤❤❤❤", "hitman_3k": "The best conversation 😘😍😍", "simran17k": "The acting! 🙆", "sunny_9317": "Loved the scene ...love both of you..and love the whole cast and crew.... what an ending...you have now left me for asking for more....can't wait for season 3...plz come up with it soon......it's such a realistic and relatable web series... touchwood and God bless all of you....@eishachopra ❤️😇🤗🤩😎", "thelivinglaash": "@rhysdsousa 😕", "ibelieveincrazy": "Love you guys!", "ayan_syanger": "@eishachopra @veerrajwantsingh dat scene looked so real it nearly got me into tears!! amazing acting❤️ 💯💯 #loved it!!", "aranyadasguptasaha": "Will Wait for season 3❤️ These moments are so beautiful ❤️", "theguyonhisowntrip": "I am all praise for the cast and crew of what the folks for bringing up such a beating content towards the people. I have been hooked to the web series and have enjoyed each and every bit of it. I look forward towards a new season from you guys. @eishachopra @dicemediaindia @filtercopy @veerrajwantsingh", "_ritikasen_": "Amazing.....💗💗😘😘 In love with both of you @veerrajwantsingh and @eishachopra 💗💗💗 where will I find such understanding like Nikhil???@veerrajwantsingh", "astralanky": "♥️🧡♥️", "craftd_soul": "I really want to appreciate you for your work and also i admire your look alot... all the very best for future projects😀👍", "thehungryhedon": "Why tears?! Aren’t you guys going to make another season 🥺 what a beautiful scene though , made me call my husband and tell him that nothing else matters but us ❤️ 😊", "thisissodiyable": "This scene was so warm. My favourite episode of this season. So thank you. Nobody else could have depicted the scene or played the role better than you and veer. 🌸 You both are love and always will be. ❤️", "_pratikdutta": "Season 3 awaits @eishachopra @veerrajwantsingh ... Get that soon guys", "kaashifmaybe": "The best 💕💕💕", "bong_chokri_": "Waiting eagerly for your next season eisha!! 😍❤️", "jash_bavishi": "You guys are damm convenience about your character ... totally enjoy @veerrajwantsingh @eisha", "heereshyadav": "Amezing scene 👏👏❤️", "sabyasachi.mondal1": "This whole story is awesome … I really liked it too much. … also learnt a lot.👍👍👍❤️❤️❤️… all people made the characters perfect …", "_srashti_gupta": "Finale is awesome ..... #bawaal 😎", "glassofchaii": "Woah... Amazing season ends...😢 Hope s3 soon", "anupam_thakur4": "❤️❤️", "_.tassnneeeem._": "I saw the last part.. about the Alzheimer's.. had tears in my eyes..😿", "pratikmdik19": "Truly amazing scene 👌", "kaararfatimahshah": "I love this scene it was really hear touching. ❤️ @eishachopra keep shinning ♡ Love from Karachi, Pakistan 🤗"}