{"joshuabalcombe": "Yours are perfect 😍", "missmalissia": "Yesssss 🦶🔥", "ofraronen": "@klm8844", "iamjordanrooks": "Customs? ❤️❤️", "gorgeousfeetpics": "Love this post", "stupotcrow": "Your feet are adorable x", "ishiroc7": "🔥🔥🔥🔥🔥🔥🔥🔥🚒🚒🚒🚒🚒🚒🚒💦💦💦", "rubenvine": "@reedamberx It adds to the intensity of the attraction and desire for someone if they have lush feet 😈😍 petite and nice toes. I read somewhere years ago it is psychologically related to crawling around the floor as a child, obviously where there is bare feet 🤷🏼‍♂️", "jayf870": "How often will you post on reedfeet on Makani?", "linleygene": "But yours are cute 🦶❤️🔥", "vilanoramoll": "من دنبال یه مفعول پسر یا دختر هستم بیاد شمال، نفر سوم منو و دوست دخترم باشه.من خودم خوشتیم و خوش هیکل و کیرمم بزرگ نیست کلا ۱۷ سانته، زیدمم ۲۵ سالشه زیبا و سکسی.یا دتتر بیاد یا پسر مفعول.کسی هست بیاد دایرکت.ویلا دارم خودم.سکس گروهی", "yab8088": "❤️", "awaywithdallas": "Slowly but surely people are starting to be more open about it I’ve loved feet for practically all my life and I had awkward stages where I didn’t know how to introduce it to partners in the past and even doubted myself at one point I also was bullied for years back in secondary school then it got to a point in my life where I no longer cared what people think I did my research about feet in general and everything that revolves around feet and found myself in a way I was then able to introduce it in conversation to partners include my now fiancé And so many women who was the same as you either didn’t like their feet or just thought feet were something you don’t pay attention to in that way saw it in a different way once I introduce them to the whole of foot fetish and how it feels to have your feet played with and how much of a turn on it can be for them in a different way then it would be by touching other parts of the body because of the pressure points in the feet they resemble a lot of other pleasure parts of the body but a lot of people do not know this until they experience it for themselves", "tracykissdotcom\nVerified": "Verified", "dieneue13": "I know quite a few exporters or friends who r into feet and they helped me to find mine cute as well haha I'm normally super open if others hav that preference but I've encountered A LOT of creepy or unsettling guys who wanted me to model for them that it's been years i met a decent and respective foot lover", "naomimoylantorke": "@th0t.process", "enchanted__vibes": "You need to give your DM a check, gorgeous. 🌸✨ @reedamberx", "kiss.abletoes": "You have beautiful feet!!", "barrypompey51": "I thought a lot of women looked sexy wearing their glasses but it was not until I saw reed wearing hers that I was sexually turned on! Then Florence wore hers & it was wow! So we all love different things! It does not make us weird makes us human! 🤓🤓🤓💋💋💋", "questplorer": "Hey Gorgeous!!! You are so full.of energy all the time. LOVE that 🌹❤️😘😊👍", "nigelmeggs": "Nice bare foot", "ericamclure": "i discovered i like feet stuff with my first bf, but didn’t do much about it for years. rediscovered it recently with my partner after he kissed them in the bath 😽", "thepirate85": "Amen to that! Glad it's something you've become so open to and that you enjoy so much! I'm the same way, when I'm with someone, I let them know right off the bat \"Hey, I've got a couple of fetishes. Tickling, and feet. You ok with that?\" And 99% of the time its a yes, but if its a no, then we know that after tonight the game's over. Took me ages to be as open and comfortable with it as I am now, but it just got the point of \"Why bother? Why wait? Just be honest and upfront.\"", "markjones6561": "Your welcome reed amber can I ask you something", "kim.mie90": "So hot", "lamexikat": "@alexarreola4 mi diosa tmb tiene foot Fetish", "harkirat48": "👌🔥", "ryanr020397": "You have the most beautiful feet in the world. ❤️ Anyone would be so very lucky to worship them and be with someone as gorgeous as you. I couldn’t be more happy with how open you are to foot fetishes now. That was very well said.", "outajeffi3ld": "I remember the moment my foot fetish bloomed. But it took me several years to own and act on it.", "bethelbilly": "You have very pretty feet", "aysiaeliz": "Look at that arch", "lukesilvagram": "Preach it 🙏❤️", "tones_cookies_andshyt": "#sexy🔥🔥🔥", "marcusrastasenior": "Natural beauty 4life💯😍😍🔥🔥👍👍👗👌👌💎💎👑👸🌎", "kustomnemophotography": "@reedamberx so cool to read this. I've shot for a couple of foot fetish mags. ( I'm a foot guy too) it's actually been quite hard at times to findodels happy to shoot thier feet. It's a really love/hate fetish.", "liamtabbener": "Your feet are so sexy 🤤", "gronnff": "I have never had a particular thing for feet but you have given me something to think about and I can see what you're getting at. There is definitely something powerfully erotic about super high heels, though they are obviously completely impractical.", "philipbryant180": "❤️😊👍", "addymagic": "How wonderfully refreshing to see you being so open and candid about foot fetishism. I've been a foot lover since primary school (I know), and so once I became sexual, feet were automatically part of the deal! My love of feet has only got stronger as I've got older and had more experiences. In my experience, most women hate (their) feet, and yet if they've been comfortable enough to let me loose on their extremities, they've found it to be exciting, sensual, sexual a mind empowering. Speaking of which, more power to you! 👣💜👣", "jlesford": "good morning lovely 🖤", "cordero90": "Good morning Reeda, looking good baby and nice feet", "brigaboom": "I have always had erotic trip for female feet and I never understood why. The fact is that if a woman we say, less pretty, however, has nice feet (beautiful according to my canon of course) for me it still becomes beautiful. Boh, mysteries of the sexual sphere. I saw your feet in some of your videos and sincerely found them delicious. I don't understand why you didn't like them. I look forward to your images. You already have a lot of sex to tell me the truth. I dare not imagine playing with your feet.", "cattrill_66": "💜🦵🦶👍🙂❤️💕💕💋💋💋💋", "stockwell1467": "You are looking beautiful and gorgeous as always 💋💋💋💋😍😍😍", "t___metz": "You are so pretty😍", "hipposleek_j": "That glint of an arch in the right high heels 🤤", "_undercover_poet": "Can I just say thank you missy for helping me to accept myself as a fella that is sexual and has many things I like and would like to try. I feel like I want to explore and surround myself with peeps of a similar kink and that can help me come out of myself even more so...I’m starting to believe it’s not shady to do so. I felt so much shame from this before and I now feel like I’m a fucking sexy butterfly wanting to explore. Feet are a hell of a lot of fun too...as are soooo many thangs!! It’s funny you talk about feet because shoes sooooo do it for me and have done since I was a teen...I just never embraced it!! Here I am now...not sure where to go but have an open mind and an open heart...the key to my chastity belt is well truly in the river...along with the fucking belt!! 😜 much love to you! Thank you ✌️❤️", "iam.herson": "I’ve always been a fan of yours ☺️🦶🏻", "jamiehalp14": "Would.", "philstringer86": "Nice picture look lovely xx❤️❤️", "c_j_hilt0n": "@liv_hart_", "shin_goji_666": "That smile though🖤🖤🖤", "carl.wood.58511": "I like your photo", "derosa.tom": "🔥", "andrew__serrano": "I have 💦", "citiznd": "There are very few things that'd make me call anyone a freak, and a foot fetish is definitely not one of them 😌", "nadmarwa": "@iamversasacee 😽", "subman247": "There are a lot of foot fetishists out there and I'm onw of them!!,, you do you and your feet are to die for!!!😍😍😍", "krstn_jlnkv": "😍", "heinousanus83": "I just became a fan 5 minutes ago watching u talkin about feet on youtube.", "wlammy": "Personally feet gross me out but yours are so beautiful! Lucky gal 😍", "markskelton2": "To be fair, you do have sublime feet. I'm not into feet, but yours and Jenna Haze's, proper do it for me.", "babeshowsoles": "Great to hear you opening up about your own story about foot fetish, love reading this ❤️ Also it must be said that you yourself have absolutely beautiful feet. 👣", "nicholson4968": "Looking stunning as usual reed 🔥xx", "ladj_low": "Hahaha I love your smile in this photo! Blessings Queen! I’m glad your feet have unlocked a secret pleasure of yours!", "richard.cleland": "😋😋😋", "mojoe.illustration": "🦶🦶", "the_nomad_tog": "Thank you @reedamberx for taking away some of the stigma that this fetish has. We the “foot guys” in the majority are your normal everyday, hard working, family types that just so happen to like feet over tits and arses 👍🏼🙏🏻", "azuldeultramartucci": "show de bola po", "zrolimit": "Embrace your love of feet! 👌👌💌💌", "p.sharples": "Beautiful @reedamberx", "peeweesmith86": "😍😍😍 beautiful as always reed❤️❤️", "vrosash777": "❤️", "rayansuar": "❤️❤️❤️", "petertambyapin": "I can’t absolutely gorgeous @reedamberx 😀😀💓💓😞", "i.am.other82": "Amazing as always, you need to show off those cute little feet more often😍", "rechain87": "Woman’s feet, I’m proud to love them ❤️😍🦶", "mr_blackout_88_": "❤️❤️❤️🔥🔥🔥🔥🔥🔥🔥😍😍😍😍😍❤️❤️❤️❤️❤️", "minniequinn_x": "The last few guys I've been with have been super into feet. It's made me really get into enjoying it too! I love expanding the sexual landscapes of pleasure, so I'm more than happy to indulge. And I honestly never knew I could do so much with my feet haha! ❤️🔥", "xorangepenx": "Wow,what a good read,never been into feet until one of my friends gave me a oil massage, rubbing between my toes and rubbing the arch, I didn’t tell her I was actually getting really moist 😊", "ninafrancescaf": "Mmmmm dem feets babeh", "19eightytwo": "😍💣💣"}