{"alireza.ganjiyan1": "🎅😚😚😚😚😚😚😚😚😚😚🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "champagnejovi": "Very much thank you for this, because I’m literally the same way and this is so simple but yet so inspiring", "akik0sakai": "Thank you for this ❤️", "chriscassidy83": "Ban winter", "hopheadread": "I appreciate your transparency and honesty so much!! 💜", "itscjfranco\nVerified": "Verified", "iaingraham40": "❤️❤️❤️😍😍😍😍❤️❤️ still farting and getting pissed", "hollingswoah": "No it’s patrick", "julietterendersallen": "❤️", "enrikpopaj": "Having suicidal thoughts is not ok people, if you do go check it to a doctor, life is good", "eugen.ionut.94": "Im in the same situacion", "richardplato": "I like to see that you are doing better now", "christian_molyneux": "✌", "ali.darkhal": "🤘🍺 death is a good friend but not today", "johncain41": "Keep smiling youll shine through 🌟❤️🏴󠁧󠁢󠁳󠁣󠁴󠁿", "aquelmismo": "I came across a vid of you and your friend that catch my eye. It was a vid on foot fetish. I found it beautiful, funny and very interesting so I did a bit of a research and got here. Little did I know... first thing I noticed on another page was this picture. It made me cry happy. Thank you for being brave and spreading awareness on these subjects. Depression is a slow killer. Today I drove home crying and thinking “what’s the point of living” life is becoming harder and harder to carry and I needed something. A hug, a smile... anything. So I got home, went to bed and tried to sleep but couldn’t. Started surfing the web and got here. Your bravery made me smile. Thank you. ♥️🙏🏼 I hope you have the greatest day.", "fenellascorner": "🙌💛", "pixlar678": "Great face ❤️", "r0bar00": "Well said Reed. You really are an awesome human being. I wish I’d known you better when we were at Uni. X", "daniboi2012": "Honestly this is so true. Look at Robbin Williams, Chester bedington avici, all very successful happy life’s but behind all the smiles and all the laughter they all had demons.", "agonyalyssa": "👏🏼👏🏼👏🏼", "manico63": "So wise, so empathetic, so caring. Keep flying the flag for better mental health Reed. My champion and mentor. If we were all so open about our problems the world would be a happier place", "peeweesmith86": "Love you reed just a amazing❤️❤️❤️", "adreenaangela": "Thank you for this. Always torn between public image, overheating and being honest. I think the more your public image (and paycheck) pertains to looking and acting perfect, the harder it is to be real and honest. I haven't got to the place I'm brave enough to do that xox", "billy_forbiddennights": "💕", "tabitharayne": "💕💕 So true 💕💕", "henderson.randy": "Thank you for posting about this. The shame and anxiety are less powerful when we can talk about them openly.", "shiroihananokakumei": "❤️🖤✨", "iamjasondewitt": "❤️❤️❤️", "aubreyoddity": "Thank you for all of these honest posts, they always help me move towards accepting things about myself. You are so beautiful and amazing!💜🖤🖤", "dustinrybka": "@reedamberx love this. 🤘🏻🤘🏻🤘🏻", "barrypompey51": "Well said reed both pictures sum it up beautifully! Nobody will ever go through life without suffering some sort of depression! Tablets can only mask the symptoms,sometimes talking with a stranger helps,you helped bring my PTSD to the surface! It was seen as a weakness for a man to cry! Today was one of those days where I just sat and cried! Those two pictures could easily be me,except your better looking! So thank you reed your a good person 💜💜💞💋💋", "zombie_biker22": "This is why you are so pretty, love ya.", "wilsonferro11": "@reedamberx so you just do strip tease I ask cuz idk why I thought you did porn lol I’ve seen you in brazzers camios", "amyharpr": "It gives me so much hope knowing you’re a triple threat like me. I adored you before and now I’m full blown in love with you. Very elegantly put. Any advice for dealing with the above, let me know cause she is struuuuuggling 💚 so much love for you xxxx", "xolonelystarboy": "I'm Sad", "unlucky_vampire": "Thats like 100% of millennials", "cattrill_66": "💜💜 Reed I love all the hard work you have put in to this and you deserve so much more credit for just saying it as it is xxx", "eseduffboy": "Thank you for sharing this. It's important.", "steve_james_ranger": "Well said. Anxiety sucks but can always be overcome", "aurorasjs": "💪🏼", "ashdefty\nVerified": "Verified", "olga_docheva": "Well done! 🖤🖤🖤", "kathie_wylde": "Honey you are amazing x", "itswatty": "This is why I love following you. Absolutely stunning lady but so open about things and always offers helpful and encouraging advice. This is such a good post, I hope it makes a difference to someone.", "drdelm7": "Depression isn’t real.", "lilbruzeevurt": "You are the sexiest woman", "sstarlordd": "Ohh baby", "gavinglave": "❤️❤️", "yolandareginafit": "I started EMDR therapy last week. Tomorrow is my second session. Last week was the first time in idk how long I rode in a car relaxed. ❤️❤️❤️", "gabbarsinn": "Take care of yourself. ✊✊✊💖💖💖🙏🙏🙏😢😢😢", "parisxhk": "❤️❤️❤️❤️❤️", "gilbrius": "Kick it in the ass and bath in the light ❤️", "eastwestdest": "❤️", "admiraltony": "youre among good people here🌹", "clarkey196608": "♥️❤️♥️", "german____inzunza": "❤️❤️👍🏽"}