{"19karaboga03": "u both had sex i knooow", "davidprandox": "❤️❤️❤️❤️❤️❤️❤️👍", "prock112": "Yeah mon 😉", "peeweesmith86": "😍😍😍😍", "majid.z.m.k": "😍😍😍😍😍👍🌹", "blobloblosplat": "Thank you for these words and pictures", "drogrs89": "i am curious how nudist colonies or places feel about male nudist?", "_.its_just_talia._": "💕💕💕💕", "alla.little": "😍 Hey LOVE this....every bit of it....this is the perfect mantra for nudity..... The first time I took my clothes off in front of a camera I felt completely liberated...and came to the realisation that to be naked was just such a natural thing...being able to test those boundaries is truly LIVING...❤️❤️", "dancetosirens": "Can i lick your feet clean?", "the.sensualist": "Yes! We love the message here. Nude it natural 🙌🏼", "alohavagabond": "Not sure you can get away from lust/love if you have someone/couple that you see regularly. Feelings do get more complicated but that’s just part of the dance. Getaways like Hedo are great for random one and done, but life is more complicated than that.", "ryan_davieshall": "@reedamberx It’s not about Catching up... people need to actually Rewind!! Rewind back to the old Days!! At one Point in life there wouldn’t have been a thing of Clothing, Laws or Hating People on there Sexuality/Race... People woulda just been people, because we are all ONE... No matter what our Sexual Preference is or how we Dress.... if only “EVERYONE” could walk around NAKED, (that would be a dream/make life easier), if only Social Media didn’t exist & I beg that ONE day we will LIVE in a WORLD that “NO” matter what you do you’ll always be ACCEPTED;... Because who decides ‘WHO’S’ opinion is Right or Wrong!?... My Theory is just do what you WANT (as long as it’s not touching anyone else’s life) & as you Please because it’s your LIFE!! & No matter what you’ll always be in charge of that... @reedamberx YOUR AN INSPIRATION!!", "sixty6mag": "😍😍😍😍😍", "gillies.crawford": "hot photo", "stuartrouse13": "Beauty ❤️", "kadim.okten.31": "Dogada sexs yapmak cok güzel olur harika 💐💐💐❤️❤️❤️👏👏👏", "thomasalanchristensen": "@reedamberx. Sage advice. I wish I could put it into practice.", "alan_devlin": "I would love to stay there x", "narmda1st": "You been in the grotto yet 😈", "defiantscribbler": "I love being naked 😍", "ruthiejuice": "Love all this. Big one for me was sleeping naked - and due to that, being naked looking in the mirror and doing my toilette (makeup removal etc) before bed and first thing in the morning! Xx", "calenjvanstone": "such an inspiration", "more_milf\nVerified": "Verified", "adam.turner.12764874": "Yummy😋", "roxannehmx": "Yes ambs", "mccnorespect": "@tuna.can___ @llll.mojo.llll hanii bi kere vermenmi bize", "plot_cartel": "Always 🔥🔥🔥😍😍😍", "r_e_d_5_s_t_a_n_d_i_n_g_b_y": "Bum and side boob what a holiday ❤️", "salcotching": "These are gorgeous pics!! 🔥💯🙌🏼", "claytonco799": "😍 You have a beautiful body.", "tiarobertsxo": "Love this, hope you’re having a great time!💓", "harlottscarlett": "👑", "rayansuar": "❤️❤️❤️", "yaniiyanev": "So out of curiosity, does that include massive orgies there?", "stevenlobel3": "Hot as fuck 😍🔥", "kadir.r33l": "Abaza doldu yine aq", "devanholt": "😍😍😍😍😍", "roshanpadiyath": "I don't shame and I never had the feeling of embarrassment 😅😅", "davidabendanon": "👊🏼🙏🏼😎😊", "cordero90": "@reedamberx I know you was turning heads but if you got it flaunt it baby", "killeroftenchi": "Lookin good😍😍❤️", "itswatty": "Great words as usual. You look truly stunning 😍", "stockwell1467": "you look amazing beautiful😍😍😍🔥", "lovereadyandwilling": "💕❤😍", "brum.boy": "😂😂😂😂👏 give me that bum 😮reed", "gcs__": "Freedom 🍑 @reedamberx ❤️", "yusufyahyaoglu": "🔥🔥🔥🔥🔥🔥🔥🔥", "paigeyleigh54": "Thank you for this 💕🙌", "___manolisss___": "You the so sexyyy I love you 🤤🤤😛😛😛😍😍😍", "turgay0ffline": "Uff tam sikilmelik ahahsys", "barrypompey51": "You have a body to die for reed it should not be covered up! It's bad when some people think this sort of thing is wrong! Have fun gorgeous! 🔥🔥💞❤️🥰🥰🔥🔥", "maklaindevoe": "Im mad cuz I was gonna go but would have enjoyed it more if you were there.", "richocez": "Superb", "lil.wiss": "Can i come in?🔥", "tipmanisa": "That frogbutt! 😍😍😍", "mr_viper_": "Sexy and beautiful 😍"}