{"johnsonheartbond": "Who is inside your belly? It seems u gonna have a baby in months @reedamberx", "naomithebutt": "I'm loving the various names for vagina 😂 \"galaxy gashes\" is my favourite.", "tracykissdotcom\nVerified": "Verified", "_.its_just_talia._": "💓💕💓💕💓", "barrypompey51": "You looked amazing reed but I expect that bloated belly did not help! Well done for talking about this sort of thing! It's usually taboo! Being nude I expect the sand went everywhere! Glad your safely back! 💕💕💞💞💋💋", "abu_gana83": "🔥🔥🔥🔥🔥", "p1afc": "looking good bb", "majid.z.m.k": "😍😍😍😍😍😍😍🤠🤠🤠😎😎😎😘", "devin_rosychuk": "You’re dope af. 🔥", "stuartrouse13": "Holy mother of god", "o6_coke": "Show me that pussy", "chunlisa_": "#teambush", "sextalkwitheleni": "@reedamberx love this! 👏🏼👏🏼", "candy_codeine": "Well stayed! No shyness allowed 🙌", "rayansuar": "❤️❤️❤️", "cindyysweett": "Thank you for giving me the confidence to not be ashamed of my vigina. I was always so embarrassed about discharge or hair. 💕", "frasercrossley": "😍😍😍😍😍😍", "chuckytheboy1": "💋💋💋💋💋💋👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅👅😍😍😍😍 Ok Baby", "nimyonders": "Ok 🤔 cool... They say from first conception whilst The Sun succd her tits that God clumsily rammed a young Ms Earth Nature up her vagina by a golden beach. Whilst pummelling, all the sand and seaweed and grit started paccing up there until she squirted out all the species and races to inhabit The Planet... True story....", "peeweesmith86": "Beautiful💖💕❤️", "thenaughtytraveler_hedo": "🔥❤️", "sandymontgomery9042": "1 thing gorgeous unlike some other people on hear you are not shy about your body which we all should be honest with our bodies I don't mind talking or showing my body to doctors even stranger's love well done you gorgeous x 💚x 💚 and other thing you were pregnant and I hope whatever you had was healthy gorgeous keep up your good work 💚x 💚x 💚x 💚", "feedmesteak": "@zosisch the more you know", "hannahmonkcom": "@lydiareeves_artist", "m0rph01": "Depends what your going down there with. I had an unfortunate incident in Dublin with a hirsute girl. Never again. You don't eat meat with the fur on. 😊", "soigneswag": "Galaxy Gashes!! Thats an amazing name for it!!", "lookingforabigail": "@reedamberx wtf lol so you dip your discharge in a pool people swim in?", "lucasjdaquino": "Lot of great info, but was distracted by the number of nicknames you used for vagina. Lol. Cute cave made me spit my coffee, so thanks for the laughs aswell. Cheers.", "thomasalanchristensen": "@reedamberx. Even though I do not have a significant other, nor am I female, I found your post very informative. I wish I knew this sort of thing forty years ago when I was young and viral. Excellent piece. Thank you for sharing. I am sending you a virtual hug and kiss with some platonic affection.", "caitijoey": "💕love the message🌸 thank you for sharing, because we all know how awful the sex-education system is😩", "kel_bel11": "It's amazing what our bodies do for us", "yaz.84": "Always you miss the most important part in the pics", "mohammadhossein___azari": "The kid in the way?", "salomon5436": "❤️❤️❤️❤️", "alexknightarts": "I don't mind shaved or bushy, I don't have any preference at all", "y.oo66": "خیلی کس دوست دارم❤️", "sptyoade": "Belly ❤️", "parsapkz5": "are you pragnent?", "lucas_marinho_raptor": "I love this mole on the middle of your boobs", "y4giz_19": "You fat", "lovereadyandwilling": "This made me laugh but was also super informative.", "shananism": "Sexy tummy 🤤❤️", "yolandareginafit": "This is awesome Reed ✨💖💖✊🏽", "__rukiat": "I’m the same with discharge, can be so uncomfortable but I’ve learnt it’s just apart of my amazing self-cleansing system", "adam.turner.12764874": "Yummy 😋😋😋", "zombie_biker22": "Nice information, it takes a lot for a girl to be happy😂, us guys are blessed with the simplest software and hardware and with bare minimum to none maintenance 😂😂😂.", "georgie_hold": "Love reading your posts.", "matteodiclemente996": "Beautiful", "tenor24now": "“Bloated but at peace” is a friggin brilliant saying — should absolutely be a bumper sticker. 🍔", "madfakrs": "Azmış", "roshanpadiyath": "I love your content. It's worth reading it 😍", "rosexanthe": "Men honestly don’t care about how much or how little hair is down there. They are just happy to have access 😆😆😆 and if they did care, I’d tell them to PISS OFF anyway 🙌🏼", "nikkitten008": "I like both! Waxing is quite convenient and is a bit nicer to my skin, but shaving definitely makes it easier to change up the style down there, which I love to do! Like surprise! My bush is star shaped this week!", "seejosiesmile": "I used to be so concerned about hair and discharge, but eventually I appreciated them for what they do for me and my body. Once I found the confidence to try different things with my pubic hair I figured out how I best like to manage it. Lots of options and they are all valid! 🖤🖤", "annisonmark": "Very sexy and hot babe ❤️❤️❤️😜", "mhmthssn": "🔥 no pun intended.", "gillllly": "🏆🏆🏆", "thegirlwhotakespicsphotography": "🙌🏻🙌🏻😍", "grvmmvh": "J'aime", "davidabendanon": "👊🏼🙏🏼😎", "dalekshavewon": "Love you so much xxx😍", "paigeyleigh54": "Amazing galaxy gashes. Incredible. 😍", "steveit58": "Chew on a non hairy one 😘👅🤣😎", "hip_hop_historian": "can u show us your love cave next 👏🏾", "dimazelenkov": "9 months😂😂😂👍👍👍 Holliday rules"}