{"linleygene": "After looking at your picture! I'm in tears! ❤️", "puh6tfrz": "Hello Reed. Do you have an exercise bike at home? If not, I would strongly recommend buying one. When you're feeling low and can't bring yourself to go to the gym, you have the bike right there. Start pedalling and you'll feel the benefits from the endorphins. Exercise can make a massive difference.", "dwrwlf": "Stay strong people in your life need & love you!", "herbylou": "I swear the universe is up to something, I really needed to see this post", "andresilvabullett": "all the best", "officialtosh_": "Can totally relate to this 💕 thanks for sharing, sending all the love xxx", "acalculatedrisk": "🖤🖤🖤", "pscholes79": "Iv never looked at someone n want to hug them then you", "amberkay.x": "You da best miss you xxx❤️", "drsmashlove": "😍😍😍😍", "nerdf33t": "I'm seeing a therapist for the first time tomorrow. Any tips in a pm would help me Reed x", "rashadx2k": "Anyone ever tell you that you kinda look like Emilia Clark?", "inderjeet5714": "Sweet dreams", "eddie.jackson_69": "But you have to do one thing first ask God to help you out and he will beautiful.", "jemjeanie": "I love this so much, just recently decided to go and get the help I've probably been needing for a long ass time. Its so difficult with a system that makes you feel like you want to give up with trying to get the help you need/deserve due to it taking so long waiting for a counsellor/therapist. And finally getting to the bottom of all the \"why's\" im still not there yet but im hoping to get there eventually! Lots of love to you and your open and honest ways. 💗💖", "ehsangoli1372": "😢", "dimitrova_monica_": "thank you for this. I booked my first appointment and I'm terrified but also excited, I'm so over this and I'd do anything to make it better. I appear like an extrovert, the always smiling and cracking jokes person, when the reality is I have a crippling anxiety with occasional panic attacks. Can't seem to make myself go out of the house, or if I do-panic attacks. It's no joke.", "boldhercreative": "Thank you for being so transparent and vulnerable with us. Being open about mental health is so important.", "raebearlawl": "I’ve been building up the courage to go over the last few months. Talking to a stranger about my problems seems like such an odd thing, or like something I think wouldn’t even help, but I don’t know for sure so I’m willing to give it a shot.", "lensational_uk": "@reedamberx IRS a very brave thing you have done in this post and I wish you get all the help you need and you find a way of getting through each day and a smile, a real smile will cross you face soon. X", "cjwill_travels": "Sooooooooo Gorgeous 😍", "nicholson4968": "Chin up girl you can pull through this 👍", "shaun_knows": "At least in these photos you can see you are trying to make a effort to make your self feel happy again with beauty treatments.. happiness is hard to maintain 24 7 inside but you can be happy with your self when you achieve happiness for others who are living with out the trest things in life. I give back to the community and wild animals, especially hungry ones ❤️ a lovely post by you miss Reed. ❤️ stay strong honey", "dvkvri_": "So February was a shitty month for you huh", "lususluce": "thank you for being real on here xxx", "scotty_woop": "Well done for seeking help and it's brave to be so open and honest. Hope you begin to feel better soon", "lastraven1986": "Not up on everything so excuse the ignorance but in matters of mental health isn't it what you thought that was important? If you feel like you're doing well shouldn't that translate into actually doing well? Or is it just ostriching putting on a brave face", "jagermonkey": "I had CBT last year after being down for over 10 years. It's was like a light bulb switch after a few sessions. The home work is annoying and I always ended up rushing it on the day. Made me realise the good I had in my life.", "thezaralucy": "You are strong reed, remember that, especially for sharing this. MH is no joke so keep doing what you doing to make yourself better, in the process you are helping others 👑🏆🔥♥️", "jeklahh": "If you ever want to just talk to someone, you can pm me", "henrydell": "Sending you love and if you ever want a chat drop me a DM ❤️", "official_jam_1203": "U look stoned lol", "dean_zaman_9_": "Awww bless you babe and you can get through this metal illness just stay positive and talk to your family and friends how you feeling and keep seeing the therapy what your problem that you deal with and how to fix it and also be strong women and I waych your story on Instagram I know how you are feeling I know friends who deal with metal illness and what their are going through and keep them positive and I give support no matter what happens and you and @florencebark I enjoy watch Instagram story talk about sex and I sometimes get shy and scare talk about sex but with you girls you give me confidence and important to have safe sex as well keep up with the good work. ❤️👍🏻 @reedamberx", "yolandareginafit": "Yes yes yes .... I’m a constant in the land of mental illness. I just ride the waves. With and without therapy. Hope you feel better by any means beauty 💖💖", "etiennecarter": "Hope you feel better soon 😘", "mick_939": "Please stay strong ❤️", "ghoshyogieve87": "💖🙏🏼💖", "pell156": "😊", "amandajohnson_84": "Sending love honey. Hold in there ride the wave. Xxx", "alephreal": "Thank you for sharing your story. Big love and hoping there's not too many bumps in the road ❤️", "petrarch__": "Love this! But also feel that we shouldn’t shame anyone who needs to use antidepressants No they are not a long term fix most of the time, but they are something that can really help people start their healing process ❤", "sophie_coady\nVerified": "Verified", "marcusrastasenior": "Such a beautiful pretty cute adorable gorgeous face and your eyes are just sensational😍😍😍😍💎💎💎💎", "coolbeans2560": "I've been wanting to do therapy for a while now... it's difficult to find the right one. thank you for always supporting mental health things. one day hopefully there won't be all the stigmas that surround it. ❤️", "michaelamos1973": "👍very true.", "julietterendersallen": "❤️", "alan_devlin": "I hope you're feeling better x", "joelfixen": "❤️", "sinbad_cc": "But good to see you smiling again xx", "rishi_993": "❤️", "abi_lou": "❤❤❤", "jack9425": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "candy_codeine": "Crushing it baby! So glad you share this very personal message, and your journey might help others be more cognizant of their own challenges when they realize we all go through high and lows. Nothing can be all happy and perfect a 100% of the time.", "lucaswbrowne": "Beautifully said. I've been there as well. Stay strong. Still beautiful in pics👌", "r0bar00": "Hey, if you need a friend, someone to talk to, I’m here me’ ol’ Uni mate x", "jlesford": "♥️", "frank.marcha": "My momma always says, this too shall pass. dig your earing😊", "skrivandebcn": "Wise words. Know what? You look lovely in these pics too.", "barrypompey51": "Am glad it went well at therapy,I know myself that antidepressants only mask the symptoms and can make you feel like a zombie! Having good friends & supportive family help! It's better to cry than hold it all in! Your doing well reed thank you for sharing your experience with everyone 💖💖💕💖", "manny_o_war": "Brutal. CBT actually raises my anxiety. Something I’m trying hard to work through. It’s so true. You can’t fix things with medications. We can only mask some of the symptoms. Thanks for the powerful inspiration.", "cattrill_66": "💜💜big hugs and lots of love 🍕🍕🧀🧀🍨😘💋💋♥️💞", "daveluckins": "Hugs x", "emilywachtel": "Beautifully said ❤️", "manuel_cameron_d": "You are such a kind woman, lovely, whish there were more people as beautiful as you, all the best for you! You are an inspiration", "paul_musto": "I get the absolute feeling that there's no one to talk to but from what I've seen you have a partner that is and would be there for you in an instant. I don't get how you can be so down on yourself when you have someone there for you all the time. I have family but no one outside that because I don't feel I'm good enough for anyone to put up with my shit. Like you said maybe therapy could help but I'm now 40 and I see no way out of how I am or how I live. Plus the relationships I've had when I have tried to let myself go have ended in shit anyway. Not a great ego boost by the way.", "jason_carpets": "Hold your head high bonnie lass!", "shannonvartistry": "Man, i feel this. February has been such a horrible month for my mental health! No particular reason, just is. Today & yesterday are the first days in 3+ weeks ive felt hopeful and back to myself. Really hoping it keeps up and I hope you can start feeling better again soon, too 💗", "paronloka123": "Lots of hugs! You rock! ❤️", "notabirdnotaboy": "♥️", "maridlugosch": "Hey Reed 💕 my boyfriend was diagnosed with OCD a year ago and it‘s been so hard for us to adjust You have no idea what it means to me to see you represent those kinds of health issues on Instagram and for the realness and also the strength you portray Thank u girl, you‘re an absolute queen and I love u! 🥰", "sarah.mulindwa": "♥️♥️♥️", "kidflip360": "Nice smile", "lmradford": "Thank you for sharing so openly. Sending lots of love.", "lozloz25": "Sending love your way xo", "darrell.edmondson.33": "Dear amber u may not like hearing this but u are one amazing lady who wears her heart on her sleeve beautiful inside and out u may feel yukki inside and out but there are people who see u as u are nothing more than that I hope u have a good weekend and remember be kind to yourself", "gcs__": ": ( ♥️", "gazcrooksculpture": "Thank you for sharing, it is so important. 🕊❤️", "themistermarqs": "Stay strong. You are always inspiring, and please know that the truth and beauty you share with the world makes a difference. All your Instagram fans are pulling for you and sending you aloha and best wishes.", "mrunal_h": "Sending love 💕 more power to you ❤️", "lovethemadness13": "Big hugs.", "curvyra": "Sending positive vibes to you sweetie xxx", "ruthie_toombs": "@ohmadelynne", "daisyt_m": "❤️", "shellynicmon": "Sending you all the love and hugs xx", "luuontheloose": "Agreed. We're really our own worst enemy when it comes to seeking help, but more so RECOGNIZING that need for help. No matter how small that issue may be, it can grow over time. Like cancer. You have my support and love, Reed. Yes, at first, you were just eye candy for this cisgender, straight Peruvian-American man. But the more I watched your sexual education, behind the scenes fun and talks on real issues, you became someone I not only respect, but also care about, despite not knowing you on a personal level. If anything bad happened to you, I would feel that. So, my wishes and support are always there for you. You're a friend.", "lymekhaleesi": "Aw that last one ♥️ thank you for sharing #rawopenhonest babe keep chuggin and doing all that hard internal work! Many are too afraid to face their demons within. Very proud of you 🙏🏼 Thank you for being so #real", "marinaxmaya": "I was attending CBD sessions when I was at my worst but I had stopped attending after a few sessions because at the time even just getting to the appt was a struggle for me. Over time I learnt to retrain my negative thought patterns and try to stay consciously aware when I do! Just keep yourself around all things positive including your space 💕 I hope you feel better soon lovely 💜", "fittonchris": "Ive done a CBT course which was online run by Silver cloud but through Healthy Minds which covers Mental Health in my area. It did help alot I had to do 1 module a week and it was assessed by my psychological well-being practitioner and after completing that course a couple of months later ie jan 20 I started and just completed Live well long term condition course as my physical injury affected my mental health as tbh i wasn’t in a good place but still have low days as i know its not a quick fix and its still going to take some time", "xxpparis": "This is so true & I can relate 100%, the only time I reach out to my therapist is when things have gotten TOO bad ☹️", "missmarissalalo": "So true. F.E.A.R. Fear, ego, attachment and refusal. Our pain is always tied to one of these things. Funny how the first letter of each one creates that word. I don’t know how old you are, but it definitely gets better as we mature. All that beautiful youthful passion burning is tough. Glad you have found a therapist that you can relate to. 🌸💚🌻", "rammyphoenix": "Big hugs @reedamberx hope you’re better soon", "big_tibbz": "Keep ur chin up 🌹", "littleredonline": "Totally relate, and to that last sentence especially ❤️. It took me so long to even think of it as an option, despite having TWO therapist parents. Somehow didn't think my experiences were 'bad' enough to warrant me getting help. The strongest thing we can do is take care of ourselves first. Love you so much, so proud of you for being a powerful voice of balance and honesty in this weird online word. See you Sat bubs ❤️", "denisecb1": "❤️❤️❤️", "eekrotica": "❤️", "claresinstapage": "Sending you all my love @reedamberx ❤️", "brum.boy": "😂what with face Yes Reed how cute bum😂😘💯", "phreyya": "Thankyou for this xxxx", "theganfy": "❤️❤️❤️❤️❤️❤️", "mattcurtis1980": "❤️", "benamara.othman": "The thing is something become so engraved in our subjective reality that we don’t see that those things are wrong. A fresh pair of eyes and a specialist with good discernment is something extremely valuable but knowing that we need help and making that step are incredibly hard for some ppl. More power to you, it’s very brave to share this and I hope you get well 🙌", "tessa_ndj": "Good luck Reed ! You’re an Inspiration ✨✨ self care first !", "makeupbydorothy": "yes Reed!! 👏🏼 you're so brave for sharing this", "kierantee": "Love you ur a intelligent and caring person", "artistamarta": "Wow, thank you so much for sharing this! 💪❤️", "philstringer86": "Nice picture look beautiful reed amber xx❤️❤️", "jonnyspa27": "@reedamberx I wish you ease at this time. 🙌💗💗💗", "3rdlens.studio": "Bless you sweet one. 💛 Truth is the balm we all need right now. Thank you for sharing your vulnerable tender heart.", "oloni\nVerified": "Verified", "luluerglis": "❤️love your posts. Surely the are helping lots of people. Keep doing the good work.", "megan_may__": "Love your honesty so much 💛 sending some much love your way ✨", "porterbhoy": "As a sufferer's of MH myself Reed amber LM thought s r with u💯 percent ⭐😘♥️", "clara_sideways": "Amen, sister 💪🏼", "hannah_clarebam": "🙌🏻🙌🏻🙌🏻 I love this level of honesty!", "becky.j.s": "You are WONDERFUL. Admire you so damn much 🖤", "dimazelenkov": "??? Good content", "bellabimbaxo": "Omg i looked all puffy in the mornings this week too. Never fall asleep crying hahah or you Wake up looking like a 🐡☺️ i feel u girly ❤️❤️❤️ i wanna hug u"}