{"ladj_low": "That’s right! Be proud in what you do, and how you do it! You’re amazing Queen! Bless you always! Sending you positive energy, blessings, protection and love! 👏🏼❤️🙏🏼", "tiarobertsxo": "Truly in love with you and everything you stand for. Thank you😘😍", "occasionally_chelsea": "Fuck yeah!! 🙌💗", "arran1512": "But at the end of the day it pays the bills darling but whatever people think I’m proud of you xxx", "beautifullyflawedbean": "YEEEEEEEEES ❤️❤️❤️", "mo_uddin90": "Camel toe😈", "glenny_archery2d2": "A wonderful and interesting point made. Can I add that there is also a stigma attached to those who make some use of the sex worker’s services. Whether it be actually paying to have sex, or simply subscribing to an adult channel on the tv or a webcam provider, and even those who simply view porn on a computer or mobile phone. And perhaps more so for people who like myself are somewhat older, being regarded as a dirty old man or a pervert. I have enjoyed looking at the naked female form for as long as I can remember, and still do in my 60s. It makes me human, and a red blooded male one at that. And from the early days of Page 3 in the Sun newspaper to the numerous places on the internet, I salute all you sex workers. It doesn’t make you or I, bad people...", "songosongs": "You and Florence's work to educate and advocate sex positivity saves lives! Keep up the great work! Love from the US.", "claude_knight": "Inspiring me to be my true self everyday ❤️ keep shining bby x", "bad_fro": "Love it", "lotus_dmj": "I think you’re such an awesome human Reed. I love your attitude to life and feel you would be a special friend to have. I bet you’re always rooting for your tribe and are full of love for those you care about. It’s how you come across and is your authentic self. 💜", "msmayafelix": "you are amazing. brave. inspiring. ICONIC. ♥️", "emilymalice": "🖤🖤🖤🖤🖤🖤🖤", "cherryrevolution": "YOU!!!!!👏🏾👏🏾👏🏾👏🏾💛💛💛💛💛🔥🔥🔥🔥🔥🔥🔥", "margethemav": "Thank you Reed! You’re such an inspiration. I love how you speak with your chest and how open and honest you are. I’ve been thinking about getting into webcamming and porn recently but I’ve struggled with the attached stigma. Knowing there are people out there like you helps so much. 😘", "myfingerisonthebutton76": "Love this open , honest account . Sex work is work. It's provides an outlet for both providers of services and those in want and need of services. There will always be a stigma attached to it which people feel they can use to criticise and judge. Sex workers should stick together and support each other. X", "spisceycapricorn": "Your honesty, vulnerability, and reclamation are so badass ❤️❤️❤️", "moontremors": "Hey lovely, I adore what you wrote, and I admire you deeply🌺. There's one thing that sounds a bit strange \"how that many people think that sex work is disgusting or not a real job BECAUSE we only think of sex work as doing hardcore porn or escorting\" - this sentence makes it sound as if you think that hardcore porn or escorting are disgusting or not real jobs. As if the belief that sex work is disgusting makes sense if people only think of porn or escorting as sex work. I know you probably didn't mean it like that, I just wanted to say that it could be interpreted in that way, like looking down on that work. Sorry for being nitpicky, I'm just very passionate about this too 💕", "sebcw1992": "Sizzling", "menswear4711": "🙌🏽👏🏽🙌🏽👏🏽 well said xx", "quad.face": "You are perverted and whoever mentioned me.", "levi.smith.33046736": "Id love to worship your gorgeous feet 😍", "davidb0473": "A powerful statement Reed. Always be proud of who you are and what you can do to help others through your communication skills.", "jamestheking64": "Beautiful feet 😘💞", "jlesford": "♥️", "manico63": "I love how you articulate your thoughts. Said with pride. I'm proud of you gal. With you all the way.", "pllvw": "@reedamberx 💥!! You got the love...", "hannah_clarebam": "This 🙌🏻", "smith_kimber": "So true love. I have nothing but respect for the sex industry. On a side note, you are drop dead beautiful. Love your fetish pics in the latex. Thanks for sharing yourself with us", "_.lust_is_the_new_love._": "The way you say it all🙌🙌", "thepyramide": "😍🔥", "curvyra": "Well said. Massive respect 👏🏼 xxx", "nigelmeggs": "Cute toes", "lymekhaleesi": "#noshame so very proud of you. This photo is so vulnerable and intriguing. Thank you for sharing your beautiful self with us. WE ARE THE LUCKY ONES. You are stunning inside and out and have played a pivotal role in my recent sex journey. Because of your podcasts and education and open discussion, I’m exploring my #Pansexual identity and it’s so incredibly empowering. Not only that, but we as a unit are exploring #polyamory ♥️ I feel so grateful for finding yours and Florence’s podcast 💋💋 keep up the incredible work you’re doing. You’re teaching lives all around the word. Love from California 💋", "lastraven1986": "Personally I've found prudery and openness go in cycles and the only difference seems to be safety as people will still consume sex regardless of the public's shift", "woz_b_": "🤘😘", "lydiaflorencewd": "😍😍😍😍", "carminamasoliver": "👏👏👏", "devanholt": "😘😘😘😘😘", "cstsstrxs84": "It would be better without :p", "jjjjason1": "I greatly enjoy your work .u seem a very down to earth girl who happens to be confident with her body.", "nicholson4968": "👍👍👍", "bananachip93": "I look up to you 💕", "stuartnoonan48": "Ur very sexy 🔥🔥", "alexandraroach1\nVerified": "Verified", "vanitasevedute": "🖤", "hurricore": "😍😍😍 😋👌👌", "__rukiat": "👏🏿👏🏿👏🏿 also FUCK SERFs", "kittyunderhillx": "This is SO great, keep fighting the stigma! 🙌🏻✨", "arrondaprince": "Very sexy xxx", "rcorpuz73": "Have a great day!", "davidsimper55": "Crikey! 😮", "rhiannon_eliza": "T h i s s s 👏💯🔥", "sophie_coady\nVerified": "Verified", "fabianomcgrady": "Red 😍💙", "clarkey196608": "I think You're brilliant You know? i may have told You that before 😂😂😂 xxxx", "decembersagittarius": "So such respect for sex workers ❤️", "marcusrastasenior": "Wow you are a smoking red hot flawless sexy as hell beauty queen💯😍😍🔥🔥👍👍👌👌💎💎👑👸🌎", "mfarhan.in": "Is she a porn star??", "r_portfolio_": "Why do you try out being an adult performer?", "simwise": "Love this ❤️", "xxpparis": "🗣🗣🗣 100% agree with everything u said x", "barrypompey51": "One final thing about the Amazon wish list! It's what it says wish! I can honestly say reed does NOT solicit gifts off people! You tip taxi drivers etc & sex workers are no different! Sorry I had to say all this cos I care so much! 💜💜❤️", "s66cams": "Ur a gem darling 💎", "frank.marcha": "You just be you.. ❤️", "porterbhoy": "Reed amber💯⭐v🌹and a great inspiration 2us😘♥️", "jakstarrr": "👏🏻👏🏻👏🏻👏🏻", "cattrill_66": "😊👍😘 you are are a proud sex worker and I am surprise proud of you for what you are and what you stand for just being a little part of what you do makes me very happy keep it going you are truly a beautiful amazing person with all your have to deal with 💜💜🔥🔥🔥💕💕💕💋💋💋", "kingbreezy_6": "😍😍", "metalmickey1973": "Sex, exploring your sexuality should be considered as fundamental as providing food for hungry people. Both are as equal and important as each other and thankfully there are beautiful women, like yourself, to provide that service ❤️", "vizualography_": "🔥📷🔥📷🔥😍", "louvmeplease": "Absolutely 🙌🏽❤️", "minniequinn_x": "You're such an inspiration. Totally applaud this 🔥❤️", "skistylez": "🔥🔥🔥🔥🔥", "realovecstasy": "You go girl!!!! Fire!!!! 🔥🔥🔥", "beardedcrag": "Pretty sure alot of the bad stigma is just people jelous you can make good money and enjoy your life at the same time..", "pamelaaa___m": "❤️❤️❤️", "3rdlens.studio": "Beautiful, honest and in your power with it. 👏 Bravo.", "0pen_m1ke_kn1ght": "If you're happy, not hurting anyone and no one is hurting you; do it and be proud of it.", "moffat605": "👍", "realitylovestory": "Do what you want, just be happy 🙌🏻🙌🏻🙌🏻🥰", "gazcrooksculpture": "✊✊🕊❤️", "chaylabellman": "Girl.. seriously my inspiration. 👏👏 your courage and bravery.. so empowered by you on a daily basis.", "missloujasmine": "YAASSSS!!! 🙌🏽🔥👏🏽", "nullavalemike": "Thanks for being open", "xtina235": "👏🏻👏🏻 💯 well said!!", "aliceandevil": "Love you.", "reedamberx": "Image by @vizualography #realitydisclaimer looove doing this shoot dressed as a sexy robot prostitute mistresses from the future. Had to blur our the see through knickers though! 🤣", "aldelaparra": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥Always proud of sex workers 💚💚💚💚💚keep going", "erikalust\nVerified": "Verified", "njd1985": "I love reading your blogs, and think you are amazing in many ways x"}