{"blackichan21": "Why do I find myself holding my breath when you do in this @reedamberx 😂😂", "bossd_75": "😍🔥🔥", "jimhecker44": "Amazing video, thanks Reed", "hhh396": "You're beautiful no matter how you pose!! 😍😘😘", "katieluptonphoto": "@xbethcarlenx", "slowdownyoga": "oh my god, I love you. #soreal #sosexy 💯❤️", "meganmcbrideee": "Love her sm @magdatama_", "outafter_dark": "I really needed this right now and love you for it💕", "that.wierd.vegan": "The thing is I just have wider tips so I will never have the ideal body type just because my ribs can't freaking shrink lmao plus my legs are like super lean but they're not big at all it just won't happen lol I'm just verry proportionate??", "surender.mehla": "Goodnas🌹", "sunkarthikeyan": "Thank Goodness There are Women like you out there @reedamberx 🌹😍❤️ ... To let know many other Human Female Species that they are beautiful too without looking like a STICK. 👍🙏👏", "tosha.verbatim": "I think everything needs to be approached with caution. Sadly, it feels like nowadays slim women who are naturally slim (and get called STICKS or worse (which is considered bullying)) are made to feel like shit. And women who choose to have breast implants are also massively judged. There’s no need. Women should have the right to be and do what they want - no judgment. If someone doesn’t like their heavy body or their slim body and wants to change that that’s their right and to be done with no judgement. Of course social media has a weird pressure that women can feel coz so many women still pose very unnatural like you’re displaying and bringing awareness to in this post which I massively support. Also let’s be honest. It’s other women who are mean to other women. This is the largest problem in society and why women have such a long way to go when it comes to women’s rights. Women don’t even support women so how can we expect anyone else to?"}