{"aurorasjs": "🙏🙏🙏", "lydiamok": "Same same same!!! Recently had a photographer photoshop TF out of me when I'd clearly stated I didn't want any photoshop done to my body. I. am. not. your. fetish.", "frankgutcher": "No edit required!😍", "rashadx2k": "😍😍😍😍👍🏾👍🏾👍🏾👍🏾👍🏾🔥🔥", "master9861": "Damn!!!! ❤️😍🔥😘", "timseruk": "Stop being so naturally perfect please 👌@reedamberx damber", "vailmain": "How do I meet you!! I want a hug from you", "iam_ghetto_rich": "🔥🔥🔥🔥", "shin_goji_666": "😍🔥🖤", "smccready83": "That ass is absolutely asstonishing! 💜 😍🙀", "trianglewaverecords": "You do you, which needs no photoshoppin’", "paulevans2020": "😍😍😍❤️❤️❤️❤️", "gyboconsultancy": "Fabulous message for all ❤️", "fatihzen16": "o göte bülbül öte", "stringunner": "Nice", "claytonco799": "😍", "pete.6618": "Gorgeous bum", "buckley4579": "U look amazing reed xxx", "el.maldito.barba": "🔥🖤😍❤️", "matthewgiesen": "I would eat that but for breakfast, second breakfast, elevensies, brunch, lunch, afternoon tea, pre dinner snack, supper, dinner, desert, midnight snack and have seconds every time. Even in the middle of the night so U wouldn’t have to go six hours without", "thefastelaine": "What is your glutes workout?", "treignstation": "🦁🍪", "laurindo_martellohotmail": "Belíssima", "beauty_is_found_in_the_heart": "Love your shirt & blasé expression ❤️", "tiarobertsxo": "😍😍😍", "stockwell1467": "😍😍😍😍so 🔥🔥🔥🔥🔥", "speedospee": "You're perfect the way you are ❤️❤️", "cbtaylo": "😂😂😂😂", "ladj_low": "Love that too and yes no edits on you! You’re wonderfully made", "gazcrooksculpture": "You don’t need editing. #naturalbeauty", "jdfddy": "🔥🔥🔥🔥🔥🔥", "missmarissalalo": "Another great message for young women who follow you. 🌹", "yessirsisenor": "love honesty beauty no to filters and photoshop", "jack9425": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "campi.al.alba": "You are amazing!", "zombie_biker22": "Thank you.", "panagiotis_varelas": "Come to Cyprus baby my friends want 2 meet you 💖👌🌡🍽😜", "linleygene": "Ps! Hope your well! Duchess! 💋❤️🔥😍😘👄", "carootj3": "♥️🔥", "vanitasevedute": "🍑", "ichatter180": "Absolutely beautiful 💞 💕❤️💖💗💋xxxxx", "aldalilja": "Í appreciate this message! And also the photo 😍", "invisiblecabaret": "Love the reality disclaimer you put on your photos! Such a beautiful mental health advocacy move x", "chanelbabyxox": "😍🤯😍🤯", "marcusrastasenior": "Wow you got one hell of a figure so delicious and dreamy💯😍😍🔥🔥👍👍👙🍑🍑👅👅👌👌💎💎👑👸🌎", "daniel_keys65": "Wow sexy and hot 🔥🔥🔥🔥🔥🔥🔥", "shellynicmon": "Just sending you all the love for this! ❤️❤️❤️", "bellabimbaxo": "🔥", "dead_boy_elite": "🌸", "lymekhaleesi": "Too proud of you and all that you represent and stand for! ♥️", "anthonymullarkey5": "O what a gorgeous bum you have reedamber❤️", "stephen.burke.108": "You are one of the most amazing lady’s out there an so Beautiful", "sergioeam": "Cadê a bunda? 😂", "nicholson4968": "Wow you do take a lovely picture x", "akik0sakai": "100% !! You beauty ❤️", "decembersagittarius": "So beautiful ❤️", "ovobns": "Danm she id bad", "alan_devlin": "🔥🔥🔥😍😍😍😍😘😘😘", "_.its_just_talia._": "💓💓", "rinaellisx": "Beby you don’t need edit I like u natural dear mmmmmmm💕", "nerdf33t": "That was all great until it turned into an advert at the end...", "davidabendanon": "Go girl...you tell them 👊🏼👊🏼👊🏼.....🙏🏼☺️", "salter_lovelife_x": "A great photo and your lovely natural curves 😍👌❤️", "youatyours": "The amount of people that refuse to work with me because I don't use Photoshop goes to show there is a lot of work left to do! Thank you for exposing this issue further. Gorgeous woman ❤️", "sweetyluvspapa": "You don’t need any touch ups, or edit on your pics. You are absolutely gorgeous all natural. 🔥🔥🔥🔥🔥", "chef_keif_a_lot": "Fuck YES!!! Your body is beautiful and your soul is fucking gorgeous!!! We need more women to adopt and embody your beliefs on editing and owning one's own awesome uncut!!! Bravo!!! 🔥❤️🔥", "barrypompey51": "Your not only beautiful on the outside but on the inside where it counts too! We are lucky we get to see a lot of your photos for free! Thank you reed 💞💕💖🥰❤️❤️💗💗💗🤓🥰", "juliovale": "Love u reed 🔥", "todiveforuk": "We tend to only use editing to remove 'temporary' things that a model doesn't identify with (that one day with pimples every blue moon, bloated period belly etc). Of course we're a brand and the model's identity is less important than raw aesthetic. And as we work with mostly normal people of a broad age range, not models, not all poses might give a natural look by default. In the end we also see model photography as a form of rolemodeling - everyone can look stunning if you live a moderately healthy lifestyle and you're confident about yourself 💙", "tracykissdotcom\nVerified": "Verified", "harls1x": "LOVE THIS ❤️❤️", "luuontheloose": "My friends in the yoga industry were edited by the very magazines that wanted to feature them. What a disgrace. Beauty needs no edit, and beauty knows no limits. You look incredible, Reed!", "dis.__.grace": "Love these #realitydisclaimer might have to start including these in my captions", "drewwyllie": "Smoking 🔥 she don’t need no airbrush 👏🏼❤️", "porterbhoy": "💯⭐ quality 👍🙏👍 gorgeous Reed amber amense👀💋😘🌹", "just_dre3000": "😍😍😍 asss🚿🚿", "timbo13654": "😍👍", "officialrabimages": "😋💦😋💦", "rammyphoenix": "This is brilliant @reedamberx", "batangglorietta": "💙❤️😍🌹🌷", "magicaltrev_15": "Bloody lovely picture and a fantastic ass. No editing needed whatsoever. 👌😊😍", "mariabetans": "i admire you, thanks ❤️", "clarkey196608": "i genuinely think the world of You, one of the best people i have never met. Your posts just fill me with optimism and joy about my fellow human beings xxxx", "ant_ono8": "🤤", "sanborn2k": "Hello gorg", "adam.turner.12764874": "Yummy ❤️", "frank.marcha": "Love your pics for the natural beautiful person you are ! Love your arse as well😊", "mojoe.illustration": "You are who you are after all.", "kierantee": "Great photos", "fedegerda22": "@reedamberx 😍😍😍", "alidmrluzk": "You are great...I like you👏"}