{"awwlow": "🙌😂", "thhuey": "👏👏Well said", "youssef.abdelmassih1": "I agree 💯💯 a big fan from Egypt🇪🇬🇪🇬❤️❤️", "richardpumfrey": "I think it's outrageous to send unsolicited dick pics to anyone!! People should always check before sending anything of a sexual nature either pictorially or written!! Keep making it clear where you stand on this Reed!! Quite rightly!! @reedamberx 👌🏼📷💞💞", "pixie_ramen": "I’ve received quite a few, but always on Facebook from strangers which is so much stranger to me!", "domenic_the_explorer": "Well said 👏, BTW can I send you a dic pic?? 😀", "wayneking6950": "....still gonna get them tho.", "islam_rzayev6": "You are so beautiful", "hawaiizfinalking": "You’re luring people to study 👍🏻👌🏻 lol", "beckapalter": "Unsolicited dick pics make the entire online situation suddenly feel unsafe!", "datboiiigary": "U got balls to do this shit🤔", "eduardo_de_la_morte": "Cool pic", "thesanstar": "Can I hit you with a dickpic ?", "brikkies": "You have so many dick pics in your dm's and I just want coffee and an intellectual conversation , I guess the world has gone mad😅🙈", "eddie.jackson_69": "Well I don't have any interest in that I think any one that does that needs help that should be personal between two people not everyone in the world", "fittonchris": "Love your feet ❤️", "mickehirsch": "Are people seriously doing that bull crap still? Ever heard of the #metoo movement?", "noogie7": "@reedamberx That wild wild west comparison had me dead 😅🤣 \"It's high noon\" 😅", "mikey_bleakley": "Should never EVER send one without request, but always need an opinion or feedback once ones been sent 👍", "_.katx._": "I agree , I've received many dick pics and it's disgusting. Men don't understand that dicks aren't as appealing to look at as a woman's boobs and butt. lol 🤣", "jeanieeous": "I once had FB shut down my account because I posted an unsolicited dick pic I had received from a guy I had never met, but was setting up a date with... some friends cheered & others got very angry (?guilty much?)... Hilarious part: his “sexy” pose was shot sitting on a toilet! 😂 Lost my appetite for the dinner date & him simultaneously... I mean - if you wanna send a hot shot, make it hot! #doubledickpic #unsoliciteddickpics #isthatyourbestfootforward", "mdavison906": "I sent 2dick pick's an with one person 30 years now other was when I trying do delete and posted it by mistake on twitter got lots laugh's upset fee people to lol", "dropzone_uk": "😂🔥🙄⭐️💥 You’re last Post “Do You Spit or Swallow?!!” #IncorrectAnswersOnly 💦", "lemon_ste": "Absolutely! It's no different to flashing someone in public (minus the fear for physical safety obviously), totally humiliating and disgusting. If it's not illegal then it should be.", "youseifemad": "She asking for pussy pics", "aurorasjs": "😙", "pscholes79": "Isn't it just common sense?", "rodlaraactor": "@yeahthatginger", "kyomichey": "❤️❤️", "nyprman": "Got it , don’t send you the dick pics I wasn’t ever going to send - because this is the Internet and shit lives on here forever!", "proyectodecualquiercosa": "It makes me think \"oh... You have a penis. What a surprise. Is this a compliment meaning that I'm so hot that I generated an erection on him? Calling me hot would have been much more appealing.\"", "massimozaganelli": "Some men show the dock because haven't the brain....", "lucierosedonlan\nVerified": "Verified", "scojondiv": "I agree with your stance on this subject and as i know your all about equal rights may i throw this ball in your court... Can the same apply in the opposite manner, thou i have never heard of a man complaining about being sent pictures of ladies vaginas or boobs, it is not to say its unrealistic, perhaps more so if it was 2 girls, a girl may not to wish to be sent unsolicited vagina pics etc..... Your thoughts?? X", "conway5026": "Thats was along Statement", "calenjvanstone": "👌👌👌 Yes", "_ambergordon_": "Reed the amount of entitled idiots in the comments asking why it’s wrong or saying certain women ‘ask for it’ is actually shocking 😂😂 how people can think this way is beyond me... so if a woman is dressed sexy it absolutely MUST be for male attention it couldn’t possibly be that she likes herself enough to want to look good for her.... shit attitude, no wonder they have to force it on people", "dantastic87": "There was a great post( I think on reddit, not sure) about this and why men do it. It went into wonderful detail about how women are adored in society and men are treated as expendable and unneeded in today's world. This leads in to women getting all the attention and praise they could ever want, so get fed up of seeing/getting advances from men. Whereas men get little to no attention and praise and try to find any scrap of it they can, sending out dozens even hundreds of dick pics in the hope that just 1 girl will pay attention to them. I wish I could find that post(and make separate paragraphs), it's a pleasure to read and really gives you some understanding into the thoughts and actions of both sexes.", "harrynotlarry": "100s of unsolicited dick picks? Pretty sure you could publish that and turn that 🍆 into 💵", "jack9425": "❤️❤️❤️❤️❤️❤️❤️", "claytonco799": "I agree with you. I love looking at your beautiful pictures.", "yupitsmebergy": "Absolutely 💯 percent correct. 👍👏😘", "decodeashdene": "Nice", "dekelnl": "The best things in life, come unexpected and unrequested... :))", "modelmajemillion": "💖👌", "world.of.cannabis": "Sooo... Hi, do u want a pic of my dick sweetheart? XD", "sirstoryteller": "😂😂😂 well not mine! 😜", "deejaycabuhat": "Beautiful Song performance= Audience clapping... Beautiful body on social media=Dick pics jk. 😋", "izunia.motyl": "😅 love this !", "footworshipdean1": "Why would anyone want to send photos of they private parts", "dirtyre2411": "I know right, I would not want to look at those ugly things either.🤣🤣🤣", "cattrill_66": "💜 Reed love the post it's about time people know how much shirt you have to put up with keep going lots of love 😘😘", "dvkvri_": "That’s hot tbh", "arlinglassar_mua": "💯🖤", "50shadesof_compassion": "Totally on the same page with you lady ...totally luv your stuff .said it before and I’m likely to say it again 🤭☺️😍", "dirty.faran": "I would love to send you", "harry_black_maskers": "You are so beautiful", "ishiroc7": "🔥🔥🔥🔥🚒🚒🚒🚒🚒", "chrisboleman": "Nobody wants to send you a dick pic.", "auralyouth": "Can we send you a face pic?", "_.its_just_talia._": "💕💓❤️", "curlysue4196": "💯", "robinmj789": "You are seriously offended 😓 fuck the, you keep smiling as always. Love ❤️ you beautiful 😘🌹", "alexthegeordie": "Fellas, if you have the confidence to share your most private parts, then use the same confidence to engage in conversation first. Simple enough to follow the logic, right? PS, 😂😂😂 @ReedAmberX sticking the phrase 'hard on yourself' in there. Good work 😘", "babbittybabbitt": "Random dick pics from strangers are the fucking worst lol, don't understand why anyone would do that", "__rukiat": "Pls tell them", "majemillion": "🙏👌", "zac_the_zoidberg": "I just want to know why a woman would dress revealing if she didn’t want attention. Can someone please clarify this for me?", "karim.b.11": "Love it❤️ I’ve never seen your parts but bet everyone wants to see😂", "marianasbits": "I have a whole stand up set about how I got my first unsolicited pic this year!", "ykumari_": "You are a badass and so correct about this. Love your page and love your messages!💛", "ckivtnarkiv": "This caption made me unfollow you.. Was a fan thought... Unwanted feminist rant", "paulj060669": "Well said reed its not right it should only happen between 2 peaple who concent to it and then kept private you are a stunning women you post very sexy pics on here but that does not give any person the rihght send pics of there bits", "missfayallen": "Love this 🙌🏻🙌🏻", "peeweesmith86": "Amazing 🤩🤩", "rckly999": "I would not send anyone a pic of mine to anyone even I don't like the look of it sat there staring at things🤣🤣🤣🖤", "rhodzilla23": "Totally agree with you", "unleashed_studio": "👏🏼👏🏼👏🏼👏🏼", "imaysahayleigh": "Make it a campaign lol xx", "roberto_martie": "😁👍", "miss_isabella_bliss": "Well said lovely x", "williamfc16": "Move the board away", "iamkerstin_e": "You go girl 🙌 such an inspiration 💞", "hincho2020": "Stop posting masturbation material then.", "sophieaureliayoung": "Preach! 🤗 looking stunning as always 💖", "rashimedunnx": "Fave 😍", "just_dre3000": "Hmmm in to minds if I should 🧐😜😜", "dick_does_disco": "I've talked to my son's girlfriend about this and it's totally shocking! Why would you ever want to send a pic of something that's to put it bluntly, damn ugly. Is there a certain demographic that sends these pics? How about dm'ing the perpetrators with a whole set of unsolicited dick pics? X", "rudd473michael": "Looking so Beautiful as always Mistress Reed❤️❤️❤️❤️", "nodderw": "I would never send pics of my dick unless they were asked for but if you want to send me some naked pics of yourself they would be gratefully received 😍😍🔥🔥🔥😘", "bree_999": "This is a whole mood", "mohammad.ezh": "U know i never send 1 but my inside devil told me to send u one just for fun😂😂😂😈", "drunken__aesthetics": "Preach!!✨", "matteodiclemente996": "Beautiful", "seliyukina": "It’s good sorry 🔥🔥🔥", "eriicaa.cruz": "True!!", "drdelm7": "Never asked to see you naked but okay lol", "barrypompey51": "I totally agree, I put on my twitter profile no dick pics or you will be blocked,as a person with gender issues and was sexually abused at the age of 14 I could not even shower with boys at school as I felt dirty! And I wont send anyone dick pics even though there is not much to see! I think it's worse for any young lady that does over 18 babe television they must see it all the time on cam shows! I am no prude it's each to their own and there is a time and place and there must be consent from both parties! I am nieve until recently I did not know the rules here on Instagram and needed to be politely told! It's good reed you have an understanding partner, and thank you for making a valid point as always! 💞 💞", "kenomadd": "🤣😂", "cdwc72": "100? Fuckin ell.", "dyala.maria": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼 i agree!", "mana.kiya": "THANK YOU FOR THIS ❤", "casper199025": "I’ve never got the idea of sending a dick pic 🤔", "jackalhani85": "👏👏👏", "_pdx_brian_": "This is so awesome🔥", "bloggeronpole": "THIS! Thank you. I once had someone call me through instagram while they were jacking off when I first turned my profile into a business page - deleted my number from it ever since. So awful! Should hook you up with one of my fellow researchers who’s doing her PhD in cyberflashing xxx", "wreak.havoc_photo": "Say what... I've been doing it all wrong! 😉😂 Seriously though, as a male photographer, I get sent dick pics and I'm like WTF!!!", "joel_hayes": "I think if you send unsolicited dick pics to people you should be put on the sex offenders register. Because how is it any different to flashing someone in the street? I made the mistake of clicking the #unsoliciteddickpics hashtag and it just made me angry 😠", "millwallant1885": "You are brilliant. Such an intelligent head on your shoulders.", "rozzer82": "Couldn't argue with any of that. I often wonder do they think whoever they have sent it to is going to drop everything and get in contact immediately for sex or what do they think is going to happen??🤔🤔", "catwalkcarla": "PREACH!!!!!!!", "viva_hossein_norozi": "Check direct", "marcusavanti": "😂", "jcurry102": "Any girl can show a tit. Everyone wants to see. One dude shows some dick root, he’s labeled a perve and a creep. Why can’t society love both genders? I asked for pussy pics would probably offend anyone, unless it’s a pretty one... guess it should be the same for fellas. If you got a pretty dick, show it off, someone will wanna see it. #dickroot #appreciateapenis 😂", "emilylindsaybrown": "🙌🙌🙌🙌", "jaimieatkinson": "🙌🏼🙌🏼🙌🏼🙌🏼🙌🏼", "lilymariagoodchild": "I LOVE YOU BOO!", "amitskak24": "Wow... I guess Thomas is a good guy.......👍👍👍 It's so difficult to find a true friend now a days......", "rantarn": "If you asked for them they wouldn’t be unsolicited. 😂", "sashshots": "I have never received the aforementioned pic. I can't imagine ever sending one to someone who is a stranger. It's just rude...it a virtual form of flashing. What are you trying to say? I fancy you look here's my peepee... I don't get it. If you saw an attractive person on the street would you say 'hey take a look at my genitals! We should be friends!' nope. Don't get it.", "hinsch.iks": "👍👍😜"}