{"darren.wright.9235": "I love you reed", "theseus.athen.hyde": "💙💙💪🏽💪🏽talk your shit💯", "linleygene": "So wrong, sending explicit pictures, to somebody who hasn't", "damohar": "I’m only here for the comments 😂😂😂", "chrismakloving": "Preface: sending unsolicited naked photos isn’t in anyway right. But to offer an additional viewpoint; the total over sexualisation of social media under the guise of ‘art’ has certainly not helped the cause. This isn’t a “she/he is asking for it” suggestion, but more that if society is perfectly fine with sexualising pretty much every part of life, from adverts, TV, music videos, films, social media - how can it not be held somewhat accountable for the repercussions? Example - I’m sure Justin Bieber and a like get thousands of unsolicited fanny pics, which is JUST as morally corrupt as girls receiving dick shots, but then as a sex symbol and someone who hyper sexualises himself and that becomes his brand, does he have a part to play in offering an alternative view of himself? sexuality is of course something to cherish and support, but should the question be more - is there now a space in media that ISNT sexualised? And can we promote these areas?", "asdf.p.n": "#bi sg", "beautiful.stunning.girls": "Very good 😂", "sabo_build": "If I saw that on the train id think 'wtf' then carry on with my day", "ruhum_yeniden_dogdu": "Report all to instagram", "noah_baginski_": "If anyone wants to dm me vagina pics feel free", "mothadelic": "Pssht, just delete them. 🙄", "wagnererotic1": "✌", "iamvincentking": "Great Caption! 🙌🏾", "lucyangelinerachel": "🙌🙌", "katlinelizabeth": "I love you omg", "roach694": "I agree with you but I don’t think most people would ever want to see there daughter naked. And prob the ones that are kool with are more problems then guys sending dick picks to women", "richardpumfrey": "It's quite sad that you need to keep repeating the same message!! You're looking good though luvvie!! @reedamberx 💞💞", "danimoreno1975": "I love this girl!😂", "ladislav_znava": "Very beautiful woman", "michael.stoddart.9655": "Nice review about you", "ajim.23": "Hallo im dari indonesia😂", "bigdog6322": "I'm still wishing that was written on clear glass", "xel.sndro": "Moral of the story, explicit pervs listen; just cuz its desperate, doesn't mean its harmless. Not only is that fuckin creepy, but its plain inappropriate. Since when is it okay to mail polaroid pictures of ur junk via mail to strangers? Or worse, to do so after you target a stranger you may think is attractive. The phone/internet doesn't make it classy lmao its basically flashing/indecent exposure, and u look sad 😬😬😬", "djmojo2000": "The shit ain't particle physics fellas, If yr dick is that good THEY WILL ASK YOU, since it isn't keep those pathetic mugshots to yourself.", "hamse_mohamedd": "Sending dirty pics to a stranger is not even appropriate character it’s completely wrong and shameful in my opinion", "penthouse\nVerified": "Verified", "harry_fergson": "Amazing😍", "domenic_the_explorer": "Love your content and story.", "alireza.ganjiyan1": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🎅😍💘💣🎆💔🔥🔥🔥🔥🔥🔥🔥🔥🔥", "leninoscar": "Eres hermosa", "cattrill_66": "HI beautiful I think some people are not getting what you are saying so keep saying it time and time again 💜💜👍😘😘", "axo_mx": "👏", "sirstoryteller": "😂😂 not me!!!", "firebirdshaun": "No way in Hell would I ever send a dick pic.", "claytonco799": "I have seen nude pictures of you and you are beautiful.", "mattjeffersonofficialig": "How about unsolicited date invitations? You’re so fucking cute it’s not even fair. Drinks? 😍", "bb_unforgiven": "Then look your photos.how do they look at you like?", "spaminitwjoellll": "You should start saving them and put lil eggplants on there and post them and @ them 🤣😭 that would be fun exposing nasty men", "u_cant_run4ever": "do a fucking porn dude...you have been in more porn than so many so called pornstar...ofcorse your shooting is realy good", "its_ally.pfennig": "Half the people in these comments are being deep or saying you're cute, but honestly, I was wondering... can I send you pictures of cute dogs? 😂", "sillyus_soddus": "Damn! 'cause I had one all ready to send! 😂 😂", "omairsqadir": "Thanks for spreading awareness regarding sexuality and being comfortable with ones own regardless of orientation.", "djcq": "😳😂😂", "michjohn692": "very beautiful woman", "tomissthecat": "You are inspirational reed💙", "andresilvabullett": "I’d need a big lens anyway. 😂🤣 But seriously, I don’t think I’d like unsolicited fanny pics as well.", "soymoobs": "It’s upsetting this still needs to be explained in 2019", "bhobski": "Lol... What kind of dude think sending a pic of his junk is a good idea?", "_.its_just_talia._": "😍💕❤️", "nebs22": "😂😂😂", "barrypompey51": "Take reed as an example, the male side of me thinks she is hot, the female side says wish I was wearing that! My rule of thumb is never send a pic that you would not want to see yourself! I am old fashioned & believe in respect that person! 💜💜💖💖", "zalooski": "compassionate, good humored and clear. doff of the cap to you amber reed. may you get all the dicks you ask for.", "lastraven1986": "The problem is people are applying generalisations bloke may have got lucky with one girl who loved sexting etc so they think all girls are the same. Essentially everyone is looking for cheat codes rather than playing the game", "adamlawsphotography": "Dog's 🐕 not dicks 🍌", "pretty_clikz": "Ha ha lol... I accidentally read it as unsullied dick pic..😂😂", "killajad3": "no one asked for half nude pics", "hincho2020": "If girls are selling 'The Sex' it's kind of expected to get the 'The Sex' back...", "noyan.bkns": "@shamlanx @reedamberx arabs smh🤦🏽‍♂️", "maklaindevoe": "Although I agree with you totally....I’m just playing Devils advocate here. What if a person is just trying to “Express their sexuality” similar to your photos on IG? Or what if they consider the pic “Art”..You also stated you’ll ASK for a dick pic but most people (especially men) like to surprise woman as a sign of flirting. Lastly, the dick gets a bad wrap visually. I for one prefer to only see mine BUT the vagina is all over the gram or sent all over in messages unsolicited and it’s ok, kinda similar to your point of natural vs edited photos in the sense of the dick is not a preferred image whereas the vagina is...idk just my thoughts. It’s early and I’m hungry figured I would speak my mind. 🤷🏾‍♂️", "delirio_sublime": "👏👏👏👏👏👏razón 100% en tu pensamiento mujer 👏👏👏👏", "governor.db": "😂😂😂😂😂 go girl", "michaelkrusofineartist": "🙏🙏", "chinesenibba6921": "You remind me of that Oliver Tree guy", "tys__life": "If a woman I know asks, then she shall receive but sending to a stranger without their prior knowledge is just WEIRD! and not far off indecent exposure. It doesn't matter if the the person is a porn star or a dr, treat everyone with the same respect unless they are a total cunt. Peace! 🤘🏼", "joshuadever": "Great post! 👏", "alphakennnybody": "I don’t mind getting unrequested nudes from females🤷🏾‍♂️, but I do understand where you’re coming from", "darktrooper317": "And yet they still come 😑🤔", "jessicaann_model2": "Forever loving your posts 🙌🏼", "jjjjason1": "Don't really understand what they would want to accomplish. In their heads are they expecting a reply from you declaring your love or need to see them?", "alexthegeordie": "👍", "clarkey196608": "I find it hard to comprehend why anyone would do it without being asked....", "mrchapman86": "That's so true. You are an amazing person. Love your videos. Keep up the great work.. is it possible to be cheeky and ask for a follow, 🙈", "robbielane_87": "@reedamberx I sent you an inbox.. dont worry..😂😂 it isnt a pic.. dunno how guys or girls do this..", "anthonyprogress": "😆😆😆🇺🇸", "pepperrosemusic": "G ❤️", "natalie_strecker": "😉", "dem.cavey": "@pixielawrie", "isaac.aguilar_": "Send nudes im on a packed trolly rn i wanna see how ill react", "guigoteeshirts": "You are right 👍", "eevowhite": "Sending women dick pic is for amateurs. Real men go out there and disappoint women in real life! #quote :)", "zxrxsb": "Well said ❤️", "scurvyweevil": "What about unsolicited tattoo pics? 😁😁", "shootatmine": "😂😂 love the message - hope you are well 😊😊", "bighound8": "Send bible verse not nudes 🤣🤣", "senorxhuguetas": "I send cats not dogs, but even though I do ask for permission", "faiepdeoiad": "Do you really think people that are actually sending dick pics to people they don't know would pay attention to this?? I would guess not", "luluerglis": "You are amazing", "alephreal": "Always this. People are way to quick to send pictures of their junk, like, can we get coffee first?", "richardgardner45": "Awesome reed well said", "khurnrhall": "I dont need to send dick pics hun, i get arrested for streaking in Asda lol xx 😂😂", "andrewdhowitt": "Although I am not ashamed of my one eyed trouser snake I would never send anyone a picture of it if I didn't know them and they had not requested it xx", "greg_runs": "I prefer #catsnotcocks personally!", "quantummanagement": "Well said @reedamberx ❤️", "shellybaaaby": "@samlawfitness Faceless genital 😂 you’re a faceless genital my boy ❤️", "abiewles": "🙌🏽🙌🏽", "dreamengineer": "Brilliant 👍", "dimazelenkov": "Do you put these photos in a photo album?😂😂😂 @reedamberx", "youseifemad": "HEY NOT ALL OF US WANT NUDES 😂", "ochiuk": "#senddogsnotdicks is the best thing ever.", "femme_fatale_82": "Well said!", "oloni\nVerified": "Verified", "rozzer82": "Have you not said this before?? A good few times", "franchescahiggins": "You are amazing😌🌻", "peeweesmith86": "Amazing words💖", "deniz.dernek": "I adore you 🔥"}