{"jameswhite8267": "Blue light from phones/computers interferes with our sleep-best not to use it for at least an hour before you go to sleep.", "nigelmeggs": "Nice feet", "rnsmojo": "Your awesome and real love it", "maas.art": "In Canada they now have hidden likes. So when you look at a post it will say \"liked by \"user x\" and others\" Thats it. Ive seen a real positive effect from this as people seem less stressed over their like count. Not sure if this has rolled out in the rest of the world or not yet but i think its a positive move.", "mrlake83": "One of the best pages I follow.... lots of realness, silliness and great advice for men and women... most of all respect. Your not like most of the others and hope it stays that way 👍🏽🙌🏽👍🏽🙌🏽", "jasonicmultiverse": "Sold ur stunning legs 🤤😍", "peeweesmith86": "Beautiful😍😍", "tiarobertsxo": "Love youuuu😍", "leninoscar": "Encantadora💕😘😍", "darren.wright.9235": "I love you Reed Amber", "19karaboga03": "your tit is fallin out", "johncain41": "Well said good for you ❤️🏴󠁧󠁢󠁳󠁣󠁴󠁿😻", "buckley4579": "U look amazing reed xxx", "iamjasondewitt": "😍😍😍👏👏👏🔥🔥🔥", "clarkey196608": "You do really valuable stuff with Your social media presence @reedamberx so whilst i get what You're saying please try and remember there is plenty of substance to what You do it's not all shallow.... and keep it up i am sure there are people in a much better place because of You xxxx", "ba_ckgscivkd": "❤️", "domenic_the_explorer": "Censorship is an evil thing. When these platforms can who they think is inappropriate it’s a scary thing. Same for conservatives being targeted.", "bethelbilly": "Such a cutie,", "southlondonlee": "Good idea, and you look amazing in both", "_.its_just_talia._": "💕💓💕💓💕", "jesfaye_music": "Unreal 😍", "parisxhk": "❤️🔥 Look unreal babe x", "arigatokono": "L O L", "theoteddyshivers": "4ocean bracelet?", "iaingraham40": "😍😍😍🔥🔥🔥😍🔥🔥🔥🔥😮❤️❤️❤️❤️😮❤️😍😍 spiffing😍😍😍😂😢😢😂😂😮😮❤️🔥😮🔥🔥😮😮😂😂❤️😮😮😂😮😂😂😂😂😮❤️😂😂❤️😮😮😍😍", "dotty.rude": "@reedamberx How come you want to be someone else, as you are a beautiful and inpiring woman🔥🔥 I have been following you for some time now and to me you are one of very few people on IG that seem so true and honest. Since my self esteem is on constant rollercoster, post like this gets me in balance. Thank you for that! Sending much love and positivity your way! ❤️", "drmakween": "More people should be using ig like you ✨", "plot_cartel": "❤️🔥❤️🔥", "nicolascaitan": "I can see your Martens under the bed 🔝", "_sicoki": "😂", "ladislav_znava": "Red is amazing, beautiful lady", "massimozaganelli": "Both beautiful !", "its_kelsanghere4": "@reedamberx pretty as always....much love all the way from INDIA 😍🤤🔥💕🇮🇳", "telavized09": "Thanks for being as real as you are, the amazing things ur doing for breaking down stupid taboos has helped a lot of people myself included (I’ve actually been slightly confident with myself lately!). And hey, that’s hard to do so congrats. Thank you!!🖤", "cordero90": "Hello sweetheart", "fittonchris": "😍your gorgeous x", "sammar5719": "Sadly, you are right many young people fill the need to post and respond to social media. Compromising their safety and mental health. Hopefully this lastest post will not result in a futher ban.", "matthewgiesen": "I only check IG and Twitter constantly to see new post (photos) of you 😍", "alex_labadaris": "❤️❤️", "abuxompony": "Best reminder ever 😘 ps don’t fall for the algorithms- instead set the mutha effing standard", "barrypompey51": "I can never understand why on social media sites we are called \"followers\" we are not sheep or other animals that follow each other about! Internet friends? Then it's all about the number of people that follow you! How many of us check the list and have a delete purge! Like in life quality of friends is better than quantity! It's great when reed posts her pictures and a lot of the time there is a message in each picture she is trying to get over! Am I one of the lucky ones that did not have mobile phones or Internet as a teenager! If we wanted a private chat it was down to the phone box at the corner of most streets armed with a bag of change for the said phone! Are mental health problems in part down to social media, trying to be someone you are not just to fit in! Reed gets you thinking and talking with her posts! 💜💜💞💋💋", "jerryboyer0624": "😍😍😍😍❤️❤️❤️❤️", "johnpearce00": "Baaaaaaaa!", "anthonyprogress": "Don’t do it. 🇺🇸🇺🇸🇺🇸 . . . . . #cute #selfie #love #lifestyle #fun #photooftheday #friends #art #picoftheday #me #photography #beauty #fashion #happy #fitness #beautiful #smile #girl #photo #style #model #summer #travel #music #motivation #health #nature #instadaily #ootd #life", "nickypritch_": "@reedamberx I love your comments as much as your body pos pics 🖤💛", "kierantee": "Ur so funny", "david827mitchell": "@reedamberx absolutely stunning amazingly beautiful ❤️", "superroo80": "@reedamberx 💛😍💛", "pepperrosemusic": "I sooooo needed to read this!! MY G!! Thank you for sharing the wonderful worries of your wonderful mind #notalone 😅🥰🥳😘", "oscaryappert": "🌷🌷", "akik0sakai": "Preach mama!", "van_der_graph": "Well said lady. Keep being awesome.", "cherryrevolution": "Love you Reed!💛", "cattrill_66": "💜💜🤗now you have sold your soul can I buy the rest of your 😇😇so so beautiful 😘😘😘😘😘", "lucieeloise": "👏🏽👏🏽👏🏽", "wonderlandboudoir": "Thank you for this post woman!", "ale.passia": "Wow. Sexxxxy 👏", "petertambyapin": "Beautiful absolutely gorgeous as always @reedamberx 😀😀💖", "redriotxx": "Idaman❣️", "jimmyohliv": "👏🏻👏🏻👏🏻💕", "george__karag__": "Still good looking in both of them, u are awesome❤️", "richardgardner45": "Totally right reed we get sucked into social media and it becomes your life", "twistedwell": "Thank you for sacrificing some of your time, soul, sanity and mental health so that you can make me smile pretty much every time you show up, one way or another. You're vibe is something else. And i dont think it's just bc ur hot on the outside! Ur hot in the inside where it counts... stay gold ponyboy", "cbcaa": "In all your cases, sweet😍🥰🥰", "todiveforuk": "It's either caring too much or too little, just like with relationships ha-ha"}