{"emilyjackbutler": "I have always enjoyed reading. I played golf until my junior year in high school. I have played guitar off and on since I was a sophomore. I would say not having access to products to help manage your period would cause disruptive complications to any of these activities.", "not_enough_time_to_art": "💖", "allie_says_hey": "She wanted to be a gymnast, and so she became a gymnast", "johnnyboi.christmas": "💓", "linda_mit_v": "😍", "mariijoala": "Dance dance dance ✨✨ ballet though :)", "szczurek2725": "I did judo, it was great!", "ashtonw260": "❤️", "cloud.am": "@nathhughes75", "e.rinwalsh": "💛", "marianne_louu": "@franziska.helmke", "eosurveys": "My favorite activity when I was a kid was the girl scouts. We did all kinds of things and learned important life skills without realizing it. I've been trying to figure out how to help girls have a similar experience with the time I have to offer.", "musings_of_a_socalled_radical": "Great project and a very good cause, though I don't necessarily support companies like always, but at least they're trying. I'd love to find a dance class, like yours, @hannahwitton what is the style called? Is it dance hall? I don't know what to search for 🙈", "xarilgxx": "❤️", "nathhughes75": "@cloud.am", "thatroedude": "Tried to roller skate as a kid, would still love to learn!", "space.cat4212": "Fjsjdjddd", "amberleatorrance": "Used to do athletics, specifically sprinting and hurdles xx", "cassieameyer": "Love this! 👏🏼", "bilylills": "❤️", "julia_mxx_": "❤️", "kenziekhaos_": "I acted when I was a kid from age 3. I'm now 19 and am still acting, just with a different company. I only left my original company when I was 18 because I got too old! I also used to do ballet, tap and modern as a kid but I don't do that any more.", "sadeolivia_": "❤️", "the_a_flake": "👌", "algrenc": "Love this 😀", "s.dewey": "🧡🧡", "littlepinkstarsally": "Horse riding", "lilybills": "😇", "heather.collinstripp": "If I could like this a million times I would. I proudly work for a medical appliance company and wish we could give away free products to those so in need xxx", "orly.anne": "💓", "amy.o.shea": "💞", "flowerpowerroos": "I think every people that has a menstruation cycle needs the access period products. I love dancing as well and have been sinds I was 8 years old. I don't think I would have been able to continue dancing through the years of I didn't have access to period products", "mariahickeyx": "💚", "notkuul": "My hobby is commenting on Instagram so people everywhere have access to period products", "caitlineileenm": "💃🏻💃🏻💃🏻", "procrastinyree": "💞", "freyjaward": "Skiing ⛷", "rosied2205": "🖤", "ivyginny": "👌", "hannah.joy15": "Dancing, art and singing", "lizzieiles": "I love that you work with Always to #EndPeriodPoverty ❤️", "rachelelizabeth410": "aw so cute", "alternative.au.fn": "Such a good cause, yasss", "jennybailie": "💃", "rocklobstererin": "rock climber :)", "ntycing47": "I did track and cross country! And if I didn’t have tampons everyone would have been able to see I was wearing a maxi pad under my spandex uniform 😭", "cataa.pe": "💚💚💚💚💚", "peterp.jpeg": "💖", "angela.jasz": "That's so awesome!! I did calisthenics for 11 years as a kid; I didn't enjoy the last few years. And now I love strength training and Pilates 😍", "lovebuzz_papercuts": "♥️♥️♥️", "drawing_breath": "I used to be a county swimmer- LOVED it, but stopped because of the body changes puberty brought- my period in particular. I'm so incredibly happy #endperiodpoverty is a thing.", "onegirlandherukulele": "💕💕💕", "cerys.mai": "Yesss 😍", "vitriolicbumblr": "💛💛💛", "madeleyben": "❤", "reimlivia": "I used to take music lessons in my teens and it made my life so much easier to have this products with me when I had to perform 😆", "phoebesharman_": "💋", "sydmorg": "💗💗💗", "katelynjoe4": "I do love this but I also do wish it were more sustainable products like reusable pads and cups because if there is access to water then each donation would last and impact so much more!", "jeanettemarhoff": "😍👏💪 thank you for continuing to shed light on this!!!", "mariola_rubio": "👏🏼👏🏼", "anthiekr": "❤️❤️", "danyccosta": "🙌", "agaaathe_hb": "Trapeze ! and it was awesome", "n_g_vdw": "happy to see these campains again 😊", "angh_tre": "💕", "vivid_adventures": "💛", "caitlinlewis__": "♥️♥️", "blxck_ct": "I’m a burlesque dancer and I loveeee it!", "colesbam": "💃🏼💃🏼💃🏼", "faselwesen": "@spinelli_blue @crispycookie", "jennymwhittaker": "🙌😍❤️", "melhymnia": "🌸", "24amyjane": "When I was younger I like sewing and crafts, I actually went to a craft club. Now I still enjoy crafts also baking and my main hobby is reading. 🍩📚🎨📖", "maddie_birks": "Love this! 💙", "ecras.e": "❤️👏", "13.tasha_": "🙌🙌🙌", "hannah.laura95": "👏🏻❤️ fantastic cause!", "francadazwischen": "💛💛💛💛", "the_ultimate_answer_is_42": "😍", "sabria.behilil": "👌", "miss_charlie_lou": "When I was younger I went to theatre school. Anyone who knows me now would probably think that's the least likely thing for me to do, but I absolutely loved it. I'm not much of a dancer, but I really enjoy it when the mood takes me. My favourite part of it all though was when we sang together, we sounded amazing as a chorus. I miss it so much as an adult but I'm really grateful that my circumstances allowed me to do it as a kid. 😊", "nataliasiemens_": "❤️❤️", "trashiemaddie": "Definitely couldn't have done gymnastics competitions in leotards without tampons! Bless", "lala_sian": "Yes", "bethoney._": "❤️❤️❤️", "loopie.chickie": "Commenting so that someone who needs it can get a tampon 🤷‍♀️", "krissy.millard": "❤️", "mollyhannaway": "💖💖💖", "erin_templ": "I used to do ukrainian folk dancing", "nikolelongworth": "Yay so glad that you supporting this Hannah", "natasha_lee_17": "How did you separate your caption space out into paragraphs like that? even when I do mine on notes and copy it, Instagram still compresses the caption and sticks it all together", "megnicantsionnaigh": "❤️❤️❤️", "feraloidies": "You little cutie!", "murielles_buecherecke": "I always liked reading and makung music and that hasn't changed. But I also like to go hiking", "pasthaa": "💗💗💗", "mrsstilletto": "I love dancing too! I started dancing at the age of 6 and haven't stopped since (OMG, almost 30 years of dancing!). I have done primarily jazz-ballet but since some years I am taking tapdance lessons. And my husband and I have been ballroom dancing almost as long as we know each other (we will start our 13th season of ballroom dancing this September). The only thing I have added to my routine is yoga - that totally relaxes me. 💚", "karenchamp": "yesss love this!!", "miryamelshaer_": "@zeynepelshaer", "beckyq_": "❤️", "einhornflauschi": "❤", "gabby_diane": "The only I’ve ever really had is reading lol. There isn’t much in the way of activities where I grew up. So I just loved playing outside with my dog and reading ❤️", "laurennicold": "but I used to dance and do theatre, and even though I did end up in the hospital I would not have made it through a fifteen hour black friday shift without period products this year", "samantha_lait": "❤️❤️❤️", "rileyvainionpaa": "I did swing dancing as a teenager!", "hanna_pyles": "I was a theater kid through and through, from 8-18 (although, I love to tell people that I had my first starring role at 3 months old, cross dressing as baby Jesus in a nativity scene! 😂)", "sophiewhettingsteel": "So cool!", "kjohnson3595": "💚💚", "floraskates": "This is awesome! Mine were dancing 💃 playing trumpet 🎺 and reading 📚", "libbysjournal": "Lol 😂 Reading then and now", "ashen.spirit": "Wholesome 💖", "kate_1066": "💘", "erikkacipriano": "This is a fantastic campaign 🙌🏽", "garlicfool": "End period poverty!!", "josh_is_a_jedi": "That’s amazing! Here in the U.S. a school district started offering them to students for free and people are losing their shit and complaining about it 🤦🏼‍♂️. What is wrong with America?!", "wack_demarco": "@xx_stupidboy_xx", "hoffenecker": "I used to do musical theatre and now I do yoga!", "samsonley_": "💜💜💜", "girandsqueeandme": "So awesome!!", "caitlin_mo_ames": "❤️👏", "kay.tay.lor": "thank you", "hannah.lavergne": "❤", "editorbrittany": "❤️", "lange.brooke": "Yesss! @amanda_ben2013", "itseveglo": "❤️❤️❤️", "meganivette": "💛💛💛", "_amaia_vael_": "❤️", "maia.moo": "On the second day of my first ever period, I had soccer practice, and I absolutely shredded the pad I was wearing. From then on, I used tampons. I continued to play soccer for another few years, and did martial arts pretty intensely through 14 years old. I'm so grateful that I never felt hindrered in those passions because of menstruation.", "caitlin_brown": "❤️❤️❤️", "mia.mcd2": "❤️", "isabella_riva": "👏👏👏", "susielee17": "Awesome!", "mike.uh": "❤️❤️❤️❤️", "sapphires_photos": "❤️", "annastops": "❤️", "beth_foster3": "@connorshields1999", "proggyfrosch": "Well, that's worth a comment then :)", "godimlarge": "Omg!!!! You were soooooo cute! 😍😍😍", "sian.exe": "💃💃💃", "philiphon8134": "Kawaii", "vickyispositive": "Love this cause! #endperiodpoverty ❤", "francesemilyp": "🙌", "garysunrise": "❤️", "rorb_rorb": "@lendonni right back at u", "chloheyy_": "My hobby was sleeping! It still is sleeping 😂", "rach_t96": "@katie_marie950", "ava.smithh": "@sophie__richardson @charlottesoin", "emmaxlr18": "I’ve tried ballet, karate and gymnastics but my hobby was never destined to be sporty! My hobby is music mainly, but I enjoy crafty things as well and cooking too :)", "_sadie_lives_": "I used to do karate and those white robes made me feel so uncomfortable when on my period. Without sanitary products I definitely wouldn't have been able to take those lessons.💚", "soelvimalling": "❤️", "catsintents": "I did gymnastics when I was younger!", "talkfastt": "🥰🥰❤️❤️", "gabbyhaskell": "I used to do dancing when I was very little and then moved on to gymnastics! Xx", "lendonni": "@matmattmatt @eriefairy @aoife_robertson @rorb_rorb and yes I did tag you all individually cos it says per comment", "toria_raffel": "👍💕", "jendeegankerr": "❤️", "benson_bum": "Just", "irlegend": "I'm shocked that it never truly hit me that growing up girls weren't doing the physically activies because of possibly period problems. Of course i knew they were having them but looking back to how many were opposed because of possible accidents blows my mind. Things need to change for sure.", "yellowbeezzz": "💛💛", "sofyrc1984": "I truly loved some activities when I was younger, swimming makes me feel so free and it sucks when I can't swim, everyone should be able to do what they love whenever", "hannah.hoffman.727": "Love this cause!", "farahs_flowers": "I used to draw and do arts and crafts, now I do embroidery and sew.", "bookishbetsy": "I used to do ballroom & latin dance when I was younger and it was so fun! I'm one of those annoying armchair experts when I watch Strictly haha 😂 This campaign is so important, thanks for sharing 🥰", "gracie.maryee": "❤️", "mockin_bird": "Such a great idea 😊", "crepuscular_synchronicity_": "❤️", "lad.slo": "This is really cool ❤️", "lunedmay": "❤️", "_jasminkaur02": "❤️", "amanda_ben2013": "Amazing work! @lange.brooke", "mr.helland": "❤️", "send_hummus_pls": "🔥🔥🔥", "mikeamandes": "😍", "siobhan667": "Brilliant!!", "l_nne94": "OCR running", "mcrlena_": "I used to do ballet,swimming and atheletics which was so cool and now I do basically nothing and I can't even say why tbh😂", "ta_ra1": "I miss dancing! Did ballet from age 4-12. Hiking and climbing are my things now 🙏", "marjoleinc92": "I used to love to climb🧗 and now I'm in between hobbies but there will always be my bike 🚲", "jemima.hogan": "💕💕💕", "charloburto": "I loved ballet when I was younger! I got super self conscious about my body (I struggling with an ED at the time) when I was 12 so I gave it up. I wish I didn’t, I would love to get back into it again soon", "milkmanshanly": "I also loved dancing when I was younger! Still do!! Gave me a lot of confidence, stage presence + great coordination. Getting your period during show week was a bit of an annoyance, but it would have been impossible without access to period products.", "reb.stillwell": "I used to dance, an iconic childhood hobby", "_hannahbananarama": "What a great thing to do!", "doctorbeegee": "I loved dance too! Got back into it as an adult recently & rediscovered my love for it! Also played basketball from the age of 10 until last year.", "cake_tin": "Yes", "francescalouiserouse": "💕💕💕", "helle.dae": "I always loved reading more than anything. It wasn't until my late twenties that I started to enjoy exercise", "roxannajade_": "❤", "aglittertree": "how cute!!! 💕", "jasondanielsauthor": "I’m glad you had something like that in your life. I hope more young people can have that kind of experience.", "lornaevelyn": "💃🏻", "rainsfetch": "I used to (and rarely still do) belly dance and I was super good at it (according to my teacher who had been dancing 10+ years). When my disability progressed, though, I had to stop dancing so much because it causes my symptoms to flare every time. 😞 I really do miss it.", "tamsinhogan": "Still just as gorgeous", "charlotte_clowes": "💞💞", "annabellejosephh": "💗💗", "meganschmit": "💚", "elizabth.wp": "💕", "freyavocado": "swimming netball rounders dance drama acting u name it xxx", "claire.lacey.96": "Love this❤️", "amandamarchetta": "Love this!!", "eva.bailey24": "I'm so lucky to be a member of a local am dram society and i absolutely adore doing shows", "soouls11": "❤️", "dewdropsofink": "💞💞💞", "sarah91518": "I rode horses from about age 8 to 18, when I went off to college and didn’t have access to it anymore. I loved the exercise, the mental stimulation, and of course bonding with the horses! I miss it dearly", "ganiluap": "🙌🙌🙌", "dariann_skye_": "❤❤", "heulwen.sj": "I went to a pop dance class and I play(ed) harp and piano. Also adored Brownies and Guides!", "anna.kerensa": "I used to do martial arts and now I am doing horse riding! Would love to go back to martial arts at some point tho (and believe me, our training gear was completely white, I feel this post on every level 😂🙈)", "cos_dandelina": "Wonderful thing. I do Samba too and I thinking of restarting Streetdance or a new dance kind. I just love moving to the music 😍💃💃🎶", "tamara_ellis1984": "I danced from the age of 4 all the way until I was 33. I became a part time dance teacher because of my love of it but unfortunately had to stop. Luckily my daughter who is 4 started dance lessons this year at the same school I went to/taught at", "lindsay.wetzel": "Such a good cause! ❤️ @amanda_ben2013", "anna.klemens": "❤️👍", "kiera.niamh": "💛💛💛", "suzanvercaemer": "I've played badminton and quidditch", "jaybou101": "You had magnification boobs even as a preteen?? Gawdamn gurl", "pennyonacloud": "I did dance too! Ballet, disco, modern and a bit of ballroom and Latin. Now I love climbing hills and snowboarding 😁", "_soap.tea_": "I'm a dancer too omg!", "daisy.twizell": "I did almost nothing active as a kid 😂 now I go running/to yoga at least twice a week", "misslinneal": "👏👏👏👏", "gracestallworth": "😻", "kaylischaos": "I danced until 10th grade when I realized my studio was super unhealthy and destroyed my mental health, now I'm a senior and super into theater, thinking about picking dance back up more healthily when I get to college!", "rmenzies3032": "Hi Hannah. Clearly you have a talent, don’t resist it..... looking forward to the Hannah Witton dance series.", "its_philippa": "I did swimming, water polo, clarinet and scouts when I was in high school. I had to drop the water polo because of injury but swimming and @scoutsnz are still my favorites!!", "elisa.007": "💗💗", "little_wxtch": "I was such an active kid, I would do irish dancing, horse riding, swimming, ice skating, then I hit 11 and just stopped having the confidence. 9 years later, I'm just starting to regain that confidence to start being somewhat active", "lindsdele": "I swam competitively, played basketball, soccer, and volleyball! Now I rock climb 💛💛💛 thank you for all that you do to end period poverty! Your work you do is sooo important.", "suziejmm": "💕💕", "ameliaa.jones": "💞", "bexthelegend": "💙💙💙💙💙", "allezberry": "This isn’t really an ad, it’s a gift!! #endperiodpoverty", "shirinroseking": "I did circus classes in my teenage and early adult years, which were so much fun! 🤹‍♀️", "the.rebecca.t": "This is so cool!", "ficcines": "💪💪😊😊", "cbanana19": "THIS IS AWESOME", "brettcarrutherstrash": "Well weren't you just adorable.", "thedoctor_dances_2017": "Couldn’t belly dance or salsa/bachata without good tampons! Hell yea to the cause ❤️😍🔥", "blairetheweirdo": "My main hobbies as a teen we’re reading and writing which I’m trying hard to get back to💙", "evie.kemp": "Yesss 🙌🏻", "x.graceac.x": "I'd love to start surfing! It's always been a passion of mine 😂", "alexander_xrants": "used to love acting and i still do! 😅😂", "pocketsfullofstars": "i love dancing but unfortunately i don’t do it enough.", "gabyamalia16": "💕💕💕", "hixitsxhaley": "When I was younger I did competitive gymnastics, could do some pretty cool tricks!", "crohnswithme": "Love how much awareness you spread 🙌", "marisa.allyn": "Yesssss go Hannah!!", "heyitsfaye999": "💖✨", "elliecolegate": "What a great idea! It’s so sad to think that women over the world don’t have access to products that so many of us are taxed on. Great to see people coming together to #endperiodpoverty", "noodlethejug": "❤️🌸", "sophie_vanc": "I appreciate the efforts always makes with campaigns like this but it’s also a product with a lot of nasty stuff that isn’t good for your vulva and vaginas health + so waistfull, bad for the enviroment.", "sophiebnewing": "I’ve recently got back into swimming! My favourite sport in the world! 🏊🏻‍♀️", "cheery_blossoms": "🥰", "winnsinthewillows": "👍", "maia.rose.williams": "❤️", "anicaharris": "Archery has been a favorite hobby for years!", "clovereliz": "💖💖💖💖", "uninterestinggay": "💙", "cvetisk": "Dancing is part of my life since I was 3.Bulgarian folklore,salsa,swing,dancehall aaand now hip-hop.It helps for my weight,health,anxiety,mind.I adooore to dance andddddd I'm thankful that I have access to tampons!", "nellyquiltalot": "Long sword dancing when I was youngest, rapper sword dancing now! #sworddancing", "jolaechen": "Awesome! 🌻💐", "lucialveroy": "I used to do bellydance and ballet, I loved it!! 😍", "juliette.amc": "💕", "lorenaapereez": "half brazilian here saying YOU GO GIRL", "princesssbelll": "💕💕💕💕💕", "rye1699": "Ballroom dancing when I was 7. Even got a plastic trophy 👏🏻", "charlieswrite": "This is awesome, Hannah!! :)", "indira.camila": "🔥", "em.mj": "💖💖", "its.ruth.ig": "👏", "cindyyella": "💕", "niamhus13": "💛💛", "emma.campbell2000": "I think tap dance is my longest-running hobby! I'm hoping to continue it at uni as well, so we'll see what happens 😊", "eliz.renard": "👏🏽", "livvieash": "❤️❤️❤️", "sunnivapictures": "This is amazing❤️", "grebditch": "💛", "rosieclewett": "👍🏻👍🏻", "_jentho": "Love this!", "amyfclapham": "When I was younger I used to do contemporary dance but fell out of love with it. I’ve recently taken up pole dancing over the summer and it’s such a confidence booster! 💪🏻💃🏻", "elena__hall": "❤️", "sasha.chauhan": "❤️❤️", "dodgerfan04_": "❤️", "parapmo": "❤️", "hopelesshearrts": "I’ve started Zumba and freestyle dance at my gym and it’s so much fun!!", "leithinan": "That's amazing! You're amazing! 💚 I used to do showdance when I was younger, but I was never any good at it 😅 but I absolutely loved it!", "jonnarogers": "👏👏", "steelcutoaths": "I live in the US, so I'll have to like a comment, since I can't buy the products to help!", "beetrootontoast": "🙌🙌", "mopsemilka": "I also danced and loved it ❤️", "gabe.sla.vh": "Actually such a good cause so I may as well comment", "sophiemax007": "awesome 😍😍😍", "aynilaa": "I danced for a few years when I was in primary school and then played tennis for 13 years until I didn’t enjoy it anymore. Now at 23 I want to dance again but with a different approach and idea behind it. I want to use it as a form of therapy as it can be an incredible outlet for all sorts of emotions and experiences.", "mrsmeganupton": "❤️❤️❤️❤️", "nathalia_kismet": "💜", "clemence_lambert_": "My first periods began just after my athletism training 😂🏃‍♀️ love the project! ❤️", "danamite96": "🔥🔥🔥", "_saffronmae_": "❤️", "rafaelahaygertt": "So cute❤️", "tove_westerling": "❤❤", "jasmine.b99": "🧡", "annikafiiona": "so so great!!", "erinnnorris": "💚", "linalet17": "So cute! And such an important cause", "sleepsirenuk": "💕🙌🏼", "alex.xef": "🙌🙌", "myoki_van_den_heuvel": "Great pic❤️", "parrmexian": "If you're in Glasgow any time soon you should come see my Samba youth band!! We love playing and we busk all the time. Would love it if you came 😁", "annieharney": "❤️❤️❤️", "severine_darkora": "I used to do karate when I was in my late teens/early twenties and hated training when it was that time of the month because I was worried I'd bleed through my white uniform. Thankfully, this never happened. I don't have any physical hobbies anymore due to illness and being too tired after work, but I used to enjoy going to the gym after giving up karate. It's something I want to get back into because my workouts, although no longer than an hour, made me feel good about myself. 😊", "imixxxx": "🔥", "dear.nellie": "I played waterpolo as a kid and teen, and I never missed out on trainings because I was lucky enough to have sanitary products. It made me so much stronger to be able to train every time, just like the guys on my team. 👍🏼", "talkirby92": "Amazing 👏🏼", "abbieeeknight": "❤️", "katiesoddsocks": "I am a terrible dancer, but Scout camp would’ve been completely impossible without period products. Period shame is bad enough in a boys club without leaks.", "heledeh": "Sailing, dancing, tenis, dancing, painting, languages 🙏", "roshi_ym": "👏🏼👏🏼", "sunshinesarahxo": "They're doing such amazing work! 😊🙌 xo", "zoe_cheney": "Such a great cause thank you for promoting this", "kirstyh113": "Woohoooo! 🙌🏻🙌🏻🙌🏻", "sja_roh": "♥️", "anyasfrancis": "Memories! @hannahwitton @erinsevink @mayonnaise92 💃🏼", "celease_bre": "I liked to do theater when I was younger! 💕", "nontoxicglitter": "I’ve been an actress since I was 8 years old, and 10 years in I think it’s less of a hobby and more of a profession, but I think it still counts!", "timgilbert53": "Beautiful photo of you 😊", "rachel_weaves": "I used to dance when I was younger, but I gave it up. I need to get back into it!", "alxchipka": "A comment", "joyfullyrare__": "Such an awesome project! I loved to do gymnastics + be outdoors. Now I’m more relaxed haha but the one interest that always remained from childhood is photography!🖤", "nerdishbutcorruptible": "Lovely Hannah from a long time ago! ✨", "enablednotdisabled": "Do you know of any adaptive salsa classes?", "justpotatoing": "that is cool", "sarahjuricek": "❤️", "total.mess._": "💓", "_.its.emilyy._": "We ladies love to bleed 🍒", "mi_chael8386": "🖒🔥😍", "summer_swb": "Yaaasssss. I went to YALC recently and I loved how there was a bunch of free sanitary towels in the bathroom courtesy of your book! Doing good stuff.", "lollipoppy_unicorn": "❤️", "jemimaruby_": "❤️🧡💛", "just_eve_all_over": "This is such a good idea. My friends used to put on shows in our estate at home, with full dance routines and choreography. It's hilarious when I look back at it now, but so much fun back then.", "sophieissoft": "i used to play tennis when I was younger, but chronic pain makes that rather difficult now. im a member of my local youth advisory board and I couldn't imagine my life without that now, it's so incredible. and of course, girlguiding has been a constant throughout my entire life for the last 6ish years", "hazel.mead": "Ahhhh been thinking about joining a salsa class! You look so joyous here!! 😍", "laura.e.tr": "Good", "ariloola": "❤️", "marleycambridge": "❤️❤️❤️", "_rebeccagault_": "I used to horse ride. Now I rock climb and sword fight 😅", "saran.rhea": "❤️", "amberoostra": "@elianneverhoeven every like/comment till your birthday!! now u gotta spam this!", "phoeb.eh": "I used to play rugby and football but now I throw javelin!", "niamh_m_kelly": "I did loads of gymnastics and cheerleading, but after a few scary experiences I decided playing flute was safer 😂", "nius_art": "What a great project 😊 ✨Too bad they‘re not doing the same in Germany...we‘d need it 😭😭😭We have 19% tax on tampons right now...", "katherinehughes": "I love this project! I think reading is probably the only hobby I still do as often as when I was a teenager 🙈But I’m keen to get back into netball at some point as I loved it and the World Cup matches were really inspiring!", "solorrabalis": "😻😻😻😻", "nixonsophie97": "I used to do horse riding until I did my ankle in. Now I like reading, much less hazardous.", "emmaaaa123_": "💓", "siancowan": "❤️❤️❤️❤️❤️❤️", "racheleileen52": "❤️❤️"}