{"outesspace": "can confirm this is 100% effective, I feel so much more comfortable with nudity and my body since my girl friends and I stopped giving a fuck about being naked in front of each other", "nacorthi_aka_steve": "put the book down", "paulspencerphotography": "Teaser, show us the goods lol xx", "stringpuppetmaste": "That's what I learned at the Naked Club when I used to travel and stumbled upon the nudist colony in North Baker Beach at San Francisco when I was attending University for sculpture. We should really do this as a photoshoot together because I'm preparing myself for massive revolutionary change when everyone is finally catching up to the ideas I've been presenting or did you miss that charade with @weeb0jones telling me my \"prude culture\" was just something I was using as an excuse? Did you get the message of the coed-topless pulp fiction club on twitter? Next time you're in New York, why not go down there and show everyone they aren't bullschnikeying about Prude Cultural norms still being dominant in a state that allows full-on female toplessness except too few women even know or care to be topless in public because the stigma is still too firmly entrenched in them and needs to be under heavily public scrutiny before these attitudes can be dismantled by the #squadrineofquadraceps and the #biggytiggytittycommitee that starts on Sunday morning, next weekend when I get to my destination and show everyone who isn't playing around when the pressure gets too high on me to do something for everyone else's best interest (except the prude culture normativity schmoof-a-holics)", "kaldizon": "I can see that you're a San Miguel girl yourself huh", "melias_c": "Yes! So much this!", "monaarteshi": "Nice", "alexlunamarie": "You're able to drink beer again? 🍻", "roytulin": "I just think that reading paper books next to a pool seem impractical 😛", "frostbite939": "#freethenipple", "wheeze_nl": "That's why I love Finland and the Finish, sauna FTW!", "unlucky_vampire": "Tease", "josephbriscomb": "🔥❤️", "corranjason": "🔥🔥🔥❤️❤️❤️", "shivaqueenofwhales": "coming back to this image from your top nine because I remember how much joy it gave me the first time. literally just sunshine and contentedness personified. it's so nice see naked bodies in an unsexualised context", "fiveseven92": "And how do I find your podcast @hannahwitton", "shivansh795": "Naked", "rated_ren": "Free those nips 🔥🤤", "vee.wilde": "@rach_t96 let’s get naked", "braienjohn": "Nice❤️", "annacarmel_": "@_lucy_charles_ @sophiegrice7 @sophieruben @mim.hyde @harriet_salt feel like this is us in 5 years time yanno?? #weneedanothergalsholiday", "ashleenhora": "Girls who have longer hair can hide their boobies 😂 just a fact!", "asmuni44": "R u looking for a husbamd?", "rayattwell81": "Your such a beautiful and gorgeous young women Hannah 😊😘", "rob.henry": "You need to share those girls with us all.", "jomsphotos": "Omg great book!!", "aaronchampion8": "Get it girl!!!🤩🤩🤩😍😍😍😘😘😘😉😉😉🧜‍♀️🧜‍♀️🧜‍♀️👐👐👐🤲🤲🤲", "charis_walton": "You’re getting a lovely glow- looking so healthy! 💖", "peggy.rae.art": "Yup! I first started doing life drawing at 16 and I swear it's the reason I'm not hateful about my body. I ended up just loving bodies of every weight/shape/ability. Still have moments of struggle, but they don't last long", "littledracula07": "Love His Dark Materials series!!!", "oekotrullala": "❤️", "bymariaelizabeth": "@deevious83 remember breast confidence evenings? Maybe we need to bring them back? X", "sophiecourbois": "@astridgroenen @iljaoosterbaan @wiblywoblytimelord 🙌😂", "whyaliceofcourse": "Also that is a great book", "conductormike774": "Oh my... 😍😍😍", "katierobyn88": "@sarahgotthegram Adult getaways with minimal clothing are good for you... Dallas will be so pleased lol", "jimmdoeslife": "😲 😳OMGosh! I’d never have the 🥜 to do this! You truly are an inspiration Hannah!", "primezulu101": "I identify as a naturist, and have been to many nonsexual clothing optional events, and I tottaly agree. My body confidence only got stronger! Not to mention as a man it changed my respect for and helped recontexualize my relationship to women's bodies. This is a really fun photo I love it. Cheeky AF. Thank you for posting!", "nga_group": "Beautiful And Super Gorgeous Pretty Cute Angel. 👆❤💘❤😘", "pakao02": "Amazing picture", "rdelvax": "Careful with that book, you don't want it to get wet... Maybe you should put it aside :p All joking aside, it's great to feel comfortable in your body. Wish I could... Unfortunately, some scars, even though they are invisible, can make you feel extremely insecure...", "fechernivi": "This image (and by that I mean you) is so beautiful and HOT that I ad audibly gasped. 💛✨", "vickypineapple": "This photo scares me just because I'm worried you will drop the book into the pool 😢", "trenchtrash99": "Completely off topic but I finished reading Northern Lights yesterday! 😂🖤", "ashleeyoungblood16": "I love this photo! I wish I had this level of confidence! I’ve been trying hard to work on it!", "kammmm_56": "\"Thick thighs save lives\"", "patricklavalley": "As a naturist: one of us! One of us! It's amazing how many worries wash away when you just don't care what you look like and aren't afraid to show off the imperfections.", "mike_s.a.nder": "Sorry, but with all due respect you look chubby and your boobs look saggy. Plz don't crucify me.🙏", "vincentjbateman": "😍", "mdd2014": "Wow", "geoffmegasmanning": "😍😍😍😍😍", "hellouise78": "I hope you are having fun! Enjoy your vacation.", "chloemiliax": "I used to live here! I would highly recommend La Bodega if you’re still there and want to try some INCREDIBLE tapas 👌🏼👌🏼👌🏼👌🏼👌🏼 Also you look stunning 🔥", "plunkybug": "I’ve begun my re-read!", "ins0mnico": "Too bad I have crippling body dysphoria and would cry if anyone saw my chest 🤷‍♂️", "8188447092sz": "Thats my babymama", "shelliegail1986": "Seems like a wonderful spot for reading!", "viper_halberd": "You're gorgeous and very inspirational! It's weird to be proud of someone you don't know, but I'm proud of you!", "rosannahiggs": "Japanese onsens 😊", "rydog02": "Where are you that you can find a San Miguel? I’ve only known them in the Philippines and some beer specialty places in the USA", "justicekenneth57": "Now thats SEXXXY HOTTT BEAUTIFUL yummy🔥🍑😋😋", "nat.erinn": "you're adorable!!! 😍", "leefbeef": "i did this today at Riis Beach w my fren", "zaxaron": "Suns out torpedoes out", "mkuskie727": "Please put the book down", "londonbisexualsmeetup": "I'd also agree with naturism as a help for confidence; I was sooo nervous my first visit to an outdoor spot (hidden away in woods near Lewes, Sussex), even after a trip or two to Rios sauna (Kentish Town), but everyone else there was relaxed and after a while and noone staring, it was so liberating just walking around without a care! Skinny dipping in the pool was fun too of course. I", "rxnewave": "👍😁😉", "papa.donzkie": "My Ghoood", "larryvanmersbergen1": "Wow. Very sexy. You have amazing tits 🌹", "gshope123": "❤️❤️❤️❤️", "mccabewarren": "@chickenfishman reading with your tits out is always great!", "eleanorbullough": "@inkedimagineer @sofiabrighttt @gabrielledickens @sophiewat1 don’t mean to be gay but I feel like this is us??", "rmenzies3032": "Hannah obviously a professional meaningful post but the photo is just the biggest tease ever 😳🤪", "curiousjade": "love this so much 🙌🏼", "janemtomlinson": "@teyshie 1 step ahead!", "lolamallorca__": "True ☀️🌴☀️", "paul.driver.1401": "Enjoy the freedom, 💚 be comfortable in your self and love who you are", "fabgabw": "Is that your first time reading His Dark Materials? They're so good, currently listening to the audiobook of the new series, which is also brill!", "barrypink25": "Naughty 😉", "boudewijnbart": "You're so pretty Hannah! Your body is amazing!", "kaitlyngomme": "I’m loving the freedom I feel especially from your lasted posts!! 🙌", "4kingvillage": "🔥🔥🔥🔥", "aaalisonn": "There’s a nude beach on the island near Toronto (where I live) and I went a few times last summer on my own and it gave me a whole new perspective on bodies! I never critiqued others’ bodies the way I critique my own and NONE of those people were critiquing me! It made me so much more comfortable with how I look 💖", "deeizzie08": "❤️", "champichar": "You look so cute!🙌", "truck737": "Beautiful 👀", "adp429": "Need a pic without the book", "jegography": "Hurrah, I think body issues would disappear in a nudist world. it would be so obvious how gloriously varied bodies really are, and how nearly no one looks like the narrowly defined vision of beauty we're so used to being fed.", "browonder": "Living in Japan and going to Japanese bath houses hasn’t really boosted my self esteem per se, but it made me go “oh. I feel like a fine and totally normal person.” Lol", "samantha.strutt": "Totally agree I love wearing pyjama pants and that's IT, this is a tits OUT household", "restaurantdiferent": "🤘🏽🔝🤘🏽", "jaydecasey_": "you are beautiful!", "rachellockedigital": "Hampstead Heath Ladies Bathing Pond is perfect for this too! ⛲", "aliceebxox": "More focused on Pullman!! Love!!", "wellness_by_norah": "Love this!", "cloudfightback": "All I’m thinking about is that you have great choice in books. TV series coming out soon, very exciting.", "ofpurpleradios": "😍😍", "jazzajohn": "Such a naughty face", "jerjprk": "😍🔥👏", "the_spectacled_bear": "Lovely picture Hannah. The feeling of freedom is tremendous. Thoroughly recommended. I totally agree with what you wrote in your last paragraph.👏😎", "tracedominguez\nVerified": "Verified", "iam_oink": "San Miguel beer pale pilsen 👍🏻", "ollyspecterscott": "you're actually such an inspiration", "chantel.fp": "@carmelacaridi @steph.nard @blondeindividual @rhiannanc", "sirk133": "so, what are you imbibing?", "justjaimeleigh28": "I think you mean a breast of fresh air 😉", "acstephanie": "@hannahwitton very true! In Nationale Theatre School of Canada in Montreal, all the girls shower together every morning after our daily work out session! I’ve never felt that good in my body in my whole life! 🙋‍♀️Hi, I’m a french canadian (québécoise) actress with ulcerative colitis ☺️", "lyss0990": "I need friends like this!", "daniellewlodarczyk": "How is this literally the cutest picture ever taken of anyone 💛", "jodiesanter": "I did burlesque lessons a few years ago and being around so many women in underwear was the best therapy!", "henry_pollard": "😭🔥🔥🔥", "lewisbugbyesq": "Great book", "damian.lyons": "😍😍 😍", "melissa.emilia.blanco.foster": "I hope you enjoy the beautiful Cala D'Or and have a great holiday! (It's where I work ^^)", "amber.the.sad.potato": "Yay boobs! I need girls to go on a girls holiday with 😭❤️", "jcdittogmail.com_": "As a great man once said... \"Whoa...\"", "trevor_the_gardener": "Mmmm, love Sam Miguel 😉", "gloradtech": "Also, I participated in The BoPo movement 2 weeks ago at a clothing optional party. I Always love the liberation. 😁😁😁☯️🕉🌍🌎🌏🌟🌠🌛", "anderson.edward13": "Damn book...😂😂😂😂so happy your holiday is going great. As a man that is impotent from my urostomy surgery i get so much laughter on your page! THANK YOU FIR SHARING!♥️", "kareem_0693": "You’re amazing", "faithbiddle": "@kcfraser1 maybe this is why I love Hampstead Heath.. 😆", "laurenlollu": "@charlotte.oatley @_.jessx up for this lads? 😘", "thedoctor_dances_2017": "I love this but I have a question. Though I’m sure my girlfriends and I would enjoy this, what types of places would allow this? I live in the US and wouldn’t be sure this would be permitted. So, sort of a nude beach, any tips for places or things to look for??", "davelovesnoodles": "I always go tits out.", "cmarree": "Yes! I so agree with this. Girls holidays are great for this. Also (this May sound weird) but at my leisure centre pool changing rooms everyone chats after a swim class and are just comfortable getting changed around each other etc and it’s so nice that it’s just normal!", "ehodgkin": "@aisbrennan93", "emmallew_": "This seems like something we would do @joanna.mcmahan", "paul_chewy": "And good for you Hannah", "dnew43578": "Hope you have a great holibobs", "dooley1414": "❤️❤️", "amalbarks": "Hammams in Morocco is your cure", "chrisdefontaine": "Great Picture And Nice Body", "dearjenna": "Also can agree that when I finally stopped caring about changing in front of friends or being topless in general it was so relieving", "djmikey_v": "😍😍", "mclawz": "You are 💯 correct!", "caparod": "Imagination 😍😍", "theclumsytreehugger": "I think it’s wonderful that you have such a close relationship with your girlfriends, I have such body hang ups but I’m in the process of working on them 💪. Also you are beautiful! ❤️", "kitcaz": "You might enjoy the Kenwood Ladies Pond next summer if you're feeling more confident! All bodies welcome and toplessness abound!", "daphnevanpul": "@rosalin.b this will be us 👌", "darren.arnold76": "I read that as Dr Kanye West 😂", "dianaaricciardi": "it’s so true though! i’ve spent a lot more time in just a bralette and sweats around my house, sleeping w minimal clothes on and it’s honestly improved my self confidence immensely!!!", "vipiknows": "Philippines no. 1 beer SAN MIG Pale Pilsen", "rekaago": "This is so awesome! Friends, pool, book, beer - literally perfection.", "cbirdward": "Yes! My most body-empowering moments came from being non-sexually naked around other naked bodies 💕", "dnhck": "@arrete_toi you see", "i_wrote_a_letter_to_the_moon": "lol I don't have to be naked, I just want to start with wearing tight and short clothes without feeling super insecure", "jason_jdubb": "You have sexy curves. I bet you go topless whenever you can because you have such big boobs", "mrsmster": "You wonderful, brave woman! 😍 You really do give me courage as a woman 😊", "maya.ty": "@athertonrose @holly_kilner our mantra!!!!!", "edc_shwee": "😍😍😍 Gorgeous", "jagarland35": "Beautiful! 😍", "heypoppyj": "@marypyno 💁🏼‍♀️ that’s why we’re besties", "aalbesje": "Cheeky!!! Love it!!! 😍😉", "chronoswritefriend": "Hell yeah! Free the nipple and being comfy around friends topless in general is great! Wish you'd extend that to your online presence but that's just me being me.", "osariemenivie": "@atrociously @falkenbeerg @julie_roesgaard", "vesteralexander": "Scandalous 😉 hehe 👌💯🔥", "jamesfieldphotos": "That damn book in the way, you are ideal girlfriend/wifey😁😍😘", "internet_citizen": "You cheeky lass.", "bonthemightybon": "Is it a private pool, or is the place just super cool? I'd love to have a holiday like this, but I always feel so vulnerable around strangers (read: men). Love seeing you look so happy and at ease! 💚", "jolie077": "💕💕", "shareefa_j\nVerified": "Verified", "bom.jia": "You look so amazing ✨♥️ I really admire you. I wish I would be as brave as you", "rui.carrico": "That's why I hate books 😂 🤣 😂", "janeshelton_": "😳", "jpayne9009": "Beautiful", "helleuesther": "@thejailbirdbunny !!! Scientifically studied!!", "robdbp": "🔥🔥🔥", "antonellakuong": "🔥🔥🔥🔥", "dirkdevreugd": "What a book", "merlishness": "You're a true inspiration Hannah ❤️ :3 !", "ashley_osto_life": "I could never be naked around people even my gf doesn't see me naked so awesome huni u go girl", "mckoss": "The side-eye sells this photo! 😄", "theopinionatedfella": "#FreeThemBoobies kind of curious how topless is somewhat acceptable but bottomless is a whole nother level. It's funny that, private bits framework we created. Would you enjoy a nudist vaca kinda thing or is that a whole nother level. I am not sure eitherway by the way", "mollydidthething": "@gilmore.z @leahmortimer gals hol goals", "pauldave1987": "You know I was having a crappy day then I saw this and thought you know what the worlds not so bad❤️", "jess_oldridge": "@christine_withers next year aye", "ajmtl12": "What are you studying there @hannahwitton ?", "dave.turk": "😍🔥😘✌️", "marcusmc1976": "🔥😘👍", "chinobling03": "👍🏻👍🏻👍🏻", "kel_leesi": "@katedegruch @a.mich.burn.book @weezy_loves_you", "billy.campbell.1088": "God....you look beautiful 😘", "hxnnahevelyn": "there is a woman in my gym who always showers and gets ready in plain sight and honestly it makes me feel really happy to see her living her life and not giving a shit as she rubs in her moisturiser!", "arik_2103": "You could say it was a \"breast of fresh air\" 😏 No? *leaves*", "emmalavooooie": "You are awesome", "wessywok": "FKK!", "alena_hnl": "This weekend I finally convinced myself there is nothing wrong with showering at the gym, and I am so proud of myself I finally did it. It took a lot of courage for such a stupid thing🤦‍♀️ thanks to posts like this that help to encourage insecure people like me", "darrenjwilliams2108": "Naturism is a great lifestyle Hannah, I recommend it, you should try it, hope you enjoyed the freedom this afternoon", "mahagicienne": "@lbarthod hâte qu'on soit riches, qu'on loue une villa avec piscine pour faire ça 🥰", "dan_finn_4": "What an inspiration you are like omg, wish I had that level of confidence ❤️", "softaquatwine": "totally agree with that @hannahwitton", "michael14848": "If you’re that confident why wear anything at all!? :p", "megashton13": "In Japan we went to an Onsen and it was amazing and refreshing - bodies are just bodies!", "rachmm_": "Your confidence is a pathway to less insecurity for everyone else and I think that is an amazing thing!!! ❤️", "_yazeed_anabosi_zekoo": "🔥", "popejohn55": "happy for you that you are enjoying life", "shauniewoo": "Make sure you put sun cream on them, burnt tits are not pleasant 🙈😂", "kayleekruisen": "I wish I had some girl friends that would be down to do this. It seems super liberating and just an overwhelmingly body positive experience.", "jerrykokkat": "🔥🔥🔥", "lefttemporal": "To quote The Marvelous Mrs. Maisel: Tits up!", "toyoacamry2011": "Can I see them", "nicolekelliehand": "omg i love u", "jindijoosten": "Loveee this 🙏", "nickegibbons": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 Go for it Hannah. Give naturism a try👍🏻", "thinking_about_figures": "I don’t even know how this would happen. Does one of you take your top off and then the others do the same? Do the first person ask if it’s ok before they do it? Or do you all decide to do it together? Sorry if that sounds creepy and weird. I’m just trying to understand how this situation happens because I can’t imagine it actually happening.", "_aridges": "Stunning and very brave keep it up", "foteini_margariti": "oh I've cried so much reading the third book of this trilogy", "iosonofrekt": "I love you ❤️", "seanyt": "Hannah you’re awesome!!👊👊🤙🤙🔥🔥🔥", "x_spaceybaby_x": "Sksksksk you're stunning", "domesticdiva53": "Living in Florida we frequently skip clothes. We have an outdoor shower. #lakelife", "graham_m_hand": "I didn’t think you were the nudist type I myself love being naked but because I’m a fat hairy male it automatically makes me a pervert", "miscellaneous_caroline": "When we go to naturist camp sites with our family (♀♂and 2 -16 ♂) the most important thing I always take home is that there are so many different bodies and that we can only feel privileged for having bodies that aren't sick or damaged... 🙏😍", "sankar_dhayal": "How beauty❤️❤️", "mi_chael8386": "Have a great day.", "petewarchol": "Incredible photo! Magnificent!", "tjamieson23": "Whoa....😅😅😅", "mariapia.coronel": "You are sooo beautiful!!! 💗💗💕💕", "lilrobby10": "❤️", "joe_wanderer": "Looks like the bikini bottoms you bought in your video with Sierra ❤️", "zoecollins1994": "You are bloody gorgeous 🔥🔥🔥", "julie_micko": "Love this 🙌🏼💛", "annesview__": "Yaaaas Hannah!!! Do you! 🔥🙌", "lovely.merrick": "Hey Hanna, we have way better beer brands in Spain.", "stewpot_1138": "The naughty look on your face lol", "juiceandjasmine": "THIS 🙌🙌", "a_process_not_perfection": "I couldn't agree more! Being naked in the sauna totally began resolving my body insecurity issues.", "barry.kennedy.980": "I wanna see the northern lights😍", "_chloede_": "All I can think is “don’t drop the book in the pool!!!”", "lonewolfealex": "You are Absolutely Beautiful Hannah 😍❤️", "mrstevendarby": "I've never hated books more than I do now.."}