{"beardiful_ryan": "Gorgeous smile, nothing more special than a happy smile", "ella.preuss": "Yay! Congrats girl, looking great!", "pinkflowers40": "Hi glad your home", "jaymonstar6": "@hannahwitton will you marry me?", "mkaaaa8971": "Godbook", "madisonjmims": "Glad you're feeling better 😁", "liquidlen8": "Keep that smile on, laughter is the best medicine. Get ready, spring is coming!", "scott_azbell": "Fellow ostomate here. It gets easier every day. God speed!", "brihannonstrathern": "So glad your feeling better!! Xx", "1fyouretooshy": "I hope you’re doing well!! ❤️", "asiddigm": "All the best", "heysandranat": "so happy for you :)", "peachpaaige": "So glad you’re feeling better! You deserve all the best in the world 🖤", "nickypowell07": "Goodluck tonight going out with family xxx", "lexmlny": "It's fantastic how transparent you are. Hope you're healing up well :)", "joolez.ai": "Love it.", "bumble_and_be": "Sending big hugs your way my lovely one x", "foxy_menace": "@hannahwitton will you be doing a permanent ostomy or going the J pouch route since you had UC?", "merel_verstappen": "@sarahklijsen komt zij je benend voor ?", "___mieema___": "Congrats ♡☆", "muhrieyuh": "@hannahwitton I DM you as well but I will post it here, since you made a video asking about the stoma community, look into stomawise! They host lots of events where you can meet more people in that community, they have one coming up soon.", "jrkirkley82": "So glad you're feeling better and healing.... you're awesome Hannah", "im_rehaan_": "Nice", "damaged__soul_": "Perfection ure so beautiful 😍", "yogagirly28": "Glad your doing better love your tee.", "sky_1722": "I love you so happy your better💕😘😘😘", "hasaninri": "Seeing you recover makes me happy ☀️", "hmmsaurabh": "Hi Hannah,do you lost some weight, you are looking good", "thinknathan": "Wishing you all the best Hannah! Glad you’re recovering well", "becdolina": "Aw hope you keep on the mend girl. You are amazing and inspiring! As a fellow UC sufferer, I get it. ❤️", "oldpine99": "Hope you're recovering well! 💖💖💖", "charleyy1997": "So glad you’re feeling better ♥️ you’re a true inspiration to us!", "liljessmo": "So happy you’re up and feeling better", "harjinder_singh09": "Lovely smile my friend 🌺🌷🌹🌻🌼", "christianameow": "You look beautiful and healthy! My niece had to have her colon removed. I’ve been seeing your posts and thinking of her and how tough you both are! -a random fan who is ver thankful that you’re sharing this story w us", "picketspickets": "Awwwww Hannah you're so fabulous! I think you're my favourite Insta celeb alongside one who just adopted a cute baby, that's how nice you are Hannah. You're so nice", "intuitivelyfree": "get well soon!! xx", "astoldbykerry": "Just had major surgery but yah brow game STILL on fleek", "iqei": "Glad you feel better. Hope you have full recovery soon.❤️❤️❤️❤️💐", "shao_linn_fantastic": "How's the recovery coming?", "sean_toom78": "You are so pretty 💖 I hope for you to have a speedy recovery 💐", "lia.penny": "Slaying 💪💪💪", "sammy_malone": "Stunning 😍😍😍😍😍", "kerrycurranadams": "🌸💕🌹", "priscillavdlisle": "🙏🌟", "aniluzavalaa": "💗💗", "oscarc89": "You look incredible!", "emsladedmondson": "👊🏽💋💕", "sladewgz": "Really glad that you’re healthy", "annika.am": "yay!! ♥️♥️", "missjulievu\nVerified": "Verified", "vickynowak_": "You look amazing and I'm so happy you're doing better. So proud of you!❤❤❤", "kirstyh113": "Yay! Glad to hear you’re on the mend 💙💙💙", "haleyrpotts": "❤️❤️❤️ I'm super glad that you're okay!!", "cupcakesinthesky": "Yayy", "panda180602": "❤❤❤❤❤❤❤❤❤", "guroaf": "😊😊😊", "emilys_travel_diary": "Glad to hear your better and I see your hair had grown", "grace.o.carter": "You look amazing Han", "margonton": "So glad to hear you are better! Hugs from France!", "bluegill2010": "Glad you are doing well! Have you ever met Rebecca Zamolo? You two have a great deal in common...her story might be useful to you.", "mrdrew1555": "@hannahwitton also glad to hear you're doing ok", "elliebombelli": "So proud of you!💞💞💞", "holly.howard27": "so happy you're better!! also your brows look insane !! 😍😍", "heulwen.sj": "You look well!", "steveratke": "Nice shirt. They was my favorite part of visiting Memphis, by far", "simplyh90": "Looking fab!", "the_notoriousk": "😍 you're beautiful", "jazibaz": "You've just been recommended to me in Instagram so thought I'd take a look. Shocked to see you in a hospital bed but happy to see you're back on your feet. Hope you're feeling better. Look after yourself ✋", "alyssiamrenee_": "Recovery is hard, so proud of you !", "hermionebenson": "So pretty! Hope you’re feeling a bit better every day! I seriously admire your strength.", "lucymaywalker": "You look amazing, you’re being SO strong- you got this @hannahwitton xx", "gabipfau": "Yessss! So happy to see you feeling better!", "crafty_elle": "Amazing! @hannahwitton putting on some makeup always made me feel more human! One day at a time ❤️❤️❤️", "mandymandy88": "You’re such a inspiration to those of us with chronic health issues. Thank you❤️", "tharcblack": "Keep on keeping on! :)", "issa.lias": "Thirds caught me off guard. You just look sup eccentric", "luiz_corvo_marcos": "i'm so glad u are gettibg better. when i heard bout all that stuff i was in chock", "hannahmiall_": "Such an inspiration to us living with chronic illnesses sending you all the love 💕 xx", "alicewarb": "You go girl!", "anna4y4e": "You are an inspiration, and as usual you look great, love you girl.", "softhands77": "So glad to hear you are feeling better!!! Nothing like being in your own space after a Hospital stay!!! One day at a time Sweets, you’ll get there!!! ❤️❤️❤️", "ajkolikes": "Yeah, you look glowing, it's good to see you :D", "nooraldayeh": "Yayy! So glad you’re back home, good luck with recovery!!! You are awesome ❤️", "_seeking.happiness_": "👌", "intothewylde": "Go you!!", "littlefear1": "So good to see this on my feed today! You're a hero 💪💪💪", "farouhabadr": "Hannah it is so good to see you doing better I hope you’re indeed doing better XX", "kevinmiguelsahagun": "So good to see you doing better", "tomdharrington_": "Go on pal", "dommymartinez_": "So happy for you!", "moneylux": "Hannah , you have very pretty eyes !! Great Luck with your recovery !!👍🏾💯", "x.katieriley": "YASSSS", "trencher_22": "Great! Hope you are feeling better xx", "marziesreads": "You look well and beautiful! 💜", "ksenia.tserkovskaya": "You look fabulous! Hope will feel totally fabulous soon too🙌🏼", "grebditch": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "vanessaafrz": "It's so great to see you getting better😊", "audreeeli": "So happy for you !! Sending nothing but good vibes xxx", "georgiasambrown": "Is your stoma bag temporary or permanent? It's lovely to know your doing better xx", "isabellarosing": "🧡🧡🧡", "evie_addelman": "YESSS GIRLL", "_rosadasilva": "Thicc brows", "tetrrapak": "Your attitude is really inspiring. Wishing you a quick recovery 💕", "bromblewood": "I'm so inspired by your positivity Hannah, I found out about your channel though you B book club vlogs and have always been impressed by your openness, love of life and intelligence but now after everything you've recently been through I am blown away by how you seem to just take everything in your stride. Thank you, it's people like you that are lights in these times of negativity.", "pasghettios1": "Rockin this recovery like a true champ. Keep it up! Knuckles 🤜🤛", "fizzco": "Stay happy! Pushing all my positive energy to you!", "lamellos": "I‘m so happy for you, Hannah! 💪🏼💐🍀", "kimmie_chan95": "You're looking beautiful Hannah 😍", "buffysummerswannabe": "This made me so happy for you!!!!! I'm sorry you had to spend so long in hospital, but I'm glad that it should help in the long run! Sending you lots of good vibes for recovery!!!!", "zoearianaedwards": "Nice shirt!", "_valentina_b._": "You look beautiful, best wishes for your recovery😘😘", "lorna_x94": "You’re a superstar 💪🏼💪🏼", "robzy_robz": "I'm also recovering from something and before going into the procedure I was very nervous but your optimism and positivity pushed me through it. Thanks and wish you a smooth and fast recovery 💕💕", "emilywagdin": "Gorgeous!! Keep going xx", "shannonleigh14": "I'm so proud of you!! 💕", "ellie.kaitlin": "So proud of you!!💖", "phil_k_2009": "Looking good @hannahwitton", "singerwb": "aw, good job! so proud to see you keep going. 💛💛💛", "phoebee1996": "@lottiejackson20", "zwargify": "Praying for you. Feel better 💜💜💜", "lucia.0.x": "Wow how courageous. You are beautiful. God loves you and is proud of you. X", "paccontreras": "You look great. Hope you recover quickly", "nolwazinkwandla": "You look good. And it's nice to know you are slowly recovering back at home and not in hospital. Sending love from sunny South Africa ❤❤❤", "christina.maki": "Gorgeous smile! I wish you a quick recovery❣", "ellacharlie_": "You're such an inspiration with how positive and calm you've been about all this crap you've gone through. Total wonder woman. Hope your recovery goes smooth xx", "kowalskinn": "You are so pretty", "__rahul80__": "How about a new youtube video ? I'll be waiting", "smile515151": "You are amazing", "scharlie_scheen": "you look good, too. i mean it looks like you are getting better! 😄👌", "emmacauvin": "So happy for you Hannah! Wish you a quick and easy recovery 🌻", "donathanuk": "You’re so fit.... probably of all London hope you feel better lovely xxxx", "gabby_olivari": "So proud of you @hannahwitton 💕", "rachelm_91": "Looking beaut x", "kenimora": "You look so skinny.omg, get better!", "bobbykingtv": "Man, how I missed that smile! Great that you are back. Hope you’re feeling better.😻❤️", "marceaguilar02": "And you look AWESOME", "luisramirez2323": "You look so beautiful 😍🌹🌹🌹🌹", "viscious_uv": "Keep it up!", "rhck2278": "You look great", "foragebotanicals": "Looking beautiful", "spenkoeries": "Good to see up and about. Have a awesome day hannah", "unjaded_tyra": "You can do this!", "miriammutig": "I hope you recover quickly! 💜", "fabiennesings": "😘", "chefcdp": "Glad you are feeling better", "emilyyygalvin": "super glad you're feeling better - really hope the recovery keeps going well xxxx", "yessiow": "Good to see you Hannaaaaaaaaaaa love yaaa!!! ❤️❤️😘😊", "thereelkylestyle": "Way to go! Great to see the positive vibes!", "lottiec8": "So glad your recovering well :) x", "mollysdailykiss": "Oh hannah you look sooooo much better and i don't mean because of the make up but because you look way less poorly. I bet it feels good to be home", "jane.fysh": "you're glowing!", "nataliaivargas": "🔥🔥🔥🔥🔥", "gl563": "💛💛💚💚💙💙❤️❤️🧡🧡💜💜", "megan.cullinane": "I have Crohn’s and would love to hear all about this when you’re ready!", "alternative.au.fn": "You go girl!! I'm so glad to see you getting better and better every day. I hope you celebrate your strength, you totally should 💙💛💝💚💜🌈", "linkamarisa": "I'm glad you feel better now that you are back home. Wish you all the best! 💛", "livtaylorp": "Go hannah!!!!! 💛", "hopecaitlintreasures": "Glad to hear your steadily improving - you got this ❤️ and we are all here for you!", "nataliebyrne": "💛💛💛💛💛💛", "rosaiglesiasm_": "I'm so happy you're feeling better, Hannah!!! We're all rooting for you!!!. Lots of love👏🏻👏🏻👏🏻", "theoriginalpixi": "Yay! Having the energy to put on makeup and do any kind of indulgent self care is always such a great feeling after having been sick. Sooo glad to hear you're feeling good today!", "tje_xplore": "You look great! So proud :D", "z_is_for_esmeralda": "Heyyy!!! You look so much better, I hope you're feeling and are better too. 💪💪💪💪", "ms_morgan_murphy": "So happy you are feeling better 💕", "carmarugaz": "Guuuuapa! 🙌🏻", "nixmhb": "so glad to hear! ❤️", "izzy_nc": "your positivity throughout this entire ordeal has been so inspiring ❤️", "jesse_kiselka": "Best wishes Hannah! @hannahwitton", "fireballdarren": "Love your positivity :)", "kayleighiwalker": "You’re doing amazing and are truly inspiring 💗💗", "b0n1lla_94": "Welcome back, hoping you recovery is well. Take your time getting back to your regular live.", "ken_courtice1": "🎭SO nice to see your smiling face Hannah @hannahwitton 🦋", "douglasgsilva": "Aww! Good to see you back and better! ❤️", "daisyhvnter": "💪💪💪💪", "maryleynchen": "Such a strong, inspiring and beautiful woman ❤❤ i hope you're doing well", "gcasfm": "You absolute 🗻 (Rock!) Happy healing! Give IBD a slap from us!", "nxchxs": "Whoa your hair is so long already! Hope you have a speedy recovery x", "__lifeisnofairytale__": "Woohoo!", "rathna_g_n": "Hope you recover soon😆", "bambicub": "Here's wishing you a speedy recovery, beautiful human ♡", "khushandkhush": "You're doing amazing, Hannah 🖤", "lena_bo_bena18": "I’m so happy you’re feeling better! Keep up the good work!💕", "agaaathe_hb": "Yeaah you look great! You're doing amazing I'm so proud 💛", "amandalwaldrop": "I’ll continue to pray for you! So glad you’re back home 😊", "mimi_lxv": "You've lost weight but nice to see you going from strength to strength! 💕", "comet.jayy": "You're doing great💕💛", "j.rusnak": "Girl you’re killing it!! 💙💙", "leompeixoto91": "It's nice to see you smile again...", "zofkalemba": "Get well soon 😊", "looking_for_a_lighthouse": "You 're looking well and beautiful ♡ Rest, recover, look after yourself. Glad you're back home in your own space ♡ Sending love", "gethinpearce": "Welcome back! Hope recovery keeps.going well", "juliaclaws": "💜 All the best with your recovery 💜", "annaach_": "You look great Hannah!!! We love you💕", "karolina_kubinova": "i’m so happy for you! 😊", "riddikulus_izzy": "Proud of you 🖤🖤🖤", "thepiquantfox": "Being in your own home must be such a balm :) You're doing an amazing thing, healing and recovering your body! Xo", "whateviedid": "I want your eyebrows!!", "taraacaseyy": "You can totally tell you've lost weight you can see it in your face!! Glad you are feeling better girl 🙌👏", "hannah_lou_w": "Yessss! Look after yourself lovely, can’t wait to see you 😘", "lyndaob_": "You're an inspiration Hannah 💕 you're looking really well, all the best for the future 💜 #nocolonstillrolling", "mow_your_lawn_oren": "So glad you’re all better. Or closer to complete recovery! 💐", "_nirmztagram_": "Looking awesome!!", "caleighrosebud": "Woohoo!!! That's great to hear. 💕💕 #selfcareeveryday", "szndmgz": "❤️❤️", "salomij": "You're amazing! Wish you all the best. Onward and upward! 😊", "hollyfrancesca_": "You’re such a gorgeous and strong woman, good luck with your recovery lovely ❤️", "jasgatti": "Ah-mazing, hope a good recovery for you", "l_mowliney": "You look amazing!", "mikeegrams": "Have a speedy recovery. X", "triangularnostrils": "So happy to see your smiling face again lovely Hannah!", "bigpapi360": "You Look Beautiful @hannahwitton", "laurenelloise": "💛💛💗💗 glad to hear", "oloni\nVerified": "Verified", "einfachinka": "So happy for you! Wishing you all the best 💗", "mrsmcstyles": "all the love angel, hope you recover soon💙", "ojaswiisharma": "You have lost a crazy amount of weight Hannah, I can see it in your face. I hope you get well soon again 💜", "jennifa29": "You look so radiant, glad you're on the mend 💚💚💚", "crohnsandcolitisuk": "You’re looking well. Hope you’re gaining confidence changing your stoma bag 💜", "laurajanenorthmore": "Hannah you look amazing!!", "wheremyserenitystays": "You're killin' it, girl! Keep up the good recovery work! ☺️", "breebree379": "im so happy your recovery is going well, you look practically glowy", "sadie_n_badger": "Legend!", "journalsbysophie": "I am so happy that you're feeling better 😘😘", "jenniferjadefrench": "Welcome home!!! So glade you are able to be in your own home. Hospitals are good when you need them but it sucks a lot to need one. It's always nice to be back home after a sent in one.", "bethanwynwilliamsstudio": "🤗", "eine_madel": "You look radiant! So lovely to see you like this even after all that's been going on", "xojdrxo": "You look so gorgeous and healthy", "pheebs_9876": "Well done you! It's so nice to see you taking such a big change in your stride, and being so honest about it. Glad you're feeling better 💛🖤", "ambervanheumen": "You look so pretty, hope you recover soon x", "avaniandlife": "You look great Hannah! My mum had a stoma last year. It takes a little time get into a routine with it and for it to settle down, but you'll get there. Wishing you a speedy recovery! 💜", "its_sara308": "<3", "georgiabeeeee": "Hope you feel better and healthy", "azmahnihar": "💕❤️💕", "minnafridell": "Happy that everything goes forward with your recovering! You are amazing just thought you should hear that!", "lucythegardner": "You wonderful human, can't wait to give you a hug x", "kyalldh": "So stoked to see you're doing and feeling better ❤️❤️", "sofi.kaefer": "Welcome back. 😊", "iamalysffion": "You are gorgeous. Love from Australia!", "patrollerharry": "You lookin healthy girl👍", "lilzoologist": "That's AMAZING Hannah! You go girl! 💞", "ansianxi": "Wonderwoman 💪", "justanotherfoodlover": "You are an amazing person. Take your time with this change! Don't push yourself, just take care of yourself xxx", "annaherridge98": "Will you be getting an internal pouch formed at some point or are you going remain with a stoma bag? Feel free not to answer this. My friend also has UC so i would like to have more of an insight into the condition", "thecoach_s": "Welcome back"}