{"emcarpenter_art": "Hi Hannah, I’ve just seen your video on YouTube. I’m sorry you had to go through all that. You’re so brave! Hope you feel better soon 💕", "zeppluis": "Hope you get better.", "tamararushton": "Hi Hanna could u add me beaut", "hasechin88": "My father is wearing a stoma with the same illness, but I want you to show your appearance to my father and to be positive.", "emmaodrisco": "@lollie.life", "laurainthestars": "I have changed many of these guys as a care worker and I think they are super cool and fascinating and a sign of resilience💪💩", "mary_comont": "Hannah, it’s Mary (we met when I was Lucy’s flatmate). So sorry to hear everything you’ve been through. Looks like you’re doing really well though! My sister’s husband had UC and went through an ileostomy. But it didn’t limit him in terms of lifestyle! He did tonnes of sport and cycling, (he used a great brand called under armour to protect his stoma). They found there wasn’t much awareness at the time so it will be amazing for others to see your story and feel that they’re not alone. Hope you recover really really soon and take care of yourself xxx", "daisybillingtonn": "@ellaha27", "danyszelsky": "Sorry to hear that you are going through this. I know it's a very difficult experience physically and mentally My mom had one too a few years ago due to a bad surgical procedure. But she's alright now and her scar is almost gone :) she still has some problems when she can't really control how her intestine will react to certain foods but other than that she's recovered completely. Hope you do too soon! Best wishes 💕", "vantran2684": "why not. She likes to talk about them.", "kylaasutherland": "Thank you SO much for sharing these pictures and your story. I’m currently in the hospital dealing with the exact same thing as what you described in your YouTube video. I’m awaiting the final decision for surgery to remove my colon as well and had been really scared about it. Watching your video and seeing these pictures make me feel better about what’s going to come. Thank you for the inspiration 😍.", "cheni_mz": "I got mine with 24", "sinja42": "Beautiful ❤", "kerapowellxo": "Strong powerful lady ❤️xx", "lauren__2907": "@clareandrla", "caris_ma": "@melo077", "rauljavier87": "You hace no problem with anal sex, always is clean", "gloradtech": "Quite brave. Many blessings, Hannah. 💗💖", "1dlegendforever": "What happened to you", "maria_moves": "Not for the same reasons, but I have a surgical scar in the same spot for removal of a fallopian tube and ovary after discovering there was a 10 lb ovarian cyst that devoured them. 16 years later and I only see me. Love to you.", "coletr_ain": "this is pretty freakin cool tho", "ayanakelly2": "Oi ... tenho a mesma doença sofri muito ainda estou com problemas com o pedaço q fico tenho medo do que ainda vem por aí bjs 😘", "jessicameckley": "That poor tummy. You'll be better soon once you heal up some more. Keep getting rest!", "nonpete361": "Thank you for sharing your story ❤️", "iharshit31": "Wat happens to your tummy ?", "peony_vintage": "You beautiful beautiful woman. Thankyou so much for sharing and being powerful enough to be open and honest about your experiences. Was lucky enough to hear you speak at The Turner last year. Xxx", "m3ll1e3": "Hannah you’re looking awesome! Recovery looks like it’s going really well and that’s just what us fans like to see 😘😘", "emmaxfirefly": "@p0tat0_trash_666 you should watch her new video, thought you’d appreciate it :)", "alexgporter": "You look fab. Wish I’d had the courage to take photos of my scars after surgery. Keep healing 🤘🏼", "chloeellengreen": "Love you Hannah stay strong ❤️❤️❤️", "p.amelashipman": "you are so beautiful", "liciathexplorer": "Oooo you sexy thang", "emilyf98": "You look so cute! I think you're really brave! ❤❤", "hedda.blokhin": "Congrats with getting ridd of your UC and welcome to the club! ❤️ You should try out the Mio brand of ostomy bags, they are the best ☺️", "ajd_97": "Check out jasmine Stacey! She makes sexy lingerie for women with stoma bags! She is an amazing human 💛", "francesemilyp": "Thank you so much for talking so openly about what you’ve been going through. I’m recovering from my latest UC flare and have also been robbed of Christmas & New Year! I’m about to start Humira and if that doesn’t work it might be stoma-time for me too, so it’s incredibly informative and reassuring to hear your story. Thank you. I hope Mona treats you wonderfully and you get your strength back soon. With love from another granny-shuffling, UC-enduring, 20-something Hufflepuff 💛", "elllenich": "Still absolutely beautiful.", "seth7123": "It’s like you have a happy trail, but instead of hair it’s strength and positivity! Heal well soon! ✌🏻", "claire_wildash": "Youre stunning! So inspiring 💕", "crueltyfreephd": "Thank you for sharing your journey! Glad you are on the upswing. ♥️", "han_krok": "So, will you have the bag forever? So glad you’re doing well.", "kit_dit": "Wow, you are so brave! I had an ostomy bag for six months a few years back, until they reconnected everything, and I could not bear to tell anyone I had it, much less show a photo. Even now I won't show anyone my belly, as my scars are horrifically worse than yours. Assuming you eventually get your own plumbing reconnected, you'll have a nice round \"bullet wound\" scar where your stoma was, btw.", "desiducrot": "You're a fucking goddess and I'm in awe of your strength, beauty and sense of humor. X", "alex_chisholm": "There's a game by Jane Mcgonagal called SuperBetter she developed when recovering from a head injury. It sets you up for missions and things related to your overall mental and physical health and might be worth checking out. I use it for depression and absolutely love it. Hope your recovery it swift.", "rudolphhf": "Beautiful as ever! Xx", "brogantatexo": "💞💞💞", "readreadwriteread": "Love 👏 you 👏 so 👏 much 👏 you 👏 gorgeous 👏 goddess 👏 ❤🌹🎉", "livtupi": "Ur so cool", "keithsux": "My mom has one of these due to colon polyps. I have to have colonoscopies every few years to check for this. Thank you for sharing this story because there is such a stigma around this particular medical procedure. Sending you love and good vibes.", "bamblingsofnaffy": "You’re fantastic for sharing this. My mother had similar bags and I will be sharing your story with her too", "miracalice": "get well soon! :)", "jacobsjourney2017": "Kudos to you for sharing. My son Jacob is due surgery end of this month and may need a stoma as he is having part of his colon removed. Depends how much is removed/diseased. He has Down syndrome and Hirschsprung Disease (bowel disease) and also was fed via an NG tube. In case you are not aware it’s also Tube feeding awareness week this week 👍🏼. Wish you a speedy recovery xxx", "thailaskye": "💕💕💕💕💕", "katiequibs": "❤", "clairebrucki": "@hannahwitton I just wanted to send some love, I watch your videos and what you have been through sounds so like what my brother went through with his ulcerative colitis last year, it was so scary and stressful. He has PTSD 😔 I so hope you get your 2017 Christmas!!!And that you’re getting ok with Mona (it immediately made me think of moaning myrtle 😂) keep strong and positive xx", "chrisolade": "❤", "dodger_mines_1": "@hannahwitton you a inspirations and my legit queen of body positivity right now x", "cata.loon": "You are amazingly strong!! Welcome back 😽💕", "susan_cairns_illustration": "Full respect ✊", "ell.slo": "You’ve got a scar like Ludwig Bemelman’s “Madeline”!", "snowpea_": "I didn’t know it was possible for me to have even more respect for you, Hannah. Your strength & positivity during this time is incredible. Wishing you luck with your recovery xx", "gazaryel": "Hi. I think you are very brave to face all of this. But I am a bit curious. Will you made a video to explain what happened during the surgery or it is too hard for you to speak about it that I can understand. I think it can be interesting to people to know what exactly make you to have a stoma.", "megsymurphy": "Yes you go girl! I had his surgery at the age of 7! Best thing that happened! 20years on and I'm living life to the full, don't ever let anyone tell you any different ❤️", "alyshanne92": "Still sexy af 😘", "georgiawallin": "we have the same undies! 😂 love hearing your recovery story xx", "owkratz": "You look beautiful", "elliaivyfit": "Powerful and empowering.", "riamaggy": "You are a fucking UC warrior. Thank you for being courageous enough to share your story! IBD is a bitch but you're handling it like a boss. 💓", "courtneyrosesteele": "Still an absolute stunner! 💛", "plamena21": "You are very brave, wish you the best recovery", "insta.nik": "That's a heck of a scar there! Well done for talking about and showing the world things that a lot of people won't be familiar with. Pictures like this are very much needed to end the stigma that can surround things such as post-surgery bodies. You're still a strong beautiful woman - a life-saving surgical alteration to your body won't change that :)", "clarelouiset": "So impressed and inspired by your strength and openness @hannahwitton! Currently revising for my med school exams so grateful to you for providing a YouTube vid that I can count as revision! All the best xxx", "chloekitchen": "You look amazing!!! Good for you 👏🏼I've had mine 4 years so if you need any tips let me know 💕 xx", "giwrgoslekakos": "Keep it up hanna.you gonna pass this one soon!", "sapphiresplendour": "💪🏾❤️🙏🏽✨💕", "anna_whoop": "Heej i got the same pants", "muhrieyuh": "@hannahwitton you're my hero. Thank you. I'm currently going through a flare and very scared. My gastro doctor won't see me for a month. :/", "raffspicone": "❤️️", "tanner1hoth": "Hi", "goetze_kim": "Just watched your video Hannah. Thank you for sharing your story! 2 birds one stone made me laugh so much 😂😂😂 you haven't lost your humour so you will be fine in the long run 💪💪💪", "phosiesophie": "You look stunning, @hannahwitton 👙🌟🎀💕 SO good having you back (and back on track)! Wishing you the best recovery possible 🙏🏻 And thanks for yet anorher fab video ❤️", "officialsamepage": "You are one badass lady Hannah. I'm super proud of you. Thanks for taking us on this journey with you.", "bbbbeaton": "Looks fun 💔🙈", "thenutritionyogi": "You are incredible as is your body. Thanks for posting. X", "severelea": "Your undies are quite fitting. You're definitely a real trooper. Very inspiring. <3", "morgane_jeanne_": "You’re so inspirational! And you look so beautiful! ❤️", "againrich13": "🙏🙏💯🌹", "jmaghzal": "Dude, I just watched your latest video and it was immense! Massive kudos to you, your family (and by extension everyone who has to handle this kind of stuff) - really appreciate your candidness and hope it helps everyone open up about all things health with each other. You rock!", "spiraki": "You look amazing! Love your positive outlook, your an inspiration! Btw really fancy you, always thought your sexy, now even more!!😚😚", "_katieflora_": "Good woman 👍🏼 you look great and like everything’s healing well. It doesn’t take long before you feel like your just recovering from the surgery and not feeling sick all the time anymore xx", "carlaturner_leoga": "You’re amazing. Thank you for sharing your story x", "miikymora": "Will you ever take out the bag and be normal again", "crohnic_": "❤️❤️❤️ #crohnic", "cledalig": "You look beautiful as always. Hope you get well soon !", "jackk4ttackk": "So I watched your video and your story is insanely inspiring. I admire you so much and you’re so freaking brave and super beautiful! My boyfriend has had 8 surgeries, and the last one was the colon removal. No more colon. And he still has trouble unfortunately :/ they messed up during surgery and his stoma (no name, but I’ll suggest he give it one), it’s not far out enough so it’s basically getting stomach acids and stuff on his skin around the stoma and his skin is now always irritated and changing his bag is super painful... it’s so hard to see him in pain. His last surgery was over a year ago :/ he’s been struggling with his weight so they want him to gain control before he has it but he’s in pain sometimes and can’t exercise or anything... I’m hoping you can spread some good vibes/thoughts. It’s bringing back so many painful memories for us and his family when he’s in pain. Please stay strong you’re so wonderful I’m glad I found you through scarred not scared. 💕", "phedurin": "Good luck to your new life. I have this disease since 2003 and I know what it feels carrying this bag.", "spoonielifelover": "You look amazing Hannah signs of a fighter who has to fight daily for her health 👊✊", "ruthelizabeth__": "What an icon😍 we love you Hannah, even though your strength through these events is incredible, it's only a small part of all the amazing things you've done and will continue to do", "pannagosia": "I just saw your video - thank you for sharing all of this and being so open about it, I learned a lot! Sending you lots of strength and love for your ongoing recovery 💕💕", "iamnancyjane": "You're wonderful and a beauty, own it. 🤗😍", "quitesimplyemma": "You’re story is so inspiring xxx hope you get better soon you’re so very beautiful! Xxx", "showmethestarlight": "Just watched your new video, I've been watching your videos for a few years now and it's so good to see you're recovering and doing better! Amazed by your strength, sending you lots of well wishes and hope your recovery keeps going well! 💛", "laurenjoybutler": "Go you for being so incredibly body positive and also acknowledging how crap chronic illness is in a sensitive and sensible way. There’s no right or wrong way to deal with the stuff life throws at you, but I think you’re doing a damn good job of it", "jessicaalicefoster": "Inspiration ✨", "isac_isac": "You have gotten so skinny 😨 I hope you are doing okay", "mariagracewrites": "You are amazing. I don’t have an ileostomy bag, but I do have a surgically placed feeding tube. It’s awesome of you to spread body positivity. If you’re looking for similarly awesome people to follow, @kristenschronicles is wonderful and shares about her life with an ostomy bag on her Insta and blog. Our health challenges don’t define us, but sharing about them helps empower others to do the same and takes the sneaky shame out of medically necessary differences (or any differences, for that matter). Sending good vibes for healing 💛✨", "brookeagram": "Amazing lady right here 💪", "anna.carlsson": "@ellagibson", "nlauritz": "I have the same undies😁 You go girl😀", "happentobeshort": "opaque bags are always so finicky to me - I can never see where I'm sticking em and I always mess up - even tho they look less Gross than my transparent ones :C", "brennaraeneal": "Just watched your video! You’re so brave and strong. ❤️", "hollydanyliw": "You are braver and beautiful.", "lialackcosplays": "You are so inspiring and beautiful! Keep being your awesome self!", "itsleannestewart": "💪🏼💪🏼💪🏼💪🏼💜💜❤️❤️", "jewelia95": "You are so strong Hannah. Sending you love and good wishes throughout the healing process xx", "missdaisyanna": "You are a-stoma-shingly BEAUTIFUL (sorry not sorry) ❤❤❤", "reeceaxie_": "I thought you where stunning before @hannahwitton but your strength and who you are now makes you even more beautiful 😘", "crafty_elle": "@hannahwitton you are amazing for being able to post this and so soon after surgery! Just watched your and left ye a big massive comment ❤️❤️❤️ ... just wow", "shadowgroove": "You are amazing. I am so proud to be your fan.", "shimmerandrotxo": "So glad I found you 💜", "aussie_ostomate": "Thanks for sharing 💜💜 So wonderful to share awareness & remove the stigma of having a bag xx", "chriistinelaroche": "Gurl, you are one tough cookie! Love the way you stay positive through it all ❤ keep us posted and rest easy", "small.town.clown": "Ur optimism and positivity is so fucking admirable Hannah 💖", "katiiiweiss": "You go Hannah!! Wishing you all the best for your recovery❤ I have an Ileostoma myself but I already have it since I was 7 or 8 I think (I'm almost 16) so I don't really remember what it was like in the beginning. Your body positivity is just so inspiring, hope you'll feel better soon❤", "izzybackstrom": "@hannahwitton your last video was amazing! You were so strong and brave and OPEN about the whole experience, and on a personal level it was amazing to hear someone describe their experience that was different and yet so relateable to mine. I'm currently on vedolizumab which has been great for me but more as a keeping me healthy long term drug than an immediate fix. I'm hoping that with the care of my specialist I can stay healthy and away from surgery but your video has really made the thought of such surgery much less scary for me. Keep focusing on your recovery and I hope life only gets better for you from now on. 🤗💕💕", "dduncombe": "Thank you for being so awesome. Sexy scar, too!", "olive.hampton": "Much love, Hannah 💙! I sincerely hope any pain you're feeling eases soon. Thank you so much for doing what you do and making what you make. 🌈😘", "octavia.ivy": "Stay strong", "bazsimoe": "beautiful woman. X", "jedi2257": "Fit x", "jeffg144": "I hope you feel better very soon I know it is going to to be rough but Hannah you can do this god speed girl will follow on your progress lots of luck from me...", "noonasher": "Thank you for being so open and candid about your journey Hannah! You are a truly fantastic person.", "theloladore": "Wishing you all the beat during your recovery 🌺 could you possibly make a Q&A about how it is like to live with the bag?????? Lots of love ❤️", "iamalysffion": "Thank you for your honesty in your most recent video, I’m moved by your courage. What a beautiful woman you are!!! So many are holding space for you, all over the world xxxxxx love from Aus! 💛💛💛", "libby.churchill2002": "Also I hope your scar heals quickly! It looks kinda sore.", "southernboyzmaknnoise": "Still a very beautiful woman. Stay strong", "pyjamawitch": "God you’re such a babe", "katiejanekaboom": "You're a fucking badass. Much love. ❤️❤️❤️", "janelleghamilton": "I hope recovery goes well :)", "emiliacaste": "youre doing amazing hannah!!! i know you probably wont read my comment but like youre so awesome!!", "emzzily_x": "You're so brave and beautiful Hannah, its amazing you've been so strong through all of this, you are one strong, incredible, stunning and empowering woman and honestly I am so grateful and honoured Im subscribed to you, you look so stunning also 💗💗💗", "widadn._": "omg seriously man , im so proud of u girl . keep fighting . I know u can do this , love from malaysia 💖", "jessiejane1990": "All the best of luck on your recovery. Must have been an extremely scary ride. X", "kwebberwanders": "all the love, you star. Good luck with recovery 💖", "mel.dryland": "Absolute respect for you posting this picture. It is really empowering for me as I also have a stoma and large scar. I admire your confidence! stay strong, you are doing amazingly :)", "scubasteve_bnlfitness": "You're one strong young lady. Stay strong because its an inspiration to many", "bayleebutton": "I love you. I admire you, Miss Hannah Witton!", "naranjayelisa": "@hannahwitton is your ileostomy permanent or temporary?? (Sending you lots of positive energy and damn girl you're so strong and such an inspiration) xx", "millstone67": "Partial or full Small intestine removal?", "aniradetavera": "In regards to the video you just posted: know it's not ideal, but you can add a temporary piece of elastic to your waistbands so you can still wear your clothes without worrying they will fall down. That way, as you grow, the elastic will accomodate that and if you're ever back at your previous size, you can remove said elastic :) wish I lived closer because I would help! -girl in new york city who think you're awesome *﻿❤️", "lyonselle": "Wishing you all the best as you recover and adjust to all these changes!!", "molly_sm1th": "❤️❤️❤️", "maria_manias": "💪💪💪❤️🤘🤘🤘", "racerjosh": "@hannahwitton Wow do you have to have that bag the rest of you life ??", "rolyungashaa": "Love you 😘", "fuzzybatbutts": "Thank you for posting this! You don't know how much this means. I'm not sure I'm strong enough to post a picture of my PEG-J feeding tube quite yet but I'll get there. Stay strong and get well soon. 💕", "__lifeisnofairytale__": "I love your stormtrooper underwear!", "itsmiagreenway": "🙌🙌 always a beaut 💜💜 Also you can get the cool bags with patterns on and stuff which I thought was pretty awesome. Glad you’re doing well xx", "tulsidivine108": "Thank you for sharing your story and your picture ❤️ you are so beautiful and a light to all those going through a tough time. Xx", "rob_base_666_": "Beautiful and inspiring. Thank you", "corinne.mccafferty": "You’re so brave, thank you for sharing ♥️ I think by sharing your journey you’ve educated us and raised awareness for something that not a lot of people think about. Hope you feel better soon and manage to adjust to your new lifestyle xx", "theashleyarnold": "@daryadee I’ve been following Hannah for ages but thought of you when I heard about her recent surgery. body positivity for lyfe 💁🏼‍♀️💃🏻", "larryg.co": "❤️❤️❤️", "martkt10": "Glad you are on the mend", "ec.graham": "You are such an inspiration Hannah", "mykskin": "omg @hannahwitton you made me tear up! my brother has ulcerative colitis too but he had his first episode about two years ago, I want him to watch your video. Thank you so much for sharing this with us, hope you get well soon. Lots of hugs girl, you’re a fighter 😘", "orangesky26": "Oh Hannah, I cried during your video from the emotions of being so sad about what you've been through, and the relief that you're ok. Xo ❤️", "bylaurat": "❤️ hope you get better soon", "caisaqui": "Stay strong girl, you are so beautiful!", "quanahdavis": "You go girl!", "hajjj20": "I’m so glad we have brave people like you in the world! Makes me so happy ♥️", "charlotte___n": "You look so strong and beautiful! It’s amazing to see someone embrace such a huge change in their life and stay so positive!", "ruby.doobie_": "You're so brave and strong, so glad you're doing better 💗💗", "thepiquantfox": "Hurrah! Thank you for sharing this journey with us - I was in total ignorance so have looked up stomas and learned loads. You're a fabulous, adaptable, strong and hilarious woman Hannah!", "rosieohora": "So glad to see you doing well! ❤", "gabipfau": "So proud of you!", "lovelylollyb": "Such admiration for you, just watched the video, & so nice to see you regaining ‘you’ again xxx", "laurennovak123": "Amazing!! Xxx", "kevin.wg.02": "How long do you keep the bag ? You still look good !!", "aliceacx": "@pippawilkinson", "aliyahkler13": "Stay strong sunshine 💛", "katiebroke": "If you haven’t already seen the work of @sophiemayanne called #behindthescars I think you might really enjoy it. I know I at least found immense power in being able to see other people’s own relationships with their scars and the stories of their formation", "carina_laureen": "Stay strong!! ❤💪 You're my inspiration!!", "msanokhina": "You are beautiful! Lots of love❤", "sophie_m_anne": "👏👏👏👏👏👏👏👏👏👏👏👏👏👏", "edgarsan64": "Girl you are valiant", "dotttiejames": "So fricking beautiful!! Those thighs!! Those eyes!! That bag!! Excellence!", "hello_hl23": "So brave!!! It's unbelievable!", "cat.ogu": "hannah! 💛 im so proud of you for getting through this and posting s video taking about sensitive things and having a smile on your face, i know it’s difficult but so far you’ve done better than anyone would’ve expected! this is very brave of you to post and it’s so cool that you did! you rock your new body (not that your old one was bad!!) and your smiley pictures from the hospital are an attitude i look up to 💛💛💛", "joana1997b": "Badass! 😎💪🏼", "emmalrpotts": "🙌🏻🙌🏻🙌🏻🙌🏻", "d.aryna": "you are an all around fab person ☄️", "carlythebookfrog": "Yeah rock that bag. Girl.", "franichan": "Such a badass scar! Take care @hannahwitton and enjoy aaaaall the white carbs 😄 🍝", "albane_de_vdr": "You are so amazing to post this photo and your vidéo. Stay strong, as we say in France : tu déchire ma belle ! 💪🏻👊🏻", "julietleila": "Hannahhhh you’re amazing and I hope your recovery is restful lovely gal xx", "vmaharris": "You are so STRONG!", "nickypowell07": "Take care sweetheart your doing amazing xx", "feyzasnr": "Your body looks pretty good 🦋 Well, I don't have a scar but I have some dirty and ugly defects on my body parts, I used to hate them and I wouldn't wear short things. But I got so many support from my family and my kind friends. They are going pretty fast but there is still a few strange things and defects on my body but i don't care because a friend of mine told me once that \"\"all those things making you more beautiful because you are different. İt means you are special.\"\"🌻💝", "rebelfirestarters": "You're beautiful! Keep getting better! ❤ Big hug that doesn't hurt, take care of yourself.", "tatjanacelia": "Thank you for sharing Hannah :)", "breakdancingchihuahua": "Is that STAR WARS UNDERWEAR?!?? You’re amazing!", "faulesb": "Glad you are starting to feel better!! <3", "aphra.nolan": "IM PROUD OF YOU AND I LOVE YOU", "rob_andrew1963": "Also, I love the stormtrooper pants.", "sharnagraham02": "Stay strong, you still look really beautiful 😍", "tessaaustin": "Wishing you a steady recovery! You look great 💕", "adamcole5052": "Such a brave young lady to share this with us all. You go girl !!", "louisa_helen_": "You're amazing 💜", "linkamarisa": "Your confidence and your strength inspires me a lot. You went through hell with your body and you still love yourself the way you are and you can definitely be proud of what you've gone through! You look beautiful, I hope you will be able to visit your local pub anytime soon again! Your community supports you! Lots of love 💛", "teresabouzaserrano": "Wishing you all the best Hannah!! Strong women like you inspire me", "seeairuh_k": "What a beautiful and strong woman in the mirror! 💛", "eleanorbrowning_": "what's this for?? x", "autumnshaymartin": "I love you Hannah", "collectorofcurios": "Watched your video and think you are so strong and amazing! I've never met anyone with a bag (that I know of!) and have already been reading articles about life with one. Three days out of hospital and you're already raising awareness and being a fantastic role model. You go girl 👊💛💜", "faypleijsier": "proud of u", "reb.stillwell": "My mum had to have a stoma bag for a while and worried about it a lot so thanks for this it means a lot to see you being so positive and strong about it xx", "kaialyngroth": "💕", "hopecaitlintreasures": "You are incredible 💕", "dani_hope95": "That is one heck of a scar! (I appreciate a good scar). Hope you are doing well and glad to see you on the mend.", "loumattinson": "Just watched your video and you’re so brave. Wish you all the best in your recovery both physically and mentally 🧡 enjoy your Mac and Cheese!! 🧀", "heytheresacha": "you are so beautiful!", "amazinglottie": "You're so amazing xx", "kimbokemp88": "You’re a flippin hero and bloody beautiful! xx", "samrutfield": "You are so beautiful!", "tishalynn": "You are beautiful and amazing.", "jadiebrookes": "It's so great to see you using your platform to be open and honest. I hope your recovery is fast and and as painless as possible ❤", "rosen.lev": "You're fierce and strong and brave Hannah 💜💜 I wish you a good recovery, my thoughts are with you !", "melaniiemurphy\nVerified": "Verified", "justkeep_growing": "💛💛 I admire your confidence and bravery 😘 sending lots of love and healing vibes your way! Xx", "carry_hillert": "You’re amazing ! Keep going ✨", "milkshakebunny": "I have UC and you are my hero!", "issa.lias": "I hope you continue to fight this and keep moving in life 😁👌@hannahwitton", "tims_running": "Such a brave person", "hatt619": "Hope it's getting better every day xx", "dtinc_world_news": "God bless you sweetie.", "icklenellierose": "I know the joy of being attached to a bag. You pull it off though 😉 Big hugs 💜💜", "laurasonmars": "You are amazing!", "shadokyn": "Your still gorgeous to honest", "gabygarzon": "You can do this!!! You’re amazing!!!", "sirpatrickstar": "Respect", "dan.frederiksen": "Brave, Hannah. Rebecca Zamolo also had a bag for a while. Hopefully it's just temporary.", "geo1gia": "Brave brave women 💪🏻❤️", "___anb__": "You’re amazing woman 🙌🏼👏🏼", "jayboxie": "@juliacemilligan 👌👌👌", "boemilyevans": "Battle scar!!! Yessssss 👏👏👏👏😚😚", "beste.yesilkaya": "I am living for your Stromtrooper underpants 🤤👌 wish u a quick recovery!", "_lmgr": "Sooooo I was in an isolation room for a few weeks when my kidney broke & it really messed me up so I get your feels about that & I'm happy to talk if you need it. I hope you start to get back to normal soon (I experienced a lot of what you spoke about in your video so I know how desperate you'll be to get walking properly again) x", "erikaguerard": "The only thing that matters is that you're feeling better", "ksmith20121993": "You are bloody gorgeous", "rachelmayplans": "Thank you so much for posting this! I’m not going to ramble on about my own experiences but this means so much to me, coming on and seeing this! Sending you all my positive thoughts and hopefully you start feeling on top of everything again! ❤️❤️", "malindiayienga": "You’re amazing!", "lord_leto": "❤️❤️💩❤️❤️", "megan_1988": "Your still beautiful💕feel better soon!", "bazinga_hippie": "😍😍😍", "gemtakesphotos": "You are looking amazing!!!!", "gl563": "💛💚💙💚💛", "mitchell__adlem": "What happened", "billieandersonx": "@hannahwitton absolutely loved your video! I’m four weeks post surgery & life has never been so good! I’m still a newbie but have any questions feel free to say hi! Really want to meet more ostomates! 💖", "astridfeliciaah": "I havs those knickers!!!🤩🤩", "shanayaaa513": "So so proud of you, Hannah! Wish you a speedy recovery ❤️", "wildbirth": "Just beautiful...💕🙏 xxc", "elzbthbman": "Beautiful 💖", "brookiieniicole13": "Thank you for sharing, you’re beautiful!!", "llilitse": "So what actually happened?", "karolina_kubinova": "i have two things to say: 1. hey @scarrednotscared look at this cool lady and 2. ARE THOSE STORMTROOPER KNICKERS?", "swervature": "I don't know you, but I'm overwhelmed by your courage and strength through all of this. I love that you accept that this is the way things are now; no reason to get pissed or depressed. I have several physical issues and a plethora of mental ones, enough to be permanent disabled. I've been asked, 'how do you keep such a great attitude with all of your problems?' and I tell them the truth -- my getting depressed or angry changes nothing. It's just a waste of time to do so. It seems that you have the same outlook. You have my utmost admiration. Cheers.", "beckyhathway": "Such a strong and beautiful woman! My dad has suffered from bowl cancer for the past 20 years and has a colostomy bag too! 💪🏽 he was told that there were so many things he couldn't do and he's overcome them all! Keep going girl, you're an inspiration!! ❤️", "peaceoff_": "❤️❤️❤️❤️", "foxy_menace": "@hannahwitton Welcome to the ostomy club!! 🙌🏽👊🏽", "rachelm_91": "Soooo proud of you xxx", "judicadd": "♥️♥️♥️", "snugglingonthesofa": "You look amazing. Hope you continue getting your strength back 💛", "catannne": "My mum has one of these and she’s one of the strongest women I know! You’re doing great I saw my mum go through this and it can be hard sometimes keep your chin up you’re killing it xo", "___mieema___": "I missed you very much& i am glad you are kind of back on track. Take care, all the best. Glad that you made it kinda sane out of that crazy time.", "beechwood567": "You are still amazing, people that love you see you in all your bad and good bits that make you up, you are still AMAZING and funny what more could you ask for.", "natlabambi": "💪🏽go on girl", "des.alba": "BADDASS GIRL💛💛💛💛", "elenacoorie": "We miss you a lot. I'm a doctor but i dont know one thing... does the stoma hurts? You look amazing and I'm so happy you are feeling better 💕💩", "abberz": "Love it ❤️", "halfgothic": "Wait...so...you can poo out of your stomach now????", "sitara_richa": "So happy you are feeling better", "stinehoue": "💪🏽💪🏽💪🏽", "robzy_robz": "❤️💕❤️💕", "kimbers_maria": "YES Hannah!!!!!!", "j.rusnak": "You look amazing!! A courageous, smart, beautiful role model 💙 spoonies unite!!", "dylgeorgelc": "You look great! Stay strong and recover well", "kerripics90": "Good for you, Hannah, I have always admired your openness about things 💛", "monderncurve": "You are truly inspirational and so beautiful 😍💕", "rosiiecampbell": "reason 1001 to love hannah witton:", "jennspen94": "You're amazing 💕💕💕", "kcal505": "What happened to your belly button", "mac_4_edm": "Feel better soon 😊", "bjorn_kruspig": "Thanks for sharing what you're going through and you definitely should be proud! Amazing how you handle this situation. Get well soon, take care and greetings from Glasgow. 😊", "moanamaroke": "You are just such an inspiration 😫😍", "allie_says_hey": "I’m so impressed with how confident you are. Honestly goals ❤️", "niklaspilot": "I just commented this on your video as well but I am again amazed as to how open and positive you are about all of this! My biggest respect Hannah! ❤️", "smile515151": "You are amazing. I hope I am half as strong as you when something like this happens to me", "ohyeahfranzi": "You're amazing! I have so much respect for you. Thanks for sharing your story, progress and your videos!", "ma.graves": "Hold up, so you can just shit freely without having to use a toilet ever again? Mate, wish I had the same debilitating disease as you! Hope you’re doing better now!", "hannahlinaker": "Omg Star Wars pants", "anna4y4e": "Love you Hannah, you are such a beautiful strong woman, we are all with you.", "ve_i42_eclipse": "Soooooo strong ❤", "carolyn.claire": "❤️❤️", "yasminegrace_": "Wait what is it?? What does it do?", "becky_mitchell96": "You are beautiful. Thank you for sharing your story. Wishing you a quick recovery time. Try chocolate milkshake for an easy weight gainer.", "suethomas18041": "A strong, inspiration to all xx", "paigejoannaa": "You’re an amazing person! I have crohns and I’m always so scared of getting a bag. I had surgery to remove a section of my bowel about 10 years ago now!!! You have given me strength and I hope you continue to feel better!!! If you ever want to chat or meet up with a fellow IBD blogger in London I also live here. All my love x x x", "mylifeinlittlesquares_": "Thankyou for sharing 😘😘 hope your on the mend x", "nicky131106": "You are such a strong, brave, positive and very beautiful young lady Hannah! I think you're amazing my lovely.....thankyou for sharing your life with us all. Sending love and hugs to you...💕💕💕", "aoiferoche_17": "💛💛", "nicole404x": "Still as beautiful as ever❤ youre so brave💛", "beccaharte": "Goddess ❤️❤️❤️", "neverwhere2306": "Well done girl! You rock!! ❤️❤️", "ducheke": "Hope you're healing well! x", "irlegend": "You are so very inspiring to not hide away because your body has gone through such an unexpected change. But to openly let us in on your journey, trails, and the results. You feel me with pride and admiration for what you have gone. And you are still strong and beautiful woman in my book. Even more so now then a few months ago. Keep your chin held and pushing forward. 🤗😊👏🖖👍🙌", "ellalderson": "Wow you are an inspiration", "itsciks": "@islaandersonn ooo bag", "marianne_l4mb": "I'm so proud of how you've just totally embraced what life has thrown at you. You're such a beautiful person Hannah 💕", "frnch_jess": "❤️❤️❤️❤️❤️❤️❤️", "scharlie_scheen": "oh man, that looks so brutal. i'm happy that you are getting well as good as you are! i wish you all the best! <3", "wholelottaro5ie": "Go you Hannah! Amazing and hope you feel better every day! It’s women like you who make the world a more positive place to be.", "anne_in_ireland": "Thank you for sharing your new body even while it is still healing. You look stronger now than in your last few pics. Hope you feel like you’d old self again soon 🧡💚", "sky_1722": "Your better yahhhh", "stephnjimenez": "I love how positive you’ve been throughout a difficult time!!! Watching soon & hope you the best going forward:)", "cheekysteph28": "Proud of you Hannah! ☺️ feel better soon x", "wonderwall.2799": "Looking great Hannah so proud of you 💜", "nicoletta__k": "Sending lots of love and positive energy your way,Hannah! ♥️", "mswatcher": "Thank you so much for sharing!", "agnieszka.szuba93": "Hannah I have the same undies as you! <3", "cojocarumalina": "Thank you for sharing your journey with us! So happy to see you recovering and well! Keep on being awesome and strong! 💪 p.s. I have the same underwear. May the force be with you 😃 xx", "megsimadic": "Sending lots of love your way. You are so strong and amazing for sharing your experience. Keep being beautiful xx", "bilal_nazim": "All the love all the way from Sri Lanka! ♥️", "leah_theprotagonist": "Go you for standing up for body positivity! 🤜🤛", "alesscelauro": "Strong af Hannah ♥️", "aislingheavey": "@marienulty this is the thing I was telling u about", "zaydaliciousdesigns": "💛💛💛", "megansmitherss": "Is that Star Wars underwear", "xmanoek_": "Proud of you !! Hope you feel a lot better soon !!", "pizzacatsezrelax": "Just watched it! 💜", "nberniemc": "I never comment but I have to. Fair play to you. You are a mighty girl! Showing all young women the way! Great roll model", "rachelvictoria37": "Had a little cry watching your video. Wow. Your strength and courage is just phenomenal. You’ve been through the worst, now you’re on the road to a life without a diseased colon- YAY!! Can’t wait to see more of your come back videos. Such a bloody fantastic woman x", "asirisseesi": "Glad your better and back.", "nickegibbons": "That’s one heck of a scar!", "susanna.levin": "Happy you feel better now! Mona looks fabulous on you✌🏼😘❤️", "katessmithh": "You're incredibly inspirational. I wish you a speedy recovery 😚", "leahcaitl1n": "☺️ welcome to the low residue club 😂 I wish youtube had been around when I had my surgery, someone like you would have helped so much! Anyway, lots of healing vibes and onwards and upwards! p.s defo look at @comfizz they do some cool not at all ugly support wear!", "annanoergaard": "You are such a strong and brave human being. I respect you so damn much and i’m so inspired and moved by you. You are so fucking cool and only became even cooler for sharing such a personal and intimate part of your life with us, showing us that no one is ever perfect or without struggles - that it is exaclty in our imperfections we are the strongest and most beautiful version of ourselves. Thank you, Hannah ❤️❤️", "madzkskillz": "this is amazing. i literally cannot contain my pride and i think you are oh so brave. you inspire me more and more every day. i strive to love myself like you love your self. i wish you all the best and am so blessed to get to watch your journey through this. sending all my love and support all the way from texas. ❤️", "l_forsyth__": "I would offer you a hug but it looks like it would hurt", "rose.sullivan_": "this exact thing happened to me too! I am hoping you recover quickly!", "mamabrookes": "Just watched your video. You are one brave lady. My heart is with you. You are an awesome woman x", "ktinaseas": "Just watched your video, I started crying because I share your pain. I too suffered with an UC flare in January for four weeks, two hospitalizations, one allergic reaction, and lots of steroids. Life basically got put on hold. You are so strong and encourage me to share my story as well one day.", "gemma_ovens": "Omg you are so brave for posting this! My gran got a stoma bag and it took her a long time to accept it and even struggled with changing it. I am so proud of you @hannahwitton 💗💗", "tegangailor": "you’ve lost so much weight! x", "salvatoresilvini": "buona guarione,vedrai tutto andrà bene", "megandai13y": "You look great Hannah! 😍", "demi.storm": "I have so much respect for you! I kind of know what your going through in the sense of my grandmother has a stoma and I know that it can be quite hard dealing with one. I think it so brave that you share all this personal stuff with everyone! Again, I have so so much respect for you. I hope that you're health will improve and you'll feel like yourself again💜", "rosietakara": "You are such a brave and inspiring woman. I wish you all the best in your recovery 💕", "_seeking.happiness_": "Looking good 👌", "robotpinemarten": "Watching your video now I hope you can get some therapy once you’re strong enough and it helps you process things and manage the trauma you’ve been through. @samcleasby / @instastoma is a great IBD advocate", "andreea.rossi": "You are only stronger right now Hannah, I'm so proud of you. Gorgeous and inspirational💚💚", "gemc200": "I can't even think of anything to say that will verbalise how amazing I think you are. @eatyourkimchi have a saying - #buildaladder you don't have to be superwoman all the time (though FYI, I think you are) it's the little steps that make a big difference. All the love in the world to you 😘💜❤️💙🖤 xx", "lucypengelly": "❤️❤️", "nora_liadan": "Love you so much! Thank you for sharing your story. #ibdbuddy", "mirivecchi": "hope you heal well", "may__qr": "You're such a strong woman Hannah ❤", "reema_mfl": "Much love ❤❤🌹", "samidawn": "As candid and funny as ever, but now with bravery thrown in. So sorry you’ve been through such a tough time and glad you’re now on the mend. Awesome watching you start to turn this negative experience into something positive and inspiring. 💪🏼", "bramirez37": "Uau you are as courageous as you are cute!!! Thanks for being so brave", "robynmccue": "What a badass, holy moly <3 <3", "charlotte.lockey": "So proud of you girl! 💪🏻", "cjcxx": "@hannahwitton ur gorgeous and amazing", "ali_velge": "❤️💛❤️", "hellolovely96": "you are strong and beautiful! so glad you are healing and happy", "gracefvictory\nVerified": "Verified", "fleurkel": "I am extremely inspired by you staying positive as always! Also happy to hear you still love your body! You must be so proud for it getting through this thing! 😄 Get better soon!", "danielpoonvignez": "Take care!!", "jodieafisher": "You brave and courage woman. Looking forward to watching your video tonight.", "molly.ratcliffe": "Hannah your an amazing person for everything you discuss and talk about. I have so much respect for you. Stay strong & slay 2018 xx", "elly_hinch": "So amazing, love the video ❤️❤️", "wolfy.ne": "Hi-five for scar twinning. All the best for your recovery :)", "lucykateburton": "@wendyrosielucyross", "themuffinkhan": "Just watched your video and man, do I feel for you. Thank you for telling us what happened and documenting your journey. I am glad you are alive and getting better!", "j.essicak": "I love you ❤️", "daniella.sinder": "☺️🙌🏻", "spreadsheettroll": "❤️", "andreanesshammer": "You absolute legend ❤️❤️ your honesty is so refreshing.", "acostaluciaayelen": "Role model💪💪", "seanjosephyoung": "That is one badass surgery scar! Hope you’re feeling better!", "zara19398": "I just wanted to let you know that I am so proud of you, a stoma is such a big life change and it will change your life forever but you are carrying on and showing life who’s boss! Just shows that these things are just here to challenge us and not to stop us! You go girl and I hope your having a good day! I am so proud of you! 💕", "clarejtc": "❤❤", "mobile_dom": "That's a pretty dope ass scar, not gonna lie", "bazzrice": "Beautiful is beautiful. My mum has has one for over 20 years and unless you knew, you wouldn't know. If there's ever anything you need to know and i can help, just message me ☺️", "arielbissett\nVerified": "Verified", "ionapixix": "I can’t put into words how I feel just now about this, but just know it’s all good, and I’m so glad you’re on the road to recovering from the surgery and I’m here lingering in the background cheering you on 💜", "schm3nn3": "I hope You get just so healty like you were before again^^", "leoinspiration": "Stay strong !!!", "valencamposn": "💟", "alphacity123": "Thank you for breaking a taboo and showing that while it is an invasive surgery...there is nothing wrong with it. Keep healing and stay positive", "connieglynn\nVerified": "Verified", "williamtd147": "Get well soon", "laurabromley": "@scarlethopespinks this is what we was talking about!xx", "tobi_97_": "Hi Mona", "teapetrichor": "Dear Witton I thank you for your bravery in sharing your experiences and I hope you have a speedy recovery. I went through a similar situation a few years ago with surgery and hospitals and it is tough but I appreciate my body so much more now. It is not perfect by any means but it is strong and has endured a lot so I try to treat it better. I watched your video and I just want to tell you that therapy helped so much after my stay, it was so helpful to have a impartial person that I could share all the dark feelings with in a safe environment. Rest, take all the time you need and I wish you all the best! ☕️❤️👍💩", "kristinabessell": "YES HANNAH 🙏🏻 You look great, own those battle scars! Sending all of the love and support, stay strong ❤️❤️", "rossavocado": "You legend!! I’m so proud and happy Hannah. You are amazing for being so open and honest. It’s brilliant. Sending all my love your way!! Xxoo", "larryh.fitness": "What is not to love? You’re amazing!! #stillbeautiful", "niamh1421": "@claremcm142", "shmikelly96": "Beautiful! We should be incredibly proud of our bodies! 💕🙌", "emilymarierobinette": "strong💪🏻", "darcyjcole": "Strong woman 💪🏻💪🏻💕", "lucyhollar": "BEAUTIFUL!", "_jamescast": "I love ur Star Wars underwear", "melissa.bml": "You are so beautiful and strong! i really hope everything is going to be ok now that you had the surgery! 💛", "flanagan5417": "You not only look gr-r-r-r-r-eat, but are such an admirable example for your young audience. Stay strong, but don’t forget that your friends will be there in your times of need.", "gossip__gurl": "💜🙏🏻", "veena_cp": "Get well soon!", "hughesclues_": "Hannah you are so beautiful & resilient - I’m sorry you had to spend so much time in pain and in hospital. Welcome back! ❤️ you are such a badass", "djjazzyjoff": "@hannahwitton is it a defunctioning ileostomy or an end ileostomy?", "blessing.550": "Hey @hannahwitton first things first get well soon and lots of love to you. You are such a brave lady I mean it's hard to sit down record and edit after such a hard time. But you being so loyal to us . Thank you . Praying a fast recovery and a healthy Hannah. Love you ❤", "akilahh\nVerified": "Verified", "_evesmith": "@emmaaaa123_ think I just teared up, she's fucking brilliant", "elizabethmaehagen": "Still gorgeous as ever, witty, wonderful. Just a new chapter - keep doing you ♥️", "giiuliadiaz": "U r so strong ❤❤", "julietrc": "I can't begin to imagine how scared you must've felt. You are incredibly brave for going through it and sharing your journey. I wish you the best recovery 💜💜💜", "mripley13": "I have ulcerative colitis and my sister has Chrohns disease. It is amazing to see someone being so honest and open about living with this disease while still remaining so positive and gorgeous", "daisy.jsore": "damn girl", "carysparist": "Omigosh you poor thing! You are so strong and amazing! X", "grebditch": "You are a hero ❤️❤️❤️", "amylouisejoan": "Thank you for your incredible commitment to body positivity Hannah 💜💜", "flavourofbettiepage": "You are so strong !!! ❤️", "lucycollings_": "Wishing u a speedy recovery 💕", "leahshealthylifestyle": "So beautiful! Glad you're okay Hannah :)", "gabhain_sa_ghairdin": "Hope it all heals well.", "prettystuffandfood": "You are amazing!!", "viscious_uv": "BEAUTIFUL!", "claredemars": "I know you will be strong and get through this but I have got your back girl #bodyconfidence", "shane_theman": "You did lose alot of weight in such a short time! Glad you'll be able to feel better now Hannah!", "_electric_booogaloo": "You look amazing 🙌🏼💘", "erikaasvensson": "You are such an inspiration! And thank you for sharing you story ❤️", "paigedickason": "thankyou for using your platform to represent our bodies and disabilities to a wider audience! makes me feel so much more empowered and confident! #stomabuddies ♥️☺️", "gamesplaychristopher": "Oh you did loose a lot of weight from this. Someone get this girl a pizza, stat!", "emeline.ff": "As if this wasn't already the best Instagram post ever, those Star Wars panties are awesome. You're killing it Hannah! Thanks for documenting all of this and for showing such a good example, I'm sure this will help a lot of people", "algaenredada": "You're so empowering to others, I wish you a speedy recovery 💓", "douglasgsilva": "The poo emoji now has a whole new meaning! 💩 Interesting to see Mona. You're amazing, Hannah! Keep it up! Bye bye flares 👋", "countjacquula": "So brave", "vivekmishra4066": "Kidany bech k I phone liya 😂😂😂😂", "livvibh": "So happy you are ok and think it’s amazing how you are documenting this ❤️❤️❤️ will help a lot of people", "jodiesairpodsold": "babe I’m so proud of you :,)🖤", "jamielewis75": "Incredibly brave, honest and inspirational!! Thank you @hannahwitton for your candour & confidence when it comes to sharing your experience #respect #honesty #brave", "vivatramp": "such a neat scar", "nshr04": "You should be proud! You are very brave and strong with what you’ve been through. 😘", "angiemariebee87": "Thank you so much for sharing your story ❤️❤️❤️❤️", "marleytommola": "I’m so happy for you, you are so inspiring", "luisramirez2323": "Wow 😳 are you okay I hope you feel better soon 🌹🌹🌹🌹🌹🌹", "tracey_louise_1985": "Brave and beautiful woman xx", "gcasfm": "You're greeeeeeat!", "anshuujainn": "💕💕💕💕", "buntatmen.buntleben": "You're such a fighter. I love the positive attitude! 🙋😍😍", "kaja.kurczewska": "You're such an inspiration Hannah 💖 Stay strong and continue to recover. Thank you so much for sharing this very personal thing with all of us. Xx", "meganduede": "Beautiful!", "arminkoosmanovic": "You're one amazing woman! Keep slaying!", "matt.tahir_": "These are just battle scars. I’m so glad you’re recovering.", "ajkolikes": "Love you Hannah so much you have no idea!", "birdy_books": "@hannahwitton I watched your video and I want to thank you for being so honest. I have Crohn’s disease and it’s not an easy thing to talk candidly about. Your voice is so important and your bravery is incredible. 💜💜💜", "ambervanheumen": "You bloody fierce <3", "avengersrule103": "I just watched the video!! You're so brave and strong and beautiful Hannah!! I'm sending so much love your way 💛💛💛💛", "junodawson": "You are a legend and I love you.", "mrjarwson": "Still looking amazing Hannah! 👊🏽", "katetyrer": "💓💓", "x_cacamilis_x": "❤️❤️", "ssarahbautista": "watching it right now! so proud of you from pushing through this. you are so beautiful and strong!", "stompgal87": "I've just watched your latest video and I hope you continue to recover well.", "hannahjadehs": "Beautiful 😻", "kathyingl1s": "1 so inspiring (as you always have been) and 2 thank you for teaching me all about something new! 3 looking fabulous as always", "marziesreads": "Brave and beautiful woman!!! 💜", "bbethhg": "You got this 🙌🏼☀️💪🏼", "eleanorwilkinsonactor": "Be proud of a body that has been through so much, and persevered through 💩 to get to a place of love and care. (Take care Hannah, and be kind to yourself still through this recovery process and in life onwards.) X 💪💪😎💖", "rated_ren": "My goodness that's scary. Get well soon 🙏", "eilotron": "<3<3", "hcompton97": "Just seen your video, thank you for sharing your story and I really hope you get the help you need with the psychological side of all of this 💕", "princess_pingu3": "So beautiful x", "hazels_wineglass": "I'm so proud of you!", "isabelljburridge": "Missed you lots and I’m so glad you’re taking this positively and being very proud about it", "owlofthesouth": "How brave are you?! OMG I am blown away by the fact you had the courage to show people what this looks like. 🙌🏻🙌🏻🙌🏻", "jennacarr.x3": "I cried while watching. You are so unbelievably strong! ❤️", "this_wayfarer": "Glad to see you're doing ok, and healing up. You're awesome 😁", "jemimaalive": "You are beautiful and thank you for sharing your story", "l_mowliney": "Man you've got so skinny. I watched your video and I'm so glad you're on the road to recovery! Don't push your self to hard, we will all still be here whenever you start to be able to make videos again!", "kimmygate": "Such an inspiration to many! You are gorgeous lovely! Xx", "kaskanovak": "Next time someone will tell me that Wonder Woman isn't real, I'll show her/him your photo💪 'cos girl, you badass 😎", "stargazerhellraiser": "Very proud! Thank you for sharing your badassery ❤❤❤", "baileightolar": "Proud of you 💜", "zohey_": "you’ve got this Hannah 🙌🏼🙌🏼 my mum is the proud owner of a stoma bag and ilestomy scar (along with a few others) and she’s a strong badass woman. It never has to limit you 💓🌟💃🏼", "majamarkee": "❤❤❤❤❤❤❤❤❤", "marcocaricola__": "sending you good vibes x", "sternmarie": "Such a strong woman!! Wish you all the best", "rhitrition\nVerified": "Verified", "pumpkinellie": "You look amazing Hannah x", "thisisfernyj": "Thanks so much for sharing this photo and your story- my sister has had to live with one of these for a few years now and she struggled so much with feeling self conscious about it. We need more people in the public eye who are willing to share such honest beautiful posts 😘💕", "alice_h27": "So proud of you xx", "vero_cabanillas": "Brave 💛", "lydiasface": "eyebrows still fire as ever", "jadeoharaxo": "Our gorgeous and strong girl I love you so much lovely x", "wtvnvm": "EMPOWERING", "recklessbabe": "So proud of you and your body! 👏🏼💪❤", "avaniandlife": "You're amazing Hannah! 💖", "ellieorjerry": "@hannahwitton , I’m not usually one to comment on photos and things but this moved me to tears. I love how open and positive you are and your willingness to share your story will help so many people. Thank you. ❤️", "lucy\nVerified": "Verified", "gracemiamcbride": "Looking great Hannah! 👏🏻", "vincevangollum": "It is so impressionable how openly and positive you seem to handle all this. It must take a lot of strength to share this with the world. Sending lots of love and energy to you right now", "scarrednotscared\nVerified": "Verified", "milochoa": "I’m so glad you are feeling better and better ♥️", "alicevictoriac": "Your positivity is incredible, so pleased to see you’re on the mend!", "reelreilly": "👊🏻💪🏻", "phoeb.eh": "video was brilliant- sorry you've had to go through this, but all the best for your recovery! ❤️", "lizzzieirwin": "You’re definitely a trooper Hannah! I wish you a speedy recovery ❤️❤️", "jess_robyn_": "❤❤", "el0ises": "so proud of you ❤️❤️", "fran_newmanyoung\nVerified": "Verified", "isaac.ssss": "i hope ur recovery is quick and easy. lots of love x", "kieranhemming": "Safe recovery x", "moneybag_capo": "GOD BLESS YOU ALWAYS. Pray God gives you Strength always.", "andalsokelsey": "Sending you so much positive energy!!❤️❤️", "theswedishlad": "I think it’s amazing to have you representing us people with various ”stomach issues”. 👊", "katieemay1": "💜💜💜", "iupotato": "You’re so brave I’m proud 💙!.", "wheresheread": "Your so brave Hannah!", "chloejw92": "❤️❤️❤️❤️", "terezaprochazka": "❤️🙌🏻you are so inspiring, Hannah!", "emmallew_": "This is so amazing, like what doctors can do to help people amazes me", "just_another_mudblood": "I’m so proud!!! My mother has had an ostomy bag for a year and she is only just now getting used it but seeing other people be proud really helps!!!! 💙💙💙", "nastassja_alexandra": "❤", "missclairahermet": "You look amazing you brave lady. I think you are amazing and a true inspiration to all ❤️", "heather.lifschutz": "You're an amazing woman! ❤️", "madeloulou": "❤️", "sean_toom78": "Beautiful and confidence that is why we love you 😘 😘🌹", "bethohware_here": "Hi Mona welcome to the internet fam 😊💜", "haley_deanna": "💪🏻", "emissary.of.well": "s t r e n g t h", "michellepi.png": "I can‘t believe how strong you are", "francescaxmay": "💪💪💪💪", "joanaisacardoso": "proud of you ❤️", "kyannesmith_": "Looking amazing, so glad to know you’re feeling a bit better Xx", "toothless.15": "You're braver than I.", "multituba": "Keep strong and be happy, best wishes 👍", "meghale.y": "So proud of you Han 💛💛", "michaelalebedikova": "You are so brave! Truly an inspiration. Thank you! 😍", "brontekelleghan": "Love you loads @hannahwitton You are amazing 💖💖💖💖💖", "jemrosew": "Glad you’re recovering, look forward to watching your vid 💖", "amybuckley__x": "Incredible 💜", "pintucris": "You are so brave - about what you have been through! Hope you are recovering great! Greetings from Spain", "taracarew": "👏🏻👏🏻👏🏻💛", "quite_good_and_awesome": "My son has ulcerative colitis. Most don't know about it or how serious it can be. Thank you.", "nina_g_6": "❤️❤️❤️", "lowanros": "Lots of love xxx I hope your recovery is quick and going good!!", "conductorlucy": "So proud of you!!", "_laura.kay_": "This did trigger me a lil bit but I’m so glad you’ve made this public! You look incredible and you’ve done so damn well @hannahwitton 🙌🏻💗", "tje_xplore": "You’re so fucking a strong and such an inspiration I swear", "charlotterosehus": "Wishing you well and a speedy recovery❤❤ Lots of love xxx", "shamsaalameemi": "❤️❤️", "brookemxox": "Sending lots of love 💗💗", "annabelw_xx": "@hannahwitton thank you for helping normalize ileostomies ☺️ x", "songbirde108": "Watching your video now! So proud of you for all of this. Sending big hugs ❤️", "paytonvee": "I am so glad you’re doing better now ❤️", "tannergr8rix": "As someone also living with ulcerative colitis, thank you for being so public and open about your experiences. It's so important to have people out here sharing their stories and helping to inform people. Best wishes for your continued recovery from your surgery :)"}