{"music_dil_emma": "Nom 🍔 nourish ur body beautiful x", "misskaylajayne": "You have lost so much weight Hannah I hope your feeling better xxx", "fatih.kepce": "Get well soon hopefully as soon as possible", "faslinahabeeb": "Get well soon hannah... You look like lost alot of weight. 😢", "kermits_frog_blog": "Hope you're doing better <3", "caffein.elf": "Sending all the love xx", "emmadargue": "Hope you get well soon hannah", "snowhitesally": "Still in hospital? How long until you can escape? X", "juliefay9017": "Sending you bigs hugs!!!!!❤️", "themuffinkhan": "Yo, people don't judge the burger eating. Sometimes greasy-spoon fast food is the cure. (Burger King basically saved me when I had just spent nearly 24 hrs awake with my partner in the hospital.)", "teapetrichor": "That is love!!", "dougcarmack1238": "What are you in the hospital for? Hope you fell better fast.", "molly.hastie": "I hope you feel better soon! 💕✨", "donaldbieszczak": "Hope your feeling better", "british_cook": "I know that feeling remember being ill in hospital and my dad bringing me in a Chinese take away to eat. I'd basically just had my face put back together, so it was amazing to be able to eat. I must have smiled like this too :) Hope your feeling a lot better now.", "thewattsway": "Speedy recovery ! 🙏🏻✨", "tezraleigh": "Lol some of these comments are so freakin' tiring.", "upon.this.sacred.land": "Have you heard of Against all Grain? She's a great resource for UC. I'm sure you're overwhelmed with all the food criticism but from person experience is really is the key to health and quality of life.", "malufink": "The McDonalds my Mum bought me after I got out of ICU and onto a ward was the best tasting food out of the entire time I was in hospital.", "holly.hancock_": "Best. Dad. Ever. 😂", "missele12": "No way this was the first think I ate after my surgery!!!!!!", "dmarrochia": "This was you after surgery @c_o_l_e_y 😘 xxx", "luckysoulnina": "All those people complaining about that burger: when you have colitis, you neraly starve. Its a survival fight. Who the fuck cares if its organic! You NEED those fats! Love you 😍", "salmamopeace": "Sending you the biggest virtual hug ever 🤗 ❤️", "seeairuh_k": "Girl, come to Texas and we gonna get chu a Whataburger! 🤠Glad to see your smiling face again! 😉", "abeardedfish": "Glad to see a smile on your face. Hope things are improving.", "valencamposn": "Sending lots of love 💕 so proud of you, can't wait to see you making videos again, miss you ✨", "beechwood567": "The small things that mean the biggest in this world, people that can see the small things that you love keep them close.", "mishaiel_m": "That’s so sweet", "hedikamal_": "Get well soon darling🔥💪", "aqeel_farid_": "I wouldn't recommend it but I'm no doctor and it's a great food choice. :-D :-D :-D", "iamsimplesimon": "Take care and have a speedy recovery!!!", "woodenwindowsills": "Sometimes that's all you need!! Hope you're on the speedy road to recovery!! Xxx", "chloeelliot": "hope you’re okay! ♡", "maudjuliette": "I wish you feel well enough real soon so you can get out of hospital. Hugs.", "isabelspsousa": "Hope you feel better soon ❤❤❤", "khmlwugh_": "aw i hope you feel better xx", "irlegend": "Keep your chin up and keep the smile alive. Things will keep getting better if you have the will to move forward.", "yoldinem": "It looks like you’re doing a lot better. So happy to see this.", "an_evil_elf": "Get well soon", "nickashleyphoto": "Get well soon!!!!", "damieloushavelle": "Sending you lots of love 💜", "skammyfresh": "Hope you feel better... you've been down and out for a while..", "neeraj_dohare": "Get well soon", "haleyrpotts": "❤️❤️", "marziesreads": "((Hugs)) Hang in there Hannah! Hope you’ll be stable enough to go home soon.", "carly.lillwitz": "Hope you are feeling better, your smile looks like you are!!! Sending love to you.💕✨💕✨", "rachel_hamar_": "Get well soon 💙💜", "callmebyyournish": "Ur smile has me smiling! Take care Hannah and feel better!!! ❤️", "o.r.o.r.e": "💪🏽💪🏽", "rawj_lilac": "💗💗💗💗💗💗💗💗", "the_trojan_ghost": "I was just curious what happened?", "brian_wilson_1985": "Agree with nishnish91, I see you smile and I smile. Hope you get to head home soon!", "rafaelahaygertt": "Hanna i hope we are doing fine and get better son. You are amazing. Thanks for the joy you bring to this world. Hugs from Brazil.", "emy_gomaa93": "Hope you feel better soon ❤️", "_georgia_osborne_": "Stay strong my lovely! Hope you get well soon♥️", "cupcakesinthesky": "Yayy!! Stay strong my fave!! Hope you get well done soon!! ❤❤❤❤❤", "tycarni": "best father daughter relationship ever if he brings u cheese burgers", "therebeccapeace": "💓💓💓💓", "rebeccaingamaria": "You got this! We're all rooting for you xxx", "_nirmztagram_": "Dadbro ftw", "laurenelloise": "💗💗💗 hope you are doing well Hannah xoxo", "mkunit3d": "Hope u getting better soon 🤗😘", "ajd_97": "Oh Hannah!! Hope you are feeling a little better !! X", "biancapercival": "I had a lot of heart surgery growing up and will continue to have throughout my life. Honestly I remember and can feel that moment you smell the McDonald’s after so much hospital food! Best smell and feeling in the world! Hope you’re feeling better x", "leohernandeznj": "Glad to see you smiling", "spacewoman": "hope you get better soon ❤", "audreeeli": "So happy you can eat that! Feel better my love xx praying for you. Bless.", "intothenight13": "I've never seen anyone so happy to eat McDonald's!", "carmarugaz": "Yuhuuuuuuuu 🙌🏻🤤🌸💃🏻", "ariadna_garrido__": "Be strong.", "alesscelauro": "Hannah sending love your way!!!!!", "ameliasabey": "Get well soon", "sky_1722": "Yum be strong", "katetyrer": "Sending love xx", "gemtakesphotos": "Parents are amazing ❤️ I hope you’re feeling better! Xx", "__thatjay": "best dad omg", "lauren_juliaa": "Wishing you a speedy recovery Hannah xx", "jungamerican": "thoughts are with you", "the_realshannont": "Keep getting better.", "kaiddiii": "I'm so proud of you, keep on getting better!", "digitaladept": "Twue love ;)", "schnurrvieh": "You look so fragile, but really happy... I hope you are getting better and feeling well soon!", "bazzrice": "Hope you are feeling better by the day.... And enjoy your burger 🍔 x", "oohshebigmads_": "You are so beautiful even in the hospital", "real.ar7": "❤️🌹🙏", "smallfriepie": "Your smile is the same shape as the bite out of your cheeseburger !🍔 #dadsrock", "lucymaypalmer": "Hope you are doing alright 🤓💕", "spreadthebooklove": "Get well soon, Hannah!", "msanokhina": "Get well soon! Lots of love!", "agusthehuman": ";(", "kaila_shepherd": "Having someone bring you fast good in the hospital is one of the best pick-me-ups ever! I once had a pizza hut delivered to me after my hip replacement.😂", "faulesb": "Get well soon!! 😊😊", "snagl": "you‘re so cute! keep fighting, you‘re strong!! 💪🏻", "spanglepics": "good you are on solids so soon, just take easy on some foods", "steve_c1987": "Best dad ever!", "sarahl1303": "Hope you feel better soon Hannah ❤️", "altmetalpunk": "Pure joy in that face lol", "kathclaypool": "hope you’re doing well, love!! ♥️", "mailysgarnier": "💞💞💞", "w.ym": "Hope you're feeling better ! 💖💖💖💖💖💖💖💖", "lamellos": "Hey Hannah, you are giving me so much positive energy with your videos, pictures and texts! I wish I could give you something back, stay strong and get well soon! ❤️💪🏼💐", "homefityogi": "💜💜💜💜💜 get well Hannah", "tatjanacelia": "I hope you're feeling better. You're smile looks amazing!", "iiinaaactiveaccount": "get well soon!💛", "lumaluus": "are u getting better?", "rosa_gane": "All the love ❤️❤️", "arielbissett\nVerified": "Verified", "thecoach_s": "Stay strong 💪", "now.is.perfect": "Just what the human body needs to heal 💔", "_valentina_b._": "This is so cute and sad at once...oh sweetheart I hope you're getting better😕💕💕💕", "moneylux": "Hang in there!!", "iamlucymoon": "Han you’ve managed to create an insta theme out of your hospital pics", "pumpkinellie": "❤", "mikeegrams": "Get well soon xx", "j_immy_g": "How do you feel?", "shannonleigh14": "❤️❤️❤️", "gl563": "💛💚💙💚💛❤️💜🧡", "trencher_22": "Hope you feel better ❤❤", "robbie_james93": "what you doing there???", "beardiful_ryan": "Wishing my new friend A speedy recovery. Love that smile of yours xx", "amberleatorrance": "Happy days", "vent666": "Good luck with the stoma! Fellow UC sufferers here", "majormaverick95": "Get better soon Hannah:)", "aalice_19": "Hang in there Hannah <3", "wearsmthblack": "Hope you'll get better soon, Hannah! ♥", "lucythemermaid": "Get well soon lovely lady ❤", "spoonielifelover": "I hope you get home soon Hannah and you are getting to grips with things xxxx", "orngetrees": "Get well soon 💞💞", "officialadman": "Oh bless, hope you're starting to feel on the mend", "georgiajohnstonx": "Sending so much love! Hope you’re okay lovely ❤️", "joburford_": "Respect to Dad 👌", "theoriginalpixi": "Hope you're feeling on the mend! Chronic illness is a BITCH 💕", "max3000k": "That little smiley face!! Awww", "pedro__cruz1": "Get well soon❤", "zestyroxy": "Sending love! Happy you can finally eat. 🍔", "thecelineproduction": "How long do you still have to stay in the hospital for? Sending good vibes and I hope you can go home to recover there soon ❤️", "fuckoffimeating": "I have a blog where I post pictures of people who don't want to feel bad about their bodies eating nice food, can I repost? ❤️❤️❤️", "charlotterosehus": "I hope you're okay❤ Get well soon xxx", "_lmgr": "Having McDonalds delivered when you're in hospital is such a pick-me-up. Hope your doing alright 💜", "phoebekroll": "Hope you feel better soon❤️❤️", "onlypurelyfe": "Get*", "chouiebc": "Get well soon!", "sarah.verena": "Really hope you get better soon!", "lauraadrummond": "Hope you get better soon gorgeous! Road to recovery isn’t easy, but you are such a strong woman! Love yah all the way from nz xx 😘", "rosiiecampbell": "cutie", "bethchatsbooks": "Hannah you look so poorly and that’s awful. I really feel for you. I am a massive fan of your podcast with Lucy Moon and Lena Norms and it’s so sad to listen to the podcast without you in the new upcoming episode. But get well soon and know that your fans send their love and are thinking of you😊💕", "jeansthoughts": "❤️❤️", "kay.tay.lor": "sending love, hope you feel better soon 💓", "oohgaryc": "Yes! X", "mar.sbmj": "get well soon 💕", "sanz_universe": "Get well soon Hannah....", "ms_prongs": "Oh sweetie, I hope you're feeling better. 💛🖤💛🖤💛🖤💛", "jennypearson400": "Sending lots of love Hannah! Glad to see you smiling ☺️❤️❤️", "imgingerable": "So much happiness in your eyes 😄", "alakai28": "There's that's cheeky smile we love ...glad you're feeling better chook xx ❤", "annaach_": "Get well soon girl!! We miss you so much @hannahwitton ❤", "thatgrlallison": "I hope you’re okay!", "aleatoirefrancais": "Oh sweet lady, I’m glad you can eat a burger!! Very sorry you’re still in hospital but I hope you get sprung out soon and that everything goes up from here!!!", "naileditbychelsey": "Hope you’re recovering well Hannah!! 😀💖💖", "thechronicpainlife": "Hope you're in a bit less pain hannah! 💕", "matt.tahir_": "You look better. I hope for a speedy recovery.", "rosieharrin": "Are you still not out the hospital ? Keep holding on (sing it😉), I hope you get better very soon ! Xxx", "mickey_jdd": "What a dad", "toothless.15": "You lucky girl", "cje_reid": "So glad you're doing well!! ❤", "evieoliviachurc": "How are you doing now? Xx", "_nikss____": "💞💞💞💞💞💞💞", "hannah_lou_w": "💛💛💛💛😘😘😘😘", "d0meafavour": "A smile that only a dad and a cheeseburger can bring", "jimnicebutdimm": "Hope you get well enough to escape from the hospital soon @hannahwitton", "baufie": "Hope you feel better💕", "boro_dina": "🌸Feel better 🌸", "ashleyschildree": "cutie", "keineteenmom": "Best food for a body with a nonexistent colon", "doddleoddle\nVerified": "Verified", "jadeoharaxo": "Wishing you well Hannah ♥️", "rhitrition\nVerified": "Verified", "liz_art_illustration": "You look like you're lovin' it. :P", "caraisafrog": "Hope your recovery is going well ❤ you're a lovely strong lady xxx", "nicky131106": "Enjoy every bite luv! Sending huge hugs and lots of love to you ....💜💜💜", "hopecaitlintreasures": "Sending hugs ❤️", "bethhawkins.01": "What a sweetie 😍", "rosiemcmorrow": "did he come in looking sheepish saying ‘i just picked up a cheeseburger for 99p’ because if not it’s a wasted opportunity", "hnnaah_": "hannah (my name twin lol) i hope you feel better soon, i hope ur not in pain 💛", "luisramirez2323": "❤️🌻🌻🌻🌻😍", "patrickgodard": "How was the surgery? Are you better now??", "tje_xplore": "Aw, what a dad honestly. How are you feeling?", "emily_bauer93": "Hope you are feeling better! Stay strong!"}