{"0ny3kach1": "The Establishment ~ Owen Jonesssss", "liamolivera": "1984", "andiemmitchell\nVerified": "Verified", "miagustavsson_": "About to read library of souls, the third miss peregrine's children book :)", "songbirde108": "It Starts with Food by Melissa and Dallas Hartwig. It's about the science of food and how it interacts with our bodies. And they're the creators of the Whole30 program so they talk about that too. Also book 5 of Game of Thrones. Ps- very sorry you got dumped, sending you big hugs through this time of self-rediscovery, healing and learning. 💕", "lazygaygrandpa": "Bitterblue by Kristin cashore!! It's the 3rd in a trio of books and the author writes female characters so well I want everyone to read this book", "valenfrassa": "Sister Outsider by Audre Lorde 💜💜 (awesome feminist read)", "phlovita": "How to Weep in Public by Jacqueline Novak", "hey__its__olivia": "How to worry less about money by John Armstrong and The School of Life 💜 Absolutely love this. It has eased so many anxieties I had about money.", "hannah.griffithsx": "Pride and Prejudice by Jane Austen 💕", "cianducrot\nVerified": "Verified", "ltcooper92": "Angels and Demons by Dan Brown", "cluelesskatie": "I'm currently reading How to be a Woman by Caitlin Moran", "kethrie.p": "Quiet by Susan Cain, as recommended by Savannah Brown :)", "_.holleh._": "I'm reading Bazzar of Bad Dreams by Stephen King :))", "isobelw_": "All the bright places by Jennifer Niven", "b_a_roberts": "1984 by George Orwell", "lucydixonpeel": "Every day by David levithan", "carolinemfrancis": "The woman in cabin 10 by Ruth Ware", "enchantedtaz": "I'm rereading Harry Potter 💛", "_sophiekunz_": "Everything, everything", "amberlcunneen": "Love your book recommendations! Can't wait to get into more of them", "mitzimattea": "Who could possibly dump you, though? 💝", "coconutkeekee": "that you don't sleep then", "scarrednotscared\nVerified": "Verified", "philthecaveman": "Night Watch by Terry Pratchett 😊", "amypeveto": "The Wicked Boy, by Kate Summerscale. I'm obsessed!", "staceyjane_s": "Currently reading Alice in Wonderland and Alices adventures through the looking glass. Not long finished the jungle books :)", "hattieleach_": "The girls of slender means is p good", "wolf_thestral": "She is not invisible by Marcus Sedgewick. It's good so far!", "the_happywarrior": "The Quality of Silence by Rosamund Lupton 😊", "nxtxlieclaire": "\"Prisoners of Geography\" and re-reading all the HPs (on Goblet of fire currently) ☕️👌🏾", "mssophielaura": "The Picture of Dorian Gray!", "firealar.ms": "the alchemist :)", "literarylaurenk": "The Prisoners of Geography Tim Marshall,came to my Uni (Swansea) to do a talk,it was helpful as I do history and do politics modules #geek #coolkid", "priyaashahh": "Second game of thrones book :):):)", "that_girl_alisha_": "Currently reading 'am I normal yet'as I loved 'what's a girl gotta do'! ❤", "ffs.fm": "I'm in the middle of a book of essays by Orwell, Infinite Jest, and Catch 22. Visited too many bookshops while on vacation. 😆", "libbygargett": "Currently reading 'Sputnik Sweetheart' by Haruki Murakami ❤️📚", "larawestra": "She's come undone by Whally Lamb", "samantharosemangino": "Just finished 'You'll Grow Out of It' by Jessi Klein! It was such an awesome read! Now I've started Amy Schumer's new book and I'm already laughing!", "rubymcnab": "Etiquette and Espionage by (I'm sorry I forgot don't judge me I'm usually not like this). Love you by the way", "txmluke": "This Book Is Gay by James Dawson", "eve.s.c": "Currently reading Divergent", "alexandracwebb": "Currently reading far too many books, but primarily The Ocean At The End Of The Lane, and (re-reading) Order Of The Phoenix :D", "tcezuma": "Currently reading What Belongs to You by Garth Greenwell", "samanthakuban": "I'm reading Asylum by Madeleine Roux", "carlanlately": "The Girls by Emma Cline and The Girl in the Spider's Web by David Lagercrantz", "victorier": "The Waves by Virginia Woolf 🌊", "ionaacroally": "Eleanor and park, beautiful writing, by rainbow Rowell ❤️", "jamoca.jpeg": "On the road by Jack Kerouac", "meganjulianna": "I'm gonna start reading On the Other Side by Carrie Hope Fletcher 💜", "jasminda_webstar": "wow I like how everyone joined in, we are such great subscribers haha", "astrid_ts": "trying to read Alice in Wonderland atm! 📚", "disconcerted_ravenclaw": "Currently reading Binge by Tyler Oakley", "sarosha.b13": "Flicking through This Modern Love but so close to finishing Throne of Glass by Sarah J Maas, seriously recommend.", "correnstanley": "I'm currently reading when will there be good news for school, but after I've finished that I'm gonna start Harry Potter aye", "bc_bilge": "I'm supposed to be reading the Kuran but also still reading Catch-22", "verityroatlanguagesolutions": "Currently reading 'L'armée du salut' by Abdellah Taïa in the original French. There is however an English translation and would definitely recommend.", "elisehelenaa": "The Poison Artist by Jonathan Moore", "sophiemelissa_": "The kind worth killing by Peter Swanson", "hannah_049": "The Chronicles of Narnia", "renraith": "I'm reading Now is the Hour !", "emmyroex": "I'm reading A Darker Shade Of Magic.", "bigg_giraffe": "Im reading Kings and Sorcerers: Night of the Bold. The 6th book in the serise.", "maddieboris24": "Thomas and Mary (story about a older married couple and the complexity of their relationship because of other people's reliance on it) ⭐️", "peterppalka": "The Girl on the Train - boring AF ! 😁", "ikennedy333": "I'm currently reading \"The Chronicles of Amber\" I hope you are okay Hannah!", "eceidil13": "Currently reading Girl Up by Laura Bates!! :)", "sarahgarnham": "Currently reading The Noise of Time by Julian Barnes 📚☺️", "corriehammons25": "I'm reading Diary of an Oxygen Thief", "em.greta": "Anna karenina and Harry potter and the prisoner of azkaban (because sometimes i get bored reading anna karenina)", "fringemusings": "Currently reading A Brief History of Seven Killings. 👍🏻", "sshxniaa": "Current read is the cursed child", "soph_irving": "Currently reading The Master and Margarita, trying to get into more obscure books so Russian lit seems to be a good start ✨", "sydney_tritt": "@luekhemmolove", "beththepisces": "Currently reading SLUT by Katie Cappiello & Meg McInerney", "rachiiil": "@rachiiil", "jitnabolautnakar": "Currently reading a storm of swords, sandman vol. 4 and harry potter & the philosopher's stone.", "millie.daniels": "I'm reading Under My Skin by Juno Dawson. It is soooo good!! ❤️❤️", "monochromeloner": "Harry Potter and the goblet of fire for the millionth time ⚡️", "dixtabitha": "Reading Cress by Marissa Meyer", "ourcianjohnsmith": "Harry Potter and Goblet of Fire", "ifelldownagain": "Geek Love by Katherine Dunn", "roni.lyons": "All Of The Above by James Dawson", "nusti_": "Messenger of fear by Michael grant", "katerawson_": "The Girl with the Dragon Tattoo by Steig Larsson, dissertation prep!!", "annalatchman": "Trying to get through the extended text version of American Gods by Neil Gaiman", "paperbookmarks": "I'm halfway through Valley of the Dolls by Jacqueline Susann :)", "niamhoddy": "Just finished the colour purple by Alice Walker and starting bad feminist by Roxanne Gay tonight✌️", "astrid.bjorndal": "I just got my copy of \"What's a girl gotta do?\" In the post and I'm so excited to finally read it.", "hellennohellenyeah": "Memoirs of a Russian princess, she was the last tsar's cousin and she survived the revolution in 1917.", "lucy.adams": "read Quiet it changes your whole perspective it's SO INSIGHTFUL", "elliethewright_": "Bel-Ami (it's amazing)", "ffreak10": "I just bought The Cursed Child this weekend.", "turtlady11": "I'm reading Steppenwolf by Hermann Hesse and it's quite interesting", "nickegibbons": "I'm reading \"The experience of vaginal breech birth. A social, cultural and gendered context\". It's my friend's PhD thesis for which she achieved her Doctor of Philosophy", "goodluckginkgo": "I just completed On The Other Side and now I'm reading the Book Thief!", "hannahlinaker": "I'm reading prisoners of geography! I really interesting look into how geography shapes the political landscape and how it creates divisions and enables people to come together", "sarahkiew_": "Currently reading On the Other Side by Carrie and You're Never Weird On The Internet by Felicia Day 📚💕", "mariekgoodwin": "Sophie's World💕", "tom.chandler22": "Currently reading the short stories of Anton Chekhov!!", "holliebuckey": "Second life by SJ Watson; so far it's amazing!", "moewentag": "I'm currently reading M train by Patti Smith and it's amazing!", "_emmacat": "All I Know Now by Carrie!", "jessicafrasr": "All the light we cannot see by Anthony doerr", "ellsiebub": "Currently reading Lolita by Vladimir Nabakov. V. Clever book that I would totally recommend!!", "vickimc_x": "The manifesto on how to be interesting", "scott.thackaberry": "Odd statement: \"I got dumped.\" Implies loss of control. Does either party really control in matters of the heart?", "lola.ragusa": "The clockwork orange", "iantshanks": "I'm not reading anything at the moment but I will be getting some graphic novels that I will read soon @hannahwitton", "alyssadriz": "Currently reading The Unbearable Lightness of Being by Milan Kundera!", "erinjoost": "When breath becomes air by Paul kalanathi", "osanneart": "I'm reading the girl with all the gifts. The film trailer already made me emotional, so I had to read the books.", "algaenredada": "One hundred years of solitude by García Márquez", "amylhho": "Currently reading Fangirl by Rainbow Rowell", "laurestongardens": "I am currently reading You Know Me Well by Nina LaCour and David Levithan ♥♥♥", "graceypaste": "Green Rider by Kristen Britain", "mandarine_one": "Currently I'm on the last chapter of Eat, Sweat, Play. After that I want to read \"what I talk about when I talk about running\" by Murakami", "rosie.the.artist": "I'm loving \"Playing to the Gallery\" by Grayson Perry :)", "beckycello": "Orange is the new Black, Piper Kerman", "atomicsammi": "The War of Art :)", "christina.maki": "I'm re-reading Endgame by @CJ_Daugherty", "mitts_mistry": "1984", "mrsamuelfraser": "1984 and a clockwork orange", "estherfutterer12": "I'm reading the diary of Anne Frank", "katlovesbread": "White oleander by Janet Fitch. It's a great read. Highly recommended", "laura94ann": "I just finished we were liars by E. Lockhart. Not a massive fan of the ending tbh", "talkingchapatti": "Reading a fantasy novel called The Name of the Wind", "ouat_.in._hogwarts": "Currently reading Looking For Alaska. I like it quite a bit so far!", "djjazzyjoff": "3rd Lord of the rings :)", "emmarcw": "Ruby Redfort catch your death by Lauren Child", "haveabananahannah": "I'm reading A Life Discarded by Alexander Masters", "salehalatif_": "I'm reading, The Paying Guests by Sarah Waters", "oliviac.20": "Tell Me Three Things by Julie Buxbaum. I think you would really enjoy it!", "johnny_hartin": "All The Birds In The Sky by Charlie Jane Anders", "ellie.nia": "I'm reading To Kill a Mockingbird", "taylormparker0": "I'm reading Girl Boss", "_inkling_": "Heretics of Dune by Frank Herbert", "emma_isaksen": "I'm reading eat, sweat, play", "pearlroberts_": "im reading The Danish Girl", "spaghetti_junctions": "I'm reading on beauty by Zadie Smith but I only just started so I don't know what I think of it yet😊", "izzzywheeler": "Cider with Rosie 🌹", "weet_bic": "Currently rereading The White Tiger by Aravind Adiga 10/10 recommend, it's brill xx", "_victorialisa": "I'm reading the City of Ashes by Cassandra Clare", "jojospenelope": "I'm currently not reading anything, I can't get into the headspace to focus on words.", "catwinnn": "Reading Fantastic Beasts & Where To Find Them", "dante_rox_music": "The code", "aquakerwitch": "Just started Tess of the D'Urbervilles but also reading the new Bridget Jones book", "gethinpearce": "Currently nothing, got a list as long as my arm. But The Hobbit is to be read first for university purposes", "_aithne": "Harry potter and the cursed child 😏😏", "rekaago": "I'm reading World War Z 😄 Boyfriend recommended it and it's actually fantastic! Definitely worth your time.", "willgroarke": "Lord of the rings return of the King 😊", "odjk": "The Armageddon Rag by George R.R Martin. & The Empty Chair by Jeffery Dreaver.", "maisiemaslen": "I'm reading Lolita by Vladimir Nobokov!", "emilyjmcguire": "💕💕💕", "miss_mandragore": "i'm currently reading walden and paul auster's new york trilogy both are great !", "michaelleeki": "The Watchmaker of Filigree Street! 🐙⏱", "okalisha": "I'm currently reading A Work In Progress by Connor Franta!", "emilywelbers": "I'm currently reading The Sky Is Everywhere", "zoe_sampson21": "I'm currently reading TABINOF", "dalvman": "I'm currently reading Philip K. Dick's The Man in the High Castle", "imcalledlois": "I'm currently reading 13 Minutes by Sarah Pinborough", "hazelsands": "I'm reading Pride & Prejudice for the first time!", "gianna_howells": "I'm currently reading Harry Potter and the Chamber of Secrets! Xxx", "spider.kate": "I'm reading the princess diaries series lol xx", "jackhowad": "I'm currently reading on the other side by carrie xo", "elliciaroxanne": "Not sure if you've read it before but 'You Had me at Hello' by Mhairi Mcfarlane is a really funny witty book that helps if you're feeling down. It's like a northern Bridget Jones ❣"}