{"jasonmoffitt9": "Wishing you a speedy recovery! You seem to be dealing with everything amazingly! X", "nicole_9245": "take care !!!!! love from China ❤❤❤❤❤", "georgiasambrown": "Great to see you so good and just wondering what surgery have you done ? Xx", "inezccosta": "sending you all the biggest well wishes 💛", "ccbordewey": "❤ sending so much love! You're an absolute trooper", "officialsamepage": "Sending prayers and good vibes. Just watched your video with Kati and hoping that being back in hospital hasn't been as traumatic as the first time. I know the first time I stepped into a hospital after having traumatic experiences, I was shaking and puked just inside the door. Sending strength your way ❤❤", "sandie__shires": "Sorry to hear you are unwell again,Get well soon Hannah, what did you have done. My daugther had an illesotomy done in 2013 she was only 16. Xx", "nourishingsoulfully": "Rockin’ the hospital gown like a Quuueeeeen. Sending lots of love and positive vibes your way Hannah x", "chronically.sophs": "@hannahwitton sending you so much love and light and loads of healing vibes. 💛🌻", "peterwallison": "And keep strong too, never mind the string!", "callawaybadboy": "Keep fighting for all of us with ibd suffering with the illness,you still look as beautiful as u always have sending lots of love xxxxxxx", "jimena.trz": "get well soon, love u", "karen_hua\nVerified": "Verified", "mike_leavel": "I hope you are feeling better", "likesandeep": "Hey wish you speedy recovery all the way from Dubai. Looking forward to you fit and healthy!!!", "ninethreequarters._": "🍆🍆🍆", "nga_group": "Get well soon... Beautiful angel... 👆😘😘😘😘😘😘😘😘", "hansinee_jay": "Get well soon Hannah ✌❤", "reignandleigh": "did you have a temporary central line?! 😊 SO GLAD YOURE FREE!!!! 😄", "hafiz.xxn": "(خبيرة حافز و حساب المواطن)💕 اتشرف بخدمة الجميع واتعهد بحفظ بياناتكم امام الله بكل امانه و سرية ❤👌للتواصل دايركت واتس اب )", "wansuyud": "Ure so strong..", "sophiessuitcasetravel": "❤️❤️❤️", "lucchi_supremeson": "❤️", "lagonfia": "Flawless!!! As a true Victoria Secret model you're only allowed water before the show, to make your skin really glow! By that way I'm from Italy, if you want any kind of food from here just ask... By the time it arrives I hope you'd be allowed to eat... Anyhow un abbraccio forte Hannah e spero davvero che tutto ti rimetta prestissimo! You truly are a force of nature💃", "andreaslarsamuelsson": "Combine those saggies with that beautiful face of yours and those hella fine nails, you get a very sexy woman✌️😘may all the carbs in world find your mouth🤤 PS i wish i were carbs", "scottachord": "I have IBS and Gastroparesis and I completely understand the journey you're going through. Keep fighting and doing what you're doing.", "elzyto": "YOU GOT THIS!!!😍💖", "sjmckell": "Best wishes for a speedy recovery all the way from Australia xx", "furryfriend098": "You are a brave woman 💗", "wesleywoolfall921": "Hope you feel Better Soon", "bamblingsofnaffy": "Sending you lots of love and positive vibes 💖💖💖💖", "jollych1pmunky": "When you been in for a while, have to admit food is life 🍔🍟🍰 Sending positivity your way x", "gsevrum": "Get well soon beautiful sending healing love your way", "adamblacktopp": "Those are the craziest accessories you've worn so far. Yeah, be your own person, don't follow the crowd!", "chezdaz1": "Vogue baby! Bless, you’re probably not old enough to get that reference 😜 Best wishes Hannah!", "huntermurray1873": "Sending virtual hugs and kisses and flowers for the lovly princess", "crafty_elle": "Aw @hannahwitton bless you anyway! Such a trooper☺️ I hope things go well with recovery this time round. My chrons journey has been a long one with many bumps in the road. It’ll be 13 years this winter since my emergency colectomy surgery and have had many others in between, this year I’m having another set done and hoping they’re my last! Everyone’s is so different it’s crazy, sending you best wishes and lots of love❤️❤️❤️", "tycarni": "Ily I hope you get well soon!", "bookandtea23": "Sending nothing but positive thoughts your way. I hope you get out of hospital soon and are able to eat food", "miro_aloha": "Plz take care", "c_r_armstrong": "💛💛💛💛💛", "bwalk1987": "You got this!!!!", "clarence_maslamoney": "Looking good girl", "matt_zabs": "Wishing you a speedy recovery ❤️🧡💙💜💛💚", "irlegend": "You make the hospital look so extravagant and peaceful. Not to mention I'm sure everyone would agree 😍😍😍. Get well soon my favorite tiny youtuber/ inspirational sex educator", "foxy_menace": "What surgery did they end up doing?", "cupcakesinthesky": "Yeah 30-60ml!! Sending you love!!", "tamararushton": "Sending my hope for a good quick recovery is a strong lady chin up sweetie u be able eat soon enough beaut hope ur operation whent ok xx", "sailor.skip.vs.mermaid": "😇😢", "oddlygothic": "Even poorly in hospital, you still look gorgeous! 😍", "enixsa_": "Wishing you all the best Hannah! Sending all my love and positive energy your way 💕💕💕", "mark.allen9033": "Your P.M.A. Is great to hear (positive mental attitude). Baby steps,back to the Hannah we know.🤗", "kinkerbellll": "Still cute!", "lauriepops.7727": "Get well soon! 💛", "mikeegrams": "Get well soon", "lizzi_wa": "Hannah- i’m an RN, and your attitude is so inspiring to me!🌼 Your journey has given me a recent heightened awareness of how my actions influence my patients during each of my 12 hour shift... i hope your nurses are treating you with a little extra love!!! I will definitely be sharing your story with any of my GI patients that need a motivational boost❤️ (Ps- looks like your NG tube is out, congrats! I hate those things)", "skammyfresh": "Damn.. back in the hospital? Hope you feel better soon", "melo077": "You got this.", "slasha": "Unlucky you have to go through this, happens to the best of us! Get better soon Hannah 💪🏼🙌🏼", "carolinelaline": "💗💗💗💗", "diana.sm.ferreira": "Making hospital fashion look good, one smile at a time. Wishing you all the best, Hannah.", "mikajeem": "Wishing you a quick recovery. Positive thoughts! 💖", "laujo": "I’ve just come up from recovery from endo surgery, so I am serving a similar look 👀", "humarouge": "Sending you lots of love! 💪💟", "jonnymanifold": "With your positivity you are always sexy", "hfgermany": "All the best whishes!", "meliina_1997": "Ugh i’m so sorry you’re back at the hospital! Love you Hannah❤️", "uvegbeka_": "I love how strong you are ❤️", "desire.games": "Get better!! Sending good energy from Barcelona😘", "hollyeffdublyew": "Good luck Hannah!!", "1tserin": "aLl tHe hUgs aNd kiSsEs", "tumunu": "So that's Hannah 1 - 0 Hospital", "alexmuzychuk": "You are gonna make it 💪 I've always admired your strengh and optimism, and I know you'll cope with that. Remember that it's not forever and get well soon 🖤🖤🖤", "justinaaee": "Wish all the best.. hope that finally you will get better ❤️", "fanny_tld": "☀️💛", "ambett10": "You are so brilliant and inspiring ❤", "amyjthomson": "Just wanted to say thanks for being so amazingly vocal about UC and IBD and Mona. Got diagnosed four years ago when I was 15. My UC is called Norman (stormin norman) we have a love hate relationship. I love garlic and cream... he hates garlic and cream... Seriously though you make me feel like less of an oddball that has to think about nearby toilets and regularly talks to their bowels like they're a seperate human. Wishing you the best of luck❤", "lorijomurchie": "Feel better soon Hannah ❤️🌸", "amylaura92": "Sending positivity your way!! xx", "ahsanteb": "Sending love your way!! ❤️❤️❤️", "iamfaithmilne": "How are you?? I hope the recovery is super speedy 💛", "scoutclark": "praying for you!", "mikefalzone\nVerified": "Verified", "sdtaurus": "Get well Soon! 💐💐😇 Ameen", "frostbite939": "Way to accessorize!!", "_nina.amelia": "I hope you're surfing on an incred morphine wave. Wish you all the best 🌷🌷", "zoebearbish": "Sending lots of love and light your way!", "shannonleigh14": "praying for your smooth recovery ❤️", "iloivarr": "Omg thank goodness for waterrrr. 💧 💦", "sarahlousteelex": "Omg how many connections are attached to you!!! but yeah hope you have a speedy and proper recovery ❤️", "golden_shortie": "If you feel like eating though that's got to be a good sign.", "kennowell": "@hannahwitton wishing you the very best!! I hope this is the last surgery for a long time!!", "geordiemuppet": "Hannah just think all that food it’s just lips and offal anyway you don’t really want it. Then when you feel better just remember that was the morphine speaking and burgers are great! #CunningPlan Get Well Soon.", "thespence60": "@hannahwitton Take care Sweetheart, Get well Soon from Spencer and Stanley the Stoma. X", "carlota.manuela": "Many hugs xx", "trevorgeorge66": "Keep the faith hannah", "grillo.sven": "Not everybody can wear it with that amount of style! Get better soon!", "bilbo_baggins_1997": "❤️❤️", "purplepoodleblog": "Thinking of you .. hope you make a speedy recovery! Lots of love ❤️ IBD sucks 😕", "rachel_sarah_m": "Sending get well vibes xxx", "myfipalfrey": "Sending so many loves n hugs", "yrsvr": "Sooo happy to hear you're having those little steps of progress ❤️", "racerjosh": "Hang in there you can do it prayers", "lily_robs": "hope everything goes well! it sucks that you have to be in the hospital again :/", "itserinjenna": "We love a strong sister 💛", "peacock.dream.z": "💕💕💕 hope you have a speedy recovery and get to east some food soon lovely!", "snowglimmercat": "I found it was absolute torture when I was nil by mouth and it was dinner time and the other ladies in my bay would get their food and I@would be sitting there thinking “but I want some.....” and mentally reaching out with both hands 🥖🧀🥩🥓🥞🍳🍗🍖🌭🍔🍟🍕🥗🌮🍤🍭🍪🍦🍰🎂🍮🍿🍫", "paulaa.ba": "all the best for your recovery! I suffer from crohn's disease so I know exactly how you feel, lots of love❣", "kevin.wg.02": "You look so high on this it’s hilarious 😅 glad you’re doing better , you’re looking fine 🙏🏻👍🏻", "hatchert77": "Be strong and please get better.", "chuggy_pigwitch": "Such radiance ,such beauty! 🙌🏻💛, get better soon Hannah x", "x.katieriley": "Don’t how anyone can look so gorgeous in a hospital gown", "keshet_aylonit": "If you would like me to, I can say your name for the Mi Shebeirach tomorrow at services.", "masonjames": "The cleanse.... noooooo! I’m so sorry.. I just went through that same thing. I hope you are doing well. Know that there is a steak dinner waiting for you.", "micali_art": "what happened?", "teapetrichor": "Gosh lookin good Witton! Seriously sending positivity and support. ❤️☕️", "graceeshirley": "Feeling for you right now! Got a nasty throat infection that has had me vomiting up anything I eat. Makes you want for all the takeaway pizzas you ever had", "sianpeters.me": "You’re such a babe Hannah. Smashing it. And rocking that gown. Xxxx", "julieevans_dowrick": "Sending you many well wishes and positive healing energy.", "mrsclairebennett": "Aw get well soon Hannah xx", "danllewhellyn": "I see danglies around your neck, do you have a central line in? If so they should really have curos caps on!", "consciousfemalebeing": "Thank you so much for your recent video on trauma and PTSD. I am a PTSD survivor and I didnt have around many people that could understand the symptoms, so it is nice to see someone spreading awareness.", "narflet": "I honestly find hospital gowns so comfy. 😅", "glenn.weaver.5": "Hoping you get better lots of hugs", "ocylouwho": "Rocking that look!! Sending love💕", "josie_widger": "So glad to see ur doing a bit better. Take as much time as you need, plus an extra day, before coming back to YouTube. We care 100000X more about ur health than a video xxxx", "emfoulds14": "Oh you poor thing!!! Hope you get 'released' soon! 💕 xxx", "wat221b": "❤", "rac01hel": "Love you Hannah! Get well soon darling! Following you on your path to recovery (again x) x❤️😍💩", "lucyheatheruk": "Sending you lots of love and foody thoughts 💗", "andrew_battifarano": "From one ostomate to another, wishing you the best and hoping you get out of there soon!", "liahatz\nVerified": "Verified", "competent_equestrian": "Hope you feel better soon!!!!!❤❤", "lorcaesar410": "Wifey is so beautiful and positive hope you get well soon 😍😍😍💯💯💯💪💪 @hannahwitton", "femmekilljoy": "You’re seemingly staying very positive and that’s a sign of inner strength! Well done you. 💜💜💜", "littlekaatie": "Happy to hear your recovery is going well. Hope you get food soon!", "jopineapplesuk": "Sending you love and good thoughts. I hope for a quick recovery. X", "angiecubist": "I hope you feel better soon, Hannah! ❤❤❤", "slowtransitsarah": "I came out of hospital 3 weeks ago, I had ileostomy surgery. However I got ileus (paralysed intestine) as a complication, I couldn't eat for about a week and had a draining NG tube in 😶 I remember my first spoonful of mashed potato was heaven! Hope you are able to eat soon.", "vickyscalise82": "Are you on TPN @hannahwitton ?", "anne_in_ireland": "Sending some huffelpuff love and well wishes! 💛💛💛", "paperboyo\nVerified": "Verified", "jessy_ktznr": "You’re so gorgeous 💫", "the_prissy_ginger": "Looking great, Lady!", "acloudybluesky": "Wishing you all the best Hannah! I love you so much and found your newest video so helpful 💛 thank you so much and I hope that you recover quickly and safely 💛", "lydiajoytaylor": "Keep Going! 💕💕💁🏼", "thejayrajput_": "God speed", "domweezee": "🧡💚🙏🏽🙏🏽🙏🏽", "jludvig": "💕💕", "_seeking.happiness_": "Stay strong. Sending good vibes", "ilse.rebekah": "Sending so much love and support! You can get through this!", "vero_cabanillas": "💛💛💛", "hughesclues_": "Sending you love and healing, Han!!!!", "switkiyo": "Get well Hannah. Feeling super sad seeing you in hospital again. Love you and your work to bits you smart ass 🖤👋", "beardedbug": "Looking good! Can't wait until you're back on your feet!", "hyphendude": "Feel better soon Hannah!", "salromero": "Keep your head up girl! Like my favorite Beatle sang, “All things must pass..”", "vgangcharlie": "Keep going hannah! X", "bubblyemmua": "Yayyy 🎉🎉🎉", "kylaasutherland": "You look great 😊 I know being in the hospital makes you look rough (at least it did for me haha). Hopefully you’ll get to eat soon! I hope you have a quick recovery! 💜💜💜", "maguilo71": "💪💪💪👏👏❤️❤️❤️🇦🇷🇦🇷", "hannahluvabby": "So glad to see you getting better! Take it easy and heal up!!!", "jen.ohogan": "Send all the hugs your way. I hope you get to go home soon. 💜💜💜", "laura.in.london": "Yay for water!💧thinking of you and sending you lots of love x", "ihisweet": "So nice to see you being so adorable and positive, even in an unpleasant circumstance like this. 😭💛💛💛💛💛", "mripley13": "Lots and lots of love Hannah!", "elsaarp": "❤️❤️❤️❤️", "jimnicebutdimm": "Hope you get well soon @hannahwitton", "sarahlucinda_x": "I was nil by mouth in hospital because of my Colitis last week but not for as long as this! You brave soul. Keep going! You’re inspiring, all your content has really helped me recently 😍❤️💐", "nursereeny84": "@hannahwitton Just saw your recent video with Kati & saw a comment saying you had surgery again. Dunno why I wasn’t following you on IG? I love your videos!! They are really important in an age where teens get most of their info from the internet! You are a super role model. I hope you recover quickly & get to eat all the things soon xx", "_samanthafinlay": "And still fabulous", "sojalattens": "I am so sorry that you have to go through this. I really hope you get better soon ❤", "lyndzerella": "Thinking of you lady! Hoping for a quick recovery and hoping they’ll let you eat soon!! 🧡", "angelmollylong": "@abby_tegan_", "eleventhsong": "Sending my love to you. Get better soon. Stay strong. ❤❤❤❤❤❤❤❤💪.", "coffee_slt365": "We love you so much Hannah!!! We’re all sending positive thoughts for you😊❤️", "music_dil_emma": "Good luck x", "norbertb1978": "Stay strong!", "themajikelone": "Get well soon Hannah!!", "byrnephotography": "Are you in Northampton Hospital? Speedy recovery Hannah 🙏🏼😘", "strongher_you": "Much love lady xx", "leen_vanhoudt": "Sending you lots of love!!", "saraabba97": "💕", "ambervanheumen": "Sending love💪", "bethxflannery": "sending you all the love!💖", "carolcavaco": "Sending you love Hannah!", "g_smith03": "Get better soon Hannah!!! 💕💕💕", "istartwitht": "Stay strong 💪 you are the strongest person I follow online 😊", "bramirez37": "All the best. You look amazing as usual", "janneicej": "You sexy thangggg! A hospital gown has never looked better! Sending nothing but positivity your way.🌻✨✨", "kassjordann": "take care!! i hope you get better soon❤️", "braz78": "Get well soon Hanna 💋", "amyvanderlist": "Hope you feel better soon Hannah!", "marie.nische": "You are strong! Get some rest and keep fighting. Your positive mindset will get you through anything, I believe that! 🌸🌸🌸", "sofi.kaefer": "Go girl! You can do it and you are amazing! Lots of love 🌻🌻", "beautycreep": "Sending loads of love ❤️❤️❤️ get well soon!", "mylenahbug": "Sending tons of love your way Hannah! You guzzle down those 30-60ml an hour! 💕", "jessevolanti": "Hello Hannah sending positive vibes your way 🙏🦋", "samanthac1996": "Woah there 30-60ml of water an hour, you better pace yourself. Hope you feel better soon", "hildalilja": "Get well! You're so strong!!", "meebsheeb": "sending you love and imaginary donuts", "sarah_anstey_": "Are you on parenteral nutrition? They should be feeding you that way!", "robin_and_julie": "❤❤🌹", "maggieherane": "💖💖💖💖", "brandy.lynny": "You're so positive and amazing!! Wishing you a good and speedy recovery 😊❤", "sw4210": "Lots of love your way. ❤️", "lumierelxve": "I had a small ear operation done today and had you in mind to calm my crazy nerves. Hope you're feeling better 🌹🌹 sending you looovee 💖", "hannahyep": "Woooo get dat limited hydration, girl! Killing it!", "simpilot99": "I'm hoping that means you're health is improving. ♥️🌹🌹🌹", "theprisoneroffantasy": "You're so amazing, hope you'll get well soon ^^", "mhyraquellq": "looking gorgeous as always! i’m wishing the best for you hannah!", "noah.j.ones": "Wait, you weren’t allowed to drink beforehand ??? How is that even legal, don’t you get dehydrated ? 0-0 (((sorry I’m not smart when it comes to these things oof)))", "richard_baker6": "Hope things are better soon Hannah; and that they stay better", "isabelle_kristiansen": "Sending lots of love. Youre amazing❤️", "christiannerisman": "SENDING LOVE ❤️❤️ 30-60ml an hour?! What an absolute treat 😉", "tareeeq94": "You are the strongest person on this earth", "ikihaventbeenthebest": "so strong and always positive♥️ get well soon", "ellynlouiselaws": "Thinking of you, I love how positive you’re being. My kidney transplant is in some trouble at the moment and I’m back and forth from hospital and I wish I was half as positive as you 💗", "bodvarsdottir792": "Thank you for allowing us to follow your journey! Stay strong and feel better 💚❤", "simx": "Xx you will be out in no time hopefully, think of all the carbs and meat you will be able to eat when you can!! Xx", "rob_had_": "Get well soon Girl! Stay strong :)", "theflutterbyroom": "💕💕💕", "biancaa.isabella": "Get well soon, you strong woman!🍰", "mansell.evans": "Sending hugs and best wishes Hannah.💗", "frankiemillard": "💜", "misscricrii": "😘", "aleatoirefrancais": "I am so so so sorry, being regulated on food and water is a special type of torture. Very happy you got through the surgery and I’m sending you all the strength for now and the future. You WILL get normal amounts of food and water one day!!!! (Been there, lost my damn mind)", "beckylouisewise": "Beauty ❤️ such an inspiration I can’t even", "ruth.kavo": "Your positivity is insane 💕"}