{"thunderchild999": "Fantastic picture Hannah, all the very best for the future", "e.d.i.e._": "Wow this is stunning also side note the lingerie is gorg!", "allthatjessz": "Your 2018 reminds me a lot of my 2013. Only that I didn't have ulcerative colitis but Lemierre's Syndrome. Either way, it sucks. I wish you all the best and sending you strenght and positive thoughts via the interwebs, because I remember needing those the most. Get well soon! 💛", "olegeia": "Do you have the stoma forever now?", "beck_cp": "I hope you are doing okay?You are so beautiful and such an Inspiration , I myself don't have a stoma but I have an indwelling foley catheter,You seem to handle everything in your stride. Carry on being you because you are amazing.Thank you for showing me that it's okay. The world is lucky to have positive role models such as yourself ♥️", "adrianoalvessales": "from brazil", "tobi_dersaarlaender": "Love your life! Hope I can enjoy my life anytime as good as you :) #keepyourheadup", "bethrdb": "😻😻😻", "m7madmadi": "What is this in ur body ??🙄", "mvporange": "Respect", "journalistajannely": "This is really hard and I hope everything goes well. I can relate to this. Last year I got esophagitis and couldn’t drink or eat anything and I was so scared because the tests were so difficult and I haven’t done surgery yet. I even panicked with the endoscopy. I’ve been getting better in a weird way and doctor still don’t know the cause. I’ll pray. I hope you start getting better like I did. 🙏", "mphogan67": "Still look Yummy, yes I'm a weirdo, no I'm not dangerous!! lol", "itskristen36": "I really admire your confidence and ability to move forward even when things are tough. I strive to be more like you in that respect 💙 you are amazing", "canth_": "@anthonybri16", "__pot____": "Best bag by far!!!", "xholli3x": "My mum has an ostomy and I know it took a lot for her to come out and Share her long battle! Because of people like you she felt like it was okay - and now she’s helping and mentoring other people so that they know it’s OKAY!!", "charlielouisegray": "@xx_samsie_xx follow this girl! 💕 xxxx", "cantlon_breanne": "I love this! And so admire you for being so vulnerable. You are beautiful 💖", "darth_ada_": "@hrice1234", "holisticabundance": "@rebecca.f_95", "chuso47": "You are so stunning!! Take care😚", "captainellie": "I was diagnosed with ulcerative colitis at the start of the year. It’s relatively mild, but not exactly fun. Really inspirational to see other ladies talk about it like this.", "elegantlyem": "I love these stunning photos of you! You look beautiful! I adore the positivity and body posi! ❤️", "rachieagi": "YES! BEAUTIFUL! SEXY! WHAT A QUEEN! OWN THAT STOMA! LIVE AS YOUR BEST SELF! I love ya Hannah, and I'm honestly so proud of you and how hard you've worked, and are continuing working, to recover.", "a.k.forsyth": "I'm so in love", "bykotney": "You've got this girl! I call my scars battle scars too, they're badass", "acloudybluesky": "I can’t believe it was three months ago when you had surgery again. Seems like yesterday. Ily so much, you’re so strong. Keep fighting and being amazing 💛💛", "funtizzle": "Wow Hannah. Been following your life journey on YouTube for years and how you've transformed from that awkward, funny, bubbly lady to an inspiration and role model for thousands of others! Keep it up, the sky is your limit 💪🏾", "matt.tahir_": "You are the strongest woman I know. And you’re ever so beautiful.", "jpayne9009": "You look good enough to eat 😍😍🤤🤤", "lynzmack30": "Looking amazing!!!🔥🔥🔥🔥🔥", "georgedaviesphotography": "Daaayyymmmm girl slay", "taliah.h": "queen", "carmen15044": "Beautiful 💙", "tim_vq": "you are an inspiration !", "michael_james_ball": "Good Lord you are beautiful.", "toni.kerr": "Such an inspiration, you are so mf strong you deserve all the recognition and happiness 💓", "lemonly101": "WE STAN", "mintfaery": "You look beautiful. Keep looking up 💙 and that quilt is gorgeous!!", "lux_perscriptorem": "Girl, I dunno what to say that might sound right, but, I'm just gonna go with my instinct and say, \"That's some brave shit\". In a totally non-patronising way. Looking good... free and deserved add-on.", "tahmorrow": "you are so gorgeous! ❤️❤️", "cheekychan_": "You are too gorge", "bayuaji_nvs": "Did someone say booking?", "sierra_yankee_delta": "Stay Strong!!!", "claudiaalcala12": "@alejandro_marquez_01", "fabulous_book_fiend": "Quite the year so far!", "rinaldigeorge": "I had a an ileostomy for 3 months and about lost my mind. You are one tough lady!", "holisticallyholly": "I love this! I immediately was drawn to your eyes! So beautiful! Thank you for showing others how we can embrace our lives and live to the fullest!", "iamlucymoon": "🌶🌶🌶", "manalibhagwat": "You inspirational soul you 🤗", "mark.allen9033": "The battle scars you have are now a reminder how strong you really are. You are looking 💅🏻and doing great. 👍👍💐", "lenanabanana": "In love with that bra!! Where is it from pulease? 🍈🍈", "j_immy_g": "Very happy that you're doing well.", "athena.mollie": "❣️", "heytheresacha": "have you seen the new @aerie model with a stoma bag? :)", "abie_rosee": "You are such a stunning and powerful woman, you should be so proud of who you are and what you’ve been through. I can speak for many when I say you inspire people everyday x", "rickymosher": "You’re beautiful", "jack3sixty": "😘😘😘", "jedi2257": "Beautiful x", "randomunknown767": "You are so beautiful😍", "laurr_en": "A beautiful inspiration 💕", "sabina_hope": "So strong 💙", "lyle.mills.35": "Lyle: Dumb question - is the new scar right over the first one? Kinda of swollen, but maybe the staples contribute to that? Still doesn't take a thing away from your natural beauty. You are an absolute joy to follow and thank you for helping us learn more about UC. Good Luck!!!!!", "urnuncle": "Beaut", "earthtoorla": "U hot tamali 🔥", "louison_dessus": "beautiful!", "yelhei04": "Be strong and have faith", "haleyannebechler": "Wear those scars proudly, you earned them. 💖💖", "lauraalicem": "You. Are. So. Gorgeous. ❤❤❤", "frostbite939": "No one rocks a stoma bag like you, Wit!", "elisetrmpnrs": "I have to admit I never heard about a stoma before I followed you, but from the little I know of it, I'm in awe at how you're handling it! This picture is beautiful 🤗", "irathient": "Absolutely beautiful!", "ecs.67": "Yaaaaaaaass!!!!!!! Babe!", "officiallyjeffgarlick": "Confident and beautiful in one stunning photo Hannah! 👍😊", "jtnug": "I admire your strength and positivity. Keep rocking, Hannah", "kackenmitmacken": "Girl you do look great and I really hope you feel that way inside too.", "abilou6": "You look amazing and you are amazing!! 💜", "ostomyturkiye": "Turkey's'm sending my greetings and love to you from the hot summer days.😙😙💪💪👋👍", "thecreativegeek": "Looking amazing @hannahwitton ❤️", "joinxthexdots": "💜", "sonyamarxdances": "This is so stunning my goodness 💕💞", "pheebs_9876": "You are so god damn gorgeous, inside and out ❤😘", "nayjay13": "Stunning x", "canadianjules_": "💓💓💓💓💓💓", "phoeb.eh": "you look angelic- good job this year Witton, what doesn't kill you makes you stronger! much love xxx", "rosie_sloan": "Fierce and inspirational 🔥❤", "amyyhampton": "Beyond stunning! 😍", "jim.beard.1701": "My Father-in-Law used to say \"it's a grand life if'n you didn't weeken\" that's translated from the original Barnsley. I've been watching your YouTube channel for a while and you've always amaze me with your positively and strength.", "estherforresterr": "Amazing. So so stunning xxx", "amidthevoid": "I’ve been dealing with pain since January, I still don’t exactly know what it is unless I have surgery (potentially endometriosis). It’s so frustrating not knowing and being in pain but so encouraging to see you keep going and being so strong, thank you 💛", "bazzrice": "You are admirable, amazing and inspirational. Hooray for Hannah! 😁", "canary_days": "Yaaas girl!!! Look at that strong woman. Beautiful! 💕😊", "w3bbd": "Looking very beautiful as always", "helenacthornton": "I remember commenting on your video when you first mentioned wanting a photoshoot, suggesting Alex! So so happy to see these beautiful photographs 😍🙌🏼", "bilbo_baggins_1997": "❤❤", "emilyjackbutler": "Great photo! I love the color palette, down to the choice of quilt. I like how it complements your skin tone.", "nfhjr": "I do not know what having this issue means, so my question is , do you need to wear the bag 24h a day or only from time to time? Can you have a time to for ex go to the beach in a swimsuit and not wear it ? Or are you in danger of \"pooping\" out ?", "hdelasalle": "I know you’re just out there living your best life but it’s such inspiration to everyone going through their own issues and body insecurities ❤️❤️❤️", "femmintuition": "So beautiful and strong! I. Love that bra! Old-fashioned looking! 😍❤️👌💗💞", "lakey89": "Beautiful! A confidence shoot sounds great but I would never look this awesome!", "sarahcourtney13": "Absolutely stunning!!!!", "honeyflickr": "hannah you are everything👸🏼", "annewmello": "@murimellow", "mosnovanatalie": "Wish you the best of luck ❤", "caitlinralphx": "This.is.everything", "smile515151": "Beautiful", "tonyr3284": "You are so beautiful😍😍😍😍😍😍", "michaeljgaffney": "@truegeordietg get her on the podcast, lad.", "irenemanero": "You're so strong!! ❤️ Love this foto!", "kevin.wg.02": "You look great !", "zohey_": "You are so so beautiful, inside and out ❤️❤️❤️", "mayuderodriguez": "You're a such inspiration to me!!", "purds96": "You are incredible and so beautiful!", "leohernandeznj": "You really are insanely gorgeous", "zhermz": "Fokin GORG HANNAH", "lorcaesar410": "@hannahwitton 😍😍😍😍", "restlesschildcz": "You made me Google stoma and thanks to you I understand this issue more and hopefully be more understanding about it in the future 💛 I wish you all the best and hope your health doesn't give you much trouble any time soon!", "jordanebunny": "♥️♥️♥️", "helenbettyann": "😍😍", "domscordel": "good luck with it all! ur wonderful tbh ✨✨", "fraudoktorseltsam": "Oh my goodness! I'm so in love with this beautiful foto! I have Crohns and have great fear, that I will have a stoma one day....", "emilyelizabethlian": "Beautiful ❤️", "robinrehmann\nVerified": "Verified", "nixmhb": "I love this and love you! You should be so proud of yourself. Looking hot 🔥🔥🔥", "sleepygoats": "❤️", "courtzmelv": "You look incredible! I hope i look as amazing as you if I end up getting my stoma. You beaut xx", "abbyjane_cotter_": "Beautiful! 😍😍", "dodie_trash": "OUR GORGEOUS HANNAH WE LOVE YOU SO MUCH KEEP DOIN WHAT UR DOIN YOU ABSOLUTE ANGEL", "natpeaston": "💛", "themajikelone": "Cute photos! And you look fantastic!", "coasterdude420": "What’s on your stomach?", "kikkigylden": "You are so awe inspiring 🙌🏻 Keep on keeping on 😉", "frankiemillard": "❤️", "of_monster": "You are a very brave person and you are an example for everyone who is struggling with health problems, but not only. You seem like a kind human being, beautiful on the inside and on the outside, who is trying to stay positive even if something bad is happening. I wish you all the best. xoxo", "hippybags": "Beautiful 🌼", "dariadsilva": "this has absolutely nothing to do with the post (but may i just say woooo, i’m so proud of you and your journey, i can imagine that it’s been so tough, but you’re so strong and it’s honestly so inspiring. you’re a strong woman and a role model for all ❤️) but i also just wanted to say that i continuously get people telling me through dms and on old photos that we look very alike - i kind of see it????", "indah_21_": "Stunning and inspiring!!!♡", "minniebecca": "Desperately want to like the picture but it's on a perfect 4000 likes... Inner turmoil!", "simonwdavis22": "#mildlyvagina", "t717mck1": "Hay sexy", "elixabexh": "You’re so so beautiful Hannah. Your journey and spirit is incredible. ❤️", "hedikamal_": "🔥🙌👌💪💪💪", "richdck": "You have a gorgeous body", "sherlockjwatson": "♡", "martinthomson2006": "You are so beautiful! You presemt your videos in such an amazing and inspirational manner :) i love how frank and upfront you are about all the so called taboo/touchy subjects!", "peach.dodie": "u are so f***ing strong and I love u for that. thank u for raising awareness of u.c because my dad has it and not many people know about it. I mentioned it in class and sadly no one knew about it :(", "cjcxx": "😍 😍 😍", "scummings91": "You look amazing! x", "dionysialemonaki": "You are so strong and have such a great outlook on everything! So inspiring..!", "arzhelenn": "Wow you look hot ! Such a warrior you are Hannah ! I hope for a good recovery 💕", "lucyheatheruk": "Yes my girllllll", "james_by_the_lake": "Kia kaha", "bamblingsofnaffy": "You’re an incredible woman Witton 💖💖💖🙌🏽🙌🏽🙌🏽", "lib.lob.z": "You are so beautiful 💖💖💖", "luisramirez2323": "Wow 😮 you’re so gorgeous 🌹🌹😍", "shil_cock": "You're so bloody lush man", "lharriannex": "You are beautiful!💖", "iantshanks": "Beautiful Hannah!!! Hope you are doing okay 💜😉😘💕❤️💙😍💗 @hannahwitton", "mad__have": "No matter what happens, your still gonna be beautiful and no scar it gonna change that!❤ @hannahwitton", "kylaasutherland": "You look amazing. I would love to be able to do something like this.", "chameleongarden": "💜", "miss_emma_laverton": "Still beautiful as always though 😘", "mark_knight_mi": "The scars truly enhance your beauty. This shot, and the others you've shared, are awesome! ♥️", "kelseyhaleymedia": "Beautiful! You are a warrior!", "zoeloufox": "Hannah you are remarkable 💞 so inspired by your life and your story, so much courage xxx", "youseesaf": "Amazing photo!", "gibanetet": "😍😍", "maevereekie": "Gorgeous girl❤️", "donaldjohnrobinson": "You look amazing Hannah", "g_smith03": "You are such an inspiration to me with your raw strength, keep going! 💕💕💕", "loopediwoop": "you look incredible 😍😍😍", "dinnerbell_kat": "I love this post, and I really relate to what you’ve been through. You’re very inspirational. 💙"}