{"nonsenselliot": "the bloody chamber by angela carter!!", "l.oriolus": "Jane Eyre 💛🖤🌿", "alxchipka": "I just finished this star wars novel called Thrawn and I'm going to finally read To Kill a Mockingbird now", "goodwinter19": "1984!! 🤯🤯🤯", "jlorenz05": "Lavinia by Ursula K. Le Guin", "hannavanrooijen": "I'm reading the well of ascension by Brandon Sanderson. It's the second mistborn book and I'm loving it!", "scarlotcharlot": "Autobiography of a female body, by Sara Pascoe.", "mabel.nic": "\" @hazaraduh likes this\" I'm sorry since when u a hannah witton fan 😂", "sammmreid": "To All The Boys I’ve Loved Before 😘", "vulva.ink": "Future Home of the Living God. Reading of lot of gender dystopias this year I guess 😍", "mijamysie": "Spiritual Midwifery by Ina May Gaskin 👍🏼", "larky_01": "The art of being normal by Lisa Williamson", "the_happywarrior": "The Nightingale by Kristin Hannah.🤗", "bamblingsofnaffy": "Wild Embers by Nikita Gill :) Just finished reading This is going to hurt by Adam Kay I WOULD HIGHLY RECOMMEND BOTH (Yes caps was necessary ;))", "notlikewater": "Artifacts and Allegiances: How Museums Put the Nation and the World on Display by Peggy Levitt and Harry Potter and the Goblet of Fire 🔥", "leanne_k00": "Glass Sword", "mondlichtaenzerin": "Call me by your name ❤️", "awalker_x": "I’m reading Reasons to stay alive by Matt Haig and I’m also reading Alice in Wonderland!", "kevinnewton": "Tiny Beautiful Things by Cheryl Strayed", "e.mileekate": "Everything, Everything", "custardycurrie": "Gulag Archipelago, keeps my problems in perspective", "lulubrumfitt": "Alias Grace", "justme_georgina": "‘The Happy Brain’ by Dean Burnett it’s his second book after ‘The Idiot Brain’. Thoroughly enjoying it so far!", "lizzie.rosee": "just started a tale of two cities", "_carxn": "more happy than not by adam silvera", "bigethanmcollier": "Natives: Race and Class in the Ruins of Empire by Akala, deffo one of my favourite book of the year so far.", "sophrogers_": "finishing On The Other Side before i start When The Curtain Falls by @carriehopefletcher", "ashleighcanflyy": "Clean by Juno Dawson and The Choice by Edith Eger ☺️", "emmyvollaard": "The Passage by Justin Cronin, Body Positive Power by Megan Jayne Crabbe and ‘Filosofie van de waanzin’ (philosophy of madness) by Wouter Kusters", "_ellenberry99": "I’m just about to finish The Catcher in the Rye but I’m so reluctant to pick it up because I don’t want it to end", "sarahlouise_slc": "The red notebook", "amelia_is_me": "Running girl", "michelemariafasti": "Mtrain by patti smith 💜", "katie_i242": "Hot milk by Deborah levy. It's a strange book. Always feels a bit dreamlike in how surroundings and characters are described", "camille_lifebook": "Finished way past my bedtime \"P.S I Still Love You\" by Jenny Han and now it's the next morning and I'm a tired mess x)", "noxbellatricis": "I just finishes Origin by Dan Brown and absolutely loved it! Now I'll have to find a new book to obsess over 😅😍"}