{"kaitlyn_roylance": "I got the depo shot. It was awful. I gained close to 20lbs. The shot wrecked my hormones. I had terrible acne and it dried out my uterus to the point where it was cracking. I had to get put on estrogen to make my levels normal and try to regulate my uterus again. NEVER AGAIN", "oopswrongemily": "Dear my pill, I already take two packets in a row to put off my period just because of how heavy they are and I hate when I finish the second pill packet because I know how much my hormones are gonna do me dirty and make me an uncontrollable ball of sadness for the next week", "shannon.baines02": "Dear my pill, thank you for making sure I’m safe. Thank you for allowing me to know when my period is going to arrive, I know I haven’t used you long but you are a treasure. You are not like my first pill which caused me serious sickness which made me lose 6 pounds very rapidly! My only note is: please stop making me so moody?!", "lamanc": "Dear IUD, You are the best thing that could have happened to me. My contraceptive journey begin with doctors unwilling to put you in me and unhelpful answering my questions. The pill was not a good friend to me, I became depressed, completely lost my libido and still feel the reverb of negative affects today! But you helped me reclaim my body, go hormone free and begin to feel like myself once again. I have never felt so empowered by my birth control and the choice to take care of my body the way I needed. Thanks for giving me that Paraguard (I’ll even forgive you for the cramps). 😘", "underscoreannie": "dear all five contraceptive pills I took, You tried. You really did. I appreciate the effort but you’re just not for me, and that’s okay.", "racheljmoses": "Dear Microgynon and Implant. After a terrifying and sad experience at the age of 18, I want to thank you firstly for giving me that extra protection for the last 16 years at not having to worry about having another person to care for..... I might now finally be ready, which is why I parted company with the pill this summer. Implant, you were a pain in the backside in keeping me regular for 9 years (I should have had shares in tampax), but it wasn't ever as painful as before you and I knew I was safe. Pill, you were amazing over 6 or 7 years and though I occasionally forgot you, it was never an issue with hubby's waning sex drive... (arrghhh). I'm also lucky that neither of you affected my mental health.... I will just always be a hormonal mess no matter what I take or don't take. 😂 😂 😂 Periods, thank you for behaving fairly well since you've had no contraception for the past 3 months.", "ass_backwardss": "Dear contraception establishment, why is it that you do not feel the need to explain hormone sensitivity to your clients? After taking you for a year I felt nothing but nauseous, constantly hot and unable to experience any emotion. I was never told this could be possible. You market yourself as a cure-all, an infallible solution for all who need you. You have cornered the market, but you are not the only option, and you must warn us of your risks.", "meghanelaine11": "Dear contraception pills, I really really wanted to like you, but you made me feel terrible. I feel like you need to work on yourself a little bit before we try again.", "mackalainesrose": "Dear IUD, Thank you for making sure I don’t get pregnant every month, and THANKYOU for allowing my body to have so many whack hormonal changes to the point where I no longer want to leave the house or have the confidence to even wear makeup as it only makes my face look weirder. Love, Mac", "esther.tigrounette": "Dear trinordiol, you've been a great helper with my PMS and irregular periods. You're not perfect or maybe just not perfect for me but you're enough. You've also helped me with first ever relationship. Thank you.", "rhixd": "Dear condoms, Thank-you for doing your job. You’ve saved me from having to mess up my regular periods and healthy skin with the pill, or any other form of contraception. You’ve always been reliable, and I haven’t had a single scare in 4 years. Here’s to many more years of successful avoidance of pregnancy! Love from Rhianna ❤️", "meaganspellman": "Dear 6th Grade Sex Ed, why didn't you properly teach us about our menstrual cycles. It may seem obvious but I didn't know our ovulated egg only lives for 24hrs, that our body temperature and our discharge could let us know when we were fertile. Thanks to a thermometer and tracking my cycle in depth I've been able to have fulfilling unprotected sex on certain days of my cycle and not getting pregnant for the past 3 years. Kind regards, Someone who finally realized they don't need synthetic hormones or condoms to not get pregnant.", "_stressed.potato.recovers": "Dear anorexia, you were a very effective contraceptive and period stopper, but I’m over you now. You can easily be replaced by nicer pills 🙃", "discoprincess1": "I couldn’t find the page on your website!", "caitlinxcostello": "Dear Pill, you were prescribed to help me with my god awful periods. Some days I couldn’t get out of bed or even walk. I would cry in pain. You gave me some sweet relief. Being 15 I keep thinking you are the answer. But unfortunately you had a dark side. I tried to commit suicide due to depression from the pill. I no longer use it but I wish I could. Thank you @hannahwitton for sharing you’re story so that we feel brave enough to share ours 💕", "izzie.kater": "Dear Desogesterol, thank you for changing my life in the best way. No periods, no cramping, no back ache, no mood swings, no pregnancy... Despite at the beginning, forgetting you once or twice, I have had the best luck with you. I've only ever had one period while with you and thst was only break through bleeding so am so happy about that. And you were the first pill I tried so I feel so lucky! The only complaint I have about you is having to take you in the same three hour window every day... which caused some problems when I changed time zones and went from London to Sydney, Australia 😂. and then because I wasn't taking it in the same three hour window, you made me bleed and cramp straight away... on the plane when I didn't have anything; no tampons, pads or ANYTHING😭😭 So what I've learnt is don't miss that window or you'll make me suffer the consequences literally half an hour later 😅😭 but other than that you've been amazing and you've changed my life 😍 thank you for everything ❤️❤️ love Izzie xx", "sarahd98": "dear cerazette, i’ve been taking you for almost 7 months now and for 4 of those i’ve been bleeding almost non-stop. at the moment it seems to be coming to an end, which would make me endlessly happy because progesterone-only is the pill i feel safest using. pls give my poor bleeding body a break and function normally thank u peace out", "thewickedwitchisdead_": "Dear mini pill (digesterol) you sucked. you didn't work one bit to stop anything... in fact I got to the point where my period wouldn't stop! thanks for getting in the way of my life and knocking my confidence. But on the other hand you did do wonders for my skin. still doesn't out way all of the crap.", "hearmebore": "Dear POPs, thanks for the memories of bleeding so much I thought I was haemorrhaging and had to be given coagulants to stop the bleeding and a transfusion once it was all over. I'll never miss you. Ever.", "sagaurora": "Dear pill, I’d just like to say hi since I’ve only been on you for four days. I’m so grateful you’re oestrogen-free, considering I most probably carry that gene which makes my blood coagulate more easily. But to be honest, I’m more terrified than anything else. I’m terrified you will make me depressed - and I hate to admit it, but I’m also scared you will make my face look like salami. But I believe in you Gestrina. I hope this is the beginning of a long healthy relationship in which I will experience a lot of nice sex. Let’s cross our mutual fingers🤞🏼", "itstaylorprince": "Dear Yasmin, why did you let me get pregnant in my final semester of university when I so religiously took you for three years? I know you aren't 100% effective in every situation, but why now? Why did you give up on me, six months away from the finish line? I would also love to know if you, little contraceptive pill, affected my hormones and are the reason my egg split and gave me identical twins. It was a cute trick, but I need answers.", "mitchel_thevq": "Dear Microgynon 30  My vagina has never been drier. My cramping has never been worse and my headaches have actually peaked. I hate you. You worked so well for so long and then stabbed me in the guts", "lacrxy": "Dear copper IUD although it was a shit show organising the appointment your insertion was blissful (probably due to the gas that was on offer), thanks for balancing out the spotting without cramps", "stefaniajw": "Dear all hormonal contraceptives, I've only had trouble while putting you into my body. Nausea, extreme fatigue, extreme breast tenderness, vitamin deficiencies, depression, anxiety, panic attacks, moodiness, changes in my personality, bursting into crying without a reason and not feeling like myself anymore in general. As soon as I stopped and went for dieting, supplementing and a better lifestyle I knew my illness could be treated with something other than hormones for a lifetime. I got my life back. Thanks but no thanks. Love, Stefania 😘", "nyssa_blue": "I used to take the pill, one day I was at a body painting job as that's how I made a crust at the time, and started getting a horrendous migraine. My dad kindly picked me up and I wanted to go to bed but he said I'd started to slur my words and slump over in the car (I have no memory of that) as I staggered into the emergency section, they fobbed me off to the gp section where I waited, still in agony. 2 hour later, after passing out on one of their beds, I was seen to. the doctor strictly advised me to avoid taking contraception from then on (emphasised I was at a high risk of having a stroke) and I haven't taken it since. It has also trashed my metabolism and I'm the biggest I've ever been even though I've had minimal changes to my diet over the years. I'm glad it works for some, but it ruined my body.", "rhiane.xo": "Dear Implant. It’s been three years and what a wonderful three years it’s been! Sure you’ve made me put on a few pounds but you also stopped my period so I know which one I prefer! I hope to continue with you for as long as possible! Love from Rhiane x", "alec_wimmer": "Dear Testosterone. Thank you for saving my life. Thank you for stopping my periods that made me suicidal. Thank you for giving my the ability to rebuild my atrophied muscles from years of being so so limited in my mobility. Thank you for the facial scruff (though i could use a bit more *nudge nudge, wink wink* Thank you for overriding my estrogen-progesterone dominant hormone cycle to reduce the hypermobility in my Ehlers-Danlos-y joints. Just, thank you. Two years of Testosterone and I’m literally the happiest and healthiest I’ve been since i was 2 years old. Without you I wouldn’t be here.", "lemonsdrops": "Dear Nexplanon. Thanks bud! The pill wasn’t working for me and causing more and more migraines than it was worth. I love not having a period, and not having to plan my life around a gross bloody mess. Ps. I’m also a super huge fan of how I can feel you in my arm, it’s very interesting, and a fun way to creep people out.", "newfruwhodis": "Dear body, thank you for being a good sport and generally not giving me much trouble with periods nor contraception. You did fine 5 years on the pill and after a year now on the hormonal coil, thank you for making my experience so smooth and unproblematic. I knew you were going to be fine if I get the IUD put in my lunchbreak and go straight back to work and it will also be fine in the long run with no side effects at all. Contraception doesn't have to be complicated <3", "abigailbrigitteanna": "dear desogestrel, thanks for looking after me for all these years. sorry I keep forgetting about you, even though I’m supposed to take you every day in order for you to work. and I’m especially sorry about that 3 month period when I didn’t renew my prescription and abandoned you. thank you for being the reason I can control my body and sparing me from extreme acne during puberty. and thank you for looking after all the hundreds of other people whose periods are too strong to bear. I’ll fight for you and everyone’s right to have access for you, just as you’ve fought for me all these years. ❤️", "mermaidreyy": "I had to start taking the pill because I have too much testosterone in my body for a girl (yes I identify as a girl, just that you know that 😅) and I finally had something like a regular period!! It made my acne a little bit better. After a year after starting I met my boyfriend and another year later we started to get intimate. My whole family is very religious so if I wouldn't had to take the pill because of medical reasons (it balances my hormones) I wouldn't been able to use it as a contraception. Because I wouldn't relay only on condoms as a contraception method. Talking about the site effects of it, I didn't had any of the major ones. I (before getting intimate with my boyfriend) went of and on the pill becaus my mother wanted it and I notices that when I started to take it again I had like a whole month of spotting, but that went away after I got my period again. Regarding mood swings: one time when I picked up my pill at the pharmacy the guy gave me a pill from another company and said \"it doesn't matter it's the same ingredients\" but it did. It gave me mood swings so I talked to my doctor and now on the prescription it says that only can get the pill from that one company. After I went on that again I noticed that I still had mood swings(not as badly as before) but that went away after a while. So my experience so far was pretty positive!", "xcaitlincook": "Dear implant, You were amazing for the first three years but when I had to get you replaced, oh wow did you not agree with me. Constant nausea and anxiety but the WORST was the decrease in my sex drive. Before I was happy with my sex drive and it was quite high but you made it at an all time low!! But now that you’re out and I have to take a pill everyday, I do miss you", "chocolatewestie": "I had the injection for a few years, my mood swings after it was scary! My husband use to hide!! And I put weight on! On my 2nd Marina coil now, the pain going in. My god! It was like having my child again. But afterwards it’s been perfect! No periods for 7yrs!! No mood swings, no spotty face! Yay!!!", "saralouis3": "Dear Rigevidon, my most recent pill pal. You helped me control my horrific periods and avoid any nasty holiday bleeds. I’m sad to say goodbye to you, but now I start a new journey with the Mirena coil. Hopefully it was worth almost passing out from low blood pressure, we shall see. Sara x", "pluto_and_stella": "My experience with the mini pill(cerazette) was the absolute worst. Bled every five days heavily, they usually lasted anywhere from 5 days to 7, and had an 8 day+ bleed (heavy) it only stopped because I was given norethistrone as an emergency prescription. I'm back onto the combined pill, taking it for 4 months at a time then having a 5 day break for a withdrawal bleed. My experiences have been horrific, and personally I wouldn't consider taking hormonal contraceptives as *just* as a contraceptive method, because the unnecessary bodily changes are a pain in the arse and completely avoidable. Though I understand others have great experiences, I just would not recommend going through that if possible.", "clicliiii": "Dear Pill, We’ve known each other since I’m 14 and I guess you could say we’ve had an on and off relationship because I went on and off you several times cause of longer hospital visits and immobility. I was lucky that I never had the tumultuous time in the transition but to be honest I can’t even remember what I was like without you, which partly terrifies me. Its hard to say if my emotions come fro. You or when I went though puberty or in general cause I’ve had a quite the last few years. However I’ve never been depressed, moody or had any other nasty side effects but Its hard not to think about that I don’t know if I’d be happier or more stable or just different in general. Love Clí", "too_fab_4_you_": "Dear marina coil, Now I know you can be a tad controversial, and I know that you don’t agree with everybody. But thank you so much for allowing me not to have a baby right now! You have dramatically helped my PCOS I no longer have extremely painful and heavy period thanks to you, yes we have had some scary times, like that time I thought you went missing, or the time I shed my whole uterine lining at once and the clot came out about the size of an orange, but we have had fun, and my self along with my sexual partners love you loads xox Thanks for all the good times! P.s. if you wouldn’t mind helping me produce less discharge that would be grand, but it’s a small price to pay bby 💕💕💕", "annie.mac410": "Dear my gynaecologist, Yes, I am having sex. No, I'm not using contraception. No, I've never taken the morning after pill or had an unwanted pregnancy.... It would be so wonderful if you realised that sex isn't only the penetration of a penis in a vagina. I suppose not, though, so I'll spell it out for you (again). I'm a lesbian. No, its fine, you don't have to apologise. I'm over the awkwardness - this has happened often enough before. It would be nice if you remembered for next time, or the next gay girl that walks in here though. Sincerely, a lesbian who's never really completely out of the closet.", "luizelicetane": "You remind me of Hermione Granger!", "thatfloridagirlnow": "Dear Mirena: You were supposed to lessen the severity of my period symptoms. Instead, I wore a pad for 8 months while my body “got used to you” when it should’ve happened in 4-6 months. Although you finally situated yourself, you clearly didn’t want to be there because 3yrs later you nearly almost killed me trying to leave! A full month of excruciating pain as the doctor tried to figure out where you were so you could be removed without causing any damage. To the previous DO who last prescribed me pills: You should probably take a sensitivity course and remember that when a patient is telling how how a pill is making her feel you should probably listen instead of handing her a refill of the same pill. I cried for 4 months straight (no normal), I had hot flashes (I was 25 at the time, as not normal), my boobs hurt and looked fake (yay for engorged boobs that look fake so you don’t have to pay for a boob job), and I was constantly trying to make sure I wasn’t pregnant. But there was nothing wrong with me 🤔", "inkaylaseyes": "Dear IUD, you were amazing, younwould have been my forever contraception if you had helped with the endometriosis... I miss you, kayla", "l_a_u_r_a__m_o_n_a_g_h_a_n": "Dear microlite, thank you for not causing me weight gain and stabilizing my periods but the sore boobs, breakouts, cramps and hormonal fluctuations are a bit much. Unlike the mini pill ,that gave me a 3 month long period, you've done me well I suppose xoxo", "rinofthemill": "Dear contraception, I love you and want you back, but why can't I find the right one? Cerazette, you were almost perfect for me, but my depressive episodes meant I could never take you reliably. Injection (I forget your name), you were meant to be my easy cerazette, and you gave me the worst three months of my entire life, and though you are long gone, I fear some of your side affects are just never going to go away (and why did some hormones give me sensory sensitivity, for christs sake?). Abortion, you seemed to help for a couple months, I've been told by many people 'your period will be less painful once you've had a child!' and you almost made me believe them. But the pain came back, the pms came back, the dysphoria...never went away but lets say for poetry it came back, it all came back. Mirena, I want you, but even aside from the horror stories I've heard, I just can't get a doctor to listen to me right now. It'll be even harder to get them to listen when I go back and ask for a hysterectomy.", "becca.gracey": "I had to take birth control when I was 16 because of the acne medication I was on. It cause me to gain 10 pounds in a month, giving me stretch marks on my bum and my inner thighs. I still have them to this day and I still haven’t gotten used to them. I wish my doctor had told me the side effects of the birth control so I could have found one that wouldn’t cause such drastic changes.", "beckibc96": "Dear Coil, if you could decide where you want to be please? Moving around in my uterus trying to settle down is quite uncomfortable. My sex life has stopped and my other half HATES you! Please calm down before I take you out and risk having a baby!!!", "emmathelionheart": "Dear hormonal birth control, you are truly not for everyone. I spent just over two years on two different low dose contraceptive pills (Tricyclen Lo and Yaz respectively). I am not sexually active because I have vaginismis and vulvodynia, but my doctor suggested birth control to treat my severe PMS. It treated my PMS, all right, but also caused me to sink into a deep depression. By the end, I was considering breaking up with my partner of 6 years, and my anxiety had spiralled out of control. Within a MONTH of choosing to come off the pill, I felt more like myself again, and as if someone had snapped their fingers, I am more in love with my partner then ever. Now three months off, I'm truly happier than I have felt in years. A reminder to myself: things do get better. Listen to your gut, and if something doesn't feel right, do something.", "xthelifeofgab": "Dear implant, Thank you for destroying my perfect, clock-work like cycle and replacing it with never ending periods and worsened mental health. I wish I had listen to the girl in the waiting room, I wish I had pushed harder when I was turned away after begging to have it removed numerous times. “Think about your options.” “Are you sure?” “Here’s a leaflet, take this away any come back if this is still what you want.” I wish I had never met you. I’m free of you now, but I’m left with a cycle that is unknown to me. It arrives when it likes and won’t tell me when it will be leaving. If it wasn’t for it being a sign of my fertility I would ask to get rid of it all together. I’m working hard to find something that will fix the mess that you have made. I’m glad that you’re not a part of me anymore. No thanks at all, a pissed off 2 year old!", "maddelpop": "Dear Implanon, no thanks for the six week period but that led me to a great doctor and I guess you’re still convenient so we can work with it.", "kamiechester": "To the condom I put on my finger the first time my boyfriend asked me to finger him, The experience was new and daunting because I was afraid of hurting him, but you comforted me. At least I didn’t have to worry about my nails hurting him. I wasn’t sure how fast to go, so I don’t know how much you really helped him. However, you were like a small little blankie for me. Thanks condom, Kamie", "missbruja": "Dear Mom, thank you for taking me to get the pill when I was fifteen. You saw how brutal my periods were and wanted to help ease my pain. You also saw how curious I was about sex and though you were slightly concerned about how young I was, you made sure I had the means to be safe. It couldn’t have been easy for you, having grown up Catholic and us living in a conservative, religious town but nevertheless, you educated me and gave me access to protection and a new way to alleviate my period symptoms. For that I thank you. -Mad", "emma_vanmechelen": "Dear pill, thank you so much for doing what I wanted you to do: making my acne go away and making sure I'm not getting pregnant. Also thank you for not giving me mood swings, added weight or random bleeding. I hope you keep working for me for a long time. Lots of love, Emma", "barnard.phototography": "Dear Cerelle...look, we have a bit of a love hate relationship - thank you for stopping my periods, but did I really have to start taking two tablets to make it happen? Anyway, thanks a bunch. Love, Becca", "keziakaystaines": "Dear Pill, Thank you for being the kindest on my body of all the contraception I have tried but could you please just chill out on the hormones a little bit...buoy stress nout some times! Whilst I'm here tell PCOS that I would like some money back from all of the pregnancy tests I have had to take because it keeps stopping my period coming. Rude. Anyway keep being coolni suppose...", "sarahcourtney13": "Dear condom, you had ONE job. ONE. To stay on my partners penis for the duration of sex and to prevent me from getting pregnant. But no, you decide to slip of INSIDE ME. So far up that I spent 5 mins trying to dig you out. It was horrendous. I could have gotten pregnant or worse. In a panicked state, I had to rush to my nearest pharmacy to get the morning after pill. If it wasn't for that trusty pill I might have a 5 year old child right now. But that's not all. U didn't just torture me once. No no. You did it TWICE. A couple of months later when I was with a new partner. THE EXACT SAME THING HAPPENED. So I had to pop along to the pharmacy again and you know What? IT WAS THE EXACT SAME PHARMACIST FROM BEFORE WHO REMEBERED WHO I WAS!! She must have thought of me as so irresponsible and careless. But I took the right proportions, you just failed me. So please, I use you for a reason. Stop being lazy and do your job. Thanks! Sarah. Xoxoxo", "veronika_vejcikova": "I know my hormones influence my mood. I've made a concious decision to cooporate with those changes to my benefit and I'm starting to like it. I listen to my body, I understand my cycle better and better and its worth it. Therefore no hormonal contraception for me I think ever.", "phoebzy": "Dear Jaydess, the doctors told me periods would be less painful with you. Instead they got worse. I'm almost done with You, you'll be taken out in January. I will kind of miss you because I never had to worry about anything. I will not miss you because you hurt me a lot during these last 3 years.", "laura_a_menzies": "Dear implant, thanks for the 11 years of protection, not only from pregnancy but also from period pains. Although having you taken out and replaced every three years was traumatic as you always seem to become far too comfortably nestled in my arm. But that seems like a breeze in comparison to the monthly period pains that I wasn’t even aware you were saving me from. The 5 months I spent trying to conceive this little baby came as a bit of a shock in terms of period pains. As soon as our little one is born, I want you back! Yours faithfully, Laura x", "unseeliewitch": "Dear doctor who when prescribing me the pill did not listen to anything I was saying,  when i was describing the stabbing pain i get with my periods that’s made me throw up and a whole load of other fun stuff you ignored me and told me you were going to prescribe me the pill. i told you i had a past with eating disorders and body dysmorphia and was worried about gaining weight being on the pill. you told me to just ‘be careful i don’t eat that much’. that’s literally how it all started in the first place, but noted. i didn’t stand up for myself at that appointment and thought you knew best but the one month i spent on the pill is to this date one of the worst times of my life. rigevidon made me bloated all the time, i hated my body, my depression worsened and i couldn’t leave the house even to go to the corner store without having a massive panic attack. i cried every day for a month and was paranoid i would die every time i went to sleep or every time i left my bed. i couldn’t bear it anymore after the first month. it was not a fun time, not doing that again ✌️", "ambroakleighxx": "Dear body, I'm sorry that you have to suffer with PCOS, I'm sorry that the pill didn't work because of the lactose in it. I hope the contraceptive patch works to bring back your period and help with the INSANE hormones. I'm sorry the doctors didn't help until now and that it'll be harder to have babies. Praying that the patch helps 😊", "slutbag8000": "Dear iud, You gave me so much freedom, maybe a lil too much 🙃 life without pads or babies sure is a good one", "lysswild": "Dear body, you may not count as contraception but you are my birth control. You are cyclical and consistent enough that I know I can trust you. Around the same time each month you make me all extra sexy - clear skin, perky boobs, outrageous libido. This is when I feel a tiny egg pop out of its follicle hoping to meet some sperm and it's my job to make sure that doesn't happen! 😈 48 hours later my little egg passes away and I'm no longer fertile (at least up until my next period). So thanks body for teaching me your ways and keeping things easy, consistent, and natural for me. I've been relying on you this way for over a decade.", "50shadesofwilsongray": "Dear Mirena IUS....it's not you, it's me. I think you're great. My body just couldn't stop trying to push you out with cramping until it succeeded. I still have you in a little plastic bag in my cupboard. I forgive you, even though you hurt me. I'm now back with my ex - the Levlen ED pill who treated me better than I realised.", "bunnymoonstone": "Dear Pill, it never worked out between us and I'm glad. You gave me migraines, I piled on so much weight while I was taking you because all I craved and wanted was junk food. I've been hormone free for 5 years and I'm not going back unless you change your ways💁‍♀️", "taylor.jessca": "Dear hormonal contraception, I regret my time spent with you these last 6 months. You have made my life hell. Since our break up I have had more happiness in my life yet today I still am experiencing a panic attack and unplanned bleeding. My hope for the future is to put our relationship in the past so I can return to my old life. Condoms really are my most reliable friend.", "damntessa": "Dear marina coil, I'm sad we didn't work out. About two years ago i tried going off hormonal contraception and i had heard a lot about the coil, mostly good things so after thinking about it i decided to take a chance and got it done. The procedure was alright, but I didnt expect it to be a walk in the park anyway. For my first check-up the doctor told me the coil had moved and I would have to try again with another one, that was bigger. Luckily it was free of charge. When I got the second coil inserted it didnt hurt at all, which i was super glad about. After that tho, my period got really strong even tho I was used to a medium flow. At the next check-up my doc then told me the coil had moved again and once again i had to get it taken out. They suggested I could try another type of coil but it might be possible that my uterus just rejects the object inside me and thats why it moved both times, so i decided against it. I really wanted the coil to work because hormonal contraception is the only option now since i dont like using condoms in the long run. I was also horrified at the possibility, that since the coil must have moved at some point in the six months between check ups, that i could have gotten pregnant, could have had a miscarriage and the likes..", "lucy.stuartt": "Dear Levelen ED, you are damn reliable. You’ve got my back, this may be due to the fact that I take you at the exact same time every day religiously! I praise your anti-baby skills and so does my boyfriend!! Apart form the rocky spotty start, you’ve been pretty consistent. I hope this friendship continues to go well, love Lucy x", "_maureenbean_": "Dear Seasonique, You were my first relationship with oral contraceptive. You came to me in a strange circumstance. At 18, for a number of reasons, I moved away from home and into my best friend's house. Her mother said that because I was sexually active I needed to be on an oral contraception. And that is how you arrived in my life. Although I welcomed you with open arms, you treated me horribly. It was not your fault; I did not go through a proper consultation before taking you. You caused me to gain weight and made my mental health so bad I was contemplating ending my life. I had to break up with you in secret. Thankfully I am older and wiser and I now know that I have PCOS and I personally do not react well to taking an oral contraceptive. I hope that those that choose to use you have been properly consulted. I hope that others experience success in any method they choose.", "hollycharlottem": "Dear Levlen, Who knew I didn’t have to put up with 10 day long periods?? I just didn’t want to have to consider which loo I’d have to pay for next whilst traipsing across Europe, no one had ever told me about the cheery side effect of a saying goodbye to a few days of bleeding. My friend and I discuss you fondly, her with a few notches in her belt of experiences with contraceptives and me being a one pill only kind of girl. You’re a bud, a pal, a dependable acquaintance. I see you every day at 5 o’clock (ok so mostly at 5.. we’re working on it) and only dread your sugary sweet coating that sticks to the back of my throat sometimes. I think you and I are going to go the distance, please stay loyal to me like I plan on doing with you. Sincerely, a period skipper", "a_modern__myth": "Dear ultra thin extra sensitive condoms, me and my gf at 18 bought you with the hopes of a fun sexual experience, which admittedly we did have, which was promptly ruined upon realizing just how easily they break... 😦 thank God she had a morning after pill but still", "jesscalutz": "Dear Alesse 28, thank you for making my periods regular. I struggled for years with a horribly irregular cycle and other pills just couldn't regulate it. As much as I love you for my now light and regular periods, can we please talk about the mood swings?!? I was never particularly moody when I was having my period before, but I sure am now. For 5 days each month I am an emotional mess. You treat me so well in every other way, Alesse 28. So why the mood swings? Why? - Sincerely Jessica", "mle_emily": "Dear IUD, I love you. You've changed my life for the better in so many ways. With years of struggling with oral contraceptives & the rod and expericing absolutely awful side effects from the hormones, I'm so grateful to have finally found you. While having the contraceptive rod in, I attempted suicide. I already have mental health issues and the high level of hormones just exaggerated this. It's upsetting that we aren't taught about you in school, or in the media, or even when I was in the hospital telling them that I thought the hormones in the rod may have had something to do with my depression. It's such a safe, cost effective easily reversible form of contraception, without all the nasty side effects! Here in Australia, you're offered for free to people who are needing/wanting to get an abortion as an easy way to prevent people from ending up in the same situation in the future. You're the bomb, IUD! Lots of love, Emily! Xx", "wandae97": "Dear Cerazette, you were not for me. You gave me endless bleeding, exhaustion and I was so moody during our time together. But you were there when I needed you the most. Thank you. Dear Gynefix: you are the answer to my problems. Rock on baby! Love, Wanda", "chloless_": "I literally sat in my doctors today for over an hour in an attempt to talk to someone, yet again, about my contraception. It's really interesting to hear everyone else's experiences and to know that I'm not the only one who experiences horrible side effects from using contraceptives! Also very envious of those who have found their perfect match x", "freyarosetanner": "Dear Uterus,  Look, I know since day one my Muma has taught me to respect our cycle and all, but I have tried everything and I don’t want to be in pain anymore.  I’m sorry to have to shut you down. Really I am. I know in my blood it doesn’t feel right. But I just can’t run the risk of making a baby again. Abortion is not fun, not matter how legal. I’m blessed to be fertile, but cursed by your persistence. Now you copper coil, you can wait till after I have babies (apparently you are meant to be better then?!) But you have caused so much suffering I don’t want to talk to you for a long time. I had so much hope in you. I wanted you. I’ve been let down by you. You failed me, I failed you. Mirena, are you the one for me? Will you sit silently protecting me? Or Jaydess? You’re apparently smaller and more discrete. Will you be the one to set me free? The hopeful, ever searching one, Freya x", "louisareay": "Dear Loette, We tried, but some things just aren’t meant to be. I thought because you’re smaller, you’d be gentler to both my body and mind, but as has been proven over & over again, size really doesn’t matter. I’m sorry to have left you lying by my bedside, but then again, perhaps you should be sorry for holding me back - my happiness, my periods, my libido... Yes, I know rubber is a little more inconvenient, but I’m willing to sacrifice convenience for the sake of feeling myself again. We had an alright thing for a while, but I’ve decided I’m worth more than “alright”. X", "glitternal": "Dear Mirena, Having you inserted was the most painful experience of my life and I will never forget that! But you give me five good years of protection and no periods so I guess it’s a fair trade. Occasionally, I feel you stabbing my insides a lil, and you’ve given me a bit of post coital bleeding, but all in all, I think we suit each other nicely ☺️", "wrenegadesmom": "Oh hey there Tricyclen Lo, thanks for shutting down my baby making factory. I could have done without the three weeks of bleeding when we first got reacquainted, but I’ll forgive you since I’m pretty much back to normal now. My acne is better, my moods are pretty level, but my boobs are super tender, which is kinda mean. Cheers for keeping me sane, though.", "rackiepops": "Dear implant, I don’t understand you. I went 256 days with no bleeding after being inserted but have been bleeding 36 out of the last 2 months, why now? What triggered you? Why are my cycles now irregular? 10-15 days for a cycle and now 17 days blood free. Will this last? I love you and hate you, I love not having to take that pill that would make me gag but, I hate the unknown. Will I bleed today? Tomorrow? In a weeks time? Will you disappear for another 256 days? With confusion, Rachael", "mslivvyj": "Dear (whatever my birth control is called I don’t pay that much attention), Now that we’re finally getting to know and understand each other, thank you for regulating my periods. It sucked not knowing when one would show up and knowing that my body is responding well enough to you that I’ll know when my period is going to happen is great. I’m really glad I found a doctor who could properly diagnose and treat my PCOS and told me very plainly why she was prescribing you. Thanks for doing your job, keep up the good work and could we lighten up on the mood swings and weight gain? Thanks, Liv", "bamblingsofnaffy": "I was 13, maybe 14. was told I would be taking a pill. A pill they called Estrogen. To regulate my hormones they said. What they didn’t tell me was that it was a contraception. Looking back they probably should have. Maybe they presumed as a Muslim girl I didn’t need to know. In a way they were right. In a way they were wrong. As a woman you need to know all the facts before putting anything in your body.", "sabrina_haake": "Dear pil and condom, I tried with only one of you but no matter who I chose it made me feel uneasy . Pill I have messed up taking you to often in the last 1,5 years to trust us on our own . But even looking at the statistics of you condom doing your job makes me feel uneasy ,even though you have never failed me . I think I can only trust you together for now ,because if one of us fails one of you can always be the back up. So I think we are going to stay like this for a while ,even though both of you are not perfect .", "justhow_itis": "Dear Lenest, we only just met and boy am I excited and hopeful for you to solve my pains. However, I am also so anxious about what else you might do to me. Please be so kind to my body and give me time to get to know you, I'm sure we can get along just fine.", "irinifoun": "Dear greek gynecologists, I have PCOS and have had irregular period since the beginning (10 years). I started having sex when I was 15 and went to the doctor six months later to be responsible and informed. My mom on the other hand thought I was way too young and got me a pregnancy test everytime my period was a day late. This has caused me to have anxiety around it in my adult life. Going to the doctors here in Greece they all tell me the same thing. Your only option is the pill or condoms. That's it. I've had high ggt levels that prohibited me getting the pill prescribed. No doctor has taken my anxiety seriously. I've been going to the gp for 7 years. I am in a serious heterosexual relationship for 7 years condoms get boring. They all tell me to just relax or to go to a therapist. I just want to know what my body is doing. And when my cycle is around 30-40 days long it consumes my every waking hour of mine. Was that a period symptom? Was that a pregnancy symptom? Please take me seriously and give me options that ease my mind. Thank you. Yours truly. Irene", "itsflurrie_": "Dear all the contraceptives I’ve tried, you’ve not helped my Endometriosis and it hurts. It hurts that people think I’m a “slut” because I refuse birth control medication because it heightens my pain even more. You gave me hope but let me down so much. 10 years of endometriosis and 0 days of effective treatment. Love Flurrie.", "fionastefanie": "Dear contraceptives, I have been on you since 16, always hormonal as it seemed like the best option, though I will admit the thought of extra hormones inside my body makes me quite uneasy. You have seen my highs and my lows (and there were a lot of lows). My first pill brand, that forgetful me kept forgetting to take, but I wasn't really having sex so who really cared. That pill killed me emotionally and made me too emotional to function. My second pill brand, oh how well we worked together, I mean I forgot to take you often enough, but we had a much better bond than my first, and we got along well. Cramps were less painful and periods easier. Then came the injection, a yes dear depo, the love of my life, my perfect solution. No periods, less mood swings, overall a happy relationship. But for reasons out of our control we had to split, and I was brought to Rigevidon. The bane of my existance. Constant mood swings, crying, cramps so bad I could barely walk and that made me terribly nautious, blot clots and constipation, worse than ever before, my god, I wanted to kill you almost every day. You made life hard and periods harder. So back I came to you depo provera, and we are happy again, no issues so far. Please don't make my bones thinner, I like them how they are. Anyway, to all my contraceptives, thanks for preventing me from having a baby, if nothing else, at least you all did that well!", "ellie_mjackson": "Dear PCOS and every contraception I've ever tried; Y U GIVE ME SO MUCH THRUSH?! Come on guys I've already got a hairy chin and have to go for monthly waxes so I don't look like Bin Laden's arm pit, AT LEAST GIVE ME A WORKING VAGINA.", "lightworthy": "Dear doctors, WHY DID NO ONE THINK TO TELL ME THAT IF YOU HAVE MIGRAINES WITH AURAS BIRTH CONTROL WITH ESTROGEN CAN CAUSE STROKES? I’m incredibly lucky I didn’t end up choosing one with estrogen because I knew that the estrogen could make my migraines worse, not that I could have a STROKE. I only found out when I went in to get my nexplanon ordered again, 3 YEARS after I started looking into birth control", "natalie.jane.davies": "I made an appointment to have an IUD put in in the UK, and was told by my (male) doctor that I would be absolutely fine to work that afternoon, even after I expressed concern that I would be in pain after doing some research online. On the day of my insertion i had a female doctor and a female nurse present. The insertion was painful but only as much as expected. Once it was over I sat down with the Doctor, expecting her to explain to me the method to check my string every month, which is what I had read and been told would happen. When she didn’t mention this and I asked if I needed to know how, her response was, “oh no you’ll know if somethings wrong”. I was in agony that afternoon, couldn’t stand up and had to call in sick to work. I tried to find my IUD string the month after insertion and could not find it. Only after I made a GP appointment and missed a scholarship class to get it checked did my GP explain how to find it and tell me that it has been tucked up inside me in a position that was unreachable. The IUD itself has been great, the Sexual Health Clinic not so much x", "tjardamarijn": "Dear pill, you've helped me feel/be save with all my sexual encounters for years. I could set a timer to when my period was about the kick in, and you barely bothered me in any other way.. Until you started to postpone my periods/bleedings for Ionger and longer every passing month. If you didn't keep me waiting so often and cause all this paranoia we might have had a longer run. But I can't say I wasn't curious about other alternatives. Me and Mirena Coil are together now, although she makes me even more paranoid then you ever did! Skipping whole months at a time! Pregnancy tests are a standard in my medicine cabinet now. I don't know how to feel about her yet.. Only time will tell I guess. All I know is that my body feels more my own, and more comfortable, the fewer hormones are added to the emotional concoction the I already am. Thanks anyway for existing guys. You have my back when I need you, and that's what counts.", "dramaticlittlegirl": "So, I have been on the pill for nearly 4 years now, and my reasons for using it have changed massively! I was originally on microgynon for 3 years because I could have a week break for a bleed, and I was dating men so could avoid pregnancy. But, I've now been with my fiancé just over a year and she's a lady too, also on the pill. She's on cerelle to stop her periods, because she gets really painful ones. I changed my pill to a similar one, feanola, so I can not have periods with her and when the times comes where we want children, I'll stop taking my pill with her so we can go through it all together.", "misslwheeldon": "Dear Evra, you were the best contraception I’ve ever been on. You caused no problems at all, and I didn’t have to remember to take you every day. I’m sorry our time got cut shut together when my anxiety flared up. How was I supposed to know I was going to get migraines? Now I’m with implanon, they’re second best but I suppose they’ll do for now. I do miss you evra. Lots of love Laura", "noelfleeman": "Dear Nexplanon, You suck! I literally have had a period since the day you entered my body (5+ months now). I am an emotional wreck because of you. I am in a constant state of sadness, just wanting to quit school. My cysts in my ovaries have returned because of you, and so has my cystic acne. Knowing a may have you in my arm for 2 1/2 more years + I may bleed every day makes me want to scream. Dear every type of birth control pill I ever swallowed, I am so so so sorry I gave you up for the implant. I will try harder next time to remember to swallow you. XOXO, Noel", "willadubois": "dear world, why isn’t there male contraception (other than condoms — for example male birth control that just stops ejaculation)? p.s.: if there is a reason plz lmk im actually really curious", "rowanrgreene": "Dear Evra Patches, thank you for being convenient, easy to remember and keeping me happy, regular and non- pregnant. sorry that I left you when I was sixteen, after a teaching assistant mistook one for a nicotine patch and reported me to the headteacher for being an underage smoker. Meaning that I had to explain to that sixty year old man and my head of year, that I wasn’t addicted to cigarettes, just that I was having sex and trying to be safe.", "zaydaliciousdesigns": "Dear Copper IUD You are very successful at your job. But you also stress me out. The random spotting, heavier (more painful) periods, how your strings like to randomly disappear for a few days at a time... but for all that you are better than the pill I left for you. At least my moods feel like mine again.", "crszyhairkirsty": "A penned note to my implant; I both love and hate you. Thank you for taking away my heavy periods and pain for 80% of the time. Thank you for the continual protection without the worry of taking a pill. Thank you for not giving the weight gain that other contraception did. However there are things I will not thank you for. I could do without the continual spotting and me questioning whether I have to use my mooncup each day. I could do without the crippling back pain when my body decides to release an egg. I could do without the ridiculously heightened sense of smell that makes being anywhere near mushrooms unbearable. I will put up with the pain it takes to have you removed every 3 years to give me the much easier life. But please, no more painful boobs. They're hard enough to deal with before adding pain to the mix!", "claire.lacey.96": "To my endocrine system, I'm sorry for confusing you into thinking I'm pregnant or generally fucking with homeostasis by taking the pill! I hate that I have to fuck with you in order to avoid unplanned pregnancy. Some day I plan to give you a break from these HORMONES but for now we are in this together 😘", "chloe_sophia_mcdade": "Dear Contraceptive Pill, you regulated my periods and got rid of my acne which is great but you made me gain weight, gave me Anxiety and Depression, lowered my libido and caused Teachers, Parents and Doctors to not take my symptoms seriously. It's been a year since our break up and I've never felt better. Yours, Chloe", "kmcgrathmusic": "Dear side effects, just why exactly do you exist? I'm 17 and non binary, and it'd be really nice to have some method of contraception easily available to me without having to add more female hormones into my body-I've already got many more of those going around than I would like. As someone who suffers from chest dysphoria, the idea of taking/using any contraceptives that could have side effects like chest growth makes me, well, want to chunder frankly. But with a sexual health nurse for a mum, I'm pretty well informed on statistics and stories that make me definitely against just relying on condoms! So, side effects, please stop making my life complicated! Thanks! Yours, K", "katie.s_x": "Dear the pill, thank you for getting me through some tough years. The heavy periods and painful cramps. The days off school where it became too much, you came along and they weren’t as bad. You showed me that taking the pill doesn’t have to be ‘dirty’ because of having sex like I thought it was before I knew it could help in other ways too. But it wasn’t mean to last and I moved on to my implant. So thank you for your help for 2 years, love from Katie 💖", "softball_meets_sailor": "Dear Orthotricycline, sorry for being on-again-off-again with you. I appreciate you letting me be selfish in my unreadiness to reproduce and desire to wait for my husband. You and I have said goodbye (for now) and I hope that I can be a “normal” woman on my own now. Thanks for taking away those awful pre-period symptoms. Maybe you can take them with you. Love, Lauren", "geddster101": "Dear IUD, thank you for being one thing I can depend on. Even though you caused me 6 weeks of cramps and spotting in the beginning, this year has been wonderful. I don't get my period unless it's spotting here and there but never more than a couple of days. Thank you for keeping my hormones regular and I never need to remember to take a pill again! I struggled with taking the pill because I wasn't reliable enough to remember or if I ran out, getting a new pack at the pharmacy or Planned Parenthood wasn't always reliable since I don't have great transportation. My skin would also freak and break out all over. I would have HORRIBLE cystic like acne on my neck and jaw if I missed a single day! The IUD was a choice I made at 21 because I don't ever want kids. My partner and I made this decision together with also my mental health in mind. My mood hasn't gone depressive or manic since I'm a low dosage of hormones either. It was the best choice for me. I didn't want the implant or ring cause I was more scared than the IUD (even though that seems backwards). Thank you IUD for keeping me balanced and in check when my life isn't.", "sophie_liljeberg": "Dear Marvelon, what would I do without you? You level my moods, and control my acne. A big thank you for shortening and lessening my bleeds as well as taking away most of my cramps and pms. Thank you for being there through thick and thin but could you please stop lowering my libido? Love Sophie.", "angelasharma": "Yesss okay. So I’m 23 now and first started taking the combined pill when I was 17. Was a bit on and off with it, and started trying new ones when I felt like it was affecting my mood. Was put on one that was good with my body, but was sent a letter by the GP telling me they were changing me to the same one but different brand. They emphasised it was all the same, but I reacted badly mental health wise with the new one. Finally decided to stop the pill, and on recommendation of my partner at the time (whose ex was a doctor and swore by the IUD) I decided to get that. Decided on the non-hormonal one although doctors tried to sway me to the hormonal Mirena. Getting the copper coil was excruciatingly painful to get put in. But had it for a year and a half and has been good!", "jessie.dp_": "Dear every pill I’ve taken- fuck you for making my moods so bad. Fuck you for causing depression and a relationship to end. Fuck you for making me believe that sex is the most important thing in a relationship, and therefore I should keep on taking you. Even when I stopped taking you, you made me put on weight. Fuck you.", "ms_kippes": "Dear Catholic hospital, thanks for being so convenient and close to my house when I busted my ankle. But also fuck you. Because when I wanted to re-up my script for the pill your judgey butt told me that my OB wasn't allowed to proscribe the pill when it was \"non medically necessary.\" God forbid a woman wants to have sex. Thanks for making me feel dumb for thinking you would provide me with healthcare. I won't make that mistake twice.", "reettaoo": "Dear mother nature, why do we need to put ourselves on pills etc to make sure that we don't get pregnant? :( Wouldn't a text for \"ur not pregnant\" be enough? 😭", "jesca.hardy": "Hey there, contraseptive implanon! Thank you for being my best mate. Because of you, i dont have to worry about setting a reminder on my phone to take a pill. Because of you i only get cramps one day a month rather than a whole week (and so much less painful too). Because of you, my weight and mood has not fluctuated for several months. And because of you i haven't seen blood in my underwear since we met 10 months ago. 3 years will go by so fast and i can hardly remember a life without you. From both my husband and myself, thank you. You the real mvp.", "canibeadiamond": "Dear every pill I’ve taken so far (including the most recent cerazette), why do you not keep my period away? Why does my body always want to break through the pill and create havoc. Without the pill though I would most definitely be housebound thanks to chronic pain from endometriosis/adenomyosis. And why is it that every specialist dr wants me to get a mirena when I’ve specifically said no because I firmly believe with my adenomyosis that the mirena will end up being lodged inside my uterus walls? All I want from contraception is no period so that my pain is less. Instead I am frustrated by my body and its lack of cooperation and drs lack of desire to really find out what’s wrong. Tired of advocating for myself when going to a dr should be a far easier visit not one where I end up in tears because no one is listening to me. From one frustrated and in pain person", "zohey_": "I've been on cerezette for 3 months now (after a year on microgynon they actually asked me my family history of blood clots, my mum suffering a few at a young age and recently meant they were like lol you shouldn't be on that! Love doctor's not actually checking these things in the first place!!) and touch wood it's going well!!! No real periods, definitely no mood swings (hormonal ones at least ahah) like I had with microgynon, and hope it continues! As much as I dislike the whole unnatural hormones thing, I'd prefer to be safe especially while at uni!!! x", "akelia_mb": "Dear Mini pill, could you maybe not cover my face in acne, also irregular periods?... I'm not a fan of being surprised in a cinema toilet when I'm completely unprepared! Sincerly Girl who has to constantly carry tampons \"just in case\"!", "juujkfhaulw": "i‘ve gotten the implanon half a year ago, for contraception and to stop my period pains because they were unbearable! worked for me! no unwanted side effects:)", "hannahschmitty": "Dear Xulane (Patch), Its only been three months since the start of our relationship and it has been interesting to say the least. The first day I stuck you on my hip was a Sunday morning and I thought little of you until my skin started itching. When I pulled you off the following Sunday morning I found a nice big red patch in your place in your shape. I replaced the first one just to give it another go. Within that week my head became clearer and my anxiety lessened. I've had mood swings at least two weeks before my period since I was 12 (I am now 26). But now I'm clear of mind! Just two weeks in and I knew this relationship would last... but the red scars where you once were give me pause. I can still see where you were a month ago. Is my stable mind really worth the itchy red scars you leave behind? That has yet to be decided. But thank you for giving me my emotions and mind back. This clarity is something I will treasure even if our relationship should end. Yours Truly, Hannah💙", "lizzy_maryjane_farmer": "Dear all pharmaceuticals, I knocked you all on the head about 6 years ago. The result. A baby. With someone 13 years younger. The best thing that could have happened. Unplanned. Not expected. But the best! Family of six! X", "sairamanns": "Dear Implanon, you were great for the first six months, but why you turn cray after that? Zero to one hundred reeeeaaaaaaalllllll quick. Thanks but no thanks. Love, Saira", "laura.olivia27": "To all the pills I took before, Microgynon, thanks for being my first. You cleared my acne for a little while, but in the end we had to part. They told me you’d cause me more pain in the end, so you had to go.  I can’t remember what came in between. They weren’t so important. We didn’t work out, and I’ve moved on. Rigevidon, to you, a swift screw you. It took me a year to realise I wasn’t just pulling my hair out because work/college/friends/etc. was a stress. The more hair I lost, the worse my stress became. And one day it clicked that all it could be, after eliminating all the other possibilities, was you. One haircut (so my hair didn’t look so fine and bedraggled), a change of pill to Triregol, a new adventure to do something I love, and months on Accutane, I’m finally happy with me and how I feel and how I look. Triregol works for me, although #TheHormoneDiaries has made me question whether I truly need to be on a contraceptive pill, and what alternatives might work for me. Let’s see where we go from here...", "jadeling97": "Dear Cerazette, why did you have to mess my cycle up and give me my first period in a year? Also cause my depression and anxiety to flare up 😩 but to all other versions of the mini pill thank you for stopping my periods and helping my mental health 😘", "karolina_kubinova": "dear ayreen, thank you for stopping my periods so that i don’t feel like death every month (thanks, von willebrand disease), but like... i’m gay. i’m not using you so i don’t get pregnant. why can’t insurance pay for you? 😭", "karolineltv": "Dear implant, for 4 months you have made me feel like someone else, for 2 off those months you have poured blood out off me, you have made me have 3 anxiety attacks, but good damn the sex you have given me is good.", "gmke": "Dear patch, Thank you for regulating my periods and helping me ease my periods pains. I wish you could’ve done it without making me gain a lot of weight, although I think it has made me have a better relationship with my body... It’s bittersweet. You’ve made me so much more safe with my body, my relationships, and my sex life.", "gigachick11": "Dear Regividon, it's been over a year, nearly two since I met you. The pain was bad, but no medications were helping, and the consultants weren't sure it was caused by my colitis so they referred me to gynecology. And that's where you came in. You may have not significantly impacted my pain, in fact I had never experienced such bad period cramps until I met you, but knowing exactly when my period is has been wonderful, especially after times I was scared for months if I had another thing wrong with me as I suddenly had no period for months on end. It's difficult mentioning being on the pill at school or college, people can easily misjudge, but that won't stop me from using you. On a lighter note, you force me to take my other pills as I know I can't skip you. Thanks for what you do, from me, Tiana.", "abbeygraceharrison": "Dear Mirena, thank you SO much for being the miracle treatment for my endometriosis! If it weren't for you, I would be spending so much more of my life in bed with pain. Thank you for being so accessible to me through the NZ health system, and for being free because I had low iron before getting you! After years of nothing alleviating any of my endometriosis symptoms, you came in and changed the game. Love you long time. Abbey.", "ninamaiac": "Dear Dine (my pill), you made my life much easier and painless. Thank you for keeping my endometriosis under control. I don't like the weight you made me gain, but I appreciate all the benefits in my health.", "cxrpseroads": "Dear the pill, we had a weird relationship, you lessened my intense period pains but also caused my depression to get a bit worse and a lot of weight gain... ultimately and slightly more permanently though, you didn't work for me as a contraception and I now have a beautiful baby boy. I remember when I did the test and immediately looked at you in your little packet on my bedside table and felt so angry and frustrated with you, you had one job and you had failed, I was the one in a however many that it all of a sudden hadn't worked for. My son is now three months old and I am beginning to think about contraception again, even though you failed me, I still think about starting you again as I just can't seem to find any other contraception that sounds right for me. No matter what contraception I do decide on, its something that i will always think that little bit more about than I ever did before. Holly.", "ironicadler": "Dear Mirena Coil, since we met three months ago it's been a real rollercoaster... No thanks for making me pass out in agony on the way out the door of the hospital and have to be trollied back inside and observed for three hours. No thanks at all for making me bleed for a month straight, or for causing me random cramps on and off for the last several months. Thanks for stopping me from getting pregnant and giving me my emotions back though. p.s. dear Microgynon 30, you and the crippling depression you caused and fuck off.", "sianacus": "Dear Implant, we had a bit of a rocky start didn't we? it was kind of weird the nurse didn't offer me a local anaesthetic, but we got through it didn't we? Thank you for helping me be baby free for coming on 8 years now! I do wish that you had given me regular periods if not taken them away but we can't have everything can we? Here's to some more years my friend!", "juliabujalil": "Dear Yaz, This is my farewell letter to you ... at least for now. We’ve had a good 4 years. When we first got together you were new and exciting, you made me feel so grown up and you took my pain away. With you, my skin was clear and glowing, my periods became a safe pattern and you made me so happy. But still, something was nagging at me and I didn’t know what it was. While I was happy you were in my life, it felt like an arranged marriage. You were forced on me by the doctors and I was too young to ask anything about you and what you would do to me. As the years passed the symptoms of our relationship started springing up and it became hard to deny you were taking more from me than you were prepred to give. As new hormonal issues appeared and my anxiety grew I didn’t know how much longer we could stay together. And as the years passed, I grew resentful of you, yet everyone told me not to leave you. Today I saw a new doctor. She told me I can leave if I want to. She says there is a different way than the only one I’ve known. I don’t know if she’s right, or how I will live without you, but I know I need to try. Dear Yaz, thanks for what you gave me but I’m going to try it on my own for a while.", "maddie_v_benson": "Cerazette is EXCELLENT. I didn’t quite realise how much anguish my periods truly caused me until I got rid of them. I took me a while to understand my mood swings often were linked to my cycle- just because you’re not bleeding doesn’t mean you don’t have a cycle! Who knew! I am so so happy :)", "hannahsaywhaat": "Dear Pill. Thank you for being there for me when I was 15, scared and needing contraception. Thank you for being so easy to get and available somewhere other than my GP and thank you for still working 6 years later ♥️", "elinorterry": "Dear that broken condom, I thought you might like to know that I will never forget you. I will never forget the gut wrenching feeling when you snapped inside me, the tone of my ex-boyfriend when he pulled out and simply said \"oh\", the fear that I felt when I realised I hadn't protected myself enough. That fear followed me around for four years and, though it slowly fades, it can never fully be gone. My fear of sex stems from you - it's not entirely your fault, no, that lies with my ex-boyfriend leaving me two days after I started taking the pill for him - but, to this day, I can't have sex with a condom on. I'll never be able to have a one night stand. I'll have to be extra cautious with my sexual health. It look me a long to work out where my anxiety, I'd go so far as to say phobia, originated from. But now I know. And I just wanted to say that I don't know if I'll ever trust you again and, even though I know it's irrational, that one mishap has affected my sexuality and my confidence forever. I'm very lucky to have found someone I trust now, someone I'm comfortable in bed with and who understands my crazy thought process. But it was a long old 4 years and for most of that I couldn't tell anyone what was wrong. So, yes, you remain in my mind, perhaps the least disposable condom in a while.", "k.drew18": "Dear uneducated men, my birth control pill is to calm the Niagra Falls of a period I have monthly. Its not so i can be promiscuous. Therefore, I'm afraid I don't want to have sex with you. Your hand will have to do for tonight. #sorrynotsorry", "peeerola": "Dear Nuvaring, thanks for being there. Since I have discovered you my life has changed for the better! The pill gave me some bad side effects, such as nausea and bad mood, but now I can be free and not worry about anything of that. It's a shame sometimes it takes a bit long to find the right way to put you in place correctly, but to me you're so effective and so easy to use. Even though I'm a bit sad I have to have additional hormones in my body and too worried to only use condoms, I like you a lot and I hope we will be friends for a very long time. Love, a 23 year old girl", "kathrin.leipe": "Dear Contraception, we don't really know each other because I'm gay, but thank you for protecting my friends for me! I often thought about getting to know you, I thought you might be able to help me with skin problems, however I decided that it wasn't worth it because I knew you could also hurt me. So, let's just stay distant acquaintances! :)", "blxck_ct": "Dear Implant, THANK YOU! Thank you for letting me be part of the 1/3 of people who no longer have periods while on this contraception. Life is great. I can’t believe it’s been nearly a year and I’ve got no complaints. Yeah we had a few moods swings back in January, and our last period was spotting that lasted 3 months, but the last 8 months have been fantastic. Love, C.", "katiesoddsocks": "Dear doctors, Every time you ask if I am on reliable contraception, I am going to say yes, and when you ask what that contraception is, I am going to say, “being gay.” Yes, it counts. Just because I’m not on medical contraception, doesn’t mean I need all your pregnancy chats, thanks. I am very happy as I am. Cheers, Katie", "paula_jayne93": "Dear progesterone only pills. I know you were supposed to help my endometriosis and you did stop my periods. But you made me feel very low/ depressed on an almost constant basis and you made my hair start falling out. You work for so many people but not for me - and it makes me feel betrayed by my body.", "womanbehindabook": "Dear Qlaira, you are so much better than the other contraceptive pills I tried. The closest to natural + taking away period pains (and my period, most of the time). After all the horrible side effects I experienced before, you’ve been a delight! 💕", "sophieeleri": "Dear Rigevidon,", "spencer_the_panda": "Dear Femikadin (pill), kindly fuck off. You and I were just not meant for each other. It took me two years to realize that you were the sole cause of my depression which drove me to the darkest pits of my mind. It took me loads of therapy to get over the abusive behaviour and mindset towards myself that you had been causing. I am free of you now and have been for two years and I have never been happier. I hope that you make other women happy, but I'm just not the one for you. Goodbye, Spencer", "kierkrs": "Dear jess (which is like a very common birth control pill among the teenagers in russia), thank you for managing my moods and skin (basically it’s the only thing that makes you stay in my life) somehow and relatively controlling my period. but also fuck you. i’m on the ace spectrum but i’ve never been so sex repulsed in my whole life. ‘sex is good’ i though before you and now i wanna rip my own skin every time i just think about it. okay, i guess that the lack of weight problems is good, but do i deserve to feel so hopeless and depressed because of you? love, alik.", "aalex.he": "I have the PCO syndrom and my gynecolist prescribed me the pill and I have been taking it for almost 2 years now and would really like stop taking it because it makes me have strong mood swings and generally be less happy, but I am afraid that my PCO will get worse and that without the pill I won't have a healthy memstruation cycle", "margaretlouiseday": "Dear Copper IUD,  Even though you give me horrible cramps and weird stringy discharge all month long, I love you so much. With you, I get to have sex without worrying about getting another blood clot! And yeah, I have to use ultra plus tampons now, but my period’s way better than the pre-Diva Cup blood bath I had on blood thinners. Thanks for keeping me baby- and pulmonary embolism-free!  xoxo, Margaret", "rxye": "Dear Cerelle, thanks for stopping my periods and being the reason why I don't get pregnant. But no thanks for those 3 long months of constant bleeding you gave me, ruining my summer! But I'm glad we're pals now, and I haven't had any issues with you (touch wood) because I know how difficult some other women have it finding the right balance with birth control 😊 Love Raye", "harpyfemme": "Dear God, thanks for making me a lesbian so I don’t have to worry about contraception for pregnancy purposes, love Chloe ❤️❤️", "3llieduenow": "I JUST STARTED BIRTH CONTROL ON SUNDAY!!!!", "missladylamp": "I’ve been on the patch for around 3 months now. I haven’t had any major problems apart from my first period was pretty nasty. Usually I’m in pain and ill for a full day, and better by night time. But with the patch I was groggy all week. I’ve had tender breasts since I began, but that doesn’t bother me. I’ve also had a little weight gain but I’m not entirely sure it’s because of the patch, or because Ive recently gotten into a relationship and have been happily munching on shitty food with my boyfriend. Patch placement is a little tricky, because if you don’t want it to be seen, (because it can look gross with black fluffy around the edgy, no matter what you wear) most likely it’ll get caught on clothing. I once put it in my back thinking it would be fine, then put on my bra and realised it could be a problem. I was cautious for a few days, then one night with my boyfriend, clothes are coming off and so does the patch. Totally killed the mood by rushing to put another one on ASAP. But all in all I’m all good! Really love the patch, I hated the thought of putting something inside me, or swallowing a pill that I would inevitably forget, or throw up or shit it out. (I have horrible ibs and tend to have a handful of hangovers) so decided it wasn’t worth the worry. I heard of the patch from @comexcurious and as soon as I got serious with a guy for the first time, went to my doctors and told her that this is what I want. I had watched all the videos and read all the articles on it. (My friend told me when she went to the doctors to ask for the patch they tried to convince her to go on something else because it’s expensive to manufacture) So to spare the agro, you bet yo ass your girl went in there with a 3 page essay, a pie chart, bar graph and a PowerPoint presentation on how much I know about the patch and please don’t try and convince me to put something metal up my fanny. The thought makes me ill. And my doctor was like “wow you know allot about this. I don’t even know that much about it let me google it...” erm??? But anyways, highly recommend the patch 100% ❤️", "sophiemariaxx": "Dear Diary I started off with the implant which was great for a whole year then bam 3 week periods everytime 😫 so had that taken out and put on Cerazette which I see you take...been on this 2/3years maybe and all good...recently longer periods are commencing just had a two week one 😒😒 hopefully you go back to normal soon 🙏🏻 x", "nancy_victoria_eves": "Dear the sexual health nurses at my home town clinic, WHY DID YOU LET ME TAKE THE PILL ON TOP OF THE IMPLANT FOR FIVE YEARS?! The minute I go to a city clinic they tell me that that’s not a good idea, and explains why I’ve had no sex drive or any emotional peaks or troughs at all for a long time. Too many hormones turns you into a shell. Sincerely, someone who finally wants to shag their fiancé again!", "kirstyjpoynton": "Dear Rigevidon, You are the only hormonal contraception I’ve ever used, and you’ve done me proud for the last 5 and a half years. I was 17 when we first met and I’ve seen you every day since. Some people don’t get on with you, but that’s because everyone works differently. You’ve never caused me any problems, you’ve always worked perfectly and I wouldn’t ever want to change you. You’ve been by my side for over half a decade, and I hope our relationship will continue for the foreseeable.", "charlottexwildx": "Thank you to the pill for the stability you gave me! You’ve cleared my skin up, given me regular periods, helped my weight control and my mood swings. Periods still hurt like hell but I can put up with that for the benefits you’ve given to me. Also thank you to my wonderful GP and pharmacist that have looked after me, made me aware of all my risks and always take my blood pressure for a repeat prescription.", "hannah.eliseie": "Dear my pill, you were supposed to help my cramps. Instead you made them worse, gave me migraines that make me vomit, and now I’m home from school. Thanks pill I appreciate your lack of help. 🙄", "nienkeeem": "Dear pill, Thank you for making me gain ten pounds. Lots of love", "ale_mp_89": "Dear hormonal birth control, I met the pill and became friends 10 years ago. Almost 2 years ago, I realized you were giving me headaches, I decided to change for the patch of but it did not work out. I met Mirena, I gave it a chance for a year it wasnt my friend either. It was hard, but I decided to let you go... Thanks for not making me pregnant, but side effects are too much for me. I really enjoy myself more without you. Condoms are not my best friends either but they dont make me feel like shit... I am happier now 😀", "kaina_ariz": "Dear Yasmin, although you helped in regulating my periods and with the pain, you aided my depression and BDP. I had no idea those tiny pills could do such things. The crazy BPD mood swings didn't need you to cheer them on and make them bigger. I'm so glad my prescription ran out, I'd otherwise never have noticed what you were doing to me. I'm glad you aren't around anymore. I still haven't found the right one, I'll figure that out at some point. Bye - Kaina", "unspecifiedimmortal": "Dear Loestrin Fe, you have been a miracle in my life. Taking you continuously helps the pain from my endometriosis and PCOS. You also don't drive my moods crazy. You have been a good friend.", "polly_dowdle": "I have PMDD and endometriosis, so my periods were living hell: vomiting, fainting, and blood clots were my life until I started taking desogesterol. I had been taking microgynon for a while but I realised coming off my period completely was the only way. I became severely depressed (for the first time in years) on desogesterol, but luckily my GP is a gem and prescribed me a low dose of sertraline, an ssri. My life has completely changed! I'm happier than I have been in years, probably since my period started. Don't sit in silence, ask for help and don't take no for an answer.", "alexxaandrine": "Dear contraceptive pill, I was taking you because my periods were every two weeks - a nightmare. But you were one too. Every start of the cycle, you would make me vomit and have nausea for three days straight. I had bigger boobs, I had regular periods and even gained weight and I loved it - but you were still a nightmare. Glad I am a lesbian and don't need contraception because I couldn't have you in my life anymore!", "zoenicolexx": "Dear Mirena, it’s been 9 months since we met and honestly I’m still not sure if we can work. I want us to, I really do, the minimal periods and high success rate have my doctors and I singing your praises. After the cerelle you knew I had trust issues, I mean seriously who goes from no periods for two years to one ever other week. You’ve tried, you even stopped that mysterious stabbing pain that made us go for an ultrasound to make sure you hadn’t tried to find an alternative exit, and that is appreciated. I think we can make this work, if you would just stop stabbing into me when I orgasm then I think we could have something great here. Think about it, Zöe", "theyoungabigail": "Dear contraception,  I am a virgin", "mouseluva": "Dear Loestrine, thank you for stabilising my crazy PMS to reveal the mental illness hidden underneath. My life is so much better since I have been able to get treatment.", "rosiiecampbell": "Dear period stigma, you're a real bitch. Hate to break it to you, but you seriously need to get out of my face. You're everywhere I go: college, the internet, even some of my close friends. I hate that you follow me everywhere, causing people to look disgusted or embarassed if I pull out a pad in class or complain about my cramps. Why are they embarassed? I'm the one with a uterus shedding more than a German shepherd. We've always had bad blood (pun unintended but happily received) and I'm sick of it. I would really like it if you could leave me alone; I would like to bleed in peace. Hope all is well in the Land of the Taboo Subjects (ask sex and bisexuality how they're doing?). Lots of love, Rosie x", "velvetshock": "Dear microgynon 30, lots of people said I shouldn’t use you but I thank you for helping regulate my periods. I wish you didn’t make them so painful but at least they are back. I thank you for not only controlling my periods but also for being back up contraception. I’m glad that you entered my life but I hate having to remember taking you everyday. Thank you for keeping my body regular. Love Heather", "anya_noel27": "Dear Mirena IUD, that little stunt you pulled trying to escape my uterus was seriously not cool! I just want us to be happy together so please don’t do it again. Also this unpredictable period thing isn’t fun is really annoying if you could stick to a schedule that would be great! I know we’re still getting to know each other so I’ll give you a another chance.", "wittle95": "Dear Azalia, I had my period for 34 straight days and I’ve fallen deep into my depression because of you and I had to leave you behind. I hope no one ever goes through what I’ve been through with you. X Rita", "mistervero": "Can't really figure out a good way to write it. For one I'm not a creative writer, but I also have been up since ~4.40 am. I got sterilized today! I've waited a long time for this, and now it's done 😁😁👌 so sore though, and long day of not being able to sleep in the hospital bed (I'm a super light sleeper)", "gem8878": "Dear implant, I hated you you stopped my periods and constantly made me worry that I was pregnant then give me a period 4 months late, you made me moody and over emotional and I couldn't do it any more I'm sorry we parted but I met something new called the patch and it's perfect for me I'm sorry but it was you not me and I don't miss you much but I love my patch and I just don't love you implant anymore it gives me a monthly period which I love and I don't get pregnant or even think I am i don't miss you - my body", "jess_cant_find_a_username": "Dear Maxim, I admit I never needed you. I wanted you! I wanted you to get rid of my physical imperfections - and you served me well. Though I never understood why you and your friends have any emotional or physical effect on other women... I never felt a change at all. Which is a good thing, I suppose. Can't wait to actually need you once I've found my place in this world. I know I'll be happy with you when I get back to you. Thank you, Jess", "dr_toerag": "I mis-read part of that as “wood changes” - which seemed oddly appropriate and yet probably still wrong.", "daisy.twizell": "Dear Rigevidon, Thank you for being the option that actually worked. For being reliable and unproblematic the entire year I’ve been taking you, because you have truly made me easier. Before you, I had a little plastic stick injected into my arm. I still have a scar. That little implant was nowhere near as cooperative as you. It reached into my mental illness and fueled all the worst parts of it. It took my sanity - and my sleep. I still have the scar from it, but that’s okay. It’s gone, and now you’re here. You balance my mood. You have kept me protected no matter how many times I wake up too late to have a schedule for you, and even when I drink, you don’t force me to vomit. You also haven’t stopped my menstrual cycle for a year and a half with no explanation, which is a plus. I heard so many negative things about you, weight gain horror stories and the like, and I’ve never been more grateful to have ignored them. Thank you for being the only option that has actually worked for me.", "ellieorjerry": "Dear the numerous pills I have tried. Cilique is the one. Sorry to have the break up with you all, but Cilique makes me happy, you others make me sad and moody 🙁 love Ellie xox", "ilolatmyself": "Dear Rigevidon, We’ve been together for 5 and a half years now, and you’re the only hormonal contraception I’ve ever used. You get a lot of bad press. You don’t work out for everyone who uses you, but you’ve served me well over the years - reducing my period pain levels to the point that I no longer had to miss school every month because of the pain I was in. I think some people forget that everyone’s bodies react differently to different types of hormonal contraception. All we can do it try it out, see if it works, and try something else if the side effects get too unmanageable. Also dear NHS, thank you for providing me with free packs of rigevidon whenever I need a new prescription. You have given me one less cost to stress about.", "poppietayley": "Dear inplant in my left arm. After years of taking the pill I entered into my first long term relationship and kept having terrifying fear of falling pregnant due to my ill memory to take my pill. I approach my GP at home and the nurse said it was possible if I jumped through some hoops. First I was told I need to have the injection in order to stop my period for a month. So I had it and off I went to uni. A month later falls and I have a period and the nurse had originally told me I couldn’t get the implant if this happened. Panicking I went back on the pill for a month and hated it. So I went to my new gp in London who had the implant in my arm within the week. Why was I messed around at first? Why wasn’t the nhs nurse properly educated on this? After I got the implant my arm was swollen and black. Why wasn’t I told that once I had you injected into me I would be black for and blue weeks. Why wasn’t I told that I would bleed for possibly the longest time since being old enough to have periods and be in so much pain that I couldn’t move. In your defence the next 8 months were okay with little pregnancy scares and no periods at all. But then it was 10 months. And you gave me pain. Back numbing, teeth grinding menstrual pain, yet no blood. For two weeks a month I feel as if my lower back is on fire. Thank you for the stone you help me put on when really I need to lose it and the fear of having you taken out is bigger than the fear of getting pregnant or the fear of these monthly pains. I will put up with you for the next year and a half but after that, I hope to never see you again. Yours unfaithfully, Poppie.", "niamh_m_kelly": "Dear the pill, I've tried so many different versions of you, but I just can't have you in my life. You made me so depressed during pms that I almost dropped out of uni. Twice made me throw up so much that my mum thought I had morning sickness. You made me paranoid, thinking my boyfriend was cheating one me, and you killed my labido so much it was pointless taking you. So thanks for stopping me from getting pregnant for years and giving me the regular periods I never had, but I need to put my mental health first. Niamh.", "alice___._": "Dear condoms, You can be expensive but then again less expensive than a baby", "jillian_patience": "Dear lo loestrin, thank you for such an amazing first month, I'm going to give you sex before I really decide if you are what is right for me. But, why am I still spotting for the 3rd day in a row?", "davey.38": "Uhh what’s a wood change?? Asking for a friend", "amyysaundersx": "Dear my pill, thank you so much for giving me a four-month-long period. I couldn't imagine anything I'd rather go through than four months of constant bleeding when I'm already prone to anaemia. Love, a really really tired girl", "olivia__seymour": "Dear Depo-Provera, you were great whilst I needed you but I’ve been off you a year now and my period still hasn’t come back, which has left me scared about my fertility years before I should be. So thanks, but never again. Olivia", "aliceswrabbit": "Dear pill, I’m sorry that I’m so bad at being on time. I’m just really bad at doing things regularly at the same time every day. Things like writing a diary or taking medication. I’ll try to do better in the future. Thanks for keeping me baby free and pretty much cramp free for a year and a half now! You’re a life saver! Couldn’t have done it without you! Xx keep up the good work! Your loving host, Alice.", "krissy_barber": "When I was on the pill (combined pill) I was anxious all the time and it made my pain so much worse but it reduced my flow so I stayed on it for like 3 years because I'm dumb", "zarahanna": "Dear IUD why do you have to be so stubborn, I wish you would just come out so I don't have to have general anaesthesia, like I did with my emergency c-section.. Dear IUD why do you have to make me relive my trauma of the operation room, the bright lights, the noise and the touches of strangers. You were suppose to do the exact oppisite in preventing another pregnancy and birth.. Zara", "cuquiface": "Dear Microgestin Fe, thank you for giving me my life back. Gone are the days where I'd take 800 mg of ibuprofen every 5 hours, and still not feel relief while on my period. Gone are the days where I'd be so nauseated while ovulating, as well as the week before my period. Thank you for making me feel human again. Love, Laura.", "memollywithay": "I had a facial mole scare recently but the doctor was able to put it down to hormonal changes (namely going on a new pill and causing the mole to morph and change colour). Definitely a relief, but I'll still be getting any mole changes checked out by a professional", "uhh.darci": "dear first gynecologist, getting on the pill was the best choice for me at sixteen, and I'm grateful to you for helping me do that. thank you for the free condoms as well. my first appointment with you was pretty much ideal, but the second was not. when you asked me if I was having any issues, I was honest. I told you sex was painful sometimes; you told me I shouldn't be having sex. I was seventeen - above the age of consent - and trusted you to help me find the best solution for me, but you just shamed me for the choices I made with my own body. I don't feel bad for finding a new gyno. sincerely, darci", "istartwitht": "Dear Cerazette, I was taking you for 3.5 years and you've mostly been a dream. Except for the couple pregnancy scares you gave me when you started not making me have regular periods anymore. You then compensated by giving me a 6 months to yearly period so I could make sure my body still works. Since I ended my relationship I wanted to give myself a hormone break and thus we had to part. Only once I came off you, did I realize that it was you that took away my spark and fire and not my life experiences over the past years. I am thus grateful to have parted with you eventhough sometimes I miss having you level out my mood swings. The way back into period life was surprisingly easy for which I thank you. Best, Tatjana", "_maisieeemardle": "Dear Cerelle, it was a fun ride while it lasted. You were originally prescribed to me because I have migraines, so the combined wasn’t ideal. You did your ‘prevent babies’ job, which I thank you for, but at the same time, there’s lots of things I hate about you. You made me tired 100% of the time, adding to my exhaustion from lack of vitamin d; you gave me four months worth of periods in just one; and you ruined all my nice underwear. So thanks. Luckily, I’ve moved on to a different, nicer pill that makes my cycle the most regular it’s been in the last nine years. Screw you, Cerelle, I’ve met a real pill! - Maisie, your ex", "flea_on": "Dear Mirena- having you inserted the first time was horrendous, but still no regrets because the 5 years afterwards were amazing and period-free. The second time was painless and another 5 years is nearly up, I will definitely go for a third Mirena. I can’t imagine going back to the years on Yasmin and microgynon when I could burst into tears at any moment, weight gain, acne, incredibly painful periods leaving me immobile. But most importantly- no babies! Certainly contraception isn’t perfect, and still they can be improved, but there are many options. Can you imagine that it was only less than 60yrs ago women didn’t have this right to choose when to get pregnant, and to control their cycles- and in many many countries around the world women still don’t. We’re very lucky.", "natgds": "Dear Mirena Coil, It’s not me it’s you! You had one job, stay in my cosy uterus where my nurse so painfully put you! It’s was never gonna work, your strings were always too long, you made me paranoid, you made me miss work for appointments and even when I knew you were displaced you hid it from the nurses. If you really didn’t want to come out you should have stayed in place to begin with! And even when it was time to part ways you still couldn’t go quietly (read painlessly). I loved the idea of you, something reliable and consistent. 5 years of not worrying would have been great but it just wasn’t meant to be. I won’t miss you, but I don’t hate you. Dear Mini Pill, I’m sorry I ever cheated on you, please take me back!", "nellyrother": "Dear contraceptive, why is so hard to find the right one for my body and mind?!", "nikki_beckett": "Dear Cerazette, I will never quite forgive you for making me feel so low that I spent hours on the bathroom floor, sobbing my heart out and wanting to self harm. I will also never forgive the doctor that prescribed you even when I told her that the combined pill worked for me. But at the same time you brought me so low that I finally sought the help I needed by getting therapy and making my overall mental health mulch better. I resent it but thank you regardless. Not a lot of love from, Nikki x", "lily._.f": "Dear Rigevidon, I only started taking you coming up to 4 months ago but it’s been great to finally have regular periods and normal length cycle! Despite the constant ache in my boobs and horrendous first period you gave me (I don’t appreciate spotting for that long), the adjustment hasn’t been too difficult. I hope you’ll continue to be easy to use. So far, you’re pretty okay!", "abbiekatchristmas": "Despite doing my own research and knowing of most contraceptive options, my OBGYN tried to convince me that the only options available were one very specific brand of pill (which made me incredibly sick) and the nuva ring (which I wasn't comfortable with) after months of arguing back and forth trying to get off of this awful pill, I gave up and stopped taking birth control all together for a year until I graduated and got to see my university doctor last yea", "georgiagraynz": "Dear people who fund contraception research. Please look at the side effects of contraceptions, not just how effective they are. It’s shitty being a woman and having to choose the least-worst option.", "alsullivan37": "Dear Sprintec, Please work. I’m so sick of things not working. I’m sick of not knowing what my body reacts well to and what it reacts poorly to. Also, if you could ask Lo Loestrin FE why it stopped working after 7 years, that’d be fabulous. And why Junel stopped working after only a few months. But you! We had a rough start - constant bleeding for 1.5 weeks isn’t fun for anyone, especially after you’ve already been bleeding for 3 weeks. But we seem to be in a good place now. And I hope you’ll keep loving me like I currently love you. Keep on keeping on, Angela", "megan_lynchx": "Dear the tiny little white pill, You replaced the tiny little pink pill I used to take. You have helped me a great deal. I have stopped fainting on my bathroom floor and finally stopped throwing up every month. I have to go get a check up next month to see how I’m handling you, but the thing is I won’t know how to respond because I don’t know what I’d be like if I stopped taking you. However you have helped me to much for me to stop taking you.", "chrisaa00": "dear cerelle, whilst you were amazing at curing my overflow, why did you make my anxiety turn into mania? I now don’t feel comfortable taking any form of hormonal contraceptives with the fear that i’ll return to anxiety fuelled days. some respite would be gratefully appreciated. Love, the anxiety ball (chrisa) x", "c.duvefjard": "Drar NuvaRing, I really liked you, you were perfect for my need of control (if causes me harm I should be able to take it out myself) but also my lazyness (who can be bothered to take a pill everyday?!) I quit you because I wanted to go natural and because of that I discovered that I have PCOS. Now after 4 years I am thinking of getting back on you, if only to know when my freakin period will be, LOL! We’ll see, Caroline", "its_kaytay": "Dear combined pill, I was on you for over 3 years because my ex and I started needing contraception. I have no idea if it was you or him that gave me depression, but here I am. I’ve even forgotten your name because I’ve blocked so much of that time of my life out, but just know that your sis cerazette is much nicer to me, and citalopram is helping me be nicer to myself. All my love Katie❤️", "crtnylzbthxo": "Dear doctor, I know you were trying to help my angry unpredictable periods when you prescribed me various forms of birth control... but they made it worse and made me sick and I can’t do it anymore... To the pill... you started out great, then came the depression I couldn’t escape or understand. But I started getting better once you weren’t in my life, I wish you hadn’t done that because you worked. But no amount of evenly spaced, slightly lighter periods can make up for wanting to give up on life so I had to leave you... To the patch, you also started out great... until I found out I was allergic to your adhesive and broke out in a rash.... I’d never had a reaction like that before so I tried another month and you did it again... sorry I’m not about that life so I had to leave you behind as well. To the depo provera shot, I hate you with everything in me, you gave me a four month long period, and the worst of my life... I spent those four months putting more painkillers in my body than anyone should have to just so I could function. I have never regretted the day I destroyed my second dose (brought with me to my international internship) it was quite cathartic honestly and I will never look back... To the nuva ring, you weren’t bad, but you didn’t do what I needed you to, you didn’t bring regularity to my periods or make them any less painful, so I had to stop with you too... and nuva ring, you were also the most expensive birth control I tried, which may be why I was so much more disappointed in your abilities... To all the both control I’ve tried before... please leave me alone", "worldofjosien": "Dear microgynon 30, my run with you was great, until you decided not to work anymore and just give up on me. Thank you for all the period-free years because they used to be HORRID before we started together. Dear cerazette - you are not for me and I know that now. My purse also appreciates that a lot. Dear microgynon 50 - Thank you for keeping me safe for all the sperm that entered my body. I hope we can live a long and happy life and you will keep me safe. Thank you cooperating with my acupuncture and not making my periods such a hell. I do not like calling in sick and you make me function. Loads of love, the person who takes you.", "laradavies_": "Dear Rigevidon, thank you for being my trusty companion for the past 6 years and counting. You haven’t failed me, given me spots or caused me mood swings (I think?!) and I love you for it. However, I can’t help but fear that perhaps you have more of an effect on my body than I realise. Perhaps you actually DO affect my mood and I simply don’t know because I can’t remember a time when I wasn’t taking you. I also fear that if I prolong using you, although majorly convenient, will you effect my fertility in future? But anyway, thanks for everything so far. Sorry about the questions, I just worry! Love, Lara. Xx", "emmapwmcr": "Dear combined pill, at one time you were the best thing that ever happened to me. My mood swings during PMS were seriously unmanageable and ruining my life. You gave me regular headaches, nausea, stomach cramps and weight gain so my clothes didn't fit anymore - but all of that was worth it to go back to feeling \"myself\" mentally again. However, we've been together for nearly 4 years now and the mood swings are slowly starting to creep back. Is it time to change you to a different version? Is it worth the risk of worse and more symptoms? Oh I wish you our relationship was the same as it was in the beginning! Who knows how long I'll let you stick around... but for now, I'm too comfortable to try something new. Love (and hate), Emma x", "a_gallant_rhyme": "Dear Nexplanon, You were awful and so are the doctors who put you in me. I was so excited to have an option but did not realized it was forced into me by my gyno. I went in interested in a IUD but my questions were dismissed and was told my uterus was too small and was pushed in your direction. You made me bleed for 3 months everyday. For a year my depression and anxiety only got worse and more erratic. I then got a bill for $1,500 because my doctor's inserted you without having the proper documents for my insurance or had my insurance card on file. You made me miserable both emotionally and financially. I'm glad you are out of my body and I look at the scar you left behind with sadness and regret. Fuck you, Nat", "clarkey.xx": "Dear COCP, I couldn't have gotten through my GCSEs without you so thanks! Love Amira", "forsythkaitlyn": "The pill made me a complete monster! I was so moody all the time, and the side effects were straight up terrible for me. I finally found a gynecologist who listened to me and now I have the Skyla IUD. Total lifesaver. Love it, no complaints.", "gaming_introvert92": "Dear Cerazette. You’ve been a godsend over the past few years. When I first started taking the pill - It was because I suffered with extremely painful, heavy periods, which would leave me doubled up in pain, vomiting & taking time off school. The only thing that stopped this intense pain was the contraceptive pill, the combined pill, but soon I’d learn than I’d have to stop taking it because I suffer with migraines. When I went to my doctor & she gave me a prescription for cerazette, she told me that there was a chance my periods would be irregular, or even stop completely. I thought.. Knowing my luck they’ll just be irregular & a pain in the bum or I’d get terrible side effects. But no - I’m that lucky person & I no longer have to suffer through periods every month. I’m one of the lucky ones & I’m so grateful to have you, cerazette. I found that the combined pill was so much worse for mood swings. I’ve never experienced them on cerazette. After many years of excruciating periods, being bed-ridden & bedsheets that were completely ruined because it seemed there was no pad that was good enough.. You’ve definitely made my life a lot easier & I don’t plan on stopping you anytime soon.", "megseclarke": "Dear, Microgynon. After 3 pills and the depo injection I've found I dont NEED a mood swing in my own front garden in order tonstop myself from having babies. My boyfriend and I are very greatful. Love, Meg ❤", "queenelsa02": "Dear Jaydess Coil, I love you for making me function on my period, and for making it being barely there. I love you for protecting me from an unwanted pregnancy. But I also hate you for the way you ruined my skin. I hate that you gave me really bad acne. I hate that you make me hate the way I look. Can’t live with you, can’t live without you.", "paulafink": "Dear Nuva-Ring, why did you have to take my breath away? I thought you were the answer to a healthy sex life but instead you made me sad, irritable and ultimately loose my breath. Thanks to you I spent all my money on medical stockings, blood thinners and therapy to get my body and mind healthy again. Two years after and I still worry about suffocating from the inside. I’m not sorry, we won’t meet again. I’m better without you. Paula", "chezdaz1": "I agree with @ctlnbrynt above. I was 40 years old when I finally listened to the health professionals advising me to have the coil. OMG why did I not listen before! Could’ve saved myself years of pain with periods actually ruling and ruining me!! Yes they practically had to scrape me off the ceiling during insertion but my god it was worth it!", "jaanang": "Dear science, we're living in a world where cars can drive themselves, where deaf people can hear again, where live can be made in vitro. Why the fuck isn't there any contraception that just does what it's supposed to do? Why do we have to suffer mood swings, bleeding 3 weeks straight, cramps, depression and irregular cycles? There are people flying around in space but nobody can figure out some kind of contraception that just prevents us from getting pregnant and nothing else? I cannot believe this. Love Jana (P.S. And why the fuck do you burden contraception only on women, it's time to figure out something else!)", "madelainerose3": "Dear implant, before I took you my periods were amazing and super regular and now they're a mess. I don't like you but thank you for keeping me not pregnant 😂😂", "thehungrysmoggy": "Dear Cerazette, I know things started off great but, after 6 years, you were no longer the one for me. I'm grateful to you for ridding me of my period pain, but not so grateful for the weeks upon weeks of spotting and irregular bleeding you gave me. I tried going it alone for a little while after we ended, but after only a couple of months of dealing with cramps I turned to Milinette. Things have been ideal ever since and I don't think I'll ever look back", "absolutebabe69": "Dear little plastic implant living in my left arm, we've had a good ride so far and it's got me thinking about all my friends who aren't as lucky as me, an Italian in Scotland who somehow got into teaching sex ed in uni and discovered a wonderful world of possibilities (also, NHS!!!). Every time I mention you to one of my friends back home they're just in awe. A method of contraception you can't possibly fuck up yourself, that's not really that a hassle at all and... it's FREE??? Mindblowing. My body has been craving oestrogen and I have great memories from my days using your friend Diane, so our relationship might only last until the day I need to get you out of my arm, but I appreciate you. I hope the new generation (and my own, for that matter) doesn't get too wrapped up in this whole 'hormones are evil' mentality. In the meantime, I will continue to educate people as best as I can for as long as I can. Love you lots, your landlord.", "_rebeccasarah": "Dear Rigividon, I'm sorry I keep forgetting you. I'm sorry your box is squashed and I'm sorry I blame you for most of my problems. Although, you *are* the cause of the outcomes of most of my problems (yes, I'm talking about the emotions) I hope one day to never need you, but for now, cheers for helping me out with the PCOS", "rach.guy": "I was on the contraceptive pill ‘Yasmin’ and oh my god I’ve never been so depressed in my whole life, as soon as I came off it, it was like an actual wave of relief and now I just use skyn condoms because I’m allergic to latex!", "_jojosaurus": "Dear Cerelle. I hate you. So much. You made me bleed for 3 straight months; I had to throw out underwear, I made myself sore from constant tampon and pad use, I cried at EVERYTHING, the cramps were unbearable to the point where I had to take time off work. Yes, I'm still taking you day after day, but I will be glad to see you go. I know that when you leave it means I'll either be going on to something better for you, or I'll be starting a family. Cerelle, you're making me bleed again. What the fuck is actually wrong with you?! I was prescribed you to stop my random, inconsistent bleeding and periods. You're killing me.. I can't take the bleeding anymore. Cerelle, I hate you. Stop messing with my uterus. Peace out. Josie", "alicebracher94": "I was on the pill for years because of really painful and irregular periods. I came off it about 3 years ago because it was making me so depressed and moody! Still 3 years later I don't have a regular cycle! Wish I'd never taken it!!", "spalisonm": "i used the pill but it gave me mood swings and now i have the implant and i love it! it’s so much easier especially because i was bad at remembering to take my pill", "ellaporter13": "Dear Nuvaring, God bless you. I mean that wholeheartedly. You made my cramps manageable, my period regular, and my flow lighter. Sure sometimes my PMS is a little out of hand, but that's nothing new! Thanks for being simple to use. I'm glad you came into my life. Love Ella", "rayahsunshine1": "I love my birth control. I have pcos and possibly endometriosis. It makes me feel like a normal person, works to help me regulate my weight, works as an antidepressant, and makes me feel like I can get through the day. What I don't love is my limited access to it because I am an American without healthcare.", "fr3.ya_": "dear cerazette, where do i begin? doctors prescribed you as a way to help relieve my PMDD symptoms and help me get out of bed in the morning during my 2 weeks of hell. alas, no help. my depression got worse and you did nothing to stop the bleeding. you’re about as helpful to me as sandbags are to the sahara desert. when the fateful day happened and i had to rely on plan B even though i had you, you brought shame to this family *cute game of thrones bell SHAME*. we have parted for now and the pains are back. crippling migraines, back and stomach pains. don’t we all love feeling like we have a machete in our abdomens ? i will keep powering on without you but thank you for showing me the other side of not crying because BODY ANGRY NO BABY. love, freya :)", "honeyflickr": "Dear Evra Patch, thank you for making me get regular periods and for making me feel calm and chill about having sex. thank you for not completely messing me up even though i was only 15 when i started to use you. thank you for clearing my skin and for being so damn practical to use because let's be honest, id forget to take the pill on day three. But damn you for making nobody believe me when i was feeling depressed because \"are you sure it's not just the hormones? don't you wanna try and go off the patch before you talk about feelings??\". So thank you for your services, but not for the stigma surrounding you and other birth control in young people. Love, Hannah.", "luisa.hempel": "Dear company that makes my pill, what did you do to it that it suddenly tastes so weird? 🙈 I realised that something was different when I opened a new box and saw that the font for the days looked different. But apparently you did not only change the packaging! Before the pill tasted not much of anything, maybe slightly sweet. But now it has a rather weird taste. And now everyday when my phone reminds me to go take it I feel a bit appaled and disgusted by the thought that I need to swallow that pill. That's rather inconvenient for something that's very important to be taken regularly! 🙈 so what do I do now? Change the pill just so that I can have a pleasant or even neutral experience swallowing it again? This particular brand works fine. I don't have any serious side effects which makes me very happy. I don't want to get another pill. But boy, does my contraceptive taste bad now 😣 please change it back, dear pharmaceutical company", "_sazberry": "Dear my mother, and other people; taking one of the many forms of contraceptive pills will not render me infertile, even though you have heard stories about other women who have trouble conceiving but easily could have been on other pills. I appreciate the concern, but really it's ok. I'll be fine. And to Microlite, thank you so much, you are an absolute life saver. Love, Sarah xx", "katehilton98": "Dear Gederel. I had the worst year of my life whilst I was taking you. My nurse said you would be better for me than my old pill (Lucette- I still love you) but she was wrong. I was fainting if I didn't eat every few hours, I felt sick, I got varicose veins, I had horrendously high blood pressure, I had (what I thought was) a miscarriage and ended up in a+e at 3am crying because of you... And yet my nurse STILL didn't make the connection between you and all of my symptoms. I'm convinced if I hadn't stopped taking you, I would have ended up with a clot. Since stopping you, although my skin broke out horrendously, I'm so much happier. I have a clearer mind, my blood pressure is normal, I no longer feel faint or dizzy all the time. I'm able to keep my weight at a good weight for me, I no longer bloat due to all the extra food I had to eat, and i feel less tired. So to you Gederel, I say a big fuck you. And to the mirena that I had fitted 3 months after you, I say THANKYOU for giving me back control over my hormones, my fertility and my life. Although I'm still breaking out, I feel freer than I have done in years💜", "staceyjane_s": "Dear Microgynon; we had a good run. You came into my life when I was 19, when a pregnancy scare with a boy I'd just met urged me to the Dr. I thank you for all the holidays you've saved by letting me have some control of my previously erratic periods, and for once helping me to understand my body. I thank you for being relatively symptom free for the first five years, but I guess you didn't like that I needed a break. A year without you revealed hidden PCOS, and that I have 6 cycles a year rather than 12. The Dr told me to take you back, that I needed you to be regular again and so I obliged, but this time you were not so nice. You made me feel like a lesser version of me, like I was walking around under a cloud. You made me nauseous, made my brain ache and I just wasn't myself when I had you in my system. So once again we have parted ways, after a year of trying to make it work. I hope I don't need you again for a long time, and I hope that if I do that you are kind to me once more. But until then - thank you.", "chloerixson": "Dear Cerelle, We became friends when I decided I rather enjoyed sex but didn’t fancy getting pregnant and wasn’t completely confident with only condoms. Turns out you’ve been very efficient at preventing pregnancy, but have also done me a massive favour by getting rid of the stupidly heavy periods that used to remind me of Niagra falls with dye! So yeah, thanks for saving me a fortune on tampons and helping me avoid spawning a mini me! Love, Chloe xx", "its_alice1997": "Dear Yasmin, You were great the first couple of months but after a year and a few months I was done. I loved you gave me regular periods which I never had but the pain was horrible to the point I couldn’t move and feel sick plus I was a ticking time bomb with mood swings to the point I was rethink my relationship with my BF. Now I have the implant with is going great 😊", "honeydaengdej": "Dear doctor who gave me birth control,  I understand that it was for my health. I have hyperthyroidism.. it messes up my hormones and makes me not get regular periods. I get it. This helped my body function properly and that’s why you prescribed it to me... But I was so young and I was living in a country where the stigma around sex and sexuality was so present. When a sixteen year old girl (who quite frankly looks 14) picks up her contraception at the pharmacy... or pulls it out of her school bag to take.. people stare. I didn’t like how people stared. I wish you took that into account when you decided to give it to me. Thanks for trying to help though. I’m actually doing quite well with managing my thyroid now and my periods are super regular without the help of contraception. Best, Honey", "aquakerwitch": "Dear nurse who prescribed me the pill, thanks for letting me have it even though I'm \"overweight\". I'm so glad I'm not too fat to be on contraception 🙌 Yes, it was amusing that I'm 4 foot 11 and 11 stone 4.", "samskie88": "Dear Cerazette, I began taking you 5 years ago after they finally figured out the combined pill was causing my headaches, and I have not had a period since!! They tell me every year this is absolutely fine, although it did scare me at first having no visible sign that I was not pregnant. I have now grown used to it, and honestly don't know how I would feel if my periods suddenly decided to come back again! The last one I had was so painful, bent double at my desk, going dizzy. So thank you for stopping the monthly ordeal! I do feel like I'm missing out on a part of being a woman though, and cannot relate to my friends anymore who share period stories and mishaps. I am thankful though as you seem to be working fine (touch wood). No stomach cramps, monthly acne, boob pain or mood swings (I'm just moody anyway). So yeah, thanks!", "mataulvr": "Dear alesse, you are dope. Thanks for making every period start on a Wednesday and end on a Sunday. Thanks for helping out with some stupid choices I made and thanks for letting me explore with out certain consequences. Next year though I'm ready to let you go. I'm ready to start a family but I am so thankful for the time you provided me.", "maggie.and.cheese": "Dear Introvale, thank you for making my doctors think I'm pregnant when I say I haven't had my period in three months. It's fun! Thanks for being the ONLY pill on a three month cycle and confusing people. Thanks for making my periods almost painless and so light I barely use two pads a day. Introvale... You rock!", "heidiwells_": "Dear endometriosis with fibroids, my final diagnosis. Years of pain, heavy periods and unknowing I can finally put a name to the condition that beat me down every month! Countless drs appointments, numerous contraceptions, scans, surgeries and now we’re here. Monthly injections into my stomach and more surgeries to come. You took a lot from me, my endometriosis, my energy, my time. My life became a constant need to find a loo to change my pad or tampon, or when the time had finally passed to take more pain relief, but now you want to try take away my fertility.. I’m sure you’ll fight for it but you won’t fight as hard as me. Until the next post, my endometriosis, from and always will be Heidi.", "jerome_meunier_": "Great shot still beautiful", "meg_george": "Dear pill, You have helped me in many ways from stopping me from being pregnant to easing the pain my cramps used to give me. You have never given me trouble! Keep it up! Meg", "cataagallo": "Dear Gianda, I started using you 10 years ago when I found out I had PCOS and was told I’d have a hard time getting pregnant... I was too young to fully understand and wasn’t even thinking about having kids. Now this new doctor tells me it makes no sense to want kids and give my body something everyday that tells it I don’t... it might be time to let you go. Thank you", "lu.m.j.p": "Dear Cilest, you gave me nausea and then made me vomit twice in the first 3 days, then gave me 3 horrendous migraines accompanied with a lot of vomiting and nit being able to see for long periods of time. Cerazette , on the other hand, you are wonderful- thank you", "sioned_morfydd_": "Dear Millenette, I take you everyday but you’ve made me gain weight and you make my acne worse not better like my doctor had said. But you’re doing great as a contraceptive so thanks for that part, pms and migraines aside. You’ll do for now xx", "thatlauralouise": "Dear my implant, I haven't had you for a year yet, but thank you for being the one for me. In February I walked into my local sexual health clinic to have a conversation about contraception options, and I walked out with you in my arm. You haven't affected my emotions negatively, you've slowed down my periods and fixed my cramps. I barely notice you're there and I'm so grateful to you for protecting me. Keep doing what you're doing. All the best, Laura ❤️", "georgixox0": "Dear microgynon we met when I was 13, i always felt ashamed of you, you always felt like my dirty little secret and in hind sight maybe us meeting could have waited a few more years. But here we are now, I have made my peace with you and my body, thanks for everything, love Georgia", "rekhagarton": "Dear Cerelle, you've been ditched by the doctor and I've been given back cerezette today out of all days ironically. Thanks for the changes in periods, black hairs and unusual headaches but I'm welcoming cerezette back with open arms.", "annaherridge98": "Dear coil, I still don’t know if you were the right move for me, we’re six months into our relationship together and to say we got off to a rocky start is an understatement. After our first attempt together with you giving me pelvic inflammatory disease leading to sepsis and hospitalisation, its a miracle I didn’t break up with you then and there. And even now while I’m receiving therapy for the PTSD you caused me and the anxiety you’ve given me, I’m sticking with you in a hopes we can work it out. Please just control my cycle and pain while I’m travelling the globe next year, take care of me like you should do and cause me no more pain. I’m sure we can work this out x", "beth_tto": "Dear cerazette, please stop making me feel like utter crap on the first dah of each pack! I don't enjoy crying for no reason! And the two week period kind of sucked... But the doctor told me it might settle on a few months, so heres to hoping we can have a better relationship! From Beth", "cierajaneb": "Dear Cerazette, you were the first contraceptive pill I ever took and 6 years later we are still here, I’m so glad you were the first I tried and you caused no trouble. I haven’t had a period in 6 years (which I’m thinking I may need to change soon, don’t feel like this is good for me) thank you for the lack of babies I do appreciate that for now (despite the many scares) love, Ciera x", "beth_metal": "Dear birth control, please stop giving me migraines and making me ill. I don't want kids but constant migraines isn't the compromise I wanted. Get ya shit together, love Beth xox"}