{"madgie.smith": "Dear endometriosis, let me have my life back. I have had you removed from my body, because you are not welcome here. You have caused me so much guilt, pain and trauma and I have had enough. Please never return.", "kizzybean07": "Just a comment on your recent insta story, I'm so happy subtitles are available on insta and youtube. Means i actually know/hear what people are saying, rather then guessing. Sometimes lip reading is difficult if the person keeps looking away. Wish all youtubers/instagram peeps did this. I get put off videos if i can't hear or understand them. I'm fairly deaf so find it hard to hear certain things. 💛", "kirsten14x": "Dear PCOS, It took 5 years and a move to uni of begging a doctor to run the tests to confirm a diagnosis of something I already knew I had long ago. At 22 I shouldn’t still have severe acne nothing I’ve tried seems to control, I shouldn’t feel like I can’t leave my room without makeup and I shouldn’t have to beg for my condition to be taken seriously. No one told me that having type 1 diabetes and you were linked so lord knows if I would have ended up half dead at 17 with severe DKA, due to undiagnosed T1D, had I been diagnosed with you sooner. What I do know though is with things like this people like me are becoming more visible and maybe that means one day it won’t make me feel like less of a woman to be covered in hair or to maybe not be able to have children. Thanks to Hannah it’s easier to talk about these things now and although I’m not grateful for you PCOS, I am grateful for you giving me people like Hannah to help me along the way. Sincerely, Kirsten.", "nadiarrussell": "Dear Painful Bladder Syndrome (PBS), I do not appreciate the fact that I thought you were a persistent UTI for about two years. Nor do I appreciate that you decided to re-emerge only weeks after I had a cystoscope and hydrodistention, that was meant to prevent you for longer. You make eating terribly difficult and sad when I can’t eat what i want because it’ll make me pee more. I can no longer cope with less than 7 hours of sleep, and the second my stress goes through the roof, all I want to do is pee! And a combination of all the above (which more often than not tends to happen when I’m overworked and run down) is a real misery. Not to mention any sort of travelling overseas. Jet-lag may not be a bitch, but you certainly are. No regards, Nadia.", "themirsalazar": "I have PCOS and on this particularly bad day I was working and told my boss I had to go home because I was really not feeling well because of my period. He then made fun of me telling me to stop being dramatic and \"every woman goes through this that's no excuse\" I went home anyway cause fuck him by the time I didthe pain was so bad that I proceeded to vomit everywhere in my bathroom and then passed out from the pain until my mother came and found me a while later", "jesspenhallow": "Dear Mooncup, Thank you for rescuing me from UTI hell. Before you I felt crappy for two weeks a month from my period followed my the inevitable UTI. I wish I had known that those pesky tampons were the cause. And I'm sure my cramps have lessened too.", "womanbehindabook": "Dear fungal infection, Every time I think it’s the last time and I can get comfy wearing sexy panties... well, there you are again, reminding me that I’ll be forever doomed to 100% cotton lest I want to see yeast outside of the context of bread. And yes, it’s because I’m on the pill, so I have more of a propensity for you, but really? I was on Vagi-Fem (usually prescribed for menopausal women) at age 18 to prevent your nonsense... 6 months of awkward 3-weekly up-the-vag injections... yeah, fun. Thanks for that. But really, thank you for getting better now that I’m on a milder pill and only acting up when my underwear gets a bit too sexy. I suppose only getting that awful itch once in the past 4 years is a record🤷🏻‍♀️ But really, don’t feel the need to pay a visit again. I’m eating yoghurt, wearing cotton and (mostly) using plain soaps. Be kind. Xx Alex", "hannah_love1999": "Dear PCOS, I have had enough. Not knowing when my period is coming. Not knowing how heavy it’s going to be. Getting nervous every time I got of a chair. Not knowing how long my period was going to be 5days or 1 month. Spending so much on sanitary products. The hair, it’s everywhere and it grows so fast and it’s so dark, on my legs, arms, face. It’s hard not knowing if I will have kids or how to explain to a new partner that I have PCOS and not knowing if I can have children. PCOS I have you. I hate you but I will have to live with you", "orossetim": "Hi, folks. Doin' good? I am from Brazil and want to exchange experiences with you guys. Would you accept me? #Hannahlover 💜", "elliemaysletters95": "I get cystitis quite often and last year I was suffering from it but trying to get on with life...I was almost home from some shopping and suddenly desperately needed to pee...I had to go in the lift to the fifth floor and then I couldn't find my keys and as I stood on the doormat outside I just peed myself....straight through my leggings and all...and when my mum asked a few days later what the stain outside the door was, I told her I had no idea 🙈", "crazy.breathlessly.collected": "Dear ignorant doctor, I know I'm only 15 but I have had sex so when you tell me that you don't want to test me for a std because I'm too young but maybe if you had I wouldn't be in this mess right now", "sophietalbutt": "Dear PCOS, You made your first appearance when I was 13, nice timing, thanks for that. You made my life hell, making me feel different, giving me acne, excess hair, dark patches of skin that made people think I didn't bathe regularly, painful periods that would arrive without warning (if they ever arrived), endless doctor's appointments, the not knowing if I will be able to have children, etc. But, 8 years have now passed and I no longer hate or fear you. You are a part of me that I completely accept, which means you no longer control me or my life. You have made me grow as a person, learn to accept help and support from those around me and have given me the opportunity to be part of a wonderful community of strong women. I wear my teal coloured ribbon with pride. All my love, Sophie 💖", "liz_art_illustration": "just wrote a comment on your blog! 💚", "bryonyswilson": "Dear thrush, why do you make my vagina so temperamental? I can never use bubble bath or fragranced shower gel. I have to make sure my clothes are washed with the same powder and ALWAYS an extra rinse. I can't wear jeans too often. And WHY? Why did you hit me as I was recovering just after giving birth, as if my vagina hadn't been through enough! Regards, Bryony", "josie_pointer": "Dear PCOS, thanks for making it difficult for me to lose weight. Not enjoying the people who shout at me about how fat I am (6 in the last month). P.S. IBS, you can go f*@k yourself 👍", "derangedpoetess": "Dear endo, I feel you in that familiar tearing sensation keeping me up at night. It was a dream to let you go a little these last few months, to regain an identity outside of your pain. But I also always knew it was temporary, just as I know how these pains will come and go, and then come and come and come again. This time we will work together. I am ready for you. - Eileen", "seedsinthewasteland": "Dear PCOS, you know, sometimes I'd quite like to have my period. To know when it's coming. To not suffer the hormone fluctuations caused by missed periods that directly impact my already poor mental health. I don't want to control periods by going on the pill (see aforementioned mental health: it didn't work out well). I'd like to know whether you're going to make it difficult for me to conceive. I'd like to know why doctors say my hormone tests are normal, but that I 'probably' have you, and then don't offer me anything else. I'd like to know if you're causing me to suffer vaginismus by your position or your level of cystic-ness; it's happened before. Incidentally, whether related or not, I'd LOVE to know why vaginismus has chosen to plague me, making an already difficult sex life (hi depression and anti depressants) even more so. Knowledge is power, but you're eluding me.", "kerrianne.marie": "Dear doctors, telling me my menstrual symptoms that are impacting my life are either not symptoms or just coincidental even though I swear they are connected does not help figure out why I have these symptoms nor does that treat them. Same goes with writing off my pain as ‘normal’ and common when it is a problem for me. That only makes me feel like my pain doesn’t matter and I’m not tough enough to handle it (even though i have a pretty decent pain tolerance due to 10 years of this stuff). I’m glad I have a good friendship circle that supports and understands my symptoms, because I know I’m not alone in this fight to be taken seriously. And Dear Cysts, you came almost as soon as my period first started, don’t you think it’s been long enough? Birth control was supposed to help get rid of you and yet you stick around. Almost every month you cause problems for a few days. Some times you’re nice and just bring slight discomfort. Others you bring appendicitis-like pain and symptoms. Can i get a restraining order for you?", "coolhappygenius": "Omg the bit about UTIs 😂", "ebony.lauren": "Dear PCOS: Can I please just have one normal day. Just one. A day without pain, or spots, or a beard, or diarrhea. A day where I'm sure I know what's going on with my body. A day where I can feel feminine. A day where I can feel comfortable in my skin and not like a frumpy whale because you won't let me loose weight. A day where I can go to work without a hot water bottle. A day where I can feel sexy, and intercourse won't hurt. Talking of sex, it would be nice if I could take a contraceptive pill without you making it hard for me and making me try pretty much every pill on the market (just for you to dislike them all). Could you please let me have a normal, regular period so I can sleep naked again and not have to wear sanitary towels every day just in case you decide to open the floodgates. When I'm on, I'd appreciate a normal flow so I don't have to wear nighttime towels from day one, or have to empty my cup (with towel backup) every hour. I'd appreciate it too if I could have a period where you don't make me feel like I'm actually about to die. I wouldn't even mind the cramps you bring if you told them it was just a week visit. They're not wanted every day. I'd also appreciate it if you could let me get pregnant one day, without giving me miscarriages - you know how much I long to be a mum. I just want a bit of normality, PCOS. I think you and I could be friends, if you only compromise a little...is that really so much to ask from you?", "e11iam": "Dear UTI, i had you for about a year before you gave me a kidney infection before my final uni exams which landed me in hospital. Everyone laughed at me when I said my kidneys hurt (to be fair, I'm a bit of a hypochondriac), and when the horrific fever set in I managed to convince myself I had Lyme disease (lol), before being diagnosed with a kidney infection given to me by a complication from a longstanding, certain antibiotic resistant uti. UTIs are an endemic part of many people's lives and are often so badly understood by people who don't have them (people w penises not realising the struggle us vulva Havers experience, wow big news), just like endo, periods and many other things. They are dismissed and mocked and it's not fucking ok. Sorry for ranting!", "craftedlearning": "I'm looking for good resources on endometriosis because most things on the internet regarding this 'mysterious' illness makes me scared and sad.", "oo7shiva_connection": "You all tha time trua late", "kateee2610": "Cranberry juice and chronic Uti’s are a big no no!.. love, someone who has chronic bladder infections", "sallyjofrench": "Dear UTIs, Getting you every time I have sex with a new person is this weird indicator to myself about how many people I sleep with. It’s like my body is telling me that this dick is unclean (and I am pure) and my provider is telling me it means I am unclean. What the hell UTIs I am neither pure nor unclean and i can fuck however many people I want to! Quit trying to tell me otherwise!", "saraoliviagrace": "Dear yeast infection, Like seriously, you again? I thought that we had an agreement. I did the thing, you went away, end of the deal. I’m so tired of putting things in my vagina and not getting any pleasure from it. Speaking of pleasure, how long are you going to deprive me of good sex? Honestly, it’s been too long. It’s time for you to go.", "whyaliceofcourse": "Dear thrush, we haven't spoken in a while, but I'm glad. That year and a half that you plagued me was awful. I hate a low carb diet despite my love of toasties and rice and you still didn't go away. I took all the meds and you still didn't leave me alone. I did everything right. And then one day you disappeared. I'm not sure what I did (it wasn't the lombucha and water kefir, was it?!?), but I'd like to know so that I make sure I never see you again. Love, Alice", "anosetoiles": "My friends who both experienced recurring UTIs and were frustrated with medical response created this amazing website: https://liveutifree.com. Check it out!", "ratcats_": "Dear repetitive utis, piss off mate, cheers. Love from kay", "missmichelle.lynne": "Dear UTIs, I know my ex & I broke up for many more reasons, like he is a narcissistic psychopath. But having you show up just about every other week really stressed the relationship too. For the four years of it, I felt like I was constantly trying to balance my health & saying no to the sex he wanted sometimes 5-6 x/ day with trying to keep him happy/ not punch holes in the wall bc he was so frustrated. You made me view sex as just something that would eventually lead to intense pain, even if it fleetingly felt good in the moment, it felt not even worth it... especially after the kidney infection & my subsequently being terrified of that pain coming back again, not even being able to have my eyes open bc the pain & nausea was too much for my brain to process... for a week straight & almost having to go on fmla at work. Oh & having to take huge cranberry pills everyday & drink first a gallon of water everyday.. & then when that stopped working a gallon & a half everyday... yeah that sucked too, trading the pain for a constant stomach ache from all the water, all to try to not be on a steady stream of antibiotics forever which would then give me yeast infections. Oh & then having some dumb male Dr trying to tell me after I've had literally dozens of these that well bc I fill up my bladder every hour they can't really count frequent urination as a symptom & asking me what am I feeling to see if it's actually a UTI... like hello my regular Dr has a standing lab test for me once a week so that I can automatically get the antibiotics, I know I need them this time.. 😓", "lilehlow": "Dear PCOS, you have made me stronger. Because of you I eat better, I workout harder, I drink more water, I no longer give a monkeys about the hair on my face and well just about everywhere else!. You have cost me money and time on laser treatments, private doctors and medication but now I wouldn't want you gone, I like you here. You make me better, fitter, healthier, STRONGER. You're a pain but I don't want you to go, Lily x", "axxcia": "Dear me, wanting to be able to leave the house while bleeding is not asking for too much. You don't have to be satisfied with not passing out from the pain. You deserve better. Call your damn doctor and tell her this treatment isn't doing enough", "colourpop_": "Dear PCOS, you unbalance me. Before you, I knew how to talk to my body. I knew how to listen to her. What she needed. I harmonised life with my body. Now we barely speak the same language. I'm listening to cryptic messages from a friend I once knew. A friend I miss. You unbalance me. These symptoms that doctors do not believe, these symptoms that overwhelm me, put me in pain. These symptoms that cannot be cured, only endured. I am exhausted. My back hurts, my stomach hurts, my head hurts. Cramps, amenorrhea, bloating. I feel as though I have been invaded, infected, overtaken. I miss my harmony. I miss my friend. Please leave. Yours in good faith, Caitlin", "loulou_laus": "Dear pelvic organ prolapse, you were the price I had to pay for having babies. My first kid was delivered with forceps. And it ripped my pelvic floor apart. Unstitchable. Unfixable. Now my organs sag down. My bladder, my uterus, my bowel. Causing pressure in my vagina. Making it hard to stand and walk and the symptoms progress and get worse during the day (yay, gravity!). Every day. I am not allowed to jump or run or lift heavy stuff anymore. Also wouldn't even want to since I suffer from stress urinary incontinence too. I always believed in natural birth and that our bodies are made for giving birth. But now I'm not one of the lucky ones. And my vagina will never look or feel completely normal again. Pelvic organ prolapse, you sometimes make it hard to love myself, because you make me feel so uncomfortable. Also people don't understand why I don't run around with my kids, or lift them. Or dance. Because I look perfectly normal on the outside. And many women don't even now that this can happen. I was one of them too. I believed that if I just do my pelvic floor excercises aka Kegels I will be fine. Now I know, it's just not true. Your pelvic muscles can even ripp off from the pelvic bone and no amount of Kegels or physical therapy can attach them back. And there is also no surgery which can really fix it. Surgery is all about reducing symptoms. Not making a woman whole again. So my life is now all about trying to accept my limits and trying to be happy with what is left. Which is easy sometimes and other times hard as hell. Dear pelvic organ prolapse, may awareness be raised and stigma decreased. Because according to research, one in three women who have kids will suffer from this condition, either directly after birth or later after menopause. Would love to see more about pelvic floor health on women's health topic channels. Because it is such an important topic and still soo many women are ashamed because of it and won't talk about it in public. And still many don't even know about it - yes, your vagina may actually literally slip out of your body. We need a change. We need more knowledge about pelvic floor health. Thanks for reading. :-)", "thisbekayann": "Dear undeterred problem, It has now been 348 days since I last had a period. You are frustrating, you leave me every month having to take a pregnancy test. You also leave me having to confuse doctors and test givers about what to do. You are making it harder to get my health looked after. Doctors just stare at me when I tell them about you, they dont understand what's going on with me, they blame my weight for what you are doing to me. Please kindly return me my periods, because the worry you put me through is worse than bleeding 5 days a month. Sincerely, Kayla", "ellietaw": "Dear UTIs you are extremely painful and can make work life/life in general really difficult, why do you punish us for having sex 🙄 I have found that drinking lots of water in the day can help keep them at bay (and it’s good for your health anyway) but all bodies are different. Big hugs to anyone dealing with any of these diseases, my friend has had endo for 10 years and has really suffered she’s so strong I don’t know how she does it. Amazing! 💜", "canibeadiamond": "Dear endometriosis and adenomyosis, thanks for leaving me in constant pain. Thanks for making it so I have to fight drs on the fact that I know my body better. Thanks for making me have so many issues with what I can and can’t eat. Thanks for making my skin break out constantly everywhere. Thanks for leaving me completely exhausted but with no other reasons apart from being in constant pain. And finally thanks for putting my fertility into limbo.", "meisenbachsr.roberto": "🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆", "eleanors_moon": "Dear Thrush, although I'm beyond lucky you're the only issue I've ever had down there those two years I felt like I had you constantly where horrid! Ill never forget that day I had to catch the bus and walk in the rain to the doctors crying because it hurt so much. But there was also that great time when I made a pharmacists super uncomfortable because I was talking to him about sex and vaginas. Despite that I hope you never come back. Best wishes Sorcha", "megantheluminous": "Dear Vaginismus, we need to talk. We've been with our boyfriend for more than four years and we still haven't had penetrative sex. We are 22 years old and have not successfully had a vaginal exam without full anesthesia. Please do me a favor and vacate the premises. Love, Meg💜", "anasazilevy": "Dear PCOS, vulvodynia, vestibulodynia, and IBS, even though some days you are all I can think about, I will never let you define me. Even though I will continue to fight you, I will love myself for everything I am despite you. I will turn the challenges you give me, from not being able to wear jeans, or ride a bike, or have sex how I want to, into opportunities to live a life that requires creativity and resilience. And I'll know that a lot of days I won't feel this positive about you, and that's ok too, because if I (and all the other amazing people who are battling these conditions) have made it this far, there's nothing you can throw at me that is going to hold me back.", "lauralouandwinnietoo": "Dear PCOS, thank you for instilling tenacity in me. If you weren't so mysterious and elusive, I never would have had to learn to assert myself and make my views heard. Also, thanks for the acne and the weight, because it took having them for me to learn not to give a shit. Also, the beard is low-key dope. Thanks for everything. Xoxo, Laura", "cocopintura": "@alexdesmerveilles", "lottieround": "Dear Thrush, Thanks so much for sticking around... I understand my PH is off before and during and afted my period. But that gives me 5 days of freedom from you. Except you like to pop up during those days if I've worn jeans or tights too long. It's almost winter. My legs get cold. I can't always have bare legs. You've stuck with me since I was 16. I'm now 22. I've had all the pills I can to get rid of you. I've done all the \"home DIY remedies\" nothing works. I've even seen a gyno. You still seem to stick around. It's not fair. You interfere with my relationship majorly. We often fight about you overstaying your welcome. I'd just love for one single month. To not have you come to stay. Sincerely, your best friend Lottie 🙃", "jmcosmos": "The recommendation for cranberry juice is v.v. suspect ... data doesn't really bear it out. Far better is to take D-mannose supplements, according to my urologist.", "ashleeyoungblood16": "Dear PCOS, I spent a lot of time telling myself it would be okay, with the reassurance of doctors. Sure, I would have to live with horrible periods (if my body even bothers to have one), lady beards, and being overweight; I accepted all of this. Five years ago, after countless surgeries, you took away my ability to have the one thing I wanted most in this world - children. You robbed me of my hopes, dreams, and faith yet I still have to live with you every day. I wish I’d never met you. - Ashlee", "livrookyt": "Dear Thrush, I’ve quite frankly had enough of you now. Can’t have nice warm bedding in the winter, can’t have my electric blanket on for too long, can’t have a really warm bath, can’t. even. wear. tights. And all because of you?! Wow you have some nerve bitch.", "imaginary_adventure": "Dear Glandular fever (mono), you are one ruthless fucker. I hate you with a burning passion. But despite your plans to completely fuck up my year, I graduated with a distinction. Lose my number because I never want to see you ever again.", "daisy.twizell": "Dear UTIs, can you like... stop? We’ve had this on-and-off thing going for so long, and it is *exhausting*! You must notice I’m avoiding you; this clinginess is awkward for everyone involved. Staying cuddled up for a little longer *one time* after sex isn’t a sign that I want you back. Have some self-respect and just let this go - it’s quite literally an unhealthy relationship. Thanks, Daisy x", "danceinjoy": "Dear PCOS, I wish I had met you sooner. I spent my teen years thinking I was broken or a monster for all the dark hair, for the non existent periods, for all the unsheddable weight. We aren’t very good friends, but I wish I had known what was making me sick before developing body issues. I wish I didn’t have you, but I’m glad I met you. -Katie.", "mackalainesrose": "Dear Endometriosis, I’m sick of you hurting me and ruining my chances of getting better. Every time I make an effort to get my life where I want it to be you come through again and cause pain and in turn heartache and make it harder for me. Because you’re invisible to everyone else people don’t believe me. You make me feel sick on journeys with friends and stop me from letting people back in after depressive episodes. You helped contribute to my chronic pelvic pain and you’ve not only made be uncomfortable and sick but you’ve ruined relationships with those around me. You put me at risk of getting addicted to opioids because that’s all the hospital would give me for horrible pain. You continued to make my pain worse when my partner joined “our” life and he feel guilty and upset if he hurts me too now. It’s all your fault and I wish you would give me some space.", "k.r.y.s.t.a.l_g.r.a.y": "Dear PCOS, You almost killed me this year. You made me take birth control to control my unwanted facial hair, my weight and my periods but instead i got multiple blood clots that caused me to be rushed to hospital and spend 4 days. I am no longer allowed to take anything with estrogen, so managing my PCOS symptoms feels impossible. Being overweight (or obese according the bmi chart) plays a huge role in my self esteem. I hate mirrors, I hate shopping,  I hate having my photo taken.  I cannot have my own children and the depression that comes with you is crippling", "sabrina_haake": "Dear doctors , no I wasn't just a late bloomer . I struggled with undiagnosed healthy conditions that left my body so weak and malnourished that it simply couldn't deal with puberty .", "tayherbertsonn": "Dear PCOS: thank you for secretly giving me a reason to not give birth. I dont want to do it, and given that i will likely have fertility issues, i now have a \"socially acceptable\" reason not to push a human out of my vagina! Yeet!", "dragonlording": "I have PCOS and have known since I was 15. I didn't realize what a privilege this was, to have this diagnose, until very recently. My doctor at the time heard me and suspected what my problem was right away, though I felt at the time, I was too young to start taking hormones and she respected that wish. Again, what a privilege. Two years ago I got fed up with my symptoms, PCOS makes me have a lot of hair growth in a lot of places I dislike, I asked for my doctor at the time for a solution. Her answer was: strong hormones. Turns out that doesn't work for me, I gained weight rapidly, my boobs doubled in size and my legs started to swollen up regularly. At the time, I didn't realize that could be due to the pill, I went to a orthopedist, who told me my problem was being overweight and suggested a diet - yeah. So, as an experiment I stopped taking the pill, and wouldn't you know, all the symptoms disappeared! Right now, I'm not taking anything, I find it simply too dangerous, but I also don't have regular periods and still have hair growth issues, as well as a slow metabolism", "hawleyae": "Dear HPV, after having a LEEP procedure 2 years ago I thought we had broken up and was grateful. Last year you snuck back into my annual screening. While I admire your persistence I would be ever so grateful if you left my cervical cells alone this year (and every year).......... dear immune system, please do your best to kick OUT the pesky HPV virus from my cervix. While it might be fun to have some guests hanging around in the short term I would be so grateful if they were cleaned up before my next annual exam. While cervical cancer might seem like a a way to prove your an over achiever always taking on more than you can handle I'm not sure this is a challenge we are up for. Love, anna", "georgiagraynz": "Dear (male) Gastroenterologist, thank you for being a big picture doctor who treated my IBS so successfully, encouraged me to try going non-hormonal with my contraception, and advised me to get the copper IUD put in while I was still on heavy anti spasm drugs for IBS. Thank you for understanding that my IBS symptoms are worse around my period, and for giving me the tools and knowledge of how to manage better and be more in charge of my own body. #legend", "cami_pnt": "Dear PCOS We first got acquainted when I was 16. Well I say that but the doctor didn’t actually explain anything about what was happening, only told me to take the pill and all would be good. I didn’t take it and I am grateful for that. It was after I turned twenty that I decided I wanted answers pertaining to why did I sometimes not get my period for over 3 months. The doctor I saw then explained to me what was really happening in my body. And I am now taking médecine that basically suppresses any male hormone in my body. (But only after I spent 2 months on the pill and gained 15 kgs yikes) So PCOS. There’s a few reasons as to why I want to tell you to fuck right the hell out of my body : Making it extremely difficult to loose weight, even a couple of kgs. Making my period sometimes very painful. Making it harder for me to have children but easier to get diabetes. Making my cycle extremely unpredictable : will it last 15 days ? Will it last 28 days ? Will it last 41 days ? Nobody will ever know beforehand. And a pattern must never be revealed. I hope that in the future someone will find a cure and eradicate you. Sincerely, Camille.", "feetthattravel": "Dear Fibroids and Endometriosis. It only took about 6 years of doctors visits for someone to actually listen to me. For someone to realise there was a problem. Thankyou for making my periods the worst week ever. The pain is real. The pain is very,very real. You suck. Wohoo to finally be getting it sorted though! Not going to miss you. Love, Lily-Rose xx", "xrandomprincessx": "\"Dear UTIs we have only met twice back to back and it was horrible. The pain was unbearable but no one beliving my pain was suffocating. Relatives making it about themselves oh \"I had that pain as well jusy take painkillers\". Like no cousin brother unless you have a vagina I know for a fact you have never had this pain nor will ever understand it. Painkillers did not help me but bless who ever made hot water bottles. Female relatives dismissing it and saying \"oh you need to lose weight it's because you are fat\". Like this intense pain is not from \"gas\" or \"from sitting all day\" or \"because of all the fat surrounding my stomach\". It took going to a walkin in clinic in tears caz I couldnt handle the pain or be told again to call back tomorrow at 8am. The female doctor took one sad look at my hand clutching my lower stomach and said \"I think you have a urinary tract infection\". I thought only sexually active people got it but nope virgins can get it too. UTIs you might have gone for a week and then come back with a vengence but you taught me my body works so hard, is so strong and badass. What hurt the most wasnt your torture but the misunderstanding and belittlment of female pain. Most shocking the minimasation from not men but from other females. Lets love each other, learn about one another and support each other. UTIS you can still go f*** off though no one wants to deal with you. Thank you for leaving me alone and please stay away or else I will have to get a restraining order on you 😂😂. From Sumaiya, a very confuse but fierce young lady xxx ...........................................Wow that was fun to write very theraputic thank you Hannah for this didnt know it affected me this much", "m.artha.s": "Dear Unknown UTI, I've had two urine samples that say I have an infection but the labs say I don't. Please go away as I honestly can't deal with uc, school and you right now, many thanks Martha xx", "uniquegeekxo": "@shannonfosterkellett", "avrilamber": "Dear UTIs, you make it very hard to live my everyday life even when I do everything the doctors told me to. Please don’t ever come back", "lillekatt.jpg": "Fun story, went to new doc for my last checkup, he had one of his assistans come in the examination room to hold the speculum for him without even considering to ask if I was okay with it and then proceeded to stick a finger up my bum. Wtf. Felt kinda violated", "nashey": "Dear Endo, I’m sorry a surgeon had to break up our relationship, but really you crossed some boundaries/walls that you shouldn’t have. Don’t come back anytime soon. Sincerely, Nashira", "linart_0": "Dear diabetes, as weird as it can seems, you make my life a mess. Why don't you deal with hormones?? And why do you have to make my stream so heavy and painful. Why do my body doesnt get along with hormones !?", "countrygirlfarming": "UTI...so blooming painful and get them when I am run down. I remember one particular time I think it was my first one. It was so painful I phoned out of hours and waited ages for a Dr to ring me back. They was worried it was my appendix so was told to go to out of hours. There I am waiting 2 hours in waiting room at 10pm. Wasn't my appendix it was a UTI. I felt very embarassed. Now I know the signs I ring the Drs straight away.", "ailis_steele": "Dear UTIs, please stop coming back so I can stop insisting that I’m not sexually active. I’m not. Why are you here. This is not where you live. 3 in 3 months is excessive and rude, and also more than some people get in a lifetime. This is your official eviction notice.", "grace.o.carter": "Dear endometriosis, you are a really pain. Today is my first day on an internship at a big literary agency. I have a two hour commute to get to my internship, so didn’t have time for my body to wake up properly. This means that you dear endo currently growing on my bowel is affecting me so much more today. I am stuck on the train for another half hour before I can get to a bathroom. I forgot my heating patches so and leaning forward hoping everyone things I’m just very interested in my book. Please I think it’s time you leave.", "wrenegadesmom": "Dear ovarian cysts, It would be really great if I could get through life never experiencing one of you again. I’ve had a child and the pain of a cyst bursting is right up there with labour pains, and at least childbirth has a noticeably positive result. Fingers crossed that you stay away, Sincerely, CKP", "chuggy_pigwitch": "Dear PCOS, I hate having to shave my arms before work, I hate that I can grow a beard better than any man ever will. I hate that my chance of raising a family is lower than some other women, and that diabetes could be just around the corner. I hate that the uphill battle to lose weight is a never ending struggle. I can’t get rid of you, but I can damn well live my life regardless , you’re stuck with me not the other way around! Regards Jess.", "breathholding": "Dear recurring and recurring and recurring UTI, please kindly fuck off and never return. You paid me monthly visits last winter, from November to April, and in April you were the worst. Because of you, I ended up in hospital with a severe liver infection. Even though I did everything just right! Took every home remedy I and the world could think of, drank lots, stayed in bed with a hot water bottle, and in the end took antibiotics for the forth time that year. You have caused me so much pain, so many panic attacks, so many doctor visits. It's enough now! Especially since you totally ruined my summer vacation last month! I don't want to fear a burning when peeing, I don't want to fearfully drink UTI tea once a week and take cranberry pills three times a week. And i don't want to be scared when having or after sex! Is there a way to scare you away? It would be cool to finally be the strong one of us both. Bye, forever. Laura", "mrskt666": "Dear PCOS I will live with a beard, loosing my hair, painful periods however the 8 years of infertility has changed me more than I know. Kelly", "gabbyhaskell": "Dear UTIs, I always go to the loo after sex, but you still insist on visiting me every couple of months, cranberry tastes horrible and it's made me sick. Please stop turning up without invitation- Gabby", "letsovershare": "Dear Endometriosis, When I was 12 you made me feel dirty and pathetic. You made me think that I wasn’t as strong as the other girls. You made me skip school because I passed out and flooded and leaked in the middle of lessons and nobody understood. At 18 years old, still not knowing it was you, I cried during sex with the first boy I loved. He thought he did something wrong. I was convinced I did something wrong. At 22 I learnt your name but only after doctors had called you by many different names. I tried every pill and potion for both mind and body. It was only when I was laid bare and cut open that people blamed you and not my bloated belly or my mental health. Today at 30 you have made me look unreliable because I cancel plans and take sick days all the time. You are the reason I haven’t had sex in 7 years. You are the reason I dislike my body. You are the reason my fiancé left. You are the reason I cry so often. Three surgeries later and no relief I should feel like giving up. But, you have underestimated me and the power of community. Endometriosis I am making it my mission to make you visible and then a thing of the past 💪🏻💛 Sally x", "cassidy_sage97": "Dear Doctors, I really am going to need you to start listening to me when I say that I’m in pain CONSTANTLY. When I spend every day of my life dealing with pelvic pain that makes it difficult to walk at times and my period cramps are so bad that every month I have to call off work and during ovulation I end up horrifically ill and in more pain than I can manage, please don’t you dare say I’m overreacting. I don’t know how much more of this I can handle... so please, please just listen and believe me. This pain is seriously no joke when multiple times a month I spend over an hour sitting in my shower and crying because I physically can’t move. Take my pain seriously. I’m begging you. Sincerely, Cassidy 💚", "lautjeda": "Dear menstrual migraines, why do you hurt more, last longer and react less well to painkillers than my “regular” migraines? If you could ease up a little I’d be grateful, Laura x", "mommawithms": "Dear endometrium, What's wrong, are the accommodations I provide not good enough? Why are you so thin? Why are you always sloughing off? Bleeding and spotting more days of the month than not is getting old. Pantyliners and tampons are not my favorite purchase to make, I'd really like a break. So, can you just stop with all the spotting and bleeding? Thanks, Sandy.", "loobylooyoung": "After 4 years of utis and kidney infections I finally was diagnosed with a kidney stone . After surgery I'm totally better , get it checked I went to Dr over 12 times before diagnosis", "sarahboufaid": "Dear pcos , I wish I had regular periods, I wish they weren't so bloody painful, I wish I could lose weight like others, I wish I wouldn't live with the constant fear that I may someday have diabetes, I wish I would someday have kids, I wish I didn't have to shave my face everyday, I wish I didn't get bullied for my weight or the hair on my face, I wish I could eat whatever I want whenever I want , but all of these are useless hopes so I will learn to live with you and make the best out of it, I will not let my life be defined by you , and i'll keep smiling through it all", "hannavanrooijen": "Dear itchy nipples, I don't know where you came from and I'm really glad you're finally gone. You ruined my sexdrive and left me so frustrated and so. damn. itchy. You turned out to be a combination dermatophytosis ànd eczema. Please, never return. Sincerely, Hanna", "katyferenczydakin": "Dear, my first UTI, why did you arrive when I was in holiday in Spain and couldn’t go to the doctors to get antibiotics? Why did you make me sit in the aeroplane toilet crying because I was in so much pain? And truly why did your bacteria lead to me getting an abscess that was so bad I had to have general anaesthetic surgery to cut open a hole in me. That hole was 8cm and had to be packed with gauze everyday which was so painful again I cried (and took a lot of codeine). Sincerely, a girl 4 weeks out of surgery.", "rosie_camille": "Dear thrush, your hormonal thanks for forcing me to the doctors after rearing your ugly head every month after my period, your a nightmare and it's not comfortable but it could be worse. Rosie x", "spetty_": "PLEASE PLEASE PLEASE include vaginismus in this!! It is hardly ever talked about & such a massive problem for so so so many women. Having a little more awareness could go such a long way. ❤️ thank you for all you do!", "maya_kamelia": "Dear vaginismus, why do you still rear your nasty head after all these years? After previous sexual partners? You make me feel frustrated and angry with my own vagina, something I should love and celebrate. But it’s okay, because you’re getting better. Being able to identify you as the root of the problem definitely helped a lot. And it allowed me to feel like I wasn’t going crazy. I’m glad I’ve nearly seen the back of you and sex is no longer something I fear or that causes me pain. Yours truly, Maya x", "instaellra": "...not kind regards, ellen", "awsm_hanspal": "Dear IBS, why must you flair up with my period, making it hard to know where the cramps are coming from. And the hormones, why must you make me want pizza and fresh pasta when I'm just learning to ear without gluten", "laura_jelly": "Dear UTI Antibiotics, you’re a life saver! Before you I got a UTI every time I had sex. Even though I pee before and after, wash down there and drink lots of water! After lots of tears, multiple doctors visits and a cool camera in my bladder, I’ve been UTI free since I met you! Thank you you little low-dose beauties! I love thee! - Laura xoxo", "lifeandliesofanordinaryhuman": "Dear PCOS, I spent years ignoring you. Being terrified to leave the house, and even more so to go away for for a weekend or a week away. Will my period suddenly appear? How many sanitary products will I need? How heavy will it be? How much pain will I be in? I skipped meals for years not knowing why I couldn’t loose weight. Why did the hair on my legs, my arms, my face and my body grow so quickly and darkly? I was 19 when finally I got my answers. I had you. Then the realisation came. The pill maybe the only way to let me live without fear of my period. The journey to pregnancy may be hard and I may never have kids. I may have to shave my face everyday for the rest of my life and bleach my arms. I will never be skinny. I could even get diabetes. I don’t like you but I will learn to live with you.", "nikki_beckett": "Dear Hyperhydrosis, the only thing I like about you is the fact that 20 years from now I'll look 10 years younger than my actual age because you have given me flawless skin. But it's not worth everything else. I spent a ridiculous amount of money on clothes, washing and deodorant because all I do is sweat. You have impacted my relationships, my attitudes towards intimacy as well as terrifying me with armpit lumps from deodorant overuse. I can't shake people's hands, hold hands with my loved ones, hold paper for more than a few seconds and I struggle to do most things. It's not enough to be a disability even though it impacts my ability to do many things on a daily basis. Even worse is that I can't tell people as most people think it's weird or try and say they have it too when I know they have no idea what it's like to get an unknown skin condition on their feet from sweating which makes it hard to walk. They don't understand the struggle of having to shower a minimum of 3 times a day during summer. It's an incredibly isolating condition and I know that you know this. I'm currently having treatment to keep you at bay and I'm really hoping it works because I can't go on like this, we both know this. It's not fair and I think we need to go our separate ways even though I know you don't want to. But if you love me, you'll let me go. I hope you make the right choice. From Nikki x", "ninamaiac": "Dear endometriosis, why do you insist on causing me pain? I did nothing to offend you, yet you keep harming me. Can you just stop? Thanks, Nina.", "basicwinebitch": "I had some candida recently for second time in my life and I googled what’s happening, found some medications but it was a real struggle to go to the pharmacy and ask for it and then just to be sure I told my doctor during the next visit but even though I know the stats and causes I was so embarrassed to say something", "_jordjones_": "Dear PCOS, I really wish you’d let me have a normal period cycle. Thanks to you I bled on a guy I really likes face because I had no idea my period was coming and it just so happened to arrive at the worst possible time! Luckily for you he wasn’t that grossed out, but the whole awkward situation could have been avoided if you could’ve let my ovaries work properly!", "rowankitchen": "Dear Thrush, Every time you come around I never do anything until it’s too late and I’ve itched myself with loo roll to the point of bleeding. I promise to slap some cream on and take the pill at an earlier point next time. However, if you could stop rocking up at random after I have sex or use my mooncup, that would be great. All the best, Rowan", "eleanorbrazier": "dear endometriosis, why won't the pain you cause go away even after excision surgery? why must you be resistant to painkillers? I would just like to live a normal life without having to spend days on end in bed because I literally can't function. I would like to be able to complete my a levels and do a degree but instead you're intent on making my life hell.", "jofilos": "Dear undiagnosed pain, you've been around since I started getting a period. You're around about half of the time. You make me sick. Literally. Please stop making me puke. I've tried everything and I can't figure out what you are. Internal and external ultrasounds didn't show anything. Hormone level tests didn't show anything. I tried birth control for a little while and you went away, but the other side affects were too much to handle. The only thing left is exploratory surgery. I'm avoiding that, thank you. You've caused doctors to call me \"bitchy\", my family to say I'm just complaining, and nearly every boy I talk about it with to somehow bring up the topic of his balls. Weird. One day I'll figure you out. Until then, please be a little bit gentler.", "laurynhayleyolivia": "Dear sexual health talks at school : Why didn’t you teach me about peeing after sex? I lived with a uti for a month after losing my virginity because I didn’t want to tell my mum that I was having sex and I thought I had got an STI. If all you’d done was explained what UTI’s were and how to avoid them and maybe I wouldn’t have potentially wrecked my insides. Thanks. But not really.", "jazzaling": "Dear my (female!) doctor,  It took me years to figure out that I had vaginismus, because everyone says sex is supposed to hurt and these things aren’t talked about openly. Realising that my symptoms might not be normal was such a huge moment for me. Why on earth did you dismiss me and all of my concerns, and just write it off as nervousness despite me protesting I was pretty sure it was vaginismus? Thankfully I saw other doctors who took me seriously. Please listen to patients and believe them! Love, Jazz x", "ellie_mjackson": "Dear PCOS, why must you make me a hairy beast? I do nothing but spend my time plucking, waxing and shaving my legs and chin. I would like a day without my chin feeling bristley. I admit, I eat a bit too much chocolate sometimes, but deliciousness should not be so easy to obtain like that! BLAME CADBURYS.", "adiee_thomas": "Dear UTIs, why has it taken me this long to know that CRANBERRY PILLS (yes pills!) are a thing! Popping two of those instead of downing litres of cranberry juice gets rid of you just as well! Thanks for taking this long to make an appearance in my life. Regards, adie", "keira.lunahazel": "I don't have any disorders myself but I know a lot of people with vaginismus who feel very isolated and ill-informed and GPs really aren't great or consistent with the knowledge they give so it would be amazing if you could talk about that a bit and mention the treatments and resources available to vindicate young girls who've been implicitly told that sex is supposed to hurt the first few times and it is normal and not a big deal", "canadianjules_": "Dear UTIs, I swear I’m drinking enough water and doing everything I’m supposed to so that you stay away. I hate you, and cranberry juice. Please stop. Love, Julia.", "goateedave": "Damn girl look at those guns!", "hannahbartl3y": "Dear UTIs, why do you keep appearing. I drink go much damn water and my body rejects cranberry juice so why do you have to make my life even more difficult than it already is. BE GONE! Much love, Hannah x", "rezasoph": "Dear PCOS - I hate every single part of you. You’ve taken away my confidence and you play with my hormones and emotions daily. The doctors don’t understand it and think that I will just cope. I would love to kick you in the face PCOS", "little.green.teapot": "Dear Cervical ectropion, making me bleed after sex really sucked, but thanks for going away by yourself in enough time for me not to have the treatment because the smear tests for diagnosis were bad enough 🤦🏻‍♀️", "fridabystroms": "Had my first and only yeast infection not due to sex but a new fancy pair of underwear I was overly excited for. Had to suffer a week of pain since I forgot my vagisil at home before leaving for a study trip to Berlin. Visiting cultural and political monuments was not very happily done when you've got a massive itch between your legs, let me tell you. Taught me to never venture into the fun part of underwear but to stay true to myself and my comfy panties of choice - no piece of lingerie will make you feel confident or sexy when it makes your vagina produce yeast. My personal ode to cotton based underwear 💕", "amberlabamba_": "Dear Dysmenorrhea, thanks for making me miss so much of school! thanks for making me faint in my gcse sociology exam. thanks for the projectile vomiting from all the cramps. thanks for the migraines, the diarrhoea and the irregular cycles. you made me so irregular that i never knew when i would come on but you always guaranteed it would be during class, on a day i hadn’t packed any pads... so you could laugh at me when i went to the school nurse to get a ginormous pad. but shoutout to Cerazette for sorting Miss Dys out 👍🏼", "katybaines": "Dear PCOS, you make many aspects of my life difficult but knowing I have you has changed everything. Thank you for telling me to look after myself, but you can piss off now. Love, Katy x", "christinasweeneybaird": "For anyone with UTIs, try NOT peeing after sex! I had chronic UTIs and had always been told to pee straight after sex even though it was really hard to and kinda hurt. I saw a consultant OB/GYN who told me to listen to my body - I stopped forcing myself to pee and my UTIs stopped. Listen to your bodies 🧡", "x.katieriley": "Dear vagina, Thank you for not having a infection. But why you always itchy?", "thehormonehealthcoach": "Oh, I love these. I got so much insight from previous hormone questions you have asked. ✨", "mollwitha.y": "Hi Kidneys. Why is it that when my hormones peak in the middle you decide you can't cope and try to shut down. Have to say I'd rather you didn't, it's quite painful!", "gem8878": "Dear major bowel sydrome...I often water where the part of you I'm missing is at first it was accidents galore you know wee and poo everywhere then I met medicines and you still and worked \"normally\" I may have dihorria EVERY day but I mange without you.....hahahaha totally joking I miss you so much please come back the scar is still on my stomach ready for you to come in I just want to know what a normal poo is although I do love having my huge scar on show it sort of scared people and it's rather amusing....maybe just one normal poo??? sincerely gem xx", "sarahchillomg": "Dear Endometriosis, why you gotta be invisible on every single scan? My OBGYN wants to rule out every other possibility and I’ve had three separate specialists tell me “Endometriosis is only diagnosable via laparoscopy” and then perform a pelvic exam and say “welp no sign of Endometriosis in there” bUDDY. YOU JUST. SAID. Also why are you so resistant to pain killers. Sincerely, Sarah, who is in a lot of pain and would like to sleep", "stina_lisa": "Dear Endometriosis, it's time to break up. Having the first sexual experience with the man I love end in horrific pain was emotionally scarring and its all your fault. That's why I had you surgically removed from my body. You are not invited back.", "briartherose": "Dear lichen sclerosus, you're a rare thing and it took a long time for the doctors to diagnose you. I felt broken for a long time - out of answers. Why did sex hurt so much? Why did I constantly feel discomfort? Now I know. You give me a 1 in 20 chance of being diagnosed with vulval cancer, so I have to keep a watchful eye now, but at the very least I have answers.", "raeganbwhitehead": "Please can you consider changing to a dyslexia friendly font as I can't read these posts very easily?", "amidthevoid": "Dear Dimitri, my potential endometriosis,  These months have been so long ever since this pain appeared on January the 5th. 18 trips to the doctors, 4 to the hospital and tests upon tests coming back clear. So I sit, and I wait, wondering what you really are. In May I booked a gynae appointment for November and I wonder if they’ll even give me surgery. The only answer given is ‘yeah, I think it’s endometriosis’, except Dimitri, you can only be diagnosed by a laparoscopy. While I wait I cuddle Damascus, my hot water bottle and main means of pain management. I couldn’t tell you how many pills are in my drawer, but every new painkiller does nothing but make me feel ill, damn you Dimitri. Hopefully this next month goes fast and moreso the hospital give me a surgery date sooner than halfway into next year. I was fine until the 5th of January. Why now?! Will I ever come to terms with you or find your true name?  Please stop stabbing my lower stomach Dimitri,  Hate you, Abi x", "abbeygraceharrison": "Dear Endometriosis, why are you straight up trying to ruin my life? Spending my whole life lying in bed with a hot water bottle to try and counteract the immense pain you cause is frustrating and no fun at all! Why is it that you always come back even though every surgeon assures me that \"this is the last surgery you'll have to have\"?! You're a selfish cow trying to take away my ability to contribute to society and live a full life and I would quite prefer it if you just went away! If you would just calm down and stop creating extra cells than what is necessary, all would be swell. Stop trying to be such an overachiever!! Regards, Abbey.", "alys_anthony23": "Dear PCOS, why have you suddenly made an appearance at the age of 21. The doctors diagnosed me with your burden last Friday and I don’t know what to do with you. Your presence is not needed in my life, you’ve taken my periods away (kind of a relief) but you’ve also increased my risk of Diabetes and being Insulin resistant, you’ve given me hair on my body and face that I didn’t ask for and you’ve made me question whether I will be able to have children. I hate you already and I’ve only known about you for 3 days...", "unapologeticanagha": "Dear PCOS, could you STOP messing with my head so much? You and my hormones can fight internally without letting the thirteen other people I just snapped at know. And, the screw the mood swings, tell me how is it fair for you to make me to worry about feeling pelvic aches and not getting my period when I don't even have an active sex life? Thanks to you, I look forward to seeing blood in my panties whenever possible. Yay. Fun times indeed."}