{"bunnywarfare": "How do you negotiate a respectful and egalitarian casual sexual relationship with someone? Thanks Hannah!", "w0w3wa": "How to get on the same wavelength? We want the same thing but different demeanors/initiation style", "jennie.nennie1": "how to avoid queefing, dear god", "apbruz": "Can you make a video about accepting not having a sex drive for sex-repulsed ace people? I’m ace and it’s really hard for me to feel like I can still be loved bc of it", "waggen94": "How does one pass that you and your partner want to try different things in bed and still make sure you don't do something you don't want to do?", "moreauartwork": "If you want to get a painting done DM me and let's talk! Check out my latest work on my page!", "magicksalad": "Thoughts on why sex and sexual attraction are made as a ‘level up’ from romantic and platonic attraction when all of them are equally significant kinds of attraction", "inspiringpicturesclub": "Not really related to the sex itself but sexual attraction. - Can we fall out of sexual attraction for someone? If yes, please give some suggestion on how. - Really need them. 🤦‍♀️😭", "joefords": "How is your day going Hannahwitton", "morebooksmoretea": "How to feel more comfortable with medication affecting your sex life? Like how a side effect could be that you get more or less horny, how it can affect lubrication and such. And how to talk to your partner about it.", "jaymonstar6": "So beautiful", "iamminkaofficial": "You look so happy!", "siennacurnyass": "How to make cowgirl position more comfortable for the woman on top? Problems with hair getting in my partner’s face and body insecurities have made it a position I don’t really enjoy that much but he doesn’t want to have to do all the work... how can we share roles better while making things enjoyable for both of us?", "lissie2105": "Is it normal that it hurts the first time lmao", "heenal.jas": "How do you know that you're emotionally mature enough to handle the experience?", "calibabeauty": "Nice ❤️", "muppetcp": "Such a beautiful picture", "jayeraye": "What are some of the first steps to getting sti testing?", "mskarishmai": "Man, you are gorgeous!", "cyclops_sid": "😍😍😍😍😍😍", "northwestwanderlust": "Such a gorgeous smile!", "jameswalterphoto": "Gorgeous", "kaylacocking": "Beautiful photo @hannahwitton", "paulinelery": "Do I need to wear sexy lingerie for my first time?", "rick_noppenberger": "Is that the window that doesn’t have blinds yet? Haha", "lexienels": "How do you deal with differences in sex drive between you and your partner? Meaning if you have a higher sex drive than your partner, or the other way around.", "seanreidbrown": "Can I have it with you?", "its_just_em_": "You have very nice eyes. It sounds generic, but your eyes are very nice. I am very bad at words.", "shan.hop": "What are some cute date ideas with my boyfriend of nearly 5 years?? @hannahwitton 😍", "h4nd.4rt1st": "How do you really learn what feels good for you. I'm trying but I'm struggling.", "bbirdsr71": "You are very beautiful sweetheart", "maddy.yaruss": "How do lesbians have sex? Sorry if this makes you uncomfortable", "maria_reiche": "Thoughts on sex and religion?", "freida.bal": "This isn’t a sexy post but I have to know how it was being in the strip vid and at the lm5 release party?!!", "saige.mcl": "So, I used the pill for over 4 years for BC, and decided to get an IUD (coil) almost 2 years ago because BC killed my sex drive and affected my mood. Unfortunately we (my 5 yr boyfriend and I) discovered that the pill had been suppressing recurrent ovarian cysts, and since I stopped taking it I have times where they swell up so much I can barely move, let alone have sex. So my question is how can I try to avoid my inherent fear of having sex because I’m worried anything I do for pleasure will also cause me excruciating pain, even when I’m not having an episode with my cysts? My bf is great and gentle when he needs to be, but I still get nervous which kills the mood for me! How can I get out of my head?", "iiigne": "Q: how are you supposed to feel safe in a country (like Poland!) where conservative views from the church are completely controlling your body (illegal abortions, they're not big fans of sex education)?", "mrmjdworld": "Wonderfull", "zo.oe_": "I’m kinda worried because I’m getting to the stage where everyone’s getting ready to have sex and I haven’t even had my first kiss lol like what do I do if someone tries to come on to me", "petite.rose.rouge": "How can sex ed teachers be more inclusive of people with disabilities ?", "web_guy1": "Best pic of you ever! You need to frame this one. 😍 😘", "biochemfordays": "I feel v awk when I put weight on and have sex, I feel so hopeless and lack energy/stamina. And thinking about my body moving just puts me off and makes me feel so un-sexy. What would you suggest will help me enjoy sex again (my new meds are making me put on weight so don’t really have a choice to fight against it that much)?", "nvious_arts": "Is it normal to have no sex drive and think sex isn’t appealing at all at 16? Is there something wrong with me?", "laurenelloise": "not a question, but this photo is gorgeous!!", "emzbratz": "Looking gorgeous Hannah ❤️", "paige_sydney__": "How to be intimate with someone after a rape ?", "iralia.etc": "you are stunning omg", "graham_m_hand": "Is there a way of stopping the need of Masturbation ?", "luisramirez2323": "You’re so gorgeous 😍🌹🌹❤️", "maisykatee": "how to stop the vaginal tear from happening??", "evan.gelinem": "How do I bring up the topic with a new partner? I’ve never had sex before and I’d need to have a serious discussion before engaging with anyone.", "officialbrigitteballard": "GIRL CRUSH", "amy.ahearne.161": "Oh my God this is so beautiful", "katfromyoutube": "🔥🔥😍😍", "_.me.l": "k", "megansci": "I am a coeliac and lactose intolerant and I have other digestive problems that make my tummy very disagreeable. I know you’ve got digestive issues and I was wondering, before your stoma, how you dealt with the worry of poo, diarrhoea and the like whilst having sex? Bit grim I realise but hey I thought you’d like the unedited questions!", "zhermz": "Is edging bad for your health?", "walwanisp": "You are nice hannah!!🤗🤗🎶🎶🎵🎵🎵🎵", "haziecaroline": "Do you have any advice for someone in mid twenties who’s wanting to date people but doesn’t want to rush being intimate? Back in the day, highschool times, it’d be totally acceptable to wait six months maybe before being really intimate with someone - I worry with modern dating app culture that this has changed. How can myself and friends in this situation navigate it with potential partners? Is it unreasonable in this day and age to want to wait a while?", "mike_shapes": "This pic is 😍 - great work :)", "phoebee1996": "@lottiejackson21 she is stunning!", "slipry_67": "Stunningly beautiful Hannah", "caitlin.abbie": "Ive never enjoyed sex. It just never feels good. I don't have much experience but i worry that for some reason that Im not gonna feel anything down there ever.", "charlotte_darnell": "This photo is so lovely!!", "zoeelaine_": "How do you make time for sex when you and your partner are both so tired at the end of the day?", "jedi2257": "Pure beauty", "elliedearling": "Should you use a condom when giving a blow job? All of my friends don’t so was wondering if this is the norm? Don’t really fancy chlamydia 🙃", "imogenfreemanx": "Is there ever a situation when it is okay to have underage sex and what to do if your parents find your sex toys", "pee.coffey89": "My significant other hates having sex while I rather enjoy it. I’ve try being romantic or trying to make it fun but no matter what she never wants to and I don’t know what else to do. Even asking her about it she just says because she doesn’t want to", "ethomson92": "Since it’s Movember, does facial hair make oral better, and how?", "s3zz0": "So I’ve been seeing this guy for the past 5 months and we stopped using condoms a while ago, he just pulls out (I know how risky that is) but on Saturday we were drunk when we had sex and went for round 2 without protection and he messaged me the next morning saying I should get the morning after pill, and that he’d pay, it’s the second time I’ve had to get it since seeing him and I’ve paid both times and he hasn’t paid me back yet. And I buy all the condoms when we do use them. I’m just stuck cause I really enjoy the sex so I don’t want to do anything that might mean we have less/no sex", "adelaide_kate": "Do you still masturbate when you are in a long term relationship? If yes, does your partner get upset with feelings of not being able to pleasure you themselves?", "ambett10": "Can you have anal when you have colitis?", "brian_wilson_1985": "This pic is gorgeous!", "original.chanel": "What do you think people don’t know but need to/should know about sex? This can be about enjoying it, being safe, a random sex history fact, anything! 😌", "alec_wimmer": "How do you deal with sex drive while in to much chronic pain to do anything about it?", "layneashtonrogers": "Beautiful!!!🙌❤️🔥😍", "willisdefinitelyjudgingyou": "Top tips for safe sex?", "e113van": "@hannahwitton is ejactulating such an ordeal for women? Do they feel that sex is worthless unless I do it? Where do you or does one prefer their said partner to do it? Is there any defeat or non turn on to doing it into a condom?", "chad_dt": "That smile of yours is absolutely breathtaking.", "pit152001": "How to deal with sex when you both have different libidos ?", "cyber_kiron": "Just awesome", "aimee.loats": "Best way to bring up to a partner what ur ostomy is ?", "dtinc_world_news": "Sex? Um yeah I do actually.", "crystalsparklydreams": "Wow beautiful lady!", "missladylamp": "I have a condition called Vaginismus, which is spasms of the vagina muscles. There isn’t much research, and it seems that therapy is the only option. £55 per hour, as a full time student I can’t cover the costs. Would you happen to know anything that would help me?", "hannahcuppabooks": "What do you think is the most popular position?", "matthew_cooks": "I haven't got a lot of experience on going down a girl and I was wondering what kind of things would you suggest trying", "sammarotti": "What are the ground rules you set for a sexual but casual relationship? The catch 22 is I have to have a deep connection with someone in order to have sex with them... which makes things confusing for whoever I’m with. Mixed signals everywhere. Never fails to be a mess every time. Thank ya mam", "notmacin": "NO QUESTION THIS IS JUST SO PRETTY", "azailiaberry": "How do you/would you cope with being sick for a long period of time and not be able to have sex?", "bouquet.of.daisies": "how old is too old to have sex the first time? i’m 17 and haven’t even so much kissed?????", "veravdweerd": "I'm in a relationship and wonder how to differentiate my own feelings towards (not) wanting to have sex from what my parents want (no sex till marriage) and what my boyfriend is okay with.", "dandeliondanii": "breathtaking photo!", "tabby_ellis": "Does it change the pH of your vagina using a condom?", "storm_3578": "🔥👏", "jessicagluch": "How to stay safe during casual sex / one-night stands (both in terms of preventing a pregnancy/stds, and consent-wise). And I /still/ don't really know how two people with vaginas would have safe sex ...", "vagentzero": "I deal with anxiety, and the insecurity that comes from it. I'm already taking meds and have gone through a course of therapy, so what are some other ways to stay out of your head and in the moment?", "katiistroup": "Ways for a disabled person who can’t move a lot to enjoy sex? In my opinion it would be rather boring to stay in one position the entire time, but if you have problems moving, is there really much of a choice?", "pincushioned": "I'm no good at taking to people unless I'm drunk and or on Mandy, even then I don't know how to get people interested in me or make any moves. It makes me feel pathetic and worthless. How do I fix that? Also didn't help that I also have a stoma.", "bethychaotic": "Hiya @hannahwitton, how do you support and advice friends that say their sexlives aren't what they want it to be? Especially female orgasm related! I want to spread the love but not come accross negatively!! Xx", "ramlasafiee": "Outrageously beautiful!!!!", "annalaurakummer\nVerified": "Verified", "janiealice__": "You are so gorgeous! And my question is have you ever been in a situation where porn/ masturbation affects your sex life with your partner and if so how did you deal with it?", "treehugger_1978": "YOU ARE SO BEAUTIFUL", "gbckkfs": "Bella! 😍", "chimmichoom": "When people say \"always pee after sex\" does it only refer to penetretative penis/vagina sex? Because as a lesbian in a relationship with a cis girl I don't know how useful that advice is.", "hermsengirl": "Are Your breasts still growing and getting bigger?", "laura.venuti": "Hi Hannah, I sent you my question via DM. Thank you for your work, I'm a big fan of yours ❤️", "ellisr0se": "Where do you think the line is between having positive open sex conversations and oversharing?", "rob_had_": "Soooo stunningly gorgeous! 🔥😍", "assimmaity": "Words are not enough for you....truly speechless", "esamariaa": "which kind of contraception do you use? I'm looking for something safe and I want something with no or little hormones. love ya ❤️", "jaydecasey_": "ask parents^ for", "marlowyork": "How can someone become more sexually confident after dealing with bad relationships and abuse?", "trevorgeorge66": "Very attractive girl you are - your pics always brighten the day", "jay_dee_bee_": "Question about sex? Yes please, when? #BBCbodypositivity LMAO! Oh, u clueless, innocent Brits. I don't think BBCs need to learn body positivity. The get all they need from white chix!! Lololol", "krawuzi.kapuzi": "cutie", "adamdrakedidit": "Jaw drop", "sweetsourtangy": "@hannahwitton I want to know is it necessary for the foreskin to roll back for a successful and painless intercourse (from a man's point of view)?", "hannah_c_page": "How do you enjoy a personal and private sexual life when you’re living with parents who don’t approve and/or don’t leave you alone?", "bellapaton_music": "Never had an orgasm from penetration and all sex I’ve ever had has been average at best. Why do I still crave it so much?", "kxtyrobo": "Wtf is a dental dam?? (Or however it’s spelt)", "eloise_fowler": "@hannahwitton would love to know your perspective on the psychology of sex in terms of gender differences, do you think there are any evolutionary perspectives that are still relevant to society today? The main argument I come up against when I am frustrated by the common objectification of ‘women’ vs. ‘men’ is that “men and women are wired differently when it comes to sexual attraction - men are more visual and impulsive - while women are more attracted to commitment or stability for childbearing and rearing purposes” does this still have any merit and if so what repercussions does it have for our society fighting against objectification and FOR equality in sexual liberation ? Thanks so much ❤️ you", "sophieemarie_xo": "😍😍😍😍", "carina_laureen": "So pretty!! 😍", "faultylightbulb1": "Vaginismus", "gjr870": "👏", "sabyaurora": "So pretty 😍", "faisal7863": "Awesome", "joanna_marie97": "So there is a lot of people that think porn creates an unrealistic image of sex but how about films? You have all of these super romantic films, extremely romantic gestures, how do you (especially for younger viewers) think they impacts sex? I remember my first time thinking “this isn’t like in the films.”", "vayntribe": "Beautiful 🦋", "conanbyrne": "How do you think we could start to talk about sexual education in schools, both primary and secondary. I know everyone gets the physicality of it but the emotional side is not touched at all at least in schools I went to. 😊 Thanks", "aliceliveing\nVerified": "Verified", "chuso47": "Do the women have different g point?", "idaschelhase": "Stunning 💕", "han_ah": "How can we address the fact that EVERYONE has sex and can and should have the right to enjoy sex no matter if they’re thin, fat, disabled, fully able-bodied, gay, straight, etc? Most general sex education covers full penetrative sex between a straight slim couple. I always felt as a fat bisexual girl growing up that I wouldn’t be able to have sex/enjoy sex and luckily I realised through my own research that is not the case. I’ve since started a NSFW blog and have had so many fat people commenting and telling me they have always felt the same. Just curious on if you think there’s anything that could be done to address it that everybody and EVERY BODY can enjoy sex.", "loopediwoop": "how to say no to your partner asking for things you’re not comfortable with - WITHOUT it being awkward", "miralulu22": "@hannahwitton I am a virgin and I am worried that when the time comes for me to lose it, it will hurt and I won't experience any pleasure. Tips to lessen discomfort and enjoy it more?", "megan.bretherton": "Model ❤️", "godimlarge": "That face! 😍😍😍", "e__green_": "What is a penis?", "rainbow.junkee": "Do you prefer a guy jizzing on your tits or your face?", "fucktaboos": "How do we improve society’s methods of tackling taboos surrounding sex and other important aspects of life that are natural and beautiful but are constantly shamed, ignored or degraded such as nudity, masturbation, mental health and all the rest?", "flydorsch": "How do you incorporate sexy time in your say to day life. I've been in a relationship for almost 3 years amd we're both really busy. Most of the time one of us is too tired for sex or stress drowns out any desire. I find it quote frustrating, but don't know how to fix it, since my partner is not thaaaat into sex like I am. And that frustrations also end in no sex 😅😅😕😕", "santi41030": "beatiful dream", "_stefanieboyle_": "When does sex become amazing for us girls? At the beginning ( the first few time) it’s nothing all that exciting and so I’m wondering at which point does it start becoming phenomenal", "officiallyjeffgarlick": "52 years old (or young?) so I've lived a good chunk of my sex life (or lack thereof 🙈🙉🙊) but I do want to know \"How can Americans get the Audible version of your book? I LOVE this portrait of you BTW! It's too great and artistic to be merely called a picture! 👍", "aleanxietygram": "😍😍", "beckysdoodles": "How to improve my sex drive when I don't think about sex at all... Ever....", "chameleongarden": "💜💜💜", "_tildo": "Any tips to be more open to your boyfriend about your sexual fantasies? How can I initiate the conversation?", "eddictionz": "Am I still a virgin if I put it in for like 2 seconds and then chicken out?", "mvtay": "How to not be constantly paranoid that I’m pregnant, even though I’m using contraception? 😅😬", "katyfrank21": "How do you feel confident being intimate when you've been on your own for quite a long time (A year)", "shuuutingstar": "How to overcome body image issues?", "macarenacamejo": "How do you give feedback about something the other person does that you don't necessarily enjoy? (Especially when you've recently met the person)", "rob.gibbo": "Do women prefer circumcised or uncircumcised", "jessy_ktznr": "This pic is stunning! 🔥", "o11yw3bb": "Where should we draw the line for kinks? How do we manage healthy kink play and how do we differentiate between kinks, preferences and unhealthy fetishes?", "gem8878": "@hannahwitton why do we over hype first time sex? I mean it's nice to be special and romantic but if it doesn't happen like that why do we then think it was wrong or not the right way to do it?", "andrewmcn": "@hannahwitton Stunning", "bald_eagle_jr": "How do I become more comfortable/not guilty about the fact I can't have penetrative sex?", "liz_art_illustration": "Having sex and telling people about your vaginismus?", "nati_dutzi": "how did you become so confident to openly talk about topics that are not usually talked about or make people feel uncomfortable?", "quel100s": "How to navigate dating when you put connection first and sex second (not that i don't enjoy it) in a dating space that tends to make emotional connection a secondary effect of sex ? (Don't know if this counts as a sex question lol)", "hannahivvy": "You are stunning 😍", "bossdeaths2113": "Why do guys think that their first time ejaculating after years of rejection is going to feel like something from the Happytime Murders?", "eldeneter_48_mckij8l": "Nice smile", "kevin.wg.02": "What do you do when your partners doesn’t want to be open (talking) about sex. Gorgeous btw :)", "xmadxpenguinx": "That's a great picture of you.", "lilienneo": "You look stunning 🌹", "stokie_gram": "We didn't get to find out if you can participate in anal play after your surgery"}