{"_courtneyutting": "Tattooist of Auschwitz!", "charlie_brown2811": "The sun is also a star!", "roenick.grey": "The tattooist of auschwitz is probably one of my favorite books", "serianevans": "The Tattoist of Auschwitz has been very heavily criticised for its blurring of fiction and reality by the Holocaust Memorial Centre - https://www.theguardian.com/books/2018/dec/07/the-tattooist-of-auschwitz-attacked-as-inauthentic-by-camp-memorial-centre", "molly976": "The sun is also a star! 🌞", "tglynnnnn": "Been wanting to read Educated. Heard so many great reviews about it. Also, the tattooist is auschwitz sounds interesting too 🙌🏼", "yesmissjes": "I’ve heard great things about educated, though I haven’t read any of these just yet.", "tumepunane": "the sun is also a star!!", "t_carleto": "Educated 🙌🙌", "aine_brownie": "The sun is also a star 🌞⭐️", "trinitygaisford_dance": "The sun is also a star is SOOO GOOD, made me cry and I’ve only ever cried at 3 books 📚😍", "thefluffyblob": "I'm reading Gut by Giulia Enders at the moment and it's really good, it's about the digestive system. You might find it interesting :)", "heyheyitsbecky": "I'm just over a third of the way through the tattooist of auschwitz and I'm really enjoying it so far, it's a little bit confusing keeping track of all the characters but overall it's pretty good.", "eilidhbales": "The tattooist of Auschwitz is an amazing read", "cmarree": "I have read and enjoyed all of these but I would say educated! It’s amazing!", "reclusive_plant": "Educated!", "chloeharriets": "I loved the sun is also a star ♥️", "carys.batcup": "Educated!", "chloehaskara": "Tattooist of Auschwitz is a fantastic book!", "borabreana": "The sun is also a star!!", "lol_meme_meme_lol": "@lolprinprinlol", "maddiedales": "@junodawson ‘s new book Meat Market", "fabian_dancehero": "So, for Christmas's, my sister gave me the book 'let's talk about sex'. It's the best book I have ever read. I highly recommend it @hannahwitton", "rubie_lou16": "Clean", "toranatasha": "Educated is amazing.", "sylviapeaceandlove": "I am currently reading the tattoist!! Amazing!!", "william.geis": "Before reading the Tattooist of Auschwitz, you should read the response to the book the @auschwitzmemorial put out regarding it.", "beccabop96": "I’m currently reading The Tattooist of Auschwitz and it’s SO good! Definitely this! 📖", "honestlytrish": "Just read educated. Amazing true story!!", "katy_la183": "Educated - because it's also sitting on my desk and I got it because I saw the video where you got it as a present (I thjnk) and talked very highly about it. So lets read it together! 😁👍❤️🇩🇪", "1000linka1000": "If you haven't read \"Factfulness\", get it now. Seriously.", "gabrielle_iona": "The Sun is Also a Star bc then you’re prepared for the film release in August ☺️", "sarcastic_sweetheart_": "The sun is also a star is one of my faves! Such an easy read but super funny and relatable", "jshilvock88": "Tatooist of Auschwitz!!! A toughy...but amazing. You have to keep reminding yourself its a true story", "dozeier": "Educated is one of the ever books I read in a long while. I'm almost done with it.", "ellischristina57": "Educated!", "ilovetodraw3": "The sun is also a star!!", "katielouisehill": "I've just finished Clean 😌", "elliejadeanderson__": "clean is sooo good !", "ugly.cherrries": "another book that’s amazing is called “i’ll give you the sun” by jandy nelson", "shmikelly96": "You should read Tattooist of Auschwitz! 🙌🏻 It is an incredible, terrifying, amazing and inspiring read! ❤️", "dialtones_and_daydreams": "Educated was the best book that I have read in a long time. In my opinion, the Tattooist of Auschwitz was not as historically accurate as I had hoped, and romanticized the holocaust too much for my liking", "christinastorey": "Clean!", "lil.mason": "TATOOIST OF AUSCHWITZZZZX", "sammagfunk": "Everyone is talking about Educated! It’s on my list too!", "ivanandtoby": "😍 Educated got me out of a reading slump last September! But The Sun is also a Star is better if you want something lighter", "natasha.isabella": "The tattooist of Auschwitz was the most recent book I finished in a day - it was absolutely incredible", "andreita__isabel": "Educated @hannahwitton is outstanding!", "jackcrane8757": "The tattooist of Auschwitz is a very good read.", "sofi_bebeautiful": "I’ve just finished the tattooist in a week. Was really good xx", "x_lauren_taylor_x": "Clean is amazing, as I ttoa as is Nicola yoon. I haven't read the other xx", "anxaiol": "The sun is also a star is pretty good tbh", "nosliwlemelocin": "Please do a book club x", "sarah_jade_dickson": "I'm currently reading the Tattooist of Auschwitz and so far it's a great read!", "kermits_frog_blog": "I really enjoyed the Tattooist of Auschwitz", "madisonkemp1995": "Clean! I’m reading it!", "caseyjune_": "tattooist of auschwitz is amazing trust me x", "eva.bailey24": "The tattoist if auschwitz!!!! Such an important read, such a beautiful book❤️", "clodagh.daly": "Please read the tattooist of auschwitz!!", "lily.eh_": "my english teacher is currently reading the tattooist of auschwitz and she says it’s brilliant", "junodawson": "I feel I’m biased.", "hnnhgrceblck": "Just finished Tattooist of Auschwitz, such a wonderful story!", "nicolfert": "I read Educated in two days. Could not put it down.", "finnleen": "Omg you need to read Clean, @junodawson is an icon", "faorozco\nVerified": "Verified", "carrerra.louise": "Tattooist of Auschwitz! ⭐️⭐️⭐️⭐️⭐️", "ellenfinn24": "The Tattooist of Auschwitz is a beautiful and touching book ❤️", "johooke": "EDUCATED", "cat93xo": "Clean, I really enjoyed it!", "chloejayne_x": "Tattooist of Auschwitz!", "kierarose915": "The sun is also a star is literally my favorite", "carliehedmann": "The tattooist of Auschwitz is an incredible read that is a lot to take in but so so worth reading", "luca.freya": "i loved the sun is also a star so much", "krausetagram": "Reading Educated at the moment and it’s amazing!!!", "katelyn.peters": "the sun is also a star is SO good", "angha.rad": "Omg I love the tattooist of auschwitz. Such a good book!", "keelehp": "Clean! I'm nearly finished it. It's great.", "magnoliadodie": "The tattooist of auschwitz! It's amazing and it's not been read enough!", "samidawn": "Heard such good things about Educated. Have that on my TBR too!", "estherann": "I've only read the two on the right, but The Sun is Also a Star is legit one of my fave YA novels 😍😭", "rebeccacarss": "The tattooist for sure!", "whosthatgirl_js": "The Sun Is Also A Star is a great, quick read! And it’s being released as a movie this year!", "lucymarymain": "Tattooist of Auschwitz!! I'm halfway through at the moment and it's stunning!", "chloless_": "I just read the Tattooist of Auschwitz in 2 days! I'd highly recommend although not a super upbeat read x", "just_kathryn": "The Sun is also a Star", "mrjarwson": "The tattooist of Auschwitz sounds interesting!", "cathboland5": "The tattooist is a must and will keep you fixed and if you can you could read in one sitting!", "rachelmacleod6": "Educated it’s amazing!", "alexidraven": "Clean is amazing! 💕", "butlertron2000": "Can I suggest another book? Utopia for realists", "emfoulds14": "Tattooist is BRILLIANT. I read it so so quickly. Enjoy!", "tzivikleinbart": "The sun is also a star! One of my faves! (Got an ad for the film right above this post 😂)", "__kristinalouise": "Educated!!!!", "georgia.jaycee": "Tattooist of auschwitz!!!!!", "gemc200": "I read Clean last year, it was really good! 😊", "escarlatarosa": "The sun is also a star was so great I couldn’t put it down! Recommend", "purplealien101": "The sun is also a star", "potter_lesleyann": "Tattooist of Auschwitz!", "lily_rae99": "Tattooist of Auschwitz! It’s an incredible story", "velyssarapt0r": "Tattooist of auschwitz !!", "ellen.hxir": "The sun is also a star!!!", "sophia_hbst": "The tattoist of Ausschwitz since International Holocaust Remenbrence Day was last saturday", "rebeccadxkin": "The tattooist of Auschwitz! X", "smtoshae": "Tatooist pf Auschwitz!", "lucalib97": "The sun is also a star!", "eachnewdayoffers_life": "Tattooist of auschwits is so good!", "elliemc9679": "Educated", "hollyadlem": "Educated is incredible. I felt ALL the emotions", "rach.guy": "The tattooist of Auschwitz is a phenomenal read, a bitter sweet true story with a chilling insight into what it was like at auschwitz x", "little_miss_dalton": "The tattooist of auschwitz sounds good xx", "lucy.j.smithx": "The sun is also a star!", "carysannmorgan": "definitely tattooist of auschwitz !! read that in one day bc it was so gripping and emotional", "abbeygraceharrison": "have heard amazing things about educated! it's gonna be my next one!", "saintsunflower": "The tattooist of Auschwitz!", "rhodesmaryann": "The tattooist of Auschwitz", "izzy1682": "The tattooist of Aufschwitz", "aniluzavalaa": "What did you think ab ‘A Room Of My Own’? I was one of the people who recommended it. 💓🌸", "o_franny_o": "The tattoist oft Ausschwitz!", "mcsnugz": "EDUCATED", "alice_john1999": "The tattooist of Auschwitz is absolutely amazing!!! Best book I’ve read in years", "katdent_": "Go tattooist of auscheitz! One of the best books I've read", "bexysykes": "EDUCATED", "amy_taylor94": "I read the tattooist of Auschwitz overnight, it’s a stunning book! 💙", "kjohnson3595": "The Sun is also a Star is a pretty easy read, so if you want something simple and relaxing I’d highly recommend it!!", "immarit": "Tattooist of auschwitz!!", "mentalbreakdnce": "tattooist of auschwitz!", "madrynhr": "The tattooist was a hard but really good read!", "lindsaygray21": "The sun is also a star!!", "hannahabm": "Educated!", "_charismelissacollier": "The sun is also a star is so so sweet! ☀️☀️☀️", "colleen_pate": "educated!!", "bookstagramviv": "tattooist of auschwitz ❤❤", "milliechapmann_": "If I was your girl", "txmxson": "Tattooist of Auschwitz 100%", "whitbern4": "Educated!!", "ddeze": "I’ve heard the tattooist of auschuwitz is really good!", "books_and_wonder": "I haven't read any of these books but The Tattooist of Auschwitz sounds really interesting.", "soph_1962": "the tattooist of auschwitz ❤️", "andersonrbr": "You should read next sun is also a star", "freyaaadavis": "Educated is incredible!!!!", "breematiero": "Educated!", "benitahabkirk": "Listening to Educated on audio book. It's sooo good!", "chronicallysamantha92": "I wanna read that tattooist of Auschwitz", "morganweir01": "Educated is absolutely incredible! I highly recommend it. Her writing is super captivating.", "heatherrobbinsactor": "I'd say the one by Heather because Heather is such a sick name 😉", "hopelesshearrts": "Tattooist was an amazing story but I feel as if it could have been told better", "emily.rose2000": "Clean is amazing ❤️", "_emma_combs_": "Clean", "hannahrebeckahx": "Tattoist is brilliant xx", "beesnuggly": "@hannahwitton the tattooist if Auschwitz", "ssoopphh__": "Tattooist of Auschwitz", "meganhetty": "The tattooist of auschwitz!!!", "misstcliffe": "I loved the tattooist of auschwitz!", "chiccodiriso16": "Educated!", "samlaarsen": "The tattooist of aushwitz!!!!", "francesscalouiseg": "The Tattooist of Auschwitz is a fantastic read !", "gem8878": "The sun is also a star", "larissakoedood": "Educated, definitely!", "jessharrisxxo": "Clean!!!❤️", "smaller_bish": "Tattooist of auschwitz is an immense read", "summer.garrard.1": "Both Educated and The Tattooist of Auschwitz were excellent!", "nothisiscaitlin": "Educated for sure!! ✨", "anniesalloway": "Tattooist!", "doddleoddlewaddle": "Clean omg it’s so good", "jenna_thomas6": "The tattooist of Ausschwitz is", "naomiifitzgerald": "the sun is also a star!!", "saran.rhea": "You should add ‘The Girl Behind Dark Glasses’ to your list of things to read. You’ll learn so much about medical neglect and abuse and myalgic encephalomyelitis. I wish I could get everyone to read it, it’d save me so much energy explaining the hell that I live with.", "scottmcgee93": "Tattooist is amazing!", "michelleklingg": "the sun is also a star is incredible!! a must read", "_pheebspieces_": "One vote for Educated", "megadams_": "Tattooist of Auschwitz!!", "sofiorchansky": "The sun is also a star!!!!", "molliemarierose": "The sun is also a star, it's amazing and the movie is coming!", "as_kxra": "educated", "mollydrinksghinn": "Educated is amazing! As is tattooist of Auschwitz! Read both now!", "holman4574": "Educated", "oliviahooooper": "Educated", "nia.jones254": "i need to read the tattooist of auschwitz", "brandy.lynny": "Tattooist of auschwitz! Really sad but an incredible book", "katie.ralston_": "the sun is also a star!!!!", "thequeenoftheeyesores": "The tattooist of Auschwitz! Amazing story, read in a matter of hours absolutely compulsive.", "nicolajanesloan": "The tattooist of Auschwitz!", "pam_ackermans": "I loved The sun is also a star!", "rosiebee96": "Tattooist of auschwitz!!", "don.gass": "It’s not one of the displayed books but I recommend Conspiracy by Ryan Holiday", "foxytravelsuk": "The Sun is Also a Star! A beautiful read, plus the movie is coming out soon!!", "_hannahx_x": "Tatooist of Auschwitz", "gabriella_.t": "Clean, it’s amazing and the characters and story are so good, Juno Dawson is such an amazing writer", "timbrell07": "Heard so much good stuff about Educated! It’s next on my list :)", "billiea94": "I finished last year with the Tattooist Of Auschwitz and it's such a good read! (All though quite sad of course) 😊💚", "ruthiefletch": "The sun is also a star is a great read!", "becky280596": "Educated is a really interesting book", "mollybushnell": "Clean for sure, you will wizz through it (I read it in 2 days) and it is so worth it. Plus @junodawson is such a honey and I love her.", "laurencathrinex": "The Tattooist of Auschwitz is amazing!", "thesecondmartha": "Sun is also a star", "ro_rho_rhona": "Clean is really great", "rsapberry": "Clean!", "lucy_jane18": "The tattooist of auschwitz", "noellecandler": "I love the sun is also a star!!!!", "anniinakorpela": "Educated!", "christinasweeneybaird": "Omg Educated, Clean and Tattooist are all so good! Educated was the most unique though", "laurfairman": "Clean!!!", "katiedono_": "Educated - bloody brilliant book! ⭐️", "kothremulak": "The Sun is also", "littlepumpkin94": "The sun is almost a star 😍", "alicemayyyo": "Tattooist of auschwitz!", "daisy.jsore": "CLEAN", "kellycavolo": "The sun is also a star and then tell us if you liked it!", "frognflute": "The tattooist of Auschwitz. I also want to read it but I haven't bought it yet.", "lisawebbphoto": "Tattooist of Auschwitz is really good and quite a quick read. Very harrowing though :(", "erique_": "Educated!! It will change your life!", "algadore": "I finished reading Educated yesterday, it's well worth reading!", "bellamarziello": "The sun is also a star!!", "maddie.claire.c": "Educated!! Its so wild, but also very inspiring", "littlesarahmay23": "The tattooist of auschwitz!!! It’s amazing!! Heart warming one minute and funny the next. 😊", "miguelof": "The tattooist of Auschwitz, then do a review", "_andrew_w_s_": "The tattooist of Auschwitz has been the best book I've read this year", "_alexshanks": "Tattoo of auschwitz", "polly.em": "clean!!!!", "hhaykey": "THE SUN IS ALSO A STAR", "bonnkeeet": "The tattooist of auschwitx x", "ankitabiswas_": "Educated", "nniamh.g": "What's the tattooist of auschwitz about?", "theroamingreader": "Tattooist is overhyped and through an injection of misguided fictionalisation (which those who run Auschwitz have panned) , diminished the emotional punch. I’d go for educated", "chloealladine": "The tattooist of Auschwitz 👌🏼", "onehungrymoomin": "Educated!!!!!!!!!!", "larissahilhorst": "The sun is also a star 🌟", "snugglingonthesofa": "I have heard great things about the tattooist of Auschwitz!", "heyknittinggirl": "The Tattooist of Auschwitz was really good", "salome_esteves": "Educated is brilliant 🤓🧐 *", "nikkicorbett14": "Tattooist of Auschwitz is amazing!", "gabylee_": "Educated for sure.", "madsbirts": "Tattooist of auschwitz is sad but addictive reading!!", "isaaczz_richardson": "Bottom left", "e.rose_0.5": "The tattooist of auschwitz!!! 😍", "downfallingdragon": "Clean?", "myrthevanderveen": "The sun is also a star ♥️", "titular_roll": "The sun is also a star bc it’s actually a really good book", "evegravina": "The sun is also a star 🔥", "elinorterry": "CLEAN!!!!!!!!", "kaitlynfw_": "Tattooist of Auschwitz", "la.urentaylor040504": "the sun is also a star 👏🏻", "laurence.robichaud": "The sun is also a star 🌟 loved that book! Read it in a day", "mofalk_": "The sun is also a star!!! The movie is coming soon and the book is so good!", "cathyyyjk": "Me and my book club just finished educated and cannot recommend it enough 💯", "elementgallium": "I've only read the sun is also a star, really enjoyed it. I've seen it's being made into a movie as well 😄", "annabarnardwright": "Tattooist!", "saintbazza73": "I hope to read the tattooist of Auschwitz after my wife. Everybody I know who has read it says it's amazing", "me.and.penelope.wren": "The tattooist is really good. Scary but sucks you in.", "jess_rae_m": "I really enjoyed the tattooist! I listened to the audiobook and it was good. I also plan on listening to educated soon!", "beachy_en": "Educated! Such an interesting and inspirational story!", "jessikittyx": "The sun is also a star!!", "ishikab577": "Clean is reallly good", "rachelelizabeth410": "the sun is also a star is one of my faves... kinda cliche plot but it’s sorta the point because the whole book questions cliches and the odd feeling you get when you are living one", "laurennwillox": "The sun is also a star! So good, and the movie is coming out in not long!", "whilehalfasleep": "The sun is also a star!!", "lomiliftsherself": "The tattooist of Ausschwitz is a great book!", "zogazoid": "Clean!! Definitely Clean I absolutely adored this book", "starandbark": "Educated! 😍😍👌🏻", "annamariaalbu": "Educated :)", "lucyptgw": "Clean is amazing!!!", "micaela_b_x": "The sub is also a star is one of my faves! 😍", "loz_re": "tattooist of auschwitz!!!", "no_ra_n": "Oh I really want to read the tatooist oft auschwitz and would like to know what you think about it! 😯💕", "amyvflint": "The tattooist of Auschwitz is so heartbreaking and makes you think a lot !! It’s brilliant x", "myoki_van_den_heuvel": "Auswitsch", "em_clarkson\nVerified": "Verified", "eleanormackett": "Tattooist of Auschwitz!", "jessica__streets": "Tattooist of Auschwitz! I read it in the space of a day on boxing day (something I haven't done since I was about 12) and it was truly amazing - horrendous - but such a good read, I can't recommend it enough to anyone who will listen to me", "lux_immanuel": "The tattooist of auschwitz!!!!!", "gracereid96": "I read the tattooist of Auschwitz not long after it came out and it was so so good", "avriltravel": "Educated. It's a fascinating book.", "jacquelinexlondon": "Ahhh loved Educated and The Tattooist of Auschwitz!! Some of my fav books of 2018, definitely! So either of those I’d say haha", "madasahatter5": "the sun is also a star is good!", "xbearjames": "Definitely Clean!", "laurahc__": "Clean is so so good", "wllms_art": "The sun is also a star x", "bodiee.jo": "THE SUN IS ALSO A STAR!! SOOOOO GOOD", "marlame_th": "THE SUN IS ALSO A STAR IS MY FAV 💖", "colezilla53": "Tattooist of auschwitz! Incred-i-ble!", "_ellenjames": "I loved clean!! I couldn’t put it down", "sophiajd1990": "The tattooist of aushwitz is a good read!", "competent_equestrian": "The sun is also a star", "nicolehannahbell": "@mrslaurakelsey", "libby_rimmer": "The tattooist of Auschwitz!!! Its amazing and i got fully invested; so much i cried 💕", "ripaige98": "If you’re looking for a quick read definitely recommend the sun is also a star! It’s sweet and heartbreaking at the same time!", "katerinamatiaki": "The sun is also a star is my absolute favorite book! If you liked everything everything, you'll like this one even more!", "scarrednotscared\nVerified": "Verified", "benitageppert": "The sun is also a star😍", "grebditch": "The sun is also a star ☺️", "lindsayarmor": "I’ve heard Educated is phenomenal!", "lottiesbuymenow": "Omg the tattooist of auswitz is THE best book i have ever read just finnished it its so emotional! X", "ellen.rachel121": "The tattooist of auschwitz", "emiliesmith1203": "Just finished Educated, a really interesting read", "justcooky": "Currently reading Educated myself and it's so freaking good!", "annesharman1": "Clean was SO good", "nostdaems": "the tattooist of auschwitz is terrifying but great!!", "hannah.davies__": "The Sun is Also a Star!"}