{"self_isolation_sub": "WOW the part in their response article about this being an example of call out culture being used as a weapon instead of people (aka black femmes) doing the work and having hard conversations? ? ? shut up are you fkn seriously saying black femmes need to do more work right now? @wildflowersex", "bbyboyangel_": "kinda irrelevant but omg thank u for the captions that was such a beautiful surprise!!!!!!!!1 and ur so brave for saying ur experience so horrible that they did this to u and other black femmes xxxx stay strong xxxx", "lori.sara": "Wow and their page went private too", "jessieraemonclaart": "The amount of work you and everyone affected have put into this whole situation has not gone unnoticed ❤️ thank you for bringing it all to light because I was totally a supporter of WF and their whole brand. Thank you for sharing", "eat_suite": "I’m so sorry you are dealing with this horrific experience. Witnessing and believing.", "cherrybombinwear": "I've read @wildflowersex response & as an outsider who does not know the whole situation & only the perspectives of those individuals involved ... i really just hope y'all can work this out !! 🖤🦋 Honestly I feel there is a ton of miscommunication unconnectedness & honest misunderstanding. Peoples feelings are hurt & that really should be addressed. Peoples lives are so much different from the next, especially across different CULTURES....With shit loads of TRIGGERS & mixed messages coming from multiple directions. It's so sad this situation has occurred & I hope yaz can find some empathy & compassion for each other to evolve & grow through this to the next level ✌🏼🤟🏾✊🏿", "cosmic_garden_": "Sending love and support sweet sister 💕", "kimraluna": "@blackwomencry", "completelytogether": "Other box fans lol wtf", "the.vshop": "Where can I find their latest response?!", "_allteenoshade": "Has anything gotten better"}