{"conni.biesalski\nVerified": "Verified", "briannepatrice": "👏🏽👏🏽👏🏽❤️", "dyanavalentine": "Can't wait to hug you!", "chaya_labufff": "Yay!!!! Which area are u thinking? Lol so funny I saw u on my block last time you came around.", "scorpiosun_": "Awesomeness!!!!! You’re absolutely welcomed and even celebrated here! 💕🌿💕 Safe travels ✨", "kellikikcio": "SO happy for you to make this move!! ❤️", "ilonawashere": "Excited to have you here at home in LA :) i just got back and i feel like my entire soul has lit up.. hope it feels the same for you💕🌼", "rosewayyoga": "You will not regret living in a less racist place by the ocean and sun. Holy fuck we are in for it. I can feel it. I met you once at a recording of a podcast you did with #Leafly (fuck leafly btw, they did the worst fucking interview) You were a true gem of course though and I had the pleasure of standing with you briefly in the hall where I stumbled over my words and probably seemed like a true tool but I just wanted to tell you that your work has touched me very deeply and I am forever changed I just wanted to drop a note of love and support always from Portland. 💎", "bekah\nVerified": "Verified", "islandirie": "Aaaaaahhh!!! I’m selfishly sad to see you go but I’m also extremely thrilled and happy for you to be in a place that truly home! Any chance of a goodbye karaoke sesh before you go?! 👀 otherwise I’ll be penciling in more LA visits 😅", "theconsciousmama": "Yeeeessssss! I can’t wait to see the magic you create here! 😍", "fawnala123": "❤️❤️❤️", "thejanetbrent": "I felt this for you! And I’m feeling it about Portland too :T Congrats!", "fenestravitae": "Welcome back!!! I feel the same way about LA where I was also born and raised. It clears my everything. Soon. Congrats.", "drena_simmo": "Damn I’m old. 9 years passed so quickly. Felt like yesterday when you moved to Portland. #apricottea", "holisticsomm": "Love this! I’m in Los Angeles right now and I’m thinking about transitioning out here from nyc. (((Dig the vibes out here)))", "erin.blogs": "And sunshine more then two months a year. 🌞", "pumpkinspicemims": "Good luck lovely one! The adventure awaits 💛💛💛", "mamalaurasaysso": "I don't WANT to afford L.A. Gonna build wealth here.", "blacqueunicorn": "As a black woman who’s born in Portland and my roots are there, I get what you’re saying... but also raised in Atlanta truthfully LA is no better, they just bullshit and smile in your face here. Same sentiments. But I feel ya. On another note I’m super into the mix of sensuality and dance and I hope to take class from you and explore sexuality further while we’re both here in LA 🌹💜", "karmenprgirl": "What kind of beads are around your waist! I am interested and want to learn more", "carmenhdesigns": "👏🏽👏🏽👏🏽👏🏽 Wonderful to hear.", "jessikneeland": "I just moved here!! I’d love to meet IRL when you come back!!", "ljmom2arigray": "Just moved back a month ago. 🙌 feel so much better", "just.monid": "Listen to yourself sis✨ We are ready for you in LA !", "cfapdx": "@evyan.whitney Portland, OR? If so, our loss!", "zenn.nai": "Yesss @evyan.whitney we welcome you with open arms!! 😍😍😍 I hope I get attend one of your amazing future events in LA! Lol #manifesting", "glowingupinnuevayork": "Yay! Congrats!!👏🏽👏🏽", "yourwayback": "REV FAM. ❤️❤️❤️", "nayno55": "That is exciting news! I hope we can get together before you leave ❤️", "theideagirl.co": "Okay that’s it I’m coming tooooo @evyan.whitney 🗣🗣🗣🗣", "myrn_____": "❤️❤️❤️", "gabrielaaa_57": "Yayyy! Let us know if you ever have events here in LA✨🙏🏻💕", "4locrow\nVerified": "Verified", "bridgetbadore": "Omg yay!!!! So excited for you ♥️♥️♥️ so much joy and abundance and radiance and boldness 💕💕💕", "danowensmgmt": "I’m so happy 😩", "serikovaoblaka": "You look so happy! That is beautiful 🌼🌼🌼", "leahpinault": "yes!!!", "kate_marolt": "Omg congrats!!! And selfishly excited you’ll be so close!", "missorian": "Yessss excited for you! I'll come visit in May!", "caitlingrayce": "I want to like this on repeat forever ❤️", "writerontheradio": "This is great!!!", "buttalieee": "So happy for you!!!!!!!!! Sending love and greatness for your move ❤️❤️❤️", "extracelestial": "so excited for you 💖💖", "wishcandy": "Ahhhh congrats bb, I’m happy for you 💕💗💕", "ericbgrey": "So happy for you and will miss you both so much! ❤️", "ellensbowles": "👏🏽👏🏽👏🏽 welcome back!!!!", "zoieloves": "this is delightful news 🌊", "meghantonjes\nVerified": "Verified", "miaannicole": "so happy for you !!! 💗", "oliviainthewild": "Omg!!! Portland is going to miss you so much! I’ve appreciated knowing you live in the same city that I do! But I’m glad you are going to be surrounded by light!! Yay for choosing a flourishing life.", "laurenlemon": "Sunshine forever! 🌈", "emiliewapnick": "Congrats!!! Sounds like the right move! 💛", "missaketi": "I feeeel youuuu girl!!! That’s super exciting. Portland will miss you but I hope we can connect when I visit. I have a bunch of family in that area! 💜", "theworldandt": "Ohhhh that’s an exciting change. Also, it’s nice to listen to ourselves and leave spaces that no longer serve us.", "corazondequetzal": "Yaaay!!! Congratulations!!", "beccareneeee": "I hope the move brings you joy. I visited Portland for four or so days a couple months back and only saw a handful of POC. I’m white and it was far too white for me.", "iamjheanell": "Jupiter is in in Sagittarius which makes this a favorable time to make big leaps, especially relocation. Congratulations 🍾 There is lots of increase headed your way!", "idealblackfemale": "Looking forward to having you 🖤", "jassyonyae": "Amazing! When I visit hope I can see you. Congrats on this beautiful change", "scribblepaper": "So happy for you!!! 💓", "bng.design": "YESS!! Wow I’m so excited for you 😭💕", "venuscuffs": "My home ❤️❤️❤️", "theamonyee": "Oh the things we can get into now😈 @jimanekia", "foriawellness": "Great news!", "callme_b08": "👏🏾👏🏾👏🏾👏🏾 MAY IT BE SO!", "rinnyriot": "*MA$E voice* WELCOME BACK", "asanakagawa.wav": "Hell yeah. We welcome you back home 💕", "say_mantha": "LOL, someone just told me the other day, \"Portland is whiiiiiiiiiiiite.\" CONGRATS GIRL!", "jensotelo": "Yay✨💫", "nic.antoinette": "Thrilled for you!💕", "jeevansingh.co": "Yesss 💛💛💛", "un_becomingme": "see you in sunny CA!!", "onnissia": "This last paragraph tho 🤣🤣🤣🤣🤣🤣 please don't ever lose your fire.", "puremox": "Yayyyyy. Come baaaaaack. We gotchuuuuu", "plasticxcandy": "💣Yeassssss we gained a goooood oneeeee", "arielakozin": "YES!!!", "lori.sara": "This caption 😭✨💕💕 just changed city for school. Wishing you only good shit for this transition", "briannewaite": "How exciting! I grew up in PDX and I always said I loved growing up there until I actually left and was like ohhhhhh this place sucks. 😂", "tealeigh": "Hell yeah you made a decision!! So happy for you!", "leahsteinersuter": "❤️❤️", "aaaashleyhook": "I feel this so much ✨✨✨", "whatdianadid": "Yaw! You are sooo welcome ✨🔥❤️"}