{"cbirdward": "I’ve been deeeeeep in my process too. I have most of tomorrow set aside for some healing and bath time 😻. Sending all the Love! ❤️‼️", "joy.m.salyers": "Same!", "the_trap_dr": "That's a rough one get your so some good self care this week🤗", "giveafoxamuffin": "Giiiirl, those weeks be so damn hard a soul clap from me to you for getting through another one 👏🏾👏🏾👏🏾 But the sun on the otherside and the warmth of healing it holds is sooo worth that journey. 💚💚💚", "shaneledwardsart": "saaaame", "sunflowersutra": "❤️", "natashaxleigh_": "Sending love to you. You have been through hell and you have been through joy and it is painful and blissful and so much in between, but you are rising. I’m eager to watch you burn the bad down.", "_______ec_______": "Amen!! ♥️♥️♥️", "thelolapickett": "Truth. ❤️❤️❤️", "lavme83": "🙌🏽 go girl 💙", "babbycakessss": "This caption!! I have to use this it’s so real!! Man sometimes just the thought of thoughts of past/childhood traumas is enough to make me cringe. But we must let go and let God. Self healing is everything as hard as it is it is a must!! Took me two decades to realize that too!! But I’m on the way!!", "futureiswilderness": "BET", "katja.ko_do_arcoiris": "I am starting to embrace the darkness as it is part of the whole, like yin and yan, so only by embracing the emotions that might hurt and feeling then fully I feel like I can free then and wnjoy blissfull feelings more. So walk through the valley, I think you have some powerful tools already. So keep on walking and digging deep and I am sure you will reach the source of your power and healing in every step you take", "8oldsoul8": "So happy for you! Our inner lights will be even bigger every single time we wade through the shedding.....the last 5 days have been sooooo extra for me. This retrograde has been rough ❤️ 👏🏻👏🏻👏🏻👏🏻 Keep on keeping! Beautiful image 😍", "virtualloyalqueens": "I love it! You’re so strong and amazing for this!🙌🏾👏🏾👏🏾🧡🧡", "nataanii_": "Same type of plans happening", "maquinnasloan": "@natashadgray this power lady will likely feed you and your work. @evyan.whitney. the darkness fights back. You are an inspiration🔥", "decolonizingtherapy": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "dirtyfingernails_pnw": "Hard road to travel. Strength and love✨", "oliveoilbby": "I adore your openness and how willing you are to struggle towards a better self! Your posts are wonderful ✨💖", "tasha_whittle": "Yes!!!! I hear yah! Doing it too gyal! 💪🏿", "nimjacks": "Wow! I did the same thing this weekend @evyan.whitney 🙌 much love and respect from my heart to yours 🖤", "vickynoir1": "How do you go about processing? Is it a ritual, writing down, meditation?", "laylowcruz": "Wish you was mu girl friend everyday we doing it 😂😂😂😋😋", "ms.daw.son": "Damn, I love the realness in all of this ✨🖤", "booksandbirth": "Good for you. So brave and so hard.", "nia__lynn": "Literally in a beach house surrounded by my family going. through. it. It has been a fucking nightmare of childhood trauma and I feel this so hard, friend. I've been lucky to have my partner here and mother ocean to help soothe this Cancer sun Pisces moon soul. Because effing hell dude. What a time to be alive. 🌊💙🌕", "j_dmlo": "Thank you 🙏🏼 Posts like these keep me sane.", "jasmin.de.jardin": "💜💫😘😘😘😘😘 I feel you girl! Stay strong and beautiful 💜 it’s been happening to me🌸💫✨💫💞 much love gorgeous", "morganpansing": "Totally feeling you.", "molliecaitlinbrigid": "🌈🌈🌈", "rude_gal2k19": "Finally taking some time to lie on the beach and get stoned with my bestie now that we’ve finished our exams !", "sweetlikemaple": "❤️💕🔥 yes!", "kariahdream": "Ahh I’ve been avoiding the depths for a while and I know the time is coming for me to dive in. 🦋", "jasmynbrielle": "talk about it!", "sambam.eats": "*touches the depths of hell within v often*", "cherrybombinwear": "SAME 😭👁‍🗨🦋😭", "buttalieee": "Sending lots of kindness and love for these feelings and intense periods of processing!!!!! I am doing the same in my own time and way—-you can do it!!!❤️❤️❤️", "kinzieferguson": "Omg saaaaaame this weekend. Dealt with a lot of my shit. 🤯", "ellagracedenton\nVerified": "Verified", "dream_building_ford": "My weekend was similar. And oh it been hard", "mybodywpg": "💜💜💜", "_geralartist_": "Healing is a path, long, arduous, worth it.", "love_dmc": "Ugh. Been there. But when that freedom hits you!!", "daredevilbean": "That’s what I’m stuck with 💀🤦🏻‍♀️ Old stuff have reopened themselevesss|| 😀💀", "jbnakedwords": "Remember today is the most important day. Can’t change yesterday and the future ain’t here. Today you get to decide to love the skin your in and what gorgeous skin! Loving your honesty love it more to see you at peace and loving you. 💕", "josietantricalchemy": "Beautiful. And brave. Hello Scorpio time.💕", "artofmediocrity": "So right there with you 💫💗", "amb1gu0us_th0t": "glad to hear someone else has similar weekend plans 😭👏🏼💕❤️", "meghoogendam": "Im in that right now. Dont even why im on socials because that obs doesnt work lol. Any tips for this journey?", "dazeypea": "💕", "kangelblack": "I did the same thing as you... childhood trauma + self acceptance 😭😭", "naominasman": "I've been doing this a lot lately since I quit drinking. I'm trying to deal with trauma bonding right now. ❤️", "kmary888": "@chaannnty “you don’t know what you’re missing!” 😂😅😭", "gopiepointe": "Same", "doodleb0b_": "this entire post ⚡️", "luminous_dew": "such an honest and raw post, thank you. and it’s so true- the pain hurts so good for future me", "eccentricjukebox": "Wow... first thing I thought when I saw the photo, before reading the caption, is how vulnerable and child-like you look... that's some hard shit to go through (Understatement!!) - witnessing you, sending love 💜", "lisaspliffson": "Same here!! Sending you all the love, hugs and spliffs✨", "my_chaotic_tranquility": "I’m 44 and have been processing 24 of ‘childhood’ trauma for 2 decades as well. I used to think there would be a time when I didn’t have to, but I long ago accepted that it is as much a part of me as the tiny freckles sprinkled across my nose. I never knew innocence, but I try to gift it to myself each time I process. Now instead of processing through my eyes that saw too much too soon, I process through the protected eyes of my children. Life can be magical. Love & Light to you✨❤️✨", "mmoon.eyes": "Same!🔥", "juliaonimraleb": "When people say \"processing childhood trauma\" what does it mean? How does it look like? Is there something you do to process or are you just letting your mind process it? I have some childhood trauma and I don't think I'm processing it. I don't think I know how. What should I be doing? I don't get it.", "smokeperfume": "Relatable! ❤️", "lucyteamarie": "About to start somatic therapy and feeling very nervous—this gave me some strength! Thank you! 🙇🏽‍♀️💗", "thickabodfitness": "I find myself often having to process and reprocess childhood trauma as I raise my son, a 4 yr old... I “burp up” my own trauma all the time as I provide things for him I never had and protect him from things I never was. My heart is with you as you dig through and let go of the things that don’t serve you here now💕", "im_still_here_sgb": "🙌🏼", "free.queency": "God bless me I’m not alone 🙈haha spent reliving these childhood dramas too ❤️ we’re on it ✊🏼", "druid_olivier_deschamps": "❤️", "__heart.beet__": "✨🍁🧡", "theeblacktombraider": "For real. I spent 2 hours journaling yesterday. 😔", "starryieyed": "Im doin the same work. Curious what you have at 19 degrees taurus (full moon location).", "connerleecarey": "Same. Is it mercury or was it just time—idk but woo it’s been a lot. 💜💚💙", "puremox": "I love you. Thank you for sharing.", "be.holden": "same", "johannnaalinnea": "queen", "dreaea": "Yes to this", "relbrender": "Saaaaaaame", "smfj13": "Not so much childhood trauma but relationship traumas and how it affects the current relationship I am in. It was a hard communication weekend for the both of us but good. I am so tired", "lisa.londres": "Oh I got part way there.. anyone in need @christinehassler podcast over and on with it, has an amazing recent episode about unsupportive parents that helped me ep 217", "atpeacearts": "Sending love and healing. That journey is NO JOKE! But totally worth it", "katherine_winters": "Good to process. It was a rough weekend.", "aquarian_misfit": "I’ve been going through this too", "senojnerol": "Thank you for sharing! I did some processing with my partner too. It’s hard but rewarding work", "liz.duclos": "Yes. 🙌🏼", "adriannadoula": "Ohhhh yes !! this is me !!", "delilahsday": "Will you be my mentor?", "daysofrose": "How did you go about that?", "flwrgirl15": "💛💛💛", "aqualight1997": "so inspiring since I have been following you I have made sense of alot of things about myself i didn't initially understand...your level of strength is beyond beautiful 💜", "barbiesblackfriend": "Oof I’ve done the same this weekend. 😭 Tears on tears but so worth it. Happy mercury-in-Scorpio retrograde ✨✨✨", "tessarave": "Sending love 💛", "madzabouty0u": "Same girl, same", "kinkycoilycool": "Whew I felt this in my soul! Digging that deep and purging is so healing.", "kikigmakeup": "Can we talk about how visceral this Scorpio Mercury retrograde has been? Sending you some softness for your healing 🖤", "orrecled_": "I guess it's a long process but how did you do that?", "radicalsomatics": "Good work! With you.", "yo__nadi": "Proud of you and thanks for sharing your journey", "sarlejeffries": "Truth!", "barefoot_bella": "Me fucking too and definitely was in the tub just like that at one point. 🖤", "rachaelmaddox": "❤️❤️❤️", "bhvhankes": "Deep in it with my partner. Always incredible how the soul-shaking, terrifying self-healing moments lead to incredible, sublime experiences. I hope those are on the way for you.", "corazondequetzal": "That's what Scorpio is for 🙌🏽 hugs, it hasn't been easy.", "mindonamantra": "Shadow work is key to helping you find your Resilience. Peace to you sis, there will be flow soon🌻.", "almaloveone": "Same here ❤️", "lookdowngodown": "Did the same- but seems like the process is endless and oh so exhausting. Shit is HARD.", "lovewangari": "Hello Scorpio season ✨", "alyssadiv": "OMG SAME!", "melk_earney_": "Same, for two weeks now", "pronounced_gozay": "Whew!", "seejosiesmile": "👏👏👏👏so incredibly true! 🖤🖤 good for you! Growth is uncomfortable, but the payoff is worth it!", "tastee_tai": "Reliving that trauma can either kill you or heal you. Keep getting better queen‼️", "_jazminemarie8": "Amen to the caption, all facts!", "emma.does.things": "These are the posts I'm here for 🙌 Spent 20 years being terrified of the truth coming out about my trauma. Now it's out and it's time to focus on love instead of fear. Your honesty and vulnerability are inspiring and this is the representation I need to fuel my own self-healing. Thank you!", "whatdianadid": "Big energy coming this week 🙏🏼✨ no choice but uplevel ❤️", "sippinhannah": "Yes. Diving into childhood traumas is a difficult & beautiful process", "choir.light": "💖", "thesaltyogi": "I was doing the same thing. Some days ya gotta warrior up and dance with your past 💖", "maceytheearthling": "Yeah that sums my weekend up perfectly lolol", "theblackswandiaries\nVerified": "Verified"}