{"tatummarie": "I grew up in a very religious home and was prohibited from taking sex ed classes. I’ve done a lot of learning since then, but i have a lot of harmful stories inside me about sex and a lot of it prevents me from expressing myself sexually. I’m also trying to figure out what I like vs. what the male gaze thinks I should like. Very confusing times.", "dowontheone": "I want to dive deeper into the place of uncertainty and fear. I know this is a life long journey but I started recognizing some blockages (physical & mental) that stop me from surrendering, and when I do feel the struggles happening, I can’t help but feel ashamed, upset and sad 😞 I would really really love to work with you individually but I noticed on your website, it says next enrolment would be in spring 2020, so I’m willing to try your courses while I wait! 🙏", "briannewaite": "Trying to navigate my sexuality after having children and trying to figure out where my lack of desire is coming from. Why do I cringe every time my husband says I’m beautiful? Why do I flinch every time he touches me? How am I supposed to have a physical relationship with him when, at the end of the day, having someone touch me is the last thing I want? And why do I feel so guilty that his needs aren’t being met when mine obviously aren’t either because no idea what I want anymore. Okay that was more than one sentence. Sorry about that. 🙃", "co.lleen282": "My partner of five years and I split about a two years again and I’m still having a hard time finding myself as a queer person being single now. I love this body of mine but knowing what to do with myself as a single person is still kinda awkward at times.", "mar_bar75": "I am newly transitioning to a poly/consentul non-manogamy after nearly 2 decades with the same man. Whatcha got for me? 💗", "popster613": "Thank you so much for taking time to respond to all the comments- you are amazing! I recently was diagnosed with vaginismus and have realized that my fear of sex has now become a physical reaction my body is having through vaginismus. I will be doing physical therapy but what course would be best for working out of a fear of sex?", "shawna_leigh": "I’m sharing my story in a dm but thank you for this🌹🌹", "thesexwithyourmind": "🙏🏿💕💕", "ilana_cedar": "I’ve recently experienced some changes in my body for a variety of reasons, and am struggling to recognize/feel it as my own body. I would love to get back in touch with it and feel connected to it again, especially as a non-partnered person whose body/sensuality is almost entirely seen/enjoyed by only myself ❤️", "bish_birthwork": "Trying to purchase the 30 days but it's saying my card will be charged the full $195. Do I need a code or something?", "_jasminrh": "I'm love expressing my sensual side with myself, & with my partners- nothing feels more empowering. But, I haven't been able to let another person bring me to orgasm in almost 2 years. I didn't have trouble before, but after a very toxic relationship (w/ someone who was always able to bring me to orgasm), it's just not happening. I can let them bring me close, but it won't happen unless I come in for the assist. I've been intenional about switching up how I cum so I don't train myself a certain way, but damn", "yasha104": "Really confused by the courses. I feel fine with my body and masturbation. My issue is to demand my orgasms in hookups. That’s still super intimidating", "mauraquarian": "I have realized recently that because I am in my own head a lot, often I am disconnected from my body, my true feelings & intuition. I’d love to be in a place where I feel grounded and connected. I want to totally comfortable and confident in my body/sexuality/sensuality without relying on external validation (like waiting for a partner to compliment me).❤️ thank you.", "essentially.cosmic": "I just want to express myself comfortably. I went thru 12 years oh childhood sexual trauma. I literally feel negative beliefs bored into my skull. I just want to feel sexy and beautiful. I have an amazing partner who is kind and authentic. And makes me cum allll the time. But when I want to initiate... I get scared and don't let myself and blame low libido. I feel shame ariubd being sexy because I have big boobs. So I feel like I always want to hide. I feel betrayed by my body.", "clasby": "I'm currently in process of working on my wounds around sex and sexuality. I was sexually abused by multiple members of my family, starting at a very early age until I was 11. I'm on the d.i.d.. spectrum. I often disassociate during sex. I just spent the last year with no penetrative contact in order to better understand my relationship to sex and desire and intimacy. I'm now in the next phase of learning to experience ecstasy without attachment and am becoming physically intimate again with new people, but it's scary. My old stuff keeps popping up, not just what I am conscious of regarding my previous sexual partners but also the incest wound that was created so early on and crossed all the wires. I feel like the sexual liberation 101 is best for me, do you agree? ❤️", "whats_up_marie": "@_namukasa_ not sure what your 2020 goals are, but obviously I thought of you because #learning #growing #healing? 😊", "takemetonever.land": "Hiiiii, I love your content!💕", "owl_ethu": "@oshu_owl", "evyan.whitney": "PS: Need help deciding which courses/guides would be best for you? Leave a comment and tell me in one sentence where you’re at or want to be in your sexual liberation and healing journey, and I'll help you pick one that suits you. ✨", "noah_minustheark": "I want to be in a place where I'm not afraid of being sensual, and am comfortable with my sexuality. What would you recommend? Thank you so much ☺️", "ninardarling": "Virgin, sexually frustrated, afraid of giving my body to someone who doesn’t care for it.", "kt.walterr": "I am very comfortable in my sensuality and sexuality, but I have a hard time believing they and my body are worthy of true love of myself and others", "emmelyareyn": "💕💕🌹✨ just scooped the Sexting Myself guidebook 💜 so excited ☁️", "tarabogatsu": "Omg Ev’yan, I just posted this onto my story and Instagram removed it claiming it goes against community guidelines?", "babymooses": "Having trouble connecting to my sensuality and desire (and with my partner) due to medication, mental & physical health, and challenges with identitying and asking for what I want.", "sistersisterbreathwork": "💕💕💕", "nicoleokai": "Excited! Just messaged you ♥️♥️ @evyan.whitney", "blue_eyed_brianna": "I would like to be in a place where I am comfortable with my body and sensuality after gaining some weight and discovering that I am on the asexual spectrum while my partner is not. 😊", "polkadotlibrarian": "I’m so excited to start the 30 Days of Sensuality. I had a mental breakdown a month ago and have yet to reconnect with my sensuality since, so this will not only help now but will help in the future too 💗", "emmalove415": "Hi there @evyan.whitney, thank you SO SO MUCH for the work that you do! Finding your offerings and page has been deeply transformative for my life, and thank you for so generously sharing your spirit and wisdom! I’m looking to dive deeper into sensual practice as a non-partnered person 💗 I’m in school right now and so spend a lot of time in my head space, but I want to connect so much deeper with my body! I do practice sensual dancing a few times a week, which is so beautiful and one of my favorite things to do 🥰Also, where masturbation is concerned I tend to only do so in one way (with porn and a vibrator), but the idea of using just my mind is scary for me! I know this is a lot of info, and thank you so much for offering your feedback :) Thank you so much again for all that you do and give! 💖💖💖", "thenoisyplant": "I want to be in a place where I can accept my lack of sexual/romantic attraction to others and embrace the existing sensual/sexual relationship that I have with myself and incorporate daily rituals to ground into my sensuality🌱🌱🌱", "bleedingbloom": "I feel pretty confident and sexy. Most of the time i love myself but definitely struggle with some body image issues. I regularly masturbate using my wand but rarely branch out to any other form of self love/sex. I want to work on my relationship to sex and learn my needs and how to communicate my needs to partners in order to have more fulfilling relationships. I want a healthy relationship with sex and men"}