{"wosieposie": "❤️❤️ I can so relate to this! Thank you for sharing♥️", "iguana_jamgram": "Have you read Self Compassion by Dr Kristen Kneff? I’ve found it so helpful. 💕💕", "emmylu_": "This is beautiful.", "jennelotus": "Thank you, beautiful lady, for sharing this realness. It’s the angelbaby in me (and us all) that hurts the most. Your words brought the tears, for you and for us all, and I thank you!", "alx6grls": "Phew! You are speaking my truth!", "victoriaadukweibulley": "♥️♥️♥️", "raeeeamieee": "Welppp, I just blubbed my wee eyes out! So much love for you + for this", "kelliepriceless": "I feel all of this ❤️❤️❤️❤️❤️❤️", "babytelerouge": "You are so good🌿A force for good in this world, and I have so much respect for what you do. I like you so much.", "itsjujubae": "💛💛💛", "beautty_queenn_": "Thank you for sharing", "chaya_labufff": "You’re so inspiring Ev’yan!", "_marijkeaarntzen": "@floortje.louise Dat stukje van I am good, prachtig. En op een of andere manier vond ik het relevant nu, omdat dat voor jou en mij onze kern is. En intentie naar onszelf en naar elkaar ❤️", "sacred_flame_healing": "Love this! Thank you for your transparency. ❤️", "_cicada_rhythms_": "Thank you for sharing 🙏🏼 tears & trust bumps at the same time", "bunion_smalltowngirl": "powerful", "_alannagardner_": "This is so beautiful and powerful. Been going through my own journey of processing childhood so this hits home for me 💛", "nicynics": "This brought tears to my eyes. Thank you so much for sharing. Hoping to incorporate more rituals like this into my own practice 💗", "luminatingruminating": "Thank you for sharing this. I have a similar belief that I am evil that I am working on in therapy. I am going to bring this into my altar practice too. 💗🙏", "sibu_makeleni": "Literally tearing up cause I relate to this..", "_leeuh": "@anasarabiavl", "hercreationsbyshe": "Love crystals? Visit our page for handmade, wire wrapped, crystal jewelry. Peace, love and light. 💖🙏🏽", "lilianloraine8": "You are protected🤍 I’m praying for you to find your sacred belongings back. Please stay strong and be reminded that your angels will never leave your side and the 5d is there always. Your stuff hold a lot of powerful energy that belongs with you. I pray it will return back to you. 😔", "consciousbeauty._": "I felt all of this... Much loveee to u on ebmarking on healing you... All of you💜💜💜💜", "notyettrending": "Amen ashe", "emilytebbetts": "Wow. Thanks for sharing this. I’ve been working on the same core belief with emdr for the past several months, and it’s stunning how deep it runs and how it creeps it’s way into nearly everything. Feeling so much compassion for little (and current!) you and all you have carried ❤️", "bathing_wonder": "This is such a beautiful post. Excited to check out some of your work on sexuality. 🧡", "kaylahedwall": "Thank you for sharing, this is beautiful 💖", "thebeautyandthehorror": "Oh this is so beautiful and powerful. Thank you for sharing. I am on a similar path this season and it is hard but important work ❤️✨", "naturalbornkeira": "Love the vulnerability, thank you mama for this share", "t.pflanze": "So brave and inspiring to share. I feel honoured and humbled as a fellow human to be able to read a part of your story. Sending all the love you deserve!! ♥️♥️♥️", "abenawaistbeads": "💛💛💛", "sarahmhistand": "I feel this 💕 lovely truthful share!", "orcabel": "Thank you evyan for shering this with us. I can see for myself the same thing and i can see how a young girl and her fears r running my life!", "alison.brodie": "Wondering if you can share how you make this ritual feel genuine for yourself even as you're filming it for instagram. It's something I struggle with - how to share vulnerable moments without it feeling performative?", "natali.nicole": "Thank you for this. This resonates so deeply.", "_chelsearhodes_": "Thank you ❤️", "jensotelo": "Thank you ✨", "gieselleallen": "yesss to \"affirming in myself that I am good.\" 💖", "goddessofcarrots": "Relating so hard to what you expressed! Thank you for sharing ❤️", "digital_dancer_": "So much love for you and your journey 💜 thank you for sharing, this helps me realize I am not alone in my own struggles, and you model for me and for so many others how important it is to love yourself", "meeegan__": "this is so powerful. 💕 i’m doing similar work and it’s very very good to see others are too. that it is okay.", "lizzyleo123": "Oh, Evyan, such beautiful tender work", "iyanuuu_": "Thank u for sharing this deeply personal process on your platform. Your bravery, transparency, and authenticity do not go unnoticed. 💞💞💞", "kinkycoilycool": "Wow this is so beautifully vulnerable! I did some digging as well and I feel a little lighter 🧡", "thebodyprophet": "Thank you for being vulnerable and for sharing this. 🙏🏽💗", "amanda.louise_91": "@sagirainbowsparkles 🧡🌻", "alexxjeann": "Thank you so much for sharing this. The tears came as you began to say “I am good”. 🙏🏻🌹", "tigerlilxe": "Beautiful 💖", "evajannotta": "This is beautiful @evyan.whitney, thank you.", "ohayitslj": "Love this so very much. I went on a similar journey this summer & made little ‘oracle cards’ of myself as a young one; after the process of recognition & healing, i honor her by drawing on her strength & reacessing strength by consulting her in this little deck i made", "ethereal.1\nVerified": "Verified", "menakirmani": "I feel resonance. Thanks for sharing. And thank you for sharing your altar too, I can see that it is a sacred space.. Beautiful too. X", "ouifemme_": "this is so beautiful and authentic! thank you!", "radicalsomatics": "I love this video. And you. ❤️", "ifurie": "This is incredible as I've been going through similar things. Memories feelings inner child reparenting lots of grief crying lots of empathy crying. So glad to know I/we aren't alone 💕", "rosytintedlife": "Thank you for sharing this piece of you with us. I can so relate to some of this. Grew up in a household with dv and emotional abuse.", "daniellefrances_": "This is so beautiful!!! And I have the same Chakrubs 😍💜", "jodielayne": "I love this and I love you. Thanks so much for sharing this, E. ✨⚡️", "shacuana": "Thank you so much for sharing I'm on the same journey and it's so hard and bittersweet it feels like. YOU ARE GOOD🤗❤️", "nomoreruts": "Thank you so much for sharing. I relate so much to this. Sending you lots of hugs. 💓💓", "s.crumpton": "💛", "rabbischmooly": "Thank you so much for sharing this beautiful resurfacing and journaling with us about it 🌹", "cassanovaduvall": "This Is Beautiful! Your honesty, vulnerability, and openness to love & heal your inner child! ❤️ This I know is very much needed for myself as well! Building an altar is would be a great start for healing her as well. Thank you for being an example with all your honest expression. Just recently discovered you but Love You already! Much Love Queen! ❤️✨ @evyan.whitney", "raqaellaque": "This time has also been a powerful letting go of old pain and fear and fierce loving of that “angelbaby” who suffered through it all. Thank you for sharing your vulnerability and inspiring us to speak about it openly", "amanirakeia": "magicallllll✨✨✨✨✨", "little_wildheart": "So good. So important. Thank you 🙏🏼", "tropicgxddess": "😭💘🙏", "kailani_coleman": "In tears love this ❤️❤️", "mandaschauer": "Am struggling right now. Thank you for this. Sending you love and light ❣️", "ccapitine": "🥺❤️🙏🏾", "miss.vibes": "Very Deep and Thoughtful.. Yes Queen ❤️👏🏾", "evyan.whitney": "PS: put some photos of your younger self on your altar. light a candle for that precious angelbaby & give them your attention. write them a letter & tell them you see them, you love them, & you’re going to do whatever you can to protect & heal them.", "nitashajackson": "Wow... This resonates so deeply with me. Thank you for sharing this. And yes yes yes!!! ♥️♥️♥️✨", "aleksandrakusnierkiewicz": "I cried. Thank you.", "rachaelmaddox": "Loving you. Brave, beautiful, beloved.❤️", "tishushu": "♥️", "namaste_shawty": "Thank u ✨", "lala_11_x": "Thank you ❤️", "still.i.rysse": "Love. Thank you 🧡", "andyoureyebrows": "I really really needed to see this today. Thank you for being vulnerable with your experiences, and trusting me with it. 🧡🧡🧡", "pusssywitch": "😭💜💜💜", "wellwithnoel": "Wow, this is beautiful 😭I am good...."}