{"shastaparavati": "Sex that is sultry and silky.", "lucyteamarie": "Healing sex, I need it 🙇🏽‍♀️", "lilkelso": "Thank you for asking the feminine (or the reviving) and then calling in the masculine energy (or the action to take). I appreciate so much that intersection and integration of questioning. 🔥 ⭐️", "krystal_tantricyogi": "These are great questions!! Thank you for Sharing", "blkhippiegoddess": "Thank you for this", "the.jill.i.am": "This is sooo timely!! 🙏❤ I was thinking about this the other day!! I want to reclaim the wild sexy unashamed self of my early 20s. I deserve to embody her", "themonacapone": "I will know I need to masturbate but avoid getting that joy - 2020 priority is getting need met when I see the need", "nicely_nurse": "Any tips on a woman struggling to finish? Has anyone ever struggled with this?", "onthebriiink": "Thank you so much for captioning this!! 🤟🏼", "inhabit_movement": "Loving these questions! 💖🔥", "surefirephoto": "Thank you for your strength and all you share.", "bellacirovic": "Thank u for these questions 💕 I hadn’t paid any mind to my sex intentions ... when I got the email this morning, I was like, yes !!! Of course !!! 🙏🏻🌸😂", "eye.am.samira": "Thank you so much your Artikel was so helpful. I searched all over the internet before and found nothing but nonsense, but you really helped me thank you 🙏🏽", "lookinforgoodcookin": "This is actually at the top of my list for 2020 intentions!", "henrygoatbag": "I got a note that my comment ‘looks similar to others that have been reported.’ Aaaaaahhhhhh!!!! I’m allowed to talk about my body and about sex!!!", "chwalista": "So sad I missed the boat on this book 😔 happy new year! ✨", "inbedwithadamandeve": "💟", "radiant.heart.path": "So wonderful 🌹", "onliashgold": "I want sex with a loving , committed partner! healthy sex", "thejasminebperspective": "Thank you for this video! I keep coming back to it!🖤", "erinzariah\nVerified": "Verified", "inthenest": "🙏 nurturing 🙏 tender 🙌 attuned to self and him 💋 juicy 🤸‍♂️ playful 💚 heart awakening 🐍 nervous system re setting 🐯 primal 🔥"}