{"mama_magda": "Love the work you do. Thank you 💚", "bravespaces": "Yes. This. Thank you.", "charlottetrifle": "Amen. forty something and im still struggling with this", "tati.shakti": "Just thank you ❤️❤️", "caterina.snyder": "Fucking yassss! I'm am learning that as I write this and am eagerly awaiting the day in the next fee months when I go fully public and step firmly into a place a total resistance", "iamjanetphoenix": "Facts 🙌🏽", "mazeylotus": "the absolute truth ❤️", "simplyyjanay": "& that’s on period!", "lizania11": "👏🏽love this. And working on it. Thank you for this!!!!", "nxzeehah": "@queen_victoria17 for that catholic guilt lol", "__heart.beet__": "Yes✨🌱 Thank you ✨🌷🌺", "selfcervix": "yes, I love this <3", "kristysparow": "💗💗💗", "desireonfire": "SO. MUCH. YESSSSSS ⚡️⚡️⚡️⚡️⚡️⚡️", "daisies_tea_cupcakes": "I need to read this everyday", "heyitschrisssss": "Wow. On point 🔥", "ruby_or_garnet": "@lindsayferris 🙌🙌🙌", "ry_rose_s_instructor": "Can I repost?", "eroticren_aryn": "❤️❤️❤️ I always think of this when I start to feel that weird shams coming up.", "_suryashakti_": "👏👏👏", "st3phmarie": "So much shame around my vagina and how it looks, but your posts have helped me so much to unwind the internalized shame. Today I took pictures of my vagina and just stared at it in wonder. After a while I was like DAMN, that’s a good looking vagina 😂. It felt good to feel good about something I’ve felt so ashamed to just even look at.", "lavenegass": "Facts", "xokarenmonique": "👏🏼🖤", "dannahcarr": "I keep coming back to this post every time, and it brings tears to my eyes. Thank you for being an inspiration to women like me to keep chasing their most sensual, liberated self without apologies ❤️❤️", "shersher12": "I literally had this convo yesterday with my girls. Sexual liberation is so key to health & happiness and I pray more women are inclined to free themselves of the ties that bind them. 💜", "savotage69": "i’m a grown ass 24 year old woman and i’m still working through so much weird subconscious guilt/shame around sex due to past trauma and conditioning. it’s so unbelievably frustrating but also so rewarding when i notice any bit of progress. thank you for what you do.", "femconnec": "Yess🙌🏾❤️💋🔥", "cc_jillian": "@iamemilymarie 🔥🔥", "julietteglbt": "Thanks you so much for sharing this. I was exactly thinking and feeling this energy. Life is magic and woman are so powerful. Feeling blessed 🙏🏼🤍", "reneefonseca": "@sopapilla23", "baredheart": "💖👏🏼", "conscioussexuality": "Yes!!! Thank you for this reminder. I'm here for all of this. ✨", "lacaius": "🙏🙏🙏", "aditidevi311": "🙌👏👏👏👏👏", "dear_m_prudence": "@avocad0_mami", "eccentricjukebox": "I am developing my relationship anarchist, non-monogamous self, being curious about my gender (right now I feel \"queer non-binary femme\" is a much more adequate description than \"woman\"), and embracing my attraction to people, not particular genitals / gender. All of which feel like joyous exclamations and affirmations against the sex-negative, anti-promiscuity, homophobic attitudes I grew up with from certain family members.", "baebaeleche": "Yes! I have taken full ownership over my sexuality and it feels amazing. I’m pursuing nude and erotic modeling while pregnant and have also been exploring kink while in an open marriage.", "jeanetteleblanc": "Yessssssss", "megan_a_martinez": "I had DM'd you but you never responded...", "courtneyforcefield": "YES ✊🏽 resisting with you", "jdaef": "Yes!!", "theothermrsandywarhova": "🙌🏾", "rabbischmooly": "🙌🏽🙌🏽🙌🏽🌷🌷🌷🌈🌈🌈 Thank you", "gabbygabygabi": "♥️🙌🏼", "healwithbroocke": "🔥🔥🔥🔥🔥🔥", "misstarateng": "Yes 🙌🏽", "coco_nicola": "Thank you for all you do. Your vulnerability brings strength to so many who need it and we are grateful for it.", "summoningmagic": "This!!! Not to self-promote, but I Think you’ll love this post! https://nataliebreazeale.wordpress.com/2020/01/10/warning-the-following-contains-nudity/", "moonbruja_rising": "Yes!!! Yess!!! Yess!!!", "lutleebaby": "What if you are still with the person that is responsible for most of those traumas and lies???", "charles.revealed": "🙌", "eveningtaylor": "I love that you mention muscle memory, I firmly believe that reiki /reflexology/ etc, coupled with sexual liberation is big healing power!!", "ohjeanettemae": "😞 yes. 🙏🏻", "sailorhontas": "YES YES AND YES 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽"}