{"wherearemykeys_": "❤️", "t.i.n.a.r.u.s.s.o": "✨✨✨ Where did you find this couch 💚!", "alyssac_az": "😍😍😍", "ksamamahe": "🌟🙌🙏", "kaylahedwall": "THE JOY 😍💗 we love to see it!!", "cris_wrnr": "Blessed & highly favored ✨", "clarke_audrey": "Absolutely stunning", "chynnadollyogi": "🙌🏾❤️", "_hadyrasid": "@eiznekcamclaire", "erinzariah\nVerified": "Verified", "natureb.y_": "💖💖💖", "theurbanwild": "Radiant goddess in that purple! 😍😍", "katrina.irene": "LOVE seeing your joy - despite all the challenges thrown your way, you still shine 🙌🏼", "citizenbrown94": "You’re an important part of my self discovery and self respect!! LOVE YOUUUU❤️❤️", "pleatedpoems": "❤️ this is beautiful.", "misslaycakes": "I also wanna know where the couch came from!!! It’s so beautiful!", "hippypippi": "This resonated so much! Shine on sister! 💛✨🔥", "leticiaisnothere": "Lmaooooo your dog is concerned 😭", "mary.elih": "hey I just wanted to say I really appreciated and related to your story today about sexual desire, and especially it just being MIA. I'm really struggling with it right now and hearing you talk about it made me feel seen and not alone. Thank you so much for all you do💛☀️", "yothatsevan": "omg would you kind sharing where the couch is from? couch shopping currently!", "playersrules": "ive spent the last 4 weeks listening to alllll your podcast episodes and have no idea what ill do at the end! im so sad 😂😩 do you have any upcoming episodes or recommendations for other podcasts with similar topics? ✨🥰", "ericalave": "Yessss JOY 💚💚💚", "kaymaystudio": "@whoa.deary ✨✨", "tom.pcc.humphreys": "Where did you take this?", "thejasmineeliza": "💕 so happy to see you smiling again, keep pushing and thriving.", "emlynin": "Beauty 🌼", "climbthesea": "It made my day to see you glowing and basking in joy like this! ✨", "neon.seoul": "you can’t lose what’s within you — just need some reminders to help you shine light on what you’ve already seen⚡️", "_marijkeaarntzen": "✨✨✨✨✨✨✨✨✨✨✨✨✨", "candacereels": "BIG EMPRESS ENERGY!!👏🏽👏🏽👏🏽👏🏽", "brontaesinferno.519": "WHERE DID YOU GET YOUR FIT?!", "teen_idle27": "👏🏻👏🏻👏🏻", "iamheidix": "Sooo happy for ya sistar! Such a beautiful reminder that sometimes we need a season of rest - to take a break and walk away from things for a minute - recharge! ✨ Beautiful message!", "kat.hoelck": "Such a great update. You’re a star 🌟 grateful to hear you’re feeling yourself", "polkadotlibrarian": "Yay! And also that jumpsuit 😍😍", "bea_angus": "Love this post! So much strong energy here x", "empowermentphotographer": "I’m living for this reminder. I love this, “it was a blessing to be reminded that my greatness and verve never left my body.” ❤️❤️❤️", "workoutsbykeeli": "You still have it, never lost it. It's a part of you 👏🏽❤️", "queenchikaodi": "You literally went through the craziest shit ive seen for someone moving across the country. So happy to see you this way— reminds me of the power within us & collective energy ✨✨✨", "gr8p15": "Love X Love is my jam!🔥🔥🔥", "chelseavonchaz": "Don’t hesitate to reach out, Sis.", "tatiannatarot\nVerified": "Verified", "feemarie_83": "LOVE your new couch! Keep smiling. Keep pushing. 💚", "_geralartist_": "♥️ You deserve it", "kacimial": "❤️❤️❤️", "destinyconnectd": "She cannot he stopped", "rinnyriot": "I first watched this on mute and immediately imagined ‘Breathe Deeper’ was playin 😅", "sting_rey": "But can we also talk about how good this jumpsuit is?", "yazzila": "🌻🌻🌻", "bbirna": "I’m normally not so invested in people on IG I don’t know IRL but it really touched me to see your joy 💕 thanks for letting us see this process for you too, healing isn’t linear but it is so great to see you doing a bit better", "khalilauren": "This is so beautiful! It’s so wonderful you were able to access that treasure in you. 💖", "shantiquedesigns": "THAT COUCH!!!!!", "phoebeclaireconybeare": "This post 🔥 I'm so here for this energy for you. Thank you for the work you do and for embodying the power and intention I seek to embody in my own work as a healer and organizer.", "rabbischmooly": "You are radiant and a model for being a bad bitch. Thank you for always bringing your best self, we know you are always showing up as you are 🌈🌷💞", "maryamajayi": "Alexa play Kelly Clarkson’s “Stronger” 👏🏾👏🏾👏🏾", "desireonfire": "⭐️ BIG EMPRESS ENERGY 🙌", "sistersisterbreathwork": "💕💕💕"}