{"witchpixie": "What a beautiful and healing process! Thank you 🌿", "mahsanvibes": "This looks so funnnnn", "heybreu": "Thank you for creating a space for us all, for witnessing, encouraging and gifting us with your time and wisdom and honesty. Extremely grateful for you. I see, hear and stand in love, solitude and humility with you. Thank you again, love love love 💛", "freialeonie": "It was so so goood! ♥️🔥💯", "mujerpapalotl": "Beautiful!", "aleanasihin": "Thank you for this. Feel so much lighter and calmer after this. Love from Malaysia.", "nina_beee": "reminded me a bit of ‘movement medicine’ practice, so great 💗", "pod.draland": "Thank you for doing this! I did it yesterday (on my personal account) and it was such a good release. Finally got my back to crack and had been holding a lot of tension there. Would love to join a future one 💕", "holisticwombman": "You have the most beautiful shoulders.", "lavagroovez": "This felt amazing and I cannot wait for the next one 💕 thankful for everything you are and express with us 💚", "cberthier1": "Thank you for doing this, and for saving it. Got to release some anger and grief that welled up this Saturday.", "fallon.corinne": "This is amazing!! 😘💋💞", "che.che.luna": "So yummy + playful + connected! 💖💖", "thedivineunfolding_": "@lizzdawsontoourdepths I’m just going to tag you in all the things ♥️", "sydnemolnar": "Yes! Next friday please... would live to join 💜🔥", "tiffanykeesey": "Will you be doing another one? So sad I missed this!", "caitlin_j_ellison": "Hi Ev’Yan! Can I share this in my stories - I’m trying to share some pages to inspire people to move and encourage people to tune into your next dance :) ❤️", "karifornialove": "Love this!!! Linking up with you this Friday. Thank you for your ‘Checking In’ email. ❤️", "iamarikalu": "I missed it last week! So excited about tonight! ✨", "lorit21": "@thevillageplaygarden", "camryn__grant": "@_good_v1bes reminds me of you SO much", "fefelu111": "Hi, what time is this tomorrow? @missnicolebrooke @oliviapinkney_", "whitney_efl": "@sugarplumskincare... since we haven’t danced together in years, she’s help me 💞", "shewhobeams": "This was awesomeee💛💛💛", "buttercup8171": "I loved practicing this today, i feel clear and supported. It’s definitely made space for comfort and calmness while also allowing emotions to come to the surface as needed. My body feels a loose, maybe a little worn out (but I did stay up really late) and just feeling so blessed to have this community and space. 💖", "naturalmermaid": "❤️🙏I loved it! Thank you to you and everyone that was there 🙌 I still feeling it and it definitely change my whole day 🌸✨", "foxyasfolk": "Omggg I will definitely join in next Friday! Just discovered you after reading #witchesslutsfeminists and I’m obsessed! Thank you for doing this!", "danielle_miera": "I have felt more present today than I have all week after today’s dance meditation. I made time for pleasure, went for a meditative bike ride, connected with my partner, and ate some fresh food. This felt so healing & needed. I released a lot of negative energy that wanted to be let go of! Thank you, thank you, thank you ✨", "em_the_sheeeep": "I started watching this live thinking I would just listen while doing homework, but I couldn’t resist moving, so I danced through the whole thing! I felt so amazing, and connected with my body and mind. I even felt some anger, which I didn’t even know was there. So thank you so much, would love to join in again this Friday ❤️❤️", "sashasmith4": "This was so wonderful and so needed! Thank you! Anywhere we can find the playlist??", "meeegan__": "THANK YOU for this. so much.", "djaidanadege": "This was beyond healing. I needed some space held for me to move through the many emotions I’ve been feeling. I can’t express how grateful I am for you holding space for all of us. We all felt seen and heard 🤍", "justine.yoga": "Ahh I missed this. Can you share the tunes and I'll dance some now ❤️", "piperuski": "Holy shit, yesssssss!!!!! 🙌🏽👏", "_marijkeaarntzen": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "cash.moneyrecords": "Can’t wait to do it again!! 🙏🏼💖 thank you!", "alwaysperfectme": "Hey my name is Sherika. I'm from St. Louis, Missouri. In June I will be going to Atlanta to take a Sex Doula class!!!! I'm am beyond excited!! I found you on my search for sex Doula info. I think your spirit is amazing and I love following you 🧡🧡🧡🧡🤸🏽‍♀🤸🏽‍♀", "savorkindness": "this changed my whole day thank u so much and see u then!!!!", "gyesenia___": "I was busy during this one but will most definitely be joining your next one! Thank you for this opportunity!"}