{"barbarabailando": "Where do I start... the word “decolonization” says it all. I thought I needed sex ed because my parents could even talk about periods, never mind anything having to do with sex - or even saying the word itself. In my late 20s I finally walked away from hardline evangelicalism after years of experiencing spiritual, sexual, and other types of trauma. In the ensuing years I realized that what I really needed was sex ed that reframed my ENTIRE FUCKING WORLDVIEW. Coming to terms with my sex nature, my body, my own desires, my history, my hurt, my physiological trauma responses... that is the sex education I need and that I’m pursuing. I’m finding that the freedom that comes from the healing is what has unleashed my wildest, most sensual, most sending self. Tips and tricks, that’s all well and good. But the deconstruction of all the beliefs - enculturated patriarchy and Christianity, the unfounded shame, etc. - that is how I am coming into my own. Thank you for this post. You said everything I needed to hear.", "raykersejr": "Absolutely love this post, so many people need to see this 🙌", "danalady": "This is the work I want to do and to help others do. Thank you for your insight!", "zzeeeeeeeeeee": "👏🏾👏🏾👏🏾👏🏾✨", "long_jaw": "Ooooooosh real talk👏🏼👏🏼👏🏼 love you Evyan", "slutofthemonth": "👏🏽👏🏽👏🏽👏🏽👏🏽", "karen_schaupeter": "Thank you!🙏🙏🙏", "illuminatrixx": "She said it alllllllll ladies", "michaelannxg": "This is amazing", "psychesdreamwitch": "@awakeningboutique @sashadillavou 🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤", "missconfidentandpretty": "@evyan.whitney I just completed a Sex and Disability Training last week, and it was not easy at all. I passed my Certification test, but I still have a lot of Independent studying to do and I eventually want to get ASSECT Certified.", "lochilds7": "👏👏👏👏👏", "pleasepinchmehard": "And: prepare yourself for all the not so pretty, not Instagram-y parts of it because sex isn’t always pretty. And what we’ve learnt through years of porn and over sexualisation is just not the truth #waddletothebathroom", "jimanekia": "Say it louder for those in the back!!", "oh_mwanawanga": "Yessssssssss!!!!!", "fayxbaby": "👏🏿👏🏿", "practicingcreative": "YES 🔥🔥🔥", "sydneyraechin": "This!! 🙌🏻🙌🏻🙌🏻", "jalovesyou": "But it’s an absoulute necessary. 🤷🏾‍♀️", "danithreads": "Love how you broke this down. Do you do workshops?", "daredevilbean": "FUCK YEAHH!! 😭💕💕 I LOVE YOU!! ❤️❤️ :D I definitely am trying to focus on things to get rid of & out of my systems!! If I were to try educate people on sex I definitely use posts to help me help them . + I would more likely to tell them about you & other folx who I follow & give great ass information!! :) THIS IS NOT EASY!! 💀 People gotta STOP thinking shit is alll so god damn it easy!! NO!! 🙄🙅🏻‍♀️ It is not!! It’s very serious & it takes immense amount of works just like every other shit in life . 🤦🏻‍♀️", "vagesteem": "And I.... OOP!", "whitneyullom": "THANK YOU 🔥", "pansyco": "❤️❤️❤️❤️❤️", "foyupdate": "My gut reaction to this is: be careful turning people off from being sex educators. As my daughter gets older, I have begun realizing that the school system isn’t going to do a good job with Sex Ed. We live in an abstinence only state with active protests about trans kids using their preferred gender bathroom. I’ve been working on myself and learning about how patriarchal society standards have framed how I see my body and sexuality. I may not be all enlightened nor fully walking the walk yet, but I know I can do a better job than what my kids will get from public schools. And I can be an advocate for organizing and bringing in outside educators for my community. I could even lead some of those talks myself. While I don’t think your comment was aimed at me, I felt like you were telling me I’m not qualified to take a stand for better Sex Ed.", "mamawolfmedicine": "👏👏👏 Thank you, sister. For your work and your words 💕", "mysterious_grapefruit": "Yes! 🔥", "sexedwithirma": "🔥🔥🔥", "jazzyfaye.24": "This is a beautiful post/thread. Thank you for sharing the truths.", "poly.lovers": "I am always so impressed by the depth of your work 💕", "chickflicksncereal": "You spittin' sis!!", "sabstar182": "👏🏼👏🏼👏🏼", "heatherhogandc": "This is a really beautiful post. Thank you for this 💖", "buterrflyhuman": "Chills. I hear you. ❤️", "sophiehewey": "So so so important. I applaud you & your work, Evyan!!! This post puts words to a feeling I have time & time again while viewing \"sex posi\" folks who fall so short from an understanding of the realm of sexual healing as deeply naunced & undeniably rooted in dimantling systemic oppression. You leading this discussion - your words, your work, just you - amaze me! So grateful for the perspective you share 🙏", "inquisitive_human": "🧡", "intwosandthrees": "You write so beautifully!! I could happily read endless essays from you ❤️", "they.them.femme": "\"Y'all don't have the range\" 👏👏👏", "vonbettie": "Thank you for this! I see many sex educators who still carry their internalized sexual shame and it’s easy to spout off an A, B, C method to unsuspecting people but true heart in this and sex work come from undoing the shame and stigma internally first. Amazing reflections! Appreciate you endlessly! 💕", "kimraluna": "Complete agree. I’ve been working through my own trauma for 14 years...The deeper the work I’ve done on myself the more I knew it was time to move into dismantling the systems of oppression that caused my trauma to begin with. I’m grateful to have coaches, therapists and mentors that have enabled me in unpacking and processing it all. 🌹", "beck_ugh": "I appreciate your voice in this field so much. You're so insightful and incredibly humble while you tirelessly lead us in re-educating ourself and it is beautiful. Thank you for this post!!", "roseseees": "😍", "es.lapotra": "👏🏽👏🏽👏🏽👏🏽👏🏽", "baba_witch": "Fuck yesssssss!!!", "kem.contemporarywild": "So many wowzers 🙌🏽", "johanna.hirschler": "👏👏👏👏", "purrslane": "dang this is also so applicable to any realm of healing/mysticism but it is indeed all connected", "tarotandtantra5": "🙌 something that I have to remind myself often is that what I created my platform to do, is share my modalities for healing from assault, and internalized traumatic conditioning. It ain't always fun, and it ain't always what you want- but when people are ready for what they really need, it's there.", "indies_coffee": "Babygirl speak your truth!!🔥😍", "karicalaine": "🙌🏼🙌🏼🙌🏼🙌🏼", "bitrain2apocalypse": "@aishaagain", "jeauxsifeen": "🙌🙌🙌🙌", "bellasongm": "That last part 🥺🥺🥺💗💗💗", "themultifacetedwomxn": "👏🏽👏🏽👏🏽👏🏽👏🏽", "panor3mma": "thank YOU for doing the work so publicly and allowing us into your space to learn from you ✨", "therayndear": "I get scared sometimes of people I have followed in the past who intuitively started hitting me the wrong way with their messages, and then seeing almost a cult like following of teachings that I feel are potentially toxic and abusive, I feel like we all must use discernment in both what we teach and also what we follow!", "sexologist_na": "As rewarding as sexology work may be, it is not an easy profession by any means. You may lose support systems, but you most certainly will gain a new and perhaps an improved version of yourself.", "melindaa_k27": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "pelvicguru1": "Wow. That’s important and valuable words to think about. Thank you.", "sylkyway": "Great words and insight. I work with women in communities in Guatemala and the context is completely different here, there’s so much shame and stigma around sex and sexuality and trauma coming from that. It’s really easy to make it about pleasure when your audience is from a rich western “advanced” country but as always it leaves out the population that needs it the most.", "mmooneyimages": "THANK YOU. So much yes! 💜", "lorit21": "Damnnnnn! THIS and ALL THIS!!!! 👏🏼🙌🏽", "_.sophia_michelle._": "This, this, this, everything in this ❤️❤️❤️❤️❤️", "yahwehprimeminister": "👏🏿if anyone was looking at becoming a sex decolonization professional, the questions would stop", "katakeela": "🙌🙌🙌", "sex.iwishyouknew": "Oooof this is so good. Thank you for the ever reminder ❤️", "thetanyambass": "🙌🏾🙌🏾👏🏾👏🏾👏🏾✊🏾✊🏾✊🏾", "she.illume": "Wooooo yes!!!!", "finding_tessasingo": "🤗😍👏🏾👏🏾👏🏾", "clarke_audrey": "🙌🏼🙌🏼🙌🏼❣️❣️❣️", "blooming_forward": "wow, this is incredible!! reminds me of my own work as a trauma educator, i often don’t feel qualified since i don’t have a degree or certification, but i’ve been doing the inner work of unpacking and healing for yeeeeears. this helps give me confidence. thank you so much 💛", "raviedelacreche": "Gosh this answer is 🔥. If you want to be a healer, you need to look at your shit and do the wprk to clean it out. That's a life journey.", "mandaschauer": "Love this so much!!!", "artlovingaries": "# 6! Yassss!", "seejosiesmile": "👏👏👏👏👏 the real sex educators get down in the deep shit and walk out of it with you. That isn't \"Insta worthy\" but instead it's the most meaningful human moments shared with a genuine person. I'm on a journey to finding my role and \"title\" in the sexuality world, but everyday I'm finding myself closer to the answer because I'm doing the work on myself. Thanks for this post!", "kacimial": "Yes to all of this", "ke.baki": "You really ate this up! Thank you for giving such an eloquent, affirming and powerful argument.", "kirrilkakes": "YES 🙌🏻", "lifeofmadisonk": "The internet needs to hear this lesson. Thank you for so brilliantly laying it out, for the honesty, and for the tough love. You are so generous with us here on social media. Thank you again.", "theannnguyen": "AAAAAAAMEN 🙏🏽🙏🏽", "jasmin.de.jardin": "🙌🏼", "xtinathemom": "@kaitstarr", "yourdiagnonsense": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻💯💯💯", "sammaybabay": "thank you for this!!!!! ⚡️⚡️⚡️⚡️⚡️", "_esoterika": "Preach. We do need more POC sex educators though ♥️♥️♥️", "corina_raylene": "Inspiring 💕", "thenicolemlong": "Shout out to you for doing this work, holding others accountable, and imploring others to find the why in their own journey. As you said, snapshots are one thing-- the meat and bones (i.e substance) behind the image is another. 💗", "zoecazal": "6👏🏼👏🏼👏🏼", "pulchritudinouspeach": "You have always been so transparent about sharing your own sexual journey, I think that’s what inspires me most about you. Your continued vulnerability reminds me that this is hard, personal work that is never quite finished. The perpetuity of sexual exploration is so exciting to me!! I love that there’s always more to learn, more pleasure to be had. Listening to your podcast confirmed for me that I also feel called to help guide people along those journeys ❤✨ I’m so grateful for your work!!", "runaway_daydreamer": "👏🏻👏🏻👏🏻 Well said! When I got to college it was the first time in my LIFE that I had ever been exposed to sex-positive sex ed and I remember thinking that I too wanted to be a sex educator... it’s been 6 years since I graduated college and there is still so much that I am learning about healthy, happy sexuality. Deeply appreciate the work that you do and the vulnerability it takes to share all this with the world 💜", "plasticxcandy": "🌹🌹🌹", "iamyemojaoshun": "Love love love", "melieving": "Wow. And that says it all. 💗", "verlisa_": "amen", "puppiesoneday": "Wish that WWWMM person wld read this cuz I def think she/her audience needs to see this. She dsnt claim to be a sex educator but she talks like she is an then asks for $ for her “info” all the time", "domina_franco": "Every single word of this", "dmonae19": "Love this!!", "alexisangelini": "Thank you for everything you do ❤️", "honor.thy": "Spreading TRUTH. YES. 🔥🙏", "mama.renay": "👏👏👏", "blkgirlmanifest": "GO OFF", "theannehodder": "👏🏼👏🏼👏🏼yessss👏🏼👏🏼👏🏼", "maria2villeneuve": "Wow I had never thought of it like this and this is incredible, thank you so much for this perspective", "kadimclean": "❤️", "mollonwarriorprincess": "OOOOF 🔥🔥🔥", "knolting": "💕💕", "blkhippiegoddess": "You betta preach a word today! Decolonize and Dismantle 🙌🏾", "dirtycaffeinater": "This is blunt and real talk. Thank you do much 🌻", "kayla.ember": "👏❤️👏❤️", "exuntld": "❤️ alllllll of this", "underwatersociety": "🙌", "venuscuffs": "‼️‼️‼️‼️‼️", "shelby.jane.terrell": "👏👏👏", "lexilex15": "I'm aiming to be a sex therapist (currently in my last year of grad school) & folks don't realize that there is more to sex therapy than just SEX. It's so much trauma work, understanding relational dynamics, family histories, etc. while also doing your own work to transform your mindset as a therapist. I come home from seeing clients exhausted sometimes", "amourcastillo": "Period. This can be replicated/said for so many topics especially as things move to social media for education", "maleah.rene": "Get ‘em bb. ❤️", "zaz.brw": "YES! YES! YES! Thank you 💚", "o.inmind": "Wonderfully said. I'm sure this post shook many aspiring educators, AND IT SHOULD! Don't fall into the mindset that sex education is glamorous or effortless (with a quick return on investment.) It's challenging work that constantly requires you to check back in with yourself whilst helping clients process their own misunderstandings about their sexual identity and all that it encompasses.", "jen_says": "👏🗣👏", "tobeallone": "YES! Thank you for this", "lovelyritah2": "Love this so true ❤️❤️❤️❤️", "curlsgonewild28": "🙌🏾🙌🏾🙌🏾", "mindytsonas": "Yasssss! ⚡️", "christiefederico": "THIS. 👏👏👏", "healwithbroocke": "Well 🔥 fucking 🔥 said 🔥"}