{"alisenronayecharlten": "❤️", "carlytyner": "My meditation just this afternoon was me taking a phrase I hear too often in my negative self talk: “I am too sexual”, and converting it to “My sexuality is powerful”. I am through with the shame surrounding femme, non-binary, & trans erotic power. What feels good is what is right. 💖", "iva_dee": "💯🎯", "heather.horbatt": "❤️✨❤️✨❤️✨", "megtrev": "💗👏🏼", "primadora_": "So true... thanks for this. I’m ready a great book about this that is helping me reprogram myself; it’s called Come As You Are 💕", "_allteenoshade": "💯", "mentalhealthandsex": "Which is why the mother is rising. Putting the matriarch back in her place.", "dynamic.rest": "I am unlearning patriarchal oppression surrounding sexuality by having recently ‘come out’ as asexual. Finally speaking my truth has breathed so much power back into who I am as an autonomous woman; it is that autonomy which goes *directly against* the patriarchy and the ones who thrive on us being submissive in any form. It took me nearly ten years to face it and choke down the shame I felt surrounding it. I still find myself wanting to defend it when it doesn’t merit defending! In our cis-male dominated world you’re only of value if you want to be sexual on their terms. God forbid it be your own. We are judged by our sexual appetites, however prevalent or absent they may be. My new intentions regarding my sexuality is to drive home the fact that there is nothing wrong with mine nor anyone else’s sexual orientation or appetites, regardless how different they may look to one another. We are not broken, dirty, or damaged. Healing for me will probably include speaking out about it every day, regardless how annoying that may be to my followers or friends 😅", "venividiviciiiiiiii": "How fast to cum 🙌🏽💙🔥 yes. Took the words right out of our hearts. Thought provoking & empowering. Love ya sis 💗", "broadsquiat": "🔥🙌🏾✨", "kyleeforce": "This month I want to embody my wild feminine sexuality and embrace pleasure completely free of judgment of how I look.", "hokuhappystar": "Thank you sis 💓", "convhersations_": "I was just talking about this during my pleasure party.", "margotlouisep": "💖💖💖", "its_missbo": "❤️", "coconu": "You are perfect as you are 💙 We want to empower all women to take charge of their sexual health!", "chantenicole423": "At the age of 35 I am finally becoming comfortable with my femininity and sexuality. I’m still learning to break from the idea that a woman is to be delicate and not so vocal. That isn’t me, and I no longer can fake it anymore in order to make others comfortable. My peace and my own understanding are what matter the most to me now as I soon journey into year 36 with my two sons in tote.", "be_elz_ebub": "Thank you for this!", "tarot_realta_dubh": "Damn Sis! 👑💖🔮 Run and tell that TRUTH", "ericarose_tattoos": "@mandijane_ink", "moonhandz": "I needed this. Thank u", "yestantra": "🙌", "radiant.heart.path": "I really loved the post you just deleted about what it takes to become a sex educator—and as well any kind of teacher or leader in these worlds. So many people fronting on social media days. Too little people putting in the years of work. Respect ❤️", "devynhannon": "👏🏼👏🏼👏🏼", "aisha_chey": "This is so important.", "sarahelizabethmitchell": "@chezichi_ thought you might like this ❤️", "jordanfurtak": "Thank you for this!!!!!!", "lilsquidbb": "Thank you for this reminder. I have so much to learn and unpack but I'm hopeful for the future!!!", "artlovingaries": "👏🏿👏🏿👏🏿👏🏿", "songs.she.is": "I am in the process of realising how much damage being in a relationship with someone who kept telling me that he ‘just wasn’t attracted’ to me physically did to me- I thought I was being understanding when he said he had been programmed by his culture to desire a particular body type and that he wanted to work through the shallowness and limitation of this but the truth is, it never changed towards *me* and I didn’t let myself see what it was doing to my core self and sexuality. The relationship was *always* about his issues and freak outs about his sexuality, never about my pleasure. I’m looking at all the actions and thoughts *I* had in that space that kept this in place and I’m taking back my power and right to pleasure, to sex that centres *my* desires and pleasures as much as the other, where I am served and desired for myself: the way I’m getting there is by having that attitude towards myself first before looking for it in someone else. Xx", "daisies_tea_cupcakes": "💜💜💜💜 I need to read this everyday!!!!!😍😍😍😍", "trikkii._.nikkii": "@chaynope relevant ♥️", "sophialivetocreate": "I adore you", "frutarrr": "Thank you🙏", "daleyn": "👏🏼👏🏼👏🏼", "trippelay": "I’m sick of the idea that men can have as many partners as they want while women should « save » themselves for the one. It creates a lot of shame that is hard to get rid of", "liesjebrand": "@pebblle 💛", "_talking.moon_": "🙌🙌🙌", "tamika_shanice": "I want to set an intention on exploring my sexuality more without being ashamed. I want to explore pole dancing and how it allows me to tap into how my body movements are an expression of my sexuality.", "marissa_mayn": "AMEN", "anthi_ef": "💪🏿💪🏻", "paigerenate": "Insecurities about my body, concerns if my partner is enjoying it, being skilled at certain “porn@ tricks women do, is my libido high enough & am I wet enough ... ugh it just goes on. I just want to be free of it ♥️", "georgiawashingtoncarver": "Wow what a blessed post ✨🙌🏿", "goddessgaiaoracle": "💯💯💯", "luma.renge": "Thank you for this. 💗 I've majoritively mediocre to bad experiences with others, in no small part due to the internalized belief that I must perform my sexuality to please cismen. My intention is to embrace my sexuality and queerness as fully my own, and to prioritize my own needs and desires. My raw, primal, playful, sensual, tender expressions and desires are valid and worthy of being honored. I *am* complex and it's a wonderous this. I'm not partnered currently and I'm focused building a deep, loving relationship with my body and desires first.", "authenticallyme_livefree": "Such an important reminder. Thank you for your magic.", "lilliethomas_": "Do you have any tips or practices on where to start? I have been procrastinating starting this much needed journey because I simply do not know where to start, how much to do in the beginning, any tips? ❤️❤️❤️❤️❤️", "bankroll_steph615": "Thank you for this 💎", "newjunkaesthetica_": "Today marks 6 months free of a relationship with someone who told me for the entirety of our time together that my sexuality was broken, immature, or just...not good enough. I still don’t quite know how I feel, but I know that my body and my sexuality aren’t broken, I am not broken, and I’m enough. I guess that’s a start?", "jeremymeyers": "a toxic version of men's sexuality, too", "crystalcrissandrews": "I couldn’t agree more, @evyan.whitney. I want to unlearn the idea that sex is only enjoyed by men and created for men. I want to reclaim my sensuality and pleasure. I want to be given eyes to see my natural beauty and make time to trust my desire and embrace it with self and my husband with no shame. ❤️", "carlieklatt": "Such powerful words 💓💓", "loonlagoon": "This!!!", "blooming_forward": "i want to release shame over having low libido post trauma / sexual assault. i want to be okay with where my body is at. thank you 💗", "helloitsmehappymolly": "LOVE LOVE LOVE!!!!💋", "improhoe": "A WORD! ✨👏🏿", "elly.frye": "My primary intention right now is to truly believe that every little thought or feeling- about sex, during sex, about my sexuality- deserves my full attention and love", "stellagoldxo": "THISSSSSS", "lyvonnep": "aśe! 🙏🏿✨", "indefinite_being": "THIS!!!!👏🏾👏🏾👏🏾🙈❤️😩 THANK YOU QUEEN!!!", "nicoleokai": "ABSOLUTELY ❤️❤️❤️", "bananna.shake": "❤️❤️❤️", "lillierinyoga": "@karinacanady @melmira @sarahstyles @grewsomeroots @mrsrydstrom @tatephoto @justforlunch @pei.pei.k @brookegetsreal May is masturbation month 😻🍑💛", "laurenthepotter_": "💕💕💕💕💕💕 thank you. Thank you. I’ve had so many men get their egos bruised — and then they act out at me, if I don’t orgasm.... or they act really perplexed like I am broken. It has really hurt my self esteem over the years. But, the last couple years I’ve gained more confidence, but it can still be hard.", "embracesexualwellness": "👏👏👏", "st3phmarie": "@___heathanicole 😘❤️❤️", "jessicagdennison": "This!!!🙏🏻👏❤️", "kirrilkakes": "LOVE this caption 👏🏻", "dipseastories": "🙌🧡", "sideshow_melanin": "That caption is mind-blowing in its accuracy! 🔥❤️"}