{"still.i.rysse": "Thank you", "bachmaneater": "Wow you are my inspiration!!!", "_juicyyjay_": "You're a beautiful person", "erica_reichart": "@lalalarell", "ms.awashington": "Nice. I have always had the most volatile menstruation. I was late bleeder buy when it came it let it be known there would be blood and suffering. I am presently going thru early perimenopause and as expected it is radical and ruthless. My blood has changed, it's darker...heavier and has no remorse. My spirit notices the darkness and maintains light...yet the pain is vigilant and sometimes sharp like knife.", "tomgrassodesign": "@theflowrio", "xdandylionx": "❤️❤️❤️You are healing. This post and picture are amazing and real. I respect you✨✊", "kristenguti": "@kristenblomeyer", "daisy.native": "Oh yessssssss to all of this right here ❤️💃🏻", "sunnkissbliss": "Speak your truth to heal 🙏🏾", "ghettonerd85": "Lovely! Yum.", "katy_piranja": "Great respect for your honesty and open mind 🙌🏻✨ I do always have heavy and extremely painful periods, but it's also the time, when I feel myself different and changed, and I want to tell someone about it, but feel that it's some kind of shaming and prohibited topic. Thanks universe, there are people like you ☄️", "spidersfrommarz": "❣️❣️❣️", "bendy_sarah_marie": "Beautiful and powerful.", "gurlieboo": "@pizzakaterina", "_kitty.chameleon_": "Damn. Yes.", "priz_nuts": "👏🏽👏🏽👏🏽", "evolved2ali": "🙌🙌", "coumden": "👏👍👍", "yarosanga_": "❤", "savrewilder": "Ev'yan, you're great. ❤️", "katrini1974": "Beautiful", "orphee.eden_official": "❤️", "queen_tauro": "New favorite idol alright damn all the balls that a woman can have showing her true naked self. What an inspiration if only I didn't fear showing such things I always feel like I'd be ridiculed and have people say oh that's so gross", "momma_lasko": "Fucking amazing you are a goddess 😘", "lerinalta": "You. Are. EVERYTHING. 🔴❣📍🎈", "mary.kathryn.davis": "@lexilynne.k", "wildsol_": "I honor you so much for your brave and powerful work. ❣", "jlbright13": "Thank you. Thank you thank you. Your presence on Instagram and on your website has changed my life in that it has shown me that I am not alone. Much love your way you powerful woman ❤️", "katbasq": "You shine a light on how much magic is in the world & within our own bodies, and I am so grateful to you 🌻", "sina_cengiz": "You are the god @evyan.whitney", "getitgirl_tami213": "I just love you so much!", "irishsweetie30": "In the words of Cree Summer: \"My blood came today I am swollen and ripe I don't want nobody Telling me what's right\"", "rickitickitaffy": "Not only are our cycles aligned but this one has been strange for me too. I thought of you as I stood in line at Petco yesterday, and with a dress on a leak happened dripping to the floor. My immediate reaction was to run out of the store humiliated, as there were people in line. I didn't. Instead, I calmly sat my stuff down, told the folks to go ahead of me, cleaned myself up in the bathroom, came back to wipe the floor, and then resumed my spot in line. The lady rung me up, I gathered my doggie's bags and walked my happy, cramping ass to the car. Thank you @evyan.whitney for being you!", "sheheals": "❤️❤️❤️❤️❤️", "drunkintokyo": "wtf....😲", "emma.amara_": "thank you.", "unclesweaters": "Absolutely", "miczekk": "@evyan.whitney - I hear you too. <3", "amelia_shares": "You ingnite inspiration in me 💕", "heyambermorgan": "Yes! ❤️🎪🚨", "sonyatherussian": "You fucking badass. Amazing.", "evyan.whitney": "@miczekk thanks for your feedback. I won't apologize for what I wrote because that's the truth of where I am right now - fiery, righteous, wanting to be appreciated for the emotional & spiritual labor I do on behalf of others. but please know that i hear you, & that my intention was not to disturb or offend anyone. 💖🌷✨", "aaaashleyhook": "yes oh my god yes wow WOMAN 🙌🏼 #bowingdown #grateful", "naybynature": "Powerful Queen ❤❤❤❤", "luvmesoftly": "During my \"sessions\", my mood is dark and I'm always angry, frustrated and sad. You're so deep, I love that about you. You make me think and dig deep within myself. Thank you my sister! 🙌🏽", "santasabel": "😍🌹", "am_amick": "🙌🙌🙌", "el_bling_bling": "💖❣💖❣💖", "rawksee": "I love your writing! You should write a book", "i.am.dragana.s": "❤️ me too.", "rubygardenia": "💖", "rachaelmaddox": "Love you sister. #allthepain #alltherelease", "barepause": "@spritzoflime this someone you might really like 💕"}