{"morgan.mychelle": "Well said! This platform has become such shit and it feels like there’s so little that can be done to fight that. Thanks for sharing your voice.", "rileslovesyall": "@wanderingshijin", "dannyice57": "Beautiful Queen❤❤", "venusianhell": "yes yes yes yes yessss", "tadeu.art": "💯❤️", "somatic_steph": "Yaaaaas, Queen! Words and photo slaaaaay! ⚔️", "phoebemuchmore": "@emjtatts", "_michelleyeager": "@lissa_reags you gotta listen to her podcasts too! If you don’t already follow her.. ❤️❤️❤️", "stefoulikaterina": "Niceeeeee!", "mara.dower": "I just came across you through @julesyparker and scrolling through your feed. I came across this and you look beautiful. I totally hear your comment but my question is where do you draw the line? My daughter is 12, has been on Instagram for a year and has access to the full plethora of what’s on insta feeds. Also my account got hacked by a porn site which I have to say the images were horrendous. So where does the line get drawn? How do young teenage girls differentiate, understand, accept the beautiful-ness of our bodies when it’s depicted in so many ways? Like I said I have literally come across you and I’ll listen to Julies’s podcast. But I am interested in what you feel about this and how mothers/parents navigate devices, insta feeds that sometimes do have pornographic content in them, and hashtags that don’t always reflect the empress side of a woman’s body that young children who have devices can type in to see it all. ❤️", "wildandvibrant": "And also thank you for showing up and saying that all sexuality work is on a spectrum of sex work. The sexological Bodyworker, the dancer, the escort, the pole dance class, the priestess schools, the sex therapists and new sex Ed, the sexual healer, the sex magic witch, the writers, the sluts, yoni eggs, crystal Healing, the cam workers, the woman out there knowing her gift is in sexuality, however it shows up. The idea that this is a spectrum is potent and recognized and I hear you exclaim the truth in this way. That you don’t get to teach pole class and not show up politically to support sex workers. That this divide is built on racism and classism and heteronormative capitalist ideals. I also hear you saying once again it’s okay and good to love the fuck out of your body and yourself. Thank you. Xo", "breezebennett": "I wish I could ❤️ the photo and then just rain ❤️s on the caption like a live video.", "anda.designstore": "Thank you, THANK YOU for speaking up about this. My art is being censored and removed for being too explicit/ \"pornographic\". All I want is celebrate sensuality and women's bodies, whatever they look like, and I feel so defeated in the process sometimes! Just discovered your account via @rachel.cargle and am so happy I did! Also -- I would love to, with your permission, paint you at some point, from a photo. May I DM you about that?", "merakii77": "Yes fucking wrong on so many levels!!!! Men can show their nipples but we cannot!! The only different is um we have more flesh under the nipple, that's it! The world is a messed up place people!! Thanks for showing up Hon, for You, for the women for the haters for the lovers❤️🙏 we were all born nude SO what's the big issue here Instagram??", "ginathatsit": "Your caption is as bomb as the pic💖❣️", "sairbearbaby": "Beauty queen ✨", "jamiebee143": "Love this!!! Sending you love, light and strength and support 💎💎💎💎💎💖#beautifulwomen #loveonly #authenticbeauty 💖 #freethenipp #freedom #notocensorship #timeforanewplatform", "oceadelic": "Beautiful", "savageifpromotional": "@babysavagegodofgrind has a show in houston texas to perform text 3185409376 asap lets work free show free show", "bcicexotics": "😍✊✊😈✊✊🏾", "certifiedfate": "🙌", "ushabs": "I love this so much @4locrow is so talented omg 😍", "s.yolee": "@shaynadarice", "coyote.om": "All hail all of this. This caption is supreme, bring back the nips", "monisayz": "Beautiful. Ty for doing the labor in speaking this. 🙏🏽💜👑", "selfalchemy": "Nothing at all could take away from the beauty of this photo, but yes, fuck Instagram for hating women and sex workers. 😔🤬", "bornathome6": "Are you fucking kidding me #woman really?", "0.krystal.0": "@shanboody @nerissanefeteri", "iamdaniellepaige": "Queeeeeen!", "kathleenmusic": "You DO look like a fucking Pharoah Goddess queen in this. 💗💗🔥🔥🔥🔥🔥", "jadeconsultingco": "Speak it woman, and YES you are a magical Empress incarnate despite the censorship of the gram 🙌", "brooklyn4play": "We absolutely agree with everything you wrote! It’s heart breaking. But maybe this is exactly what we need in order to come together and lift our voices higher! The passing of this bill will NOT drive sexually liberated, healthy and educated women/females/vagina owners into quiet obedience. We won’t let it!", "josietantricalchemy": "absolutely gorgeous egyptian queen even with the censorship craziness. <3", "lascivious_mischief": "I reposted, because this signal needs to be boosted. HEAR, HEAR!!! 💖", "loveytheawakenedarcher": "👑", "sdotpearl": "🖤✨", "foxylaini": "👊🙌👊🔥🔥🔥", "amyschlott": "@tllthwlvsmhm don’t know if you already follow but thought you would appreciate", "khadijahlamusa": "Come through Gawdessssss", "wisemadison": "“bitch don’t I look like a pharaoh?” 😭 YES", "wild_witch_woman": "Yes 🙌🏻🙌🏻", "zuri_mayasa": "Also:. This is LIFE. You fine", "chelstarc": "I suggest a protest. I suggest all women and femmes go off IG for 24hrs. This is wild and horrible and the beginnings of a very bleak future for womyn and especially SW.", "jesamiefloss": "100%. They only unblocked the 'woman' hashtag because of the uproar. Also yes, u look like a Pharaoh 10/10 ♡", "rockinhockin": "#nipple is blocked", "2wokegurlspodcast": "Can I PLEASE repost this!? You preaching sib", "ninastpierre": "@radicalmatriarchy @ladytimes3 @banana4shred", "unboundbabes\nVerified": "Verified", "_leals_": "@sammyseabright @allofthegulos Read this caption if you want to get rage-y.", "kristenkorvette": "YES YES YES 💥", "shann_m87": "Omg the photo!!😍😍😍", "emboldenedexpressions": "🙄 All that BS notwithstanding... 👑👑👑💜", "_.kmsp": "❤✊🏽❤✊🏽❤✊🏽", "ddfg13": "Your sensual energy elevates the power of your words...", "kathatrapp": "PREACH🙌", "sexwithbliss": "Thank you for sharing and speaking about all of these important topics!", "bridgtbogn": "i really really really hate that you have to censor your nipples, but you still inspire me greatly nonetheless. i really appreciate you, ev'yan! i think you are an amazing human and a force to be reckoned with. just keep doing what you're doing :)", "miss_maartje": "P R E A C H 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 I want every woman I know, to know about you.", "thisbretthall": "Preach! And goddamn, you deserve worship! 🙇‍♂️", "shantelittle": "📣📣📣", "blacklorelei7": "#vagina is also blocked but #penisparty is still searchable", "1000marianas": "omg i think i got shot 👑👑🗝🗝🗝", "janashareswithyou": "Thank you for speaking up about this 🙏🏻", "arieezy": "😍😍😍✨✨✨🤗🤗🤗✨✨✨ so much mothafucken YESS!!!!🙏🤘🏼💖", "lorennennerol": "I am genuinely baffled by the fact that this went through considering the clear, obvious as all hell fact that it’s also blocking freedom of speech.", "jewelspules": "Definitely a gorgeous Pharaoh shot! That gold!", "vanessa_cuccia": "Yes. Photo, caption, you. Everything. 💕", "christiefederico": "Fuck yesssss to all of this. Thank you. Trust me — I’m infuriated. And I won’t be silenced. 🙌🏻❤️"}