{"mitchellsariah": "❤❤❤", "redefiningsobriety": "@kerribjackson this is the person I was telling you about 😘", "celine.noemie": "@maid_alice", "blakmuse__": "Just reading this... I know I will definitely be tuning into your podcast! You are absolutely gorgeous and I can just feel your energy through your post.", "jesyjohnston": "@cutiepatootierebornnursery go on her Instagram and click watch live", "pureenergypdx": "@maryahecht13", "ladyginamaree": "I love how you are open and free about being queer and still committed to your partner. You inspire me. I love your spirit. ❤❤❤Thank you for being so open!", "rae_virginia": "I was feeling sad about being demi today. Thank you for sharing this. I really needed the encouragement and to know I'm not alone and to see brave queer black femmes like you. It's still hard because there's so much pressure to be \"accessible\" especially in queer spaces and being introverted and demi is hard. It's hard to feel like I am enough. I have struggled a lot with feeling like I need to prove that I'm not a prude or whatever other stereotypes and misconceptions people have about demi people. But I am trying to believe that I am enough. And my queerness isn't defined by how many partners I have or how uninhibited I am. 💙😔", "wonderlass": "I relate to so much of what you said that I feel like you read my mind and wrote out my thoughts. 😂", "nicoleokai": "@evyan.whitney whoaaa we have the same moon and rising!! Say you’re a Virgo sun and I’m doneeee 💕💕✨🌸☀️also your words and your work lift me and push me thru the really tough days looking in the mirror. Would love to learn more about if you do private workshops or sessions 1:1", "aida_lucie": "Beautiful!", "b_you_tea_full": "Thank you, that's a lovely way of saying it; I too prefer non monogamy, and you're right honouring and opening is a daily conscious effort.", "thatwiseguy80": "Rawbeauty", "saasha.kari": "You are so beautiful....... the world needs your energy ❤️", "embodyperiod": "❤️", "longlivechucker": "🏆", "unearthingv": "I am glad that I was guided to your page today beautiful soul as I am in the process of releasing all the shame, taboos and guilt I have about my body and sex. To see someone owning their sexuality in the way that you do is empowering and liberating. ❤️", "pretty.wiings": "We are opposites. My moon is Sagittarius and rising in cancer. Crazy 🌀💖", "kundalini.ci": "you are PHENOMENAL👑", "talialune": "I'm a Sag SUN with a Cancer moon too!!!!!!! @evyan.whitney", "the_trap_dr": "@heywillie_ Tanya sent me this 🤗", "kocomeow": "Loveeeee", "justinof75": "Beautiful dear 😘", "yosoyeglesia": "Can we be best friends because girl, I cannot explain the synchronicities enough. 😪", "meliloveslupines": "#rolemodel", "curls.and.harmony": "I love this glimpse into your story. I've wondered again and again if I'm demisexual too. I've never really been in a situation where I could have been sexual with someone I didn't care about though so I just am never really able to settle with that identity.", "yes_anyanwu": "Appreciated this post and can relate soo much. Needed to hear this. I'm a Cancer moon too", "lilgothfaerie": "Evyan!!! I’m so happy to see this in my feed here on IG and on my podcast list!! I have been really struggling with my sexuality and my sex life over the past couple of years and when I found your podcast last year I was stoked!!! You said so many things that really rang true and were hard-hitting for me and each episode taught me more about myself. I’m so glad to see you back in the game. Much love to you.", "lambertraa": "This was so validating for me. Thank you.", "kristen.coggins": "@airestdion who I was telling you about. 🤗", "nicole_mathieson_coach": "Thank you", "iamapinetree": "@quincil I literally thought this was you", "deveryminou": "@misss_w0rld ❤️❤️❤️", "conwaytwatty": "Does anyone know how to flirt...", "enbrightened": "I have been married to my husband for almost 13 years and I fear I have settled into \"living straight.\" I'm struggling with that at the moment.", "sisithelyricist": "Does your non-monogamy include any gender? Or do you use the term queer because of your choice of having multiple crush/partners?", "theflowerchildbruja": "I feel all of this + I got a cancer moon as well✨", "kissmissash": "thank you for being open and relatable 💋 love this", "eartheashe": "!!! i'm a cancer moon AND sagittarius rising too! ✨✨✨ (and idk how to flirt as well haha). btw: if you're a virgo sun, then it's over lol, cause that means we're twins girl! 😂", "shewhoknowsherworth": "@kkasey_", "wildflower7": "You are so beautiful!", "the.crown.fix": "You’re beautiful ❤️", "tehfraga": "The more I hear about demisexual and similar identities, the more at home I feel. And that weirdly freaks me out.", "existentialcrisistime": "Yes, I relate to a lot of this! Looking forward to listening to your podcast later ♥", "timeless.co": "I honestly have so much love for this like wow never read some I connected to so deeply lol", "gabriela.loba": "Youve eloquently expressed how I feel. Wow.", "jklaina": "Omg i needed to read this I'm pansexual in a monogamous relationship with a straight male. I loved your words ☀", "audrahibbs": "I am grateful beyond for your work. I am married to a queer partner who didn’t come fully into that identity until long after we married, and learning how to create space and honor for that has been so damn challenging for both of us. The grace and gentleness with which you talk about your whole self has been so helpful to me, and given me language to honor his experience out loud.", "diabay": "Damn queen! 💓", "myintuitionistellingme": "Must watch ASAP 😢❤♋#happypride #cancersrule", "diaspoura": "Wow 🌿 can't wait to listen! All my love 2 u today", "tarotviews": "Omg what's your sun sign? I'm cancer moon & sag rising as well & although I don't identify as Demi sexual (I think my Aquarius sun allows me a bit more freedom in casual encounters), I resonate with everything else that you said!", "ov_venus": "How very relatable and sincere. Thank you for sharing so intimately and sweet. Blessings. 🙏💜✨", "afinelinelife": "You are great", "messex_": "I love this. I hope to know & honor myself as well as you do.", "afromamanyc": "Omg thank you for sharing this. I too am a queer femme woman. I recently decided to give in to what I've always known and have started living a poly lifestyle. I am dating and I am in love with the most amazing man who has been poly with his partner/wife for four years. I too am demisexual. Thank you for making me not feel so alone today.", "coffeespiritsandtarot": "I will definitely listen to this. As a bi woman in a relationship with a man, I also really like women lol, regardless of appearances I am not straight and I always have to remind myself I still have the right to honor that part of myself always.", "laceycatherinejoy": "Wow yes we are so similar! ❤❤❤", "khawkinsjohnson": "Love your IG page and podcasts. From a young fellow black queer femme, I truly appreciate your visibility and transparency. Thanks for your work!", "pialarafit": "A fuckin angel", "travislimonious": "Beautiful☀️", "eternaldivinebeing": "I love you and see so much of myself/who i aspire to be like in you.", "olanikeeosi": "I totally read your blog today that you emailed and loved it sooo much 😍😍😍 @evyan.whitney cant wait to work with you such a needed topic #selfishbabe", "lordzulock": "Cancer moon tender-hearted sister! ♥️🌙🦀", "turtlexxo": "Shining. Fearless. Congrats!", "ilovejazzyfaithe": "❤️❤️❤️❤️", "vcaswell1": "I am so in love with this episode. It was everything I needed. If you ever subject yourself to visiting the southeast, I will absolutely take you dancing 💕💃🏼💃🏽💃🏾", "iosonosol": "#demisexualpride 🙏🏼💜✨", "stefoulikaterina": "Omg, looks awesome!", "glitterinthedirt": "Love you see you loving your truth!!!", "withloveshalakolaloba": "Resonate with this so much ✨💖 excited to listen!", "christapratt__": "🌹💖🔥", "alyshalight": "@evyan.whitney I’ve followed you since your Apricot Tea days & have watched your wonderful evolution. Curious to know if your non-monogamous status means you can (and do) take male & female partners? Curious bc it seems a lot of bi/queer women who are in open relationships with men all seem to take female partners only...& I’ve wondered if that’s just a coincidence or if their male partners just aren’t comfortable with them being with other men? Like, how does your man actually react after you’ve just had sex with someone else? I’d love to hear more about how a non-monogamous dynamic works when a bi woman is exercising that freedom with all genders. Also are there ever racial politics invoked? You have a white husband, do you take black female or male partners & does any of that ever become an issue if you’re bonding with someone else on a cultural as well as sexual level?", "flystewie": "👌👌", "jenn_river": "@lizrosa 👑", "_wild_woman_wandering_": "Goddess ✨🦋", "rememberedpractice": "Whaaaat? Whooaaaa. Can not wait to listen to this. My husband and I have been together for 9 years and our ongoing conversation around monogamy and sexuality is one we’ve embraced without shame. It’s actually been so empowering for us both.", "jusemmagine": "Hey big head. 😍😘", "vanessadamours": "Blessings👑", "youngascensionhypnosis": "Can I repost this?", "talia.dawn": "I'm so excited to listen to this after work today!!!", "shedrawswithin": "I loved this episode! Thank you for sharing your story so openly and I am inspired by your clarity 💜", "dopaminechaser": "GODDESS", "christina_sutra": "Absolutely love this and you! ⚡️🎶💐", "pusssywitch": "Ahhhh I really relate to this. I love the way you write and express yourself. Thank you for sharing once again Ev’yan!!!! ✨", "darleneee_v": "@ortega.sr", "shala_lanae": "What's your Sun sign?", "bcdiamante": "@theresaangela_ ✨", "cc_jillian": "You are so incredible ❤️❤️", "thedarlingrevolution": "I’ve never heard that term demisexual, but it resonates with me so much. I’m really excited to listen to this episode 🖤", "alexandriafoxxcroft": "So glad that you're back!", "sensualenergyalchemy": "@evyan.whitney I love that term...demisexual. ❤❤❤", "rose_color_shades": "I feel all of this!! Every word. 🙏🏻❤️ Cancer Moon, Sag Rising, Taurus Sun.", "the_hard_witch": "🌹🔥🔥🔥", "_lightsaberpapi_": "Omg! There’s a name for what I am! I had no idea 💡 💡 💡🙏🏽🙏🏽🤭🤭!!", "tea.beez": "Wow, a lot of that describes me, as well. Thank you for being a voice. ❤️", "frm_the_ash": "I'm SO excited to listen to this!! Thank you so so much!! ✨💛✨", "glatange.co": "Beautiful!!! Can you expand upon the difference between non-monogamous and polyamory for you please?", "extra_brittany": "Yessss, let there be all the sexual/relationship nuance and subtleties 🙌🏻✨😌"}