{"hey.ramchild": "Such love, Ev'Yan. We are with you. We are holding you.", "hikariproject": "I see you and will always hold a safe(r) space for you. It is hard to be a woman. To be queer. To be black. May the world turn and embrace the ALL of you. I will.", "vitalvagina": "❤️❤️❤️", "its_me_dr._allen": "You are soo important! I've been a follower of sex love and liberation for years. You are such an amazing light, don't let them dim it or you. Sending you peace and hoping you feel safe soon.", "aoifejohanna": "So sorry you feel this way. There are so many people who will fight for you to feel safe, sending you love and light and peace ✨", "c_h_o_l_a_y": "💗💗💗💗💗💗💗💗💗 this is so so so awful. Bless you. You are beautiful xxxxx", "megaparsec2": "we must protect", "becomepurposeful": "I feel the same. I stay indoors a lot now. But we will get through this. It won't be like this forever. They're trying to bury us, but see, they don't know we are motherfucking SEEDS. ❤️💪🏼✌🏼️💃🏻", "victory_gardens": "We are here with you Ev'Yan, together in grief.", "monaturally": "Sending love and light your way sis! Keep praying,ttry journaling and look into holy basil as it can potentially help you with your anxiety...", "dazeypea": "💞sending love and peace to you💓", "wingardiumleveveosa": "I am so sorry that you are going through this. The other night my partner and I attended a protest in our city, and I felt it was so important to be there for my loved ones who were too scared to leave their homes. My heart hurts to know that you are one of those people but that also means you were why we were out there 💕 I genuinely hope you can find a little bit of comfort in these dark times. Please know there are so many who would stand beside you to keep you safe 💕💕💕", "bunnywanderland": "With you, holding space for the light that we all hold within us, and sending you love as you feel your way through the grief at this moment. You are so strong!!! 💗💗💗", "awitchymama": "Sending so much love your way ❤❤❤❤", "mswalkerwrites": "I love you.", "caylyc.acu": "This breaks my heart. You are beautiful and you are strong and you are so supported. Sending you so much love today. ❤💙💚💛💜", "firemoonfresh": "Wow! I just seen this. So much I want to say and share with you. But I will keep it simple. Fuck what people think, it's not your problem! Love being you and Love what you love. Let the world deal with that! I do understand some days can be so full of the things we don't want to feel but sometimes they are necessary for more growth and understanding of ourselves. You are an amazing, beautiful, loving, spiritual, powerful, artistic and sensual black woman. Always. That shit ain't ever gonna change. 🤘🏾❤️", "passionateoegd": "Oh Ev'Yan. I've never seen you like this because you're always glowing.. like you are your own sun. I hear you, I see you. We can't let these monsters drag us down. Take all the time you need to grieve and then rise up. 💕", "missaketi": "I appreciate your bold honesty. And I love and miss you. AND, we live close to each other and could make dates to go to the store and do other things together. Maybe it's due to my line of work, but I do not feel unsafe out there in this racist, sexist, homophobic world. Maybe I am naive. I probably am. Either way, I appreciate you and am here for you sista girl. I got your back. Tell me when and I'll pick you up or meet you and we can drive or walk to wherever you need/want to go. 💯🙏🏾❤️️", "tarot_obscuro": "Amor a ti, mija", "dionne_______": "💛", "latoyakmua": "This organic, real post is why I am choosing to follow you! Returning to what is real is Home!", "bone.mountain.mystic": "This world falls short on all of my ideals, and I wish I could change and shift it all. You are so powerful and honest and bright in a world darkened with confusion and hate. Keep on shining sister, I can say with certainty that you've guided many of us in times of uncertainty and I hope we can lift you a little in return❤️", "vargavindar": "💛💛💛 all of my love to you this morning. you are doing such important work. you brilliantly and boldly pave way for people and by doing it, you're leading a revolution. thanks for being here, I hope things calmed down and you are safe ✨", "lavender_milk_tea": "You're loved, you're so strong, you're not forgotten 💕", "tishushu": "Here with you.", "shortnsweet1224": "Sending you positive vibes and strength🙏🏾", "pingoderp": "I'm so sorry. Sending you love, strength, courage, hope, support and luck. ❤️💕❤️", "brownsugahealing": "There is much strength in your vulnerability. Such scary times we are in but if it helps my sister and I were just talking about you & how much we admire your heart! 💜💚❤️", "jodielayne": "I see you. I hear you. Your safety is important and you are so loved.", "mykkym2200": "Please Please Remember To Mind Your Thoughts. Be In This Moment. Are You Safe Right Now? The Future Will Be What It Will Be But NOW My Love Is All You Have. You Are So Powerful You Create Your World. Be Very Mindful Of Your Thoughts. Thoughts Create Reality. The World Is Just As It Was Just As It Will Be. Choose Not To Give Your Power Away. You Decide How You Feel. You Are In Control. You Are Young Gifted Queer And Black! Pure Perfection", "wildsol_": "I see you and hold a space for you in my heart. You are so loved.", "dragon_wifey": "Oh Nooo!!! Can I ask where are you from?? I am so sorry you feel this way. Keep your head high, no one can rob you of your spirit!! I don't know you personally but I admire your strength to be WHO you are...not many can say that!! Much love coming from me to you my friend! 🌹💋", "khadijahlamusa": "sending you some #blackgirlmagic 💜✨", "gloriapoderosa": "I love you.", "twyladilldesign": "❤️❤️❤️", "kelcitillman": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ with you", "innyvinny": "Sending love and light your way, sis.", "vanessa_cuccia": "❤️", "ericbgrey": "Here for you always", "itstherealnia": "You are everything. ❤️", "dteapriestess": "Yes yes sister. My white hubby and I were talking about the same damn thing", "jessicarose_r": "(((((((Hugs))))))))", "steff.the.goddess": "Don't be afraid... Be prepared!! #BeAwarrior", "demar_desol": "We love you", "mixmastasarah": "I am so sorry.", "loveinadoula": "crying with you", "permanentstudent": "It's breaking my heart just how many people no longer feel safe, for so many reasons, including myself my I'm here with you and sending lots of love and solidarity.", "liv.sulerud": "Hearing you. Loving you. 💗💗💗", "lisavdias": "Listening. Sending love too.", "niecytaylor": "I see you in it sis.", "paparoxxii": "As someone who is straight and not black, all love to you. Happiness and joy and love and strength and safety and all positive vibes. I love you.", "sena__maria": "💓💓💓 sending love. I read a ton of your articles today while I couldn't get out of bed and just know that simply by being you are doing amazing work. You shine by being, and feeling, and allowing. Thank you sister.", "niiiagara": "I think you are amaizing! You share with us your light! Thanks so much! Sending back all the love that you send!!! ✨✨💛", "ccchiedza": "aww sis😘", "blackgirlmagik": "Sending so much love to you sis.", "ljmom2arigray": "Please pm me if you do not fee comfortable responding here. @evyan.whitney", "paigezaferiou": "Love 💖 Love 🌟 Love 💖 to you, dear soul.", "chronicbabe": "i love you, my friend. i'm so sorry this is happening and i stand with you against hate. is there anything i can do for you?", "barbztheesunflower": "Omg thank you! I haven't been able to put to words how Ive been feeling but this is it @evyan.whitney ❤ I'm with You priestess.", "daphne.gabriel": "Oh my god. Me too. I got on the train yesterday and was anxious that something bad would happen to me. I've never been afraid to get on the train. 😖", "ilanagrostern": "Holding space for you, beautiful woman!!", "tahirah__": "Babe, we got you. Feel what you feel, because it is valid and real (and scary AF), but know you're not alone 💛", "_bex23": "😕 hhhuuuggggssss", "goodnightjoy": "*strong black queer woman. Lift your head up gal. They've got nothing on you. You're stronger than you know. Don't let them get you down 😤", "pgsquared": "Get a gun and learn how to shoot and stand in your power. My magic is protected by my slick ass mouth and lead if need be.", "its_botany": "What @tahirah__ said.", "maji_nation": "Sending you my light and my love dear. Take all the time you need to shed+release. You have sistas all over who choose to shine brighter/bolder as you make your way through dark times. 💗✨", "leslielarae": "#brokenhearted", "wen__bee": "Sending you lots of love and safe vibes from Seattle.", "destxo322": "Stay strong... it's not a battle you're fighting alone. We're here with you ✨💜", "lottie_gill": "💞", "mariahraegillespie": "Love to you, you're not alone 💗", "ancient_being91live": "Love and light queen 👑", "tightlikespandex": "It's your magic. Don't let them take it. We're all in this with you ✨", "raisonpassion": "💚💜💚", "helizflor": "Stay strong 💖you are beautiful and magical and you matter very much!! Your radiance and magic are too important to be stifled by hate and darkness 💜💙💚💛❤️💞", "ce_mo": "Sending you some love, lovely. Take the time and space you need. We're here for you. ❤️"}