{"elegant.rascal": "This may seem odd, but I followed you back in your Apricot Tea days, and still do now. You talked about a book then called Entre Nous that I return to about twice a year; that book has been a godsend. I appreciate your ongoing candour and self-discovery, and thank you for a book recommendation that has served me almost 10 years. ❤️", "groundedinflow": "Wow thank you so much for this post. A should I'm encountering these days \"if there is real love, relationships should be free and open\"... for a lot of time I fed into this idea too and suddenly I'm realizing that there is no should in love, that we are free to choose to share our space with one beautiful person at a time, and its not necessary that i judge myself for wanting this. Another sexual should that I'm letting go \"I should have sex with my partner even though I don't feel like it, so that he feels happy and loved (aka stays with me).", "intertwinedlikewine": "This is everything and then some.", "the_girlkyle": "As many therapists have said to me, don’t “should” on yourself.", "goddessofartpeace": "Yessss", "you.remind.me.of.a.babe": "@lxwm this is so important!!!💋💋", "woodenfooted": "This spoke to me ❤️", "laivinia.luna": "Love love love ❤️ I'm only recently tip-toeing into self-love and sexuality and it is true I felt a lot of pressures you write about. But most shoulds come from me - I should be more open, I should try everything once, I should be submissive, I should be able to feel pleasure when with a man. There's so much, and so much is influenced by childhood programming and past traumas. I really hope to break free one day ❤️", "peace_brewtality": "@girlz1withcouch 💜", "distinguisheddiva": "Exactly!!!!", "selfcervix": "Yes! The most annoying word ever esp. around sex", "blackheart_and_darling": "Interestingly, your post reminds me of how I felt when I read an article written by a someone who claimed to be a sexual mentor, who insisted that we all stop using our clitoris to orgasm. It was apparently a cop out we SHOULD all be aiming higher than that. 😡", "selineolgun": "♥️So important!", "art_for_ourselves": "THISSSSS 💕✨❣️", "carolinewimberly": "This is so amazing and such a wonderful reminder that applies not only to sexuality, but to every facet of life’s journey in general. Thank you so much for sharing this💕", "emareesan": "@annettemuller", "ellemestrada": "That post on your story is so wrong about the Torah or what he probably meant to say was the tenach... monogamy is absolutely taught in Judaism. The ONLY time a man is able to marry or have relations with a woman that is not their wife is if their wife cannot conceive with the permission of the wife like in the case of Abraham and Sara and then another cases if the wife’s husband dies the husband who died his brother could marry the widow’d wife (if she chooses) to the carry-on the bloodline other than those two exceptions Judaism absolutely preaches and teaches monogamy it’s one of the most sacredsacred things that two people can have together so I’m gonna go ahead and have to disagree with that statement - pure ignorance. Unless I missed something in Hebrew school, but I doubt it.", "kydiaa": "well said. i’ve worked on this with my therapist before, the “shoulds”. you are inspiring!", "hapabee_": "Your recent podcast episode \"My sexual liberation is not for male consumption\" had me feeling every feeling: happy, sad, angry, frustrated, very angry & joyful. I just left a male dominated industry and am entering into a VERY male dominated industry and felt like I really needed to hear this. Just like most, I am in the midst of a huge awakening (I just fully realized I'm not bisexual, I'm gay! Yay!) and wow, this episode & podcast has really helped me start to heal my wounds. THANK YOU. ❤️", "jenellrenee.sacredwings": "This is such a needed post and podcast. Thank you!! 💜💫💜", "ultraviolet.2016": "I am listening to your interview with @dawn_serra on the #sexgetsrealpodcast and I cannot agree with you more! Everything you say I keep thinking to myself 'OH MY GODDESS, IS SHE READING MY MIND?!' You are an amazing beautiful STRONG (better yet SEXUALLY strong) woman! I am a bisexual woman married, almost 10 years now, to a man who I truly believe is my twin flame. I love this man dearly and can't help to put him on a pedestal and bow down to him, which, trust me when I say he truly does deserves to have the ground he walks on to be kissed! But, like every relationship, there's been some...hearts broken, trust broken and faith in us lost. There's a lot of repair needed to be done to our foundation. In the last 6 years we have turned the heat up on our kink thermometer full blast, I'm talking like blazing full blast. Which included me mustering up the courage to reveal my darkest fantasies, for example I like to be choked. I didn't even consider such a thing until I stumbled across an erotic photo of a man choking a woman while giving her a very sexy kiss full of tongue. The picture screams out \"you're mine\" in such a way that made my stomach do a million flips, and that's how I found out about my \"being vulnerable\" fetish. So I spilled the beans and told him every fantasy I ever fantasized about but I'm still having a hard time getting him to explore outside of the school girl costume because he has to have other fantasies right? But I can't get him to tell me, I would hope after 13 years together he wouldn't be too shy or embarrassed but that is the vibe I'm getting. In the meantime I am starting to fantasize more and more about sex with women. And my lust for the feeling of a woman's body in my hands keeps getting stronger and stronger. I feel as if I should tell him because we both agreed being %100 honest with each other but I don't know how to A. Tell him & B. Fulfil this STRONG urge. I've subscribed to your emails and I will be following you on Your social media accounts. Hopefully you can give me that \"Ah ha!\" moment that answers my questions and curiosities. I am so glad I have found you! I can't wait to soak up some of your wisdom!💙💖💜", "greengirlleah": "Love this!!", "runaway_daydreamer": "Thank you so much for sharing this post today! 💕 I don’t think I’ve ever commented here before but this caption feels so inviting and safe. As a teenager, I grew up in church, l heard all the “shoulds” of how you shouldn’t have sex if you’re not married and shouldn’t flirt with boys too much cuz they can’t control themselves and all that nonsense. Then in college / first half of my 20s, I “went crazy” as they say, but fell into the different kind of “shoulds” - you should have sex with whoever you want, whenever you want, you should be able to have sex with “no strings attached.” Now at 27, I am trying to find the balance between those shoulds. Feeling free to have sex when I truly want it but also free to say no to sex when it’s not what my heart, spirit, soul, and emotions truly desire. I’ve had too much harmful sex in the name of sexual liberation! “If you want it go and get it”... but I want space to explore the gray area, I want to be allowed to sometimes just really not know what I want. 🤷‍♀️", "theblackswandiaries\nVerified": "Verified", "brittofbridges": "@jessicadefauwe @poeya_ 🙏", "jamieleefinch": "Hell yes hell yes hell yes!", "katie.gresham": "It was really important for me to hear this from someone like you. I’ve felt like I should embody my sexuality differently or have more desire or different desire based on what the male gaze wants but also what sexual liberation (to some folks) seems to mean. Glad to have the permission to be true to myself reiterates. ❤️", "ashields725": "Yes!!! Thank you. You are so enlightened and beautiful.", "jahbruja": "@ottayoshay 🌺", "thecambridgeyogini": "✨🙏🏻✨🙏🏻✨", "rosalie.amber.grace": "Yes I love this!! As a Tantra teacher I encounter this all the time & have struggled with needing to have a “tantric experience” that actually defeats the whole point of Tantra 🙄", "annaxzhu": "SUCH a good point wow!! Never really thought about it like that but really makes so much sense. Thank you ❣️❣️", "may.kuboresha": "Love this message 💖💖💖💖 Also, first \"should\" problem \"you should have sex with men\" when I don't want to but was conditioned to think that Love and Intimacy should come from men. Oppressive", "kalonnoor": "Wow 😩🙏🏼", "iamrachelricketts": "Yesss! Thank you 🙏🏿", "hanibee.a": "🙌🏼", "thegreenflash": "Love this!", "trapchefwitch": "Facts", "nucleusambiguous": "Basically what we were talking about today @itsme.lhoneybee 💕💕", "afinehuman": "Ahhhh - the tyranny of shoulds", "chaya_labufff": "I used to think I “should” make the most of new sexual explorations for the sake of trying new things. I thought “I should take advantage of this possible threesome” or “I should sleep with this type of man cause it’s new”. But it was never what I wanted. I was only attracted to the new situation. Growing up fixed all that thinking. I’m more in tune with my instincts", "sarlejeffries": "Truth", "shortcake.xoxo": "Yaaaaaasssss 😼😼😼", "starwaterme": "Perfect timing @evyan.whitney", "underthingshop": "YAAAAAAS HUNNY!!! there are NO rules", "instabellagramman": "❤️👌🏻", "callmemissblissx": "Yessss thank you!!", "wildflowersex": "I love you and so happy we did this! 🌹❤️", "che.che.luna": "SO MUCH FUCK YES 🙌🏽", "queerfemmetalk": "@emluqueer", "casava.jo": "i feel like i’m holding myself back by having expectations of what it should be like..when i’m actually already having that kind of sex, im just not letting myself fully experience it. shoulds are bullshittt", "soulresurgence": "👏🏼👏🏼👏🏼", "evalovemarie": "@kellimariefrances @elementalcreatress", "erikaalsborn": "Shoulda woulda coulda... bullshit!", "carlotah_sandiego": "🙌thankgoodness it’s being said", "breethelight": "Amen !! 🙌🏾🙌🏾🙌🏾", "thegoddessrachel": "Thank you sooooo much for this🙏🙏💖💖", "peaceloveandbubbly": "🙌🙌", "rebecca___lynne": "Yes yesssss", "bettyc21": "@blissbdt 🙄 mmm hmmm", "christiefederico": "Perfection! ❤️", "loveleenique": "This!!", "meg_heals": "👏👏👏👏👏👏👏👏👏", "hello.mariana": "Right now I’m single and I feel like I SHOULD be trying to meet men, go on dates, be intimate...and I just don’t have it in me. I’ve done long term monogamy, polyamory, one night stand; you name it, I’ve done it. But right now I feel I’m most honoring myself by embracing my body through yoga and exercise, I’m celebrating my sexuality by treating myself to fun new toys; still, I can’t help but get the nagging feeling like I “should” be out there having a sexy good time with others again.", "woodstockwomb": "I usually get the “you should not have sex so easily” and “you should wait more until you have sex with someone” sentences.", "soroka_13": "Your partner shouldnt watch porn is my personal favourite.", "midnightforthelily": "Hmmm... I dont know if I agree with this statement. I think its responsible to add a level of ethical thinking as to whether or not we should do certain things when it comes to sexual liberation. SHOULD that 30 year old sleep with that 16 year old? SHOULD that woman get involved with a married man? SHOULD a boss be involved in a sexual relationship with their employee? Is this ethical? Does everyone have the ability to enthusiastically consent with full knowledge of what they are getting into and without retaliation if they want to stop the relationship?", "paradasical": "“But sexual liberation shouldn’t come with...” couldn’t help but cringe... How about “sexual liberation is...”", "opal.escent": "A recent one I’ve grappled with is “you should only fuck people who aren’t men” in order to be “queer enough”", "kassy.psychicmedium": "Thank you for this! Common ones I’ve heard, even in the “sexually awakened” or whatever community: You shouldn’t use a vibrator, you shouldn’t have too many clit orgasms/vaginal ones are better, you should do things you don’t like to please your partner"}