{"thetaylor2know": "Thank you thank you thank you. I’m still processing what this has meant for me but I know it was good and necessary. 😍🤩😍", "hotghoulsummer": "HELL YES!", "samantha.not.sam": "Yesssss💗", "ellenography": "Holy wow you’re amazing! Thanks for the post ❤️❤️❤️", "toranmcgill": "🔥x❤️=❣️❣️❣️🙌🏾🙌🏾🙌🏾", "oliviapinkney_": "All the yesss!", "nmbeezy": "Yes👏👏😍", "kaltsektion": "I got awfully sick on the very first day of the challenge and couldn't participate at all :x saving all the e-mails and hopefully one day I will get it done just for myself! 🌹", "rebelrebel1776": "Awwww....I just discovered this.... 😢", "waoutdoorguy": "... a soft light kissed her beautiful face", "door_reeny": "I love your affirmation. Just what I needed. Thanks!😘", "childofelderblood": "I wasn’t in a safe place to properly do the challenge this time around, hopefully I can get brave enough and catch you up next time.", "doodleb0b_": "sí; yes 💚💫", "withlovefrommarz": "YES💚", "zawadinyongo": "Oh please share it with me 😊", "ia.thefirst": "Scratch my last comment. The emails came through lol", "rachelhollandstudio": "@tracy.robbins", "mikusek.coach": "❤️🌹", "ayja.love": "You are a powerful goddes!!! Sending our love to you 🙏", "ambermayblackthornfairrie": "@verocitasparkles 💖💖", "nadiabokody\nVerified": "Verified", "sanehassne": "Love 393512771471?", "dmonae19": "YES YES YES ❤️", "honeyatwork": "Yessss!", "rasjo876": "Thank you uuuu💋💋💋", "laracarvalho_": "you are amazing. this is all i can afford to say after these five days. thank you for providing this and for building such an amazing community – i'd even say it's like an egregore. let's keep doing this, together! 💕", "tigeragitana": "Yes!✨🗝", "scorbynw": "Yes 💗", "bootybrujaja": "im hoping i can do this challenge periodically on my own. & although i wasnt able to post much at all during these past few days...YESYESYES would love to continue this momentum ⚡️🖤⚡️", "sinatrablue_": "Y E S ♥️♥️", "reikiwomb": "YES ✨💜✨", "julia.amanita": "Thank you, Ev’Yan. I’ve needed & appreciated this challenge so much.", "arielkashaceli": "Just found out about this but oh yesssss✨♥️💗🙌🙌🙌", "ohmydevotion_": "YES!!! <3 <3 <3", "divinebreath100": "As this challenge has ended, It is now that I have just seen it...and Eye Still say Yes Yes Yes 🌺💙🌺", "raquel_vargas_1015": "Hell yes", "poppylion.witch": "Same.", "emilyetcetera": "YESSSSS", "cecily__parsley": "Yes!", "alexandriathegreat__": "Yes!", "typi_callie": "Yes!", "rinabelle": "ready to rebel ❤️", "goddesssteph92": "Yes this challenge show how to own my sensual power and awoken my divine feminine spirit. And I learn that I am so beautiful and sensual I own my sexual beauty 💖🌹💖🌹💖🌹 I would love to keep do it !", "k.valerice": "👑🙌🏾Thank you so much beautiful and can’t wait for what’s to come ❤️‼️", "uniqueyorker777": "Ah wish I had something to post but Yes will continue to embrace that side ! 😍😍🌹🌹💓💓💯😘", "idreamofy0gini": "Wow, those affirmations are amazing. Thank you for sharing!!", "notsafeformomgroup": "Yes!", "king.andre.gyne": "Yes please. Yes thank you", "bigblackbitxh": "so excited!!!!!! 😊😁❤️", "talesofawannaberedhead": "Stunning🌟", "thelovinggaze": "YES", "vanillajesse": "@sepulchrajewelry", "michelleohanastory": "Beautiful", "axotca": "I love the challenge you created. So many powerful images and messages.💕💕💕", "djxia1": "Dope", "erykah4c": "Yes", "trulylivinglisarose": "Thanks for this challenge Evyan! It was powerful!", "scullysmole": "Yes!!! 💘✨", "strictlynotchole": "Yes!!!", "wtfvckart": "Yes please yes", "witchy_womxn": "Yes 👏👏❤️", "chrissy.claire": "YES OUI SI HA!!!!!!", "radiantbeautystyle": "Yes!", "courtney_shei": "YES! @evyan.whitney there are no words to accurately describe the shifts inside myself that have occurred through this practice of space taking. I am so very blessed and thankful to have found you & this challenge. Not only having the opportunity to engage with myself & my sensuality but to see others doing to same. Seriously impactful. Thank you so much for honoring yourself & all of us. Thank you 🙌🏻 @evyan.whitney", "_mal.pal": "Thankful for you ✨", "imalittlehungry": "yes", "augusta.blossom": "YES! My images have been wrongfully reported for nudity/ pornography the last two days... my response was to repost them. I've taken my power back, and I won't be releasing it again! This have been the most POWERFUL challenge I've been apart of. This was beautiful and transformational, thank you! ❤❤❤❤❤", "a.r.reynolds": "Thank you! I found your challenge late but wow, you are a beacon and that is exactly the charge I was needing for this dark moon time! 🖤🖤🔥🙏🙏", "amapola__flower": "Yes~~ 💕", "glamityjane": "Yes", "whitney_efl": "Yes YES With Love 🙌🏼✨All ways, always yes!", "brokenfix3r": "Never got anything after the sign up email, but I'll keep an eye out.", "erin32794": "Yes", "medi.kait": "Yes", "iam_preena": "Yes 🙌🏾🙌🏾🙌🏾", "amelia_lilaiyyna": "YES!! 🙌🌹❤️", "rafaroo": "Yes💫🌸💕", "mollychaikin": "Yes!!!", "hotgyaldanny": "YES YES AND MORE YES. THANK YOU GODDESS FOR THIS SPACE AND THIS COMMUNITY!!!", "jadephoenix_": "Yes!!!", "theemeraldrosary": "This is gorgeous! Thank you for sharing this challenge with us you helped create such a supportive community", "emilybalto": "Yes!", "mahiasinn": "Yes✨✨✨💖", "ascrumptiouspansy": "Yes And thank you", "clearly.katiemae": "Yes ❤️🙏🏽💫", "lalaleahslife": "Yes!! 🥀❤️", "healwithbroocke": "YASSSSSS 🙌🏽", "crunchynika": "yes!!!👏🏽👏🏽👏🏽", "krystal_tantricyogi": "So pretty! Thanks for creating this beautiful challenge", "mackenziemckenney": "I wanna paint this", "_beautifullydamned_": "Yessss 100%", "goddessin_themaking": "YES! 🙏💜🦋", "upton_untamed": "Yes!!", "robinblackhoodie": "queen goddess vibrations detected; your wisdom is greatly appreciated; keep sharing the knowledge.☯️🔥💗", "flower._.child1995": "Yess !!", "liquidnowledge": "Is it too late to sign up for continuing momentum of sensuality? May I have access to the email? I'd love to partake 🙏🏾🌿 @evyan.whitney", "softbr0": "Yesssss👏🏻👏🏻👏🏻✨✨✨", "sparklesdani": "Yes. 💜", "karmacamelia": "Yes pleaseeee!!! 😍", "herfullynaked": "Yes 🖤✨💋", "ceceoh_": "💁🏽💖💓💕💞💕💓", "_rashaej": "Yes 🙌🏽✨✨✨", "bri_gia_": "yes ❤️", "vulgargrandma": "Yes!! This challenge helped me reclaim a strength I didn't even realize was diminished!!!", "kimiko.is.love": "Yes!!", "thechakrawitch_": "YES! This challenge has been absolutely liberating and so special. Thank you thank you! 💖💓🙏🏼", "melted.zipper": "Thank you for creating this beautiful challenge! I have thoroughly enjoyed! It's been an eye opening and emotional experience and I loved every second of it! 🖤", "soothewithin": "Thank you for Sharing/Caring - Love your energy", "indyriver14": "Yes!", "muravasoul": "Hey girl! I’ve been participating in the challenge, I never signed up though I’ve been getting emails fowarded from my friend. How do I get on the email list?", "linseabeth": "Beautiful words", "carolinegloverlmt": "Eeeee! This is what I wanted for today too, fucking fabulous! I cant wait to get home, I've already got a plan in my mind!", "goddessyanti_": "Yes!✨✨✨ & thanks so much!", "alignapothecary": "✨✨✨✨✨", "themultifacetedwomxn": "Yaaassss✨🌹 thank you for creating this safe space Goddess", "winluzordraw": "Yes", "flyying.foxx": "Yes!! ✨"}