{"celestecharmaine": "I joined because i think this is a great way to try and break any form of taboo around the sexualizing of a girl just trying to love and apprecoate her body in whatever form she may choose. To be free of judgement. This is something ive been working hard at. Being comftable and bold, it might helo alot of girls start of we are all in this together", "bliss.lightseeker": "I need to reclaim my body. I need to reconnect with its beauty, and the fact that it deserves space in this universe. I need to be reminded that sensuality and sexuality are two different things. I need to remind myself that sensuality (and sexuality) can be a lot of fun. I’m excited to play with myself (pun intended 😂)", "vulgargrandma": "I'm doing the #sensualselfiechallenge because the biggest thing I've had to overcome through my self love journey is the idea that my sexuality and vanity makes me dirty or less or vulgar, and I wanna take 5 days to not care about peak engagement or posting too many mirror selfies or any of that and just unashamedly take up space on my own page.", "chroniconfection": "I'm an here for self love. Something I am needed to work on. I was taught from a very young age to be modest and shameful of my body as a female and to be quiet and not so outgoing. I refuse to accept these sexist notions that were drilled into my brain at such a young age but it's taking strength to actually get myself out there and feel comfortable in my body. I need this for myself and for my daughter whom I will teach to be proud and fierce and unapologetically herself. 💓", "cristinameaganrose": "I love this. Heard about it too late to sign up but i am going to follow along with the mantras/Inspiration and post alongside anyway", "k.valerice": "Excited and nervous but truly needed! Thank you beautiful for inspiring us to take up space ❤️‼️", "hotghoulsummer": "@abbazabba514 I'm taking part :)", "healwithbroocke": "I’m trying to take my first picture but this is HARD", "inskyesworld": "@justrashidah", "madycan": "I have had a fear that my sexuality and sensuality will strip me of my “right” to be respected, and I want to challenge myself to love my body, embrace my sensuality, and to challenge others to consider their judgments about women who show skin, who are okay with being sexy, who demand respect while simultaneously are proud of their bodies and who own their sexuality.", "love.listen.intuition": "Beautiful beautiful page sharing such love xoxo nora", "cosmichumility": "Because there is a multi-billion dollar industry that exists based on women hating their bodies. Because there are millions of young girls out there that hate their bodies because society tells them that thin white women are the ideal. Because men think they have a right to police our bodies just because we are in a monogamous relationship with them. Thank you for this 💕", "mariaceciliapozo_coach": "@ilemirandaile @catedaccach", "pineapplethumps": "@pearlsinmychampagne", "nahlicroix": "I live a sensuous lifestyle, people get in such an uproar over the level of respect a women should receive in correlation to the amount of skin she’s showing but i disbelieve that. I am respectful and deserve the same in return . I’m not a hoe not promiscuous... i just love myself and have high sex appeal 🤷🏾‍♀️", "marrs": "I hope to heal the relationship with myself and my sexuality as I’ve been afraid and ashamed of it for far too long", "majesticallyawkwardaf": "Keeping my eyes on you for the next one 💕this is great", "lovemky": "@winterlily1084 💖💖💖", "longlivechucker": "😍", "krystalaxel": "Beauty ✨✨", "sunseteyesbutterflies": "💖💖💖", "_costalaura": "@mairafuligno sua cara isso amiga", "earthenwoman": "@consciouscallin @rise.sister.rise @juliatobincreative @smoochy_latte @morgan.rayner", "life.as.v": "@grammagicallycorrect Lol, wanna? 🐒", "ramblingroz": "Because I'm on a radical discovery of Self Love. Because I've always been more focused on looking desirable to the men in my life rather than focusing on how I feel about myself.", "healing_simply": "To break down my walls. To get closer to myself and continue my self love journey.", "imanisasa": "Sexuality and creativity are connected to the same chakra. My creativity blocks and my sensuality blocks are one in the same. So. Ima do the work to excavate me.", "unpackingtherainbow": "Why? Because I'm right in the middle of reclaiming my sensuality after my life being plagued with low self worth, which ended in abusive relationships, which resulted in such a massive disconnect from my body. Add that and 3 kids and you've got one Mumma with a massive part of herself missing. I want to reclaim this goddess that is still in me, I can feel her stirring..", "em.forman": "Meet friends", "stellagoldxo": "I never felt that I own my body, my sexuality. It has only felt like a cage I am trapped in. I want to add more light and love to my body instead of being at war with my body.", "missbourguignon": "I just signed up! 🖤 Will I still get the first prompt?", "craftypalette": "I signed up because I've been disconnected from myself, and sensuality. Also hate taking selfies, need to do this for me- to be fully present and heal. Not sure that I'll post them and switch my profile to public.", "sarlejeffries": "I decided to do it to face a direct fear I have with having an intimate or sensual image of myself put out there (based on its potential of being shared). While in the military I had a SNCO take my phone, go through it, and send pictures I had of myself in my phone to him without my knowledge. Later on those pictures were shared around base and the effects of that is something I still carry and am conscious of today. That AND more importantly- I think to have tangible definitions of sensuality illustrated is Dope AF because We Are Art. Looking forward to seeing how every body decides to share...", "alexandriathegreat__": "I have felt shame towards my sexuality for my entire life. I feel like although I’ve been making huge shifts in my life and mindset, this is still an areas that scares the shit out of me. But I know that power I feel when I’m connected to myself in every way. I want that all the time. Especially after having my daughter ♥️", "adrianac414": "@beatfacecait", "its_botany": "Because I am curious what my nonbinary sensual looks like. I welcome the practice of self and photography and space holding. Looking forward to second round!", "neverwasacornflakegirl": "I am in Australia so it is already Sept 5th here. Should I just follow along a day later?", "ohheyheath": "I signed up because the thought of doing this scares the shit out of me (as a business owner, partnered person, and woman who was raised to not love her body). But, feeling newly self conscious in recent months and out of love with my body scares me the most so I’m going to do this and give it everything I’ve got. Thank you for creating this space.", "_mal.pal": "I signed up for this challenge to explore my own version of sensuality; not one that I developed to numb the trauma of my sexual assaults. I joined to help other women who aren't yet at peace with their bodies and show them that if I can, they can love the body they embody too", "alisha.e.rose": "I absolutely loved it the last time and want to see what other parts of myself I can discover and express this time! Time to take up even more space! 💜💜💜", "askgoody": "I feel like I haven't seen you in my feed in a while! Happy to see you boo! 💚", "shirleyzappa97": "Does it have to be new selfies daily or can it be selfies we've taken but never posted publically? I have seen other selfies posted before where people look like they have more professional equipment with perfect lighting and angles", "new.bian_": "I signed up because so many people try to box me in, or shelter me, my expression is always misunderstood, as if I’m NOT suppose to embrace the “beautiful” woman I am. And being as though so many women are apart of this, I no longer feel alone, I no longer want to hide who I am to make others comfortable. I’m comfortable in my skin, and it’s about I start acting on it.", "elliotfawkes": "I want to be more accepting of my sexuality and hopefully get the feeling that I can also reclaim it. That it’s for me and is me ❤️ I’m so excited and sooo nervous to start today!", "typi_callie": "I’m doing it because I recently went through a very healing process over the summer, working through some sexual trauma and confronting ptsd. I have a new found love for my body and a new sense of excitement about my sexuality, so as I’m taking back ownership and control of this I thought this would be a fun way to celebrate myself, my body and my sexuality💃", "briannewaite": "I’m a mom with two young girls. Pregnancy and motherhood have really taken a toll on my body and my self-esteem. I want to say I’m doing the challenge to “get my groove back” but it’s so much more than that. I want to do something for ME. Not for my kids. Not for my husband. For me. I don’t even recognize myself when I look in the mirror. I want to at least learn to like what I see.", "secondhand_stevie": "Honestly, my body dysmorphia has been tearing its ugly head lately and I think this will help me to see what my friends see again. The real reflection.", "heartsandrootsguide": "Yum", "angryariesbitch": "I joined as a way to celebrate myself. I often get myself down & compare myself to others. With this challenge I hope to not only show myself unashamed with my sexuality, but to also look back on these photos and remind myself there is nothing to be ashamed of & to be happy in my skin.⛅💕🌺", "breehartshorn": "I was an unofficial participant last time. I learned a lot about myself and the challenge helped me, at times, learn to be okay with myself. I have been feeling more and more disconnected with myself. All the loss and yearning I have been feeling this year have spiralled me into further depression and the thoughts that I am unworthy of love. Either from myself or others. It is a constant battle that I struggle with everyday since I was 12yrs old. Through this challenge I hope it will boost that little light inside me reminding me that it is okay to be flawed and that you CAN love yourself at the very least. I hope everyone else doi n this challenge finds a newfound love for themselves as well.", "_rashaej": "At 28 yrs old I've finally found my confidence and have become comfortable in my body. It's time for me to celebrate the goddess that I am and embrace my sensuality.", "ellensbowles": "As a reminder to myself that no matter what challenges are currently arising in my external life, my relationship with self is above all my priority", "comfy_spice": "This is my second round of participation and I couldn't be happier. I love receiving and reading the emails each morning. I love taking time to create a scene and really indulge in the selfie taking process. I love \"meeting\" new people, hosts and participants! Since the last round, I've shaved my head! I am interested to see how/if that affects my selfies and thoughts about the challenges.", "vianeynjeri": "I signed up because I could use some inspiration and emotional support in embodying my sensual self and being fully supported for doing so on social media.", "flyying.foxx": "I’m so psyched to do this again, to participate in exacting my sensuality how I would like, and celebrating it alongside all of you!! 💘💘", "uniqueyorker777": "Yesss can’t wait!", "lisa.houchins": "@nikki.brewski", "sheemerz": "I joined to unshame myself. I joined as a reminder that I am free. To work through my anxiety of feeling like I’m not enough or that I’m too much...I joined to celebrate myself, my sexuality and my sensuality ✨ thank you making this space visible. For welcoming us to join youuu 💕☺️❤️", "madelines_mantras": "Love this so much!! Thank you for coming up with this brilliant idea, it’s time for women to embrace their own sexual expression, and support ALL women who join the movement🙏🏼✨", "_brette": "I signed up to continue to heal the wounds of trauma and to inspire others to do the same!", "celestialgoddesss_": "To be shameless, to be fearless, and get out of my comfort zone. I’ve always been super timid, and afraid of expressing myself. Because when I was growing up I never felt good enough due to a lot of childhood trauma. And just now I’m learning to embrace and love me more, and be unapologetic self.", "deadlifts_and_redlips": "I’m signed up so that I can reclaim my sensuality. My body is bigger than I’m used to and I want to reconnect with it. I’m also exploring my relationship with body hair so this challenge is perfectly timed for me. I also cannot wait to celebrate other women along the way 💗", "croneofwands": "I first learned about your work a few months ago when I saw you were teaching Sexting Myself at The Herb Shoppe in Portland this past spring. I almost signed up but at the time I wasn’t ready. I’m a childhood sexual abuse survivor and while I’ve done a huge amount of work on healing the trauma associated with that, it’s just in the past few months that I’ve been ready to delve back into all the shame that I hold about my body, sex, my own desire. I’ve been inspired so much by your work, and one of the things I began to unpack is that while I can see myself as beautiful when it’s just me looking in the mirror, the camera (even if I was the one wielding it) immediately inserted a perceived second party into the equation, one that felt very tied to the male gaze (and the ways I’ve always allowed my desire to be defined by men and not by myself). I started taking sensual selfies about a month ago, inspired by you, and it has already been transformative! I’ve posted a few of them to my stories (highlights: “Soft & Slow” if you’re curious!) and it has been amazing. One of the things I learned sometime ago about this platform is it can be an amazing way of exploring and sharing things that normally we feel ashamed to speak or show. Sharing my process here has become a huge part of my own slow work of releasing shame and this just feels like the next phase in that journey. I can’t wait to participate in that with a community exploring the same space over the next 5 days. Thank you so much for sharing this beautiful offering. XOXO 💫", "hippiechic8787": "I signed up to become more fearless & embrace my sensuality freely. I’m excited!", "jenesisgarcia_": "I hope to heal the shame and guilt when it comes to treating my body with a lot of love and touch. I hope that I make myself desire myself, that I feel curious and passionate towards myself. I know that my sensual selfies will help me with that ❤️", "tefferbear": "@shivanimb do this with me? ❤️❤️❤️", "tamara_lay_lay": "I signed up to feel comfortable in my body as it is growing and adding more weight. I have confidence but sometimes people fat shame and it gets the better of me. I need to learn how to self-motivate myself back to my self so I can can outside just as much as my inside.", "talesofawannaberedhead": "As a sex positive blogger i feel it is my duty to show express my own comfort in my sexualtity and hopefully encourage others to take pride and thrill from the image of their own skins. Shot by them 💕", "iamqueen_phoenix_": "I joined this challenge because this is the perfect opportunity for me to get in touch with the sensual , softness and vulnerability of being a magical wombman. I have been taught and conditioned to flow in my divine masculine and sometimes I need the reminder that it is okay to be soft. I defiantly plan to take advantage of opening up and healing my solar plexus by getting in tune with my sensuality 😁💜💜😍", "ssh._h": "Ive joined to explore, adore, treasure, liberate and LOVE the fuck out of myself!! 💖💖💖💖", "tasghia": "To finally grasp the fact that social media isnt the common* let's go nude and show ourselves but more of a open journey with an amazing circle of strong warrior woman around to encourage the fact that you should, indeed celebrate your inner self in the outside world. @evyan.whitney thank you, so much for starting this and being such an inspiration 🍉🍉🍉", "pretty.wiings": "Newly single mom of 1. I’ve found that in all my life I have never had the confidence to find myself beautiful, sensual, or even sexual. Though I have had sexual encounters I’ve never felt like I’ve owned my body. It was always someone else’s to love or manipulate. I am currently on a journey to SELF LOVE/EXPRESSION and I want to do it with no holds barred. Even though I am overly shy and extremely sensitive to everyone’s thoughts I would like to step out my comfort zone and explore the sensual side of me with you and everyone else who has and will be joining. Let’s do this ✨💗", "andreacwood": "This is the only body I have. I want to change but I also want to love it. I want to be attractive but I also want to not give a shit about other people think. I want to give my body only the best but I also want french fries. I want to accept the paradoxes.", "sammplss": "My self love and self care is deeply personal and private. As a way to level up, I feel like it's necessary to make my self love known, loudly and without shame. I'm ready to make my love for myself visible. I've always been worried about what people might say but I am ready to enforce my boundaries to those that may not understand what I'm doing and attempt to take it for their own pleasure.", "erotic.earth.embodiment": "I’ve been feeling a bit disconnected from myself, from my sensuality and sexy. I’ve gotten too wrapped up in the daily grind of life... I’m excited for this welcomed reprieve to come back to myself and my body. Last time you ran the challenge I was running my own challenge so I couldn’t participate. Super pumped to be able to do this time around!", "theheartadvocate": "I’m sooo ready", "goddesssteph92": "I signed up because I want to feel sensual and see that can be sensual when I am fat and I see that my body is beautiful! Because when I was growing up I hated my body I use to dress up a tomboy now I feel a pit sexy and I feel like a girl again so I dress sexier . And it’s a Vulnerable Challenge and I am not a vulnerable person so I decided to push myself to this challenge that is so beautiful so I can push my Divine feminine goddess Energy out to the world to show people that use to find me ugly that I am really sexy I am doing it for me and to show people that am a sensual divine woman AND QUEEN 👸🏻👸🏻🔮🧘🏻‍♀️🍷♥️.", "tay__be": "Thank you so much for creating space for opportunity to support our unique and collective sensual expression. I joined to break past some limiting social media complexes I have around being my fullest self on this platform and often times over thinking how I share myself in posts to the point where I don’t post at all when In reality I have so much to share and love doing so in my non social media realm...So many layers. This feels like a good practice. I am on my way back to the expression I knew and felt when I was younger, when I had less experiences that influenced me to dampen and filter what feels safe to let flow and create in my expression. Much love to you and every soul involved!", "frutamala": "I joined because I struggle to see myself as a sexual and sensual being. I love being naked and posting pictures in little to no clothing and I get a lot of compliments on my “confidence” but I still struggle to see myself as some who deserves pleasure and as someone who others can be sexually attracted to. I’m ready to channel my sensually and feel sexy.", "lynciaoldine": "@julia.pelao @armynurse_dru 🌸", "clearly.katiemae": "To really see myself. To take another step to loving myself exactly the way that I am.", "msviintage": "Can’t wait!", "themelanatedmermaid": "I signed up to let the world see what I see in myself. Colorism has always been a thorn in my side and I hope to heal the little girl that was teased for her complexion while celebrating the woman who is happy in her skin and knows it’s a blessing!", "mylady_saywhat": "To reclaim my sexuality as a mother!! To finally not give a fuck and to radically love myself. <3", "peaxhprince": "I'm excited to take up space with people around me ! Really looking forward to being a part of this little love party and community of people with the soul purpose of building each other up and loving ourselves. I saw a post about your challenge and IMMEDIATELY signed up this is such a wonderful idea", "yungjarmusch": "I'm doing this challenge for a few reasons. Last year, I took the Sexting Myself class during a time where I wasn't 100% happy with my body but wanted help exploring my own sensuality. The class environment was so supportive and @evyan.whitney 's direction and course outlined resonated with me so much. I discovered a part of my sensuality and sexuality and just my personality that I had been repressing basically my entire life. I always thought I was shy and timid but I'm actually very bold! The class had a ripple effect of change through my life, I was way more assertive and way more MYSELF. things I had been wanting in my life just started to unfold and I felt so good in my body again. Not to mention sex was becoming way more enjoyable. I'm taking part in the challenge this year because I want to make these aspects of me more public. While I feel out as a sensual and liberated person, I still hide my sexuality in some ways--i find myself still self censoring or hiding behind emojis in sexy selfies because I'm afraid of ridicule, but fuck that. I'm too old to hide, I have work to do and I want to have fun. Let's rock . ✨", "rainbowliciousss.remix": "@carly.beaudin 💗 @vanaynaynaynay 💗 @illuminated.honey 💗 @kolberoseflowz 💗 @lizaleigh 💗 @dianelovesrain 💗", "themodernvintagetribe": "A queen", "milkshakeroom": "i signed up ‘cause i truly believe we still do not love ourselves enough, so it’s good to remind one more time that we all should love our bodies more and more and taking selfies it may be a way to do that❣️", "eggsflaurantine": "I want to learn to see myself through my own gaze, not the male gaze. I have no idea what that will look like. I’m so excited.", "femme.rising": "It’s been a Kali kind of summer. I’m looking forward to introducing myself to this new me and making time for replenishment + expression.", "leti.lluna": "To fall in love with myself", "selenangeles": "i’ve always tried to shrink myself and create space for others while neglecting myself any space. also i’m trying to learn how i can look in the mirror and see myself for who i am rather than who i think i should look like. i’m excited !!!", "seedandcircle": "@daikiniflow", "someflowersutra": "I joined cause it's scary & challenging & I need to lean into that. I joined cause I want to reclaim my body in a space that has made me feel unsafe. I joined cause I wanna proclaim my coming back home to me.", "friendlymagpieoracle": "I’m learning to love myself and my body is part of that - scars, hair and all", "tabithaxx": "I just hit a milestone age, and I want to feel genuinely comfortable in my body and skin. No more second guessing under the gaze of others!", "lotus_like": "@sillylilywilly join the challenge , it must be fun !)", "amandinecouot": "I'm at my unhealthiest ever, and my body shows that. I want to try and learn to love my body as it is, through its strengths and especially its vulnerabilities! I don't want to think of myself as a \"before\" or \"after\", I want to think of myself as \"damn\" at all stages of life, health and so on 💕", "cassandratle": "IM SO EXCITED AND SECRETLY NERVOUS AF", "upton_untamed": "I signed up because I noticed I barely take selfies anymore, but I always feel good taking them and sharing. 💜✨", "kendallgetzi": "I’m showing up for this challenge to do something for myself - to show myself gentle care & love. I am hoping to deepen my relationship with my body and connect with all the other women & femmes on this journey ✨✨", "briarrosehealth": "I signed up because I wanted to make a commitment to myself as I work on accepting and loving my post partum body so that my children know how important it is to love themselves. I’m excited to learn and grow through this process and support others in their journeys as well.", "dylandalen": "@halliekaylynn", "gemmmsss__": "@jacquelinmaylani @xxtinaxx just signed up. Y’all ready?!! 💜✨😘", "shedrawswithin": "So excited for this!", "thelovinggaze": "@menina_ekinerom @body_mary", "itzmeyagirl": "I signed up for the #sensualselfiechallenge because for years I’ve been shamed for posting self photographs of my body. “You have a great body but I think it’s too much.” Or “it would be a different story if you were posing for a photographer or figure drawing class” SHAMED into thinking my body isn’t a living and breathing piece of art. I argue with people saying that “ I am the photographer this is a self portrait” but they still want to shame me. I am shamed because I’m too small, too skinny, my collar bones are showing too much. I signed up for this challenge because people think it’s okay to ask me “are you doing hard drugs, you keep getting skinner.” When in reality I was deep into my yoga practice and my body was becoming toned. A practice that allowed me to calm my mind and body and be peaceful in a breath. I joined the challenge because I am sick n tired of being sick n tired about the stigma over my naked body, my body type, body weight, and every other damn thing people want to critique me for. I joined the challenge knowing I would have a strong backing of WOMEN who do not shame. Can’t wait for tomorrow and the next few days.", "laracarvalho_": "I've come to realize I'm afraid of showing my true self and of taking up space, feeling like I don't deserve it. I signed up because my sexual expression IS my creative expression. I deserve it, I'm worthy & I'm taking up my goddamn space 💛", "sleepy.eyes.clxb": "My photos are gonna be so dumb and ugly", "nakedas_a_bleujaie": "First off I love selflove challenges of all kinds it helps me dig deep and discover something new about myself, they give me joy and perspective and I love the vibes when there is a group involved. Also I just want to embrace myself fully and just live intentionally through authentic expression and I know this will help me do so 💜💙 @evyan.whitney", "gabalexa": "Seen so much positive feedback on this challenge & excited to celebrate my body more — after all, there is always more we can do to celebrate ourselves.", "growlingsmiley": "I signed up bc I saw @4locrow being a part of it and I have always struggled finding my own self worth and self acceptance, especially now. Celebrating my body and my sexuality is something I strive to work on", "thechakrawitch_": "I’m joining this challenge because I want to truly connect to myself, my body, my soul. Love myself for all that I am and not being afraid of expressing it! I want to show other women that they can too, that they can take up space with their beauty and all of their glory. I’m so excited to be apart of this! I’m excited to see myself and other women grow from this.", "brownskinloudheart": "I signed up with a new account because I adored your 30 days of sensuality course and am so excited to join in on the fun with this challenge! 😊", "alitroj": "To take up space. To not be so apologetic to others about my taking space. To try something new, to grow. I hope to become more connect with my body 💗", "femmmalien": "i joined because i’m kind of totally obsessed with self betterment and truly being compassionate and loving to myself. i just got out of a serious relationship, and want to totally focus on “dating myself”. i want to actively love myself in ways i never have before. i want to be intentional and mindful and soft. i want to appreciate me and get to know myself even better. i want to feel totally dependent on me and me only and i want to experience myself in a loving and soft, sensual way. i’m so excited.", "bl.aque": "Excited for this because I’ve never thought of myself as a sensual being. I feel like I’ve just only scratched the surface of loving myself, like everyone I have growing pains of being comfortable in my own skin. I’m hoping to get a handle on that and learn to love myself more. 🖤", "makeupandsin": "Im a sex educator and sometimes forget that I'm also a sexual being. So im doing this as a reminder of my own power and because as a fat mixed person the world tells me I take up too much space and my proximity to blackness is ugly", "mollonwarriorprincess": "I think it’s important for me to work on my sensuality and my sexuality to be for me. I feel like for so long it was hiding it from others at school because my natural body was a distraction, then I tried to own it but boys just wanted to take what I wasn’t ready to give, then I tried to impress men and use my sexuality for them and now I’m working on what it means for and to me. What makes me feel sexy and beautiful and powerful. Not because I’m turning someone else on but because I feel it. So grateful for you and this challenge 💕", "certifiedheala": "Because I’m tired of people telling me how concerned they are as if my awakening is me “acting out” 💕", "honeyatwork": "I joined because I spent years letting relationships and expectations regulate and dictate my sensuality. I’ve spent so much of this year reclaiming and educating myself to make personal progress. The #sensualselfiechallenge is a celebration of my growth and reminder of my softness as strength.", "shaka.lee": "I’m here because I’m all for this work! Being sensual is something that I adore. Nakedness, dance, taking selfies is what I’m literally all about. I want to be in the presence of this and share it with more who need it. 💗✨🙏🏼", "the_erbs_dem_rare": "@klillyh @katiesassquith", "onexblackxrose": "I signed up because over the course of the last 3 years I have nearly buried my sensuality and my sexual self. My divine feminine is dying for this! I used to be in touch with my sensuality, but after getting full parental rights of my teenage daughter, I hid it and turned into a covered up and shy mom. I'm ready to show her we can be sexy no matter what title we have.", "_beauty.in.wanderland_": "I joined because I am 9 months pregnant and last pregnancy I loved my pregnant body. This time it was a bit harder to accept the changes.", "mission_mango": "Thought you might be interested @ruth_sowter_tantra @debbyixchel", "peaceloveandbubbly": "I joined because I love what it is all about. I've always had the belief that we're supposed to hide ourselves or preserve sensuality for our lovers. I'm so excited for this challenge", "ashley.moon": "I joined this challenge because I’m 22 and can’t remember a time in my life where I’ve ever liked my body. This dislike completely took over my entire childhood and teenage years. I’m now 10 months postpartum and I’m ready as fuck to love myself ❤️", "baddie_shabazz": "It's time for pics of me to be FOR me so I can see how lovely I am, too. I'm hoping this challenge is a step towards healing for me.", "flwrwrk": "I joined as a way to get back to myself; to find intentional time to be soft with myself, to combat dysphoria, to learning how to feel sexy without sex or for someone else, to undoing the impact of any abusive relationships I’ve been in. I just want to reconnect with my body and spirit and find new things to love about myself. Thank you for this. 💕", "allycanales": "Just left a community and a romantic relationship that shamed me for my sexual expression and tried telling me my new found empowerment was from my trauma. I’m doing this challenge for myself and reclaiming the parts of me that have shamed myself from my sexual power and owning my power for me and me alone.", "wtfvckart": "@asphaltavocado do this with me!", "tigeragitana": "It’s therapeutic to come back to my body & be present with myself.", "missraquelrage": "I'm going through a devastating break-up with the first man I've ever loved and my high school sweetheart. I want to do this challenge to gain a sense of sensuality of self. That part of me is very tied up in him and I need to reclaim it for me.", "taydatottts": "I signed up because I saw @notrlygrace post it on her IG, I knew that if she supported then I had to. I hope to celebrate my body/sensuality for myself and take back sensuality. The last 5-6 years, anything sensual was done for someone else’s pleasure and never for myself. I hope to gain joy in being sensual for me again.", "pusssywitch": "I just signed up so I can do it again. I just love you that’s why I joined.😍✨💜", "lotz_111": "Self love for myself and my body. Sexual freedom. Thank you so much for this opportunity. I am starting to feel empowered all ready❤cant wait! Xxx", "mujerrebelde": "I caught the tail end of the challenge last time so i missed out on the prompts. I’m excited to join in fully this time.", "keshsworld": "I need to practice what I preach. Move beyond fear and labels and ideals. I need to shake up a little and let free. I’ve heard about results from this challenge, I’ve watched and listened to what you have to say and I decided if not now, then when. I’m so nervous and excited! I can not wait for tomorrow to come!!!", "corbettjulia": "🙌🏽💖 gorgeousness", "foxxfern": "So pretty"}