{"yeamaia": "Ahaha his comment is so het it’s laughable.", "elsamoreck": "😂", "vargavindar": "I would literally not be worried about raising my daughter in this world", "mrsmegalomaniac": "If there would be no duded, I would probably live the same life I live now, I dont like pants and I already wear hoodies, did not know it is a male only fashion choice. I would probably just enjoy more looking at the beauty of women, cause there would be statistically less women and no duded.🤷‍♀️", "remeez": "I would literally just be naked all the time. And so so so happy.", "humongouslife": "I feel like I wear sweatpants and hoodies partly for comfort but also largely so I can be ignored by men .... if I felt more free I would def be much bolder and more experimental in how I dress", "dissolving_the_dream": "I would feel more comfortable showing my feminine and sexual expression without feeling the need to hide it because of all the “duded” that feel entitled to consume my body, my movement, my voice. I would wear whatever the f$&@ I wanted and not be constantly editing myself and my expression so that I could walk down a street without one of you asshats soliciting me.", "ruff_angelique": "If there were no duded/dudes, I would be wearing some baller ass shit bc I would finally be getting paid my due and there would be no gender wage gap. That extra cash would go ALL the way- into whatever make makes me feel powerful, strong, beautiful, like a queen. All the feels that I don’t rely on a duded to provide.", "cherriesandfaeries": "I would be loud as fuck. All the time. Singing and dancing and cussing and laughing in the streets as much as I wanted to. I'd never have to hear another comment about 'But guys don't like short hair.' I'd dye it different colors every other month, and wear fabulous costumes just to go to the grocery store. I'd walk late at night to the beach, or just to star gaze by myself. I'd eat and drink in public without worrying I look like a pig or am eating too much. I'd stop apologizing for literally taking up space, and if someone bumped into me or nearly knocked me over I'd speak up.", "morgansiem": "Oh the possibilities! I would go naked, I would go clothed. I would go in silks, I would go in sweats. I would walk more places. I would stay up late or wake up early - my call. I would tend my garden, sensually. I would flirt when I felt flirty, sleep when I felt sleepy, dance when I felt dancey and pursue pleasure with myself whenever the time felt just right for me. Shout out to the men who get this and want this kind of freedom for the women in their lives.", "plantingmytree": "Lol lolz first and foremost I applaud you for figuring out what the hell he was even saying😂", "eselsol_": "The comments here are golden ❤️", "jane69kim": "LOL", "kirstencrahan": "I would wear whatever I want without having to feel objectified by men. Be able to be comfortable in sexy clothing without men thinking I’m dressed for their own pleasure", "fka_nigs": "Loool my friends who have amazing bodies literally cover it all the way up whenever we go to straight clubs just to avoid male harrasment. Men literally have the opposite effect because funnily enough nobody wants to feel like and be treated like literal meat 🍖", "dollzaime": "I would go topless, braless, pantyless, wear long flowing dresses in summer, cozy soft leisure suits and robes in winter, lingerie when feeling sexy, and overalls when I need to work. If there were no “duded” around.", "beenichelle_": "I know this is old but I would seriously just walk around without a care. I wouldn’t dress any differently, I wouldn’t do anything different but walk around & live my life without having my guard up all day.", "_fiona.in.wonderland_": "I would stop shaving, stop wearing bras, wear clothes that felt gentle on my skin, dance to the wind and sing without hushing my voice. I'd continue to find love and beauty in women, ask that girl I had always liked if she would go out with me, explore my pansexuality without patriarchal oppression sparking fear in my heart. I'd live, and I'd live, and I'd live.", "sharonalanna": "Far from wearing hoodies, I’d be wearing flowy cotton and silk, never a bra. I’d dress like a damn queen, bejeweled and adorned, unconcerned with attracting attention.", "ipinktheworldisgrape": "I already sometimes wear my boobies out...under a jacket or sheer Lacey shirt etc...but I have to be so careful when and where because if it's out \"duded\" think they can touch. Without \"duded\" life would seriously be soooOo extremely pleasurable. Except for that chromosome thang I really wish we could exterminate \"duded\"", "765a.s": "I would wear the “sluttiest” most revealing wildest fun sexy skimpy outfits ALL THE TIME.", "kweenius": "😂😂😂😂", "kem.contemporarywild": "😭😭😭😂😂😂😂😂😂💖💖💖💖 lets have some fun!", "lindaursin": "I would be doing what I'm doing by maybe to a higher degree :D", "emlovecaster": "Oh god, life would be so easy, safe, clean, without tensions... THE BEST! I would wear more short skirt, tight dress, transparent top, visible suspender-belt and stockings... And, honestly, I would go out naked most of the time, everywhere. Except when the weather is to cold, I'm chilly, I need socks, hat and scarf.", "kyradk": "I would wear way less shirts", "shayaulait": "I would feel horrible if there were no men in the world. I don’t want to imagine a world without men. I actually wouldn’t feel safe or balanced. I wouldn’t be completely sexually fulfilled. And I’d be slightly afraid by what kind of systems would be in place with just women. Let’s not be misguided to assume in a world of only “women” everything would be perfect and safe. So I can’t say anything would change in the positive for me, as any oppression I’ve experienced has been at the hands of all genders. So if there were no men, I’d sit in a corner and cry.", "whattheblurb": "I would take a walk without looking over my shoulder. I would not care about my hair, make up, or what to say next . Did i say that right, am I covered up enough they won't stare. I would wear my underwear and bra around my house with no fear of creepers.", "moninomad": "@evyan.whitney This is beautiful and I feel stronger after reading my fellow femmes thoughts", "theroozle": "Wow. If I didn’t have to deal with the danger of toxic masculine gaze I would literally wear tiny shorts and heals with pasties to the store! I would also wear sweatpants and a hoodie. Basically I’d wear whatever the fuck I wanted! I almost never wear reveling clothing when I’m in public because I’m afraid of being harassed or attacked by men. I officially don’t give a fuck if men find me attractive, I just don’t want them to try to harm me.", "samantharose.vancity": "I have mixed feelings. On the one hand, I agree with many of you in that I would feel a certain sense of safety. I would wear what I wanted in public regardless of what \"duded\" might think or do. I would post more selfies, because I wouldn't have to experience the spike in anxiety when strangers comment or DM me, pressuring me and harassing me for my sexuality and my time. I would go out dancing with my girls; I love to dance but handsy \"duded\" never seem to be able to control themselves enough to respect our boundaries. On the other hand, no men would mean a life without my soulmate, and that makes me incredibly sad. It would mean a life without my brothers, who are some of my best friends. I wish that people could coexist without stomping on each other's right to take up space. Society has a long way to go, and we won't go anywhere until both sides start working together. So \"duded\" like this prick who left that comment and worse will have to either change with the rest of the world, or be left behind. Sorry, rant over.", "put0bumb0ng": "New hashtag trend as inspired by this boy: #iftherewerenoduded", "wildmagickwoman": "I came up with a new word this week: missexualize. It fits this situation perfectly. To all of the women who are rising up out of the ways that considered us as the lesser gender to be owned, possessed, trained, trophied, missexualized, controlled, medicated, etc. I share my LOVE and SUPPORT to you. To all of the men and women who truly RESPECT WOMEN I say THANK YOU, and I ask you to teach other men, women and children what that RESPECT acts like, looks, like, feels like, thinks like, and speaks like.", "afterh0ur5": "I'd spend more time alone in nature. Feel safer walking at night. Get paid what I deserve. Not have to listen to condescending tones from men. Wear a bra less. Wear whatever I want. Drive feeling safer without all the aggression on the road, at least from men. Thrive.", "marissamaryxo": "If there were no duded in my life, I would happily wear whatever I wanted to wear. I would wear it with more confidence as well. I would wear crop tips and short skirts without feeling judged by men. I’d wear bra and panties in warm weather because there would be no men to judge me, only women to join me. I would happily have a girlfriend who would allow me to unapologetically be myself. I feel self conscious around men, around some men I actually feel quite small. I’d never let them know, and I try not to feel this way but I cannot help it. Without knowing what they are thinking... I get uncomfortable! But for the record um YES I would wear sweat pants and hoodies, duh! But on the days I’m not wearing sweat pants and hoodies, I’d unapologetically be myself and my sexuality would shine brighter than a fucking Christmas tree on Christmas Eve and everyday would feel like a new beginning because there wouldn’t be a goddam boy brain in town to look down on me, judge me, make me uncomfortable, come on to me, or touch me.", "amandinecouot": "I wouldn't be scared to smile or make eye contact with people anymore, and so I'd smile tons and compliment everyone. It's something I always want to do and I do that with my friends, but with male strangers if I dare make even eye contact they think I'm into them and start following me or catcalling or scaring me.", "jadealane": "If there were no duded, I would still slay, just next to other bad bitches whose volume would increase because they weren't afraid to wear that cool outfit for fear that the duded would fear them.", "dancing.w.divinity": "🤣🤣🤣 men are THE reason I'm NOT naked all the time... Because I'm AFRAID of them", "pinwheel_art": "Yeah...I wouldn't wear a damn thing...EVER! Well, maybe when it's cold. Lol😂❤️💞", "mariana_de_queen": "Fuck that dude and his illiteracy", "ellemestrada": "I’m still trying to figure out what he’s it’s saying", "yasha104": "Well, personally I would travel solo with no fear to middle Asia, I would sleep under the skies in my tent with no fear of being killed or raped. Thanks.", "fatssoraven": "If there were no duded my account wouldn’t be private 😂", "creatureofthesun_": "Wowowowow that “duded” just don’t know. What a dumbass tbh 💁🏻‍♀️", "thewuzzy": "Well for one thing this guy is in for a hell of a shock when he discovers lesbians", "thischickistoast": "Omg my friend and I got just *so* stoned and talked about this for hours last weekend. I’d go for midnight runs. I’d throw my pepper spray in the trash. I would never say “that’s just my 2 cents” ever again. I’d wear the floatiest, thinnest fabrics with no bra, or skin tight dresses that show off my glorious curves without worrying about how men would react. I’d laugh so loud at all the hilarious shit the women around me say, and we’d never have to explain the jokes or pretend that men are just as funny.", "no.thank.yew": "If there were no \"duded\" I would live free of fear of being attacked, belittled or devalued for the way I dress. For one, I would not have switched over to my finsta to answer this post for fear of upsetting men in my sphere. I would \"were\" sexier clothing to class and not be concerned of \"distracting\" my professors or my colleagues. I would post way more nude images on social media because I am almost positive these images would not be restricted if \"duded\" did not have power over these sites.", "acoupleadventurers": "In fact, when we have no kids in the house, that is EXACTLY what Roy and i DO!! 😜😂🤣", "dan_yell_son": "Actually the exact opposite, if there were no duded i would be NAKED all day sun", "miss_meow_mak": "Wow that’s painful to read.", "meccamorphosis": "Masterbate???lmao", "a_a_astoria": "Hahahaaaa. Screaming! Get him sis. 💘", "chiichiigettheyayo": "I’d be out here dressing like what “duded” think make me a slut. I dress “appropriately” bc “duded” make my curvy self feel disgusting when I don’t. Soooo fuck that guy. I wear sweats and hoodies NOW.", "radicalsoulcare": "I’d run around naked. Frolick, actually!", "ethereal.ellen": "If there were no ‘duded’ I would literally have my mamas n booty popping out 24/7. The only reason I don’t is because I hate being looked at as only a sexual object for male consumption and I don’t dig it! I hate turning down sexual advances and watching a friendly conversation between me and a male get sexualized because of how I look", "patsy.gh": "I would be openly and VERY gay 🌈❤🌈", "paris.rae.iha": "I appreciate you picking apart one’s grammar to highlight their ignorance and their childish, frail and not well thought out opinions.", "lizwhite.co": "I wouldn’t base my outfits by not wanting to get catcalled when I’m walking around in the city. I never leave in workout leggings without something covering my butt! It’s not a fashion choice. It’s a “stop talking to me or yelling at me” accessory.", "fertilefemme": "I’d stop looking over my shoulder every single time I heard someone behind me in a parking lot. I’d sigh deeply at the relief it is to know I’d no longer be sought after for emotional labor and use all that energy to nurture my own natural gifts. I’d go dancing in whatever I want and move my body however I want on the dance floor. I’d walk through the woods at night. I’d sit with my back to doorways. I’d make choices about my own body no matter what part of the world I’m in. I’d travel alone.", "dearestme.love": "For me it depends on the weather. I love to be in workout clothes - as little as possible when it’s hot outside, but when it’s cold I love love sweats, leggings, big comfy sweaters and more. If there were no ‘duded’ then I wouldn’t worry about bikinis, tan lines or hair.", "emzorr": "It’s always so interesting to me that all these ignorant men can’t spell. And if society weren’t “duded” I’d be doing naked yoga without worrying about people looking at me... or just in general be less worried about wearing bras etc", "bettyemenemse": "I would go out at night, travel alone, and wear whatever I want without worrying about putting myself in danger. Oh and i would make tons of money!!", "fiammaleotti": "😂 You rule.", "clown_quarantine": "If there were no dudes i would be more comfortable expressing my sexuality and dressing however the fuck i want? But then again i prob dont count cuz im gay and not a cis woman 🤷🏽‍♂️", "bettywho_o": "You know this is soo needed right now. Yesterday walking home from a labor intensive day at work, my hair was crazy, my jeans and t-shirt dirty and covered in fuzz (I work in an animal shelter❤️) just smiling and thinking of the relaxing afternoon ahead of me.Suddenly, Out of the corner of my eye I see SOMEONE crossing the street and headed in my general direction and I start to feel it, that awful feeling of a “duded” attempting to get your attention, attempting to figure you and how to approach you, that awful feeling in your gut of knowing ur gonna have to endure that awkward passing moment of letting a man know “I don’t WANT your attention”.... and it was exactly that, 2 blocks and a half of telling this man, “I’m married” “i share an apartment with my husband” “no I dont want anymore friends” ugh, it ruined my day, it ruined my peaceful walk and it ruined my perceived “safety” of walking the streets in what society sees as an “unattractive appearance”. It wasn’t even a sexy moment for ME, how did this man decide to make it a sexy moment for HIM. All women RIGHT NOW could walk around in hoodies and sweat pants and we would STILL endure these awful moments of being treated as a show. Sorry for the rant, this just seemed like the right place to let it out.🙏🏼❤️", "divinemomentsintime": "@bb_succubus let's have fun with this!!!", "mossspiglet": "Oh my gosh where to begin... I would be so stoked just to be able to walk down the street and not feel nervous when passing groups of men. And yeah I would wear a hell of a lot less clothing. Fuck that dude. Tag him in this shit. Call him out for being the fucking problem.", "idreamofy0gini": "He's right. I do wear swimsuits for duded. Without duded in my life, I would go to the beach naked every time and feel fantastically free! (Ps, I love men through and through and I don't mind covering up in front of them as long as they aren't jackasses.) This is why we have women only gyms. Cuz women are actually MORE liberated in their sexuality when men aren't around.", "rabbischmooly": "I would walk around naked, I would feel safe doing it, I feel 100% less fear for my safety on a regular basis, especially at night time, I would feel so much less rage in my body and spirit, I would feel lighter, less exhausted in teaching really non nuanced truths, I would feel like I could express my femininity, not by wearing sweatpants, but by wearing whatever the fuck I want! Fucking self centered, yet also thin skinned dickwad.", "thesarahsilvas": "I would continue to wear whatever the hell I want because I dress for ME first and foremost, not others", "dancer_fourlyfe": "I’d probably be half naked all the time. I cover up when I know there are going to be men around that arnt my significant other.", "redlotus32": "I would dress the same, maybe even sexier, because my woman like that 😏💕", "deadnettle": "shit if there were no duded i wouldn’t have to wear shit! bc i wouldn’t be afraid to be in the comfort of my own body! gross ass duded.", "brinaisrad": "I would probably wear next to nothing bc the only reason I don’t wear skimpy cute as hell clothes on the day to day is bc of men", "tenderwolftarot": "Someone send this guy to school.", "cloudbaypea_": "I’m crying you are everything lmao", "caitie.sue": "LMFAO", "whatisaunicorn": "Ummmmm yeah... I'd skip bras with the knowledge that creepy eyes wouldn't be on my unsupported breasts all day. And I'd feel a lot more free to express myself through style without having to consider if it's \"too much\" for leering men to handle.", "lilaroseanna": "Omg the idea of a world without duded is beautiful. I would would wear way more revealing clothes, or no clothes, I wouldn’t have to worry about men looking at me! The idea is pure freedom, and now it’s actually making me sad to think we don’t get to have this.", "the_vibrant_hak": "i’d be braless and pantsless forever, wear dresses every single day (like i wish i could but mostly avoid only because i want to AVOID the male gaze) and put on lipstick to leave the house", "xingonaxillona": "I would dress exactly the same cuz I be looking cute and I’m queer as hell so it’s not for his ass anyways", "hayleysdyer": "If there were no duded - I would never wear a bra or just wear my beautiful bras as tops", "moon_body": "If there wear no duded, I would were outlandish kimonos and spend my days leisurely exerting sexual tension all over myself", "galway_girl_7": "I'd walk around naked every fucking day....", "taziacira": "without duded I think my overall state of mental,physical and spiritual well being would be more intact so i didnt have to be a mom to the 2828282 duded who think that a real relationship is treating your partner like a therapist. And then i would continue consensually romancing my fellow enby folx and womxn because we all know we do it better than any one any how", "germanwoman29": "Prob the opposite because I wouldn’t be scared to", "live_vi.kerry.ously": "Ahhh! I love how I look, I'd wear the same things! Less bra time, more naked time. I'd be less afraid overall of misinterpretation. Ps 90% of the compliments I get about how I look come from ladies ❤", "akornefa": "I’m loving these comments (the people actually taking in her prompt). Check it out! @thelastmimi", "nashiralotus": "Damm it’s really insane how dudes think that we dress sexy for them when bras were deadass invented to cover our nipples so they can’t see them... we really all hate bras with a passion but have to wear them because men can’t handle seeing nipples... if there were no dudes there would definitely be no need for bras anymore", "rebelrebel1776": "I do whatever TF I wish.....\"duded\" or not. #GrownAssWoman #GoAwayLittleBoy #GoddessWalking", "passionbykait": "I mean i spend most of my time in my apartment in various states of undress so more of that. And i wouldn’t be afraid to go bra-less or out in a sports bra. It would be GLORIOUS", "wyld.magick": "take nightly walks around 1 AM when my anxiety is at its worst. as of right now, i can only pace in my apartment until it (maybe) subsides 😔", "cranjuicemami": "Everything about this is perfect", "shortcake.xoxo": "Props to you for even being able to read that!!! I def needed a translation. . .yikes! Well. . .we certainly see what happens when a duded doesn't have a womened!!!!", "kingkandake": "The one biggest benefit of going to an all-girls high school with a loose dress code. We wore whatever we wanted because we felt like it. Sometimes it was sneakers, other times it was heels. There were no boys around to impress so his around has no basis.", "queerbbby": "Oh life would be so much more chill without duded 😌", "groverune": "If there were no duded I would wear absolutely nothing ever", "vibeson_zen": "He’s an entire idiot", "nasmanjennifer": "If there were no duded I'd run at night", "bretteliza": "😆🖤", "katytiernan": "😂😂😂😂💜🌿Let’s pray he wakes up.", "lovestarsworld": "I have no idea. Because who even created sweatpants", "shawnie.graves": "😂", "mwooding": "I were hoodies and sweats with duded. Although sometimes I think without them I’d dress up more because I wouldn’t have to worry about responses.", "yourgurljayno": "👺", "mimimaayan": "I’d be naked and beautiful all - the - time ✨", "linabembe": "No dudes? Easy! I just wouldn’t feel at risk of getting harassed and would feel safe every time I go back home late at night. I wouldn’t also be worried about anyone else’s safety", "lorenzqupid": "He’s a joke", "lacaius": "All I can say is WOW..WERE is this dude from 😁", "caitie_metz": "I'd embody my most, secret, hidden femme self. I'd wear hi-wasted skirts without a shirt. I'd breathe so deeply. I'd lay naked under the trees. My heart would find ease.", "shee_dancer": "If there would be no dudes lol i would probably wear more things that make stand out my sexiness. At least there would be no one or almost no one harrasing you because they think it is for them.", "kyisha": "the last hashtag 😂💕", "elleestzoe": "I would just be so happy not to have to wear long coats to cover my ass and bras to cover my nipples. I wouldn’t have to worry about my clothes being too sexual.", "verldsherravelde": "If there were no \"duded\" i'd prance through my day in underwear and a pair of sturdy boots and chains and bling and my \"duded don't like that kind of makeup\" makeup, and be naked indoors at all times and a lot of other times and talk about my emoooootions and cry, and talk about my period, pussy, boobs and masturbation in public. Dance sexy in public. Be gross and loud in public. French fries, spirulina tumeric ginger shots, fruit and wine all the time for everyone.", "chingonadelatierra": "Gonna add one more vote for being naked all the time. Especially in nature! #fuckthedoodeds", "collkell": "I would be naked all the time and feel so safe and free and blissful! 💖💖", "vedgygurl": "I would still wear whatever I want. Fun fact: I rather wear “sexy” clothes at home/ for myself and If I’m around my bf I usually wear sweatpants & hoodies", "kittyhearse": "I would still wear the stuff I do now. I don't do it for them, I do it for me. I see my clothes as painting a picture of what suits me that day not to get boneheads attention. Since I did the #sensualselfiechallenge I have been posting more body positive pics and may I even say sexy photos...but even women can't handle it and start slut shaming. Love your bodies and who you are. Thank you for helping me lady. Women helping other women. Fuck this idiot. I am me for me nobody else 🖕🖤", "sineadcurry": "OH MY FUCKING GOD", "tasha_tilley": "Play! Without it being taken as flirting. Dress sexy! Knowing I won’t have to worry about being objectified, judged or violated. Go out wherever, whenever! Knowing I won’t be taunted, followed, tooted or wolf whistled", "gabalexa": "I would spend my entire life in a leotard. I would also wear the yellow tutu that I only bring out when I’m going out in a large group... but every day.", "lalita_yogi": "Naked", "movethatdoughbakingco": "If duded didn't exist I would do everything I do now, but with less fear and less of a battle to be heard.", "trixradical": "I'd f*** walk around naked", "manda.livingfree": "Id be naked all the time...dudes like that, man I feel for their partner (whoever it is)", "kooijmaniris2018": "I take sensual selfies and i am not willing to share them with anyone, not even my boyfriend. Taking them makes me feel really good and proud, looking at them makes me get butterflys in my stomach and giggle. I love having a teenage crush on myself!! I would still make them if there were no so called “duded” around as that would make no difference to how the situation is now. Therefore your point is disproven mister weirdguy.", "baby_veronimal": "He wrapped that up in a nice little package, didnt he?", "eerie.ka": "If there were no “duded” I would constantly either dress like a fancy ass lady from the 50s or be 100% nude- it would be great because no one would be there to say things like “high maintenance”, “only doing it for men”, “is asking for it”, “slut”, etc Damn, now I’m daydreaming...", "sophiroze": "Would read from the multitudes of books written by women which remain unpublished exactly because they are “written by women”. Read Nelle Harper Lee, Mary Anne Evans, and the Bronte sisters rather than Harper Lee, George Elliot and and Ellis, Curer and Acton Bell.", "rachelhollandstudio": "I’d probably enjoy actually being able to show my skin without worrying about any Duded thinking that it was an invitation to my body. I’d also quit wearing underwear. The end!", "eye.am.samira": "Here is his insta @life_scares_me.exe", "minaminers": "I would swim nude. I would sunbathe completely nude without looking over my shoulder. I would sleep with my window wide open. I would take a night run. I would shoot at night. I would travel everywhere. I would go to the park at night and star gaze. The list is endless...", "sempiternaleigh": "If there were no \"duded\" I would feel comfortable going out in public dressed up with my makeup and hair done without being accompanied by an honorable \"duded\" instead of \"were-ing\" sweatpants so I don't get unsolicited attention from \"duded\" like this one. And that's honestly just the peak of the iceberg.", "michellelatourettewood": "Hahahahaha♉️", "hapabee_": "@warpaint_beautyy what would we ever do without duded?? 🤔🤔🤦‍♀️🤦‍♀️", "diasporicanblues": "If there were no dudeds I would wear whatever I want. A hoodie and a thong or have my tiddies out and wear only sweatpants.", "lydiabfit": "I would wear way more sheer shirts and thin tops in rooms with ac", "kitmaloney": "I would wear so much less and move with so much more freedom. Just the thought of the levels of safety in a world wo “duded” brings tears of joy to my eyes. (I believe that men in their aligned masculine can help create that safe, vibrant, and expressed world too. Just no dudeds please.) 🙏🏽😘", "spacekittyx": "I would be so happy... and naked.. always. 😹", "sunhelix": "I would be a different person because I would have grown up unbound by fear. But I assume I'd do what I want to now: wander, outside, alone, and fear no man", "leti.lluna": "🤣🤣🤣🤣 I’ll wear whatever I want just like I do now, whatever I feel beautiful and maybe I’ll be less scared to show off some skin and curves", "firemoonfresh": "Da fucc! Its taking me too long to try and decipher what the hell he is writing let alone trying to say 😩 also what i think has been a big oversight with this metoo and own your sexuality movement is the amount of women sexually abused, harrassed or intimidated by other women.. so even if there were no men, sexual predators can still exist. I've been to same sex clubs and have been groped and intimidated by women who want to have sex with women. I found it more 'damaging' than a mans advances.. so me i would whatever i want and not let any gender dictate my choices. One thing i learnt i cant control the assholes in the world so let them do them and me do me. ✌🏾❤️", "heulwen_rose": "Men like this love to hate women's bodies. If women wore cozy clothes all the time we would get comments about how we have no self respect and need to make an effect for dudeds", "mermaidkikii": "I would be far more comfortable on public transportation. Also wow people would understand when I am experiencing severe period pain and not try to minimize it or make me address my menstrual pain/blood in a coded way so as to not \"offend/disgust\" the person who ASKED about it. I hate being shut down when discussing my menstrual cycle. Also could have my nipples and breasts free to bounce joyfully. This post is making me happy with all the possibilities.", "nic_jonesn": "Oh no ma'am. I refuse to entertain these notions from a child who rubbed dirt on their lip as a mustache. I bet he still jerks off into socks. 👋👋👋👋", "babyfacethovey": "I would probably wear nothing or as little as possible lol I hate pants and bras lol", "healwithbroocke": "I would walk around in lingerie if there were no men, because I wouldn’t be afraid to show my body, there would be no fear of showing too much and the fear of being attacked would be eradicated.", "kidsbestmom": "Comments are amazing! Love this! I’d be braless for sure! Feel safer! Everything these women stated!! Men think we need them and look good for them! Ugh! They are so fucking clueless! Women power! Love all you ladies!", "megan_lachowski": "@arielisontheroad", "halloween_queen909": "If there were no dudes social media posts would be 70% more grammatically correct", "yes_anyanwu": "No dudes to yell and stalk and creepily stare at me! Or make me feel like I'm inappropriate for existing!? I would have days where I would wear nothing but shoes and jewelry in the summer. it would be amazing. As it is now I have really cute stuff that I don't wear that much because of how men act. I went through a phase when I just stopped wearing shorts because it felt too dangerous. I'd walk around like one of Rihanna's runeays models all day", "eyeofchelsea": "Naked alll the way 🙏🌟", "knotkewlenuff": "If there were no men I would go topless all day every day. My regular wardrobe would be like a mini skirt and jewelry", "grandmultipiper": "Whomst!!!!", "toranmcgill": "🙌🏾 ahh the freedom of the women without the duded. It is exhilarating!! Yesss!! To the safety!! To be free!! Without having to walk around with my RBF. Without having to constantly look over my shoulder. Without having the society create the “need” for women to compete against each other for anything. Definitely not the duded", "mother.of.vegans": "Loooool 😂😂", "nellythegreat": "I couldn’t understand a word he wrote. He can eat a bag of d*cks.", "kitanalouise": "😂", "whatsthealternative": "my eyes hurt reading this", "___savv____": "Gurllllllll lemmme tell you. I’d never buys clothes again(whuch means I’d be fucking rich😂)... I’d be walking around this world showing my ass, titties, and kittie to all them beautiful humans left on this beautiful planet 😂 @evyan.whitney", "frog.goblin": "if there were no “duded” id still wanna dress hot as hell because i want look good for myself and also... there’s gay girls? who says we can’t look good for other girls. smh why are some men so dumb", "jamiekarla_": "I'd no longer worry \"my period is showing \". Skirts and free bleed, baby, rituals under the full moon and howling.", "devonwalzart": "Really taking this into consideration, I’m realizing how much cuter and revealing my outfits would be. I would have no shame or fear around dressing sexy and empowered. That’s the truth. So important (and a bit sad at the same time) to realize. Thank you for this 🙏🏼", "zawadinyongo": "😂😂😂😂😂 I swear you can’t make this shit up. 🙄🙄🙄😴 It’s like we are on parallel universes. Wow. Imma have to come back to this later and read some of the comments. And it’s a good thing you blurred the duded’s name. Because who he is, is irrelevant. It’s what the misogyny he carries that we need to disrupt. Well fucking done for taking your power back like this. 👏🏾👏🏾👏🏾💪🏿👸🏿", "activist_ish101": "Well, I would be surrounded by individuals who are not afraid of punctuation and basic grammar.", "bohobelleadventures": "When the diction is so messy you have to rearrange and contemplate the foolishness #hardpass 😶 - you’re awesome. Your page is awesome.", "thejessgillis": "😂😂😂😂", "morganleighcallison": "I'd feel more inclined to not censor myself and my sexuality knowing that no one was trolling on my expression.", "bbhevenlee_": "@bad_n_budju lol", "julia.woodrow": "Feeling really lucky to live in a tropical place where it’s relatively acceptable to wear no underwear most of the time. I dress for myself. But if there were no “duded” you better believe that every time I swam in the sea, I’d wear nothing but the skin I was born in. 🌊💫", "tabibelden": "I ask what i would were all the time and we STILL don’t know", "itinerantmystic": "I wouldn’t second guess if I was going to be perceived as ‘attractive’ or not! I would wear clothing that clung and revealed and felt good on my body without fear of being leered at, catcalled. I’d be more adventurous, which makes me think I need to be more myself now!", "modelingmotherhood": "This whole post and comment section is making my day. Dudeds needs to be a thing. #nomoredudeds #womanagainstdudeds #dudubraindudeds", "exlibrismollymurray": "Let me guess that he only wishes he had this sexual tension in his life!😆", "dianamarceil": "Omg loving the thread yaaaaaaas ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "madlywiththemearkles": "I wouldnt wear a bra and I’d work way less. More simple life lol", "miamariasiler": "With no men? Naked, all the time.", "jnwilso": "What a fucking prize. New heroine: lady who wears sweats and hoodies and cuts off the dicks of such scum.", "stella_joi": "Tassels and yoga pants. Sitting on my throne of decorative throw pillows and sipping my ginger tea. 🙌🏾", "bodhisgardendelights": "😂", "moonshinedawlin": "#whomstmansisthis", "yawoowooboo": "If he had spelled everything right, the message would still suck. I don’t think this guy wrote it like this cos he’s dumb. I think he got rejected by someone, got drunk and decided to troll. It’s a manifestation of his inner twisted thinking, even if it’s because of a carelessness or inebriation.", "bunnybunny87": "I would wear a lot more glitter. my bf is a wonderful human but I know he doesn't appreciate it when I wear so many sequins I reflect light. I'd miss him tho....", "lerinalta": "I’m a stan for sweats and shirts although I also love to be naked and in the sun as much as possible. I am also newly obsessed with more curated loungewear a la @ditavonteese. ✨Because...🗣 I’M A FCKING SOVEREIGN WOMAN HUMAN WHO CAN WEAR WHATEVER THE HELL I WANT, WHENEVER THE HELL I WANT. 💁🏾‍♀️", "the.krim.reaper": "Hahahahaha I can’t", "bluesadelic": "A world without “duded” ... MAAAAAAAN that sounds so nice, too nice, in fact it sounds PERFECT. No need to heal these men, no need to attend or cater to their needs, I’d be able to wear whatever I wanted without fear of catcalling, rape, or necks being broken while I walk the streets, no one to hit on me when I’m trying to have a good time with my girls, no pervs, no drama, no machismo, no tension. A world without “duded” & only women sounds like paradise.", "ebonykenney": "I would literally be asshat naked, with rainbow ribbons tied around my nipples and wear a different color of glitter in my pussy hair for every day of the week. And be able to make eye contact with true pleasure and joy instead of as an intimidation-tactic to ward off would-be assailants. 🙌🏽✨🔥", "elody_rodrigues": "Oh and by the way, what you are doing is amazing, necessary and incredible and it helps a lot of woman conect with themselves (it has been that way for me) @evyan.whitney. I respect your work and cheer you to continue what you are doing. The world needs more you and less odf this asshole (he shouldn't even post nothing to begin with). Kisses an hugs", "evolving.light": "😭😭😭😭😭😭", "wrecklessaries": "I’m a gigantic lesbian so no “duded” is good for me", "burger.heaux": "I’d wear my dream outfit- a string bikini and high heels. No men around to catcall or be aggressive? What a wonderful scenario that would be.☺️", "aknkans": "I would run at night. I would travel the world alone. I would dress for the season, and not for the possibility of being harassed on the street. I wouldn't carry mace. I wouldn't censor myself. I would hold my lover's hand in public without a concern of being approached for threesomes. The list goes on...", "ally_mazer": "I’d remember how great my education was that even if I took more drugs than ever I’d still know how to spell better. And that my thoughts would stoop to compare to this...you nailed it.... asshat.", "sprintingsalina": "If there was no dudes I’d still dress cute and brush my hair and do makeup for fun. So yeah. No change.", "literalamber": "I discovered masturbation at five years old & pree sure five year old me was being sexual because sexuality is inherent. Like if no women existed would guys not masturbate? 😂 😂 😂 as if!", "chi_ronnie93": "My comment was referring to the person who made the comment on @evyan.whitney’s video . (The one she posted)", "julia.amanita": "If there were no duded I would eat ice cream & bananas in public. If there were no duded I wouldn’t feel like I had to cover up walking home at night. If there were no duded I wouldn’t feel like I had to constrain my sexuality in fear of being harassed. I’d be naked when it was hot & bundled up when it was cold.", "witchwaytotheforest": "I'm genderfluid and I'd feel way more comfortable to wear more sexy clothing!! Total opposite of what this idiot says lol", "katie.quest": "If there were no duded I could wear my sexiest clothes around in the light of day without fear of assault and it would be amazing.", "bushy.tailed": "Interesting this person thinks that dudeds are the root of female sexuality and desire. I’m sexual all the time. What a self absorbed fool to presume ANY womxn’s desire for ANYTHING would be motivated by them or other dudeds. I kinda wish I was more mad... I’m either jaded by social conditioning, or this person is so dumb and careless, the pity I have is tempering potential anger into ambivalence.", "heauxsquared": "the gag is I would dress more provactively if there were no “duded”", "the_girlkyle": "Honestly, my imagination is failing me a little bit on this one, because the omnipresent, insidious, toxic masculine garbage that dudeds have used to pollute the very air womxn breathe feels almost like it’s encoded as an inextricable part of me now from having it inside me forever and it’s scaring me.", "foxylaini": "Let the duded be eradicated by natural selection", "tanyouh": "Would literally just walk around naked all day if there were no “duded”", "jamiebee143": "Without a \"dude\" in my life? I would enjoy myself with others. And, these others include delicious, educated, confident men and women!! Because these individuals are cool af and ready to have in depth conversations about sex, lies, spirituality......you know, REAL SHIT. Oh, and we would be laying around in our sweats laughing about how pathetic some sexually frustrated boys are airing their frustration on Instagram 🤣🤣🤣🤣🤣🤣🤣🥂✌🏽", "wisemadison": "lmao I’d have my titties out all day because I wouldn’t be worried about men staring at them", "theconsciousmama": "I had to read his comment so many times to even maybe (?) understand what he was saying. But to answer your question, I would be naked naked naked all the time.", "lovelifemarlak": "Just being able to have resting bitch face and not be told to smile , that would be nice. Or just knowing that everyone around me at some point bleeds through their pants sometimes and don’t think it’s a gross issue, it’s life. Just having a No Shame period in general.", "eartheashe": "no dudes? yo, i would be EVERYWHERE! any place that i fear walking or being alone in, i would be there in a heartbeat. a nighttime movie? done. walk in a more secluded beach or park? done. just a good ole stroll to or from work, or a ride on public transit? don't have to worry anymore about random \"duded\" trying to \"talk\" to me and then getting mad (or visibly aggressive) when i don't reciprocate. life would be a whole lot better honestly.", "kassy.psychicmedium": "I’d go braless more often, even just to the grocery store without worrying about being creeped on, I would take walks at night, I’d where more short dresses...I would just generally feel safer to express myself and to just BE", "andrewsalyse": "😂 what a turd", "spentthenight": "Good Lord, the ignorance is so deep and wide on this one.", "darkpoetrystories": "“Hello I am an idiot, please roast my dumb ass” 😂", "madame_ostrich": "LIES AND DECEIT! If there was no repercussion or fear of sexual tension best believe I’d be walking around in a latex catsuit.", "missorian": "If I weren't dudded out, I think I'd walk around in hoodies and sweats and STILL exert my sexual tension 🤣🤣🤣", "smallreckonings": "100% titties out all day loooooooong. Dancing in the damn super market aisles. Telling all the femmes around me how freaking beautiful and capable they are!!", "baabaa_yaga_": "Lmao your weak af", "chelstarc": "Ha! If there were no “duded” I would probably wear way more skimpy clothing. I’d probably dress as provocatively as I cared to. Cuz it’s only ever when I’m passing by dudes that I question my outfits. I feel their criticism and their shame and their greed and it makes me feel gross. Without dudes I would feel far more free to present myself as my full sensual self because I would feel way less creeped on and I would feel way less prayed on.", "dreabeaa": "Ummmmm I’d exsist and perhaps I would be able to win my way through society based on my intellect and skill while wearing my hoodie and sweats instead of being objectified and ignored ....um regardless of my choice of dress. Hard to know though after today’s SC decision tho 🤮", "sassy_otter": "I would \"were\" less clothes and I would leave my house much more often because I would feel safer without \"duded\" in the world.", "babymooses": "Lol I would be nude at every opportunity, me and all the ladies would have respectful and loving physical relationships (sexual or platonic), there would be little to fear and much more to celebrate 👭👭👭👭👭", "captured_heartsinging": "I would just be naked 90% of the time except for decoration and warmth", "scorpio.tale": "i would feel safe to be naked and natural", "_.saintclair._": "I dress pretty stereotypically feminine and wear makeup and heels and I am happily married and legit don’t want men to talk to me, so no, I definitely don’t dress the way I do for men. 😂 If there were no men in the world I would dress more scantily and feel safe while doing so. Sun’s out titties out would be my motto.", "daniobuckley": "Honestly, if there were no men I am pretty sure I’d never put clothes on.", "ernibrph": "What the hell does this mean haha... if there were no “duded” to exert sexual tension on I would be a Queer Femme in peace and actually enjoy my sexuality", "_leavebrittanyalone_": "In a world without “duded” I would never “were” clothes", "raydawn1300": "Haaa fed Love! Yep I meant love it all... and that duded thou$$$$$", "nik_vicious": "I'd probably be topless in public a lot, tbh.", "soultripp": "OMG... I’M DYING!!! 😂", "_michelleyeager": "I say leave his name there so he can share with everyone what he has to say.. so ridiculous 🙄 and I agree I would be naked all the time then.. thanks for this powerful work you do @evyan.whitney 🙏🏾❤️", "samaraelise_": "I'd walk down the street alone after dark.", "squidsteeth": "I would wear MUCH CRAZIER SHIT if I didn't have to worry about fucking \"duded\" being weird as fuck and following me around the grocery store. I could go back to wearing thigh high socks without getting constantly harassed. I fucking miss thigh highs.", "sal.talon": "Seriously would post sexy selfies and dress like it’s Halloween every damn day.", "vortexglitter": "#becoolstayinschool", "veronica.avo": "😂 I think we would all spend way less time explaining simple shit to “duded,” that’s for sure.", "natali.nicole": "If men weren’t around I’d happily be naked or near it most of the time", "fenyxthegod": "Royal asshat 😭😭🙌🏽🙌🏽 getteem Queen", "p33ch": "If there were no “duded” I wouldn’t feel the need to “were” anything at all. And so what if I want to “were” my hoodie and sweat pants?! Sometimes it’s cold!", "mary.kathryn.davis": "If there was no duded I’d be able to walk home from work without being scared for my life. Sweatpants or naked life would be 100% great.", "amberaleida2": "You did well deciphering that....makes zero sense", "vsherself": "I’d never wear a bra again. I only do so to feel feminine because men don’t like flat-chested women. I’d walk alone at night. I’d make more money. I could get permanent birth control without people wondering how I’ll ever find a husband. I could simply be without the constant anxiety of the male gaze hovering like a shadow.", "nakedas_a_bleujaie": "When I dress sexy I dress for ME first and my man 2nd..PERIOD if I feel like looking bomb as fuck ima look bomb as fuck for me.. why do men always think we dress a certain way for them???? Uhm we do it for US first PERIOD and really only because any attention we get from you that we desire is a bonus for US so please have several seats sir!", "doing_me_drea": "Lace panties and half shirts because I could be free and not stereo tuped and victimized by men", "christina_withach": "Everything about his is so hilarious! I’m not sure what to make of it. If this is a serious question or not. What’s wrong switch sweat pants and hoodies? I literally wore them yesterday to go the the woods. Really depends on the scenario. If there were no dudes I’d dress the same as I would if there were dudes. I feel like what he’s trying to say is women wouldn’t try to look pretty or dress up if there’s no dudes? Well that might be where we find ourselves and we’re trying to undo that socialization and have it be that how we dress is our own expression of love for ourselves not for anyone else. Sometimes not dressing up for me is a rebellion and then I’m reminded I’m only hurting myself because I actually do want to look good/be hairless/ have false lashesetc. I love those things and I can own that. Our bodies are for sure not for the objectification or benefit of men.", "cal__ley": "If there were no duded I prolly wouldn’t cry so much", "zimbabweenie_": "i'd literally wear whatever i want with no fear of being verbally harassed or physically assaulted because of it!!!!", "ceenariele_": "Can this person spellcheck?!", "daephine_": "I’d wear stripper heels all day ✨", "flanfloozled": "I’d flirt with women without a man coming over and thinking that my attraction to a woman is for him. I’d walk around outside at night. I’d wear whatever I want without a bra hahaha", "kyrakyrah": "I'd constantly be in lingerie without worry of creepy men thinking it's okay to touch and comment", "the_alphagail": "If there were no dudes I wouldn’t have to wear a hoodie or jacket over my gym clothes (even when it’s hot) bc I’m being verbally harassed on the street.", "witchingh0ur": "NO DUDED: TIDDIES OUT ALL DAY", "may.kuboresha": "And he assumes that all women are heterosexual😑", "thenotsoavgbermudian": "Naked moon walks on the beach. Naked naps under hibiscus trees. Naked Naked Naked. I love the sun on my skin and being nude without a care is wonderful", "virtuallybrooklen": "I'm wearing that skirt were my ass hangs out a lil bit!!!!!", "blissbridge": "If there were no “duded” I would feel fucking authentically and radically FREE... I would be so much more naked, raw and open. I would be in sexy underwear and boobies out all the time. I would harness my natural sexual body to share with myself, and the world... however... I feel kind of trapped of wanting to unleash my sensual beauty... but get ducking sick and tired of the sexualization and male gaze that comes into my skin when I am naked and free... it’s internalized patriarchy that keeps me from really freeing my sensual soul, and letting myself be outward in my appearance... this hit me deep... Ive got some reflection to do💫🔥❤️", "trish_collective": "I would go topless or nude at the beach more often!!! I would feel less embarrassed when I’m acting crazy and more supported and understood. I would wear costumes more often hehe. I would exude sensuality without fear and be flirty and sexy and fun and not be afraid of the reactions. I would feel more safe to go alone places and probably feel more sexy and free. I love to dress sexy but I wouldn’t have to worry", "erikaalsborn": "I love reading everyone’s comments! Isn’t fascinating how so many of us would feel safe to be sexual, sexy, naked and thriving - basically want men want us to be but at the same hassle and harass us for when we are, but not for their consumption. It’s the ultimate paradox and contradiction.", "ceragohellahard": "😂😂😂😂😂", "leothelionness000": "omg i would wear mesh all the time, go topless often, wear leotards with just thongs, my fashion would peak! i sometimes go to put on a fun outfit like this and change cause i think about the men who i have to see on public transportation/walking around/etc.", "vikistanleyhutchison": "I would be wearing gorgeous, flowing, goddessy dresses made of sheer, filmy, gauzy materials that feel amazing on my skin, and that I feel absolutely beautiful in, for nobody else but me. 🦊💕", "bewarethewendigo": "No dudes? I’d dress 10000x “sluttier.” Or just be naked ¯\\_(ツ)_/¯", "mylady_saywhat": "Yeah right, if there were no dudes you better believe that dress up parties would be a thing.", "fairylord": "I’m fucking laughing at this???? What?????", "themichellemarie": "I’m married to a male but I still 99% get dressed nice for the women in my life. We appreciate each other’s skill in fashion in a way men don’t care. So all women? I’d look like I was on a runway everyday. I’d probably wear wigs. Change my look everyday without a care in the world", "ciao.gina": "If there were no “duded” I’d just be naked and free all the damn time without worry or fear", "rockerscloset": "Lol @ whomstmanisthis", "drgabbyjorita": "Nudity would likely be an acceptable form of dress. #Freedom", "bodysoulwellness": "I would wear yoga pants and not worry about men staring at my ass. I would wear tight short shorts and also not worry. I wear these for my own pleasure and bc they make me feel good, NOT for the pleasure of men.", "kasindra": "I would were my confidence AS IS even if there were no “duded” in the world. Nude skin and all. We could all be nude babes together.", "cartoontheo": "I mean it’s not like lesbians don’t exist, but that’s irrelevant bc women can feel sexy without anyone egging them on (even if it’s other women)", "katiejeanbentley": "If there were no \"duded,\" I would finally take off my hoodies and sweat pants. I'd let my hair hang down, and my belly out. I'd stay out late, and stop avoiding the city.", "kfonsy": "I would be more sexual because I wouldn’t have to worry about narcissistic men, who don’t understand sexuality and and how it is different from sex, make every sexual or sensual thing I do about them.", "aquarianmoonwildchild": "@hallahlovejoy dying 😂love this.", "ivianabynum": "I’d definitely never wear a bra and I’d let them be wild and free without concern for bringing a “duded”’s attention!", "nadiabokody\nVerified": "Verified", "lauraleebenjamin": "Ugh dudeds are the worst", "deblowd": "Sometimes I’d wear sweatpants, sometimes I’d be naked. Sometimes I’d dress the way I do. I’d definitely wear more lace and sheer items cause they make me happy. But I often don’t in the world with men who see me as an object.", "radiantastrology": "Duded? I live for duded! 🤣🤣🤣. Keep shining siStar ✨💞", "innyvinny": "Does he mean “wear”? I’d wear the same thing I do now: whatever the hell I feel like wearing. Tf?", "lmarotta": "Well my fianceè is a gorgeous and stunning woman so I would continue to exert my sexual tensions right at her 😉🌈💗", "foryourtmi": "I would walk around wearing whatever I want at ANY and ALL hours of the damn day or night without fear for my health or safety.", "anahata_joy": "Probably develop a fruitful sex life where pregnancy wasn’t an issue, and style, liberation, safety, justice and sensuality reign. 🌟", "just.pamc": "I would never wear a bra, go out in sleeveless shirts, give up makeup, only wear sneakers, wear more tshirts, walk alone in the middle of the night", "zoeconrad": "@evyan.whitney I can’t even comprehend what he’s saying properly because the spelling and grammar are atrocious", "hanafinkatiemac": "If there were no “duded “ ... I wouldn’t lock my car I’d sleep naked with the windows open I’d jog at night in the woods I’d let my daughter wear “that”...", "them_and_me_": "I would go for those night time walks without a worry! And sweatpants and hoodies? Screw that! Who needs clothes if it were an all femme society 😍😍", "arielkashaceli": "😂😂😂😂 what a wise intelligent well loved young individual.", "shamamaally": "Walk around naked, meditate naked, wear anything I desire. Not worry about dudeds being wasted assholes, ever. Duded, needs a mommy, clearly wasn’t taught to spell or grammar.", "ouiemily": "I’m still confused wtf he was actually saying. Sounds like Duded’s brain nutted on itself.", "cee_jay_reaux": "Butt ass naked", "amantharosebeauty": "If there were no men on earth I think I'd be just fine going naked. 👑", "bydhiyanah": "Ngl life would be so much easier! I'd be able to pamper the heck out of myself and share that joy with friends, loved ones, and the world without having to manage anxieties, worries, fears or any ridiculous need to censor myself. I'd slather myself in aromatic oils and go naked or in sheer clothing all day✨", "misiantaylor": "If there were no dudes I'd walk around naked in goldleaf", "jessica_d.oliveira": "First of all, learn to spell... 😂", "lunarlamp": "I'd wear pretty dresses without feeling self conscious. And I'd get rid of all my bras lol", "yourgirlsylv": "If there were no “duded” in the world, I would feel much more liberated. I would exist in near or full nudity all the time", "laurenadeline": "cycle shirtless like all the dudes in my neighborhood do. #notfair", "yvesstlaurel": "Lmao. That's all I can say.", "sarahmarieliddle": "I still would live the same. My choice of dress, makeup, lingerie etc is entirely because it feels good. Because it’s me. For me. 💛🙏", "whitewillow.healing": "Oh this is too easy.....!😂", "criminal.subliminal": "I think i would dress the exact same. 2 extremes: frumpy skater dude and glittering high maintenance thot", "iamthestayathomie": "Following this same bullshit logic, I apparently wouldn’t have learned how to spell either....🙄", "appletreemama": "I’d go naked or wear cuter clothes. More makeup more often. I’d walk around smiling because it wouldn’t be taken as a fucking invitation to accost me, and I’d be able to sit in a park and read a book on a nice day without my head on a swivel for predators - oops, I’m sorry, FRIENDLY MEN WHO JUST WANT TO BE FRIENDLY. I’d go get a glass of wine in a bar by myself to watch the game.", "jaspercatlin": "Literally burn all my clothes and never look back", "melsbells__": "If there were no \"duded\", my life would more enriched, more enjoyable, more peaceful. I wouldn't have suffered the traumas I have faced over the course of my life at the hands of men. Traumas that still effect me on a daily basis, and that I'm still working through. If there were no \"duded\", I would feel even more free to express myself sexually/sensually, because the fear of unsolicited harassment by men wouldn't be a factor. Simply put, I would be a happier person.", "_starlit_": "I’d “were” whatever the fuck I wanted, take my clothes off when hot or anxiety attack, itch and adjust my boobs when I feel the need, swim naked, spread my knees as far as possible when sitting... “happy baby” yoga vibes.", "coffeespiritsandtarot": "Walk alone at night! Wear sexier clothes while out most often.", "missraquelrage": "I would be so much more free with my body if my tits hadn't been sexualized by older men since they developed. When I was 10..... I would wear tight shirts and v necks. I'd walk my dog at night in shorts and not pants. I would actually drink in public with my girlfriends. I probably wouldn't try and cover up with cardigans and wraps as often....I dont even know the full extent to how free Id be with out the dangerous and swxualizing Male gaze of society.", "xtmariebx": "🤣", "mag_pey_": "I would not wear shirts when it was hot. I would probably never wear a bra. I’d go out and dance naked in the rain when the mood struck me. And I’d do all of these things without feeling unsafe. I would probably miss p-in-v sex but, for the trade off of freedom!? I’d get over it.", "lelialionheart": "@lizaf15 yes we exist solely to sexually please men", "j.summerset": "I think I'd \"were\" more of what I wanted to wear instead of hoodies and sweatpants because there would be less dudes telling me I should cover up because I'm gross...", "stephvelzqz": "I would feel so much more comfortable to wear things I actually want to wear—Aka I would be able to leave my house without the fear of being objectified, catcalled, attacked. I would be so happy and carefree. I would feel so happy and proud of all the womxn and femmes in my life, not in my life, all of us that exist and want to feel safe. I would travel more by myself. Be able to walk around at night and be unafraid. Dance under the moon with my titties out etc etc etc. We would all be so FREE.", "breean_lorin": "No dudes?! That’s lit, I’m wearing whatever the fuck! Titties out, jeans, skirts, mesh, sweat pants. Won’t matter cuz we’re safe from the male gawking 🙌🏾", "rubydanger": "I would literally never \"were\" a bra lol", "rachel.slick": "I would wear super sheer tops and rouge my nipples so they show more. I'd walk out to my mailbox naked.", "chaya_labufff": "I’d be absolutely naked n natural like my feral animalistic ancestors before me", "rrramchild": "Oh my god, bless this. I would be full throttle naked the majority of the time, or at the very least, I would feel visually, aesthetically, sexually, sensually, intimately, mentally, and emotionally completely and totally free.", "vhitcious.marie": "haha! there were no \"duded\" id be comfortable and naked majority of the time", "cuore_amanda": "I don't appreciate picking apart someone's grammar because you don't like their feedback. Seems childish.", "katerinapower": "no more bras 🙌🏻", "cinnamonkitten01": "Definitely wear whatever I wanted and feel safe!", "esmebotanicals": "I'd probably feel a lot fucking safer walking alone at night without the \"duded\"", "moremiadetunji": "Lmfao if there were no ‘duded’ I wouldn’t wear anything at all goddamit", "these_wild_hearts_": "I would most likely be naked", "cocoazafreen": "i would be a lot more comfortable experimenting with looks that showed more of my shape and body. i get stressed by unwanted commentary from the dudeds. it 💯 is not for them", "the_vspot": "@the.daughter.of.wands wowwww so much same", "nicole_mousley": "😂 His post is barely legible. Poor troll is hungry. I was told not to feed the animals at the zoo. It's so tempting though. 🙄", "samanthasheabutter": "Naked forever", "jsherrodd": "I would walk around fucking naked.", "andreamatellian": "I’d probably go naked all the time", "flexitarianfam": "I would be able to go anywhere I wanted alone at any time of night or day, I would likely dress cuter knowing I wouldn’t have to worry about unwanted male attention, I’d be able to let my 13 yo walk to and from the store a block away by herself if there were no “duded”.", "nocreativename__": "I’d be able to walk at night without worries! Hell even the daytime.", "wishcandy": "If there were no duded, I prolly would just walk around tiddies out. Or at least sheer tops. Holding hands with femmes in public, skipping down sidewalks. Travel more often on my own. Camp alone. Etc.", "saltoftheearthwellness": "Walk around nyc totally naked!", "icanhazpie": "My brAin cells have left me 🧠 what did I just read", "flyying.foxx": "I want to leave an answer, but all I got is 😂😂😂😂😂, and maybe that’s the right answer, because that’s probably what I’d do first. I’d laugh until I cry.", "alexandraebihara": "I’m still wondering how you actually deciphered what he was talking about. It should be a rule that you are only allowed to try to speak if you can form complete sentences.", "rara.raves": "Oh dude I'd be naked all the time.", "carolinebauermusic": "I would spend more time alone in nature without fear, I’d spend more time alone at night without fear, I’d wear whatever I wanted without fear. I’d probably stop worrying about my nipples showing when it’s cold out.", "kalonnoor": "I would be naked 🤷🏻‍♀️😹", "dustyhirsch": "I looove you! I would wear what I've been wearing but probably higher quality versions cause me and the ladies making them would be paid better!", "lunagoddessluna_": "Live in complete and utter peace 💕", "ellensbowles": "Walk around naked with no concerns, make the money I rightly deserve for the work I produce, not have to worry about anyone dictating my rights. Basically thrive lol"}