{"tamrah.blooming": "new year, new transitions.", "hmslee": "I feel this so much. You are not at all alone on this.", "bouzsani": "❤❤❤❤", "venusian_desire": "♡♡♡", "paulafotografia_barcelona": "Thanks for sharing this. 💕✨", "herbnerdmonica": "2016 kick my ass 2017 I just want my sanity back. I get it.", "fleurdupaix": "I follow because the words that follow the photos. Always thought provoking. Having said that, this is a beautiful photo of you!", "becomepurposeful": "I love how honest and genuine you are. The followers who stick around are following for the right reasons. Keep being you.", "tianaalderson": "Thank you for the reality check.", "scrimshawrocketstove": "It is easy to imagine that the lives of online bloggers are perfect and so much better than mundane life. A lot of people take advantage of this, and say, yes I am perfect, pay me and I will teach you how! But you are doing something different. You are being real and creating space for more people to be real and honest too. That is work I can get behind. I support your authenticity.", "n3vlynnn": "Hi @evyan.whitney . I'm going thru a lot in life so im a bit too exhausted to explain details (see link in my bio) but i want to let u know I really relate to this. A lot. Esp. With the online persona. Commitment to authenticity is so important. Also relating on the sexuality lull piece vs how im perceived by others. Thanx for sharing💓", "theholykozmickaliflower": "Things aren't always as they seem online. I myself have been in the driest spell of my life: not much productivity, no sex or orgasms, and honestly, fuck what other people thing. Hang in there. You'll be fine, beautiful! 💕🦄💜", "deliciouslyvibrant": "@evyan.whitney YES! That was it! I remember I used to looove your writing glad to see you continued to evolve 😊💪🏽", "evyan.whitney": "I love all of you.", "cuccia.co": "❤️", "catbeyond": "It's a confusing world, being on IG in a certain way that accentuates any part of yourself. I think because I promote positive expression, people think I'm bubbly and happy all the time, when it is because of my depression and anxiety that I work so hard on mindset and selflove. And yes, the people here for sexy selfies have made me very nervous to be as open as I was when I started. I dont like how closed it makes me feel to have eyes on my that I don't want on me, instead of just the eyes i do.", "camille_rose11": "I love this! I believe your reflections and new definement are in tune with your sexuality. Its true intimacy with yourself..... You sharing it with us, is you expressing/revealing/opening your intimate self with us. I believe its all part of nakedness, openess intimacy, stimulation, penetration, ejaculation and sexuality. Anyone who needs to be here flowing with you, will BE Soul Sister :-)", "squeaksbaby7463": "Honesty and authenticity IS sexy to some of us..to some of is...it's what really matters...Thank you...", "lovingisliving104": "Thanks for sharing parts of your world with us 💕", "lesphinx777": "I follow you because you inspire self love and confidence 💚🙏🏻💚", "murda.themommy": "I love your honesty. New fan.", "vcmasterminds": "I feel you on all of this so much. Love to you sister 💗", "femme.rising": "This resonates so strongly 🖤", "gracedurling": "This is so great! I love your honesty and think it's so brave of you to write to like this, thank you for your wisdom ❤", "brandybrowner": "I've been following you for a long ass time. The sexy selfies were never my thing. I never commented about it because I let people be who they are at a particular point in time cause that's what I need. The thing with taking up space and why I choose not to is that as soon as you take up space people intrude on it. There you are being yourself and here comes someone asking whatcha doing? Or why? Or touching you. Or giving a backhanded compliment. I can go on and on. This is your IG account post what & when you want. Rant too cause I just did and it's not my account.", "marikanicolelove": "L O V E 🌟big🌟\"we are 31 flavors, and then some.\"", "innyvinny": "All I ever ask is that you be yourself in all spaces. Love you!", "betheloveyouare": "just be you @evyan.whitney 💚", "brownsugahealing": "🌷", "doodlinducky": "I think when your life is in a place of quiet and routine it can sometimes indicate that you're on the right path. Change can feel exciting and chaotic but quiet is fluid feels like the reward of growth to me.", "hydee.moonchild": "Sexy selfies or not, you're awesome anyway girrrrl! Definitely have opened my eyes in the realm of sacred sexuality. Being raw seems to be so rare...you still have much to teach and we all have much to learn #willcontinuetofollowthankyou", "slutist": "Thank you for this! So relatable and so appreciate all that you do 💓", "the_yoni_empire": "@evyan.whitney real, raw, honest on so many levels. I feel you. ❤️", "adjoayayra": "I got you homie, all day 💕", "itstrentyall": "ThNk you for this beautifully, honest post and your beautifully, honest self ❤", "molliejmartin": "This is what I'm here for, the authenticity.", "drena_simmo": "You are making lots of sense! You are an inspiration.", "megs_murphy": "My favorite post. I really appreciate your voice and blog. Thanks for being you and sharing w us.", "junimondig": "Though I can't deny the sexy selfies got you my attention I stayed for the captions underneath :)", "bodysoulwellness": "Makes perfect sense. You don't need to be anything other than who you are ☺", "breeonekawa": "It's the beautiful truth you speak that I follow you for, you make me feel like it's okay to be a woman in her own skin. You're the kind of person I needed to look up to when I was younger, before the world destroyed my view of myself. Keep being yourself and speaking your truth and your real followers will stick with you. Love and light girl xx", "janea.dee": "sending you much love and light boo! ✨💖✨💖✨", "chriss_curry": "❤ take your time", "alyshalight": "I'm here because I enjoy your writing; it's nice to see a black woman speak openly about sexuality. Also, you have awesome hair and good taste in music. ❤", "madelinemcvay": "Here for the positivity and critical self expression. Do whatever supports you. ✨💕", "close_knit": "Yes to all of this. All of you. It's all we can promise to anyone ever. It's why, for me, I started posting dance videos, because even tho I'm a \"knitter\", I couldn't knit for a long while, I didn't have any juice in me for it, but dancing picked me up and flowed thru me and so that's what I started posting. we've never promised anyone on here anything, just to show up as ourselves, whatever that looks like 💙💙💙 thanks for posting this", "ava_luz": "THANK YOU for this! ❤️", "sitting_pretty": "💕", "diana.lacounte": "Here for you, not just the selfies", "ashaesundara": "You're perfect in all of you.", "maji_nation": "You're being Sis. And for yourself. That is enough. 💕✨", "tarrinloves": "I'm here for authenticity, rawness, realness and the inspiration to be all those things in my own life. Do you. 💜", "dteapriestess": "I was here before the sexy because I love hearing women of color sharing their truths. And I want to support that any way I can. I appreciate you sharing whatever the hell you want to in your house!", "reakeii": "No expectations, stay true to your honest expression. I follow you for your beauty and words of wisdom and I definitely resonate with feeling at odds with posting on ig. Wishing you all the best this coming year and beyond 💛✨", "allisonmucherino": "I'm always so grateful for your truth - exposing ALL the ways we are told to be quiet and small. Your courage and authenticity is inspiring and hopeful ❤", "laserdick": "i follow you because you inspire me to broaden myself and be open - open - open, which is something i really want ❤", "just_ally1": "Definitely here for you, even the boring mundane side, I think that side is also underrepresented especially on social media. Keep shining your light, your wildness, your authenticity. You inspire me.", "savagesophia": "#truth - I feel you - 🙌🏻", "mkepnasty": "This makes so much sense, and I too go through this in both real and online life. Just started following you this week, and I definitely will continue to 🌸", "sophiaalecci": "I follow you because of your rawness. You have a bravery that I admire, you put yourself out there, and people will admire and people will hate. But you are still you. Your words always hold meaning. The sexiest thing of all is that you're YOU. and as one of your many little Instagram followers, I appreciate you.", "juliaoftheflowers": "I love everything you post! Sexy selfies or not. You are beautiful, creative, and unusual... I love to follow women living their own truth. So keep doing that and I'm all yours! 💋", "siren14369": "It makes sense. I get the same thing when I talk to the women in my circle. How can ppl be so simple minded when they approach you? But then again I have been following you since the apricot tea days and I simply know better.", "_bex23": "Do you love! I'll still be here. 💞 like @julia.kg8 said. You're dope!!", "stephcowling": "celebrating your authentic self expression @evyan.whitney!", "unclesweaters": "I see you I hear you and social media is weird. Sending you support and gratitude for everything you are and everything you post.", "carlydactyl": "- In appreciation, ❤️", "bribraggs": "Always gracious for your authenticity. 💕✨", "beauty_grooming_intelligence": "Sometimes sexiness relied upon nothingness. It's because its a feeling; not a doing. People just don't get it!", "tashacwt": "I see you babe. Thanks for being you. Just the way you are. Always. Xoxoxoxoxo", "josephine_jardine": "I absolutely honor this and respect this. 🙌 we gotta navigate social media- it's a weird thing to do. But whenever I post pictures/text similar to this it feels good. Good to put myself straight, and put Instagram straight.", "rachaelmaddox": "Love you all ways always.", "yasminecheyenne": "Makes complete sense. The perception of sexuality (especially with women) is so interesting. Stay curious, stay authentic, + I for one follow you for your freedom of expression - regardless of sexual content. Love to you. 💛", "islandirie": "Much ❤️ to you!", "cricket3": "❤️ such an authentic , beautiful woman", "eva_teja": "Thank you!", "thats_____life_____": "relating to this hard. thank you for sharing 💜", "rickitickitaffy": "Guuuuuurrrlllaaah, I have been following you since I think you were Vintage Tea? And I think that was fashion based. The point is, for those who see you they see you for who you were, are and will become. You're the bomb. @evyan.whitney", "warmly.stephanie_": "❤ Do you boo. You're far more than just a sexy selfie❤", "julianal__": "You're sweet and I'm here for it", "tishushu": "I hear you.", "aaaashleyhook": "I have been an online follower for many years & it's your commitment to your own truth and your own personal exploration of your authenticity that intrigues me the most. it's so inspiring & I hope no one else makes you feel like you have to hide any aspect of yourself because it's not \"all true all the time.\" we are all just learning and growing as we go along 😘", "niiiagara": "I support everything thing you do! I think that sexuality it's not only sexy esa or sex... been a person it's sexual! So, your journey it's amaizing! ☺️☺️☺️go on! ✨💛"}