{"stenck": "Wow. Speechless, I’m so grateful for you. Thank you for sharing.", "jamiebee143": "THANK YOU SO MUCH FOR BEING HERE!! and......thank you for \".....female nipples are more policed & regulated on social media platforms than hate speech &racist rhetoric...\" I am so excited for the next new upcoming social media platform that makes I.G. a big fat f-cking yawn!!!!Not sure what or who but they are out there and will succeed!! 😎✌🏽 ( • Y •) #freedom #stopcontrol #iam #borninthe60s #femalesunited #freethenipp #loveistheanswer", "iam_gary.b": "Liberal beauty", "plantifulsoul": "thank you. 🖤", "thepleasureguide": "Yesssssssssss", "socialmediasucks_______": "this is a load of crap. leading a bunch of women even farther astray", "yasha104": "I appreciate and respect your work!", "jeevansingh.co": "Yessss 💛💛", "isiahmckimmie.sexologist": "Perfectly said. 👏👏👏❤️❤️❤️", "herbal.amber": "♥️♥️♥️", "1390photo": "Fuck yessss", "bantu__za": "Beautiful🌻", "lovewithsialo": "Thankyou thankyou thankyou. Your page is my go to when i am triggered into remembering that society still expects me to conform to being a object for male sexual gratification. Your words hold me up and remind me that I am allowed to be sexual and to express myself sexually WITHOUT being an object. My anger when I forget to honour myself because of a lifetime of conditioning telling me that my purpose is to get men off feels met and welcome here. Thankyou for creating space for all of us to feel that. And to explore what it means to be a Sexual being in a world of pain and expectations. 😔💖", "ana_____italiangurl_23": "live for challenge and so man y tears wish to cofidence queen , and how say and connection and spirtuallty and fasicm thank for transparent queen", "kenziemaejohnson": "@caitlineeeeeethomas", "seatom": "🙏", "the_tiger_poet": "Show 'em! 🔥💞", "hendrikbirke": "Wonderful 🌹", "bekahhearsawho": "@jess_rushworth this woman is power🤩", "k_spot_therapy": "I love it!!! You’ve inspired me to start taking sensual selfies (more often)!", "artworkbeautifulsimplicity": "🙌🏽❤️", "_lappeldu.vide": "You have truly inspired me in many ways. I’m so happy to have found your page ❤️", "_kailopes": "@eduardacavadas", "chrisbond00": "inspiring", "fiammaleotti": "🙏🍑✨", "itszoko": "✨👌❤️", "ddfg13": "Simply yes...🙏🔥", "mraybaybay": "Really really enjoy your words. I appreciate what you're doing for me and so many others. ❤️", "straubm": "👏🏼🙌🏼👏🏼✨💕✨ this is gold & fire. thank you for sharing.", "mymediastyle": "Such important work you’re doing. Continue to stand in your power-you are supported at every step! Thank you for how you are showing up for all women!", "cassidyrobinett": "@jerynn._", "simranshakti": "Boooom shakalaka. My heart was racing as I read this. Way to put soul much into words and expression. Thank You for paving The Way Ma!!!", "coalandcanary": "👏🏼👏🏼👏🏼", "not_just_a_pretty_face_777": "Yassssss 👏🏽👏🏽👏🏽", "burgundyfoxco": "Love. Thank you. ❤️", "snarlywolf": "Thank you❤️", "artbyselfie": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "memegalarce": "I’m so glad to find your IG", "loulabell_27": "@unapologeticallyali thought you might like this :) 😘", "emotion.l.contagion": "🙌💜👏You live the truth. Keep singing it out as long as you can. This policy is frightening. Just another way our rights are being infringed upon by this ridiculous corporate policing which will absolutely lead to greater policing of women/queer rights in general. These corporations own so many politicians and with the issue of personhood trying to overturn roe.v.wade EVERY sign that our sexual liberation is trying to be demonized should deeply disturb us. The only perversion is our liberty. Such a joke with the global fascist trend emerging is BECAUSE of facebooks ridiculous laxity of allowing hate groups, espionage, targeted fake news, live stream murders, and naturally the horrendous political consequences that have pushed us to here.", "chaisface": "🥳😇🥰👏🏼", "diaspoura": "Fk Facebook :(", "huitzilopochtli0": "❤️", "freebody_soulsister": "It is crazy...they blocking old post that I long forget about not even revealing just a silloute of my body smh", "svettel456": "@tinkiewinkiee16 @wings.with.thorns", "hgrabes": "Amazing 🙏🏼❤️", "ig2109": "👍", "courtney.smellink": "❤️", "toranmcgill": "This is an amazing photo! I continue to honor you and the fantastic much needed work you do.", "_stacy.bailey_": "👏👏👏👏👏 get it!", "thejessica_j": "👏🏾👏🏾👏🏾🙌🏽", "martixana": "💓", "deva_style": "This is so necessary", "kristinakerley": "Thank you for sharing your light and magic in this world, it is so valued and appreciated! 🧡✨", "jamiemmc": "♥️ food for thought", "oreganobby": "❤️💕💗", "dirty.sacred.radiance": "You are so clear and strong and I see the bridges your words create between those who ‘get it’ and those who don’t know there’s something to get", "oellamcclain": "Beautifully written manifesto! 🙌🔥", "claire.moon.dance": "Yes a million times❤️", "jamiepsmithpdx": "I appreciate what you're doing so much❤️🙏🏼💕", "kalisyaphae": "This post is EVERYTHING 🔥🙏💕💕", "lior_vibe_feeler_art": "Beautiful, beautiful picture 👏👏👏", "thalia.y.kleckin": "Yes 💖💖💖", "driadiamond": "@nzilamusic", "liorakelley": "💖✨💫💞 yes taking our power back, embracing and loving ourselves in every way ✨💖💫💞🙌", "andreacwood": "Yes Yes Yes", "eroticapoetica": "Very powerful, awesome", "haelwilson": "Yes. This 🌸 incredible words for all of thisssss", "lauravolpintesta": "Thank you for sharing!", "bakuuchan": "Thought you would like this @savvylobster", "northernbelle74": "Thank you for this articulation of some important concepts.", "lenore_mcrae": "🌈❤️❤️🌈 @_.leshachikha._", "fannyhenningsen": "I could cry!! 😭🌹🌹❤️❤️", "klepenio": "🔥🔥🔥🙌 preach lady!", "kaitlynmitchee": "Love this 🙌🏼❤️", "isi.smith": "@bethch", "zenn.nai": "♥️♥️♥️", "dianamarceil": "Are we getting banned for talking about sex now?? Please tell me no.", "kristinannehm": "I love this 💜💜", "theonevan3ssa": "❤", "msjennifertharp": "Thank you for being your authentic self in the world and encouraging us to do the same. Your self care, self respect, and confidence are inspiring and important to see.", "driavio": "Thank you💜", "steph.kiki": "Wow thank you for this enlightenment. Beautiful way to describe your sensual selfies, we need more humans like you 🙌🏾👏🏽", "shannonlee.doula": "❤🙌🙌", "rosalie.amber.grace": "@birdstheworld", "nevernotdreaming_": "👏👏👏", "idreamofy0gini": "Wow! So true. Everyday I tone down my sexy side and stop myself from posting or expressing anything that might be seen as suggestive, even if I don't see it that way. Very empowering messege here.", "noryandfely": "💛🙌🏾👏🏾", "raydawn1300": "🔥🙏❤️#word 💯times a million thanks u xo", "niematulai": "Love what your doing! Please keep it up, I am definitely looking to you for more inspiration on this space 💗", "laurenadeline": "Thank you for the work you do. ✨ More appreciated here than I can put into works atm. 💜", "etmafrance": "🖤", "plasticxcandy": "🔥🔥", "cuccia.co": "Adore you 🌹", "roseywinter": "👏🏻👏🏻👏🏻👏🏻👏🏻", "monicavcao": "🙏 Always love what you have to say", "lotuscomplex": "thank you for sharing and modeling what sexual liberation looks like. ✨ Will you be hosting this challenge again?", "love.spirit.wellness": "Beautiful photo and beautiful message. Much love ❤️", "robelyfe831": "Social media being corporate = fascism... You are an inspiration and your words will bring change. Bless you ❤️❤️❤️", "lattaannie": "@witchybitch_kat", "che.che.luna": "So many tears. ❤️", "shamelesssexpodcast": "We 💜 this 🙌🏽", "ariaintrepid": "👏🏽❤️🙌🏾", "the_vibrant_hak": "🙌🏻💖", "baby_veronimal": "👏👏👏", "haley.marie.bhakti": "👏🏼👏🏼😍", "tinsleytj": "Does the face roller really work?", "luisaldana90": "\"The revolution wont be televised\"", "mollonwarriorprincess": "These words 💕 I am so grateful I found you. Your work is so important. Thank you.", "megtrev": "💗 sensual is right!", "maggieneer": "Good job sister! Keep it up, you're amazing, thanks to women like you females are being empowered 💪❤️", "wellsoulwellness": "No social media or other platform will stop you/us from reclaiming and liberating our sensuality and s-xuality. 💖", "chiarapr_": "I didn’t even know how much i needed this. I finally know how to explain myself whenever someone asks me why i do it. Not because i owe them an explanation but... this is such a beautiful way to put it. Thank you 💜", "_s0ulrebel": "🙌🏾", "luxefatale": "👏👏👏👏thank you for your words", "karla_rebirth_": "❤️", "tammakastaley": "Thanks so much for this fam. @evyan.whitney I needed to see this. Been trying to write my s-xual health/s-x liberation poem for some months now and I think this sensical selfie challenge may just be what I need to push me forward❤️✨", "juicykiwifruit": "🙌🏻🙌🏻🙌🏻", "carolinebauermusic": "🔥🙏🔥 yes!", "pizza.hat.guy": "Thank you for the important work you do.💖", "jazminelovine": "🌻 rhank you.", "xojessicatorres": "The caption, THANK YOU.", "carolinemoira": "I love this ❤️ taking ownership our bodies is so important. And this composition is really elegant.", "babymamijaz": "🙌🙌🙌🙌", "karettafnfowler": "💖❤️🧡💛💚💙💜 Much Love 🙌🏼", "therealmrsmoore": "Beautiful, and inspiring.", "danicayoga": "This photo (and everything you said) is incredible! Love love love ✨❤️", "oncewasaredelf": "🙌", "flyying.foxx": "Oh I love your s*nsual selfie challenge. Hoping they leave you and your incredible work alone. ✨", "annaxzhu": "Yes to everything 🔥🔥🔥🔥", "glance_gr": "Hot pic 😃😃", "karmacamelia": "Thank you for leading the way! 💕💕💕", "carolinewimberly": "😍", "gadjaroshen": "Bravo!", "sorbodebrisa": "💘", "museinthemaking": "🙌🏽✨💖", "awakeninganahata": "Wow... ✨ your beauty resounds and surpasses your physical presence, by far.... the way you appear to face challenges is that of a warrior... you ARE beauty.", "alexandriathibodeaux": "You ooze peaceful power :)", "heartriverart": "You’re so amazing and inspiring ❤️", "taraamackey\nVerified": "Verified", "diabay": "You’re a stunner powerful goddess 💕", "onhermat": "❤️❤️", "saxonymarie": "Please forever power on. Your voice and images speak wisdom and freedom.", "shshiams": "You are much much beyond inspirational.. as an 18 year old, your words speak to me and help me through this journey is gaining myself back as a women. Thank you❤️", "stoic.sol": "nicely said, tan bella✨"}