{"dgc_girl": "You are amazing ❣️✨", "cpucpucpu1": "Amazing natural beauty 😍😍 😍 Joe @evyan.whitney", "bishop2718": "Natural Beauty🎆", "kimtasticbush": "The most free doing kundalini yoga. The least free, being around religious people, Christianity triggers me.", "hippiehoodlum__": "Work definitely stresses me and makes me feel boxed in, however when I’m with my plants, gardening, or enjoying my children I feel the most relaxed or free", "_many_moons": "Lying in my hammock by the river.", "emily_katz\nVerified": "Verified", "itstracyg\nVerified": "Verified", "lydiahenriettao": "i feel most free when writing or performing my poetry; all the parts of me engage with each other! also when dancing to music that moves me & laughing at the top of my voice 🌹", "ashantidoll": "When its raining and cloudy I feel so free. I feel my life is better. I feel like my problems get washed away. I feel connected to the earth spiritually. I feel sex more. I feel passion more. I want to die in the rain. Im obsessed with the freedom it brings me.🌧🌧🌧🌧🌧🌩🌩🌩🌩🌩", "wishcandy": "I am free when I travel. I’m restless and moving across the land, brings a sense of wonder and calm. Even just exploring a new section of a neighboring town helps.", "uniquewellnessnutrition": "Very good questions I have no immediate answers for. I will ponder 🙏🏼💕", "kaydee_puff": "Thank you. This is so helpful 😭", "livelimitlessly": "🔥🖤🔥", "marissamaryxo": "You’re beautiful and fearless. You’re in touch with yourself and you’re unapologetic and free. You’re everything I aspire to be.", "evaaveaveevaevaaveaveeva": "@hansjeveen tekst is mooi maar de reacties ook!", "siriilarsen": "@warinthon_luvly", "aresilientalmond": "@anovelpearl", "megrabe": "@jraewll", "patillamarina": "@alicia_db", "trinacaryphotography": "Do you live in nyc?", "nicoechler": "🤢", "clara_mlr__": "❤️", "elena_kielelani": "Girl you are so beautiful and you inspire me 😍😍🔥🔥🔥", "tiafatale79": "I feel most free when I paint and least free when im in a relationship...", "galadrielle.vf": "Most free when I am in nature just enjoying the beauty around me and listening to the sounds of nature , also tbh when I make love with my boyfriend it is really something I can not explain but it is quite magic Least free basically when I am outside in public areas with a lot of people , afraid of the looks, uncomfortable in subways, supermarkets etc, also in big family reunions tbh", "cquinnceyoga": "I feel the most free and calm during a meditation or asana yoga practice. I am able to get out of my head and connect with my body and ground myself into Mother Earth. I feel the most restricted when in a stressful situation with people whom I know do not have my back (one of my work places). I am trying to work on my goals so I can leave said toxic environment and pursue my dreams of teaching yoga and nutrition! 🙌✨🙏💕", "lu_minous": "Swoon", "theweeniewaggin": "@linseedoilz", "carmenomonoxide": "Thank you for this beautiful prompt. I feel the most free when I'm stretching and listening to the beautiful tropical birds and feeling the steamy air in my back yard early in the morning. I've also started a new semi-secret ritual of blasting guilty pleasure music and dancing around the workshop when I'm using a paint sprayer. 😂 I feel the least free when I don't listen to my body, and force it to work without enough sleep or in uncomfortable shoes. And when I look at myself through a lense of judgement that I project others are feeling.", "iyanuuu_": "This sounds like some post- Us movie reflections 😂", "stella_joi": "When my hair is blue, the sun is on my face and the wind is in my hair. ❤️", "sabra_kaaibich": "💝", "botanical_hollow": "When the earth is nice and warm I like to let my hair down and walk barefoot. Nice and simple doesn’t have to be complicated", "_thehumankind": "Most free: lying naked on my bed and writing, dancing or stretching, freely living trusting what feels right and expressing whatever I feel, loving what I love. Most not free: not saying something because I’m worried of people’s judgment/ worrying about judgment before checking in on what actually feels right to me.", "mraybaybay": "Thank you for sharing such loveliness. My honest answer to this was the last time I took a sick day a few weeks ago. I should have taken said day off about 3 days earlier... Anywho, I finally sat, in my underwear, on my couch, with my dog and a blanket, looking out my window at the clouds, listening to ABBA (hell yes) for about 30 uninterrupted minutes, and I just started crying. Real, REAL crying. Like my body finally thanking me for chilling the F out. Feeling necessary again soon. Thank you for reminding me to lean into these feelings. ❤️", "kimlosetheweight": "Most free: on vacation or like another commenter at the gym. During those times I feel the most relaxed and unencumbered and at times confident... least free: at work because I feel like I am not walking in my purpose (even though I am still trying to figure that out) and because like I am trying to mold into someone’s expectations of me", "katrinafaerie": "Thank you, perfect words", "voidm0ther": "When my bills are paid and my space is clean 💫", "mmaika3": "@hunterkillerlove journal prompts ✨", "iambellarayne": "Naked at home in my room practicing magick or studying. Least free is out in public with pants.....because people ab pants are restricting.", "brittofbridges": "@jessicadefauwe Mooie vragen", "soft.stone": "Naked, dancing in my room, or tripping on lsd ✨ so freeing", "reyakindness": "Yoga and animals", "beth.ajnayoga": "Most free: in nature. Least free: at my desk!", "a.c.tejeda": "I feel the most free when I’m surrounded by a good community of people that make me feel safe and full of expression. I feel most inhibited, self conscious and unlike myself when I feel isolated.", "hey.small.thing": "Love this!!!! It's really worthwhile questions to ask! I need to take some time to journal on this later", "marielwiley": "Definitely most free when I am alone or with a person I am close to in nature, just listening to the sound of birds or waves or wind in the leaves. I feel constrained in indoor spaces that aren’t comforting or aren’t designed with care & thought", "i_am_law_ra_love": "💖🙏🏻", "kocomeow": "Good reflection indeed👌🏾✨", "caterinaemilitas": "I recently felt the most free I’ve felt in my body (without thinking of how anyone perceived me etc.) when I went my first fetish night. I went dressed in my favorite lingerie set and I felt so beautiful and confident (which is so interesting because I normally feel anxious is MUCH more clothes than I was wearing lol). I felt at home dancing with myself and my friends and just letting my body move however it wanted to ✨ I realized that freedom is doing whatever “it” is for me ☺️", "annchrusty": "@evaaadps", "creesahidah": "👁 feel free when I am dancing, making love, singing, & creating art. 👁 do not feel free abiding to others expectations and rules  This is s beautiful photo love", "hercoloredworld": "I'll come back to these and I look forward to when I am able to. It's hard for me to admit I'm very emotional reading these. I can't remember the last time I didn't feel scared and and that in a whole is compromising every freedom I have or can feel.", "nat_silveria": "Liberated queen!!! I feel most free when I'm working out at the gym with my favorite songs playing in my earphones, sweating and feeling my body work hard, dancing a little between sets and not giving an ef if anyone is looking at me.", "asiasgrams": "Short version: I feel the most free when I am outside enjoying nature in the presence of my husband + daughter or listening to music with the lights low and candles all around me. I feel the least free when my time/ to do list is being dictated by others. When I’m not doing what I love with who I love.", "frutarrr": "I agree, this felt very emotional to read, because I feel so tense and suppressed in so many parts of my life, most of which are good. There's only one place/moment when i feel completely at ease (walking in the woods alone). I wish I could bring that same calmness and ease to everything, but there is so much tension circulating through my veins constantly. Thank you for this reminder; it's a good thing to stop and think about and take a breath.", "chaya_labufff": "On payday", "ebonyjanice": "(sighhhhh) Lemme think. I feel the most free when I’m genuinely choosing myself. Taking care of me. Present with me. I feel the least free when I’m worrying abt what people will think. Sheesh! A revelation! 😬😬😬😬😬😬😬😩💙", "downvalleychica": "wow how wonderful to have someone present to take your photo right when you are feeling the most free!", "isabella_bazzara": "Loving this 🌹", "mirin_mooney": "I like these ponderings.. I must come back to them"}