{"noturstroganoff": "Thank you for this", "yazminbradley": "@margaretbradley ❤️", "juliabloomquist": "Thanks for your openness again and again! You are an inspiration!", "mrs.freshcut": "Perfectly written! I can so relate to this, when I was younger my parents never approached to have “the “ conversation with me, I was never told or advised how to protect myself and how sex was supposed to work. Love this read! 🙌", "taberstockstill": "I just read the article again, to start my day. I have honesty never get more seen and understand. Your story hit my sexual history/life on the head. The other stories reminded me we are not alone. Imperative our society works on this.", "6andom421": "💕 yes I got that. 😘 that was my reflection/inspiration from your post.", "cafeconpansexual": "I grew up hella catholic && share a similar experience as you. Thank you for telling your story💖", "rachel.slick": "So very glad that my child’s middle school taught all of those concepts. What is consent. What is a healthy relationship. What is abuse, what is assault. How to say no. It’s a rare privilege these days to have a school like that.", "cydniemariee": "Thank you for telling this story. I can and I’m sure many other women can relate to this on a soul level. Thank you for speaking up. This is volume.", "darkbluespeed": "Wow - this is incredibly relevant/similar to my own experiences. Purity rings and masculine-driven sex narratives were all the sex ed I was allowed growing up. I’m happy we’ve found the education and autonomy we needed to blossom into the full versions of ourselves, sexuality included! 🙌🏻", "jiajfeng": "I’m so proud of you!!!", "tatianaewilson": "@usm2819 please just read this and consider.", "unicornfromplanetd": "🙏🏾🙏🏾🙏🏾🙏🏾😍❤️", "kingagetsherlife": "Wow, your story is so important!! Thanks for sharing", "melinatedmommy": "❤❤", "lifeofcatherina": "I am grateful for you and this page 😩😩 what I’ve been searching for @evyan.whitney", "vikkishandon": "You are so brave. Adore you and all that you share because it is so so so inspiring!!!!!!", "puddle_of_bludd": "I wore a purity ring and wrote a letter to my future husband in Sunday school pledging my virginity to him. My mom and I had a photo together in a frame that said true love waits and when I told her I had had sex with my bf she took the photo out of the frame and threw it away 💔😅", "cecil.fahrenheit": "This is so important!! Thank you for sharing!", "maryamajayi": "Was so amazing to meet you last weekend although briefly. You are a gift to us all 💖💖💖", "gyesenia___": "♥️", "hayleysdyer": "Awesome! So many of us are not taught comprehensive sex education. I’m still coming to terms with my adolescence and the lack of sex education I had growing up.", "thejuliemonroe": "Wow. I just now realized the same is true for me. My parents loved me (still love me) and they thought what they were doing was best. But I realized now that I had zero clue what consent was... wow. Thank you for sharing.", "ianawi": "yes 💯💯💯💯 👏 Consent even still a mystery \"nowadays\" (within last decade) ... once I had been dumped by a bf who was technically raping me while I slept, it took a lot of distance and therapy to admit that this cool evolved \"feminist\" dude was having non consensual sex with me. At the time when I told my best friend, she just laughed. This made it even more difficult to realize it was rape... its not rape its \"funny\" like a prank your bf plays while you sleep, right? like \"gotcha!\" Meanwhile, I'm no longer dating him and she's no longer by best friend. 🚫🚫🚫 also its crazy to think that your dad is the holder of your purity❓⁉️ gross❗christianity is so messed up I'll never understand how they got on that high horse when their shit just as crazy as any pagan story/belief. 🤷🏻‍♀️ #hailsatan 😈", "nitashajackson": "♥️♥️♥️", "baileymikell": "You are incredible. I’ve also been a long time follower & love seeing you share your work with the world! Thank you for what you do!", "ondermamasvleugels": "🙌🏾💜", "charisserhodes": "Totally agree.", "artistapriljay": "wowwww. been a follower since apricot tea... congrats on your feature it’s been so fun watching you bloom into your authenticity ❤️", "evolvedfemmehealing": "Preach sis!!!", "carolinegloverlmt": "Jesus Christ I'm glad purity contracts weren't introduced to my mother when i was younger, what a mess that would have created.", "mstoilj": "This is epic! Been following you since apricot tea days. Thank you for sharing your story and resources!", "motherm0on": "Beautiful ❤️ thanks for sharing love", "newstory.movement": "I. Agree. I had the exact same experience with religion and lack of education therein. So destructive, and I’ve had to learn how to establish my own boundaries within the context of sex and relationships by trial and error", "futuresjasmine\nVerified": "Verified", "livthedivvv": "Fucking preach mate.", "kenyakinyani": "i feeeel this!!", "emerywanders": "Love this because I was raised in purity culture too and it took me YEARS to have a healthy sexual relationship 🙌🏼", "un_becomingme": "me too ❤️ I even wore a purity ring. It has been a long, difficult, interesting (but ultimately rewarding!) journey to claim/reclaim my own sexuality. Thanks for sharing.", "shopuntamedflowers": "I’m happy for the shoot but the story is saddening and I can relate totally", "thereal_jeanee": "Yasssssss! Congrats! Love watching your journey for like forever. Keep pushing. Your authentic voice always inspire me.", "theorgasmiclifecoach": "And how about pleasure? Consent absolutely, and sex with a beloved = pleasurable for all parties 🥰", "kristenkorvette": "Cannot WAIT to read this. The work you’re doing is so incredibly powerful and necessary you’re amazing 🤩🙏💖", "mycookiehasnofortune": "I so appreciate this post. I experienced very similar in my marriage. No one talks about consent once you are in a committed relationship. And how does one have that conversation? How you can be emotionally, verbally & mentally abused/manipulated into “consent”.", "alliskaggs6": "@im.not.little ♥️", "catwrangle": "Beautifully written, thank you for sharing. Carrying this with me as I raise my daughters. 🙏🏼❤️", "the.yogi.dietitian": "@evyan.whitney we are paralleled in this way. Thank you for sharing 💜", "vm1897_": "This 🙌🏻", "the.light.mill": "This is so powerful! Thank you for sharing this 🙏🏻 xx", "kainthekayak": "You doing it girl! Thanks for sharing, so important👏🏾", "sophiaspallino": "Wow. Wow. Wow. #PREACH", "aliciasinclair": "Congrats on the feature. Well deserved!", "leahmarieschiros": "👏🏻👏🏻👏🏻👏🏻💪🏼💪🏼💪🏼💪🏼", "s.xuallectual": "Wow, thank you 💕", "andreacwood": "Yes! Yes! Yes! ❤️❤️❤️", "iammatildacarroll": "Wow thank you for approaching this topic it’s something Iv wanted to tackle and approach but never had the words to express that I felt ppl would “take well” you’ve done it so eloquently 🔥🙌🏼👑", "rosewayyoga": "💎💎💎💎", "rachelelizabethrd_": "@theantisocialsocialworker this is the sex doula I mentioned last night. I’ve been following her work for 5 years.", "sineadmreilly": "You are so inspiring! Thank you for sharing your story and your continuous teachings ❤️", "tantkaaitjie": "💓💓💓💓💓💓💓💓 thank you for this xxxxx", "goddesssteph92": "🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤🤤", "marybfalck": "SLAYYY my queen. Thank you for being such a powerful voice on this issue", "janashareswithyou": "This is major! Congratulations, Ev’Yan! 👏🏻", "caya_art": "LOVE this. Thank you for sharing this personal work. These educational, honest, supportive conversations are important to me, especially now having two early teens in my life 🌹❤👏", "other_surrealities": "What an amazing post😭😭😭😭😭", "tavithyme": "You are incredible 😍💖💐 so so proud of you, femme!!", "1.900.mandita": "Thanks for sharing your story. I was also in a sexually abusive relationship for years and I didn’t realize what was happening to me until I got out of it. You shining a light on this is so important. ✨✨✨✨", "mariannefaithfully": "I love this so much, so important.", "muva.gaia": "Yes girl! So proud of you 👏🏽👏🏽👏🏽", "renna.rose": "Thank you for sharing this!! This story has mirrors to my own and I’m grateful to read and be able to put it all together through your voice. ❤️", "theannnguyen": "YESSSS thank you for this share and you are such an amazing human. I love seeing you win! 👏🏽💕", "thecannabisdoula": "Yesssss! Shine Black girl!", "balloonsbypineapple": "@dancingstylist this lady is great and def one to read!", "dianamarceil": "SO IMPORTANT @evyan.whitney THANK YOU for talking about this! I say this SOOOO often about consent + assault in relationships. It's such a topic that is never discussed bc women just feel shame around it. Even outside of relationships this happens anytime a man pushes himself on a woman after she said no. This is RAPE and I'm tired of not acknowledging it by that. Call your rapists a rapist. If they tried to convince you or pressure you into sex when you said no, it was rape! Periodt! 💖🙏♀️", "darbyandersson": "Strong woman. So glad you have set yourself free✨", "hjones48": "As someone who also signed a purity contract and has radically shifted my thinking since, it’s so affirming to hear from others with a similar background. Thank you for sharing a bit of your story with us here.", "veghani": "this is exactly what i went through with my ex boyfriend when i was a freshman in high school. i didn’t realize it wasn’t consensual until i talked about it with my sister and she told me it was rape. and it felt like it ruined me because like you said!!!!! i loved him, so i thought that’s just how it goes when you love someone", "mburtb": "👌🏾", "styleand.sustain": "Wow what a story! You’ve turned into such a strength, well done, you’re a queeenn 💕✨💕✨", "marcialsart": "🙏🏿🙏🏿❤️❤️", "tj_ambitious": "💙💙💙", "tatti.x": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽✨🙏🏽💜", "kelstheyogi": "Thank you for sharing your story. I teach a class called Bedroom Manifesto for this very reason. We don’t share what is coercion, we don’t talk about healthy sex and healthy sexual habits. Can’t wait to read the full article. Being a sex educator is my favorite thing in the world!", "tahairy": "This is great!", "miso_honey": "🙏🏽 I wish I had the same conversations - I get so unprepared for sexuality. I made so many terrible decisions or let other make decisions for me.", "thefrohemian": "🙌🏽", "thelandofodd": "I’m 36 and still trying to shed the wounds of purity culture, doing better for my kids", "oolaloha": "All the love and support to you 💕 thank you for sharing this. I can relate and it’s so damn refreshing to see people leaving their shame behind and stepping into their power ✨", "notsafeformomgroup": "Yes!", "makeup.your.mind": "You're amazing wow 💖💖💖", "theresecator": "That’s amazing!!!! Congrats on the feature and above else spreading this message! 💖", "theamonyee": "🔥🔥🔥🔥🔥🔥 Come👏🏾Through👏🏾😍", "yogafairy1111": "Iconic. Can't wait to read this !!!", "jaxinlife": "Needed to read this 👏🏽", "momma_lasko": "This is important and amazing!", "saraclarkyoga": "Yessss!!!! If only there had been a healthy conversation in my house about the inevitable event. Thank you for your work. Glad to see more people will get to enjoy it ✨✨", "missmadisondaisy": "So much beauty and wisdom 🌻", "katebaby_1": "@emilyjoypoetry do you follow this page? I really like it and think you would, too!", "alisha_sommer": "👏🏾👏🏾👏🏾", "ourroamingroots": "My experience was similar. I still have the “purity” ring I was asked to wear. I remember having such feelings of guilt wearing that ring after my first sexual experience. Thank you for speaking on this issue. 💓", "itsamavee": "Thank you for sharing your vulnerability", "lauraaiisha": "Amazing!! 🦋🔥🦋", "clara.clear.bright": "Beautiful 💙", "catnalice": "Thank you! 💜💪", "kristen.arrow": "Yes👏", "megnavoy": "Such important topics. Also you look amazing 💓", "ceragohellahard": "amazing", "yourgirlsylv": "Thank you so much for this!", "soulpick": "🙏🏽🙏🏽🙏🏽", "jensotelo": "Wow this is amazing !!! 💕 and thank you so much for sharing", "issaliley": "Omg!! 😭😭😭Why are you so amazing?!?! This is such a big deal, from the topic to the photo shoot!!! Whaaaaa?!?! So proud!! 🌟", "shanboody\nVerified": "Verified", "emanimeansfaith": "💕💕💕💕💕💕", "christelle_studio\nVerified": "Verified", "connie.is.concetta": "@mtbee_ ❤️", "o.adaobi.o": "I had a very similar experience. Got my purity ring when I was 14. Made a promise to my whole family that I knew I wasn’t going to keep. But had no guidance on how to explore my sexuality in a safe way that would allow me to still love and respect myself. We need to start teaching kids about consent, self love and respect, and how to express our desires without fear or shame", "ericachidicohen\nVerified": "Verified", "adeola.naomi": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿💚💚💚💚", "menakirmani": "❤️", "extracelestial": "YESSSSSSS", "heather.louise.m": "Congratulations! You deserve all the recognition and platform highlights. 🎉 Also, ummm...can we talk about those jeans yr wearing?", "ashtonswinford": "♥️", "maria_krzeminska": "So good that you speak about this! Good for all of us! I hope especially that a lot of unexperienced young women read this, so that they can take it with them as wisdom in the future👌", "idreamofy0gini": "Same here. Im glad my parents didn't \"allow\" it, but I wish they would have explained a lot more. My friend's mom put her on birth control at 14, but I was definitely not ready for any kind of sex at that age. It would have totally messes me up. But she did get a full rundown early on about how to navigate safely through a sex life, which I didn't. When I did finally feel ready, i didnt fully understand consent and still ended up being begged and coerced into sexual activities. Would have been helpful to have clarity about that before being thrown into the dating/relating pool.", "rachel.cargle\nVerified": "Verified", "salty.world\nVerified": "Verified", "nabilasawakeningdream": "Thank you so much for this. It took for an assault to cause me PTSD before I realised a string of problematic encounters and relationships long before. I wish someone had said that sometimes it will be confusing. Sometimes it won’t be clear cut. I was even educated in a mental health and abuse context. But no one ever said these things to me. For my benefit. To learn exactly what consent means, to learn the grey areas. Thank you for posting this and for the work you do ❤️", "leatamae": "Thank you so much for sharing your stories! 💛", "rachel_plates": "Yes!! Thank you for this ❤️❤️❤️", "jeanetteleblanc": "This is fucking phenomenal. Damn!", "sippinhannah": "Yes to ALL of this. We have to do better when teaching the babies.", "tatiannatarot\nVerified": "Verified", "marg_cos": "💜💜💜", "alicerules": "😱✨❤️ Amazing 🌸🌈", "estrellajrios": "Amazing share 💥 so good to meet you last week! @evyan.whitney 😘", "ccapitine": "🙆🏾‍♀️🙆🏾‍♀️❤️❤️👏🏾👏🏾👏🏾👏🏾", "whitneywaterbury": "💯💛🔥", "taylorbartram": "These are amazing", "cosmiclovequeen": "amazing human!! 🙌🏼", "bencrippin": "🙌🏼", "theblackswandiaries\nVerified": "Verified", "africabrooke": "YES EVYAN! YESSSS👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "iamfrankiesimone": "YES!!!! I can relate so much to this. Thank you for being the incredible leader you are, I’m so grateful to know you and to watch you rise rise riiiiise, powerful being!!!⚡️⚡️⚡️💓", "pusssywitch": "FUCK YES!!!!!! Congrats!!!! Love watching you get it!!!! Oh my gosh yes!!!!!😍✨😍✨😍", "kocomeow": "GORG!!! Shine!", "stephaniemburg": "❤️", "tessarave": "So amazing!!!", "thesugarmamapdx": "Shine on!", "e.casey5": "Thank you talking about your experience as it is one that is unfortunately very relatable. You’re amazing 💙", "msbrittanyalexis": "Found you via your interview with @blackgirlinom! Thank you for the space you’re creating with your conversations + activism ✨❤️", "galadarling\nVerified": "Verified", "iamalexandrathegreat": "😍😍😍", "ladysavaj": "YEEEESSSSSSS", "taraamackey\nVerified": "Verified", "leahpinault": "wow! 😍", "christina.rosalie": "🙌", "healthydoctor": "Thank you womyn for being the light and the voice!", "evajannotta": "Wow, @evyan.whitney !!!", "gr8p15": "Looking forward to reading your interview", "sophiawallaceartist": "Stunning work! Congratulations @evyan.whitney ⚡️⚡️⚡️", "che.che.luna": "YOU!!!!!", "keepitvertical_": "💕", "yonilovee": "Truly inspiring!! ✨✨", "americahatesus": "Muy hermosa😍🖤🖤🖤", "portiaferrari": "♥️✨✨✨✨", "babymooses": "🙌💫 Look at you go! I'm so happy for all your success and how many more people you are getting to reach as you grow your business.", "alexaralph": "❤️", "thepiscesinme": "Just wanted to say I love your work and testimonies. You are helping so many, myself included. 💓💓💓", "augustkate88": "Superstar!!!! 💖💖💖💖", "jassyonyae": "That’s so very true! Growing up in a religious household, I was never given the talk about sex and especially consent. Was only taught to wait till marriage as if that was the end all. And congrats on Esquire! Wow 🙌🏾 Top notch dear", "bailey.stiner": "You wonderful human. I am all too familiar with purity culture as well, I have found so much freedom and healing through your work.", "leneasims": "Blesssssss", "vespersmoon": "👏🏼👏🏼👏🏼"}