{"kielejael": "Can’t wait to attend. Super important topic and discussion!!", "shevylee": "Honestly never even considered this. Thank you!", "madisondesj": "@keiraschulz", "samantharosebarb": "@raising_love_awareness", "reetrannik": "Wow ❤️❤️❤️❤️", "ana_____italiangurl_23": "explaind the prefence thing too good!", "life.0f.j": "Do you really believe the things you're saying? Do you really speak like this in real life?", "y__spot": "🧡🧡", "theangryoptimist": "@preppydude might even interest you", "bridgtbogn": "💖", "weirdothefreak": "My eyes have been opened 😢", "smg_sma": "Educate me🙏", "lifeisaishaa": "@kevindoesart", "kweenius": "Yoooo, “I can’t show my nipples because they’ve been categorized as female.” Wow. WOWWWWWWWWW. like wow, I’m really thinking about that. Nipples are nipples! Haha. Wow.", "masoneve": "@philosaurusrexx", "lil_miss_bina": "So they dont want us to show our nipples (that we decide to put up) but insta happily allows unwanted d*ck pics to be sent to us... sort it out Insta!", "potatpug": "Um it’s not racist or anything, we just don’t wanna see that, although people could just block you. Idk 😐", "idreamofy0gini": "Censorship is getting pretty rediculous. I know that on fb and YouTube, it's all about being advertiser friendly ie: MONEY. I'm sure it's the same deal here. It's all designed to make people fake, oppressed, and good little slaves to the system. I reccommend trying minds.com if you want to be totally liberated from this bullshit. The only thing they won't allow there is kiddie porn and snuff. It's open source, so anyone can go into the backend and see what they're up to or even contribute some code. No secret algorythms, no databases vaulting private info. DMs have end to end encryption. fb and insta get all the ad revenue their users generate and even charge you extra to boost your posts. Minds.com gives you participation points and then lets you boost your posts with those points or else exchange them for etherium (a cryptocurrency similar to bitcoin). What other social media platform pays you for your content? Yes, YouTube does but they are heavily censored.", "renna.rose": "@brandalinden caption and stories . Thankful for these lessons and reminders. 🖤", "khrystina_pryani": "@radicalmatriarchy", "zugunruher": "Come to D.C.!", "cat__astrophe": "♥️♥️👏🏻👏🏻👏🏻", "markeda_manifesting": "Yes I am here for all of this. So factual!!!", "chech4u": "thank you.✨", "nezapos": "I don't get this. I'm all for freedom especially empowering women but ffs what's this? I understand you want to show your nipples to the world like there was no tomorrow but what for? So the world knows you have nipples? Or you wanna walk outside naked? Cause the world knows that you have nipples. It's either nipples or dicks. You know what? I don't want to see a man showing their dicks when they feel less than women. Also don't want to watch genitals elsewhere than in porn. Can't wait for all the explaining to my kids that certain people are walking naked on the streets so they can feel valid in the society 🤣🤣 Before you gonna call me rude aggressive or whatever I'm non of it. I'm very curious and opinionated same as you are and wonder what's your answer 👍", "dysartist": "So with you. I cannot get my feed to show the posts of the brown and black womxn I follow no matter how strongly I engage with their content. It is absolutely racist. I’m so glad to be following your page now that I’ve found it. Thank you.", "short_yellow_bus_window_licker": "Preach on Evyan 🔥🔥👏🏻👏🏻your words are roundhouse punches to the censors everywhere well done", "highfivepunk": "could someone please explain to me how this specific issue is white supremacist? genuinely curious bc i think im missing the correlation, i do recognize the others tho! just hoping for some clarification please", "christinewild_": "YES WE DO.", "meganlwadden": "I was just watching your Instagram story about the algorithm targeted POC/Sex Positive accounts and when I clicked on your page I was shocked at how many of your main feed posts I haven’t seen before? I watch your story almost every day I think, and I like your posts quite often. I engage with a lot of people a lot less than I engage with your posts and I definitely get their stuff pushed to my feed more frequently. Kind of having my mind blown by how shitty this algorithm thing is 👀", "rossella_destefanis": "#freethenipple #freethenipplesupport #freethenipplemovenment", "meghan_layne": "Oooh damn! SO well said! Thank you!! 🙏💗", "shelbysellslove\nVerified": "Verified", "theideagirl.co": "In there like swimwear!!! 😘😘😘", "kirstyemma1987": "@li.li.lc", "mydearvagina": "❤️❤️❤️🙏🏻", "babiaca": "@sistershakti thought you might find this interesting...", "iamjanetphoenix": "💯💯💯💯", "the_angela_gallo\nVerified": "Verified", "print_arms": "100% with you on this.", "ummmmm_lex": "You’re a genius!!!", "vikkishandon": "This caption is so so so powerful and well worded and I love it SO much... also the picture😍😍❤️❤️❤️", "yo__nadi": "Will it be EST time? I’ll tune in", "azizalovemusic": "Love the work you do and how you show up on this platform and on your podcast. Very inspiring !!!", "_esoterika": "👏🏾👏🏾👏🏾 Daammmmn. This is so on point.", "kirrigrace": "I don’t think it teaches I think it reflects a reality", "kittenbittenraz": "Well said. Preach.", "eat_suite": "Such an important topic!!", "msfitz": "Purchased ⭐️", "ariellesaragardner": "Amazing. Thank you.", "kellygeographic": "What an eloquent, coherent, articulate synopsis about this topic. Wish I could be there for the panel.", "dancenakedproductions": "Thank you for speaking to this. Its so alarming and so many are unaware that it is happening", "thatnaturopath": "Also ridiculous that the censors don’t know *all* nipples are female as we all start life out as female until the chromosomal switch is flicked to male!", "exuntld_backup": "God I wish I could be apart of these convos", "drlisa313": "@evyan.whitney you really need to start charging these white ppl per post for all the emotional labor you do. Especially when you know good and damn well they really do not care and just ask shit to be asking. They internalize absolutely nothing.", "theworldandt": "Are you having any events in Chicago anytime soon? Or know any Chicago based WoC doing similar/adjacent type work as you? All your events always look so good!!", "tealeigh": "We are so thankful you’re coming out for this. Looking forward to having you at Welcome Home and listening to you 🖤", "americahatesus": "so this looks dope AND it's in Brooklyn (cc: @itsautumnm @miss_amandaluna maybe we do a ticket giveaway?)", "bleudoe": "I'll be there in spirit, will there be a live recording/ or possibly podcast for later? ❤️", "awakeningmagdalena": "Thank you for your beautiful work! I see you and love you🙏🏾💗", "sarlejeffries": "Dopeness.", "thefeminineenigma": "✊🏽", "hellolaurenash": "this is brilliant! wow wow wow 🙌🏾💕✨", "emmaspiegler": "Will be this be available to attend online in any way? 💜", "cianaluna": "Hell yes 🔥🔥🔥", "mraybaybay": "Very happily surprised by the online availability of this. So looking forward to hearing the conversation - you're absolutely right, this needs to be discussed more!! 🙏🏼❤️", "yazminbradley": "@margaretbradley let’s get online tickets!!!!!!", "comeforeplay": "Well said! Many people think I’m “paranoid” or it’s a conspiracy theory when I say that instagrams targets POC’s businesses and art that promote sexual freedom just to hide and shadow ban us when we have done nothing wrong! It’s disheartening because how can a social media platform ignore, censor and reject the VERY same thing that it was built on... sex work. Do you think it would be possible to sue Instagram for the same reasons that Dame is suing the MTA?! 🤔", "hana_calista": "HELL. YES.", "mamazandmini": "This is incredible! Thank you for your work and your voice 💞 I look forward to listening.", "nicoleriggsphotography": "I cannot love this more 🖤🖤🖤 Thank you!", "samelyah": "💜", "kellikikcio": "your voice and experience is so incredibly valuable- so looking forward to learning more from you!❤️❤️", "gracerterry": "my eyes are opened and my ears are primed to listen and learn. thank you for the work you do.", "robelyfe831": "You are such an inspiration! And such a beautiful being!!!", "_biancarosen_": "This is everything thank you. Ironic how they say this doesn’t follow their community guidelines, but the most recent troll on IG telling me to get raped does. Ridiculous.", "snackincbus": "Is this being broadcast and, if so, are e- tickets available??", "badgalrayrayyyy": "@shabarbadar", "yogi.tb": "🙌🏾🙌🏾🙌🏾", "ariaintrepid": "Get it lady. Standing with you.", "cozyfolk": "@erotic.earth.embodiment", "courtastr0phe": "Ooooo this hits @coriamacouture", "flutter.beam": "Hey! I sincerely admire your work. I just had a question- what are your views on any cultural appropriation that may be cause by someone outside of their traditional culture wearing waistbeads? They're absolutely stunning, but I also realize the immense significance they no doubt hold, and I'd hate to offend anyone simply for the sake of \"admiration\". I'm aware of several cultures that have used similar ideas, but none seem to have resurged the way they have!", "asleeplessmind": "Real time updates were the best. But now they want to use these algorithms to build their racist and sexist technology 😤", "loutie02": "@tasjoui", "la_reynademi": "So much truth in this post. Thank you for participating in work that challenges the status quo. 👏🏾👏🏾👏🏾👏🏾", "kat.hoelck": "You are stunningly beautiful, so powerful. Fxcked that that equates to pornography and sexualized when you’re simply Being. Such an important conversation.", "grl___harlot": "you should look up the photo book ‘pics or it didn’t happen’ its an archive of photos containing nudity that have been removed from instagram! rly neat idea and way to push back", "steven_w987": "100% agree! 👏👏👏", "nanchitaaas": "@jetaime_rose", "miss___jill": "Wish this was in CA!! 👏🏻👏🏻✨✨", "katrinaashley": "I’ve been flagging accounts that are selling porn / spam bot accounts that look like the porn hub landing page, yet @Instagram doesn’t think these accounts are in breach of their community standards. However, the artists, activists, body positive influencers, women’s health accounts have their posts deleted all the time. Something. Needs. To. Change. 👏👏👏👏❤️", "littlebirdvegan": "One of my favorite books is “Weapons of Math Destruction” all about the oppression that lives in our coded, everyday tech. It’s so relevant for me and my job as a solutions architect to stay aware and grounded of what I’m doing. This looks really amazing, as well.", "theblogofatype1diabetic": "@kpt1d you’ll love this! 😍 Xxx", "kpt1d": "Really support this whole concept all the way from London ❤️❤️❤️❤️", "raydawn1300": "🙏🔥❤️👁⭐️💝✨💯", "_allteenoshade": "Fuck their fragile ass community guidelines. They’re so wack.", "shaynadarice": "@s.yolee @s.yolee @sharai21 @yasbraitz", "beth_rinko": "I fully support this. 💙", "_laurenlanay_": "I love the dragonfly tattoo", "morenadelasol": "So here for this post 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "sarrah_28": "YES! These words! Thank you! 🙌🏽💖", "cees_c": "On WhatsApp you can share whatever you like. No censors. No exceptions. Freedom", "vanillajesse": "Yes 👏👏", "un_becomingme": "I totally agree with you!! ❤️", "chynnadollyogi": "🙌🏾", "yasmeenexplainsitall": "And I’ll be in NYC too? Gotta get tickets!", "hersupreme": "Here for this.", "thebonewitch": "Ugh I wish I could go to this. 😍 @lenoreblack_ will you be around then? Check it out!", "cloudninelifestyle69": "Tired of instagram and their so many restrictions. You can't even use s.e.x. in a sentence anymore.", "m19rosass": "🔥", "seenandheardconsulting": "@natalya.mason - check this out!", "chrstinedanielle": "Love it 🙌🏽", "_namaste_nay": "@meliqzaddy leaving you right hurr", "aftl___": "💙🙏🏽", "stefaniamariaa.coaching": "Noooo I need to see this but I’m back on the west coast tonight!! Will you be streaming?!", "mariephilippejean": "@meriemdebz me suis dit ça t’intéresserait peut-être!! 🧡🧡", "minaminers": "That paragraph is everything I needed to read today. And it is absolutely correct. ✨", "ember.vine": "Y E S. 💜", "jennpalf": "@kearamb", "dakotaleestroud": "I’m in Los Angeles and do Naked lady retreats and workshops. So wish I could be there. Will we be able to view this online somehow?"}