{"sexualhealthfoundations": "Love this. And, yes, have seen & felt my cervix. It was amazing. I like to think of her as a beautiful creature of the sea. Cushiony. Venus fly trap-ish. But way softer. And vibrant in colour. ❤️", "thelastmimi": "I'm grossed out by this and I hate that", "faith_meckley": "I saw mine during my HPV biopsy, on a giant HD TV. It was surprisingly cute!", "cametogather": "“Happy spelunking” 😂😂😂", "pharaohmumo": "Real talk i need me a melanated woman like u", "tishushu": "Yep, regularly and also both times I gave birth when it felt more ripe like my full lips. Our bodies are amazing!", "daracampb": "I just want to say that I am LOVING the spirit of community & support & openness that you’ve fostered here @evyan.whitney 🌹🌹🌹 seeing folks learning more about their bodies, asking questions, being vulnerable, offering support - it’s all so damn beautiful.", "baldheadbih": "I never thought I would be excited to buy a speculum, but here we are. 😂", "msjennifertharp": "Thank you, Evyan, for being so gentle and encouraging to all of us! 👏🏼💕", "alukalani": "I have when I had a LEEP procedure done for abnormal cells from HPV.😟 My cervix was blown up across a tv 📺 screen and almost made me faint trying to watch the procedure while simultaneously trying to fathom it being so much smaller than what I saw.🤯", "love_for__cows": "@kaylaylyn", "lydiabfit": "I asked to see my cervix during the last time I got my IUDs swapped out and she's so cute. Such a little pink donut. She's really sensitive though and that words \"cervical orgasm\" already make my uterus hurt.", "kristinannehm": "Switching to using a menstrual cup over 12 years ago is actually the thing that really started me understanding my vagina/vulva and finding and really deeply beginning to understand all the parts of it. It was super cool feeling my cervix for the first time!!", "littlewave1": "@eefybeefy", "anjulineely": "I tried to look for mines today but I didn’t feel it. I was in a squat position, unless it was very high up because I just finished my period on Monday. I’m still on the search for it, for TTC purposes", "guhergduman": "How?? Where is the comment? Help 😭 lol", "rwheeler1022": "I saw mine a few weeks ago, before having precancerous cells removed. The doctor (@plannedparenthood_stl_swmo, which has been under Fire because of Missouri’s new archaic abortion laws) gave me the option of seeing it magnified during the pre-op colposcopy. He pointed out what was healthy, and what was being removed. It was fascinating, and made the actual surgery so much less frightening. And he got all the bad cells! Yay for @plannedparenthood’s early and thorough cervical cancer screenings, and their willingness to to educate patients while treating them!", "arieltheartisan": "Damn ma you fine as hell 😭", "caged_bull_rises": "I got a colposcopy after a funky pap and got to see a live video of my cervix. Very cool!", "andrewsalyse": "The cervical changes during pregnancy and especially leading up to labour were crazy! It was like I was living in a whole new body that felt and acted differently! At the time it was unnerving being suddenly unfamiliar with this new body, but looking back I think that other body was badass!", "ella_mariew": "great reminder plus wowww looking amazing 😍", "bravebirthdoulacare": "Thank you for sharing such important, empowering information!", "reguseugenius": "hi, does anyone has tips on how to get over my \"go to gynecologist -phobia\" ? i'm 22 and never been to one and at this point i doubt i'll ever go 😅 (also: i don't want to shave but i feel like it's required?) any tips is welcomed, thank you ! 🌸🍃", "gabalexa": "so goooood, I hate the actual doctors office but I love leaving and knowing I have my shit together 😂 the peace of mind is valuable.", "maloramaa": "Wow, not even a minute ago I was talking about how I've been avoiding my yearly visit, and the VERY FIRST THING that pops up on my insta when I open it is THIS post?! I'm a little freaked out, but definitely scheduling my appointment as soon as I can now, that is TOO big a sign 💫", "iamdevinedivinity": "I got something to say!! Cervical Orgasms are the best. That's all.", "vsherself": "Is it odd that my basic high school sex education classes actually taught us to find and feel our cervix? The teacher said exactly what @evyan.whitney said... it feels like the tip of your nose. I doubt the basic sex education I had was more progressive than what is offered here in the US, but finding and feeling and being in touch with your cervix really stood out to me.", "criduchvt": "Yes love this! I actually perform Pap tests on people who have a cervix and screening is so important. Great well-being message to promote 💕", "jamilareddy": "Yessss love this 💕💛", "sosweetsogood": "I saw my cervix thanks to @chloeskerlak ‘s amazing cervix portrait party at Spirit Weavers this past year. As Chloe puts it, it looks like the cutest pink donut ever! 🍩", "lalalopez": "Just took this glorious ass to my obgyn last week, happy to be making regular visits again 🌸", "imustbeacat": "Why do I feel faint when I even think about my cervix?? 😩😩", "directorofease": "🙏🏽🌱", "evyan.whitney": "HOW TO DO A SELF-EXAM AND SEE YOUR CERVIX— . get a speculum (@babeland_toys sells these!) and spend a few minutes getting familiar with how to use it—i.e., how to adjust it, how to hold it in your hands, how to click it into place, etc. when you’re ready for your self-exam, collect your speculum as well as a handheld mirror, a flashlight, hand sanitizer, a hand towel, and your lube of choice (coconut oil works great if you’re not sensitive to it). . find a comfortable seated position (best arrangement would be sitting on your bed with a bunch of pillows propped up behind you, but do whatever works for you) and do some deep, mindful breathing to relax your body/vagina. lube up the speculum and whenever you’re ready, insert it slowly and gently into your vagina with the handle pointing sideways. if it hurts, stop, take it out and reinsert it with the handle pointing upwards. if it’s helpful, lube up a finger and use it to guide the speculum in. . once the speculum is in, open the speculum (this is where that towel will be handy if your hands are slippery from the lube). keep breathing deeply and mindfully. grab your flashlight and mirror and position it between your legs. shine the flashlight on the opening of your vagina and see what you see. if you’re looking for the cervix, it’ll resemble a fat little donut with a tiny hole in the center. don’t worry if you don’t see it still, just reposition the speculum and/or shift the light source and mirror around. if you still can’t see it, wait a few days and try again as the position of the cervix shifts based on your cycle. after you’ve had a good look, gently take out the speculum and clean yourself up. . if you’d like to feel your cervix, apply some hand sanitizer to your hands and get in a squatted position. put some lube on your fingers and insert one into your vagina. breathe deeply. bare down a bit (like you’re trying to take a poo) and gently start feeling around. you’ll know you’ve hit the cervix if you touch something that feels soft and squishy, like the tip of your nose. if you’re not able to feel it, try again in a few days. . happy spelunking!", "zainabjaye": "Can you recommend any good books on the female body ? X", "maryswcampbell": "looooooove this ❤️❤️❤️ cervix exploration for everyone!!!", "angelicaxxhanson": "I’ve had two babies so I’m real familiar with her. She’s actually pretty cool. 🤷🏾‍♀️😂"}