{"terababu92": "Jab luksan hota hai na kisi ka jata hai na jalta hai na usi ko dard hota hai falltu ki bhsahn jhadba band karo ghar se le ke jamin tak bech diya hai tu ko ise kya matlab mze karo tum", "rahul_patani01": "Tuze katora leke road pe khade ho jana chahiye.... Teri shakal bhikhario se milti hai😂😂😂", "sometimenaughty": "aree yeah to tattii hai", "nayla25798": "A phenomenal woman😘😘😘😘😘", "muneeb.manu786": "Randi", "ri.yaz933": "So pretty", "bhagat2745": "#randi", "____anik1207_": "#fake", "nehasharma240691": "🤮🤮🤮", "ansh1293": "What a so called fake secular, senseless and hippocratic creature she is on earth", "the_rhythm_n_blues_": "Iski shakal dekh ke chapp chadti hai....", "maanav40": "RANDDDIII KI BACHII...", "hussainzahanat": "you look Gourgeous", "shivay_shiv1431": "Ma kasam Puri manthra( ramayan vali )Vali feel de rhi hai tu abhi 🤣😂🤣", "sunshreedhyani": "Makeup krne k bad b chutiya he dikh rahi hai🤣", "psychedelic__vibes__420": "Tu randi he", "aslijaymusic": "Pheminist fake vaali", "nm6766902": "Ye nachnewali Ko zyda bhav mat do... Jihadi hai", "fgteyeu": "gAnd mra le", "heartticker12500": "kutiya lg rhi 😂😂", "model_madyy": "Mia khalifa ki jaga khali hai interview dogi kya😂😂😂😂", "farman.ansari22": "A true inspiration", "vedant_pathak": "Band karo Band karo, Khule mei hagna band karo", "upadhyaynitesh51": "Pakistan kb jaoge", "meet_joshi_9639": "Bjp🇮🇳", "akash_linsky": "Hii Lawda bhaskar", "vish1vish": "Na shakal, na akal, na acting, na awaaz.. Bas dayan ke tarah bhokna aata hei.. Hum kagaz nahi dikhayenge. Shaheen bagh wale.se bakwaas karwalo. Congress ki chamchi", "krunal3951": "😂😂😂😂", "samayra12223": "Tab bhi jaahil aur daayan hi nazar aa rahi ye kuttiya aurat", "ben87yao": "😍", "ravii8138": "Chudail dikh rahi ha fir bhi @reallyswara", "proud_looser_123": "Tujhko dekha to ye khayaaal aayaa ......sala tere se to suar acha hai jo gu khaaa ke is desh ki gandagi to mita raha hai ..aur tu .....", "ravina_bothra": "Without makeup toh mirror b dekh kr dar Jaye🤣🤣 bhangan", "paridhisharma30": "Tu Pakistan hi chli ja Ghtiya aurat", "welcometokhuranaworld": "Tatti jaise shakal aur chakka jaise Surat hijada swara", "nirmalkholiya": "Tatti Shakal 😕 Muh mat dikhaya kar randi tu apna.", "im_jigneshrana": "Mandarchod @reallyswara", "therealganeshh": "Flop actor/ flop activist transgender 😂😂😂😂😂😂", "beingalcholic": "Sasti randi 😂😂", "rockstar_rishikesh65": "Randi lag rhi h 🤣😂red light pe khadi hone wali", "kanavdevsingh": "Scared the shit out of me .. aunty", "deepanshumaywad": "Desh drohi hai kamine swara", "p_a_t_e_l_1995": "Teri sakal muje pasand nai aai aathuu...😁", "toshi_tripathi": "ab bolna ek sadhu ki Lynching hui hai kaha marr gyi randi ?? Ek religion k liye bolna aata h kya ?? Saali Rand", "rickyrockssss": "Maa kasam teri sakal meri kutte se accha hai.... Gheo gheo", "basantritvik": "#shameless", "shanukukreti": "2 shabd doctor or police walo k upr Patthar marne walo pe bhi bolo", "abhishekmh": "Tatti 💩💩", "princeashoka999": "Hi swara I really appreciate u for supporting Kanhaiyya Kumar..", "47saransh47": "Make kiya fir moot bhi peele mera rundy ki lodi", "shakshi_gupta9939": "Kagaz khoj lo🤫😝😝😂😂", "sewinfashion_": "Makeup karke bhi ugly pchhh how will you change your face?😂", "kal_vairab": "Like a lana rahodes sister 🤣🤣", "kajalkumarisaw": "Badjaat kahin ki", "himanipandey_": "tm jaiso ko bs thappad marne ka mann krta h... tmlog ki aatma tmko rat me sone kaise deti h..neend kaise aati h tmko? ye secularism ka jhanda le k ghum rahi ho.. usme hindu dharm ni aata h kya? hindu dharm hatao inne log mil k 2 budhe saadhu ko mar rahe aur tm aise tweet kar rahi ho faltu ke.. gajab ki aatma h tmhari aur tm jaise logo ki... i just wish parshuram jaisa koi avtaar le aur sare saadhuo ka badla le.. jinhone unko maara usse jada gande aur bure tm jaise log h jo galat ka saath dete h aur apne followers ko b galat sikhate h... thhhuuu h tmpe, tmhari aatma pe, tmhari jaisi aurato pe jinki rooh nahi kaapti ek budhe aadmi ko aise tadap k marta hua dekh ke", "jayant6085": "Palghar hamle par nahi bolegi chutiya pai", "vikasingham": "Bhadwi", "jain._anurag_": "Saali bhen ki lodi waha saadi sant mare hai now y r u quite cuz u have sold ur body to those who want this Nation to be destroyed saali roj chodte h na wo tujhe", "sangwan_rittu": "Shakuni swara", "rishi_412002": "Tujh jaisi kulnashini k kaaran hi hmaara naam kharaab hota hai ab un SADHUS ki nirmam hatya pr muh nhi kholegi ye dogli 😡😡😡😡😡😡", "the_lonewolf_619": "Coffin niggas wants know ur location😂", "tripti.roy252": "@reallyswara farjibhaskar🥳Pice of a 💩🥳", "himanshu_ji_yadav_": "ap teko dar nahi lag raha santo ki hatiya pe tere hindu hone pe dihtkar he", "that_delhites_boy": "Gand marri hai ye tho 🖕", "its_tegeali786": "Nyc❤️", "lavishjain13": "आप राजसमंद ज़रूर आएगा ।", "_saini_here_": "मौलाना इमरान खान की कलयुगी औलाद😠😠", "aridaman_singh_1": "Asa lg rha hai muh me lkar ayyi hai anurag kashyap kaa", "ll__r_o_h_i_t__ll": "Sahin bag bula rha h", "arungr8": "Tumko dekh ke khana kharab ho jata hai saare din ka", "atul.vaidya.5245": "Kunal kamra se shadi karle 🤣🤣", "bhatia_oo7": "raand", "sarfrazzangi": "I'm ur fan", "general_01_knowledge": "You are pure bitch and Whore you dont keep guts to say anything for Hindu sadhus.", "kartikakocher": "Fir b chudail lag rhi hai", "arjun_banna8": "What u think about palghar???....tu kab ja rahi he palghar🤔....ab nahi mombatti yad aati....😡", "shubhammawle": "Plz if koi Mera. Comment padh Raha h to iska profile he report Kar do btao apni power .. guys", "the_vegabond": "film mai to kaam milta nahi is liye porn star hi banja usme teri jaisi randiyo ke liye bahut scope hai woh fingering wala scene ki bahu tippani huyi thi #suwarapornstar", "aparna_agnihotri": "Asli chehra dekhne layak hai bhi nai apka", "chetan_kshirsagar78": "Palghar ke upar kuch toh bolo mam,ab kaha chali gayi ho", "shank_chauhan": "Kya hua mam ab ashurakhshit feel ni hora apko ? Koi post nahi koi sad feeling nahi for 2 saints and vo gareebi driver es baar Mara es baar Kaha gayi madam apki poori takhti waali gang ab tak to poori war ho jaati agar molvi ko maar deta koi ab Nahi feel hora ashamed ? @reallyswara", "_beloved_somesh_": "Thode din ghar par shanti se hi raho madam......🙏🏼 Plz", "anvesha1469": "Swara jaha pe muslims spit kar rahe hai and maar rahe hai doctors ko.. aapki bahot jarurat hai.. please volunteer😂", "sab_moohamaya_hai": "Fucking hypocrite", "aman____9599": "Where are your post on recent lynching can’t see it.", "varunpant22": "Bkl ab ni boli tu kuch mob lynching pe, muh me le rhi hogi na sabka shyd isliye", "dthwala.india": "Palghar", "_.rohit._19": "Justice for Sadhus #palgharcase #hindusarehumans #wewantjustice #exposesthepseudoseculars", "gajendra_deshmukh234": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "v_j_vishuuu": "ab ye bakri wale muh se kuch bol bhi de... yaa sirf Muslims ke liye tera muh khulega?", "avi_k.m.tiwari": "Dayan ... kalankni", "ekplaterajmachawal": "Unlike your career,lmao", "kuldeep64kg": "Aren't you frightened now? Death of these sadhus doesn't seem terrific to you?", "amiyvaidya_07": "Manthra 🔥", "m.aaadarsh": "Bhn ki laudi sali ...kutiya", "abhinav.awasthi": "Duniya ki sabse raand aurat", "jai_hind_ki_sena_india": "Randi number 1", "champions.gallery": "hypocrite bitch", "mejnyk_o4": "Crude oil at its cheapest price since 2001. But not cheap as Suar🐖 ka bachha like you. Oh Suar ka bachha v utna cheap nhi jitna tu hai. Madarchod!!!!!", "anandguptamusic": "But you can't survive in Bollywood..😁", "brownboyz007": "Tatti hai bilkul tatti", "shubhamsinghrajput1810": "ab aap ka mouth kyu chup h sadhu lenching mai! !#sameonyou #layer", "zh63964682020": "❤️❤️❤️❤️❤️❤️❤️❤️👏👏👏", "sagar161678": "🤮🤮🤮🤮", "my_viral_perspective": "Demag mai tho guu bhara va. Shkl chamka ke kya milra tuje", "godfather69876": "Arre waah saaheen baagh ki randiiiii😍😍", "abhinav_varshney001": "Make up ke baad itna bura lag sakta hai kya koi", "jigartr": "Bloody pimp where the fuck is your fake feminist hypocrisy! Fucking bastard", "thehimanshupandit": "Shkl dekho iski chhiii", "jitudhakate": "Ab kaha gya tera camera 2 saadhu ki hatya kar di ye post to daali ni fans following k liye kya kya karonge utna niche gir gaye ap, police fors ko badnam karti ho pic post krke.🙏", "a.w.aditya": "Chakla खोल के बैठ ja", "hansh_nath5399": "Randii.....Free me bhi naa luu teri", "ritienpandita": "Saali do taake ki randi jaake gaand maara mullo se maa ki lawdi", "ziaullahr": "Love you❤️", "sutar7971": "Bhoot ki beti lag rahi ho..... Daayan kayi ki...", "raj_shayan": "Hindu sadhus pe kch nhi bolegi randi ... ab intellectual nhi banna bhen ki lodi madharchod", "methelegaleagle": "Saali ab Kahan mar gayi? Ab gungi ho gayi hai kya? Now you don’t see how Muslims are asshokes like you lynched Hindu saints! Such double standards you people have! How can you even live like this!", "_.woldandmoon__": "Esko fame chaye bhut jadda fame chaye 🤣", "raghavsingh6934": "Isko koi porn filmo m n le", "shiv_anand._": "Aareey didi.. Palghar pe do shabd kahe 😂😂", "yourf1rstdaddy": "Randi agla post kab karegi", "harshit.singh27": "Shemale lg rhi h", "kiran_3814": "MY HOUSE MAID IS MUCH BETTER LOOKING", "_kashyapkomal_": "Bauhat kharab ho aap", "aksingh286": "Tujhe jaise dogle bahut kam hote hai duniye me", "chaitanya.rathi": "Don't you feel ashamed now when two Shadus are killed?", "unknownn_strangerr": "tabrez tera mausa tha bsdk av bol k dikha do sadhu k maut p av khn maa chuda rha tera secularism", "viraj1511": "Swara laudi hai Tu laudi", "damandikshit_": "@reallyswara Chati pit Aayega Modi hi ,chutiya aurat", "navneet___007": "@reallyswara ulti aarahi tere ko dekh ke .", "kumarharsh28061998": "@reallyswara dalal randi bc chutiya aurat chudail", "961989p": "Kitni galiya padti h tujhko wo bhi comments SE jyada gaaliya sharm kr le itni insults oh my god😜😜😜😜😜😜😤😤😤😤😤😤😤😤", "paks_9616": "Kanhaiya ka chus liya?", "tushar.bansal.3975": "🤣🤣🤣🤣", "hirenpatel198996": "Bitch", "661shubham": "Randi", "yash1662": "Kya huwa sadhu ki mob lynching pe Kch nhi bolnyge ——-I think you are busy in bed with Kunal kamra 😂😂 Don’t worry he is giving you injection 😂😂 jese tum abhi bhook ne shakti. Kho chuki ho aur vibrator use krhi ho 😂 tra Career ka graph wese bhi negative points me hai 😂", "the_sweetest_girl1999": "Tu Palghar kand ke uper jo twit ki hai us se kya sabit karna chati hai ki sadhuo ke sath jo hua usme unki galti hai koun sa sadhu bhagwa kapde pahan kar kiska lynch kiya hai aaj tak btayegi th 😡😡😡😡", "sau5744": "hindustan sey nikal ja terrorist ki yahaa par jaga nehi . Sala Pakistani dalal", "tyayush13": "Oh Ms.SECULAR!! Now where the fuckin hell are you @reallyswara", "i_____________sauravpatel": "Chutiya aunty 🖕", "dinomech": "U should move away from our india", "shivaa01di": "Make up mein bhi badsurat lg rhi ho🤣🤣", "ig_chris_op": "Why survive mar jaa na 🇮🇳 ke liye acha rahega", "bhagyaveerh": "@reallyswara ab Kahan hai aapki humanity dekhna chahte hai hum abhi koi farak padta na bhenchod Hindu tha isliye 😠😠😠😠😠shame on you ! India is shamefull to have citizens like uhh", "prisha_xo": "You are a piece of shit.", "priyanshuyadav1222": "इस समाज सेविका को एक बार जमातियो की सेवा करने का मौका भी मिलना चाहिए", "abhinav_958": "U r real name of bullshit", "hydra_switch": "Mat daalo aise pic Bohot manhoos lag rahi ho secular women swara 🤣🤣😁😂😂🐒🐒🐒", "jayantsverma": "Fr bhi flop", "a.kshanshjaiswal": "Phir bhi kutiya dikh rahi hai.", "sabhimanyu207": "Jai shree ram 🙏", "abby._.2319": "Rubiqa yaad h 😂", "braincord_connection": "Leftist !! So called liberal shame shame !!! Shame poison for the nation", "skdpkju": "जावब दोना रांड अभी जो मारा है brahmin को. चुप क्यू है रंडिया", "aarushamit": "Palghar incident pe kuch boliyega nhi aap aise toh bhut ultiya krti hai aap..kbhi CAB NRC inhone ne filme kasme bhut si krli thi or inke pas koi documnt nhi tha ye ulti ...abhi v kro kuch ultiya madam chup chap kyu ho", "tourism_rajasthan": "Swara ab tujhe dar nahi lagta kya jab nirdosh shadhuo ko peet peet kar maar dala gya ... Ab tu nahi bolegi kya ki dar lag raha hai yanha rahne mai .... Ohh tu to khud unme hi shamil hai ...", "akash4u1234": "@reallyswara Once you sit on my cock, please😂", "vireshjain159": "Cunt face", "aryanmehraaa": "@reallyswara slut🙏🙏🙏🙏", "medha_bajpaii": "And still u look ugly", "imkasaksharma": "May your soul rest in peace!", "ekpalzindagii": "💩💩", "reetsssss.09": "🤮🤮🤮", "imnrj081": "Mra sperm b lgaa le thoda...makeup zyada acha hoga tra fir", "pablo_escobar0821": "chii tatti😂 kha ae heroine bni ye", "ankitsharmaa___": "Randi madarchod @reallyswara", "odedra_manav": "Meri gali ki kutiya jyada Sundar he😌", "sharma.g.ka_ladka_hu": "Terrorists ka jo face hai vo toh makeup sey b nhii chupe ga ... #toiletcleaner", "_anand._singh_": "Arey Oo Bawli gand, muh pr 2 kilo lipa poti toh kt li pr Hypocrisy ni chupa payi tu, librandu gandu ain't you ashamed now when two sadhus got lynched? Dogli paise pr plne wale ho sb.", "vicky_raj07": "Bitch_😡", "pranshubalodi": "Ab kaha ho swara baskar ji musalmaano ke saath kuch hota h toh aap jhnde lekr khadi hoti ho ... aur jab inhi mullo ne hmare sanyaasi maare tab kaha ho aap", "rajunarle": "Chalo Hum bakth to hai...tum kon ho us pr shak hota hai🤨", "sattyyam": "Madarchod", "isupportyogijii": "Abey chudail lag rahi...kabhi mirror me khud ko dekh najayaz ki aulad", "real_sam21": "Modern manthra 😂😂", "pitbulismydog": "Bharat ki Randi.", "_ashish.s_": "Ew.. peice of shit", "vivu00007": "Aur Randi aajkl dhanda kaisa chl RHA hai Tere Jnu Aur tabligi valo ke sath🐖🤞", "iamsaahilpanchal": "See no one cares😂", "saurabh_sao": "Tatti jaisi h shakal", "rover_explores": "Attention seeker 😂", "infinite_krishna": "Asshole spotted 😂", "kritisanon328": "hijda", "officialdeepakgaur": "Mujhe lgta tha is duniya me bhooth jesa kuch nh h fir ek baar teko dekh lia jb se dar lgta h 😂", "young_shelldon": "I wish I had a time machine and give your dad a Condom", "shivraj_ghaswan": "तु चाहे make up कर या ना कर तु लगेगी तो चुडैल ही", "music_heart_rahul": "Look like witch..... as in real life... 🤣🤣🤣", "d.rajj": "Randi ki aulad Randi😂😂😂", "tom_roy_13": "maharast me jo ghatana ghati uss ke ware pe aapka kay rai hai..", "xsquaremusic": "Not going to say anything on what happened in Maharashtra", "shubhankar545": "Randi sali lawadi madharchod vaishya kuttiya iski ma kichu maro chinar ko pelo", "rajputajaysingh333": "Sbko ulti karne ka mouka milega", "sagartn92": "Chudel lagnewali swara kaha thi 😆😆🤣🤣🤣😆😆", "lalitbhandari141": "@memonarbaz_ han bhnke lavdey tum toh ho hi madrchod k bacchy fund kya bc free ka kha hi skty ho n thukogy bhi yahi apni maa ki chut me thuk looh jaha se paida hue ho .. n han kagaz dhoond lena abhi yeah nipt jaaye amit saha sir tumhari gaand me 5 kg ka rdg daal k bc bangldesh aur pakistan fenk k aayengy", "prashant.jeengar.50": "choti moti actresses h ye iski itni okat nhi h", "nikhil_311": "Slutt of jihadist", "sharad8140": "Guttar", "ichirag_": "Ye 2 takke ki ladki kuan hai 😝😝", "psykidddd": "Or randi kaisi h pakistani", "chetan.more0007": "Randi hai saali isko Pakistan bhejdo😡😡😡😡😡🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼🖕🏼", "silverr_shadesss": "May uh shall pass away from this world", "kuldeepkaur3_": "Jo sadhus pe mob lyinching hui h abh tumhe kuch nahi kehna madarchod vese to badi bkwas karenge!!!", "raku.chaudhary": "Randi ab. Bol@mob lynching ho rhi h ya nii", "uttam__parjapat": "😂😂😂😂😂", "aayushi_sunshine": "Chehra nhi chup skta tera makeup krke or ha bekar h tuuuu tera chehra toh chl thk bhi h", "adhi_00111": "Now come out motherfucker...DESHDROHI🚩🚩#boycottswarabhaskar", "ravii_332": "Ab inko China bhej do.....😂😂😂", "rahulyadav_1222": "🐵", "_hrithiiikkkk_19": "Liberal shit face", "yogi.surajpuriya": "Gadhaiya ki gand lagri h...Tu suar ki bachhi😂😂", "texas_tiger999": "Aur kya haal hai suor ki paydayish😂😂", "sharadsharma1993": "sadhuo k sath jo hua tere bhaiyo ne kiya unko maar diya chudail narak me jaygi tu", "dentist_abhishek": "Zihadin", "h_u_n_n_y_j": "Suar jaisa muh kyu bna rhi h fr bc", "mnjit_kaushik": "Hey librandu now say something bout mob linching towards sadhus the incident that happened today in maharastra u bitch", "manto_1857": "Isme or sbki tatti mai kya farak hai??", "rajputkirti14": "Lockdown ke liye support krne bolo to ek bi nazar nhi ayega kuki ab jin logo ne intorelance mchha rukhi hai vo to inhe dikhai hi nhi de rhe honge ab ku India m apne ghro m safe hai y log 😭😭double standard", "pnkz_kbj": "Tumhara nam swara bhaskar nahi deshdrohi bhaskar hona chaiye", "shrivardhan______": "Yar kya delhliya maine gand phatgai bhago re bhago chudel aai😂😂😂", "gour_shb": "Koi itni galiya kaise kha sakta hai.😆😆", "abhishektomer__": "Do kaudi ki actor 😂😂", "mayursen04": "Tatti", "mrigenpt": "Securalism ki poster girl.", "sumit_rathod2207": "lavde jaisa muh h tera", "ojasvishrivastava": "Why don't you go to Pakistan that will be the best country for you...PLzz gooo we don't want youuu get lost", "prashant_kumawat07": "Palgarh mob lynching ke baare me kya khna h apka...", "saucastic": "Now you don't have anything to say against recent STONE PELTING on healthcare volunteers and Doctors.. You and your bollywood should only concentrate on making Movie.. Where's that kal ka bacha DHRUV RATHEE who was giving gyaan on CAA NRC ? Now you people don't have anything to say against STONE PELTING.. You are a NAVAL KID and you are worried about documents.. shame on you and your pseudo intellect.. Well intellect toh hai hi nahi.. Logo ke ghar jala gaye tum logo lo faltu ke support se.. SHAME ON YOU", "arunwinsalways": "Ap ghr se nhi nikal pa rhe ho, doodh sbzi lene me darr rhe ho, doctors or police ki life ko risk me daal rhe ho. Madam inhone life ka risk liya 21 din socha corona ko desh se khatm krege. Inki life ka risk km nhi hua or bad gya ap hi bolo kyu?? Publicity ke liye itna mam. Babita ji ne koi muslim community ko target nhi kiya....", "mahipal_singh_101": "❤️", "dr9015": "Recent mob lynching pe comment comment nahi karengi aap? Dukh hi vyakt kar dein!!", "rajveertthakur": "Palghar mamle me Muh me lakwa maar gya Kya Muh uthaye har jagah pahuch jati ha rashan nhi milega bkc", "_the_beard_18_02": "You liberal whr u now when 2 sadhus killed in palghar maharashtra... Don't you a word to condem this mob lynching... You liberal monger", "officialjin_sharma": "Tatti lag Rahi hai too", "isaabellaaa235": "Ulti agai apki shakal dekr", "sonutiwari2003": "Sirf hasi aati h tere par 😂😂😂😂😂🤣🤣", "mahliqa_roshan_": "ND another thing U r gorgeous 😘😘 😘😘 😘u are unique nd different that is it...My feelings are so bigger that I can't express that in words🔥🔥my first nd last wish is I Wanna meet uh in my life bs❤️❤️❤️", "chikki1515": "Why swara did not made any video on Hindu saint mob linching", "shubhangi_singh___": "Suar ka muh aisa hi hota hai.. 😂ekdm waise hi lag rahi hai.. But afsos makeup bhi kuch na kr paya.. 😂😂andar se toh chudail hii hai", "geet_rising": "Pagal aurat... Tera to instagram hi delete marna chihiye ..", "mr._rohit._yadav_": "🖕🖕🖕", "przthvi": "Abe liberalism ke dalaal😂", "yashmishra3809": "She is an Anti national bitch .", "c_s_dubey": "शक्ल अच्छी नही है बातें तो अच्छी कर", "sweetjaat": "Tatti ka लेप lgaya h क्या", "surajgoswami700": "Namaskar🙏@reallyswara ji ab ap kuch Nahi bolenge Jo sadhu ke sath hua hai 16 April ko ya fer aap sirf ek dharm vishesh ke liye awaaz uthati Hain", "jroush8825": "Randi leaps dekh ker land isko laudo dene ka man ker rha hai...taaki 6 aaye 😆😆", "bhushansarve123": "😂😂Itni bejjti aur galiya khane ke bad bhai ap hai 😂😂koi aur hota to ab tak Rip ho jata😂😂😂😂", "rahul0001996": "Rundi hai tu rundi aur tera ghar pariwar teri maa rundi tera baap dalla uchh koti ka rundi sali", "kamlendrasidhauli": "Kapor kalpna k baad adbhut shanti prapt kiya . Aisa lag rha hai dayan", "rakeshsingh9392": "Kuch bhi kr le.. Suar hai suar jaisi hi lgegi tu", "jst_a_marvelfan": "@reallyswara किधर है रे तू अब रंदी रोना नही करेगी फिर से भीड ने 3 हिंदू मारे पाल्घर में,in which bill are you hiding now flop actress ab to teri dukaan b band ho gai.ab nahi bolegi galat ho raha hai.", "sharma_vivan_88": "Report kro is kutti @reallyswara Ka account", "its_ur_boy_mannu": "Kutiya😵😂", "nikhil_shinde33": "Oh shit she has nothing to do with 2 sadhus killed fucking liberal and teacher of secularism this are the fucking fake secural citizens who just fuck there nose when an communist is killed or tortured but she doesnt fuck her nose in when the same amount of hindus are tortured to..", "rajusingh3361": "Iski chut bilkul sade hue tarbooj jaisi hogi kyoki ye expert he gaand marwane me,", "the_cricholic": "Chutiya @reallyswara", "henvipatel1212": "🤮🤮🤮", "worldofadityaa": "Hope someone of this kind of bhayanak shakal will keep her mouth shut in this lockdown", "piyushd151": "Mob lynching pe ab tera baap story daoega", "_am_a_sumit": "Jitna ghatiya shakal utna dirty mind... Sali saadhu ki lynching me desh chorne ka mood nhi kr rha hai.. 💩💩💩💩 sali road chaap.. Nachne wali aurat.. Tu log ko actor bolne se acha.. Mujra krne wali aurat bolna chaiye", "iii__baaz__iii": "Actor nhi loda dhar", "r.ahul.k.umar": "@reallyswara 2 Hindu sadhu were brutally killed. Ab secularism Kaha Gaya Didi. Ab Nahi bolegi. Ab Kia ho Gaya ab chupp kio ha.", "ankit_anand2198": "Aap kuch bolna chahogi 2 sadhu ki maut pe😑", "manpreetsinghfan": "Iss randi ko follow koun krta hai 🤣", "rohitvaishya73": "Ab bol na madarchod iam ashemed behenchod do logo ko maar diya mullo ne ab bol na iam ashemed bhand lawdi hijdi", "dhruv562019": "Make up karne se dimag ki gandagi nahi niklegi mam", "ashish.kajla": "Tu bar bar board le k khadi ho jati h ....ab Palghar ki hindu brahmano ki lynching par b bol", "bhosale__ashish_7": "💩", "panku0007": "Jihadiyo ki behan 😂", "ashutosh.sharma.9210": "Kaash uss raat tera baap jaldi so gay hota ☹️", "sanketkumar307": "Because you are an asshole", "nilesh.thummar.391": "gandu libral sali ab khuch nahi bologi .nirdos sadhu ko gher kar mara gaya harami 😡😡😡😡😡", "dikshanegi2103": "Tatti khalo time pass ni hora to😂😂😂", "ritikaindian8": "Whore", "awokehindustani": "Swa-ra'nd'", "__iamsuraj__": "Dallli", "universallosers_": "गन्दी सी शक्ल और निहायती बदसूरत औरत", "officialkhan0786": "❤️❤️👌", "aich.design": "Gandu is olad", "rituraj__patel": "Madam aaj mujhme bhi secularism Khatam ho gaya....ab ganga jamuni tahjeeb jaisa kuch nahi bacha mujhme....", "lovkeshnegi": "🐷🐷🐷🐷🐷🐷🐷🐷🐷🐷🐷🐷🐷🐷", "rahulira": "Makeup chodo madam ji bike chor tabrez k liye badi daya aa rahi tha aaj 70 age k buzurg pe moblynching ho gyi takhti nhi utaaogi agar ittu si b lajja h to uthao takhti #palgharmoblynching", "gkmph735": "Acha shahinbag ab jati ho ya nhi 😊", "ro_9999hit": "Mere ghr ake zara tatti 💩💩💩💩saaf kr dena ari oo tatti💩💩💩💩💩 saaf krne wali aurat", "kulwinderbakshi": "Pahele toh sirf iska dimag gobar lagta tha ab shakal bhi gobar jaisi ho gae hai", "vijayrana4124": "Swara means bhess ke aage been bajana", "venkatesh_2_4_5": "You have any knowledge about Constitution. You don't have any knowledge about history. And few foolish Muslims and so called fake Hindus have kept u on the top doesn't mean u know everything. First attend school atslt for God sake", "hole_in_my_soul_": "Waise to tu follow karne layak bhi nahi ho.. b grade actress ho..", "haarsh__ly": "Abe Kaise se pagal hai tu bus Modi ke against hi Rahana hai Yahi Tera life ka Jinda Hai ( pagal aurat)", "mukesh_bhaijan1": "Randi ki sakal pe 200 lund ki salami", "abhaygurjar43": "#justiceforsadhu", "atik___patel": "❤️❤️❤️", "ayatqureshi622": "I am huge fan of yous...", "sab_.moh_maaya_h": "Kya bee laudi; Ab kuch kyu nhi bolti! Baada secularism krti h! Kya hua!.Muh pe laude lag gaye!🤣🤣", "fierynationalist": "Kon kon khalli time me isko gariyane aaya hai 😁", "alexcr57": "Fir v bakwaas lg rhe ho 🤬🤬", "vr_venom_9334": "Hi Swara aunty.", "pankaj_bondekar": "Tum to sexy bitch ho.. Smjh to gyi hogi tu", "jay_pratap_singh_royl_army": "Rstv pe indian constitution documentry pe kamm kar aap too ekdam great politician ho gai jab documentry 18 month pehl dekha tha too laga tha talent h but aap too education system ka graph down karne me lage h kabhi educated logo se pala pada n too sab awkat thikane lag jayega pandemic ko bhi majak bna rakhi hai app log too🙏", "jonamsha": "So you got the commercial that suits you persona 💩💩,tatti saaf karbe wali ad mili hai is randi ko hahahah🤣🤣🤣😂😂😂", "arnav.333": "Apna khrcha kaise nikalti he tu", "vijayfartyal007": "CAA or NRC ke time toh bdi Active thi...ab #coronavairus ke time kuch nhi bol rhi h..😑", "dr_tejendra": "@reallyswara aapko cinema me kaam Kyu nahi milta ab????", "yogeshbadsiwal_": "Lund chus chus ke tere lips suj gye", "kashishrathi0": "Ugly looking inside out", "ankitdesai74499": "Madam ek bar aap ki lipstick under burka wala scene kar do Na", "ravinderasinghdevra": "Rand Sali teri ma ki chut or teri chut me gade ka lund", "amanmishra9340": "Musalman ban jaa .", "un_known_peace": "Tuze roj karna padega... aazadi milegi kaise??? Apana ration pani chalega kaisa?? Dusaro ko nicha dikhana... Aur desh mei rehake ke dusare logo ko CAA pe gumrah karana... Kaha bharegi itana pap??? Muslmaan bhai isaki chaal samaj jao... Sab popular hone ke liye kar rahi hai...\" Hindu Muslim Bhai-Bhai.. sirf ae aag lagani wali nagin...\"", "anshuman_001": "ek br babita phogat se mil le saare makeup kr degi tera bdiya maar maar ke💪💪", "priyaka_gupta": "Kitti manhoos h yr tu", "narayan__rankawat": "Ma’am can you plzz come forward and support corona like you support your Mp candidates... kya pata ye bh haar jaye 😂😂 @reallyswara", "themusicdivine": "Nonsense...", "srijan_xy": "You didnt participate in that stone throwing on doctor competition", "rudrapandey4289": "Gita phogat ko target karne se pehle itna yaad rakheyega ke wooh desh ka naam ucha karr chuke hai tumloog jaesa nahi hai hai ke desh ko barbaad karne pe adde hue hai", "sharma_15niharika": "Ma'am why don't you ask the jamaatis to come out and get tested , why don't you ask them to stop pelting stones on doctors ?! They'll surely listen to you, but I m really ashamed of you not standing with the truth but only supporting the minority even if they are wrong,", "whitepantherrrrr": "Tu kuch bhi karle rhege Pakistani randii bc", "shubhampanditji442": "Chudhel aunty", "kalki_gujjar": "Tooo kya huaa phle b dayan lgti thi aaj b lg rhi h 😂😂😂 kuti sali", "anu.singh00": "We are proud to be a bhakt rather becoming a chamcha.. tu desh ki gaddar h.. kuch paise kmane k liye tu desh k against jayegi.. desh k liye marna seekh na ki desh se gaddari krna.. besharm aurat", "sahil7_chahar7": "Ooo lund jaisi shakal ku", "robinlucky5680": "Dr jhantu", "montyk1921": "Fir bhi bekaar hi lag rahi hai 😂😂😂😂😂 ab kya karogi shakal aur akal dono hi gandi hai tumhari😂 find papers", "jiturathore7773": "Kalmuhi karamjali nikkami jahil saale fingering waale role k he layak he tu", "cma_rsharma": "@reallyswara Suar Bhaskar ab un Jamat walo k liy b apna muhh khol de...🤣🤣", "rajkamal__mahto": "Aapka IQ itna kamm kyun hai ? Apko Dekh Kar mujhe Baar Baar Koi mil Gaya Ka Rohit Mehra Yaad aa jata hai 😂😂😂 TV channels ke debate par aap jab v bolti Hain aisa Lagta hai koi 10 Saal Ka baalak Apni daleel de Raha hai. Cute yet baseless.", "sopanrawat": "Shameful", "sachin_sinhmar_": "Looking chutiya", "mr_mintoo_c97": "Suwar ki gand jaisa tera muhh hai😂😂😂😂😂😂", "prince28395": "Chakka", "omsharma9791": "Besharam", "sam33rajpurohit007": "Mam.. Pakistan chli jao vaha aapko bohot pyar milega..", "the.royal.kabir": "U r great person we proud u Sis❤️❤️🙏🙏👍👍", "_naman_singh_7": "Nikal, pheli fursat se", "im_prashant.s": "@reallyswara is the most ugliest women both from heart and face , I have ever seen in my life .", "sunil_varma__": "Phir itni tatti jesi shakl lag rahi hai", "khushal2811": "Hagte hue pic liya h kya....esa muhh kyu bna rkha h🙄😂", "mithil.18": "Chaki legri hai surpanakha😂😂", "abhishek__.thakur": "Kuttia", "gautambhardwaj555": "Aaye haaye etni buri thooth sala din kharab kar diya randi ne", "akshay_sharma_ratn_bhardwaj": "@leaf_n1nj4 👀 Dhyan se dekho...Ye chudel wo hi Desh Drohi hai", "anand.singh.3": "Mullo ki olad....... Sali......", "karannnnnnjr": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "joginder_jojo": "Jaahil jamaati o ki randi swara bhasker murdabad", "shivdatt_thakare": "जब filmo se पैसा milna बन्द हो tb ऐसे लोग.... मुसलमान ko support krte hai", "kumarsinha_amit": "Kutiya lag rahe ho", "pranathanda21": "💩💩💩💩💩💩💩", "im_manishrawat": "Phir s bhdkaau bhaasan @reallyswara aapko agr psnd nhi h ye desh to chod k chle ku nhi jaate india ko yhi to dikkat h tumhari CAA k time v yhi kiya ab v yhi kr ri ho aur yhi krrti rhh jaaogi", "bunnyroy_007": "JB zamatiyo ne doctor ko pita nursing staff ke same nange hoke ghume polic ki gadiya jala Di or hr jagah thuk the h TB Tu chup kyu thi. Dayan h Tu or tujhe nind kaise aati hogi desh me nafart fela Kr Kahi Tu Muslim to NHI Jo hamesha Hindu se nafrat krti h or tujhe agr Hindu se itni hi nafart h to chali na Pakistan waha tujhe pyar milega or India me Gali kyuki Tu ek number ki kamini h msjhi Jo desh virodi bate krti h.", "sa_1315_": "Chi bc 🤮🤮🤮", "dheeraj_nikam": "🤮🤮🤮 @reallyswara", "straightfmheart": "🤮🤮🤮🤮🤮", "siddarth_kumar_singh": "Nagin hmesa jahar hi ugalti ho", "yourdailyfantacy": "😢😢chhiii kya lgti Tu Rey chudail", "abhisheksingh888555": "Kalyugi manthars", "__.abhishekkk.__": "Tauba Tauba Sara mood kharab krdiya", "richa.kathait": "Makeup Mai aisi h toh Bina makeup ke toh .....Kya he bole", "rushikesh_kalbhor__": "Chudelllllll", "sood946": "Or ek naya suno jitni b shaheen baag ki sherniya thi jo bjp ke virod ma thi ajj 500 500 lene ke lie kutiya ban ke line ma lagi h or wid documents 😂😂😂😂😂", "mani_babu1": "@reallyswara कुतिया", "singhjones": "Sali hypocrite hai tu sabse badi 🖕🖕🖕", "vivekjoshi6662": "Chiiiii... Kya dekh liya ye 💔", "ayubkazi": "Aap ko kudrat ne kuch diya hain.bina make up bhi 👌ho", "_harshal_cr7": "Agar phone naya nahi hota to idhar hi screen pe mutt deta main...", "confession_of_xavier": "@reallyswara jhtt ki Lodi koi movi de nhi rha to serculizam KR rhi mdrchod tu asse gali khugi mdrchod Muslims k lund leti h tu tbi", "amitmalokar": "Gali khane ke liye babita phogat se panga liya.. what's ur contribution against India (fingering video in a movie)... lockdown mey kagaaz dhundo..dikhane to padengehi.", "sfghjkfffdde": "Kitni shakal ki kutiya", "vivekroy7609": "Hijab dal leti", "krishna.___7": "Chutiya salli", "rohika11": "I'm ur fan... But plz u support hindutva also...", "rathor550": "मौलाना कि औलाद।", "mqr9942": "In times of universal chaos, telling the truth is revolutionary act... You are revolutionary and the revolutions are the locomotives of history.", "mr.brajeshjhariya1326": "Mere doggy ki potty bhi tumhari tarah hi dikhti h🤣🤣", "goyal_94": "Makeup ke baad ye hai normal to maar hi degi chudail🤣🤣", "r_0_h_i_t_dd": "Mand buddhi swara Baskar", "yogichauhan7": "Paid librandoo", "rthakur.91": "Iss desh ki 40 saal ki Yuva actress 😂😂😂😂", "pagal.premi.deewana": "Aunty", "ravi.tiwari.9461": "Flop Actress 😂😂", "adi_.nawab": "As always 🤢🤮", "manish_yz": "Phir bhi acchi nhi lag rahi ho", "honey774442": "Cheee chee kya dekh liya... guh aurat", "v_i_kk_u": "Gawaar pakistaan chalie jana", "raw_at_8395": "Didi wo Shaheen baag wala look toh bano Kabhi!!!!!", "aman__1597": "@babitaphogatofficial ko gyan dene wali.. Babita tere tarah kapde utar kar paise nahi kamati... 😂😂😂😂", "ramyadav_12": "jhat si sikl ki lodi deshdrohi saali teri maa mr jae", "theakshayrai1": "aaaaakkkkthhhhuuuu😂", "mr_krunal18": "Teri maa ki bhosada", "surajit5749": "Randi ki aulad sali", "__its_sudhanshu__officiall": "Ha sahi bhi hai...Makeup k bina koi jaldi pehchane ga bhi nhii", "rithwik_singh31": "Tujhe Hindu virodhi hone mein itna hi maza aata hai toh bool de mein kuch Mullo ko tere paas bhej deta ho chipdi", "a_l_t_r_u_i_s_t": "Are bhan ki lodi .. heejada si", "educated_berojgaar": "Swara.. you're our role model and our inspirational personality.. Please take care of yourself.. n we love you a lot. ❤️❤️❤️", "kunal_8615": "Abhi bhi bakwaas lg rehi hai tu😂😂", "utdu20": "@reallyswara You look like a guy !! Career start hone k pehle hi doob gya🤣", "_black_code0_": "If \"GAAND\" had a Face 😂😂", "clairejackson07": "You look like a piece of shit anyway you bloody twat", "kirit_vekariya2001": "Jamati sali", "memes_wali_bandii": "Makeup krke bhi kutiya hi lgti h☹️☹️☹️", "bickie31": "Kitne paise leti hai mullo se", "utkarshsoni_001": "Randi sali hat", "salat.amit.1": "Very beautiful so cute and sweet lovely smile", "_prt_shah": "Swara bas kar 😂", "anil_kapor1989": "Chudel ...", "akansha_tiwari19": "Chaar chavanni ghode pe swara bhaskr mullo ke lo.....", "_rahulsharma18": "Bina make up ke dekha bhi nhi jata tujee😜", "iamvicky_00": "Tere se acha mera toupa h makeup kia", "hustle_up_mandy": "HEY Aunty!!", "devilqueen947": "Dharm ko mudda bankr nanga nach krna koi inse sikhe 🙌 jamatiyo ko baap smjhti ho ya bhai ya kuchh or ?😂", "koushalsharma93268": "Veshya", "negi47ps": "Thu h tere pe", "sunitarawat424": "Fir bhi gu lg rhi😂", "mrigank_b": "Chutiyo jaise sakal iski", "rahul_9mishra": "Delhi police ne nahi di usne saaf mana kr dia tha aur usne video dikha ke bta dia hai theek hai", "j_o_h_n_y_choudhary": "💩💩💩💩💩💩💩💩😂😂😂😂", "nirajpandey217": "Ye to tatti hai😂😂😂😂😂😂😂", "komal.tandon_": "I wish insta especially swara k account k lie dislike option add kar de", "abhaysinghpariharabhay": "🤣🤣choootiya call girl😂😂", "aarjunsingh7617666": "Make up krkr bhi tu mere lode jsai hi lg rhe h yakken na ho to loda bheju", "sanyamjain16": "ohh bhai ye kya tatti dkhli🤮🤮", "amd4433": "Stay home stay safe❤️hope all is well there👍", "the_rishiii": "Hiiie randiiii", "bakchod_.bhaiya": "@reallyswara tauba tauba sara mood kharab kar diya... Ekdum manhoos lag rhi ho aunty 🤣", "m_ay_ur": "Tabligi", "meera.rajput_": "Najayaz aurat", "navinsrivastava40": "Your name should be surpanakha because you looks like and behave like same ........ Aag lagana, zeher chodna", "akshu_0.0": "Chutiya sali", "rayzdap": "डायन😂😂😂", "ajaysingh_2021": "🖕", "nav_141294": "She put lot of makeup to transform herself from ugly pig to notmal beauty!! 😂", "monikatiwari952": "Ain't you donating anything now?? Bloody hypocrite bitch", "mohammad_bin_qasim_al_tehrani": "#boycottswara", "kaushikroshan98": "Sali tu Etna bol rahe the na ab kya hua. Muradabad ki kand pe kuch bol. Faltu ka bakwash karne wali", "ajpawar14": "Otho pe land ragda hai kya ??", "priyas4635": "Swara aunty..😂😂🤣🤣🤣😋😂😂ye sahi h mjaa aa gya", "sanchit683": "Fir bhi CHODEL he lag rahe ho..", "d12021998kgmail.com_": "कैसे है साथी", "agnihotri.lovish": "desh drohi hindu dharm ke bare to bohot boliti hai tabliqi samaj tere iine baap jo desh me corona fela rahe hai ab kyu nhi bolti..", "riyazshaikh756": "nice", "piyu.m74": "U Still look ugly as fuck..... I pity that person who gave you chance in Bollywood.... 😂🤣😂🤣😂🤣", "mohinisingh231": "mera din kharab hogaya iski shakal dekhli 😥😥😥", "shivangi7003": "Dayan chudail", "impappu530": "Show me bobs and vegana", "el_duderino21_": "According to world population studies, approximately 108 billion people have lived on this planet. Assuming that the average lifespan of all these people was 25, there has been around 2.7 trillion years of life, if we multiply this by the number of days in a year (365), there is a total of 985,500,000,000,000 days of life (985.5 trillion days). Not once in any of those days did anybody ask.", "_npadhiyar": "NPR OR CAA ke khilaf kuch malum to hey nahi chali prvachan dene. ABP news ke interview me to bolti bandh ho gai thi na aunty frndz ye link ko open karo dekh na is me swara ki insults ho rahi hey 👇 https://www.facebook.com/CommunistMuktBharat/videos/226533905053536/", "ankurgautam": "Just came to write Bitch please", "abuzarraj68": "Apko dekh kar proud feel hota mam aapko dekh kar pata chalta hai ke apke parents ne apki parwarish bahot ache se ki hogi jo insan sirf likh ne taqat nahi rakhta apne bolkar aur karke dikhaya against NRC I Love You❤️", "kangen.water.global": "Liberandu nahi tu Gaandu hai", "i_am_anurag._": "Career khtm apka 😂😂", "chandan_1223": "Ab jubaan Kat gai hai kya bolti hi nahi", "_brokenyoungs": "Fucking jamaati bitch @reallyswara", "covidmeemees": "Laugh at Coronavirus with @covidmeemees", "anil.ku.mallick": "Dayan😂😂😂", "shrinathgejagee": "Kya tatti hai", "karan_rawal24": "Abe bhosdiki shakal dekh apni aisa lagta hai kutta moot gaya tere mooh pe Gandmari ki bachi 🤣🤣💩💩", "virxj10": "Yuck. Absolutely sickening", "chiragguptta": "Pakistan mai maa chuda na randi bhen ki lodi", "corn_shonnery": "When the plastic surgeon asks you to pose for the after pic🤣 #tukdetukdegang #plasticsurgery #nosejob #suarbaug", "dharmveersambha": "मेकप बिना अच्छी लगती हो", "shivanisingh.svn": "Madam chaliye aap kaise chup hai aap kai sasural wale sb jail ja rhe jmati log...jaiye unke bare mai bhi boliye🤪", "saurashmi": "Super cute swara..u r an inspiration🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌", "iam.vickyjain": "मेकअप के बाद भी खतरनाक 🧐🧐🧐🤣🤣", "abhimanyuarunpimpalwadkar": "U know wat....even m not a bjp supporter....I make it a point to question wen it's wrong by govt....even knowing notjing about caa and NRC u opposed it...which is ok....u went to Shahin bagh ....that's also ok upto an extend....but then keeping ur mouth shut wen police are hitted, suicide bomb plan by Majras Islam shows ur orignal personlity....shame on u swara....utter shame...", "vilasdhavale83957": "❤️❤️", "md9540554497": "मैडम भास्कर कुछ भी कर लो आएगा तो मोदी ही😂😂😂", "bhushan1489": "तूने कितना दान दिया रे देश मे विपदा आने पर, CAA के समय तो बहुत भौंक रही थी तू, आज जब ये तब्लीगी जमात वाले देश मे कोरोना फैला रहे हैं तब तो तेरी आवाज़ नही निकल रही, धिक्कार है तेरे जैसी औरतों पर।। सुवर साली", "fancy_silver_payal_agfbs": "स्वरा चूसकर जी अपनी बीच वाली उंगली का एक फ़ोटो अवश्य दिखायें सबको देखने की चाह है 😂", "tonystarkhubc": "Allah maf kre tauba tauba sara mood kharab krdia...", "vicke149._": "Kyu itni gaaliya sunti ho didi", "indian_models1122": "Iski Pic dekhker Kya lagta h..Guy's My One Word Bhootniiiii + Desh Drohi", "star_amit8030": "aaj ungli ki hai lgta hai desh drohi gaddar", "rahul__sharma__": "Hey asshole pls show me draft of NRC tht u continuously barking in debate or in fucking protest ....u fucking liar ,don’t bark in public becoz we aren’t even interested to see u in tv or in live ...becoz you just doing these thing to get a ticket from opposition parties in elections, we all know you fucking brain ideology so shut the fuck up asshole 🖕🏻🖕🏻 @reallyswara is piece of shit", "farjiaashiq": "🤮🤮🤮🤮🤮", "twitterpatedfemme": "Placard kaha gaya didi apka", "aziesmohammed": "Bin make up ! It's natural beauty. Same like heart♥️", "alpesh6477": "Bahen lagti he bhai chodo bc", "creative_vijay7": "😍", "saquib6553": "Wow", "avaniparihar": "Aaj kyu nhi bahuk rhi hai tu jab Delhi me hua tha tab to bada boli thi tab to to meri ko ikhatha karke legayi thi kutti ki aulad , muslamano ki aulad ! Ab kyu nahi bol rahi jab un bechare police valo par tere baap dade muslman pathar mar rahi b kitti sali aaj kis gosle mai chupi hui kutti wali", "gulshan_gsr": "Makeup se fursat mile to thda sacchi secular ban ke ,jamati , Moradabad,indore ki ghatna pe Prakash dalna.. maulana shaad ke baare me kuch bol skti h😂😂😂tu ye kare gi nhi q ki tu fake secular hai,Wahi se to roti aata h tujhe", "akshaykumardiehardfan1991": "Uddav Thakre ke upar itna pyar kyon a raha hai vo toh hindutva ko support karta hi aur Tum hindutva se sakht nafrat karte ho", "the.adultworld": "Boycott her, iski koi movie nhi dekhunga @reallyswara , sh#me on u 😝😝 by the way CAA ki full form toh bata do 😝😝", "a.n.k.u.s.h_c.h.o.u.h.a.n": "Fir bhi aisa lag rha hai jaise kutte ne muut ke chod diya hai aunty 😂😂", "nitantsolanki": "Aaj khush to bohot Honge,Wo Rangili ka account block ho gaya hai🤣", "about_to_fly": "O God, corona kya kam hai jo ese dra rhi ho sabko", "saumyasingh024": "Mam can u pls share some video of yours convincing iur fellow citizens to stay in homes...not cime out or beat those helping and working gor ous.... u r influential personality... may be kuch log apki baat behtar samjhe", "anujphg": "Jitna makeup karna hai kar le fir bhi kutiya kutiya he lage ge 😡", "salmanali56731": "Kaisi ho aap", "taranglahare": "❤️❤️", "the_beniwal_arvind": "Where r u now when doctors attacked by a special community, where is your love for country. Say now that constitution is in danger, are u not able to see it", "surajrawat100498": "Tatti🤢", "yudhveerrajput": "Swara ki duty corona sankrmit jamaatiyo k ilaaz mei lga do hospital mei .... Swara bhi khus jamatiye bhi khus 🤣🤣 ...", "abhijatmohapatra": "Shame .....Shame .....Shame ...GOT S5 Last episode", "msgupta06": "@reallyswara brainless lady learn something from him @beingsalmankhan", "gagansingh2243": "Hi aunti👏🏻", "amitshahnextpm2029": "Aur lawdi 😉😉", "pristineluv4eva": "Y u r not supporting ur country nw??? U r always ready to raise antinational slogans na .?? seriously feel pitty on u...humesa tum strike pe he Beth jaoge ...but wen country needs ur support u r posing ur nonsense pics ...", "chowdharysatyajit": "kya bkwas lg rhi ho..", "srajan_mishra_ji": "@reallyswara थोड़े शब्द मुरादाबाद indore में हुई घटना के लिए भी निकाल देती बहन.. या सिर्फ़ ये नकली secularism का परदा ओडे रहोगी... कभी पत्थर बाजो का समर्थन कभी CAB NRC का विरोध साबित कया देश भक्त कभी माफ़ नहीं करेगा थू है तुम जेसे लोगों पे करना चाहती हो तुम.. कोइ माफ़ करे ना करे एक", "debo.biswas_": "@vibin_0708 comments 😛", "vicky.tak": "तेरी मां का भंडारा लगेगा चूत का लॉक डाउन के बाद 😁😁", "shrimarai\nVerified": "Verified", "hows_the_josh_jai_hind": "Pakistan ideology mind swara randi", "om_borana_07": ", मेकअप तो कर लिया फिर भी फिर भी कुत्तिया लग रही है नेहरू की नाजायज औलादे", "inayathusean": "❤️❤️❤️", "rahulsinha_94": "Ooori maiya ye kya dekh lio re ... shakshat dayan 🤣🤣", "786abhi.shek": "Bhai tu ldki jaisa kyu lg ra hai???", "shashank8846": "Pm care me or garibo ko khana kilaya ya nhi ? 2 month ago phele too ap India ki jimmedar nagrik Bn rhe thi?🤣😂", "name_is_singh_saab": "Jaise bat krti h vaisi sakal bhi h koi bat nhi.", "akshay_akki77": "Yeh vhi h na jo doordarshan pr toilet saaf krti h😂😂😂", "sh.ivani1716": "😘 beautiful", "siddique.haidar": "❤️❤️❤️❤️❤️❤️❤️🔥🔥", "praveen_acharya4444": "Raand 😡", "ayaz.shaikh1985": "Ma shaa Allah khubsurat ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "ramkumargahlot": "Are aap zinda hai", "abhinav__oberoi": "Kya bey randi pehle apne bhai behno ko samjha mc", "shubh2893": "Are oooo Suar ki shakal Aunty...Moradabad Mai Doctors ko patthar maare hai......par tum yahan apna suar jaisa chehra lekar photo post kar rahi ho....Agar unki jagah Muslim hote toh Tum Jo ki double standard aur ghatiya kism ki aurat hai...Sbase aage khadi ho jaati aur bolti.....This is intolerable.....Ab Kya ho Gaya...? Apne Naagin ke bill se Nikki aur kuchh toh bolo...logo ko apne liberal honenka saboot toh do...ki tum liberal tabhi hoti ho jab Muslim affected party rehte hai.....?....", "jaldeepshah": "D", "rizwanreborn2015": "Yeh chand sa roshan chehra...zulfon ka rang sunahra...Dil ne jo dekhe jalwa-e-husn yaar ke laya hai kaun tujhe falaq se utar ke❤️❤️😍😍 @reallyswara may Allah bless you dear", "aakaash_soni": "Bilkul hi kutiya jesi shakal or soch hai teri..", "hey_its_piyush_": "Mujhe nahi lagta ki tujhe ye shiksha teri maa nee di hogi...", "_the_lucifier": "Ulti aarahi hai", "mohammadubaid16": "😂😂😂 maim comment box ki parvah krti hai ya nhi ap", "xahaamit911": "Maan toh krta hai sara din isko gaali du...lakin doordarshan channel ne iska toilet wala add dikha kr dil khus kr deya.🤣🤣", "mr.shutterking": "https://youtu.be/o5HpIthSOxE teri maki chut ab dekh le moblinching", "farhan.iraqi__": "Coronavirus never died in human body!! click to watch full detail about Corona in hindi the facts you never know about Coronavirus https://youtu.be/nc2zPrdd2p4", "the_religion_universe": "DAYAN LAGTI, TATTI JAISE💩💩", "mdjakiransari": "Nice look", "akashgolu123": "Haan raandi make up kr liya h ab aao tere muh pe mutt maar de 🤛💦💦💦💦 aur mere Kutte hug rhe h usk lep lga de raandi", "akarsh.pandey.790": "Ultra ugly", "deep_veer_4444": "😍😍😍", "javedakhtar233": "Very nice", "motordestination4": "Swara tera earning kabhi nahi rukhta nah.... What is ur income source ur not an actress how u earn money....", "nazeer9690": "No wonder words .kind people always look kind.", "___b_e_a_s_t______": "Suar ki aulaad", "mandeep_ghogiyal": "Girl Pakistani", "iamparthamaity": "Make up karne ke baad bhi aisi dhikti ho?", "varunishappy": "Apne bhaijaan log k against kyu kavi nahi bolti jo doctors and police pe Attack kar rahe hai.", "deepdel_2006": "Hope is a decision. Accumulate treasures of the heart and it will all sort out guys", "taj25121969": "I respect u lot bcz of ur humane value", "mustak_tailee": "Don’t care for external beauty, your inner beauty is amazing", "vivek_game_changer1": "Jai bhim 💝", "nomadic_jane1188": "now acknowledge the incident of .. Moradabad.. wat are they doing there...see in the news", "shroudd010": "Bandra me jo hua n jamaat k logone jo kiya.. in sabko aap hi supprt karti he ... aapke gharme corona inke through aaya na fir samjhe ga..... Humare indian muslim bhaiyo ko na bhatkaaye plz", "ankit_19035": "Kachra 👌 swara bhaskar kuttiya hai !!", "roadside.romeo.loves69": "Ungli bhi karle make up ke sath👆👈👉👇☝️✌️💦💦💦💦💦", "shafiabedin007": "😍", "kansagra_vaibhav_patel": "આજ નો તારો સુ ભાવ છે", "d_drug_07": "❤️❤️❤️❤️❤️❤️❤️❤️", "prakash71091": "looking😘😘😘", "malala_ka_halala": "Jihadi rand kab mu kholegi aise kitna paisa milta hai molviyo se ??", "sultan_mirza456": "👌👌👌👌👌", "kapse_mahesh": "Lockdown mai ungli kr rhe h na ....", "indra.ya.nahi": "Hi maam. I am from FullStopp, a student led organisation promoting menstrual health awareness and women empowerment. I look up to you a lot, and was wondering if you could help us out a bit. Please check your dms, thank you so much!! xx", "110ayan": "Looking soo beautiful ❤️😘😘", "dasspurushotham": "Always Cheerful. Best Wishes.", "yadavyadav82": "@reallyswara tere najays bhai aur tere najayas baap doctor pe thuk rahe hai ab kyu chup hai ..... Doctor ko manav adikar nahi rehte hai kya fir tum jaise atankwadio k he manav adikar hote hai dalli bol ab kuch", "estabaan1": "Chut me ungli kar jaake", "tansworld": "Uff.. Rasbhari lag rahi ho aap..", "beingshadabkhan2": "Wow beautiful @reallyswara diiii👍", "prakash.kumar.18041": "शाहीनबाग़ बुला रहा है", "meamanverma": "Dayan lag rahi he", "rahul0405gupta": "देश की 75% जनता आपसे नफरत करती है सर्वे करा लेना, तुम्हारी हरकते बहुत ही निम्न स्तर की होती है l वामपंथी एंटी हिन्दू लोग भले तुम्हे सपोर्ट करें लेकिन फिर भी तुम कभी उच्च दर्जे की हीरोइन नहीं बन पाओगी l", "doneld": "❤️", "akshatdeshta": "Cute", "rahmat09323": "🌺🌺👌👌 Supar Monaliza", "akhter2401": "Hi swara ji. Where is your Changez", "ameyabajaj": "अब भी हिजड़ी ही दिख रही है", "its_4048": "❤️👌👌", "bhoi_priyabrata5": "luv u swara mam❤️❤️❤️", "rintinintin": "Fuck off 🖕🖕🖕🖕", "aakanksha8492": "Chudai lg rhi hai tu khati bharat ka or gungaan mullo or pakistan ka Karti.gawaar", "yuvrajsinh_b": "Pehle tu saheenbag jati thi! Ab vaha se uth gaye to kya vo tere ghar ate he? @reallyswara", "_._.neeraj": "Ek baat bata draft kaha hai ???? Teri gaand me hai kya chutiya aurat", "_shaheerakhan_": "Beautiful❤️", "mendonarunkrishna81": "Hii hws u JNU student🤣🤣🤣", "mahavishnu_theallah": "@reallyswara suarathe gaddar chutiya raand one like =one laat on gaand to suara bhoskar", "9_2_5.memess": "https://www.instagram.com/p/B-_hi0qh-8x/?igshid=dgnarnm0qko5", "punditrulez": "Hmmm,suck see", "mtasleemsiddiqui": "❤️❤️❤️❤️", "rohitraj523": "Wowww..nice", "deepu.mishra121987": "Self love 💞😍❤️", "mukeem.ahmad.7568": "🔥", "trendyy_zoop": "Ab to jyada Dayan lagne lag gai ho😒😒", "ikartikxo": "Still auntyyy😂", "g.saqib.7": "Looking awesome swara ji💪", "imqaisar15": "👌", "sibasisdutta": "Phir bhi dayan lag rahi", "abhisheksoni4719": "दिमाग से पैदल नाम है जामिया की बाजारू औरत शाहीन भाग में खड़ी हुई नाम है बेस्वरा भास्कर", "chandan_thakur_93": "सूपनखा और तुझमें कोई अंतर नहीं", "amberbindra": "😍😍😘", "maitreyan86": "❤️", "mashruvikram": "🔥❤️😍🔥❤️😍🎻🎻🎻🎻🎻", "sarcastic_dude01": "Bhakt to swara- go to pakistan😂", "khinchamega": "Gorgeous as always 👌👌", "ndmhassan": "❤️", "harshal_surti": "Hindustan se mera rishta kya la ila illal lha", "being.vaibhav.tomar": "Desh drohi", "farzan624": "Im watched Ranjhana u looking awesome", "mohdshad18": "Khooooobsurat", "nirmal2581": "Cuty😘😘", "royalrajput_aman": "Sare muslaman tere ko swara ji bolte hai 😂😂😜", "toyasiin": "❤️👏🙌", "subhajitsaha.1430": "Pak ki kutia", "karan.chouhan.5249349": "Lag to chudel rhi h", "rajesh.dewangan.14203": "💗💗💗💗💗", "aziz5462": "Nice", "amirraza_khan": "👌👌💕😊", "suraj.mishra39": "Are...aap desh bachane nahi gayi???", "vidhi_sai": "Kagaj dhund le tu ab tera pichwada laal hone wala hai 😂😂😂", "santhoshkumarkolkunda": "Good to see madam the actress with heart, Jai ho Madam 👏👍", "namdevorahul": "🔥🔥🔥", "parveen6132": "Impressive... n sooo smiling...🤙", "naresh982810": "My fav and daring girl..", "vishalkr.msk": "कलयुग की मंथरा", "r_bhardwaj1992": "😘", "amita.bhalla7": "You would look nice with or without because you are beautiful inside and outside. Don’t let some of these ill informed people get you down, for like Christ said”They know not what they do”. I am a big fan of your acting skills on screen and personality & mindset off screen.more power to you.", "ashish_pj_17": "Makeup karne ke baad bhi itni bhayanak dikh rahi hai", "wasim_akram_bunty": "❤️🔥", "h_wasimul": "👍👍👍👍", "kakaa1971": "Miss beautiful❤️😍👍👌🌹", "rupeshsingh201087": "Mad girl", "zardariasifkhan": "Masha Allah achchi lag rhi ho ❤️❤️❤️❤️👈", "atul_2809": "🤮🤮🤮", "rahul.barachh": "Accha hua kar lia,nhi to chudail lagti h log dar jate h...", "mau.lana_786": "Apni pyari si pishaab wali jagah ka deedar krwa de mohtarmaa", "javedkhanr24": "Brave girl' 🔥", "nonsolus_abhinav": "What do you make up for?", "farooqsyed13": "Awesome appearance 👌", "simithegoat": "Like you for your stand", "monu_kumar007": "Nahi mtlb abhi agar bandra ki jagah bhid up mai lgti to khaa jati tu. Dayaan", "manzoor5495": "❤️ Www.cpsglobal.org", "nikhil.naruto.anand50": "Kyon hi make up waste kia??", "manav.9999": "randi 🖕🖕🖕🔥🔥😂😂", "mohammadzaid3254": "nice swara 🌺🌷👌", "aqib__khan09": "🔥🔥🔥🔥🔥", "ntrtalyani": "😍", "thisischirag_": "Wow", "shuklamarut": "Itni hi English mujhe bhi aati h 😢😢", "gaurangjoshi1987": "1 number ki chinaal lag Rahi hai sali gatiya aurat", "mohd.infho2018": "❤️", "javedakhtar953": "Nice pic", "shre4508": "Ur looking so pretty", "adv_ajay_kashyap": "Mil aati makeup kr ke unse b", "ashpat007": "Yuk", "hussains4139": "Gjb", "oneofakind.2169": "❤️🔥", "hamidkhan1964": "Mashallah fabulous", "ari_pagis": "💏", "shaikh_shuaib": "Are anaar...😍", "manjaralansari": "Beautiful", "_shiva_chandra__": "😍😍😘😘", "santoshsharma6669": "Kitna bhi makeup karlo bhetar vse tu kali hai nirlaj", "priojitkeisam": "Plastic surgery horribly gone wrong 💩", "arab_n123": "😍😍😍😍😍😍", "aliyasin7814": "+", "sandeepkk329": "Appe Abba jamatiyo ke liye Kuch bhi nahi bola itte bada kand kar Diya Unhone pure desh me Kuch sikha to deti Inhe", "iqubal.jawed": "✔️✅", "mohd.kalam.01": "So cute madam ji", "samrat086": "Why you are so quiet these days???🤔", "akil.salmani.5243": "Hi🔥🔥🔥🔥", "azimk7173": "Beautiful pic mam 👌", "kbalasubramanyabhat": "Intellectual n sensitiveness blended", "muhdilyaas25": "Hi swara tum mujhe behad Pasand ho .. so big beautiful you", "shussain5696gmail.com2510": "Lovely ma'm", "pavitra.28": "😍🔥", "anukeshh_sharma": "जब किसी इंसान की सीरत दिल से उतर जाए तू सूरत का कोई मतलब नहीं रहता", "_s_k_raees_official_04": "💕", "rizvianjum": "🤩🤩🤩🤩🤩🤩🤩🤩🤩🤩", "rituraj_singh22": "Fhir bhi aap suvar hi lag rhi ho", "salim_saiyed": "So beautiful, gorgeous 👌", "sbspbr": "❤️", "raoafaria_rks": "Bhoot", "rishijain238": "Go to pakistan you bitch", "atifjaved007": "From dream (girl ) to heart because we love this type of anti national 😁😁😁😍😍", "a.r.v_official": "@reallyswara aaj apne make up kis umeed se kiya😂😂😂😂", "jawedsikku": "💋💋💋💋💋💋💋💋💋👆👆👆👌👌👌🌹🌹🌹🌹🌹🌹🌹", "sofiarahmanafzal": "Looking pretty Always Angel", "shanzukhan": "Haye kya lag rahi ho ap soo beautiful ap Bollywood me sab se agal hiroin ho", "priya_verma8641": "Aaj ghr akli hu ajyo nuds video call 😢😢😢😢😢😢😢😢😢😢😢", "santoshpainuly2": "nice👌", "munaz_siddiqui": "🔥🔥🔥🔥🔥", "shivangi_raina111": "Awesome😘😘😘", "akanksha_tripathi18": "😍😍😍", "nazirshaikh9089": "❤️", "mjd_mhd__": "Apto bina makeup bi khubsurat dikhti he👌👌👌👌", "ahmdnzaft02020": "😂😂😂😂😂😂ok", "the_aks85": "One of the top fake person in bollywood @reallyswara . Shame on you @reallyswara stand lena hein tho sab par loo. Jaha kuch footage ya fir publicity milegi vahi par bolna hein kya? Waise bhi sab accha nahi dekha jaata duniya mein. Kuch tho gaandagi chahiye kuch logo ko @reallyswara . Kuch accha kiya tho bolte bhi jao", "ridhi234": "you are so inspiring , i really like you , also when you strongly give your opinions on matters such as CAA, islamophobia", "shadab.insta": "Bholi surat Ko sanwarne ki zarurat kya hai.....Saadgi bhi Qayamat ki Ada rakhti hai...☺️☺️", "sanjay.mehta_": "❤️❤️", "pappubhai786786": "Swara..kaisi..ho..aur wo tumhare bird ka kya huaa..jo tum raste se uutha ker layee thi..sach much tumne wo bada hi neak kaam kiya..Really you're great👌", "shoaibvita": "Nice pic🌹🌹🌷🌷", "vickeybansal7": "My Twitter I'd @guddu458 please fb", "rachit.m": "Didn't look like😂", "tofik_vepari": "so cute pic", "hussain_saleh72": "lovely 😘", "bad.366": "Sex worker", "drpradeep44": "❤️❤️", "noor_khan5026": "ma'am decent looking like", "akanksha_goutam311": "Swara tu to raand h ree👊", "shahaji_shejul": "सुवर भास्कर", "habib0709": "Belated happy birthday @reallyswara. You are an iron lady, inspiration for millions, stay blessed.. Stay healthy..", "kitttypie": "Thu thu thu thu 🤬🤬🥵🥵🥵🥵🥵", "786shoaib786khan786": "Ye ek esa chera he jisko dikh kar bhut se logo ko din me tare najar ane algte hen", "kiritcd": "Yak nahaya kar aunty", "sanwar.35": "❤️❤️", "_issue_4643_": "Theek se hua nahi kya ?", "hidenleaf6": "Love ya ..💖💖", "nazimkhan9961": "Beautiful ❤️❤️❤️❤️❤️", "parwezjamal05": "Aapki inner beauty sab pe bhaari hai.", "maniyar0551": "Laal sallam", "subhrabrata": "Dil pe paatthar raakh ke?", "being.archit": "Paper dhundh le 😉", "smiley69lol": "Aaaaak thoooo💦💦💦💦💦💦", "ashishbaghel56": "😂😂😂😢😂😂", "zillurrahmanfaroqui": "👌👌👌👌", "sanchyetadebabrata": "💕😍💕😍💕😍💕😍", "axatsan": "♥️", "pushpendra.sen.144": "Khana ni kha rh ho ya muda ni mil rha bjp k khilaf😆😆😆😆😆😆", "markbennington": "🔥🔥🔥", "dineshsinghbisth": "Kagaz toh dikhane padenge n seriously luking like shitttt🤮", "shekhnayyare": "Long time not see you swara ji 🌹", "atif9766": "So sweet i love you 💓💓💓💓💓💓", "navin_kamble369": "😘🔥", "ruhisista": "Tabhi randi dikh rahi hai 🤣🤣🤣🤣", "sktabrejquadri": "Beautiful ❤️", "qadaneesh": "Nice one...", "anaseem010": "Beautiful💖💖💖💖", "anoopdoit": "Chin@l lagti hai.", "vijay.3864": "Kalyug ki manthra😂", "rahulsinghr441": "😍😍😍😍", "robertsalvadordsouza": "😀😀👌👌", "kd.sngh": "Bharat Ratna de diya jaye make up karne k liye 🙄🤔", "samir_siddiqui_77": "Cool😊", "shahnawajzaid092": "Nice look mam aapki face beauti and smile bilkul naturally hai mai aapki kaee movie to 4 4 times dekha hu acting bhi aapki kafi achi hoti hai lekin aapko modi bhakt abuse comment kareinge kyo ki aap bjp ke against hai isliye ham aapke sath hai", "mr_shaikh653official": "Osm.... 👌", "khan_sakib5": "❤️❤️❤️❤️❤️😍😍", "arefshaikh8388": "So beautiful looking ❤️❤️❤️❤️🔥🔥🔥", "dhruvayan": "Mera lawada chusle🍑", "a_f_hussain": "🔥🔥🔥🔥", "dil.bag.singh": "Beautiful", "aslam9391khan": "❤️", "habibullah121": "Sweet", "im_rakesh_singh_": "Coronaa virusss jaisaa manhoosss muhhhh", "tasnimahmed_qatar2022": "So sweet"}