{"sahay783": "Billi v janti hai kaisi aurat hai ye😂", "the_shikha_chandra": "One thing I have learnt from swara \" If you are not doing well in your area, start protesting against the govt. It will keep u in limelight\" . Thanks for the learning but no thanks 😁", "vps.vinay": "Modi ke against me hi kuchh likh rhi hogi", "live.love.laugh0931": "Jnu walo ko mail bhej rahi hogi..kanhaiya ko miss karti hogi", "isupportyogijii": "Abey tattuo ki laila ... sorry sasti laila", "sakshi_shukla13": "Tujhe kya kaam hai😂", "parassharma521": "WFH seriously tum to berozgar", "funwithamritanshu": "Computer chalane nahi aata hai inko. Ee sab jhuth hai", "ravii8138": "Ye caa or nrc pe search kar rahi ha fir bhi sahi se pad ni pa rahi anpad aurat ...@reallyswara Pakistan ki.agent", "shubhampanditji442": "Aunty app deshdrohi ho 🔥👍", "adeeba_khan___": "❤️❤️", "methelegaleagle": "So much drama🙄", "shreyasingh47": "Maam why don't u go in support of caa u must be feeling lonely at home go nd support dem who are spreading this shit and making are lives miserable some ppl had exam some had jobs all are sitting at home coz ppl live u go nd support these shitty ppl who afterward spreads so dangerous things in society ... #shameonyou", "mishra1349": "Wht the hell !! Work from home!!?? Really..mujhe laga tumhra kam bss bejwajah bhokna hai", "utkarsh_nigam_": "Happy birthday 😛🙌", "rahulshaah": "Ur cat wanna type...😆😆😆", "kumarvinay10": "Didi aap billi se chud rhi ho kyy", "aamna_nosheen": "@easmaahh @humaira9129 yeh cat to lgta hy main hun 😈😂😂😂🤣", "aryanrane20": "Any right wingers here ???", "jamaican_monster": "@reallyswara BOL MODI JI ZINDABAAD💯 @narendramodi", "toshi_tripathi": "what abt jamatis?? not telling anything 😂 chup ho gye kya hua Savidhan khatre mein ni pad rha ab", "sujaerwin": "Behold the clawwwwww!!!💅", "vicky_rocking12": "Movie kar lo mere saath ek AA wali. Maja aa jayega kasam se", "rudrasmt": "😂😂😍😍", "kishankumarr12": "@ani_mojo 😂", "zaraaaaaaaa_lifeeeeeeeee": "Majedaar billi😂", "i.devendra": "U r getting work🙏🙏😓", "shivam.mittal.7248": "Billi s daro jamatio s nhi😂😂😂 wtf bhnchod", "kartikvispute": "Rani manthra😂", "aaditya_acharya97": "You got old macbook pro, change it.", "varsha_rai_006": "The most dumbass actress Bollywood comprises of....I don't who the hell wastes his money in casting u", "ruchika.47": "@briacp14 😂😂", "son_ziivanee_official": "😂😂😂😍😍🥰🥰🥰🥰🥰🥰", "rahela_banu": "This is just adorable", "allisultan": "Same problem here also swara 😉", "imsavinay": "Looks like ur pussy is crazy af", "dayanandp11": "Ooo chutiya aurat kha gyi ab jb tabilig loga maa choda ra hu ab", "mr___samrat__": "Tu th nalli hai tujhko work from home ki kya jarurat😹", "tulip3448": "Work from home ? You mean spreading fake news / anti-govt thoughts on social media ?? See how desperately that cat is trying to stop her, even she has got better sense than swarona ra*** bhaskar", "_kunal._thakur": "Aap kaam bhi karti hoon mujhe laga bakchodi hi aapki kalla h🤣🤣😂😂", "tusharnxxt": "Hey fucker🖕🖕", "abhishekkumar887700": "Madam kuch donate kiya sare sector donate kiya film industry donate ki aap.kaha hai ab desh khatre majn nahi hai kya", "sanataniiii_": "Laptop pe betke bomb bana rhi hai kya Bhendkilondi", "abhi__pandey26": "Kanahiya Bhaiya mo mail Karti hue...... Ki \" Vo kaagazz Vala game kab resume hoga\" ...🔥🔥😂😂😂😂", "priyaseigell": "@saloni_seegurl", "sweet81pooja": "😂😂😂😂😂", "saloni_seegurl": "@thealternatehippie me xD", "adanurappa": "Nin halasi hogiro tullige naayi tunne ne sari", "rvk.chauhan612": "Government ki bat mat sun ja tuje Corona nhi lage ga q ki un chutiye log ke sath ho na", "bhavishya11111": "#TJKMKB 🖕🖕🖕", "shivan_29": "Swara Bhaskar facing unemployment because modi we should stand together against these fascists", "guidance.tarot111": "😂😂😂", "noopursrivastava30892": "I think you are busy typing some anti national comment😂", "sooraj_the_burnig_sun": "बिल्ली के साथ कुत्ती l", "gunjan.kala": "Kat lay mental ko kha ja.....kuch bhala kar day india ka", "drishti7366": "Do u even work🤣🤣🤣🤣🤪", "ansh_officialpage3": "Ye billi bhi iski G@nd mar rahi h 🤣🤣", "gagangoy.al": "Apne pakistani madharchod bhai behen ko msg kar rahi hai.", "dashing_devesh_official": "work from home for jihadi 😂😂😂😂", "singhkunalpratap": "Porn movies me debut krne k liye mail Bitch 💩💩💩💩", "raahichauhan": "Kya rate chal rhe hai tere mc mullii🐖🐖", "sharmavidushi55": "Agr kissi ki purse b vhori ho jaae to rss ki sajish lgti theee inge .........nd aaj jamatiyo ki deshdrohi harakato pe b chup baithe hai ........dekh lo knsa khoon daud raha hai inke andar ......#urunkownfather", "arjunam_100": "Lagta hai yeh RSS ki billi hai 😂😂😂😂😂", "harsh_8864": "Konsa kaam? Koi film to de nahi rha tumhe !! accha dange ki planning kr rhi ho kya😜😂", "beingshadabkhan2": "Awesome @reallyswara diii👍", "ynwa.anmol": "Is chutiya aurat ne sab post kardiya abhi bhi yeh muslims ke action ko justify karne ke leye koi hindu propoganda layggi . Randi mullo ka lund leti iski maa aur yeh .", "singhadarsh.93": "Kutiya bhi aaj kal work from home kar rahi hai... Kya bat hai", "lilly_and_ko": "Hahahahaha", "vintagelover3579": "Posting tweets is not work", "ck.ray": "Ha chutiya pornsite पर hob ढूंढ रही हो 🤣", "tanu___1998_": "Iska bhi Lund lele", "independentgirl001": "Hello aap please Muslim bhaiyo ko vaise hi bhadkao Andar rehne ke kiye jaise CAA ke waqt bahar nikalne ke liye bhadkaya tha. 😂😂", "utkarsh_ut_21": "Kitna donate kiya iss 🐩 ne??", "sachinjoshi77": "PM ko nasihat dene se pehle Indore me Dr. ko pathhar marne walo ko aur UP me nange ghum ke medical staff ko pareshan karne walo ko samja ke aati.. jali hui mombatti", "musicforlife_14all": "Guys we need to understand one simple thing .. she is able to deliver so much hate and negative things only because she knew that people gonna react and keep commenting on her every bullshit post and story .. so like to fight corona only solution is distancing..solution for such a devil person is to unfollow her and stop commenting on her post #unfollowswara", "arjun_singh_ajs": "Didi ko laptop chalana bhi aata hai?? Multi talented kitna dan kiye ho abi tak?", "singh.kannu": "You are a totally Anti Indian.. lady..in this country..!!", "itzurboy_rawmesh": "chalana aata hai tujhe laptop?", "vikasmehta13": "@reallyswara Mam will you support 9pm Sunday for 9 minutes to our from fighters with lights and diye ???", "dhanraj_dodia_702": "Nikal sali Randi", "itishvashistha": "Madam ji vse to aap bhaut sacular bnte pr ab to ye kuch muslim log doctors, police , doctor staff k sath kse behave kr rhe h us pr bhi kuch comment kro😠😠", "aesthete_writer_for_you": "Mein bachpaan se suntaa aaya hun... jo garajte hai vo baraste nahi aur tum to garaj bhi darr aur afwaa fhailane ke liye ... desh seva ke naam par bhonkaa nahi jaata desh seva oon logo se jakar seekho jo mushkil waqt mein tumhari tarah ghar par baithkar chai ki chuski ke saath zeher nahi ugalte", "_npadhiyar": "YE LOG KHALI SABKO CHUTUA BANRA RAHEY HEY OR SAB LOG ISKE SATHE CHUTYE BAN BHI RAHE HEY pls jago or ise chutya actors ke sath stand mat lo 😡 jis logo ko support kar rahi thi aaj vahi log fela rahe hey .", "gvndtwri100": "Ek billi dusri billi ko \"Ungli\" kr rahi !! 😂😂😂", "vicky.dhakne": "5th April ko raat 9 baje 9 minutes ke liye 10-15 mombatti jala kar apne gand me daal lena apki khujli khatam ho jayegi .", "singh_vaishnavi108": "Blah blah queen... where are you now ... did you even donate any money for PM FUND ... you need to see a psychiatrist because you are mentally unfit lady who does kaav kaav like a crow ... actually even crow is better than", "iammohit_gaur_113": "Hope ur not writing a letter to WHO or UN by saying corona caused by RSS and bjp.. 🤣", "sandipbadbola": "Saali randi tablighi katmullon pe kuch nahi bolegi jihadi randi", "mayank6811bajaj": "Where is yur donation and sympathy now bitch", "aklion1992": "Swara ki pussy ungli karr rhi h😜😜😂😂", "iamvishalmishra7": "Ab desh ke haalat par kuch nhi bologi didi ....morche nhii nikalogi", "imrohitjoshi_": "Shaheen bagh ya jamia k script likh rhe hai.. @reallyswara workfromhome😂😂😂😂😂😂", "urmikhansardar": "😂😂😂", "cool_angel_750": "Tune Jamaat walon ke bare mein kuch nahi bola agar yeh kaam hinduyon ne kiya hota ab tak tu dharne pe baith gayi hoti aur ab muh sil ke baithi hai", "diya_mis": "Maam ab aap ki jimeedari nhi banti being an indian to say something about tablighi jamat. What they did n what cheap things they are doing with our doctors . Now all of are mum. Don't you people feel shame.your humanity also caste based .", "dhaarnadorable": "How much you donated dumbo", "manveirr": "🤢🤮🤮🤢🤮🤮🤢🤮🤢🤮🤢", "uttam7487": "57 मुस्लिम देशों के रहते तबलीगी जमात का मुख्यालय भारत मे है । दरियादिली के चक्कर मे ये देश अपनी कब्र खोदने में लगा है। \"चक्रव्यूह\"", "saheem06": "🤣🤣", "new__naveen__sharma_srcasmwadi": "@Reallyswara https://www.facebook.com/305618449565617/posts/2730207480440023/?sfnsn=scwspmo&d=n&vh=e", "satyam_7352": "@reallyswara kosis kar rhi hai intellectual bnne ki, movie bnane se gyaan ki prapti nahi hota hai #manthra ,lekin sabke samne chutiya ban kar reh gyi tum🤣", "sandeepshukla888gmail.com_": "Hi Manthara bua did u donate something to porkistan ur brother ia begging with katora in hand pls put something", "millionsmacks": "Jab mauka aaya janta ki dekhbhaal ka too samvidhaan ki rakshak jihadi bhaskar dil-do se mje le rhi hai", "i.am.pankajdaksh": "Tweets k alawa kya krti hai ji aap 😂 Vo to doosri ungali se bhi kr hi leti hongi😂", "s_a_g_a_r_bdkr": "Are where r you now when doctors are pelted with stones ? Eyes closed when Muslims are responsible ? #coronaatankwad #throwthetrashout", "rampatel535": "Ye sali randi hai rate kya hai", "innocentvishesh": "That's so cute ❤️", "__nidhii_": "Koi kaam dhandha na ho toh papers hi dhoondh lo! This fight,virus, hindu Muslim dange will over and so is your career!", "rahul_2689": "Where is ur fucking concern now for the nation ...now u won't let any video on tabligi jamat ?", "mrinalinitiwari06": "By the Swara what do u think about the recent attacks on Sikhs in Afghanistan....care to comment? Although your opinions hold no value but thought should just ask since you are such a \"RESPONSIBLE AND KNOWLEDGEABLE CITIZEN\"", "im_sahil3": "Dramebaz 🙌", "rk_nits_2424x": "🐷🐷🐷🐷", "valay_shah007": "Swara Bhaskar kyaa aap aapke wo bhai logo ko keh sakti ho UP mein yeh bawal na machye quarantine mein le Gaye hai waha narsh k samne nude ghum rahe hai gali bol rahe hai police doctor ko maar rahe hai so plz aap se 🙏 kehna hai aap k Bhai behne ko samjao yeh sab na Kare kyuki humre Amit shahji samjne nikal padge to bohat bhura hoga so plz aur aap news jarur dekhna plz @reallyswara", "shubham_bhawsar_": "Mc ab bol na jo Muslim virus faila rhe", "amittchabra": "Hi Mantra", "pranay4u": "Her work is posting hate tweets😁 even her cat is not allowing her🤣", "kalyani.lahiri": "r u volunteering now ..?? people are required ... u always volunteer right", "saptarshibose2003": "Playing mode....", "dheeraj9casting": "Swara tera bas chale to tu protect kr le corona pe ki india ke log hi virua banaye hai...desh ki gaddar ladki.....tu kutte billi chuha kisi ke saath video bana le bt tu hamesha ke liye hindustan ke nazaro me gir chuki....", "namrata_murmu": "Madam ji kitna donate kiya aapne garibo k liye?😛", "ashish82906": "@reallyswara Didi aapke jihaadi doctors ko maar rahe hai. Unki wajah se india aaj 3rd stage me chala gaya but aap inke baare me kuchh bolna nahi plz. Hinduwo k galati ka wait karo jab wo kuchh kare to aana social media me chilane", "arab_wala": "Miss NCR 😂😂😂😂", "theweekend_detox": "Hame laga aap bhi masjid me hongi . Jammat k saath.shame on u", "life.akash": "RASUKA on people who would Harm or misbehave with Doctors or Authorities who assist Corona Treatment. #sadnewsforswara #badnewsforswara", "mr.coolattitude0037": "Tu knsa Work frm home kr rhi he 😂 Tera to hr br work frm home hi hota he 🍑👈😆", "deen259": "एक छिनाल औरत स्वरा रंडी भास्कर. स्वरा रंडी कभी मेरे से मिल ना ऐसी गांड फाडकर तेरे आगे वाले भोसडीसे लालवाला communist का झेंडा डालुगा ना. तेरा हिजडा बाप छिनाल अम्मा का भी याही होगा.", "d_for_devam": "Typing to aata nhi gyan ch**dwa lo is bkl se", "sharannn.x": "Tu sirf badi badi chdna baitke udhar... Nikal lavdi pehli fursat mein..", "gkunj": "Madam waise aap to bahut voice raise karte ho, ab n Kari tabligi jamaat ke kukarmo pe", "ashutosh.sharma.9210": "Bc desh kaise barbaad karna hai yehi kaam kar rahi hogi,saali", "john.johnny_": "Sorry, my cat ran across the keyboard 😂", "arun_yamjala": "Benkyaloudi desh drohi @reallyswara", "shah_tanzeel684": "😂😂😂😂😂😂", "dhananjai_kumar": "What work actors do at home that too on lappy ? @reallyswara", "theriggedveda": "Hahahahahaha i Want a GIF of this", "choudhary_1196": "Ab jb logo ko aap jese freedom fighters ki jrurat hai to aap ghr me chup ke bethe ho or vese aap JNU jake bde bde bkbas bhasn de rhe the", "shikhaca": "U never listen to PM ...so better don't follow lockdown too😂😂😂 and yes if you have humanity left in you so please donate in this worst situation 😏😏😏😏😏", "the_rajput_guy___": "Bhen ki lawdi", "sofiarahmanafzal": "Dear swara😍looking nice .Khuda mehfooz rakhe har bala se", "fly_high_074": "Tatti 😆😆", "zafir6163": "....", "kishore_er_nondini": "@debokanya tor o ki ei obostha naki ree", "sugarplum_giggle": "JNU people said \"cough at you\" to guards..... @reallyswara bolo kch aap bhi", "vaibhav.shetti009": "ur are intolerant with ur own cat?", "nidtwinkle": "Kyu bhai kamini aurat. Khush hogi tu toh jo kuch hora hai yeh dek k. Ab kyu nai gyan baat rahi hai mullo ko ki aisa na kare . Ab kaha gayi teri samajh", "amaresh.debbarma.940": "Hi swara I m stand with your political idology", "aj_khurana": "Ab ky bologi muslim k bare me....isme me kch bolo", "im_jd16": "Ab tu or tumhare tattu bahar nikle.to gurde chil denge police wale 😂", "shreyasoni103": "@_noone64", "raman0165": "Kanhaiya ka kitni baar muh mein liya? Randi saali", "seemamishratiwari": "Even animals knows that they should not let motherfucker and anti national to do their corrupt work", "kartikk_007_": "Do you remember placards by Sonam Kapoor, Swara, Kareena and many ?? Do you remember girls holding banners of Fuck Hindutava and fuck OM ?? Do you remember that statement “Minorities are scared” ?? Do you remember debates by Ravish, Barkha, Rajdeep, Kanhaiya, Kunal kamra,Varun Grover, saying that Hindutava is going to kill Muslims in India and BJP is doing that ?? Well Deep Breath..!! It took 60 days to reach 1000 cases and 4 days to reach 2000 cases after a peacefool religious gathering. And no one is talking or condemning this act. Doctors are being beaten up in the Muslim areas of Indore and Ranchi. Why no placards saying I am ashamed to be a Muslim ?? Hindus celebrated Ramnavmi today without inviting relatives Kanyas or distributing Prasad. Who is afraid now that too not of losing citizenship but losing life because of some ill mentality and obsession about their religion. What government is doing everyone can see that and how majority of nation is helping the government that is also visible. Shame on everyone who is not condemning this. You all are equally responsible for encouraging it. Those all so called secular and intellectual people are staying in their lavish lifestyle unaware of the fact that these morons are spitting on everyone and I wish they spit on each of them and their pseudo secular souls get cleansed and all the dirt goes away at once. Why do we need NRC now lol? It’s very clear that who doesn’t deserve to be a part of this soil. ISIS ke full form Me I stands for Ice cream and Irresponsible 😇😇 Shame !!", "ms.jaihind02": "😍😍😮😮😮😂😂😂😂😂", "nationalist.sahil": "hello manthraa", "singh6203": "बहने आपकी फ्री के राशन लेने को खडी थी , कम से कम उनकी मदद करती ..पानी पिलाने का .तो यहां तमाशा लगा रखा हैं", "mayur.wankhade.777": "Cats are love ❤️", "_nikhil_solanki": "nrc or caa wale kya chutyaapa kar rhe hai samjao usko aapki baat sunte hai na wo activist ho na aap kch karo", "thatviik_y": "Aap swara nhi lawda bhaskar .. appko khudko indian bolne ka koi haq nhi.. kuch peso k liye to aap desh ko bech do.. ap jese mc logo ko khud indians kehne m sharam aani chaiye..", "saidur2966": "🤓", "rajesh.bhardwaj.2013": "❤️❤️❤️", "rajat.stomar": "@reallyswara . Hi swara where are you these days during critical situation in india #covid-19 and nation need your help and support as you did in last time for #CAA & #JNU which not so much related to you for no reason.... As everyone is supporting india these days but you are lost somewhere on earth,can you help some people atleastfor those you were fighting with #JNU & #CAA at #shahinbagh Need Biryani dear", "9_2_5.memess": "Swara's laptop got damaged. Le swara:- yeh modiji ki saazish hai.", "the_.provocateur": "Ja bhadwi aur kar dalali in madarchodo ke liye tera hi kiya h ye sab chutiya aurat 😤", "abhinavrpandey629": "Do sometime for country instead of spreading hate.. I have never seen such a worst character actress in life.. why you never come for helping the people when they needed it.. only coming to oppose the government who is doing better than previous..", "rohitsachan_9531": "She has work from home. What a joke 🤣🤣🤣🤣🤣. She must be filling application for the documents which she doesn’t have.", "jayesh_patil87800": "Apna gyan kb dogi ap...corona pe", "sardonic_ally_true": "Mere Kalyug ki Manthara🥰😍😍😍💩💩", "mukharjeenishant": "Go n help the Soceity. Shaheen bagh k time to bohot gyan de rahi thi.. Ab kya hua muh pe taala lag gaya. Nakli aurat", "shubhangi.dubey.6217": "Ma'am, stone pelting par Kuch bole", "pooj_an": "Why is she not helping those Muslims now?? Who are trying to spread the corona to whole nation? Strange... no more speeches then?? Huh?", "sagar__singh_rajput": "@reallyswara madarchod ki bacchi kuch donate bhi kar deti free ki bakchodi to hamesha karti hai", "hector_el_fathar": "Now Justify spitting and pelting stones on doctors. Tum bhi soch te honge sale kab tak bachaye inko bhi harkate bhi inki aisi h", "shazikhan219": "Everyone is not damn rich zaruri ni h ki paiso se hi help ho", "ashaa_2012": "How cuteeeeeeeee😘😘😘😘😘", "tushar_gadekar1296": "Is madam sahab ko ab acting ki jagah politicians me jada dilchaspi ayi he q ki kam nahi mil raha hoga kuch to chalo TRP ke liye kuch na kuch to karenge .baki actors q chup chap he q ki unko pata h sahi galat ky h madam ji abhi jara desh ke liye socho kisi mazahab ke liye nhi 🙏", "rayyyy_210": "Hey chut now talk about the Delhi Muslims chuts no? Why you quite ?", "the_chandraprakash": "Kalyug ki manthara😍😍", "ankitwirwani": "Madam videos upload karo ab indore m aaj jo hua.... aur jo tabligi jamat ne thuka police walo pe aur doctor pe.....godi media wali", "_inani77": "Kuch donation ke liye cheque kaata yaa chutiya hi kaat rahi ho ???😂", "omer_shazab": "The cat is crazy like you 😂", "r_i_tu": "👌", "subhaminz": "Adorable ❤️❤️❤️", "ritik.bhatt_": "MODI........................................ 🇮🇳♥️", "patelhardikhr": "😍😍😍", "patelkams": "Markaj nhi gy thi tum", "anshubaba2411": "😂🤣🤣🤣", "sharadsharma1993": "or amma ji kaha ho aaj kal muhare muslim bhaiyo ne kya jiya pata to hoga hi na", "farhakareem": "@shanu.bash", "eshathareja": "Stupid lady", "fakkat_sanghi": "FakeAss Liberalism. Why aren't you posting anything on Markaz issue. Waise to bahot uchalti rehti Hain aap. 👏👏", "shyamali_bajpai": "@reallyswara madam hv some shame and donate in PM Cares fund. Now what stand have u taken ? People like u are curse on India. And shame on u that u r still busy making stupid videos with your cat", "k_king16810": "😂😂😂😂 you adorable.", "murat_faisal07": "Are yeh kya ho raha hai..😂", "_justyogi": "@reallyswara Hey, i got know you and @taapsee have donated 5Cr befitting replies each towards Covid19 relief fund... you fake activist don't play divide n rule 😂😂😏", "_mini0_": "You are such a big nation lover have you donated anything😏😏😏 you are just a piece of shitt🖕", "emperor._raa_": "Even cat knows that Feminism is Cancer.", "sn_stoneglow": "स्वरांड भास्कर .... किधर गायब है", "vaibhav_narwade_patil_": "Please tell two words about nizzamudin markaj", "navivig": "In logo ki to movies bhi nahi dekhni chahiye ghatiya log gandi soch", "i_____________sauravpatel": "Ooo aunty sudhar jaao avi v waqt hai ,, sabke saamne sorry bolo aur caa nrc accept karo.", "mimanhas": "@ta_phoenix 🤣", "adr_fanatic": "Woh Indore mein doctors ke saath olympics kisne khela ?", "ratansharma0094": "Have u donated anything.. u hypocrite", "muhammadvasim_": "Lovely ❤️", "safdar_ali62": "👌", "_parveen_anand8": "#kalyugkimanthra swara bhaskar", "firdaushabibkhan786": "Toooo cute💕", "venu007_adv": "How cute 😘😘😘👌", "motordestination4": "Swara many i requested u to donate money to animals NGOs u never did yeh sab acting karke kya milega vagban maaf nahi karega plzz help innocent animals.", "yadavyadav82": "@reallyswara 1st 1000 cases in india 56 days 2nd 1000 cases in india 4days Just because of jamat Isssshh kuch maat bolo secularism hai", "rawat_2597": "Where are ur thoughts now on saving the nation and doctor from tabligi jamat now the country is not on threat? ABI kya hua aankh kaan n dimag Sab band hai ...", "healthandfitnessatinsta": "@reallyswara where are you hiding now, support the people who are pelting stones on the doctors ????", "ankkala.art": "Oooyeee le... Lubbbuuuu kittu.. Kitti pyari hai... Laila❤️", "gapribhat": "Bitch are you not donating to PMCares?", "user_name_not_require": "Where thr fuck are you now", "komal.sood947": "Hi. Mam. I want to ask something.. That have u done anything to help people in this situation. I mean i am fan of your boldness. But when someone say u were criticizing govt. Whole time for people sake. But now where are u.. Thats hurt mam. So give us ans mam..have u done anything for current situation. So i can again proudly say ur name.", "suchismita.dey": "Madam ji aapne bakwas to bohot ki hai CAA NRC pe to aapka Nizammuddin k incident pe Kya kehna hai ???? And aap abhi donation dene agey nahi aa rahi ?", "_het.shah": "Fuck offfff!", "isaabellaaa235": "I think terko bcha hoga tab b bolegi BJP ki vajhse hogya 😂😂😂😂", "mysteriousguy0100": "Ab kuch kyu nahi bhawk rahi tu @reallyswara yeh tere bhai log Muslim kya karhe hai Indore mei bol ab kha gaya tere secularism flop actor Bol kuch film toh mil nahi rahi bas eshi famous ho sakti hai tu . Shame on you agar tu Muslim ko support karhi hai .", "jahan.2.87": "😂😂😂😂😂❤️", "iamchandnikhan": "@reallyswara my cat’s name is also Bella 😍", "sujith1504": "Where are u mam now when Whole muslim community did something which whole nation can't even digest and distubed by this why are u not speaking against this are u biased person I will tell u if the case goes high it's all because of Muslim community am sorry to tell but yes we all disturbed🙏🙏", "akhileshydv24": "@reallyswara teri billi bhi bol rahi na type kr kuchh galat hi hagegi afsos agar kaam hota hai typing wali pic send na hoti 😂😂😂", "zarlishmirza0": "my cat also does so😘😘😘", "imqaisar15": "❤️👌", "isaimanthena": "Hey lady! Why are you silent on Tabliki Jamaat? This shows your double standards.", "nikhil3636": "Cat giving befitting reply xD", "bhagat2745": "I hope tri phati hue chut aab tik kr beth gai hogi", "theinsufferablesdiaries": "@rasleen07 I have no idea why this reminds me of you 🙃", "somdas123": "self respect thora bhi h aapka ir aukaad h toh donation karke dikhao sabko, nhi toh help toh karo sarkar ka!! Nhi toh ghar se mat nikal na!! Sarum h toh", "pablo_escobar0821": "mc doctor ke upar thukna patthR marna ye sb or itne logo ka ikithhana hone pe inpe khuch khna tu pakka muslimo ki najyaz aaulad hai", "apooravjain": "Suar.. ab jo jaahil log nizamuddin me mile, uss baare me kya bhokna hai? Jisne doctors pe thukka, unke baare me kya bologi.. pakistan chli ja suar..", "s.mahreenilyas0231": "❤️❤️❤️❤️❤️", "ben87yao": "🤣 🤣 🤣", "itssimmijain": "Didi abhi khush h kyuki abhi documents nhi dikhane pad rhe😂😂", "safikulhaque27": "@momee2506 sai lua 😉", "shutup.ashu": "Aapke sab dost Delhi me mile hai! Please unko aapke ghar pe rakh lo please! N donate karo kuch paise !", "hrishaabrocks": "Stupid CAA bitch. How much have you donated so far fake feminist cunt?", "chandhok_vishesh": "Ab kuch chutiye yaha bhi rss bjp krege", "r_gopoo31": "@reallyswara modern manthara 🤣", "pappubhai786786": "Swara..Your friend🐈 is really naughty😂", "f.r.i.e.n.d.s_loverz": "always provocating people..u ve got so much problem with india..why don't u leave. trust me a lot of people will be happy.", "sweetjaat": "Randi", "vinit_vb": "Madam aaj kal gharpe bethke मदरसा वालों ko Contact कर रही है 🤣", "iamadityaa_10": "avi tweet nhi kr rhe ho Delhi mein jo ho rha uske khilaf....Oh sorry uske paise thodi na milte hai 😅😅😂😂😉😉😉", "mayurishewale": "Wru r8 now fucking bitch when jamatis are beating and spitting on police,why ur fucking mouth is shut r8 now", "manisha.s1403": "Thanks to your Muslims this work from home will continue long... Keep enjoying", "jitendra_jangid77": "Jnu wale kutte kha mar gye sab ke sab koi bahar nhi nikl rha h...wo Teri jammat wale doctors police walo par thuk rhe h ..", "chieragsharma": "Kuch to bol le nizamuddin wale incident pr😂", "fotofreak._": "😂😂❤️❤️", "shwetamahara": "🤣🤣🤣", "sadhankumar_ks": "Are sending your friends how to throw Stone at medical workers 🤡🤡💩", "deepak.aggarwal.9081": "Randi", "slomokilla": "Why r u so dumb", "pi_day_pisces": "Damn look at the hashtag number. Just to get attention😂😂😂😂", "anopenbookie": "😂😂😂❤️", "shireen_ka": "@nimi.tiwari @qbeea", "quirky_girl05": "Actor n dramebaaz person k sath ch*tiya v add kr le tu apni bio me... I've seen ur Interview of CAA & NRC.. bc kaun se daraawne provision k bre bol ri thi tu??", "tanayb1": "Aap kab Allah ko pyaare ho rahe ho", "a_niche_menon": "All work and no play makes the cat go ‘nay’ 😬", "yasirbaig007": "@reallyswara It is my birthday today. This is your fan boy from Lahore, Pakistan.", "ashok.bhasin.547389": "Swara Bhaskar support women Empowerment create unity among the women Parliament must have 50% seats reserved for women", "hi5nayan": "❤️❤️", "n.o.o.r_a.l.a.m": "😁😁😁😁", "shete4177": "Easy to sit at home, gorge on the carbohydrates & abuse cops BUT NOT A WORD BY HER ON THE SPIT & STONE ATTACK BY JAMATI MOBS ON COPS & DOCTORS- CORONA WARRIORS - IN MP , MUZAFFARNAGAR & MADHUBANI COZ ITS POLITICALLY INCONVENIENT !! Enjoy the hypocrisy folks !!", "fir__zan": "😂", "hewett.godwin": "Very very cute", "imtnveer": "🤣🤣🤣🤣🤣🤣", "kabir_fitness05": "hahaha randi 🤣🤣", "kusumishra": "❤️", "chitwan_18": "@man.d.singh watch this ! 😂", "poetry_by_hemant": "jyda liberal bante ho ab in jahilo ko bhi samjaho kuch ya sirf ek tarfa safe khelte ho", "selfymadam": "Any thing to say about nizzamudin", "read_travel_dance": "So cute. Adorable❤️❤️", "__.abhishekkk.__": "Pr Tere paas to kaam hi nii h", "jogimoond": "जमातियों का स्टैंड लिया या नही अब तक आंटी", "___b_e_a_s_t______": "Ho toh tum suar ek number ki", "tabrezkhan_officiall": "😂😂😂wahh re billi very naughty 😂 same like @reallyswara", "yellosing": "You were so against the CAA and NRC..now why don’t you ask your fellow terrorists to stop spitting on people and spreading CORONA in every possible way..you anti nationalist", "nadeeaaftab11": "👏👏👏", "instalikeworldz": "andhi liberandu ab pattthar fekte hua nahi dikhe tujhe doctors par sale dhabbe bharat par", "its_sandesh.k": "😢😢", "tintin_ralte": "🤣🤣🤣🤣", "wecarentgreen": "Ji muslaman doctor pe patthar maar rahe h unke liye kuch kyun nhi bolti. Shaheen me toh chila chila k bol rahi thi,mulle k liye kuch kyun nhi bolti ab", "dr.jyotiee": "😍😄", "amaheshwari_2002": "Meanwhile swara bhasker donated 69 Rs to Librandu relief fund(LRF) gives tight slap to haters.", "dk_5051": "Jay shree ram", "kavitas576": "Badkismat billi", "sanakhan76786": "😂😂😂", "rishi_rathore12": "or mantra 😂", "akshaykumardiehardfan1991": "Ek taraf billi aur dusre taraf Kutti jo pagal aur berozgari se tang aako chorni bangai", "shivamdwivedi1997": "Azaadi dudna lgta bnd krdia", "amrita184shukla": "❤️❤️❤️", "flyingofficeryusuf": "Very funny 😂😂", "thevijaypathak": "You're a urban terrorist @reallyswara", "chandni_edit3": "Omg shes too cute ....wants ur attention", "nakulshah83": "Deshdrohi...stop your non sense..what do you say about protesting against CAA after Hindu Sikhs were attacked in Kabul Gurudwara?", "thepunitkulhari": "Ab kha h tu randi pure saal kach kach lr rhi thi", "rk_ranjeetkaur": "😀😀your cat wants to play!!😘", "inayathusean": "❤️❤️", "manasirachh": "@reallyswara This is hilarious! 😂😂😂", "valiantking999": "🤣🤣🤣🤣", "aatirpatel": "😂😂😂😂😂", "msn00313": "Cats will always be cat... attention seeker😂😂😂😂", "tariqueabbas1": "😍😍", "sarfarazalikhanniyazi": "🤣🤣🤣🤣🤣🤣", "oyebhaisaab": "@swathy18 I'm sure this happens with you", "ahmednaseermohammed": "👍", "kuhu_das8": "😂😂😂", "salman_imam5": "😂😂😂😂", "raghuveer_2018": "Kaha nfrt Fela rhi ho dogli insan. Shrm to kuch bchi nhi h tere andr", "nazrul7711": "🤣🤣🤣🤣🤣🤣", "sairaawasthi": "😂😂😂😂😂 she is such a cutie . Playful ❤️", "priojitkeisam": "Do do kutiyan ek sath 🐈🐈", "superdude.abhishek": "Tujhe koi kaam bhi hai faltu tweet kr rhi hogi bhikari actor", "ashit.mitra.5": "So naughty ur pet", "ab91_4u": "❤️", "shweta_shankar": "😁😁😁", "raj_shivaay7": "ab baunk kuttia..tere pyare mulle iss tym kya support dikha re hain..wah.8000 gather ho k meeting krte hain fir baag k chup jaate hai alg alg places pe..aut pkdne jaate hain to doctors pe cops pe spit krte hai..stone pelting tk krte hain...wah.kya baat hai aise logo ka support krti hai tu..aag to tum jaise logo ki wjah c lgi hui hai @reallyswara", "pooja_adv": "Di, desh me corona chala raha hai,,, Kuch denote hi Kar detey aap..itney paise toh kama liye hai", "fariha_a.trina": "@alexandria.fisher @julienolette lol", "thejamaalzafar": "Hehe ye mast hai 😂😂", "faizabakhshi": "She is amazing 😍", "the_rogue_planet": "😍😍💓", "nitin.malik.3557": "Kuch donate sonate b Kiya h..ohhhtere tu to berozgaaar h", "dileepthetiger": "V. Nice swara", "glasseyeindia": "😆😆😆", "rishutrivedi_": "Cute 😍🤣🤣🤣", "miraj_sirius": "@miss_attitudee", "rsb800": "Hahaha😂😂😂.... Ur🐱Cat🐈is really as naughty & mischievous as U Swara", "mangalapai502": "Very naughty cat. We have 4 cats at home and can understand how annoying they can be sometimes.", "garach81": "Abhi desh ke liye kya Kiya aapne mam ?? Donate Kiya ya nahi ??", "waqas8147": "😂👌", "tanjimfiroj": "😂😂", "divyanshusriv_": "Is she even aware of what happened at Nizamuddin congregation? What those people are doing now?", "_aadityaghosh": "😂😂", "cocokumar": "@meenu___apr @sheenalrkumar", "nikhitakini": "@givemechai for you wfh story", "shahidsayanmondal": "😂😂😂", "always_the_joker1": "😂😂😂😂😂", "nupurnupi": "My message to your dad. I've messaged him. Hope that asshole reads it @cudayb How on earth are you even happy seeing your daughter take sides of terrorists all the time? Fucking left hypocrite daughter you have. You must go and check her comment section, LMAO people are abusing her like hell cuz she deserves it. I'm not angry, I'm scared and devasted to see people like these. Being a Hindu she has never taken our sides no matter how much we're right. She has no brains and no life. How much do y'all get for this? I suppose a handsome amount, that's how weak y'all are to destroy your own country? Fuckin paid activists. Namak haram BHASKARS. In fact y'all are the real traitors /terrorists /naxaites, whatever Shame on you. I curse her and you. Y'all are sleeper cells. Gtfo from my country. Weak converted Bastards. Katue sale", "santosh_yadav267": "Ish cat ko bhi pta h tum fake femnist ho😂", "rehanthekillar": "U look beautiful without clothes", "zishupedia": "😂", "ikhan_313": "Naughty billi❤😝😄", "jas12x": "😂😂", "theneha.me": "😍😍😍😍", "yusuf.shams.10": "Awwwww", "air_em_0_0_vdwm": "This is sooooo cute❤️❤️❤️", "abu_khan92": "So cute Though", "sonia_bajpai120485": "🤣😂🤣🤣", "zameer0011": "itna pesa leke kaha jaoge....ek persian hi khareed lo😅.....mujhse le jao mere pass teen hai....😅discount available 😅😂🤣", "mahesh_n_vagole": "When Police, Medical team went in search of Nizamuddin attendees 1. Gujarat: Stone pelting in Gomtipur. 2. Bihar: Stone pelting in Madhubani. 3. Maharashtra: Medical team assaulted in Ahmednagar. Other side, In Rajasthan: Mass gathering at Sarwar Dargah. Why aren't they cooperating? Atleast now these people should cooperate.", "sakshamsharma007": "Bitch", "farukh_shaikh7": "She is same like my kitty same way she interferes in my work♥️♥️♥️♥️", "18badboi": "aunty budiyaaaaa 🤣🤣🤣🤣🤣🤣🤣", "starcrossed2244": "🤣🤣🤣🤣🤣.. such a playful cat", "brk2206": "😂", "rajeevrajaji": "Lailu is our beegal", "mistiqex": "😂", "sali_engineering": "Kaam pe dhyaan de! Kaam karte waqt aise timepass krti hai phir baad me aadhi knowledge leke gyaan pelne lgti hai🔥😂", "nandikapradhan": "😍so cute", "aayrm5": "❤️", "aze9396": "Lol", "gul_patel79": "Swara why r u not letting her 🐱work?", "cutilicious_chocopie": "😂😂", "shreejitabiswas": "😂😂😂😂😂😂", "onlyfouzia": "Hahaha. Such a cutie cat. I love cats", "theoldsire": "😂😂😂", "shaikh.ateek": "nice", "jayendra628": "Kuch gatiya logo ko to bus... is achhi post per bhi ... gatiya comments karne hai... 😉👍", "aamer_1008": "❤️😝", "syed_tahir_razavi": "@leenajoshi131 @mittalayush1997 @ssmaithili @sk_ani @prateek_18", "sheriseslikeapheonix": "Hey u hav nt post anything about your tableegi jamat people?🤣", "nitishk664": "😂😂😂 Pussy", "val._.urpal": "So cute💕💕", "ju2juv": "🤣", "dutttaism": "Jarurat kiya kaam ke use udhar rakhne k , matlb kuch bhi either kaam karo aur pet samhalo , iye sb dikhane ka nautanki band kijiye madam @reallyswara . abhi ka Situation wfh ko seriously karna chaahiye , aur aap jaise influcer ke chakkar aur ppl agar aisa dikhane ka kaam karne lag gaya tab ho gaya.", "i92shahnawaz": "Lockdwon swara mam 😂👌👌👌", "csalihaa": "Awwwww so cute", "pawankp8098": "कलयुग की मंथरा", "__john__wick______": "The cat 🐱 really like to play with you...... When you are working...... I love you you're lailu😍", "tabbzykhan": "So cute", "gopal_bamalwa": "Aap work bhi krte ho kya 😂👌, hume laga din bhr criticize krte ho 🤔", "u______n1": "😉😉😆😆👏", "jalebi.bae": "Awww♥️", "mamta_kalra19": "Aunty...no comments on lockdown announced by our primeminister....", "karan_dewan1983": "Too cute😊", "uttam.singh.54966": "हे किधर है अरे तूने देखा तेरे जैसे तेरे भाई मरकज़ वाले देश में गंदगी फैला गए जो तू नही कर पाई वो वह लोग कर गए, तू खुश हो ले", "amey.sinnarkar": "Aaj indore mai doctors par stone pelting hui uspar abhi tak no tweet", "riyaz.sultann": "🤗🤗🤗", "chatterjeesatyabrata": "😂😂", "musafir_uk07": "not supporting or criticizing spiiting at corona red zoned area........", "shekharkoditkar": "😜😜😜😜😜", "shahbaz_ansari8": "I like your cat ❤️", "sunilthanviii": "Covid-19 per bolne ke liye shayd Paisa aaya nhi abhi tak 🤔🤔🤔🤔", "rohitk_anuj": "Ka haal hai🙏 swara didi", "pokhraj.roy": "@reallyswara My dog is the same: he’s shuffling from room to room and in search of full time BHAV", "manjeetsinghmundey": "Hahaha 😃😀😄", "ayewantnoodles": "What a badmash😍", "umeshkulkarni_uk": "Tu kya laptop pe kaam kar rahi hai😂😂 accha insta post bana rahi hogi baithke, kanhaiya kumar ke liye😂😂", "pinkypoonawala": "😂", "djwadcutter": "Awesome 😂😂😂 made me roll with laughter thank you 👊🏻💥✨✨✨✨💜", "jeetprabal": "Why not with Jamaat , now please understand for such nonsense we require stringent laws", "imran_junnedi": "Lailaa is amazing. She wants your time..😃😆", "iruby_st_john": "How cuteee♥️", "gurimann": "@tonybakercomedy", "ndmhassan": "Such a cute and sensible cat", "ghausiaakhan": "Oh god 😍😍😂😂", "anjalajamal": "😂😂😂😂 That’s adorable 🥰", "mallika_shetty": "Such a cutie.. my babies also keep worrying me", "stevenroche11": "😂😂😂", "harsh_vardhan_kaushik_": "Hatt bhen ki lodi", "khan_officials": "Cute and hilarious 😅♥️", "shivangi_raina111": "Love you😍😍😍😍", "kaushikmoitra": "Swara’s silli billi....🐈", "chandananashita": "🔥🔥♥️♥️😂😂😂😂😂😂😂", "falahi_sajid": "❤️", "closedcaptionss": "Hey We post amazing scenes from movies and TV series. It would mean a lot if you could check us out and give a follow", "arvind_mish": "👌", "__nobi_": "Arre manthra😂", "niteshkr077": "😅😅😅😅 b grade", "prisoner.of.all.things.worldly": "My sister's cat used to the exact same thing😂", "alankritaanjali": "Where are you madam...???? This is the time country actually needs support from its people... Its the time to show your patriotism... Aap sirf CAA/NRC mei hi naare lagengi kya?", "shabeermp1": "😂😂", "dvddsz": "😁😁😁😁❤️", "trickytanmoy033": "You have such a cute pussy 🐱🐱🐱", "par_vathy\nVerified": "Verified", "nuthin_bad": "Cute cat and you ❤️❤️", "rahulpancholi007": "बदमाश बिल्ली 😂😂🤣", "im_riyaz.ilme": "❤️❤️❤️❤️❤️❤️", "vats_saket": "Tmhri hi tarah Ye bhi batameezi kr rhi hai 🤣.....jyada pyar dene se yhi hota hai", "vimalpabbawar": "😂😍", "sabriboy786": "😂😂😂", "mayur___ingale": "Cat : Where is mouse 🤣...", "shravya_reddy0789": "😂", "shailesh.makwana.129142": "😂😂😂😂😂", "sammmymohapatra": "What's its name?", "ahmdnzaft02020": "Hi❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️👏👏👏👏👏", "vivekgaikwad96k": "🤪🤪🤪", "tkrishnakishore": "😂", "saymaseelam": "Really too cute❤️❤️", "khiladi_5678": "@reallyswara bhag ja bulau Modi ko😜", "ninz21sood": "So adorable !!!!!!!!! @reallyswara you are blessed", "hippiesoul_gypsyheart": "Totally relate with it 😂", "amit02.ghildiyal": "Kuch logo ke liye bhi kr do. Abhi mauka hai help karke insaniyat dikhane ka. Waise to insaniyat ka bahut path padhati rehti ho.", "afzal_hussain_6331": "😘❤️👌", "maartekhanbedhadak": "Yeh toh meme material hai😂😂", "sattymhaske": "Donate kiya kya ...... Ya fir aise hi logo ko Chu banana hai😂🤣", "ayesha.farheen.96": "Sooo cute though 😂❤️😍", "sameeramudgal": "This is so sweet @edrinanewton", "alokparna": "So funny!!! Love it♥️♥️♥️", "itishagaur": "Madam kaha gayab hogae aap ya sirf JNU walo k lie hi aati hain aap🤔", "shahnawaz007khan": "V cute cat 🐈😀", "feminist06": "@preet_e_rang", "never_naguib": "@lonekatmusic @somyasrivastava", "mehta363636": "सोशल मीडिया यूजर्स ने स्वरा की तुलना की है 'मंथरा' से। दरअसल मंगलवार की सुबह से ही ट्विटर पर 'रामायण' के दो मशहूर महिला किरदार रानी कैकेयी और उनकी नौकरानी मंथरा ट्रेंड कर रही थीं। जिसके बाद लोगों ने स्वरा भास्कर की तुलना मंथरा से करना शुरू कर दी। यहां तक कि लोगों ने स्वरा को कलयुग की मंथरा तक बता दिया", "cuttack_beast": "Aunty miss u so much come to road for protest very soon", "khan_aznan": "Damn cuteeee ♥️♥️♥️", "chouhanabid": "Aap bhot payari ho swara", "makeupartist_tanaya": "😂😂", "dhruvayan": "तेरी गांड बड गई, कोण मार रहा है, 🐎🍑", "mujahidwalikhan": "👏😂😂😂😂😍😍😍", "nileshchavan194": "So sweet💐😍❤️🌹", "kshitij__bajaj": "https://www.rt.com/russia/481226-russian-cops-detained-radical-islamist/", "dr_shadab_shahnawaz": "😂😂🙌", "2.71828182845904523536028748": "Your typing style is giving me anxiety! 🤣", "classroom_by_anam": "Hahahaha so cute", "firoz.rehman": "👌", "rahmanmoolur2018": "It must b searching for the mouse...😍", "brut_truth90": "That’s cute!", "imran_srk007": "🤣🤣🤣🤣🤣🤣", "sagarnism": "@nsayantani", "tanugavali": "@sh.sayalidamse", "nadimkhan06655": "👍👍👍👍", "sunilgoradiya18": "Bahut badiya mam", "saqibtech33": "😂😂 struggle is real, just a cat thing😁😍", "_born_eeee_ka_": "@not.so.awwnsola", "faheem.273": "Superb Shandaar", "beary_monu": "😂😂😍", "_khuda_aur_mohubbat": "Lovely 😍😍😍", "narayanshankerbhatt": "Swara... 👏👏 ... Hope you dont blame RSS for this billi ki saazish... nonetheless... pure fun👏👏", "silent___143___": "❤️", "aartipmakeup": "💕💕💕", "abbadabby_doo": "😍😍", "shizzu.khan": "😂😂", "tranquil_dreamz": "So cute", "zubairahmad698": "salaam mam", "pradeepnagarajreddi": "😂", "just_being_serene": "Hahaha this is so cute 😂😂", "raresoul1976": "😂😂😂😂♥️♥️♥️", "richamisra_": "😂😍💙", "shubhendu2015": "😄😆😍", "mansoor.power.35": "😍😍😍", "taiyab_choudhry_": "😂😂❤️", "littledemon76": "What is the point of keeping these animals?"}