{"chinto.joe.js": "Whoever is human please report her account. We don't need fake secular biased people.", "_.rohit._19": "Justice for Sadhus #palgharcase #hindusarehumans #wewantjustice #exposesthepseudoseculars", "abhinav__oberoi": "Lawdi bhenchod randi ki aulaad", "tripti.roy252": "@reallyswara 💩sakal bhi or akal bhi", "funwithamritanshu": "Bay teri ke. Phin jhuth", "ravii8138": "Modi lao desh bachao ...@reallyswara", "terababu92": "Bhenchod tu actor hai?????bhikarn sadi huvi shkal teri", "bairagiuncensored": "Faati choot @reallyswara", "ramyadav_12": "lund k brabr hai tu dekho jhat si shkl ki", "sood946": "Ek chutiya or dusri bade daanto wali randi chudel", "kumarsinha_amit": "Halala karba rahe ho kya", "the.royal.kabir": "Awesome", "un_known_peace": "Suvar jaisa muh... only Fake person on planet.. jisake pas na aadhar hai na voter hai na janm ka pramanpatr hai...", "shubam__22": "Jai ho modi ji ki", "aich.design": "Cutiya gandu", "gkmph735": "पीछे जो महानुभाव खरे है उनका कभी ल,,,,,,nd लिए या नही,,,वैसे तो कहा किसी को छोड़ने वाली है। 😊", "jiturathore7773": "Tu spe nhi he tere bff k kyuki usko bezati nhi kerwani esse kalmuhi nikkami mullo ki chantne waale fingering waale scene kerne waale besharam behaya", "sonutiwari2003": "Markaj ki nachaniya", "shubhangi_singh___": "Suar in pink😂", "adisharma30042": "@reallyswara oh! Ho to iska le rhi khurak rafiq halala ki to ye h tere secular raand hone ka raj", "isaabellaaa235": "Auntyy", "libarandu": "Bolo Randi swara", "rajputajaysingh333": "Chutmari ki", "isupportyogijii": "Abey iske sath hi marwa rahi thi 😂", "abhinav_varshney001": "How lucky is she @reallyswara aisi shakal ki auntiyon ko bhi bollywood mein chance mil sakta hai waise koi si picture mein aaui hai kyunki logon ne shaheen bagh se jyada popular hai ye", "x.___yug___.x": "Pakistani h ye", "indian_models1122": "Bakwas pic", "dhruv_padit": "😂😂😂❤️", "bhatia_oo7": "randi bkl", "prash_pp_pp": "Ha😂😂😂 shaheeen bagh mein sadko pe 500 main. Baith rahi theee 🐖🐖🐖", "sweet._kudi9": "😍😍😍♥♥♥", "dk623_9466": "Ye hain iska pati jo iska chut Marta hain rat koo Din me nere pas aaajana awara", "navindhyaniphoto": "@s.o.n.i.k.a.k is this @kuk_umesh ? 😂🤗", "661shubham": "Bjp jindabad🚩 swara ki maki choo😂", "mrigank_b": "Saali kitne maulana ki paidaish hai ye laudi", "harshayush": "Aunty birth certificate Milla??", "_sagarhande__": "Tatti", "ritikprajapati002": "Anpd", "_ninadkulkarni_": "kagaj dhund", "tejas_jadhav_200": "Swara ka __________ (fill)", "niharika000002": "@kureel.manoj check this guys 😂😂😂😂😂😂", "jamaican_monster": "BOL MODI JI ZINDABAAD💯", "kiran_3814": "Escape from mental hospital", "kp291972": "Aunti koi mudda nahi hai to iske khilaf lado", "smd95044": "Happy Birthday to you swara ji advance me God bless you", "dhawanil": "I support CAA NRC🔥🔥🔥🔥", "chaurasiyaboy": "😂😂", "code_990": "@imrubikaliyaquat आपके सपने मे आती होगी...... Draft कहा है 😂😂😂😂", "raashi_rastogi": "Nice", "shubhampanditji442": "Deshdrohi ho tum", "supriyabadola365": "Seriously!! Plz don't troll her let her watch Pogo ...she have no sense , she have zero knowledge of politics...I don't why she can't say something about tablegi jammkat why you don't take stand where is your ethics u r always standing for the wrong ..well I still remember that day when 'the best Anchor 'rubika Liyaqat roaste you😂😂😂😂.... dumbest lady I have ever seen...Modi ji zindabad🙏🙏@reallyswara @imrubikaliyaquat", "avantika.kumar": "happy birthday ma'am... ap hmesha aisi brave, badass raho.. india ko bahut zaroorat h aise logo ki thank you ❤️. . ❤️❤️🙌", "abhi.saxena_": "Chiiiii ulti aa gyi isko dekh kr", "iamsaiyedfahim": "@tanmaybhat is this you or what ?? 🙄🙄🙄", "_ameyaupasani_": "Get out of our country", "adeeba_khan___": "❤️❤️", "chandan_parashar": "Free baithi hai...kagaaz hi dund le...Dikhana to padega....#Vibratorqueen", "vivacious_soul01": "Randi ki bachii h Tu👎👎👎👎🤬🤬bsdk pakistaanio Ka lund leti h Tu bhadvi Teri maa marjaae coronavirus se", "manveirr": "Useless bitch", "mr.perfect14370": "Mtlab aise shakal hai Teri k loose motion jaise😂", "_me_abhishek_sah_": "Namo again...💖", "tjtj2011": "Ewwwww Ugly", "va.ni6756": "❤️♑️♑️♑️❤️♑️❤️ m m. M m m m. M m m m@ m. M p#♑️❤️♑️❤️♑️♑️♑️♑️♑️♑️♑️♑️♑️♑️♑️♑️♑️", "rashisharma52": "Jai ho modi ji ki🙏🙏🙏", "premguru41": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "sharma_mannat06": "Hate u", "ritik3857": "Report this account for spreading heartening speeches", "hector_el_fathar": "Bitch deleted my comment 🤣🤣", "rjhamzaa": "@reallyswara My kidney crush on ur eyes🔥 Chk ur DM", "sooraj_the_burnig_sun": "Flop Aurat... Tere Jaisi Kitni Bhi Suwariya Aa Jaye Modi Ko Ghanta Kuch Fark Nahi Padta Samjhi Chutiye.", "bharat.kumar.18007": "🐖×🐷=swara", "abjaiswal99": "My shit is better than your face 😂", "abhipathaniaa": "Hey saver of the Constitution ! What have you done to aid the people who protested with you ? Or you come forward only when your agendas are fulfilling , huh ?", "earth_serene": "Saali desh drohi harazaadi. Bhagwan kare tereko coronavirus ho jaye aur woh bhi muslims jis fruits pe thuk rahe hain usse ho ya kisi muslim ki wajah se ho. Tu dekhna aise hi maregi. Aur uss din hum log bolenge “ahahahahahahahaha” “haaaahhaaaahhhhaaaahhhhhhhaaaaa” marr gayi saali randi jaat ki", "jayesh3327": "Aunty ji Mack up Kitna kiya hai... Koi uncle Mila Ke nahi 😂😂😂", "shikhaca": "Matlab 2014 se hi aap pareshan ho Modi se😂😂😂 @reallyswara Jai Shree Ram🙏", "salat.amit.1": "❤️❤️🔥🔥", "montyk1921": "Aunty find the papers 😂 along with your buffoons kunal kamra kunal gandmaraa 😂", "1_harshit_namdev_1": "Madarchod randi muslmano ki chinaar kya hua khatam abb bol nahi ki daan karo", "pooja__gupta19": "💩💩", "mdsalmankhan7619": "Get a life bitch", "kartikay_the_fitness_monk": "Waaah randi chudne ke baad baithi hai iske sth photo khicchane", "akshaykumardiehardfan1991": "Pakistan ki sasti cheap full rand", "_.lonee._": "You whore", "avinash_verma721": "the best deshdrohi award goes to swara bhaskar", "meenu6245": "Iski sakal se hi nafrat h muje aak thuuuuu", "sandipbadbola": "Randi saali", "nprassin": "Bloody bitch", "shivangi_raina111": "Love you Swara😘😘😘😘😘", "imrityunjayshrivastava": "Ayeee tatti insaan, aaj left wing ne kitne paise diye?", "kd._.x7": "rand aurat", "hemalvashi": "🖕🖕🖕", "manjeetsingh1847": "Jaahil Ourat", "sanjay_chanda_kalal": "Desh mai aaye itne bde sankat mai aapne kitna donet kiya hai @reallyswara", "i_am_piyush_rai": "Jab tum 10 saal ki thi 2014 me 🤣", "gymfreak51": "O pagal aurat aaj raat ka kya scene hai 9 baje ka. Salli Gadhe ki bachhi kabhi to acha kaam kar le. Dalli", "abhinit_khanna": "@rafi_sen are you still active on Instagram? I think we will need to whatsapp him. Last time I had to teach him how to use Instagram I’m sure he’s forgotten @reallyswara", "the_religion_universe": "Jihadi Islamists = Madarsa Maulanas = Naxalites = VIRUS 🗣️", "bhagwa_sena": "@reallyswara chal be congress auweshi ki chatu... Des ki kuch padi he nai kuch knowledge he nai bas aa gae sari pehnke ijjat nikalne apni", "pankajlodhi112": "Saali kutiya ... Maregi jahanumm me", "awokehindustani": "How much are you paid for being a propagandist?", "some_known": "Aree Randi Bhaskar kitni Baar chudwai iss londe se apni sadi hui kaali chut m to Kisi Ka bi lund ghusa leti h Tu to Raand ki aulaad😂", "vishalmishra_07": "Supnekha part 2", "rajeevmehra369": "Kill muslims", "surajrawat100498": "Kis kis ye chutiya lagti hai hit like 🤗", "keystrokes_warrior": "Mar gai kya ab feminist wahan nurse pe ho raga atyachar nahi dikh raha isko #fakepeople #fakenews", "krishna15sharma": "Behen ki lodi", "ravi3g2018": "😝🥵💩", "amar_since90s": "Urban Naxalite", "v3_onboard": "Didi kitne ka donation diye ? Ya khali ghar Bethe carbs pel rahe ho 🤣", "divine.girl__": "There is only one word for you 'Lawdi'", "sakshamguptaaa_": "Kro ab contribute ... Kya hua aunty", "appijoshi2": "Chakki", "somya.jena245": "We are not hate Muslim neither they .hate rate to aise log creat kar rahe hain hamare andar sab galat chiz bolke.hum hindustani hain sab milke reh rahe hain age v raenge .swara hi dont ur also a hindustani.so plz dont spread heatrate", "vivek.khanna.96199": "Get well soon swara", "pdhiman007": "एक लज्जाहीन स्त्री जब कामातुर हो जाये तो उससे भयानक कोई और नही हो सकता, वो तिरस्कृत होकर अपना और दूसरों का सर्वनाश कर सकती है ! #स्वरा_भास्कर", "saucastic": "I think now you are HAPPY.. Now your team (I.e OWAISI, that fake waris pathan, ASSHOLE LIKE DHRUV RATHEE jo saale ande se bahar nahi nikle woh baithke videos bnate hai) propaganda actually burned down poor hindus and muslims house. Have some shame and from next time onwards read full documents regarding CAA, NRC and NPR tum saale JAAHIL log desh mei aag lagaoge.. Tum saalo ko CORONA aspect mei bhi ANTI MUSLIM and DANGER TO LIBERTY dikhta hai.. LIBERTY my ass.. Agr yeh sab ABROAD mei karte abhi tak JAIL mei baithe hote.. Try to be a RESPONSIBLE PERSON AFTER THAT START GIVING TALISMAN TO People.", "abhishekkumar887700": "Kuch donate hua pm relief funds main no news morning. Kya hia", "imrankhan.pti.bhikari": "Kaisi ho swara jii , Woh main kehna Chahta Hu ki iss Baar payment Nahi de paunga , halat tight hai", "swarajya_garje": "शूर्पणखा शक्ल और अक्ल से बिल्कुल स्वरा भास्कर है.. #रामायण", "_pandapohhhh_": "My house help is on leave can you come.. I’ll pay you 600/- for a month Tuje toh Corona nai hoga na..", "dhanraj_dodia_702": "Nikal Randi", "anshul__agarwal": "Are swara ji ab jo log bas ke bahr spit kar rahe he vo aapko bhaut proud feel ho raha hoga kyoki aapko bas NRC or CAA galat laga or ye sadko per spitting , doctors ko marna or police ko marna aapko galat nahi laga", "roshan_4153": "Kalyug ki manthara 🤣", "jais260894": "Kuch relief fund m dia ya bas paid bhasan doge aap . Aise kaise hoga didi", "pushkinbhattacharya": "Here's looking at you and the pic....finally no need for candles any more I presume?🤣🤣🤣", "ajitsingh2053": "Kitna help ki h Tu..desh khatre m h smjii kha chupi h Tu.. social worker Bhar aa Kam se Kam ek kutte ko roti de De...", "adityyyaaaaaaa": "Dalli", "sumi_da_invincible": "What happened mam now... aap jhanda buland nahi kar rahe ho??? Tablighi Jamat ke liye aap kuch share nahi kar rahe ho... do something for them", "yogeshberiwal_": "Behn ki lodi ab bol na kuch", "arman.choudhry": "Swara bhaskar zinda bad", "semy876": "Ye chudel zinda he ya Mar gai, CAA n NRC pe to bahot bhok Rahi thi, Corona se Gand fat gai Kya, Dekh le jiske liye tu mar Rahi thi wo log Kya kar rahe he.Shame on u.", "prateek6027": "Sawara unty ji", "kartik_1080": "Just wanted to let you know nothing will happen all guys right there she is a bitch😂😂😂", "iam_synchronised": "For Daily Motivational Quote just check out my Account .....PLEASE ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kananbuch": "So Ms INDIA MY VALENTINE.... How much have you donated for the benefit of INDIA & INDIANS????", "rahul18_rt": "कलयुग की मंथरा आज कल तू कुछ बोल नहीं रही है तब्लीगी जमात वाले तेरे अब्बा है क्या ???", "jyotibose1809": "Guys if you acrylics your country please start unfollowing her .... you can still comment on her profile.... so please make her unpopular", "dudivibhanshu": "Agar ghar me hi h to jara kagaz hi dundh le", "mr___samrat__": "She was 17 years old back in 2014😹", "zamzamshayar786": "👏👏👏👏i support u", "nehasingha": "y don't u donate some money to fight against COVID-19.??? ooh sorry ...u r too poor to give anything ...", "ramkumargahlot": "Eska bhi katega", "vikee_001": "मंदबुद्धी 😂", "beindian008": "Kitna ghinona muh h 🤮🤮🤮🤮🤮🤮🤮 Shaheen Bagh ki jihadi nakli aurat", "samaelucifermorningstar666": "Ab kaha mar gai randi tera aur kanhaiya kumar ka mms bana rahi hain kya😂", "davinder_chahal06": "Iske kheelaf kuch bhi bol do...sare Pakistani aa jynge comments mein maa chudwane😂", "asmamariyam93": "@fauziaanam @shafaqueiqbal", "sharmavidushi55": "Jamati k land se nikl swara ....tum unn lauduo ko support to kro .......tmhri communist maa or jamati baap ka target poora kro .......", "surajsingh4991": "Maa ka bhosda teri mc", "anujphg": "Kutiya ke bachi ab kyou chup ho.....carona pe jo yeh log jo kar rahe hai .....uspe apni suggestion nhi dogi😠😠😠", "rohitanandpatel": "Manthara", "dharmendra_prasad_d": "Sara Bhaskar madrachod Gaddar suar ki aulad Randiya madrachod", "su.nita2908": "Paise toh de de", "harsh_8864": "Dono namune hi lag rhe hai😂😂", "arjunam_100": "🖕", "aryantanwa": "Swara u r jihadist backward 😂", "maya_annanya": "Aunty toda Apne flop career pe Dayan do 15 mins se jyadha role nai koi movie mei .jo time modi gvt ko troll karne mei laga rahe ho vahi time apne flop career pe invest karo", "rodubey": "https://www.facebook.com/305618449565617/posts/2730207480440023/", "acerossmatthews": "Abe Randi. Woh doctor ke saamne nange naach rahe hai, kuch toh bol une. Yahi sikhaya hai kya unko? ab toh neeche se ungli nikal! Rand kahi ki!", "deviljay_501": "Jitega toh MODIHI", "anil_lole": "Kaha chupke baithe ho tukde gang wale.. corona se darr lag raha hai?", "me__geet": "@reallyswara u hypocrite bitch !", "ankitmehta85": "What is your response to it ? Being the protector of Indian constitution please throw some light on this matter", "singhkunalpratap": "I just watched ur nude video of some B Grade movie where police comes and u r in underwear... Why dont u do that in real life u will earn more money than ur current condition right now... Film to mil nai rahi hai aapko to kisi tarah se famous to hona hi hai TV par ana hi hai... Suna aapke pas koi v document nai hai mere uncle se shadi kr le main aapko document bana dunga to aap indian ho hi jaoge aur proof v mil jayega... Aur kabi kabi hme v maje de diya krna apne hatho se bana khana khila kr didi 🤣🤣🤣🤣🤣🤣🤣🤣🤣. Aur ek baat ap sahi boli aap school college nai hi gai ho qki apki baate bilkul Gawar anpadh aur jahil jaisi hai 😂😂😂😂", "dhruvchaaudhary": "Kindly evolve your mentality and stop posting bullshit for publicity!! @nehadhupia mam se kuch seekh lo aur social media p bakchodi kam kro warna bht mehngi pad skti h - INDIAN", "niks_9012": "actor,dramebaaz person. a lot more than Bollywood,As someone once said,a good kid that,, true lines lol😂😂😂👌", "hshjsjsuwiawusiauisis": "Madarchod khula yaha se pakistan gaand marao mulla or molki k saath jaake bahen ka lauda", "kulkarninikhilesh": "2020 ki shurpanka 🤣🤣🤣🤣😀😀", "ansh_officialpage3": "Picche se dal raha h but uska cchota h isliye swara aise mu bana rahi h 🤣🤣🤣", "smd_abs": "Kya soch rhai ho swara \"mom batti jalana hai ya torch\"", "asitpal056": "Madam aajkal ekdum underground ho gayi. Markaz walo ko appki zaroorat hai😂😂😂", "ashwarya.inda": "Who said anything abt congress coming to power next , all i say is that our current govt in inefficient country in d worst condition ever (worse than it was during Congress regime ) n yes i m samajdar enough to realise that", "awwnuj": "U asshole bitchhh", "banna57359": "रांड", "dashing_devesh_official": "Hey bitch come out and donate for your tukde gang 😂😂😂", "user_name_not_require": "You fckin terrorist", "concormanish": "सुना है आप pm cares fund में एक करोड़ रुपये देने वाली हैं", "rupali.singh690": "Your acting in raanjhana was superbbbbbbbbbb...🙌🙌🙌🙌😍😍😍😍😍", "chowkidar_sudheerisvd": "Desh ke Gadar swara ko Corona hojay saali ko", "loveurself001": "Kitni nalayak hai ye swara hamesha galat Muslims ko support krti hai aur abhi tabligi jamat aur baki Muslims corona faila rahe hai doctors, nurses, police ko mar rahe hai, thunk rahe hai, unpe nai mu kholegi ye beshram @reallyswara", "patricia.iallister_traveler": "I want to give you a award for the role in \"Veere di wedding\"... Amazing performance!!!!!!", "beingshadabkhan2": "Nyc diii👍", "elfishpresley101": "Look at this pseudo-secular, uneducated, hypocritical idiot trying to avoid all the confrontation and the situation that happened recently. No wonder she’s not getting a fucking job. She can’t act but she will say shit that she isn’t aware of half the time! No wonder she got admission in that unworthy college called JNU where students don’t even get jobs.", "imsameerjk": "Mam morna ki 1 news hai naharsing ki ...meri story par dekh sakte ....jisko media chhupa rahi hai", "its__mack6": "I am with u and against payal rohtagi plz support me👏", "bna_gssolanki99": "kalyug manthra spotted😂😂🔥 jali pdi h iski bhi", "raman0165": "Chod du teri kaali chut phek du tujhe nanga Tablighi jamaat mein", "millionsmacks": "Gali gali mai soor hai suuar bhaskar chor hai🙈🙉🙊", "aakaash_soni": "Kutiya kahi ki..Sorry kutiya ko gaali lag gyi..", "lost_shenyu_trivedi": "Swara got no chill🤣🤣 gand fatt gyi ..swara ko toh re aise dhak dhak horeli h", "_het.shah": "You fucking idiot, when nurses are being sexually harassed by some idiots, why you didn't tweet at that time, you are a just a attention seaker, #leftistfuckoff", "sachin_nagar9": "Aae pagal chudail tu light jlaegi yaa apni Jlaegi🤣🤣🤣🤣🤣🤣", "the_sudhanshu_patel": "सुवरा भास्कर🤣", "iamsrivarry": "Wonder woman!😌♥️", "debasis_8763": "Swara didi ab boliye jo delhi me ho rha... Pure desh me muslmaan jo kr rhe", "sanjay.singh02020": "👏", "shital0678": "Coz tab aap aag ni ugla karti thi", "adv.zeeshan.5": "Lovely pic❤️", "mimiqueen332": "Why not make a video about coordinating clothes?it's exited 🔥", "kansagra_vaibhav_patel": "#स्वरा_भास्कर_पेसे_निकाल jo tumne ungli daal ke kamaye the 😂", "pandeyatul348": "Ungli kro ghar me rho", "musicforlife_14all": "Guys we need to understand one simple thing .. she is able to deliver so much hate and negative things only because she knew that people gonna react and keep commenting on her every bullshit post and story .. so like to fight corona only solution is distancing..solution for such a devil person is to unfollow her and stop commenting on her post #unfollowswara", "apooravjain": "Suar ki beej", "dhruvayan": "@reallyswara kon lekar aye thokane kabhi hame bhi bulav teri choot ghasne ko🐎🍑🐎🍑", "bisht9080": "In logo ka kuch kro yaar... Desh barbadi ka karan h ye log.... Hypocrite morons", "amittchabra": "Tere Tablig Jqmat wale virus faila rahe hai tu kya kar rahi hai", "adanurappa": "Hello madam where are you now? Your relatives and do called secular friends, you always used to support are behaving like nuts, spreading disease to innocent people's! Why can't you stand by them and educate not to go so?", "gunjan.kala": "Mental Teri bahanay ab 500 lay nay ja rahi hai wo bhi kagaj lay ka to unko mana q nahi kar rahi wo bhi to modi sarkar day rahi hai..... Ab Kuch nahi bolay gi", "honey_zubair_siddiqui": "❤️❤️❤️❤️❤️❤️❤️ @reallyswara", "sumit.pandey18": "MADHERCHOD randi", "priyamishraa30": "Sudhrogi nahi tum... hai na..", "janhavirajput": "Heyy...please post something about Violence happening on the Doctors and Police in this situation as you are a very bright woman who always takes stand against wrong things! Or maybe it's not wrong for you?", "funny_meme001": "Itti desh ki fikr h to ab q desh k liye tu contribute nhi krti? Ab ftt gyi teri? Mullo k lye bht jldi aage aati h..ab q kuch nhi bolri?", "independentgirl001": "Hello aap please Muslim bhaiyo ko vaise hi bhadkao Andar rehne ke kiye jaise CAA ke waqt bahar nikalne ke liye bhadkaya tha. 😂😂", "kritisharmashayari": "Suwar Bhaskar", "glasseyeindia": "So many filthy hindutva scum!", "im.ranjeet": "And from that day...You have been my favourite😍🙏❤️", "chiragguptta": "Randi jihadi", "barfi_1312": "2014 was the most happiest time kyoki tabhi modi ji pm bane the aur jinhe acting nhi aati h unhe bhi dher sara kaam mil gya modi Ji ko oppose krne ka ..right ???", "ankit_19035": "Bhikhari actress of Bollywood !👌", "desainehaa": "You just spreading hate that's all... Shame on you and your upbringing... This is very good time for you to look within and open your fucking mind... your hatred is more than your love for this country... Shame on you really", "balesh": "Paise de do didi", "krish17k": "U r ugly", "hunny0912": "Ghar p ho kagazz hi dhund lo 🤣", "ck.ray": "Hey bitch. Gaand mara li", "mayursen04": "Didi Jinda ho ya Marr gyi", "rudrapandey4289": "Kya chachi indore mein health karam chariyo pe pathar barsaye gaye muhh se kuch phatt kyu nhi raha delhi ka danga mein uchal rahe thee badaa abb kya hua NRC sungh gaya", "sofiarahmanafzal": "😍❤️👏", "equinox001": "She is a hypocrite . Sympathiser of anti nationalist", "pransh_21": "Kutiya sali", "kk7074669": "Your parents are so unlucky that they gave birth to you", "belalk69": "🔥👌", "shivangpathak_": "Madarchod", "indi_shinchan": "The amount of hate this post is getting is unreal....@reallyswara you are doing something incredibly right. That is why you have managed to get all these people moving against your direction. And for the people who are abusing in the comments.. Don't u guys have to bang your plates or something?", "_._.neeraj": "शाहीन बाघ नहीं जाना अब", "goldybabaa": "Looking cute ❤️", "mointhefreestyler": "💝💝", "sweetjaat": "Carona h tu desh k liye", "jawedsikku": "Wow bhut smart lag rhi hu yaaar ohhhma 😘😘😘😘💋💋💋", "sudixit0102": "kya hua ? ungli nhi kr rha kya ye ?", "tiktok_university1": "@reallyswara Matlab ajib bakchod dikh rahi ho be 🤢🤢🤢 Kuch bhi post kar dena hai dusro ki ulti ka khyal kar lo 🤢", "coolkumar1995": "Why don't you speak about current crisis that is tabligi jammat issue, are you scared to talk against muslims who are creating pandemic?! They are causing disaster and chaos in country saying gathering and praying together in mosque will save them from corona and when doctors are approaching them to help they are pelting stones and splitting on them. Instead of ranting about the Hinduism, stop bitching about religion and raise your voice against the people who are creating imbalance in the country. I am sure that you haven't donated any fund for the corona issue in this country, it is the last thing expected from you. Atleast contribute to our country by stop talking about any religion to create hatred and start raising your voice against the people who are creating chaos.", "raju_1824": "Very Nice Sister...", "its_bhargav_dubey": "Jab doctors ko maar rhe the to tere chut ki aag kaha lagi thi randi saaali vaishyaa", "aakanksha_desire": "Idiot girl", "sangwan_rittu": "Jab bhi muhh kholti hai sirf muuh se hagti hi hai...", "neeraj_malhotra7": "Diya jalane ke upar itna Kuchh likh rahe h magar thukne Patthar Marne battamiji karne walo par koi Kuchh ni likha na hi gyan de raha q??? Desh drohi kon??", "rahul.vv": "Get a life bitch", "dharmveersambha": "उन दिनो कितना अच्छा था ना कितनी अच्छी ॲक्टींग करती थी रान्झना, तनू वेद्स मनू क्या फिल्मे दी तुमने बोहोत फोल्लो करता था तुम्हे लेकीन आजकल जो चल रहा है तुम ऐसी नही थी क्या हुवा स्वरा बोलो क्यू एतने बदल गये आप....", "takshak1987": "Ye sirf hindu ko gali degi faisal hai na, aur waise bhi kisi communist means terrorist ne ek paisa bhi kisi CM fund me nahi diya sirf bakchodi krne aa jaati hai, iska to depression me lana hai, jitne bhi jehadi hai sbko depression me lana hai", "virenkumar827": "💩💩", "smwhtlatelatif": "Its a lovely photo!! How those times were always “simpler” and “happier”", "praveensahu30": "Saali bht desh k samvidhan bchane ki baat krti thi na... Ab donate kyu ni kr rhi corona ke liye. Tera dogla chehra pta h hmko.. mulli kahi ki.. hindu religion jindabad..🚩🚩 hindustan jindabaad.. modi jindabad🚩🚩", "alinabrezza": "U r the best lady ....who was standing 4 the right.....luv u mam.", "samssential30": "Hello @reallyswara maam.Aapne kuch desh ke liye contribute kiya hai kya ke abhi bhi modiji ke against hai?Abhi jab indore jaise jagahon par logon ne badtameez ki,aur haan aapke dharm vishesh ki,tab aapne nhi kaha ke wo galat hain? Aapka sahi galat itna dogala kyun hai?", "kavitas576": "@reallyswara jamaat k log nurses k sath badtamiji kr rhe hn unpr kuchh bolne ka kasht karengi ya abhi bhi propaganda chalu h??", "r_shubham77": "Worst worst lady", "md.dilshad.982845": "Is to be lockdown swara mam...", "mohd.rafey": "❤️", "adubey897": "Murkh..", "sspkudla": "5th April are you going to burn diya or your hatred", "sndeepvaltoha": "👌", "mohit_kulkarni96": "Also, Pre-BJP Era😍😍😍", "man__parmar": "❤️❤️❤️", "vishuu2689": "@reallyswara nijamuddin me lecture deke aayi na tu acchese👆", "r_bhardwaj1992": "Hum single smjhke follow kr rhe the......... E kaun hai??", "shailesh.jadhav.9461": "Bander bhi tere samne khubsurat lagti he. Tere shea Bhadi aurat abhi tak nahi dekha maine.", "adi22sharma": "U bloody Hippocrates", "reallyswara\nVerified": "Verified", "singh_akash_1": "Bhut der se gaali dene ka man kr raha tha to aa gya, ab soch raha hu gaali ka kyu apmaan kru🤐", "iiisanjay": "Ye gandwa kon h saath m?? Pakka jaahilo m se ek hoga 😂😂😂", "swapnilrajkhowa_": "Best actress nahi mila kya? Itni acchi acting karte ho😭", "thinkster2.0": "Happier times bcz till then haven't fucked you", "pathan._.sahab._.bolte": "❤️", "suxena__world": "Re ye toh Manthra hai....... Mamama Manthra", "nagesh2494": "आंटी ने कहा है कोरोना वायरस करा लेगी पर दिया नहीं जलायगी।😜", "asifshaikh2656": "Mam ye wahi kutte bhonk rahe h jinke ghr me females ki izzat bajaro me rakhii jati h or me manta hu ki kuch Muslims ne glt kiya doctora k shath wo glt h prr ye kutte apko isliye glt bol rahe he bcz ap in kutto k papa modi ki glt nitiyo k against hogye or ye un Sab ko galiya dete h Jo modi k against ho chahe wo inka bap hi Kyu na ho", "motordestination4": "I m reporting against swara for spreading fake news and u guys can also report", "caran1758": "Please report her account 🇮🇳🙏 no need to abuse just report her account.. 🇮🇳🙏", "panks008": "Swara please say something about...tablegi jammat...your comments matter...pls Don't bias...you have to speak on every national topics...😎😎😎😎or you a bitch.....", "gaba2445": "Tatteeee", "ahmdnzaft02020": "Ok❤️❤️❤️❤️❤️❤️❤️👏👏👏", "se7enty_1_": "@reallyswara #legend", "pokhraj.roy": "@reallyswara I LOVE WHAT YOU ARE WEARING!", "qureshigulzarqureshi": "Nice", "dabangg.khan.786": "Cute smile", "faheem.273": "Bahut khoob", "rumslove2318": "Kya khub lagti ho bari sundar dikhti ho❤️❤️❤️❤️❤️❤️@reallyswara", "lefttist": "Guys follow us for political contents", "shajahanhaja": "Support", "982.tina": "beauty", "_x_vaidik.x__x": "Bhenchod lodi ab kya kar rhi hai bey tu? Kuch kabhi karle dhang ka kaam bkl @reallyswara", "swapnil.k.singh": "Tabhi zee cine awards ki koi kadar nahi Karta.. kis kis ko kaise kaise award de dete hai..", "paresh9285": "Lovable sis", "patelnitin12": "Who thought that this face would ultimately come out as urban Naxalite in future", "ironicalzion": "Suar Aurat", "arun_yamjala": "Hindusthan ka drohi ye chinaal @reallyswara", "rathore.mertiya.1": "❤️❤️😍😍", "sonumjan": "hot look", "mohantyswayam": "Mam I like your thoughts.But I have small request for you,please tail people for cooperate with government🙏It’s social emergency time🙏Not CAA OR NRC AVT ITS TOO BIGGER PROBLEM 🙏🙏", "nakulshah83": "Constipated looks se leke constipated thoughts tak...", "yadavyadav82": "@reallyswara jo doctor in ki jaan bacha rahe hai ... Tumhare najayas bhai unke he upar thuk rahe hai Bhenc@@d ab kyu nahi bol rahi hai bc r..nd kahi ki ..dalli bc", "sherryoscope": "I think the one silver lining of Corona is that it is a harbinger of Simpler Times. I hope people become old school and start valuing people and respect becomes the norm instead of sarcasm !", "alteregoprofile": "Pretty💜", "prashant_092pandit": "#manthara hahahaha lol😝", "patelkams": "Markaj tum nhi thi", "sunilnihalia": "❤️❤️", "sahil_6173": "But why he looks like sahil khan @sahilkhan", "flyingofficeryusuf": "Tremendous", "shashwat_nayyar": "🌹🌹🌹", "rampatel535": "Pagal aurat", "shohel2058": "🤦‍♂️🤦‍♂️🤦‍♂️", "lamia55555555": "🔥🔥😍😍😍😍", "op_zaid": "#BoycottGodiMedia", "mr_arsalan_78_": "🔥🔥🔥🔥🔥", "anjalajamal": "😂😂😂", "deep.ika707": "😍", "naushin_99": "❤️🔥🔥🔥🔥", "danishkhan8110": "♥️", "love_guru_specialist_904": "आपके जीवन के अंधेरे को जो दूर कर दे आपके निराश जीवन को जो खुशियों से भर दे नामुमकिन को जो मुमकिन कर दे गुरु विक्रम शास्त्री जी महाराज द्वारा हर समस्या का समाधान करवाएं तुरंत +91-7296967786 (1)💑प्रेम समस्या समाधान💑 (2)🤐love vashikaran specialist🤐 (3)👫husband wife problem solution👫 (4) 👰लव मैरिज स्पेशलिस्ट।🤵 (5) 🌚black magic specialist🌚 (6) divorce problem solution expert (7) 👨‍👨‍👧‍👦पति पत्नी में अनबन एवं। गृह क्लेश से छुटकारा।👨‍👨‍👦‍👦 (8) 👶child problem solution expert👶 जो बनाए बिगड़े काम गुरु विक्रम शास्त्री जी महाराज हैं उनका नाम सभी जगह से निराश लोग एक बार जरूर आजमाएं रोते हुए आओगे हंसते हुए जाओगे। +91-7296993251"}