{"earth_serene": "Saali bitch. Speak about 25 sikhs massacred in Gurudwara in Kabul on 25th March 2020. Kaha gaya tera josh? NRC ko oppose karne wali anpadh gawar bitch", "umaginati0n": "Godi saheb, kitne fake accounts banaenge?? Tabhi dikhai nahi dete kabhi kisi press conference me. Ab godi saheb kisi fake account se reply karenge. 😂", "harsh_singh410": "You cannot s|eep in peace by dividing ohr nation.", "7ssssachin": "#ihateswara", "sweet_queen_princess_cute": "Happy birthday to you 🎈🎂🎉", "poojacjoshi": "Shali desh dhrohi👎🏻", "sharma_mannat06": "Hate hate", "j_sin25": "Yuk ugly", "ritikprajapati002": "Ampd ho ap", "paanchgram": "Aao azadi lelo", "jamaican_monster": "@reallyswara BOL MODI JI ZINDABAAD💯 & Hindustan Zindabaad", "schaudhari248": "So beautiful ❤️❤️🌹", "samruddhichitnis": "Bilkul chuitya lagrahi ho swara aunty", "utdu20": "@reallyswara Were you a male who have undergone gender change surgery!! Well, it seems so🤣 Wear a skull cap with checks lungi. You'll rock the outfit. Don't forget to get circumcision 🤣", "akki_soni47": "में कटीला बांस । तुम साधारण डंडी प्रिये।। में ठहरा कट्टर देशभक्त। तुम शाहीनबाग की रण्डी प्रिये😂😂😂 @reallyswara", "mani_babu1": "@reallyswara काश तेरे माँ बाप उस रात जल्दी सो जाते तो तेरी जैसी राँड़ का जन्म ही नही होता😠😠😠😠", "priyanka_thakur0_0": "Ja wkalat me lg ja", "illuminati_prakash": "Skl na surat naam swara basker🤣🤣", "theprimeministerofpakistan": "Ab Kha Chup Baithi Hai Kutte Ki Aaolad...????????? Santo Ki Hataya Per Kyu Chup Hai..... Tuuuuuu Hain Tujpr Swara Bhaskar", "therealganeshh": "Flop actor/flop activist worst transgender", "vidiyo.app": "💚💚💚💚💚", "nationalist.sahil": "🔥🔥😂😂😂", "ana_maina_taina": "When are you donating money?", "avinashtwr4": "Mam movies toh ab apko milegi nahi toh ab shaadi karo aur uske ghar main aag lagao jisse shaadi karna....waise shakal apki gobar pe truck guzar gaya ho aisi hai.", "dhanraj_dodia_702": "PFI ki agent dogli", "harshit_chauhan.messi": "Aunty", "rajeevmehra369": "Hello tranny. Namaaz padli? Maadarchod teri family ko corona hona chahiye", "neeraj_malhotra7": "Diya jalane ke upar itna Kuchh likh rahe h magar thukne Patthar Marne battamiji karne walo par koi Kuchh ni likha na hi gyan de raha q??? Desh drohi kon??", "tanu___1998_": "Bhen ki laud", "gunjan.kala": "Kitni buri lagti hai tu Pata nahi film industry nay kaise lay liya tujhe..... Mager apni galti ab sudhar rahi hai film industry", "onlyanshu": "Betichod", "chandan_singhofficial": "Dramebaaz", "mdsalmankhan7619": "Chup bhosdiwali", "priyanka.0409": "भूतनी", "brandon080w": "Aisi raand ek do to chahiye hi chahiye", "the_sarcastic_tone_07": "The manthra of modern india...koi isko joota kheech k maaro😠😠", "pp2612942": "Chudail🤣🤣🤣🤣", "thedev.108": "Kaha chali gayi, kuch donate kiya ya fir se Saheen baag jaogi??? Log memes bana rahe hai Swara get vanished😂😂😂", "gogreen.ted": "Enough supplies for yourself....but what about your comrades at Shaheen Baugh. Do those people have enough to eat ? You want to be a true change maker then asct so...or else only act in movies. 🙌", "rathore_mohit_bhadla1998": "Ghar me kyu bethi he ,,,,,,Dan kar na tuje chinta thi na desh ki kya huwa ab", "thevarunvats": "Koe maar ke bhagao esko kon h ye pagal ...", "_boxer_beast__": "Donate kar", "_sakhidesai": "Hame toh laga aap lockdown ka palan nahi karegi kyu ki modi ji ne jo bola hai. Par corona se toh tera baap bhi darega", "ranvirminhasminhas": "💪", "akash_linsky": "Marja randi ki bachhi", "iamdivy_singh": "Bharat me ye mahila gumshuda ho chuki hai is lapta mahila ka pata lagaye..", "tejasforyou123": "Bhenki lodi randi raand maaadar jaaat communist ...saaali bc baap se chudwaa rhi h kya ...muh pe loda liya h kya", "jaintees": "Nobody cares😑", "corn_shonnery": "When you dont care about the corona virus because you are already infected by the kanaiya virus at suar baug 🤣#tukdetukdegang", "aditya.bansal2803": "Die bitch.", "pim2711": "u look uglier", "manasvigurjar29": "Please watch that video on Instagram where your favourites are throwing stones on our doctors who are actually trying to save them from dangerous virus . Those doctors have no links with our PM . Please stop bashing our government . Those doctors are not sleeping properly for us . This is heart breaking.", "m_kothwal": "🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢🤢 @dhruvrathee jaise laga iss tatti ko dekh liya ........", "y_chandrapalsinghyadav": "Tum ghar thuko aur kya", "athira_rajeevan_": "Randiiii", "amittchabra": "Mc ko corona virus hojaye..", "ashhrocks": "तुमको सूअर कहते थे तुमने तो seriously ले लिया", "bowdownhoes_1": "@reallyswara where is your nationalist heart not donating any amount just want to bounce in politics #antinatalist", "prashant.jeengar.50": "kha ho ap ab nhi kr rhe nrc nrc😂😂 kitne pese diye pm fund me btao to zra", "mr_aryanpathak": "Gandu aurat", "_am_a_sumit": "Jitna ganda dimag 💩.. Utna hi ganda shakal buddhi", "thecunningkaffir": "Madam socialism, How much have you donated for the fight against COVID-19? How many poor people did you feed after 4 days of lockdown? Answer honestly or else the GODI media might try to defame you.", "the_varunmehta": "Donation wgera b kr dena tha kuch.. Useless citizen of india", "bhushan1489": "Abb kyu ghuskar baithi hai ghar me, modi ji ki baat mankar, tum to us digvijay ki follower ho na, to niklo bahar, jihadi swara...", "ecosanku_sankalp": "Motivational story (Real one). A truck driver of mine friend is driving since 1963. Since he's old (74)and at a high risk of getting infected, I thought of giving him a paid holiday. When I informed him of the same, his words were \"Bausaab I drove for my nation since 1963. I spent my whole life for my nation. I saw three wars, I saw emergency , I saw various crisis and I delivered everything to everyone, in every crisis. Now I am on the verge of retirement. Who knows, I might die soon. But god offered me an opportunity to serve the nation for one last time. How dare you to snatch this opportunity? How dare you to stop me from serving my nation when my nation needs me the most? I don't want a paid holiday, please let me drive through the crisis and I will drive for free for next three months. I saw the news that prices of essential items are increasing day by day because of lockdown. Let me get them back to normal. Nobody should starve just because I left my steering. Please go home and let me fight, it's nothing new for me\" These words left me speechless He isn't wearing a Superman dress but he's a hero He isn't wearing army dress but he's a soldier", "kabir_shah97": "Randi sali.. Teri maa ka bhosda", "ritikraj40": "Jao.. Itlay se ghum aao...", "honey774442": "Monster kahi ki", "painmostly": "Lovely swara. Love u. Lotss of kissses", "chiku_ambar": "Rupay de do madam", "pankajpt2005": "Pls don't follow lock down.. U r antimodi", "fahadshari5": "❤️❤️❤️👍👍👍nice", "i.ambrajesh___": "Kaha gyi ab pehle to bda gyan pelti thi desh mai ye galat ho rha hai wo galat ho rha hai. Abhi to desh problem mai hai ab kaha gyi gyan de na ab", "imkaustubh17_": "😂😂😂😂😂", "patelvishvabandhu06": "Nikal ja hamre hindustan se sali randi", "riya_bansali26": "sun b kiss karke ultiya kar rha hoga tujhe", "masseysanjaykumar": "Good morning", "salahuddin9261": "🔥🔥😢", "wasi.ahmad.31508": "Gd morning friend. It's good and better to safe your self....", "kinggoswmi": "Maksudu lag raho ho rendi", "proud_failure": "Abe o chutiya orat ab logo ki madad k liye nhi ayegj tu age sali shaheen bagh m to chali vha s paise mile honge tujhe or jab desh m itni badi apda ayi to photo dalkr bolti h sunkissed are sharam ho to chulli bhar pani m doob bar #shameonyou #deshdrohiswara😡😡😡", "kanavdevsingh": "Ye aunty paidal chal ke highway se ghar nhi ja rhi... Khana, paani ke paise nhi honge...", "rahul0405gupta": "Sacchi virodhi bno ghar se bahar niklo na @reallyswara dikha apna attitude", "__indominus_": "sun n sunkissed karane bahar mt jana...bahar feminism ka dhanda nhi h...ladkiyo k v laal kar rhe h police bale 😂", "mistryarun": "Inko paise milne band ho jayege sabse phele bhag jayege", "awhitedandelion": "So pretty❤️", "independentgirl001": "Haaye main darr gaya bc. 😈", "mojo3_5": "Abhi toh tumhe ghar jana tha? Jaise tum roz ghar jati ho? Being a celebrity how often do you? And why always cribbing and crying and ranting? Never ever postive!", "samaira_09_8": "Chamar", "witttyyy_thoughts": "Niklegi nhi ghr se", "kdrszgn55": "Allah herkesi korusun", "gayatri__shah": "I came to watch your entire movies list ❤️in this bad times 🔥you’re an amazing and beautiful actress and I became your fan from tanu weds manu ....❤️❤️ you’re such a great woman .... lots and lots of loves and prayers for you and your family ... may god protect you from covid19 ... @reallyswara .... Thanks", "fellow_passengers": "Summer wine 💜😻", "rahman_zoya26": "Sprbb🔥", "shankartours": "I admire your courage and salute your resilience against all those moronic and virulent admonitions you have to face daily. Even on such a lovely innocent post. Highest regards", "manojverma2010": "Sikh mare gye hain unke liye bhi kuch bol de.", "duttguru00": "😍", "sidh.shakti.rajput": "Support curfew👍. घर से बाहर निकलने से पहले ये जरूर सोच लेना... कोई आपको बहुत प्यार करता है! 🙏🏻👍🏻❤", "rajeshsinghbanti": "सावधान करो ना हो सकता है", "che_reboot": "Bhakts didn't get the satire. As expected. Support from a communist, Swara. Carry on.", "deepak.joshi87": "Aa jao sadak p , AMU, Jamia or JNU k leke corona modi ji leke aaye hai videsh jake kyu ki deshprem ki bhasa tum hi log ante ho , Ghatia aurat, Nautanki ki dukan, Shaitano ki shanshan, Chutiyon ki Devta😁😁", "mukeshpujari007": "When you back to Mumbai?", "jitendrahere": "Tere milne waale police ko akela dekh kar...un par hamla kar rahe hai...Maa chod denge police waale agar unki sankee toh", "hdembla": "💩", "altaf_1529": "Wonderful", "sanketawachat": "🔥🔥", "shaikhshahzad91": "Shining as usual Swara.. Stay safe", "sid_jaiss": "Jab iske muh m koi tatti krde or wo tatti pappu ne kiya ho had a face", "kanwartiku": "@abhishekannmol Lund kissed bc Kya fuddu bndi hai ye🤣", "muhd.ovais": "i vu", "markbennington": "Same!!🙏🏼", "rashmisinghmodel": "अबे तू कॉरोना के टाइम में देशवासियों के लिए क्या हेल्प कर रही है ये बता??? पहले तो बहुत बातें आती थी। अब कहां भाग गई अपने आशिक कन्हैया कुमार के साथ?? अरे आवारा औरत, ज़िन्दगी में किसी की मदद भी कर, हमेशा देश में झगड़ा ही करवाती रहेगी क्या??? @reallyswara", "rahulprabhakar44": "Gandi aunty 😂", "inocnt_devil": "Gandagi", "napothif": "Lovely ❤️", "sagar__singh_rajput": "@reallyswara modi ji ne free ration dene ka announcement kiya hai. Tu bhooki nahi maregi😂😂😂", "arjun_purwar_": "Islam ki gulaam 😡😡😏😏", "hussainwarsi93": "Lockdown is serious when u realize @reallyswara is not in a new controversy 🤣🤣🤣", "pokhraj.roy": "@reallyswara Looking Fabulous! We must have an In-House Fashion Show someday.", "fahad_platinum": "Gorgeous....", "sparminder491": "Lockdown Mein Mid Finger ka Kaam Shuru", "_._.neeraj": "Chutiya aurat", "pandey.pooja680": "@reallyswara kya kar rahi h ghar mai kyu nahi abhi activist ban rahi ho . Dusro ki madat tab karo jab sach m jarurat ho ab ghar m baith k sun ko dkh Rahi ho 🤷 apni car s hu kuch labour s unke ghar pahucha deti.. you are flop actress", "ishika.barui": "❤️❤️❤️", "satish_raut321": "💓💓💓", "rohit.rohiiit": "wow your looking bhutiya...hatt corona virus hai tu..", "mokimkhanfake12.2": "love u ma'am 😍😍", "saif_thealpha": "💚🦅THE QUEEN SWARA @reallyswara ⚜👸⚜", "motordestination4": "tu aaab bhikhari ban gaye hai bark karne ka moka nahi mila jo", "mohit.kumar2192": "@reallyswara bandariya 🐵🐵🐵", "manshu2110": "Lgta h police ka sanitize lath pda h 😂", "asnomadic": "Do take Ki actor virogh Kare gi tu caa ka chal nikal chutiya aurat", "bharat_rajgur": "Kya re randi kesi hai", "nooralamazad7": "❤️", "faraz_khan_011": "ye kon h", "nadeem417": "Beautiful ❤️❤️", "mailanuj25890": "Chi", "ori0ns": "वो सब छोड़ो, How much are you donating for fighting the epidemic? Let's hear that.", "h.r.sama": "Most Beautiful look", "shanzukhan": "Ap ki bate Bollywood sab se alag h baki to sab dikhawa karti h", "samir85.dave": "Shaheen bagh wale kaha bhag gaye. ab ghar pe bethi ho to kagaz dhundh lo", "saifuddinidrisis": "❤️", "musical_snob33": "I will cut down 40k bhakts for you", "shilpsgautam": "I love love love the new hair ! So fresh and full of sass - ❤️❤️❤️", "mdzeeshan6700": "❤️❤️", "ahmednaseermohammed": "👍", "sanaullahgnit": "👍👍❤️", "shohel2058": "😜😜😜😜😜", "shaikh.atharazmi": "Pretty❤️", "13soby": "Lockdown hai toh Kaagaz hi dundhlo 😂😂", "ahmedshiddique": "❤️❤️❤️💓💓💓", "saif__121_k": "Love from Pakistan ma'am. We are waiting for you. Kbb aa rhe ho aap yha ?", "anas.asad.1865": "🔥🔥🔥🔥🔥🔥Excilent", "abdul_4213": "❤️", "rvk.chauhan612": "Delhi police ne lat mar ke sahinbhag walo ko bhagadiya 🤣🤣🤣 ab is Ka BHI dukan band ho Gaya 🤣🤣🤣🤣", "rohaaan223": "😍", "mulyankanmishra": "Result of using jai bhem and jai meem sp**m shampoo.😁", "akshatdeshta": "Girl ur beautiful", "swamiraj2021": "Shahin bag gayi nahi aaj Tu.. 12/15 pille pida karne wali sherniyon se milne... Korona se fat rahi hai kya.. Alla bada dayalu hai... Ghabra mat.", "sartaj3609": "Love the dragonflies 👍🏼", "baitul_here": "@reallyswara Swara Ji 🙏🏼 your smile is really so beautiful Masha Allah 👌💙 KEEP SMILING KEEP SHINING ❤️", "dimplessss28": "Pagal khane ki pagal lag rhi hai", "gmkbiswas": "Lovely", "faheem.273": "Superb", "_jain_subham": "U know what quality of weed you took when you post on sunkissed at around 3 a.m. 🤣🤣🤣 modi ko kch nahi bola to yaha chutiyapa mtlb kch na kch krna hi h na tereko🤣", "iamuzairrr": "❤️❤️", "7083.vicky": "Good looking", "imsameerjk": "So sweeet", "hjk.oo77": "#india lockdown but how will u lock #sunn 🤘⛅", "fashionopolis.in": "Love the short hair. Looks great. Stay safe ❤", "sa.hilkhan7701": "It is very sad to hear that our film stars have not yet announced financial help for poor people. And we say that we are true Indians, at least these film stars forward to help poor people of country...🍪🥗🌮🥚🥙🍱🍛 plzzzzz go for help them there are lot of people are hungry they will die without food....plzz help them", "786__aj__786": "Sunshine...", "aslijazib": "Don't mind Swara but old hairs were good...you're not looking nice in this look...Just a suggestion...Love💙💕", "csalihaa": "Omg u have Priyanka Chopra Lips", "needatex": "Where you now", "ankit_kungaria": "Aaj Kal mullon ki nayi ammi.. 😂😂 swara muslim aunty", "itsbadboyshah": "Modi virodh mai bahar nhi nikloge kya...?", "freaky_adi000": "Didi dubara shaeen bagh mai baithe ki tayari krlo kyuki uniform civil Code Anne wala h💗😍❣️", "ibrahimaaftab": "🔥🔥🔥", "sumen_bhattacharya": "Fake", "tumho3": "ओसामा 🔥🔥", "asroy071": "Are yaar tu to berozgaar ho gayi...😂", "sameer_mehra007": "Swara begum... Kaisa chal Raha dhandha... Agar khane ke problem hai toh dilli Sarkar muft Khana BAAT rahe Hain..chale jao... Waise bhi muft ke phootage ke liye toh..tu kahin bhi chali jati hai...", "malikzaid__": "👌🔥😎", "mummas_boy_writes_for_her": "You have done enough to stay inside btw @reallyswara... Been your fan but now totally hate you", "hamid__khan123": "Nice ma'am", "muda_sirr": "That smile", "the_khan_u_want": "❤️Beautiful @reallyswara", "karthikrobben": "Happy Morning Swara :)", "itssimmijain": "Kch v kr lo suwara banskar hi kehlaogi😂😂", "parveen6132": "Cute... n sooo... mesmerising...🤙", "_prem_thakur__": "Desh Ho gya hai Aajad Kya", "satyamvats819": "🖕", "djdeepakjain": "Dirty Af @reallyswara", "faraz1613": "❤️", "anandpbbu": "Now, you are really Swara", "navinsrivastava40": "Tum jao shaeen baag mai baitho jakar", "paielgandhihoon": "Beautiful! That dragon fly wear is so lovely! Where can I get 🌻🌻🌻✨💕", "ikzoom": "❤️❤️", "ayanahmad99_": "Until tomorrow 😂", "sunnyyy__111": "ugliest girl I have ever seen.... Both outside and inside", "theraunakpradhan": "❤️", "nagesh2494": "Aantiy ko Corona pasand hai . 😂", "bandanap2020": "Wow u look awesome", "az_i_m": "Be safe Warrior....", "atuluppe": "Useless", "adil___k___07": "Sunshine 👌👌👌👌👌", "abbasmirza3579": "Osm", "pagal_jokerr": "Lovely❤️💞", "g.s.garcha": "So beautiful dear ❤️", "mukesh_yadav2": "❤️", "sahilkhan18155": "@reallyswara didi.....Suna hai modi bhakt corona se bachne ke liye raat din gobar or mutr ka snaan krte hai🤣🤣🤣", "shakil4285": "👌👌👌👌👌👌👌👌👌👌👌👌", "vishu9436": "Ohh buddy..new luk....mast hai", "dhiren_pa1992": "Kyu re aab movie me tere ko prostitute wale role nai mil rahe kya", "_rahul._.soni_": "Shaheen baugh nai jana kya???", "vaseem003": "@reallyswara is it your new hairdo", "pi_day_pisces": "@reallyswara thousands are dying and you're enjoying sun kissing. Thousands are hungry and you're showing off costly chocolates. Hypocrite. We all know the intention behind your shaheenbagh involvement. Money. That's it.", "ahmdnzaft02020": "Hil❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ ok", "jyotirmoy.yadav": "Stay safe and healthy😍", "gaba2445": "👎👎👎👎👎👎👎👎👎👎potty", "rangesh_s": "Ugly", "priojitkeisam": "Ajkal vibrator used karte he ki nhi 🤔🤔", "pashadanish": "👏", "panks008": "Bechari ko lock down Mei nahane ko Pani nhi mila....😋😋😋", "farhaan0087": "You are looking so bad😂😂😂😂😂", "beingshadabkhan2": "Awesome smile diiii👍", "rajesh.dewangan.14203": "Iike you forever😍😍😍", "sonu5167": "Asa kam hi kyu kiya ,jis se aab tume apna face chupana pad raha hai", "pradeep.negi.2011": "👏👏", "madhavphotovision": "bdi bedili se jiye hum,ye dil ko sambhalne ki tarqeeb thi kya,aankhein bndh ki aur khud ko hi dekhte rahe,ye dunia mere liye ajeeb thi kya@मज्म", "rizu_aryan13": "Be inside this country needs ur bold voice", "nadim_parwaz_tk": "Wooo", "mr.unexplainable": "hairs ❤️👌💇‍♀️💁", "azeemkhan6826": "Lovely mam🔥🔥🔥🔥🔥❤️❤️❤️❤️❤️", "saif.khan12": "I miss you dear friend", "jagg_dev_": "Very nice swara", "iopians": "So beautiful", "mr_nishantsolanki": "Swara you very nice", "yuvrajsinh_b": "में क़टीला बाँस प्रिये , तुम साधारण डंडी हो, में ठहरा कट्टर देशभक्त तुम शाहीनबाग की *डी हो \"", "nasser_ayeda": "I do respect you from the depth of my heart", "mohdsajjadkhan___khansaab": "😘😘😘", "mr.syedjibran": "Get going ❤️✌🏻🔥", "brk2206": "💖", "trickytanmoy033": "Age se bhi piche se bhi........,chapachap chapachap 😂😂😂", "zarinansari20": "❤️", "tomspaderofficial": "@crypto.anna has helped me earn continuously from investing in bitcoin.They are the best in Bitcoin Trading investment.", "drsameerahmed_": "Nice", "iam_adil01": "❤️ Home sweet home 🏡 ❤️", "r_bhardwaj1992": "Your hair cut is awesome as like you.", "arjun_aj_singh": "❤️", "mr_hydi_00": "@reallyswara ❤️", "adminonthego963": "My goodness her beauty is sooo innocent right ...", "honeymazumder": "🔥🔥🔥", "khyaalnumaa": "all of a sudden, you look like her sister @sayanigupta . 🙊🙈😅❤️", "sharma.chitwan83": "Nice @reallyswara", "sayyed_sohel_ahamad": "Dabang lady 😎 dii🙌", "flyingofficeryusuf": "Apna ghar to apna ghar hota hai", "asfaq_khan786": "Love you dear, i respect u", "ab_eer_khan": "Glimpse of @m_koirala 👌", "ricky_7963": "Shaheen bagh baand iska dukaan bhi baand. It's clear from the dwindling posts from these LIBERANDOS.", "harshita_baby222": "Hey boys want fun then check my post🔥❤️❤️", "adnan_rather": "Raat mai din 😂 sahi hai Swara 😅😄", "rowdyreddy_91": "Respect ✊🏼 🌈♥️ @reallyswara", "_edy_007": "I think u are really getting bored 😂😂🔥", "shrachik_": "❤️❤️❤️❤️ pretty", "lefttist": "Mam could you give a shoutout to our page it would be really kind of yours we know you are a real gem hope you could co that♥️", "mashkoor247": "U r awsome"}