{"shivay_shiv1431": "Are vo mutthi vala scene toh KR do ek baar lockdown me bore ho RHA hu 🤣🤣😂🤣😂🤣😂🤣😂💪😂💪😂💪😂💪", "wanderlust___jo": "The social activist @reallyswara .. big fan of u when u raised ur voice in JNU.. and other cases... But sadly not able to see any video of urs raising against voice for Palghar sadu moblynching... Have stopped being activist??dukan bandh hogayi ya dukan nahi bandh karwani he bolke ???? #hypocrite", "dhanraj_dodia_702": "Jahadi sali Randi PFI se paise le k protest karti thi nikal", "_soumya.2ku_": "Tu ID dhund", "fuc_kuuuu": "Aaj shave kar ka ie ha varna teri dadi meri akho ko chupti ha", "raj.deepsardesai55": "Gyan chodna bnd kar", "terababu92": "Atankvadi BC", "libarandu": "Kambali mulli", "texas_tiger999": "U look like tanmay bhats 10 kgs dickhead #librandusswara", "danishali198960": "Please aap kuch bhi mat karo movie dekho aur enjoy karo❤️❤️❤️❤️", "infinite_krishna": "Suwara bhaskar😂", "sunny.bindra1": "Why don't you just Disappear.....nobody wants to see how ugly u r... Inside out", "shezzz.x": "So many fake desh bhakts here 👏", "its_sanyasi_": "Locdown...tumhre maa chodney me zaa raha hai", "pradip78560": "Tu swar se nikli isliye tu swara conform ha thik hey na", "santoshsunita3": "Bina makeup me teri muha dekhne ki layak hi nahi ,aaa thuu", "dk623_9466": "Apni chut thik karo swara 🖕", "pawansrivastava028": "Iske muh mein kuch daal dena chahiye. Kuch na mile to gangajal.", "swapnil95_": "Apna dimag thik kar", "im.pubg.play": "Sakal s masoom hai pr lagti hai hai tu rehti india m hao pr galti Pakistan ki hai hai tu hindu pr pasand mullu hai tu saram to kr ya to tu mulli ban ja ya fir hindu ban ja pr tu to bich ki bn kr rh rahi hai thuu hai tero jese mullu s Pakistan or bangladesh s hindu kha gye tune pucha kabhi mullu s or ek din jam yaha mullu ka raaj hoga to garib hinduo ko kha s bacahye gi ya fir tujhe is desh m haram ki mil rahi hai same on u or ha mujhe nahi pata ki tu hindu hai ya mulli ye tujhe bata rakha hai teri maa n jabhi to tu mullu k sath hai namuniiiii......or ha teri jesi sakal pr 🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "utdu20": "@reallyswara SHE-MALE 🤣", "bickie31": "Bangladesh k crodo ghusbethiyon ko apne ghar pe bitha desh k sar pe nahi bloddy fucking bitch", "_harshal_cr7": "Just make a critical decision to make urself worthy...coz currently u and shit are basically the same", "mr_mintoo_c97": "Koyi muh me choko do yaar bahot gandi dikh rhi hai tatti hai kahi bhi hagh deti hai", "sonusharmmaa": "Tatti jesi sakal hain ree teri😡", "amanmishra9340": "Gaddar desh drohi", "un_known_peace": "Make up karake aazadi lele... Deshdrohi..! Tere pakistan mei lockdown nhi hai... jaa vahapar... Aazadi mili hui hai... 😂😂", "fierynationalist": "Whi aapna favourate kaam krona Ungli aur Charamsukh ka aanad lo uske baad time mile to Documents dhund lena 😁", "shivampanwar.3433j": "@veeml_thapa iske paas nahi hai document ye hai asli illegal immigrant", "illuminati_prakash": "Lockdown to aajkl chl ra tumhare liye to Bollywood ne phle se hi lockdown kr diya tha ab to nrc caa yhi kaam mai aage ho🤣🤣🤣", "__________sachin_________": "Ar ho sakte to apne tatti dimag ko bhi saaf kr lena no. Btana paytm kr dunga, harpic le lena", "panu_jambhale": "Accha hua bataya ki makeup kiya hai warna pata nahi chalta 😂😂😂😂", "jayashreebapari1707": "Ab nikal ghar se,,,,ghar mein chupa keu behtha hai,,ab to gareebo ko sakt zaroorat hai,,publicity ho gaya kaam khatam ,,ab chilla nrc,caa karke ,,,,path gayi kay,,duniya ki sabse ghatiya lady", "sachin.tripathi.9693_": "Are bahar ghum aao....Tumko toh virodh karna rehta hai na....Jao zara corona patients ke gale lago jaake", "bitti_kumar12": "Tatti uta lo", "kshitijparcha": "Chii yar mai kyu dekh leta hu isko... Ulti aati hai isko dekh k🤮🤮🤮", "jetmalot0011": "So all animal together ... don’t come out u....", "vishal_dobhal": "Innocent face😊", "muhdilyaas25": "Mujhe toh aap bin makeup ke bhi beintaha khubsurat lagti ho", "trendyy_zoop": "Apne chahne walo ke kagaz dhudwane me madad krdo na didi", "schaudhari248": "Original beauty 👌👌❤️", "sweet._kudi9": "Ardorable without make uo too😍😍😍😘♥♥", "pravinmathapati": "Is ko uthale bhagyavan yese thobade se aacha he me meri kutte ka mu dekh lu 😂😂", "tanya_tripti_": "How much have u donated u fu*king sh*t?", "gaurichoukse": "ku madam koi mudda nahi bacha kya", "jaatsurinder88": "Kuttiya saali", "gp___15": "Apna bosada thik kar 🤣", "29.abc.8.99": "Chalo bjp, caa, nrc k bajase you have got some attentions, some popularity.", "anil__thakre": "Oh आंटी रेशनल जी.. मतलब एंटी नेशनल गैंग की सरगना श्री श्री स्वरा भास्कर जी ..आपको कोटि कोटि थू है.. ... 🤣🤣 😝😝", "iman_almullaa": "Make fun of people . It will come back to u one day 🙂👎🏻", "ikartikxo": "Didi diye lagane ke baad an third task gallery se document dikhane ka hai kar paogi?😂", "amangautamr": "I'm sure the first wish is mine 9 April @reallyswara Love You Ma'am & God bless🇮🇳🙏😍😘❤️", "kunaaltyaagii": "😂😂😂😂 caa nrc ka kya hua tera 😃😃😃😃😃", "studlaunda11111": "Ek dum lund jaisa shakal dikhraha hai bosdiki", "himanshu_bhangale7802": "Toilet saaf kr aur agar ho gyi toh mere Ghar aake bhi saaf karke jaa", "ronit.singh.547389": "Kuchh v kr tu phrr v tu chutiyaa hi lgegi😀", "sharma_mannat06": "Hate u ugly", "shilpajha3011": "Bhen ghr pe hai apne chamcho ko bolde , khaali hi baithehai ,papers dhundle🙌🙌", "priyaa_shar": "Ye jo karri ho ..vhi tumara kaam h ..make up karke hi toh beithi ho ...", "abhi_mishra7777": "🤔", "sachinjoshi77": "जमाती मरीजो के इलाज के लिये स्वरा भास्कर की ड्यूटी लगा दो हॉस्पिटल मैं, जमाती भी खुश ओर स्वरा भास्कर भी।", "ankitpanwar779": "Why you didn’t talk Nizamuddin issue r u very busy in your house 😊", "pratibha_rajput7": "Tabligiyo k sath ja k so jaaa ye kaam tujh pr jamta hai", "j_sin25": "Kuch bhi kr le Katrina k jaise star nhi ban sakti.", "sebfalwala_": "@saxenasatvik ye to @_the_lucifier ki jaan hai.. uski fav 😂😂", "illusionist135": "Muth maar", "debnatharyadeep": "R**** saali", "kalik3278": "Lolaaa legi ...is chutt se muh mei", "imrityunjayshrivastava": "Gaali khake sharm nhi aati", "srq_anwar": "You are ❤️. When u coming back to delhi ?", "ashishdranka": "Tera muh saaf rakh..!! Another gaddar of india..!tu aisa kar corona patient ban ja or corntine hoja!!", "sooraj_the_burnig_sun": "थू है तेरे मुह पे l", "sree_05": "aj Congresse netao ka lele 😂😂😂 unko bhi maza ajayega", "salat.amit.1": "Very beautiful", "umaginati0n": "Sab kitne bahadur hai na internet pe??", "mr.perfect14370": "Buddi ho gye re", "krishna15sharma": "Madarchod ek mukka padega muh pe", "v3_onboard": "Didi kuch donation dedo tumhare bhai log zamat se aye hen bohat bimar hey 🤣 didi... Donation please", "sanataniiii_": "Aaj raat apni gaand jalana matt bhulna aurr insta ke story pee daalne de naah sabh aayengee", "adanurappa": "Ninnamman mindri, halka soole! Make up Karke kapde nikalke loundoke saam ne jaake khadi hoja! Randi", "abhi__pandey26": "Aazadi Chahiye kya...???? Ghar se..??...jaeye Bahar sign Kar dege police vale... ink red rahega par vo pen se nai Aayega .....aur aadha Ek gante me Nazar aayega... 😶😶😂#danda", "__tulipsharma": "Devote some of your time in reading about CAA/NRC, so that you don't exhibit your hollow mind next time. Shed a bit of your hypocrisy this lockdown.", "awokehindustani": "Are you sleeping with kanhaiya kumar?", "m.huber_bijoux": "Pretty eyes 👌", "mdsalmankhan7619": "Ugly face", "feellivesukku": "Muchh aur daadhi ug rahi hai... threading karo...😂", "jayprakashojha": "Che che ye kisko dek lia 😣", "tejashri_v": "Khudke Dimag ki safai karle 😁👍", "harsh_8864": "Lockdown sahi chal rha tha lekin ab tumko dekh liya😂", "madhavtyagi95": "ओ पढ़ी लिखी अनपढ़ अब घर पे बेठी ही है तो CAA के बारे में सही से पढले #अनपढ़सुरी अपने माँ बाप पे भी कलंक है तु तो 🐷", "shrimantroll": "Madam aap makeup karke bhi bai jaisi lagti hai. Didn't have to try too hard.", "anoushkagokhale": "OMG you're following the lockdown announced by the PM you hate so much????🤣Abhi troll nahi karogi??? Kaagaz dhundle gharpe iss lockdown mein.", "varunn_dua": "U r a fellow indian..u help.people around .. I salute u.. I m a big fan... But pls tell me what have u done for ur people around..ya sirf jnu wale tere yaar hain? ... Abey kuch to sharam kar...ghatiya aurat... Khud hi bio mein likha hai dramebaaz..kam se kam gareeb logo ko bhadkane aur desh ki halat to mat kharab kar.. sunn mujhse paise leja aur kisi aur desh mein naach .. ye ghatiya harkatein mat kar.. #banswara", "arman.choudhry": "😘😘😘😘😘😘😘", "boney_zz": "@reallyswara chutia aurat", "vi_shal___sharma": "कागज ढूंढ लियो भो श्री के@reallyswara", "swarajya_garje": "शूर्पणखा शक्ल और अक्ल से बिल्कुल स्वरा भास्कर है.. #रामायण", "ajitsingh2053": "Ek Kam kr kam NH h tere Pas kk...aaja Mera gand dho de", "hinduswaraj2020": "Free h to kagaj dhundh le .dikhane to padenge hi.", "chowkidar_sudheerisvd": "How irritating u look", "caughtinamiracle": "Whenever I try to shit and it doesn’t come out I visit your profile and see your 💩face and it helps the movement thanks Swara", "ashu0829": "to bina makeup k krle. sala ghr me bhi makeup krte ho kya zindagi hai yr tumhari such a pitiful life. Itni buri shakal hai k khud se bhi chupate firte ho makeup krke.", "santosh_yadav267": "Iske face ke expression dekh ke toh lg rha h piche se iske koi mar rha h 😂😂", "singhkunalpratap": "Kisi Gadhe k tatte chus k aaye hai waisa muh bana rahi hai💩💩💩💩", "raahichauhan": "Fingering vala scene krke dikha ek baar ra+nd", "maheshpatidar1061": "Dimag ka kachra bara kar oehle baki kam to hote rhe ge", "anujphg": "Tu kyou lockdown mai hai yeh bhi toe modi ji ne he Kiya hai....ab jaan ka dar lag raha hai kuti ho", "its_sandesh.k": "NRC and CAA jai... 🇮🇳 ❤️ 🇮🇳 ❤️ 🇮🇳", "kashishrathi0": "Ugly inside Out", "sfeddghf": "Sali deshdrohi koi kaam bahi dega ab tijhe ab tujhe yeh rundibaazi kar ke hi zindagi bitani hai", "dhaarnadorable": "Hey you dumbo how much you donated???", "singh.kannu": "Pakistani..", "itzurboy_rawmesh": "kaam kr le kuch faaltu bolna hi aata hai tujhe bs.", "ankit0321": "Phle apna dimaag saaf kro", "_x_vaidik.x__x": "Pagal saalu lodi @reallyswara", "flourish_prasoon": "Omg so lovely 😘", "arun_yadav___": "Tum only apna muh bnd krlo", "rakratod12": "Saba hone ke mera mua me lena", "avinashtwr4": "Ye kya swara lockdown mainsarkar ki baate manke ghar main baithi hai...arre bahar niklo aag lagao...", "yogesh_khilare": "How about now The RSS is helping people no matter religion no matter caste giving food", "nkit_kitn": "Kagazz dhundo", "sarccasticc_sourabh": "Ab ye berozgar ho gayi hei...kharcha uthane wala bhi chala gya😂😂", "pratikrajput127": "Gand marwa le bhenchod", "xxiii.v.mmii": "cheee cheee ye kya dekhliaa", "war_machine_aj": "27 या बादशाह की बीड़ी का मंडल पीले ।", "shivimishra_93": "Beta kaha ho??? Ab kyu follow kar rahi lockdown? Jao jao bahar niklo...CAA ka protest karo....tum kaha ho iss desh ki...tum toh na musalman ho na hindustani... Alien ho kya??", "its_bhargav_dubey": "Aja mere ghar mera pen*s chusna or mere kutte ka v", "goutam8290": "Randi sali😡", "vash518": "@reallyswara documents dhund lo", "june_moon98": "Randi n.o 1", "nationalist.sahil": "pakistan se paise lekrrr yaha kyuu rayta faila rahi ho manthraa didi", "the_rajput_guy___": "Apni gand marwa makeup kr ke", "the_antinormie_guy": "Raaaaaand", "shourya2746": "Apna dimaag thik karde bas wohi kafi hai", "dheeraj9casting": "Apna Ganda dil dimag dho ke pagli...gandi niyat ki soch desh ko Gaddar....kaam nai milta tujhko to desh ke khilaf bolegi tu", "mrinalinitiwari06": "I thought lock down par bhi ye dharna dene waali hai", "im_sahil3": "Gaand mrwaaaa 🙌🙌🙌🙌🙌", "riteshkamble94": "@reallyswara Dear mam I really like you as a person. I just want to say that why do you oppose just one person. Hindu did wrong #gomutra and some Muslims also right now what's happening around.. So why do u support only one party. Support good things and positivity.", "keep_it_yum": "Thoda CAA pe home work karo. Read the acts for better answers in next debate", "____yashashreedhabe": "Bakwassss ..all u doo is only bakwas . I think u dont get work anymore in bollywood", "fakkat_sanghi": "Kanhaiya ki chaato na Please.!! @reallyswara", "shyamali_bajpai": "U r one disgusting person. Shame on you. @reallyswara", "sn_stoneglow": "स्वरांड भास्कर.... तू जिहाडीओ के नीचे सोजा", "ranjeetrajpurohit": "Covid 19 mei desh ko donation kon dega?? Tera baap??? Kidhar mar gayi madarchod 💩💩", "me__geet": "@reallyswara u look so dirty even after makeup. So now when u have time , be ready with all documents . I know ur not that educated so never worry on those certificates. But be ready with birth certificate. Make up ke baad wo kaam jarur kar lena @reallyswara 🤣🤣🤣😂🤣🙄", "shivay_89": "Haramzadi", "neha_44556": "Pakistan ke tukdo pe palne wali😂", "sandeshkadamjr": "Makeup lagage documents dhund", "varmaaravii": "JNU K LIYE TOH TURANT ROAD PAR UTAR AATI THI...AAJ JAB DOCTORS KI KO YEH LOG THOOK KAR INFECTED KAR RAHE HAIN....ITNA HI NAHI JO DOCTORS ILAAJ KARNE GAYE UNKE UPAR MULLON NE PATTHAR MAARE KUCH K UPAR TO JAAN SE MAARNE KA ATTACK KIYA TAB TUM CHUP HO...AB KAHAN HO DESH KI GADDAR SWARA...AAPSE NEECH KOI NHI ...JAO PAKISTAN JAAO...", "singhkavya0001": "Dimag ka makeup kr lo thora", "nag_shk": "@reallyswara kuch donate kiye apne nahi chyiea bhi nahi,ab ye desh m ho rhe hai kuch nahi , mujhe sharm aati hai tum apne desh k log ho.", "chetan.more0007": "Jihadi randi🖕🏼🖕🏼🖕🏼", "mr_.p.a.t.e.l_": "sali prostitute se jo paisa ata hai tera use hi ku6 contributions kar de covid19 ke liye....or ye sab khatam hotey hi tere ko antinational ka bhi paisa milega na🤣🤣🤣🤣use ke jeher kha le....sasti bollywood randi....", "akhileshydv24": "@reallyswara are gud gobar phle apna mind wash kr fir kapde dhona ...tohare dimakawa me tohre kapadwa se jyada gobar bhara hw", "falgunshah1": "Moron tell something about muslims doing in critical situation. You are blind and money minded person who just make noise when muslim suffers. But not hindu #getoutofindia", "bhagat2745": "Chut apni saaf kr Lai katmullo k saath reh reh kr woh b zehadi ho gai hogi ....tezab dal kr saaf krna", "a.canon.eye": "Ghar pe rehne ki salah nhi doge didi Oh haa tabliti zamaat nhi gye aap 😂😂. Jaate na baashan dene 😂😂😂. Didi", "yatin_2000": "😂😂😂😂😂😂😂😂kutiya", "mr_pandey_.ji": "Apna muh theek kr", "isaabellaaa235": "Par katti😂😂😂😂😂😂", "therealrahulsoni": "ku aj koi placard nhi? jakar garibo ki madaad kro, natak nahi", "sinhaladarsh": "Are ab bol na mulle maa chod gye jagah jagah corona de gye", "saurabh_mehta1903": "Pahele aapna dimag thik karo😂", "hritik123a": "kutiya saali", "imankit.11": "@reallyswara khan gyi av.. Government ko critisize kro.. Av kyu bologi un jamaat walo ke khilaaf.. NRC ke khilaaf to khoob boli tu.. Ghar mai bethe2 dimag chala le kuch.. Or btw kitna Donate kiya tune.. Ohhh tuje to india mai dar lgta hai na, jaa na av Pakistan, America... Fake aurat", "riddhimaan34": "Iss Randi ki to Rubika Liyakat ne leli😂😂", "shubhanjalisingh1410": "Bkwas hi kr lo or kuch tmko suit ni krega", "sweetjaat": "देश की randi", "tanayb1": "No one cares😂😂😂😂 aj hate group nahi chalana madam", "mannu_dixit_": "Makeup karke vibrator use kr tu toh 🤣", "ro_9999hit": "Mandara", "khiladi_5678": "@reallyswara hmari fikar krna chod do jao deshdrohi logo ki fikar kro ap or Apke jaise log thuuu", "xahil26": "Great great great you are great", "rajeshsharma605": "Sabse pehle apna muh dho", "ad1990a": "Maderchod @reallyswara jake help kar na logo ki vese tujhe bahut aag lagi rahti he na CAA k time tune okat dikhai thi bitch .Ja na ab yha kya a gai 2 kodi ki heroine flop ungli baz", "12345urq": "Tu kagaj mat de. Teri guu bhi chalegi", "ashu_sanchihar": "Masterbation kar le tuje vo he aata hai vese chipkali ki chut @reallyswara", "scorpio_pri": "Na shakal acchi na vichaar...movies koi de nahin raha shaheen bagh bhi bandh. Lockdown mein yehi soch lo ki agey kaise desh ke aman pe ungli karni hai🙂", "cambridge_friend": "Gadhi", "raj_shivaay7": "camere pe chadd k video bna di..ulti aa gyi muje to🤮🤮", "prakashtiwari8865": "Manthra devi chup rahe", "jitendra.sanghvi": "Any donation by you?", "s4sanjiv": "Abhi desh ko jarurat hai app jaise logo ki , please bahar aaye or help kare garibo ki , bhukhe logo ki, desh dekhna chahti hai ki ish time kaise logo ki awaj ya help ban rahe ho ,,, so please do something for people", "navychug": "Mullo ka muhh me le rhi h ya apni gaand me behan ki lowdi...aaathhuu lanat h Teri tatti wali shakl aur tatti mulli koum par...thhhuuuu", "gaba2445": "@reallyswara kya kar dia tere bhaiao ne jamat mein. Kuch samjha inko. Waise tu bahut bhaunktee hein ab kya hua tatteeeeeeeeeee", "dharmeshdharat": "Saali ab bol na Delhi par kon baat raha he corona saali NRC par to bhaut bol rahi thi JAI Hind Indian army", "ynwa.anmol": "Kagahj dhund le😂😂😂😂😂😂 makeup karne ke baad bhi itni ugly ? Eww", "mukesh4450": "Sabse pehele apna sada hua mu chupale ya fir building Kae upar sae kud ja is desh sae ek bahot badi gandagi saaf hojayegi @reallyswara", "punjabi.queen._": "😂👌", "sakshigoel29": "Sahi kh a😁", "seemamishratiwari": "Apne maa se pucho kya khila ke tere baap ne user choda tha", "chandel.shuub": "Tum itni sundar ho itna acha acting karti ho sab kuch badhiya chal ra hai phir q neta giri men ghus rhi ho. Waha sirf tumhare liye badnami aur kuch nhi", "tipnis_dhanda": "Oh god I saw shitttt", "pi_day_pisces": "@reallyswara chalo nizamuddin jaake protest kartein hain doctors ke liye, Mullon ke khilaaf😂", "thefallenangle666": "Jitna bhi make up karle Rehna to tujhe burkhe me he hai", "lycan020": "Ye kya tha ?? ,chiiii gandha.....ye gandhe log instagram mein .......kapde dho ke ghatar saaf karr", "hima_sharma_25": "@reallyswara सोनिया गांधी =गायब राहुल गांधी =गायब मनमोहन सिंह= गायब अकबरुद्दीन ओवैसी = गायब कन्हैया कुमार= गायब मुलायम सिंह =गायब अखिलेश यादव= गायब मायावती= गायब ममता बनर्जी = गायब लालू प्रसाद यादव का पूरा परिवार = गायब पी. चिदंबरम = गायब सलमान खुर्शीद = गायब दिग्विजयसिंह = गायब सिद्धू = गायब रविश कुमार = गायब JNU के सारे तुर्रम खां = गायब नंगा आमिर = गायब हकला शाहरुख = गायब दोगला नसीरुद्दीन = गायब जावेद अख्तर = गायब शबाना आज़मी = गायब फरहान अख्तर = गायब अनुराग कश्यप = गायब स्वरा भास्कर = गायब अरुंधति रॉय = गायब तिस्ता सीतलवाड़ = गायब इन्हीं लोगों की तरह औऱ भी अनगिनत देशद्रोही हैं औऱ वो सबके सब दुम दबा के दड़बे में घुसे बैठे हैं सबकी औकात सामने आ गई है कोरोना जैसी मुसीबत आई है तो यह सारे के सारे गायब है, कोई कुछ बोलेगा नहीं, कोई किसी की मदद भी नहीं करेगा, यह सारे नेता सिर्फ जनता का पैसा लूटने के लिए है, इनको केवल अपनी कुर्सी औऱ अपने पैसे से मतलब है, जनता मरती है तो मर जाए, पर चमचों की आंखें फिर भी नहीं खुलेंगीं *अभी देश के लिए कोई कुछ कर रहा है तो वो मोदी जी हैं, शाह जी हैं, योगी जी हैं, पुलिस फोर्स हैं, डॉक्टर हैं, साफ सफाई कर्मचारी है, सेना के वीर जवान हैं और समझदार जनता ख़ुद अपने दम पर है*", "aayushi_6241": "Tu sali randi hai jihadi sali laaandi", "thakurviveksingh22": "मैडम जब संविधान खतरे में होता है या यूं कहें कि आपका पब्लिसिटी पाना होता है तब आप आवाज दो हम एक हां के नारे लगाती हैं आज जब देश खतरे में है इतनी बड़ी विपदा आ पड़ी है लोग खतरे में लोगों का अस्तित्व खतरे में अब आप वीडियो बनाकर अपकावर्ड सुधारने की बात करने अपने घर घर के कपड़े सुधारने की बात करनी है कहां गई आपकी सामाजिकता वही लोग मर रहे आप लोग बस मजे लेना जानते हैं खैर हमें आपको आपकी चिंता थी करिए मोदी का विरोध 21 दिन का लॉक डाउन मैडम देश को आपकी जरूरत है बाहर निकलिए विरोध करें", "mishra.anish99": "Tm jesi deshdrohi ldki ko log follow pta ni Q or kya smjh k krte hn 😂😂", "manishkgupta9": "Look at yourself before speaking to others. First become 10% of them.😂", "music_mania_india": "Randi Sali", "sunny_dhiman": "Lets speak on Nizamuddin swara Bhaskar....have u any words on this issue????ur all muslim uncle's spread corona all around the country....y is ur mouth is shut???", "im_jd16": "Desh me abhi mandi hai swara sabse badi Randi hai 😂", "ghumakkadmarathi": "i hope ki iske parents kisi terrorists attack me mar jaye shayad tab ye sudhare🤔", "manisha.s1403": "Jitna ugly tumhara face hai usse zyada ugly tumhari soch hai.. 😡", "adamant_prakash": "Or vo jo pure desh me tatti karti hui ghumi ho na...usko bhi saaf kr lena...waise itni gandi jagah pr to corona bhi nahi jaega lekin kya fark padta h...nalle baith kr online tatti krne se to accha hi h", "yash_ferdes": "Oo madarchod", "mr___samrat__": "Gandu saali desh ko avi v bhadka rhi h sharam kr", "corn_shonnery": "When you fail at spreading the kanhaiya virus at suar baug because of coronavirus #tukdetukdegang #suarbaug", "aries_jaya998_": "Apne dimag ka gobar saaf KR le", "sujeetkr01": "Dimag ka iilaz", "prashantballu555": "Saali kutti", "hitesh.tirgar": "@reallyswara madam itni hi deshbhakti dikha rhi thi AntiCAA slogan bolke to thoda fund bhi donate kar do desh ke liye COVID-19 se bachne k liye...#Fekuswara", "arjunrana1417": "Vibrator kaha gaya Terra aaj 😜😜😜😜", "manisha_bhatt16": "@reallyswara Hello! We can't see you now? The flag bearer of anti nationals just got lost? No views, no sympathy, no donations for your country? Hmm?", "techworldreviews.inc": "@reallyswara ky re randi kitni mai bikk rhi hai teri choot aaj kal ki free ka sale laga ke baithi hai 😅😅", "jatindersingh_05": "Keep it up Swara proud of you", "amittchabra": "Meri chaddi saaf kard😂", "aditi7621": "@reallyswara thora donation bhi Dedo ki bass anti nationalist hi banogi", "avdhesh.sharma.71653": "Ab apka desh prem q ni nikal rha...chachi...", "prachijoshi014": "Swara Papers dhundke Rakhle😂😂", "gauravo1": "Abhi corona hai toh thodi aap risk loge...", "krishnagupta1292": "Sad you are spreading Venom against Hindus in this lockdown and surprisingly not abusing our PM . Very strange", "salaskarabhishek": "Kay zindagi hai eske utho ,naho, gali khau ,aur so jau aur apne muh se gu nekalo bus 🤣🤣🤣🤣🤣🤣", "yuvraj.singh7777": "Chup bc mc", "otakusector": "Try changing your political opinion that would help the nation", "1998.kaurjassy": "Ek kaam kro apni maa chuda lo", "ratan_jk": "Amount Donated by @reallyswara for PM relief Fund - Rs 0 crore, 0 lakhs 0 thousand and 0 hundred and 0 rupees and 0 paise @nehajaan", "ashish_dhungana_": "Hey larkasss,farthead ,what did you donate for nation.", "dnauriyal": "*स्वरा अभी गरीबो को बचाने का वक़्त है आओ दिल्ली लोग फंसे हुए हैं गरीब अपने घरों तक नही पहुच पा रहे है, दिल्ली आओ और गरीब जनता को खाना और उनको उनके घर तक पहुंचाओ", "varsharomina": "Oyee bhokna bandh kar .. or kuch donate kar bakwas lady", "nischitha_naren": "@nivs_nk 😂 read comments @rahul5445", "pandit_shivsuman": "Tu maar ja.. 👏", "iamratnasingh": "Sensitive content wali warning de diya kro, aisi videos post karne se phle", "lavpaliwal99": "Tuje khud ko nahi pata tuje karna kya hai bewakuf aurat", "akash_linsky": "Randi ki bachhi te mar kahe nii jati", "i_nilesh_patil": "साईं बाग जा और वहां पर वह जो औरतें बैठे हैं उनके कपड़े धो दो वह सब करके", "bijetri_bj": "@gargicmitra this is what i was telling you about!!🤣", "ajaysing277": "मैडम जी आज देश को बेचने आगे आओ आपकी जरूरत है कभी आओ कारोना की आड़ में एसे तो गला फाड़ फाड़ के बोल रहे थे", "rohit__baghel185": "Apne dimak me jo virus bhar rakhi hai na usko theek kar..", "ratikesh_sharma": "Any views on tablighi jamaat and the crime they've committed by putting whole nations life in danger?", "ankyankur3": "Ye gandi sakal ko htao re koi", "narayannadar": "@reallyswara Agg lagake kapda dhone ja rahi hai abhi 😂😂", "iamdivy_singh": "Gumshuda.", "sanjanasingh_557": "🤑😫🤮🤮", "sammy_1991p": "Baby bitch kitne mein bikhh gayi saali rando", "manishsinghjamwal": "3rd class actress.in bollywood industry.....", "princesses_of_mala": "Zinda ho madam...... Bosdiki", "aviral_jain_1403": "Khane ke liye paisa nhii hai toh yeh karegi kya", "sharma_ganu07": "Kyu aj kush bolne ko nhi bacha kya tera pass jo delhi main ho rha ha uske bare main kush bol le tera mulle bhai jo gandgi fela reha ha desh main uske lea kush bol na", "mr.coolattitude0037": "Teri dheere dheere Bakri jesi shkl hoti jaa rhi he😂😂 Jihadi#Randi", "parth_joshii": "Pehle madam dimag Saaf karlo thoda.", "shilpi_singh05": "Kch apne bhaiyon se jo Nizamuddin me harkat hua h uspe roshni daliye jra . @reallyswara - ab ni bolengi app ya bolti band h", "nareshnaresh7265": "Vese ap without makeup chut ma ungli bhi कर skti ह👏👏", "mostlysloth": "Bad actor", "manishjava1122": "Are ye kutiya Pakistan ja k vha ki tareef kr rhi h aur Indians ko galat bol rhi h isko 26/11 bhi yaad ni aya caa NRC npr pr bht bhauk rhi thi ab Corona me kch gareebo ki help hi kr de jinke liye ye bak*hodi kr rhi thi sali kutiya ja k Pakistan me bas ja ( mujhe bhi abhivyakti ki azadi h ) man to aur gaaliya Dene ka kr rha h but apna man ni ganda krna bhag bh*sdi ki kutiya", "skritipp": "Aap ki baat hi alag hai ..... jab muh kholti hain kisi na kisi ke liye ganda hi bolti hai 👏", "debasis_8763": "Why don't you go out a help 🧐... Show your nationalism like rss i doing right now", "qwrty3863": "@xynosss arey madarchode India Kya Tere baap ka Tere aama ka aanda phodu saley Teri aama ki choot", "shreya_rao._": "Dimag thik karo pehle apna 😂😂", "mr.x_babaji": "Comments m toh galiyan padne aaya tha.. Lekin yeh bich bich m Madarsachaap waale andbhakhti karne lagte hain", "destroyer_god": "Muuh me lodaa le rkhaa h kya🤣🤣🤣", "deepaksahu1109": "Kaha ho swara mam Nation wants to know about corona crisis from you. Question like Where is our government laking Which community is not taking care by government. You such a terro..... 🙏🙏🙏🙏", "jamesbond__oo_7": "Hahahahha", "manas.u0": "Kha Gaya tera Randi Rona our mere Lund pe Sona bol na madarchode.", "sandy_chauhan2": "Hahahahahah bhn k lawdi ja Kai shaheenbg mai biryani kha or 500 le kyuki Randi teri itni he okat h 😁😁😁😁😂😂😂😂", "_.shera_._": "Vo Saab tou tik ha but atleast apni acting tou sudharlo....desh ham sudhar lenge.", "mohd.rafey": "Mera no lelo मुझसे बात karo", "dj301231": "Apne HIJDI jaise Tooth ko sahi karle. Ch*tiya aurat", "deen259": "रंडी कि बेटी रंडी ही ना स्वरा छिनाल bhosdiwali", "jadoogirl": "@reallyswara You are such a cutie", "khushboosharma75159": "Ab kyu donate ni kr rhi ab kha chli gyi badi bakws kr rgi thi ab kha chli gyi", "kash_dhawan": "Ma'am please 1st clean your thoughts and mind, the dust that has gone in your eyes while shouting for CAA and your mouth of course which always utters a load of nonsense. And yes makeup krke jhadu pocha bartan is not your cup of tea, yeh sb kaam apse ho ni payege, leave it for other actors jo ki bina makeup jo ki apki ankhon ko ni dikh paa ra shyd, actually mei kr re hai.U please just go ahead n shout @reallyswara 😊", "cuteeeemannu": "Behen savidhan bachane gai thi,saheenbag gai thi lekin jab log corona ki chapet me he to aapka muh nahi khul raha,ab kuch donation do pm funds me to hume bhi lage ki aapko desh ki fikr he", "rituraj__patel": "Chal bh**divali", "gupta_amritanshu": "May be she is not geting salary from shaheen bagh", "alon.e3047": "Randi swara randi", "arrnub": "Truly said\" action speaks louder than words\" What RSS is doing in this crisis Vs what these retards are doing , 🤣👌 aaj crisis ye log servicemen ko ungliya dikha rhe to koi junk food kha rha aaram se Ghar me beith kar !! INDIA IS BLESSED WITH RSS and cursed with these filthy retards.", "mandarpund": "Chi chi chi, teri aawaz sunn ke mere kaano mese khoon aagaya. Meri ulti meri chaati me chali gayi aur mujhe hosh me laane ke liye 25baar current dena pada welding machine se. mai itna mentally disturb ho gaya ki mujhe ye log mental rehabilitation centre me bharti kar rahe hai.", "damandikshit_": "@reallyswara chutiya aurat", "_.anmol_gupta._": "Aeeee didi paisa ni niklra ky ... pm fund ko", "pp650250": "Kutiya", "iammohit_gaur_113": "Ab kahan chhup gyi ho madam..ab chinta ni ho rhi desh ki..ab ni karogi madat logon ki..😀", "dipankarbajaj": "Maregi kab tu randi", "i_tell_lies_trustme": "\"आप\" की \"तब्लीगी जमात\" पर कुछ प्रकाश डालिए । \"आप\" से बेहतर लॉक डाउन में देशहित में हुई इस घटना पर और कोई प्रतिक्रिया नहीं दे सकता", "lucky__thakre": "Didi 🤣🤣", "kartikay_the_fitness_monk": "Apni maa ki fuddi mein land dalwale afzal guru ka sali randi", "ashwin.bxj": "Why do you look like female version of @riteishd", "whohasnizahehe": "Dear Sawara bhaskar... Mai 5 Maheeny se ghar bethi hun kahin b nae gyi even college b nae gyi... Mujhy toh koi issue nae ho raha ghar Beth Beth kr... Aur make up... Are you kidding me... Make up tm ny apni kaali shaqal pr kiya hua hai aur Katrina MashAllah British bhi hai aur Kashmiri bhi toh osko makeup ki Zaroorat wese b nae hai... Osko award b mil chuka isi wajah... Agr woh encourage kr rhi hai doosron ko makeup k sath ya Nahin... Its her choice... Mai b krti hun... Kuch larrkiyan ghar myn apny liye makeup krti hyn na k Tumhari tarah larko ko dikhaany k liye... So you just shut your fucking mouth and get lost... Shame on you Jo tareef toh nae krty skty lekin bs jealous ho skty hyn... Tm jese log kisi haal myn bhi khush Nahin reh skty", "sinha_adarsh99": "50 rupiyaa kaat iska 👆🏻", "soodolma51": "Chural dyean", "sherryoscope": "Hahaha... The love hate relationship with makeup😂", "mohit0190": "Tum kaagaz toh nikaal lo lockdown mei..baad mei kahoge time nhi mila 😜🤣", "mayur.sapariya7": "Apne dimaag ki safai karo phele...🤣😂", "rohhitnagar": "Just wanted to ask swara.. how much hv u and ur team donated in relief fund???", "anshul_j14": "Haa Tu kapde Dhone wali hi h, make-up lga kr bhi kaam wli hi lgegi 😂", "pratham.bhatla": "Tu chutiya hai", "thevarunvats": "Abe kon hai ye chudail🖕🖕", "jeetupal.89": "ऊंगली कर आज", "vishaljaiswal159": "Tu ek number ki rundi hai re bhosadiwali😂😂😂😂😂 @reallyswara", "_boxer_beast__": "Donate money 💴 u fcuker", "coolitdeep": "Kuch donate hi kardo @reallyswara", "polemicist.21": "Betichod...maa ki aankh...haramzaadi saali...ab ni chlra tera activism...doguli aurat..randi...nikal pesa...kr desh ka bhala...muh chlane bethti h bss", "arpit7villa": "Randi ka bhav 50paisa", "zuber.04": "Lol .. Flop actress ka frustration. 😀😀", "love_mich01": "Kr hi le makeup ni to koi darr jayega", "aditya.sreekumar": "Umm maybe donate something?", "miss_deek_20": "Gb road ki pedaish😂", "priyeshhardia": "Kitna contribute kia corona ke liye", "sandy293609": "Caa nrc npr me bahut daravne provision hai Teri to sali kutiya ab mar gai hai Kya CORONA sungh gya desh ki fikar hai na teko donate KR paisa Khali fokat gyan ghadte rhti hai sali Tere bold seen SE pata chalta hai k tu Kya hai", "roopam890": "Pese kitne diye hai ye bta logo ki madad ke liye tune thoos To bhut hau", "shubhammishra751802019": "Tu na me gali dena nhi chahta hu kuki tu gali ke layak bhi nhi he ab jer janta ki mdad", "sugatobose": "Holy mother-this cow also had a boyfriend.The man deserves a medal for stepping into this muck.....", "961989p": "Totally bakwas😂😂😂😂😂😂😂", "aanchaldhiman19": "Mind in your business okk.teko bda pta h deepika ne cupboard ki cleaning makeup krke ki ya without makeup., Abe vo to with makeup ho ya without makeup always awesome lgti h Tu apna dekh na to makeup krke kuvh lgti aur without makeup to chudail hi lgti h looser swara👎👎👎", "mihirsrivstv": "Gaddar", "parishatripathi": "Swara i would like to know why are u not out to help poor muslims now. Dont help hindus if u hate them. But u should go out and donate something to the muslim community and help them get through the tough time. U r such a bloddy hypocrite. In reality u had to do nothing to do with CAA and NRC. You were being paid to say the bullshit u said. Actually ppl like you dont think about its nation u just know how to speak shit. We hate you. Go and look urself in the mirror and u will see what have u turned into!", "shashwat_39oo": "Bhagao in log ko yaar yha se. kaha gye ab ye log jab corona aaya to? Bas lockdown mazzak lag raha h? Desh k liye kuch karo or agar nahi kar paate ho to desh k descision me atleast protest mat karo. Vo descision tum hi log k liye h. Lockdown me documents khoj lo apna ya lockdown k baad chale bhi jana yaha se. #farzilog.", "dhruv_ruhela": "Ary to hm kya kren tu kch bhi kr🙄", "prince._.2": "Ab kaha gya tera josh...lwdi..ab aao na savki help krne...unki hi kr do..jo caa ka protest kr rhe the", "the_onlyhemant": "Tu toh makeup kr hi mt tere pe makeup ka koi asar nhi hoga....", "gajupatilshelke": "Is ke chehre me pata nahi ky jadu hai dekh te hi galiya nikal ne lag ti hai....😂", "dev_kumar.7": "Tu chimkandi h kahan, ab protect karne bahar q nhi nikalti, feminist naam pe kalank 🤮", "amitrt21": "Instead of doing anything you just stay out of our society which is already going through a bad phase and shut your social media accounts if you really want people to do not troll or abuse you...", "funkies_with_no_jobs": "Don't waste ur time by making shitty vedios😏.... though everyone know that these vedios r copied one... during these lockdown days find ur papers otherwise sooner u'll be out of the country😝😝... Wait Wait....why r u spending ur time by doing household chores go nd sit in Shaheen bagh 🤣🤣....u r really ridiculous man😠", "bhushan1489": "Ghar me baithi ho, to kaagaz hi dhund lo, dikhane to padenge hi...😂😂😂😂😂😂", "_mukti_goel": "You should rather spend ur lockdown days by searching ur documents🤣🤣", "shootatsight.hindustan": "@reallyswara got scared?? Ab nai bolegi come on road!! Khud bhi nai nikalrahi hai rasto pe!! Dar gai kya?? Aise chutiyo jaise video bananese accha hai jara jake seva kar garibo ki jinke liye tu ladhne ka natak kar rahi thi!! THE BEST MORON OF THIS COUNTRY!!", "vijeta.hegde": "How much are you contributing?", "nikki.ca.in": "Liberal would just post videos or would try behave westernized like just like every protest and dumb speech you have given , educate your self and actually do something for unfortunate people in the country ✌️", "v_prashantdevmurari": "Apnaa dimaag bhi dho leee", "krishna1joshi_": "Lockdown me maa chudegi teri bhen ki lodo", "ritasingh8147": "tum bss mar jao makeup kr ke", "awadeshmeena": "When reality unfolds...and it shocks you..Don't trust history, something was misunderstood 😔", "arundhama91": "Brush ur teeth....#aunty or #didi🤣😂", "m_kothwal": "Gyaan de rahi thi naa jaake bachana 1.5 lakh logon ko . Hypocrite A-Hole Dumbeshwari.", "bidyut80das": "Wash ur Brain, thoda sasta wala phenyl, baad me Gobar Dal dena. Sayad deshbhakti ajaye dil me..", "febrinedsouza": "💯❤️", "akkiagarwal030": "Itna gyan chod ti ho apni shadi kyu nh bacha payi bhen ki lori jwab de agat h gadn mein dum", "rajachetan17": "apna dimaag thik kar ley. kutte ki gaand par lage gobar jaisa ganda ho gaya hai... @reallyswara", "hereundefine": "Esa kr tu apni gaand mrwa le mullo se 🖕", "pranay4u": "Kuch bola corona ke bare me? kuch donation di? Kuch public help ki? Ab kahar mar gyi bsdki aise to bahut uchalti thi...people beware to these snakes!", "deekshayadav1623": "are kaagaz dhundhe ya nahi?", "dearheenasaxena": "I am very much determined now that i have to unfollow you! I really like you as an Actor! But you are such a confused personality!", "a_n_i_l_h_e_g_d_e": "Maine potty ki hai,aaja gand dhone bc makeup karke agar kuch kaam nahi hai to", "pound_with_pj": "I lost respect and love for you long back!", "sofiarahmanafzal": "Aapka har kaam qabile taareef hai mam ❤️❤️❤️", "shivang._13": "Dalli", "devils_nightmare__": "Roj ka kaam kr na, gand me ungli karne ka.... Aur ye makeup laga kr bhi tu chudail hi dikhti hai bsdki", "who_rohitsharma": "Jihadi kutiya", "noorkhan.7106670": "Yah hairstyle aap per bahut suit kar raha hai", "siddu_g_sherikar": "Gand dho le saali", "yogesh_mad": "Itna sadistic page hai yeh bhenchod... insaan corona k pehle h mar jaaye yaha aake ... itna kyu hagna hai government k kaam per ... samjh jhaant barabar nahi hai aur bas gyaan chodna hai", "boss__betty__blogger": "Tm bhi to makeup kiye ho to dusri celebs ko troll q", "obvious.sach": "O bc kuch donation bi karde is time pe ki har samay bas chillati hi rehti hai or tere chutiye kanhaiya kumar se bi bol na bhen ki lodi..", "sam_hasin26": "❤️❤️", "_viveekkk": "Sahin bag😂😂 me sb ka muh me. leke ab thak gyi ho to mera kachaa bi saff. Krdo 🙌", "nofear_2020": "Kidhar hai mulle gaand suja lere. Bhaukegi nai kya ?", "rik.r7": "Fuck of dude", "i_am_rohit23": "Pehele brush kar", "amitgholave": "घरपे मत बेट भडका लोगोको इसके बारमे भी तुझे बोहोत फिकर हे ना लोगो कि", "mistryarun": "Aur sun khali bathi hai toh kagaz hi dundh le 😂😂😂😂", "ayrusrevorg": "Why haven't you been talking about the lowest strata of society when they are suffering the most??? Yaha madamji ko make up kar k kaam Karna hai. Wah. Wah. Wah. 🙏🙏🙏", "i_ravinagar": "@reallyswara where is your nation now...?? While our nation need your contribution..No..No...you like only to create Drama & riots.", "rizwanmumbai11": "❤️😍", "93.addi": "Riots instigator kitna paisa donate kia", "sauravv_attri": "Lavdi sali", "whitepantherrrrr": "Randi h tu bc", "nisarg___4_6": "Idhar aaja teri gaand bhi dhoke sanitize kar deta hun", "fahadshari5": "Nice ❤️❤️👍", "hiramehta": "Was dissapointed to hear you say on a live chat that you walk your dog in your society every evening.. Then why should kids and seniors who need to be out be forced to sit home.. Please Stay home means home..", "sleepyheadmorty": "Hair - \"locks\" - down days of swara @reallyswara", "runergise": "Modiji ke vajah se hua hai ye. Swara awaz uthao! Ye follow kaise kar rahi ho ??", "kushal_navandar": "वही लायक हो आप", "sayansingh60": "Nagin", "shantanu1989": "Makeup karke g@nd mara", "govindpatodkar": "बिना मेकअप के डर लगता है क्या", "rajuarya.530": "Gandi sakal wali", "mihirkaushik": "Makeup 💄 ke baad iti gandi", "patelvishvabandhu06": "Are tu to muslman nikali isi liye kat mullo ka chus rahi hao", "love_life_point": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "imsavinay": "Ek kaam kar lockdown k baad kaam wali bai ban jaa,training to teri 21 din me ho hi jayegi", "_gryyfindorr_": "Wassup tatti💩", "gkunal557": "Apni maa chudale tu randi🖕🖕", "chiku_ambar": "Rupay de do madam", "shivasharma0ct": "RSS wale gareebon ki madad kar rahe haij", "manmohanpatidar1195": "Fingring s fursat mil gyi tuje", "nonunupur": "Get some life Swara...everyone has their own way of connecting with people. Their’s is much better than yours as they are not putting anyone down like you!! I feel sorry for the way your think...sad!!", "jo_zone": "Aunty Abhi to kuch din pehle Ap Nrc caa k liye bhauk rhi thi Ab kya hua.. Pedigree khtm ho gai kya.. Ohh lock down me to bahar bhi nhi ja skte.. 😂😂", "akshaykumar9oooo": "Ab tum nahi ja rahi un shahin baag balo ko khana khilane....", "virwals": "Jamia chli jao😂😂", "roman_empire_vikash": "Abbi Bhi to modi hi khodega tujhe ran_di @reallyswara 😡👎", "utkarshjolly": "Save India now, you doubled faced. Donate something n go out n help.", "deekshamishra98655": "@reallyswara mem ap k pass documents nhi pr desh ko bachne k liy pese to h daan kijiye Delhi protest me khub pese liy bolne k liy wahi dedo Randi g", "ask.ayush": "Chal teri maaki choot", "rohit.rohiiit": "mam aap jihadi ho just simply fir you i support CAA NRC.. natak mat kar jaahil aurat...nikal deshdrohi kahi ki..", "sanjit239": ",,, bhootni dikh rahi hai bhootni", "stay_solid_never_fold": "@reallyswara काग़ज़ ढूँढ ले चुतिया", "harshhvardhann": "Didi azadi nhi chahiye apko Bahar niklo ka ab", "dishu_dhasmana": "Abe apna dimag saaf kar pehle....#DeshDrohiSwaraBhaskar", "dakshacharya_": "Saali makeup to tu kara hi kar nhi to dar jayenge log suar kahinki", "212ree": "Madam aap toh gayab hi hogayi... desh ki janta ki madad karne aab nahi ayengi ??🤪", "38roshnisahu": "Donation Kon karega revolutionist", "mangla279": "How much u r going to donate", "jayant6085": "Lagta he veere di weeding me itna karne ke baad bhi kaam nahi milraha he", "_anand._singh_": "Neem ka patti kadwi hai Swara bhaskar bhdwi hai 🤣", "sandipbadbola": "Saali madarchod khudko deshbhakt bolti hai comrade randi ,donation kuch nahi karna vas apni choot kholni hai saali jihadi randi", "itssimmijain": "Are gandi photo dalne ka tym h..kha to desh ki soch rhi thi..kvi ek rupaye v donate kia h desh k liye ki sirf Shaheen ki funding kri h.. hypocrite aurat😂😂😂", "iamved_r_k_s_jangid": "Esk video he daal de झाड़ू या पोंछा lagaty huye he.... Yaha glamber set kr rahi hai....😀", "aadityag_": "Kagaz dhunda shuru kar. Kaam ayega 😂", "alkuma.k": "@ruhisista tum logo m insaniyt bachi bhi hai ke nhi...itna to samjhti hi hogi tu ke kisi ka bura kroge to bura yhi dekhoge...ye to tere bhgwaan ki kitaab Mai bhi likha hi hoga...to tujhe shrm nhi aati hai k tum kuch aatankwadiyo ke wjh se hr muslman Ko takleef pahucha rhe ho...wo muslman jo agr tum jra bhi takleef Mai hoga tumhari madad ke liye tumhare Hindu se pehle nikl kr bahr aayega...tum un logo ka sath de rhe ho jo aadmi Ko uske parivaar se dur kr rhe h apni maa bhai bhn se dur kr rhe hai use us ghr se dur kr rha h jha usne apni puri zindagi achhe din bure din sb dekhe...aasam ke logo ki haaye Khali nhi jayegi or shayd nhi jaa rhi hai...isiliye ye kahr corona Aya hai India Mai...har muslman aatankwadi nhi hai or un kuch haraami hatankwadiyo ki wjh se wo Gareeb qurban ho rhe hai jinhe kuch nhi pata. Duniya Mai kya h kya nhi sirf unhe 2 wqt ki roti se matlb hai are wo Gareeb jiske paas ghr rhne Ko nahi hai wo kha apni maa bhno Ko hospital lekr jaate ke unke bachhe hospital Mai ho or wo unke certificate bnwa sake...are jo ye kh rhe hai na ke intzaar kro kaagz to dikhane padenge are koi unse ek Baar pucho saale teri daadi teri maa tera baap ke certificate dikhade ek Baar ke unke hai ya nahi...jo insaaniyt rkhta hoga use smjh aajayega ke ye julm hai un logo pr jinka koi Kasoor nhi kyuki Jin pr julm hona chahiye wo kutte to Pakistan Mai chhupe pade hai", "roshansoni715": "Agyani aurat🖕", "honey774442": "Time to mil hi gya hai ab apna dimag thik kro.... monster", "anuprash_chandrakar": "Chutiya mugalo ki aulad", "ahmdnzaft02020": "Ok❤️❤️❤️❤️❤️❤️❤️❤️", "_black_code0_": "Nikl lawdi..! Terese poocha kisine..? Jaa pehle CAA NRC pdh kr aaja..! Raand ki tarah bina dekhe smjhe khol kt naa baith jaaio😂", "harry.h93": "Shaheen Bagh's sit-in assholes were protesting till last moment....where were you?....you should be there with so called \"feisty women\" so that you could have the taste of \"Corona Time\"......Die bitch", "ansarisultan740": "👌👌", "anant_sinha": "Dumb woman", "ummeeshh": "Randi😡😡😡😡 logo ko bhadkati hai", "augustmclaren": "Chup kar behen ki Lodi. YouTube pe ja ke feminism faila.", "sushil3058kumar": "Mere sath kuchh pyar ki do baatein hi karlo😘🙂", "i_m_aagu": "Kitna donate Ki Bhen Ki laudi?", "raviranjan_28": "1 rupaiya ki aulad ni chali donation krne😂😂😂😂", "kabir_shah97": "Donation wagera diya h kuch ya nhi..", "skatif737": "🙌", "raghuveerdattu": "First go check your brain, show it to a good doctor, bloody basturd you oppose CAA, which means you are the killer of those innocent Sikh’s in Afghanistan.", "reenarathod164": "Pehle aap ka dimag thik kro jis me jang lag gaya hai padi likhi gawar swara", "ashu_tost_": "Qt", "shashank_shekhar_shrivastava": "Mai wait krra hu tere donation kaa..bhut to badi badi baate krti h desh ko bachana ye wo..abb dekhra hu kitna donation deri.. muu se bas mat baj kuch aacha bhi kr..", "itishagaur": "Apna dimag thk karlo🤣", "im_sangram07": "Jihadi apna dimag thik krle🤣🤣", "ritikraj40": "@reallyswara Use your fingers wisely in these free time", "mr_saurabh55": "Don't you fucking thing you love this country so much,donating something supporting This corona fight.batein chodne se kuch nahi hota you right instigator,you provke people they lost there house..you are terriost.I really hate you.Aur tum mujhe bhakt bhi nahi bol skti i didn't supported any ideology Madam ji.", "wajurrahman": "Hi 👏👏👏👏👏👏😍😍", "g__gaurav__s": "agar saheen bagh band nhi hua hota to abhi tak iske 1 million followers ho gye hote 🥺 feeling bad fir this Jihadi ☹️", "__sunny_singh_rajput": "Bht raajneeti kia... opinion dia... contribution kab degi desh k liy ...samjh toh tujhe v sab h...but desh k khilaf bhadka k tera...ghr chal rha h ..we understand you bro.. fake personality...no more celebrity..just a dumbass", "redone_jk": "Now where are you fucking btch, wheres your so called fucng feminism, wheres you donation for PM Cares Fund..... You are just pieces of fcng hypocrite, who only know to claim her \"Rights\" but at the of taking responsibilities .....uhhh...", "natureboy1791": "Tu Chudail hi lagti hai...kisi bhi make up pe...third graded bitch", "vijay.3864": "Bhag pagal Kahi ki", "shresth.mishra_": "Apna Dimag thek kro tum Sabse Phale Madarchod", "siddharthjain0810": "Wanted to know how much you have donated for the huge crisis of covid 19, you care about our country so much, so just wanted to enquire", "1kapil3": "@reallyswara maam ab ni bologe kuch . Ab jab help karne ki bari ayi to kya hua apko. Sirf bakwas karna , Bhonkna provoke karne se kuch ni hota. Ab kya hua . Ghar pe bethi hai ja na help kar logo ki bhonkti hai itna. Ab bhi bolo kuch govt ki help ni karni to apne se hi help kar do", "hpy_uchana": "Haan jaise pehle to bhut busy thi madam", "rudrapandey4289": "@ranaayyub ke behen hidimbaaaa", "p.h.e.n.o.m.i.n.a.l": "Or ab khaa ho tum ab nahi kisi ki help kro gi ki rupiya khtam ho gaya srm aana cahiye JB desh ko jarurt hoti hai tb tum log dikhte nahi baki time sbko fhikr ho jati hai dub maro Corona ho jaye tume", "dikshapandey.799": "U stood up for rights of community right...now when the whole country is suffering, where are you??? I didn't saw u donating for your *desh* jiska Constitution bachane Mai lagi hui hai aap", "the_religion_universe": "SWARA VIRUS 🖕🖕", "suraj_dwivedi1709": "Aur desh dhrohi", "sarwarkhan082": "Good", "osamazubairsiddiqui": "🔥😂😂😂", "akholic_bandhu": "Such a horrible face How does she get films?", "snow21.0_o": "Tatasky channel no. 114. 9am & 9pm Ramayan retelecast! Hari Om 🙏", "akarsh.pandey.790": "Gutter chaap jnu dangai", "_crazy_prathu_": "#supportcaa #nrc", "_s_h_a_shi._.anand": "Tu maat Gyan chod bosriwali didi q ki tumko India ki koi jarurat nahi hai hey Bhagwan isko corona gaand mar le🙏", "swetangi24choudhary": "Mam do only one thing donate something from your earning to COVId Fund", "akanshaforlife": "Kud bhi kuch paise nikal Leh contribution kr Leh", "satnam.padda.146": "Nice", "tarique_anwar.07": "Plz pehle apne baal ahi kr lo..", "sheriseslikeapheonix": "Are you donating something for the people", "darshansuryawanshi__": "Aab madat nhi kregi ye... Jidar phogat me trp milti hai udar hath dhoyegi", "a_man_adhikari": "Or randi ketna donate ki tum? Btao na randi", "unnoticed.extrovert": "Ab bolo didi kuch pehle to bda mu chla rhi thi??😌", "shayan.dreamers": "❤️", "panthera_tigris07": "@reallyswara any donations for corona fighters??? Ya bhokna hi aata h", "anubhav.af": "Donate karo", "4987.ms": "Documents dhund le time hai", "dheerajram7843": "Madam ab desh ki yaad nhi aa rahi kya ?? Kitne logo ko bachaya bhukha mrne se ab tak", "harshapahadiya": "Ab kya hua madam video dalne se kuch nai hoga.. Help karo thoda poop ppl ko", "d_for_devam": "Khali baithi ho to kagaz hi dhoond lo..🤷🏻‍♂️", "wadhwagaurav32": "how much r u donating?? hatred toh bht faila di tumne 😂😂", "anushka_1499": "You are very beautiful. :)", "piyush0312": "Kyu re bollywood ki chamiya, PM relief fund me kitne diye tune??? Diye b ya apne pichwade me daal kar baithi hai?? Kyuki tere jaise to Modi ko gaali dene me aage rehte hai help karne me nahi.... Bitch", "audition.aud": "mam ap tuh caa ke time desh bachane nikale the, ab donation kyu nahi krtey..!!! kaha hai wuh sab anti caa supporter jo dekh ko bachane nikale the...", "i___rohan": "are tm to bht badi badi chod pelti thi ab kya hua kaha gayi ab bhi desh khtre me haii ab kuch kyu nanhi krti gyan nahi pel rahi ho tm ab", "amitmalokar": "Ab jao shaheen buag..josh thanda hogaya...jo bol rahe the kagaz nhi dikhayenge wo aaj bank passbook leke q mey lage ki jandhan ka paisa mil jaye...", "tejas_s_shivarkar": "Tu gap bsss", "mkj200209": "Svidhan bachane ki baat to kr li desh ko bhi bacha ab", "amit.panwar800": "koi batayega is randi @reallyswara ne kite paise donate Kiya", "mukulmk9": "Chinki pinki jesi lag ri h swara...", "_adarsh_shivam": "Dam hai to donate karo", "iamnabilkhaan": "Veere Di Wedding is a superhit because of @sonamkapoor and @kareenakapoorkhan.", "oasis.111_": "Dimag bhi dho lo", "swati308": "Ghatiya as usual..like ur soul", "ashish_afridi": "Ghar me Kya Kar re ho jao Shaheen bag....Haram ka biryani khane instead of making bekaar posts..@reallyswara", "dhruvayan": "@reallyswara kaha hai randi tu Kahi chut me lawada to nahi leri redpig ka, bhosadike Kahi dikh nahi rahi tu, kaha tera lawada kainaya kumar, Khalid 🍑", "be_najmul": "Only I understand the sarcasm✌! Or anyone else?", "mr.baghel226_": "CAA NRC virodhi desh bhkkt mam ab kaha gyi apki akd or achi wali desh bhkkti kuch paise dekar help kro na apne desh ki govt ki ,ya sare CAA NRC virodh me kharche ho gye are dub maro indians bolte ho khud lockdown nahi tum jaise logo ko corona ho or whi mar jao🤬🤬🤬🤬", "anirudhdaga9929": "Randy orton", "amir.kahan.3591": "Nice me ap ko bohat like krta hu 👏👏👏❤️❤️👏👏👏❤️❤️❤️", "rabizzz_ban": "So how much did you donate for covt19 blady shit", "yc88197": "ja n lodi jake caa ka protest kr kutiya", "jay_9955": "As a so called YOUTH, now you don’t want to help people during this global crisis?? Oh i forgot you just help people politically right right . You are shame to this nation. @reallyswara", "tirelesss_soul_rahul": "Are swara didi jis trh se ap shaheen bagh pe josh badha rhi thi ...india valentine ka ayojan kar rhe the..tgik usi trh pm relief fund me paise dal do kam ss kam 50, 000rs hi dan karo atleast karo...and ha maine bhi kiye hai 100rs apne salary ke according donate kar do", "subarnaislam": "😂😂", "itssiddiqui_aysha": "🤣🤣🤣", "rahul_misraa": "Who care", "iamrkg___": "Aao thoda nachlo kyo chuho ki tarah dubki ho", "amar_singh1994": "Quite baby..........khush raho.", "devil.pork": "Do you have any plans for protest? Road shows against corona? Try something new like nude protests, topless protests or a road show!!", "alishanfar": "🙌", "mohd.kazim.16906": "❤️", "maharshi_jani7": "Ye bsdk ek help nai karenge bs in chutiyo se propaganda khada karva do to kar lenge chutiya ladki", "rishav_aryan_": "I love you", "chuslim687": "Ohh hoo lagta hai aaj 🐷 Aunty ne shaving kiya hai 😁😁😁", "akshaykumardiehardfan1991": "Like karne walon ko guilty feel nahi hota kya", "kapil.kumar.581525": "Make-up mat karo...logo ko bhadkane k liye villain bala chehra hi chaiye...", "kansagra_vaibhav_patel": "Randi donet kar", "sourabhgupta3010": "Thoda bahar ghum aao police se prashad le aao 🍑 apne yaha😂 jihadi", "itsumeet25": "Wht u wanna prove actually....? And y u guys posting such stupid stuff haan? U think it's very funny. Nobody will come to clean ur mess u have to do it yourself wether there is lockdown or not. Atleast u can pray to almighty and pray this VIRUS gets over asap. Be sensible make up laga k 🙄@reallyswara", "ecosanku_sankalp": "Motivational story (Real one). A truck driver of mine friend is driving since 1963. Since he's old (74)and at a high risk of getting infected, I thought of giving him a paid holiday. When I informed him of the same, his words were \"Bausaab I drove for my nation since 1963. I spent my whole life for my nation. I saw three wars, I saw emergency , I saw various crisis and I delivered everything to everyone, in every crisis. Now I am on the verge of retirement. Who knows, I might die soon. But god offered me an opportunity to serve the nation for one last time. How dare you to snatch this opportunity? How dare you to stop me from serving my nation when my nation needs me the most? I don't want a paid holiday, please let me drive through the crisis and I will drive for free for next three months. I saw the news that prices of essential items are increasing day by day because of lockdown. Let me get them back to normal. Nobody should starve just because I left my steering. Please go home and let me fight, it's nothing new for me\" These words left me speechless He isn't wearing a Superman dress but he's a hero He isn't wearing army dress but he's a soldier", "the_varunmehta": "We didn''t get any response from you regarding gurudwara attack in Afghanistan.. You scholar and secular person!!!!!", "raman0165": "Aye randi aaj kitni baar hilaya @reallyswara sach bata chupke se modi ke naam ka lund daalti hai na apni chur mein😂", "vijayrana4124": "Ma’am please phele apna dimak tik karo", "rakesh_2707": "Bar bar bathroom jana chah rahi ho... kya baat hai.. akele se hoga kya", "imshivanitanwar": "Kash apne mann ki safai b kar pati....💪🇮🇳", "spacewalker293": "Respect everyone, just think Teri Behan ko prostitute bolega to kesa lgega.", "taqu3636": "❤️❤️❤️❤️❤️", "justin17_": "@reallyswara hi 25 year old woman (15 in 2010)😂😂", "jsindhav781": "Desh ki Gaddar Muslim ki Gulam Salman ki Rakhel", "md.arfat.khan.0786": "❤️", "gulshan_gsr": "Ghar me ho to papers Khoj lo.shyad mota Bhai lockdown ke bad time b na de ki itne din me q nahi khoje😂😂", "ankitchoudhary_25": "Are didi Desh Bachana hai....... KUCH DONATE NAHI KAROGI... Humare Desh Ko apki jarurat hai @reallyswara #justsaying", "_am_a_sumit": "Sali ko ab india k naam pe donate krne me sharm aa rha hai.. Jo sali har jgh supprt krne chali jati thi.. Sali nachne wali aurat.. 💩💩💩 tum jaise raand k chlte india piche hai.. Nd corona ka kuch karo na sali😠😠😠😠😠😠😠😠😠😠", "hameed.mistry": "Kuch mat kar apna mouth seal kar k desh ka bhala kar", "imkaranpunj": "Librandu🤣🤣 kaam dhanda milta nahi. Bekaar ku baat krke limelight mein aana hai inhe", "jayendra628": "😂😂😂 logo per vyaang", "rupacj": "Besides doing all this I am moving furnitures everyday. So house looks different everyday 😆", "abhijitchaudhari_": "Support CAA NRC NPR🚩🚩", "vivekrajput_vr46": "Saheeen bagh m biryani Mill rha hai free jake kho lo madam 😂", "gumnaam_shaqs": "Kundan ke pajame ka naada itna dheela nhi", "kit152barkha": "Fake woman show your real humanity and donate money for needy. Failures of Bollywood are becoming fake liberals these days. My servant is better educated than you.", "6201pandey": "Randi swara", "aumtumne2807": "Fuck of Randi ki bacchi", "hooman_aditya_": "Randi jihadi", "hindustan1508": "@reallyswara ab nhi ja rahi h tu teri ga..d mar...ne ra.di sali", "deepu25695": "Ye dekho dalli ko only free k advice di hai saale nakli deshbhakt ..bikharan ek rs to daan krne ki aukaat rkh teri", "ravisharmaoffical": "Yhi sb krna h madam", "o.nkar": "Kudko celebrity samjhti hai 🤣🤣🤣🤣🤣🤣🤣", "millionsmacks": "आजकल संविधान कि यह रक्षक गर्व महसूस कर रही होगी क्योंकि गुरुद्वारे में 27 सिखों को मुसलमान आतंकवादी द्वारा मारा गया है तो जाहिर सी बात है यह इनके लिए अल्लाह का फरमान होगा", "thatviik_y": "Phle badi chul thi aapko deshbhakti ko lekr .. modi ka virodh kr ri thi .. ab kya hua jao sadko pe ghumo firo.. gand mrao", "nitisharaut": "How much you are donating swara", "rajputana_vikash_0022": "Ja bc Jake ab seva kr country ka......ab khatre Me hai country", "praveen_b98": "Shaheen Bagh Nahi Jana aaj ???", "nishu_rana_96": "Httt bc lichad orat bdsurat suba suba mood khrb krdia shkl dikha ke", "nawab._02": "U talk about saving country how much have you donated now when the country is in really danger? @reallyswara you only did publicity stunts and nothing baby you r nothing but a piece of shit (i have donated 11k)", "binnu_____": "Now it's time to do help financially @reallyswara", "satyamvats819": "chal saali kutiya 🖕", "pravin_lal": "find the documents 😂🤭", "zillurrahmanfaroqui": "Jharo Lagay", "shivu_a.k.a_baya": "Have you comtributed anything to PM relief fund to fight corona... #bollywoodactoncorona", "sauravdhanaik": "these iT cell people 😂 seriously you guys are pathetic", "vaibhavchandrakarr": "KATUO KAAGAJ DHUNDO KHALI BAITHE HO TO 😂", "rahulmaheshk": "Stay safe Swara", "javediqbal8006": "My heart want to eat different sweet dishes.....😂😂😂😂", "swamiraj2021": "Tera khoon hi ganda hai", "chili.cp": "Koi interest nhi hai kisi ko teri life mein. Jaise tene padmaavat mein apna gyaan diya tha bina history dekhe. Instigator kai ki", "sbkhan22": "😅😅😅😅♥️", "kuldip__prajapati__": "Dimag thik kar....aur ..phir se abp news aaa", "amritesh_v": "कागज ढूंढ़ लेना", "gorvgaur": "Teri maa bahen jesi beti #randi", "syed_abdullah_sadiq": "Love uh sis ❣️", "shvamshrma": "Ess bandi ka coronavirus ki wajs se ak mart bcha career khtam hu gya", "naghma.perween.37": "❤❤❤❤❤❤❤❤❤", "shaikhfowaad": "Aapko ghar ka kaam karti ho? yaqeen nahi ho raha hai..Qasam se..achha hai..god bless you..", "arjun_lokhande112": "chiii chiii chiii 😢😢😢😢😢", "gosalianj2004": "Haha..it's our daily routine in Canada to do everything by ourselves. Good luck to all you guys who're not used to do all these chores by yourself👍", "mohammad_hasan_shaikh_": "How r u swara", "yareghaar": "خواهشا منو فالو کنین🙏🙏من تازه واردم😍😅😅", "rajusingh0000_": "chu***a aurat...", "bhautiksuthar": "She is So frustrated..😆😆😄 bolna he par bol nai pa Rai. Bolegi to dimag pe Jo makeup he vo utar jaega😀😀", "bangaheena": "Kagàj dhund Lo usse better to , dikhane to padege 🤣🤣", "nilamchauhan3483": "Tum ghoomo naa sb jagah... Jali se... Tumhe koi nai rokengaa😅😅😂😂😋😋", "boranabharath": "@reallyswara Big fan dear but I must say you really need makeup and make up ke bina mat aana please", "queen879p": "Pahle kuch log berozgaar the aaj sabhi berozgaar ho gaye", "kingku27": "Now start to Azadi from CAA NPR NRC Coronavirus too....... But Maybe You Love Coronavirus cause it comes from China 🐒", "vishalthesingh": "Shaheen bagh nahi ja rahi aaj kal...agar nahi ja rahi to kisi masjid hi chali jao", "mohit.kumar2192": "@reallyswara tu kitna bhi makeup ker leh tu bandariya ki bandariya hi lagegi.jihadi Buddi", "lifejigar": "You are so cute mam❤️", "anteshshsh______": "Hey suara you got enough time now start searching for documents kyuki caa aur nrc toh wapas hone se raha comrade sedlife!", "saif__121_k": "Lawdi", "chiragguptta": "Madarchod jihadi 🔥🔥", "honeyfan2020": "How much have you donated? Asshole!", "im_mgh": "Please donate some money for the poorers in this critical time", "raghav_mehta18": "Bhg saali", "_soovam_7x": "Lawdi saali", "badalgabrumunda": "Tho ye hmko q bata rhi ho.....Aunty😴", "jalebi.bae": "You're so cute♥️. I'm going to do my hair today. Just because 🤷🏻‍♀️", "pappubhai786786": "Swara..mere khayal se eis lock-down mein pehle tum apna Baal(Hair)thik karo😂😂", "singh6203": "Niklo bahr makeup karke jao CAA ke khilaf , fir ghar aakr garm pani karna or fir sekaai hahaha deshdrohi .....😁😁", "dr.shailesh_ig": "Vhi kro jo pichle movie me kiya tha.🤣", "mudit1179": "Apna dimag bhi dho le", "ravi_mogha": "people need your help...plz donate something...😂", "kanavdevsingh": "Mu se pocha marke dekho aunty 😑", "salim_saiyed": "So beautiful 👌", "ara.shabnam": "Please read Quran", "diganta_ghosh731": "❤️❤️❤️❤️", "sanjay_batra": "One dance video....", "saptarshibose2003": "Hello mam", "khiladikumar86": "Ye to randi he sali.....💃", "_._.neeraj": "Nikal maadrvhod chutiya aurat", "aryat58": "Tere lockdown se ghanta par nhi padta tu hamesha ke liye lockdown ho jaa fake feminism randipana Tere liye acting", "rydernigaah": "Modi: Brought back all citizens from all affected countries and released a relief package. . Swara: I didn't see that.", "110ayan": "@reallyswara lots of love huge amount of love and respect ❣️❣️ Gaomuttur peene waalo ka jeena haram krne k liye tum ek kaafi ho keep kicking their bad ass 😂", "saqibsqb": "Apne follower ko 2-2 min ke liye video call kr lo", "bevkoof_toor": "Mastarbation karo🤔", "siddharthj29": "Only if you can see, only muslims are supporting her. Rest all are smart, sensible and true patriots of India.", "manishkeshri8": "Tum na Ghar se bahar jao or phir is duniya se v bhar chal jao.....", "sachinbhati87": "If u want spent tme follow me and watch @ipoonampandey videos afterall last m tumhe bhi yehi krna h.. same on you.", "mohit_gahlaut": "Arey NRC ke kagaj dundh lo madam khali bethi ho to", "mayur_bindal": "you should go to shaheen bagh..", "vikthevalient": "U are jobless then , jobless now ।।। Nothing has changed in your life Miss Anti-national...😂😂😂😂", "saud_bin_riyaz": "क्या हाल बना लिया आपने 🤣🤣🤣", "jagg_dev_": "Ghaint gllbaat swara", "tanny___k": "I don't know why people are showing their upbringing there by commenting so bad thing.. Just want to ask those can you do the same for your sister", "rathour_therajputboy": "Please provoke our citizens against the sovereignty of our India. Literary you are the face of fake and one side activism. You will never realize how your venom destroying the youth of country.", "praveensahu30": "Ramayan dekhna.. thodi akal aegi🚩🚩", "roshanpasha2": "Swara bhasker I m ur fan I respect ur stand in ..CAA NRC NPR ..I pray to allah ur bravery wil b continue inshallah...and last Corona advice to brother and sister STAY HOME....JAI BHARAT 👍👍🇮🇳🇮🇳", "_aashish_rocky": "half khaki pant wale kuch jyada hi naraj hai shayad...Decharo ko koi kaam nahi hai isliye Swara Ko gali de ke apna time pass kar rahe hai .... Bhakto, study karo, NPR NRC pe shayad koi point samjh me aa jaye...", "vinalpai": "If possible apna dimag b saaf kar dena 🙄", "hariom3203": "Kutiya", "sraven295": "Mere ko gaali Dene ka Mann ho raha tha isliye aaya... Par comment dekhe. Tere pe daya aa gayee..", "momentnoteslines_mr_real_r4446": "देखा जाए जिंदगी में सब से बड़े हो तुम लोग और प्लेटफार्म में भी मगर क्या दिए सिलसिला ईमानदारी के कर्तव्य के जिंदगी का रोटी से के हो...Real R 🧡📙🇮🇪⚖️✍️✍️✍️", "firoz_khan2016": "😍", "shivangi_raina111": "❤️❤️❤️", "hiren1952": "Yaar, kitni pyari hai na yeh ladki..", "bhardwajchanky": "Hair remove ➖ kar lo", "masihcharanrawson": "💐", "newujala69": "Time but bura kat Raha hai", "sagar__singh_rajput": "@reallyswara tere jaisi bhosdiwali se corona ko bhi ghin aati hai tujhe Lockdown ki zarurat nahi hai😂", "vivek_mitra": "@reallyswara ,why are you in lockdown ? Dont you know its an order of our PM Mr Modi whom you dont like and don't respect. You should be in Pakistan right now your own country", "ravira7944": "Ab ja .caa ka birodh kar", "_ankurbansal": "tera kesa lockdown pakistanii🤮", "ayesha_.writes_": "Luv u swara u r so brave proud of you", "lalzaresharon": "Maine aapki anarkali of aarah movie dekhi hai,usme apne ek garib basti ko representa kiya,achhi acting bhi ki thi,aur aapne NRC CAA NPR jaise garib majdoor virodhi kanun ke khilaf apne jo stand liya hai uske baad se to mai apki bohat ijaat karta hun,aapki wajah se bohat mahilayen utha khadi huien hai,iska matlab aap ek leader hai,aur waise bhi desh ke sare neta brasht ho chuke hai,desh ko achhe margadarshak ki bohat jarurat hai,aur aap vaise capable ho,to sry lekin aapko aisi harkatein suth nhi hoti hai,to plz aaisa mat kijiye...", "tabrez8739": "Great sawara ji aap lage raho bahot achhe", "vitocorleonnne": "Ghatiya aurat Sooar Bhaskar 🐃🐃🐃", "hitesh_live4love": "देश द्रोही", "aaaah_sheeee_sh": "👌👌😂", "sachin.ydv_official": "The youth leader 🙌🙌👏👏❤️❤️", "riyazgundagi": "❤️❤️❤️", "ins.awyes": "😝😂", "aalisha.solanki": "Shahin bagh par ab tu kya bakwas karna chahehi😂😂😂😂😂😂", "itsirshadsheikh": "@reallyswara 😎sahi h", "sahillkhaan487": "Cute", "pabhaysingh": "Aapse to donation ki umeed bhi nhi rakh sakte, aapka to khud kaise taise guzara ho Raha h", "anujaparakh": "love u :)❤️", "salmansalmani3607": "Good", "ratansharma0094": "Goo kha le", "witttyyy_thoughts": "Chiiii bc tu apni foto mat dala Kar bhenchod🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "chandananashita": "❤️❤️❤️", "smalakar.saikat": "Tere acting to 3 rd class thi or tu to 4 th class heye randy", "adityaprabhulkar": "Dabang lady proud of you.", "haarsshhhxx.__": "Im going to write a poem on you swara❤️", "ganeshganesh1992": "❤️❤️", "abraralvi2": "‪During loneliness lock down fear recite this ‬ ‪🛐Dua that was recited by Hazrat Yunus AS inside the belly of the fish/whale is described in ‬ ‪🛐Q(21): 87&88 There is no god but thou: glory to thee: I was indeed wrong! So We listened to himand delivered him from loneliness distress:‬", "wasim_1717s": "Naic looking", "pushpendra.sen.144": "China gum aa ja ya Pakistan chali ja😄", "m_d_chaudhari_": "चिंतन करो अपने सडे हुये दिमाग को ठीक करो ऐसा मौका फिर नही मिलेगा", "subalternin": "Nice idea @reallyswara. Why restrict yourself from doing what makes us feel good from inside.", "krrish8094": "Ungli wala kaam karo", "shaaviii_": "Didi why don't you donate some money and ask your followers to do the same ,waise bhi wo aapki baat bahot maante it will make a huge difference", "ujjwal.ac.in": "Tu apne dimag ki tatti saaf karle😂😂😂 #secularshit", "aslijazib": "Love💙", "emtyaz29": "❤️❤️❤️Love u", "arunimabhadikar": "Was this for katrina?", "theroysd": "Aazadi chahiye", "im_prithvie": "Ga*d safe kr😂", "bibhuti7209": "❤️", "anam_khan_285": "Skin care", "danishkhan8110": "♥️", "sudixit0102": "उंगली कर ली ?", "rabari6788": "Teri maa ka bhosda 🖕🖕", "hament.singh.1840": "Lovely", "shailesh.jadhav.9461": "Kya gandi aur Bhadi lagti he ye Aurat.", "yoyokhaleelkhan": "Hi IAM from Bangalore nice to watching u", "mahiways": "Swara I have to say this.. I love you 🤗😬 you are one positive soul ❤️", "ri_n_tu": "Bt didi ..app to fail ho geye.... Leftists ko to kohi vote nhe dega ab😂", "uj1769": "And don't touch your face! 🙊", "india.emperor": "dafa hoja dafaaa.. tera make up mai karoonga nahi to😬😬😬😬😬", "raihan_ahmad_nawab_": "You are real HERO SWARA G", "sibasisdutta": "Tu Nikli kyu nahi..corona se Mari kyu nhi", "sumitroystudio": "🤣🤣🤣🤣🤣", "charanjeet_bawa": "Take care🙏", "shrutikol2002": "😂", "im_sanju_rayka": "Corona se bhi gandi sakal aa thu😂🤣", "kundanpradhan1220": "👎👎", "vikash_jha_madhepur": "Makeup kr ke so ja", "mateen_gaba": "❤️", "bilal_diwan_786": "Swara sahi tum bhakto ki bohot jalati ho....🤣🤣 love you..baby", "sabir_sheikh_786": "7ijnj .🙌kicking j7 njj7jnj bj7 j7 .j😢 juji mu7hj8jķ7", "pushu_deshpande": "Maam apki movie kab aayegi we r waiting . Haven't seen u in so longggggg😁", "imteyazk": "❤️😍", "kplsaini89": "🔥🔥", "jyothisingh88": "Hehehe superb", "sahilkumar017": "Live bhi aayiye. Mil kar bjp ki burai karenge. Maan nahi lag raha. Booor ho rahe h", "sandeepkk329": "Bethe Bethe CAA kA act Padh le chutiya lady akal a jaegi teko Thodi or bhadkana band kar degi muslimo Ko rubika ma'am ne pucha tha act padha h ya nahi to Jawab nHi bana tha chutiya", "barbi_asoola7": "😂😂😘😘😘😘😘😘😘", "hjk.oo77": "Zara ham bhi to dekhe hamse bara kaam karne wala kon paida Ho Gaya hai @reallyswara 😁 aa Raha hu", "sheetallakhamsey": "😂", "a.b.mehboob": "गुबार भक्त की बकवास पर ध्यान ना दिया जाए।", "drlohi": "Please sing a song❤️🌹", "___reign__": "keep smiling that's for sure and haters gonna hate, so SHAKE IT OFF !!", "abdul_karim426": "Swara u rock as u stid by innocent people thanks 👏👏👏👏", "zeeshanahammed003": "hi mm ur so beautiful, ....? I love you", "suritraveller": "aap acting karo ..aap shaandar abhinetri ho", "pandeyatul348": "Tera muh bahut khulta hai", "shubhamkumar15596": "Apuu ki mummy ban jao", "amit_the_creation": "मेडम शाहीनबाग नही जा रही हो आज कल।😁😁😁", "ny561009": "🔥🔥🔥🔥", "parichakra": "Love you Swara 😍❤️😘", "i.m.r.a.n.n": "😂😂@qureshi_misba_", "rahmanmoolur2018": "👏👏👏 sub kuch...", "boilkoni": "Or you can use this quarantine period to finally give your skin a break from makeups and let it breathe for once. Yours truly A fan", "babe_wid_d_power": "Clean roads n the garbage around", "ajimuddin71": "👏", "rohan_parashar_": "तुम एक काम करो ऐसे करो शाहीन बाग या फिर jnu चली जाओ वहां जाकर देश द्रोहियो के साथ बैठकर अनशन करो ओर No CAA. No NRC . NO NPR का विरोध करो जिससे एक तो खाना बचेगा ओर तुम जैसी देश की परेशानियां खत्म होगी वहां बैठने से", "sadiq.khan47": "❤️I love you", "thesnugglingbookaholic": "❤️", "nainasharmag": "इसका भी विरोध कर दो आप क्यों चुप हो?😂", "abhishekmh": "Kagaz dhund Lo , ghar me baitke , sirf ungli ga**nd me dalte baitna nai", "lahwf9021": "Sura harpic leke aao mera gutter saaf kar do..tumhre chehre ki tarah ho gaya hai abhi", "i_am_mustaqeemkhan": "@reallyswara You are damm Cute MashaAllah❤️❤️❤️", "salahuddin9261": "😍😍😍", "akshay_ranbahadur9795": "Its not that simple😊", "ashit.mitra.5": "Feeling too much boring to stay in home 24 hrs, yet bound to stay for myself and for the society.", "murat_faisal07": "She is so cute.em😍😍😍", "rao_saaab": "@reallyswara comments mein itni gand-gi hone ke baad bhi tumhe koi faraq nahi padta, kitni strong ho tum. Please keep posting videos for maintaining the record of the #lockdown 😉 people like me who love you would love to see you everyday ❤️", "netra.venkat10": "I love you you’re my out and out fav ♥️", "muhd.ovais": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ angel", "zakir.patel.3304": "Nice 👌👌👌👌👌👌", "imush52": "Loved the way you read Wo musalman the . Sensitive poem.", "nakulshah83": "Get well soon !", "bhupender_singh_yadav": "Donation corona mdam ji", "sheikhsabiya": "😘😘😘", "the_defender7": "Labuuu😍😘", "waqashhh_": "Inspiration ❤️❤️", "alinaninu786": "Love u mam", "sajankhan306": "Love you a lot dear Swara the gorgeous 😊😎😍💕", "shahidyakene": "You are a brave lady", "saffron__anku840": "Tera to hmesha hi lock down hai tu Kon sa Kaam Karti hai Berozgar Aunty", "anirai7": "Ye kutiya hai saaali.....deshdrohi...mai bas isko gaaali dene ke liye follow kiya...isko ticket chahiye waise bhi bollywood me isko koi bhav na deta to sochi desh ke khilaf jaa ke hi kuch kar lu like Kanhaiya kumar", "mohammad_danish2010": "एकदम आपने सही बोला, करुणा से", "mahendra_bahubali.07": "Tu mar kyo nhi jati", "acacius_99": "See all old serial of doordarshan", "luckyravi9": "Dimag ko saaf karo", "actorsatyaa_999": "Bathroom saaf karna bahut zaruri hai..... 😂", "sonuraj9781": "❤️", "_pravin_gadhavi": "Fir mane aapka picture mere dadaji ko dikhay vo bole are bhai ye kya dikha diya mujse naraj ho gaye", "ahmednaseermohammed": "👍", "ruchisudan25": "U r desh bhagt in tru sense..dnt care abt andh bhagts", "zaiq_malik": "Love u swara 😍, take care and careful...from me and ma family .. once again take care"}