{"itsmylifeok": "Liner on point 👍", "markstanleyfernandes": "Locate the funds first to alternate the plan then talk😂", "not_so_brown_guy": "Hey @reallyswara , Here is an Idea...Let us demolish the 215 Acre Film city in Aarey and use 25 Acres of it to build Metroshed. The rest 190 acres can go for reforestation. And I wanna ask a thing, How did a 5 acre Film City expanded to 215 acre Film City in just 10 years 🧐🧐🧐 #hypocrite #pkmkb #sickular", "soulrefreshingvacations": "How many trees have you planted while mourning for aarey? Same question to the followers. City development cannot stop because sleeping mumbaikars wake up and start protesting. Make a difference and plant trees in those alternative places you are recommending railway to consider. #aarebachaoisnonsense #citydevelopment #plantnewtrees #justplantthetree #feedemotionswithactions", "dev_1126": "Filmcity or pam city bante waqt kisi mule se chud rai thi kya Tab nai dikai de raha tha Rand ko", "ph0enix_px": "Itna Prem h pedo🌲se to ramuji film City thod ke laga do dalli", "srivastavn": "Randi madrchod", "s.v.chaudhary96": "तुम वो ही हो ना जो बहुत ही संकुचित विरोध करती हो... कमलेश तिवारी के मारे जाने पर अफसोस नहीं और अफजल को बचाने धरने पर उतर आए थे... थू हैं.. 😒 Shame That You are bollywoOd Celebrity.. जय हिंद 🇮🇳🇮🇳", "the.millenial.indian": "Ha! Paperwork again! Trees are being cut to make these placards😂Just put a tweet next time!", "unknown.devil123": "Jyada gyan mat chod bhangar ki sakal ki ... saali pakistan nikal tu teri ma behn ko leke... tumhari aukad nahi yaha rehne ki ... ye desh ke layak nahi ho tum log, apni dukan chalti nahi Bollywood me isliye @kuna_kamra ye randi ke bacche ko leke nikal padi", "brijeshgupta629": "Tari bahan ki chod Chhote baccho ko Gali deta hai kya our pher bachcho ko save karan ko bolati tum jaise madarchod Muslims ko Gand mai goli marani chahiye", "dsbora07": "Tera Kab sa bachey ho gaye, first have kids and then open your pathetic bitch as pseudo secular mouth.", "aditya_kaushik_117": "Yeh sab krne ke lie itna makeup potna zruri tha kya😂", "mishra.hemu05": "Bathroom me jada Time dene se aisi hi bakchodi sujhti h logo ko... 😂", "mayank.yadav.5686": "Behen apni gadi chor ke kabi Mumbai ke local train me ghumogi na to samjh ayega fir aisi bakchodiya karni band kar dogi", "pranavkashyap10": "Ye naya hindustan hai tumhari bakchodi thodi sunegi😂😂😂", "kanishak__sharma007": "@reallyswara what's happened now when shivsena in collab with your owner's party Congress & NCP the new cm of maharashtra ordered to chop 1000 trees on aurangabad why are you silent now payment ni mili kya khi s", "niketsahu": "Hey kutia 😍", "nilesh_sahani77": "Bina documents ki padi likhi gawar kya likha hai tune Jara Hindi main bol sakti hai kya", "tulsimalam2001": "😂😂😂😂 oxygen chahiye to ped laga", "meet.v.dwivedi": "Really nice", "kaps_vyas": "This anti-national women cares about aarey 🙏 PS sarcasm no offence ❤️❤️", "animeshspeaks_": "Phir shuru😂😂", "competition_stuff": "2141 gone out of 3000", "smrutirit": "Jis paper board keliye paisa milta hai uski hi advrts kariti hai kutti kenhiki", "rk88528": "Flim city bhi isi forest ko kaat k banai gyi h", "sagarpix": "amyway tu toh #tukde #tukdetukde chahti hai na", "saif_ashfee": "Ah fuck! It's happening because of fucking Climate Change! Stop that and you'll be fine", "taral.patel120490": "And where are those alternate spaces Urban Planning Expert 🙏", "abhijeet_gatlin": "Us metro se zada bada he tumhara film city... sharam kr re left ke rakhel", "malaypunetha93": "😂😂😂😂😂😂", "neeta.chetna": "I don't like you....but message is right....and our govt...better know this than you.....", "a.a.y.u.s.h": "Teri film City b Aarey me hi he ......Unko b Trees kaat ke banaya .....Bloody Hypocrats 😂😂 @reallyswara", "karnand21": "@reallyswara apni gaadi chalana bandh kr de, woh bhi pollution krti hai", "ehtesham_ul_haq_qureshi": "That make-up wasn't needed.........😂", "rohit__aggarwal__": "Ye whi h na Jo kanhaiya Kumar Ke support mein khadi thi.. in jaise gaddaaro ko nikal faekna Chahiye desh se.🙄🙄🙄🙄", "ram_gangwar087": "Chutiya lag Rahi ho 😂", "skyd07": "Chl bskd", "ajay.kharol.5036": "Campaign karti he kanheya jese deshdhrohi.ka prachar karti he. Tukade tukade geng ki brandambesder he.", "venom4866": "Aav Aav Aav Aav 😒", "gargaurav07": "Social media warrior do something in real life.yaha photo daalne se kuch nahi hoga", "sonamunda2020": "bangal mein jo hua uske baarein mein b kuch bol do madam..", "__lonewolf3": "bhadwi ko aur 1 naya bahana mil hi gya famous hone ka🤣🤣🤣🤣", "rk_nits_2424x": "Kab ja rahi hai tree lagne bolo", "krishnagupta1292": "So #reallyswara what about the gruesome murder of RSS member family??? No outrage from or that Sonam.Paid Sympathies only for muslims??? Marry one na, preferably from your country Pakistan", "ashuyaduvanshi": "First, she should do research before making any comment kuch pta hota nahi hai bs muh uthake comment karna hai bloody paid celebrity", "sarvesh_gandhi_99": "Bjp🌷🌷🌷", "petrenkocomrade": "Bhenji kabhi local train se travel Kiya karo, jinke parents trains se girr kar marre hai unke ghar jaake Baat Kiya karo, aur phir idar aake Gyan chodo.", "shubhamjagtap007": "Arey gavar sali", "kashishrit": "Behen ki lawdi jab tere film city me hua to gaand marane chale gayi thi kya Teri ye hipocracy", "kushagrasinghgautam72": "Thys wht i like abt u....all other bollywood stars a big load of 💩💩....metro shed can be built underground....there r many examples avlbl in foreign countries how to do dvlpmnt together with preserving nature", "stubborn__shivanshu": "Ye kya kr rhi h tu,tu to vo bol 'bharat tere tukde honge' kanha3ko support kr jake haramzadi bhosdiwali deshdrohi ye sab drama dikhane ki jarurat nhi h tujhe lavdi👊🏻👊🏻🤣🤣🤣", "ashwaryacoolest": "Supporting Christian propaganda shame on you 💩", "akhand_bharat_abhyan": "Kitne Paise mile? 500?", "moonwaterss": "Slay swara #saveaareyforest", "memenist_227": "@reallyswara there are not other options the kanjurmarg option had a more dense green belt than the one in aarey so know ur facts", "msdian549": "Are besharam , hindu family nhi dikhti kya tuze", "so_man_ly": "Haa yaar, bematlab k arrest hogaye the", "preetkamal08": "And she is back 😂", "adityavekariya": "lol u foolish lady , have no clue what u saying , making stupid placard on , you seriously have no job in your life , the space given to metro was given to church intinally and they were gonna cuy it anyways why did you bitches not post against that and film city is also near aarey most tree that have been cut were cut while making film city why was forest not importnat back than and u same bollywood hypocrites talk about saving forest get the fuck outta here and do what u do best that it masturbation on screen stop thinking about politics because sluts like you cant think", "gurjaint_singh": "@reallyswara ye maderchod government ka anginst bolne ke paise late ha ye maderchod gasti ka business ha ye kuch be kar sakti ha paise ke liye", "gourav_agarwal.598": "Metro will reduce CO2 too probably more then those 2100 trees. I also dont support cutting them before this 33 hecters of land 6000 hecters of land is with flim city. In India ppl protest just for the cause of protesting without checking facts refer https://youtu.be/VyJ7xoAQWFk plz...", "harshit_hs": "Swara bhot velli h by god", "its_kaps": "200 aagye kya paytm me??", "sanp497": "Beautiful line as beautiful as you", "alex_unicorn66": "👌👌", "bidyasahu": "And you will provide an alternative space with you peanut size brain?", "sikandar_e_sanii": "Chup sali randi", "rathore_rj07": "Aapna building bhi chod do woh bhi kuch ped kaat kar hi bana hoga", "sailendrasilu": "Inse bash poster pakadwa lo🤨", "abhinavchoudhary_16": "Thank you for raising your voice👍👍👍👍", "realamna": "Your modi killing human being how u ppl can expect from him not to cut trees😏", "rohitsharma2764": "Kutiya ki aur Karl marks ki aulaad", "prashantttiwari7": "Abe 2000 k badle lakhon ped lga diye h sarkar ne smjhi ...... Aur un pedon se 100 guna jada C02 ko hta dehi metro", "codes_and_lipstick": "Ac me Beth k ye sb bakwas kr lo tum 😂😂", "manishkrsingh301": "तुम लोग लिबरल घर मे एसी लगाना बंद कर पर्यावरण एैसे ही सुधर जायेगा समझी पाकिस्तानी दलाल देशद्रोही गद्दार", "heyvenkey": "Bhag lavdi🤣", "rishi.m.awasthi": "Cemetery ki zameen reallot ho gyi is liye to nai tumhare lungs ko oxygen zada chahiye", "pratishthaashukla": "Please do your fact check, Aray forest tree have taproots which have nothing to do with preventing soil erosion or flooding. You just are lime light hogging individual who just had to join the bandwagon of trending topics of social cause. Would have appreciated had you given some factual and logical reason for supporting the cause. Nonsense.", "hotchandmakwana": "👏", "ashish_._ojha": "Can you please tell me where is the alternative space, please specify full address? Also please let me know which expert okayed that, please specify name of that person. If you don't provide these details, matlab aap bhi hawa me he baat kar rahe ho like @talwarisha", "lalit.syalde": "This time you are protesting right way💯💯", "shyamachilles": "Today will do a post on the Aarey metro Car Shed issue - which is turning out to be another case of NGO mafia trying to halt critical projects in India with the help of useful idiots (uninformed citizenry who fall for their propaganda and then spread it). To begin with , Line 3 of the Mumbai Metro is a 33.5 km long underground metro connecting Colaba and SEEPZ, with 26 underground and 1 at grade station. This line is possibly the most critical line of the Mumbai Metro as it connects 6 prominent business districts (Cuffe-Parade ,Nariman Point,Ballard Estate,Lower Parel area ,BKC ,SEEPZ), 2 outstation terminuses (CSMT, Mumbai Central) and 2 terminals of Airport. Now once again NGO mafia are confusing people by saying that “green lungs of Mumbai will be destroyed”. Firstly , many are confused between Sanjay Gandhi National Park and Aarey. Sanjay Gandhi National Park is spread over 11,687 hectares. Aarey Colony is SEPARATE from it and is 1287 hectares. The metro shed will be built only on 30 hectares of Aarey Land and even in those 30 hectares , 5 hectares would be kept absolutely intact and 25 be used for crashed. Thus , only 2 percent of the entire Aarey Colony would be used for the metro shed. Also , 83% of this carshed area is already without tree cover. Also , this carshed location is surrounded by 3 major roads - JVLR, Marol-Maroshi Road and Goregaon Powai road. Now talking in terms of trees ,as per 2017-2018 tree census , Mumbai has approximately 29.75 lakh trees and in Aarey Milk Colony has approximately 4.8 lakh trees, the metro carshed area has 3691 trees , out of which 461 trees will be transplanted and 2,185 trees cut while the rest wont be touched. But to compensate for the 2,185 cut trees , 6 times more new trees are to be planted and also geotagged. Not many activists would tell these facts. Nowhere is the claim by NGO mafia led activists - that Mumbai’s green lungs are being destroyed , is close to reality. And Aarey is not a forest as claimed by activists. It is a dairy and grazing land. National Green Tribunal and Bombay High Court have rejected the activists claim of Aarey being forest. That’s why the name -Aarey ‘Milk’ Colony. Now I", "v.s.h.a.l_01": "Yar plsss tu iss baar congress ke liye campaign kar....So that congress Record tod vote se hare😂😂😂#bikau", "the.pictovert": "😂😂😂😂😂😂😂😂😂 protest against BJP that's it", "mayurchapatwala": "Sali panoti aa gai mc. 👍", "kishlay_raj_": "Paid activist", "pandeyshubham616": "Reason mil gya Insta me photo post krne ka.aur h itna make-up krne k Baad v 🐖ki tatti Jaisi lg rhi ho.", "____j.d.patel____": "Panoti 😂😂😂😂", "ak.ash9309": "😂😂😂😂😂😂😂😂😂😂.haaaaa", "shashankmahamuni": "Hypocrites", "tanmaya.jadhav": "👍👍👍👍", "kd_0806": "Development is also equal important...", "prasad85_kiran_k": "Waiting for this........😂😂😂😂", "preeti.yadav25": "Kitni khushi milti h aise celebs ko dekhkr jo bhakri ke bajaye ache chize spread kre .......love u swara for this", "mandarkaselkar": "Stop using ur ac car n start taking local transport then open ur bone box", "siddhu_chintalapati": "How much are you getting paid for this post aunty? How much of your earning do you spend on environmental causes? Why don't you reduce your carbon footprint by using public transportation? Don't you realize that carbon footprint can be reduced by increasing means of public transport?", "jaintees": "Aur metro Teri chut se banega .... Randi", "diksha_singh_sengar": "Bihar ke lia v kch support show kr dia kriya didi..... @reallyswara", "manish_.aggarwal": "Koi acha sa psychiatrist dekhkar ilaaj kyu nhi karwa leti apna madam 😂😂😂😂", "vashi23": "Thank god atleast being a celebrity u came forward in support of this cause...otherwise there are so many.. so called big Bollywood stars also exists like ranveer, deepika, sharukh, etc.. who never come in front to support any cause like this.. actually they are least bothered people about their county.. they all have house and villas overseas.. so it doesn’t matter to them or their children’s..", "vivek_dkumar": "Bhot sahi... but bhashan dene ke bajae kaam is system ke lie kuch karte hue pic daalte to jaada accha rehta...... HYPOCRISY at its peak", "bestinwr": "2700 trees cut in Aarey for metro has a projection of planting much more trees.. Aarey has huge number of buildings apart from bungalows & villagers ...where were u swara when they were cut ??? To name just visit Raheja estate & it's locality...do something which is true humanity & don't be a puppet. Concentrate on movies may be u wouldn't get any more now", "meghraj_bhargav_05": "[[[[[[[[[[[[[[[[[[🌹माँ भद्रकाली ज्योतिष केंद्र🌹] +91-8054417981)( बंगाली शक्तियो के माहिर){astro meghraj shastri}get immediately solution for your all problems} (1) vashikaran specialist (2) love marriage specialist (3)black magic specialist (4) love problem solution (5) husband wife disputes {A to Z समस्याओं का समाधान } 36वर्षो का अनुभव{} contact now=+91-8054417981 call&whatsapp", "altafvora": "Free baithney...ke faydey....this is one of them..good initiative", "dhadwal.jai": "I love you mam ....", "rawnym": "So u give 5000 crore to buy", "abishini": "Thank You 🙏🏿", "one_.happy_soul": "Faaltu ka natak film city walo ko bol na jaake ki forest ki zameen wapas de... n madam khud kitne plant lagaye hai aaj tak n unki care ki ye bhi bata do....bloody fake Bollywood", "33sadiq": "#SaveAarey", "nimanyu.raj.agrawal": "A Metro rail protects the environment more than 3,000 trees , in the long run. Only there common man knows the overcrowded roads of Mumbai, and the increasing Carbon footprint because of all those vehicles. The local trains are severely crowded. Meanwhile the Metro runs on electricity, and has very low carbon footprint as compared to all of those above. And metro can't operate without metro car shed. The Metro Line 3, for which the shed is being constructed, is connected to major business places, and lakhs of people would be commuting through it. Such hypocrisy you people. Let us demolish Royal Palms and golf course, and ofc Film City and plant trees there instead . Even Film City can get an 'Alternative place'.", "aanchi02": "Is it really worth Posting here on social media , than actually standing out there to protest or maybe using your power for the cause .. think over that maybe that will help yu in this", "rituraj366": "Aao Congress ke time Kaha thi....", "pranay4u": "Aa gyi bho*diwali card leke, sali jab mulle dalit ladki ka rape kr rhe the to kaha ga*d mara rhi thi?", "purvapatil2015": "@devendra_fadnavis @narendramodi", "sibasisdutta": "Poster aunty is back again", "chandan_dali_": "The film city in the same #Aarey area is spread in around 520 acres. Let's #ReclaimFilmCityforTrees ...at least 33 acres out of the 520. What say?", "vidhipanjwani20": "True that", "praviinkaruna": "It's always great to see swara, u always ahead for all social issues 👍🏼", "raksha_732": "Nomo namo ......BJP .... BJP.... BJP🔥🔥🔥🔥........😘😘😘😘", "the_curious_rebel": "@reallyswara also talking about nature conservation I would request you to please stop roaming in your big cars which emit a lot of emissions into the air and travel by public transport so that nature can be conserved in that way as well", "jijonair": "🤦‍♀️🤦‍♀️🤦‍♀️🤦‍♀️", "venessa218": "All know the facts yet innocent are in Jail.", "pinksdesai": "https://www.facebook.com/100004173699694/posts/1381667498649027?sfns=cl", "katrinakaifgoddess": "Gaand maaroon Teri Mai", "indian_history_facts": "Shutdown film city. They are destroying our aarey. #shutdownfilmcity", "nehavirendra_aggarwal.na": "Aur modi ji plastic ban krwa rahe hai....unhe pehle inko to roko...pedo ko bachao...", "krishn27.official": "Pagal aurat", "pratik__deb": "Mind your own Business attention seeker 😒", "the_journalist4197": "Hello fake environmentalists", "rajaljainbaid": "Totally agree", "ashuagarwalphotography": "Ab bas samj nhi aa rha kiske raaste chale Gandhi Ji ya subhash Ji.. Gandhi Ji Ke rasste patience h par yahan wait nhi kr skte and for earth humme inne inke hi tariko se smjana chaiye....", "kunwar_ji_208": "Behn aap to rehne hi do ye chutiyapa plzzzzz😂😆", "that_unknown_yuvak": "Fir Aarey pe bana hua film city bhi tod do,voh to shed se bhot jyada space leta hai,", "iammuhammadahmad": "#savekashmir", "yash.bhatt.1272": "303 sit", "jhakkas_prashant": "tum pagla kaahe gyi ho swara.. u r my favorite but thoda akal lagao.. metro will stop emission of CO2 then oxygen generated by aarey forest..", "shhirishh": "Film city has cut more trees than what metro shed requires. Stop goin to film city and grow more trees there. That wud be strong protest. It’s not just Aarey = Oxygen. Still wud appreciate govt if they cud save trees in aarey.", "kshirsgaryogesh": "Aunty learn to act first. Let government handle the stuffs. You just booze and dope. You’re piece of a crap don’t know the complete story and just to flaunt your sinking publicity you just come with all this mellow drama. Go get break. And try to fight for real issues of the world. Somebody pls give her some work. Or els she will just do all this disgusting shit which will have no impact on anyone. Looooooser", "jerin_mv": "There must be an alternative way for metro. This is stupidity", "jumboolunkar": "यह तो वैसे भी काटने पड़ेंगे पेपर बैग्स के लिए, आप लोग प्लास्टिक बैन का प्रचार जो कर रहे हो. Use plastic save tress, waste management should be there proper segregation is required. Plastic ban is not the solution", "dhaval_rohit27": "Paise mile hai...? ye banner leke post karne ke liye...???", "rajendrathakore": "How many childrens you have", "the_movin": "I really appreciate your work👍", "mailanuj25890": "Kutiya humare Bihar ke liye tweet nahi ki tum...", "the_quarantined_guy": "Peche books bhi to trees se hi bani hai or jispe tune likha hai vo paper bhi", "arun.shivanand": "Okay🤧", "__.avb.__": "Okay", "aditya_banti_singh": "Madam what about Bihar ?", "scarface_kkg": "Oh, I thought she will also give out a random, baseless conspiracy theory to make it sound antihindu", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "yin.menon": "WE STAN YU", "jinmayshah": "🤣🤣🤣🤣 where is the option pls tell Madam, for that you should be traveling in local trains daily @bjp4india @devendra_fadnavis so do not use the words politics. Pls focus on Movies.", "swetlana_budhiraja": "U r my favourite 😘🌷", "kamboj52": "Arey didi vha jo golf course hai usko forest me covert krdo na", "kkhanna7": "Technically the court wouldn't give ascent if it was. They are planting equivalent trees in another region. Saving time and reducing traffic in that area. Plus they would have done an impact assessment study.", "iamrupeshsalve": "#Savearey @reallyswara", "sujay.10": "Swara Bhaskar your capable enough to fund the alternate metro shed which costs 5000 crore rupees , if you are capable of funding the money then speak or else keep quiet !!!", "md.7077": "I support you mam... but...Jitna ped todne ke virudh me ho , utna hi agar ped laga ne me dhyan de to .. kisi se ladhai karene ki jarurat nhi.. 🙏🙏🙏🙏", "dbutterflynebula": "😂😂😂", "bhupendra_singh20": "Madam wo sab theek hai par aarey me film city BHI hai hame Chahiye films par wo oxygen se zyada zaruri Nahi hai and the region of aarey covered by filthy film city is 21 hectare #free_aarey #film_city and also shut your film city to save our childrens", "magicaldribbler": "@rvcjinsta bhai my opinion", "jigztatsme": "#HailHitlerSarkaar", "iamshivu22": "Logo ko oxygen nhi chahiye or na hi nature se in logo ko koi matlab h inhe to metro hi oxygen degi usi se jinda rhege ye to...inhe kya matlab h nature rhe ya nhi rhe bss apni life ka safar acha hona chahiye jese puri life metro se hi jinda rhege...ab NGT kha chla gya h wo nhi aa rha h kuch khne k liye...court ko bhi nhi dikhta h itne tree katne se kitna nuksan hoga nature ko lekin government ko bhi kuch farak nhi padta h inhe to apne peso se matlab h...metro chla kr revenue collect krna h chahe koi jiye ya mare koi matlb nhi.. Nature ko save krne ka khyal kisi ko nhi h...bss sab ek do tree lga kr photo khicha kr dikha dete h haa hum kitne rakhwale h nature k..sabko luxury life chahiye chahiye nature nhi rhe..apne maje krne se matlb sabhi ko", "shanayashaikh221": "What is gonna happen by posting this? Nothing right then rather go and fight there. You people have money and power to stop this. I'm sure", "mdsabaalam65": "SaveAarey🙏", "bendrevinu09": "👍", "pramodmundhra01": "Swara > Hypocrite 😌", "rishi_b_theofficial": "Please travel by train from tomorrow and give your oxygen reviews.. Don't just protest, how many trees have you planted? Tell us about your contribution.", "vishal.yadav.184881": "😂", "lovingaarush": "TU PAKISTAN JAA KE REH LE", "rahul.wds": "did stand for bihar flood..", "skasifmahammad": "❤❤", "subhajitsaha.1430": "Bsdk bihar ko help kar ja", "mountain_girl06": "Hey u woke up so early to have this post....but now no use...keep it safe for later causes!", "jjdhwani": "Lol you people are the biggest hypocrites this planet has seen ever", "dr._pranali_dudhe": "It's too late😑😑", "shristi_not_shruti": "It's too late now, they've already began cutting trees and we can do nothing about it.", "neeraj_narwara": "Chutiya aurat", "abhineos": "Please let us(people staying out of Mumbai) know how can we fight the system in this matter", "ig.king777": "😂😂😂", "sumit_freed": "Ok...now drive in Mercedes, clean your car daily, use AC under 18 degree...kal fir se aake pakana...Bye!", "nikheel_kankal": "बाई तुम्ही लक्ष देउ नका", "urstrulydjay": "Ab kuch nhi ho sakta", "kireetdesai9906": "Swara madam, make me your face book friend", "pmtilak": "What a joke do you ever travel by trains. Cause if you do so then you will get to know the importance of metro...", "rahul0405gupta": "Sab dhong hai bc, kitne ped lgaye hai ye opposed karne walo ne", "singh_kartikeya23": "I was actually wondering if you died, which would have been good for humanity.", "areb147": "Vested interests in play!", "suhasdmeshram": "Ab government hi chutiya hai toh bole toh bole kya... kare toh kare kya...wah modiji wah", "sameira20": "This hurts a lot. Cutting down trees that are so older and huge. Can the newly planted saplings as the compensation really replace their contribution to the environment? Won't the rate of global warming exceedingly surpass the saplings growth rate. This is so double edged as we need a well planned metro as well. Who is the one to talk on this on the basis of facts and planning sophistically?", "bharatgandhi12376_": "Mam I think you only constricted on social media in this movement.", "gavi1607": "Must be save..otherwise be ready for nature's disaster.", "ca.mera_kya.tera": "Beware ! Hypocrites on road !", "thedragondove": "ye Mumbai ko bhi Delhi bna kr chhodenge", "omkar.chakshu": "Pls go leave twitter and social media platforms and go to aarey to save aarey", "sambhav204": "Sare mulle ek swar me swara ke sath Jud gye ....I don't think ki swara me kabhi ek poudha bhi lagaya hoga....bas limelight me ane ke liye takhti pakad liya ....kuch to kaam Kar liya Karo...aur Baki logon ko apna kaam karne do.....", "abidabbas246": "Mam ak reply to de do apk liy ma troll bhakto se ladta ho plz mam ak reply to di do", "ankur_joshi20": "Gawar aurat ho tum.... Metro k chalne se 40000 vehicles ka pollution Kam hoga , Jo padne katne vale Hain uske liye 500 naye ped already lagaye ja chuke Hain ....or tum Jo protest Kar rahe ho vo pedo k liye nahi balki uski aad me toot rahe 2 club(hukka and bar) ka protest Kar rahe ho ....#neech #adharmi #gawaar", "deshraj94": "😅😅😅 iski bat to thik but iski niyat (intension ) thik nhi #swara", "shubham.aryan25": "Bihar flood", "swapnil.k.singh": "My dear BMW activists, first give up your bmws and start using public transport, then you have right to fight for environment and then take some real issues.. Not this metro which will be very much helpful for tax paying middle class.. Maharashtra elections daggaralo vastunnai anta ga.. Is there any interlink 🤔🤔?? #stopfaking #urbannaxal #pronaxal", "the_nurturing_soul": "Please checkout my account for poetry related stuff❤️🙏", "123yup789": "Areh aapko to ticket ni mila ky congress ki trf se Maharashtra ka @reallyswara 😆", "gopal.bali.7": "Placards wont help...go out there & try stopping them....your superflous concerns on such issues just seems a personal publicity stunt...real activists dont publish pictures of themselves they work towards the cause....", "abhisingh3": "these cards doesn't work madam..get down to zero level if we really want to save #aareyforest @reallyswara", "ashwini.pundir": "Aise Bach jayega aarey?? Photo upload karke", "vinay.yadav.125760": "Stop this crap...Aarey is not a forest. We are killing more environment because of pollution caused by vehicle. Do not spread this false propaganda..one once the govt is trying to uplift the infrastructure of already choked Mumbai...travel out then you will realise how far far behind is our Mumbai is compared to other mega cities.", "shaikhdanis": "#Andhbhakt ko na to sunai deta hai na he dikhi deta hai", "pungalgadh_ra_padiyar": "Tere bachhe kahan hue hai re suara bhaskar", "reankitashejwal": "❤️❤️❤️❤️❤️❤️❤️❤️", "anshul2291": "Bc agr koi kaam desh ke bhale ke liye hoga uska tjhe virodh zarur krna h .. bc h tu bade wale .. pakistani bitch", "natasharastogi": "I think we need #chipkomovement", "nmeena007": "#Aareyforest #SaveForest", "ripjournalism": "Police arresting protestors !", "priyansh_curator": "Ignore🔥", "wasif_wq": "Swara Bhaskar is a blessing of God😇🙏👼", "pitarmartho": "Aap kisko bata rahi ho kisi ko kuchh samjha nahi ane wala ap ko pata nahi hai kya ravishankar ji itne chikha chikha kar logo ko jagaya kisne suni unki bato ko kisi ne nahi to fir ap ke ye sab right kar ke kuchh nahi hone wala ye des me dharm majahap Robinhood wali bate jada achhi lagati jada tar logo ko yaha kisi ko koi fark nahi padta water crisis climate change planets overpopulation problem education problem smart City and clean city problem because 40% yng ke achhi nokari nahi hai achhi sisakti logo ke paas pahelese hi bahut badi problam hai mujhe lagta hai ap ki problem logo ki problem se bohot jada chhoti hai is desh me itni garibi hai aaj bhi log rod pe sote hai aj bhi aise kitne garib hai kabhi kabhi rat ko bhukha sona padta hai ab api batao is des me aadhe se bhi jada log garib hai jinke pas actual mei o suvidha nahi hai jo yorop me hai sompal sa jabab hai pet bhar rahega tabhi n ped bachayega think about please", "ashpat007": "Look at this clown.", "swatinandu": "It is criminal... We managed to save a 20000 tree city forest in Bhopal from Smart city construction by writing to everybody under the sun...green belt to UN ....But we managed.....", "vineetha_venu": "So much loud the climate change is roaring on life! But still the government is deaf. I mean at a point of time I also wonder if they are 👽", "mantug5388": "Arey tu panauti hai re.", "fa_activate": "People will stil vote for this govt", "aditya_singh15sep": "kvi bihar flood pe v bol lijie madam ji", "fuggo_": "#saveaarey", "aman_kattal_": "Dramebaaj", "superstud__sumit": "वही मैं भी सोचूँ.... अभी तक थी कहाँ आप... 😂😂", "sarvesh_kr9": "What about bihar floods you bollywoods bastard tumhe chutiyapa failana jyada pasand hai", "munnabach": "😊👍", "_x.salazar.x_": "Pray for bihar also", "caramelrainboww": "have su faydo, pela aa jaad toh kaapi naikha :)", "satyashivamm": "One of the worst actors ever produced by Bollywood", "_suhail_mehdi": "Mashallah 🔥🔥🔥🔥❤️", "p_.kay": "Jai Shree Ram.. hare Krishna hare rama .. Bharat mata ki jai ... Mandir wahi Banega..", "sonu.kabeer": "Ye q aa rahi hai bc ye jidar jati hai wo haar jate hai panvati hai", "tanya_ds": "It's done 3000 trees have been cutting", "robi_sharma_": "Koi faida ni in sab ka hindu bhayia party te ena de leader modi nu koi farak ni pena in sab da sab de sab saley uneducated ne", "being_hanif03": "🙌🙌🙌🙌", "imrealaamir": "No Doubt.. We Know without #aareyforest Mumbai Will become Bumb specially in Summer 🌞🌴🏄🎇 . Everyone Know About Mumbai Temperature or Living life howz Peoples love Or servive,", "pri_3993": "colassal stupidity is right", "im_kumarswaraj": "Do you know there is a state in India named BIHAR 🙄?", "kunal_551": "The Film city where you work is constructed by destroying the forests. Now quit Bollywood", "humourshot": "Terrorist are in power they can do what they want to do 😡", "no.1_kalaa_kaar": "Mam please say something about Bihar .. Who is responsible for this massive loss.. about 70 people died in patna .. we need your support say something about bihar ..", "divya_moorjani": "@chef_japvir", "skull_eyez": "@reallyswara go on the roads like other common people, nothing gonna happen by showing a poster", "sujitkasliwal": "After metro start operating those who are opposing don't travel by metro,go by road n see what shiv sena has done for Mumbai from last 20 yrs", "alyan_khan_143": "Nive", "whatyouwanttoknowaboutme": "😂😂😂😂😂😂😂", "nemo_phi_list": "This after the fact they were already cut in Friday Night @reallyswara", "sabaleshilpa": "Every vote counts.. Please be thoughtful", "wolfman1985": "We humans are really foolish... digging our own grave . I am with you Mumbai, we must save Aarey forest, for if the forest isnt there, we all will cease to exist. I wish the metro ahed could somehow compensate for the kind of help that trees give us.", "un_arth": "You can't expect a solution from those who don't understand climate change.", "lawyer_on_fire": "True there is alternate place it’s called “FilmCity”. We need Metro & we also need forest. We don’t need Films coz that’s not necessity. Hope all actors join hands and actually make some positive protest for converting Film city into metro shed.", "sj3587879": "#save aarey Forest", "ayush.070": "pehli baar kuch achha kam kia swara ne", "itschalley": "Please covey that stop using plastic @reallyswara ,no show off but i admire you ?", "arihant.dugar": "Now what to save.. They have already cut down around 1000 trees 🌲🌳🌴.", "asif.lokhandwala": "👍👍👍👍👍", "yash_bohra": "Aap vote mangne toh bihar pahuch gai thi ....... Bt ab bihar ko aap ki jarurat hai toh aap gayab hai madam ji..... Waah re hypocrisy waah...@reallyswara", "amanraj02": "Ab kyaa...ab to Katt gyaa..😣😣", "choudhary____saheb": "@reallyswara Could u please do the same for Bihar floods need your support!! Swara", "ujjwal.ranjan": "Ur filmcity was also made by cutting a part of forest no then any actors/actress came forward at that time 🤨🤨", "_gup_aakshu": "stupid bhakts ab troll karege", "panks008": "Stop lecturing and plant some trees...it's your old habit of sensationalize stories... don't do rubbish talks🐩🐩🐩🐩🐩🐩🐩🐩🐩🐩", "akkirko": "To BC film city walo Ko bol na unhone 210 hector le Rakha hai aarey forest ka tu Jaa k bas tukde tukde gang wale bhadwo Ko support kar is Desh k logo ka sochna chod de", "neeraj_shekher_": "😘", "iampaone_official": "Damage has been done. No point now. @reallyswara", "mena_laya": "Why not some one go for litigation, put stay to it...", "meet_parmaar": "Agree", "uniruchi": "Thank you for raising your voice 👍", "rohan_dixit1987": "Remove film city inside the colony and plant trees there.. It's a win win for the common man and environmentalists..", "hunterrr_manish": "Bhak bc kuch nhi hota aaj kal trend ho gy h 4-5 dinn ka sab ......gov ko jo krna h vo kr lete h....jaise ki bahut saare police wale", "_the_article_": "Good job swara we stand with you and aarey forest", "thefilmyofficial": "Good 💙", "son_ronny": "🌷🌷🌷", "govindi_gudilu": "Love you swata for this", "ca_karan21": "@reallyswara why only Mumbai why don’t u post something for Bihar where were u when Bihar was flooded?", "nehajohari67": "How many trees have you sown ?? All you pseudo secular communits.. fadnavis has planted 23 cr trees ..and you 23 cr lies", "akkiranjan": "Oho madam ko mumbai me campaign ka yaad hai pr bihar me flood aaya hai uspe v to ek post kr deti mam . Sayad apke post dekh k kuch madad ho jati btw good work @reallyswara", "devrules85": "Nice thought and good move @reallyswara but it won't be useful until Mumbai public joins hands against this. Don't understand why everyone is quiet despite knowing the consequences which they can face from nature when trees won't be there.", "mariaarockiadinesh": "BJP gifted for their nation", "munir_vahora": "good job 👍👌", "mr__syed_007": "Mam i am with you", "shameemofficial": "madorchod koi mari behen ko gali moth dayna....barna gormay guskay marunga", "himmatgoswami85": "Ugli wali bai.ungli ghumao", "i_am_rishabhmalik": "We support BJP", "_faiyaz_khan_original_": "❤️", "ninja_boy300": "Teri kami thi...🤣", "mohd_annas_agharia": "🙌🏻💯 facts @reallyswara", "sajid9585": "You have a voice against any thing but when it comes to Kashmiri innocent people not single post about that. Why", "ansarids": "U think all r fools doing this. Focus on character in next film", "67133n": "🙌🙌 . I hope bhakts don't troll you for this", "_love_live_quotes": "Bhag yaha se chutia aurat", "ravi_gautam14": "This is completely foolishness. Our greed is at maximum, we don’t even realise that there will be nothing for future generations. We survive just because of forests. This is not sustainable development and if it is, then our sustainability is killing the earth.", "abekoors": "Unfortunately, that bit about no flooding in monsoons is just misinformation. Mumbai has been flooding during the monsoons since before independence.", "te.586": "👌👌👌👌👌", "manuj_t": "First of all Arey land is a grazing land that belongs to Dairy development dept of the state govt and not forest. Total area is 1300 Ha. Only 25 Ha is required for metro car depot. Sometimes this land is deliberately confused with Borivali national park. It is not the same. Plea 2 declare Aarey land as Forest inWPL/2766/2017 before Hon Bombay HC was dismissed on 26 Oct 18 & SLP 33819/2019 for relocation of Car shed to alterate locations including Kanjurmarg was dismissed by Hon.Supreme Court on 15 April 19. What else? #AareAikaNa @CMOMaharashtra Land at #Kanjurmarg is claimed by private land owners who hv obtained a stay in 1996 in WP 5792 of 96 preventing GOM to make any use of it & is still not vacated despite continuous efforts. So #Kanjurmarg land was never & is still nt available. #AareyAikaNa @CMOMaharashtra Total tress affected for car depot are 2700 of which CO2 absorption capacity would be 80 to 90 Ton per year. Metro 3 once commissioned would reduce 2.25 lakh ton CO2 and other oxides of Carbon and Nitrogen per year. This estimation is done by independent auditors of UNFCC. #MMRC has planted 25000 new grown up tress in the surrounding areas of Aarey with the help of #SGNP. It would be prudent to take things in perspective for the future of this great city and its patient citizens who deserve safer and more comfortable commute.", "krn_pndn": "Thanks for raising voice now u can shit sorry sorry sit ♥️", "kuldeep.kumar12": "I am with you for this demand", "allz_hour": "@reallyswara - #transplantion is also a possibility. Let's enroll all d stakeholders and take a pledge from the #judiciary itself that they will make arrangements 4 5x plantation. What say? #Growth and #environment ... Both will go hand in hand", "danishmkhan.dk": "Great social cause you are doing Swara , keep it up and keep it doing 🙌", "5hubham_k": "Plz aap kisi ka campaign na kre isko bhi panauti lgegi", "imbrijkishore": "Agree with u ....alternate hoga koi govt ko sochna chahiye", "13harleensingh": "Absolutely true mam", "swatikhanna1708": "One of the main reasons for rain in Mumbai is also the growing number if vehicles people own...", "rohinibanerjee651": "Thanks for raising voice", "abhijeetcomplex": "Optional space kidhar hai nobody tlks abt it🤔", "patelnitin12": "Aukat nhi he tumhare kuch karne ke, So shut the fuck up", "talwarisha\nVerified": "Verified", "gopalathakkar": "😂😂😂😂😂 Nautanki", "waseemakramkhanin": "Mere Samjh me nahi Aya sab log protest kar rahe h jinki satta hai WO Bhi Aur jinki nahi h WO Bhi ... Bollywood Bhi agar Bollywood road pe ajaye with fans to aarey ko Koi chhu Bhi nahi Sakta 🇮🇳🇮🇳🇮🇳🇮🇳", "val._.urpal": "Other countries are growing plants / trees and here, we're getting them chopped. Political leaders travelling abroad should spread the awareness in our country. Support from Bollywood personalities CAN BE OF MUCH HELP. #saveaareysavemumbai #aareyforest", "jack2763": "Aarey main jo forest ko katke jo tum logo ne filmcity banayi uske liye kya bhokogi ? Kya wo forest oxygen nahi deta tha", "the_hero_one_": "So nice of you 💓💓💓💓🔥", "apsmyself": "Sadly, the demolition is already started. If ache din looks like this. I was very much satisfied with not so ache din.", "richi_rich_401": "👌🏻", "akash_jhajhra_official": "#saveaarey", "anirudh.2222": "With u Mam", "hasinfatima15": "Love you mam", "mr_darshan_3411": "Hypocrisy level... very 😔", "kal____pesh": "Aur kuch ? JNU me kaam nai bacha kya ab", "rameshb25": "Join Sadhguru", "khan_bags_mumbai_central": "Great post in ur page ♥️♥️♥️", "husaini21": "Tell them to go Shanghai and Dubai to see how Metro is planned there...", "prince4rathore": "Aa gai white board wali madam ye issue theek hai uthana chahiye lekin please saath mein alternative option bhi bata deti to sahi rahta.", "sommukh85": "With u swara", "thenotorious_critic": "More power to you.", "wasim_laskar9": "Love u mam", "_aashish_rocky": "With you mam"}