{"continental_college": "https://youtu.be/PgFGTDjHyVo", "_the_february_boy": "Ghanya", "igamitsharma": "Just for publicity😂😂😂", "tanya2_1": "@payalgandhi_ are you really a medical student? Or were you in deemed college? OBC/SC students gets subsidised fee, ST students have to pay zero tuition fees and hostel fees. I’m still confused are you really a doctor? Out of 150 batch 15-20 students fail in first year MBBS and most of them are from reserved categories (ps I’ve no objection with category students receiving free education). Well let’s not talk about MBBS there are other fields too where students fail. Failure should never be the issue. You have been brainwashed by zee news. They have compared Kanhaiya Kumars age with every JNU student. Ma’am education takes time, PhD takes time. If you are a surgeon and you have completed your PG in US you must have spend at least 8 years in completing your course. And if you are talking about completing residency in India then yes, we have to pay. And I’m sure you might have gotten the seat through NRI quota! No wonder you’re complaining! Who has set such rules that only after completing your education you can join politics? Is there any? If you’ve never seen complaining a med kid about his fees, were you really a med kid? We complain a lot! You are correct but only in one thing i.e why only JNU should get free education. Yes we all should get, we all must protest for free education, it’s our birth right and not just JNU student! Did I mention med school or residency? Well I don’t know about you but my cousin is in UK doing her PG and she’s paid around 2700 pounds 😊", "iam_aaravrajput": "Swara Tuu Konsi Garib hai JNU ki fee efford nahi kar skti tji", "rajeev.music": "यहा तो विषैले वामपंथ की बदबू आ रही है 😂😂😂", "shivamtiwari_76": "To madam bacho ko kaho padhe Roz Roz dhrne pe baith Kate h kejriwal ki trh", "the_10th_man": "Yeah really wanna ask the amazing scholars of JNU to give me one example where Socialism has actually worked lol", "bgm__nation": "#standwithjnu", "kahani_khor_kkay": "I really like ths girl.. being so busiest.. she is socially very much aware and active for social causes... Proud on you.. Veerey❤️", "adiyogi_ajay": "Unfollo Karo Yar esko.....jaha deshdroh hota he waha swara hoti hi he....👊👊 Plz unfollo Karo", "itsvinayak45": "Bhailog galiyaan mat do aunty bolo sirf #auntysatkelihai", "_i_am_abhi____": "Waah re tukde tukde gang", "unknown.devil123": "Sabse badi madarchod aurat h tu saali... hypocrites", "megha2315kashyap": "❤️❤️", "____j.d.patel____": "Teri ma ki choot", "shivamchoudhary25": "Tu bhen ki lodi h tu apni maa chuda", "satish.yadav322": "We strongly demand swara bhaskar to be arrested and file FIR ,", "amankchauhan98": "🤣🤣🤣", "0_o.artreee": "Bencho waha padne wale to desh ke kalank he or padai nai unko propoganda and tukde karne vale kam milte he waha jinko ye suar baskar jese log support karre he", "kk475678": "Tu jarur band karaygi jnu bc😂", "krunal7422": "Shame on you", "sandeepgusain7211": "10 rupee ka 300 kya hua feehike tumeri maa ke JNU walo#shameonJNU", "isthatsurabhi": "Dude these JNU fuckers are just jobless and fucking coward. All they do smoke, drink and protest. They can waste money on these fucking things but they can't pay college fees. Amazing and plus they misbehave with everyone. Fuck you anti nationalists. If you guys really want freedom kindly move out of this country because you guys are just waste. And @reallyswara if you are supporting them and please get a job", "akhilyeluri00": "Shut the fuck up, have you seen its fee structure its cheaper the sim card", "nsd588": "Are madam why you are always on tge anti national mode?", "_saali._": "More power to protesters ✊🏼💪", "tube_mania1": "🤣", "rockpandit": "Jnu me deshdrohi pal rahe hai free ki roti me.", "karannn_rajput": "madarchod sali rand", "gurjaint_singh": "@reallyswara ye maderchod desh drohi ha gasti swara bhaskar ye maderchod ko sabake sikana jure ha ye maderchod ko Syria baj do", "tapan__6698": "#ShutDownJNU❤🚩🚩🚩🔥🔥🔥", "vijaysandaraj7": "You are pure anti hindu and anti india paisa bohot milra hai lagta hai pakistan se aut dubai b jati hai na tu sali", "shikha_3008": "@priti_jain1 Madam thoda sa padhai Kar lo na.. Tax payment ka Matlab samjh aata hai.. gareeb se gareeb insaan bhi tax deta hai jab woh koi samaan khareedta hai.. Right to education samjhti ho.. kher tax pay karogi uss layak toh lag nahi rahi ho.. Constitution padho \"right to education\".. Thoda padh likh leti toh baar baar aisi bewkoofo wali comment nahi krti", "rajvamshi9": "On a lighter note why everyone is behind the govt ? Is not the JNU an educational institute to get some education.... To question BJP, there are many opposite parties .... Why the students is involving in political stuff... Better to concentrate on the studies...", "sivakrishna08": "Paying 10rs is fair ??? What a fucktard you are in this age of modern world👎🏼 shame JNU fuck you assholes", "_themodernconservative__": "JNU mein so called gareeb bacche tujhse mehga phone use krte hai aur pure din high rehte hai vo alag! Magar bahut greeb hai bechare, beekh maang kr Rs.10 rent dete hai hostel ka but ganja phookne ke paise ped se girte haina?", "pratikjangde": "Naxalite😡", "kavu.h": "🖕", "anshul2291": "Pahunch gyi antankwadi apne thikane par.. mc bc antankwadi tm sab jnu waale ho", "sumeet1811": "😂😂😂", "kumar001saurav": "Thnkuu mdm", "shivampareek25": "Why are you mum on vandalisation of Swami Vivekananda in JNU campus. Shame on you fake liberal.", "usman.idrisi": "More trees, less bushes.", "__oindrila_": "@e_x_p_e_l_l_i_a_r_m_u_s 😭❤️❤️", "yogesh_5": "You are perfect leader for them... Both are anti-national 🐷🐷", "sanjit789": "🐷🐷🐷🐷🐷", "sahushivam_": "❤️", "caprakhar": "Sach sach batana.. Pappu ne likhwaya na ye sab...", "prince_mali27": "JNU IS FACTORY OF DESHDHROHI LIKE YOU", "dsbora07": "Bitch you'll die ugly, look what you've come too as if you've no job to do, Yes, that a reality NO job for u bitch, even if one, you know its not what the dick u want. 😂😂🤣🤣🤣🤣 Bitch you deserve stinking shit thats what u are.", "fluffyanxiety": "THANK YOU!!!❤️❤️", "lazspac3": "🔥🔥🔥🔥", "rajdeep_mandal": "That why they vandalized the statue of Swami Vivekananda", "rajanravi._rajput": "तुझे भी अब चाहिए क्या फ्री का खाना पीना कुछ अच्छे सलाह दे दे इनको जब देखो तब मुँह उठा के चले जाते है", "sharma.jeetu28": "Aunty ji b JNU me padhti he Kya 😧", "_be_besharam": "Good well wishes for you", "harshitaswami": "Thanks Swara Ma'am for sharing this.Hopefully now it will reach to a larger audience and people will get to know our plight .. Otherwise Godi media has already harmed our JNU enough by showing misleading news....", "nipun_sharma7": "Recharge your mobile for 200-400 bucks every month and not willing to pay 600 for hostel. Irony of the situation. Sabko sabkuch muft chahye", "sh.reya6920": "Shame on u", "bhimgradiya": "Tu dede sabko hostel k paise", "arupkaushik": "Deshdrohi free mai pal rahe wahapai. Kisi party ke ideology ka birodh karna okay, but desh ke against q.", "______tanaya2311": "That fckin JNU students vandalised statue of Swami Vivekananda . So f*** you", "imchirag_2220": "Jay bheem", "shashankcavalrybrat": "PAKISTANI WHORE IN YELLOW SUIT LEADING THE PIGLETS.", "devilian07": "😂😂 jaa be hypocrite sali", "jad.nandu": "Auntie😂😂😂", "_.kanishk7._": "My Jnu entrance is coming in a few months, wish me luck❤️", "rahiljain_": "Inke ke hath m i phone h or 300 RS monthly hostel k nhi de sakte sab kheraat m hi chaiye bhikariyo ko", "anupbisoyi": "Waste of my tax paying money for them...", "chandramishra40": "👏👏", "that_the_tray": "@reallyswara Instagram must introduce haha reacts like Facebook, because every time I go through the comment section of your posts, I just sooooo much miss the haha react button #standwithjnu ❤️", "bjpsanjeevchoudhary": "jnu me sirf gaddar chupe hue hai", "sushantsrana": "swara ma'am , i love the way you express everything like whenever some people try to demotivate you or make you down, you comeup with the right point and exactly your replies to that pathetic questions makes me happy and also motivate me to keep myself to the point. So, You are motivation to me.lots of love ma'am.", "mkumar7": "Yea 35 years old staying there and living on tax payers money", "sharmavidushi55": "First clean ur own bushes 🤣🤣🤣🤣", "tanvigulati86": "Be ready to embrace the trolls girl...@reallyswara .wish you peace😉", "premal74": "Most chepo actress ever in Bollywood and low level women also ! No money for fees but lots of amount for protest 😷😷", "wizzardsexy": "I can see a comarade in her😍😍 @reallyswara", "apurvakulkarni10": "Time to unfollow you!! @reallyswara", "aparajita.verma2": "Are you an alumni of JNU?", "manjareedas": "People who have so many complaints against JNU should atleast make a small effort and spend a day in JNU before speaking their shit on social media.! Just a small request khud aake Dekh lo kya hota hai JNU me. 😁", "its_all_logic": "Come on!!! Such universities are nothing but political akhadas!", "masharaturi": "https://hindi.thequint.com/voices/opinion/jnu-fees-matter-subsidy-on-education-needs-of-student", "jaintees": "No one cares bitch", "abhisharma293": "Sharam aani chahiye jish desh me rahte ho jiska khate ho ushi to todne kisi bat karte ho", "singhtushar04": "Are waha bhi pahuch gai.....tukade tukade gang", "sandesh_kajava_": "10rs mei tooth brush Nahi milthi aur tumlogonko 10 rs mei room chayiye😂😂", "mihir_srivastava": "@sujoyyyy @whywearesatyam @prateek_1405", "das_vanthala": "✊👏❤️✊✊✊✊✊", "dj_thejourno": "I am proud of you my girl ! You give me hope and a smile . 😘", "ig.king777": "In short JNU ek chutiyapa hai🖕", "avantikarathour96": "@reallyswara tm jnu wale desh ka khate or desh ke sath he gaddari krte ho 300 rupy me mre ja rhe ho sb free me chahiye tmko apne 300 ke liye samne wale ka 30000 ka nuksaan krdo uska kuch nhi tm or kanhiya jaiso ko to goli maar deni chahiye turnt jane sarkar kya kr rhi h", "mdehteshamnaseem": "Now after seeing u protesting also they'll increase the fee hike double..😂😂", "raviranjan_28": "After this chutiyapa ... I am going to unfollow u 👌", "xainy_khan786": "uh are the best🔥🔥 swara", "thetalkativedoctors": "Respect 👏 & Word, maam 🔥", "manudavid27": "In an interview with a Malayalam channel Swara was asked why she would get in the fight with these powerful people when she could easily hide under like her many colleges... She answered.. It takes one of a kind idiot to do the things I do... Ms. Swara you have no idea how much we appreciate you to be that kind of idiot... More power to you hon...", "rakeshsharma5066": "JNU produces traitors like you. You're nothing but an ISI asset. You maybe not an ISI asset but for Pakistan you are an ISI asset. Traitor", "abhinke30": "😂😂😂😂", "7irfan8khan5": "@reallyswara more trees less busses 🇮🇳", "vaibhav.07_": "😂😂😂😂😂Kahi toh dandha Karna hai .. acting toh 2kaudi ki v nhi Hoti so", "akshaymalhotra2016": "Burnol liberal 😂😂", "ravira7944": "Jnu me deshdrohi hai Tu bhi ho", "arthijeevanand": "Shut down JNU altogether. These ungrateful brats will only serve to bring down everything that is Indian.", "hanish.rock": "Desperate for attention 😁", "shailesh.jadhav.9461": "Bandriya lag rahi Hoa", "heymant79": "10 rs chay nahi milti àajkal ye shareef shane hostel mang rahe. Waa", "beingmetal": "Hello swara aunty", "bbnsha": "Salute comrade....", "mansiid2018": "Well said ma'am!", "mehandraa": "Jnu ko band karo.....sale sab gaddar hai", "sataynnimawat": "Deshdrohi", "someonelikesaurabh": "I just unfollowed you dude! Cheers", "tkrishnakishore": "👌", "its_gowda_manish": "If u have so much concern on u r few terrorist friends inside terrorist camp of JNU.why can't u pay there fee as they are so poor. Pay for u r aunty, uncle friends of JNU who r staying since long time in name of studying... 😂😂😂😂", "nat.korg": "😂", "sagar_kanha": "😂😂😂😂😂", "vashi46": "Jaha pakistaan zindabaad k naare lagaye jaate h bolna bhul gye madam... Kanhaiya kumar jaiso ka adda h..", "sayin_aylin": "jnu zindebad", "pranay4u": "Aa gyi na aukat me bhosdiwali", "sameer_mehra007": "This fucking girl.just want attention..will stand any side,where there is controversy.. A Whore", "mudassar_hajwane": "👍👍👍", "lalit.syalde": "Shame on you... jitne rs ki ye board pakda h tumne utne me wo waha poora month ki fee dete h kuchh to soch kar protest kiya karo madam", "nitishhivven": "Thank you mam, for being true to the nation.. We need more people like you ☺", "ashwini.arnav": "What JNU taught U and others is clearly shown in their attitude so as Urs my dear.... And now I know the reason why U talk all those bullshit holding “Boards in Hands” @reallyswara", "tanishaghosh95": "It is good to question the government. We all have the right to do so. Criticism is great too. But, to hate your own country? That's not normal. I completed my studies from a centrally affiliated University that was situated in Jharkhand. I don't think you would even get to think what were the limitations there. So, I really don't think I would want my tax money to go to a place where all I see is hatred. And btw, 300 for a room is nothing. I saw my college folks give 1200 for a room and they were way too \"limited\". I respect you for standing out there for your University. But, to support the wrong is never appreciated and to provoke more people to do so, that's not what a sane person does.", "priti_jain1": "#timetounfollowswara madam now u r privileged can u please tell what are u doing for those students? What’s ur contribution to underprivileged JNU student?", "anushav1905": "I m trying to arrange money for my dad's treatment...... Please visit link in my bio.... Link has all details..... My dad is suffering from Liver cirrosis (non alcoholic Auto immune) and needs Liver transplantation... Even a small amount will help 🙏🙏", "chinmay_sabnis": "😂😂😂😂😂", "biswastuhin": "Ab toh fees ni kam hone vali JNU ki", "advitiya_anupam": "Aap jaisa hone k liye himmat chahiye .... wrna to bollywood logo ko chup hona sikha deta hai .....uss industry me reh krr apna ek opinion hona aur uske liye awaz uthana badi baat hai @reallyswara ❤️❤️", "pungalgadh_ra_padiyar": "Free ka khane ka shouk chadh rkha hai na", "avinash9140": "Koi bacha lo yaar is Modi Sarkar se is media se Desh Barbad ho raha hai", "mrinaman5": "Why you only have a soft corner for JNU I have never seen you gabble about fee of IIT & IIM or do you think that sharp mind come from JNU only or I would say just some moron like u", "dharmesh.sarwan": "What bullshit you are talking about. Bloody some of the assholes are getting free stay, study n what not on our hard earned money that we pay as tax. If you really feel for those who cannot afford then concession to be made for them only n for them who consider afzal as Martyr. I do ant agree with you.", "nil_e_writes": "🤣🤣🤣🤣", "raj.kamal.5076798": "Panauti", "dravinashbaudh": "👍👍❤️❤️", "m4maheshmicheal": "👍👍👍👍Right... Jnu is the one of the best institution in the world.. But government always strikes....", "srublovs": "😁😁😁😁", "sanoopbalu": "❤️", "shirin.bithal": "@reallyswara I really admire you, as a woman and as a human. You speak up without any fear or cowardice unlike most others in that fraternity. More power to you!", "official_saket_kumar": "Stand with Jnu", "siddharthhosakere": "You are such a traitor of sorts ! The jnu chaps shout slogans against India and create a hostile environment and now vandalize swami vivekanandas statue ! Are you blind to all these atrocities ? It’s a pity even though you are a daughter of a naval officer, you have such a notorious anti India school of thoughts !", "ghair_mutaliq": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "ojhavibhash": "@reallyswara filthy cunt kitna jhut bolegi", "saurabhnegi9713": "Are u educated ? Really .... 🤣🤣🤣🤣", "patel_nitesh678": "#antyswara😂🤣", "harishankar_mandia_sfi": "❤️ ❤️", "viditgandhi": "Ye Rs.10/month hostel. Ye kaunsa real estate model hai?", "a_swaminathan": "Recently in some interviews swara has said she is not belongs to any political party ...that flag is shows like u r a cpim supporter from ur college days", "animesh457": "Only agenda of this government to shut down the prestigious university of India by spreading rumuors #support JNU", "ramyasingh__thakur_": "Idiot", "srinathanna": "Focus on your career please fatte mein tang mat ada Edi 😂😂.", "5hubham_k": "Worthless leadership of u", "imnishantb": "Sick arena sick allumni", "imarun07_": "आंटी", "laxmi.gautam.165": "Totally agree 👍", "karnasakthi": "😍😍😍😍😍😍", "panks008": "Swara motivate jnu students to become something great like Vivekananda not to become librandus like you... students has already seen example of kanahiya Kumar..shaela Rashid etc... Don't intimate students to fuck in college campus in the name of freedom....we know you have no self respect but let others have.....stop inciting voilence...go and do acting seens like you do in veere di wedding... masterbation seen it suits you.....", "jaindharm": "Jaha deshvirodhi baat aur gadaro ka sath waha swara pahuch jati hai", "ishita5855": "#JNU❤️", "sudixit0102": "#reallyswara और कितना बर्बाद करोगे रे jnu वालो को भड़का भड़का कर , बाप बैठा है up और सेंट्रल में , जिस दिन जम गया इन सबका पिछवाड़ा लाल कर देंगे , विवेकानंद का अपमान पर भी तुम इनके सपोर्ट में हो , डूब मरो वामपंथी गद्दारो ।।", "suraj_tiwari2517": "Tumhra To Boycott Karna Chahiye Public Ko....Bahut Bada Fan Tha Tumhri Acting ka Lekin ab Sharm Ati Hai.....Jaha Desh ke khilaf bola jata hai unke sath khadi ho thu hai tumpe....300 rs mahine ka rent bht jayda lag rha hai in Chutiyo Ko ......", "s.v.chaudhary96": "@akshay_nehra_official ye dekh bolaaa thaa naa khadi hogi abhi hp gayi😂😂😂😂", "santiibaba_thebiker": "Shut down JNU.. these kind of anti nationalist institutions should not grow further..where majority of students behave and feel like terrorists .. #shutdownjnu", "shobhit_tyagi88": "Shame on you and JNU 👍👍", "samitmulik": "Oh mata kuch bhi", "sanlalits": "Behna, koi Paise deta hain yaa khud he itni bakwas karti ho.", "piyush.s26": "👍", "gorvika": "❤️ #Jnu", "namitkr": "Why mum on Vivekananda ? Time to unfollow", "parekhsenki": "@reallyswara 🖕🖕🖕🖕", "shumaila8021": "there was lot of baton charge in the peotest", "vashi23": "What about those folks, who are misusing these facilities... doing a job earning a hell good amount of money and still using jnu facilities... are they right in this too.. every time jnu folks cannot be right...", "piyushverma8888": "😃", "igandhirishav": "👍👍", "amitmeeng": "budde students ki dharmsala hai jnu..", "kuljeet_singh_nikkuwal": "Laal salaam 🔥", "the_streetsmart_girl": "शर्म और शालीनता को बेंच खाने का नाम है- JNU", "sunnydgr": "U always stand with wrong. Sorry but un following u now 🙏🏻", "payalsingh1611": "#westandwithjnu #feehikeprotest #educationforall", "anshul.iitbs": "Great, but why should the expenditure come out of tax pockets? If JNU is so good, it must have a lot of distinguished alumni who can pay the bill of this 'openness' and 'free ness'. Please spare us.", "aman_kattal_": "🖕", "raghuveer_2018": "#ShutdownJNU all r relatives of laden. Most of anti national r there", "good_vibes_gal": "What makes you think that slogans like Bharat tere tukde honge is a mark of freedom from limitations. If I were given an option to decide where my hard earned money shud go as tax, places like JNU would shut down. It's an education institution, where everybody is welcome to study and pursue their dreams.Instead it's becoming a hub of anti nationals who think it's cool to hate their own motherland.", "singh.deepak9927": "Jnu 😀😀😀", "chandreyee1975": "Totally agreed।💕", "lizadas0907": "#shameonJNU vandalizing the statue of Swami Vivekananda and then writing slogans like f*** etc etc... Education like that should not be supported at all shame shame shame", "ahirsuresh96": "Wow u r useless....", "gdheeraj13": "You just.... Amazing.. #jnufeehike", "ronakronakronak": "@reallyswara Hey tell us what do u smoke ,even we need to know the story behind you posting such insane posts", "laung_gawacha": "You gotta be kidding me @reallyswara ma’am for supporting *propaganda*. Most of the students come from a very wealthy or say good to go family, you won’t let the Nation grow by supporting this.", "ankitabisht04": "💖", "piyalbubun": "😂😂😂😂😂😂😂😁😁😁😁😁😁😁😁", "sumedhrao_malandkar": "JNU has only been in the news for anti nationalist slogans by it's students. It's a waste of the tax payers' money to subsidize everything for those who openly abuse the nation and glorify terrorists", "rahulelex12": "Spotted Urban naxal", "sadaf_daniyal": "Second you on that! #longliveJNU", "udhay_balamurali1": "JNU is such creep that everyone knew", "ronyyy007": "#AuntySwara", "agsilverline": "🤮🤮🤮🤮", "jagdeep.paul": "@ reallyswara At 2,000 rupees ($28; £22) per month, the fees are much cheaper than many private institutions. Not sure in Delhi where can some one find a place this subsidized ? No one in this country wants to pay tax but every one wants subsidies", "erkapilkumarjindal": "Wah wah... They can not afford Rs. 300 per month as hostel fees but can afford rest protest stuff and luxurious things.", "naveen.gnelson": "👏👏👏👏", "patelnitin12": "Just wait for couple of years when these few shades of red fade from our premier institution and it become more conducive environment for rational person to thrive rather than sons and daughters of Marx, #GoABVP #saffron", "champalalgusinge": "Cutiya", "solhstore": "JNU - a place where you change the country more often than you change your condoms.", "moloybhowmick2015": "✊💦hila le bantai hila le....janta k tax se palne wale naxal hai JNU main students nehi ..... maobadi akhara JNU....gov. should give a shok to these brainwashed bhatke hue Naxalites.... thank you swara aunty for reading my comment 😁", "rollo_tomassi12": "nice facial expression 😂", "piscesrajat": "Look at this shameless troll Swara.. how regressive they are.you're a brave soul, stay blessed forever.", "lostboy_11_": "Aapki party hai jhanda dikh rha hai peeche waise.. #LolSalam", "being_me247365": "More power with you darling 💓", "entertnmntworld": "Huge respect 😀💐❤️🤣🙏 @reallyswara mam", "manuzwork": "How many failed students are studying there since ages??", "chandrabhushan468": "Couldn't agree more.", "farzi_sadhu": "😂😂😂 nautanki sale.."}