{"sivaprasad.kundanam": "It's not possible so you roll back", "shaliniverma237": "Desh ka khakr desh par hi thookne wale😡..sabse pehle tum logo ko nikalana chahiye Modi government ko🇮🇳", "vaibhavs4299": "Swara gaand ki jheek laga lo hila bhi ni paoge", "i_love_anime124": "@reallyswara khud Pakistan has aur udhar pooja ya arti Karke dikha ya Apne kisi chamche ko Mandir leke Ka Jo khud hinfmduo ko gaali Marta hai tab malum padega jab khud d Kisi SE chudwa rhi rahegi rand", "mr_cute_jay": "एक बार पाकिस्तानी मुल्लों की बीच जा फिर पता चलेगा गांड सूजन आ जाएगी", "ujwall_15": "Nikal chal", "the_sonu_sharma17": "Land hoga rolback", "rushabhkulkarni99": "No", "killerinstict07": "Apni tatti Karo roll back jihadi", "rj_0506": "🔥", "pankaj.1111989": "सबसे पहले तो तुझे ही जेल में डालना चाइए जिस देश का खाती है उसी देश की बुराई करती है।C ग्रेड की अभिनेत्री भी नही है ।।।", "parasherkaran": "Chup sali randi bhen ki lodi", "dakoo_0722": "Bakwas band kar 3rd grade actress", "amar.chauhan.165": "Sale bahut randi logo ko dekha hu but tere jise randi pure world me nai hai", "vikasnagarphotoshoot": "Mil gyi popularity , ab bnd kr ye dhokla basi", "shinjinii_": "I am sure she doesn't know the meaning of all these four words. 😂😂😂😂", "siddu_g_sherikar": "Tera andar lund dhalke rollback karna chahata he janata🤣🤣", "jaiminism": "Babaji ka thullu milega tuje @reallyswara", "govindsetiaa": "Terrorist", "_vaibhav.agrawal": "Swara raskal.....😂🤣😂", "0_o.artreee": "My ass 😂😆", "indreshravriya": "Pakistan ka paisa liya hai kya tune", "deepak_kushwaha_001": "🤣🤣🤣🤣", "pa909088": "Coming soon islamic state of india wow amazing Swara Khan g", "amarnath_deekshith": "Pack ur bags.....", "_kaushik_vaibhav_": "You are also a bangladeshi", "mister_a911": "Why should we allow muslims of Pakistan to enter india who always have a dream of destroying india and make it a islamic country. You should have protested for the minorities of Pakistan who are really being tortured by those morons those minorities include sikhs, sindhi, jain, Christians and others. They are being forcefully converted and being made to follow Islam. Why don't you talk about that. We are not tortureing the Muslims of india their population is increasing and not decreaseing. We have to just throw out those islamic morons who have illegally entered india.", "whos.omi_": "Maa chuda", "saurav2482": "Abey chup reh sali warna itna boycott karenge teri films ko ki tu roti hui sabse mangegi.. Nikl #wesupportcaa", "7.krabhinav": "Madam jara too aatma Gilani mahasus karo ,bar bar bol ke ki desh ka samvidhan khatre mai hai desh khatre mai hai , aap ne n bas samvidhan ka episode hii banaya hai woo bhi narration part par aap ko full jankari nahi constitution ke working proces ke bare mai , mai jada deep mai nahi jaunga mere ko bhi kam hai bas ye faltu ki drame baji band kar dijiye. If you're talking about article 14 then why you are silent on 44 , and also one advice go and read IPC act's. Aur ye bhoot kadwa saach hai ki desh ka batwara hii dharm ke adhar pe hua hai aur muslim league ko bhoot support mila tha uss samaye minorities se tabhi muslim league jiti thi Lucknow mai (I think it's)1937 , aur uss samay sab ko pata tha n ki muslim league divide kar na cha rahi hai desh ko too phir kyu gitiya muslim league ko aur bolte hai by choice hai (sabhi nahi) desh mai , majak in ar rahe hoo yaha pe ,ek desh doo kanun chalaooge aisa kaise chale ga. Strong moral built karo desh ka desh apne aap strong hoo ga, because a team having low moral cannot win it is as simple as it is. 🇮🇳🇮🇳 I am also a liberal nationalist but not the fake one . Too achieve a target you have too sacrifice comfort it's truth , medicine is always (maximum case) bitter , too be in good physique you have too follow strict diet and balanced diet.", "i_am_kailash_rajpurohit": "Whole india is accepting CAB and praising the govt for this... Only jobless jacks like you are against it. !!!", "chikki1515": "Problem hai toh fursat Mai nikal", "hershey_g_": "Swara's pea sized brain makes her so unattractive. If she wasn't like this she might be a little more beautiful 🤡", "shrutidhand": "Passport to hoga aapke pass... Woh kaunse documents se banaya tha?", "jubindass_aka_jd": "where were you wen lakh of kashmiri pandits were being killed by kashmiri muslims? where was ur secularism?", "mastpandit4u": "#allah ki maa ki chuuuttttttt🖕🖕🖕🖕🐖🐖🐖🐖", "kumar.g.o.u.r.a.b": "@reallyswara CAA padhi h aapne? Ek bar pura padh na! Thn mere comment pe reply karna! Be an educated fellow 🥴🥴", "77young_star": "Nikal lavde", "iamak25": "#indiasupportscaa", "dharmendra93ds": "Mujhe to lagta hai ki is bandi ne school ke piche padai ki hai. Sala isko kuch pta hi nhi hai or gadh macha rkhi he.", "instarohith": "You should go to Pakistan and fight for secularism please madam they need people like you", "sohailsiddiqui8243": "💯💯💯💯", "sweet_prags": "Nice way to get attention...role milenge ab", "mr_jayesh_bhole": "क्या तू अलग देश की है", "rajat.thakur.1826": "Rok k dikha do", "sumitkg0": "@reallyswara fucking you know about real truth", "sampath4074": "👍👍👍👍👍👍", "gaurav2651997": "तु डर मत तु यही रहेगी अगर समर्थन करेगी तब", "ps.bhardwajsharma": "Randi ungli karna sod de", "masterr___x": "Beta wo to wapis hota ni... Soopde bikwalo apne😂😂", "gs73177": "Prostitute swara article 14 applicable on Indian citizens not on refugees ,read Indian constitution", "mriashu": "🤯Really Swara 👎", "ekta052": "Swara balika study Karke aao , maidan me , bewkufo ki Tarah harkate mat Karo . We Indians are happy and fully support CAA. Why you are protesting ?? What is not correct in it ?? Reality is your zero knowledge . Why you actors forget that we Indians have made you star, otherwise you are nothing. And this is shocking that Bollywood actors like you don't hesitate to Blemish Our Country .. Shameful Swara , Shameful . I think time will teach you better.", "ashish.jha89": "Gand marwao madharchod", "anujraj_tyagi": "Do you know what is CAG , i am pretty sure you are an illiterate, as you look. Go Pakistan and i am sure you wont get a role of a housekeeper over there", "adv_vishal_gupta": "Unlike", "sshummery_singh": "Government said it is not affecting Indians of any religion but u guys create more discrimination by posting these things.. Not your fan anymore ✌️", "rakeshsingh9392": "Jaake chudwa sbse randi😠😠😠 aur kuch ho b naa paega tere se ammichod😠😠", "rithvik_vermaaaa": "Chal na lavdi pehli furast me nikal congress smjha h kya Jo tum jese chutiyo ke chakkar me wapas ho jayega jaa jaake fingering kar aur aanand le😂", "tulsimalam2001": "Ban gaya act tu dekhti reh gai", "kanishak__sharma007": "Dandey khaane ki baari ati h to students ki gaand m ghus jati ho chup jati ho yha kutiya ki trh bhokti ho shame on you bitch prostitute", "hitesh_4498": "Jab desh hit ke bat ate hai tumhre q jalti hai.", "nik11002": "@reallyswara pehle jaan to le ye act h Kya.... Muje to ghnta bhi glt na dikha isme", "_the_parul_verma": "Did u studied maths during school...Do u know what is the meaning of homework...If no..Then kindly go and do ur homework about nrc..Becoz caa doesn't target muslims and it has no revelance with indians who r already registered citizens. Any muslim from any country can apply for indian citizenship under the existing law. Caa is only for does ppl who flew from their country becoz they were being discriminated and r already resisding in india. Plus....Find time from ur busy schedule to research. .....Hate !!!!!!", "anshikasingh7327": "Aunty Aisha q post kia", "iamhulk1985": "@reallyswara you are such a looser...", "agnivesh_yadav": "पता है हमें तो उस देशद्रोही कन्हैया कुमार के समर्थन में रैली करती है खाते यहां का है पैसे यहां कम आती है और ढोल साले विदेशियों का बजाते हो गद्दारों मर क्यों नहीं जाते तुम", "himanshuteotia7": "Didi aap rehne do aap se no ho payega.. flop actress", "kkc387": "Lafde me na pado modi ji hai nikal javongi dunya se", "vyom_meena": "@reallyswara go Pakistan", "shalini_tagore_24": "@reallyswara first go and read what it is instead of instigating hatred among people. #gawar hindi me", "shubam__22": "Randi", "yateshsaraswat": "Tu padi likhi gawar h...", "rizwanlaiq": "Awaaaaaaaaz doooooooo...... Hum ek hain", "ishita6702": "Aek hindu bhai apne hi Dukhi hindu bhai ko Desh me Basane ke khilaf CAB ka virodh kar raha he.. Dusri Or Aek muslim bhai apne ghuspethiye muslim bhai ko yhi basane k liye virodh kar rhe he... Hum hindu Ao ki ochi soch hme gulam bna ke rakhi salo sal tak Or hum vapas usi taraf ja rhe he", "amrut_may_born": "No roll back . We support CAA AND NRC.", "derya_gorken": "Yes. This doing as well as soon... Jay Hind", "deepu_9631": "#भारत \"वसुधैव कुटुंबकम\" और \"अंहिसा परमो धर्म:\" की विचारधारा रखने वाला देश है। अतः अगर किसी एक देश का बंटवारा धर्म के आधार पर हुआ है ,दुसरा देश बना है और वहाँ के #अल्पसंख्यको के संरक्षण का बिल्कुल ध्यान ना रखा जाता हो। यहाँ तक कि बांग्लादेश, पाकिस्तान और अफगानिस्तान में लगातार #अल्पसंख्यको की संख्या घटी है तो ऐसे में #CAB का आना बहुत जरूरी था।। इसके लिए मौजूदा केन्द्र सरकार को धन्यवाद।।आपलोग से आग्रह है कि #धार्मिक चश्मे की दृष्टिकोण से ना देखें।।हमारा देश #धर्म #निरपेक्षता में विश्वास रखता है। पीडितों को अपना सही अधिकार लेने दें।। #एक_भारत #श्रेष्ठ_भारत #धन्यवाद।।", "rohan_b_bhandare": "Lagta hai Bollywood kaam nahi mil raha so sad", "lost_boyjourney03": "Nikal Le pahle fursat Mai loriya😠", "sathwik_malnad": "Don't act like a maniac", "rohan.shah27": "Such a uneducated person you're!!", "instantmotivational_stories": "I support CAA-NRC.", "____vinay_sahu": "Chup madarchod", "mohd.lari.1": "#IndiaRejectCAAandNRC", "asit.anand.9": "ab wapas to nahi hoga....", "no_chill_broo": "Bhenki lodi jis chizk bare m janti nai ho toh kahebolti maderchod tereko kam log mirla kya chudwane ko jo Bangladeshi bhi chiye ishlie rakhne khojri unko", "gurjaint_singh": "@reallyswara Government going well and swara tere be gand me merchi lag rahe ha 😂😂😂😂😂", "adimaknojia": "They can’t track black money So they made all citizens stand in lines proving tht their money is white (FAILED) Now they can’t Track illegal immigrants So they want to make us all illegal first and then want us to prove we are indian ??? (Will it fail? )", "idivyxnka": "#isupportcab 🇮🇳 and you get the fuck outta here", "utpalpandey99": "Tum jake Pakistan me rahe lo.....India aur india ke Government se bhaut problem hey apko.....", "tarique_______": "Proud.. u go girl..🙌", "iqubal.jawed": "✔️RT", "abandonware01": "Madarchod lwdi hai", "amitkum14": "Randiiiii ko desh se bhagaooo", "swatirathore.in": "U rollback ur words", "parab.archana": "We support caa and nrc cause we r indians", "aakaash.rawat": "@reallyswara मुझे पता हे की तूने रिप्लाय तो करना हे नही , पर फिर भी तुझे दो सब्द दिए बिना मेरा मन भरेगा नही , निकल @#$^# पहली फुर्सत से ।।", "jaatlife01": "You are sold out to traitors", "kumbhareshubham1994": "Support CAB 🇮🇳", "rraammuukkaakkaa": "Tu hindu kis angle sai hai re @reallyswara ja apne mullo kai sath kashir mai ja. Oh ab toh waha bhi dande padenge tuje article", "abhyudayaarsha": "Wow", "ithinkfloyd": "Act to padh lo dumbfuck attention seeking bimbo", "duttsoumya8034": "Never ever", "abhishek_since1997_": "Ab tum kuch bhi karlo .... Kisi ko ghanta fark nahi padta ... Tum nafrat felate rh jaoge ... Apni satta chamkane ke liye ....", "abhijitchaudhari_": "Swara leave India", "imma1222": "NRC CAB ye sirf ek religion muslim ke khilaf nahi balki ye ek gareeb muslim ke ke khilaf paas kiya hua bill hai kyu ki inko pta hai ke gareeb ke paas koi purana documents nahi hota ..... Ye hai asli bill gareeb muslims logo ke khilaf naki sirf muslim aur Amir insaan chahe kisi bhi relegion ka ho usko koi fark nahi padta lekin gareeb ye bill ka sidha asar sirf aur sirf gareebon par hi padega", "priya_saroj727": "Jo krna h kr kuch nhi hoga😂", "divyutri13": "Hi Everyone, This Govt. is leading the country and all of us to a dangerous path and we cannot let this happen. Citizenship Amendment Bill (CAB) Will destroy the idea of India as we know. India is a Secular nation, and we cannot let down minorities in our nation. As a concerned citizen of India, my conscious doesn't allow me to remain silent and be a spectator of this destruction of our nation. And if infact the government has done this to address a refugee crisis as Amit Shah claims, then why miss out Tamil Hindus from Sri Lanka, Buddhists from Tibet, Christians from Bhutan and Gorkas from Nepal? Why single out only Muslims? Make no mistake, CAB expresses the heart and soul of the COMMUNAL AGENDA of the Hindutva rightwing, and seeks to reconstitute the republic into a theocracy. It's time we do something... We need to build a large consense of the public across political party lines to save this nation now. We need to make this as a Mass Peoples Movement beyond any political ideology or party and bring this Govt. down. This is about India... This is about this Nation. We cannot let this Govt. destroy the Idea of India and the value for which India stood for from its Independence. We need to fight for this Nation. Let's do our part. We need to take this fight to the Govt. This cannot be allowed to happen. We need to make this a national movement now. We cannot let this Govt. to destroy this nation. I have created a Group for all link minded people to join the fight against the Citizenship Amendment Bill (CAB) & NRC and make this a mass movement. Plz Help.", "raj__sharmaaa": "#swradidikijali😂😂😂", "ashish.godayal": "Why?.....how it is effecting Ms. Swara bhaskara...", "nazishabeeb": "@reallyswara ur the only one supporting now ....👍🏼👍🏼👍🏼", "whoatulpandey": "Tum congress join krle😂😂or tmbhi pakistani bhasha bolo", "param0430": "Dear Miss \"Really\" just pin pointing you the words you have used like Arbitrary, discriminatory, etc can you justify your post on the basis of bill using the word \"Minorities and Religiously persecuted\" will be considered.......... I guess you can't.... But you can try with your Half Baked Knowledge", "prachiiiiiiiiiiiiiiiiii": "She should be banned in India and she should be sent to Pakistan I think @reallyswara", "arshiyankhilji": "I always agree with swara mam", "chandrchat": "Chutiya ladki,,, such a living bitch !! you are a cancer to this society!! Go to Hell", "parekhsenki": "🖕🖕🖕🖕@reallyswara", "allabaksh_pathan": "Salute you mam....", "saiprasad_2409": "Tum agar bhartiye ho to manonge cab ko varna tum bhartiya nai ho", "ravi_dhanda_2488": "@goyalharshita sorry to mention in comment. Actually I know you", "richa_sharma1060": "Madam apni logic to bolo.. itni hi intellectual h aap kya ki forwarded poster post krke show off kr rhi hu..kaise hateful h ye to btao", "ashishchoudhary0710": "Support cab", "prathamesh_r45": "Say it in front of the hindu immigrants came from Pakistan 😏. The smile on their faces is because of the CAB and you Ms @reallyswara have no right to snatch that from them. P3ace 😊", "mahesh_tumma": "Just read the Act an amended bill and then comment or post. Don't be a congressman they are fools and making people fools with their rumours.", "leimemi": "Thanks for your support against CAB", "anshul2291": "मोटा भाई तेरी भर देगा समझी पाकिस्तानी।", "noor_ayesha3012": "🙏🏻", "deepeshsince1999": "Fuck off !!", "dhruvraj_987": "Modi modi modi👌", "vikasmsharma12": "Unfollow kro yr isko sab", "iamshakee": "#indiaagainstcab", "mr.warlock_": "Fuck off 💋🖕", "deshraj94": "ayeee.....teri jali na ...jali na sach mai teri 🔥😅😅😅", "imaheepdhing": "ये देश हमारा है हम किसी भी बाहरी को क्यो आने दे", "yogita_malik_08": "Taras aata hai in logo pe jo iske impact ko nahi samjh rahe...ruk jaao ..kabhi to tumhari aankhe bhi khulegi...well thank u swara for speaking up ...keep doing this mam...we really need people like you...", "vikas.tyagi.39794": "Congress ki ticket mil gayi kya?", "mumtaaz_hussain": "Please help Assam my fellow Indians..we are in worse condition", "nangia_vivek81": "Well said.", "miterjilen": "❤️.", "pandit_9_": "हमारे देश में जितने भी अत्तंकवादी हमले हुए वो सब तुम्हारे अब्बा उर्फ़ ग़द्दार मुसलमान है... अब तो जाना पड़ेगा बाहर...... ग़द्दारों समान समेत लो वापस जाना पड़ेगा... #CAB", "005chanchal": "🤣🤣🤣🤣🤣", "akash_tiwari____": "Madam ji acting ho nahi paa rahi kya? Haath Jod ke 🙏 vinti hai desh barbad na kare😑😑", "nimesh76": "Pagal hai kya.. yadi ja Pakistan ja kar picture kar", "azhar9027": "🔥", "_insta_fit_girls__": "why roll back Aunty why??", "moni.komal": "Bas jo v BJP kare use protest karna hai ...", "shivamkumar_5": "💝💝🙏", "ubuntomathur": "Itni tension hai ,law mai addmission lo pado samjo,tab bolo,..", "dheeraj.sharma133": "Ok i will.thanks for bringing it to my notice😂.💩💩💩🙏U r an average actor and a below average citizen.improve girl", "mohammadurooj": "👌🏻", "kananbuch": "Your post is irrelevant.. Just like half of your films.", "honey_singhp": "@reallyswara I m really happy that this bill is passed in both sabha. The problem with you guys are that you are not understanding this bill. CAB is passed so that hindus are suffering in pakistan,afganistan& bangladesh can come here. Rohingias aren’t refugees they are intruders. And think that how can people of islamic religion of these 3 countries can be tortured there bcz these 3 countries are islamic countries. Think again before posting such shits,when you dont know about.", "onlysujju42": "Tu bus ungali dal..", "valourand_justice": "Fuck off🖕🖕🖕", "madhusudhan_v_s": "😠", "jahangirkhan51115": "👌👌👌👌👏👏👏👏", "st4u79": "गद्दारों भारत छोडो", "bhaveshkp79": "Ye fir chalu ho gayi ... 😂😂😂", "tkrishnakishore": "India changing it's Constitution w.r.t. Pakistan's Constitution...👎", "rohit.bagul5": "We the people of India do hereby pledge that we committed to the value of the Constitution of India. We believe that Citizen Amendment Bill is discriminatory and violates the Constitutional Value. We do not accept the bill and if it becomes law we will boycott it execution. As per our Pledge we have right to boycott this CAB & NRC. #idontsupportcab #noCAB #noNRC - Rohit ✊🏻", "mr_mudassir_96": "@reallyswara #weareagainstcab #rejectcab #bycottnrc", "shrinathan1": "Nope", "mr.katoch_01ny": "Hutt bey laudi🖕", "rajul_b": "#NaMo", "rintinintin": "🖕", "dlibranguy": "😢", "sameernaheed": "Roll back and shove it up 😂", "nisheethsugandhi": "Totally bakwaas hain, pahle bill to samjho phir uska oppose karo...", "5721jay": "I support CAB.. Don't be stressed much stay chill Swara ji❤️", "sonalika.chauhan": "Internet shut down. Paramilitary forces taking over the state, entering houses and open firing. 3 people died. Tear gas used. Things are getting worse.", "awnyavi": "We also thinking about the cab...... Since two days😓😓😓😓😓", "dhruvsporty": "Time to unfollow this lady 🖕🖕🖕", "sunil.2949": "Twitter pe apaar safalta ke baad instagram or bhi aa gayi", "majumdar.sandeep": "Maloom kuch hai nahi bas oppose karna hai. Style hai.", "sai_jai_10": "Hi @reallyswara..I think u shud focus on ur work..rather than posting pic related to Gov or protest..u r an artist not a rebellion..we love to watch ur pics and u on screen..a simple advice from a simple fan..loads of love 💕 💕💕💕💕💕", "rowdy870000": "Ye lo.ye aa gya kunalkamraa ki speaker jaake aapnaa kaam kr fokat ka gyan mat de yahaa sb jante h tuje tu kesee", "__lonewolf3": "Rohingya loģo ka kurkura is bhadwi ko pasand hai shayad...🤣🤣", "prashantshrivastava789": "Swrara acting kar ...baki dimag mat laga...", "pradeepta_sundar_padhy": "No need to roll back ...acche se sahi se lagao ....Apne property pe koi aur haq nahi jama sakta ...apna desh apna hai ..... Or jo roll back wala gyan de rahe h pls do research about CAB", "mdsaadanwar2018": "Thanks स्वरा भास्कर", "boby9836": "CAB is right , superb", "askot5": "😂", "almas.ayesha": "Swara, wish our other bollywood actors had some guts like you", "mukherjeechirantan": "😂", "indiagreat367": "secularism word is unconstitutional, it was added few decades back. mind it", "milan_mahapatra23": "Don't see the positives out of it...Why spreading negativity ???", "sayyed.anas.8888": "Proud of you mam..... 🤟", "panditism_": "वाह अंगुली वाली मैडम", "love_in_a_fascist_era.a": "With love to you. You truly seem a responsible citizen and public figure not biased or is not bought by the power and that really makes you inspiring!! Love love!!❤️❤️", "isarveshk": "First go n study the bill properly...", "im_sanju_rayka": "Ungli karo aap accha lagta hai😂🤣", "nasheet_s": "Thanks again for speaking up @reallyswara 🙌🏽", "ambaladude": "Do you even knw what this bill means? 😂", "sandipan.gupta.12": "@reallyswara I have seen/read your tweets taking a stand against government decisions some are good some are debatable .. but in this case wat is your reason of opposing the bill", "singh.deepak9927": "Fatii or jali 😂😂😂", "love.light.ether": "The foundations of ethnic cleansing🤬🤬🤬 despicable!", "bhupi_instaoffice": "Yasss, roll it, and get it to in ur Back...🙄", "alokmisra_": "Roll back it in your a*s h**e......", "aroojgarg": "Agree we are with muslims", "raj.kamal.5076798": "Tumhare pass documents hai ki nhi ki t bhi khi se bhag ke aayi ho", "skrzun": "Indian Muslims should be smart and not fall in the trap of providing any documentation for *NRC, boycott 100% and let them call everyone illegal.* This is the only way NRC can be defeated.", "the.aman.345": "Congress join kr hi loo aap 🔇🔇", "prani1623": "🤣🤣", "iam.abhaygupta": "Jst ignore her, she is mentally ill.. jst boycott her nd her movies. Ek din me akl aa jyegi..", "nancy_sehrawat1": "Hurrrrrr😂", "aakash______singh": "Shame on you miss this is gonna be one of the best thing in our constitution so please support #indiangovernment rather than jnushits", "poeticsometimes": "आज सुबह-सुबह शांति भवन में बैठे हुए दिल में एक अजीब सी ख्वाहिश पैदा हुई कि आज मैं किसी को बोलूं #वाह_रे_गैलसप्पे...आज पुरा दिन बीत गया पर कोई एक व्यक्ति भी ऐसा नहीं मिला जिससे मैं ये बोल सकूं..!फिर मैंने अमित शाह का #CAB पर प्रवचन सुना तब जाकर ख्वाहिश पूरी हुई..!", "pranay4u": "Paisa Mila hoga bsdiwali Ko post krne ka🤣", "chinmay_sabnis": "😂😂 you are an idiot swara", "shahadat.tapadar": "Thank you @reallyswara for the support..#NoFuckingCAB", "_jug_.head_": "ek valid reason to de do....nai roll hoga", "bhaskar_rajat007": "👎", "mayurspawar545": "But why. is it doing anything to you", "bas_trivedii_bachega": "Learn history ..learn about India ...learn about people's intention ..and then learn about this bill ... Or else fuck off", "nourel82houda_": "Indians get attacked outside India by racists.. while its now officially a big racist nation itself..", "s.v.chaudhary96": "Hahahahahha 😅🤣🤣😂😂😂😂", "arkapravadhi": "Next picture kab kar rahe ho , aunty ?", "vicky.tak": "मज़ा आ गया सुलगती देख के 🤣🤣🤣🤣🤣🤣🤣🔥🔥🔥🔥", "__lsabinal__": "🙏Thank you Swara for speaking for us !", "sumitjumde": "Why?", "___afb": "👍👍👍👍", "anjal1998katiyar": "Pakistan ki citizenship le lo ...jyada sahi rahega ..", "ak_naidu88": "Aisa dhak dhak hua inko jigarwa me...", "aakashhaistar": "Auakat me Raho jyada uchalo mat akal to g.. me ghusi padi hai Yaha post Kar Rahi hai", "its_all_logic": "One fine morning, u r all nervous cos ur maid hasnt turn up.. few moments later a man rings the bell quoting \"apki bai aaj nahi ayegi, mereko bheja hai uske badle main\"... unfortunately u have neither seen that man ever nor have u been able to cross check wid ur maid bout him.. wud u still let the man inn?", "alokmeena407": "Why roll back citizen ship give me reason", "scarface_kkg": "And the irony is u all have been the ones who have been spreading discrimination and hatred. We Indians r happy with the decisions and it's always a treat to see anti national pseudo liberals like u crying at nation's progress, lol", "classic_hood_up17": "Why rollback?? Koi bhi btade koi bhi ki isme kya glt hai?", "sudixit0102": "tujhe jyada pyaar h bahar se aane wale bhgodo pr to unhi desh me jakr kyu nhi naachne lg jaati #reallyswara", "sarojm1991": "Didi aap rehene do..!", "aahil7215": "Good", "i_am_kumar_pawan": "what is your mean??", "im4hit": "✊✊✊✊ 🇮🇳vsCAB", "yogesh.bansode_yb": "Mam politicians me ana Chahiye?", "__nobi_": "Arre didi aap bhi 🤣 ye to \"CAB\" hai iske baad \"NRC\" aur aagey aagey dekhiye hota hai kya bas apka support chahiye 🤣🤣 🤣🤣 🤣🤣 🤣 aap jaiso ko khwabi pulaw khilane ke liye 🤣🤣🤣#swaradidikijali🤣", "jaindharm": "Padhe likhe gadhe hai Jo sidhe baat nhi samjte dusre Bollywood bhand ki baat bharosa karte hai", "kishunitin": "You are antinational element. You should leave India. 👎", "tapasvidixit": "Aur yahaan likhne se mota bhai maanega", "garganand": "Do You have knowledge about it or just you are forwarding this massage please make disclosure.....", "g_arav": "#swaradidikijali", "rangilaratan": "WHY ?", "physio_nabeela": "True... Love to u fr this😘", "v1jay": "Agree 👍👍", "en_dorohedoro": "Migrant crisis is a global issue now, would love to see how the future unfolds for humanity.", "bhupinderkantiwal": "👍", "123yup789": "Dard hua he bechari ko ..bolo bolo vaaa bolo", "lazy_hiddles_army": "Thank you for this. From Assam.", "hntarang": "Go request Pakistan to do the same for their Majority religion", "mechies_23": "❤️❤️❤️", "drvijayeta": "Hello madamji..U always say.. u have haters in ur social media.. coz u r worth it...", "mahipals706": "Burnol stock karlo , aage or kaam me aayega 🤣😂 tukde tukde gang ,Urf @reallyswara", "toyasiin": "Humanity will prevail, hope... Love you reallyswara...", "ebor_dann": "Kindly support the Northeast,It's burning now, Internet shut down will be soon effective from 10pm. 😑", "manishdutta4": "Shame on u", "patelnitin12": "The ayes the ayes the ayes have it bill is passed period.Ps Shut ur f*g mouth", "hot_actresses_troll": "Bc aunty", "chandrajyoti21": "Sehmat sahi baat bikul", "pri_sweety12": "Go and shift to Pakistan...your thoughts nd u r perfect for them....", "vikrant_speaks": "Incoming Bhakts with \"Stop spreading Propoganda\" \"Saale Liberandu\" comments Kyunki Dimaag toh hain hi nahi humaare paas🤷🏻‍♂️", "bansalrahul4321": "⠀⠀⠀⠀⢀⣴⠶⠿⠟⠛⠻⠛⠳⠶⣄⡀⠀⠀⠀⠀⠀ ⠀⠀⣠⣶⣿⣿⣿⣶⣖⠶⢶⣤⡀⠀⠈⢿⣆⠀⠀⠀⠀ ⢀⣴⣿⠋⠉⠉⠀⠀⠈⠉⠛⠿⢿⣷⡀⠀⠈⢷⡀⠀⠀ ⡾⠉⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢦⡀⠘⣷⡀⠀ ⣷⢰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡀⢸⡇⠀ ⢻⡜⡄⠀⢀⣀⣤⣶⣶⡄⣴⣾⣿⣛⣓⠀⠀⣧⢸⣇⠀ ⢈⣧⣧⠀⢩⠞⠿⠿⠻⠀⠘⠙⠃⠛⠛⠓⠀⣿⣻⠿⣷ ⢸⡵⣿⠀⠀⠀⠀⠀⠀⠀⠀⠠⡀⠀⠀⠀⠀⠀⢻⣇⡟ ⠘⢧⣿⡀⠀⠀⠀⠀⢧⣤⣤⣶⣗⠀⠀⠀⠀⠀⠜⣽⠁ ⠀⠈⢿⣧⠀⠀⠀⠀⣿⣿⣿⣿⣿⣀⠀⠀⠀⢠⡟⠁⠀ ⠀⠀⠀⠘⣇⠀⠀⠰⠋⠉⠙⠂⠀⠉⠀⠀⠀⣼⡅⠀⠀ ⠀⠀⠀⠀⠹⣦⡀⠀⠀⠀⠉⠉⠁⠀⠀⠀⣠⠏⢻⣤⡀ ⠀⠀⠀⠀⠀⢹⡷⢦⣄⣀⣀⣀⣀⣤⣴⡾⠃⠀⠘⡿⢶ ⠀⠀⠀⠀⠀⢨⡷⣤⡀⠈⠉⠉⢁⡴⠋⠀⠀⠀⣸⠃⠀ Good work im alive in amit shah how can you control me i have power 🔋💪", "ar.farah_": "So good to see at least a celebrity is raising voice bravely unlike other bikao celebs", "fit_jamshed": "ये दोनो जिन्ना और सावरकर का रूप ह । जो देश को 1947याद दिलाना चाह रहे ह लेकिन ऐसा होगा नहीं देश की जनता समझदार ह सिर्फ़ अन्ध्भक्तो के अलावा।।।", "amrita7572": "Unacceptable", "devenvashist": "You always post anti things, even you supported JNU students when hostel charges rise, now you doing this are u a indian or anti indian. If not an citizen then you don't have any r8 to say this. As you are public figure you should keep you thoughts your believes within you not to influence public", "video.amaze": "Our nation is ruined....Lord save our nation before it's destroyed.....", "jayshil_007": "Rohinigya ko shelter aur non-muslim refugee ko roll back!! Esa kesa chalega didi?", "mannan_khan007": "More power to you sister.", "unofficialnehru": "भारत ऐतिहासिक रूप से एक सहिष्णु देश है जो धर्मनिरपेक्षता में विश्वास करता है , अगर हम इससे अलग हो जाते है तो हमारी ऐतिहासिक स्थिति कमजोर हो जाएगी", "shanto_ns": "💜🌈", "neddstark20": "|e| ji now - \"sab changa si\""}