{"mountain__sage": "Ayesha renna ki ye jo pic upload kri hai jisse tum sb poster girl bna k rkha hai..iski backround bhi check kr lete...ye aur iska husband jb gajwa a hind aur army k aginst aur kashmiri stone pelters k liye fb pe post krte hai...tum tumhare jaise krantikari log kahan mar jate hai...go to hell", "saffron__anku840": "Sub Tukde tukde Gang wale hai Afzal premi Yakub memon ke chelel Sharam Kro doov maro khi jakar", "soumitabiswaspatra": "Shock to see being a mature brilliant actor you are supporting them. Thank you for making the impression clear.", "_harshada_pawar_": "If they are really Indian, they shouldn't really be afraid of our law. Its because they want their Sharia that they feel insecure and protest in the streets at the cost of others lives. All the unproductive people can sit for days.", "moorie___": "Shortcut to fame. When you fail as an actress. I liked your acting before joined the braindead sonam kapur gang!", "piyush26102": "ये आँचल नहीं चहरा छुपाने के लिए नकाब हैं। #wesupportCAA #wesupportNPR", "kabirchauhan865": "Unfollow her", "priojitkeisam": "Randi salli 💩💩🖕🖕", "ri_n_tu": "Aby thori Kam bhi krle", "avik772": "Azadi❤️", "the_sonu_sharma17": "Chinta na kro sbko azadi milegi...", "akshayraj0722": "Desh ki randi", "arbaz_seth": "👍👍👍👍👍👍👍👌👌👌👌✨🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🤝🤝🤝🤝🤝", "bhushan1489": "Ye congress ki randi hai suwara saali... Aazadi to sabko milegi, tere se bhi....", "royal_rajpoot_abhishek": "Chal madharchod Randi sali", "amankchauhan98": "Desh ki sari randiya ek jaga 😂😂😂😂😂", "mahen2570": "Ha.. Saty vachan..but ladkiya sahi k liye sadak per utre.publicity stunt k liye nai.. Bewkuf aurat", "aman_desi_killer": "500", "vaibhavpatil96k": "शेरणीया😂😂", "vipul_choudhri__": "Randiyo Ka Dhaba 😅😁😂😃🤣😆😄😀", "jamdar_sahil": "Tu bhi apna naam badalke mia khalifs rakhle", "bajpai_jii": "Koi hila Nahi😂😂😂", "iamrkg___": "Agar tumko CAA aur NRC se preshani hai to chli jao pakistan", "princesingh747": "Jb tmko kuch pta nhi hai bikhcodi mat kiya krooo", "sohailsiddiqui8243": "💯💯💯💯💯✔️✔️", "ajayreddy_7215": "Wah KYA acting hai wah", "khufu106": "chalo ho gaya ab baith jaiye shero ki asliyat dikh gai he sbko terrorist supporter 😂😂😂", "dbdabral": "#i_support_caa #I_boycott_swaras_movie", "shorty_niyaa": "Dekhna kahin koi ladeeda aur aysha na ho isme 🤣🤣", "_het.shah": "Tuje kuch pata hai nai,CAA is necessary,there should be no objections!", "dhiman_mukesh_one8": "Ajadi gang😂😂😂😂", "chikki1515": "There not girls there goons n terror", "akkibaby07": "Paisa desh se badh kr nahi hota", "hars_agrawal": "Koi inko dedo azadi😆😆😂 jldi dedo azadi...bharat se", "jyprkaashsaahuu": "चोर है सब के सब 5 लाख काशमरी पंडित मारा था उस समय सब मर गया था क्या", "_rakesh_8191": "Ye sb randi h apna gand marwane aayi h", "ashish.jha89": "Madharchod", "panku0007": "jihadiyo ki support krne wala bhi jihaadi/atttanki hi hota h", "king_8009_": "This girls 💃 🖕🏻👙", "srka777": "Lagi na gaand ku tere😅😅😅😅", "jasmin_s_786": "Maakichut Tere.. Tere jajse ghadar ko goli mar Deni chahiye ..tatti hai tu tati 💩💩💩💩", "sshummery_singh": "Rejections can be understable by the ppl who aren't educated. But by u celebrities this is quite not expected and because of that conditions get worst 🤷✌️", "rakeshsingh9392": "Tuu randi hai be laudi.. 😠😠", "doctoranaskhan": "Salam dil se apko", "praveen_s_sahu": "Ese actore ko unfollow kre Jo rajniti kre ..or desh KE against rhe", "rithvik_vermaaaa": "Suaro ki fauj😂", "tulsimalam2001": "Ye ladki jamiya miliya wali aatanki pravritti ko support karti he aur tu isse.. waah tu hindu ki aulad nhi he", "kanishak__sharma007": "We support CAA & NRC u go nd hve some fuck u bloody bitch have some fuck with farhan akhtar else you'll also be job less like them in Bollywood becz Nobody likes u bloody shit", "nik11002": "Chutiya aurat pehle jaan to le cab or NRC h Kya .....ye nagrikta dene ka kaanun h lene ka ni..... Or NRC Bangladeshi rohingyao ko wapas bhejne ka act h ...... Tum log Indian ho to kiu Dr rhe ho ....... Ya fir Bangladeshi ho", "the_4nupam": "@reallyswara If you are not getting films then this is a good idea! But showing your hypocrite face is not. If anyone vandalises the national property,burns it,he should be punished equally, even if it means anyone,me or you! Go, increase your knowledge, u fool and biased.. Get some sleep, rest and post these shits again... Thanks for the day! Waiting for reply...", "masumajafri110": "Jiyo !!! Full support to u guys !!! Govt sucks", "vishnusaini21_": "Tere andr bhi feminism ka kida jyda andr tk chla gya h koii na jldi hi bahar nuklega", "heso6e": "radical Islamic whores", "ms_siddiqui__": "We are with u", "gaurav2651997": "स्वरा तेरी बारात आ गयी है और ये लड़कीयां स्वागत के लिए है । अच्छा है ये लड़कीयां तेरी जैसी नही है ये भारतीय परंपरा को नहीं छोड़ा है और माथे पे आंचल रखकर तेरे शादी में आई है नाच करने", "ps.bhardwajsharma": "Vah re jaichand ki aulad.", "kiran.tayade": "Koi Nahi hilane vala swra anty bjp tum jaise logo Ka bap he", "hai.leytheone": "https://m.facebook.com/story.php?story_fbid=109666060395346&id=109348987093720", "adv_vishal_gupta": "Some university student misuse educational institution", "hameed_basumbul": "Yay! 🙌🙌 Haan swara, Long time no see you, hehe.. 😁😍😍👆👍👍👍👏👏👏💃👭❤😉 @withrepost :-) @sonamkapoor :-) @reallyswara :-) #rejectcab", "bts_euphoric": "When celebrities don't get role in films they start doing this shit and try to come in front of cameras.. I hope this helps u", "bae_chara_kamdev": "Librandu for a reason.....kaat re 50 iski overacting ka", "chetan_tiwari9148": "@neha_lall Hindi aani hi chaiye English na aaye chalega Hindustan hena to Hindi compulsory h optional nahi🙏", "mohd.lari.1": "#IndiaRejectCAAandNRC", "shailesht01": "#IndiaSupportsCAA", "abcdefghpqrstu": "Ungli Ungli Ungli", "jo_patel_": "Phele toh tere ko desh se fek dene jesa hai😑", "_vlad_tepes__": "Nobody takes you seriously, in case you're not aware about it. 😂", "shubam__22": "Teri maa da loda", "sachinjadhav1240": "Aaj Islamic desh Mai hinduyonki haalat Kya hai kabhi unkhi halat ke baare Mai sunna hai swara....Kya Islamic desho Mai Hindu hokar paida hona gunah hai", "s_darshan__": "Or inpe pthr fek rhe h unka kya", "sohil_sumra_11": "👍", "tej_ii": "Hahaha bc kuj bhi.. Movie nahi mil rahi to kuj bhi post karoagi abhi ha.. Wah revolutionary dum hai khud inke bich ja protest kar..aag laga kar kuj nahi milda kbhi", "vishhal.vermabliss": "Ye ullu ke patthe time kharab kar rahe hai , already itni population hai desh ki ab bangladesh aur pakistan ke bhi ghusa lo , jobs ki maa behen kar lo , fucking idiots", "akashghule123": "Please don't mislead the people . It will be a act to increase your popularity, but the common people are suffering . One protestor was asked why you are here \" he said people are liking the CAB so that RIKSHAW business in danger. Where were you when the PMC scam occured ? Why don't you protest for there rights ? To make a law for security of money ?", "instantmotivational_stories": "I support CAA-NRC.", "h_u_u_9": "आझादी गँग 😂😂😂😂😂😂😂", "akpanchal255": "Aur jab tum aisi gatiya Post dalti ho hamari hansi nikal jaati he.... Kasam se..... 😂😂😂😂😂😂😆😆😆😆😂😂😂😂😂😂😂", "yenkrish": "Jo next bus ye protester jalayenge na m pray krunga god se us bas m Swra tere ghar ke baithe ho", "parul1133": "Ayee chup kr na c grade ki ghatiya aurat", "welcometoatulcity": "#IsupportCAB", "abhiishek96": "Aap bas ungli karo 😂😂😂🤣", "suniljkvaishnav": "Us din bola tha kya apne jab kashmir m pandito ko raat ko bhaga diya gya tha @reallyswara", "mohit__meet__6969": "खतना करवाते समय 2 - 3 बूंद खून क्या गिरा ज़मीन पे.. कटुए कहने लगे की इस मिट्टी में हमारा खून शामिल है ,,😂 चप्पल कहां है मेरी #BHOSDIWALON", "ravibisht72618": "I want to say those people i think all muslim are illiterate if the 1947 war not through out you from this country. so how you can think at this time. Plz dont distroy this country. you are burning public transport you dont know which vechles or places you are burning .its belong to muslim also and you are beating police people and few are muslim also dont make sameless to your comunity dont create a bad view about your comunity.", "ab_ahir_11": "Swrabhaskar or swrabhonkar", "rjpt_pradeep": "#SUPPOT_CAB 👍", "prajakta__k96": "Chutiya @reallyswara", "heer_purohit_007": "Poison ant nikat hain☠️", "manishmwr10": "Tu bhi burkha phn le terrorist bn ja🤣🤣", "i_am_b.prasadh24": "Filmome kam nahi milraha", "lost_boyjourney03": "Chal chuteya😠", "baaaaaaaaaanu": "#Jai Hind", "ha_m_vhi_hu": "Keep crying", "__shubham_99_": "\"KACHRAA\"", "roushan_srivastav": "@reallyswara I think you 95 years old😂 Nya Hindustan hai😍", "2u_myself": "These girls are linked to terrorist,,she is bitch and you too,,always stade opposite to the nation,,this girl tried to protect yakub memom and he might be your hero....", "m_i_abhi": "If u think bill is against constitution then go and add a petition in SC if its then SC will disposed it..", "ashu0829": "wtf isko itni chinta hoti desh ki to bolti k ye dange fasad mat karo. ye to aur bhadka rhi hai. tujhe bhi maar k bhagana chaiye desh se. jake reh pakistan ya bangladesh me yaha kyu bhik mangti firti hai kaam k liye🤮", "r_a_h_u_l_ns": "Randipana ka agar koi aakhiri had hai to wo swara hai", "hd.shweta_94": "Inhe to afzal k liye bi bura lga tha to kya ab tum aatankwaadio ko India m laana chahte ho", "laxmisahukumkum": "Teri chut me laal salaam @reallyswara ...", "love_life_point": "Randiyo ki mandi🤣🤣", "_imsabrin_4": "Yess 🙌", "vicky_jat17": "Chutiye dare hue log 🤣🤣", "monu.dangi.927": "Madam inke slogan to sun leti inko hinduo se azadi chahiye", "animesh___22": "ISI se ₹1 bhi nahi milne wala tumko kyo bina mtlb ka desh barbad kr rhi ho aunty", "rj14you": "👏", "jaraguadom": "Don't underestimate us!...ud women are darn strong! 💪", "nri_insomniac": "Bahut din ho gaye Veerey Di Wedding dekhe hue aur wo iconic scene vi 😎", "gauravjoshi19": "Idiots—they all are pawns and nothing more, and you are a bigger idiot for spreading it. This is lame as fuck; I mean lame as you", "amrish890": "Welcome #cab", "v3_onboard": "This is called Shear randi rona 🤣🤣🤣", "srghib": "All the brother and sisters who are calling these students jihaadi and terrorists are doing a very good job I support you in this, go pass the CAA and NRC aur fir bhi lawfully kisi ek ko bhi nahi nikal paoge jitne bache waha protest krre the ya ghayal hue hain ya jaan gawayi hai wo desh ke hig ke liye lade aur mare, na ki apne aap ko bachane ke liye, khuda na kare kal ko apke upar koi esi baat padti hai tb bhi hum apke sath ese hi khade honge. Tabtak ke liye ijazat chahta hu, apki zubaan hai bolte rahiye, hum ghalat to ghalat hi sahi, haq ki ladayi hai maut tak ladenge, shanti se ladenge aman se ladenge.", "rraammuukkaakkaa": "Mullo ki pitae hui hai , indian police zindabad", "parv__20.07": "Its no more cab its caa. Fuck you.🤣🤣", "shree_borude": "जनसंख्या नियंत्रण आवश्यक है वरना \"हम चार हमारे पैंतालिस सबके *हाथों में AKसैंतालीस\" का फार्मूला चलता रहेगा 😛😂😂 👊👊गब्बर🏹🚩", "sooooooo136": "Sirf logon ko bhadkaane ka kaam hai aapko bollywood me kaam nahi hai hum samajh sakte hain😌", "niya_khatod": "हम पटाखे भी जलाए तो बदनाम हो जाते है वो ट्रैन भी जलाए तो कोई shorर नही @reallyswara", "rahul128945": "Ladkiyan sadak par utri kyu hai is bar?", "arjun_singh_rajawat_080": "Tire maa bhe soch rhe hogi kis ko peda kar diya...Tum sale वामपंथी विचारधारा rakhne walo ko to dande padne chaye..Jise tire bhai tire yaaro ke pade hai parso..Salo ko ese hi maarna chaye...sali haramini", "priyanshuuu.21": "Woh wla bhi video post kr do jisme Hinduo se azadi chahie inlogo ko...Tm jaisse chutiyo ki wajah se aissa afwaha udd rha ..", "one981091": "Uh took heart Ma’am 😢", "baduumba": "Isme me 2 terrorist sympathiser nikli 😂😂", "whoatulpandey": "#SupportCAB", "pranay4u": "Sale sab defaulter, Desh ke bojh.", "king210289": "🐷 Tu bkl", "missbornfire03": "🅱️andi 👌🤣🤣🤣🤣🤣🤣🤣🤣", "settlesubtle17": "Thankyou @reallyswara for being the voice of jamians#peaceful protestors", "bhimgradiya": "Right", "sumit_upadhyay1212": "😂😂😂😂 Bill pass b ho gya next nrc fir population control and 2022 yogi again in up 2024 modi again or tum ye hi krti rehna 😂😂", "kumbhareshubham1994": "Indian police Delhi police zindabad 🇮🇳🇮🇳🇮🇳", "as98979": "tu hukmran ko to nhi hila paegi na tera baap...jb tk is desh hum jese log h na ye hukmran kahi nhi jaega......jb tk tu hukmran nhi mera land hila le....ye tere liye asan h...", "mohdsayemofficial": "At least someone is not sleeping thquu so mch @reallyswara ma'am for raise ur voice agains this brutality.", "rajeshchilhate": "Ye 6 bachcho ki Amma hai , student nahi 😁😁😁😁😁", "parbat1510": "Don't be rat @reallyswara I think u should come out on every issues of society if u really bother about it.. Not only on those that fix ur agenda", "sanzaevicky": "Selective outrage 🖕🏼", "baabar.hussain": "@kofiannan", "rs_events143": "🤣🤣🤣galti kardi tum logo ko rakh kar yaha. Ajj pachta rahe hai hum🚩", "divyutri13": "Hi Everyone, This Govt. is leading the country and all of us to a dangerous path and we cannot let this happen. Citizenship Amendment Bill (CAB) Will destroy the idea of India as we know. India is a Secular nation, and we cannot let down minorities in our nation. As a concerned citizen of India, my conscious doesn't allow me to remain silent and be a spectator of this destruction of our nation. And if infact the government has done this to address a refugee crisis as Amit Shah claims, then why miss out Tamil Hindus from Sri Lanka, Buddhists from Tibet, Christians from Bhutan and Gorkas from Nepal? Why single out only Muslims? Make no mistake, CAB expresses the heart and soul of the COMMUNAL AGENDA of the Hindutva rightwing, and seeks to reconstitute the republic into a theocracy. It's time we do something... We need to build a large consense of the public across political party lines to save this nation now. We need to make this as a Mass Peoples Movement beyond any political ideology or party and bring this Govt. down. This is about India... This is about this Nation. We cannot let this Govt. destroy the Idea of India and the value for which India stood for from its Independence. We need to fight for this Nation. Let's do our part. We need to take this fight to the Govt. This cannot be allowed to happen. We need to make this a national movement now. We cannot let this Govt. to destroy this nation. I have created a Group for all link minded people to join the fight against the Citizenship Amendment Bill (CAB) & NRC and make this a mass movement. Plz Help.", "alia__qaiser": "👍👍👍👍", "anand.kushwaha111": "Bhen ki Lodi logo ko gumrah krne me help kr rhi hai. Shame on u. #Naxals", "dhanrajj7": "@reallyswara Kitne me sodha kia h apne jamir ka", "booraji": "Why", "anshika07": "Khaali log - free time to be part of bullshit. Kaam karne ko boldo toh free ke hostel mein free ka khaana khaakar zindagi guzaar denge haraamkhor", "ankitpandey90444": "#wesupportcab #wesupportmodi", "mr.ashu_ak": "Mujhe lgta hai tum congress ki ho", "suryavidrohi": "इंक़लाब ज़िंदाबाद🔥🔥", "vimal03": "U idiot if u r Indian than there is no worried about CAB bt u r Pakistani or else u must worried about it. So u worried about it means Pakistani.. idiot ...", "sabiarrahaman": "Jabtak rahega haji ali, khaja baba ,kay bigarega koi narendra modi.....Hum hindu musalman bhai bhai...?", "richa_sharma1060": "To Fake intellectual ms bhaskar ....Famous home ka tera prayas bahot hu khoob h ,lekin sahi jagah kiya hota to achcha tha From fake majaz", "samreen_._akhtar": "@shazia_imam ♥️ More power to you Aapi♥️", "the_religion_universe": "Lawdi peli fursat me nikal 🤣#JIHADEXPOSED #antinational", "ikkplkpl": "❤️🇮🇳🇮🇳🇮🇳", "shamaail15": "🙌", "shah.mifta": "Thank you so much . Atleast now i know some of our celebrities do have a spine. 💖", "corn_shonnery": "Middle aged unemployed JNU ‘students’ crying after losing again....how about actually paying taxes before disrupting public life and destroying public property? #cabpassed", "preetam8823": "Saalon neta giri chhodke kuch padhail likhai kar lo be", "punit3423": "आगे बढ़ो लड़कियों इससे उंगली करनी सीखो", "_the_rajput_narendra": "😂😂😂😂mulllas...", "imma1222": "Desh ki economy khatam ho raha hai aur raj kar rahi ghatiya sarkar ek religion ko target kar ke desh ko aur khokla kar rahi hai .... Jaha kuch hindu bhaiyon ko apne aas paas ke muslim bhaiyon ko jise aap jante ho aap unke bare me soche ke aap ke sath unka kaisa reletion hai fir ek baar socho ke ye bill kyu paas ho raha hai ye sirf aur sirf kali patti hai jo relegion ke naam par bandh kar desh ko bhatkaya ja raha hai", "omgwording": "Correct 💖💖", "aditi_paul": "💟", "ameena_majid": "❤️❤️❤️", "yashwanth.bhat": "Nirbhaya ko nyaay zaroor milega. Par iss desh ko ab aur Nirbhaya nahi chahie. Become Kiran Bedi. Ya Kalpana Chawla. Never a Nirbhaya. Why? Jisne saathi galat chuna jo ahem waqt mai kaam nahi aaya jisse woh rape hui aur mari waisi beti ko jab maa-baap khote hai toh garv nahi hoti...dukh hoti hai ki aaj hamari beti zinda aur khush hoti agar usne hame bataaya hota uske pyaar ke baare mai. 😊", "retickkumar1993": "Aaj bada post aa raha hai priyanka reddi wala matter pe ek v post toh nahi dekha hame Cast aur hasiat dekh k virodh karti ho esi liye ab tumhey koi film nahi milti aur na koi tumhari film dekhna pasand karta tumhare ander burai bhari hui hai", "rinkudevsar": "Kyo pitwa rhi h inko", "the_demoness_": "@reallyswara thankyou for posting this. we love u♥️", "mantu.s.1044": "There is no need to reject it and no way to take it back", "anshul2291": "Pehli fursat me desh se nikal la**i", "avirendras": "chup kr anti national", "shaann25": "#saynotocab", "chintan_ck99": "Fake feminism", "mohit.kumar2192": "@reallyswara Bollywood ki side agenda aunt. #wesupportcab", "suhailshanu": "Plzzz save the constitution guys from #bjp", "being_fiza_khan": "You are really brave woman.. You are a celebrity and you have guts to speak about social issues.. While the other celebrities don't give a damn to these issues..👌👌👌 hats off👌", "imthiaz.imthiaz.1447": "👍", "sandyranchi": "मैं चाहूंगा कि दिल्ली पुलिस के महिला सिपाहियों द्वारा इनका स्वागत अच्छे से किया जाना चाहिए", "ratansharma0094": "Muslims always love their islamic country. They have no love for india", "nikitajavkhedkar": "Superb😊🤗", "deepanshuarora117": "Why to reject cab when it is only for minorities from Muslim countries,and that to include all religion except Muslim because these were tortured in those Muslim countries like afganistan , Pakistan and Bangladesh, where majority people are Muslim and laws are in favour of Muslim ,so why we reject cab ...", "piyush____73": "Swara tumhara rohingya k baare mein kya kehna hai?", "vikassharma1311": "Kuchh chutiye bhakt insta pe bhi kya🤣", "xrandhirx": "Is ma ki laudi ko pakistab bhejo", "moni351991": "Oye tum log ahate Kon si dunyia se ho", "pooj1007": "Very True", "___mayesha_khan___": "🔥👏👏#aginstcabbill #againstnrc", "naziya.aisha": "Its good to mention girls but right now i think gender should be kept aside and focus should be more on collectivism.", "_insta_fit_girls__": "Hello Aunty how are you 🤗", "akhtarmdsarfaraz": "#rejectedcab #rejectnrc", "_iraster_": "@zoyaxbean @ayeshantcare More power to you guys! Dhyaan rakhe apna ❤️🙌", "zarishnazir": "@zoyaxbean", "___stay_at_home__": "support from Chhattisgarh 🇮🇳❤️ More power to our heroes ❤️👏🏻 Keep it going please. We are doing our best too.", "aman_kattal_": "Tera b nubr aayega kutiya ⚔️", "adeeba.naaz": "#notocab", "abhinvshaury": "Jai Hind💕💕💕", "jaun._hussain": "❤️❤️❤️", "farhinba_raj": "#rejectcab🙏", "tirelesss_soul_rahul": "Halala product ...", "ennkishore": "👏👏👏👏👏", "ilmaazim97": "❤️❤️❤️", "i.monusharma": "Abe @reallyswara teri aukat to ek tv actress se bhi kam h to tko lgta ki tujhe pm @narendramodi & @amitshahofficial jante bhi honge aur teri baato pe unka dhyan jayega bhi! 🤔🤣", "sudattajangam": "👍👍👍👍👍", "lilttle_hijabi": "Thank you so much for the support ❤❤❤", "i_ayku": "देवियों को पढ़ने लिखने बोलो", "tushar.vyas25": "🖕🖕🖕", "shilpaj76": "Shameless swara", "aruppurkayastha": "Ye kya Chutiyagiri hai", "beingrjnayabamanat": "#RejectCAB", "blissed_soul11": "For the people really cussing in the comment section Let me tell you it's more about the basic Human Rights of Assamese people. After lakhs of Bangladeshi Hindus getting citizenship will increase the competition for jobs , shelter , food , education and everything in ASSAM. The Assamese will become minority in their own land. Think like an Assamese.", "sumitupretii": "तुझे तो सड़क पर उतरने की भी जरूरत नही है, बस लेटी रह,,हिलता हुआ भी खड़ा हो जाएगा", "pandit_9_": "Sab Bangaldesh Pakistan se ayi hui aatankwadi ladiya hai.... Inki jagah pehle bhi road par thi or aaj #CAB ke baad wapas jane k tym a gya hai... #Go_back wapas jayo mere desh se..", "_md_taufiq": "Hitler giri nhi chalegi india me🔫 #weareagainstcab #jmiagainstcab", "doodle_bunny0": "❤️❤️❤️❤️❤️❤️❤️❤️", "tickle_star_098": "@reallyswara Great work u r doing #rejectcab #rejectnrc", "ayesha_hashmi01": "❤️❤️❤️", "taiba__tariq": "This is why u r My favourite... you are the only celebrity who posted this...much love and respect for you @reallyswara 💓", "aakif__": "Really appreciate it , very few actors have this quality of being instinctual ❤️ @reallyswara #cabagainstconstitution #rejectcab #standagainstcab", "jitenddrachawla": "#unfollowswara", "d_abbas_mohd": "@reallyswara MAJAZ LUCKNOWI*", "005chanchal": "🤣🤣🤣🤣🤣🤣", "singh_robinhood": "घंटा फर्क नही पड़ता समझी", "cached_bug": "Keep it up", "pintu_padhy_badrinath": "Are u fm a other nation @reallyswara", "varun_the_devil__": "🤬🤬🤬Shut up and do your useless acting", "shashi98b": "Virrey di veeding", "taniyaakarim": "This means alot", "emma099887": "❤️❤️@reallyswara thanku you so much", "abhi123tomodachi": "तुझे भारत की हर चीज़ से प्रॉब्लम हैं .. क्यूँ नाहीं बांग्ला देश चली जाती", "sam__edward": "❤️❤️❤️", "qamar_nawaaz": "Great ma'am❤️", "thegraysonofgotham": "Thanks for being a part of this with us, @reallyswara", "priyancamathur": "@roshnis_k", "mumbaikaradd": "🤦‍♂️🤦‍♂️🤦‍♂️ you don't get chance in Bollywood.... so this how you are promoting yourself ... !!.... Bas Karo aag lagana.....!!", "bagchipros": "Awesome. Long live democracy", "kavita54705470": "Teri Movie Pak Bangladesh Mein Dikha Guys Iski Movies Mat Dekho Jaane Do ek msg Bollywood me", "sadak_chaap1": "इंक़लाब ज़िंदाबाद", "ddillahabadii": "Stay strong", "an_amiable": "👏👏👏👏", "sonam_5598": "Wowwwww..💐💐", "purplefarha": "❤️❤️❤️❤️🔥🔥🔥🔥 #rejectcab", "sadiaaman6239": "You are really the strongest woman in the Bollywood,the only one who speaks against the wrong . True respect for you .keep up the good work and yes #rejectCAB#cabagainstconstitution", "gauravchaurasiya1": "Suara😂", "mah_alam": "Jamian ♥️😍👏", "vikas.shukla.714": "😍", "mishraji_ka_launda": "Thanks batane ke lie 😌 miss swara fatima 🙏🙏", "akshaybashi": "@reallyswara Problem is not CAB.. The main problem is people like you in India, people against cab are those who is against constitution. CAB is not against constitution!", "rahulbharawa": "Jo is desh ka h hi nhi. To us k liye Kyo jaln ho rahi h. Swara madam. Minority Jo h unka well come Hai.. our know kashmiri hinduo ka socho apne ghr see bhagaye gye the. Tab to nhi bola kisi ne. Aaj Rahul Gandhi ne. Jo statement Diya h. Us par bhi bolo. Kab tak paid pramotion kroge.", "royalistic_s": "Today's left are only proislamic and anti hindu", "imsharad007": "कभी देश के लिए भी सोच लो। जिस देश का खा रही हो उसके बारे में भी सोचो ज़रा", "the_musicophilic": "Inquilab❤️❤️❤️", "sdarshan": "Tu harami thi aur harami rahegi", "hada__virat_7": "टुकड़े टुकड़े गैंग का राम नाम सत्य होकर ही रहेगा।।", "siddiqui_0522": "🙏", "_jug_.head_": "shame on u lady....tht bill is passed by temple of democracy...u guys always say tht constitution is not safe in this gov....u guys r tearing tht bill...is tht constitutional...? dogle insan", "dhruvraj_987": "Modi modi modi modi💥", "5hubham_k": "Cheap publicity stunt", "patelnitin12": "Ur non relevant moron so no one give shit about ur 'Love Jihad'", "d_drug_07": "I feel obliged to see celebrity like you are rasing their voices,no matter how much hatred they have to face out...!!!! Thank you @reallyswara ❤️❤️❤️❤️❤️", "valourand_justice": "Have your parents and grandparents ever been a victim of partition?? Do you know what it feels fleeing a land infested by Jihadi extremists among pain, anguish, terror, threat??? My grandparents hv gone through this in 1947 when they came to India!! So keep your liberal ball talks and CAB is inhuman crap to yourself...we give a f#$%", "shahmiteshj": "How is CAB detrimental to current Indian Population immaterial of the religion @reallyswara ! Request you to please explain for larger audience.", "deepikabagga700": "You should be ashamed of yourself..you are promoting all this", "turntheleaf_": "Woo wooo jamiaaaa🔥😍", "hashmat.niya": "PICTURE CREDITS. @srknahts_ @shakeeb_kpa", "ssidagrwl": "Heights of unemployment @reallyswara . Pls lick the ass of any director to get some work 😂", "prashants33": "@reallyswara sali panoti chatu sonam ki jiske liye relly ki wo ghar pe beth gaye bc mc kamini sali unpadh phle samj le bill kya h phir likha kuttiya. Mc tukde gang member,ab hmari rally niklegi tre chote ghar tak bikari sali", "iamzafar85": "🔥🔥🔥🔥", "nasheet_s": "#Jamia zindaabaad #notocab", "atultiwari.raj20": "Ese hijab khte hai aachal to kupratha hai secular swra😂", "armaan.singh.31586": "Iinko Jail mai daal kr constitution Padhana chaiye 🤣😂🤣", "manish_singh_kshatriya_": "मेरा भी हिल रहा है समझाओ ना प्लीज ।", "noor_ayesha3012": "♥️", "being_zaina13": "Thank you so much @reallyswara", "loadingwaitt": "@bhaagi_hui_ladki that's youuuu", "vishwajeet_mishra": "Cabiswithinconstitution😎", "___r.o.h.a.n___": "#rejectcab", "iimkrishnasingh": "Bloody terrorist.. kuch nahi hoga... Chilate raho", "mp.favaz": "@shakeeb_kpa 🔥", "marwari_chokro": "😂😂😂😂", "car__guy__": "#IndiaSuppeortsCAB 🔥🔥🔥🔥", "arko_1898": "🔥🔥🔥", "fazmi88": "Jamia Millia Islamia", "the_rana_s_": "Fatuuu", "iamshakee": "💞💞 #indiarejectscab", "vitocorleonnne": "Leftist idiots ... you’re the biggest troll Swara. Couldn’t succeed as an actress, so now after cheap publicity by unjust criticism of govt. Grow up! #loser", "munazir__sayyed": "👏", "sudixit0102": "#reallyswara विरोध तो ऐसे कर रही है वामपंथी कौम की नाजायज औलादे जैसे इनके 8/10 खसम उधर रह गए हो और उनको आने नही दे रहे ।।", "alishba_nawaz_khan": "Thank you so much ma'am for supporting us students 💪🏻", "somnath___nayek": "🖕🖕🖕🖕🖕🖕", "is.saurabh": "More power to the people...🌸❤️", "gaba2445": "👎👎👎👎👎👎👎👎", "moonisshadani": "👍", "rihan___hussain": "❤️❤️❤️👌", "nomu_z": "We r jamians! We can do anything! Thnkuh for this post @reallyswara and support us #jamia #jamiarejectcab #support_jamian♥️♥️♥️", "jassie_0905": "Hope the protests spread all over the country", "yasingaziyani": "@reallyswara you are such a inspiration person i ever know.....big big big fan of yours...", "pratik_ghodmore": "Mughalo ke samay CAB hona chahiye tha.😂😂", "ezbekah": "We cannot allow India to become an open air jail and a concentration camp! EVERY Indian MUST reject CAB and NRC!", "suxena__world": "Sirf Muslim k liye bolti ho aap", "fredi.rebello": "❤️❤️", "satnampreetchauhan": "Swara for PM.. I mean it. ❤️❤️❤️", "krishnakantpal": "Pak..s", "meharbandazz": "Photo by @shakeeb_kpa ❤️👏", "m.k.suthar15": "👌👌", "nirmalbramhecha": "❤️❤️❤️👌👌👌", "deepeshsince1999": "Why the fuck you have problem? With CAB !!?", "mitradebasree": "❤️❤️❤️❤️❤️❤️", "bosegovind": "Jab 1 ladki ka rape hua tha tab tu Aap kha gayi thi tab to aapne kuch post nhi kiya @ reallyswara", "andybuddy02": "Desh virodhi..", "iammahesh10": "😂😂😂😂😂😂😂", "mr_mudassir_96": "#jamiaagainstcab #bycottcab", "sahilkazmi24": "#RejectCAB", "arsh.photos": "Please give credits to the photographers 🙏🏻🙏🏻 @srknahts and @shakeeb_kpa", "kamranitin": "🐷", "aadking": "Hey swara I'm unfollow other Bollywood stars except you because you are speak up against bill #rejectcab", "jaindharm": "Padhe likhe gadhe hai ye sab Jo kuch bekar student ke chakkar me aa gye sahi Kya hai inko Matlab nhi media aana hai moj masti karni hai deshvirodhi baat jaha swara waha", "gohar.aysha": "@bhaagi_hui_ladki Laal Salam Saathi! So proud! 💓", "tkrishnakishore": "✊", "the_sleepy_nerd": "Is it you in the 6th picture @sumedha_poddar ?? 😄", "dalitdesk": "नागरिकता संशोधन बिल वापस लिया जाए। क्यूंकि ये देश संविधान से चलेगा और ये बिल गैर संविधानिक है।", "mohitkkurmi": "Pakka isse #congress walon ne ticket ka wada kiya h....kyonki film toh mil nhi rhi h...", "surya_abhishek_": "@reallyswara ...Tum jesi actress ki wajah se desh barbaad ho raha hai...Tumko pakistan chale jana chahiye...#deshdrohi", "raviranjan_28": "Jab panoti jnu ke saath hai too unka kuch ni ho sakta😀😀 ...jnu wale pray krte honge ki plz aunty humlog ka sath na de 😂😂😂😂😂😂😂", "karan.gupta.9279": "Badi hamdardi h jnu se....", "arnav1120": "Mam if you want to come in politics try another way but don't miss lead the people", "the.aman.345": "Bhag yha se", "ajay.arora.9700": "Foolish actress.", "vaibhavsharma88688": "You idiot", "its_pritam45": "Found some illiterate on the comment box looks like bhakt😁😁", "diary_of_jamian": "Thank you so much @reallyswara for posting our protest", "error420_hacked_acc": "👏👏👏#azadi", "ajayverma2191": "fantastic", "_iamshikhar": "लेकिन उतरेगी तब न अभी तो सब टिकटोक मे व्यस्त रहती है ।", "singh.deepak9927": "Swara bas kar 😂😂😂", "citizen_92": "#NoToCAB", "thethirdeye_0": "❤️❤️❤️❤️", "aakashhaistar": "ISS se Kuch Nahi Milne wala tum leftist ne iss desh ko Barbad Kar Diya hai", "sabi_chy": "Thanks on behalf of the people of Assam for opposing CAB!! Right now in Assam,the internet services are suspended and curfew is on for time indefinite!!", "swmahabir": "❤️😍👏", "rahiljain_": "Chutyagjri karenge din bhar or fir bolenge job nhi mil rhi h", "jvishwajeetkumar": "ye to jnu ki ladkiyan lag rhi h ...swra", "hritik.saxena.77": "हुकमरान ko deshbhakt logon ka saath hai , in jaise apni rajneeti chamkane wale logon ke mansube kamyaab nahi ho payenge @reallyswara ...... Ye jaan lo", "_abhi__photography__": "#oppose_CAB 👌 #लाल_सलाम 💪💪", "boudhvijay12": "Cab against Constitution", "chaahatvij": "@nuppur_rathhore", "bittuhtz": "Actually it's \"Jaichand\" like u who is against the constitution......and u know what....i bet that u haven't seen even half an hour debate of the parliament...... Aata jata kuch nahi....Lekin muh farna hai har jagah. Chutiye actor.......chutiye......bol!", "nausheen_naz": "Ye bill wapas ni lenge . Kutto ki sarkar.", "thesumitcr7": "Jai shree ram❤️", "iam_s0nu": "Inko koi de kyon nhi deta kaan ke niche azadi", "kaab.7": "@reallyswara FOR Assam NRC it took 6 years , 52000 employees and around some 1220 crores rupees. And they rejected it bcuz in 16 lack citizens rejected only 2 lacks were muslims and other minorities.😂😂😂😂 And guess these guys want an NRC all over the country😂😂😂 lets leave our work and help the government. Hopw till the NDA survives ( say for 40 years). 😂😂😂😂 (No offence) (source - ndtv, firstpost, economics times.)", "raj.kamal.5076798": "Now go and sit", "jhoney_dubey": "Azadi muh me chahiye ya gand me deta hu me inko azadi", "anandraj7631": "💗💗💗💗💗", "its_mee_prashant_choudhary": "Bakvas h. Ye sab... Aap sab logo ko kisine pese deakr ye sab krva raha h koi na koi... Varna koi itna pagal kese ho skta h... 😂", "ghum101": "#rejectcab", "anand.mish_": "😀😂😂", "neha_lall": "Yo I don’t really comment on celebrity posts, but certsin comments I’m reading about Swara are beyond hurtful and offensive...those ppl gotta chill bruh...there’s something called respect which those certain ppl don’t have...we’re all entitled to our own opinions, but it doesn’t mean you belittle or downgrade someone else for it. Swara is encouraging those girls to continue fighting, which is such a good thing she’s doing, so idu what makes certain ppl triggered and saying hurtful shit towards her...I’m not defending her, but just pointing out how disrespectful y’all can be when it’s not necessary. Speak up when someone or something’s wrong ofc, but this isn’t wrong at all", "salmay786": "👌👌👌👌👌👌👌👌", "im_amerkhan": "❤️❤️❤️❤️💐💐💐💐😍😍", "amoldev111": "😂😂😂😂", "aniket_mishra.am": "@reallyswara pls be a little sensible and sensitive. Do you even know what this bill is all about? It's about giving citizenship to those minorities of our neighbouring countries which have Islam as their national relegion, isn't it a joke saying, Muslims had been prosecuted there due to their relegion and came here because of atrocities. It's my humble request, pls don't do all this just for sake of opposing government.", "dhananjaychourasiya": "You have my support and ❤️", "hassankhan41828": "Aap sab Ki Maa Ki Choot", "neeraj.shreevas": "Hypocrisy at best..", "naveenbhavadasan": "#fuckrss", "yuvrajsinh_b": "😂😂 @reallyswara jl rhi he ?", "swastikbanerj": "Jai Shree Ram", "virdajaved": "😍😍❤️❤️❤️ 🔥🔥", "shanu690": "Halla bol 🔥🔥🔥🔥@reallyswara 🔥", "mohammedfaisal164": "Hi good morning", "maahi_rt": "Koi na hila na hilaya.. all Effort gone on vain..", "dandelioness____": "❤️❤️❤️🔥🔥🙌🙌🙌", "emm1415": "❤️👏🏼👏🏼", "shubham.kr07": "Kasab bhi inka hai, sardar b inka hai... Ye jhooth ko sach likh denge...kyuki akhbaar bhi inka hai... Arey is desh ke fariyaadi agar jaayen to jaaaye kha... Sarkaaar bhi inki hai... Darbaaar bhi inka hai. - Ek deshbhakt", "musafir__74": "#proud❤️ wrna bollywood me aadmi to bht hain.. Lekin zinda insan nh h koii.... 🖤 @reallyswara", "_kamranseven": "Thts my Jamia for you, btw huge respect for you to not become the likes of Khans and other bigoted celebrities , you always speak openly and vihimently and we admire for that.", "sufisoul.__": "Fuckoff #Amitshah", "pratikgaikwad646": "Bill pass bhi hua", "saddam5143": "Thank you support ke liye mam♥️", "bhaagi_hui_ladki": "❤️❤️❤️❤️❤️❤️❤️❤️", "the_khan_u_want": "❤️", "aryan24n7": "#jamia #jamiamilliaislamia", "subuhi_786": "🌹@reallyswara 🙏💕"}