{"hai.leytheone": "Bitches like you 😂", "saqibsheikh6786": "Yahi hai modi ka digital india", "believe.that09": "💪💪💪💪 Eh ta trailer hai. Bhen. 😂😂😂😂", "raghuveerdattu": "Those students can afford 20k to 1lakh on the mobile-phone, and they can’t afford a 300 RS rent per month. This shows everything.", "uttamsingh3399": "Police is only doing their duties nothing else .....", "chandrima_tina_97": "@reallyswara tumhara Randi Rona kb bnd hoga?", "pruthviraj_padhiyar": "😂😂😂😂😂😂👍", "imshivanitanwar": "Proud of Delhi police🇮🇳💪", "vandana_bhatt.14.26": "Well done Delhi Police👮....", "saqib061": "delhi police shame shame 😒😒😒", "yahya_patelll": "Animal better then Indian police 👮‍♀️ no respect ✊ because most of idiot people in power that’s why", "abbasmirza3579": "याद रखियेगा आज लोकसभा में NRC ना लाने की बात की गई है जबकि NPR लागू हो चुका है सरकार ने ख़ुद कहा है NPR ही NRC का आधार है No NPR", "sudhakarsingh_": "well done delhi police 👍🏻", "mehdirazv": "No NRC no CAA no BJP srkar BJP srkar murdabad", "rahulthakur0495": "Delhi police u r lub 😍🔥", "utkarsh_vedi": "Deke rahenge aazadi thook ke denge azadi 💪💪💪", "rahulbarman1765": "Sabas delhi police... Sale desh k against bolne hain apne bap k paiso pe padai kar... Muft khori ki adat ho gayi hain... Jinke family status acha hain unke fees jarur barhane chahiye", "i_am_sbm": "Jay Ho Delhi police🙏", "amankchauhan98": "🤣🤣", "yogendra_14": "😂😂😂😂😂😂", "angrishnitin": "Hahah soo smart soo smart ... how smartly dey tried to make police bad 🤣🤣 khud peeche khade hogye aur ldkiyo ko age khada krdia taki humare tk ane se phele police ldkiyo ko hattaegi n if police will do dis dn stupid people like @reallyswara will post it on her page n it automatically hit on people brains ki police is bad wow 🤦🏽‍♂️🤦🏽‍♂️🤦🏽‍♂️ soo dumb soo dumb ... itna neeche girr chuke ho khud ko b dkh leti ho sheeshe m 🤦", "terababu92": "Madarchod hamare purkho ne jan di thi or abi ke log Tax de rahe hai or tum madarchodo dange kar rahe ho tumari maka bhosda", "shaggydazz": "Please do it for rest of universities also,other poor students also crave for your support.@reallyswara", "shubam__22": "Fuddu saali swara", "pearl786756": "Free me khane ki aadat he jnu walo ko", "ashwanikr92": "😆😆😆😆😆 haa bhosdivaali Randi @reallyswara ₹=300 Tera baap baheraga madharchood vhaa 9 saal rukk ka karte Ho bahenchood", "pandey.pooja680": "@ashwanibond007 hutt pagal kaha se bhag k yaha aaya..", "nagurpratik": "Thanks to Delhi police these so called 'students' can pay for cigarettes and all other stuff but can't pay for hostel fees and education, why should other taxpayers should pay for these who say anti- national slogans?", "krishna_sinh_rajput_": "Swara Bhaskar naam badal lo hindu naam par Kalank hai tu. Naam badal fit virod kar", "shrimaan_shaktiraaj": "ढपली वाले ढपली बजा...", "hritik123a": "Any protest goes to india gate...ramlila maidan....here jnu wants to go parliament why......who goes to patliament for protest....politicians", "rj14you": "Selling education to fill pockets 🙌. I hate this decision. Worst Goverance", "khatri_1004": "Afzal guru k nare lage te tumahare garaib students.. Danda to padega hi .sab free fund me chaiye inko", "hardik_vadgama": "Take a Education Loan.", "satyawati_khabari_": "mja sa aagya 😂", "putts1986": "Haha.. yeah they are so gareeb..bichare students can afford iphone and ipads but not hike in the fees.. so bad. Desh ka khake namak harami karte hai..bilkul tumhari tarah", "iamtherealjordi": "😂😂😂", "pradeepta_sundar_padhy": "10000 mahina ladki or daru par kharch kar sakte h par apne padhai par nahi ...e ka baat h 🤣🤣🤣 sala koi ek student h in me jo ki apna jindegi sudhara ho ....sab chutiya h .....bharat ko badnaam karo yahi inka agenda hai ....its clear no one can justify ....PADHO BHAI AUR BEHNO PADHO INDIA NEED NEXT A.P.J ABDUL KALAM NOT AFZAL GURU .", "adiyogi_ajay": "Are sare boddhe he waha...hakal do sale free ka kha rahe he", "di_marik_owns_no_slr": "Bravo Delhi Police.", "priyanka_pratik_panhale": "Stop showing fake fr the students abd country..u do nthng fr the country so keep ur mouth shut", "monu_khapra": "Ache se dhulai kro sbhi deshdrohiyo ki.. Jo ye aisi poste dalte h..", "abhimanyus_08": "swara , u r really sick", "s_h_a_s_h_i_k_a_n_t_": "Gand pe dande maro salo k .Akal aa jayegi chutiyo ko🤬🤬🤬🤬", "im_jd16": "Hahahahajaha dhulay abhi baki hai mere dost 😂😂😂😂", "jaidev_happy": "Shut up ur diarrhea talk JNU should be close.", "boring_since95": "Go to the ground ...& Know the reality then post on Instagram miss Bhaskar @reallyswara", "rohanchauhan5884": "Shit on you", "shuvu_jaiswal": "@shuklaprity1902", "trustyfriend46": "Thanks for sharing", "shubh__49": "SHAME ON You JNU 🚫", "_iampraveenrajput_": "*FUCK JNU*", "shikharsinha091": "Congress supporter good for u 🙏", "nshi_i": "Why are they not studying - if they are students especially if they come from an economically weaker section of society? Why are they not afraid to miss out on their syllabus? I would be shit scared to miss out on my lecture", "rrawat28": "😂😂😂😂 mast maar lagayiii", "rohitluwangluwang": "This is new India according present self glorify government 😢😢😂😂", "rambhdra": "Aur ghasito salo ko 😂😂😂 student anabel to pay 300 rupees 😂😂 itane ke to ye raj daru pihate honge", "hemantrawat14": "10 rs se mere 300 rs per month, that too relieve for BPL students, it a dukha hai to jao paise de do inhe.", "parshantsharma": "Maro salo ko", "saheel.faldesai": "Already they have good education with less fees , where some universities (won’t mention them) have worst quality education and freaking semester charges up to Rs.70k !", "kumar_ikshwaku": "Matlab pure India mein Sirf JNU hi higher education deta hai, Baki toh koi jagah hai hi Nahi...saare garden bacche yahan aate Hain...please check the JNU rule book...hostel fee is waivered off for SC/st and economically impoverished students...onto what basis are they fighting? Just propaganda...", "u_mehul_k": "Aunty ko hawa nhi hai...", "sandip4275": "Bharat mata ki jay jnu gaadr he", "shubhamchauhan00": "10 +600% = 60 great 👍", "kanavdevsingh": "Aunty is back with a bang...Are you buyiny them iphones, ipads that they cannot afford too?", "sparshism_24": "kash apko bhi police aise hi jail me band kare", "deejaypatel": "News alert: swara bhasker will pay for those 43% students.", "pradumnyadav21": "Salon ko juton se maro", "horkoilas": "Why are they kidnapping random guys? 😳", "im.gautambhalla": "Swara Bhaskar is a Propaganda Expert... Professional Anti Indian✌🏻", "himspatel": "He he he", "____p_a_v_a_n_____": "College hai ya political party 🤣", "raz_laxmee": "Thank you swara for using your position of power for something so important. As long as we have a voice, we will retaliate and continue to demand our rights. Education is not a luxury for few.", "sharmaprianka": "Basically bitcha is not opening her shitty mouth by giving the exact nod. The current fee is 10 rs per month which is increased to 300 rs .. nd by the way most of elderly student are living there since years and trying to reach to NASA.", "starvsv": "#JNU ka name aise he kharab h mat pado aise lafede me #no1support", "akanshamehr": "Put a criteria of the hike not valid on students of sebc group.", "prajjwalsinghsolanki_": "aye tu apna kaam kr na", "wopatlasaladka": "Okay the figure looks huge when you convert into percentage. But what that figure is in real? ₹300? Go inside JNU and look what they have done to the university walls? The office? The classrooms and the statue of Swami Vivekanand? Ironically those who have expensive phones, internet and what not are protesting for this fee hike. This is completely a loser take on the hike. If the fee is being hiked, there is a reason to that. A taxpayer is paying money for every goddamn thing the Government does. Nobody will be affected. Yes there are genuine students who actually can not afford the hiked fee but it doesn’t have to come out like this! A graduation student who stays in JNU hostel can easily earn a minimum of &5000 by providing tuitions only. I have also done that. This completely shows the lack of boost and confidence the students have upon themselves. Simultaneously, these protestors are affecting the sentiments of other students who are having to miss their classes because of them. Students of other centrally funded universities are outraging upon such gesture of the JNU students, look around you, look on the internet, go through honest Quora answers and see how these protests are actually affecting the way people look at JNU. “Education doesn’t have a price, it has a value” said some of the banners held during the protests, and I so disagree to that. Everything in this word comes for a price. And youngster like me can not always be in their Comfort zones. Put 2 hours a day into something, home tuition or something else, I bet, nobody will be taking less than ₹6000 per month with that. This is the tired mentality that we do not need to work hard, if all that comes for free! I am embarrassed!", "jayprakashojha": "😂😂😂😂its fun", "mr._shukla._98": "@reallyswara q didi mtech fee hike m to tumhe right to education or education should be subsidized jaise batein nahi dikhi... Aur idhar 600% bata rahi ho.... Itna double standard laati kahan se ho ya fir iske liye bhi advance payment milti h", "dikshup": "Drama!!!", "likurock95": "Sala 300 rupees nahi de sakte.... Magar Apple iPhone me selfies lete ho...... BC", "itsmanishsirohi": "Maro kutto ko..", "jaat420sachin": "😂😂😂😂😂👏👏", "mr_kayy_25": "Inke liye hamdardi Jo is desh ke dushmano ka samarthan karte hai , aatankwadiyo ko aazad karne ki baat karte hai , Bharat ke virudh naare lagate hai ... Arrey kuch to sharm karo kalakaar ho kar bhi sahi galat mein fark Na kar payi.", "mr_ishaan_000": "फिल्मों में अभिनय अच्छा है आपका किन्तु आपके जीवन का अभिनय और आपकी विचार धारा 🇮🇳बेहद शर्मनाक🇮🇳 है, जिस देश का🇮🇳 खा🇮🇳 रहे हों उसी से गद्दारी बेहद शर्मनाक, अभी भी समय है सुधर जाए,.........वरना अपने देश में आप जैसे 🇮🇳एन्टी-भारत🇮🇳 लोगो की 🇮🇳लुटिया🇮🇳 डूबना तय है........!!! धन्यवाद .........!!! बाकी समझदार को मेरा इशारा ही बहुत है 🙏🙏🙏", "pathantalha143": "Vakil-o-se pitne waale aaj mazlum-o-pe zulm kar re.", "ahana6106": "Oh my god this is the way students are treated by police such a shame", "nagarajp777": "😂😂😂😂😂😂😂", "ghoshsrimanta": "Hello aunty😍😍jai ho🇮🇳🇮🇳🇮🇳🇮🇳", "ankitachinmayamohanty": "@reallyswara do u really think the hiked fees was to much? Don't see the hiked % see the exact amount that is being charged n i dont think it's too much. I think jnu has been given enjoying unwanted previlage from the government or should i say we tax bearers money. If jnu students can pay for flight tickets n road show for building their political career i think they can pay for their education like normal middle-class families does.", "naina_misra": "Let us be a fan of your acting, i’d urge you to stop posting content with half knowledge. You are a public figure, you should take the opportunity to stand with the nation and not create unnecessary ruckus and misunderstanding", "sparshgandhi17": "Didi plz focus on your career this will not help you now", "abhishek.malhotra.9847": "#JNU fee hike #IIT fee hike this government thinking \"RAJA KA BETA HI RAJA BANEGA\" all student need to unite", "gauravattri_": "Madam.. the workers working in JNU on contracr basis aren’t even getting there salary coz JNU is unable to pay them. Have you imagine how they’re working without getting paid ?? Just sittng in a Car or in a AC room and supporting things by not even thinking of other side.. 🙏🏼🙏🏼 CAN YOU WORK FOR YEARS WITHOUT GETTING YOUR MONEY ?? @reallyswara", "rebounder011__": "@reallyswara first go and learn real facts n then play this publicity stunt post , madam aap acting pr he focus karo n bakwaas karne se pehle full facts knowledge n articles padh kr aao, n if u really wants to get publicity then try some new stunts.", "apurvroy": "Get your facts straight. Check the fees that these students have been paying for academics and hostel for the past four decades. The university is under by crores and is unable to pay for existing staff because of the decades old fees that is still applicable. Also, there are provisions for students below poverty line to pay half the amount of the proposed new fees. The kind of activism going on at JNU is not good.", "shaikhazhar249": "Ye sarkar nikammi hai😢", "yashkatara7": "ache din aae gye hain...mitron..abhi or ache aane baki hain...", "perwezsh": "Aisi zabardasti sirf Hitler sarkar mein ho sakti hai.", "shamimzhcdu": "This is very sad that govt is against higher education..... request to the govt plz don't distroy the JNU....we stand with JNU...", "myur8910": "Right swaraji", "alitusso": "The country where caws have more values than ladies 😢", "k_harshit30": "The ammount they pay for their education is equal to their daily expenditure on cigarettes and other stuff", "digvijay_singh23": "😅😅😅", "love_boy_prem_agrahari": "Maaro sale deshdorhi students ko", "sharad6243": "Kyu galiya khane ka kaam karti ho ??", "syedtaufiqrahman": "Shame shame", "yuvraj_singhaa": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "hariom3203": "Aunty ye kya daal di", "qrussomusic": "Why are some people so butt-hurt on JNU’s low fees ? Bitch i bet if you were smart enough to get in there your dads balls would have been proud. But u are a broke andhbhakt bitch. If i was running the country i’d be proud that i got world class institutes running with such low fees. Do you even know there a places where education is free and needless to say those countries are doing way better than this one ! WAAAAAYYYYYYYY better", "mayanksaini1102": "❤️", "anushav1905": "Please help me in raising funds for my dad treatment.He is fighting from liver cirrhosis (non alcoholic Auto Immune). Liver transplantation is required. Link in bio. Pls support and share to send some donations for treatment. Please Even a small amount Will help Please share🙏🙏", "aficionado_funambulist_shiv": "Maro saloo ko", "swapnil.k.singh": "ठोको सालो को और उधम मचाए तो। नक्सल फैक्ट्री बना रखा है वामियो ने जेएनयू को", "saffron__anku840": "Bhagwa hi Lehraya tha Bhagwa hi Lehrayega Swara tu Vampanthi kutti hai mullo ki nazayaz aulad hai yeh wo JNU hai Jha se terrorist niklte hai", "prashu_shukl_": "Are wahh madam aap bhi jnu ki den hain... Aapne saste me padh k kon si desh ki arth vyavastha sudhar di", "flexing_biebs": "Like really stfu!!! These are the students who speak ill about our country. Just dont support their drama. Fuk JNU", "iamgauravpathak": "300 rs is just a fee, they are using branded phones and everything. They are just wasting our tax. @reallyswara You are a dumbass don't know what to say what kind of a person you are. Just posting things which is one side and always try to spread violence from your post.", "shivamsharmaxyz": "👌🏻👌🏻 300 RS what a hike 🎉", "_brokenyoungs": "Fuckin shame , only for publicity you demolished our country. illiterate talks, fake feminism that's what you do ,you need some psychiatrist bitch . @reallyswara", "imrahulman": "And for your kind information Protests are done by many ways but this dosnt seams like a protest", "k_e_t_a_n_7080": "Revised hostel charges for JNU students are Rs 3,600 per annum (for students from below-poverty-line families, the revised annual charges are Rs 1,800). In IIT Bombay and Delhi, annual hostel charges are Rs 20,000 and Rs 15,000 per student,", "avinash_kumar_raja_007": "Great Police ....good job Kick out lal slaam Fuckers", "prash_theadrenalinerush": "Not only JNU. Other institutions as well. It’s just that people don’t speak up. There must be a regulatory body for these things(hike).", "fir.aag": "Most of them are shitting there...sorry' sitting there are just to look cool...jawan khoon h...josh toh jagega hein..", "__akashii__": "Education should be subsidized.not only JNU but everywhere.", "suchismitar": "It’s so sad to see ppl focusing on only 10 to 300. If u compare JNU with IIT it’s not correct yet. There is a difference between professional and non professional course. JNU is utterly basic courses. And this fee hike is for all universities and only one protesting.", "thefreefolksofmiraroad": "Police barabar hi kar rahi hai", "mannu_keshav": "@deepthi_ys scene bohad kharab h India ka", "samir_hu_mein": "I m very sad delhi police was less brutal at that time.... Why delhi police not open fire on them....", "raghuveer_2018": "#ShutdownJNU we don't want more anti national people.", "rachnafaha": "🤣🤣🤣", "kpawan_k": "Dil khush ho gaya in mc ko police uthate hue dekh 🤣🤣🤣😂👏👏👏👏👏🎂🎂🎂🎂", "paragbatra30": "JNU people are fucking assholes and biggest losers.... The best example is you @reallyswara .....", "altderu": "Shame on our country. At times like this those with a voice who remain silent are the worst.", "ankit_2204": "JNU has all the problem in the world.. 😂", "khushiajaz": "Thanks for sharing this video 🙏 or Bakiyon ke liye chaar line......जो लोग चिन्मयानंद, कुलदीप, आसाराम और राम रहीम पर चुप थे.. वे आज JNU में भारतीय संस्कृति की बात कर रहे हैं..!! #StandWithJNU", "its__bky__": "Good job.... Police ❤️😂😂", "aakash_musical": "Actors k post pe comments jyada aane pe unko paise milta h kya (other the#jnu lagane pe marketing milegi) 🤔 just trying to understand the reason of this nuisance.", "nitishyadav2186": "Good job Madam", "mohit_krr": "I should immediately unfollow you madam... What nonsense are you promoting!!", "soumyaguptamusic": "Report this Bi**h guys! Isko hatao insta se", "rkgautam19": "Jor ka jhatka lag raha hai 🙂", "kalpeshbedmutha": "@reallyswara instead of posting here go and stand with them.", "gaganshrivastava786": "Respect", "sanjit789": "Tu pay krde fee???", "shikha.aayush": "Mere beta ke fee bhi badhe gai hai ab aap bolo inka kya hai protest k naam per danga", "rakeshm007": "Waah re gundagardi. Dangali hooligans rioting and blockading the normal functioning of an educational institution. Aur aap leftist maataji isko peaceful protesr bol rahi ho. Bakchod", "ilanos2017": "😡", "rajlove97": "Mat maro in bujurgo ko, kaha kaha jayenge ye log😢", "ravi_rao_06": "Close this institute for at least 2 years and clear all these tukde tukde gang", "prasad_palli": "https://youtu.be/bprPOSvkuMI", "shaninamdar": "Unfortunately everybody wants everything free under the name of reservation or any other reason...we are makingnoirselves handicap..", "asif2you": "Education is our RIGHT it must be FREE...they want to use educational institution as source of revenue generation. First they will go for commercialization and next step.. Privatization..WEAK~AAS = विकास", "shrutirawat_music": "Shame shame shame modi", "gautam.anand": "Education should be free😑", "ticket2explorelife": "RSS armed police on their work", "hot_blooded_rider": "Ye wahi police hai jo kuch din pehle valilo se piti dol rahi thi .. @reallyswara", "musafir_hu_yaaro": "#angreeaunty", "iamsugandhaasthana": "@reallyswara ..i support u in all way.u r very talented and intellectual person swara..but this time ur wrong..300rps is nothing for jnu students and u know that...", "sabiha_sabb": "So sad to see this, here government instead of encouraging education it is suppressing them..i support JNU and all universities fee hike protest", "naim5568": "Anything can be happen as a dictator is ruling", "amritvats2001": "#standwithjnu", "richibaidwan": "Why is the police physically harassing these students? How are they allowed to touch forget tug and pull on people? Is this even lawful? I’m so confused.", "wazedah": "😠😠😠😠😠", "vaibhavzwa": "Swara ur just one of them just puttg up controversy now n then. Hike my foot go n see fees if normal school students. This hooligans idiots cannt pay that much fees. 600 percent lol. Get ur maths right.", "kislay115": "We demand shift the campus off from Delhi", "iamprashnt": "@reallyswara madam...fees kitni thi aur ab kitni ho gayi hai..Ye bhi batao..Tabhi samjh ayega..Sirf Lal salaam wale hi free me padhe..Why don't you support fees free education..Why you only supporting for JNU only..", "siiddique": "Tum ye Ku Nahi soach pate ki har koi Zomato se order Nahi karta h, har koi Apne bacho ko private convent school ni bhej pata h ,,,,aur sabse important middle class infect lower middle class coffee Nahi \"chai\" pita h", "nipunsahu": "Achha.. behnji aap filmo main dhyan do", "iam.vickyjain": "शाबाश #आँचल_यादव आज तुमने हम राष्ट्रवादियों का एवँ *सुदर्शन न्यूज* का सर अभिमान से ऊंचा कर दिया ... सुदर्शन न्यूज की शेरनी जैसी रिपोर्टर आँचल को जब JNU के कुछ गीदड़ों ने ललकारा तब दहाड़ उठी वो और भाग खड़े हुए टुकड़े- 2 गैंग वाले..😂😂", "bneel9612": "🌹", "jay_mishra_01": "Inki asse hi ga*d Todni chahiye", "kauravi25": "Students ki fee se statue banega modi ka..... kya krenge padh likh k bechare ... jab pakode hi to bechne hain ....", "agsilverline": "🖕🖕", "suneel_r_sagar": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "naaz90786": "There are very few alumni who are successful are voicing their concern about JNU. I am so proud of you for speaking inspite of all hate you may get. #StandwithJNU", "robinchauhan241": "@reallyswara madam I just remembered pankaj tripathi comment on kapil Sharma show rehne ko jagah nahin thi toh JNU mein admission le liya , baad mein wife ko bhi saath rakhna chahtey they par mana kar diya gaya. 300 rs mein abhi bhi shayad hindustan mein kahin bhi room na miley. JNU mein sahi mein student hi padhtey hain , I seriously doubt now. All fasads are originated from JNU.", "anjal1998katiyar": "If someone does not have knowledge then they should not support to any people ...ok..", "cool.dude2482": "Agar aap monthly 300rs bhi nahi de sake to doob marna chhiye..", "sarathlibra": "I remember in 2006 a government collage hostel in Kerala was charging 300/month for a single occupancy hostel room. And today I can see good for nothing JNU students are on strike for increasing their hostel fees to 300rs/month.. it was increased from 10rs to 300rs.. 600% hike.. shame on you @reallyswara.. u have no words to say when a common man in Mumbai is paying more than 30k as fees for his nursery going child.. JNU is the cheapest among all the universities in India and after knowing that some so called intellectuals like u are supporting these strikes..", "ripon__ripu": "Shame", "imush52": "Nobel prize ka apman. A brilliant but lower income group student, may be a future Nobel vijeta will be deprived now. Think .", "gautampattnaik93": "Protest agar sahi muddon kliye kar rahe hain toh jail jaane se kyun katra rahe Hain....?? Get yourself confronted in front of law... Dudh ka dudh Pani ka Pani as simple as it is.... Aur agar fatti hai toh badi jhol hai in student wale role mein...", "ranganathkamath": "You know how much is the platform ticket? It is Rs 10 for 2 hrs. But it is Rs 20 per month. Are you not ashamed?", "amanjeetanand": "Does Democracy exist ? Save education from privatisation!", "sibasisdutta": "Swara aunty", "mhlaapindd": "🔥", "mishramanjeev": "You jnu rent for students 10 rupees for month, who given all money only tax payers????? Please open your university and give all of then free fund educations # desh k gaddar# no comporise # nationfirst", "ripintandon": "Please call lawyers to handle police.", "khanbabavzm": "Shame india", "harshalnagpurkar": "Are madam ji jab waha ka ladka 800rs saal me 6 jeans le skta hai to 300 rs apne rehne k liye nhi de skta kya......aap hi ek hostel bana do unke liye or dedo free entry.......this is the time of exams or ye padhai chhod k morche kr rhe hai...aare inko padhna hi rehta na to abhi ka 1 mahine k liye fees bhr dete exams khtm hone k baad krte jo krna hai nhi lekin humko to khrcha karana hai....are protest agr aise hote hai to gandhiji se kya sikha.... petition file kr dete 10 rs mhine me yaha pani nasid nhi hai middle class ko....mere ghr me ata hai pani ka bill....3 mahine ka 400rs ata hai.....mahine ka kitna hua??? Itna to matjs krlo madam.....😊", "ankit.sisodia1": "Are to Bhai education loan lo...jaise baaki janta leti hae....U are getting world class education which can not be free and I hope it empowers students of JNU to pay it back after completing their education.Probkem Kya hae...", "pankajdas916": "😢😢😢", "editorspassion": "Y should we pay for this anti nationals", "mohitsobti9": "Ths are student wth latest model i phone, pc, flavoured condoms in there study bag, anty national activities hub in jnu.todo salo ko do inko lal salam,#delhipolice zindabad.", "rohanaps": "Dear swara... Please raise voice against your industry's nepotism also who h is killing actors from poor background... If you are real crusader... Set a difference in your own alley... Can you... If you can't yoh are a hypocrite...", "mantu.s.1044": "#Shut Down JNU. Support guyz", "zainulabedeenawan": "Is it the local police force or the Indian army in this footage?", "ankitinstaclick": "I support fee hike", "hbc.07cddy": "Students ka tag lagakar ye log Kya koi B man Mani karege ha JNU me Kya ye padaya Jata hai ki KHARAB language use Karo, or Kya ye student hai Kya SWAMI VIVEKANANDA ki murti tod di murti ke niche kitni KHARAB KHARAB bante likhi hai, Apne hi DES ka APMAN Kar rahe hai..", "vasunarayanabanavath": "✊✊✊✊", "manster": "Abtak kitne Afzal nikle? 😂", "puru24hr": "JNU = jabardast nautanki University 😂😂", "leenamalkani": "Bullshit it's a nominal raise from 40 rupees to 350 .....this outbreak is fake and made up", "mansiid2018": "This is totally wrong. They don't have even women officers.. how could they touch girls like this?", "singhtushar04": "Are they students??they are naxals....", "athulpai98": "Even a nursery school fees is more than 10k these days!! And i dont want my tax to go to these universities for these anti nationals!! Well done government of india @narendramodi @presidentofindia", "prakashramteke2803": "सरकार 3 हजार करोड़ रुपए मूर्ती के ऊपर खर्च कर सकती है तो शिक्षा विभाग के लिए १२ हजार करोड़ रुपए तो खर्च करना ही चाहिए। #StandWithJNU", "lovesharmayadu143": "10rs me tere papa me bhi room liya h Kya", "nat.korg": "Are you really so dumb to post about about 600%? Do you even know the amount to which the fees have been increased? You are supporting the violence caused by students who can't afford Rs. 300 per month!!! No wonder real life is different than reel.. Looking at the characters you played on screen, I really thought you were an intelligent person!!!!", "iamgufii": "M😰😰😰😰😰😰", "reza.ahmad786": "Thanks maam...for supporting to the student........", "trickeytripathi": "Jnu should be closed for me", "mdali3277": "Because they are not lawyer😢😢", "ragdsjjffd": "Student study karga ya fir strike...", "chef.azim": "Such a looser Delhi police", "akashpriyedarshi": "Lawyers ko bulao koi 😂😂😂😂", "singhxavi": "Im sorry for you people, who don't know what the fck happing In country and commenting dumbest i ever seen... Dude education must be free for all who can't afford...", "ashish.kajla": "JNU ko band kro ......!!", "draditidutta": "#taxpayerwithJNU", "theleisurelovingguy": "Sorry Swara Aunty... but you should also fact check..parity of fees is not be be accounted as wrongdoing. Today’s nursery fees are more than JNU, so should the children in nersery too protest against the govt.. if you are so hurt,please sponsor their education", "ashishmishra4348": "Kutti jnu kya tere bap ki hai kya", "iampranav1496": "This is very unfortunate and still at here in comment section people are unknowingly using rubbish language. They(JNU students) are protesting against their cause and they have right to do that. If you have no mood to support them then you won't need to criticize them too. Dont say like \"they are studying on your tax paying amount \" . They are there(in JNU) because they deserve too. If you have so much care and concern about your tax payment they go and ask the Gov. As what they had done with rest of all amount. #jnuprotest", "gopal.bali.7": "There u go again with half hearted social media posts on issues that u cant & dont do anything about except an attempt to gain publicity mileage 😂😂", "ranjan_1722": "#taxpayerwithjnu", "poeticsometimes": "सुनिए एक छोटी सी प्यारी सी नन्ही सी बिटिया के जन्म पर उस परी के लिए एक खूबसूरत सी कविता on my timeline..! Please visit my timeline..!", "anupbisoyi": "Should Protest for a 399 jio plan as well... 😁😁😁😁", "rahulshukla6522": "😢", "anandpatel1982": "@reallyswara do you k ow the fees ?? Check their fees first what they are paying. Hike is totally needed.", "biman.hr": "@reallyswara madam jee....students were having phone of 12k in hand and fighting for INR.600 fees....isn't it funny...actually it's place where politics to be induced in every corner...instead of studies now a days...", "arvindsarda": "😂😂😂", "truelydipa": "@reallyswara you are an absolute sick and psycho. If you can't contribute for a better situation what you can atleast do is stop supporting these nonsense.", "thegouse_insta": "Kya hoga 're iss dash ka😢", "vishal_ksingh": "JNU ki yahi pukar .... VC ho Ajit Doval is baar ... 👏🏽👏🏽👏🏽👏🏽", "prashantphate": "Are you really think that they are studying at JNU. Will you please confirm the amout which they are paying?", "deepankit7709": "J=Joker", "i_am_manojjaiswal90": "👌👌👌🔥🔥", "mohitpalesha": "Y just JNU education all of lower strata should be provided by the government irrespective of the stream he chooses.", "_darkhorse7": "Police have gone mad", "rajalambert": "Some times I felt that what the lawyers did few days ago was justified.", "no_space_for_anyone_": "This country actually need free education for everyone they are increasing it instead", "uniruchi": "Shameful act by police", "myinsta_pawan": "What was the fee earlier and what is to fee now?", "_i_am_sarthak_": "Gadaar sale", "shubham.tiwari24": "Sb politics kr rhe hai @reallyswara", "urs_shehaan": "Advocate's ne mil kr inko itna pita fir bhi ye nahi sudhre,,", "theajinkya_kadam": "Waah Modiji Waah!!!👏🏻", "kahani_khor_kkay": "REALLY SHAME OF THS GOVT WHR STUDENTS FUTURE IS NOT SECURED👎👎👎", "sdhirwan": "😂😂", "anil.jaswal.3158": "Shocking is why JNU is loner and rest of the India's students community silent. Why this division even among students.", "ahmedsaleem001": "@paliwal2209", "kali.yuga.kaniya": "@narendramodi", "im_lefty_": "Better sense may not prevail but democracy must.", "gpshubham30": "गेली ।", "abhay_shetge": "Ek follower kam kar diya aap ne....😂", "pra0096": "Free m padha do ap inlogon ko", "samvednaamitabh": "Shame shame Modi tyranny", "prafullrk": "🤣🤣🤣🤣🤣🤣🤣", "raahul.tay": "😡😡😡", "rajkamalrathod": "This type of protest should not be just for JNU it should be throughout country for free education.", "avesh04": "What about students who can afford ? Should less fee be there for all?", "pritesh_bharti": "अपने लिए नहीं हमारे बच्चों के लिए लड़ रहे हैं। Article 21 right to free education #Suppor_JNU", "tanupria": "😂😂😂😂idiots", "kamath61": "Give me a break sis... frankly speaking jnu students are the privileged lot.. dissent is healthy for a democracy,I totally agree but it needs to be a genuine cause.. jnu students only believe in chaos and the government of the day knows exactly how to milk it for their advantage and you guys are helping them big time...this is the reason why the fence sitters are not with you.... time to think sis", "vikasmehta13": "Yes, the hike is increased 300% from 10 to 300 rupees per month. It's difficult to pay from the poor background.", "saif_ibrahim46": "Brave@swara", "iammunjal": "@reallyswara do you charge same fees for all your work ya price badhai hai.. ?. .. . #jnu", "ar9.__": "मेरा भारत महान। (˘･_･˘)", "singhkeshav12": "The scene is same in IITs and nits as well as MBA but no one is speaking", "el_solomon_mark": "Infant babies are gang raped by police and bjp ministers in Hindu temple backed by prime minister animal darendra modi free from all the court after killing 1million minorities in gujrat india, home minister amitshah killed standing judge of Supreme Court judge Loya exposes by senior Supreme Court judges cobra exposes how Bjp destroyed the media and its institutions", "shikha_chauuhan": "@reallyswara behen youth and education k naam par kuch bhi karege kya...", "devendra___ahirwar_": "दुःखद", "bromix_cane": "If they can wear branded clothes, Ride Royal Enfield..so why can't pay their own fees?", "hdembla": "JNU should be moved out of Delhi, these guys are a mess. I cross the area everyday, looking at the crowd from last 5 years there is no way the same crowd cannot afford the hike, pls don't misguide others by 600% fee hike. This revised fees in actual number would be less than the amount 80% of the students owe to the canteen wala and sutte wala.", "piyushnchouhan": "Don't Close JNU Hike the fees 300% More", "i_m_.sahil": "Rip democracy .....", "ziaf_shaikh666": "@narendramodi", "manan__xxvi": "Maaro lodee logo ko 😠😠", "amitcommunistsinha": "✊", "humourshot": "Police wale kuch zyada hi harami pana dikha rahe h sale ladkio ko kapde pakad kar kheech rahe h 😡😡 not good", "sambitmishra001": "Mam, please go through the story properly before posting anything about it. 600% is from ras 10 to rs 300 that too yearly. The so called students are wearing branded dress, shoes, mobile phones but can’t afford 300 rs for education. Hats off to the liberty “Freedom Of Speech”", "jaivikrantaaa": "#shamefull", "shrikanta": "Student????? Do do bachho k baap lag rahe hai sab sale swara aunty", "ashishjoshi266": "@reallyswara revised fees for single occupancy after 600% hike is Rs 9700 per Annum for single occupancy hostel student and Rs 6100 for double occupancy. Let the students work part time and earn The fees money so that they learn the value of thousands of rupees that government is putting in educating them at the cost of taxpayers money. Alternatively, please feel free to sponsor their education and set an example. It’s very easy to complain Swara. Constructive and valid criticism is always welcome but such acts for cheap publicity are unwelcome and show poor judgement on your part.", "i_am_y.o.g.e.s.h": "Bloody politics try to coverup the things by saying JNU is anti national. But what gov. Is doing..#fightbackjnu", "raja_bhai_____": "oppsss", "iammahesh10": "Location of protest ???", "raopranav2005": "Pests need to be eradicated", "mechies_23": "All those justifying this have either no brains or juz too much brainwahsed by hate. There r well explained interviews of how harsh situations students go through with their families who earn so less n will certainly affect them. U guys nvr seen rough life won't understand this.", "amitgupta04": "When will the stupid media stop paying attention to this shit!!", "mukherjeechirantan": "😂🤘 maro bc anti national ko....", "medhha_24": "Woww.. great news. Don't take admission in JNU. It's good for students & country. ❤️❤️❤️😂", "sawai_devpal": "👏👏👏👏", "siddharthhosakere": "You must be crazy swara ! Get your facts right before supporting anything in the future. If you have been asked to do this by a political party or anyone else then it’s even more pathetic ! @reallyswara", "tkrishnakishore": "What is the duty of Govt.s , if not finding education...?", "anamikathewonder": "Dey vandalised swami vivekanand's murtee.... Aeso ko university se country se nikal dena chaiye.... 600 koi bht badi baat ni h... Rich n poor ... 😂 Bht saare garib road pr rehte h... Bht saare din bhar mehnat kr k gujara krte h...Aur ye students... Sutta marte h... 600 me inki fat ri h", "arjun_reddy777777": "Why don't u go there and protest for them rather than barking in social media @reallyswara", "kamal1085": "Have never seen something happening like this apart from India !! Violence and protest !!! They wouldn't have cried like this if food liquor and other things prices would have Increased! Shame on you students for being stubborn and spineless!", "unusualkid_11": "Maaro or maaro saalo ko", "si_8911": "JNU band karo nahi to kuch harami jo parne jate hai parai chorkr ye luchha baji karega, police ko aur sakt kadam uthana chahiye, acchhe se pita nahi, police se agli baar jayada pitai ki ummed hai, 10 rs me chaye milta hai aur ye kamine parai chorkr laundiyabaji karega", "nagenkumarsahu": "Muft main sarkar ka Khana hai ...aur uske khilap hi bolna hai....shame u people..shame on u to support these so called student ... considering JNU as the political platform 😡😡", "som_roy69": "✊✊✊JNU", "__mr____manhas": "You dumb anti national", "dinesh.duggal.50": "Political vendetta!", "acid_acd": "Wah bilkul sahi..", "chiragbatra66": "Sad", "manuzwork": "This is what they study in JNU at our expense....", "dilipnarunda": "@reallyswara एक एक के चूतड पर मारेंगे जो हराम की खाने के लिए JNU को रंडीखाना बना कर बैठे हैं।", "sarangisangram": "Inko maaro. Madam bachayegi", "rockingravi55": "Under this rule middle class people and students are suffering a lot. In our clg fee increased by 30,000 , after gst😒😩", "habeebakhter": "But police ki zyadati nahi chahiye.", "thegauravsawhney": "Ye haramjade 3000 ki charas pi jate h. 8000k ki daaru pi jate h tab koi problem nahi hoti jnu ko randi khana banaya hua h. Shame on u coz they r anti Indians & u r supporting them 😠😠😠", "ankitmeenanitj": "Yaha NITs IITs m fees 1 lakh hoti hai or yeh log itne me rona kr rhe or fir tum jese log support bhi kr rahe ho inhe... Slow caps.. 😅", "tomboy_to_the_runway": "1 Zaza s", "kashmirthroughmylens": "This is sad. I wish people supporting the police and the government for these actions and justifying the fee hike would infact ask the mantris and beauraucrats to give up on their free housing and other countless subsidies and reservations.", "shivam_mishra_rewa": "Inn hrami ki aulado ko Delhi jaisi city me rhne k liye room dena km se km paise me khana milna aur ye chutiye WhA political kam aur desh virodhi bate krte hain , MAi to khta hu pair k niche goli maro B.C. sb ko", "her_things__": "Horrible 😦", "shristi_not_shruti": "This is pathetic! 600% is a bit too much, but the fee can hike a little.", "sayansahahit": "Stand with JNU", "satish_sharma1986241": "All these steps were taken by Govt after a lot of research and discussions among qualified bureaucrats and we should support it keeping all the facts in mind.", "amitkumar3170": "This is India so sad", "ehsumimi": "Rs 10/- se Rs 60/-hogaya kya ???", "un_arth": "✊🏼✊🏼✊🏼", "strwwbberry": "I would wanna Answer all ur #Hastags one by one !! Wats!! Fight back JNU? Don U even know how much subsidy they consume from Tax Payer Quota? I will tell u they had used more thn thousands of Crores till date!! #standwithJNU? Where in Instagram 😂🤣😂🤣 and give commentary 🤣😂 #feehike? Did u even knwo it happens or jus tht the protest is onn toh you figured out. #youth#education#incrdibleindiaball these post u put its ok? But before Doin post Wat ur actually Doin for it. Any change I’ve bought in the society or anything!! More thn antinationale or anything ur Anti-rational!! U only speak in topic which are current Belive me after 30 days till next JNU protest u won’t even know Wats happening there 😂😂 Shame baba shane", "rinku_dongre": "That’s a very sad part of our system & the worst part is not a single leader is coming Or tweeting about JUN’s protest🗣", "kuljeet_singh_nikkuwal": "Jnu zindabad", "bansalrahul4321": "⠀⠀⠀⠀⢀⣴⠶⠿⠟⠛⠻⠛⠳⠶⣄⡀⠀⠀⠀⠀⠀ ⠀⠀⣠⣶⣿⣿⣿⣶⣖⠶⢶⣤⡀⠀⠈⢿⣆⠀⠀⠀⠀ ⢀⣴⣿⠋⠉⠉⠀⠀⠈⠉⠛⠿⢿⣷⡀⠀⠈⢷⡀⠀⠀ ⡾⠉⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢦⡀⠘⣷⡀⠀ ⣷⢰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢳⡀⢸⡇⠀ ⢻⡜⡄⠀⢀⣀⣤⣶⣶⡄⣴⣾⣿⣛⣓⠀⠀⣧⢸⣇⠀ ⢈⣧⣧⠀⢩⠞⠿⠿⠻⠀⠘⠙⠃⠛⠛⠓⠀⣿⣻⠿⣷ ⢸⡵⣿⠀⠀⠀⠀⠀⠀⠀⠀⠠⡀⠀⠀⠀⠀⠀⢻⣇⡟ ⠘⢧⣿⡀⠀⠀⠀⠀⢧⣤⣤⣶⣗⠀⠀⠀⠀⠀⠜⣽⠁ ⠀⠈⢿⣧⠀⠀⠀⠀⣿⣿⣿⣿⣿⣀⠀⠀⠀⢠⡟⠁⠀ ⠀⠀⠀⠘⣇⠀⠀⠰⠋⠉⠙⠂⠀⠉⠀⠀⠀⣼⡅⠀⠀ ⠀⠀⠀⠀⠹⣦⡀⠀⠀⠀⠉⠉⠁⠀⠀⠀⣠⠏⢻⣤⡀ ⠀⠀⠀⠀⠀⢹⡷⢦⣄⣀⣀⣀⣀⣤⣴⡾⠃⠀⠘⡿⢶ ⠀⠀⠀⠀⠀⢨⡷⣤⡀⠈⠉⠉⢁⡴⠋⠀⠀⠀⣸⠃⠀ Tukde tukde gang ka end hoga 😂😂", "ethane.h": "Very soon we will be best friend with North Korea.", "hada__virat_7": "Education chaiye inko ar Aajadi b ,अब तो इस jnu ko भारतीय सेना के हवाले कर देना चाहिए इनको अच्छे से आजादी मिल जायेगी फिर।।", "__pankajs__": "Percentage calculate krne wale pde likhe anpado, 10 rs se bdakr 300 rs ki he.", "karn.anurag13": "JNU = DRAMA", "adityaraj.utk": "😆😆😆", "rakeshkumar7915": "Abhi m.tech ke liye bhi jo fees badhi , usaka to koi baat hi nhi karta", "8bitpunisher": "Less knowledged bollywood lady", "shaktisingh__rajput": "Why don't you join politics, it's all politics who cares about fee hike", "shahiersharan": "The 300 per month is too much for these \" poor people \" to pay? This amounts to 1 day of work for a daily wage earner in Delhi. And that represents 3% of the monthly salary (if they were daily wagers) ... Normal middle class people pay up to 30% for their monthly salary towards their shelter !! So i don't really buy the argument that this is \"expensive\"", "samargoel": "Glad world gets to know how are they treated for the ruckus they create..., i was always under an impression that this the fort for anti nationals....", "krishnamarkad200": "Instead of posting such shit you should help them", "vinuthas18": "I support this protest . Y r d police treating the students so badly", "advitiya_anupam": "@reallyswara ...badi baat hai ki aap support krr Rahi hai .....wrna ye jante hue bhi ki log hate comments krenge ... bollywood k log apne opinion k liye ladna to bhul hi gaye hai jaise", "rajshekarkool6": "U will be entry into every single Matter in political in country 🤦‍♂️🤦‍♂️", "musical_snob33": "Modi cock sucking bhakts in this comments section please go choke on sone cow shit and die", "k_sanjeet20": "😂", "sadak_chaap1": "कुर्सी है तुम्हारा,जनाज़ह तो नहीं है। कुछ कर नहीं सकते तो उतर क्यूँ नहीं जाते।", "saqib_shb": "Hi swara.", "narayanancivil36": "Simply close JNU..", "ashish_pj_17": "Kya students ki itni bhi haisiyat nahi ki woh part time job kar ke mahine ka 300 rs de sake ... ya free mein khane ki aadat pad gayi hai", "mskari.135": "Shameful", "kunal_551": "Bhonki Swara aunty bhonki, this woman comes up with half knowledge and post such nonsense. Aunty fee hike below poverty line students ke liye nahi hai. Aur aunty 8000 mein se 300 ko hi taklif ho rahi hai. Kyu bewajah bhonkte ho", "ritikapachisia24": "@reallyswara they hav money for everything to live a luxury life but dey cant afford 2 pay TO the sysytem?? Its not always the govt hav 2 be blamed we as a citezens also owns resp by not showcasing something ungenuine...n u being a celb defn should think 1000 tym before posting such issues...lets stand together by not making US APART", "ruchu89": "Seriously makes me sad!! Beyond disturbing.. @du_unity looking for fair support..", "aawarahu__": "Kabhi kabhi lgta h lawyers thik hi maar rhe thy", "mr_kaul": "The fee hasn’t been increased in nearly 20 years. You support such hooligans? Hostel at the cost of a samosa is what they are getting? This is no way to protest. Threatening teachers, stopping ambulances? This is just a breeding place for communists like yourself!! You very well know yourself what goes inside the campus, from painting walls, demonstrations, anti national slogans, dope etc. If they have money for all this then,a nominal fee revision is okay.", "das_vanthala": "✊✊", "yashrautela11": "@mahima7763", "amitmehta9": "This is just sad!", "im4hit": "✊✊", "shubho4188": "Madam Ji... 600% ka Rona mat Roiye.. 600% ka amount batana Jara aap!! Even nursery student fee in today's world is 6000% more what these goons are paying! Why govt should subside them...? Jab yaha par sirf anti Indians ke nare lagte hai.. as a tax payer I don't want my money to be spend on these ppl at all!!", "vikasraj8206": "Thanks for the video. 😍", "manishsgh1994": "Sab ko milegi aazadi ... 😂", "abhisharma293": "Kha gaye ap log desh ko 🇮🇳🇮🇳🇮🇳🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "alihasan.tab": "Living in Maldives, and being an Indian I am ashamed of our government's behavior towards students. This video is \"behind the scenes for next revolution\"", "ibachheti": "@reallyswara hi you are the first one that I saw supporting these kids.. I think police is doing right.. I support delhi police.. These students use all expensive stuff but they act like this when there hostel charges and fees getting hiked...", "raj.kamal.5076798": "Soch samajh ke bolo", "mulla.ki.daud": "This is disturbing", "ajaz.humanist": "Sheme on delhi police", "sharma_kartik9": "Haan kyu nhi Costly phone rkhte h iphone lkn 300 rs dene nhi bante ... Costly kpde pehnte hai achha khana khate h frnds ke sth ghumne jate h lkn khane ke 1200 rs nhi de skte ..wah re wah .. 7-7 saal pade rehte h degree complete nhi hoti tab paisa nhi doobta inka.. Private universities main 99000 ek sem ki fees hoti h lkn wahan bhi bachhe padte h education loan lekr toh unko bolne ka haq nhi h kya ... Swami vivekanada ki moorti tod di wahan ulta seedha likha or yh JNU KE PADE LIKHE STUDENTS HAI ...", "a_swaminathan": "Delhi police ❤️ 👍👍", "makeupartistrybynashra": "😭😭😭😭😭", "akshayraj111": "Terrible this is....", "t_h_e_m_e_c_h_a_n_i_c": "The students from IIT n Nit are facing the same problem but they are not behaving like this.same Fee hike for the M.Tech also but they are not coming to the road n not painting der college embankments not affect the common people.", "i_m__abhi": "Modi h to mumkeen hai 😅😂", "nehatrikha1910": "Do you know what is the exact amount hike? Rather than saying 600% plz share the amount too", "maujparast": "What about student loans? Can’t they apply for loan like other university students?", "yashcaptain": "Can’t feel it.", "sahid_sai_": "Govt & crowd busy in religious matters ...who care students👎💩", "pariharcp": "शिक्षा के लिए क्या क्या झेलना पड़ रहा है. अद्भुत है ये देश. @narendramodi कुछ संज्ञान लिये है या विदेश यात्रा ही चल रही है. ऐसा क्या माँगा जा रहा है छात्रों द्वारा. शिक्षा., कम फीस, और आप दे नहीं रहे. क्यों", "fayazansari_": "🖕 Right ......democracy 🖕😢", "sharma.ansh1": "😀😀", "i_am_ashishn": "😂😂😂", "aprameya_101": "Justice for JNU", "am_not_just_a_pretty_gurl": "#fightback", "gauravh2849": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "pasha.patience": "Call the advocate to teach a lesson to these policemen", "manish24x7u": "Or food ka 1200 Kiya h khi 1.2m nhi", "zevesh_sattar": "😞", "heminchampaneri": "कभी दर्द उठा, कभी लहु गिरा पर मेरे सीने का आईना जो टूटा तो इश्क़ से इन्कलाब निकला।", "scrapbharat": "आपको वहां रहनुमाई करनी चाहिए थी", "gaba2445": "Free mein chahiye sab tukda gang. Aunty"}