{"vishalshekharr": "U dumbàssss👎👎👎👎👎👎", "bhagva_rang_hindustan": "See my story🚩", "akshayraj0722": "Fuckoff", "fragrant.memories": "Kuch Bhai naam se bula lo, jugar hamesha jugar hota hai 🙏", "chibsushma5": "Triple talak? What is anti national in it ?", "_yogeshmishra14": "Neta nhi bnoo gii tum paresaan naa hoo @reallyswara", "prakashtiwari8865": "😂😂 chup lawdi😂😂😂", "raushanks7": "Pehle constitution ka spelling padho you illiterate", "__adityxx__": "Sasti Publicity", "ayanmallick_99": "Ha to jab aise aise karegi tu to tujhe kya phoolo ki maala pehnaye fir abe dhang se ji le jyaada neta banne ki koshish na kr actor he actor ki aukad se ji", "lalit.jindal007": "🚽🚽🚽🚽🚽🚽🚽🚽🚽🚽🚽", "shubhajit415": "Mam with all due respect , you are a chutiya ❤️", "bulbulyadavv": "What a CUNT 😂😂", "patilprajaktakrishna": "Gaddar deshdrohi arey sharam kar sheeee shame aaise log hai hamare desh mai", "akash.srivastava__": "Politics me utarne k practice k ja rahi hai😁", "anjalibajpai.7": "Ok didi, get lost !", "guptamahendra9": "Aaj tak sambhidhan sansodhan kitni Baar air kyu hue,,janti ho,,ya school Mai BHI sirf ungli Karti thi,,", "shahidsuleman4696": "Nice", "antomi_stark": "🙄kuch bhi.... Bakvas", "har.har.mahadeev": "आप दोनों राधा कन्हैया की जोड़ी बहुत सुंदर है। भगवान इसे सलामत", "the.splendid.life": "Didi! Misguide to aap krre ho. Please thodi to sharam karo 😓🙏", "namssalian": "Opportunist.", "atif.shaikh786": "👏👏👏", "shreyash_sarkar1": "🖕🖕🖕🖕", "73.99259273": "👌👌👌", "tariqiqbal1215": "Absolutely right sister👌", "_trouble_80": "Is she not getting films???", "shivan_29": "To ladlo phr 2023 modi vs swara (lahore mein jnab khna sikhliya apne 😂😂)", "life.of.vico": "Good for you woman. The hope in the goodness of humanity is still there. Keep on doing your thing. God bless 🙏.", "abhishekchoudhary251": "चुप कर रंडी कुत्ती", "ikartikxo": "😂pagal aurat", "nspnitish": "No clue, just going through the script. No head and tail. As she doesn’t have a degree that’s why. Sad. Please go to school", "nafis3594": "Really a real person in Hollywood is only you heartly like you you are my favorite 🌟 real girl I like you so much ❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥", "manish_paliwal_manya_": "#isupportcab 🇮🇳🤘🏻", "ananyathesingh": "Tereko kaam nahi mil raha toh baaki ghar ka jhaadu poocha kar le na. Paise Dekar khud hi ka interview karati hai", "laddusaurabh20": "BCçccccccccccccccccccccccccc", "komal.s1282": "Ghatiya heroine....flop hai tu🙏👎", "jagannathhh": "Aise logo ko India me rehne ka koi adhikar nahi hai aise pagalo ki tarah logo ko bhadkaati hai paagal hai 😂😂😂😂😂😂😂😂", "ayushivam9999": "Plz Learn CAA ok She says lie", "saffron__anku840": "Swara ji kyu pde ho chakkar me jab Koi nhi hai takkar me", "venoms.yt": "madam bhadkane ka kaam maa baap ne sikhaya ha ya koi course kia ha..😂😂😂", "yogeshgupta1948": "🇮🇳🌞🔱 Ghazwa-e-Hind is an Islamic concept ग़ज़वा-ए-हिंद एक इस्लामी अवधारणा है जो हदीस में दी गई है जो पूरे भारत और हिंदुओं के खिलाफ है। जे एन यू एस यू की आइशी घोष सत्य कह रही है कि कश्मीर में अस्थाई धारा 370 हटाकर मोदी सरकार ने उनके इस आंदोलन की शुरुआत की है। और श्रंखलाबद्ध सीएए आदि जिससे इस गज़वा ए हिन्द को ख़तरा लग रहा है। यहां पर ये भी याद रखना होगा कि 2014 में राष्ट्रवादी मोदी सरकार आ गई और उसके बाद उसी गज़वा ए हिन्द की अवधारणा के तहत जे एन यू एस यू ने पहले 2016 में आवाज उठाई थी कि \"कश्मीर ले के रहेंगे\", \"भारत तेरे टुकड़े होंगे इंशाअल्लाह इंशाअल्लाह\", \"अफजल हम शर्मिंदा हैं तेरे कातिल जिंदा हैं\" एवम् \"घर घर से अफजल निकलेगा\" आदि आदि। *ये आवाज़ कहां से और क्यों उठती है।इसके लिए आपको पीछे देखना पड़ेगा।* जिन्ना के 1947 में उस समय की कुल मुस्लिम आबादी के अनुसार, हिंदुस्तान से धर्म के आधार पर उसी \"गज़वा ए हिन्द\" की इस्लामी अवधारणा के तहत दो टुकड़े (पश्चिमी व पूर्वी पाकिस्तान) हिंदुस्तान से छीन चुके थे। *1947 के बाद आज़ाद हिंदुस्तान में नेहरू ने \"कश्मीर की अस्थाई धारा370\" नामक पहली ईंट उसी गज़वा ए हिन्द के पूर्वाग्रह से ग्रसित शेख अब्दुल्ला की सलाह पर इस देश के संविधान में रखी।* फलस्वरूप क्रमानुसार घटनाक्रम के आगे जब 1989 में एक कश्मीरी मुसलमान मुफ्ती हिन्द का पहला होम मिनिस्टर बना तब उसी गज़वा ए हिन्द को आगे ले जाते हुए उसने, कांग्रेस के मुख्य कश्मीरी लीडर गुलाम नवी आज़ाद के साथ साजिश करके पहले कश्मीर में आतंकियों को आज़ाद किया उसके बाद तय एजेंडे के तहत 19 जनवरी 1990 को अपने जेहादी किलों से अज़ान एवं खूत्वों के साथ खुले आम लाउडस्पीकरों से जेहादी नारे लगाकर, कतलेआम कर कश्मीरी हिंदू/पंडितों से कश्मीर को खाली करा लिया। यहां तक कि उस समय इसके बारे में कोई आवाज़ नहीं, कोई कानून कोई दुहाई नही, कोई मानवाधिकार (एचआरसी) नहीं, कोई सुप्रीकोर्ट नहीं हुई। ना तब और ना आजतक। 2014 में राष्ट्रवादी मोदी सरकार के अब दूसरे कार्यकाल के शुरुआत में मोदी सरकार ने आज़ाद भारत में नेहरू द्वारा रखी वो गज़वा ए हिन्द की पहली ईंट को हटाने के लिए अर्थात इस पुरानी लाइलाज बीमारी के ईलाज के लिए उस अस्थयी धारा370 को हटा दिया। इस प्रकार मोदी सरकार ने इसकी अस्थाई धारा370 को समाप्त करके किया। जिसकी समाप्ति पर इन्हीं सब कश्मीर द्रोही, जो असल में देशद्रोही ही हैं का ये कहना सत्य है कि \"इसकी शुरुआत तो सरकार ने ही कश्मीर से धारा370 हटा कर करी है।🇮🇳🌞🔱🙏🙏", "pradeepchoudhary966": "funded by anti nationalist", "tabish_pavli": "👌👌👌 Truth 👍👍👍", "vivekjais1210": "Sabidhan pe attack tumko Kaha SE dikh rha hai kyo tumko pata hai sabidhan pura Malum hai sabidhan ke bare me tum log azeda set kiye ho", "deepamk375": "@reallyswara Jo apne desh ki nahi hui woh kisi aur ki Kya hogi. Gaddar hai tu.😠😠😠", "praveen7818kumar": "Mere baas chalta tho tere ko Pakistan bhej deta vo bhi phale fhursat mai 😂😂😂", "digvijaykaushal": "abe bollywood me kam nai mil ra h to.....aatanki sanghatan join kar li......", "mr_jatinsharma27": "Ab jese neta ko kursi pyari, inn bhenji ko tv pyara. Tv par aana h bass jese mrzi. Films to mill nhi rhi to ajtk ndtv pe hi aakr bakchodi kri jae.", "karan.ahir_": "#indiasupportscaa", "dhakedmayank": "Aap ydi actress nhi hoti toh saayad aapko yh opportunity nhi milti aapko sabhi desh ki janta ki bhalai ke liye delhi ki chiefminister bnne ke liye election ldna chahiye jisse hm sabi students or janta ko aap jaisa sandaar leader mil sake . ye aapke against comment krne valo ko kya pta ap kya ho hmara support apke sath hain apko chiefminister hona hi chahiye please", "vijay_pant": "Just can you fuck this shit yr....,,,tumhara propoganda smaj me aa rha....your thinking is like worst in human history....god found pity on you", "tonightgamer0o": "Chutye ho tum log bina jaane kuch bhi kyu bhokh rahi hai", "ajaycharan99": "bitch🤐🤐", "er.mahendraprajapati": "Don't sell the country for money, Medam. CAA and NRC Both these Acts are designed to give citizenship and not to take citizenship.", "kd_0806": "Best luck... Stand in election. Voter of India is smart now... Best luck again.", "_ekta.singh12": "🔥🔥🔥🔥", "dipeshbhiwal": "Bollywood me Kam nhi mil rha kya", "ps.bhardwajsharma": "Dipika fadukon ki halat dek le..mutti bhar tum gaddar is desh ka kuch bhi nahi bigad paoge....shivaji maharaj aur maharana pratap jaise deshbhakt abhi hai is desh me.", "haazir_jawaab": "Hypocrisy se bhara hua he ye desh bloody hypocrite", "jit.suthar.359": "Bolna to sek le😂😂joker", "ishita555_": "How much money are you getting for this rubbish to elicit the Muslims. First read about the law and then speak . You have no right to tell yourself an Indian. Such a shame", "chandrima_tina_97": "Hattt be Teri aukat nhi h itna", "khiladi__bhaiya": "Sare katwe salute maar rhe h bsss😆😆😆 , betichodo ko pta ni bol kia baaat pr rhi h", "mokshmaheshwari04": "👎🏻", "farrar_yaar": "Uneducated lady kaash iska baaap kisi or ke sath shugrat bana leta 😔", "visheshkathuria": "#indiasupportscab #indiasupportsnrc", "bhautiksuthar": "https://youtu.be/swGDAflUZps", "nitesh_singh1308": "संविधान पढ़ा भी है कभी 😂", "sumitdutt99": "Shame on you", "sadiaaman6239": "Proud of you swara @reallyswara for the stand you took. Gutcy woman love and respect😍", "mohammed.s.husain.77": "Right mam", "manasa_mini": "Educate yourself first", "swarajit.pal": "Swara ,it will affect only those who fingers too much,not a common indian like me,so just f off", "jigneshsagar12": "सविंधान भारत के लिए है . बाहर से आये हुए के लिए नही", "rajveer_b_rathore": "Kutte ki pedaish hai tu", "shahhusseinnaqvi": "Jai hind", "k_sera_sera_": "Hi Swara, I appreciate you are talking on people’s view point. Please understand,people in india follow celebrities more than they follow truth.people in india look foward to what celebrities feel and say,specially bollywood. Don’t set a wrong example for people ,I am sure majority of people opposing this bill ,don’t even know what bill exactly is about. Think about it. Thanks", "acharyaaishwarya": "What is the \"mool idea of constitution \" ma'am", "namank02": "Plz stop acting... It is as bad as in movies", "hritik123a": "Swara tells all lies.....liar of highest order.....fake.....liar woman....Get lost....ppl hv seen your Vote video n your italy tour pics......so you went through smuggling to italy.....u gave fake votes....laughable stupid woman SwaraBastard", "online1592shopping": "Nonsense Hindu people & nonsense BJP.. Let's kick out Hindu people from India..", "krishnagupta1292": "What a filthy bitch you are #swara", "paliwalakshay27": "swara aunty ki😂😂", "khanabadosch": "@reallyswara can you please join our protest against CAA and NRC at United Nations in Geneva on 01 February.", "vivek_raavda": "😂😂😂", "ra.aa.j": "Look who is talking about hate😂", "the_harsh_ratnakar": "😂😂😂😂😂😂", "suryanshu_lee": "@reallyswara how can you be so illiterate.. Some time you say baap dada k kagaj nahi hai sometime you say Muslim virodhi hai.. Tum log government ko economy k mudde pe target karo thn we all will support you but tumko desh nahi banana tumko apni gang banani hai.. You are such a cheap and illiterate person..👎", "jeet_m77": "Isski raat ki DARU UTRI ...😂😂😂", "_therajput": "@reallyswara Mama u are a example for himdu community , that how left wingers use our own people to fight aginst u . History keeps repating that it weak chutiya hindus who betray their own brother thats y they lose . I dont knw how much money u got to promote this fake propganda . But i hope in future ur kids wont get effected .. u talk about history 😂😂😂 I dont knw which book u read where it says rss n all did all dis . But the thing is its never hindus who start all dis its them who do shit , n rss n and all simply rply", "raman0165": "Boycott this woman for spreading hate and misinformation", "roopam890": "Effect on muslim pehle ye decid karke ao ki konse muslim indian ya tere chahha pakistani muslim kyuki indian muslim ko to effect hoga nhi tum actors dumb kyu hote ho", "rani_meeta": "Triple talaq bill bhi pass nahi hona chahiye tha.. multiple shaddi abandoning wives and bumerous children from each wife shud have been continued to entertain ?? This is not increasing the population ?? Population is not hurdle to our progress what we have in table today ??", "karishma.verma_": "Tu neta nahi banegi...kuch bhi krle", "_.ashnaaa._": "Shut up mann", "gadhvi104": "Ye kuch nhi jaanti friends khaali bhok rahi he bhokne do isko... 😊😊...thode time baad badh ho jaayegi 😊", "rajpootmahhi": "टुकड़े टुकड़े गैंग ! के New Member", "shubham.2812": "@reallyswara Agar Tere pas aadhar card pan card voter I'd Kuch nhi tha. Toh Gaddhi Bollywood mei Nina Uske Teri entry Kaise hue. U r a stigma to women community. Fuck you", "sharmaking88": "Gasti", "tausif5521": "Good we all support you . if we speak again BJP they say we are anti nationalist anti Hindu etc etc", "krn_chaudhari": "Kuch nai hoga tera 😂", "ratnamanic": "@hetajatin absolutely right... 4 paison k liye ye log kuch bhi Karti hai... Acting me nhi chal payi to bad publicity fame hi sahi. They all are like this only. Ye sub kar ke Shayad Congress ya Left se ticket hi mil jaye👎👎👎👎👎", "imayu______": "Bollywood tyago join politics.. bhut scope hai aap logo k liye...😂", "nitishshastri1": "Tukde gang member", "kirti.ruchicollection": "congress k pass ko accha chera nhi hai..isliye inko taiyaar kr rahe..aur ye soch rahi hain k inko seat milegi congress ki trf se", "sahilsahu6237": "Kuch bhi matlab", "mmounica": "🤣🤣🤣🤣🤣", "military_personnel_hr": "Iss desh ke savindhaan pe attack hai to kyu congress ne isska virodh tbhi nhi kiya..... Aur dusri baat ye bill supreme court ne bhi pass kiya -aur ye mai bta du supreme court me koi bhi judge BJP ka nhi hai aur na hi amit shah ka baap hai wha prr.....", "akhileshpy": "Saali sirf misinformation spread kar rahi hai.. can you talk kashmiris Pandit? We not forgotten the history and also we have our head to understand the things.. don't need your misinformation", "neelam_raj_": "👎👎👎👎", "a_win_ash69": "Hindustan pe kalank hai tum jese log @reallyswara", "shivamdubeyroxtar": "Kaise bhadka rahi hai dekho jara .... Waah re waah .... Kash char achhar padh bhi li hoti .... Bahti ganga me hath dhone aa gyi publicity ki bhukhi... 👎👎👎", "iamakshayr": "You should seat in opposition", "vidhitanadkar": "And also your target is not to protect any community but create war between two communities and enjoy ur political future. Shame on u.", "akshay642": "Jab kuch pata nahi hai aur akal nahi hai toh kyu bad bad kar rhe ho aap...jo aata hai woh karo na", "equestrian.3": "Ek baar government ne iske sath live conference karni chahie😡😡😡 fir pata chalega kiske pas whatsaap history knowledge hai😡.. fir koi celeb bina knowledge ke provoke krneki himmat nai krega😡😡😡", "andy_rochol": "Aunty ji aap ko film nhi milegi chahe jitni bhi naarebaazi kar lo#nautanki... #kuchnhihogaaapse", "_.a.n.u.r.a.g_.k.n.o.j.i.y.a._": "Sb se ghatiya ho who the hell are you hinduyo ke paksh m kabhi bola nhi or yaha kya ker ne aa jate ho", "therealsaagar": "India belong to Hindus JAI HIND JAI BHARATH JAI RSS JAI ABVP JAI BJP", "singhaniyagovind": "Agar yu hi muslim refugees bharat hindustan aate rahe to isko bhi barbad krdege pehle hi pakistan afghanistan bangladesh bana kr de diya h bharat ne ab bhi inko chain nhi h", "im_.ajit": "Nikal lowdi fehli fursat me nikal", "vaishya1010": "Abeyyyy chutiya", "__kau_s_hiki.___": "Over stupidity 😏", "shriyakandude": "What bullshit are you talking? Do you even understand the law? Illiterates!", "saurav2482": "Madam me dimag nahi hai #boycottswarabhaskar", "rajusingh0000_": "change your attitude madam,", "ishan.kulkarni.1711": "Paise ke liye koi kitna jhut bol sakta hai😂😂", "zawedazmi": "She is #Real Swara", "doooofoooloo_21": "❤️❤️❤️❤️❤️❤️", "devensharma7rcr": "Are you witch", "__tanmay_kashyap": "😂", "ar.yogesh007": "Chuttiya ho or logo ko bhi bna rhi ho 👌", "imtalib_chauhan": "Shandarrrrr", "varmajittu": "Bosdike Pakistan me Hindu ka Kya ho rha h bik magaigi tu Modi Tum kutto ko Pakistan country land Kar dai ga", "nancyarora__": "@neeru.kureel", "himanshuushekkhar": "Biggest parasite & pseudo intellect, moron party, moron audience & idiot speaker... Uff all theatric...", "romeo__17": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "jdwidbrownies": "How much did they paid you to speak this shit😂😂😂 & if you hate the laws of this nation...... please leave this country your kind of people are the one who is misleading the audience....", "dileswar_garanayak": "😂😂😂😂", "rohangilda_07": "Where were u when kashmiri pandits were alone ? Aare tu paiso ke liye kch b kar sakti h kya ? Itna fame honeke baad b dimag ni h kya..? Analysis karne ni aata ? Stupid h be seriously tu..!", "_smoker9_": "if u don't know than why u spread fake news i know u r try to get some fam", "prakashvijay555": "आज के इस दौर में लोग अपना सब कुछ छोड़कर सच बोल रहे हैं लड़ाई लड़ रहे हैं सच में दिलेर है salute sawra mam", "bohra88him": "Jankari poori rakh kar bola karo ma'am. Warna aapme or anpadh janwaron ki baaton me koi antar nahi rah jayega. Kis muslman ko bahar bhej diya. Jubaan di hai bhagwan ne to kuch bhi bologe? Is jubaan ka sahi istemaal karo ma'am. Suna hai aapki mata ji JNU me service karti hain, to aapne padhai nahi ki kya? Yadi ki hai to CAA or NRC ko bhi padh lo thoda. Bhadkau bhashan mat do. Aap is desh ki kitni chinta karti hain ye is video se samaz aa raha hai, desh ko jala rahe ho.", "deepshikharanarawat": "Itni humanity ye jra China k Muslims k liye bhi bol do China jaake☺️", "rachiita_sh": "@reallyswara go to pakistan.. triple talaq is long gone from pakistan. You idiot. Stop going so low for publicity. Shame on you b grade actress 🤬🤬🤬🤬", "rohith_r_jain": "She is one anti national", "mrinalinitiwari06": "So stupid you are without any knowledge you are saying bullshit", "bindaasganeshdevendra": "Only for public city fake people", "habibsaleh5": "Beshak", "pushyamitra__shekhawat1394": "Waht about kasmiri pandits...you never spoke anything....😢😢😢", "rakhig76": "Dramebaaz 👎🏼", "bak.bak.lawyer": "Get your facts clear!!!!!!!!", "prodigal_sonxci": "Seriously?", "aliya_abbasi_7272": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ thanks", "gauravjain____": "@reallyswara filmo ma kaam mil nahi raha kya dila deta hu aajao mere pass 🤣🤣 CAA & NRC ka matlab bhi bata ha 😆😆", "mr.__raja__sarode__": "Bhenchod", "ri.tik4566": "Are ye behen ki Lodi Randi swara challn to tu chal re hai randi", "m_anam.h1": "♥️", "nileshsinalkar": "Nice way of violating peace !", "pooja.priyasingh175": "Ghatiya khai ki apni sasti public city ke liye ye dusro ki jan tak bhi parwah nhi karti ye tukade gang ko sport karti hai ye aatankwadiyo ko sport karti hai ye khud terrorist hai isliye desh ke khilaf bol rahi hai lime light me aane ke liye kuch bhi kar sakti hai", "thakurr7474": "Desh drohi JNU fan 😈😈😈😈", "paul_britto": "🙏🏻🙏🏻🙏🏻", "si_dd_hant": "Chup be nautanki", "mriashu": "#unfollow", "ayekay00": "Respect 🙌🏻 all the way from Pakistan. Thank you for having such a strong stance for the Muslim community in India, may justice prevail. #BetterIndia", "_justyogi": "@reallyswara don't given speech like stoner 😂 Everything is done which you by government wahh famous hone k liye ye karege aapn aur kuch to bhi tum bol.hi dete ho 😂", "night.devil.05": "congress k sath uthna h maidam ka rona to bnta h yr,ky acting kri h....clap for her plz👏👏👏👏", "vikram1030": "😂😅🤣Achaa ye to vohi he , joo PAKISTAN ki tarife kre rahi thi , 😂😅 fir uski MOVIE nhi chalne di too usko GALI de rahi thi ...😂😅😂😅😂😅😂😂😂😅😂😅😂😅😂😅😂😅😂😅😂😅😂😂😅, madam hme bhu tuhmara khel samaj chuke h , 😂😅😂😅😅😂😅😂😅😂😅😂....bus fram ke liye bina jane kuch bhi bol rahe hoo ...........😅😂😅😂😅NRC CAA kaa full form tke nhi ata hoga .......kyu kre rahe hoo gumhra public koo", "bisht_pushkar_singh": "She don’t know anything, I heard her on Arnab Goswami’s show every word that comes out of her mouth is bullshit.", "sharman4007": "Aanti ji agar aapko kuch smajh me nh aata h to apna ganda sa muh kyu kholte ho gaddar", "venuranjanbhadauria": "दो... भैया aap वालों इनको टिकट दो.....कोर्स पूरा हुआ....", "cinematic_savan": "Ye majak Hai bhai😂😂", "jaaanujaaan": "And u r one of them.... Unaeducated morons", "midnight_snacker_20": "Attack to ab tumhare career pe padega koi movie offer nahi krega @reallyswara", "king210289": "Gasti", "bhargav_mehta_20_05": "Isko famous mat Karo is ko to Ben Karo Bollywood me se", "shadab.ansaari.9": "👏👏👏", "yashkaran_s": "u just nonsense 😝 shitttyyy lady", "sekhri_sahib": "And yes it will be great when you will take stand for the children died in rajasthan", "vinay7480": "Jab bhi nikale ge muh se gober he nikalege", "aarzoo138": "\"Muslim\"huh !", "ashwanitiwari129": "😂😂😂", "garima8292": "You are living in a bubble madam .", "imrahulsingh22": "Yr isme bhi ek dislike hona chahiye😂😂😂", "princesinghkk123456": "😃😁😂😂", "rahul_patel09": "👎🏼👎🏼👎🏼", "anahitakapoor9": "So she has problems with triple talak ... Wow... Slow clap", "ravirajsinh_zala11": "Nice joke🤣🤣🤣", "nm_4u": "Shame.. I used to like her once..", "aman15_singh": "Shut up you bitch", "__simran__2396": "Yrrr mujhe smj Ni aata ki aap half famous and famous log by born hi chuttiye hote ho ya aapko koi iski class deta h ...aap bolte ho mere pass rashan card , 1970 ka certificate ni h ye Ni h vo Ni h then who the bloody hell r u.how can govt identify that u r an indian .and upr se chuttiye or bakwaas post na hi kiya kre toh bet", "caughtinamiracle": "When you have nothing constructive to do, then BECOME AN ACTIVIST & you will remain in limelight. Arundhati Roy as a writer has very few literary contributions. Her mind is VACANT & THD NEXT BEST CHOICE IS RUBBISH ACTIVISM. Same is true for many so called celebrities. A TRUE INTELLECTUAL WILL HAVE MUCH LESS FREE TIME left to INDULGE IN sitting on DHARNA at India gate or gateway of India. How many AIIMS or IIT PROFESSORS have the luxury to sit and available to give tv bites?  It is only JNU type professors have LOTS OF FREE TIME to become activist", "anandwaibhav": "SWARA BHOSDIKAR tum politics me Kyu nhi aa jati tumhara to rojgaar Bollywood me aise bhi Mandi pe hai...", "iam_shanumumbai": "i love you shona 🔥🥀❤️💋💋", "dodo246": "U have fallen to knees for every educated woman who use to like you.. just to gain cheap publicity...I use to like u but now I pity u", "not__your__kafir": "You're really a dumbass @reallyswara", "bharat_sutar_11_12": "Koi Hindustani bhau ko bulao😂Nikal l*vdi", "sainath_batte": "😂😂😂😂😂😂 intellectual people 😂😂😂😂😂👌", "vaishali.govind": "You don't know anything about the CAA act , and u r talking about it.. just to make Muslims feel like they are targeted.. there is nothing in that act that is targeting them.. so please stop spreading hatered.. first check and learn about the act and then speak. Don't just speak because you are told to speak by someone..", "depawataawer": "Aap ek Kam krna plz aap NPR m name Mt likh Wana baad Baki mota Bhai Dekh lege", "therealrashmiroy": "You are playing dirty Suwara", "udaipur_explorer": "Miya bhai ki daring or bollywood ki acting dono hai iske paas! Pak jaao vaha kaam aayegi", "priyanka8780": "Illiteracy at its best!!", "dev_padampura": "U f...g whore", "mscarazon": "Without any knowledge just to be in limelight not good 😢", "nitima_np": "😄", "broken.colur": "🖕🖕🖕🖕 please just shut the fuc* up... Doing all these stunts for publicity. Why can't you be quiet like rest of the celebrities? Oh wait you are not a celebrity 😆🤷‍♂️", "shaikh_sheefa1": "♥️💯💯💯💯💯💯💯More power to you💜", "hyadav": "👎 All I can say is ur so 👎👎👎👎", "simran._anand": "My idiot doll 😂 phle caa pada hai apnee ya u just need publicity its just that jo indian muslims hai unko na koi nikal ra hai na unke rgts le ra hai plz dont prove our respected muslim brothers and sisters publicity k liye kuch n nhi krna hota hai stupid", "surbhi.2502": "Thankyou for such a brave words ma'am... We need more people like you who can speak the things clearly.", "pragatimrch13": "Mam aapko pta bhi h CAA or NRC ya NPR h kya..... U r just trying to come in politics via this drama.... U really think tht u know..... Mam aap apne ghr me baith kr or 10 bouncers leke chlte ho nd u think every one is as u are..... Grow up mam come to the real world... We r delhiites nd we are well educated to understand that wht is law.... We don't want to knw anything from😊😊", "_imjeet_": "Jo ukhadna hai ukhad lo hoga wahi jo hum (Modi) chahte hai.....", "anisha_talwar4": "Deshdrohi ki bachi get out of india", "804mon": "Tu hi batade kya hai CAA NRC", "shikha_shandilya": "How uneducated can you be! Read and educate yourself before making a fool out of yourself. Unless you don’t really care about that and all you wish to do is stir up false emotions for personal and political benefit", "ni.shaikh": "Love u", "abhishekjohal01": "@reallyswara aise hi tujh jaise Libranduon ko urban naxali nahi bola jata Swara.. apna naam bhi badal k suar rakh, swara ek pavitra sa naam parteet hota h jo tujh jaisi urbal naxali ko shobha nhi deta!!!🖕🏻🖕🏻🖕🏻", "puneet603": "Islam is the worst problem whole world is facing even Europe has problems with Islam here is a link for that https://youtu.be/4MdhjdzY8kQ", "ankursss666": "Nrc chhoro pyaaz k baare me socho sb.", "jbhoomika89": "Mam pls check wikipedia. hindu maha sabha didn't support partition..they were totaly against partition.just bcz u r against govt policies pls don't spread false information among the people...", "islakabir1": "@reallyswara Can you please for once explain what the bills mean???? You are just creating hatred. Shame on you!!!", "_i_ananya_i_": "Bakchodi karwa lo fokat ki, bike hue hain ye Bollywood k flop log.. desh se niklo hamare", "bhasin3125": "AAP see ticket mil jayegi ab tho isse", "adi_tribe_19": "foreigners ko q denim h citizenship....nokri nhi h economy nhi h ..kis haisiyat se de rhe hi citizenship ? or us act m sirf ek particular religion ka nam q nhi h inspite of India being soully secular ! partion k tme hmne sbko except Kia tha all religion all category ...to ab ye biased \"policy\" q ? fir pak m or hm main farak kya raha religion k alawa? i", "thakurgaurav13": "Bhag mc", "aditi.2411": "@reallyswara I'm laughing so hard i thought she is one of the smart actor of the industry but shit i was wrong so dumb bro LMAO", "_het.shah": "#isupportcab #isupportnrc", "_vasu_gupta": "Dhakkan aurat apne phle knowledge to lele pure act ki, alal hi ni 2 paise ki logo ko bhadkane m lgi hai dhakkan", "abhilashteotia": "Ek Hindustan hi aisa desh hai jahan par ye alpsankhyak(Muslims) aaye din kuch na kuch utpad machate hi rehte hai, warna inki majority wali country mein toh less majority community ko khatam hi Kar dete hai. Inhe itni aazadi dena hi galat hai", "pankajpanditt17": "are sharam krle thodi @reallyswara apni publicity k lie muslim community ko bhadka rhi h", "swati.tiwari026": "Kitni glt baat krti ho yaar bina kuch jaane", "afrida_rahman_quadiri": "We need more people like you ma'am @reallyswara", "navdeep_poonia_30_": "TRP to mil hi jayegi🤣🤣🤣 well acted mam I am your big fan now...", "hoo_abs": "@pragyaaa__", "varunrexwalabvp": "Apki kya scheme hai @reallyswara", "amit_fagna": "Abey!! You idiot @reallyswara , tell me once \"triple talaq\" was a curse on Indian Muslim women OR not?? Don't provoke innocent people, your mentality is to create ruckush in the society, you wants to divide public on the name of religion, cast, creed.. Mahakaal will never forgive you...", "sharmagauravcool6": "Kbhi ..Teri movie dekne cinema hall nhi jyge... Jaate hue to bhi Mana kr dege..k iss ki movie Mt dekho BC", "_niketa1999_": "Pta kuch hota nhi hai...chal dete h rally krne😂😂", "sunnyyy__111": "It's legit that ur mom slept with a mullah and u were born", "abhisharma630": "Tum desh ki bt na kro tum to thode paiso ke liye aapnaa jism bech dete to t", "sumitkg0": "@reallyswara you change own name swarabhakar to choot bhaskar", "insta_mayura": "मैडम तू चालू ट्रेन में चढ़ गई है.......😂", "rohitsanu.tripathi": "Gang of lols😂", "aguyhasaname": "Bruh. 😒", "neha.niks93": "You're so wrong. Dear swara ji. Please will you stop wasting time of these innocent student's, you've a rich father to feed you. You being a flop actress it won't affect you're life much instead you will raise up in politics, think about those student's, once. about the difficulties their parents have faced to bring e'm up. It's not about Hindus or Muslims, it's you're own political agenda, you're a selfish women, who's getting funded from ISIS and other Islamic terrorist parries, Hindus Dil hai Bharat Ka Toh Muslim is Bharat ki Jan, it's you who's dissolving position in young minds, against one particular party, NRC and cab is against No1. But it's about the increase in terrorism, rape, & what not crimes,. You've seen the world, will any country permit you to enter their land without any documentation, no but India did, long years ago. Those are the people who appose. Kill, murder, do dangas, and ppl like you get funded and go against nation for their own benefits. Stop playing this stupid politics, stop dividing us, on the name of Muslims/ Hindus. You're a absolute bigotry..", "drparul8": "@reallyswara Please behave like responsible citizen of india .when you can't bring peace . atleast be silent", "jankii11": "Disgusting actress...your work on screen failed to create an impact so now using social media...GET LOST.", "iamsidkhandelwal": "Acting ki dukan to chal ni ri phokat bhadka k rajneeti karegi😏 public samjhdar he sb janti he #fakeswara", "im_om0781": "I don't get it how is triple talak bill is against muslim, ek taraf didi feminism ki bat krti h dusri traf triple talak bill k khilaf bolti h,didi khud hi confused lag rhi h", "dipudilraj": "😂😂😂😂😂", "stunningpushp": "One Indian lady talk for change. Many more are there. good going swara 🙏🏻🙏🏻🙏🏻", "prtbiswas": "Madam swara bhaskar agar aap k paas b koi proof nahi iss desh ki nagrikta ki to aap b nikliye yaha se aap jese logo ki bharat desh ko koi jarurat nahi. Jo hindu or muslim k naam pe desh ko bhadka rahe h.", "hemanyarathod": "@reallyswara why don't you become a politician then a Prime Minister to save the country, dumbwomen.... Speeches are nice but it is completely different thing to run the country, what is good for the nation will and should be done, even if some people die for it....and why the fuck, will any country let outsiders live in it....and there are many hindus also that doesn't have proofs for nrc, and if you don't have any documents or proofs, then what the fuck where you guys doing.....? Masturbating the whole time ?", "sumit__kalyan": "to mdm sidhi c baat h ye to 1947 m btaware k time chilla chilla k bola gya tha himdu yahan muslim yahan ab apni mrzi se rahe ho to majority ka rob to uthana hi pdega ab pakistan m 21% hindu the 1947 m aaj 2.77 % hai km se km unki trh tumhari maa to nahi chod rahe dursi baat azadi k time muslim 3 crore se b km the aaj 30 crore hain ab tum log 8-8 bache peda kr rahe ho to ye dar tumahe andr hai ki tum kmjor ho iske hamara koi role nahi h , fir baat rahi triple talak ki to jab apke pita g apki maa ko teen sbhd kh k ghar se nikalnge aap ek raat m hi iske sath hojaoge no doubt . or CAA m muslim ko target kiya h esa to mne nahi pdha h haan agr aap tution owesi se le rahi h to ap pdna bhi mt kunki uska faida nahi hoga baaki acting achi kr leti h sirf uske 10/10 hai", "zaina_khan_90": "💯💯💯💯💯💯💯 Wow ! She is soo braveee❤️ @reallyswara #yougogirl 🔥", "_.theantisocialextrovert._": "Huge respect for you. I really appreciate that you raised your voice against what's wrong and took a stand for the right which most of the people fear to. More power to you @reallyswara🔥🔥🔥 #notocab #notonrc", "notaplainjane11": "Why this lady is spreading hatred?", "sri_ja_n": "Support such courage are rarely seen @reallyswara proud of you", "shvvnv_zvid": "Saluuuuute💖", "ruthlesssssssssssss": "Madam acting nahi hui toh politics ?", "_kshubhangi": "Didi triple talaq scheme hoti hai? You really want that shit to be continued?", "_maherakhan": "You are winning hearts❤️, atleast someone have guts to speak up.", "raghvinder.singh": "Okay if caa affected me , I'm ready to leave country 😂😂", "_mahendramhatre": "भारत मे करोडो बांगलादेशी फेक नाम धारण कर के, भारतीय बनकर अलग अलग जगा रहते हैं. वहीं हल्ला बोल कर रहे हैं. आप सबलोग जरा समजा करो. वहीं affected है और identify होंगे, ये डर उनको सता रहा हैं. 😅", "darshanamaske77": "Aata na nata jai bharat mata😂😂😂 2rs kato re overacting ka😂😂😂", "gourav419": "इनका तो हलाला होगा", "vaishnabi_singh": "@reallyswara ja kar bollywood me kaam dhundo", "gaurav_tanwar_gurjar_999": "Sharm karo 👎👎👎👎👎", "u_mehul_k": "Swara Aunty aayi.. bolo Azzadi..🙌🙌", "akashnirmal.30": "I support CAA and NRC", "vikas28582018": "Madam ji ek read to kar lo or for bolo 👏", "ephemeral2002": "Shehla rashid ke Baad yahi didi hai bas", "nayan_maheshwari_": "Swara Aunty please use your finger and brain wisely.", "sreejitsj": "Shkl acchi ni to km se km bol to accha ... mtlb jbrdsti kyu faltu bol ri yr..", "meme_bhagvan": "Bc aise log country ko kharab krte h", "_urjitaa": "I SUPPORT CAA", "choudpriyanka": "Movie me Kai p kaam nai mil Raha hai madam ko isliye itna KR rahi hai bakii knwladge to kch haii naiii", "mr_scoobyy": "😂😂 bs attention chahiye tmlogo ko... at the end of the day you are an actress afterall", "zeel.25": "💯", "aliya_mehar": "We are with you @reallyswara", "ankitzais": "Shut up.... U scrubber", "jithendra1979": "Could you kindly explain @reallyswara what is CAA as per your understanding... and don’t ask me to search internet... which I can do and easily understand", "akshit_manral": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "spectro.rizwan": "Great swara", "snaya_thakur": "Abe hatttt", "shashi.oldisgold": "👌", "skhajuria8860": "Isse kuch na hone wala...agar politics mei aana hai toh aajao vaise hi...logo ko bhurkana band karo", "deepkushwaha": "Padi likhi gawar hain yeh aurat...Sirf bhokna jaan thi hain , Come have a word one to one....U are not above nation....U are curse of bollywood and even for a country....Pata kucch hota nahi hain. , Bolne chale...Triple talak kyo galat tha , tukde tukde gang ne kya kaha tha bhul gayi kya , and what do u know abt NRC and CAA , sirf bolna hain tho kucch bhi bolo.....", "alaikarm": "Don't tell me you support Triple Talak", "manju_jagwan": "didi @reallyswara I fully support Caa #jaihind #isupportcaa #vandematram ..road pe jake logo ko provoke karna tum jaise anti-indian he kar skte hai.hume hmare HINDUSTAN ne SHANTI or SADBHAVNA sikhaya hai ,which we will follow till the end.. You carryon didi jab tak koi dusri movie nahi milti.all the best.. JAI SHRI RAM🌸", "theatikpatel": "Respect 😘", "mister_tripathi": "We already have a huge population and bad economy (even when it's good , it's not good enough) , still many people don't have good jobs and good quality lives. So why let anyone in ? Irrespective of religion.", "muditpanwar044": "Such a dumb girl u r", "artfrique": "Swara should be put behind the bars on the charge of inflaming minorities against the government, by misguiding them!!!!!😠😠😠😠", "bisariya.p": "@reallyswara behna tum movie he bana lo.... 😂", "ask.ayush": "Nikal lavdi", "journeythroughlyf_": "Before spreading such misleading information", "tasmeeya_alain_syed": "Brave woman ur 🔥 lots of love to u ♥️", "s_mehto2020": "Lawdi hai sali😂😂 .... Uneducated gawaar su🐷ar bhaswakar..... Neta giri krne nhi aati to photo hi clik krwa...", "naagu4real": "Y ua Misleading people??", "pratik.bihari": "Dumbo!", "sandeepprajapati.s": "Kuch bhi hot bhai vote to bjp ko hi Dena hai puri zindagi", "hakuna_matata.nk": "So you're against triple talaq? What kind of a woman are u? Tumhe koi is tareekhe se chd jaaye na... To sara feminism jaag jaega", "vilen_4_you": "Drame bajj🤣😂🤣", "anmolhadpawat": "Medam jii bill me indian muslim ke liye to kuch likha hi nahi ha fir kyu gumrah kar rahe ho hamare bhaiyo ko", "cixhan_007": "Swaraji just let us knw. Which weed u are high on.... u dont look normal at all... Come on... the legitimate authors u speaking about never wrote any legitimate history ... lol your GK... anyways India is a tolerant national hence we can tolerate u also", "_ll_animesh_1213_ll_": "The target is \"INDIAN MUSLIM COMMUNITY\" ... Waahhh 😂😂 Salman khan, Shahrukh khan , Amir Khan , Saifali khan ye log to pata nahi kon hai fir jo bina dare rhe rahe hai India mai aur kuch bola bhi nahi CAA k against ... par onus of saving the muslim community is on @reallyswara the Superstar of bollywood😂 ... How ....? 😢 Sry ab itne sare log bol rahe hai to honge vo ... I dont want to go into details 😂😂😂😂", "goldy.singh_": "Pakistan channel par interview Dane wali Pakistan ki bhasa bol rahi hai pahle YouTube par iska Pakistan prem dekh lo", "sagartheseafarer": "Chal juthi😂😂", "boney_zz": "@reallyswara kuch nahi hoga isse jaa k nassiruddin shah k bhai ka interview dhek dumb girl", "the_mountain_wolf_": "Madam ji I think aapko pura savidhan by heart yaad hoga ???", "the_hot_fly": "God give her brains she is telling people that gov policies are a trap? She knows nothing about actual ruler development and problems and spreading fake news all together.", "rajput_amar_pratap_singh": "Muh se bda.....kaaan me ka pahni hai....aunty ...🔥", "aanchal.singh105": "👌", "sudhir.31dec": "जब दिमाग मे गोबर भर जाता है तो लोग ऐसे ही बाते करते है। दुबई मोरको घूम रही और बोलती है आपके पास कोई प्रूफ ही नही अपनी तरह सबको बेउकुफ समझी हैं।", "_kunaaall": "Pata toh kuch hai jahi aur aa gayi muh utha ke chutiyo ki raani", "i_will_hustle": "Randi Nikhal pakistan", "pku1002": "Ye Wrong No.. hai. Fake", "amrishnp": "U support triple Talaq . Wow !!!! Liberal ? Libtards.", "chaaaaqw": "#deshdrohiSwara", "ghumakkadmarathi": "kya problem hui agar triple talak hata diya toh 🤔🤔", "doc.husna_siddiqua": "Truly appreciate your views..u olwez rockkkk😎", "avi_abhishek_krishna": "Tu esi hi roti jaaa.. Hmee sukun milta hi", "abhiraj_ranjan_07": "Congress ki dalal bahinchoad 😂", "asli_ranvir": "Hii, Ma'am. Pls express your opinion about Kota, where more than 110 Children's loses their lives.", "mannatsingh2500": "Are yrr, ignorant and delusional", "rahulthakur3876": "You are another trickster bitch who is adding fuel to fire..🙏🙏", "bhatu_boss": "E bollywood se he bc inka sab kuch nahi chlta to ye ese chutiyapa karke apni publicity karte he or news me bane rahete he", "irahulag": "You have taken government and country's peace for granted", "shail_kush": "Tera desh nhi hai re .......bhosdi tu apne jaban se mere great bharat ka name mt le", "iam_anmolsandhu": "Shame on you for this hate speech. You are the one who's dividing people on religion basis. How much money did you get for this performance ?? Please read the CAA and NRC first. It's not to attack the Muslim community in India, but it's definitely to protect people who are in minority in countries like Pakistan and Afganistan. Seems you have no clue what happens to Hindu and Sikh women in Pakistan. They get raped and converted forcefully because there are no laws to protect them. You should rather go to Pakistan and raise your voice for such women/community who's suffering enormously.", "humah_khan": "@reallyswara you're the kind of woman that India needs! The way you stood for the oppressed,the way you exemplified feminism,the way you articulated the idea of secularism,the way you made and are still making your best efforts to restore the diversification of India, it's commendable! You're a fearless woman who commands respect, love and honour! Much love💟 Hindustan, Hindustan sirf aap jaise logon ki wajah se lagta h!", "rishabh_saud": "Don't spread hate, don't drag triple talaq mere khayal se toh woh women empowerment k liye hi hai baaki jo marzi ghaseeto or bhadkana wow ek hoti hai baat rakhna or ek hoti hai bhadkana yeh jo aap kar rhe ho ise bhadkana kehte hai toh please bolne se phele sochke bolna yahan pe public sunn rhi hai iska matlab ye nhi kuch bhi bol doge", "hitu_265": "Ese koi kam do yr", "anila3617": "Nobody give a fuck to a flop actress 🐖🐷", "rabiadem_": "PREACH 🙌🏼🙌🏼", "tejendra.rawat": "Kisne paise diye bolne ke", "shajzu": "🎩 hatts off", "a_y_u_s_h_g": "Ma'am, can you please explain to us how Indian Muslim is getting affected by CAA & NRC??", "nayeemshaik04": "nice thinking good persnality ur real heroine 🎉🎉🎉🎉🎉", "aayush_13_8_kasaudhan_93": "Isko unfollow kro...bs", "shivangi06_toro": "Jb koi army cheif ko sarkar ka Dalal kahe ...so they are anti-national...jb koi army se surgical strike ka proof mangye ga....so they are anti-national...jb JNU Mai khade ho kar naare lagye gye \"Bharat Tere tokde hogye inshallah inshallah\"..so they are tokde tokde gang...jb WhatsApp par teen baar talaq -talaq-talaq likh kar aurat ko chodye ga....so triple talaq ko scrap Kiya Jaye ga....faltu ki chiz logo ko khade ho kar mat smjhao....", "desiyatrii": "Nice acting.", "varun_300797": "Aaj pta lga ki aap JNU se pade ho tabhi india k bare mai itna sochte ho 😂😂", "sandip4275": "😂", "shweta1234kashyap": "The person like you, must have visited many countries , where did u see this happening?? Don’t try to mislead. If u don’t have capability to do something good to your country then plz don’t spread illness dat to just for publicity.", "iam.sohamroy": "Mam aiha Bengal me Hindus ke ghar jalaya ja rahe ha ....aur apke sirf Muslims ka hi dikh ta ha....wow....", "who_is_sanju": "देखिए मैडम , पहली बात \"भारत तेरे टुकड़े होंगे \" जैसी चीजें नहीं सही जाएंगी । दूसरी बात ये की भारत के मुसलमानों के लिए या भारत के हिंदुओं के लिए ये एक्ट नहीं है। ये है शरणार्थियों के लिए । लेने के लिए रोहिंग्या मुस्लिम्स भी आ सकते थे इनमे लेकिन नहीं आये । क्यों ? क्योंकि इनका मूल देश जो है म्यांमार वहां इन्होंने अपनी एक अलग आर्मी बनाई और वहां के बौद्ध लोगों पर हमले किए बिल्कुल वैसे ही जैसे अपने कश्मीर में आतंकवादी करते हैं । और कोई भी देश इसी वजह से इनसे डरता है क्योंकि सिखों से या ईसाइयों से पारसियों से तुम्हें कितना डर है आतंकवादी होने का । मगर रोहिंग्या से है । देश एक और झंझट मोल लेने की हालत में नहीं है । आप जैसे लोगों से ही निपटा नही जा रहा तो उनकी कैसे पहचान हो । अगर तानाशाही या फासीवाद जैसा कुछ होता ना तो इतनी हिम्मत न होती तुम्हारी की कुछ बोल भी पाते । तुम बोलते हो कुछ भी अनर्गल क्योंकि यहां कोई तानाशाह नहीं है । तानाशाही अभी देखी कहाँ है तुमने ।", "the_religion_universe": "Fake Aunty #jihadexposed", "whatdihell": "Dislike button de de re baba", "_chitranshayush_32": "Are you mad??", "bhavnasharma110": "Pls stop spreading hatred , people like you are the real threat to our nation .", "_imshahbaz": "😮we are with you bahen", "iamkamakshi": "Are yr itna prob h to y don't u go out of our country", "rajat.stomar": "Fake", "ghoshsrimanta": "Aunty ke bola", "mr_venom2.0": "Tujhe pata hey kya... kya hey CAA, aur NRC", "syedirfan3847": "👍", "sakshikasliwal": "stop misleading triple talak se har aurat khush h faisele se..Game h .Kys bakwas aurat h bolna h bus khuch bhi", "abhishek_8axena": "Behen ko laodi piche dekh rahi hai ki kahi se koi maarne to nahi wala", "hector_el_fathar": "Is bewkuf aurat ko triple talak galat lagta h", "binay_1994": "Swara Bhaskar support the country you live in or live in the country you support . Bitch please you better go to Pakistan . We support CAA, NRC and NPR . Fuck off Swara🖕🖕🖕🖕", "ramavatmilan": "Didi Jake ek baar bill to padh lo 🤣🤣 for kuchh bolo", "leo_portland": "People who support Afzal guru , shall we call them - Indian Unity organization", "shubham_poojari_": "NRC akhir kharab Kyun he batao jara swara ji tab manunga ki app bhi kuch padhai karti he", "mukesh7025": "Sharm Kar le thodi jinki bajah se tu femus hui jinki bajah se Tera ghar chalta h unke liye ye sab bol rhi h", "sana_sh_ah": "More power to celebrities like you speaking up! ♥️", "ashikasharma329": "Trp milegi abhi madam ko", "kapilbhau": "Yaar plz if you are not getting work mam please dont do such things to get in light ... Remember its was india which was invaded everytime neither any indian in any old civilization attacked outside its boundry", "samaira_diba": "👍", "priya3444": "You are illiterate swara seriously you are illiterate", "rupeshnazare": "Swara tu Randi hai", "77young_star": "Nikal lavde", "niranjan_singh_salodariya": "Kutti", "prajapati.bhavan": "We support CAA and NRC", "lionheart_nicky": "Chukiche karat ahat tumhi.. kontya hi indian muslman vr anyay nhi hot ahe.. ugach publicity sathi stunt karu nka..", "agypsyatheart_": "😂😂", "sugarplum_giggle": "Such people are only danger to youth ... Do not follow her ....", "abhijitchaudhari_": "Full support to CAA NRC", "dusejashailesh": "Yes one of the tricks is you 🤬", "gayatri__shah": "Ksi nei swara koh kuch bhi bola so kasam sie aaj hi mein hindu ban jaungi she’s supporting our community and we are here to support her .... india ka dusra partition sei Bcha rhi hai Woh and tum sab usko troll kr rhe ho ? Kya tum sab India kei constitution koh jante bhi ho ? Even padha bhi hai Kya ? Bdhe aaye usei troll krne .... #isupportswara @reallyswara", "proud.indian.29": "Pehli fursat mein nikal.. 🖕🏻 i support #CAB #NRC #PCB #UCC.. Ab jaake google pe in sbki pehle fullform dekhi jaaegi fir bina policy padhey reply dia jaaega.. you are the kind of girl who supports & shows vulgarity by saying women impowerment.. ghanta ✊🏻", "nysa.saxena": "I just don't get it that how 'triple talaq scheme' is creating hate!?", "kushabedre": "@reallyswara can you explain what should India do with illegal migrant from Bangladesh", "truedelitte": "Yeh aunty bina kuch jaane bolti rehti hai", "lovering_dany": "Hindu virodhi jihadi aunty", "azamshaikh411": "Proud of you ma'am. Other actresses are useless", "anchorsurbhidighe": "What bullshit", "neophyte.moron": "Kya chutiyappa bakk rahi ho?", "rinky211": "Shame on you miss jnu student, tum Pakistan kyu nahi chali jati ho", "manish.baluni": "ek number ki bikaau aurat. jo paisa pheke vha dumm hilaegi ye..", "mitul_choksi2002": "Kyu tum gandh fela rahi ho bija kuch jane", "doomplanet1": "Ye to baat hui CAA supporters aur CAA oppose karne walon ki.... Madam can you little enlighten the common man who is not involved in these and facing problems due to your so called peaceful protests.🤔🤔🤔 Ambulances are stuck in traffic due to your dear protestors pelting stones and petrol bombs👾👾 Internet is shut down due to which students are not able to give online exams and study. JNU ke alawa bhi colleges and school hote hain madam... They are facing problems due to your protests(peaceful😂).", "priyan_47": "😂😂😂😂", "itsme_love4u": "Dumb lady", "i_m_gurjar001": "Slow clap... aap liyeere....jab pta na hua kre toh kuch bola mat krooo plz", "naina_misra": "Lol", "farahmed3": "@reallyswara I applaud you for having the courage to speak up and support minorities.", "swarni08": "https://www.facebook.com/689159535/posts/10157776561629536/?sfnsn=wiwspmo&extid=XjknAQagk68diJRn&d=n&vh=i", "rohitroy2148": "Is she swara bhaskar Or swara begum or swara bhano. Jo isko itni chul machi hai", "manish_sharma0010": "😂😂😂😂😂😂😂😂", "_ve1010_": "Bina documents k passport kese bna @reallyswara 😂😂😂", "madeeha.ali.311": "Your smart", "ramesh.naithani.16": "Kaam nahi mil Reha toh yehi sahi!!! 😁😁😁", "swapnasisdas": "Aunty how is your finger...", "mehwishsiddiquei": "Mam i really appreciate your work towards humanity, and yes you prove that we're human first, thanks for the positive opinion of yours💕", "ajay_pirwani": "I support CAA and NRC....", "rssingh007": "Tu masturbate kar #randi swara.....tere bass ka nai hai ye sab", "e_xuberante": "आपण कोण आहोत आपला शैक्षणिक दर्जा काय आहे,आपल एकंदरीत कार्यकर्तृत्व काय आहे ह्याचा कसलाही विचार न करता सरळ मत ठोकून द्यायचा...just quoting Secularism,social fabric of the country and stating constitution in a rhetoric doesn't make you the gate keeper of public morality....these guys live in a fictional fantasy.. they have a trip of their own...wherever they find an opportunity to exploit they ll just reach there just out of sheer urge to strengthen their position as torch bearer of constitution...madam..let the courts decide the constitutionality of this act on its merit..save ur \"intellectual depth\" for the frivolous acting u do...just naming or colouring someone as a sanghi or communal cannot let u go away with the truth...this whole protest hysteria u guys have created is based on simple logic ..... GASLIGHTING....it's like a poorly scripted cliche movie with repetitive cast(Anurag,ram guha arundhati Roy jawed Sahab ndtv, aspiring -since- decades-student leader kanhaiyya,grey hair \"intellectuals\",some complusive signatories,and professional activists..and to substantiate ur fallacy take some Nobel laureates like amartya Sen, Abhijeet Banerjee).....I wonder when the SC will hear the matter in its bench and give its verdict on the lines of constitution...what will happen to your revolution...wearing Che Guevara T's and protesting doesn't make u revolutionary nor create a revolution....p.s: just exercising my constitutional right of free speech Article 19 1 (a)...", "archisensei": "CAA is a blessing . These people have just made it sound so anti Muslims .. Shame on such anti national entities", "sanjaygaur14": "Maata @reallyswara ji aapko triple talaq se bhi problem h, Syd aapne sahi hi bola tha ki , aap school ni gye ho degree ni h or na hi kisi trh ki education....... At least don't take those kind of good act in your dirty politics or should I say Fame machine", "abhishek_hippargi": "Fuck you", "mehta_siddarth": "I always thought hon supreme court decided if anything is unconstitutional or not and no one is guilty unless proven by law. Maybe @reallyswara is the new court and judge 😂", "i_mpm_2016": "@reallyswara are you serious? At least read the act before acting. You read the script before signing movies right? Have you read about the heinous crime on Hindu girls in Pakistan. Can you please explain how safeguarding them become anti Muslim law.", "rajeevranjansonu": "Are swara koi Muslim ke Ander dar paida Kar Rahi ho Aur kis chiz se ajadi dila Rahi ho Aur phir tum hi bologi muslim ko Sarkar Dara Rahi CAA kya h sab KO pata h aur NRC to Aaya nai to to kya sabit Karna chahati ho Aur NPR kya gov ko ye bi haq NAI ki wo Jane kon garib hai kon Amer kiske Pas ghar hai kiske Pas NAI ab TM log desh chaloge kya police wale ko blame Karne walo Kabhi Uske sath un pathar bazo ke samne khara rehna tab bolna aise video banana fame ke liye bahut asan h rati ratai bato pe wiswas Kam kare facts deke", "tinntoxx_soul": "Isiliye bade bujurg kehte, #padlo beta #", "awasthimradul12": "Didi lagta hai kabhi school nhi gyi", "lavanyas_closet": "Apko koi knowledge nai he.", "be__styled": "This lady never forgets to prove that she is an idiot😂😂", "shmbrm": "I only love to see sexy' you. Why indulge into boring politics things.", "piyush26102": "NRP कि शुरू आत तो मनमोहन सिंह जी ने कि थी और NRC तो अभी आईं ही नहीं और CAA तो नागरिकता देने का कानून है", "tanu_jahnvee": "...Get a real job girl..don't spoil the future of the young college kids with a half baked information..You will neither be an actress nor a politician ...", "kelvin___patel": "Yeh protest nai publicity ka chakkar he babubhaiya 😂😂😂😂😂😂@reallyswara", "sudhirdk1134": "राजस्थान के कोटा गई थी, क्या", "talatimtiazjanwari": "How you speak truth directly fearless I appreciate lot's of love from us", "vishwajithgowda_official": "Teri maa ki chuut....India se bhaag unpad aurat", "asmainsta23": "Outstanding @reallyswara", "bhagirathsinh_dodiya.9": "Nikl l*di pehli fursat me nikl... koi jarurat ny he india ko teri...🔥🔥", "dhruvraj_987": "Modi modi modi", "natureboy_navin": "This lady has completely lost her mind 😂😂😂😂😂", "baddude69": "I feel bad for those against nrc... Bekar mein gand jala rahe hain apne.. 🤣Bhonkte rho jitna bhonk sakte ho.. Nrc hokar rahega behenchodo😊❤️", "vipulthegreat": "Looks like swara is out of her mind.", "i_amshubhamsingh21": "Ye chutiyapanti krk kuch nhi hoga ma'am aur na kuch badla tha aur badley ga bhi nhi so please carry on chutiyapanti 🤣🤣🤣👏", "dhaval_raghwani": "Tukde Tukde Gang's Premium Members be like😂😂😂", "palashj021": "nikal saali ghatiya aurat... kaam dham kuch nh bakchodi krwa lo", "toyasiin": "❤️❤️❤️ reallyswara for showing courage for united India...", "op_bohra2008": "Infollow karo....", "deepak5741": "Ye to hai hi anti national isko to jarur Pakistan bhejo movie Dekhi hai Teri hasti hai to chudel se lagti hai ...ye India nahi hai Hindustan hai medum Jo chahti hai wo nahi ho sakta. Tu Chalo jayegi ye desh tab bhi rahega.", "impawanbagra": "Madam dimag m busa bhara hua h thore dino baad realise ho jayega don't worry or ha ye sab bolne se pahle indian constitution thik se pad Lena chahiye thha or uska bhi time nhi h to @payalrohatgi ke fb or @instagram post pd lete short jarur h but àapke mide ki missunderstanding dur ho jati or ha ye aap Jaan buj k kar rhi ho @publisitystund ke liye to àage pta chal hi jayega🙏🙏", "khanruhan_": "🔥🔥🔥🔥🔥💓", "nucking_futz_09": "Sahi m ....... Tujh jesi randi ne sahi likha hai..... Drammebaaz..... Tu hai drammebaaz behn ki lodi..... Saale khate yaha ka... gaate vaha ka........ Vahi apni maa chudvao na..... Vessa kbhi hua nhi hai naa... Tere saath... Jaisa........ Pakistan m hindu k saath hua hai....", "jia_usmani": "I’m Pakistani and I fully support your message. You seem like a very passionate and empathetic human being. More power to you!", "abdulmalik17__": "Be strong mam", "kanikafreespirit": "Please take a stand for the minorities suffering in Pakistan and Bangladesh.. And we know the difference Azmal kasab and Abdul Kalam.. you better concentrate on bringing peace to the nation.. such speeches will only add communal violence.. Normal Indian citizen can't afford it whether they are of any community.", "shete4177": "Swara: I want Passport Passport Office: Provide 10th certificate or Aadhar card or PAN card or election card or birth certificate or degree. Swara: I dont have any. Passport office: then who the hell are you?", "lunatic_svishal": "Fact ye h tht apko chaiye publicity😂😂 chizo ko smjho apno ko hi apno ke khilaf mat bharkao... Sudhar jao jitni jaldi ho ske", "tanmay_kore_1409": "वन्दे मातरम् सुजलां सुफलां मलयजशीतलाम् शस्यशामलां मातरम् । शुभ्रज्योत्स्नापुलकितयामिनीं फुल्लकुसुमितद्रुमदलशोभिनीं सुहासिनीं सुमधुर भाषिणीं सुखदां वरदां मातरम् ।। १ ।। वन्दे मातरम् । कोटि-कोटि-कण्ठ-कल-कल-निनाद-कराले कोटि-कोटि-भुजैर्धृत-खरकरवाले, अबला केन मा एत बले । बहुबलधारिणीं नमामि तारिणीं रिपुदलवारिणीं मातरम् ।। २ ।। वन्दे मातरम् । तुमि विद्या, तुमि धर्म तुमि हृदि, तुमि मर्म त्वं हि प्राणा: शरीरे बाहुते तुमि मा शक्ति, हृदये तुमि मा भक्ति, तोमारई प्रतिमा गडि मन्दिरे-मन्दिरे मातरम् ।। ३ ।। वन्दे मातरम् । त्वं हि दुर्गा दशप्रहरणधारिणी कमला कमलदलविहारिणी वाणी विद्यादायिनी, नमामि त्वाम् नमामि कमलां अमलां अतुलां सुजलां सुफलां मातरम् ।। ४ ।। वन्दे मातरम् । श्यामलां सरलां सुस्मितां भूषितां धरणीं भरणीं मातरम् ।। ५ ।। वन्दे मातरम् ।।", "rakeshsingh9392": "Tu tavayaf hai.. Waisa hi kaam kregi.. Kar kar.. Tavayafon wala kaam tre p hi suit krta h.. Laudi😠", "ux_pa1": "I really hope you read the laws first and then make such bold statements. Sitting here in Canada when I can be rationale and find enough reasons why it’s not unreasonable then you can too. Also, all my Muslim friends here do not see any problem with this law and btw the attack on nankana sahib by Pakistanis just proved this point. You & @faroutakhtar have some reading to do!", "sidhu_haier": "🤗😇God bless you dear 🎯💪🏻", "hemalvashi": "🖕", "yoyo_rajjadi36": "Tere ghar mai kabhi bhi shivaji nhi paida honge ....tere ghar mai kasab bhi paida hoga...bc", "vipin4910": "Hamko mat sikhao medam nafrat bantna band karo ..History bahut padhi h..hamne ..", "niteshchauhan171": "Swara you are stupid person... Plz Pakistan bejo esko...", "im_r4hu1": "😂 apne fayde k liye logo ko gumrah kyun kr rhe ho peaceful mind se socho behan 🙏 desh me unrest lane ka madhyam Mt bno...", "08_vikram_": "Leftist supporter ..jis jis k election me haati h usey harwa deti h ...😂😂 Bollywood me aakr yaha badaam kr rhi h image ko .. @varundvn @priyankachopra u both r my Favorite plz request expose her ..she is jus worst worst and antiindian", "king_shivom": "Is Sasti actor ko ye btao ki CAA Indians Muslims ya kisi ke liye nahi hai ... Jo India ka Citizen hai chaye wo Muslim ho Ya Hindu usko Is baare Mai Tension lene ki zrurt hee ni ... Be mtlb Mai Muslim suffer krenge ye wo backchodi macha rhi hai bc saali ... Act padh toh lo jaake bc video ya protest krne se Kya hga ... Agar koi baat rkhni hai peaceful protest kro for act .. Hindu Muslim Kya laga rkha hai madarchod bhadkaane aur ladai se kisi ka fayeda ni hai ... Baat smjho fir kch kro velli bkl nikal padi bakwaas chodne.... Who have Indian citizenship who any documents that can prove they are Indian They don't have to fucking worry about anything... Fir kyun ye kalesh .. #IndiaSupportsCAA", "rajatism": "fakeswara_velliswara....someone please give her any project otherwise she will keep on spitting everywhere.", "mastpandit4u": "@instagram This guy suspected as spam.... 🐖🐖🐖... It'll be harmful and inconsiderate for our culture and environment.. Is bahan k lode #suar ko remove from insta.. This type of person very harmful and also a part of #terrorist.... #suspected spam......", "rajni.yadav.9277": "Anpad", "krashu.sharma": "lgta hai aunty ko koi offer nhi mil rha h bollywood me", "nishit_nirgudkar": "Aur haa suno apke pass swar to nahi hai lekin nam swara hai besuri bharat me muslim agar target hota to inki population kam hoti badti nahi aap jese bade log hi samaj me zahar failate ho besuri bhaskar @reallyswara", "shashank_shekhar_shrivastava": "Iss desh ki sabse badi pareshaani batabdu madam aapko.. ke freedom of speech ke naam par tum jaise log aake khule me bhadkau bhashan dete ho aaur shanti se ghr me baith jaate ho aashanti faila kr.. Hindu muslim ki baat nhi h iss topic.. tum triple talaak ki baat krri ho.. sharam ni aari. Ke jo aachi chz h usko bhi hindu muslim krri. Aagr tum padhi likhi ni ho dependent ho pati pe aaur wo uska mann ni krra krke talal talak talak bolde..aaur uss aaurat ki life khab krde ye chalega tumhe..aare sharam kro.limelight me aane aapna imaan to mt becho.. BJP aagr kal bol degi na saaf suthra pani pio to tum usme bhi khade hojaoge ke.. yee bjp hame baatri h hame naale ka pani pina h yaad rkhe saare.. Tum baaki bhayankar bewkoof ho @reallyswara", "thakur_saab.khangarot": "https://www.facebook.com/105503167477315/posts/172630997431198/", "sajjadmaxahiri": "May Allah grant you more courages for fighting to save Constitution.", "anjum9144": "👍🏻😊 Keep it beta", "lucifer_rofocale": "@reallyswara 3rd where you were , when Kashmiri pandits were exiled by their home their cities and their edifices , I haven’t seen any protest against that activity, no condemnation no brutal protest , no exertion of people’s force to give them justice and you are talking about nation and its threat , where you were when 90000 rohingya were intruded in Kashmir and they captured the Kashmir like its their own property , if you have a true soul ask you self that are you handeling the situation with egalitarian mindset ......!!", "jitu_573": "Naksalwadi swara jaise Bollywood me he jo muslims ko badkane ka kam kar rahe he hindu k khilaf , mera srhap he tuje sali tere sath bht bura hoga", "sharma.tejendra": "I support.... No 1 has right to enter inside boundary illegally...and even u can't do this... y u go with your passport and Visa to any other country.....?? Pdhi likhi orat", "itsabhiabhi": "Dear Swaran Bhaskar Your mom had 3 Kids. You all have different dads. Your dad has 4 kids, 3 of you have different moms. We know for you it was a f*cking nightmare growing up and trying to explain it to people. You hated it and now you are so embarrassed.", "er_ashoka": "सस्ती लोकप्रियता पाने की कौशिश", "monu.dangi.927": "Oh bhai brut india kuch pakistan ka bhi bta de wha khy chl rha hain sikkho ke sathhh", "swapnil.k.singh": "Chal farji", "sambhaji_agalawe": "Tu Chali ja Pakistan me. Tabhi samjegi Hindustan ki constitution kitni achhi h. Ha kisi actor ne kam dene ke badleme ye kam tumse karva raha h,to karo,. Magar Desh tumhe najarandaj nahi karega mam.", "manojshenoyp": "Tik Tok heroine 🦸‍♀️", "ramanjassal85": "👍🙏", "harshsinghbagiyal1234": "You are shit. You get it you are shit💩💩", "vicky.tak": "वैसे अनपढ़ मैडम स्कूल देखा है कभी स्कूल, यूनिवर्सिटी तो बड़ी दूर की कौड़ी है 🤣", "surana.abhishek": "Berozgari ke side effects 🤪🤪🤪", "naresh_prajapati31": "Sab lage pade hai desh ki maa-bhen karne ke liye...... itni aazadi hai, itna democratic desh hai or kya chahiye ?? Pehle samajh to le CAA and NRC hai kya !!! Bewkoof..... now India need #kimjongun as next PM 🤣🤣🤣 fir milegi sabko bara bar aazadi🤪🤪", "vishwajeet3783": "Brave", "sibasis_1986": "U are such a waste and danger for society. People like u should be deported immediately regardless of how many documents u have to prove ur nationality. U r useless as shit. 😠", "sujeet.suman.7967": "Caa ko lekar pagal ho gaye hai ye😂😂😂", "itisbegum": "Sub game Narendra Modi karraha hai ,unku nikalo seat pe se", "pristineluv4eva": "https://www.facebook.com/groups/105486842865698/permalink/2691358177611872/", "yash_a.24official": "Chutiya mat banao... Hum bhi Congressi h", "tanmaydas412": "Inko to apni dookan chmkane hai, dookan chmkane ja soak hai poor people ke help kro achhe kam krne se chmkte hai. Kya kiya apne bollywood actress ho paise hai. Sdk pr poster leke desh drohiyon ko sport krke tukre tukre gang nhi khege to aur kya. Jay Sri Ram 🇳🇪", "vaid_shiv": "Tujhe unfollow krna padega kyu ki tu ab politician bn Gyi h , achhi actress to tu h nhi politician bhi achhi nhi bn payegi 👎👎👎👎👎👎", "main_albeli": "Hello mam!! Big fan....kitta accha bolte ho aap...actually amit shah ne NRC amendment,rules n drafting k bare me hme to clear kch btaya nai h....agr aapko btaya h to plz details share kare.", "arzaiaman": "Full of energy ur really amazing with sheila rashid omar kanahiya jignesh owaisi ravish barkha dia etc", "shaan_2800": "Jhutha propaganda faila rahi hai, behn thoda to sharam karle, padhi likhi hai ek bar bas ek bar bill padh le, kuch paiso ke karn aur kitna bikegi?", "majid_matter": "Brave girl. Love", "__aryan_mehta": "Brave🔥", "mahendra_jat_1706": "Bhadvi aurat isse kaam nahi milega tujhe kalank hai tu aa thooo", "mohkashif": "Excellent job! Keep the flag high...👏👏👏", "rahul_thitte": "@reallyswara most of the flim industry Actor actress are completely against of this bill but why they can't express their though on this bill you are the only one actress who is standing in the front of the people . Where do you get this power my most of the friends work in a marathi film industry but those people are scared to open support # is this namdev dasal thoughts effects on you??😜😍🤗😎", "kanishka3005": "Do you even know who filed the case against triple talaq? Shayara Bano ( Muslim Female) filed the case against triple talaq You need to get your facts clear instead of saying anything in public. Nrc is not even drafted and CAA has nothing to do with Indian Muslims. Read the act first carefully and then share your views.", "salman_khan1206": "U have given me that knowledge which I was never taught in college thanku so much", "_aditya_pro": "Wanna suck my dick swara😘", "deepak_chattwani": "#isupportcab #isupportnrc", "chaudhary.alpna0001": "u r shitttt @reallyswara", "samippatel111": "Nope the real target is you", "mayur__gupta": "Waisi tere 4 followers the.. unko bh ghatwa de..", "avantikarathour96": "@reallyswara aapne jitni history odi hai dikh raha hai hme aap sirf jnu ke pli hui desh ki gaddar hai bs jo bollywood me to kuch khas kr n payi ab chli hai apni rajniti rotiya sekne par aapk guru kanhiya kumar ko jab logo ne unki aukaat dikha di to apko bhi dikha dege", "khambonikhil": "Chal nikal bc 😂", "babita.chauhan.313": "Film to milti nhi...yhi krna h fir", "saiejalgupta": "I legit love you.❤️", "vidhhiiiiiii": "So now you’ve problem w triple talak as well?", "yesmritunjay": "Madam ko fame chahiye", "_npadhiyar": "Jo maa'm mama's kar rahey vo sabko good news mil ne vali jo isko bol rahey hey vo sab ko kuch acha milne vala hey 😂", "the_undergroundnews": "🔥🔥", "________abnishsinghrajput": "Randi sali", "doll_e14": "Tera muh dekh K sau jutte Marne K man krta hai tatti shakal and akal wali @reallyswara", "er_r_d_r_gurjar": "Jake bollywood me kam kro sahi rhega ... political me mat pdo 🥺", "mani_monk": "🙌🙌🙌", "ankitapurohit_14": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "pankaj.6708": "Beautiful", "mishrrra": "Shukra hai bharat me rehte ho aap...kisi aur desh me itne overconfidence se jhut aur afwah failate to abi tk to tukde kar k kutto ko khila diya hota logo ne", "prashupointofview": "Gawar", "shruti92k": "Slow claps to you idiot 👏👏", "ajittarade": "Lol", "sbspbr": "❤️", "teli1979": "Na proper actress na proper knowledge.Ye water proof furniture ke jaisa Insaan hai sawra AAP,bahar se fine andar bhusa hi bhusa.pehle NRC padhiye fir usko samajiye n aap Ko acting me role nahi Mila to Big Boss try karo but bakwas try mat karo.other wise u will end up being another Rakhi Sawant.no one from Indians is gonna be harmed,what may be religion he or she follows.", "siyapa_house77": "Proud of you🔥", "wasee_25_05_97": "Appreciated 👍 mam", "vichareashish": "Yeh hoti kaun hai ? Isane kya sikhaya Charam Sukh , isko pucho Problem kya hai ?", "nikhilpatare": "Now iam unfollow u....", "faiyazali.khan": "Needs Guts....", "_._banjara_._": "❤️", "lohiaanurag": "@reallyswara agent of.......", "_ananyakapoor98": "What is wrong with triple talak being abolished?!! Muslim women were so relieved by the judgement", "chum_square": "With you we stand 🙌🙌", "akki_kumar12": "Phir aa gayi pina pade kuch sharm hai", "avinash_kumar_raja_007": "Ye attcak hme pashand hai", "farazzaman": "@reallyswara I have tremendous respect for you Swara. Sadly my name would be seen by most a reason I like or support your views but quite honestly had I even been a resident of someother country having nothing to do with India, I would have still had so much respect for you. Its the simplest thing to keep ones mouth shut and carry on with ones career and earn money as it doesnt directly impact you. What you are doing is truly remarkable; jeopradizing your own career and taking a stand for what you believe in is not everyones cup of tea. Immense respect 👍🏻", "harshali_022": "kam chunlo phle acting yaa neta ggiri??", "siddanthpatil": "🖕🖕🖕", "alfaaz_kuch_ankahe": "Tum ab kuch bhi bologi?? 🙄", "mr.arvindboss": "We support u @reallyswara . Great job . Ye kya nikalenge phale khud garibi se nikle.", "rahulsemwalddn": "Brave Heart.... Keep trying to put the voice in front of masses and intellectuals otherwise, these tyrant people will collapse the Nation. Evidence are there, you know better I think....", "hiteshpathak88": "F##k you kaam nahi mil rha to kuch baskwaas hi kar lo", "amarmishrra": "@reallyswara ji aap Muslim ko itna nicha kyun dekh rahi h. Humlog mante h unko achi facilities nhi di gyi dono government ke side se bas vote bank ke liye unko use kia gya h. But aap toh mat unko miss guide mat kijiye sirf attyachaar unpe hi hua h, hindu pe bhi hua h. We as an Indian wana build good environment in our society and need to discuss every laws and act.", "x____winnie": "Chup chutiya😂", "kk475678": "@reallyswara .insta p verified account hai tera or BC logo ko chutiya bana nhi ki tera maa baap kaha paida hua kisne kiya tera pas koi documents nhi h BC orat tere se jyda saram red light wahi orto hota BC suar ki olad", "skkdesi01": "And what you are doing .. spreading hatred among Muslim for the rest of the Indian community ???", "pasta_jihadi_": "Whatsapp University se parke jab koi facts deti hai. Tabh aur koi kya aashaye rakh sakta hai?", "roops_shaikh94": "Well done....❤️", "leelaputrapramod": "so much love and respect towards you. thank you.", "amazingazhar9": "Swara teri HIMMAT ko LAAL SALAAM .LAL SALAAM 👏👏👏. Tha k u swara for the efforts. History will surely be kind to you.", "nourel82houda_": "💖", "markbennington": "🙌🏼❤️", "gujjaryogeshbhati0007": "ye ladki ek number ki mental h ye attention paane ke liye sab kuch kar rhi h nhi tho isko kon bulaega programme flop actor tho h ye", "rajeshchilhate": "You are so much sick , I am unfollowing you , right now right now", "pokhraj.roy": "@reallyswara Thank you. ♥️", "vikki_mandloi_": "Yeh kon he ? 😶 Bollywood me toh inhe kabhi nahi dekha 😂🤣😂🖕", "ahmed.avais": "Stay strong m'am🦸‍♀️", "umaima_nevrekar": "👏🏻👏🏻👏🏻 @reallyswara 💕", "thoduvail": "You are right in saying the partion as an idea was initiated by jinnah as he wanted a Muslim state and never agreed to an unified India so as the matter was related with faith Hindu mahasabha was involved ,but as you know when Pakistan was declared a Muslim state India was asked weather it wanted to be a Hindu state and The Hindu mahasabha agreed to the thoughts of Ambedkar and thus India was declared a Democratic republic.If the Hindu Mahasabha had a ulterior motive they could have asked for a Hindu state as British government created it to the very purpose of protecting Hindu rights under the morleyminto reforms", "sammy_naa_": "In love with u @reallyswara ❤❤❤", "pranavgadhiya": "E SWARA chal pehli fursat me nikal", "_nuhman_km": "👏👏🔥", "kiran124421": "Teri gaand bahot Jak rahi hai Pakistani aur Bangladesh I Hinduon se... saaf dikhraha hai😊", "abhi.abhijeetnikam": "Swara ji aap court me case kyn nahi file karti apko haak hai wo. U have right's.why r u behaving like child.", "satidass": "Kejriwal warmed us all particularly the INC and the other opposition to be United and stop BJP coming to power again else, Modi will make Shah as HM and there will be opportunity for them to change the Constitution. Today it's happening", "healingailinghearts": "👏🌟🌟🌟🌟🌟🌹🌹🌹🌹", "ru_ggn": "This lady is Soo poor . Now I know what it means to be beauty without brain . She is trying to impress her Khan bosses and boyfriends in bollywood. She knows nothing about India or Indian Constitution", "aghaz_anwer": "MashaAllha sis😍😍", "ijharmo": "Jisko mam ki post se jalan hai wo dur rahe apn Gyan na bate", "garganand": "Are you in favour of triple talaq or common civil code please about it.....", "noorsahni786": "👏👏👏👏", "verma100ank": "Madam ready to fight next election", "shoaib2012ansari": "Brave Girl...Swara Bhaskar Allaha Apko khush rakhe...!Aur apki ye sach bolne ki himmat ko barqarar rakhe.Ameen", "mahendrapatrey": "ALL the Best Swara mam 👍 I support you 😊", "vernikasharma13": "Chutiya hai tu 😊 actress tho chali nhai tho ab sale musalmano ke topic par attention seek jar rahe hai. Chal Pakistan ja mere India se nikal randi", "mk707012": "Naach awe agan teda", "shubhitr": "Ma’am, keep yelling. Nothing will change. They did what they have to and the likes of you have no importance beyond Instagram and Twitter. Vo khel gaye, aapne kya kar liya? Leave it", "laxmi.gautam.165": "My full support you mam👍", "nashra.hashim": "@reallyswara More power and Love to you", "paritv79": "Well done! India needs people like you to raise these issues and speak out 👍", "sabastihandique": "Well done mam.", "nitish_chanial": "Hello mam you doing protest against the modi. Hello Mam one thing I tell you Congress never did anything for people congress always against the Hindu and you also against the Hindu. This rule in every country do know mam. Now you come out and doing protest. When 4 boys did rape of one girl, 130 kashmiri pandit killed in Kashmir then we're are you mam one day you sad that I hate Hindu when they did protest against the padmaavat. Now Muslim are doing to much protest, throughing stone on Police and so on now but is opinion about musical and know your opinion is Hindu bad and Muslim is good. Mam I am in Dubai they also have this type of rule it is also Muslim countries but they are educated people not like you mam.", "deepakbhaiyani": "Aapka sage vala neta har gya tha na BJP ke samne .mene dekha tha aapko prachar krte huve.. Bura laga hoga abhi aap apna wohi gusha nikal raheho.. Baki aapko desh itna pyar hai to sabko bolo santi se virodh kro..", "singhv21": "Can you say some words on Nankana Sahib.", "mehak_rapunzel": "I'm confused Swara. What's wrong in abolishing triple talak??", "dazzling_saku": "Really proud to hv stars lyk u in industry u r not only Bollywood star but now u r becoming real lyf star", "md._shane_alam": "Bahut khoob mam, very good, you are great👍👍", "anirudhdaga9929": "Use Your Fingers 🤣", "vikasvats26": "Sar gyan bas jnu ke Students ke pass hi hai.baki sab to aise hi time pass kar re hai", "kabir.thakur": "The Target is Illegally residing people as per the govt...and also the suffering minorities...", "_izyaan": "I support uh ma'am", "dhiraj4006": "Bad acting👊👊", "_sav_rana": "@reallyswara can’t call u even bimbo", "harshadamanohar09": "Absolute respect for you lady! ♥️", "imran.mujawar": "Stay strong on ur stand 👍👍 we all with you 🙌🙌 lots of love and respect for you @reallyswara", "naushhhin": "Thank you ❤️ for your support", "dinesh.duggal.50": "So true", "rawat_priyanka91": "we support modi ji... #namo #supportmodiji", "pagal_jokerr": "We Indians support u Maam @reallyswara", "bhawnarath": "Swara the country has gone through a lot don't add fuel to the fire.", "ahirsuresh96": "Ye bjp ki B team hai...ye chahati hai ki abhi 18percent hai tabhi ye logo ko ukasake anjam tak pahochaya jae....isliye ye chaal samajo....", "mittir_ani": "I envy the strength of your spine. More power to you.", "fareed.iqbal.35": "U r great mam we r with u", "okvinaytiwari": "Kaam nhi mil raha bechari ko ..Berozgaar", "zeeshan.ul.haque": "👌👌👌 wow", "sshaikh700": "❤️❤️❤️", "almighty_sunny_": "Ye galat logo k yha paida ho gayi thi shayad eska nam Swara nahi Shabana hona chahiye... Madam aap jake pakistan me Rajneeti karo aapka future wahi bright h bollywood me apka kuch nahi hone wala.", "ambaladude": "Why dont you just leave this country and go to pakistan bitch", "namo300namo": "Aapko kaise thode knowledge and commen sens ki jarurat hai..👍 #isupportcaa", "chandra.anjali_rosy": "reallyswara Kya nafrat faila rhi ho logo me! Kya triple talaq law lana galat h", "imranpasha.sg": "Brave lady ! Salute to you", "yadavtapas": "Ohoo \"gotty\"", "onlyfouzia": "👏👏👏", "putts1986": "Oh god.. so dumb this woman is!", "rodebmalya": "😂😂😂😂", "be__fitforever": "Swara g aapke lye dil se respect baldgaye and when it's come kisi k baap se nahi darna toh aap sab se actress agay baldchoki ho ❤😘", "sh_atul": "So u r against triple talaq also..irony being a women ..flop in every field", "sushil_modiwale": "Are madam aapko Momedian Samaj Ke Log India ke bare mein balapura Kahate Hain tab kahan Chale Jaate Ho Bharat Tere Tukde Honge yah tum jaise log hi Kahate Hain Uske bare mein to Kabhi bolate bhi Najar nahin aati kya baat Karoge Soch Samajh Kar Baat Kijiye madam Padi likhi dikh rahi ho Fir Bhi Anpadh Ho Afzal Guru Tumhara Kaun Guru hai kya Soch Samajh Kar baat karo", "sandy001.pal89": "Pehle jano phir bolo", "142yash": "❤️", "kravkash": "Shukriya gyaan chodane ke liye. Or Minorities ko chutiye banane ke liye 🖕", "shamli_reen": "Good going @reallyswara for making the shout when entire bollywood has pledged silence 👍", "ashish_dalal69": "Madam ji limelight mein aana chahati hain.", "reachkgs": "Hahaha go take a walk. All historians were congress funded. No more lies. You tube has all views. See videos and know all. Congress is a liars party and all beneficiaries are busy protecting them", "ubuntomathur": "Block it", "photo_ki_dukan_": "🙏🙏🙌", "rakratod12": "@reallyswara itna caa aur nrc ke oppose kar rahi he tu jab kidar thi jab 26/11 uri attack hua kabhi to Indian army ke bareme socha he kya unke liye kuch kiya he kya movie me chance nahi mila rahe he aba isakeliye paise mila rahe kya..", "prasad_bhatmurgi": "Its not about Congress-BJP, Hindu-Muslims, its about India. You are the one who is creating hate environment, trying to divide soceity and pointing fingers to others. Its disgusting to see how low you can go just for the sake of publicity and footage. Hope you Get well soon", "jatinbillionaire": "Kuch galat ni ho rha Sab Sahi hai bas soch ke bolo", "tejas_khomane": "She want more attraction that's way she opposing the CAA .", "foodie_sapiens": "Pakistan ki agent swara bhaskar", "parteek_agg1989": "U r wrong madam pls don't do this type of wrong myth", "manav.rohira": "How is it an attack on the constitution when the bill has been passed with the correct protocols that are to be taken ??? You are funny af😂😂😂😂", "jaindharm": "Jis din bollywood wale desh ke liye sochne lag jayege ush din public samaj jayegi abhi bollywood walo paisa fan aur movie padi hai zameer bech diya hai koi bhi bollywood wala CAA NPR NRC samajne nhi chahta ye sab ladana jante hai 2-4 desh bhakti song aur movie karne se desh bhakt nhi banta public samajao kese desh ke liye CAA NPR NRC sahi hai", "mohdhamza000": "❤️❤️❤️", "ritesh_tripathy": "Itne log kaam dhanda chor k protest krre hai..So nice to see this. Are all of them the same people jo bhai k movies first day first show dekhte hai?", "ahtesham_azmi": "Beautiful Swara ...", "svraut9": "Proud of you Swara because your stand can spoil your film career but you still go on fighting. Hats off to you 👏👏👏👏👏", "neetusingh3955": "🔥", "ravishuklalive\nVerified": "Verified", "ha_m_vhi_hu": "Na bahan ko kuch PTA h or krna b kyu hi h..... Blind crowd mil rhi h to bs bn jao hero(vese trick di ki achi h) movies m Kam na mile to yhi acting kr lo Kya frk pdta h", "jibril_latifa": "God bless u❤️", "abhijeet.mahto": "Swara ji aapko dekh KR ye ye pta Chl gya ki India angrejo ka gulam q tha aapke jaise logo ki wajah se", "pandit_rimi": "Hindu...hamesha Muslim ko support karne k liye ready rhete haa, but Muslim Hindu ko support nhi karte.", "whoisteyak": "Proud of u mam", "sid_milaq": "🙏❤️", "_dr.umrakhan_": "More power to you @reallyswara", "_blahablah_": "Hats off Swara! It takes a whole lots of guts and you've proved yourself unlike other darpokkk celebrities! Proud of you! ❤", "amir_khan_a_star_official": "The volunteerism u hv shown for defending the foundation of our constitution as well as nation of 130 crore of us is praiseworthy...We Support u & we r united against their brutality & dictatorship...##Halla Bol Halla Bol(non-violently)##... ✌️✌️", "deepakyadav00777": "Hutt Hutt BJP 🇮🇳🇮🇳🇮🇳JAI HIND", "kayyum_shaikhkk097": "proud to be an Indian🇮🇳🇮🇳🇮🇳😘😘😘😊@reallyswara thanks for stand with them.we love u 😍😘", "drx_apothecary": "Keep going ❤️👌", "__mr____manhas": "Totally fake log", "mohammad_naqi12": "@reallyswara i m with you #nocab", "aishoaibfarooqui70": "Bhaag bhaag bhaag swaraa aayi swara @reallyswara .. u go sherni🙌🔥", "saitanic": "Ek hi target hai Swara ka career swaha karna🤣🤣🤣🤣", "mannu_official_07dz": "Great work mam hum sab apke sath hain 💓💓💓 hamari ek himmat ap banrahe ho thank u soo much", "alone__730": "❤️❤️❤️", "iamgurleen_kaur": "Mam I am so proud of you for doing this..❤️", "xhaikh___sufi__": "I love you swara didi aap bohat ache ho full support hai aap ko insaallah aap jo kaam kar rahe ho bohat acha hai desh ko ese log chaye bohat acha. Dil se love you", "af.lov3": "I was conversing with my brother about why stars who are so influential don't speak up about what's right and what's wrong. You are a prime example of somebody who has not lost their integrity, you stand for justice, and not the vested interests of the feepayers or cinema goers- and that takes courage and an INCREDIBLY strong sense of security in yourself and your beliefs. Hats off to you kasam se!! 👌🏽", "quratulainimam": "Applaud! 👏", "preeti6771": "Swara pls don’t mislead the people, you think what you say people will believe coz u are a celebrity but mind you people are not fools like you, just do your job of acting & don’t teach others what they need to do.", "wahids993": "Good message to be united.. BJP IT cell ko mirchi lagi hogi.. they vll troll for their bread n butter.. dnt not give up.. 👏👏", "gousiyaaaaa": "🔥🔥🙌🙌", "brij3ish_": "Shut the fcuk up !!!", "zebadanish": "👏", "desainehaa": "Do you really think triple talkh was not a good decision?? You are insane illogical illiterate and disgusting woman...", "nk2601": "True... u r doing this best ! #indiawithcabandnrc", "akashbanerjee.in\nVerified": "Verified", "akshayraj111": "More power to you Swara! It’s amazing to see some of us who find ourselves responsible and eligible to fight for the idea of India and fight to protect the constitution. We love you and keep inspiring us. 🙏🌟", "nferhin": "It's amazing to see your will power❤️ You will always be in the heart of good souls. More power to you", "sibgatullah_k": "❤️Dil Dil hindusta", "himanshuchikkimehra154": "Nikl la#@# nikl☝️__ 👉", "heelshealthandhappiness": "So much power to you", "moeesh_ansari215": "You're so strong lady....🙌🙌🙌🙌", "i_am_a_stormborn": "Thank you mam 🔥 for fighting for the right . Huge respect and love from jamian family ❤️", "brandon080w": "Shut the fuck up and sit back home", "devilmaster646": "We Love you❤️ THIS GIRL HAS BALLS TO SAY THE TRUTH #Respect #YeLADKINahiMARDHAIIII", "messsssiiiii1010": "❤️❤️❤️🔥🔥", "vikas.tyagi.39794": "Abhi aap rajniti me aana chati ho, pataa he, but iska MATLAB ye nahi ki kuch bhi,,, bolne Lago Kahi bhi,, MATLAB kuch bhii,", "shif_senorita": "I love her , very well said. Thanks @reallyswara ... Keep it up brave lady👍👍"}