{"sanjaymehta__": "😂😂😂gazab", "bhati_bharath2000": "Jai 🚩 Ram🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "_outlier_s_": "Tu hijdi kutiya randi hai", "iam_amitsoun": "Bhadkane ka kaam na kare", "ribhu_prabhakar": "Where are you today ... Head constable martyred.. why no voice.... hypocrisy to the core", "rushabhkulkarni99": "U are a piece of shit .. #democracy #freedomofspeech ... And fuck Deepika too", "kunal_8615": "Jo log. Qpni maa ko. Apne ghr na rkh kr jnu m rkh rehe hai unsee ham kya umeed krege 😂😂 #deshdrohi", "akshayraj0722": "Chutiya desh drohi", "patilprajaktakrishna": "Bhonk aur bhonk gaddar deshdrohi", "mahen2570": "Two words say on HALALA .phir dekh kya hota he..", "jay_pratap_singh_royl_army": "Acting karne aayi thi roti nahi sake payi too app too great politician bnn gayi wah re app jaise active politician", "sumeet7714": "Chor sala boycott all movies of swara", "abhishek199517": "Iski baat mut suno iski life set hai aur dusro ki Zindagi jhand krney ma lgi hui hai", "prabha_m67": "Kashmiri pandit ke topic pr bhi bolo kuch awara...", "rekhapathak862": "Wht is happening.", "bharatmaakaveer": "Vibrator queen 😂", "ishwar_patil_ingle": "😂😂😂", "pradeepchoudhary966": "😂😂😂", "omkar.bharat.sangale": "Free education free electricity free busfare😂😂😂😂😂😂people are going crazy 😬one day this will make our government bankrupt", "sauravchauhan74": "अफ़ज़ल हम शर्मिंदा रहेंगे क्योकि तेरे कातिल हमेशा ज़िंदा रहेंगे।😂", "mustak654": "Ap ko kia bol k sukria adai karu mam... daesh k leea age ana k leea bohot sukria mam❤️❤️", "thebaddybisht": "Desh drohi saali", "laddusaurabh20": "BC", "mehuldave999": "Swaraji Kashmir ke pandito ke liye bhi kuchh bol do", "pl_singh": "Inn sabke raste lag gaye thank u #amitshah & #narendramodi", "praveen_s_sahu": "Leave this swara .... Bastard girl ....who support tukde tukde gang..... She is have money by underworld", "sakshamsalwan": "Flop actress seeking fame @reallyswara", "s_punnit": "Kuch Talent k dum pe star bante hai, kuch Nepotism se, and kuch ese bhi hote hai jo politics kr k limelight me aa jate hai. Kuch Actors flop hone k baad hardwork krke comeback krte hai and kuch flop hone k baad politics. Farak itna hi hai. #ReallySwara", "shivabehl001": "Your parents are still studying in JNU?", "vivekjais1210": "Goli mar do sahin bagh walo ko Pura dilhi disturb Karke rakha hai", "pnmukh_1": "Tu wo rndi h jo cutmullo ki lund chussne ki aadi ho gyi hai", "digvijaykaushal": "aatankwadi samarthak sali...bhaskar.......tere se jyada to Dainik Bhaskar ka price h.......do kodi ki londi......", "ronnyyy_11": "Abhi free hand mil chuka hai bachke rehna sickularist @reallyswara", "jaysahu018": "@reallyswara tu madharchodni h kon ho tm yrr koi tumhe janta bhi or NRC Nd CAA kya h pata h tumhe jo yeh drama krrhi ho. Or yeh Nagrikta kisi ka nii chin raha balki nagrikta de raha h. So plzz jake sbse puch lo firr drama kro BC🔥", "mukesh7025": "Tu jnu ke peeche lagi rah bas aur koi rahega bhi nhi Tere pass ab", "mr19062": "Its disgusting n shameful that small kids are used in shaheen bagh protests..bunking schools..they say modi ko hatana hai, caa nrc wapas lo..nonsense..why dont these super intellectuals talk abt this? Why dont they oppose this bad practice?", "jit.suthar.359": "Terriost😂", "cutbead": "CAA संविधान विरोधी है आर्टिकल 14 पढ़ लो. Sc ST obc आदिवासी और दलित माइनॉरिटी का. असम में 15 लाख हिंदू का एनआरसी मैं नाम नहीं आया. उसमें 95% भारत के रहने वाले हैं. अब उनको विदेशी घोषित करके नागरिकता दी जाएगी. तो इतिहास चेंज हो गया. आरक्षण नहीं मिलेगी #हर_शहर_शाहीन_बाग https://t.co/RNYczVMgIs", "sonukumarsonukumar640": "Swra Tu hi hai sabse badi dogli orat jo tu bhi", "mishreesgohel": "i think slowy n gradually u r making ur way to politics by doing all this shit..", "kritikaraivats": "Better take away funding from them because they have all time in life to sit on road and protest and use it for animals welfare start up oprhanage and old age home and family of soldiers who sacrificed their lives for the nation", "im_prakul": "Aao haryana m kbhi protest krne.. Welcome k lie dande taiyar h gaand Or muh ek jaise lgenge tum bhadwo k", "wild_heart_31": "U should've been beaten as well", "sotisurti": "JNU students have turned into leeches, they are sucking India's money and time. As always Pakistanis are happily promoting anarchy in India through fake twitter bots. Our enemies are lucky they dont even have to step inside our boundaries to cause troubles. 🔥🔥🔥", "ranvir_thakur_1": "Kitne paise mile ye drama karne ke liya agar koe kam ne de raha tha to ek bar govt support se he keh dete hum sab itna to donate kar sakte the ke app ko ye sab sab na karna pade appne apne bio me likha ha drame bazz and a kid really mam you are still a kid and dramebaz", "sarvesh.dot": "The celebs should not seek out to opinions without having a proper knowledge of what has occurred rumors are dumb spread by dumb people it is our responsibility as a society to apprehend the real criminals and you as a celebrity more so to not provoke protests", "ps.bhardwajsharma": "Depika ko bana diya fifika.", "cccomeflywithmeeeeeeeeeee": "I think she has a better plan than modi", "urstruly.pranav": "Shame on you are traitor @reallyswara all india people are support #CAA and #modiji why are you Opposition of traitors but modi is modi he is tiger and #God_of_india he is best prime minister of the world so Understand that so is good😡 jay shree ram🚩🚩 #namo♥️🇮🇳", "siddanthpatil": "🖕🖕🖕", "online1592shopping": "We are with u mam.. Love u swara...", "lets_nacho_and_eat": "Do they not think that they are fighting with their own people? With some of the brightest minds in the country?", "_syed_riyaz_09": "❤️❤️❤️❤️", "mansoor_aehmad": "Revolution against evil minds", "rohitsachan_9531": "I am proud of mumbai University, who never taught me to go against my country. I dont know when these guys do their study. And on what basis they get their degree. I think doing morcha, strike are part of their curriculum. These people call themselves as liberals 😹😹😹😹😹. Govt should immediately stops such colleges. Kanhaiya kumar aka “an idiot” is on of the product of such University.", "trunal_14": "Kutti", "akashtiwari0103": "Chup bc sali kutiya jhuut bolti hai sharm kr thodi.. Dhuup mar jaake jhuut fhela rahi 🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕 delhi police ne sab dikha diya dekh jaake..... Bol bharat mata ki jai... Jai shree ram..", "uvvv._": "Nikl pheli fursat me nikl , itni hi prob he is deshse to bhag koi jarurt nhi is desh ko tum jeso ki", "im_ankitkumarsubudhi": "Who is @reallyswara ?🤣🤣", "ritik_pal_ji_": "😂 nrc or CAA se gand fat rhi h aunty ki", "rahul_connects": "Are swara u didnt had passport and any documents. How do you go for shoot outside india. You are the ones with fake passport, bloody shameless fools. And what the fuck are you saying about reporters, you didnt see how reporters were slammed out of the campus. Thanks to the media showing ur side of the truth and not the actual ones. Humlog ke paisa se hi bani ho hum log hi barbad karenge", "ami_shubhm": "Government se nahi kam se kam Bhagwan se darro aunty 😂", "manishakashyap702": "Yah jnu mein padne ke lie aate hai ya yrh sb krne ke lie har dusre din dharne par hi bethe rehte hai aise University ko to ab band hi kar dena chahhie @narendramodi", "chandrima_tina_97": "Hattt be bc.....", "akkibaby07": "Bolo trp chahiye aise kon leta trp aise log desh ke nahi paisa ke bhuke hai", "aayush_ji_gaur": "JNU MOM THEN BHU DAD🤣🤣💩", "sanchita195": "🐷🐷🐷🐷🐷🐷🐷aaaaaa", "rishav.bhojak": "Bollywood ne nikala.. toh edhr naam bana ne aa gayii", "aishanaaz1": "💗💗💗", "rajpootmahhi": "Same on you... R", "parnikaasood": "Pagal awrat", "sam_pras4": "Propagandist", "beerswithpk": "I hope u do respond to me for this @reallyswara awaiting your kind https://m.republicworld.com/india-news/law-and-order/delhi-police-names-jnusu-students-behind-three-attacks-on-jan-34-and-5.html", "vaishnavii_salvii": "You are a daag on India !", "meet__018": "Time to unfollow you", "vimal6261": "Failure government", "anil_lole": "Abhi kaha chupke baithi hai... Gaddar .. tum actor log hai na sirf acting karo.. asal life me tum log zero ho zero.. tumse kuch na ho paai.. gaddar sale", "shivamdubeyroxtar": "@reallyswara heyy tum hi ho na jiske baap dada ka ata pata nhi hai.... 💩", "adwait26": "Teri Bollywood mein to Dhanda chalti nhi aa jati ho mun uthake hamesa desh birodhi balo k Saath deke...jahan kuch galat Hota hai wahan tatti ki Tarah mun ko leke aati ho.chiiii..tujhse toh hamare sunny Leone must hai Jo in sabse dur Hoti hai...", "imadmathur": "Or flop actress tu bs yha bk bk kr skti he agr isi bheed me aa gyi na to tra naksha bdl dnge", "tiger_yash_3010_": "#sale padne jate hai #jnu ya politics krne inki kutai bohat zaruri thi aur kutna chaiye in logo ko #deshdrohi hai #sale yeh log", "thevarunvats": "Hum tumhare gand tode kar denge aaazadi tum phir kabhi nhi mangoge aazadi🖕🖕💯💯", "flankerabhi": "Wait and watch , kuch din m firse pele jaenge ye jaise abi abvp ne pela", "inbornstranger": "Tu yehi Kar .. acting toh hone se rahu", "ashutoshyadav523": "Sham on u swara", "the.st0ryteller": "Chutiye jnu wale lodu", "vislitkholi": "You are a stupid , idiot girl.", "pratikhilladi93": "Stupid paid actor standing for jnu students", "pankhu11": "Rather than sharing videos, sitting in ur room go n be a part of d crowd n than ul have the real taste of wat u r protesting lady 🙏🏻 ... May god bless u with a mindful 🧠", "karan_debabrata": "Randon ka samhahar...common swara masterbaute", "reallyrsb": "#JaiBhim", "faisal_siddiqqui": "M...... C.....d, dhokebaaz", "devvvrat007": "Majority of congressmen Navin Javid", "amanology_a12": "🥴", "ashu_007__": "Acha kr rhi hai, isse phle isko koi janta bhi nahi tha kam se kam isko rojgar to mil raha 😂😂😂", "lawrence_dsouza_8868": "👏", "cma_rsharma": "Shame on you @reallyswara", "roman_empire_vikash": "Bahut vhutiya ho gan..i chadarmod ra..d @reallyswara", "adi.khankar": "Wooh u earned the fame u dreamed of 🗣️", "hows_the_josh_jai_hind": "Ek baat toh malum huvi CAA bohat logon K berozgari Khatam kar raha hai jaise ye swara aur anya", "yoyo_rajjadi36": "कमी तो एक्ता मे रह गई थी...वरना जीतने किलो का अकबर था उतने किलो का तो मेरे महाराणा प्रताप का भाला था | \"स्वरा\" तुम जैसे गद्दारो से तो दुश्मनों अच्छे 😠😠😠", "unknown.devil123": "Me sochta tha rakhi sawant drama queen h... par nahi terese badi drama queen aur koi ho nahi sakti sali tu to apni maa ko bech ke aa gayi aur kitni halki ho sakti h tu... chutiya swara, chutiya tera family... #shameonyou", "lakshya_980": "Bahart mata ke ji 🔥 Ye desh ram ka tha hai or rhega.", "rajput_piku_": "Pee kar hi aai hogi ye protest me byi😂😂😂😂", "ayesha__oo7": "👍👍👍👍", "amanthakur3575": "😂😂😂😂", "saifuliyat": "Love you mam ❤️❤️❤️❤️", "lovitjaguri": "He bhagwan tujh jaisi auraton ko to aurat hone pe sharm ani chahiye", "patilabhed": "Kisine sach kaha ki teri keemat dainik bhaskar se bhi kum hai...... Naa jaane parde ke peeche kitne kaand kiye honge tune..... Jo tu yahaan tak pohonch gayi", "keswani_jitendra": "Madarchd 2 kodi ki deshdrohi sallli", "rushi9503": "Flime nahi mile rahi isko to ye politics kari hai......... .....(.Rakhi sawant ki tarakh)", "arzan__khan.__": "💯", "miniluv_78": "Thalvi", "_het.shah": "No one came when swami vivekananda's statue was vandalised by the Left goons,and now most of all motherf**ker bollywood stars are comming without any reason", "niteshkr077": "4 lathi kya padhi rona start kar dete h saale ,or inko chahiye tha azadi ,bagat singh ki baat karte suar sab bus", "hunterofhearts46": "Wohi repeat horana jab British k against Indians kuch bole toh jail me daalte the saza dete the aj bjp wohi karra", "iamhusainzoya": "We stand by you! ❤️", "sheikh_star": "🔥🔥🔥🔥❤️", "chaudhary.alpna0001": "bhiy tu chutiya h kya...khud ka career to flop h..students ko bhdka orr rhi h...pdne d @reallyswara", "smiley__face___": "Faltu drama queen💩", "mrigenpt": "This is called left fascism", "akash_11399": "Bewakoof jahil ho tum thodi bhi study ki hoti na to kam aaati", "khansalman7097": "We are proud of u sister", "gauravjain____": "@reallyswara ans diya nahi apne apke pass passport aaya kaha say 🤣🤣 pagal aurat sali 🤣🤣", "alma_mushtaque": "Strong lady", "_shantanugoel_": "Nallo ki univertsy😂😂😂", "vivekisyour": "http://www.citizenshipamendmentact.co.in/", "sayhitofinalstar": "Drama drama drama....😂😂😂👏", "cyberpunk._": "Randi hai tu @reallyswara", "kiara_akihya": "50rs wali Randi..this Randi can't act and thoose JNU bastards can't study", "kundanpradhan1220": "Idiot 😂", "deshbhktdeshbhakt": "इस समय दीपिका पादुकोण इस देश का सबसे बड़ा मुद्दा बनाया हुआ हे (मीडिआ द्वारा ) चुकी दीपिका ने जे ऐन यू के छात्रों पर हुए हमले और पुलिस की उचित कदम न लेने की निंदा की और घायल छात्रो से मिलने पोहची जिस कारन गोदी मीडिया और भक्तो की सुलग गई गोदी मीडिया दीपिका को गलत सबित करने की पूरी कोशिस कर रही हे वही एक तरफ भक्तो की दिमागी संतुलन बखराब हो गया हे और भग्क्तगन दीपिका पर भद्दे और अापत्तिजनक टिप्पिणि कर रहे हे और दीपिका की आने वाली फिल्म \"छपाक\" को बॉयकॉट करने का प्रोपेगैंडा चला रहे हे इस देश सभी को स्वतंत्र रूप से घूमने का स्वतंत्र रूप से बोलने का अधिकार हे जो की संविधान हमें देता हे क्या भाई अब बोलने और घूमने पर भी बवाल मचाओगे तुम सविंधान से ऊपर हो जाओगे पूरा भारतवर्स जानता हे की ये कोन सी विचारधारा के लोग हे जिन्होंने प्रारम्भ से ही संविधान को नकारा हे इस समय हमें पूरी दृड़ता के साथ दीपिका के साथ खड़ा रहना हे नहीं तो सत्ताधारी गुंडों के डर से आपपे या आपके बच्चो हुए अत्याचार के विरूद्ध में कोई भी आवाज नहीं उठाएगा", "saurav2482": "#boycottswarabhaskar #supportcaa", "aryat58": "Bakwaas actor jab Tere pass koi sabut nhi ki tu Indian Hai to muslman kyon to bhi nikal pheli fursat mein anarkali of ugaanda", "sk8064402g": "Haa haa apko toh waha hi safe lage ga na jaha tukde tukde gang hogi itna hi dar lagta hai hamare desh me toh Pakistan kyu nhi chale jate ap jaha khaya wahi hol kiya 🔥🔥🔥you ga back Pakistan swara", "mantrasattvik": "Drama 😉", "_x_vaidik.x__x": "Ghanta kuchh nhi hai tu jo itna uchal rhi hai abhi zameen pe ajayegi @reallyswara", "lights_of_mustafa": "🙇‍♂️🙇‍♂️❤️❤️", "vdilse_d_il_tak": "Pyar do pyar lo.... 💕 Desh mange Mohabbatein 😘 .. Jai Hind Jai Bharat ♥️", "prodigal_sonxci": "Jab swara ma’am choti thi... tab se hi unhe ek shok tha... tab ka sapna ab pura hua.... “udta teer lene ka” .... apke aadhar card, voter id, election nahi... aap domestic flight kese book karte ho... passport nahi to international fly kese karte ho aap... i have no idea how you came with this plan to support the people you don’t mean to... and seriously aap itne bhukhe ho publicity ke?", "ugly_smoker_": "Hatt Randi", "pi_day_pisces": "@reallyswara when do these #jnudelhi students study if they're always on the road🤔", "ri.tik4566": "Randi swara", "akky02n": "Bhag madherchod randi", "raj_rawat007": "Ayga to Modi hi Jai Hind Jai army", "atiswangoel_ig": "Ek baar border p bhi ghoom aao, dr priyanka reddy ki maa se bhi mil aao , nirbhaya ki maa se bhi mil aao pulwama attack bhi huya last year waha aap dikhai nhi dii are publicity stunt. Are zoya akhtar se film chaiye inhe.", "mdsafroz05": "Allah bless you 🙏", "rahaman.kiran": "❤️❤️", "piyush0312": "Koi teri maar leta maza aa jata", "kumar_bhaarat1": "आजकल हम क्या देख रहे है,, हम देख रहे है उन लोगो का हुड़दंग/आंतक/अराजकता जो आंतकवादियों के पक्षधर है/भारतीय सेना को गालियां देते है/आंतकवादियों की मौत पर मातम मनाते है, सेना के जवानों की शहादत पर थाली बजाते है, मिठाइयां बाटते है, खुशियाँ मनाते है/हम देख रहे है सड़कों पर धरना/प्रदर्शन करते उन लोगो को जो सेना की वीरता का प्रमाण मांगते है/पाकिस्तान के लिए सहानुभूति दर्शाते है/पाकिस्तान जिंदाबाद के नारे लगाते है, पाकिस्तानी झंडा लहराते है/भारत तेरे टुकड़े होंगे की बात कहते है/हिंदू संस्कृति के प्रतीक चिह्नों को पैरो तले कुचलते है,,, हम देख रहे है उन लोगो को जो रोहिंग्या घुसपैठियो के हितेषी है/बंगलादेशी,पाकिस्तानी घुसपैठियो को नागरिकता देने के हिमायती है/देश में इस्लामी जेहादियो को बढ़ावा देने वाले दोगले हिंदुओ को/देश को कमजोर,खण्डित,अस्थिर कर देने में लगे उन हिंदुओं को जो ऐसे मुस्लिमो को साथ दे रहे है जिनकी इस देश में कोई आस्था नही है,, जो खाते इस देश का है और गाते पाकिस्तान का का है/अफजल समर्थकों को/हिंदू देवी देवताओं का अपमान करने वालो को/महापुरुषों को अपशब्द कहने वालो को/हिंदुत्व की कब्र खोदने वालो को/भारत माता को डायन बताने वालो को,,, हम हर जगह इन और ऐसे लोगो को देख रहे है,, जो राष्ट्रवाद की भावना को तोड़ने, कुचलने में लगे है,, यह चाहे कमुनिस्ट हो, साम्यवादी हो, कांग्रेसी हो, नाचने गाने वाले हो, दो कोड़ी के फिल्मी भांड हो,दोगले नेता हो, दोगले इतिहासकार हो, पत्रकार हो, मीडिया वाले हो, इनको देखिए, मगर देखकर इनकी चालो को समझिए, इनके मकसद को जानिए, इनके इरादो को पहचानिए, इनके कार्यो की पड़ताल कीजिए,,,, और फिर इनसे अपने देश को बचाइये, अगर आपकी इस राष्ट्र में श्राद्धा है तो, अगर इस राष्ट्र के प्रति आप अपना कोई कर्तव्य समझते है तो, अगर हिंदुत्व और सनातन धर्म की पहचान को कायम रखना चाहते है तो,,,", "shubhamguhathakurata98": "@reallyswara how will you justify mahek that girl with the poster of Free Kashmir. Please don't exploit the integrity and sovereignty of India in the name of protest. 🙏🙏🙏", "marazbanbhuri": "Kaam nahi milta toh kyaa kyaa karna padta hai to get noticed in social media.", "srianshu108": "Desh mei horahe bhrashtaachaar ko mitaane ke liye ham aapko Aage aana padega", "karandhir_2344": "kya aapke pass aapka birt certificate nhi h 😂😂", "anush12123": "Tujhe Pakistan bhejne ka time AA gya h. Tu terrorist h @reallyswara", "ig_rahul_": "Veer savarkar amar rhe", "manisha.s1403": "Kitna bhi nautanki kar lo aayenge to Hamare Modi ji hi.. #namo", "jitesh_thakurr": "Tu yaha protests karti firti waha k liye bhi bol kuch ...apne ghar pe rakhegi rohingyas ko ...", "vrishanksaini_20_01": "Agar police kuch Kare toh woh gundagardi h aur agar kuch na Kare toh useless h... Aur agar waha ke student kuch bhi Kare toh unka woh right h... Waah re waah", "shuaib_rajput.965": "💪💪💪", "asawari02": "You are mentally sick @reallyswara , no IQ, I can understand you are short of films, but this low? Like seriously? Brainless", "khuuushi_1509": "Kaisi chutiya h bey ye🤦🏻‍♀️", "jay_ho00000": "Medam, you say that you do not have proof. So Madam, when you go abroad, passport will be required, on what basis have you got the passport made? 🤔🤔", "rishabhkaushal442": "I liked her bio DRAMEBAAZ... YES SHE IS..... NO COMMON SENSE...", "ajaymujumdar": "Ye bachho jaisi harkat karna chodo. Better work on acting skills..", "rachiita_sh": "@reallyswara please explain reason behind this protest? Please explain new law? I think you are competing with @rakhisawant2511 ?? Well she is hundred times better than you.", "boss_ventador": "You are Such a low creep, sold out for anything @reallyswara", "idooontknowwwww": "♥️♥️♥️♥️♥️♥️♥️♥️", "mukeshmali12345": "@reallyswara mam,acting me carrier nahi chamka to socha chalo bacchon ke sath politics me hath ajmaya jaye.....mam aapki hindutva virodhi aur peaceful satisfaction ki niti humko ache se samaj me ati hai.....bcs army se strike ke saboot mangne walo ki supporter aaj without saboot blame kar rahi hain....thats not fair.....", "amitm5060": "Phir pitayega ye chutiya sab", "adv_vishal_sharma": "तुम उन लोगों का सपोर्ट करके खुश हो जो भारत विरोधी नारे लगाते है। और उन पुलिस वालो को बुरा कह रही हो जो तुम जैसो की रक्षा करते है। शर्म आनी चाहिए तुम्हें जो अपने आप को कलाकार कहते हो।", "myheartisphat": "I feel sick when these so called actors puke like this on social media fuck y'all I don't want to flee out of my own country like the Kashmir pandits did back in the day and fuck y'all I don't mean only Muslims there some Muslims who are good and deserve to stay in India but the vast of Hindus and Muslims fuck y'all y'all are dumb have no knowledge about shit going around fuck y'all I support it fucking law I ain't racist to any fucking religion but in god when it comes to my country i will speak so gtfo", "debsubam": "Fuck you", "paul_britto": "🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻", "yadavinder416": "desh virodhi baat karo or publicity kamao , kyoki India se jayda Chutiya public pure world me nahi hai , inko to movie dekhni hai Bollywood ki , Bollywood wale is Chutiya public ko uski aukaat dikha rahe ,", "mishra_smiley": "मिलेगी आज़ादी 😂", "chetan_jaiswal_1008": "Didi 8 Feb ko vote dene jao jab I'd mat dikhana, ranga billa nam bata dena", "geralt_of_delhi_95": "I don't understand one fucking thing when the soldiers died on the border then no Bollywood person goes to the houses of martyrs and now when these people are doing violence and maybe some of them are good then these big asshole celebrities are fucking guiding them in wrong direction", "sonali.kohli1": "छपाक में जिस कन्या की कहानी दिखाई गई है उस पर तेज़ाब डालने वाले का नाम नदीम था उसकी एक मसुरमान फिरैंड थी साथ में जिसने मदद की थी तेज़ाब डालने में ये क्या दिखा रहे हैं कि तेज़ाब राजेश ने डाला असल नाम बदलना था तो नदीम की जगह नावेद कर देते लेकिन फट जाती है इनकी सच्चाई बताने में.!ispe kuch", "_smoker9_": "who is ur mom ?", "ekanshkkapoor": "Tum bhi chutiye, tumhara protest bhi chutiya ❕❕", "dineshrathorerathore": "बेवकूफ औरत", "thakurjitendra034": "Jor lgalo jitna hai bollywood ke bhadavo", "soniajain_21": "You have no right to live in this country if you don't have any identity or you can't prove that people know you by showing witnesses that means you're a terrorist. And there is no place for terrorist in this country. People like you take money from neighbouring countries and do all this drama for the sake of money . #shit #supportcaa", "vinay_tripathi_me": "Mam,nankana sahb gurudware pe attack huwA aap un ke sath bhi khdi ho,aap yha support kr. Rhi ho aacha pr wha ke liye ,bhi bolo,unke sath bhi khadi rho,aacha lgega sbko.thanks", "chiggspurohit": "”सस्ती चीज़ों पर ध्यान न दें. स्वरा भास्कर से महंगा दैनिक भास्कर बिकता है.”", "king210289": "Gasti teri mdf", "yagneshkharachia": "एक ख़ास राजनीतिक समूह जब मारामारी करता है तो उसे क्रांति कहते हैं !  वही समूह जब पिट जाए तो उसे हिंसा कहते हैं 😂😂", "raomanishyadav2010": "फिल्मों में काम नही मिलने की वजह से, क्या आप भी टुकड़े-टुकड़े गैंग की सदस्य बन गये हो?? #swarabhaskar #swarabhaskar @reallyswara", "isharaa_jay": "@reallyswara you are sexy bombshell💣💣, ,queen of hotty chicks, ,love you babe💘💘💘💘💘💘💘💘", "habeebakhter": "Hoton pe sachai rahti hai, jahan dil mey safai rahti hai, hum us desh ke waasi hain jis desh mey ganga bahti hai.", "shankar__1524": "Didi @reallyswara mom to waise b safe thi but apko bs drama karna hai hr jagh😂😂😂😂😂hum sb jante hai 😁😁", "yadavyadav82": "@reallyswara JNU वालों की पिटाई देख के रात को रोटी गले से नहीं उतरी। 😉 मिठाई मँगवा कर खाई तब चैन आया।।😂😂", "rajendra__rathore__rj": "Aaj tere follower 2 Million se bhi bahar hote agar tu ese gaandu kaam nahi krti to 😠", "architislove": "Didi itna drama?", "freeky_friend": "Thank you so much mam🔥🔥you are a real hero💛Wanish all hindus,hindus should leave this country..India will be a #islamic country ☪️#allahuakbar #lailahillallah", "ayush.trivedi.397": "Inko footage chahy bas,pta kch h ni,ghusna har jgh h", "poeticsometimes": "देश की सबसे बड़ी सिने तारीका ने #छपाक से जेएनयू पहुंच कर विद्यार्थियों का साथ ही नहीं दिया बल्कि #तड़ाक से एक चांटा भी जड़ा है उन लोगों के गालों पर जो अंधभक्ति में लीन है..! #जियो_शेरनी", "anjalibisht1996": "Tum kuch log jo sapne dekh rahe ho na bharat k tukde hone k...wo kbhi hoga nhi chahe kitne bhi tum\" bharat tere tukde honge\" k naare lga lou...naa hi bharat k tukde honge or naa hi hr ghr me afzal paida hoga...#VandeMatram", "nishant_arora_13": "You are the Real 🌟", "haryana_aaleee": "U told u have no documents... Then apne vote kaise diya??? Abroad kaise ghumane gaye?? 😂😂😂. Jb films nhi milti to log aese karte hai😂😂😂", "shaikh686": "Mem you are real deshbhakt", "sunilgupta0945": "Kashmiri pandito ke liye bhi kuch apna dukh btado 1990 Wala kand Jo aapke jaise logoko kbhi nhi dikhta....", "lakdawalashahid": "Brave women @reallyswara if great", "03und30": "Madam love you so much after seeing your such great work I realized that these years you are jobless from Bollywood. No worries madam still u have great packages with antimodi scheme . Companies like Congress , AAP , leftist have great packages for you. Oh sorry I forgot u r already working for these companies mam @reallyswara please send regards to lovely colleagues @kanhaiyakumar @kunalkamra_unofficial !!", "pri.yanka_j": "Jo Sukh chain se srf padhna chahte hai Apne politics k chakkar mein unka future toh mt barbaad kro, @reallyswara Aapko toh kaam mil ni rha, doosro ko kyu uneducated rakhna chahti ho", "melodie0313": "😂😂😂👌👌👌👌👌", "whos.omi_": "Randi 😂🤣🤣🤣🤣🤣", "mis_rohini_singh": "Tum padal chalke aaoge, tumhari tang tod di jayegi..😂😂😂😂 suttai boht buri hoti h", "rahull01_": "‘Free Kashmir’ placard displayed in protests in mumbai against JNU violence. How’s kashmir related to JNU issue? But our so called intellectuals @reallyswara @mallikadua @jimsarbhforreal will also ignore this propaganda just like they ignored “I am babri” banner displayed in anti-CAA protest.", "bisht_pushkar_singh": "I guess she is not getting enough movies nowadays....", "himalayanfit": "Jai Shri Ram", "arung1353": "😂😂😂😂 modi modi💪💪💪", "manish.swami.66": "मन है जिहादी इन्हे चाईए आजादी", "karthik_gty": "A girl who can travel world without passport is swara aunty", "smhsherjeel": "You are doing a Great work as a women you inspire me...Thanks alot💗", "sandy__banna__": "@reallyswara iss protest mai prime minister of india ( narendra modi) & home minister of India (Amit shah ) ko maa bahn ki galiyaan nikali gyi un pr kya bologe aap ....", "ab.hi3339": "Begusaray k seat ki next leftist candidate..😂", "ajhariya225": "Me bus students ko yahi kahungi ki please concentrate your studies not politics because you all the futures and pride of India app sirf country ke bare me socho or padai me man lagaoo please 😔🥺", "ashwanitiwari129": "Jnu ME padhne Wale sare desh drohi hai koi padhne wala NHi hai chee tu 🤬🤬🤬🤬🤬", "naikraj004": "lol kota mey 104 children's died so called stupid celebrity not condemned fake celebrity lead by @reallyswara next currupt priyanka wadra she want dig into politics agenda and @deepikapadukone never accepted from u coz your movie releasin.. your PR team give shitt idea...... unfollowd you #shameless #factspoken #jaihind", "aarzoo138": "Guys party", "saurav_chaudhary22": "I mean, Really swara ?? @reallyswara 😆🙏", "letsqoute.it": "Im so thankful we have celebrities like you in Bollywood..! 💜", "dev_padampura": "Charitraheen mahila, tere hazar tukde honge", "mr_rajvi": "Hum kagaj nhi dikhange...hum adhar card dikhange...hum kagaj nhi dikhange hum passport dikhange 🤘😁", "___allinone_____": "More power to you, Girl!", "shivampathak26darat": "Probe* is still not complete and you have given clean chit to one particular side projecting them as victims. That shows your and your b town co workers insincerity and your alignment towards leftist ideology.I don't have any problem with your alignment but you must project them as suffers .They are fighting for democracy or constitution ,they say but what about the incident of not allowing students to fill up their forms .That is the democracy according to you all I think .That's all what I want to say.", "hanry_ford": "सस्ती चीजों पे ध्यान न दे। \"स्वरा भास्कर\" से महंगा \"दैनिक भास्कर\" बिकता है। #जेएनयू के आतंकियों की फिर से ठुकाई 🇮🇳🇮🇳🇮🇳", "mayurchapatwala": "Koi mujhe ye bataye 3 km pe rehnewalo ko koi taklif hue hai? 🤣🤣", "jake_green58": "Dude my only question is what documents did you produce to get your passport? Passport requires address proof/age proof. Seriously this uneducated woman has no sense?! Bas bhaunkna aata hai!", "dhyey_145kph": "@reallyswara You are #secularhindu 👎👎👎👎👎👎", "weird_rayy": "do char lath swara me bhi padne chahiye", "shrimantroll": "Swara bhaskar is so toxic that she makes nuclear waste look like candy floss.", "laughingbuddha_1": "Over acting ki dukaan 😂😂😂😂", "vinay7480": "😤😤😤😤", "sniper_arpit": "वैसे भी ये जेएनयू वाले पढ़ लिखकर भी देश को गाली ही देते है इनसे अच्छे तो बेचारे मिडिल स्कूल के बच्चे है जों पढ़ते भी इनसे अच्छे है और देश को बदनाम भी नहीं करते।", "mumm2cool": "So proud of you...stay strong", "mahidk8083": "❤️", "shivamchoudhary25": "Teri maa ki choot randi", "robbie.199323": "flop actress", "anandwaibhav": "I appreciate ur effort SWARA BHOSDIKAR mam..😆", "dark_chapters": "What about kashmiri Pandit u Mf", "sr.boi": "💯❤️💯💯❤️", "astroscience2015": "Such a Negative Person she is. Full of shit in talks and a flop Struggling Acctress👍", "sneh_1904": "Who is she I dont know bcoz in latest interview she told that sje dont have birth certificate she dont have any proof can you tell me who is she", "sspkudla": "😂😂😂😂", "_afraj": "عندیہ ول رممبر یو مم۔۔🙏🙏🙏🙏🙏🙏🌹🙏🌹❤️❤️❤️❤️", "sweetjaat": "CAB se drne wala har ek gandwa h sala chutiye mulle", "shyam_dave": "Unfollow her", "jaypawar2803": "😂😂 jnu ki. Rakhvali 😂 Randi rona", "manjeet02_20": "Bhag saali randi fimle koi deta nhi to yaha drame krti reh tu", "megha3093c": "Ppl like u should be thrown out of our country😠....shame on u for supporting anti nationalists....by t way u urself is one anti nationalists 😠", "_surya__clan___": "Randi", "chuslim687": "Swara you are a Pakistani 🐷🐖", "captain_jacksparrow_113": "Hahaha 🤣😂😂😂🤣🤣🤣", "samadhassan2020": "❤️", "official.gaurav.kumar": "#boycottbollwood", "yusra4363": "I am with you. You are doing a great job. Hats off to to😊😊", "imashishreal": "Hum bhi college jaaty hai Iss umer me khoon garam hota hai aap jhagda aro danga kro aap k peeche chup kr log police aur humare army p hamla Kre isse Kis ka nuksaan hai hum sub ka aap ka modi ji aaye ya rahul ji RSS KRE YA KOI BHI Aap India me ho aur India shakti ka pratik hai aur aap India me hai", "diptesh_mandloi": "JNU ke Gunde humare prime minister ko galiya de rahe wo tujhe acche lag rhe hai,, kuch sharm bachi hai ???", "sulabh.shah": "Kyu har bar Jnu opposed kyu karta waha padne ate he ya ye sab", "jaysingh8685": "Kitna footages legi", "siddhu_lnr": "Quran (4:89) - \"They but wish that ye should reject Faith, as they do, and thus be on the same footing (as they): But take not friends from their ranks until they flee in the way of Allah (From what is forbidden). But if they turn renegades, seize them and slay them wherever ye find them; and (in any case) take no friends or helpers from their ranks.\"", "sonuuu_singh": "अच्छा ही हुआ कुट दिऐ गए😂😂", "1kapil3": "Are @reallyswara biased . Jab bhi jun ke rand bache randi rona chalo karte hai to wahan badi jaldi unke pass chali jati hai . Aaj tak ni dekha kisi army jawan ke ghar jate hue to mare jate hai . Tab kya hots hai paise to di dete jnu wale bakwas karne ke liye .agr desh ko aage badane mein koi koshish nahi kar sakte to apni gand ni ghusani chaiye use barbad karne mein. Jai hind .vande matram 🇮🇳🇮🇳🇮🇳🇮🇳", "aksharguha": "Who the hell are you?", "kk475678": "@reallyswara se mahnga denik bhaskar...😂😂😂 lode lag gye didi k 2 rupees orat", "dark_assassasin": "Bismilla rahaymaney rahim... कश्मीर की आजादी तक,/ हिन्दुस्थान की बरबादी तक/ जंग चलेगी/ जंग चलेगी ---- दिल से शुक्रिया आपका --- हम मिलके उस मोदी और हिन्दुस्थान को खतम करेगें --- इंशाअल्ला।।", "imshilpasaxena": "Pls stop drama", "kamleshailani": "Unpad gawar ladki,tumlogo ka jaa Mann hua woh apna danda kholkr baith jaate hai....shame on you and actress and your just entertainer and should be focus on entertainment only not againt country.....shame on you and today going to block you on Instagram", "1511radhika": "You’re the number one threat to solidarity of India.. one thing is for sure.. never going to spend a single penny on watching your rubbish movies.. keep dividing and disrespecting the Government you’ll get nothing", "vikashkumarsingh78": "तुम्हारे तो सबकुछ पानी में बह गया था तो MOM कहाँ से आ गई सच सच बता दो", "mukul_munjal_": "i love what u r doing. love the way u r doing it. love the courage you r showing. perfect ho yaar tum.", "u7k4r5h_51ngh_": "You a fool🙏", "fatima_khan1406": "U're the strongest Bollywood star who can talk fearlessly! Your contribution towards India's integrity is great! A big salute to you!", "jaindharm": "Desh ko kharab karne me bollywood ke kuch bhand hai 20-30 cr public hi movies dekhte hai inme jaydatar Hindu hai aur ye agar in kuch bekar bollywood bhand ko movie dekhna close kar de tab inko pata lagega CAA NPR NRC deh ke logo bollywood walo samajna chahiye tod fod danga nhi karna chahiye", "kalpesh8141": "Abe randi chinal sali sali mc tere jaisi hi logo ne desh ko barbaad kiya hai chinal randi sali", "drx_apothecary": "Keep doing ❤️", "aniket.gupta19": "tukde gang", "ram_pawar_96_k": "All students Union are disgusting now days including nationalist ,left, libralandus . understand what is your first requirement. It is your study for some days far away from everyone organization and focus only on your study .ye log khud ladenge marenge aur baad me rally ,program ,aur wahiyat debate hoge .", "sanjaythakur499": "Swara pagal ho gayi ho apna iillaj karao", "the_religion_universe": "Deshdrohi SWARA #jihadexposed", "rashtrapal.4.u": "Ur contribution in India's uth is great....mam", "_nawaabi_pathan_": "Good", "hamza.thoufeeq": "You are an awesome person 😍", "paliwal_nitesh1": "Deshdrohi hai", "_vickypareek": "A.B.V.P. JINDABAAD..JINDABAD JINDABAD", "akshayomalur": "🤣🤣🤣.. Nobody is with JNU and Swara Bhasker. Bdw nice reply by Sadhguru 🤣🤣🤣", "dinesh.duggal.50": "Murder of democracy !", "arjumandaazad": "Proud of you swara. You are the real hero in bollywood ❤️❤️", "kunalrajak_k": "Kutiya saali. Aaaah aaah aaaah", "corp.jgc": "Ay swara randi tereko jitna jamta he utna hi tu kar tu film me kam kar sex scene de nangi nach tera vahi aukad he aur ha tere ma ka bhi randi ki beti randi hi hoti he vaise bhi tere jaise ginone shakal ke randi ka scene dekhane ka mann bhi karata", "harshita15singh": "Anyone who has done violence should be punished. With the posts that you are making you just dividing the student in political groups & saying for & against them. Jo violence kre usko punish kro.. ye ABVP wale h ya LEFT wale h.. ye kaha se laati ho didi? Hate is all that you are spreading through your posts. Don’t like something say against it. But don’t divide the students at least based on their party. Whoever is involved in violence should be punished. Waha JNU me kch hota ni h apki label dena shuru ho jati kon kiska h ye sb.. SPREADING HATRED!", "doshimiral02": "zindagi me protest krne k alawa kuch kaam bhi kiya h didi aapne😂🤣🤣 @reallyswara", "saloni__mallik": "More power to you... ❤️❤️", "maneeshkumar.889988": "You all librandu are terrorists.", "lionheart_nicky": "unfollow kar do isko..", "here_i_m_abi_": "Us wakt police Ko gali dey ragithi ..abb bolrahi ho police Kahan ho ... Chatey kya ho drama queen @reallyswara", "tarun_raghav__": "@reallyswara यदि दिल्ली पुलिस को नकापोस गुंडों को पहचानने मे टाइम लग रहा हो जिन्होंने #JNU मे हिंसा की है तोह कृपया मोदी जी से संपर्क करे सुना है वो कपडे देखके गुंडों को पहचान लेते है |", "rohitshrivastava1995": "swara madherchod kutti ki bachi saali aasifa rape case pe toone poore hinduo ko gaali di thi jabki yeh khulasa ho chuka hai ki uska rape hua hi nahi tha jhoothi report banaai gai thi tab kyun chup ho gai uss waqt kyun chup hui jab up mein 2.5 saal ki bachi twinkle ko maar daala gaya tha", "kaur_kps": "❤️ be strong be safr", "priyanshu_shukla_0001": "Tum kuch ni krskte protest ke alawa sarkaar bjp ki hai 🤣🤣🤣🤣", "nitish_lotian": "Sach me buddhi nhi h inhe...koi nhi khali log🤣", "priheheheh": "\"not everybody is Swara. not everybody can slay trolls\" ❤️", "aditya.77_": "😂😂😂😂😂😂😂", "singh.pankaj94": "Jnu ki president se pucho..mask wale gundo ko lekar kaha se aayi thi", "aj.ay5898": "बेचारी को कोई फिल्में नहीं मिल रही है😆😆😆 तू एक काम कर मिया खलीफा के साथ शूट कर ले😆😆😆😆", "cheruperu29": "♥️♥️♥️♥️", "pankkajpatrange": "What about mobattack on policemen during caa protest mis swara?", "manisha_ansari": "♥ ♥", "_dear.zindagi_": "जेएनयू के वृद्ध छात्रों के साथ जो भी हुआ हम इसकी निन्दा करते हैं 😁😂😂", "mentalworld1979": "@46_rajat agar gaand me dum hai randi ke bachche maadar chod to unblock kar laude ke baal aur gaali kha madarchod. Aa jldi hai chakke na mard jldi se aur unblock kar", "yogendra1516": "JNU वालों की पिटाई देख के कल रात रोटी गले से नहीं उतरी😉 मिठाई मँगवा कर खाई तब चैन आया\" 😂😂😂", "adv_vishal_gupta": "Wrong Protes xxx u should protest against aisa and left 50year Old students jo muft ki roti jnu me public ke paise se kha rahe aur kisan mar raha shame on u", "himanshu34a": "मिल गयी आज़ादी??", "memories_unfolder": "Get a life, lady! Don't struggle too much to get an identity. You are one such weed in our country. Just wait for a nice kick soon!! #patheticperson @reallyswara", "sikhwalgaurav": "She is good damn leftist minded...always creating unecessary melodrama😂😂😂..", "lavanyas_closet": "@reallyswara aunty", "casu_vaibhav": "Jihadio aur communisto ki kabar khudege Bharat maa ki dhrti par🚩🚩👍", "priyanka_sharma1817": "@reallyswara ...hai himmat agar and ho real \"secular\" toh shikara movie ko promote kar k dikhao...ya secularism ka matlab tumne sirf 1 religion se lagaya hai kya?..u are a total shame and bojh on planet earth", "sonar2538": "😂😂😂😂😂", "amritesh_v": "U r a shame to the country..flop actress", "mdwasim4063": "We proud of JNU students", "itisrahulbishnoi": "Yeh Students Padhai NHi sirf ladai krte hai kya?", "shalinigupta2363": "& I Love My India❤️", "srushtij1205": "Abe chutiya aurat hai sali tu", "shaykhism": "❤️❤️❤️❤️", "life_goals625": "I respect you even more now", "jankii11": "Don't talk for the sake of being praised for talking fearlessly...you are a shameful and unworthy citizen for supporting these goon led protests...please stick to your invisible so called acting and let the politicians do the politics", "sachinjoshi77": "11 फरवरी को दिल्ली का शुद्धिकरण होने तक ये सब चलता रहेगा,, 8 फरवरी को महादेव दिल्ली वालों को सद्बुद्धि दे ताकि वो घुंघरू सेठ का स्वाहा कर सकें 🙏", "nahid_akthar_mjh": "Proud of u love u ❤️", "danish_daniyaal___king": "Mujhe Fakhar H Ap Par Apki Soch Par Apki Kaam Par Dil Se Bht Sari Izzt Or Pyr Aap Jo H Wo Hazr Sal Me Ek Bar Peda Hote H", "bosegovind": "Yaha jab public property ko harm kiya jata h , tab tu kha chali jati h @ reallyswara", "sujit_waghmare_": "Nice publicity stunt konsi party ka ticket chaiye?", "46_rajat": "🤣🤣🤣🤣", "vikas_sahu_.rohit": "We ABVPians, feeling proud our soldiers of ABVP🙏", "vi_na_ya_k7623": "🖕🖕🖕🖕🖕🖕🖕🖕", "baishnabii.i": "More power to you 🌹", "rashidurfgandhi": "❤️", "shekhar.narasimhan": "JOBLESS POLITICIANS, PSEUDO LIBERALS, ANTI-NATIONALS STAY AWAY FROM INNOCENCT STUDENTS & UNIVERSITIES. YOU ARE RUINING INSTITUTIONS & THEIR FUTURE.", "ratish.kumar.773124": "मुबारक हो तुमको यह लट की पिटाई सदा खुश रहो तुम पिटाई ही पिटाई😂😂😂😂", "the4lines": "The street lights were put off, so has been this country’s eyes, The police standing outside mute, so is this country’s voice, 50 dead souls covered with masks, showed courage by hitting students and teachers Feeling proud hitting a blind student, girls as easy as playing with toys @the4lines", "syedahafsaaaaa": "Alhumdulillah Swara. Really proud and greteful to you parents for having raised a RESPONSIBLE, BOLD woman like yourself. Extremely thankful to you for taking a stand and spreading the word. 💕", "madhurimasarkar99": "Thank you for your support ❤️ You are the one we all can look upto ...", "rachinh.thakur18": "Yahi protest aap Nankana Sahib mein jo hua uske liye karte toh pura Desh aapke sath hota ma'am. Kitno taqleef ho rahi hai aam aadmi Ko dekho aur ye student ka kya hai jo dimaag mein daaloge fatt se lelete hai", "rishi0291": "Sare atankwadi yahi pe rehte hai lagta hai😂😂😂 desh ke gaddar bhi😂😂", "rahul9611": "👎👎👎👎👎", "jasonjaswani": "Please check your DMs @reallyswara", "raunakzx": "Madarchodin 😂😂", "ehraz_khan_19": "I support you❤️", "sureshbajan": "A girl without any documents have parents also . What a surprise.. shocking parents staying in JNU campus unaware that they have to make basic documents for a baby like birth , ration card and school certiricates", "elo_melo_09": "😘😘😘😘", "souail.me": "@reallyswara check my story and respond if you have guts", "vernikasharma13": "Like her bio saying she’s a dramebaz attention seeking ass who Doesn’t know what she’s doing . 😊", "rajchowdhary001": "Padhai Mai man nae Lagta toh Ab ladai chalu, people with big politicial motives enter JNU now", "pawan.mpharmacy2017": "Your Mom is safe, Now bhaad me jaaye Janta", "ayeshatazin": "❤️Azaadi", "ayusi_subudhi": "👏👏👏👏", "azzru_achu": "👍✋", "kashfsii": "You are a real Hero mam", "aruppurkayastha": "Leftist are terrorist", "otakusector": "Abvp kids were bitten too but media ain't reporting it. It's some other group not Abvp.", "priyashreedas_": "❤️🙏", "mostlykreative": "Desh mera paak tha Kardiya tune ise khaak sa ..... Mazhab isme anek the Cheekh rahe har ek the ....... Azaaadi unki armaan thi Desh me rehna unki shaan thi...... Ye mitti ye darakht ye nadiya Guzar gai hai jisme sadiya...... Achanak koi daalne laga hai darar Karne chala hai hamari ekta ko farar ..... Tu ghabra na , na kar tu gham Na mai na tu..... ache hai ham.... Yaad rakh Tera mera khaliq hai saath Aeega zarur din beet jaae jab ye raat.... - @mostlykreative ✒", "tm5184": "❤️", "hitler__oo7": "We want Haryana Reservation in JNU ...... Firr dekhte h Bc Kon aazadi maangta h ....... Do Din me Campus Khaali kar denge BC tukde tukde gang se", "nk2601": "Jaya, mamta, rabri, maya. Adding to the list swara.", "shahid_9286": "❤️ salute", "raj18jan": "They deserve it. they are anti national. And you too. I really feel bad that my hard earned money go to the such kind of institutions.", "im_crazy_ash": "Mam sorry to say but you are not fearless, you dumb as full, cause ur taking a initiative to do conflicts in between you are not solving the issue. As you are influencing person you should be more sensible on this topic. And have some patience about it, as other Bollywood celebrity are not giving a comment, but you are doing aag me ghee dalne wla kaam Jo ki media kr hi rhi hai. You should be promoting peace but u just blaming the central government, why so. As a fan not accepting this kind of irresponsible thing from you, rest you know better as you are senior but think before saying cause with you u r influencing people with that.", "sheldon_serrao": "👏👏👏", "aman.vatsalya": "Whatever u said earlier according to that u r not even the citizen of this country...stop acting like stupid person 👏🙏@reallyswara", "kshitizoberoi": "Within 6 months this University will be closed in Bjp Government, Thanks", "_rahulsclicks_": "Lets trend #SwaraBasKar 😀😀😀", "aliyaa_mhd": "❤❤❤", "er_aanjaney.anu": "abvp walo pe left wale ne hamla kiya😳", "hector_el_fathar": "Khud hi dange karwao khud hi road pe utar jao. Bc", "swt_swtheart": "🙄🙄 politics JNU k andar", "er.attri21": "✊✊", "ordinary_mortal": "Kasam se khoon khaul rha. Mujhe sharam aati h apne un sabhi friends and relatives pr jo modi and bjp bhakt h. Pillo ki bhi aankhe 20 din m khul jati par inki na jane kab khulegi.", "dmkulkarni888": "Are you student?", "r_a_j_e_s_h_panda": "@reallyswara don't spread fake news..", "toamitsharma": "You are not a film actress, you are a real life dramebaaz! 😁😁 You do not even act your age", "misbachoudhry": "Well done ma'am💕@", "dinesh.rajpoot.106": "Jnu ko band kro", "zoyasiddiqui8630": "Kuch log kh rhe the bs muslim protest kr rhe h jo ki galat h hm #constitution ke liye lardh rhe h #jnu m jaa kr students ko maarna kya,sahi h ab to aanke kholo yaaro plzzz #nocab #nonrc plzzz amit shah abhi wapas le lo desh barbaad ho jaayega @amitshahofficial 😭", "dysfunctional_11": "Really proud of you that you are standing so strongly against what is wrong ..gives a lot of inspiration..we are with you ❤️❤️❤️❤️❤️❤️", "wahids993": "Can't believe they will go to such extent..", "rajesh___patra": "Inko free Kashmir chahie ye hai indian aur ye actress inko support karti hai", "_rishabhroyals_": "❤️❤️❤️Thanks For Saving Every Single Student,Teachers and other people from those masked people", "gamermaxima_reborn": "💯", "garg_sahab_betma": "😂", "rohanpandeyinsta": "@reallyswara suna hai video aaya hai jisme JNUSU ki president un SO called ABVP OR RSS k goons k Saath hai... Khair chodo... Aapko kaha dikhega ye sab😂😂... Vaise bahut ganda maarte hain bhaishab jisne b maara hai", "sushantsondhi6958": "Lmao", "nofear_2020": "Instead of Animals these pigs should have been thrown in Australia Bush Fire. 🤣😂😝🤪. Kaam mara re bahut marna chaiye tga.", "manishmwr10": "मैडम कह रही हैँ मेरे पास बर्थ सर्टिफिकेट नहीं हैँ, बाप दादाओ का पता नहीं, जमीन के कागज़ नहीं, तो फिर मैडम को DU और JNU मे एडमिशन कैसे मिला 🤔🤔🤔", "prakash_arya": "Shame on you @reallyswara you are also one of them who is creating dispute in our country. I was your biggest fan as a actor but after these kind of post. I don't have any respect for you. What do you think lady when your parents were in campus you were crying like Kid and when your parents are out from this campus you started to shout on social media \" Tum lathi charge karoge.......\" @reallyswara you are really out of your mind. Don't you know there are still families and kids. Shame on you lady really shme on you..😠😠😠😠", "yashodhanthombre": "Don't worry swara even if we could not get to JNU we strongly condemn this and will help this cause in every way possible", "vamini_sethi": "You go girl @reallyswara ... Bold and beautiful", "gold.gold88": "TERI MAA KA RANDI MARU...PATA KUCH HOTA NAHI HAI BAS GAND ME KIDA HAI TERI...BEHAN KI LODI PEHLE PATA KAR HUA KYA WAHA...RANDI KI PILLI...SAPNE ME BHI MODI AAKAR CHODTA HOGA TERE KO...😂😂", "_naughty.mama_": "Koi bhi aapki Movie aayegi na .. sbse phle mein Boycott krugaa...", "raghav020_": "💩💩💩💩", "stranger_rh": "Jj", "biraj.patnaik": "👏👏👏👏", "madhav_s_xxiii": "Achaaaa..ye karne se kitne bada liye followers 🤔🤔", "saurabhnegi9713": "Tu 🖕 1no. Ki Randi h", "yadne_shhh": "Agar koi kagzat nahi hai to vaise bhi illegal ho itne celebrity hokar bhi 😂 nikal pahile fursqt mai 🖕🖕", "sunnysinghjatt": "Fuck ye sab ku kr rhe ha koi btayega plzz kush smaj nai ataa puraa india ko shodke ek jnu hi ku protest krta ha", "me_fiesta_": "Tu bio me ye bhi likhde Sonia Gandhi ki aulad😂", "shandilya_": "Who knows who did this may be jnu student did this their own", "sanketwadmare7777": "Jay bhim", "rk_nits_2424x": "Jay hindurahtra", "mirrrzza_": "♥️♥️", "vishwavijaysin": "अगर फिल्मों में काम नहीं मिल रहा तुम मेरे घर पर आ जाओ कामवाली बाई हॉलीडे पर गई है पगार भी अच्छा दूंगा।", "asifhussain470": "Assalamualaikum,May Allah keep you and your family safe and make your courage worth.", "mohammad_sazid_ali": "Im With JNU student 😢", "mr_perfect14157": "Isiliye bolte he padhai likhai pe dhyan do aur ias yas bano..par nai tumhe to kundan ka nada khulvana he...chutiya..tumhare jeso chakkar ke chakkar me ache students ki study b disrturb hoti he...professor keh rae he kanhaiya kumar jeso ke karan hua sab..unhi ko support krti hena tu..aur police ghusti to kehte kese aayi police nai aayi to bolre police ko aana chaiye bc...hadd giri hui ho tum..azadi ke nare lagva jake ja", "manaswini__123": "Idiot asshole are you kidding me, it’s the fucking CPI’s Student group SFI and not ABVP", "ra.ju860": "🙏💙 proud c 😍", "artist.aj.chaudhari": "Women where were you when these poor students were chanting ani national slogans like \"bharat tere tukde honge insha allah\" and \" afzal hum sharminda hai tere katil zinda hai\" are you serious right now calling those goons on the dress of students becharas", "farhanrazakhan": "💞💞💞", "toyasiin": "❤️❤️❤️👏👏👏reallyswara...", "sheetal.kumari": "We are with you @reallyswara , people you are trolling you at this time really need serious help.", "truthzpa": "@reallyswara check my story and post", "iimkrishnasingh": "Hahaha... You guys deserve laathi...", "dj3534": "Jis tareh se tujhe teri mom ki chinta h. Esi chinta india k soldiers k liye b krliya kr.", "royalboy2429": "Modi jindabad love u Modi sarkar", "meme_bhagvan": "Hardkaur 2.0", "inherent.vice_": "All you stupid morons here.the last night attack by abvp on the JNU students.was because they were fighting against fee hike.for their right to education..it was not a Hindu Muslim matter.Andh bhakt,pehle reaserch kia karo.tb kisi ki abuse krne ki himmat rakho", "_kunal._thakur": "🤣🤣🤣🤣", "mukesh_b93": "Why there is only majority of muslim supporter.😂😂🤣🤣", "_krishnagopal_1203": "Abey tu samajhti kya hai khudko tum padhne jate ho kya jnu hain?? Attack hua thike abvp abvp karenge kuch proof hai nahi.lathi charge kyu nahi kare tum bus todo ho kaun tum top toh ho nahi your status huh my foot's status is better.", "zarr_21": "Glad to see few actors like you who actually give in about the country. A word is what matters;)❤️", "iamrst": "Report her account for hate speech. Throw her out", "suraj3108": "Fake indian", "improbable_direction": "We stand in solidarity with JNU qnd against the sanghis...... This system can be only overthrown through violent means... We must use their own technique to fight them as it is not possible to stop them by peacefull means....we must stand against them and fight for our liberties, our rights and future... Every student should organise themselves and fight the sanghis as early as possible.... Jai bheem, jai bhagat, jai bharat...", "girls_cars_models": "Swara should be renamed as suara", "vanshitatiwaari": "What's happening in the world. God pls help!", "kathiyavad__": "जानवरों के डॉक्टर के पास एक Lady आई जिनके साथ एक high breed का कुत्ता था। कहने लगी.... \"मेरे कुत्ते के साथ अजीबो गरीब problem हो गई है। मेरा कुत्ता बड़ा हट्टी (Disobidient) हो गया है..... इसे अपने पास बुलाती हूँ तो ये दूर भाग जाता है। Please कुछ करें.. I am very attached to him. I can not tolerate his indifference.\" डॉक्टर ने कुत्ते को ग़ौर से देखा। पन्द्रह मिनट examin करने के बाद मैं कहा... ये कुत्ता एक रात के लिए मेरे पास छोड़ दें। मैं इसका observation कर के इलाज करूँगा। उसने बडी बेदिली से हामी भर ली। सब चले गए..... डॉक्टर ने अपने assistant को आवाज़ दी...और कहा कि इसे भैंसों के साथ बांध दो और हर आधे घंटे पर इसे केवल पानी देना और इसको चमड़े के हन्टर से मारना। डॉक्टर का assistant जट् आदमी था। रात भर कुत्ते के साथ हन्टर ट्रीटमेंट करता रहा। दूसरे दिन लेडी आ धमकीं। Sir what about my pup? Doctor said__ Hope your pup has missed you too ...... डॉक्टर का assistant कुत्ते को ले आया़. ज्यों ही कुत्ता कमरे मे आया..छलांग लगा के madam की गोद मे आ बैठा, लगा दुम हिलाने, मुंह चाटने!! Madam कहने लगीँ: सर, आपने इसके साथ क्या किया कि अचानक इसका यह हाल है? डॉक्टर ने कहा: बड़े से एयर कंडीशनर कमरे, रोज़ अति स्वादिष्ट भोजन खा खाके ये अपने को मालिक समझ बैठा था और अपने मालिक की पहचान भूल बैठा था बस इसका यही वहम उतारने के लिए थोड़ा Psychological plus physical treatment की ज़रूरत थी___ वह दे दी,----- now he is Okay... सारांश ~~ *\"बस यही ट्रीटमेंट अगर देश के अन्दर : भारत माता को गाली देने वाले, भारत के टुकड़े करने वाले, आज़ादी का दुरुपयोग करते हुए आजादी मांगने वाले, , सीमा के रक्षक जवानों को अपशब्द कहने वाले और दुश्मन देश को जिन्दाबाद कहने वालों के साथ हो , तो कश्मीर ही नहीं पूरे देश से आतंकवाद और नक्सलवाद समाप्त हो जायेगा...\"* जय हिंद, जय भारत!", "imvtiwari": "@reallyswara Wht is happening in these day swara why nt u stand for them dear n wake up the society", "santosh.patil.isp": "😁😁", "royal_aditya_afficial__": "🙏🙏Hm apke sath h ❤", "nish_nt_46": "Madam aap nhi gye JNU.......bus bahar se appeal kijiye.....bus logo to chutia banayeye ......don't cry...go n protests", "rupesh.patil69": "Number of Universities in India... Why there is always problem with JNU / Jamia / AMU.... Why media n Bollywood support them... Students r learning in other universities also...", "__only__muksa": "Mc bhot din ho gye mullo ke fever me bolte hue na tujhe kuch politics me milega or na hi bollywood me latkti rhegi aand ki trah 😡😡", "flawless_befikra": "swara bus kar", "inocentheart_7": "@reallyswara I am happy to see this... Phale he bola tha ki BJP ko vote Mt do pr nhi.. Muje pta h in ki history k bare me or jamiya me violance bhi ek BJP k he leader ne apne aadmi bhej kr kra tha or muje pta h vo kon h but kuch faayda nhi h bol k... Kyu ki ab ya pr democracy Sirf naam k liye h ab tho lg tha h ki hum India me nhi h I am happy to see modi ji k sapno ka bharat but muje yhe BHARAT nhi chaiye but lena padega agar India me rehna h tho jaisa humari Govt. Bol the h maan na padega agar nhi manoge tho aap ko pta h kya hota h Iss raaj me... 😔 😔 😢 😢", "osho_rajnish1": "इस JNU कैम्पस को 1 महीने के लिए UP पुलिस और महाराज जी के सुपुर्द कर देना चाहिए, महीने भर में आज़ादी माँगने की जगह आज़ादी देते नज़र आएंगे वो भी जुर्माने के साथ। #JNUViolence #LeftAttacksJNU #ShutDownJNU", "socialaccountsfollowers": "You will witness violence in educational institutes only in West Bengal, Kerala and Tripura where Left is either in power or were in power till a few years back. Goons supporting goons.", "muskii051": "randi apni ma chudne se bachwa le", "jf543634": "Stay strong. Shame on anyone who justifies this violence", "adnan_smarter_786": "We really proud of you 🌺", "left_arm_medium_pacer": "Aazadi kis kis ko mili ye batao 😂😂😂😂 🏏🏑🏒", "mr_shakir_bin_rahim": "👏👏👏💥💥", "omgwording": "We all proud of you Swara for raising your voice🙏💖", "anaya_kapoor_1": "🇮🇳 HINDUSTAN KISI KE BAAP KA THODI HAI 🇮🇳 #RejectCAB #RejectNRC #azaadi", "pranhard": "Abe nikal", "kp7rathore": "Jay shree ram🚩🇮🇳", "hindu_rashtraaaa": "Flop actor bollywood", "neeluuru2019": "Thank God ,still hop in our heart.😇", "ajay_uikey_": "Deshdrohi 🖕🖕", "simmy_par": "❤❤", "koolchap7": "We can and we will bring down this government!", "ali.shahid63": "Really so sad", "msjodhpurian": "Ask all the woke idiots of Bollywood - 🔸 Where was your bloody wokeness when: 🔸 1. Leftist students cut wi-fi of JNU for 4 days (led by Geeta) 🔸 2. Leftist students didn't allow common students to register for the semester. 🔸 3. For last 70 days #JNU has become HQ of #UrbanNaxals", "jawa.anish": "@reallyswara You Urban Naxal...Jo desh ko todega him usse todenge...Jai Shree Ram", "snaya_thakur": "Faltu k drame band nhi kiye na tune randi ki olad ye India m kachra kar rahi h na tu sali 40 sal k uncle h jnu m unme se ek anty tu h movie m paise kam pad rahe h kya kapde utarne k jo neta nagari m utar rahi h galat news dekar logon ko apni jism se khichna band kar or sahi kaam kar warna godsay jaise desh m kitne hoge tujhe pta nhi kisi dimag kharab hua na to Tera bharta bna dega", "shotgun___.mj": "👏", "thisandthat001": "Huge respect for you Swara 🙏🏽❤️", "fareed.iqbal.35": "U r great mam keep it up", "_prideofpagans_": "L O L", "shreypatel_07": "I really appreciate you ..dt without any fear u always stand by Truth ....I hope all the artist in our country like you ..no one is having courage to speak due to fear of loosing name nd fame ...\"If the world had more people like you it would be a better place. You do make a difference...💐💐 @reallyswara", "supremesamrat": "TOPIWALI", "_shukla_pawan": "Iske phle kaa ek v video dikhaoo jisme tmnee kashmir me hue ghinaune kaand patharbaajo ko thokne ke liye bola ho sena k liye bola ho kashmiri pandito ke sath kya kya nhi hua wo mudda uthaya hu jativad v kro tm aur hm bne rhe secular ghntaa air madam acting v dekh lena nhi ptaa chle kahi deepak kalaal waali ki tarah yhi sbb krke pet bhrna pdee😂😂😂", "o_arjun_choudhary_o": "50 rs kaat overacting ke 😂😂", "rishabh_chaturvedi5": "यह के शांतिपूर्ण प्रदर्शन कर रहे हैं गाने गाकर ढपली बजा कर मुस्कान बिखेर कर उनकी डफली मुस्कान और उनका हमने देखा है जब वह नारे लगाते हैं अफजल हम शर्मिंदा हैं तेरे कातिल जिंदा है याकूब मेनन के समर्थन में रैली निकालते हैं और बुरहान वानी को शहीद बताते हैं और हमारे वीर जवान सीआरपीएफ के जब छत्तीसगढ़ में शहीद हो जाते हैं तो यह मिठाईयां बांटकर खुशियां मनाते हैं और जो कश्मीर की आजादी मांगते हैं और जो पाकिस्तान का समर्थन करते हैं और जो नारे लगाते हैं के हिंदुत्व की कबर खुलेगी एएमयू की छाती पर तो हम जानते हैं कि यह कितना शांतिपूर्ण प्रदर्शन करते हैं वामपंथी और कम्युनिस्ट रही बात पुलिस की जब जामिया में पुलिस घुस गई तो मैडम आप इल्जाम लगा रही थी कि पुलिस अंदर कैसे घुस गई अब पुलिस अंदर नहीं होती है तो आप इल्जाम लगा रही हैं कि पुलिस ने रोका क्यों नहीं आप पहले तय कर लीजिए कि आप चाहती क्या है अगर पुलिस को अंदर आने की अनुमति होती तो एक-एक को सुधार दिया जाता फिर कोई नहीं नारे लगाता कि हर घर से अफजल निकलेगा और आप जैसे नेता आग में घी डाल रहे हैं और इनको भड़का रहे हैं अपनी सस्ती घटिया राजनीति के लिए", "rssingh007": "Randiyo ka jamawada.....kutto ke jhud sher ka shikar nai karte beta swara", "afnan_aff10": "@vishaldadlani @instaraghu @raghavjuyal @dhruvrathee @rannvijaysingha @ayushmannk @vickykaushal09", "yogeshgadekar04": "😂😂😂😂😂😂😂😂😂😂😂", "alam_wafa": "🔥🔥🔥🔥🔥", "sudixit0102": "😂😂इतना मार खाने के बाद भी नही समझ रहे तुम वामपंथी कुत्ते 😂😂 @reallyswara", "_______dinu________": "Bitch why don't you open your tati mouth when any Nationalist get murdered... Anti nationals are on peaceful protest.. Ban JNU.. And shut this ass", "avanti__sharma_": "Tum jse chutiyo ki vjhse hi desh ki ye haalat hogyi h BC....", "kansagra_vaibhav_patel": "देके रहेंगे आजादि 😅", "praveenrajashekar": "https://www.instagram.com/p/B67S4vdFv1V/?igshid=wz78sz22mf1k", "wrestler_sujit": "Motherchod ka maa chuda gya h isliye itna nautanki kr rhi h", "iamking0063": "Dangayi ho tum", "chaitany_junawane": "Mam..tell me why lefties are stopping Registration of student n jnu?...5th january is the last date of registration", "nw___fl": "Stay strong", "gautamkikalam": "मोहब्बतों के बदले में तू नफरत का सिला देता है, अमन की मीठी चाय में दंगों का जहर मिला देता है । जो तू कर रहा है खैर खेल तो वह गंदा ही है, ताज्जुब ये है तू आईने में खुद से नजरें कैसे मिला लेता है। -gautamkikalam #gautamkikalam", "asroy071": "😂", "its_maruf2018": "ABVP Muradabad", "riyaohriya": "Girl, you are an epitome of how each nd every citizen should be like. So happy to have influencers like you around ❤️🔥", "shubham_singh_bhumi": "Aur chus le....😂😂😂 chamchiii", "amallick1991": "Besharam swara", "diablokkkk": "Pakistan kese chali gyi thi aap jab aapke pas koi documents hi nhi ,shyd aapke ristedar pakistan se hi h isliye pakistan walo ne bina documents k aane diya , sahi kaha na😂", "c.k_singhal": "Unfollow now...😢", "the.hindu.eye": "Fuck off Swara", "irfanhyder_bukhari": "👍👍👍👍👍👍👍👍👍👌👌👌", "arhan4617": "Mere Desh Ke Logon Ham Milkar Apna Desh Bachaye", "email.kkm": "Swara do u beating video...If u have please post .. 😂😂😂😂😂😂.. i want to see them ...👏👏👏👏👏😂😂❤️❤️❤️❤️❤️", "artfrique": "This comment section is full of comments by radicals, liberal Hindus, Congressis, islamists, naxals, illegal immigrants and other swara like people", "gopalsoni8456": "बाकी, आजादी ठीक से मिली", "sweet_prags": "Who the hell are u???", "ankitpathak1996": "😁😁😁😁fir se pelooo inkooo", "tubaqutb_15": "I m also a jnuite @reallyswara. It was horrifying like a nightmare yesterday....Thank God that everyone is safe 👍", "mr._ragav_gaur_": "Iski maa vha गुप्त दान कर रही थी 😂😂", "farukhi_bin_ramli_": "So proud of you @reallyswara The only Bollywood actor to voice out against NRC and CAB. Kudos to all your efforts. Much love ♥️", "realabha": "Vo lathi charge karte hain to tum SM per roti kyu ho fir .... if u have so much fervour in you ... then you must face it !! No ?", "dreamer24x7": "❤️", "gourav__yadav_7": "😂😂", "_rajputb0y": "@reallyswara we are supporting your efforts. Mtlb itna chikna chillana roj itne bhid mai khde rhe ke bolna really commendable. Filmo se nahi atleast is wajha se to TV pe dikh rhe ho. Aisa motivation sabko lena chyie. Mtlb fame chahe +ve mile ya -ve lekin famous hona tuje kitna jaruri lagta hai wo dikh rha hai. Arey apne kam mai koi puchta nahi tuje isiliye ab politics mai ghused rhi h apne 2 kaudi ka dimag. Wo bhi 💩💩se bhara hua..", "________shub_hny___": "सरकार हमारी है और हुकूमत भी हमारी है तुम चाहे कितनी भी अपनी अम्मी चुदा लो पल्ला हिन्दुओ का ही भारी है🚩🚩🚩🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 जय श्री राम @reallyswara @reallyswara", "youngwildndfreee": "Nautanki ho tum poori 😂 @reallyswara", "aman4987": "You are such a very cheap mentality lady I know these things are doing by you an you parents are also involve there so please stop all the things.", "sagartheseafarer": "Swara bastard😂😂", "aishwaryakarwaa": "Sabko pata hai Kisne kya kiya hai, CBI investigate kar rahi hai. Stop this drama you bitch @reallyswara!! Desh ka kha kr desh ke hi against bol rahi hai... Bahot tolerant govt. hai isiliye khule ghum rahe ho tum, congi sarkar hoti toh tum sabki haalat sirf bhagwaan ko pata hoti kya hoti!! Shame on your SWARA SHITTY BHASKAR!", "k._i_n_d": "Respect for you", "bellafawzi_": "Alhamdulillah 🙏 I hope everything will be ok", "chirag_vacheta_01": "🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿", "vaishhh.__": "@reallyswara you can go and stay in Islamic countries and let us know how it goes? Because vaha pe Rosa ke din khaa bhi nahi sakte😂and also secular word was never the part of our country and constitution it was added by Indira Gandhi when she imposed emergency soo this amendment itself is a unconstitutional and we all know which religion belongs to India and which not.", "_abyankhan_": "So happy to see celebrities like you take a stand on national issues. Other self minded celebrities our there are sitting at home with their mouth shut, not voicing their opinions. Grateful to have people like you in our country 🖤", "kumaramitsharma456": "dalli ko aaj unfollowed kar rha hu", "abhimanyusingh595": "Shut down this university... bekar students", "_zebaaaa_": "Allah ka shukar ❤️", "abed.hussain": "@reallyswara so happy swara mam and thank you❤️", "bariya1177": "Aise kaise chalega bharose wali aunty", "_immi_99": "Kaisa desh tha mera kaisa desh hogaya mera..... 😭😔😔😔😔", "mr_brijazz": "Tu Instagram or Facebook pe post karne ka alawa kuch nhi kar sakti", "vijay_thapliyal97": "Bss apni maa ki fikkrr h aur jo tum log Bharat maa ko jalaa rhe ho uspe tere aansu ni nikalte👎👎", "shivam.mittal.7248": "Ab tera dada ko document mil gai kya .... Anti- nationalism..... Agar nhi milai to ab bhi time h jaa apni maa pakkistan k pass", "divyachandel12": "Long Live JNU🌸", "shaggy.unlimited": "JNU mein Kya padhaya jaata hai? Bhaarat k tukde karna? Har Ghar Afzal Paisa karna? Aisi universities band honi chahiye hamesha k liye. Useless people like you are the products of JNU.", "__light__y": "Go suck RAGA’s dick you congressi bitch...🤣", "kumarshetty9": "Madarchoth. Hai. Sabb", "imarjunrajput": "Profile m hi likha h dramebaaz", "akshaypandit661": "Swara Bhaskar kabhi Pakistan jay or jnu me abvp karykarta bankr jay aap ko sabki sacchai PTA lag jaygi lekin ye Randi Rona na Kare plzz", "muduzushaikh": "M salute to all and specialy you swara", "ex_secular_": "😂😂😂😂😂😂😂", "journosujata": "FYI ...Agr koi sabse zyada pakistan se india ko compare karta hai to wo hai bjp govt....Itna compare kia ki hindu pakistan banane per tule hain.... Ye Loktantra hai aur hum nagrik ....\"praja\" nahi...", "congress_blr": "Rest of the mute celebrities has to wake up", "kavitapanghal": "Koi nai mara...drama movies mai.kia kro.vahan paise milenge...yahan chutiya harkat mat kia kro.", "saqiblovesyou": "We need more warrior women like u to make India great again😍", "rajput_1709": "कई सारे ABVP समर्थक छात्र लापता हैं, जो भाग नहीं सके कुछ को गंभीर चोटें आई हैं....ये ABVP के विरुद्ध षड्यंत्र था, ABVP समर्थक छात्र-छात्राएं घबराए हुए हैं, हॉस्टल छोड़कर चले गए हैं। ये AISA और SFI ने बाहरी हथियार बंद गुण्डों को बुलवाकर ABVP वालों को पिटवाने का प्लान बनाया था..", "amitkashyap_": "Hahahahah maa chud di JNU ki toh🤣😂🤣😂😂", "justsaroj": "Bakwas... Dear swara please chek your stats first.. 😠😠", "do_not_stop_akshat": "🙌🙌", "_nilesh_9": "Traitor go to Pakistan India mei Koi Jarurat Nhi hai trre Aur jaate Jaate over acting k 50 rs De Kar jana", "sachin_pratap95": "😂 😂 Jnu hi band krdo topic hi khatam kro", "al.iya8019": "Brave laday💪", "_prem_thakur__": "De key rehngey aajadii", "shaham_s_khan": "Thank god...", "sandeepprajapati.s": "Kuch bhi hot bhai vote to bjp ko hi Dena hai zindagi bhar", "azxx_n": "Thank god", "_mr.cool28_": "Support Caa guys ! Its for ur own good ! Dont believe fake msgs beiing spread by illiterate peoples", "dhirajnikam_": "Jnu should be banned. No more drama", "rockpandit": "Jnu ki ma ka bhosda", "arshad_iqubal": "Khuda ka suqr h...", "sanjaypatil1044": "😄😄😄😄😄", "intellectual.sapiens_official": "I think JNU valo ka placement confirm hai shayad. That's why they are not focusing on studies. Only extra curriculum 👻😂......", "flavia_.pereira": "❤️", "dhanu.trivedi46": "Don't you have Films to do.......ohhh I forget about Your Dumb acting Skills😂", "samk0124": "Proud of you @reallyswara", "ujjwal_.g": "the world is falling apart. i guess we all need to try and cling on to something to help keep our sanity in check. well i am proud of you and all the people who gathered outside JNU to help protect the innocent students and teachers trapped inside the campus. amazing 💯", "satvikpandey8": "Aatankwaadiyo ko baad me...pehle iss bhen ki lodi ko marwao koi🤦🏻‍♂️", "ravira7944": "Ye kejiriwal ne karwya hai", "shete4177": "The most funniest thing is '' swara bhaskar's mom live in jnu as a student\"", "imush52": "Hope from wise citizens", "ankitsingh5733": "Tu na politics join krle @reallyswara", "pranjul_sharrma": "Aur aap itni samajhdaar hai ki aapne camera k saamne btaya ki mere mummy papa vahi hai 😂😂😂😂😂😂😂 accha btw ma'am you are a really good actor but bad sometimes just saying 🙂", "chaaaaqw": "🤮🤮🤮 Goons of jnu trashed by goons of jnu lol jnu don’t send kids to jnu,", "ehsumimi": "🤗🤗🤗", "jasmin_s_786": "🤣🤣😂😂💩😂💩😂💩😂", "melbinjothomas": "There are many superstars in Bollywood but only one superhuman. And that superhuman/superwoman is you Swara Bhaskar @reallyswara", "raj7359singh": "😂😂swara aunty mtlb film nhi mil Raha hi to kuchh v katrngi", "nawaz_ar": "May Allah strengthen you @reallyswara", "deviiil__": "Dar gai he sarkar students se", "raj_the123": "jaha jaha left wale rahege wo hinsa karege kyunki unke blood me yahi hai !! isliye left ko khatm karege desh ko bachayege", "kadwa_truth": "Aurangzeb k time pe kaha thi", "sheikhlk": "You r the real hero of bollywood..", "dpchoudharyo1": "🖕 yaha to badiya acting kr leti h tu mc 😂", "sajeda.sheikh": "Aazaadii🇮🇳🇮🇳", "nehajohari67": "Stop blaming govt for everything .It was your own friends ,the leftists who are responsible", "vinny_vinny_001": "Shut down JNU ... coward and traitors live there .. Shut before people themselves start hitting JNU", "naush289": "🙏🙏🙏🙏🙏🙏🙏greattt jnu is doing alotttt for us", "therealmanishbansal": "#closejnu", "rashidulhassan": "👏", "rajiv_kawad": "🖕🏿", "udaipur_explorer": "She was unable to produce to witness for NRC and now she told that her parents are in JNU , Yahi hai deshdrohi, or sikh bbi vahi ae mili hai, maaro gaddaro ko", "6109.sa": "🙌🙌🙌🙌", "cook_with_shaan": "Alhamdulillah .. @reallyswara waqt hai dikhane ka unlogo ko k abhi b Hindu Muslim ek hai aur her waqt sath khade honge", "rameez_marakkar": "Stand with JNU", "ajju_bhaiut": "मित्रों JNU में कल जो भी हुआ हम उसकी निन्दा बिल्कुल भी नहीं करते हैं ओर उम्मीद करते हे आगे भी ऐसा ही हो--- जय जय श्री राम", "pra.chi.1": "JNU is doing the best it could to save India! And so do you @reallyswara! Thankfully we still have brave souls in this country🔥", "ashamed_shaik": "Ur the best love you didi", "zaynakram5": "Hamko wo dando se marte hai . Ham yuva shakti hai . Hamko kyu dabate hai. Ham aapke beta beti hai .. Ham phul s baat krte hai . Ham thori danga chahte hai . sarkar khamosh hai . Wo insaan nahi wo haiwan hai. Wo adamkhor ki santan hai. Ham ekta ki baat krte hai. Wo nagrikta sabit karne bolte hai . Ham khilaf e hukumat hai . To wo danga sochte hai Ham phul s baat krte hai. Ham thori danga chahte hai . Bharat ek khwaab hai . Jisme baste Laxman,Adam ,Singh ,Nawab hai. Khwaab to sabka hota hai .. Wo thori kisi k mohtaj hai . @reallyswara", "thousif_313": "You are true indian mam, despite of having so many spine less khans in bollywood who makes crores frm us..", "vishal_shahpura": "JNU में बढ़ती राष्ट्रवादी विद्यार्थियों की संख्या को देखकर नक्सलियों का ABVP से जुड़ने वाले आम छात्र व छात्राओं पर खूनी वार करना कहीं न कहीं यह दर्शाता है कि जंगली भेड़ियों का अंतिम समय आ गया है।", "guru_3785": "Yeh saale padhne jaate hai college ke lukhagiri krne 10 20 mar he jaaye to achaa hai wnha roz roz ki.magajmaari.hai", "aminarahman08": "I was shocked when I heard the news. My sister is also in JNU, I called her but couldn't reach her then after an hour she called back and told me she was fine. But I couldn't talk to her longer due to network. Pray for all the students who faces the terrorism. JMI, AMU AND NOW JNU ENOUGH IS ENOUGH", "emroushan": "Aapki mom abhi v jnu me hi padhti hai?", "salechasaloni": "😂😂😂😂", "naziyamudassir": "Respect for you lady😘", "banguuuu": "No other job right?? Supporting something stupid and terrorism as JNU? Just wanna say don’t dare mess with BJP all country loves it and supports it 💕😂! So realise no one is gonna support u in this shit😂", "_pratik_24_": "Itna kuch kar hi rahi ho to students k sath mil k free education in all over india ka b campaign chala lo i will support ye sab natak he 2 se 4 din chlega fir wahi sab daily routine....kuch karna he to students make india free education country", "surya_abhishek_": "chal bhag", "salman_khan1206": "Nice to see lot of people in large number", "jass_me_jass": "Hmmm", "rahulpancholi007": "ज़ी मीडिया और मोदी मीडिया इसे लेफ्ट विंग का कारनामा बता रहा है कितनी गिरी हुई और बिकी हुई मीडिया है हमारी", "ahmed.avais": "Keep up the good work Mam🔥", "arif_nitrate": "@reallyswara proud of you ma'am", "samar_ishan": "Solidarity with jnu students", "behoray": "Why do u always blame gov nd police ,Swara why u day aleays opp. To the gov why do u not thank the police they were also there nd kyu tum logo pe ho wo lathi charge karenge ,do u know why is doing it first know the facts then say to others .... PLEASE DONT DIVIDE INDIA UNITE INDIA JAI HIND 🙏", "instaanuragg": "Abey chal shameless 3rd grade biharin ! Apni mummy Barkha dutt se puch le usko sab pata hai kisne kia aur karaya, wAise pata to tujhe b hai !", "priyanka_kadwe": "Shame on you swara ...just get lost from here", "asf174444": "Good to know you are safe take care @reallyswara", "her_art_index": "❤Alhamdulillah", "the_mountain_wolf_": "Don't start such things which can't be stopped . 🔥🔥i.e. hate", "akhan1569": "Hum sb saat hai good👏", "nahul_12345": "Peetau chutiyo ko 😂😂😂😂😂", "puresin121": "You are an angel ❤️", "navneet923242": "Swara Bhaskar not getting films,using cheap publicity stunts to get publicity and hoping to fetch few films..where is your words when sikhs gurudawara been occupied by Muslims in Pak?Where were you when Hindu girls are raped,forcefully converted! You are sick and twisted human being and people like you should be kicked out of India", "streets_of_mysuru": "Tukde tukde hogaya jnu 😂", "_imsachan": "❤️❤️", "impvn___": "I support NRc", "marching_boy123": "❤️", "tripathytapas": "😀😀", "mishrrra": "Nautanki karne ka koi mauka mat choriye aap!! Politics me ana hai to sahi waqt hai aur intejar mat kariye kud pariye! Luka chupi na khele to accha hai!🙏🙏", "srinathanna": "😂😂😂😂😂😂😂 Iam loving its", "generaltariq1": "May god bless u always, preys for u b' coz u r always speaks about injustice and for deprived keep on mam we all r with u 👏👏👏", "tanvickamat": "❤️", "abdul_k_s": "💪💪💪🇮🇳", "vinisant96": "Movies milna bnd ho gyi kya tere ke", "ranjitsoh": "शर्मनाक लगता है अब देश के सामने और बड़ी चनौतिया आने वाली है क्योंकि बर्बर इस्लामिएस्ट मुल्लाईयात और कम्युनिस्ट विचारधारा देश के उच्च शिक्षा संस्थानों में वायरस की तथा फैल चुकी है और इनकी अगवाई चंद चरित्रहीन आयाश बडवे सेलेब्रिटी और अपने आप को देश की सबसे बड़ी सेक्युलर पार्टी बोलने वाले कांग्रेसी कर रहे है", "khaledbeydoun\nVerified": "Verified", "my_0ther_side": "Country does not run on your emotions.. countries all across world are taking actions to stop illegal immigrants..and in India educated youth protesting to stop govt from throwing illegals.. irony.. hope they will understand when something bad happens to their own family by those illegal unknowns..", "sabriboy786": "🙏 ye bcho ko markar desh ka vikas kar rhe hai🙁😢", "rizvianjum": "👍👍👍👍👍👍👍", "shail_kush": "Aree randi ki aulad tm jaise bharve ar prostitute kuchh nhi ukhad payenge.............", "goateewink": "You are a superstar keep shining 🤘", "saifalx": "🔥🔥❤️", "djay0775": "Best role in comedy goes to @reallyswara 😂😂😂😂", "laxmi.gautam.165": "👏👏👏👏", "atul.mane1": "Great...👍", "bhawnavaidh": "Really your efforts are appreciable.", "balram_sharma__": "Agr ustime 100% migration ho gya hota to aaj ye problem na hoti... Kuch dino baad fir ek nyi country maangege..ldkiya inka soft target h.... Inko ghazwa e hind padhaya jata h... Kuch bewakoofo ko smjh nhi ata... Ye slowpoision h bahut dino baad affect krega😠", "sanatan__gyan": "ache se Pele gy na 😂😂😂", "salmanism02": "Why so many students together cannot take care of few goons ?? Until when will these goons of rss continue like this ??", "ann.varghes": "❤️", "heelshealthandhappiness": "Sending lots of love and good karma your way", "nitesh_choure": "👏", "onelastcigarette_": "Hum sab ek hai", "rohan_parashar_": "फ़र्ज़ी एक्टर है रोना धोना सब नकली है एक दो इसके भी मारने के थे", "blessingforworld": "Students are not even safe in their campuses !!?? What should we expect now ??? Gunde aakey maarke chaley gye aur police Kuch nahi kar rhi ???? Is this the solution ??????? Kisi ka maatha foda , haddiyan tuti , is this what we should except at good and reputed colleges like JNU ?????", "bijaykumarrathore": "बूढ़े बच्चों की कुटाई", "the_rana_s_": "Gets lost", "ruksarparwani": "❤️❤️❤️❤️ be safe", "h.k.kashyap_1": "Painfull", "aneeshkannoth": "👌👌👌👌", "k_naseemahmad": "A brave woman....#really swara", "pankaj.singh_deoria": "ये सब ध्यान बाटो प्रोग्राम है।असली मकसद हिंसा के आड़ में पेट्रोल और डीजल का दाम बढ़ाना चाहते है।", "cheryl_amy_": "Alhamdulillah. We love you. Stay strong🌺", "shroff18": "@rashul21", "mohduzair_": "❤️❤️❤️", "mohakhan03": "https://youtu.be/GiCxcQRh0Zg", "rashu_thakur": "Aap nhi aaye apni mom ko bachane ,btw face covered logo ka kaise pta chala ki wo kis party ke hai aapko ,nd jnu ki fees kitni badhi hai sorry huge ka mtlb btaye kitne badhe sabko pta chle🤣", "masiraakhan": "Lots of love to this woman cause she is the one who is FEARLESS . And this should be the attitude.", "knowtices": "♥️♥️", "nia_casrod": "🔥🔥", "jitu_573": "Sabko pta he naware nathare students he , jiska barpur fayda utha skte he", "rajsingh_pat": "Jnu बर्बाद हो गया। आपका क्या गया? कुछ नहीं। न दक्षिण का गया न वाम का। गया इस देश का। देश के एक सर्वश्रेष्ठ संस्थान की ह्त्या मुबारक़ हो। रोज-रोज घोंट कर मारा गया jnu मुबारक़ हो। करते रहिए विमर्श कि कौन दोषी? कौन पीड़ित? देश ने पढ़ने लिखने वाला एक संस्थान खो दिया।बस।सच पूछिए तो कईयों के लिये शायद ये कोई नुकसान भी नहीं।उनके लिये ये बस स्टेन्ड पर गाड़ी बुक करने वाले एजेंटों के दो गुट का झगड़ा जैसा,सब्ज़ी बाज़ार में आलू-प्याज़ व्यापारी के गुट में भिड़ंत जैसी सामान्य घटना भर है।जय हो। साभार :----निलोत्पल", "dare0devil": "✊🏾✊🏾✊🏾✊🏾", "kshitij_130599": "Chutia ho tum 😆", "sujeet.suman.7967": "😂😂😂", "dalim.khan.796": "Shameful govt 👎👎👎👎", "biplab_biswas93": "Tujhe Mara to nahi ......Tere jaise gaddar ko marna vi ghatia Kam hota hI", "45_mk": "#StayStrongJNU", "trupti.deshmukh.31": "If they say \"Pakistan Zindabad\" \"Hindustan tere tukde honge\". Tab apki \"morality\" kaha jati h.. ek baat toh samajh aa gaaii hai k JNU me bikau neta bante h. Stop publishing their news through any medium, they will not do any stupidity again.", "kuldyypbisht": "Kuch dino se thoda out of focus ho gye the kuch to krna hi tha krte rho achi acting krte ho sb log🤣🤣🤣", "kumarrmaheshh": "Jab tak modi hai tab tak ye mumkine hai", "palash2k17": "Very good acting performance last night.....hope that producers do watch you.....hooe u got ur payment.....keep it up", "_ruheena_khan": "Ua using ua celrbrety status in a very good way....every celebrety should come n raise their own voice", "sahilnaqvi29": "No need swara ur mom my mom dnt take tension", "_abhisheklokhande": "Swara ji if you don’t have certificate how come you get passport!!!! Can you live like the same without certificates identity in USA please. Don’t try to come out and grab the fame.", "meetdspartan": "What a real mess is this university, peeps go to University for education & these folks have converted it into some sort of political hub with retirement home facility.", "hnr10": "🙏🏽", "guru__bhat": "Don't you have birth certificate😥😥", "rishi_b_theofficial": "Isn't this Democracy and great government that is Infact allowing all these protests to rake place. Consider doing this during emergency period. 🌹", "nafrazmohammed": "😔 😢 sad night", "i_am_a_stormborn": "Thank god everything is under control now", "farhana_77hotmail": "#standwithjnu", "rv.cheers": "Ohhh god....kitna sily post h .....😂", "asif_sheikh_007": "We love you @reallyswara from the bottom of our hear we respect your courage #girlpower💪 ❤️", "daudqamran": "Hats off swara🔥", "taranbal_": "👌❤️❤️❤️", "ashique_cp": "🔥🔥", "nem_esiak": "@singhhh_in_a_mist", "positi_positive": "What about the fires in Australia? Why no mention of that? You are a contributor to global warming.", "raj_bora197747": "कितना बेवकूफ है। मेरा देश और देश वासी.. चंद भाडें के टट्टु देश में अशांति फैला दे रहे हैं।", "zohrachaudhary": "@reallyswara good job man.", "isaabellaaa235": "I don't get a point, why the hell your parents stays in JNU hostel? , are they students? Enjoying jnu facilities and all , shamefull", "shadabazam786": "Inqalab Zindabad✊✊", "kushagrasinghgautam72": "Hats off more power to u n all protesters being a indian and a true hindu i feel proud ovr secularism in my country.at the same time feel pity ovr students passed from whatsapp university for them every protester is a terrorist...well here i am a proud secular terrorist ✌👍.", "pablo_escobar0821": "phir bhi aayega toh modi hi", "nazwaquar": "Really 🙌 thanx u also swara ... 👏", "karthikbj": "bitch", "meenaljain1_": "Side effects of free funded education 😂😂😂😂lolz nice drama", "namscheri": "♥️♥️♥️♥️♥️♥️", "_a_sl_a_m": "❤️❤️❤️", "divya_being_humanist": "Yeh metro band karenge, hum paidal2 jayenge - @vidushak", "aditya__katariya": "❤️ ❤️", "jay.das.3785": "Swara maam please dnt be panic.. JNU is Indian university not so called paki university", "suren69": "👍👍👍", "sajad.xan_": "What happened?", "vjboudhz": "I m with JNU.....", "omarmuhammed7866": "Stay strong we are all with you JNU❤️", "majid_matter": "Brave woman.respect Swara", "nayeemshaik04": "❤️❤️🎉🎉", "caughtinamiracle": "My country is not a DHARAMSHALA that anyone sneaks in and should be welcomed to stay.. these students are fighting for people of their own religion no matter if they are Indians or the ones living in our country illegally.. no other country in the world would ever let any illegal immigrants live in their country and should not. People like you are supporting all this, what a Shame you are Swara.", "_asna_jabin_": "More power to u 👍", "varsharitu55": "God Bless India......Stay Strong", "spacewalker293": "Just throw out the dirty , communal, unconstitutional politicians. They can only make Violence & discrimination. The violence created by terror so called political chamcha.", "rehan4": "👏🏽👏🏽👏🏽", "ilgnaouibrahim": "👏❤️", "anilbepu": "Red Salute!!", "manish.bhatia2613": "Oh u didn't come to save your mom today? Where were you? Awww must be confined in your secured hime having a glass of wine and glued to tv for another script? Such a selfish and mean child u r ...Oh I forgot..u will turn up in few days with your well rehearsed and choreographed speeches to further instigate venom....such a great contributor you are..at ur calls turn up other hooligans and people who still cherish freedom..an intelligent Delihite who could sense this didn't turn up today to save your Mom..because they know when something real will turn up against their mom..they all will be standing on it's way to save her from her internal enemies first and her outside one's...#Shameless #PseudoNationalists #limelightseeker", "rizwan.taimi": "Aawaz do hum 1hain", "kabhi_kabhi_dil_main_kahyal_": "Stay safe ma'am.", "baigarqam": "Please focus on shaheen bagh also", "anastitwa52": "resist fascism", "sharma.chitwan83": "💕🌹❤️💋 @reallyswara", "itstuba_zafar": "We all love u @reallyswara ❤️ Stay Strong😇", "mandeep.____.17": "@reallyswara is the VOICE♥️♥️♥️", "rohananand7": "1. Afzal ham sharminda hain tere katil abhi zinda hain😂  2. Bharat tere tukde honge inshaallah inshaallah😂  3. How dare Delhi police entered inside Jamia a few days back without university's consent and today we are shameful of delhi police who didn't enter JNU and took any action😂  4. Left did absolutely right thing in JNU today by not letting a students group to register for admission for further education and chased them down to their hostels and thrashed them hard, broke their heads, hands and legs off to admit those students to AIIMS😂  After all hamare bap ka JNU hai bhai we must not forget that. Free mein thodi padte hain bhai fees dete hain aur manuwad se ajadi bhi toh leni hai🤣🤣", "__lvulili__": "👏👏👏👏", "rantaramic": "Keep up the fight, Swara. You're one of the good ones, who uses their platform for something worthy. Glad your mom is okay now.", "am_akibvohra": "JNU teri himmat ko hai salam hai salam", "niyazkh96": "Everyone #standwithjnu", "arzaiaman": "👏👏👏👏👏👏👏👏👏", "kirtirawat550": "❤️hope it remains peaceful...... police is also in pocket of these dirty politicians @reallyswara thank you for the information mam i called my friends and asked are they fine or not they are still in shock what happened inside jnu was unexpected.... police was doing nothing at all they will not even do police will only beat students and say they were creating violence nothing at at at all police will do till people will force them to act .... #freeindia #saynotonrc", "rathore.bhanvi": "🙏🙏 so grateful to all the protesters for saving humanity by saving so many lives today..so grateful", "swaleh20": "U r the strongest Bollywood star talk fearlessly", "burger_pizze_khate_rahe": "🔥🔥👏👏", "me.4150": "The brutal attack on JNU students & teachers by the coward masked Fascist goons is really shocking,,,the coward Fascists are afraid of the voices of our brave students💓Jai Hind🇮🇳💓", "khansa_fahad_": "Alhamdulillah 🥺", "dhwaniray": "❤️❤️", "p_a_a_c_h_o": "Proud of you 🙏🙌", "arshiyan_shaikh_1234567": "Be strong we all are with u", "toshheyyy_": "✊✊", "luckyyusra": "💕"}