{"dhanraj_dodia_702": "Paise leke I ye thi protest karne kutti", "soniachauhan2006": "I think up police and up government is doing good 👌 👌 I should clap 👏 👏 for them", "sanjjanna_galrani": "Kya aurat h tu", "prash_pp_pp": "🐖🐖🐖🐖", "mahen2570": "Bollywood se berojgar Ho gai.. Low mind", "khushitiwari_22": "Caa nrc cab toh aaega he. Bcoz NONE OF THE INDIANS WILL BE AFFECTED BY THAT. ITS DONE SO THAT THE TERRORISTS AND ILLEGAL IMMIGRANTS LIKE \"TAHIR KHAN\" ARE OUT OF OUR COUNTRY DUMB BITCH", "ankitkeshri707": "Abhe to madrchod ke bacche gyab ho @reallyswara Aapne baap. Aur maa ke gannd me ghus kr bathe ho", "arvindv23": "@rvcjinsta @be_harami @adult_seens bhencho ye ajay vist bol skti hai..arnav Antonio maino nhi bol Skta", "terababu92": "Bhenchod jab tum ko kam nai millta tab tu ye sab kar na shuru karte ho", "r.k.meena_official": "ये बिक चुकी है र N D", "the.splendid.life": "Kya fuk rahe ho aajkl?", "talha_traveller": "🤣🤣🤣🤣", "rasikaborade9016": "Abe chakko lavdo madarchod ho tum deshdrohi", "mr_cute_jay": "किसका लंड चूस रही है इमाम का", "jaspal_singh_rathore_": "Vo to kb ka me gye tum dono ki wzh se", "rawatsuraj666": "Or ish maakeloude ka lund chus k ishki hi bhasha bol k tu kya sabit kar rahi randi", "naveechotu08": "Arehhh public ki najar me ana h to bc jis field se ho uspe kuch kro bc ye hindu muslam ka ajenda ku chla ra ho... Aur jo chiz hai hi nhi uska protest b had hoti h .. agr tmhe bdlana h to next year sarkar bdlana aur main bt bc kashmiri pandit k time pe tm jaise log Kahan chle gye the @rawatsuraj666", "meirresistable": "Aapko un Kashmiri pundito ko BHI dhoondna padega Jo nare Gaye aur Jo bhatak rahe Hain aadha sach poore jooth se BHI khatarnaak HOTA Hain aur wahi aadha sach Aapka hathiyaar Hain unfortunately", "yogichauhan7": "हाँ तो UP police है ग़लत करोगे तो पेले जाओगे और साथ में नुक़सान की भरपाई भी तुमसे ही करवाएँगे🔥", "ananyathesingh": "Urdu me likh na,hindi kyu bolti hai. Jnu ja kar maa ke saath gand phaila", "sauravchauhan74": "अब कितने का पैकेज मिल रहा है हाफिज सईद भड़वे से?", "k.a.r.a.n_t.h.a.k.u.r_": "Aaao tm bi peli jaogi UP m", "ajinkya_deokar_007": "Hum teri marke denge azadi .....aao kbhi haweli pe😂😂😂....", "_md__khan_": "Andh Bhakt dekhne hai toh comment section m dekho... Ek se badh kar ek jh2 milenge🤣", "indiaonmymind": "नीच", "kritisanon328": "Him denge tum katuwo ko azadi", "anuj_taunk_28": ",देशद्रोही आतंकवाद समर्थक है यह R**D", "amitkoeri": "Full on weed high....", "sharmapuneet01": "Okhla ka gunda or dusri bihar ki daasi.....", "jit.suthar.359": "😂😂", "imbhuvanjoshi": "Abe isko toh pehli fursat mai bangladesh bhejo😂😂", "pranay4u": "Good job UP police, this work of police is expected in every state of India, specially in Mumbai🤣🤣", "dhruvvsonii": "Kitne milte hai terko ye sab pakadne ke 🤣🤣🤣🤣kyuki movies to Milne se rhi terko yahi se ab Teri income aati hogi", "hitender4u": "Koi kaam nhi mil rha Kya, kuch bhi Kar rhi h. @reallyswara u r fooling India. There's no reason to stand against #CAA , u should support CAA", "prashant_tyagi01": "Ye mulle k aulad hai 😂😂", "singh_neeraj__": "Camera dekhte he acting chalu cut cut camera action😁😂", "blackheart_rp__": "Tu bhi chutiya nikali.....tumako bhi dete he azadi.....", "riya3862020": "Isko koi mental hospital chhor kar aao", "abhinavpandit_yoddha": "Bnale film hitt karvaenge", "pratik.gupta.7587": "Stupidity at it best this is not cab it’s now caa", "rishi0291": "Tum Kundan ko nahi joya ko khoj rahe ho jisne Kundan ko bomb se udwaya ..", "apoorva_namdev": "Dimag thikane pr h madam..??", "mein_kafir": "Lelo azadi 🖕", "parnav_bhatt_99": "Ye up h yaha nahi chle gi tum jese chutiyo ki😘", "jeet_m77": "😂😂😂😂😂😂", "anirudhkumar495": "What about Kashmiri Pandits", "nitesh_singh1308": "😂😂😂 दिल्ली पुलिस थोड़े ही वो मैडम । जो पीटकर बेट जाएगी ।", "mskarayat4080": "Tumhe bhi pelna tha saale dangaiyo tumhare baap ki property nahi hai jiska naash kar rahe they... Well done UP police👏👏 well done @myogi_adityanath ji well done we Uttrakhandi proud of you", "amit.4488": "Tera bhi nbr lagega..", "avi_s_rampure_55": "इसको report करो सब", "radhe_karn_": "Tm dono chutiya", "jeevankunwarchundawat1999gmai": "Ak thappad un logo ki nhi kha lo bhasker", "rishab8247": "Desh ke gadaro ko ..... Aage toh pta hi hoga", "haazir_jawaab": "Shameless Actor’s both are hypocrites and desperates", "adv_vishal_sharma": "तुम लोग और मार। तुम लोग बाहर भी तब निकलते हो जब तक पूरी सिक्योरिटी ना मिले। डंडे खाना तो दूर की बात है।", "_subhashgupta_": "kaam nahi mil raha film me naa re isliye politics me bakchodi suru kar di naa...🤣🤣😂", "ankitchoudhary_25": "@reallyswara Only She Can Vote Without Voter Id Card🤣🤣🤣", "mr.surendra": "😂😂😂", "vaishnabi_singh": "💩", "vinay_chauhan0214": "desh k tukade krne walo ki sath khdi hai", "whoizpratik": "Wahhh dramebazzzz are inko dedo azadi 😂😂😂😂", "shubhuyadav1425": "अरे बिंदिया कुंदन के पैजामे का नाड़ा इतना कमजोर नही है जो तेरे ब्लाउज के 2 हक से खुल जाए dedicated to support to NRC AND CAA", "uday02.shah": "Hamko JNU se tabhi se nafrat Hain jab JNU ke joya ne Banaras ke kundan babu ko goli marwayye tha...", "elon_cult": "Jhatu", "kunal_desai8731": "Real hindu support naa and nrc", "shivamdubeyroxtar": "Galti se dikh na jana UP me protest karte huye..... Bahut kute jaoge ....😀😀😀", "pinku_routray": "Halala ki aulad sali", "islakabir1": "How much did congress pay you?", "kalpesh8141": "Randi teri konti niyat shaf hai bc sali", "gauravpansheriya": "@reallyswara #aunty aapko kbhi bhi hindu ke liye ladte nhi dekha... Aapko kab pata chala ki aapka #baap koi pakistani hai.. Only say truth #aunty..", "30uttu.utsav": "Kisko insaf chahiye ye bataiye...Kya is desh ka Muslim akele h?Arey jo bahar se h..Aur is desh ko ganda kr re h..Unhe bahar krne ki baat ho ri h...Desh mai kuch accha kam ho ra...Aur tm lg desh k khilaf baat kr re ho...Mar to tmhe b padhni chahiye fir", "niketsahu": "Gandu or jhatu done ek frame me ❤️", "nitika_himashu_sasha": "Dramebaaz aunty", "shadab.ansaari.9": "Dabang👏👏👏", "paarth41": "Pyar bhi jaruri hai😂😂😂", "i_amabhinav": "@reallyswara Azaadi chahiye to parivaar samet aa jao...yaha aapke swagat aur mehman nawaazi k liye lathiyan rkhi hain tel pila k... Address bheju?", "utkarsh__.singh": "We support caa and nrc", "kritika_prasad": "Movie mein bhi zoya harmiin hi thi", "pulkit_chaurasiya18": "Isi JNU wali joya ne hi bomb blast karwake kundan ko marwaya tha", "i_m_destroyer22": "Benchod filmo mein nahi chal rahe hai dono to yaha bheek maangne aa gaye publicity karne", "g__gaurav__s": "😆😆😆😆 gaand tod denge agr U.P me randi rona aaya tm lg ka to madarchod 😊", "pawan.mpharmacy2017": "Do Gaddar..Bycotte their Movie", "dream_s2021": "👏more power", "pamaji05": "She is big drama girl with drama boy", "the_void_man": "Kitna up gai Ho... Jo drama kr rhi Ho... Jyda up k barey m janana Ho to recomment kr dena", "amarnath_deekshith": "Chootyaas", "sharmashivam1119": "Tell them to read about NRC first then start protesting against it", "aliakhan_1768": "Lovely ❤️❤️👌", "smriti_08_": "@reallyswara u r fucking lady n dramebaaz", "pushpasrivastava_": "Zoya kundan ko protest ke naam pr danga bhadkane Ka prasad Mila hoga....Caption to Dekho is Psycho ka... Ajay bisht likhti hai yogi adityanath ko... Jaise bhut badi kranti to kewl is naam se aa jayegi.", "nnm00009": "Or hm apka Kota me mare hue baccho ke haq me koi tweet post Khoj rahe hain Insta pe...", "tejendra.rawat": "Movie nahi milti kya ajakal", "uniquesidhartha": "Tum logo ku v 2 4 pade ga tou achha hoga", "awanishtiwari0003": "😂😂", "manugujjar0007": "I support up police", "thakurkanishk96": "#dramebaaz", "10_mnm_10": "🤣🤣sabhi jaante movie me kya huwa tha..Kundan ab baar baar chutiya toh nhi kata skta apna..Pyaar jesa kuch nhi hota iss world me hypergamy hai sirf", "king210289": "Gasti", "youngwildndfreee": "तुम दोनो ही बेनतहाँ चूतियापे की मूरत हो ! @reallyswara", "bariya1177": "Bhosri wali aunty", "niya_khatod": "@reallyswara जब पुलिस पे और आर्मी पे हमलें होतें है तब कहाँ चली जाती है तुम लोगो के human rights wale aur azaad aur liberals ki gang देश के गद्दारों ।", "poi5284": "Awesome mam", "aimankhan500": "♥️♥️♥️", "iamrkg___": "Tujhe v prime minister ki chair chahiye kya", "priyankamadhwak1": "Teko kaam karna b hai ya nhi aagey bollywood me", "him_singh_": "kitna mil jata h itna krne ka", "rajput_1709": "नागरिकता संशोधन अधिनियम CAA 2019 को अपना समर्थन देने के लिए 8866288662 पर मिस्ड कॉल करें। #IndiaSupportsCAA *नववर्ष 2020 की हार्दिक बधाई व शुभकामनायें !*🙏", "yoyosonurocks": "Hahaha nautanki 😂", "mukesh7025": "Aur police ko jalaane ki kaushish kr rhe h unko bhi Dekh le", "trushang1147": "👎👎👎 u can't succeed in your career not in CAA #supportCAA", "tarn_rajput": "Such a dumb girl . Another Rahul Gandhi", "aryan7_aesthetic": "Shakal achi nahi kam se kam baat to achi kr😂", "ro_9999hit": "Use ☝️", "itsabhiabhi": "Swara Bhaskar is one of those rare Indians who have visited abroad without having a passport and pays taxes without having a PAN. Huge respect", "tanmay_kore_1409": "वन्दे मातरम् सुजलां सुफलां मलयजशीतलाम् शस्यशामलां मातरम् । शुभ्रज्योत्स्नापुलकितयामिनीं फुल्लकुसुमितद्रुमदलशोभिनीं सुहासिनीं सुमधुर भाषिणीं सुखदां वरदां मातरम् ।। १ ।। वन्दे मातरम् । कोटि-कोटि-कण्ठ-कल-कल-निनाद-कराले कोटि-कोटि-भुजैर्धृत-खरकरवाले, अबला केन मा एत बले । बहुबलधारिणीं नमामि तारिणीं रिपुदलवारिणीं मातरम् ।। २ ।। वन्दे मातरम् । तुमि विद्या, तुमि धर्म तुमि हृदि, तुमि मर्म त्वं हि प्राणा: शरीरे बाहुते तुमि मा शक्ति, हृदये तुमि मा भक्ति, तोमारई प्रतिमा गडि मन्दिरे-मन्दिरे मातरम् ।। ३ ।। वन्दे मातरम् । त्वं हि दुर्गा दशप्रहरणधारिणी कमला कमलदलविहारिणी वाणी विद्यादायिनी, नमामि त्वाम् नमामि कमलां अमलां अतुलां सुजलां सुफलां मातरम् ।। ४ ।। वन्दे मातरम् । श्यामलां सरलां सुस्मितां भूषितां धरणीं भरणीं मातरम् ।। ५ ।। वन्दे मातरम् ।।", "i.m._aashu_tiwari019": "To busses kyun jala rahe te aap ke lal salam wale.. Muskuraiye or dariye mat police Aap ko bachati.. Don't become a bhakshak..", "i_anil_rawat": "Tmm jaise log jis thali mai khate hy whi tukhte hy", "vivekbhatia11": "@reallyswara ma'am i belong to u.p, meerut. The ground report is when the protesters became violent after that in order to control them police acted with arms. After that 144 was applied under which people cannot gather anywhere publicly, any peaceful protest in such situation is not allowed, in case people do so police can take action on them and that is what actually happened.", "mr_perfect14157": "Joya kundan ko bolo...nagrikta ke bich me allah na laye aur patthar na mare nai to maar li jaegi dono ki aur tum dhundte hi rahoge", "sunil_0461": "Fuck you swara raaaaand", "sudhirdk1134": "आपको आंदोलन करणा हैं तो शांती से करियेणा नुकसान क्यु करते हो पोलीस आपणा काम जाणती हैं,,", "arjunshetty61": "Stupid not India, only stupids like you. Don't include my whole nation.", "abhimanyusingh595": "Or lelo azaddi...😆😆😆", "rajputana__yodha_": "Jo apne dharm ka nahi hua wo kiska nai ho sakta Swara Bhaskar apna naam dharm badal le itna hi nafrat hai hindu wo se to", "riyasola930": "How much you paid fees per day show's this posters ?", "envision__epic": "पैदा ही तुम दो मुहीं हुई थी... या टुकड़े टुकड़े गैंग के साथ होकर ऐसा हुई हो।😂😂😂", "aj_quotes_89": "Love u swara mam ,thanks so much for your support ❤", "_rakesh_8191": "Maar to tujhe bhi padegi to apne baap ko khohne lagegi atankawadi ki supporter h tu", "vedant_pandey_214": "🤣🤣🤣shame", "stuart_soru": "Kitna ka cheque milta hai tumlog ko ?", "pushpendrasinghsurera": "Please write full name Thakur Ajay Singh bhist", "_aditya_pro": "Lund legi to bol.. direct muh me daal denge😄😚", "abhimanyu4097": "Didi ka ek hi to movie hit hua h kahe usko bhi gud gobar kar rahi h apne karnamo se😂😂😂 hame to jnu se tabhi nafrat ho gai thi jab se jnu wali joya ne use marwaya tha 😂😂 hmm to khair berojgar h maidam ye support aur virodh krna hamara Kam h app bhii... Matlb had h such me berojgari bad gai h ..🙄🙄 apko bhi koi movie nahi de rha h😂😂", "amitkashyap_": "@reallyswara chchchch unemployment ka naitijaaa 😂🤣😂🤣😂🤣", "vivekanand_vyas": "I just wanna ask you mam .Without any certificate how we can make passport .Really i wanna know mam.you don't have certificate to show your citizenship but you have it for passport .You started fucking our nations hindu-muslim relations .", "imbesat111": "Thanks for ur support.Brave lady.❤", "cheeky.ron": "Yahaan park bhi movie ka promotion?", "manishacharya.fa": "Tum pagal ho", "s_nagar09": "Or ..is baar joya hamari hogi..or hum kagaj nhi dikhayenge😎", "corona_.go": "@reallyswara @mohdzeeshanayyub kya actor bnoge re tm log saale bhadwe??😂😂tmlog saale dhandhe waale actor jo, jaha paisa mila wahi chaatne chle gaye😂actor to salmaan khan b h or shahruk khan b h, lekin tm dono ki trh bikau nii h chutiya! #gotopakistan #indiasupportscaa_nrc !!", "imwarrior_v1": "Didi @reallyswara Plz Ticket leke aaya karo India Mein abhi Black Mein Kuch Nahi milta hai yaha ... hope u understand @reallyswara", "himanshu_bisht_hb": "नागरिकता संशोधन अधिनियम - 2019 को अपना समर्थन देने के लिए 8866288662 पर मिस्ड कॉल करें। #IndiaSupportsCAA", "proudhinduboys": "Madarchodo.", "the_lost_boy3": "Tere jaise ghatiya aur vahiyad aurat kahin nai dekha ....unpad dehati gawaar saali pehle padna seekh aur samajhna seekh .....bina samjhe bhaukna band kar haraami saali", "pawant16": "To btaiye ki aap log itne peaceful tarike se protest krnge to police aap logo aarti utare gi kya.yha vha protest m ye dekhegi ki tu sareef lag ra h jaa tu or tu aatankwaadi h tere lath bjega😹😂😂😂itni bdi ho gyi ho budhi nhi h tumhare pass.jaisa pyar tumne diya vesa police ne bhi diya❤️", "jodharathore22": "Ho sakta h tum dono n chupa rkha ho baicharo ko azenda bhaskar zindabad rkhna h na ❤️❤️❤️❤️", "singh_pooja_k": "bullshit.. Bechari publicity ki bhooki", "im_.ajit": "😂 bc ye sab mamle me apni gaand gusa ta hai ...aur fir Ga*d marwata hai ...😂😂😂...film to nahi ha na ye kam karke famous hona chahti hai ye 😂😂", "piyush0312": "Pichwda dikhao Azaadi paao... Simple hai Boss 😜😁", "sakshi__sharma": "Jab vo zoya or kundan public property destroy kar rahe the tab aapke posters kaha the?", "u_mehul_k": "Aapne ghar par check kiya...!! Mentos khaiye...ghar jayiye..ya fir so jaiye", "cantankerous_girl": "Actresses like you lack knowledge, sirf baised hote hai tum Jaise log, act ke bare me pata Kar fir poster chaap", "skmsonya": "Vaise kaha se ho madam... Pehchana nhi tumhe.... Khi Pakistani bheji huyi agent to nhi.... Kyuki itna gandi niyat bharat ke khilaf unhi ki hoti hai...", "md_salahuddin_15483": "Right", "amitghotekar100": "Aree isko he drama ke liye Paise milte. Film to iski chalti nahi . Pakistan me jakar karo he drama", "dbaby355": "Kch Andh bhakto ko chhdkr... Baki sare desh me virodh hora h... Is dhongi Sarkar ka", "ddurgesh": "@reallyswara mam aap doni galat place pe search kar rahe ho. Woh dono toh saal 2013 main hi Delhi ke JNU main shift ho gaye, ek padhai ke liye doosra chai pilate hua. Ab dono Benaras rah gaye isliye nahi mil rahe hain.. Chalo Delhi !!!!", "srivastavn": "Tmhari maiya chod k bhaga kya murari", "ps.bhardwajsharma": "To hindustani bhau ko bheju", "er.deepakmehra786": "Mam apko aamaran anshan par baithna chahie..desh ko balidan chahiye... Ye modi shah se aap hi hme aazadi dila skti ho..pls mam...", "hindu_pariwar_": "Aunty", "pulsar_wala_98": "Behen picture chod rajneeti me asa jao acha acting karti ho itni umda acting walo ko bollywood me mauka nahi milne wala", "saffron__anku840": "Tujhe or Tere jese Jihadiyo ko de ke rahege azadi", "meetdspartan": "Unko CAB aur NPR ek saath karne do, sare kundan aur zoya mil jayenge aur nahi mile toh zoya factor dekh lena..... Utni hi chatulusita karne me help hogi aapko...", "bishtbunny7": "#ajay bisht?", "instaanuragg": "Both third class actors !", "charliebhai17": "Ye behen ki lodi isis ki agent hai, ye bahut pakistan ke tv shows me aati hai, paise ke liye ye kuch bi kar sakti hai @reallyswara Is been ki lodi ko Bollywood me boycott Karna chiye.", "shakti_nation_first": "I support CAA NRC", "chaudharylatyan": "Ek din up police ki duty kr k dekho acter toh koi bhi bam jaye", "gaurav2651997": "हमें लगा तुम भी गायब हो इमरान के साथ😆😆😆", "singhchanchalika": "Get work both of you atleast you will occupied and stop ur pseduo patriotism which is only for publicity n no one is liking. You guys are good at acting on screen ,plz continue doing the same only till there . Atleast ppl will continue to watch you rather spoiling ur leftover career.", "siddleo": "Leke dikhao azadi tum logo ke Papa baithe hai abhi Yogi adityanath aise dega azadi ki baar baar nhi mang paoge JAI SHRI RAM🙏", "bilkis.9967191929": "👏👏👏👏", "shekhar_pawar": "#swarabhaskar If you have guts, fight for Burkha Mukti as well \"Burkhawad se Aazadi\"", "kav_cheri": "❤️", "faaaaarukhh": "Chutiya hai tu", "gh.anshyam494": "Support CAA", "iamprishashekhawat": "Jihad Kai naam par jab ladkiyo ka rape hota hai tab tu kaha guu khati hai ...", "sampath4074": "Awesome 👍", "ritiiisharma": "Ye upcoming rakhi sawant h. 🤩 #nautanki #indiasupportscaa", "himanshushenwai": "Bhai kam dhande nhi hai in actors ko isliye content milne ke liye aisa karte hai😂😂😂", "amar.giri.1485": "Unfollow her", "rakeshsingh9392": "Teri gaand me gye chutiya. Ja jaake aapni gaand me se nikal le un sab ko..", "eashpandit": "Wah itni shandar line likhne k kitne paise mile.", "behappy_dk": "Unfollw her 😡😡😡😡", "qureshi_.farin": "😍😍😍😍 ma'am you are the best", "abhisharma9191": "Beta apna carrier khud barbaad Kar rahe ho", "singhkushagra5499": "Two unemployment people of Bollywood living last phase of there tiny stardom 😂😂", "jangra_vicky786": "sahi hai.. ab filmo me kaam milna band ho gya to.. news me bane rhne k liye kuch to karna padega.. 😜", "richa_sharma1060": "Nahi milengi nahi milegi swara apko is drama se filme nhi kilengi🤣🤣", "instaplayrepeat": "@reallyswara @mohdzeeshanayyub You guys are not just bollywood actors. You are human too who feel same pain like regular citizen. The rest bollywood actors are BJP ass lickers.", "jayeshh_jj": "Photoshoot time 😂😂😂", "renegaderaul__49": "Gaand mai sariya ghusna toh baki hai re", "sam90580": "you are so beautifull with great thinking..", "amitprajapati8523": "तुम दोनों के माँ का चुत चोदू", "deepfrdeep": "Salute you for your courage to speak the truth.", "abhilash_tamrakar": "Kundan ko maarne ke baad zoya ko phir se jana hi hai Jail me", "vivek.wategaonkar": "👎", "justcallmedeepoo": "Mc iski", "amans4singh": "BC aisa kya ho rha hai UP me jo bakchodi kat rhi ho kaam pe dhyan do apni public ko gumraah karna band karo BC", "shadow_dagger_": "Didi usi Zoya ne apka pyaar chhinakr usko marwaya tha or ab apni gand aap de Rahi ho usi Zoya ke liye", "amolsonwane8091": "Stupid first read what is nrc nd caa thn bolo yr", "imsonu_golu": "@reallyswara हम बनारस वालो को आपकी जरुरत नही 😂😂😂😂😂 #supportcab", "lovish.9": "Are ma'am jakr Sonam Kapoor ke pass apna NREGA continue kijiye😂😂", "corn_shonnery": "Aazaadi from stone pelters, petrol bomb throwers, riotiers, public property destroyers and people who have been living off of tax money pretending to be students", "manjesh_vishwkarma": "Apka carrier khtm hona ty hai ab", "faxqix": "Maaaaammmm I seriously love you !!!! A HUGE RESPECT!!!!💖💖💖💖💖💖💖💖", "rishikeshvajre": "😍😍😍😍😍😍😍", "nad_1028": "You're amazing ❤❤❤❤❤", "navrattan_gupta": "bichari ke pass koi films nahi hai", "abu_bakrrrr_": "Likha jayega tmhara bhi naam itihaas me, tmne ki jo mehnat bachane ki samvidhaan ko warna toh bhot aaye bhot gaye kuch hai jo sahi galat ka faislaa krte hai aur sahi ko chunte hain.", "swwappp": "abe gawaar tujhe bhi patthar maarenge toh tu bhi sab stable karna!!! Police retaliate nai karegi toh kya karegi!! Tumhare ghar pe jab kisi ko chot lagegi na tab baat karenge and shame on you for supporting riots!! Badi aayi", "_ashupurohit_": "Swara Aunty ko lag rha ki koi film chl rhi hai. Auntiji get out of yours deams😂", "imran__i27": "❤️", "surajkashinathpandey": "पूर्ण रूप से टुकड़े टुकड़े गैंग सक्रिय है😂😂", "sumitkg0": "@reallyswara fucking you", "deepakdayamatta": "Lelo fir Azaadi Swara Aunty. 🤣", "the_bramha_bull": "Mat khojo..ye UP police hai...baat kam karti hai aur gaand pe dande jada barsati hai💪...ek baat lagegi to saara dimag thikane aajaega", "md_junaid07": "Assalam Alaikum swara Bhaskar", "inayathusean": "👏👏👏", "kalaam.7": "Sweetheart you carry on bhakto ki jalti rehti❤️❤️", "usamah_amir": "Inqilab Zinda Baad", "lovelydubey_": "Drama queen hahaha", "champ_alig": "Second brave girl in the business after Sonam:) P.S. In my opinion", "erum.basith": "Respect @reallyswara .#rejectcaa#rejectnrc", "akashnirmal.30": "What amount you got from Congress 😂", "suraj_srivast_2611": "Aap wahi ho naa jinko lgta h parliament m 572 seat hain..#gawar @reallyswara", "_npadhiyar": "I thik so isko malu kuch hey nahi or chali bhasan dene ghanta jo kam ata hey vahi karo dusre ko apna kam mat sikhaooor or rahi bat bill ki jara PAKISTAN me dekh ke aao ki kitna ZULM ho raha hey india valo pe samji or chali apna talent dikhane BC MC CHUTMARI KI 😡", "gulabyadavofficial": "अगर तुम्हारे परदादी मुग़लों के तलवार डर से सलवार उतार दी होती तो तुम्हारी नाम स@swara bhaskar की जगह sabanam khataun hota जयदा ज्ञान मत पेल अगर कोई काम नहीं दे रहाँ हैं तो जो तेरा काम है ऊँगली का सही इस्तेमाल करना ओ कर जाके ...अब तुमको ठोक कर आज़ादी मिलेंगी ...जय हिंद 🇮🇳🇮🇳", "sumerak08": "India is proud of such influencers.❤️", "shellyjaingoyal": "Support nation, support secularism, support government. Working real hard for us..... I always admired you but not any more", "hamna_999": "Proud of u quueeeenn", "rishabhkumarpathak": "Pls stop ur tantrum if you dnt the exact situations of the country", "pooja_chakravarty_": "🔥👌", "vishaljaiswal159": "Ab milegi azaadi aao bhosadiwalo ab niklega danda ab gaand laal karegi police ab milegi azaadi ab SAB dangaiyon ko azaadi milega,,,,,, police taiyaar hai......", "vikas.choudhary.39566905": "New Smaj sudhark aa gye 😂😂", "asnaakhtar": "Nailed it💯💯", "who_shariq": "Respect from deep of my heart 💓", "sankalp_2003": "Azadi to dedi na up police ne", "ak.ash9309": "Drama suru😂😂😂😂😂", "akashdeepsingh96": "And all the private and public property destroyed by these unethical UP cops", "amazingazhar9": "swara teri himmat ko....LAL SALAAM LAL SALAAM !!!!", "akhouriji": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "nizuxzean": "🔥🔥👏👏", "shaikhsadik2901": "Azadi Azadi 🇮🇳🇮🇳", "spectro.rizwan": "I am with u", "zeeshan.ul.haque": "👌👌", "satishsharma19": "Bahut padegi", "abhijeetsinghdangi": "Tum dono movies me acting achi karte ho to iska matlab ye ni ki real life me bhi drame karoge. Not good behaviour Swara Ji 😊", "jainanju121": "Deshdrohi", "realshuaibkhan": "Kal Azad Maidan me Apki speech Sunke Bht hi Zada Khushi hui😊 INQUILAB ZINDABAD🇮🇳 JAI HIND❤️", "cricetlovers": "Kuch bhi krle hm chinke lenge azadi🔥🔥", "shivendra.pathak3": "Mar khane gye kyu the bc sb ke sb gayab ho jaye to bhut Acha hota 👏👏👏👏", "shani_dobariya": "Abe pakistan cricketer danish kaneriya ke liye avaj utha vaha kya ho raha he unke sath", "atulsingh.rajpoot.376": "Shoopnakha Ho Tum aaj ke yug ki Jara Ek protest Uttar Pradesh me bhi kar lo 😂😂😂😂", "rahulksingh87": "कुंदन तो तभी मर गया था, जोया के चक्कर में। जोया ने बाहर गांव शादी करके सेटेल हो गयी हैं, जैसा हमेशा होता है।", "munish_sen": "GREAT JOB SWARA 👰👰👰👰🏩🏨🏩🏨", "aman.maurya15": "Movie to chl nhi rhi hai yhi sab krke gujara Kar tu", "rajveer_gajraj": "Ek picture me bhi Aaj tak tere koi Acha character nhi mila or Tu chali h btane kya kerna Chayie teri tarh ungli daal k baith jaaye tere sath wale", "nuzhatjamal001": "Thank you so much 💓@reallyswara much appreciated", "sidkcharan": "Kundan BJP ka aadmi hai......usne protest kia b nahi. Use mt dhundho....phle khud ko dhundho lo. Publicity ki Devi. Sath me ye kon h Naya launda ......", "mayoorsinh13": "sabko aazadi milegi", "dj_thejourno": "❤️❤️❤️❤️❤️", "deadpool__r": "Yes aunty", "laxmi.gautam.165": "We all support you 👍", "sachinjoshi77": "Tukde gang ki chamiya born in JNU", "muslimah_inspirer": "Proud of you! Having so many followers and yet speaking up againt wrong and education the bhakts! @reallyswara proud of you!", "prashant__bachley": "aurat", "this_is_thorat": "Swara ji, sawal ye nahi hai ki hindustan kiske baap ka hai, sawal ye hai ki aap ka baap Hindustan ka hai ya nahi ?", "nitinvasantlikhite": "CAA should be implemented I support CAA it is not against Indian Muslims", "internalaffairsbollywood": "just to be in the news you guys can go to any extent", "tirelesss_soul_rahul": "Ae side actor", "1iamphenomenal": "Thank u madam aap nhi hoti to hamare desh ka kya hota 😂😂😂", "singhak01": "Nothing going to be reject plz wait and watch", "sakshisingh502": "2 of favourites😍😘", "_k_khatun": "🙏", "aishajaani": "You’re a fucking joke.. you’re a racist openly. Then you pretend here. Go find a new cause you fake ass bitch.", "dr_deeba_azmi": "Kudos to you!! Such a courageous woman you are !!", "rastogi.rahul.94695459": "😂😂", "ju_mi__": "🔥🔥🔥❤️", "mandarkaselkar": "Teri maa ki chut @reallyswara", "queookie": "Aur yahan se hota hai iss nautankibaaz ka career theek se take off karne se pehele hi thappp..", "shamseeddiyafa": "🇮🇳🇮🇳🇮🇳🇮🇳🙌", "pranav.vt": "1 basic question ...For muslim.. who told you ki aapko desh se bahar nikal denge.... For hindu .. who told you ki hindu rashtra banne vala h .. please resolve your confusions.. and be above the vote band politics of either congress or bjp .. these all are equivalent to gold diggers", "vas_happinin": "thanks for speaking up 😊", "i.am_singh": "BC liberal gang nd tukde tukde gang ki dalli lady hai ye..bagladesh ki paidaish hai ye ghuspaithi", "mohitsihit": "Failed actress", "vashishthsidd": "Account got credited??", "imratulhaque": "Good job mem,No CAA Joi ai Axom", "nisha.goel.7374480": "U r fool", "rajput_pk__": "Tukde Tukde gang...aise hi 🔥jalte rho Modi ji se..Ghanta kuch nhi kr pawoge..tum sab ko koie seriously nhi leta..movie nhi mil rhi hai Kya ji😂😂😂😂😂😂😂", "ankitgupta222111": "You are trying to get attention by doing this shitty things. Cheap lady.", "rajatjaiswal.india": "Dono nalle supporting actors😂😂😂😂", "son_ronny": "Epic.....🔥", "onlygoyalamit": "First time unfollowing any one and that is you @reallyswara Fuck Off 🖕", "ambar_anis_": "Love you💕💕", "_dakshrathore": "4 paise kya kma leye itne akd desh ke kilaf #sameonyou", "rajesh_r_rayan": "Kitne paise mile swara", "aalap8778": "I feel sorry for you.  Please see a doctor 👨‍⚕️", "bijaykumarrathore": "Ek suggestion hai swara aunty tum ek whats group banao aur nam rakho \"No work full attitude\"", "_prem_thakur__": "Full support CAA. And we want now NRC🙏🙏", "khushi_usmani": "You two 😍❤️", "trayambkeshwars": "Aisa hai bhaiya ki kundan toh humare paas h pr joya bhabhi lgata h protest KR rhi h...JNU ki Jo thehri", "deekumar2242": "Tum eshi layak ho", "jyoti__oraon": "🙌🙌🙌🙌🙌🙌", "priyadarshighosh1992": "Desh ka dusman ha e log jnu jamia band kardo", "couponaly": "tum aage barho hum tumhare saath hai swara you are real indian .😘", "jyotirmoy_09": "Comedy piece😂😂😂", "junaid_hasan.shari": "Ham apko samarthan krta ha", "bijeshk8": "👌👌", "akhand_bharat1": "Are bahn jb wo pathar mar rhe the bus, train Jala rhe the tb to tu nhi boli", "nabila.fatyma": "♥️♥️♥️♥️♥️♥️♥️", "ohidulmallick": "❤️", "iamfaiz.ff": "Bhag madharchod andh bhakt", "abd._.ahad": "👏👏👏👏thanks", "itz_suhailaslam_07": "😘😘😘😘😘😘", "azam_ali8": "Tysm❤️", "june_moon98": "Swara bhaskar.... Ab tu bas kar..... Warna jaegi teri laash ghar..... #nautankisaali🤣", "englishwithrafiya": "God bless uh. 💖", "bitoppawgasslkr": "😂", "sunaynapahuja": "Abey o ghatiya aurat dange failati ho tum", "aditya._.oye": "jiyoo murarii", "suman.middya": "😍😍😍👍👍", "rajolkarchetan": "unki khabar milte hi ungli se ishaara ka dena", "kushagrasinghgautam72": "Superb....🔥", "sameersanky91": "❤️❤️", "shonu_666": "👏👏👏", "ha_m_vhi_hu": "Kundan to kb ka laat mar chuka bhul gaye kya madem ji. Or joya gyi BJP m", "amrish890": "Bindiya isse b film nh milegi", "gaurav4020": "Lodi tu kab sudhre gi tu he pehli fursat me nikal koi ZRurat nhi ha desh ko Teri Lodi nikal", "satejmulikpatil_21": "I support CAA", "yadav.rahul16": "असल में U.P में अभी राम राज्य चल रहा हैं🙏", "rinkudevsar": "और जितनी घटिया बन सकती है बन जा।", "khatik8o": "kbhi sahi chiz ka support kar diya kro....aur respect kar liya kro...unka name aadtiyanath ji h.....rhi bat tukde gang ko to denge aajadi....jay hind", "dhrubajyotichakraborty_": "चूनर उड़ा के ध्वज बना गगन भी कपकाएगा चूनर उड़ा के ध्वज बना गगन भी कपकाएगा अगर तेरी चूनर गिरी तोह एक भूकंप आएगा एक भूकंप आएगा Swara, it was a pleasure to see you at AIDWA's 12th national conference.", "arshiyankhilji": "I support you", "who.rahulgupta": "Haramipane ki v hadd ho gayi bc😑😑 koi desh jalata rhe or police muh take ?? Yahi to azadi mil rkhi hai india me", "dimpalkapadiya": "you do a great job ❤️❤️❤️❤️ or jo log galat salat bol rahe he un me se lagata he insaniyat mar gai he hum swara ji ke sath he or ye desh binsampradayik desh he❤️❤️❤️❤️", "__yashi.k": "The only actress who is so bold and so correct... than other bollywood actors", "sheikh_shahjada": "Thanks for your support👍🇮🇳", "royalboy2429": "Dono apka ghar p h thand bahut h na", "manipal_sodha9": "Haay toba haay toba...... Bagwan sakti de apko uhi sari umr ungli krti rhe... Niche tak", "shanualam": "🙏🙏", "nisarg258_": "O harami ki jaat, Pakistan nikal. First know whose your baap, your mom should be ashamed of such an idiotic daughter", "tripuresh_mishra_": "Jo cm ji dwara saja ka pravdhaan hai mai iski kdi ninda krta hu ki ishe pure desh tk le. Jaaye aise saja ke kanoon ko 😂😂😂😂", "isha.gupta12": "Hi. You guys will be remembered when the history is written. Not those fattu selfish other celebrities", "farheenf_": "❤❤", "mohdsajid467": "Thnks", "syed_zakir_ahmed_zakir": "Bahot achhe", "satan.destroyer": "🔥🔥", "harshshahoo7": "Kuch picture bhi karlo!! Ya insab kaam mein jyaada kamai hai?", "tunishashar12ma": "😢😢😢", "eyesofstorm786": "you are 👑", "smita.sinha": "You are seriously not worth following... At least do some research before start pooping on social media... Sare kundan Joya patthar bazi me busy h. Ek do patthar police k jaise kha k dekh leti ap to samjh aa jata..", "almighty_sunny_": "Phle joya ne Kundan ka kata h ab tum dono jnu jaoge to tumhara kategi😜😜😜", "abhinavanand0402": "aapne kl press ka jwab nhi dia aap nautanki bazz ho", "sauravd.1": "U are not the spokesperson of INDIA ,who the hell are you to say #Indiarejectscaa ,just say @reallyswara rejects CAA and stop acting as guardian angel of Constitution ,the matter is sub-judice !!", "bhavirastogi": "Queeeeeen", "flukypunditry": "Itni berozgaari hai Sahab ki ab is jhandu balm ko koi short films main bhi nahi le raha", "tapasvidixit": "Didi... Reporters ka answer do... Yahan gyaan mat pelo", "shahid_insta_love": "Aapke hoslo ko salam aapki himmat ko salam 👍👍", "manans21": "Ok Swara Aunty", "rvi.soni": "Are Madam Sirf Es wajah se apse pyar hai..Ranjhana isko na badnaam karo...", "_r4rakesh": "R**di s**li", "swatirathore.in": "Chal nikal @reallyswara", "p_r_a_s_h_a_n_t_t_t_t": "tukde tukde gang ke do tukde ho gaye", "harikesh.chaudhary7701": "😃😃😃 aapko rajniti kanri hay khool karo modi samne aao", "jerryravi284": "कुंदन को जोया ने ही मारा था😂", "mani_monk": "Love from KSA", "payalsingh465": "Apna kam kro madam", "monu_kumar007": "Na iski sakal acchi haai, na acting. Dhekta kon hoga iski movie.. 😂. Tukde tukde gang wale hi dhekte honge .", "cuteshama100": "U guys are the real one♥️♥️♥️ Thanku Baaki Actor actress kya bs apne promotions ke tym hi public ko yaad karti hai", "vipulasharma84": "Madan .. Ek hi najriya h aap ka insaaf k bare main... Ek particular community hi aap ko bachari dikhti h. Apne najariye ko thoda saaf kijiye... Aur ha... Poster pakd k hi insaaf dilaagi inko.. Kutch education hi de dijiye unko...padhi likhi h aap...kanoon hatj main na le ye sikhaye unko...Sirf publicity k liye kyu krti h aisa... Aap ki films kafi h uske liye...", "rs2571": "पुलिस पर पथराव करोगे तो और मारेंगे इंसाफ अजय सिंह बिषट ही करेंगे ,जोया और कुंदन यही रहेंगे", "vicky.tak": "अबकी बार यूपी पुलिस की महिला विंग स्वरा जी को भी थोड़ा प्रसाद दे दे तो ठंड में मज़ा आ जाए", "ankit_s_rjp": "Traitors playing Victim card again #respectlaw #jihadexposed", "theplacardguy": "ज़ोया ने कुंदन के गोली लगवा दी, चंदन ऊपर निकल लिया, ज़ोया फरार चल रही है। यूपी पुलिस ने पता बताने वाले को 5100 के ईनाम कि घोषणा की है। अच्छा मौका है पैसे कमाने का; पच्ची पच्ची सौ बांट लेना दोनों। बाकी जो 100 बच जाए वो मेरे दोस्त कुणाल गनमरा को दे देना।", "shayz.07": "The youth of India salute both of you 🇮🇳", "sardarni1092": "👌👌👌👌👌", "i_neh0107": "I don't know why we are against over it ? If we are talking abt NRC then yes it should be there ...provided the step could have taken early .we don't even have a proper record of citizens of India. .still there are illegal immigrants ..the NRC could have done wayback at the time when the two countries were separated with regards to religion too...it is not about making posts like this n showing ur anger towards it ! It's time to thing logically over it instead of making such negative posts . Really fed up of hearing these things.", "sumitchauhan2u": "भाई बांग्लादेश मे खोजों जोया वही गई है और कुंदन बीजेपी को जॉइन कर लिया है", "navdeep.kaur.23": "Buddi", "shasak09": "Full support brave lady hats off👏👏😍", "anis_empire09": "Great madam ji👌", "the.rohit.gupta": "👍", "deepakyadav00777": "Tu pm ha Jo reject Kara gi", "jitu_mufc": "Aunty aa gyi gyan barsane.... Ja re chudail..", "singhvicky101": "In logo ko itna pyar desh ke sahido pe q ni aata h...", "anub17": "Tm log sala jis desh ka khate ho usi se gaddari krte ho...police pathar khaye to achha hai ulta mare to tm log khade ho jate ho.tm jeso ki to movie dekhna band kar dena chaiye.jake pakistan me rho jaha tmara b dharm parivartan kr dia jayega agar itni problem h india se...#propagandaWale", "yoursahk": "💯jabardast jabardast jabardast💯 aaplogo se hume umeed hai aur humari himmat bani hui hai", "z_hebz": "❤️❤️❤️", "ronyyy007": "#swaraaunty hum gand tod k denge azaadii , kisi din tjhko b shi se azaadi milegii @reallyswara 🖕", "vkanhaiya_24": "Kisne bola tha violent protest k beech jaane ko. Ab Zoya Kundan n kuchh nhi kiya lekin protest violent hua, toh police toh retaliate kregi crowd pr. You loose your identity in the crowd. Don't cry then. Good luck Zoya and Kundan!", "iqbalalfia": "Awesome", "saurabhsumanpandey": "Sex ka glow", "ajaystylz7865": "these two motherfuckers including this bitch sonam kapoor needed to be punished so hard in the public. don't have work in films and thats why doing such instigating and provocating statements to provoke youths and get attention.", "milanpatel4531": "Aunty pakistan jao apka swagat karne wale hai waha", "kaizadster": "Hilla diya kya aaj??? Swara", "1717_chashmish": "😍❤️", "robinbishnoi029": "According to Swara Bhasker, if the rioters pelt stones, hurl petrol bombs & fire bullets, the police shouldn't retaliate & keep taking bullets like 57 cops in UP got bullet injuries in anti CAB protests. But if a child calls Swara aunty, then the child should get verbally abused.", "mayank.shukla21": "Movie hai nh krne ko bhuke nango ke pas to ye bakchodi shuru krdi😂😂", "sekhri_sahib": "Respect to all people like you, who are showing real faces to the world. It really need courage boss. Without knowing the real faces the common people remain unaware. Now everybody knows. Baaki aap smjh lo.", "soumi.royi": "🤣🤣🤣", "nik11002": "Pehle pta krle NRC or cab h Kya fir ye sb kr....tereko ghnta bhi ni pta h ki ye acts h Kya...... Bs hosiyari dikhani suru krdi chutiyo ki tarah", "rajputrohit027": "पुराने से पुराने पीठ दर्द कमर दर्द टांगो के दर्द से तुरंत आराम के लिए..... नागरिकता बिल विरोध रैली में पधारे... 🙏 निवेदक : यू पी पुलिस इजरायल जैसी कुटाई का मज़ा लीजिए अपने ही देश में। एक पत्थर तो फेंक के देखिए उत्तरप्रदेश में। पर्यटन विभाग उत्तरप्रदेश", "sanyog_d_nidhalkar_janesh": "Chall zutti 😂😂😄😄😂😂vo danda police ka hai madam..public property ka naash karoge to zoya aur kundan pitega hi naa. ..Agar public property ko todege to police danda lekar injection maregi hi naa kahi septic aur badh naa jaye. 😄aur guptaji aap kaho to aur ek chutkula sunaye kya😄😁shanti me kranti karo. .MARATHA MORCHA KA AADARSH LO", "infinitedreamzzz": "हद हो गई चुतीयागिरी की", "i_m_muhammad": "You have guts swara, its really difficult to stand against majority of haters 💖🇮🇳", "saiprasadsangle": "😠😡🖕", "nikkytyagi": "Up police jindabad", "jayrai2018": "Up police dnt need ur certificate so plzz🙏", "nk2601": "This is lame... did u hold out banner protesting against pakistan sponsored terrorism or supporting our army. U kindda got a jihadist mindset.", "kamatsagar": "Good strategy to get you some more film 😂", "chirag_brahmbhatt": "For fam she post again hinduism cheep lady", "awes_raza_56": "More power to you ❤️🔥🙌", "madhupaanjali": "Next level nautanki hai ye iski movie and series bycott honi chahiye", "pratyush_uday": "Bol ki Labh aazaad hain 🔥🔥🔥🔥🔥🔥🔥", "sanjay143536": "I support CAA_NRC", "dazzling_azlaan": "😘😘😘", "trailandeater": "Superwoman!🙌", "i_architsharma": "Abey iske pas kam nhi hai aaj kal tbhi faltu ke support kr rhi hai..", "pervez.anna": "Bless you Always", "lako8690": "Check your dm", "yatin_2000": "🖕🖕🖕🖕🖕🖕😂😂🤣🤣", "stoneheartedbeast": "Do Chaar Latth tumhare bhi Pad jaye to Maakasam Jai hindu Jai Bharat Nikle muh se", "nish_nt_46": "🤣", "im_ansari_17": "#हम #nrc #caa #npr का पुरजोर विरोध करते हैं", "_shukla_pawan": "Mooh uthaa ke chl deti hai publicity ke liye waise to koi puch naaa rhaa itnaa dimag acting me lagati n to 4paise aate 🤣🤣🤣", "__light__y": "Nikl laudi pakistan", "vrjjack": "Inquilab zindabad🚩", "raees.atif": "Salute you👌👌👌👌👌", "khansahil894": "I support you ma'am keep rasing your voice against those bastard who's intention to demolish the solidarity unity and fraternity of this peaceful nation.", "mitali_sharma11": "🌟", "gulnawaz_ahmad_aziz": "👌👌👌👌👌👌", "bittuhtz": "वो भी पेले गए थे, अब तुम भी पेले जाओगे!", "manpreet_niagara": "@ranvir13zar2018 #raanjhanaa 😍", "abdul_kbr": "Respect.... dil se...👍👍👍", "ijagseerchahal": "❤️", "ami_cnx": "Phir doondhte raho... Aur aage b doondhte rahna.... Jo deserve karega wo gayab ho jayegA", "kumarashish6273": "बहुत अच्छा लगता है आप जैसी साहसी , तार्किक पढ़ी- लिखी लड़की कुछ बोलती हैं !", "prashant_092pandit": "Tmhari ma ko chodu... Todi to sharm krle..", "iamrishikhare": "Zoya aur Kundan sukoon se Madhya Pradesh ghoom rahe hain..MP ajab hai sabse gazab hai!!😉", "hbc.07cddy": "ooow you are member of tukde tukde gang...Tumko B azadi chahi ye Kya ....UP police Hai na bas tum UP chale jao tumko na azadi apne aap mil jayegi🤣🤣", "pradhan_gaurav_ahlu_walia": "इसका टाइम आएगा 😂😂😂😂 रुक तू लठ पड़ेंगे तेरे", "naseemakhtar1841": "Allah aap dono ko kamyabi rakhe", "saimarazzaksyed": "😂😂plz keep supporting", "zaan_khan_officials": "We all support yew mam,", "i_couch_potato_": "Pahle isko hi bahr kro😈😈", "kamlesh.k.upadhyay": "They didn't have valid documents to live in India🤣😂", "vipin4910": "Azaadi bat rahi h medam", "mr_asuraj_43": "रंडी बाज टुकड़े टुकड़े गैंग", "bobkhan98": "The real hero and a true Indian. So proud of you swara. You just won my heart. more power to you. #We_reject_NRC.", "shankarkumar5843": "Kya🔥🔥🔥", "lakshmi_in": "You need a therapy behen or you just want limelight 🤣🤣", "bp_under_review": "Beautiful, Swara! 👊🏽💪🏽👍🏼🙏🏽💗", "baviskar_v.j": "Bhartiya kho gyae hai hmarae jinhe pyar karte the jo democracy ko pyar karte the pata nahi kaha se communist vichardhra democracy ko anadr se khokla kar rahi hai", "kiritcd": "Abe jaa swara aur ye tere sath kon khada hai tera bhadva saali rand madarchod saali khud ka dekh nahi to ye tujhe kahi kaa nahi chodege", "karan.gupta.9279": "Wo log trip pe bahar gaye hue hain...", "mr_mayu_o4": "Zoya or kundan aaja di mang rahe the to de di 🤭🤭 jai hind up police jai hi @reallyswara ji mam", "iamnehashankar_": "@dhanushkraja @sonamkapoor 🔥❤️", "concormanish": "फिल्म्स में काम नहीं मिल रहा तो राजनीति, अच्छा है😀", "ajitviraal": "These are #BollywoodTerrorist", "richasharma26": "So proud of you @reallyswara", "mointhefreestyler": "Beautiful line👏👏👏", "adarsh1502": "Zoya ne tho kundan ko marwa diyaaa,aur ab aap bhi logo ko bhadkana band kariye ,faltu mai logo ko galat samjha ke unka faida utha rahi hai ,such a shame swara bhaskar", "pungalgadh_ra_padiyar": "Aur phir bhi thand nahi pad rahi hai. Lagta hai dande ko tail nahi pilaya", "tagarwal067": "Don't worry madam Joya & kundan enjoy own married life but Up police search for bindiya & murari with oil stick so please be careful", "mohitsingh6529": "Ayega to modi", "sanket_rock_": "Tu chutiya hai", "nida6440": "Love uu😘😘😘😘😘", "ahmedrazahuded": "Heads of you and Sheetal Tiwari Tere Baap Ko Hindustan nahi Joe to Azadi Dega ye hamara mulk hai hum tum jaise kutte se azaadi le kar rahenge jaise angrezun se liya tha", "shy_person__": "Joya se poocho ussi ko pta hai kundan kha hai", "piyushkar99": "🤪🤪🤪 Tum dono ko bhi wahi treatment dena chahiye tha..... Dangaiyo ke amma....", "vishalkmr299": "Get out", "iam_adil01": "❤️✊", "lalitshakyadody": "achha kam kar rahi ho ese congress me lelo", "travellingdeepak": "Vitamin hum se khao aur aankh kahin aur ladao", "bishnoi_nesu": "जब लोग देश को जला रहे थे तब कहाँ गयी थी आप , UP police did right 🙏🏻", "prince_of_bentley": "I wanna marry you", "blake_s996": "❤️❤️👏", "ashish_pj_17": "Uske baad kaam nahi mila aur ...", "shubham9014": "Ap Hindustani bhi Kha......", "who.karamjit.sidhu": "Love you ❤️❤️❤️", "prathmesh_dubey": "कितने नौटंकी लोग हो बे तुम 🤣😂", "yashwanth.bhat": "Your dad rejects his daughter... Kyunki usne bahat paise kamaaya izzat se aur mehnat se...", "nigam_saab97": "Ab bhi tum deshdrohiyon ki buddhi nahi chali saare confusion dur kiye Modiji ne phirbhi tum logo ko sarkar se problem hai CAA to sirf bahana hai BJP ka gussa nikalna hai", "sumit__dave_27": "Yaar is kundan ko to joya ne hi mrwa diya tha ab pehle us joya ko khojo", "shafiahmad773": "🙋‍♂️🙋‍♂️🙋‍♂️", "manu__love": "keep going....", "mulyankanmishra": "Kabhi desh k liye bhi kuch likh diya karo. Sankhya laghu tustikaran se apna publicity kitne din chalaoge!", "revanbhandari": "Aap ke uper kya UP Police Uda tha kya?", "itz_sidd_h": "Asha krta sab narklok sidhaar gye honge😂", "m_d_chaudhari_": "यूपी पुलिस जिंदाबाद", "drsumitjha_1239": "Yadi tumge bji chahiye azadi to tjok je denge azadi", "im_ssk29": "Jio Murari 👍👌", "yusra_wahid": "Not everyone is so strong and vocal. Keep going 🔥", "shivam_6086": "Do Naye politicians 👏 Congress k", "satyajeet.1996": "Pyaar badhao... Dange nahi Didi..", "swapnil.k.singh": "जब सवाल पीछे गए तो दुम दबा कर भाग निकले दोनों। देश में ऐसे फर्जी लोगो की कमी नहीं है।", "arjunsuri1986": "You idiots... pls answer what is CAA??", "deepakparmarmajri1122": "Kitani jalil h tu jis desh ka kati piti h usse hi gadari karti h thukta hu tere upar", "satyendra_gurjar": "Light m rahna h bas.. koi kam to h nahi...", "pintu_padhy_badrinath": "Tumko kaam to mil nahi raha hai , isliye yehi sab karte raho publicity ke liye , ek din sabana azmi ban hi jaaogey bhale hi hema malini na ban paao...All d vry vest👍", "__nobi_": "Arre @reallyswara didi movie dekhi hai humne ki kundan bhaiya ke sath kya huaa ye sawal AP zoya Didi se pucho @sonamkapoor kyun kiaa humare kundan bhaiya ke sath aisa #beccharekundanbhaiya #zoyabewfa", "tulsimalam2001": "Iss me kahan Hina ki Movie ka hashtag dala tune 'raanjhanaa' 😂 khud to kuchh handle karti nhi hogi.. kisi ko rakha hoga😂😂", "rajneesh9454": "Swara ji aap ka abhinay bahut hi acha h lekin aap sala insan galich ho", "poonamyadav5067": "👏👏👏👏👏👏👏", "sanjaysinh_gohil17": "I Fully Support CAA nd UP Police Aapko Sharm Aani Chahiye Sisterji", "gopalsoni8456": "ये उंगली से आजादी लेती हैं,,🍌", "pantgovinda": "Jasjit ko bhi dhoond lo. Woh bhi gayab tha Kalma nahin pad paaya", "rockpandit": "Up police ne gand todni suru kar di hai...kundan to gayab hi nhi hua ...ha joya jarur apna thukana bhul gayi hai...ho sakta hai halala ke maje le rahi ho kahi...mulla maulvi chadh rahe honge kisi madarse me whi dhundho jake", "yogesh8662": "🚩🚩🚩🚩🚩🚩🐯🐯🐯", "artist_avinash": "🤮🤮🤮🤮🤮🤮🤮🤮🤮", "rohit_3989": "खोजी कुत्ते |", "manishkeshwala6262": "India rejects ppl like u", "paradoxically_oxymoron": "Thank You Ma'am for always championing the cause of the right while the entire industry has become spineless. You are the hope and inspiration for us. Respect!", "faiyazali.khan": "Ye Kuch log, Wo he hai Jo British ka saat diye the aur Aaj Desh Bhakt hone ka Certificate de rahe hai", "_abhi__photography__": "आपके संघर्षों को सलाम... लाल सलाम....💪🙏", "savanpipaliya": "Tari maa na pikama", "bajajtanya": "👏🏻👏🏻👏🏻👏🏻", "ruchit_goswami": "💣😂", "dayri007": "B ग्रेड एक्ट्रेस की बी ग्रेड हरकत🤣", "photographer_lucky_99": "Abe lagta he ye randi chati hai iski gand koi maare acche se. Ruk tu aise nahi sudhregi. Kitna paisa leti hai mullo se???", "iamaimmature": "तुम लोग यूपी मत जाना नहीं तो यूपी पुलिस तुम्हारे भी पिछवाड़े पर शहादत का गाजर बांध देगी 😂😂😂😂", "nagesh2494": "CAA ka virodh kar pakistan bhaag gya tum bhi vahi jake ke khojo .", "_vishwasgupta": "👌", "rajatbhalla95": "Police ko agr thokoge to wo khushi khushi seh lenge . Dande to maaregi police bhi. Chudiyan nhi pehni h police ne. Aur tum log ABCD nhi pta CAB NRC Aur NPR ka. Teeno ki full form bhi nhi pta hgi. 5 min tk bolke dikhao. Nuksan faayda kya h . Please comment If you have guts to post a picture please explain why it should not be imposed in India. Congress 2012 mei laati to sahi modi laa rha h to galat. Dikkat ye h ye govt kaam kr rhi h fatafat. Paise khaake baithe ho Congress ke karo support . Modi bhi apna kaam karega .", "gaurav__kumarr_": "Correct 👌👌👌🖐️🖐️🖐️", "i_m_piyush_07": "Waah chutiyapa ki haad hai 😡 woh kudan inki traha nhi tha jinko aap dhund rhe ho aur hai me dhanush ka fan hu tumhra koi haqq nhi banta samjhe apna protest khud pe karo na ki dusre pe @reallyswara 😡", "jitu_573": "Women card se bachi padi ho, wrna ek lath pade na to pure universe ka knowledge ho jaye 😂", "shashank__bhadoriya": "Jyada Udo Mt .nhi to tum dono bhi gayab ho jaoge", "priveka_pandit": "Isko jail Mai bro she deserves tht", "muscle729": "Unfollowing u for this crap", "karanhld": "Urban Naxal 😂", "satish_pannu": "Nikal lowde pahli fursat me nikal", "aakashhaistar": "Press be cross question kiye to bhag khade hue", "palanup31": "Yaad nahi hai ....Zoya kitni dhokebaz thi... sirf Matlabi thi vo ....ab to samaj jao", "jyotichanchal85": "Maar khane wale kaam krange to maar to padegi na😂", "i_am_aakash0": "Tu taare dekh taare bindiya😜", "shoaib_aziz_": "Mam u r awsome. Brave u r", "udit_30": "Or hum ek hindushtani dhund rahe he apni polices ko jo dangai ka maar kharhi he", "_onkar_nayan_": "kundan ko apki zoya ne marwa dia kb ka....milenge kaise ab😂😂", "abhijeet5882": "Unki to kabar khod di up police ne", "2865sunny": "Abe chup kutiya bhart Hindu rastra banega smjhi Tu mullo ko jitna bacha le nhi Bach payenge Tu Hindu ki olad to nhi hai pkka Teri MAA Ka asiq koi mulla tha", "m4_manish": "Oro ka PTA nhi lakin aap maar khane k layak jarur h ... Or m apko Vishwas dilata hu k jis din aap kisi police wale ya kisi b Insan k hatthe chadi ... Use din apka ilaaz poora ho jayega or ap aam Insan ki there apni zindagi Zee payengi... Muje to nhi PTA but sayad apko dekhte Hui lgta h k maansik rogi hona bahot he duvdha Janak hota hoga sayad is condition m apko Desh m ho Rai har chease m kami he dikhti h ... Desh m ho Rai har ek chease se sirf unhi logo Ko problem h jinhe koi kaam nhi h or sayad unme se aap b ek h... Umeed karta hu apko khi koi chota Mota he kyu na ho but kaam mile taki apki sochne samajne ki takat badhe or aap ek ache Insan ki there apna jivan ji ske ... Kyu k aap Ko dekhte Hui vo kahavat Sai lgti h k Khali dimag shaitan ka ghar hota h ... Agar media m he aana h to kuch kaam kre ye faltu ki third grade wale actress ki there attention batorne se kuch nhi hoga. Jai Hind Vandey Mataram.", "yadavinder416": "TUKDE TUKDE GANG", "ayan_saha_bd": "😂", "amiya_nandi": "Deshbke liye kuchh karo sirf hungama nehi", "haris_shaik_": "Proud for you Mam😍", "i__gaurav": "So thoughtful👏", "anirudh.khandal": "More power to you guys", "navin_kumar_choudhari": "Teri maka bho......", "uxoasis": "Hum bhi sukanya aur uske pariwar walon ko dhoond rahein hai saalon se,Jo Congress ke karyakarta se Maar kha ke gaayab hai...", "roops_shaikh94": "U r grt ❤️", "ashpat007": "Pissslam is a mental disorder. Just ask the Chinese commies", "taionnare": "Raise a voice worth to be heard, thankyou Swara💕💕💕", "horaira03": "Great🔥🔥🔥🔥", "khan__mantashaa": "👏👏👏❤️❤️", "karanpatel1123": "Anti-nationalist @reallyswara 😡😡😡😡😡😡😡😡", "imsharad007": "सबको मिलेगी आजादी", "m.k_jha": "Swach bharat mein saaf ho gaye. Agli baari tumhari hai", "shrey_singhania0007": "#Swara you r the real #actress #nill_battey_sannata ❤️", "last_window": "🙌", "cherryinparis": "Shame! You think you know more for country’s benefit than the President the PM. WhAt have u really done and how many country secrets u know! Stop overreacting. Every country has a right to put a rule on who they want in and who they want out. Can u all go sit in US? Or UK?? U need to take a skilled migration! There is no racial or religious discrimination- it’s your own sick mind @reallyswara not worth following you anymore.", "hetajatin": "Most anti-national animal👎", "heenasheikh00": "Happy birthday @beingsalmankhan...I hope u r aware what's going on🥴 @_aamirkhan @amitabhbachchan @iamsrk really disappointed 🙁", "chandan_phoenix": "Documents lene gaye hoge chinta na kare Aa jaye gay 😏😏", "shoaib2012ansari": "Swara bhaskar Dabang chhori 👍👍👍👌👌", "salama_naeem": "Huge respect bhot himmat waale log the real hero in the world😍", "vish_r_18": "We support you @reallyswara", "imran.nawaz.khan": "hm log bhi dhoondh rahe", "rafiuddinm89": "Huge respect for both of you", "subro734": "Saali kutti.. kanaiya kumar ki Rahkel", "aman_kattal_": "Tukde tukde gang bitch 🐍", "niks_ghodake": "😂😂😂😂😂", "s.hardiek": "Its call paid promotion", "aman_kashyap_28": "कसम गंगा मईया की...सबसे मिलाएंगे", "inxhaaa": "More power to you both!", "panditt_ak47_": "Bhag saali dogli.. Mullo ki deewani dogli kahin ki... aazadi to modi dega ruk kanhaiya ki yaar", "dj_sohil_": "😂😂😂😂", "rajvirsinghshekhwat": "Sab bakwas... inn logo ko CAB policy pata bhi nahi aur muhh utha kar aa gaye... bus TV pe dikhna hai.... filmo me kaam koi deta nahi... acting TV pe acchi lagti hai swara politics me janata pehchan jati hai.... Waise teri acting bhi bakwas hai... Kar jitna protest karna hai... sachhh ko dabaya aur gumrahh nahi kia ja sakta...", "afsha8631": "We love you 🔥❤️🌸", "rahlkhan": "@mohdzeeshanayyub Allah Haq k Sath hai", "priyankasahu50": "Achha tarika hai...kaam nahi hai to ese hi famous ho jao...good", "iklauta": "ज़िहाद करेने गए होंगें और कहाँ जाएंगे बेचारे", "hopeless.fanatiic": "💝💝💝💝💝", "khiladikumar86": "Pakistan jakar pakistan ke news chennal pe pakistan or Pakistaniyo ki tarifo ke pul badne vali kutiya he tu....bhosdi ki randi....sali chal nikal yaha se kutiya sali...", "rohan_d45": "Secularism ka keeda bs tm logon mei h..2013 ka Akbaruddin Owaisi ki speech dkho..gaaand fat ke hath mei aayegi..sale jaychand 1000 saal se gulami mei jiye ab bhi gulami hi kroge", "sayanigupta\nVerified": "Verified", "shuja_khan3": "👌", "bhadanasachin": "bde hi ghtiya ho tum log yaar desh ki police ko ese bol rhe ho police na hoto tum dono so nhi skte dhng se such a foolish girl nd ye gadha inko kaam nhi mil rha tha too bss yhi krlo tumse acchi too raki sawant hai", "moonisshadani": "❤️👍👏", "amansingh123789": "Kya baat hai😂😂", "imran.mujawar": "@reallyswara don't look back just keep moving FORWARD, this is how WINNING Is Done, hum honge Kamiyab 👍👍", "ibn_e_batutah": "❤️❤️❤️", "sudhanshmishra": "Aap reply karen to me aapko sach sach bata sakta hun...", "haiderayaz_": "So thankful ❤", "kundan_singh_parmar": "Like seriously... 🙈🙈", "akhil_singh_rajput": "Kl Friday hai to aaj se hi bhdkana start kr diya hai Jisse kl phir se dnge hon aur public aur police me kuch ho aur next Friday tk usi topic pe shor mchaye plz stop it bhut ho gya", "nidsbharti": "🤣🤣 good one!", "salar.sohil": "🤙🤙🤙🤙", "caf89": "Ruk jana nhi tu kabhi haar ke ❤️ ❤️🇮🇳", "adityaraj.utk": "Bakvassss", "swaglook5": "👍", "__vkey_": "👌👌👌", "smiley69lol": "Ye hawas khi Orr dikhao.....deshdrohi....", "the_noor_26": "Not an inch back ✊", "rafikshekh72": "Omg", "ilgnaouibrahim": "❤️", "chaitanya1530": "we support NRC-CAA🚩🚩🚩", "shaikhtousif_77": "👌", "its__manni": "@reallyswara mam you are very good actor. Support CAA .🌹🌹🌹", "shubhamguhathakurata98": "@reallyswara ma'am sitting in the AC room of Press Club of India and blaming police officer is very Easy than to stand in the place of the policemen and face the situation. 😡😡😡", "askaizen": "So proud of you guys for all of it!!", "raja_bhai_____": "best", "imarefakhan": "Thanks swara mam 👏 I proud you🔥🔥", "majid_matter": "Mafia plus religion = Ajaysingh", "irehaan": "🤟🏻 #rejectcaabill #rejectnrc", "kartik_md_": "Up police ki jai🇮🇳🇮🇳 jo usne apko thoka.. aur tab tak thokhana chahiye jab tak samarthan na mil jata.. aur apko to kuch jada dande marne chahiye..", "himanshu_the_beginner": "काहे बनारस का नाम बदनाम कर रहे हो आप लोग, बनारस ऐसा नहीं है।", "fak02": "You guys are awesome", "nailas_world": "❤️", "debudev80": "paglaa gayi ho kya, jyada bhokal na pelo aur banaras ka naam to liyo nhi", "aghaz_anwer": "👌👌", "ghufran.11": "Shame on u U.P police..where is humanity..", "razaakhondi": "🌹👌❤", "faisal_deverkovil": "👌👌👌❤️❤️", "iam_nauman_indian": "jitne log maa behn ki gali de rhe ho isse kisi ko kuch frk ni pdta isse tumhri personality khud dikhti h ....Acchi perwarish di h ghr walo n ...agr ek ladki ki izzat ni kr skte to uske baaren me kuch bolo bhi ni ...#andh_bhagton", "danishadv": "Respect ❤️", "trivisha": "Be gairat insaan hai ye dono ...biased and propaganda jokers. #Shame", "thatsharshil": "You want be actress or you want to be poletision deside first", "rishijosh": "Aayenge jaldi thodi masti utarne ke bad", "hena_gems": "Himmat chaiye boss.... Keep it up", "ashwaryacoolest": "पत्थरबाज लिबरांडु नालायकों 👆🏼👆🏼👆🏼💩 यूपी का नुक़सान करने वालों से वसूलेगी पुलिस !!! 🤣🤣", "sudipto_mahindar": "I feel rather than protesting against NRC and CAB we should raise a voice to change the process of electing the legislature.Fist Post the Past is not working for modern democracies how a party with just 35% representation can become so powerful. I feel proportional electorate system is much better and we should start talking about bringing primaries in India.Your comment please @reallyswara @_yogendrayadav", "shivi5354": "Apni gaand udhar hi marao. Idhar n aiyo vrna gaand kut aur fat dono jayegi. Y U.P. h. Y Tmhare chutiyape n a", "siddiquerazi": "Respect for both of you.", "dipak6652": "Now blocked", "thesunrayyyy": "Wah❤️", "ig_rohit8": "टुकडे टुकडे गॅंग😂", "papillon_2106": "More power to you 😊😊😍😍❤️❤️❤️❤️", "tripathytapas": "😀😀", "i_am_milind_shinde": "Unfollowed you just now... I think app ko bhi politics mein jana chahiyeh ... Acting wabhi kam aati aur yeh jo app kar rahe ho isme bhi ...", "priyeshprdhaan": "तो बेटा आजकल कंधा यहाँ दे रहे हो😂😂, दिल्ली पुलिस ढूंढ रही है", "nikunjdhandhukiya9385": "Abhi to bohut kuch dekhna baki he swaraji BJP again ❤️❤️❤️❤️❤️", "bobby_adhale": "😭😭😭", "dharmin_patel": "Tum log bhi gayab ho jaoge... Id nahi he to banva lena", "vivekgaikwad96k": "Well done guys", "ravikhanna0804": "Indian citizens are intelligent to understand what is good and what is bad... Kindly don't force ur opinion...", "aparna_9221": "No matter u criticize swara or support CAB,NRC still u'll pay to see all these stars in Bollywood movies while they are opposing CAB.all it shows common man's fake patriotism,herd mentality,blindness to knowledge and chest beating .in reality u all are slaves of your fancy desires", "vaid_shiv": "Films nhi mil rhi Jo ab protest krne lg gye Tum log 👎👎👎👎👎👎👎👎👎", "mr_arbazkhan": "#uppolice so sad😔", "yuvrajsinh_b": "Ji zoya kundan me Gharvalo ne Kundan ko mar diya or ladki ka bhi pata nahi kya kiya Kyoki LADKA HINDU THA- OR VO SECULAR NAHI THE 🚩 @reallyswara #pehlifursatmenikal", "sameeryasir.786": "Doing good", "yash.pal894": "@reallyswara no matter what haters say, history will remember you for your courage and dissent. You are true gem in my eyes. More power and love to you❤️", "sahilnayeem9": "👍", "socialexpressofc": "@reallyswara और ज़ीशान अय्यूब साहब आप दोनों की मेहनत और क़ुर्बानी हमेशा याद रखी जायेगी", "abcdefghpqrstu": "Hum thok ke denge azaaadi", "srinathanna": "Isko maroo police please request", "alokmeena407": "Aap bhi jao", "poojakumai1997": "love u swara mam respect 👍", "ubuntomathur": "..Flim chal rahe hai kya.", "ravisharma_0": "Up police 💪💪", "filmy_rearch": "Teri maa ki chut me gye dono", "wakeup_bharat": "UP police is doing great job.....we salute UP Police", "abhyee__official": "Laal Bandaroo Waalon Sudroo Har Aache kaam mein Muh Dalna achha nhi🔥😠", "bibinkuriakose17": "🔥🔥🔥🔥", "jatinarora75": "Loser 👎👎👎👎", "alokparna": "💔", "mohammed_asif24": "Bravo", "_the_angry_young_man": "Dislike👎👎👎", "zzaidalinoor": "❤️all hearts for standing for the truth.. you are a true artist..m!", "itsaneesul": "More power to you ❤️", "nusrat604": "🙏🙏", "samajwadi_bhai": "बहुत बहुत आभार व बहुत धन्यवाद 🙏🙏", "rvichhabra": "Pitwa kr khada kiya hua hai.. Bhai saab ko.. Aise koi saath nai dene wala... Bhaskar saab", "pearldiamond1901": "This only shows India will stand for against injustice and no religion can divide us. We all r humans first. Don’t divide us there r so so many other serious issues to deal with. As if our economy is flourishing that we want more population. Great work both of u.", "super_hyper_carsss": "🔥❤️😘", "wasiqhere_": "Jio bay murari 😎❤️💣", "drkaminiverma10": "👍👍", "arunkumar.manjula": "Tukde tukde Gang ka maa, baap @reallyswara", "jatinjagota": "@meghnab92 please tell me that you understand this 😬", "mr.kp_14": "Do u even know full form of CAA & NRC?.... Ye nautanki movie me karna real me nhi.... Nahi to tum dono bhi gayab ho jaoge", "prajapatdeepak0004": "dear @reallyswara didi mentos khao dimag ki batti jalao phir protest mai jao aaj ke sawalo se bachte najar aye aap dono isliy jiska kaam usi ko saaje", "zubair1663": "❤️", "madihashakeeel": "more power to you guysssss♥️", "rohit280390": "Ye darma bnd kro aap log aapne acting pr dhyn do", "prince4rathore": "Aa gai patta gang ki mukhiya bahot dino baad Hyderabad ke incident ke samay aap kaha thi. Bahot dogle ho tum log #caab wale mamle mein bhi bina padhe likhe haye haye macha rakkha hai.", "ru_ggn": "Indian supper CAA , why are you putting your views as Indian view . Modi government is with full majority and have got mandate. India for sure trust Modi more than the actors who are protesting to make their Khan bosses happy as they( Khan's )are too fearful of Dawood and their guys in Mumbai . India can understand your protest and your logic behind such protest . You want to survive Mumbai, fair enough , but don't say that India supports your view. India is with @narendramodi . #supportfromeuropeforcaa", "kainat_mirza_k": "😢😢😢", "imamanmaurya0": "Good one 👍👍 troll army troll kregi ... Kyuki unhe ye pta nhi ki such na kbhi jhukta h na kbhi chipta h", "sunny_de_rj": "👍👏👏", "priyanka1988v": "Respect", "mr_sparky__": "We reject uh", "rumi_farooqui": "❤️", "imarif007": "Dil jeet liya bhai", "mohammadaadil89": "🙏🙏 great", "saanvi.talwar99": "Proud of UP Police.", "bhatedawala701": "जो गलत करेगा उसको देहली पुलिस इसी तरह ठोकेगी।।🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "imtiyazkhan226": "🔥🔥🔥🇮🇳🇮🇳🇮🇳 ( जय हिंद )❤️", "hira.ansari.75641": "Well done.", "mr.faiau_07_s": "I support you mam no nrc no caa 🇮🇳🇮🇳", "i_am_arslan97": "@reallyswara @mohdzeeshanayyub आप दोनों रियल हीरो हो", "gana.k1290": "🔥", "mukesh_______soni": "Rakhi Sawant😜", "harshrajput004": "*_इस्लाम फैला क्रुरता से,इसाई बढ़े धुर्तता से और... हिंदु घटा अपनी मूर्खता से!*_", "strange_girl019": "I really don't like you personally as heroine or actress but I like ur thoughts and ur straightforward ness.", "patelnitin12": "India reject u and ur comrades ur this tukde tukde gang politics won't work in UP here first slap and than ask name so just fuck off from my state motherfucking commie moron", "that_grown_up_kid": "💗💗💗", "khan_saab_faisal007": "MA am u did a vreat job i m a jamian thanks to join us.. And comes on the humanity side. @reallyswara. Thank you so much", "caprakhar": "U.p me ake protest kariye..", "abhishek_is_chilling": "Ab kundan ko akal aa gai hai, bindiya ke vitamin khakar usi se ishq ladana hai... 😂 zoya ka pyar bahut hi bhari pad gya kundan ko... Banaras badal raha hai...", "nehajohari67": "India rejects you bhasker . hope you don't get any work and lose your relevance", "ankur_joshi20": "#ghar_vapsi ho gyi", "khanafra95": "❤️❤️❤️", "be_like_nikkie": "Mujhe samajh nahi aata.. comment section me log gaali kyu use karte hain?? Agar agree nahi karte toh normally bol sakte hain with logics etc. Gaali dene se konsi unki baat sahi prove ho jati h. Mtlb.. literally confused.", "smokeisland_fm2920": "Simply say fuk randi k bacha modi", "pramod_2255": "You have hide it and now making all this publicity drama search your own house !!! Proud of UP police you did very good job giving punishment is the justice!!!", "pratik_khamari": "Dono pata hi nahi NRC kya hai nah CAA", "shaikhmuzammil07": "👏👏 great mam"}