{"anup.sukumaran": "CAA पर जो नाराज है उनके लिए रास्ते निकालेंगे-अमित शाह एक रास्ता अफगानिस्तान, दूसरा पाकिस्तान ओर तीसरा बंगला देश की तरफ जाएगा😜😜", "chhagukumawat": "WE SUPPORT CAA CAB NRC", "rahil_qureshi73": "#rejectcab", "arijit2584": "Musliam ka beta musliam bangea r hindu ks beta secular bah!", "4th_king_nyn": "Meaning pata hai CAA ka???", "aakabi77726": "Rannd hai ye", "bhagat.sanju1000": "#indiasupportscaa", "fin.knowledge11": "Dhongi pana band karo swara didi ji", "nensigarasiya": "So so so stupid", "janikrunal61182": "Why don't u talk about kashmiri pandits who were thrown out of kashmir in 1989.", "arpit420.singh": "Support caa gand maraye swara", "baneshdangwal": "Vibrator....", "abhishekvishnoi29": "Aaananna😂😂😆", "official_pal_nikhil_": "NEVER SEE YOU MOVIES AGAIN IN MY WHOLE LIFE DEAR I THINK U HAVE TO LEARN HISTORY FIRST🙏 YOUR UNKNOWN FAN ☺️ 🇮🇳 I SUPPORT CAA", "risewd_astroqoutes": "Democracy talk with who you?? What a joke ab comedians bhi CAA par talk denge kya din aa gaya h bhai😂😂😂😂😂CAA ka full form sikh k aao draft kidhar h CAA ka wese kuch ata pata bhi h k 500 per day k hisab se tum v nikal rahi dharna dene😂😂😂😂😂😂", "akhilesh.sbc": "CAA ka draft Mila Kiya Swara...tumhare sapne me Rubika liyakat to nahi aati na🔥🔥🔥😢😢", "adxrija_78": "Arre behnji NRC hai kaha jo tum chilla rhi ho??", "__nidhii_": "No you feel like a bat soup! Toxic to the people and the country:))", "mahen2570": "Democracy sab k liye he", "jitender_hissar": "ABCD to tujhe pta nhi bus rohingya ki Tarah bakwas kr, tum jaise jaichando aur jodhabaio se he desh trust hai", "indreshravriya": "NRC kaha aayi hai desh drohi", "mystical_bambi": "Deshdrohi chutiya 💩💩💩💩🖕🖕🖕🖕🖕🖕", "skhajuria8860": "I support CAB...❤️❤️❤️😂😂😂😂😂", "managobinda.sethi": "Proud to be an Indian and Shame on u for misleading nation’s youth", "p_r_a_c_h_i_s_h_a_r_m_a": "Brainless shit", "a.s.h.i.s.h.___": "Jis thali me khaao or usi me cheed krrrrroo ...bhoolo Mt ....next movi me Kya hoga.tumhara", "mainvishaal": "केरल और पश्चिम बंगाल में रोज के रोज दंगे होते है बहुत सारे भाइयों और बहनों के ऊपर अत्याचार होते हैं अगर आपने इतनी ही हिम्मत है तो एक बार वहां पर विरोध प्रदर्शन करके बताओ सिर्फ बोलने का काम मत करो आप जिन विचारों का समर्थन करते हैं ना वह विचार कहीं पर भी टिक नहीं पाए", "amdikomdi": "@reallyswara if u don't hav birth certificate no school certificate no adhar card no ration card no election card....u also can't produce 3 people who know u that u r living in India...then who the hell are you....bang on @sadhguru", "sampath4074": "Wow🙌", "aryaprabhu": "Do this again please.", "ps.bhardwajsharma": "Gandi aurat", "nishantniks": "Oye CAB was a bil now it's CAA is a act... Tu akhand chutiya ho yar", "margish_patel_": "Passport kese ban gya madam ji aapka", "vasundharan18": "इस्लाम फैला क्रुरता से ,इसाई बढ़े धुर्तता से,और हिंदु घटा अपनी मूर्खता से ! #ZERO @reallyswara", "1302_deepa": "Go back your country dear Pakistan Bangladesh aur Afghanistan, jo bhi country hai, Hindustan ne tujhe banaya hai tune India Ko nhi🖕", "adv_vishal_gupta": "We oppose your protest", "yashshaab93": "HA HA HA swara you know about CAA or NRC", "rakeshsingh9392": "Tu randi h aur randi hi rgegi.. Aapna muh bnd rkh😠😠", "digvijaysing_pawar_41099": "🇮🇳", "pri.yanka_j": "🤦🏻‍♀️pehle khud toh padh leti", "charliebhai17": "@reallyswara , muslimo ki baad me, pehle teri bhen chudegi.", "equestrian.3": "Biggest anti national she is.. India ko outsider enemies ki zarurat hi nahi hai.. desh me bhar bhar ke itne anti nationals aur congress party ke phd level ke bande jo hai.. fortunately pakistanis you got lucky AF 👏🏻👏🏻👏🏻👏🏻go with flow", "rithvik_vermaaaa": "I support NRC CAA NRP 370 ARTICLE 35 A VERDICT ON RAM MANDIR AND MANY MORE to COME❤️", "tulsimalam2001": "Bhagvan raam ke sabut mange tab kahan thi ms. Bhaskar", "ritvik.sharma.980967": "Bc pata tujhe tatti Ka bhi nhi h aagyi gyaan ki maa chodne yaha.", "nik11002": "Abe chutiya aurat pehle jaan to let cab NRC h Kya fir ye bakchodi kr..... Itni gawar kese koi hosqta h ...... Aand ke na gaand ke Gyan chode saare bharmand ke", "shubs.gunjal": "Madam can you explain CAB ya sirf protest karengi kyuki abba apke...", "ham_za_mohd": "💓💓💓💓💓💓💓", "kushagraeee": "tere jaise log is desh ko pakistan bna rhe hai naki democracy sali", "supremesamrat": "ILLITERATE S AGAINST CAB AND CAA INCLUDING \"GIRA BHASKAR\"", "rp3732246": "Police wale iske dande maare", "fitness_freak_mom": "How cheap u could be", "pritishkc": "अगर तुम्हें यह बर्दाश्त नहीं कि तुम्हारी *“यूनिवर्सिटी के अंदर”* हमारे अपने, सर्टिफाईड सुरक्षाकर्मी, *_बिना इज़ाज़त नही घुस सकते ....._* 🔥🔥🔥 _तो हमारे देश के अंदर_ _कोई भी अनजाना ,बिना पहचान के अवैध घुस जाए,_ _उसे हम कैसे बरदाश्त कर लें?_", "raj_haterss": "Lagta h tumhare pass 1947 ka koi proof nhi h tbhi tum stand lene pahuch gyi thi Pahele nigrik bno fir bakayeti chodna ... 😂😂", "smartynainu": "Akhand chutiyappa", "calll_me_ck": "@reallyswara Have you even read it CAA and NRC ya sirf Congressi cha choos rahi ho?", "yoyo_rajjadi36": "Tujhe is desh me rahneki koy jarurat nahi hai...tere pas sab kuchh hai...bahot paisa hai..tu chali ja kahi or ...wha maje se rhna ...koy problems nhi hogi tumhe.....tere jese gaddaro ki hi vajah je hi to mere ye desh bahot bhugte aaya hai....warna kisike baap ki takat nhi hindutav ke samne aankh uthake bhi dekhe.....but tu nikal ...😠😠😠.......Har har modi,, mahadev modi 🙏🦁💪", "abhijeetroy1162": "Yeh sab kar ke to famous hona chahte ...hai...par yeh impossible. .hai...randi..", "kshitizoberoi": "Nice marketing 💸", "shahzada_gulrez": "👌👍", "iamzaeno": "Gawar government ko vote dal kar ek toh india me tatti failadi, aur logon ne khud k dimaag me b tatti bharli jo wo comments me tatti bharrahe h bc #rejectcab", "maliksahab0432": "❤️", "sachin5947": "Abh India bhi chod do... @support_CAB_NRC", "singharakesh07": "Jai modi", "ab_ahir_11": "Jab Bollywood me kam na mile to lady rahul gandhi banke insta pe bakchodi karengi swrabhonkar", "udaypatil777": "I support #NRC_#CAB", "spaceman_ayush": "Brainless youth easily tamed and brainwashed by social media who have lost their own ability to think. I can guarantee none of them have gone through the bill just blindly protesting. So sad😓", "priyanshurajbabu2": "After four days 5500 people out 130crore of India supporting u. Are u still think u r a celebrity wake up form ur ugly dream dear.", "rajverma2013": "bahut gehra asar pada Swara ke dimag per Bachpan ki chot ka 😂😂😂", "hows_the_josh_jai_hind": "Support nrc cca", "kunwar_devendra_pratap_singh": "पाकिस्तान में हिन्दुओं पर अत्याचार होता है तब चुप क्यू होते हो", "anshikasingh7327": "NYC aunty😂", "sandaepk": "Swara, as you are protesting against CAA & NRC, can you pl explain what is this bill and how this will affect us? You have to reply on this or else step back from this protest.", "raosushma89": "You 1st understand the NRC and CAB. #boycottswarabaskersmovies. This is not a Bollywood movie this is our country. Don't try to create difference Hindu and Muslims this won't work. We were never separated. Hindu and Muslim always stood together for India.", "sugarplum_giggle": "@reallyswara stop misguiding and first read through .... Wat a waste", "june_moon98": "Join this bullshit women and do anti national stuffs beat the cops and spread violence....bloody congress ki dalal....", "rudrasharma7025": "I am with caa cab and nrc", "iamhulk1985": "Pehle Jake samjo fir virodh karo ... Morons...", "kill_me_or_die_of": "We support CAB..", "iams558": "Changle", "__serious__boy": "#WesupportCAB", "raj_shivaay7": "propoganda queen", "h_u_u_9": "Isko spane aa rahe hai agala PM hone ka", "ilgnaouibrahim": "👏", "arun.rana877": "Aa gyi randi apne customers ko sport krne", "amitghotekar100": "CAA . NRC to tera baap bi badal nahi sakta. Dum he to rok ke dikahv.", "hritik123a": "A bitch called Swara Bhaskar 🖕🤛", "ankyankur3": "Pehli fursat me nikal", "iamashitosh": "This Post is for violence in India, without knowing the proper facts, everyone unfollow her.", "royallymodest": "https://www.facebook.com/kalpna.arya.35/videos/1234498603421928/", "hntarang": "#boycottswarabhaskar", "instantmotivational_stories": "I support CAA-NRC.", "sahil.parashar": "Har controversy initated by swara", "im_seema_tushar": "Koi kaam nahi bacha h bechari k pas to aag lgane ka kaam kr rhi h 😂😂😂 oho ho ho bechari @reallyswara", "anshumanali242": "Bolne se pehle padh le kya h kya h CAA,CAB tb hi protest kare please........ aur NRC avi tk lagu nhi hua h.....please news dekhe....", "priyanka_9585": "Really swara , have u ever studied about that bill 🤔. I doubt 😏", "dheeraj_panwar_18": "भाइयों इसने बिना कुछ समझे #cab और #nrc का विरोध किया जबकि इसको इसके बारे में कुछ नहीं पता ये देश की संपतिया तोड़ रहे है उसके साथ है । इसका बायकाट करो ।", "____vinay_sahu": "Madarchod", "_a_a_s_h_u___": "👎👎👎👎👎", "siyaa.3451": "@reallyswara phle akkal prapt krne ka course kro dimag na lgao apna agr h nhi to 😠😠😠😠😠😠😠😠😠😠😠😠😠ek rat pakistan m bita k aao jao phle ..... Hindu ldki bnkr fir bkwas pelna jyada dimag chato sb ka and i wish ap sbki movie eekhna bnd krde", "kuwar_aman_singh_rajput": "Terko flim me puri nagi hogai aur kitni azadi chaiye masturbated in flim veere di wedding", "pamo18_": "अजीब विडम्बना है हिंदू ही हिंदू को भगाने के लिए आंदोलन कर रहा और मुस्लिम अपने घुसपैठिया को पूर्णत: बसाने के लिये आंदोलन कर रहा है", "so.ni3477": "didi ap konse azadi ki batt krre hai sadak pe masturbation krni ki......... jo hona hai vo hoga bhle ap sadak pe kpde ku na utar do.......", "sh.reya3884": "Swara Pakistani agent.", "payal_0027": "Pehle isko he bhagao india se... Jao pakistan tab pata chalega tumhe.. ... Dusro ko bhadkane ka kaam band karo... 😡 movie me kuch ho na saki or yaha pe mudda banake bhid rahi he...", "tush6714": "अनपढ़ पहले पढ़ क्या है फिर नाटक कर क्या कायदा है मालूम नहीं। भारत के मुस्लिम से इस नए कानून का कोई सम्बन्ध नहीं", "veerakaash": "Acting ho nai paa rha tere se Ye protest choro Brazzers join kar tu India needs to be free from leechers like u", "i_am_prashant_shah": "nikal pahli fursat me nikal", "nysha133": "Swara aunty we know your agenda is to kill hindus from India, you won't succeed traitor. Karma is on your way!!!", "sathwik_malnad": "Wish u would have some brain and knowledge. How much u got paid for this...", "_baseer_": "💯💯💯", "anas_0802": "You are a nice person keep up the good job❤️💯 @reallyswara", "chinmay__deshmukh": "My father is a congress Person and so I am but I don't believe in opposing the act which favour my nation. Whatever comes in favour of India, this fucking @reallyswara Bhaskar will oppose. Will you @reallyswara explain all of us how this bill effect anyone's citizenship ?. You are stigma on face of India. Muslims appeasement Karna ab desh ne chhod Diya he. Jo Sahi he vo Sahi he. I support NRC AND CAB", "idhaval7": "Begger", "itzamitnegi": "God bless your retard brain", "realshubhamdubey": "Swara ,side role mat play karo ,if you have guts if come and join the politics fight , and then let's see you come into power or not,, 130 cr log bas openioin hi acche se dete hain, aur maze le rahe h, side me , aam log road per aake real scenario face karte hain.....", "ghildiyalpankaj": "Aur Kya madam ne acting line chor kar pakistaani movie industrial me jaane ki soch rahi unko lagta pakistaan movie wo acting Achi Kar legi yese bhi kya karna logo ko pagal hi to banana hai wo to madam ko ache se Aata hai madam aap bhi apne birth certificate dund lo jaldi kyuki protest Karne ka ab apko Jada time nahi mile aur haa apne NDTV wale bhaiya Ravish Kumar ko bhi bihaar se sedha pakistaan 😜😀😂", "priyanshu_mishra200": "Gaand me khujli ku ho rhi h g aapke", "archisensei": "🐷🐷🐷🤮🤮🤮", "niya_khatod": "I strongly support CAA nd NRC....🇮🇳🇮🇳🇮🇳🔥🔥🔥🔥", "akilmak": "Proud of you tigress...mor power to you..me...and...for them who is not andh bhakts. #nocab", "preeti___shukla000": "I know you r not going to reply my comment but i just want to know that what r u protesting for... CAB isn't a bill Or law to snatch anyone's citizenship.... It is a bill for those minorities of begladesh afghanistan and Pakistan who have been tortured there on the basis of religion... Okay this is the thing that our home minister is saying from the day when he introduced the bill in lok sabha....now ask any Muslim country will they accept any hindu if they get tortured here..... Nahi, nahi karege kyu ki ye stithi aayegi he nahi ki yaha koi torture kiya jaaye fir wo kisi bhi dharm ka ho.... Aur jo aap log aap jaise kch bahut he samjhdar log ye keh rahe ki yaha muslims ko target kiya jaa rha hai unse unki citizenship chheeni jaa rai hai to madam agar aisa hota na to jaise Bangladesh afghanistan and Pakistan k minorities yaha naagrikta lene aa rai hai waise he yaha ka muslim abhi tk na jaane kitne muslim desh hai unke paas naagrikta lene chale gaye hote.... Is bill me un 3 desho ki minorities ko isliye yaha ki citizenship di ja rai kyu k wo waha ki minorities hai wo muslim country hai waha kisi muslim ko torture ya uske sath kch galt nahi ho rha jo ho rha wo hindu sikh isaai inhi dharm walo k sath ho rha.... Aap sab is bill k peeche chhup apne apne ullu seedhe karne me lage ho na aapko is desh ki chinta hai na is desh k 1 bhi musalmaan ki sirf aapko apna matlab saadhna hai.... Aap wahi log ho jo kch din pehle tk mob linching mob linching chilla rahe the per pichhle kch dino se shaant ho ab bhi desh me mob k zyada linching ho rai aur linching unki ho rai jinke hath me hathiyaar hai per wo shant hai.... Shant isliye he hai k hume apne samvidhan ki apne desh ki aur desh k har ek naagrik ki chahe wo hindu ho muslim ho ya koi bhi ho uskichinta hai.... Warna jaao kisi bhi muslim desh me dekh lo kya hota hai jab non muslim samudaay k log koi protest karte hain.... Aap saamne aao ya jitne bhi aise log hain @faroutakhtar @anuragkashyap10 @socialist_akhileshyadav saamne aaiye khul k baat kariye behes kariye ye nav-jawano ko bhadka k peeche se apna ullu seedha karna aapki desh bhakti nahi aapki choti soch ko darshata hai.... Aapko desh ki nahi apne faayde ki chinta hai aapko", "unbeatable.ajay": "CAA के ख़िलाफ़ परदर्शन नहीं CAA के नाम पे दंगा फसाद किया दंगाइयों ने इन्हे बड़ी से बड़ी सजा देनी चाहिए संविधान ये हक नहीं देता ये सब आतंकवादी है ओर इनका साथ देने वाले इनसे बड़े आतंकवादी HATE YOU @reallyswara", "vaishhh.__": "@reallyswara Phele you will bark in Muslims aren't safe India is that have problem with vande Mataram all this Muslims leaders with say such things and now asking why they are excluded wow. 😂", "heer_purohit_007": "🤣🤣🤣 Aree deviji aap kab aayi", "imshilpasaxena": "I support CAA", "a_bhijit": "Kuch kam dhunde nahi he kya 😂😂", "_sana_sayed": "Dil khush krdiya ..guts h boss❤️❤️😘😘", "__prashant.sharma": "Great move by the govt..Deshdrohi saamne aa rhe hain..", "derya_gorken": "Porn star 🖕", "manishmwr10": "Yeh dekh mullo ki paidaish 🤣🤣", "suraj.shady": "पहले अंग्रेज़ हिन्दू मुस्लिम की एकता से परेशान थे अब उनकी नाजायज ओलादे हिन्दू मुस्लिम की एकता से परेशान है you go girl #reallyswara", "keshavkate3333": "Actor is crazy🤣🤣🤣🤣🤣", "tapan__6698": "Tu lawda kuch nahi janta h...CAA/NRC ke baare m.........behenchod tu Pakistan kyu nahi chali jati....... Gobar sali....", "prajakta__k96": "Read the Act first and then start doing such nautanki......dumb @reallyswara #isupportcab2019", "he_rohhh": "@reallyswara bhen tuh rehnde ...tuh konse parliamentary hai jo is act ko galt bolri hai? Chahiye toh unn immigrants ko ek naya desh bana deh aur tuh bhi unke saath rehliyo .bin jaane gyan math chod", "rintinintin": "Hindus are scared. CAA was about Hindus taking Hindus into India from Pakistan, Bangladesh and Afghanistan. Hindus are being raped and killed in Pakistan. Where should they go? Do you support rape and murder of Hindus in Pakistan?", "akashgolu123": "Tm yaar sextoy le k khelo bs tm uss me hi achi lgo gi.. tmko thokne me mza ni h", "chand.qureshi.5095110": "Thanks mam for solidarity against CAA", "_soni_bhargav_roi1": "Gujarat mai kya hua dekha andho peaceful protest salon pathar aur eette mari salo protest hai yea dange besharam ...human rights abb nahi", "idpesh": "Arre Dobbi 🤣😅🤣😅🤣", "mywishmyrules": "Rather than spreading a peace message all the Bollywood is spreading hate . Ask to the people of Delhi in what atmosphere they are living these days it feels like Kashmir in Delhi students cannot go to school , people working cannot go to office , people are pelting stones ,internet is shutdown in some regions yes it is everyone's right to protest but to what extent that normal people's life will become hell. Spread peace this matter can be sorted out without any violence and without damaging public property and causing public inconvenience .", "andyfirsthopkins": "We love and support you swara", "srivastava_aashish": "#reallyswara Fuck off you bitch 🤬 if you have a problem with this CAA & NRC then go any other country 203 more countries are there in the world... Fuck 👇🙄👇off", "tanoj__": "Nautanki mat karo...", "rawat_sunnykk": "MAtalb AUNTY dimag aur dil dono mai hi gobaar bhara hain kya tere?", "priyenm_ehta": "Nikal lud....iiiiii pehli fursat se...", "cuteginni_1204": "Saali kutiya bandariya bhadwi... Tu v ja Pakistan 😠😠", "justshivamsharma": "Gonna tell my kids she brainwashed the youth of the country!", "aditya_kaushik_117": "This is not just an invitation for protest but a signal to the illegal migrants to put the nation on fire", "royalraghav99": "You are a mad women stop spreading rumours you are trying to spread hatred shut your mouth you are already one of the members of tuke tukde gang", "shreyannn0099": "Ugly aunty aap tab kaha thi jb kashmir me pandito ka persecution horha tha. Ap tb kyu nhi muh khole jab hinduo ko Pakistan,Bangladesh me torture kia jarha tha ab ap secularism ka paath padhane aagi.muslimo keliy stand liya. Thik hai achi baat hai.isme kch galat nhi hai, per jab hinduo ke saath kuch hota hai tb tum jaise chup kyu beth jaate ho. Yeh kaisa dogla secularism hai@reallyswara secularism ka matlab sirf ek community keliye stand lena nhi hota. Ugly aunty👎👎👎👎", "mmushrif": "I appreciate and salute you mam #bravegirl#rejectcaa#rejectnrc", "sudhanya07": "inlogo ko dauda dauda ki mar padhega...!!", "almas_ismael": "You are great mam thanks", "divyesh_parmar_21": "Koi isko seriously bhi leta he ? 😂🤣", "amrut_may_born": "We support CAA AND NRC.", "aakashhaistar": "Seriously agar movies me Kam na mile to yahi Sahi Bina Kisi BAAT ke students ko bhadkana public ko bhadkana taki thodi cheap publicity mil Jaye bht hi ghatiya ho tum", "sniper_arpit": "Sabse pahle tujhe hi Bahar karna chahiye jao apna ek alg desh basa Kar raho desh ke gaddaro", "nikhilsingh88100": "#support_CAB", "_ishika._.singh_": "#CAA is for those minority Hindus who are being persecuted ,brutally raped and murdered on the basis of religions in Pakistan,Bangladesh and Afghanistan and the protest is being done by illegal immigrants residing in India #they want Hindus to be murdered by their Mullah brothers across the country borders . Will #CAB harm Indian muslim = \"NO\" . I support #CAA", "vaibhav.gautam2929": "😂😂😂😂😂😂😂😂😂saram karo saram karo saram karo saram karo", "prekshit.1199": "Hello @reallyswara : time for you to rethink your every decision on the peoples you are standing with!", "tanya.chakravarty": "Dear Mr. Prime Minister and Mr. Home Minister, This is an open letter from a law abiding tax paying citizen echoing the voice of many. Do not test our patience. We voted for development and prosperity. Not for you to divide us. Not again. Yes partition happened and we suffered including my family. We have built everything back brick by brick despite the hurdles we faced. Not for anyone to take political advantage of it today. We are not and refuse to be a country that discriminates on religion. This is not the will of the majority. We don’t want to debate about religious identities, we don’t want to hate our neighbour. We are better than this, more evolved than this. Don’t teach us hate or selective inclusion. This is not the voice of your political opponents, this is the voice of the people of this nation. Voice of the youth on the basis of whom you market this country. Listen to us. We want the focus back on economy and development.  Roll back CAA.", "ishita6702": "Mene bangladeshi Or Rohingya muslim ke samarthan me kai hindu Ao ko dekha he lekin kashmiri hinduo ke samarthan me aek bhi muslim nhi dekhaMene bangladeshi Or Rohingya muslim ke samarthan me kai hindu Ao ko dekha he lekin jo hindu he kashmiri pandit ke samarthan me aek bhi muslim nhi dekha", "sweet_sara0504": "Anti indian u r just get out. Spreading hatred u chipo.", "razz.iy": "Cab hua h ,nrc bhi hoga jay hind 🇮🇳", "yagna.guddu": "just curious..What if nrc is implemented and settled before caa ??", "yashjhareal": "Kyun mind divert kr rahi ho bhen ji... dharm parivartan kr liya he kiya", "sahilthakur3820": "BJP zindabaad", "sp1r1t_breaker": "Go back and read the pdf of CAA.i know u r fool but dnt act like that", "divyanshu_agrawal3656": "mc jab cab or nrc ke bre m nii pta to kyu gyan dete h... actine line m dhyan de tere bs ke nii h rajneeti mc..", "ayaz__az_": "jab jab zulmi zulm krega sata ki galiyaro se chapa chapa gunzzz uthe inkalab ke nare se💪💪", "mishramanjeev": "Madam, we certainly respect you as an artist. But when it comes to the country, we must pay attention to how peace is created in the society. And we should also be aware of this in the society. When the Hon'ble Prime Minister and Home Minister of the country They also say that this law is for illegal intrusion purposes. But you also have a duty not to send false message to society.", "swatirathore.in": "Let's unfollow her. She doesn't deserve to be a celebrity", "shakshiiii_": "Fuck off from India bro🖕 really a sick minded lady... And a anti-national women who is spreading hatred", "_itz_shizu_": "Mtlb bhi pta h CAB ka gwaar aurat.", "tusharkharat007": "BJP🚩🚩🚩🚩🚩🚩", "sharma_kriti1": "Arey aunty, kyu thak rahi hai......?", "aashray99": "pehle bharat ke tukde kar rhe the.....ab yaha rehne ki bheek mang rhe😂😂😂😂😂", "hd.shweta_94": "https://m.jagranjosh.com/current-affairs/amp/what-is-cab-and-nrc-difference-what-is-cab-non-muslim-religious-minorities-nrc-assam-1576565238-1", "dhruvraj_987": "Modi modi modi modi💥💥💥", "whoatulpandey": "Cab support krunga tm jaise nithallo kr bhadkane me nhi aunga hindustaan zindabaad", "shanilasuhail": "Proud of you Swara, don't let the hate get to you ❤️❤️ India loves you and appreciate your support to uphold the values of its constitution. I'm a proud Jamian and a proud Indian. (bhakts coming in 3...2..1 to call me randi and/or pakistani)", "selcouth_05": "@gaurav__sachan jaao tum bhi", "luni_river_flow": "Patte pdenge sesti tere aada krke.", "perksofbeingmuslima": "Thank you for standing in solidarity with us.. The nation will remember your contribution in saving our constitution forever ..", "mohsinasayed": "You are awesome Swara!! You make Indians proud! Sending lots of love and luck your way!! ♥️", "mailanuj25890": "We support CAB AND NRC..", "king210289": "Gasti", "prabhate.kr0602": "Itni educated hone ke baad bhi nahi samjhi,cab nagrikta Dene ka bill hai lene ka nahi,virodh ke naam pe bengal mein train jalaye Gaye,iska bhi to virodh kijiye.", "ashu0829": "tum sale sab deshdrohiyo. tum sab laat maar k nikale jaoge 🤮", "singh290791": "Sawara (anarkali) tumne kabhi 5 lakh kashmiri pandits kai liye kitne baar protest kiya aur aawz uthaye bata ....", "prashantttiwari7": "Swara didi aap #cab ke Virodh me Desh chod dijiye 🤣😂🤣🚩🔱🕉️🔱🚩", "jaatlife01": "I support #cab how much rupees did you took to be sold out to traitors 🖕", "shk____7": "sab saale jalte hai..you keep on doing what you doing...haqq baat krna aur kisi ko haqq dilaana bhale se mushkil ho krna par kabhi ye sab cheez krna chorna nahi....@reallyswara kisi ke baap ka desh nh hai ya modi ke maa ke Yaar ka desh nahi hai ye jo ye bc musalmano ko nikalega yaha se..nikalne ki raah me khud modi hai is duniya se 🤣🔥", "rishi_b_theofficial": "Pehle Intolerance, phir tukde tukde, phir award wapsi, phir cows and now this. Huh 🙌", "guptajaiprakash68": "I support CAB NRC", "karan.gupta.9279": "Chutiya", "ram.khanna": "With u always, ❤️. 🔥ignited. U r really \"Swar\" of all!", "kundan72980": "Ye hai Kon", "abhi151098": "Bc", "sagar161678": "Aunty dont mislead us", "dreamer24x7": "Please give some spine to Shahrukh Khan, Salman Khan, Amir Khan, Ranveer Sing and Akshay Kumar. They should have taken birth in hareem of some king centuries back.", "mehfil_e_jamia": "Stand with jamia", "poonam.chadha_7": "Shame on u", "i_heenashaikh": "💖💖💖", "daneil_plainview": "✊✊🏾✊🏿♥️♥️♥️", "badfalsam": "Picture nahi milti bechari ko .", "yashwanth.official": "#CAA need proper reason for citizenship, so pakisthan Muslim doesn't have proper reason, so they not added ,it is not religious discrimination , if proper reason is there CAA will give citizenship, first study then protest @reallyswara", "varsharitu55": "👏👏👏👏👏", "arjunsuri1986": "Attention seeker", "priyansh_77": "Jaao aunty aap Pakistan Jake rho ...", "shoaibqureshiz8221": "U r a real heroine of bollywood u have a guts to stand with the truth salute u mam🙂😘", "fixupcrownlady": "Ya! I was desperately waiting for this! Wahi mein sochu abhi Tak apne aap ka muuuhhhh kyu nahi khola😂.. n look who is talking about democratic talks😂😂😂🙌. Lady go get yourself a movie ! And then may be come here for all this", "sainath_batte": "Please send NRC Draff.i really want attend but I am just dumb like you..", "sspkudla": "Support CAB for prosperous and happy india. This bill will send out illegal immigrants who involved in terrorist activities...🇮🇳🇮🇳🇮🇳", "officialnomii": "You are good human💝", "a____kash____": "I support cab,caa,nrc please live in pakistan and feel the pain of minorities who lived there,then talk u bullshit", "ritwikverma11": "Our amazing government and minister's invested or say wasted 1600crore for verification of illegal immigrants in Assam and after getting 1.9million illegal immigrants you know what they did they built an jail for them worth 49crore instead of deporting them back and person's who are caught as illegal immigrants most of them aren't illegal immigrants they are poor or underprivileged people who doesn't have any documents of their", "nalayak_03": "उंगली करनें पे ही ध्यान दो , ज्यादा दिमाग मत लगाओ वरना भो$डे का चबूतरा बन जायेगा, 😂😂", "iqubal.jawed": "✔️✔️✔️👈", "bala.mohit": "Cab to ake hi rahega aur hum iska support karte he ho sakta he vo karle", "sha_shha_nk": "CHUTIYA KO kya MC", "balveer__bharti": "Good work", "alizey8007": "I salute your support you ... Keep going 👍👏👌", "nikhil_rastogii": "Inke jaisi deshdrohi auntiyon ka citizenship sabse pehle cancel karke, inko Pakistan deport karna chahiye! Comment if you all agree.", "kinghimmy__": "Filmein to Teri flop ho hi rahi hai .. fir pata tujhe kuch hai ni anpadh kahi ki .. aa gai hame gyan dene..😂😂😂 juthhe log jotho ka hi support kare..", "convey2shivani": "🙌👏", "vermakantravi": "Jyada neta mat ban aunty nhi to police k dande zindagi bhar yad aayenge..😂😂", "sanju009766": "🖕🖕🖕🖕🖕", "sktabrejquadri": "We all with you mam 👍", "akash_dalal": "Behen ...badi duhai deti ho lokshahi ki..kabhi javab bhi de diya karo ..ya fir tum karo ti raam leela and hum kare to character dheela? Bolo... kisiko bhi desh me q ghusne du? Tum jake try karo usa me rehne ko aur dekho kaise treat kiya jata hai...nagrikta hai koi bhikh nai jo sabko de di jaye...jo illegal aaya hai use jana hi hoga ...ya to apne ghar me kam dedo...agar itni hi chinta hai to....agar dum hai to BHARAT KI NAGRIKTA kama kar dikhao", "anayamathur5": "#indiasupportscab", "k11kavya": "A lady with no brain. Just misleading people .", "rashidsafura": "You are really a girl with golden heart love you to the moon n back ❤️", "patelnitin12": "Ek baar supreme court ka green signal milne do phir dekhe Benchod kis be dam he rokne ke, 370 ho gya, CAA hoga agla number in civilized commies ka", "sunny_saini_ny": "Bheekh maango pehle phir rehne milega tukde tukde gang ko.🤣🤣🤣", "ha_m_vhi_hu": "Bulshit", "rahulgaikar_": "Support for NRC, but not for CAA, we don't want any new emigrant, no Hindus, no Muslims, no Sikhs and jains too. Jo illegally aaye he unko nikalo pahele, naye mat bulao.", "kunal.jethi3180": "Plz explain", "iamshejukhan": "salute to u mam #rejectcab", "nik10800": "These tukda gang r telling about so called student's rights... But could they tell who burnt buses,, who threw stones to police...? Bakchodi hai inki", "the_religion_universe": "अगर दवा डालने से कीड़े बिल से बाहर आ जाए तो समझो दवा ठीक है।। CAB , NRC #fakeliberals #jihadexposed", "iqbalsharif72": "superbbbbb👏👏👏👏👏❤️❤️❤️❤️", "pushkinbhattacharya": "😂😂😂menopause syndrom😂😂😂makes one cranky", "ishitabhartia26": "Need this in delhi pls!", "iimkrishnasingh": "@reallyswara u r a fake person... Kuch nahi hoga tumhara .. looser", "zakirhalima": "More power to u n ppl like u.. Lots to love n respect..", "suveshi": "Please hold one in Delhi/NCR too! #rejectcab", "theakshitaaa": "Other STATES also need this !! 🙌", "lalith1406": "Keep spreading twisted truth, manipulative lies, but know this, truth will always triumph", "nk2601": "Congress ki half celebrity !!", "panks008": "Haha swara aunty again...shadi KR Le swara time se. buddi ho gyi hai tu.. gye Tere din jhuth bolne ke... boycott swara aunty...", "beingrjnayabamanat": "#Rejectcab", "shristi_not_shruti": "Everyone on the Internet is misleading.", "zameer.zz5": "Thanks for the support mam🙏😍", "yuvrajsinh_b": "#isupportcab #isupportdelhipolice #indiasupportscab #pehlifursatmenikal", "swapnil.k.singh": "Kuch bhi karlo India stands strong with PM and HM.. we need CAB n NRC", "navin150150": "When", "anjani.singhup": "I am supporting to CAA n NRC.No anyone will changed it", "koushikduttaroy2": "Nikal lawdi pheli fusrat main nikal apne Pakistan main...ticket k paise le lena road pe jana koi v de dega teri sakal dekh k..", "you.have.my.word": "This is so important🙌🏼❤️", "salman_khan1206": "We reject CAA NRC with swara mam and we will all change it kisi ke baap ka hindustan hai💪💪", "imagica_143": "Finally koi to Bollywood me hai jo real me hero wali quality rakhta salute u mam", "cavalier_whack": "More power to u .. let the dogs bark", "mariyaaa4444": "we lovee u swara😘😘 loveeee for ur constant support throughtout", "_.shivshakti": "Amit Shah Ji has clearly said they will not take back the CAA.", "vitocorleonnne": "If it comes from you... the only colour will be moronic.", "pratiik_official": "Always You have a problem with something which is better for country like 370, CAB, CAA, NRC, AYODHYA... you have never talked about Kashmiri Pandit, Sikhs riots, Bengal political murders... be balanced... judge with balanced...", "ankitabisht04": "💖💖💖 thank u", "dikshachand_23": "@reallyswara you are talking about caa and nrc ? What about the one who cannot even have veges and milk with their food", "saysumitbulan": "No nrc no cab", "jaindharm": "Theka siraf Jnu amu jamiya ne liya hai Kyuki Bollywood ke kuch bhand aur kuch students Hindustan ko barbaad karne lage hai azadi in haramkhooro ko chahiye", "mansiid2018": "What u have been doing is much appreciated!! Very few could stand up in crisis", "nes.sanjay": "Librandu gang.. Going on😂😂😂😂", "shail79b": "Acting line chhod di?", "luqman_hakeem_hak": "❤️❤️❤️👏"}