{"sam.kaintura": "Maa Chuda fer", "save_d_world_9": "Pls stop using students of this country as a pawn to propogate your political agenda. Let them study peacefully 1st. They need to make a future for themselves b4 they become d future of this country. A lot of them come with huge responsibilities of taking care of their families. They need to study hard, get a degree n a job 1st. Sadly today..this section of our society is being used by political activists for their selfish motives. They r being distracted from their goals, n studies into politics. Poor parents sacrifice everything to give their children better education. But instead of studying these student r joining politics, beating each other up, letting down not just their parents, but also their country. & these politicians who use them for propoganda r to be blamed for brainwshing them! They're too young to b involved in politics. There's a right time for it. But not when they're in college. So pls..i appeal to u, DONT drag students in political issues in d pretext that 'they are d future of our country'. Else we'll get more JNU like scenarios in future..& our society is going to be a mess! Also i urge students to stay away from politics till u graduate. Study hard n enjoy ur college life. College life is very precious. Once u mess it up bigtime..u'll regret it forever", "amaanansari1335": "BJP bhkt chutiya", "arpit_1245": "Shut the fuck up", "akshayraj0722": "Fuck u ra....", "gauravbishnoi29": "@reallyswara Pls do get a security guards, as you randomly do comment on huge controversies....watch ittttt pls", "lalit.jindal007": "Prrr tere se kisi ko koi ummeed nhi h lavdi🚽", "patilprajaktakrishna": "Aagayi gaddar deshdrohi", "amzad1145": "👍", "mahen2570": "Pahle kashmiri pandit logo ko Kashmir me julm huva uske bare me kuch malum he.. Cheep mind", "shaikhkarvish": "Nice look ❤️", "muhammad_saad_chughtai": "Thank you so much for voicing the concerns ov Muslim community.", "pubg_vs_relationship_memes": "Bollywood actress ? More like Pakistani agent", "jit.suthar.359": "Hehe😂😂", "ankitanjana_": "Abe chal nikal lvdi***", "siyaa.fgh": "@reallyswara apki to budhi bhi cheen li 😄😄😄😄", "vishal_j_a_t": "Konsi netikata, aag lgane vali kya", "soy_omkar": "Urban naxal didi", "_gohanz_": "Film nhiii mil raha h 😁😁😁", "realabha": "Swara ... you will see things the way Your Are’ ... you give hate and u get double of it. Soch badlo apni, to nazariya badlega’ else all year... year after year... you will sulk with sadness and hate!", "akash_mishra_2000": "You are such a piece of shit ...provoking the students and some bloody antinationalist goes Vith you ...stop doing such type of rediculos thing ...", "laddusaurabh20": "BCccccccccccccccccccccccccccccccccccccccccccccccccccc", "im_parthsingh": "तुम लोग अभी भी सो रहे हो | 🇮🇳🇮🇳", "sharmapuneet01": "Lynching par rone wali jaahil aurat kabhi kashmiri pandit par bhi bol le itna badh chadh kar. Kitna bada genocide hua us par teri jubaan kahan chali jati hai?? Yaha ek ki maut par tu maatam manati hai or waha itne logo ko maar dia unhe bhaga dia , us par bhi bol le ya ye tujhe cheap publicity dilati hai isliye tu aisa karti hai. Acting me teri jaan hai nahi or tu chali inki jaan ban ne. Apne dimag ke daaman ko saaf kar pahle baad me kisi ki himayti ban.,", "chuslim687": "🐷SUWARA BHASKAR 😂😂", "keshavsaini6711": "Bss pagl ho tum likh lo...", "mansi2608": "Nikl", "jeet_m77": "😂😂😂😂😂😂", "chandrima_tina_97": "Tu chup ho ja behen malum h teko koi kaam ni mil rha ...ja ja k audition me lag", "iam_kashish_khosla": "We don’t need suggestion 🔥", "j_a_a_n_098": "Alram lagake soye hote to student jagana naa padta apko to oskar dilana chagiye", "deshmukhmanali.md": "Kon kisko jala raha tha behen??", "chhagukumawat": "Or aap ne kya diya", "i_divyanshh": "Thanks to CAA at least flop actresses like you are getting some work to do and getting some followers", "sydmuneera": "Respect for you !", "_parjapati_sanu": "Land diya mera sali", "akansha.gupta06": "Ma'am you don't even know what is CAA and NRC and you are supporting these people . It's a shame on Indian celebrities who supports this . I think you haven't got proper education or you people are ANTI MODI .", "p_r_i_y_a_1321": "How can you do this? How can you be this lady who is speaking ill about the country globally.? Very sad.", "libranaks": "Students need to study and not get involved in politics ... Actresses like you have no sense of activism ... It's just hypocrisy at a candy level ... I pity that you are a role model for some ...pity on those who don't understand what's right and now playful and wrong you are", "headin.cloudnine": "Ye ek esa samaj hai jisko desh ke corruption, barbaadi se farak nahi pad rha! And what students? They have made society better? Oh please! Don't at least lie on the camera and then post it publicly!", "rashidansari451": "👌❤️❤️", "omikoch9": "@motiramanimohit Kuch nahi Hoga isse..sirf badbad karte rahegi ye🤣🤣", "apoorvagovind": "Stupid lady...", "iritzz18": "Bollywood me toh ghanta koi puchta nhi hai tujhe... isliye yeh sab drame... #bloodybitch", "finesse_hearten": "Hn 35 saal ka aadmi university m khade hokr protest kr rha h wo student h inke liye .. are ammaji aapki kitni age h?", "ajayphotosarena": "You fail the moment you found your leaders in people like Prakash Karat and Brinda Karat. A university once known for its' intellectual minds is now Delhi party office of China funded Leftist political parties. And yeah a place more like Big Boss for such failed personalities be it acting or politics.", "astroscience2015": "You speak so much of Shit ya 👍", "nitika_himashu_sasha": "Anti nationalist", "dk199907": "Nice save of career mam.", "qureshi8363": "👍👍👍👍👍👍", "nirmitdabhi": "An essay on students😂", "sabirali9735756gmali": "Nice", "sarcasticrajasthanii": "📢 \"Sasti Cheezon Pe Dhyaan Na De 'Swara Bhasker' Se Mehnga 'Dainik Bhaskar' Bikta Hai\"", "mayank4696": "Tere jaise anpad students hi hai wo, na tere mein akal hai, na tere jaise un students mein, saalo zindagi mein kuch ukhda nhi tumse, 2-3 films kya mil gyi aukad se bahar nikalne lg gyi, dange karwa rhi hai pure desh mein, zhahil aurat", "nirmalvaishnav_": "Ye vo bhok rhe h jo atnkwadi k aaka bne bethe h college school to baap dada bhi gye the pr esi gndgi nhi thi siksha ka mndir h vo or tumhare jese kuch gddaro n esi ki tesi kr di jha kha rhe h usi thali m ched kr rhe h kbhi hmare ilake m aao gaavo m kutta bna k na choda to khna", "t.a.s_3": "student hero hai, aur aap flop actress 😂", "komal_lukka": "Madam have you any idea or knowledge regarding CAN, NRC n all this matters! It should be done peacefully, if you are indian no need to scare, but if ur illegally living in India,,, then those ppl need to go back! That's it, Better Madam you focus on ur career, n dont promote anything like this to get popularity!", "saurav2482": "Abey isko maro koi aa gai bina samje against karne aa gai", "sk8064402g": "Toh ap chale jao jaha ap safe ho ye Bollywood me naam kyu kama rhe ho", "mr.vibzz062": "teri maa ki chut tu hindu k naam pe kalank h randi.....", "rahultherock1789": "Shame on you swara", "sairajpalan": "Do not destroyed their future student future Tumhare fayde ke liye student ka istemal Karte Tum log @reallyswara do not destroy their future #SwaraBhaskaraunty", "1kapil3": "@reallyswara itni chutiya baat kaise bolti ho ye batao jab abhi iit ki fee hike ki baat hui tab kya hua tume tab kyun ni bakwas ki tab kahan thi jab jand k mein itne officers marte hai tab kahan mari hoti ho kisi ek army jawan ke ghar gayi ho jan kabi tab pata chalega itni bakwas karti ho na", "7th_monk_": "😂😂pagal", "nandini_trekkomania": "Pagal aurat", "arjumandaazad": "The real star", "kalpesh8141": "Jnu me koi hero nhi hai randi sali chinal sab deshdrohi hai.chinal", "chaudhari_pradip_2010": "Hatt😂😂😂😂", "sahilthakur3820": "Jai shree ram", "waranbhaat": "😂😂😂😂", "devrajgurjargirgaon": "Tu tab ka mar gayi thi jab kashmiriyo ke sath mob linching hui thi or delhi mai jab sardaro ke sath mob linching hui thi tab kaha thi tu badi aayi samajh ko samjhane wali. Islam aatankwad ko is desh se ukhad fekne ka time aagya", "sarveshgupta62": "Httt bc", "thisandthat001": "Amazing and so inspiring woman🌸✨ more power to you and to the people who are protesting for good!!⭐️", "cutekamina018": ". student hero hai .. correct hai .. but wo wrong direction m ja rahe hai ... Or Tu anpad hai .. @reallyswara", "lucky_dixit07": "Frk tere vibrator se pd rha h🤣🤣", "pulkit_chaurasiya18": "Ha bs JNU aur Jamia ke students hi students hai.. Baki sab to.. 😠😠", "airaaaaaaa____": "You’re a fool", "caughtinamiracle": "Mann karta tumhare kaan mai pehene hue gool lambe earrings kheechkar tumhe aage peeche hilaoun 😂", "jaswal.aditi": "Students who are future are not studying rather wasting their precious time protesting and catering to stupid assumptions of what will happen. Please stop provoking them and let them study and having their own thought process. Shame", "u_mehul_k": "Wakingupization", "sameerapervaiz": "I am in love with this girl, others in her field should learn something from her.", "ptl_dhruv_": "Fir tumhare paas 10th marksheet kyu nai he ??", "strayed_warrior_": "कान में से साइकिल का चक्का निकाल लो मैडम", "banjaara_anmol": "Haaa tu us samaj s bhaar h na....jb itni dikkt thi bjp se to kyu itne votes de diye...thik hai ye politics chutiya hai besak koi b party ho but tum logo ne to desh ki asi taisi hi krdi", "june_moon98": "Students hero hai but not the ones who are currently studying in JNU AMU JMIU🤣", "abhishek_8axena": "Abe konse students ko jinda jala rahe the, randi ki aulaad, sharam kr thodi si thi hai to sharam kr, yr kya bol rahi hai ye, ye kaisi hai ye yr😑😠", "aditya_ard007": "Maratha morcha ni dekha aapne 😂", "nayeemshaik04": "bahut khoob farmaya aapne 🎉🎉🎉🎉🎉", "jay.das.3785": "I support nrc and cab", "bhavik7919": "Apni ma chuda bhosdiwali", "raghuveerdattu": "Acha and the soldiers who are protecting our country at the border are zeros aa, how much money did you get from congress to support this protest. And one more thing you really act well in real life also.", "ajayreddy_7215": "Why don’t you focus on your sinking acting career than supporting these ANTINATIONALS and your good at only one and that is fingering onscreen", "deeprajgajjar": "Shes faking it !!!!", "vilen_4_you": "Anpad Khi ki 😂🤣😂yeh btayegey Kya Shi hai 😂 🤣", "real_sam21": "🖕", "sanjaygaur14": "I'm student and I oppose you and support CAA", "md.samiullah99775": "Aap ko dil se salam 👍👍", "manish_sharma0010": "Jab Kasmhir Me hinduo k sath Vo Sab Hua tha tab kisi ko farak ni pda thA ????", "77young_star": "I oppose u like funy bitches", "kaushikhanu": "🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊🖕🔔👊", "ajayjasoos": "Darkest in the life of all CORRUPT, MORAL LESS people like YOU! It’s been a great year. And cheers to another couple of decades of BJP rule. Now go choke on this 😂", "mukesh7025": "Saari facility sarkar se chahiye aur sarkar ko gaali dete h aur tere jaise log unko importance dete h", "trushang1147": "Sabse bekar aur nihayati gatiya aurat", "chiragjain470": "Tum too sirf yahi karoo or jb baat Sikhoo ki aati h nankana saheb ki ghtna ki baat ki jaati h too juban band krke rehti h or too or in baatoo ko ignor kr deti hoo .....or kbtk niche girogii kuch too boloo ab Pakistan k nankana saheb pe kuch too boloo", "rakeshsingh9392": "Haat be randi.. Jaa jaake marwa muslim s wahi suit krega treko...", "luv2freakout": "😂", "vivek_gusai": "Fame seeker 🤣 bc tereko kaam nahi mil raha to kya aise sadko pe aake footage khayegi", "rohan_parashar_": "आप जैसे लोग अगर caa का विरोध करेंगे मुझे इसकी उम्मीद नही थी । और आपने क्या बोला कि में हिन्दू होकर भारत मे डरती हु तोह पाकिस्तान चले जाओ। मोदी जी ने इतने कार्य किये जो कोई नही कर सकता था। caa का मतलब हिन्दू अल्पसंख्यक को नागरिकता देना है ना कि उनसे लेना । लेकिन आप जैसे लोगो को फिल्में तोह मिलती नही है न एक्टिंग में कोई दम है चर्चाओ में रहने के लिए ऐसे बयान देते है । 🤣 आज के बाद में आपकी कोई फ़िल्म नही देखूंगा में आपकी हर फिल्म का विरोध करुगा 🙏🙏", "sudhirdk1134": "आंदोलन करो पर शांती से भी कर शकते हो या नाही?", "i_m_aagu": "Hum bhi toh students hai, Hume koi dikkat nahi hai NRC se. 👀", "_ameyaupasani_": "You r such dumb person...", "live.for.environment": "Dumbo will take everyone down with her. Lage raho.", "abhishek_hippargi": "Fuck you...... No finger yourself🤣", "itsme_love4u": "Sister of Priyanka Gandhi", "sukshitashetty": "R u mad really as your name suggests. Please open your eyes. Forsee things. India would be much better with this step 10 years from now.", "anantmannolkar": "Bollywood Actress?? 😂😂", "_anurastic__": "Students filhaal tiktok Bana Rhee hai student filhaal enjoy kar rhe student filhaal police se dande khaa Rhee😅 Awara bhaskar Ko bhi maarnaa chiyee dandee", "hnasim0": "Thanks for standing for students", "sangani_tej97": "Abe bhaichod🤣", "pushpendrasinghsurera": "Do you want to come in politics if then see the results of congress due to this kind of politics", "_f_u_e_h_r_e_r_": "Good one pakistan jindabad supporter . U also go pakistan with this type of students.", "navanshupachori": "Kuch b bolti hai pagli... Phle fursat mai nikl...🖕", "utkarsh.sachan.2001": "Are madarchod pata kuch nahi hai Bus har jgha ma chudani hai", "chaudhary.alpna0001": "then wat about right n wrong u fool @reallyswara", "panku0007": "gaddar", "you.know.nothing____": "❤️❤️❤️❤️", "kshivam951": "Miss Chutiya @reallyswara ,you don't even know what CAA really is, don't misguide peoples and don't creat havoc conditions for you political benefits", "maheandrakhatu": "Tere students ne jala diya pura india samjhi jab bache bigad jate h na toh baap mar maar ke sudhar deta h jaisa abhi hua he h", "gurjeet_singh800": "🐖🐖🐖", "me.4150": "Thank u so much for strengthening &supporting Indian secularistic democracy ❤️", "n.p.n.p_": "@reallyswara kaam dhandha kar, taki PR Agencys ko tu afford kar paye or yunh road pe katora leke free ki footage ke liye khada naa rahena pade. 🔥🔥🔥🔥🔥😉😉😉😉😁😁🤣🤣😂😂😂😂😂", "nad_1028": "❤❤❤❤❤❤❤", "rakratod12": "Mam to itne bolne wale apa jo india wale nahi he unke liye apki ghar me jaga dedo bas & apa caa nrc against strike kar he india me ho rahe rape ke bare me kyu nahi.", "beingravithakur": "But the thing is CAA is not against Indians. Then whose language u speaking.", "hena_gems": "Proud of u", "akhileshdhiman": "Abey chup jb kuch pta nhi aa jate hai fame pane", "lalitshakyadody": "movie nahi mil rahi madam ko to politics thoda haath aajma rahi ho hai na mam", "rajlavi": "Write \"COMRADE\" instead of 'BollywoodActress'", "dr_akrati": "Ye Pakistan ki koi undercover agent toh Nahi h 😂", "sarcasmsaviour": "Inke hisab se sirf Jamia aur AMU ke students hi Sabse tezz hai ....swara ji thoda to dimag daaliye agar bacha hai toh.", "janhavirajput": "Amazing 👏👏 please remove your brains from your asses and put them in your head, it will work properly!", "snaya_thakur": "Ye aisa samaj h jhn tum jaisi ladki paise k liye nangi bhi hoti h tum wahi samaj ka kachara ho", "vaishhh.__": "@reallyswara and also secular word was never the part of our country and constitution it was added by Indira Gandhi when she imposed emergency soo this amendment itself is a unconstitutional", "mr.qais_khan": "Madarchod 🖕", "shoaib2012ansari": "And the Best Human Bieng Award Goes to Swara Bhaskar👌👌👌", "_times_of_india": "Getting rock mam❤️🔥", "digital__pandit": "Tumhe sirf musalmaan ki lynching kyu dikhti hain.  Hindu ki bhi toh lynching hoti hain, uske baare main kyu nhi bolte ho?", "yash_scorpio": "@reallyswara padhli likhi unpad", "thakkarhardik_ravi": "Hadd he ese chutiye apne desh me rehte he", "abhimanyu4097": "Yaha pe sab log apni apni soch rahe h ... Ab in maidam ko dekh ligiye 😂 (so called librel ) jab inko koi dhang ki movie nahi mil rahi h to soch rahi h real life me hi kuch acting kr liya Jaye 😂😂 kuch log inko dekh lenge TV pe isi bahane . Aur maidam ji itno dino se kisi movie me nahi dikhi ab pta Chala ap to so rahi thi n 😂😂.Kya maidam pichli bar apko veere thi wedding me masterbation krte huye dekha tha lagta h tabhi se ye maidam so hi rahi h.😂😂 Are koi movie do bhai . Ye jage aur Khali baith me jmi ke ladko ko free ka Yan na bate 😂😂😂 by the way apne Kya khub badia se masterbation Kiya tha😂😂😂", "ayush_life": "I support CAA-NRC-NPR to control India border security and illegal immigrants and to realize a fact to built atleast one Home country for global minority that are Hindu. Jai Modi 🇮🇳", "azhar___akram": "❤️❤️❤️", "think56789": "Love u swara...", "iam_mediocre": "acting kro tum", "yuvraaj__07": "Paiso k liye bikne wle log desh k bare me soch rahe hai😂😂 paiso k liye isne movie me vibrator chala liya tha😂😂 shyd paiso k liye hi protest kr rahi hai. Ghatiya soch wli aurat", "__dracula__0_0": "Lmao noob", "namo300namo": "I hate you👍", "click2photo": "Support #nrc #caa #npr love #india", "a__galaxy_": "Reallyswara u are fake person", "bhargavpramod": "Students who are spending 10 years to complete the graduation and who are burning the national property", "themirwajahathali": "❤️❤️❤️❤️", "akash4u1234": "CAA ke agaisnt jayegi na to chopat ho jayega tera career bta raha hu news mai aane ke liye kuch bhi mt bola kr 😐", "shashank_sam24": "Gaand pe danade maarne chahie iske", "bhushanrinku": "👏", "swapnil_singh697": "Didi ek bar act padh lo publicity k liye kitna girogi or University k students itne unpad hote h ye abhi pata chl Raha h or job chahiye inko", "ffvjtfchj": "Thank for giving me reason to unfollow u", "salma.9112": "👍", "amitghotekar100": "Film to aapki chali nahi he", "khan_usama69": "Love from Pakistan💜💜👌👌", "i_am_amankhan_": "Sucha role model.", "jaindharm": "Neta ho ya abhineta sab ko 25 cr muslim logo ki padi hai hindu jaye bhad me kyuki hindu chup hai sant hai desh me tod fod danga nhi karta ish liye hindu ki values nhi", "skmsonya": "Jana khadi reh strike krnewalo le aage, rok ke dikha peace se, phat ke hath me ayegi", "sharma.chitwan83": "U r great personality Good human being person @reallyswara", "sugarplum_giggle": "Stop spreading hatred..... Know the meaning thoroughly", "ujjwal.21prasad": "Students are really our hero but you are a piece of shit......", "nadeem_khan347": "#Respect 🙏🙏🙌🙌", "imshubhmangrule": "Nikal tu paheli fursat me nikal India se bc....teri aukat nahi hai India me rahene ki", "alokmisra_": "कुछ मुठ्ठी भर लोग है पगली,सम्हल जाओ,धंधे पर वापस आओ जवानी का Grace period चल रहा है,नही तो बुढ़ापा वृद्धा आश्रम में बीतेगा।🙏🙏", "inu0022": "As a Samaj humein aaapke muh pe 4 thappad din k 4 Baar agle 40 Saal tk Roz lagane chahiye........bewakoof", "aurangzeb_khan1993": "❤️I love u mam for ur protest against NRC", "shipu_ashwin": "Chal jhooti😂", "azimulayaz": "❤️❤️❤️", "chandan_dali_": "Students bus nahi jalate, students pathar nahi marate tum jaise log students ko samne rakhke dange Kar rage ho #communistparty", "saifnadeem4": "You are really an inspiration for all of us thnks for showing the solidarity and coming to jamia to support us its time for change and we will make it together.", "zaker.mirza.9": "Dear sister swara you really rocks..", "asli_nam": "you are such a superheroine!! much love and support for your protestp👍👍 💓💓", "ranivishwakarma": "Behan Konsa sasta nasha karti Ho 😂😂😂😂", "renukarenuroy": "Yahi students public bus me aag bhi laga rahe hai...... Jisko dhek ka aap jaag uthi hai....... 👏 main aapko bht pasand karti thi but ab Nhi..........", "vinitgupta26_": "Amount of xxxxxxx is credited to your account xxxxxxxxxxxx for successfully carrying out such Operations .. Above Amount transferred is combine contribution of Al qaueda, ISIS ,Taliban,ISI,Hijbul Mujaheddin and many more..For Spreading hate speech.. supporting government opposed activities..And declaring Hindus as terrorist..Slow claps for you Terrorist Bhaskar...", "meenak67": "Nikal", "yashikakaushik": "Aw you idiot", "hritik123a": "Actually #swara is xpert in using her finger than her brain.....she thinks finger can do wonders with everything...but here its brain which shoul matter....spilling trash from her mouth as always to get into media #swaraharlot", "amin_r_islam_27": "Well said ‼️", "ahmed_habibi43": "👌💪👍❤️🇮🇳💪", "fucker_boi_jhonny": "We support NRC AND CAA", "kk475678": "@reallyswara .. Student bolke bachcho danga krwa rhe ho c muvie m kaam nhi mil or idar rool ply kr rhi h", "reachkgs": "Those on streets are not students. Students study innovate and take care of their families who have invested so much in their lives", "dinesh.duggal.50": "Completely agree with you ! Swara !", "iqubal.jawed": "Great swara bhashker. Ekta ki Mishal ✅✔️👈❤️", "rahilaparker": "You speak so well. Specially your Urdu dilacte is perfect. Keep up the good work. ❤️", "bharat_razzz": "@reallyswara \"You can pretend you're perfect all you want. Just remember some of us know the truth behind all your bullshit lies.\"", "moonwalker219": "Shut up you b****", "ady345": "#indiadoesnotsupportcaa", "karannn_rajput": "yes kashmiri hindus were burn alive I know lets support CAB CAA NRC we support 🇮🇳 we support CAB", "__mr____manhas": "Ja na aunty ,politics me ana hai to direct aaja kya roj ka natak lagaya hai", "agsilverline": "🤮🤮🤮🤮 S🤮ara", "ballubodalawala": "@reallyswara respect madam u doing great work 👌", "cydv77": "🤣🤣🤣🤣🤣🤣🤣🤣🤣", "sunny_the_boy_": "Tera liye Student Bus Amu aur jnu wale hi hai. Na", "indiglo": "👍👍👍👌", "ahmadsaad_7": "https://www.facebook.com/145168452982881/posts/586945228805199/?d=n", "shekhar.narasimhan": "VICE CHANCELLORS DUTY BOUND TO CURB & DEAL WITH IRON HAND ANTI-NATIONAL ACTIVITY IN UNIVERSITY PREMISES. ENTRY OF POLITICIANS IN TO UNIVERSITY MUST BE BARRED AS THEY POISON YOUNG MIND. INCOMPETENT VICE CHANCELLORS WHO CANNOT PROTECT THE INTEREST OF OUR COUNTRY MUST STEP DOWN. WHEN VC'S FAIL TO MAINTAIN LAW & ORDER WITHIN THE UNIVERSITIES & CURB ANTI-NATIONAL ACTIVITIES IT'S INEVITABLE FOR POLICE TO ENTER IN TO THE UNIVERSITIES & TAKE REMEDIAL STEPS TO ENSURE SITUATIONS DO NOT GO OUT OF HANDS.", "laxmi.gautam.165": "👏👏👏👏", "amanbhadouriya_": "Ek rat ka kitna legi", "sukhmanjit.kaur": "H", "he.sharma": "Lgta hi Aapke pass filmly nhi hi berojgar log", "sameersaurabh8409": "Sale sbko pta hai bollywood tum jaise ke kya izzt hai. Movie milta ni to chat chat ke pichhe pdte ho or contrvrsy me rhne ke liye dhong krna hai", "arshia_ali_hassan": "I have immense respect for u... u always say n stand with the right... thank you for saving India", "kaushalthakur_04": "😂😂😂😂", "kushagrasinghgautam72": "Atleast some like u r in Bollywood who have guts enough to stand against wrong....bravo girl....way to go.....", "themogulbee": "Love you!❤️", "farooqjune": "The modern day messiah. Fearless Swara!", "purplefarha": "Happy new year mam ❤️❤️❤️", "amanguru6687": "Gud job", "shekhnayyare": "Madam you are proud of all humanity 🌹", "hishamalmacho": "big fan please come to south asian university .. studied in AMU and i saw first hand police using life bullets in campus", "asif_ma_daxin": "👌", "niluroy.11": "Stop spreading hatred it's humble request🙏🙏 spare us we don't need negativity like you", "vermakantravi": "Aunty ye faltu ki netagiri band karke apne kaam dhande pe dhayan de le nhi to waha bhi bheekh maangni padegi..kaam to vaise bhi milna band ho gaya tujhe..", "pranranjanmishra": "ISS Desh ke hero Kashmir border par khade hain madam!!!!", "shoeb_2.0": "Mam UP me masjido me gharo me ghus ke muslims ko peet rahe hain police wale & gunde. People have fled their own ancestral homes. Plz do something mam plz do something 🤧😖😣😔", "king_of_heart0780": "पहले पढ़ कर आजा caa का मतलब अनपढ़ गवार कही की तुझ जैसे लोग आस्तीन के साँप हैं नागिन हैं तुम तो देश मे रहकर गद्दारो का sapoort करते हो ।तुम देश के गद्दार हो🇮🇳🙏", "niteshsingh2610": "@reallyswara Auntyji this year has been historical triple talaq 370 caa various banking regulations action against npas electrigication of villages balakot....so on and on..cheers to that", "syed1938": "Brave actress", "archna.gupta.9822": "Fuck off swara Bhaskar.... 🖕", "adv_afzal": "Swara, we have trust in this country because of people like you. God bless you and more power to you.", "gulvezmalik123": "❤️", "rathod_raj_46": "You are the real human being I love you so much", "satishsharma19": "👎👎", "g_azam_official_": "@reallyswara ❤️❤️ bohot bohot shukriya you are show real girl power dilse salute apke liye", "ahtesham_azmi": "Exactly ,Modi and Amit Shah make the darkest day of the year.", "kiara.neha": "We are proud of you @reallyswara You're the real hero not on screen but also in real life. ❤️🤗", "shandickya": "Teri chut fad ke mu se nikal jaiga lauda mera lele bhosdi ki randi chod activist ki jhant ki chamgadad @reallyswara", "asfyansari": "Lots of Respect for you ma'am❤🙏 keep going inshallah we will win❤️", "the_domrunner_": "Ab toh aur jalna h tum liberals ko....hum muslim virodhi nahi par CAB aake rahega", "abdulhusain_dohadwala": "Thank you so much @reallyswara for being so brave❤️", "maroonstain": "@reallyswara again commenting don't know if you'd read this but I challenge you to have an open debate, let's clear out. All our doubts. You tell me I'll tell u! But a request don't spread nuisance! Incomplete knowledge, is like asking soil to rain so that clouds can be used for agriculture", "iharry_choudhary": "Kuch kasmeeri pandit k liy b bolo unk sath kuch hua", "i_m_alok_mishra": "Chal jhoothi... kabhi clg ki shakal bhi dekhi h....", "hrishid78": "@reallyswara you are the hero.", "ankur.vijayvargiya": "Biggest attention seeker😄,she can even sold herself for attention", "sush_wagh": "I'm sure now in coming year you'll end up like rakhi savant.......😂😂😂😂😂😂", "ahmfashiongroup": "Asame that you ppl are indian..", "prashant.3vedi56": "CAA-NRC बिल को लेकर बिल बिलाओ मत ये तुम्हारा निजी संविधान शरीया थोड़े ही है मत जलाओ मेरे देश को ये तुम्हारे बाप का हिंदुस्तान थोड़े ही हैं ! @reallyswara #isupportcaa #isupportcab #isupportnrc tu ja teri chut me vibrator daal ke maza le", "bishtanurag": "💜💜💜💜💜💜💜 #respect @reallyswara 👏👏 🙌", "ermegha19": "You're also kaabil e taarif 🤗🤗", "sameershaikh3265": "Ek nbr", "theashiishpandey": "💖", "shakir_35": "❤️❤️❤️❤️❤️❤️u mam", "itz_suhailaslam_07": "😘😘😘😘😘😘", "nawaz_ar": "Salute @reallyswara", "im4hit": "👍👍", "namitasharan": "Swara Mam... this is the only country in world which is highly emotionally connected ... and pl don't misguide our youths ... they are intelligent and sensitive... they know how to serve the country , there motherland....🙏🇮🇳", "pagal_jokerr": "Indian supports you u maam @reallyswara 👍👍", "shahidsuleman4696": "Thank you so much", "jalebi.bae": "Thank you for speaking up when many are cowardly ✊🏼🔥", "prasang_3025": "We support CAA -NRC -NPR ...", "yaqmania": "❤️😘U are doing a wonderful and important work , keep it going, god bless", "thisis_samina": "Baki Bollywood so called stars kab jagenge.... Influencers have become opportunists where in a person like you is a true motivation. M proud. Keep going @reallyswara", "hafsanaaz5": "Keep going girl", "sambhaji_agalawe": "Aap film me to chalti nahi h. Thik h . Magar CAA se aap ko to Pakistan nahi Jana padega na. Magar jo hamari bhane vaha h. Jinpar atyachyar huye h. Please unkoto ane do. Agar ap ko pata nahi h. To char din to gujaro jakar Pakistan me. Pata chalega ki vaha kya hota h. Aur apko pata chalega ki yeha ka muslim safe h. Ya vaha ka Hindu. Constitution ne hame bolne ka freedom diya h. Iska ye matlab nahi h ki aap kuch bhi bolo. Aur media par cha jao", "secretstar_007": "Ek Hi Dil Hai Swara Kitne Baar Jeetogi😍😘😚@reallyswara", "_niya_07": "😍"}