{"bajpai_jii": "Maza a Gaya ji😂🙏", "vedant_pathak": "Proud of what police did 🙌", "soumya.dutta52": "WoW really proud of the Indian police seeing doing there duty🤗🤗", "parth___paliwal___0045": "Or asi video post karo na dekh ke sukun mila kaleje ko", "kripalsinhgohil001": "Maza aa gaya police zindabad", "indreshravriya": "Goli maro sal* ko", "vikramxsamrat": "Gand mei dando dalo bhenchod protest karenge jhaatu katve mulle #swara ki maa ka bhosda", "earn_money_with_socialmedia": "Ese hi padne chahiye inme isse bhi bure padna the", "mystical_bambi": "Bohut accha kiya 👏👏👏👏", "srinivaskashyap63": "U guys deserve this", "myuresh91": "😍👌 swara ko bhi thokA nahi ky police bhai log 😀", "dhanraj_dodia_702": "Moro Ben chodo ko", "amankchauhan98": "😂😂😂", "arunsingh380": "Dil khush hota hain esi scene dekh ker 😁😁😂😂🤣🤣", "deeraj______": "So satisfying 🙏🙏 mazza aa gya yrr. Jab kashmir me hinduyon ka genocide hua tbb Tu kha thi, jab Kishtwar me hinduyo ka genocide hua tbb Tu kha thi aur tere human rights waale. Tu apna sur name change krr le. Jabb tere se koi Tera religion puchega tabb matt bolna ki tu hindu hai, tuje hindutva ka AB nhi pta hai. Tu hindu nhi tu fuddu hai", "ronavsaxena": "Kittna paisa mila h apko?", "prash_pp_pp": "🐖🐖🐖 maja aa gaya pitai dekh kar", "devwansisunil": "I'm Love Dish", "infamous_tyrant": "Aur maro behen ke laudon ko.", "iam._.abhishek.__": "So satisfying 😍😍😍", "akash_7799__": "👍👍👍😘😘😘😘😘😘😍 😂", "_dig_yadav": "Good job police👮", "shubham.chaudhary1995": "Well done police", "sourabhotari": "Good job👍👍 Delhi police❤️", "ved_kulkarni_144": "Well done delhi police👏👏❤️", "vikasnagarphotoshoot": "@raghavjuyal you liked this video, wtf bruh", "hindian_siddhant_gupta": "Desh ke khilaf slogans dene walo ko kutte ki maut mar rahe hai.SALUTE YOU DELHI POLICE", "bilal_diwan_786": "5 Muslim ko marne 5000 aarehe...or aapne aapko mard sabit karte he...kutte salle", "nitintiwari7515": "👏👏👏👏", "sarvmeet": "Yr aap peaceful protest toh naa bole desh ka nuksan hua h aap protest kre hum b sth denge. It’s pretty obvious protest m koi na koi hota h protest kharab krne ko . Aur protest krne wale ka mind set srf ek chiz pe hota h lekin raste different hote kuch ka hota h hindu Muslim ko maar do yeah hindu Muslim sth de. @reallyswara . So please peacefully protest na bole", "varsharomina": "Swara is third grade lady in our country .. third grade", "kaustubh_bhatt__2103": "Ye student nahi. NAJAYAZ HARAMZADE hain", "chouhan.kuldeep01": "Bhot shandaar 👌👌", "all.aboutindianvogue": "Peaceful protestors , what a joke 👏👏👏👏 , swara u deserve a tight slap", "himanshu_g_u_p_t_a": "Tumhare baap 😍👌😍🔥", "_mayurafitness": "So what u were doing while protestors beating police", "rahulrai_9": "😂😂😂😂🔥🔥😂😂😂😂😂😂😂😂MASS😂😂🔥🔥🔥", "gurneetsinghoberoi": "Show what they have done to police and Hindus you stupid cunt", "anchalmishra150": "Please also post video of protesters pelting stones on police!.", "maazkhan091": "Kuch log pta nhi kun jal rhe h", "_subham02_": "What a joke peaceful protester 🤣🤣🤣", "siddy_paul": "Mahatma Gandhi also sent Indians to WWII to fight for British 🤔 aur raste block kyu karega baat baat pe ??", "preyassahu": "😍😍", "prasang_tripathi": "Peaceful 😂", "navinkumargupta11": "Thoko Thoko aur Thoko Salo ko 😂😂😂😂😂", "arunh2405": "🤣🤣", "vijayfartyal007": "welldone...delhi police", "abhineet1747": "Excellent work🔥", "poojapawer1": "😂😂ek bhi comment post ke traf nhi he 😂😂😂🤣", "rahulthakur0495": "Bda sukooon mil rha 😍😍😍😍", "prakashsingh199521": "Bat rhi h aajadi le lo le lo bhai jan", "rohanajmera12": "When a policeman is beaten up,govt property is destroyed and vehicles are burned then that isn't horrifying for you?", "_royalsharma_": "Well done👌", "neeraj.raj.923519": "👍👍👍👍", "_khushimahajan_": "And i guess u have not seen the videos of they throwing stone on police.", "sekhalam910": "Abe madarchod andh bhakto tum logo ko pata nahi ye kis wajha se pardasan karraahe hai is kanoon ke bare me pata hota to Tum log bhi inke jagha hote Ye log desh ko bachane ke liye desh ka sawidhan bacha ne ke liye lathi kha rahe hai do gujrat ke namune desh ko tod na chahata hai aur Tum sale andh bhakt maze le rahe ho le Lo jab Tum logo ko ghar se nikal ke sab kuch chin lega jab tumhari ankhe khulegi", "bhavinbkd2019": "whhh police whhh maro salo mullo ko", "baaaaaaaaaanu": "😂", "njo9999": "GOOD JOB...LEARN TO RESPECT THE COUNTRY & CONSTITUTION OR GET READY TO BE RIPPED....CLASSLESS WOMEN LIKE SWARA BHASKAR YOU ALSO DESERVE SAME TREATMENT...CHAL NIKAL 🤬", "_krishna_chauhan_": "You get what you deserve😂😂😂😂👌👌👌", "sameerjadhav2929": "Nice tritment", "niharika000002": "Dekb ke gaddaro koo km dande pade orr maroo salooo koo🖕", "vishal.sharma._": "Nice thukai...🤣🤣😂😂👍👍👍", "naman_raghav_singh": "दिल्ली पुलिस लट्ठ बजाओ हम तुम्हारें साथ हैं।।", "devanshurana333": "😂😂😂😂😂🤣🤣🤣", "baneshdangwal": "Wow delhi police...... Strong nd determined support for CAA nd NRC...... Rok k dikha tu", "n_e_o__0_6_30": "Up m Jo innn logon n policewalo k sath kia , vo tuje kya dikhega andhi auratt.Tbb Kahan thee ese deshpremi 🤬🤬", "lokeshpant": "Bhag bsdki ... inse pehle ek danda tere padna chahiye. Sirf ek, wo bhi chutad pe...jitna uchal rahi hai na sab do sec main theek ho jayega...blind is not a word for u.. u r simply sick..pathetic and hopeless.", "the.splendid.life": "OMG! @reallyswara You are that kind of person jo yeh nhi dekhta, ki law tutt raha h, pr yh dekhta h ki saza mill rahi h. SHAME ON YOU @reallyswara AAPKE JSE LOGO KI VJH SE HI RAPISTS, TERRORISTS AUR BAKI CRIMINALS BACH JATE H. Kyuki aapko dukh feel hota h jb unko police kuch khti h to, aur agar nhi khti to bhi police buri 👏👏👏👏", "tanyamehra_00": "When these protesters were hitting police by rocks, glasses ,were you sleeping then?....police started taking these actions after they were brutally beaten up...many of the officers were admitted in ICU...tab aap so rhi thi kya...aur jaise hi neend khuli tab PUBLICITY ke liye aapne ek msg daal diya", "tausif5521": "Marna ja hie tha ultha madrcod log ko", "arshadahmadkhan046": "😢", "devan_devadathan.18": "😂", "r_foreverindia": "Achi maja ayi @ dino james", "suryasingh_44": "Jai ho modi ji ki 🔥🔥", "_imshrishti_": "This video you are sharing on this platform. If you have gurds once share the video of 19th jan 1990 nd 23rd March 2003 of Kashmir then you will realise how small is this. Ghar par ek banner ke saath photo click karvane se kuch nahi hoga Zara road par aao or police ki laathi khao apne useless protest ke liye. Khreed liya hai kya Congress valo ne tumhe ko unka mouth piece ban kar ghoom rahi ho . Fame paane ke liye ye sab mat karo", "sauravchauhan74": "अरे बहन के लोडो में गोली मारो सालो में।😂😂", "shrimantroll": "Lato ke bhoot...", "sivaprasad.kundanam": "I think you feel happy because they didn't used guns 👍", "arymann_luthra": "Kash @reallyswara ki choot me bhi ek danda pdhta 🙁🙁🙁", "m_confused": "Good jod delhi police agli baar gaand ka flower banana", "cbbuuu": "Most satisfying video @delhipoliceofficial great job 😙💪👍", "parakhvyas_": "That’s really good 😍delhi police good job , nice video bahenji", "hershey_g_": "Never know the whole story and still say \"oMg iNdia iS nO demoCracy\" \"oMg sHamE oN pOlice\" \"oMg I aM a dUmb bItcH wiTh a peA sIzed bRain who can't fucking look at all sides of a story and all perspectives but would rather stick with my bias to satisfy it and therefore am a hypocrite\" Keep beating these dogs you're doing a good job cops 🇮🇳", "akarshpanickar": "@reallyswara 😂😂😂😂😂", "being__czar": "Madam please leave India ..... Meh toh karonga duniya hii chood dijaye...upkar Hoga is desh par....", "karan.ahir_": "😂", "prashant_tyagi01": "Azadi milte hue suar k bacho k", "_official_9i6hu": "😂😂Le lo Bhai Aajadi😂😂.......Bhag Q re ho🤭🤭", "priyankshharma": "So what's about kashmiri pandits they throne out of there homes,the woman's are raped and killed.our forefathers are throne out of there motherland from pakistan in 1947...You are the updated version of rakhi sawant.tu bs free ki publicity chahti hai", "amolpatil30": "College padhne jate hai ya protest karne 🤔", "jeet_m77": "Perfect 😂😂😂😂", "krunal_knj": "Why have u kept videos of only police beating public there might be some fault of the protestor that u have never showed. Spreading only one sided story.. this is wrong u should have kept videos where people doing nothing and police beating to protestor there u will be right otherwise u r wrong and always will be wrong", "anuragsinghcricketer": "Kass asa pitayi police hmesha kree.. Khash krke jnu bale ko", "vikrant.sen.102": "🔥", "j_a_a_n_098": "Danga karoge to oscar milega kya 👏👏 or marna chahiye", "ashutosh_rao_5": "Bkl Ahmedabad mai b aasa hua tha police k sath aase he mara tha 4 police valo dukan k shutter k pass block krke", "akshayingole19": "@reallyswara You carrier Is already over! Nothing left! The only thing left is tamasha not in the movie but on the Roads! #Randi", "deshmukhmanali.md": "Really @reallyswara you are speaking abt this violence??? Just go to Saudi and other nations.. even USA . Any act against state is not taken charged by lathis they use guns. Secondly nothing is being cooked against any community. Have you ever read whole NRC CAA bill?? Its just that we want to take back people who belong to our land.. who belong to the religion which took birth in this land.. have you seen the condition of minorities in Vietnam, Pakistan etc. Girls are being raped, abducted people are being forcefully converted. Whats the problem in opening doors to them?? This nation has been a rescue place for parsis, jews and also muslims and christians though their leaders invaded us. Then y not for ppl of community which took birth here in this land. Where a Hindu would go for rescue if not in India? Pakistan?? Saudi?? America?? Japan??.", "chhagukumawat": "Good work by Dehli police", "itshem_y": "Aur maro BC ko.. news se pahle tereko video mil jati hai.. gan* marwale inhi salo .. maybe tu marwa chuki hogi,.... haak thu. Hai tujh par ra*** ... shame on you b.b", "ali_afzl07": "Still sad........ 😶😶", "bora3.14": "This is totally crazy. Police should not beat people like this for doing a protest ( we don't see them with any arms or weapon)", "ajaycharan99": "2 -4 tere orr pdne haiye the", "sanjayprajapati2310": "Ese achha goli mar ni ti atnkio ko 🌷", "maheshsodnar": "😂😂", "vishnunagarchandrawala": "Good", "shailesh_singh_g": "Aur kuto @reallyswara waha prasaad khaane gye the ye log dtc bus to syad tune jaalayi thi", "wasifer786": "Kutte hai ye police", "shivamdubeyroxtar": "Gajjab kutayi waah nahi nahi waaah..... Maro salo ko.... Well done police.....🔥🔥🔥🔥🔥 respect to the police", "pi_r_square_": "Sahi hua", "vikas28955": "Thoda a66e se marna chahiye tha", "abhinavpandit_yoddha": "😂", "rumana_mirxa": "each protester must also carry a laathi with him. When police can use laathi to stop the youth, the youth can also use laathi to perform his right.", "stardom.guru": "😂🔥😂🔥😂🔥😂🔥", "aman_singh_sengar": "Sara protest gand me daal diya waahhh😂😂😂😂😂 great work. Tod fod kre ab khud tut fut rahe to fatt rahi hai sbki 🔥🔥🔥", "imshorttemperdpandit": "Accha to peeta h aur kya chahiye dalo or drama karo", "chuslim687": "Public Property Damage karna kya peaceful Protest hai", "mein_kafir": "Delhi police 🔥🔥 @delhipoliceofficial 👌👌", "thakurjitendra034": "Achhi mja aayi", "vikram1030": "Bhai log etna dhire kon marta h ..... ?", "shailendrapal746": "Good work😂😂", "azad_gupta01": "Sahi kiya im support of up police yogi zindbad", "kundanpradhan1220": "💚💚💚💚💚", "manu3193": "Oho peaceful 🤣 aur lagane chahiye the! Ye peaceful hain toh main bhi Islamist terrorist houn! (ISIS) 😂😂 allahu akbar, 5..4..3..2..1.. Kaboom!", "vishalthebuddy": "Apne gande muh se inqalaab shabd na nikalo @reallyswara .......sobha nhi deta", "snifferseek": "Abbe dheere q maar rahe ho be jor se maaro khana wana khaya kro", "r_i_ti_k_": "@reallyswara fuckoff jo suar protest ke naam pr ptraav kr rhe hai aur danga kr rhe hai unki video kya hajar post daal skti hai tu aur jan army ke javan shaheed honge to na kabhi R.I.P cmmnt krna na koi post aur jab inhke dangai sdk pr police pr pathraw bina wjh kr rje aur police ke lakh smjhane ke baad bhi danga kr rhe to action me thoda a gai tujhe mirchi lggai police wale kitne ghayal hue tujhe nhi pta hoga aur unme se bhut se hospital ke ICU me the tum log desh ke हित me nhi bol kr skti ho to dusro ko bhadakane ka kaam mt kra kr shrm kr dub maro Sirf ek religion ko support krna bnd kr shanti chiye hme kuch desh hit me kro to accha lgega acche ka kabhi support nhi kra to bure kaamo ko kyo support krti ho tum log", "rajput.shivrajsingh07": "👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌👌💖💖💖💖💖💖❤️❤️❤️❤️😍😍😍देल्ही पुलिस", "deepak_motwani1216": "Should be shared with UN and World News..bahar ke indians ..ko kuch air dikh raha hai", "rishi0291": "Yaha inqalaab ke nare nahi .. qabar khodne ke naare lagate hai ye", "vivek_sharma26052000": "Accha ji mai aur meri family delhi me apne relative k ghr gye the raste me ghr aate time hmari car pe hamla kiya tha ....To hm ne kya bigara tha bus jla rhe hai public transport ko nuksaan kr rhe hai ....Ku ??", "rohanbarbade": "Hahahahaha maaro aur madarchodo ko😂😂😂", "pinku_routray": "Tere Gand pe v lath padni chahiye", "ketan_soni916": "🤣🤣🤣🤣🤣", "srt_mayuriii007": "This is wrong... but when public pelted stones on soldiers why you guys never said anything", "ravijangidlife": "दिल्ली पुलिस की अच्छी प्रक्टिस हो रही है।", "shadu_dj": "😢", "rajiv_kawad": "Isko bhi dande padne Chaiye the Bach gayi 😏", "_kunaaall": "Ye bus jalayenge toh police dande chalaegi hi na?  Akal ke aane ke liye shakal ke bighadne ka kyon intezaar kar rahe the tum", "netrisethi": "mja aa gya bhencho", "rahul_nitturkar": "Very good", "king210289": "Ek danda teri gand me dal dena chahiye bc", "ankitpathak1996": "Bahut badiya , maroooo", "zubairpasha768": "😢😢😢😢", "awaddamad_one8": "rss ke gunde hai sab", "editsbyaarav": "If you really have guts then post those video too.....when people throwing mob and stone on the police......burning the trains buses........yhii dikkt hai tm logo ki sala famous hone ke liye kuch bhi krte hai......i really respect you as an actor but ye bahut galat h........see both side of the story bas police rss modi bjp mt kro ye bhi to dekho ki logo ne kiya kya kya.........and if you're Indian to gov. Ke paas iske proof honge......... please toda sa common sense use kro or jaao kuchh productive kro ye ghatiya ghatiya funde mt apnaao famous hone ke liye", "panwar_aakash": "😂😂😂 jesi karni vesi bharni.. these puppets are protesting for no reason and these people are not peaceful protestors, u go and see the reality thn u will get to know @reallyswara", "akshimorris3": "@bbcnews @bbcearth @bbcbritain", "pawan.mpharmacy2017": "Salute to Delhi Police", "mudassir____sk": "Or sun fate condam ki paidaaish 😂 tu paida hi galat land se hua to ek bap ka nahi h re laude 😂 harami he to re Bana 1 no wala", "chitrankagrawal1": "Up ki vedio delhi ki bta ri hai gawar😀👌", "abhishek_8axena": "Violence karogye to pitogey", "deshbhakthindian": "Arree yaar maja aa gaya dekh ke..♥️😂pata kuch nahi hota aajate hai...ganda marwane😂", "__mr.rude__": "Students ke protest ke naam pr kya kya jalaya vo bhee dikhao... Btw police ne kam mara hi saalo ko... Desh ko jalane wale ke haath pair tod dene chaiye..", "pkpalpkpal": "😀😀😀😀😀😀😀😀 good", "dharmendra93ds": "Isko kehte hai aazadi sabko milegi aazadi jao lelo aazadi😂", "ankitchauhan_up81": "Abe bhosdki jab ye protest krne wale police pr attack krte h tab kya maa chudati h tu ,agar nhi h video to m send kru", "instarohith": "Satisfied", "umesh.daksh": "Protest karna hai to peacefully take permission and do protest on open grounds...where other people (non-protesters) are not affected", "indienari": "😡😡😡😡😡😡😡", "aayangaur1": "Baje salo pr", "im_viveksingh_": "Acha hua aur maaro", "bhagirathsinh_dodiya.9": "Aur maaro😂😂", "i_m_aagu": "Aur Chahea tha! Laato ke bhoot bato se nahi mante.", "sunny_solanki1316": "तुम लोगो की घटिया पॉलिटिक्स की वजह से बेचारे अनजान मुस्लिम्स जो Caa. aur Nrc. ..के बारे में जानते भी नही उनके पिछवाड़े पे डंडे पड़ रहे है... तू बहुत ही घटिया है रे रोहिंग्या की पैदाइश", "mishraroshan334": "Just shut your shitty mouth and get lost.. Bloody asshole #swara.", "him_singh_": "aur police pite to uska ka", "mukesh7025": "Ye log yahaa aaye kyo h Vo to puch le inse pahle aur kitna nuksaan pahuchaya h public property ko vo bhi Dekh le", "puneet_p6": "Wow", "dhruv_ruhela": "Aur maaro bc ko", "heartkiller199999999": "Delhi police good job Maro salo ko", "sheikh_azeem786": "Bahraich shaher ki video h ye", "_rakesh_8191": "Bahut acha hua or maarne chiye ye antakbadi h .", "kkk_keval": "@reallyswara hahahhahaha", "vivekverma7399": "Umang me tum bollywood wale hi aake dhindora peetate ho na we salute u police ...or yaahan jo police sahi kar rhi hai ..whaan pe galt lag rha tujhe", "suryakanta_nayak": "@delhipolice_official you have done a grt work for this nation. I salute u fr ur work.", "nishantniks": "Is chutiya ko na hi CAA pata hai na hi NRC or na hi NPR... Pehle padho fir bolo... Such a idiot u r... Tu bs bekar movie hi kr... Talent to sannata hai", "sumit100n": "😂😂🤣🤣🤣🤣🤣 @reallyswara This kind of guys is not peaceful , why u don't showing the other face of this crowd???? shame on you", "panku0007": "👍👍👍 vry gud job delhi police", "mastpandit4u": "🖕🖕🖕🖕🐖🐖🐖🐖🐖🐖", "i_anil_rawat": "Mam apko I think jyada pta hy ye unarmed hy apko bi iss desh mai rhane ka koi hakh nui hy", "sudhirdk1134": "👏👏👏😂😂✔️✔️✔️", "kumar.g.o.u.r.a.b": "@reallyswara ...Who the hell r u!!🤣 guruji ne ek Video Main bola h Dekh lena! U will get ur answer.. apke jaiso k lea desh main atakwadi hamla karte h😑😑😑", "instakusan": "Well done @delhipoliceofficial", "jyprkaashsaahuu": "80 पुलिस wola को गोली मरा है लखनऊ wole मुस्लिम लोग", "me.4150": "It’s really brutal 😢", "vivekjais1210": "Julmi julm karege satta ke hathiyaro SE hm jo desh virodh naro hm daman kari niti ko nhi padnmpne dege wo ganadaro ko jai hind jai Bhart💪", "psyfiangels": "Great job by the Delhi police👏", "a.kshanshjaiswal": "Do them worse that’s what they deserve", "vikki_mandloi_": "Aap bhi jao aazadi leene aapko bhi milega dilli police ka prasad 🖕", "lost_world_mg": "Goli maarni chahiye thi laathyio se kuch ni hona in chutiyo ka 😂😂😂", "sanzay_bisht__9": "😂😂😂", "nocaanonprnonrc": "Haram khor police wale aise karke kya janwar ko mar raha hain", "khan_irfan_9093": "Thanks swara uploadind this vedios💪", "nageshrachoti": "Bahut kam pita haiii .... nanga karke pitna chahiye tha", "bhargav_mehta_20_05": "Memdum ye bhi to dekho Na Pehle public NE puatar Mara to vo appko dikhie Mahi diya", "daud_khan_designer": "Ye mardchod h", "khanruhail2013": "This happens in Kashmir from last thirty years", "anirudhmehla": "News me aane k liye ise better nahi mila kuch😂😂", "ashamed_shaik": "Delhi police 🤬", "its.dishu": "This is a bahraich city seen 🏑", "mr._vk_gupta": "Bhut sahi kiya or maro salo ko kisi garib ki bus auto jaloge to yahi hoga I support DELHI POLICE", "devensharma7rcr": "I support Delhi police tumy BHI khane chaiye Delhi police k dande", "khanaalam4549": "Ye police nahi RSS ke log hai", "true_indian_25": "Most illiterate lady of all times!!!! Being at such a great platform is nothing when you don't know how to deal on such sensitive matter.....why don't you show both sides of the story!!! Shame on you @reallyswara", "salaskarabhishek": "Pls share the other side also .. as y delhi police has done it.??", "harsh_8864": "#wesupportnrc #wesupportcab", "ps.bhardwajsharma": "Teri ma ki chut maru,tere kutto ne police pe goli chalai uska vedio kyu nahi post karti .", "vikulrathi1917": "@reallyswara Pelting stones destroying public property ,is justified in your opinion", "vik_ram__": "Jab police mar ti he vohi dikhate ho. Police ko Ye salle marr te hai who kiyu nai Dikha te nikalo sallo ko", "yamraz_official": "Gaand kat-ti rehni chahiye in bhosdi walo ki", "saurav_verma16": "appreciable❤️", "rrawat28": "😂😂😂😂", "singh_sashank": "❤️❤️❤️❤️❤️❤️❤️", "mr.shubgupta": "Well done dellhi police😍😍", "shashank_sam24": "Patthar maarne dene chahie the matlab?", "raju_rizwan_khan": "Delhi Police Murdabad ❌", "gh.anshyam494": "Patthar bagi karane wale dange karane wall ka bhi video post karo", "sahadev_kal07": "Bohut acha kia", "v_e_n_o_m__paradox": "Jaan se maro sab protesters Ko ....ye Lodi Bhaskar Ko bhi", "sampath4074": "🔥", "harshu.kr": "Hme to bda mja aaya in jais ekutto ko pitta hua dekh sqara aathau", "amar.giri.1485": "Delhi Police 🙏🙏🙏🙏👍👍👍👍👍", "heso6e": "kill these muslim jehadies #coolpolice", "ms_siddiqui__": "I'm with you swara", "gaurav2651997": "बहुत अच्छा हुआ तूम इसमें रहती तो और मजा आता😆😆😆", "krishnagupta1292": "God look at the mullaz supporting this piece of shit bitch", "maharashtra_explorer": "पेल दिया 😂😂", "eashpandit": "Kisi greeb ne installment par bike khridi thi. Kisi ne car , apke pyare bhayio ne 1 mint nahi lagaya aag lagane ko unki duniya hi ujaar di. Fir bhi apko takleef ho rahi hai. Itne fake toh nahi ho sakte aap zrur paise mile honge aise bolne k", "abhisharma9191": "Sahi maar rahe", "mohitsharma0911": "@reallyswara half video dikhakar logon ko bhadkao mat madam police ne Kisi bhi peaceful protestor ko Nahi maara ye Sab pattharbaaji ke baad hua incident hai pehle tum Jaise logon ne public property destroy Kari stone pelting Kari phir jab police ne lathicharge Kari to aagaye human rights lekar bhakkkk saala", "dipudilraj": "😂😂😂😂", "helloharshitrathore": "Police doing Good Job😊❤️", "faxqix": "Before I sometimes feel proud of the army and the police here in India but now a BIG SHAME!!!!!! on them 😔", "yash_parashar1998": "Tuje bhi eshi kutai Chaye KY anti", "rohitmore5690": "Thoko Taali🤗", "0823jayant": "Chutiye bare h kuch malum hi nhi h inko 😂", "rp3732246": "Good job police", "maratha_rahul1234": "Ohh madam galat mat felav Kuch patani he is desh ke Muslim logo koi tension Lene ki jarurat nhi he madam Kuch aacha batav galat femi mat felav or danga mat karvav he log Jo Kar rahe ho public property ko lukhsan pocha rahe he...or aap ko to Kuch Hoga nhi but he garib logo ko mat fashav... Please aap mery request he", "realsachinjha": "Sahi toh hai kya galat hai in nalayako k saath yahe hona chahiye maa baap itna mehnat kar k inhe achhe seh achhe school college mai admission dilwate hai or ye log politics khel rahe hai", "nik11002": "Abe ese students ko police maregi ni to Kya aarti utaregi.....", "navdeep.kaur.23": "Swara is cunt", "ronyyy007": "#swaraaunty dekh k mjaa aa gya kya gand todi h , thnku for sharing vedio @reallyswara", "_thewildguy_": "Lovely view from top❤️❤️❤️❤️❤️❤️🇮🇳❤️❤️❤️❤️", "a_n_t_1": "Whether it's police getting stone pelted by public or public getting thrashed by police like this..its really disheartening and painful to see my country bleeding this way..😢 India is a beautiful country guys.. please stop this madness..🙏", "hello.ramesh": "अरे पागल स्वरा,अपनी सेक्सी पिक्स डालो ना यह सब क्या पोस्ट कर रही हो तुम,कुछ भी कर लो सलमान भाव नहीं देगा और ना ही इंडस्ट्री के कोई और जोल्हा माधर-जात,तो जो इंस्टाग्राम पर किया जाता है ना वही करो सेक्सी पिक्चर डालो और सूतो आराम से ।", "mkaadil": "😪😪😪😪", "kanodiarokz": "😝👌 kya bhaage h", "shonu_666": "💔", "whoatulpandey": "So great delhi police well done", "iamfaiz.ff": "To worse", "gangadhar_shejule": "Ahemadabad Mai police walo ko ye protester mar rahe hai tab pata chalega Kitna shanti se protest Kar rahe hai but Aap yahi dikha Sakti ho..kyunki apko such janana hi Nahi..Dono pahelu dekhiye phir baat kijiye @reallyswara", "alt0123": "A kind of Jallian walah bagh.. what is this? Using authority in a wrong way? 🙁🙁🙁🙁", "vikas.choudhary.39566905": "Km mara delhi police ne or thokna tha..or kitna peaceful h ye tv or nwspor ne bataya h", "shiva_makne": "Maja aa raha or maro salo ko 😂😂😂😂🤣", "wakeup_bharat": "Do you know what is the funniest thing in CAA protest.....most of the Protestors don't know anything about CAA and are doing Protest 😁 really such a stupid protestors", "rohitttsharma": "Ye dogla panti kyun ? Why r u affried to show the other side of the story? #🖕", "thisislatifsheikh": "Such haramkbor police sent by Yogi. He Is doing gundagiri there on cm's post. Abusing the power. He will be no more soon", "photogrrame": "Acha hua Pakistanio k sath", "anupamsingh267": "दुःखद, भारत मे लोकतन्त्र के लिए अब तक का सबसे नाज़ुक और दुर्भाग्यपूर्ण समय।", "hitesh_4498": "Tum chahe jitna na bhi bhadka lo yea public hai sab jante hai", "rishi_raj_3_16_said_so": "Maarao sala thik toh kr raha hoa bhut aaxha kr rha hai ar tum jyda gard mt chaamka Samjh aaya na Randi congress se paisa kha kr Madachod do desh ki", "khot7160": "Danga karoge to aisa hi hoga", "princegupta675": "Jab police walo per pathar chalaya tab kyo nhi dikhaya video", "surenderkashayap": "Jinko katta hua psnd vo pakistan ya bngla de desh jaye 🤣🤣🤣🤣", "pri.yanka_j": "@reallyswara Ye jaha tak Mera khyaal h UP Ka video hai , aur chutiyo wali harkatein karoge toh pitoge hi. Tum bhi sadkein jaam krke aur patthar fek k Dekho do chaar tumhein bhi padengey. 🤧🤧Btw , UP CM videography k basis pe sabse Todd fodd Ka paisa wasool rhe hai , sympathy dikhaane ajaana bichaaro k liye .", "mayankrajput1388": "Maro salo ko....", "hazoor_ae_ala": "A humble request! We would really like to see you in these protests! Please stand there for solidarity on road and not on Instagram!!", "jitu_mufc": "Ache se prasad Mila sbko.. Tu b lagja line me tujhe b milega ro mat... Chudail 😂😂😂", "gopalsoni8456": "आजादी भी चाहिए तो,लो ना", "equestrian.3": "Really swara?😹 ye dange karne wale log pahele jo stone plnting kr rahe hai police pe befisul ki uski bhi video daal na.. ye police hai .. they are here for our security purpose only.. apna kam kr rahe hai.. agar inke bina vajah marege to road pe to kya.. university me canteen me sabhi jagah ghus ke ese hi maregi.. ppl having common sense knew that police bina vajah ke ese publicly marti nahi nai .. unko bhi patah hai ke media aur tere jese lakho anti nationals unke sir pe chadhke bethe hai.", "bhrat_07": "Han sullo ki masiha Rand sali terrorist naxali. Muslims ki maa ka bhosda isse bhi bure tarah se maroge", "rithvik_vermaaaa": "Maza aagya😍😍😍😍love Delhi police", "tulsimalam2001": "Rehan de behn.. tujhe kya pata tu to media dikhayega wo dekhegi na students hote he wo books leke aate he bag me patthar nhi.. puri jankari ho to post karo na. tune bill padha he kya? Jankari le na .. i think you are not indian therefore you are supporting such a ghatiya things", "zaid_memon_14": "Fk police 👮‍♂️", "aliyaali9911": "@unitednations @unicef @unitednations_arabic @united_arab_emirates___", "mean_monster9": "😆", "_being_jaweria_": "Brave girl @reallyswara", "abhishek.mishra.08": "Saloon ko aur tabiyat se todna tha.. Thanks Delhi police", "sumit_malii": "Kitni baar thuki tu in logo se tbi inlogo ka support kr rhi tu", "aishnaidu": "💔", "adv_vishal_gupta": "Stonepelters weaken country strenth", "prashupointofview": "Well done delhi police 🔥 great job keep going", "abnegi_006": "Just stop @reallyswara Making fools people to say that they doing peaceful protest and police starting lathicharge . You are just a shit and you guide the people on wrong side.Shame on you as citizen of india", "j_ahnvi_r": "Achha? Free mein thrash kr rhi h jese😂😂😂", "kirak352": "Ranndddi Chup Maderchod dhande wali saaali #fuckyouslut", "bharatrakshak1947": "Or maro sale deshdrohiyo ko 👌👌👌 good job Delhi police 👮‍♀️ ❤️", "garvityagi007": "Namo namo", "abhishek_shaw5": "Delhi police ko inhe or pitana chahiye tha kuki ye students apna #students_dharam bhul gye tha good job Delhi police", "sandeepgusain7211": "Tu flim main t dekhti nhi chutiyapanti krta dekhti hai Inst main#pakistani ki Aulad", "rakeshsingh9392": "Abe randi... Aur maaregi police ka kar legi tu chutiya😠😠 sali maar rhi h ye pta h uspe itna lamba bhashan di.. Par q maar rhi h ye ni pta h tereko randi bhosari😠😠poora jankaari janne k baad bolna mc,bc..😠", "snowshark96": "My SUPPORT FOR CAA AND NRC🔥🔥", "durga.maheshwari.7982": "Why we don't need it,Mam? Have you got full knowledge of these CAA and NRC? Don't just follow your anti-BJP movement in everything that comes up", "single_stroke": "Kashmir me hamare sainik patthar kha rahe the, tab aap kaha the??", "izshaikh": "Well everyone has to answer for whatever wrong there are doing if not today then afterlife", "sohan__patra": "Video dekhne k bad maza agaya. Thanks for uploading @reallyswara 🤣", "valourand_justice": "Hahaha...bahoooot maza ayaa madam ji", "sunny_the_boy_": "😂😂 maaro ur bc🇮🇳", "jagratiaudichya": "Yh Jo log kh rh h na shame on dehli police .. Police koi pgl ni h Jo esw he mrygi logo ko ... Log inko patthro se mar rhi h .. Gadi jala rhi h or police beth k dekhti rh .. Yh swara bhaskar jese he log hote Jo desh ko batnhe ki kossi krte h ... Inko dash se koi mtlb ni h ... So plz stop blaming on Delhi police 🙌🙌🙌", "supertusker1": "Theek se nahi mar rahi hai Police.", "rohit_dance_": "well done proud of u guys", "miss_nagarkoti": "😢", "the_suryanand92": "@reallyswara are you serious...this is your knowledge....bas 15 min kay liyay police hatnay do phir dekho yahi public kya haal kar degi... Phir mat bolna police need help bolkay 🔥🔥", "i.m.kavita": "Madam, you please get your facts rights. By showing a 30s video of police trying to remove the protestors vs the protestors burning buses etc. What are you trying to instigate. Do you even realize what level you are at ? You filmmakers can bring the peace which is becoming a bottleneck for this country and but instead you are provoking . Don't use the words of Gandhi communal etc when you cannot make sense to what is proposed. People or filmmakers like you farhan akhtar anurag kasyap are such a waste. If u still want to get your facts right listen to this video and stop promoting violence rather spread the right away don't follow the wave promoted by certain political sections rather get your basics right. https://youtu.be/lVDwbovXpS8 I got damn pay my taxes & contribute to what these protestors burn, my day to day life is stuck cos of these protests and people like you are promoting baseless things, given the power to influence use it right before people realize ur true IQ level.", "badshahricky": "90 percent of them don't even know what they are protesting for.", "r___rogue__": "Why don't you show the peaceful protesters hurling stones and setting buses on fire. don't show only one side of the story pseudo secular", "chauhanritiksingh": "Swara baskar you. Have Foolish lady one side support terrorist", "sunnyyy__111": "Itna to Tera baap bhi tuje Marta tha jab tu raat ko marwa ke ati thi", "iamtirtha": "Mera bharat mahan", "kapil_yash_07": "😂😂😂CAA hoga mam", "monali_thakore": "Unarmed public as well as private property jala rahe hai behan ! Pitna to padega he ! Kudos to police 👏👏👏", "tayyabkhan5609": "This is incredible india kaha gaya sub ka saath sub ka vikaas", "rajdip4730": "Sona hai tum yeah sab post karna ki paisa lati hoo...cash lati ho na check?", "mdagar1234": "Shame on u delhi police😠", "maitr_srv": "Bilkul sahi kiya hai police ne! Peaceful protestors my ass! Public property damage karne k time pe kahan tha peace!?", "vickycoolz24": "Laato ke bhoot baaton se nahi maante....they deserve", "gamechangers79": "@reallyswara likad yaar... Ye naye India ka nirmaan hai.. Dhool to jamegi hi.. Tension na le. Law to ek tumhare jaise doglo ke liye bhi aayega. Thoda sabar kar...", "01.honey": "Ye bhi pele jaa rhe h tum bhi peli jaogi😊😊", "mayurparmar007": "To tu Pakistan chli ja wo pele mar rhe the wo video bhi dikha bc", "shreya1_8": "U post a video of Delhi police now if you have courage then post Gujarat polices' video where they were whop by so called \"peaceful protesters\"", "ishaaiam": "I never imagined that I am gonna abuse anyone ever like this...but bitch people like you creating this situation by showing half truth. Why are you not showing what these protesters were doing. How come the video is starting when they are lying on the road and not from where they were protesting and the police came and started hitting. Don't be so cheap...", "nabila.fatyma": "♥️♥️♥️♥️♥️♥️", "cam.maniac_": "@mediaonetv.in @kairalinewsonline @bbcnews @aljazeeraenglish @ndtv where is everyone..?", "ayeshatazin": "Shame on Delhi police", "tanish_sharma15": "Shaandaar nazara h😍😍😍🔥🔥🔥", "saffron__anku840": "Bilkul thik kiya Or thoko inko Chutiyo ko Sale Mulle Pathar fenkne wale Madharchod or yeh rahi swara Bhaskar Nachne wali Nachaniya Bdi Ayi tukde tukde gang ki Supporter", "the_religion_universe": "Jihadi wants to create HAVOC in India #jihadexposed #urbannaxals", "amansingh123789": "Maro bhosdiwalo ko👍", "nida__shaikh": "Kuch toh sharam kar lo 🤦🏻‍♀️ @delhipoliceofficial We all expect support for what’s right and not your harrasment,lathi charge like goons.", "lovebikes_adventure": "What shit you are uploading politics m ana h lagta h jo pathar mare police ko nai dikhe police walo ka bhi ghar hota h bache hote h maa hote ye India ki police h jo lathi mar rai h behen Singapore usa ya kahi ki hoti to shoot kar deti koi police ko nai mar sakta", "parag.da": "😔", "gillikrishnani": "Oh really or jo public properties ko jalaya hai police p pathar mare hai Uske ly Kisse shame bologe Bollywood celebraties mai knowledge ki itni kami hogi pta nai tha", "davidsagar72": "jo jo nrc ko support nahi karta wo aatankwadi hai", "abhisek_9": "protesting is ok but violating and damaging public as well as private property and pelting stones is not.", "ashokbijarnia1": "👏👏👏👏👏👏👏👏👏👏👏👏", "sachin_54321": "Shameful you are showing just one sided story. Please upload the videos where police are being hit and stones are thrown at them mercilessly. And first learn about what CAA and NRC is about then post stuff. Wish you had common sense.", "desiboy.com.au": "This is inhumane disgusting and tasteless and shows the TRUE measure and size of the corruption that is India. it is seriously not surpassing because the police in India are useless on a regular day. But they are also corrupted to the point that they behave like animals every second chance they get. Never able to do their job which is protect their citizens but only protect those who in their eyes are worthy to protect and brain washed by their surroundings and upbringing “STOP BRINGING YOUR PERSONAL OPINION INTO YOUR JOB LIFE AND HAVE SOME HUMANITY’ they are hitting these people with no intentions or if any intentions have no purpose of doing it in the first place other than to be disgustingly violent and acting like animals in their natural habitat. NON of these police should have jobs nor should they be given rights and authority on such a high scale. these every day men who call themselves protectors of society with a badge that is basically false of service and protector for communities as per usual men in Indian doing what they do best abusing their so called power and hurting innocent people just so they can get on top. They have families kids sisters brother mother fathers and yet they can’t relate to that in a moment of wild behaviour selfish beats. Only word I can think of.", "shubam__22": "Teri bi gaand ase hi maarni ha saali randi", "kar_aakash": "And what about those police officers who were injured by these protesters😤😤😤😤😤", "offical_prahlad": "namo namo", "himanshu.rai.2002": "Thik kiya h. Yahi sb jb pathal chalata tha aur danga karta tha us time to tera ek bhi post nhi aaya", "avinash9140": "😡😡😡😡😡😡", "mr_kelkar": "Chup re , har baar ek side batati hi ye.", "sl_s0ni": "आज़ादी दी जा रही है ।", "vivaan_7889": "😂😂😂😂😂", "iamaks_24": "bhaut sahi 😂😂 pelo bkl salo", "lebaschangesfashion": "Shame", "dheeraj.sharma133": "🤣🤣🤣🤣kitni berojgari hai is desh me.sb vele hain.police valo ne tashrif suja di becharo ki.🙊congress ko mudda chahie or logo ko kam🤣", "amjag06": "This is one side story... the same peaceful protesters were pelting stones at police n damaging public property. Police only uses lathis as last resort... please have ur facts clear n majority of India fully support CAA n NRC. Jai Hind #longliveModiji", "mankushrma": "This is the worst part of social media , we can twist the things according to our need...this is half video , watch it entire 😏and apart from video you call it \"so zulam\" zulam Kya hota hai un minorities se phucho jinki maa bhan ko Pakistan me utha le jate hai....", "akill_jain": "Maja aa gya", "rsid02": "What the fuck", "lifeofakshy": "Aunty ye UP hai, yogi ji ki police pr paththr maroge to yehi hoga", "im__shrii": "Good job Delhi Police aise hi maro salo ko students k naam par dangai kr rhe hai ye sale", "negiabha": "@gauaharkhan what the mean of #muslimhatred ..i think after having everything crystalclear n logical ..u still fill all shit in your mind ..yaaa bcoz model bankar aap modern nahi ban jaogy .u r duffer gavar n hatred spreading women.", "bharadwaj.karan": "She just trying to manipulate people by fake agenda she don’t understand seriousness of wrong information on Carter Road in road I saw protest and hear there view point and than after done my own research it’s look like all fake student don’t know any point and that Xavier college girls even don’t know anything she just talking about Assam and all", "rohit_skak.45": "Aurrr gand Marni chaiyee🖕🖕🖕", "milanjthomas": "👏👏👏", "kushal_navandar": "Tum jaise log desh me aag laganeka kaam karte ho. Sharam karo. Bhagwaan se thoda daro. Mob agar police wale ko patthar marega to police wala gand ae phool nikalke nahi dega. Baat ko samajh kammo. Aur thodisi badi hoja. Byaah bi to karana hai tera. #Chutiya", "pannu.gore": "Wdia kiya,, koi v sala bina jane kuch v, strike kar deta hai.. uper se aam public ki dukan, gadi, byke jala deta hai.. unke paise kon bhrega ? Koi hisab nai.", "surendrapatelsk111": "React kro in dusto ke prati", "missaditi09": "Accha delhi police bekkar or kudh chaiye police ko 100 pathar maare voh badiaa such a asshole you are acting pe diyaan do gyan dene pe nahi !!!", "i_am_aksh_mahishi": "Literally #Reallyswara do you any idea what u doing. They deserve even better than this they are destroying public property like anything and you says they are students really shame on you.Dumb people. You know what all this is happening because of you people who misleading innocent people and they end up like this . Go and get the proper knowledge about CAA and NRC and if you can understand that try to spread to these dumb people to stop this shit.", "vivek.singh4249": "Kaam milna bnd ho gya kya ma'am itni negativity faila rhi ho", "anantkumar7017": "This matter is in Supreme court. Why you create controversy.", "heenasheikh00": "This is really shameful @worldhealthorganisation @uno @un @dailymail @nytimes @bbc @washingtontimes", "preetshah7734": "Toh kyu jaate ho protest karne ghar p rahoo", "abcdefghpqrstu": "Police ne Maa ch#####di lol", "arvind.myworld": "😂😁😃", "abhijeet_1aby": "You are just third class actress trying to gain publicity! You are the same person who went to Pakistan and was praising them for promotion of your cheap movies!", "tusharsharma19": "Well done Delhi police 🙏", "_dakshrathore": "बोहोत बढ़िया प्रसाद बाटा है 👌", "rudrakshkthakur": "Bhosadiwalo ye lucknow ka h phli baat", "ashwinpowar": "👌", "mr.sheraf": "😠😠😠😠", "rahul.nihom": "Very Nice.... Keep it up..", "kamath_rohit": "Acting pe dhyaaan de Swara!", "sherlcock_": "Ajmal Kasab ki violence nahi condemn karte didi?", "mr.darshanshah": "@reallyswara no one is asking you what you want.. N by the way why don't you upload videos of people thrashing police.. So partial you are", "hows_the_josh_jai_hind": "Protesters are really peaceful, the peaceful community were working for their right through peafull way for peacefullness , stopping railway burning bike", "sourabh_shivalkar": "maro saloko..thoka bindaas..i support indian police", "kavil_malik": "Haan is video se pehle ka video mat dikhana when these culprits were destroying public property...n ye sab videos share kar k you’ll r enlightening everybody....thanks a lot for such favour of yours", "hemant_prajapat": "https://www.instagram.com/tv/B6SSyZrB7Fr/?igshid=1k4s2wr9h0phq ye video bhi post kro.tali ek hath se nhi bajti samjhi faltu ki publicity lene wale log haat", "anas_malik39": "mam modii h to mumkin hai ye sb mjhe dekh kar hairaani nhii huii", "khushyyy90": "Dont create more issues by posting such videos.", "naman._.bajaj": "Then what will u say about protesters throwing stones and beating hell out of delhi police?🤔 @reallyswara", "yashu__maurya": "Jo bhi kr rha h delhi police shi kr rha hai @reallyswara", "chandana_pusapati": "@cnnindia @timesnow @time @bbc @bbcnews @cnn @nytimes @telegraph @unicef @humanrightswatch", "chetan_tiwari9148": "Aur maaro benchod🙌🙌", "daoodsheikh2": "Police wale gunde.....", "parth.__.joshi__": "Tu politics ki Rakhi sawant ban sakti Bollywood ki Rakhi sawant banane ki Teri aukkat nahi........", "abhisheksinghchauhan101": "Police ne jo b kia bhot acha kia and inke liye yhi theek h...and #reallyswara aap apni films kro.....aapko pta h ni k ye kya h or kya ni....theek h na.....please Police bhot shi kr rhi h....", "_i_ananya_i_": "Good job Delhi Police, rioters needed this treatment. Ghanta peaceful protesters bc!!", "ketan_p__r": "This piece of shit don't know nothing . Still bluffing", "harshad.wakade": "Violence not necessary", "ishilpipandey": "@reallyswara Ohh really is that peaceful!! Whoever wants to protest please burn your own vehicles and vandalize your properties! If you damage public properties then definitely Police/military will have to take an action!!", "don_pablo_369": "Ye isss randvi ki , flop bhen ke lodi , batayegi kyaa sahi hai kyaa galat 😂😂😂 jaake wo kAr jo veere di wedding mein karri thi , wahi aukaat hai teri bhen ki choot , illiterate", "waliarohini": "You need illegal immigrants with no records in 1.2b India! When we can not provide home n shelter to our people.", "aniket2016sawant": "Bhul javo cab ke bareme sabko lagta he bhahar Se log ayenge to oh log nokari kaha karenge aur kayenge kya Thik becuse of indias population to Apko nahi lagta 2 child policy adopt karni chahiye I am hope tabhi kohi liberal uska virod Nahi karega.", "bae_chara_kamdev": "Matlab kuch b muchodi pelni hai tumko", "abhimanyusingh595": "Bloody stone pelters", "deepak.joshi87": "Chutulipya by chutia", "nade_23_srn": "Well deserved", "habibahashmii": "We are with you, Country dont need this bill", "rajput18lalit": "जब हमारे देश की पुलिस 1861 के पुलिस कानून, जो अंग्रेजो ने बनाये थे उसी के तहत नौकरी करती है तो ऐसा कोई नई बात नही है। कानून तो पहला अपने देश का करवाओ पुलिस का, तभी कुछ पुलिस से अच्छे की कामना करना।", "musth_fikar": "Fuking police trrrorism", "pallav_thakrar": "Don't share any rumor without knowing it completely🙏", "avvkukrejaa": "Sahi Kia police walo ne", "anushainu": "Shame on Delhi police", "bhimgradiya": "Maza aagya swara aunty", "_shubhamsri": "Intezar Karo abhi aur Pele jynge aise peaceful log", "r_shubham77": "Aadhe log ye nhi pta CAA kya h", "jagruti_singh_deo": "Check the details first then post darling... I support #NRC #CAA", "ankushsandhu360": "They were simply following Ipc section 146", "uncontrolable_reaper": "This does put a smile on my face", "bts_euphoric": "Do you have any idea about the police? You are only showing the one side of it, do you know how the police is getting beaten up?You are a HINDU and you are supporting those dumb protesters, didn't expected this from u.... Doing this only for attention won't get u anything but only hate and trolls, like All the best!! ..", "palak09__": "Support cab and Nrc but not violence🙏", "priincess_144": "Peaceful bhi bolna hai or protester bhi😂😂😂", "ayesha12khan3456": "Are chal bakwas mat kar gaddar ki paidaish hai tu chal nikal", "lslam_ki_shehzadi": "😡😡😡", "ajeenckya888": "🤘", "__mr__shaquib": "Inki maa ki **** lv*de log", "kkc387": "Is swara ko boycott karo india se", "satishnpatil76": "Why are you sawing one side only? why don't you put videos of violence done by this peace full protesters👏", "tyrantvik": "इंकलाब तो पता नहीं पर पथरों से जरूर भरेगा चपा चप्पा", "vipulthegreat": "Swara, we loved you from watching you in vera di wedding, but how much empty headed and dum you are, we just found out now. You are really stupid.", "dr_mayur_pujara": "There were armed Gujarat police also who were brutally beaten by stone pelters at ahmedabad...why don't u see that side of coin..", "poojashinde813": "स्वरा भास्कर तू साली सत्ता की भूकी है ....तुझंसे कुछ नही होने वाला... मोदी जी को बोलणे की 'तेरी औकात नहि....ऐसा लगता है की तेरा मु तोड दु...चुतीया औरंत CAA and NRC लागू होके रहेगा ..तू कितनी भी घीस तेरी ..तेरा कोई सुनता नहीं और सुनेगा भी नहीं.घटिया औरंत कही की", "mohakmalhotra03": "Doosri side bhi dikhao didi. Don't be a bikau gal", "chiasharma4": "#isupportcab", "beautiful_soul121": "Everyone would be silent if it was happened in kashmir....", "anshulkashyapp": "This is from Bahraich , Uttar Pradesh . You idiot Intellectual. 😂", "iamzaheen": "It's not Daryaganj,Delhi but Bahraich City,Uttar Pradesh. The protest was going peacefully and suddenly they started lathicharge. @reallyswara", "infiniteashish": "स्वरा जी आप महान हैं।", "sami.gull.jan": "😢😢😢", "kunduomkar": "Modi Shah are the bloody creatures who should die this way. People should Stab them to death.", "archie_8_": "Q ni dekh pa rhe log schai.. q andhe bne h bhkt sare.. hmara hi desh effect hoga modi ka kuch ni jane wala..", "rampandey93": "Am just unfollowing her...she just want to be in media for her drama.🙄", "toyasiin": "Shame...", "amitsuman1992": "@365daysofslumber", "_chitrakar_01": "Can i send you a video then decide", "prashantkhetwal": "Yeah❤️ Good❤️ Beat the hell out of them❤️ @reallyswara", "belowthepondmehra": "Ab iss same video ko ek different narration se news mein dikhayegen, to make the protestors seem like horrible criminals.", "i_am_dhanush_0017": "People who don't have proper documents and ID cards do promotion like this 😂😂😂😂", "abhimanyua": "Sad", "dodo_and_daddy": "Fuddu aurat....u call them peaceful protesters who are damaging public property and have torched many public buses...these protesters continue to throw stones on police wala and they do nothing in return...waah ji waah", "_i_am_abhi____": "Kripya buzurgo aur kuch 1 ya 2 aunty se anurodh👏 hai ki apna gyan naa de..delhi police ,indian army,and all public servants hai to hm hai...jisko problem hai inse kripa krke wo pakistan ,afghanistan and Bangladesh ka citizenship le skte hai..", "_parveenreza_": "horrible", "deepeshkrjha101": "#reallyswara aap ahinsha ki baat krti h or aapko ahinsa likhne nhi aata.", "_syed_anam__": "Shame on delhi police", "ig._saurabh": "well done police.....@reallyswara pls don't spread hate....you're doing all this to grab attention", "usamah_amir": "@narendramodi bure din waps krdo yaar", "rajput_shivani11": "Salí isliye tm giri hui ho... Jake schchai dekh", "yash._07_": "Mam if you don't have any complete knowledge about this bill ,plz stay out of it ....", "ranganathkamath": "Do not edit the video the way u want...share its full version", "xienaksh": "I support delhi police #support #nrc #cab", "nocturnal._.head": "Were you there when this protest started in daryaganj? Or just judging unnecessarily!? Me along with 350+ girls were writing our exam, when this ugly protest started. They burnt a car somewhere outside our campus, chanting for azadi on road, our nearest metro station was shut by then..We were locked inside our campus for 3-4hours.. Horrified!! If this is the peaceful protest you are talking about @reallyswara without even knowing it properly, then this is something to pity on.", "choudharysahab_07": "good action by # delhipolice", "vikas28582018": "Shame on you", "nandan__92": "@reallyswara ...I want to see you also beaten up like before these people ..stage pe bodyguards ke saath aate Hain or illiterate ki tarah common people Ko yehh sab karne ke lie Bolte hain. Shame on you", "sruuuushhhh": "@unitednationshumanrights", "saniyajaswanii": "@amitshahofficial don't turn urself like britishers. We trust you, don't break it", "aj_rana": "#wesupportcab #wesupportnrc", "sakshiverma1878": "Pttharbazi sarkari smpatti ko nuksan uska video b dikhao aap jaise log bdawa derhe ho public ko jurm krne m", "purnima.ghai2604": "Yes n THESE FAKE PEACEFULL PROTECTORS put delhi on fire 🔥 !!!!!! At daryaganj only... thrown stones on police too.", "shreyu013": "When the mobs were hitting police officers with stones and rods. Were. Wer you .arent they humans. They were doing their duty. Have some knowledge about CAA. And NRC. Then comment on police. They are the same people. Who gives u PROTECTION when u go out for. Party and. Events. Remember it. So called celebrity #indiawithnrcandcaa", "hind_mukesh": "Police pe pathar fekega.. Log tow kya karna chahiye yahi karna chahiye good job", "silent__breeze": "When these guys are throwing stones on the Indian police doesn't remind you of the terrorist who indeed turned the minds of jammu and kashmiris to harn the army. It's the similarity kindly dont spread hatred over this. You are a celebrity and all follow you if you cant spread positivity kindly keep quite", "pinak88": "Brainless and spineless woman.. shame on you.you can’t upload this kind of video to agitate peoples...you have no right to evoke people’s emotions to do more act like this.you are irresponsible citizen of this country shame shame👎", "rowdy_hero_7": "aap nii dekh rii ls me 😂😂😂", "timepasschalraha": "Mataji ye bairach UP ki hai, jhoot ki dukaan", "mohan.saini.794": "Good job Delhi police.", "aadi25_": "@reallyswara tumne konsa nasha kiya tha didi post dalne k time, 1 line tumne nahi padhi hogi amendment bill ki.. Yaha rajneeti bata rhi ho.. Chalo jaisa bhi hai aap apna continue rakho😄 we trust in Security forces they are trained enough to deal with this shit.👍", "sarfarazahmed_786": "bethe bethe krr rhe the protest fir b maari laathi... fir jor se chillaye hm khaki gunde h hmne amit shah ki chaati", "amit.satyam09": "Shut up trp ke liye kuch bhi.....", "itsanirudhjoshi": "@reallyswara Gujrat, jafarabaad, bangal, UP k videos Nahi dekhe ...jaha government property ko jala rhe hai police walo k uper petrol bomb fek rahe hai patthar maar rhe hai unko..ye log Sahi hai ?? Police galat hai ? Ye wahi police hai jinhone apni Jaan Di hai Desh k liye ..remember 26/11 (tukaram omble, ashok Kanye, Vijay salaskar etc.) Jinhone apni life apni family ko desh se uper rkha hai ..one more I have VC SAJJANAR who killed priyanka Reddy's repists..ese aur BHI bhut log police me ..yehi log hai aaj BHI police me ..#shameonyou", "darshan_lee_cooper": "😂😂😂", "rupeshroy0506": "Jay ho..🙏", "nofear_2020": "Maaro maaro adhe kaatte huye laudo ko.", "sourav_nandy.11": "Lee aajadi 😂😂😂😂 bahut badhiya", "mehrwal": "Who are you to say scraped those bills. And yes we need it for batter civilised our nation. CAA for who minority in neighbours country’s. And NRC this mandatory to who wants to protect our people rights . Every European and American have his own NRC . It’s necessary . We request you pls don’t separate lies it’s not good for our nation. 🙏", "ghildiyalpankaj": "Kyu logo ko badkane ka kaam Kar rahe ho y", "rushabhkulkarni99": "Chup Kar 🐖", "skkdesi01": "Peaceful protest ... lol ... she is so biased", "thakkarhardik_ravi": "Jakh marne Gaye the nai, dande pad gaye 😂😂😂😂😂", "mj_ansari07": "This is so shameful.", "talenticaaindia": "Suwara posting a pic of designer photoshoot got 16k likes, and suwara posting a political video get 1lakh 30k likes. It's natural what she gonna post for publicity. There is a difference between reel life heroine and real life heroin. As she mentioned in profile bio \"dramebaaz\". 👌👌", "kcj4real": "Only post about community don't post about how thousands of policemen and policewomen also getting beaten by public !! you are spreading good message in public hats off to you mam!!😒😒🙏🙏 Desh aage badh raha he !!", "holyguy999": "WE THE PEOPLE OF INDIA STAND STRONGLY WITH THE CAA & NRC...🙏🔥🙏", "ishusaifi007": "Hum le kar rahenge azaadi reject nrc cab", "notaplainjane11": "A Relative of mine( who is in place force )is in the hospital with severe injuries because of protests. You Bollywood celebs spreading rumours about CAA/NRC without even understanding what it is all about. Shame on all these wannabe Bollywood celebs You are talking about the human rights of protesters. Are we even bothered about human rights of police", "bhardwajshivam19": "Report such shit posts", "26pranavd": "Education must needed for Bollywood.. Before educating India educate Bollywood actors 😂", "mo.danish_07": "Mam ye video bahraich (up) ka hai jume ki namaj ke bad @reallyswara", "rajeshverma146": "Tujhe bhi aise hi padni chahiye", "aryasahab_09": "Wow... superb work by police... Extremely happy to see.. Ajao lelo azadi", "c.h.a.n.d.u_c2": "@reallyswara jis v party ko tumne support kiya wo haar gye...ab tum CAA aur CAB ka opposed ho...iska matlab ye v aayega. Aur ha koi post dalne se pehle dekh lo ki kitta sach h... U mean they were protesting peacefully...ha ha ha. Police are doing damn right thing to save our country from these morons.", "indiagreat367": "it is passed in Parliament, nation doesn't work on what anti nationals like you think", "i__am__jk__singh__rajput": "All good...😂😂😂😂😂..sahi ho rha h", "parvinderneelam": "Excellent work done by Delhi and UP police .. @reallyswara this is the treatment for tukde tukde gang ..!!!!", "mypramod6": "Hum de Kar rahenge azadi 💕 swara ji aap se na ho payega . Kirpya fake drama creat na Kare .", "aashish_prajapati": "Bt why u r not showing how our cops are treated by protestor in gujrat........they injured the police man....", "ankur6791": "GORAKHPUR POLICE HAI GADAHI", "_npadhiyar": "@reallyswara i think so aapko fames hona hey to thik hey but aap q support kar rahi hey? kisi politician ne aapko bola hey ki \"AAG ME GHEE DALO\" pls aap jo kam me mahir hey us pe focus ki jye.baki jisko apna kam karna hey vo kar rahey aapko PM bana hey kya ki aapko politics ko joi n kar na hey ?😁", "rohitbhadu7007": "They deserve it", "neekitamadane": "Terko actress bhi kisne banaya yarr", "ravira7944": "👏o ho ho 🙌", "al_nisa_786": "Gunda gard police😠😠😠", "koushikduttaroy2": "Or marna chiye inlogoko", "prabhate.kr0602": "Why don't you show the trains which were broken or stopped in different areas.you only show one side.why you hide other side", "brinsta222": "Great job Delhi police. Why do spare this bullshit lady on the name of lady.", "vaibhav_nirgude_": "Shameless lady just spreading rumors and trying to get publicity police will take stones and petrol bomb on them is this she wants i think.", "sam_rg0208": "Police is doing there job.... Nothing is peaceful...", "miemoiam": "@reallyswara do you have any writen copy about CAA and NRC ? Please share on social media like you share this video.", "salman_rafi948": "Imitating this scene like jallian wala bagh 🔥🔥shame on gov and shame on police", "avimandot": "Ok then if you hate police so , remove your police protection and Deny them to protect you,. You are fucking celebrities", "rahul_kundlia": "Apne ye to dikha dia ki police mar rhi hai but ye nhi dikhaya ki patharbaazi start kisne ki ............. #shameonyou @reallyswara ........ Was a true fan of your acting before your involvement and enhancing these activities ........ Which create disturbance in country", "c.bajpai": "Madam if you don't know na what's going on here better you keep your mouth shut and sit back.... Waise bhi you are good for nothing.... They are protesting but if you ask them what are they here for they just only knoe the word to protest... But what rhey are protesting for none of them will answer it properly....", "manju.mittal.37": "You get out from India 😡", "mitra_souravsen": "We need it.", "sid_hunt_17": "Good job delhi police...", "gautham___j": "Well done Delhi police 🔥🔥, instead of lathicharge they would have shot everyone 🔥", "akansha_joshi13": "Such a samefull act ko support kar rhe hoo aap log ek kamm karoo modi ji ka basann sunoo. Aap log bhi samill ho iss act ko badawa dene mae. Is act ko detail mae samaziye", "sameersaurabh8409": "Bhn ke laude jo police wale ko mar rhe hai wo kyu ni post krti sali randi ye peacefull the to itni dukane kya trre bap aye the jlane jo randi sali Dogli bhade ki rand", "kkumaraankit": "Any budy have full video of this action", "sachhutomar": "So you haven't seen the videos in which these anti nationalist attacking police. 🙏🙏", "arukasat": "For your kind information it was not a peaceful protest so please don't post any half knowing facts of it and make wrong image of Police", "aniket_kuhikar": "@reallyswara scrap the CAA? Just because what you're looking at and what you aren't. Just look what posts the 2 girls had made considering in support of yakub memon, than talk about this shit. Our minorities in othee countries are suffering, they are killed, either converted into muslims, women's are raped and here you guys instead of spreading awareness are spreading rumours amongst people. Please read CAA its nothing to do with MUSLIMS leaving in INDIA. And talking about NRC, yes, the people who've entered into INDIA, illegally, they dont have any fucking rights to stay here. And i highly believe, the government will bring as many clauses inside the NRC ACT that this discrimination, which is not actaully anything, but people are spreading it will come to an end. Just clear your concept.", "shoaib_aziz_": "Ma’am u r a best example of all women in our country who still shut their mouth for stupid govt bill #caa #nrc. We support u till the last breath. I love u", "adithya.rao.127": "Maaro maaro", "amang2310": "Ye lathi charge ki video dikha kar aap bahut sahi kar rahi ho... Please also show those videos jinme apke so called silent protestors ne pure desh ko jala kar rakh diya hai. Wo video apse nahi dikhayi jayegi. I was there when all this happened. These muslim protestors started all this. But apko wo nahi batana. Agar inhe inki manmani karne di jayegi to these prtestors will surely burn the whole country. Properly pata bhi nahi hai ki CAB/CAA hai kya bas kisi ne kah diya muslims k khilaaf hai. Aur hungama karne chale.", "bhosaleashu2727": "सरकार और पुलिस चाहे जितना भी जुल्म करके हमारी आवाज दबाने की कोशिश करे पर फिर भी हम ना रुकेंगे ना हटेंगे, डट के सामना करेंगे जब तक ये बिल वापीस ना लिया जाये", "pradeepdubey11": "Tum woh share kyo nahi karti jo dangaiyo ne dehi me police n ips officer par hinsak hamla kiya ,tum jese logo k wajah se hi hindu musalmano ko ladaya jata he.", "arpit_vyas23": "जालियाँवाला बाग़ ! 😠", "jampotgirl20": "Such a shame!", "souravghosh23": "https://youtu.be/vrZuxDkXkTQ", "choudhary_abhay.singh": "👌👌👌👌😂😂😂", "prafful_rathod": "CAA has got nothing to do with Indians. And NRC is still a draft for discussion then why are we burning the country in the name of protests", "agnivesh_yadav": "@reallyswara पता नहीं तुझे जैसी घटिया औरत की फिल्में लोग आखिर देखते क्यों हैं तू देशद्रोही है इसमें कोई दो राय नहीं तुझ जैसे लोगों का कोई मान नहीं होता चंद पैसों के लिए तुम विदेशी ताकतों के हाथ बिक जाते हो और उनका एजेंडा यहां इंडिया में चलाते हो दो शब्द अंग्रेजी के क्या सीख लिए अपने आप को बहुत बड़े सोशलिस्ट समझते हो अरे तुमसे तो 12वीं पास एक सैनिक अच्छा होता है जो कड़ाके की ठंड हो यह 50 डिग्री सेल्सियस कि गर्मी बिना किसी स्वार्थ के अपने मातृभूमि की रक्षा के लिए अपने राष्ट्र के लिए लड़ता है और तुम सालों को इतनी आजादी है कि तुम खुलेआम सड़कों पर भारत की संपत्ति को नुकसान पहुंचा रहे हो और तुम्हें आजादी चाहिए इतना ही ज्ञान है तुझ में तो एक कारण तो बता किसलिए विरोध है", "anand_aishwary": "Bkchodi karenge toh maar khayenge hi n...pgl aurat....@reallyswara dimag kya ghutno me h. !! Left librandu 👉🏻😠", "himanshu.bhardwaj2208": "Don't spread rumor", "m_mohitkocher": "Film industry main toh kuch hona ni inka. Now just by doing this she wants to be famous", "_beyond_your_imaginations": "ज़ब ये लोग पथर मार रहे थे पहल इन लोगो ने की थी वो वीडियो भी दिखाओ", "_shubham94": "Tum jaise librandu ho Agr kisi desh m to Pakistan jaise dushman ki kya jarurat", "mr_.khanna_": "Lady terrorist", "amiya_nandi": "Kuchh constructive kam karo. Desh ke liye. Danga nehi", "shridharsarraf": "Who started it first??????????", "prakul_sharma_21": "What the heck is this", "govindrakholiya": "Have you seen the video when those people were throwing stones on police?", "deepikabudholia": "Kitne pese mile ye post k liy3", "sugrcan": "bilkul sahe pite ..🙌", "skhanna799": "Bhot he badiya kiya tum video dal kai kya sabit karna chahte ho vo video kyu nahi dalte jab unhe berhmi sai mara ja rha tha police walo ko yeh jo baate bolne main asan lagti h tumhe ghnta nhi pta hoga caa or nrc kai baare main bas aa jati h muh utha kai jaake pankaj tripathi ji ka tweet dekhiye tum sif logo ko bhadkana jnti ho agr yeh police walo par pathar mar sakte h toh police walo ko wahi karna chayie jo is video main ho rha h so apna yeh anti nationalist drama band kijiye or jo ghtiya si acting aati h wo kijiye", "fuckera_": "💯❤️", "abdul_ahad_khan111": "mem, pls come at Delhi India gate for Protest , if you don't mint , and thanks for support", "mr.xinsituations": "Pakistani ISI is funding these NRC and CAA protests... Is it true ?", "angraj842": "Tu nhi Pakistan ja Bharat Mai Kay kar rhi h", "nitin.vatsa.1": "nice it is.... they are not peacefull", "vinay.alekar": "Gagar aap free ho to aa jao Delhi main real situation dekhane ke liye.", "thakur_ankit_chauhan": "f..k u", "maliksahab0432": "thank u for standing with the right..and constitution", "tushar_kashyap7": "🤣🤣", "bonvoyagesadie": "Absolute disgrace this is!", "xmanfcuk": "Jab aap agar itne padhe like hote tho ye post karne ki jarurt nhi padti apko miss desh ko aag lagaoge tho hadaiyaa tho tutegi madam", "ankit_garhwal": "@reallyswara 🖕", "mr_bean_omi": "Well done police...aise atankwadiyo ko aise hi treat krte h", "ravi_singh404": "Police ek number kaam kr rhi hai 👌👌👌👌👌👌👌👌", "baduumba": "Eye soothing 😍😍😍😍", "_.mr.patel._": "swara tu vibrator hi use kr vhi acha lgta hai tujpe yh politics mei mt aa vrna yha pe bhi tera career fail ho jyga 😂😂😂😂", "ajay_chahar_268": "Mam, you are not showing any video and picture of peoples destroying and burning government property. If Jihadies", "raynax_": "Why didn't you upload full video in which this peaceful protester are destroying public vehicle and stone pelting on our policeman .", "aanchaldz": "💔💔", "yaduvanshi_brand_": "Good work by delhi police💪💪", "sanjaypatil1044": "😂🤣😂🤣😂🤣😂🤣", "rohanpandeyinsta": "Are o madam... Aise hi padhegi... Jo galat hai vo galat hai... Aapko b Khaana ho to baatao", "salmanhasan8013": "Ghatiya Sarkar Ki Buzdil Police, Achha Sabak Sikhaya Tha Wakeelo Ne In Buzdilo ko..😑", "rohit.singh09": "लोगों को हमेशा \"अमेरिकी ग्रीन कार्ड\" के लिये तरसते देखा था.... \"भारतीय नागरिकता\" की कीमत क्या होती है ये आजादी के 72 साल बाद दिखाई दी.. जय हिन्द!!🇮🇳 #isupportcaa_nrc🇮🇳", "i_am__ram____": "We love dilli police", "abhishek_gupta_77": "62% Indian support CAA Who Are You mam 🤬", "aakarsha_11": "U r gd for nothing Swara..uneducated woman...better u also leave this country coz u r provoking people ..u r simply a gawar...", "aawara_hoon1": "why the protest in 1st place???", "jeetprabal": "Why not Muslims throw down their minority status if they want to life equally with us.", "sanjay143536": "Aur pitaii Karo", "yuvarajayyar": "👌👌policemen...👍", "lijin_vp": "😂😍", "_.gupta.ji._": "Zara CAA aur NRC ke baare humko batana chaahengi? Aur zara is video se pehle trending ho rhi videos share krna psnd krengi jaha delhi police walo ko maara ja ra h? Behn ki lodi", "ajittarade": "Then pls show also protesters violence also", "kushbaluja": "I literally don't know why I have followed you. But now genuinely don't want to follow someone like who is cascading hate based on this visuals. People like you Swara think 1000 people can beat the shit out of one police men that's okay bt when they retaliate that's wrong. please go and read law and complete details about on going issue. Speak with facts not based on these visuals. Coz you don't know the reality, bt when you people go for shows why the hack you need police men's to protect you. Don't miss use your stardum and we all are together and will stay together forever as we all proud to be an Indian and police men like them who are not baised. Deseve Salute not hate. STOP", "swara_bhasker_traitor": "Report her account", "m.kaushik.7": "Why are you so afraid?", "pardeshi3537": "Madam logo ko bhadkao nahi ....Aapko kuch bata bhi CAA ke bare me.....", "_manjeet_purohit": "See mam do have any idea about the bill and what it means.first have a break understand the bill and it purpose then put ur perspective.ur really deaf dumb and senseless woman.", "aphrodites_casket": "Tere likhe anpadh admi toh aur kuch bolkar khud ka time waste nahi karna hai bhai. Tu andha bana reh. Tere ghar tak jab baat aa jaegi toh pallu me chup jaiyo. 😊👍", "aadii._.is._.here": "Peaceful protesters... Really @reallyswara wtf is this?😠😠😠😠", "_gujjar_sanchit": "Orr maroo saloo ke ...good work by police", "bhupesh_1810": "In jaise ko pakistan bhej do..tab inki gand fategi waha pe..tab samjhenge..", "vinay_____sammet": "Bad society 👉", "shukla.shivansh": "What type of problem do you have...why you oppose CAB and NRC....you are so dumb mam...its a step towards akhand bharat", "gargichakroborty": "😥😔", "dean.person.167": "Police Kya kregii or inn chutiyo ke sath ,🔥🔥🔥🔥🔥🔥🔥", "reachkgs": "We dont need it. But poor scared immigrants from neighbouring countries need it.", "dhananjaybheda": "Time to unfollow u & to make sure atleast 100 more people do d same as u calling them \"Peaceful protests\".... Guess u haven't seen vids of wat dey r doing to d policemen.... shame", "s_u__n__i__l": "@reallyswara teri gand pr ese lgege to samjhegi matherchodd", "shivamtalan2810": "अपकी जानकारी के लिए।यह दिल्ली पुलिस नहीं है ..यह शुभ कार्य uttar प्रदेश पुलिस द्वारा किया गया था", "shakti_thakur1359": "Just tell me tumhe cab se dikkatt kya or dikkatt hai bhi ya kuch paiso ka maamla hai", "nasheet_s": "😢", "sharmaakhilmohan": "Salute to Delhi Police.", "__aashneet__": "Very sad . Heartbreaking this video. However, this video is also a great example of how when bure din actually strikes we are okay to trample over the same people we were standing by a while ago. #secularindia #guessitsalsomodi", "kshitizoberoi": "@reallyswara fuckk off", "_iam__poisonous": "Delhi police sucks", "itz_sidd_h": "Wow how a beautiful video😂", "saimarazzaksyed": "Kaha hai wo log jo singing show mein boarder movie k gane sunke rone lagte the.. ye dekhke kuch feel nahi hora aap logon ko", "vbhutiya": "@reallyswara#dog of India A dog from dubai came to India Indian dogs with surprise asked . Looking beautiful, where are you from. ?? Dog said - DUBAI  Why did you leave dubai ?? Dog replied : air , water , weather, living all great there , but freedom of barking is only in India , Nowhere in the world .", "mohdjahidkhan": "BJP is showing what power can do. Now see the supreme power of comman man that will crash your unconstitutional bill nd your jidd", "raaaaom_kshatriya": "Jai ho 🙏", "saurav_raz": "Do u know the meaning of CAA CAB NRC .....", "ajayrathi.99": "I am pretty surprised the way the cops are handling things, and equally surprised at what are the people opposing for. To get a clear idea about it, can you please explain as to why do you oppose the CAA and NRC and why is the government so much in favour of it?", "abbasijuzer": "@cjwerleman look at the atrocities on minorities in india in broad daylight. Where are the human rights groups. This isn't democracy.", "kanchangupta19": "Appropriate treatment for the Rioters. Thanks for sharing. Nice to see our police is actually doing something GOOD.", "surabsaroha": "Hi Mam, please have an idea about this then speak, else it there is no difference between u and other.. suggestion take or leave it.. @reallyswara", "yadavyadav82": "प्याज के लिए क्या रोना , आज नहीं तो कल सस्ती होगी.. समर्थन करो CAB,NRC का, नहीं तो हर जगह रोहिंग्या🐷🐖 की बस्ती होगी ,,", "vedantpuranikofficial": "Maaro saalo ko", "anayamathur5": "Peacefulls ne Jo jalaya hai Uske liye pooja Kare Kya Fir 💩💩", "__.shahbaaz._": "Respect mam we are with you👏", "ilokeishlunkad": "https://www.instagram.com/tv/B6VrWfTBvM0/?igshid=dyfp26i87aid", "__damu___": "Mark madrchodo ko", "ankitasin24": "Why u people's heart doesn't wrench when we saw the videos of hindu people especially females who get torchered like animals and are forced to convert their religion and then forcefully get married and raped brutally in countries like pakistan.", "saiyaaam": "@humanrightswatch", "36paashish": "Gujarat kisi police ko kyun - Pathaar maree. Bcos they were only warning of ill elements could affect peaceful protest. Real shame on such though process. Police are for our good. They also have there families n Human Rights. No bloody illetrate / literate people can't think in that way... Shame shame on such soch", "the_domrunner_": "Maro aur maro... !! Watch gujarat videos too miss bhaskar", "mubshrr_muhammed": "@aljazeeraenglish @bbc", "vvk_mishra_26": "Aur Gujarat wala video nahi dekha kya ....nahi dekha toh Jake dekh lijiye madam...aur Haan agar aapko itni hamdardi hai Jamia walon s Naa toh agli baar jb kahin baahar nikaliyega toh police nahi in jehadiyon ki security me jaiyega", "camerashy86": "Why don’t u post some videos where protesters were throwing stones and literally biting cops where they get the chance... you think the police is doing by their own choice? Anyways they are just doing their job to secure nation and people from these few protesters who actually don’t know for what reason they are protesting.. zara Ese video bhi post kar k Dekho Apne account pe jaha logo ko sachhai dikhe... sirf wo hi post na kare jo aap dikhana chahte he", "travellingwithout.moving": "Scrap the bill👍🏼", "abhimanyu5702": "Be a responsible citizen first, don't present the one side of the story only.. I suggest you to check the Gujrat video too where these mobs brutely beat the police personnel.... #fakelibersalism # boycottselectivebollywoood....", "papa_ki_princess_saba": "doesn't this remind us of jalia wala bagh ☹", "walmik78": "😢😢😢", "garima1506": "Swara....please wake up. Dont behave like a non hindu outsider. There were hindu protests too where no lathi charge happened. We are HINDUSTAN...we should help our people suffering in muslim countries instead of using our freedom of speech to gain footage by talikng about non hindus of our country who are happy and safe here.", "samarthsingh2005": "U plz stop writing shit abt delhi police u cant see the video when those fucktards were throwing stones at the police", "shaikh__mazzy": "#muslimhatred", "sharangajuare": "Are these people doing Peaceful Protest? Good Joke .You are shooting arrows in the lane and encouraging people in the name of non-violence. You need to listen to Ravi Shankar Prasad, Minister of Law and Justice You need to study CAA too", "onu044": "We do need CAA and NRC! And get yourself educated first, this didn't happened in Daryaganj. It happened in UP where section 144 was implemented.", "dipen.somani": "Haha. \"Peaceful Protestors\" 😂", "muskansaluja__": "Chutiya", "vinit_vb": "Akkal ke andhe log.. Chaar paise mile toh nikal pade bhikari ki tarah raste pe 🤣🤣🤣Get the facts clear first..", "piyushh313": "Abe bc kya h", "sid_dhxrth": "Ok so I'm neither a bhakt nor a liberandu but i like to voice my opinions after researching about the subject first. So what i came across was really horrifying not only for the protesters but also for the police force too. The way you showed the police force thrashing a mob , do you even know why they did that. The so called peaceful protest at daryaganj turned violent and protesters literally set a private car ablaze obviously the police had to take action. Ik that some people are gonna say that criminals usually take advantage of such situation and wreak havoc in the society and yeah it turned out to be true in most of the violent incidents occurring majority of people involved in them were not normal protesters or college students infact many had criminal backgrounds and this fact was confirmed by the police force themselves. but then If you're going to protest peacefully then it's your responsibility to ensure that no kind of violence occurs at such a protest because even if a single person causes any sort of vandalism or violence then the entire group will be responsible for that infact i would say it's our responsibility to ensure that nothing like this occurs so the government won't have an excuse to detain the entire group of protesters for investigation.This video basically tells us just one side of the story, at this protest which turned violent after police had to intervene, 36 people were injured out of which 8 were police officers and had to be taken to Lok Nayak Hospital. obviously police denied the lathi charging which is clearly visible in this video that's what i feel was wrong on their side and what you did was equally wrong. I myself am against this act but rather than just following the crowd like sheeps i researched on this act and read a lot of articles which told me that how it was discriminatory and how it was going to affect a certain community in a negative way but 80-90% of these protesters don't even know what's the full form of CAA infact in a recent protest when Farhan Akhtar was asked in what way is this act discriminatory and he was literally dumbfounded. Rather than just trusting anyone we should research on a certain matter", "h_ershall": "ab batao bhak5ards", "azamkhan9659": "😠😠😠😠", "arshadjordan": "#thelallantop #ndtv Dekho dosto sacchai jano or felado 💙", "dhruv2793": "Vo haramio ne jo police pe pattharbazi ki thi vo kiya peaceful tha ?? Dande to zaroor Padenge aur padte rehne chahie 😠😠😠", "adakaracademymumbai": "So sad picture, treating like animals, very sad.", "chavanminal": "That's cruelty", "vipul.pandey.3766": "😁😁😁", "_fash007": "Jai Hind", "mumtaz__7860": "rajdhani area hai ... nazdik ka kam dikhta hai 🤣", "surya_dabri": "Gajab just showing one side show the protestors beating policemen show the stone pelters show the people damaging goverment property .... I support cab and nrc", "harshita15singh": "Ma’am iske phle ya baad ki video ni dekhi hogi apne ? Hena? Jb protestors stone fek rahe the.. ha zaroor ni hoga.. Or na he apne bill pdha hoga.. u saying we don’t need it.. how can you decide it we need it or not if you have not read it in the first place!!!! Logic? 🤔 ni hoga obviously!!", "sshashankanand": "We All know u have need some footage because u r disappearing but this is not right way to get publicity...अच्छा नहीं कर सकती देश के लिए तो भड़काओ मत humble request @reallyswara to u", "ankit03rathore": "Khas in lathiyon me @reallyswara tu bhi hoti ar tere sr pr bhi ek lathi padti to agl hi maja ata", "bharath_raj_purohit": "Kick their ass😎", "anshul2291": "Gud work .. really appreciate", "im_aamir_khan2222": "Isko bhi bht se log sahi bol rahe hai..aise desh main kon aana chahega", "amazumdar81": "@reallyswara CAB As per previous Act of 1955, all illegal migrants were not given citizenship. This states anyone born in India on or after January 26, 1950 to July 1, 1987 is Indian citizen. And those born July 1, 1987 to CAA 2003 and after CAA 2003 is a citizen along with either or both parents. Moreover, in revised bill of 2015, members of the Hindu, Christian, Sikh, Buddhist, Jain, Parsi origin from Pakistan, Afghanistan, and Bangladesh who have been living till December 31, 2014 and for more than 5yrs are also considered to be citizens. NRC Only in NE region, according to NRC, a person eligible to be a citizen if they or their ancestors were in India on or before March 24, 1971, the eve of the Bangladesh War. And this needs be proved. Article 14 Article 14 uses two expressions; \"Equality before law \"which implies the absence of any special privileges in favour of individuals and the subject of all classes to the ordinary law and equal protection of the law which implies \"Equal Treatment in Equal Circumstances\"", "omesh.kumar.12764": "Very nice action Dil khush ho gaia", "kartik_patel_kk": "Aur maro salo ko tod fod karne ka yahi natija hona chahiye", "rjnsawarna": "I would have appreciated this one if you had shared what they \"Bechare\" did beyond this footage.", "jugmohanpundir": "Maaro saalo oo", "the_dreams_walker_": "😢😢", "i_am_akshayysharma": "Thoda socho...delhi aao...pass se dhekho...kya ho rha h..ye log kya kr rhe h...video srf police valo ki hi kyu dekh rhe ho...me btata hu...me vhi tha...if ek br peacefully protest krke ap chle gae ho...ghr wps...dn 1 hour bad aakr...pathr se bhre bag lekr aana...ot denge krna ye shi h...", "anjumshekh71091": "🔥🔥😢", "harshkaushik43": "Do u hav any idea about CAA", "akhan1569": "Police ka zulme", "zeenat250": "They beat up the girl students from Jamia university... that was terrifying... goonda raaj", "deba_dutta": "What a shame... 😡😡", "aslam_anwar_": "It saddens my heart and soul !", "umesh956529": "Madam, with respect, thoda bahut pdh li hoti act k baare me n global politics n scenario k baare me ho-halla mchane se pehle... Aapki realistic acting ka diwana hu me.. anarkali aara ki acting dekh k lga tha k kangana ji k bad sirf apme talent h thodi buddhi h.. but apne itna ho-halla krke sb gud gobar kr diya.. u disappointed me.. mam🙏", "robby_limbachiya": "Mind blowing, I love it, uneducated people", "ali_syed1239": "Wow the great india 👏", "millionsmacks": "Ek chotte se bacche ko chutiya bolne wali peaceful kya hota pta bhi hai aunty", "sayedzahidalam1978": "Shameful", "beautifulmind.atul": "Aur swaal ye kiya jata hai ki AZADI ke naarein kyu", "adit.99": "You are so irresponsible, this is no where spreading awareness !!", "thakur_avnish_singh": "Aur maro saalo ko atankwadiyo ko terrorist hai sab", "aranjans": "Someone give her an oscar already ..😂😂😂 I don't understand how can people so confidently speak about something when they dont know about it . Ohhh sorry they are from tukde tukde gang 😂", "ha_m_vhi_hu": "Or turn the table nd think about police. .aj cab kl bjp ka prso aap ko fir congress ka kbi karni sena kbi bhim sena kbi koi kbi koi ... Police kre to kre kya daily same chij unki b family or social life h vo b socho na thodam.daily public ki safety ke liye din rat kdi rhti h ....sayd unhone paap kiya jo police m h", "arifmirza_": "Good Job Mam❤️", "lion_el_suresh": "It hurts to see the how uncivilized our police is", "itsrahulchoudhary": "KUDOS TO DELHI POLICE! 👏👏", "bhushanbiswa": "😢😢😢", "homaymalik": "Very bad", "rawat__vivek_": "No offense but mam ek baat bataiye agar University ka protest tha to university se bahar kyu laye or lag laye to ye unki responsible nahi ki vo apne protest me koi outside allow na kare or agar kar bhi diya to police pe Ist attack kyu kiya or kiya bhi to outsiders ko allow kese kr diya University me .. or ek baat bàat puri pata na ho to udta tiir nahi lena chahiye.. aapke nakli akhtar Sahab ko to act ke baare me bhi nahi pata or ye to siraf non indian Nationality ke logo affect kar raha hai..🖕", "summitvishwas": "Seriously.. isse pata chalta h.. tera uper wala mala khali hai", "kumaro51995": "So don't create any disturbance", "ajlinder_kaur": "Oh miss @reallyswara , kash aapne dusre videos bhi share kiya hota, jismein yahi log pathr maar rahe h, aag lga rahe h, Ahmdabad, U.P wale video share karo. Jao pehle theek se samjho act ko phir koi post karna. Tum logo ke aise hi post logo ko uksa rahe h. I am unfollow you, n baki logo se bhi request karungi ki un sbhi ko unfollow karo jo aise afwaye feyla rahe h like you.", "depinocean3": "@reallyswara Why you seeing half glass empty..check and also post pictures of lighted vehicles by protesters, after which police and govt had to resort to force. Do you think peaceful protests ever get such treatments,i haven't seen so. And if people want to take out their anger by burning vehicles of govt and common man, they shall be dealt with equal force or else this country will continue being what it is", "jay_sh_vaghani": "Lovely", "yash.parashar3003": "Then just give some space to illegal immigrants Bangladeshis in your house you morron..", "fact.it_": "OR DARYAGANJ KI video dekhni h to vo dekho live thi puri media pure din s, un protestors k sath jb gaadiya phoonki unhone police station k bahr tb l water canon use hui 👍", "kanchanraoo": "Wtf! Peacful😂😂😂😂😂! Ghar pe baith kar ye bakvas ki kar sakte ho tum! Sallo kutto tum kyu lete ho police protection fir! Police chutiya nahi hai jo tum jaise logo ki bakwas sunegi! Sahi kar rhi hai police! Jab tere ghar pe or tujpe pathar pdenge na tab dekhnege kaha jayegi tu fr tuje police yad ayegi! Police ko toh tumjaise celebs ki protection ko hi boycott kar dena chaiye tab smjh ayegi police ki value tujhe! Bloody! Silly idiot women", "vicky.tak": "Beautiful 👌😍😘🥰", "shen_uuu": "Some ppl r so so so clueless of what's happening.. man c'mmn open your eyes and see.. CAA and NRC has so much cons than pros.. the ones supporting the act are fools but nothing else.. andhe bhakts now I know why u r all called that.. truly u guys are blind... 😑😑", "deepantivaid": "Tum public property todoge toh police ghar me ghus k bhi maaregi", "iam_sunitjain": "@reallyswara you mean they keep burning Delhi and Delhi police just needs to watch it? Why you always spread hatred? Kabhi kanhaiya ka sath kabhi ye? Do your job in film industry na but dont speak rubbish about India.....", "harshit_chauhan.messi": "Tum bhi swara ji pit jao jake vha achha rhega", "vishal_uppe": "Jee baat 🔥 unko bolo ghar jaake padh ke aaye pehle ....chutiyo ki baat sunke protest karne aa jaate hai", "iams558": "Changle", "ritika2009": "Maaro saalo ko, yeh mulle hi toh saara bakheda kar rahe hai and baaki chutiye jud rahe hai tere jaise baapchod celebrity ki wajah se. I am ashamed of you! @reallyswara I condemn every word that comes out of your filthy mouth to just poison people.", "rahulapt90": "There is no need of this bill.this is only to create polarisation in the society and divert people minds", "dheerajsihra": "पिक्चर नहीं मिल रही तो लगता है मैडम राजनीति में आना चाहती हैं", "kamal.sumal": "Very bad", "kulveerraj": "Peacefull haa@reallyswara tume video nai dekhe jaha police vaalo ko maar rahe h??", "aakash09__": "You motfk don't you see when they pelt stones?🖕🖕🖕🖕", "bilalkhan1777": "Disturbing😔", "vipin4910": "एक लठ हमें दो फिर बताते है। शुरुआत तो आप जैसों से ही करूँगा। जो नफरत फैलाय जा रही है। घटिया आप की सोच", "miss._mohan": "@swa then you must also see how public is thrashing and throwing stones on Police.. and what is the need of destroying govt property!?", "kill_me_or_die_of": "Bahut maja aaayaa😂😂😂😂😂😂😂 yhi hona chahiyee in pathharbaaj atankwadiyo ke sathh", "nrkp_777": "तुम्हारी अब मूवी कोई नही देखेगा एक भारती तुम भी चले जाओ अब आंदोलन करने कोई काम नही बचा हैं। आप के पास तो ऐसे लाइट में आओ #i_support_cab_nrc", "imran_junnedi": "Shame😢", "vijaykumar299895": "Support CAA", "sneha_2279": "Don't viral such videos .. Threz no truth in them .. All fabricated", "aravindanumashankar": "Shocking", "naveen612": "You will always show only one side of picture try to show both side point of view", "iamchaythu": "Absolute ridiculous Govt ... Why don't the duo answer the people and convince them and then u can pass the bill ... But what is this ... Just Buldozing ... If the duo likes then everyone should follow .. if someone opposes they will e treated like this ... when our Beloved country, The Greatest Constitution of the world's fate will Change ... Save This country from these kind of Politicians and their Policies ...", "nitish1731": "Dil zit liya dehli police ne", "drkhushbuthakkar": "As a celebrity first of all you have to understand the matter and then post anything pls.Police doing his duty ,they can't see these crucial things what these people doing without knowing or understanding what is CAB or NRC just like you.", "justin_osama06": "@reallyswara this is bahraich Uttar Pradesh, not in delhi..", "meenu0802": "@reallyswara Mam every coin has two face.. Ek ko dekha aur comment kar diya.. Yeh to accha nahi hai.. Jab police walo ko marte hai tab to aap video nahi share karte ho... Please ek baar dheko aap kya sare kar rahe ho.. Log aap ko ideal karte hai..", "akujain1919": "Stop sharing such video", "rahul_kumar511": "Nice one guys jab yahi log police par pathar chalate hai jaise wo koi janwar ho tab aap log chup Q ho jate ho. Wo bhi to insan hi hai", "instafam_1412": "Ok", "bful_me": "@reallyswara ppl like u r educated gawar who are expert in giving false news", "kumar8115": "Sad", "atulsharmauae": "Madam aapney horrifying videos dekhey hee kahan hai, .... aap bhi bhadkau janta hee ho, wohh videos dekho jaha ek police waley ko poori public maar rhi hai... yaha tohh police sirf apni duty poori kar r hi hai.", "fapale.m": "Jara AHEMDABAD ka video dekh lo or ek video unaka bhi dal thodi bat unki bhi kar dijiye...just watch news and what happened in AHEMDABAD protest protesters are pelting stones police we have proof.just chek it out.", "rickypatel1541": "Maro Deshdrohi oko", "shubhamrajak04": "To wo protestors Shareef hai Kya?? Jo in public servants pr patthar fek rahe .", "azard_xd": "Guys before protesting think India has only banned the ppl coming from outer world why do we care about those who don’t live in our country why ppl want to make it a mess first read the bill what it says it says that “immigrants Muslims from the other country will not be given citizenship” pls check and then raise ur voice #standwithmodi @narendramodi", "big_hair_dude": "Have army men been deployed in Mumbai?", "nashra.hashim": "@reallyswara More power to you lady. We love you 🙌", "ravipremyadav4041": "Madam police pooja nhi krti pelti h, kanoon todega wo pitega tumhe bhi lathi pdne chaiye bheed ko badkati ho @reallyswara", "ubaidsk95": "Haraamkhor police waloan 🤬🤬🤬🤬", "mantug5388": "@chandra.obulareddy.3154 Don’t call her ma’am. She’s a pathetic woman. She is congress chamchi. Unpad aurat hai woh.", "pankajchaprana01": "gauharkhan animals ki disrepect mat karo en se compare kar ke vo jis ka khate h us se wafadar hot h or ye salee to us orat ki tarah h jo khati tumhara h or nan mataka padosi ke sath karti h LIBRANDU'S", "jamalsanawwar": "Sharm karo DP", "borntorule1204": "For the time being, dont post anything related to this. Sitting on sofas and having an easy life with all amenities and posting these wont do any good. Want to do something ? Maidan me jao🙏", "fareed.iqbal.35": "We r with u mam", "himanshuji111": "मैम पहले बिल को पढने की आवश्यकता है आपको।।", "gaurav20081986": "We saw how peaceful it was", "braddy_whispers": "Ohh relly? Do I need to show you your so called studious gangs anti Hindu slogans? Stone peltings? This is just coz of liberandus like \"YOU\" that Bengal is burning. Dare to do such in Bihar or UP or Jharkhand. Thrashings shall be mandatory. Sab bhadwo ki qabar khudegi HINDUTWA ki chaati par 🔥", "pop_music_11": "Teri ma ki... Sali randi.... Desh me raha ke desh barbad karti hai... Jake Pakistani ban ja bc", "pinchu_prashansha_tiwari": "जिसका जो विरोध है वो करे अपना उससे कोई लेना देना नही है लेकिन विरोध के नाम पर जो देश जलायेगा तो भाई उसको तो सबक मिलेगा। कुछ लोग तो सच म विरोध कर रहे हैं पर कुछ नीच लोग विरोध की आड़ में बस देश को स्वाहा कर रहे हैं जो नई बिलकुल बर्दाश्त नहीं किया जायेगा।", "anjannwd": "@reallyswara I am your great fan.. The way you are fighting to save our democracy is really great endeavour .. God Bless you...we dont need NRC and CAA.."}