{"shrutidhand": "Aap. Jaise log honge to desh ka yahi haal hoga. Bahut sahi photooo lagye ho", "prabha_m67": "Worst post", "sivaprasad.kundanam": "How cheap....", "wholalitdalmia": "@sadhguru Give her some lessons", "ashish4.0": "Sikal dekh lete pahle apni ,", "srinath.ganiga.74": "Cheap very cheap", "the.splendid.life": "That's your fucking mindset that you Are looking this way. 🙏please stop brainwashing people @reallyswara Be a real citizen 🙏 read the full CAA bill. (agar pdhna aata h to*)", "hindian_siddhant_gupta": "Agar bhagwa rahega to hi national flag me teen colours salamat rahenge warna @reallyswara jaise log pure desh ko sirf GREEN banakar chorenge.pura desh phir se BHAGWA ho kar rahega,koi kuch bhi karle. SUPPORT CAA & NRC", "__itsrealhindu__": "🚩🇮🇳🇮🇳😎🕉️Hindu rashtra banakar hi rahenge kuch bhi kar lo 🚩🚩🚩🚩🚩.....", "_bkavyastic": "Stop acting like a Nationalist liberal!....Everyone knows the reality...But, tell how much money did you get for doing all this!!#pfikapaisewalaprotest", "studd_aman": "Meanwhile: paisa insan ko dogla bana sakta hai... GYAN : desh k tukde hue do bhag hara hogya, ab bacha khucha Hindustan bhi tm hara krne chle bhgwa ko badnam krne chle", "terababu92": "Bhenchod kiyu gand marvati h idar pakistan ja marva udar", "samarth748": "Tere ma ka bhosda", "imsagarbaraskar": "Randi sali jai shree ram 🚩🚩🚩🚩", "sooraj_salian": "Tu nikal India say", "miss_panda_here": "Wow!", "amanansari352": "👏👏👏👏👏👏👏👏", "parnav_bhatt_99": "Kitne army walo ke ghr gyi h tu chutiya", "jeet_m77": "Tum kuch B karo 100crINDIAN tou HINDUSTANI HAI", "chhagukumawat": "JAI MAHARANA PRTAP Bhgwa RSS", "dpzz___143": "❤️❤️❤️", "hemishshah11": "Insult of indian flag ! Labours instead of ashoka chakra !", "kalpesh_ptl_": "India support CAA", "shridharhallur": "We know what the govt is doing. you are one of that thudke gang and you don't deserve to be here go somewhere else", "md_salahuddin_15483": "Lovely", "shashank_sam24": "Hindu rashtra ban k rahega hamara bhaarat", "acharyaaishwarya": "Are you insane... ye kya mazzak hai", "yuvraaj__07": "Jitna azaadi chaiye mangte reh dekhte hai bhagwa jeetega educated secularism😂😂 abi tk kuch ni kr paae phr bhi halla bol aage se bhi peeche se bhi😂😂", "ronit_398": "Yesb krne se na movie milegi na tkt 😂😂", "thezamirsk": "Sabka khoon hai shamil yaha ki mitti me", "lovechouhan_janu_8567986553_": "Love", "rajputana___manish": "😂😂 people beyond here these people seems to belong beyond redline or from redline areas", "hersheholic": "FYI, this is a punishable offence. You can’t distort the flag.", "jai_lankeshwar_108": "Randi sali", "king210289": "GSTi teri ben d fudi mari", "khufu106": "india support caa sbko pta chl gaya he kitna mislead kiya he tum logo ne caa pr pgl ghatiya sasti randi", "kiyashajha": "Dude I hope u know saffron in Indian flag don't determine Hindu or Indian flag don't determine Muslim @reallyswara why the f*** you want to create a stupid danga if you don't it know the total meaning or understand the total meaning of The bills NRC CAA & CAB then shut the f*** up", "faxqix": "💖RESPECT💖", "sharmishtha_g": "Quiet evident how educated JNU students are in reality.,they don't even bother to study the Act they are protesting against!!!", "codexexex": "जय भीम 🇮🇳🇮🇳🇮🇳", "pulkit16521": "Lets show her our power , unfollow her and let her followers get back to 1k only.", "_my_name_is_affan_": "❤️", "gsahni83": "It should be upside down", "shakti_nation_first": "🚩🚩🚩😉😉😉", "rish_24_": "Aunty sharam krlo thodi flag k colours caste religion ko show ni krrha gawar aunty Pdhi toh Kch hi nhi tm jse logo ko bich road m nangaaaa krwa k Marna chaiye liberendu terrorist", "wakeup_bharat": "INDIA support CAA", "20batoolm": "United we stand, divided we fall!", "khot7160": "Ek din jaroor pura colour Kesari hoga", "nik11002": "Ek baat bta cab or NRC se kisi Indian ka Kya ghata h ..... Or Jo police walo pr attack krega wo to thukega he...fir jahe wo jamia ka ho ya tu khud....... Abe gawar aurat pehle jaan to le ye caa or NRC h Kya", "aliahmad_19": "Ye desh jitna hindu ka utna he ek ek inch utna he Muslims ka Jai Hind", "azam_ali8": "Tysm❤️", "ju_mi__": "❤️🔥🔥🔥🔥 constitution can be only held up with a spine. Thankyou 🌼", "pranay4u": "Shame on u suara.", "jcjdbhhh": "Saffron colour, indicating the strength and courage of the country. The white indicates peace and truth with Dharma Chakra. green in colour shows the fertility, growth.", "vanshsrivastava7926": "❤️", "ayush_aman__": "Pseudo LIBERAL PEOPLE'S @reallyswara", "itz_suhailaslam_07": "Brilliant", "dhruvupadhyay_": "Relating colours to religions are ridiculous. Our Flag is very meaningful. You'll not get it @reallyswara.", "a_classic_guy": "Aa gayi koi movie to milti ni hai isko ab 😂😂", "being______salman": "🙌🙌🙌👌", "tagoregraphic": "Ye mullo ki aulad ha", "singhkushagra5499": "Such post is what you can expect from unemployed swara Baskar", "shhaayar": "मैं बोल रहा हूं सत्ता के ख़िलाफ़ शायद अभी थोड़ा सा ज़िंदा हूं।। @reallyswara ❤️", "sushant_thakur___": "Lage raho..vele 😬", "itsadityaparida": "Dawood ne kitne paise diye.. logo danga karne k liye uksane k liye...", "chauhanritiksingh": "#swarabaskarfoolishlady", "darc_ace": "Yeah keep pushing it up so green flaggers will invade country one more time!", "yatra_yogi": "काम है नही इसके पास...फालतू बैठे बैठे क्या करे ??? इसे CAB & NRC का मतलब भी नही पता उसमें लिखा क्या है जिसने अब तक पढ़ा भी नही होगा । इसको बस सुर्खियों में रहना है । इसे वही आता है । @reallyswara", "nayeembiz": "wow", "satish_9912": "Q", "karan_sinh_1700": "Cab or nrc ka meaning bhle na pta ho pr paisa mil gya hoga party se nachniya ko bhot h", "itshfxvn": "Bollywood mai underworld ka paisa lagta hai isliye yha k bhadwe log ko bhawga se dikkat hai"}