{"_ra_va1": "Public who protest in Sahin bagh they get 1000 per day and two time meal in a day and swara Bhaskar get 1000 of penis eveyday because she have too many Hawas", "samaritan_soul_0707": "You know @reallyswara I felt like puking at your face once I started seeing your ig posts .", "kunal_khandalkar_kk_": "👎👎👎👎", "s.1.d.d.h.a.r.t.h": "Pagal aurat", "rajatshakhary": "mother fucker swara", "why_so_serious_hahaha_": "Hate Speech🤣😂💯", "urangana4": "@really swara should be arrested first not Kapil Mishra. She clearly Wins in spreading hatred and terror amongst people. It is only because of the Azaadi she has in BhArat that she goes around making such disgusting and hatred filled speeches against her own country.", "_crazy_prathu_": "#supportcaa#nrc #npr", "miss__ssharma": "Ab nhi aayi aap Shaheen bagh m visit krne🙂🙂...kaafi tym ho gya yaad kijiye unko or aayiye phr se ya B's itni hi publicity kaafi thi,🙂", "shivam_sharma_03": "Khanhiya ne mari hai iski puri rat 😂", "deepanshi._.bhardwajj": "Nikl yha se kutiya", "tatiyabhushan1234": "O bhenki nrc aayega or tum jeso ki gand marke jayega", "avaish_pathan_official": "Ek asli hiro", "amit_p98": "Tu ek number ki rand hai madharchod sali @reallyswara", "ritikprajapati002": "Randi", "yourdailyfantacy": "😂😂kutti sali", "ashu_vyas____": "ग़द्दार", "mahen2570": "Kashmiri pundit logo ke liye constitution kaha He. Bata", "sharmisthapant": "Female terrorist", "sunny.bindra1": "Attention seeking b....", "vishva_233": "Opportunist", "wardrobe_malfunction_bollywood": "Randi saali", "kadeerqureshi": "Salute maam❤️❤️❤️", "tasleem9169": "Piliz follow me 👍", "gautambhardwaj555": "Kahan se aate hain ese backchodi karne wale log ye swara bhaskar nahi bolegi kasmiri pandit k bare main unko toh in Islam k dalalon ne ghar se nikal diya tha en mullon ko toh abhi kisi ne touch bhi nahi kara aur aap dar gaye sali raand k paidaish ho tum kabhi kasmiri pandits k liye bhi awaj laga do ager dum hai toh I challenge you sala sirf Islam ko support karna ager secularism hai toh hun main hinduwadi bahanchod nahi banna in mullon ka dala ager dum hai toh mere baat ka jawab de do Swara bhaskar... Main bhakt nahi par desh bhakti karta hun dum hai toh reply kar.....🔥🔥", "emaadeshk_777": "Abe oyeeeee anpaddddd", "ravina_bothra": "Sabse pehle ishe nikalo..", "mubashsharayyubi": "We love u we support u hum apke sath h ❤️", "x._suraj_.x": "Sala pura Mumbai me gali de rahe hai tere landi hai tu landi", "i_am_piyush_rai": "Once 1988 born great mathematician said : main 2010 me bs 15 saal ka tha 😑🙊", "cma_rsharma": "Tu bhi yha baith ja..biryani b mil jaegi @reallyswara 😂", "rashmii001___": "Tu bhi baith ha saheen bagh me 500 milne lagege😂😂😂", "imakkuz25": "सुवरा BC 🙃", "amendra_vaghela": "Pakistani or bangladesi ke sath tume bhi nikalege", "rk_rajeev_jha": "Deshdrohi Gaddar Namakharam @reallyswara", "priya_1807620_s": "Bhosireke tu muje bataega ke meri jagah kaha he madarchod hamnlog chutiya nahi he teri Maa ko chodddd denge sale samne ayega na to lund to tera kaam nahi krta pair hath bhi todh denge bhosirewale pakistan tu ja makelode muje bata raha he teri Maa me bhi dam nahi jo muje Pakistan bheje teri Maa ko choddd dunga behen lode", "_rakshit99": "Bitch's wildin lmaoo", "amit_hunasagi": "Funny😂😂😂", "_shoaib_shaikh_jj": "Ham ek he❤️❤️❤️❤️", "hindu_pariwar_": "Aawaaz doh yha g**d kuch nahi hone wala!", "sonam.dahiyaaaa": "Boycott her movies #antinatalism #wesupportcaa", "sidhusankle": "👎👎👎", "thejoblessindian": "You are Anti Nationalist 🇮🇳🇮🇳", "vandana_a_singh": "Chudail...har jagah footage lene poch jati hai..🤣🤣🤣", "zeenepoozaanzeenezeeshan": "Trust me you are one very cute sweets lovely beutiful hardworking strugul full and solid woman ms swara", "ssidagrwl": "The only source of income left for her now .. poor you", "kushal_navandar": "Pehli fursat me nikal yahase", "aman.vatsalya": "Iss brr election m ticket ni mili kya ...Koi ni hard luck ...try nxt tym...ultimate aim to whi hoga n ki fame mil gya yhi sb krk abb tickt le lo", "kubhupendrajodha": "Ab tum shaheen bagh ki bibi jaan ban gayi ho , ab no respect for u", "_imshrishti_": "@reallyswara ladai pointless ho na usmein lada bhi nahi jaata na jeeta jata hai.", "rebounder011__": "@reallyswara earn through your acting proffesion , not like this if u really feel bad then start giving money to those people who are in a need of help.", "prasad_palli": "🔥🔥🔥 Zaira Wasim also wants Azadi from radical Islamic lows 🔥🔥🔥🔥", "krishna4886": "🖕", "akki8rules": "@reallyswara kaniyha kaha a,usko saath nai laayi?", "aalisha.solanki": "Tuuu kisi atankwadi se kam nahi bc😂😂😂😂😂😂😂", "abhi00938": "Behen ki lodi sawara bhaskar", "m_hussain_star": "Hum Ek hai 🇮🇳", "vijay_singh__11": "चिल्ला ले।कुछ होने वाला नहीं।", "avithakur6789": "Shame on you for opposing CAA, an act of humanity", "karn3849": "Fucking morons dont even knw abt dis amendment bill..bs bhauk rhe hai publicity ke liye..", "bhavuk.anand9": "👎👎👎👎👎", "vishuu2689": "Chudel is back 🤣 Google pe padha kuch", "sanskar_mishra_00": "Stop burning our country in jamai what happened. In jamia no student is there all are just desh drohi stop protesting if we came to protest then what is good to happen you all have seen today", "gaurangjoshi1987": "Thode din ruk ja fir hum dege tujhe aawaz", "idpsh": "CAA to citizenship dene Wala act h na hi lene Wala", "garg9148": "😂😂😂😂", "keshavf1": "BJP waale itni zid kyu kar rahe hai CAA ko lekar... ek change kar do ki any refugee is welcome. Sara panga khatam ho jaayega....", "harkirpal_singh": "Maa chudao aap please", "tarackdass": "R U MUSLIM ?", "pushkinbhattacharya": "AFZAL hum sharminda,hai ....tera BC Bhai Sharjeel abhi bhi zinda hai😍😍😍😍", "shoyeb_sheikhq": "Salam hai meri aisi bahen ko", "chirag_patel345": "Nrc npr to hoga hi bosdiki madarchod swara", "hasanhasnain56": "Dil se salam swara sister", "sassysaswati": "Pls be at ur profession.. there are people to run country who are best at there job.. we need citizens to be registered.. so that we can count and work on progress..while you take passport to all over world have you though to shat and should “Azadi from passport “ .. tell what u do", "aarzoo138": "Great ,mtlb wahan sirf librandu jaa skate hai ? Kyunki bakkiyon ko to \"not allowed\" hai na?", "suhailahmad5703": "Hum leke rahenge aazadi inqlaab zindabaad", "sidv1425": "Loduchand", "theflyingbirdie": "Nobody will support a fool like you. I never hated any person but by seeing the mean things you have done I can't resist myself from hating you. Please support once for the people's sake 🙏🙏", "harsh_vardhan_kaushik_": "Bawligand", "himanshu.singh55": "Teri ma ka bhosda madharchod", "k_4_k_a_r_t_i_k_": "Aise bhi teri film kio dekhta hai nahi upar se tu inko support kr rahi hai..Teri aukat dikha denge teri agli film mai...", "vikas__bittu": "Aawaaz doh or mu me lo 😂😂", "manishprakashk": "💞💞 शेरनी हो तुम स्वरा 💞💞👌", "baneshdangwal": "Vibrator......", "sonaliamer28": "Sali ko ab movie mey kaam bhi nahi milega..", "_het.shah": "F**k off from our country!", "rahil_qureshi73": "❤️", "omkar.bharat.sangale": "Chutiya", "innocent_zaid_khan": "I m proud of u @reallyswara Mam ❤️", "shrimantroll": "U r deadlier than corona virus.", "jaldeepshah": "Shame on u . Kutti chize hei tu", "qween__girl_saziya": "इंक़लाब ज़िंदाबाद 🔥", "vishjustified": "Just waiting to see after election situation", "shru_moh": "❤️", "divyabhay": "U r mad now", "mr_aryanpathak": "Lawdi shakal ki aurat😂", "laxmanshekhawat_9": "isko bhi dedo aajadi isko kaam to milta nhi haj berojgar hai bechari", "gopal_bamalwa": "😆🖕", "pushpendra0045": "Sabhi log unfollow kro re saaali pagal aurat ko", "rajkundaljaya": "God bless you Swara ❤️❤️", "aniket_uk": "Behena tu bass aise hi chillate rehena \"Azaadi Azaadi\"... Aur hum firse kahenge... Mota bhai tum next resolution konsa lane wale ho??? Ho sake to inko jo \"Azaadi\" chahiye uske baare me bhi soch lo 😂 #isupportcaa #isupportnrc", "sharmavidushi55": "Ab iss cheez ko kehne me koi do rai nhe ki iss desh ki ek community k liye srf mazhab he sb kch hai na ki desh ki ekta .........vo na kbhi yaha k the na kbhi ho skte hai", "xrandhirx": "Desh drohi", "tabrezkhan_officiall": "You're the best @reallyswara 🇮🇳🇮🇳🇮🇳🇮🇳♥️♥️♥️♥️", "beats_boy_pori": "Abe kuch ni hone wala kuki tum glt ho ,Mota bhai ghanta htayenge nrc 😂😂😂😂. Kuki tum glt ho tumara allha bi sath ni dera tumara", "sbspbr": "❤️", "muhammadmaihu": "❤️❤️👌👌", "khan_irfan777": "Great dear", "deepaksingh71299": "Aunty tumse na ho payega🙄", "dhanraj_dodia_702": "Fuck off", "umar_hayatt": "Sher h Tu sher @reallyswara ❤️", "danzilthomas": "😵", "abhay061294": "सोचा ना था कि एक वोट इतनी ताकत दिखाएगा.. हम घर में आराम से बैठे हैं और उपद्रवी महीने भर से सड़कों पर.. 🇮🇳💪🏼🤝🇮🇳", "shaikumair": "Haters are making you very famous swara ji..!", "sudattajangam": "कॉम्रेड, साथी,ईंकिलाब झिंदाबाद👏👏👏👏", "vivekjais1210": "Delhi Ka election hone ke bad sb ko azadi Di jauegi wait Karo", "imrohanprasad": "didi ke sharjeel bhaiya ke G mein toh police wale danda ghusa die kya pata aapka number kab ayega", "avinashsharma9355": "👎", "kabirchauhan865": "Begusarai ki tarah jitoge", "sibasisdutta": "Iski naiyya to dubi", "gmkbiswas": "👌👌👌👌👌", "ankit_kungaria": "dikhe h madam ne congress te ticket chiyey.. re bawlibuchh.. apna sapna Pakistan m pura kr..", "swamiraj2021": "Kitane mile tuze... 500/- ya 700/- Vaise teti aukat 150/- ki hai... kyon li teri filme koi free me bhi nahi dekhta TV per", "yashbhardwaj161": "Tum madarchod ho", "sheikchanchal": "Swara-j ❤️❤️", "gms_official1072": "Indoriisss are also waiting....💝", "concormanish": "आंटी आप कब आई", "iamparthamaity": "Wonhi pe tera kabar banega", "neeraj.james.singh215": "Fir se chutyapa", "jalebi.bae": "🔥🔥🔥🔥", "varun_the_devil__": "Ghanata kuch nhi hone wala tumse i support CAA NRC NRP 💪🏽😎TUM SABKO DEGNE AAZADI", "tiwariamit22": "Hum de kar rahenge azadi...goli maaro saalo ko", "mantug5388": "Ek number ki gaddar aurat of India. @mirzasaniar", "_hanzala_saquib_": "🔥", "im__arshinaaz": "i love u mam u r very good person aapne shi aur sach ka saath de rhe ho🌸🥺♥️....we r with u ♥️", "altmas19_": "Allah aapko or aapki tamaam kwahisho ko Qubool farmae... Amin", "pradeepchoudhary966": "😂😂😂😂", "kk475678": "Serjheel ne bhi pela isko ..👏 😂😂", "priyankdas_": "Talk about sharjeel imam! Why you ain't shouting now on that little impotent man child?", "ajaystylz7865": "Tujhe to ek sath sab aa jaye tobhi farak nahi padta.", "vimal6261": "Failure government", "nnd_h3r3": "Neeche jitni ladkiya khadi hai sab ne sir dhakke huye hai aur tumne khole huye hai aj vo tumhare sath hai kal ko tumhe bhi jabardasti dalna padega jo tum kar rahi ho aur un se pooch lena kitno ka hala la huya padda hai", "thoryankita": "💓💓💓💓", "raj290078": "Chal be pagal ho gayi hai kya", "ashishgupta5181": "भगवान आप को सद्बुध्दि प्रदान करे।", "sudhirsiddhu": "Plz don't comment and motivate her.. let her alone ..no likes and no comments..😱😱", "pdhiman007": "देश के गद्दारों को, गोली मारो सालो को,,", "suddenly_sparrow": "Such a beautiful picture to be on the inter webs right now! 🙆🏽‍♀️❤️", "thakurishant98": "Ooo aunty .. lath khane ka shauk h kya", "aayat4368": "Brave girl 💯💯💯💯", "pratyush_gupta_45": "Tujh jaisi nihayati ghatiya soch rkhne vli actress maine ajj tk nhi dekhi jo muslims ko bhadka ri , just for fame , arey swara jara dekh , bacche bhi h inn sb m , unke mindset pr kya asar pdega , not expected from u , antt m ghanta tujhe kuch milega , sudhar ja aur india ko shi knowledge de.", "shagun_dv": "pehli fursat se nikal", "u_k_1427": "Salute👏👏👏", "priyanka.2008singh": "❤️❤️❤️❤️", "asifansari6691": "Keep it up ....", "iam.vickyjain": "सैफ अली खान से पुछा गया कि आपने अपने बेटे का नाम दुनिया के सबसे क्रूर-कातिल के नाम पर क्यों रखा? सैफ ने कहा- जब इस्लाम मे कोई विवेकानंद, बुद्ध, महाबीर, चैतन्य, रामकृष्ण आदि पैदा हीं नहीं होते तो फिर कहाँ से ऐसे आदर्श नाम लाउं? इस्लाम मे तो तैमूर, औरंगजेब, चंगेज खाँ, गजनी, गोरी, दाऊद, ओसामा आदि ही पैदा होता है, तो फिर इन्हीं हत्यारों मे से किसी एक नाम को चुनना हमारी मजबूरी है। उत्तर मिला - लेकिन दारा शिकोह, अस्फाक उल्लाह खान से लेकर मिसाइल मैन ए पी जे अबुल कलाम तक भी तो इस्लाम मे ही पैदा हुए आप उनके नाम रख सकते थे? इसपर सैफ का उत्तर बहुत ही आश्चर्यजनक था। सैफ ने कहा ये सब अच्छे लोग हिन्दुओं के आदर्श हो सकते हैं, इस्लाम के नहीं। आपने किसी मुसलमान के मुंह से इन आदर्श लोगों का नाम कभी सुना है ??? 😨😨😨😨✔✔✔😨😨😨😨", "superstar.sufi": "Real and brave women @reallyswara", "mohit_sharma_ddmft": "@reallyswara pdhi likhi ganwar😂 jisko filmo me kaam nhi mil rha hai. 😄😅😅😄 or tv walo ne btaya tha tb pta chla ki tu b Bollywood me kam krti thi vrna mene to shakal bhi nhi dekhi... or ab dekhi hai to galiya nikal rhi hai muh se ki tujhe kaam kisne de diye😂😅😆 tindde jese muh ki", "amjadikram": "💕", "st4u79": "8 feb ke baad aa jana ajadi baanti jayegi .thok ke bhav main .ha ha ha", "saksham_485": "Haa haa ruk sabko milegi azadi.. Saalo jihadi", "jainravikumar": "U are mad . Desh ko agh laga rahi ho", "paramkhakhana": "🤓🤓🤓", "krishna_sai_ka_diwana": "Standing with tukde gang in the name of constitution...shame...shame", "showmetheravi\nVerified": "Verified", "freakoffitnesss": "Ye koi randikhaaaana hai????🤣🤣🤣🤣🤣", "baahubali.khan": "💕❤️", "sanjaythakur499": "😡😡😡😡", "panks008": "O swara ..yrrr kb tujhe sharm aayegi...baap tera army officer or tu Shaheen bag Mei logo ko bhadka rhi...such a pity....tujhe keede padenge....sad sad kr mregi tu...traitor... boycott swara...", "unaiza_abbas001": "\"..Hum Ek Hain\" 😘😘😘😘......loads of love and respect to you sista........hatts off to your brave👏🏻👏🏻👏🏻👏🏻👏🏻", "mdsameer1884": "Mam Aap muzaffarpur bhi aaiye ....", "imsingh9": "Kitne mile aaj?? 500 ya 700😂", "sucheta_nag": "❤️", "nish_hero": "😂", "shamimzhcdu": "Really your a great lady❤️", "5hubham_k": "Cheap publicity", "ashishmishra4348": "Bhag madarchod sali 500 rs lekar biryani chat rahe hai sale dogle madachodr", "mmushrif": "Amazing spirit mam👏", "bhanushali8007": "Bada kuch honeymoon honey wala hay....Hahaha", "shivankar__": "Its sad that when some reporter is beaten up for coverage and some \" \"azadi gang\" is allowed to enter 😂😂", "sachinjoshi77": "😡 *#केजरीवाल भगाओ दिल्ली बचाओ...* *लोगों ने केजरीवाल को #अन्ना_समर्थक_समझ_कर_दिल्ली_सौपी_था, वो तो #जिन्ना_समर्थक_निकला ! केजरीवाल को गहराई से समझने की आवश्यकता है !* *बताओ...* *केजरीवाल ने...* सेना से सर्जिकल स्ट्राइक के सबूत क्यों मांगे ? *बताओ...* कन्हैया कुमार पर केस चलाने की अनुमति क्यों नहीं दी गयी ? *बताओ...* निर्भया के बलात्कारी को सिलाई मशीन और 10 हजार रु. क्यों दिए थे ? *बताओ...* मस्जिद के मौलवियों को 18 हजार महीना देना क्यों शुरू किया और मंदिर के पुजारियों को एक रुपया भी नहीं ? *बताओ...* JNU छात्रों के समक्ष आप नेता अमानतुल्लाह ने भड़काऊ भाषण क्यों दिया ? *बताओ...* केजरीवाल सरकार ने CAA का विरोध क्यों किया ? *बताओ...* केजरीवाल ने ये बयान क्यों दिया... \"पाकिस्तान से आने वाले हिन्दू जासूस हो सकते हैं\" इस नमकहराम को हिंदुओ में जासूस और रोहिंग्यों में अपने बाप नज़र आते हैं ! *ध्यान रखना हिंदूओं...* *दिल्ली में भाजपा ने एक भी मुस्लिम को टिकट नहीं दिया, धर्म युद्ध है भाईयों ! दिल्ली वासियों लाज रखना भारत माता की, राष्ट्र सर्वोपरि है...* *वन्दे मातरम्...*🚩", "champalalmeghrishi": "महान् क्रान्तिकारी संदेश और कार्य हैं आप का जी", "aman_rizvi1997": "👌👌👌", "adil_khan_inc": "👌👍❤️🙌", "vishwas2377": "Same on you", "samarr8076": "Proud of you swara mam ❤️", "jayanitu_mathur": "🔥❤️", "be_like_sady": "Jo log bolte hai inko 500rs mile unki maa bhi 50rs leke bjp rally m jaati hogi.", "bhupeshdhami7": "New destination for fresh posts🔥😂", "prince_mahommed": "Keep continue my bestie😍", "abhishekpundir1916": "Ungli ungli😂😂", "celluloid009": "Hum Ek Hain!", "prashastra": "Inspirational", "indecisive_anurag": "Everyone knows that she is not doing a great job kindly support #unfollowswara", "gauravrana1995": "Fatima afreen a jnu student is saying afzal guru was innocent .....i think afzal is as innocent as a jnu students are", "suryakiran4444": "More power to you 💪", "abbaskhan6973": "🔥", "anubha4983": "Randy saali.", "beingsalmankhan.offici": "👌👌🇮🇳🇮🇳🇮🇳", "chandan0821": "Iske 500 me se 50 kaat overacting ka 😂", "ashish.amte": "Please read the notification of act first then do the protest.", "romeo__17": "🔥🔥🔥🔥❤️❤️", "anurag_bishnoi": "shame on", "aaaaarizzz": "Hum Ek Hain", "wannabemaven": "❤️❤️❤️", "injeela_nuzhat": "U r a hero♥️", "mrrohitsingh": "Slut", "piyush26102": "ये औरत कभी Women card play करने से बाज नहीं आएगी, Feminism कि बिमारी फलारही हैं।", "sameera_dutt": "traitor", "rais8267": "I love you very very much Swara Bhaskar ji", "shital0678": "Bollywood mei toh pit gyi ha ...politics mei bhi pit hi rahi ha ...madam aap apne kaagaz banwa lijiye phle", "shah.malay2006": "yescaa_yesnrc_yesnpr #jaishreeram #jayhind🇮🇳🇮🇳🇮🇳", "rsourabh22": "Tauheen Bagh..", "faheem.273": "Bahut khoob umda zabardast", "hashmiiffu": "Hindustan ki Sherni...🔥", "ashish_pj_17": "Desh ke gaddaron ko, goli maron saalon ko ... #shutdown JNU", "shaikh______junaid": "Bhakt awaz do 🤣🤣🍌", "vedant_11": "500 Rs चाहिए तो Shaheen bagh जाओ। This is the truth.", "chetnachapparia": "So proud of u my dear celebrity...... U r so brave to stand with us and take our side..... It's not about Muslim protest but it's for fighting against lies fighting against injustice.... And saving our Constitution which give all of us equal treatment..... 🙏", "art_of_mobiles": "❤️👍😍", "joydeep_jc_": "Wese Swara g aapko kis Chees se \"so called\" AZAADI chahiye.... ????? @reallyswara", "vishal8868": "Topi to lga leti", "ghildiyalpankaj": "De rahe Awaaz Khali karo mini pakistaan Shahin Bagh Aur Hume jine do 🇨🇮 Jai Hind 🙏", "nidz_khan92": "❤️", "kanabargaurav": "You mislead the public", "pratik.bihari": "🖕", "gawali.pankaj": "Pahile y bataa tu binaa documents veere Dee wedding ka shoot tune Bangkok aur Phuket mein kaisaa kiyaa", "aman_preet_singh98": "❤", "hasnusheikhu55": "❤️", "naveen00011": "We are all one👍👍👍👍👍", "moonisshadani": "❤️👍", "zarlishmirza0": "hatts off to u mam coz u supportng us👏👏👍 love u", "nishiniaz": "😍😍😍👏👍", "shadab__mirza_": "❤️🔥", "juhi_naaz__": "❤️👌", "wahabfaisal1989": "👍👍", "thahir_abdallah": "🔥🔥🔥🔥🔥", "kapse_mahesh": "..", "abedinzainul946": "Brave girl👏👏👏👏", "masterchefashish": "U R REAL DRAMEBAAZ BUT THIS WRONG SOURSE OF EARNING MONEY N POPULARITY. ACTUALLY U R GOOD FOR NOTHING, NOW UN FOLLOWING U BECAUSE U DONT. DESERVED TO BE A CELEBRITY", "dwitipriya_bose": "❤️❤️", "sirajpandey": "Kewal famous hone ke lea desh ko barbaad kar rahe ho ...shame on your parents for such parenting", "riyaz2062": "Vry Good swara👍", "ummulrizvi": "👏👏♥️", "bijaykumarrathore": "इन चूतियों को कुछ काम धंधा नही है बैठे बैठे गांड फूल रही है बस", "amitsaluja1220": "Ae pagal aurat...", "patel_nitesh678": "Goli maro gaddaro ko, jai hind 🇮🇳", "mojuofficial95": "Jai hind", "beingsyedshahnawazraza": "selute swara.is mushkil wakt me awaz uthane ke liye himmat chahiye", "khushbootripathi_myversion": "Apni bni ijjat ki dhajji uda dali", "younuskhan45": "BHAKTHONKI G🔥ND JAL RAHI HAI KOI CHOOTH ME SE PETROL DALKE BUJA SAKTHE BC 😂😂🔥", "fauzia_kham_": "💕💕💕💕💕Love", "thatgrlaashna": "What a posture and your hand glove 😍😍😍 killed it😍😘🎉💜🎉💜❤️💜🎉😘", "nikk_craig": "Next corporator of shaheen bagh", "the_brahmastra": "@hmoindia arrest this lady", "akram.sayeed": "🔥🔥👌👌👌👌👌@reallyswara", "juiceinlife": "Not once did u speak about divisive comments of Sharjeel imam on dividing india. . Which means you only support the same.. All my respect for you is gone.", "sameer_mehra007": "Actress with no work , neither at films nor at home... Only trying to make herself in news..so that no one just forgot..cheap publicity.. now a days it has become trend", "masanjanashar": "😂😂😂😂", "salman_khan1206": "Hum ek hai🇮🇳🇮🇳", "jitpatel083": "Jehadi swara plz stop it apne desh or dharm ko mat becho apne mukam k liye ii hate jehadis", "superstud__sumit": "देश के गद्दारों को.... गोली मारो सालों को... 🔥", "fareed.iqbal.35": "We stand with you mam", "tariqindomitable": "❤️❤️❤️", "zyyynab": "Power of woman 💕", "vishnoi_akki": "Ab to ticket de do bichari ko congress walo 😝", "sahilkhan18155": "Andh bhakto ke papa feku modi ne bharat ki international beizti krwadi America ke 16 shehro me CAA ke khilaf protest ho rhe h London Switzerland Toronto me bhi CAA ke against protest hua 😀", "__v.i.c.k.y__04": "@reallyswara ma'am aapse request h ki aap ek baar eidgah me aaye yha v kaafi womens protest kr rhi h plzz ma'am aap yha prr ek baar aane ki koshish kre ... Shukriya...❤️", "imtiyaz.09": "❤️❤️❤️", "megha0096": "🙌", "bhawnarath": "Sarjeel also visited Shaheen Baug and spoke about dividing India. Did you hear about it or just turned a blind eye? Is that the definition of Freedom? Did you even take out time to condemn it?", "anam.fatima3125": "Hum 1 h against Caa n Nrc", "deepakrathore9677": "Tukda tukda gang👎👎👎👎👎", "________shub_hny___": "रंडी क्या बकचोदी है अगर तू यहा देश विरोधी बात करेगी तो तुझे तेरे इलाके मैं घुस कर मरूँगा मादरचोद रांड झाट का बाल नही उखाड़ सकती तू इन दो कौड़ी की भीड़ लेकर मादरचोद 110करोड़ हिन्दू है हिंदुस्तान मैं 2करोड़ सेक्युलर होंगे बाकी108 करोड़ तेरी गांड मार्के चौपाटी के किनारे फेख देंगे रंडी । मादरचोद इलाहाबाद से लन्ड फेख कर मरूँगा पूरे शाहीन भाग की रंडी और तू सब चुद जाओगे । शुभम पांडेय नाम है । प्रयागराज उर्फ (इलाहाबाद) मैं रहता हु अगर दिल्ली आगया मादरचोद तरीके से आज़ादी मिलेगी रांड साली @reallyswara @reallyswara", "roops_shaikh94": "👌👌👌👌❤️😘", "god_of_thunder1": "Torn flag.......... You did surely see it but not react.......... HOW cheap.", "nitasingta": "💓💓", "omkarbhardwaj7": "hahaa😂😂😂 fuck off..", "anuragkumar0005": "Ye sare log bs CAA & NRC k naam pr apni roti sek rahe h .....inko bs apni publicity se Matlab h .. country se nai....", "adv.zeeshan.5": "They ignored all out protests. They ignored all our voices. They ignored the people of India. This is only beginning, we will take at to the faar end until they will scrap it. They have to and they will. bollywood have powerful voice!! #ProudOnSwaraBhaskar", "razawaris_": "दिल्लीके शाहीन बाग की तर्ज परबिहार के सहरस जिला में भी रानी बाग में अनिश्चित कालीन धरना-प्रदर्शन जारी है। जिसमें 6/2/2020 को कन्हैया कुमार जी आएँगे। आप भी आऐ मैडम जी", "cutest_abish": "Hum ek hain", "virendra_bhanopa": "Bhaag😂", "suyashjain004": "Inko aazadi chahiye gandmaro ko😂😂😂 #gelchodiSwara", "aashray99": "Bhavishya me bhot jute padenge...", "ali_mansoor_ansari": "Full supurrt", "soniaditya1689": "Sali ya hindu hais ya muslim hai bahan ki lori ya larki pagal hai pagal hai😀😀😀ya kabhi bihar aai constituti karna sara log egg lakar jaiga isa marna", "rairahul513": "Madam aap bhi Islam Kabul kar lo fir hame bura nahi lagega aapke is kaam par shame on you...", "lover_terayaaar": "Kuch bhakt milenge apko bura bhla bhi kahen shayad lkin fkr ki bat nhi h rss ne angrezon ke talwe chatae the ye bhi bs whi kr rhe😉", "amey_1010": "Tyranny of the liberal communists, Blocking the road and making life hell for all living/traveling/working in the area just for their selfish motives.", "imkishan49": "@reallyswara “ hm ek hain..”👍", "amit_the_creation": "शाहीनबाग में जाने के कितने पैसे मिले 50 लाख 70 लाख या 1 करोड़। औरत के नाम पे धब्बा हो तुम।", "irshadk060": "Hum honge kaamyab ek din....", "mer30vas": "CAA is just part of larger problem, . But real problem is with NPR - NCR.. With idiotic demonit... With govt bankrupting RBI /PSU..with govt misusing ED/CBI /IT... With mass unemployment... With university /JNU attacks.. With govt stifling our democratic right to dissent... With govt deliberately creating division in society..ever since BJP came to power there's only gloom/doom & chaos in nation", "ankitik11": "We stand wd u", "safeer3333": "👌🔥", "iamanandkankaria": "Publicity stunt 😍😍😍", "pooja.priyasingh175": "Assam ko katenge are assam to kya kahi asa na ho ki dafnane ki bhi jagah na mile", "kafeel.ahmad.18488169": "Aawaz do, hum tumhare sath h", "ajay_devgn_planet": "Overacting", "themusafirband": "Zindabad..", "imrapatel": "Logo ko bharkana band karo", "infinitedreamzzz": "🤣🤣 fokat me khadi rahi yaa paise liye comedy show karne ke", "luckymani2412": "Women have always been more brave than men... You prove it... We are with you", "bhatt_rishabh": "Madam ko dildo(vibrator) de do..... opposition k Politician to ise satisfied nhi kar paye", "sudixit0102": "All protesters now searching for a safe and respected way to exit from this chutiyapa , plz accept communist gang , you all got nothing except बेज़्ज़ती 😂😂😂😂, (dancing car at shaheen baag) #reallyswara", "its_mee_prashant_choudhary": "Konsi party se ticket le rahe ho... 😂 😂... Mere hisab se काँग्रेस se loge... 😂 😂", "duabandeep": "Zyada democracy dene ka yahi natija hai,", "jaindharm": "Sarjeel imam ke baad ab kuch bollywood bhand ki baari hai ye bhi harami desh ko kharab karne me lage hai inko bhi jail me dalo", "kumar_manish09": "❤️❤️❤️❤️", "rizvianjum": "👏👏👏👏👏👏👏👏", "mishra_18_nr": "yaha bhi उंगली ,,", "alauddin6666": "👌❤️", "nagesh2494": "Desh ke gaddaro ko goli Maro salo ko.", "destiny_rulezzzz": "👎", "itsme_luckylv": "दिल्ली ये इनका हक पूरा कर रहे है तुम तुम्हरा हक पूरा करना इतनी ज़ोर ईवीएम मशीन पर vote डालना की करंट शाहीन बाग में लगे🙏🇮🇳", "ajay.anshu": "Pehli fursat mai nikal😂😂😂😂😂", "gauravstoryteller": "नौटंकी बाग", "raj29godara": "With you💞💞", "officialsidsahu": "Kuch kam dekhlo .... Kab tak ye sab karti rahogi 🤣😂.... Wo nahi sunne wala .... #isupportcaa #isupportIndia", "shivzzz_raw": "They wanted to cut down assam and you @reallyswara supporting them you are very pathetic", "thannu_thanseera": "U are just amazing 👍 brave girl", "md_suhaib_khan": "#inqalabzindabad", "therockstar2210": "I am with shaheen bagh 👍", "aditya_gujrati": "In sab ko jail bheho", "sanmotratarun": "₹500/- & free Briyani per day what else is required....", "chetan_tiwari9148": "Nikal be kanjri", "chirag07091979": "Leftists...now it's time to change ur self...if not then ready for results", "_rahul._.soni_": "Free me logo ke talent bahar aa rahe hai.. #posters #banners #quotes #dialogues #shaheenbagh", "firdos_i_proud_to_be_an_indian": "Hum apke sath hai❤️", "aagazakhtar_": "Halla Bol @reallyswara ❤️💪", "itsirshadsheikh": "@reallyswara This is too good brave girl❤️", "aakashhaistar": "Band Karo ye jhut failana", "sandeep7884": "These are idiomatic facts for popularity 😁", "mailanuj25890": "Desh ke gaddarob ko", "tripathytapas": "😀😀😀", "beingsalmankhan.you": "💙💙💙🇮🇳🇮🇳", "warqua_kamal": "❤️", "dayri007": "Randy ortain🙉", "akii_sin": "Yaar..u r just another दोगला..sorry to say it but u are acting like it..m from bihar where were u wen we were facing flood in recent monsoon. u have done anarkali of ara (brilliant performance). n u have not said a single word. .actually its not your fault u have became blind to oppose any decision taken by this govt..", "mr.cricketmonks": "😂😂😂😂", "itsabhiabhi": "JNU is producing Terrorists like Sharjeel Imam,doing PhD,associated with Quint, Wire etc & wants to cut NE from Bharat, having Dreams of burning Constitution. Objective of Shaheen Bagh protest is Partition of Bharat,Agenda is clear by those who are holding Tiranga for Al-Taqia.", "nilesh_sahani77": "Kya chutiya giri hai kuch kaam dhandha to hai nhi bas aganye pade likhe gawar bina documents ke fuck mmm", "avirendras": "@narendramodi government is providing job to all unemployed actors.", "vishal3vedy": "स्वनाम धन्य हुई तुम \"स्वरा\" आवाज दो, हम एक हैं", "_pranaysingh": "The incredible women of #shaheenbagh standing up against bigotry & regression, against injustice & peddler of lies, under harsh conditions. Unimaginable. I have nothing but respect for them! 🤘🏼🙏🏼👌🏼", "konenqureshi": "❤️❤️❤️❤️❤️", "harsh_bhunatar_004": "🤘🤘🤘🤘🙏🙏", "saqlain_zeeshan_khan": "Ham ek hai💯", "hows_the_josh_jai_hind": "Berozgari insaan ko kya kya karne lagaati kabhi deshdrohi banati aur kabhi deshdrohiyon ka idol", "katrinakaifgoddess": "Chal bhag Randi", "abiltoriya": "You stupid ... Shame on you we saw you while cruying for your mom only in University ... You are not with these people you are just taking publicity and supporting your mom students........ Shame on you .......shit happen", "i_am_nwzzz": "Mr @bhardwajgourav And @ashpat007 I'm Indian Muslim I've all documents to prove still I support ban cause i'm feeling insulting that some one asking me for this shit to prove my citizenship I just clicked a Screen Shot of one person here in comment section he is saying that next step would be to hang all the islamists so what is this Mr bhardwaaj don't you've some words for his pent up feelings? Or you're one of'em?? just think what if you were asked for a proving your citizenship? I know your answer would be like!!\" problem kya hai me dikhata documents me support karta \" cause you were never asked nor you'll and you know what!! WE ALL ARE PROTESTING CAUSE WE ALL ARE FEELING INSULTING FOR BEING ASKED TO PROVE OUR CITIZENSHIP", "saif_thealpha": "❤️❤️❤️❤️❤️❤️ u r the one who we call as apnii aukathh se Babar he 🌹the queen", "rashidahmed7147": "Well done God bless 🤲🏻", "fatimaalhaan": "Wow! Gangsta lady!", "9reen_fatima": "👏", "theabdullasiddiqui": "You are great! I think it takes a lot of courage.. Hats off👏👏", "ashutosh_mishra187": "Wait for just one month then sab clear ho jayega .swra too 😂", "sab_279": "🔥🔥🔥", "cooladnan4102": "😍", "zafar_mustahsin": "Hum ek hain...", "12345678.svm": "Thk h hum ek hai na toh ek hi savidhan lagu honga thk. Na toh kashmir ke liye Kyo CHILLA rahi thii hypocrisy dekho bap rey bap bakchodi ka bap", "kanuzsphere": "lol", "professor_thugonomics_": "Hum 1 hain", "nikhilkaushiknk": "#boycotreallyswara", "salman.jamadar.143": "🤗 Allah apko apne Hifzo aman mai rakhe #Braveheart", "alia.maryam21": "👏👏👏", "sanchubaba": "This country is secular because majority population in Hindu ...Mano yea na Mano ye saach ha 🤣", "sayanigupta\nVerified": "Verified", "castingvivek24": "korbo lorbo jeetbo re ♥️🙌", "jaseem_dxb": "🔥🔥👏", "choudharyhaleem": "You Are A Brave Mam @reallyswara", "sheikhaasif8087": "Hum ek hai", "pranavd86": "Ghanta", "yusraa_ak": "Love you❤️🔥", "komalsoniverma": "Respect 🙏🏻", "ankitabisht04": "Love love love swara 💖💖💖", "jerryravi284": "awaz do-sare atnkwadi hn😂😂", "_prem_thakur__": "Kya abii bi nautnki chaalu hai Kya keep it up😂😂😱", "darth_rohan": "So proud of you😍", "itz_me_anas_malik": "Ur superb 👌", "choudhary._ashu": "Jab inpe laat bajega tab bhi vahi rahena kabhi shooting pe chali ja uksa to khub rahi hai inko", "imran_faris_": "👍", "ali_nadeef": "Hum ek hain", "malik_tdot": "😍😍😍😍", "sara_yafaiii": "Hum ek hai❤️", "anushaav1905": "Please help me fund for my dad's surgery... He is having liver cirrhosis (non alcoholic Autoimmune).He needs liver transplantation.... Even small help would help... Please check my bio for the link", "raamkaramta": "Baakwaasssssssssssssssss", "nayaab0211": "👏👏👏👏", "ashpat007": "🤡🤡🤡🤡😂🤣", "rih_llove": "❤️🇮🇳", "zaid_pathan87": "https://youtu.be/BO72Db0CqN8", "saud_bin_riyaz": "हम एक है 🇮🇳♥️🇮🇳", "junaid.shaikh.official": "Mashaallah", "omar.mir_acle": "Hum Ek Hainn...🇮🇳♥️♥️♥️", "asjad_yusuf": "Is there anyone from shaheen baug plz dm", "pratik.live_to_ride": "🤣🤣", "saqib1616": "Aazadi❤️❤️", "dheerajaulakh": "❤️", "the_parx": "China locked muslims. China suffering Corona virus.", "stunyshashi": "Aur yahaan mohtarma celebrity hone ka galat istemaal karte hue.😢😢😢", "dillu_david09": "Veer tm badhe chalo ham tmhare sath hai. @reallyswara", "patelnitin12": "Hum de rhe fuck off 🖕🏽", "sk_farzan_": "Hum ek hai ❤️❤️❤️❤️ hum Aapke Saath Hain @reallyswara mem #merasamvidhan #salamshahinbagh #nocaa #nonrc", "nanu7950": "Brave girl", "bhardwajgourav": "@reallyswara Do whatever you can or want but Governments decision is not going to change and you Idiot's will get tired of shouting fake. Azaadi chahiye to India chord do mil jayegi Azaadi. Yaha rehna v ha. Ladna v ha. Khana pina ha , paise v kamana ha. High profile parties me v jana ha or Azaadi chahiye. Tum jo karti ho wo Azaadi ha. Kya hota agar Hitler k tym par paida hue hoti to Azaadi ka A bolte he udda deta wo. Tumhe sab kuch mil raha ha to Azaadi chahiye. Salman Bhai, Amir, SRK inlogon ne to protest nai kiya ya support kiya tumhe kyunki they know that what you are doing is Cheap thing. Jo bhi act aya ha usme HINDUSTAN k MUSLIMS ko koi problem nai hogi. Unhe kisi bhi tarah se apne ko Indian batane ki zarurat nai ha kyunki wo ha. Ye to Bangladeshi or baaki neighbouring countries k logon k liye ha. Pata nai padhe likhe ho kar bhi tum itne Anpadh kaise ho sakte ho. Shit.", "thalha_md": "😍", "ankit_bargaway": "😍😍", "radhika_h_k": "❤️", "shubiee_dubieeee": "Madam mat chillao ticket nahi milnewaala congress se.", "mointhefreestyler": "💝", "kaushik.naman28": "😂😂😂😂😂😂", "aminah_haider": "❤️🔥", "al_a_m_i_r": "Bahot hard", "loveraj9848": "Daange wali jgh to tumra fab h", "boris_707": "Stand united, stand strong 💙❤️", "shubham.kr07": "Hum ek hain ❤", "vatsal.sharma.501": "👏👏👌👌", "iamakhilbhardwaj": "Just because of your these actions un following you. You are a good actress or its better to take pay for your profession not for this.", "abdulsiddiqui1": "It's always special to have you with us, A slute for your courage ma'am ❤️", "iam.zaid": "You're pride of the nation ♥️", "mzb_sfc11": "INDIA WILL RESIST FACISM ❤️", "hussainasir_7781": "Jab- jab Zulmi Zulm Krega Satta ki galiyaro se,.. Chhapa- Chhapa Gunj Uthega Inquilab ke Naaron Se🇮🇳✊ Aawaz dooo... Hum ek Hain✊🇮🇳 @reallyswara Hats off to you❤️", "hashim__919": "🔥🔥🔥👏👏👏👏", "maryam_azhari": "Hum ek hain! ♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "17_raz": "You go girl 🔥🔥🔥@reallyswara", "shahbajkhan_16": "Aazadi jaha mauke mile lekh do", "najif_patel": "Yes mem we are proud of u also.", "mdsamim333": "anupam sher ke bare me aap soochi haiiiiii.", "rahilthanvi": "nice nd well done men🔥👌", "sayedr67": "mJh se Nhi Mili", "monster_99_beat": "🔥🔥🔥🔥", "dhaliwalgursevak": "We r with u", "govind2007.1": "Rep plz😂", "satyamnotsanyam": "🙈🖤", "iam_sajid_hussain": "Mam patna k Sabzibagh ao", "prince_mj_official": "♥️ham ek hai ❤️", "khushbaldwa": "Hats off to u @reallyswara", "atifmohiuddin3": "Inqalaab zindabad...", "rumi593pathan": "Hum sab ek hain !!!!!❤️❤️❤️❤️", "devil_rocker_md_official": "Bhakt attendance do 😂🤣!", "benzy_bazinga": "Unity in diversity 💖", "__khalid_hafeez": "Ekta ka raaz chlega har mazhab sath chlega", "realisticedu": "Awaaj doh एक हो 💕💕💕🔥🔥🔥🇮🇳", "___stay_at_home__": "Hum ek hain !!!♥️♥️🇮🇳🇮🇳🇮🇳🇮🇳 Love from Chhattisgarh ♥️♥️♥️"}