{"rayank2601": "And how many good days were you there with them?", "kansagra_vaibhav_patel": "यदि आप हिन्दू होते हुए भी NRC, 370, CAA, और राम मंदिर के विरोधी हो तो यकीन मानिये आपकी मम्मी का यार कोई मुल्ला रहा होगा !😂🤘", "__anushka_singh___": "Jeet gai?😹😂🤣🤣🤣", "amardeep.007": "Arrey madam mere lavde se jitenge🤣", "hritiks._.saxena": "Kitna bheek maangegi ye", "vishnu.sethi7": "Jeet gye kya??", "dhakakalia": "Are Bollywood me kuch nai mila soch yaha publicity le lu", "patilprajaktakrishna": "Swara aunty deshdrohi gaddar hai Pakistani", "yogeshhhhhhh": "I never seen this type of waste actress in my life if you don't know about politics don't interfere you bloody fool", "ayush29874": "Biryani khane gyi thi aur kch khaa k aa gyi", "santoshsunita3": "500 ke leye ladenge ,jitenge", "aryan_tripathi8": "Teri maa ki chut jiss desh ka khati hai usko gali deti hai tera toh na bhagwaan hoga or nahi allha hoga tu kutiya hai", "amrutha.rl27": "deshdrohii 😠", "shubhamraut521": "jis desh ka khate hai usi ko gali 😠😡😠😡", "tanmay.p25": "Paise kamayenge 🔥🔥", "mystical_bambi": "Pakistani spotted", "_arundhati_07": "Randi mil gyi azadi😂😂😂...abhi toh nrc aur npr aana vala hai....yeh trailer tha modi baba ki movie ka...abhi climax bhi aayega😂😂", "hon3y_27": "Bhag mc", "ajayrathore5933": "I support Caa", "tanvigaikar": "Who is funding u to create anti Nationals?", "vivek.mandal27": "Who are real motherfucker are the supporter of burkha antankwaad😂😂", "royrahul.0199": "Literally,,, fuck you🖕", "brijeshsharma956": "Mullo ki begam", "rushabhkulkarni99": "U are a piece of shit .. #democracy #freedomofspeech ... Glove pehen k morcha karne wali buddhi aunty", "vishalshekharr": "Tu aur teri dumb brigade haregi.", "satyajeet.1996": "Swara- ladenge, jeetenge! Meanwhile Shah-Gaand faad denge!", "raghav_mehta18": "Pehli fursat me nikal 😂", "urvin_darji": "Mc bc Bollywood madar c....d inko sirf publicity chahiye aur kuch nai", "commando9301": "Lade लेकीन भाग Gaye. Bhagode . सामने हिंदुस्थान जिंदाबाद बोलेनार आणि मागे हिंदुस्थान ला बरबाद करण्याचा प्लॅन करणार.mad mad स्वरा", "over_killz_": "And all the best 👍👍 lage raho", "aarav_badgotiya": "Mentali sikh.. lgta 8th pass out haii", "makhansinghgotterjaihind": "Sale do kodi k gaadaar", "imdevsolanki": "😁😂..HM deke rhenge aazadi😁!", "mr_param_gupta": "Suar ka guu khaati h lagta isliye gyi thi shaheenbaag...", "rohanajmera12": "Aur end Mei MARENGEY😂😂😂", "_ra_va1": "Pakistan jaoo bhen waha tumara garmi thandda hoga q ki apko toh kata huwa land passand hai jaoo waha khub milega appko aur aazadi bi milegi na", "shivaholic_dude": "Muslim dharm kab apna rahi ho", "kubhupendrajodha": "Sharm to aati nahi hogi", "jaiswaldkj": "Yehi bacha hai ab tere jimme", "kusunil0": "Try krlo God bless you😂😂", "richa_sharma1060": "Bhn filmo me sirf sidekick bani rho politics me kuch nhi hone ka tumhara... had se zyada hi desperate ho rhi ho", "bhanukhajuria01": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "akki8rules": "Ladenge jeetenge nai seeda chudenge🤣", "rahulchauhan_94": "Tumsa na ho payega, tum pictures karo bsss, desh hum sambhalenge.!!!", "shahabdulkareemsak": "इंक़लाब ज़िन्दाबाद", "karshiladitya": "🤣🤣", "tasleem9169": "Mat desh bhakti sikhaye koi hame ham sache bharat wale hay baba sahab ke bataye huye sambhidhan ke raste pe chale hay han pakke Aambetkar wale. Hay 🇮🇳 NO NRC NO CAA NO NPR 🇮🇳", "caran1758": "Happy u support someone... Hope u protest for kashmiri Hindus also ... Whose lands r gone ...homes were taken away .. .. 😢 🇮🇳", "chandu.arun.chandu": "Iss \"Suar\" ra bhaskar ke dil mai apne desh ke liye kitna jeher hai. Aur sabse saste vote bank, yaani ki muslims ke vote jitne ka accha tareka. Politics join kar le \"Suar\" Ra kyunki Modi, aur Modi ki policies oppose kar ke tu sabse saste vote bank jeet kuki hai. Bus kisi muslim area se election mai ticket lele teri win pakki, paki saali", "sk76778397": "😂😂", "yashaswi.pandit18": "Ky करने गयी हो wha 500me पसारने 😂😂", "kushal_navandar": "Chup na laudi.", "techass_bhanu": "😀😀😌 ye sab dekh notanki dekh kr mja bda aa rha hai 😀, i am with you Muslims brothers. Indian Muslims not rohingya log.. Unko citizenship nhi milegi according to CAA", "kailash_1605": "Sharam kr le bc", "gufrankhan.sonu": "You Are Doing very Good work A big Thanks for supporting us and please continue supporting us", "amitpoddar80": "Seriously you have let many of us down by sheer wealth of ignorance in ur mind", "_npadhiyar": "नोटबन्दी की लाइन में 6-8 घण्टे लगते थे और लोग मर भी जाते थे 🤔 पर अब शाहीन बाग में 24-24 घण्टे भरी ठंड में बैठे हैं कोई नहीं मर रहा 🤔 😂😂 ye dar acha laga mere ko 😂", "singhv21": "She seems BJP's agent. Indirectly trying to help them. Saavdhan.🤔", "sidhusankle": "Jeetenge my foot", "shehzan_qureshi": "Please come to shahi eidgah protest also", "thejoblessindian": "You are Anti Nationalist 🇮🇳🇮🇳🇮🇳🙏", "shivangi6260": "Ye sirf India ko intolerance country dikhane ke ek ghatiya stunt hai or kuch ni,,,,,shame on u kuch Bollywood ke berojgar fukray jinki pension rok di gai h bus uski bhadas h or kuch ni ,,,,,", "the_parvesh_4garwal": "Jeetogey kaise Bharat tere tukde hongey inshola kehkar😂 baat karti h 😠", "tausif5521": "You are legend", "mumbaifoodlove": "I can’t wait to see Modi kick you out of India", "badal_rana_39": "Tu mar ja ya pakistan Jake imran ke talve chaat", "an_aaravsen": "Madam shaheen baag main suna hk apka dhanda mast chal rha hai", "aashu__yadav30": "Its all political stunt 😂😂", "amansharma4906": "zulm o sitam ki hadhein bhi sharminda hain..", "saiprasad_2409": "Bharat main desh drohi hai unki maa ka bhosada", "abbasmirza3579": "👏", "divyaiyer": "Consult a psychiatrist, please. Your screws have seemed to come loose", "akg8159": "Gjb ki gaddar h tu jis desh ka khaa rhi h usi ko tod rhi h tu jinna ki soch wali h", "proudmusliminsaallah": "Fuck off 70% already accepted CAA NRC NPA😂😂😂", "lijad_": "Ja*", "afzalistan\nVerified": "Verified", "jaatamit08": "Haroge tum", "sonam.dahiyaaaa": "Boycott her movies", "hindu_pariwar_": "सपनो मे!", "a_dead_s0ul": "Iss Chutiya ko pta bhi nhi h CAA h kya ....nahi article 14,15 or unke exemptions pta h....bs faaltu cheap publicity Stunts h or kuch nhi", "kamuchi_kamucha_kamuchang": "Madarchod bhakt log nai manenge... amni maa chudenga yahan aa k.. abe lund tumhari toh aukat hai na padh amni maa jarur chudwaogye.. this is for all those bhakt", "sarakhan8628": "Really proud of youuuu❤️❤️ lots of loveeeeeeee", "nikhil_kapoor_1234": "No one is there in this country to protest for this.#Nirbhaya", "romeo__17": "🔥🔥🔥🔥yess", "rachitttttttttttt": "Not a single status or anything from you on Nirbhaya case...VERY GOOD!! Being a girl its shame on you. Thank You", "ankyankur3": "2rs ki publicity pane k liye kya kya karenge... Pagal aurat kabhi to desh k sath loyal ho ja", "tuntun75780": "Jhat nhi kabar payegi tu . ja aur ungli kr tu usi k liye bni hai", "abhi00938": "Madharchod Madharchod swara bhaskar bahen ki lodi", "the_religion_universe": "Shame on SWARA #jihadexposed #tukdetukdegang #forcedconversion", "krishan7167": "Lodaaa laa laaa Randi da ga tera ko azadiii", "anuj__khare9": "Kash kashmiri pandits k liye bhi ladi hoti to aaj wo wapas apne ghar m hote.", "thesandeepsam": "❤️❤️", "hindu_.rashtra_bharat": "Chhote log dangai (gandi rajneeti) Kar rahe Hain . Karne do. Madarchod kutiya behen ki lodi", "rey_yaan_singh": "ਕਈ ਫੁਦੂਆ ਨੂੰ ਨ ਸਾਇਦ ਮੋਦੀ ਦੀਆ ਜੁੱਤੀਆਂ ਚੱਟ ਕੇ ਜਿਆਦਾ ਮਜਾ ਆਉਦਾ ਤਾਹੀ ਏਥੇ ਆਪਣੀ ਭੈਣ ਨੂੰ ਗਾਲਾਂ ਕੱਡ ਰਹੇ ਆ ।।ਸਾਬਾਸ ਥੋਡੇ ਲਾਹਣਤਿਅੋ਼਼", "dr.sachintandale": "@reallyswara ..swara bhaskar is third class actress ignored her😆", "we_wake_gupta": "Shift timing? @reallyswara", "sunita_sharma_s": "Go to hell", "badblood.pv": "Isse jnu ke baare mein kuch pata bhi hai😂🤦🏻‍♂️", "alisadiqshaikh": "👍", "singh.naveen31": "Ghanta jitoge ..🤣🤣🤣", "just_a_chaos11": "U go girl 🔥👏", "whitepantherrrrr": "Bhenkilodi rande deshdrohi h tu nikal hmare desh se", "har.har.mahadeev": "कुछ भी बहन चोद कुछ भी बहन चोद।", "young_dumb_7686": "Tu pakistani he", "8914sahil": "Aap ki mehanat jaroor rang laygi", "sachin__si": "Randi to ho hi tum madharchod", "majay9819": "500-500 😂😂😂 Tereko kitna mila Gaddar @reallyswara", "gypsysoul_10": "Such a shit.. for some publicity doing this nautanki.. shame on u @reallyswara", "reyans12": "Jay shree ram", "govi_rajput_143": "Kis se ladoge...hinduo se....", "aagazakhtar_": "WE SALUTE YOU @reallyswara ❤️✨", "nkharkar": "Jor se bolo swara Bhaskar ki maki...", "manav.9999": "Jeetenge !! my ass ..ha ha ha lol 😂😂😂 Tu dekhti ja aage hota h kya...tum ho 1% tukde jihadi bastards aur baaki 99% India NRC k support main dat k khara h...gaand marate rho aise hi...tera baap dadaon ko kabar se nikala jayega kagaz k liye aur kabar se ayenge dekhne tumhe jab tere jaiso ki chut main garam oil daal k tumhare hi upar jihaad kiya jayega @reallyswara 😂😂😂🖕🖕🔥🔥", "sonowal.abhi": "Sharjeel Imam will be stripped naked and beaten on the road. Inform him, CUT OFF ASSAM, BOLO HISTORY PADHE USKO. SECULARISM IS A BIAS WORD", "imyselfjerry": "Sometimes ur statements😂😂😂😂😂😂😂", "nikhil_pawdia01": "Anpadh h", "vikas__bittu": "😂😂😂👎", "mayuresh7": "🤣🤣🤣 behen, film career ki tarah ismai bhi haregi tu", "aalisha.solanki": "Chutiyapa chutiyapa chutiyapa😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "kundanmandal93": "Kashmiri pandito ki ghar wapsi ke liye protest kyu nahi krti bc", "soulash_write": "Gandhi tere desh me khoob jinna ghum rhe hain Hum bhi sadak per aagae or hathiyar hath me nahi liya hain Apne katil ki naak me dam kar rakha hai Itihas likhaga insaaf na milne tak use sone nhi diya hain Uske saare mansoobo pe paani kar rakha hai Khud jaal gae lekin baarud jalne nahi diya hain Haan, daar hai dil me wo kya chal chalega per baat desh ki hai To ek hatheli per jaan or ek me tiranga liya hain Un khwabo ke khatir halak me shor liye nikle hain Jin khwabo ke liye veero ne sahadat diya hain", "ak.hil2302": "Are yaar isko london paris nahi lahor achha lagta hai", "rahulkore1334": "Kya jitenage.....😂😂", "mypramod6": "Gandhi ko maane wale chaka jaam , north-east India SE alag Karne, Bharat k tookde , bus jalana logo pareshan karna, jaise kaam Kar rahe h. Aur Nathuram Vinayak Godse ko poojne wale shaant hai. @reallyswara issi se samaj lo Godse ne kitna intzar Kiya hoga shaant reh Kar 🇮🇳 vande matram", "iam_idri5": "Are jab lage the Goro se ... Ab lagengey Choro se. 👌🇮🇳", "about_to_fly": "Berojgar actress", "sidv1425": "Chaman Chutiya", "vivekjais1210": "Tu khud ko serni samjhte hai kis agle se serni hai tum bujdil ho", "theflyingbirdie": "People don't support because you always support activities against the country. Such a shame for our country. Whyyy? Please read the facts before going against something. IDIOT.", "_ajeet_singh_rajpurohit": "Ladengey toh fir bhi theek hai, jeetenge ke sapne mat na dekho 😩😩", "itz_sidd_h": "और लार चाटेंगे रण्डी", "shubiee_dubieeee": "Haan mam jaise kashmir main pandito ke khilaaf jeete they", "jassii_sahab": "Document ready krlo pehlo.... Jeetne ki baad me sochna madam 😂", "chirag_patel345": "Madarchod jis desh ka khati hai usi main thukti hai nikal yaha se", "surenderkashayap": "Randi h", "couplespictures19": "Sbse neach aurat", "neerajtiwari17": "Din me sapne 👏👏👏👏😂😂😂😂", "ankit8941sharma": "Behan chod kitna chilati h lavda lg gya Kya kuttiya", "smile2lc": "हेल्लो सुअरा 🐗🐗🐗जी, काम तो सोने से भी मिल जायेगा bollywood हो या polotics, पर देवी, देश नही मिलेगा । मत कर ऐसे, में तुम्हारी respect करती थी लेकिन इस गन्दी politics का हिस्सा बनके और मेरे देश, मेरे संविधान के खिलाफ बोलके मर गयी तू हमारे दिलों में ! अब जा लेले आज़ादी खुद से, वामपंथ से, कांग्रेस से, अपने दोस्तों से, इस देश की गलियों से, तेरे स्कूल कॉलेज की यादों से, यहाँ की हवा, पानी, ज़मीन से आज़ादी। जा जहाँ जाना हैं तुझे। RIP 💐💐💐💐", "niteshkr077": "Tension mat lo modi jiee kasmir ko handle kr skte ho ye chota bag kyaa chiz ,acha h jitne gadar h desh me sab bill se bahar aa rahe h 😅😅", "nirmalkholiya": "कुछ भी कह है तो तू रंडी ही 😂😂😂", "shera_6.11": "Haq se", "_bumble_bee__911": "And no f*ck has been given😃 you opportunist f*ck.", "djdeepakjain": "Kya jeetna hai @reallyswara 🔥 elections toh sab ko hara diya🤔", "tiwaridhruvesh": "@reallyswara madam kon fund karta hai aap logo ko batao na??? Warna itne dino se muft ka khana aur paise aaj kal kon baat ta hai????", "animesh2405": "Please watch is video mam @reallyswara if you are really concerned about CAA https://youtu.be/gaMEa-EaJHU", "aarti23_03x": "Have some shame .. Hypocrisy ki dukan ho tum !", "rohitanandpatel": "Apni film bhi Shaheen bag ke liye release karna. Baki Hindu to Tere dushman hai hi", "praveensahu30": "Good to know that deshdrohi sherzil imam has been arrested.. so respect our country jai hind🇮🇳 jai hinduism. 🇮🇳", "pushkinbhattacharya": "AFZAL hum sharminda,hai ....tera BC Bhai Sharjeel abhi bhi zinda hai😍😍😍😍", "aakash.0707": "❤️", "prem_kamal23": "Ajiii ghanta😂😂😂😂", "krunal_knj": "Chup baith🤫", "shrimantroll": "Yeh nautanki ko kaam nahi hai? 🍌", "binnu_____": "I support CAA and NRC 🙌❤️", "ak.ashish_pandey": "😂😂😂😂😂", "ankit4916": "Bhosdiwli", "divya_kashyap_17": "Itni berojgar ho gayi, koi chaddi ka add bhi nhi dega tujhe 😂😂😂", "smaily_6544": "Are bro aap bhi ho 💞😍@zery_khan666", "0fficialbatman": "😂😂😂 lol... I pity you . 🙏", "_imshrishti_": "Saath baithe raho jaana bhi desh ke bhar saath saath bhatakna dar dar. Unlogon ka support kar rahi ho jo khud constitution ka misuse kar rahe hai usko save karne ke naam pe.", "kuldyypbisht": "Kya jeetna chahte ho ?", "kingsajid98": "हम जीतेंगे", "divine.girl__": "Maar bhi khaaenge😂", "_het.shah": "Joo ukhad na hai vo ukhad lee,NRC,CAA,aake rahega!", "omkar.bharat.sangale": "Sali chutiya Tu tax Bharti hai ki nahi?bc vohi taxes se ye log padh Ra hai and kaiko inlog politics Mai ghusna hai uska kanahyaa Kumar ne Bola hoga bc afzal guru k upar see matter chalu huaa bc inlog k family ko hall Mai band Karo and afzal ko bhej do bombing karne dekhte hai kitna support karenge", "_.rajan._09": "Isse ladki ko koi kaam nahi deta toh yeha kaam kar rahi hai😂😂😂😂🔥", "singh_anika_": "हाँ मैं हिन्दू हूँ, वो हिन्दू जिसको जातीवाद की दिवारों से सदियों से बाटा गया, वो हिन्दू जिसको इतिहास के हर मोड़ पर जलाया गया और उसकी औरतों को बाज़ारों में बैठाया गया, मैं पैदा हिन्दू हुआ था तुमने मुझे ब्राहमण, दलित, क्षत्रिय, वैश्य में बाटा, मैं पैदा हिन्दू ही हुआ था, लेकिन तुमने मुझे झूठे सेकयुलरवाद में बाटा, माना मैं हिन्दू था...तो मेरा घर जला, लेकिन तुम तो सेकयुलर थे तो तुम्हारा कयो नरसंहार हुआ? मैं वो हिन्दू हूँ जो अपने राम का वजूद साबित करने के लिए कचहरी में दौड़ा था। मैं वो हिन्दू हूँ जिसको रातों-रात कश्मीर से जिहाद के नाम पर भगा दिया और अपने मुल्क में ही शरणार्थि बन दिया। मैं वो हिन्दू हूँ जिसने सन् 47 का दंश भी झेला था और आज भी झूठी सेकयुलरवाद की चद्दर ओढ़कर लेटा था, मैं वो हिन्दू हूँ जो अपने जख्म दिखाने आ गया तो ये जमीन भी छलनी हो जाएगी, मैं वो हिन्दू हूँ जो अब धीरे-धीरे जग रहा हूँ, जातीं और ढ़ोगी सेकयुलरवाद की खायी अब पाट रहा हूँ, मैं कोई ढ़ोगी सेकयुलर नहीं, हाँ मैं हिन्दू हूँ। #HaMainHinduHu #UnitedHindu", "drsulva": "U r such a flop actress... Kuch nhi mila toh ye hi sahi", "innocent_zaid_khan": "U r the queen of India @reallyswara Mam 💪😘", "commu_nis": "Abe sali film ni mili toh dalli bangyii ya islamic terrorist toh gaddar hai hi Tu bhi gaddar hsi dalli khi ki", "chuslim687": "Haari Hui Bazi Khel rahi ho.... 😂😂", "hows_the_josh_jai_hind": "Support caa nrc", "rahulkarnerk": "Kyu apni Maa bahan 1 karva rhi ho 😂😂😂😂", "imshayanahmedkhan": "More Power ❤️", "sibasisdutta": "Aur kro...bjp hi jeetegi", "nitinvasantlikhite": "If u r charged with abetment of sedition be careful u r not going to achieve anything more Hindus r going with CAA and with NaMo", "bharatsingh5540": "As you wroght in bio #dramebazz 😂😂😂 u r really 😂😂😂", "r_a_h_u_l_0_0_7": "Pav tere tukde honge Itna masala itna masala Hum kya chahte....Pav Bhaji Tum kitni Bhaji khaoge Har ghar se Pav niklega Tere mere rishta kya MDH ka masala La la idhar la Pav Bhaji Tum kuch b karlo Hum leker rahenge Pav Bhaji Amul Butter wali Pav Bhaji Jo tum na doge Hum cheen k lenge Pav Bhaji Bolo Pav Bhaji 😂😂", "gopal_bamalwa": "🖕😆🖕", "ragragmaiindia": "Mic Mai bolde documents ready rakho or nhi ho to gaand ready rakho", "itssimmijain": "Film m side role krte krte thak gyi h Didi to bs jnu m main ban rhi😂", "shashank1787": "Ye suara ke pass koi document nahi hai, aur videshi me aise hi firti rahti hain, waha par to passport visa leke ghumti hogi na, Lekin india me pakistan se paise lekar yaha ke logon ko bhadkana hai inko, shame on u @reallyswara", "mr.meenashaab": "I support #caa #nrc #npr wese madam Jo rules aaye nhi uska kiu protest kar rahi h movie Karo tum faltu me kiu desh ke tukdee Kar rahi ho", "cbbuuu": "Kaun hai yeh bhadwi 😂😂😂😂", "sunnykhatik96": "Tu kabhi jeet bhi nahi sakti", "prakhyat_gupta": "@reallyswara tu chutiya thi,hai or rahegi🔥😄....picture mil nhi rhi...toh jaha se paisa mil raha..vahi a rhi", "trishulanews": "You are an Antinational after all.", "araya_katika": "Tu support Pakistan ko kar aur ham India ko I support NRC & CAA", "khan._.asif": "It's really sad to see such disgraceful comments against you. But i know you're a very strong woman and I wish you all the best keep up the good work 👌👌👌👌. Ignore these sick people they don't have dignity, sense of humour. They are just pimps of the government...", "talha_traveller": "👌👌👌👌😍😍 Keep it up,,.,. I hope andh bhakt will understand and will join you 👌👌👌", "mubashshiraqueel": "We are all with you", "rajatchauhan.9650": "Kabhi kashmiri pandito ki bhi baat krlo😪", "vimal6261": "Failure government", "adityakumarchoudharyuoh": "Zehreli Aunty Swara bhaskar कितना झूट बोलती है 🤣 वो उस आदमी के साथ खड़ी है जो Assam को भारत से अलग करना चाहता है और aunty कह रही है की उसे #TukdeTukdeGang मत बुलाओ 🤣 😂 #Swarabhaskar को देखिये साबूत के साथ किस तरह से टुकरे टुकरे गैग के सरगना के साथ खडी़ है! देश द्रोहियो को कम से कम फाँसी की सजा तो मिलनी ही चाहिए! ऐसे आतंकियो से ही देश को खतरा है टुकरे टुकरे गैग का एक सरगना पकड़ा गया Swara को कड़रो रूपए मिलती है पाकिस्तान और खाड़ी देशों से, साथ ही उसकी माँ टुकरे टुकरे गैग से पहले से ही JNU मे जुरी हुई है जो वामपंथी उग्रवाद को टेन्ड करती है नक्सलियो के सर्गणा भी कही जाती है!", "gmkbiswas": "Love u di", "_nitesh_dwivedi97": "Agar madam aapke pass kagzat hai to darr kaisa nhi hai to ghar kaisa😂once my friend mayank nayal had said", "aniket.gupta19": "tukde tukde gang ki asliyat aa rhi samne", "rathour_therajputboy": "Desh ki barbadi ke jimmedar tum jaise selfish propaganda bearers h hai. Swara u urself know u r not trying to help the country or society in growing up. You just want to be a rebel without a agenda. Never think u r a pinch of Bhagat singh. Waste rebel u r madam. Use to be a fan of ur acting but now i m ashamed of u.", "sheikchanchal": "❤️❤️", "lovering_dany": "Bhonkne wali kutti he tu", "rishil_big_fan_of_dhoni": "Still struggling😹😹😹😹", "luv_keshri__": "Chutiya ladki 😅😅😅", "sachinjoshi77": "शाहीन बाग में बैठ तो गये लेकिन अब उठे किस मुँह से ना तो कोई मनाने आ रहा, ना ही कोई लट्ठ लेकर भगाने आ रहा !! दुःखद 😎🤣🤣🤣😎", "iamparthamaity": "Wonhi pe tera maqbara banega aur uspe likha hoga mullo ko mujra dikhanewali", "nasirhhussein": "👏👏", "mayankkatiyar11": "Good", "kelvin___patel": "Hum thokke denge aazadi aunty😂 @reallyswara", "khan_s_eklakh_razawi": "You are great mam", "pradeepchoudhary966": "sarjil imam pe bol", "gurpreetsingh4u": "Mam, I actually not understood what's in mind of people like you cooking. Don't be puppet of dirty political goons. #CAA & #NRC are must of our Country.", "caughtinamiracle": "Abh burkha bhi pehen le besharam aurat", "vishalsingh_2608": "Begusarai wali didi......", "sambhaji_agalawe": "NRC read first swara", "nitin0502": "@reallyswara ....don't create chaos on assumptions....no one will get anything from this....", "tej_kumar_yadav": "Bhak laudi teri maa kaa bhosda", "haniaaa_khann": "Tigress 🙌", "gourangaroy": "lol lol cheap publicity", "gagandeep.saini.963": "Unfollowing you because you are an anti indian", "ali07291": "अगर मुझे कैप्शन देना है तो निःसन्देह..!! #दहाड़ती_हुई_शेरनी💕💕", "sumukh_hr": "Sharing a stage with Sharjeel imam the terrorist. We are absolutely proud of you mam, more power to you❤️🔥", "ashishgupta5181": "किससे लडोगी, क्या जीतोगी?", "safe_faruk": "Jit jayenge Hum thakral ke khilaf zindagi 1 jung h", "pankti.official": "Aji ghanta jeetoge.agar jeette to loksabha m do bar se muh ki nhi kha rhe hote.kamjor ho tum kayar ho tum ladkio ko aage karke ladai ladte ho.mard kehete ho khud ko samne aakar lado...jai hind jai bharat.Bharat mata ki jai.vande matram❤️", "vaishhh.__": "@reallyswara Aab bolo Majid mei aurtoko namaz padhne milna chaiye bolo . Reservations hata doh joh caste based and minorities ke liye hai. First you will ask for reservations on caste , religion then will talk about equality?", "selenophile_lover.90": "Tum Lahore chali jao ab.. Hindustan ab bas ka nahin.. bahut ho gaya ab ye drama.", "educated__moron___": "Jab tak tum Wahaan ho, nahi jeetenge😒", "isha_8807": "Why don't you join there full time?", "sadiasinthia99": "@reallyswara hey comrade how r u🤪🤪🤪", "nam.pral": "Masturbate kr jakr...... ungli ghusa......Woo jeet.....Yhan tu haar jaegi👎", "be_like_sady": "Bhaiyo aur behno IT cell wale overtime karke har comment section m hag rahe hai.unke muh na lage aur apna kaam jaari rakhe.dhanyavad.", "ubed_39": "Salute madam sawara G", "mohit_sharma_ddmft": "#Abdul sirf delhi ki sadko par dikh rha hai....😂 UP me to abdul jumme ki namaz ke bad sidha ghar jata hai.... kyunki pta hai protest ke chakkar me ghar bik jayega😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "vastviktapal06": "Arey madam .. Jakr thoda bhot padh toh lo .. Jo aagyi yha.. Bechare modi ji bol bol kr pagal hogye ki thoda pd lo pd lo n.r.c k bare me ... Bs aagyi muh utha kr", "panks008": "Jo glt hai wo kbhi nhi jeeteenge...or every body knows you are wrong...you never ever win...live in dreams...logo ko mat uksa nhi to ek Teri keh ke lenge....😋😋😋glt jgh ladenge jhuth kr liye ladenge or Oro ko aage krke khud bhag Jayenge....that's swara....😎😎😎", "moreram4882": "Pakistani ko sath denge ...... Kya madam", "bathi_bappalige": "You are a great madam 👍👍👍👍😍😍😍😍😍", "thakorecp": "Bravo 👏👏👏", "swapnil.k.singh": "Insure mota Bhai ka Dyan aap par na jaye.. else aapka number bhi jald aayega", "amitsaluja1220": "Abey kya pagal aurat h yr", "xander.hamza": "👌", "ynwa.anmol": "Nice speak but please kagajh dikhao pehel 😂😂😂😂😂😂", "aditya_sawant_97": "Fake lady 😂😂", "80.80039": "Chilla kar kuch bhi nahi ukharne wala...sabki pelai hogi bari bari se.aur docoment bhi sath me rakhna.", "ajay_devgn_planet": "Shame on @reallyswara shared stage with those who want to separate Aasam from India.", "amallick1991": "Besharam", "muralidharrajaram": "Swara Bhaskar is a anti national", "balanimanisha": "congratulatuons @reallyswara your friend is arrested today emam.....", "sachin_nagar9": "Tu phele apni acting pr dhyan de vo sudhaar🤣🤣🤣🤣🖕🖕", "____loju____": "#sherni🔥", "aniket_uk": "Yaar itna hi ladna tha toh... Garib logon ke haqq ke liye ladh leti... Lekin publicity nahi hai na waha... Yaha to glamour hai... Mota bhai please inko jald se jald Pakistan/Bangladeshi citizenship dene ka prabandh karo please... Udhar ja ke inko \"Azaadi\" ka sahi mayne me matlab samaj ayega 😂", "rinky211": "Ladengey aur padengey bhi tereko bc", "negi.jags": "Hope @reallyswara you also conveyed that in coming elections these people ahould not show their \"kaagaj\" (id proof/voter id) to the election officers 😁", "dusaane.gorkhnaath": "Whore", "verma_ank": "🖕🖕🖕", "millionsmacks": "Ek diin mar jayegi tuu kutte ki maaut puri duniya bolegi mar gyi behnchod", "choudhry.faiza": "Asli Hindustani Hain ,ladna khoon mein hai humare ...bhaunkne waale toh kal bhi dogs thhey aaj bhi Woh becharon ko doggie hi Kaha jaata hai", "gaba2445": "Arre boss arrest ho gaya tera bihar se ab aise totegee uski. Jai shree ram", "nehal_revankar_": "Look at the comments dude 95% of Muslims are supporting her and texting in comments😂😂😂", "chetnachapparia": "Love u swara", "piyush26102": "तुम नहीं जीत सकते जीत सच्चाई कि होती हैं। #Democracy or #constitution कि बात करते हो और Indians को India के #shahinbagh मे जाने नहीं देते। #wesupportCAA #370inshahinbagh", "mamta_kalra19": "Ridiculous....", "the_brahmastra": "@hmoindia arrest her", "mohdsubhan788": "swara swara👍👍", "danish_anwar08": "Ham dekhenge 👍👍", "kananbuch": "This is a Constitution Act. Passed by both the houses of Indian Parliament. It means it's an Act Now under Legal structure of INDIA. Stop your Antics to gather publicity", "superdude.abhishek": "500 mile aapko aunty or biryani bhi Mili hogi", "pintosh89": "i am proud to be swara bhaskar ji", "vitocorleonnne": "you are anti-nationals. Misleading public. Who’s funding you? You’ll lose. #harogay", "surajsinghfilmy590": "Aare Shaheen bhagh bhi dushman desh me aata hai lahore tujhe bohot pasand hai na lodi😂😂", "nishiniaz": "😍👌", "faheem.273": "Shandaar", "vijay_pratap_karan": "F........... you one thing is understood now india is heading towards blood shed the infected one must spills on the road and people started realizing and making a difference between pro india and secularism sickular nonsense f...........you even I will not so cheap hope you are hearing and your so called fans who supporting also bachega koi bhi nhi #pest control will continue sare dimak bahar hai Ab attack kro 😡😡😡😡😡😡😡", "banti.maharaj": "उँगली मैडम चलाई कब से नहीं😝😝😍😍😍😍", "_b_e_patient": "PFI se paise pahuch gaye kya?", "khalidhasan338": "👌👌", "jamalrashid0788": "Jeetengey", "sudixit0102": "देश के नाम पर दाग है , हाँ यही वो शाहीन बाग है ।।", "ummulrizvi": "♥️", "ajaykumar98973": "@reallyswara aapko aur koi kaam nahi hai kya 😂😂", "kafeel.ahmad.18488169": "I salute you, Allah aap ko aabaad kare, madam", "vicky.tak": "देश द्रोही कीड़े", "royalboy2429": "Film toh av milengi nhi toh leader ban jao😁😁😂😂", "pooja.priyasingh175": "In jasi randiyo ki wajah se deshdrohiyo me itni himmat aayi hai ki wo Assam ko katne ki bat karte hai", "rachna_r_30": "Atleast she is presenting her ideology ..... Warna log profession k liye ideology ko maar dete hain", "archives_of_patna_": "This is absolutely wrong, the section of the society is interpreting CAA and NRC in different perspective, no one's citizenship is taken... This is nothing but protruding the crowd, we are united 🇮🇳🇮🇳@reallyswara", "juhi_naaz__": "❤️❤️", "mukeshagra69": "Right..2024 me phir jitenge...is baar 350 + seats...bcoz of all you.... continue your deshdroh...", "jishuv": "Ye dekho gaddaron ki toli👎", "prince_mj_official": "♥️", "suraj.mishra39": "Inhi logo ki vajah se desh ka naam kharab hai...itni azadi chaiye toh desh chor do...rehna bhi khana bhi..aur naam bhi kharab krna hai India ka..sham on you.", "chirag_vacheta_01": "2 minutes ka kaam he ye sab hatane ke liye , bas modi sarkar dekh rahi he ki desh me kitne gaddar @reallyswara chhupe he", "haris_shaik_": "🔥❤️❤️❤️❤️", "suman.sanga": "People who want India to be united please report this pos...jai hind🇮🇳", "abhisharma630": "Aap cancer ho desh ke liyee same on u", "asbar_imam": "❤️❤️❤️", "vikrampawarpatil": "Bc", "prashant_092pandit": "Pahuch gyi didi....paise pakr... Nya natak krne.... Kaam to mil ni rha filmo mei 🤣🤣🤣🤣🤣", "ashishdas3170": "देशद्रोही😠😠😠", "shabbirkhan110": "👏👏", "snehasishdebnath20": "😂😂😂😂😂", "sunnythepatel": "Main aapka fan tha but abhi aapne acting chod diyaa hai sir tukde tukde gang main shaamil ho Gaye ho..aur mere desh ki Jo khilaf hoga usko main support nahi kar sakta..aaj aapne ek fan kho liyaa congratulations...I am unfollowing you...", "shanu_sir_2783": "Apki himmat.apke madad or apko Dil se salam.jai hind.inquelab zindabad🌹🌹🌹", "cutest_abish": "⭐⭐⭐⭐⭐", "nilesh7685": "😁😉", "ali_mansoor_ansari": "Good", "nilesh_mehta._": "देशद्रोही स्वारा भास्कर", "rohit134569": "😂😂 Tum sab kitne low type ke loog ho apni politics aur benefit ke chakkar mai desh kha jao. Tuu💦 tum logo pr. Delhi elections ke chalte itna bawaal kiya hai. Bhagwaan kare tum aur tumhari congress ka bura haal ho is baar elections mai. Aur Swara bhaskar sharam kro ise ladai aur ager gandhi ji related btaya tumhari tarah wo khud ki publicity nhi krte the ki maine yeh kr diya wo kr diya", "amima_my_princess": "Awesumm👏👏👏 dis shows dat we all r indians not seperated by any caste religion or color👏👏👏 in shaa allah...ur support makes alot of difference👍👍🏼👍", "imrapatel": "Border pe ja", "abbasnaqvi6952": "Lage raho @reallyswara Inquilab zindabad 🇮🇳 Awaaz Do Hum Ek Hai 💪", "soniaditya1689": "😡😤", "ismael_please": "Swaraj Bhaskar ❤️🌹👍💐👌", "mer30vas": "CAA is just part of larger problem, . But real problem is with NPR - NCR.. With idiotic demonit... With govt bankrupting RBI /PSU..with govt misusing ED/CBI /IT... With mass unemployment... With university /JNU attacks.. With govt stifling our democratic right to dissent... With govt deliberately creating division in society..ever since BJP came to power there's only gloom/doom & chaos in nation", "safeer3333": "😍👍", "__mukku_001": "Desh me dange failaoo bass kam to hai nh 😝", "chirag07091979": "Desh ke gaddar or ker bhi kya sakte hai🔥", "firdos_i_proud_to_be_an_indian": "❤️❤️❤️❤️❤️❤️", "dhruvraj_987": "Modi modi modi👍👍", "ambreen_ahmed": "U are an inspiration❤️", "ayaz_ghazi_07": "@reallyswara jeetengey jeetengey !", "jaindharm": "Sarjeel imam ke baad ab kuch bollywood bhand ki baari hai ye bhi harami desh ko kharab karne me lage hai inko bhi jail me dalo", "zeenat__9_8": "Jeetenge 👏👏👏👏", "rizvianjum": "👏👏👏👏👏👏👏👏👏", "beingsalmankhan.you": "💛😍👌❤️🇮🇳🇮🇳", "nagesh2494": "Madarchod Randi", "shadabhussain9786": "These protesters are legend.", "aakashhaistar": "Very poor sirf fame ke liye log Kitna gir jate hai", "pradip_solanki_7474": "Aunty har jaongi 😂😂😂😂😂😂😂😂🤗🤮", "farahmed3": "Wow thank you for taking a stand . We need more celebrities speaking up ! 👏👏", "stoneheartedbeast": "Tum Jaiso Ko Uthake Sabse Pehle Desh s bahar krna chiye", "_yash_bhanushali_": "Sharjeel Imam ko maarenge😂😂😂😎😎😎", "sharma25naresh": "We support CAA, NRC. ...", "habiba_8061": "All those telling this lioness haar jaogi..Dude britishers said the same to the Indian freedom fighters and look where they are..#peace", "rishi_b_theofficial": "Then fight elections, stand up as a candidate from a party. What will you gain from this? Just publicity?", "chetan_chhaba": "👍👍", "shilpa___lovely": "Hello Swara ma'am !! U r the best in industry !! They can be many actors in industry !! But only few have guts to fight and come out when something is going in country !! There might be many that might bully u or make fun of u or threaten u !! But we are always there to support u !! Lot's of love!! Keep going", "am_shivaji": "Lekin Swara tum Tumhare jitne ke चक्कर mai देश को हरा रही हो , aur ये तुम्हे भी malum है.", "prakashjha.g": "Sasti raajneeti ke chakker mai desh mst dooba dena bas", "imsingh13965": "Bhai tu kabhi nahi jeet sakti", "riyazshaikh051gmail.com_": "🔥🔥🔥👏👏👏", "iankit19": "Jeetna baad me pehle documents ready rkho 😂😂... Ye har ek country ka rule h aur hme bhi follow krna chahiye .. apne property k papers to samhal k rkha hoga pr jb rhne ka proof maang liya to keh diya hm paper ni dikhayenge ..waah", "bharatlal_choudhary": "Reallyswara pagal hai Kya tu Bollywood mai kam milna band ho gya hai Kya jo Rod pr aa gye hai tu", "muhsinmuneer": "Zindah he 💙💙💙💙💙", "abhimishra_96": "Whose stick is his buffalo", "sunilkkaushik": "And u will make millions everyday. Fooling innocent these people to fulfil your agenda for JNU", "youtube_vlog": "Saali randi", "rajesh.bhardwaj.2013": "❤️", "tabish_pavli": "Sawara Zindabad 👌", "saddam.shin_chan": "Bilkul jeetenge Comrade...✌️", "iqbal.amed.71": "Keep it up gentlemen.", "bhaskar_rajat007": "Harogey", "elusive_dutta": "😂", "rajul_b": "lol", "derrick_lng": "I feel very safe again to grow and invest my Bitcoin for I have found an expert trader that i can trust, for the first time in a while I feel so grateful and happy. @micholmes47 is reliable and he’s the best when it comes to bitcoin trading.", "_i_ananya_i_": "Haan jaise Begusaray me jeete the😂", "ess_returns": "❤️", "adamachchha": "You doing incredible job. You r really true deshbhaqt", "gaurangjoshi1987": "Flop actress ab kuch kaam to mil nahi raha to Desh tod ne nikal padi tum jesi 3rd class actress ka yahi haal hota hai", "mmohsinwarsi": "after rbi now provident fund also uses NPR as valid document for KYC.", "bhavtoshghildiyal": "Lol", "m_gufran786": "Jeetenge 🤘", "jatinnim003": "🙏", "ali_nadeef": "In sha allah", "reallyrehman": "Before some time I watched your interview on the wire it's very nice n in last message you've gave it's appreciable love you Sis Swara n your thoughts we will win this battle very soon🇮🇳🇮🇳🇮🇳", "rishabh.rishi.50": "Bollywood Mai Kaam Milne baand Ho gaaya hai kya didi apko?", "jaseem_dxb": "🔥🔥👏", "deviprasad0808": "Ladengey Jeetengey...Sanam Hum Bhi Dubengey aur tum logo ko Dubaa Dengey..", "karrygrover": "😂😂😂Mic mai bolde sabko documents ready karle", "aminah_haider": "❤️🔥", "nishant29794": "🖕🖕🖕🖕🖕🖕🖕🤣🤣🤣", "bhardwajgourav": "@reallyswara Ha zarur jeetoge tum Anpadh log. Ek tu or baaki tere JNU k ganwaar sare. Kaam na dhaam or jhooth ka Dungga Fassad karate ho tum log. Sharam aani chahiye. Logon ko behka kar sympathy or jhagdde karana bas yahi ata ha tumhe.", "garvitk09": "@reallyswara", "rajkumarofindia": "Jeet lo Abdulli😂🤣", "bilal__qureshi": "Inshallah", "ijharmo": "Meri swara mam ka andaz hi alg h", "salman_khan8888": "👌👌👌👍👍👍", "mointhefreestyler": "💝", "mahfoozkhan_1": "🔥🔥🔥", "sheemashabibi": "❤️❤️❤️👌", "khursid_molla": "Inshallah jeetengey💪💪💪", "stubborn_shanu": "Inn sha ALLAH 🔥🔥🔥🔥🔥", "rvi.soni": "11 Feb tak dekh lo shyd jeet jao....🤣", "khanmohdhilal": "Visit nizamuddin as well next time when you come to new Delhi👌", "mohdanas6246": "Nyc 🔥", "ferozhaiderofficial": "👍👍", "atharqureshi19": "Insha'Allah", "vatsal.sharma.501": "Swara sahab 👌👌👏👏 @reallyswara"}