{"_maleficent06_": "The motive behind this picture was something else you BONEHEAD BITCH.", "inmayank": "Acha hoa mar gaya", "dharmanandasahoo88": "Fingering paty", "sakku_ka_adda": "Godse bhi bohot bda yodha tha...or uski galti itni h ki lyf me usne mahatma gadhi ko goli mari...jo ki galat h lekin thoda padh lo usne kyo mari...gandhi ki wajeh se desh ko kitna dukh bhi sehna pada tha...wo bhi shi tha use bhi share kro...bas kisi ko goli lgi to emotionally blackmail kro pure desh ko....aun bhaskar kitne log mare h aajadi dilane me...aap iklauta gandhi ko support mat kro aajadi me gadhi ka 1% hi contribution tha baki or bhi kayi log the...itihas acche se padho bhaskar", "ksvishal54": "🔥🔥", "hackerx03a": "Godse shot 2 bullets but there were found that gandhi had 4 bullets on his body and he was not taken to hospital he was alive for 40 minutes no one took him to hospital and no postmortem was done either. He was given water which should not has to be given. Now surely we can clearly see who were his killers.", "raibhan_the_great": "@reallyswara when bhakts are the opposition u know ur in the right side of the history.", "mrigank_b": "Nathuram godse 🙏🙏", "shivaaali_": "Agr ye nhi hua hota, to Aj Gandhi ji ki vja se bharat ke Aur tukde ho gye hote 🙏🙏🙏", "odedra_manav": "Hail Nathuram", "sumit.284": "So what I can see is didi ko follow unko troll krne k liye hi kiya hai 80% logo ne 🤣🤣🤣", "priyanka7610": "Nathuram Godse ko koti koti pranam.", "shivay_shiv1431": "Godse jindabaad", "prahlad_tamboli": "Nathuram Gadse Jindabad", "r_fit_07": "Gandhi chor tha saala ,Nathuram did the rightful thing", "____anik1207_": "😂😂😂😂", "vinaysandhu_10": "@reallyswara gandhi ji ke chest pr goli chalai thi behen aap ne kaha dikha di dhayaan se dekho 😂", "sultania31": "Khadi pehena chalu kr do aap....", "mystical_bambi": "Hail to nathuram godse", "raaj_ranpariya": "Ek question he didi @reallyswara kisi ko goli lagne ke baad koi he ram bol Sakta he kya. \"Jai shree Ram\" vande mataram.🤐", "pratimasahai": "Bitch 🦮 @reallyswara", "_dig_yadav": "Good job nathuram godse", "akshayraj0722": "Desh drohi to", "arun._bidhuri": "👏👏👏😁😁 godse great", "rubalpadaliya": "😂😂😂😂😂😂😂😂 नाथूराम गोडसे जिंदाबाद", "chinmay__deshmukh": "@reallyswara , walk on footstep of Jinnah. Right... Usse Accha chakle pe baith. Hut saali", "vishu4997": "Godse amar rhe", "kartikpresidencyhotel": "Nathuram godse Amar rahe", "jayant6085": "Godse jindabaad tha hai aur rahega", "prashant.jeengar.50": "gandhi ji angrezo k sath rahte h photos dekhi h mtlb unke sathi the bhagath singh ji ko fasi hui kyuki vo unke khilaf the jo us wqt angerzo k sath tha vo zinda bacha or jo nhi tha vo mar gya ab kon bacha or mra vo duniya janti h", "nationalist.sahil": "i support godse❣️", "mr.sohel.ali": "Desh k gadharo ko goli maro godse k bhakto ki gaand p aatankvadi bhusdi ka godse godse ki ma ko angrezo n choda tha", "name_is_gaurav_": "🤣", "niteshmeena1998": "Acha hua mar gya apni poti or ashram ji womens ke sath nanga nhata pr sota tha or esa admi ko jinda rhena ka koi haq nhi hai na tha ma rhega . Ase logo ke liye bhut se godse peda honge 😡😡😡😡😡", "lokpal_singh_ahada": "Great Godse.. ❤️", "avi._thakur21": "I support CAA.", "gour.mubarik": "Ye kb howa", "saffron__anku840": "Dil se toh Ap bhi nhi chahti Swara jii ki Godse ko bura bola jaye dil se toh Ap bhi manti hai ki Jo hua kinn circumstances me huaa", "ultimateprince": "Most of the people do not know that Mahatma Gandhi was not responsible for the partition of India. Jinnah and British were. While Nehru and Gandhi were against the British, Jinnah offered to be their ally if they created Pakistan. He even visited England to meet the King and Queen. British wanted a place to station their cavalry against Russia and to keep their strong hold in Asia after India got independent. So British thought of Partition as a profitable deal. So they chopped the country in two and left the bitter enmity between two lands till the end of time", "viraajkakade": "Nathuram godse zindabaad🙏", "iam_peshal": "मजा आ गया yehhhhh😂😂😂😂😂", "imshinpaul": "Mujhe ghanta farq nhi pdta haai Gandhi kya tha", "namansahu500": "Yahi hota hai jab berozgari sar pe chadd jaye...ab toh harpic ke add milna bhi band ho gaye isse😂🤣", "utsav__r_a_i": "Goti Gaayab", "brijesh_gulgul": "इनका मरना दुखद था पर जरूरी भी था", "decoybrian": "Tere bap hai kya ye randii", "dishanichauhanrajput": "The best thing ever done in history was by Godse and respect him", "surender.singh.54922169": "Support CAA NRC", "_ra_va1": "Jinko bi CAA NRC ka protest karna hai toh Pakistan jaoo India Khali karo wase bi sale tumlog jaha bi rahete ho gandagi falate ho sale maccher sab kahte ho India ka aur Naam lete ho Pakistan ka", "sandipkushwah760": "Good", "swaresh.java": "Agar aap Gandhi bhakt ho @reallyswara to gandhi ji ne chaurichaura ka vakya hua tha tab unhone asahkar andolan piche liya tha vo to ajadi ke liye tha tabhi unhone itna bada faisla liya tha app to shaheen baugh main deshdroh kar rahe hain", "rushabhkulkarni99": "Great work ghodse ...U are a piece of shit .. #democracy #freedomofspeech", "nish_s42": "Gandhi is not rashrapita... Savarkar is rashrapita .", "sovan_pani": "Asli azadi ka din", "tanishgupta390": "Late Shri Nathu Ram Godse Zindabaad... U r truely.. A freedom fighter.... Jai Shri Ram", "cutbead": "😭😠😢😥😭😠😢😥", "manoj.6234": "😭😭😭😭", "indrajeetsinh__jadeja___": "150 rupiya dega 🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿i SUPPORT#CAA", "khufu106": "nathuram❤️❤️❤️", "maharshi_65": "Nathuram godse zindabad", "luvnluck1208": "The most beautiful picture. He got what he deserved. He was held responsible for what he did. None.. like none of your posts show any positivity. They are down right cruel and cheap.", "shutupyabrishti.__": "No you're wrong this painting is painted by an Assamese boy not Tom Vattakuzhy", "riyeah01": "Two chicks", "sumit_pedgaonkar": "Wa mja gaya dekhkw", "snaya_thakur": "God zinda baad 🙏🏻", "shaileshprajapti001": "Ab note pe bhi esko nikal ke bhagat sigh ko rakh do", "_vik_ing_ram": "Communists are such a bastard...... gandhi ji ki death pr b politics kr rhe h.........", "pikkikumarsingh": "😂Tum the kya Hey ram sunne ke liye khade the kya waha pr🤣", "onlymemohit": "Teri gand pe b aise hi goli padegi", "tipnis_dhanda": "I think this was the best thing dome in the indian history. You stupid woman", "saad___madaniofficial": "#godse ki uolado ko goli maro salo ko", "s.mishra.37669528": "Main aapki footsteps follow karna chahti hoon. Ungli kaise karoon chut mein maam thoda sikha do.", "chetan.h.maru": "walk on sambhaji's footsteps not those who killed him", "thenameis_mdkaif": "Nthuram godse ki ma ka bhosda rndi ka bacha sala", "nachism_10": "Ppl in the background are having massive orgasm !!", "khatana_dhananjay": "Fate of traitor", "sky.8545": "Ghodse jindabad", "madnanineeraj10": "🙏", "_kunal._thakur": "I support caa", "parth_7977": "Nathuram Vinayak Godse🙏🏻🙏🏻 Three shots at point blank range on the chest of Gandhi💪🏼", "richa_sharma1060": "Think like a wise person not dumb and hypocrite like u", "i_am_1308_sharma": "😂", "vishal19972014": "I support caa#", "sanjaymehta__": "Kuch nhi hona tumse , ye aise hi krti rhogi tum 😂😂😂", "warm_blood_ud": "ये एक विनम्र गांधीवादी के बोल हैं ... भले ही आपके पास Doon, DU, Harvard, Cambridge के certificate हों ... अगर तमीज और अच्छे संस्कार नहीं तो अनपढ़ होना कहीं बेहतर @reallyswara", "rk_nits_2424x": "Jay godse 🔥🔥", "panchalbhavesh90": "Think again..!! Are you following his footsepts??", "riazbabar": "اچھے لیڈر قوم بناتے ہیں۔ جاہل گوار چائے بیچنے والے نے ملک فرقہ واریت اور خانہ جنگی کی طرف دھکیل دیا ہے۔ جو لوگ فہم و فراست اور تعلیم یافتہ ہیں وہ یقینا اس لڑکی کے ساتھ ہیں۔ جہالت اس کے خلاف ہے۔ بے وقوفوں تمھارے اپنے گھر آگ لگی ہوئی ہے اور تم لوگوں کی یہ سوچ ہے۔ ہمارا ملک دہشتگردی شکار رہا ہے ہم سے پوچھو کہ ملک میں انتشار ہو تو زندگی کتنی عذاب ہوتی ہے۔ ہوش کے ناخن لو ملک کو سنبھالیں ورنہ یہ چائے والا تم لوگوں کو برباد کر دے گا۔", "the.splendid.life": "@reallyswara Agar time mile to \"why i killed gandhi\" padh lena. Vse ik you are really busy brainwashing muslims, kyuki movies m to kaaam nhi milta ab.", "shivangi6260": "Total political view,,,,,,,don't worry u will definitely get Congress /left tickets so far", "shail_kush": "Ye sali itni bevkoof kaise ho skti....jitni gndi movie bnati hai utni gndi soch hai......ye ladki jis day mil gyi na itne thapd lgau ki ye sali sudhar jaye bhosdi lahi ki", "prathviraj.dahe": "Nathuram godse ne aazadi de di", "the_parvesh_4garwal": "@reallyswara Kiske footsteps par chalne ko bol rhi ho uske jo Pakistan ki help karna chahta thha jab Pakistan se laashe aa rahi thhi hamare behenon ki,chutiya hi banate aaye ho ab Desh k andar k aasteen k saanp nikal rahe h tab kehte ho samvidhaan khatrey mai h mere liye toh samvidhaan usi din mar gaya thha jab laakho Kashmiri Hindus aadhi raat ko bahar Nikal diye gaye thhe aur iske jashn par tumlogo ne \"jashn e shaheen\" ki planning bana Rakhi thhi Lekin afsos ki hamare Kashmiri hindu bhai aagaye aur Tumlogo ka plan fail kar diya.....hope ki ola tumhe dimaag de aur tumhe 72 virgins v mile", "tausif5521": "RSS British agent BJP party hindu terriosrt killed indian freedom fighter Gandhiji .", "oyevenktesh": "Ek Number ka Bhadwa tha Madarchod", "rhooda5112": "Nikal lvde", "wrestler_sujit": "Nathuraam godse jindabad🙏", "prashantverma779": "I have 2 queries from Swaraji1) Who was responsible for Partition and who demanded separate Muslim Nation as at that time BJP was not even established another is Who is responsible for forceful evacuation of Kashmiri Pandits?", "faddie87": "Godse was a terrorist.", "karannn_rajput": "hypocrasy exposed", "thejoblessindian": "Best day🔥", "pranay4u": "'Popat' pe bhi goli maar di thi kya?🤣🤣", "divyanshichugh04": "😂😂", "krishan7167": "swara bhaskar Randiiii ha", "pervez.anna": "😢", "author_rishabh": "Not-dear swara, don't forget it that bapu gets devine and glamour because of godse.", "vivekjais1210": "Sahin bagh me Delhi wale nhi jitmee muslim community ke log wo pahuche baki log kyo Jaye 💪", "lijad_": "Shameless filth. At least on this day drop your habit of showing your useless political views and just mourn. Wish you were there in place of Mahatma Gandhi", "shreyas_lyer_ind": "Gandhi madherchod", "princegupta675": "🖕🖕🖕🖕", "110ayan": "#nathuramgodse #terrorist #rss #terrorist", "proud_looser_123": "Tu martì kyu nai kutiya", "atultiwari.raj20": "Tum hmesa Propaganda failati ho..... Savara vampanthi", "warm_blooded_rajput": ".skl dekhi ho", "mdwasim4063": "Godse murdabad 😡😡😡😡", "sidhu_parminder88608": "fudu banda c mrr gia", "reallyrehman": "बड़ी अजीब बिडम्बना है कि गांधी के देश के लोगों ने ही गांधी को सबसे कम पड़ा और समझा। अगर युवा पीढ़ी आज तबियत से गांधी को पढ़ देती आज हमारी पीड़ियों का ये हाल ना होता आज भोर दुपहरी एक कर युवा पीढ़ी फेसबुक और ट्विटर पर कर रही है यही वजह है कि आज तमाम फेसबुकिया ज्ञान हमारे पास मौजूद है जैसे बटवारे का कारण गांधी को मानना और गांधी जी को मुस्लिम परस्त कह देना तो मै ये कह देना चाहता हूं कि गांधी से बड़ा कोई हिन्दु नहीं था लेकिन गांधी के 'हे राम!' से बाकी कौमें डरती नहीं थी गांधी किसी व्यक्ति का नाम नही है गांधी एक विचारधारा का नाम है और विचार कभी मरते नहीं है सदैव जीवित रहते हैं बापू को सत् सत् नमन 🙏🙏🙏", "chaku_i.baranda": "🙏🙏🙏❤️😢", "surenderkashayap": "🤣🤣🖕🖕🖕🖕🖕🖕🖕", "vaishali_singh__": "Ab bol na behen sharjeel imaam pe bhi kuch... Kitna hypocrite banegi?", "survir_singh07": "https://www.instagram.com/p/B75WPpvgitY/?igshid=1uttebq8mrwqq", "hows_the_josh_jai_hind": "Support caa nrc", "aishachoudhary8328": "plz chck dm @reallyswara", "vandu_1930": "He killed that fucker 🔥🔥he was lit🔥", "nilesh_singh97": "Lag rha ek goli aadh me bhi lgi thi🙄", "harkirpal_singh": "😂😂 you should also follow his footsteps and not support terrorism and terrorists .", "singh_anika_": "Godse ne ek ko maara to uska itna khandan kattarpanthi islam ki vjh se laakho log mar rhe uska koi khandan kyo ni krta?", "jayashreebapari1707": "Kahe ka gandhiii,,,,desh ko nast karke gaya be 😠😠😠😠😠😠", "garima_choudhary1207": "Father of the nation ❤", "pranayale": "🔥🔥🔥🔥🔥", "amaanahrar025": "Mam i love this painting and i am going to copy you post love you always mam💗💗💗💗 you are our ideal", "qazi_6699": "Godse murdabad", "roxx0795": "Changa hoya mar gya bhosdu gandhi nehru are the only family in politics who were killed by common people 🙌🙌🙌 rip godse, rip bhidrawale, rip sikh souls, rip those who died in 1947", "rajshree70_nayak": "🔥🔥🔥🔥🔥🔥", "ujjwal.ac.in": "If Gandhi would have not been killed by godse then gandhi's decisions after indian independence would have ruined him as well as our SECULAR India👈", "raj18jan": "Maa ki laudi gandh mat fela.", "ali_forever212": "Real swara u deserve dis name .grt work", "shyambhosale": "I think u don't know history 🤨🤨", "jigarsharma22": "THANK U GODSE JI🙏🙏", "jackkksparrow": "Disagree", "vimal6261": "Failure government", "iam_indian.1": "Gandhi pta nhi kitne phir paida hue Lekin , Godse😠 bohot saare paida ho gye hain #Gopal #bjp #Rss", "qadir.siddiqui.9": "😢😢😢😢😢😢😢😢😢", "santoshiyogendra": "Mat uthao es gadu ko", "miss_rupa_kaur": "If we walk on his steps there will be the third part of India", "forjon.ali": "Really", "abdulkhalid889": "😓😓", "mihirbhanushali": "Walk in his footsteps? Like what? Seperate India and Pakistan? Its because of the partition that we're facing such issues.", "thenameis.hitesh": "Thanks godse jo", "iamanushamahanti": "😥😥", "sumit_alokdixit": "Chl bc wo to pta h gyaan n pelo", "rightwave2020": "Hail to godse🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "moidur_rahman9": "Yes...", "meet_jas_": "Aren’t we following his footsteps? Misogyny and racism 🤔", "priya_naveen_casteline": "😥😥😥😥😥😥", "pareeknitya": "If you don't have any work to do in movies you can go to Shaheen Bagh and protect their against CAA so that you can at least get 500 rupees to shut your mouth there don't spread negativity over here in social media already you have done lots of things and I don't think that you deserve to be an Indian and get the citizenship of India", "abbasmirza3579": "दिल्ली में 6 साल से BJP के 7 सांसद व 13 साल से MCD में बहुमत है, तो फिर ये सांसदों और MCD के काम पर वोट क्यों नहीं मांग रहे?", "sourav.404": "That is why his followers mass murdered innocent marathi brahmins after his death.👏🏻👏🏻", "ashpat007": "Time to gas the abrahamic jihadist.", "rankawat_saab": "#godse", "citynews324": "बापूजी तेरे जाने के बाद गोडसो की तादात बहुत बढ़ गई है।", "arcopole_design_in": "Itni hi nafrat h Gandhi se toh jara himmat dikhao aur apne BJP/ RSS aur jo bhi h aandu pandu ko bolo khul kr nafrat kre Gandhi ji se.  Muh me Gandhi dil me godse.  Abhi tak aisa koi ghatiya word nhi bna h jo me keh saku Godse supporter ko . Haram ki azadi mili h na haramigiri krogy hi.", "tausif.gsm": "I was in San Francisco last week on Republic day and I saw that English people respect him more than us, Yhey have a statue of Mahatma Gandhi at San Francisco Bay Area. And in our nation, people are so not worth him👏", "sweetginzy": "He deserved this....Coz of playing politics for Bhagat Singh's execution", "murugan9588": "😢😢😢", "sharmadevenra": "😂😂", "adv.zeeshan.5": "❤️Godse killed Gandhi but we aren't telling them anti national.They are supporting to take law in hands. We can see their ideology.", "navneet_1554": "An incredible truth presented.👌🏻👍🏻", "meghachokhany": "गांधी के देश मे रोज़ गांधी की हत्या करनी है... बहुत से गोडसे तैयार किये जा रहे है, ये नए गोडसे भी धर्म की अफीम के नशे में होते है, न न धार्मिक बिल्कुल नही होते, बस नशे में होते है, ये सोच-समझ नही सकते, गोडसे भी सोचता नही था, उसे लिखित बयान उसके गुरु ने उपलब्ध कराया था, उसे बस बताया गया था कि तुम धर्म का काम कर रहे हो । कसाब भी अपने आका के अनुसार धर्म का काम करने आया था । ये पागल देश-द्रोही रबीश कुमार रोज कहता था कि ये आपको हत्यारा बना रहे है । भीड़ को उन्मादी बना रहे है, उसकी काली जुबान सच हो गयी । हर गली नुक्कड़ पर ऐसे गोडसे तैयार हो गए है जो खुद को रामभक्त कहते है, राम की मर्यादा न कभी समझी - न समझना चाहते है, इंसान जिसका वो भगवान की तरह गुणगान करते है वो बिंदास झूठ बोलता है । सबसे बड़का झुठठा के भक्तों को मर्यादा से क्या मतलब उसे राजधर्म समझाने के सभी प्रयास विफल हुए, अब उसे चुनौती देगा उसका ही हनुमान कौन है बड़ा हिन्दू हृदय सम्राट एक गेरुआधारी बोला, असली योद्धा मैं हूँ हनुमान ने डाँटा, तुम्हारी क्या औकात? अभी मात्र 20 कब्र खुदवाई तुमने, हम हजारो के ऊपर चढ़ यहां पहुंचे है । हमसे मुकाबला करने में तुम्हे समय लगेगा, लेकिन इनका खूनी खेल यही है, यही सियासत है, डर की राजनीति, क्रोनोलोजी समझ ले पहले आपको डराएंगे, बताएंगे कि आप खतरे में है, आपका धर्म खतरे में है, आपकी माँ-बहन-बीवी-बेटी सब खतरे में है उन्हें बचाओ - हथियार उठाओ वो गद्दार है - उसे मारना देशभक्ति है वो तुम्हारे भगवान का दुश्मन है उसे मारना पुण्य है फिर आप बन जाएंगे कसाब, मुझे दिखते है वहसी कसाब और गोडसे हर तरफ घूम रहे है, दिखते है उनके शातिर गुरु, उनके हैंडलर, टीवी-व्हाट्सएप-यूट्यूब हर जगह, वो दिमाग को शून्य कर सिर्फ नफरत की खुराक दे रहे है । उन्हें प्रेम भरे दिल से नफरत है उन्हें सोचने वाले दिमाग से नफरत है उन्हें चाहिए बिना सोचे-समझे सिर्फ बेइंतहा नफ़रत करने वाले अंधभक्त, जिनकी मुँह में गाली हो, बंदूक में गोली हो गांधी जी को रोज मारेंगे एक बार मार कर मन भरा नही हर चौराहे पर मारेंगे फिर एक दिन इन्ही की भीड़ इनसे रोजगार मांगेगी रोटी मांगेगी", "hasim_statham": "He was a great man. The whole world should learn from them that we should never promote non-violence. Great man Mahatma Gandhi and a loh purush", "robinsingh.t": "Swara Yeh tune kya kiya", "sony6464": "😢", "baahubali.khan": "😢😢😢😢😢", "namanngarg": "😢", "aishoaibfarooqui70": "😭😭😭😭😭", "nareshsolanki9664": "👏👏", "keralagodsowncountry14dt": "😢", "architectjasmin": "How painful it must have been .. this brings shivers .. this art has so many layers of emotions ..", "sajankhan306": "Love you a lot dear Swara 😎🙏👍😍☺️", "ritesh.r.mishra": "DESHDROHIIIII sali. Tu to rahne hi de . Godse jaise mahan log aaj hote to tere jaise deshdrohiyo ko kab ka nibta chuke hote. Jake gande nale me dub ja Pakistan ke.😡😡", "neekidaola": "😂😂😂", "karkera7557": "Isko koi India se nikaal do yaar", "atuljaiswal029": "@reallyswara u flop actress", "mabdi110": "@reallyswara 😂😂the man who stood for justice freedom and dignity.", "shekar6961": "Jai Godse", "pankaj.kumar8258": "😡", "__highbrid__": "Godse waali Azaadi🎯", "imranalam259": "जिस गोडसे ने हमारे हिन्दुस्तान के बापू जी को कतल कर दिया आज उसी आतंकवादी गोडसे को पूरा बीजेपी पूजता है । आज हमारे हिन्दुस्तान में बीजेपी की सरकार नहीं बापू के हत्यारे गोडसे की सरकार है", "mfarhan.in": "Ya Allah ....humare baapu ko Marne valo se badla dilwa hume", "valiyajaved": "What an amazing man he was", "chirag_patel345": "Madarchod tu vampanthi hai or ghadhiji ke footsteps pe kaise chalti hogi ghatya aurat", "babybiiedoll_london_": "😥", "only_patidar_patidar_patidar": "Budha mr gya 🚩🚩🚩", "sankalp_2003": "Godse zindabad", "_thewildguy_": "Kya baat kya baat kya baat", "mohitfrank007": "Jobless 🙌🙌peeps", "cya.xiya": "F 🙏", "couplespictures19": "Same on you", "dhruvtuteja": "and the best day in indian history....👍", "desaijayati": "Get Lost @reallyswara!!Dambooo !!IDs banae ka dimag to hai nahi aur bakawas karti reheti hai!!", "ghildiyalpankaj": "Jai hind🙏", "saurabhosle77": "Celebration", "cyberpunk._": "Gandhi ki maa ki chut😂", "abhimanyusingh595": "Bhagat singh was the real freedom fighter.", "navindersony": "30 jan.1948 day repeat on 30 jan. 2020..", "pagal_mon1": "❤️💓", "aekansh610": "God_se 🔥🙏", "prawinkhalkho": "Gandhi was rapist and fraud do some research.", "therockstar2210": "Hey raam😯😯", "beautyofbollywood1": "👍👍", "bhanu.maurya": "This is happening in shahinbag", "baldev4755": "Miss you", "her_aasis": "Lodu hai sala", "jungle_book_1": "❤️", "thesachinparas": "🙏", "ad_i_l1341": "आज जामिया के student protest पर एक और गोडसे ने हमला किया😥😥", "_seekmystyle": "❤️❤️", "marshallharsh": "Kitne godse maaroge har Ghar se godse niklega", "akash.badal007": "Don't pull politics in this. Do the job u are good at.", "neerajsingh9532": "Ysss ma'am....Like sharjeel imam", "bobby_rajput_77": "😂😂😂😂😂", "liferacer_preet": "ye deserve krta tha ese mrna tabhu mra 👎👎👎👎karma played with him", "guravprathmesh": "😂 Gand Di G.. Acha hua bc. Mardiyaa.", "gypsysoul_10": "Ur bio itself describe u draamebaaz..", "sachin_sharma8": "Listen Nathuram Godse also once!!", "jayeshshahane": "Proud day 🥳🥳", "tanweer_007": "Nathuram Godse murdabaad😡😡", "sha_noor_ch": "Great gaandi g lov from Pakistan 🇵🇰", "mshoaib0707": "😢😢 Nowadays people's are become blind they don't know after many sacrifices we got independence from Britain 😔😔😔", "imkanti_gupta": "🙌", "vicky.tak": "बड़ी गलत जगह पर गोली मारी गोडसे जी ने एक तो 😂", "2713soundab": "Painting is nice but you please follow whatever he said and practiced himself. Can you? Last year there was Martyr's day. Where was your post then? Why suddenly now? Was he alive last year? He couldn't even save bagat singh the most valiant freedom fighter who was hanged when he was just 23. Baji rout samman was 12 and youngest to be shot dead. Where was this Mahatma then? Where did his non violence come to help? Understand if some people do not prefer Gandhi. It's for a reason that is more deep than what I've typed here.", "nikit_wal": "👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊👊", "chuslim687": "Movie me Vibrator aur Ungli🖕🏽 karte waqt Gandhiji yaad nahi aye kya????", "rajat_007": "Abe kuch productive post krlo kabhi. Bus aag lagane ki koshish hi krte ho 👎", "satyajitghadage007": "Tukde Tukde gang....... 😮😮", "nourel82houda_": "💖", "neetusingh3955": "🇮🇳🌱", "sumanamar1975": "JAY BOLO HANUMAN KI MAA CHODO MUSALMAN KI 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "nihad_niyyu": "😢😢😢😢", "jeetu_011": "But this pic is very desturbing @reallyswara", "imtiyaz161": "Hey Ram", "1nonlypanday": "Bura hua intni der me mara phele Marta to Desh kub ka aazad ho Gaya hota", "dixitvakoter": "There is a whole difference between killers and lickers ...", "rose.roshna": "🇮🇳❤😪", "vishal_svj_63": "Mukti de dia 🤗", "devavratd": "Really Swara???", "bhavuk.anand9": "Bhardkani ki Rajneeti band karo... Fuck Lal Salam... Jai Ram🙏", "vishuu2689": "@reallyswara sarjeel ki rakhel🤣", "abiltoriya": "Yarrr ye chutiya ho gae kyaa be.....", "zarya5670": "😢😢😢😢😢", "rajput.vikas.5439": "Ek number nautanki", "ashishmiishra": "😂tujhe or koi kaam ni he kya", "8914sahil": "BJP. Hatao. Desh bachao", "sarbjee1062": "Kutta ek no.ka", "agirlforherwords": "🤣🤣🤣🤣🤣🤣🤣🤣", "xrandhirx": "Iske saath sahi hua tha", "prince_kr__choudhary": "Nice painting 👏 👏 😂", "venkatesh7864": "😢😢😢😢😢😢🙏", "shivashiv123": "☹️☹️☹️☹️☹️😥😥😥😥😥😥", "umesh_s.yadav": "😥😥", "zoyyapeerzade": "Thanx swara fr support..proud of u..Gandhi ji k bareme jo padte hain vo jante hain unko uneducated log ko kya pta kya kiya unhone is desh k liye..", "raj290078": "😂😂", "devansh_007": "Fuck u gandhi", "pareekgajanand": "Godse Jindabaad", "krishnakantpal": "👌", "faris_sha_": "😓😓🔥🔥🔥🔥", "snowangel17539": "He Ram ❤️❤️❤️❤️", "neha_nehu109": "😢😢😢😢", "pratikkpopat": "The best thing that has happen in indian history 😂😂😂😂😂", "thakursolace": "😂😂😂😂😂😂😂😂😂😂", "tarunchoudhray": "😢", "naseemkhan_shaan90": "🇮🇳🇮🇳🇮🇳", "pawan.kumar.568089": "Godse great", "meetcp": "जहां प्रेम, वहां गांधी गांधी मेरे लिए नफरत का लिटमस टेस्ट हैं। गांधी से नफरत करके भला कोई कैसे समाज से प्रेम कर सकता है? तुम खोखले हो या मक्कार, यह खुद तय करो। गांधी के सामने शास्त्री को रखते हो! मैं कहता हूं- चलो, गांधी छोड़ो, शास्त्री को ही अपने जीवन में उतार लो। तुम गांधी के सामने आंबेडकर को रखते हो? मैं कहता हूं- चलो, आंबेडकर को ही मान लो। तुम गांधी पर हमले सुभाष के पीछे छिपकर करते हो? मैं कहता हूं- गांधी छोड़ो यार, सुभाष को ही मान लो। तुम गांधी के सामने भगत सिंह को रखते हो? मैं फिर कहता हूं- गांधी को छोड़ो, भगत सिंह को ही मान लो! मगर नहीं, तुम्हें इनमें से किसी को नहीं मानना, क्योंकि इन्हें मानने से तुम इंसान बन सकते हो। इनमें से हर एक ने नफरत के खिलाफ एकता पर जोर दिया है, इनमें से हर एक ने हिंदू-मुसलमान को एक रखने का प्रयत्न किया है, नफरत के खिलाफ मानवता पर जोर दिया है। कट्टर हिंदू हों या कट्टर मुसलमान, उनकी आंखों में गांधी चुभते हैं, क्योंकि उनके खूनी मनसूबों पर गांधी पानी डाल देते हैं। मेरे नजदीक कोई दोस्त हो या दुश्मन, अगर वह गांधी से चिढ़ता है, उनसे नफरत करता है, तो मैं मानकर चलता हूं कि अपनी जरूरत पर यह मेरी पीठ में गोली मार देगा या सीने में खंजर उतार देगा।", "deven.a.parkar": "Ye celebrity famous hone ke liye aur sympathy pane ke liye", "shamreenasaad": "@shrootie omg could it be the same tom vattakuzhy😬", "pandeychanchal": "Godse jindabad", "ashwani2127": "Aapse expected tha in sarcastic way...cz u r a indirect politician now", "bhuvanesh450": "Ye phle b goli mar chuke h..fir b vhi chilla rhe h..", "manju_jagwan": "behan @reallyswara tumse na ho paega na bollywood mein or na desh k hitt mein.😂😂😂 keep barking #jaihind #isupportcaa #jaishriram🙏", "godspeeddanish": "Long live the Martyr Bapu", "abhishek29.nice": "Sacchi azadi Ka din ajj celebrate karo", "online1592shopping": "❤️❤️❤️lovely mam", "about_to_fly": "In previous post you said ladenge and jeetenge now you are saying you are following Gandhiji path'' are madam kya ho ap kha se aai ho🤣🤣", "pakistani_together_": "😂😂😂", "amirmaq1": "😰😰😰😰", "sanju_raj123": "Kuch na kuch kar ke famous ho na hi h", "rsin282": "RIP Bapu.", "vipulasharma84": "Swara... Unka killer barso pahle apne kiye ki saja paa chuka h. Aapse isse jayda samajh ki umeed thi.. Ye celebrity ka chashma utar k dekho... Sachai kya h... Aap ki itni padhai bhi aapko sacchai aur jhut ki samjh na de pai to vo kis kam ki h.", "payalsingh465": "Bas ho gya madam kam chado", "r.s.exotics": "Mamta is from Gandhi age?", "saud_bin_riyaz": "गांधी हम तेरे आभारी हैं, इंकलाब अभी जारी है 🇮🇳❤️", "_jassica_fernandes_": "❤️🙏", "chethanbaba": "Same to u....", "bombay.balloon": "🔥💯", "satyansh_001": "Gandhi ji ne to matra bhasa ka adhik se adhik istemal par bhi jor diya tha na.", "iamshadabchauhan": "😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭😭", "mdshoebruh12": "😢", "chakraborty02": "He died like a dog,thankyou nathuram", "qxakash": "Good job godse 😎 my hero", "sibjack": "Well said. Godse Murdabaad!", "iam_idri5": "Jin logo ko is Pic ko dekh kar Afsos nhi Hora. ayse log Mulk se muhabbat hi nhi karte. in ke zahno me Bugz bhara hua hai.#india @reallyswara #mahatmagandhi Great Art 🇮🇳 👍", "panditt_ak47_": "MKC Gandhi ki 😂😂😂😂", "mr.ishanarora": "Good things came very late.Bloody blood", "m4nsi_____here1717__": "😭😭🙏🙏🙏", "chitr.akar": "@reallyswara This is such an amazing art ❤️ All love to @tomvattakuzhy", "umair_11kadri": "Comments dekh kar pata chalta hai ki unpad logo ki kami nahi hai hamare desh mein 👏", "mr_cardiologist_abhinavrao": "Sometimes the truth behind is different than the propaganda which was spread. May be the killer was right in killing. Introspect why did he do tht. Then u will know the karname of some age old politicians who in the mask of goodness and rightiousness did to our country.", "kumar_manish09": "😢", "navin_kumar_choudhari": "Love u killer", "asimhyd1": "Swara u r a brave woman.", "dilipkatkar007": "❤❤❤", "shahaji_shejul": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🏻", "akrammujahaid": "😢", "mer30vas": "CAA is just part of larger problem, . But real problem is with NPR - NCR.. With idiotic demonit... With govt bankrupting RBI /PSU..with govt misusing ED/CBI /IT... With mass unemployment... With university /JNU attacks.. With govt stifling our democratic right to dissent... With govt deliberately creating division in society..ever since BJP came to power there's only gloom/doom & chaos in nation", "navdevi": "💐💐❤❤", "shadow_dagger_": "swaraji can you please tell me his paths cause i dont remember he had any casualities during indepenedce ,all the pain suffering ,everything was taken by krantikari sena and you piece of shit still chanting gandhi gandhi just like he was the reason behind independance", "rafik_mirza999": "💐💐", "hasan.jd": "Tea maker is a killer of innocents who will destroy india", "himanikabansal": "Go get a life @reallyswara live and let live others with peace. And most importantly, take out time from chaos and read the bill properly.", "zarin_saba_sk": "You go girl... U r such a bold lady who have courage to say the truth", "its_mee_prashant_choudhary": "Kuch bhi kar lo... Tum chunav nhi jitogi... 😂 😂", "jeetendra1402": "❤️", "firebrigade69": "😂😂", "w_o_l_f__302": "देशद्रोही दल्ले कभी भी गुजरात मॉडल की इस सच्चाई को नहीं दिखाएंगे, इसलिए आप देशभक्तों को ही इसे आगे #Share करना होगा। 👿 ⤵️ https://youtu.be/gcNFAXQyFtc", "_het.shah": "Agar aaj godse zinda hota toh tu nai hotii!😂", "babasai1982": "🖕🏻", "coffeelicious_dz": "It's scary how these uneducated bhakts hate Gandhi & support a terrorist ,an assassin & a murderer like Godse 🤓", "mr.___goldsmith___11": "Jai godse Me bhi godse💕😍🔥", "siddiqui_tazeem": "Godse ne gandhi ji ko 3 goli maar kr shaheed kar diya tha lekin ye godse ki aulaad bhul gaye ki gandhi ji ki vichardhara aaj bhi hmare dil me zinda hai jisko ye kabhi nahi maar skte", "anuraag_2705": "He ram", "rintinintin": "Martyrs are the soldiers in the army who are being abused by assholes like you in Shaheen bagh", "sunilswm46": "Bapu marta hua bhi ek dum sexy lagta h.", "shaan_1101": "RSS Murdabaad", "macho_0087": "reallyswara I respect uu👏", "saurabhsingh28": "Kya bol rahi ho...tum akal se paidal he ho...Inke ladmo pe chalo aur ek aur Pakistan bana do...tumhara naam to swakra khan to nahi hai....ye bhaskar lagta hai jaan ke lagaya logo ko bewakoof banane ke liye", "svinayy": "He’s no saint ... for sure", "official_bashya": "आजादी थोड़ी ना चरखे से अाई थी", "lohit_gowda7": "Sahi jagah mein goli maari hain Ghodse bhai ne 💥💥hey ram 💥", "niranjan_b18": "Swara ko aajkal movies nahi mil rhi kya.?😂😂😂", "mdali3277": "😢😢", "tusharvasandani": "Movie milna band ho gaye hai na", "bikashappughar": "उफ्फ", "nimilmathew": "😢😢", "ranjan.atulkumar": "Well said swara ji 👏", "ashutosh_vader": "Bhagat singh ke footstep pe chal sakti???? Aaukaat nahi hogi tmhari...", "pmalviya269": "Gandhi ji ne patel se kha nehru ki haar meri haar h ,to patel sir ne p m ki kursi chod di ,.", "openwhiteshut": "There is a fantastic article in Hindustan times today about Gandhi’s philosophy and his assassination. Beautiful thought !", "madan2292": "Hats off", "jawncay": "Wat a painting🙌🏻🙌🏻🙌🏻", "abajaj1978": "But why. You only mean that we keep suffering because of bunch of secularist making fool of people", "moneyishhh": "@reallyswara Such a increadible powerful painting... Really had goosebumps🙏", "yogesh_khatore": "😂😂", "ninoaleem": "@naushad316 read comments", "rahim_0717": "The great bapu🔥🙏", "krishna_sai_ka_diwana": "Only playing prank to be a gandhian...but didn't understand the gandhian philosophy. Much hatred in your mind. May god prevail good wisdom in you.", "pandya_dhiren": "Godse the God..😍", "soyashraf": "Aap ki soch great hai mam👏", "patel.sanjay.14855377": "👏MOHANDAS GANDHI IS A CRIMINAL HE PARTICIPATE INDIA INTO THREE PARTS ONE IS PAKISTAN OTHER IS BANGLADESH AND OTHER IS INDIA...HE IS A TERRIORIST TOO...WE INDIAN HATES GANDHI...GANDHI IS NOT A GOOD PERSON..HE ALWAYS SUPPORT DANGAH FASAD AND TERRIORIST TOO👏", "herinfrancis": "😢😢🙏🙏", "atwal4706": "Ganda sala eh", "navneet923242": "Swara Bhaskar you really need to study..I guess you are interested in politics..acting mein to kuch hua nahi abhi yaha sasta stunts karke jagah Milne ki aas", "iamanushachauhan": "Lol", "argumentative_advocate": "Who is his killer? Godse? Can you show me the jugment where godse is convicted of killing him?", "aj_shaikh1": "😢😢😢", "jitendra.krishnajeet": "He is the pulsations of our hearts and that will go on & on ! 💓", "seema.tanwar4": "Acha hua maar gaya sala vanrna or desh bat deta🔥", "aman_rizvi1997": "#NGKMKB", "duhan5823": "Nihayti bakwass orat h", "yogita_malik_08": "@cinderellatopno", "itsmasihhere": "@iamjuhichawla 🧜‍♀️", "_ayan_rizvi_7": "Atleast she speaks for the country unlike the other BiG sUpeRsTars who are behaving like nothing's happening or scared to speak", "sofiakhan27": "@narendramodi 🙄🙄🙄", "ugly_little_beast": "Did you even try to find out why such an important man was killed ? Just cribbing around without knowing anything..", "shashwat_kesar16": "You mean to say walk with Rahul instead of Mr. Modi👍..... wow!!", "i_am_sagar08": "पूरी दुनिया में पसंद किया गया। भारत में ही मारा गया। इससे ज्यादा शर्म की कोई बातनही मेरे लिए।।", "zeeshanhaider541": "😭😭😭😭😭😭", "chirag_vacheta_01": "Kadi Bhagat singh , rajguru , sukhdev ko bhi yaad kar liya karo🚩🚩", "ii.amalverse.ii": "Hame pata hai kiske footsteps par chalana hai..tumhe batane ki jarurat nahi hai", "shishir.varun": "Good to see that you don't support Bhahat singh who also played a vital role in India's Independence", "drahul_kr": "#nextsuperpornstar", "mayankkatiyar11": "Gandhi", "aakashb786": "Tu kitna bhi uchak kuch nhi ukhad sakti....😂", "dr_areesha06": "💔💔", "tawajjo": "Samvidhan se desh chalega , har nagrik ko nyaye milega.", "jolie__laide__": "💕🔥", "gauravkalyug": "Jayram YAMRAJ", "yash_111_": "Please get acquainted with History and then post this", "iamsanach1": "@reallyswara Phupo Ban Kar Aag nah lgao! #Bepositive", "shuhaibhamza": "Rss terrorist kill the our father of Indian", "shahidali92gmai": "GANDHI JI JESE MAHAN INSHAN KI JARURAT HE HUNDUSTAN KO", "sweetjaat": "Chall sali kon h ye Gandhi", "lostboy270": "Headshot mara godse bapu ko😭", "itz_babu_07": "Gandhi Is real hero", "siddharthganguly": "Really....I think you should focus on your job...and also if you and all the people sitting over there in Delhi on the roads...want to see a better India...tell them to get their sorry arses back to work...baithne se kuch nahi milta...6 saal pehle ki sarkar ne kuch nahi kiya toh musibat aur ab koi kar raha hai tab bhi musibat...if you want to see the change...change yourself first don’t change others...#isupportcaa", "mseth8480": "हे राममममममममममममम👏", "khanasif.a_k": "Soo many people here Gandhiji divided India. I ask them konse speech ya kaha bolaa unhe division chahiye. They go blank. I can show them Savarkar and Jinnah called for separate nation. Hindu Mahasabha formed alliance with Muslim league and also passed first resolution for a separate pakistan(It is legally documented). They go cannot answer it. Whatsapp mat padho itihas k panne kholo.", "ole_juneja": "Strong message there.🙌", "mudassar_hajwane": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "hasnusheikhu55": "😢", "bushrasiddiqui53": "🥺🥺🥺", "sattymhaske": "I love this picture...Godse would have do this before Bhagat singh Fasi...He gotta to late.This Gandhi and nehru are main culprits for 2 nation theory...Kashmiri pandits migrations...These people just played a divide and rule victim card....So I solute Godse.", "its_randomfact": "Ye log sirf goli hi marte hain", "abbeth_sateller": "Are you mad ...... putting this img without any sensitive content filter.......mad women......", "jagpreet28": "First they ignore,then they laugh,then fight..finally u won..", "_arunkumar_ak": "#im support to sh. Nathuu Ram goddse........ He was a legends....he was a great freedom fighters..... Bc Gandhi bc.", "puja_ballutia": "Just curious to know, you wana join politics is it ?? Congress or AAP ?? I am a Kejriwal fan. 🙌", "ritrinoy": "first Terror attempt on Mahatma", "healingailinghearts": "The greatest man of peace and nonviolence India has ever seen and a leader for those oppressed by autocratic rulers 👏👏👏🌹🌹🌹🌹🌹♥️", "whatcolourareyourshoes": "Bro RSS literally supported the partition, yet Gandhi is the villain because?", "debhyalok": "Why are u trying u get respect by posting such posts.... We know what u are....just go and do ahh ahhh aahhh in movies...", "sk_farzan_": "😢😢😢😢", "a_xa_ta": "🙂", "sunny22567": "Looser man Gandhi esne bhagat Singh g ko fasi pe latkya tha", "saumyasushant": "Mahatma Gandhi deserved better, but not us. We deserve this chaos that we have inherited.", "hada__virat_7": "Unhone to kabhi nhi bola Aguli kro 😊😊 Lekin Aap to krti Ho na fir 😂😂", "huzaifakh4n": "😭💔", "all_things_sarcastic": "Godse was the real martyr not this bitch", "vashyajyoti": "I respect gandhiji but I think he is overrated. The man hero was Subhash Chandra Bose for our struggle of freedom. The formation of INA was the nail in British India Coffin.", "kuhu_das8": "😞😞", "toyasiin": "❤️👏 reallyswara ...", "how_is_next": "I am support CAA and nrc", "ressidual7475": "Gandhi was a dumbfuck and its good that nathuramgodse shot him !!!! Best event of post independent india", "pikachu_shivani": "😂😂😂😂", "hitler__oo7": "Godse Dada miss you 😐", "786__aj__786": "😭😭😭😭...", "abhishek_is_chilling": "Are waah, jab chauri chaura me British police man me jala diya gaya tha, gandhi ji ne andolan wapas le liya tha... Tum to man hi nahi rahi ho... Shahin bagh kar ke sare delhi walo ko pareshn kr diya. Ab to bas apne maltlab ke liye log gandhi ka naam lete hai.. #bhavpurnsradhanjali", "farhan_s_ali": "नाथू राम गोडसे मुर्दाबाद... महात्मा गांधी जिन्दाबाद", "offfical_piyush": "Incredible painting💞🔥👌", "arhan4617": "Ham ladenge Ham Aapke Sath Hain Jab tak Ja Hai Ham Aapke Sath Hai", "madhulikagos": "I really like the way u project ur character on the screen but I think @reallyswara u have very less knowledge about history. If u had gone through the books in details not the ones we study in school but the ones written by the people who have witnessed his hypocrisy and the ‘Gandhi Game’ knows it all. Who did what and bcz of them we are standing here today trying to fight for our rights be it a minority or a majority! I’m not favouring any party or any individual just trying to put some light on reality!!", "immu_emy": "Suru teri aur godse ki gand me goli marna saale", "__sumit__11__pan_hl": "गांधी जी ने कभी किसी। बस को नहीं जलाया। ओर न ही कभी देश के खिलाफ भीड़ को भड़काया।। ये है उनके असली आचरण#🙏🙏", "vikas__bittu": "Mahatma Gandhi ko q bdnam KR rhe ho ap ki ldai h khud ldo Hindu ak ho gya na gand fat jay gi 😂 such lo phle hi", "younuskhan45": "Kuch madarchod Bhakthonke gand me se 🔥🔥 aag nikal rahi hai koi CHOOTH me se petrol dalke buja sakthe bc 😂", "tirt8771": "Gandegi jinti saff ho utni hi sehed kelea or samaj kelea vhi a66e hai", "kananbuch": "@reallyswara Don't confuse Congress party with Gandhi ji and his Principles!!! ... But then to whom am I explaining!!!!", "adityaanam2016": "Oh oh unseen picture", "vaibhavkale002": "Nathuram godse jindabad", "_amyrodriguez_": "🔥🔥🔥🔥🔥🔥🔥", "_theylive_wesleep": "Ab RSS k deish drohi atanki log Yaha apni aukat dikhayenge.", "thestorytelller": "@reallyswara ek baat batao .jab goli lagi to itta peaceful mahaul sorroundings tha wahan aur Bapu ke paas itta time tha itta Slow aur painless death tha KI UNHONE HEY RAM BOLA....aur WAHAN logo ne suna ...is do words ke alawa kuchh nahi bola unhone ...matlab i am very curious koi batao ki ek aadmi ko goli lagai wo na gusse me hai na dard me hai na hi koi aur feeling bas HEY RAAM kah raha ek insan.....i am unable to digest it", "udaymanjhi0671": "🙏🙏", "shaazzz786": "🙏❤️", "bijaykumarrathore": "Lagta hai Is mahila ko kuch bimari hai", "fridahasan9971": "😔", "manmohandhanik": "We all know whose footsteps you are following and fyi no one is following Godse . It is tukde Gangs propaganda everyone knows. You are part of tukde Gang. We request u to put Kamlesh Kumari and other martyrs pic who died in 2001 parliament attack because tukde Gang was the one who assembled in barsi of Afzal and chanted\" Afzal ham sharminda hai tere katil zinda hai\" You all are curse for our country. You have disrespected our soldiers and our country.", "doi_om": "देस में कुछ अपवाद ऐसे भी होते हैं जो जिसकी खाते हैं,उसकी ही थाली में छेद करते हैं", "shah._rizvi": "Godse ka support krne walo lanat ho tumpe", "k_4_k_a_r_t_i_k_": "Nathuram godse zindabad 🤘🤘🤘", "ramcoolboy88": "Bravo lady ❤️❤️", "rajneesh6804": "Lagta isi liye tum kapde kam pehnte ho.", "sawansawansawansawan": "Caa or nrc se kuchh ho na ho lekin jitne bhi log sarak pe hare rang ka chand laga huaa jhanda liye ghumte the vo aaj tiranga me badal gya. Jay ho. MODI H TO MUMKIN HAI", "ketansingh432": "#terroristgodse #terroristrss", "shail7879": "Shame on people's around him...Not a single one tried to catch bullets on their chest ....", "nishant_2220": "Gand me dum ho swara ji toh CAA NRC wapas karwa k dikhao..😂😂😂", "magnificent.o1": "😢", "rajkumarofindia": "Kisi ka toh pata nahi tera ek din Gandhi jaisa haal honewala hai😜😅abdulli swara🤪", "mumbaikaradd": "Why you always create new new controversies..... Get some other work.... we are really fed up with you n your team..... 🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️🤦‍♂️", "habeeb_sultaniya": "गोडसे मुर्दाबाद", "anmolpathania27": "😂😂😂😂😂😂 madarchod gandu!", "rahul_patil_optom": "Next number tera ☺️", "yogeshgadekar04": "😂😂😂😂", "photomagzs": "We all know that you have been cleared from the industry so plz stop doing these thing #CAA_NRC etc etc", "uppalahsen": "May his soul rest in peace", "anwarkhan050993": "😱😱😱😱😱😱😱", "vaishali.deore": "😏", "santiibaba_thebiker": "Walk in the way of integrating the nation..rather than disintegrating it @reallyswara .. how an artist like u be so stupid in politicising the whole situation in India.. what affect is going to be there in your personal life.. as far as the new CAA .and even after NRC ?? kindly mention @reallyswara .. I just have one question to u..", "rs1905": "Swara it's open challenge to everyone like you who think Godse has done crime..Can you people explain the reason why Godse killed Gandhi?.... guess karo chawani dunga..😜", "cadabra_bra": "What if neither of them? Why are you only constricting people's choice by setting in to the same propaganda that politician's sketch. Be open to others. Maybe gandhi in spite of being great had some very wrong perceptions, maybe nathuram in spite of doing a heinous job like murder, might have some insight, maybe both of them were ploys, maybe things are beyond political", "rubeena_ali95": "😢😢😢", "kfarah378": "😢", "paramdhesi44": "🤣🤣🤣🤣", "simrankler11": "Ek pedophile ki maut par itna dukh??", "vaishhh.__": "@reallyswara just remember one Gandhi let's remember our Bhagat Singhs too.🙌", "abhijitlaha_dgp": "Beautiful pic", "amit47397": "👎🏿👊🏿👊🏿👊🏿", "pooja.priyasingh175": "Nathuram godse ne sahi kiya gandhi ko mar ke aur ye randdi sikhayegi samvidhan ye khud film pane ke liye directoro se najayj rista banati h", "ashayr27": "U godhse bhakt, u murder, u lier", "dokuta_dipakku": "❤️❤️❤️", "nagesh2494": "Godse jindabaad👌", "madhugoel712": "#wesupportCAA", "zoya_malik_1": "Gandhiji is a father of nation and on every single currency of India contain his picture while godse is a terrorist no one even bother to name him. He killed father of our nation.. Godse did nothing in Indian freedom while Gandhiji did a lot. So the person who follow godse and tell him as a nationalist so for all he us the biggest anti nationalist coz he support the terrorist the killer of our beloved father of our nation..", "aman_rai009": "Naturam godse amar rhe 🙏🙏", "_immi_99": "Freedom fighter... Legends never die..... Mahatma gandhi salute 🇮🇳 Godse terrorist murdabad... Gandhi ji ka bharat zindabd 🇮🇳", "rakesh8417": "marr gya bc", "ravisingh3878": "What about others freedom fighter who has been killed by this family....", "_pravin_gadhavi": "We knows you swara what you want from this protest. And we also know your completely flops in film industry thats why you try in politics", "sarfaraz___nawaz": "😢😢😢😢😢", "n__tanveer_alam": "😂😂😂", "khan_shab_10100": "😞", "tapan.brahmbhatt.14": "WE SUPPORT CAA 🙏", "squirel_3": "🙏", "demon.of.light_marine47": "Hail Nathu Ram Godse. Fuck Gandhi.", "ri_yayayya": "💔💔", "imashuali17": "😔😔", "art_of_mobiles": "very sad", "bing_the_funny_guy": "Haooooo.....🤣", "har.har.mahadeev": "नथुराम गोडसे जिंदाबाद।", "rohit134569": "Shame on you for all you publicity stunts and telling us that you are walking in mahatma Gandhi's foot steps. Same on you @reallyswara", "paramjeet.grover": "They may have killed Gandhi, but he still remains in our hearts.", "jaagohindu": "🖕", "nothingupta009": "And you all have to hear speache of godse why he killed Gandhi...🙏", "lakadesam": "Is nathuram godase is right ? write your opinion", "pratik.bihari": "🖕", "shilpateotia": "The guy who screwed up the whole nation..", "alikhan0063": "नाथू राम गोडसे मुर्दाबाद मुर्दाबाद", "falak_shaikh_official": "😢😢😢😢😢", "gautampattnaik93": "वक़्त की जरूरत और भारत की जुर्रत थी यह घटना, और अब उसी घटना के भागीदार को सज़ा दे कर बीत गई है जमाना... आज भी उनके लिए गए निर्णय के भर रहे हम हर्जाना, सरहद पे देश केलिए लूटा रहे हैं जांबाज अपने ज़िन्दगी होके वतन केलिए दीवाना।।। उनसे पूछो क्या है दुश्मनी निभाना!!! उनसे कहो छोड़ दो बंधूके पहनके सफेद खादी और तब मत केहना होने लगी है देश की बरबादी।।।। वक़्त आज भी है अर्थ्यवस्थाओं को सुधारने की कोई तरकीबों की बात नहीं करते!! नहीं उसके लिए कोई काम हैं करते!!! बस धरने पर बैठ कर बकवास हैं करते....", "ravikharkia": "Gandhi did ahinsa all life. Attracted hinsa. This act was the highest act of barbarism. The doer if a member of rss then for once the rss chief must be hanged to death on the streets dragged with highest brutality must be ordered by supreme court", "akarsh230888": "I wish you could be walking on his footsteps... But wo kehte hai na haathi k daant khaane k aur dikhaane k aur hote hain. This line goes for you guys....", "kiranpapi": "This man killed lack of people", "sayyedmustaq": "Godse terrorism leader bosdk usko marna nahi ta uska hath pavo thoda ke rakna chaye ta", "mechies_23": "🙌🙌🙌🙌", "prince_jha137": "Godse Britishers Ka tatta tha just like modiji is tatta of network 18. Saare aatankwadi taate Hain... Tatte _tatti samaaan.", "piyalbubun": "😂😂😂😂😂😂😂😂😂😂", "abhimanyu.prashant": "Galti unki nhi jo iss photo ko dekh ke hanss rhey han.... truth ye h ki unhone gandhi ko kbhi pada he nhi naa he samjha... i history students and mujhe tab bhi bura lagega jb kai saal baad modi -amit shah ka bhi ese he mjaak bnya jaa rha hoga. Gandhi amran ansan pr the 15aug 1947 m bangal m dange ho rhe they uska religious supporters the", "larsonansari": "😢😢", "sajith.majeed": "Our greatest curse is the independence from the British", "punjabimaanavinash": "Jo hota hai sabb ache ke liye hota hai.....jisne jab jana hai or jaise jana hai vese hi jaye ga....na gandhi galat hai na hi gordse...", "p_a_a_c_h_o": "🇮🇳 ❤", "umesh339": "So bad😢😢😢😢😢", "sanjay.baldaniya_1989": "What about netaji subash chandra bose??", "its_pankaj_tripathi": "Bahute badhiyaa kiya bhai godse ne 😂😂😂", "hemale__swag": "😭😢", "mohd_aquib_ahmad123": "Gandhi zindabad Godse murdabad", "anshu_yaadav": "...we will always follow ur footprint Bapu.", "prachi_kumari": "He was not a Martyr 😂", "imyselfjerry": "U r talented actorr but sometimes you smoke weed😂😂😂😂😂", "jhoney_dubey": "Kon hai ye buddha", "ata.0318": "@reallyswara#Brave#Honest#Stayblessed!!🙌❤️", "raj_bora197747": "Its already happens... Nobody cares...actually some of the ill minded people just make such pictures from other countries.. Not a single country following Gandhi.. Every country increasing its power and dominating others..", "gopalsoni8456": "उंगली वाली रानी को शहीद दिवस की हार्दिक शुभकामनाएं,,,❤️❤️❤️❤️❤️", "er._jay__": "Yeh na hua hota to aaj bharat ka map shayad aadha hota", "sonowal.abhi": "Any thoughts on sharjeel imam s cut off assam remark. Kashmir ko azadi chahiye aur assam hatao, is dis not anti national.", "nizamkhan2255": "हे राम😢", "vikram.bhosale3": "I was just scrolling down your post and found. Last year on same day. No post about Mathma Gandhi death. No hashtags. All i can see is your tv serials, commercial promotions. Anyway all the best for your Protests.", "sunil_pehalwan2": "Naturam Godse Zindabad", "yadav_mukesh__": "😢😢😢", "doller0070": "🤣", "drjipysanu": "👏👏👏👍👍👍👍👍", "renuka.sharma.16718": "🙏🙏", "pri.yasharma21": "Isko mrna hi chahiye tha bht syaana bnta thaa.isi ki vjaa se ajj esse log desh pe raaj kr rae h", "sanchubaba": "Ask a Bengali about real deal of Mahatma Gandhi ...I guess leftist r confused now says", "kk475678": "Jawaan londa maar diya ... Godse ji ne... 🙏", "lalukumardass": "Jay Godse 🙄", "i_m_salmansaif": "Gandi ji", "srv_tyagi.official": "Hey raam", "military_brat_o.pos": "This is the most touching/stabbing painting I have ever seen.", "rashi.umatt31": "Yeh kam godse ko bht pehle Krna chahiye tha", "salmankhanlm": "😢", "piyush.pnd.666": "You are an opportunist", "ihgupta": "Film career chala nai.. Ab politics me ghusne ki zor shor se taiyari kr rai h... 🙌🙌", "pepper_diaries": "@reallyswara Reading the trail of comments on your post, I am heartbroken to see how much hatred people have in their heart for the man who gave his life for this country and is considered icon of peace all across the globe. People are so blinded by hate that they are celebrating Godse. Disgusting and shocking. It just speaks volumes about upbringing of these self-proclaimed nationalists whose opinion is not even worth a penny. Shame on people who have sowed this seed of hatred", "mrs.adeeba.ahmed": "🔥🔥 Hit", "iamravi_15": "How about Bhagat Singh ?? Who died at his young age for freedom..", "blackphatter": "Communist believe in bhagat Singh we also love bhagat Singh but due to Gandhi bhagat Singh handed by britishers 😁 samach jao Kya khena Cha raha hu", "ipallavii": "Godse 🙏🙏👏👏", "nishchhals1996": "FUCK YOU @reallyswara", "deepak.meher.tiwari": "Isko koi movie do re bhai taki ye sab karna band kare", "aka.sh.etty317": "Finally a painting that made me happy🔥🔥🔥Godse sabh💯", "maximus__shahbaz": "People commenting about godse remember there's no godse jayanti only Gandhi Jayanti who is well known globally whereas only sanghis remember that godse😂😂😂😂😂😂😂", "simranjuneja": "Shitty person. He did shit for India. He is the reason india got divided and lives right next door to its biggest enemy to this day. He was a disappointment!", "beyond_ur_ken": "😢", "mulyankanmishra": "Target the majorities.Automatically the country will be unstable. Kal america se 3 china funded intellectuals pakde gaye. Yaha to saath me pakistan v hai.", "ranedharmesh": "Excellent work by Godse 🙏", "mriganka6": "'हाथ तिरंगा, मन में दंगा, अमन चैन को डसने वाला मैं जहरीला नाग हूँ, हाँ मैं शाहीन बाग़ हूँ'", "bhawnarath": "Did you condemn Sarjeels speech ?", "safeer3333": "💕💕", "_mysterious_boy_1_8": "Free me azadi mili he vo chutiye ayege 😂 godse deshbhkt gandhiji antinational😂 🤣 sell chl rha nationalisms 🤔", "nafees_khan23": "So true.🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "siddharthhosakere": "If only this had happened much earlier and to both gandhi & Nehru, India may not have suffered any partition at all !", "niranjan.ca": "Answer kashmiri pandits massacre before updating ur status @reallyswara", "mr_shoeb_lx": "😱😱", "pooja.sehgal": "Madam he ruined this country. He was a bastard", "bombaykaar": "@im_shreyu_r77 Are you even listening to what you just typed? Anyway it doesn't matter. Hope for you. Cheers!", "das_prasanta__": "@reallyswara Godse hum sarminda hai tere katil abbhi bhi zinda hai 😢😢", "sudesh_palav": "https://mobile.twitter.com/i/web/status/1221507805384933378", "bhanushali8007": "Sach. Y bhi hy ki jo hum jantey hy wo logo s chipatey bhi hy ...bhagwan n geeta m bhi yahi likha hy ..ki karmo ka fal jaroor millega. .aaj nhi to kal millega...isliye karm accha karo", "_ajeet_singh_rajpurohit": "For your kind information @reallyswara Gandhi didn’t ask for “jinnah wali aazadi, hinduo se aazadi, assam ko alag karenge, bharat ke tukde honge” so you may stop this drama now 😄", "basant_cool": "Ye jo sare godse ke support me bol rahe h ye sb rss wale h or whatsapp university se padhe hue h,in sb ka brainwashed ho chuka h by rss", "ranjit__007": "Shahin baag walo bhi jyada gadhar to ye godse bhakt hai😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡 jai bharat , jai bhavani🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "_cheema_canada_": "and walk in his footsteps who approved killings of bhagat singh sukhdev and rajguru 😡", "shwetapandit1220": "Anti-hindu secularism", "asyedmuzamil": "😢😢 sad Godse and rss is a criminal of mahatma gandhi.", "nafrazmohammed": "😢", "thearyanism": "Nathuram Godse badhiya kaam kiye or phle mar dena tha..", "waleedbaqeeridham": "Mahatma Gandhi teaches tolerance in Hinduism but Godse teaches Hatred and godse has too much pride in Hinduism", "narayanancivil36": "Aahan", "nitesh8709": "YAHI AUNTY KE SUPPORTAR JNU SE DESH TODNE KI BAAT KARTE THE AUR YE UNKA SUPPORT KARTI HAI", "sahilkhan18155": "Godse atankwadi tha or uski aulad rss bhi atankwadi h", "sk.aqeeb.775": "Gandhi just ko Marne wale aaj desh chalarahe", "manazirahsan190": "😢😢😢😢😢", "susmoy9336": "Who are those people who took advantage of gandhijis godly attitude and established a islamic state cutting out India's land. People are not fool anymore.", "manjit7956": "Great job godse", "sheena.dhaliwal": "😂😂😂😂", "asifshaikh2656": "😞🙏🙏 dekha mam Godse ki olade kaise khus ho rahe h murder kr ke", "wasifer786": "Jo log godse ke jai bol re unke liye -jai bin laden , jai dawood .mast log the ye jinone kaafiro ko maara 🔥🔥 aage bhi hoga", "fromjtoy": "💗", "manav.9999": "Madarchod mara h achcha h...agar zinda hota toh pata nahi tere jaise kitte aur jihadi tukde bastards ko panaah de deta India main...@reallyswara 😂😂😂🔥🔥🖕🖕", "nostalgic_____________": "Shi hua", "vickyhiwase": "हे राम", "iamvinodsaharan": "Iski pehle maarna tha", "laxman_5911": "😫", "rashidkhan276": "😢😢😢😢😢", "riyaz2062": "😥", "naushadkhan7469": "😥", "sydmohi": "❤️", "afsar_imam_00": "No one like bapu😍😍", "_nafeesahmad": "हे राम! राष्ट्र पिता महात्मा गांधी अमर रहे 💐💐 ||", "yuvrajsinh_b": "#godsewasgreat gandhi tha tab ek muslim desh alag huva ! Kya vo chahti he? @reallyswara 😂 IS BAR BILL KE PAJAME KA NADA TETE BLOUSE KE BUTTON JESA NAHI HE KI SRK JAYE !", "as98979": "bht acha kiya godse amar rahe........", "sufyan_005": "Goli Marne wale #Goli Mar chuke 🥺", "staronthehorizon123": "Absolutely wow", "prakashvijay555": "सीना 56इंच का नहीं था लेकिन बापू फिर भी solid था।बापू आज भी जिंदा है हर बच्चे के दिल में मेहनतकश के मूल💶 में सुलगती हुई आग में ठंडी फुहार की तरह", "thefayzantariq": "Great leader Mahatma Gandhi ❤️ love respect from 🇵🇰", "anugodbole": "Desh todne walo ka..\" the end \" aisehi hua , hoga and hona chahiye😎... 😎", "msd_7_dc": "N Godse❤️🇮🇳❤️", "tanyysharmaa": "Religion based country gandhi ne karayi or ab tum religion based CAA support nahi kar rahi .... contradiction ka level hi alag hai is nil bate sanata ka", "therealmanishbansal": "Ye kon h bhai", "ritusaini110": "👍👌", "el_solomon_mark": "Killers are ruling the India godse fans like amitshah, modi , actor anupum Kher etc", "mama_india44": "🤣🤣🤣🤣rip", "jabeen942": "😢😢😢", "mr_s.k.1137": "Gandhi ji 🌹🌹", "the._punisherrrr": "Chl gandvi", "nikkytyagi": "Isko movies me kam milna band hogya h to aj kal iske pas koi kam nhi h is liye ye esi post dalti rhti h esa lgta h isme jo khoon h wo Muslim ka h", "mustak654": "😢😢😢😢😢😢❤️❤️❤️", "thatcraaazygirl": "Hey raam 😥", "angadsoni15": "@reallyswara such a hypocrite", "sushmitgharat1": "What a beautiful picture, this is! This guys should not have been conceived, he should have been flushed.", "rajeev.vyas.37": "Improve your g.k. and grammar as well.", "boris_707": "@reallyswara RSS have been polarizing Hindu minds since before independence. Now it's not easy for their followers to respect Gandhi. We need a revolution to ban RSS and defeat their fascist discriminatoty hate based ideology.", "_01aadarsh": "Koi aur Kam nhi hai kya🤣", "dr.nehapethe": "we #support #CAA", "vatsal.sharma.501": "🙏🙏👏👏", "nisha.j.bhatt.3": "👏👏👏👏Well done Nathuram Godse...I think This day was d day wen India started d first steps of its success... Varna toh Gandhi aur Nehru jaise idiotic Muslim premi netaa Barbaad kar Chuke hotey India ko But watt an irony Gandhi killed a tru leader Bhagat Singh n a tru citizen Ghodse killed a currupt Gandhi Gandhi a man who was currupt in his thots in his actions n also a currupt leader who was currupt for his nation.. Thankgod he is no more..", "ishiikhann03": "@reallyswara legend never dies!!🙌 Ur caption is lit🔥", "rohit_singh_chandel9950": "Pathetic actress and part time politician 🤣", "mayank.rastogi4": "Aapke JNU wale bhaiya kuch din phle inko bura bhlaa khrhe the madam aapne kuch khaa nahi unke liye , Do shabd to bunte hai madam 😂", "ekh1ndustan1": "🙌", "patelanand5380": "Great work by Godse", "ved_vrat": "@reallyswara आप एक बात बताए लोगों के जहन में आफ नफ़रत का बीज क्यूं बो रही है? आपको कोई ऐसी बात करनी चाहिए कि आप लोगो को अपने माध्यम से समझा सके कि ये #CAA #nrc किसी भी तरीके से भारत में रहने वाले लोगों के उसके नागरिकता को नहीं ख़त्म कर रही है। लेकिन आप लोगो को पता नहीं क्या हो जाता है धर्म के नाम पर नफ़रत की बीज बो रही है एक दुसरे को भड़का रही है एक दुहरे के धर्म के खिलाफ..... आप लोगों से ऐसी उम्मीद नहीं होती है। एक तो Whatsaapp university के 95% प्रतिशत खबर गलत होती है और अफवाह को बिना पुष्टि किए उसको मान लेना मेरे समझ से ठीक नही है। सभी नेता एक ही कमरे मैं बैठ कर लजीज पकवान और कबाब खाते है और हम सभी को लड़ा रहे है और आप जैसे लोग उसमे Petrol का काम करते है, सबको प्रसिद्धि ही चाहिए, इतनी प्रख्याति तो प्राप्त कर चुकी अब और कितनी चाहिए? सरकार विरोधी तक तो ठीक है देश विरोधी होना निंदनीय है।", "gulabyadavofficial": "ज्ञान बाद में पेलना पहले ऊँगली का सही जगह उपयोग करना सीखो...🇮🇳🇮🇳 # नnextsuperpornstar", "i.arshkhan": "Still bhakts hate you🤣", "rajariyandev": "Hats of to the killer💖", "slow_cheetaah": "Sadly some of our youth idealises Godse like a god", "falaksyed786": "😥", "officialsidsahu": "I can understand kya kahana chahti ho.... But still I will support #CAA", "maggietory": "Oh caring did you even read the bill @reallyswara", "akashzalavadia": "Get some work that makes u happy 🇮🇳🇮🇳🇮🇳", "ayush12379": "😂", "bips__rcm": "Gory, yet tenacious!!", "_actress__gallery__1": "Mc m k c gandhi", "c.avilash": "Baklol", "lizaa__87": "😥😥😥😥😥😥", "navy_narwal": "🙏🙏🙏🙏", "mdkhan1607": "😥😥😥", "tantrikba": "World's famous astrologer in India .All problem solution with 100% guarantee जन्म तारीख और जन्म समय बताकर किसी भी समस्या का समाधान पायिये घर बैठे संपर्क करे 📱+91-7031334333📱 समस्या चाहे कितनी भी बड़ी हो समाधान 100% मिलेगा 1. शादी मे रूकावट (Love marriage problem)💑 2. प्यार मे धोखा (Get your ex love back)👰 3.जोब न लगना (job problem solution)👤 4. संतान प्राप्ती हेतू योग (Child problem)👦 5. सौतन या दूशमन से छुटकारा (Enemy problem)👺 6 विदेश यात्रा मे रूकावट (Abroad problem)✈✈ 7. Intercaste love problem solution 💑 8.Relationship problem solution👪 9.पति-पत्नि मे अनबन (Husband Wife dispute) अपनी किसी भी समस्या का समाधान पायिये तो अभी संपर्क करे :-⤵⤵📱 Contact no : +91-7031334333 Whatsaap no : +91-7031334333 🙏Jai shree shyam🙏", "farhanrazakhan": "😔😔😔😔😔", "abul4150": "😢😢😢💔", "vijayprakashupadhyay": "🙌", "adanurappa": "Sorry please. He is the culprit for our countries current situation", "ankit42": "Apke bhai sharjeel ki toh suji hui hogi?", "azrannnnnn": "Who was The Killer Of Gandhi Yeah It Was the Leader of The Terroists society Of India", "pratik.poddar20": "@reallyswara you are right, so I hope u will start following him soon and will stop your paid goons burning our country, people like u with double face are actually the problem creators, u want to divide country. But keep it in mind \"Ek Bharat Shresth Bharat\" is real not reel. So plz stop showing your illiteracy and get some job. #isupportcaa_nrc", "israransari114": "Allahuakbar", "smithabal": "💔", "shailesh.jadhav.9461": "Lady Jaichand spotted", "asimkhan31666": "😢😢", "ashish.godayal": "The day india got free...", "born2dance215": "Swara... Do yoy still in the favor of Gandhi Ji? Even after knowing that he is the one who have bifurcated INDIA", "rajeshsijoria": "Hey Raam hey Raam hey Raam🙏", "su_mit8587": "Aur aisi sarkar ka hume darkar nahi", "360pixual": "True 👍", "amallick1991": "Besharam swara", "manish.goswami05": "Great godse", "_hasnainakhtar_": "👌👌👌😂", "saanvi.talwar99": "Sharzeel imam kaisa hai aunty? dont walk in the footsteps of Islamic extremists", "shadab.saifi.5832": "Bahut khub painting😓😓😓👍", "innocent._.07": "😮😮😮😮😮", "sam.gollapudi4363": "Absolutely🙌", "aapkaumarsharif": "😿", "mdfarhanhussain": "Well said..ur an inspiration for many... God bless u always...", "kunalkamdar1313": "#ISUPPORTCAA"}