{"lakshya_chaturvedi": "Or jis police ki wajah se mefooz n safe h, unka pain n killing toh aapko dikegi ni...Publicity ni milegi naa aapko...Badi aai desh ki mashia bnaney, phle achi insaan n jo log marey, Dangiyo se badi toh aap doshi h, jinhone riots krwaye, logo ko provoke kia, Just remember n aapki life me b aayega kch aisa bcoz karma kisiko ni chorta, aaj aapne log marwaye, kbi aapse b aapke log bht dur jyenge tb pta chlega, ashamed of u", "devbothiya": "#boycottswara 😜", "spinelesslibra": "❤️❤️❤️", "sarcasticpahadi_": "Boycott this as this is the only who spread hate in delhi which led delhi riots...boycott this nd her movie", "payalsen541": "And bjp paid dogs barking below! They all get paid well so don't argue anyone please.its there job to lick their father's ball. 😂", "caughtinamiracle": "Never going watch your movies ever again .. u did all this drama to promote your ‘Shit Quorma’ Bitch. Go float urself somewhere", "abhisuj18": "Its a flop movie like you...", "bhaisahab1831": "💩", "yashjain9953": "❤️❤️", "bohemianchic16": "Amazing ❤️", "xt.pawar1164": "Picture toh flop hai teri", "jitendramishra379": "Swara badjaat, teri toh... 😮", "alveera_zindagi": "Thak gayi Hu Ghar walo ko samjhaakar... Jee Rahi Hu Mai apna Aksh Bhulakar🥺 Mai Roz Marti Hu Apne jazbaato ke liye.. Kabhi To sunega Rab Meri Ro Rahi Hu Mai haath Uthakar.. Tum Sinf Mai mohabbat Dekha karo. Mai Mohabbat jeeti Hu. jazbaato Mai Duniya Bhulakar. Mujhe Mat Banao Ye Gunha Ka safeeena...🥺🥺🥺🥺 Khuda Mera Bhi to hogaa Ya Mera Naam hoga Kahi Na❌. Mujhe Qudrat Ne Banaya hai Kisi Misaal ki Tarah.. Tum samjhte ho Mujhe Ek jawaal ki Tarha. In Tum jazbato ko Sinf (gender) Joda Karte ho.. Kahi ki Rahe Kahi Moda karte ho.. Tum Karo Nafrate Jitna Tumhara Hisaab hoga. Ek Din Rona Hoga Tumhe Jab Mai Begaunah Aur Tumhara Gunha Behisaab Hoga. Al-veera zindagi", "pathaniqueen922731": "😘😘😘", "yourdailyfantacy": "Kuttti", "shuaib.sayed": "It is a great sin. and one who comits it he or she would be punished in this life and in the day of judgment so boycott her movie .", "muhdilyaas25": "Nice tailor", "manan_154": "you're an amazing actor dont let the negativity get to you", "velvetluks": "Gorgeous", "dr.melanin.perfect_": "Khud hi dekh le apni movie#sickular MC", "saumya_goila": "Had the full film been released? Where can we watch it?", "atuluppe": "Never watch your movie", "kundanpradhan1220": "👎👎 g marao", "_flicker_05": "Randi saali hypocrate", "karan_tomar_rajput": "bhagg bhen ki lodi", "rawatsuraj666": "🐖🐖🐖 Thu", "nihal.dwivedii": "#arrestswarabhasker please", "_yashpareek": "Abey kon h ye aunty😂", "manumanikarnika546": "Tujhse jyda battmeej aurat koi Nahi........swara Bhaskar 🖕this for u .😡neechta ki sari hdee Parr kr Di tune pata Nahi kitne buree logo mere honge JB Tu paida hui........or un sbki gnadgi tere dimga me bhriii hui jao", "divyaiyer": "Bik gayi hai", "ashu_sanchihar": "Aunty's wale movie 😆 @reallyswara", "surajsharma5756": "Teri koi movie nahi dekhege", "kunalmvani": "No one is watching ur movie anyways 🤬🤬🤬🤬", "thevarunvats": "#ArrestSwaraBhasker🖕🖕🖕🖕", "srvines77": "Blooy criminal 😡😡😡😡people like you should get arrested", "arko_dey_bhowmick": "Suwara bhosdakar🤣🤣", "record.killers10": "Bastar k naxals ko dikha aur so v jana wahi.. lawda koi dekhne wala h.. bas bed garam kr 🤣🤣", "anuragt98": "Besharam hai ap", "moiz.compositions23": "Loved it.... ❤️❤️❤️❤️", "bhautiksuthar": "Big NO for your movie. And please act alone in second movie or whatever. Don't waste other good actors and actresses time.", "igyanendrasingh": "##boycot", "arushmrup": "Unfollow and report this account", "harshit_jaiswal_77": "You are fool... antinational... its because of you what happened in delhi..*$*$#", "varshagirnara": "Des ki gaddar ,goli maro is kutti ko", "08_vikram_": "Tatti swaraa", "semy876": "Chudel pad gai thandak Tere kaleje me logo ko bhadka ke, shame on u, dekh Delhi me Kya hua, ab kaha Mar gai.😢", "anjalitoma": "Gatiya kahi ise tu india se bahar fekna chhiye", "bablisrishti": "Bhehenchod swara ko desh se Bahar nikal Dena chahiye", "adityavekariya": "Bhadvi", "atul.vaidya.5245": "Mujhe maths sikhado didi 😂😂", "abhishrma1997": "Shame on you as an actor You should leave this country", "asskicker_manish": "kick this bitch out of India.", "johnsnow4649": "Tere jaisi bhen ki lodi ke liye randi bhi compliment bhenchod dilli jala di bhen ki lodi ne .....maa ki lawdi pta tereko kitne log mare hai dilli mein", "rajputajaysingh333": "🤢🤢🤢🤢🤢", "hows_the_josh_jai_hind": "Koi kutta B nhi dekhega magar protesters dekhenge", "frnds_call_me_lipxtick_remover": "Phr se flop", "ravi_stylox": "Aaj jo kuch bhi hua hai delhi mai usme sirf or sirf tumara hi hath hai tumara hi sara kara dhara hai agar ye bhadkau bhashan nahi deti to aaj delhi me aagjani nahi hoti..... chutiya hai tu", "kashyapdk": "#boycottsheerqorma", "grace_heart_22": "Why you guys liking her post she is nothing without us lets show her fan following power", "_het.shah": "Ek Rashtra Hindu Rashtra!", "_sanchitsingh": "Bakwaas Movie", "anirudh_deshwal": "गंवार जहरीली", "mohit_sharma_ddmft": "@reallyswara ko jail me dalo logo ko isne bhi bhadkaya hai...... Iska Sara bhoot utar jayega.... Iske jaise log hi Delhi dange me zimmedar hai jald se jald is par FIR ho or jail me dala jaye", "imrohitjoshi_": "Flop to ho chuki hai to ab politics mai try kre pr vha bhe flop 😂😂😂😂", "jatinbillionaire": "Ni dekhna Tu hi dekh 🤣🤣🤣🤣", "anuj_.m": "Same some thing about ankit sharma death by jihadi lob lawdi bhaskar", "uday_emo_03": "@reallyswara Randi. Saali acting aati he Kya tujhe", "tulsiwrites": "@tulsimalam2001 ko unblock kar 😏", "i.payaljain": "Surely looking forward to this one....#love islove", "pandeysatyam353": "ye jhuthi khabar jhuthi rally krti hai..... or or to or inka jhuth benkaab hua uss din abp news pe", "iamakhilbhardwaj": "@reallyswara wow trailer is out. Result for your movie is best flop because you are flop, illiterate and irrelevant logic provider to provoking one religion against other", "jitendrahere": "Ma'am Dildo Sahi se chal raha hai???", "fairytale256": "Lovely swara mam..", "thakurarun1991": "Bollywood mehngi randion ki dukan h....", "shivangbatish": "Fraud..", "ppallabi34": "Urban naxal!! Won't watch ur movie", "parinitagupta7": "Dumb bitch", "bishnoi_nesu": "Wow what a lady , delhi m riots ho rahe hai , logo mai Aag laga k chali gayi or ab film promote kar Rahi hai . You are shame Swara bhaskar.", "ruby.shivam": "Tabhi to hinduo ka virodh krti h ye ghatiya lady", "rohanlad669": "Report karo isake account ko🖕🖕", "poonambansal902": "Shame on you .. u r so selfish lady...u can do anything for the cheap publicity...don't use innocent people ...u uneducated women look at yourself...how disgusting u r", "_silentknight_x": "Tatti😂😂😂😂🖕🖕", "aryat58": "Ghatiya aurat actor nhi ghasti Hai tu fake femnism fake celebrity fake secularism real kutiya Hai tu", "vkas_gupta": "#boycott bkws ghatiya movie", "dazzling_da_y": "Jehadi didi aapko Hinduo ka khoon peene m maza aata h to bolo m ek bottle khoon bhejta hoon apna. Plz aap ye dange karwana band kardo na", "rohit134569": "I hope you are happy now with your hate politics and your AAP party @reallyswara, salute to you. Delhi ki halat kharab kr ke rakh di hai tum dange walo ne, shaheen baag ke anti national loog ab promotion karo apni picture ki", "_sagarhande__": "Disgrace to society", "niharika000002": "Hayy re teri guu jesii acting😂😂😂", "ameyabajaj": "Khule me hagna band karo", "shivay_89": "Tatti aurat, Twitter pe logo ko tatti khane bolti hai, khud letring muh se nikal rahi hai", "the_sonu_sharma17": "Land dekhega koi isee", "toshi_tripathi": "Flop hogi tension na lo😂😂 😂😂😂😂 D for Dumbooo", "ultimate_ruler": "Chutiya sali", "sahilrajput207": "Failure 😂😂 chutiya", "vartitsivastava": "Wah bsdk wah", "piya90744300": "❤️❤️❤️❤️", "your_sis_takes_my_seeds": "#savedelhihindus", "opporeal1981": "Is kamini ko unfollow Karo sab", "fan._.of._.mahakal": "Fatte condom ki paidaish", "kadwa_truth": "Thiss is haram in islam if muslims follow this they're shirk😂😂😂😂wow @reallyswara you really destroyed muslims too", "akashdeepsingh96": "💕", "suyash074": "Boycott karo is lady ka ye desh VIRODHI hai", "rajind19": "Flop", "anushka_kashyap5": "Phli fursat me block ho zaa pagalia 😅😁", "ad_atharva_choudhary": "15 saal charam shukh ke..", "poojacjoshi": "Koi nahi dekhega teri film.. nikalo isae India k bahar.. Faltu aurat", "i___rohan": "go n dislike the tralior of this n report also", "shekadeprabhakar": "Apni maa ko do us jihadiyoke neeche tab pata chalenga..... Islamic terrorism kya hota hai chutiyi saali", "pinkuyadav29": "areeee aunty....alleeee lulluuu ..piluuuu....buddhi ho buddhi ki tarah raho,jada uchalne ki kosis na karo....apna randa rona ghar me rakho aunty .tum jaise log india ke mohallo me naliya saaf krti hai😜😜😜😜😜😜", "itsamityadav": "dear mam ap is dharti pa bojh ho , plz mam ap sucide kr lo or apni body ka kuch important un logo ko da do zinha jarurat h, ap apni maa or pitaji ka glati ho, acting ka 1 % v nhi aata apko, sirf movies nude hona aata h apko, apko ohe dekhta h jinha masturbation krna hota h bas, is sa jada kuch nhi ho ap, thanku mam ❤️❤️❤️", "yogisharma780": "Best failure of the year", "beer_republiclounge": "Picture will be a big flop just like you are in real life... #fake", "shikhachaturvedi_": "Just for promoting your muslim background movie, you are playing this kind of dirty game with our country. Shame on you 😡", "naman_raghav_singh": "एक भी पिक्चर हिट नहीं होती इसकी..,इसके मैथ की तरह इसकी फिल्में भी होती हैं.. बेकार😂😂", "kush._.anand": "BRILLIANT!! I can't wait for it. So soulful and raw and also shows that there are others that identify as non-binary etc. I love Shabana Azmi and can't wait!!!😍💖.", "mayank_m_chheda": "Gaddaar aurat", "keya9130": "Tu ak kala dhabba hai", "ppparaggg": "Daffao ho", "salecha_tushar": "👎🏻", "supersuvnan": "😂😂🤡", "saffron_my_blood": "Maa ki land bhosidiwale swara Bhaskar hat 😠", "chuslim687": "Your movie are not even capable of getting flop also....😂😂", "sarv19": "Unfollow her", "ishtiyak.g": "Not good Swara NOT AT ALL", "samuraijackk_01": "Perfect terrorist", "mr___samrat__": "Third grade actress", "tanoj__": "R u happy Delhi main aag laga ke chain Mila. Kab Tak chhupo gi jhadi ki aad main kabhi to niklogi vending bazzar main...", "adi_bansal03": "We all should report this account", "meghabarjatiya": "Really Swara @reallyswara outstanding❤️❤️😁", "anurag1997sharma01": "Randi swara ab police wala mar gya to gaand ni khujayi kya tumhari behen ki lawdi randi madarjaat vaishya sali", "mayank.tandi.35": "Female papu Swara 2010 m kitne saal ki thi 🤣😂 😂🤣", "siddanthpatil": "Imran Khan ki rakhel", "isharaa_jay": "Delhi ki Aag seculer terrorist ki wajah se , communist aur Congress ke pillo ne lagai", "yash___jangid": "🤣🤣🤣🤣🤣", "aakash.bhatt_": "@anjalichakra @sufi.sun", "jdotm_": "Sugoi❤️", "lili__5084": "Meri sab hindu bhai aur behno se request hai esko follow na kare q k ye desh ki dushman hai aise logo ka na koi jameer hota hai na koi dharam hota hai enka sirf ek hi dharam hai paisa aur kaise bhi kar k limelight mai aana chahe desh se gadaari kar k ya desh k gaddaro ko support kar k q na aaye", "equestrian.3": "Aab iski bolti bandh he delhi riots me.. bloody hypocrites.. sheer qorma ke liye nautanki ho rahi thi", "aanchaljindal24": "Bulati hai magar Jane ka nahi", "nyk_rago": "Report this account😡If u need peace in country. ಕನ್ನಡಿಗರೇ ಇದ್ದೀರಾ?", "neetidutt": "Piece of shit seen after ages. I wonder how come an esteemed actor like divya worked with such a dushe bag like you. You make everything stink.🤣🤣", "chirag_patel345": "Bhosdiki randi swara", "nidtwinkle": "Hahaha...", "sukhda.88": "Swara didi aapko pata to hota kuch nhi....kyu bolate ho aap apni bezati nhi karao...aap acting thik se kr lo yahi kafi hai", "nehasdharti": "❤️❤️❤️❤️❤️", "brandedgawar": "hijdi @reallyswara batana ab", "praj.pawar": "Don't watch this horse shit", "saffron__anku840": "Yeh Madharchod Hai Swara Pakistan ki dalli", "nitin66410": "@swara you are a dumb butch... A rebilion, a anti-national. You are nothing but shit", "imshivanitanwar": "Ye to tatti hai...😂😂👏👏", "nischitha_naren": "Boycott this movie", "elesneha": "Guys Sb milke iske account ko report kro iska account band krwana hai har haal mai wrna yeh pure desh m aag lgwa degi", "zakir_shakir_": "Bdw best of luck for the movie now i'll be judged by name not nationality😂 anyways👍", "advjain": "Release kab hogi", "p.patel.19": "The 2nd and 3rd most scariest shit for muslims, 2nd being their daughters dating😂 and the 3rd being - dating a girl while obviously 1st still being modi😂😂 #shaheenBaghJalega😂", "doneld": "❤️💘", "hbkkrrish": "Friend: Swara, am pregnant@ReallySwara: Congrats. Bt yaar am very worried. tera bachcha itna kamzor, itna unhealthy, itna abnormal h ki baaki mahilaye ma banne se darengi.  F: pregnancy to aaj hi pata lgi, bachcha kaha h?  Swara: doctor se puchh na, mujse kaahe puchh rhi h...", "lilmisssilly21": "Flop se disaster ka safar 😂😂🔥🔥👏👏", "sweetjaat": "Randi", "28_ryan_ras": "Report dis account", "sandy_the_logical": "Super flop guaranteed 🤮you🐷", "adnan_i_shaikh": "❤️", "mayankhero_": "Kaun si duniya me ho. India ke Kisi hospital me paida huwe ho ya jungle me paida huwe ho Birth certificate nai hai. English dekh ke lagta nahi hai ki kisi school nahi gaye ho. Padhe likhe lagte ho,padhai kaha se kiyo ho.", "shete4177": "Let me give you some words for you and your gang, Shameless, Namak Haram, Paiso ke Liye baap ko bhi bech de, Liars, Master in faking and misleading. Unpadh Ganwar, throwing their own country into the fire for a few bucks and political difference. These all apply to you.", "kanikakaurvaid": "U Keep going on.", "nik4.4": "Flop show dusre actors ki mehnat bhi kharab karwa di isne", "mrinal.agarwall": "Excellent trailer! The movie that we needed at the hour. This is what you call a real LGBTQIA+ movie. Dont @ me", "arjunfanpage23": "See my comment her real name is shabana tarnum khan", "rhitama_hephzibah.b": "❤️❤️❤️❤️", "the_horryfying_evil": "Iss female terrorist ko agar sabak sikhana hai toh iski saari movies #boycott krr do... pehle hi kaam nhi mil rha... gaand fatt jayegi", "sachinjoshi77": "Boycott 😡😡😡😡🖕", "alokvmenon\nVerified": "Verified", "dhruvayan": "Redpig @reallyswara", "pankajawpl": "😂", "pi_day_pisces": "The people who instigated hate in the country are busy doing film promotions now. Delhi is burning but they're bothered of only Qorma and kurma😂😂 @reallyswara #fakeactress #fakehuman #swaramemes #shameonswarabhaskar", "ijagseerchahal": "❤️🙌", "m.a.n.i.s.h__j.o.s.h.i": "Tu bas CAA, NRC karte rahe ussi se tera makeup ka karcha niklega acting vagera kaha kar rahi hai voh tere bas ki nhi ha", "sammiee86": "💕 Movies like this is needed in Bollywood and not nonsense concept of nepo kids running around same old method... thank u swara and divya.. the movie looks good.. can’t wait to watch .. good luck to the team... 👏🏼", "ha_mai_hu_khalnayak": "Never going to watch your any movie in my entire life.", "frankenstein_syed": "What the Fuck is wrong with you @reallyswara @sheerqorma.thefilm Do you want to characterize Muslims and promote LGBT community.... just to make few sum of money.... I thought I respect you ..... But I guess you and your team of this film doesn't deserve this.... As you must know this is Haraam in Islam.... It's really disgusting.... Learn before you do something.... #istandagainstthisfuckingideologyofyouandyourteam 🤬🤬🤬🤬😠😠😠😡😡😡", "the_religion_universe": "SWARA POTTY MAT KARO YAHA 😂", "helloitsbeenie": "You know you're doing something right when you piss off so many uneducated, sexist, nationalist assholes. Much love and power to you, @reallyswara ♡", "mistiqex": "Wow. Your excellent work and courage are a much deserving resounding slap on the abusers who troll you to give meaning to their empty lives. Women power 🙌", "rashi_gupta2204": "Mar jaa tu bc😠", "keviinndai": "You proved it that you are an anti national you would have never signed a film/web series if it was named parlak panner..my God you are so anti national even Ravish sharma would be ashamed of.", "i_hemant_l": "Rubika bula ri thi tumko😂", "srishti_shashwat": "NRC ka Draft kaha h ma'am", "__.abhishekkk.__": "Boycott whatever it is.", "akshay.saretha": "Bc tu bhut interview deti hai ab kha gyei jab Delhi p Hindu mara hai bc bhaiyo es ki I'd p report KR k band kro", "dhanraj_dodia_702": "Nikal nikal Randi JIHADI boycott", "arrow_029": "Get well soon....", "loveurself001": "#banswara", "paras_birla": "Plz dont watch her movie", "banashreenath": "Gadhi kahi ki", "lucky_badgujar": "Chaahe kuch bhi Ho.... Controversial statement do ya kuch bhi Kare.... Btt still muje @reallyswara Bohot Pasand he yaarrr🤗🤗🤗🤗🤗🤗🤗🤗🤗🤗.", "94iamsood": "Teri toh laga di \" https://youtu.be/_ZxY1-82LNE \"", "showmetheravi\nVerified": "Verified", "ankit_.sharma___": "Tujhe kitne paise milte hai isis Ya Islamic organization se bsdk ki", "worldofvikram": "Swara, I so wish you would do something about the horrendous comments being put up on practically all your posts! These \"nationalist men\" are so weak, they choose to use such vile language, that too against a woman. Beyond shameful! 🤦", "mac_lio": "Incredible❤️", "aa.rav973": "Another flop", "jjws21095": "Wohoooo loved it", "basitnahi": "Fab❤️", "heart_of_gold_17_": "@reallyswara i watched it in class. And i started crying. I don't have words to express my love for you😭💖", "_shavezkhan": "We will watch your movie ma'am 😊 @reallyswara", "full.ofbs": "soft enby sapphic love my heart went uwu", "jas_man_sim": "What have you done ... very dangerous topic", "_rabbani__313": "❤️❤️❤️", "ashok.ksdn": "What about ur interview with Rubiya", "neehashaikh": "Speechless after watching d trailer another father added to ur hat for yet another outstanding role", "noomankhan786": "Best 😍🙌", "lets_wetalk": "It will be flop don't worry", "gaba2445": "@reallyswara bahut hee ghatia trailor hein. C film", "bhagat2745": "Sli kehti thi Pakistan ka Lahore England or Europe se b sundr hai bosdiwali agr Etna hee sundr hai ja ma chudva ja kr Pakistan", "arun_yamjala": "😂😂 bitch @reallyswara", "gautamp8123": "Mohobbat gunah nhi hai ..👍🔥🙌", "mr_rohitjaiswal": "Aap hoti toh hum boycott karte", "nish_hero": "😂", "ilgnaouibrahim": "So beauty 😍😍❤️", "sambhaji_agalawe": "Tu aise hi nam ke film Nikal. Koi nahi dekhega", "mirza_nabidul_hassan": "👍👍👍👍", "minimathur\nVerified": "Verified", "mumbaikaradd": "BIG NO TO YOUR MOVIE.... 😡😡😡", "official_hardeepkumar": "🐷🐷🐷🐷🐷🐷🐷🐷", "shailesh.jadhav.9461": "Boycott.", "toyasiin": "❤️👏", "ronnyroy_realpage": "Teri movie me sirf tu fingering krti hi achi lagti h... Ese Kam Karne me hi tu expert h...", "eeerizal3": "😑", "saurabh0716_": "Same on you...", "axwell_av": "mc", "shivampathak26darat": "Mam can you please hear that clip once again of your debate with Rubika liyakat.you are proclaiming yourself as a hero😁😁.what kind of shit is in your mind you were simply being rebuked and you are claiming that you have tough discussion.sorry mam do what actually suits you and that's acting .don't try anything of which you have no information or knowledge.", "priyankamadhwak1": "We will boycott your fucking movies", "madss444": "When will the movie be releasing?💓", "drshalabh": "सूवरा🐖", "sapphic.in": "I CANT WAIT OMG", "luckymani2412": "Congrats swara.... And let the haters andh bhakt barking on your achievements ...😂😂", "towfiq861": "Wow another lgbt film..really excited.. & wish u very best of luck😍@reallyswara @divyadutta25", "rohila__amit": "Khubsurat", "raman0165": "Teri maa chod dunga bhen ki lodi", "tawarpalak": "#boycottswarabhaskar", "bharatsingh5540": "BOYCOTT @reallyswara", "sgaur1031": "bekar 👎👎👎👎👎", "boy_with_ink": "Logo ko bhadkana bnd kr", "ahmednaseermohammed": "👍", "iamnarois": "Swara maam istg India is just sf proud to have you as it’s citizen", "brar1brar2": "👌👌👌👌👍👍👍👍", "bhavana_m_bharadwaj": "Go get some life learn things and then speak thought you were good one turned out to be 2 sided hypo", "a.akshay002": "I think, this is the situation you want to see in India 👏", "sshailja02": "Loving the hate comments. Keep going. You are just adding the number of comments and she's adding the number of critic awards which is way more important than the love you are giving her.❤️", "vsmabu65": "Best of luck . Sure watch even if I don’t understand Hindi, because of you 😊👍", "krutivrm14": "Super dumb and fake lady....kuch nhi aataa ..", "instapavan_": "Chawanni bhi ni kama payegi ....Market to kharab pahle se hi kr ke rakha h 😁", "invincible_manoj": "Inki dukaan barabar chal rhai hai.... politics and Bollywood....", "ms_slaying_bae": "Aj se teri saari movie ban...or aage 10logo s b krwaani h😊 JNU walo s bolna dkhne ko...", "selfymadam": "❤️", "jagruti2705": "❤️❤️❤️❤️", "hiteshkatariya888": "Kaun film deta hain isko bhai??🤔", "anuradhaskurmi": "🌹🌹", "chikudev33": "Apni gaand mai ghusa lay biryani 😂😂", "faheem.273": "Congratulations ma'am all the best", "piu_trish_17": "Absolutely spellbounding", "vishnu_official_account_": "Pagal hai yeh ladies", "its_chronology_": "@reallyswara tu bhi ek terrorist ha", "__kimayaa": "♥️", "komalsoniverma": "Eagerly waiting to see✌✌", "ultimate_vamp.ire": "Amazing job mam @reallyswara, this movie gonna rock it🔥 and dont worry for your haters only successful and growing people have biggest haters and enemies. Keep growing🔥♥️", "zarashaikh1744": "Best Of Luck Di 🔥🔥", "natasharastogi": "Beautiful 💝", "abhisharma293": "Ganta", "priyan_me": "❤️", "risewd_astroqoutes": "Is k jese kuch chu jayenge isko support karne ke nko kam ki shakt jarurat h ab kya hua swara didi muh me momo le k bethi hu wohi delhi me hi ho raha h sabkuch bahar aao kuch toh bolo haye ab nahi bola jayega didi se kuch kyu k pese nahi mile h inko ....draft chahiye is anpadh ko.", "krishna15sharma": "Bloody madarchod", "i_s_a_m_e_e_r": "Ullu", "kpawan_k": "🤣🤣", "raj_shivaay7": "2010 mai tu 15 years ki the..but 1988 mai tu paida hui..kis hisab c tu 2010 mai 15 ki the tu..insan hai ja alien 😆😆😆", "parboni": "This was an absolute delight to watch, three really strong women on screen, it doesn’t go better than this.❤️ All the best for this one.", "_anomalissa": "Loved it 😊😍", "tayfur_sherasiya": "So good trailer 🔥🔥will surely watch didi", "rangesh_s": "Ugly", "its_me_aditya_boy": "STFU mulla supporting slut!", "ashlesharastogi": "Incredible ♥️", "zayngigi_fc": "Even \"chutiya\" word is a compliment for you", "travelermukesh": "Amazing emotional communication", "mr._.srq": "Love is not a sin. Such a powerful dialogue.🔥🔥🔥", "anshul_b.sisodiya": "Yes i am saying no for all your movie", "pradeep__salve": "❤️ lots of love", "sukeertiii": "Loved itttt.❤️❤️❤️", "prateekratna": "Stick you what you're good at. Cinema and acting. You're a good actor. You're too slow for politics", "being_sane": "Isko sab aise hi role kyu milte hai 😂", "__music_anjay": "Cheap lady,,,, ilaz ki jarurat hai isko,,,, 2010 mai 15 sal ki thi 2019 mai 31 ki ho gyi,,, interview or debate mai kya bolna h thoda pad kar aaya karo,,,, uneducated aurat!", "adv.zeeshan.5": "NYC Trailer❤️❤️", "shaikumair": "Hindus are against hindu actresses just because she supported a right path...! Note down one how much you hate her,that much she raise,haters make a normal person to VIP..", "bhardwajgourav": "@reallyswara Delhi is on Fire and you are busy in promoting. Wah. Ye ha Asliyatt or Aukaad tumhari. Abhi pure Desh me Aag laga diya or baithi ha Araam se. Tumhe to sabse pehle Jail me daalna chahiye. Hindu Muslims ko tumne ladaya hai , tune Ghatiya Auratt. NIHAYATTI BESHARAM AURATT . Avi to Delhi nai jayegi. Jab sab Shant ho jayenge tab tu or tere Kutte log jayenge logon ko behkayenge or Maachis maar kar wapas aa jayenge. Ye hai tumhara asli chehra @reallyswara", "sspkudla": "It's going to utter flop 👎👎👎", "vishalsam10": "Where is Swara when protestors killed a policeman with stone? Where is Swara when a man pointed gun towards the policeman? The real thing is that she don't stand for the right she just stand against Modi, even if Modi will breath she will oppose it. Hypocracy exposed.", "rafiqsk31": "👏 Mohabbat Gunah Nahi hai !", "nith_alumnis": "Tatti actress", "jagishaarora": "What a trailer! An amazing tale of love 💓 love is not a sin. Let's celebrate love in the time of hate.", "amarindergill": "Looking forward to the film! Looks beautiful", "spandannshukla": "Big love💖💖💖💖", "here_i_m_abi_": "@reallyswara trailer k wakt age kya tha ? 😂", "imrangram77": "Way to go @reallyswara 👏👏", "geralt_of_delhi_95": "Biggest whore ever borned in this world, first they spread hate for 2 months and then post stories and blaming police.", "monavaronicacampbell_official\nVerified": "Verified", "ad_ass_babua": "\"Swara Trying to Console people sitting on RIGHT\" 💯😂", "manahil5781": "❤️❤️❤️❤️😚😚❤️ i am proud of u ap k dek kr lagta he k kisi ka dil toh zinda heeee❤️❤️❤️❤️", "kapills": "Anti Banti shanti jisne swara ki picture dekhi......", "laddan_romio": "❤️❤️❤️", "amaan_siddiqui_": "Didi ab apko nhi dikh raha kya ho raha ha delhi ma kuch toh bolio", "hamza__rajput_hz": "Good luck", "whats_app_university": "Who is attacking? People who are supporting CAA why the hell they need to come on the roads, why are they worried when it's already a law?? Are they afraid that the law can be revoked? Or they were just looking for another chance to reduce population....", "truedelitte": "Koi ni dekhega overacting ki dukan swara", "_____sid7": "❣️❣️", "_pravin_gadhavi": "Best Of Luck For Failure", "dudewheresmywine": "❤️❤️❤️❤️❤️", "sayanigupta\nVerified": "Verified", "mastikhor124": "Tatti... hai", "sahil8677khan": "❤️❤️❤️", "rajeshkumarshrivastva.750": "💓💓💓", "rajiv.srivas": "❤️❤️😍🙌👌👍", "bharadwajtan": "I cried watching the trailer. Thank you for this. 🌈", "seavansh": "कब खाना है???😂😂 @reallyswara"}