{"garvitraina": "Ye wahi hai na to ghar aate hi toilet doondh rhi thi? Harpic wali. Lol", "0rajeshsingh": "Randi 😂😂", "sushrut2020": "👍", "prmthk": "😍😍😍😍😍😍😍😍😍😍😍", "thenameisrishav": "Pakistan kyu nahi chali jati", "vishnu_1504": "Kitna leti ho 1 person ka", "terababu92": "Chutya lag rahi hai", "yugarj313": "🐷", "prasadsawantpati03": "#Sweet😍 #Angel😍 #Queen👑 #Princess😍 #StrongGirl💪💪 #RespectWomen👏🙏 #GreatWomen😍👌 #WomenPower👑💪 #Fashanishta😍 #Fabulous😍 #Gorgous😍 #Beautiful😍 #barbiedoll😍 #Love🌹❤🌹 #Smile😍 #QueenOfBeauty💞👑💞 #QueenOfWorld🌹👑🌹 #MySuperstar👏👏 #MyFavourateActress👏👌👑 #MybigCrush💞🌹💞 #MybestFreind😍 @reallyswara", "black_horse7": "Beautiful dress with monalisa smile", "rajivjain271": "Daali", "hidenleaf6": "💖", "extension32020": "Such a spoiler!", "yourdailyfantacy": "Dhibri Jesi iski shakal h Kyu be Kamini Tu Marti Kyu ni", "jaya_pk": "Perfect 👌. ♥️♥️♥️♥️♥️♥️", "ritikprajapati002": "Madam veere di wedding me ma chuda Rahi thi", "sheenukhare": "Kashmiri pandits k liye b bol dijiye", "sanjeevdev93": "Nice", "shubhamkr0610": "Sex worker is here 😋", "rishi.s": "Chal bc ! Traitor @reallyswara", "an.shu1596": "Chiii kitni gndi hai ye aurat 🤣🤣🤣", "gods_own_grl": "Kothe pe ja rhi kya ????", "ady_rai": "If tatti had a face...", "romy_with_u": "Dream beauty ❤️", "shivam_sharma_03": "Kam dhanda to hai nhi berojgar", "sovan4949": "Awsm pic aunty ji", "pavanwonkmonk": "Right before getting insulted", "haroon_rashid_bhat_": "My favorite girl", "neel.trivedi19": "ये फोटो के बाद ही रुबिका ने आपकी ली होगी 😝 बाद में तो आप चल भी नही पॉई दीदी😂", "vardandhara15": "2 din ki sadi hui Paaad lag rahi hai", "ashh_win_b": "बोहोत गरम(hot) लग रहे हो आप😜🤘👌👍", "painmostly": "Men are afraid of bold and intelligent women. I dont mean bold as show ur ass, but bold as speak out to the society. Will love u always.", "abhisuj18": "ye pic rubika k interview se pahale ki hai yaa baad ki....bec after that you were like.....oh no...CAA padna chahiye tha", "aadarshrajtiwari": "Mastu@bation wala scene 😍", "unicorned_007": "You mean the why we are indifferent to the plight of the kashmiri pandits who were butchered and long forgotten? 👏🏽", "theboldgrace": "Shut the fuck up bitch", "vishal.the.classy.gentleman": "😂🤮🤣", "_arpit__gupta_": "Ye pic debate m jane se phle ki h kya", "not_skanda_annadana": "The day you got rekt!😂😂", "abhisubhedar": "beauty with no brains", "acharya_zee": "Ye bhsdiwali 2010 mein 15 saal ki thi ab 25 ki ho gayi😂😂", "pragya_bachhawat": "Sath hi movies ki terah khudko news se update rakho .... Bina sir paier ki baatein. #uneducated ppl", "manishrana1561": "@reallyswara i hope someday you would raise your voice against massacre of Kashmiri pandits. We are no longer indifferent to Kashmiri people as 370 no longer exists. Please stop inciting people by your verbal diarrhoea.", "rajat.katara": "Hmmm . Inhi kpdo me bezzti hui thi na", "pamo18_": "🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "itsanirudhjoshi": "@reallyswara itni gandi bezzati krwane ktna ready hoke gayi thi 😂😂😂😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣👌👌👌👌", "theabhinav03": "Phli fursat me nikl @reallyswara rahul gandhi ki behen😅", "kaat_k_jayegi": "Maine relevant sections padha hai😂😂😂she just got bullied there. 😂😂", "lakshya_bhardwaj78": "@reallyswara aunty aapko CAA aur NRC ke baare main to kuch pata nahi hai. Ek kaam kariye is saari ke baare main knowledge baatne ke bajay, apni knowledge apne desh ke baare main badhiye. Aur phir apne stories main desh virodhi baatein daliyega. Tab aap sahi hongi aur baaki galat", "silu1434": "Tu chutiya hee 😘", "milly25": "@reallyswara what did you say indifferent to Kashmiri people . Why are you indifferent to Kashmiri Pandits???? They are in lockdown really do you even know what lockdown means ? He is free to roam all over the country to make money which is great but what about Kashmiri Pandits that can’t even go to their own homes . Will you even know how Kashmiri Pandits lost everything in one night !!! That’s a lockdown of 30 years. You are a shameless biased woman who doesn’t present the facts. Instead all you want to do is lick the asses. Anyhow can’t expect anything from you. Useless actress.", "richa_billore17": "ऐसे देश विद्रोही लोगों को क्यों फॉलो करते हो", "deepanshumaywad": "Desh drohi", "rightneardabeach_": "Ashame of you", "bibek_bishal": "Lekin pata Kaise chalega ki Yousuf Bhai ne ye Kashmir se laaye Hain ya Sarojini market se. Tag(kagaz) dikhao.", "bhautiksuthar": "Not again, you missed the chance swara. You proved again that you are just dumb and want to be famous. Why ? Kyu logo ko apne adhure knowledge j se bhadka Rai ho? Jst to satisfy your ego? Common swara be mature and get rid of it(ego). Good for YOUR future.", "iprashantgaur": "CANNOT forget this Saree.. @imrubikaliyaquat You do remember this saree? Swara was making a fool of herself on that day. #ReallyStupidSwara 😂", "the_sonu_sharma17": "Mene suna hai tum kashmir me patthar martti thi.....or ab dilli me maar rhi hai", "nikhilsingh291": "Sarkar se puchhiye😂", "ayushmanrastogi10": "Chutiyaa", "snehal.sinha11": "Muslim appeasement krte krte mar jaegi", "reyanshpant": "Rubika se ch@dne se pele ki tasveere🤣🤣😂", "vinayrana1990": "Rubika liyakat yaad hai", "bhatiagurvindersingh": "Like u ❤️", "jainam.mehta07": "Beauty without brain", "ankita_jha_oct": "But please make sure you have enough evidence about the points you going to present there.", "avinash_verma721": "Rubika Ne Lele Fuddu khi ki", "getiksi18": "Really s-whora", "m.arman.ho": "👌", "shivaholic_sunil": "Bloody slut 😂😂😂😂", "_akkitanwar": "Esko follow krne vale sb c hei....", "kanavdevsingh": "secular Indians se nafrat ka doosra naam Swara aunty", "mohit_gahlaut": "Proud Pakistani.", "hariom3203": "Suwara", "president_vikram_bishnoi": "Inqulab jindabad salam shaida nu", "name_is_gaurav_": "lowdi swara 😂 @reallyswara", "priraj2u": "Gd but not enough😘", "record.killers10": "Prem ratan dhan payo me jo role mila tha n tujhe sach me tu wahi hai... yaad hai kaun sa role ?? 🤣", "raj_ujjwal_singh": "Isse kya hoga fayda mam dengi to aap hate speech hi", "akhilesh1125": "Why were \"YOU\" so indifferent to the Kashmiri Pandits who faced the exodus?? Ohh, talking about them wont get the publicity.", "prachir4245": "Itihas ki sabse vahiyad aurat😂", "__.farwa.__": "I just cannot appreciate your commitment to the movement! Even when doing these endorsement posts, which is obviously a part of your life, you do not forget your responsibility being a face of the movement. 💖💖💖", "justanotherbint": "💕💕💕💕💕💕💕❤️❤️❤️❤️ Lots of love and power to you. 💕💕💕💕💕💕💕💕💕💕💕", "atulmishra2": "Rubik's took it?😂😂😂", "corona_.go": "Kashmir to hai hi jannat!❤️ lekin tum chootiya lag rhi ho! Khaas kr k last waali pic me, usko dekh kr chudail mrr jaaegi!😂", "akhilyeluri00": "😒But no one talks about the kashmiri pandits, 30years still no one visited them heard there stories. But everyone wants freedom in think country at the cost of other life's. Be a solider for 3months survive there return with no injuries, you don't know the cost of loosing someone because of the violence to terrorism. Making movies gives more respect than the battlefield survivor 😒", "maddlina": "Anyway I could buy sarees from him?", "jaiswaldkj": "Shame on u . U should try Pakistani burkha😂😂", "uday_emo_03": "@reallyswara rubika liyaqat ne Teri maa chod daali Sach me", "akash.shinoda": "Yeah you can enjoy it as your fucked up secularism has caused damage to souls and properties in delhi. The wretched souls like you need to flushed away from the human world.", "ankyankur3": "Or chdail kya haal h tere", "rahul.nani.9887": "aunty", "luckywaghmare143": "Chinaal...randi🤣🤣🤣", "rohit_bindass": "Pagal aurat😁😁", "ck.ray": "हा rand... की bsdki. सच मैं te धंधा करती है. तेरा बाप हिन्दू हो नहीं सकता behncho...", "who_rohitsharma": "Randi", "y_vikasyadav_": "Tu to randi h saali kisi din dikh mat jaio bahar", "aniket_sen11": "तेरी उम्र क्या है", "official_hardeepkumar": "🐕🐶🐶🐶🐶🐶🐶🐶", "j.shah123": "Dangai hai ye SWARA.", "imshinpaul": "Randi sali", "siddharth._hai": "Kya fayda ise pehen ne ke baad bhi beijjati hi krwani hai ise Rubika ne keh ke leli", "krishank198": "Rubika ne nanga to kar hi diya thujhe saree ka kya fayeda 😂😂😂", "wanderworld98": "Exactly. We don’t want to treat Kashmiris differently so scrapped A370. Unlike a few, the majority know how,when and where to use the finger.", "ashrut.singh.98": "सज धज के जा के करवा ली बेज्जती , क्या फ़ायदा हुआ सजने धजने का मैम 😂", "hershey_g_": "🤡🤢🤢", "poojacjoshi": "Desh Drohi", "shandey_shantzzz_shan": "😂😂😂😂😂", "maarwadi_deepak": "Deshdrohi", "adv_mayank1994": "We support caa nrc npr ucc", "devil.pork": "😘", "arnab_dev": "Beauty queen ❤️❤️", "kumarmanishn": "फ़िल्में तो मिल नहीं रही तो सोचा देश बेचकर लोकप्रियता प्राप्त कर लें, सौदेबाज़ी तो कोई आप सें सीखे 👏👏👏👏", "aditya_adi_0908": "Randi hai ye saali @reallyswara", "ori0ns": "How can we forget this saree. Rubika took your class while you wore this 🤣", "ilavt": "Did you paste your brows @reallyswara 💯💯💯💯", "rameezjemlani1": "Please wear these saree when you go to abp news .", "_harshada_pawar_": "Right, we should also worry about the Kashmiri Pandits👍", "vijay.3864": "Ise dekh aapki bejjati yaad aayi 😂", "jst8802": "Swara ji rubika liyaquat se Tum apne maa chodhwa lo 🌶️", "bhaisahab1831": "हस्थमुथैन स्वरा 😂", "p.h.e.n.o.m.i.n.a.l": "Kamini 🐖", "rushabhkulkarni99": "U are a piece of shit .. #democracy #freedomofspeech ... Kashmiris might be thinking ... Why the hell did you wear our Saree", "__live_fast_die_young_": "Before destruction 😂😂😂", "johal_rk": "Ungli dal li kya ander", "padhy.sidhant": "dekho desh me dange karwa ke kaise shanti se photo nikal rahi hai", "rohit_sharma_9jan": "Kya fayda..karwaani to khud ko bejaati hi hai 😀", "_.gupta.ji._": "Hn pr tune iski saari khoobsurti khtm krdi kutiya saali", "instamaahii": "We are never in different with any Indian brother and sister. Stop spreading hate crime and know the facts first. U being A tamilian shud yourself not say such things.", "ms_vhoraq23": "You are awesome and your think say that humanity is everything not any religion and cast nice answering to Rubina", "kailashmohata": "Without knowledge...Kuch bhi bol do..nonsense", "jaat.boy.manojbhakar": "बेन लोड़ी", "pra.1940": "Stunning❤️❤️", "chirag7sharma": "Rubika rocks 😂", "akki8rules": "Chutiya insaan🤣", "i_m_aagu": "NRC Draft Kidhar hai Aunty? 😂", "suyash074": "Bekkar Aurat", "i_am_navratan_singh_": "Please report this account", "iamsidkhandelwal": "Bhadkau aurat 😏", "lads.lon": "Gandi shakal 🤣🤣", "aniket_pal04": "😷🤮💩", "amitbhanot.jsr": "Isi din na bzayi thi rubika ma'am ne tumhari 🤣🤣", "blissful._.world": "Educated moron 💓", "guptapraveen915": "Itni bezzati kyu karati hai aap, thoda preparation kar leti, acche se liya RL ne aapki 😂😂😂", "raginijain01": "Bewkhoof", "gifts_available": "तुमको तो चप्पल से पेलने का मन कर रहा है। आता ना जाता, और ज्ञान पलेंगी दुनिया जहान का।", "naman_raghav_singh": "सब कश्मीर का है., पर खोपड़ी तुम्हारी लाहौर वाली है.. गणित फेल👍", "bitchbigheart": "Boht bura hua apke sath us din😢🤣🤣", "anjalajamal": "@reallyswara link Yousuf bhai with me, my mum & family will be interested to buy his stuff if he visits Delhi also. Ps: The Saree is very pretty & of course you looking beautiful too", "mohitkumarmanjhi": "Maderchod Randi ....sale dikhne Nahi chayeye...sale logo ko galat bate batate ho..", "priyamtrivedi_": "Uss bitchari ko yeh bhanak tak Nahi thi ki ye Chand Palo mein meme material banne Vali thi", "shivampandey2493": "Chudai ki dukan", "surender.singh.54922169": "इतनी बेइज्जती आज तक न्यूज anchor ने सिर्फ आप की की है... मजा आ गया.... कृपया पूरी वीडियो डालो", "tanyamehra_00": "I think aap apni saari hi show off krne gyi thi kyunki information to apko dhang se pta nhi thi...aur vaise bhi movies to milti nhi h...to yahi TV pe aake khud ko dikha di thoda sa...free mein thoda sa attention hi mil jaayega @reallyswara", "anishmankare": "Mam...draft pde kya😆", "maheerbaba": "This is a piece of art💕", "dhavalshah3591": "Faltu", "vishukambojj": "Sambit patra of left", "ggupta25": "Fuck off you unindian 🖕", "anish_lambardar": "Hi aunty 🐖 @reallyswara", "gaurav_sharma_9088": "2010 may aap 15 ki thee🤣🤣🤣🤣🤣??", "govind0911": "आक थू h tujpe gaddar oorat... desh todegi tu...", "vikas_dwivedi1": "Deshdrohi", "mkj200209": "Desh drohi", "shreya_anuj_srivastava": "Tumse giri hui kamini nahi dekha aaj Tak kisi ne ,,,,,, tum to zinda rehne ke bhi layak nahi ho", "sajal.tyagi": "Bade hee manhus lag rahe ho😂", "akaashbanerjee": "You are just not a flop actress,infact you are a flop Humanbeing on the name of INSHANIYAT.You don't know how to represent your topic.", "snigdharudola": "God, this woman is so stupid", "nihirapandey": "Mam, mam.. aap meri baat nahi sun rahi...jabki illogical baatein bole toh yahi jaa rahi thi", "anant_5998": "Andhi liberal 😂😂😂. Suniye mam dekhiye mam .. 😂😂😂", "vidhaan.kapadia2004": "Fuck off dumb lady", "sush_rajput": "😂", "vishhal.vermabliss": "Kaam wali Looks 😂", "abhijitsingh009": "Iski koi supari lelo niptado Sali ko", "abhinarula22": "Is blue tickmark ke liye aapne kaunse documents show kiye the....?? 🤔🤔Wahi nrc me show karna hai... 😂😂🤣😂😂", "ninja_r.chandan": "Tatti jaise lagrahi hai............", "alibaba.tie": "Wowwww❤️", "mdazad4830": "Fabulous", "sar.apeksha": "Sari bahut pyari but photo shoot me alwa thoda pad kar chali jati to rubika se itni bejjati na hoti😂", "er_adarsh_sharma_bhatt": "Ja B grade pictures kr... Or koi picture toh malte nhi tujhe..", "eroslovedeal": "Hello guys! Check out our page and make your evening hot🔥💞", "s_villageboy": "You bitch you are good for nothing", "anuj_a_s": "Azadi chaiye", "kedarkadu6087": "Madam ji abp news channel Maine Rubika Liaquat madam ji bula rahi hai 😝", "manjusaili": "Pagal orat kambakht 👹👹", "ravichandrakal": "Madam publicity chahiye to aur bahut sare options hai y u r creating fuss all over", "sakshi_ranjan_06": "Mc", "n_i_r_a_a__a__092": "Sun boriya bistar pack kar or pak bhag ja...behnchod 😡😡😡", "shailusingh.1": "Jay Hind Jay Bharat Hindustan", "sangeetaganju": "@reallyswara where are these emotions when it comes to Kashmiri Hindus. Why so indifferent to Kashmiri Hindus. Is it because we never played the victim card or is it because taking a stand for Kashmiri Hindus will never get you the required publicity. How duplicitous.", "bharatsingh5540": "Burkha jada acha lagta 🙏", "apoorva_dadheech": "Ye pehen kr hi debat me khud ki popat karane gai thi 😂😂 rubika ma'am SE...😂 #deshdrohiswarabhaskar", "vipin_singhh": "Muh kholo aur hag do kyu😂😂", "art471220": "U nailed rubika in the same saree", "2807naz": "swara you are really nice parsan", "himanshu_g_u_p_t_a": "Dont wear this saree again😂😂", "noha_fazili": "❤️❤️❤️", "avni.sh751": "तुम एक घटिया अदाकारा और बेहद घटिया औरत हो", "abhikarsh_verma0001": "chutiya aurat🙂", "rupam_1.0": "@reallyswara aap ye paper padhiye...", "belpatrr": "People who are appreciating her on her debate with rubika saying \"swara nailed it\".....Abe gadho ke pillo tumhara muh kala kar ke aayi hai tumhari jahil aurat😹😹😹", "sy.ed3678": "U are not alone, the ehole nation with you,", "rani_meeta": "2010 me 15 saal ki thi ye😉🤣", "pristineluv4eva": "U r making conflict n dividing our nation ...so if u have problem den leave d country dats it ...u dnt have ne work ..wat contribution u have made for d nation prosperity n unity ..please answer ..always requires publicity ..", "ms_slaying_bae": "Ap harmonium thi rubika ammi baja gyi tera😂😂😂😂😂", "summi_sayed": "You nailed in ua communication with Rubik's 👌", "ingalgigs": "😂😂😂", "india.emperor": "tu his din mere hathee Chad gaye teri chamdi mai apne plas se ootarroonga.....🤣🤣🤣🤣🤣🤣", "sambhaji_agalawe": "Burkha pahan tu", "ramkumargahlot": "Kaisa laga abp news mai beizti karwa k @reallyswara", "akshay_hindu": "@reallyswara दिल्ली में आग लगवा रही है तू", "mamta_kalra19": "People like her are....JAICHAND OF THIS COUNTRY", "shubham_ess_ess": "Boycott her", "manjusikarwar": "Just an advice when you're going to debate on something you should be ready with facts and figures , and show some respect for our PM and Country", "aaaaankittttttt": "Abe padh likh ke Jaya Karo 😂", "wastefultodays": "funny. All the things that you mentioned in here- spices, kahwa, the sari you wear are all products of pre-islamic age Kashmir, yet you use them to pander to the likes of violent extremists who's rather see Kashmir destroyed, it's original culture butchered to bits, and it's people turned into sympathisers of ISIS and Al-Qaeda rather than it be a part of india, where people of every religion can cohabit, where the right to free speech and religion remains etched in stone. Apne aap ko itna ironical dikha kar kitna kama lete ho? Upar se jab NRC bana hi nahi h to uske kaunse भयानक provisions ki baat chal rahi h?", "amiyad18": "Lime light e asar jnno onk kichu korte paren apni.", "memerian_hehe": "😍😍💕💕", "samramush": "Thank you 🙏", "imabhipatidar7": "Tatti jesi 💩💩", "phytoplankton13": "Finally you are hot..... Burnt Ass 🤣🤣", "itsmejimmykewl": "And i dnt hv anything against RSS there r good n bad ppl everywhr. NITIN GADKARI is my hero bcz he knws his limits n he is working for country. 💗💗", "biswasaranya": "Grilled hone se phele.🤣🤣🤣", "junaid_m_wani": "Love From Kashmir.Thanks❤️", "harshal_saggi": "Lovely saree. Pl share Yosuf bhai’s no", "_bhairav._": "Kara aaayi bezzati😟", "vijay__semwal": "😂😂😂😂😂", "harsh_singh410": "I hope you'd learn to read the act before spouting hate towards hindus", "lsemwal1920": "बेइज्जती कराने के लिए तैयार होकर जाना कोई इनसे सीखे😂😂😂", "_kedarpandya_": "Maths ki teacher 😂😂", "bravo.915": "Agar itna hi bolna h to pakistan m ja kr raho -angelo Indian.  #kuch knowledge nai h debate m aa kr bet jati ho ###  Same on u talking against Nrc, CAA. #Get lost", "_prem_thakur__": "Hnjii or aajadii hai Ki Modii ne pkd Kr rhkhi hai we storngley support CAA", "takshak1987": "Kaisi loose character wali lag rahi hai", "suchu15": "Nobody is indifferent to Kashmiri people...stop spreading hatred yaar ! Kitna negative ho tum @reallyswara ! Har cheez me negative hi dikhta hai tumhe! We all admire Kashmiris for their talent, beauty their beautiful culture...Their artisans are much much appreciated everywhere! Grow up", "sandesh_sany": "Make up uthar gorgeous nikal jayega", "amd4433": "You looks so nice in saree..and your smile is always killer☺️😍❤️", "ruheenajavedsufi": "You are as beautiful as your soul", "raman.singh_rawat": "Are iska solution yahi h ki saare Bhai milke isse unfollow maro🙏", "alexander_viii": "🤮🤮🤮🤮🤮🤮🤮🤮", "firoz_khan2016": "😍😍😍", "megha.b.sood": "Applause for rubika👏👏", "a.b.h.i.i_a.b.h.i.i": "ईस बेचारी को भनक भी नहीं थी कि इसकी कितनी बैजती होने वाली है। 😂", "lucifer_00000000000": "You are beautiful princess", "badesabtamboli": "Looking so beautiful", "riya_bansali26": "teri maa ka bhosda", "shivam5964": "What is your age", "ft_music_souarbh": "Ky dhoyaa madam apne dalal media ko rubika kee band baja dalee .. Mere haat main power ajain na sabhi news channal band karwa do sirf ravish kumar channal hee lagoo kar doo", "purendrasrivastava": "Kuch bhi😁😁😁😁😁😁", "mohammadfaisaljamian": "उसके फरोग ए हुस्न से झमके है सब में नूर, शम्मा ए हरम हो या दिया हो सोमनाथ का।", "ictbvas": "Kabhi kashmiri pandito ko bhi khaya mein laaya karo... Anti indian raand", "_thakur_prasanjeet_simba": "😂😂😂😂😂😂 ready hogai phir chutiyaapa krne k liye", "lakshana_c": "CANNOT get over how gorgeous you are😭❤️", "waqarhashmi2011": "Asli bharti naari ❤️❤️", "anurag1997sharma01": "Bezzati krawane se kuch samay pahle", "iman.z.khan": "More power to you", "royrahul.0199": "Pee ke gai thi kya itne bare news channel ke debate me ...kuch v bole ja rahi thi akkal nam ki chj hi nahi terr me, gawar jispe debate krne ja rahi hai kuch to pafh le uske bare me.. Bheekh mangne se fursat nahi hoga na Bollywood me isliye time nhi mila suwar bharskar ko", "ankuryadav1": "Kya pta tha bechari ko etna taiyaar ho ke live beijjati krwane ja rhi h...mtlb shi h beijjati krwane bhi log etna taiyaar ho ke jaate h🤣 Ma JNU mein faculty thi toh admission mil gya verna dimaag toh Amity mein admission lene layak bhi nhi h🤣🤣🤣🤣", "vishu4997": "Tu desh drohi hai"}