{"nishantsinghrajput_": "Kataiye bikau aurat hai tu🤦🏻‍♂🤦🏻‍♂ fame ke liye kya kya nhibkrtey logg", "_.s.o.u.r.a.b.h._": "Abew kisi Pakistani ke sath Roz soti h Kya ya phir koi terrorist Teri gand Leta h", "_the_real_sunny": "जय हिंदुराष्ट्र 🚩", "romiroy_14384": "Ye paida. Hone ki baad Dr bola hoga aapki ghar chu paida hue h jisko aap Pakistan chod ki aao coz iss mc ko waha ki logo ka muu m lene m maza aata bc kahi bhi hag dete h", "11_prashant_mishra_11": "Iski maki chut madrchod", "visheshdhanuka": "Accha hua", "nasirkhan71": "Really Ashamed", "prasannajeetpinchu": "Aap bahut ashamed h to pls niche link ka bhi jabab dijiye https://www.facebook.com/1122453400/posts/10216915826384229/", "iambuyer49": "Hijdo ki fauj yahi kr skti hai swara ji", "official_aayushgupta": "Didi ko mulla ka lene me hi maza ata h re...😂😂🤣", "brijendra_amliyar": "I am ashamed on you.. 🖕🖕🖕🤬🤬", "im_shubham_shukla": "Ooooooobhhhhaaaaaaiiiiiiiiiiiii kitna galat huaa modi chup hai jawab do hame dabaya jaa raha hai mara ja raha hai ye bichare ka ser fhod Diya ushki bass yahi galti thi ki eshe Biryani khani thi kya aab ham Biryani bhi nhi kha sakte kaha gya article 14 .... Yee Constitution ke khilaaf hai 🤫🤫🤫🤫🤫", "maanav40": "Aaaaaaa RAND abhi woh 2 sadhu ka picture post kar na chinal", "_priya_98___": "Kuch bhi bolege tumlog comment aa ke desh mein jo ho raha hum sabko dikh rah hai sadhu ho ya maulana dono ek saman hai plz kisko bura mat bol bura politics hai", "_the_parul_verma": "Two hindu sadhus were attacked on palgarh, hindus have become endangered in india, police and health workers were attacked in indore. Now will you not blame those civil servants, now will you not criticize the police , now will you not stand with logo we want justice.the fact is u r generalising things. Ek police wala galat to puri police galat. Do u even realise 16 18 hours they are working for our safety. And should we now generalise upon you. That because if you the entire film fraternity is bad, is anti national, is shameless, is coward, is self centered. Being at such an important position in ur life, u ought to take responsibility if what u speak and say. U don't only owe an apology to us, u owe and apology to the civil servants and health workers.", "sajinnair2794": "Madarchot woh sadhu mare toh post nahi kiya salli namak haram madarchot pakistan ki randi wahan se funding aata h na salli randi ki bachi jake shaheen bagh mein beth madarchot", "pratikksshhaaa_": "Where is the 'sadhu' wala post ??", "beautifulindia933": "Itte pather ikkatha kie, gullel bnai,petrol bomb bnae..fr bhi esi halt😨", "artist_goyal": "aap dikhai nahi de rahi 😂 🚩", "shubhamumredkar_": "Didi ki ma ka bhosda...ab didi ko police wall pe hamla ho rha h woh nhi dikh rha h...pr..didi ko toh mullo ka chusne me hi maza aata h...aise kaise chalenga...Randi didi", "im.dark.horse": "Didi ko hindu sadhu ki lynching nahi dikh rahi hai... sharam karo @reallyswara mai bhi leftist hu but teri tarah mullo ki nahi.... chiii tere upar🤮🤮🤮", "samar_rai_17": "U should be ashamed of urself mtlb aapko palghar nhi dikh rha lekin aap ko mulla ka lulla dikh rha hai shame of u", "devayani.puranik": "You are a disgust and utter shame to this country.", "___abhishek98": "Kya chutiyape h tumhare bhi😂", "sachin_khatawate21": "Palghar lynching 😠😠", "lavishjain13": "Pandyaaaa😂😂😂😂", "singh_ayush01": "Tu bathroom saaf kr. Usse zada teko kuch aata bhi ni...!!!", "bhavypatel2015": "Abey mc @reallyswara tu iss se ashamed feel kar rahi hai aur #palgharmoblynching pe tujhe kuch feel nai ho raha tu bhadwi hai hindu nai", "_.akhi": "Didi post dalo na ! Ploxxx hindu logo ke lie bhi kuch kro na !", "tiwarijii5250": "abhi tk palgarh... par kuch post nhi kiya aapne...", "anushree_arpita": "Didi fir mob lynching wala post dalo? Kidhar h?", "vardhan.sharma.69": "U should be ashamed of yourself for ur biased way of thinking where is the post related to palgarh sadhu lynching?", "nicks_102": "arey Hindu sadhu log ka b post kr do ab... ki sirf Muslim ka hi Pasand Hum Hindu ka b daikh aur pasand aayega..try it @reallyswara", "nikesh_9462": "What about palghar incident mam...har nonsense baat pr kutto jese behes krne vali...now u are not ashamed???? Bloody hypocrite.", "aadi_bhure": "Why not ashamed on killing saadhus", "beena_gairola": "Why are you not standing up and posting about those hindu sadhu's killed brutally in maharashtra, why because they were not Muslims that's why? You hypocrite", "p_i_y_u_s_h_nai_007": "Me to kaheta hu iski movies hi dekhna band kro.... Jab kam milna band hoga...bhukhi maregi tb malum padega isse", "yashkritsingh242": "Abe hindu k upr kch hua tb kch na bolo aur muslim par hogya to tumhari jl rhi h", "_shiva_verma_": "What happened to u now mam??...old sadhu was beaten to death....why u quiet now??...afraid of what??...tum jaiso ki vjh se humanity badnaam h...mob ko kch kehna bekaar h...vobto vaise bhi kisi ki nhi sunte...dikkt tum jaise besharmo se h...", "godfather69876": "Randiii", "artistan___": "You know what you are blind with a pair of Eyes", "v_j_vishuuu": "ab tujhe kuch nii bolna?", "jeet.malvii": "16 ko sadhu ki hatya hui ab photo nahi daaloge.... Ab kuch nahi bolna kya. Net pack khatam ho gaya kya?", "sw_heramb": "Are vo aap he ho na jo sandas ke add karte hoo.😂 harpic pa bhe swaccha bharat ka symbol hain 😂😂", "spam.jainn": "Sab bc sadhu ke baare mein puch rahe ho. Insaan ke baare mein socho.", "vipul_choudhri__": "Mullo Se Gand Mra Le Randii😅😆😆😂😂😂", "poreshivam": "Palghar ka kya!", "vikasingham": "Dekha bhadwi ka content delet kitne badi bhadwi h", "aakash__pawar40": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖖🖖", "ankit.anand.58910": "Sali r@ndabhi abhi kha h tu kis maulee ka l@d chus rhi h", "aadityakshirsagar99": "गलत अपेक्षा मत रखो इन हिंदू धर्म के दुशमनो से इनहे क्यू दुःख होगा साधू की हत्या पर ये तो येही चाहते है की भगवे को मिटाना", "kiran_3814": "Mar sala ko👌", "gymaholics_gg": "Ab sadhuo ka daal na raand ki bachhi", "ristagram_101": "Kyo be aunty ji abhi aapko sadhu nhi dikhte kya Palghar ke. Bolo na anuty", "navneet___007": "@reallyswara kuch to bol de palghar ke liye maderchod rand", "geet_2602": "Comments me tujhe par bhadas nikalne ka bhi kya fayda....chutiye ki khulle me chutiya kehne se wo apna chutiyap to chodega nhi.... ab Palghar incident ke liye ashamed nhi hai bc??", "an_atheist_vegetarian": "Lol. You weren't ashamed for the Mob Lynching over a Hindu Monk. Afterall, bhai you are a big Leftists celebrity filled with hatred towards Hinduism only.", "montyk1921": "😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "sachin.kr.sahu": "@reallyswara didi sadhuo keh lia aap nhi dukhi hui👏", "abhisheksharma2994": "@reallyswara andhi ho gyi ya aankhe foot gyi jo palghar ka kaand dikhai ni de rha aatankwadi supporter..", "dhruv_ruhela": "Today she is proud. She will not speak a word for those sadhus🖕", "its_tyagi_08": "Kam aygi tere liye 🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕 feel krio shi se", "sl_gokuop": "Ab sadhus ki bhi post dal na mc", "shruti_31291": "Are Maharashtra me jo hua uska pics. 🤔🤔🤔", "dixitdhariwal03": "We are ashamed of you ? Kha ho itne Dino se ? Oh sorry aapke toh bio me he likha hai dramebaz 🤣🤣", "rachzjadeja": "Any comments on lynching of the sadhus.. Ms ashamed??", "im_rvyas": "@reallyswara and we are ashamed of u. Maloom h tum nhi krogi post un SAADHU k liye bcz tumhara ghar chalne k liye jo CHANDA aata h na wo band ho jayega fir But we all knew who are u and where is your place in our society ( in a dustbin ). Keep going on but u can’t.", "dr9015": "That's the problem Ms Bhaskar! Why this selective outrage? Why couldn't you post picture of Ankit Sharma who was stabbed more than 40 times ? You could have used both the pictures to show losses on both the sides.But NO! Why such evident bias against people who lost their lives or are you pained only at seeing the Muslim names? I really wish to know why you do this all the time?", "officialjin_sharma": "Tera purana pati hai na yeh", "abhishektomer__": "Aaj nahi he tu ashamed ? Aaj to tu khush hogi, double faced bitch sali un logo ki pet, kher terkeo chatne ki adaat to he hi", "uttam__parjapat": "Only hindu logo ke against bolti hi tum..... hamre paiso se hi uper uth te ho or vaps hmari hi burai.....aaj post krne ke liye tumhare pass net nhi he kya ??", "lightbox_creation_": "I used to thought you stand for what's right and show the people if there something wrong happening in our country that it's wrong.. I stood by you during JNU incidents During CAA and NRC.. and especially against mob lynchings.. I thought you gave fair opinions and showed outrage against wrong things.. but sadly and really it breaks my heart to say this.. You too show selective outrages...", "dankdunia": "@reallyswara Why not uploading sadhu's mob lynching today ? Doesn't it make you ashamed now ?", "gautam_017": "Chutiya aurat and gawar actress. Best combo😂🤣🤣", "vedanttsh_": "Bookhi mar rhi hai ye career bachane ke liye limelight mai aana chahti", "rajunarle": "Didiji Maharashtra lynching par bhi kuch bol do...😏", "___satyamsingh___": "Maharashtra Lynching Ki News Apko Mili KY av tk. Ya ap sirf paid promotion hi krti ho didi", "xx_beast_xx_nick_xx": "Maharashtra Palghar do something swara your hypocrisy is in danger", "vidushibhradwaj": "Didi.... Maharashtra lynching pe bhi kuch boldo", "_baekoof_": "Heights of hypocrisy!! 🖕🖕🖕🖕🖕🖕🖕🖕", "__________sachin_________": "Kha ho bcha, dant me taar bdhwane gyii ho kya😅🤣🤣🤣ab karo tweet", "iii__baaz__iii": "Mar gayi ki jinda hai shame swara randi", "_prashantpal2002": "Madam what is your opinion on महाराष्ट्र monk mob liching lagta hai ye sab tumhare sasur k naati hai", "__harleen__20199": "Didi vo palghar k sadhu k liye to kch post kro😭", "alfa_4g": "Lavdi💩", "ankitkeshri707": "Ab Maharashtra me bhi mara gya esse he wo insan nai hai saali dalal kahi ki ghr ka rasoi chalne ke liye log Itna niche gir jate bhchod @reallyswara", "google_4404_": "Waha sadhu mare h dande kha krr ab nhiii bolegi kuchh tu ... I am ashamed ki tu indian h saale tum hote hi nich ho .... Really shame on you tum jese log aise waqt pr chup beth jate ho .. to baki muddo m kyu randi rone krte ho @reallyswara shame on uhh", "sahilpandit_420": "Kal jo sadhu mare gye unke lie b kuch post kr bkl mc", "mukesh_bhaijan1": "Jo karega danga uski chut me meri danda", "definaite_07": "Yah toh PTA h tabhi sab andh bhakt is pic Ko dkeh kr Maja le rahe ho koyi apsos nhi jata Raha h aacha apka soch desh Ko bhut aage lekr jayag", "imsavinay": "@reallyswara Kasam kha ki aaj k baad delhi ni jayegi kyunki tujhe sharam aati h", "shivampanwar.3433j": "Dal na chutiye Maharashtra ki pic🙂", "var8754": "Kis suar ki paidaise ho", "toshitpatidar": "And India is Ashamed of you. You are no one to be ashamed.", "rajatjadhav7": "Tumhe bh aise hi pitna chaiye..bc", "dhote.rahul": "Aye jihadi didi... Police or doctors ke sath jo ho raha hai uspe ashamed feel kar rahi ho ya proud??", "tusharpiyush": "Very good in sale ko aise hi pelna chaiye", "banna57359": "Maro bhadwe ko", "gajanan_harne_patil": "मुझे धिक्कार हैं तुझं जैसी औरंत पर ,तुने देश का माहोल खराब किया हैं तू जीस किसीं भी भगवान को मानती होगी वो भगवान तुझे नर्क मे भी जगा ना दे ,दो कौडी की third class backround dancer, तेरे गांड मे इतना ही किडा हैं न हिंदू से टँकरने का तो आ माईन करता हू तेरे से debet ,भिकरण ,चुडील", "dhakakalia": "Tu Bach gayi re", "rayzdap": "👏👏👏👏", "meamanverma": "Bhen ki lodi swara", "singhkhajan9": "पुलिस को पत्थर मारते वक्त शरम नही आई क्या... तब न जाने तु कहां गांड मरवा रही थी स्वरा🤬🤬🤬🤬", "abhisingh2477": "Ek baat maje ki ye hai ..jinko ye support krti h unme se 80-90 percent ko Instagram chalna hi Nahi Aaya h.. Ab Kaha ho tum ..desh ko bachane Nahi Aaye aage.. Kitna contribute Kiya PM fund me.. tum Jaise neech log desh ko barbaad kr denge", "mrigank_b": "Ek din ye halat tera bhi hoga samajh le randi", "abhi.shera": "😂😂😂", "iamjayrawat": "What about hindu people who died useless girl swara ka bhosda 🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕 my middle finger salute u bae 😂", "___b_e_a_s_t______": "Yahi ab desh ki maa chod rhe PR tmko Kya behenchod police ko mrwao Dr ko mrwao aur khud ghr me baith k maze lo bc nafrat h Teri jsi randiyo se", "heyy_ajayy": "And India is ashamed of you", "vu_ankita": "Why only one pic there are whole lot more just don't narrate the one sided story.. #librandus", "abhijatmohapatra": "Aab bol Chahiye Aazaadi .....Sahi hua ...mere taraf se bhi 2 laat", "the.adultworld": "Shame on u @reallyswara u shetty", "jeevraj_bhadanaa": "पुलिस आजादी को वितरित करते हुए ।। इसकी गान्ड पे भी आज़ादी लिख दिया होगा", "shubhamkr0610": "Good job 🤣", "happy_letteringgg": "I can see.. ma'am ne kisi muslim ki pic daali toh logo ki kitni jal rahi hai 😂", "shivam.k_thakur": "Everyone is ashamed of you💩💩💩", "lalit.jindal007": "We r ashamed on U bhaskar 🚽", "sachin.tripathi.9693_": "Hmm aap apne uper kro....But I'm proud of it......Waise bhi gaddaro ko kya kahe @reallyswara", "naveen_gaurav": "This pic is perfect u r fool madam", "ashish._.kapoorrr": "Haan tujhe or kuch nahi dikhta haina Andhi autat", "jagdish170617": "@reallyswara mast scene he puri picture dal be🤬🤬🤬🤬", "jain._anurag_": "U r not ashamed when our armed forces are being hit by them saali teri jaisi aurat is desh k liye abhishaap h", "avii_nav27": "Swara ki maaa ka bhosda😂", "devashreevijay11": "And we're ashamed of you. Your humanity is only for one particular community. You must have not seen polices who died, severely injured & acid attacked. You must have mot seen Hindus who were killed. If you want to raid voice then raise for EVERYONE without checking their religion or identity. Your heart is even more uglier than your face.", "i.priya_sharma": "And we r ashamed of u..", "a_a_r_u_s_h_1603": "Chl laudi", "avinash_verma721": "so ja iske sath chudwa le isse agr itni hamdardi h", "ronavsaxena": "Ankit sharma ko b yaad karlo", "14r12s96": "we are just ashamed of you, swara.", "prithvi.s.chauhan": "Atleast he is alive, due to tolerant hindus, mulle hote toh shkl nahi phchaan paate !", "scorpiogal_div": "🤣🤣🤣🤣", "abhishekbhardwaj0909": "Bhen ki Lodi kisi Hindu ki photo bhi dal details par nhi muslamaan tujhe chodte Jo hai", "_om_mani_padme_hun_": "Ohh you have shame 😏😏", "thateyeiswatchinu": "hahahahaah🔥🔥🔥🔥😂😂😂", "khanrampuriasad": "RYT jab tak is desh me BJP hai ye desh khbi aage nhi badega bs jahli log hindu muslims karte rahenhe or Rss ek terrorist organisation hai is pe band lagana cahiye", "amankchauhan98": "Margya mulla maderchod 🤣🤣🤣🐷🐷🐷🐷", "soniachauhan2006": "Are you mad 😡 😡 😡", "dirtybootsandmessyhair23": "Yes u should be ashamed of yourself bitch", "shubham__banna": "Ankit Sharma nhi dikha tuch ko suar Jisi Sakl ki mc", "sketch.786": "Sali trre jaise log danga karwa rahe hain", "nisha.2161993": "Yes you should be ashamed on you only", "rasikaborade9016": "Tu toh bhadwi randi chakki hai", "nehashah5761": "We are ashamed on u only", "thekimchiikid": "I can't believe the fact that people are defending this photo. Instead of recognising an evil, people are abusing her because she is standing up to it. This is communal violence. This is wrong. It should stop.The end. @reallyswara", "rishi09official": "Ye sali CAB ko protest kr rhi thi..tune dekha kya Hindu ke uper kitna atyachar chal rha h ab iss time..uska toh ek b nahi dala..ye saali Pakistan ki kutta h..unfollow karo sali ko", "a_n_i_l_h_e_g_d_e": "Apna Insta account bandh karde,tu sirf gaali khane layak hai,yaha 95% log tujhe bus gaali hi de rahe hai,samaj ka ki teri layki kya hai ,tujhe sirf JNU wale chutiye support karenge baki sabko teri asliyat pata hai ,tu sirf 💩💩 hai aur kuch nahi 💩💩💩💩💩", "__karipandey__": "Due. To less air pollution log swara ki jalti gand ko dekh skte h", "palbipin": "What kind of person you are", "saanskari__playboy": "@reallyswara I appreciate ur courage for standing what's right and for being yourself", "ankursharma.1": "Murk khi ki ..", "prasadjagtappatil_1111": "😂😂😂", "kartikey_w15": "Yes you should be ashamed of yourself. When jihadi Muslim mobs attacked and killed Hindus that time no one posted about it. Now one mullah got attacked then you get new content to post. Leftist HYPOCRISY EXPOSED", "dea_bestfriend": "It doesnt matter aapko ye gaali nikaal rahe hai. Bcoz duniyaa inse nhi shareef logo se chalti hai.. aur ye ek din apne bacho ko kyaa sabak denge jinki khud ki mentality aise ho unke bache tou criminal he banne ge ..", "dhrupal2298": "Toh mar jaa", "siddharthasaha133": "Swara you are a whore !!!", "anujphg": "Inke saath yeh he hona chaiye....corona faila rahe hai", "vaibhavameta": "Bkl lavdi", "raahichauhan": "Kya rate chal rhe hai tere ra+di 😂😂 😂🐖🐖🐖 yeah mullo ki yuhi maa chudegi bkl ki mc randi", "_xabhishant_": "Han aunty...police walo ki bhi share kro na..ungli ka istemaal yhan kariye🙂", "keystrokes_warrior": "We are proud on this photo #olauber #JaiHind #FukJamatis", "shubhamsinh07": "do char Film kya kar gand roket laga k havame udne lag gaye sale", "gymfreak51": "Bkl kyu Hindu bani hui hai jooth ka...salli yai tu kisi katve ka beej...bhadwi", "ankittripathi2930": "😂😂😂😂😂😂", "raunakrai1301": "Swara ko burnol bhejo", "nishisnishi": "Ankit sharma bhi mra tha behen, uski photo daali?", "kr_dhananjay": "Aisa he hm tmhare sath karna chate haj", "harsh_._anand_._": "Sirf yhi dikh rha aur Kuch nhi....rnd", "quirky_girl05": "Abbey kaha h tu.. Hindu ki dushmann saali.. congress ki rakhel🤬🤬🤬 bc mc", "yatin_2000": "😂😂😂😂😂😂😂😂", "aman_24_1997": "Indore me jo hua uske baare me bol lo", "nationalist.sahil": "ankit Sharma ki bhi photo daal de BKL", "pranav_n_kalaskar_06": "😂😂😂😂", "classiccringe": "Jihadi swara, where's your coverage on tabligi jamat. Paid activist still sasti vali 🤦🏻‍♂️😂", "_pramod_patle": "Hahahahahw😁", "xxiii.v.mmii": "Namo namo", "shalen_mishra": "This is not new India this is ur kejrivals fucked delhi.🤬 Boycott her all movies in which she will participate.", "mr_aman_royal_pandat": "Boycoot swara bhaskar khan", "janhavirajput": "The whole family of sikhs got killed in their Gurudwara...which they would never have imagined in their wildest dreams...are you ashamed now??", "roaring_rathore": "Nothing more..but a bitch u r..u know nothing of the other side...u biased..u gonna fet fucked someday soon.with", "shivaay__thakur": "We are ashamed of u suara🐷", "yanshidwivedi": "#ankitsharma", "aakanksha8492": "Badi aai mullo ki amma", "iam___divya": "🖕🏻🖕🏻🖕🏻🖕🏻", "bhushan1489": "Wese kitne me soyi thi tu congressiyon k sath, kitne paise diye tujhe.... Ye to bata suwara", "miss_deek_20": "Madarchodddd mt kr 🖕", "_the_rutul_patel_": "Teri maki bhosdi ashamed of India bolti hai toh logo ko bhadkane kyu gayii thii shahhen Bagh ghar pe bethii bethi rehti itni hii ashamed hai toh Apne 24crore ke saath Chali Jana Pakistan madarchod randi Abb B-grade actress Gyan jhadegi BC , Ankit Sharma ka bhii dikhade thoda sa toh kuch dua mil jayegii", "aayushi_6241": "Swara bhaskar h ki swara jihadi mc", "sl909": "You liar @reallyswara", "sh_ubham7232": "Isko sab unfollow karo", "ryt7.86": "where is shahrukh's photo who was shooting at a police officer ,, run..dee", "charismaticrachna": "Abi bhi time hai thoda sharm karlo", "duttguru00": "Swara tum log jitna dam laga lo kuch nhi ukhad sakte kutte ho tum jo CAA ka virodh kar rahe ho sher hai modi na darta hai na hi piche hate ga ab to bahr se jo muslim aye hai unhe bahr nikala jayega aur sirf hindu muslim sikh jain bodh isai parsi inhe hi nagrikta milegi", "riyamor5": "@reallyswara how much money did congress paid you for spreading hatred", "gauravkaushik_rj05_": "Ankit Sharma ka bhi name lele Randi", "kartikpresidencyhotel": "Don't be selective mam plz show the pick of IB person Amit Sharma who has chopped 400 times and thrown in gutter don't look one side secularism we Hindus are only not taken the responsibility of secularism what was Ur opinion about Muslim mob especially Tahir Hussain gang who play the Holi with the blood of Hindus......", "_gryyfindorr_": "If this is who we are, look at urself in the mirror and see how hypocrisy overflows! This is not bullying this is just a curiosity to understand ur thought process coz I know this thought process is gonna harm India in future. I want to be prepared!", "love_life_point": "🐷🖕🐷🖕🐷🖕🐷", "vraag_mittal": "Do saale me aur 10 dande....kar ab tu allah allah...", "prathamesh_dhamale_deshmukh": "😆", "reyaansh2909": "#ankitasharma Ankit Sharma k murder pe bhi ek pic dalkr apni feelings jatati to samjhte k desh ki ho. Your father must be ashamed of you, whole nation is ashamed of u except some specific religion people, jinke liye khadi ho jati ho. Use your brain. @reallyswara", "arvindrawat270": "Abe sallli delhi k baare m kya rai deri h jb yha rehti hi nhi ye bhosdi wali", "shrikant_ojha_001": "😂😂😂😂😂", "souravdeb0332": "Ankit Sharma ka name ekbar bhi nhi bole aap ne ma'am......", "awokehindustani": "Lodi ki bacchi", "i_ashishbisht": "Rubika liyakat se apni beizzati puri india ke samne karwake iska man nhi bara lagta hai", "shysnickr01": "Misleading people....anti-national woman.....change your nationality.... because you are not even thankful to your country....in which you enjoy great freedom...vrna apni favourite country mein jao ..tb tumhe pta chlega ... And you should be ashamed of yourself...not \"us\"", "kartxdillon": "😂", "destroyer_god": "Tu Hoti kun h chudail si sakal ki .. saali hum rhte h Delhi me aur acche se jaante h ki tere Jaisi do kaudi ki rndi b Shamil h iss terrorism me Desh k gddaro k saath... Thuu h be .. itni gaaliya khaa ri h fir b sudhar ni ri thuuu", "ynwa.anmol": "They missed a spot 😂😂😂", "imrityunjayshrivastava": "Mam anti hindu hoke kitna paisa kmaleti h aap?", "rao_sahab_0103": "Suar-a bhaskar suits you more.", "rakeshsingh9392": "Sala jo police pe khuleaam firing kia wo muslim ..jo Ankit ko 400 baar maara wo muslim ..jo danga kia wo muslim..aur dangayi hum ho gye.. Iski nazar me.. Randi ki jhatt😠😠😠😠", "rahul.singh.parihar": "Maro madarchd is katue ko", "sameerpatil23": "@reallyswara stop acting like you care for that person ..and focus on your gone career .. these things to are doing are not doing any good for the situation..and please stop spreading hate.. and you really should be ashamed of your Hippocratic behavior.. PLZ DONT SPREAD HATE!!!!!!!!😠😠😠😠😠", "ved_kulkarni_144": "Delhi police zindabad zindabad zindabad..... Ye lines complete karo... Desh ke gaddaro ko ,", "the__shivholic": "Why are you not posting any pic of ankit sharma or tahir hussain's house. Aap log bs ek ideology ko promote kr rhe ho pr itna smjh lo ab danga krne wale ke gaand me danda hoga...ab votebank nhi chl rha h...ab inki achi se pitai hogi...riot koi bhi kre ye glt h pr ye haramkhor ek haath me tiranga lie h ar dusre me patthar...ab jhande ka danda inki piche dala jayega.... Swara Bhaskar plzz stop spreading rumours", "gajanan5070": "Madam bakhi log kah hai hi", "sharma.jeetu28": "Ise fir se rubika liyakat k pas bhejo wahi iske dimag se hindu muxlim ka keeda Bahar nikalegi 😂🤣😂🤣😂🤣 Reuters ki pic post kr k Chaudhary bn rhi he koi ise ratanlal Ankit Sharma k bare me b batao Hindu muslman nahi indians killed by terrorist", "fragrant.memories": "If you have any shame left, also post the picture of the Intelligence Official who was stabbed more than 400 times by Muslim leader with the name Haji.", "vijay_jartarghar": "Ek Din Tera bhi Aisa Hi HAL hoga🤬", "mr_kunal_a": "Jaytu jatyu hindurashtra🔥", "mbvb011": "😢😢😢حسبنا الله ونعم الوكيل", "coldmonk01": "Yes you should be ashamed of yourself.", "thadamohit": "😂😂😂😂", "_hey_meme_": "Behas tb kriyo jab knowledgeable ho jaye.. RUMOURS sun k behas krne chli gai🤦🏻‍♂️ bc pgl aurat !! Bakchodiya hi krti rhti h bs career hai ni attention chaiye bakchodi kr k", "couple__goals69_": "Tu Pakistan m shift hoja", "chandrshekhar4567": "Fake 🙄", "shakti_malik13": "We are ashamed of you. Humne kuch bola apse. Nahi na. To keep your mouth shut. Mam.", "abhisekkrishna": "the IB officer in delhi which was brutally killed by the mob in the riot why didn't you post ankit sharma picture who was killed and the body later was found from the sewage dump why having so much biased", "pushpendrakulshresthaa": "Dhikaar h tujh jese hindu prrr......... Esiii kesiii secular ki tujhe muslim hi dikhtee h.........", "critical.baba": "😂😂", "studlaunda11111": "Do you have any knowledge or any idea what the shit you are telling ............u don't think that 100 of peoples watch you ....", "jay_donga_24": "Anti national", "sher_e_hindustaan": "Iske jagah tu honi chahiye thi @reallyswara", "_dippi__": "Pulwama me jb attack hua tha Tb to tumne koi pic nhi upload ki thi Tb tumhara dil nhi pasija tha or ye gaddaro k liye bdi moh Maya dikha rhi .kutta bhi wafadari rkhta h apne maalik se or tum to usse bhi gyi guzri ho.", "fuckksecularism": "Swara you can change your username to \"jihadi\" we don't have a prob", "rishikesh54321tunnu": "Jai shree ram", "chauhansaksham007": "Ankit sharma.........naam yaad rakhna bc. Aur jab kal iska beta badla lega to mat puchna ki baap kaun hau", "ravi_jaiswal1998": "Abe Lauri Ankit ka bhi bata na 🚩🚩🚩", "jairajput1309": "Chutiya hai kya tu yar kuch bhi bolti hai", "arbehl249": "Jo goli chala raha hai uska bara mai kuch nahi", "traveller0.01": "Whole India is shamed of you.", "i.am.pand3y": "Desh ko todoge toh police tumhe todegi.", "digvijay_sinh_rathore": "Bahut ganda maar maara re bhai esko...😄😆", "chetna_gill1": "#savedelhihindu #antihinduriot .. desh k tum jaise gawaro ko 30 A k baare mein btao saaro ko ...", "iamarunmehra": "@reallyswara we are upset from you .....🤮🤮🤮🤮", "bhagva_rang_hindustan": "Maaaro inn mullo ko bc🤬🤬🤬", "randomoddbusiness": "No we are ahamed of you", "mr.showman_786": "Caa ke protest walo ko to aphi support kati hai dange karne wale bhi caa protest wale hi hai", "_i_am_v_i_v_e_k": "@reallyswara behen ki laudi", "h_u_n_n_y_j": "JAI SHREE RAM❤️", "singhsiddharth046": "🤣🤣", "spark.me.blue": "@reallyswara picture sirf ek particular religion ke hisab se post mat keriye. Is pic ke sath Ankit Sharma ki bi pic post kerni chaiye na. Sirf ek religion ki ladaai mat lado. Sab yaha mil julke rehna chahte hain , sirf kuch logo ke bayaan ke chalte sare hinduo ko target mat kero aap. Me Delhi se hu or mene dekha hai ki yaha kya horaha hai. Agar ladna hi hai to sabke liye lado na , ye kya natak lagaya hua hai !", "sarcasticbutthurt": "U should be ashamed", "mahima_tya6i": "Ankit Sharma pr Taras ni aya tujhe....Tb ashamed ✌ feel ni hua ......Tb koi hmdrdi ni hui .....bloody bitch .....itti dikkat h to reh na Pakistan me jake.....akal ajayegi rehne ki 😡😡", "ritansh_thakur": "Pera military forces, police ke sth jo haramkhoro ne kiya use bhi dal deti ek baar @reallyswara", "forever_surya": "I'm ashamed of you", "sunny200kaushik": "And as Indian we are ashamed of you.", "ritikk11": "Gand marwao apne cinema keriyer par dhyan do", "_dig_yadav": "Sale atank vadi he", "whoatulpandey": "He stone pelter and rohingiya tooo... to usko peetna acha hai..hats off u delhi police", "_manishpatel_": "U should ashamed of urself aise same halat hindus ki bhi hui h voh toh ni dikhra tuj. Raand.😂", "aquibvora": "I can trust you more than Modi @imrankhan.pti #ModiMadarchod", "gautam_parihar1": "You are a______", "rishabh_chaturvedi5": "Shame on you swara", "manishgupta2015": "Har jagah isko gandagi failani h.", "_badaldhaka_": "Bhakk 🅱️endi", "krrishh_10": "Ae pagal", "chanskaur": "Ankit Sharma bhi h madam. Unke liye ek bhi post nhi. Shame on you. He was stabbed 400 times. Secularism k chakkar me aap kb besharm ho gyi aap ko pta bhi nhi chla.", "jxsh.sh": "swara, your bio literally suits you, dramebaaz:)", "lybah.r": "@reallyswara now who failed as a state?", "kaustavdss": "Flop swara begum. 😂", "vishjat12": "Tune to shamed hona hi chahiye tere jese #tukdetukdegang ke logon ne hi dange bhadkane ka kam kiya hai. Logon ko Road pe aane ka kisne bola #tukdetukdegang ne. #tukdetukdegangexposed #shameonyou #hypocrites", "mkmanoj16": "Now what u will say #blind modi bhakt 😡", "yashaswanisharma_": "It's really easy for you to blabber about Delhi's situation, while siting there in Mumbai peacefully somewhere in the corner of your house @reallyswara . The attack was pre planned by the protestors, there have slingshots prepared, petrol bombs and acid pouches stored, stones collected. And if you still think that Muslims were the ones who were troubled over here, well that was in retaliation. Can you see people killing your family? No? You'll retaliate against them. If you know, because you haven't talked about it anywhere, an IB officer Ankit Sharma was stabbed to death, and you what, he was stabbed for more than 400 times. An AAP leader Tahir Hussain, let the rioters in his building from where they threw stones and petrol bombs on Hindu houses. ISIS style slingshots were fixed on a terrace of a school and in a cart, which were used to pelt stones and petrol bombs. Stop, please stop spreading hatred you girl, because you're also one of the people who instigated these riots by all the misconceptions you're filling in people's mind. Because if riots break out, you'll be safe at your home, the common people will be under threat, who've already been in these #delhiriots I feel pity for your mentality @reallyswara", "_sukriti.08": "Nd for ur information many many many hindus nd two cops were badly killed.. Y don't u be ashamed for that.. Post that to girl.. @reallyswara", "mal.megha82": "I used to adore her.. horrible to see her reaction.. YOU WANTED THIS.. you are one of those illiterates spreading wrong information on CAA NRC and triggering this.. why surprised? Or just another peice of ACTING you are pro at..", "filmy_guy_": "Blame yourself for this", "goutam8290": "Iska pati he😡", "iamadityabiswal": "Abe e randi ko nikalo desh se....sale terrorist ko vi support karegi future me", "iampawanvishwakarmaa": "Ja pahle acting seekh 😂 saali feminist", "naturelover_prashant": "Tumai ammi ki gand me mera land dalega tab pta chalega itna mulla biklega gand mese tere jaise chutiye nhi niklege 😂😂😂", "aakash3053163": "u have zero knowledge and u know only one word hate.......", "_kan_jo": "जो खुद के ना हो सके वो दूसरो के क्या होंगे #antinational", "indranilsengupta09": "@reallyswara faltu post", "lucky_the_rac": "Tujhe hindu nhi dikhta kya wo bhi toh mare hai😠😠", "kansara_divu": "Tum logo hi danga feila rhe ho esi post se", "rk4056549": "Ek ladke ke sir m dril daal diyaa or ek gande naale mai mar ke daal diya ek ka face pathar se kuchl diyaa or ek laadki ko ngaa kr ke use bhi mar ke naale mai daal diya yrr", "pankajyadav__": "Abee lodi kitna chutiyapa failayegi bc aajadi chaiye inhe", "im_.inayat": "Nikal loudi, Pehli fursat me nikal, koi zaroorat nahi hai Hindustan ko teri, khati idar ka hagti hai udar ka", "spirit_of_the_seas2110": "😍😍😍❤️", "none222222222223456": "I am surprised to see all these hateful comments on this post for swara n muslims, gosh itni nafrat lekar kaise koi jee sakta? Insan ko insan nahi bas hindu muslman smjh rahe hen ye log..", "oegenk13": "ALLAHUAKBAR", "itsanirudhjoshi": "@reallyswara Ankit Sharma ki post me Kru send tuje ...kregi post ?? He is still alive and isko bachane wale aur hospital tak le Jane wale HINDUSS HI THE ... Shame on you SWARA aunty ...proud of @imrubikaliyaquat", "rizvan_haider": "یا الله رحم 🙏", "ultimateprince": "An eye for an eye will make the whole world blind", "bhera_jani": "You are the reason behind this tragedy", "alpha.mas_": "#Hindu_rashtra", "_avi_211999": "U should ashamed on yourself", "iamraj_malhotra": "Tu madarchod hai", "vivekranjan.insta": "Why aren't you ashamed for the death of that soldier? Khusi to Nhi ho rhi n? Wo post Ni krna tha? @reallyswara", "its_me_karnan": "😂", "priyakumari_7": "#indiamyvalentine is justified by head constable Ratan Lal . Why don't you post anything in favour of police force. It wasn't their choice to go in riots it was their duty.Yeh hash tag har jagah use krne se patriotic ni ho jaate. If u're really against CAA go and stand among riots you will definitely get a clarity. Because of you people promoting communist post with no prove ,country is getting more divided.", "tirthakhiyania": "And we are ashamed of you darling 🤣", "vipinsmudgal": "#radicalislamicterrorism", "prashanttmisra": "Ye sb nhi post kregi to aakao de kam kaise milega Randi ko", "debarshiroy12": "We want hindu rastra", "aryan.official89": "Tere saath bhi ESA hoga", "___mahakkk___": "Abey chal.", "jaha_sher_khan": "Tum Chahe Zulm Karo Hum Haq Ki Baat Karenge Sunega Saara Zamana Aisi Fariyaad Karenge Tum Chahe Mitao Jitni Hastiya Humari, Jo Chap Jaye Dilo Pe Qisi Awaaz Banenge, Dabake Siro Ko Humare Lathiyo Se Tum Chahe Jitna Muskarao, Neendien Haram Karde Tumhari Hum Aisi Aah banenge. Tum zulm Karo Hum Haq Ki Baat karenge, Sunega Saara Zamana Aisi Fariyaad Karenge.", "antaryami_._": "Swara Bhaskar agar tumeha itne he taklif ho rahi hai na to chala jayo Pakistan kyu ke agar yaha rehna hai to Shanti se raho tumeha ya logo ke maut dikhai de rahi hai or Jo danga me 43 log Mara gaya unka Kya 23 ka Ankit Sharma ko 400 ka chaku Mara uska Kya . Aaj ek ladki ke kapda mila hai rape Kiya uska or Mar ke Nala me faq Diya uska Kya aab tumehra filmy career to Raha nahi to tum be Socha ke Chalo bhala desh he toda Jaya shame on you swara Bhaskar 🖕", "bansal2206": "Shame on you swara you bitch", "shivam_patwa": "Fake pic hai Iran Iraq ki salute you are extra intelligent 😂😂😂🙌🔥", "xenon.369": "I am ashamed of you", "meme_but_fact": "You should be ashamed of youself", "niravshah2505": "@reallyswara Kutti Hindu log ko mara Woh Nahi dikhta Ankit Varma ko in logo ne mara woh Nahi dikhta kya tuje...", "bhavishya11111": "A policemen is also dead??", "bollywooddiaries_official": "TU SIRF APNE KAM SE MATLAB RAKH.. jai shree ram", "mona_jayalwal": "People like you're responsible for all this. Shanti thi desh m toh afwahein tum log fela rahe ho. #shameonyou", "ashok_706": "लगता है, बेरोजगार स्वरा को और कोई काम नही मिल रहा है😂😂😂", "_vrutti4patel_": "yes... we are ashamed of you @reallyswara 🙈", "krishank198": "Ye patthar mar raha tha or agg laga raha tha logo k hath agaya to iski arti utarti chutiya ghodi @reallyswara .logo ko adhi information de k chutiya bana rahi hai 😠😠", "____priti___": "इंसानियत शर्मसार हो रही है और तुम जैसे लोग भड़काऊ भाषणो से देश में आग लगा रहे हो shame on you", "palari_solankiyan": "Why are you ashamed ...tera kara daraya toh hai ye sab ....muslimo ko faltu bhadka ke tune he toh ye sab karvaya hai...", "pawan_panwar": "And we ashamed of you🙏🙏🙏", "karan_debabrata": "Ye sab fake story share karti hai randi sala", "justsaket": "N we all r ashamed of u.. B-grade actress", "_ak_aash_": "are didi Police ke saamne bandook leke jaoge to kyaa hoga yahi hoga na😂😂", "deep_soni_79": "Maja aata agr sath me tu bhi Hoti 😡😡😡😡 shame on uhhhh.", "smartsam2330": "Chup kr bhen ki Lodi acting aati nhi h isliye rajneeti krri h ab", "pallxviii": "Behen if you are so much ashamed then be ashamed of your fucking self you dumb ass BITCH. Ye dikha ke shameful feel kar rahi ho wbt *MAN* ankit sharma at that you fucking corrupts go blind naaa and before posting and saying anything make sure that you are right varna didi kahi ki ho toh nai but reh bhi nai jaaogi aage bhi", "anayamathur5": "U Shld be ashamed of yourself", "royal_rana8": "Waaao thats cool😂😂@reallyswara", "_imshahbaz": ".bjp mdh***d", "0_.vishnu._0": "Swara bhaskar hate faila rhi h pagal ur kuch ni", "akanshavashishtha": "Inka ek hi kaam designer saree pehen kar zeher ugalna. Kuch pata nhi h bas bolne se mtlb. Aarey ek baar IB officer #Ankit_Sharma ke liye bol leti. Sach mein pata nahi kaise itna gir jaatey h yeh log.", "cosmicgluon": "Fck you🖕🖕🖕🖕🖕🖕🖕", "richa_rjput": "Shame on you swara🖕", "silentknight971": "Yeh chutiyaa h Shahrukh Name ka jo Banda Gun chalata h uska post nhi kregi kitni bdi wali chaman Chutiyaa h tu @reallyswara 😂😂😂", "meet__raval__": "Areee yar isko kyu itni garmi hai!!! BC 👿", "kiranroyme": "Shame on you!!!!!👎👎👎👎 I have 100 of other photos of hindus beaten upto death, the latest one is of IB officer ANKIT SHARMA , who is been murdered and dumped into drain!!!! WHAT A SHAME! SHOWING JUST ONE SIDE OF THE STORY! IS THIS THE REAL SECULARISM ????? SHAME ON THIS KIND OF SECULARISM 👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "amitmishra2890": "I wish swara Bhaskar waha hoti ....bahut sare log aapke intezar me the...", "getiksi18": "S-whora keep your ugly mouth shut", "spuggy10": "First you catalyze the riots and poison the minds of thousands online... Then you say you're ashamed of it??", "_bjpbhakt_": "Sali liberals sharam kr Sali chinaal😂", "kunal_8615": "Or indangaii ko eese bhe buraa marna cheye n u also support the dangaa.. Toh trko bhe marna cheye ...", "ashish_6_4_9_7": "@reallyswara -Ye photo dikha kr Muslim community ko bhdkane ki koshish kr rhi h..Jo ek police vala in dango me saheed ho gya uski photo post ni kri gyi tujhse or ek IB me job krne wale ladke ko itni buri trh chaku se 4 ghnte tk mara gya uski post ni ki gyi but ek Muslim ka sir phta hua Kya dekh Lia insaniyat jag gyi Tere andar #SHAME ON YOU..🤬😡🖕🖕🖕", "2462joe": "Har har modi", "__nidhii_": "Oh god your career is going nowhere😂", "sumit397": "ye pic to whi h na jisme ye aag lgaate pkd lia gya tha. have some shame", "ankurgautam": "Oh yes she is the same lady who incited everyone ki bahar aao virodh karo and now when people have got murdered she is showing sympathy on social media #bitchplease", "sai_d_mafia": "plz post now whn hindu houses are burnt too", "mightymanish18": "Randi aurat hai saali sirf bakchodi pel rahi hai Madarchod aurat , kon bola isko share karne bina matlab ka hatred faila rhe hai #randi", "vivekyadav9876": "Chutiya aurat", "chintav1107": "If you have guts, say something about the IB office who got stabbed 400 time for 5 hours. Say something about the guy who shot a police man. Say something about people throwing acid on CRPF javan. You are a bias personality. Be real you dumb person. Be Indian and support each and everyone and not just small group of people to get famous. By doing this its all over for you lol.", "deepesh_rajpurohit": "Kuch sharam Nam ki shij h ya nahi tereme 😡", "the_rudra_bhardwaj": "We all Indians shame on you..", "thenameissurbhi": "SHAME ON YOUUU! You could have posted other pictures too of respected Ratan Lal sir , Amit Sharma sir and many more who died !! But No! You are fukn biased!! !! Shame on you!!", "n0tori0us_0ne": "Mat karo delhi ko provoke, mat karo is desh ko air mat jalao, pehle hi hindu-muslim ki aag me adha desh jal gya, hindu-muslim se kuch nhi hoga bas log marte hi rhenge aur ye aag kabhi khatam nhi hogi, sab rakh ho jayega, na India hindu ka rhega aur na hi muslim ka", "ikaran_94": "Why aren't u sharing what happened with IB officer Ankit Sharma. What ur beloved protestors did with him? And the planning n preparations done by AAP politician on terrace of his house. Come on. Chand paiso K liye itna bhi bikau mat ho jao. B neutral not biased u bitch. U r the person that protestors are fake news are spread out off. Chutiya kahi ki. Bikau aurat.. 😠. Shame on u. Aur shukar manao ki modi ki rehem se bahar ghum rahi ho. Warna tujh jaisi ki aukaat to jail me zadu pocha laganewali ki hai.", "sanjeev3296kumar": "Iski foto mil gayi isne daal di .. uska kya jisko 400 bar knife se mara gaya IB m kaam krne Wala ladka... Constable ratan lal... Dead bodies jo naale m se mil rahi hai... In jaise actresses ko famous hum logo ne hi banaya hai afsos hai is baat ka...", "archanamishra9250": "You just get out of this place", "secretsig_xo": "Chutiya aurat sharam karo paiso k liye desh ko bech dogi kya @reallyswara", "divyaaxax_23": "We are ashamed of you! Dumbfucks be spitting lies and adds fuel to the fire! Those butchers won't fit in your narratives! #shameonyou", "misra6556": "BC salli mar rahe hai Hindus aur fir bhi ye harami ki bacchi Hindu o ko hi blame Kar rahi hai....kya yahi tum logo ki secularism", "harshitrajput_": "Ek debate to tumse hoti nahi jo bache krlete h 6th class k or post krlawo faltu chize .", "arvind_singh_0": "Nice 😄", "arwinarora": "Raatko neend kaise ati hai tujhe, ya bas mastu*** hi karti reheti hai...", "kundanpradhan1220": "Logo ka brainwash karke shanti ki appeal karne wale murkh ladki. Hindu Muslim karke tum jese logo ne atanka faila ke rakhe Ho. Shame", "hindustan_zindabaad_indian": "To marja randi", "yeah_boy19": "Ratan lal ko goli mar di wo pic bhi upload krna kyu fatt gyi.. Hindustan me reh ke hindustan ki bezzati krti h sharam to aati nhi hogi but tere ghr se koe hota na police me Or wo mar jata to mujhe khushi hoti..", "mr.rajput007": "Kitna paisa mil rha h re desh ko badnam krne ka??", "singh.kamal.ks": "Ye vo hai Jo issi desh ka namak khake issi desh ko todna chahti hai", "shishodiaavantika": "Ye aadmi bomb fodne gya tha toh log aarti toh ni utarenge ..........", "dinesh_joshi_27": "Yeh Teri hi kartoot hai or bhadka janta ko tu to jail jayegi... or iti fake mt bnnn", "imshubham__raj": "To mam zara aa jao delhi m help kro, app jaise log post to bht krte ho lkin effort zero hota h apka , so please app jaise to rhne hi do", "kartik_r_katyan": "@bot_police", "_____samyak_____": "Police aur IB ke bandon ko maar diye tab kahan thi tu", "abhinav_singh8005": "TM Randi ho mussmmalna ka lo muh mein", "shafee_a_g": "😥😥", "sheetalsrv": "@reallyswara y r u living in India? How much money you get for spreading hatred. But I have sympathy for you. When you don’t get work, then you can lick anything to any extend....keep doing your licking job. All the best.", "record.killers10": "o bhai.. 🤣🤣🤣", "___aditya18___": "Didi tum bs tumke lagao world ghumo yeh sb gyan mt pelo", "_saini_here_": "Tu kalank h hindustan k upr @reallyswara thoda or tere ma bap ne padhaya hota kas...Or ye jo ek ankh se dekhne ki bimari h use thik kro#bollywoodnachniye", "swapnajit__das": "Tu hi hai jo isko karwaya hai.. tere jese log ye sab kar rahe hai @reallyswara", "__shubhamrathore__": "dear Swara, Spread legs not hate!", "old_school_integrated": "You are a piece of shit. Why the hell are you spreading hatredness. Few days back you were talking about NRC in Assam. Who told you that we people of Assam doesn't want NRC. And CAA in Assam has a total different agenda then rest of India. We the people of Assam doesn't want any illegal migrants irrespective of their religion, caste , creed etc etc. Get that right into your head.", "shefali.kiran.bhardwaj": "@reallyswara. Arrest toh esa kro.. Shame on you for all this itni interesting ho politics may aane k liya", "prxjj__13": "Areey ab hum dikhai kya photos😠?", "ajayp217": "Kaisi madarchod ldki hai ye kitni beziti krwati hai aise me bhi ye sab wah kutiya ki bchchi wah", "arushmrup": "And you should ashamed of your self", "anon1ndia": "👏👏👏", "viral__ahir": "MC tuje Hamare Police Shree Ratanlal Ji Nahi dikhe Ankit Sharma Nahi dikhe Hamare Army Jawan Jin par Tejab feka Gaya vo Nahi dikha School jalaye Gaye vo Nahi dikha ..BSdki", "bhogidhari": "Kash Iska Jagah Ye Khud Hota", "justf0502": "Aye chutya @reallyswara ye Rohingya immigrant h", "itznishant.sharma": "500 se toh jyada hi mil raha hoga tujhe inti overacting ka", "starboyqqq": "abbb e madharrrccc hoddddd", "sagar_6543": "We are aslo shame on Uuuu....", "vinesh__kattar_hindu": "Jameer to bech chuki ho aapna. Aage aage proof deti jao ki mai 2 kodi se bhi niche wali aukat deserve karti hun.", "vipul_raj19": "Han behen ki lavdi isme bhi religion dekh tu... musalman ka dukh jitna h utna hindu ka bhi h...lekin nhi tumhe hindu ko badnam krna h...movies se pesa toh kamaya nhi gya..paid stories or posts se limelight or pesa kamao bs....is dange ke liye jitna zimmedar BJP,AAP,AIMIM or congress h utna hi tumhare jese gandu liberals bhi jo Shaheen bagh se 3 mahino tk shayrio m logo ko uksaya...karbala ki kasame khayi gyi...sabash yeh h inka secularism.....itne logo ko marwane ke baad bhi mann na bhara hoga tumhara toh ab defame n blame games start ho gya h tumhara....fuck you...", "mayank1129": "NRC phele ispe he lagao", "i_am_ankuryadav": "#boycutswara", "ig_muskan_": "Ye pagal aurat h bas ek taraf Ka photo post karri ye sab plan tha pehle se hi trump aane ke baad hi sab Karna tha taki desh ki image kharab ho international level pe ye sab karne walon ko desh se nikalo Jo desh me Jana chahte ho jao udhar hi Yaha pe kyu kharabi karre ho", "vaishalivishwkarma23": "And what about Ankit sharma or bhi begunah unka kya kasoor the @reallyswara or ye toh inhi logo ki lgai aag hai ...CAA PROTEST jo kanoon aaya nhi or jisse kisi indian ka koi tallukh nhi uske liye delhi ko phukh diya ...shame on them ... Ye kehte hai ke ye desh humara bhi hai 👏 apne hi desh me dhange kar rhe hai", "akki_pai_5228": "Aarey randi aaurat.... tu pakistan nikal na re🖕🚩", "adwait8149": "Then don't fuckin try to escalate the situation through your insensitive insensible talks", "amaanansari1335": "RSS atankwadi", "abhinav_dalal": "LETS REPORT HER ACCOUNT", "c_y_a_s_h.__": "Not us, we are ashamed of you", "jayantsverma": "swara bhaskr tum real m ek anpd ort ho....jo khud juthe visvas m jeeti h ki vo ye sb kr cool lg rhi h..... Sch m tuj jesi ort ki desh ko koi jrurt nhi h..... Tu shant beth na phle fr log ho jayega....juth fela rhi h.... Logo ko bhdkarhi h..... Tu to bus post kr deti h pese leke.... Tu khud aa na medan me.... Tu help kr aakr..... Tu khana khila ghaylo ko.....tu ilaj kr..... Bus sare din bkwas krti h..... Tu kyu bejjati kra k aa ti h roj....pta tuje kuj h ni", "thevarunvats": "Aab to jail mai jana padega jail ka Pani pina padega aab to jail mai jana padega🖕🖕🏻 ye to dekh leya tuna tujhe apna baap Ankit Sharma nhi dekha uske sath kya hua hai...", "bhagatsinghkhichi": "Yeh sab tumahara hi kiya hai pehle becharo ko darao ki tumhe nikal denge fir unhe majboor karo road pe aanke ke liye fir samne se log aate hai ab pakda jayga toh pitega hi chahe hindu bhid pakde ya Muslim dono main zeher toh tumne bhara hai.Ek party ke taraf itna hate aur kitna giroge", "jagajyoti_biswas": "Rendi hai tu sali..... Kis mulle se chudwaya hai teri maa ne sali pakistani", "_deepakgour": "देशद्रोही ही देशद्रोही का समर्थन करता है (i support caa)", "rajputajaysingh333": "Kutiya", "____ishika_____": "Shame on u 🙃", "gaurav.kaushik909": "💩💩💩💩💩💩💩💩💩💩💩💩💩", "abhishek.chaudharyy": "You must be ashamed on yourself not a big deal coz you're spreading nothing but only hatred 😔", "_a.d.i.t.y.a_r.a.z_": "U deserved to be there..... that's ur seeded fruits swara 😠.....", "aneesha_samant": "Ankit sharma ki photo nahi mili teko sadakchhap aurat..", "adarshsuryavanshi_": "Tujhe Ankit sharma & Ratan lal nhi dekha kya @reallyswara 😡😡", "i_am_aniketchile": "Aur jab kisi hindu ke sath hota hai tab tumhari gand nhi jalti hai kya", "hejhejmonikahejpodigmonika": "#SWARABHASKARTERRORIST #ARRESTSWARABHASKAR", "atul.vaidya.5245": "Shahrukh ke upar post kardo 😡😡😡😡. Tumhare dost ne goli chalai hai police par.", "sanjay__inani": "@reallyswara Madam Apke mere ek Mutual Frnd nhi h Mtlb Aap Tik toker se b Niche Hai Bhgwan Apko Followers de Thode Bad me krna ye bakchodi😂😂😂😂", "__light__y": "F", "theyashsinghvi": "Just see the other side too you bithc", "ajinkya_242": "Post that ib officer ( Hindu) murdered by Muslims that also", "abhishrma1997": "You should ashamed pf yourself", "thehindu_community": "So go to Pakistan where you can feel proud🙌", "binnu_____": "Indian army ko patthar marte hai tab Nahi hoti app ashamed Didi 😏 shame on you 🤬", "rahulsinha_94": "Bhag teri maa ki choot...", "chandrima_tina_97": "Ha Tu bass post krti reh idiot", "saurabh_kr_24": "Tmhe ankit sharma nhi dikha re pagal aurat @reallyswara", "_____a.v.k.nambiar__": "Agar yanha k ho tho darr kaisa... Agar chori chuppe aaye ho tho Ghar kaisa ...", "uday_emo_03": "@reallyswara ye Kya Teri maa ki porn movie he..Jo can't see likha aa raha he...", "siddhu_lnr": "Sahi kiya Terrorist k sath.😊", "the._punisherrrr": "Teri maa ki chut mare suar @reallyswara", "harshitsharma_108": "@reallyswara Kuchh sharam Karo U r also responsible for Delhi riots. U supported tukde tukde gang and also that drama which is going in Shaheen Bagh. #delhiriots #supportcaa", "seekin4tru1luv": "U should better be ashamed of ueself. Infact we the hindus and even ur parents must be ashamed of u. This land #bharti is ashamed of ppl like u. I must suggest u ungli aunty \"please tum sab log ya fir hindustan se chale jao ya fir plz plz plz doob kar mar jaao\"", "akshita.rathore119": "Bhen ki lodi terko sirf yahi log dikhte hai kya", "iamamanjatav": "Aise hi maa chodi jayegi bhen ke lwdo ki😂", "parasmahajan6883": "M from jammu... Aap chronology kam smjaye.. 4 August se hmare yahan emergency k halat hai... Aur aap.. Shaheen bagh mei jake bhashan de rahi hai. Agar deshbhakti ka shaunk Hai toh yahan aaye. Kashmir jaye. Amit shah and Modi k wajah se aap abhi tak safe ho.. 370 nrc caa Yeh sb aapke liye hi hai.. Hum sb ke liye hai.. Yeh sb mei English mei bhi bol skta tha.. Lakin hindustani hu rashtriya mera gaurav hai mera abhiman hai jai hind🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 @reallyswara #vandematram #shame on shaheen bagh @anuragkashyap10 tu bhi PD le bhai.. Tera hi desh hai", "aaditi2445": "Achha Hindu yaha jaada mare unki pic kha h kuttiiiii", "faster6999vikrant": "Did she even bother to post about the killings of the IB officer and the Delhi police head constable? Stone pelters and cop killers aren't protestors.", "vijaypatel3992": "स्वरा भास्कर उनके बाप की ओलाद है ये भी सबूत नही है उनके पास", "wondersoul1999": "P", "_beingkajal_": "you've posted only this alot of things happened in Delhi , a mother lost his son , a cop died due to stone pelting, a boy who was an ib officer killed by Tahir Hussain , you'll not gonna post about that ,. SHAME ON YOU @reallyswara", "marshallharsh": "Jai Shri ram !!!!", "_theneelgokhale_": "Acha ek baat batao @reallyswara CAA ka draft padhe ho? \"Are muzsey kahe puch rahe ho, sarkar se pucho\" yeh answer toh dena hi mat😂", "originalprateek": "You must celebrate.. you are quite much responsible for painting Dilli red.. ghosts of the dead shall haunt u..do let them know that u were simply being a leftist...@reallyswara", "ankit.kalia_.__": "It is bcoz of u idiot lady tune bhadykaaya logon ko haraamkhor", "yogendra_14": "Wo Goli chala raha tha uska bhi photo post karo 😊", "eldiablo.joker": "I request you all to report this Swara bhaskar for spreading hate amongst 2 peaceful communities..", "im_nilesh_gayari": "Bhadvi. ....Randi saali ... Tera baap kon h vo bhi pta nhi hoga tuje", "memesbabakijai": "Terrorists ki voice swara bhaskar🤦", "sachin__si": "Randi ho tum madharchod. Tumhari jaisi randiyon ki wajah se delhi jal rha hai. Tumhari behn sab chud jayengi dekhna randi", "hershey_g_": "Post the pic of terrorist shah rukh shooting publicly with a gun. Post the pic of how islamic terrorists burnt hindu homes and shops. Post the pic of the hindu teenager who had a high speed drill drilled into his temple area of the hedm you won't because you're a sickular little bitch @reallyswara fuck you bitch. Thank God I'm a woke hindu and not like you, fucking libtard", "hardiksharma.1810": "Ankit sharma k bare m btao", "thedreamygirl_16": "Achchha ise mara toh shame aur POLICE shahid hua to kuch nahi...#ashamedofyouswarabhaskar...#youarenotIndian", "natural.ladka": "https://www.instagram.com/p/B9EJLzlgmd_/?igshid=1djz9hk3awsca", "_.peekay": "An ib officer has recently been killed BRUTALLY , expect karu ki tu wo post karegi behench*d traitor?", "seejalpandit": "Rubika bhulgyi ?", "lk_lokesh_lk": "Nahi dalege bhai hijdi Sena he", "faseel.hussain": "Kuch log ek constable ke marne pe ro rahe hain un chutiiyon ko bata doon kayii protestors bhi marey hai unke baare mein kya bologe!? Tab police peeche theher ke dekh rahi thi tab unke saamne se koi revolver se goli chalata hai uske baare mein kya kahoge!? Masjid ko jo toda gaya woh bhi protestors thay kya, kuch log ne toh khud yeh comment kiya hai ke hindu rashtra banayenge!! Tumhare maqsat hume ache se pata hai so swara ji ko bura mat boliye pehle unke level tak jaayiye. Everybody has the right and freedom to speak tum kon hote ho usko bura bolne ke liye!? Aur haan kahin kone ki naali mein pade reh kar yeh comment na karein pehle uske level tak aayein phir baat karein ..", "know_sow": "I'm ashamed of you! 💩", "deepshi0531": "You should be ashamed of yourself calling yourself a citizen of this country and being blind to what’s happening", "priydarshinichauhan": "Tu to kewal muslims ko hi dikahygi h na. Police constable bh death hua h uski pic hi kr deti share. U cheap hate u hate u hate u. Thoooo h tum p", "simba_thehandsomecat": "She is an ISI agent 😂", "lainjack_68": "15 year ki laudi", "sensible_people9111": "Are ye to vo hi he na... jo har jagah ungli karti rehti he... 🍌🖕🏻", "hector_el_fathar": "Is this failed actress lost all her respect. There are police officers killed, acid poured on army men, ankit was dragged and killed, one boy had been drilled with drill machine. But she is showing only one face which leads to more violence @delhipoliceofficial please arrest her. She is spreading hate and violence. #arrestswarabhasker", "sun_shine.____": "Arrest her @delhipoliceofficial she is terrorist", "ashrut.singh.98": "अंकित शर्मा जी के लिए भी कुछ कह देती मैम 😣", "anmol_5_": "Tahir Toh Masoom h n😊😊", "_itz_banna_": "What about IB officer killed by terrorists #ripankitsharma", "ravi.k_": "I have lots of videos of delhi riots by muslims, can I send you sweet heart, can you post it. BC", "khuranajatin97": "@reallyswara Shame on you Ms. This picture itself showing you areone sided, did you heard about an innocent Constable Policemen and IB Officer who were killed in this peaceful protest by Muslims.You are just protesting against NRC,CAA and these people only trying to make drastic situation in Delhi. After a good speech given by you Madam at Shaheen bagh, now please make a round at Chandbagh,Seelampur, Jaffrabad and many more,see what happend there. Thank you. {Please don't Discriminate}", "i_m_aagu": "Agreed he was innocent. But why did you start this fight? Your Minister Said 15 Crore Muslims would kick 100 crore Hindus ass. Now getting your ass kicked you guys want Sympathy?", "crazy_sujeet": "Delhi me IB officer & constable ko mar dala mullo ne.... Unki v pics dikhao jihad ki paidais bacchi..", "uday0809": "Bhadvi sirf muslim muslim karti hai, why don't u convert in Islam. Hindu maare gaye randi ko dikha nahi , gawar kahi ki ek question rubika ne pucha answer aaya nahi", "swarapatell": "And I am ashamed of sharing my name with someone so dumb like you🤬", "thakurarun1991": "Apni maa chudwane nikle the yeh azadi lene", "tarishi0602": "Chup sheikh ki randi.. 🤬🤬", "patil.abhi_abhishek_": "Tere maa ki chut swara bhasker . Rand , chinal, bhosdike , le mera mu me bhot bada land hai . Agar age se tu CAA aur nrc ka virod kiya rand to teri gand me bina condom ki marunga . Maderchood kahti hai india ka lund muh me lete pakistan ka . Tere ball kat dalunga me @reallyswara", "pandeysatyam353": "aata jata kuch niii", "anandwaibhav": "Tujhe ib officer ka ya ratan Lal ka pic nhi Mila kutiya..", "malik__27": "Aur hum tere pe #swarafakebhaskar", "gauravjoshi19": "Propaganda by so called liberals- what do you want lady ?? Can you show the incident in it’s entirety? Please stop making these stupid claims and shut the fuck up. Go and do your stupid roles #fuckingirrelevant", "iamakhilbhardwaj": "@reallyswara well done see how's your fake idealogy comes up", "akansh.aulakh": "Kutiya h tu bosdiki", "mj_monty9797": "I stand with CAA 😂", "navya.vt": "Ye saali ko yehi dikhta hai mc saali", "singhsourabh231": "In chutiyao ko kuch smj ni aata bs photo dalne se matlab hai bc ko", "an_aaravsen": "u will feel proud shahrukh", "yuvrajsingh_9999": "@reallyswara tum saali randi ki randi hi rahogi😂", "fairytale256": "Mam, stop focusing on these things just let them do whatever they want cz this backward people will be never change,,and even their backward thought will become same as now bcz India is a Hindu ruling country and u already know that how Hindu people are backward in every field..", "mahesh_1392": "Tere jaise hi same to same acting kar rahe dekhlo kuch sikhlo tmse tho nai hua acting karna...tu piece of shit ppl like you to India...I pray u die soon....", "punisher.4321": "There's a video where a girls burnt undergarment from from tahir hussains building later her dead body was found from that drain where ankit body was found we can understand how hindus are suffering there's girls are suffering and these ladens wife showing some fake video and crying", "gormor_gorl": "Don’t say US please", "karmakarbikash": "Tereko Sab kuch pata hai kia ?", "kanarese_king": "Yeah, you should be ashamed of yourself @reallyswara", "gurneetsinghoberoi": "We are ashamed of you . People like you are more scary than terrorists", "mistryarun": "@reallyswara shame on you that if you are right you dont want to read the draft.....but the truth you even you know if you read the draft you are wrong and might fall into legal matters for misleading people and disturbing peace in nation", "_pitjjha_": "Then why don’t you go do shit with them..god swara you’re lucky that you are a hindu warna unke mashab ki hokar unko ase bolti toh fatwe nikaalte.. aur ankit ke baare mein toh aankein band karli hogi tumne", "hrs__singhal": "Rohingya muslim nikla yoo....ankit sharma ki to photo na daali gayu tere pe", "_rahul_sindha_": "@reallyswara shuruvat unhone ki thi. Hum bhi chudiya pehnke nai bethe he . Pathhar fekne ki shurvat unho ne ki sabke gharo me tod fod ki Mara . Tu to kalank he 🌚🌚🌚", "ahirvishvaraj": "Hahahaha maro salle ko pathar phekne kisne bola tha mc ko", "mean_monster9": "Hope some day you would also post pic of one member of peaceful community throwing petrol bomb and stones on Hindu", "snaya_thakur": "Pic rong dala h saram nhi h tujhe tujh jaisi ki wjh se log galat dekhte our sunte h", "mistress_with_makeup030": "Isko ye post kiya jaa raha h but she is unable to open her gutter mouth for Ankit Sharma murder case.......wow RIP to activist fake Swara Bhaskar", "yashjoshi777": "Are koi rubika liaqat ko bulao wo isko @reallyswara batayegi photo kaha ki h😂", "jinendrasen": "Nikal phli fursat me nikal lawdi", "hell_oanab": "Aise he maa chudegi jo danga krenge abhi toh police busy thi trump ke aane ki wajah se tabhi plan kiya inhone danga.....ab krke dikhaye inki maa ki choot mei luth bajenge phir inki 7 pushte yaad rkhengi", "tejas_mirashi": "Why are you posting a picture where onlya Muslim brother is beaten and spreading hatredness ?", "prince28395": "Hum bhi pele gye the tum bhi pele jaoge", "00shunya0": "Pattase head shot😂", "its_ab_bhadka70": "Ran**di", "s_a_t_h_y_a_97": "🤣🤣🤣", "rushabhkulkarni99": "U are a piece of shit .. #democracy #freedomofspeech ... We are also ashamed of you 🖕🖕🖕🖕", "sheriseslikeapheonix": "Yr kitni zyda hippocrate aurat h ye", "viploveagarwal": "Nikal kutiya kuch bta hai neta banne ki koshish mat kr filmo mein mast****** kr bsss wohi hai tera kaam", "inexormost": "Rattlesnake🔥", "_shagunsharma__": "Post a picture of ankit sharma now !", "gaurav_abhi1": "Tere ko yahi dikhega bas , Rubina ko to jawab nahi de paayi aur yaha gyan de rahi hai 😡", "nikhil._.pundir": "Don't spread fake message okay", "shubham_bhambri22": "Kyu bhosdiki jo tahir ke ghar se hathiyar , chemicals ,acid aur lashein baramad hui hai uske baare me to teri awaz bhi ni nikli waris pathan ke baare me to kuch bhi ni boli owaisi to kabhi hate speech deta hi nhi shame on u so called activists", "shreejalmallik": "Chutiya aurat... Har post mai tatti hi karti hai tu...... @reallyswara", "shivaangi.thakur": "I’ll never see you post a picture of a Hindu beaten up in these riots, I’ll never see you post anything about Shahrukh. You’re a fucking hypocrite, Swara. That’s what you fucking are.", "deb_tagore": "We are ashamed of you. Just misguiding the crowd. You are just a pathetic and illiterate person.", "vijaysandaraj7": "She is the bitch of Dukar Ibrahim and Pakistan she hates india indian army india peaples hindus police she is a bitch of Pakistan she is getting money from dukar Ibrahim our ankit sharma killed by Bhadwa tahir hussain and 100 200 Pigs but this pig is blamming to kapil sharma shamless bitch she don't have any emitions by seeing the mother of ankit sharma crying and and saying tahir hussain and his peaple killed suwara 🐖 Bhaskasuri 👹 u are enemie of innocents and india u bitch", "kamini__singh": "Dogli dalli😑", "s_w_a_p_n_i_l": "Tere baap Shahrukh ke bare me kuch ni boelgi bhenchod?", "quotes._universe": "Why u always spread hatred .. always giving communal colour to incidents ...ab toh Marne walo ka b dharm dhund liya", "vartitsivastava": "Bhen ki laudi #SUAR_A", "_divakar_": "15 saal ki bacchi esa post nahi krte...", "san_deep_fit": "chachi 420 😂😂", "abhishek007rider": "Ap bahot badi chutiya.. badd dimag.. aur akal se puri trh se paidal hai.. maaf nhi kijiyega hme.. lekin ap bahot chottin kism ki aurat hai.. barkha dutt ki choti behn 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "akhand_bharat1": "Or bhi photos h inko Kyu nhi post Kiya wo Tere ajende pr fit nhi hote isliye are sharam KR swara sirf publicity pane k liye kitna giregi", "manav.9999": "randi @reallyswara teri wajah se to ye ho rha h sab", "bad_meets_evill": "😢😢😢😢😢😢😢😢😢😢", "neilprakash81": "You are one of the biggest reasons why ppl are suffering in Delhi. Shame on you. All you do is put up fake posts. Makes me wonder, for how much did you sell your soul to \"ola\" ?!", "preeti_ramola": "You should be ashamed of yourself.. dont mislead people.. begunaah log jinki jaan gayi i DP head constable, IB head constable unka picture bhi share kerti.. shameless lady sirf apne faydey ke lie jeeti hai", "_._.neeraj": "Nikal maadrvhod chutiya aurat", "bjkjff235_k": "Just so you know you are equally responsible for spreading misinformation , the genocide of 20 fucking Hindus is on you", "respectdogetomilegi": "I am ashamed of u ... madalchod ...u r randi ki bachii ek hi side ka dikh rha hai kashmiri pandits ke sath kyaa huaa tha pta nhi hai kyaa ...........tere aaba k sath sone wali sali .....chup ek hi dikhta hai ye log kya kya bol rhe hai hindu k sath kaya kya kr rhe hai amit Sharma k sath kyaa huaa mar dala unako unake bare me nhi bolegi na kyu ye log aayenege nhi tere sath .......maje nhi denge na tereko ...Hattt shame on u", "littlemisslama": "Oh good lord she should be arrested", "sumit.4863": "Swara thume ek side dekhne ki aadat ho gayi hain", "pavi0909": "peaceful religion is the rezn behind the terrorism", "poojaparmar1264": "In protest ki aad me IB Officer ko Mar dala... Behen wo bhi keh deti....", "hemant718": "Himmat hai to", "abhigyansingh16": "He is an illegal Bangladeshi muslim and was throwing stones on police and public... Atleast post something that is relevant and not fake. Shame on celebs like you!", "sujitsingh90": "U bitch .....u won't post anything for the constable who died .....u will not post anything for IB office who was stabbed to death.....U filthy women", "hitesh_sharma.1474": "Ru pura story dekh lowdi", "suyash074": "Is AURAT KA ARTHIK BAHISHKAR KARO GAWAR AURAT ADI AKKAL KI DESHVIRODHU", "sauravsamaddarsrv": "Because of people like you and all political parties, these people's are fighting on roads. Provoking people's to fight on road", "manabdas626": "🤣🤣🤣🤣🤣", "lamdeepakrajput999": "Swara why don't u go and protect them.khdi hoja udhr jake", "__praharsha": "Now imagine how the kashmiri pandits felt when the same thing, sorry worse shit was being done to them, the Islamic terrorists are being punished for the karma they have done🇮🇳🇮🇳🇮🇳 JAI SHREE RAM 🙏", "iamashu7727": "तू इन्ही जैसो का लौड़ा चूस कर बॉलीवुड में आई है", "chinmay__deshmukh": "Shame on you, not on us. @reallyswara", "shivaankargupta04": "Shame on ur double standards", "its_chronology_": "Ye photo to dikh gya tuje ... Beshram aurat... Mara gya hindu hai .. wo nhi dikha ... Islam apna le tu ... Teri aukad nhi sanatana Dharma me rhene ki", "vaishnabi_singh": "@swara you are so shit swara..u didn't see the man with gun shahrukh.. infront of police..this happens only in our country bcs of u all are doing such a shitty politics 😠 swara 💩🖕🖕🖕🖕", "dishii07": "Why it’s happening in India 🇮🇳 if you are citizen of India then why are you so scared, specially Muslim? It’s because the leader of Muslims are spreading fake news regarding CAA & also spreading hate-monger. To all the Muslims of India you are safe nothing will happen to you all. Before being Muslim you are Indian, so trust India and it’s Govt. Don’t be victimised of your imagination.", "anujvashisthmba": "Kutti hai tu saali", "aakifahrahman774": "Mughalai Randi ja bolo tumhare Muslim bhaiyonko!", "tushar_tala": "Tu Pakistan chali ja tare ko Jo chahiye vo milega. It's new India......", "richie.rich009": "Jo bina baat ke gunda giri kare woh apradhi hai, @reallyswara your IQ level '0' hai... Alia se bhi gaya guzara", "hardik_pavra": "to kya polise goli khaye", "sujit.shindolkar": "Mill gayi azadi 😂", "dnyaneshlakhmal": "One side one side yeaa bollywood waale showing only one side.. Patthar vaaloo ki photo daaloo kabi didi.. Q vo nahi daaloo gi aap..", "sayedmuzammil1210": "10 log milke ek aadmi ko maarte aur apne aap ko mard Bolte, bahot galat baat.", "abhii_chef": "#boycottswarabhaskar", "shubham_verma2607": "mathorchod kam nhi mil rha tujhe nalli", "uv_raj_singh_meena": "Yeh vahi log hai jinhone protest Kia Against the CAA and NRC . Or NRC toh kahi aaya hi nahi hai abhi . Apne yeh Photo toh post kardi kyonki special Media PE #viral post hai yeh mam . पर उस दिल्ली पुलिस (#delhipolice ) के हेड कांस्टेबल की #post नहीं डाली जो की शहीद हों गए उन्ही so called protesters के हाथों। तुम सिर्फ एक #socialmedia creep हो जिसे सिर्फ़ #negativity create करनी हैं। Please don't do this . please Mam ☹️", "kartikkuppuswamy": "I am not ashamed when Islamic terrorist are given what they deserve. I am ashamed that fools like you are the so called celebrities.", "iam_anmolsandhu": "Swara you are responsible for this not the goverment.", "itssimmijain": "Hahahah y don't you post about Vivek who got drilled in his head by ur peaceful protestors😂shame on you shame on ur birth🙌", "vishal9335": "Bas yahi hoga .... aur IB officer ki body ni dikhi ... ankit ki body ni dikhi", "harkirpal_singh": "You weren't ashamed when police officers were killed.", "pranavsaksena": "So what you thought while spreading your dumb knowledge on CAA in Shaheen bagh, that they will spread love. #Thisiswhatyourare Bloody whore", "amarsinghkushwaha_official": "Are @reallyswara ranD ko sharam bhi aati hai😂", "abdulrazak8393": "😢", "_rakesh_8191": "Are randi kahin ki", "beyond_the_dusk": "I wish I could post pictures too in comment section, how our jawaaans have lost their lives but you won’t count him, you know why ? You’ve to save your ass, play victim card and most importantly your corrupt mindset is gradually being highlighted, You’re just a pretentious doll @reallyswara I feel not angry just bad, extremely sad that you’ve become so ungrateful towards the nation that has provided you so much of name, fame and money. Look at the kid and the widow, you might observe the dark side of the story where people have lost so much than you chilling inside your apartment.", "rayriderrr": "Khopdi tod sale ka😂", "vinit_vb": "Why not a post for Ankit who lost his life? @reallyswara you post just because you are paid by them.. India is ashamed of you, you play politics in everything.. Concentrate on ur movies they'll more hit rather than being a flop.. Idiot", "______ajit_______": "Madam agar aap me ithna talent or desh se ithna hi pyar hai toh civil services ki exam q nahi pass karte aap 🙌🏻🙌🏻", "_itskeshavsharma_": "Bahut sahi Kia in logo ne jo Kia wo nahi dikha kya @reallyswara can't you see inka peaceful protest kitna peaceful tha.sirf faltu ki baatein karke logo Ko bhadkao yahi to aata hai tum log Ko aur kya karoge.", "lijad_": "Your parents should be ashamed of you. And I don't doubt they would be ashamed of themselves", "amitbhanot.jsr": "U must be ashamed of u. I guys support protestrs & thts y dis is happening", "junkhn": "Saddened to see", "faisalkhan_9322": "Laudu ujaari 😂😂😂 Aasaram k chele bhosdk nallo bhadwo 😂😂😂😂😂😂😂😂😂😂😂", "drshikaa_gupta": "Good job #delhipolice 🙏❤️", "zzjio8668": "😢😢", "ujwall_15": "#shameonswarabhaskar for showing such violent content without having a pea of knowledge", "mommahmiah": "No post on dead cop yet ?", "_iamhimanshubisht_": "Ek din aapki Soch ke sath Bhi ye he hoga @reallyswara aap Bhi antinational leading persons me se he Ek hai any way.! Raise your standards lady. Publicity ke liye anti national mat ho jaeye. Thought Lots of people don’t like you but phley se Bhi But aeisey baaten bolkar stop spreading bullshit all around 😊", "abhimanyusingh595": "Fake picture", "_kunal._thakur": "Bc bass afawa udati rah", "yash___jangid": "🤣🤣🤣🤣🤣🤣👌👏👏👏", "mohdimran2859": "😢😢😢😢😢😢", "akash.dakhore": "Jab police vala ko mar dala tb kyo nhi post kiya apne mam kuch", "iakshaybajaj": "Shame on you", "rajsolanki_18": "Sasta nasha babu bhaiya😀@reallyswara", "sam.kaintura": "Hai swara bhakara", "rachinh.thakur18": "Maaro inko aur Maaro cop Ko marte hai ... Desh ka nukshaan karte hai", "rabizzz_ban": "All credit goes to you shit", "_aaaashish_": "Abhi sirf yehi pic dikha kutiyan tereko?? SRF ek side ki story?", "rachitttttttttttt": "When JNU was attacked She Called an emergency call alright. But So many Hindus are brutally killed Not a single Post Story For Hindu....But it's necessary that to post Minority caste's Picture.... I just want to say That GOD is watching!!", "be_bakchodian": "I ask you why haven't u posted picture of the Delhi policeman who died? Shame on you girl", "gayatrivohra": "Yes...you definitely should be ashamed of instigating people", "liveyoung213": "Tu to ashamed k layak hi hai", "jyotikavaradkar": "U shud ashamed of urself.. spreading wrong information. Bhai jo baccha paida he nahi hua uska mundan krne chali hai#NRC .. just coz of people like uh we are facing lots of problem .. Jo NRC abhi draft nahi hua uske darawane section padhke ho gayi ye . When RUBIKA ji was giving her paper to read tabhi she said me relevant section padhke ho chuki bhai pura padh leti toh kam bezzati hoti aapki.. Do ur homework swara bhaskar.. U r feeling bad for those who are throwing stones on police who are doing their duty so why dnt uh hire them to protect urself tabhi tumko police kyu chahiye hoti hai. It's very easy ki car se utaro n naare lagwawo but it's very difficult jab samne koi gun rakhe tab apni duty krke dikhao..", "ansh_bhardwj": "Aur aapka Late Shree Ratan Lal k baare mai kya kehna hai.", "shadab.saifi.5832": "Is se jada kuch nahi ho sakta hai is sarkar ke liye... Or kitna girenge hamre ghar ke mantri", "ravisharma2.6": "Didi ko viney ki photo nhi mili jiske sur me drill machine ghusa di ....zinda aadmi me hi .... hospital me hai abhi wo jaakar dekh lo", "142nav": "iska account ban karo report kar kark😂😂😂", "ankitmehta85": "U should be after what u have done but don’t worie Ur cruel intensions will never prosper . Keep trying with all your might but you will always fail", "mr.p_jain": "Yaaaa just like we are ashamed of uu", "___tiger_0_0_7_": "Ye to tera customer he randi", "dhaval._.vsv": "Aree didi bahar jake dekho to shi kya ho ra he. . Or apko b #Azzadi chahiye to bahar jake nare laga do . . Police vale ready hi he aazadi dene k liye @reallyswara 😊", "atkare_payu": "Inko bola kisne protest krne ko ghr betho shnti se jb ap legally indian citizen ho there is no need of such protests and protesters.! Aur ye sbko badhka rhi bs", "avinauv": "आपके पास ड्राफ्ट है 😆", "srivastava.rashi.0414": "Yeh Sali Swara Padhi Likhi Gawar Hai Madarchod Ko Phle Marna Chiye", "cornagent": "😢😢", "mukesh_mishra15": "Shame on you, you just have single pic to show what about that policeman..", "maharashtra_explorer": "2minutes silence for @reallyswara followers 😂😂😂", "brandedgawar": "chutya sali policewala mar gaya uske liye rona nahi aya ?", "bisht_gaurav28": "We ashamed of you swara tum publicity k liye kuch bhi kar sakti ho desh tak baich dogi.", "yogi_artist_20": "Are bc randi sali... Shahid ratan lal nahi dikh re tujhe.... Pr ye mulle jinhone atankwad mcha rkha wo dikh re h bas.... Unke sath sath teri bhi gand todni chaiye... Bhadwi sali🖕🖕", "narrowmemorylanes": "Shame on you @reallyswara for spreading fake stories", "realvijaymishra": "YOU ARE RESPONSIBLE FOR THIS", "lowcasecool": "Swara you are dumbest creature", "vipul.singhrathore": "@reallyswara what about the constable who died 🤔no posts about him", "utdu20": "You wanted this, right? @reallyswara Anti CAA is a funded scam and you are part of that. You must be happy now!", "sagar__singh_rajput": "Accha maara behenchod ko😂", "laxmi_yadav143": "Ye toh inhe or inke supporters ko.....aatankwd failane se phle sochna tha.....action ka reaction..simple abhi toh kutoge..", "chinna.raju1": "What are you trying to spread?", "surender.singh.54922169": "Fake", "sharmaji_90": "Fake log fake post he krte hai", "abhineet12_03": "Loved it maa chodo saale ki 😍", "avyan_21": "Don't cross the limit, if you limit the cross then ypu have to pay for that", "khannoorasma": "Really so much upsetting. Yeh log muslims ko insan tak nahi samajh rahe hai. Yaha sab jo keh rahe hai caa or nrc ko galat bata rahe hai. Yeh bhakto yeh jaanlo sare educated youth yeh act k against hai. Par ye jahil bhakt.", "yaser.alhashimi": "😢", "tomar_4444": "Muslim Acid faik rhe hai Army par", "_md_noor_ansari": "😓😓😓", "im_rayyan_wahbi": "#shamedelhipolice #shamedindiangoverment 👎👎", "honeyagarwal1402": "This is all happing because of you peoples. You communists are man eaters.", "ayushiv05": "Oh, you should be ashamed of yourself first!🙃", "samar_verma69": "Ye sab Muslim atanki aur bampanthiyo ki sajish h", "shaikhjaved2030": "@realdonaldtrump", "its_nandini_nandu": "U must b ashamed of urself first 😂", "akashgolu123": "Tu madarchod Randi h", "shaykhism": "😖 Humanity died", "zohan_ali_jafri": "@jannat_hai_karbala_ @_.karbala_ @khamenei_ir @aljazeeraenglish @haditv1 @hussaini_media #usa🇺🇸 #iran🇮🇷 #saudiarabia #iraq #tiktok .....indian Muslim taget killing by Non muslim public and police force both and mosques demonstrating house burning people die others injured", "pandeankit7": "@reallyswara i am ashamed of your selective nature.", "mohitt_rana": "Ms faker good attempt", "nanoagarwal93": "This is happening cz of people like you who supports the wrong propaganda. U should definitely be ashamed of yourself.", "rahulrai_9": "🔥🔥🔥🔥🔥🔥", "rabab_khan_t13": "I respect you for all the efforts you put in to speak up against the unjust and the wrong doers. Swara Bhaskar you are one celebrity who is a true Indian at heart coz you care about every Indian irrespective of his race and religion. Thank you for showing your support❤️😘", "_het.shah": "अगर भारत में रहना है तो वंदेमातरम कहना है", "__shub_____": "Apka shahrukh b bhool brsa raha h udr b dyan dijiye mand bhudi jivi", "cutesamaira": "Dis wat polticle ruleing up", "luvjoshi": "Aur iss bhn ki lodi ko ye ni dikhta ki hindu bhi mare hain 1 police wala bhi ... Agar tum famous ho to iska matlab ye nhi ki har mudde m apni gand ghusao...", "the_religion_universe": "JIHADI SPOTTED #JIHADEXPOSED", "ajay.anshu": "Bhai isko koi Pakistan bhej do😂😂😂😂", "vanee6vi": "Wah ri wah. Hindu pite tab kuch nai, mulla pite to shame 🤣", "shoeb.04": "Haram k peele hai", "_akshaychudasama": "@reallyswara if ashamed of us than leave India don't misguide people", "pramod__choudhary_": "Randi", "pritam5158": "ये साली पूरी तरह से मुल्ले की पैदाइस है यदि ये हिन्दू कि पैदाईस होती तो हमारे देश के जवान शहीद हुए उनके बारे मे पोस्ट किया इसने", "im_crazy_ash": "Ranjhana me kuch ni kr pai to yha bkchodi faila rhi hai, tum logo ki vjah se log influence ho rhe hai, firing hui anti-caa person ki taraf se vo ni dilhayegi tu bus vo dikhana hai Jo Teri gnd bacha ske", "pratikdhimmar": "Pre and post visuals are also important", "parth_chaudhary_14": "Isko police vala mara vo nhi dikhai dega. #dogli_swara", "livsonawane": "😢", "pankaj.parikk": "🙁", "maniksadana": "You should be ashamed of publishing this why did not u publish when a police constable died", "s_u_p_e_r_j_a_y": "Sab iske account ko report karo bhai.", "waliarohini": "Mam show the picture of the cop and normal civilians dead too. Do you have sympathy for both religions or you only see Muslims", "taher_badshah": "#modiout", "lannisterr_": "Where is your post of a guy shooting on police in open? He killed one police-man. Aren't you ashamed of him?", "dil.bag.singh": "Very sad😢😢", "riteshkrishnapoddar950": "Dharm badal apna.dugali", "sufyan_005": "🥺🥺🥺 speechless", "naruhina2919sc": "@reallyswara MAM how come u r only ashamed when it comes to the Muslim minorities ..?..shame on u for being a biased citizen..SHIT person and even shittier actress...#no offence", "khan_ahamed135": "😞😞😞", "mohdmoazzamtkd": "Ye jo kuch darinde hamla kar rahe hain, ye saboot hai inke haiwaan hone ka!", "sar.apeksha": "Shame on you stupid lady... Bus kar bahut drama kar liya tumne aur kitna aag me ghee dalegi.... aur kitna jhoot failayegi", "sharmasonia007": "What happened to the shame while fingering! Sasta nasha karke shakal aur Akal dono gandi hain teri!", "ranjeet24_singh": "Shame on you, u r a contributor to all this", "mx.chx.ux_": "@markruffalo", "shafiabedin007": "😭", "naruka_ashok": "इस में ताकत है तो हिन्दू की फोटो शेयर करें सुरी तुझे पता है 9 हिंदू को मारा है तेरे शांति प्रिय ने", "rituktandon": "*CAA 😞 Citizenship Amendment Act ) How can you treat people differently based on their religion? We want equality* 🤔. *UCC (Uniform Civil Code)* : How can you treat everyone equally? We demand different rules for our religion. *Isn't this epitome of hypocrisy ?* 👍👌", "yudi__garg": "Ye to hoga hi or abhi ruko teri bhi maa chudegi bc... ab bol na bc delhi k bare me.... in made chodo ko to aise hi gand me danda daal kr pakistan chor ke aayenge", "_vaibhav_4596": "Where is that guys who was shooting against police??", "poojapatel0012": "Fake post fake you", "nitaragoenka_": "This is the way you justify your own deeds.. You instigate poor people on the basis of religion on something which does not even exist. You show blind hatred towards the government of your own country. You don't know what is CAA or NRC. You just know how to tear our nation apart into tukde tukde. And this picture Swara, is what you did to Indians. I feel sad for those who suffer today because of YOU. 💔", "navyarram": "Finally!! You are ashamed of yourself.", "pearldiamond1901": "Does India needs this situation? Is CAA or NRC required ? Is it bigger than peace and creating hatered. Why can’t we all Indians forget religion n b only Indians and humans , no religion teaches hate. We hv so many important things to focus. Where wl India and it’s youth stand after 10 years? How abt free medical, school more security cleaner city n better growth, why can’t we stand n fight of these basic important issues?", "prabhatkumar9446": "Tumhara yah bhashan Koi nahin dekhta acting to dekhta hi nahin hai", "krhabd17": "App achha acting kroge to film jaroor chlegi apki.....lkn ye CAA ka acting ...apka film nhi chla payega😂😂", "iamsayyedsarim": "Dii aapko Allah salamat rakhe aapko aur izzat aur sehat de..... Ameen ameen", "r__a___j___a": "Shame on modi gov", "payal_.x": "😭", "maulik.chopra": "Tujhe yehi dikha...Yeh nahi dikha vo ldka gunshots fire kr rha tha....You are just anti-hindu...Filmon mein kaam nahi mila toh yahan....I am not blaming any religion....All are equal but YOU.....You are just instigating those innocent people....People like you are the real reason behind these riots....CAA indian muslims ke liye glt kahin se bhi nahi hain tujhe kya pta tunne toh drafts bhi nahi padhi....You call yourself an ACTIVIST...Yes you shall be ashamed.....So stop doing stuff like that and focus on countrt", "ashutoshjii": "Head Constable got shot aur uski death ho gayi ..tmko fark pada..u idiot ..u deserve every shit", "syeda.sara16": "Aasman pe inquilab likha jayega .. sab yaad rakha jayega..", "n_i_k___45": "Constable ko mardala wo nahi dikhai deta sali ko muslims hi dikhai dete he😡", "amanguptagg": "Have you even validated this photo before sharing it across..Do you own the responsibility if it comes out to be fake..", "_an4u_": "😢😢😢😢", "shubhi_loves_bts": "@reallyswara Jo constable kl Mra hai uss hi tareeke se Tu Teri ma Tera baap maarenge yaarmd rkhna...jnu waale hi Teri gaand maarenge...", "rahul.kumar_18": "Aur Abhi ka post nahii kregi saaali ? Head constable mara Gaya woh kar na BC 😠😠😠😠", "_rakesh.patel": "जो पत्थरबाज हजारों की तादाद में इकट्ठा होकर उनके ऊपर पत्थर फेकेगी तो पुलिस उनका क्या करेगी यही हाल हुआ इन भाईसाहब का", "vishwavijaynegi": "Chal randi sali teri vajah sa sabh ho raha hai #masturbationgirl", "drifter_kt11": "🤬🤬🤬", "merajshaikh07": "😢😔😡", "mayank.sri08": "Plzz 🙏🙏 frnds enke jaise attention seekers ki post pe koi b reaction mt do apne aap line pe aa jayengi, aukat pata chal jayegi... Aur jaha tk baat rahi Delhi ki to frnds Mota Bhai ka matha sanak chuka h ab ek ek ko bula bula k sab dangaiyon ki khujli door karega...🤣😂🤣😂😆😝 Shoot-at-sight ka order Diya ja chuka h, ab es se bhi en Mohtarma ko prblm hogi kl tak ek Ni post ready hogi enke pass but frnds uspe koi b reaction mt Dena... Jai Hind...."}