{"sharmaking88": "Saali gasti Delhi ko jala dala", "romoantickle": "Pagal aurat", "moushumi_halder": "She is paid dalal 😊", "_royabhi27": "Saali tera aukaat nahi is Bollywood ka. #ibycottswaraflims", "tanoj__": "Aag laga di Delhi main madhyapradesh main chhup rahi ho congo", "sujeet.kr.mehta": "Chutiya h ye sali", "smartsam2330": "Ab Delhi jal rahi hai ab bol bhen ki Lodi kutiya", "sidhant_ag": "2010 Mai 15 saal ki thi liberal", "bhardwajakshay608": "lawdi h tu desh se niklja bkldo", "shourya_xoxo": "Tu kab se culture ko promote karne lagi suar ki aulad?", "record.killers10": "tu bas urban naxals ka bed garam kar 🤣🤣", "arushmrup": "Unfollow and plz report this account", "singhraj9996": "This leftist bitch is spreading lies and hate even now after satisfying her quench of blood. She is pushing her agenda to portray this riot as an anti muslim riot and trying to spread more and more hate so that more people get killed, this cunt hated hindus, she must be enjoying after knowing how brutally hindus have been killed. You will burn in hell suara bhaskar, bloody Maoist terrorist.", "ritzynilesh": "Report this account", "shuv_08": "konsi gaali du isko sochna padta hain....itni madarchod aurat h..", "sumair_sharma2121": "hai", "sumit397": "delhi jla kr ynha aai", "dumb.school_": "Anpadh Didi (nibbi)", "aditiagnihotri_": "Yeh 2010 me 15 sal ki thi 😂😂😂 #JustNibbiThings @thakur.___sahab", "gauri_argade": "Lol earning brownie points 😂😂😂😂", "ashhrocks": "Did she promote #mptourism if there was BJP government ruling or have she ever promoted any state's tourism that has BJP in power? # hypocrite #shame", "mayanktyai": "Learn something from Kangna she is amazing and intelligent @team_kangana_ranaut", "sanjay__inani": "@reallyswara 1 Million Followers To Hai Nahi insta pe Or Bakchodi kra lo Madam se TIK TOKER Hi Badiya hai Tujse to Duniya ka Gyan chodegi bs 😂", "keya9130": "Swara v BJP ko vote de rahi h or CAA and NRC ko support kr rahi h....🇮🇳🇮🇳🔥🔥", "thakur.akanksha.16": "Ankit Sharma kai bare main ni bole gi ab chudel????? Ab kahan gum h tu", "thatindiangeneticgirl": "Shame on you miss swara , you're just soo illiterate and stupid , please go and settle down in Pakistan , you guys are making caa and nrc such a big issue , after 10 years there will be non hindys in india , hindustan will be a part of pakistan", "bhagwatrooper": "Swagat hoga tera ab Delhi mein. Jaldi aa", "risewd_astroqoutes": "muh me abba k harmonium le k bethi hai didi kam ki ghor kami thi kuch ke dil behla k kam le aayi ab kya h hi shakal se budhi bai jesi dimag me guh bhara h iske parents kese bolte honge ke hum swara ke parents h omg!! Wese v bio me likhi hi h dramebaz 😂😂😂😂", "peekaayyyyyy": "JUST REMEMBER ONE THING. THE BLOOD OF ALL THE PEOPLE WHO HAVE DIED IN THESE RIOTS IS ON YOUR HAND TOO. YOU'RE THE BIGGEST PIECE OF SHIT WHO HAS SPREAD HATRED AND FEAR FOR A VERY LONG TIME NOW. YOU'RE JUST AN ILLITERATE BITCH. REMEMBER THIS.", "ishaan_2208": "Your a shame @reallyswara anpadh ki aulaad chutiya sAALI", "_.rajan._09": "Ab chup kyun hai ye bhsdki😡🤬🤬🤬", "ig_chandu": "2 कोड़ी की", "richaagarwal27": "Shameful swara bhaskar", "khushii.pundir": "She is trying to distracting herself from tahir hussain's matter. Now she wont say anything.", "suresh_pooniya__choudhary_jat": "इन्ही की वजह से आज देश मे दंगे हो रहे है🇮🇳🇮🇳", "_het.shah": "Tu kya tera bapp bhi kaagaz dekhaega!", "rida.maqsoodi": "❤️", "_ritikakhurana_": "#arrestswarabhasker", "atul.vaidya.5245": "Report this account 😡😡", "vijaypatel3992": "मादरचोद रंडी बाज नजायज मुस्लिम आतंकी की ओलाद ही होगी", "the_royalnavghan__________": "एक वीडियो दिल्ली हिंसा का भी डाल कर शोक जाता दो क्या पता मारे गए लोगो की आत्मा तुम्हे माफ कर दे 😫😫", "bharatsingh5540": "Draft kha h", "s.tyagi1704": "Abb kha mar gyi 🖕🖕🖕🖕🖕", "kunal.sharma.1.1": "Naaaagin hai tuu", "varshagirnara": "Bhok ti hui kutri", "uday_emo_03": "@reallyswara tu Randi he..", "akshita.rathore119": "sakt nafrat hai mujhe is aurat se", "liveyoung213": "Badtameez do kodi ki aurat", "whoisluv": "CAA ka draft padha hai 🤣", "krishank198": "Sadguru ne bhi besti kardi b.c ki tb bhi uchal rahi hai ..rubika ne to NRC ka draft saree mai ghusa diya 😂😂", "mehak_rapunzel": "You were ashamed of being a Hindu. You called all BJP supporters Nazis. You wrote articles on how constitution is in danger. You wrote poems. You sang songs. You posted pics of kids and old men. 100s of criminals are seen throwing petrol bombs from AAP councillor Tahir Hussain's house. You remain silent. Your hypocrisy force people to take sides.", "iprateekchaudhary": "Chal saali aatankwadi 🖕🖕🖕", "hershey_g_": "Flop actress 🤡😂", "hardiksharma.1810": "Ankit sharma k bare m btao", "aliyamush": "Huge respect👏👏👏👏", "yashpan.1": "Madhya Pradesh me bhi NPR laagu h na?", "xahaamit911": "Kya re kamine kaha gaye....mar q nahi jate tu...paiso k liya aur kitna police o gale dage...ab chupi q hai 🤬", "_mr.morph_": "Ye jaha dikhe iska virodh kro isko iski sahi jagah dikha dena 🙏", "nehuu.2101": "This is actually bad... I mean I'm not saying presenting our thoughts is bad but have you guys seen her tweets?? I mean seriously girl?? I never thought that someone would be doing a debate in such ridiculous manner... Whatever she thinks or does this is not the way to answer..!! I mean I felt ashamed reading that tweet and had a thought what kind of litteracy she carries😅 Hope for the best and you're a public figure atleast choose your words wisely if you're debating on any platform that was worst🙄", "poojasareen": "She is that Vamp just for money.... Just to be in Media.. She can go beyond that might cost not only people lives , it cost nation integrity as well ..Shameful lady ...I wonder how can Sleep in the night ...", "nehal_revankar_": "Ankor-Draft kaha he!!! Swara-Sorry Ma’am No Maam😂😂", "shanaya0507": "Madarchod randi aurat isis ki randi hai tu. Muslim marte hai woh dikhra hai or hindu jal rahe hai woh nahi dikhta. Madarchod", "loveurself001": "Firse mu nai bolneko ab Tahir ka naam aya hai to, wahi hindu hota to ye tamasha karti fake sali", "_shilpamondal_": "🖕🖕🖕🖕🖕", "official_gm_143": "bhaiyo swara baskar achi ladki hai😒..bus batak gayi hai kahi 🤣🤣", "anandwaibhav": "Tujhe to ab bada sukun mil RHA hoga jnu ki prostitute ..", "pragatimrch13": "Jii mam ab kha h aap.... Jab aapke peaceful protesters ne hazaro logo ko Maar dia, zinda jala dia or Kaat dia..... Aap logo ke lie hi anurag thakur ne shi slogan lagwaya tha... Desh ke gaddaro ko goli Maar saalo ko", "kirti.verma.kirti": "Ye jaha dikhe chillao iske mu per kitne mei biki hai", "__.krupalpatel.__": "Arrest her", "yashwanth.official": "Bsdk desh drohi nikal pakisthan", "aniketdhl": "Kitne pese khilae h?😪", "iampoojavij": "Report her account bewakuf aurat.. Tuje bi paise mil rhe hai kya yeh kaam krne k liye ? Ya Industry me kaam nhi mil rha or News meh banke rehna hai.....", "tp_twinrav_": "anapdh gawar sali.....", "no.one.for.world": "Why do people even support this hypocrite 🤔😢", "khushboo.tomar.18": "My hometown💃🏻", "rajatofficial27": "Report this account", "ishaan_manawat": "Please report this account and #arrestswarabhaskar", "kirtilatanarayan": "Tere AAP party ka pakadata hai har samay", "equestrian.3": "Didi sheer qorma ka promotion bade time se kr rahi hai😂😂😂", "akash.lucknow7": "Itni nafrat leke kha jaegi bhnchod.. Besharam dekh har jgh teri m** chid*** aa Gye hai sab. Tujhe Lahore Jane nai milega yhi mregi tu", "kaursimarora": "👎👎", "sameerphadatare": "Ab bol @reallyswara Tera baap Tahir thha iske piche ab bol bhagwa aatank 😂😂", "himeshiam_31": "swara betiya uff chuttad ne apni gandd marva li bde aram se or wo bhi sirf 15 saal ki ummr me😂😂😂😂😂", "navdeepsinghparmar": "RIP 🙏 @reallyswara", "ankit.kalia_.__": "Hramzaadi nikmmi dekh drohi suar ki aulaad dhooob k mrja", "pandeysatyam353": "pta wta kuch ni hai inko.... jhuth failai hai..... kuch ni aaata jata.. na pata hai bht", "i_hardikb": "Seculars don't talk about culture", "raviranjan_28": "Nagin", "sneha_verma_17": "Tum jaise chutiye kisi ke ni ho skte Tu india mein kyu hai... Bhagg na yaha se flop", "tg73037": "Inki movies dekhna hi band krdo ..Jo kuch bacha hua kaam bhi hoga band hoga inka", "sandipan.chakraborty": "#arrestswarabhaskar for this riot", "manvendrashankar": "Ek baar jara tahor hussain pr bhi bol de re TERRORIST..👹 ... 4 logon ko ussne mar dala ....kab kholegi re apna muh.....zahar uglna kab band karegi👹👹👹👿👿👿👿", "amittchabra": "Kya re mc. Delhi me tere katele pille tere baap log dekh kya kar rahe mc", "charan4838": "रण्डी साली मां चुदाने वाली😈", "rachiita_sh": "🤬🤬 chunk her out of the country.@reallyswara selfish 🤬", "msdian_yona": "Ahinsa prm dram ...... Hatyare khuni mrudrer ..................34 INDIANS have been killed by INDIANS .....we don't need Pakistan to destroy us 😔😔😔 ek vo log hote jo smj nhi pate or ek vo jo smj kr bi smjna nhi chatee .......humare swatantrata sehnani ne hume islia azadi nhi dilai km se km hum unke kurbani ka samman to kr skte he ....me 16 sal ki hokr bi yh chiz smj skti to ap kyu nhi @reallyswara and other protesters ....u call urself INDIAN sorry to say desh bakti to dikhn nhi rhi .....yh wahi log je wahi thukte he jaha pr khate he ..... afr sachhe hindustani hote to desh ke peace aman shanti ke bare me sochte shame on u and all the protesters btw diwar me sr ptak ke kya fayda......jinki soch giri vi ho hum utha nhi skte ...smj anubav se aata he age se nhi .......karma karma karma 34 logo ko mara he ....unki family ki bd dua lgegi .....hum sachhe hindustani ki bdd dua lgegi ....best of luck for ur dark future or just pray to god shyad thoda kam aye ......murdered #khuni #shameless", "sanatandharma._": "Atknhwadhi saali", "hell_oanab": "Lund legi issi jagah mei teri choot ka chandni chowk banau bhen ki lodi", "harshu_patel06": "Teri maa ki cut swara 70 din se madrchod road m ghum ghum ke chila rhi thi dehli jalwany ke liye", "vartitsivastava": "Suar a Bhen ki lawdi", "your_sis_takes_my_seeds": "#savedelhihindus", "eldiablo.joker": "https://www.instagram.com/p/B9EXwdOJDTq/?igshid=xcdfig2eqcfo", "its_chronology_": "Madam apka sohar tahir hussain hi nikla .. terrorixt..ab ap kya krogo", "__anikaladkani__": "plz leave our country😊", "ravikesh_panwar": "Please every on this woman in responble for Delhi riots", "rushabhkulkarni99": "U are a piece of shit .. #democracy #freedomofspeech", "vjvaibhavjaihind": "Are you RANDY ortan?", "arjun__baghel_": "Dhat Teri maa ka bhosda Randi bhen ki lodi", "tyagiblood": "Bol", "toshi_tripathi": "Tube Light = Swara bhasker😂😂 Also mai 2010 mein 15 saal ki thi😂😂😂 Age bhi ni Batayenge😂😂😂 Pagal aurat😂", "_payphone_m5": "Pheli fursat mei nikl", "_._reena": "Reallyswara get lost from this country", "anjali.dinkarr": "#arrestswarabhaskar 😡", "s_w_a_p_n_i_l": "Ye bhen ki lawdi ki wajah se delhi jal ra hai😑😑", "airaaaaaaa____": "You’ve spread false news, you’ve lied !", "kishunitin": "Raja Ram ki Nagri Orcha meh apne Paap dhone ana hi padega antinational logon ko.Ram tumhara Bhala kare.....👎👎", "ashwanikr92": "@reallyswara Bharat me saab thik he laudii tere jaise bhadvee nahi ho toh", "kunal.kay": "Guys she is a flop acctress and wants to display herself in public by saying against NRC, she know by doing this will help her filmy carrier and boost her existance up, doesn't matter if NRC facts are even cleared in her own mind or not ...... P.s. - we saw your dumbness and child likeness interview , where your facts are not even clear. 🤳 #dumbnessintheair", "utkarshdesai97": "You don't deserve to put this bitch🐖🐖 just because Bollywood is full of Muslim doesn't mean they will give u good contract and new movie to u bitch", "sumukh_hr": "Since you can't peddle fake news about CAA now as per government imposition, Swara Bhaskar will not post anything about CAA now.", "aditya_kaushik_117": "Draft kha hai begam jaan??🤣🤣🤣", "lads.lon": "Kutiya", "livessshhhhh.af": "Rip for u mind😊", "laxmanshekhawat_9": "bhadvi ab nhi bolegi kutiya mule ki olad", "caran1758": "Just putting poison out of her mouth", "devjibostar1998": "Teri ma ka bhosda raand tune delhi jalayi h", "akashdeepsingh96": "Great post 👍", "kelvin___patel": "Mandarchod @reallyswara", "pavi0909": "#arrestswarabhaskar randi ki aaulad he he maa bhi kothe pe ye bhi kothe pe iski bhabhi bhi kothe p thi maa iski kitno se chudvati he", "iam_gauravv37": "Report karo iss acc bc terrorists k liye roti hai or humare jawano ko gaaliyan deti hai #arrestswarabhaskar", "gym_boy_boy": "👏👏The one who accepts there may be yearning the inconvenience-Hasel😢", "fan._.of._.mahakal": "Randi ki bachi", "___puneet_tripathi___": "Bhai sab milkar report karo #reportswara", "shailesh.jadhav.9461": "Delhi mhe aag laga ke Yaha maaza maar rahi. Ishne bhadkane vale bhayan diye Delhi kr logoa raste mhe aake dange karne bola. Ishe pahle Fasi doa. Isne 30 logo ki jaan li.She is murderer Of 30 Innocent people.", "arindampaul1224": "Swara Bhaskar promoting a Ram temple for money clearly shows she has no ideological integrity.", "raonakkaushik": "Horrible person.", "khufu106": "nrc draft kaha he ungli master???", "witttyyy_thoughts": "Ab gattar khol", "kaminaaaaaalonda4": "Yeh chew tiyaaaaaaa yahi chaahti hai ki India ki international level pe ho... kindly notice her stories and her way of spreading fake information to a specific community", "callingoutbsclub": "Lololololol, your peaceful protests and your azaadi ke naare killed so many people! It’s on youuuuuuuu! It’s on the people at the ground tooo! It’s on you and on people like Kunal kamra too! Sharam aani chahiye Indian bolte hue khud ko! Wonder how you sleep at night! Also NRC KA DRAFT KIDHAR HAI DIDI JISSPAR AAPNE ITNE DANGE KARA DIYE????", "i___rohan": "report maro sali pe do kaudi ki aurat haii terrorist haii ye madarchod randi sali", "itssimmijain": "Hi suara banskar😂😂biggest liar n the worst actress😂", "k.k_aggarwal": "#ALLAH1stTERRORIST", "i_am_ssraj": "Report account for hate speech. She is spreading violence in our country", "_tedhiladkii": "Behen ek din ye AAG Tere Ghar Tak zaroor pahuchegi . Yaad rakhna 🙏 kisi ka beta Mara hai usko use mat kar apne faide k liye . Uupar Wala sab dekh Raha hai 🙏 jodti hu bas karle bhot hogya", "anishnathani099": "Report karo isko", "darshanamaske77": "Swara bhaskar is overacting ki dukaan😂😂😂", "__rajput03": "Hahahahah swara ka time aa raha hai paas mein toh cultural ban rahi hai", "ashgill23": "Is bandi me shrm to hai nhi left media or muslim fund pe hindus ke against propoganda krne me no1 acc. To her delhi me muslims ne 1 ptthr nhi feka hoga na koi murder kiya hoga sab hindus ne kiya hoga 🐖", "charismaticrachna": "Or just feel ashamed for what you have been doing for past few months", "saffron_my_blood": "Maa ki land teri", "rahulpunk_": "Swara bhaskar.. a flop actress!!! Shame on you for creating hatred across the country!!", "adi_raw0511": "Oh Behen ki laudi", "himanshisharma3004": "Dumbest creature you are!", "resol.07": "चूतिया औरत", "manisha.s1403": "@reallyswara you will not shed your crocodile tears for #ankitsharma ??? Now you don't feel that Constitution is in danger.. Such a hypocrite you are.. Shame on you", "adi_bansal03": "BAN this account", "pablo_escobar0821": "madahyapradesh me mt aanaa😠🔥", "kulkarni.ruchir": "Ankit Sharma ko rioters ne itni berehmi se maara... Par aap apna chalu rakhiye... Ek anti-caa waale ke saath aisa hota to sabse pehle post karengi aap...", "mayank.tandi.35": "Aap Hindu ho kr Hindu se itni nafrat aap Hindu ke naam pr kalank ho Aap ko to pak m rhna chhahiye", "_rohit__gupta": "#boycottswarabhaskar aaj ye med bhut khush hongi aag lagakar Puri Delhi ko bhut santusht Hui hongi Kya chahthi ho aap hamara desh jalee Aur log mareee Jaye Aur unke rojgar chinee jayee . Desh ka vikash na ho CAA aane se Kya hogya kon Chala gya bss apki lagayi Hui aag hai Jo aaj sabkoi jhel raha shame on u", "naman_raghav_singh": "रुबिका तो तुम्हारें सपने में आ रही होगी स्वरा..?? 😂", "mayank_m_chheda": "Gaddaar aurat", "pankaj.patyal": "CAA act pd liya ki abhi nhi pde likhe anpad😂", "yash___jangid": "🤣🤣🤣2010 me 15 saal ki thi l🤣l", "kapilsharma_108": "Teri maa ki chut maru sali do kodi randi ab tu kaha pe gand mara ne gai jab us police wale per Goli Chali tab..... Tum log sara india se nikal jao Varna tumhari Gand mein danda dal denge or aur vah Anurag Kashyap usko bol de apni nangi film practical life mein na chalayen Varna uska piya se nikalte hi hai.....fuck off swara bhaskar 🖕🖕", "amitbhanot.jsr": "Bahut hi nich ghtiya or beshrm ldki ho", "ujwall_15": "#shameonswarabhaskar 😊🖕", "chirag_patel345": "Madarchod tu bhosdiki tari waja se he ratanlal ji ki deth hui hai tare papa army main hote huiye tu aisi kaise sorry ha bhul gaya jnu ki paidais hai tu bhadvi", "pragyapurbia": "@reallyswara kindly stop saying hate message we want peace everyone is human who died in Delhi riots also kindly for God stop your drama stop you swipe shitty movie links on stories. If any life died due to your speech remember that will pay off. Stop it please", "mr_ankit_jaiswal2": "Are o tatti liberandu kahiki", "mohitgoyal445": "Desh ko khrab krni wali taxi h tu", "neil.bhatt": "Bitch", "princethakur1024": "Randi h saali paise do or chodo vahi kr rhi h", "brandedgawar": "Draft dikhana hijdi NRC ka", "sukhda.88": "Half knowledge is dangerous mam😅😅😅😅😅😅😅😅😅", "winged.goddesses": "JNU ke liye toh turant video aa gaya tha kyuki apne mom dad phanse huye the...ab koi appeal kyu nahi aa raha?!", "i_am__ram____": "suwara go love D", "praj.pawar": "You dumbass", "sandeepsinghtathgar": "Agar koi modi ka dalal math ka kuch puchna chata pehle apne @piyushgoyalofficial", "aryantanwa": "She is hypocrite person .. and misguide on CAA ..", "gaurav_sharma.gs": "Ab ye orccha ko bhi barbaad kar degi.", "vidhi_jaiswal07": "@reallyswara abb kaha marrahi he 2 policewale shahid hue kaha marrahi ab ni bolegi ki ye galat hua abb promotion yaad aara he desdrohi", "sindhuanandursubbarao": "Culture, art and heritage?? Isn't it only about India being attacked by British, mughals and Hindu - Muslims hate?? 🤔 If I remember that's all we have studied.", "raman0165": "@reallyswara swara gaand mein lena pasand hai ki muh mein Kanhaiya ka", "vikas__bittu": "Ab Delhi jal RHA h bol kuch 😠", "kshitiz_sinha1701": "draft padha tune.😂", "dixixx_": "Acha draft to dikha do?😂", "rohit25666": "Caa npr padh le jake gawar..muthibaaz swara", "vikkash_chaudhary": "Sharam kr kodi ke aurat desh m reh ke desh ke na hui tu teri laudi ko desh m rkhna gunah reh saali chutiya", "elesneha": "bahen ke laudi gandu teri shakl itni gandi hai dekh ke thukne ka dil krta hai saaali tu India m reh ke India ke baare m aag ugalti madharchod sharam nhi aati rand kahiki", "anshu.khare.946": "Orchha mt ana tum ye ram raja sarkaar ki dharti h tmhare jaise gaddar ka hmare yha koi kam ni@reallyswara", "_batflash__": "15 saal ke the 😂😂😂😂", "war_machine_aj": "Aryabhatta Ne zero kii Khozz suar-A bhaskar ke liye hii kii thi ....🤣🤣🤣🤣🤣🤣🤣", "avinashtwr4": "Jis Talwar ko aap dhar de rahi ho wo Talwar jaldi hi aap ki gardan tak pahuchegi.", "sharmasonia007": "After all you get something out of licking asses of anti nationals and congress! What iif that something is shit as you are orchha ki ambassador🤣.", "taj3864": "👏", "nm_4u": "People like you, people who have privileges n you use that privilege to instigate people, you are responsible for riots n Delhi burning right now... Shame on you!!! Ex-fan", "shete4177": "My democratic right doesn't permitting me blocking roads and burnibuses as well as throwing stones from inside universities.", "pramod__choudhary_": "Kitne paise milte h mullo k land chatne ki", "soniyasaini97": "Kutiya kaha mar gayi aaj tu . musalmano ki rakhel😡😡😡", "nehil_dugar": "All i can read is hate comment swara bhaskar u deserved this ...!", "kritan_vishwa": "2 kodi ki aukaat nhi bhikari...sab kuch hindustan se chaiye or gali bhi hindustan ko degi tu..hamre paise se hi yha tak pochi hai ab dekh yeh hindustan kha lake rakhega tujhe...desh ko jalne ki baat karte ho ap log...you have to suffer and pay for it remember.#ban this account", "anonymous36542": "@reallyswara Ab koi bhi apke saath milkar kaam nahi karega kyuki jis bhi movie me aap kaam karegi public use flop karwa degi😂,and you deserve it", "yadavyadav82": "Nashedi 2010 me 15 ki thi tu", "_mr__anurag_": "Desh Jal raha Hai Aur Desh ko jalane waale Promotion me lage hue hai @reallyswara Aaplogon Ne Delhi Ko Jis Jalti hui Jwala Me Feka Hai Usse Aaz Desh 2 Bhaago Me Vibhajit Ho Chuka Hai AapKo CAA Nd NRC se problem Thi aap Log Shaheen bagh Jakar Speech Diye Reporting Kiye Kya Aap Logon Ko Ye Nai Pata Tha K Road Ko Block Karke Vaha Protest Kerna Unconstitutional Hai Aap Right to Protest Ki baat karte ho Right to Freedom ko Break kerte hue Aise kaise chalega DD", "arjunfanpage23": "Her father name is alam jubair khan", "amaan_siddiqui_": "Didi delhi ka haal nhi dikh raha kya apne promotion ma lagi hui ha aap kuch toh bolio did", "detective_.douche": "You totally earned my respect madam....🙏🏻", "arpanrc": "Mc jb mptourism bjp govt k pas tha tb koi orchha tourism ka prachaar nhi hua aur ab sikh danga aaropi k mp raaj me prachaar krne aa gyi dogli aurat 😠😡", "atuljaiswal029": "@imrubikaliyaquat fucked you in debate @reallyswara don't ever go in debate again if u don't know anything 🙏", "patel__aditya": "Abe oooo Delhi me Pissfull protest kaun kar raha hai dekh le tu Sali BC Hindu Kare to Madarchod ki tarah bahut kudti hai tu ab kyu chup hai tu sali #urbannaxals", "shivangi6260": "Congress ki taraf se election ladne ke lie didi ji puri teyaar hai ,,,kya baat hai buttering achchi ker leti hai", "sshivmm": "Fucking bitch swara bhasker", "chuslim687": "🐷Suwara Aunty aap ne khud ki bezaati karwane ka koi special course kiya hai kya🤔🤔", "ashishkumar3911": "Report account", "indianactress07": "😍😍😍", "sohailjiofficial": "Support owaisi ji and follow", "nikhil_rj_k": "@reallyswara ab bol na mc", "vedantt64": "Behen ki lodi", "megh_rajgor": "@reallyswara ma'am delhi mein police officer ki death par aap ka kya kahena hai? Why don't you say about this thing?", "thesaffronwarrior": "Mai abhi 18 ka hu lekin 2010 me 8 ka th.. Aap 2010 me kitne ki thi..?? 🙄", "krishna15sharma": "Teri maa ki chut swara Bhaskar behenchod", "i_am_navratan_singh_": "कुती 😡😡", "akshay.saretha": "Kha gei ab tu bc jab Delhi p Hindu ki mara jata hai ab kha de na tu interview bechod Teri jesi ko to koi chutiya hai Jo kaam deta hai tu kalank hai vc", "bijaykumarrathore": "पागलचोद्दी", "sandook.couture": "Ab kahan marr rahi hai tu jab Delhi mein itna kuch ho raha hai badi sos sos chilla rahi thi JNU ke time toh kutiya kahi ki", "dastagir93": "Aaarey who. You people just change your thinking perspective in hours... Delhi To MP", "deven.a.parkar": "Report karo", "noomankhan786": "😍😍😍😍", "fununlimited.x": "Boycott this piece of shit and report this account.. U’re not less than a terrorist. Shame on u. U must die in sewage", "jaydeep_1010": "Bol harami bol", "faheem.273": "Superb", "nagesh2494": "2010 me 15 saall ki think aur 2020 me 31 Sall ki ho gyi . 😂😂😂", "indian_celebrities_": "Acid thrown to PARAMILITARY FORCE OFFICERS ab q @reallyswara ka mu nhi khulta 😠😠😠", "manazirahsan190": "👌💟💟💟👍👍👍", "vaishali_singh__": "Ab sali haramkhor nahi bolegi jab delhi jala ke rakhi hui haii", "archisensei": "Plz not her for orcha It will ruin this place", "palashgoswamii": "Apke JNU wale Goliya chala rhe hai Police pe stone's marr rahe hai Log marr rahe hai Bus jala rhe hai @reallyswara Ap kuch kehna chaegi ispe ?", "gupta_amritanshu": "Female rahul gandhi", "belpatrr": "@reallyswara andhi beheri aur gungi bhi ho gayi ho kya mohotarma aap??!!!...Apke protestors delhi jala rahe hai... Police ko maar daal diya....Logon ko maar rahe apko dikh nai raha???...jaahil aurat", "pepper_diaries": "Great @reallyswara 🙏", "imtnveer": "Retro look.... takes me in history 🤘😘", "srushtij1205": "@reallyswara delhi ke constable ki pathhrbazi me maut ho gy us pr to kuch bol nahi rhi h tu... Ab kaha gy... Sali bhdkaaau... Fat gy... Movies nai mil rhi islie public ko bhdkati hai... Abp news ke debate me to fat pdi thi bina knowledge k chli gy...waha rubika ne bolti bndh kr di... Bina padhe caa ka virodh kr rhi hai... U dumb", "msgupta06": "Shameless woman....", "indian_home_decor": "One of the best place to visit and outside food is also awesome specially dal tadka...just try it 😍😍", "mirzamateenbeg": "Nice", "tonystarkforver": "Madam yaha ungli mat karo", "chikudev33": "Des ko jalayengay kaagaz nahi dikhaengay🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🐷🐷", "jainravikumar": "Kya hua activist", "kattar_hindu_page": "सुअर की औलाद स्वरा भास्कर , गदि नळी का कीडॉ है तू 😠", "hitman_goliyan": "swara bhaskar draft kha hai ?", "s.a.n.d.r.a_._._": "Where is this place?", "namasteorchha": "Thank you @reallyswara! ❤️ #10DaysToGo 🙌", "harsh_12_mishra": "2010 main 15 Saal ki thi 😂😂", "__karan___14": "Didi mera maths kamjhor hai aap muje sikhayangi kya?😂😂"}