{"texas_tiger999": "Sun meri baat tu maa chuda behan ki lodi jhat ki jhingur saali randi kahiki pakistan main jakar atwnkbaadiyo se marwana apni.", "singhjones": "💩💩💩💩💩💩💩💩💩💩", "mahipal__choudhary__": "🖕🖕", "rajunarle": "Pakistan chale jao😂", "urvashi_sharma_": "Hinshtagram waahhh ye hoti h desh bhakti 🤣", "montyk1921": "Kitni tatti Awaaz hai bilkul swara jaisi 😂", "__anvitt": "Chup Raaaaaaaaaaaaanndddddd", "realstates1111": "Swara ka programme Dakho no problem but NRC to hoke rahagi 😂😂😂😂😂😂😂😂😂😂", "iamjaved_ansari": "😂😂😂😂", "santoshsunita3": "Kutiya naam teri pe suit karta he", "aadi_bhure": "🤮", "harsh_4_123": "Iss kafan pehli ldki ko bi oscar dedo koi .... 👏👏", "sanjeevrajaofficial": "पक्का तू सुअर से ही चुदआती हो ये तो मैं समझ गया अब। पूरा तुम जेहादी रंडी हो । साली मुल्लो की रखैल । बुरफट्टी रंडी", "singhshriti": "Aap Palghar kai mamle mai bhi bolye", "ni.lam6686": "Madarchod", "p_a_t_e_l_1995": "Chal bhag b.c", "rohitsankhyan_": "@reallyswara pura din leti rhegi", "anurag_671": "Katuay madarchod mUslim madarchod islammmmmmm madarchod issalm mccccccccccc", "bhattpriya100": "Kitne mullo ka le chuki ho", "myuresh91": "Swara ko he ye swara....chal nikal pehli fursat me", "i_am_sbm": "Wah madrchod behn ki lodi", "trippylekhak420": "Lund lene jaati h ye jnu mai", "na.gendra713": "Fuck you", "j_o_h_n_y_choudhary": "💩💩💩 who r u💩💩", "dineshbhambhu11": "🖕👍", "narjinaryrohit": "🖕🖕 isko daal Lena apni Kaali Kaali gand ma", "the.royal.kabir": "Great", "divyanshi9190": "Replace India with Muslims in your statement", "ritikaindian8": "Sali", "thadani_rahul": "Yeh Randi isis ke hai bhot bdi Randi hai bhotttt top level ke", "_baekoof_": "Heights of hypocrisy!! 🖕", "__________sachin_________": "Tm dono mereko behan lagti ho, dono ki daant aise jangli gdho ki tarah bahar nikli hai🙌🙌", "beingalcholic": "Instagram k bando what the fuck ?😂😂😂😂😂😂😂 Burke wali madarchod", "kumar_harsh07": "Tere shakal pe🖕🖕🖕🖕🖕🖕🖕🖕🖕", "modern_awakened75": "Inshhhtaaaa itseems 😂", "yourdailyfantacy": "😂😂😂kutiya swara chutiya", "poonam_rankawat": "Waaah madem jnu me programs karti h", "lalit.jindal007": "Vhi pe gaand marenge Swara ki JNU vale", "prash_pp_pp": "🐖🐖🐖", "avii_nav27": "Randi ki chhot sali", "spread_awareness_live_fearless": "@rrajeshyadav05 Bhai ki copy", "tushar_tala": "I am boycott #reallyswara of all #programming #movies #event #india #indianmovie #indianactresses #viralbhayani. I will never watch this.", "the.adultworld": "Sabhi logo se nivaran hai ki iske page ki report ki jaye, ye hame behka rhi hai", "priyas4635": "Anpadhon jaisi baat kr rhi h", "singer_rohit_muradiya": "😂😂😂 @salonayyy 😂😂 gutkha to thook leti phle", "abhisheksingh_2008": "Twitter kaam tha gaali sunai Kai liya jo madam nai instagram account kohl liya", "uk.verma.143": "Haa musalmano ko bhadkane k mauke hi to dhundhti h to jayegi hi, the manthra", "hirenchate": "Go to hell", "golubrown": "Ye kesi chapri language hai chapri ho bhi kyo na swara bhaskar jo lider hai inki😂💩🤣🤣", "anurag_kannan__": "🖕🖕🖕🖕🖕🇵🇰🐷", "rambabu.m143": "🐖🐖🐖🐖", "anti1141": "💨💨💨💨", "actress_beautywood": "Baloti bodiya poglam ko ham bhi aayenge", "thateyeiswatchinu": "terrorits bitch", "follow._.5626": "Garmiiiiiii🔥🔥", "rakeshyadav_15": "Awaz neeche 😛😂", "pushpendra.sen.144": "Y hi kam baki rh gya h tumar pass", "babubeg": "Godi media", "jayendrasinh7773": "🖕🖕🖕🖕🖕", "koushikduttaroy2": "Rendi h tu lund mu main lene k badh kaam mila h tuje", "prajapatinirmal": "HAAA... M BHI AA RHA HU BEGAM😂😂😂😂 BESBOLL LE KR", "9264sunny": "Is bahan ki Lodi ke sath valentine kaun banega🤣🤣🤣🤣🤣🖕🏾🖕🏾🖕🏾🖕🏾🔥🔥", "vishu4997": "Madarsa chaap bkl", "prayagimperius108": "Gawwaarr katue madharchoddd", "jayant6085": "Gadaar", "bhushan1489": "Katuwe saale jihadi, swara tu bhi so ja inke sath, jyada paise kamayegi tu", "arpit_1245": "Randi bhaskar", "ganesha_baral": "#randiswara", "mr.vishal_yadav": "Sab ko degi vaha jake 1 no. Ki ra..ndi", "ynwa.anmol": "Valentine ??? valentines is forbidden in islam . Iske baap ne video dekh li toh iske bhai se shaadi cancel aur jutiya padengi 😂😂😂😂😂", "gourav151235402019": "desh drohi log JNU k alaba aur kahi meeting kar bhi to nahi sakte", "_i_am_v_i_v_e_k": "@reallyswara 🖕🖕🖕🖕🖕🖕 🖕🖕 condom leke baith jaiyo JNU hum chodne aayenge tujhe randi ki beez", "karan_notnani": "Kitne m biki?", "bakulpatel_7522": "Modi he to mumkin he. Buewa hatati nahi or valentine's manane chali", "mr_anujverma": "🤮🤮u", "nanavatidhruv": "Yeh celebrity hai koi faltu ka aa ke ban jata hai celebrity so don't take her seriously", "cute_sony0911": "Ye h tumhari asliyat tumhare page pe kisi Hindu ki post na padi h but Muslims katuvi ki padi h....", "uday_emo_03": "@reallyswara JNU jaa rahi he chudvane ke liye vahi pe pahoch jao usko lund dene", "snaya_thakur": "Kis kis k sath manyegi ye 😂", "harpalsinh_jadeja_18": "Jnu aur swara dono gaddar", "abhinav_singh8005": "Randi Miya", "sheetalsrv": "Bitches at witch academy.", "pratik_mali108": "💩💩💩💩", "harshitrajput_": "Arey isey pehle koi sahi se bolna sikhao bhyi", "_het.shah": "Jay Shree Ram!🔥", "s_ravi07": "Chutiyaa🔥", "siddanthpatil": "Subah Tere shakal yad aane se bhi mere ko tatti nahin aati Tum to itni anpadh aur gawar chutiya insan Ho", "kaju_kishmish18": "Bwuahahahaha🤣🤣🤣🤣", "ro_9999hit": "Tori mosi ko c***o", "devilri8": "Sab wahi ama chudne pucha Jana", "rushabhkulkarni99": "She has better speeches then u U are a piece of shit .. #democracy #freedomofspeech", "patil.abhi_abhishek_": "@reallyswara thare ko qur ye rand ko dona ko sath me choduga . Chinal , rand . Le mera lavda mu me @salonayyy", "imshinpaul": "Tujhe toh ek din gali dena hin tha", "jyotiranjan.matha": "Paper dikhana hi padega😏", "praveen7818kumar": "Mere comment ko delete karwa diya kisi Chutiya ne bc 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣", "thedancer97": "😂😂", "manibhushan_konduru": "Haa ab hoga hastmaithun like veere de wedding", "dhruvayan": "Bhurake se lele azadi...bhaijaan se lele azadi.... Abbajaan se lele azadi...#redpig_callgirl @reallyswara", "_aayushi.choudhary_": "Abe kutiya gutka thuk k bol", "s.tyagi1704": "Pogram 😝😝😝😂😂😂😂", "thevinayakdabas": "Jahan bhi ye aatankwadi ikktha hon bomb se uda do", "prabhatkumar9446": "Madam ji sar aapko to maloom hi nahin India Kya hota hai isko to maloom hai apna", "rathodb22": "Lag gayi beta swara ki...", "wolfkid_99": "Language dekhlo iski full aaybaaa pahunchenga na apun tu tens mt le meri jaan😂", "major_sjp": "🤣🤣🤣🤣", "harsh_chauhan54": "Bus naam mein he swara hai . JNU mein desh k gaddaro k sath majay kr rahai hai", "shahi_parth": "Mai bhi dekhunga ye poogram", "punk_just_got_serious": "Bol b kon rha jisko burqa utarne k bad baap se joote pade aur relationship me ane k bad honour killing wala case ban jae🤣🤣", "imankush.saini": "Lund lene wali hain dedo jis jisne dena hai", "iam_amitsoun": "Jugaad", "bhadre_rohini": "Chutiya aurat @reallyswara .... whore", "the_.mystery._": "Are desh ki aad me hindu muslim dange ki planning 😂😂😂", "p4pritee": "😂😂😂😂😂", "rajviv11": "Hr bazaar me munddi hai yee salli r**di hai🤣", "arjunam_100": "Rahul Gandhi ko patane ke liye aur kitna neeche girogi", "aryan_jain.02": "Great technique of getting popular and famous.", "guddu_bhaiya_8087": "स्वरा तो उम्मीद से ज्यादा chu**ya निकली", "amru_ishu": "@anshulkashyapp istagam ke bando ke liya pogram hua", "dedhaholic": "Bhakk tri bhn ki chhoot bhaiyee bol riye h 😏", "smartsam2330": "Randi h ye swara sali 😂", "himanshunegi948gmail.com8": "😂😂😂", "viveksamvedi": "Hahahahahaha", "mr_param_gupta": "Pakistaan k tukde hoge insha allah insha allah....swara jaa ye nara laga zara JNU jaa k teri gaand me dum haina bahot jaaa", "_mr.saxena___": "🤮🤮", "decoybrian": "Randi tere Valentine mai bana ta, jab sabke samne tujhe nanga randiyo ki tarah nachwata.", "rohit__baghel185": "Valentine bad me mana le ge pehle tum jo 500 le ke azadi ke nare laga rahe ho vo to le lo 😂😂😂", "atharv___singh": "Kon chutiya aurat h 😆😆", "panks008": "Loda chus mera mulli", "tadchu7": "Hahahah suri gawar 🐷🤣😂", "dewangsinghraizada": "Randii", "rithwik_singh31": "Hey Pure Randi 😂😂 so how are things going up with you?", "chetan_roop_rai_": "Ye Sub Log Rahul Gandhi Ki Aulad Hai Bhosdikke", "ganeshsantanrock": "😁😁😁😁", "imdevsolanki": "Hahahaha...😁😂😂...iska character to ye he define krta hai..stupid ass!", "gupta.ashu01": "Ma chudwao Jake tum bhi waha", "rajatshakhary": "#swarahatesmodi", "rajat_aloria_muzic": "Pogram hahahah😂😂😂😂", "siddiqueuzairq18": "Randiiiiiii", "shaileshprajapti001": "Apni swara o swara muslim he to kagaj dikhana padega", "corn_shonnery": "valentine’s day manaana haram nahi hai? Iska tinder profile pe kya hai? Want a middle-aged student who is an expert at burning buses, damaging public property and hates the country....religion no bar as long as he is ready to accept peacefoolness and reject his own identity 🤣🤣🤣 #tukdetukdegang", "inspired064": "Kashmir pandit k liye bhi kuch bol deti.. hazaro se zyada sikh maar diye gye ushpe bhi kuch bol deti @reallyswara", "ismart_satyam": "Randi bhaskar", "nilesh_singh03": "Jai shree ram bolo tab aaynge", "piyush0312": "JNU ki registered chamiya 😂😂😂", "rawatsuraj666": "Abe randi tu sikhayegi kya galat kya sahi pictures me kapde utarne k paise lene wali randiya aaj kal desh chalane ki baatien kar rahi hai abe aoukhat hai na teri toh Bhenkiloudi UPSC ka exam clear kr or desh chala yaha randirone mat kr dokodi ki kiski din gand me goli padegi vrna", "khufu106": "valentine is haram in islam 😂😂😂😂😂😂😂", "dhruv_ruhela": "I promise I will never even watch any of your movie swara tum saath dete rho tukde tukde gang ka", "harsh_8864": "Ghanta Secularism ,agar 1 non muslim ko zabardasti bhi agar apna religion change krna pare to ye log ghanta kuch karengi, lekin agar 1 muslim ko 1 hindu ne chu bhi diya to protest pe baith jaayengi. #swarabraininherknee", "sn_kapoor": "Pahle bat karne ka tarika seekho", "tyagi2349": "Khud to ghar ne nikl nahi sakti bahar dusro ko bhej rahi hai chutiya saali 😂", "about_to_fly": "Have you forgot about pulwama attack''us bare me to kuch ni kha''publicity ni milegi? SHAME ON YOU WOMEN''.", "mr_cute_jay": "शरजील का साइज बहुत पसंद है आपको", "hows_the_josh_jai_hind": "Ye terrorist ka account hai", "kaku2835": "Y kitna funny bolt rho h 😂😂", "praveensahu30": "Jai shree raam instagraam k bandho and bandhio ... Mandir vahi bnega 👌", "rahuls9188": "😂😂😂😂😂😂", "huzaifa.jamal.58": "Kuch hijde be aye hai kya cmnt krne bandok dikha ke haton mai dam nhi hai kya na mardo chutiya bhkts", "singhraj9996": "Sharjeel imam ke support me march nikal aayi.Such a bigot.A traitor, tukde tukde queen are the apt words for you. You stand with the man who wants india to be divided and then ask why people call you anti national. Shame on you tatti bhaskar. The country has given everything to you and you ungrateful woman want it to get divided, nothing else can be expected from a red terror infected mind. Sharm kro or hagna bnd kro khule me", "_npadhiyar": "Bc abhi bhi ye lok ka nattk chalu hey mc or ye jo swara hey vo rall nhi RANDI reall hey 😂 AAJ TAK KABHI JO JAWAN SAHID HUVE HEY UN SAHID KE FAMILY KE SATH KAHDI HOTI TO ACHI DIKHTI VHALI YE LOG KI GAND ME GHUSSEN BHOSDIKI SWARA RANDI 😡", "vivekjais1210": "Aapa ji ko vol dijyye thoda rajai SE bahr nikle 💪😀", "rushi11": "U fucking low leval celebrities just used to go JNU for getting publicity by selling your words, dance to the traitors of Nation.", "_baap_hu_tera_mai": "Ye Lauri ko sath dene aau madharjaat ko.......bol kaise rahi hai tu road pe kapde bech..... madharchod", "_.rajan._09": "Dika di na apni aukat..aur baat tere se zyada to tik tok walo ke followers hai to soch😂😂😂😂🔥🔥🔥 randi", "unsaidwords_09": "Tujhe koi kaam nahi to yeha aja😂😂😂😂😂", "qualeheretic": "tere abba ne dekha na video tou shariat ke hisab se bahut maarega sab bhul jaayegee valentine's", "udintknow__": "हलाला की पैदाइश साली रण्डी स्वरा भोसडिकी", "hasrab_hasish": "Swara aunty yeh aapki beti hai kya?", "deepu_patel____": "Randi ko movie nahi mil rahi to kothe par ma chudane ja rahi he madar chod 😂😂", "saurabhsuman779": "https://twitter.com/romanaisarkhan/status/1228914854515400704?s=20", "kasana1855": "😂😂😂😂😂Kia bath hai valentine day ban rha JNU Jha sex ka adda hai", "whoatulpandey": "AJ BLACK DAY HAI SAINIKO KE LIYE KOI POST NHI LEKIN BHRAM FAILANE KE LIYE KHOOB POST...ACHA HA TM KAHA KROGE AKHIR SHAHEED HONE PR TM SB PARTY KRTE HO..SHRM KRO BEWKOOFO", "ayushkmr9": "Ye Swara Feminism Par Baat Karti Hai, Burkha Par Ek Shabd Bolkar Dikha", "amitm5060": "Are boor chodi kavi sahid diwash vi mala lo", "qumber143": "👌", "suny.manu": "Pakistan walo ko b bula lo", "the_sagar_shah": "Jay shree raam❤️ be thakkan india k saath nai pakistani yo k saath als tum sab jnu vale pakistani to ho", "its_me_arun_tomar": "Abe famous hone ke tareeke dhudh rhe h", "rk_nits_2424x": "🐷🐷🐷🐷", "dhanraj_dodia_702": "JNU Gaddar ki collage he waha koi nathi jayega JIHADI kutto", "captain_jacksparrow_113": "Ha Atankwadi ko sath hi to nautanki karegi", "jaatkiyaari0808": "Dekhna modi amit shah abhi ek inch nahi hatenge. Na toh na hate lekin apni kursi se jarur hatenge inko ye nahi pata ke sirf kuch muthi bhar ke hain jo modi modi karte hain inka bhawagn bahut aajib hai pata nahi inka bhawagn inko kiya sikha ra hai shayad ye log hindu nahi hai shetan hain or shetan apni oqad dikha rahe hain bhawagn ka naam lekar saare kaam tak karte hain repe bhi", "ansari_1230": "😂", "sanket__303": "Pehli fursat me nikal", "irfaank7635": "Sabi babao ka khun samil hai bakto ki paydais me kisi ek baba ki aaulad nhi hai", "aakas_tiwari_": "🤣🤣😂😂😂🤣🤣😂😂🤣🤣", "ruch.i289": "Kon kon inki gand me goli marna chahata hai", "ishanidutta1969": "Waiting for updates of your celebrations 💓", "anand.mewada.547": "Kya jnu me ka karegi", "sunny_the_boy_": "Inka Lawday Liya Hain Tune I wee know that", "bijaykumarrathore": "पागलचोद्दी", "takshak1987": "Ye suwara to tatti muh wali hai Mai to phele se kah raha hu ye Islamic terrorist ka naya chehra hai", "dnauriyal": "तुझे कश्मीरी पंडित बुला रहा है खोपचे पे", "ronitshambharkar": "🙏🙏", "vainrahul": "Teri maa ki chut", "febi.khan": "Hahaahahaha aise kon bolta hai", "shakir_35": "Bahutt khub", "thesaffronwarrior": "Asli jaat yehi h teri", "ahmadlostjourneyboy": "Ma'am kahaniya ji jan gan man ki yatra daily kar rhe hain kiya aap bhi daily kar rhi hain @reallyswara", "savita_panjabi": "Lgta h sarjil imam jaise logo k sath jald hi politics join krne wali h aap .....badhai ho apko .....kuch khas logo k vote to mil hi jaenge", "kaal_chouhan_01": "Do kodii ki actress😂🤦‍♂️", "prince__charming11": "😍😍😍😍", "rathod.ajeetsingh": "Chup kro Indian culture mai valentine day ni mnate smjhe aur mere desh mai kisi bhi festival pr koi ghatna hoti h to hm vo festival ni manate agr ap Indian hogi toh pulvama attack yaad hoga ....😭😭", "rockpandit": "Yahi to jat hai teri", "mohitsinghania": "ye madr*** kuch nai karegi bolti.hai sarjil ne sahi kaha sarjil iska yr hai na bolti hai chakka jam karna galt baat nai hai ran*** abe tum log kaise bol.leti ho desh ke khilf apne maa baap ki jyaj aluad to ho.na ki nai dogli @reallyswara", "nikhilchhabraa": "Gutka thuk ke baat kar bc🤭😂", "srivastava.satakshi": "Behen u should stop doing these things and focus on your career. It is already on the floor", "ishikagarg9638": "Apko Hindustan tere tukade honge Uske naarey nhi Sunai dete kya Jo ye log lagate hai hamare area ki side ye logo pathar bazi karte hai Hindu haye haye ke naarey lagate hai innocent logo ko harm pohchate hai apko vo sab nhi dikhta kya @reallyswara 🙄 ye Kaisa ek tarha support hai apka Ma'am ?? Main ek hindu Bhar jate hue dar Lagta hai kab koi hamla karde revenge Lene ke liye apko wo logo ki taklif kyu nhi dikhai deti Jo inki wajah se pareshani jhel rahe hai ap star Hona sab baat sunte hai apko inko akal deni Chahiye par nhi ap inke sath milke Hindustan tere tukade honge slogan ko support Kar rhi hai😶😶", "01_rv.ndr_a": "We are @JNU aapi", "i_tarun": "Abhi tk to lg rha tha ki jnu ki educated hogi... Bt jb muh khula toh 💩 dhula 😂😂pogram", "himanshu_sambharwal": "Jnu ki maeya ka bhorsda gadiye hai jnu wale", "chuslim687": "Mullo ki gand chatne ka itna shauk hai toh chali jaa hamesha ke liye Lahore Pakistan", "ravi_nagargoje_": "ये दो कवडी एक्ट्रेस हिंदुस्तान सरकार को बतायेगी इस देशद्रोही का बोलना ये है कि बांगलादेशी और पाकिस्तानी घूस पैठीयो को भारत के बहार मत निकालो लालत हे", "vipin4910": "Sharjeel , afjal , adil ahmad daar , burhaan baani , ravish kumar , kanhaiya, poster girls ko bula lo or chhaano biryani.", "__only__muksa": "Jab mulle itne ache lagte hai to religion change kyu ni krwa leti @reallyswara", "pablo_escobar0821": "1chlo valnetine manane inki maa chodne sbki jnu", "pradeep.shrivastav": "Swara Bhaskar is frustrated actress now,and to gain cheap publicity she is doing all anti National activity.,🐖🐷🐖🐷🐷🐗", "abhijeet4864": "Swara chudwane ja rahi hai JNU me kya.. sali MC BC", "raj290078": "Desh virodi nare lagaoge aur kya", "sameer_jordann": "Izzat m rho aram se koi wo nhi h na koi dekhga", "ritesh.r.mishra": "😂🤣😂 nanga nach karne wali ho ya apni fingaring ka talent dikhane wali ho DESHDROHIIIII ko🤣😂🤣😂", "alter_tommy": "Its Haram completely unislamic Gunnah Sharia law punishment according to Hadiz", "amit_the_creation": "रण्डी खाना खोल रहे हो क्या सब।", "sagar__singh_rajput": "Pole dance karna hijab pehen k😂😂 @reallyswara", "bun_nyl": "fkin jihadi 🤮🤮🤮🤮🤮🤮🤮", "abhi_msh143": "Lavda leke sbhi bhai taiyar rhenge.. aur bari bari se sb lenge", "kaur_kps": "🤣❤️ sure aap bhi pahuch jao ji", "tooba_abbasi": "See you in nizamuddin😍😍😍", "damar6870": "Kuch to sarm kro.....", "rashmii001___": "Yhii to aukat hai teri JNU me valentine day manane ki 😂😂😂😂", "thekapilgoswami007": "Bhai mjhe kuch nii pta WE NEED KI CRPF KO PENSION MILLE BSS", "ashpat007": "Hopefully she doesn't blow herself up.", "darshana7250": "Desh k shahido ko mat bhulna", "adityask_2003": "Cringe as fuck", "_cr7_param": "And what about pulwama attack.. Its been 1year.. Show your condolence towards that also", "chachacloudy": "Jitne Bhi Modi Bhakat Haii Sbka Baap Hu Main 😂😂😂😂😂😂😂😂", "hasnusheikhu55": "@reallyswara ❤️😍❤️", "bks007earth": "कौन जाएगा। यहां सब प्यार में पागल पड़े हैं।", "iam_sam_09": "Me sirf itna hi kehna chahta hu teri ma ka bh**da", "doctor_tuba_zafar": "You are real hero swara!", "gopal_bamalwa": "🤣🖕🖕", "pritam5158": "Yeh do taake ki actresses sali yeh hindu ke ghar kisse paidaa ho gyi isko to kisi mulle ke ghar pidda hona tha yeh desh drohi hai goli maro sali ko", "foodie_sapiens": "Mullo ki dalli swara bhaskar", "taruna154": "🤣", "abhijitchaudhari_": "We Indians support CAA NRC NPR and we want uniform civil law also", "alikhan0063": "@shaziakhan_khan", "rishabh_chaturvedi5": "Itna faltu time nahi h humare paas", "rishaabhvsh": "ask aapi to sit with aapa in some restaurant and have a good dinner date this valentines instead.", "ruheenajavedsufi": "Great...... Nazma aapi", "ahmednaseermohammed": "👍💚", "ashna.sharaf": "😍🔥", "dmplrana": "👌👌", "che_reboot": "Awesome", "suplexcity1224": "Laude", "iamkhalid911": "✊✊✊ more power", "darshansharma_official": "Pehli fursat main nikal😂", "roshan_kumawat": "Sorry Lulli Jaan 🤣", "mohammad_shadabkhan": "Masha Allah @reallyswara 👌😊", "follow_alshifacharities": "Why u are supporting them I am unfollowing you", "kafeel.ahmad.18488169": "I salute you", "md657050": "👏", "kdrszgn55": "Türkiye den sevgi ve saygılar", "nadimejaz": "👏👏👏👏👏👏👍👍👍👍👍", "iamshaurya28": "🙏👌👍...!!shr", "safeer3333": "🔥🔥💕", "rajat_1_4_3": "Aunty ho sake to Pulwama k saheed ko shradhanjali de dena #urbannaxals", "sspkudla": "On this day, in 2019 Pulwama attack happened, 40 CRPF soldiers martyred in the suicide blast. Heartful tribute to brave soldiers. Jaihind 🇮🇳🇮🇳🇮🇳", "mohammadsalman_baig": "🌹👌💯👈👍", "sachinjoshi77": "Bahot badi gadsri ka dhua start kar rahi hai india se sharuat tu kar end hum karenge", "asabe_bhushan": "Sharam karo... Jo sahid huye the unko yaad karo thoda to.... Roj khali desh bhakti ka natak karte ho", "rajput_akhil7000": "🖕", "amil_khan158": "Behtren😘😘😘", "raghav_agarwal_": "Jabardast bhaiye lage raho............ More power to @reallyswara", "prashant_092pandit": "Swara is really a bitch totally.... She is not raise their voice for kashmiri pandits... She always stands with lal salam... Motherfuckers... Bhand sale", "strangledcringe": "Kuch cheezon mai aap bhi glt hai constitution mai bht chize bdlne ki zarurat hai kuch chizon mai mr Prime Minister bhi glt hai but its not that ki he is not working fr our country hme iss wqt hindu muslim ke concept se upr uthkr as a human sochne ki zrurat hai caa hrr trah sahi bhi nhi hai glt bhi nhi jis desh ke liye itna jhgda itna protest ho rha hai its just a land with boundaries usme rehne wale insanon ki kdr kro rather than respecting religions, beating students or mass molesting women so pls growup aur imp mude jo gargi college mai hua uss pr focus kijiye", "er_r_d_r_gurjar": "🧨🧨🔫🔫", "khatana_dhananjay": "An attack is going to happen today evening", "princeofil786": "Wow bold 🔥🔥🔥🔥🔥", "shreya_official_01": "❤️❤️❤️❤️", "laxman_5911": "😂😂", "salmay786": "👌👌👌👌👌🤣🤣🤣🤣", "dg14_11": "Movie mil nahi rahi to ye sab natak kar rahi he sahi he 👌👌👌👌👌🤟🤟🤟bhadkao aur logo ko @reallyswara", "mohan_mahaman_official": "💖💖💖", "shobhit_tyagi88": "Mujhe lag raha hai finguring karne k Baad bhi kaam nahi mil raha... 👍", "chanchalthetinu": "Main to 14th February ko un 44 shaheedon ko shradhhanjali dunga jinhone tm jaise chutiyon ke liye apni jaan de di,,", "faheem.273": "Bahut khoob", "adanurappa": "😁😁😁, burkha lagao... Aur sab Ka valentine nano😝😝😝", "mike_h2888": "Hi Swara, is her name Nazima, Najma or really Nazma(usually not a name)", "sanjaythakur499": "😡😡😡😡😡😡😡 teri mati mari gayi hai", "begumnaaso": "❤️❤️✊✊✊✊✊✊", "abdul_kbr": "👍", "i_am_the_danger_bad_boy": "Pehli fursat m nikal😎😁", "theharshbarot": "अभी आप पार्टी इलेक्शन जीत गई । अब तो नोटंकी बंद करो। क्योंकि अभी आज कोई बिरयानी नही बटेगी। #केजरीवाल #आप #फ्री 😂", "rababdul41": "❤️❤️❤️👍👍", "themintusafi": "Bas kar Ab . If U want to change anything than talk to the gov directly.", "____aamir_________": "❤️❤️❤️🙌🙌🙌🙌", "aakashhaistar": "😂😂 valentine manayenge pahele ye burqe se aazadi to le lo madam😂", "srs_neel": "Aur koi kam to raha nhi", "saifsajid_": "😂🤣🤣🤣", "loveurself001": "U r a traitor swara who stands for traitors, u get paid for it right?", "arshiyan_shaikh_1234567": "♥️♥️♥️♥️", "ab.nasir1983": "😂😂😂😂👌👌👌👍 zaroor InshaAllAah", "mahidk8083": "❤️❤️❤️❤️", "bollywood3615": "Urban naxals", "ilgnaouibrahim": "3alikoum salam mam kaisie ho ❤️", "mo_shadab.s_ansari.9480": "Ok", "rukhsana5830": "🔥🔥🔥", "vickyy.paul": "👍", "qaziimranulhaq": "💯💯", "irfan_ahmed1400": "Aapi ko salam", "unofficialnehru": "😂 🔥💥💥💞", "is_writers": "J blikul", "aslam_anwar_": "😂😂😂👏👏👏", "saud_bin_riyaz": "Well done 💐❤️", "alokmisra_": "@reallyswara 🤣🤣🤣 अरे आंटी गांजा,चरस, दारू भी लेते आना और वो..उँगली में जो फसाया जाता है #चिलम उसे भी लाना दोनों काम हो जयेगा😍रात भर क्रांति होगी...एक नाटक भी खेलेंगे.. तुम तानाशाह बनोगी,हम तुम पर #क्रांति करेंगें..रातभर..गांजा पी के...", "mukku_ali": "🔥🔥🔥🔥🔥", "sufi_shaikh7": "@wtfsohail", "ruhi_amin_official": "❤️", "dr.atharpasha": "👌", "imtalib_chauhan": "G Bilkul pahuchege Nazma appe", "al.iya8019": "Zarur pahuche ge", "khanshaji24": "🔥", "miya_bhai_0.5": "🌹", "mohitprasadlaw": "Instagram k Bando !!! 🤘😃🤘", "pankajawpl": "😂"}