{"dheerendrasinghaniya": "Plz don't spread rumours and fear mongering should be stopped right now why you guys are defaming the image of India on the international table don't you think you guys should make aware people about it plz gives reasons how it will abolish social harmony or against the fabric of the constitution artice 14 , 21 etc you guys are just propagating your baseless communist ideology which can't be accepted in INDIA", "akaashguptaji": "https://www.facebook.com/1313115997/posts/10221486731740361/?app=fbl", "brownskinfragilebones": "Didi Indians ko kuch nahi hoga. Jo hoga, illegal immigrants ko hoga.", "gokulsingh007": "This delhi election use your fingers wisely not like swara bhaskar 😂", "_.lonee._": "@reallyswara bitch.. What do you bloody know about Assam? It's the illegal Bangladeshi immigrants that being put to detention centres..", "hritik6135": "🖕🖕", "stonerz27": "#fucksecularism", "insomniac190": "Every country has detention centres for illegal immigrants. Get educated. And why are you spreading fake news? I'm from Assam, nobody has died here. STFU.", "_imshrishti_": "Aap chinta bilkul mat kariye jaise hi NRC desh mein aayega sabse pehle aapko bhar bhejne ki request main karongi!!! Don't worry at all @reallyswara", "tasleem9169": "Amit sah sahab ke liye do lain 🇮🇳 ham desh washio se agar ankhe se ankhe darti ho to ankhe mud chale jao or agar chunao Delhi ka hare ho to sarm ke mare shaheen bagh chale jao 🇮🇳", "sanctionedsisodia_gaurav": "Insane 👎🏽", "luvnluck1208": "Right.. f*@# Swara Bhaskar and her nonsense. F$#@ your shitty posts. F#$@ your ideology. F@#$ your figments of imaginations.", "_bkavyastic": "Can anybody tell me , who the hell is Arbab??(bhai! Konsa ganja fook ke likhti hi!)", "samaritan_soul_0707": "Also f**k you ... You're entire shit @reallyswara", "girishthakor4341": "स्वरा जी यहां जाहिल लोगो का मेला लगता है । मै आपके साथ हूं । हम कागज़ नहीं दिखायेंगे । इन्कलाब जिंदाबाद", "rushabhkulkarni99": "Democracy ko daalo apne bum Mai ...U are a piece of shit .. #democracy #freedomofspeech", "t_rohini_i": "@reallyswara if you really give a fuck about politeness and right to privacy, have the balls to tag the real person. What are you scared of. People are as it is coming and abusing you left right and center. A vocal and well spoken person like you should be careful about the kind of language you are using. It is very easy to sit and stand in an air conditioned room and comment on the present difficult time and it is a different thing altogether to actually go and help those in need. How are you helping.. by provoking people and creating confusion. Can you not wait for the actual law to pass and then start your revolution when the facts are actually out before everyone. Sick attitude.", "bakulpatel_7522": "The tatti", "eccentric_swarn": "Fuck you swaraa..", "anuragahire9": "Trying hard to gain attention. You're so misinformed.", "ayush29874": "When u dont know laws the basic amends of the law but u need to gain attention by any means possible do u even have a slightest clue what a resistance is for its for the betterment of the people and the country but u won't get it", "chitru98": "U will also be placed in detention centre as u neither have any documents nor relatives or anybody who knows u. And later see urself kicked out of the country", "_._lifeless.__": "😂😂 okay okay nice or kuch?", "im_ramk143": "U half knowledge idiot.. nothing will happen for indians. I meant all of us . Not dividing our people like u do for your own cheap fame and game... Understand b4 voice out 🙌", "anujpathak07": "Aab Sirf Acting Ke liye banne he", "_aditi_121_": "You are shit woman... If you don't have passport voter id any other document then who the hell are you... If u dnt havr passport toh bc dusri countries kaise chali jati hai...", "chuslim687": "Aunty ji Kuch bhi karlo CAA wapas nahi hoga 😁", "choreographer_himz": "Jab ram ji se unke janam hone k sawal pucha gya hai tab aap kaha thi mohtarama ? Bhagwan ram ko khud ke saboot dene padre hai or ab agar jab sabhi se puchtach hogi toh kyu fat rahi h", "_payal_212_": "💕", "ynwa.anmol": "Swara ko acting to aati ni 😂😂😂😂 but she acts dam well in real life . No one knows she dont give a fuck about any one except $$$$ . Modi or no modi i dont want losers like swara chanting hum kagaj nahi dikhayange . Isne jnu se kis baat ki degree li thi ?? Unpadh lagri merko", "say_rad_": "Hey vibrator Swara. Maybe you shud teach your future kids on how to use vibrator. Rather giving us false gyaan called propaganda against CAA. And yes WE SUPPORT CAA & NRC", "raman0165": "Muh mein legi kya randi", "lostboy.5296": "Fuck you too aunty", "suraj_rai_shaurya": "@reallyswara मुझे lgta था कि आपको बस acting ही नहीं आती लेकिन आपके पास तो दिमाग ही नहीं है.... NRC आया ही नहीं और वो बुरा हो गया..... CAA is perfect for India... हमे आपके फालतू के ज्ञान की जरूरत नहीं है....", "alter_tommy": "UrbanMujra Active Haramkali Qwali 😂😂", "freaky_adi000": "Akalmand NRC too Kuch h bhi Nahj abhi or ग्रह मंत्रालय nai announce kiya h ki NRC lagu nahi hoga...patta tuje ghnate ka nahi h...🤣🤣🤣🤣🤣🤣🤣🤣", "aarzoo138": "F u", "amit.del10": "You are mental, go and read what is NRC and Caa , do not try to spoil the country situation", "iamparthamaity": "Chutiyappa karne ilava aur koi kam nahi hai", "kingayushchauhan": "खुले में गन्दगी या गन्दे विचार न फैलाए । अपना जहर ट्विटर तक सीमित रखे । लोग यहाँ हसने और अच्छी बातें करने आते है । तो स्वरा जी हर जगह नफरत न फैलाए 🙏🏻", "pruthviraj_007": "ముందు అసలు caa అంటే ఏమిటి?? Nrc అంటే ఏమిటి తెలుసుకుని మాటలాడు...ఏమీ తేలీయకుండా పోస్టులు పెట్టకు...నీ అనుమతి లేకుండా ఇంట్లోకి ఎవరైనా వచ్చి ఉంటానంటే నువ్వు ఒప్పుకుంటావా...భారతదేశం ధర్మసత్రం కాదు...ఎవడు పడితే వాడు ఒచ్చేయడానికి..మత ప్రాతిపదికన ఏర్పడిన మూడు దేశాలలో బ్రతకలేక అవస్థలు పడుతున్న హిందువులు ..క్రిస్టియన్స్.. జైనులు..బౌద్ధులు.. సిక్కులు..పారసీకులు..వీళ్ళని మన దేశం లోకి రమ్మనడం తప్పా.. అసలు దేశం లో ఎంతమంది భారతపౌరులు ఉన్నారో ఎంతమంది బయట వారు ఉన్నారో తెలుసుకోవడం తప్పా.. ఏది తప్పంటున్నావ్ స్వరా భాస్కర్...ముందు act గురించి పూర్తిగా తెలుసుకుని నువ్వు బ్రతుకుతున్న దేశం గూర్చి మాట్లాడు", "tirelesss_soul_rahul": "Every time you are saying fuck fuck fuck.. that's why no one give a fuck to you ...due to this you have to use your finger🖕", "mantu.s.1044": "Fuck u swara. Don't spread lies. CAA/NRC/NPR will not put question mark to any true Indian citizen, yeah it will definitely going to make difference between a citizen and an infiltrator. Got it!!!😂😂😂", "virajsfirstlove": "The only people who are vulnerable are the ones who are not legally Indian Citizens! If you are... you dont need to worry. If you are not, kindly leave. As simple as that! We are not up for sharing our employment and infrastructure facilities with people who do not belong to our nation. Period!!", "mer30vas": "BJP /RSS thrives in chaos/killings. From godse to godhra to kandamal to JNU attacks it thinks violence keeps it in power. It needs enemies real /imaginary to be alive & relevant. Like pak/JNU /Muslims /dalits/students etc. 😐", "pulkit_soni_27": "Swara ye to bta de ki itni nautanki karke ke liye paise kitne milte h", "rounakdesai": "The Politeness is the only reason you're alive . Stop being a member of the Tukde-Tukde gang or we will leave you in a state where you're begging for politeness.", "amdikomdi": "@reallyswara if it will put a question mark on people staying illegally in India don't fool people by calling 'indian'....the definition of Indian citizen is he or she which is legally staying and can produce atleast two people who can say they r indians...if someone can't produce dat they r non indians as simple as dat ...dont fool people don't fool people....get well soon @reallyswara", "sara_lawford": "You can do better than this. If you really want to do something for the community there are tons of issues which you can address instead of spreading false news", "nirmal.dxt": "धंधा मंदा चल रहा क्या मैडम ??? कुछ और भी तो कर ही सकती हो आखिर जे एन यू में जो भी सीखी हो वो भी तो कर सकती हो ।", "md_razi__": "Ara ke anarkali Ko Ara ke Shaheen Bagh ki zaroorat h...", "rkawediya": "You dare to travel against the tide. I really appreciate your courage. Democracy in India is live by person like you. Hats off.", "johnnydsouza278": "Sounding like a *", "shekharshinde_": "Fuck you aunty", "justforfun007__": "CAA is a good step. We support our PM and our country. Plzzzz janta ko bardhkana band karo only for some popularity.", "concormanish": "अरे इसे कोई पिक्चर में काम दे दो या पार्षद का ही टिकट दे दो", "soniaditya1689": "Isa koi kaam nahi hai logo ko bharkana ka alava nrc to hoga humhara bolna sa kuch nahi bigraga tum hara pass bhi paper hai hai na hum bhi detention centres ma raho gi bahan ki lori", "h.sinchan": "Swara ji you questioned where are those infiltrators ? You couldn't find them .... My humble request to you pls come to West Bengal ....I can promise you ,there are thousands .", "im_ansari_17": "याद रखना", "vaibhavagrawal001": "29 have died natural death due to illnesse and by this the illegal immigirants should be kept away and anyperson who comes in our country should have a process paper not directly slip in our country stop spreading lies", "drmani8819": "s.b.you are m.c.", "toyasiin": "❤️🔥 reallyswara", "ha_m_vhi_hu": "Who the hell are you. Na apka koi dharm h na koi iman kbi congress k liye rally krte ho kbi left ke liye. . ho kon ap ??... Bs bollywood m thoda sa role krke fame pa liya to log dekhenge aa jate h and u think u r a fighter.. nobody is taking you serious... Ap apne hi zo e", "fir.aag": "Fsck politeness by kicking swara's putthha", "ahmedaneesa": "All to the people!! Whats with the lipss..! 🤔", "cooladnan4102": "❤️", "puneet_abrol": "Awara baskar", "jake_green58": "Good those people are a burden on us anyway. Lazy fucks with no education, don't even wanna work just looking for an easy way to make a quick buck. Those ppl should be put in detention centres. Population is sky rocketting but no one wants to educate those people to not have many kids or how to live a healthy life. But these ppl who r only trying to become popular will give bhadkaun speeches and brainwash them . Kuch acha toh sikhao logo ko swara ji. Ppl like you are the reason there is so much unrest. Fake propaganda", "niranjan.ca": "U have not answered my question on kashmiri pandits massacre", "ashu_sanchihar": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "angel_khan333": "More power to You 💪", "rinky211": "Are chutiya nrc aane to pehle se hi chutiyapa chalo kar di tu to", "amitmaheta1": "Ungali kar.. Ti... Apni... Des ki rahne de", "skkdesi01": "Why are u spreading hatred n insecurity among people ???", "dreamyhachi": "*the adivasis and tribals were the indigenous people against whom Hindus committed atrocities and still do to this day. And just like Hindus have bad and good in them, British and Mughals too. they did a lot of good things and also a lot of worse things. the problem is when we put the lens of religion and see everything through this. don't forget the Godhra riots of 2002 when innocent Muslims were killed and raped. Same happened to Kashmiri Pandits. so u have to look at all angles.", "aman_kattal_": "Tukde tukde gang ⚔️", "nivant__": "C'mon #stupidbhaksar stop this....it seems a small girl asking for attention ..we all know you don't make a shit of a logic...", "bipulshukla": "Bakwaas ! Rumour spreading! Baseless arguments. Please get the facts right.", "alom_001": "😍👌", "debudev80": "Katuyo se hi chudna hai to bol tujhe pakistan me chod ate hai jab mulla teri chut chatenge tab bolna", "elhaaaaaaaaaaaaaaaaaaaan": "Arnab*", "mistiqex": "More power to you @reallyswara 🙌", "alokmisra_": "अंटी नम्बर1🤣🤣🤣🤣🤣", "sarkarkulkarni": "Kuch b kr lo madam ji ab kuch nhi hoga now CAA-NRC is constitution", "still_surching_life": "Madam hope so your against of law , others wise last five years I am notice your against of BJP or Mr. Modi((PM)) . Because before that In UPA era I am very fan of your movies but now ...... still wait for your movies rather than news bits 💆‍♂️💆‍♂️💆‍♂️ please save.... but still entertain your fans also ... Hindu fan’s..... please", "i_divyanshh": "Jab Jamia mai ghuske police waale pel rahe the tab yahi ro rahi thi😂😂", "chanchalthetinu": "Jao Bhai permission de di madam ne ,talwaar utha lo ,katle aam mcha do, ab politeness ko fuck kr do", "swril_jain": "I thought you have not another project right now so you spread rumors for cheep publicity 🔥👏🔥👏", "purendrasrivastava": "Mam padhi likhi ho ki nahi......😠😠😠😠😡😡😡😠😠😠😠", "swapnil.k.singh": "निहायत है बदसूरत लग रही हो आप इसमें भी। बैंक में नौकरी ढूंढो शायद ज़िन्दगी चल जाए आगे आपकी। कब तक मोदी मोदी के नाम से रोटियां कमाओगी अपने लिए", "amallick1991": "She is fucked up", "bad.366": "Full support CAA and nrc", "abhishekmh": "😅😅😅😅😆😆😆😆😆😆😆", "nikhil_kapoor_1234": "Protest for Nirbhaya", "sarangapani_bhuyan.01": "Please don't spread fake news and your f***g propaganda about Assam. First come to Assam and see. Stupid women. Just shut your fu*** poisonous mouth up... Problems of Assam are different than yours. We are against the CAA but reasons are Different than yours. At the same time we need NRC to protect our indigenous People. What you think of yourself. You don't know anything about Assam. You don't know anything about the problems caused by the illegal Bangladeshi immigrants. Just Shut up and fingering yourself... Yes F*** Politeness...", "hows_the_josh_jai_hind": "Desh K gaddaro ko goli maaro saalo ko", "gayaazkhanwaris": "Hmsb apke sath", "priyankasahu50": "Kaam na mile to ye karein...desh Seva..", "tarinimohan": "Swara, I hope you don’t get bogged down by the kinds of comments here, what you are doing is out of love for the country, not any particular individual — more power to you ♥️👌🏽", "alkaseriakram": "Iron lady salute you 💪💪💪💪💪hak hai hamara azadiiiii", "anaseem010": "Good", "piyush26102": "#wesupportCAA and NPR", "ratisarin": "Padhe like gawaar ka best example", "hubaib_saeed": "Iron leady of new india...Swara Bhaskar ji", "nikunj_bhagchandani94": "She is paid from Pakistan.. 💯", "attitude_guy_forever": "Arnab*", "anushav1905": "Please help me fund for my dad's surgery... He is having liver cirrhosis (non alcoholic Autoimmune) and transplantation is required.... Even small help will help🙏🙏🙏... Link is present in my bio", "rathi_aryan_": "Tere pass fokat ka khane ko documents haii...jab ncr ki baat ayi toh kya ga@nd mein baati bna le daal li kua tune?", "faheem.273": "Beautiful picture shoot ma'am", "s.a.e.d_m.a.n.a.f": "👏🏻", "sa.nju4931": "👍🏼", "mr.perfect14370": "Bkwas ourat hai tu...Teri izaat 2 takke ke hai bus", "negative_achar": "(1) CAA kisi ki azadi nhi cheenta , nagrikta Dene ka kannon hai wo lene ka nhi , (2) npr se Kya dikkat hai tumhe sarkar ko data chahiye tumhara , documents nhi mange ja rahe usme, sirf ek paper milega jisme aapko apni kuch jankari Deni hai, (3) nrc abhi Tak aaya nhi , haan aayega jarur aur usse Muslims ko nhi Ghuspatiyon ko bahar nikal jayega. Aap ke Ghar mein koi ajnabi ghus jayega , to Kya aap use rehne denge. Nahi na , ye desh hamara Hain humare liye un Ghuspatiyon ke liye nhi, desh ki security naam ki bhi koi cheez hoti hai Jo tum jaiso ki samajh mein nhi aayegi, apni thodi se popularity ka Bohot galat fayeda uthate ho tum. Filmo mein busy rehte ho na , fir yahan protest karne chale aate ho, I suggest you thoda padh lo pehle is kannon ke baare mein , khud to gumrah ho , saath mein aur logo ko bhi kar rahe ho. Tum unhe sirf ye batate ho ki modi tumhe desh se nikal dega , unhe poora kannon padhkar batao ki ye asal cheez hai kya. Apne paise bank account mein rakhte ho na , us bank account mein Jo apne saree documents deke khulwaya hai , foreign jane ke liye passport , viza banwayenge saare kagaz dikhayenge , lekin phir sarkar agar kuch kahe to , hum kagaj nhi dikhayenge . Bohot badiya 🌹 ॐ शान्ति 🌹", "ubed_39": "Saute swara", "sameer_mehra007": "Get F***ked Swara by millions of ur protesters friends...... frustrated struggling actress desperate for phootage....", "rinkeshgorasiya": "Tari mano bho.......do", "wasim_akram_bunty": "👏👏👏👏😍😍❤️", "sanjay_tomar05": "What the hell ...you know about this alll..👏have you gone mad", "swapnilsagare": "Fu", "vipin8727": "Padhi likhi ya anpad ho...", "vimal6261": "Failure government", "asraanan": "👍👍", "ameer.sidra": "Such a brave step. Happy to see somebody from Bollywood who's so courageous. Others are just hidden in their house hoping nobody will ask them about CAA. Proud of you👏🏻 @reallyswara", "jaf_the_lupin_affair": "Absolutely right miss swara , even i think that this decision of taking down the respect of our national constitution is out bringing so much of pain and suffering inside our whole india , it's targetting the whole justice whole humanity of our india ....our nationality our identity is at stake . We have to be aware and peacefully protest for this .", "satishrustagi": "F##@@ Y&&@&#&", "_rahul._.soni_": "Such a nut.. those who support CAA are illiterate, read the document properly or if you can't then consult some educated person, they will NOT take your citizenship nor ask for any papers.. for NRC govt already gave written sentence that they have not any future plan for NRC to put in constitution..there is no such question for NRC people like swara just wash your brain.", "baddykhan": "🔥 🔥", "zehra_kinza": "More power to you🙌", "iam__mr.khan_18": "Yha bhakto ki jaltii ganndd.. Dekh krr bht mza aaya.. 🔥🔥🔥😂😂👏", "kalpeshkawar": "We support caa nrc npr", "wasim__siddiqui": "God bless", "surenderkashayap": "Bra m aaya kro follower ko achha lgega trp b badegi 😊😊😊😊", "nishant0808": "Apne ghar me kabhi aise hi naagawar ghuspaithiyon ko bulati apartment nhi h khali kya, rubbish u r,, kitni besharam ho jiska khate ho usi ko katte ho..", "abhi_k_jha": "It will totally purify the citizenship and throw out the waste like you out of the country", "bijaykumarrathore": "सभी मुल्लों के मुँह मे मेरा लंड", "prince_vijay_45": "Chal hatt 😤😤😤😤", "rahul_patani01": "Yaar teri ungli dekhe bahut tym ho gaya...dikhana..😂😂", "mkfazil": "😍🔥", "navneet923242": "Sare muslim isko support karenge as pehle se chahe mughals ya British Hindu ne Hindu ki maari hai..ye Sab so called Hindu intellectuals k Karan bhadwe baat kar paate hai..I have a simple question not all Muslims are terrorists..but jitna bhi crime hota hai 90% Muslims hi kyun hai?", "salim_jiva05": "Nrc caa npr pe bahut badia bhashan dia indor mai aapane", "sanjeevparmar55": "F*** you janeman❤️❤️❤️❤️❤️❤️", "mmushrif": "I support you swara mam 🙌🙌", "bawseyasss": "Now they got 51 people who had anti-caa placards from Mumbai Pride gathering which was on 1st Feb, Azad Maidan. Just read in today news. They dont catch people who still do susu besides on roads but people who protesting for their rights.", "mumbaikaradd": "Hope you will get job soon... atleast these types of dirty cast Politics will not be there...!!🤦‍♂️🤦‍♂️🤦‍♂️", "ghildiyalpankaj": "kyuki inka Kota chalta biryani Aur Account walo ki sath😜😜😜😂😂😂", "ali_mansoor_ansari": "Full suport mem", "couplespictures19": "Inko china bhj do 🤣🤣🤣", "asifansari6691": "Proud on you mam...", "vatsal.sharma.501": "🤘🤘👏👏", "saurav.h": "Flop actress. Film mein Kam Nahin mil raha hai", "tushar_kashyap7": "😁😁😁😁", "mukeshkrgwl89": "👏", "caughtinamiracle": "Fuck off Swarna Bhaskar 🙏", "swamiraj2021": "Swara how much charge for one night event with full service. 1 biryany or 500/- #shahinbag", "ab.hi3339": "Cut..Cut..Cut...Overacting... Try next time..", "alpa.upadhyay": "propaganda at its best", "mr_aryanpathak": "Shaheen bagh pr baith jaaa.... Kch kamai ho jayegi teri😂😂😂😂", "theofficialparthsingh": "Thank God kisi ko toh ye samajh aaya. 🤦‍♂️🤦‍♂️ Sarcasm hai Didi. Agree mat Kar jana", "revant.vyas": "CAA nahi jayega , tu nikal #supportCAA", "kinginthesouthindia": "F*** yourself", "momentscatcher_asg": "Second Rakhi Sawant", "krishank198": "Shram ani chahiye thujhe swara bhaskar teri soch par or teri paidaish par thuuu india ka kha kar india mai kama kar india ko girate ho tum log... Tu to example hai saachi namak haram hone ka ..iska award milna chahiye thujhe ..kbi publicly mat dikh jaiyo ..juta hi ayega Varna udta hua .", "asf174444": "I support you @reallyswara", "tayfur_sherasiya": "Proud of u more power to you🔥", "samir_rock__": "👌", "malav.bhatt.946": "2💸💸🔑9 tanki ....👏👏👏👏👏", "tauseef9507": "🔥🔥🔥🔥 lgadi aapne👊👊👊", "__no0bmaster69__": "RR😂", "saima996": "❤️❤️I love you mam❤️", "m3r_tahir": "🔥", "poojajpatel20101987": "Do what you know don't fart shit", "bishnoi_nesu": "Kindly Shut up 🙏🏻", "singh_shubham125": "Apki acting dekh ke meto fan ho Gaya aapka well done good work!!", "chirag_patel345": "Madarchod aurat well tu to aurat jaat pe dhabaa hai itni padi likhi ho ke bhi tu aurat nahi or kuch he hai vaam panthi tare jaisi ko to duniya main kahi bhi rahana nahi chaye duub maar", "bneel9612": "😂", "nautiyalneeru": "Keep it up....ye jo kutto ki tarah barking kar rahe hain ye log non responsible log hain..jo na khud kisi ko bolne dete hain or na khud bolte hain....ye saale jee to rahe hain lekin bhatke hue hain nasha kar karke.", "madara_music": "Are @reallyswara thodi to maryada rakhiye mam 😬", "takshak1987": "Aaj bahut Josh me hai faisal bhai", "tazensiddiqui": "😮", "_aatifshaikh": "🔥🔥🔥🔥🔥🔥🔥", "ashishahuja.6": "But every country does this time to time. Check on the documentation and register the people for better governance. This protest shit needs to stop. Why be scared if you have the correct documentations.", "akay_arora": "feel so pitty for her 😂😂", "xhaikh___sufi__": "Respect form my heart", "virmaniamita": "When you have a platform, spread the truth and not lies. Don’t forget karma is a bitch.", "mr_whistles_m": "Few more days you'll be a laughing stock", "bhaskar_rajat007": "Better u f*** urself", "iamkhalid911": "#fuckyourpoliteness", "agautam167": "Lady your are going to be in our history syllabus soon ❤️", "ennkishore": "👏👏👏👏👏👏👏", "yadav_rolly24": "@reallyswara Fuck yourself you idiot.... None of the Indian will loose there citizenship... If u r an Indian citizen... No one can take your citizenship... Read and educate yourself frst... Living in a democratic country... Dats y u r doing shit everywhere....stop spreading hatred... Stop using this publicity stunt you uneducated moron😠😠", "_marendra_nodi": "wish you react the same on propaganda ,lies, hatred and Crooked news with such filthy Bho bho anchor", "adnan.______": "Dear swara mam pls edit that arbabs into arnab because some shitty person will definitely come and troll you on this thing 😑😑", "zaam_momin": "👍👍👍", "paramjit8897": "Too much of French, is it courtesy your stint at sangli apartments.", "nahul_12345": "Teray abba kee gaand check kar wahin ghusa diya CAA 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "uma_srivastavaaa": "Yes there's violence. So let's do more violence. 🙄🙄🙄🙄 Stop with your nonsense and it's arnab* btw", "bhagathdas": "👏🏼👏🏼👏🏼", "sibasisdutta": "And f*** you", "anpathan68": "Swara you r really brave and intelligent", "asad_khan5570": "💪💪🙌", "agsilverline": "😂😂😂😂🤣🤣🤣 Lady Rahul Gandhi @reallyswara", "rajpootvishal": "kuch aur v kam kar lo madam ji..", "harshraj_bhoite": "🙌", "choudhuryanirudh": "Apni fuddi do", "sufi_._._": "@arnab.r.goswami", "itz_vikas_96": "#i #support s#wara #mam", "panks008": "Please explain how citizenship will be taken.... don't spread rumors...it's not good for democracy and for public harmony.... please....", "sitaaurgita": "Love love love and much more power to you sister. 😘", "abdullah.aligarh": "@reallyswara we are proud of you ❤️;(•‿•).", "silvercordfilms": "Thank you for the repost 🌻", "arshadasadkhan": "🇮🇳🇮🇳🇮🇳👍", "kananbuch": "Ms Dumbo. It's not for INDIANS.... It's for others!!!! Either U are Stupid or U want to make a Fool out of others to run your own propaganda!", "anamika.gautam.102361": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rajputhp_0257": "Swara harami @reallyswara", "ammulala97": "👌👌👌", "saanvi.talwar99": "Sharjeel Imam ki begum 😂😂", "dimplesingh20": "Behen aap sabko bolte ho falaana jagah bhasad chal rahi hai sab pohoncho, aap khud Kyu nahi jaate kahin😌 khud aap tab jaate ho jab sab under control ho.. wo bhi off-site kahin aur candle lekr.💞 Is hisaab se aap logo me or un logo me koi fark nahi hai. Jo khud bhashan dete Hein ki goli chalaane wale innocent Hein hum unko inaam denge or khud gun lekr kahin nahi jaate ! You all are same. Just against to each other. And yes #fuckjnu", "ahmed__maqsood": "👏", "neetusingh3955": "💚🙏", "wideframe10": "Thery forgot to put you Big Silver Hoop.😍😍👏", "suraj.mishra39": "🖕", "mahendermoota": "Why do you oppose CAA & NRC??", "elusive_dutta": "😂", "nvnbrnwl4u": "Have You Lost Your mind, I'm fan of u... But do u have knowledge qhat u r doing? Does #NRC and #NPR were passed by supreme courts? And whats wrong in it when NPR will be passed. I'm totally against NRC. But, also i think their is nothing wrong in NPR.", "jaseem_dxb": "🔥🔥👏", "md__zubair_khan_": "😍😍😍😍😍", "gujral980": "If they are not Indians than they need to fear otherwise why worry", "ajay_devgn_planet": "Dumb swara bhaskar", "iqra_khan0123": "U r real queen of Bollywood or to bs naam k hn.... #dhakadchhori ❤️", "janak_chauhan": "Film nahi mil Rahi hai to ye achha option he😂", "iamsra1": "Heads off mam", "brishtiiiiiixo": "proud of youu (ps it would be arnab*)", "sattymhaske": "You are just a dumb ass...He is @arnab_goswami_republictv", "rohitbabu1299": "डिलडो खत्म हो गया जो माइक्रोफोन यूज़ कर रही हो", "rajatmunshi": "👌🏻"}