{"lean_on12": "Invaders aake kuchh Bana ke jayenge , usse humein kya lena dena. Behen tu hogi uss waqt ki convert, hum Nahin.", "sanjeevrajaofficial": "अभी तबलीगी जमात में बोलती क्यों बन्द है संतो की हत्या पे बोलती क्यों बन्द है पत्थरबाज़ी पे बोलती क्यों बन्द है तेरी साली मादरचोद", "issarrajat": "Famous hone k liye bhaand ban jaao sahi h", "alaykhakhar92": "Tera baap ne Pakistan mai tari maa se Match Khela tha kya? tabhi Tu asi peda hui hai 😂😂😂😂😂😂😂😂😂😂", "mubarak_husein84": "Excellent @reallyswara g", "shikhar_pandey": "😂😂😂😂😂😂😂😂😂😂😂", "khanna0805": "😂😂😂😂😂😂😂😂😂😂😂😂Dum lady I know you want ticket from congress but you worth nothing dumb", "rohit_karki_fcb": "Ye dkhle iski @ashu_bisht_", "udaypoonia": "Baat suno, you don't now about what any of us is less bothered or more bothered about, so keep your opinions and your manipulative facts n words to yourself. You are no benefit for us, stop profiling your shit with our thoughts. You are no better than those whod say anything just to create ruckus and to confuse people because telling a lie again and again to some people that makes them confused. YOU ARE NO GOOD FOR US, WHATEVER YOUR AGENDA IS STOP SPOILING THE PEACE WITH YOUR FAKENESS.", "kunal_thakare_29": "Wohi uniformwale ab kaam karre aur tum jese ghar me bethe ho salo haramio", "terababu92": "Sach m tere liye dill se ek he avj ati hi tu bhot badi chutya orat h", "advimsaiyed": "Excellent"}