{"jayant.8": "Ur people don't sing vande materam. 😵👽", "pp650250": "Apni nautanki bandh kar", "preetieyy": "Fake desh bhakt..swara bhaskar😁😆", "saurabh.gairola": "national anthem modi or shah n likhi h.😂😂.kahi bd m apke sathi log y na bol de ki y vi modi s mili Hui h...esa Mt krro plzz", "im__sailesh06": "Isko laat marke nikalo iss desh se", "ankitdas.ad": "Mai to doob maru...mere se agar itne log nafrat kare to....", "ashu_vyas____": "फ़िल्मों में फ़्लोफ़ होने के कन्हेया के लिए वोट माँगे ,बिचारा बुरी तरह हारा । अब ना boliwood की रही ना राजनीति की । बिचारि स्वरा ग़द्दारों के साथ खड़े रहने का नतीजा भुगत रही हे ।", "jeevraj_bhadanaa": "इसका मतलब समझ आए तब गाना", "viju_salwe99": "Sab sale deshdrohi", "singhkhajan9": "यह राष्ट्रगाणं कन्हैय्या कुमार भी सिखा दे... बहुत जुबान लडखडाती है उसकी😂😂", "ayush_ag_9": "If u really want to freed the country from haters then plz leave the country, gates r always open for u🙃🙃", "sanchit8473": "Bhosdike sare flop log dikhe aj muze😂😂😂", "sunnysing7011": "Ye fake faminist log h jo kuch paiso k lie kuch bhi kr skte h isse achhe to sale vo kattar h kmse km loyal to h ye to bc jis ka khate h usko hi katne ko dodte h", "prashant.bss": "Abe bavli bhes vo rashtra geet he 😂😂😂 school gai k nahi kabhi??? ohh reservation leke pass hui hongi tu to😝😝😝😝😝", "dr.melanin.perfect_": "Tere mu se acha ni lgra, humara vande matram mat gaa jaise humare pm h tere ni saste m bikne vali aurat, ab sadhu k lynching k bare m kch ni bolegi! Bhtt kch bolna chahti hu teko, u deserve duniya ki sari galiya MC", "santoshsunita3": "Dikhawa koi tum logo se sikhe", "singh_ayush01": "Bari manhoos lg rhi ho.", "mystical_bambi": "Dekhawa kyu kar rahi h patriotic hone ka tujhe sab Jaante h bc", "thenameisrishav": "Iss gaane ka insult karwa di😂😂😂", "mrigenpt": "Don't worry even pakistan will be occupied by india", "captain_jacksparrow_113": "Kuch bi drama kr lo bahan, Kagaz to dikhane hi padenge", "harsh_vyas___": "Ye vo hi aurat hai Jab supreme court ne kaha tha ke vande mataram me khada hona padega tab objection utha Rahi thi aur aj chik chik kr gaa Rahi hai vandemataram", "rohit_rahangdale": "Nikal Pakistan randi saali najaayaj aulaad", "v.vja_": "Yahi bolo kise muslim ko gaane", "akashbatra246": "Apne comments padho kitni nafrat karte hain log tmse...Tum jaise log h India ke asli atankvadi", "sheetalsrv": "Nautanki", "record.killers10": "kuch v kar lo kajaz to dikhana padega.. GB road pr v baith jaao gand faar kar kajaz legi sarkar 🤣🤣🤣🤣🤣", "yeah_boy19": "Keep your head high and eyes up.. Go get a class about the posture for a national anthem.. I wish your parents could have taught you..", "vikas.singh8602": "Aatankwadiyo ke mu se acha nhi lgta hmara rastra gaan", "gunjan.kala": "Kuch to akal aye", "anki1675": "Oi swara the rand tab Pakistan se paisa mil raha hai na", "rupesh_ufc": "😂😂😂😂😂😂", "abhilashteotia": "Haraamkhani baar baar niche kyun dekh rahi hai tera kharidaar betha hai Kya Teri maarne ke leye 😂😂😂😂", "iampawanvishwakarmaa": "Beta guitar nhi chalega 😂😂", "indranilsengupta09": "@reallyswara few day before they refused to sing anthem", "wakeup.hindu": "National anthem gaa ke desh bakht Nahi khalaoge", "vishalshekharr": "U r the biggest hater, u will face sedition now.", "anamikasingh___08": "Unemployment k baat kr rhi h isliye toh CAB le kr aaya h woh", "_i_am_v_i_v_e_k": "@reallyswara randi ki aulad tere ko Vande Matram bhi aata hai chutiya aurat", "suchitjoshi199": "@reallyswara i guess u missed saying pakistan zindabad at the end... Because boss harkate toh saari rawalpindi chaap hi hai", "kanishka4023": "Do repee k vedio dalti h nation anthem ki to izzat rkh Teri to h nhi pura India janta h", "bhagva_rang_hindustan": "Tere peeche jo white t-shirt me khada h uske mu me dahii jamaa hai ky?? 😡😡😡 vo Mulla he hoga bc🤬🤬🤬 lekin kch bhi kho kagaz to dikhanr he pdenge!!!!😂😂😂😂", "chibsushma5": "Double faced! Ridiculous! why then kashmir mange azadi? Kam se kam ek baat pe to reh dono side se hmm", "suraj.singh._": "National Anthem toh theek se gaa lo", "rushabhkulkarni99": "Go to Pakistan .. u don't even have patriotism ... U are a piece of shit .. #democracy #freedomofspeech", "rakesh_dhanala": "India kese long live rhe tere jaise jaichando ki kami nhi hai re idhar", "devil.pork": "When and where is your next road show? Even I am interested in vandalising some pubic property👍", "yuvrajsingh_9999": "#We support CAA", "avinashp728": "Isko pakistan bhej do.....", "uday_emo_03": "@reallyswara Teri bahen ko gadhe chode", "snaya_thakur": "Oye dramebaaj tere par ye acha nhi lagta", "dhanraj_dodia_702": "AAP ni maa chudva k bhi ye sab bolna padtA he na kyu JIHADI randi", "y_vikasyadav_": "Abe ja saali nautanki mat kar anti national kahinki", "raghav_sehgal_17": "Please tm toh Mt hi Gao 😑 shrm aati hai tum jaise logo k muh se rashtragaan sun k😣", "logicalsocialservice": "Maderchod nikal yaha se", "niteshmeena1998": "Pheli bat murkh national anthem ko ek particular protocol or instrument ke sath gya jata hai. Matlab jinko pata hi nhi hai ki national anthem ko kese gate hai vo deshbhakt or savidhan ki paribhasa dete hai Samhe on you 😡😡😡😡😡😡😡😡😡😡", "jaikumar6695": "👏👏👏👏", "fairytale256": "Love Swara..", "i_hemant_l": "Ha malum h chl natk bnd kr 🔥", "prabhatkumar9446": "NCC ka ek baccha ko bolegi vah bhi sikha dega tujhe national anthem mein khada kaise ho jata hai", "siddanthpatil": "Tu aur Teri chutiya dimag shabd Deepak kalal ke gand mein", "_samrat725": "Ye sab natak bandh kar aur apne bhaio ko samjha Delhi mei jo aag laga rahe hinduo ko pakar pakar k maara ja raha hai aur Hindu mar raha hai to Victim card khel rahe hai", "airaaaaaaa____": "Fool", "thedollarsharma": "ये क्या गले में फांसी का फंदा लगा रखा है 😂", "p4pritee": "Movie nahi mil rahi isliye political ajmana chahti hai dange bhadkake isme aur ovaisi me koi fark nahi", "saurabhgiri7277": "Kon national anthem ga Raha hai 🤪🤪🤪by singing u r disrespecting it🤫🤫🤫🤫", "arjunam_100": "Yes from the G-haadi haters and from those haters who keep on reading same old fake shit 5 times a day", "bagpacker_lost_in_woods": "Didi you're the hater", "jyotiranjan.matha": "Fake..🤔", "imrj27": "It's haram in islem, hoe can you say VANDE MATARAM?? ALAAH wil punish you 😅😅😂😂", "mehul_even": "@reallyswara tujh jese anti india walo per National anthem accha ni lagta kyu insult ker kahi hai tu national anthem ke🖕", "pragyau1997": "Drama mt kr dikhi na to chppale pde tum pr", "chouhan.kuldeep01": "I support Nrc & Caa", "bhavuk.anand9": "Urban naxal ki nautanki", "akshji655": "Such a shame people in earth is @reallyswara", "vikas__bittu": "Dil m Pakistan h 😂 😂", "iam_amitsoun": "Teri ma chudegi bc", "hajiraaaaaaa": "Go Swara ♥️♥️♥️", "rigoristik": "Atleast have some shame.. you filthy actress.... DONT POST HALF ANTHEM😑😑😑😑😑😑😑 I WISH YOUR PARENTS WOULD HAVE TAUGHT YOU, YOUR FUNDAMENTAL DUTIES OF RESPECTING NATIONAL ANTHEM 😑😑😑😑", "rajatprajapati2016": "bc humko kyun nhi lag raha hai ki desh khatre me hai", "sandy_sandeep20": "Love from punjab @reallyswara mam...👍🏼👍🏼👍🏼🙏🏼🙏🏼", "bhadre_rohini": "Go and learn the meaning of national anthem...", "the_.mystery._": "Kuchh b kr lo HINDU muslim dange to tum nhi kara paogi.... We love each other and upar wala tumhe dekh raha hai", "vatsal_jaiswal_": "Ladies and Gentlemen presenting infront of u all @reallyswara the new graduate from the @rahulgandhi School of Common sense 🤣🤣", "panks008": "Kya baat aj to swara aunty ko Bui desh prem yaad aaya...very gud...laat pdi na lichwade Mei...ab akl thikane aayi budiya ki", "hemantgupta2811": "Bhadvi phele educated ho ja phir Modi ko bolna", "sandipan.chakraborty": "Vag jehadi😂😂😂 Aunty", "mahi.noor_21": "Fake aurat 👎🏻", "prasad85_kiran_k": "😂😂😂", "kushwaha_27": "Vande matram likh k rashtra gaan gaa rahe h gadhe log. Fir bolengay hum desh bachane nikle h😒", "sahil80singh": "According to leftist only they are tax payers!! Har bar bolege hmare tax se desh chal ra jse sirf leftist hi tax dte ho", "photocular_biologist": "Thumbnail mae vande mataram tha... 🤔", "s.pvttacc_": "National antem chal rhi woh guitar bajarha.. 💀"}