{"adityaadi0710": "Kitni gandi shakal haiekdam suar jaisi pura din mullon ke liye bhonkti rahti hai", "its_sanyasi_": "Randi madhar chod", "imohit_gurjar_23": "Bhosdike ha ye sali kutiya ha", "jayant6085": "Lesbian ab bollywood me kaam nahi mil raha naughty america me mil jaye gA", "shivay_shiv1431": "aapki shakal itni gandi hai ki man krta hai Mut du uspe aao kbhi haveli pr😂😂😂😂😂😂😂😂😂😂😂😂", "satishpanchal12": "Swara anti for India without makeup u looks you face stupid i love India u are begging for movies n people watching moveies n u make money", "r_fit_07": "You are an idiot", "honeyfan2020": "Chut saali...", "__.abhishekkk.__": "Isme deepika ko mat ghusa", "sharm_a_njali": "She is anti national and i hate her , she is not outspoken is is bitch who bark about nation becouse they are public voice it's really doesn't mean that they will say anything", "anupammishra596": "Isko bas gali dena aata hai na to sakal hai kam se kam bat to acche Karo", "earth_serene": "Saali desh drohi haramzaadi. Bhagwan kare tereko coronavirus ho jaye aur woh bhi muslims jis fruits pe thuk rahe hain usse ho ya kisi muslim ki wajah se ho. Tu dekhna aise hi maregi. Aur uss din hum log bolenge “ahahahahahahahaha” “haaaahhaaaahhhhaaaahhhhhhhaaaaa” marr gayi saali randi jaat ki", "abhisheksoni4719": "तेरी गांड मार देंगे तेरी आवाज नहीं निकलेगी, समझी रण्डी", "zenab_akhtar8": "@akshatgupta27 haa bhai 2 jamaati the na patthr fekne wale mukesha raana or Rahul rana", "akshatgupta27": "@reallyswara I swear of your masterbation scene mjhe tab patta challa k tum ek flop heroine ho jo apni dukaan chalnne k NRC k debate par challe gaye...even having zero knowledge.....tum bas masturbate k lye paida hui ho...wohhi karo screen pr...play you come between you better focus on your beam. Bht jaldii azzadii mil jayeggi tjhe bhi ...deepika jaise azadii tapsii jaise azadii.", "ms.tikka": "Bruh too much hate in these comments. Tf is wrong w these people?", "modern_awakened75": "Because you make a fool out of yourself and you think it’s cool to go for protests and instigate common people to fight against the government that literally feeds you !! I think it’s time you stfu and appreciate more in life - and if you can make a real difference in the society of India- feed the homeless and hungry with what you can at-least one meal - but don’t feed them to take political advantage out of it !! Bas niyat saaf rakho then nobody would abuse you for nothing !!", "navneetsingh_100": "😂😂😂😂😂😂😂", "hasrab_hasish": "ulti aati hai isse dekh kar yakk", "shubhajit415": "Mam is so good in barking ❤️😍", "anuj_47": "Swara tatti jaise hai", "vivek_padhan__1805": "Fake feminist", "raja.adithya.varma.captures": "Praising prejudiced people has become the norm in this country. You show great enthusiasm to support a muslim guy but won't give a damn about a hindu guy. Its unbelievable to what lengths you play the communal card of Hindu- Muslim just to stay in the limelight", "shaiill": "https://www.facebook.com/MazaqRaatShow/videos/629771100880737/", "rks15b": "Hinduyo mai 5% hongy per ham un ko support nahi kerty , aur muslimo ka to Dherem hi NAFERET k uper hai , Han ho sakta hai 5% muslim achy ho...yehi ferek hai", "raahichauhan": "Kya rate chal rhe hain tere ra+nd", "sundeepcr": "Looser 😂😂", "sengarrps": "Yessss... she's not alone, has many more chutiyas like Raveesh kumar, Deepika Padukone, Kunal Kamra, Gauhar khan, Neha dhupia....Get lost🤗🤗🤗", "nprassin": "Kutiya", "iam_amitsoun": "Aawaj do teri ma ki fudi are ko", "ansh_officialpage3": "Most ch#dakkad aurat of Bollywood, 🤣🤣, hippocrate so called secular kutiya h ye", "anant_sinha": "This is sawaraaaa, dumb as hell and epitome of moronic shit", "awokehindustani": "Many?? You have only been in 4 movies and now you are taking money from congress to act against bjp", "truptichavan_2991": "Chutiya he aur chutiya hi rahegi.", "trptv": "@aiindia Saaray To Bewakoof Anpadh Hai Jo Inkay Kartooton Aur Dogle Pan Pay Comment Kartay Hai....Ek Tum Aur Yeh Aunty(lwara Bhaskar) Hi To Budhhimaan Hai Modi, Shah, Trum, Indra Saarey To Mujray Kartay Hain Ek Tum Log Hi To Smaaj Sewa Kartay Ho.......😜", "hasanansariziaul": "Ek himmat wali ZINDA INSAN 👏👏👌👌😍😍", "bharti_gupta21": "Mtlb women k naam par ...u can shit around and want the people to call it empowernment....b*tches like you spreading hatred against the government and showing wrong path to illiterates...", "sureshkumarsingh1281": "Taking side of terrorist. I also have saw them in this", "yashpan.1": "She is known for being a mentally handicapped person", "manshu2110": "Chutiya . Deshdrohi", "ahmdnzaft02020": "Hil❤️❤️❤️❤️❤️❤️❤️❤️❤️", "riah.afreen": "Love u swara. U r my favorite. U r an inspiration ❤️❤️.", "_gryyfindorr_": "Offcourse u will thank @amnesty coz they were the ones who were not supporting the hanging of the bastards who raped Nirbhaya? I mean how do u live with yourself with these thoughts and people around u. Dnt u suffocate or is that your upbringing? Pity!", "siddu_g_sherikar": "Randish", "_sakhidesai": "Anti hindu and Anti nationalist. You deserve tukde tukde gang because usse sacha panee ki teri auqat nahi hai", "alon.e3047": "Randi madharchod", "mohammedibrahim2074": "Why you cut your hair", "salaskarabhishek": "Its not the matter of speaking out .!! Its about being one sided always..!! And thats y this chinal listen so much from the people she has nothing to do in bollywood noe and if she dont do such type of things to gain attention vtjen she will be forgetten by the people bloody chinal", "faith__wave": "You don't have to fight for any religion. Everybody has their laws and rights india.", "dudeylad": "Even for being Randi @reallyswara", "manveirr": "🤢🤮🤢🤮🤢🤮", "sparklingsoul__": "👏❤️", "ravsa8": "hat", "farheen_5154": "The most fearless lady of India👍🏼 @reallyswara ❤️Immense respect for you always💕", "_taif_abeeha": "So proud of you mam...I'm your big fan...u r just a brave a girl..and speaks out for our rights..to protect aur constitution", "vidita_16": "🤣🤣🤣🤣🤣 You are funny @reallyswara", "kadeerqureshi": "काफिर", "chandan___patel": "हाँ, बेचारी पेली भी गयी है रुबिका लियाकत के द्वारा।😊😊", "mihoney_nagar": "Zaat k barabar b nai he tu didi😂", "gunjan_kala": "Swara ki power sirf Ek community Kay liye hai.... Comments may Dekh lo😂", "ramkumargahlot": "Mam jaiye saheen bag ho rha hai chilao 😂 @reallyswara", "_swati_lohani_": "Sun Meri baat..tune Jo ye Randi rona kata h na sirf kuch paiso ke lia baand kr de ye sb...Tera bhala nhi hone wala ye sb bakchodi kr ke ..aur jyada dikhkat h toh Pakistan nikal le. Teri aur tujh jaise logo ki yaha koi jaroorat nhi. #fake #deshdrohi", "javediqbal8006": "Yes", "the_doctor_46_fan": "Randi ki bachi", "murat_faisal07": "Pretty much 😘😍", "sultankhan4570": "Bhakton ki g main cronavirus ghus raha hai aur bhakt gau mutr pine lage 😂😂😂", "mithil.18": "This people are threat for nation", "ankyankur3": "Shaeen bag khali ho raha h bhutni", "vipul_raj19": "Dhat teri maa ki chut😂😂", "mr_das12": "Abbe Bc Isko Koi Pakistan Chor ke aao...", "surbhighosh6": "@reallyswara you are our pride swara .... But please don't be selective.... Cry for everyone, shout for everyone don't divide the society....", "nikhilchhabraa": "#boycottswarabhaskar", "patelrajrp090": "Aap nalayak ho", "mandakini.09": "Queen of dumbness😂", "amritjoy_murmu": "Kudos to u ma'am really appreciate ur work", "mayank7019": "Document to hai nhi tumhare pass.....📙📘📘📘pehle india ki citizenship lo tum...ye faltu dramey baad mei karo", "amansharmaindian": "Flop actress..d one who r sucessful they r not indulging in such activities😐....", "manish_uk_": "Nautanki mam", "tej_kumar_yadav": "Hatt teri ammi ka bhosda", "aniiiketttt_____03": "Chutiya actress 😂", "neha_its_her_choice": "Ek aur pseudo feminist.....kitna paise khati h ri dalli", "vijayupparapelli": "Anti nationalist..", "gajanan5070": "Fake off swara aunty", "pree2135": "Gandu h saali", "lovelykumar78617": "Unemployed", "simba_thehandsomecat": "Woman with zero knowledge and low IQ.", "askshivam215": "Swara ka nam sun ke suar yaad aa gye . Ek minute........................................................................................................................................aaaa thhooo!. Please brother & sister dont support her for breaking our beloved country Bharat because they are the people who really don't care about what others think of her . Pta nahi ise kisne paise khilaaye hai jo hamare PM ke peechhe hi pd gai hai ,unke khilaf hi rahti hai .isse apna kam to kiya nahi jata or chali politics me aajmane . Priyanka chopra is great example on these type of people, priyanka made us so proud by winning that miss world crown in 2000 and after that she just rocked in Bollywood as well as Hollywood ,and Priyanka did lots of humanitarian work being a Goodwill ambassador of UNICEF .she respects everyone ,she is the pide of INDIA. anpadh swara bs galt jankari deti rhti hai gumrah krti hai mujhe lagta hai ki ise NDTV ka bhadda news Anchor Ravish kumar ne paise khilaye hai isiliye unke jaisa bolti hai . At last i will say to every people that if you really want to follow and like some one ,that should be priyanka type people not her type. Thank you", "kiteretsu_007": "@reallyswara Randi hai tu Teri maa ki kokh pe laanat ha mi", "nibirjyotihazarika": "😂😂", "rakeshsingh9392": "Wo bhosari ka aulaad hai kon jo ye vdo banaya hai.. 😂🤣", "anirudh5581": "बेरोज़गार ओर बकवास कलाकार यही करते है ।देश को गली पाकिस्तान से प्यार । ताकी NEWS में बने रहे", "salman.kasana": "तुम जैसे मजदूरी करते करते मर जाते हो अपनी हैसियत और औकात को मद्देनजर रखकर बात कर।", "dharmesh9014": "Jaihind jai bharat", "anshulturker": "😂😂😂😂😂😂", "whovivkrajput": "Wtf😂😂😂😂😂😂😂", "mega_boyzone": "Lukhhi kahiki", "_.gupta.ji._": "Behn ki lodi badwi kutiya", "akshaykushwaha_317": "Chutiya ha saale", "sainath_tarke": "❤️", "eli_mathieu90": "@reallyswara is just an empty vessel (nothing or ardh wati) making noise.", "ravirajsinh_zala11": "🤣🤣🤣🤣🤣 nice joke", "sa.meer4553": "U r my real life hero😘", "siddanthpatil": "🖕😒", "aryanagrawal.56": "😂😂🤣🤣", "nirali1981": "Pls @reallyswara is so not real , I find het a big wanna be man", "radhika_sharma_516": "Didi ko pta kuch hai nhi pr bss chillana h didi ko 😂or fir khudki tareefe dalni hai insta pr", "sandeepsinghtathgar": "Hindutva terrorist = isis", "prince6283": "🙏👏👏👏", "allshadesofdramatic_": "You are no good to this Nation now! People like you, Kanhaiya and Umeed are Terrorists!", "gargnilesh6": "So very cut", "_arpit__gupta_": "Mujhe to lagta hai @reallyswara ki itni bhasad machane k bad jo movie ye kregi wo flop ho jaegi. Ye bharat ki janta ko nhi janti h", "s_u_p_e_r_j_a_y": "Sahi jagah pe aavaz utha na madar jatt. Galat jgah par bhokne jaegi to hoga. We all saw your interview on the news channel. And the way you speak and spread terror through your fucking social media is shit. Shameless swara", "1998.kaurjassy": "Maine to isse red light area m dekha tha", "liyanah01": "Love you my lady💖 @reallyswara", "sukhvir9319": "Kutia bhan ke lodi haramjadi", "muzamilibrahim7\nVerified": "Verified", "ayushsrivastav11": "What about her charamsukh. We are aware of her. Don't share such fake opinions.", "rajverma12": "Don't agree! She is the one who without going into the depth of the matter and without having knowledge of facts kept upon commenting the issues only to get her cheap publicity..@reallydumbswara", "naghma.perween.37": "👌👌👌👌👌👌", "ashwin_khevariya": "She's also a hypocrite who is fully in support of those with sedition charges. Hates hindus.", "iamfarhanaabbas": "Love you💕💕❤️", "uniteddindia": "देश द्रोही victim card player", "naagapoojith": "Funny video😂😂", "ashish_ben_moncy": "🔥🔥🔥bhaag bhaag aaya Sherni", "krishank198": "Some bollywood workers are good vo bolte hai jb apko politics and chal kya raha hai uske bare mai nhi pata to better hai apna muh bnd rkho ...or thujhe @reallyswara NRC k draft ka kuch ata pata nhi hai ..tere pas koi document nhi hai. . tu is desh mai kar kya rahi hai meri to ye nhi smjh ata. . Tum log fact ka nonsense ka vo juta khate ho apne muh par lekin sath mai. Vo kutte ki dum ho jo kabi sidhi nhi hogi 😂😂", "ayeshaahaann": "Acha lga kese ko boycott hone sa dar nhi ha... Allah aapko khus rakhe agar aap halal soch ke kr rahi he...", "anjum9144": "Really Mashallah stand for right my dua keep u away from 🧿buri nazer Ameen", "amey_khaire": "Did you read the relevant document.. ????", "imvp2510": "Suara baskar😂😂", "speak.on.point": "Ye page jisko tag kia h ye h kon followers to inke h nahi. Women who really wants to change something aren't stupid like you. You only know how to spread rumours. ABP news walo ne ekdm thikse dia tujhe. Ek jagah bolti h merepass birth certificate nahi h to me kya desh chor du dusri tarf bolti h aadhaar to sbke pass h na😂😂 are bkl aadhaar h to tmko kya chiz ka tnsn h aur agr aadhaar tha hi to kyu bola birth certificate nahi h. Bs public ko kese bhadkana h wahi jaanti ho kya? Nonsense stuff krna chorke ghr bethe raho kyuki agr koi movie ya serial me tujhe le lia to koi dekhne nahi jayega. Laxmi Agarwal jesi ladkiyo ko brave kehte h tere jeso ko nahi. 🙏🤣", "bharataltair": "Why u r fighting for these worthless scumbags? Gulami unke khun mei hai, koi fark nahi padega inko. keede hai aur aise hi rahenge yeh.", "ak.ash9309": "Konsa film me hai ye", "mt_memesmumbai": "And for beind an ultimate chutiy@ 😂.", "madhuri9719": "Being outspoken doesn’t mean she is right??? And that she is a woman so we should support her??? Don’t agree with her as she is supporting those that slogan against india ..."}