{"love_life_point": "Lol youth🤣🤣🤣 bhosdike🐷🐷 hai iske sath bss", "bhaisahab1831": "Cat to swada baskad be like- kyaa tatti 💩 paida ho gyi ho tum", "devil.pork": "Nice pussy!! 🔥💋👏", "rishi_rb_bh": "I am jobless...government bekar hai..kitne paise account mai aate hai tere ye sab krne ke??I will do the same surely.bcz mujhe kuch nhi hga marenge kon aam public..kiuki riots mai kunal kamra,kanhaiya kumar,aur aap jaise logo ko kuch nhi hota..ye ghar baith k kamane ki scheme btao na mujhe bhi🙏🙏🙏", "neetusingh3955": "Opsen????", "mehwwwish": "Proud of you!!!!💗", "stark_bill": "😜😀", "singh_katya": "Soch lo..tmhare har kiye dhare par uug aaega....nautanki saali....kuch ata pata h ni..bkwas krne ko kah do...draft kaha h madam...or han.....", "jay_v_7": "Un logo ka thukna bhi aap saf karogi", "akky_dancer": "I salute 👌", "harsh_8864": "Wow @reallyswara Looking gorgeus😂😂😂", "yourdailyfantacy": "😂😂kutti h a", "arnav.333": "Saali aaj se iski pic hi daalnna apni manush sakal mt dikhana @reallyswara", "ausafzafar": "Oh my god! you gotta one, how sweet she is, i heard you saying that u got 3 cats? If yes where are they?", "vidiyo.app": "meowwwww 😻", "shivani_singh6": "Pity this poor cat ...she deserves someone better than this shithole @reallyswara", "terababu92": "Ek Twitte ka kitna logi wo bta 50 rupya duga challe ga", "devil_rocker_md_official": "Poora Comment section sanghiyoo se bhara pada hai isse pata chalta hai ki swara ne inka jeeta haram kardiya good going sis 💕", "alin_a9053": "@longhairedgirl_ tere jaise jihadiyon ko smjhana bewkufiyat hai i was literally socked how u turned the topic of hindu Muslim into something else nd u didn't answered me till yet .. SERIOUSLY you are defending yourself by doi ng so much of BLABBERING.. it LITERALLY proved that you don't have any answer dumbo, regarding the batwara and 1990.. and by doing sweetheart and kiddo you won't be able to proof yourself that you are with a good mental status.. just don't poke BJP ND RSS . Tmlogo ko shrm hi nhi hai tmhe teen talak se bachaya , halala jaise ghinoni pratha se bachaya.. or kehte ho bjp hindu muslim karti hai....or dum hai to batana ki batwara or kashmir se panditon ko kis adhar se nikala gya tha.... bewkuf fuck off Now you gonna be block..", "___pratham.dwivedi__": "The face you make when someone asks you draft kaha he?😂", "shaileshidc": "Theek hai magar yea cat tumhari hai khaer nhi bhi hai toh yea bohot achhi hai.", "seeccoo25": "Can you help get my petition to 99 signatures by the end of today? I started a petition and I need you to sign and share it now. http://chng.it/CZ6CFRMm", "devbothiya": "Camment 😂😂😂😜😜😜😜😜", "smalakar.saikat": "At first I thought riot are created by BJP or AIMIM..But I was wrong.It is created by some hypocrites like you", "shivam123bhai258": "Kainchi la is billi ki aur teri dono ki zuban kaat deta hu", "kavil_the_evil": "Guys issey achcha porn dekhlo", "shiven1718": "Abhi ti ye randi jail me hai", "ravindrachoudrey2020": "Tere Dalle kanniya ko to milne wale hai aazadi tujhey bhi jald meligi", "anayamathur5": "Bahot half jail Ho hogi shayad Aap 🤔", "soumya_shastri1234": "Ab kya apne cat ko caa or modi ka liya bharka rhi ha😂😂😂😂😂", "pranot_cr7": "Ironically I was also 10 years old in 2010. Was someone else too?🤯🤣", "u_tsav_anand": "Nikalo isko desh se bahar , gaddar hai ye deshdrohi kahi ki, anpar gawar kaha kaha se AA jatay hai Bollywood ka naam kharab karny", "ishikhurana10": "@reallyswara she is really a attention seeker. aise to koi jaanta nhi tha, na bhaav deta hai , bechari ko kya kya krna pdta h😂", "random_indian__09": "And your 🐈🐈 symbolises...your anti national , fainted and hooliganism mindset which you have shown to the society..👏👏👏👏👏", "pandeynidd": "Swara Tu to gyo re🤣🤣", "rahulkarnerk": "Bas kar bhosdike tere vajah se kitne log mar gye hi ab bas kar 😡😡", "hinduism_ads": "Tera haal to kutte ki trh Hoga na ghr Ka na ghaat ka. Likh ke Lee lee", "dear.kashish": "You are as brave as no one can", "ratansharma0094": "Nrc draft kaha ha😂😂😂", "sk112345sz": "We stAnd With u Maam U r right We all R LOVE u LOGO KI BATON ME AAKR PICHE MT HATNA 👏👏🙏🙏", "nehuu.2101": "The way you encouraged people to fight... Please come out of your lavish home and be on the streets of Delhi, You'll get you the real truth and people will tell you about it who lost their families, who lost their homes,their properties got destroyed in front of them only but they couldn't do anything..!! Congratulations @reallyswara you maybe got what you wanted hope your career is doing well with Indian organizations and Production houses you work for... Just hope you won't be loosing your family or properties or source of income cz you can't feel the pain of those girl... MADAM TWITTER PE TATTI TATTI KARNA BOHOT AASAN H!! You're a public figure you should be knowing the right choice of words you're using!! Come out of your luxurious lifestyle and please try n visit the streets of Delhi!! I never believed in religions, for me there's only one religion which is humanity, But these kinda statements shows you guys also don't believe any religion these people are neither Hindu nor Muslim they belong to some different religion called \"Terrorism\" None of our religion teaches us this cruel end of humanity 🙏", "rakesh8417": "you are a piece of shit", "im_saranshp_5_3": "Kya mila", "karan_debabrata": "Madarjat behenchod", "aditiagnihotri_": "You bloddy mf, spreading hatred between everyone", "aryat58": "Lodi asali ladaai to Tere jaisi kutiya karati Hai fame ke liye Muslims ko bhadkati Hai iski iski aukaad yaad dilaao Randi ko", "dumb.school_": "Mam aap actress hi thik hai politics Mai kaha uttr gyi .... Wh bhi dabba dimag Leke..... 😆", "reallyrehman": "Justice Murlidhar is best Example of this sentence🇮🇳🇮🇳🇮🇳🇮🇳", "rohit25666": "Bitch", "kiranroyme": "Have some shame 🐷🐷🐷🐷 ! You know what is real picture of delhi riots! ANKIT SHARMA STABBED 400 TIMES !!!! THEY REMOVED HIS INTESTINE !!!! HIS EYES WERE REMIVED!!! HE WAS STABBED BETWEEN 2-4 HOURS!!!!! “Oh didi to selective secularism wali hai” 👎👎👎👎👎👎👎👎👎👎👎👎👎👎 SORRY DIDI🐷🐷🐷🐷🐷🐷", "jonnysheoran": "इस बिल्ली को वी पत्थर मारना सीखा दिया होगा 🤣🤣🤣", "delhistreets06": "@reallyswara tum sab milke dange hi karwa sakte ho aur tum kya bolte ho muslims ke saath hum dhang se behave nhi karte,wo hmare army officer par tejab daalenge to kya karenge,hum maujpur m rehte hai,yahan aake saari jagah firing kar rhe the,600 hindu the bas maujpur m aur,20000 muslims to kya karte,bakchodi karna hai", "sam_rwt12": "Iss bezuban ki zubaan q katenge tere jaisi kutiya ki zubaan katni chahiye jo gand faila kar bas bhokhna janti hai.....", "sarthak.sengar": "#shameonswarabhaskar", "raj_mandaliya91": "Carrier to bacha nahi ab desh ke tukde karva rahi he..pkaistan se funding aa rahi he na", "__jaspal_singh": "SWARA BHOSDIKAR🙏🙏🙏🙏", "_wintersoldier__": "Unfollw Karo tukde gang Valo ko", "gupta_dwarika": "Chutia... Vaheyat anti-national", "ojvvk": "स्वरा तुम बहुत अच्छा कर रही हो. तुम्हारा सीए का विरोध करना बिल्कुल सही है. पाकिस्तान और बांग्लादेश के मुस्लिमों को भी भारत में आना चाहिए और यही बस जाना चाहिए. यहां गरीबी और बेरोजगारी है तो वैसे ही बहुत है उनके आने से बेरोजगारी और गरीबी और बढ़ जाएगी अपराध और बढ़ जाएगा उसे तुम्हें क्या तुम्हारा तो दुकान चलते रहेगा फिल्म नहीं तो नेतागिरी तो चलेगी. दोनों हाथ में लड्डू रहेगा. लगे रहो.", "pamnoj_insta": "Sach ka matalab bhi pata hai? Rubiya Liyaqat dundh rahi hai", "s_deepak_maddy": "Besharam dildo wali", "ha_m_vhi_hu": "As innocent as 15 years old girl😀", "tuhisadijindjaan654": "Sab mulle hi support krenge isse kyo ye unki hi olaad hai 🤣🤣🤣🤣", "ism605": "ਪਾਸ਼ ਵਧੀਆਂ ਕਵੀ", "sshivam033": "@reallyswara Draft Kaha hai... @imrubikaliyaquat", "mehulpanchal.gujju": "Unhealthy cat", "yahsanullah": "😍😍", "___.___._____._._": "Stand with awara bhaskar", "thatindiangeneticgirl": "Resorting to hate speech such as \" facist f***s \" ( which is entirely inaquarate) and being intolerable of others having opinions different to your exposes your TOLALITARIANISM ( which is what you're protesting against in the first place ). Be responsible with what you share , and don't spark turmoil within your own community. As citizens , ensure your society is peaceful , do not add fuel to the fire by being brainwashed by extremism ( of any kind ) as that will continue to polarise the nation . #forindia #🇮🇳 #jaihind #hatesoffmodi @reallyswara", "_badass__69": "Dilli jali hai to tumhari wajah se hi", "_crazy_prathu_": "#supportcaa", "singh.vishal_jaspur": "Aungli chhap aurat..", "kavitas576": "@reallyswara Kuchh Sharm karo aunty...ye zehar ugal ugal k tumne jo halat ki h Desh ki...tum khud Ko ek jimmedaar naagrik manti ho is desh ka..tum to ek jimmedaar Insaan bhi nhi ho...kyuki jo kuchh hua h itne jo log maare gye hn fir unki jimmedaar tum ho aur tumare jese log hn...kuchh to Sharm karo", "kapills": "सूअर की बच्ची", "mypramod6": "Sab yaad rakha jayega @reallyswara", "aniket.gupta19": "देशरोही है कन्हैया की रासीला है स्वर😂😂 इसको भी डालो जेल में", "thedeepdarksecret__": "Your name should be @toxicswara....it suit's you", "kk475678": "@reallyswara Teri 🖕ungli kategi...😂😂", "ahmadlostjourneyboy": "आज जो बजीर-ए-मांसन्द हैं काल नही होंगे किराएदार हैं जाती मकान थोड़ी है@reallyswara", "malove_praveen13": "Shame on you.... disgusting 😠", "mukulsharma____": "Marwa diya ne 46 logo or banja left party ke dalli or kr apne propaganda mai jo fit hota hai teri hate speech de deke de deke..... Itne logo influence krdiya kisi ke rape hue kisi murder .. police walo pe acid or pathar..... Laashey naale mai mill hai unki.... Tera koie ristedar nhi maara na isliye tu khush hai ... Abhi baaz nhi ayegi yeh sab krne se hume pata hai..... Arey baand krde baand kab zameer jagye paiso ke liye bande bhaka rahi h", "akshay.saretha": "Behnchod swara teri maa ki chut terko entni hi problem hai to desh ki nhi chod deti madarchod or rahi baat Teri ru bha ac m baith kar Gyan mat chod dam hai to logo k bich p aa KR logo ki problem sun modi hi ne mujhe 2 laks ka lone diy hai us bjaha se Mera ghr aa ban paya hai abhi Tak ki koi sarkar me esa kuch nhi kiya or tu madarchod humesh bjp k kilap hi bolti hai mardchod Teri jesi ko to 2minte p k liya bhi desh p nhi rahna chahiye .....I support NRC and caa ghnta Jo krna hai KR lo or swara Bhaskar Teri maa ki chut dum hai to mujhe se mill", "sumukh_hr": "Aunty you have anything to say about the young lady who was raped, killed and later thrown into the drainage? Is your feminism having a holiday?", "__nidhii_": "Why would you even exist?🙄 India doesn't need you", "sumit397": "you are one of the main culprit of anti-hindu delhi riots", "rks15b": "Swara tera Rubika Liyakat , ABVP ny BAND bja diya , yar tumara uper wala Dimag ka khana to bilkul khali hai , ab TV per na dikho..jo thori boht Izat thi , jaisy Rahul ki Arnob k sath interview ny khatem keri, kuch waisa hi tere sath huya Hai 😂😂😂", "sharma_harish0007": "Rubika ji ko fir bulana padega🤣", "abhay_krtripathi": "Hope you die soon and rot in hell #Bitch", "albertmeenawat": "में सोच रहा हु गांड भक्तो को नोबल प्राइज दिलवा दु सच्ची ओर प्यारी gandbhkti कर रहे है 😂😂", "sunil_0461": "Rubika ne kaisi li hai tumhari", "vishuu2689": "@reallyswara atankwadiyo ki mukhiya banana h to pakistan me Jaa ke atank faila vaha mukhiya ban aur border pe mil 👆", "khushiajaz": "Be unstoppable...love you ♥️", "s_u_p_e_r_j_a_y": "Aur ek sach teri gand me ugh aaega", "dhritiman.roy.311": "Yeha bhi Rendiyappa", "mr_m_k_moliya": "Tu bilkul asi hi dikhti he. Muje to lag raha he ki sayad ye teri hi photo he . Jab tera bap teri ma ko con..d.m pahenke thok taha hoga aur galti se vo fat gaya hoga tab jake tu paida hue hogi aur vo bhi dupahar ke samay me", "isharaa_jay": "देश को खतरा मुस्लीम आतंकवादी या हिंदु आतंकवादी से ज्यादा तुम्हारे जैसे सेक्युलर आतंकवादी से है, जो लोगोको भडकाकर भाषण देके भाग जाते है, और मजे लेते है, कन्हैया कुमार तुम्हारे जैसे लोगोका लीडर है, Shame you", "pradeep.shrivastav": "इसकी गिरफ्तारी ज़रूरी है, दिल्ली को जलाने में इसका भी बड़ा हाथ है।", "iam.shivank": "Ye mc h", "thesaffronwarrior": "Isi pussy ko ungli kr rhi thi veere di wedding me...", "adityapandey3954": "Jaise aap ke kiye dhare pr ug aaya👍", "official.femas": "Tumhare Boyfriend{Lover)Pe to deshdroh ka mukadama chalne wala hai.... Kuchh aur jankari ho bata dena.🤣🤣🤣", "n0tori0us_0ne": "Aur kitni controversy me aayegi re tu flop actress, kuch nhi hota to bas dono religion ke logo ko buadkane ka hi kaam karti hai tu, kisi ko desh se nikalo ya na nikalo, lekin is deshdrohi ko to sabse pehle nikalo", "rominpatel06": "Isse koi nikalo re india se and Pakistan bhej do fir pata chalega isko", "great_tunisia.official": "बिल्ली की सकल देख कर रुबिका लियाकत की याद आ गयी 😂😂😂😂😂", "ori0ns": "हिन्दी का कमाल देखिए। सूअरा। अब इसे जल्दी जल्दी दोहराये। क्या शब्द बना?", "fashunboo": "WE REALLY THOUGHT SHE WAS OUTSPOKEN AND BRAVE FOR SPEAKING ON SENSITIVE ISSUES BUT DAMN THIS BITCH IS DUMB AS FUCK AND SHE DONT LISTEN TO OTHERS", "itssimmijain": "Kitne paise milte h ye sb bhokne k..!!", "bole_to_raj": "Kuchh to bolo swara", "mehra7451": "Look a like shradda kappor @shraddhakapoor", "karan_tomar_rajput": "Is billi ko apni gand me dal lo 😂🤣", "amit02.ghildiyal": "Kyu swara logo ki galiya khakar tujhe mja aata hai? Jagah jagah aadha gyan lekar jati hai. Itni nafrat mat faila. Kyuki iska asar tujhe hi hoga. Logo ka bhla to kabhi kiya nhi bus hate speech hi de sakti hai. Are chahti kya ho? Politician banna hai kya? Kahi na kahi tum bhi jimmedar ho logo ki hatya ke liye", "hetajatin": "Good to see this cat,,,isike pics daala karo kam se kam tumhari shakal se behtar to hai...bhale jaanwar hai tumse to ma guna vafadaar hogi ye desh ko👎👎👎👎", "dayri007": "रंडिका nbr 1", "_swonkdogehtylno_": "Ab delhi ke dange pe bhi bol live aake rona randi ko aulaad....tere saare baapo ne mil ke hinduo ko maara issliye nhi bol rhi kuch...bhen ki laundi...anpadh aur bhakt nahi hu mei....par tu hai randi issliye gaali deni padi....", "__shiv.thakkar__": "Jaise abhi aapke kie dhare par uga hai sahi hai na @reallyswara @reallyswara", "iam_haiderkhan": "👍👍😘", "basava_bhanji": "Randi madarchod sali", "abhinav_sharma832": "Randi", "abeer_mahadi": "I’m sorry for all the hate comments you’re receiving @reallyswara Just know that we are with you and I salute you for being so brave and speaking up. You’ve earned a fan ❤️ All the best", "nehajaan": "Earlier I thought you have sense to talk but now I think you are the one who is part in aggravating the riots. Go and have full command over the subject first, looks like you are working towards an alternative career for yourself. Now you have this in your karma that you played the part in death of so many people in Delhi. Karma will hit you back, just wait and watch. And for god sake stop your back bak mouth which only gives out shit", "richyics": "Eat tatti bhafkau deshdrohi", "delhibyspirit": "Hahaaa ab Insaan bhi nehi rahe app.", "sameerchandratreya": "You should practice what you preach, Swara. First, it is YOU who should stop spreading hate, especially on half baked knowledge (We saw your interview with Rubika). \"The provisions in law are barbarian..... No, I've not read them..... But go, get the draft from government, because I've not prepared that draft..... We are citizens, we will protest against this law.....it is definitely cruel......no, I don't know the clauses, get them from govt.....\").", "chikki1515": "Iske pichvade par lab dande padege😂😂", "avinashtwr4": "#unfollowswarabhaskar", "p.patel.19": "Lodi sali", "mayankhero_": "Sahi kaha. Tahir Hussain ko hi dekh lo. Kitna bhi fake video bana le. Sach se nahi bhag sakta. ##arresttahirhussain", "sumen_bhattacharya": "India me sabko bhoukne ki ajadi hai tu bhi bhouk le varna kahegi ajadi chhin rhe hai par yaad rakhna tere gande karm ka khamiyaza yehi bhugtke jana padega.....", "themadhavkumarmishra": "Is **###** ko bolo apna kam kre!!", "orangefaceboy": "हां , सच घास ही है ! इसी वजह से तू जेल जा रही है तेरे पाप के कर्मो पे सच का घास उग्ना सुरु हो गया है 🔥", "ritzynilesh": "Report karo sab is acount ko jaldi se jaldi band ho jayega acount", "shriya__sehgal__": "@reallyswara i am so thankful you are the only one who is atleast talking about the situation that is not so hidden anymore! thank you for being the voice of zillions . Young youth of our country does not want this!!! i am against the word religion and the people who run it! in no religion is written that you kill or discriminate others. I hope someone can do this as its a genocide happening again and this time no one would like to accept it!", "_het.shah": "Tu kya tera bapp bhi kaagaz dekhaega!🤬🔥✌", "ainoor_786": "Tu khud ke religion ki na hui,tu humari kya hogi !!?👏bas kr teri communist ideology..logo ki jaan se badhke ideology nahi hoti.", "shuv_08": "kutiya pure Delhi ko jala dala", "sumitsingh3432": "Swara madharchod tere gad m bamboo dal ne me maza ayega dalwaye gi", "so.na5458": "Tu bahut embarrassing hai🙌 Unfollowing you.", "ahmednaseermohammed": "👍", "rakeshjain5971": "Mere hindu muslim dosto plz ek request hain is aurat ko jaldi se jaldi report karo ye sirf hum logo se danga chahti hain... Plz iska Instagram ko report kariye.....", "rofficial_reetu": "In thr case of CAA and NRC you dumbo knows nothing except article 14,democracy khatre me hai Secularism khatre me.. Dividing people on the basis of religion. Blah.. Blah.. Wahi liberal leftists ka rona dhona.. Instead she must hunt for why government did this and what was reason... 🤦‍♀️", "thehindutav": "Bc kya kya kategi or kis kisla kategi tu...zeeshan la lund kat liya public ka chutiya kat liya ab bc billi pe aa gyi bc top level chinaal h tu gandvi", "003_addy_": "Puri delhi ki gand mar di is nibbi ne !", "cyberpunk._": "@reallyswara randi hai tu", "ankitchauhan_up81": "Randiii h tu", "theompant": "Iske liye @hindustanibhau bhaiya , please dushman to antarik hai", "singhraj9996": "Khoon pi kr mn bhr gya madarchod, hatemonger, fear monger bloody Maoist bigot. Dalli abhi bhi ise anti muslim riot btane me lgi h, sharam kr le beshrm kitna giregi paison ke liye, rooh tk bech khayi hai", "2pawansharma": "मेरी एक बात मानोगी क्यूं ये फालतू के झमेले में पड़ती हो भगवान ने तुम्हें इतनी अच्छी कला दी है अपना केरियर उस एक्टिंग में आगे ले जाओ और अगर पोलेटिक्स में अपना करियर बनाना है तो सही दिशा चुनो पोलेटिक्स में सर्व प्रथम आप ये ध्यान दो के क्या बोलना है और आपकी बात कहां तक जायेगी और किस तरह का असर करेंगी तो मेरा कहने का सही मतलब है कि बोलो तोल मोल कर और सही फिर देखो आप कहां से कहां जाती हों पूरा खेल बातों की जादूगरी का है बस और कुछ नहीं🌝🌝", "harshit_brahmin_007": "You are Anti Peace... You do paid tweet to kill humanity ....you don't deserves to be an indian", "igyanendrasingh": "There is not enough diffrence between you and rioters , they did for 500 to 1000 rs and you did for extra 2 or 3 zero on that...shame..", "_so_heal_01": "More power to you swara !!! The youth is with you !👍❤️", "arushmrup": "Really shame on you I have admired you and your acting but really now you don't even exist shame on you really the type of Mentallty you have shows your upbringing and the atmosphere in which you r grown up #sickswara shame on you", "ishraqueahmad0786": "I support you mam", "anshit_arora": "Bhag bhadwi", "falaksyed786": "Myaooo", "mri_dula": "Please! Stop! You’ve been doing this for months now. People have died!! Do you get the seriousness of the situation? You are instigating the gullible from your high rise homes. Are you going to get on the streets and fight with them?! STOP! I love my country, and can’t see it burn. Please, stop!", "rohan_pradhan48": "Aaj se teri movies dekhna bnd.. teri acting ka fan tha..pr mjhe ni pta tha asli me tu or jyada drame baaz hai..tere ghr se to koi ni mra to likh le khoob bhadkau post or footage khale khoob .. sharam aani chahiye.. hindu muslim ni mara is desh ka insaniyat mari hai.. or kuch tum jese kuch bollywood k jihadi aag me ghee dalne ka kam krte ho..", "bhautiksuthar": "Vo vidoto jara upload karie apne insta page pe plzz", "__shubhamrathore__": "dear Swara, Spread legs not hate!", "equestrian.3": "FIR😂😂😂... has been watching her videos since long.. and always wonder why the hell govt isn’t taking any legal action against her... she clearly been provoking one community of people ...in one of her video she said removal Act of triple talaq was for demoting muslim community.. i mean wtf ... and she called her self Feminist... big joke u became Swara 🖕🏻 congratulations in advance for your super flop Sheer Qurma", "ankita.goyal.39794": "Rubika is a great lady and you Shame on you@reallyswara", "ashiqashiq2093": "I love this cat", "deepanshi_joshi": "Khaali dimaag shaitaan ka ghar .... Swara Bhaskar 😂", "ahmadkarim129262": "बहुत खूब !! सच है", "i_am__ram____": "Nikal love d", "imshivanitanwar": "Gandi ghas ko hamesha kata jata hai... Jai hind💪🇮🇳", "namrataphoolka": "❤️✊🏽❤️✊🏽❤️", "ap.hunterr": "Real bitch unfollow her", "ajaigupta007": "तुम्हारे हाथ खून से रंगे हुए हैं", "siddharth_cosmosian": "I love you pussy 😋", "ffl_7165": "If you have problems with the country or rules of the country please live in the country you support !!", "pratik.bihari": "🖕", "_prem_thakur__": "😂😂😂😂.or aajadii aa gyii hai abii. Ki gulaamii chlii hai... Aajadii le lo... Logo ko provoke Kr Key publicity stunt toh kr Diya. Bt na kisi Ki citizenship gyii or na Aajad desh main kisi Ko aajadii mili. Bt because of your fake seculerism or provoking se 40 logo Ki Jaan chlii gyii. Shame on u... Reallyawara", "ahir_vijay_vj": "Madarchod pakistan chali ja", "dhruvvsonii": "Aur sunn bey raand tujhe aata kya hai bey acting bhi nhi aati bas Zindagi mein ek movie karli usme bhi chut khujla rhi thi.....abbe hawas hai to Ghar par bajthkar nikalo na picture Ka satyanash kyu Kar rhe ho........saali chudai khaani", "nasreen1690": "Swara aap such bolte ho", "samar_verma69": "🤗🤗🤗🤗🤗😍😍🤗😍🤗😍😍😍😍 maza aaya just puchhing", "ashpat007": "Have fun in jail you dirty Islamic nazi.", "anilprajapat1553": "Filmo me kam mil nhi rha ab pese kamane ke liye kuchh to karna parta h, aap kyo janta ko bhirka rhe ho next year aapko congress ticket de degi😂😂😀 or bta du hati chale bjar kute bhonke hajar,Es khavat se aaapka koi lena dena nhi h, I think you understand 😀😂😂", "a.n.u.r.a.g_007": "Ye kya tatti sa caption diya hai koi batayega....iss tatti aaurat ne 🤮", "rewadikar": "उंगली करना बन्द कर न, जहा करनी है वहा कर उसमे आप अच्छा फील करेंगी", "themermaidtale__": "Aur sahi bola “सच घास है-तुम्हारे हर किए धरे पर उग आएगा” Tumhara toh ug hi aya hai ab intejar karo bas Dange bhadkane walon ki khair nahi", "record.killers10": "tum urban naxals ka baap baitha hai baap.. bc 12 saal pareshan hua jhant v nhi ukhar paaya Opposition. tum jaise naxals ko to l*** k tope par v na jagah de 🤣🤣🤣", "reenapanwar1314": "Acting me to kuch ho nhi paya. Politics me he sahi. Pata kuch hai nahi. Bhokna hai", "chouhanmk95": "मिन्नी मोसी 😀", "surendra_rathore_01": "Aap jaise logo ke wajah se dange hote he itne pe baised mat hoa , baad me zindagi me age jake socho gi ke mane ye kyu kiya tu bade sharam aege", "raahul.0007": ".isko kaam nahi mil raha hai isliye mullo se gaand marwake paisa kamana chahti hai ye.. aisa meta muh me lele🤣🤣😂😂", "krishna15sharma": "Madarchod bhosdiwali kutiya ab tu yaha social media pe dialogue baazi KR rhi h besharam aurat kuch hazar rupiyon k liye fake nationalism aur secularism k naam pe post krke pehle tujh jaise chut se chehre aur gobar ki tarah soch rkhne wale log desh me logo ko ek dusre k liye bhadkate hn aur fir jab dange bhadak jate hn to laudi Sali ab tu Shanti aur freedom of speech k post dalti h Sali kutiya sharam kar Hindu musalman mat KR jiske rishtedar mare hn unse puch jakar ek baar yaha thodi si popularity k liye desh ki Gand mat Maar jab khud pe aegi na tab samajh aaegi tujhe behenchod pehle Ashanti failao uske baad Shanti ka naatak karo ye to wahi baat ho gyi behen ki Lodi k tu khud sex krti reh aur duniya ko virginity ka paath padhati reh sharam kar madarjat sharam kar", "abhinav_singh8005": "TM Randi ho TM muslim se chudwao", "mighty_moron2": "Gaddar", "jaiswal.sidharth": "Hurr", "dgunfsgh": "Chup ker. Dange krwane me tera hath bhi hai. Dua hai tereko iski bhut buri saza mile.", "sania_shafique95": "Waah🙌", "mihirtyagi007": "Swara bhaskar terrorist", "fir__zan": "More power to you!! Everyone in India has the right to express their opinion. That is the beauty of our country... That is our constitutional right.... And that is what keeps us united as Indians.", "whatevershruti": "Shut the fuck swara!", "sanatan__gyan": "तुझे तो कुतिया की फोटो डालनी चाहिए । ताहिर हुसैन , सलमान ये क्या लगते है तेरे भोक ना अब", "anubha4983": "Tu jail jayegi sedition ke case Mai jaldi saali randi", "ricky_7963": "Nothing important just ignore her.", "nitin_0468": "Sab log post ko report karo aur is id ko bhi", "gulabrabbani3496": "https://vm.tiktok.com/bTXDfC/", "alisha_9325": "Masum Logo ki jaane gyi h ...teri hate speech se iske baad bhi teri khujli miti nhi....tere un shanti samudaye k allah ka danda pdega na ...tb teri rooh royegi...", "monijaiswal10": "ज़मीन ही जला रहे है ताकि घास ही ना दिखे ...", "chitra31794": "👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎disappointed👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎you are totally hope less👎👎👎👎👎👎👎i loved you acting , but in real life i just hate you for all this nonsense👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎👎", "indian_celebrities_": "TAHIR HUSSAIN UNDERGROUND HO GYA H , AB NA DALEGI AAP POST ? 😂😂😂😂😂", "preeti.yadav25": ".❤️❤️ U r inspiration @reallyswara", "lakshikachuphal._": "@reallyswara what the fuck happening.g with u 🙄🙄🙄 actually when I saw u in movies like veere di wedding so that time I find u r a good actress 😂😂😂😂😂 but ab tumhaara dhyaan movies se htke politics me aa gya h 😁😁 ya to tumko movies achi nhi milri ya to everything whatever u r doing only for publicity or politics me aane k liye ✊✊✊✊ but madam urf Mohtarma this is india 🇮🇳🇮🇳🇮🇳🇮🇳 or u r doing only one work here 🙏 u r urging to peoples 🖕🖕🖕🖕 or just go and fuck off 🖕🖕🖕🖕🖕", "djdeepakjain": "FIR and NIA investigation against Swara Bhasker, Harsh Mander, RJ Sayema, AAP MLA Amanatullah Khan and others for allegedly making hate speeches. @reallyswara jail ke Hawa khana", "asfak_619": "Me apki bat se sehmat hu", "girish_bm": "NRC ka draft kaha hai Swara 🤣", "_elina_36": "Kanhaiya Kumar pr ab deshdroh ka aarop chlega,, delhi mai jo bhi hua , uske khoon me tera bhi hath hai...ruk toh jaa tre upar bhi deshdroh ka aarop jldii chlega.", "nit_isss_hhh": "These kind of celebs also responsible for riots, not common maan", "harshapahadiya": "Being educated u should knw ki just for publicity u shouldn't support the wrong things", "pratyaksh_satyawali": "Ra*di hai saali bhos*ke mc", "rachiita_sh": "@reallyswara for five minutes of fame she can sell herself. She has no relegion and she is not god fearing. I have one question for this garbage lady. How many people are in her house? Will she open her own home for anyone and everyone ? If she does will she charge them?? This bill got pass in both houses .move on and get a job. Ek movie ko promote karne ke liye they do everything..", "concormanish": "खिसियानी बिल्ली खम्बा नोचे😀", "vikasyadav385": "Comment pado par madam ko serious mat lo... kiu ki inka dimag sahi jaga nhi hai ...", "himanshu.bhardwaj2208": "Jab ratan lal or ankit sharma ko maara gya tab kese jbaan kat gyi @reallyswara", "logicalsocialservice": "Struggling actors ka yehi business hai. Feminism and anti-nationalist... our govt is tolerant but if she would have been in china, she would have been in jail or with muslims have sex with 72 hoors in jannat", "rajeshreesonwane": "Chudel v sath ghar chor ke war karengi.... Par ye to apna hi ghar kha rahi dayan aurat..... Agar kuch bhala naah kar sako to bura v mat karo..... Ek to apni acting sambhalo ya desh...... Desh to sambhalne se raha to aur thoda makeup karke... Apne depressing situation se nikal lijiye", "priojitkeisam": "Pure ghasti hai sali 🖕#arrestswarabhasker", "chuslim687": "🐷Suwara Aunty Pura india aap ke Muh pe chapal marna chahta hai", "shourya_xoxo": "Abe sali communist randi madajaat", "renu.d.sharma.908": "You are a cartoon in the name of a woman ...take your agendas somewhere else 🖤", "deo.amaraja29": "Ye log ek din tumahre jaan ke dushman ban jayenge tab pata chalega.... 😒😒 Tum ek type ka terrorism ka hi kam kar rahi ho 🙌🙁 sudhar jao", "samyra_165": "Ma'am I know everyone has right to speech but this is not the time to post all this why to divide delhite on basis of religion already situation is so bad guys please don't get influenced by anybody who is posting something in the favour of one religion guys smjho city humari jall rhi hai yh mumbai mei aaram s reh rhi Hai this is creating problem for students and everybody else let's stop liking all such post who just take side of one religion because er all are same it's time that all delhite stood together hume nhi frk pdhta khoon yha ka bahey ya vha ka khoon th insaan ka hi hai nh zyada hindu mare ya Muslim mar th desh k bete hi rhe h nh", "indrajitfichthorn6": "Leftist are terrorist # বাল সেলাম😋😋😋", "bhardwajakshay608": "chl bkldi", "jasmine_siddiqui18": "We stand with you#reallyswara 👍 Ab sach mai lgg rha hai inquilaab aane waala hai krantikariyon ko,sach bolne walon ko jail mai thusne aur badnaam krne ki sazish charm per hai.Jab k nafrat phelane wale dangayiyon k khilaf koi FIR koi action nhi..Theek usi tarah jaise azaadi se pehle angrez hum Indians k sath krty thy,per akhirkaar jeet humari hui.Aur iss baar bhi hogi In shaa Allah.Don't worry every true Indian is standing with you nd every fascist is against you 🙌", "vipin8727": "Chinta na karo Kate gi jaban", "aakaashthakur": "#JustSLAYING.", "naveedhussain777": "We are with you mam, keep going on mam.Sach ke liye ladne walo ki kabhi haar nahi hoti. ❤️❤️❤️❤️👏👏👏👏. @reallyswara.", "preetimehtasharma": "Terrorist Swara", "anand8660kumar": "Wah👌🏻👌🏻", "rimjhim1606": "Hum honge qamyab ek din🌹", "cktenny": "You have a huge following. Please don't mis guide your followers by bringing hate to one community.", "hell_oanab": "Maa chuda randi behn ki lodi unpad gawar na talent na kuch pseudo celebrity bhosdiwali yeh bata toone kitno ka lund choosa h filmo mei aane ke liye? Saali sasti randi madarchod apni gaand marwa jaakar", "patil_ganu": "तेरे जेसी सकल है😂 छिनाल😝", "raj_shivaay7": "ankit sharma ki maut pe baunk ab tu...kyu ki maarne wale muslim the", "sudhirraosahab6852": "भड़काओ औरत", "saltanatj911": "😂🤣", "the_dharma_revival_": "All those who have interest in knowing about Sanatan Dharma can follow me. We can together learn about it..no hate🙏🕉🙏 everyone welcome please support. Peace dharma and humanity 🙏🕉🙏", "_sonikasingh_": "Seriously I haven’t even voted, I have no political affiliation, i don’t even live in India but the amount of hatred this women spreads is honestly becoming pain in the ass of neutral Indians like us. Yaar itni bakwaas, itni aag!? Bas karo ab. You have a voice, a platform, if you really care for a change, try doing something good. Like my dad did by sponsoring education of 4 refugee afgan kids, Like people do here in Europe by trying to assimilate refugees. Seriously, do something tangible thats good for the people, just once.", "veer.pratap45": "Koi dhakka mukki Ni krega sab line me lag KR gali do iss jihadin ko ungli vgera koi Ni dalega Kyu vo phle he Dale hue h", "mahmood_shaikhh": "More power 💪💪💪", "starcrossed2244": "🤣🤣👌", "shailesh.jadhav.9461": "Tu abhi Jaldi chaki pisne ja rahi he. Muslim koa bhadkake Dange karva rahi he. Tu Dange karne Vali mastermind. Ishe Deshdrohi koa fasi doa. Iske baje shea 42 log mare.", "anuragv714": "Delhi High Court bench comprising f bench of Chief Justice D.N. Patel and Justice C. Hari Shankaron Friday issued notices to the Union government, Delhi government and the Delhi police regarding multiple PILs seeking FIR against hate speech SWARA BHASKAR, Harsh Mander, RJ Sayema, Rahul Gandhi, Sonia Gandhi, anurag Thakur, Parvesh Verma, and Kapil Mishra, Asaduddin Owaisi, Waris Pathan, Amanatullah Khan. MADAM ab jail me jaane ki tayari kijiye, you are also responsible to burn DELHI.", "jayantsverma": "Ye sirf famous hona chaht h...kyuki iska career to chl na rha....flop hoke yhi sb kregi", "rahul_parihar7503": "#boycottswara", "thevarunvats": "Jail to jana padega jail ki roti khanhi padege Jail ka pani pina padega aab to jail mai jana padega 💩💩💩💩💩🤫🤫🤫🤫", "mirzamateenbeg": "Bilkul sahi mam", "asim2536": "❤️❤️❤️", "saanvi.talwar99": "Jail jayegi tu jihadan", "sameer7430": "Bewkoof Aurat", "the_khan_u_want": "❤️", "___p_s_d___": "वा खुदको आईने मे देखणे के बाद क्या शायरी मारी है 🤣🤣🤣🤣🤣🤣🤣 @_amar_gurav", "dr_ameet_saboo": "Such ghas hai aur swara ??? Any guesses", "mohdshoaib454": "😜😜", "shanti.arya33": "Jab hathi 🐘 chalta he toh kutte 🐕 bhokte he so it's ok Swara, more power to you🙌", "kv_desai": "I will pray for your destruction swara deshhdrohi", "aman_kattal_": "Tera b nubr aayega yaad rakhna ⚔️", "girishjoshi20": "इस ओरत के लिए एक ही शब्द घटिया पैदाइश", "the_time_traveller19": "Tum ko desh ki itni fikra h, fir kabhi tahir hussain pe bhi kuch bol do. Ek LADKI ki nagna awastha mein lash mili, usi drain mein jaha IB OFFICER ANKIT SHARMA ka body mila. Tahir ke ghar uske jale kapde aur undergarments mile. Uss ladki ki nirmam hatya hui. Zuban toh uss ladki ki kati jiski cheekh tujhe aaj bhi sunai nai de rhi. Uska sach, ug aayega. Uski jo hatya hui, jispar tum chuppi saadhe ho, khamoshi se iss intezaar mein ki kab fir tujhe fir mauka milega aur tum firse zahar uglogi. Tumhara koi value nai h. Tum koi nai ho ab. Aur tum kuch nai ho.", "ashishkumar3911": "Report this account", "brar1brar2": "👍👍👍👍👍👍", "nishant_2220": "Dange bhadkane me madarchodpane ki had is aurat ne paar kar di hai", "kafeel.ahmad.18488169": "I salute you", "arpanrc": "Arrest warrant is vry near u bitch. Aapne hindu aur muslims dono ka istemal apne popularity k lie kia. Dhikkar h tumpe. Tu kayar h kaayar, yes u r a coward jo hinduism aur islam dono ko badnam krne me lagi ho bas apne do kauri k fayde k lie.", "ruchi5880ruch": "How do you even sleep at night😔All these murders are on you as well.Your soul will never be at peace after this.You will also go through pains you never asked for and then you will realise what you did to these innocent people.", "mohammedmustafakamaal": "Swara ma’am we are with you.. trust me, aapke upar aanch na aaney dengey... will unite against these evil bjp forces and protect each one of us.. inshallah..", "smartsam2330": "Kutiya khi ki dange Krane wali rand", "caran1758": "Y can't u see such big big stones were thrown from Tahir hussain", "ruhisista": "CAA PADO SUWARA...EK BAAR CAA PADO SUWARA😂", "sidsober6855": "Billi inke jaise dikthe hey aur hamare pm modi sher jaisa hey!!Bharath mata ki jai🇮🇳", "sspkudla": "What you got by making hatred video on dehli violence. You should be arrested.", "nehal_revankar_": "Boicott her movie", "mukesh_daimary": "Hindu muslim ko ladwa k rotiya shenk nw wali aurat....shame on u anti national u haven't even answer the simple questions about the nrc draft and which provisions mentions that the muslims citizenships will be taken away by implementation of CAA the fact is u haven't even read the draft just misleading the poor muslims just for fame ur acting career is over so now this is ur bread and butter n m from assam tell me in which detention center people have died? Just misinforming the masses detention centers were built by the congress government not by bjp government...", "shaziqspal": "@reallyswara we all support you for your spirit to speak up against the violence. 😊 It really means a lot for a public figure like you to speak up by keeping your reputation at stake. Also, let the dogs bark.", "adrearysoul": "@mayuchauhann comments", "vivek_anand985": "Hi swara", "sethi8084": "#arrestswarabhasker", "ruchi_sharma_02": "Yhi tum khud smjho sach ghaas hai orr tum kitnaa bhii logo ko jhuut bollo lekin sach sabse uppr rahega", "rakesh9086kumar": "Muje ek baat ka bta ne lga aap nrc ki spot me Kyu ni ho. Pleace reply. ......... Pleace. Swara vasker hi.", "bhardwajgourav": "@reallyswara You are the one who has spread Violence in my country and made brothers kill each other. You sparked everything in Delhi and went back to Mumbai and kept on posting things. People from both sides Hindu and Muslims you should think that during the violence where was Swara Bhasker, why she didn't come forward and fought with people like she use to say or do in her speech. In real words she used each and everyone of you to create this situation in our country. @reallyswara I pray to god you get arrested soon. #arrestswarabhasker", "gnarang85": "All power to you Swara! You are fighting a very tough battle, just reading through some of the hate messages here have got me all creeped up, and you are probably dealing with way worse than this. Sending you strength!!", "shaheersheikhlove": "Desh jalaaa ke manegi app didi ?", "mantug5388": "🖕🖕🖕🖕", "anshu93_96": "5 rupey ki raand saali", "love_talk143": "Jake phle math sikhh,, 😂Aai Badi gyan denee", "harshika_naarayan1": "Shame on you", "mulyankanmishra": "Piche se sayad koi joro se ungli kara hai dalit billi ki juban nikli huyi hai🤣 @reallyswara", "mishra_smiley": "fake publicity k lie aur kitne dange karvaogi kanhaiya kumar ki nazayaz....khair rhne do tere jaise sb suar nhi hote", "arti4454": "hi Swara billi🖕🖕🖕🖕🖕🖕🖕🖕", "shalini_sthakur": "Same on you", "manvendra__0001": "Salli randi bosde k si sakal ki , tera pura khandan khtam kar dunga khi dikh gyi to , saali kutiya , ata pta h ni kuch leke aa gyi propaganda , madarchod randi ,...", "mdmarufulislam84": "I agree with u mam,किया कहना किया कहना🔥👏👌। देर से ही सही पर जीत हमेशा सच की ही होती है।🇮🇳💪", "meaniket_": "Sabse pehle to aapki hi grass kategi jo aapne kara dhara hai", "alom_001": "😍👌", "noxic_": "तेरी जबान काट के क्या घंटा होगा... जो तुम चाहती थी वो तो हो गया। दलाल", "samrat_rajput1": "Dange karvana is chutiye ka kaam bann gaya hai", "safdar_imam9": "👌🏻", "maryk_7931": "more power to you❤️", "krashu.sharma": "Rubika ne peela ache se", "tanoj__": "Notice mil geyi aunty chutia ..", "manazirahsan190": "👏👏👏👏👏👏more strong to you hamesha sach ka hi aise sath den", "fairytale256": "Love u mam.. nice caption..", "perksofbeingmuslima": "More power to you.. There are very less number of pple joh zulm ke khilaf hai kyuki zulm ke khilad bolna asaan nhi hai but whatever you are doing I really appreciate it keep becoming the voice of oppressors... The world needs more pple like you...", "drut_003": "You know what... just leave the social media as people like you are the ones who promote all these unnecessary riots and make the whole country suffer! We’re really ashamed to have a person like you become an actor...", "thebhakt0": "Dekh Bhai🇮🇳 Yeh (madarchod lawre bhakt)😂😂 log aayenge ulta sidha jawaab yaa sawaal denge toh usse jhagra karne Ki jarurat nahi hai koi BJP IT CELL Kaa aatankwaad 🚩🚩bhi hoga.. Toh mudda bhatkaayenge tum larna mat Bas NO 🔇CAA & NO🔇NRC pe lage rehna.", "shivkrbju2000": "So nice", "avinashs8896": "Amazing ❤️", "_05.16.pm_": "Areee kuch toh shram kar lo mafi maango sab se jo speech di 😡😡😡", "jain__saheb_": "Kya baat...!!🔥", "raman0165": "Aaj kisse chudwa rahi hai swara", "krmanish15": "It proves tum comments pdhti ho...ab toh aur b khatrnak wale honge sali... bsdiwali...tu faltu ka gyan mat chod...bs comments padh aur khud ko gaali de khud se...ki tu paida ku hui...yehi hindu muslim krne ...", "hussain_yaar_official": "We are with constitution, we are with Shahin baagh, we are with @reallyswara 💪", "snehamhra": "IF You Have Guts then Post Something About Tahir Hussain !!!!", "one_with_dreams7": "Desh ko badnam krne se accha ha gand mrwake kama le", "shah_athlete": "🔥", "ishanidutta1969": "😂😂👌👌👌", "lets_wetalk": "जब लोगो को भड़काने और दंगा कराने पर तुझे सजा दी जाएगी तो लाज़िम है के हम देखेंगे, हम देखेंगे..! तुझे जनता से जुटे पड़ेंगे तो हम देखेंगे, जब तुझे जेल भेजा जायेगा, कानून का शिकंजा तुझपे कसा जायेगा, और सरे आम जलील होगी हम देखेंगे लाज़िम है के हम भी देखेंगे", "sourabhgupta3010": "जिसका जन्म हुआ नहीं उसका मुंडन करा रही हो।🤦‍♂️😂😂😂😂", "alokmeena407": "Chal bhag", "balbir_": "Do you ever heard a great quote by ur parents and teachers \"aadha gyan khatarnaak hota hai.\" Swara ji uska best example hai. Tabhi jyada aawaj Kerri hai. She is not a good actress,lady, citizen, Human. Shame on u bandbuddhi.", "harsh.sharma.124": "Iss aurat ko buddhi nahi aaiya ki jab deepika Padukone ko jnu jane se iitna bada nuksan hogya uski movie me .. to yeh to puri tarah se danga karwa rahi h iska to pura carrer kathm kar dange hindusthan wale... Sali terrorist", "a_man_adhikari": "Tu saali Randi Desh me Aag lagwati ho!", "rubykaira96": "Crazy woman 😆", "i._.singh": "Act padhi ho @reallyswara 🤣", "deepikakamatdk": "Don't spread hate just cz u r a celeb..", "prasang_3025": "Rubika liyaqat ne mast jubaan kaat li aapki 😁😁😁 juth mat felavo... itni akad thi to padh hi le ti aap rubika ji ne act paper dikahye the na aapko", "_ruby_1024": "Same on you Tum jse logo or tumare jse ghatiya soch ki wjha se aaj delhi ka ye haal hua h... Logo Ka brain wash kr k Kudh ghr m baith K tamasha dekhne valo m se ho Tum log... Abhi b sharm ni h", "itz_suhailaslam_07": "👌👌👌👌👌👌", "andaz_e_naaz": "Caption🔥🔥🔥", "supreet.hundal": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "sumant_singote": "Seriously In following her was the best decision of 2020 of mine 😊 and @reallyswara stop making this shit , you think breaking hindus and muslims or breaking the people will get you more attention... I am sorry...I must tell you...My country ,My Indian Muslims are not what you are saying on your posts... You are just pouring oil in the burning flames of \"OUR\" people... I think India has given the right to every one can leave the country who has problems here.... Get lost from here then. Good Luck 💐", "akash_srivastav___": "Jab industry me koi pooche na to log kya kya karte hai #justsaying", "kausar3335": "Nice 👌👌👌👌", "a.akshay002": "यह देश तुम्हें कभी माफ़ नहीं करेगा स्वरा भास्कर #unfollowreallyswara", "kapoor.636": "😂", "its_bhargav_dubey": "🖤👎👎👎👎 hate u", "lainjack_68": "15 years ki nibbi", "pawan_ps_": "I wish your father or some other family member should get killed in this type of protest ... It would be a great feeling ... 😊 yes my father is a police officer .. And i am scared ... And sick of watching people like you. ... 🤬", "shahrukh678": "👏", "satyanveshi_san": "To Desi Bonnie Parker with ❤️ Sab hijab hataye jayenge, har chehre ki numaish lagayenge, Sirf satya ka parcham lehraega, Sab dekhenge ....Sab dekhenge !", "jasmine.solanki8": "So much hate @reallyswara so so much hate. So much hate that IB staffer had 400 stab wounds, intestines pulled out and stones throw at his dead body. Yeh hai tumhara hatred ka level. You are a piece of shit and you shall stay like that. I hope you can live with yourself after that and I hope his memory haunts you till death.", "monu_kumar007": "Comments krne wale suno, phele mujhe bhi ye acchi lgti thi but ab ye sirf dange krwati hai, hates speech deti hai, gumrah krti hai, bjp ko hr chiz ke liye blame krte hai aur hamesha hindu muslims krti hai,. Aap sabhi se nivedan hai ki agar shanti chate ho to is bdkane wali se dur rhe hai aur isse unfollow kre🙏🙏🙏", "sapphic.in": "Its amazing how you refuse to be bullied❤️🙌", "shahabdulkareemsak": "Good, u r brave, आई सैल्युट यू", "ganesh___0": "Ur have same size of brain as this cat", "aliibaabaa3268": "बिल्लियों की बातें🔥❤️", "rideordie_sami": "😂😂", "iam_sunitjain": "Aazadi mil gayi? @reallyswara kisi ko nagrikta nahi gayi par logo ki jaan chali gayi! Kya mila aapko ye fake protest karke publicity paane ki? Na publicity mili na fans badhe except Muslim fans! Apne aap ko bech ke barbaad kar liye ho aap.. shame", "shitajali": "👏", "shahbaz_hasan1999": "Tum adaalton se jhut likho,hum dewaaron pe inquilab likhenge.😎😎", "shayer_agni": "♥️♥️♥️", "mr_arsalan_78_": "😍😍", "waqasanwar797": "👌👌", "aiman_firoz05": "✅✅", "sagargangwal": "@reallyswara Ha jarur ugega,or sayad ug bhi rahe he..😂 Sab expose hone vale ho Tu, @kuna_kamra and Kanaiya..!!😊", "al.iya8019": "Proud of u tigress @reallyswara mam💪", "chetan_tiwari9148": "Kitne paiso m boli lagi h tumhari @reallyswara desh ko bech rahi hon iss acha tum GB road p baith k Kama leti 🙌", "thepurenarrative": "Rubika Liyaqat se pitne ke baad kesa laga aapko?", "hasan.khadri": "👌", "_raresoul_98": "When are you going to stop instigating people and let India burn?", "rahuls9188": "😂😂😂😂", "shahjad_raza_0786": "👌👌", "__v.i.c.k.y__04": "Absolutely ryt ma'am❤️ @reallyswara", "mess_of_a_kind": "❤️❤️❤️❤️", "mujmil_49": "Pussy", "kirti_sverma": "👍", "ms_in_imperfection": "Bas karo didi Delhi jala di 2 mahino se aag Ugal ugal ke.Bjp aaj hai kal haregi farso fir jetegi is rajneeti ke chakar mein apne delhi jala di desh jala diya itna bhi aaj mat Ugliye ki Jo log apko Support follow karte hai wohi Marne lage aag mein Bcoz aap to sadak pe nhi rohege pattar khane log honge jo apke wajahse waha honge please 🙏🙏", "aashi_29_singh": "🤗🤗🤗😘😘😘"}