{"rishi_b_theofficial": "58 indians airlifted from Iran. Due to corona virus. Hope they didn't say kagaz nahi dikhaayenge before boarding the flight 😎", "_ravi_.27": "🔥🔥🔥", "ibnb_145": "People are fucking dumb,......they don't look for the culture they were brought up....David Bowie...#justsaying", "vatsal_jaiswal_": "@reallyswara Dange karwa kar khud toh aish kar rhi. Udhar Hindu Muslim dono mare tum logo ke wajah se", "manoj.6234": "❤️❤️❤️", "patelvishvabandhu06": "Tu sali burkha kyu nai pehanti", "radhika_.16": "True😂🤷🏻‍♀️", "earth_serene": "Saali desh drohi haramzaadi. Bhagwan kare tereko coronavirus ho jaye aur woh bhi muslims jis fruits pe thuk rahe hain usse ho ya kisi muslim ki wajah se ho. Tu dekhna aise hi maregi. Aur uss din hum log bolenge “ahahahahahahahaha” “haaaahhaaaahhhhaaaahhhhhhhaaaaa” marr gayi saali randi jaat ki", "shbm52": "I can't wait untill you and Kanahiya are together in Tihar on anti national charges and for hate speech...😝", "chini_ki_mini_duniya": "Happy Birthday love🖤", "vasudhahaha": "!!!!!!!!!!", "sushill_c": "Wish You A Very Happy Birthday. God Bless @reallyswara", "devashreevijay11": "Yes. But you're not decent enough. 😬", "na.gendra713": "Fuck you desh drohi", "abhisheksingh888555": "Kalyugi manthars", "rushikesh_kalbhor__": "👎👎👎👎", "nitin3patil": "Pagal aurat he ye", "fragrant.memories": "Which form of dissent & in which country, (including Pakistan & Banana Republic) attacking law enforcement agency is accepted? You are really lucky to be living in India. If you were to try even 1% of what you are defending, you’d be shot. No questions asked. Period. 🙏", "nehal.shetty100": "Flop junior artist", "badboy_546_": "Worest acter", "sugarplum_giggle": "Tatti kha tuh", "neil.bhatt": "@reallyswara protesters k sth bada khadi rehte hai .kbhi nirbya k mom seh mil lete.#wesupportnrc", "ravi.k_": "Flop actress 🤣🤣🤣🤣🤣🤣", "himanshuu21": "Aunty draft Padh le", "proud_looser_123": "Ja na kutita", "aijaz2213": "U r a tigress....", "mayur__gupta": "Didi tumhari movie nahi chal rahi koi toh are you looking for politics to earn money from?", "ashwathamathecursed": "Finger job kaisa chal ra hai दंगाई भास्कर?", "kr_premx": "U look ugly + u talk shit sorry 🙏🏻", "singh_katya": "For ur kind information mai ni bola ki maine constitution bnaya h...or maine kisi v religion point out ni kiya h....aare sukoon se raho n yrr...kisi v religion ko nikala thodi jara....and one more thing being indian is not a choice or chance....its only being an Indian thats it ...", "darkk__sunn": "#justsaying TMKC, SKMKB", "naghma.perween.37": "😍😍😍😍😍", "ankiyk": "You are the most disgusting thing that bollywood have ever seriously most irritating person at a time for Indians. Just gth 👿👿👿👿👿👿👿", "bitch_plzzzz_stfu": "Anpad lodi padhle thoda", "pritgoyall": "Jobless Aunty logon ko ekdusre ko mout k ghaat utarne k liye bhadkati rahi . Ab jab itne Saare ladke mar gye tow Has rahi hai . Jaise Khushi ka Thikana nahi iss hraamkhor ka", "simra_nkaur999": "Kick off her from here", "rohitprataap": "She was best in doing that masturbating scene in movie ....do that only", "preetspamzu": "Everyone hating on her SUCK MY DICK", "coronavirus.in": "Hi Stay safe from CORONA VIRUS but first from BHAKTH's.", "stark_bill": "🙌😋😊", "rohan._.sagar": "Chutiya Aurat", "tithibanerjeemajumdar": "keya baat...like it", "poojapatel0012": "Gawar", "ffl_7165": "Bitch", "sandy_the_logical": "Sali paiso ke liye apne ma bap ko bhi bech degi", "vikas_aanjna_": "Desh ke gaddharo ko chocolate dedo salo ko😂", "agony341": "Tauba tauba tauba... Sara mood kharab kar diya", "zitchok": "You lack proper education. That's it", "chikki1515": "Abhi bhi Masti gyi nhi hai", "hshjsjsuwiawusiauisis": "The best #wahiyataurat goes to @reallyswara 😍🔥", "niravshah2505": "🖕🖕🖕🖕🖕🖕", "___nick__18": "I can’t wait until U get your dildo back from kejriwal😂😂😂", "shidru_1998": "Aap se hai humith nahi di", "sassykeshyy": "Don't hide", "iamanish_dey": "And i cant wait until you go back to pakistan and never come again.. Dissent with logic is applaudable.. What people like you do is misuse your popularity to create a false hysteria just because you don't like a person and force people into believing all the shits you guys do with excessively and massively wrong and twisted facts and hamari toh saali generation hi aisi hai.. Khudka na research lagate hai na dimaag.. Jo tatti tumlogo se milti hai, bas bharosa kar lia.. #SwaraBhaskarGoOut #TukdeTukdeGang #RandiRonaRocks", "atharv0898": "🙌🙌🙌🙌", "vd2408": "Leave my country! Pay for inciting Delhi riots !", "mimiqueen332": "Me too", "thedev.108": "Oh Mam _ ab to app famous ho hi gayi to ab rahene do ye dhikhawa, chalawa. akhir kab tak karogi, log to log hai apne to news channel k hot sheet pr apna gyan bechne lagi. Agar thoda sa revise kr k jati to sayaad apka gyan sahi ho jata aur bik bhi jata acche dam me. Bas bhi karo, keep blessing ma'am 🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻;😅😅😅😅😅", "__0ld__soul__": "Randi bhaskarbsali", "bhawna_1611": "Dirty way to get famous😂god is faithful he dnt take money to talk and do shit like you...learn spome acting instead...shakal acchi nai hai kam se kam baat to acchi karo..deshdrohi no.19256...", "anish.pant7": "Yes. By Inciting riots and killing people, you've become so patriotic. Communist suara🐷", "cmkadam_": "Never have you spoken good about patriotism and national pride...only complaining..it's an OCD", "risewd_astroqoutes": "Patriotic likha h kya usme ya chutiya likha h mujhe samajh nahi aa raha koi bata do bhai 😂😂😂😂😂kyu k is orat k sath ye patriotic word suit nahi karta haramzadi chutiya kuttiya ye sab ache lagte h 😂😂😂😂😂😂😂", "harshapahadiya": "Yeh India he isliye itna bol bhi pa raevho.... Dusri country me hote to khud ko apki aukat pata chl jati", "real_anushreeemane_nilu": "Deshdrohi 😡😡😡😡", "_al_l_ah_": "#letsthrowacidonswarabhasker", "husnban0": "More power to you ❤️", "dkboss678": ".. चुड़ैल, डायन, तेरी तो लंका लगेगी, थोड़ा vetting.. 👹👹", "nidtwinkle": "Atankwadio ko mummy", "mailanuj25890": "Hat r**nd", "vinayshetty5": "Thu saali.. you were the reason of Delhiriots, leave my country", "qualeheretic": "look at this lodhi media...Muslims were targeted in delhi riots, and next news muslims saved hindu families, they saved temples , who were you saving them from ???", "dinesh.duggal.50": "❤️❤️❤️❤️❤️👍👍👍", "ninja_r.chandan": "Rendy roana band kar..........", "utkrist_varma": "Bitch", "aeni._": "I hope you don't read the comments. Please don't. But if u do. MORE POWER TO YOU🔥🔥🔥", "suru.shamit": "I.N.C.", "prashantsingh.don11": "from today i am going to unfollow u", "sfeddghf": "Desh ke gaddaro ko goli maro sali ko", "shonu_666": "❤️", "huzaifa__chaudhary": "😍", "piyush0312": "Till then u shud go to Pak..ur own Fatherland 😁😁😁", "nvnbrnwl4u": "Tmhara hi shi hai madam, kaam to mil nhi rha hai... Isi trh Govt. k against bolte rho... Kia oya, Koi Party tkt h dede... Sundar v ho or sexy v... #Waynad jese place se ld k jit bhi jaogi... Bs fr yo aish h hai aapki v", "meenalzin": "Want my kid to be as powerful as you guys👍", "saurabh___pandey_": "Ooo bhai saab terrorist posting a post🔥🔥😂😂", "rifhat_____": "🔥🔥", "akki8rules": "@reallyswara tu vo ranjhanna movie ki side actress hai na 🤣🤣🤣🤣🤣🤣", "sandeepjaiswal8237": "😂😂😂😂", "ankitchoudhary_25": "Didi CAA Padha?? Mil Gye Kya NRC m Dravaane shbad????? @reallyswara", "aditya_banti_singh": "Limlight me aaj nhj ho koj desh birodhi tweet kro news me fir se aa jaogi", "shefali.kiran.bhardwaj": "@reallyswara such an idiot women.. Dramebazz😂😂 nalli aurat", "smritipandey952": "@reallyswara se jyada acha reallyawara hai.... Harkte hi aisi h.... Btw @imrubikaliyaquat ne jo lgai thi naa madam bolti bnd ho gyi thi..... You even don't deserve my abusive words miss swara", "mghazi1990": "❤️", "priya.sharmax": "I can’t want until dissent is educated and well read again.", "tanishq__arora_": "I can't wait until Andh Bhakts Have brain right again.", "noturfollowermindit": "She has rightly wrote on her insta bio \"dramebaaz\" ..ek kaam toh ache kar lo madam ..na acting ati na politics ..if just revolting the current govt agenda make your opinion correct .... then arent u just an attention seeker .. i really dunno what ppl like u try to put out ..do what u r suppose to do..if u r just getting a camera to speak..doesnt mean u ll split crap.. #undeservingass", "thatindiangeneticgirl": "🇮🇳 vande matram", "shashank_cunnet": "Waste for society 🙄", "niteshkr077": "Shit face seeing her happy after Delhi roits", "dinks_saini": "Shayad iski ammi ko auweshi ne pela h 😆😆", "s_villageboy": "You bitch you are good for nothing", "_shivamsawnt._": "You are one of those who Instigated riots in delhi because of people like you delhi is burning.God won't forgive you🙂", "sukhvir9319": "बीमार कूतीया दो टके की रडी", "farazzaman": "Too cool ❤️❤️❤️❤️", "rangolididwania": "Farzi 🤣🤣", "_npadhiyar": "\"JNU\" ki randi chinal danga krava rahi hey😡", "firoz_khan2016": "😍😍😍", "drhrehmantaymee": "lots love ❤️❤️❤️❤️ to u", "worldfamouslover2441997": "@reallyswara #shameless #assholeforever", "aali.umar.3": "I salute you swara bhaskar g", "mughalsalman007": "Brave Girl👍", "shivgururatna": "❤️", "jeet_patel_7": "Gaddar", "_wake_up007": "💩💩💩", "shivamx011": "Randi babu randi😁", "i.mahreena": "♥️🔥", "___puneet_tripathi___": "The song better suits you\"bharat me jo desh drohi hai unki maa ka bhosda\"", "shmbrm": "Baby❤️❤️", "bong_guy4": "❤️", "punit_das": "Eek no ki harami hai tu kutiya 😂😂", "a.k.s.h.a.t.m.i.s.h.r.a": "Sali paiso ke liye apne ma bap ko bhi bech degi", "m.me_sharma": "Unfollow kro es koo 🙏 baadi lagi actor hinsa ki jaad hai yeah Hindu ke liye kalan hai yeah", "mridukalpa1978": "Vanom queen", "divya._.dinnu": "🔔Please Subscribe My YouTube Channel", "siddharth._hai": "Ise mood nahi insomnia ki bimari kehte hai", "kafeel.ahmad.18488169": "Beauty and beauty", "ankit8941sharma": "Haha rubika liyakat ne kya bajai h teri anpad jahil aurat", "nehuu.2101": "Patriotic?? Seriously?? These kinda words doesn't suits you... You're more good being a TATTI version on Twitter😂 #justsaying 😉", "aa84433012018": "Desh ke logo ko kyo bhdka rahi h hindu mr rahe achcha lg raha apko", "ashayr27": "U naxalite.. Suar bhaskar", "yuvrajsinh_b": "Motherfucker,", "jayendra628": "😇", "ashishyadavtheking": "Kya re bhosdiwali Randi sali aaj tu kitna marwai", "i_am_faizi_": "i salute ut bravery to standing against wrong and hate ❤❤ keep it up miss❤", "bitchbigheart": "Mat karo bohat manhoos lag rahi ho", "xalxo.s": "Thanks for being one of the loudest voices of Bollywood!", "poonam2622014": "#Arrest Swara Bhaskar", "beingsufiank": "❤️❤️❤️❤️", "piyush_______sankhla_______777": "सुनो,कागज तो सबको दिखाने पड़ेंगे दीदी 😂😂🤣🤣चाहे मंच पर कितना हो काओ काओ कर मोदी-शाह-योगी को घण्टा ही फर्क नही पड़ता।अभी तो 4 साल बाकी,4 साल तक आपको बहुत बार छाती कुटनी है,रोना है,तड़पना है और हमे मजे लेने है यह देखते हुए 😂😂😂😂", "wakeup.hindu": "Lagta hai vibrater dimak me ghus Gaya hai iske😂😂", "ari_pagis": "Bah...!", "iamkamakshi": "Kutti", "nadircazi": "सदा खुश रहो बहन", "teyeanil": "@reallyswara Tu agar mere samne hoti na pta nhi me tujhe kaunsa gali de deta", "mirzamateenbeg": "❤️ So Nice", "anusreeravichandran222": "Lol!!! C grade unemployed actor now on a mission to burn India just for some bucks for survival...Shameless Pimp!!!", "___pratham.dwivedi__": "Draft kaha he🔥😂", "sarfarazalikhanniyazi": "❤️❤️❤️❤️❤️❤️", "vinayak___kamble": "👍", "____siddhant______": "कम्युनिस्ट और देशभक्त? हाहाहा। आप सब के कॉमन पिता 'कार्ल मार्क्स' देशभक्ति के बारे में क्या कह कर गए हैं, पढ़ लीजिए।", "harshitarupani": "🙌🙌", "kskm1029": "superbly superb", "nishantsingh_nsr": "Bhot khush h madharchod dange krwane k bad😠😠😠", "anshul2291": "Pakistani", "pappubhai786786": "Really Swara...I like & love you by my heart..Really you're lovable gye..👌👌🌹🌹👍👍🤗🤗", "itsvivek_4u": "I cant wait until you get support to all my enemies....#panotiaunty", "ayushman7799": "Draft kaha hain?", "the_dharma_revival_": "All those who have interest in knowing about Sanatan Dharma can follow me. We can together learn about it...no hate. Peace humanity and Dharma is the mission Everyone is welcome and please support.😊🙏🕉🙏", "chuslim687": "🐷Suwara Aunty aap toh Propaganda karne me bhi FLOP nikli 😜😜", "niksart12": "❤️❤️❤️❤️👍👍Stay blessed", "imvp2510": "Calling her \"Suara\" is an insult to Suar itself....😇", "fairytale256": "Swara mam, u r the great person , without think for ur career and even without care of ur reputation and u r sacrificing 4 the society...love u swara..", "shetty_21": "You are such a hypocrite lady and an attention seeker😂you cried for tabrez..what about ankit who was surrounded by muslim mobs and murdered?..if u fighting for something...do fight for everyone not for a single person to show your fake patriotism..", "sandhya.jeswani": "https://www.facebook.com/178070549518167/posts/489378298387389/ you should watch this video psycho swara", "rapidblur07": "Act", "viraajkakade": "You f**k off bitch woman hamara desh dharam shala nahi ki kisi ko bhi yaha ki citizenship mile #isupportcaa #isupportnrc", "takshak1987": "Raat ka Nasha abhi aankh se gaya nahi, Saaf dekh raha hai isne raatbhar phele faisal aur ab tahir ko tatti khilaya hai, tatti muh wali aunty", "pogonophile2002": "❤️😍", "rvgupta": "she is not the only one guys there are many of them.", "theinnocentvoice": "What a rioting smile , Aaag lga do mam pure India me🔥", "jai_sewani": "Desh me danga karwake has rahi sharam to aati hogi tuje khud pe 😠😠", "yahsanullah": "❤️❤️❤️", "crazypeople2222": "Jail jany ki tayri KR lo...bhout jald", "jitendrahere": "Gaand me Khille Thoko inke😠", "akkisalampure": "Dance is good For Health😘😘😘😘😘😘😘😘😘🔥🔥🔥🔥🔥🔥", "veer_virat_kohli": "Tere seh achi tao call girl hoti hai ! Sach tao bolti hai. #fake @reallyswara", "110ayan": "Salute to you 😘 ❤️ we love you .. accept our pure Love .and just ignore modi bhakt", "vamini_sethi": "@reallyswara hats off for standing up and taking the lead. I know you don't have to do this. In all likelihood CAA-NRC will not impact you directly. Still you are out there, standing strong, putting nation above everything. 💪 Hope to meet you someday in Delhi / Mumbai.", "pranay4u": "Kya hagi re tu rubika ke samne🤣", "gary_lazarus": "Randi", "awhitedandelion": "❤️❤️❤️", "mr.buttercup_sach": "Ohh laavdi se tuth ki...yeh hatered wale post dalna band kar thoda...aur apna kaam kar... chutiya jaise story dal rahi hai....log idhar ek dusre ko kat rahe hai aur tu apni marwa rahi hai mumbai mein....kuch toh sharm kro", "sameer.samar": "Nice chicken suits", "ishika.barui": "❤️❤️❤️❤️❤️❤️❤️❤️❤️", "vipul_rayka7408": "Gaddar ho tum log chand publicity keliye apna jamir bhul jate ho 🚩", "s_o_n_u_rajpoot": "SHAME ON U MAM... APKA EK VIDEO DEKHA MN BHUT UDAS HUA.. JISME.. AAP CAA K KHILAF.. MULLO KA SATH DE RHI HI... APSE YE UMEED NHI THI MAM🙏🙏🙏🙏", "ultimateprince": "Satyamev Jayte 🇮🇳", "me_tanweer_shaikh": "❤️", "rajput_roy777": "Follow me and gain money", "arvind_singh_0": "Movie nahi mil rahi hai toh stage pe jake bakchodi pelti raho 😂", "xrheen": "Love you for being so brave n most Hindus hate u for being against bjp moves n call u such bad words I feel bad 💔 you're so brave like really really brave damn", "_navyabhardwaj_": "Ok boomer", "bagwan4468": "Desh k liye sahi bolna bhi galat hogaya swara ji ghatiya comment kar rahe hai log", "suzene_khan_786": "Beautiful smile", "truedelitte": "Someone needs to educate u seriously..😒", "vikram_reddiii": "Go n fart", "razamsd": "😍😍", "sultaantipu": "5AM😲", "___got_no_chill___": "Randi ki bcchi", "farooquiirfanahmed": "You are true fighter 💪💪", "uddeshya_gour": "Jma chutiya", "tusharnxxt": "Hey fucker r u borned to Hindu or u mother had a date with Pakistani🖕", "___h.i.m.a.n.s.h.u": "@reallyswara Pakistan ki Pedaishi Randi h tu Tujhe bharat me rehne ka koi adhikaar nahi Azadi chahiye madarchod tujhe Pakistan jaa randi", "varunkrsaxena": "Madam aapne CAA ko padha h ya nhi", "adamjonson70": "I respect your father when he speak so elegantly and intellectual. You seem so arrogant ,Crook and disobedient.", "prince_kr__choudhary": "@reallyswara Aa gai aapna #tuloobai.... human Human Rights ki vakalat krne wali 🤣🤣", "sambhaji_agalawe": "Pata chala h ki tu kis se shadi karnewali ho", "i_m_indian_and_hindu": "सुअरनी🐖", "riyansh6574": "Classic example of empty vessels makes much noise..", "oegenk13": "ASSALAMUALAIKUM ALLAHUAKBAR ALLAHUAKBAR ALLAHUAKBAR", "umesh.m.narvekar": "Absolutely👍", "rachiita_sh": "@reallyswara high high goods from raga.. sari pehen kar indian bante hain..get help and go to rehab..", "vijay.3864": "Bichari swara ki acting nahi chali ...na politics...pagal ho gyi hogi na", "mer30vas": "👍", "grv18_rai": "Lol", "mdumar3546": "Yah right tym to say early morning😀😀😀😀", "mumbaikaradd": "Why she still Burning.... ab to chod do madam.... aur kitne jan ko mawaogi.... aag lagake chup jati ho aur jaise hi shant hoti hai ki chali fir brain wash ke liye.... n why police is still waiting... you should be behind the bars... n to be kept it at Andamaan.... 😡😡😡😡😡", "xx_mr_bitchfucker_xx_": "Paiso ke liye gaand v beech de apna madharchood deshdrohi", "786__aj__786": "I salute you ma'am...", "indian_celebrities_": "144 in Shaheen Bagh🔥 Finally something good is happening and how people living near SB won't suffer😊", "anubha4983": "Your sedition complaint has reached the courts. Ab tu jail Mai azaadi ke gaane gana Randi @reallyswara", "jchatterjee": "You are an inspiration. Just be yourself and make great movies 😊", "khatri2075": "Tu toh gyi..beta", "_.er._jaynilparmar.__": "Case hone vaala hai jald hi...", "abhisharma293": "Deepal kalal+ rakhi shawant = swara", "sadakat8646": "u r one man army...i proud of you...", "vibhu_papa": "You high?? Your eyes are so read.", "i_m_peekay": "Stop being obsessed with this issue only. There are many other worthwhile things in this beautiful life, right? Move on, IMO", "maneeshabhargava": "Oh where are u sawar after a Hindu officer killed brutally and dumped..where are u when petrol bombs and stones were pelted from house of muslims ..secular", "manetheomkar": "Looks high on weed🖕🖕🖕", "chandrima.7": "More power to you", "ha_m_vhi_hu": "Mood at 15 year ??", "shekharshinde_": "Modi 2023 2028 2033 2038 2043❤️", "zahirgshaikh": "You define powerful again for the women of this nation. More to you!", "sharma_harish0007": "Modi🙏❤️🇮🇳", "ashishcp": "I wish you die", "rashmii001___": "Bewakoof aurat faltu ki speech deke dange karwati hai🐖", "successmirror10": "Mulli sali swara khatun", "devanshu_garad": "Bitch you should die like ankit sharma", "kaaaashika": "WORD.", "imansarshaikh": "More power to you❤️❤️❤️", "mr_saurabh55": "Act padh jaake dange bhadkane walo.🤙🤙", "sndipsidhup": "👍🏻💕", "rushikesh_01_": "Tu suar ki aullad hai", "yadavyadav82": "इस देश के न्यायालयों और एकतरफा संविधान लोकतंत्र धर्मनिर्पेक्षता बचानेवालो से, मुझे पूछना था कि.. Ankit Sharma की मौत Mob-Lynching मानी जायेगी या फिर इस पर सिर्फ अखलाक और रोहित येमुला जैसे सलेक्टेड दलित और मुसलमानो का हक है? @reallyswara", "sun_shine.____": "ex bollywood terrorist actress", "nehachirpysingh": "Dissent and discussion is patriotic..spreading misinformation, biased information, exaggeration of facts to the point of being partial,fear mongering and propaganda is not", "sjindiafirst": "Not possible for you as patriots have common sense 🔥", "piyush_tiwari_15": "Tu phele sahi thi lakin ab maa chudwane lagi hai", "naresh_965": "@reallyswara ...yaad rakh tune jo logo ko bhadkaya hai na kute ki maut marega tu sahi bata raha hu .....tune hindu or muslim logo bhadka ke bht galat kiya hai .....padhle tereko isliye tag kiya hai mein ne", "iam_ashukhan": "Bohat kutte bhonk re idhar kaiku Raat Mai Nahi sooye kya", "mfarhan.in": "Nor me dude😊", "rafatkhan10": "👏👏👏👏", "vijay1659": "Teri maaa ka bhi.....", "hamza_y_khan": "Real Indian", "readbetweentheheadlines": "Follow and support my new page", "_aryn118": "Chutia😂", "prabhakarsemwal": "Flop character", "_prem_thakur__": "Or desh Aajad ho gya hai Yaa abii bi gulaam hai. Citizenship ni chlii gyii hogii purey desh main minority ki ..or dil main shantii pdh gyii hogii delhi ko Jlaa Kr. Jahil uneducated log", "rohan_arora_86": "Just Came here to see in comments kitni gaaliyan padi ise 🤣🤣Because She deserves it 👍😎", "gurpreetdadwal": "U r doing very good work mam, respect u", "vikasbagga": "People who are anti your stance don’t even have the decency to use normal language. It’s really pathetic. Shocked to read some of the comments and they call themselves civil and pro Nation. What a shame", "bijaykumarrathore": "भगवान करें जल्दी ट्रक के निचे आके मरे तू", "mamtaanand1010": "So true! @reallyswara You’re awesome Non-stop, fighting for a better place. So proud of you every moment 👏👏👏♥️", "nalinavishwajit": "Proud of you mam🙏", "sarkar_totan46": "Teri aur decent ungli karti reh", "panks008": "Make up ki dukan...ek baar live veere di wedding Wala seen kr de pls ...mza AA jau", "war_machine_aj": "Modi For 2024 🚩🚩🚩🚩", "geet_2481": "More power to you", "eituvij": "It is and always will be we have been celebrating and awarding and practising Dissent and it’s voice for 14 years @rexideasforaction but it needs to a fervour of Patriotism again . You are such an inspiration More more power to you and voice of dissent ..... Bol ke lab aazad hai tere ....", "mr_farooqui_99": "Beautiful😍💓", "thefilmyofficial": "😍😍", "shuklas295": "Randi sali, halaal ki aulad, ammi chod, lund legi mouth👄 m", "mohsin_khan_e": "True Rebel", "_.vlkil._": "Haters and bigots. We understand that u have a price for everything sacred and dear. Your masters and your comments are explanatory Father, mother, sisters along with citizen, national assets, soldiers lives and Nation all have a price and u are the salesmen in 🍊. You guys can disgust a pig . You guys passed the human levels. Congratulations swines.", "masharaturi": "More power to you", "zarashaikh1744": "Superb 🔥❤❤", "fareed8": "More power to u super girl ❤️❤️❤️", "neelpriyadarshi": "More power to you ❤️👍", "aditya_panda_": "Maam jail kb jaa rhe ho aap , bdi khusi hogi hme apko jail me dkh kr", "29kumar92": "You should have been born when britishers ruled. Would have been patriotic then.", "a.n.alavi": "😍😍😍😍", "sanjaythakur499": "Bhag desh drohi tera boycott karte hum", "upadhyay___": "अब पैसा बोलता है, मेहनत का या झोल का है 😒", "chutiya_paaaa": "Lgta h rt bhar chudi h 🤣", "anubhav_anantim": "Wish u a prospering \"ZERO DISCRIMINATION DAY\" ❤️", "sagarcool433": "कटुवों की कुलदेवी", "ramkumargahlot": "Behad manhoos lag rhi ho abey saali @reallyswara", "sana_.firdaus": "❤❤❤❤❤❤", "happiesthumanalive": "😂😂", "___mahakkk___": "Bhaaaaggggg !", "rajshree__bishnoi": "👎🐕", "_royabhi27": "#Tattiauntyswara 🤣🤣🤣🤣", "cyrusdaruwala": "You are the force that keeps so many of us going in this fight 🤝", "rkciviltech": "U r great mam", "mamunrashid8682": "Excellent", "ask.ayush": "Inti gaaliya mat do bechari depression me aakr mar jayegi!😂😂", "krishna15sharma": "Yaha pe frames le KR photo khichwane se tu badi Constitution ki rakhwali nai ho gyi samajh ja is baat behenchod agar protest krna hi h to kyu nai wahi baith KR krti Jo itne Dino se log baithe hn tujh jaise madarchod Jo sirf Instagram pe apna support dikhate hn wo sabse bade madarchod hn bhagwan Kare tujhe itne dande pade police see k Teri gaand Tut Jaye aur tab tujhe azaadi ka Matlab samajh aega", "beingshadabkhan2": "Good @reallyswara diii👍", "_immi_99": "❤️👌", "mohit.mitl": "@reallyswara Bc koi aur kaam hai tumhare pas ya bas pagal ho rkhi ho issi topic ko lekar..Irritate kar diya h", "mahesh_n_vagole": "😂😂😂", "cutesamaira": "Swaruuhhhh baby💞💞💞💞💞", "__nobi_": "Arre harami #arrestswarabhaskar", "aryan.official89": "Oo pagal aurat kuch janti h history k baare m yaa politics k baare m ainvayi mooh utha kar Chali gayi ye Muslim jab kaat rhe h to tera mooh nhi chala pagal aurat", "abhi_312tiwari": "For this to happen...ranga n billa had to depart...i mean feku n tadipaar...", "lainjack_68": "Mallu aunty", "the.woke.indian": "You are completely biased and supports one community..you don't even know their real face,what they did in Kashmir,what they are doing to minorities in Pakistan and Bangladesh,what they are doing in france and London..all they want is sharia and after that all kafirs will either be converted or killed. While doing so they won't be seeing your insta posts that whom are you supporting😂😂", "i_m_sohail_akhtar": "🌹🌹🌹🌹🌹❤️", "chandanshahi5": "ऐसे ही पागल हो जवोगी", "princesss_maahi": "#deshdrohi....@reallyswara....👎👎👎", "dr_foziya": "India need womens like u..Too much strong n courageous...salute to ur guts swara😊", "laddan_romio": "👍👍👍👍", "reyanshpant": "Bhaand", "sumen_bhattacharya": "Dangai felakr maja aa rha h tujhe teri is gandi smile se pta chal rha hai....", "as_if7973": "You r a true Indian . Respected", "troller_hu_bc": "Jitna Mishra Zimmedar H Usse Kahi Zyada Tu Zimmedar H Dango K Liye. Sab Yaad Rakha Jayega.", "pvt.munazzza": "❤ we love you", "sharmasagnik": "Bahut khub", "rahilaparker": "Power to you...Woman of Iron Will..💕", "a_dead_s0ul": "इस दौर ए सियासत का इतना सा फ़साना है, काफिरो को मार कर उनका घर भी जलाना है खुद को डरा हुआ मुसलमान भी दिखाना है..", "shubhamjuly10": "Randi", "vishwajo": "Keep fighting the good fight.. 👏👏 Lots of love to you.. 😍😍", "loyal_lov3r": "Do you sleep in those... 🤣(PS: Just a Joke)", "beingtarinisharma": "You are one of the strongest woman of modern India and times will remember you for your fearlessness. Thanks for being an inspiration in these oppresive times", "lymonds_barry_sujit": "Swara you are really very brave and strong....God Bless You", "gaba2445": "@reallyswara dhara 144 in Shaheen bagh...biryani khane mat chali jaaeo ab. Bahut padegi aunty", "mehtab_1984": "Your smile 🥰🥰🥰", "shadab5518": "You are great👌", "shru2kill\nVerified": "Verified", "faheem.273": "Fantastic", "ahire.nayan": "More Power to You...", "vishwajeet_patnaik": "Aap bwkuf hain...Apko caa ke bare me kuch pata hi nai hai....Be matlab kahin bhi ghus jate ho....😏", "itssoniaonly": "They can dominate or buy thousands of common Indians...But they r still afraid of Swara because she has a brave and fearless heart.", "boogeyman__01": "High asfuck 🤙💥 @reallyswara", "raziulhaq5": "Respect and love..❤️", "vishuu2689": "@reallyswara Musalmano ki mukhiya🤣🤣 aur pakistan ki randi nikal", "priyakumari_7": "This doesn't make you patriotic in any sense.😂😂", "caughtinamiracle": "Hindu Muslim ke beech aag 🔥 lagakar dekho kaise haath mai frame pakadkar baithi hai Kamini.. apne over smartness se news channel par khudko tune chutiya sabit kar hi diya 😂", "shubhamswami87": "N yeah unfollow kr raha hu", "priheheheh": "❤️", "shubhangi_7": "Agreed", "miken7patel_official": "Asshole", "surya_abhishek_": "ABP ka interview dekha apka..mazza aaya merko...😂😂😂", "adv.zeeshan.5": "More power to you", "rani_meeta": "U hv blood in ur hand.. chk .. u r responsible for the deaths for the violence. Remember tht.", "bhaisahab1831": "शक्ल अच्छी ना हो तो काम तो अच्छे कर लिया कर हस्थमुथैन भास्कर", "journosujata": "👏👏👏", "ketanhajare6971": "Soch rha tha iski movie boycott krunga pr koi movie nhi aa rhi iski..sali Berojgar😂", "haris_shaik_": "🔥🔥🔥👏👏", "sunil_meh": "आप बहुत अच्छी है ऐसे ही देश की आवाज उठते रहे हम आपके साथ हैं ❤️", "adv_arif_rawan": "Red salute", "yash_tyagi_official": "Deshdrohi bc ....gaali hi deni chshiye eso ko..jail meik daalo ise toh...jab dkho bkchodiya krti rhti hai sunta koi hai ni gaali hi sunti hai", "athira_rajeevan_": "Hiii brainless uneducated lady @reallyswara 😂😂 get a basic education please before you bark like a street dog 🐕", "_bad_impressions_": "My cutayyyyyyyyyyy❤️", "quadrasneil": "More strength!!!", "sameer_mehra007": "@reallyswara desperately trying to make herself count.. hence the dissent", "sahjahanalomlaskar": "Nice", "5hubham_k": "Iske jaisa berojgaar banna hai muze", "_its_sank_": "5 am 😱😱😱", "kaushik.naman28": "When you are short of sex ad movies , both", "nariman_patel": "V good one @reallyswara . Can ubplease DM/post a clean, front shit of this framed quote, such that can I can store it/forward it etc. Thanks Swara.", "thecunningkaffir": "Case has been filed against you for inciting public disorder. Don't worry madam, you will pay for everything just like Kanhaiya", "rks15b": "AL-TAKIYA won't work", "ahmednaseermohammed": "👍😍", "bhagwan63": "Cute", "truly_aaditya": "वो को तुम्हारे लहंगा के नीचे vibrator है, उसे बंद कर दो। ये चेहरे की स्माइल और देशभक्ति , दोनों के बीच फर्क , तब समझ में आयेगा।", "ashishnale": "You need to be arrest for Riots", "smartsam2330": "Mullo ki Rand h tu unhi se chudwa jakar", "shivamnation": "रंडी रांड साली", "jaipapreja": "U should learn to distinguish between dissent and biased.", "nawabi_ishq7x": "Be honest and strong as you are and keep Brave heart my luv❤️", "raghuveer_2018": "Arrest @reallyswara", "pankajangid087": "में अभी इसको अनफॉलो कर रहा हूं कोन कोन मेरे साथ है 🇮🇳🇮🇳🙏", "aliyamush": "Salute to u brave girl👏👏. Only brave person in Bollywood", "devang0492": "Dangal lady swara", "hbc.07cddy": "I support ..CAA..NRC...🇮🇳", "saankuwqv": "💩💩💩💩", "raviyadav16112007": "Modi modi", "aakashhaistar": "U can't until u will get a movie we know it how shamefully u r biases leftist only wants to divide this nation.", "girishthakor4341": "You are looking so so much beautiful 💕💕", "ansarisadik7654": "@chetan_tiwari9148 pandit ji tel sambhal ke rakho aage kam aayega kuki jb hitler mra tha to sabse phle chun chun ke unke bhakt hi pele gye to us time tum lga lena nhi to bda drd hoga", "the_asifmuztaba": "🔥", "i_asrf": "😍😍😍😍😍😍", "karanboolani\nVerified": "Verified", "sanaullahgnit": "Cute cute", "ie8383710dk": "Ye ek publicity stunt tha, ye bass fam pana chahti hai, isse kuch nhi ptaa CAA or NRC ke bare mai, isse lund kaa ptaa nhi or chali hai blowjob dene, ager footage lene kaa itna hi mann hai tho porn bnane lag jaa fir tere chahne wale tujhe pure din dekhenge..#blowjob", "karthikrobben": "awwwwwwwwwwwwwwwwwww", "abhiii809": "Damdar shakhsiyat...... @reallyswara ek indira ji thi aur ek aap💪 God bless you", "benhur9997333": "👍", "ghanpatipictures": "Chuitya aurat😂", "camelliakumar": "❤️", "phanikumar18": "lovely smily with quote👌😍", "junkhn": "More power to you bravo lady", "vasu_gupta___": "Chal yehan se bsdki abhi unfollow marta hu", "raju_rizwan_khan": "Mashaallah Lovely ❤️", "shivani_doing_tings": "kween 🔥♥️", "vikas__bittu": "Ap Instagram me SB ke comment to pd le ti ho na 😂 hnn koi km to h nhi 😂 pdti hi hogi kesa. Lgta h sb ke comment dkh KR 😂😂😂😂", "__jyoti_16_": "Gud morning mam ...keep going 😍", "thehuman_26": "🍆🍆🍆🍆", "muttupowerstar": "One of stupid..", "satyamnotsanyam": "😍🖤🙈", "art_opsy": "❤hope 🌱", "mritunjay82mri": "Nala", "rohan9617": "💕", "clixsum": "Some martini would work to start the work 🍻", "nagesh2494": "Jail me kiska legi", "burhan_haq": "🔥🔥🔥🔥", "dharmveersambha": "स्वरा तुमको मै बहुत टॅलेंटेड ऍक्टर समजता था, लीडर बनने की चाहत मे तुमने खुदको अपने आप को इतना नीचे गिरा दिया, तुम्हारे घरवाले भी तुमसे नफरत करते होंगे, दंगा भडका ने मे तुम्हारा भी हात है है, तुम देशद्रोही हो, कल तुम लीडर बन भी गई, तो भी तुम्हारा खुदका जमीर तुमको जिंदगीभर कोसता रहेगा...........", "_satarupa": "It still is, btw. But, we will wait until reading newspaper and not Twitter is a way to making informed opinions again. 😋", "ankitp9909": "Tera actor hoke koie mtlab nhi India me Pakistan chali ja....", "bas_trivedii_bachega": "Swara you just say on Instagram. People are affected from the riots . Visit their home . Help them. Hear them out . You are a revolutionary right ?? Doing activism from 15 years ?", "gautam.kumar.5454": "😢😢😢😢😢😮😮😮😮", "drvaru": ".cheap publicity stunts will land u up in jail...desh drohi aurat....apse mehenga dainik bhaskar hai", "k_a_u_s_h_i_k_karande": "Congratulations @reallyswara #seeyouinthecourt 🤣🤣🤣🤣🤣🤣Kanhaiya & you gonna rock 🤟 in court/jail 🤣🤣", "rizvianjum": "👍👍👍👍👍", "aakash5091": "You are very cheap person in the world shame on u bitch", "mukesh_maranara": "❤️❤️❤️❤️❤️❤️ I like", "muhd.ovais": "i v u", "sardarni1092": "👌👌👌❤️", "jahir_hussai": "😮❤️angel", "layalakhan": "UGLY AF😂", "dv2cz": "Cunt.", "anjahachwa": "Power ❤️", "anurag.chakraborty90": "No quote in entire universe can justify your cause and your action.", "aatirpatel": "Aapke jazbe ko salam hai, 👏👏👏", "saudahmadalig": "You are the true ironic lady, proud on you & salute on your guts...", "md.haneef_313": "❤️😍", "iamsinghpratap": "Mujhe agar ek khoon maaf hota to wo ap hoti .hate speech fake propaganda. I wish that I kill u if I don't have responsibility of my parents.", "pratik.bihari": "🖕", "rajalambert": "Hi Swara, I am following you since long and watching all the trolling by the coward, insecure, hatefilled blind bhakts. But it seems you are a gal who gets power from the jealousy and burning buts of these trolls. Keep the good work going, all good people are with you. My best wishes.👍", "ashpat007": "I can't wait until throwing commies out of helicopters is back in style... 🤡", "salmay786": "PROUD of you Swara ❤❤❤ Always STAY happy and blessed and Protected. Ameen 😘😘😘😘", "chandra_9893": "Where is Draft😂😂", "nehajaan": "Riots instigator", "lovemaccademia": "❤️❤️❤️👍", "irshad23_03": "Beauty with guts !!", "_r0rschach": "Morning❤️", "arjunrkn": "I think you need to be arrested for the kind of false propaganda you are taking forward. Psuedo secular and Psuedo patriotic", "rajeshsinghbanti": "देसी kutiya है", "royarpana": "You seem to be in an awfully good mood after instigating all the riots 🙂", "rajput__boy07": "Uth gayi chudail", "vishwakarmapoornima36": "❤️", "n1y47_excel": "Looking so nice", "chetan_tiwari9148": "Sarso ka tell du saheen baug m kaam ayega🙌", "vishal8868": "Gaddar", "pure9894": "Same here ❤️", "haseeb.ah07": "Nice", "kirti_sverma": "Haha.. you are impossible 👍👍👍", "__pardhaan__ji": "Superb #powerful #ironlady of India ❣️❣️", "ryaz_khan99": "Goodmorng", "bhojwani.hero": "❤️❤️❤️❤️❤️", "artbmughal": "❤️", "_._.neeraj": "God won't forbid you 🙌", "swapan_08": "Ja na reh faltu aurat .Desh tho bech kayi", "nupurankita": "Love and power to you ❤️", "shaikhayraf": "Hey dude ek baat Bata agar Pakistan nhii hotaa toh tu itna patriotic hota kyaa.....To all Andh bhakta😂😂😂😂@kuna_kamra", "krishnav_5": "❤️❤️", "suryansh_devasthali": "Ganjedi", "proud_to_be_ind_": "@payalrohatgi jalan pe jalan pagalrohatgi ko @reallyswara", "nourel82houda_": "💗", "anwar_laskar": "👍", "nehaiyerofficial\nVerified": "Verified", "patelnitin12": "Dissent not disturbance, And communist like u doesn't have right for anything because basic philosophy of communist for power is bullet not ballet", "njenish": "Just chill", "techstylejournal": "Me too ❤️", "naveee834121": "Love you Swara❤️ A Big Fan of yours #JabraFan", "saad___madaniofficial": "💕💕😍💖👌👌👍👍", "mr_niceguyd": "😘", "nitishnigam21": "I love ur post..", "manasgaba2794": "Happy and very pretty look👌👌👌", "jeddahdiaries": "More power to you ❤️", "adityaygarg": "Chal na chutiya aurat", "im_amerkhan": "❤️❤️💐", "mzuhaib333": "😍😍😍👌👌👌👌👌👏", "kasimansari5030": "❤️❤️❤️", "trisha.034": "I haven't slept either :)", "nayanmalicq": "❤️", "akt_sg": "Moods for sure", "orooj.ahmed": "Eyes are telling it's far too long", "realisticedu": "Wow ❤️❤️🔥you are amazing 🌻", "literally_jini": "❤️❤️❤️❤️", "wizdelight": "🌱", "aman_monn": "More power to you for fighting the modern fascist party 💙", "filmfeelingquotes": "@reallyswara disgusting people like u made both the communitites fight .", "gourravkr": "एक बेरोजगार अविनेत्री जो की देश मई हेट स्पीच देकर दंगे करवा रही है,,", "sujaym_": "More power to you ✊🏻"}