{"basantritvik": "Aapki harkato pr desh bura zaruur manega..... #shameless", "bairagiuncensored": "Suna hai teri amma randi hai", "vedant_pathak": "Rang birangi TATTI", "kanavdevsingh": "Koi rashan ka lifafa daan Kar to bechari ko.. kaam to mil nhi rha, ramzan aa gye to waha se bhi mushkil hai aab biryani aana... 2-4 makeup kits he de do...darr lag rha hai aise dekh ke", "funwithamritanshu": "Haaaannn! Bas!!! Ee hai satya!", "aswaldeepanker": "BC tu holi kyu celebrate kar rahi hai taadika rakshashni", "proud_looser_123": "Hey shithole as i heard that u are a hore.. plzzzz next time u go on ur professional \"work\" plzzź ask ur clints ti use condams tere jaisa ghatiya khoon aur naji chahiye is desh me", "panchalmaahi2000": "😲", "danish6519": "❤️❤️❤️❤️❤️❤️very nice 🌹🌹", "manni___sarora": "Tatti jaisi shakal hai behn ki lovdi ka", "shivani_singh6": "She's thinking kahi mere muslim akas bura na maan jaye 😂", "terababu92": "Bandar ki shkal is ki bhenchod or kutte jaisi avj", "yugarj313": "Plz aap Pakistan chale jao, or wahi raho", "jerry.sr_": "Mujhe to lga tha iska khali Dimag kharab ha..iski to shakal bhi😣", "zorian778": "thu thu thu sara mood khrab kr dia 😂😂", "thateyeiswatchinu": "ekdm", "israelpaddy": "C grade actress. .", "priojitkeisam": "Randi", "mohammad_bin_qasim_al_tehrani": "🇵🇰🇵🇰🇵🇰🇵🇰", "sunilmahato386": "लोगों की बातों को सुनकर खुद को कमजोर मत बनाना, इस नफरत भरी दुनिया में तुम्हें है बस अकेला है चलना । 😢😢", "akanksha_goutam311": "Swara tu to raand h re", "abhinav__oberoi": "Raaand", "im_rinku.ghintala": "Bakwass", "raajchandrawat": "Joint phook ke baithi h kya?", "asali_mr_k": "Aunty ji 🤣🤣🤣🤣🤣🤣🤣", "shaykhism": "❤️", "kalik3278": "Ye dekho...jb raand ko chudai ke baad paise na mille ho ....", "nprassin": "Ugly bitch saali! Pakistaani kutti", "abjaiswal99": "Kinnar of Bollywood", "earth_serene": "Saali desh drohi haramzaadi. Bhagwan kare tereko coronavirus ho jaye aur woh bhi muslims jis fruits pe thuk rahe hain usse ho ya kisi muslim ki wajah se ho. Tu dekhna aise hi maregi. Aur uss din hum log bolenge “ahahahahahahahaha” “haaaahhaaaahhhhaaaahhhhhhhaaaaa” marr gayi saali randi jaat ki 🐍🐍🐍🐍🐍🐍🐍🐍", "rasikaborade9016": "Chakki 🖕", "nysha133": "This festival is against the constitution of India. It is offensive!!", "vajanianeri7": "We love you mem", "pradeep93ku": "middle class he hum.... Apne favourite celebrity se mil To kya live chat bhi nahi kerne ko milta.... 😂😂", "manveirr": "Randi aur randi lag rahi hai", "amittchabra": "Lalita pawar", "__lonewolf3": "Shakal dekhke lag rah hai gand bhi laal hui hai🤣🤣🤣🤣🤣🤣🤣", "ansh_officialpage3": "This how she smiles after eating my l#nd 🤣🤣", "raahichauhan": "Mc blowjob lele pakistaniyo ka 😂🐖🖕🖕🐖😂", "harsh_8864": "Ganda chehra chipane ki ninja technique 😂😂", "koko__since2oo2": "Tumlog kabse holi khlne lag gaye", "vardandhara15": "Marja kutti...Badsurat Deshdrohi", "arjunrana1417": "Abe ghanja marke batthie hai Kya laudee", "thefallenangle666": "Kya hua Holi ke againts koi religious comment nahi karegi?? Ye to Hinduo ka festival tu kaise khel rahe hai ?jehadi", "ro_9999hit": "I just type manthra and instagram show me her id", "rajeshsharma605": "Isko bolte ha struggle aisi sakal se bhi heroin ban gai", "niharika000002": "Aree are ye kya kr diya anty jii abb ap kafiro me shamil ho gai haii😂😂😂😂", "imkaranzire": "Auntyyyyy......", "honey774442": "Ye hindu log mnate hai.. dadi ji umr k sath aap bhul gye hai lgta hai.. ye hindu log mnate hai", "chaarmisharma": "Baklol Karne wali ....deshbhakti hai to ab samne aa or fund de Corona mahamari k liye.........mujhse debate kar Teri har baat ka jawab hai Mera pass", "_gryyfindorr_": "Tauba tauba, itni manhus shakal!", "rdsuren": "Hey aunty❤", "themastibazz": "M.", "ashhrocks": "Suara bhadwaskar", "bhushan1489": "Suwar jaisa mooh hai tera", "jeetupal.89": "सच बताना गंजा फूक रखा है ना", "pp650250": "Aise hi koi najdik vale bus stand pe chali javo acha Paisa milega,", "_sakhidesai": "Hame toh laga holi hindu festival hai toh aap nahi celebrate karoge but have to show off.", "alon.e3047": "Teri maa k chodu tu na Khel holi kl ko madharchod dikhayegi maine holi bhi kheli h eid bhi manaya h Madharchod", "anvika.anika.kom": "Kahin bhagyaa toh nahi Shahin bagh se hole khelne ke baad😂", "istiyak716": "So sweet you💗", "harish___bishnoi___29": "Swara teri maa ki chut", "record.killers10": "kisne tatti kar k chor di.. bhai pani to maar dete yaar", "basant.bhoi.1": "To Holi khelne ke liye like hi nahin", "modivicky29": "Really Swara", "_fan_of_bohemia": "diLdo use KARE aAPp", "awokehindustani": "Assholes", "rowdy870000": "897k na jane kon chutiye isko ko follow krte h ...", "ranveer8703": "Ek Raat ka kya rate h ??💰", "ashishcp": "Teri ma ki kuth randi", "dhanraj_dodia_702": "Take a deep dick of JIHADI swara", "___h_a_r_s_h_i_t.__": "Ghanta .........Teri har film flop karenge hum mulli", "sagar3084": "Gb road ki randi lag rahi hai hai....", "silentprincess008": "😂😂😂😂😂", "imrishabhmahajan": "🤮", "kinjan.p": "Simply ugly, just like your character 🤣🤣🤣", "rohitsharma2850": "Apne rang he kyu lagaya. Apke to pehle se he bahut hai..", "the_religion_universe": "TATTI KHALIYA 🗣️🗣️", "shresth.rakesh": "randiwale aankhe aankho mein dhoka,pehla baar itni gandi bhosdiwali ko dekha", "swapnil_patil1993": "Suaraaa bhaskar 🤣😂😂", "tan10ishq_": "Bura na maanna tu randi hai❤️❤️", "youtuber_kapil": "anpad😂", "sureshkumarsingh1281": "I think you have a allergy 😢 from Hindustan and hindu. So what are you trying to express facist.", "rvv5990": "Pagal aurat😂😂", "saffron__anku840": "🔥kisi Bidi ke karlhane ki Majdor lag rhi hai", "soniyasaini97": "Tu Holi mat mnaya kar Tere liye to bas Eid hai tu wo hi mnaya kar", "engineerprashantyadav": "Follow me on instagram @engineerprashantyadav", "kiranroyme": "Swara bhaskar: we don’t want religion based CAA ! Me: there is no religion based CAA, its a farce ! Caa is based on persecuted minorities of 3 muslim countries , how muslims can be persecuted minority there ? And if we can take muslims then why do we need borders with Pakistan ? Take everybody in !!!! But most importantly its almost like saying “we don’t want reservation form men in metro” which on face value looks correct but what they cunningly and deliberately hide is “OLD MEN”! Now when you say we don’t want reservation for old men in metro, now the meaning of whole sentence changes , this is what they do when they say we don’t want any act based on religion and hide “religiously persecuted minorities” ! This is their game ! And this show how mean they are!!👎👎👎👎👎 Moreover : CAA : we don’t want religion based act/rules UCC(UNIFORM CIVIL CODE) : We want special rules/acts on the basis of religion ☝️☝️☝️☝️ THIS IS THE HEIGHT OF HYPOCRISY", "the_cancerian_moon_": "Aree rand kya haal chaal...😂", "a.man.called.love": "Hey Swara, I think you'll like my poetry. Let me know if so. Block me if you don't like any. 🥂", "simran_mandloii": "Tum sacchai ho", "rajeevluv23": "Please go pakistan wha jaa kr eid bano aap👏 shame on you swara . You are a curse to our socity . Ho sake toh sucide kr lena aap caa,or nrc impliment hone k baad", "charliebhai17": "@reallyswara ,jab se Delhi high court ne notice dala hai madam ki to mano bhen hi chud gayi hai, tab se ek bi statement nahi aya,", "_call_me_desai_": "Ye budhiya bhi holi manati he , isko nikalo koi india se , bolo jake base pakistan me", "___official__vishal___": "Hindustan mai rhna hoga, vande matram kehna hoga", "harry.h93": "Hak se maange azadi....swarna Bhaskar se azaadi.... Owaisi se azadi.... Anurag khasyup se azaadi....Karan Zohar se azaadi........", "____kvl_____": "Kesi bakvass dikhti hei, aj kal kisi ko bhi utake le le te hei kya bollywood me", "supersober_": "Rahul Gandhi ki gf Didi.", "rssingh007": "1 no ki randi lag rahi hai madharchod, kanhaiya ki rakhail", "thakur_mudit_pratap_singh": "Shakal..Dekho Didi ki Kaisi ho hai..😂😂😂😂Biryani Ni mil ri kya..🤣🤣🤣", "khyati.1993": "Its a Hindu tradition! Why? #ässhole", "mrraj.dp": "Girgit bhi Sharma jati hai Tere samne", "atulagrawal12": "Kyu didi ab pani waste nhi ho rha? Environmental issues nhi bad rhe? Women's molestation nhi ho rha? Hindutva promote nhi ho rha? Fascism nhi ho rha? #hypocrite", "sunil.6452": "Filth", "ria.ritzee": "❤️ Aww what happened to your mouth? it always look kinda swollen..specially when you talk, your diction.. but today you are looking extremely tired..are you alright?", "preeto5783": "Ye randi holi ku mna rhi pakistan me jakr baisa kate wha bakrid manaye apne abbu log ke sath ya jnu me mrwa le", "mysticyuvi": "Shakal to aisi bana rakhi hai jaise zabardasti kisi ne daba ke holi khel li", "gunjan_kala": "Lo ab ye log bhi holi khelay gye........😂", "rohitbarnwal70": "DUMB AUNTY WHO PROMOTES COMMUNAL VIOLENCE", "the_prabhuji": "😂😂😂😂😂", "1511radhika": "Why celebrating Holi which is one of the most important festival of your most hated community??", "mr_das12": "Pakistan wale Kab se Holi khelna start kiya...", "abedin.naushad": "❤️❤️❤️❤️", "love_life_point": "Har🐷🐷", "avi712712": "Pak ki pehli pasnd", "pranalidayanand": "Court ke dande padne ke baad shant hui ki nahi...ki aur charbi baki hain tere mein...sali anti hindu...kab maregi re tu...", "justine_sumit": "Ye madarchod holi khel k hamre holi ka insult kr gai", "dev_jogsan": "😍❤️", "amar.chauhan.165": "Are bc holi aap log to nai khaltena tu to Pakistan me munjra karne vale bai hai....... nikal bc phale fursat me nikal lowde", "_the_lucifier": "Tattiiiiiii😂😂", "ambuj_chaturvedi_12": "Are mulli bhi Holi manati Hain pta nhi tha... Thoda Gyan de dete Kya zarrorat thi dikhawe ki...", "manas_dx": "Bloody extremist radicalised Islamic supporter🖕 #traitor #deshdrohi isi ke dogi @reallyswara", "nishant_naveen_yadav": "Q holi manae by randi hinduo se nafrat or hinduo ka festival v manana Hai randy ko💩💩💩💩💩 gu kha tu", "rohit__24_": "खौफनाक डकैत 🤣🤣🤣", "ved_kulkarni_144": "Hi swara khan✋", "__.abhishekkk.__": "Pakistani bhi Holi khelte hai ?🙄", "shwaaaaas": "Cumshot for you", "brandedkamina1990a": "Isko chahiye aazadi😂", "indrajitghoshal": "At first glance, this pic reminded me of Rani Mukherjee", "_al_l_ah_": "@reallyswara tu kutiya suara jail jayegi jald", "mithil.18": "Flop actress of decade 😂", "rahulbarman1765": "Case kar mat dio ki hindu wale rang laga gye... Muslim o ko apne adhikar nhi mil rahe", "kattar._._hindu": "Kyu swara ji aap toh Thandi pad gayi Jabse Dangai pr karwahi hona chalu hua ?? 😂 Ab kya hua ab bhi kuch bolo na Delhi Police ki laathi tadap rahi hai aapke liye... 😂", "arun._bidhuri": "Lahore Pakistan me pyar milta hai Delhi nafrat ooh Afzal Guru ki Chali", "shivangighariya": "Wah swara aunty wah", "___ansh_singh___": "Dara diya re bawa", "varshagirnara": "Ankit sharma ke lie ye nahi roegi jiske kapde utarkr uska majhab cheack kiya fir 400 se jyada bar use steb kiya uski aate bahar aa gai ..khush he na tu..", "patilpratik99": "Full fakat😂", "er_adarsh_sharma_bhatt": "Holi toh hindu ka Tohar hi hi Ab To Hindu ko aatankwadi kahti hai.. Toh fr hindu ka festival kyu banaa rahi hai", "devikarrohit": "लिबरंडी।", "motordestination4": "Swara maine suna tera corona huwa hai", "rohit.kaushal394": "Kutiya..", "karthik2486": "Kya baat hai Holi celebrate karte ho...yeh toh Hindu festival hai", "awneesh20": "but its hindu festival 😮", "kundanpradhan1220": "👎👎guh ki sakal si", "tadchu7": "Kitni Darawini h yh mullani 😂😂", "ss703adam": "❤️❤️😍", "shikhar__chitransh": "Bahoot manhoos lagrahi aunty🤮", "rry045": "@reallyswara 🐒", "hemantgupta2811": "Yeh toh chamunda ki behen hai be😂😂", "sachinkashyap.200": "Arey teri gand nhi jali rang lagwane se.. ye to hindu festival hai na.. 🤣🤣🤣🤣🤣🤣", "musafirmaiyaar": "Or didi apki sahin bagh nahi gae holi khelne...🤣🤣🤣.....mazra saant ho gya kii", "the.woke.indian": "Aur meri shaheen bagh ki randi..oo sorry shaheen bagh ki sherni* kaise ho.. bhaut dino baad gaali di aapko", "anurag191091": "No no it's not legal it's against minorities 😁😁🤣🤣", "imnicyyk": "🔥🔥", "himeshiam_31": "abe neha ko thanks bolde tere pe se dhyan htaya 😂😂", "robin_goswami_": "आंटी थोड़ा कम कीजिए चेहरे का तेज माने नूर चला गया है", "devendra_ubale_": "❤️", "imvp2510": "5 rs wali rand hai😂", "rahulku665": "@mdshakeel_official pahle mai indian aur hindu hun dusra baaki ke dharmo ka respect krta hun", "divyanshshrivastava101": "chutiya aurat", "virat.jeet": "Chutiya hai ye 😂😂", "shandilya_dev11": "Hey u mulli...stop playing holi🤣", "_imshrishti_": "Chalo aajkal hindu virodhi log bhi films ka promotion karne ke liye holi khelte hai😜", "mark_physio": "Happy Holi", "imshivanitanwar": "Tu yha holi khel rhi hai wha Shaheen bhag ko koi dekhne wala nai.. aunty ji...", "jinping.shb": "#pkmkb", "suraj_4300": "Harami", "mistryarun": "Kya hua bhen riots ke liye gai nahi lagta hai", "sahayromil": "Yaha par caa nrc ki baat nahi karogi?? Makeup aur lehga pehen ke???😂😂😂😂😂", "garydhaliwal13": "bhiarani 🤢", "rohan_varma_ji": "Ruk teri bhi maa chodta hu neha k sath", "pulkit_garg_": "Chuddhi", "lokesh_sharma21": "Report maro iske ID pe jydaa se jydaa", "aniket_2920": "Bhikhmangin", "dharmesh9014": "Please don't speak anything about our pm and constitution as well the laws without study it properly and stop misguide people spred terror in country.. god give big responsiblity with big Success ...", "avinas553": "ya hindu rastrya sena bheju ghr p", "ashu.ydav": "Ya kya tatti dekh li bhkk behen ki lodi🖕🖕", "raviyadav1009": "Tu kese Holi Mana rahi hai suwara vaampanthi", "akshay_surnar_214": "Nam to swara hai aur bat aware ki tarah krti ho", "srivastava.rashi.0414": "😂 😂 😂 😂 ek no. ki bekharin lag rhi hai 😂 toh real mein hai yeh waah yeh mint mint mein religion change krti hai kya 😂", "kk475678": "BC orat k naam p suar h🐗 ... Dangai BC 🐗", "rajputnegi89": "Ye kis angle se actress lgti hai🤔🤔", "mr_ram_r": "Secular bhi holi khel rhe h saheenbagh nhai gyi kya holi khelne akeli khel ri h #ungli", "the_sanatani": "Holika kb se holi khelne lgi 🙄🙄", "veer_virat_kohli": "Pakistani 😂", "riyanegi0101": "swara madam... you are the onle brave queen here...i salute you and you are the real fighter.", "rakeshsingh9392": "Bkkk chutiya 😠😠..Holi mat mana ye pavitra parva hai..", "gohelbhavya": "Itna kum green librandus bura maan jayge, आप हरा रंग प्रयोग प्रचुर मात्रा में करे 😂😂🕉️", "prajwalchauhan_": "Samaj sakte ha Dard aapka.....aapka pitaji ki MP ma Sarkar nahi Rahi...aur Modi aane wala ha waha bhi😂😂😂", "raghukul_nandan_": "Paisa nahi hai aage jao🙏", "meshram6291": "I ❤️ U Swara", "ankyankur3": "Chudail saheen bag khali ho gya... Kuch to rona ro waha jakar", "captain_jacksparrow_113": "Hahahahahahhahahahahahahahahah 😂🤣😂😂😂🤣🤣🤣😂😂😂🤣", "skkdesi01": "OMG .. she is celebrating Hindu festival 😛", "mr._rahul_.143": "😆😆😆", "ynwa.anmol": "Why this muslim lesbian celebrating a hindu festival ? Koi iske kagaj check karo 😂😂😂😂😂😂", "riyazhusainriya": "❤️", "kanishka4023": "Didi ko zeher bhi phelana h didi ko jansangh bhi ikhatta krna h didi hinduo k against b bolti h didi ko holi bhi manana h didi ko phut b dalvana h didi ko azaadi k naare b lagvane h . ESA kaise chlega didi", "mehta_mit": "Remove following.. Apne aap hi yeh sidhi ho jaayegi.. Followers hi nahi rahenge toh...", "nirali1981": "We hate u @reallyswara", "amisha__1410": "Kagaj kaha hai?😂", "himanshuu21": "Swara begum", "pushpak_f": "Tmkc😂", "snehil_niharika": "Beautiful ❤️", "destroyer_god": "Desh k gddaro ko Goli maaro saalo ko🤣🤣🤣", "_egomade_kushal": "Alelelelelee bechaaliiiii....😂😂😂", "looking_4_a_frnd_": "जितना चेहरा सुंदर है उससे भी कही ज़्यादा आप की छवी सुंदर ओर पवित्र है । महिलाओं के लिए प्रेरणा स्वरूप ।", "vipin4910": "हत्यारन लग रही है।😂", "shuklaraghav99": "#fakehindu", "kavitas576": "@reallyswara ghar wapasi krni h ab tumko😂😂", "rakeshyadav_15": "Nice look Dadi ji 😍👌", "dinesh.duggal.50": "❤️❤️❤️", "_dakshrathore": "ऐसा लग रहा कि उठावने में आयी है 😅", "sanataniiii_": "Chud gayii kyaa Bee😂😂", "methelegaleagle": "Gadhedi", "dhavalsherasiya6296": "Looks aunty🤣🤭", "i_hemant_l": "Tumhari bhn mil gai neha chutiya uske sath jake betho gaddaro", "arshadhusoin": "Wow", "mr___complicated": "Bura na mano #rubikaLiyaquat ne le li h🤣🤣😂😆😆😆", "narenchhajlane": "🖕", "patil.abhi_abhishek_": "👎", "woke_ish_kid": "Bhang", "iamrajshekhar93": "Happy holi swara jee 🙌", "sainath_tarke": "❤️", "instaking_lucky": "Urban nàxals", "im_jigneshrana": "सूअर", "praveen_yadavvvvv": "Kani disblanced eyes wali 🤣🤣", "1kapil3": "Ab bakwas ni kar rahi ki muslim tumhare sath holi ni khel rahe", "_krishnnakrrish_": "Tum pakistani randi kab se holi bna rahi hai😂😂", "urvashi_dixit_raghuvanshi": "Wow looking fabulous witch..🔥🔥", "sandipbansode.23": "👏👏👏", "vikash_antidote19": "Draft Kaha hai 😕", "itz_sidd_h": "Dead swara", "shayel_tamang": "Bhang ka nasha dikh raha hay madam", "dhruvayan": "रण्डी होली भी खेलती है। कट्यूवे होली कबसे खेलने लगे", "raja.chakraborty.54": "Mast lag rahi hai", "mdraza424": "Oe Kisne Touch Kia isko maderch@d", "rahulchaubey.9999": "अरे हैपी ईद मोहतरमा", "_navniparihar": "❤️❤️❤️❤️❤️", "raman0165": "Bhen ki lodi hai tu", "priya_parihar55": "Make-up nhi kra kya 🙄", "your_rv": "👌👌👌👌", "cuttack_beast": "Kitni gandi dikh rahi hai", "_the_february_boy": "Chudail lg rhi ho.... 😂😂😂", "maharashtra_explorer": "दिल्ली वालोंके खून से रंगीं होली खेली ना? @reallyswara", "koolchap7": "Happy Holi Bubbles! 😊💝💥🙏", "vijay.3864": "Akeli hi khelegi.... innocent tahir ko bula leti😂", "wrestler_sujit": "Ma chuda li h motherchod 😅", "mr.piyuss05": "Ab lawdi holi khelegi🤣🤣🤣🤣🤣"}