{"rj_part_of_life": "Kidr se aata h", "mrigank_b": "Are tu convert ho ja muslim ban hame tumhare jaise hindu nahi chaiye people like u are backstabbers", "vishal1p1": "Chl be laudi🤢🤮", "komal.tandon_": "Ye khud hi likha hai kya aunty khud ko promote karne k liye 😬", "chandanpratapsingh098": "Kutiya hai saali ye", "reyanshpant": "Randi ab tere muh m jihadio ka lavda fas gya kya..", "brutallyhonezt": "There is so much hate around us in these times. People here who are commenting in foul language against her, please try to be calm and understand a few basic facts first -", "iamavaneesh": "मै थूकता हूँ तुम्हारी सोच पर @reallyswara", "ritvick17": "What about the sadhus who were lynched in Palghar recently.. forget Hindu & Muslim.. not a word from you and the other pseudo liberals condemning act!! As a human at least have the decency to condemn such an act.. had it been a person from minority you’ll (Pseudo liberals) would have harped on it immediately and would have started with the whole right wing hindutva bullshit!! Not surprised though that you haven’t commented about it!!", "adipotterhead": "तुम्हे जीने में आसानी बहुत है, तुम्हारे खून में पानी बहुत है..", "_deepakgour": "जय श्री राम।", "ni.lam6686": "Madarchod", "akash.ra7": "Wow! Such great empathy😮😮😮😮😂", "_freqk_": "C'mon , we know you've written it yourself.", "dishii07": "You know what join politics, be in real field of work and then you will know the truth. Now all it seems baseless and biased. #realitycheck", "himandtheshoe": "@reallyswara ma'am check my dm please :)", "vriti.kul": "Mam now where are you?? Why is that now we don't see you speaking for the current situation. What are your views now after the whole COVID episode", "yogesh_s_rajawat": "Shaheen bagh ko aapne beauty kaha un logo ko jinhone itni abhadrata failayi pure desh me vahi log jinhone ankit sharma me 400 chaku markr hatya krdi tb kahan thi aap.", "terababu92": "Bhenchod itna time apne cariyar m lga ti to aaj kidar hoti tu bhenchod faltu ki bakvas jo tu likh rai h use koi pad nai raha sirf tuje gali de rah h or dete rahe ge", "supersky.quotes": "You must have written this letter on your own..nice actor👏 Next election fight from Aurangabad on AIMIM ticket 😂 you will win there...pakka promise", "jazzyrjt": "Nice acting skills... You wrote this letter on your own. Fake women", "abhisharma9191": "Chal chutiya", "rajat.k.p": "Next time prepare with some logic points. 😂 It was entertaining to see you getting offended on your baseless points. Do acting by memorizing dialogues. For politics u need mind and that is totally absent in you. Spread love not hate", "insta_nazia": "You inspire all of us💛💛", "ambikasoni52143": "😡", "tushar_tala": "Your work like sleeper cell. Still this age you don't what is right or wrong.", "alifarhan95": "❤️", "ilasmriti_": "@reallyswara What is your opinion on the repeated violations of lockdown by a specific niche segment of the society (dare inhe more specific because I am secular😂), beating up of health care workers , deliberately defying and intentionally transferring the disease by spitting and shitting,", "sonam.shetty": "How did this guy know you were coming out for coffee?? Was he waiting for you all this time and had some sort of telepathy🤔", "toshi_tripathi": "ab bhauk na Jamatis ne desh kya kiya dikh ni raha ab ?? savidhan bachane nikli thi pagal aurat lol 😂", "thezubairshow": "❤️❤️❤️❤️", "psyched_thinker": "Oh as if muslims only meditate and it has been the hindus who hav tortued muslims.wherein the reality being the other way round. Wake up girl and go read some history .its a pity tht confused experts lik u are the ones whom people look up to.Thnk god i am nt one of those atleast. People lik u hav totally done serious damage to words lik liberal and secular", "pareek_.rakshak": "Itna galat kese ho skta hai bhai?", "harsh_8864": "Maine bhi kuch likha hai aapke liye, lekin shayad aap usko sun nahi paaogi😂😂", "_xabhishant_": "Fighting for what?", "nikhilkulhariofficial": "Swra madam ye sb chod or kagaz dund", "prerrit.88": "Aap apni voice ki plastic surgery cora lo na 🤣🤣🤣", "monissha.k": "YOU ARE AMAZING. KEEP DOIN THE GOOD WORK.!!!!!!!!!!", "nishisnishi": "Accha toh log randomly stars ke liye notes likh kr pocket mai rakhke chalte hain? Kya kuch bhi?", "lina.kidsdoc": "Also did you hear minorities in Pakistan are denied basic necessities during covid#show sympathy madam", "yashubasvaraj": "It’s clearly evident that you are being funded to do what u do!! Hate crime, spread hate, bring in communal acts in every decision the current govt makes! If you think by doing all this you will land up in congress party or Aam adami party just like few of frnds(kaniya kumar) you will be surprised!! Sorry to see the bimbo frnd of your @sonamkapoor who just copy pastes ur words all the time!!", "rakeshsingh9392": "Aukaat dikha di aapna.. Laudi", "prince_sd4444": "You are confused.and no body is banning burkha and and restricting beard. I am unable to understand your message", "mandarpund": "Mai hota toh lappad lagake jaata.", "shaukeenkhojibgc2.v63": "Humanity will survive .😊😊😊😊 .. Nafrat se jinki atma dhak chuki he .....jo log brahm or moksh ka mtlb nhi jante wo na bharatiye hain or na hindu ...... Mam you are great 😊😊😊", "_.shera_._": "Matlab Mera lauda", "sagar_5457": "Donate some amount as much as you capable in pm account", "thefallenangle666": "Bc ...puri reality ka narrative he change kr rakha hai...jo yaha dab kar reh rahe hai vho Hindu hai na ki masalman.....kabi Hinduo ke baare me bhi soch le sali katwi.", "shrijachandilaaa": "Please go to pakistan with your tatttiii knowledge and fanss🙏 and haan sath mein lejana naa bhule apni bestfrnd sonam kapoor ko", "sharmainnaya23": "Jihadi kahinki", "nehadvn": "Pagal a aurat hai tu, mar Jaa Jaake @reallyswara", "pariseema_": "Hna hna karle jo man me aye karle jo man mne aye bol le", "anurag.pasnoor": "So proactive in bulshitting. You are one of those Bollywood pretentive people standing for a cause without having understanding of the whole situation.", "naveen4you": "@reallyswara and being a Hindu boy I affraid of you and your antihindu ideology.. fight for humanity not for community", "abhilokabhi": "U live in sceptical society which for you is a land of conflict. #sovietunion #maythepeacebeuponyou", "preitys007": "Thank you", "gvndtwri100": "Ye to Didi ki hi handwriting hai ...!!! 😂😂", "nibmish": "Aur behen.. dharam parivartan kab rahi ho 😁", "nainasharmag": "Inko movie me kam to mil nhi rhi tatti acting ki wjh se ... To koi na koi bhana to chiye news me ane k liye inko limelight k liye to ye mari ja ri h ye😂....Being a girl I never want that my daughter never be like this shitty women... My mother will die if I will be like her.😑🤢🤢🤢🤢🤢", "_____cherry98_______": "Boycott this lady from our country.now why she is at home tell her to protest", "yat_se": "Instead of young man you could have written muslim guy, that would have fetched you more publicity @reallyswara", "chiku_ambar": "Donate something", "blushes_with_barbells": "And could this be any more fake? What exactly are you doing which will bring any kind of peace to \"a normal muslim boy\"? I mean this is heights of kuch bhi.. your speeches have veen so hateful, provocative and you have been very rightly accused of biased vision with twisted motives. I still respect you for your acting skills, but as a human, you have lost all my respect.", "apoorwaa__": "I'm 99.99% sure this is fake. 😆", "awokehindustani": "Baseless,?? What is baseless is you supporting Marxism in name of communalism", "fiza_haque7": "Bravo to you. I wish everyone would grow a spine like your's. And continue to fight the good fight. History will remember and you will be on the right side.", "sandesh_sany": "Ganta kuch nahi hai thum @reallyswara", "shaw_bikash_shaw": "You r the head antinational company", "swatirathore.in": "@reallyswara victim card nai chalega😒", "iamtusharsavani": "#COVID_19 તમારી પાસે ત્રણ વિકલ્પ છે 🏡 ઘરમાં રહેવું છે 🏥 હોસ્પીટલમાં રહેવું છે ⚰ ફોટો ફ્રેમમાં રહેવું છે નક્કી તમારે કરવાનું છે आपके पास तीन विकल्प है 🏡 घरमें रहना है 🏥 अस्पतालमें रहना है ⚰ फोटो फ्रेममें रहना है तय आपको करना है You have a three option 🏡 stay in home 🏥 stay in hospital ⚰ stay in photo frame You have to decide", "knishit": "The force is with you Swara. More power to you.", "nupurnupi": "Bhadwi", "sureshkumarsingh1281": "You are just trying to show Muslim phobia and funding these future terrorist. #jai_hind.", "wasfii_": "Thank you for taking a stand on what's right. Big salute to you.", "anvika.anika.kom": "Plz move china they need you......waha bhi Shahin bagh banao dum ho toh,India main bht ho gya ab plz China main kholo jake pata chalegi aukat..", "bushraafrin_050": "❤️❤️", "singhsivam8": "Are Madame .. is here are you .. not seen abuses against Modi for many days.. please call your people and go out to Sunday against his call for Janta curfew.. you need to do someone for your peace loving community .. spread virus as much as possible.. but make sure affected should be bhakt not leftist or liberal or peace loving community", "i.mahreena": "Thank you for your voice. You have no idea what it means to know there are people like you.", "vivekmsra": "Please go and sit at Shaheen bagh, its safe u dont have to go in self quarantine", "vd2408": "You are rightly accused for Delhi riots! Why are not saying anything to Shaheen bagh protestors who are under high risk of spreading the virus ! Why are they still gathering ? And why the hell did you go out and step into the cafe ? Shameless and highly irresponsible you are ! I wish kanika kapoor had partied with you swara didi !", "sumukh_hr": "Your handwriting is so nice Swara❤️", "pandeyamarrr": "kisi din corona ka ilaj mil jaega magar tere jaise suar🐖ra ka ilaj nai milega", "asukarakshata": "@reallyswara educate the shaheen bagh protestors that it’s not in their best interest to gather in crowds, political ideologies can be opposed after this corona thing ends, there are lot of protesters who think nothing will happen to them. Now these people are becoming threat, later if health care gets burdened you guys will shout saying caa protesters are not being admitted, if anything bad happens to them you will be equally responsible.", "jyotibose1809": "On humanitarian ground atleast be with the Shaheen Baag sherni’s .... why are you self isolating yourself... you should in Shaheen Baag ....", "kshatriya_yadav_vansh": "Abe madarchod bhul se bhi Gujarat mat aiyo Varna corona se pehle mai maar dunga tujhe @reallyswara", "surajnaik5489": "Madam Can u please Shaheen Bagh protestors to End d protest, they should go home n stay indoors for der safety n others", "anant_sinha": "Wanna starlet. Dumb as fuck and freakin illiterate!! And yeah separatist as fuk", "rohanpandeyinsta": "Bc desh me log mar rahe hain, or inko abhi b yahi sab karna hai... Mar jaayegi ye ladki yahi kar k😂😂", "imsameerjk": "Mam apka real I'd kab se search kra tha . alhamdulillah aaj mil Gaya ..ab aiga Maza ....ma full support you...I'm also with you😀", "rkulkarni112": "Learn to spell correctly at least, pogrom?? I mean c-monnn.. 😂😂😂", "meenakshi44": "Why are you not spreading awareness you sumb ass", "himalayanfit": "You have done nothing , you are the most biased and ignorant person. If you blame Kapil Mishra then you should blame yourself too. You should be ashamed of yourself. I hope you suffer for your bullshit dividing politics.", "abhinav_varshney001": "Abey saali chudail aurat ab to shaahen bagh band karwa uneducated tujh jaisi ghatiya logon ki wajah se duniya pareshan hai", "soru1994": "So @reallyswara i was confused and haan weekend bhi hai to vella hi tha vo Modiji ne Janta curfew announce kiya hai naa corona ko rokne k liye vo support kar rahe ho yaa nai, yaa phir aapke kuch plans hai uske against jahar ugalne ke... Matlab post vost daal do yaar un dharne vaalo k liye jo still baithe hai vaha kya pata tumhari sun le is baar or vo deshhit ho #indianbornCorona", "sachinthakur143": "Kma liye jitne paise...pr hua kuch ni beezat hue har jgah tum paiso ke liye ....", "khanrubaina": "Thanks 🙏 🤗", "priyanka_sharma1817": "That's all drama...kisi se likhwa liya n then posting it for attention...she must have thought that \"Corona has taken all the attention... aisa kaise...I have to take the attention back from corona\"...then let me tell you @reallyswara ...that corona have a very good recovery rate..but you n your thoughts do not come with any statutory warning that \" merii sonch jaanlevaa hai n main dange karwaane n logon ko karwane mein bahut active hu\" shame on you poisonous lady", "i_hemant_l": "Mtlb ni sudhregi ye", "rainawari_kool": "🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮🤮", "vicky_backpacker": "Aasi 2 Rupess wali Herket Tu He Kr Sakti Hai @reallyswara #PakistanKiChhamchi #ImranKhanKiNaazaiOolad", "nikki.ca.in": "When would you stop ? Staying home from 5 days , I am sure you might have written this note to your self , again publicity. you are still spreading hatred with such post , nothing is happening wrong with Muslims in India , stop giving reason to the world to point finger at India and do some actual stuff for humanity ✌️", "kk475678": "Total bejjati...BC comments m ...had h..😂😂", "dogra_4747": "swara bhaskar belives in secularism.....and her secularism is based on anti hindu agenda .....Muslims are always innocent .......even afzal Guru is a hero to her .......and also this b...h is calling Sadhguru intolerant ......and abusing rss ..this is real secularism or just hate to hindu ......beacause she knows if she abuse hindu Muslims will love her ......and also people supports these type of civil terrorist", "jzzz_j": "Kuch corona par bhi prakash dalo swara.... it doesn't understand right or left... country or ideology", "vishakhajaswal": "@reallyswara", "about_to_fly": "He didn't wrote his name and you know it already?🤣🤣", "aaishamuqeem": "I really appreciate your stand....means have a grtt gut to speak up against the system.....👏", "travel_gourmet_world": "Quarantine 14 din ka hai gawaar 😂", "prajwalchauhan_": "Kud hi likh liya huga dil kush karne ka liya😂😂", "yuvrajsinh_b": "Ab bahar jana😂 @reallyswara 🔥 #gandmedamnahihamkisisekamnahi", "srivastavapriyanka1996": "@reallyswara Abe chutiya ab kha h tu,tuje koe msg nhe dena public ko Corona ke regarding,CAA ke tym to fltu m udd rhe the chutiya aurat ,Didi anti national Mt bno jyda wrna Pele jaoge kayade m😂😂😂😂😂😂", "no.one.for.world": "@reallyswara you always show one side of the story what about the big truth that lies on the other ? Really disappointed in you also @anuragkashyap10 @mallikadua all anti nationalist", "sagar__singh_rajput": "22 march ko road pe kutto ki tarah ghumna😂😂😂 modi ji ne bola hai na tu against to jayegi hi😂😂😂", "_abhi1100_": "There is a difference between being a voice when you have the sufficient knowledge and being a voice without knowledge. And you call yourself educated? Where has THE VOICE recently disappeared and not asked people at shaheen bagh to give up their dharna's (protests) for the health emergency for time being?? Can you not atleast ask them to restart it as soon as the situation (emergency) cools down?", "nikunj_bhagchandani94": "Abhi abhi toh kaam mila tha swara ko, but corona ne woh bhi leliya. Lets see what swara do next to attract media. Govt kaam kar rahi hai toh taarif karni toh aati hai isko.", "tulsiwrites": "😂😂😂", "betty_is_on_fire": "Yes Ma’am 😊", "ultimateprince": "Those who matter do not mind and those who mind do not matter ✍", "pritishnandy2018\nVerified": "Verified", "suryaa_verma99008": "Tere jaise or Chutiye rhe to desh barbaad h😏😏", "kiranroyme": "Swara Bhaskar: we don’t want religion based CAA ! Me: there is no religion based CAA, its a farce ! Caa is based on persecuted minorities of 3 muslim countries , how muslims can be persecuted minority there ? And if we can take muslims then why do we need borders with Pakistan ? Take everybody in !!!! But most importantly its almost like saying “we don’t want reservation form men in metro” which on face value looks correct but what they cunningly and deliberately hide is “OLD MEN”! Now when you say we don’t want reservation for old men in metro, now the meaning of whole sentence changes , this is what they do when they say we don’t want any act based on religion and hide “religiously persecuted minorities” ! This is their game ! And this show how mean they are!!👎👎👎👎👎 Moreover : CAA : we don’t want religion based act/rules UCC(UNIFORM CIVIL CODE) : We want special rules/acts on the basis of religion ☝️☝️☝️☝️ THIS IS THE HEIGHT OF HYPOCRISY", "prajapatinirmal": "OR CHACHI KYA KRTI RHTI HO ACTING PR DHYAN DO 😂😂😂😂", "ori0ns": "I'm sure this is a mistake from the guy's side. Bhai bol de, she is making such a huge thing about a letter which she could have written herself and posted here. 🤣🤣", "vash518": "Hahahah lol what is this quick coffee and leave don’t u knw how imp is it to avoid such places... dumb u r such an ADHD person", "suraj.singh._": "Bc khud se likh k navtanki kr ri . Aise movie me kaam nhi milega madam 😂😂😂😂", "soul_insearch": "When are you next visiting shaheen baig, supporting their act of harakiri? Won't speak a word now???", "rs1905": "Suwara ko supreme court ki laat khate hi saara krantikari wala roop dhara ka dhara rahegaya hai apne aise jihadio ka letter hi tere liye sahara ho sakta hai baki toh tune abhi Shahinbaug jaise baseless topics uthane ka himmat toh nahi hoga", "tanay_mishra_": "FIR kaisi lagi , paise ke liye desh bech diya mc", "rani_meeta": "Fake accusations ?? Ceaseless attacks ?? 🤣🤣 Hv u ever heard urself talking ? 80+ ppl died violence. Covid death cases r 3 so far. Let tht sink in.", "rvv5990": "Oye ...aaj kal chup hai tu kuch bol nahi rahi pagal aurat", "__asheet_": "Why aren't you visiting shaheen bag now ?? Such a opportunist you are ?? Go get some movies .. Idiot", "akash_dalal": "आप जैसे काफ़ी बेवक़ूफ़ भरे पड़े है जो आजकल कथित बुद्धिजीवी के तौर पर अपनी रोटियाँ सेक रहे है। एक बार ज़रा बता दो के CAA के कौन से अनुछेद के कौन से प्रावधान से आपको तकलीफ़ है , दिक़्क़त यहाँ है की तकलीफ़ आपको भाजपा से है । इसीलिए जब खुद से कोई जवाब माँगे तो हेंकड़ि निकल जाती है और चूहों की तरह बिल खोजना पड़ता है। शाहिनबाग में जाके चिल्लाने वाले आज खुद करोना के डर से घर में बैठे है , पर वहाँ बैठी औरतों को एक बार भी नहीं समझा रहे की घर जाइए। उनको अपनी जान की किम्मत हो या ना हो , वो देश के और लोगों की सेहत के साथ खेल रहे है। और बता दे आपकी दोस्त @sonamkapoor ने सरकार की तारीफ़ करते हुए करोना से लड़ने की सरकार की कोशिश को सराहा है। तो कृपया अब भौंकना बंध करे और अगर तथ्य ना हो तो हव्वा जा फैलाए। @reallyswara @bhoomilogy", "mr.negi._": "Lowdies", "kritikaraivats": "A letter she wrote to her", "raman0165": "Teri maa 100 logo se chudati hai isliye tu chutiya aurat nikali? @reallyswara", "koushikduttaroy2": "Rendi sali", "the_real_aahil": "❤️", "ramjas_singh_rajpurohit": "Jo log yaha galiyan likhne aaye hai like marro yrr!😂", "gayatri__shah": "Now I’m waiting for some illiterate people to troll her 🤷‍♀️..... let’s see today who’s human and who’s not !", "monikkarana": "Can you please ask saheen bagh people to end it as we Delhiites scared of Corona virus i know you can do it and make them aware as they have no idea what they are doing to us and spreading the virus.", "rry045": "@reallyswara 🐒🐒🐒🐒🐒🐒yr tumhe sharam hai ki nhi kya muslim muslim lgaya hua hota hai....tum bs A.C. room mein beth k post upload krte rhte ho likes comments aur publicity k liye..aur tumhari wajah se bahar aam log mrte hain...tumhari gatiya post se tum logon ko bhdkati ho...shame on u ....", "pandit_harshad": "here is a person who is instigating public gatherings like shaheen bagh while practicing self quarantine at home. Bravo!!", "irfanwajih": "❤️", "kabir_shah97": "Hum apse mohbat karte h mam par aap gandi filmei mat kiya karo... 😢😢 hame acha ni lgta jab aap ko log unglibaz ya bollywood ki r@ndi bolte h...", "joginder_jojo": "Aunty aapki shakal suvar jaisi hai aur acting suvar k lund jaisi aur agar aap yeh desh virodhi gatividhi karegi toh jo saal mein ek baar bheek mein jo 1 adhi film milti woh bhi nahi milegi aur fir wapas se wohi kothey pe taang faila k paisa kamane ka aapka khandaani ghatiya dhandha fir se shuru karna padega usse acha deshdrohi gari vidhi bandh kar aur chup chaap logo k bistar garam kar k saal mein 2-4 film kar randee", "sharmasonia007": "Cheap drama queen! 🤣", "___p_s_d___": "Quarantine 😂😂😂😂😂", "moeesh_ansari215": "Yess👏👏👏", "priyankchakraborty": "You keep fighting BJP, while #indiafightscorona ...... Get well soon💐💐", "dhanwantarig": "I cannot understand what a person has done wrong if he has got birth in Muslim parivar in India.. equally you and me might have born in a Muslim family it is not our hand but in that case we would have been in a unfortunate lot what a dilemma what such type of person can do what can I do if I have been born in a Muslim family should I bless myself that I am born in Hindu family in India in this time ?", "radhika_sharma_516": "Didi ko knowledge nhi hai 😂", "sufyan.shaikh.378": "Please keep it up what you are doing.Allah apki madad kare aur apko himmat de.#staystrongswara", "kadir9990": "Hates off to you and zishan ayyub..", "_aniket_lokhande_": "आखिर तुमने कागज दिखाहि दिया 🙁", "the_religion_universe": "BURMAARRI 🗣️🤣", "baijan76": "Good swara", "imshivanitanwar": "Acchi story banai hai ghar baithe baithe.....😂😂😂😂🇮🇳", "sspkudla": "Anti-national 👎", "hussain_saulat": "Silver lining....", "m_ay_ur": "Pskistani luwdi", "singh.latika": "I also feel helpless to see people use everything for their career and all...I guess your voice was numb when Delhi roit happened. And victim shahrukh pointed gun on Police. I guess should tell them being too much religious not good for Muslims and hindus Rather than taking side . Atleast educated people should stop accusing someone openly when thousand of uneducated people hearing them.", "hasanbilal_": "I respect you mam", "official_aks10": "Sunno people lyk u r reason ki we r still divided..... We r hindu muslim..... Instead of these all u shuld have said u r standing for humanity but kya krna uspe trp nai milti.... N u noe wht tumhara kasoor nai.. problem lies wd us jo tum jaiso ko support krte didi kb tk asa kroge.....juss publicity ke liye desh ko bantogi kya", "itsmemischevious": "Mam you are really great! May god bless you", "radhika.jhaveri": "Many of us feel the exact same way. You are not alone.", "shootatsight.hindustan": "@reallyswara movie nai milte toh insta be drame toh mat kiya kar 😂 plz", "mnoush.78": "It brings tears. Your activism, particulalry its consistency, has always given hope and reassurance to so many of us. A loosing battle is often the most beautiful and dignified battle. We are not losing it, then. Prayers for you.", "ashish82906": "I don't think your family need any enemies from outside you are enough to destroy their life by your bised though for Hindus and having so much of hatred for them. Believe me I was your biggest fan of your acting but not now bcz your anty national activities stop me to doing that 👏🏼👏🏼", "skibrahimabdullah": "You are an inspiration madam", "jatin_gupta117": "Where is the draft for CAA?", "kushalghuge": "You are so so so so damn good Swara 💥💥💥💥 we love 💓 u so much 💕💕💕💕💕", "2804amit": "Swar udta hua teer lene m jo mja aya hoga tumhe uska result b Acha hoga upar wale n sab dekh how u misguided Indian youth without any knowledge. Wait baghwan tumhe suru s abcd sikhaega.", "devil.pork": "Please plan something new like... Nude protests, topless protests... This will attract lots of attention and will be a super success!! 🔥❤️😘👍💋👏", "kpawan_k": "🔥🔥🔥🔥🔥", "djay_sinha": "Kudos Swara. It needs a lot of conviction and guts to stand strong on your principals and speak out for what just and fair. God is on your side. Keep it up.", "shetty_21": "Idar pura desh corona virus se ladd raha hai inka kuch bhaltha hi chal raha hai😂😂😂", "khawjamteen94": "👏👏👏👏👏 thanks swara di", "djdeepakjain": "Did you write it yourself to prove that you have followers 😂😂😂🔥🔥🔥🤔", "__aishwary__": "How do you know his name is Ali?", "shrikant1402": "🖕🏽loser 🖕🏽", "shanianme": "She wrote the letter herself 😂", "akshaykashyap": "Lol", "nazmulkxj": "Really you are our inspiration,mam,we are proud of you", "toyasiin": "❤️❤️❤️Swara...", "raviranjan_28": "Sahinbagg all girls re sited there and u re enjoying ur quarantine how liberal u re 🤔🙇😜 jao tum bhi bath lo ya supreme court se dar ke ghar me dubki ho 😀👏", "nm_4u": "Why are you not in Shaheen Bagh right now? Have you not done enough to provoke them n encouraged n instigated people to protest? Why are you happily sitting on your couch quarantining while comfortably endangering their lives..", "snehil_niharika": "❤️❤️ it's very brave, humanitarian and nationalist to speak against the wrong . But you're among the best actresses of this time, so please do good movies like ranjana, anarkali of ara, neel batey sannata, no matter hit or flop. Fans miss you on screen.", "dheerajaulakh": "❤️", "lalsalamkerala": "🙌👍👍", "n_a_u_s_h_i_s.a.k": "@reallyswara you are an one woman army where the entire Sanghis and BJP IT cell can’t defeat... May God Bless You we shall over come this", "aarzoo138": "Oh yea \"Muslim\" boy ,stop playing this fucking victim card .", "shikhayadav__": "A real heroine in every sense ❤️ it require guts to speak in today's time💪", "veer_virat_kohli": "U are a #fake @reallyswara", "raju.shaikh.54738": "U deserve it more mam.. 😍 thankx 4 ur raising voice against injustice nd cruelness..", "i_am_zahid17": "thank you ma am for our supporting..😍", "vtigress2008": "This woman swara is d biggest scamsters", "kar_tikeyyyyy": "Abey bhosdwale fir gand main ungli kar rhi hai apni tu.", "d_drug_07": "You always inspire ❤️", "sydmuneera": "❤️❤️❤️❤️❤️❤️", "nazimaus786": "More n more power to you brave girl and thank you from all of us true Indians it’s not about any religion it’s about the dignity of this great country, and the greatness of this country is Unity in Diversity. Lots of love n respect to you ❤️❤️", "baddude69": "It is our country's misfortune that people like you are born in this great country of ours", "urooj.alvi.7": "We love you swara ...you have shown your true beautiful character. Do not get confused... we love you.❤️", "harry.h93": "Then why don't you get fucked up by Pakistani \" katti lulli\".....", "vikasnagarphotoshoot": "You suck", "magnificent_girish": "@reallyswara SPEAK BOLDLY AND WITH INTELLECT. NEVER HUSH YOUR VOICE FOR SOMEONE'S COMFORT. SPEAK YOUR MIND, MAKE PEOPLE UNCOMFORTABLE.", "kaushikmozumder": "Aur kitna propogenda felaugi...... Get well soon", "radical.menon": "Soooper 👏🙌", "iammayank.jain": "Kaha se aate hai aise log", "_crazy_prathu_": "#supportcaa", "godchikudkulai": "Love you mam", "bulbulrrani_": "Why to share this swara it was quite personal to u..do not emphasize it so much..it ok to be social .", "rakapoor2340": "How do you know his name is Ali?", "rohitbarnwal70": "JIHADI AAURAT SUICIDE BOMBER", "aesthete_writer_for_you": "Doglaapan to koi in jaise nakali actress se seekhe. .. swara tum insaniyat ke naam par musaalmano ko bevakuf bana sakti ho lekin khuda ko nahi khuda se daro. .. apni ideology aur nafrat ke chakkar mein desh ke khilaaf zeher ugalna band karo... ye nakli sympathy kisi aur ko dikhana ees desh ka sachha musalmaan sirf aur sirf abdul kalam ke rah par chalta hai. .. ghar baithkar social media krantikari banne ki bajay agar sirf ek hafta hi sahi tum shaheen bagh hamare maa behno ke saath baith jaati na to bhi thoda yakeen hota. .. apne girebaan mein zhanko swara tum khud aaj a.c room mein kitaabe enjoy kar rahi ho corona ke dar se aur hamari maa behno ko CAA NPR KA NAKALI DAAR DIKHA KAR UNKO BHADKA KAR BANA DIYA SHAHEEN BAGH... AREE ITNAA HI KAUM SE MOHABBAT HOTI NA TUMHE TO TUM SAB KUCH CHHODKAR SHAHEEN BAGH MEIN PEHLE HI DIN SE BAITH JANA CHAHIYE THA... #WELOVEBHARATANDKALAM", "shrutirawat_music": "👏👏💕❤️", "bobkhan98": "💪💪💪 Hey! Swara you are actually a true Hero. Who says you have lost your work or recognition , you have won hearts of millions, with your Tigeress like voice. \" Ab society ki hypocrisy Ko todne ki koshishs karenge toh sawaal toh uthenge- Society me Kabhi nahin socha Hoga ki Ek ladki CAA protest Ka center point ban jaayegi. #Kudos_for_swara.", "tafreehbaaz": "✌", "shristi_modi": "❤️", "faizalik": "Truth will always emerge as a winner. Swara u represent d suppressed voices of many..keep doing d good work and good will cm to u in unexpected way. I Pray for ur good health happiness and prosperity.", "dhananjayadj1": "Bavli ho nachney bhi lag.", "pixelbaba": "@reallyswara kitna milta hai imaan bechnay kai liye?", "fareed.iqbal.35": "When u get respect its the God gift", "ketanrajaramalavi": "u always get role of maid in movies and I thing it's best for u", "saif_thealpha": "THE QUEEN @reallyswara 🦅❤️❤️❤️❤️❤️❤️", "ninnatheninja": "♥️", "drbharat_patel": "Change your name swara bhaskar,sabrina bhatkal would be better.", "iam_kunickaasadanand": "🤗🤗 sending you love dear Swara. ❤️", "kamran_mb": "Thank you so much from the bottom of my heart. Indeed you have been an angel of hope for thousands of voiceless and now maybe homeless. May almighty always keep you and your loved ones under His blessing and protection. Stay safe", "beingsufiank": "Swara ......the Great reallyswara", "roh_n__": "Kuch nhi honewala tumse....!", "sarcasm_wala_boy": "👍🔥♥️", "anwar_laskar": "So true mam..we love u fr wht u do..❤️...people like u give us hope..yes it’s not over yet n sm1 is there who stands for us..keep fighting..it let’s us fight too..🤞", "ishanidutta1969": "So sweet 🤗🤗😘", "rahulpandey__007": "पाकिस्तान एक दिन आपको पाकिस्तान रत्न देगा ..... दिल्ली में आग लगाकर #CAA का मतलब भी नही बता पायी ....न्यूज़ चैनल पर .......चुल्लू भर पानी तो होगा ही आस पास ....", "iamsajjad_husain": "Aap k liye Ek Sher Ma'am... Khuda kisi kisi ko aisa Kamal Deta hai Jo Chadhte Suraj ko Hairat me Dal Deta hai Aur Na Jane kon hai Jo Duaon me Yad Rakhta hai Mujhe Main Dubta hn to Dariya Uchhal deta hai... May Ishvar Blessed u with more Courage, Health & long life.. Aameen", "manindrafreesoul": "Stop being double standard ☹️... shameless lady", "aban_the_great": "Stay strong , ,God bless you!", "shazil365": "More power 💪🏻💪🏻💪🏻", "shwaaaaas": "रंडी", "nikhisinghshekhawat": "Aap farzi ho... U don't know about facts and you are protest against caa if you know about caa tjen tell me what is caa, you are a loser.... Because u take advantage of your celebrity tag and pass wrong message to the people", "muralidharrajaram": "Bull shit. Her own handwriting", "shireen_ka": "We all needed to send you this letter. We all owe you a big thank you. Don't let the hate effect you. :) Stand tall.", "_____faisalistic_____": "❤️❤️", "meenaz_taj_khayum": "❤️🔥❤️🔥❤️", "manasssharma": "My respect towards you has increased when I saw u and ur best friend (vibrator) in the film... Respect to you ma'am.", "rohit.rohiiit": "@reallyswara auntie i support CAA NRC..", "gmkbiswas": "With love from me and my family", "kamath_abhi": "🤦🏻‍♂️", "nisarquadri5454": "Keep Fighting mam", "anirai7": "She's want ticket like Kanhaiya Kumar", "norin.hina": "👌😊 keep fighting n be strong 🙌😍", "basitnahi": "❤️", "filmy_rearch": "Ye sali 200 rupye ki Randi kya bak Bak krti rhti h ,", "masseysanjaykumar": "👏👏👏😍😍", "itz_me_anas_malik": "💕", "kamaleshchary": "from where you get all this fake ideas, b!+¢h", "farhaankazi_97": "❤️❤️❤️", "jagajyoti_biswas": "Mulle ki beti swara bsdk ji..", "adithyadushyanth": "It can seem very lonely in your fight, Swara but know that there are so many of us who are awed by your bravery and passion. Thank you for all you do!", "rizvianjum": "More power to you Swara ❤️❤️❤️❤️❤️", "l_peaufiner_l": "❤️", "_al_l_ah_": "@reallyswara chutiya Rand", "talk2skhan": "Aap Hero ho heroine nahi", "sana.rahman1306": "Thank you Swara.🤗 History will remember you in golden words.", "minasa88": "👏🏻👏🏻👏🏻👏🏻❤️", "entertnmntworld": "Love u 3000 dear @reallyswara . U are warrior ❤️🙏🤣😀🇮🇳", "miha157": "❤️❤️❤️❤️", "ameegosar": "Why are you appropriating black hand symbols you're not that dark", "mz8893": "Keep fighting Swara. You are voice of millions of voiceless people who cannot express thru any social media channels.God bless you.", "thebathroomwriter": "You are amazing!🔥♥️", "davidnesam": "❤️", "mypinkwindow": "@reallyswara few years down the line, when people will wake up from the hatred mode after loosing everything, they will realise the good from bad. And that will be a day they in history your name will shine on forever, for you didn’t shy away from standing with the truth. Till than keep fighting and keep strong. Thank you ❤", "mahetaba_mahi": "Swara ji ,Thankvyou from my side also...Adv. Mahi from Delhi", "priojitkeisam": "Aj se tera naam suar begum he", "chrysann_fernandes": "❤️ respect", "shahilzaman1234": "💙", "minhajul_abeden": "Beautiful ❣️", "secretstar_007": "Best Regard ❤", "royarpana": "Don’t worry. Best is yet to come!! #JailTime for the hate speeches and fomenting the riots.All the best!!", "iffsowhat": "❣️", "lone_wolf_111": "You aren't weak. India has seen iron ladies since it's dawn.", "adityaprabhulkar": "Dabang lady proud of you.", "timepass_karat_aahe": "Oh nyayadhish.... Religious card khelna band kar. Kya teri koi dukaan jali. Kya tera koi rishtedaar mara. Log samajh nahi paa rahe he aur tu game khelte jaa rahi he... Jin logon ko sadkon pe bulaaya, kyun nahi thi dangon ke waqt unke saath. I was praying for them from safety of my home nonsense.", "1998.kaurjassy": "Please do not react to her posts , she wants this that it will get lime light even if it is negative", "kavitas576": "@reallyswara kr le Hindu Muslim usi se teri dukan chalegi....tum jese logo Ko Sharm aani chahiye...kya gobar khati ho swara Bhaskar...ek aur danga krwana h mn nhi bhara tumara....behuda aurat", "mahrukh__ali": "I like u not because u are an actor but because u are an actor with a spine and that spine is what makes u stand out. Stay strong.", "sanamoazzam": "It's better to lose work than humanity, you are on the right side of history ❤️", "sawafsada": "World needs more people like you.. 👍🏻 raising voice against violence and fighting intolerance..", "adnansyed2019": "@reallyswara dont believe those who say you brought this trouble upon yourself, you brought the much needed freshness to democracy by standing up for what is right, you brought the much needed sense of bonhomie amongst communities by showing us the mirror, You are what YOU think you are, not what THEY make you think!!!! Keep flying.....", "_shaanrd": "Stfu attention seeker.", "batul_benazir": "PROUD OF YOU🔥", "human_world2017": "@reallyswara swara aunty chicken mutton kha sakti hai with their ass but cow urine which is proved as a medicine according to ayurveda and science.", "seemahari": "Thank you for being you @reallyswara We are grateful to have someone like you speak the truth so fiercely. Sorry for all the mess you have to go through. But please know that when you are fighting against injustice and if the truth you are saying does make the oppressors mad, then we are probably not saying the right things. There is so much power in your words and they make people mad because you are right. Sending you love and strength. 💗🙏🏾", "last_henchman": "Vivek didn't get his head drilled, Ankit Sharma wasn't stabbed 400 times, Ratan Lal wasn't hit with stones, sharukh didn't have a gun, tahir Hussain didn't do shit, the mosques didn't have stones on rooftops, petrol bombs and isis level riot making machines don't exist, ITS ALL NOTHING BUT A POGROM", "reallifebrownie": "❤️❤️❤️❤️❤️", "chandanshahi5": "डिप्रेशन में तो नहीं हो कही ऐसे ही कभी सुसाइट नोट मत लिख देना वैसे दिल्ली hc खोज रहा है सुना😁", "vedantika_6": "@reallyswara First of all stop spreading hatred between communities in India.That was you who had given a speech which spreads hatred towards Hindus .You said in a speech that \"Muslims are killed/ lynched in India because they eat meat\"..where are muslims killed ..we know that majority Indians are non-vegetarians ..You just showed your hatred and nothing else..You are misguiding those people who don't even know the meaning of CAA NRC NPR...Opposing government is alright but spreading false information is a symbol of hatred towards the people of country...", "joshography23": "❤️❤️ :')", "reach.nada": "At the end of the day, your integrity and values will drown out their voices. Stay strong. More power to you. ❤️", "avichal885": "Chalo ye kagaz to dikha diya,ab baaki ke kagaz bhi dhund lo,kyuki wo to tumhare abba ko bhi dikhane padenge", "alter_tommy": "FO", "james_rosario_": "Keep going @reallyswara proud of you", "aaayyaaannn": "Kuch bhi ho lkin tusi ho badi achi... Allah aapko dher sari khushiya de... Ameen..!!", "goswami_ppartha": "I am proud of you, @reallyswara . Some battles are not fought to win but to show people you were there standing. And this note really gives me a sense of hope that we might actually be able to pull off the incredible feat of restoring all of the old India that cared for everyone irrespective of their ethnicity", "ajayanadat": "❤️", "shreejitabiswas": "We love you! ❤️❤️❤️❤️", "arfath.h": "You inspire many ! #Dontstop #bethevoiceforthevoiceless🐾", "de_one_uh_cnt_be_adii__": "Keep fighting we are with your.... you are an inspiration mam❤️ also thnkuh", "manisha_singh_1210": "All fake..wake up girl", "jchatterjee": "It's a lovely note for someone who is not afraid to speak her mind. I can very well understand how much this means to him. You stay strong Sears. Don't give in to criticism from both wings. It's very easy for you now to just fade away into films and just forget about it all. God knows youve been through a lot and no one will blame you if you do. But to keep fighting is to keep staying alive. It's hard but then life isn't easy anyway! ❤️", "shahidyakene": "You will be rememberd always ..when nobody will know these goons which are destroying india's ethose and secularism ..i support you ..May God makes you always happy and relax😆", "anilbajpai1987": "Yha Corona chal raha but tumhara Hindu Muslim abhi bhi chal raha ... get well soon 🤣", "peaceout_sr190": "❤️❤️🔥🔥swara as ur name suggest... Swar rag se bhara.. Good wishes", "raof_k_g_n": "May god bless you ma'am. Respect 🙏🏼", "zoieee.poie": "Swara is queen ♥️", "mohdaftab551995": "Respect", "abdul000619": "Doing great job", "shahzebali26": "@reallyswara ....It is so true.Hats off. people like you are doing great job to secure the diversity of our nation.", "shoaib2012ansari": "No words to say Swara for you Thank you.", "vishu4997": "I support caa", "khalidbin5935": "ur alredy winner mam plz dont give up", "lucknow.up32": "#zameenjihad #bollywoodjihad 😠😠😠😠", "fahadshari5": "❤️❤️❤️", "mahira_fatima_123": "💖", "tamannashahin": "With lots of lov swara and more respect💓💓💓", "af.lov3": "You are amazing!!! I thank you for your voice too in the midst of many cowards. You inspire me over here in the UK to call out injustices like this in workplaces 👌🏽❤️", "ataleofmillioncities": "We need more people like you who stand for what is right. More power to you ❤️", "burger_pizze_khate_rahe": "Proud of the work you're doing and the courage you've shown", "mohammed_waseem_owaisi": "One among who wish to write d same..", "summ2010": "Swara keep it up..we all need that spirit to be with the truth u have", "shafida_shafi": "👏👏👏", "impstuff2k17": "U r a real not reel hero.. Salute for ur courage", "gul_patel79": "Keep inspiring millions swaraji.❤️", "rehankhanr15": "♥️", "arjun.premnath": "So what if you don't get a role, you're a role model and that's even bigger than bagging a role. Your life can be the inspiration for a movie someday and that's some life there. P.S: your career will rock, no worries 👏", "prashant_092pandit": "Chal be laudi... Phli fursat mei nikal..", "ferozzaheer": "We echo his thoughts. I", "mohdhassan40": "Actually I would like to say that women should like as you💯", "lifes_lil_goodies": "Wish I could be as brave as you are. Can't thank you enough ❤️", "mahatadam": "You are one of those girls whose counting is in Jhansi ki Rani’s like brave ladies. I’m serious btw", "dharkardinesh": "@reallyswara (No mam no mam I am just 15 years old mam) ye vahi hei na", "areeba7_11": "❤️", "nationalogist_": "U r an idiot", "one.more.insta.page": "❤️❤️", "terence_here\nVerified": "Verified", "mailanuj25890": "🍆💦🍆💦🍆💦💦💦", "let_it_be_just_harish": "Every coin will have two sides always....", "meharajmohammad996": "👏", "vikrantvimal": "I know Ira Mam as she was my teacher. Knowing her, I am not surprised by your fighting spirit and bravery. Keep up the good work. More powers to you. Regards 🙏", "dr.strange_23": "Hey Swara.. I also thought of the same.. Never thought a film fraternity would step up and raise their voice against the injustice happening in our society. And we can't push the film industry to speak up, because it's their own wish. But, you stepped and raised your voice even when they tried to suppress you too.. I think you wont let some useless people's hate go into your head, you should always remember that a lot of people (including me) admire you and your courage.. I think the hashtag #sheinspiresus will be a best suit for you..🤩🤩", "iffi0909": "All the great work u have done.... SAB YAAD RAKHA JAYEGA.... 👏👏👏", "mohammadurooj": "More power to you!", "thalha_md": "♥️♥️", "takshak1987": "Dogla aur secular hindu kl ka Muslim hai", "infinitelights_": "Atleast you stood up💓😌 proud of you❤️", "vigilant.indian": "@reallyswara Do you know defination of #Pogram. Please kindly name all victims. Yes, It's a pogram But against Hindus. No muslim stabbed 400 times like Ankit Sharma, No Muslim officer shot death like Ratan Lal and Amit Sharma, No muslim boys burnt brutally like Dilbar negi, NO muslim girl raped like Jyoti patidar, No drill machine inject in any muslim like Vivek. No muslim died becoz of sticker of GOD like Vinod. But leftist and liberals like you are really animals. Muslim butchers hindus but you all shows reverse of that😓 I really hate you. #Neverforget #NeverForgive", "shaziqspal": "This is indeed beautiful. You are one of the few brave women from bollywood. Very few people can risk so much to stand up for what he/she feels is right. And yes, we, muslims and not just us, everyone is proud of you. 🙏☺", "apeiron_7": "You are an absolute powerhouse ! Love and Hugs❤️", "sabaleshilpa": "To fight this hatred..just love and trust each other..let India triumph🌹❤️", "harshsingh188": "I wish you would have fought for poverty , hunger , harassment and humiliation of women in bollywood you won't because these matters won't provide you lime light try to read CAA first you claimed that it effects right to equality well every human has right to equality according to section 14 , why some particular casts have advantages in every sector why we dont share equal rights in society understand and stand up every one who undergoes suffering and dont be ashamed of being who you are Hindu and muslim units to create INDIA think before reacting !", "yasminkidwai": "Wow❤️", "__jyoti_16_": "😍😍😍", "librandu_memes": "😂 Berozgari hai kuch to karna padega fame ke liye , chahe Dange badhane wale Umar Khalid jaise logo ko support kyo na karna padhe , CAA par logo ko mislead kyo na karna pade , Relevant to banna hi hai @reallyswara ko news me kuch to karegee hi , chahe NRC pr kyo na bolna pade jo desh me nahi aya ! Chalo simple question hai hum maan lenge unbiased ho ... Delhi Riots ke time Ratan lal ji murder kia Jihadio ne Ankit Sharma ji ka murder hua Unke baare me kuch kyo nahi bola tumne? Andhi ho gayi thi? ya us news se Jehadi bura maan jaate?", "rimsha_hamza": "❤️", "nazir3092": "Man gaye madam", "itssimmijain": "Khud likha or khud hi post kr dia😂😂 waah ri duniya🤣", "anshadusef": "❤️", "tusharkaushik1991": "Keep fighting @reallyswara 💪🏼", "pranay4u": "Chup bhosdiki", "prithamsadashiv": "So much respect! More power to you Swara! And Thank you! ❤️", "pradeepdixit56": "More power to you Swara", "geet_2481": "More power to you", "rizvi1982": "U we’re the first one standing and than it became a movement,massive respect for you", "aabid1080": "He is fortunate to meet u personally...I also feels the same when I see filth against my community on SM ...but u r voice for us means a lot. ...Deep gratitude 💐", "tha_laid_back_one": "You're amazing!", "dhanraj_dodia_702": "JIHADI", "nehajaan": "Haha riots instigator god will punish you in every form possible. You deserve more n more FIR’s and yes it’s true you invited all the trouble yourself in your life so now along with your agenda fight that as well. Good luck, hope u find something worth doing in your life", "ruchisudan25": "U r a star swara...i ws already ur fan bt now i m ur biggggggggest fan and now i will watch every movie of urs in theatre", "mahesh.mandha": "Why dont you move to Pakistan n Bangladesh and raise your voice for minority thr...that way you will earn more respect..", "itz_suhailaslam_07": "🔥🔥🔥🔥🔥", "imaamir.faraz": "I appreciate your guts.", "hussainasir_7781": "More power to u @reallyswara ❤️ we will always with u✊ Keep Fighting💪🤘", "natasha_wani": "❤️❤️❤️", "choestyle": "❤️❤️❤️❤️", "concormanish": "अब दिल्ली नही जा रही", "dhalla_sh": "I love you 👌😊", "imbindukrishnan489": "❤️", "whisperingwaters": "❤️❤️❤️❤️ respect ❤️❤️❤️❤️", "ethical__king_me_raheez": "❤️❤️❤️❤️❤️", "farooqsyed13": "👏👏👏", "sab_279": "You are better than those fake people in the bollywood industry", "isirajm": "🙏", "shaanrizvi.79": "Andh bhakt hi negative comments krege..", "meraki.o94": "More power to you...😍", "ironicalzion": "Gaandu Bhaskar 😂", "elenasparrow\nVerified": "Verified", "pooja.pophale": "Aapko meri taraf se ekkis toppon ki salaami!!!🤘😎🤩May you gain all you hv lost,forge new bonds with like minded people, receive requests and offers to do meaningful projects and also continue to be an inspiration.🇮🇳🌸💖🤗", "_marendra_nodi": "keep fighting ma'am❤️", "suchinder27": "Really postive..u r gem", "tasawwur_desertofimagination": "Whenever I go through the comments section of your posts, I feel sick to my stomach..so many times I wonder how you manage to go about your routine with so much abusive words and filthy accusations hurled upon you regularly..I could feel every word you penned about your sadness..it's true majority have either become indifferent or sadist on account of their political affiliations..but there are still a good number of people who can empathize..there are still a good number of people who appreciate your every tiny step, every single line you convey..they may not comment everytime like these n number of trolls but their love and prayers are always with you..Love and Hugs ❤️❤️❤️", "_blahablah_": "My respect towards you has increased!💖", "soha_qureshi": "World needs more like You !💕", "sadaf_arshi007": "🙌🙌🙌🤗🤗🤗", "keithuboy": "Stay strong 👍👍👍👏👏👏🙏🙏🙏", "actor_pooja_nair": "💖", "ambareenakhtar": "Respect❤️", "naushi823": "I m proud of u..", "haseena.husain_": "He has spoken for all of us 😊", "suvi_rawat": "@reallyswara even though many criticized you, you are still fighting and this sense of justice you have is powerful ma'am ❤️ respect for you😘", "fahad_khan_ab": "More power to ma'am ❤️", "reubenstephen": "More power to you!❤️❤️❤️", "atkare_payu": "Ye pgl aurat🤣🤣", "adika.yoga": "Swara believe in you who you are ..you atleast have spine to stand against everybody...ure a winner ..matter of time but you wioo shine my friend", "samreen.ahad": "Only a few have spine in Bollywood... and you have the strongest one❤️😘😘", "ali_bagwan20": "Respect❤️❤️", "maryk_7931": "you have the spine to stand up to corrupted organization it's really amazing how you are still standing keep fighting for us🙏🙏", "aslijazib": "😍", "gautambhatia_law": "This is beautiful!", "chikudev33": "Ek number chutiye kee gaand hai tu🖕🤪🤣🤣🤣🤣😂😂😂😂😂🔥🔥🖕🖕🤪🤪🤪🤪🖕🔥🖕🏾🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "golgappa23": "💕swara you are amazing ... keep fighting", "dominant_females": "Very few dare to step out of their comfort zone. Glad you stood tall and won people's heart. Haters would have you because they need fuel to fuel lies. You please be yourself and gift them the index fingure they deserve.", "the_iconic_vigilante_23": "😂", "ezbekah": "Thank you for being you. 99% of us can't do what you're doing for the nation, for humanity! 🙏", "kasturi.it.is": "Muchest and more love ❤️❤️❤️", "saumya_hedaoo": "Mam corona virus aa gaya ab toh chod do ye sab. Nahi galne wali aapki daal.", "ahmed.mairaj097": "Keep fighting...💯💯💯💯", "naseemkhan202": "Honesty is the best policy... you are right mam❤️❤️❤️", "nad_1028": "You're amazing ❤❤❤❤", "ashna_087": "🤗", "akpriyam": "❤️", "zarashaikh1744": "Keep Fighting ❤❤", "mansiid2018": "❤️", "mahaksh_malhotra": "❤️❤️❤️", "manjunath9006": "🖕", "mozzam4": "@stroll.with.ali @alihussainkadir , I have seen this writing somewhere.. does it belong to one of you?", "thepaintedphrases": "Keep fighting! Hum honge kaamyab ek din❤️", "kashish_mallick": "❤️", "malik_92002": "More power to you Mam... Thanks for raising the voice and inspiring children like us..💓💓💓💓", "mehreenbashir7": "❤️", "nourel82houda_": "💗", "lillmissstubborn": "❤️❤️❤️❤️", "anurag.chakraborty90": "U have been rightly accused for your provocative speeches in the anti hindu riots of 2020. You have always shown one side of the story, and most often then not came up with meaningless justifications .", "__f133": "Massive love and respect to you 🙏", "letsqoute.it": "You've earned huge respect. 💜", "imroz9999": "Rizlaa gogo 2020", "teegee05": "@tonyjacobart 💙", "rohinitikku_": "🙏🏻🙏🏻🙏🏻🙏🏻❤️💙💙❤️❤️💜", "askdjozzy": "Good! ❤️❤️ Inquilab zindabad! Samvidhan zindabad", "lubnakhan66": "❤️❤️❤️", "__shujaat____": "Drop by sometime 😶", "thefma21": "Immense Blessings be upon you @reallyswara", "iamafifa": "@reallyswara ❤️❤️❤️", "v_varshavijayan": "❤️", "irip_10": "❤️", "manha.abdulmateen": "Really appreciate it ma'am", "subeenaz": "💕💕💕💕", "l_scoobie_doobie_l": "Yeh bhi dhupia category wali hai. Its her choice", "im_zee6699": "Thanks @reallyswara mam", "saif_ali_sam143": "❤️❤️❤️", "abdull_kkc": "Need more like you mam may allah bless you forever🤗😇"}