{"sunil_jaitade_patil": "You are right ma'am... Our society needs these types of interactions.. we totally support you..", "hannanhub": "Glorification of suicide shouldn't be promoted....film stars and director must have some responsibility .....I totally support you swara ma'am", "linnttzz": "You clearly is jelly👹👹", "nidhiikalraa": "Dumb bitch, it didn't glorify sati or jauhar. It just showed the reality, that how the things used to be back then for women. You wouldn't know a shit considering you like to do movies like#veerediwedding portraying no meaning , no morals, no values, but only curses, because according to you that's pretty cool, right?! Who even allows uneducated people like you in the industry bro?", "aarushi_gandhi": "A movie that shows rape shows the cause of rape.. we don’t agree but we hear the victims and the abuser’s perspective. Do you think that’s glorifying rape? Read. Educate. Comment. Especially when you have the x number of followers that you have.", "wanderer_moody": "I only wish if we could educate people to address any opinion. What really is sad what language so called WE educated people use when we don’t agree with someone. Kudos!! wish this basic decency should have been protected than judging someone. @reallyswara - I can imagine what & how you must have felt reading such messages where people can’t even express their opinion in polite manner. Wish you only had some educated followers my friend", "shraddha.mk": "Hi Swara, Don't be affected by the negative comments. Your letter is well written and is absolutely relevant in today's times. We need strong voices like yours who are not afraid of others narrow mindedness. Thank you!", "tanishachanda": "@reallyswara just came across your profile after the overhyped #veerediwedding promotions, and am surprised to read your letter which is not only factually incorrect but also hypocritical on your side. PADMAVAT is based on a historic poem glorifying the brave Rajput queen Padmavati who took the decision to end her life the moment she got the news of her husband's death. What would have happened if she didn't involve in the act of jauhar? She would have been enslaved by Khilji and sexually assaulted till her last breath AGAINST her will. Sati practice involved the wife of the deceased being pushed to pyre forcefully as the society didn't except widows even if she had the will to live an independent life. Is it that Padmavati didn't try to tackle Khilji? No. But you were 'reduced to a vagina' after watching the movie. And then I come across you being a part of a film like #veerediwedding where they want to show that if the boys can swear and commitment phobic, girls can do the same. They can hit a man's butt. That they are #notachickflick. Why are you even normalising such acts? Is this how you define #genderequality? By doing the same trash things even if it is not morally right? Even if neither of the genders should involve themselves in it? This long letter that you have written (or got it written by a professional) got dissolved the moment #veerediwedding trailer released. Do what you preach @reallyswara. It's good to have opinions but at least have some valid ones.", "dizz._.y": "Tsk tsk! Attention seeking level.", "meaniqet": "Why dont you write something about those saas bahu serials on television. All the time the show is the cat fight and how to take revenge... why dont you write something in bhabhiji gharpe hai... don’t you think such currently going things affect minds of viewers.. these shows provoke people do behave or do such things... so pathetic daily soaps are being made these days.... why u got so concerned about a sati part.. it is not in practice now dear and it will not be ever after the law.. #bhansali has not glorified it but it was the demand of the scene. We are youths of society and we know what is wrong and what is write and even if bhansali glorifies it, it indeed wont provoke women to practice it in todays time.. you please have some spare time for yourself and watch those typical saas bahu serials and write your feminism about it sometime.. we all know you’re a good actor but poking out someone for no reason is something which doesn’t suit you... I would wait for your comments on those pathetic daily soaps", "shruti.verma3112": "The only worst thing in #veerediwedding is YOU- the shitty mouth.", "sakshi_0610": "Dont u understand she did jauhar to protect her respect , her dignity ( which of course u don't have at all) , u r promoting rape culture if u realise", "beyond_ur_myth": "Because of them u r nw ...SWARA BHASKAR ...if u can't respect dem den don't say -ve abt dem ...keep ur shit upto u ...bdw i want to ask WHO ARE YOU ...", "delerioussymphany": "Aww you guys. Maybe you didn’t read that letter well enough. It’s her opinion , what’s your problem in that? What are you getting out of calling her a dumb bitch? I could do the same for your exceedingly long message right here. She expressed her opinion and she has the right to do so, you disagree ; that’s great but move on and get a fucking life please. Don’t personally attack and criticise someone for views on a particular issue. I thought the message sent in the letter was great and Swara in VDW just fabulous.", "_ishitachanda": "@reallyswara it is true that women has the right to live irrespective of whatever mishap happened in their lives but, I am sorry to say that but your views has nothing to do with the film. It is a historical period drama where they portrayed the pride and honour of Rajput women.Their endless courage of not letting any man take any advantage of them.It showed their courage and sacrifice. You just noticed one scene of jauhar but you did not notice the support system she was towards her husband, the King and the kingdom. It is not easy to volunteerly sacrifice one's life, but she did to show her love towards her husband,her honour,her pride. The zeal of not letting anybody do anything they want to is what they have portrayed.Also,do you know what would have happened if the real Queen Padmavati would not have done Jauhar?Her life would have been worst.Ma'am nowadays there are laws,there are helping hands for such situations for women.It was not so at that time.Over centuries people have slowly brought changes.SLB has just portrayed the Rajputani life and not Jauhar.He just showed the problems and sacrifices of woman.It was just a hint to the people of today that we should be more strict and make laws to stop woman from making such sacrifices.The movie was required for the unaware ppl to know about the sacrifices of woman since long ago.Being a actor is is very necessary for you to make remarks only after knowing every fact. Remember your followers are reading this.Don't misguide. Nothing against you but I did not agree with you on this.", "_thepizzahogger123_": "First...bash a magnum opus and magnificent scene to get attention and then talk of women empowerment by drinking, abusing and smoking. FEMINISM OF TODAY!!", "nisha_ydvv": "Chutiya hai ye lime light k liye karti phirti taki movi milti rae iske followers he kitne bhokne do isko @reallyswara", "niharika_shanker": "Don't know what is right and wrong... Just tell me one thing, imagine yourself as Rani padmavati years back... What will be your decision when a desperate king is desperately behind you... Will you get along with him so that your glorification stays alive or would do jauhar... Please firstly understand the difference between sati and jauhar... 😒😒😒😒", "kaa2ris7": "In history who gets V is victory.I saw u as a sword but u came out to be an arrow.", "deadblackmetal": "@reallyswara just tell me one thing...agar tumhare ghar k bahar Kewal 10 criminals hi as jayein nd unka bas ek motive ho ki they just want to brutally rape u torture u aur aapke pass koi help na ho ..so will u b ready or will u try to protect Ur honour", "sajnii_s": "And to think that this is the same person who was part of something like Raanjhana....a movie glorifying the stalker culture.", "soberfatka": "Yahi kaam karte reh open letter likh wannabe Kangana ab tujhe koi script nahi dega ...Bawal karo publicity ke liye.", "neeitasha": "I really don't understand how you felt like a \"vagina\" after watching the epic movie. Infact, all it does is empowers women that whoever bad eyes them will meet a tragic end. The valour of Rajputs and specially Queen Padmavati inspires all of us so much. But all that struck your head was the word \"vagina\". How? I really don't understand which part made you feel so. I am a big fan of yours and honestly I went to watch the movie with your view in my mind, and sadly not even for a second I felt reduced to just a \"vagina\". Giving opinion, is okay. It's a fundamental right of Indians to voice their speech. But such illogical and baseless opinions will get nothing but backlash. You are a strong, independent and successful woman. It is astonishing for your fans to see how irrationally your brain works. Or maybe it was just to grab attention. Or whatever. And I think @deepikapadukone said it aptly, you probably left to get popcorns during the disclaimer cause it was written in clear bold letters that they do not endorse JAUHAR OR SATI through this movie. So, even being your huge fan here's my big thumb upside down for you. 👎", "anne_d_o17": "It's a movie. It's meant to be for pure entertainment purpose. 😐", "sandy_swift30": "@neeitasha u better dont judge me and talk about me saving any women honour cause i do it evryday . And for the fact i want remind u that my comment was only for u to understand that how the movie is reduced to vagina (which u didnt understand before) . And u said that padmavati had happened in the past but the movies says it in disclaimer that its a fiction and it has no valid proof that it happened in the past . I really respect ur opinion thats a point that rape still happens victim never know that she vll be a victim but in that case should u die or u should throw uhself in fire calling it auspicious . Well thats my opinion however i agree that we cannot compare 13th cent. With 21st .", "tejasnyati": "In case if Pakistan invades India, and start taking women as sex slaves, what will you do?", "wierdo_mandy": "Even i felt after watching the movie..that how mentality of mens in past nd nowadays also were reduced to vagina..it was really a scary scene though committing suicide.. maybe that's the only way left at that moment..but it was hell scary ..it takes a lot of courage to take owns life..jauhar definitely not the glorious thing ..but a strong decision took at that moment that they didn't thought of compromising themselves with khilji...there r lots of khiljis in modern times too..@reallyswara mam thumbs up for pointing the thing clearly..", "bella__libra": "I hope i dont come off ignorant. But basically you complimented ranveer on his part as a WOMANIZING MENACING GREEDY VILLIAN but critisized deepika for a playing the part of a DIGNIFIED BRAVE COURAGEOUS QUEEN. FEMINISM 👐👐👐", "pujadm": "You got your 15 mins of fame....mission accomplished!", "mahak_seamnm": "Take care of your flop career first ! I’m sure if the Padmavati role was offered to you then definitely you wouldn’t feel like a vagina instead you would be so proud! By the way what does that even mean feeling like a vagina ?", "dishtiik": "Thank God someone is intelligent!!", "sanzana": "Really have enjoyed every movie you have done. But, I fail to understand one agenda this article addresses. I don’t want to say lame, since you clearly think there was a choice to survive in that century as a sex slave to a barbaric human. Wow let’s live in mystical assumptions and compare a surviving rapist to living sex slave. What a brave attempt. I also don’t want to say it is foolish, since you clearly think the johar part got us sentimental, and was glorified. I honestly didn’t shed a single tear, it was just as if it didn’t touch me. Poorly directed as SLB’s work, but still wasn’t glorified. You got one point right, the masses watched it because of performances, the plot wasn’t well crafted.", "fiend_like_queen": "Why didn't you protest against those films and serials that were made on the same story that were made before @filmpadmaavat ?? Should have mentioned them also right? They show the same thing?", "chakraborty3287": "Swaraji you are over reacting... because now someone does this to me... I'll directly go to government and ask for security...but Padmavati had no security....if didn't die she would have be the sex slave of Allauddin...it is as same as death...so she has just died for this only...not for her husband...or in the fear of being raped...and also after being raped she would not have any security...so this was her only way to save herself from devastating cruelty", "sanaawale": "I liked you opinion. Forget about those people who digging on your career. I wasted my money by watching this movie.", "thatbong_girl": "Waking up every day and getting raped is worse than a one time death..", "sreya.saha2": "Good publicity stunt Swara. I thought you were a sensible and dignified actor. This was an extremely cheap shot", "shankhaneil_basu": "Your thinking and opinion is sooo dirty just like ur face and it is very disappointed to see @sonamkapoor come to support u, really u both are very narrow mind kind of people, jealous feel karte ho @deepikapadukone se is liye ye sab karte ho, @reallyswara @sonamkapoor hate you forever 👎", "sushmita._.panda": "@reallyswara it's ironical that for this particular movie ppl were blabbering about the lack of freedom of expression but when someone else is speaking his or her mind then the same set of people start rebuking that person. I feel we Indians are not at all mature enough to handle both sides of the democracy. At one time we want freedom of speech and on the same time we can't handle criticism. It's really sad.😔", "the_warrior_breed": "@reallyswara swara ji it's a historical movie....aapke chahne ya na chahne se history to ni change hogi.... Or rhi bat johar ki to Padmavati ne johar isliye ni kiya tha ki unka husband mar gya to ab wo bhi jee kr kya kregi ... Balki isliye kiya tha kyuki agr khilji unko apni dasi bna ke rkhta or unka toucher krta bhut ....shayad aap jhansi ki rani ko bhul gyi ...pati ki maut ke bad kaise loha liya tha unhone angrezi se...agr khilji padmavati ji ke mehal ke bhr ni khda hota ...or unke pati ki mout khi dur ranbhumi mein hui hoti to wo johar ni krti ...blki jhansi ki rani ki trah revenge leti.....pr aap jaise ghatiya logo ko har bat pr feminism ka jhanda uthana hai.....I also support equality ..or jahaan k,uch hai bhi nhi wahaan bhi faltu mein feminism ho gusa dena ....ye bhi glt hai....aap jaise log kbhi...vegina penis sex ..isse jyada soch bhi skte ....thank God...max bollywood ke logo ne aapko bevkuf hi btaya hai indirectly...👍", "anamashah": "PSEUDO FEMINIST. End of discussion", "deepakkumarsays": "Ye paagal ho chuki hai", "nikhill_tx": "@reallyswara they had the blood and the spirit of warriors and not cowards commentators like you.", "banoprecious": "Randi", "unseenfriend\nVerified": "Verified", "sudheirb": "Hypocrite though!", "_stubborn_annie": "Apane jo bhi letter mein likha, i think u r right.. Good job har kisi ko apana opinion rakhane ka adhikar hai so u r right.", "ms.sampada": "Kash disclaimer dekhne ka time mila hota apko..", "lakshmi.krishnaswamy": "Yes, even tho it was khilji running for his peepee", "covid_19_lockdown": "I DON'T CARE ABOUT THIS LATTER 😏 But I love you @reallyswara 💙", "sunherisufi": "Ugh!Yikes!Dumb!Tacky!", "viveveenu": "A movie can do that? Really??", "mananmitrahahahahaha": "Isko footage chaiye pkka @jaggi__sagarr", "tanvi_naik_": "@shreshthi_yash i was just going through this post and saw your comment. Well, padmavat is based on a poem and not history. As there are many versions of the poem, the movie was one of the versions. Considered the period of the story and everything the movie is well researched and directed but one thing remains questionable. Why to glamorize jauhar? Show it as an act of bravery? A good thing? Whatsoever the story, jauhar is seen and was seen as an unfortunate thing. Even at that time it was unfortunate, it is never an act to be encouraged and thats what made the end uncomfortable for me. Anyway, just saw your comment and felt like saying my part. You should check out the real poem padmavat though! You would be surprised to see how it is totally different.", "naz__ellahi_": "All this over a poem 🙄people need to chill the f out !!!", "beardedpsychopath": "@reallyswara go fuck yourself!", "tanya.noronha": "@reallyswara you are a narrow minded actress!!", "helloiamprachi": "thank you so much for this critique!! i tried so hard to put into words my own feelings about how disgusted i felt after seeing the glorification of sati, and truly your article put my exact thoughts into context! thank you for being so open minded and posting such an excellent critique. youre an inspiration", "republic_of_philip": "After watching 3 idiots i felt like an idiot", "asthagupta197": "What i see here is a divine actress taking stand for women in our country by pointing out whatever she felt was necessary to highlight about the film .. but the same women are in turn blaming her and trying to prove her actions wrong ... its just sad .. people have really forgotten to use their common senses !", "cgangwani": "@jmehta92 @drewmeshah did you hear about this?", "xoxo_1437": "Stupid ass @reallyswara ALWAYS looking for some lame ass attention . Awwh you must be so jealous of the film nice way to try and stay relevant lmao you just made yourself sound like a complete dumb ass just nice try though hun. TIP - before watching a movie just remember to READ the disclaimer at the beginning DUMB ASS SWARA @reallyswara @reallyswara", "arjun_harsha": "U know what u r tooo selfish u can't even think about the situation they are facing and making shity comments like \"it is how I felt\" n all and u don't even diserv a reply from them swara case even a kid can understand that it is about history and wee should just see it as history and not to not to drag it to the present sercomstences .as u said selfishly I to wanna say sorry of any thing hurts u this is how I felt on Ur letter", "tantrik_jk14": "#SwaraBhaskar is A Perfect Text-Book Example of How #Opportunists Try To Come into #LimeLight Via Milking into #Controversies and Grab Public #Attentions .  It's Good That These JNU Backed #PseudoFeminists, Self-Respectless, Left-#Liberandu Brigades, #Dhimmi-Mentality Are Openly EXPOSING The #Dirt and #Perversion of Their Mind .... All By Themselves ..... Justifying & Supporting #Rapes, SexSlavery, #Concubinage, Defilement & Violation Exciting and Entertaining .", "llilvets": "I agree sis. Ashique 2 was worse. Glorifying alcoholism.sending wrong message to people that only way out is suicide. But nobody said anything that time. Padmavat was just narrative of what occurred years back . how can they change that event? Rip logic.", "dheerajbishnoi927": "Aakhir tum logo ko frk kha pdta hoga... Compromise kr lete ho... Pr kisi k liye to uski izzt hi uska smman h... The worst controversial statement ever by swara... U need to improve urself....", "erica.sharma24": "#2secondsofpublicity!", "queendom12345": "PlZzz stop it. And concentrate on your career rather than giving ur unneeded advice abt everything. Truly tired now.", "sara.mrana": "@teerthasamal @mohdsinanch just read the comments here", "swatiprabhu30": "Shameless women you are", "thebhavyabhargavi": "This was so stupid!!!", "janny_with_love": "✡ I write quotes ✡ I write poems ✡ I write articles ✡ I write short stories ✡ ⚪ Some people say they're good ⚪ ⚫ Some people say they're not ⚫ ✌ Can you do me a favor ? ✌ ❣ Visit my profile and check out my writings ❣ ☺ BUT MOST IMPORTANTLY, HAVE A WONDERFUL DAY ☺", "_swagatam_debnath_": "👏@reallyswara that's so sweet of u objectifying ur own sexual organ....well, feminism is going on point !...", "binitadas999": "Ghutno mei brain hai kya apka? I mean get a class, don't act lyk so stupid u r!", "tweetika21": "Did you miss the initial disclaimers? Did you miss the fact that it was the queen who herself took this decision and wasn't \"denied\" the right to live?? Like seriously, what was even going on in your mind while writing this stupid nonsensical letter? And for God's sake, it's history where this actually happened and the team just made a movie on this!! And the Next time, get your popcorn in Advance so you don't miss the disclaimers!", "madebymanjari": "❤️", "mahipal.singh.champavat": "Publicity k liye kis had tak girogi......jinke roj shohar badalte ho vo Kya Jane johar..cheapo..hate u @reallyswara", "sonaldeshpande": "You are soooo stupid.... 😂😂😂😂", "its.navya": "In a film, they show murders,voilence,romance, gambling,prostitution what not!! But that doesn't mean they're asking you to do/follow all that right!? If a movie could inspire people to follow it, no baba would ever have existed or no one would ever have blind beliefs after watching PK & OMG!! @reallyswara @deepikapadukone @ranveersingh @aditiraohydari", "shanayarehman48": "Bloody illiterate", "mee_trip": "@reallyswara at the end of the movie i also wondered..she was such a great warrior..she cud hv fought against them.plus they had a chance to kill Allaundin...if actually that was what happened.. and when d leader is dead d whole gang wud hv run away....", "mynameisnotmeghan": "Did you guys read this? This lady is absolutely idiotic. Any publicity is good publicity, I suppose. But seriously, this \"open letter\" is so far removed from reality. @anks3 @pree24", "sadiyaa_19": "U r pure shit 👹", "simrannnnn96": "We struggled to remove sati, and now we are glorifying the same 😂😂 @reallyswara you are an amazing women. You don’t have to ask anybody before you put your opinion. Love you 😘", "sslshivani": "@deiveika I have my share of problems with the movie but jauhar was definitely not one of it like wasn't that a very obvious end that everyone already knew? 😂", "sajjath17": "She is bloody bitch", "savan_sanandiya": "If one is making a period film, we have to show those rituals followed during that time, suppose someone is making a film on freedom fight of India, we have to show Bhagat Singh being hung to death ! I am a fan of ur work ma'm, but this is kind of indigestible. Sorry.", "chitrangana08": "Shut up you flop actress, you just want publicity before your movie but that's not going to help you anyway . You will never be a superstar lol 😀😀😀😀", "jins_7": "@rk07__", "sakshi.kabra_": "You should see that this film dates back to 13th century. This is what we call generation gap I believe. Plus it is better to die with pride and honour than being a sex slave. In that situation atleast. :) But then at the end its your opinion can't help it. @reallyswara", "limbaniabhishek": "Publicity stunt he iska", "shellyrocky": "What u think and said means NOTHING to NOONE so just mind ur business", "neha.r_sharma": "Rachel Greene from F.R.I.E.N.D.S had better content in her 17 page letter (front and back) than yours. #your_brains_is_reduced_to_V.", "fahad.inamdar": "Your thoughts are bull shits", "mukto_03": "She is doing a film with sonam & kareena who are anti deepika ....no wonder she is speaking on behalf of them.", "nehaldewan.jain": "@chopraishpreet", "parthsrkian": "Kuch kam ni mil raha h apko.. Tabhi. Limelight m aane ke liye ye sab drama h apka.. Haha.. Jobless actress", "itssoniaonly": "Luv n respect to u mam..We need some more fearless faces like u in our country... Proud of u. @reallyswara", "iam.saumya": "Having said that, I reiterate that I applaud you for speaking up. Dialogue has to emerge in order for issue to get noticed. Your simple action has achieved it. We may not always agree with everyone's opinions but even so they have to be said and shared strategically, civilly and intelligently if we are to move forward... 👏", "rish_42ro": "YOU’RE A TOO JEALOUS PERSON HAHA !", "poojaraikar777": "#Attentionseeker #brainess #flopactress go get some brains nd watch the film again", "lenprasad": "U didnt see the disclaimers i guess", "viraj_v_sawant": "I think team padmaavat n bhansali sir not showing his own story. It's depend on u ki kis tarike se tum movie dekh rahe ho. N it's not only about SATI. It's about the queen, love, power, smartness of the queen", "mandeepgohlan": "This is how the promotions for veere di wedding begins. @reallyswara please let me know few of the things that you have done/participated to make women more strong. Using terms like Vagina wont make you any bold or wont make woman in India more stronger. You are free to express, since we belong to democratic country, but if your opinion is biased and does not value all the good work done in this movie, than you are wrong and so is your opinion. This movie didn't anywhere shows a weak woman rather it portrayed a woman who was intelligent and brave.", "sidzee_96": "I'm feeling like penis today.. I'm so erected by your post ma'am. which is absolutely pointless. unlike me as im a penis thus pointed.", "swadha_singh": "I don’t want to offend anyone... but dear @reallyswara , you would have jumped at the opportunity to get the role of Padmavati yourself...", "nikishah9": "Everybody knew before even going to watch the movie that Padmavati performs Jauhar. What were u expecting that Bhansali sir would change history and show padmavati killing Alauddin khilji? #attention_seeker", "soniyaasheel": "Stupid letter do you want to change the history. If history mein esa hi hua toh kya sanjay bhansali usko change kr dete... Heights of stupidity.. Publicity k liye kuch b kro 👏", "gunjanrokade": "It's funny how she cannot even fake feminism! 😂😂😂😂😂😂 lol", "design.sutra": "Ye bik gayi hai ye gormint.. 😂😂", "ranjeetha79": "@reallyswara You were a part of a movie called Ranjhana which glorified a stalker and made him look like a hero while the female protagonist was made to look like anti hero.. How come you were a part of such regressive cinema.", "singhshalki": "I cannot understand why u cannot understand a simple thing.. nothing in movie portrays today's time..", "nammatulunad_shetty": "likewise if a movie talks about drugs, murder, alcohol dnt u think that also has be spoken about swara bhaskar😂😂", "kbhgfs": "This kind of women shud be punished hard so that an example is set otherwise they will keep coming out with these illogical senseless derogatory comments.... I think too much privilege n biased laws have gotten over their heads.... And at last.... Feminism is the biggest threat to civilization....period", "shreshthi_yash": "Do you on Earth understand that Padmaavat was based on a Queen and Bhansali just projected the historical facts of Rani Padmini and not showing his own story?", "curandera__": "Reading all these comments.. everyone's in a way proving her right... As to how this movie has affected everyone so much that they are insulting a woman who just gave her opinion that too in a very respectable way. She didn't make a law out of it people, she just said what she felt. Isn't that a right? Or you guys don't want women to do even that? . I openly say that i don't agree with some of her points but i truly respect the way she portrayed her point, it made me think deeper to understand her point of view and i respect it. As the filmmakers have right to portray a story of their choice, we as audience have the right to convey what we feel about it. And ya MOVIES DO HAVE A STRONG EFFECT ON OUR MINDSETS. so it's important that a movie doesn't convey something bad for the society.", "toshheyyy_": "Swara ji ....wasnt too fond of u but after reading it just can't stop myself from appreciating u. You killed it dear the way of luking at the things .....outstanding. your thoughts,the way u spoke your heart.....tremendous. feeling proud to have a person like u in my country......", "taggu234": "You gooo girl🔥🔥🔥", "meghadulani": "May B what u thought was perfectly correct being a woman @reallyswara but ur way of putting it across 2 d readers n viewers is extremely pathetic.. I totally agree dat evry individual has d right 2 voice his/her opinion but in a certain acceptable manner n language else ders no difference between u n d 1 whom u r trying 2 criticize!!!", "halder3582": "Looser Deepika Ki Tara ban k dhikaa fir baat Kar Naaaa", "praneta_panwar": "Disgusting woman😡😡🗡🗡", "my_name_is_t.v": "Muze lagta tuze in dino kuch kam nahi hai", "riddhima_71": "i told you 😊@garimajain_", "krishnaccc": "@shruti03july if a person chooses to be a prostitute then that's completely fine .... but for an Indian women I think her dignity is more important to her then being a sex slave.. if you know you are going to be raped by every man out there if they will get you. . Then you and every women will do the same what padmavati did..", "sumaiyak__": "Lol I hope u saw Deepika’s recent interview she said “people missed the disclaimer “ lmao on your face👋🏻 yaa u tried very hard to promote your shitty upcoming veeri nd whtever film it is. Nice try better luck next time.", "narang_shreya084": "And we're disappointed by your letter! Better luck next time. Being a grown up lady I hope you understand the meaning of fiction and feminism one day. Try to meaningful instead of \"insensate\"", "imthe_pratik": "Do you know freedom fighter used to say this sar katta lenge lekin sar jhukayenge nhi...agar woh log yeh jazzba leke desh ko aazad nhi karte toh..people like you would be slave still now... U r saying about vagina all d time let me know u I love my country and I love the history from were we belong this is how Indians have proud to call themselves Indian...", "vijeta.hegde": "No top director will ever cast you and hence you are jealous. Please get a life! #cheappublicity #failedartist #shameonyou", "_harshit_jalan__": "Try making sense with what you're stating in your 'Open Letter' If the act did not happen in past, today Raani Padmini would have been captured by the Khilji, which would result in losing of her self respect. And secondly the movie isn't promoting the act Johar, it happened during 12th-13th century. You need to understand that. Don't blabber if you don't understand. @deepikapadukone we stand by you.❤", "iamak.athikumanan": "You are a talented actor. No need to indulge in such an activity to obtain a 5 minz fame. U are beyond that..", "windowstomyworld": "Have never expected much from Bhansali melodramas but #padmavati was utterly regressive . We need more Anarkalis of arrahs and not glorification of archaic patriarchal customs .", "nisha_babbar": "Unfollowing you, you just need attention, just doing job of a flop actress!", "prietylicious_": "Ru insane @reallyswara ....pls go n join a school or shut ur illiterate mouth....go get a life n do some work", "deepika.padukone.fanpage": "Deepika ended you lmfao 👋🏻 a slap on your face !", "coffeezara": "If you have to be a slave to a man.. let’s see which oath you choose. To be a prostitute or to die in the fire. I’m sure you will prefer dying. Why insult the bravery of the queen Padmavati who died so many years ago? You are not even up to the level of her feets dirt", "mr.anuptiwari": "Apko paisa mila hai ye sb bakvas baatee bolane ke liye... Ya to ek ye publicity stant h.. Swara bhaskar vvvv❤️", "callmemitz_": "Nice try to promote veere di wedding and come into headline", "garimajain_": "@riddhima_71", "prathamesh.wavdhane": "Leave industry", "happycorgi_": "You're disgusting to be using abused women to get your few minutes in the limelight. Women who had to choose death to not be doomed to a life of slavery. All those queens who died. Do you think its easy to walk into a fire? You couldn't find anyone else to exploit for your attention seeking?", "divya_vijaykumar": "I really used to like u as an actor but after this all u deserve is a slow clap . Just like karni sena , you too try to get more publicity with this piece of shit that you have written . Such a disappointment . I think u desperately wanted a role in Padmavati and when SLB denied .. you had to come with this 👆🏻. Another Kangana in the making .. yawnnnnnnnnn", "namxalrimas": "Madarchod", "kellykellylush": "You missed the disclaimer in the beginning of the film. Have a look.", "jjyuhvffunc": "U fell in to a pit by yourself. .........use a brain. ...", "shruti03july": "You are so right..but people of this country are not capable enough to understand what u are trying to say.. sad!", "priyankavx": "Swara did you miss the disclaimer at the start? The director did not create that ending. It's history being shown on screen.", "mkmkreal": "Shocked to hear such stuff from you! Very appalling. Clear case of publicity stunt and attention seeking intention. SHAME! @reallyswara", "shashippandey": "Swara we got what you have tried to convey..Some people in industry they can do anything for money and sake of their movie..and for those who are criticising her first of all go and read the open letter you dumb girls..", "akash_maan_10": "Those of you dictating terms and lashing out as well as advocating that Jouhar padmavati's freedom of choice should keep in mind this letter is also a matter of freedom of speech . Those of you who are so hurt that @reallyswara's letter belittled bhansali's hardwork you are doing the same by undermining someone's rational viewpoint. my sister wishing brains for @reallyswara I sincerely pray for you to be blessed with insight a healthy brain and most importantly a Healing Brave Heart to acknowledge and accept that somethings are better for introspection instead of unhealthy criticism and bullying. With due respect to @reallyswara Salute to the steel nerves of yours SOUL SISTER .", "manishaaa1409": "U r such a dumb lady I hv ever seen. Bas itna hi kehna tha", "nishthaverma05": "I think it's very immature...just grow up.. Swara", "abbas.zaydi": "Get a life.", "kpriya274": "Ap deepika ke acting se jaal rhe kya.", "shahid52k": "Righteous minds👍", "sneakersofsociety": "i noticed u have mentioned VAGINAS 9times in ur \"OPEN LETTER\" and some words dat are still running on peoples mind, 'what does dat mean ?'....u feel talking about \"how ur vagina felt reduced\" is ok, coz u live in 21st Century and every thing is fine to talk and share as ur thoughts..so, if we start to share our thoughts on ur movies, i guess den at that time u'll have no \"VAGINAS\" to feel reduced.....", "one.loveforeveryone": "@reallyswara why do people like you write an open letter? why are you so eager to show your dumbness to the entire world? people like you can go to any shitty level to gain fame through something. Instead of bringing change in the 21st century you will get provoked by something filmed with respect to 13th century. That's the reason not all men are eager to help with the condition of women.", "___sahai": "@reallyswara its a real story bhansali cnnot chnge the history dnt try to show urself as a feminist by writing such letters ...he isn't glorifying nything ...rani padmavati chose to die rather den succumbing to a villian its not a scripted bhnsali movie its a history", "mohammed_sahil_118": "Kaam nahi Hai Tere pass is liye surkhyon me rehna chahti Hai.....thu Hai tum per", "snehaholics5555": "Use your brain", "vishalbjare": "swara u need to grow up.. aur bhi bohot kuch hai karne k liye.anarkali of ara to bohot achhi chije promot kar rahi thi..publicity pane k aur bhi tarike hai.", "gauri._.11": "People like you just don't understand the passion a director especially like Sanjay Sir puts in his movies.The blood, sweat, tears and love He didn't make up the story. And it was just a 13th century story. Btw you are annoying af. Also, furthermore I'll seriously not comment or argue because everything you said was stupid, vague, exaggerated and just not needed. Hope you get a brain soon.", "rounaqsahu": "Chutiya aurat apna movie dkho na", "drmalvika6": "You have more open letters than movies 😂😂😂", "gahlotzone": "Y all SICKular ppl use The wire as a medium...", "arcanediv": "Stupid open letter...!!", "akshayingole19": "@reallyswara Apke khudke daag acche nahi hai! Look at yourself first and den judge anyone else!", "kinka.subba": "@pripanday", "ranjeetrajpurohit": "Publicity k liye kuch b karegi yeh bhaand 😂😂😂😂", "charulata1": "I don’t why you felt like that lady maybe you were pmsing but this movie is inspired by a true story, these events happened in real it’s not a Work of fiction! Please get your facts clear before putting up your views!", "mr_akky_banna_rathore": "Khud ka kam kr bich me mat bol jut pde la", "funny_bones11": "@reallyswara not everything needs to have this “new age feminism” stamp on it. I don’t want to say you are welcome to your view because the one you have is illogical. It’s a movie that was based in the 13 century, the mindset, practices and culture was very different to what it is today . However even as modern female I choose to see the strength in Deepikas character. Also didn’t your movie Ranjhnaa promote stalking, harassment and self harm??? I quite enjoyed the movie and I didn’t take away from it that I should do the same however as a fellow vagina you don’t represent me or speak for me.", "silentknight_11": "@reallyswara u should be thrown in Sonagachi 😂😂", "shwetanshusaini": "🖕kl", "happywhenout": "We need more voices like you 😘", "ashish.dubey.501": "Tum Jaise log woman empowerment k Naam pr bas nanga hona jante hain", "shruti_mishra66": "Why u @reallyswara do such things to grab the attention of people...the queen was ,is n will always be our pride...we were thrilled by the movie n its good.....we have nt asked u about ur opinion😏", "guccy2018": "@reallyswara you little slut you are a puppet mouth of @sonamkapoor , I can bet $100 that dumb bitch @sonamkapoor asked her to do this. Bitch you are so so so dumb u have no idea stop fucking saying stupid shit like this. 🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻", "priyanka123j": "Keep your ego, attitude, self satisfaction, selfishness, greedy ness with you don't judge someone's acting, direction, production though you aren't having a sort of good acting so be calm, you are foolish but keep it with you don't play it out.", "aishamin06": "She's acting like Sanjay made the climax up when it was history what else is he meant to show ,dumb ass woman attention seeker has no life !", "dhartishah91": "Open minded and forward thoughts means to understand time and place to everything not just because u r from modern time so u have now modern thoughts and u can judge other timing and thoughts thats not what called forward thoughts and johar what they did that was something the decision that she made for herself nobody forced her to do anything so i think as long as there is a freedom of ur own decision to make thats called forward thoughts so open ur mind from vagina and see other things too before u just focus on your or other vaginas", "vaibhstunning22": "Haha not geeting fame so used useless statement about film and many. People will. Know who r u", "rahzalhassan": "So sad that being a member of the movie industry you spoke negative about a movie which is already attacked by mass...there is lot of effort behind the movie...hundreds of technicians and the star cast...they have shed their blood...you could have expressed your views after the movie gets out from the theater...that is common sense...", "spandana.darshan": "I can't understand being an educated how can you think in such a narrow manner. It is just a 13th century story directed by him. Appreciate the effort that is put on screen and off screen. How can you even in this fashion . So ashamed.", "sulekhs": "Dumb retarded so called feminist", "i_jv_banna": "It's about history you were not there and rajputs are those who are always ready to die for their pride so.. and I haven't proper word for you ......😠😠😠😠😠😠😠😠 It's not compulsory to speak on every issue .... 😠😠😠😠😠😠😠😠😠😠Those fucking boundaries are not allowing me to explain my thoughts like you .... But inshort GIVE RESPECT EARN RESPECT 🙏", "shardendushukla.7": "Just UNFOLLOW her guys, let her get only dumb followers which she deserves.", "avinash7693": "U have also used ur vagina so beautifully to get movie.", "devyaaaaaani_": "Such a stupid post to read really. What you said is actually baseless and useless like your thinking 🙄 please stop it and do something productive. And this is not feminism at all 🤦🏻‍♀️👎🏻", "sauravpradhann": "Bhansali delivers yet another beauty! What a beautiful film ! After watching the film I genuinely believe how Swara Bhaskar and all others supporting her at this moment are politically so incorrect. First of all what Rani padmavati did was not glorify sati she glorified the protection of her honor and dignity! I also get that Swara Bhaskar is entitled to her view but it is totally unfair to judge a woman who commits Jauhar if her only choice was to be a sex-slave. Besides, it is absurd to use modern yardstick to judge medieval societies with different standards altogether! This movie is a depiction of an incident recorded in history therefore there is absolutely no question of Bhansali glorifying any sort of thing which undermine women's dignity! Last but not the least if she is so concerned about women's right why did she do Raanjhana which glorified stalking! Let's not be a hypocrite people ! 😁❤", "princymatheww": "So should we say you were glorifying \"rape\" in the part that you played in summer holiday...... \"Critically acclaimed\" actress are you????", "pathak.shweta": "@reallyswara read ur open letter .. all I can say what a stupidity that was 🙄 don’t do such stupid things for publicity 👎", "araazquotes": "Old story of 13th century,if only they had to keep 21st century in mind. They could have showed khilji sending a whatsapp msg to padmavati instead of sending a hand written sandesh. There is a reason why orthodoxy often suffocate souls. The rajput king got married to another wife while he knew it was unfair to first wife. Who will justify that? The khilji ruler was a characterless animal,and yet used arabic words as if Allah support such muslims. Who will justify that?The queen padmavati is seeking permission of self immolation from her husband and mentioning she cant even die without his permission. Who is he?Her God?.. Who will justify that?.. So.. My point is.. This movie should be watched with keeping 13th century in mind and like a purely fictional poetry written by that writer. Poets always exaggerate to make things looks dramatic. While cinema always add the extra masala so that it can feed the eyes of viewers and not the vision. However.. The jauher practice is wrong but the main purpose behind that sacrifice is still justified. Given a modest woman who try to save her body from an animal.", "iamstarlitwings": "Thanks to Sanjay Leela bhansali for making yet another beautiful movie", "nishu_tyagi_": "Being a modern woman u can't just impose ur thoughts on another woman and call her helpless..just bcz she made a choice.@reallyswara it's not about her body.. it's about her pride & sending the message.She embraced death but refused to surrender to khilji.This shows her courage and determination. There are many freedom fighters who embraced death but refused to surrender to British rulers.Would u consider them helpless too?? Don't they have right to live??Or ur so called logic apply to women only?? Hypocrites bring feminism in every situation 😑", "chandini.sree": "@tanyaarupani google this", "rutulsompura": "You can get that surgery done these days. Then you can feel like a dick.", "_theficklemind": "@ramchi_b ..Lol.", "priyanaidur": "This was just a movie..based on what happened in d past...if u feel like ur a va j j it's ur stupidity..do something else for publicity..shame on u", "arindamdastito": "Rohit is Idiot. Main noon ha...", "___sanchi_": "Why see the \"glorification\" of jauhar? Why not see the glorification of sacrifice and valour!? This is so pointless?!", "_kunnanchath_": "And I think to become famous, useless people utter @filmpadmaavat", "priyaaa207": "So basically Swara you wanted to change the history, which use to happen in 13th century. Like seriously..", "mou_mist": "Imposing what you think on others is not feminism... keep ur stupid thoughts to urself. Next time please come up with some valid points.. Its a historical movie..what is shown in the movie took place in those times... Padmavat made us proud.", "maverik181": "Maybe when get the treatment then you will know the pain", "gautam.banerjee.5458": "But watching Your's (Comment) My Pen is reduced to Pencil😶", "sakshimehtaa": "@hrithikasrani", "ruqi_skhan": "Wana give her a tight slap 👋 .take film as a film ..they totally ruined khiljis character .he was totally opposite we didn’t protest or point them but u showed how jealous u r...concentrate on ur film", "tanuroy_18": "Actually ur rite padmavati being a very respectful person n pure hearted person in the film they sjow scene which are inappropriate. I mean love can also be mentally. Y body?. I support u!", "raiseyoursoul5": "Sometimes you take Feminism to a whole another level and misinterpret the definition of it. I don't know what your thought process is but you should not have a problem with reducing to just a \"Vagina\" because in the end you are one of those \"Vaginas\". Jumping into the fire was a decision by Rani Padmavati and the history has it! SLB, without moulding the history, has depicted it, so, why you have a problem with it? You should look at the positive part of the vagina taking the decision of doing Jauhar, killing that priest with vagina's presence of mind, giving a glimpse to Khilji through a mirror..all of these are the decisions made by the Vagina itself! I am sorry, I am writing all of this.. I never do this on a social platform but I really regarded you as one of those actors in our industry who has brains... Thanx for breaking the myth!", "_taani_2901": "Such a stupid you're saying that 😅 talking shit for publicity! Moron💯", "ebenezergeorge": "@reallyswara this chick is crazy man, she doesn't know what she's saying...", "gawarladki": "I just love ur tweet swara!! More powers to you", "saby.daskanungo": "Shame on u Swara .. really shame. U have a very cheap mentality.. u lost the respect of those who loved u d most. Ur totally disgusting. Wished ur parent taught u proper education.", "shemnashadab": "Glorifying jauhar in a well followed movie at a time when there are thousands of women being raped in India is like conveying suicide is an honorable and better option than living to those who have been through the horrors of it. Which i think is wrong and grossly irresponsible.", "bhavinish": "Tell me Swara, were there \"feminists\" like you and human rights protection for people in the 13th century? Feminism is all about choice. Those women CHOSE to have an honourable death. They did not want to be part of harems, be raped, tortured, so they chose to take the decision of their life in their OWN HANDS.", "prashant.3vedi56": "Arey munni jo tune \" DEVI PADMAAVATI \" ke baare me itni neech baat kahi hai woh ek pedaishi RANDI hi bol sakti hai , ek randi ki aukaat itni hi hoti hai, tere jaisi hi hoti hai swara. tu woh kaam kar jo tuje soot karta hai, jaake koi KOTHA samhaal aur usse naam de \" MUNNI KA KOTHA \". Aur soona hai ki paiso ke samne bollywood actresses ne apna imaan, jism aur DESH ko bhi bech diya hai. तु, सोनम कपूर, विद्या बालन एक घटीया परवरीश का नतीजा, गंदी नाली की पेदाईश हो। तुमसब कोठे मे जेहादी सूवरो के साथ चुदवाती ही अच्छी लगती हो।।। @reallyswara", "suzym_er": "Hahhahah", "ishanomania": "Being feminist on things you were not even born to witness shows lack of intelligence . Johar was a thing Back then and we all have a right to know our history - good or bad and learn something out of it . It’s 13th century plot mam not 21st century. Johar and sati are things of the past . Let them be past .", "sharmaindu_5": "Aur kuch nahi mila fame k liye to aise disgusting open letter likh rahi h madam...nw u looks like an idiot woman to me...", "kapi.rao": "सही लिखा स्वरा आपने ! इस विषय पर movie बनाने से बचा जाना चाहिए था ।", "_alanbk": "BULLSHIT.....avkde feminism..🖕🏻", "iamtejaswita": "Your reaction towards @filmpadmaavat is baseless. History is History. SLB portrayed the truth and Jauhar was a part of the truth. I truly used to like your acting skills but ur bullshit letter took my mind away from ur good skills as well. Good luck to u Brain.", "shirleymudaliar": "Was shocked when I read ur open letter...u r a very narrow minded person...u work in a industry but still can't understand cinema...very sad...should hv a gud look at da kind of roles u hv done n wat message u hv passed as an actress to all da women...i don't think u went wit a open mind to watch Padmaavat...there was more to da movie then wat u saw as an actress...u haven't reached to dat fame yet to criticize others...few awards hv reached to ur head...m one less of a fan of ours😒😒😒", "_icyou": "After reading your so called unnecessary open letter i like to answer back in your language on behalf of all the true feminist women aur there \" i would love to be a reduced vagina and commit jauhar rather than allow butchers like Khilji to rape me and play with me my body my emotions my soul and portray me like an object being a reduced vagina I feel like ending your life when there is no way out is far better than seeing those butchers tearing apart your body and soul like vultures....\" This is the answer to your pseudo feminism thinking and second point \"Bhansali portrayed the movie the way it had happened in the history so there is no logic to write a open letter to him\". P.S - there is a huge difference between \"jauhar\" and \"sati\" pratha so first get your facts right", "amanvermaa1": "Berozgari se pareshan 🤗🤗 aaj he modiji ki startup yojna k तहत पकोड़े का ठेला लगा ले", "devibalusu": "@reallyswara i could see the courage of a woman and the extent of her self respect !!! The last 5mins says it all.", "shoezzombie": "Everything is now put under magnifying glass , you are no different than educated karni sena.. it's god damn fictional movie and a directors vision. May be they who committed jauhar might be wrong but its THEIR choice to die then to be slaves so they might be right. It's a history , may be feminists were evolving from apes during that period. Just chill and watch the movie and please carry on with mediocore movie with Sonam .", "arpeetapawaskar": "@reallyswara u r a good actress nd i like u, especially in Ranjhaana (sorry if I misspelled the movie name) therefore I don't want to comment anything bad abt ur such act or even want to support u. Just want to remind u that \" History cannot be changed \".", "01_hitman_": "I'm not fan of deepika ranveer and shahid. But you're wrong. We can't change history though. It's like the story is of 13th century and you want them to be shown like 21st century. But why they will act like 21st century movie story? it's like shahid kapoor should have iphone x in the movie lol. Ratan singh call his soldier to attack on aalaudin khilji army. Common 😂😂😂😂😂 #trash article just to come in limelight.✌️😂", "anupa_merium13": "TRASH 🤢👎", "anushreemirge": "Swara you were a part of the movie \"Raanjhanaa\" where Eve Teasing was glorified, was that perfectly alright with you? What kind of Women Equality was that. I am sure even if your had an opinion, you should have shared personally with SLB rather than writing an Open Letter for a publicity and promoting it on all social media to demean someone's work. Sad to see that you are just adding more to the trouble which the film and cast has already gone through even though you are from the ame fraternity. 😐", "nachiketdesai0411": "@hershey_is_here just by blocking ppl won't make uh a so called fan of that whore 😂😂", "_aarishbhatt": "saw your interview with rajeev masand and thought you were quite intelligent with choices you’ve made but not anymore. You CANNOT change history to suit modern day “feminism” also are you forgetting the fact that you did a move called ranjhana???", "dcdazz": "Being a girl I felt very strong n I don't know how some1 felt so offended by just 1 scene. Yes Jauhar and Sati pratha were not at all justified in our history or society. But where is the point to relate such thing with Feminism.. Moreover this movie's title was Padmavati FYI. Some of us have taken feminism for granted but how far??? Why would we shout out for feminism all the time. If some one is making / acting in a movie on rape that does not mean that they are glorifying and supporting rape, they convey a message to the public and the same goes with Padmavat.", "iisha_1": "Ur article is absolutely trash..they did jauhar because it was THIER choice..no one forced them..they did it because they didnt want to be a sex slave..they did it for thier pride! NO NEED TO BRING UR UNNECESSARY FEMINISM EVERYWHERE!!", "usribee": "Please, don't mind the trolls, your perspective is important and women like me look up to it. Love and strength to you!", "the_forgotten_roads": "Intelligence is not in judging historical characters on contemporary social values but understanding their convictions and ability to stand by them during difficult times.This is exactly why I call these women pseudo intellectuals. Padmavathi had every right to choose how she wanted to live/ die. She chose to die with dignity rather than live every day and night as an invader's sex slave. For an industry that thrives on casting couch, understanding a life or death of dignity may be difficult. Padmavathi was forced to choose jauhar and didn't do it out of her love for fire. But then I don't expect you to understand that. Ironically, you're the same ilk that shout at the top of your voice for capital punishment for rapes and sexual exploitation. Why? Because somewhere you do believe it's murder of a woman's dignity. Why even fight a case when you can choose to be a sex slave? Were you (Swara Bhaskar) even in your elements when you wrote this letter?", "_yoguu_": "How can Mr.Bhansali change what history had performed?? I mean what’s with this article? ‘Reduced Vagina’ if you are intellectual enough, then you should know that the film is made to portray the story of Rani Padmavati! This story is made from a time where Sati existed and the belief of scarification was legitimate! I think you should go do some of your History homework! It’s a disappointment to see someone, who has worked with Sanjay Sir, to not have the intellectual capacity to understand the truth! Support feminism but don’t drag it into this for easy publicity!", "neha_dave07": "😂😂😂Pointless Shit😂😂😂", "_zubi.ahmed_": "FUCK OFF SWARA abh BAS bhi KAR! People like you have changed the meaning of feminism. #pointlesscelebrities", "sub_hq": "Some people dont have any work so they do this instead.... 😂😂😂😂", "indirakota": "@reallyswara too bad you can’t go back and change history she was never forced to perform Jauhar she did not want to become a sexual slave to Khilji and his thugs. Looks like you have no idea what these women in harems went through and here you are disapproving of their choices", "devendra53": "@reallyswara Swara.. people have been brainwashed they have really fell into the traps of right wing politicians when they deliberately say Global warming doesn't exist, evolution was wrong. People have given up on logic. Like people are going to jail for FB posts bt people actually threatening live on TV are safe. Wow. How beautifully you have praised Sanjay there, we haven't forgotten his Black and Devdas but yes so true when you said Art has the power to influence people. Showing history is a good thing bt then leaving your audience ask valid question is the other thing. Like the Movie BOL did from Pakistan. Keep up ma'am. Keep it up. Dont lose heart plz.", "the_dark_knight_joker": "You are just a side artist and never got a chance to be in the main lead and for sure you will never get that opportunity so don't disgrace talented people just to stay in lime light these type of statements are wrong.", "pimpu4you": "Swara .. well tought n said ... completely agree with u ..", "hershey_is_here": "It is really heartbreaking to read these comments 😔 These people are no less than Karni Sena people who don't understand the meaning of freedom of expression. You are special and beautiful and these people are just intimidated by you. Perhaps, even Bhansali sir wouldn't take as much offence as these people who are pulling you down for NO REASON WHATSOEVER. Just remember that they're NOBODY to tell you what you're worthy of. You are a confident and brave woman and you're doing the right thing. This is not a validation but genuine love and support. ❤️ A virtual hug for you ! 🌷", "thephynix3": "Karni sena 2.0", "vishal0907": "Great work done by Ur PR...u did get the attention and publicity u and Ur team were seeking. I hope u achieve the same with your acting skills soon nd stop resorting to such cheap mannersims @reallyswara", "mini_bose_30": "Your are an attention seeking woman and you have proved that time & again, do something remarkable then open your filthy mouth .... better grow up and get well soon !!!!", "shailjasays": "This felt really unnecessary. I did try making sense out it. An artist like you should better stay being known for your art and your performance. This letter was definitely a slight distraction from all the good roles you've been playing for which, I, an admirer of art, seeker of amazing unconventional talent on screen to get inspired from wants to say that this letter lacks valid context. Noone can take away your fine art from you, but everyone comes together when it is about addressing feminism. Those who know about it and those who don't. Everyone just feels the need to present an opinion about feminism.", "swetajuly": "Didn't expect from u ..u too should b part of karni sena @reallyswara", "sushant1781": "Karni sena ke baad dusri pagal ladki ayi ie swara bhaskar 😂😂", "ash_zariyaan": "So how much did they pay you? #karni_sena", "himansh_hm7": "@reallyswara you attention seeking fool !", "megha_legit": "First of all swara this is a real incident that happened during that time when sati existed you didn't , thank God for that well...Now we women have come so far but you can't forget about the sati pratha or neither you can make changes in a incident which actually happened back then now adapted in a movie in 2017..The incident didn't happen in 2000s that you trying to be oppose it or is part of a script writers imagination...You can't change wat happened in history..", "nasmk88": "Unexpected and uncalled for response", "jasmeet_jazz_": "Disaapointed... How can he show views of 21st century when movie is based on 13-14 century... Stupid woman.... You need to understand a basic fact that whenever it is about historical movies , we have to show that era, customs, rituals and most important thinking of people.. So how can Bhansali Sir show 21st century's point of view in this movie !!!", "kanstat": "Had you got even a cameo,, things would have been drastically different", "shruttitandon": "Are you mad? Just to gain attention....so much bull shit.", "akankshareshu": "U luk like a fool.....I used to request u.....bt after seeing ur cheap mentality. ......it seems u want publicity ths time....padmavat glorify Indian women's. ..by saying such idiotic words u disrespecting padmavati. .......take ur words back. ..mam vll be gud fr u mam", "photosby.arjun": "Behen, dimaag laga leti bakchodi karne se pehle", "sing_sarthak": "But har bat bolne ki jarurat nhi hai girls ko kamjor smjha jata hai.. vo kamjor nhi hai Jo sochte hai unki soch kamjor hai... padmavat# Rani padmawati ki story hai na ki Sanjay Leela bansali ki... @reallyswara", "kunalkamdar1313": "She doesn't know meaning of \"SATI\" AND \"JAUHAR\". SHE THOUGHT THAT MAN MADE FEMALES TO DO \"JAUHAR\". #swarabhaskar jauhar and Saturday means at that time. Female happily did jauhar to protect them from getting rapped and to be slave. First read get knowledge and then tweet. Or you will always be trolled like this.😂😂😂😂", "iamyash_9408": "I get it. It's your Alma mater. JNU. Says a lot. And anyway are you over anarkali of aarah? Or you still feel like a folk dancer? Going by your own logic.", "ugly_little_beast": "I totally agree with the views of @reallyswara there's a lot more to women than just their vagina and their \"roop\" as stated in the film and yes. Padmavati was more of a victim of two male egos than a hero or goddess i would say.", "biditarshahi": "people who feel like a ‘vagina’ after watching Padmaavati, should continue to feel like a ‘vagina’ for they would never understand the power it has. The power to create and run the world. Such people are the biggest road-blocks for ‘feminism!!!!!!", "shaktibhai67": "Nautanki ki hadd hai 😂😂😂😂mtlb", "vish_kdm03": "@uzma_noorien sahi pakdey hain😉", "iam_hem95": "You cheap lady I don't know what to say about your poor thinking @reallyswara", "suziechowdhury": "So what you suggest Mr Bhansali should have done ?? Change the ending ?? Change what happened centuries ago ?? Really Swara?? You are a really good actress..you dont need to resort to all these . We have many serious issues in this country ...Padmavat is not one of them . Fight for the real issues", "sunil.2949": "No body is interested in ur v......", "kretya.0": "Really really dissapointed in you", "syedamirjalil": "Over hyped movie lie of 1 St order", "thebollywoodgirrl": "He hasn’t made the story up himself has he now - very immature of you", "kalyani399": "pseudo feminist using history for cheap publicity.", "_talesoftrails": "All that Bhansali has done is storytelling... Can't be called glorifying sati... It's stupid", "ketikaaaaa": "@bhunasingh there's a difference between believing in history books and learning from them and of course we believe at least that's reality and from what we get to learn ..haven't u studied history pretty sure you might be bad at it because no wonder you don't believe in it", "balarama678": "RESPECT!", "natashas06": "Seriously you need to reconsider how you felt because there is something wrong with you if that’s how you felt. He has simply re-created history and told it like his creative vision allowed him to. It’s just a story re-told. If you feel so strongly about these issues please go to the grassroot level and use your good faith to educate the ones who really need it. I respected you as a feminist and and actress this just changed my perception of you. Just like you trust your audience to be evolved and understand the difference between right and wrong in other movies trust them to understand this movie too. Might somebody remind her she agreed to play a girl in love in Ranjhana who was rather ok being beaten up by the man who never reciprocated her feelings.", "mohita_sadhwani": "Thank you for your voice and for being so articulate about how wrong it is to glorify misogyny and patriarchy, especially in a time when we are striving for equality with every effort.", "divya_yajurvedi": "@reallyswara - why did not you pick up a call with @sanjayleelabhansali to share your thoughts one-on-one?", "deeksha_h_shastry": "Padmaavat movie is a mere depiction of customs and rituals that were followed back then when various kings ruled our nation. This movie purely outlines a historical story of a queen. History cant be changed.. things u saw in the film were true back then n not now.Please add some sense to ur actions. Fight for something real.. focus on bringing changes in the working of the present world. Its U, who has given this movie such a bad meaning. Women of today's world are way ahead in thinking maàm... Nobody can bring a woman down to anything.", "t.tidanun": "@reallyswara totally agree with you....from Thailand", "seemajoshi7028": "Swara is a mindless girl who want to get publicity by doing cheap acts", "anchu_attri24": "@reallyswara are u out of ur mind?", "cosmo_babe_": "This is what happens when you have no fuckin work to do and all you can do is spread negativity😂✋.", "recfm8484": "@reallyswara A Flop Actress Did Nothing In Film Industry Koi pucchta hai nahi socha kucch Publicity mil jayegi to bakwas shuru kar do. Itna hi waqt apni acting pe lgati to aaj Padmawati main deepika ki jagah Tum Hoti..", "thefaridhasan": "U felt reduced vagina 😀.. Wat abt #anarkaliofarrah @reallyswara", "ggdfhnn": "@deepstyles10", "theneetikargil": "When you'd have nothing, or have but are not being able to do anything for the society at large, you go for this publicity stunt.We are no more fool.Get some work dear #Swarabhasker; otherwise, your grandchildren would have to hear and ear-bleed that you were a goddamn 'pseudo-stuntwoman'.", "preranarh": "Total respect to your work as an actor but whateve r u have said is not one to be respected..", "perk2k1": "Before the movie starts it clearly states that through this movie we are not glorifying practices of 'gauhar' & 'sati'. plus I dont think the movie itself glorifies this in any way... she does not jump in fire coz her husband died but to save herself from khilji!", "aahanaura": "An unnecessary exaggeration of feminism. Ms Swara Bhaskar, the film is a story, a representation. Clear your facts first then shout Loud...let the film breathe... secondly, Sati & Jauhar are not synonymous. Please google.", "bx_1508": "As an actress you should know that it's only a movie based on a poetry 1540! It's so stupid?! I don't get it? The characters are In 13th centur so why should they think or behave like in the 21st century? Like seriously?!If we all think like you watching a historical movie... than I would also want that ratan Singh should have an iphone so he could call all his soldiers before Alauddin takes him as a prisoner ?! 😂", "bhunasingh": "This is absolutely correct. Glorification of these atrocities will bring us no good. There is nothing good about a society if a woman is dying on her husband's funeral pyre because she won't be able to survive without him. And where Sati is considered brave, so is Jauhar. And if you glorify Jauhar. It's equally bad, nobody can ask a woman to die just because another asshole violated her. I can't wish that on anybody. Even if she makes her own decision to die because she got raped, it is not brave. You absolutely can't glorify that.", "tanay_datta": "She might be struggling with work..just to be in the news she started speaking shit ...such a moron", "sravanisuman": "U r one of the finest actors we have today and knowing the art more than us the viewers...this letter is something very stupid...I agree woman has every right to live no matter what happens to them and this movie is set in an era where sati was the choice she took....if u take the case of the character of khilji wife she was being almost raped or he forced himself on her...and u have to notifce that this padmavati went alond and brought her husband back with a \"force\" of soldiers not alone...even if all these ladies rebel do you think khilji will let queen padmavati fight with a sword(as she is a warrior) no in the starting of the movie did u see what he did to devagiri princess? ....if he asked her to fight she would but he was all lust for her my dear he wanted her in his bed that's it which she wasn't happy and with no soldiers how can she win a war?...she opted death rather than being his slave...just think in terms of a man like khilji in 13th century....u r opinion might be correct but feeling but it's not relevant to this movie...movie is taking u back in time n showing us how the world was. ..if it's set in 2018 there are rapists n victims but there are no kingdoms n wars .... Sanjay Leela bhansali and his movies always have women with more powerful roles....", "being_mrk": "Padmavati chose to go Sati in that era to leave Khilji empty handed.. Bhansali has shown exactly whats in history.. He cant show that she just jumped off any cliff to die.. I am one of ur huge fans Swara bt disagree with u on this.. Bhansali doesnt encourage Sati tradition, its just the matter of depicting history as it is", "mondlerlove10": "Someone really tried to get their 2 minute fame and ended up failing so miserably that you lost respect from the people who actually noticed your acting and stuffs. I will wait for Deepika to reply to this but I dont think she would waste her time replying to someone who lack the basic interpretation skills. I am laughing at the comments section.. Literally no one agrees to what you said. 😂😂😂😂 Isnt Veere di Wedding your next movie? Seems like its releasing soon...", "_jananisatish_05": "@bhunasingh most of the people in India...arent tolerant towards other people's opinions", "singhmm19": "You have lost your mind girl...Idiotic interpretation done by you", "giggle_gasp": "@reallyswara Hi Swara! Much respect to your work as an artiste but how do you think you have helped in glorifying and celebrating women hood by shouting out \"vagina\" over and over again to address women in a recent interview of yours about Padmaavat? How do you think you've justified your role as a responsible \"celebrity-women\" with those words of yours? It's not men who reduce us to a vagina all the time but one irresponsible move of a women do it too.", "littthehellupakanksha": "1) Women will do what they want to do right now also. 2) Stop putting the words feminist in the wrong place 3) You lost all the respect.", "soo.umm.ya": "You're pretentious and headlines hungry 😂. LOL", "goooswamy_": "So i have question for you- where were you when Bajirao Mastani was released? When the mother had to dorm white clothes and shave her head? How do you even come that conclusion? It takes great courage to die for pride and honour and even more courage to act in a movie like this. This really portrays your mentality. Please watch before you speak you are public figure. Don't spread the wrong message.", "vikram_singh_chowk": "Jnu ki poll dancer btayegi ab ki girls kya h???", "iam.arifk": "@reallyswara you are really amazing and brave.", "abhisheksharma.kec": "Tujhse zyada faltu aur farzi bakwaas review koi aur nahi de sakta.. tera letter kuch aisa hai jaise tu ye kehna chah rahi hai krishna ne ravan ko isilye mara kyoki kans aur meghnaad bhai the aur khilji aur vibhishan jeeja saale.. isiliye hi tune khilji ko maar diya.. dekha na, jaise is comment ka sir pair nahi hain na bas aise hi tera open letter hai..", "vaishalip_12": "I think bhansali sir should burn and flush your letter in toilet", "avantikaloveavni": "You idiot", "saurabh2500": "If you felt like a vagina then go fuck! yourself! BTW big fan of your work!", "mahi1688": "@reallyswara I understand the hurt and the anger you feel... because the society that we have created for ourselves has made us hypersensitive and generally more paranoid. Treachery, deceit and dishonesty have replaced love, faith and trust. To understand padmaavat as the director intends his audience too, you have to remove the conditioning of our 21st century minds and appreciate it for what it was in the 13th century... When love and honour was still glorious. The mahabharat, the Ramayan, the bhagavat purana, the stories of the bible etc all seem ridiculous today if we don't attempt to understand with a different view point, and acknowledge our shortcoming in appreciating our etihaas. They are still the most revered texts ever and will also continue to be the most enamouring and entertaining stories. That's only because we were brought up to appreciate them with the innocence our childhood carried sans the limitations of our current minds. So sorry that you didn't particularly relate with the courage of rani padmavati and perhaps as a result felt dissatisfied.. But perhaps watch ur again...go in there with an open mind, let go of your expectations knowing that in ten years time the millennials will ridicule our movies to the tee in light of it being completely socially irrelevant to them and you will find yourself telling them how hard it was for us!", "ar.monalisisodia": "I would super-like it if I could! More power to you @reallyswara , you said it just the way it had to!👍👍", "being_moizquazi": "@reallyswara fuck off, your opinion doesn't matter , movie is a Masterpiece , thank you @sanjayleelabhansaali sir,", "_vishnuchaitanya_": "Attention seeker @reallyswara", "swatii_m": "This is ridiculous. You're a good actor and you don't need to post senseless stuff like this for publicity. The movie went through enough as it is with people like you coming and commenting on something that has already happened. Sanjay Leela Bhansali can't change history. Merely showing what's happened doesn't mean he's promoting it. Change your PR team. @reallyswara", "glow_by_manesvi": "Aww poor you @reallyswara other than Sonam Laporte nobody is signing you 😕😕 too bad that you portray your jealousy and insecurities hidden beneath so much hatred", "dechen136": "Omg @reallyswara are you ok? You are just jealous of @deepikapadukone... being from same fraternity you should stand with the movie... i saw the movie and its OUTSTANDING...", "ishaankhandelwxl": "Hype*", "siddharth8010": "I dont hav to say much bt u already gt the answer by many PPl so just keep ur views to urself 😑@reallyswara", "ksinha1006": "Can we show in a movie Osama bin Laden a peace lover. I think you got your answer lady #wtf#unnecessaeyfeminism#femalefeministbitch", "tanjina3472": "well said,,but wrong timing,,,,....getting feminism is good but time nd place were wrong...:)", "livin_vampire": "U r an idiot .. complete one .", "sehrishzd": "I agree completely with what swara had written..she is not denying the history, or facts..or the practice of sati..Swara or me..and many of us have a problem with the glorification of the final act..of committing Jauhar...That part could have been shown in a different way...rather than being glamourized and shown as the being sati is a final victory of padmavat.", "jayasha0496": "Kuch bhi 😐😐", "jyotsnagagan": "@reallyswara This event has already taken place in the 13th century and Sanjay Leela Bhansali is glorifying Indian history not only the act of sati and jauhar in particular. I really appreciate you as an actor but this letter doesn't make any sense. It is a story about a woman who loved her husband and preffered to die than being raped which was her choice to make. Writing this letter and posting it on your account shows how dense you are. This is 21st century, women have changed and our thoughts have changed too.", "nidhi_nema4": "@reallyswara 🤝", "rohittiawari1991": "i think its a insult to a sacrifice of a women who doesn't want to sleep with other men its her loyalty towards her husband not her foolishness. any ways i am your big fan mam.", "gorgeous_taurean": "Took a decade of struggle to abolish shitty practises in India... and now we glorify the same practise and term it as Pious 😂 If we’re so pro Jauhar , let’s legalise it again! You have a completely valid point Maam! Kudos to the courage so say it out loud 💗", "____rupa____": "Padmaavat is a story. A historical movie. Nobody is glorifying anything.. I don't think people of India are that dumb to make 'jauhar' a new fashion statement just cause they watched it in a 'historical' movie. Jauhar is history.. and history is in the past. Your interpretation of the movie lacks logic. I am a big fan of yours but I do not support you in this.", "sourabhsinghrathore": "No it does not. It is a portrayal of the courage of the women of the time. Nobody is saying women now should do it as well. Stop trying to make it a post about female oppression just for attention.", "abhishekbhadra15": "You are just an attention seeking woman..cheap publucity stunt in the name of feminism..", "vyomapatel98": "@reallyswara sorry but it makes no sense! He's retelling a \"historical\" tale based on a poem etc so he had a plot line to follow. THIS HAPPENED IN HISTORY!!' #facts #holdyourhorses lady", "rakeshsadeo": "Loved your letter to Mr SLB.. Love you swara.. You are original...", "upashika": "This movie is periodic drama and it will obviously depict the reality of that era.The director of the movie cannot change the plot to fit the thoughts of our times.I don’t think the film is promoting Jauhar or sati but it is just narrating a story of the past where a woman performed Jauhar which at that point of time was considered as the correct thing to do.And even though I am woman I did not feel reduced to a vagina while watching the movie,and that is not because I am not a feminist or that I don’t believe in gender equality,but it is simply because I do not feel the filmmaker has depicted woman in a demeaning way.I feel like the director has in fact opened a dialogue for discussion of women as courageous people,because valour is always associated with men.Also,all those criticising this movie like Miss Swara herself is a huge fan of western movies or series.GOT has scenes of rape,torture and even murder.Now,are they trying to promote rape?We have to look at things from their context and not look at it from today’s context.", "smile.priyanka08": "@reallyswara I m a big fan of ur acting skills.... but sorry to say that's not sound sensible n good", "_pooja.sharma30": "You are the finest and versatile actress @reallyswara but this was totally unexpected..", "vidhipanjwani20": "It’s a movie please treat it like one,and it’s depicting the ideologies practiced centuries ago so why connect 2 things 🤔", "niharika.sabnani_mua": "I love you and your work swara ji, but I disagree with you (if your views agree with the title). Padmavati burnt herself because she didn't wanted to be touched by another man.", "i_ramiza": "not at all sensible 👎🏻", "nikita.114": "@reallyswara Wat abt raanjhana? It glorified stalking.", "itsarvindsoni": "Kuch nhi bs movie milti h nhi krne ko to news me aane k liye faltu k ye latter jiska koi sense nhi h bilkul bhi frzi wara hai ye... Jism2 jaisi movie p kya kehna h phr tera", "minchu_gokhale": "When someone is not so famous for right reasons, they will find all short cuts to be famous overnight. And that's undoubtedly you. Congratulations to you on that! We all not just liked the movie but loved it, coz we watched it from our brains and not vagina!", "upasana_shrivastava": "Swara you are wrong in criticizing the movie.You are historically challenged and didn’t understand the movie and the times it was about at all.And use better words to write open letter than describing anatomy. I thought you were talented after watching tour movies but your writing and objections have not added any value to your name.", "javadunplugged": "By far the most regressive movie ive seen in recent times.. yes derz a disclaimer that it does not glorify sati or jauhar but the irony is that it does & the whole act of self immolation is so romanticized that u get a feeling that the filmmaker is playing to the gallery big time n goes to an extent to justify it.. voicing an opinion in this day n age is as difficult or perhaps even more than an act of self immolation that was fictionalised to be considered brave.. @reallyswara ur gonna be trolled slammed mocked made fun of by the custodians of ancient traditions for making ur point but absolutely appreciate the way uve brilliantly articulated it where most have easily been seduced n lured into the visual delight that the film has to offer.. kudos to u for bringing this up.. always loved u as an actor n truly respect ur views on this....", "shwetika21": "@reallyswara I admire your guts for writing this letter. It's unfortunate that those trolling this post are unable to understand the deeper meaning and implications of what you've written. Sadly, a lot of them are women. No wonder we haven't been able to unshackle ourselves from the grip of patriarchy despite centuries of subjugation. What people don't understand is, you are not asking that historical facts should have been changed but that there should have been some condemnation of the act of self immolation. The kind of creative freedom an artist has, they could use it their advantage to address social challenges our society faces today. Since time immemorial the \"izzat\" of a family, kingdom, clan has been placed inside a woman's vagina, without her consent. Women today don't want this burden. It is a burden to be shared equally by every member of the society, man or woman. So yes, I would also choose a chance at life or die fighting than immolate myself coz I carry this burden that patriarchy dumped on me. Having said that I'd also add - Sanjay Leela Bhansali is not the kind of director who makes socially conscience movies. His movies are more art pieces depicting glorious tales of love and sacrifice than those addressing social issues.", "mugdha_tk": "I'm partly agreeing to @reallyswara here. Though the Disturbing thing for me was when Deepika in movie says, aapki aagya ke Bina toh hum marr bhi nahi sakte. AAP Hume jauhar karne ki aagya de. And Shahid nods yes & goes away???", "sweetiepie.chhatarpur.delhi": "Wow @reallyswara well done. I totally agree with you on this. Why the women always sacrifice why not the men? You are so brave & gutsy to put this viewpoint. Our country & society is filled with patriarchy", "shreya_aa_": "Women do have rights. Also sanjay sir couldnot distort the films story . U wanted an ending where padmavati and all other women and children were brutally torchered and killed and raped by khiljis?", "sadeekshyashrestha": "Cant agree with this 'feminist' letter.just want to remind you this film was made over 13th century history. Watch the movie thinking you are in 13th century.", "alliswell787": "Ugly thoughts", "kajal_2468": "Shame.", "rachanarao": "What rubbish. Couldn’t even get through the whole article without getting irritated. Articles like these are contributing factors to real issues and actual problems not being addressed and the word feminism being treated as a joke or overused.", "swetlinaim": "Rubbish..why do we need to bring a feminist point of view in everything?? Its a story of a brave woman, who chose jawhar to save her dignity.. Its completely her choice..no one forced her to do that..such a strong character padmavati had..@reallyswara your letter is so pathetic and disgusting", "iananyaroy": "Is it not upto women to choose death? No one was forced to die and sacrifice their lives in the sacred fire. Respect the opinions of others just as you respect your opinions. Praise the outstanding courage , presence of mind and unconditional love that we can see in the movie. She truly came out to be an inspiration. She did what she wanted and that is what girls from all over the world should do.", "pratyushneelam": "The Practice Doesn't Exist Anymore , And I'm Big Fan Of Your Pure Talent , You Yourself Is A Treat To Watch , But I Suggest You To Consider The Disclaimer Given With The Movie , And Please Don't Be So Rude , And Enjoy The Art !! Your Freedom Of Expression Is Above All BTW 😊😊", "i.mustafa1": "Dear Swara It was a pretty long letter I must say, took a while to patiently read and understand your view. You have expressed yourself very clearly, and u make a lot sense in most of the points mentioned. But the sad part is you've unfortunately perceived the complete soul message of the movie in terms of anatomy, that's what I felt. As Depicted in the movie, the protagonist wasn't force to involve herself in the act, it was her individual and independent call. To live or to die is an individual preference, it's as simple as that. Padmini was a women of different values and you are a women of different values. I respect both the ideologies what so ever. You in your letter have made absolute strong points but the comparison u made with gang rape incident and Johar is irrelevant and they are definitely not the different sides of the same coin. Johar is a choice and decision but rape definitely isn't a choice. U put across some bold points which described how disturbing it was to see a pregnant women jump into that pit. You also said u would opt to live instead of jumping into the fire even at the cost of being a slave to a monster like Khilji. Well Mam that's your decision to live your life and I totally respect that, but why do u have a problem with Queen Padmini's decision. As I said it's individual preference. You very smartly compiled the whole topic to matter of mere Vaginal protection, but there is much more to it, it's about dignity and self respect that the women chose. Your letter is beautiful, exquisitely written yet flawed. The problem is you are imposing your thoughts. Sati is when u forcefully push a women to die when her spouse is dead and that is absolutely regressive, but in the context of this particular movie Johar was performed for self respect and dignity. U are trying to trick people by engaging and connecting this topic with Henious crimes like gang rape and murder. The situation and circumstances are totally different. Well I would like to congratulate u for putting your point across so beautifully. A lot of people actually think u wrote this to seek that 2 minutes attention but I'm not one of them, you are an National a", "richchaudhary": "Saying Vagina aloud doesn't make you a feminist ma'am!you gotta be smarter than that?", "a_girl_with_a_big_dream_": "sorry mem but we r not agree with u what u write in letter @reallyswara", "ag_anshu": "Totally unnecessary. Not everything is linked to feminism. Such articles just dilute its significance. I wonder how you did a movie like Prem Rattan Dhan Payo then? It reeks of chauvinism and female servitude. Quit being a, hypocrit!", "kaunteygosai": "Aek wo bhansali aur aek aap sab log soo called youth icons...pehle itihas padhliya karo...", "namrata.1983ag": "Aplogo ki pblm kya hai...kyu hath dho k.movie k piche pad gae ho..ap is samay reh rahi hai jab apke pas sari facility hai power hai sab karne ka ye 700 sal purani story hai jaha agr koi raja war haar jae to uski ranio ko qaidi bna k unke sath jo karna chahe kar sakte..us situation mai padmavati ne khilji ki haram mai jane se acha marna chuna to kya galt kiya jindgi bhar khilji k qaid mai rehti to apko acha lgta...come on dear free ki publicity pane k lie kuch bi mat likho..bhansali ne jo hua usko dikhaya parde mai na ki sab aurato ko bola jak sati ho jao ya jauhar karlo...stupidity ki hadh hai free publicity k lie shame on u", "soni1926": "And Miss I can understand ur pain for not getting such roles for ur self but reality is u will never even and u gonna do movies like Ara Ki Anarkali and other B grade movies nonsense woman", "atul.gupta.100": "There should have been a public apology for wasting everybody’s time and money on “prem ratan dhan payo”😜", "ashwiniii": "Rubbish", "that.imperfectgirl": "I love your performance on screen ., be it tannu weds mannu or nil battey sannata .. I am a fan of yours .. however coming to the letter , can’t agree with you . The story Padmavat was written in 13 th century .. it was the custom of Hindu society that time .. at the beginning of the movie there was a declaration that the movie does not endorse or encourage Sati or jauhar ., bhansali chose to tell a story that was written by Malik jayasi . So it would have been funny if the movie was showing Padmavati did not sacrifice her life .. your letter made no sense to me , rather I felt you do not understand the whole point of feminism . Anyway I am still a fan of yours and will be", "rajeshrsy_803": "I think you enjoys gangbang @reallyswara", "sharpee.tekriwal": "@reallyswara i admired and respected you as an actor.. but today i lost respect for you after reading the article.. ofcourse you a have a right to your own opinion but without a thorough knowledge about what you are writing... you wrote an open letter which is so degrading to a beautiful movie ... putting vagina so many times in your letter... what were you trying to achieve?? did you really need this kind of publicity?? what is it for... is this cheap publicity for your next movie veere di wedding?? you are a talented actor.. and you are an influential public figure.. please do not stoop to such levels... really disappointed!!", "i_mishmish_i": "So if you were in Padmavatis place, knowing that you will be raped, still you would have let yourself to be one of the victims? It's not actually clear what you wanted to say by writing that letter. Even after watching some of your films, I also felt like the way you felt. Total waste of your acting skills.", "fabianity": "Publicity stunt.. you lost credibility. I really liked you as a person but no more.", "archana_rashela": "Absolutely ridiculous letter", "surabhi.pandey.161": "Swara Bhasker I am proud that you chose to speak the right things and at the right time. AT least you are not like most \"Divas\" who generally do not prefer to \"comment\" on anything relevant as they are too busy dancing to sexist numbers aside heroes ranging between 22 and 60 years of age! This is a thank you note to Swara and a \"Go Get a Life Note\" to the Trollers.", "susmita.snow": "You're incredible..!! Nation need someone like you if then only we could see a diffence...Length was not a matter at all.. #respect", "architect_shrey": "Senseless literally..!!", "biorahul": "Sorry but quite a lame piece. What else you expected from a film set in 13th century? You should have written this when you did a regressive film like Prem Ratan Dhan Paayo which was set in the 21st century!", "dasbeedisha": "I agree with ur view in some part yes, sati pratha, jauhar is gruesome that a woman have to sacrifice her life for the sake of her husband. Even vagina is being sexualized so much. But in that time era when Rajputs were invaded and if they lose to the invader then rajput women do jauhar to save her prestige and dignity from being get raped. Maybe they could have taken some other measures to save themselves better thn get ripped in fire. But its also to be think that being get raped on daily basis by some other man its better to die than living in hell whr every single time ur own pride is being tormented. I m nt saying jauhar was best option or glorifying it but submitting yourself to a invader is also hopeless. Then in today world if a rapist come to rape and u submit urself will also mean the same. It's not abt being felt like vagina its ur own prestige to secure it. Ur statement u told evn a rape victim hv life after that. Do u think so. I will say no coz till nw in indian society girls who gt raped are seen in vry bad way. They hv to struggle alot just to live a life they are in living hell.", "being_vikrant_": "This is how these so called bolly fails try to instigate violence....", "nidhi.verma30": "Waste letter!!", "the_flying_baby.doctor": "Pathetic is the only word existing to describe you and your thoughts", "shkpkp": "Dumb woman who didn’t understand why the movie was made or what history is . Stupidity reach new heights . She can do what she wants dress how she wants but will comment on other woman’s choice .", "niks_9012": "U r actor ? Focus on your work. bc", "sonall.s": "@berrylicious07", "husaini21": "Very nice write up I wached this film last night and totally agree with your opinions and observations...film makers should avoid such historical controverseal subjects which creates unwanted conflicts in public life...", "nuggetsfriesandcoke": "The mere simple fact hiding behind the valour of the Rajputs and the lose of life, limb, wealth, the sacrifices of their women lies the undeniable fact that khilji’s war tested army was ruthlessly efficient compared to that of the clan clashing Rajputs. Which may not palatable to the present day Indian. But this is history and should be treated such. India did not exist before 1947. The subcontinent was riddled with fighting among those reigning local kings which could conveniently be used to the advantage of the invaders. So anything before 1947 should be viewed in lieu of historically prevalent customs and circumstances perspective.", "deeksha_mehrotra": "Beautifully written. 100% correct. Applause 👏", "hi_chinmay": "When everybody is appriciating the film here's swara bhaskar (or ker) giving her review that nobody gives a fuck to......Think out of the box but dont be a sucker for publicity", "hazeljadhav": "Good on you for writing that piece! Enough of this rubbish cinema - we need intelligent cinema that is more relevant to things that are happening today. Not this archaic misogynistic nonsensical crap.", "varada.kay": "Dear Swara, while I understand that every one has to a right to freedom of spech and expression, why must you feed into negative energy and put down a film which is merely trying to depict and show a story. Sanjay si is not advocating for jauhar nor saying it is right in any way. If films only showed the good thing in life, how would people know the difference between right and wrong. I like to think we belong in a society where we can appreciate film and artistry for what it is . The content in films gives us different perspectives of life. Women are strong individuals and no we do not need to sacrifice our lives, but this film is fiction and it is merely a depiction of a tradition. After all that this film has been through, how can you point your fingers at Sanjay sir who has gone through so much show the magnificent life of Rani Padmavati. I think writing this article was in very bad taste and I think one should consider the sentiments of the people you are hurting when writing such. Please henceforth do not try to take attention away from the movie for selfish purposes. I think Sanjay sir has always given females a very important place in all his movies from the beginning. I hope you understand that I am not trying to hurt your feelings, but reading your article made me very upset at how you pointed fingers toward Mr.Bhansali.", "agrawalvagisha": "@envy_excursion @iipsitagupta just watched padmavat and I'm in absolute shock of how incredibly shameful this movie is. I dont even know how to explain to my non indian friends why we accept antagonizing a whole faith and religious group and creating a massive divide of hatred between people and how we glorify such misogynistic, inhuman practices. Why is bollywood like this you guys", "prateekmishra_5": "attention seeker that is what you are", "sarikagupta96": "No disrespect to your view point, but this is not really logical. I think there's a difference between doing things cowardly and bravely. And it has made all the difference in the movie. Infact, Bhansali sir had done it so right to show the 'Jauhar' act not as a result of fear of Men but as only as a choice of women.", "lehgab_oed_nrak": "@reallyswara what is sad and quite disgusting with your open letter is your sheer ignorance of history and misinterpretation of the visual interpretation of a story derived from a poem on Rani Padmavati.The context is plain and simple which however is shrouded by your fake feminism. The movie when looked at objectively is in fact a tribute/ode to the great women of India and the true feminists who took decisions and braved through adversities. Your words sure have attracted attention and one can understand your craving for the same since you belong to a class which gets a high from writing illogically without basic comprehension of the historical circumstances more importantly with utter disregard for the great women of those times. Hope you continue to write such letters so that people can decipher true champions of women rights and emancipation from the fake feminists like you.", "palwal_anju": "Swara if u have 2 options.. u would surrender to cruel person like khilji and die with torture and rape or sacrifice their life for selfrespect and dignity........ what would u choose.. its very easy to make a controversy about this so use ur brain... bewazey k publicity... u r not capable of undrstandng d meaning of sacrifice ...", "ursrobheart": "@reallyswara The creator himself repents creating Eve after Adam. Why so much fuss about it. This is how the world and the human creature is. If u ANALyze the past ancient history everything happened because of Women or in your own word Vagina. You are in the entertainment world so let just entertain people and get entertained. History channel nahi hai amma. It's an Entertainment. Please don't Enter into other topics. SLB is making movies to entertain the audience not to make u feel like a vagina...matlab kya message tha bhai..Salman made a boring lengthy movie called PRDP and u worked in that film also.. Agar yehi Padmaavat mein Salman hota..not a single word u would have uttered. Requesting you to only entertain us with good movies and work hard.U have a hell lot of talent. Don't make us feel like dick by reading your messages.. Cheers Girl. God Bless.", "chudailchokhri": "What rubbish!!! Like seriously!!", "aryan_purohit_": "I see your point about glorifying it in context, but also it wasn’t about being raped once. You think khilji and his men would have raped them once and then left? No! They would have captured them, and probably made them sex slaves for the rest of their lives. I think choosing death is a preferable option for the majority of people- men or women!", "vivek_20005": "Ha.. Ha.. Ha... Look where these feminist crusaders are heading... This is so sad and pathetic...", "thetanyasharma": "@kkjarushme read her letter and then read the one released by some people behind the film👌 they explained well what a \"vagina\" is✌", "ad.yay.an": "The only thing that is good is the comments section is that everyone has opinion. Sadly it's also the worst thing when the other person/s don't agree with it.", "saaagarrrrr_jagggiiiii": "@reallyswara i was a huge fan !!! I admired ur outspoken and bold statements. But today, i am sorry but u have no point at all", "abhi0518": "To all those diluting feminism by misconstruing it time and again, a fitting response from the lyricist of the movie : https://9gbzindagi.wordpress.com/2018/01/28/an-open-letter-to-all-vaginas/?utm_source=inshorts&utm_medium=referral&utm_campaign=fullarticle", "tabishi11": "Kya bolne ki koshish kar rhi ho behen", "mehulmangla": "@reallyswara Seems like your PR team is in full swing. This will surely not keep you deprived of recognition and limelight. Koi isse kaam dilao re baba 😂😂😂😂😂", "preetdayal": "If I ever get captured by ISIS I would prefer dying than becoming a sex slave..thats the reason they all committed Jauhar..may be for u being a sex slave is fun and morever sex is more important coz u have a vagina...useless actress..pehle khud itni achi acting seekhlo..", "sharmaguncha": "You did a movie Ranjhana. Didn't it glorify stalking?", "idbox": "@reallyswara 🙌🙌🙌", "_maschiaccio": "@nutwarii", "bhakti_bilolikar": "@reallyswara ... see as per movie the character of Rani padmavati knew that if she would get caught by allauddin khilji she would get exploited and molested.she chose death to avoid this..not because she was already molested or raped... please can you tell me what would you do if you know you are going to b molested ,and may be tortured to death and u have a choice to die..what would you choose... would you surrender to Ur molester or would you did a death of dignity..?", "ilamisa": "You will find a problem everywhere you look for one. Especially in a historic fiction (of which the original caste of Rajput people claim that their women of that time should be in parda and not openly prance around the way deepika did). So really, SLB showed it as best as he could. Don’t be mad at him for showing how women dealt with a threat back then, maybe be mad at the society that that’s what they had to resort to.", "51dart": "Movie represents a era gone by!", "paras_iam": "@sanjayleelabhansali should thank karni sena for making this movie popular... He has no right to waste people's money in movie like @filmpadmaavat..it seemed to be like rajasthani jewelry n sari exhibition.. Plot is so weak n story is having so many loopholes..", "cherrybediarora": "Swara Bhaskar these comments much expected from a bonehead like u . Feel sport for u that u will never act in Sanjay Leela' s movies . Ppl like u use such cheap tactics to garner attention.", "mihir1990": "@reallyswara I respect u for d wonderful actor that u r. But such an open letter to gain limelight was not required. U r already changing lives with ur acting don’t stoop to such levels of publicity.", "kanikamalik7": "I totally disagree with your point of view. The attention seeking headline just makes matters worse. It is a sad attempt at taking contempt at just about anything these days.", "irasidd_": "N mind u she was not raped that ur going so mad .. unhone to jauhar kr b liya tum to soch k he dar gyi dekha ..! Himmat cahiye hoti h ye b krne k liye ... tumhari trh bakwaas to koe b kr sakta hai", "narsihrahul": "The history denied them the rights you mentioned, not SLB", "karthikshah": "@reallyswara I think you need to chill rather than always looking for PR", "bollyfan_22": "Sadly it’s your vision, u missed all the smartness and power showed of a woman while just focusing on V .. #timetochange @reallyswara", "swaatii.s": "Ma'am how could you say that?? You needs to recheck your historical knowledge! This a part of our history ,we can't change it and it was shown as mentioned in the context of this movie and that doesn't mean that Bhansali sir is provoking anyone and promote such things!", "sir_eats_a_lott": "Why do people still believe Padmavat is history? It's not. It's literature. It's pure fiction. Unless you think a talking parrot that has real conversations with people is history.", "y.unnati": "Seriously the movie is epic loved it how can people hate it??", "singhsanfab": "Continued...women and children jumped into wells. Invasion of India,was very real, and what felt best at that time people did to protect their nations honor and heritage and hence today you proudly living in a India where u r free to do as u please and not in some indiastan, please respect history and people who lived through it.", "love_chameleon": "Cheap publicity...the film shows women is a positive light, Padmavati is shown as an intelligent, courageous woman and the Jauhar representation totally contextual to the story....", "divjyots": "@reallyswara Swara, you are amazing. Thank you for penning your thoughts so beautifully and standing up for all women everywhere. I agree with your sentiment whole heartedly and am so proud that someone with a voice that will be heard has openly taken this stance. Hooray for you!!", "lo_lo_lopa": "Miss ishita I hope I was able to enlighten you on some respects with my comment, next time before concluding on something, gather some knowledge first", "oh_athenaa": "They committed suicide because they wanted to!!! A man or woman have the right to did whatever THEY see for with their lives. Stop being so hyper and make everything about feminism. It makes people avert from what's real. It is a fictitious movie based on very strong women who gave their life because they THEMSELVES valued their honor and accepted death over being tortured. WHAT IS WRONG WITH THAT? NOBODY THREW RANI PADMAVATI INTO FIRE. It's not a case of sati. It's a case of a woman's strong footed love and sacrifice.", "pregnantdp.edits": "Sit in your home waiting to get raped, see if you would do anything about it. Back then there were no options, now we have them. You’re right but you can’t apply today’s thinking to a movie from 700 years back. Can’t change history.", "nazzzzia": "@reallyswara takes guts to write an article like this for an actor to a director of that level. Takes pure confidence and pride to stand and speak up when it's needed rather than letting it pass just because you don't want to jeopardize your relationship with your dream director. I appreciate the respect you have for Mr. Bhansali's craft while still standing up for what you believe and not caring about the consequences. I agree with your point of view completely. I am a huge Bhansali fan myself and the jauhar part did pinch my heart and made me uncomfortable. Very well made points and thanks for speaking up. Respect 👏👏👏", "smmausaja": "Brilliant", "uji_pon": "Why is it that people think that history is a 'truth' out there to be discovered and told in all its authenticity. Neither the historian nor the people choosing to use versions of what is written to tell their story operating in a vacuum. If you choose to show Rajputness from your version (which many others will. Happily share) , then you will end up glorifying Sati, no matter what disclaimer you put! In a day and age when women should be walking towards a today and tommorow which increases their life options, we have a 180 crore movie showing them rushing to their death to save their community's honour! This is not 'history'. This is the film maker choosing to make a film based on his idea of Rajputness, womanhood, bravery, Muslims and queer persons. The outrage (without banning). Thank you for writing this piece @reallyswara. I could not agree more with you.", "laugh_heartily": "Sorry u lost all respect today ...get the reality ...if movie is based on rape against women .it doesn't mean that film is glorifying rape culture ..thses kinds of film not release every Friday.. RESPECT THE ART OF SLB \" MS. VAGINA ....", "manaaalipalve": "@reallyswara You really need to read what @themeltingwords 's admin says about your dumbass article ! Read it and get some fucking peace !", "lovenlive_dancenyoga": "Swara, you explain every sentiment I felt when watching this stupid and backward movie. If media (which has the biggest power to sway people) doesn't support progressive society then there no hope for everyday human beings. I was really ashamed to watch this movie with kids and families. I am so glad you were able to put all those feelings in words. Thanks a lot!", "therealharish": "How the hell could you even say that? You're such a hypocrite. A women has all the right right to choose between being a sex slave or to die. Do you even know what it's like to be a sex slave? Do you even know the difference between being a sex slave and getting raped? Being a sex slave means getting raped again and again. A thousand times by a thousand men. And if you are given the choice between getting raped a thousand times or be dead, would you rather not be dead? Because I would be. What did you want to show by using the word vagina so many times in your article? Using the word vagina several times in your article doesn't make you a feminist. You say celebration of Jauhar made you feel like vagina? You know why you felt this way? Because you are the one who thinks getting raped is only about vagina. That getting raped is an act that includes penetration of an unwanted penis into a vagina. That only vagina is harmed when a women is raped. You're so stupid to talk like that madam. And what was that? You talk about Sati system and Jauhar in the same way? As if they are nuances of meaning? No they're totally different. One was a women dying for her husband because she couldn't imagine her life without him. This act was sick and needed to be abolished. But Jauhar? It's about choosing death over being a sex slave. Over getting raped for the whole lifetime. How can you talk so stupid? You call yourself a feminist? This is not called being a feminist. This is called being a faminazi. Better think before you right something like that next time.", "chintankamal": "I am sure no Bollywood actor will like this post, however kudos to @reallyswara for pointing out the obvious which many I am sure will look to overlook.", "sahebashaik": "@rizwana.anjum @kulsum_mohammed inn bhot zyada kardalti hai na", "divyakhannnaa": "Oh my god I don't understand why in India people have such unnecessary views on things they should be least bothered about?", "jessmarie.d": "Yeh film ek history ka artistic interpretation hai. Jauhar and sati sadly happened, and this movie was based on poems about rani Padmavati and in those poems, she and her people commit Jauhar. SLB was making a film about one version of historical events and wasn’t sitting there thinking “hey let’s make a romantic movie about Jauhar”. In fact, she asks permission to commit Jauhar if her husband does not survive, she doesn’t get forced in to it. The movie is about the characters, not their actions and to write such a bakwaas article comes across as attention seeking. If someone is really stupid enough to watch Padmaavat and take away that they should commit Jauhar then they probably should seek mental help because nobody I know would have had that takeaway from the movie. I did not in any way feel this movie was an insult to femininity because it was a movie about a version of historical events that were recorded long ago.", "sahasuravita": "I am someone who has always stood up for women's rights.. but in this context I really feel the urge to say.. the women chose to \"end their life\" through Jauhar and it wasn't imposed on them.. Sati and Jauhar are condemnable practices in themselves but if you have read Albert Camus you would know people should be given the right to end their life rather than continuing something absurd.. Bhansali has not shown Jauhar as Just something imposed on women but something they chose to do... to avoid being slaughtered and raped... I hope you understand the difference... they chose the right to die...", "jaysahana": "#really swara", "divashetty": "I am damn disappointed in you ... thought you were an intelligent woman ...", "alan_does_stuff": "Guys she only saw Vagina *facepalm*", "tasnim.45": "This is a story of ancient India.. Bansali has shown the old Indian rituals, He has not encouraged them. Try to understand the main point", "rover_raba": "At the end of Prem Ratan Dhan Paayo, I felt reduced to a stupid average person who couldn’t resist temptation to watch great star cast - which in reality was a regressive story of our society... Just some thoughts 💭", "nickky__nick__": "@reallyswara at least there is someone who thinks like me. Appreciate ur thoughts...💃😂💁", "its_marsolo": "@reallyswara I agree with your thoughts wholeheartedly and I am a big fan of yours but I do feel like this is \"history\" and he was just telling part of \"history\" In those which you said sati was glorified and that's how he projected it, trust me I know it's very uncomfortable to watch their \"glee\" to jump into the fire, however influential this is \"cinema\" it's telling of a story present or past. So to sum up I'm confused. .", "sohaibakram92": "Cuz u have vagina re .... cuz u have re", "samruddhithebookgeek": "Actually I agree.", "tejas.bhatiaa": "I guess the situation was evenly Vaginal in Prem Ratan Dhan Payo when Salman (duplicate 😂) offered you his palace", "aarkay977": "Superb swara..", "shreya_sri1604": "@reallyswara hadd hai history follow na karo toh karni sena ko problem hai, karo toh REALLLYYY SWARA ko problem hai. SLB, me @deepikapadukone and @ranveersingh are so done with existing between such minds. 🤗🤗🙄🙄🤐🤐", "tushardarwatkar": "Such a retard thoughts.. we are in 21st century.. learn something from other actresses like @sushmitasen47 \"You have WOMB of the universe\"", "aditya_patange": "Role doh re koi is gareeb ko...", "p4pritee": "Jauhar ka Scene shoot Karte Waqt dipika bhi depress hui thi kyu ki pehle kaisi Kaisi prathaye thi ye sochkar Par Aaj 2018 Hai aur aj ye sab kuch band hai aj Ye gunah hai ab iske bare me bolkar kya fayda aur waise bhi ye riwaj film production ne nahi Start karwaya na", "abhijitlaha_dgp": "Naxalite", "m_rajcool": "This is not the way to b in limelight. Its just a movie. Its a history not a story written by SLB. N being an actor u should respect their efforts. N most imp SLB shows so much respect to RAJPUTS I REQUEST ALL THE RAJPUTS TO WATCH THIS MOVIE. Ky kamaal k log hai rajput mjhe ye movie dekhne k baad pata chala. Respect for all REAL RAJPUTS", "minniparnami": "Too desperate to seek attention? Go brace your acting skills for your so called wedding movie and grab the attention there. Don't follow these cheap and stupid acts to get the limelight.", "juhy1123": "@reallyswara very well articulated. Thank you for writing this so beautifully on behalf of some of us!", "hey_shalini": "It’s history and Sanjay Leela Bhansali has just portrayed it in the most beautiful way. Being a smart ass which you are, you should appreciate the art and have some good takeaways on how the customary and obsolete culture was wrong that persisted back then. Stop blabbering now!", "pratyooshatripathi": "Director just showed what really happened with the queen padmavati and what pain that lady really felt... disclaimer were already given in starting...just to be in news and write any article is useless....", "anusara2000": "Loved your open letter. You have articulated it so well.", "vinnytro": "@reallyswara your argument is apprehended but you shouldn’t take it personal as the movie is about rulers and times of history, which you cannot change. you should think of the coming times where equality is one of the foundation and the efforts world leaders are taking for a utopian state.", "vibha_vasudevan": "It is just a film nothing more...he showed wtever had already hpnd.....he didn't made any fiction.....if he had made fiction then ppl will protest he is saying lie......karo tho bhi problem na karo tho bhi problem.... that's really sad. Some Indians are still living in 1218 not 2018", "nivedita_911": "I read your letter the first thing this morning and what I realised is that you have articulated my thoughts in a precise, powerful and definitive way. Thank you so much @reallyswara", "abhijit_is_here": "wow! someone showed the guts and stood up for women. bravo!", "sriv.pallavi": "It’s a period movie, and it’s facts that have been shown in the movie! At that point of time, women didn’t have democratic rights where they could protect themselves, if a barbaric islamic invasion was happening, I think Jauhar was the last option, better than getting raped everyday! You have over reacted and written the article for publicity. More is expected out if a talented actor like you.", "ankita_shah98": "*Attention seeker*", "ashutoshs.shankar": "He probably is aware of whatever you've said. But I don't think the film glorifies Sati but, glorifies the event that took place. And everyone was aware that the film is completely on the Queen's Jauhar act, and I assume you too knew about this. So why this?", "vish.sharma.27": "Says the actress who acted in the ever-progressive Prem Ratan Dhan Payo?", "gardenup.in": "Definitely support your idea, but more than that I appreciate your boldness as an actress to speak out your thoughts loud and clear. I don't see that very common in indian film industry. And perhaps the lack of this ability in actresses has failed to inspire 'ordinary' women. More power to you 👍", "sivanikasireddy": "Read your article Swara. It is very hard to put an end to a social evil but to ignite it is easy. And your article is very informative and beautifully presented. Well written and genuinely agree with ur thoughts.", "muksgraphy": "Totally support her. The movie really glorified the practices of self sacrifice. In the era of women empowerment, this was an unnecessary regressive story", "nita.rlm": "I agree with you. I watched it and felt repelled...for various reasons. The black and white cardboard characters. The too good for words Padmavati...interesting in the beginning but lost somewhere in the movie. As if Beauty and spirit can't exist together. And mass sati..shudder. The pregnant..the children. Romanticized. I'm not saying don't stay true to the story but show the brutality of it..the reality of it...the anguish. Not as if it's some sort of ...women empowerment.", "gargi_jana": "Ohh yes Prem Ratan Dhan Paayo was sooo soooo sooooo progressive. At that point in time what did you felt reduced to?? And who said VAGINA is without any power? As Sushmita Sen rightly puts it..\" it is the womb of the universe\"", "nismachauhan": "Thank you for penning this @reallyswara 🙌", "aakhil_sr": "Hats off @reallyswara . I admire you!!", "kkraj_": "Very strong arguments", "_abhishek_mohanty": "Got ur 2 mins of fame @reallyswara he didnt create the history .. its a story which s portrayed.. chalo kuch kaam mil jayega tension na lo .. warna ..prem ratan pey nach lena behen ban kar salman ka ..", "sweetshiru": "@kangana12345 so according to you because of this movie now all those who have a crescent moon and a star on their flag are barbaric villains.", "akanzrai": "I like you madam but this time your thought process is wrong ... This is based on 1300 AD time.", "megmagika": "What I am loving here except one odd comment we see a discussion here without abuses being hurled. And that's such a pleasant change. Thank you all for being such a positive part of a discussion. God bless you all. My point of view is it was a reality of those times. An era gone by. And I would enjoy the film as a film rather than attaching judgement on something that was Once Upon A Time", "pagla._dashu": "The thing some of you don't get is that showing jauhar in a film is not what is problematic but glorifying jauhar is.", "jaiswal.priyesh": "Idiot @reallyswara just to gain cheap publicity..", "preeti_san_bhardwaj": "Perhaps she needs to recheck her historical knowledge a bit. Sometimes we all need to think twice before we talk. And if she really saw the movie, I guess she missed the part where a reminder was given that the movie is in no way glorifying sati. Only because you have a mouth, does not necessarily means you can talk. Paadmavati is admired in India for a reason, a reason which has more to it than Sati. She is a woman of power and determination. Her determination of not giving herself up to someone like Khilji is a matter of respect. As @reallyswara has already cleared that Sati, Paadmavati's way of saving herself, was applicable in 13th-14th century, similarly in 21st century a woman have other ways of saving herself from sexual abuse rather than just giving into death. In no way am I disagreeing with her that women has the right to live after being raped but she must remember that women has the right to repel and stand against sexual assault and save herself when being confronted with such situation and no ma'am Paadmavati did not die after being raped. May be Sati was Paadmavati's way of doing so and fighting is ours. Perhaps @reallyswara you have missed that part ma'am. Thank you", "divyansh.singh.20": "I agree with your points of women has right to live... But I guess her highness padmini had the right to choose and the movie had to show the history of the courageous padmini who went alone to bring the king back. So movie can't be blamed for promoting jauhar or sati in any place. Here I disagree.", "wanderer_hog": "In unison with your thoughts.", "abhinandan_sharmaa": "Whatever is touched by the monarch of grandeur will definitely turn to gold...like what happened with this movie. He didn’t glorify it(Sati). That’s just his way of presenting stuff in his movies, may it be a nurse(Aishwarya), a blind girl(Rani) or anyone else. The point is, whatever Sanjay portrays in his movies will definitely look grand. And a practice which in itself was so much of a hazardous nature can, in no way be portrayed any less...what can we say? Appealing, especially when it’s demands were catered to by a director like Sanjay himself. As far as the letter you wrote is concerned... I think that Padmavati did what suited best to the then circumstances, as taking away one’s own life was and never will be easy. It was just a movie. No one actually knows what bad exactly happened. It’s just a simple story of what happens when a person’s Self-respect(pride, honour etc.) and/or life is in danger and only one can be chosen. Padmavati chose self-respect. That’s just how I feel. I’ve still not seen the movie.", "occasionallyroars": "i watched it last night, and was deeply surprised that no one was talking about it. I had some folks in te theatres laugh everytime khilji's characters handled a women with inconsideration, the scene where he sprays itar on a women and rubs it off him. And i was deeply disturbed till the end - its a movie and one can express what one wants - but its problematic when as a society there is such little popular art such as lipstick etc which tried ro break the notion of women as bodies/desirable bodies only and so much which (unintentionally but) propagates the same notions again. Thank you so much for beginning a debate - i was very surprised to look online and see there is no conversation about it yet (till lat night)", "vikram.sharda2006": "Don't agree with your thoughts Swara", "t_h_e_v_a_r_m_a": "Bi#ch please", "loveopiuon": "Why don't u protest against those those cheap and vulgar item songs that shamelessly objectify women???", "lone_tickets": "You do realise that it is a historical fiction drama, based on real situations that people faced, back then.. Women were as strong headed that they chose self-immolation rather than being taken and assaulted by ruthless conquerors! That was their way of being feminists.. I'm not saying it's right or wrong, but that was their reality and they dealt with it in a way that they felt was best.. We need to understand and respect that! Even though we might not agree with it all..", "chirayumankad": "Can we change events of Mahabharata where draupadi was won in gamble... Where Ram was sent to Vanvaas and Sita was questioned to prove her purity.. Can we ask Indian freedom struggle to fight differently or berate Gandhi, Bhagat Singh, Bose to disagree with their style of freedom fight.. Stupidity is at free sale these days...", "part_one90": "Such a thoughtful expression !!", "abhi__itsme": "Thats the problem with liberal shits. First they decide to support something cause everyone else is condemning it.. they have their own reasons..but they can not stop right there cause they are liberal shits they can not stay calm they gotta make everything complicated.. fu", "giashake": "Well said Swara", "jhasanchita": "Great write-up @reallyswara !", "inabajwa": "You've got this all wrong , Swara. I walked out of the movie feeling nothing like you!!", "pprriyam": "He can't change history. If he shows jau har in a bad light, it's going to jauhar his movie literally. The guy is out of options, same way that padamvati was. Let's cut him.some slack. I do agree that the practice literally made it about guarding your honor, but honestly what do you expect from 15th century marwad where everything was so based on pride.", "mehrwal": "Ys I'm agree with you...", "meerajhalani": "@reallyswara best best best. The world needs more Swaras!", "arjuncp09": "U r a big V.", "sunaina_kunnawar": "On point 👍", "saroshgul": "Nailed it swara!!", "dhee_raj_imagerie": "Would choose to disagree... Cinema is cinema... Of course we want to make a noise, of course we want voices to heard. AND of course those practices shown ,nay even that mindset was deplorable. But looking at it from the filmmakers point of view, it was just yet another perspective of unrequited love, this time one sided, even if superficial and like Swara says vaginal. It's only happenstance that this was the milleu he chose to set it in. Yes, maybe a voice of dissent against that practice of Sati/Jauhar could've been reassuring, but if that didn't help the script, it didnt.", "roop.chorcha": "Well written.", "vinodps129": "Very well written !! And I sincerely hope that there is vocal support to your letter from within the industry too, although I know that’s asking for too much 😊 !! More power to your voice, and we look forward to seeing you more on screen doing the kind of work that you are doing !! All the best 👍", "the_unsecular_critic": "Don't worry.. He will launch you soon in his next blunder..", "priyadarshiniurvija": "Thanks for putting words to my unease and discomfort with the movie. I was in awe of its grandeur and at the same time had my stomach churning with all the regressive patriarchal portrayal of persons and events. Current political times call us to be conscious and conscientious. One cannot get away by stating it's a mere portrayal of a story already written. As you have pointed out aptly, context of today's India cannot be ignored. I would rather choose to defend mukkabaaz over Padmavat.", "_dr_smilez": "@reallyswara \"vagina concept\" rock!", "soyveronicagautam": "I am glad you called it out, and the way you did it!", "athenianhufflepuff": "Ma'am, I appreciate you brought the olden times cruel practices in light but the movie starts with a disclaimer that the movie doesn't support or glorify sati. It's a mediveal age movie and again it has to be in sync with the times in which it is made. So I would say that you actually made a wrong and unnecessary point there.", "rushabhsalvi": "Like really.... Read the disclaimer please @reallyswara", "indianwani": "This is a real story...not fake...and a rape is for one day that shatters life and a women sadly haunted by that one day forever but as a sex slave u die everyday by new death so that's the difference...", "amitprabhale0102": "Chak de India tried to glorify women's sport, it didn't make ppl watch women's sport. Feeling of patriotism aftr watchn movies based on Indian Army diminishes aftr coming out of theatres. Thus, don't feel that Padmaavat is glorifying Jauhar/Sati. Women @ur home ain't gone jump into pyre after watchn this movie. Chill karo", "mansi.shaktawat4": "Talk about getting glorofied by unnecessary feminism.", "panchhi_perspective": "I loved this. Disclaimers are given but how much of it is really read? There could have been visual representations to send the message of Jauhar being wrong.", "sanuchow": "Fantastic Swara 👊🏼👊🏼👊🏼", "muditp90": "Good letter but bad timing and badly executed. U failed urself as a feminist. The movie didn't glorify sati or jauhar. It showed that era and the truth of what happened at that time. I thought u were beauty with brains but this time.. just an opportunity seeker for a thought that is irrelevant in this situation.", "its_suviiii": "I do not support your points .The first and the formost reason being, they did not choose to save their vaginas from disrespect but to protect the rajput dignity and not letting some devil like khilji to rule over the rajputs and increase their dynasty both in area and population. Get your facts clear, the population of mughals was increasing drastically in India and rajputs sacrificed their lives to save their culture, religion and history. Just an estimate, that there were chances if padmavati did not indulge into jauhar, you could be a Muslim. The population of Muslim's in India would have been more than the Hindus.", "midhatkidwai": "Bravo", "ashik_rao": "I have watched the movie, and I completely agree with you about how Johar and Sati were glorified in the movie. Thoughts and awareness like these are a must for a culture like India’s. But I only wish you had not written the sentence ‘I genuinely believed and still believe that you and every other person in this country has the right to say the story they want to say, the way they want to say it, showing how much ever stomach of the protagonist they want to show’. What cinemas can show/say is a blurred grey area and I don’t think there is a black and white way of seeing things there. As much I agree with your conclusion and point of view about Johar and Sati, for me, you fall short of credibility when you say ‘every person can create whatever they want’. If before the Padmavati’s release, we agree that Bhansali can show whatever he wants(which maybe a wrong assumption), we shouldn’t be complaining about the movie post its release?", "raj.sharad": "Ranveer n Jim@were terrible. Great write up but", "saurabhosle77": "I agree", "bajwajasleen": "👏👏👏 @reallyswara", "tj_trupti": "R u mad@really swara... khud to kaise kaise third class serials karte ho or dusre ko nam rakhte ho. That movie is based on bistoric event and not SLB's thought. Or agr tum movie banate to oata chla koi dekhte b nai third class movie....", "shreya_1911": "🙌🏼", "aaceeshh": "Just publicity stunt from your end ma'am. The Disclaimer at the beginning of the movie clearly says that Sati and Jauhar isn't supported by the makers. But the makers were not to distort any facts and thoughts behind them committing jauhar/sati.", "senjuti.ghosh": "But you said all from your heart which is really commendable! ♥️", "anitaamajumdar": "This was such a thoughtful and well crafted response. Especially given the global conversation about women’s worth currently. Exceptionalism can’t be applied just because “oh it’s Sanjay Leela Bhansali, he’s a true artist.” My read of your article is not that you’re advocating that it depicts sati/jauhar, but that it lacks a 21st century filmmaker’s perspective and glorifies the assault/death of women without internal critique. Bravo on opening up this dialogue ✊🏽❤️", "husnaamoid": "The movie had a disclaimer if I remember right , that it does not promote or glorify Jauhar.", "poonamjs": "Oddly enough, I disagree. The art film depicted a time and age where society was different. I never saw it the way you did. I was far from being offended. It takes a lot of courage to end one’s life. I’m a Rajput myself. I don’t necessarily agree with the principles they had remained anchored on. While sati is an extreme way to “beat” the enemy, it was quite a tragic but powerful way to make someone leave with the “this was but all for nothing” punishment. If in today’s time and age, we could see people jumping off the twin towers 9/11 in a bid to save their lives, who are we to question the decision of the women then whose land was invaded by enemies? We didn’t walk in their shoes.", "v_i_n_a_y_28": "For queen that was a choice... Either to live as a slave or die as a free women ....", "moin_rais": "Sati and Jauhar were the different forms of suicide. They used to force women to die", "manilisokar": "@reallyswara beautifully crafted. You are so right and precise loved it #masterpiece", "sw.ar.aj": "A rank abuse of freedom of expression. You feeling like a vagina is pseudo feminism.", "justsohyouknow": "Thank you for writing this @reallyswara . Much love and strength. ❤️", "_anubhuti_": "Ummm... it’s a story based in 13th century... and that’s how they have been portrayed.. can’t for once we see cinema as just Cinema or art of work considering what beautiful performances movie had...without mixing them up with casteism, ancient evils, patriarchal society etc etc... its a beautiful film based on ancient poem Padmaavat so let it be in that genre.", "07priyanka": "You missed the disclaimer given that it is in no way glorifying sati or jauhar! Get your facts correct. Bhansali did an art work, not provoking anyone to do jauhar. That's a period film.", "naked_outpours": "It's actually the thing I feel too. It should not be taken as mere criticizing but the subject of actual criticism lies within which should be dealt with. There is no doubt about the bravery and valour of our queens but it's actually the wrong aspect we are glorifying and portraying. I support and appreciate you @reallyswara for genuinely penning it down to Sanjay Leela Bhansali Sir. We totally love his art and vision but it's a certain wrong in trajectory this time. Much love to you👍✌", "vidhushri.singhal": "I believe that there is a huge difference between Jauhar and sati. Comparing the two isn’t right. The first was done to protect one’s honour, the second, simply in a belief that a woman has no right to live without her husband. Jauhar was an act of bravery, sati of cowardice. While, of course, neither is ideal, seen in the context where the women were not equipped to protect themselves against an army governed by a barbarious king, it was perhaps the bravest thing to do. Let’s not view it outside it’s context.", "chaitanyakamdar": "You should have felt only left to vagina when you were trying to open Kundan's pajaame ka naada!! Never go fully retard as well as cheap!!", "the_delhi_boy": "He didn't try to do anything like that. He just showed you what happened in the past. Why being so judgemental over it. Such a stupid thing. Those times were different. Dignity and self respect were the reasons people lived for. Times have changed now and you should not compare. @reallyswara", "barnalisingha": "Dear Swara... I think its abt the 13th century whr sati or jauhor ws nt a big deal... I think there is no point to compare with recent scenarios... As Padmavati is based on rani... So evn Bhansali cannot change it...", "ravikalra0": "Totally agree with you! The tradition of Sati is a black spot of Indian History! Sex or no sex, pure or impure.... just nothing matters more than life. The society which allowed this tradition of suicides was shameful indeed!", "mobinshaikh740": "Agree with that", "thefarebi": "Thoughtful point of view.", "kwcv_insta": "well said!", "sumona_bose": "I absolutely agree! This is not the time to glorify these things but the movie was seductive in its magnum opus style. Just the question arises whether the magnum opus related to Sati and Jahaur should be cinematically portrayed to be a glorification.", "raghavnelli": "Spot on. Glorification of Jauhar n portrayal of Khilji were the negatives imo", "bhaswati_das__": "But Jauhar was the truth of that era. She actually did it... Whats the point in comparing History with the present. Bhansali cannot show killing Khilji by Padmavati.", "anandm_official": "Direct, nice, bold.. But still no one is speaking about whether justice has been denied to KHILJI in the zest to glorify the rajputs and jauhar. Sad that history is taking a beating big time.", "_the.real.sam": "👍", "riyanshpandeyofficial": "Exactly the performance was just outstanding and loved each and every character ❤️❤️", "prashansha28": "@neelam.bagaria"}