{"shi_vm": "@reallyswara prove yourself", "rohit134569": "You mentioned \"devi-stan, temple in the post now will you be mentioning Priyanka Reddy brutally raped and murdered by a \"Muslim\" Mohammad Pasha?", "aslisonamsingh": "Hello kutiya 😂😂😂 ka hua ab kuch Nhi bologi baby??????????", "rahul_agnihotri93": "Madarchod Randi ab kuch ni bolegi ye bloody ###", "nisha_ydvv": "Sasti soch ka isi se ghar chalra hai... Movies n ol mil nai raha t yahi gandgi deti rehti.. india per black spot", "divyabhonge": "Miss ghatiya women 🙌plz.. ye caste dekhke drama krna band karo tu itna ghatiya aurat he iss baat me no doubt kyuki tu caste dekhke justice mange wali kutiya he waise bi mullo ke liye itna pyar he to ja apni marwa unke niche actually Teri jaisi ka rape hona chahiye tb hum dekhte he kitne mulle log tere liye justice krte he #ghatiya_aurat 👎", "gohilsujalsinh": "Tumhari tarha moke pe nahi film ki pramot karne k liye kuch bhi matlab kuch bhi", "tulsimalam2001": "Gujarat ko kajal ke liye bhi bol dek uchh", "ankitraj67": "So now you are not ashamed 🤔.?", "yaseenmd518": "I support . Justice for Asifa", "aabtaak56": "Cheap swara 💩💩💩", "dewashish1990": "Not ashamed now?? Oh sorry this one is not in your agenda!! Twinkle was also a little child. If some humanity is still left in you, Raise your voice for her too. #justicefortwinkle", "anup020992": "Where is your protest for twinkle sharma, drameebaz aurat...🤔", "karan.inn": "Dear all who ever is expecting a placard from Swara in Twinkle, I would like to remind you that Swara will do stuff which will divided this country and cause communal rift.", "charcoal_rim": "Where is your placard now?? Hadd hai yaar besharami ki.... Utho... Be a man", "enterprisesshubham93": "Is your father or mother is Muslim?? As if you are so biased.. That's really unfair", "upakuldas": "oi Suwar bhaskar", "abhay011615": "I will stand for this rape victim and not that rape victim.....makes you a narrow minded lady but hinduism will hold you from you soft hands and make you stand for each rape victim so that rapes does not happen again......kindly swara dont be narrow minded or blocked in brain", "prince28395": "🖕🖕🖕🖕", "mr._dhaval_zapda": "Justice for twinkle sharma", "dipesh_mali_17": "Ab sharam nahi aa rahi hai justice for twinkle sharma", "pulkit_chaurasiya18": "Twinkle bitiya k liye bhi takhti nikalo na.... Ab Russia tour chal raha hai, km se km waha ki pics hi na upload karo... #ShameonyouSwarabhaskar", "__anand__singh": "@reallyswara plz..two words for Twinkle Sharma too..Rape is rape it is nothing to do wid religion we know,then why this type of two faced behaviour..#justicefortwinklesharma", "roman_empire_vikash": "@reallyswara abhi appke pichwade me dard nhi ho rha, bc dog. .. Aurat #justicefortwinklesharma", "its_sam_eer27": "reallyswara....?where are you???", "_h.e.l.l.y": "I think you lost a staggering amount of thousands of DOLLARS ... in twinkle Sharma case .??? You must be soo disappointed that you lost the chance to earn this time !!!!!! Please show us your little human side feminist!!! although it seems impossible !!#justicefortwinklesharma", "manikaa1991": "What happened miss swara? This time when the small kid twinkle sharma has faced the same thing, you are not standing with this board. Why? Because you don’t have a release coming up? Women like you are pseudo feminist. Who use this word just for their own sake. God save our society from people like you. You are a shame😡", "shivamtiwari_48": "Aisa poster twinkle sharma ke liye kab aa raha hai...Ab ashamed nhi ho Ab justice nhi chahiye..", "nes.sanjay": "Abe librandu ghatiyaa aurat...#justicefor twinkle..ke liye ab koi hamdardi nahi he🤔🤔🤔", "manetheomkar": "Hey slut @reallyswara why are you so silent now, isn't twinkle Sharma is a little innocent child who was a victim of gang rape by fanatic peace lovers.", "l_lawliet0608": "Haramzaadi ab kya ho gaya.??. Twinkle k liye placecard piche le liye ho kya?? Bhadwi sali 2rswali randi... Maralo apni kahi randikhaane me jaake.... Hypocrite sali double standard bitch", "p_u_n_a_m_s_h_a_r_m_a": "Justice for geeta likha bhul gae ap mam avi recently Geeta naam ki 10 years old girl ke saath rape hua hai apko nhi PTA chla mam USA RAPE MOULVI NE KIYA HAI PLS YE SAB JO AP LOG ACTING KRTE HAI NA VO BAND KR DIJIYE OK PLS NONSENSE", "alkag780": "Ab hmari little twinkle ke liye nhi ho ashamed ab tum? Ab nhi khelogi placard wala game. F**k you all double standard hypocrite celebrities. Sahi kahte h tum sbko librandus. 😠😠😠 I swear mne na tumhari koi picture dekhi h qki wo hpti hi tatti h khud jo tum tatti ho. Us maasum bacchi ke saath raajneeti kr lo tum toh. Ghatiya aurat😠", "rambhad1802": "Hey where is ur pain now? Great actor....", "mmanish3011": "@reallyswara where is your card now~?? ALI-garh me print nahi ho raha?? 3 years old girl was kidnapped raped and brutally murdered in RAMZAAN MONTH by the ROJEDAAR... kaha hai tu~??", "z_ckwe": "What about Twinkle??????????sorry, but we have to Ask,please tell us,decency, inhumane, cruelty,and so on,may the soul of our aasifa be in peace ,God gave strength to the families,yes we do feel ashamed that day,#Act now Swara🙏", "bhupendra_singh20": "Twinkle Sharma 2.5 sal rape victim murdered by a muslim in a holy month of ramzan and see no out rage no placard wow not surprised cause we all know your agenda", "1iamphenomenal": "Twinkle sharma bhi to bachi thi. 2.5 saal ki ab tera dard kha gya.", "himeshchoudhary_casting": "Twinkle sharma also have a pic and she need justice too. She need you all to be her voice. #justicefortwinkle #speakup #dontshutupjustbczsheisnotamuslim", "its_sammy_jain": "We are ashamed of having you as an indian citizen. Please go and take pakistan citizenship. Hypocrite bitch.", "_niraj.kumar": "Are you ashamed now or not for twinkle sharma? Iss baar koyi post nhi aaya aapka jimmedar nagrik hone ke nate.", "rajput_ki_banno": "Jitni gaali do utni kamm h tere liye .....saali hypocrite kahi ki ...badly want to slap you hypocrite aurat", "amrendra_amd": "teri maa ke bhi 10 yaar honge jiss wajah ze tu paida huyi h...", "_pratik.475": "Look..... Fake feminist swara bhasker is now down and out........ wasn't Twinkle an innocent girl too...... didn't she suffer....... or is it forgivable just bcoz she was raped by Muslims.... C'mon u whore", "deep_rathod220199": "@reallyswara now where is your posters for twinkle Sharma?", "raja.adithya.varma.captures": "Would like to see one with #justicefortwinkle @reallyswara if you really care about children. Live and peace✌", "sunnychopra100": "Ab kaha marwa rhi h tu Kuttiya", "deadpoolpandey": "@reallyswara Madam Kaha Gayab Hai AAP. #JusticeforTwinkle", "anandkumar4086": "Are dhongi madam kaha gaya aaj aapka gang's of dhongi Bollywood aaj hantho me card leke photo ni shoot karwana h........sale sab ki aukat dikh gai....", "samarthraik": "Ab twinkle Ke liye justice maango #justicefortwinklesharma", "gautamdivya25": "Where is your card @reallyswara ......card and sympathy only for selective section....now you are not ashamed #fake", "adisgabhi": "They are just parasite....only to suck our country", "dheerajchamoli": "I was scrolling down your post not even a single post against \"ALI-garh\" incident . No problem it is your call , it is your right , but stop playing this agenda and creating choas in the society by your fake character .", "rubyspatra": "Ab kaha ho vibrator wali aunty.....ab justice nhi chahiye \"librals\" ko ya aapne soch liya h hindu ko hi oppose karna h....aise me talent toh kuch h nhi toh doglapanti karke earn karte ho.....better h convert hojao hum clear rahe aapke ideology se.....just saying", "_v_nay_07_": "@reallyswara ab ye wale post krna twinkle sharma k liye...agr sachme dogli nahi ho toh...ya fir hamesha k liye jo vibrator niche liya tha wahi apne muh me thusss k chup ho jana... harami ho tum sab log...jis din mile na chappal fekunga muh pr tumhare....", "abhishekkumar_46": "Lawdi 2 Kodi ki Randi abbbb kaha Marwa Rahi h.....abbb dikhayi nahi de Raha h😤😤😡😡😠😠", "sandeepsingh9807199": "Twinkle par tujko ashamed feel nahi ho Raha hai bhosdi.", "gulshan_gsr": "@reallyswara ab kr na kch post iske haq me #justicfortwinkle", "aditi_apurva": "Come on girl...do it once again for twikle sharma", "chinmay_satpathy": "Dogli aurat", "atidarshi_sharma": "And BTW there was no need to put DEVI sthan in inverted commas rape kahin bhi ho wo crime he rhega.. Place doesn't matter", "me_rohit_ranjan": "Behanch#d rand# reallyswara why u don't post or twite on #twinklemurder in Aligarh by Muslims bcoz they are your husband? Bhosde k kuttiya apni kimat bta", "priyanshu.k.kashyap": "Swara Bhaskar ka koi Insta hack karo bhai, saali randi she don't deserves to be here", "bleed_olivegreen": "@reallyswara before being anything you are an asshole", "sabirk0190": "दोगली", "ddevarshi93": "https://www.opindia.com/2019/06/aligarh-3-year-old-twinkle-brutally-murdered-by-zahid-over-loan-of-rs-10000/", "rohit_galani_": "Right..Ab Justice For Divya Kyu nahi??", "vishal___vishwakarma": "No justice for Twinkle ?", "prasad.kameshwar": "Where is #JusticeforTwinkle", "x.animal_planet": "असिफा पर रोने वालीं swara bhaskar जी आज पर नहीं रोओगी ! क्यों कि twinkle हिन्दु बच्ची थी और रेपिस्ट अपराधी शान्तिदूत समुदाय से थे इसीलिए विरोध नहीं किया क्या आपने ? तुम लोग बिके हुए हो ! हिन्दुओं और हिन्दुस्तान को बदनाम करने का पैसा मिलता है तुम लोगों को ! Twinkle के लिए कोई दुख प्रकट नहीं किया आपने ? क्यों कि twinkle हिन्दु बच्ची थी, या उस पर दुख प्रकट करने के भी पैसे लोगे आप लोग ! Note:- (Ashifa हो या Twinkle सभी बच्चियाँ एक समान है, जिस भी बच्ची के साथ बुरा होता है वो अत्यधिक निंदनीय है, कृपया अपराधियों का विरोध करने में धर्म ना देखें ) 😢", "madhuamritasingh": "@reallyswara where are you dying now?? Now u r not ashamed because rapists are Muslim👎😠", "diptesh_mandloi": "Why u quite on Aligarh case,, Kathua case pe bolne wali Takhti gang k paas takhti khatm ho gyi ho, ya kharidne k pese Naa ho to, parcel kare yaha se,, A big shame 😡😡😡", "prashant.sharma0803": "You dramebaaz.. Where is these poster for little hindu child got raped n murdered .. Sory to say Hindu.. But u few section of Bollywood people like u stand by a religion and run there agenda.. Shame of u standing for religion or kamhaiya kumar k sath dhindora pit ti ho constitution n equality ki..", "_.b_i_g_s_m_o_k_e._": "Ye jo mahan dikhne k liye krte ho na mt kia kro ye... Because you don't give a fuck about any #aasifa and any #twinkle.. ye sb tm logo ka dikhawa hta h", "nivesh.kandwal.12": "Fuck off You prostitute", "paw.vivek": "Mam why are you not comment on Azam Khan..", "manas_rastogi_1": "Saali randiii ki awlaaad", "ajay_uikey_": "Ye benchod Abhi kaha h jab Madhu ka rap hua aur murder hua ye Randi madarchod sirf katuo Ko support karti h", "insta_ashish_8034_": "Aaa thuu madharchod fucking bollywood bitches", "vesuvius_1411": "You have no right to represent yourself as HINDUSTAN you only target Hindus you are the most inhuman and talking about humanity go to Pakistan", "the_royalrajput_": "Teri maa ki gaand maaruun Randi ke aulad.", "shubam__22": "U bloody idiot tum jaanti bi ho case kya ha...ase hi bkwaas krne ki zarrorat nhi ha", "parag_gunjal": "Apna kam kr na mc sali", "aakaash.rawat": "Are u not ashamed of tyagi murder .. hypocrisy in its peek ..", "kumarritesh70335": "Madherchod Randi kutya", "himanshuism___": "Chup kr hindu phobia wali....Jake ke pak me bas ja...", "ashutosh.patil007": "Bloody Pak premi", "akash_linsky": "Han tu Randi hai.. we knows", "sunilsuthar1999": "Saali ko un follow kar do", "pranay_______________": "@reallyswara U idiots stop this, Ek galaat incident k vajah se pure desh ke bare me bura bolna, pure religion ko blame karna, temples ka naam kharb karna sahi nahi hai, Thoda dimaag ka istamal karo Chutiyoo🖕", "mast_meme72": "Swara tu pakistani hai", "kushwaha_27": "#whitecollarterrorist", "naveengurjar17": "Bloody prostitute of faiths", "bharatcharan5": "Shame on you bloody bitch ... Why do you defame Hindus have you ever posted for a hindu girl shame on you bitch", "sauravdittu": "Abhi kaha gayab ho😂", "riddhi__433": "@reallyswara ab ashemd nahi ho kya do kodi ki nachne vali sali", "dibyasingh_samant": "😂😂😂😂", "tanish_sharma15": "@reallyswara aap ne apne dharm ko neecha dikhane me koi jagah nahi rakhi. Hindustaan me kewal HINDU ko neecha dikha sakti h aap. @reallyswara agar aap itni badi feminist h na to jab HINDU ladkiyo ka rape hua to aap kaha thi.", "shreyash_ghule_1212": "👎👎👎", "v_4_vicky567": "Agr HiNdu bachI ka rapE hota Tab kaha RahTi hO aap", "mj111190": "RaamaLingam was brutally murdered today in TN by Islamic mafia because he promoted peace between hindus and muslims. Where are you? Are you so ashamed that you have disappeared altogether. #justiceforRamaalingam #hindulivesmatter", "verma4real": "Where is your hindustan now miss? Soldiers died yesterday none of you Hippocrates have posted or mutterd a single word on it. You'll feel proud on shaming and promoting false news like this but not a single supportive word for them. #bloodyantinational.", "single_stroke": "Wo एक ladki hai isliye uske upar rape hua hai.... Rape kabhi bhi dharm ya jaat puch kar nahi hota??? Aap use kaunsa rang de rahi hai... Aap ko samaz aa raha hai kya??? Aise bindok actor india me hai mujhe aaj pata chal raha hai....", "__kushal__7776": "आपने इस फोटो में एक मुस्लिम लड़की के बलात्कार और मंदिर में पाए जाने पर विरोध किया पर तब आप ओर आपका बॉलीवुड कहा गया था, जब एक हिन्दू लड़की का बलात्कार हुआ था, क्या तब आप सो रहे थे!!!तब आप बॉलीवुड वाले लोगो को मानवता का ख्याल नही आया था, फेमस होने के लिए ऐसा नाटक!!", "shresth__k": "the true lahore premi... aren't u ashamed of Pakistan right now.... I have been to everywhere but i find lahore the best.... u hypocrite. If u are ashamed of india go back to your lahore. #swaratherealhypocrite", "bhuvi_sarser": "Chaman chutiya", "imsameermohanty": "Chudel kahin ki na acting aati hai na tamiz hai", "arjunam_100": "Even my shit looks better than you", "khushrajput": "Ye aurat pta nhi kya chlta h iske dimag me. Ye kuch serious issue H. God bless her", "life.of.surya": "What happened now baby doll.. Bloody hypocrite .", "whatyouwanttoknowaboutme": "Teri maa ki chut .", "shreee.97": "Hypocrisy ... What about rape in churchistan ...", "_soovam_7x": "I am a failed actress...I need attention when my movie is about to release....#stupidlogic #stupidperson first collect the proper data then post...It Was a MURDER not a RAPE..!!! #stupidswara", "shubhamjadhav9493": "You are tatti💩", "s_shahi_24": "Swara an isi agent", "bunny_pvtt": "Hindu Muslim ke beech problems create krna band kro", "mandar_avachat": "pranam !! Ek kaam karo Nikal jao hindusthan se plzz....", "vi_barthwal": "Sabka pachka hua jisne yeh fukat so called 'message/ banner' post Kiya coz this Asifa case was a sham 😂", "xoomm__": "Madarchod hai tu randi", "pharoahfootball": "Makes you wonder who is funding Bollywood. #Paki #Dawood", "ewwwwliana_u_there": "You're a real hard worker swara. Don't listen to these cheap guys. Acha please tell me one thing....Kitni baar Deni padi itni movies k liye?", "debasish_23": "https://youtu.be/63N27wWgLso", "pankaj_1308": "Such A Cheap Actress U Are.. Masturbation Scene karke kya Message diya aapne Society Me PAN India Me ???", "jungiharish": "Hum yeh sab jante hey ki yeh sab kaha se Sikha hoga.Akhir ho to tum JNU ki hi na..@reallyswara", "aman_kashyap_28": "Bewkuf Lady", "aashayshukla1": "Mam plz stand with nida khan", "hejhejmonikahejpodigmonika": "No muslim hate her ! Wow", "swad143": "Why didn’t you post about 8 year old girl raped by Muslim men in M.P. ? You FAKE FEMINIST! Shame on you. You can do anything for publicity #whybollywood #antihindu #antihindumedia #bollywoodantihindu", "nneelnagpaltomar": "Hariyana ki Bakri hum sharminda hai tere rapist Irfan aur 6 log jinda hai", "vdia.s": "Sakal, akal, juban, soch, nazar sab tatti he teri 💩💩", "frank_foodis": "Q iss baar Ap sharminda Nahi h bihar me 32 bacchi ka rape huwa h waise ap q sharminda honge ap to dikhwapan krte h", "itsmeeamit": "Stop playing cheap stunts .... Well we all know what you all are .", "kumar_sambit888": "Kanha se aagya....", "ravi_kr_rakesh04": "Sala movie ka promotion krne ke liye itta drama.... Sch me dramebaaz ho... @reallyswara", "ramani_desai_": "U r such a hypocrite... Sudhar Jaao.....", "surender5849": "Sali randi kutia mandor mp ki ghatna ke bare me bhi pata h ya nahi thoda sa insaf divya ke lia bhi mag lo", "abhishekprajapatiofficial": "@shivanitanejaofficial comments padho", "bholenath_ke_diwane1": "Kutti log 😁😁😁😁", "i__himanshu": "and we Hindustanis are ashamed of you, i don't see the signboard of #divya #Mandsaur why? where is your protest gone? because the victim was Hindu? your earnings comes from India & most of the Indian's are hindu ,we pay to watch your shitty movies & tv series, don't provoke us. its time to boycott these low life bollywood actor & actress", "_princenamdeo_": "For posting this issko paise mile the", "shvm_st": "Fake feminist, hinduphobic, hypocrite", "jasmanocha": "Why you are mentioning hindus and temples here.. We all are indians, Did your father rape anyone?? your brother?? No right?? Not every indian is a rapist... Ye ek soch hai mam ek ghatiya wahiyat soch iska koi dharam ya desh nahi hai... And when an indian girl geeta was raped by 3 MUSLIM men then where were you?? We all are against rape but not against for a specific religion you fake feminist", "its_me_sammy_jain": "Muslims kuch kre and hum muslims ko blame kre toh we are anti muslims bolte ho hum religion bich mei laate hai and yaha kuch hindus ne galat kiya and tum pure hindustan ka naam bich mei le aao hinduism ko bich mei le aao woh thik hai, tum religion bich mei laa skti ho tab thik haina? What a cheap kind of actress you are bloody hypocrite. I personally don't have any problem with muslims or islam meko problem hai tere jaisi dhuk ke jaatne wali se jo apne hi desh ka naam dubo rhi hai. And pakistan itna pasand hai toh waha ki citizenship lelo and india mei kamana chor do agar india se itni problem hai.", "asliayush": "FAKE FEMINIST SPOTTED...", "ankytrix": "Why didn't you post about a 8 year old girl raped by muslim guys in M.P. u retard depressed women", "tanmayi.tanmayi0": "Where are you now @reallyswara @sonamkapoor @arjunkapoor @kareena kapoor U guys don't have time to post & ask justice for divya. U guys are such a hypocrite.", "mrr.sharma18": "@reallyswara all our sister need a #safe and secure #future. I hope and pray for the #KathuaRapist gets the capital #punishment. #AsifaBano needs justice. But where was #BollywoodCelebrities when a 11 yr old girl was raped and burnt Alive in #Assam or when a 6 year old child was raped in #bihar?? @reallyswara ???", "vinayshetty5": "Bloody double standard lady, shame on you, bitch you are #justiceforDivya🙏", "vismay29": "Mandsaur ke baare me kab bolegi...???", "nitin_sharma_rd": "Now where are you madam @reallyswara #justicefordivya divya k liya insaf nahi mangoge...yeah ab publicity stutnt krna bnd krdiya hai apne🙄", "pankajp.k": "@reallyswara divya ki news pata hai ya nahi..... dogla specular ka parda hata lo", "anoojrajpoot": "@reallyswara ab phat gyi", "sonupranav007": "Dear @reallyswara - have you heard what happened in mandsaur ?", "the_gagan_deep": "इरफान ने मंदसौर में सात साल की बच्ची का बलात्कार की अब तुम शर्मिंदा नही हो क्या??", "shubhamsharmaoff": "Ye mulli hai", "instaravi82": "Saali randi temple likhna jaruri tha kya Gita ka bhi rape ibadatghar me huwa likho na uske baare me bhi", "v._a_.m_.p_.i_.r_.e": "Ab bhi to kuch bol do madam.. wo bhi bchchii thi .. ye bhi bchhii h...", "vishal_singhj": "Jo asli hindu hoga iski filmen nhi dekhega @reallyswara 😡😡👌👌🙏🙏", "surajdubey20": "Mandsaur per kuch boliye khala ji", "aishik_c": "Mandsaur me bolti band .Have some shame", "cajinendra": "Unfollow kro in double standard logo ko, ab koi sharminda nhi hoga.... Mandsor india me aata h kya?? Ab ho sharminda @reallyswara", "akshay.wyachl0897": "People commenting here asking for this female actress opinion on Mandsaur should read her bio and under stand..!! It clearly mention \"dramebaaz\"..!! So in kathua for few their religion spoke and for few their lust for publicity..!! Hope u agree @reallyswara !!", "pankaj_2318": "#justicefordivya", "adityarajsingh.panwar": "कठुआ हो या मंदसौर बर्बर बलात्कारीयों के ख़िलाफ़ तख़्तियाँ बराबर उठाओ।कठुआ में बैनर/पोस्टर दिखाने वालों अब क्या वो अपने \"विशेष स्थान \" में घुसेड़ लिया है कुछ तो शर्म खाओ।", "mananmgb": "Ab kahan gai tum? Tab Veere di wedding release hone vala tha toh picture promote krne ke liye justice mangne ka dhong kr liya!!! Ab sab chala gaya!!", "ujjwal.pandey.18": "बेटी तो आखिर बेटी है ना चाहे हो आसिफा हो या दिव्या,,, अरे वो मास्टरबैशन वाली तेरे गुप्त अंग में कीड़े पड़े।।।। भाड़ नाचानिये अब मुह में कीड़े ओढ गए है।।। हरामी", "neelanshu_mishra": "Now, you'll not post anything for the 8 year girl who was gang-raped in Mandsaur..... @reallyswara", "swapnil.singh.lko": "#mandsaur pr bhi boliye kuch @reallyswara", "manish_boora_____": "You are loosing faith in humanity dear #SwaraBhaskar bcz betiyan sabki hoti hn..... Your voice for eradication of rapists will sound louder than mine so plsss this also speak out its how we will make our future generation a better human", "annehaidylovemeenakshi": "Sad terrible news", "piya_sengar": "Ma'am ab #mansaur case ke liye koi dua ya awaz nahi utha paa rahi Hain aap, awaz dab gayi ya vo bacchi insaf ki haqdaar nahi??? Vese reason Kya h vo toh aap bhi janti Hain @reallyswara", "hs_gill__": "@reallyswara Now ur not ashamed to be Hindustani... #mansuar case y ur not posting anything now...", "mohit.kumar2192": "@reallyswara isse koi sharam hai hi nahi puri dunia ke samne aaker paise ke liye masturbation ker di .", "mishra_satyam03": "@reallyswara Ooo sali 2 kaudi ki aurat ab ni ahamed hui kya sirf asifa hi hindustan ki beti thi kya re bkl ya fir sirf asifa ka prapoganda chalane ka hi paisa mila tha tumhen tum jaise nachna waliyon se aur kya ummid kr sakte h ham...tum sab sale madarjat ho....we are hindustan and we are ashamed on uh mother fu..krs", "resonated_muser": "@reallyswara ma'am we all are waiting eagerly to see you holding another placard for mandsaur too as your placard is only hope we are left with and make sure you wear same expressive makeup it will make that placard more fancy.. #peace", "kpcoolkvp": "now whr r u bitch?? talk about MP case.. show shame for islam now", "adityas008": "Mandsaur wali ghatna par kya hua aapko muh me dahi jam gaya ya poster pakdne me haat dard ho rhe hai", "cmaryamc": "Hmmm this happened in the non failing state of yours", "l.appel_du_vide": "You're an inspiration. Thank you for using your platform to bring real issues and honesty in an area that refuses to accept truth", "hailyeah45": "Oh ashamed , leave india and go to Pakistan , or vese bhi tuje Pakistan bohat accha lag raha hai \" jhine Lahore dekheya nhi vo janmeya nhi \" chall nikal yaha se", "zarar_skp": "Appreciate salute 🙋", "themirthfulspirit": "Please get some time for case study or at least read complete news before posting things like this 🙏", "ashis_pahi": "Hey I had high regard for you.but I think you are also do not use your brain n follow the paid media which are part of a bigger international plot to milign the image of India. And be careful n do not use your own image to be used by them.", "shinydebashish": "Randi.... @reallyswara", "amansharma.in": "Idiot😠", "aditya_vish": "lolz @reallyswara jo Hua wo galat ha but tumhre muh se word sobha hi nai dete", "prashant.jazz": "Once i was ur big fan.bt nw im ur biggest hater", "himanshu_sharma_91": "double face @reallyswara", "shashank_o0001": "Shame on you....Bollywood rang badlte log @reallyswara ....Lahore is good for you... Yours recent statement in pakistan fuckkiest country in this world", "salma04_": "@reallyswara what was that about Pakistan being a failing state??", "takreemhamza": "You are ashamed ...Well better be", "celebritieslookalikes": "Randi maa ki lodi", "pathakbaba2242": "#GEETA was also daughter of Hindustan, or it is about Caste???? You should be ashamed... @reallyswara", "ishuhot": "You Are A Publicity seeking Looser @reallyswara bitch", "renusharma1616": "Height of getting cheap publicity... I am ashamed of u #swarabhaskar.", "the.rohit007": "Yeh poster dikhane se yah movies me masturbation karke women's empowered nahi hote cutiye.. @reallyswara", "jack_n__jil": "Makki lodi bazaru raddi", "finaljustice2": "Regrets express karne mu per uper neecche Makeup karke athe tu, Harami", "i_m_rrana": "Say thanks you are Hindu.. Nd after saying this.. Ur still happy otherwise.. In other religion you will get fatwas for doing this..", "engg_saptarshi": "jaha khati h, wahi hagti h.", "sanket__303": "Randi sali", "sakshi_0610": "U r someone who promotes rape culture so keep ur mouth shut !!", "sahil_tyagi1": "Ashamed on urself mam there is a law in india pls don't pretend like this.", "_.abha": "Looool comments parho XD or interview main Pakistani ko failing state bolrahe the ye @fizaajram", "sandy_boom__baba": "What about Geeta?? Leave India.. Go to Pakistan we r ashamed.. N plz next time keep ur mouth shut.. Fake people", "shirsendu1303": "I'm sorry to say that couldn't you find an alternative way to promote your film. Actually shame on you @reallyswara", "pandeyyji_": "#Shamed Bollywood nd there Thinking", "abhishek.sen.7140": "Justice for #Geeta...?", "manishkrishng": "Woh Hindustani hai hi Nahi kyuki ...unko ye bhi jaanna chahiye ki Madarson mei molvi Muslim log bhi kitne rape karte haii... Samjhee", "shrishsharma007": "Hindustan ke naam per kalank hai ye chudel", "s.u.n.shine_007": "Now come forward and say sorry to all hundistan for ur wrong post.... This is ashamed and radiculas... Why u r so much narrow minded... Why u r not that much sensitive for geeta....why u people always blaming to particular community.... U lost ur respect", "joydip_since1992": "Aap ne ya jo kia akdom sahi kia. ...God bless you. ..", "anam_makhdoomi": "Love u 💕", "saleemkhan51": "Speaking outloud for Justice!!🤜👍", "bharatbaghel98": "Abe bollywood ki nachaniya......sacchai PTA bhi thi ya waise hi bakwaas kar rhi thi.........", "bandookja_": "Please also talk about karim morani case too @reallyswara", "prakash_makwana27": "nikalja hindustan we dont get shit like you 💩💩💩you are the biggest dumb actress i have ever seen in my whole life hindu nahi tu mulli hai aur itna hi ashamed hai toh chali ja pakistan vaise bhi ghanta bhi hindustan ke liye kuch nahi kar rahi aur teri woh kareena ko bol dena woh bhi pakistan chali jaye 👿👿", "hi_penguin1": "@ishikalamba kaisa laga gaali sunke", "moh_nazir878": "Jinka khati hai unko hi galat batati hai", "justrishiks": "They are not paid for Geeta", "ishikalamba": "India is becoming worse than Saudi Arabia day by day. Rape in a Devi Sthaan! Horrible.", "nayantarajoshi": "What an opportunist! Watch them cry when someone blames Islam for terrorism ! But they have no qualms blaming An entire religion this time !", "sou_rub": "Justice for Geeta ?", "pratikjangde": "apne apko jyada hi smart samjhte hai open letter wali😝😁", "mohitchoudhary.ji": "#swarabhaskar how do you know this happened in temple ...", "beyonder_oaa": "still makeup", "ranjeetmanhas": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "minti.sharma": "Bc publicity k liye kuch bhi.....Jake pehle case study kr.....chutiya", "kavya_vasitti": "Ask justice for Geeta also, tell me why are you silent now", "aish2596": "#fakepeople", "comicster0": "And indians are ashamed of you too .... ugly moron", "jayesh_mahi": "Madar.......", "dr.piya_chatterjee": "Ugly female", "the___eroded_on_e": "fuck u #swarabhaskar needed only publicity then bcom slut", "ashishdeshpande24": "Ye sirf naam se hindu hai shayad....", "iamnamanaggarwal": "If u don't know truth then u don't have right to blame HINDUISM And DEVI STHAN. All I request is those who are proud hindus and indians should boycott such actresses and stars", "sow_meowww": "@reallyswara applauses for putting this up and as a woman I completely agree and stand by you for speaking up against such issues when a lot of people hide their faces! Having said that I have a question for you - why particularly highlight this issue when you have many such rape incidents happening almost every day in the country? Why haven't you stood up similarly for any other rape cases? This has nothing to do with religion/caste/Creed! All I want to say is every victim deserves this kind of support from us citizens. Stand up against EVERY rape case and not just 1 particular one!", "swamo0922": "Bhai ye rape to hua hi nahi he......vishal us tim exam de raha tha,, asifa ke le bahut justice maang liya, lekin us nirdosh vishal keliye kon justice mangega,.....our ha ye kya asifa asifa lga rkha he, jab kisika rape hota he to, uske naam se pukara nahi jath he, pidit,bacchi,ourat,lakdi,,,,inse usko sambodith kiya jata hai,,, shayyad en 2 take badi actrees ko pata nahi hoga ..,...i m Hindustan lika hai uspar....itna hi Hindustan par ghin aa rahi he to ,,,,dusre desh me rehke dikha, musulmaan he na tu,,mulman bas india me hi reh sakte he,, dusre desh me to 2 din nahi tik payenge,,,,,", "singh.ankur_": "C grade actress", "mukuloberoi": "A rape in delhi also happened last days plz write down rape in ALLAH STHAN", "thetreacherousmonk": "Aise to hindustan bolne me sbko bahut problem hoti thi...ab ashamed ho to hindustaan nikal raha. Aur justice for geeta ki koi value ni hai kyuki accused 1 Maulavi hai...Even some of our Muslim brothers think Hindus are tortured here. Abhi boli nahi nikal rahi Swara Madame...Placard kaha hai batao...I pledge not to watch a single Bollywood movie...Fuck you Bollywood", "narendarsingh.26": "That was but recently a girl named Geeta was also raped in madarsa and she was also a minor,so your ink and paper vanished on that.i think your hands are not obeying your orders or someone cut them off as if they were you might have done same for her.oh sorry that will not give you promotion to your movie.so sad.", "vaishali021": "Just go through this, https://www.facebook.com/vaishali.khajuria.9/posts/1808934192502188 shame on you all @reallyswara , @sonamkapoor #kareenakapoor , @ektaravikapoor #veerediwedding #shameonmedia #shameonbollywood !!!!!", "the_iconic_vigilante_23": "Justice for geeta....no post!!!!!!", "_pallavi73": "U r just👎👎👎👎👎👎👎👎👎👎", "ankurpal0888": "Hindustan don't need to be ashamed. It's the failure of the moral values of the families of rapists + the failure of education system. Understand the difference between protest and propaganda. तुम तो वामपंथी हो तुमसे यही उम्मीद थी।", "vikram_singh_chowk": "Kuttiya protest bhi makeup krke kregi tere wedding director k kaam h sb jinna ki paidaish bhosadike chutiye", "vikky.3001": "Please go through the roots and then comments plzz ... u have freedom of speech but that doesn’t mean u will blame whole religion for that ... condemn the rapist .. not the particular religion 😡", "divya__sinngh": "@reallyswara so miss Swara u dint get paid for posters supporting Geeta ? Shame on u on calling urself a woman 🤢🤢", "punk_just_got_serious": "Kathua me koi rape nai hua aur ha ghaziabaf me hua hai 10 sal ki bachi Geeta ka aur won masjid me usko to log convert hone k lie bol the pr tu Randi yaha chup rhegi kyuki mullo ka support krna hai teko to.Hinduo me kuch nai kia to eda action le rhi waha mullo ne kia to teko justice nai chaiye Randi ki bachi....tere jaise casting couch k audition me hi ache lgte hai", "sankalp_vs": "I'm still waiting wen u hold board for Geeta !", "itzz_____shourya": "Gatiya insan ho tum log what about geeta tub mu ni khul raha tumara sale flop actor", "samir.shaw": "what about Geeta???", "gaurav0703": "@reallyswara the point is, why you guys wanna make it communal..? Everyday there is a scene of rape in our country... Why not raising voice there and then..? I am sharing this video where live groping of women is there by bunch of puny bastards... This was not made viral by any of you Bollywood fakers or even condemned, may I ask why? Those guys were Muslims!! You call yourself an activist but that too is a TRP bullshit!! Take a look at the YouTube video and talk my ✋!!! https://youtu.be/HbDqfqK8M9Q", "anasam345": "ashamed of bollywood", "nirmalofficeal": "Sun kutiya #swarabhaskar tere jaisi rendi o ke muh se hindu wali bate achhi nahi lagti", "vinayakvani": "R u not ashamed lady trying to malign Hindu religion & Hindu place of worshop.... ..shame on u...... did you ever display that poster when 18 year old was raped in a madharsa.....shame shame selective seculars.", "_evill_soul_": "Tum jaisa randi aurat dunia me hai hi nai...saali haramzadi behn ki lodi madarchod....i never abuse girls, but u deserve it. Shame on u thu thu thu thu", "sidvermaa": "Get lost", "manuzwork": "Why are you silent on Geeta... ??? Just because the victim is Hindu or because the rapist is a Muslim... why don't you shame madrassa...", "sanadiip555": "He Raand,muslim ahe, ti geeta sathi nyay mhnje justice ny magu shakat", "ankit_chauhan007_official": "Hindu virodhi anti nationalist", "coolrajat": "Geeta ke liye kab bolegi randi", "baaz_singh_shekhawat": "Aur yaha dramebaaz draamebaazi karte hue....", "_sucker_of_pain": "Tum to randi ho...", "skkdesi01": "Another hypocrisy by so called intellectual!!!", "im__simi_": "oye kamini ab to kuch bol geeta ka rape hua h to muh m lund leke baithi h kya", "nileshdraut": "@reallyswara all this boycott hust to make sure someone shoyld watch your movie amd you shoul d get notice by directors for next movie.... Cheap marketing...#shameonyouswara", "the_phenomenl": "What about geeta ... Post a poster for her plzzz", "hippisoul_": "Heyyy uhh fake pupit don uhh see geeta who was rape daily in madarsa by a muslim .. whese ur sympathy now uhh pathetic women ....Now u have to ashmed to being hindu...Sold people ..😒😒😒", "sharchokpa": "#JusticeForGeeta", "hardikbhootra_": "Making fun of Hindu rituals practices in your upcoming flim veere di wedding \"bc mangalsutra\" seriously shit I hope your flim flops at box office you all are Randi that can do anything for money @reallyswara", "mayur300": "Kitne Paise mile the? 2 kodi ki actress", "neeraj_npt": "किसी मौलवी ने,,10 साल की हिन्दू लड़की से बलात्कार किया,,पर अभी तक तुम तख्ती लेकर नही आई न तुम्हे शर्म,,,,आई,,,एक बात तो बताओ तुम हो तो औरत ही न,,,,,तुम्हारे यह पक्षपात रेप से कम नही है।", "shobhit_agarwalualov": "@reallyswara ...where is your fucking ashamed poster now....even prostitutes are very better persons....doob mro", "kushalsoni_9m": "Hello, @reallyswara Bahut asifa asifa Kar liya, jiska rape nahi hua uske nam ka Justice bhi mang liya. Aur ab #geeta ka kya. Jiska such me rape hua hai. Uske bare Mai nahi likhogi kya? Wo HINDU hai isliye ya dusre Bollywood wale kuch Bol nahi raheti hai. #asifa Mai bhi Sab NE bord le k khade Ho Gaye is liye aapbhi khade Ho Gaye!!kya sahi kya Galat kuch pata kiya? Agar suche ho to ab geeta ke liye #justiceforgeeta likh ke batao #imashamed #madarsa #rapistmollvi", "_boxer_beast__": "U slump slut", "jai_sharma9195": "I hate when these people do Publicity stunts...she should better be ashamed when Karena's son was named Taimur... You should better be ashamed for what happened in Kashmir in 1990 , you should better be ashamed of stupid Islamic madrasa culture.. We are Hindustan and we are ashamed of you.", "iamyogiraaj": "Swara do you think.... Asifa only need a justice and Geeta not why bcoz she is hindu.. Justice for everyone either Hindu or Muslim or any other religion... cheap publicity keliye koyi hath mei pad lega aur koyi bolega shame I am Hindustani... Ek ko insaaf aur ek na insaaf... Shame on u", "raajkumar_rajan": "Now say something about geeta? 2% ki nachniya", "girishvyas87": "These all publicty for new movie veerey di wedding", "satendra8580": "Madem Geeta ka v rape hua hai bo v bacchi hai fark itna hai bo Hindu hai aur rape karne wala muslim hai ek post to kar do uske liye", "aniketd26": "Ab nahi bologi hai na", "arpit7villa": "You look so fucking ugly ....", "bhagyesh_31": "#shameonyouswara", "ajay_shukla123": "#justiceforgeeta now speak up bitch", "khantwal_ashutosh": "buzz off you live in cozy places and only display placards", "123blurid": "Will you ask justice for Geeta? Swara", "saurav__zha": "It's Hindustan and I am proud of it.....kisi ek chutiye ki wajah se Mai mere Hindustan pe sharam nhi or skta......shame on u @reallyswara", "i_im_ss": "दिल्ली से 500 किलोमीटर दूर, कठुआ में नेशनल मीडिया (प्रेष्टिट्यूटों) का कैमरा पहुंच जाता है; लेकिन दिल्ली से 1 किलोमीटर दूर गाजियाबाद के मदरसे तक नहीं पहुंचता। क्यों? Sonam Kapoor, Swara Bhasker, Kareena Kapoor Khan, Akshay Kumar, और बाकी के बॉलिवुड के भांडों, स्केच-पेन की इंक खतम हो गयी, कार्ड-पेपर नहीं मिल रहा या सांप सूंघ गया हरामखोरों? #गीता_को_न्याय_दो #असिफा_को_न्याय_दो #रेप_जिहाद", "nstpwr02": "@reallyswara ab madarse me hue rape p bhi kuch bol de", "s.rawat80": "Geeta ke liye bhi Kuch bol do, now you are not ashamed for geeta, double standard.. #justiceforgeeta", "abhimanyu686": "Dear Swara now u r not ashamed for geeta coz rapist is a muslim. Looks like u r a proud hindustani now.", "_silent.soul": "Hiii.... Randi..... Geeta k tym mar gyi ho kya madharchod", "saurabhman_utd07": "Dear @reallyswara rape in gaziabad now where r u ....#justiceforgeeta", "pandeyatul348": "जा रंडी... जा किसी मौलवी या आतंकी का बिस्तर गर्म कर..... गीता रेप पर तेरे मुह से कुछ नहीं निकलेगा....", "vishal.jain121": "Now Hindustan is not ashamed... In case of Geeta.... Hindustan is ashamed only in case of Asifa..... Like you guys are spreading every where religious factor.... Now no post... No shame on us.... This time I think u don't get paid for this kind of post...", "sachin_malviya20": "वो दोगले ऐक्ट्रेस क्या अब गीता के लिए हाथ मे बोर्ड पकङेगी अब कहाँ मर गये वो जो जिनको शर्म आ रही थी,,, भाङ मिडिया भी नही आयेगी कॉंग्रेस कैडाल मार्च निकलेगी क्या अब कोई नही आयेगा,क्युकी अपराधी शान्तिप्रिये समुदाय से हैं,,,,", "rohitshekhar007": "Abe chup D grade ki E class actress", "umang_25": "Aapki ghatiya movie dekhne koi nai jayega", "yogeshsoni8220": "गाजियाबाद के मदरसे में हुए रेप पर भी कुछ बोलो या अब धर्म नज़र आने लगा #justiceforgeeta साली पैसे के लिए बिस्तर गर्म करती है अब पैसा नहीं मिला क्या तुझे। @reallyswara", "sagarnikhil": "kya maam ab jara Geeta k bare mai v kuch support krdo . . . .you dumb ass", "adyarnav_mishra": "@reallyswara ek baar fir rape hua hai is baar jgh \"mosque\" rapist maulana hai bchi ki age 10yr old place Gajipur.... now I want ur reaction on this ?? This is not politics I just want to know ur reality do u belive #justiceforeveryone or only justice for a particular religion ????", "namy_sat": "Ma'am what about the girl raped in a madrasa?? Aren't u gonna say anything about it?? Can u pease stop being such a hypocrite!!!", "manisshkumath": "Yamuna Nagar में 13 साल की बच्ची के साथ बलात्कार मंदिर में नहीं, एक सुनसान पड़ी धर्मशाला में हुआ है पकड़े गए दो हैवानों के नाम है - दानिश और फ़रमान", "jai_harshwal": "I am hindustan and I am ashamed on bollywood", "sunil.2949": "IPC 228 sune ho", "rituraj__patel": "Bahan ki laudi ab kuch bol ..ab kahan gayi teri juban ab tujhe sharm nahi aa rahi saali bitch", "vishnu_rathore04": "Geeta ke liye bhi ek post dal do madam🙏🚩", "deepak_mudaraddi": "🖕🏻🖕🏻🖕🏻 Double standard bitch", "rohan_unnikrishnan297": "#Justice_For_Geeta. A Hindu girl was raped in madarsa by the maulvai of that madarsa . On this matter no celebrities, no media, no so called secular people are saying anything. We want justice for that innocent girl. #double_standards#double_standards_pathetic_society", "dark_man_99": "पाकिस्तान चली जा और इस्लाम धर्म अपनाले @reallyswara", "sanjaych243": "Even whores looks more beautiful than her #shame", "chetansharma97": "you fucking......@reallyswara atleast know the truth BC tume celebrity status kya de diya humne kuch bhi bakoge India # temple bullshit fuck offfffff at least you don't do for publicity stunt ....", "rahul.kanojia.50": "Y Hindustan????", "anadi_bells": "Stop being fake.. Tum celebrities ko sala koi kaam ni hai yaha bhi make up kar k board le k khadi ho gai.. Ye reel life nai hai real life hai... Tum logo ko tho bas yahi karna aata hai..", "sandeeppruthi": "https://twitter.com/ZeeNews/status/989474178767114240?s=19", "sahil_21": "Paise to hindustan se kamati haie .aur tuje sharam aa rahi haie hidustan pe..trailer launch karne ke loye to nikal padi...hindustan se bahar jane ki aukad nahi he teri", "anvita_srivastava": "Gazipur.. Gaxiabad... Allaha sthan.. Masjid... Aaj Justice nai chahie??? Geeta india ki nai h????", "mjmanavv": "Geeta ke liye to daal lee saali nachniya mar. Jaa kahi jaake tum jeso ne is desh ki maa chod di ..", "vidursingh": "@reallyswara What u will say abt Gaziabad incident", "i_shan11": "Make one more : Justice for Geeta @reallyswara", "ray_rupa": "Is it the fault of religion seriously we need justice and we should protest for justice not for being hindu or Muslim and being in temple or mazid", "iam_mohit_tandon": "Bina sach jaane hmare desh k liye gakat bolne valo dafa ho jao yaha se sale gande log yehi kmana h yehi khana h yehi ash krni h or isi desh ko bura bhala bolna h sali pgl @reallyswara", "ragu_2523": "Randi", "preetham_rao29": "Toh katwa lo. Who's stopping you?", "kalpujjal_": "Hypocrite thot", "niteshbarua": "Film Aa rahi hai Isliye tum jaise Filmi log Darama karte rehte ho ,Agar Hindustani hone main Sharam aati hai to Bangladesh ya pakistan chale jao ,Kuch pta hai nhi ki hua kya tha nikal pade nautanki karne @reallyswara", "ankit_cool_tripathi": "@reallyswara अब आपके अंदर की औरत मार गई क्या मैम बताइये अब एक भी शब्द नही निकला आपके मुंह से", "dontmasswithme_": "Waah yaar Ab Aapko Hindustani hone m sarm aa rhi h disgusting", "equinoxer": "Aren't you gonna protest for kidnap and alleged rape of 10 year old girl inside the Madrassa in Ghaziabad? @reallyswara", "mr.haru_zala": "बाबू एक खबर की तरफ आपका ध्यान खींचना था..दिल्ली के गाजीपुर से अगवा हुई10 साल की बच्ची का शांतिदूतों ने मदरसे में रेप किया..कुछ लिखा नही आपने.आसिफा के वक़्त तो आपकी छाती फट रही थी,फेसबुक पर काफी दुखभरी कविताएं पोस्ट की,अब सांप सूंघ गया क्या?", "dhiman_mukesh_one8": "Why r you ashamed as hindustani......than leave our country....go to pakistan....", "jay_mishra04": "Madam rape to hua hi nhi Tha tumlog bs hwabaji krte ho apne hi dhram ko bdnam krte ho aaj musjid me rape hua to q n ab banner le k pic upload krti ho raped in musjid bla bla bla yd rkhna upr wla sb dkh rha h", "gauravstoryteller": "ग़ाज़ीपुर में एक 11 साल की बच्ची का मस्जिद में बलात्कार हुआ? @reallyswara @sonamkapoor तुम लोगों का मेकअप हो गया हो तो तख़्ती लेकर फोटो खिंचवाना और कैंडल मार्च शुरू करें ?", "iamayesha_shaikh": "ohh swara u want to show d protest pr ur ark blue smokey eyes????", "arvinder": "So all this was promotional exercise for your upcoming movie \"Veere Di Wedding\" मेकअप अच्छा है मैडम पर सोच बहुत घटिया।", "ahnoup": "#boycott", "anilgiythfsu": "I'm proud to be indian please leave this country", "its_nikhilmathur": "Haan madam aaj delhi mai madarse mai rape hua hai 10 yr ki bacche kaaab koi post ku nai aa rahe hai verna phele to khud bola tha ....aab kya ho gya @reallyswara", "prakharshukla_8544": "@reallyswara if you have the guts..Then speak about cast & couch culture in bollywood..Stop this mellow drama", "siddharth.malhotra_fc": "❤❤❤🙏🙏", "warranium": "justice for every person who was raped. NOT JUST ASIFA. NOT JUST FEMALES.", "jagadish.salunke": "Absolute insensitive Swara.. Lost all the respect", "theravi91": "वॉलीवुड की मोहतरमाये जो हिंदुत्व पर शर्मिंदा हो रही थी पता करो की अब जिंदा है या मर गई.... क्योकि रेप तो हुआ ही नही..", "sinha_abhishek": "Publicity stunt", "n_i_t_i_n_009": "U r a true piece of shitt. 😣😣", "kumar_pratap_bishnu": "All she did for her career only,and a good thing for her followers. As u sow so u reap.", "dhruv.j10": "UrR UK that reallyswara", "akshaygadakh1717": "We are Bollywood. & we are ashamed that we only protest against 1 rape. We always keep quit when a hindu girl is raped. We(hypocristwood) are also ashmed that we are biggest hypocrist in this world", "___thestarboy___": "How many hours did you spend on make up for this picture ? I am Hindustani and I am ashamed of the fact that bitch like you exist in this country @reallyswara 😊", "govindtaylor": "Same on u v***na bhaskar", "the_warrior_breed": "What abt bihar sirsa 3 yr old girl raped by a muslim ... Critical bcoz of bleeding....uske bare bolne ki himmat hai.... Likho \"ashamed of as a human muslim raped 3 yr hindu girl.\" Agr ga*nd mein du hai or aap shi ho to likhoge ye bhi... Agr nhi to dub mro gutter mein ja ke", "grv96": "Magic of makeup......looking different Mam", "pablo_milkybaar": "Fuck off. You absolute ignorant bitch.", "polkar_eshwar": "Lol called Amazon today and they say that they have no relation or deal with you! Way to go😁", "sdsunnyds": "How the hell u r Hindustan?? Matlab kuch bhi?? Bdw U r a girl +star means well rich actress.. stop felling shame on everything... ur mother n father didnt raise u up n make u self indipendent so tht u can write on a playcard tht u r ashamed on rape incident.. start awarness camp like how girls should protect demself frm such incidents.. how mother and father shud take care of their small kids who cant protect demself.. i m ashamed of all the Bollywood movies as dey r copycat of Hollywood, Russians, even south indian movie bt i didnt stop watching it.. bt u r right u shud b ashamed as u hv done nothing for those rape victim... Now dnt ask me what i hv done.. i hv done nothing because i m not a star or a rich actor or i m not ashamed of being HINDUstan becase ek kahawat toh suni hogi.. jaha khate ho waha huggete💩💩 nahi.. HINDUstan mein rahke HINDUstan pe ashamed!!", "pragzzrastogi": "@reallyswara bloody hypocrite.. if u are ashamed of india then just leave our india.. sick dumb mentality.. Fucking useless nd dumb actor..", "nikunj_raval": "Publicity queen", "abhishek_____paul": "Ei salii swar ka bacchi failed actress tujko attention chahiye na...ab kar na protest assam main rape festival bana rha hain bangladeshi lok abr kr na protest", "matangitingi": "Much respect for you Swara, love <3", "mm.mdm29": "Good job standing up for what is right and giving a voice to the voiceless, the world is watching and you are on the right side!! Following u now! 🙂.", "jylau125": "Instead of taking accountability for this heinous crime, some Hindus are blaming @reallyswara for being an opportunist. If the entire Hindu society holds the accused responsible, then maybe, just maybe this can prevent future atrocities from being committed. #justiceoverpride #justiceforasifa", "pappu_cool_nath": "@reallyswara MC bhag India say..sali..randi", "fahdanjum": "Proud of you Swara for doing the right thing. Shame on people defending rape of a 8 year old girl, and criticising this woman. Look in the mirror and ask yourself what are you doing with your life, to be so bigoted and to stoop so low.", "lx003n": "love you gurl lol at kissless virgins", "_ishivii": "We want #justiceforallgirls Assam ke 6 years old girl ke liyq ensaaf qu nhe mang rhe aap . Becoz she is hindu .and raped by a muslim . We are Ashamed that you are Indian .you obly want publicity . Feel proud that your Indian . Sharm toh hamein rapist par aate hai . Hindustani hone par nhe . Educate boys respect girls", "sachin_awasthi_g": "All plzz unfollow swara", "delhidoogie": "It is not about Hindus or any religion but a child who has been raped .A child who didn’t know right from left . I wonder if it was any of our daughters or sisters . Mothers would we say the same thing", "puneetme": "M your regularbased follower but, this Time you made me & my whole family disappointed , M hindushtan & M unfollowing you. I know it doesn't make any less count but can't follow the bitches like you ! Shame on you @reallyswara", "rajatsharma316": "@reallyswara publicity queen.. you cheapest lady...", "riyazk1503": "Swara tum aage badho... Hum tumhare saath Hain.. You got the guts to say things which most stars lack. Keep up your spirits, don't get deterred by troll Sena. We have to create a real New India Better India, free from these violent monsters. Jai Hind.", "escapist.tales": "Mam.. it is good that you raised the voice against the cruelty.. but if it had been just for humanity.. then why did you just generalized a nation being ashamed? The nationalism was grounded.. the inhumanity was the subject and not our nation. You know why these outsiders talk shit about us? Because of people like you.. when we can't stand united on one case to bring it to the realms of justice.. how come outsiders will support us? And moreover, when a step has been taken against this crime, then why is your opinion not on the post.. as easy as it gets being ashamed as a nation, the vice versa must also be true enough. People like you can do anything for a limelight.. yes we are ashamed.. ashamed of sharing our home, our nation with people like you..", "archishahaha": "👏 👏 👏", "mohini_2907": "I just hate this bitch @reallyswara uk she is the one who said I would like to be a sex slave being raped instead of doing jauhar after watching padmaavt..N see now..Double standards @inancysandhu @divyakakshudu0107", "bustamantejames": "May She Rest In Peace...", "bhole_nath_1921": "Ma’am unfortunately there have been several rapes committed after dis incident n am eagerly waiting for your say on that as well if u can talk about this..All I can understand that u just did it for publicity to save ur shit career n also shame on u for what u said about jawhar n now making u turn for publicity!!Go get a life !n choose different field as bolly isn’t for low thinking people like you!Thanks:)", "adilene03": "#STANDBYSWARA #standbyswara #STANDBYSWARA #standbyswara #STANDBYSWARA #standbyswara #STANDBYSWARA #standbyswara #STANDBYSWARA #standbyswara #STANDBYSWARA #standbyswara", "lmhotep_spartan": "I am ashamed to follow someone who is ashamed of being Hindustan........", "jasondessen1": "Well done Swara. British Muslim here, 100% supportive of you. #solidarity ✊🏼Sick of hearing Hindutva extremists defending these murderous rapists in the name of religion. Islamist extremists do the same thing, and they're just as pathetic as Hindutva maniacs who support rape, murder, torture, mob violence, etc.", "shivend12": "jaga gya hi dustaaan tere is banner se", "sirothiya": "माननीय देवीजी आज जब पोस्टमार्टम report में ये आ गया कि दुष्कर्म नही हुआ तो क्या आप हाथ मे तख्ती पकड़कर माफी मांगेगी पूरी दुनिया से । यदि हाँ तो ये माफी के बाद भी ये जो अन्याय किया है इस देश और धर्म के साथ उससे ये कभी शायद मुक्त नही हो पायंगे । हा में ये मानता हूं कि आपको और आपके मित्रो को आज पीड़ा और आत्मग्लानि जरूर हो रही होगी । मेरी आपसे विनम्र विनती है किर्पया बिना साबित हुए ये झूठ फैलाने के लिए एक बार माफी जरूर मांग ले हमारे देश की जनता का ह्रदय बूहुत विशाल है शायद माफ कर दे लेकिन समय आपको माफ नही करेगा 🙏🙏🙏", "pururawa.priye": "I do condemn Kathua and Unnao......but i proud to be an Indian..... #boycotantinationalist #ashamedofu #vandemataram🇮🇳", "smiling_moron": "Bitches dont speak...", "dhirenrawat2020": "Swara...If you ha e shown courage to have this poster..As this is confirmed it was not a rape, show some attitude to say sorry about the blind faith you have shown. People must know other side as well.", "the_.psr": "Look how anti national looks bitch", "ashwanijhunjhunwala": "U r such a filthy sadist bitch ....shame on u people fr being so blind and so vested...", "rajat_agrawal143": "India bolne wale aaj kal hindustan kaise bolne lag gaye sharm aati h aise actress pr jo rape koBi religious me dekhte h", "vijaysandaraj7": "First you Bollywood peaple are biggest shit in our Hindustan go to Pakistan and shit there Bollywood should ban Hindustan will clean assholes Bollywood peaples totally anti hindu because bollywood is the biggest bootloker of D in pakistan", "laxmank420": "Saali randi bhenchod filmo me jhaant kchh kr nahi paayi to ab ye chutiyapaa kar rahi hai bhosdi saali 😑jis desh ne teri itni aukat banayi jiski wajah se aaj tu bhonk rahi hai aaj ussi desh ki hone pe tujhe sharam aa rahi 😣get a life maa ki lowdi", "should_have_been_us": "@reallyswara hey were you there when this happened ? I’m sick of such hypocrite like you . No such rape happened . Muslims killed her . Where were you guys when Hindu girls are raped by Muslims ? No where you have no right to call yourself a Hindu . Get out of my country .", "ar_vidhyuotma": "Bitch", "bannu_aman": "I have send you a pic go through it u cheap Actress", "brucebatwayne_": "Randi", "yogeshsingh_bd": "more than a dozen rape reported in Assam last month, everybody sleeps.. new movie coming called 'veere di wedding' starring Kareena, Sonam amd Swara and suddenly they see the rape happening in society? Using rape as a tool for publicity? itna niche gir gae tum log?", "vikas_singh_jamwal": "See post mortem report of kathua case and read. There is no rape only murder shame on u shame on u.i m from kathua and u defamed our temple Matrani is ladki ko kede padne chahea before death.", "sanjayjadhav_": "Movies nahi mil rahi na samaz sakte hai tumhara berojgari ka dard but isame aisa chutiyapa mat lao jab isis wale duniya ki gand marte hai tab koi nahi bolata ashmed of muslims but indian me kisi ak ne kuch kya kar diya we are ashmed to be indian 👏👏", "shubhakhar_gupta": "Suna hai raat bitati hai pakistan may", "shrutipriya3586": "Wat's going on guys hindu n muslim first they r girl or women.... so #justice forwomen please don't give angle of hindu muslim common guys :(", "1511radhika": "Hypocrite!! Boycott her movies!!", "mumbaimerijaan1388": "chudail... g...mri.", "salman_abdulgafar_j": "U nd ur country but u re ashamed,nawa wo", "i_am_suraj999": "Side heroine side heroine top actress award nahi mila with Kareena Kapoor Khan and Sonam Kapoor because they are top actress you are not your side actress", "yogenderkumar8444": "Chutiyappa bhand", "sunnybruseman": "Don't hold cards for publicity of your glamorous face. Doing this glamorous activity like this you lose respect for yourself and your country too.", "soniwalbharat": "We love your acting swaraji and your character in the movie.... but you immediately show this poster on nationals within 2-3 days of matter highlight... Bahot fast nikle is baar kyunki Hindustan mein hinuism easy target hai", "clickerabhi": "You are not Hindustan. You are just 0.0000000001% of it", "ashmit_1724": "@reallyswara check your inbox baby", "creamy_milkshake_16": "@reallyswara hey reduced to a vagina where d fuck is ur fucking protest nw?? Mulla raped a child in a mosque today.. hold ur placard!!! U feel reduced to a vagina watchin padmavat etc dis shud light a fire in ur bush right?? Cmon protest ppl wna join u.. lets trend on instagram!! Women like u r disgusting.. fr ur cheap 3rd grade movie publicity use rape nd nw remain silent like d graveyard.. fear ur karma woman!! Maligning a religion for one off incident? And dancin naked about it for publicity... i was justice fr dat poor girl frm kashmir i wanna personally rip off d penises dat violated d child or ne child or woman their religion doesnot bother me dey r monsters of d first order dey deserve no mercy.. i pray d govt lets people punish rapists.. but people like u ur fashionista and ur fevicol se girl deserve a whack for giving it a religious colour if not starting d placard campaign den spreading it.. ull cudve rather asked fr justice fr both d victims but sadly ull chose one n gave a communal colour to it.. disgusting..", "manguu_": "P", "imahmadshaikh": "Oho oho, well once you said bring raped is way better than commiting suicide. Now what haa? You are ashamed of hindustan? You good? @reallyswara", "sandeepgosavi78": "Ab saram aati hai kya..", "jad.nandu": "सामने आया बेटी आसिफा के परिवार का वीडियो, जिसमें खुद उन्होंने CBI जांच की मांग की है, इतना ही नहीं, मीडिया द्वारा हिन्दुओं के खिलाफ जो झूठी ख़बरें फैलाई गयी है उस पर भी क्या कहा है खुद देखिये ! मीडिया ने देश की जनता से छिपाई ये बात सिर्फ और सिर्फ इसलिए कि देश में हंगामा हो जाए ! ये देखिये वो सच्चाई जो मीडिया ने बाहर आने ही नहीं दी ! इस मामले को अगर ठीक से समझा जाए तो ऐसा लगता हैं जैसे मीडिया के एक वर्ग ने झूठी ख़बरें दिखाकर देश में माहौल ख़राब करने की कोशिश की है.", "richeveryinch": "I am Hindustan. Really Bollywood? Now you’re Hindustan? Not India or Bharat anymore? Are you sure? Because the last time I checked, terror had no religion and criminals had no religion. Or are we changing the rules of the game here? Doesn’t usingHindustan make you anti-secular anymore?", "shristi_not_shruti": "And you guys holding posters with so much of makeup on looks so fake. Shows how much you'll actually care about anything happening around you.", "travelwithgoonj": "Hindustan? Really? Career out a rape victim?", "techziffy": "Its fake. Do you fuckin remember your comments made to padmavati movie?", "sandychoudhary302": "Tere ko isi Hindustan ne banaya h", "kar.subhan": "Hypocrisy at its best.! #shame", "deb_biswas_": "Bollywood, how come you see an opportunity to become the centre of attention at a time of terrible tragedy and go all out for it?", "shubhendra.singh779": "Randi publicity stunt...🤔😁 Agar Hindustani p sharm hai to pakistan q Nahi chali jati..gayi to thi ek bar pakistan..SB vahi p bech khaya kya apni...", "sonu.sonukumar.3954": "Aapko sharam aa rahi hogi Hindustani hone par mujhe nahi baki rahi baat rap pidit ke insaaf ki to mujhe mere desh ke kanoon par pura visvaas hai insaaf jarur hoga rape Hindu ki ladkiyon se ho muslmaan ki ladki se ya kisi bhi ladki se insaaf jarur hona chahiye mujhe Hindustani hone par Garv hai", "iamaksood": "Social media warriors", "priyankabansal._": "Yes , I am Hindustan. I am made up of people, , not any religion. You people are responsible as there is no humanity left. No religion teach you wrong deeds. Stop faking and start taking responsibility of ur own acts. #needjusticeforhumanity", "pawankumar9677": "Pls tell me when struggling people like you go for casting couch and am sure you must have also gone through many.....how do you judge this....a compromise, a rape, or an opportunity......here ur feminism does not raise a voice of being a human being or Hindustani......Madam we are equally sad about the incident and demand strict action towards the culprits but we aren't promoting a propaganda against a particular community by hiding behind a placard....", "nee_shree_": "@reallyswara ek or rape hua hai UP mein uske liye koi placard hai??? Waha par #hindustan hi use hoga..i guess🤔 haath mein placard lekar jaha ki roti kha kar nhi jurm nhi roka jata ma’am😐", "pratham_jain18": "Fuck you", "rise_of_aesthetics": "ghnta bhi inko pta nahi hota... lekin hero banne ka keeda hai dimag hai inme😂😂😂", "lovely_sarma": "To hell with your poster. Have u ever go through news of north east. So many girls under 15 age have been raped and killed by muslim. But for that reason we cant shamed one community. Idiot girl dont show off. For one or a gang you cant shamed hinduism. Now go through north east raped news and come with poster of \"we are muslim and we are shamed of it\" p.s I am not muslim. A hindu. Still not blaming one community.", "phoneographer69": "Itta ashamed feel ho ra hai to avi tk kyu ho yha @reallyswara", "sensharmachakraborty": "U should change ur religion nd name too", "ram_vikash82": "हुन्दुवों के लिए भी कभी बोल लिया करो", "shikha0590": "I am ashamed of you and people like you who jumped to conclusion without proper investigation, i am ashamed of you and people like you who can do anything for camera @reallyswara", "pandey.shivnya": "Kya apko tab sharm nhi ayi jab Bihar me ek mushlim be rape Koya ya fir Nirbhaya rape case me ho juvenile tha CO mushalim tha .. Desh me religion ke naam per aap hinsa faila rhi ho shame u rapists ka koi religion se Lena dena nhi hai stop dis @reallyswara", "thakursummi7": "Well done @reallyswara now time has come when u need to raise ur voice against casting couch of Bollywood too n nepotism in Bollywood too n once u said that it's better to become a sex slave rather than suicide ? That means u support when a women is raped throughout her life ?", "prasad_19_": "Shame on you", "thegrimreaper.666": "Chutiye bollywood wale publicity ke liye kuchbhi karte Hain, gandu log agar thodi si bhi hamdardi hai to vahi poster leke raste pe aao protest krne... Chutiyon jaise post na karke", "shashank.bhushan.908": "Just one placard? Every day it's happening in the country stop being ashamed on Instagram find something useful to do for the victims if you truly care and stop giving it religious colour...it's happening in every nook and cranny. #fameforswara #foreverjerk", "naz__ellahi_": "So I read the comments most of them any way some are saying comparing rapes to other rapes some are saying how dare you talk about being a Hindu or my country etc etc . Now let’s get to the point she’s actually making she’s ashamed of the fact the very people who are running the country their very members are involved the fact the law that was suppose to protect a child policemen was involved the fact where we pray was the very place a girl was raped a child Hindus do pooja of girls aka Devi’s so why did this happen you all seem to show a lot of hate what you forget it a child was tortured a child was killed Muslim Hindu Sikh etc all children deserve justice you mention Assam you can’t blame the celebs if there is no reporting by media im not even a celeb I didn’t know about Assam and course any rape is condemned in the harshs way possible no ones going to pick and choose this case was reported by international media and was picked up not even by Indian media so don’t blame the celebs blame your media that picks and chooses what it wants to show . Another thing where you kill people for eating cows 🐄 is that justified ????? Aren’t those people humans also you should be ashamed as humans we all should be ashamed when our daughters aren’t even safe in our country and our government members are involved in such things **we*** should be Ashamed!!!!!!", "rahulrao4": "Kyo andhi ldki. ..tumhare pass koi pruf hai jo mandir me rape huwa. ..aaj tak kashmir me itne rape huwe ...tb kha thi..muslimo k khilaf bolne se dar lgta hai kya. ...bollywoood me kam milna bandh ho jaye ga kya.....publicity. .publicity", "swaanick": "Full makeup kr k photoshoot hua hai.. @reallyswara Shame on you! Cheap publicity stunt. Where were u when your peaceful community raped hindu minor girls in Assam? Tb publicity ni milti naa? Die please @reallyswara 🙏", "tagarwal067": "If u are ashamed then go ASSAM and see what all happened there", "deepmishra05": "Swara apart from being a huge fan of your acting skills ..I would also like to thank you sweetheart for raising concerns on serious issues like rapes and similar crimes...@reallyswara ..you are few of those young actors who are aware and concerned and give others hope to fight against evils...❤❤❤❤❤", "shreyyas19": "I am proud Hindustani and I love Hindustan 😊", "tyagishiv19py": "Huma ji aur varun bhaiya ne ek scene kia tha kya sarm thi uswakt", "helen491": "Well responded on the ass hole who attacked kareena kapoor on tweeter. He should be hanged with those culprits who did the crime.", "siddharth5069": "Cheap stunt to get noticed #poorswara", "youths_truth": "How many shots u did to get this perfect shot😁😁", "rahulraj9059": "Madam is Tarah ka designer virodh se toh accha hai aap sadak pr utro", "chiku.123": "U hurts our religion sentimates i will take legal action against u", "indirakota": "Wow all you celebs are just using this as another reason to get decked up and blame the government", "anmol_king_of_romance": "\"Justice\" for Asifa!!! I'm just watching since few days how these media houses, politicians, bollywood and some of my friends are emphasizing \"Asifa\" rather than \"Justice\". Reasons are obvious, it's only the name that has the masala which the media and politicians can use for their benefit. Neither have they really ever cared about them, nor will they care today. Otherwise till date I had never seen that the \"Real\" name of any rape victim is made public. Even the 2012 Delhi rape victim was (and is) called Nirbhaya, which was not her real name. Till yesterday, people (I'm not mentioning you individually, you yourself know) who used to say criminal is a criminal, he has no religion, the same people are writing lines like \"Few Hindus raped and killed a Muslim girl\". Seriously? One incident, and u lost all ur conscience? Why don't we focus on \"Justice\" rather than determining her religion. After all this is what we have always taught one another. So why not today? Why Hindu or Muslim? Remember, politicians or media will just look out for making a profit out of the incident. But people like you and me, we are just concerned about one thing, and that is \"Justice\", justice for that little angel, that little soul! Hinduism or Islam have nothing to do with it. And yes, regardless to mention, the culprits should be punished, punished so hard that no other dog dare to even think of touching the daughters or sisters on the roads out there. \"Justice\" for Asifa!", "chinmay__deshmukh": "@reallyswara , No wondered you are anti Hindu.", "lokendra_0000": "Pehle swara ne rani padmavati k liye kaha ki johar se acha rape h or aaj aasifa k liye apne hindu hone par shram h plz tell me who are you?", "suryakumawat": "Totally chutiyapa......bc publicity chahiye thi to bhikh mang leti.....q khud ka chutiya katwa rhi h.....pardon my language but h katai chutiya soch", "amitfit21": "Go n watch zee news they exposed people like u... Bollywood the biggest hypocrite in india...", "razfani": "Miss swara in Surat 9 year old girl body found with 87 wounds can you please share Ur pain on that or just a selective outrage", "sneakers_fashion__": "Bsdki lanat hai tere hindu hoone mei..... Bc ki devi staan likhna zaroori hai", "jana.ankan": "We are ashamed of bollytards like U n some others like u", "rohan_jaswal_rsj": "U shud be ashamed of blaming Our HINDUSTAN in this matter", "shah_ronak612": "We all want to live in peace nd harmony.. But ppl Like you Who don't have any idea spread hatred between the two community... Just for your benefit.. Media double standard... Mam roz khali aap subah uthke newstpapaer padho. Aur fir Judge karna.. Ki Hindu Muslim kitne rape karte hai.. Khali koi bhi ek community ke peeche lag jaate hai... Khali mouka chhaiyee govt.. Ke khilaaf.. Aapki ladai govt.. Se hai.. Toh unse lado.. Community ne kya bura kia hai.. Koi religion responsible nahi hota.. Logo ki soch.. Kartut.. Jawaabdar hoti hai.. Pl be responsible...", "shubhamppatil": "Get your facts cleared before posting such crap!!! It is not proved yet that Ashifa was raped..and that too in ‘Devistaan’... her family has itself stated that in front of ABP News but all media and you shitty bolkywood dont want to post that because you get money only from congress who is the main mastermind in making an issue out of such an incident! It’s really shamefull to see that koi politics aur paiso ke liye itna gira sakta hai khudko... Aur agar tumhe ye sab nahi pata toh tumhe koi haq nahi banta aisi cheeje post karne ka!!!", "sunil102": "You have gone fat", "jy0tiraghav": "Tu to nikl yhase", "amit_verma_21": "#swarabhaskar ghatiya aurat", "jindalpuri": "Bas yeh sab karne se wo wapas nai ayegi", "quan_kaf": "Research first then only give your say. Dont insult the divine religion of hindu", "original.alokranjan": "@reallyswara till the date this country will called Hindustan there always will be rape culture.", "anchalkotwal_urologist_": "after achieving nothing professional ;, swara never leaves a chance to defame Hinduism...get lost ..nobody needs u ...first get ur facts right,,, there s something fishy going on....but #reallyswara u are one of the most annoying things at present in India.", "imnia_sharma": "Puri baat pta ho tbhi kdm uthya kro news vaale bi aap logo ka mazak uda re hai shi bol re hai ki puri news pta ni hai aap logo ko", "nikki1_nikki2": "People like you are so doltish and dumb that I can't even think of anyone else , come out here in the real world , sticking your ass in the royality and speaking whatever the fuck you want won't prove you to be a a good person,... If you really wanna talk have an open conversation , it's an open challenge ,... Salman is good even though he did mistake ,.. I'm ashamed of being Hindu, why the fuck , beacuse Hindu are rapist , really there's been a lot of rapes going on everyday why don't you speak about it, nope I speak on the matter which divides people,.. it's just because of Hindu and Muslim and again dividing the nation in parts ,.. last time that plane controversy now this ,.. you people don't open your mouth without money being provided , and if money being provided I can do things that nobody can even think of ... Why not on some other case , why just this , and speaking and #dharna won't change anything , come out and work as we do , don't simply tryna get some kind of place in public's heart by speaking , if you care do something , and for speaking of that matter , a beggar speaks too,..If you really care so, come out , I'm giving you an open challenge , come and talk about it,... Your place your decision...", "shilpagpt91": "Go and convert then, no one is stopping you you hypocrite. If am not wrong, weren't you the one who wrote a full ass article stating its better to be a sex slave of invader than to commit suscide? Sharam nai aati tum jaise logo ko. Chullu bar paani me doob marna chahiye tere jaise logon ko", "mihirdas1988": "Unidentified body found in gorchuk, Guwahati, Assam, plus point is BJP govt, minus point is unidentified body, kindly raise some voice for this victims also", "tanmayavyas": "Slow claps for your selective outrage...", "aaghoriaaghori": "Rape Is Rape And I Demand death Penality For All Rapist But Where Is All Bollywood Moron Wen A 4 Year Girl Rape And Murder In Kashmir Madarssa Which Done By Maulavi .i Challenged All Bollywood Moron Ans This", "roshan_00_": "Wow! Great act by your PR team! You got what you wanted! Free publicity of your new movie.. Seriously you guys are no less than a ****! Well Shame on us but more shame on u AS WELL", "milan_patel92": "shame on you people...you need attention only....When the soldiers of the country are martyred, where did you go?", "mayank.sehgal30": "Kathua case me victim ki family CBI ki jaanch se Mana kar rahi rahi.......CBI ki jaanch me sab saaf ho jayega kisne Kya Kiya...... Victim ki family chahti Hai jaanch j&k ki police Kare......Waha ki police me 60% ya usse bhi zyada Muslim officers Hai .. Inme jinko aaropi bataya ja Raha Hai .... Unme sab Hindu Hai.....Ek Constable Hai waha ki police me.... Uski 1 month baad shaadi hone wali Hai..... Koi aisa crime kyo karega jisse use faansi ho.....Jabki uski 1 month baad shaadi ho", "ad_ssr": "Sale bas publicity k liye kch bhi krenge. Sala itna makeup karke aur hd camera k samne inke emotions aate hai. Inko juttey marana chahiye", "vicky_gupta91": "Karo publicity karo.. religion k naam pe bhidao logo ko...", "riteshk19": "@reallyswara sometime ago u were in the favour of rape instead to committing suicide", "aashishrajput__97": "Devi sthan mein aisa kuch ni hua tha maam pls aise badnaamm mt kijiye", "akshaysquads": "Hats off @reallyswara", "honey235181": "Sab bollywood communal hai jab hindu ke sath aise koi ghatna hote hai toh koi ni ayega sadak par agar ek muslim pariwaar ke sath hua hai toh sab sadak par", "vidyavox_fc": "Big support❤❤💞", "shrutiscorpio87": "Gained enough publicity? Hope that helps you! #hyprocrites", "amitxgautam": "Shame on u, u r dragging my country on this shame on u, law apna kam karega", "thisisharshalsharma": "i respect you thoughts ... but why Bollywood and other celebrities only stand for aasifa why not for #unnao and #surat too.. i support u ... but the way celebrities react for particular one case that's a shame for us .. stand against rape .. need #equality", "fransaga": "Thank u for speaking up @reallyswara", "suryababa863": "You are stupid and selective in showing your protest for this case.... You must come forward for all such cases and try prevent recurrence of the same. You must not raise your concerns along the line of cheap political parties to get some mileage out of it.", "mrs.munawar_ansari": "At least can click a picture against those BEAST.. PLEASE.. MEN WAKE UP.. JST A PIC CAN SHOW UR SUPPORT", "prashant.3vedi56": "Ek randi ka publicity stunt 😁😁😁😁🤣🤣🤣🤣 @reallyswara", "swaroop841": "@subhendutripathy25 i'm not supporting dis but wat these policies are doing wen minor girls r getting raped in Assam by so called muslims n PPL like u r encouraging these bollywood PPL who r making our India name bad. No news channel comes to help our Hindus , u will realise wen it happen to ur own ppl .", "haqsehumour": "^Being raped by invader and become their sex slave is way better than committing suicide (Jauhar) to avoid that life.^ by - @reallyswara ... just a failed actress trying to gain some popularity .. @arpit_kakkar @tapas1525", "19sajjan": "Yaar ab is message ko bhi post krne k liye makeup kiya hua h", "thakur_shahab28": "Mam puri hakikat jane bina is tarah mandir ko badnam krna galat plz first try to understand the whole matter", "kochikkari_____": "Why do every body using the term Hindu Hindustan or Hindu Mandir?? How can you explain the crime under religious cover? Crime is crime and it should be treated under legal justice. We are humans and humanity that what we need.. there is a field beyond the nationality, cast and community, gender, and skin colour. She wasn’t a hindu or muslim she is an innocent kid who got raped and killed we need justice for her Stop this pointless hasttags #pointlesshashtags", "deekshajoshi2": "Support💞", "sunjanasingh": "shame on you on double stand .......go to hell you bitch🖕🖕🖕", "advait_streamliners": "Are mulli @reallyswara Bihar main 6 saal ki Hindu bachhi ko ek mulle ne rape kar maar diya uske barein main bhi awaaz utha na. Ya tu bhi Bollywood k mullo ki rakhel hain. Now I m ashamed you exist.", "abrar_hashmi10": "Love you Swara...", "shardakdalal": "What about http://www.thehindu.com/todays-paper/tp-national/tp-mumbai/debtor-kills-dismembers-girl-to-exact-revenge-on-her-father/article23498421.ece", "hemant_bhosale": "She didn't forget to put make up on before clicking the photo #hypocrite", "i_am_divaa": "Bhaiyya support kar rhe ho, justice maang re ho toh usme sirf ek beti ke naam pr hashtag kyu h?? Assam aur bihar ke lye v kro na protest. Kro na unke lye v play card use. Aur kitne cases aise hain, jo ab tk nazar me v nhi aye hain . Jaise odisha me 4 saal ki bacchi ka rape ho gye. Kro na sbko support. Why only #justiceforasifa ? Why not #justiceforall ? Why not #justicefordaughters ? Why selective Outrage????", "nd3436.ng": "Thode kamine log he desa me jo apne ko midiya ane k leya apne Maa ko bhi kucha bhi k de te he", "nazrul7711": "Love u swara", "gippsy_girl82": "Lets file a PI for death penalty . Any one ?", "goa_luv": "Shut up swara bhaskar", "neil_aansh": "@reallyswara jab salman khan ka drink and drive case chal raha tha tab tum sab bollywood actor ko #justice ka khyaal nhi aaya.... Ya film me role nahi milne ka dar tha..... All u #double- standard fake and mean people 🖕🖕🖕🖕", "scribblescircumstantial": "You're the same person who said 'Padmavati should've had became khilji's sex slave instead of peforming jaahaur' 👏👏👏 Claps on your hypocrite outrage!!!", "ritood2": "Why do you actors take a stand only when your movies are about to release!! Rest of the time you dont read newspaper to know what is happening in the country!", "yash_singh_05": "You are a failed actress you need attention that's all @reallyswara", "being___bihari": "I Am Hindustan , I Am Ashamed Of Bollywood & Their Biased Outrage . Every Rape is Henious Crime .Hindu Girls Are Raped And Murdered To....Why Only She Lective Cry...? #JusticeForAllWomen... Justice Should Be Done With Every Rape Victim ...Not One Basis Of Their #Religion And #Cast...", "richagp": "@reallyswara how about a placard for German bakery victims run over by Salman Khan...for which he was convicted and is just out on bail. Selective amnesia right????", "vatsontheroll": "if you are so ashamed then leave this country.. I know they did a heinous crime but it happens all over the world. The capital punishment should be that much swear that nobody thinks of doing this. But that is too debatable because many people take advantage of the system then too. So stop being an @%% .. It's not about hindu Muslim or even India. It's about the mindset.... Instead of doing something you'll just shouting on social media just to get attention.. Fuck you fake sympathizers.. And doors are open you can leave at anytime if your ashamed.. And just make sure nothing like this happens there or be ready with the poster.", "torque108": "Pls know the truth 1st. This girl was not raped. She was murdered by Rohingya's who were allowed by Mehbooba mufti to make her vote bank strong as her image is gttng demished.Asifas parents are dead way ago,this are just care takers who speaks whatever they are said to. #asifa #asifarapecase . She was muredered somewhere and then bought to temple MEDIA is spreading all wrong news. All WRONG. Guys try to understand and Congress nd othet parties are just politicising it to show current Govt. down They are playing cheap politicals. Its my request to literate ppl to think and act on this. @nehadhupia @karan9198 @divyankatripathidahiya @virat.kohli @rahulgandhi bitch. Pls spread as much as possible..", "rajkiran3700": "ye Bahut hi ghinauna apradh hai, Kash aap Hindustan ki sabhi bachchiyo ke sath ho rahe is ghinaune apradh ke liye aage aati par aap log aaoge nahi", "mayur318_official": "Off course rapists of must be hanged or given worse punishment as quickly as possible. But a minor girl was raped & murder at Barpeta District, Assam by an illegal Bangladeshi. Looking forward to the celebs and world media to cover this too. #justiceforkashmirissue #justiceforassamissue #justiceforjharkhandissue", "aryawarth": "pls send modi also", "the_unsecular_critic": "Irony is she is the same girl who wrote on Facebook that being raped is better than burning yourself P.s- I am angry as much you are but targeting the whole religion and the country is stupid Do you guys trend that \"I am Hindustan I am proud that our girls are protecting us by joining Air Force and BSF\"?", "krishnag9": "If u want to stop rape pahele to ye nautanki band karo fir apni filmo se ashlilta band karo", "shubhamrajput.rajput": "First and foremost we are against any kind of criminal act towards anyone. And you are not Hindustan mam you are just a petty minded person who don't have proper information about the situation, and you are just holding a piece paper which abuses our religion, our country, our countrymen(not every Indian is a rapist) so think twice before doing any act like this. Hope humanity survives.", "gagan.parashar88": "Sab protest kar rhe hai ,jinhe karna chaiye vo inogration or next election ki taiyari kar rhe hai", "daredevildelhi": "We want justice for aasifa", "nikhildongarwar": "Ur from Bollywood...ur fail actress..now u need attention...such a hypocrite ur..", "ashleyyey23": "Stop writing our country's name . You people dont even respect country in which you live . No religion taught bad things so stop spreading hatred behind the name of our country and remmber you cant blame a nation because of some dirty people. That incident was against humanity but stop this bullshit . You cant be a proud Hindustani because a true hindustani would never ashamed of his own country .", "yash9sharma": "Padmavati ko Sex Slave banne ki naseehat dene wale rapist Khilji fan Liberals aaj Placard pakad ashamed feel kar rahe hain.", "shwetssarda": "What happened to Aasifa burns my heart! But be more careful with placard you guys are holding \"Hindustan\" really! Pls avoid to get things in people's heads you know! I detest this way of showing support! We all want justice for aasifa but don't get my country in way!", "prabhjyotsinghsaini": "Hinduism is a religion of peace!! Let’s see how liberals loose their shit", "spiritualgangster4": "@narendramodi", "chittu.kumar": "It's very sad...we want justice", "shalakamathure": "@reallyswara, work hard for popularity. Don't indulge in such cheap stunts and stop blaming a religion. Rapist has no religion, they wouldn't have spared a Hindu girl too.", "ghostrider9901": "I m an Indian and I will stand with them who need justice . Bhale hi woh koi bhi dharm ka kyu na ho.bhagwan AAP jaise logo ko thoda budhhi de", "mayankgautam6736": "You are a flop actress doing publicity you ashamed for your career not to taking the name of temple abd devi stan. You are playing a dirty politics.be a women. You are a black spot of our india to doing such dirty thing", "prasad_palli": "What about unnav", "btownreviewer": "Go girl - mobilize the troops, if we don't speak up and make ourselves heard, we put all our daughters at risk! If you have a voice then please use it to effect a positive change 🙏🏾💔#prayerforaasifa #timeforchange #femaleempowerment", "iam_pavan_pa1": "What is Hypocrisy ?", "suryakantmumbai": "Why r u ashamed for only 2 rape cases ? Why don't u feel ashamed when hindu girls n ladies are raped by Muslims. Why u support such muslim criminals ?", "rudra_shaktawat": "you recently advocated that it would have been beeter for ma padmaavati to join plundering looter's harems to get repeatedly raped instead of jumping in johar kund to save their lives. That is sheer hipocrisy. shame on you bollywood.", "shobhiwant_": "You might know recent rape incident in Assam, who was victing and who were culprits?", "harshmittal007": "Weren’t you ashamed when Kejriwal showered gifts on Nirbhaya’s rapist all because he was a Minority....", "chandarmishra": "Show off", "imarjun84": "No dear.. we should oppose all rape happened till date all over the world.. crime is crime.. it doesn't matter to whom and in country it happens.. so.. I really don't like this pic.. why only specific crimes heart u?? Why should heart by each and every crime...", "unorthodoxv": "Such bold pic", "00abhikoparde": "Suddenly INDIA se HINDUSTAN kaise ho Gaya...😅😅😅", "jugwindergill": "I am a Hindustan? How about I am a human. What foolishness to bring a county's name.", "nirabhrasharma": "You are ashamed then why just you leave this country . I know this is wrong but who do you suppourt first get noticed ok don't talk nonsense. This is only a publicity stunt.", "behram_khan_sanzer": "I can't believe that a human being can do a shameful act like this but now I believe that they are not a humans.i am a ashamed as a human being and as a man.plz for forgive us #Asifa 🙏🙏 #JusticeforAsifa", "rajuzahi": "We are also with you", "prajz_15": "You are so fake women... You just want publicity somehow... drama queen shameless women...", "ningappagouda": "I AM BHARAT  I AM ASHAMED OF SELECTIVE OTRAGE I AM ASHAMED OF HYPOCRISY  SAD THAT YOU ARE MORE CONCERNED WITH \"DEFAMING TEMPLES AND DEMONISING HINDUS '' THEN TO GET JUSTICE FOR THE VICTIM  #CONDEMN_RAPE_NOT_TEMPLES", "bansal_saab22": "2.5kgmakeup", "mohata.om": "This is the same girl, who stood for multiple sexual harassment rather than sati and jauhar 😱😱", "poonamsethi15": "I am Hindustan I am ashamed of Bollywood & their baised outrage Every rape is hinous crime Hindu girls are raped and murdered too. Why only selective CRY ??? #JUSTICE4ALLWOMEN", "rohitmewadaa": "I AM HINDUSTAN, I AM ASHAMED OF BOLLYWOOD & THEIR BIASED OUTRAGE, EVERY RAPE IS HEINOUS CRIME HINDUS GIRLS ARE RAPPED & MURDERED TOO... WHY ONLY SELECTIVE CRY....??? JUSTICE 4 ALL WOMEN don't do partiality @reallyswara", "sarfaraz_o9": "@reallyswara support death penalty for rape", "manoj_kansara": "Ye sab log jo slogan leke khade he ,saj dhaj ke .....sabne ek jesa likha he,copy past kiya he,bhai dukh jata rahe ho ya khud ki publicity kar rahe ho.............vese ye ghinona kam jisne bhi kiya use fasi honi chaoye", "d.esifeminist": "Thankyou for bringing religion into this. This rape WAS about religion. Rightfully done", "asadawana": "🙏🏽🙌🏽💯", "vaibhavtiwari005": "Hahahahaha....Never done anything for betterment of the society ....Bt drama always 😅😅😅", "girish1604": "fuck off", "himanshunagwan": "Very good aise sharr karoge to jaldo milega insaaf... ye to vahi baat ho gayi Veervaar ka din h 10 logo ko peer@baba ki jai bola don acha niklega", "21storyteller": "Please don't bring any religion over here a criminal is a criminal and a crime is crime.... Please don't link it with any religion.... All the criminals and Rapist have same mentality.... And still today most of the people want a son they prefer a boy over a girl....... That's why our country is in such a worst condition....... Don't highlight the temple a Rapist can rape anywhere..... They are not humans at all they can't be....... And one of the most important thing Rape doesn't take place because of clothes or bold behavior of a woman...as any minor, woman of any religion and foreigners to get raped in our country ... It takes place due to Polluted narrow mentality of Rapist his background and his supporters...... All these people gonna make Indian the worst place to stay if they are not chopped off......and to make it even more worst so called educated people who are holding a big position also support these Rapist and Blame Women for Rape....... They compare Women with Food....(khane ko khula chod do ge to help makhiyaan to ayengi hi..... ) .... Do you think they have any respect for her....", "pramanandjal": "..please justice for girls guys..our", "raks_rai": "Shame on your selective Outrage..hypocrite !!", "shreekar_m": "When dozens of Hindu activist brutally butchered in Karnataka state. Where are the so called Hindustan activist who are holding placard now. Some of them hacked to death more than 30 time. Burnt alive smashed ripped off their jaws while they r alive. Then these protesters not even turned their faces towards those dead body's because it doesn't worth a look. Those butcher mind's trained by these placard mindsets.", "maxi_murtaza": "Rapistan country", "shanu_smoker": "🙏🙏🙏🙏🙏", "aizbil": ":(", "dr.jakhar": "Still few people r talking about religion - please be humans first", "akash.bajpayee": "My condolences with that girl but bollywood and most literate people from high society is so selective. Why haven't you post the same when the same things in mosque with hindu girls because u r working in a muslim industry n that time your hindustan not ashamed. Mam grow up and n start protest for every rape incident not just selective", "idnthvanyusername": "Abe ...Sun jab Assam me bachhi ke sat bangladeshi muslim ne R..e kiya tha tab tera notunki khaa tha ....Ye India he ...tera pakistan nahi System hai ...Sab ko nyay milega.tera notunki se system nahi chalega.", "mohdashraf7892": "Justice for asifa", "click7": "shameless creatures 😡😠", "___sakshi__jain_": "Hek ek kar art h every partक्षदकककक ययाति w h", "lakshyavarshney1999": "She should be given justice. If this is the state of safety in a sacred place like a \"temple\". Then how can one roam around fearless on the streets", "__subhi__98": "Justice for ASIFA 🙏🙏", "james_fedrerr": "Madar cghod", "deepika_pathak25": "Itna sabkuch Hogya h DSLR Aur Itna makeup krke justice mang rhi hoo?? Dude...grow up", "khannssahab": "This is our India.... Jahan ek Blackbuck ke liye 5 saal ki saza suna di jaati hai... And ye log Rape bhi krte hain aur bach bhi jaate hain WTF😠😠 Aise log jahan dikhe whi pe unko Kaaat dena chahiye aur whi pe Goli Maar dena chahiye Direct... Sharm Nai aai Hadd hoti hai yrr un Shaitano ko Choti Si Bacchi 8 Saal ki bechari kab Rukega INDIA me ye sab Ab ni Action loge to bekar hai Zindagi#Humanity Rip 100% #Justice for Ashifa😔😔😔😢😡 😢😢😢😢😠😠😠😤😡😡", "raeenkbs": "@reallyswara is this the maximum you can do? With your status and fame, I thought you would do more?", "narendersingh4u": "कश्मीर में जब हिन्दुओ पर अत्याचार हो रहा था हिन्दुओ का रेप हो रहा था तब क्यों चुप थे ? #secular", "subhroxx": "Justic😢", "real.aamirkhan": "#justiceforasifa", "nh4_cl": "Kal tak main Modi govt ko bura bhala keh rha tha.. But i think... They are not wrong at their place... They are doing their respective duty..... Why people are behaving so much idiotic. Some are blaming Lord Ram.... As the rapist have same name.... Someone is blaming hinduism... As the rapist is hindu..... Crime ka kya koi dharm.. Hota hai.... Nhi na..... 😑... Then why these fucking celebs are behaving like..... Is desh me pehli baar aisi ghatna hui hai. We should raise our voice everytime to stop this crualty.... I know someone will find me irritating... But this is true.... Raise ur voice... Against evil. But why blaming whole community. Whole nation.... This is really irritating..... Aise kabhi Hindustan bola nhi jaata.. In bhadwo se.... Lekin...... Aaj... Inke liye.. Ye desh... Ye sar jameen.... Hindustan ho gyi. Wah bhai wah.......crime is crime.. And wo janwar bachega nhi...... Use saja jaroor milegi", "u_nair": "Not only Asifa there were many should speak for them also", "rakesh_munjpara": "When baba kept arm &bombay blast where r u every one......", "poetryandtales": "I feel ashamed of us as people and ashamed of these celebs who instead of raising the isssue of Rape are busy raising the issue of who and where this girl was raped. Like seriously? The poor soul is being tortured even after her death by again and again posting this same shit each and everywhere. Why are people making it a religious issue rather then making it an societal issue? Why are people so busy linking hindu, hinustan and all? Aren’t there other girls who get raped each day irrespective of their religion ? Even they don’t get justice. Guys don’t be fooled by these celebs trying to show how they care, these people are being hypocrites. Its high time we stand up again RAPE and stop this Hindustan, devistan shit going all over the internet.", "sujaysphotography": "I am human! In the first line than I am xyz, Would have been better than using words to separate our fellow beings from each other ✌🏾😊🙏🏼", "drgauravj28": "I would sincerely confirm this monster act on humanity but swara grow up don't attach religion or a sacred place of worship to it, we are Humans first not Hindu or muslim... This could took place in a mosque or church.. place and name is not important, this could be radha or pallavi...", "viratilliers_18_17": "I AM HINDUSTAN I AM ASHAMED 8 YEARS OLD \"AASIFA\" \"KIDNAPPED\" \"GANGRAPED\" \"MURDERED\" BY SEVERAL..😞😞 IN \"DEVI_STHAN\" KATHUA.. THEY ARE NOT HUMAN BEING..THEY ARE #DEMONS\".. WHAT IS THIS HAPPENING IN OUR LOVELY COUNTRY..?? WHY THE PEOPLE ARE SO CRUEL..?? SHE WAS JUST AN INNOCENT GIRL.. WHY DID THEY DO THIS..?? COZ THEY(RAPISTS) KNOW NOBODY CAN DO ANYTHING AGAINST US.. PEOPLE ALWAYS SAY WE WILL RAISE OUR VOICE..THIS WILL NOT HAPPEN ANYMORE BUT PEOPLE POSTS FOR SOME DAYS..BUT THEY DON'T RAISE THEIR VOICE..IT IS NOT GOOD..PLEASE RAISE YOUR VOICE..COZ THEY(RAPISTS) ARE MORE DANGEROUS THAN ANY DISEASE.. GOVERNMENT OF INDIA MAKING INDIA STRONG BY ONLY \"WEAPONS\"..A GIRL IS NOT \"SAFE\" HERE EVEN IN THE DAYLIGHT..YOU'VE HEARD THE SLOGAN \"BETI_BACHAO\"..I THINK IT'S NOT A SLOGAN IT'S A WARNING.. IT'S TOTALLY WRONG..I'M VERY UNHAPPY THIS IS HAPPENING IN OUT COUNTRY WHERE A GIRL IS KNOWN AS \"DEVI\"..SHAME ON THEM.. GOVT. SHOULD TAKE SOME VERY STRICT ACTIONS AGAINST \"RAPISTS\" THEY THINK INDIAN GOVT. IS NOT POWERFUL COZ GOVT. IS DOING NOTHING STRICT AGAINST #RAPISTS.. PLEASE DO SOMETHING.. GOVT. MUST FOLLOW THE RULES OF \"ARAB_COUNTRIES\" AGAINST \"RAPISTS\" AND WE WILL HAVE TO SUPPORT OUR GOVT. . #WE_WANT_JUSTICE_FOR_AASIFA..😞😞😞 . . PLEASE..PLEASE..PLEASE SHARE THIS MESSAGE TO EVERYBODY..😔😔😔 THIS IS RAHUL SINGH AND I'M NOT HAPPY WITH THIS..😔😔😔", "sumanb05": "@reallyswara why only Asifa mam? In recent past so many rape cases done in different part of the country. We all are ashamed of for all the cases. Pls don't be biased.protest for all, fight for all. Afterall we all are Indians. No offence pls.", "innocentazam": "इज्ज़त लूट ली गई मोदी तेरे ज़माने मे, बाप मर गया योगी तेरे थाने मे,ऎसी सरकार नही थी किसी ज़माने मे.l", "hameedali9676": "Respect to women", "raj51075solanki": "dont ashamed for india we have to pruod an indian", "not_amit07": "Stop wasting paper..@reallyswara", "vaibhavmodi37": "Bdw Good make-up🙌 ... Is she really looking concern about her.. #just for publicity stund.. 💆", "marufkhan86": "#justiceforasifa", "mahimishra2893": "Justice for AASIFA", "deepakshriwastava": "All Indian should stop watching their movies and act. @reallyswara if you are shamed of my country then I am ashamed of myself to make you live on my money, and if you are ashamed of Hindustan then get lost from this country who gave u everything", "spreadinggkindness": "WHY are you ashamed of being hindustani? Not all hindus r like this so stop generalizing! Be proud of your culture, its not the religion's fault, its the stupid ppl who have committed this horrible crime", "bendkeswapnil": "Publicity stunt kuch lena dena nahi bas news mai rehne ke liye", "hrishikeshsungar": "Been feeling very desolate over the news of rape of children coming from different parts of the country. What happened to #AsifaBano in Kathua was beyond horrible and I hope and pray that she gets justice. A few weeks ago, a 11 year old girl was raped and set on fire by Bangladeshi immigrants in Assam. Two days ago, a 6 year old child was raped in Bihar and is now struggling for her life. Rape of children is a crime done by psychopaths, not by normal human beings and I hope and pray that the perpetrators get capital punishment. All our children deserve the right to have a safe and secure life. This is not about politics or religion or which party you support, this is about justice to our children. Law should be amended to ensure that all rapists should get capital punishment, including juvenile ones, only that will deter psychopaths who use rape as a weapon!  I really despair when people selectively talk about justice to Asifa. Yes, Asifa needs justice. But then, so does the 11 year girl from Assam who wasn't even talked about in the MSM, or the 6 yr old from Bihar, who is, even right now, fighting for her life. Spare me your righteous whines and your selective outrage. India needs to be a safer place for our children. Bas!", "the.color.i": "There is no evidence it happened in a temple other than the tainted main stream media!!! Raping a child is horrific but why propagate something which is not proved!!??", "arunanansu61": "All human beings should be ashamed of it ! Men in the veil of devils are waiting to avail themselves of the opportunities ! The rapists are to be singled out & given stern and stern punishment ! That may be ultimate sentence !", "leiaslegacy": "Thank you for using your platform for good!", "ssaket111": "@reallyswara atleast you can use right words if you want to say something. Always negative for negative is not good. Say positively for the negative. Pure hindustaniyo Ko badnam mat karo. Kuch bewakoof logo ki wajah se. Atleast you should proud about you nation @reallyswara that \"you\" get what you need in your life. \"Be mature while putting your emotions in words.\" God Blesa", "ff9_ashi": "So sad.......", "frustrated_boy_18": "Kabhi kisi Hindu bacchi ke liye bhi post kar dena india me daily 90 rape hote he, jisme se 99% girl Hindu hoti he tumne asifa ke liye aawaz uthayi accha he jisne uske sath aesa kiya he usko fansi milni chahiye but un Hindu bacchiyo ka kya aaj unhe bhi lag raha hoga ki woh Muslim hoti", "avinash7693": "Agenda", "hawksmere66": "There is no such thing as a proud indian! Look how many of them want to be anything but indian!", "maulik.engineer": "U r doing bad swara.... For god say, please u don't do this. Bcuz u r selfish.", "alokmeena407": "मुझे नफ़रत है ऐसे लोगों से जो ये काम करते है और मुझे नफ़रत है ऐसे लोगों से जो अपने देश को बदनाम करते है क्योंकि ऐसे मनोदशा के लोग पूरी दुनिया में कहीं के भी किसी भी जाति धर्म के लोग कर सकते है मुझे गर्व है मै हिन्दुस्तानी हूँ", "dineshkumar_bhoot": "And what about this one.. i am ashmed on u .. बिहार के करगहर का है, जहाँ 6साल की बच्ची का मेराज-आलम नाम के शख्स ने बलात्कार किया है !🤔❓ लेकिन देश की बिकाऊ मीडिया डिजाइनर पत्रकार सेकुलर नेता इस पर एक शब्द भी नही निकलेंगे क्योंकि वो दरिंदा मुस्लिम है !☝🏻😡 बलात्कार जैसी खबरों को भी महजब धर्म देख बताया जाता है ये कितनी शर्म की बात है !☝🏻☹ 👉🏻 https://t.co/LRUBNvnWKE 👈🏻", "vikashsainirasodi": "Yes justice for him", "usmankadai": "@reallyswara 😱😱 this is a terrible thing we are ur fans and always stand by u we pray that she will have justice and may her soul rest in peace", "being_vikrant_": "Ohhh those libbies who dont like to call themselves even indian are now calling it hindustan just bcoz a muslim girl is raped.. why doing propaganda on the grave of that innocent child...", "ravi._mane": "https://www.facebook.com/capricorn.abhishek/videos/10211544326671751/", "despina.n.xiromamos": "💔😢", "karan41rawat": "C", "i_kravi": "What about sasram", "kuekuwatsheu": "I would appreciate celebrities like you.. if you guys would protest for #naogaun and #hailakandi also.. 15th march, a 12 years old tribal girl raped by Jeshimuddin Borbhuiya in Hailakandi district West Bengal.. two rapes within 10days 16th of march.. a minority hindu women was raped by Nazrul Islam, Sultan Ali, Moumtaz Ali and 5 more men in front of her husband.. 23 march, Zakir Hossein nd two of his minor friends raped a girl in her home and burnt her alive.. both in Naogaun, Assam... ohh sorry you won't because those rapes weren't done in #temple and the rapists were Muslims... thanks for insulting that 8 years old girl death and giving it.. intentionally or unintentionally a religious blend..!!!", "capt_jay.deep": "#Kathua rape is very horrible & culprits should be subjected to Maximum punishment so that #JusticeforAsifa can take place. But why similar Media outrage never happens when six Hindu girls are raped & killed by Muslim men in Assam last month WHY NOT ALL RAPES ARE EQUAL ?????? You Bollywood is slave of Muslim and supporting only there cause. You bloody slaves of katva ..", "akshay_akki007": "She deserves justice , I feel heartbroken for her, Her RAPIST should be hanged not the PLOTTED ONE . The whole JAMMU and Kathua is protesting against the Local Crime Branch which is headed by IRFAN WANI (Himself ACCUSED of 4 rape case) the whole chargesheet filled on NO GROUND just to terrorize local Hindu (Minority) community and Deviate the issue from the unlawful settlement of ROHINGYAS. We jammuties first as human want Justice for little angel ASIFA, we want CBI INQUIRY for her. It's a plot of state govt and Mehbooba to change the demography of Jammu province . Support the truth and us from the trap. Otherwise we can no longer claim J&K as iñtegral part of our country. If Jammuties scumb to their Motive. IT'S PLOTTED , IT'S A TRAP", "shivaaysingh9": "The amazingly glamourised movie industry.. They will travel in harsh Summers and Winters, at times even walk for hours to promote their movies and shows... Now when an EIGHT YEARS OLD CHILD has been raped and crushed to death all these STARS can do is get clicked with a banner... And ... Then move on to shoot for their respective movies and shows... SHAME ON YOU... you stars have the power which could fuel an uprise..and all you decide to do is get clicked with make-up on... AS AN INDIAN ...AS A VIEWER .. I AM HIGHLY ASHAMED... DON'T YOU STARS HAVE A HEART OR EVERYTHING OR INCIDENT IS JUST AN OPPORTUNITY FOR YOU TO PROMOTE YOURSELVES...", "chaitu_chai": "Guys plz stop this religious arguments..yes rapes r taking place in many places around the country.. rapists are rapists it doesn't matter to which religion or community he belongs to.. and Aasifa is a kid yaar what kind of animals rape kids ..dont just blame on governments or politicians we r the ones who chose them to be our leaders.. protesting won't creat fear in rapists.. even after this incident there will be rapes.. only thing that can control this is taking immediate action and punishment should be terrifying..", "shayanturk7777": "just because she is muslim thatswhy she is not getting justice but there is thing called humanity . they all have forgotten that also . i guess", "swagghhvg": "Congress ne paise n content diya hai.. mujhe bhi de rahe the.. maine mana kr diya", "rabijkk": "By posting diz they make their way to get roles..", "pramod.jena": "Wow u can also became a very good politician..why you people communalize to everything..no religion teaches to do or support to crime..we all want justice..like terrorism has no religion similarly a criminal has no religion..so grow up ur mind..and yes I am a proud hindustanti and always be proud for this identity.", "shinning_shef": "Js wanna ask is all these favors which everyone is doing through media works ...m not criticizing this it good no doubt .. but i think something serious must be done ....this all doesn't worth . The Indian law is so poor , coward they can't even take a serious step against these fucking ppls . How can we say proudly that we are Indians .. ya but we can say proudly that we are from the country where girls are not safe not even at a holy place , where grls are treated like a bait . These people are really showing that Hume yhi sanskar mile h . Hum apni maa bhen ko bhi ese hi dekhte h humare andr koi insaniyat ni h we are bullshits on this planet .", "unomedicus": "Hypocrite. Biased. Opportunist. Stupid.", "bhardwajgourav": "@reallyswara Y this is been raised now. This should have been done earlier for all who went through this. That time none of you came forward. Don't bring religion in this. It's like promotion going on with bunch of actors all around holding it. Many die everyday some are murdered. Where were you that tym. I'm proud to be called as Indian...", "imranrock0": "Can you help me out by signing this petition? https://chn.ge/2IQaVHu", "sonu_kashyap_879": "ab muslim atanvadi bhi bolna padega", "tahirapr09": "Absolutely vile...no words", "hisnibsibs": "I'm ashamed as well 😑 and few people are protecting them...SAD", "ashtheduke": "I am ashamed that am an asian", "rahul11985": "Please don't use it for ur publicity", "tuhinahmad": "In a holy temple as well", "lovely_lokesh24": "आज कुछ लोगो की भावनाएं आहत होने वाली है खासकर उनकी जो आसिफा रेपकांड में कश्मीरी शांतीदुत (SIT) पुलिस द्वारा दाखिल मनगढ़ंत चार्जशीट में बनाये गए आरोपीयो को बिना जांच फांसी देने के हिमायती है... जनवरी के दूसरे हफ्ते में रेप होता है पुलिस जांच में लड़की की लाश मिलती है मेडिकल रिपोर्ट से रेप होने की पुष्टि होती है, प्रथम जांच में एक नाबालिग को रेप केस में पुलिस पकड़ लेती है... कहानी में ट्वीस्ट अचानक महबूबा सरकार इस केश की जांच क्राइम ब्रांच को दे देती है..??? क्या किसी ने पुलिस की जांच पर प्रश्नचिन्ह लगाया था..?? सोचते रहिये.... क्राइम ब्रांच कश्मीर से पुलिस बुलाई जाती है, सभी मुल्ले है इस sit में, एक भी जम्मू का पुलिस अधिकारी नही..?? ये जांच अधिकारी एक कहानी बनाते है बिल्कुल फिल्मी, बच्ची का रेप मंदिर में होता है.. मंदिर जहा खूब चहल पहल है वह बच्ची को बंधक रखा जाता है, सुनसान जगह नही रखते..?? मेरठ से रेप के लिए एक लड़के को बुलाया जाता है वो लड़का खलिहर है तुरन्त नाबालिग से रेप करने पहुच जाता है.. जम्मू का एक पुलिस वाला भी नाबालिग से रेप करता है और यहा तक बोलता है मारना ही है तो पहले रेप कर ले.. हद है कहानी भी बनाया या सबूत भी जुटाए..?? सबूत जुटाए तो सीबीआई जांच करवा लो जबको संतुष्टि मिल जाएगी..! वैसे भारतीय पुलिस पर एक कहानी सटीक है...एक बार कम्पटीशन होता है किस देश की पुलिस सबसे तेज है.. अमेरिका की पुलिस जंगल मे छोड़े गए खरगोश को 1 दिन में पकड़ती है, इंग्लैंड की 12 घण्टे में, स्कॉटलैंड की 4 घण्टे में तो भारतीय पुलिस खरगोश खोजते समय बन्दर को पकड़कर यह बोलते हुए पिट रहे थे बोल तू ही खरगोश है...! इस केस में भी गांव के लड़के गांव छोड़ निकल गए शायद वह पुलिसिया रवैया जानते थे क्या पता किस हिन्दू लड़के को पकड़कर उल्टा लटका मारते हुए बोले बोल तूने रेप किया... जैसे ही यह चार्जशीट तैयार हुई अचानक इस केस का मुद्दा जोरो शोरो से मीडिया में आ गया.. वहां की जनता, वकील सब रेपिस्ट हो गए गांव के लोग और जम्मू बार एसोशियेशन के वकील इस पुलिसिया थ्योरी को गलत बोल रहे है और सीबीआई जांच के मांग हेतु प्रदर्शन कर रहे... सोशल मीडिया के वीर इस पुलिसिया थ्योरी और प्रेशया के षड्यंत्र के शिकार हो लगे तलवार भांजने, रेपिस्ट को सजा मिले रेप की घटनाएं रुके सभी चाहते है लेकिन इस घटना में पुलिसिया जांच संदेहास्पद है... यह लुटियन मीडिया और हिन्दू वीरोधी ताकतों का षड्यंत्र था निशाना जम्मू की हिन्दू जनता और हिन्दू आस्था के केंद्र थे... विश्वास न हो तो आप श्रीराम और सीता के संवाद वाली पिक्चर,", "jhy_junaid": "Madam this is India # there is no humanity", "sathiyapaban": "Appa", "__swamped": "#justicforasifa", "prince.ps630": "जब आतंकवादी हमले में लोग मरते हैं तब आप का खून नहीं खोलत। हर उस बच्ची के साथ जो हुआ वह गलत हुआ है मैं उसके खिलाफ हूं लेकिन धर्मं मत बनो", "abhaygupta5518": "Jnu product", "sergiosetter": "🔥🔥", "moulimoni": "😖😖😖😖", "safran_muhammath": "#justiceforasifa", "shubhi2107": "Nothing will work in this country..law is totally weak and applied only on aam insan...same thing happened in USA whether a celebrity or any 1 once found guilty direct DEAD END!!!", "susmoy9336": "you better join congress..", "ananya123singh": "Kya justice kuch ni hone waala haiwan bn chuke hai log....hm hmare desh me hi safe ni....log justice maang rhe yha ka law kuch karne waala ni hai chutiyo ko jail me bi araam ki zindgi denge taaki fir wo whi kaam kare....8 saal ki bachi jiske abi umar khelne ki the usee khilone ki tarha khela jaata just shame on uhhh....#bullshitt yha hindu muslim kara jaa rha abi bi poltics....kuch ni hone waala india ka", "divyeshsniper": "Shridevi Ram Mandir and Swachta Abhiyan is still on trading Aasifa can't get headline🙁", "iamarush183": "Totally", "iam_syedshahzaib": "@khan__zeba", "ismailsard": "I need you come on", "vj_nation": "We are sadden for every little angles .....but y u only cry after knowing victimes name..plss...stop this hypocrcy......hang the culprits....", "modijaini7": "I am ashamed too", "musafir6012official": "ਇਹ ਕੈਸਾ ਦੌਰ ਆ ਗਿਆ ਕਲਯੁਗ ਘੋਰ ਸ਼ਾ ਗਿਆ ਮਾਂ ਭੈਣ ਤੇ ਧੀ ਦਾ ਰੁਤਬਾ ਜੋ ਬੜਾ ਉੱਚਾ ਤੇ ਸੁੱਚਾ ਸੀ ਇਹ ਕਲਯੁਗ ਉਸ ਰੁਤਬੇ ਨੂੰ ਖਾ ਗਿਆ ਮਾਲਕ ਦੇ ਦਰ ਤੇ ਜਾ ਕੇ ਰੋਜ਼ ਮੁਰਾਦਾ ਮੰਗਦੇ ਹਾ ਅੱਜ ਉਸ ਮਾਲਕ ਦੇ ਮੰਦਰ ਚ ਇੱਕ ਬੱਚੀ ਦਾ ਸ਼ੋਰ ਸ਼ਾ ਗਿਆ ਜੋ ਖੁਦ ਨੂੰ ਮਾਲਕ ਦੇ ਨਜ਼ਦੀਕ ਦੱਸਦੇ ਓੁਹੀ ਮਾਲਕ ਦੇ ਮੰਦਰ ਚ ਬੱਚਿਆ ਦੀ ਇੱਜ਼ਤ ਲੁੱਟਦੇ ਤੇ ਨੱਚਦੇ ਇਨਸਾਨੀਅਤ ਮਰ ਗਈ ਏ ਕੋਲ ਖੜ ਤਮਾਸ਼ਾ ਤੱਕਦੇ ਅੱਜ ਅਸੀਫਾ ਨਾਲ ਹੋਇਆ ਕੱਲ ਨੂੰ ਸਾਡੇ ਨਾਲ ਵੀ ਹੋਣਾ ਹੱਥ ਜੋੜ ਦਿਲਪ੍ਰੀਤ ਬੇਨਤੀ ਕਰਦਾ ਜਾਗ ਜਾਓ ਸੰਬਲ ਜਾਓ ਕੱਲ ਨੂੰ ਪਵੇ ਨਾ ਪਸ਼ਤੋਣਾ ਜਦੋ ਆਪਣੇ ਤੇ ਪੈਣੀ ਏ ਫਿਰ ਸੋਚੇਆ ਕੁਜ ਨਈ ਹੋਣਾ ਪੱਲੇ ਰਿਹ ਜਾਣਾ ਉਮਰਾ ਦਾ ਰੋਣਾ ਅਸੀਫਾ ਵਰਗੀਆ ਸਾਡੀਆ ਬੱਚਿਆ ਵੀ ਨੇ ਪਾਖੰਡੀਆ ਨੇ ਸਮਜ ਲਿਆ ਸੱਬ ਨੂੰ ਖਿਲੌਨਾ ਸੰਬਲ ਜਾਓ ਥੋੜੀ ਇਨਸਾਨੀਅਤ ਦਿਖਾਓ ਇੱਕ ਜੂਟ ਹੋ ਕੇ ਸੱਬ ਨੂੰ ਲੜਨਾ ਪੈਣਾ ਹੱਥ ਜੋੜ ਕੇ ਮੇਰਾ ਸੱਬ ਨੂੰ ਇਹੀ ਏ ਕਿਹਨਾ ਕੋਈ ਗਲਤੀ ਹੋ ਗਈ ਹੋਵੇ ਮੈਨੂੰ ਮਾਫ ਕਰ ਦੇਣਾ ਮੰਨ ਭਰ ਗਿਆ ਸੀ ਮੇਰਾ ਦੇਖ ਬੱਚੀ ਵੱਲ ਹੋਇਆ ਲਿਖੇ ਬਿਣਾ ਮੇਰੀ ਕਲਮ ਤੂ ਰਿਹ ਨਾ...... ਦਿਲਪ੍ਰੀਤ ਸਿਂੰਘ", "nntnbisht325": "Guys it's necessary to punish all those gaandus bt more important is to change the mentality of our hindustanis. Salo chutiyo dimag me aati kaha se inni gandi harkat karne ki. Agar aisa hota RHA to ek dusre ki maa behene chudati rahengi in darindo se", "amol989": "@reallyswara , i always found U adorable, dashing. Nowdays rapes, gamgrapes have became common, and reason behind is our slow & weak law, judicial system, corrupt system and people are mad, they suppprt blindly to anyone. Nowdays we see lots of rallys, morchas, bharat band aandolan, rasta roko, rail roko over many other iasues like reservation, community. But nobody does this for the women safet & security in India. I have observed that these cases are icreased after Nirbhaya case in 2012, reason being people use their powers, money to prove they are not criminal. I think any of the celebrity should take an initiative to start a march, hunger strike or rasta roko, people will automatically come forward in support. The punishment for rapes should not be just life imprisonment or hanging till death, it should be more than that, these all are easy punishments.", "adityaraina12": "@reallyswara the only punishment befitting this gruesome crime is the death penalty... but people in jammu are not marching in solidarity with them... they have genuine demands regarding the rohingya settlements coming up in jammu when kashmir refuses to acknowledge them and other things that are just wrong towards jammu people .... jammu jst had a terrorist attack in which a soldier died and her daughter was grievously injured... Lynch mob mentality", "safejohny": "Why u wokeup on this rape only why not for others ?", "shutupranjan": "I really want to know why its hindustan, its india bharath ohh, god stop this cheap politics.", "mushtaqueimran": "Swara, what a ghastly incident. I feel shattered.", "english_frien": "حساب لتعلم اللغه الانجليزيه نصائح كيفية تطوير مستواك دورات مجانيه😎 محادثه قواعد وازمنه طرق حديثه وممتعه الانجليزي اسهل ويانه@english_frien", "dhaliwaljass_675": "So shameful!", "mohit2908": "BTW last week a maulana was arrested for raping in mosque. Hold a placard for that too", "rajumcool034": "Only north Indians are doing these kinds of shits... I proudly say that we dont have any records like this in south India... But as a Indian I feel ashame...", "nishad1685": "I'm wid", "gajeravijay": "You are not Hindustan. You are lefist and lefist don't have countries. Or you can have China", "civilized.brat": "Celebrity ke stunt ka soch rhe hai chutiye...ye nhi soch rhe ki hua kya hai.....yaha ke logo ki yhi to problem hai dusro se gaand jalti h ek dusre ki", "bohra5252": "😥😥😥😥😢😢😢", "kanankarthik": "#just ke for aasifa", "learner_imran": "East or west india is best in rape.😁😁😁😁😁", "vinodkoli00787": "Sahi bol", "gvibhore": "Last nite... Priyanka Gandhi molested some congress supporters in the candle March.... Please save Priyanka Gandhi.... Lol.... From their supporters", "sagittariussekhar": "This is called selling a rape case victims plight to target the power centre. The first thing they noticed is that the girl was a \"Muslim\" and it can be used to target the right wing BJP. This not use rather abuse of social media. I am an Indian and am proud of being an Indian as I don't support crime against women and religion of both victim and the attacker shouldn't be the point of discussion. @reallyswara don't see a merit in your approach of the protest.", "i_m_chander.s.manhas": "Why bring religion into this ??", "tejaspawar6e": "Will she get justice just by posting this and changing dps? This will just add up to your instagram posts and a bit of publicity.Asifa incident is horrible.India is into an ocean of deep shame.But she wont get justice by doing this.It is more like a trend now of doing this.Ssly.Want justice? Get fucking out of your comfort zone.Go and protest on road.Candle march on roads.Join Asifa's family and help their protests.This will get justice.Understand. @reallyswara", "bhatkishan": "Why blame religion instead blame the person,who did it and he should be punished, but please don't put stain on any religion", "oye_sunil": "If any of you including photo wali aunty , is really having a pain in heart then protest in your respected areas , show your anger on roads, so that a message can be sent to gov. Bharat band karwane to log aaye but isme dekhte hai kitne log aate hai, or hindu muslim karne wale gaand me jaaye .In social media you can only gain popularity ..", "saroosh_humayun": "2no mulko ke ya main problem hai .is Py JB tak koi Sahi Ka action nhi ly gay kuch bhe nhi ho ga kuch bhe nhi.", "kminu13": "#justiceforaashifa", "viknesradah1973": "Shame on these people. Animals.", "jolly_yashvi": "#justiceforasifa", "jaisinghkularia": "Ashamed", "florence_q_me": "👍👍👍👍👍", "ramesh.shirali": "We all are ashamed", "krupali.oza": "અત્યારે હૂ બધાની પોસ્ટ જોવ છૂ...*જસ્ટીસ ફોર અસીફા* ......ક્યા હતા એ બધા લોકો જયારે અસીફા પહેલા એ કિડનેપ થય હતી 😡😡😡😡😡........જો ત્યારેજ એને તરત જ ગોતવા મા આવી હોત આજે કદાચ આપડા વચ્ચે એ માસૂમ બાળક જીવતૂ હોત ......હવે બધા લોકો કેડંલ માચૅ કાઠશે ....થોડા બે શબ્દો સોસિયલ-સાઇડ પર મૂકશે.......આ બધૂ કરવા થી અસીફા પાછી નથી આવાની...😖.....હા કદાચ એને આજ ન્યાય મળી જશે પણ એના મા-બાપ ને એની દિકરી નય મળે..🙃🙃🙃...તો પછી આવો ન્યાય શૂ કામનો??????😭..આપડા જેવા લોકો ની લાચારી ની હિસાબ આજે આવા જાનવરો ની હિમ્મત વધી ગય છે......જયારે આવો બનાવ બનતો હોય ત્યારે આપણે આ બાબત મા નથી પડવૂ એમ કરી ને જવા દયે છૈ....અને પછી....જસ્ટીસ ફોર ઇટ😡😡..........", "pawan.gahlawat.75": "Ik ldki ka rape up me b hua h uske liye b hmdrdi jta lo", "askaribanaraswala": "😥😢", "aziflalu": "#justiceforasifa", "tenzinshado": "We stand wit Aasifa", "kritisha_kunwar": "@audrika_", "im.mubashir": "#Justice_for_Asifa", "pravej": "Bravo", "beniwaljaat13": "Ac...main....baith.... kar..bkwas karna..aasan........hai.....publicity..k..liye.....koi..pil...dakihil... bhi...ki...hai", "that_brown_girll_": "Dear celeberaties if u want to protest dan do protest in reality. By posting a photo taking this piece of paper wearing branded clothes and putting up a expensive makeup doesnt make any sense that u r really upset for her. Wat u r doing is juz a show off. There were so many girls who were raped in India after Nirbhaya and before Ashifa y dint u stand up against the criminals then? If u so called celebraties had done this before than might be ashila wud be saved. U r celebrities, u hv millions of followers and ur income is also huge if u vl come in road for 1 day to protest against this type of brutatility, then i think situation wud hv been changed before, because following the celebrities lyk u, ur millions of fans wud hv also come to protest. U celebraties earn in crores, but u cnt spend 1 day for the rape-victims to help them to get justice and protest in roads. U juz post photos on fb or instagram. Stop doing drama, if u dnt want more ashifa or nirbhaya get raped in future than come and fight against the system. Force the government to change laws. Protest in Reality, not for publicity", "crazysoul_sonam_mishra": "Hr roj hota h yh bt justice koi nhi deta😓😓😓", "swamiraj2021": "Tu to kisi katuye ke sath hi apna muh kalaa karegi. Ye meri tereliye bhavishywani hai. Sali Noutanki", "shiekato_s_saif": "We want #justiceforasifa", "i_m_riteshnawaria": "Jb hum kisi muslim ko aatankwadi bolte h tb yeh muslim bolte h ki aatankwaad ka koi religion nhi hota isi trh rape krne walo ka b koi mazab nhi hota .", "indra_jit_rock": "Itna shame hai to ja na bhar me", "mr_aftab_mirza_official": "You are very great", "uomospace": "Hi👋 We are NEW AUS Men's Online Store👔 Visit our page for unique and trendy styles 🙏", "thebipinkr": "Nautanki", "lapetitchef": "Sharing!!", "manofhonour2210": "What I am Hindustan I am Ashamed ...", "shaktimahapatra_shakk": "A shame that they are justifying with religion.", "manti_kv": "Get fuck out of it. U ppl just dont have ny bullshit to do rather than debating here n behave like wise person condemning rapes. Spread positivity not negativity.", "danny_sahebdien": "People don't learn, should them between the legs.", "24khushi": "And does this posting on instagram with a paper on your hands stating that you guys feel shamed will change the scene..... Please guys stop behaving like this and do something in reality because you all are more able to do something for the safety of girls than holding a paper in your hands and saying you are feeling shameful for this act of cruelty", "ravulasandeep.ca.cs": "Assam???? Out of syllabus????", "jsanjay__1": "@reallyswara where were u when a 14 year girl were raped in a mosque in muradabad, that time u didn't evn want justice for that girl u are showing this just bcz media is showing all of this..same on u. if u didn't protest at that time why u protesting now. read that news on net", "l.bakchod": "Follow us for bakchodi and funny stuffs 😎🤙", "yesa95": "Hope everything goes well in India. I have heard all bad news since 5 years ago. All the stories were told by my Indian ex bf. So sad rape case still high and keep going on and on☹️☹️☹️", "patelhamza7861": "Un ki to far deni chaiyye", "sidzdiary": "Much respect and love for ppl like you @reallyswara . You don't have to be ashamed, ppl like them should be hanged till death, whether hindu, muslim or ny other. Nationality and religion is not greater than humanity. May every child stays secure worldwide. Love from Pakistan", "swapnil_pisal__": "Tu to pakistan bhi gayi thi na aur bohot uchal rahi thi.......jo desh hamare sainiko ki jan le rahe hai unke yaha jake has rahi thi enjoy kar rahi thi uchal kud rahi thi so..........SHAME ON YOU......i love my Hindustan"}