{"_kaustubh_": "Madam Divya ke liye nhi karogi post?", "kumarritesh70335": "Tora bich road p chod devau sutA k", "himanshuism___": "Ye sikhayegi mulli kahi ki", "bleed_olivegreen": "A girl who slept with an anti-Hindu guy follows that thing. & showing chutiyapa here. Waiting for your halala moment", "vishal___vishwakarma": "No justice for Twinkle?", "diptesh_mandloi": "Why u quite on Aligarh case,, Kathua case pe bolne wali Takhti gang k paas takhti khatm ho gyi ho, ya kharidne k pese Naa ho to, parcel kare yaha se,, A big shame 😡😡😡", "sandeepsingh9807199": "Bhosdi Kareena aur bhaskar twinkle ko insaaf nahi milna chahiye. Aab ashamed feel nahi ho raha hai.", "aditi_apurva": "Narrow minded people", "atidarshi_sharma": "And I don't know why you guys are putting DEVI sthan in inverted commas.. Rape is crime place doesn't matter... This shows that you guys only want to bring Hindus down.. U Don't want justice for anyone you just want your publicity.. Tum log kisi k sage nhi Ho..", "me_rohit_ranjan": "Tum sa#i mil jao na to tumhe muh dikhane layak nhi chodenge", "mmanish3011": "Get printed new cards ALI-garh, RAMZAAN MONTH, ROJEDAAR.", "officialnirmal4242": "Bloody bitch @reallyswara @therealkareenakapoor printed new card s for twinkle", "suklamandal": "I m Hindustan n i feel ashamed to have a citizen like u", "its_sam_eer27": "Reallyswara Ab aap kahan hai....aap sbko search kr rhe hai....", "nileshsinght": "Justice sirf asifa k liye chahiye tha ky apako, ya sab publicity pane k liye play card lagaya tha, aaj play card nahi dikhaoge, koi movie release nhi ho raha ky abhi", "vrbvikram": "I feel ashamed to have people like you are celebrity in our country. You all are like pig....always like to live in garbage ....These are not actress....all are working for particular religion ....", "anup020992": "Where is the protest for twinkle sharma by you and your frnz like these double standard people...🤔🤔..I am Hindustan and ashamed of double standard people like u..Hindustan chunotiyo se nhi tum jaise chutiyo se pareshan h", "anuraag_9394": "Randi jesi dikhti he karina khan tu...", "dipesh_mali_17": "Tu ze to sharam hi nahi aati justice for twinkle sharma", "yadavinder416": "Ab kha gayi , Hindu virodhi, whore ,", "surajdeo.singh": "Randi sali", "bhakt8259": "Hindu support", "arjunam_100": "Nun Ko support kyu nhi kar Rahi ho?", "deep_saini_49": "@reallyswara sale randi tu yaha bhe hindu muslim lay aaye jab geeta name ke bache ke sath gang rape keya muslims ne tab maderchod tum log kaha the sab ab ak or bache ke sath huva to apne gand leke aaye kyu ki vo muslim ha ? Sale randi yaha to daram mat laoo @reallyswara", "devotee_hari_": "*जिहादी मानसिकता* 👇😳 *आदिल अहमद ने किया यह ब्लास्ट। जैशे मोहम्मद ने ली जिम्मेदारी।* *नोट : आतंक का कोई धर्म नहीं होता* 🤨😖😠😠🤬😡😡😡", "single_stroke": "What about kathua rape case???", "ayaansingh_03": "abhi tere choot se paani nhi nikal rha h bhosrichodi..... #deshdrohi", "akash_linsky": "Han ye bhi Randi h we knows Pakistan jao", "mast_meme72": "Kareena tu pakistani hai", "ajay_uikey_": "Ye randiya batayingi ab aur itne rap roj ho rahe h unke bare me nhi bolti ye madarchod", "deep__talks": "Toh Jana Jake Pakistan Mai hi reh", "vesuvius_1411": "Get away from Hindustan you bloody woman", "zaynmalik29234": "Mulli kahiki", "sa_chin1211": "Mandsaur p bol", "pankaj_2318": "#justicefordivya", "aatoshkr": "Bolo Randi kuch to bolo ya pattaudi sahb ka lauda mooh me hai", "mrr.sharma18": "Abh kuchh nahi post kar rahe b.. paise nahi mile kya post karne k liy @reallyswara @karinakapoor_official #justice4Diviya #justice4Sanskriti", "adityarajsingh.panwar": "सैफ़ अली खान मंदसौर की घटना से आपको मुस्लिम होने पर शर्म आई या नही..? कठुआ पर तो आपकी पत्नी करीना को हिन्दू होने पर शर्म आई थी..👿😠😠", "instaravi82": "But sorry tumlogon ka to pehle se hi fata rhta hai", "aashayshukla1": "Now please stand with nida khan also", "kirtivardhan_10": "😂😂😂 Hypocrisy", "sanket__303": "Randi sali", "aryan.mishra_": "Wanna post about Gita ?", "celebritieslookalikes": "Porn star", "ishuhot": "@mtvtrollpolice gand ke andho comments pdho idhr", "prashant.jazz": "Fuck you bitch", "manish_boora_____": "Dear #Swarabhaskar u r whom UpTo some people look as role model n your acts will make them do the similar action so please raise your voice Everytime there happens wrong irrespective of social tags bcz only we people can make this place how we want the way leads to change for better this time also post to eradicate rapists from society not on occasions only", "annehaidylovemeenakshi": "Sad terrible", "mohit.kumar2192": "@reallyswara mandsaur rape me mulle ke liye kuch bol do.", "sagardev7534": "why r u silent about Mandasore Case,", "surajdubey20": "Mandsaur per kuch boliye begam sahiba", "shrishsharma007": "Kreenabegam", "parthesh_biswas": "Poster leke khare hone se pahele news dekh liya kijiye....desh ke naam kharap karle ne kite liye tule huye hain e app jaise lok...", "s.u.n.shine_007": "Can u say sorry to all hundistani for this post...... As it was planned ajenda.... If u have courage to say sorry???? @reallyswara @kareenakapoor_0fficial", "anam_makhdoomi": "Love u kareena 💕💕", "finaljustice2": "Bhai log, esko kya AIDS hogaya kya.", "engg_saptarshi": "jaha thali par khati h ye, usi thali par hagti h.", "yogeshsoni8220": "गाजियाबाद के मदरसे में हुए रेप पर भी कुछ बोलो या अब धर्म नज़र आने लगा #justiceforgeeta साली पैसे के लिए बिस्तर गर्म करती है अब पैसा नहीं मिला क्या तुझे।", "imayank_rajput": "Tum jesey logo sey bs yhi expectation kr sktey h.. 😑 hypocrisy level so high", "beast_roshan": "Can you post the same for geeta", "raajkumar_rajan": "Say something about geeta? You are shit", "manuzwork": "#kareenakapoorkhan everybody knows how big gold diggers are these Kareena and Karishma... they are just highly paid prostitutes..", "__crocroaz__": "@reallyswara #justiceforgeeta मदरसे में मौलवी द्वारा किआ गया एक बच्ची के साथ रेप उस पर आपका क्या कहना है या फिर आसिफा के लिए ट्रेंड करने के भी पैसे लिए थे। मुझे तो ऐसा ही लगता है कि आसिफा के लिए भी मोटी रकम ली होगी तभी तू इतनी उछल रही है। हर बलात्कारी को कड़ी से कड़ी सजा मिले लेकिन तुम लोग पैसो के चक्कर में बलात्कार में भी धर्म को ढूढ़ना शुरू कर देते है तुम्हे तो ऊपर वाला भी माफ़ नही करेगा \"स्वरा भास्कर\" हर चीज के लिए पैसे लेना अच्छी बात नही है। वैसे भी बॉलीवुड वाले देह व्यापार करते है और करते हुए पकड़े भी गये है लेकिन जो घटना घटती है उसको आगे कर के फेमस मत हो। #justiceforgeeta", "im__simi_": "तुमलोग womenempowerment के नाम पर धब्बा हो कमीनी गीता के साथ rape हुआ हैं तों बोलती क्यों बंद हैं वैसे तुमलोग का कितनी बार rape हुआ है वैसे किसी को तुमलोगों की rape करने की क्या जरुरत है क्योंकि पैसे के लिए तुमलोग खुद ही किसी का बिस्तर गर्म कर देती होगी ऐसे दो मानसिकता वाले लोगो के साथ तुम्हारे बेटे तेमूर का भी rape हो तभी गीता को न्याय मिलेगा bitch", "u_call_me_mr.cool": "#justiceforgeeta", "samir.shaw": "what about Geeta???", "anasam345": "ashamed of bollywood", "the_iconic_vigilante_23": "#justice for geeta... A 10yrs girl got raped in madrasa...no post!!!!!!!!!!!", "vikram_singh_chowk": "Tere nawab chutiye madarso m rape krte h uska kya ghsti", "vikky.3001": "@karreena Hindustan ashamed of u ... first go through the roots of this case ...for ur film promotion pls stop spreading this non sense ... bloody hypocrates ..", "jayesh_mahi": "Sali kutiya", "sagar__singh_rajput": "Bc news dekh pehle. Aisa kuch nahi hua", "akshh_1110": "@reallyswara when will u stand in front of camera with playcard reading\" i am india ,i am ashamed, girl named gita gangraped in madarsa\".stop this petty politics.a rape is rape.u", "karma_karma_1989": "ab tumhara benar kaha gaya?", "anvita_srivastava": "Aaj Geeta k lie justice nai chahie? Wo India ki daughter nai h? ????", "mjmanavv": "दिल्ली के गाजीपुर में मौलवी ने 11 साल की बच्ची से किया रेप ! \"अब तैमूर की अम्मी कहा मर गयी !!\"", "manisshkumath": "Yamuna Nagar में 13 साल की बच्ची के साथ बलात्कार मंदिर में नहीं, एक सुनसान पड़ी धर्मशाला में हुआ है पकड़े गए दो हैवानों के नाम है - दानिश और फ़रमान", "prasad_chauhan_": "Aaj kidhar mar gaya tu.... Aaj nhi yaad aaya tujhe geeta ke bare me post karne ka? #justiceforgeeta", "vishnu_rathore04": "Geeta ke liye bhi ek post dal do madam 🙏🚩", "anilgiythfsu": "Justice for Asifa and geeta", "_silent.soul": "Randiyo... Jara geeta k liye bhi takhti latka le apne boobs par.... Harami", "sachin_malviya20": "वो दोगले ऐक्ट्रेस क्या अब गीता के लिए हाथ मे बोर्ड पकङेगी अब कहाँ मर गये वो जो जिनको शर्म आ रही थी,,, भाङ मिडिया भी नही आयेगी कॉंग्रेस कैडाल मार्च निकलेगी क्या अब कोई नही आयेगा,क्युकी अपराधी शान्तिप्रिये समुदाय से हैं,,,,", "ashish.thakare": "मदर चोद आब कहा मर गए कटुआ कांड में बहुत चीला रहे थे दिल्ली में हिन्दू बच्ची के साथ बलत्कार महजीद में मौलाना उसके चार साथी मिल कर किया रेफ 3 दिन बन्दक बना के हिजड़ो नेताओ कहा मर गए", "alphaa111": "Asifa kio nahi.likha hindu saali @therealkareenakapoor", "mishradeepak": "Mam rape happened in masjid a 7 years old hindu girl gangraped by maulvies u nt even said a single word. Lannat hai tum pe", "anandjoshi": "कुछ बुद्धजीवी लोग आसिफा वाले मैटर में पीले पड़े थे.....बल्कि बुक्का फाड़ के रो रहे थे।रंडी रोना.....छिनार रोना.... हाय मैं लूट गया.....आसिफा का बलात्कार हो गया....मंदिर में हुआ..... शर्म आ रही है खुद को हिन्दू कहने में..... और finily..... court ने दूध का दूध और पानी का पानी कर दिया....ये झूठी कहानी और साजिश करार दिया... और आज 10 साल की मासूम बच्ची गीता का बलात्कार दिल्ली के गाजीपुर मस्जिद में चार मौलवी मिलके करते है।वहा से बकायदा पोलिस प्रसासन द्वारा बरामद की जाती है। और इस मामले में कोई भी बुद्धजीवी का झा* अपना मुह खोलने को तैयार नही.….. Justice for geeta...... ये मुहिम चलाइए..... मुहिम रुकनी नही चैये..... मौलवी और मदरसों पर बैन लगाना जरूरी है। दिल्ली के गाजीपुर में मोलवी ने 11 साल की हिन्दू बच्ची से किया रेप #तैमूर_की_अम्मी #sonam_kapoor #Swara_Bhashkar #Richa_Chadha #Farah_khan #bollywood की रंडियों अब कहा हलाला करवा रही हो सूअर की ओलादों", "shubhu0210": "U will feel more ashamed when your movie will be flopped", "mr.haru_zala": "बाबू एक खबर की तरफ आपका ध्यान खींचना था..दिल्ली के गाजीपुर से अगवा हुई10 साल की बच्ची का शांतिदूतों ने मदरसे में रेप किया..कुछ लिखा नही आपने.आसिफा के वक़्त तो आपकी छाती फट रही थी,फेसबुक पर काफी दुखभरी कविताएं पोस्ट की,अब सांप सूंघ गया क्या?", "chetansharma97": "bhdwi ran.. ra tu toh rehne hi de tuje toh ldko k kami pad gyi thi na .....ja apni aisi c...... or faltu bakwas bh k l a jayenge I m as.....te sale bakwas krne ch.....k pathe m....... sale suar tu chali jati uski jgha vaise bhi tum ye hi krte ho", "anadi_bells": "Makeup k peeche chipp k Yes sab likhwa ke photo kichwaane se kuch ni hone wala", "tapasvidixit": "Hello swara can I get a reply from u... Or ur JnU bosses have told u to go on leave... Wait n watch everything is coming out from this case....", "nickevetts_20lun": "good to stand up and be counted, I will continue to buy your films", "laxmank420": "Iss randi ko to bs pakistan jaane ki jldi hai ab", "escapist.tales": "Aur haan.. iss par death ordinance bhi pass ho gaya hai.. ummeed karta hu.. ki wapas aap proud feel kar rahi hongi.. ya fir afzal guru k liye hi sharminda hote h aap log??", "_pallavi73": "Why u all are trying to defame hinduism...rapists don't have any religion ok,so kareena kapoor khan ji next time kahi v jab terrorist attacks honge tab dekhte hai ki aapko islam pe sharm aati hai ya nhi😣😣", "deadend03": "Anti indian @reallyswara #boycottlevis", "shruti.shrivastava": "Come on yaar.. not you please.. you are among one of the sensible actors yaar please dont make this a religious issue.. a rape is a rape and a rapist is a criminal be it hindu muslim or whoever..", "jasondessen1": "Well done Kareena! So pathetic seeing these Hindutva complaining about left-wingers and secularism and everything else... Stop excusing the murder and torture and rape of children. History shows that nationalism is poison - it causes hatred over and over again. Unfortunately, nationalism is resurgent all over the world. Decent people need to stand up to it.", "lisashea17": "It absolutely blows my MIND that this is even controversial. A child was gang-raped and MURDERED! How could anyone oppose someone who speaks out against that?? Shame on you people. And good for @reallyswara for using her platform to speak out against heinous crimes and horrible people!", "puneetme": "M your regularbased follower but, this Time you made me & my whole family disappointed , M hindushtan & M unfollowing you. I know it doesn't make any less count but can't follow the bitches like you ! Shame on you @sonamkapoor @kareena.kapoor.official @reallyswara", "amandsuspect": "Plz Sign 1 Click on Link 2 Write Name,Email 3 click on Sign #JusticeForAkanksha https://www.change.org/p/my-sister-is-killed-investigative-agency-is-not-taking-out-call-details-which-are-main-evidence-right-for-individual-call-details-justiceforakanksha", "antumandalslg": "Karliya na apna VDW ka promotion.....kaha rehete ho aur SAB rape jab hota hai", "should_have_been_us": "Ye to Muslim hai hi . Kahan thi ye kab Hindu k saath rape hota hai and rapist Muslims hote hain ? Kathua mein koi rape Nhi hua hai , Muslims be hi usse mara hai . Tum kaise gawar logo be desh ko barbaad kr k rakha hua hai . Kuch padhte likhne to ho nahi .", "currentbrar47": "##All people... ignore help and sport for ##asifa case...but....on post comment very quickly....wah....very gud...you show...this...page in your hand...dear karina..ma'am this ..post not...only for comments...and...likes...after .some..times....no.... remember anyone....this case... very ...shamefully...and...Not...any work...in low and publice work.....", "ar_vidhyuotma": "Bitch", "neha_kohli07": "Atleast some one has guts to come out and stand for support, unlike you losers writing shit on walls. You are the real criminals using religion as shield to protect rapists.", "therajamrit": "chutye h sale ..farzi bollywood... film promotion ke liye ye chutye sale kuch b kr denge. i mean kuch bhi. rape murder se in chutyo ko koi farq nhi pdta..bs apni roti sekni h.", "theravi91": "वॉलीवुड की मोहतरमाये जो हिंदुत्व पर शर्मिंदा हो रही थी पता करो की अब जिंदा है या मर गई.... क्योकि रेप तो हुआ ही नही..", "shivend12": "u r masturbation queen", "jlj9500": "👏👏👏🙏❤️", "smiling_moron": "Foolish bitches...", "hemant__sharma_": "You miss have lost your mind. I really liked your movies but this is anti national and rogue use of freedom of expression.", "official_bhanu_rajput": "Kitne pese mile h bollywood walo ko", "travelwithgoonj": "Unfollowing u bcz u guys hv forgotten what is humanity. Making ur career , trending on internet is all u care.", "kunwarbhagwan": "Kashmir me lakho pandit mare gye tab kha thi tu kutiya . Tu jo apne dharm ki nahi hui to kisi ki bhi nahi hogi . Ham bhi rap ka virodh karte h .rapist ko fhasi do .but jab kisi muslim ke sath hota h tab to aap itna hangama karte ho . Jab ki hindu ladki ke sath ho to aapki ju nahi rengti . Band karo ye natk kisi mandir ko badnam karna. West Bengal me itne hindu mara ja rahe h tab aa sab log kaha the .karina ji masjido me madrso me kya kya hota h pata h .hindutv par bolne se pahle 10 bar soch lo.aap jo india ke muslim ho hindustan ka kayar hindu tha . Lekin asli hindu esa kabhi nahi karta . Samjhi .(dongli sali)", "shubhendra.singh779": "Amrita Singh Ka Ghar tabah kiya TB sharm Nahi ayi...tum p Hindustan ko sharm ani Chahiye dusro Ka Ghar tabah karne wali kutia", "singh_raghav22": "Bollywood Whores wake up when something happens to minority and the incident is trending ... Thousands of hindus slaughtered , no one bats an eye.... When salman khan kills people in sleep , they come in his defense..", "alamnurmandal": "Thank you vaby", "sanjayjadhav_": "Attention seeking flop actresses with no brains 👏👏👏", "sumitbikki": "Does she know about temple of khtua I am pretty sure no else she could not mention that ..it's said girl were kidnapped and kept inside temple between 1 to 16 Jan but there was Bhandara on 15th Jan.. she does not know his seems because she does care .. if she named her child Timur then it's says answer itself ... Taimur did everything to destroy Hindu stan and she seems like that act..", "sujan_ll": "VDW trailer???????? When?????", "shubhakhar_gupta": "Y to include Hindustan, it arise another agitation", "jayanta.dey.10888": "Indian main khya first time rafe houa hai????", "ritood2": "Another poser!!!", "yusuf_m_h_g": "hello hw was the day", "pawankumar9677": "Condemning the act was appreciated..OK...but putting hindu temple, hindu ideology to shame only came to your mind after marrying patuadi or do the kapoor family also feels the same", "mreditor__": "Every time when there’s a crime people mostly gives titles like justiceforsyria justiceforfrance or justicefor___ girls names who’s been raped , But I don’t get it what’s with this new thing ? I’m Hindustan & was raped in Devi Stan !! I’m so against the crime but these playcard looks different ! These playcard looks like conspiracy towards Hindus and how can they forget gang rape case of Hindu girl in Assam by Muslims and after rape she was burned alive ? Can you imagine. ! YES SHE WAS BURNED ALIVE!! Where are your playcards now ? #shameonhumanity", "pandeyprakash30": "shut up hypocrite,nice way to stay in news and gain cheap Publicity for your upcoming film.", "sdbfgfgfhfh_drff": "https://m.youtube.com/watch?v=ohLBWFESQs4", "tyagishiv19py": "HAR FILM ME RAPE SCENE ...MILKHA YAD KARO...DALNE WALE BOLLYWOOD KO SARM ANE LAGI HAI WAHHH....DARU KE PACK BADHA DIYE KYA....AUR HA APNI APNI STORY PAR JARUR FILM BANANA OK BB KO TALAK FIR NEW SADI FIR TALAK PUBLIC SAB JAAN CHUKI HAI", "youths_truth": "Follow the Bollywood celebrateys styles,look,xar,their movies but dont follow them on social issues...they make no sense...without knwng any thing they stands for untrue things...plzz first to understand what had done then u show u r thoughts of power", "prasanaa.pp": "Awww..Karina / Swara can't stand and support for who killed on footpath by Salman or The animal killed by him...awwww..pls Karina / Swara show up don't be bias ..there are many issues in India .. oh sorry now Hindustan ..Which you have to make placards ..awwww..awwww", "sarmi1985": "I am surprised that Bollywood is taking a stance. The same industry that has objectified women as objects of desire , the actresses who essay these roles in scantily clad ensembles are today using their social media tools to propagate respect for women!! Seriously isn't this a conundrum? Could you not like in PINK send a message that a No means a No, that consensual sex is the way to go not forced , that a woman should not be judged by the length of her skirt similar to a man by the length of his shorts, that we don't need to dress provocatively to entrap a man aka Umrao Jaan ( the eyes do the dance) and most of all our only essence in life is not to be taken to bed and bear kids but to celebrate us as human beings on this planet who will walk side by side our sons our fathers our husbands . Films need to change the female narrative and actresses have a moral responsibility towards society as the uneducated less privileged mass sees them as torchbearers . My two cents with all respect to your professional endeavors.", "_lazy_writer_": "What you guys are doing here???? Promoting your film, itni acting mat karo, it's useless. Be human and have some courtesy. Don't promote your film in the name of that poor innocent child.", "chinmay__deshmukh": "This is Kareena Kapoor who named her son after the Cruel invader \"Taimur\" who killed millions of innocent People and now she is talking about justice. Where were she when Kashmiri Pandit women where raped ???", "rohittinkoo": "Totally boycott these Bollywood bhaands.. inse achhi movie aur moral sense south film industry rakhti h.", "lokendra_0000": "Baki rape case me kaha gye #totaldrama", "kumari_amita_": "Love you My fvrt..Bebo💜💜💜😘😘", "p_singhhh": "1st of all ye to sabse badi dhabbi hai India Me I don’t know why she came and saying all this coz she has some reason no no wait ....Jisne Apne bête ka naam taimur rakha h look at her as if she don’t know about the story of taimor ali Khan hahahahaha😂😂😂fuck that shit waha Baith kr keh rhi h just grow up😂😂", "aishwarya_singh5": "@reallyswara ma’am do you really think it’s alright to shame the whole community for the crimes of some monsters who should not be called humans altogether leave alone Hindu Muslim Sikh . You people leave a mark on the society and when your thinking and posts will bring such communal angle then how can you expect the uneducated and naive people to understand and demand justice and only justice for the poor child . Why have you written HINDUSTAN instead of Indian . Do you really think that the whole community should be shamed coz because of the likes of you only Muslims are treated as terrorists because of actions of few Muslims the whole community is disgraced and you and your friends are doing the exact same thing only just Hindus in place of her . For Gods sake stop communalising it ! Demand for justice ! Ask for harshest of punishments to be meted out to the criminals . I know most probably you won’t even see my comment and it will be lost in all these comments but your thinking is seriously flawed here and your flawed thinking will leave a mark on your fans and many other people please take a thinking corner and think !! Before writing and putting up posts !", "thegrimreaper.666": "\"Mein towh tandoori murgi Hoon yaar , Kat kha le zara alcohol se\" ye line PE dance karnewali @karinakapoor_official is protesting, only on social media against rape, that too with a copied poster😂, I think she has a movie releasing anytime soon, please protest for other rape victims also, they're too human....", "rohit_hrithikian": "@reallyswara @sonamkapoor sirf asifa ko hi justice kyon?, aise or kitni bachchiyan hai jiske saath rape or murder hua hai koi 5 toh koi 6-7 saal ki thi, har wo ladki ko justice milna chahiye jinke saath galat hota hai. Surat me bhi 9 saal ki hindu ladki ka rape or murder hua, 7 dino tak torture kr k maara gya, 84 injuries mili hai body me. Iske liye aap logo ka support kaha hai?. Karo na iss news ko bhi highlight, kya iss bachchi ko justice ka haq nhi hai?, strict punishment milna chahiye har rapist ko.", "jindalpuri": "Chup hoja jub Hindu ladki pe hota hai to Kaha kho ja ta hai bollywood.....foolish bollywood", "oyekaran22": "Madam are u know who is #Taimur? Just go and search on google. #SelectiveProtester", "kk.khan9789": "No name is written 😑", "nikki1_nikki2": "And if you really wanna talk, come and ask the media to held up a show where you and the youth of our country comes forward to talk and then you will realise how stupid and doltish you are... Otherwise it's a good way to gain popularity and promoting movies...", "chiku.123": "U heart our religion sentiments ..legal action taken against u", "kshatriya.memes": "shame on you swara bhaskar shame on kareena kapoor khan shame on sonam kapoor. you people are using a rape victim just for promoting your new up coming movie veere di weeding. orr kitna neeche giroge, you were the one who was saying that when invaders come to india then rajput womens should have handover them to mughals instead of doing jauhar....and now you are asking justice for a girl who has got raped....shame shame on you people. ek movie ke liye itna neeche gir jaaogi kisi ne socha nahi hoga", "uomospace": "We are NEW Aus Men online store 👔 and plz visit our account and take advantage of 10% discount 🙏", "rohan_jaswal_rsj": "Hindustan ko badnaam mt kro", "yuvrajlakshkar": "10 April ko ahemdabad me 11 year bacchi ka rap hua .....usk liye abhi tk koi samne nhi aaya ya koi gussa nhi dikha rha na hi koi candle march ....bcoz us case me kisi ko koi poltical or religion ka masala nhi mila na in sbko .....", "shobhiwant_": "Did Bollywood bimbos refer to India as Hindustan before? Suddenly when the victim is Muslim and alleged culprits are Hindu, India becomes Hindustan. Did they hold placards for pedophile pastors or jehadi rapists? But now they mention Devisthan. Brace up Hindus there's evil afoot.", "audacious_mikhil": "Rape is a heinous crime which has nothing to do with religion..Stop propagating..I am ashamed that i ever watched movies of stars like you who dont have their own common sense..I also want #justiceforasifa coz she was our child #hangtheculprit", "rajindergarg8015": "Bjp leaders full right to do like this samefull work", "__princess__ss_": "*DP BADALNE SE KUCH NAHI HOGA* *GOVERNMENT KO EMAIL KARE* *narendramodi1234@gmail.com* *connect@mygov.nic.in* *MODI JI KE FACEBOOK PAGE PE COMMENT KARE* http://www.facebook.com/narendramodi *MODI JI KE TWITTER PAGE PE TWEET KARE* http://twitter.com/narendramodi *UNKE YOUTUBE ACCOUNT PE BI COMMENT KARE* http://www.youtube.com/user/narendramodi *JAB HAR JAGA HOGI AAWAAZ TO KAISE NAHI MILEGA INSAAF*", "abdullampb": "Im an indiam....im ashamed of Kathua incidence...#justice for Asifa", "ghostrider9901": "Lagta hai Bollywood walo ki aankhen tab khulti hai jab Islam ya fir koi musalman khatre main ho. Are yeh so called actress jo papers main kuch bhi likh ke post kar rahi hai koi inse pucho ki sirf Kashmir ki hi beti dikhi yaa fir woh jo pehle se rape pidit hain unko rape ka sauk hua karta tha .Are awaz uthana hai toh sabke liye uthao warna drame tum log movie main bhi karte ho", "pawanojhasamrat": "Yeh Sare MC So called Secular hone ka Dhong karte h", "guptaawaya888": "Highlighting the devi sthan temple what is it", "o__o__fo": "😘😘😘", "me_learning": "Stop publicity stunt.", "pratibha903": "🙏 kareena", "itsshubhamchaurasia": "TMC sali yaha bhi aagayi publicity stunt kerne", "huma.ashraf.3348": "Thanks kareena", "sanootamang": "Pakistan se terriroist khatam nahi hogi kabhi.. aur india se rapiest... 🙈🙈🙉🙉🙊🙊", "ankitsri2812": "N ys similar thing happens in UNNAO... It's also a part of India.... Nw why r u people hiding dat", "chandu_navgire": "https://m.facebook.com/story.php?story_fbid=2121379668080994&id=1802346019984362", "mihirdas1988": "Unidentified body found in gorchuk, Guwahati, Assam, plus point is BJP govt, minus point is unidentified body, kindly raise some voice for this victims also", "siddharthbunty16": "@reallyswara sport a placard which reads out, \"ISLAM HARAM HAI \", \"I AM ASHAMED ON BEHALF OF/OF BEING A MUSLIM \" It's entirely being fabricated by Bollywood Buffoons to topple Hinduism & erect Islamic Caliphate ... Rape endemic that broke down in Assam involved HINDU victims & the accused were MUSLIMS ( all of t'em were equally gruesome ) #JusticeForAllHinduGrlsRaped ...Swara why the hell are you defaming Hindus ?", "aamenahussaine709": "first of all u should b ashamed tht u make differences betwee religion.....we r in a freadom free country... nd we all have freadom to live our lifes as we want...u don't have any rights to say any tng on anyone's persnol lifes.....", "roshanstar9": "Kareena ,respect for standing up for humanity! Trolls,are zeros,they are subhuman,the world is on the side of humanity🙏🏻", "babar952": "Hats off to u dear....", "abhijeet.dass": "I m proud to be Hindustan , dis kind of brutal crime neigther represent any country nor religion , if u r ashamed being hindustan. immediately leave my Hindustan.", "bs_naam_hi_kaafi_h": "You re highlighting that case because a muslim girl was there . If you ard really caring for gangraped victims then do it clearly okay", "huneysri": "@reallyswara ''devi sthan''? Does that really matters?? I really liked you as an actress and human being but after this I am really disappointed. Rape is a heinous crime and it should not be categorized on the basis of religion and place.!", "abrar_hashmi10": "Love you Kareena Khan.", "amit__mishra_": "Baaki rape victims ka kya?unko hamare support ki jrurat nai hai??unko justice nai chahiye??kewal kathua rape victim ko justice chahiye???jo log bhi is rape ke liye guilty hai unko is samaaj me rehne ka ki haq nai hai unhe fansi se km saja nai honi chahiye...but the way u all are demanding justice only for one rape victim is very wrong,and u all are in that sector from which u can influence society and motivate them to protect girls,but unfortunately most of u only objectify girls to earn money,firstly be ashamed on this \"i am a girl,i work in bollywood, i have never done anything for women empowerment\" i think this will suit on ur playcard most.", "zeus_sadiq": "I SENT THE HORSES BACK HOME by Anonymous Maai, I sent the horses trotting, And they found their way back home.  But, I couldn't. My legs that you thought were Swift as those of a deer, They froze. Maai, they froze.  But I sent the horses home.  Maai, them monsters, They had no horns or fangs, Or deadly long nails. But they hurt me. They hurt me bad, Maai. The purple flowers, The yellow butterflies, They stood there helpless.  While I sent the horses back home.  Maai, Tell Baba that I know, I know, I know he tried. I heard him say out my name, I heard him repeat it loud. But, I was sleepy Maai, I was tired. Them monsters, They hurt me bad.  Strange as it may seem to you, Maai, It feels like your warmth now. It doesn't hurt anymore. The blood has dried And it looks like the purple blossoms That swayed with me in the meadows. It doesn't hurt, Maai.  Maai, The monsters are still out there. And there are stories too. Don't listen to them Maai, Gut wrenching and agonizing they are And a lot you've gone through.  Maai, Lest I forget, There's a temple there Where lives a goddess. Thank her, For I think it's she who helped,  The horses find their way back home.  #JusticeForKhatuaVictim", "gauravchauhans": "#JusticeForAsifa", "quotes.0325": "U shit ppl, an innocent as suffer so much n u r playing religion game, whoevr hav said tht kareena married a muslim n named him taimur, toh tera kya ja raha hai re, shaadi ke liye terese paise liye the kya, get a life dude, we are humans 1st. Plz dont forget dis, jst bcz of sum shit ppl with no brains comment anythn.", "srinuenla": "It should be I am a Hindustani..not Hindustan you missed I. ..it matters.. dear Kareena", "ram.g.108889": "Good kareenaa", "gold.gold88": "TU ZARROR KISI MULLEY SE CHUDEGI..RANDI SALI @reallyswara @therealkareenakapoor KAREENA TOH HAI HI RANDI..DONT FOLLOW HER FOOTSTEPS..NACHNE WALO KI KOI AUKAT NAHI HOTI..SHE IS NOT MOTHER TERESA...", "iamdeepti16": "#repost #justiceforlittlegirl 😳😢", "nillapradeep": "Justice delayed is justice denied. Mumbai bomb blast culprit hanged after ten long years for the massacre he did. In all the molestation cases the criminal escapes out easily. This time to cater more masala to the case religion is mingled. A rape case is a rape case and Hinduism has nothing to do with it as Islam has nothing to do with Mumbai bomb blast case.", "_ankit_shukla_": "Khud ke chadii ke ched dekho phir dusroko bhoko...", "travelwithrani_": "😢😢😢😢😢😢😢😢😢😢so sad. The world is just cruel 😢", "milunous": "And here comes another actor. I can’t stop laughing at the acting fraternity for they never show up for other issues but selectively appear on those that can give them mileage. Shame on Bollywood! #shameonbollywood", "kiranchavda83": "दिखावा कर रहे हैं सब ।", "prasantanandi31": "When will get the #justiceforfootpathvictims", "rp_rushi": "No need to show your low acting abilities during such critical situations and not even by showing your crocodile tears. Everybody is mature enough to understand their responsibilities. India is a wonderful country and there is no need to be ashamed about anything just because of some negative particles. You really need to peak up your understanding and increase your maturity level to what to react on and in what sense. Peace out ✌🏻", "mohd.umer007": "Thank for supporting Arifa", "bishnu__95": "😥😥😥😡", "ashmit_1724": "@reallyswara is such a whore ,flop actress is using this rape issue to get publicity", "i_am_divaa": "Bhaiyya support kar rhe ho, justice maang re ho toh usme sirf ek beti ke naam pr hashtag kyu h?? Assam aur bihar ke lye v kro na protest. Kro na unke lye v play card use. Aur kitne cases aise hain, jo ab tk nazar me v nhi aye hain . Jaise odisha me 4 saal ki bacchi ka rape ho gye. Kro na sbko support. Why only #justiceforasifa ? Why not #justiceforall ? Why not #justicefordaughters ? Why selective Outrage????", "_mrkhan__": "This is the problem in India...when other countries are discussing Global warming Artificial intelligence robotics we are still shackled up by religion and killing one another in the name of religion.... I'm disgusted to say that I'm an Indian...really takes the nuts out of me to say this...disgusted!!!", "ak_naidu88": "Why u celebrities think dat speaking in a social platform is good...do something in real life if u ppl really care about society...", "gippsy_girl82": "Lets file a PI for death penalty . Any one ?", "sandeep435_": "Ye khud Apne bete kaa naam balatkari taimur rakhi hai..... Ye kya ashamed hogi @reallyswara", "rohillasanju4": "The shocking incident that has made us feel ashamed of humanity as the 8-year-old girl was gang-raped, drugged and then, murdered by a group of people in Kathua. justice delayed is justice denied!! #JUSTICEFORASIFA😢😢", "deeksha_h_shastry": "Wonderful !! This one's surely doing something ur posts of yourself couldn't for u... That is to seek more public attention. Nice trick lady! Try posting pics of some more famous actors.", "aasifbhati01": "Logo ko sirf Hindu Muslim karna ahta bass kch sekho yar samjo koi insan ko ache Se desh ko aplog k support ki jarurt hai", "ramchandra.rcyadav": "Hi", "that_brown_girll_": "Ok Miss Kareena Kapoor khan are u not ashamed than Wen some dirty media was posting the photos of ur child Taimur instead of posting the news of the rape of a class 5 student and a reang girl in Assam? Swara Bhaskar fake liberal, Hindustan is ashamed of having narrow-minded celebrities lyk u for whom Humanity has also reservations.", "ashish_kavthe": "Nikal nautanki", "amt2jal": "nawab ki rakhail", "mr.muhammadmohibullah": "#justiceforasifa", "btownreviewer": "I am not Indian but from my perspective this goes beyond race, religion - this case and others like it, is a crime against all humanity - all women, all our sisters and daughters ..much respect to all the celebrities speaking out - it would be easy to sit on the sidelines and say nothing, for fear of unleashing a barrage of negative criticism - kudos to you and all others that have spoken out or taken a stand! I’m with her! #timeforchange #prayerforasifa #raiseyourvoice", "shubhamrajput.rajput": "First and foremost we are against any kind of criminal act towards anyone. And you are not Hindustan mam you are just a petty minded person who don't have proper information about the situation, and you are just holding a piece paper which abuses our religion, our country, our countrymen(not every Indian is a rapist) so think twice before doing any act like this. Hope humanity survives.", "gagan.parashar88": "Bolne ya protest karne se nahi hoga....", "mysticsrishti": "The guy who wrote shit about kareena needs deserves this flaking. But people like you who blame every thing on govt also need to open their eyes and see the reality. Excessive relying on media's propaganda news is what u want to believe in and not interested in seeing the reality. People like you are fake liberals, whose everyday job is to blame modi and bjp for everything. Wake up and go interact with people. This type of mentality exists everywhere and in every party. But no. Bjp. Bjp bjp. Keep barking. Idiot.", "prathmesh_dubey": "SASARAM/PATNA: A large number of villagers blocked the Sasaram-Buxar state highway for at least four hours on Wednesday near Kargahar market area under Kargahar police station area in Rohtas district after a six-year-old girl was allegedly raped by her neighbour on Tuesday evening. The villagers were demanding speedy action against the rape accused MerazMiyan (27), who was arrested after few hours of the incident. The blockade was lifted after police officers assured them to fulfill their demands.", "architectmilindkamble": "#kareenakapoorkhan thank you fr speaking up and supporting", "nazrul7711": "Bravo kareena mam", "shekhaar_vorra": "Modern punishment which will be painful and agonizing— in front of the whole nation chopped off their penis and one arm and let them live — so then the suffering will remind them for the rest of their life and after that they will ask for death but death is not the solution for them they have to live their life without the arm and the penis till they die —", "aravindanumashankar": "More power to u girls", "callme_sd07": "They are letting down to India in the WORLD", "vj_nation": "https://m.facebook.com/story.php?story_fbid=10211544326671751&id=1472199831", "arpeetapawaskar": "I asked myself what do see in 8 year-old child, i got the reply that, \"i see a BEAUTIFUL smile, innocence and happiness\". The devil around said, \"i see that she is a virgin-girl. And I want to break that \" This is what is the mentality of these bastard devil's. 😤", "sharma_ashu7": "मुंबई से सासाराम, कठुआ से ज़्यादा पास है फिर भी बॉलीवुड तक सासाराम की बेटी की आवाज़ ना पहुँची कठुआ की बेटी के लिए ट्विटर ट्रेंड बहता रहा दिनभर शर्म आनी चाहिए भारत के सुपर स्टारो बलात्कार जैसे कुकर्म का भी धर्म बात दिया", "loving_urs": "Khatua was not a rape case.. The minor was not raped... She was killed somewhere else n her body was dumped in that temple. The SOLD OUT MEDIAS R SIMPLY PROPAGATING FALSE AND FABRICATED STORY .. WHY DONT THEY UNVEIL THE TRUTH?? 😈😈 ARNAB AND TIMES NOW WERE SO ENTHUSIASTIC IN DIGGING OUT THE SUNANDA MURDER CASE ,WHY THEY R NOT SENDING HIS INVESTIGATION TEAM THERE?? It's a conspiracy of the Pak, Cong,Rohingyas and Mufti to make Jammu a Hindu free place.. The Central must take a strict action to break this \"CHAIN OF CONSPIRATORS\" and their ILL INTENTION OF BREAKING INDIA. #Khatuacase", "leela0024": "Yes thanks to kareena kapore khan God bless her", "bantidhar": "Lauda", "crazy_heart1412": "😢😢", "sakhi_m416": "Why do people say mera Bharat Mahan, what mahan things are happeing here. 8 years little girl is raped in temple which is a holy place, everyone is giving there suggestions and opinions. Why those bustards are not arrested, why dre is no actions on those animals, ohh because BJP is ruling India.", "bhawanasomaaya\nVerified": "Verified", "tushar._.01": "@reallyswara check pm . I sent u a girl's feelings 😔", "nwaabsaab_pb10": "What growth and safety are we talking about, if women and specially little girls are note safe in our country....Shame on PM, if u can't do anything....#justiceforasifa #narendamodi @narendramodi", "pree_lil_star": "Mr. P.M. do something 😤😤😤😤😤😤", "queen_.of_queens": "Ashamed huhh", "bhamra_vicky": "Thank you ??", "saurabh.priyadarshi007": "More over who said you are hindu. you are not you are muslim now", "sid_sarah": "What is there to thank her about. Is she doing anyone a favour by doing the barest minimum for such a huge incident in the country? If she really cares maybe she can show it in her work and choices of films and item songs?", "beingsuburali.m.a.s": "Hm chillate rahenge rapist pakdai nahi aaega..janta h unhe chupane wala,char din poster hantho me lekr awaaz uthaenge panchwe din sb khatam.gunahgar farar. @reallyswara @kareenakbebo @suburali.m.a.s", "deep_aman_t20": "Disappointed kareena kapoor didnt expect you to hold placard with this language like 'devi' etc. A simple justice for Ashifa justice for all would have been fine", "queenofbollywoodkareena": "#justiceforaasifa", "aarzoo138": "We need justice", "dhaval_1556_": "However Loud you shout but our government won't do anything in case of Asifa they will just play their sheer politics they didn't do anything case of nirbhaya do you think they will do now no they will just employee a faulty committee and give corrupted result and finally this incident will be added to political parties manifesto and will promise to impart justice to victims but won't do anything congratulations guys this is incredible India ,Shame on the government and FUCK the Indian government", "shubh_skv": "Sch m kuch Krna h to apni bssy life se bahr niklo..and go to take a strong action against this typ of monster social media. M pic upload Krne se kuch nhi hoga kmsekm is topic ko to rhne do sch m andha kanoon h India ka 😖😖😖", "dof.ma.kec": "Salute her 👏🏽👏🏽", "nourel82houda_": "Im glad everybody is rasing his/her voice, like they did with pads for Padman. #justiceforasifa ... to be hanged till death for the devils", "thenomadwoman": "So fake..", "salman_sherrr": "Thnx for support", "iam__shen": "🍁💕💕🍁🍁🍁", "priyankabansal._": "Yes , I am Hindustan. I am made up of people, , not any religion. You people are responsible as there is no humanity left. No religion teach you wrong deeds. Stop faking and start taking responsibility of ur own acts.", "parkash_ahir": "सासाराम में 6 वर्षीय बच्ची से दरिंदगी करने वाला मेराज आलम गिरफ्तार तो हो गया है किन्तु उसे फांसी नही होगी क्योकि हमारा कानून दुष्कर्मियों पे थोड़ा मेहरबान है। पास्को एक्ट के अंतर्गत नाबालिग से दुष्कर्म करने पे 10 साल कारावास या अधिकतम उम्रकैद की सज़ा का प्रावधान है। हम चाहते है कि मेराज आलम को फांसी की सज़ा हो लेकिन वो बच्ची के जीते जी हो नही सकती, क्योकि फांसी की सज़ा तभी सम्भव है जब पीड़ित बच्ची मर जाए। अतः दुआ कीजिये जिंदगी और मौत से जूझ रही बच्ची मर जाए.. गौरतलब हो कि बलात्कार के बाद पीड़िता के मर जाने पे ही फांसी का विकल्प है। यानि की हमारा क़ानून दुष्कर्मियों को सिर्फ इसी शर्त पे मौत के घाट उतारता है कि पीड़िता की मौत हो जाए। दुष्कर्मी को फांसी तक पहुंचाने में सबसे बड़ा रोड़ा पीड़िता की धड़कने है, शायद यही कारण है की गत वर्ष देहरादून में दुष्कर्म पीड़िता ने आत्महत्या कर ली थी। यदि आप बच्ची के मरने की दुआ ना करके पास्को एक्ट में संसोधन की कड़ी मांग करते है और इसमें कठोर संसोधन हो भी जाता है फिर भी आरोपी मेराज आलम को बच्ची के जिंदा रहते फांसी नही हो सकती क्योकि संसोधन से पूर्व उसने अपराध कर लिया था। फांसी की सज़ा संसोधन के बाद प्रकाश में आए दुष्कर्म के मामलो के लिये होगी। निष्कर्ष यही निकलता है कि पीड़िता बेबस, कानून बेबस और हम सब बेबस... दुष्कर्मियों के लिए जेल में रोटी दाल का इन्तेज़ाम करना हमारा ध्येय रह गया है। काका पठान #सासाराम #उन्नाव #आसिफा", "prasad_palli": "What about unnav", "shristi_not_shruti": "By holding placard's and politicians tweeting blank tweets you're getting nothing", "parvati_pharswan": "Thanks everyone to take a stand", "sangbawi_thatsing": "There is no hindustan only bharat or india", "asadawana": "Thank you for supporting the right cause 🙌🏽🙏🏽💯", "embak.n": "I'm proud of u", "v_shimla": "Why Religion specific agitation? What is this Hindustan, why is Bollywood dividing in tha name of religion? Why only targeting Hindu? I don't see you people taking a stand where there is other religion involved???", "umeshsharma1974": "Those rapists and killers should be strictly punished. kill such criminals", "junaid_duke": "#justice_for_Asifa", "mhfoodblogs": "Her name was Asifa", "sohrabali8": "Aapki izzat or zyada badh gai Hai...", "yasirsoomro008": "Justice for asifa from Pakistan 😢😢😢🇵🇰🇵🇰🇵🇰", "imv1jay.jain": "Holding a placard is not the solution. What action r u going to take ?", "luxebeautyca_": "What does holding a piece of paper do? ACTUALLY do SOMETHING. All you people holding a piece of paper does NOTHING.", "samul4621": "Yes she just 8 year old I pray they will go in hell and people like them will never born again in this world", "uppili": "@nakshathra.nagesh", "aradhana_nevea_murarka": "Agar ye sb karne ki bajahe sadko pe utar krr support kro to use wakai me justice mill jaye", "kareena9724": "🙏🙏🙏", "i.n.t.a.k.h.a.b": "👍 👍 👍 👍 👍", "kevalbhavshar": "Agree", "sofhia_kaka": "Respect for all THE celebrities who are taking a stand👍", "andrewezrarobert": "#JusticeForOurChild", "ssaket111": "Guys visit my profile and read the post and share . Do not won't to be negative ..if you are really peace maker. But I know you will not do it. Co you all are fake. @reallyswara", "kareenakapoorupdates": "Thats our idol ❤", "xylem_phloem1": "Kareena 😍", "bhumika.in.a.role": "I'm surprised to see Kareena speak up on an actual relevant issue for the first time. However, it's appreciated.", "behram_khan_sanzer": "I can't believe that a human being can do a shameful act like this but now I believe that they are not a humans.i am a ashamed as a human being and as a man.plz for forgive us #Asifa 🙏🙏 #JusticeforAsifa", "bharadwaj.karan": "This celebrity brain 🧠 is tv 📺 no idea about real world", "l996l_": "🙏😔❤", "mubaraka_isah": "Yes. Even Nigerian are on your side justice most be serve @reallyswara @sonamkapoor", "hemantshrm7": "Nt true", "voguishtraveller": "We gotta fight for it 💪🏼"}