{"cleopatraalfassa": "GORRRR..GEOUS 💚", "anmolbembalgi": "Ur performance is outstanding loved ur character beautiful played @reallyswara", "_ravinder._.singh_": "Nice", "ankitarnav": "Mind your business all of you.. because swara ko aap logo ke comments ki zarurat nahi h.. idiots @reallyswara", "prapti_3232": "U r the best love u man it need gutts to play these types of roles man hatts off to u...... Love u from bottom of my heart... 💋💋💋💋💋", "kritisinghrajput": "I love this movie😘😘💕", "pankaj.bhati.982": "I really impressed with your roll.. Superb acting.. That's reality of people in modern generation.. But no one have dare to accept this.. Then people have no right to comments badly on u.. Cos u did your job only.. Love u Mem.. You are awesome..", "swara.bhasker": "❤❤", "t.a.n.y.a.rajput": "You deserve this praise ♥️", "itsmejoshii": "Swara don't worry great job...let them bark...u were great.... proud of u...it was an act", "_mashaaalaziz": "HAHA. Love from where ma'am?😑😑", "nandisayami": "U r a fake feminist..👎👎👎👎", "_miss_belieber_13_": "Hello ma'am mera name Dhwani Soni hai mai Ahemdabad se hu....mai aapki movie veere di wedding ka 2 months se wait kar rahi thi but jab mai tickets lene gai tab mujhe kaha ki yeh movie 18 years se upar ke log hi dekh sakte hai.....mai 13 years ki hu....aur mai aapki bahut badi fan hu....what can I do ma'am", "xoxo_gauri_6": "U r looking too Hot in this song", "thisismeenal": "you were excelllent in the moviee ♥️", "iam_mzm": "Too luvly gal", "ruchika_111": "You were awesome in VDW.. I fact you took the limelight, I have been raving about your acting.. you were distinct and better than lead actresses in every way.. good job 👏🏻", "priyanka_walke": "You were amazing mam...❤", "manuksaini": "I just watched veere di wedding yesterday. And I must say ur role was the toughest one to play but you did an amazing job!!! And it was my favourite!! One of the best movies!!! I hope there’s more parts to this movie in the future 😍😍😍", "peppy_covers": "Keep going swag 😍", "jsonar95": "I just love ur role @reallyswara ...", "anjalimulik22": "Love u swara maam u the the bestest infinity stay blessed and u will have a great futuer", "bad._.g4l": "U were the best in all😍😍😍😍😍", "rabiha.s_10897": "Ugly hypocritical piece of shit and a 2 faced petsonality. You are nothing but a failed person @reallyswara", "mahroshnawaz": "Failed actress. Ghatiya aurat", "tasnimmmmm.11": "You may look ‘pretty’ under all that make up on, but deep down you’re an ugly attention seeking hypocrite. You need to do a public apology.", "hashirali31": "@reallyswara shame on you it is not lie....I swear when you say I like lahore Pakistan I am proud of my country and also loved your country and I all time thought yr Pakistan😍 bht acha hai our india our Pakistan ke darmiyan ache relations hojaye.@divamagazinepakistan@hellopakistan ..😔.but when you go back in india and say Pakistan is failing state i swear I hated you and also india and ap kis aukat se kehte hai ke Pakistan failing state ap apne pe jhank kar dekhe ke ap kon hai aik wo jo all time Pakistan ki destroyed ke baray mein sochte hai .......shame on youuuu @reallyswara...", "love_neheart_vrushali": "Ap chaa gye ho di", "monnnaaayy": "failing human being", "hurrainfatima2002": "You are not deserve to women first respect all womens then come on public you are hypocrite person prpud that your film has been baneed in pakistan shame on youuuuuu", "parizehsultan2018": "Ek film kya kar li asman meh udh rahi hai. Sorry to say but India isn't exactly a clean state! Then again a low class actress like yourself doesn't even spare her own people with her stupidity - think you spent too much time with Kareena and Sonam fuckin bimbos n all", "nehl_mirza": "Sali ghatia tu tri film b ghatia h", "nh.kay": "Dumb fuckin bitchhh", "harshsuthar_": "#iamashamed for the film #vdwedding", "aneesashaheeen": "She’s so HUNGRY FOR ATTENTION AND LIMELIGHT @sonamkapoor @therealkarismakapoor", "haju_malik": "Ur just a piece of shit girl and the comments u passed on Pakistan u should k ke this that ur just a fuckin randi", "ahmadiftikhar12": "When yu come Pakistan again", "sophia_sarfraz": "We, Pakistanis, were thinking of watching the movie only because of Kareena kapoor. Now we will NEVER EVER WATCH IT IN A MILLION YEARS because of YOU and your ignorant comments.", "mahum_rashid14": "Shame on u never call my country bad oky i will not tolerate if u are actress be for urself oky otherwise i will break ur finger it will not be able to raise up for 🇵🇰", "oshin.b1011": "U were dhamaka 🤟🏻loved ur roll", "majidrizvi12": "I usually don’t comment as I am sure you’d won’t even read this . But dragging Pakistan is beyond my imagination . I guess first you need to make your country better first .Nor so long ago there were riots in India regarding the realise of the movie ! Where was the secular India then ? Pls you’re an actor you shouldn’t be talking like this and respect other countries", "madeeha_saifuddin": "Bakwas movie", "harpreet_kaur_2807": "I watched u throughout the movie... outstanding talent", "malik.f": "@reallyswara First Congrats for your movie. Second, Who the heck think you are to call Pakistan as a Failure state? You should remind your time when you came to Pakistan and then think what you said; You have no right to call any Country a Failure state or any other bad things. Your words told us Why the Government Of Pakistan Banned your Movie #shameonyou", "saboor.naveed": "You are full of bullshit ✋ U loudmouth failing bitch✋", "whisper.words": "a flop movie and you acted as flop actor.yeah you only got chance to work with such bollywood famed actresses and you showed your real character and colors.who the hell you are talking about pakistan its tha country of people who lived with courage and under any situations.we banned that movie because its against our culture to show such shameful things and so called demoralizing things.and you know what you actually did you are girl and you proved from where you belonged from country where girls get raped and tortured.Also please focus on toilets where you can shit instead of media 🙏 Stay in your limits", "papiyachakrabarty": "Loved your performance ♥️", "heythereurja": "You rocked the movie❤️❤️❤️❤️ Legit saved the movie!!!! You got balls gurl!!😘", "omarmaliha": "When u are a B grade actress then u need to say this kind of crap to get attention ....madam also seems to have an amnesia problem!", "yammi_786": "Swara apko yad dilati chalu ke Pakistan ek tehzib Wala mulk hai apko Pakistanis ne hi izat di thi but afsos", "sunilgarg24": "Super performance by u.", "tiaraspark": "Itni himat bhi rekho suny ki JAB BOL SEKTI HO TO", "_aimannasir_": "Flop actress @reallyswara", "arshqmr": "@rheakapoor @sonamkapoor yaar thori tameez tou daini thee isay khali acchi film glam outfits Dai diye aur ethics class nai sikhaae is kaam waali baaee kou so trash nikal raha hay is Kay moo say Pakistan 🇵🇰 Kay liye .aik hi tou glam film mili hay is Kay baad tou INSHALLAH QAYAMAT TUK YA NAWAZUDIN KI MAA KA ROLE YA PHIR IRFAN KHAN KI MAA BUN JAAYE GI AISAY ROLES MILAY GAI POOR @reallyswara baita izzat hazam nai hou rahi .jub Pakistan aaee tou kya bakwas kur rahi thee Lahore Kay aagay Paris London sub bekaar hay moron double standard", "born_in_90s_gm": "@reallyswara di .... You just nailed the role of Sakshi Soni in the movie.... You are my favorite character in the movie among all 4... Especially when you shut the mouth of those three aunties at the end ... whole movie hall clapped at that scene .... Love you di😘", "momiinailyas": "a failing humanbeing! @reallyswara", "laibaayaz_": "Loser! 😏", "amberkhan": "#Racist", "desifoodaholic1": "Kareena and sonam got cror for their role. What you got a bra and penty?", "_ajak13": "LOST ALL RESPECT FOR YOUU.. #failedactress", "bhawna_chaddha_": "Stop commneting guys its just a roll had h bakchodi ki bhi", "_sho_urya": "You r too gud", "kunal_kamra3739": "Paise k lye kuch b", "ishuhot": "Everyone hates you bitch @reallyswara", "hiba_serwar": "Failed actress who can only get attention by mentioning Pakistan 🇵🇰.. #pakistanzindabad", "maryumxhan": "Bharr main jv", "kurkuray12345": "@reallyswara you haram ki boti", "tanvi_2410": "you were really fantastic in the movie mam...u ruled the screen..loved watching you", "alisha_rao_2337": "💯", "ashika_amit": "U nailed it👏👏", "sammar_malik222": "publicity ke liye kya kya karegi ugly", "sonalisuthar_": "My favourite character....star of the film👍", "vikas_singh_jamwal": "Gofilms.net watch veere di wedding in 720p dont waste ur hard earned money in theatres for this third class movie #SheDefamedMyDevsthan", "desigirl9092": "Just because your nation has forgotten its true cultural values and started chaatna-ing 👅 goras chuttar doesn’t mean a country trying to protect its values is a failing nation . Your movie is not teaching women empowerment, it’s teaching girls how to assimilate into western culture . True empowerment for women would be a movie that shows intelligence of women and how that makes women rise not a movie about 4 hores taking on India . Further sexualizing women with the vulgar dressing . Swearing thinking that is what women empowerment is . #lanathaitujpe🖐🏽 and #lanathaiterikaumpe🖐🏽", "beingkuku_1815": "@reallyswara the character sakshi has gone straight into my heart.. ur acting, the clothes u wore is impeccable.. i love you and will love the sakshi u introduced me to for ever. awsome movie.. awsome you 😍🤗❤️", "aaroshithapa": "She is love and became My new favourite in bollywood town 🌼💚 @reallyswara", "samiksha.koul_art": "You were brilliant in this movie ❤️", "iminahil9661": "Hate you! After that shitter statement!", "monu_kumar1134": "Congratulations", "pink.bling.official": "U r sick disgusting", "shirley_tedy": "❤❤", "abeer.farooqi": "You actually do deserve all this hate", "momana_azhar": "Hypocrite shitty face", "krkeer": "Worst pathetic movie...i think these are all paid reviews totally wasted my money and tym", "roy_the_learner": "you are love ma'am! @reallyswara ❤", "_salwayyy": "🖕🖕🖕🖕", "genie_qureshi": "Kutti", "sashajolie15_": "You rocked it so well. I felt like you were just being yourself. I felt like this movie is a vlog instead of a Bollywood movie. ... keep it up Swara. Love you ❤️😘😍", "thevartikasoni": "#hatersgonnahate I definitely agree with what you said. Pakistan just have to ban all the women centric movies. And to all the indians here please stop supporting to all those who are just calling her sluts for supporting their country. You just show some respect towards your country also like they are showing. Atleast have some unity guys like they have.", "saba_randhawa12": "Shame on u @reallyswara Bechre new new paisa dekh k pagl hogae h", "dr.bismailyas": "Shame on you", "sobiaahmedox": "I actually feel very sorry for you- in fact I pity you. I pity you for how deluded you are! I pity you for all the mass amount of respect you have lost now and how shiitty you must be feeling and you deserve to be feeling that way! You took things out of perspective and made your self look like a lunatic and you spoke sooo many lies. “Failing state”????!!!! I live in the UK and every single day when I go online to see the news I see India- Rape, Abduction etc.. every single day!!! You need to take a good look at your own country and yourself first!! Get a grip of yourself woman!! True actresses don’t respond to questions in the manner in which you did- because they love and value all their fans, you have a long way to go and a lot to learn.", "ririxciv2": "U ain’t shit b go learn some respect", "khanhunaina": "I'm pretty sure you've choosen to ignore all the hatred coming your way to appreciate the praises your movie is getting but i'll leave my two cents on this hoopla that you have caused. YOU clearly are delusional, you probably want to show off in front of the main leads of the movie even if it's a so called all leading lady cast ...we all know where you stand and who the leads are. You tried too hard and managed to achieve the little publicity you had planned on achieving through this stunt of yours. I'm sure you think you are a pretty big shot after stating these things on international media and getting the cheap fame that you have gotten but let me remind you...you have proven not to us but to even the people sitting on that round table what big of a bigot you are. I'm really not going to defend my country against what you said..know why??? Because I don't have to. No need to prove it to someone so worthless.", "sav__95": "Shame on you Swara for speaking in that manner for Pakistan!", "madi.offishal": "Swara the Bastard", "hibbanoor": "So funny how you get 15 seconds of fame and you’ve lost your mind. Let’s not forget that up until this movie no one even knew who you were @umarfar @thenidaali.", "hellllloooo_princess": "get lost", "amitsinghlive": "The best thing we do avoid this type of movies is report it. Whenever song or trailer of any movie looks shit to me then I report it.", "freedomofspeech4us": "I was contemplating watching your movie but after your comment no thanx!!!! Lost all respect for you how can a woman be so too faced... who even asked for your opinion on Pakistan or for your judgment... such a loser!", "_fizzarizvi": "I love Pakistan for taking this decision, I am really happy to hear this news.", "faazla_saeed": "How much did you pay them ?", "eiroon_meean": "@reallyswara take a look at your own country and your own self before you talk about someone else’s. Your the failed actress who has to sleep around just to get a role!", "kylie_vibes_23": "Don't go talking shit about such an amazing country like PAKISTAN don't forget that same country gave you soo much respect that you didn't even deserve", "queenmydishesplz11": "@reallyswara is the Lena Dunham of Bollywood. Lackluster and unpleasant looking creature who is desperate for attention and validation and tries to get away with t under the guise of feminism.", "nashmiyaaa": "What love ? #cunt #bitch", "mmffbuzz": "We would stop posting ur comment from next time if u have such ppl in ur camp @therealkareenakapoor @sonamkapoor . We opposed the ba n of ur movie but this lady has made us understand that she and her shit should be banned in Pakistan and If u or even @beingsalmankhan will keep her in their movies we will not watch them .", "mariumkhalill": "People hardly know about you, so maybe failure is something that you must be familiar of as people of your own country state that as well! Only a failed actress like you can utter such words.. Go educate India where women are raped on daily basis prolly because of the filth being shown in your movies every now and then! Such a disgrace to womenhood!", "shayanasyedi": "Report her account guys", "aqsasipra": "There are only few beautiful Indian actresses", "tanz33lamalik": "Lots of hate from Pakistan #reallyswara", "anumashrafkhan1986": "Dual personality holder, jaa doob mar kahin ja kar 😆 you are a failing project of your parents 😂", "fatimazr6": "Hypie", "wania4567834": "You definitely are a failing actress.Don't know about Pakistan.so offended...", "imariam_imran": "You hypocrites 😈😈😈😈", "minaal_saleem": "Your gonna end in hell. You dont deserve what you have because you really dont know how to you the voice you have been given to do anything good in this world. Maybe you cant see now but at some point you Will, nothing lasts forever and Then there Will be only guild back, and you Will not be avle to do anything then. You surely have failed. May no one learn from you", "daffodilss_": "Flop actress saari zindagi side roles he milein gay tumhay @sonamkapoor ne dosti ki Khatir tumhay ek role kya day diya khud ko Madonna samajhnay lagg gai ho? 😂 tumharay kehnay say hum failing state bann nahi jayen gay magar tum aur fail Zuroor ho jao gi. Oh sorry, fail honay kay liye bhi koi career chahiye hota hai tumharay paas films he kitni hain? Lol 💩 khao 😂😂😂", "blogsbykomalfaizan": "Well played . Just when we thought you were one of the very very very few of people who actually love Pakistan and Pakistanis and showed immense respect like Sir Om puri, but boy were we wrong or what ? ... Anyways congratulations on being a true Indian though and also continuing the hypocrisy trend. Shows the true side. #hipocrisygamestronggirl And also before saying such things be thankful that this *failed state* has bathrooms to flush your dump and your shiity thinking . PAKISTAN ZINDABAD.", "__nim__ra__": "Bye bitch 👋🏼 no one even will give a damn about u when this movie finishes ! C grade actress opening her filthy mouth with hate comments !!! People like you should really follow if you have nothing good to say keep ur trap SHUT bitch !", "ggzehra": "YOU LOSER!!!!", "waqas895": "You are a hypocrite. #bloodyIndian", "n4dia.elahi": "I ain't watching this Dumb ass self contradictory double faced morons movie .. although I absolutely Love kareena and sonam .. and was waiting for this movie for so long . But @reallyswara this is how u repay immense hospitality and love we showered you with.. ? Educate yourself about sharia law and look at your co stars..kareena is a Brand ambassador for Faraz Manans clothing for years..and comes to pak to model for him never have I heard her say a foul word about pak .. and ure not even famous ure a No1 YET and u talk such volumes that too lies.. seriously ure such a disgrace to women ure working with.", "nehaxchand": "❤️❤️", "haneefshaik00": "As a fellow Indian, All I can do is suggesting u to learn some ethics...U were there in their country and praised them and now spitting venom...!!! Apologizing on her behalf...My dear Pakistani friends,don't even consider her...She DO Not represent India and we definitely don't think about Pakistan the way she thinks....!!!!", "ayeshaa.zubair": "Yar abi tk kia hi kya ha tm ne jo khud ko itnaaa mahan smjny lg gai ho ak 2 kori ki actress ho koi tmy mun b ni lgata ziada logun ko tmra pta b ni mjy tmra pta chala is movie ki wja sy wo kareena k sath thi is liye warna lanat b na bejy koi tm pe acha hua ban ho gai movie tmri manhus sari hui shakal ni dekhni pary ge", "sarah.masood90": "The one who is the most vulgar is counted as the most talented in india.I was not in a mood of watching this movie from the very begining and I asked my friends too that not to watch indian stuff.But now after your filthy comments about pakistan has refrained them from watching it too.", "spowpowspw": "PAKISTAN ZINDABAD", "saragullzaib": "@reallyswara i am Really happy that ur shit has banned in pakistan, failing state me movie ban honay pe itna ghusa lol get a life u failure 💩", "madeehaakram": "Swara has got the scene which no top actresses would agree to do in her senses. She got it because she's struggling! 😂", "haffsaah": "“Failing state”? That way, India has already failed for banning Padmavat 😂 #PoorActress #FailingSwara", "mohammad912ali": "You usually is bitch talking about Pakistan you whore", "vareesham": "Wow “failed city” I didn’t expect that from a fail actress like u 🤷‍♀️", "munirakasamali": "You were simply amazing in the movie!", "vishu__waghmare": "Ur fav character in movie totally nail the role", "khangurl94": "@reallyswara I watched today only vth my veere's ..n U veere's rocked it..love the movie , n ur's acting toh 🔥👌❤😘", "snehasingh3451": "Yaar tune to kamal kar diya mst acting puri film me sirf tu hi tu chhayi rahi sub fail kar gaye tere aage love u", "preety__": "Your acting 😘✌️✌️.. U nailed it Veere @reallyswara ❣️", "mehwish.tf": "@reallyswara I think u really don't know how to behave like an educated Indian u failed as a human being who act childish just to seek attention n ur film got banned for what ever reason get a life n focus on ur acting skills instead of seeking attention n act like a loser", "zarmeen.alishba": "Pakistan is a FAILED state, not a failing state. It failed a very, very long time ago. You were obviously right. Unlike all the other Pakistanis commenting here being emotional idiots, I’m a Pakistani who refuses to be blinded by dumb emotions like patriotism. Partially the reason Pakistan is a failed state is because of people who are swearing at you and being ostriches. You’re 💯! Keep keeping it real 💋", "rjaa.92": "Your country bans our respected actors and if we ban your cheap movie you call us a failing state ? Yes its ban because we Pakistanis cant go with family to watch your movie oh that makes you a failing woman right ?", "dr.sannodia_khan": "Unveiled*", "maryamadeel": "@reallyswara u call pakistan A Failing state, infact ur a failed Actress!", "irfan_rubia": "Ab pakistan soch samajh k ana", "anon.9889": "@reallyswara u extras....!! in movie 😂", "thefernwehselee": "The 3rd comment in the pic is so true !! No one could have it better than Swara !! Justyou", "_hxn_n": "No encouragement for you get your facts straight!! Get that strap!!", "_aa1ia": "Definitely not watching this movie anymore since you’re such a racist bitch", "ibnehussain_sherazi": "Such a two face bloody bitch who doesn’t know anything what to say & what she previously said when she visited Pakistan 🇵🇰 in past. #bloodyhypocrite", "ch_illl": "Idiot bhudi behn g", "marwabaig": "Not ur fan anymore 👎🏼", "prashansa_bisht": "The best part about the movie is swara❤❤❤❤", "shehwari": "🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰", "yash_mehta__": "😍😍😍😍", "movieliness28": "This is not a girl power! By calling someone’s country a ‘failing state’. Get some knowledge keh agar hum Pakistanis so called Indian actors ke movies na dekhe toh movies hit kasee ho ge. Get some respect girl. You’re such a statement changer. Pakistanis kase se Kam nahi hai. #pakistan🇵🇰❤️", "zynat1965": "You’re a failed actress!!! Always were and always will be 🤣🤣🤣🤣🤣", "arooj4404": "Drama Baaaz @swara", "coffeezara": "You wrote an open letter to Bhansali after padmavaat but what about the pathetic and cheap role you yourself have done in veere de wedding?? You cheap filthy woman!", "nazz031": "Im not going to watch this movie. You guys have no idea how happy I was to see a female all cast. I was like ‘yes, the future is changing for women’ I was listening to the songs daily. Enjoying and counting days until I can watch it. But even though the other three had nothing to do with it. I will not watch it. It’s funny how you call Pakistan non secular yet in India you can’t even get justice for a 8 year old girl raped in broad daylight. Sharam tujhe ani chai hai behen. People with glass castles don’t throw stones at others.", "hoorii._": "🐍 🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍", "amsihoney": "🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍", "lord_srikanta": "Swara ji..bus ek hi kahawat yaad aa rahi hai is waqt~ apko yo apno ne loota, gairo Mei kaha dum tha... Apki to naiyya v waha doobi, jaha paani Kam tha😂😂😂", "sfmash101": "Fuck u failing actresses @reallyswara #banswara", "emann_122": "She’s a no body in the movie so her comment about Pakistan means nothing", "samaa_khan1": "Ha hi tu isi kabil ka zalil ho kutto ki tara . Tit for tat", "bandhu_madhavi3007": "You were the best in the movie.. 😘😘", "sanaraza273": "U jelouse.... No country be like Pakistan... Our lslam don't allow to watch like this bad movies.. It not our stand movie.... U guys r lose character who can't do nothing except talk bullshit... We known what is u stand Don,t show us..... U blood blaster.. When u were born ten devil have die...", "zyrah_creationz": "ARE YOU SERIOUS YOU CALLED PAKISTAN A FAILING STATE YOU DUMBO... SOMEWHERE IN 2015 U CALLED PAKISTAN THE BEST COUNTRY U VISITED AND NOW THIS. LEARN TO STICK BY YOUR WORDS... AND ALHUMDULILLAH PAKISTAN IS DOING WELL U BETTER NOT GIVE THIS TYPE OF SHITTY REMARKS AGAIN😡😡😡", "iqra._.2": "You are such a failed human being. Shame onyiu for your pathetic language and existence. I just wanted to remind you that you are also living in a country where they ban their own movies eg padmavat. GET A LIFE, GET YOUR FACTS RIGHT. 99.9% people here in Pakistan don't even know your name. Last, you are that abnoxious piece of shit who back in 2015 , refferef Pakistan as a best country you have visited ever. Stay on one statement at least. Bye from your neighbor.", "13shhhhhhhhhhhhhhhhhhhhhh": "I hope NO Pakistani watches this movie or support Bollywood.", "sanafwahid": "I actually don't knw who this side actress is ..???", "twogirlsinthecityoflight_": "In 2015 she mentioning pakistan as the best and the loving country and the next years she says pakistan a failing state lol Double standards of sawara", "yumna_hassan80": "@eza.s I don't regret a single word I said. Next time she'll think twice before barking. Talent appreciate ker rai thee, uss say bara fankaar hai kon? I was also appreciating that midget's talent ,wasn't getting personal.", "bushrabushiii": "U bitch ek movie se aukaat bhool gai hy", "mayaobroi3011": "Mastubrate scene aap se kbhi yeh umeed nhi thi👎👎👎👎", "i_fiaa": "Piece of shit", "allymcd55": "You’re such a big fat fucking cunt. Im not even from Pakistan but still think you’re such a fucking waste of space. Like suck that fat stomach of yours inside that’s always protruding and looks so terribly disgusting and shove your opinion up your disgusting ass. You fat fuck. Nobody likes you anymore you’re so trashy and have no class whatsoever. No one looked at u in the movie it was only Sonam and Kareena that are responsible for the film getting any success. So go fuck yourself please.", "shweta_maanju": "You were incredible 😍😍", "atiya_ahmad": "@reallyswara 👎💩💩👎👎", "abhilashasen0505": "We love u swara wht a performance yar fida ho gye hum to @reallyswara", "mehru23": "YOU ARE A FAILED ACTRESS.", "rabiabutt___": "#failinghumanbeing", "rajpootfaiqa": "@reallyswara before ur so cold statement I am very up set on veere di wedding banned in Pakistan but now after ur bhakwass I am happy ka #veerediwedding banned in Pakistan", "_batoolfa_": "Failed attempt to make cool movies like hollywood. No one really encouraged you here. Bloody attention seeker! A cheap actress with double standards! @reallyswara", "beingleena64": "Swara you were amazing in veera di wedding", "alizeahjs": "As bummed as we were about this movie’s ban, I’m actually grateful we don’t have to see a failed actress like you on the big screen. What a waste of 700 rupees it would have been! #dumbbitch #hypocrite #pakistanzindabad 🇵🇰", "duamubashir": "Pakistan is not a failing state but you sure are a failing actress", "hasanmuhammadsidd": "Sorry to say but you are a CHUTIYA ❤ love from Pakistan beb ❤", "munira_rj257": "Its an awesome movie.👌👌👌 ....u nailed it💃💃 @reallyswara", "ikraxbux": "👎👎👎👎👎👎", "b.ts89": "I feel sorry for you ☺️ May bagwan give you som boddi in your mind and you should think before you talk absolutely nonsense. Pakistan zindabad 🇵🇰", "x_momina": "Even people from India don't rate you #removeyourself", "fat.shariq": "B class actress", "kanza993": "Hayeee such a maili maasi", "areesha_mustafa": "Failed fucking looser👎👎👎", "patelketan99247": "Hi", "hinaazehra": "Koji tareeen lg re pori movie ma", "azka.abbasi": "@hana_salmann more like \"the star of hell is swara\"", "sheherb": "@reallyswara first of all this movie got hit because of Kareena kapoor and sonam kapoor so please come out of that denial you #fiexiegirl ... Secondly let’s go back to your past then if u remember this so called #failingstate was a place where u felt protect, secure and happy. So for sure Pakistan is not a failing state infact you are a #Failingperson!! P.s: please change ur name from Reallyswara to #FailingSwara", "tabasum.saiqa": "#racist", "faaaarri": "O SAWERA BASKAR 😂😂😂😂😂😂", "ummamamahmood": "🐍🐍🐍🐍", "musaba18": "I live in Canada and honest I was going to watch this movie along with my friends not because of her but because of Sonam and Kareena, I didnt even know who the hell is this ugly pussy face slut,and since she spited out shitttt about Pakistan , to hell with this movie we r not going, bitch Pakistan is not a failing state You r a failing actress, aik side role kia mil gya apni auqaat bhool gai.", "mukti.gala": "u killed it swara..u hv acted toooo goood", "katrin10.28": "I loved you before your statement about Pakistan. How can you be so disrespectful towards an entire nation? Don't think I will ever watch any of your movie again and I'm not a Pakistani @reallyswara", "hhssvvvvvv": "Show some respect to people, so that they can show respect to you. You’re not worthy of any kind of respect!", "india_insta_1947": "All these pakis saying pak is not a failed state but they don't know there country is gone bankrupt years ago", "ismabid_": "Im sure you are not a main lead cause its kareena & sonam so better calm down girl ! You are not even shown much ! Oh may be you are the one who failed ! Classless", "usamaislam99": "Piece of shit @reallyswara", "monshad_mylove": "Bitch 🖕🖕🖕🖕", "reema.alis": "I’m glad your movie is banned in Pakistan!", "saraism_ch": "Where is those fans she’s saying thanks too 🧐🧐🔍🔎🔍🔎", "kryshnaa__": "True true true♥️♥️", "shizaamjad": "🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍🐍", "amnaamiiamz": "Thank you for all the encouragement you just gave to every Pakistani out there!!!!! Bigoted moron 🙄", "chitz_13": "I loved you the most in this movie....😍😍😍😍. u nailed it.. and your dialog deliveries were hilariously awesome 😃😃😃😃", "_syeda06": "gurl ican say that you are going to flop soooon", "aras.atif": "@reallyswara In your interview in 2015 u refered Pakistan as the most welcoming and generous country in the world and now u see Pakistan as failing country.its because at that time u was a failing struggling attention seeking actress.and when u did a film with some famous names, your views are changed.its a publicity stunt or hypocrisy to gain the attention of your hypocrite media.first worry about your so called diplomatic rapist intolerant country then say these kinds of bullshits for us.rot in hell", "__unsi.raza": "The flim is not about you deAr the real actress is sonam nd kareena not u ugly", "rizwan_bhai1973": "Attention... Attention this what she needs for her movie why you guys are giving her instead give her jotti 🕺or jogger whatever 😂", "ersakhan1863": "Such a flop actress 😈", "__batman__07": "kdk", "mubaziralikhan_official": "I wanna tAlk with yu personally in Ib plzzz Ans me !!", "bharat5811": "#veerediwedding pakistan ne is movie ko band kar ke ye sabit kar diya ki ye pakistani movie he or tum ne ye sabit kar diya ki Tum hindustan I nahi ho to aap dono ek jese ho ho", "sahar.naqvii": "What a failing actress..Bitch", "maryam.irfan._": "Bitch.", "sabiyamehra": "You rocked!!!!!", "featuredbyfareeha": "Been to london paris newyork, lahore is the best. Lmao", "_hajrah__": "Well after speaking shit about Pakistan!! Let me tell you what your own country has done with PADMAVAT... Such a pathetic lady you are.. Speaking shit about others country doesn't make your better.. #pathetic_lady #shit", "iamjsenghera": "@reallyswara you were absolutely brilliant! I loved every bit of your character... very unapologetic! Very sass! Every bit woman! Thank you and congratulations on VDW! #vereediwedding🎬 #notachickflick #breakingboundaries #iamwoman", "rida.abbasss": "Flop actress!", "aqsa_43": "Loosers actress u should be shamefull for ur recent comment about pakistan", "rashmi764": "I liked ur role in d movie...earlier i used to like ur acting...bt nw em loving it😘 Ur movie rocks man...i live in bellevue...whole theatre was blocked with indians today...😬👍", "arfa_rana": "Aao na kabhi khushbu laga kar 🤣 btayen gy failed state kis ko kehte hain ! Shame on u", "hafsakhan31200": "Bitch na hoto hai kya tu Jo Pakistan ko bura boly ge ek film kya mil gai Hawa Mai urny lgi fail to Teri film honge ab", "fatimahabib14": "@zahraraza1 please speak for yourself", "hpsheikh": "Swara who?", "tooba_chatha": "Flop actor 🙄", "aleenadar": "Very disappointed by your recent views about Pakistan 🇵🇰", "abhimanyurabra": "You were out standing in your role", "dandelion_bysonia": "Follow for handmade lanyards 🌸 keyrings 🌸 and nametags 🌸 all COMING SOON!! 💫😎@dandelion_bysonia", "urmil14": "ऐसी ज़हर मूवी बना कर् thankyou बोलती हो by god पैसे वापिस करो सब के", "choreographer_k.c": "Acting was damn good as always. And I'm a fan... but you all were not looking 25 or 27 years old. Accept sonam. You and Kareena were looking above 30 in sorry for being so straight...", "nainatariq123": "Bitch", "marjanahmad": "Nothing can be done about petty minded people. They’ll just find reasons to keep on barking.", "manumpinum": "It's people like you that the world is becoming a shit place full of hatred and inhumanity. You just added to the negativity and bad vibes. Thanks for your contribution 💔", "seerataly": "@maryam_rizvi after i read her comments on Pakistan.. i came to check out who this \"Newbie\" is.. Lol😂 I could only see was some pathetic loser here.. i wasted my 5 minutes..!!", "nimra.bilal": "Bluh", "misha._.singh": "Jhoot bol rahy hain sab ky sab !! 😂", "nishant_kumar_ojha_": "I hope you got the taste of your own medicine @reallyswara 🤣.First you praise Pakistan and talk shit about India and then bash Pakistan..what is actually wrong with you SUARA? saste nashe mat kiya kar!! 🤣", "yusra.rehman88": "Whoz she?Flop failed actress 😂😂😂", "sawantprasad761": "Lovely", "hariskhanmarwatt": "shame on you!!! I was very fond of your acting and you but now you have disappointed me.From now I HATE you.", "sizzling_supii07": "I liked ur role in this movie ❤️👍🤗", "muqaddas_chattha": "A stupid hypocrite you're!", "iamridaay": "You're a failed actress actually", "adeel.khalid": "shame on you", "izaan_the_maniac": "🐍🐍🐍", "mariammalik__": "Can someone tell her shes a failed actress 😴", "sheri.1717": "Failed fucking actress @reallyswara happy that movie got banned in pakistan", "maryys20": "Everyone's already said it, but you need to know from every single Pakistani that you've lost the biggest fan following from the country that you once thought has the best city in the world. You have already been informed what Pakistan really is and it is the complete opposite of what you think it is. We were all rooting for you guys and for the movie, but not anymore, so glad it is banned.", "irabiabutt": "achaaa hua pakistan may teri ghatia 3rd class movie ban hogai.. Sluts bn k usko bold larki keh dia.. aesi hti bold girls? 3rd class movie. bloody 2 face witch.. too much flop u!! 💩", "aimanali375": "@reallyswara looser👎", "maviaabbasi": "Pakistan is and was never a failing state but dear @ReallySwara just for a movie you have declared us so,please recall your statments about Pakistan which you made while you visited our country.Banning your movie was our #CensorBoard decision not by the people #stopthishatered Never accepted this from you I am also against the ban of your movie and I was eagerly waiting for its release here but just due to this you can't do this to us Mam", "hassanrk": "Hi stupid. Do you realize that pakistani content isnt allowed in India. Our players not allowed in your league. Who is more secular. Get your facts straight", "navnaveet": "You was awesome in the movie ✌🏻❤️", "hottest_pakistaniss": "Double standards", "monatariq12": "Failed actress", "____ali_akbar____": "@reallyswara mam u juz stole the show..u were brilliant u always choose bold characters..but it was boldest of all..nd m still laughing at ur punches u nd @shikhatalsania were amazing at punches..", "eshalz": "I was going to watch this movie but no way in hell I have my support for an ignorant person like you!!! You will never be successful with such nasty attitude", "osamaali94": "dual personality", "_itzaleena": "Everyone hates you now , congrats", "kiran_503": "#sastishuhrat", "aryan_suranii": "Flop actress", "mehtabmoghees": "Yes we were so excited for the movie thankyou for Ur bull shit interview and making ourselves feeling proud of our country ... Pakistan Zindabad", "hifza786": "C grade actor", "sachdeva9441": "You were so bad in the movie atleast have some shame. Do you think smoking and drinking can resolve your problem of marriage and the problem you showed in the movie even not clear also to make you alcoholic or absurd you were so cheap in the movie and pathetic movie wasted a good opportunity", "yogawithsnobee": "Loser!", "thanos_from_titan": "Hey chameleon", "mubashra_syed": "Failed state or failed actress ?😂😂😂 i didn't even know she is in vdw 😂😂😂 hats off to attention seeker 👏", "mishamzainab23": "@reallyswara is every bastard in Bollywood uneducated and pathetic like you ???", "malaika_bilal6": "How dare you saying Pakistan a failing state😠😠😠", "trivedizalak": "U were rocking and have killed it in the movie 😍💃🥂", "humairakhan7789": "The best role in whole movie :*", "unwaveringfaith_19": "Love u swara ma'am", "khemeshwari_nag": "Ur rock this movie @reallyswara 😘😘😘😘", "ceerat_aijaz": "Lant ho tmpe u have a failing mind set u ugly face -_- aaaty hi hatred pheela rahi ho tujhe dekhta kon he aaam ki ghutli ki trh -_- #Proudtobepakistani #Banreallyswara #swarabhaskarbaskardo #banveerydiwedding", "saurabh_ki_anu": "Yesterday I went to watch VDW with my husband & 2 guy friends,& we all loved loved loved the movie!!! Kudos @rheakapoor @ektaravikapoor @sonamkapoor @reallyswara @shikhatalsania #kareenkapoorkhan❤️", "nehaanaeem": "You call Pakistan a failing state? Well I suggest you get your facts straight lady! Pakistan Is The 6Th Largest Nation In The World Containing One Of The Oldest Civilizations In History (Mehrgarh, On The Kachi Plain Of Balochistan, Dates Back To 6000 BC And One Of The Earliest Known Farming Villages Of Indus Valley Pakistan) Pakistan Holds 4 Out Of The Top 14 Highest Peaks In The World; K2 Is The 2nd Highest Mountain In The World. Pakistan Has World’s Largest Irrigation System I.e. 3 Times Bigger Than Russia’s Canal System Even Though Pakistan Is At Least 10 Times Smaller Than Russia. Pakistan National Anthem Tune Ranks 1St In Top 3 Tunes Of The World And 1St In The World’s National Anthem. Pakistan Has The World’s Highest Paved International Road – The Karakoram Highway, Which Is Said To Be The 8Th Wonder Of The World. Pakistan Has The 6Th Largest Armed Forces In The World And Only Nuclear Power In The Muslim World. Pakistan Is The World’s 7Th Largest Pool Of Scientists And Engineers. Pakistan Has Khewra Salt Mine, Which Is The 2nd Largest Salt Mine In The World. Pakistan Is Ranked 4Th In Terms Of Broadband Internet Growth In The World. The World’s Largest Volunteer Ambulance Service Providing Organization Operates In Pakistan That Was Founded By A. Sattar Edhi, A Social Worker Of International Fame. Pakistan Is Ranked 25Th In Terms Of Overall Agricultural Production With Chickpeas On Top,5Th In Mangoes, 6Th In Dates, 8Th In Rice,  9Th In Wheat And 10Th In Orange Production In The World. Pakistan Treasures One Of The Rare Species Of Dolphin Known As ‘Blind Dolphin’ In Waters Of Indus River, One Of The Longest Rivers In The World. Pakistan Is Making 80% Of The World’s Soccer Balls At One Of The Largest Facilities In Sports Good In Sialkot. So next time do some research before you go and talk shit about other countries! 👊🏻💥", "nayabkhan90": "LOSER", "caught_in_lies_": "Yes u did it very well I love you mam ❤❤❤❤❤❤", "drfaridahmed": "I hope her venom opens the eyes of Pakistani who think Indian entertainment people are just best. Learn to have respect. They banned our actors and we just ban their one trashy film where they wanna prove feminism by abusive language and they show their UQAT", "fabulousfary": "Pakistan 🇵🇰 is named number best tourist attractions in the 🌎! Ur country banned our actors but we still watch ur 🎥 movies- shame on ur thinking 💭 #loser", "kasish1448": "Nic", "__komalsoni": "Indeed...You were mind blowing throughout...totally loved the change. @reallyswara ✨", "arushir379": "You were the best @reallyswara 👍❤️👏🎉", "ayesha.zaheer.35": "you are a failed artist. failed actress who worked in a failed movie", "jaikishanshetty": "Very good movie your acting outstanding 👍👏👏👌👌😍", "ammney": "I live in the US and wish my racist government would ban the movie and your bigot ass. I was waiting to see the movie but now, I think I will passssss 🖕🏼you @reallyswara", "zubiachatha": "Hate hate hate so much hate for her lol🤣", "sheetalkaul": "@reallyswara u were superb in the movie. Loved ur character and u playing it !! U stole the show. Loads of love !!", "ruchika.e.n.t": "You and shikha are great in movie..", "riazamirr": "@reallyswara I was such a huge fan and admirer of your work and talent but honestly you have disappointed and hurted me along with so many Pakistani fans. Why ma'am? Why such cheap ways to gather attention and publicity. This a pure ignorance, straight up double standards and HYPOCRISY!! Ashamed on what you said and caused a stir between two nations. You should feel some what responsible and ashamed too for doing this ma'am. As a person, you should be supportive and encouraging but alas you chose hate. @sonamkapoor Fyi", "nznfrk1": "bitch", "sarveshksingh": "U r ultimate Sakshi soni", "tess_s_winx": "I saw the movie just yesterday with my cousins and YOU WERE MY FAVOURITE CHARACTER. One of my friends asked about the movie and I told her that the best thing about the movie was you and everything that is to do with you. And did not reveal anything further because she totally needs to watch you to know what your role really is... I LOVED YOU and I'm totally watching this movie again only for you.", "24.__diya": "Yeah the way she act that was fabulous ...love u mam", "sadia_khalil121": "@ReallySwara Unfollowed because people like you doesn’t desire respect but a punch in there faces , PAKISTAN IS A PHENOMENAL AND A KNOWN STATE ALL OVER THE WORLD AND CERTAINLY IT NEITHER WAS , IS AND WILL BE A FALLING STATE NOT EVEN IN A THOUSAND MILLIONS YEARS.", "daniyal_ali94": "Chutiya dalli", "_khan___zeba_": "are u there even in sonams n kareenas movie 😂😂😂shukr e khuda banned ho gyi shakal movie k pehle hi dekh li hmne 😂😂aur banned se ye b pata chl gaya k movie k saath mind b vulgure h 😒😒tmharaa", "fatiwaqas": "Shame on you flop actress", "1__bsrms": "@reallyswara #reallyswarafailedhumanbeing thank you @urwatistic !!!", "syedaasmahassan": "I was looking forward to watch your movie but Your comment about my country shows that what 3 class actor actually is", "momina_faad_": "#Dangri ki chohiya", "seeba.khan": "Flop actress 😡", "_win_your_tickets": "Hi slut", "omgsheikh": "Pakistan is a non secular state? But India can't still give justice for Asifa? We Pakistanis are governed by sharia law? Do you even what sharia is? Maybe pick up a book before spewing ignorance from your mouth. #byefelicia", "tubarana_00": "U dont have a right to call our country a failing state", "luxury__garments": "Saying shit about my country fuck you", "mqazalbash": "Pakistani maids looks better than you and speaks better than you psychotic aurat", "maha.adil": "Honey first of all no one encouraged you at all okay? @mairaadil tell her please", "sykaaali7861": "Your role is shitty in the movie anyway. I mean who is she?", "s.zahrazaidi": "Sorry krlo 😜 *else you will end up crying *☻", "amesterdoodle": "I was one of those Pakistanis that wanted to watch the movie ever since I heard about it around a year ago. I was one of those Pakistanis that resented the ban and stood up against it. I was one of those that was in complete awe of your character and your portrayal of it. I was so impressed by yours and Sonam's ideology on feminism and the entire concept behind this movie. However, you have disappointed so many of us by showing what type of a mentality you have. Its actually quite ironic considering you express yourself as such a humane person. Now let's educate you, shall we? Pakistan for starters is not under shariah law. Secondly, it is not a failing nation. It is a nation that is fighting terrorism and the wrath of extremist radicals. I think as an indian you would know what that's like. Lastly, Padmaavat got a lot of opposition in India to the point that it almost got banned and people wanted Sanjay Leela Bhansali and Deepika Padukone's heads. That does not make India altogether a regressive or \"failed\" country. It just shows that one nation has a wide range of people, some that agree with the content of your movies and some that might not :)", "faiza_javed": "Pakistan is not failing state! You are a failing actress #loser", "maria_siddique000": "@reallyswara bibi tmhe attention seeking syndrome hai ja ke apna ilaj krwao aur pehle bt krne ki tameez sekh lo phr dusre country ke bare me bhonkti rehna aur tm bhonkny ke ilawa kuch kr bi ni skti ho aik movie me role kiya mil gaya apne ap ko angelina jolie samjhne lg gai ho. Flop actress", "amaladeel.00": "U ugly ass bitch , get ur facts straight u dumbass, u acted like a stupid illiterate person who had never been to school, first read the newspaper or have some insight into international affairs then open ur fucking mouth", "monaza_farooq": "Your silly words have kicked this movie in a pitch of big lose @reallyswara #hypocrite let me remind you one more time again that PK is known as a country not a state. #veerediwedding", "arfa_arfa19": "Double standerd women", "love_jst_happens": "You were the best😍😘", "maryam_868": "@iamanamazeem @noornizam_28 Aa re tu hyderabad aa khali😂", "danianwaar": "Fail aurat", "shabsk4u": "Flop as always", "anam_zafarr": "🐍🐍🐍🐍🐍🐍", "mahnur.252": "Bhains kahin ki..", "_ashuba.b": "Double standards🤭", "noorulaineee": "Enjoy ur five mins of fame ur getting because you will never get it again you hypocrite. And dont ever come back to pakistan your not welcomed here anymore. We dont like snakes, they should be kept where they belong!", "arainhasan": "She is a bhooki nangi for fame and popularity..films to milti nh hain aik agar bheek mn mil gai hai to bechari slut cheap stunts krky publicity le rahi hai..litreally who ia she..a black crow with unpleasent sluty voice..", "syedafarahzaidi": "@reallyswara SHAME ON YOU.", "jamalimuskaan": "Shame on you", "meenaf_26": "This 'well aware' woman doesn't even know what hrithik roshan had to go through because of a controversy involving him saying derogatory things about Nepal and its people back in 2000. What you said is on record FGS and history might repeat itself incase you don't realise!!", "aayesha20199": "Flop actress, failed human, failed woman", "mahnoorks": "🐍🐍🐍", "garimasandeep": "👌", "amnajankhattakk": "You are pathetic", "khateeejah": "Fuck off bitch", "annahsyed": "#reallyswara FUCKING FAILED THIRD CLASS CHEAP ATTENTION SEEKER,,,only wantx to get Attention,,,,,haaahhhhhhha LOOSER...Nobody was even watching movie for u,,u DUMB ASS,,,all was watching it for sonam,kareena.", "r_epost": "Bitch how dare you call my country a failed state !!!! Fuck offf !!! Crazy bitch fuck head", "sofiequreshi": "@reallyswara you ugly fat human being for challenging our lovely Pakistan.... You’re a nobody actress! Never heard of you before, and because of what you said, no one will ever remember you!! I have never watched anything of yours so don’t know how you acquired the title of an ‘actress’ 🧐🧐 Yours Sincerely. A Canadian born Pakistani, who is proud of her dual citizenship! Here’s to you 🖕🏼🖕🏼🖕🏼🖕🏼", "shameed399": "And ur films are almost flop @reallyswara", "sanxkhan": "@reallyswara please educate yourself with facts before opening your mouth next time.", "annumgilani": "@reallyswara just by using abusive words doesn't make her a good actress. She is nothing but a failed human being. Who is so damn desperate to gain attention", "neihavyas": "@reallyswara only for you I wanna watch this movie as I know you are a good actor. I really appreciate your hard work. Keep it up dear. Lods of love to you and your team.", "sareena.ad": "Khuray thi", "saba.zulfiqar7": "We are much better than ur rape state", "shubhitr": "Heard the movie got banned in your favourite country, post INDIA? 🤣", "ayeshajkhan21": "Teri shakal pe laanat!", "humairanasir8575": "Stupid girl😠hate", "aleenayousuf1": "Very disappointed by what you said about Pakistan.", "n_t_a_b": "@reallyswara Ki to lag gai😁", "hamnapiprani": "YOU ARE PATHETIC!", "neeha_sohail": "Well if a certain *ban* makes a country a failed state then shouldn’t you be calling India a failed state aswell considering its *ban* on Pakistani actors?", "aliyamush": "Sorry but ur stupidity will make crores of loss for this movies,if movie was not releasing in pakistan ,so what pakistanis were going to still see it in middle eat ,usa,canada u name it all over the world.u were a big reason for ur movie to lose millions no doubt", "bhattbeena": "Ur actng to gud @reallyswara", "efieeaali": "Haha!! I loved watching the pirated version of your movie, and the takes by your general public... Loveee itt.. too good!! Product hi product ki advertisement ti bas. 😂😂 ^a Paki!!", "enoorayy": "It’s funny that a movie aimed to break stereotypes stars actors who follow them :)", "sunilcomedyvines": "Congrats @reallyswara Mam you r soo talented even your acting superb", "sanamssss90": "Not a fan anymore", "thefashionorb": "SHAME ON YOU", "zaramisbah": "I was so excited for this movie since when sonam was talking about the budget dishoum gets n not a female oriented movie.. But swara ji app ne pakistanioun kuch zada halka le lia \"talking in ur delhi wala language \" ... Hum aplog ki tarhaan cinema ko agg nh lagate na stars k potlay jalate hain na musalman actors ko threat krte.... Apki movie ohh sorry sonam n kareena's movie is no doubt has a good topic good initiative but u my lady need to behave n digest the decency of high class n dresses u borrow from rhea ...stop behaving like a gawaar new new paise dekh kr pagal hone wali", "mentorcover": "Cheap actress with double standards #shameonyou @reallyswara", "aminah_rao23": "Kutti ki bachi", "ishristi_a": "Please don’t be encouraged with your foul language 🤮", "hiram_nadeem": "Commenting on Pakistan was a publicity stunt by a failed actress. Tactics to get more fan following from the hindu community. Side roles say itnay fans nahn bantay jitnay Pakistan pay negative comment pas karnay say. Slow claps for an uneducated actor like you.", "javaidmina": "You yourself indians are a bullshit Tum bohat double dholki ho Humhray mulak mein akar humhri tarref karti ho Tum jessoun ko izzat deni hi nahi chaye you don't deserve such respect Khud ke koi flim chali nahi hai or aik flim mein ayi ho woh beee tumey itnaaa peechya peechya role dia hua hai Tch tch tch tvh hahabahah dehk kar tum pir tarsss agya ke haayeee bachri kitnaa peechya peechya hai Ub ao toh sahi tum bomb maar kar tumhri chitaaaa jilaaaaa dein gya Apnay laafz ko lagham do bibi", "_noorjaveria": "We were supportung veere di wedding and got dusppointed when it couldnt make ro Cinema at Pakistan... but your mean words are kind of comforr telling us not to watch ot...Why dont you keep inline promotions of your movie onky to your country... infact What are you @reallyswara where do yiu stand in bollywood?? sincd you got a chance to act with @sonamkapoor & @kareena you think you nailed it ? shame on your pathetic reviews and thnks for making not miss screening of veere di wedding", "thecraftwarehouse": "Kaaali maraaasan you are even below a failure actor nobody knows you. Loook at yourself jaahilll", "minahil_aamir99": "@mariamkhann_ I actually started liking her. But when I saw that interview. Bharr mai jaye.", "bingeworthyd": "#shameonswarabhaskar", "sanalutfi": "Wish you all the failure in the world. All of Pakistan is rooting for your failure. Your comments will never be forgotten.", "suhafz": "You definitely are a failing actress. Dont know about Pakistan. So offended", "meenakshirainapatel": "You have really done a great job....Your character in the movie is having an impact......m impressed..", "avani_cinephile": "U r a rockstar 😎😎😎😎😎 #bossgurl", "halenzahra": "jaahil actress...👎", "misssquarefoot": "@reallyswara I loved you from #nilbatteysannata but you just aced another milestone in #veerediwedding Loved the way you did different roles in different films...ofcourse I loved you in #raanjhanaa too. Great going girl...😘😘", "anilmisraofficial": "Can't understand why you wore this jacket on your lahenga! The other 3 ladies looked awesome in the song and you looked so out-of-place. Poor choice 👎", "kuntalmaity": "Superb hatsoff @reallyswara ❤❤❤😚😚😚", "dinesh_shetty11": "The reason behind y i watched veere di wedding 1st day 1st show is Swara @reallyswara ❤❤❤❤❤❤❤❤❤❤", "_brush.strokes": "You slayed woman! Lots of love and best wishes ❤❤❤❤", "oshirawat": "Who needs boys when Swara is there", "toshirnalwat": "Ooooooohhhh You nailed it ladki @reallyswara ... Khaa gaie sabko...Jhakkas... Awsome performance in #veerediwedding .", "kawal_fahadian26": "Double Standard larke ho", "pashaayy": "Failed actress calling us failed state? Big lol", "dr._swarnali_sasmal_dermat": "You were the best swara ♥️♥️", "syappa08": "U nailed it.. loved your role❤️💋", "jennah_na": "I agree, she was the star of the film. A natural!", "crystal_geode": "Watched ur movie swara Love ur acting in movie ,the way undelivered ur dialogues and what a fucking glamourous style ,love you ,want to see again bec only of you", "priyanka_sharma2611": "For Swara 😘😘😘", "priyasurajkumar": "swara u were really fab...", "sanaowaiskhan": "Still hav to c the film cant wait but ur soo good in the trailers #goodacting#goodhuman#love#newfab", "ritikajainbaj": "Loved ur performance #veerediwedding", "swanandisalvi": "U were amzz in the movieee😍😘😘😘😘❤❤❤", "ananya_teron": "U nailed in #veerediwedding @reallyswara ma'am ❤", "aesthetician.dilettante": "U nailed it bro.. 😙🤘", "shradss": "I totally agree on this. U nailed it Swara👌🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "nainadwivedi_": "Today I too have watched this with my veere 😍, we too have felt the same #Swara rocks..! 😘😘😘😘", "iareeshaqureshi": "Flop actress", "deep._17": "Totally agree with the comments ... Nice attentioned performance #reallyswara😍😘", "beereyyy": "Who are you even? an actress with dumb ass shitty thoughts uv lost ur shit before even rising", "himdorabakugan": "Arey didi macha diye ho aap 🙏🏼❤️", "maryam_rizvi": "Like all the other Pakistanis, i was going to watch this movie. But thank you for your comments on PAKISTAN. It reminded us why the movie was banned in the first place. You're a failed fucking actress who can ONLY get attention by mentioning PAKISTAN!!!", "anubhagandhi8": "You absolutely rocked the character of *sakshi soni* amazing you are brilliant as your performance #swarabhaskar truley amazing... Love you", "rathoreharshmita": "I really liked ur role.. u just nailed it girl 😎", "mrs.verdhan": "Awesome movie mast acting 👍🏻", "harmeet.kaur01": "Loved.... U.... Throughout the movie😍 u rocked it gurl 😍 Swara!!", "zoya_nauman4": "Hadd hai movie mein jab sidekick ka role mile ga tau aisi bakwas kar ke hy headlines milen gy. It's okay, you wanted some cheap popularity at the cost of Pakistan, tau le lo. Kuch nai agli movie mein lead role mil gaya tau shayid baat karne ki tamiz aur aqal bhi a jaye. Hopefully.", "haq.mahreen": "Dear Swara really respect you and we in Pakistan love you.. you really hurt the feelings of all your fans in Pakistan... there is already so much hatred in the world pls be careful of what you say... best of luck with your film", "the_xx_factor": "Fortunate to be witnessing the times when actors are outshining stars 👍 Go @reallyswara 🙏 But you'll always always be Anarkali Aarah waali for me 😘😘", "vanidaggula": "😍😍😍", "arpita6594": "Wowwww movie 👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻", "iamnikitasha": "Pretty", "ritus_1807": "U were the STAR of the movie!!! What a fantastic performance. 👏👏", "siddhidagaaa": "You were really amazing!!!!!!💕🌼", "pritamsaha1196": "@reallyswara I love ur charecter❤ it was just awesome movie,#veerediwedding made my day🙏", "desi_kudiii": "The most admired character because she's true to her heart ... She doesn't hide her words with honey in her voice... @reallyswara", "john.elliii": "U were Fantanstic @reallyswara 😍❤ Loved the Movie!! Love All the way from Pakistan😘", "preetinayak1": "Lo! Koi kar nhi Raha isliye khud ki taarif dikhari h", "rasa_fdo": "Nc", "shifali_sachdeva_1": "@jyoti.75286 that is true... the scene😂", "mischieviouseyes": "@reallyswara just watched veere di wedding..and you just nailed it!!You were surely the best 'veere'", "ekraax": "You legit suck. By degrading another state another Country while in the hype of your movie. :)", "simply2shweta": "I enjoyed movie just because of u! Fan 🤗", "__.june._": "Really superb performance. Best acting💞 🔥", "ankeetaaposts": "Agree absolutely with the reviews ! You looked 🔥and your acting was amazing as usual 🤗", "_mona_panchal_": "You were really super excited in your role swara..Too goooddd", "asmaanwar": "You were the best among the 4", "debalina.shil": "Luvd ur style😂😂😂..", "sonia_star678": "LITERALLY LOST ALL THE RESPECT FOR YOU. Calling Pakistan a failing state you loudmouth. HYPOCRITE.", "gayatri_roch": "Your performance was the only good thing about this movie", "avinashiyadav": "@reallyswara you nailed it badly so proud of having an actor like you.", "_uniquely_common_": "She just nailed it!! Loved her the most.. 💕💕💕", "rathore_shreya15": "Seriously Ma'am u. Nailed it in Ranjana n now in Veere di Wedding ...", "apoorva_rajpoot": "Yesss swara u nailed it..", "foodie___soul": "Yaa exactly u performed very well ur role", "zainebbutt.zi": "I was really liking you but after watching your interview ...you have double standards .. Double faced person you are actually ....i don knw but from today ...you are not a person in my list atleast ....the country that was given you respect when you were nothing .....and now you changed your views ..i m amazed no more respect ...", "avneet_k92": "I totally agree! You were amazing in the movie! Loved ur character Sakshi Soni 👍🏼👍🏼👍🏼", "_nampoo": "I love the movie . It was house full in. Portland Oregon USA we had to sit in front row standing but still it was bang movie I feel like not to end the movie I wanna watch many times love it @reallyswara @sonamkapoor @karishmakapoor_", "chinchan_poo": "Swara ji.....Tusssi Chaaa Gaye.....😘😘😘😘😘.... #Dhumrapan #Swatstya aur #Charitra ke liye #Hanikarak Hai...", "heartbrek_king": "Noce role bhaskar @reallyswara", "joshua_thorpe13": "Seriously no doubt u were the best the bestest in the movie carrying off ur character perfectly laughed the most at ur scenes just went to see you 😍ur character yet u looked hot n desirable wish u a lot of success n happiness ✌🏽u rock gurl", "meereen_mee": "Bestest movie after a long time.decor clothes dialogues songs acting ..u were all awesome..all th characters were toooo stunning", "pankaj_yadav_raijada": "Sab pe bhari swara", "amanchahal027": "U were the best in the entire movie @reallyswara", "karishma__tiwari": "I knew she would be fab😍", "himanshi4129": "😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "misra.akansha": "@vedant.mishra03", "divyawadhwa2112": "You were awesome @reallyswara i loved ur acting ...n your role was two awesome. I was ur fan from ranjhna but now i am your die hard fan.... Love you .... Best of luck for veere di wedding 😘", "jayu_patel_9090": "Beautiful", "leo_utkarsh": "Worst movie", "sonaasharma18_": "yess swara you kill it", "mommy_kid_soul": "You were absolutely awesome ... loved it", "humorouslyurs": "You are real rockstar😍... keep ruling @reallyswara", "angellovesu892": "mind blowing performance..", "miss_vuitton1": "u really did fansatic job dear really bold hats off to u", "harrygiri5875": "Beautiful", "madhurdu": "Nice movie 👍", "sutapa1204": "@reallyswara fully enjoyed the movie...your performance is awesome..keep up the good work and entertain us ..."}