{"joshiramjibhai": "Hi,................", "cinrealla_princess": "Osm movie", "atufa": "Not only she has lost weight.. she has also lost her mind...", "priya3_69": "Lmaooo you are dumb 😂", "faaiza_panhwar": "Bitch.", "blahblah63812": "So many long comments 😶", "khaddiijjah": "Your movie was shitty as hell, jbtw.", "anjalimulik22": "U deserve the tag of greatness love u @reallyswara💋💖💝😍", "neilcaleb402": "Cut3 thighs", "_ravinder._.singh_": "Hotness", "itx_isho": "Pakistan Zindabad ❤", "kalsoom_akhterr": "@reallyswara people like u r responsible for all the hate between 2 countries. such a 3rd class comment. such a cheap and illiterate statement. ap jaisy log 2 country ki kabhi b friendship nahi hny dy gy", "vanshihehe": "I Support Swara For Her Words. She Quoted The Truth. A Harsh Reality Which No One Is Ready To Believe And Shitty Pakistanis Are Getting Offended. Pakistan IS A Failing Non Secular State And The Whole World Knows That's Why No One Respects Pakistan Except Muslims.", "jassy0012": "@reallyswara 👍👍👍👍", "manna_soos": "Well india sucks so does dis dumb bitch, peace out", "sonamjainshalu": "mam ur acting superb fabulous 😘😍", "sumit_suman26": "Waste #expertinmasturbation #cgrademovie #slut", "umy_e_hanii": "Indian bitch", "takhe_sasha_": "Swara after the success n great character you hold in this movie start recognising you.even I m started liking u so much.u have done great role.overall I like ur performance specially in this movie..... ummmma", "swara.bhasker": "❤❤", "shradzie10": "Really loved your kickass bindaas role in your latest movie.. keep rocking swara n love u tons!", "nivijalan": "U r truly an apt version of bold and the beautiful....pls do many more such fun movies....u were the highlight of vdw", "im_nain": "@reallyswara #attention seeker ...see what you got a lot of haters instead of fans", "parizehsultan2018": "People hate you before you even started!", "shanzekashiff": "Comments @nehl_malik @mahnoorkhokhar26", "fx_064": "Love and encouragement ¡¡ where?", "nehl_mirza": "Kuti chutia", "glojo17": "I think Swara was the best in the movie! I couldn't take my eyes of her", "momnajamil122": "Like seriously ? 😂😂😂", "drshikhasmsmc": "You were phenomenal😘", "iamachraf7": "Madarjaat ankh dikhati hai", "carpediemtodayrightnow": "A stupendo perfermonance ... touches", "_kwish_": "@kritikaaiyer15", "bushra18218": "Not a great move for talking shit about Pakistan, as if that’s gonna make you a great actress 🖕🏼 twat.", "are._.eba": "@nehaaxs my source of entertainment these days. She will pay for what she said", "mahnoor_shahid_k": "Ahh wheres the love? Cant find any! Error 101 ❌ love not found 😂", "araymaham": "You're a really terrible woman.", "the_whimsical_one_": "Love love love 💕💕💕", "angelinarips": "Lol. You are a total joke", "its_mohmeeta": "Damn you gal .... Ek statement se hila ke Rakh dia purae Pakistan ko 😂😂😂😂😂", "sheikhsaab947": "Tjhe kareena ki maa ka role dena chaie tha", "obeautifulworld": "You are so, so bloody talented!! I watched the movie tonight with my girls (including my Mom) and we could not stop gushing at your scenes!! You are a ⭐️!!!! 🙌🏼❤️", "suneathegreat": "Who are you anyway? Never heard of you, was this some lame popularity stunt? Chalo u got your 5 mins of (de)fame, and we got to know how stupid you are lol. Pakistan has sharia law? LOL. Maybe stick to b rated movie roles sister and let the educated people make political statements.", "mahnoorks": "👎👎👎", "sh_1985": "#Swara you’re not even a known actress. By posting a statement about pakistan all you’re doing is trying to get famous. Just because of this I won’t watch your movie. Even tho I love sonam And kareena kapoor!!", "creativity_by_sumbal": "Chameleon", "sashayousay": "Are you stilk hoping that your movie Will not be a \"Failing Movie\" ??", "jaweria_fatii": "Attention seeker", "dr_raginidhakriya": "You nailed it 😍😍loved ua performance @reallyswara 😘😘😘", "cat_snow_white_": "I used to be your fan @reallyswara what a shame I wnat to go back unlike all your posts", "maria_saeed21": "Flop actress", "pratikauppal": "@zahrajetha dude she was the only entertainment in the movie!!", "ayushtiwari_17": "There is really something wrong Swara with Indian audience that movie like 'veere di wedding' got hit and movie like 'parmanu' got flop. Shame on Indian audience", "alishba1990": "Moron", "shubhankursingh": "Brilliant performance..!! You slay like a queens @reallyswara @sonamkapoor # Kareena Kapoor # shikha ma'am.", "mominakhan_786": "Hundred times shittt on u @reallyswara u proved how ugly you are 😤😤😤😤 boht acha hua banned ho gae movie apni gandgi apny Hindustan tk he rakho", "saboor.naveed": "Pakistan is not a failing state its just that you're a failing actress and failing Human being ✋", "anooshawarraich": "Publicity chye? Aww", "alikhan57101": "Shame on you🖕🖕🖕🖕", "varshil_ruparel": "We all loveddddddd your role @reallyswara", "deepisha.a": "Great work in the movie!👏 @reallyswara", "sai_f_aly": "Naam bhi nahi pata tha mujhe apka😕 lekin jab se Pak ko bura kaha tab se famous hogai londiya😂😂😂", "aleenarehmankhan": "@fatimahrazza she honestly doesn’t deserve all the words. She doesn’t even deserve the negative attention.", "dipica11": "U are the charm of the movie", "hadeeqa_sheikh": "When these flop actresses dont gain popularity they talk about pakistan to get into a little limelight... but trust me you are still a looser", "ammara_rana12": "Who the fuck knows you ... We only knew about kareena and sonam ... Tum kahan se aa gayi actress huh ... Gandi shakal wali @reallyswara", "sanjaych243": "I'm Hindustan and I'm ashamed about such kinda hypocrite so called feminist #bloodyshame #doublefaced", "sidharthpreet": "Swara m supporting u Jo bhi tumne Kha vo such h or humare Desh m rahne wale Jo Pakistan Ko support Kar rahe h plz I suggest u go Pakistan nd stay there m indian", "jakeg2119": "Pakistan it's a blessing in disguise that film was banned there, pathetic film and I am surprised swara who writes so many open letters is actually sharing all these paid praises in her Instagram profile", "a_verwildert_sunflower": "You were amazing !", "nuclear_nadal34": "if you come to wadiya we will make you slav e", "vanshitanarwal": "Dude you, shikha and sumeet vyas killed it! 😍", "deacon_medak": "Chameleon you are lol... Come on wash your face..i am sure there will be a lizard there hiding for sure.", "h__t__j_____arts": "#failed_actress", "that_foodie_gurll": "Nobody knew ur name before all this bulshit...n now ur famous churail...sawara bakwasbandker....is famous now yeaahhhh", "jhalani_kritika": "@reallyswara You were the best in the movie! Brilliant job! 👍", "ashika.singh": ".", "truthinesss": "Itni galiyan khane ke baad hor dass kiniya tareefan chahidi ae tenu!!!! A big Lanat on your face for being such a narrow minded person", "niikitahiremath": "@reallyswara Yar I just wanted to meet u.... mind blowing performance...In a whole movie I was just looking at ur expressions... I would love to take ur interview...😘😘😘😘", "creamy_milkshake_16": "@reallyswara yes ur highlight was ur wankin off scene apparently 👍🏻👍🏻👍🏻 just a question 1-2-3-4- or d entire fist?", "ayisha_bubak": "HYPOCRITE !!! #failedactress", "abubakermehar761": "You are a flop actress!", "abhilashasen0505": "Awesomeeeeeeeeeeeeee movie", "bebss__xx": "Fuzool.", "i_am_rohit_kohli": "Just saw the shitty fucking film and fucking worst film of all time ..matlab vulgarity ki maa bhen kar diya and swara didi aapki on screen masterbation toh awesome saala films ke upar bharosa he utth gaya have some shame ....i don't understand what feminism is it 😑😬🤐", "a_n_k_i_t_m10": "All Pakistani pussy are crying over here !!😆😆😆", "fizzasarwarbutt": "ur name should be swara bhasterd 😂😂😂", "nimzzzz_shykh": "More hate is coming to you-!", "zainyy_alii": "Not only your film, but you should be banned from Pakistan too.", "rahulsingh_vfx": "Swara loved ur character in d movie ... grt wrok", "rajasaadd": "Chotay loog chotii soch 😂😂🇵🇰🙌🙌", "iamjtekwani": "Well @reallyswara just bcos you did one stupid film with a good role , doesn’t mean you will talk about Pakistan and for the Pakistani .. people like you are double standards and shall be a low side heroine ! Buzz off !!", "mr.buttercup_sach": "🖕🖕🖕🖕🖕🖕", "kalpeshh09": "Amazing work @reallyswara you just stunned me with your performance the character you build was fabulous amazing acting, I don't know why people cannot appreciate the hard work an actor or actress is putting in, they just want to criticize everything, you should not listen to any of the negative thing, we are with you...", "ns327": "Bloody ugly idiot...A big disgrace to India and the quality of actors we have here..why did she even open her mouth...miss know it all..stupid babbler", "ronestone_": "Instead of talking shit go ahead & do masterbating & give blowjob you thot. And LMAOOO you had a side role not even a main one so don’t know why are you talking so much shit like calm your tits hoe", "minahilfatima588": "Pathetic", "pollyas14": "Stop saying shit about Pakistan. You moti", "xlaibae": "Pathetic", "aliya_shahidd": "FIRSTLY @reallyswara who the fuck says feminism is just about females?😂😂😂I MEAN 😭😂😂🤚bas amjad bas aur mat bol! Feminism is not just about females equality its about equal rights as a human.Pehlay definition seekh le aunty jee.Secondly i aint blaming India for someone like u but i think this country doesn't deserve someone like you at all😒.Thirdly listen to me with all of ur holes so i sound clear to you.When India banned Pakistani actors from working there like fawad khan ,Mahira khan and even atif aslam lol and banned waar Movie.So which of the pakistani's actors lets says which of the pakistani's flop actors came into limelight to seek attention like you?😂NO ONE SO ZIP YOUR MOUTH WHEN U WANT SOME EXTRA ATTENTION BECAUSE SONAM AND KAREENA WERE YOUR CO-STARS😂i didn't even know if u ever existed lmao.AND THE REASON PEOPLE ARE WATCHING THIS MOVIE IS BECAUSE OF SONAM AND KAREENA! FACTS ARE FACTS OKAY 😂😂AND I DONT KNOW WHY SOMEONE LIKE YOU WOULD GO AND TALK ABOUT FEMINISM?SERIOUSLY YOU WHO HERSELF CANT ACKNOWLEDGE RIGHTS TO THE OTHER STATES TALKS ABOUT FEMINISM? BAJI PEHLAY GO AND FUCKING EDUCATE UR FUCKED UP MENTALITY PHIR BAAT KERO AND ANGREEZI SEEKH LE MUBARAK!KOI ITNI BARI BAAT NAHI.AQAL KA HONA BHI ZARORI HAI WHICH CERTAINLY U LACK 😚SO I GUESS U SHOULD HAVE TRIED HARDER BECAUSE NO ONES TAKING UR SHIT .OOPPSS.IF U THOUGHT THIS WILL BRING SOME SPICE BETWEEN INDIANS AND PAKISTANI'S NO IT WONT BECAUSE AFTER ALL WE ALL ARE HUMANS DOESN'T MATTER INDIANS OR PAKISTANI'S.I LOVE ALL HUMANS NO MATTER TO WHICH RELIGION THEY BELONG TOO AND TO WHATEVER COLOR.MAY THE LORD OF ALL OF US GUIDE YOU ON STRAIGHT PATH ....FOR U ARE AN IGNORANT PERSON HEHE TALKING ABOUT FEMINISM 🤔", "omarmaliha": "This is what a b grade actress (for want of a better word)does to get attention !Loser!", "amal.kamal17": "Look at yourself @reallyswara you’ve brought failure upon yourself. Next time you’ll think before calling Pakistan a failure. Look at all the comments. Bitch we’re a clan and we’ll protect our country no matter what so be careful.", "ankit_mindfulsoul": "First time India is in sync with Pakistan for hating this actress (so called Feminist)", "tiaraspark": "You r just a crap aik movie karli just lost everything thats called FAILURE", "noone000.0": "Keeray parien...", "sidsirusdotcom": "Babe, you have guts, but do you know what got me to pause your interview along with your film co-stars? You were speaking fast, louder than is normal on screen, and your hands were on the move throughout your statement. Psychology says these are features that identify un-truthful speeches being delivered. By your own fault, my dear lady, you have taken the saw yourself.", "fasiha_malik": "Thank you pakistan censor board for banning her shitty face Idiot women go wash your face first idiot women even our servants are more educated then you LOL AT YOUR FACE", "bisma_j": "lol at this account", "saleha.abbasi": "Pakistan isn’t run by Sharia Laws: #swarabhasker needs to get her facts straight before spreading negativity! And to your question of what to expect from Pakistan: we cannot be apologetic if our country has standards and doesn’t allow its population to see a movie where girls are using vulgar language and exploiting the meaning of feminism. In addition, before bad mouthing our vocabulary look at the way you’re addressing your fans and hundreds of people who were actually excited to see your movie in England and other countries (which obviously put us off). Quite ironically, I loved #KareenaKapoor and #SonamKapoor’s reaction to their co star (who literally have the loudest voices when it comes on giving opinions on other people)! Anyways, take this piece of advice not from a girl from Pakistan to an elderly woman from India but woman to woman - Think before you speak! And having a loud voice with negative options will only bring you down in life. Don’t be a hater sweetie x", "millisingh13": "@reallyswara - you’re just fab in the movie....u killed it bro❤️ This is my comment on any celebrity post but I think u deserve it😘😘 keep entertaining us...Also me and my girl gang loved ur performance👍🏻", "munib100": "Hi bc", "maryumxhan": "Side role wali hahahhahahhaha. Tmhre leye kon ye film dhekne jaye ga ??? Agar koye kaye ga ye film dhekne so it will be for kareena or sonam .", "karan61995": "kisi ko bhi theatre ja kar. paise. barbaad kare movie dekhne nahi jana chahie", "secretgirl009": "I don’t think any of us were going to watch the movie because of you love. Nearly all of us didn’t even notice you or knew who you were. If we were going to watch it it was because of Kareena and sonam. Two minutes of fame and look at you like I said we didn’t notice you. You’re comments is what we noticed", "ishuhot": "Ye @vicky làlwani ki gand marega kapil", "rich_i_rich_a": "The best thing about #VDW is @reallyswara", "brown____sugarrr": "bhooosri 😁😁", "hina96_": "Simply block her' and slowly she'll get her answer.", "vinniezeh": "@marvimaqsood read the topmost comment", "itssanya_xox": "Sound word pasha 🙌🏼💯🙌🏼 @pasha.mua", "ayesha.khan2924": "Bitch", "inaaya147": "jab kute ko thori hadi khane ko kya mil jati he to uke bi par nikal ate hen kuch filmon me kya kaam karne lag gai he to apne apko pata nahi kya samjh rahi he par useless use less hi hota he 😂😂😂😂", "jehanniazi": "@reallyswara India currently has the largest number of separatist movements within a state, don't know about you but sounds like a \"failed\" state to me. We are not governed by shariah law, you would've known that if you had actually managed to make it past the 7th grade. I get that you've always had the maasi ka role in B grade movies but please man, channel your bitterness elsewhere; I know this is probably the most attention you've ever gotten, so you can go back to being a nobody.", "hassannnaeem": "You are disgusting,hypocrite person and your statements are contradicting #pakistanzindabad🇵🇰", "alishbahnaeem": "You were admiring our hospitality now there is contradiction in your words you are pathetic and hypocrite our language is the finest and is pure from vulgarity #ProudPakistani", "waniahhh": "What an attention seeking piece of crap. People like her don't deserve success", "ertugrulghaziurdu": "Pakistan py bolny wali... aik padhi likhi wealthy family se taaluq rakhny wali aurat kia apka mazhab apko ye sab kuch seekhata hy? Hmara mazhab to hmain ye sab kuch karny se mana karta hy islie apko kuch bura bhala nahi kahungi... Bas itna kahungi GOD apko hidayat de acha bolny or sochny ki warna itna padhna bekar hai🙂", "tehniat.a": "She has apparently been led comments on some of the threads", "maham_aijazz": "Bibi tu na bus ak PKAISTANI hath ki maar hy...tjhy prri hn na or tgy WAHGA BORDER ki sarak pe ballon se pkkr k ghaseeta jae tjhy khd e smjh a jana hy k PAKISTAN ka naam tj jaise gande log apni gandi zuba se nai lety...", "neeraj_aka_bombastic": "@reallyswara loved that apna haath jagannath scene. No indian actress has attempted to do it. Way to go girl.", "roamersndseekersz": "You talk bakwas and your acting is bakwas...just name yourself bakwas because that’s all that you are... Bluddy idiot", "shahrukhyy": "#FailedActress", "bhavesh_060894": "Actors like AAMIR KHAN SIR, AKSHAY KUMAR SIR and SALAMAAN KHAN SIR,SHAHRUKH KHAN SIR,do the films where they try to show women and girls will power and increase the value of the women in the society and this is the correct way to show women and being such lead actresses and women, what you people showed in movie ruckuss words, drinking,smoking, hifi life, masturbating and posh dresses thats it and you claim these activities as equality and feminism lolz , please get educated from heroes while selecting stories or ask any senior female actresses for the opinion after listening the stories . I still cant believe how kareena kapoor mam has accepted this movie might be because of u r friendship🤷🏻‍♂️ thats it . Upon that insulting other countries and degrading respect and pride of own country. Even Top actors dont talk much about other countries plz get to know , from no where you came and talking such big words shows how much pride has gone into your head.🙏🏻 A film is hit or flop it is not in the hands of actors or actresses or feminism its in hand of ppl so declaring self hit shows ignorance 🙂. Whats the difference between a b grade film and normal film if you do the things in which b grade film also shows. Instead of concentrating on stories you people concentrated on feminism thats y your film has become so hatred in the society and in other countries in fact they are happy a lot 🤷🏻‍♂️. Bhajrangi bhaaijaan was the film where a movie improved relationships between the countries😁 without even a uttering a single word , DANGAL was the movie which showed will power of girls 😎🙏🏻💯 . This is what v call movies not the VEER DI WEDDING which took only feminism as a concept", "nimraa_farooq": "@halima_7mf read the comments...ab nahi dekhni ye movie sirf iss ki wajh se 😂😂😂", "umia6218": "@reallyswara that should not be the attitude of a struggling actress. 😆😆 empty vessels make the most noise ...who u are ...people of pakistan not even know you.😏..your type of actress gain movies and fame by looking seductive and give controversial statements to seek attention.feel sorry for you this shortcut has really short era.dont try to be as kareena and sonam @sonamkapoor ...they are superstar and their mentality has a class they respect their fans and differences which u dont .thats how they have followers over the globe including pakistan.in india people dont know u ...so plzz this is cheap way of seek fame. how u change your statements ? are u a girl or a chamelon ?? after soooo much insult you should better to think before speak in future about pakistan #swarabhaskar #attentionseeker #soothing _", "lala_jadav": "Now days being nakked is success #veerediwedding", "summiinstyle": "Film is 👎🏻👎🏻👎🏻 and you are looking 👎🏻👎🏻👎🏻 zero", "anjaligovindrana": "Proud of u for speaking your heart out i m with u @reallyswara", "arju_patel": "Hii vagina. you are so false that you standing for raped girl and now you doing this kind of scean. in your movie i thik you and sonam kapoor both are sisters of rahul Gandhi shitty acting", "_ajak13": "Seriously you are a failing actress and I refuse to watch your movie.", "priyashrivastav": "You are surely taking place into people's heart ! More power to you Swara! New fan!!", "sajidaa.akbar": "Hate, hate and hate 👎🏻👎🏻", "pb11_dubai_wale": "Thanks kehane se pehle comments to padhle... Bahut tareef ho rahi hai Teri 🙏🙏🙏🙏", "_nehit_chaudhary": "@reallyswara Veere Di wedding is awesome ND just becoze of u I love ur acting in this 1no.", "desifoodaholic1": "Shit hole. What love we hate u. Next time dont ever come to pakistan u shit hole. U shit hole remove cloths for one film u dont deserve to be actress.", "jabbar.sidra": "Such a hypocrite human you're. How can you call our beloved country a failing state.? I mean you should first look at your own country and your own self. But again this is like (dusron pe keechar uchaalna bht asaaan hai meri jaan) people like you just think and care about just their own self not for others. But again we Muslim just say to peaole like you (ALLAH tumhey hidayat dey)!", "chai.bana.do": "LOL ! Is lerki ki dheetai check kero zara...social media pe itni bezti kerwa k bhi upni story update kiye ja rahi hai like nothing happened 😂🤷‍♀️ #loser", "tahreemrashidddd": "Can’t wait to watch , just waiting for Ramzan to get over 😻😻😻@pandherdivjot", "divine_1758": "Fake girl with so much hypocrisy", "axa.shaban": "@bilyas89 👍🏼💪🏽👏🏼👏🏼👏🏼", "irtazabukhariofficial": "This lady deserves NOTHING. Report her account and make it disable somehow. She don't deserve to be here.", "utsavi_patel22": "U nailed it 🤘", "dr_sidra_parve": "Shame on you...", "momiinailyas": "a failing human being you are!@reallyswara", "amirahh_dion": "Shitty ass movie", "laibaayaz_": "Loser!! 😏", "zurishahmad": "Unfollowing because “Pakistan” is not a failing state. Not even gonna watch the movie here in the US.", "isra151": "Good job on messing up so royally that you’ve lost all respect, dignity and reputation. Takes some special talent to do that. Failing person. Failing human being.", "zahrakh4215": "Poor u @reallyswara .. you just not only spoil your image but also their, lead actreses (sonam and karena)..#PAKISTAN meri jan..❤", "rania.12377": "Asshole", "omglol_i_cant_even_": "I just wanna say that you’re pathetic. Have a good day", "mema_khan9": "I prayed for your speedy recovery.", "ayusha1873": "You have weak character and no moral values. Your parents made you a two faced snake instead of human @reallyswara #publicity stunt s", "vikas_singh_jamwal": "Gofilm4udotnet watch veere di wedding in 720p dont waste ur hard earned money in theatres for this third class movie #SheDefamedMyDevsthan", "rajeshwarikondal": "Yaar everyone loves their country. Kahe ko behen kahe panga liya. I saddened by the comments that are said for you. Apologise karlo aur jaan bachao 😅 rest chill karo aur try to find out a method to get out of this", "shasha181": "JUST A UGLY BITCH 💩💩💩🤢🤢🤢 F.U", "gour298": "You are not fitted as a typical bollywood heroine!yr face is not that sharp.", "amberkhan": "Wait, this is the chick that everyone is mad at... just follow me for a second... I’d be mad at Pakistan if I looked like this too... stop gassing this bitch. She’s obviously got some inferiority issues when it comes to Pakistani women... which again, makes sense. Look at her. She just a hater. And you put her up against way prettier women, of course she had to say something to pull the attention back to herself. Simple, pathetic tactics. I’d spend more time looking into a good nyc based derm and less time speaking on politics and the health of a nation. You can’t get your lips the right size, but you’re qualified to comment on geopolitical issues. No, fam. Go crawl under a rock like Modi and the rest of the far right Hindu idiocy. Or better yet, take a selfie with the head of an apartheid state. That’s how you guys roll, right? Racism is so last century. Welcome to the age of social media where your backwards shit gets you strung up for the public. And while we’re at it... y’all are the ones who riot to NOT CONVICT GOVERNMENT OFFICIALS OF CHILD RAPE - failed what....bitch? What was that you said? Yeah... exactly. Nothing. Go get back under your rock, trick.", "call.me.malli": "Lanati h ek number ki.", "shumaila_butt": "U proved it sawara bhaskar that u r an uncultured and uneducated person...... 👎👎👎👎👎👎", "desigirl9092": "Just because your nation has forgotten its true cultural values and started chatna-ing 👅 goras chuttar , doesn’t mean a country trying to protect its values is a failing nation. Your movie is not teaching women empowerment, it’s teaching girls how to assimilate into western culture and by doing that you will become a stronger women . A movie about empowerment would be sticking to your roots and then showing how female intelligence and support lead to success. This movie just further sexualizes women through vulgar dressing and swearing thinking that’s what women empowerment is . #lanathaitumpe🖐🏽", "reeeet_": "😋", "_ayeshafaris": "You looked like a piece of shit infront of Kareena and Sonam in that interview. Sad how uncultured and uncivilized you are, didn't even have the basic manners to pause and let the other ladies speak. That itself showed your pathetic character and how hungry you are for attention.", "suhani_mishra17": "@reallyswara u r d only reason I loved #veerediwedding❤️ u nailed it srsly u deserve a big salute for ur role I really appreciate ur work Ur boldness in d movie ☺️💐", "weareapart": "She have mummy issues. Insecure bitch", "bilaltoor1": "Swara tre tow ma maa lo lun duga agr tu Mre samna ae tow🖕🏼👙, jo tuna Pakistan ka baray ma bola ha #fuckswara @reallyswara", "sammar_malik222": "getlost gud for nothing ugly duckling", "x.shafaqzahra": "You clearly have NO KNOWLEDGE and I really feel bad for you🤒😂😂😂", "t.a.k11": "Who is this black ugly fart swara", "blissmaaa": "Your failing instagram account! Eww", "prieha.m": "PAKISTAN ZINDABAD! ✨♥", "muhammad_amjadali": "Apko zyda bolna ata hai kya?? Pakistan ke khilaf.. Ye sab chrezny apki gndi soach ki nishani 😂😛😛", "amritesh_v": "जिस देश के युवा \"परमाणु\" जैसे मूवी को रिजेक्ट कर देते हैं और वीरे दी वेडिंग जैसे वाहियात मूवी को हिट करवा देते हैं वो पकौड़े बेचने के लायक ही हैं....", "symplegela": "Hello dear I am from india but long time ago settled in canada.. since i watched your raanjhna movie, i became your biggest fan and when i watched veere di wedding... omg I can't describe how feel right now for you. No matter what people says.. you had the kick-ass performance in veere di weeding❤️❤️❤️❤️😊", "shaikh_1009": "You fuckin characterless bitch go wash your face full of with makeup 😂😂😂 !! @reallyswara", "theedit9": "What a Pakistani hating cow!!! I was looking forward to watching this movie after ur comment Hell No!!!!! What's in ur Heart came out!!! Only shameless fukked up pakistanis will watch ur shitty movie.. just cause uv had a failing career no need to bring others down @sonamkapoor can't believe u ever took her in ur movie I'm glad it was banned", "sagar_1302_prvt": "L U darlooo.....", "ashish_d_vedi": "It was quite amusing @reallyswara", "rimmshaaaa_": "A failing actress has the audacity to call Pakistan a “failing state” oh if it’s so much of a failing state why do y’all enjoy our actors/ singers soooo much? Lmao. Majority of the people only watched the movie because of @sonamkapoor & #kareenakapoor I hope that interview earned you 10 extra dollars & 2 minutes of fame. Because that’s all you’ll get.", "stylezs_life": "Abnormal face", "ics_1105": "Once a slutty vagina always a slutty vagina...", "v_a_x_h_o": "Side role krnay wali ko tori importance milgai toh azam ni hui?learn something frm @sonamkapoor the way she treats our pakistani stars n look at u...", "nawal783": "This C class actress is not being able to contain her excitement and talking rubbish coz she got to work with some A listers & got invited to some parties. Wait when she’ll be thrown out of the sonam gang.", "lucky___rc": "@reallyswara Go teach the men of India not to rape first! I am Indian and saying this. Interview after stupid interview and Kareena too an idiot cannot make one intelligent sentence.", "reshmisharma_canada": "swara you did great job in veere di wedding.", "iamsheerniii": "Yeah and the bitch who disgraced her own country by putting them down in the movie. You’re just trying to fit into Bollywood I hope they throw you out of their media you can’t even be loyal to your own country.", "kfatima17": "@reallyswara Double standard !! B grade actress", "michelle_bangera": "U Wer the best 👌👌👌👌", "ali_bin_imran_": "Hate you swara bhaskar shame on you fucking bitch you are", "celebritieslookalikes": "Tatti movie of all time", "mehreenrath": "Goin’ down girl. You’re so far down I actually had to dig you out and guess what, this hatred is ALL i found! That’s what you did to yourself. Shabaash! Or is that not in your Indian vocabulary!?", "readster22": "Hahaha kya kamini ho bhai tum... Kuch bhi karti ho na publicity keliye...no wonder you feel like a vagina. You are a vagina...a sex workers possibly.. I wasted my 1000rs on that shitty movie #veerediwedding. Sabse cheap tum thi usme...ameer lag hi nai rahi thi. You looked a hooker there too.. abhi dekha Sonam tumko kaise laat maregi...I am hindustaan..bullshit..You are cheap lady. Never ever watching you in movies again n trust me I will troll you for your life. Shamelessly", "caramellkittenn": "“Janaab” vs “bhaiya”. But yet Pakistanis have a “way worse vocabulary than we do”. Really though? I wouldn’t have said “way worse”, people with better vocabulary would call that shit “much worse”.", "azraquddus": "@reallyswara I think your remarks about Pakistan have shown how clearly smitten your to be floating with the big league stars of Bollywood. You mostly started in low budget movies never imagining that the likes of kareena kapoors would ever give you a second glance.. but guess what every dog his day and so did you but it’s not your fault for being starry eyed you’re like a kid who got gifted an expensive toy...it might never happen again..", "junaid_chattha": "bitch", "haider3012s": "You better be a porn star @reallyswara", "amaan_shaikh39": "For tge 1st time in life swara bhaskar got 4000 comment on her profile but most of it is hate so doesn't matter does it?", "nvnbrnwl4u": "https://www.instagram.com/p/Bjk9b_HgbAQ/?utm_source=ig_share_sheet&igshid=1x8tcit8xss63 @reallyswara ... Really double standard behaviour... @qurat_ul_ainnn @halimasarwar @mesheikh I just seen this video, shared by one of my connection... And I'm sorry about my words and supporting @reallyswara . One of my friend says that she blames Pakistan because of killing #charanjeet_singh_sagar a social activist..... That's y, I supported her...", "isha.khawar": "Just watched the trailer and I must say you’ve zero acting skills!", "salehak.9": "We have not even watched the movie yet. But after these comments, I refuse to watch you, your co actresses and #veerdiwedding. Talking trash is not women empowerment. @reallyswara “FYI” Long Live PK 🇵🇰🇵🇰🇵🇰 ✌️", "maleeehaaa": "👞", "dhanashriraykar": "@reallyswara i just wanted to let u know u were f######## amaazzingngggggggg in the movie u r super amazing i just dont have words to describe how awesome u were superrrrr sexyyyyyyyyyy", "gur19200": "Uhhhhhh.....stop and live life easily....I'm a human. Don't take too seriously. Life is too short, you never know when you are going to die. So many judgment and criticism.", "soniiaa.c": "Are you scared to be killed like Om Puri for siding with Pakistan? Is that whats rly going on you ugly fk", "maansi_bhatt": "Ma'am u were just awesome in the movie❤❤ loved the role played by u was the most rocking one💓💓💓💓💓💓💓💓💓💓", "asramosoof": "Get you facts fixed ! You stupid thing . Good that they banned this movie here. Not gonna support idiots like her.", "kurkuray12345": "Tm ho kitni kutti tm ho kitni bc tm ho kitni mc tm ho kitni begarat take your words on your ch*** failing state hahaha zda shokhi hogai kareena k sth movie bna k flop actres .", "alyanah___": "You shitty and dirty pathetic girl aik do movie me kia agyi apny ap ko arrogant krdya bloody fool you are actually why kareena and sonam are succeed bcx they respect other countries and respect their citizens too", "wadhwani10": "Only you were worth it😚😚 kudos to you for shutting down such aunties😎", "anis.musani": "If masturbating on screen, and talking talking shit on camera is your definition of feminism, I am glad we are failing in that department. Also, women of Pakistan are empowering themselves by going to med schools, engineering schools, business schools etc so I guess we are doing fine without your shitty movies. Enjoy 😊", "silverparrot": "Why promoting hypocrisy? Pakistan is not a failing state!", "rxster107": "Best character in the movie!!!", "30uttu.utsav": "Hello mam...Big fan..But.....Pata h kya..Humre desh mai veere di wedding jaisi ghatiya movies chalti h...Lekin PARMANU jaisi dekhne wali movie..Jismai dekh k kuch smjh aaye....Wo movie flop ho jaati h..Aur lg kehte h..K soch choti h..Kyu k ladhkiya gaali de ri h.....", "being_womaniyaa": "I am with u swaraaa let this bloody gawaar Pakistani bark they don't have any other work rather than commenting over here 😝😝😝😝", "bearded_inderpreetsaluja": "@reallyswara logo ka kaam hai kehna....apna bas kaam krna....keep up the good work...", "aiyesha__": "Just a basic bitch in denial lmao", "theglamlife786": "Aik film kya kar li banderiya ne apnay apko star samajh rahi hai ... u better apologise bitch for wot u said abt pakistan 🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻.", "nadiaf_03": "@reallyswara first of all who r u to call pakistan a failure state😡😡 first look at yourself how successful u r..ppl even didn't know u properly before veer di weddong movie which actually isn't ur movie...u r doing just a Small role un it and secondly we never seen a dual faced personaliy like u before...remember ur interview in pakistani channel and now ur this pathetic statement about our beloved country..actuaaly u r yoyrself a big failure and ur all \"naked\" co stars who has nothing to do except showing their bodies just for money😡😡😡😡😡", "_salwayyy": "🖕🖕🖕🖕🖕🖕", "z4inab_xoxo": "I was excited about this flim, but after reading these comments I dont fancy watching it at all. It shows me that bollywood has really lost it's touch and tryna become hollywood part 2. Shame", "kashaf_78": "Bs jo goo lagatey ho wohi nikaltey ho..not surprising at all! #attentionseeker #worthlesspieceofshit #tinyactress #smellymouth #hypocrite #stinkyface #stopfartingaround #doomedfromthestart #nowyoudiealoneimbest", "hiya_mahabi_2903": "U were the best swara..... What an acting u did...... Amazing powerful and superb..... U nailed it buddy.....", "harshad_chopda.world": "@reallyswara u like to sell ur body by being naked is ur choice ....But in our religion we dont like to be naked like this and yes this is our beautiful shariah..... You forgot that indians too dont like the way you are exposing in the movie....So plz respect each others religion.............And dont try to spoil Indo Pak friendship with your cheap skills.............", "mehvish11": "@reallyswara stupid b grade flop actress... @maryumnaim00 @maheennaim", "larakhan922": "Back side actress worked on back of kareena and sonam don’t u dare u talk about Pakistan.. first make ur own position... u backkkyy bitch", "momana_azhar": "Bulshit @reallyswara", "haf27": "@yussraadeel", "shanaz.islam": "Really Awara that should’ve been your name lol @reallyswara", "aruncararun": "U r a good actor. Pls stop putting up ur own praise. It's so lame", "maria.asghar85": "not a one time watching movie even.....pathetic no story.", "miss_aish999": "Ye faqeerni Kon hai?", "soniya_abdi100": "Btw congrats swara for comments traffic on ur social media pages ... U must be feeling special ...who care if they are haters", "rubeinaa": "What can somebody expect from a low,third class actress which is even disown by its own people who was in utter need of attention in kareena and sonam centric film. Poor soul", "eratkhan": "Stupid logo ki ek yehi pehchaan hy inky paas damagh nai bs moun mein gandi zuban hy 🙃🙃🙃 @reallyswara you are such a stupid & dumb product ... cell change kro apny ...dummbo", "ayeshazulfiqarr": "Banning your movie was a great decision of our government. You jst a piece of shitt. Third class actress with third class mentality. I really wanted to see this movie bt now jst bcoz of you, ur arrogance, am happy its banned in our country 👏🏻👏🏻", "n.ooraslammm": "Second of All hum Yani ( Pakistani) App k asaanmand rhe ge k janaab ne Pakistan akr \"Bhaiya\" \"Bhaiya\" k bjaye Janaab keh kr humein izatt nawazi.@reallyswara", "iryusra": "With stars like Kareena and Sonam in the movie, this is the best a sidekick could come up with to get her 5 seconds of fame.", "maa_baap_ki_dua_": "@reallyswara kuch sharam karo madam lannat hy tum par muoh pr kya aur peht peeche kya bolo rahi kuch sharam karo 😠😠😠", "pink.bling.official": "Aunty jee u r doomed. And never ever call Pakistan 🇵🇰 a failing state. Pakistan Zindabad", "abeer.farooqi": "Allah ka shukar we dont have such #cheap people like you here in #pakistan", "theshamnajournal": "Congratulations on the success of veere Di wedding , but even after visiting Pakistan u couldn't understand it's people , calling it a failing state will not make your country any better . We had a reason to ban a movie and every country has the rights to choose what to show and what to not just the way India banned Pakistani artists on political bases . just because your movie was banned u changed your opinion . Just shows your double standards . And please learn about the Sharia law before speaking about it . We have our own standards to maintain!!!!!!!!!. Although I am against the ban of movies of any kind , because it's really the audience choice what to watch and what to not but you judging our entire country based on a ban is absolutely disgusting and wrong . Hope u start thinking before u speak and grow up a bit . If u think that banning a female centered film shows how small minds we have then I guess u should see the amazing female examples we have .", "hoorii._": "🇵🇰🇵🇰🇵🇰", "ramsharasheed_": "Trust me i didnt seen any role of @reallyswara in film and this movie is hit just because of @sonamkapoor and @ kareenakapoorkhan.. hats off to both these girls love you to bits :*", "saba.qayyum88": "Shame on you👎🏻 tumhari auqat nahi pakistan k baray main bolny gi.Besharam Aurat👞👞", "abbas_naeem_khan": "It is better to keep your fucking mouth closed and let people think you are a fool than to open it.. 🖕", "khulood_jameel": "So ashamed how people here prove being a ‘Patriotic Pakistani’ by insulting her in every possible way they can. Chill guys", "hellllloooo_princess": "idiot", "b_h_u_s_h_a_n_a09": "Great work", "monkatinsta": "We love your work swara", "hafsaw._": "Lost respect for uuuu nowwww💔", "rafia3565": "You are the most pathetic and hypocrit person dont u day dare to enter Pakistan again", "hafsa_cheema": "U dont deserve to be followed, biased ignorant person, u just look at urself first before commenting on Pakistan...btw very cheap stunt for publicity n staying in headlines, very cheap mean of you..😄😄😄prayers for you complexed actress , just to grab median attention, headlines u do so..May Allah help you! RIP!", "suckka_for_da_witcha": "@reallyswara and you're just going to ignore all the heart you've hurt...is this what being a true indian means to you!! DISAPPOINTED", "hussainstaa": "Flop", "hifza786": "Sonam ki sath laga ki 5% success control nahi ho rahi that’s why she is barking like a 🐕", "mrs.shaharyar": "B.grade actress", "adnanqazi\nVerified": "Verified", "oqureshii": "I sometimes wonder... if idiots such as you, have ever gone through the trouble of researching the atrocities happening in your vast country? In addition, please take a few minutes of your futile existence to actually read up on Sharia and if which countries are and are not Sharia compliant. Also take some time to read your holy books and educate yourself ! Do yourself a favour and stop acting like an utter and complete idiot! Aur Han please apnay galaiban May jhank ker dekho before pointing fingers. The ban in Pakistan only means that your personal pay check is now further reduced than what your co stars got which irks you! Realise this ! You are insignificant! What you say hilarious! India has just found another Rakhee! Henceforth I am praying the following “Lord give us back Tupac, and take this insignificant, stupid, idiotic woman back”! You OWE me 3 minutes of me life I spent writing this post!", "explorer.abhi": "@reallyswara confused just watched #veerediweeding or some #tatti", "nuri_khan": "Was going to watch this movie... hardly watch Indian movies but thought it looked good...... until you open your ugly mouth!!!! Dumb ass", "xyas_yx": "You fucking foul mouth whore. How dare you talk about Pakistan. Go and suck your dad's wrinkly dick...fucking ugly ugly ugly SLUT!!!!", "xoxo_1437": "Guys don’t give her any importance she is dying for it . So badly that she will literally make herself look stupid just to get some attention LOL @reallyswara", "zehraahmad37": "First she got her two minutes of fame by bashing Padmaavat and now by calling Pakistan “a failing state” who even is this 😂 I was excited for this film to release in Pakistan and just as bummed when I heard it wasn’t going to but now I’m sooooo glad pakistani people won’t have to see this pathetic hypocrite on screen for an hour or two this third class actress really thinks she has the right to say whatever the hell she wants now that she has acted in one high budget film and FYI the country she just called “a failing state” is the same country where India gets a lot their favourite singers, actors and actresses from #VDWBan", "subhan_naseem": "@iyemen_kh @roha_sajjad @alihaider_98 iss bichari ki achi khasi gandi hogai hai. Comments dekho.😂😂😂", "saimakhann12": "I heard from the people of INDIA that your masturbating in this movie a d your asking why it's banned in Pakistan?! LOL maybe because they wanted to free people from your disturbing scene! And bdw I'm in the uk so I can watch this movie but I choose not to because of your existence! Your dying for the whole world to see your third class scenes! *puke* go educate yourself or sort your head out!", "tmaryyam": "Report her account", "s_789.n": "If u think ur actors....den i will spit in ur face such a sick mind lady u r...movie chala hai toh srif kareena aur sonam ki wajah se u shd goo 2 hell wid ur producer", "aisha_akhtar98": "@rheakapoor @sonamkapoor the producers of this film should really research before they pick ignorant AF cast members such as @reallyswara. India banned Pakistani actors so if Pakistan banned a film why are you crying stupid ***** she's just jealous that because Indian producers choose our actresses e.g Mahira Khan over her. # youhaveasupoortingrole not main😂😂😂😂😂", "ssyedalimuhdd": "DISAPOINTER", "maryamkhan6008": "You and your.movie should deserve to be banned because of your hate towards Pakistan.You deserve to be call a \"\"failure human being\"\".", "justalyy": "You took the term 'be different' too seriously.", "saamia.bilal": "Count my comment as a HATE COMMENT too.. if Pakistan is a failing state then you must find some similarity between yourself and Pakistan right? Both failing together? Lol. Loser. This movie doesn't help India in getting rid of it's own rape issues. Both the countries have their own issues to deal with. Who knew you anyway when you came to our country? Still got love and respect more than your own could try gave you. Now come again please so we serve you right under the SHARIAH LAW. lol! Btw Pakistan is not a STATE it's a COUNTRY.. failed student much?", "umna_anjum": "@reallyswara Failing actress talking shit to get fame", "sav__95": "Shame on you Swara!!", "ririxciv2": "#attentionseeker", "happiestprincess122": "Shitty mentality you have and India is a failing state as it bans its own films ie PADMAVAT😂😂😂a big slap on your face @reallyswara and from now on we will literally support our “sharia laws” when a Bollywood movie plays in our cinemas.....we used to love the movies but from now on we will work together and ban all these or especially all YOUR movie.....and congratulations @reallyswara you are officially kicked out of the hearts of Pakistani people and Pakistan .....get your shitty as movies to hell and they will definitely do hell😂😂😒😒", "madi.offishal": "Fuck yoursélf", "bint_hassan07": "Totally, You just lost the respect @reallyswara !!! Wat a low knowledge, degrading an country on a huge medium of networking... and telling the facts which you're not sure, just to show the movie is not ban worth!!! Jab Kamiyabi milti.. us gumaan mai itna na udhoo k... tumhray kamiyab hone ka zariyaa hi chalejaye... you better say Sorry to the people you have hurt... #FromAnIndian", "mee_inst": "Absolutely loved you in #VeereDiWedding", "ashadam_23": "So much hate swara I just want to slap you for your words", "qarib__naveed": "OH MY GOD!!! why this TALENTED actress got only 400k followers 😂😂 #attentionseeker", "mahmooda_qz": "@fatimaimmran @mahasheikh5 comments", "sehrish.saleem": "Hahah you must be very happy now that because of this stupid statement of yours, people are actually talking about you!! Because before, you were nothing. At least now you are in the limelight and that too a very shady one. Use some brains next time please, before opening your mouth!!", "dr.bismailyas": "A big Loser 😂😂😂😂😂😂😂😂😂", "mariamshahahaha": "I actually had no idea who this was until I sam Urwas response. Lol how can some unknown two faced hypocritical fool call a nation like Pakistan a ‘failing one’. You’re the failing dumbass for spitting Pakistan’s hospitality and kindness like it’s nothing. Now sit and watch while people INCLUDING your OWN criticise and hate. Have fun x", "hajrakhanofficial": "Atleast we still show your shitty films at large here .....whike you with your big industry have banned our actors", "zoya_nauman4": "It is amazing how this is your most popular post albeit filled with nothing but metaphoric chappals on yo face. Par koi nai @reallyswara publicity tau mil gai na. Badnaam jo honge tau kya naam na hoga. You are LITERALLY the embodiment of this proverb. Then this idiot goes and makes fun of the entire debacle on twitter. Jitni galiyan is ne us movie mein di hein sari isiko parhen. Even the super accomplished unfailing fans from your own country arent wording much in your favour. But logically ek side role lene wali ke chun ke fans bhi kitne koi hon ge.", "anumhafeez747": "Pakistan iz nt run by shariah law... @least fact shld b straight whn u put up an argument @reallyswara", "rahatyouso": "Ugly actress", "kabeer6602": "Failed Bitch 👎", "zoyakhan.zk123": "Educate urself!", "intehahoonmai": "PAKISTANIUN guess what? Itni attention sawara nai apni zindagi Mai nhi daikhi hogi xD. She's happy because she's successful in a scammed publicity. Inexcusable cunts", "anumfarooq89": "Will not gonna right big paras for you one word is enough \"characterless\"", "asmaaaa._": "@reallyswara gives us the example of \"jan bandar k hath naryal lagta hy to wo pagal hojata hy\". Chotay logo ko pehli br bari film mil gai. Lekin soch to akhir choti hi rahi😂", "sameen3758": "such a ugly bitch #unfollowher", "gul_muqadas": "#veereflop", "anisha_zia": "👎🏽👎🏽👎🏽👎🏽👎🏽", "_nontypicalvibe_": "Only one word for you \"Ridiculous\"", "sherbano_khann": "B class actress getting fame , sambhaaal nai saki tch tch , saari uraadi . Afsos!", "sabs_xs": "We are not a failed state okay, watch it! Bollywood doesn’t show any Pakistani movies in their cinema, so why is it such a bad thing if Pakistan decides not to show them either..", "saba_randhawa12": "Shit faces taking shit", "faiza_javed": "Just a B grade actor who tried to get 10 min fame because she was was feeling insecure of her co-actors in the movie. So proud of my censor board to ban your hypocrite face on big screen.", "hania_imtiaz": "I really thought you are a good person but what you did and talk about Pakistan is really terrible And unacceptable", "anshuman151978": "You have been a fabulous actresses though out your career so far , another gem added to you and brilliantly performed the role ... too good... well your’s and character of bhandari player by the fella rocks 😊", "ustaad_988": "The month of Ramadan is restraining me from lambasting you...you enjoy your Veere Di wedding we'll pray to Allah to keep us far away from your sharr...vocabulary ki baat hai to azmaa ke dekhlo Urdu main bhi zaleel karein ge aur Angrezi main bhi...you're a hypocrite Swara...remember when you praised Pakistan for its hospitality? Damn!! You need a reality check lady aap ki film yahan kuch khusoosi wujoohat se hai..Vulgarity,obscene and indecent scenes and false portrayal of women empowerment.Ashamed that that i was once a fan on you.", "_iamak11_": "Sunaa hy @reallyswara ka Chot oLX pe BIk raha hy. Kya ye sach hy...agar such hy ty @beingsalmankhan ko bolo ke ye Mariiii 😱😱😱", "ifraa_fatima": "@pasha.mua GIRL🔥🔥🔥", "shayanasyedi": "@reallyswara i wish i would be there in reporters i would have slapped u twice for ur shit comment", "babananadadakakalala": "Fknnn loooserrrrrrrr, do work on your mentality madam. CONGRAGULATIONS ON YOUR TWO MINS FAME. YOU LOST ALL YOUR RESPECT BITCH. PAKISTAN ZINDABAD 🇵🇰", "razaali8569": "I was a fan but am really disappointed about ur statement on Pakistan. Thank god veere di wedding didn't released in Pakistan 🙂", "noor___nawaz": "You have lost the huge amount of fans in Pakistan #disappointed", "aly_boooooo": "Bitchhhhhh @reallyswara !! Total fail and wannabe trying to fit in .. uglyyyy", "khanmimi_": "Pakistan is not a failing state. You are a failing human. Unfortunately humans like you are the reason why people around the world can never be united because YOU ARE THE FUCKING DIVDE. The next time you have the audacity to say anything about Pakistan... think twice.", "theizmakhan": "Shame on you !", "uzma.qadir1": "You’re a disgrace", "sanabahadurkhan": "1. Pakistan is the only Muslim Nuclear Country in World. 2. Pakistan has been listed among Next Eleven (N-11), the eleven countries that along with the BRICS have a high potential of becoming the world’s largest economies in the 21st century. 3. Pakistan is the land of oldest Civilization – Indus Valley and Mohenjo-Daro. 4. Pakistan is the only Muslim country after Turkey to open Combat Jobs for women. 5. The world’s largest deep sea port, Gwadar is in Pakistan. 6. The Karakoram Highway, connecting China & Pakistan, is the highest paved international road in the world. 7. Khewra Salt Mine, the second largest salt mine in the world is in Pakistan. 8. Pakistan baseball team is one victory away from qualifying for the world baseball championship. Top 20 teams play the world baseball championship. 9. World’s highest Polo ground is in Shandur Top, Pakistan at a height of 3,700 meters. 10. Tarbela Dam on the Indus River in Pakistan is the largest earth filled dam in the world and is second largest by the structural volume. 11. Pakistan has the world’s largest Irrigation System. 12. World’s youngest certified Microsoft Experts Arfa Karim and Babar Iqbal are from Pakistan. Both achieved this remarkable post at the age of 9.", "secret_virgo_": "Cheap swara failing actress @reallyswara 💩", "anfaalll__": "Thanks for insult you faced, lady. Thanks for the biggest biggest slap you had in just a day from Pakistanis who are the most enthusiastic nation and the nation which is ready to cross every limit for its religion and country. A country created in the name of religion. Stop seeking for this low standard and time being attention. And yes, we don't want your opinion to how the run government. So please. Live and Let Live.", "sumaiyamatin": "Worse vocabulary? What did you hear us say? I think you have mumbled things in your tv appearances and interviews and have us all confused because they are downright contradictory. I think when you are not articulate that is a communication problem.", "umsaif366": "Even if ur movie will free online in hd I will not see like the hypocrite person u r 👎🏻", "_beeba_29": "What a failing Human being! 😕😂 I pity you", "aanumrehman": "Kafi ho rahi hai bechari ko comments parhne k liye time to do. Haha lol sasti herion", "habiba908": "Shame on you 😰😰😰", "zara_fatima_khan": "We are not # failing state# but you are #failing actress# @reallyswara", "syedasameeera": "Dont spreading haterism but you have to apologetic for your hypocrisy. I saw your plenty of interviews where you say things so purposely and get the attention. I saw your those tactics in some interviews where you are blaming indian media capturing your wrong angle and zoomed dress revealing pictures and taunting them for their work. You really need to stop this", "faryafia": "Worst actress with worst mentalty", "mahehehee": "Such a parhi likhi Jahil you are!!!. Please educate yourself. :)", "hasaanfasi__": "She is the biggest HYPOCRITE she comes on our television a few years ago says she has gotten so much love blah blah blah! Now she calls Pakistan a “ failing state”. First of all Pakistan is clearly not failing! It is standing high at a time where almost all the world is against it!🇵🇰🇵🇰🇵🇰 Sharia laws! Yes u are right it is led by sharia laws and that’s not a bad thing! Lastly Pakistan’s audience can not accept that type of vulgarity and disgust that ur film has shown! So it was banned! Also I wanna add ji it’s a women empowerment movie, women empowerment movie, an women empowerment movie. If this was about desi women y was their so much western style in this movie! A lot of it felt like they tried to mix western style! Women empowerment could be done or 2 female friend type of film could have been done in a cleaner way! It’s a fact, most women are not like that in India and in Pakistan! Women are like in the west mostly! 🇵🇰🇵🇰 Plz learn to respect other nations! #proudpakistani #pakistan💚", "nashmiyaaa": "You little bitch!", "hria.s": "@reallyswara damn, chawli hi mari hai. Abh tu baita agli 100 filmain ban aapi.", "iamrabiamughal": "B grade actress 👎", "mariumkhalill": "Never really heard of you ever, what little we saw of you on television because of this movie, glad to know that it's banned here! Educate your mind and heart before spilling hatred through your mouth about our beloved country. Talk about failing, failure runs in your blood, since you still need to educate people in cities of India who still blindly follow this culture of burning their wives after the death of their husbands. Hope to never see your face again! Shows on your face how little knowledge you have of speaking the right stuff when it comes to television!", "ammwajih": "@reallyswara u r so over excited for being in a film that has A list stars in it .... that u just say whatever filth comes to ur mouth.... u should talk some sense 👺", "khudijamoola": "@reallyswara wats up with the contradicting statements u made abt Pakistan ..... uncool very uncool.... this may cause ppl to boycott ur movie", "mmffbuzz": "People like her give fake statements because they take 10-20 thousand from political parties . Artist should not spread hate . She has done her part , she is as cheap as looks .", "needa_umair": "u need to issue an apology for ur uninformed views and just stick to acting!", "_skhan_47": "G", "somimua123": "Use to be a fan not any more ... very disappointed with your statement 👎", "shumaaylaa": "👌👏", "zeenat.rida": "So you a 2nd class actress who you are to decide whether our country is a failing state or not...", "kylie_vibes_23": "I am a Pakistani living in the UK and I wanted to watch your movie but not after hearing your interview and by the way Pakistan is not a failing state it's an amazing place 🇵🇰", "kausar_mir": "Really liked you but then saw that interview ! Disappointed and saddened by your words! What happened ?! #unfollow #arkward l", "dekh.beta": "Swara you recieved 4390 comments. Itna fame kaafi ha na ya abhi thand nahe paari ? 🤷‍♂️😂 @reallyswara", "snowviaaa": "Despite everything you have said , we PAKISTANIS invite you to this so called failing state so you can come and examine all the sharia laws yourself , at least you’ll get your facts damn straight this time.", "i._naqsh": "Hey lady educate yourself first. Don't misjudge us we welcomed you with open arms bcz that's what our culture thought us.tm jaisy log hi hoty hain jo apny country ka naam khrb krty bloddy hypocrite Aukat ma rhna seekh lain ''JANAB\". AND FOR YOUR INFORMATION we don't want our fun time to be ruled by vulgarity.", "queenmydishesplz11": "@reallyswara is the Lena Dunham of Bollywood. Lackluster and unpleasant looking creature who is desperate for attention and validation and tries to get away with t under the guise of feminism.", "zkallures": "shutuppppp!!!", "deactivateaccount0001": "Really swarabakwasar", "thevartikasoni": "Amazing movie 😍 and my favourite character was obviously you..one of the finest actor in the industry..love❤❤", "_fizzarizvi": "@reallyswara what do you think of your self bitch???", "eishaabbasi_official": "Lets report this account because she is spreading hate", "ayeshaqzi": "fazool bakwas over aged aunty", "marium_zkh": "What love and encouragement she is talking about 😂 galia parr rhi hain @sidra12sd", "imadsyusuf": "I think just like how you're wasted in the movie you are in real life too. Please don't get on your knees and beg for your movie to release in Pakistan by making ridiculous statements. Your movie is a flop in India figure that out first idiot.", "zainababbas._": "Congratulations @reallyswara everyone hates you :)", "faiza.h.a": "Wow I just realised you exist, you absolute waste of space!!! Finally got your 5 mins worth of fame hey? 👏👏 , you label Pakistan a failed state, let alone a failed actress you ignorant, contradicting moron you are a failed human being!! Your shallowness just mirrors your trueself! Defamation to the platform your trying to stand firm on, shame on you!", "yako96": "Watching brown animal porn Chances are greater than to watch Swara Bhaskar getting herself off in the movie. & to be very honest , I don’t blame her at all , when you’re working with actors like Kareena & Sonam , its very important that you find a way to steal the lime light from them , which is not an easy task & in her case , she could not achieve that state without the act she did , i’m 21 & i have seen what like thousands of bollywood movies , i have never seen her work & now half the country is talking about her , she succeeded in getting the light. & thats human nature , your grace & your character comes out when you’re given the right to speak , and you spoil it that way , clearly shows how much character she has. & she is talking about shariah laws where as in her country you’re slaughtered for eating cow meat , their president ordered the mass slaughter of 2000 muslims back in babri masjid attack. & for the people who hired her to do this movie , talking about sex , abusing , drinks & drugs for girls is not the kind of feminism women want in this world i’m very sure , she can literally be the leader of a chameleon gang.", "alisidra87": "@reallyswara do you really think using controversial comments on Pakistan will make you famous in front of your costars @sonamkapoor and kareena kapoor???? No it will make people hate you and it really has put me off watching #veeradiwedding ... let’s see how far you go because people will only remember you for your disgusting comments on our beloved country rather than your crap acting skills #ban #veeradiwedding", "raz._.khan": "I'm so glad that your movie is banned in Pakistan. Oh sorry! Apka tau waise bhi side role hai. And don't even go to \" worst vocabulary \",the whole world knows k kis mulk ki \" worst vocabulary \" hai. And you know what? By just saying all this stuff, you just failed as an actress or I might say \" a failing actress \"? Educate yourself girl. #Hypocrites", "rehamafzalkhan": "@aymen.i.khan @sahar_j18 i love how everyone’s roasting her here. 😂", "taurian_sab": "watched the movie yesterday and I must say amazing acting @reallyswara mam Kareena mam, Shikha mam and @sonamkapoor I'm almost on the verge of becoming a lawyer and seeing you a professional has given me an inspiration and the decision you made of not getting married atleast but you all exploring lives with friends... really nice movie and all the best to you for future endeavours 😘😘😘😘", "modeststylewardrobe": "When you were saying all this nonsense I could see Karina and Sonams expressions that they realised that they have worked with seriously uneducated individual . India is secular State in your dreams hun wake up girl .", "sena.25": "Who the hell even are u?!! Miss no-body!! Get a life!", "xhajra.n": "@daniya.a @wania.s_ the comments woww", "tinakanwar786": "You nailed this role absolutely ......💕@reallyswara", "sannykhan_mughal": "who are u calling our country like this u failure actress #reallyswara no buddy want to cast u in there films and then #sonumkapoor did that mistake u fly in the air now shame on u we #pakistanipeople respect u before that and now hates u after that stupid comments", "almaha_iqbal": "Why are we giving attention to her statement. failed looser side heroine.", "__nim__ra__": "🤮🤮🤮", "abraham_anas": "Report her account guys for her shitty behavior :)", "hanzla_khurshid": "Hi!! @reallyswara sorry but no sorry... you are actually ullli ki pathiii. Bye 👋", "coco_planet1": "Get a life you silly thing you talking about Pakistan a failing state first think about yourself you are nothing . First educate your self then talk about our country. Your statement shows your third class mentality in front of every one and btw you should say thanks to pakistan 🇵🇰 by taking its name you get a bit attention #poorswarabaskar ✋️@reallyswara #uneducatedwomen", "imsaad26": "@reallyswara heye swara how are you, well whoever you are but let me tell you that you are piece of shit. Thanks.", "awwmara": "She needs to #apologize", "emann_122": "You’re so pathetic! Get your facts straight then speak thanks", "isbafroze": "F (failure / flop) class actor lol whatta bitch! 😂😂", "khadijairfann": "bitchhh", "_sb016": "Everyone should just unfollow this girl. She has no right to say something against a country like that I mean no one does! This was a taste of fame that does to her!! She should be ashamed of her self. @reallyswara you need to keep ur mouth shut and keep ur negativity to urself honestly!! ✌🏽✌🏽", "rudaba_ahmed": "Pakistaniyon ne tou tumain jab izzat di thi jab koi janta bhi nhi tha tumain aur bolti thi Lahore jesa koi city nhi ab eik movie ko thura naam mil jai tou socha Pakistan ko bol dety hain wese tou movie main kareena aur sonam kapoor hi bare nam 😂", "daffodilss_": "#shameonswarabhaskar", "fizzzzzzz77": "Can anyone tell me Who she is @reallyswara never seen her before 🤔🤔", "samarr.jm": "“Falling state”??? More like a falling actress who is seeking for attention. Educate yourself before talking trash about a country you know nothing about.", "blogsbykomalfaizan": "Well played . Just when we thought you were one of the very very very few of people who actually love Pakistan and Pakistanis and showed immense respect like Sir Om puri, but boy were we wrong or what ? ... Anyways congratulations on being a true Indian though and also continuing the hypocrisy trend. Shows the true side. #hipocrisygamestronggirl And also before saying such things be thankful that this *failed state* has bathrooms to flush your dump and your shiity thinking . PAKISTAN ZINDABAD.", "saba_jamshedkhan": "Shame on your self .... we are so proud of our pakistani goverment that they banned your movie because you deserve this ...we were also not happy by banning veere the wedding but now we got to know that there was a reason behind this decision...", "sanarizvi_": "loser!", "alizeh.asad": "Everything is ugly about you @reallyswara", "x_saam_o": "Cheap Publicity!! I Must Say When You Were In Pakistan You Were Behaving Like There Is No Country Better Than Pak Nd Now When Your Cheap Movie Is Banned You Forget All The Good Things About Pakistan and you called Pakistan as a failing state !! Jis Thaali Mein Khaya Ussi Mein Potty 💩 @iblushiyaa", "ramsha_sf": "Is there a way to dislike this post?", "jazmehraj": "@reallyswara yeah bollywood was forced to change padmavati to padmavat and you call Pakistan a failed state alteast they are proud abt wht they do and having vulgar dialogues doesn't glorify women empowerment and you are a Hindu don't dare to speak about islam as we muslims can't talk about your religion freely as india is not democratic country now by any ways.so you want to run nude it is your wish but not of others.", "khan_uzair78": "@reallyswara Before this movie I have never heard of you! The only reason you are even acknowledged is because, you are a side actress to Kareena Kapoor and Sonam Kapoor! If you were solely in this movie and it was at cinemas no one would even turn up to watch it! Why do you think they gave you the most disgusting role in the film? Because the other actress have class and the film makers knew you would stoop to any level for fame and money just the way you have dropped so low to call my country a \"failing state\", and for you info Pakistan is not governed by a \"sharia law\" check your facts before opening your mouth! I live in the UK and i have many indian friends and even they were disgusted by your horrible thoughts! Non of us will watch this film because of you! Enjoy your 5 min fame b##ch!", "by_ainna": "No doubt you are “dramebaaz” and a bitch too ! Whoops 😬", "aleena_sultannn": "Who encouraged u baii? Tell me this first? We pakistanis don't encourage chutiyaasss @reallyswara", "eimanmaryam26": "PATHETIC D GRADE INDIAN ACTRESS! YOU ARE FAILED AS AN ACTRESS!", "mayaismylife": "Roti roti na wapis jana", "ourstory_bh": "Bollywood have only one topic in their country and the topic is #pakistan 😂😂😂😂 #ripbollywood", "nafeesaneelam": "Wow you really are a dickhead. Fucking twat. @reallyswara", "sana_waseem_": "Third class actress ! 😷 ! Axha hua is ki third Class movie banned hogyi ! Flop actress ! Na shakl h na akal h 😕😕😕", "bne39": "Don’t throw stones when you live in a glass house!", "minaal_saleem": "You dont deserve any love", "zarishstyles": "khunjri", "mahamthepoet": "you’re a bitch.", "batoolamna": "Well you could've used your two minutes of Fame in a better and less idiotic way but then again what can anybody expect from an ignorant and double faced person like you! #whocaresaboutyou? #pakistanzindabad #dontwanttoseeyourmovie #goodriddance #shameonyou", "inzi224": "Since you're utter liberal, incest must be your favorite thing, no?", "not___avaliable___000": "Shame on u", "reema___aali": "Tch tch such a lame publicity stunt !!shame on such failed actress.she needs to be more politically correct .bechari 2 minutes fame has got in her head.no body wanted to see that movie coz of her anyway she seemed over shadowed by other big actresses who remained poise n silent while she was barking lol.flop actress n her cheap tactics", "laila_ldn_": "How old is she? Then all aunties can get into acting", "_itsme_anas": "Guyz Report This Unty... 😂😂thnks Indian bros i know even you guyz dont like this Double face unty... Lets Report her...", "minahil_887": "Tbh is movie mai sirf @kareena_kapoorkhan kam ke actress hai yeh dusri @sonamkapoor @reallyswara tum kis khate ke moli ho? Naah shakal hai or nahh hi aqal you cheapster creepy Anutie so remember our beloved Quaid quote “there is no power on earth that can undo Pakistan 🇵🇰 “", "mishii_khan": "Legit the most comments she’s ever received!! 😂😂 Too bad they’re hate comments which COULD have been appreciation comments of love, support and encouragement from fans across the border if she hadn’t been a racist, bigoted, uninformed mule and kept her hypocritical, ignorant views to herself!! Such a shame that you decided to spread hatred when you have the platform and ability to spread peace and love. I was seriously becoming a fan and wanted to watch the film to see more of you. I thought you looked incredible and acted amazingly too but you screwed all that up for yourself. 🤷🏻‍♀️ Also, being from a country where your OWN films are protested to be banned and death / rape threats are publicly issued to female stars who go against any cultural or religious norms, I’d think twice before calling any other nation a “failing state”", "sam123gkxfbb": "Hypocrite", "emaneyyy_": "Really nigga? We all hardly know you as an actress and you are here telling us the state of our own country? Go get a life first and then come up and have the guts to talk ....", "sumbelina": "Pakistan’s not a failed state. Stupid response to the question.", "shizshaikh": "Looks who is talking against my country Pakistan. Jiski apni koi identity nahi. Lol . We were very sad k we can't see veere in cinemas now. But now Every one is happy. Jis movie men tum jesi LS actress hon usko toh ban hi karna chahye. Do not say a single word against Our country. Failure state toh tumhara he jahan rape ratio aur extremism political parties tum logon ki apni movies par tum logon ko janse maarne par ajati hen.aur tum actors apne gharon men chupe phirte ho. You psycho. Apna jake ilaj karwao", "___fcs___": "Btw the American DJ Diplo (who is much more famous than you) went to Pakistan and seemed to have enjoyed it", "fatimaraoo": "Esko or kahin koi importance mil nahi rahi thi so she talked bad about Pakistan agae highlights mai chahy bad publicity he sahi stop giving her attention all of you this is what she needs.let her bark whatever she want.she knows she is a loser👎🏻", "fatimazr6": "Tum apnay kapre bhi utar do, tab bhi tumay koi ek jhalak dekhna na pasnd karey! No one wants u failing Aurat", "tiah_waqas": "How can u pass such comment on shariah law?? Do u know even a single thing about shariah... Its shariah which allows every religion to dwell peacefully in pakistan otherwise people would have been killed here as well on eating specific kind of food", "movieliness28": "Well seriously @reallyswara Pakistan is a failing state? In 2015 you visited Pakistan and the people of Pakistan welcomed you with respect and love. Agar yaad nahi toh apna khud ka Interview dekh lo. Pakistan is not a ‘failing state’ just like India by banning Padmavat. Thank God that shitty# Veere de wedding is banned because every single thing happens for a reason. Mere behan sab se phele apne payaari state #India ko khud dekho phir kase ke state ke baare mein comment karna. At least hum religion ke naam par masoom logon ko maarte nahi hai. Well no personal act but just look at yourself. Your such an arrogant, hypocrite, selfish human being. Well this failing state had produced such an amazing artists. And Pakistan never copied songs and movie scenes from other Hollywood movies and songs from Pakistan. Nothing Original. Poor acting skills no talent and so attitude. Shame on you. Hum ne Dushman ko dost banya lakin Dushman toh Dushman he hota hai. Pakistan is fifth largest market for Bollywood movies. Get some sense you moron. #Pakistan Zindabad.", "ruhisyed12": "That 3 -second fame got hard to her head ! SHE IS SUCH A FLOP lmao!!!", "taabi_bash": "anty g anty g tum koi janta tak nhe ta", "eman_ilyas7773": "Behan g Apki Apnay mulk May ni izzat baki kaha ho gi? I feel really bad for you", "m_alii35": "@suaira_mohd", "_aisshaaa_": "Well, what can you except more from a person who didn't gain even bit publicity by doing vulgarity in the movie & now using all lame tricks for the same reason. 🙌🏿", "omar_anwaar_": "U SHOULD DIE IN A SINK HOLE.", "annie0900": "Teri shakal nhi hai actor banny ki apni aukat mai reh", "unmole123": "You are such a hypocrite and failed actress. Who gave you the right to comment on our country and make false accusations. i was really looking forward to watch the movie but now i am definitely not going along with my whole pakistani community.", "proud.aadeez": "He is trying to get famous . She needs FAM", "raaaahas_18": "Your comments on Pakistan, sharia law etc... is the reason i will be boycotting this movie all the way in U.S. #shameonyou #educateyourself @reallyswara", "asma.555": "All I knew about Swara before was that she was the ugly girl from prem ratan Dhan payo. Now she thinks she’s someone special. Just because she licking sonam and kareena’s a@se thinking she’s their best friend and can’t get away with saying cr@p. She’ll be soon forgotten. If she reckons, she’ll get more work because Of her ignorant comments, she is highly mistaken", "blogbyshiz": "We gave you all the respect & love (which you don’t even deserve)when your indians didn’t even know about your ‘failing existence’ stick to one statement about Pakistan.! Your Instagram handle is my exact question REALLY SWARA? think twice before speaking any shit about our country. Your freakin statement doesn’t make our country a failing country but yeah it shows your *failing soul* BOY BYE.!👋🏻", "sidra12sd": "@marium_zkh comments mai Pakistanis n class leli sahe ki failed actress ki😂😂😂😂👏👏👏👏👏", "aqsa_shaykh": "@maqbool_sahar I guess she has totally lost her mind due to the success of VDW which is ofcourse because of Kareena and Sonam. This microcepha-lic slut @reallyswara needs to be killed but hey wait she is already dead infront of millions now.", "sarahtariqq": "Hamesha side roles mai anay wali ik C listed actor sy aur kia omeed lagai insan", "parikhanjutt2": "When u came in our country kia hum na kuch bola tha nai so how u can say this", "heyits_hareem": "I am so glad...movie got a BAN! it should be banned all over the world! Such a hypocrite you are....thumps down to you for the rest of your live and please garbage dont come to Pakistan Again 😑😑😑😑", "anadil.bhatti": "@ruba_syed check this out 4000 lol jahan 8 comments b nhn hotay thay ab dekh😂😂😂", "behold_shaz": "& who are you again ? Never heard of you before 😂 and the only reason why people know you now is cos your illiterate ass made a irrelevant comment about a whole nation to which your name is connected to now 😂 Pakistan is not a failed state but you sure are a failed flop actress and person 😘", "haaya_rizvi": "You are dividing two countries more than they already have. Glad the movie was banned. You may look educated but your ignorance speaks otherwise. Theres a lot of issues in your country that you need to worry about before mocking another country. Educate yourself before speaking. Never heard of you until you spoke some ignorant words for Pakistan. And the only reason I wanted to watch Veere di Wedding was because of Kareena. Not that too anymore. Youre losing your fan base before even building one.", "__ayraaa_": "@areeba_rauf_khan Im loving the comments here,enjoy yourself too", "nevea.mind": "you should die now. chutiya", "hanna.jaffery": "Darling no one knew you existed till you spoke bad of Pakistan. C grade actress", "anumashrafkhan1986": "Such a shame on you @reallyswara for calling Pakistan a \"Failing state\" tere jaisi ko muuun lagatay hue banda 10 dafa sochta hai 😀 #attentionseeker #kareenadijuttihaitu", "biaranjha30": "@reallyswara Pakistan is the country which gives massive respect to everyone that is the reason you b class heroine came here and was treated perfectlyyy which u didnt got ever in your own country ....Pakistan will continue doinggg thiss because everyone is not two faced like you.... u got first movie with better star cast that is not becoz of u plzz open ur mind that is becoz of Kareena & Sonam no one is going in theatres to see u 😂... u cant get fame by doing this kind of comments plz i think u should focus on ur careeer rather than our Country and its laws .", "rabs_m_": "D list", "anum_shk": "The comment on this post shows that Pakistan is not a failing state and you need to think before you speak !! You are a failing actor a fail human being who just destroyed her reputation you could have used kind words and stay poised like other co stars but no you had to say mean things. You are at loss not us !! So glad about the ban on this movie which I was really excited before", "saema.mahmood": "Who are you to tell Who is failing or not! Its you,Who are failed actress! Shame! I am so glad i Get to read this so i Dnt watch the movie. Get a life And try to focus on doing something Good for the world ! pakistan zindabad!", "afghan_abroad": "Everyone is commenting about \"India and Pakistan\" and I don't know whats even happening? 😅", "nikki_jahan": "Your are truly an embarrassment to your country!!!! Good way of becoming famous I guess as you never seemed to have any attention before this ridiculous statement!", "sayabeera": "Why can't people like you just shut their fucking mouths ?! Jab kuch pata na ho bolty q ho bhae? How easily you called Pakistan a failing state? You though no one would raise their voice after the disgusting things you said about our country. What do you know about Pakistan ?! I used to respect you a lot but now I guess a person like you ( hypocrite) doesn't even deserve a bit of it. And yeah don't bark jab kuch pata na ho. Acting to ati nahi but atleast educate yourself! Get a life. SNAKE!", "nz.27x": "Rip your career 💀💀", "sammi.xii": "What u said was extremely unacceptable and wrong", "i_sakshi7": "U actually nailed it Gurll.... LOVE", "nay.kdotbye": "ameer in the film, gareeb at heart 👎👎", "unbardashtable": "Are you making yourself feel better by posting these unnecessary comments from other people? You seem to be too desperate hunting for appraisals yet havin a potty mouth opening anywhere, anytime and at anyone. 😂😂😂 FYI, The Kapoor girls had the whole movie running sweetheart... just because you got swept away with their fame DOES NOT MEAN YOU ARE A HIT ACTRESS. I am SO GLAD THAT THE MOVIE WAS BANNED AND LET IT “YOU” BE THE REASON NOW. Btw, do go back to school. You NEED to educate yourself. YOU HAVE FAILED IN EVERYTHING. NOW WE KNOW YOU ARE NOT EVEN BEAUTY CUZ WE’VE SEEN THE BRAINS WHICH IS NOWHERE TO BE FOUND. #SillyGirl @reallyswara BTW, WAS IT A CHEAP TACTIC TO GAIN ATTENTION?? 🤔🤔", "ayeshatahir24": "Stupid B grade woman", "xtyyb": "GUYS DROP A SNAKE 🐍 IF SWARA IS ONE", "deaddzone": "Third class actress with third class thoughts...... Thanks to the govt the film is banned ...... And another thing your opinion doesn't matter ... Pakistan has a lot of hatter... Shame on you", "isairaabbasi": "@reallyswara Do you even know the definitions of failing state and Shariah Law?? Such an ill informed \"just another woman\" you are. Plz correct urself and dn be cause of embarrassment for ur co stars such as @kareenafc and Sonam Kapoor.", "n4dia.elahi": "I was downright furious seeing her two self contradictory interviews.. 1st when she was Pakistan. Praising Lahore was better than London Paris . 2nd full of hatred for Pakistan.. when the movie she's worked in got banned here . Seems like she's getting served well on Twitter now 😂 loser", "emaansgram": "You have no shame. I’m so glad this movie has been banned here. And honey, before this ‘hit’ movie, you yourself were unsuccessful and a ‘failed actress’ and tbh, you still are to me. Get your facts straight before pinpointing on my country, bitch. Hypocrisy ki bi had kerdi hai tumnay. Slow claps", "glowwithmariam": "Two faced woman", "maryamx_011": "So muxh for love for u from pakistan still ❤ we are not like you @reallyswara", "lubnatahir": "I was planning to watch it but sorry @sonamkapoor I like you but due to @reallyswara Comments on my country I am not watching it anymore. Failing state, sharia law and worse vocabulary words used in your interview clearly show that you have fed by the media lies. Such an ignorance you showed. For your kind info No country in the world right now has a sharia law. Nuclear power and failing state what kind of low stander nasha do you do. Worse vocabulary your films and songs only survive on our language that’s enough to tell the beauty of our vocabulary.", "sana.s.atif": "@reallyswara i am amazed what u have said just a little suggestion.do a search on ur falling state where people from different religion cant live with freedom.where you people admire our artist alot n ur government banned them.we are prod that we follow the shariah law.film n real life has some difference.here still women not spit out shit from their mouth openly.we know how to talk n where to talk.i just know u with this shit what u have said otherwise there is nothing special in u.n if the film get hit it will because of kareena and sonam not u.", "mohammad912ali": "You talking about Pakistan is a failed state country you know what is the official state is your pussy that is what is fin nobody’s going to fuck your pussy you stupid dumb bitch stupid Indians piece of shit no I have respect even to talk like your pussy and like yourself fucking whore Indian stupid bitch", "ahmeds_nayab": "LOL 😂", "heavenwondergirl": "F*ck", "mah_ali_khan": "Hate u😄😄😄😄", "ggzehra": "LOSER LOSER LOSER", "javeriyahaly": "You know nothing about Pakistan go and get yourself educate you have no right to say any country a failing state ! This shows how illitrate you are 👎", "zainabkhan1488": "@reallyswara (pakistan is a failing state ) but u r a faliure actually na ap ka koi future hai film industry me r koi career na shakal na aqal rna e insaniyat ... so focus on yourself 1st then say anything about others flop actress i must say flop ourat", "miss__mystic_falls": "You were the best in all 😍❤️ #veerediwedding Loved ur character and uh!! ⭐️", "vareesham": "Seriously u should be ashamed of yourself for what u said about Pakistan", "wiishk": "@reallyswara @pasha_mua couldn’t have said any better 👏", "iqra_zia_noore": "You can never go to the level of kareena and sonam so keep your failing comments to yourself you clearly dont have mind . #giverespectgetrespect", "diju18": "looser you're like shit 💩💩💩", "iman.bakhsh": "You fucking Indian trashy cunt", "ashtheduke": "What does veere di mean?", "xx.hets.xx": "Your acting is mind-blowing in this film.. Kickass performer Hilariously done❤️🙌🙌👌❤️", "96colorss": "Agly with ass face", "sincerlynaima": "Neither am I Pakistani nor Indian but it was really disgusting of you to come for sharia law just like that. ....many countries are ran by sharia law but neither are your films banned there nor are other films. ....We Muslims follow sharia law but we still live our lives to the fullest and watch plus listen to whatever we want to. ....your insult was not just for Pakistan but you also came for every sharia governed countries as well as every sharia law following person. ......quite disappointed in you....For also putting a whole country like Pakistan down and calling it a falling state.........✌", "ajaan16": "Reading the comments make me so proud of ma fellow Pakistanis for standing up for their country🇵🇰🇵🇰🇵🇰💚💚💚and for whts right. Whatever nonsense she’s said shows her mentality...#pathetic", "iman8191": "Haha loving all the comments from my Pakistani Shers here. Reallyswara?? Was this the only way to gain attention. Were Kareena and Sonam over shadowing a 3rd class C category actress? My sympathies with you for pulling this cheap publicity stunt and yes go see a dr. and tell him your body is acting up and all the shit is coming out the wrong way.", "mahnoor_alyaan": "You disgust me!! 🤮", "yumnadar": "People like you really need to be groomed before stepping in to the industry and becoming a public figure. You being a celebrity should spread love not hatred like this. You have given so many Pakistanis and other people as well, to detest you because of your two contradictory interviews. Kudos to you for trying to create more rifts between the two nations! And for the record. We have a a very very good vocabulary!", "junaid_asghar1": "Hey bitch you have two faces,, herein Pakistan you are totally in love with our hospitality and when went back in India u are saying blah blah disgusting, 😠😡", "syedashakil": "Failing actress😂😂🖕", "_hakunamatata7_": "Heyyyy Bitch !! I mean firstly i wouldnt like to post a comment on your cheap photos ! But if its about pakistan then let me tell you ! Pakistan in the most beautiful contry og the world !! Par jab say kkuttti tu ho k gai hay tab say thora ganda o gya hay ! Teray gand say ! Movie main b gand philaya huwa hay twitter pay b ! I mean trillion of shit on your existence ! I think you should die till now itni beizti k bad but ooops beizti apki nop beizti to unki hoti jinki izat ho😂😂😂😂 well A slutery bitch Come im front of us and then talk ! Then i will tell you that what is pakistan and what are pakistanis ! You low life ! #GoAndFuckYourself and the die plz 😂😂😂 bcx neither pakistani nor indiana like you and enjoy your existence cos you are such an ass 😂😂😂😂", "mainkuin": "Out of the box look. 👌", "himaniverma30": "Luved ur performance in the movie..u were awesome..", "aamerdaniya": "Pathetic words from a failed actress and failing human being about a topic she has absolutely no knowledge of... But I guess the novelty of doing promotions and shows (even for an over-hyped, over-rated and frankly very forgettable film) can get to one's thick head💁", "dija.sh": "Bitch got it bad - two faced cunt.", "michellejamshed": "You don't deserve to be in @vdwthefilm . I wounder what @rheakapoor thought of giving this girl a chance. And.. you are failing now!", "iayeshahanif": "Double standard flop actress.. acha huwa movie bann hui hy Pakistan zindabad", "haffsaah": "She’s thanking for the love in her caption. SLOW CLAPS! You must not talk about about love again 😂 @reallyswara “failing state” lol. You would surely be regretting", "harmony_twice": "To like or dislike,to voice out or not is her personal choice.. people who are slamming her for her dual statement should get a life, it's life and it's unpredictable, opinion changes relax people.... And the scene is the just a character .. c'mon get over it... @reallyswara You go girl.. your boldness inspires many.. keep Rocking 😘😘😘", "aishakhurram": "@reallyswara you’re a disgrace! And your face is a failed state!!!! Had been looking fwd to watching the movie, now will it make it a point not to! Our actors and actresses never stoop as low as you have! I hope this is all the publicity you were looking for! Imbecile!", "sidoorajpoot": "We people have really appreciate your work n call it that most underrated actress but now I know y r still struggling to get the main role ... #failingactress #attentionseeker", "cupcakerylolas": "Hi all! You do know can report her for being racist?! I think everyone should report her for being racist to Instagram right now? Did you not all see what happened to Roseanne? Roseanne got her show cancelled in the US for being a racist! Disappointed herself and her coworkers.", "sidradea": "Side kick b class actress", "swapnil_xy__": "Osm", "shailz001": "\" swara pehli bar amir bani hai kisi flim mai, usse bardash nahi ho paya amirpan. \" 😂😂", "_areejkhawaja": "That “Draamebaaz” part in your bio is definitely on point 💯 #IgnorantBitch", "maxthebest685": "You are a Worst person and Definetly not a Indian. Not Going to See movie just bcz of you.", "rickyjimini": "I am not a pakistani but I am ashamed of what u hv done.. I started liking u swara but after this I am going to hate u.. I was super excited for the movie but sorry now I wont watch it either..", "sid_ali9": "@adeel5415 get the popcorns😂 ye to na ghar ki rahi na ghaat ki 😂", "anshumaanmajumder": "Jaha dekho pagal bhare hai social media me", "reshuforyou05": "koi love and encouragement nahi hai. indirectly sab le rahe h apki!", "ayeshaa.zubair": "Manhus aurat", "saira0987": "Motti bhanzz 😆", "__its_shaahiidaaa_x_": "You're lame & no one likes you! Loser 😂 😂 😂", "humzah_don": "DUMBO", "nimziee_": "1 movie mai sahi role kya mil gya sr pr chr gai h 😂 😂 such a low mentality bitch.", "aafi_a": "You suck!", "iqrasajidtarrar": "You're an insult to the human race. Hope you get well soon", "dr.zaleenarbab": "When I am bored these days I remind my self of swara and her interview.then I happily write \"I am so sorry but you're such an iDIOT\" and I am all well.thats how much we are missing you swara these days :) WOW you look ameer and popular now. @reallyswara@sonamkapoor kapoor", "saragullzaib": "@reallyswara i am Really happy that ur shit has banned in pakistan, failing state me movie ban honay pe itna ghusa lol get a life u failure 💩", "saharazeem": "I'm not gonna go on a hate comment, but seriously I really pray your perception about \"Pakistani state\" changes since we were as excited about your film as your fans in India; just next time be a little more patient while making comment about a country ❤ -Proud Pakistani right here girl", "saeedarizvii": "No wonder why this movie was banned in Pakistan. How do you like the hate anyways??", "spowpowspw": "SWARA BHASKER BEGHARAIT STUPID BITCH", "chill2948": "Chote bartan mein zyada dal diya, she can't handle it 🤨", "marriam_amin": "*Sending virtual laanat from Pakistan*. You’re a sick, ignorant human being and definitely a failing actress!", "salmanrajpoot": "Failing state ? Now you see how Pakistanies love their country. Oh i also remember you liked Pakistan on your last visit!! Yes, we love it too and that makes our Pakistan a lively, loving and progressing state ... lol women get your facts right next time :) and weigh your words next time bofore you spit them in the air upwords so they will not fell on your own face :) chao!", "msz_ijaz": "@reallyswara Okay so I think I need to let this out. #swarabhasker. Well played. I’m sure about 80% of the people talking about you right now did not even know you existed till yesterday. You have managed to put your name on the radar so to speak. Hot off the so called ‘success’ of your recent movie you managed to offend one of her biggest audiences your movies have. Don’t let this short lived fame get to your head sweetheart. Fame is fickle. Think about your words in a Pakistani TV show not so long ago. So you’re suddenly doing a 360 because you think you’re a ‘somebody’ or a mainstream actor. Becoming a big name is not about one hit movie. It’s about poise. It’s about speaking the truth. It’s about knowing your facts. It’s about not cashing in on some sasti shuhrat by belittling a nation. That’s the difference between you and your mainstream co-stars Sonam and Kareena (see how they kept quiet), also you should practice that-keeping your mouth shut when you’re facts are not clear- it’s a handy trait.I hope someday you can reach that level of elegance. For now you’re a B grade actress parading in borrowed feathers (or Gucci) If any more of your films keep getting banned in Pakistan. (Pakistan is one of the largest audiences for Bollywood movies).Think about the impact on your producers and your career in turn. I hope you learn your lesson real quick and think twice about going into a bigoted,thoughtless, ignorant and downright stupid rant about a nation. P.s I hope my vocabulary wasn’t ‘much worst ‘ than you.", "garvitajeswani": "Loved you in vdw❤️", "_amnaariff": "Miss swara bhaskar for your kind of information youre still a side role and youre not even professional and nobody wants to listen to your opinions about pakistan i bet you don't even know much about your country india, where sick pedos and low mentality people are living xD and by the way you said #vdw is a women empowerment movie, too bad your state is a failing state in this case too i hope you know india is still a place where women are killed without any reason just bcs *aurat zaaat* hai.lol if you have opinions about our country dw we'll give you better opinions about yours...and your acting too.. No offense xD and just by the way its quiet clear people preferred to watch this movie #vdw only because of kareena kapoor khan she has got professionalism and class and if she hasn't said anything bad about any country i think you still need to work hard to get to that point which i guess a bitter person like you will never reach.", "ppk1806": "For the first time ever I have no problem with whatever Pakistanis have posted here. Keep commenting we don't like her either 😂", "phirleaayadil": "yeh sab bakwas karengey @reallyswara don't worry you are champ i love you and I love all your movies 🌋🦄💥🌸", "khadijhaazhar": "Hypocrite!", "abeeeha.kh": "Guys she's just an attention seeker with no self respect ....so u don't have to waste your time on this creature", "nyda_khan": "I am pakistani and i regret watching this movie in cinema, dnt worry babe i as a pakistani will make sure that i dnt wat h any of ur movies in cinema. #suchashameur", "_1kainat": "@reallyswara LoL I can See in interview how you totally lost yourself double Face idiot 😒 Such a Shameful Mentality You Have Go Get A Life Shit 💣 Pak Zindabad 🇵🇰", "mianfaisal.01": "You bitch you will never know about how Pakistan is beautiful cus u are a bull shit. U only think negative thoughts about Pakistan..", "abihahasnain": "You’re a sick, uneducated and low life person. :)", "lowkeymaniha_": "Bitch", "sabamajeedkhan": "Pathetic mental state of yours. Cheapest stunt to gain attention! Pukes*talk on substance lady not like those star plus dramas chichorapan please @reallyswara I wish my upbringing taught me such hate and crap you had put to for Pakistan. GET A LIFE!!", "quratsharif": "Glad Pakistan is saved from seeing your pathetic scenes in ur lame movie! Ur totally misinformed and a 'failing actor'... My Pakistan is phenomenal!", "_kinzaaaa": "Years ago before making a \"liberating\" movie it was Pakistan that welcomed you despite of who u were back then. And now after being a side chick in the movie this is how you come out. Showing Pakistanis how \"indians\" are?", "hafsa.aatif": "@reallyswara You are a failing actress. Thanks for making everyone realise about your sick mentality.", "tabz00": "Celebrity stunt i must say you pulled it off really well and became talk of two nations", "saba.hamzaa": "You clearly need to educate yourself about so many things, Esp when it comes to Pakistan. You have no right to comment on a Country loved by so many for your stupid fame, I actually feel sorry for you. Probably this was your only chance to be on the bigscreen with such amazing other talents, because before this, ive never heard of you or about you or any of your movies, thats why you went to desperate for it to be released everywhere :), You tried to play a stunt to get a two minutes of attention, but it gave a reverse reaction, you probably are famous now but for hate and with hate :). Kind advise, work hard if you want fame, stop spreading hate and bad words. #PakistanZindabad #gladveerediweddingwasbanned", "subhanasifbhatti": "double standard lady!!!", "meghnarai13": "Amazing job @reallyswara ♥️♥️ just loved u in the movie..", "nazia_qadeer": "Ms Swara, you're literally going to be the most viewed person today but lol over your shitty personality, Why don't you just educate for yourself before commenting over a country of more than 15 crore population. You've just lost all of your respect. Bye felicia forever cause this is something you're always gonna regret it..", "surocious_219": "I agree..... You stole the show @reallyswara Love you....♥♥♥", "shiza_02": "No wonder your uneducated ass had to become an actress", "sabahy26": "what was she thinking, u gotta read this @aditikaultiku 😂😂success gotten into her dumb head! 🙄", "shalonisin": "Her one comment and every pakistani started trolling her ... Seriously aur koii kam nhi h inko😂😂😂😂👎👎", "shsanjs281819": "Pakistan is not a failing state, educate yourself! You just wanted your two minutes of fame because let’s be real who really knows you? The movie is only getting hyped because of Sonam and Kareena. You just showcased you mentality and how low you are. Glad the film is banned! 👍🏼 #notfailingstate", "eishassan": "Attension seekar....lanat tuj pay baysharam....u have just stped in bollywood n we hav hardly seen u n look at ut statements....faltu orat", "aeshaa.saaad": "what a pity @reallyswara", "rimmss": "HAHAHH comments @laibas @ayeshaamirzaa @shanzeh_k", "anam_nabeel": "Pakistan is not failing state its u and ur mentality that is failing infact failed 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "palwasha.faizan": "The failed nation that I am from really wanted to see and celebrate your movie but you are patriot above anything else which makes you annoyingly hypocritical and really sad.", "instagramhabibahanis": "Ridiculous woman. @vdwthefilm Make her issue a formal apology.", "harmeenayub": "U r just shit on this earth .. ! 😏✋", "ym_._": "Sali haraman", "cuitiebuitie": "Miss @reallyswara YOU BETTER WATCH YOUR WORDS NEXT TIME AND A ADVICE FOR YOU PLZ DO THINK TWICE B4 SPEAKING AND YEAH STILL WAITING FOR AN REPLY @urwatistic #ProudPakistani", "ayesharasheed1999": "You're a real bitch.. Shame on you dickwad!🖕😂", "iamkashish3010": "You were just amazing @reallyswara @veere.di.wedding", "abadshahw": "You are a falling Actor. Your status says it All “Dramebaaz”", "simplyvegetarian777": "You were the best amongst the whole cast Swara! Keep rocking girl!!", "shak515": "You bitch once called Pakistan best place you ever visited. What happened now You cunt double faced.", "786emreha": "Beshak Zillat or izzat khuda k hath me hai :') Im reading comments just", "surbhiupmanyu": "Your movie is pathetic, you call it a women centric film but it fails to show what you are trying to convey. According to your movie women empowerment is all about smoking, boozing, hurling abuses. Your movie has highly misinterpreted the whole idea of feminism and to those who have not watched veere di wedding just consider yourself lucky. If you really want to watch and learn what a women centric film is just go watch PINK and PIKU again. Despite being from the country that you belong to I hate to say this your comment on our neighbouring country is just straight out dumb you could have handled it professionally.", "fasaaaad": "Hey @reallyswara I watched this movie just for you coz I was expecting acting from you only but dude u disappoint me too .. so I just want my 160 rs back ... Coz I didn't see anything in u while I was watching that movie except smoking and vulgarity .", "sumaiyak__": "@maheroshh look at her comment session 😂😂", "angry3276": "Act to gud ✌🏻👍👍👍like it", "_sania.n": "@basu.mona check comments here on how her own people her bashing! Lmao I think someone learned their lesson or if not then couldn't be more ignorant and a 'failing human being'.", "maheknesss": "@reallyswara aww is that another way of seeking attention 🤔🤔 best part is a FAILED ACTOR tries to talk about Pakistan!", "simplefeels_": "Bolne se pehly socha karein mohtarma ap...mentally sick @reallyswara", "dr.sannodia_khan": "Unfollowing you!", "varun_bjaj": "You will be judged, criticised, and then copied ..just keep Going. ..😎❤ @reallyswara", "sohaibminhassabii": "Where is saif ali khan now ....kash tum us se he kuch sekh lo....shame on both of 3rd digree humans you...", "aman_ghias": "@iqraasif08 she is a woman with double standards", "mary_q9i": "We pakistanis are actually happy that this trashy vulgar movie got banned here. we dont want to see u masturbating and doing inappropriate things on screen . FLOP ACTRESS.", "samiazaidi_samu": "Failing actress... who has 2 faces .. 😏", "alytee608": "#bollywoodnomore", "mahrosh.faiq": "Who are youu again?? Never heard of you 🤔", "khadijaayubkhan": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "nay_hn13": "😂what do you think you are?🤣", "rohmanisar99": "Actually you are ugly failed actress ... and your bio better explains your personality (dramebaz) and i must say you are such a fool speaking against PAKISTAN after saying that there is no comparison of pakistan with other countries SILLY NONSENSE WOMEN ... That's why THINK BEFORE YOU SPEAK", "f.aa.i.zz.a": "@reallyswara Go fuck yourself...", "cupy_cakies": "We prefer being a failed states rather than wasting our money watching a B grade actress.", "huzaifamaqsood": "#attentionseeker", "sunshaay": "You are one ignorant failing human being, I have never seen an actress as hypocritical as you are, Please knock some sense and decency in yourself before you speak utter shit about my beloved Pakistan.", "bluee_jasminee": "Kamwali swara..", "anshultiw": "A shit act u have done aaurto ki izzat ko to equality bolke uchalte jaoo paiso ke liye .. mtlb yehh nae ham cigarette nae Pete daru nae Pete to tum bhi mat pio Balki ladke karte to hm bhi karenge vahh", "itsmebilalhussain": "If U Say I Destroy Ur Chott 💪", "rubabjunaid": "Allah ka shukar hai movie ban hogaye waste of time for. A stupid actress", "keepitreal111222": "PAKISTAN ZINDABAD", "aroojinsta": "I so wanted to watch your shitty movie before but now of course not! Coming to the point why so? Let me tell you very clearly just because of your mind (which is an absolute trash) your ONLY movie sith some super heroines will be a super flop! You're a shame to women. When women like you speak anything for our country just to be in the limelight,i wonder what else you could do to earn cheap fame. By the way we even don't know you and the movie was just going to be a bit because of @sonamkapoor and @therealkareenakapoor but sigh, they'd also suffer because of your cheap comments about my state. I request Indian media to keep these \"C\" category actresses away from their sensible actresses. Allah Hafiz!", "saicvrce": "Good to know that Pakistani Muslims are themselves against Sharia law and are cursing Swara becoz she claimed Pakistan is governed by Sharia Law 😁😂", "madiha42": "You think pakistan is a failing state just coz it has banned a movie ? What about your country and state where you are threatened and by fear ban our actors ?? I think your state is failing on a more bigger part. Whr there own people and actors are bot safe. Learn to respect others first only than you can become a celebrity to which people could look on. Wese tu its just useless to comment on the hypocrisy that you have shown. U cant become cool by commenting these stuff. Sorry to say you are not worth of any pakistani’s time.", "kkiransworld": "What i dont understand why do people speak without thinking first? Dumb! Well lets say it like that tumhe tumhari film mubarak ho! We PAKISTANI dont need your movie! #uneducatedwomen #enjoyyourfame ✌🏽", "rajji9": "All the best", "sujatabakshi25": "She rocks and she rocks Pakistani's assssss.. So me", "sleepunderthesun": "Kanjriii aurat", "natasha_wasif_abbasi": "Bitch. She needs extra fotage :/ shitty woman. Go to hell. We don't care. Gonna unfollow. And yes to rest too.", "umairkhan_atozai": "A short message from my side. \" You're a Bitch\"..!!", "scorpio_mystique": "@reallyswara bdw you rocked the entire movie actually. TBH, even Kareena failed in the movie. Love you ❤️", "ritupandey669": "What she said??", "zeenatbhamani": "Calling out and alienating a huge portion of your fanbase as a rising actor rather than using your platform to bring people together = pretty backwards. Will skip the movie, thanks. Was quite looking forward to it.", "anum_baig": "Lol! It’s funny how you think VeereDiWeddings success has anything to do with your role in the movie! You are a nobody dude! The main stars Kareenakapoorkhan and sonamkapoor are the main reasons why the movie is a hit! It’s funny how you tried to get attention by saying crap about Pakistan but better luck next time, you are still a nobody and a flop actress! Peace from 🇵🇰", "chamki_truckart": "We didn't even know who you were before in Bollywood @reallyswara lol. So many of us didn't even knew if you were an actor or famous. Just after giving one hit, you're flying high. Calm down. This movie is a hit truly cause sonam and kareena are in it. So yeah kindly take your disgusting words back about pakistan.", "saharsahora710": "@bollywood_caffe", "keepitrealmaria": "@reallyswara I wont even start about what kind of actress you really are because as a matter of fact I didnt even know you existed before this film. What I really need to “educate” you about is , we as pakistani’s dont have a bad vocabulary! Their is a difference b/w vocabulary and vulgarity but you wont know that since you aren’t really born in a “shariah governed state”. Calling us a failing state wont get you anywhere it wont get you any followers but you might loose some. Even your indian followers because the country you belong from have literate people enough to actually tell you to shutup ! Last but not the least one movie wont get you anywhere it takes a lot of grace to maintain yourself as an artist which you have lost it already!", "adinakhan22": "Being a Pakistani, I'm happy that we didn't get to see Cheap copy of Sex and the city. And talking rubbish and lame statements about that country who was so welcoming for you as you said in your 2015 interview..You are an asshole and peice of shit, and Girl you need to focus on your accent First...Then talk about Our country🎈💥", "shehwari": "Hi missy, wish you’d check facts before being mouthy. Pakistan isn’t failing, let’s assume it is. Do you have a right to hurt it’s population? Just cause your film got banned you got a pass to pour out all your dirty thoughts? You have the nerve to spread hate amongst the people of India. You are a bloody entertainer just leave this dirty politics to politicians. SPREAD LOVE LARKI NOT YOUR CRAP.", "sidra_ashraf89": "@ashrafaymen @asra.aashraf @anum_ashraf", "eiroon_meean": "@reallyswara your a failed actress! Go climb back into your hole you dumbass ignorant pig!", "aashi.jha_": "Cheap ! Ashemd to watch your role", "sumikander": "We really need all these proof...lol", "tryguys_fan": "Veere di wedding 2 plssssssssssssssssssssss", "aish.pizza": "@reallyswara paki GDP = bolywood tax hahahah.. no comments.", "_khaaant.91": "Dil dil Pakistan.🇵🇰🇵🇰🇵🇰🇵🇰", "gemishi99": "Your acting😘😘", "sincerelyaiza": "TEAM PAKISTAN", "emmaryamhamza": "Below average third class aurat", "kashaf_09": "Spreading false comments about pakistan just shows your bitterness and the desperate need for attention. Like seriously? We get that you weren't given much importance in the movie but adopting such cheap methods to gain attention just shows how much of a pathetic idiot you are. And please, do some research before adding in your two cents. Nobody wants to hear the \"oh so mighty\" opinion of an uneducated and insecure attention seeker.", "aamna.hakkan": "🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰", "i.aemi": "Swara baastard.", "muskanaggarwal2324": "Earlier I was so excited about dis movie ...but swara mam it's just an friendly advice to u to please enhance Ur general knowledge ....u should focus on reading script.think before u speak ...you have been given platform ...use it to spread kindness ...some moral ethics and love ..so disappointed wid u ...u might achieve great heights by doing such things. ..but before anything be a better person in Ur life ..such type of activity will make u regret later ...", "i_ridasheikh": "A woman living in a failed state calling another state failing ohh gosh we r so hurt 😂😂 people didnt even know u before all this u FATSO fixie!!!! Thats your worth!! We r not even sure we should hate u or feel sorry for you!!! Assholes like u dont last long anyway!! Oh n that vocabulary u were talking about just read the comments n hatred u r getting in the comments section under every single one of your post!! That ll straighten your facts!!!! Bat karti he!!!", "_ramshaakhan": "You know nothing about our country and whatever you said about our country was extremely pathetic,but all i can say is that you’re in the phase of that temporary fame and popularity and soon this will end Insha’ALLAH because you’re a fake person inside out.", "bellefemme_makeup": "Pakistanis didn't even know about your existence before your recent interview 🤦‍♀️", "njmirza": "@reallyswara 1: Pakistan is not a failing state not it ever will be!! 2: While you're on women empowerment spree, I must say you've become a bitter person and all of this is really odd coming from a citizen of a state who bans their own movies i.e #Padmavat. We don't send death threats our actors and actresses Lol. Please, Let's NOT talk about women empowerment. Pakistan is a Phenomenal country. I'm proud to be a Paksitani.", "blueberrycravings": "You need classes in political correctness 🤷🏻‍♀️", "ahmadabdullah_butt": "You are just waste as shit! 😕 DOUBLE STANDARDS 😒😒", "alizehraza": "Your cocky retort just reflects how immature and unprofessional you are. Don’t know how long you’ve been in the industry but it makes sense that no one had heard of you till today- you’re obviously not ready to be a public figure", "arthvasavda_": "I was so mesmerized @reallyswara to see you essay this role. It was perfect and you’ve done it phenomenally. From the very dialogue delivery to the comic timing,by far best performance of the film along with Shikha! Absolutely loved the film! Keep going!", "amanbhardwaj0108": "Chodne Mann kar Raha h", "sanmeersim": "Awww she got an answer for the life time now ...well baby thorda pardh like Lena tha about the states near urs ,koi baat nai ...this is what we call failing career ....just coz of lack of knowledge and lack of vocabulary;)", "sweetweddingfavours1": "Who are you even to make comments about Pakistan. Look at your own country first loser.", "shahjahan.pal_0": "@reallyswara tujhe shodna chahta ho ek bar", "marinaaaaa_abd_": "Side role main hai or dimagh 7 asmaan pr. She wants to get popularity by saying pakistan a failing state. Kiu k aese hi bechari ko loug notice krpaaty warna toh india main bhe koi isko heroine k qaabil nhe smjhta. lol B grade flop actress", "mashalarsalan12": "You’re A Big Time Loser 👎🏻👎🏻👎🏻 #PakistanZindabad no more your Fan !!", "berrypal25": "@reallyswara And by the way , had it been Your movie as a solo actress , it would have gone unheard for at the box office. It's because of someone else , the movie is being publicized at such a large scale. Otherwise Who would have come to watch you ? You are not talented , not worthy of the fame you hassled with other actresses in the movie. Remember your level, you are just a side actress, that too an unnecessary one. May be because no one else was accepting the role and you being the most desperate of all , took it may be at minimal payment. @reallyswara #slutswara #dumbswara #flopactressswara", "unfollowunfollow9876": "#TeamPakistan ... don’t talk shit swara, get an education", "trushna_soni": "Really worth to watch. I saw the movie today and really really liked it. Your character and acting was super. Congratulations @reallyswara", "rashoa": "Bitch why you hating on others? U hating on Deepika Padkoun, you hating on Pakistan ,u hating on ur self i mean come on ,u dont have any good in new? No wonder why no amount of makeup can fix your miserable ugly face.. I love India but The India that spread Love not desperate bitches like u", "fan2sticu": "Swara Bhaskar cunningly used a poor dead girl to promote her movie degrading and shaming her own Hindustan.And now when Pakistan banned it, she degraded it too which she was once seen praising.So glad that she is now hated by all.A person with no conscience and character.Hindustan and Pakistan both are ashamed of her.", "asma_rao1": "Bloody asshole . She's a low market bitch , a naked actress who just sell her body nothing else . Uneducated loser bitch . I have never heard name before she just wanted to get game so she tried after being naked because her body was so ugly it didn't turned out well . Bloody slut . Talking about Pakistan lol see your country first you ignorant ugly slut .", "aminah0507": "Well i use to admire her, when she paid a visit to Pak and she was like there is no other country like Pak, we shouldnot have let you in this country! Such a hypocrite!", "khan.mena": "Thanks god this movie was banned in Pakistan, and it’s a good thing I didn’t watch it , after hearing your response about my country ,would have been in regret for quite a while....", "iqra_abbasi15": "YE LIJYE APKI SOCH, GIRI HUI MILI THI 🙏", "zeelovesmawra": "Two faced actress with both faces ugly huh.", "being_ujalaaa": "you Such a Bitch.. Never SaY Anythink against Pakistan. mind you language And always Think before You Speak. Bloody bitch. fuck off 👋👎", "lahorewalii": "@reallyswara you should go back to Your 2015 Pakistan visit interview and then go back to what u said on Rajeev masand show.... i knw as an artist u might be upset that ur movie isnt released in a Country (Pakistan) BUT you calling it a \"failing state\" was not a good idea and a gesture, specially, when you have visited Pakistan & urself appreciated the hospitality of people there. From being loved by people ur being hated on... why all becoz of ur Tongue... this should be a lesson for you that be mindful of your words... people actually liked u... I personally actually liked it when u came to my country ... there are people like you and then there are people like late OM Puri ji who got ridiculed becoz he was honest about his experience and till the day he died he was being punished for saying Good things about Pakistan since he didnt experience anything but Good.", "aanam_waqas": "Chutya aurat", "atabek_21": "hi Swara...please spend your time and energy in creating a career for yourself first, please dont indulge into matters bigger than what you are...sorry to follow you just to send you this message lol...have a life, bloody low life average indian flop girl 😂", "fatimasheikh43": "Feel sorry for your shitty mentality. So glad that we don’t get to see your Shitty failing acting. PAKISTAN ZINDABAD!!!!", "tahreemb_": "@reallyswara women like u should be raped in the streets of Delhi...#enoughofurbullshit #fuckoff #showofbitch. Ps: now we all knowu can do anything for fame.. But watch out for ur GOD . He ain’t sleeping .", "sunny_sheikh92": "bitch 3rd classe actress @reallyswara hit ho gey Pakistan ke khilaf bakwas kar ke ... zarur Lahore mein iss ki kali kisi ne phari ho gi !!", "dey_manasi": "U r atrocious. Disgusting", "syedamariamm": "and i get really really surprised to see how pathetic and conservative double faced a person can be like you sawara by saying anthing to our country \"PAKISTAN\" who speaks about love happiness and peace just look at yourself and your country who is just losting themselves and banning their created things in their country youre showing up you and your country a very double faced country just see yourselves our country has its own beautyv", "ayeshakamyab.s": "Realllyy swara? Thats all you had to say being a true woman. I was so wanting to watch the movie but after your very ignorant statement i think i have no interest left to watch a woman whos so ignorant,so biased and above all not at all ab example of a woman empowerment. Thankyou for the statement i hope your directors next time think before casting you after all the current ones will loose quiet an audience for your stupid statement. We as Pakistanis welcomed you in Pakistan only so that later you can go back in your country get casted with famous heroines(kareena nd sonam) nd get so excited that you lose your sense of intellect. Slow clap for your shallow thinking 👏👏", "_aa1ia": "Waste ass racist bitch", "leyla9": "@reallyswara bet your feeling rather shit now after making the dumbest comments ever.....Muslims/non Muslims/Indians/Pakistani....we are all humans and should love each other for humanity sake.....who died and made you the Indian prime minister.....", "thenoblelady_": "Really uh r unbeatable we love uh swara ❤@reallyswara", "_.re3e": "In short you have shown your cheap mentality @reallyswara", "_hxn_n": "No love for you Hun, never for a failing actress whose hanging by a thread! Get that strap!! @reallyswara and for the sake of India as your making the whole country look as stupid as you please please please use google, if you don’t know how to I’m sure someone from a “failing country” ain’t going to help bish!! USE YOUR BRAIN 😭😭", "nadiaa_344": "Was looking forward to your movie. But after the statement you have made. You are nothing but a pathetic attention seeking actress. Who can go to any extent for publicity. Keep your opinions about my homeland to yourself. Or atleast have the courtesy to not change your statement and embarrass yourself. And if you still think think pak is a “Failing state” due to the indo pak fued, you are a decade too late.", "foodaholicc.in": "Dear swara. I really liked you, but after what you said about my country i'm really dissappointed. I can't follow you anymore", "xbeea.syedx": "You truly are a disgusting two faced bitch, also a flop actress with practically zero fame before this film & had the AUDACITY to speak about Pakistan, calling it a \"Failing State\" yet you're the one that's a failing actress, failing woman & a failing human. So think a 100 times before you speak on matters about pakistan, you repulsive, sickening, heinous bitch.", "phareeuh": "TRASHHHH", "pareekpooja": "Swara uff sakshi soni i luuuuuuuuuuuuuuuuuuuvvvvvvvvvvvvvvvvvvvuuuuuuuuuuuuuuuuuu.u are superb in the movie.yaar pagal kar diya i hav got ur hangover.cnt describe in words how much i m luving u.i think meri lyf ki fav movie hai yeh.and bestestttttttttt actress is swara bhaskar.luv u dear.tc.good going .", "anon.9889": "Bloody attention seeker....", "tubi.zee": "I feel bad for u .. why don't you get yourself a check up ! Brain issues occurs when u don't get attention ! #failhuman #bekaraurat .. respect your category cuz performers cheer other performers! U are pathetic", "maggimay357": "Talk about career suicide if no1 knew you before then they sure going to turn there backs on you now .... silly women 😂 .... I know everyone is entitled a to a opinion but you went to the extent to judge a whole nation which wasn’t your place .... buy Felicia 👋🏻", "javeria_khan02": "U know what i didn't even know who u were or if u even existed no one is watching the movie because of a shitt like u", "faicus_": "I really wanted to watch this movie but after reading all these comments it’s making change my mind!", "soph6ie_": "Enjoy ur 5 min of fame honey soon ul disappear as quick as u appeared. U ain’t got wat it takes to stay in Bollywood, glad the movie is banned in Pak we don’t need this shit in a beautiful country like Pak 🇵🇰. Women r beautiful in ev land they don’t have to b foul mouthed n slutty to stand out n reach fame , shame on u , u don’t stand for women’s lib n ur certainly no role model.", "madhavikhanna9": "U once said some man masturbated in front of u in a Mumbai train n u hit him wid an umbrella.. n u masturbated in front of d whole world.. tera kya karein?", "sadiarazzaq": "A disgrace to whole Indian nation that ur people with such influential personality creating mess in two nations and parting their ways which are already quite intense ! Shame on all such stars who get enough support n love from neighbours n back stab like this n madam u kindly visit Pakistan n make comment what type of nation we are ! Zero tolerance for your ugly comments no matter how big actor and from how big country u are 👎🏻👎🏻"}