{"buyitquick2use": "Makeup से asli chehra hi chupa दिया.. Shame", "emanali.aug": "Laanat teray munh par! Bloody pig!", "surender5849": "Sali khujli wali kutia", "wafahassan1159": "Anroonay i can understand that u doesn’t understand the meaning of space", "akshun_sharma": "Khotte ki tatti khaane wali", "ujjawal476": "Princess of Bollywood industry", "eshaal_34": "nazar aa gai hai aukat iss tarhan k cheap replys kartay ho terroist ho gay tum log hum hai", "fragrance_jazzmine": "😘💋💋❤❤❤❤❤❤", "raza_pics": "Uneducated bitch", "amita1280": "Just one word for u Gorgeous !!", "sunil_kavatekar": "Awesome swara", "banoprecious": "Ugliest", "pagallarka99": "👌👌👌", "sushrut2020": "👍", "gauri3190": "Love you swara", "g_bhumi": "Don't know wt d hell she iz thinking of herself😡😡", "shivenarpita745": "Sexy", "potterhead_1502_": "Omg😂😂😂😂 ek bhi positive comment nahi😂😂 well that's what you deserve.", "__.mahum.__": "Nangi churail your a fail at body fitness 🖕", "jiten.goswami": "🤢", "realrahultomar": "Look like pornstar", "precious_s_t_o_n_e": "Bold actress ....ossom acting skills", "_my_lovely_kitchen_": "😍", "fatima._911": "Shame on you 👊🏻👊🏻👊🏻", "samudyathac": "U look stunning...All the best on ur new projects", "kirtisha_samant": "All the people are so proudly spearding hate and actually trying to prove where they hav come from.But actually they are dragging them selves to the lowest level possible.Its just shame to see how cruel and etiquetteless people could be.There are thousand ways of telling someone about what they did wrong but honestly the kind of language people have used here proves everything being said about them was right.", "a.k.a_mojo_jojo_": "Hater gone hate , Uh just gone slay love uh with all of my heart", "shweta079": "Swara you are rocking and so was your film .. you were the best among all 😘😘😘😘", "aanchalx": "Be bolder! Our society needs you! Keep going!", "kayinat.alee67785": "Nangi actress adult c grade actress🤣", "parisinghh1103": "U r a fabulous actress God bless u", "maxmahesh_iyer": "Awesome still", "_mittal_patel__": "@jjanvithakkar", "_ajak13": "Sending hate all the way from Dubai..#proudpakistani", "roaa_alsabban_8": "Guys follow @zayn____07 trends now on Instagram", "thegeekwithdimples": "Stunning!", "anumh1": "Hunny your acting SUCKS! Horrible acting.", "alizaumar11": "U are not enjilena Julie don’t over react you are only a dum cow so be a cow 🐄🐄🐄🐄🐄🐄🐄🐄🐄🐄🐄🐄", "iampinkesh111": "Too hot.....I love u....#swarabhaskar", "ryyyyyyym1": "Sooo glamourous", "samahirnoor": "World's best country is one and only OUR PAKISTAN😍😍😍", "being.naresh.talwandi": "Success meets in steady motion, congratulations", "simply_being_rohit": "Such a good actress in real life she know how to change colour like chameleon as per situation demands", "anjaligovindrana": "@sltn_msg ?", "mariumkhalill": "Lol miss failure trying really hard to sizzle on screen and failing tremendously 😂", "_k.mail_": "Supe", "jigjack92": "Too much hot 🔥... 😍", "asmaa143saf": "@reallyswara gorgeous 😍you shouldn't have to apologise for your own thoughts and opinions. It's called freedoms of speech. These pakis are just making fun of themselves and their own country. I have seen many of Pakistanis celebrities' interviews where they talk shit about their own country and their film industry. I'm surprised no one criticises Saba Qamar for her hate speech re Pakistan. she hates and embarrassed to be a Pakistani lol these haters should watch her interview first 😂. @reallyswara have your own talk show haters guna hate 😅you have 100000 of supporters and fans from all over the world ignore these Pakistanis.😄❤️❤️❤️🇦🇫🇦🇺🇮🇳#veerediwedding @therealkareenakapoor", "anwar4314": "Aag laga diya aap ne", "cardeevee": "@reallyswara just watched VDW. You’re the real star of the movie. You were fucking brilliant. Your character really owns her shit and you played her so well. Love you and the movie babe. Much love and luck to you!!! ❤️❤️❤️", "crazyplumpqueen": "Good Achievement for a character actor to appear on front cover...respect", "i_am_k.k": "Ur boobs are also a failing state🤣🤣 gym jao gym🤣", "osm_rocky": "Super", "vishalsharmavisi": "Look so hot", "rajput_bhawna_": "Just one thing i want to say that bollywood stars have no backbone they can do anything for promotions and swara proved it ryt", "word.strip": "Boss!!", "hippieheathlene": "So proud of you for standing your ground and not letting ugly behavior keep you from being you! You are an amazing example of strength in character and heart. Bravo!", "_trisha3103": "What Swara said wasnt completely wrong though😂 these unrelated comments on swara's picture exactly shows how insecure people of pakistan are!🙈 Face the truth bitches! Pakistan has proved countless times that its a failing state indeed..evidences are plenty! Pakistan still sponsors terrorist groups so STFU! Grow some balls and accept the truth istead of being delusional af!😉", "samkyins": "Hot 🔥", "sunilkumargamil.com5239": "Hot", "shail.raj": "We want hot women rather than old milf showing her loose boobs", "areeba0822": "Looking like a Call girl ..@reallyswara", "zkallures": "yes they were like why not add a porn star trek", "summiya__123": "baajiiii famous hone ka bht acha tarika dhunda h apne lol mza aya ab ?", "ben_p_og": "Beautiful! 😍", "naimashakaib": "Nangi budhi!", "nimrakhan1813": "Ur movie is pathetic with pathetic language.", "volt440": "It's really tough for u that masturbating scene in veere di wedding", "jimbeamitup": "Whatta hottieeee🔥 @theluckybum", "ayaana_khan143": "Beautiful", "__________0triple5": "Mam! Your acting in VDW😍😍😍😍😍 i mean you nailed it. Seriously😍😍😍😍😍 iloveyou❤ damn! All your scenes was amazing.. your clothes.. the way you walk.. the way you talk in the movie.. i had gone crazy after seeing this movie.. after seeing your acting.. everything mam! This is the reason why you are a STAR😍 hatsssss offff! Man. @reallyswara", "coool_aaamit": "So bye", "irtiqaaa.hussain": "@reallyswara agar SHAKAL achi nahi h tu atleast bat hi achi krleti ap. you UGLY KAALI INDIAN ASSHOLE!! 3rd class aurat. At the end Pakistan ka naam le kr hi famous hui because wase tu apki aukat nhi thi, kui janta b nhi tha apko so now thank us please 😂", "rano_kaur_the_diva": "U r an awesome actress mam 🤗 doesn't matter what people says 💁you r just perfect in your work 😘", "shiza_ali45": "Jism ki nomaish hai or aisi movies Pakistan ma banned hi honi chahiye kafir log", "heena_sharma24": "Love u swara", "omid.hamraz": "Lovely doll & beautiful", "_shehreyarwazir": "Maderchod daley ki bachi two faced bitch", "carlosdeeproductionhousepvtltd": "SAW YOUR FILM ......SUPERRRRRRRRRR FAAD DIYAA", "iqraaman93": "Ugliest Person Alive.", "aniqa_haroon": "Loll u r looking lika a \"massi\" u just want publicity by doing these bullshitt", "yogeetachadha": "U deserve it dear", "chouhanrupdhar": "Very nice", "ram_s.mhatre2122": "So sweet 👌👌", "fatidps": "Ugly inside out 💩🖕", "swara.bhasker": "❤❤", "harsh_banafer": "Tough love 💗 you though", "sherpa_gyanu": "@vdwthefilm was all about you 👏🏽👏🏽👏🏽 @reallyswara", "syedasara23": "There no good review 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣@reallyswara ... Did u read them", "sunil.2949": "Congrats now ur are available on xnxx", "nikhil_gaurav20": "Ugly Bitch Aurat Ek Baar Nhi Bola Film Jo Paisa Earn Kiya Uska Kathua Rape Victim Ko De Lekin Publicity tum. Kuch Kar Sakti Hai.....", "teri_exx_ki_bestie": "Stop #rape because it gives birth to such bitches..😂😂😂", "saavn001": "I love her", "tayaba_malikk": "Bitch", "robin_singh14": "👌💟", "swapnilpurqohit798": "Nice", "katiyar00786": "Khatarnakam visheSham sarvshreshtham", "richita89": "I like u wanna meet up ya", "sudhirkumar3723": "Beat Image So Sweet Lips", "rahul_dubey1098": "Bloody hypocrite.. The Lahore loving dimwit got exposed recently .. have you got any shame left?", "daffodilss_": "💩", "hamidakhann": "No one has the right to say any bad or negative things about any country. Every country is beautiful 💕", "pran.shukla.92": "Looking so cool", "ashtheduke": "Wow thats you", "abutt07": "@reallyswara ( bas kar ) 😂🤣", "sana_amberx": "More like swara bastard", "vini_s_more": "Awesme😍", "ankitarnav": "Saving our planet, lifting people out of poverty, advancing economic growth... these are one and the same fight. We must connect the dots between climate change, water scarcity, energy shortages, global health, food security and women's empowerment. Solutions to one problem must be solutions for all.", "icantteachyu": "I absolutely loved ur roll in the movie btw. Great job. #justarandomappallingyouforbeingabossassbitch", "mohsin_un_official": "is pic Me ek randi baiti hai jisko masturbation karke sukoon nahi mile n she is waiting for costumers lol.😂😂", "_kashish__sharma__": "No she's not hated in India, And Indians don't give a flying fuck about the opinions of a \"Failed nation\"", "deepanshukumarsingh9": "👉✊✊❄", "sharmajikahin": "जैसी तू है वैसी रहना...👍", "hi_m_anzxhu": "Without these burning topics, how Pakistan is faring ahead? Your economy is going below that of Bangladesh's. To protect your economy, you've mortgaged your sovereignty to China. Yes we are also plagued by social problems like many other developing countries, we are ashamed of it and that's why in path of reformation, we are way faster. One more thing, the Sati System is extinct from many decades so will be the present problems too. Except those problems you have nothing to argue with the Indians. So better mind in reforming your country save your ass'es from the Chinese.", "_ravinder._.singh_": "Wow #Sexiiness_look Hottie...😜😍😘🔥", "reallatul": "You are Great Swara , Came for big", "beeni_12": "ARROGANT BITCH!", "parag6996": "@reallyswara I loved this movie...you are my favorite character in this movie...and done a very fabulous job...Charm of the movie😍😍😍", "saman_daud": "@reallyswara Double standards 🇵🇰🇵🇰💝💝", "fatiwaqas": "Shame on you", "rizwanayakub": "You are an absolute embarrassment to yourself and to your country. Your interview was ignorant at the least and damned ignorant at most. You call entire country a failing state, grow up and stop being an attention seeking little child. Every state has its problems. You live in a state where gang rape is commonplace and you speak of Pakistan being a failing state. It seems whatever they may be they still respect their women more than yours. All I’m pointing out is every state has failings shortfallings. So how about you concentrate on yours and let them deal with theirs.", "_khushi_shabbir.m": "Bechari khoti ka kuch nhi honay wala 😂😂😂😂😂", "sarah.masood90": "Real dimond? Or thaali ka bengan? Pakistan mein pakistan ki tareefen or india pohnch k burai.She is not even a true indian warna she could have said these brutal words while she was here in my country.I have never seen such an ugly face in my whole life I swear! But you are her fan LMAO kuch hamza ali abbasi se seekh leti jo indian news channel per a k bhi india ko hate hi kerta hai atleast he sticks to one point that he hates india.Have some guts even outside your country too looser swara!", "hetalpuniwala_official": "Beautiful you are", "bornfirejhilik123": "Love you Soooo much sweetheart..😍..", "vision_138": "Bold nd Beautiful 😘💕 @reallyswara", "kandeel01": "U rock , keep commenting the right .", "awaisjamil567": "bitch", "manju_meena20": "🔥🔥🔥", "garima8292": "Mam please ignore all these trolls they just know a part of the story.", "the_geminian_": "I commend you but why the fck r u sitting like that.. It's awkward u know", "queen.82.queen": "💩💩💩🤢🤢🤢👹😷", "hima_priya08": "@dubey.nidz", "sanzitasthaokbye": "idk why are they judging you when you are so flawless swara. enjoyed vdw just because of you and @sumeetvyas ♥️ muchh luv muahhhhhhwchhhhhhh", "aashnarojh": "i just love your acting 😘❤️❤️ @reallyswara", "maauu_302": "Amaziiingggg work in #veerediwedding #loveyou 💕💕😍😍😍😘😘😘@reallyswara 🔥🔥🔥😍😍❤❤❤😘😘✌🤞👌", "radhika_mohit_mehndiratta": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "alishbay121": "Tjy ab koi maasi ka role b ni de ga", "chubby_baee": "My eyes are now tired after reading all these hateful comments on @reallyswara 😅😅", "shuklamilans": "Biyach 👎🏻", "jimaand": "Lol you guys have better vocabulary? we see that when kareena aliaa and varun speak😂 Shove your obnoxious accent up your filthy indian ass", "mominaidrees9": "Fake person", "09876mnbvc_": "🖕", "1dssouzzs": "You were the only “actor” apart from Kareena who was good", "human___feelings": "many of our actors are Muslims. So??? They are Indians. We have hindu, Muslims, Punjabi, gujrati, Rajasthani and numerous other people of different religion. So what do u want? To kill them all? See, we don't really kill people like your media shows 😂 we have a life 😂", "kiranayub_": "🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰...❤️", "addy9527": "I love u......😊😊😊", "ragarwal68": "What a makeover swara ji.", "dhupen": "absolute stunning", "dream_girl_3425": "Gourgeous", "horainkhan1": "@reallyswara ap Pakistan ayi yahn interviews dye Pakistan ki bht tareefn ki phr apki film Jo k cheap content dakhti banned kr dya Pakistani bord NY to Pakistan \"failing state \" hogi kya munfqat h...koi b bara star kisi b mulk k bry m asy words use ni krta @reallyswara basis manners to seekhny chye but one more thing I m surprised to see k kuch Indian k ma NY comments pary jinho NY is bat py protest kya k kisi b star ko kisi neighbour country k bry m asy comnents ni krny chyeee.really respect those Indians (Y) good job", "xrak2": "Bitchhhhhhh", "sawantprasad761": "Lovely", "beforebharat": "@reallyswara what are you doing in our world go back to your girl ... And apologise first....haha", "deepti_008": "Hotter❤💋", "parasswasti928": "Lovely 😊", "abdullahbhutta": ". In the last five years, Pakistan’s literacy rate has grown by 250%, the largest increase in any country to date. 2. Pakistan is the first Islamic country to attain nuclear power. 3. Edhi is running the World’s largest Ambulance network. 4. World’s youngest certified Microsoft Experts Arfa Kareem (Late) and Babar Iqbal are from Pakistan. 5. Pakistan has the sixth largest military force in the world. 6. Pakistan’s national anthem tune ranks first in the top three tunes of the world. 7. Fourth largest broadband internet system of world is in Pakistan 8. World’s largest deep sea port is Gwadar. 9. About 50% of the world’s footballs are made in Pakistan. 10. Pakistan is notable for having one of the best trained air-force pilots in the world. 11. Pakistan has world’s youngest civil judge, Muhammad Illyas. 12. The highest railway station of Asia is in Pakistan. 13. First PC virus was created by two Pakistani brothers. (Maybe not something to be very proud of, but it still might have required an impressive level of intellect to do so). 14. Dr. Abdus Salam – Nobel prize winner (Physics 1979). 15. LUMS (Lahore University of Management Sciences) attracts students from Middle East, the Far East, Central Asia, and other parts of South Asia. 16. Ustaad Nusrat Fateh Ali Khan, hailed as the most important Qawwali singer of the 20th century and received many awards around the globe such as The “Legends” award at the UK Asian Music Awards (2005). 17. World’s 7th largest Pool of Scientists and Engineer. 18. The Shah Faisal Mosque in Islamabad can accommodate almost 100,000 worshipers. Completed in 1976, it could at that time probably hold the city’s entire population. 19. Karakoram Highway runs through the northern areas connecting Pakistan with China’s Xingjiang province is often described as ” Eighth Wonder of the World” due to the marvel of civil engineering as it has taken 15 years to complete by the Pakistan Army Engineers in collaboration with China. It’s been labeled as ” World’s highest paved international Road” under world’s toughest terrain. 20. Air Commodore MM ALAM (Late) has a world record of shooting down 5 planes in less than a Minute.", "p_rana03": "Vulgar", "faiqa_adil": "Fazool 😂😂😂😂", "eshrat.chaudhry_": "Uglyyy", "ashwini.gcae": "Great...", "apurvarohatgi": "So delighted to see your acting....", "_d7ddy": "That moment when @reallyswara does tatti very smoothly 🌚", "shekhar_vishvkarma": "So beautiful", "anna_jilani": "You are nothing but a fame seeking bitch.", "msmeehnia": "You lookgreat", "mahrukh_khalid87": "@reallyswara ap na pakistan k bara statement bht ghalat di ha...i like ur movie but just bçz of Kareena Kapoor...mera lia ap flop ho..", "kausar_pathan": "B as you....👍👍👍", "zeshijikalu": "UR A FAILUR URSELF..JST LOOK AT THE TYPE OF ROLE U PLAYED FOR FAME! LOOK AT URSELF FIRST & THEN TALK!! WHO MADE HER AN ACTRESS NO SENSE NO LOGIC! B****!", "intojungle": "@reallyswara you bloody hypocrite 🖕🖕", "homera_koko": "Bandri", "abidhussain300": "Lovely", "amit_you_know_jena": "✋", "zayer_farook": "Attension seeker failed actress", "themonicadhiman": "@vinnyduhpooh it’s sakshiiiiii", "ashishgrewal1": "U rock girl ❤️", "tezsawani": "Really ur great really I'm totally flatttttt", "sidrarafiq1988": "Ghareebon wali shakal leker bilawaja itra rahi he bloody hypocrite", "himanshusingh5755": "Ma'am veery Di wedding mein sabse accha aapne role kiya...you are always best", "iamprakashyadavanshi": "Best", "mahendrasoni.ms46": "It's very very hot", "deepshikha2012": "Sexy😍😍😍😍😘😘😘😘", "sevra_gopal": "Keep at up", "aneesashaheeen": "Side chick is the word that defines you ugly looking rat! @therealkarismakapoor @sonamkapoor she basically wanted to steel sonam and kareenas limelight", "zaxx.inyx_": "Bhasker?...more like bastard", "faaiza_panhwar": "Ugly.", "sunilgarg24": "Brilliant. Beautiful. Unapologetic.", "blogsbykomalfaizan": "Girll !!!! You need to back in time and get proper education . Lord help Bollywood. I feel sorry for my Indian brothers and sisters for her existence. Ms Bhaskar please stop so ignorant of the fact that you are being disliked by both sides because of your stupidity and it was called upon. Kindly do us all a favour and stop justifying with tweets such as dost ka dushman what ever that was . And dont try being a self proclaimed peace ambassador between India and Pakistan . I hope you are happy with all the attention you are getting now .", "vanditagaba": "Just loved ur character in vdw...😍✌️", "hiba_serwar": "U said Pakistan’s vocabulary is worst then yours right...let me tell u something our accent is better than yours alright and Pakistan is not a failing state..stupid uneducated people ...learn some sense and think first before u say anything .. I use to like u but u disappoint us", "sohail.3864": "👿👿👿👿👿👿👿", "fierylittlemermaid": "Wow ❤️❤️❤️❤️❤️❤️", "shyalsonika": "🔥🔥🔥🔥🔥🔥🔥🔥", "rohan.adeel.7": "Itni hi private hy to yeh churail chain sy zindagi guzary bollywood mein aa kr bheek kiyun mngti hy please watch veerediwedding bla bla", "monucreativeartist": "Awsome pic @monuatlooks", "reema.bhardwaj.52": "Hi mam ... in movie veere di wedding ur acting is awsm ..mein to fan ho gyi aapki ... u rock @reallyswara 😘😘😘", "ssmoreo4": "BAKWAS", "hemasuraj87": "Beautiful n Superrr....powerful n bold grl 😎keeps on Rocking babe 😘Godbless 😇", "yousufzaijk0": "Lol you poor thing 💩", "khemeshwari_nag": "Wow", "vipin__parmar": "❤love u swara mam", "khaleel6637": "💛💚🧡❤️", "kamaleshchary": "are you going loo", "itsme_sheetalsingh": "Awesome", "rano_da__409": "Looking gorgeous babe love u", "zahedsheikh153": "Looking beautifull @reallyswara", "manfromadras": "I love how these insecure pakistanis are losing their collective shit over one comment. Fellas - this insecurity speaks to your nature, not hers....", "official___ayushrajsingh": "@reallyswara tooo cuteeeeeee😂😂😂😂😝😝😝😋😝😋😜😋😜😜😋", "harsad_kumar": "👌👌❤❤😍", "tik_tok_official_account": "I likee u", "indus_lander": "Nice, speak more truth future also. U Hv changed the mindset of the masses by your role in ur movie.", "meer6238": "Tere pas to kapre bi nahi hai kitna gareeb or begarat hai tera india", "mayazmakeover": "Oh my god! Can't believe that it's you 😍😍😍 really gorgeous @reallyswara", "anitashah11": "supar bhaskar kadak", "nishajamvwal\nVerified": "Verified", "futra_baisa_banna": "https://www.instagram.com/futra__banna_baisa/follow this page hkm", "ravindra3081": "Stunning beauty uuummmaahhaaa", "wild_cat007": "Washing powder nirma 🤣🤣🤣🤣", "anirudh2005_": "Fucking hot", "haider3012s": "Oh! look at your big boobs", "_jasleenkaur_27": "And just see vo baithe kaise hai", "marvelous_marvi": "Hey look everyone a Sunny Leonne wanna be !!", "ayeshach75": "👹👺👹👺👹👺👽☠️", "soiba_farooq_maan_": "fuck your mother u shit head @yeah4171", "__tanvijain": "@reallyswara dnt worry you earned lot of fans ...Nd saying what is truth is not wrong ...as you are an actoress fokat people will keep commenting bad . ..keep your self bold like you are. And let people talk bull shit about you coz after sometime they will go to there cages ...#dushmankadushmandost", "_starboy_786": "Randi😡😡😡", "mahnoor.shiekh": "Ap pakistan Bolne K qabil bhe nhe hain apni Napak Zaban se 😅😅", "01alive": "😘😘", "nitika_bhandari_chaaras": "You stunning 😍😘", "nh.kay": "Dumb bitch", "noorai_ali": "❤", "monikapatiyal": "Stunning", "saira_malik29": "Bloody double standard", "kaushik_sumit95": "😍😍😍😍", "is.that.swati": "Funny, how the woman who felt she was reduced to vagina was chasing dicks in VDW. 😂😂😂😂😂😂", "omy_joiya": "Yes I really appreciate your work and I love your opinions and I am Pakistani but a country who gives you so much love and respect you should be careful with your words next time #lady", "ashwini.jadhav_": "Love u mam !!!", "danbrown555": "Am an indian and the double standard u showed is such a downer, this shows that this whole bollywood industry is fake and full of shit and even telugu n tamjl cinema is better than this !", "safina_hafsa": "Is this the best you can do 😏", "nepalnaresh1": "Insult kra li ab kuchh nya soch lo. Bura lgta h jb koi burai krta h apki. Ap mahanat kro aur sbka muh bnd krke dikhana abki baar. Theek sa kirdaar choose kiya kro. Don't worry 🌼🌺🌺", "jha_manjusha": "You nailed it..uninhibited#sassy#gorgeous#blunt#beautiful..😍😍", "apspiccontest_4": "Sham on u on u double standard", "sparkle.star1": "I love ur acting in movie..movie was ok I just love swara in attitude and dressing of all veere", "salllmanela": "lmao comments are sPILLING with nothing but tea", "zainabyasir27": "🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰🇵🇰", "shhx_97": "You are the opposite of a feminist", "lubnatahir": "I am blocked to comment", "arj8545": "smoking queen", "ankit.sood_96": "looks great 👌@reallyswara", "diariesofwork": "No body bats an eye when they do so much of damage on IB and do bad mouthing about our country. But people will definitely lose their temper when a celebrity will speak like this that too an Indian. Give justice to Khadija first then talk about the progress of your country. That's why peace winner Malala Yousafzai is fighting against such double standards . I'm with these great people and not with the ones who can only say stupid things on this platform", "hiraomarkhan": "2din ki chandniii to u .... u r nothng cheap publicity u only need", "siddharthkumar526": "Nice pic looking so sexy.....", "alinaanwer._": "U shitty girls oh sorry u r not a girl anymore 😄 u shitty aurat we PAKISTANI didn’t who the hell u were flopped actress chuchi but now u r known as a shitty actress u said Pakistan is a failure then for changing of your statement u just said lahore is your soul city oh hello! lahore is in Pakistan dont forget. I dont want to call cheap to all indians bcz i dont know how are they i just want to call u cheap shit asshole or han jitni gurbat india my hy wo to tumhy b pata hy toilets wahan nhi hain n u call us failure jitna paisa apni nangi vulgar films pr lagaty ho na itna paisa apny mulk per lagao to ye sab na ho u look like a MAASI u should thanks to make up that makes u better than before without makeup bahar nikalti to log MAASI hi samjhty. And you bitch tu ab aysahi bezat hogi tyri har post per. N yes we respect indian actor and actresses we watch your movies we love your movies but it doesn’t mean that we like you we just like your indian’s acting and we also appreciate it we are not like you shitty peoples who insult us i dont say the whole india is shit there are many people who respect us like we do. Ughh u such a piece of shit nooooo u are a whole shittt u bitch #purepakistani 🇵🇰", "arooba_khan_44": "Jhuti orat apni asli oqat bta di k to India ki hai huh : / : /", "akansha5harma": "Omg", "__abd_23": "u know what tumhe toh koi janta b nh or nahi koi tumhe ghans dalta hoga shyd esiye fam hone keliye ye cmnt kiye humare pak p but the fact is tum jesi manus shakal ke log ese india or pak ke bech masle peda krte hogye ab tum famous etni galiya khake b fam nh banogi toh or kiya", "faraz_shah20": "Teri zindagi hi drama hai", "isra_baloch1": "Hor das kinni buraiyan chahidi tenu? 😂🐍😼 @fatimabaloch1", "noor.sabah.1806": "The most cheapest person", "ashok.dey706": "Gorgeous", "nehl_mirza": "Kutii h tu", "duahsajid": "🖕🏻", "miss.patel87": "#okurrr", "charudattu": "Ur looking chic seats 😘", "sadaqat_ullah_khan_": "Nice", "n4dia.elahi": "I won't be watching the movie I was so desperately waiting for.. love sonam and kareena .. but u ain't worth a dime lady .. oops lady is too big a word for u .. so yea.. using my bad vocabulary I shall call u No good, talentless , double faced Loosa", "waseem_jamal5": "immature struggler.", "faizxiddiqui": "WOW", "hefat19": "Ñ", "asifali5849": "Cool", "choco__diamond": "Apko Jo lagta apne bola Pak ke bare me ab ye batao Zalil Hoke kasa lag raha? 😏😼", "arooj_zafar12": "Bitch", "aahil_aziz": "I want my money back 😑😑😑", "palvinderm": "You are one gorgeous lady and love listening to your thoughts", "fx_064": "My country won't become a failure state if you said that", "tee.f.kay.kay": "B grade actress leaving no stone unturned to prove that she really is a Godamn B grade bullshit . Why is everyone even giving her more than the minimal attention she deserves . Even minimal looks big given to her viper hissing statements that match up to her standard of being a FAILED & UnSUNG b grade bimbo who can plainly not digest the limelight and complimentary interviews she is summoned too . Ofcourse sitting next to kareena and Sonam , she decide to scratch her head full of flop ideas as her career , pulling this diplomatic stunt off to touch the chords of the forbidden and focus attention to her so attention deprived role . What a substandard way of attaining fame but then again whatelse do you expect ? She is really being reallyswara that is she 😝Tsk tsk tsk . They need to redo the cliche’ that now should go Small minds discuss people and hey Even smaller ones known popularly as Reallyswara discuss Countries and knit pick on whether they run on shariah laws or no ? Are they secular or no ? And all this on the basis of a very strong academic basis of acting/ cinematography/dhongigraphy 😝 ( even people with Major in IR wont rant this confident ) but this is reallyswara expect Kuch bhi as she herself says Really 😝😝", "alita_unapologetically_costa": "You look absolutely stunning 🤗loved ur acting in veere di wedding", "anshumaanmajumder": "Ppl hate u let them i know from inside ur trying to merge two countries", "tanviwadhar": "I loved your badass character with a pure heart, Sakshi Soni!❤⭐", "quee_4444": "i don't know what you think your self if any person talk about any country he should know that country and you talking about Pakistan and don't know any think about it you really ignorant person we should respect all country in the world but you're nothing els bitch and veer di wadding successful only because sonam and karena you are no thing @reallyswara", "saqib7381": "I hate you because you are taking about my sweet country Pakistan fuck your country dirty black people rapiest country India", "zainab13999": "Ghatiya aurat", "ashif_perfect": "👍👍👍👍👍👍👍👍👍👍Wao...super .....I like ur all movie. U looking so cute", "natasha_kills99": "@reallyswara bet u loving the attention right now. You've been craving it all your life. Well done u badass biyatch. U infamous piece of tatti 💩💩💩💩💩💩", "khairaraman": "💕❤️", "akanshasharma.__11": "whts happening there guys 😶 hua kya h sbko", "qaneta": "To all haters look at urself first... She said right about failing stàte ... recently \"pk supreme court decided to ban co education in whole country\"...then of course , its failing step , failing state.", "isha.patel28": "@reallyswara no one likes you for your stupid opinions, always running your big mouth. Having nothing nice to say i wonder how you came to this industry. 🤮🙄", "bisma_j": "🇵🇰💚", "kshitijsharma_": "Swara mam idk how to describe your acting in words , it was just a full package don't give a shit who are speaking bullshit to you mam you've done your job atleast youre not like others your doing hardwork in a clean work it your job mam #iloveyourperformance @reallyswara", "bellafawzi_": "Hello Sakshi 😄❤", "sahrishhumayun": "I thought u r quite intelligent bt u proved me wrong....i admire ur speaking powers bt ur comment about pakistan totally destroyed ur image....u r soo hypocrite..just to promote ur movie and to be in a limelight doesnt mean to say anything nonsense about anything....", "rotibae": "Comments are basically 90% hate. Ouch.", "heartz5554": "I liked you before this controversy... I am also an indian but never hate our neibour country you should apologize that's it.", "k_uzii": "💕", "saintsange": "I liked her movie nil baatey sanatta until she blabbered utter disgusts for padmavaat!! Women are supposed to be supporting each other not bitching whole heartily..and lastly Deepika is prolly a much better actor than you. You are basic af.", "carladantos_": "Wow bich! Focus on your masturbation 🤷🏻‍♂️💦", "marryy_khann": "There are so many movies of Pakistan that are banned in India but yet no celebrity from Pakistan said anything rubbish and stupid like u said..!!😏", "zayyan131201": "Bloody indian bitch.", "iqra__liaquat": "kallllliii marasan kamwali maasiii", "end_is_better46": "Dirty girl", "iareeshaqureshi": "Ugliest flop actress!", "vivek_trivedi_": "Super caption.. u rocked the movie veer de wedding @reallyswara ... Lovw u loads dear🤗🤗🤗😘😘😘😘😘😇", "sfmash101": "@reallyswara a low life c grade actress slut who came to Pakistan to earn money the wrong way. No one even bothered to look at her here ugly big mouth yuck u are.", "laila_ldn_": "Mans world? That's sexist. Uh how failing", "varada.kay": "Swara, I'm sure you are good hearted ,but dont say you're a feminist and go after girls and hurt them . Why go after Deepika and try to rip her apart for jauhar scene when you know very well your movies have some very explicit scenes as well which are way worse. Please stop trying to hurt people . Kindness will go a long way.", "ronestone_": "You did masterbating in this movie so are you gonna give blow job & hand job in ur next movie? YOU SIDE HOE", "vineetsingla31": "U were great in VRD...fuck the bloody trolls#swarabhaskar", "ainyjaffri_": "Piece of shit.... And btw you really need to work on your vocabulary Shitty Reallyswara.", "catchparo": "How did u get this makeover?? U look stunning....love it", "sarahshahss": "She has no right to say anything against my country Pakistan. Who the hell she is..... Looser", "_mansi.ks": "Slaaaayyyy", "hania_imtiaz": "Shit people shit thoughts", "rutabaamjad": "Sonam or Kareena ki waja se wo movie hit hui he or khush ye horhi he.", "mariam012938": "Pakistani actress don’t have to get naked or whore their way to the top to make good movies and shows and if that’s what makes Pakistan a “failing county” than I’m proud of that. But let’s talks about Indian for a second. Statistically Indian has the most rape cases each year, your poverty rate is the highest, and your men beat their women like it’s nothing. Now morally speaking about the “Bollywood industry” you all fuck each other’s husbands and have affairs with each which is disgusting. And as far as it goes for you personally your movie was rated 2.8 out 10 on IMDb so you need to clam your hype down. You literally had to masturbate to get a role in the movie, your mother, father, and brother will watch that and I’m sure will be very happy to know the moans sounds you make when you pleasured. U called sex-slavery better than Jauhar as a woman is more than a vagina. I mean bitch your frankly just gross and we’re very glad that your failing county doesn’t have failing nasty people like you in it.", "su.may.dha": "😍🔥🔥🔥", "c.s.sh": "Looool as if she commented on Pakistan! Sorry who is she, where is she and her boobs are like elephants ears! Racist cunt", "sanaraza273": "U fucking off", "maamib_": "Ugly from inside and the outside. Lol. How sad. You played yourself. 😅", "monnnaaayy": "bitch you are a failing human being", "mahnoor.vaince": "Beta tujy to unfollow e kren gay 😅😅😅👊👊👊👊", "sarahkarobari": "Bold and beautiful 😍😍😍😘😘😘😍😍😘😘😘💖💖💖💖💖💖💖💖💖", "muntahanasir_": "Well you said let's distinct between govt and people? Like are you serious? You called PAKISTAN a failed state, the govt ain't comprising PAKISTAN!! Pakistan means it's people, So kindly bring up your vocabulary so that you can comprehend your own words", "yheryprasticha": "Jelek lu @reallyswara", "wish_mah_qureshi": "Going to unfollow this racist and double face woman.. bhaar main ja.. wish you bad luck for your all career.. sonam's spoon..", "sheikhsaab947": "India kinsbse chudi hui actress..iski gand lagadi hy shakal ki jagah", "ustaad_988": "Must've taken you hours upon hours to achieve this look with the assist of a village constantly covering your skin up with boatloads of make up....20000-30000 ka makeover kiya hoga aur kisi 420 darzi se ye kapde silwaye honge 😂😂😂 meri behan ke sar pe jo dupatta hota hai uska 1/3 bhi tumne nahi pehna hua ksi khirki ke parde ko lapait ke aagyi ho aisa lagta hai aur apni hypocrisy ki misaal to tum de hi chuki ho kabhi Lahore ko best place kehti ho kahin mere watan ko regressive,non-secular,failing state jese labels deti ho...aurat ho ya girgit shakal se teesray jins wali lagti ho 😂😂😂", "pakistani.celebrities__": "HAHAHHAA WHY DID SHE DELETED HER PREVIOUS POST 😂", "samrahaamirbutt": "Assallam o Alaikum Aunty!👋🏻", "mr_rohit_sinha": "I love u sware....l love ur acting ,ur style,and everything..... U r superb..... U r one of my fbrt actrss", "f.aa.i.zz.a": "@reallyswara Go fuck yourself", "prati1926": "I thought you are marathi", "farryali_": "Dont act like you dont know wat is happening in media.....I sent u BEST WISHES FROM PAKISTAN a week ago....but u ACTUALLY LOST A BIG FAN(me)......U WERE MUCH APPRECIATED Abt UR REPLIES TO MEDIA BY KAREENA....but FACEPALM....issi liye kehti a sab ko success RAAS nhi ati 😇 atleast ARTIST should not be hypocrite like u !!!!!!!", "wandering_mk": "@reallyswara You go girl 😘😘😘", "rozenbergya": "❤", "zubiachatha": "Churail🤣", "saloni578220": "Mam...after watching this movie... I love uh from the bottom of my heart... I love ur acting...I love ur dresses and everything...uh are gorgeous...uh are stunning...uh r perfect mam.. love uh....", "saby_86": "Wow! Yaar apna haath jagnaaath was wow lol 😂😂😂😂", "pulkitshreshth": "😍😍", "shu_bham_bomb": "Osmm", "malmirha": "Bad'shakal aurat aik film mein main role kya mil gya h tu tou oqat se he bhr ho gae h apni fikar na kar film pakki flop h aur tujhe dobaara kisi mein munh b nae lagana ugly bitch", "tansworld": "And this is just the beginning", "smilehappiness.babbi": "You r so well deserving person😄 u killed it in veere di wedding, the only word belongs to u is EPIC🙌♥️♥️", "iamakhaan": "Bitch", "the_notorious_11": "Movie ne thode bhot kma liya pr tumne sb gvaa diyaa", "yeah4171": "@reallyswara I love you and support you through thick and thin !! 👅👅👅👅👅👅 love love 💮💮💮", "abhishekverma5000": "Bloodly hypocrite..bloody feminist..", "param49": "Best acting ever @reallyswara just nailed it, the best part was the ending one wow just wow, what a reply to the gossip by aunties 👏👏🙌", "fasiha_malik": "IDIOT 👊", "world_backpacker_love": "POST UR PIC OF VEERE DE WEDDING SPECIAL SCREENING.COZ U R LOOKING GORGEOUS IN DAT DRESS😘😍😘😍😘😍😘😍😘😍😘😍😘😍😘😍😘😘😘😍😘😘😍😘😍😘😍😘😍😍😍😘😍😘😍😘😍😘😍😘😍😘😍😘😍😘😍😘😘😍😘😘😍😘😘😍😘😍😘😘😍😘😍😘😘😍😘😘😍😘😘😍😘😘😍😘😘😍😍😘😘😘😘😘😘😘😘😘😘😘😘😘", "suhawanijain": "You totally nailed as SAKSHIII♥️😍😍", "soubhaginimulia": "Stunning", "aiyesha__": "Hey @reallyswara add this to your bio : Ignorant , self obsessed woman who seems to have opinions only when it’s convenient to her ! Also brilliant at being selectively vocal on selective issues . Can compete with the likes of Donald Trump when it comes to the ignorance and incompetency . Maybe @reallyswara by adding this ,you will be able to find other failing states (not India though ) ! 😊 #progressivewomanwhoisalsoignorant", "radhamaninand": "Oh wow beautiful 😘", "shahriyor_mardon_": "😊☺☺😊😊😊😁😇😇", "21_rajput": "Chameleon#swarabhaskar", "__miniona__": "You slay girl🔥🔥hugeeeeeee fan❤", "ainad_tarsun": "🤮🤮🤮 - Every Pakistani rn, regardless how you look.", "binteumaimah": "Lets start, #uglybandariya #nangiforfame. Swara sewer", "nawal783": "Ugly & horrible inside out.", "ujjawal221197": "Looking so beautiful and so cute", "vivekvaidya000": "Watched veere today, and loved your performance.", "patelketan99247": "Hi", "sarahtariqq": "U can take off ur clothes sweety lekin shakal to wahi rahegi na... Wannabe kareena !! Ur not even equal to the shoe of kareena lol", "shop.la.la": "Beautiful 😩♥️😍", "ranasafvi": "Wow", "modelvarsh": "Loved your badhaaass acting in veereee love you 😘😘😜😜😘😘", "atulmalhotra2303": "Squatting on the shit pot ?", "adnanqazi\nVerified": "Verified", "mandal_lakhi": "mam movie was too good actually i was confused with my life but i got new thoughts about my life ..........sooo it was great", "zaraxee": "A complete form of shit", "mahakkiyaan": "I just love her 😘😘😍😍💝💝", "stephenlamater": "Beautiful Swara", "iamamnaj176": "Ooo naii bezrtii kroo yarr Allah allah krky behn ko ikk movie milii wo b jo hit huwii o ..😂😂😂 behn pakistan ko failing state kehny sy pehly apny apko ikk dfa dekh letyy haii thkk hai ?? Apni pyary baharat py dehan jo jahn toilets ki kamii hai thk?? Go get a life... @reallyswara 🙏😛🤓👊", "sagarshinde1412": "https://www.facebook.com/ThePresstitute/videos/2003421646358063/", "hot_desire5": "Great change", "siddhitanarvankar": "loved your character the most from @vdwthefilm", "soyantar_tarun": "Congratulations", "mehru26": "I’m very disappointed, I thought you are a genuine person but I guess not, you are actually a great actress who acted really well while visiting your neighboring country.", "akriti4animals": "@reallyswara you are UGLYYY", "the_whimsical_one_": "Tons of love @reallyswara 💙💙💙💙💙💙💙", "adib_zamali": "I love you @reallyswara ji", "araymaham": "Showing cleavage, hating Pakistan, has no sense of humor, bad at acting, useless drama, not and inspiration like other actresses. Yes I'm talking about you you stupid woman", "ucolitiscrusader": "You deserve much more!You’re very talented", "rohitttttttttttttttttttttttttt": "Big fan", "theprisha1402": "Worth it!", "angelinarips": "Hahahahahhaha. You're a big joke", "jaikishanshetty": "Sizzling 🔥 and sexy pretty Woman 😍", "tamoorinfinity": "lacho bandri", "sanamssss90": "C grade attention seeking actress", "aayesha20199": "Get over your fucking ugly self. You’re a hater", "aashnabhutani22": "❤️❤️❤️❤️", "serat507": "Hate this double face girl😬", "wania4567834": "Cheap actress..cheap publicity stunt.", "m_bakhtawari": "People are interested to watch this movie just because of Karina and soonam", "ldsouza.16": "So hot ❤️", "mahendramanihar": "Wow. Bold and Beautiful", "shezaadishezaadi": "Pakistan ko kuch b bol dogi ye samajh k koi kuch nahi bole ga hum Pakistani aik Hain chahe cricket ka medaan ho ya jaang ka elaan ho . hum apne khoon see Pakistan ki hifazat karain ge .. proud to be a Pakistani 💪👈", "soniyaanjal143": "Ma'am after sawing uhh in a veerey di wedding movie im ur fann❤❤n u r a good actress❤❤", "143kusum": "I love you swara 😘", "ritusinhaofficial": "😍😍", "itsdimplesingh": "What is wrong with people 😂 you guys can’t even let people say their views. And the way Pakistani’s have reacted, it just made how right she was", "iam.muneebrana": "Thats who we call ‘namak-haraam’ sorry for using bit harsh words but you came to my country and u got so much love & respect that made YOU consider pakistan as a best country to visit! Never expect this much hypocrisy from u since u were so happy for being in pakistan! U earned my respect and might many more with ur acting skills but u lost fans with such a immature thing u did! I hope it was a mistake ‘speak before think' anyways as a Pakistani citizen i wish u stay happy live best life and successful career and yeah dont feel any hesitation if you want visit Pakistan again i guarantee u will get same pleasuring welcome! Thats who we are!", "bhawnarajiv": "Beautiful", "_aeioouu": "I love you Missy ♥️", "shahripreity2805": "Supasexy", "nimi_licious_": "Diplomatic attention seeker bitch...", "kashyap8865": "acting superhit👌👌👌👌👌", "dxgman2929": "Nangi hokar dekhao buhut maza aye ga", "luttade2181": "Dekho sali pakistan ki rand ko", "dee_cloudwalker": "She crosses her limits on national issues just to gain publicity...@reallyswara", "warranium": "I love your acting and always will but you are turning into a more hypocrite person everyday. please don't do this.", "parizehsultan2018": "And here she is 😂 dumb b****!", "nimish.raval": "Stunner 💗", "rinky2244": "😉✌", "ghai.komal": "Noooooo.....this is the worst you had looked. These magazine editors just overdo everythinh. You had looked so much better before this", "iamdevp": "So hot", "ratansharma0094": "Aunty lag Rahi hain", "wasiqalysyed": "Sasti bitch !", "gaurav.umap93": "Kuch jada nhi huaa", "fuzia1611": "Please mam ap se bat krni hai please", "jadavnimisha39": "Koi kuch b bole bt bt bt girl u jst nailed d role😻🙅‍♀️🤞", "sazznirvanasim": "Veere d wedding what a bakwass film full time waste ..script pardte ho raatta marte ho 😂😂 aisse chalta raha to bollywood boycott kre ga ekdin", "manghani_": "All Haters of swara....Why dont you just unfollow her....You just shame her in the comments...Thats so usesless....SHE DOESNT GIVE A SHIT ABOUT YOU GUYS....and yes she is successful....Even if you all decide to not watch her films(haters are such sad people)", "hadia_ali26": "Flop b grade shemale😎", "irtazabukhariofficial": "You are the FIRST EVER public figure which I'm trolling as you are the worst. I would love to slit your throat so that you may not talk shit any longer. Bloody bitch. Even your mom hates you for all this.", "39rrlno9": "Failed actress", "tubaawan3804": "Chutiya", "s_dxb2050": "Swara 👎👎👎", "bharti_kapei97": "Just ignore them.. U r really awesome.. And u r an amazing actor @reallyswara", "lauras_closet72": "Ugly", "gbakshi": "@reallyswara u just nailed it. Veere di wedding is all about u. Ur sexy look, on time dialogues🤩🤩🤩🤩"}