{"ishuhot": "Shame on You", "ics_1105": "Jehadi bibi from jnu... How does ur empowered vagina feel now that u have faked a masturbation scene in a poop filled film???", "reema3810": "Fabulous", "iareeshaqureshi": "Flop actress", "theaashka_desai": "You are amazing! :)", "faazla_saeed": "Did somebody cut your legs ?", "i_calmsoul_": "Great*", "karishmaaa01": "@reallyswara m just back from the movie and you nailed it.. yayyy 💃💃you have earned a follower now.. Loved your acting.. Honestly I went to watch veere for kareena and sonam but looks like someone else has joined the LIST.. God bless u my dear..", "rb_791": "@reallyswara dag mag dag mag diga diga...😅", "angad__sharma_0090": "great and gorgeous pics", "jose_benjamin_ventura": "Wwwwwwaaauo", "verma0591": "Just loved ur work in veere.. gud luck fr more amazing roles and mvys.. love u", "azeeza_08": "Classy look @reallyswara", "zainab_ali568": "She’s a bitch get fucked up you asshole", "zubiya_shk1": "As an Indian I think that these people hate Pakistan because it totally a Muslim country and.. Yahi mentality se log kehte hai aise statements dete hai.... Indian Muslims bhi bardast krte hai bht kuch cheez yaha pr hamari nahi chalti... So as a Muslim we face. So as a Muslim country u all also have to face some hate like this... But kisike bolne se kuch nahi hota hai... Sbse badi baat toh Yeh hai we are not failing because we belong to Islam.. To real failure kaun hai Yeh sb ko pata hai", "shrpanhwar": "Charsi😂😂😂", "prakash_makwana27": "@exax.11 gona lol gonna😂😂😂😂😂😂😂learn english bitch please😂😂learn grammar+tense😂😂😂😂😂😂😂😂", "mariumkhalill": "She's desperately crying for attention. It showed in the vulgarity of the movie. Prolly that's the only reason why she was casted in the first place lol", "yahyatariqqureshi": "ayyy khusra h", "samudyathac": "Hidden STAR", "chaandrose": "Louboutins😍", "vet_radhika": "I literally luvd you in #VDW girl. Trust me you were the sole holder. I became a huge fan of your versatility. @reallyswara", "osm_rocky": "So so sweet", "ustaad_988": "God I hate your guts...ain't blocking you cuz of your pic pops on my feed I could berate you to my heart's content", "sahabia_masood": "*Failing* Actress", "reallymessyme": "you're love", "samkyins": "Sexy ❤", "username2o18": "❤️❤️❤️❤️❤️❤️✌🏻✌🏻✌🏻✌🏻", "_trisha3103": "She has the guts to tell it like it is..calm ur tits porkis! Calling a failed state a failed state ain't that big a deal! Stop being all over her comment box like insecure, butthurt morons...don't you have better things to do?", "naeemanwaranda": "LOOKING GORGEOUS", "munwar_mohd": "So butiful pic", "_imrankhanofficial": "Bakwas aurat ghatiyaaa", "rajshree8_": "@meghakarel bohot hot h yeh bhaisaab", "aarti_dhanraj88": "@gaytri dekh ye rhi ho Masterbate queen .", "whoisaish": "No one knows this bitch. Pagal ho gayi hai", "kulture_khazana": "Love how you’re so unapologetically real and yourself! You’re a great artist", "iiiz9": "Insulting a hole country and a big religion ( no offense to others) is definitely not the way to make fame and win the hearts of your fans !!!!!!!! Respect everyone and they will respect u ... what you’ve said will be your reputation and what people is remembered by !!! Instead of focusing on your career and making people remember u by your amazing roles and films “ if there any left bec u ruined ur own career “", "crazyplumpqueen": "She's got strong opinions", "kiransuthar_": "She is simply awsme", "i_am_k.k": "Bitch👊👊", "avishekshaw1": "Path breaking photo", "ankitabiswas18": "I admire you so much lady..you should know you are a mind-blowing actress...that's the reality(sorry haters accept it or not... reality doesn't fucking change) and about that so called controversial scene it's pretty normal...I mean come on its 21st century.. people are getting civilized,modern, educated enough to treat these things as very trivial...but then there are people who all are so retarded that they are creating this chaos...I feel sorry for their mentality..", "_miss_belieber_13_": "Hello ma'am mera name Dhwani Soni hai mai Ahemdabad se hu....mai aapki movie veere di wedding ka 2 months se wait kar rahi thi but jab mai tickets lene gai tab mujhe kaha ki yeh movie 18 years se upar ke log hi dekh sakte hai.....mai 13 years ki hu....aur mai aapki bahut badi fan hu....what can I do ma'am", "zuberi_saad": "Bitch ! India is a failing state . Be brave and apologies for what u said about pak . Pakistan Zindabad .. Hindustan murdabad", "kittycat50s": "You are a disgusting racist", "maryamm_f20": "What a cheap publicity stunt recent 2 posts kay comments check karo aur Bakioun kay check karo lmao before this drama nobody even knew you existed and I wish the world could’ve been protected from a mistake like you😏", "hoori1711": "Kuch b phn lo achi nai lag sakti @reallyswara 😆😆", "zulfeen": "You look so amazing @reallyswara beauty with voice", "islamicresolution": "Pagal aurat", "_aach1": "2 number bibi", "usmanejaz71": "Don't know y people pointing for her comment I'm Pakistani to. But what she said her openion not phatar ki lakhir.. She know what is going on pak and India so we r Pakistani and we know what goes on in pak it's not right.. Even in India to..", "anwar4314": "You're so beautiful", "mona_lisaa2017": "Keep your shitty mouth shut about other countries. Eik movie kya kar li she thinks she is a big star now. Shut the hell up HOE GO DO SOME MORE MASTURBATING SCENES THATS WHAT UR ONLY GOOD AT 😂😂 HOE", "weavingpixels": "People need to stop being so naive as to let one person's comments/opinions cause a wedge between strangers of two countries! Specially two countries that were once a whole nation. Are we all soo insecure that one person's words can actually stir up this much hate? We all.know better to not to heed to such comments and to ignore/not watch the movie find ways to discourage negativity. But instead, you guys are letting it be consumed by hate. Wake up!!", "ridakhansweet": "Pakistan zindabad ka nara aoni gali mein lagao..yahan kaheko uske comments badha rahe", "minaal77": "Oye fucking cunt. Tu pakistan ko failing country baad me bolin haramdi. Tu fail actor hai jakay vibrator use kar saali kutti teri maa ki. Wanna bitch. Nangi hokay attention nai milli thi jo aisay comments pass karkay attention gain karai? Ainda bakwas ki tou chukwa lungi tujhay aur ye jo picture me kapray oehnay way hain ye pehn kar bhi kiske sar per ehsan kiya ye bhi na pehnti?", "pakchipakrajababu": "U should change ur name as #SwaraBhavaseer", "fraahe": "🇵🇰", "13shhhhhhhhhhhhhhhhhhhhhh": "You need to simply apologize for your ignorant comment towards Pakistan. Simple as that!", "irtiqaaa.hussain": "Amazing Jesi shakal hai tumhari waisa hi role Mila movie main because you only deserve this. you know why they selected you for masturbation role??? Because they know you’re a 3rd class actress who only deserve this. You ugly bitch 😂 🖕 get a life bitch and stop using Pakistan to get fame, there are many other good ways.", "kayinat.alee67785": "Feminism is not about hurling abuses like men or getting naked and having the right to masturbate it's much more then that u sick mind you and that makeupholic ugly women @sonamkapoor who gave feminism a sick meaning ur kinda feminist is actually ruining ur own country look at ur country before calling others a failing state we are much better in many ways our simplicity has touched many hearts all over globe that's why u ppl wanna work with talented people of my country feminism is having the rights to divorce which is in our religion and having rights on ur husband and parents property which ISLAM gives so Pakistanis are in a better state and just watched the trailer to see what kind a change u r bringing and trust me u made a porn movie which only sex addicts will see or who have secret desires hahahhaha miss free loader next tym try and step in my country will welcome with 👞👡👟👢👡👟👡👟👡👡👟👢👟 u chameleon u c grade pathetic porn women keep masturbating and showing the world u sick women the problem is not with ur color the problem is that ur heart is black in reality 🖤🖤🖤🖤 keep sucking the feet of sonam behenji and her sister who gave u some work and some movie which u never got earlier Looser Lahore Karachi and Peshawar and all cities in Pak r much better and much decent ur country has most number of rapes and suicides and u ppl r toiletless stop doing shit from ur mouth 😎😄", "mubaziralikhan_official": "Wannna tAlk with yu something personal", "adina_butt": "Yeh WATAN Humara hai🇵🇰", "zkallures": "failing actress tattii face shitty face fuck her!!!💩💩💩", "ben_p_og": "You look gorgeous, Swara. You did a great job in veere di wedding. Wishing only the best for you in your future endeavours. Be bold as always. Be happy. More power to you 💪🏻💪🏻❤️❤️", "naimashakaib": "Really sawara ,you are really a aloobukhara and choaara 😂", "hira_rafique_": "#reallysawara i am from Pakistan and muslim and i tell u that u are very beautiful and i am a big fan of u specially when u supported tanu’s stupidities ❤️😂 Sorry if u got heart of my people and their immaturity... 🙏", "_kana_1713": "Peta.", "ayaana_khan143": "👌👌👌", "__________0triple5": "Mam! Your acting in VDW😍😍😍😍😍 i mean you nailed it. Seriously😍😍😍😍😍 iloveyou❤ damn! All your scenes was amazing.. your clothes.. the way you walk.. the way you talk in the movie.. i had gone crazy after seeing this movie.. after seeing your acting.. everything mam! This is the reason why you are a STAR😍 hatsssss offff! Man. @reallyswara", "rakzaa83": "Swara u really need to improve ur acting skills a lot needs lot of training just stop over acting", "daisy0000003": "To all the people saying that Swara is wrong, first look at yourself. It’s her opinion. Stop calling her things just because you don’t agree with what she feels. It’s a political statement and even if she isn’t right it’s her opinion. All her haters are the worse. There are people here saying things to her like seriously bro? You don’t like what she said toh theeke but you are way worse because you are commenting on her beauty, calling her a maid and all this makes these haters even more stupid and they are so wrong lol. Swara is beautiful even if you don’t agree with her statements. And also half of you calling her flop need to first get to her level which you can’t sadly. Enjoy🙏", "raosiyasmruti": "Hii Swara it's really not right to msg you like this but just wanted to comment you that today saw your movie Veere di Wedding amazing acting of yours rather anybody in the flim you rocked completely thank you for the Entertainment loved it lots of love Smruti Rao #ektakapoor #swarabhaskar #veerediwedding", "harshpurswani_": "Impressive 😍😘🚬🌬️👅♥️@reallyswara", "junntbig": "u r an a grade chutiya and now u are saying pakistan and india are so similar - does that mean u calling india a failed state??? as an indian im bloody appalled at u man", "ratansharma0094": "You r the biggest hyporctir even seen", "krnvaidya": "feminism का मतलब ये नहिं है कि हस्तमैथुन जैसी क्रिया को भारत देश मे सिनेमा मे दिखाया जाये। कोई भी माँ बाप नहीं चाहेंगे की उनकी सन्तानें ऐसा कुछ करें । अत्याधुनिक होने का ये मतलब नहिं है की नंगेपन को दिखाया जाये।", "akkihayat": "@reallyswara The only thing that the so called women empowerment movie \"veere di wedding\" teaches us is \"liberated and modern women use coarse language, drink, have one night stands, smoke, talk only about sex. Bollywood has undertaken the task of establishing new parameters of feminism and modernity. All of the above is a personal choice but has nothing to do with upliftment of women. And such movies get big openings 🤦🏻‍♀️", "johnadams1425": "Isne to Pakistaniyo ki le li😂😂😂😂😂😂😁😁", "khushbookhanna75": "Please guys stop trolling her...I THINK SHE WAS THE ONLY REASON IN THE MOVIE \"VEERE DI WEDDING\" THAT THE MOVIE IS GOING WELL.SHE IS ONE PERSON WHO GAVE HER 100% TO THE MOVIE AND IT IS NOT AT ALL LOOKING BAD❤❤SWARA U WERE AMAZING IN THE MOVIE💋I JUST LOVED SAKSHI SONY'S CHARACTER😘YOU WERE THE REASON BEHIND ITS SUCCESS😘❤💋😍😍", "iamrealvishalsharma": "Loved your work @reallyswara. It takes hard work to act on the screen I hope people can open their eyes and stop being negative. The actors are just following the script, so we should see the whole act. @reallyswara great job. You look wonderful. All the best ..", "mori_pk1990": "Behen chot.fail tmhari maa hui h tum jaiysa randi peida kr ke.laanat h tum jaiysi haraam zadoon ko🖕🖕", "vinodapawar": "Hi", "kshitijtarun": "Ma'am @reallyswara am a fan of yours ♥️ basically crush 🙈 sorry but ma'am ♥️ i am greatest fan of yours! 🙈♥️", "hannah_rulezz": "They shud fix ur big mouth too @reallyswara", "rohmanisar99": "I must say WOMEN ... Kbhi life mein itni attention nahi mili hgi 😂", "1392vv": "Really loved ur character in VEERE DI WEDDING..... u were awesome 😊👍🏻", "fatidps": "Ugly inside out 💩🖕", "syedzohaibhashmi06": "FAKE Loser !!", "aadhyavyas": "You were amazing in the movie", "swara.bhasker": "❤❤", "teamyouniverse": "❤️❤️❤️❤️❤️", "marjanahmad": "Failed actress @theycallmesnoopy @sohahsheikh @sherbanojaveri", "priyyayadav": "Hey @reallyswara i just saw your movie and your acting was mind blowing i loved u.i loved ur movie", "marz_rm": "Whore!", "mahrellous": "cheapster lady..failure lady of failure state 😂", "nazish_e": "the movie was not banned soley cuz of her, so why to spew poison? She should have respected the decision of our censor board.. What is ok and normal for india is not ok for us. cuz our culture and traditions are based on religion and modesty and are very different from them. its high time indians need to understand that. Women here do not live like this as shown in movie and so to watch it on screen with family members is not comfortable. we are not that westernised and have our moral n religious values that we are v proud of.", "riyaztejani": "Pretty", "aniqa_haroon": "Failed actress", "lifewithvishi": "Swara Bhaskar do you realize how big mess you have created between two different citizens by just one statement. Please clear this out. Your posts has got so much of negativity and hate. People were lamenting you and now India for like so many stupid reasons. Please take a stand now. It's better to live peacefully. Social platform is for awareness and raising information for a cause.", "sweets2314": "Honestly FUCK you @reallyswara, what started as ignorant bs from your shitty mouth has now turned into an Indo-Pak thing with people here. Thanks for inciting this, I have never hated anyone in my life but I hate you from the depths of my heart, you fucking BITCH!! 🤬🤬🤬", "preetikunalpaliwal": "Swara Tumne apni movie k bahot se video upload liye h instagram pe... Masturbation wala bhi upload kr do... Qki Tum sochti Ho kuch galat nh h Isme toh... Acting pe dhyn do...", "ismaamreen": "@reallyswara Pakistan is the country that you referred to, in 2015, as the \"Best county you have ever visited\" ... So this reflects u as an ignorant person who is also quiet contradictory in her own statements. I don't know about Pakistan but for sure you come as a \"Failing Human Being\"!!!", "abhakhurana_": "Just came back after watching the movie. Your character was the best and you nailed it with your acting", "freedomofspeech4us": "An ugly soul can never look beautiful #uglyinsideout", "ikanchan007": "You completely stole the show ... best performer in the movie ❤️", "tejalkokate96": "Hello @reallyswara just loved yr role & your attitude in the film u were amazing 😉 😘 just loved it 😘", "rohan.adeel.7": "Ja suicide kr ly Duck tery jeevan ki koi awashkta ni hy.", "aakriti3165": "Hey swara u r beautiful inside and outside u dont need to bother about sich type of shitty people who say shit about u", "umy_e_hanii": "Bitch", "sassymomworld": "Favourite mine", "annaayy_yyy": "A failing woman standing with a failing mind", "anumashrafkhan1986": "Ugly beeeeech", "deepaksingh7463": "I hate hu", "sohail.3864": "@reallyswara main apko bht respect krta hon. Or han plz phle jakar kise acha school m bolna sikhoo 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "jaya.sachan.125": "Beautiful", "anshumaanmajumder": "Jaha dekho pagal vmbhare hai social.media me", "08.aug.93": "Not bad I thint", "stylside": "Attitude!", "barfly_mayank": "jo movie bnai h tne veere di weeding vo women empowerment ko ni...tm jsi aurto ki raandi pantio ko dkha rh h....yhi chti ho ldkia one night stand kre... drink kre....thuuuuu bc..", "baharina_tanweer": "You need to fix your mind and heart first hun😘 oh and your general knowledge too😗", "_merjanah": "Such a bloody loser 🙌🙌🙌😂", "komal.311001": "Baji with double standards ..", "roamersndseekersz": "You know your a flop actress... when you don’t get attention for your performance... but for the shit you utter in interviews... rip swaras career... if it was ever even alive in the first place", "rajukarnwal": "Her चीज dikhani jroori nhi hoti. तेरे baap ne teri माँ को choda h jbhi tu aai h to iska mutlab ye nhi ki vo apni video bnate or तुझे दिखाते. Movie baap बेटी bhai bhen sab dekhne जाते h to ऐसे सीन mt ही डाला kro. जो चीज natural h vo to h iska mutlab ye nhi ki दिखाया jaye", "anushmita9": "U r awesomee.......", "officialomkar": "❤️", "raveesh_mantra": "Sonam Kapoor and Kareena Kapoor ke sath kaam karke ab Swara Bhaskar bhi rich dikhne lagi hai 😂🙈😂🙈", "sunil.2949": "Congrats now ur movies r available on xnxx", "chalti.phirti.galti": "I don't think any other term could've been used by Swara for a failed state. Well, Pakistan is a failed state.", "sumit2829": "Manishankar ayer's daughter", "_xzotiq": "Pakistanis y’all about Indians year round, but once an Indian says something there is a big issue?😂 please remember, our religion says pride is haram. Relax and enjoy the last few days of Ramadan. Literally you all are stressing over nothing.", "night_king_0001": "Nice", "__xo1xo2xo__": "You know tumhara Aganda kya hai... Ke tum is dunya ke logo Ko batana chahti ho. Ke 'Suno' Idhar Mai Bhi Hun.", "x_nomii": "Shame on you, 🖕🏿", "aiyesha__": "Swara bhasker vocabulary homework: Learn the meanings of 1) secularism 2)sharia law 3) freedom of speech Also research •the atrocities committed by the BJP and Modi towards ethnic minorities and the misogyny that exists in Indian society ! Then Answer Who is really a failed state ?? #doyourresearch #dumbwomanlogic", "sara.ifti": "Hope s0me0ne fix your brain too!!!", "arsuyzeefah": "Lmao she said \"pakistan has worse vocabulary than we do\" and yet her English was awful. She has no respect. 🙂", "ankitarnav": "Nice", "beingyani_bagang": "After watching veere I'm big fan of urs...your acting was just 👌👌💞💓💓💓", "roshni.nigam.9": "👌👌", "akashbhuyannn": "Just loved veer di wedding you all gurls were on fire more power to you ❤🔥", "anamrahimi": "A failing and racist human being . #Sawabhaskarfailinghumanbeing #sawarabhaskarracist", "iamnikitasha": "Beautiful", "harsimran_sandhu.796": "@reallyswara u r bitch in film industry. Kya gand daala hai tune. Taange khol k scene de rahi hai tu. Sala paise ke liye kush bhi karegi.", "ronisutradhar56": "Masturbation queen 😂😂😂", "hhgfyjgjk": "I love the unity of our Pakistani people in this post. The love for our country is beyond. Take notes. 😌😌 Always Pakistan", "aownii": "U have a career which is failing so now u want lime light well u got it", "jassy0012": "Loved u in the movie @reallyswara 😘😘😘 keep going 😊", "_vaj_x": "@ujjibaksh LOL at the hate this woman is going to get on every post she makes 🤦🏽‍♀️😂", "xaxlicex": "For all the Indians saying Pakistanis are \"over reacting\", when Snapchat called India a \"poor country\" y'all had the exact same reaction. It's only fair. Nobody likes it when their country is insulted. Just sayin'. Peace ☺.", "xoxo_1437": "Nobody likes you . You need to watch what your saying next time you try so HARD to sound relevant and smart LOL 😂. You are the most hypocritical person ever . Ignorant uneducated stupid lady @reallyswara", "laraibhkhan": "You've lost millions of fans from Pakistan jbtw 🤷", "fatiwaqas": "Shame on you flop actress of flop india", "manahyl": "Tsk tsk. Thought you’d be better at issuing an apology! Terrible damage control Swara. You need a new PR agency. Xx", "itxshaheer": "👎👎", "ramshaeeey": "A Failing Woman Herself 🌚", "iramhayat1": "@reallyswara vese to hamesha jahan dekho comments m hindu Muslims ki ladayi dikhti thi,,aaj India pak ki ladayi chal rahi hai yahan😂😂😂😂", "77_farhan": "Ugly 😲", "_ayeshatariqkhan": "Nayi nayi Ameer Hui Han AP ,😂", "bebss__xx": "Lol swara hope you read all the comments and enjoy them😂 look! You have No Right to say any shitty things about PAKISTAN or about any country! And next time think twice before saying the shitty things about the countries. Fuzool Actress. Side Role kia mil gya Is movie me Sonam or Kareena k sath tum tou hawa me hi Urhhne lg gai😏 Over Aurat.", "intojungle": "Hypocrite kameni awarat", "nidaglamour": "RETARD 🤨", "daffodilss_": "Ugliest of all", "sherryrukhkhan": "#Hypocrite", "devyani_89": "I have a request. Please tell us the lipstick shades you use. All@are so beautiful", "_shehreyarwazir": "Fking midget", "archistewart": "U were gud in veere Di weeding 👌", "planet_green_eyes_attack_u": "Y r doing amazing and ur character in d movie is awesome... We love u", "anikakhan8": "So you wanted Indians to like you by saying bad things about Pakistan .. well you are a looser and this fact won’t change !", "iamzainkhan_": "Take your words back into your ass. Such a hypocrate lady. You should be ashmed. Tell the people how much you have aided with money? India is a failing state. Dont compare your dirty india with our beautiful country. PAKISTAN ZINDABAD 🇵🇰🇵🇰🇵🇰", "droomdoor": "Going by the comments Pakistanis have made, it is very apparent how low self-esteemed and racist they are. When they call Swara a maid, they're referring to her skin colour/looks. How pathetic and low. If you believe your country isn't a failed state, why bother? One thing is clear, Swara shouldn't visit Pakistan as she may not come back alive. #RealPakistanis", "fairu23": "Lahore ae ti y bitch tb to bht bichi bichi jarahi ti k Lahore Lahore ha ab isko maut par gai ha bloody third class failure hoe 🤷🏻‍", "_lovethehate_": "Guys stop abusing her... She only did for what she was selected.. It was only a role dedicated to her by director. N she done it very well.. Yur comments r proving that she got fit into her role n she is a very good actor for such real acting.. 🙌", "hamza_bin_zafar29": "You are RANDI KI BACHI", "hira__f": "@sonamkapoor I have a humble request please cast a sincere person next time in your film..", "sanawaqa2192": "@reallyswara fake woman", "tasnimmmmm.11": "You are a pure example of having a backwards mentality. You have gone on about how this movie is to be viewed by moving on with times however your speech says anything but that. I’m an Indian myself and I am disgusted to have you as one of the faces of Indian television.", "triptiagrawal715": "U rock swara ma'am.... Love you from the bottom of my heart 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘@reallyswara", "karanjoshi_instalive": "KéhRr👌😉😘😘😘", "abhishekverma5000": "Hypocrite", "shinie.borah": "I like Pakistan and its people, and I am an Indian. I know, whatever she said was certainly wrong, but, still people shouldn't have reacted that way! No offence, but, the issue was kinda exaggerated, if you believed that what she said was wrong, then you should have given no attention/reacted to it. 🇵🇰🇮🇳 🙏🏻🙏🏻 (I am just a 13 year old girl from INDIA, so please, no hate)", "hinagulxo": "Bekar aurat lanti aurat", "zynat1965": "Hate monger!!!!", "rizwan_natyanshian10": "खूबसूरत तस्वीर ।।", "fantastic_anthony": "Swara mam you killed it in Veere Di Wedding😁👍👍👍", "janeetamaqbool": "Bhenchod", "saraa_bash": "Dont u remember your visit to pakistan?you said it yourself it was great", "__mr.harshad__": "So cute", "saavn001": "💜💜💜💜💜💜swara!! Bold and fearless!! Love her", "emaa_hk2": "Okay if PAKISTAN❤ is a \"failing state\" then what about india🖕 a \"rapping state\"?", "ashpat007": "Damn when Muslims get offended by calling Pakistan a failed state even if it's true... Like how Muhammed was a pedophile rapist.", "_ravinder._.singh_": "Hottie", "reallatul": "Wow Swara", "krishnapadsumbia": "Nice pic dude", "pritammajumdarr": "So beautiful", "avi.dr": "U just Rockeddd the movie....VDW......u were the red mirchiee of the movie......keep it up💝💝💝💝", "ayeshaqzi": "aunty", "sarahahano": "Attention seeker.", "london_beautyslaon": "Looks hideous", "jigztatsme": "Sorry this is not the place to say all this but I don't know how to reach u...", "princessrositta": "Awesome you are girl!! Love you!", "enrico8816": "😍😍", "vision_138": "Love You swara 😍 @reallyswara", "piyush.pnd.666": "I loved u at need bate sannata or anarkali of ara... Those performance were really best", "ramkishankishuu": "U look good 💕", "saulleeha": "I never knew she existed until a day ago, and I'm only now learning how awful of a person she is.", "neelam_ab_": "Bitch", "surendra__bouncer": "Suprb acting in vdw....", "randomnnpc": "Look at all these dumb pakis, listen little terrorists, the land you call \"Pakistan\" is not a country, it's Indian land occupied by terrorists like yourself.", "meesam_abbas_ali": "You are the most flop actress", "suhaib.khalidmahmood": "🖕🏻🖕🏻", "d_j_nik_rajkot": "🇼🇴🇼❥━━━❥🍒😍💟#Sweet🌿🍒😘🍹⏩#Lovely🌿", "dr.zaleenarbab": "I am a doctor and pakistan didn't fail me as a nation by providing me good education , health and emaan ! So for me it's not a failing nation :)", "fenil_vk18": "❤❤❤", "alishbay121": "Beta jitny marzi brands pehn lo pr tmhri shakal pr jo nahosat baras rahi ha usy koi b brand nahi chupa skta", "s_kpwp": "🇵🇰", "pkkataria.2": "Wow what a performance in the movie just loved it", "_abdullahkhalid_": "India is a failed state! A very illitrate country! With 0 vocabulary. Indian govt should do something about it #dushmankadushmandost", "chubby_baee": "I was in the same theatre yesterday damn😩☹", "zaara_rajput": "U suck to death @reallyswara", "covid_19_lockdown": "Big love❤❤❤❤❤ #fuckhaters", "ashwini.gcae": "Looks pretty...", "shreya__khandelwal": "Contour on point ❤❤", "thanos_from_titan": "Why are you mastrubuting? Just call me ,you will be in heaven", "minam90": "Bitch will always be bitch ..", "mahvish.x.mr": "Those r not \"pumps\" lol", "thegirlfromanothergalaxy": "Can I please borrow this?❤️", "anna.hussainx": "Before chatting shit about somebody else’s country please look at urs!! Honestly ur comment was so ignorant calling Pakistan a failing state!! Yes it may not be perfect but neither is India so plz before saying such things think twice mate cause ur ignorance ain’t gonna take u places!! Never normally interact in such social media debates but honestly couldn’t hold back into writing this!!", "ena_kataria": "Hey..i saw ur one of ur interview..u said u dnt hav fans..thr is nthn like dat..v really appreciate ur work in Veere..ur efforts really makes a diff in ur personality..let people say wt day wnt..u js step ahead nd ignore thm..gud luck..wish u d best 👍", "sawantprasad761": "Love", "ileana_d_cruz_fans": "nyc looking", "jimaand": "Irreverent and you’re over a moon because of a side role in which you masturbated cuz the other lead actresses would never. You’re like the ugly sidekick", "09876mnbvc_": "Suar ki aulad shakal dekh apni hijrey ki paidawar", "khotanipadma12": "Today I've seen VDW, oh my god swara.. you were outstanding.. don't have word to appreciate you just love you ,😘😘😘 keep going on, god bless you ...", "mariyyumm": "Your comment made about Pakistan is completely accurate. Just look on the news, a women stabbed 23 times, and her attacker gets away with it? The only way a countries issues can be resolved is if the issues are brought to attention and accepted. These overly nationalistic people dont have the balls to accept the failures of the country. Yes Pakistan has developed over the years but overall a country that fails to protect women , is indeed a FAILING STATE. If you dont agree with her opinions and become buthurt about it then frankly stop following her on social media, and stop watching her films.", "indus_lander": "True, Pakistan is a banana Republic.", "taqwabhat": "Fa", "better_4u2": "Vile attention seeking woman # getalife", "sophiag_65": "@reallyswara fix your attitude and apologise", "nimra_3.14": "That time u came Pakistan and were welcomed with open arms??? That was the FIRST AND THE LAST time u ever get such izzaat from Pakistanis. After calling Pakistan a “Failed State” its safe to say u’ll never get the honour of being in the Soul City “Lahore” anymore, and if u ever do come, rest assured it wont be with open arms as we have no dignity left to give to you, because u urself have none, and especially because of ur prejudice comments about our country. Dont expect anything from Pakistanis and Pakistan in general hence forth. Peace out ✌🏼", "sunitavijay2": "You were so good in vdw", "areejistik": "Nahoosaat ni jaatiii", "pakistani.mixplate": "You got attention after passing an un-true statement..That's what you wanted!!!! So glad that your movie wasn't released in Pakistan!", "nischalpant": "good looking", "mehwish.naeem18": "What did I just see? Oh yes. That’s a bitch face. Hate all over from Pakistan to your way. You dumbass hypocrite bitch.", "dinesh_shetty11": "The word 'star' doesn't mean an awful lot to swara....swara is the SUPERSTAR after veere di wedding🙏🙏🙏🙏🙏🙏❤❤❤❤❤❤❤❤❤❤❤ @reallyswara", "manishparikh79": "Too good work on Veere di wedding movie... simply awesome...", "zayer_farook": "Failed actress", "dr_bazzinga_": "Amazing acting ❤️❤️ Veera di wedding loved ur character so much", "smithapereira": "I love yr acting and especially yr voice... Grt going all the best for yr upcoming projects", "aysan_1x": "I really dont have to see you sh**ty face because you are really horrible, shut your mouth you B grade actress just shut up and dont speak against my country STFU 👎👎👎 *hate*", "abidhussain300": "Beautiful", "hot_desire5": "Wow gorgeous", "anamjavaid448": "@inzi_kraxh ye hai wo larki", "dream_girl_3425": "Best look Always your Singing is Super super hit", "thesimrahkhan": "Ugly 💀", "nakwankwasiya": "Hiiia", "ishamahajan_214_": "U beauty❤", "anjaligovindrana": "@trulyarij finally a sensible pakistani citizen", "aylaa.ig": "Let’s be real now! This women isn’t as pretty then a lot of the actresses now days and age isn’t on her side. You will never see her in a leading role. Her days are numbered so I’m going to stop sweating over her statement cos she’s invalid as a whole. @reallyswara", "javeriaanwaar": "She doesn’t even have the guts to say sorry What a low life person she is! #uglysoulsmakeuglypeople #pakistanzindabad🇵🇰", "qudsia.a": "Lol if she's going to point out our grammar, it's only right that someone makes her aware of Indian pronunciations. What a shallow ugly person you are @reallyswara I'm in favor of banning any movie that has her in it. shame on you ! u are a shame to feminisim with ur ugly soul. #failedhumanbeing", "prachi_p23": "Your acting skills are dope. 🙌 stole the show in the movie. Much love ❤", "shubikirdwal": "Loved it 😍", "kroseb231": "Let’s be realistic the morning vie is only hit because if kareena 🙄", "zeshijikalu": "FloP & a FaiLed AcTreSs! 😎", "shabahat_ejaz_buttar": "Duck face😂😂", "mukundhanpillay": "What an acting..... U deserve it....I love u so much ....", "cleopatraalfassa": "BOSS # BABY 😎 LOVE LOVE 💜💜", "trulyarij": "I don't think @reallyswara is a bad person I just think that what she said was a little rude because Pakistan has its own culture, it isn't guided by sharia law also even if a country is governed by sharia law non muslims are still allowed freedom of religion, they just have to pay a tax! Pakistan is just a little more conservative because its a (mostly) muslim country, there are Hindus, Christians, and other religious groups living in Pakistan too! And its also not a failing state! But, Swara has her own views and is free to share them so we shouldn't bash her, I mean she was only trying go get her movie to be in Pakistan so her Pakistani fans could watch it, on top of all of that she has friends in Pakistan (she said it in the intreview) so why would she want to bash their country! By the way I'm Pakistani.", "eishaathar.11": "Ugly personality ugly heart ugly face. would love to see u burn in hell or worse.", "hoorii._": "🇵🇰🇵🇰🇵🇰", "seema_m_sh": "You need a lot more than just 'fixing up' #failedactress #failedhuman #snake #ungrateful", "__sweraa__": "U thought ke ase kar ke tume fame mile ga? Aur zalil ho gayi ho tum", "anjumsheharyar": "Kabhi pakistan ao toh tumhe batae pakistan kitna peacefull country hai tumhe toh kapre pehnne ki tameez b nahi hai veere di wedding main tumne bra toh pehna nahi kia india main itni bagherti hai ya india main aisa hota hai na pad milte hai na bra idiot girl", "kesha619": "You should change your name to 'fakeswara'.", "ozmn23": "Failing Actress. Failing shit", "shaista_322": "buddi aurat😂😂 she is so ugly yaaakhh😂 actress wala koi face he nai shakal se he lannat baras rai ab iske chamchay ajeyngay chamcha giri krne", "sunjeev_sharma": "u r really attractive. I like u so much.", "uvibib8b": "@reallyswara veery di wedding mai sb se best scene mastubration wala tha jis ki waja se saari indian larkiya ab mastubration krna shru hogai hai ab in se koi shaadi nahi karega ap ki waja se", "zaima_princess": "Plzzz guyz dnt troll her", "faaiza_panhwar": "Loser.", "sykaaali7861": "Someone should fix ur brain", "pari.priyanka_": "Wow", "rajendra_1705": "Aur bhi movies ki hai Swara Bhasker ne, wo dekh acting dekhni h to. Samjh aa jaega acting kya hoti h.", "naz__ellahi_": "Peeps just boycott the shitty movie with crap over the top actresses Kareena is to old and over acts sonam can’t act to save her life this one is non existent other one never heard of story is nicked from sex in the city boycott was going to go with my group of girls but we all boycotting as her remarks are a disgrace!!!", "pragyan1009": "You r such a disgusting stupid person. Shame on you", "ashwaryacoolest": "Kardi na movie flop bak bak band karo thoda beti", "aayesha20199": "Stubborn AF", "sanamssss90": "Ugly ugly", "samanyasir10": "Unfollowing u! Cuz u r worthless and don’t deserve a follower from Pakistan! Shame on u", "abhiroop_anand": "You are a hypocrite swara. Shame on u. After seeing vdv i felt reduced to a penis", "6792_zorooo": "Ab gaaliya kha madarchod sale dogle log thuuu failed actress", "amber___raja": "I hate u double standard women.....U r a B***H", "umang_25": "You need mental health treatment", "ishiitaaa___": "Woaaahh🔥🔥", "iamprakashyadavanshi": "You did a great job in Veera de wedding your acting was superb focus on the positive part we love you more now don’t listen to other idiots you are amazing 💕🔥", "daksh077": "You are the best Swara.. your acting in veerediwedding is outstanding.. loved it and keep it going. 👍🏻 cheers on your success 🥂", "meeranbashii": "😍😍😍", "aneesashaheeen": "You really need to educate yourself about shariah law dumb bitch, think before you open your big gob wannabe failed actress", "twinkle_katare": "Looking beautiful... What a pose 👌👌", "allah_is_one_xoxo": "u have no right to say some thing against for our country .... im sure yu just do this for sasti shohrat ..idiot...", "harleenkaur_0009": "💗💗💗", "ujjawal221197": "Looking so cute and so charming", "tawdepooja": "😘", "meghaarawatt15": "Hey beautiful 💥❤", "ajaysoni3073": "So sweet", "fizza84g": "She just dragging Pakistan to make herself talk of town. the more she's famous the more people will talk about her and her upcoming movie. Its just a trap which once done by saif ali khan when his movie phantom i guess? was about to release. She knows dragging pakistan will create a hype and the movie will get successful. Lol (at least according to these fools) you will see she will say sorry soon once movie release. Now phantom movie saif ali khan and this veer wedding kareena kapoor khan in it. Do you guys see the connection? Lol", "travellersstudio": "Pretty 💁", "wandergirl.s": "The choker is beautiful 😍 but those shoes look really uncomfortable 😋", "dilpreet.0022": "Vibrator girl 😂😂😘😘😘😘", "miss_r_khan": "Thori izzat kya mili dusry k mulk ki bezati karogi ? Mtlb bak bak bak bak bs in rehna h acha nh kaha to bura b nh kehti jb koi janta nh ta tb Pakistan ne apko izzat d t or badly m ap ne kya kia just think about it @reallyswara @reallyswara", "javed_ahmed_143": "This is not bad", "renusharma1616": "L", "iam_sunnykumar": "Beautiful", "kmahvash": "Maybe spend some time on ur inner beauty and diplomacy and how to keep diplomatic relations between the countries as an actress that will probably be much better", "fierylittlemermaid": "Wow ❤️❤️❤️❤️❤️❤️", "n.vsoni": "😍😍😍😍", "dhanak_langeh": "Loved ur acting♥️", "nikitanagwani": "Hey you were amazing in the movie! You killed it totally!! Kudos! God bless youu 😇", "swarnima_saran": "I must since I can here ,you were simply awesome in the the character ,too good in the movie ,each and every moment.luv and Grace to u ,keep rocking .", "wistfulsoul_dhaval": "Love your act in veere di wedd", "samiiiac": "Ugly disrespectful ass hoe", "punit_jagnani": "#soo_beautiful👌😍😘❤🌟❤", "rosy._sharma": "swara lots of people are jealous of u they r comparing u with rakhi savant", "vipin__parmar": "❤❤❤❤❤❤❤❤❤❤❤😍😍😍😍😍😍", "aminahallii": "She’s a horrible person, but it’s fine, she’s just salty about her failing career. That’s why they had to make her the crabby sister in Prem ratan dhan payo, because her saltiness was just so extreme. She’s pathetically stupid. I doubt she knows what secular even means. She thinks because she starred as the lead in one movie, she’s some great actress. When is someone gonna tell her that the only reason anyone went to watch the movie was for Kareena, Sonam, and Shikha. She’s irrelevant and annoying 😬", "parmjeetmalikp": "Looking beautiful", "kamaleshchary": "we want more from you other than masturbation", "khushbook3513": "Wow 😍😘❤", "medhu1993": "Awsmmmmmmmmm😍😍😍😍😍😍😍", "drashti6779": "🔥", "urvi.gogri.7": "Ur work in veere di wedding is jus remarkable.. gorgeous , hot n spontaneous..luvd it", "jhoney_dubey": "Bhikari Saali bhade ke kapde Pahenti hai rand", "iwasii.photo": "@reallyswara you say Pakistan is a failing state. My observation is that you were talking about how they treat the women living there etc. This is one thing that I think makes a country great and how they treat the women. Compared to India I can say that their fashion industry is more inclusive to the women they service then the Indian fashion industry. A lot of the top Pakistani designers and many stores make clothes for people who are \"PLUS SIZE\" at a very affordable price. Meanwhile the Indian fashion industry and many premium designers are charging upwards $500+ for sizes that only service people who have a chest size of 40 inches and have a trust fund because lets be real how can a ordinary personal with regular income afford a designer clothing such as @sabyasachiofficial @manishmalhotra05 plus many other brands . Affordability and comfort shouldn't come at the price of a whole paycheck .", "aaliya268": "After all those hate comments you keep coming back and rocking it every time. I am really proud of your achievements and I do look up to you as a role model 💞", "manish_dohare": "You r really i great actor. I loved your acting esp in Nil battery sanata 😍😍 awaiting your movies. Btw u were great in vdw 😍", "ariana_rodr": "Hate u", "deependra2312": "So beautiful 😍😍😍", "jasminemehra_55": "Keep rocking swara u r very beautiful 💛💛💛", "devikaxx_15": "❤❤❤", "tonystark_shubham": "Swara💖💖", "karan2375": "Ugly shit. Ones mentality reflects on ones looks.", "shreyashambhavi": "Stunning", "sakshi_tiwari_gurehiya": "Keep doing such characters #sakshisoni dis man dominating society needs to see some real balls!! #love", "nikitaverma6246": "Amazing actress👌✌🤗😘😚😙❤👍💝🔥", "mr_nishantsolanki": "Nice", "i_m_nazakat_bhatti": "Flop actress", "sulakshana4192": "❣❣", "nhfsa": "Filthy cow", "wild_cat007": "Swara bhasker nahi swara bhainse 🐄 kar hai 🤣🤣🤣🤣🤣🤣🤣moooo mooo mooo 🐄🐄🐄🐄🐄🐄🐄🐄", "voguishtraveller": "Boss lady ❤️", "fuzia1611": "Please please", "khemeshwari_nag": "Love u @reallyswara", "aiiisha.s": "Ppl stop giving this wannabe moron all the attention she soo wanted all her life....", "tia_1666": "You’re absolutely gorgeous 😍😍😍", "radhee.krishna": "I love you swara.. i just loved ur performance in VDW.. you nailed it....wonderfully performed...", "_abhi__singh___": "Shame😊😊", "arusha_kaanx": "Sonam ki chaprasi nd nokar 😂😂😂", "diariesofwork": "What that neighborhood has done to us. Just tell me. She's right in her own aspect. When their law and order can't give justice to Khadija who was stabbed 23 times and her murderer is being acquitted by their court. So isn't a failing situation for their country? Why Malala Yousafzai is fighting for the good will of their female population. Every time the neighborhood violates the ceasefire and our soldiers are getting martyred for the supreme sacrifice of the nation. What they have given except betrayal since 1948? Nothing is the answer. Wont support non sense atleast.", "faiqa_adil": "What if i fix your tongue too 👋🏻", "aakarshan2096": "❤️❤️💚💛💛🧡💜🖤🖤💝💝💗💗💗💖💕💔", "bilaltoor1": "Fazool pic", "ahana.roychoudhuri": "The choker is really awesome 😍😍😍", "matungdb": "Wowww lovely love you", "yash_ontheweb": "Failed state 😂 Rouge state 😂😂 Terror state 😂😂😂", "mr._pk_": "Hot", "kuldeep_oswal": "Rock darling", "sudarshana_27": "Looking very gorgeous maam", "hopelessmaniac_": "Lovvve youuu❤️💓💞", "banomehr": "Swara be brave and apologise. Come on you can do it 🇵🇰🇵🇰🇵🇰", "sanabahadurkhan": "You still have an ugly heart, doesn't matter how much you groom yourself. Everyone now knows the real you. Count your blessings you were able to get casted in a movie featuring Kareena and Sonam with you being an extra.", "call_mee_sara": "Lovely", "meer6238": "Bitch", "ghuman_k": "Keep rocking swara 👍👊 @reallyswara ❤️", "sanah_yousaf": "You can never get fixed😂", "bubbles_crushers": "Nice", "sameepa": "U rocked da film...swara awesome...", "sudhanshu_kushwah": "Elegant!", "suraj_humbeing": "Hello! GUNDI Good Morning", "boobal002": "U r look very badly", "amrita_prasad27": "@reallyswara I can see glimpses of Sonam in you", "rajveer_rathod__akela_veer": "Me movie sirf sawara ki nautanki dekhne ke liya gaya thaa 😂😂😂😂", "udaysoniind18": "👍👍👌", "_ruchijain78_": "U wer stunning😍😍 ua acting N ua attitude was killer😈😈😈🔥🔥", "areeba_rafi": "Double face personality", "vickygurjarrr": "wow swara kitni pyari lg rhi ha tu", "_ham_na_": "Loser", "barbie_dimi": "Nice", "onenonly_natasha": "Wow", "angry3276": "👌👌👌☺️☺️☺️", "rachana_kmwt": "Looking gorgeous in black ❣", "marvelous_marvi": "You need a lot of fixing up that’s for sure!", "sayali610": "You were amazing in the movie✨❤ @reallyswara", "manangarg008": "❤❤❤❤", "akhil_singh_rajput": "Awsm", "aayukta.sharma": "So cool ❤❤❤❤", "adv.robinghosh": "😊👍", "_abhinavrao_": "What a path breaking photo !!", "nivijalan": "U look lovely", "_dhillon_302": "😍", "yash.2125": "Awesome pic...@reallyswara 😘😘😍😍", "impriyashree": "❤❤❤❤❤", "manasgaba2794": "Gorgeous look nd pretty cutee", "tapsi_dhillon": "nyco ❤️❤️❤️❤️❤️❤️", "rheroll": "I love you 😍", "suchismitadass": "🔥❤️🌸", "its_me_akhila_reddy": "❤❤❤❤❤❤❤❤"}