{"realrahultomar": "Looking as like slut bar dancer 😂😂😂😂", "vijetagulfam": "lovely picture..... Swara ji, excuse me if I look like an imposter... I have joined instagram today itself.... actually, I've written a script... want you to do the lead in it.... I've messaged you on your facebook page... I hope that at least one of my these two messages reaches you...... and I don't have to spam you anymore... hehehehe...", "samarjeethande": "Beautiful nice sexy", "tejashchaute": "I love you swara", "atrichakraborty93": "😍😉😘❤", "viralsolanki_": "#looking #gorgeous..💐", "spd01061964": "Stunning beauty love you Dear", "modelsandtalents": "Cool pics, please register with www.modelsandtalents.net..its free and get hired or mail your profile to register@modelsandtalents.net", "kamalpatel165": "Love u", "ewwwwliana_u_there": "Where's your vibrator", "boy.falah752_": "Cantik jelita", "iamtahseen_": "U r so amazing personality in the Universe.", "vishal.bakshi05675": "Osm", "mumbaiactor": "@reallyswara happy teacher’s day.", "devendra.ku.ray": "एक दम जानू दिख रही हो😍😘", "saransh_sagar": "My fvrt actress....All time...U r in movie...Means movie is ...Good .😊u make movie special.", "_itsmukesh_": "Beautifulllll @reallyswara", "amardeep_2020": "😍😍😍😍😘", "im_syed_parvez": "Looking fabulous 😍😍", "arfa.mehreen": "lovely❤️", "travelwith.rayan": "Beautiful 👌👌", "chouhan6491": "Ye pic best pic 👌👌👌", "maiesadniya_9033808408": "Hi", "app_go": "Love you Swara I like how well read, articulate and on point you are ! It’s refreshing to see you ! Never change for anyone 💕", "dish_dash4": "Super coool", "bakhtrizwan": "apna country main reh rae ho jo krna chahte ho kr rae ho na tu kro.. but don't drag us and our country into ur cheap publicity stunts.. hmre vocabulary ki bt krte.. apki vocabulary r tameez b hm na apko film k trailor ma daikh li.. u want ur ppl to watch u dancing in short clothes and using cheap language and callong it freedom for girls thn carry on.. but hmre hn aesi wahiyat film r logo ki koi zrort ni.. hm apna bucho ko aesy ghatiya cheezaen khud tou kam sy kam allow ni krte dikhna ko. r yeh decision hmre nation ka ha.. govt. ka ni.. kindly spare us.. i hope u got it.. ☺Ms.@reallyswara ji.. ☺", "jayant_bola": "Kitne tarefa chahde tne c*", "praveensharma799": "I am really the biggest fan of yours. You are perfect. @reallyswara", "sagar_p_a_r_m_a_r_": "💗💗💗🌹😘", "sha_ruhani": "Nice pic mam", "the_tanushka.thapliyal": "Ptkka 💥", "bnjtsarkar1997": "Miss teacher", "salimakhtar0908": "You are always being my fav", "decent_docc1": "U cheapo..b grade actress", "lawrencevinita": "Holl", "chakraborty_aloke": "Very nice", "mdnaseem.akhtar.393": "So sweet", "raj.art.offical": "😍😍😘😘😘", "faizanyaar1": "This is swara bhaskar.The lady i loved once.Now she has changed & into something evil", "angad__sharma_0090": "Your lips was so hot and juicy", "anumm.01": "Pehle toilet bana lo apne india me pher baat karo aunty", "jose_benjamin_ventura": "Beautyful", "nylascollection": "Flop actress", "azmat_alimohammadzai": "Lovely", "lnverma1311": "So beautiful", "09876mnbvc_": "Bitch", "vbagavathkumar5685": "Always looking pretty and stunning", "___hiba_syed": "@reallyswara I loved ur work in ur recent movie! Uh r amazing! & Probably uh too became one of my fav actress! Keep moving ahead! Dear! Hugs & blessings to uh! ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "rimajain07": "U r the best, you are my favourite. The way you play the roles is the best which every actor should know. You are one of the finest actor in bollywood especially in female. Please always ignore negative comments and hatters, never demotivate yourself. We know you are the best and they are just jealous of your acting skills, long way ahead girl. I love watching you and my favourite characters were in verre di wedding and one in ranjhna, you are mind blowing. I want to be like you bindaasssssss. Lots of love 😘😘😘😘😘😘😘😘", "dhaval.x": "♥♥♥♥♥", "itsmeurfavbrowngirl": "You clearly haven’t watched many movies in your life if you think you’ve ever played something new.", "imsd17": "#reallyswara keep up the good work .. don't let the f media or so called hypocrites take down your confidence .. keep doing your work .. you are doing great 👍👍👍", "ananditasalil": "She looks like @debasreee", "_ajak13": "Loser", "mohanpatel5049": "Sexy women pl.reply", "_ravinder._.singh_": "Hottie + Beautiful", "ishuhot": "You are flop actress And A fake person", "lovdeep_singh": "Love of my life..!!❤️ @reallyswara", "devanshee37": "I like your acting....your acting is natural", "manishbadhel": "Veere di wending superb role 😍😍", "anjaligovindrana": "N i will point finger at @urwatistic she is the one who triggered pakistani ppl n created all this fuss among them i want to ask her being a celebrity how much you contribute your earning to the welfare of your ppl apart from investing it for your personal use being a actress u already know how much efforts actors n all their team put up for making a film n if films like neerja, raanjhana, n raazi r banned in your country thn law of your country is sick fuck what swara said was right if this type of movies r banned in your country thn you need to grow up man u need to raise your voice for the welfare of your country i want to ask her what u did for your country instead of pointing a finger at swara let me tell u a truth @reallyswara was not after fame she has got plenty @urwatistic u were after fame tht a new indian artist said something inappropriate n u out of nowhere jump on i wonder where were u whn pakistani army killed so many innocent indian army ppl whn they were attacked sleeping in their camp #uriattack no stand na this is the difference between u n indian celebrities they take stand unlike u n speak up what is wrong is wrong even if it is happening in their own country they do not fear anyone u were talking about #padmavati controversy na whole boolywood was shaming indian culture for tht they did not defend their country ppl n their so called culture p.s- first make yourself worth to praise", "nickevetts_20lun": "Love the Lunar tattoo", "ratanjijadeja": "Verry nicee", "poetus.maximus": "All you fucks don’t know the impact of your stupid menaningless words, stop spreading hate and get a life!!!! Grow. Up.", "samkyins": "Marry me ❤", "srbjee": "Focus only on acting not on collection, you have talent don't worry Kch to log Lagrange logo ka kam.....", "iamjoylife": "You are amazing Swara.... everytime you appeared on the screen in VDW, the scene became interesting. fan of yours from the time I watched you on screen. powerful actress and I hope directors are able to extract your full potential as an actor... ok jada gyan ho gaya... love you lots", "vivek_trivedi_": "U are my favourite 😘😘😘😘🤗", "masterpieceraja": "jab poster lekar miss swara bol rahi thi i m ashamed that this thing happen in hindu temple though i m against of khatua rape who so ever did it plz give them that punishment that they never forget but the way she said it in temple i opposed it but now whe she said right about pakistan in the movie these hypocrats r saying why she said that earlier these hypocrats were saying u r real human being haa haaa. lastly she is a human what ever she had done earlier is right n what ever she will do in future will also be right..", "iareeshaqureshi": "You are so flop", "sadschowder": "@reallyswara Love you Swara. Don’t let all this hate bog you down. It’s difficult being a critical thinker who voices her opinions in a world full of mindless idiots. You keep going. ❤️At the end of the day, all these people that are bashing you are cowards hiding behind their computers😄", "sagar0380": "Lovely Hot mam keep it up good work and show of reality on screen by u and the director. Dogs will bark do not listen to such hypocrites behind closed doors they definitely will be fingering themselves and here will blame u.", "sharath3679": "Looking so gorgeous.❤❤ Hope you have a successful career ahead", "shrutikahiwase": "You are doing a great job.. we love you..", "sarangdeo": "❤️", "rishabhmaheshwari_": "Sexy 😋", "shyambhosale": "Hottest ever", "umarijaz1084": "You double face (bitch)", "faizxiddiqui": "Gorgeous ever", "barikk.mousumi": "Omg I can't take off my eyes frm uuhhh 😍😘😘😘 loking superrrr in saree 😍😍😍😍", "santoshnamdevsatpu": "Nice", "adityaanand2047": "u r so beatiful but please dont try to become a pornstar", "parisinghh1103": "U r a great actress God bless u", "oxjigglypuffxo": "You're such a fake", "manan.mehta15": "@karantahilyani", "rawat3603": "Nice pic", "himvnshi": "and don’t pretend like you dumbasses don’t search up porn every night and never think about having sex :) y’all cheaper than a local Delhi market. No one here is ‘sacred’ so stfu and stop being dicks.", "padmavati_chunariya": "Plz visit my shop page @padmavati_chunariya", "choclatey_boy_addu09": "Fab..", "chaandrose": "😍", "robin_singh14": "Beautiful 💟", "rathoremonu3121": "Love u ma'am.... U r stunning in vdw ☺️☺️☺️", "karthiks85": "I love you teacher", "deepakkarunakaran": "Cute", "x_lost__illusion_x": "Masturbation expert 😂"}