{"marcos_pangihutan": "Miracle 🔥🔥", "denk_indianmemes": "Lekin tera bhadwa dost to bolta tha k jwan rape krte hai.", "vesuvius_1411": "Go to Pakistan you fucking hypocrite no one needs you here", "_urjitaa": "You go to your beloved country pakistan...no one wants you here...stop showing fake love and whatever shit this is...JAI HIND!!! Bitch!", "chauhansaksham007": "Arre yeah tu na kar......to dewali mana jaa ke. Jai hind kya bolna........LAL SALAM🖕", "aesthetic_beast": "We don’t want your salute for our soldiers. You are lebrandus people’s. Followers bhada ne ke liye kuch bhi krti he.. Pakistan chale ja", "a_mysteriouswriter": "Jo khaniya ka shaat deti hai Jo India solders ka itna virodhi hai tumhare liye to khusi ka moka hai dance karo or celebrate karo is Victory ko", "pareekgajanand": "TUMHE IN LOGO KI BHI CHINTAA HAI KYA", "devid_patel_14": "Marne vale aatnkvadi tumare aallah ke bande the vo bhi bta de", "bhupendra_singh20": "Dikhavti masturbater", "alpharomeo705": "@reallyswara kyu drame kr rhi hai dramebaaz", "pranav4474": "🙏 Jai Hind...🇮🇳🇮🇳🇮🇳", "aliyakhanmy": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 jai hind", "the.lucifermorningstar": "Ab ye bol do ki acha hua ye hena... Bloody hell... Jhuti kahi ki.. Btw inse zyada sympathy to tum us terrorist ko dogi jisne blast kiya. Hena...so called padhe likhe socialist... (bloody idiot)", "j_o_h_n_y_choudhary": "Tera Dil òr pak k liye dhadakta h💩💩💩", "nisha_ydvv": "Sasti soch... Inki insult mt kr apne gobar muh se inko kuch b bolke", "_nambardaar_tya6i": "Tuj jesi ke muh se achha na lgte ye words nikl lodi 🖕🖕#jaihind #jaijawan❤️", "s4snr": "yeh wohi hai na isk baad...no to war k post forward kr rhi thi...drama to ata hai isko", "asis_parmar": "Bc konsi Gali du tuje, k Kumar Ke sathe hokar or ek bar tune apni aukad dikhadi h.", "thak1449": "Jo desh drohi h uski rely me aap jati h jo kahta h jnu me ki bharat tere tukde honge aap uski rely me jati h wha ji wha kya bat h medam kya desh bhakti h aapki", "ps.bhardwajsharma": "Tere asshiq to Pakistani hai", "vishal_sa9": "Bhenchod tu ghadiyali aansu mat Baha....Madarchod tune toh in soldiers Ko asshole bola tha Randi Madarchod pakistani", "sachin_swagger333": "Yu bitch dont show yor crocodiles tear as yu r a nightorgasm queen for these motherfucker terrorists", "its_atul___": "Madarchod kaatvi", "rahul1998goswami": "BC Pakistani mulli..drame.mt kiya kr.chutiyaa .", "harshranyal": "isko kehte he jalle pe namak chidakna😑...", "sachin.biradar10": "I read all the comment even muslim ppl are hating you....i think you are totally mad and disturbed women😡😡", "shehnaazsheikh14": "WE ALL LOVE U SWARA for Your GUTS n FRANKNESS ~ Barking Dogs Seldom Bite", "yashverma485": "Ye unhi terrorist Ko support krti hai sali Randi aisi madarjaat Ko public me nanga krke jala daalo", "shivam_18december": "Fake lady.... Double cross shameless aa thu....", "choudharyshivjuhi": "Fake fake fake.", "connect_2_megha": "Tere salute ki zarurat nhi h humara tamam hidustan ki janta h tu pakistan ja vha maa chuda aapne", "imabrana": "Had time to post this but doesn't had time to post the courageous indian air strike #wow #laal_salam krne me Jo busy thi.. atleast dhong to Mt kr fir ise post krke JB support tjhe naxals and terrorist ko krna h #fakeindian", "mesagarkapoor": "Teri aukaat nhi hmaare shaheedo ko post krne ki pakistani aurat", "cristiano_messi_forever19": "@reallyswara ye dekhawa maat kar pakistani agent tumhe to khush hona chahiye Pakistan ki chaatne waale aur ek retired army officer ko national emmbarssment bolne wale chutiya hai tu", "heyharsh__": "Nice acting aese acting mivies mein bhj krti to kya bat thi😘", "bharatcharan5": "Same on you for money you can do anything ....teri aukad nhi Indian army ka naam lene ki", "anjalianandsahni": "Haramkhor h saali isko hindu logon ko badnaam karne ka shouk h n tab kahan thi ye haramkhor jab godhra kand mn log mare gae 1990 mn kashmiri panditon ke Saath galat hua uspe Kyun nhi bolte jab indian aarmy humare lia sabkuch hn or ye swara ki yahi oukat h islia aaj sab swara ko gaali de rahe h swara bhaskar pakistaan ki ajent h ye bhul gae h ki isko fam Hindustan se Mila h or humara Hindustan itna bura lagta h to imrankhan ke ghar chale jaaen", "pratik_kantode_5th": "Why don't you just take the citizenship of Pakistan.... People like you don't deserve to be in this country.... My whole family and friends are gonna boycott your future movies #boycottswara", "abhiiam1": "Apki strength ki jruurt nhi Pakistan ke liya smbhalo isko ,kaam ayegi ..... Librandoos", "angel_pallavi26": "🙏🙏", "iamsk44": "Hahaha.. chutiya sali .. showoff Pakistan bej iska.. Imran Khan ke pas", "nikhiljain_1": "Desh drohi 😠😠🐷 @reallyswara", "vyompatell": "I am here after reading your tweet on steel core bulletproof jackets that, they can save one from explosions. Seriously?? the lvl of intelligence is too damn high 👏🏻", "keshrisaurabh75": "Jabardasti ki deshbhakti na dikhao aap ....🖕", "sandy_boom__baba": "Nautanki bandh Karo tu ak no ka desdrohi Hai @reallyswara", "vyas_barkha": "Yhi log jb retirement le lete h toh unko tum national embarrassment khti ho waah👎 gdhi khi ki😡 dukh hota h or shrm aati h ye khte hue ki tum hindustan m rhti ho u r a national embarrassment n not him.... Remember", "samarthbarshi": "Aapke condolences se unke atma Ko Milne wali Shanti ab nahi milegi😔", "flankerabhi": "Yaha b acting kar hi di. One thing always remain constant. That's ur B grade or should we say 3rd class acting", "sahil_mehta09": "Kal aapka asli colour dikh gaya", "ii_akashbhardwaj_ii": "@reallyswara bhaag budbak. Pehle izzat krna seekhlo.", "_sanjay_sinh": "Chor ki dadhi me tinka🤨", "saurabh.bhanot": "Izzat karni seekh phle. Ek comment inke against likh de aur pakistani followers mil jynge", "adishahnt": "Fucking hypocrite", "lohit_gowda7": "🇮🇳🇮🇳🇮🇳respect Indian defence you #FLOPOLDLADY, G.D Bakshi sir.. Remember the name and look at you.. Thuu disgusting creature.", "anant9349": "Magarmuch ke aasu na bahao. You insulted maj gen Bakshi . You not only insulted a war hero you insulted the entire army . #shameonyou #pkmkb", "_.sparkel_": "Does she really felt that @badass__warrior @param_vir_chakra @i_bleed_maroon_ @the_firehawk09", "_surmabrahmin_1213_": "Randi", "sugar_buns_baby": "I've started hating u ever since I saw ur tweet...", "mohit_ashim": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "dhruvzi": "Which bullet proof vest can save someone from a bomb blast? Is this even an argument? I know you tried your level best to shift the blame and focus from Pakistan onto India but you failed ma'am. Try harder the next time by giving some logical arguments. What a wuss!", "xyz_hvw_09_": "Rip", "maykudotp": "What about the anti national slogans by your beloved kanhaiya kumar and omar khaled? Dogula banna bandh karo. Pakistan jitna pyar tumhe koi aur nahi karta right? Ye unhi ne kiya hai. Selective outrages karte ho tum log. Dumbos like you sonam and kareena.", "shourya_garg_": "Randi rona mat sali madrchod", "docks_hub": "u are responsible as much massod azar is for this making 44 families loose their husbad , sons ,father ,brother go to pakistan if u enjoy this kind of thing.", "ankitatripathi.30.4": "😔😔", "cmgroup21": "This was the gift of peaceful paki based terrorist. A word for them too", "_sarcasticrider16__": "I just wanna ask Kaunse saste nashe karti hai tu?? U knw u just want to show people how intellectual you are. But instead u r showing ur reality how dumb you r. 4th ke bache ko tujse jyada samjh hogi....but karna padta hai iss bechari ko aisa Bollywood me kaam nahi milta na...isiliye aisi anti-national baatein aur ashleel series karke logon ka attention grab karne ki koshish karti hai!! Inn anti-national logo ko hate ya gaaliya maat do inko boycott kardo yehi deserve karte hai", "mohit.nagar786": "To tujhe kya Mtlb h yrr iss chizz se tu to jaa pakistan or rehle vha bada experience kra h na tune lahore ko,,,,,,,, sharm aati h mujhe ki tu bhi hindu h 😐 #ghatiyasoch #unpadh", "rukkie_gal": "🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳", "black_hat70": "Swara ...pakistan k maa ka boslaa.....aur tum to gaali dene k bhi layak nhi ho......pkmb.aur tere bhi.😠", "anshu_yadav_04": "😇", "__pranshuthakur__": "Sali chutia", "saira_ima": "https://www.instagram.com/p/BueFW2BnxiV/?utm_source=ig_share_sheet&igshid=17inmsg8e5qgy", "__nishaa.8691": "Why are you all being so mean to her ?", "geekguy12": "Aacha bsdi waali ....kya bolu tere pr Pakistan ka lund chusti hai pr pta ni yaha kyu ..#fakeFemi", "iamit77": "Shut up your fucking mouth, why you show fake simpthy to our nation, this is not your nation. #communist #fuckcommunist", "thepankajbhagat": "madarchod sirf dhikwaa kartai hai", "jenapulak": "Huh...Really?Sympathy for army and our country?Since when?", "vin_ek": "Fk off", "sunny_00094": "Hey Ms so called fucking liberal, aaj toh bht jali hogi 😂😂", "rucha_95": "https://youtu.be/JvBMprqZEP8", "jagtap3521": "Are You Indian Swara????No", "roxet6": "Your mouth shut does much good to the nation, especially morale of indian army and common citizen...", "mah_co_co": "Bhut axha hua kutton tm logon ky sth😂😂😂", "memes_by_jammy": "abey ja na behen ki lodi", "lubna_amir14": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻", "shete4177": "Pakistani artists earned money here and are still loyal to their country, some of our journalists and bollywoodiyas earn here still aren't loyal to India.. what is the reason for this disloyalty?", "chirag_girish": "Did you just post this?", "bigg____x": "Indians pigs are dead no one cares long live Khalistan", "chinmay__deshmukh": "@reallyswara , You are the one who promote Pakistanism in India. You post this picture just to keep your image politically correct among your follwers but deep inside you don't even care about the sacrifice of my Indian brave soldiers. People like you should be hang till death .. shame on you swara", "drjayatrivedi": ".", "meri_jaan_meri_shaan_soldiers_": "Or ye v yaad rkhna jung ka elan ho chuka hai..... Agr aoni bchani hai to shant baith chutiya kahin ki.... Ise troll mat smjhna ise dhmki smjhna or ye koi ldka nhi is desh ki beti bol rhi hai jo ki jo tne hag dia hai use saaf krne aye hai....... Imran se phle tjhe hi ghoongroo phna ke nchayege..... Bol ke dekh tu.... Ab....... 🙅🙅🙅🙅Pakistan ki maa ka bhosda tha hai or rhega jo ukhadna hai ukhad le randi🙅... Av taj to tumeri fav thi lekin ab se tera bhahiskar krte hai or apna muh bnd rkhna agr aoni khair chahti hai..... Maine dekhe hai shihdo ki body pas se.... Agr tne ab apni gand khujai naa to allah kasam iss mitti ki kasam or un shahido ki kasam faad ke rakh dege teri...... Chl nikl yaha se randi....... N🙅🙅🙅🙅🙅", "n.sshul": "Kyu dikhawa kr ri hai.... Bt kch bhi ho Pakistan ki maa ka bhosda 😂🤣😜", "im__rui": "Fake woman! You must be feeling happy about it", "vishalidiotarmstrong": "nautanki...bloody hypocrite..Jai hind", "harshitha_reddy09": "🙏🙏🙏🙏🙏🙏🙏🙏🙏RIP", "hardik.singh.negi": "Ma'am What about Saffron Terrorists Now???? Was this Attack done by them????", "just_gloriyash": "JNU का किडा !! रासकला बसकर !!", "urmileshsingh1": "Please do not do such drama @reallyswara ... ohh sorry.. i really forgot, u yourself have written \"dramebaaz\" in your bio... everyone knows that whatever you people do is just to maintain your outer polished covering... from inside you are a really really disfigured person.. in one of your tweet you laughed on kavita krishnamurthi's post... may I know what was there to laugh about on such serious post/ matter? people like you should be thrown out of this country..", "aarzoo780": "That's why you found that tweet funny on twitter.. And re tweeted it... You people are really good for nothing.. I hope God gives you a miserable life.", "manojkumar.05": "Swara le chus mera lauda🖕", "_vibhatripathi_": "I really just hate her", "sidddharth_20": "@reallyswara a showoff that You care", "i_rajneeshdubey": "Bhakk teri ma ki. Bas drama hi kr skti hai tu. Ek bar pakistan ko bhi playcard dikha de tab samjhu . Ghatiya aurat", "jhavasu33": "@reallyswara tereko to Lahore bahut aacha lagta hai na. Wahi jaha ,fake hypocrite woman.", "random_._._things_._._": "Sali tu tukde tukde gang me h or tujhe koi haq nhi mere desh ke shaheedo ki parwaah karne ki unki parwaah krne ko bahut log h nikal ja apne pyare desh Pakistan or waha release karwa virey di wedding @reallyswara", "imsiddharthaanand": "Ye kaise didi aap toh India ke khilaf ho Na bsdk", "oberoi.rani": "Guys jo bhi ho she is a girl n publically ek ladki ke bare me itna Ganda bol rhe ho apne name ki tension nhi h to koi ni but india ka name khrab mat kro", "kpnambardar": "Yeh wohi aurat hai jisne kuch din pehle army ko gali di thi . Ab drama dikha rahi h . Inka koi iman nahi hota.. fake fake biggest fake women", "rahul._pandey": "Drama 👏👏", "ur_pic_is_no_good_bt_i_still": "@torshachatterjee one more terrorist sympathisers! I remember most her pictures and elaborate posts against hindus! But still nothing against Pakistan or terrorists?", "raghvendra_parmar1": "India ka khati ho Pakistan ka bajati ho @reallyswara 😠😠😠😠😠...Flop actress", "an_aaravsen": "Now u selling ur nation fr fake publicity yaar..... Have some self respect..... No wonder u always need a vibrater to pleasur", "pradeep.awasthi.12382": "Jay hind", "surender55": "@reallyswara kyu dikhawa KR RHI h??", "meshram_divya14": "U motherfucker.. apne baap-bhai ko mara dekhti na tab pata chalta tujhe.. hmari galti hai tujh jaise deshdrohi ko star banaya.. tujhe Pakistan me zyada pyar milta hai na to yaha kya kar rahi... bitch...nikal ja yahase..", "rishabh.gandhi.007": "JNU ki aulaad..how come u have sympathy for the army now..", "____siddhant______": "These communists fake there respect for soldiers. Actually communist ideology doesn't support \"nationalism\" because their grandfather Karl Marx said that. These people fund naxalis for their arms, to destabilize India. Pakistan Ko aaj nahi toh kal army dekh hi Legi, Lekin Desh ke andar rahne wale, yaha ka khane wale aur Bharat ke khilaf bolne wale in gaddaron ka kya? In aasteen ke saanpo ka kya?", "labelhastkalaa": "I hate 14 fabruary special pulwama attack 😢", "mrinaltripathi7": "🙏🏻 Namaste", "all_problem_solution_112": "World famous astrologer wahid ali सभी इल्मों के बेताज बादशाह। समस्या है तो समाधान भी है। Guaranteed 101% (Note :- (प्रेम-विवाह) (लव प्रॉब्लम ) (फॅमिली रिलेशनशिप) ( पति - पत्नी में अनबन) (इंटरकास्ट मैरिज) (ग्रह कलेश) किया कराया, सौतन व दुश्मन से छुटकारा, डाइवोर्स प्रॉब्लम, whatsapp now +91-9001919358 love problem solve. husband wife relationship problem solution. childless problem solve by 72 hours..", "shubamsharma3004": "@reallyswara yeh jhoota dukh mat jata tumlog nakli ho khud pakistan jate ho aur kehte ho muje yahan bahut pyaar milta hai .. aur aaj yahan photo lagare ho dikhane ke liye terse to waise bhi ummed ni hai . suchitrakrishnamoorthy ne pakistan ke against post daala to aap hasne wala emoji comment main dalte ho shame on you", "pree2135": "Nikal Teri maka zarurat nhi Pakistan bhaag", "shaikh.kamar.5070": "😢😢😢😢😢", "rainaagnihotrii": "🙏🙏🙏🙏🙏🙏🙏😭😭😭😭😭😭", "sanchita.saxena.shrivastava": "India doesn't need ur fake sympathy", "sangramsinh__4642": "Teri maa ki chut...saali Randi🖕🖕🖕", "torukk_makto_": "listen, I m not interested in hindu-muslim here......the point here is These assholes tried to connect the crime with Hinduism.. Then why don't they connect terrorism with Islam..... Crime and terrorism has no religion but they have to target Hinduism or start a propaganda of \"Bhagwa Atankwad / Hindu terrorism\" which I feel is equally wrong in both cases. Religions never supports violence. But these so called secular shitholes have to target Hinduism. Ps. RIP to the girl and RIP to our MARTYREDS 🇮🇳", "abed.afridi": "To anyone out there who wants to know what intolerance is... Just go thru this comment thread @reallyswara", "3ginfopankaj": "Tmhai toh lahore aur islamabad duniya sabse best jagah lgta tha", "despistado_": "Where is your placard... Protesting against pakistan and terrorist grps..", "ayush_soni41": "All of this is sooooo patriotic bollywood is so patriotic my god wow", "tanish_sharma15": "What a split personality you are . Salute to your acting.@reallyswara", "anirudh3497": "RIP", "mohammedshahid1330": "🙏🙏🙏🙏🙏🙏🙏🙏", "aishayousaf20681": "پاکستان کو کشمیر میں گھس کر بھارتی فوجی مارنے کی ضرورت نہیں ۔۔۔۔کشمیریوں کے ھاتھ ٹوٹے نہیں ھوۓ۔۔۔۔جب اپ ان کے لوگوں کو مارتے ھو تو کیا وہ جواب نہیں دیں گیں۔۔بےوقوف لوگ", "ayeshaqzi": "bura k anjam bura😂", "mariam_khan2021": "😢", "love_u2730": "Rip brave soldiers of India", "fit_wit_matters": "🙏🙏🙏🙏", "mangboi__": "Jai hind❤salute", "suviikotalkar": "RIP", "maruthi_reddy_mr": "🙏🙏🙏", "dro_pro_guy": "Seriously stop posting these.. You went to pakistan and started bragginng like it was world apart.. Fuck you seriously..coz of you and your secular gang these things happen", "imrajiv_k": "Salute 🙏", "arjunam_100": "Tu toh kuch bol hi mat pagal aurat", "bolo_annpurna": "@reallyswara why so sad? U must be happy from inside? Oh now I got it..... Everyone is posting this so you decided to do the same to save yourself from the last you did! Few months back you the swara Bhaskar lashed out on indian army! The girl who has shown sympathy towards BURHAN WANI! The one who supported tukde tukde gang! Bloody fake person you are! I really feel bad that a reputed celeb like you exists in our country! Shame on you and plz stop showing fake sympathy! Public chutiya nahi hai boss! Once I was your big fan but today I declare you an ANTI INDIAN!", "rani_meeta": "Bloody bitch u r Swara we all know it..", "prathamenigma": "@reallyswara go to Pakistan you Fake 😠", "sandipan.chakraborty": "Crocodile tears....u must be happy..", "virat.kohlifanclub7": "Randi Pakistan jaake aati hai vaha bolti hai Sab pheeka hai Lahore k Samne aur aaj country k liye shahid soldiers k pics daal Kar social media Par showoff kar rahi hai.. Tuzh jaisi Rand to dushman k ghar b paida na Ho", "lifewithshri": "Your best friend must very happy, throwing party this weekend. Your twitter earnings will go higher. Now you can be a better producer. Enjoy!", "n.kunra": "RIP to our beloved soldiers and war against Pakistan is the only one solution", "miladmatin19": "😢😢😢😢😢😢😢😢😢😢😢😢😢😢", "thisissaurav_": "So Aazadi squad supporters started to show condolences for soldiers death. Great!! First criticize them and then show sympathy for them to gain publicity. Salute 👍", "all_problem_solution_113": "World famous astrologer wahid ali सभी इल्मों के बेताज बादशाह। समस्या है तो समाधान भी है। Guaranteed 101% (Note :- (प्रेम-विवाह) (लव प्रॉब्लम ) (फॅमिली रिलेशनशिप) ( पति - पत्नी में अनबन) (इंटरकास्ट मैरिज) (ग्रह कलेश) किया कराया, सौतन व दुश्मन से छुटकारा, डाइवोर्स प्रॉब्लम, whatsapp now +91-9001919358 love problem solve. husband wife relationship problem solution. childless problem solve by 72 hours..", "aye7285": "40 ki jagha 400 mrny chahiye", "drhrehmantaymee": "😢😢", "shefi12101840": "😟😟😟", "bhattjaydip": "People like you also responsible for this .. juthi aurat tum me zamir naam ki chiz he ke nahi ,tum jese log apne swarth ke liye atma ,sharir or desh bhi bech sakti ho...thuuu he tumpe", "shushobhan_ig": "🙏", "sudipta8120": "😢", "bandana_atom": "🙌", "cahimanshi": "Shat shat naman to these soldiers .. Jai Hind Jai Bharat", "exploreplaces__": "A traitor @reallyswara", "montyrathod5852": "@reallyswara..thank you...for showing dignity towards Nation loss...at least you are not busy in uploading ur pics.you celebraties have so many followers.so u can set an example that we all are with them instead of showing how we are enjoying our life..", "i_am_kumar_pawan": "🙏🙏🙏🙏🙏🙏🙏🙏", "omesh.kumar.12764": "Very sad f", "i_am_gaurav_goyal": "Jai Hind🇮🇳🇮🇳🇮🇳", "sainathpadalkar": "Hypocrit women..don't show sympathy you are Pakistani..", "samim_choreographer": "😢😢😢😢", "itz_yog_09": "Woh jo Baar baar Rang badalta hai uss animal ko kya kehte hai?? I mean ye post dekhke muje uski yaad aagyi 🙏 #Swara ab aapko samjega... Konse vishay me over acting karni chahiye... Konse me nahi. Jis Dharti pe jeete ho aap ussi ko backstabbing 👏👏 dekhlo aapka Comment section 🙏🇮🇳", "xoomm__": "Band kar yeh show offff !🙏", "yhkokilasharma": "🥀", "r_zebi300": "Weldone Kashmir 😂", "rachelism__": "It's really disheartening. Also, I see so many haters commenting here. If you hate her so much, why are you following her social media? No job?", "ankita3979": "🙏🙏🙏🙏", "varsha_wadhwani8": "😢", "__kushal__7776": "@reallyswara ये वही पाकिस्तानियो की हरकत है जिनकी आप ने मीडिया में खूब तारीफ की थी। अब वो कार्ड ले के क्यो खड़ी नही होती आप,वैसे तो बहुत भारत पर कार्ड ले के आप खड़ी होती हो, बॉलीवुड क्यो चुप है आज....", "bapatshrikrishnad": "RIP"}