{"kala.shrishti": "😡", "ka.ran77901": "Ugly whore madarchod Teri maa Randi", "imromi2125": "Teri aukat kaise hui gd bakshi ji ki kuch glt bolne ki ..... chand paiso k liye izzat lutane aa jati ho tumlog or gd bakshi ko tamiz sikhaogi .... usne apne bhai ko kho diya or next year khud bhi join kiya nda .... aukat me rehkar baat krogi to acha hoga .... aurat hone ka or freedom of speech ka galat fayda uthane ki koshis na kro", "sakshi_patil7272": "@reallyswara kalank hai ye aunty #savitabhabhi", "ayush_d_pernicious_recluse": "Go to Pakistan. ..you deshdrohi", "veer.singh9599": "Tatti", "kapil_nawab": "Bitch", "_rakshit99": "Tadaa!! A national piece of shit from JNU a C grade actress too", "kaartik_raj_suvarna": "Khud kapde utaar k paise kamati h or bakshi saab ko national embarrasment kheti h teri ma ka bosda #pkmkb", "siddharth_peepra": "@reallyswara u r a national embarrassment ! Shame on you bitch", "sugandhsharma536": "Kma le promotion kr kr k ghtiya aurat h tu", "soniamenezes0411": "Gorgeous 🙈😍💕@reallyswara", "gujjarhindu456": "Randi 🐖🐖", "__lonewolf3": "💩💩💩💩💩", "jiturathore7773": "#national embarrassment tu hoti kon uss insan k baare me bolne waale jo india k leye war me shamil the tere jesse chichori k muh se desh bhakt k naam suit nhi kerte tu aah aaah ker fingering kerte hue", "khalidshaikh1986": "Cool", "shehnaazsheikh14": "STUNNING ~ just wanted to Share a Quote from IMAM ALI, an Enlightened Master \"SILENCE is the BEST ANSWER to FOOLS\"!", "niharika_tapadiya": "hijdi", "darling_prithvi": "🖕🤣", "sushmitacm": "Just watched your glorious comments about a 4 year old kid!!! I mean of course you don't have kids of your own, right? If God is kind enough....it will always stay that way.", "srmenon1": "She's a disgrace to all the women in the world. How dare she use abusive language to a small innocent child. She's calling children evil, she herself looks like a witch and is talking so cheaply. To hell with bher and her comments. Wondering how those interviewers were enjoying her nonsensical talks and did not even object to her slang language. Shame on them!!", "imtalib_chauhan": "Appp kaa Jawab nhe Mam", "suryansh0215": "Madarchod saali kutiya raand 50 log ka leke baithi hai...madarchod raand tere ko pura JNU k launde chode hai lgta hai...bahenchod rahul gandhi ka leke baithi hai kanhaiya kumar ka leke baithi hai madarchod", "ayush_1805": "On-screen masturbation ke alaawa kya aata hai??? ..... Calling a war veteran a National Embarrassment is very easy..... khud jab ladne ki baari aayegi na toh ladne ki himmat toh hogi nahi......Women empowerment ka matlab sirf masrurbate karna nahi hota you cheap porn star.....learn to respect the army.....fuck off", "mishra.avinash29": "A national Blot #fuckoff", "anshutriipathi": "Your life is a biggest embarrassment. You don't even deserve to live in this country. Please leave India. Pakistan me chli jaa", "_siddharth_shukla_41": "Jaisi shakal waisi harkate jaisa muhh waisi baate ....Dono Akshar tatti...Kiya karte hai.....@reallyswara Shame on you...women empowerment krne na aana warna chappal se Wahi women's tmhri empowerment Tod dengi.. Women's ka Naam Badnaam krne wali..🖕", "you_know_shady": "Have you left 64 number? 😂😂😂", "lohit_gowda7": "🇮🇳🇮🇳🇮🇳respect Indian defence you #FLOPOLDLADY", "rouble_dimasa": "This platform is not for you,get out.MC,BC whatever", "jiyaullimadiyatanv": "Supae", "iamabhi2710": "Goo ki si shkl h iski... Actress to tu kbi si thi hi ni.. Apne gaon ja", "chowdharysatyajit": "koi sense nhi hai tujhme", "shamimzhcdu": "Wow mast ada hai yaar🌹", "tejasvi_karnik": "Look at the power of \"freedom of speech\" in our country! A 3rd class soft porn actress, calls an Ex Indian Army Major \"embarrassment of the Nation\" @Swara baskar don't use yo fingers to tweet about an ex Army Major. tumri utni aukat Nahi! use yo fingers, where they are good at! & Go shout \"Bharat tere tukde honge\" with yo JNU BF khanniya Kumar. Vahi tumri aukat hai", "mishra__ji_": "Gd bakshi is dekh ko randikhana nahi bn ne dena chahte.. Shayd islie vo psnd ni h iss raand ko", "ad_arsh.8": "General Bakshi ain't National embarrassment u r😑", "imshreyash_": "Pakistan se paise khaaye kya? Udhar ke udhar he chali jaati! India me kyu aayi? BC! Faltu insaan !", "ksb_1495": "Matt kro troll inhe, 😅 accnt bund krdegi and fir media me roenigi is baat ko leke ki hum *trolls* ne *harass* kia😅👻😅", "amitesh_bhrdwj": "Isko kya bolu ab... Isko to Sharam bhi nii aati... Iss failed actress ko ye hakk kisne dia ki ye GD Bakshi ki insult kre....shame on you swara bas kar", "yogeshberiwal_": "Kalank. 👌", "imashish98": "@reallyswara U r the biggest embarassment of this world", "saurabh.bhanot": "You are the biggest embarassment fr the country and yes you must have had gotten many new Paki followers since that comment on respected GD Bakshi sir.", "ur_pic_is_no_good_bt_i_still": "This what a national embarrassment looks like @torshachatterjee", "singh.ankur_": "C grade , go to pakistan", "soumya_shukla0022": "I really respact you mam... You are the strongest woman.... In chhilgujo ki kabhi mt sunna inki awkat bs cmnt tk h samne me inki ga\"\"# sry sry but yai deserve karte h ye... You just #keepitup 💪💖", "thegymchemist": "Mere pass is randi ki nudes hai,dm me and lets upload it on all porn sites, titke:: pakistani randi no.1", "ink_an_fables_": "Jitni maj. Gen gd bakshi ki achievment hai utni to tumhari soch bhi nhi jaa skti , problem yeh hai tum camere pe kuch bhi kro , kyunki tumhe paise milte hai, or vo desh ki sachhai bta rha hai ,or use paise nhi milte randi rona krne ke.. Smjhi, aukaat main rho or kaam krti rho, vrna gayab hone main time nhi lagega..", "harsh_nitb": "You Bitch...JNU Grad Traitor. How dare you insult , GD Bakshi !! Rot in Hell .. you Anti National C-Grade pig faced Dumb Actress", "hritik123a": "Third rated asshole", "rite_ritter999": "Thot", "divit_cr7": "You filthy slut ye bata when are you leaving india and going to pakistan.. Tu hai india ke naam pe kalank! teri okaat kya hai kisi Army Officer ko national embarrassment bolne ki.. ? fucking attention seeking bitch!", "sarthak3238": "Jerk offf", "corp.jgc": "E randi jake on screen chutad me gajar dal lena reallyswara reallyswara", "ii_akashbhardwaj_ii": "Isko report kre kya???", "rahulpai98": "Fucking embarrassment in the name of actress.", "ashish.rstogi": "D grade actress ooh actress nahi chutiya", "_sanjay_sinh": "Liebrals are Cancer 😑", "dishantkumar_2000": "@reallyswara you fuckin bitch if you can't respect the indian army it's mean you cannot respect of nation you r fuckin third class actor", "sanam_nangla": "Boycott her .. everywhere. Report her account....", "__ritwika__": "Shame on this b grade actress 🖕", "hrishikesh_sanglikar": "When u were born your dad asked doctor - ladka ya ladki? They said aaj pehli baar hospital me ek embarrassment paida huvi hai. #shame on u .. You are a disgrace to our country", "jainsid1": "Please leave the nation", "iamshubhangijha": "@reallyswara shame on you for insulting army officers... Please help us and go to some other country.. Useless", "vxhwa": "Shame on you", "mejnyk_o4": "Next porn kab release hoga pls date share karna randy chod", "that_ns_boy": "kyu be randi ki bachhi @reallyswara aukaat kya hai teri 3rd grade actress..... jaanti hai kon hai G.D. bakshi..??", "sahil_mehta09": "Dislike", "iparaspuniyani": "Ab tere jaisi ghatiya aurat btayegi ki gd bakshi ji ki aukaat kya hai ? India me role ni mil rha to pakistan me role lene ke liye kuch bhi bolegi kya ? @reallyswara", "shah_ronak612": "D grade actress.. Shame on you..", "sike_adele_icacy": "people fr using pakistani as a derogatory word lmao", "siddharthsharma799": "B grade actress... congratulations u grabbed my attention....#attention whore", "aditya__jamwal": "Poor strategy.... calling Retd Major General GD Bakshi National embarrassment just for fame.... getting infamous though", "abhinav__kashyap": "So i heard your father was in the armed forces, so first go and ask you father that who was sir MAj GEN (RETD) GD BAKSHI was and then say something. He is not national embarassment. But you are.", "poojasin1": "U r the shit of this country shame on u u piggy @reallyswara", "sajan_dake": "Indian pornstar", "ameyaratnaparkhi1": "You dumb B grade shitty bi##h if G.D. Bakshi is national embarrassment then tell that what you did for national pride . Which year you won oscar for nation ( you will never get it for shit you are spreading ) . Go and live in border districts you will experience your B grade work in real life if security forces will not stand with you . # traitor # national shame # boycott", "singh_kabir5": "National Whore @reallyswara", "mayank_m_chheda": "Please start unfollowing her everyone. I have ! Aise hi samajh ayega inko. They care nothing about what people comment. Start unfollowing now!", "bhupendra_aswal": "Mere sare bhai or bahino ko dil se dhanyabad jo is ghatiya orat ki comment me achhe se le rhe 🙏🙏", "cricket_star001": "How dare you speak on a pride of this nation, kya aukaat kya hai teri ha , bgrade ki actress. Who the hell are you to judge a person whoserved his nation in war situation. Teri limit me reh madarchod, itta hi shaanpatti hai na toh jaa, khadi reh border pe,. Ek cheez yaad rakhna military waalo ke saamne nazar neeche ,haath salaami dete hue aur shaanpatti ghar pe. And respect the officers of this country. 😡😡😡😡😡😡😡😡😡😡😡", "akash_linsky": "Hi bitch.", "rupal_dalal": "swara bhaskar Shame on you", "sylvester_0210": "Failed actress saali call girl.. gd bakshi sir ko jya bolegi... Khud to randi h", "sumbul__fatima": "Ohh my i love youu so muchhh 😍, ur acting , ur voice u were my fav from veere di wedding 😍. Dk why people show u that much hatred u deserve much more lovee ♥️♥️♥️ #lovefrompakistan", "jenapulak": "U called a major G D Bakshi a national shame?Sorry miss moron u are a shame of India.cheap c grade actress.", "rawat_hrithik19": "Sham on u ... just leave our country .. u just insult a high level general of our country", "mr__yoddha": "Ulti aa rhi .....😂😂😂😂😂", "venky143_cool": "Okay", "dutta6034": "Swara🐷 uppar waale ne muh bolne aur khane k liye diya h aur💩 hugne k liya dusri jagaha di h to muh se mat hugga💩 karo.", "ranjeetrajpurohit": "Madarchod Randi..Khana khati hai ya goo 💩... madarchod Teri maa ki choot. Bloody opportunist.get out from India you prosti", "akashsinghpathania": "Shame on you", "dhyey.thakkar123": "3rd grade actress😂😂", "the_smiling_eagle": "You are not even 1% of our Retired Major General GD Bakshi🇮🇳🇮🇳 what have you done for country yet?? Veere Di wedding is the national embarrassment!!", "rohankapoor1234": "Betichod pehle acting seekh le, uske baad bolio Gen. G.D. Bakshi ji ke liye. Bc movie chalti nhi, acting aati nhi, free fund mei gaand marani hai.", "shubham_jain61299": "Abee loser kahii ki jaldi bata pakistan kab nikal rahi hey tuuu bakwas orat", "shadow_jan95": "Daant tudwa le phle apne fir dalna pic", "some1ushould_avoid": "U deserve all the comments 🖕🖕🖕", "nisarg_pandya23": "Biggest pornstar of india ...c grade actress .", "dharmpandey11": "National shame", "shloktiwaryy": "B GRADE ACTRESS", "heena.saxena1822": "@reallyswara such a bitch! I guess now u have become an embarrassment for your ownself.", "doggytailvine": "You should be given award of National embarrassment", "prabhat_rajput1999": "Flop actress😂😂", "ripaldas24": "Gareebo ki Mia khalifa ,no wonder you are an embarrasment ,kaash us Raat aapke papa ne protection liya hota", "naam_arnab": "Yeh B Grade soft porn actress yeh sab isliye bol rahi hai kyun ki swara JNU ki student hai... JNU ki students aur kya bolegi... Seriously mat lo isko industry may bhi puchta nhi koi.. Ignore it😂👍", "achyut_p_": "You are a worldwide embarrassment lmao", "hshefy1": "😍😍 beautiful", "soniyaaly": "Love from Pakistan plz rply me lv u😘😘", "hrsumukh": "Boycott this anti national slut.", "rahulsingh262_": "Anti nationalist bitch", "yashtiwari2212": "Look how b grade actress look like @sunil_sahu7 @rahulsinghofficial_", "sharad_yadav.5682": "Shame on u and ur mentality", "ans.h15": "Sasti suwari", "goutam_girish_gokarn": "Anti national..... Bitch", "crimsonxrosee": "Don't call her randi or slut boz they are better then her 😑", "sunil__goswami": "❤️❤️❤️❤️", "pranay4u": "Shame on u", "vineetpatel16": "Berojgar aunty", "me_pratham": "@reallyswara You know what?? Tujhe Gaali dena matlab Gaali ki bhi \"EMBARRASSMENT\" hai @haqnii", "jayeshshahane": "Hi local porn star", "ever_unorthodox": "Your words usually are as casual as your looks in this pic 😁", "imriteishp": "Pls go to adult film industry. There is no need of such a grade D type actress. GD Bakshi is not a national embarrassment , you are the national embarrassment for us.", "the_lakshay_sharma_": "Tu hai national embarrassment", "saagar.katariya": "Anti-National Whore 👾", "mishra_satyam03": "Tum mar nhi jati...didi ya fir pakistan hi chali ho jao.... #kalank", "isha_singh98": "This stupid fake feminist has the guts to speak nonsense about a soldier who has years of unblemished service to the nation.....probably for her doing a masturbation scene is an act of national service....", "raunakghag": "Time to disown @levis_in", "flankerabhi": "@reallyswara u r one of national disgrace bitch. Please go get an average look before flaunting and get a class as well. Hoes compromises with director producer to get into bollywood.", "reddy_govind222": "👎👎", "maharashtra_explorer": "संडास pic", "devotee_hari_": "Double standard bhaand", "aravind_._": "Nowadays even some failed actresses are insulting our brave soldiers.according to them being in some porn scenes are not embarrassment but the actions of our braves are.#shameonyou @reallyswara", "sanskritibiswas501": "You r so dumb", "whorohit": "You are a shane of your parents. You shoukd settle in Pakistan soon. Shitty porn actress", "pirates_bay619": "If GD Bakshi is National Embarrassment na then you are National Shame you B-GRADE actress it was fine until you are trolling Govt.but don't dare to troll our National HEROES", "ar7_warrior": "Didi Pakistan kbb ja rahe ho?", "chauhandivyansh_2011": "Do you know anything about Sir G.D.Bakshi miss. Just go to hell you bitch. He is a national war hero and not like you people who just sit on their sofa utilizing the luxurious amenities........Kutiya saali.....A failed actress ....Just go to pakistan.....", "h_i_g_h_j_o_s_h": "Aapko pehle research karni chaiye mam ki MAJ GEN G.D BAKSHI SIR KON HAI AUR UNHONE DESH KE LIYE KYA KIYA HAI...", "tejasdarode17": "Lifetime silence for those who are still following her 👿👿", "nisha.n.kotian.3": "Jnu chaap anti national", "why_nayan_why": "Abe Sir gd bakshi k upar comment krne itni okat hai teri sali aastin ki saanp ja Pakistani m marva", "gauravbryans": "C grade bitch", "raghuveer_2018": "Nawaz sharif ki 5th daughter 🤣", "sanju_rajput10": "who r u?", "gawathi_grapher": "😅🤟😜 Aap sab ke comments dekh k dil khush hogya,, muze jagah hi nai mili gali dene ki😂", "_.sierratango": "You are THE biggest embarrasment for our country. Do you even know anything about Mjr.gn.GD Bakshi sir? No! Right? He fought 2 wars for you, for me, and for the whole country. Itna he h go join army and see. Then you'll find the emotions behind that words. Twitter mai bhonk ne se kuch na hogo! Smj lgi?", "j_kay007": "U r embarrassment to our nation", "teri_bhen_ka_crush_": "Didi Pakistan jaao aapki koi jarurat nhi..", "uday7veer": "Boycott her.. She is the biggest National embarrassment@ reallyswara", "aishwarya_25.10": "O B grade actress... Kbhi to koi film m main heroin ka kam Nhi kiya.. Sonam kapoor Jo bhi nikkammi h uske piche Mtlb k liye ghumti ho Didi.... Jo kbhi khood ka kuch nhi kr payi o batayegi kya major bakshi ko.... Bahut aaye bahut gaye... Tum bhi dhal jaogiiii.. Ruko..... Bhudhapa Aayega...... Attitude jayega.... Or Tum filmo m nhi Kisi bde Ghar ki showpiece bnogi..... Chiiii", "king_shiva_7": "@reallyswara u r national embarrassment madam and word suits on u that's why u have burning fire in ur........😂😂😂😂😂😂", "lalit.goswamii": "@chetans908 Is chutiya ka kuch karo koi.... Army walo ko national embarassment bolti hai.... !", "satya_hindi_": "तुम एक ऐसे आदमी को national embarrasment बोल रही हो जिसने सेना में रहकर देश की सेवा की है...#shameless", "vrit_rv233": "Democracy nahi Hoti to aaj tu Zinda nhi hoti", "sinha_adarsh99": "you are the second biggest embarrassment of india first is still Pakistan 😂😂 go to hell. publicity nhi milegi tujhe.", "ddevarshi93": "Vulgar", "i___manthan": "c grade actress,", "adigrande.owo": "This bitch calls a retired veteran who fought 2 wars and served our country for 30 years a 'national embarrassment'. What have you done for your nation? Masturbating on screen for a shit film for so called 'women empowerment' isn't embarrassing.", "dixitpundir5203": "O maderchood... Gd Bakshi Baap hai tera .. Randiii", "alokvrm": "national embarrassment..pakistan chali ja bahot ungli wale milenge.🖕🏻", "prajak_tigerr": "Love from bottom of my heart. Heyy dear Crush marry me❤️😍", "nrsbl1": "I don't know why people even follow her , and yes mandbuddhi ki aurat fame ke liye Kisi ko bhi target kare how can we tolerate this , request to all followers. Start unfollow her 🙏", "gaurav_vaishnav__": "Pakistan wali didi..#Sbkmkb", "lovrlymai": "Nice❤️❤️❤️", "peace_x00m": "Dekh ke hi bomating aa jaye", "shady_ritikk__": "Ek B grade actress... Retired Gen. Ko National Embarrassment bol rahi hai😂😂. Abe #Onscreen wali sasti #Slut 😣 Embarrassment to tere Maa -Baap ko hota hoga...... Ya kya pata puri family hi... #Le_jhand hai😕.", "medinesh.bhardwaj": "Media attention pane ke liy desh ko mt becho... its true ones a randi always randi ... fuckkkkkkuppppp bc , shame on you , why do u live here , if you've no respect for our Indian Armed forces, get lost 🖕🖕🖕🖕", "ankit_saini_bm": "ye filmo me logo ki muth maarti hai or ye ek foji ke baare me bakwaas karti hai saali gasti", "samarthbarshi": "U r national embarrassment...🖕", "mansi_s201": "U r a shit..lady..shame on u", "abhisheknegi4089": "I saw ur tweet about the jnu controversy, so u are supporting those ppls who were standing aginst our country and were supporting pakistan and its terrorism i heard many things where u shown ur reality u kinda ppl should be just kicked out of this country. Means khaogi b india paisa b yha se kamana h fans b yha se chiye or support krti ho pakistan ko or un logon ko jo iss desh k khikaaf naarebaazi krte hn.shame on u,that shows that how cheap u can go just for fan following.if u apperecite these types of ppls in the country then please u can go to pakistan we dnt need u.it all shows ur patriotism towards the nation shame on u swara bhaskar.", "_being_awsm": "Deshdrohi😣", "le_reveur_swadha": "💕💕", "suvrajit007": "Fuck u bitch. Get out of this country.", "kiranjsingh": "FACE OF \"NATIONAL EMBARRASSMENT\"", "pooja_piinku": "@reallyswara Tere boyfriend se jawan hai bakshi sir", "bnagra1602": "Don’t listen to the haters Swara - speak your mind as you see fit!!", "deveshtyagisr4": "400??", "_nitesh_singh_rajput_": "Modi be like ; ye toh onscreen masturbation wallii haii naa jiska rndiyapa naa koii dekhtaa naa hii khareedtaa haii 😹😹😹😹... @reallyswara ALWAYS remember general sir bakshi tumhare baap nhi hai kyunki sasti porn actress kaa koii baap nhii hotaa .. toh aage se dekh lena ki kisko bol rhii hoo 👍 vo hmare desh ke liye bahut kuch kiye hai tumhari trh tv pe masturbation nhi kiye 👍👍", "ankit_singh_9973": "@reallyswara Jaisi shakal waisi baat aak thuuu", "__mukherjee_": "Bhn ki lodi", "iezamit": "Kya tatti jaisi shaqal h iski", "satishkp_knight": "Use your brain before commenting on War veteran....U never use them in acting ..atleast use it somewhere...", "im_vikrant.s": "B grade actress", "sarcastic_dasji": "Shame on you for calling a National Veteran \"National Embarrassment\". Feminism is cancer and so are you!! Wahmen Empowerment 😩👌", "sadanand.27": "National embarrassment cause is @reallyswara", "vipul.mp3": "Jab ye paida hue thi.. Doctor ne kaha tha uske baap se kaha tha. Ye lo Ji Embarassment hue h aapko 😂😂😂 BKL", "divy_._": "This Is How \"\"National Embarrassment \"\" looks like 🖕🖕🖕😂🔥🔥😂", "nakulpanwar11": "Anti national", "atharva_kulkarni12": "Let's boycott such actors/actress and make India clean and also good movies with unbiased star casts", "as480922": "@reallyswara know urself u r national embarrassment 😂 first time I came to ur insta page to show u what shitty thinking h have ..🙏", "abhiraj7041": "Kya be gandu", "edgeofsand": "Worst female", "amey__pandey": "Anti Indian piece of shit", "rit2_": "Mera inse nivedan h ki kirpya krke apni ungliyo ke saath rehkr apna samey vytit kriye #bklswara", "friskysumit": "If sasti randi had a face", "sallu156": "Pretty feet", "pshivae": "🖕🖕🖕🖕", "yamraz_official": "Haram ki aulam laude jaisi shkl wali randu", "__roy_jr": "ghar mein hi saanp", "smiling_moron": "Chuttad😂😂", "hritik221144": "Pakistan ja tu india mein tera koi kaam nhi hei bhadwi", "jha_babu_": "Tere muh pe thookne ka man kar raha Bc 😡😡😡", "taniya.j.das095": "Sali apne aap ko samajti Kya hai bc😡 nikal Sali kamini...Sali low standard actress hai mc tu...", "big_roasted_beef": "Randi ki bachi sali bhen ki Lodi", "vishalboraa": "Aisi shakal se toh bhoot darr jaye, 'National embarrassment ' mujhe tumari shakal bulkul pasand nai aayi 😂😂🐷", "iupadhyayharshit": "Maine tumhe follow Jan ke kiya hu AAj tum jaisi randi kaise paida ho jati h bc", "valour_steadiness_commitment": "Failed actress ..... go to hell.... 👏", "a_j_a_d____": "Aaaaaathhhuuuuuu for ur cmt on GD Bakshi", "indigolover007": "Dhatt teri to ye wo joker hai jo ganja phoonk ke kuch bhi bolti hai", "luis564785": "Randi Kahi ki bag eha sa", "samaggarwal2": "Bitch.. Pornstart is better than u..", "parth._.singh": "So you have the audacity to call a retired war veteran Like GD Bakshi a 'National embarrassment' I guess according to her you should be more ashamed of serving this country in 2 wars and over 3 years than masturbating on screen for a shitty movie and calling it 'WoMeN EmPoWeRmEnT'", "giri.nitish": "b grade actress", "_swatijha_": "Sab line mai lge raho, koi dhakka mukki nhi krega..Sbko mauka milega ek ek krke gaali dene ka..Or ye btane ka ki \"Who is the embarrassment of India?\"", "sanjib292": "B grade Actress hi Rahogi Tum Aukat Kya Hai Tumhari Major Genral k Samne", "amit_singhx": "Bhaag Pakistan", "iamsurajkes": "Sab kuch thik tha Par Tumne jo Sir Major General Sir #GD Bakshi ke liye bola hai Thu hai tujh pe Jinhone Desh ke dushmano se Loha lia tum uss Mahan Nayak ke liye itni ghatia bat boli Ek saccha hindustani tumhe kbhi maaf nhi krega Iss hisab se lgta hai Government ko Ek Surgical ya Air strike yhi krni chahiye jisse ki ye Log Saaf ho ske .....Jai Hind", "the_antinormie_guy": "@reallyswara janti v h sali tu gd bakshi sir ko? Sali failed actress.. Madharchodni sali randi teri kya aukat g unke samne", "jadhav_ajju0094": "Nich aurat India me rahne ke layak nhi hai tu Nikal Pakistan me wahan lok acche se yad krenge tuze", "naman.arora__": "Tune General GD Bakshi Sir ko \"National Embarrassmen\" bolne ki aukad kaise Hui. Tere muin par tukhne ka man ho Raha Mera 😠😠", "rjptl96": "Who the hell are you calling sadhguru as a sick? He's one word against you will destroy your whole career (well desperately you are doing it so) but our sadhguru won't do that because he don't consider a person who don't use their brain!", "sandy_boom__baba": "A frustrated JNU bitch...", "nilanshsirohi": "National thot", "rupesh.pathak.7": "Friends. Make sure that she should be ashamed what she did. Let's join together and make sure she should regret.", "oldschool_badass": "You be anything in life, big or small, rich or poor. You just can't insult a decorated officer of the armed force. You are the most fucked up lady to ever live on this land.", "sachin02206": "Bahen ki Lodi , Tere see bada National Embarrassment koi nahi hai is desh Mai . 30 saal ,oh sorry 40 saal ki Buddhiya Aurat tu apne Bed pe Fingering he Kar , Twitter pe Bakchodi na Pel Kuttiya .", "aich.design": "Paki dalal", "abhirajbiswas1": "Embarrassment? Tune toh bade jhande gaade hai na bkl? You incompetent fuck.", "im_priyansh_": "Unfollow every artist... Who follow swara", "sunil_meh": "Awesome", "chirag____9": "Sadhguru jeise ko gaali deke pata nahi kaha jayegi tu... Pagal aurat...", "tribal.ishan": "B grade actress talk about army veteran officer gd bakshi....u r not fit for porn movies girl don’t know how you r in Bollywood....barking bitch", "milansharmaa": "Hey, You are BLOT on our nation. Please migrate to somewhere else. You don't deserve to live in this nation.", "mannenaseem": "👍👍👌👌👍👍", "anushka_625": "Big shame on you", "vnitesh181": "Randi sali", "tri5athi": "Baatein uchi uchi", "viveksaini2101": "B grade", "smile__shine1121": "U r a embarrassment to the entire woman of the world...u creepy crawly...crawl back to porkistan... U third grade actress... nothing less than a porn star.... Hate you.go to hell....", "simranprasad1344": "😻😻💜💛💜😻😻", "bodytallppsmol": "masturbating on national tv is embarrassment, serving for country isn't", "adv.madhu0028": "@reallyswara a lady with no class....nich se bhi nich aurat...tu kuch bhi pehen le tu tatti hi dikhegi...bhikari jaisa muh leke paida hui hai tu 😂", "ab001243": "Veere Di wedding still remains a bigger embarassment🙄", "karanwalia143": "General ki photo dekhke orgasm legi new movie me? Lmao", "mahadevgauri22": "Big fan mam... Love u", "sharmavidushi55": "Swara aunty je ne to koi embarrassing kaam nbe kr diya kissi porkistani k saath jo tum aa gyi iss duniya me 🤣🤣🤣🤣🤣", "vipinm7": "You Rock 🤘", "realistic.97": "she said GD bakshi is a national embarrassment ! 😑 just here to inform you all✌️", "meemkardashian": "Hello national embarrassment", "jayesh_kushwah": "Phatizar wali dress phatizar wali shakal", "logical_qoute": "Bhgwan tujhe dimag de nchaniya shame of india pta nhi kha se ye chhoti soch vale women ko represent krtr hai mhila shkti hmare desh ki army ki aurte hai respect for them and shame on swara bhaskar", "mohittaneja12": "Mera song suno maine likha hai id mohittaneja12", "ithinkfloyd": "2 take ki pornstar ek Army ke retired Veteran Ko National embarrassment bolne ki audacity rakhti hai ...you are a blot on this nation ...please migrate elsewhere and spare the horror of your manhoos presence here...", "the_right_narrative": "🇮🇳🇮🇱🇮🇳🇮🇱🇮🇳🇮🇱🇮🇳🇮🇱🇮🇳🇮🇱🇮🇳", "snehil000": "Shame of india", "shete4177": "This is the beauty of India, even a 3rd grade soft porn actress has freedom of speech to call a retired major gerenal of army a National Embarrasment", "sarthakchauhan98": "Leader of #TukdeTukdeGang.. Blot on this Nation. 😑😑 #urbannaxal", "ujjwal._srivastava": "Pakistan Nikal yaha kya kar Rahi hai", "sheoran_vi": "Visudh chutiya ldki hain aap.", "harshit88730": "Anyone please text me", "hashtagbakchods2k19": "Didi Pakistan kb jaa rhe ho? Humre desh ko chor doo naa", "digital_mukesh": "🤗🤗 awesome collection", "__diva_on_duty__": "Love u doll❤️", "vishal.bakshi05675": "Good Looking", "sandytherockingman": "Looks bandriya🐒🐒🐒🐒", "fin_889": "She's here bcz of kareena nd sonam.....", "sunnykumarrawat": "Looking very cute", "_silentknight_x": "Tattti girl🖕🖕🖕", "khanwasfarhan61": "Masahallah", "upspruce": "Looking gorgeous", "itsswetagautam": "Lovely 😍", "rahul0405gupta": "Soch acchi kariye plz baki sab perfect hai 👍", "__kidu_loski__": "😍😍", "abhi569kumar": "Imperfect styling ,000", "pokhraj.roy": "@reallyswara be Slayin ! ♥️💯", "azeem6399": "Owsum lady but show this navel baby", "bubbles_crushers": "nice", "bitman777": "Was trying to deduce your height from the horiz wall-marks in the background. 62 inches?", "angrajsarma": "@reallyswara apki web series khaha dikhaya jaa Raha hai??!!", "amazingaasha": "❤️❤️❤️", "akkisalampure": "😘I don't believe if something that beautiful exists too😘😘 i love you", "thakkarjaulik": "Levis... Cartoon.... Looking beautiful", "souravdebnath653": "Love you", "ran_v2018": "Bitch", "prudhvi.kodali": "Nice mam 👌💞", "aakashsingh4112": "Appke...acting...sabse.mast thi....tanu weds manu main..", "esakki_r_a_j_a": "nice 😘😘😘😘", "ashishgupta5181": "U Can't Carry.. sorry..😢", "gunvant.patil31": "Jaisa mooh, Waisa hi Dress 😝", "roopalchaudhary": "Major stylist fail ... she could have recommended a better fitted jeans", "sunita5905": "Amrita singh, padmini kolhapure, and many others women मे आप सबसे अलग bold न beautiful हो.. I always admire you.. I mean it god bless u swara ❤️", "punit_jagnani": "Beautiful💙💙❤️❤️😍😍", "indiantycoon4282": "Stunning 😍😍😘😘", "gurpal1988": "Happy women's day", "esiotrot10": "Those jeans dont fit right ..🤷‍♀️", "rajratan_singh09": "Love you too much", "mmathur941": "Look so lovely.", "08prateekdixit": "Beautiful pics with beautiful smile my love😘😘😘😘", "technicallyclothing": "Visit and follow @technicallyclothing to get stylish and make good money. Stay tuned for great stuff to come.", "freezethebeauty": "Cool", "davinder_chahal06": "Pakistani", "zatinraj": "Hi love how r u?will u marry me...👄👄", "mrinaltripathi7": "Swara! आए नहीं आप हवेली पे। 😞 Lonely lonely ☹️", "heeyakrity": "Love you. Happy women's day superstar ❤️", "santoshwakode8686": "So Dirrty dress sense mam", "avikaa9094": "❤️", "angelia9572": "❤️❤️❤️❤️❤️", "rohit_k.o_0": "Hey Sexy 😘", "iyecay": "Aastin ki saap.. Shame of India.", "ansh5555555": "Mam aapki new web series rasbhari kb aa rhi h eagerly waiting", "officalhunnysingh": "Hoity", "nadim_parwaz_tk": "I m your big fan", "vivekkrocks": "Lovely pics...swara💓", "cha_khabo": "Yo girl u slay it all", "mohmmad_shakeel_official__user": "❤️❤️❤️❤️", "iamhiraalam": "Beautiful soul @reallyswara. Messenger of peace", "sr3official": "🥰🥰", "gauravg.028": "One of my favorite actress ever... 👌👌", "riya_anand_chigurupati": "Super cool Swara 💕💕💕💕💕", "zubeda411": "👌👌👌😘", "hashmi_ruksar": "Favorite girl❤️", "kiranhinduja_": "👌🏻👌🏻👌🏻"}