{"kalpanalecturer": "hi swara i am mathematics teacher and when I saw your movie i realize that you are very beautiful and talented actress love u 😀", "ka.ran2642": "Disgrace to our nation", "vivekkumar7821": "Fake girl", "siddhitanarvankar": "👌👌", "piyush.vk": "When God gave u a finger, use it to vote not to bcm Swara", "madhavphotovision": "savb ache hai foto...muje ache lge", "meet_parmaar": "💙💙", "vrushabh.pacharne": "👑👑", "s_shekhar_p": "Amazing movie !! Compliments !!", "vinkumar3350": "Randi rando", "augustinekbenny": "It's an amazing story... I love it❤️", "richapandeytx": "@reallyswara , you are an idiot.., you are even an actor at the first hand and that too going to be politician... hahaha very funny... reading script is ok ... but in real time politics ... 😡😡", "niharika_tapadiya": "both of you finger each other.", "turophile_tibet": "You are a blessing to this world both in terms of your Vision to bring better world and sense of humanity🙏👌🙏", "shahrukhisback_official": "😍👌🙈🙈🙈🙈", "victoria_dame": "Nil battey sannata is my all time favourite Bollywood movie. What a masterpiece❤️ and flawless acting❤️", "asfiamohammadkhan": "This movie was sooo awesome.it touched my heart!♥️", "adi__01__": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "__.yashmai.__": "Ise unfollow Kar do abhi👍👍👍👍👍🙏🙏🙏🙏", "somgisra": "my most fav films of all times, even i hav a SuperMom cum deity (all moms r gods 🔮 jus mine is my fav one 👑) like u in the movie 😍💖🍿", "iamanglekarushi": "Best inspirational movie💯💯🔥🔥", "ritwik9615": "Kya bhyi anti national kab Mar ri ho😂", "elegantly_mischievous": "Ye role sahi hai.. aise role hi teri shakal se match krte h. Veere wala role tere layak ni tha.", "deepak.kumar___": "@reallyswara tu kabhi kisi ka dil nahi jeet sakti re suar bhaskar 👎", "manuj08": "Commie suaar bhaskar...", "saurabh_ssd": "You will always there in my mind for your role in this movie....Loved you...You are a true core actor..", "nri_insomniac": "Wow, you should deserve a Baskar Award 🖕", "sakshi_patil7272": "@reallyswara Indian logo ko bhadkao mat nahito tere sath to bohot bura hoga dharm ke nam per ye sabko badhkati hai kon hai ye randi bhenchod Bollywood walo ki prostitute", "khushi_varma077": "@reallyswara iske movies ko bycott karna gai hame isko koi nahi dekhega isko to mar dena chahiye", "syed.khaleel.ahamed": "❤️❤️❤️❤️", "anupqumar": "Correct.. Agree with you. And this was the movie that made me fall in love with you.... What an amazing actor you are", "sudm56": "@reallyswara tmkb 💩💩 💩", "ajitkumar7984": "Ok.good.night.ajeetkumar", "reennyseh": "Third grade actress with 0 morals😝 by the way keep posting so that we can troll u more & more", "_aishhh__": "And I love this movie", "abrar_hashmi10": "My all time favourite movie scenes...", "bhatta_pooja": "My all time fav movie💓", "artist_avinash": "Chutiya", "garimachaddha": "I absolutely love you in this movie... it’s such an inspiration.. such a beautiful message that if someone really want to become something and your resources doesn’t allow it , still how u can dedicate yourself to achieve it... 💖💖", "rocky90rock": "Really good job done by uu ma'am.. superb @reallyswara", "dynamocreats": "Paiso ki fucked.. 😂", "asjad2202": "What a film i actully adore nd compare ur acting in this film nd veere di wedding nd trust me this shows me the level of acting......😍😍", "baloch.voice1": "Swara aunty 😂😂", "mnainesh63": "Beautiful", "pranay4u": "Chamar sakal tatti soch🤣", "nehajaiswal5462": "I love ur role in this movie swara..... The way u say LALLIEE", "abhishek.vashishtha7": "Anarchist antinationalist", "iamfarhannoor": "Love it❤❤❤👍👏", "sutar.pravin": "Its really make to cry in this movie.", "kullhad.wali.chai": "That's your career- nil battey sannatta", "imsonamj": "Anti national and fake feminist are something which are relatable to you. I guess you are not getting any movies now . Change your username name from @reallyswara to to traitorswara. Even if you get casted in any movie, I won't watch it that's for sure.", "read_travel_dance": "I loved this movie. This is your best performance so far. Keep up the good work!!😊👍", "budhanilkanth": "@reallyswara I hope you get mob lynched", "adarshpoolakkal": "Amazing film🔥🔥🔥", "pawan_das_official": "Nice use of hands", "urvie0010": "Looks like finally @reallyswara got a role!!! Spare us your fake feminism and false propaganda now. Focus your energy on this role, although nobody wants to watch you but at least people won't have to deal with your narcissist and anti- national comments.", "rishutrivedi_": "Wow! 😍 Pretty Swara...❤️", "mitrabookworm": "That movie is the best.I have seen it so many times.Your acting skills are unmatchable.May you continue to give us such characters to cherish.", "jamez__john007": "Kya re randi kanhaiya ka lavda chuss rhi ho ya vibrator se kaam ho rha hai @reallyswara", "baliyan_s": "Sanatta to ab tmhari life me aayega jb modi ji pm bnenge frse 23 may... Date yaad rkhna vapas aaunga cmnt krne😘", "pankajsingh2560": "Anti national piece of shit", "srivastavn": "@reallyswara Tmhare jaisi raand ka yhi kam h picture ni mil rha to politics me ghusne k li swarn dalit kro madrchod party ka ticket lene k lie sali tu dhanda kr dhande wali lagti bhi h", "rahulvats21": "Shame shame", "life.coach.payal.jain": "Looking forward", "that_stoned_soul": "Kya bhsdi pakistan nai jaa rhi hai #pakistanpremi @reallyswara", "allah.is.omnipresent1": "swara sister i really appreciate what you are doing for indian muslim s..kafirs are oppressing them but they don't know that ghazwa e hind is inevitable and when it happens we muslims will make sure you become a part of our ummah..more power to you sister. come visit qatar someday and do message me when you do.", "saurabh171979gmail.com_": "Looking very bad", "singh.ankur_": "U r anti national, go to pakistan pls", "sam_del": "Love u & your work", "mmansi_gupta1999": "@reallyswara 💖💖💖😇😇😇 Just watched nil battey sanata for the 1st time... Was literally crying at the end... Hugged my mummy papa instantly.. & i was your fan previously also, but after watching this more respect & love to u... Thanks for making it... Now your character \"Chanda\" will be marked in my heart forever just because of u... Thanks again.. 💖💖💖😇😇😇 #threeyearsofnilbatteysannata 😘😘😘 don't know you will see this or not... 🙈🙈🙈", "bharatcharan5": "Swara shut your gutter mouth please go to Pakistan if request you humble and if you dare say anything about major sir g. d. Bakshi sir you fake feminist", "bagadbilla_17": "Bina vhja iske jeso ko footage de raka h aukaad iski jhaat barabar ki bhi nahi h, bollywood m koi kuta bhi nai puchta isko", "akkisinha444": "One of the best movies with as great acting.. Loved the story..@reallyswara ...👌💟", "shehnaazsheikh14": "It was a wonderful Film and u gave a POWERHOUSE PERFORMANCE! The best film on EDUCATION!", "abhaykumariiit": "Bahut achhi movie thi !", "surjeet.bisht": "For her everyone who supports BJP is intolerant and violent.", "__.rudrakshhhh": "It was really a great picture 😘 @reallyswara", "jessica_cruz_2814.6": "I'm a simple girl. I see Swara Bhaskar's post... I check the comments section first 😂😂", "swethlana3267": "This ones definitely ur best by far ❤️", "fin_889": "Kali kaloti", "akki353.akshay": "SKMKB..... KKMKB", "dipaliwankhede": "Awesome movie... watching it again🤓", "tannu99": "Shame on u Swara Bhaskar 😡😡😡u have lost all love n respect from us ... u stooped down so damn low fr some anti national###@@@😬😬", "vmongs": "SUAR Bhasker 🐖🐷", "felicitycuba20": "Bitch,whore,mullas' goo-eater leftist liberandu,secularetards,mullon ki rakhel, Pakistan ki bheji Hui chutiya anti-nationalist whore.. what a shame u r in the Indian society 💩..ur mother seriously must have eaten goos💩💩💩💩 before giving u birth, while u were in her womb & that's u always mouth-poop shit inside our country.. what a shame as an Indian woman..do u think embarrassing Major GD bakshi is gonna give u fame? actually u r a paid worker & u r actually embarrassment not only as an Indian but as a woman & as a human being..Tere g** mein dum Ni ki tu Pakistan without bodyguards jaasake aur Jo desh kliye apni jaan kurbaan karne kliye tayiyar hogya tha usko tu insult Kar ri hai whore kahinki slut..🚽🚽goo khane kliye v layak Ni tu bakshi sir ka..abb kahagye crocodile tears & randirona for Army..Teri mc bc ghatiya aurat kahinki😠😠😠😠😠🖕🖕🖕🖕🖕", "shubamkamboj": "inspires alot.....thanks for giving it all people who are demotivated at some point.", "samsonam12": "You an amazing actor, respect ❤️", "rajan_seervi": "Your portrayal of Chanda will stay in the Memories of millions forever as a picture of mothhood ..the only movie I watched which got a impromptu standing ovation ..not a screening ,not a metro..just viewers", "itzz__ovr_": "Koi nhy tum Rahul ko hi vote dena ,phir kashmir mai nhy tere ghar ke pass hoga😊👍", "prem_for_you_": "Arey o bhosdi wale chacha. Jaha pe jis topic pe bat ho rahi wahi bat kro. Yaha kanhaiya aur modi kaha se a gye chutiye. Movie ka topic h to usi pe bolo..", "satyaprakas6293": "You are a moron and u deserve hate from every Indian, you a black spot of our country", "shete4177": "I in lSlS stands for Insaaniyat. - Swara Bhaskar.", "ghosh8601": "It's an awesome film 💟", "jiyaullimadiyatanv": "Supar", "bhaaavuu": "Superb role.it was.. Waiting for more such awesome performance😍", "vishwajeetvs10": "Those who insult Indian army should be killed immediately.", "sreoshi_writes": "This movie touched my heart ❤️❤️", "pinkesh_sargara": "Amazing film @reallyswara", "the_bonafida": "you were great in this movie", "renukamene": "This movie is beautiful at many levels", "__.zaheera.__": "I just love the movie", "shikha_varyah": "It's a great movie in many ways 💓 #allthelove", "medha_.77": "Lovely movie...n most importantly the best suited actress for this role...Swara u nailed it... mind-blowing acting..🔥🔥❤❤@reallyswara", "akash_linsky": "Or Randi Kya haal hai??.. kanhaiya see aaj Gand marwqyi ki nhi", "prakritisgarden": "Itz my favorite movie... Watched it multiple times... 😊 The mom daughter bounding is soooo eternal", "dhananjay_05041990": "Reallyswara you are awesome.", "5hubham_k": "Bakwaas", "suraj916217": "Kanhaiya Kumar ki dalal", "ziddi_bokudd": "Superb acting", "tanyasingh956": "Pakistan ki rakhail h ye isko India se bhagao saali Randi do paise ki shakal ni aur iski aukat kaise hui ek general k bare me aisi bolne ki qki tujhe wha koi publicity ni mili isliye tu Pakistan q ni chali jati apne asli baap k pass bloody terrorist chl nikl India se", "sunshine_law": "Love and love dear swara di", "neel_kaur": "😍", "bhasker_ashish": "@reallyswara you are 1 genuine actress.wish to meet you", "jaidevwirter": "An unmatched performance ...", "idgaf_i_really_dont": "I watched the movie today ...and I. Speechless ...you are one of the most hardworking , talented , gorgeous self made superstar...may God bless you with all the success , happiness , prestige and peace of mind ...we love you stay blessed", "jish74": "👏👏👏👏👏👏💕💗", "dee_abdalla": "🙏🏻👌", "rishi3327": "I unfollow u because u support #Tukre Tukre gang leader", "arjunam_100": "A shameless women who is trying hard to be recognised as a left idiologist person, but is failing miserably in her every single attempt😂😂😂 please go n die in a guttar, you are such a disgrace.", "sumit397": "National embarrassment", "saagaraqua": "One of the best from you! @reallyswara", "sharmavidushi55": "Madam ji kanhiya jaise communisto ki fauj khadi kr rahi hai 💩💩💩💩💩", "akul_213": "Sbkmkc😂", "nainika__16": "Congratulations mam....one of my fav movie of urs...", "vishal_sa9": "Atankwadio aur deshdrohio ki cheerleader", "anamikasharma278": "😍😍", "troyee3": "I love ur acting swara mam..", "__anupriya_____": "This movie 👏🙏🙏🌸", "akanksha_tripathi18": "Lovely", "rananeeraj_369": "Gay libtards", "voot\nVerified": "Verified", "its_me_imannu": "Your Always Awesome Ma'am 🤩", "saifullah_hayat10": "Fanofyou", "dtnirvana": "This film made me your fan I have seen many time even my mom also", "yasnasehgal": "Beautiful movie 😭😭💖💖💖", "rahul_20kumar": "ye movie mujse zyda mumma ko zyda pasnd aayiii....😍😍", "chauhanparul_": "Love ur acting .. never getting bored with this movie", "tanoj__": "Congress ke liye puja chal rahahe😁😁", "sajjadhussain157": "You will rock in it.... its look like so real", "vibhuti_mishra_72": "One of the bestest....❤️🙌😍👏👏", "pseudipta": "So does a hallucination 😂😂", "atifaslam_aadeezz": "Most beautiful😍 @reallyswara 😍", "die_hard_dd": "One the terrific actors time has ever produced nevertheless her beauty n grace are", "bhakti_2098": "Woh bhansali bolte hue thak gaya padmavat fiction movie hai phir bhi usako letter likh kar feminism ka dikhava karnewali ab azam khan ke liye bhi open letter likh ya phir tu particular community ke liye hi activated hai biased bikau aurat.", "advay_aadi": "Diamond of bollywood👌", "ashwinder1": "You are badshaad of such genre of movies.i loved ur movie anarkali of arha, superb acting and awesome message.", "anjali1999tanwar": "Amazing movie", "fdfcoco": "U are a good human being and very honest..God bless", "yada7274": "v natural acting in Nil battey sannata whole credit goes to swara wonderful", "arunglame": "Awesome movie❤️", "tanatan17": "An amazing film 💫⭐️", "kartikrai_13": "You are one of the most underrated actors. You should be getting good roles and films more often. ❤️", "p_r_e_r_n_a_1_2_3_": "I love you swaraa 😍 #inpiredByYou 💝", "shamimparwez": "Jab kanhaiya ke left aatankwadi logo ke ghr me ghus kr mar rahe hai to khamush q ho. Vote for lalten & Tanveer Hassan.", "sbmtiwari01": "Politics khtm ho gyi teri", "mani_s_ha": "This was such a nice movie. 💞", "samajwadi_bhai": "osm❣️🙏", "pokhraj.roy": "@reallyswara My mom loved the movie!", "amar_shriram": "Excellent movie ❤️", "nasirrajar": "Wow looking Soo beautiful dear", "sidhaant_gupta_": "One of the best movie 😊😊", "ripintandon": "I loved your performance in that one. Brilliant it was. ☺️", "jerryravi284": "Ungli bai 😂😂", "shreya_sharma._": "This is such a nice movie!!!!👏", "shripad.gurav.45": "Hypocritic", "neha.dubey04": "One of the best movies of yours and your art is even better! 😊", "sharmadeepti3007": "💐👏👏👌😍😍", "abdulwahid385": "Awesome😍", "atulpatil7117": "Abhi kitni hot ho gai hai", "sharik1512": "Waah waah waah...!!!", "shingh_0": "Flop actress", "anujalmighty007": "To all the bhakts commenting shit ,abusing and calling anti national to @reallyswara i am asking to all of you have you or any1 from your family has done anything about our country? The person you are calling anti national is a daughter of army commodore serving indian navy from decades . Just because you are against chor chowkidar bhakts are getting mad on you . Keep rocking chanda @reallyswara 🥇", "mystiquesunshine": "And what a movie it was❤️", "vidyamalavade\nVerified": "Verified", "nishi0505": "Nice movie", "bhawnarath": "To add a dash of relevance to the post it was a perfect example that education is not age bound. All characters in this movie were beautifully placed and the best was extracted from them. It was an awakening and sowed the seed for movies based on education that followed.", "vickkyidnaaniphotography": "🌷 ❤️chanda❤️", "rastogibela": "Chanda ..her tone when she speaks to her lalli still rings in my ears..best movie ever...swara", "arush.kumar.5209": "👍", "dhaval.x": "I love this movie sm!!! Forever Fav💜😍", "iamsameer_choudhary": "A very big actress @reallyswara really like you iam very big.. ❤️", "kanikajswl": "We❤️❤️❤️thus", "vishnukrishnacome": ",i Love you💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "meenakshi_somaya": "A very touching movie with great performances ❤️❤️❤️", "jaanebhidoyaaro_": "Chanda", "rathodc828": "Land dekega movie. What she has said to our national hero gd bakshi that was shameful. Madarchod saali, border se army hat gayi na sab se pahale tu bhagegi.", "entertnmntworld": "Hi @reallyswara @ashwinyiyertiwari ❤️💐 #nilbatteysannata is one of the best film so far made On girl education so far in Indian Cinema.", "richa.arora828": "Where can I watch this movie?", "najif_patel": "Biggest fan ur acting.u always best actor @reallyswara ❤️😘😘", "sunrise.roshi": "Thıs movie was wonderful. I loved it . Ur an awesome actress. 😍", "_im_nitish__": "Anti-national swara", "artistsunny09": "One of urs best movie I have seen, best performance indeed ,love & respect for u❤️🙏 @reallyswara", "manish_stylist": "It's one of my most most favorite movie and ur performance in this film is so amazing.. God bless you @reallyswara 😍😍😍", "astitvabatra": "It was so pure and good I still remember it seeing it with my whole family 🙌", "manish.s.kumar.88": "Just finished watching it!!! One of the most wonderful movies I have watched.. Amazing performance @reallyswara 😍👌👌 All the very best and looking forward to see you in many more films with such amazing performances 😊", "rintinintin": "What else do you expect from racist and bigots like Swara. People like Swara who masturbate on screen for money will not be respectful for any soldier. She will sell her mother and her mother land for money. Then there are those idiots who support Swara and have their own mental logic. Anyway all her activism and social justice is fake. All she wants is money from politicians which is now been proven through her campaigning for assholes like Kanhaiya.", "suktika08": "Love your acting!❤", "anil.kumar.king": "It was a great film. Please continue to work for good projects and I won't have to search for good movies, just look for the ones in which you are acting...", "harsh_dhoka": "It was a really very beautiful movie dear ma'am and inspired alot in its course @reallyswara 🌹🌹🌹🌞🌞🌞🌞", "vaibhstunning22": "Shame on you swara we are ashmed of you 😢kitana neche girogey kitane mukshil sa desh ko azadi mili aur tum divide karna chahati ho", "tanisha.kristo": "😁😁😁😁", "md_fazle_rabbe": "You are born to doing this garib role..", "roromehra": "Thank you for a fantastic performance! Whate film ❤️", "chauhan_saahb_": "Anti National dumb bitch...do you watch YouTube? Because many people on YouTube destroyed you with facts and exposed you...I dare you to answer any of their question..and yes get your ignorant ass updated before talking shit", "jr_talha": "Shaandaar", "archisha_010": "A seen a&zd", "rupeshjaipilley": "your acting skills was superb in that movies", "shbhampandy23": "Mam please give me a chance to work in sweety sen biopic I met u in nainital with sweety sen her friend @reallyswara", "devganjinnie": "Loved d movie....u rocks swara.....commendable job....#best actress", "sahuritz": "I loved nilbatteysannata... It made me a big fan of yors😊 later seeing u as modern liberal indian firmed it up", "rudranritya0908": "❤️ In love with your ability to take roles so well! 🤗", "adiiiiiiiiii18": "One of my favourites 💐💓💚⭐🙌🔥👏", "puzzyzord": "My mother loved your work in this❤️❤️ you are so amazing😍😍", "hafsathehotilier": "🔥🔥🙌", "jaya.mehra": "I just love watching this movie, and my mom only remembers u because of ur outstanding and so touching performance in this movie❤️ 🤗", "tanyagulatii": "Was a great movie, watched it with my mum, cried in the end 😍🙌❤️", "the_mind_manipulator": "I ve fall in love with your acting after watching this movie .....u r awesome .....all the best", "_nome_999": "best movie", "chayanikad72": "👌", "khan37500": "I loved this movie i watch 9 times i think real acting @reallyswara", "sadhvi_kewalramani": "Remember this movie? @sangeetasurendra 💜✨", "mohmmad_shakeel_official__user": "Nice one ❤️ @reallyswara", "nidhii__x": "All time fav movie 💗😍💗", "nishankgulati": "Really wanna watch this movie. Is it available on Netflix, Prime or any other channel? @reallyswara", "saddamrock786": "My fav movie💟", "chaudhry.mehak": "Excellent movie! Well said @reallyswara ..", "shreetamaghatak": "Your best movie till date❤️ and also one of my favourite🤗 thank you guys for making this wonderful movie😇😇😇 @reallyswara", "christian.alen.96": "❤❤❤", "srishtii07": "This is one of my favourites. 😭", "surbhijain.1405": "Really awesome movie 👌👌...and the dialogue really touched me...Dr ka beta Dr...Er ka beta Er toh bai ki beti bhi Bai banegi...and then she became collector..@reallyswara", "zaidchudhary7": "Lal salam", "lostboy0707": "@reallyswara ma'am ❤️❤️❤️", "mehedi_os": "One of my fav movie😍", "sauravvsinghh": "This movie was on one of the principle of communist ideology baai ki beti baai nahi banegi sab ko barabar ka haq milna chahiye education k liye #lalsalam #jaibheem", "reallyapra": "Hey you fav lady♥️", "prafulkade": "🔥🔥", "mumtaaz_hussain": "I can watch this movie again and again ❤one of my most most most favourite", "david__cool_dude": "One of best movie....of Bollywood....👍", "romilakashyap": "One of the best movie !!", "ravin9122": "Such an amazing peice of art ...", "akshayraj111": "One of my favourite movies. 🌟⭐️", "aakanksha2410": "One of your finest works❤️ beautiful movie", "nisha_xalxo": "Awesome acting 😍", "imran_anwar_official": "City of Taj Mahal symbol of love, truly you are very talented actress @reallyswara", "shiva_agarwal": "How amazing it is to see actors play the characters of a normal people with the same amount of anger hate agony patience & love only to make the audience understand that actors are just a normal people. @reallyswara", "pooja140420162619": "💖😍😘❤️💝👌", "shailu9226": "👌👌", "banodeishant": "fir aa gai galiya khaane ..", "megha_2113": "This is such a gooood movie! Jitni baar dekho utni hee baar kam hai. 💕💕💕", "iamkumarjha": "Just loved it. You are amazing!💕💕", "anwar_ali_shaik": "One of the best movie of urs frm tht time im big fan of Urs Good luck @reallyswara", "rainbow_waffles18": "❤️", "sufisaif786": "Great movie swara ji", "sandytherockingman": "Isss kalu kaluti ko heroine kisine babaya", "vishalshevale298": "Good movie", "deba_7793_": "It was a awesome picture........ I love it so much", "ahenonu": "My all-time favourite movie! 🧡", "sanchitagusain": "💕💕", "explorewith_littlegloves": "It was a great movie 😍", "smokingkrillz": "I loved this film!It's very heart touching.All rights to be proud of it!", "neetidutt": "Yes you are a fucking dramebazz and full of shit. How dare you speak such shit about a veteran soilder who has saved us. People like you should be ashamed of your existence", "lalit_kinng": "Superb movie and great acting from all", "khanrafa": "Much love to u ❤❤!", "parul.singh.writes": "@reallyswara absolutely love this movie ma'am. My mum enjoyed it watching with me. ❤😊", "akkashkaggarwaal": "Love....Forever❤️", "riyabakde": "Loved the movie and you were flawless. ❤"}