{"niharika_tapadiya": "kitne paise leke soti hai", "turophile_tibet": "Epitome of South Asian Beauty😘", "shubzznevergiveup": "@reallyswara....Teri aukat hi vahi hai.....aur bhagwan ka naam apne sade hue mooh se mat le....Randi kahi ki", "ashish_rathor9": "Mere cooments q dlt kr diye 😹 sach kadwa lgaa kya??", "yash_ks_": "Aajkal to teri sakal hi gndi si lgti hai bhn 🤣🤣", "urooj.fatimaa12": "💕😍👌❣️", "blueseamotion": "Red pundi", "khushi_varma077": "@reallyswara AYEGA TO MODI HI", "siddharthsharma799": "😂😂😂", "rajeshdas4322": "Wow", "im_nikai": "Ayega toh modi hi😷@reallyswara", "samriddhi116": "Aagya aab to modi toilet me hago aab", "shrotriyasaurabh": "So beautiful", "stark_bill": "💖💎", "ankeeta71": "😍😍 love @reallyswara", "sakshi_koshti_": "🔥🔥🔥🔥🔥🔥", "sheikh_hamna_hasan": "😘", "sanjeevparmar55": "swag bhagwan ki den ....aur ghanta kiski den .....mahadev ki @reallyswara 👎👎👎❤️❤️❤️", "sh.iva3312": "Most beautiful actress", "imtalib_chauhan": "❤️Dashing 💓looking❤️", "penamtamang": "U r my favorite actress in the world 😍😍😍💗💗💗", "mejnyk_o4": "सुआर भास्कर 🐽", "akki8rules": "Right place for u to live🤣...deshdrohi", "srushtij1205": "Sadhvi prgya ji ke pr comment krne se pehle tum to pure kpde pahnkr aaya kro... Tum jesi ko kya Movie me to masturbation krke apna kam dikhaya h... Porn star bn jao... Smji suar kahi ki @reallyswara", "chiccoalvin": "Check out my page please 😊", "manish.swami.66": "Farzi comrade", "tarasingh2808": "Pls unllower dis bullshi b**** bskr", "sidd_x_": "Yeh Randi h ky", "rohit_manocha": "Randi", "ashwanitiwari129": "👏👏👏😂", "richapandeytx": "Disgusting", "ahmadcouture": "Gorgeous", "atidarshi_sharma": "How can someone be so ugly inside out..", "rajput_rpihul_64": "Rakhel bn ja uski😋😋", "datingwithart": "Piece of shittt🤣", "ape_kng": "Looking very beautiful", "the_salmanshaikh_official": "❤️", "aarnavtyagi": "Randi nangi Ho ja Kuttiya tera Yaar jeet jayega", "ravavvbbbbb": "😍", "vaibsrv": "Lovely, gorgeous..................😘😘😘😍😘", "jotta_raath": "red salute", "arjunsoni_1313": "Dub ke mar ja desh darohi 😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡", "vivekkumar7821": "You have dirty mind cause you support anti nationalist people like khanyia kumar", "ka.ran2642": "Sahe jagh khadi h toilet Mai yehe aukaat h Teri nachniya kaheki", "sarthak.soni.12720": "Swag bhgwan ki den bewkoof ise swag nhi chutiyapa khte hai. Tune Mere desh ke virudh bola hai tu tukde tukde gang ki chat ti hai", "pawanchandwani557": "Randi land kha mera", "pranay4u": "Swag kaha hai?", "shivam_chaturvedi_777": "@reallyswara srm ni aati us kanhaiya ka support krte hue ..hindu hi h ya koi aur..... Fam pane k liy anupam khair ka reply krti ho beta tumahri bo aukat ni h .unke samne ok bo wrldwide famous h aur tum jesi ldki isliy to kch khas kr ni pa rhi b town me isliy sach k sath chlo", "rajeebs3455": "Ayega toh modi hi", "annupam2003": "U r to loving", "sourabh_21gaikwad": "Noreally swara ❌ really communist ✔️", "harsh.suryavanshi_": "Swara I can watch shit but not your face lmo😂 #yousarabashar", "atulpanday121": "This election Use your finger wisely and vote for modi", "ashu.ydav": "Behen ki lodi", "manofno_ego": "बॉलीवुड में तुझे लन्ड नहीं मिला क्या की कन्हैया लेने पहुंच गई।।🤬🤬🤬🤬🤬", "nishirdas102": "Kamine sawara bhaskar....politician not actor mai aapka fan tha jb se aapka speech suuna hu us insaan ka liya jo india ka bare me glt bolta hai...mai bhi desh ka yuvak hu lekin swara tera jaisa harami actor ni hu....tera liya ab sb gali bhi kam hai ab tu jis movie me rhgi koi movie ni dekhuga....kyuki ab tu actor ni rahi kamine", "studio_dharua_clicks": "Is Rendy ko like kon kr rha hai", "amankumar9888": "Randi sali", "realshaco": "Hey @reallyswara use ur finger WISELY AND VOTE FOR MODI. JIYA HO BIHAR KE LALA MODI HAI GANDU ACTRESS..", "umarqazi_jk": "Lal saalam ❤️", "08_vikram_": "Ek nihaayti ghati aurat h @reallyswara Jise antinationalist log pasand h or isey hume majbooran tv par dekhna padta h. I wish kareena jesi heroin or industry ye dekhe or iss swara aunty k saath kaam karne se bache.. Or swaraa ko movie se dur rakha jaaye taki aane walingeneration aisi lady se du rhe jiske mannme desh k liye Ehar bharaa h", "vishalraj5025": "@reallyswara aunty Pakistan jao", "dynamocreats": "Aur inhe public me photo khichne nhi diya gya.. Kutiya samajh ke 😂😂😂😂😋", "shete4177": "So good to see placards are hounding faux pass Librats like Swara who shot to fame due to placards abusing Hinduism after Asifa.", "maxx_maurya": "Not interested", "vbhv_agarwal": "@reallyswara Use your finger at the right place🔥vote Modi✅", "12345urq": "kumra ki randi 🤣 chudail🤣 tu hi vo hijdi hai jo desh ke Muslim aur Hindu logo me dange fasaad karaana chahti hai. Madarchod aurat, jaake ungli kar khudko. Kyuki tere tatti se kam aukaat wali baaton se you can't spoil the HINDU-MUSLIM unity of India. Hijdi. movie toh koi deta nahi, isliye faltu ki bak bak karti hai raand", "yashchavan29": "extremism- bhagwan ki den. Madarchod sali. hindu Muslim ko ek dusre ke taraf bhadkati hai madarchod. chudail aurat. sali cancer hai tu India ke liye madarchod", "sudhanshusinghjagawat": "Randi", "rishabh__8686": "Aunty😂😂😂😂😂", "sohampuranik_": "चुतिया😂😂", "bing_sparks": "I support you buddy! And genuinely.", "smitb05": "Vote for MODI", "tusharr_shetty": "Lovely😍", "iamaulik7": "I hate her lot. Even after so much of shit past still she is like this !", "vikas_yadavs": "Ungli krte huee video dalo na😂😂😂😂😂😂😂😂", "santoshkumarvai55": "Sakal dekhi hai", "ankur._.sharma": "Wasted such a beautiful dress to cover nothing but a pile of shit 🤣", "parul_268": "You better disable the comments option on your pictures or people will keep on shitting in here 🤣😂🤣", "punk_just_got_serious": "Dhat teri maa ki chut @reallyswara", "_darkrider__": "Kahe ka swag 😂 bin makeup k dadi lgti ho bc...😂😂", "officially_jat": "Bate b achi ni or shkl to khr achi h hi ni..😂", "shilpagpt91": "Guys unlike Swara Aunty use your finger wisley and vote for Modi!!", "nri_insomniac": "Abbe dekh le saand na pichhe pad jaye 🖕", "connect_2_megha": "Upar vale se khauf kha khullta bhenchod tuj jaise logo ko toh is country se nikal dena chiye still we are tolerating you bloodyhor", "amitganorkar": "Ye Toilet bhi modi ki hi den hain ... next year rojgaar bhi milega 😂😂😂", "be.like.deepz": "Swara bhasker or swara bastard🤔🤔", "sagarj_oswal": "@reallyswara😂 didi aapki toh lag gayi..", "niteshbarua": "Tatti in Right place😂😂😂", "paras_birla": "Support BJP not congress", "dilpreet18___": "vote for modi", "iam.juhiverma": "इज्ज़तदार लोगो की तुम्हारे जैसी संतान हो तो वो शर्म से ही मर जाए@बेशर्म", "mohit_s.sharma": "23 may ko without mackup ke rota huaa photo upload karna... natural face... or kuchh dard bhari lines bhi likhna..", "shanaaya2000": "😍😍😍😍", "ritesh_7198": "Shit", "rithu_______43": "Disgusting lady", "mai_prasad_hoon": "Use your finger wisely swara 😂😂😂@theplacardguy", "akshansh.v": "Ab Pakistan kab jaogi.....😂😂😂😂dogli... Pakistan jake Pakistan ki tarif fir movie nhi lgne diye Pakistan me jisme tu ungli karti hai to Pakistan ki burai......itna bda dogla insaàan nhi dekha", "sayiteja": "❤️ you @reallyswara", "jinping.shb": "Modi ne deshdrohiyo ki maa chxdi😂😂", "ajay_uikey_": "Awara aunty suar aunty😂", "vikas_singh_jamwal": "This election, Don't be like swara vibrator, use your finger wisely, vote wisely", "abhijeetbhu": "लाल सलाम", "deven_k_yadav": "ओर गरीबो की poo** pa*d*y..", "nihar963": "Brave n beautiful.. 👑", "shrimantroll": "@reallyswara Your choice of people for running of this country is worse than the choices you make picking up your films.", "rathodc828": "Ye actress hai? Buffalo jaise shakal hai aur lal salam kehati hai😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅😅", "payal4_4": "@reallyswara ..kbhi muslim k baare m toh nhi bolti h ...arre haa tere pe muslim fatwa nikal denge na ...fir tu kahi muh dikhane layak nhi rhegi...hindu tolerate krte h tere jesse logo ko tbhi toh itna bhonkti h kuttiya", "jiturathore7773": "Sahi jagah chuni tune tatti ki jagah toilet me he hoti he 💩", "nileshshah105": "Ap bhi modi against?? Then i do not like u", "the_religion_universe": "Tum bahut ZAHREELE ho🤣 @reallyswara", "namo_2024": "Suarwa khan bhosda😂", "the.shekhar": "Use your finger wisely 😜", "shobhit.mittal2510": "Boycott her films and Web series", "khatri_1004": "Sad to know that such a great artist like you support tukade tukade gang .. never expected this from such a wise person .🙌", "pawan_nayak": "Jnu wallo ki randi", "nikhilchauhan066": "Swara .. suwari behenchod ! 🐷🐖", "utkarshsingh23123": "Arre kuch mat bolo ise. Besharam ho gayi hai ye aurat. 😮😮😮", "archishman_gupta": "Congress ki rakhel 😂😂😂", "itzzsurbhi": "Tmhara bollywood m chalne wala toh h nai flop lady.. apna tym Pappu Ko de sayad wo tjhe ache se de...", "_rajputbrat_": "Swara did you used your finger wisely 😂😂 @reallyswara", "bugssbunnie_": "💩💩💩💩💩", "insta_ashish_8034_": "Swara bhaskar is shit on this earth 💩", "sanket__303": "Can u use ur same finger for the vote💥💥", "singh.ankur_": "Traitor", "_manish_shah": "🐖", "karthik__bs": "🤮🤮🤮🤮", "_memewali2": "So She found new place for masturbation 😂", "mona123.dutta": "Bitch..... Janwar bhi tujse jyada respectable hai.... Sali gutter se pyeda hui......", "rahulvats21": "💩💩💩💩💩", "khushi__uniyal17": "Sharm toh ati ni hogi kyuki izzat toh hai ni suara Bhasker ki waise Congress ne ticket ni diya Abhi tk hww😂😂😂", "imashofficial": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩 hijidi ...", "nayaannn": "awwwww @reallyswara aukaat kya hai teri sab comments se malumb padd raha hai #antinationalist", "devotee_hari_": "Choose your fingers wisely, don't like swara #votekarindia", "a_sri_vastava": "you're a bitchy bitch", "leostar.24": "Uss Toilet mei bhi Kalank lag gaya", "juliocesaro911": "Good job! Thats the face you make after deepthroating circumcised dicks in public toilets to smash brahminical patriarchy", "mohit_sarpanchh": "New leader :- famous hone k liye tweet karna sikh gyi", "pujasharma371": "Chal bhag bitch lag rahe #randi", "_sanjay_sinh": "Best place for you 👌😀", "iv_5062": "aise logon ko films me b naai lena chahiye 😑", "_arya_abhishek": "Bollywood m tjhe koi free m v nhi chodegaaa", "roshanthadkiya": "She is thrown out of bharat sarkar ad that’s y pity lady 😂😂😂😂😂", "kiranchavda83": "स्वरा ,पूरा देश टुकड़े गैंग का विरोध कर रहा है ,और तुम भी उसी गैंग की हो ,और सस्ती प्रशद्धि के लिए इतना भी नीचे मत गिरा करो कि देश का नाम खराब हो जाए ,थोड़ी अक्कल लगाव और अपने काम पर ध्यान दो ,,", "rajmeetdey.07": "Slut 🖕🏼🖕🏼", "rinahennu": "Hate u😈", "vandana1331": "🤮🤮🤮🤮🤮", "lyfs3t": "Aayega toh Modi hi😂", "i_am_suraj999": "Flop aunty", "not_adarsh_at_all": "Kaafi chutiya.", "its_me_shriyash": "Swara aunty aayega toh modi", "himarawat5": "Yaar tum toilet me jakar photo khichwati hu. Eeee kitnaa giroge Bollywood wale", "shwvan": "Hot n sexy", "the_sanatani": "Photo kitna bhi daal le kamini , aayega to modi hi 😎", "imsonamj": "Traitor and antinational. Swara kanhaiya kumar", "sanobermasoom": "Swara I m masoom Akhtar and miss u", "aap_ka_nawaab_": "Isko Unfollow karo sab", "vatsishan608": "Suar bhaskar.... Bhen ki lodi", "sumit_l_shinde": "D's election don't be like a swara Bhaskar use your finger wisely vote wisely 🖕", "antara_hazarika": "Shitty auntie in toilet", "the_youngblogger": "People like should be publicly decapitated 💯", "divit_cr7": "bitch! you dont even deserve to live in this country go to pakistan and get fucked by the miltary there!! next time dare to say somehthing bad to general bakshi you'll be screwed badly", "latak7008": "Waaao...kaash aap yaha se kavi bahat hi nhi aati to toilet waki gandagi se hm log bach jate...😂", "blood_of_hind": "This election don't be like swara bhaskar ....use your finger wisely ❤️😂😂😂😂", "anujabasak": "Last of all toilet me v photo session Suru kar Dia appne😁😂😂😂😁😁most of the viewers still didn't noticed that it's a toilet or bathroom where she standing😁😂", "himani.023": "Yes poop suits in toilet😂", "raj_ban_here": "You are loosing audience", "tarungurjar3211": "Abey jaa ..pakistan chlija waha zada khush rhegi mental aurat..😡😡", "bhupendra8823": "ओर सूअर केसे चल रही है तेरी दुकान", "aarushsingh2508": "Yeah #reallysuar", "desh__premee": "Swachh Bharat Abhiyan aaj itna progress kar gya ki @reallyswara Ko photoshoot krwaney ke liye sbse saaf or achi jhanga \" ek toilet\" mili .... 👏👏👏 mitro or kitna vikaas chaiye 😂😂🙌🙌 ..... Isliye fhir ek baar modi sarkar #modioncemore ... Use your finger wisely mitro and vote modi g 🇮🇳🇮🇳🇮🇳🇮🇳 .. kwww.pmindia.gov.in", "chirag____9": "Swara bastard", "divyegoel17": "Looking dumbo from head to toe", "__.yashmai.__": "Bhenchod😠😠😠😠😠😠", "not_the_jedi_way1": "so many comments on her that she is an anti-national but i never saw her saying something against the nation......yeah she occasionally say against the government...but last time I checked saying anything against government is not being Anti National.... and who are we to give someone a certificate of being anti national... If u still feel so...why don't you fill sedition case against her........ India is a big country consist of many people how can we expect everyone to have same point of view......and if you don't like her unfollow her... instead abusing her......in my view as a nation mother India ( personified)will not like her children to abuse one of her child like this...... ...", "shiva_the_saffron_activist_999": "Xhinar😂😂😍🔥", "vipinganjoo": "This election don’t be like Swara bhasker use your finger wisely", "paw.vivek": "Mam seriously kanhaiya Kumar said gas cylinder end after 3 or 4 days..is it true..what abt JNU", "positiveandexcotic": "💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "mandeepmalik100": "Thtz whr u belong to ....u r the real shit of this country nd u should stay in toilet only", "irakshak": "Ek Hi Nara Ek Hi Naam Dil Se Bolo Jai Shri Ram #JaiHind", "wamiqhusain": "Beautiful", "baliyan_s": "Charam sukh liya kya yha b???😜", "xoomm__": "Suwar bhaskarrr😂😂😂😂", "awais4077": "❤️❤️❤️❤️❤️❤️❤️ lovely", "sonu18_abhinav": "Mesmerizing 🤗🤗🤗🤗🤗", "roshan_mahto": "Flope actress jaao kanhaiya ka juta chato", "sunnykumarrawat": "Maim looking cool", "doctorhoda": "Trolls = frustated paid losers.. U r one of the bravest outspoken lady of truth ever seen.. Salute.", "pramodsharm": "❤️❤️❤️❤️❤️", "ashpat007": "All this swag while being so retarded and trashy.", "pdm_confession_": "💩💩💩💩💩💩💩💩💩💩💩💩💩", "_parvez__alam_": "👌👌👌👌👌👌", "pankajpt2005": "Vote for Modi g", "coffee_with_rehan": "Hotness another level 🔥", "sahidulshaikh317": "Gorgeous pics swara", "rahul.mehra.7": "Nice photo shoot awesome photoshoot", "ar7_warrior": "💩💩💩💩💩💩💩💩💩", "sritambiswas12345": "Kya ra randbaz kiti laga chodne keliya", "vmongs": "Really SUAR 🐷🐖🐷👍🏻🐷", "thatpunjabichick": "Dope🔥🔥🔥", "vinay_sidh_nath_singh": "Who the hell are you to ask us to support kanahaiya Kumar. For us country is first. If you want to be with kanahaiya Kumar then get married with him and go spend your whole life with him in Pakistan because both of you deserve to live in Pakistan only", "pinsdreams": "🌟✨🤩💫⭐️", "allwayssrikanth": "So beautiful in red..💕💞❤️😘😍😍", "neha.dubey04": "Is there any legal website who are watching these abuses!? This isn’t called trolling, this is disgustingly pathetic sluty minds are destroying this page!!! @sushmaswarajofficial please can you do something about it?", "priya_rock_on": "Pretty u as always 🤗😘🤗", "toshirnalwat": "Bomb", "bharatcharan5": "Shame on you swara bhasker a pathetic Lady who is idiot and anti national I think you are bullshit OK", "bollywood.classy": "😍😘", "bangi1993": "Hot in red", "arshu_rana47": "Brave actress ❣️ Brace enough to stand with the truth even when the majority is blind in bhakti!!", "saket775": "All the swag starts in the toilet...if the session is good..the emptying is very fulfilling.", "arbazigar1999": "Congress party is the truth party. Next pm only rahulg", "viveek_kr": "Aunty aunty ...moti", "rahull_2733": "♥️♥️", "rashu.gohil": "I am watching ur series \"it's not that simple\" nd to tell u I'm juzt loving it sooo much.. u r lit babe 🔥🔥🔥🔥🔥🔥", "vj.sen": "💩💩💩💩💩", "vaibhstunning22": "Thanxxx aap roj post dalati ho roj gaali sunati ho wo gaali dekh k sukoon milata hai ki aap isi layak ho 😬😁", "mrinalinitiwari06": "💕", "mnainesh63": "👍👍😍👌💕", "zinia_tahassum_zini": "Stunning", "whisky__1998": "Pakistani agent @reallyswara", "vaibhav.kumawat07": "Hot, sexy, beautiful and gorgeous 😘", "mukeshsinha0605": "Kitne milte h congress se..? 😂 😂", "keystrustindia": "Swara please have someone on your team contact us. We could uae your help and support.", "duberich": "Woman!! U r such a trailblazer😍", "sureshkumarrajpurahit": "Nice", "abdulwahid385": "Awesome mam!", "sunil__goswami": "❤️❤️❤️❤️❤️❤️", "rakeshsharma5066": "Thoda dhak lo...itna to Sanskar mila hoga na. Kaisi Bharatiya naari ho,sab Sanskar bhul gyi", "esakki_r_a_j_a": "😘😘😘😘", "r.k_singh007": "Madam ji Begusarai aaeye Na🔥❤️", "the_defender7": "looks gorgeous swara @reallyswara", "mohitsingh6065": "Soooooooooooooo Sooo pretty", "safejohny": "Yukkkk", "jbsaysdilse": "😂😂", "sana_aziz_1727": "💖💖awesome swara", "babu_gore_": "Hiii queen looking red queen", "akash_linsky": "If Result of defective Condom had a face.😂", "najif_patel": "Look always pretty.lagta he jamin pe pari aa gai he.so pretty😍", "mr_deepsky": "R@ndi", "shahwazmn": "Looking so beautiful you are", "jeetsrk": "Two hot", "rizwanmumbai11": "❤️😍", "pratik_kantode_5th": "Public toilet mein photo shoot I think pagal ho gyi hain (clearly someone clicking her)", "manudavid27": "When beauty meets quality... Much love Swara", "vidyarthi_n": "Begusarai kb aa rahi ho aap", "mayank.mahajan36": "Apna 56 inch seena kyu dikha rhi hai 😂", "amazingaasha": "last line swag bhagwan ki den", "rajveer_15": "Kidaaaaan😉", "khan_bags_mumbai_central": "♥️♥️♥️Sexy hot looking 🌹🌹🌹", "ujjawal221197": "Looking stunning", "nilesh.pardeshi.11": "Gorgeous❤️❤️", "that_stoned_soul": "Swara ~Bhaskar ko baashkar 😂", "deewana_sameer": "👌🏻👌🏻👌🏻😘😘😘😘", "khwaish_ek_dua": "👌👌😍", "whatyouwanttoknowaboutme": "🤤🤤🤤🤤🤤", "rg_dilli99": "Mam,u r too good...bhakts r too scared of u.....", "im4hit": "👌👍", "ugly_but_funny": "One good fart is all it takes to get many new expressions out of you 😂😂", "parihita": "😍😍😍 Hey guys!! Checkout our page @parihita and follow for amazing clothing collection 🛍😊", "instapavan_": "Lot ke mat aana ....Baahar shanti h abhi", "luqman_hakeem_hak": "🔥❤️❤️🙌", "jatinverma1548": "मेम आप एक अछि एक्टर हो क्यों राजनीति के चक्र में पड़कर हिन्दू मुस्लिम भाईचारा खराब कर रहे हो अपना काम करो जो आप पर अच्छा भी लगता हैं", "sadmavatiii": "Dekh beta aunty ne ghatiya post dala", "butter___fingers": "😍😍😍", "sachinkhelukar": "Nice 👑👑👑", "ash__khann": "Awesome", "vipi4you": "I love u", "chowdharysatyajit": "bkwas bekar deshdrohi swara", "urmit95": "Swara you are the best no matter what haters say about you... When people do something good, such losers come and bark unnecessarily, they can't digest that how someone can do good work especially if it's a woman... I'm biggest fan of yours... You're most talented and intellectual actress in Bollywood... Lots of love and respect!!! ❤❤", "ruppu4you": "Hotter than Summer 😘😍💥", "kushagrasinghgautam72": "Mtlb roz bhakton ko mirchi bomb marogi😆😆😆😆", "gurpal1988": "👌💣", "habeebakhter": "You look great in these pictures. 👌👌👌👌❤️❤️❤️", "farheenn__dr": "I watched ur series IT'S NOT SO SIMPLE😍 i loved it.. U did so well.. 😍😍 @reallyswara keep shining grl", "inugraha40": "cc: @pepitopepep @ra.fabrian", "simranjeet297297": "Sexyyy and beautiful❤️❤️❤️", "rahul0405gupta": "national disgusting girl @reallyswara feeling enjoy after masturbation, 😛😜", "prianca_jagad02": "@reallyswara I like it 😍😘", "ravishmrk": "So coooooollllll @reallyswara 😍😍😍", "urbancompany_beauty\nVerified": "Verified", "anthonydias5": "💞Lovely", "funnybones777": "Colour contrast:- Public toilet ki den", "lafaz_20": "❤️❤️", "richaa29": "Nice suit!! Classy stuff!!", "anirban.das.990": "She is a great actor and an honourable lady...... The language that's been used to troll her is absolutely deplorable..... One may like her or dislike her ..... But nobody has the right to abuse her.......", "fuz391": "That's is bathroom ...", "shad_shahjahan": "❤️", "abhishek.vashishtha7": "Tumharey jaise log toilet key hi kabil hai tumsey achey sweeper hai Jo samaj ki gandagi saaf kartey hai par tum samaj ki wo gandagi ho Jo samaz ko ganda karti hoo shame on you", "ravie_da": "The boldness of speech, presentation, fearlessness and clarity what I like most is you @reallyswara", "jeetendra1402": "Beautiful ❤️", "iamsameer_choudhary": "I'm very big fan @reallyswara nd looking gorgeous babs", "theaman.gupta": "Modi Sarkaar🙏🙏", "maan_ishhh_aa": "6xy🔥❤️", "diwakark111": "Beautiful ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "mohmmad_shakeel_official__user": "Aapke chehre pe muskan bahot achi lagti hai ❤️😍😘@reallyswara", "shravan_jordan": "😍", "gururyazz143": "Hahaha deadly combo red and black @reallyswara", "mankoo39": "Beauty ♥️", "silkyrainu": "@reallyswara u r amazing...", "paresh1909": "Sexyswara", "shikhaprajapat97": "I repeat again.Hijde wo nhi hote jo saddi pehnkr bajar me ghumte h..Hijde to wo hote h jo hindu hokar hindu ka virodh karte h..#suvraunty😂😂", "azeem6399": "Beautiful", "girish.makwana": "🔥🔥🔥", "rajput_zeny": "Haha nys", "anjanityagi": "Sweetheart", "im_jitendra09": "Adorable❤️😘😘😘😘😘", "realbishalpyne": "We love you mam❤️❤️❤️", "nafrazmohammed": "❤️👌", "s.v.chaudhary96": "लाल सलाम 😂😅", "shehnaazsheikh14": "👌👍💐💖🌈🎂🌷🎈👍👌", "karusakiiii": "Apna hath", "sharmavidushi55": "Right place for a shit 💩💩like u(swara) is a public toilet", "gurmitkher": "I love you babes you are awesome", "motivationmaheswari101": "TRASH", "ebakar2018": "The color of Begusarai", "amitcharegaonkar": "Beauty ..❤❤", "hafsathehotilier": "😍😍", "srijit_007": "Ravishing in Red❤️", "vishaltalhar": "Cool!!", "deepnarayan_khatait": "😍😍😍", "varunshegal": "💓", "shaancheema": "Gorgeous x", "art_journey_with_pallavi": "Hiding your face there or what😂", "lalit_mohan96": "Awesome 👌 😍", "rudradattsinh_4545": "Jorr", "ishan.aranjikal": "Smashing as only you can be!! 😍", "akhil_singh_rajput": "Superb", "stanleyfernandez": "Pretty", "nihalkumar15011963": "Beautiful", "kingaaryantoshniwal": "Wow super cool😍😍😍 beautiful attractive girl😍😍😍", "imshoyebkhan": "looking fabulous", "jaysingh20dec": "Cool 😍😍", "shivdpande": "Swara you are atrangi", "pokhraj.roy": "@reallyswara Didn’t you know: ‘Jaha Soch, Waha Shauchalay’? Soch was involved.", "ajy_gaikwad": "😍😍😍😍", "ben87yao": "😍💙", "banekar_adil": "Red Rose 😍🌹", "sunil.2949": "https://twitter.com/News18India/status/1121323827257118720?s=19", "beingrealakaash": "❤️❤️❤️", "shingh_0": "👹👹👹", "08prateekdixit": "😘😘😘😘😘😘😘", "hope4christjesus": "Beautiful 💕", "thakur_.___": "Splendid", "jayvir166": "Bahen ki Bodi 🤬", "notyours.xf7": "https://youtu.be/0gW7ZozUDLM Plz subscribe to my channel", "tanu_227": "Sooooo good @reallyswara ♥️", "__jackreacher__": "Indeed thts a million dollar smile....superb! 😱", "rihanasinghal": "Public toilet m photogragh....🤪🤪🤪🤪🤪🙏🙏🙏🙏🙏🙏🙏", "bubbles_crushers": "nice", "mkmaharanakailash": "My crush😊👌", "manasgaba2794": "Gorgeous and very pretty look in red @reallyswara ma'am", "kapil10010": "😍😍😍😎👍👌", "rdeep22g": "🔥", "archanamisrajain": "😂😂😂 looking amazing though friend 💗"}