{"anshikasingh7327": "Suwar", "amitngplqq": "Or jab yhi chijj hinduo k sath hoti hay tab kha chhup jatti hay tu.mob linching m kya cow k smugglers hinduo ko nhi marte . Bhaskar ki jagha khan likhna shuru kerde.modi to inka pegumbr hay 😏 jisse allah ne bhejja hay muslimo ko sudharne k liye.jiss Pakistan ki itni badai kerti hay tu vha minorities k sath jo hota hay uss pr nhi bolti tu.bomb muslim fhoode ,logo per julm vo karre or terrorist hindu.or rahi baat gau raksha ki to hum to karenge . gareeb kissan k pass ek hi chijj hoti hay jo uske pure pariwar ko palti hay gau or ye usse hi chura k kha jatte hay.😡.", "nourel82houda_": "Next 5 year will only b horror in current racist Indian government", "karan.chouhan.5249349": "पाकिस्तान के अल्पसख्यको के बारे मैं भी बताओ।। लोगो को भ्रमित न करें ।", "__mr____manhas": "Han bad to hindu hai jb 1 million kashmiri pandit ko mara gya rape kiya gya tb kaha thi", "yash.chaturvedi.397": "Actually u r a hmm somethin more thn a nasty bitch.....", "ashwanikr92": "😂😂😂 kanhaiya jeet gaya Kya @reallyswara", "idurgeshkatara": "Swara tujhe jld ahesas hoga.... Ye mera vada raha!", "abhishek291190": "Randi", "arwinarora": "I came here to abuse but tera gaaliyon ka ghada pura bhara hua hai bas ab tere paap ka bhi bhar chuka hai.", "amankchauhan98": "Kanhaiya iss ki jhaat katta tha😂😂😂😂", "alfa_4g": "Kya madrchod kidr hai tu lavdi", "symberians": "Behn ki laudi katuo paisa dete hai kya tujhe", "aloksingh1560": "Anyways whole nation knows, that you support communist party & being one of their members... Expected this shit from you... By the way, why don't you settle down in Pakistan as you mentioned in one of the show, that Pakistan is one of the most beautiful and peaceful place to live.... Useless actress & person on the earth @reallyswara", "sakshi_thakur_03": "You are a total bullshit 😡", "pasarnikarvishal": "Swara jee please give your opinion about Pakistani hindustani. you never discussed about that people. they are not secured all time", "its_me_tanuj11": "Tu bhokti hi raho zindagi bharr lekin tumhare hath me kuch nahi aayega...... Secularism ye ek bimari hain", "saiprasad_2409": "Pkmkb", "monali_thakore": "BANAYIYE CARTOON MOHTARMA 👍 HAMARE YAHA CARTOON BANANE PE LOGO KO GOOLIYO SE BHOON NAHI DETE HAI 🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳🇮🇳 #charliehebdo", "nysha133": "Suara Bhaskar Masood Azhar ki paidaaish hai", "choudharyshivjuhi": "Nikal ***** ,pehli fursat me nikal😂😂🤣", "supersuvnan": "Wow what an ungrateful Indian this woman is 🖕", "hari_prem_kevalam": "You're a very poor girl. I never say this to anyone but trust me you don't deserve to be in our country. You're a fake woman, who thinks that freedom of masturbation is woman empowerment. Your thinking only works through your ugly brain but never from your heart, as you've never spoken about kashmiri pandits, and godhra hatyakand. Though I have so many Muslims friends and we live with so much love and peace, wrong is wrong. And you're a bias lady. Don't show yourself which you're not. I personally feel sorry to your parents to bring such a stupid girl to this planet and especially to our beloved country. Please go from here if you have so much problem with this nation and government. Please we don't need you. 🙏🙏🙏🙏🙏🙏 god bless you wisdom to take a decision to shift from here to any other country. Jao behen yaha se kripa karke.", "neraj_nayak": "10 baap ki beti", "srigulshan_": "Pagli....! Aisa mat kar pyar ho jayega😁😂😂🤣", "vishal_rj_05": "Yr ye tb kha hoti h jb hinduo k sath galat hota h use hmare yha b aana chahiye thoda sa prasad to legi ye chee itni irritated thu h iski life pr", "arya_vaidik": "Dawood sponsored swara", "riteshr.patange": "Aaj kl ka fashion he Hindu k khilaph bolo, Modi k khilaf bhonko Aap mahan ban jaoge...... Ajib C*apa he yarr.", "poddar1227": "Bhag gayo", "the.lucifermorningstar": "Zindgi bhar bhaukti raho or kuch ni milega", "siidharth_sharma": "Are bhen ki loudi tabrez humare jamshedpur ka hii haii :)) or wo ek chor tah or wo chori krne raat maii 10 km gaya tah apne dosto ke sath uske baad waha ke log use pkd ke pitne lage ya jo v kiye lekiin uske baad usse police public se bacha ke hospital maii treatment karwane le gayii uska pic v haii police walo ke sath uske kuch din baad uskii death ho gayii to zarror iske kisi dost ya jo iske sath us raat gaye to wo kiiye haii iska murder ya phir koii dushman isliye bhen kii loudi feminism kii gaand phle ache se jan le uske baad posting posting krna ❤️", "vi.shal8639": "Lawadi nikal yaha se 🤫", "being__amit": "Why you not talking about kasmiri Pandit.....kyunki minority to kuch karti hi ni hai na suara", "kumarmanish63": "An unsuccessful actress who have done many movies but still nobody knows who the f**k are you ... So through such controversial things you want to be in headlines...😂😂😂 Not gonna work 😂😂😂", "sharmashiv8989": "Ek bat ka jabab dene ap apne kabhi ankur saxena mathura ka bharat kumar jo sirf apne lassi ke paise mang rha tha to usko mar diya dhurav tyagi jo apni beti se ched Chadd ke virodh me muslmano ne mar diya in sab ke bare me aapne ek bar bhi awaj kyu nhi uthai tb ap kyu nhi bolti tb kya kuch dikhai nhi deta ap andhi ho jati ho tb esi ghatiya rajneeti kyu krti ho aor ek bat to jaan hi lo hr hindu apko boycott krega ab 🙏🙏", "toriko_tatsumi": "And why don't you speak against terrorists? Do they sponsor you or something", "lu_cky_5989": "Deshdrohi swara", "gautamprashant567": "Kon ganja fukti hai", "jayy.padrino": "@reallyswara I urg facebook, instagram and twitter to block this nonsense lady profile.. She thinks she is celeb but actually she is some Moron who wants to be In limelite like rakhi sawant.. Welcome to the rakhi Club.. U foolish and baseless mind.", "abhijeetkarlive": "Bhai isko samjhaane ka matlb nahi... Ye aurat hi chutiya hai🤣🤣🤣 @reallyswara she's really a blind chutiya🤣🤣🤣", "sunidhi2627": "Abe rndi tere ko n pta chalega gaar marao tum srf...", "sharpsharp81": "Teri okat Ameer logo ke bistar garm krne wali", "nomadwithlens": "@reallyswara llyswara Nikal Nikal pehli fursat Mai nikal", "nikhil_mattoo": "Pehli fursat mein nikal, Desh chod... Pakistan Jaa...aur waha se jo bhi tweet ya post karna hai....WOH KAR....bimbo", "rachit7002": "Cmnt section is full of idiots 😂😂😂 n post krne waali unki rani😂😂😂 bkchodi ki hd paar kr rakhi h", "arijeetsingh950": "U r a big anti indian anti hindu .", "_jug_.head_": "jo tukde tukde gang ke sath ho...:unhone ye bat nahi ki to hi achha hai😃", "naushad_insta": "Lynchistan 2😁", "ayush_tiwari_211": "#no_offense bt khati hindustan ka aur boli kahi or ki nikal pehli fursat main nikal 😅😅", "mydie.young.world": "एक पोस्ट डालकर आपको लगता है आप ही एक महान आत्मा हो बस आप को ही दर्द होता है, और जो देश में और भी violence हुए उन पर तो कोई पोस्ट नहीं आया आपका. जा की आप को तो और भी इससे", "irrfan.29": "Comment dekha ke aisa lag raha h ye sab chowkidar ki alaud h ab comment dekha ke offence honge kuch fhate condom ke natije🤣", "nic_rwt": "O rndi ki aulad apne gnde muh se Hindu word bola kr or agr itni hi rfrt h to pakistan m jaa k katte hue lodo ko muh m le @reallyswara Rndii", "ab197515": "Get well soon swara bhaskar", "yadavyadav82": "@reallyswara tujhe kerala, jammu kashmir , bengal me kyu kuch nahi dekhta hai ......... Jahil aurat bewakhuf aurat.... Character less aurat ,tu modi g ko maat sekha kya karna Hai une, tu modi g k jhuti to bhot dur unke jhuti k dhul k bhi bara bar nahi haii😂🤣.... #reallysuar @reallyswara", "s_haktii": "Han hum Hindu hi to h etne Khaali kuc kam to h nhi ki chutiyap fhelaye tera baap bhi yhi krta hoga teri family k sare male yhi krte honge wha ka Rona yha ro rhi h", "rrahulpanchaal": "Unfollowed !!! Pathetic", "luqman_hakeem_hak": "❤️❤️❤️❤️🔥", "an_aaravsen": "Chalo film nai toh kya bas headline banane se matlab hai unko", "abhi_zet": "Shame on you @reallyswara..whats happening in Bengal is that what new India you want?", "tushar_motiwale": "Ye ladki sleeperscells hai isko kashmir aur pachim bangal ke mudde nhi dikhte hai", "vishnutiwariofficial": "Aao kabhi Haveli par", "kuldyypbisht": "💩💩💩💩💩💩💩", "somewhere_under_the_cloud": "You are the biggest bitch 🤬🤬🤬🤬", "khushibarbie19": "🤮🤮🤮🤮🤮 Her post is just like her...yukishhhh 🤮🤮🤮🤮🤮", "kar0987moin": "I hope kanhaiya kumar fucks you well so that you dont need fingers....hhaah get a life dont get into polictics.. Left is nothing", "vivekkumar288": "Kya tune kanhaiya se competition laga rakha h? 😡", "muskaaansharmaaa": "Bro wtf calm your titties? Go get some new movie coz Modi is in power again and you bitches can do anything about it😂😂", "doll_e14": "Now where is your placard Swara Bhasker the hypocrite I am ashamed of myself #justice for our child #twinkle sharma Age 2 years raped and murdered by Mohammed jahed and aslam", "rituraj_dubey_": "This time we have won 303 and NDA 350 in 2024 it will be more than 450 just wait and watch minority is not going to be brainwashed by antinational like you 🙏", "j.escobar215": "She's marrying me 🤨", "p_a_n_k_u_u": "🖕🏼", "brijeshgupta629": "Kya boli madar chod Randi ki olad Muslim tare Maa ki chod tu gadar aatankwadi Sala chor Muslim madar chod Randi ki olad jab Kathua gang rape case mein bahut bolti thi teri maa chod Gayi mein", "shefali_baduni": "Another pseudo intellectual on the block 😂😂 @swatiseemashailendrabaduni", "vinaysingh007": "Kitne paise mile??🤣🤣", "me_arunjain": "@reallyswara Mercenary tents....🖕", "s.s.g.465": "Are madam, kathua gang rape pr khub boli thi, ab Twinkl Sharma PE aapk Shanti doot kom k baare me Kya vchaar h, ki jb pese mlte h tbhi bhokti ho @reallyswara", "_iamdev__": "Ye paagal aurat... Minorities ne aligarh me kya kiya tu chup kyun hai...bolti kyu nhi...ab kahegi dhrm se iska lena dena nhi.. @reallyswara", "mr_perfect14157": "Kashmir me kyo nai jati ye bolne ki hinduo ko bhaga kyo diya monirities hote hi...", "brave.man.becomes.hulk": "#justicefortwinklesharma", "jatinsingh_06": "@raghuvirsinh_jadeja604 @hindustan__zindabad @mai_hindu_jagane_aaya_hu @united_hindu @hindu_samrajya._ @Hindustani", "_marinerchoice_": "Now where is your stand about the aligarh child rape case hypocrite people", "be__shivvay": "Jobless thi Ab Tak shayad kanhaiya se job offer hue hai😂😂🔥", "sugandhsharma536": "Stupid jihadi", "devid_patel_14": "Or tum apna name change kr de burkha pehn le nhi to mullvi fatva nikale ga Tere khilaf 🤣😂😂🤣🤣", "mannu_dixit_": "Tu na sirf vibrator use kr extra charge me movie me gyaan na chode is topic pr", "ankitrai939": "Garbage people like you are dividing the country", "the_sketch_b00k": "Follow @theportal.in for political analysis", "ni_x_o_n": "Jha jha ye minotiry jada h wha hindu k sath krte h aisa thik h agr inhe minority hone se darr hota to itne ache se na rehte desh m itne salo se shrm kr tu maregi jldi", "_soovam_7x": "Na tu bollywood mein kuch kar payi, nahi politics mein 6-0 legendary record, betichod nikli thi Azadi lene...abhi thik hai Modi is a neutral leader 2024 ke liye ready ho jao, Yogi Aa raha hai AntiNational logon ka kaal", "rp3732246": "चुतिया", "nishu_pirate": "Please respect your PM. He is elected democratically. Do keep this in your small@mind", "arjunnpatil": "Terrorist swara ass#. Anti indian .", "agarwalprakhar140": "Hawww bechari swara bhaskar😂😂tumhe rote hue dekhkar kitna maza aata h😂😂", "mahesh_727": "Baag randi", "nahak_rahul4": "😘!🤔", "iamraaulverma": "Ma' am when did you graduated from JNU?", "zayngigi_fc": "Aunty aap please Pakistan ki citizenship le lo☺️", "nikisonab": "You are idiot all everyone can say! And clearly you get paid a lot by Congress party . Good luck", "rssingh007": "Tera kuchh nahi ho sakta...jitno ke sath gayi sab doob gaye.....bc suara bhaskar", "j_kanav": "Panauti😂😂", "mandalashoutin": "😂😂😂😂 stop pretending what isn't. How about posting about Kerala where Muslims cut hands of a Hindu who stopped them from forced conversion of minorities. Suck it @reallyswara", "gohelbhavya": "You as useless in politics as you are in bollywood 🕉️🇮🇳😂", "jaimin_ilu_43": "@reallyswara अबे bc तेरी औकात क्या है । पहले ये बता minorities की बात करती है । bc तू जिसे सपोर्ट कर रही थी उस सरकार की तो मा बेन हो गई । वो तो देखा है ना तूने । ओर हा तू जिस लाइन में काम कर रही है ना उस लाइन के 90 % स्टार मोदी को सपोर्ट कर रहे है । क्यों पता है । उन्हें खबर है कि मोदीजी ने इंडिया के लिए क्या क्या किया है । ठीक है । bc तू नेटफ्लिक्स से निकल कर पोर्नस्टार बनजा तुजे मज़ा आएगा नय 😡", "sd967": "Ohh miss flop actress we the people of india dont need you TUKRE TUKRE rajneeti inspired thought just go and work hard on your movies so that we can call you average actress which massive upgrade for you from flop dirty actress", "vasuudevv": "Haar gaye na.. abhi kya khujli hai😂", "chinmay__deshmukh": "@reallyswara , I am not opposing your ideology but I expect at least whatever you post it should not be baseless. Now your spine got chilled last time your vagina got shrink. I don't understand what's wrong with you. Please take my advice a move to Kerala and see how Hindus and Hindusim get humiliated over there. People like you and Mamta Banerjee is menence to Indian society.", "ankytrix": "🤣🤣🤣", "akashsharma9132": "@reallyswara please stop politics over modi.open Ur eyes and see.the change.hope one day u gonna support modi...", "vivek1792": "Putting hate everytime go get some life first", "r_a_h_u_l_ns": "Jbse iska deshdrohi lover haar gya hai tbse ye pagal ho gyi hai", "sharma_harish0007": "💩bhaskar", "sadhanasaikia": "Wash your brain 🙄", "its_saxena_07": "focus on your career", "anand77ashish": "You idiotic self over rated intellect...tell me one thing how is PM of a nation responsible for such alienated and stray incidents..??", "adityachadokar": "Skoda laura is better than @reallyswara 🤣🤣🤣🤣 lol", "zeba_rukhsar": "👏👏🙌🙌💕💕", "arjunshetty61": "Burnol lagaale", "theywish_": "India is the only country to not persecute jews, India is one of the oldest civilizations on the planet, HINDUISM ( Sanatana Dharma ) is the only (if you want to call it) religion to not do CRUSADES or JIHAD to forcefully convert the so called \"NON-BELIEVERS\", all the right wing and the RSS ideology suggests is that every person who believes that India has been the birthplace of Hinduism and that almost everyone had ancestors belonging to the sanatana dharma should make sure that foreign influence of concepts like christianity, islam and COMMUNISM should not diminish the culture, heritage and history of the land. Some people do tend to turn aggressive and target minorities and that is the \"BHATKA HUA YOUTH\" like your Kanhiaya Kumar who lost for CPI. Do you know communism has resulted in thousands and thousands of deaths? Next time you bring these topics up, bring hundreds of terrorist attacks in the name of jihad, Ghazwa-e-hind and of course, your sources of clearly liberal biased information into the picture", "partha2906": "You ******************", "ram_singh_kashyap": "Acting p dhyan do madam , kyaa cho#d faila rhi . @imbesharam lo ispe jaake kuch order krlo . Aag lgi h jyada .", "nitishkumarmeher": "Minority. Minority minority lol be indian first", "ashvikajaiswal": "Madam burnol lga le 🤣🤣", "rahul18_rt": "Kanhaiya Kumar k le le tu gaddar ...deshdrohi", "mr.tejas_mahajan_": "You are so secular that you call your DADDY AS BAGHDADDY😂😂", "_swegger_singh_": "Kasmeeri pandito, bangali hinduvo, keral k hinduvo, asaam k hinduvo k haal k bare me b kuch bolo mohtarna", "negi1101": "Hypocrite", "lawyer_lookbook20": "RIP @reallyswara ...", "raajdevsuthar999": "You are dhabba on our society,,,,,see both sides of the coin..... dont spread hate", "ansh1293": "You know what, if you don't have brain to understand or if you don't have eyes to see then you should just fuck up your mouth, if I'll get a chance so I'll slap right on your face, you fucking bitch", "aich.design": "Minority only in India???can u know Bangladesh and Pakistan present conditions of hindu and sikhs...search on google", "instaravi82": "randi", "i_aabhishek_": "@reallyswara according to you who should be the PM?", "_anurastic__": "@reallyswara it's not your fault !! Fucking hell!!", "_nobody.gives.a.fork_": "Seriously people like us and you who are unemployed will go against any party in power to get limelight😂 well done now we got a job of criticising others by doing exactly nothing for the nation. Just sitting in the couch having popcorns and posting such shit to manipulate others a d get the limelight😍 love your trick Swara di😉", "sandeep_dwivedi999": "@reallyswara same...#dhruvtyagi who murdrd by two muslims in delhi.....#kashmiripanit...#rape. sali kutiya muh band rkh....apna aur pakistan jaa", "duttaabhik": "As long as there is ALI in DIWALI and RAM in RAMAZAN . No one not even mis guided ( underworked actress like #reallyswara ) can undermine INDIA.", "abhinav.pande.146": "Mother Fucker Anti National Or Terrorist Definition of yours. And one thing Get out of my beautiful country bitch", "pgpankaj": "तुम जैसे चूतियों का सहारा है दोस्तों 😉", "couple_story69": "Jitne followers is mohtrama ke h Kai Bollywood movies Me kam krne ke bad bhi us se jyada followers ajkal tiktok stars ke hote h Aur ye inke muh pe thapped bhi h Aur inki aukat dikhane ke liye bahot h 😂😂😂😂", "kalpanachaudharyy": "Tumari bat ki koi value nhi h is desh m ok. India k log bahut samjhdar h tumari tarah mandbudhi nhi . So ye apni bakvas apne muh m andar rakho . Jab bhi bolti ho tatti kar deti ho", "shiva_badhwar": "Keep crying for another 5 years..🤣🤣", "ca_mayank_varshney": "😂😂😂😂 @reallyswara better luck next tym baby .... 2024 be like aayega to modi hi", "i_m_aagu": "🖕🏻", "thesimmirawat_as": "Dont tag our PM on your stupid posts in future. You do not deserve to take even his name. Public has shown you the way and the tukde tukde people you support. Be in your limits and we will not accept next time you insulting our PM. MIND IT", "pratik_kantode_5th": "You and Rahul Gandhi shares something.... You both are disappointment.... I hope people who are paying you for this.. Will deduct some amount from your salary....", "amitmalokar": "Chal zooti", "khodaldhaam_": "Abe nikl randi😂😂😂 teri owkat hame pata he sali nakshali🖕🖕 Kalank he tum jeme log. You are really Very very very ugly🖕", "realtypreneur17": "Low class cheap women you are @reallyswara it's sad that people like you are still there in India", "risharashid": "You are a true Indian! @reallyswara ...all those people who are abusing you for your post, are jobless, they are only here to take out their frustrations. Because you are showing them aaina...ignore brainless people! India was a secular country but not anymore Kyu ki hamare desh mein aise aise logon ki bheed ho gai hai jinki Soch gatar se bhi gandi hai! I know some idiots will read my comment and start abusing me but I don’t give a damn...I love you for always standing for truth♥️", "zina0306": "National panauti🤣😂", "deependrasinghrathore_karwasar": "😂😂@reallyswara such a theli u r. When mamta do something wrong with common people u never say any thing against her becoz didi 😂jail me dalwa degi. Modi gov or modi ji ko ghanta hi frk nhi pdta tum jeso se. Wo ek kahawat to suni hogi. Kutto kaam h bhokne ka. Sher ko ghanta hi frk nhi pdta .. open ur eyes. Don't target one person. Kuch bhi glt huaa sidha BJP or Modi ko target krne leg jaati ho. Kya tum logo ki koi chal ho ya dusri party ki. Kyuki L to tum logo ke Modi ki jeet baad leg gye 😂😂ab bhokne ka kaam krte raho", "sabirk0190": "कश्मीरी पंडित के बारे में भी बोल लेती झगड़ा करवाने pr तुली है प्रोपेगैंडा वाली 😢 ऐसे लोगो के कारण ही खाई बनती है", "rishi.r1312": "She has managed to get her ration home by fuelling such misconstrued notions about the government. Look at what happened to Kanhaiya. She will have a similar fate in Bollywood.", "ravi_jaiswal1998": "Tera baap terrorist ho Sakta hai pr Hindu nahi bkl", "yuvrajsinh_b": "#orgasminequality after seeing ur hashtag i am thinking - kya apki ma 70% me ati he ? I mean u must concern your father to give your mum equal pleasure !!!!! Plz apni ma se puchiye ki sambhog karte samay unko santusti milti he ya nai milti !!!!!!!!! @reallyswara", "shivani_hindu": "Halala kro didi kaaa 💣💣", "shubham.k.sain": "Tumhare jaisa dogla aur tucch vyakti shayad hi iss duniya mein ho swara bhaskar", "arpita_seth_": "You are a shit head person... No respect for u .. Do u have any idea what has happened to hindu minorities in pakisthan ... Batameez aurat .. muh jab bhi kholti hai toh gandh hi nikalta hai", "anurag.chaubey": "Attention seeker. 🤣🤣", "kash_kapil": "Just like you are supporting women empowerment with#ApnaHathJaganNath @reallyswara 😂", "richyics": "Tujhe jyda pdi hai.minorities ki to jaa k choot de sab mullon ko", "stan_lee_thomas_": "@reallyswara 👍 the most saddest part is media is also not doing their job . Hell with BJP , Congress and all party . If media you tell the truth , the messenger is not providing the truth what can we do.", "the_snobs_journal_": "Tu tatti h behan ki laudi", "anshudeep_11_23_17": "What rubbish", "_amyrodriguez_": "Hate VIOLENCE hate MODI", "saptarshiroy0231": "Peace.....the comments here gives me Soo much satisfaction....namo namo", "aakaash.rawat": "Ridiculous , u must check the fact .. u dambo", "pratap.official": "Unfollw her guys🙄🙄", "natashasingh____": "The RSS had about 600.000 disciplined, highly trained cadres it can deploy. The others have almost none. This time around the BJP had 20 TIMES MORE MONEY THAN ALL OFF THEM PUT TOGETHER. Next time that will become probably 50 times more money. And, certainly, elections in india are more and more about money, about spectacle, about controlling the mainstream media and social media. Every institutionin this country was bent to their will, including the Election Commission and, who knows, perhaps the election voting machines. That money bought them tens of thousands of IT experts, data analysts, social media activists who ran thousands of Whatsapp groups with carefully directed propaganda -- tailored and tweaked for every section, religion, caste and class, every voting booth in every constituency. That kind of money can sell anything it decides to sell -- in this case a product so toxic that it created an epidemic. Not a single thing of importance, not climate change, not health, not education was a part of the campaign. Nothing except toxic, medieval stupidity on an epic scale. HOW CAN WE TREAT THIS AS A FAIR ELECTION?? It was a race between a Ferrari and few bicycles -- the media cheered the Ferrari as though they hadnot noticed anything unusual. And now lathers it with praise while it mocks the bicycles for their poor performance. Yes. Let that sink in. Think about it.", "raconteur_dip": "Other parties lost because they got lesser votes..so what does that mean?? U may not get it but so let me make you understsnd that it means majority of the peoplr voted for the winning party...n u think u are better and smarter than msjority of the people in india??????", "baaghi498": "Plzz go to Pakistan ... Wha bht mil jynge tuje Apne jaise ❤️", "r.adityasingh": "Libranduo ko smjh nhi ayega kbhi bhi inhe inke Hal p hi chorr do jitne logo k liye compaigning ki sbke sb hare hai .... Desh ki janta n pm ko vote dekr jitaya h wo sb galat h kewal ye shi hai .. Desperate women 💩", "kalpesharma": "🖕", "pragyamishraa": "@aakritee_gambhir all this woman needs is attention. That's it! Koi toh mujhe troll kro then mae apna pseudo feminist ka jhanda utha k nikal jaau Twitter pae 🤣🤣🤣", "jinping.shb": "Teri amma ki ***** gyan hai terko ma ki lbd* hinduo ke sath kaisa behave hota hai muslim majority me maa ki la*di.", "biswalshubh": "U can never be a good person......", "gauravpatni": "Aukaat me rehh", "chaitanyaofficial2611": "Big fan of u.. Swara.. Bold lady", "iamsarfarazali23": "❤️👏", "sagi_always": "Modiji becomes PM hua toh hua now deal with it 😂😂😂", "vishalj": "Madam ji 🔥🔥🔥🔥", "shapath_09": "leave this dirty country babe...europe is waiting for u", "sony.singh110815": "Losers.... THE answer is Modi's resounding victory...He is back with a bang...", "sumukh_hr": "Just unfollow her lol.", "singhniv": "She just want to get trolled", "niketshah83": "@reallyswara .. r u sick? Mentally ill?", "palakshah9000": "You are third class person swara", "realbasant": "Inka propoganda ghanta bhi poora nahi hoyega.", "ashutosh.gairola88": "#heightsofnegativity", "prabunty": "Showing this image is mischievous on your part, Swara. Is the PM personally involved in vigilantism ? People need to sensitize, thats required. Buy one cannot stop cow vigilantism, it is not related to hatred towards Muslims, it is related to domestic cows being stolen.", "rahul_soliwal": "They can do anything for publicity", "blueseamotion": "Swara ko bhi thoko", "b.a.w.a.a.l.x2": "What do ya say about the Hindus getting evacuated from their own home in West Bengal by the peaceful community", "deejags": "Hahaha ... you’re such a loser Swara Bhasker", "sunnychopra100": "Modi jeet gya toh q gand jal rhi h", "nitinlal2008": "वाह , वैसे आप जैसे लोगो से यही उम्मेद की जा सकती है जो चंद पैसे के लिये पकिस्तान जा कर उन्के गुन गान कर सके ।आप जैसे लोग कभी सही रस्ते मे नही चओ सक्ते और ना किसी को सही रस्ता दिखा सकते है क्युकी आपको glamour के लिये कुच भी करना होता है। आपको पर्दे पे शरम नही आती अलग बात है पर आपकी आत्मा को भी शर्म नही आती जब देश के लिये जहर उगल्ते हो।", "placid_mortal": "When u don't know reality of our country then please shut mouth... Your Kanhaiya Kumar already slapped and f***ed on 23 may by the ppl of INDIA.. we do not want ppl like you and your whomever that a** h*** kanhaiya Kumar.. and don't you guy's have guts to respect Indian ppl's verdict?? LISTEN.. ppl of INDIA have gave their decision..so respect them and shut the f***up.. P.S. - I do not want to use bad words but some people never understand the reality and are always talk non relevant so this is only way I know to make them understand. My sincere apologies for those bad words..🤘🤘🤘", "____siddhant______": "Jis constitution ki duhai ye leftist dete hai usi ke hisab se police aur law & order are \"state subjects\". So it's a failure of kamalnath and Congress govt. Pata nahi kyu swara Modi ki Nazar me apni existance prove krne ki koshish me rahti hai. Are bhai nahi puch rahe wo tumhe", "amritashukla_001": "That's the reason i unfollowed you.. #shitposter.", "ansh_sharma_17": "Swara g apni aukaat se bahar mat aao....fingering krne ki aukaat hai tumhari.....fingering hi karo....aur haan tumhare jaise log hindustan ki dharti pe bhoj hai....ya to sudhar jao ya to hindustan se dafa ho jao....desh drohi log", "himanshu.prashu": "Tere paas to paise bhi nhi honge Desh choodne ke liye bhai log chanda kro or isko paise do coz ye uncomfortable feel kr rhi hogi india m afzal ki gang ki h ye to", "dhakadinesh312": "Please justify your picture mam!!!", "bharatcharan5": "Shut up prime minister have won from huge margin OK shut your mouth ...", "sudarshanbirla8": "Yar ye sab JNU wale chahte kya hai. Pura Bharat ek taraf aur ye log ek taraf 😂", "gopalrautaray": "#UrbanNaxals😉", "vatsabhay7": "Minorities 20 % of the Indian population is to be called minorities if Yes then u have to go school again to know the mining of the word in Pakistan our people population is 1.8 % that is called minorities.", "abhi__pandey26": "She is broke as........so now if she will not post anything everyone will say something and taunt her so .....to cover that ....from somewhere she got this with the help of her youth leader kanhaiya 😂😂😂😂😂😂", "alpesh_143_": "Kabhi Kabhi esa lgta hai Narendra Modi hi bhagwan hai...😂😂", "srivastavaavani": "Its ok to have ur own point of view.. and it could seem so ryt to u too.. but hows it possible that only a handful of fellas who think they are the mastermind of India are noticing the same against our honourable prime minister and 125 cr people are being biased... Its ok to accept ur mistaje than to defending it with this kinda stuff.. u are only harming ur image and the one who wanted to shatter India into pieces is the o e u rely on . Think again... Kanhaiya kumar such a shame to the nation", "yamini_bansal": "Criticism is necessary and welcome step in democracy..but we really need to differentiate between filthy allegations and healthy criticism 🙏", "srinivas.bose": "Its creepy post.. prominent virtuous Swara ...This strain advertisement doesn't match up with talent like you.", "avinash5702": "स्वरा भास्कर ने किया था jin कैंडिडेट्स के लिए प्रचार, कन्हैया से दिग्विजय सिंह तक सबको मिली हार- #May23WithTimesNow", "rishav_sin30": "@ashwinvpai @gautam.sehwag @samarth.shenoy @atulhm30", "gautam.goti": "Do you know how many minorities we have in India?", "duttboy07": "Modi to aa gaya Jai Shri Ram 🙏", "sanfiya_778": "People from IT cell of BJP left the chat", "i_m_talib": "Sad..😓", "not_good_eventhough_i_": "That's proven fake didi ... Go back to your vibrator 😂", "parasvig": "I guess somebody is jealous of not getting love and publicity like modi 😅", "anu0590": "Bakwaas actress, bakwass gang supporter..", "imtiazansari14": "Another chutiya spotted🤣😂", "im_raijada": "Are yrr u r sureLy a goNe caSe aiSe haRne j bad bhi BC Ni sudhri ho", "vivekmohite23": "Arey lavdi itna parishani hai na toh nikal le pakistan shakal toh tatti jaise hai khudki toh jhaat bhar ki aaukad nai or desh k PM ko bolti hai 🖕", "dreamzunlimited17": "7lakh kashmiri pandits thrown out of kashmir. Hundreds of them killed in the name of religion and jihad. Swara have u seen or met them in ur life. If you are really a champion of minorty cause go and raise their issue bcoz they were a minorty in kashmir", "narayan24pathak": "Don't try to disturb peace of India .... Kindly vist China and Pakistan ....", "falcon_vd": "Main Congress ka hu par ye galat salat post karke logo Ko Gumrah mat karo", "wahadkhurshid7203": "Hahahahaha🤒", "banguuuu987": "Plz don't say rubbish things dear Mam 😂! 70-80% likes Modiji and BJP and now plz don't make us against u😂! Anyway politics all ain't meant for u, so better try to get movies and live ❤️😂", "vikram.paliwal": "Mam what's your view on mamta (CM of Bengal) and other state like kashmir and kerala. Stop your rubbish thinking Ohk and don't comment on our pm", "saxenanikita1111": "@reallyswara you might be blind by not blaming state govt for controlling this incident .why always Modi jee you r good actor I love your acting but this is not done", "piyali_halder12": "Kuchh faida nehi hua kiuki minorities ko bhi pata hain kaun dogle hain ... isiliye modi wapas aaya samjhi", "g.shetye": "Where were u when Kashimiri Pandits were killed and thrown out of Kashmir?", "dhul_p": "Well this is what expected from and you delivered as usual... I pity your low life!!! Shame on you", "shreya_awasthi22": "Ye log apne ghar pe Baith k, kanhaiya Kumar jaise logon ko support kr K aisi baaten bolte hain😂😂😂lol", "wazedah": "That's so true !", "hitesh.py": "Don't fall for this kind of traps as well said to Gambhir by Anupamji", "anshu.goyal.21": "Ur this post compelling me to unfollow u...and hated u....u uneducated n cheap actress...🤬🤬", "ultimatebong": "@reallyswara visit West Bengal... U'll experience opposite picture", "anato_boomm": "Difference between the the numbers of LIKES and COMMENTS also means something.", "shivamverma8013": "Mujhe samajh nhi aata ki deshdrohiyo k liye bhasan dene wale bharoshe ki baat kr kaise lete aaplogo me saram nhi hy ya aam janta ko aap bebkoof samjhti hy khair samjho tmhari is samjhdari ko janta 2019 ki tarah hi jawab degi😘", "deadpool9657": "Crime against muslims is done by hindu terrorists and crime against hindus is done by jobless and innocent youth. (This is what their agenda is).", "raviparashar123": "Kuch kaaam nahi hai KYa", "flying_pari": "#reallyswara you are such a sensible, bold actress and also role model for so many people , I do know that this is free country but what’s wrong with your senses .??not supporting Modiji, Fine but supporting #kanaiyakumar Not good,!! And last but not least what is Minority ? Who is minor ?? This thinking needs to end .Now India doesn’t need any cast system ..upgrade your thinking and then support right people ..👏👏👏", "sanjeev9534": "Randi saali teri aukad hi kya modi pr sawal uthane kaa,,, mat bhool tu ek B grade Randi Actress hai....n jaane kitno se chudwaai hai..samjhi n....is trh politics .me mt padh..agr zyda shaukh he to chunnav laar okkkk....#BC", "malan_19_99": "F***ing bit*h", "lunawat_shital": "@reallyswara 1989 में करीब 5 लाख काश्मिरी जब भगाये गये तो वो शांतीप्रक्रिया के तहत वहासे भगाये गये थे क्या??", "yogideshmukh111": "madam have burnol", "its_cricketwala": "Jhaantu actress of Bollywood , Bollywood mai koi bhaav nhi de rha to yha aagyi bakchodi krne , madam cool lagne k liye bakchodi mat karo kuch krke bhi dikhao", "786gobinda": "जब Kashmir मे हिंदू को मारा गया था", "filmibiz": "@reallyswara mam, sorry unfollowing you because you don't have an agenda to spread love, peace and brotherhood rather you always talk like an extremist political leader who believes in spreading hatred all the time.. You just pick one sided an incident & start bringing stress with such negative posts..let me tell you I don't belong to any political party.. I am neither hindu nor Muslim.. I am an human, an Indian who believes you as a celebrity has responsibility to bring love, peace, respect upfront rather such shitty cheaply things which distract others even from the right path. Hope this message reaches you in positive manner.", "entertainmentforrajesh": "You really need to learn to be a better loser! To accept you lost", "sonu.tingling_design": "Can you shut ur mouth lady.. Apni filmo pe dhyan do.. Negtivrty mat failao", "shashankt523": "Kuch Dhruv Tyagi k liye b post kr deti . Vo apni beti ko bacha rha tha...", "prashaant123in": "Agree with her", "maddy_20z": "Dear swara ,. Pls post any picture of related to kasmire pandit .", "sreyasenguptadas": "Why you try to get attention which such negative remarks. I really liked your acting skills and followed you...but I think I must unfollow you. Think before using negative remarks towards anyone.", "saurav._sharma": "Last month a hindu father died saving his daughter by muslims where were u at that time. #hindu #terrorism slow claps for ur thinking. Why u target only hindus bitch", "avijit_mazumder": "@reallyswara if you want to be really impartial, practical, empathical and considerate kindly go and rub your love on every people who has been a victim of religious violence..irrepective of faith. Go and protect every girl, daughter and wife who lives under constant threat of religious hediousness .. go and teach some men with skull caps that wearing a bikini is your choice and not his lookout.If you can do this we will make you our idol.", "rrs_sareita": "How shameless you are... Your darling kanhaiya has lost badly. Keep away from him and pay attention to ur sinking career. Taking about narendra modi...What you know by the way about India and it's people", "bhargav.singh": "Hai hai Mirchi...", "i_akash_toppo": "With you always.. it’ll take time for them to understand", "rohanpsingh": "Abe sharm kar itti gandi haar hari hai fir bhi post kr ri hai aur kli hota to chullu bhar pani mai doob marta @reallyswara", "dil_bole_cricket": "Ye vo log h jo muslim ladki ka rape mandir m hota h to slogans le k aa jaate h...I'm Hindustan...I'm ashamed..rape in Devi Stan...n jb kch tym phle masjid m Hindu ldki ka rape hota h...TB Aisa koi placket nhi le k aate...I'm Hindustan,I'm ashamed,rape in allahstan....THIS IS THE DOUBLE STANDARD OF THESE SHIT PEOPLE...I mean seriously kissi k against koi crime hota h to use aise log hindu Muslim se kyu jod dete h...vo phle Indian h,Insaan h kissi k against bhi ho vo ek crime h to religion kyu beech laate h...shame on you🙄🙄", "rajkamal_supertramp": "Shocking!!! Our country has 99% fools innocent andhbhakti vaale.. people who are point her... Look at our f***g past 5yrs and coming 5yrs... Bollywood vaale politics Mai nahi hai kya??? This is f***g true mr Modi bhakths our govt failed to gain faith of minorities in past 5yrs!!! Over 150muslims got killed in the hands of gaurakshaks", "mylifeasmukeshprajapathi": "Failed Bollywood career and the failed political team 😜✌", "gopaljain1472018": "कन्हैया कुमार की शुभचिंतक जो टुकडे टुकडे गैंग के साथ है!", "shubhayusaha2003": "Listen leftists are endangered political species in india so you better keep quie😂😂😂", "amohan57": "I don't want to comment on the picture as it is absurd but I want to say that These people will never put Muslim and terror in their hashtags as at that time they say terrorism has no religion. But they will put hindu with terrorism. Hindus are the most tolerant people and people like swara bhaskar and etc takes full benefit of that by attacking the religion.", "ekugupta": "Miss Swara Bhaskar, what do you have to about the violence of TMC party people on the BJP people in West Bengal? 2 days back, 2 bombs were thrown on the people in front of TMC office, seriously injuring 6 people, who were taking out Vijay rally in West Bengal. Before the elections, every week there was at least 6-8 people of bjp who were being killed.. were you both blind and deaf at that time or busy in your glamorous world.. when in the government of SP in UP, the Hindus we're forcefully thrown out of their own home, they molested the Hindu girls so that the Hindu families could leave their home and exit Kairana.. none of you came with this religion and violence shit! And today you are talking about violence and minorities.. you got one person and you started talking shit about him but before talking shit about him look around yourself first..", "mr__k__d": "Poi chaavu", "ayushi.4212": "Hv really liked u but ur choice of doing dis is really so disappointing...Hope u undrstnd soon how better our PM is den odrs @narendramodi", "viraj9024": "GARBAGE", "jyotimishra13": "Lots of negative comments @reallyswara u r better to be actress", "neha__rana25": "I think u should respect the prime minister and his statements . He has won with clear majority. India has chosen him . Respect him . Respect India . Respect democracy.", "bakait.parinde": "Pata hai na aand ka na gaand ka, gyaan chodenge poore brahmaand ka 😂😂", "flirt.hu": "People be aware aise log sirf tumhare emotions ke sath khelna chahte hai..inhe desh ke tukde hote dekhna hai pata nhi kya ganda motive chipa hai iske piche inka...so apne apne dimaag se kaam lo or aisi gandgi felane vaalo ko sahi jwaab do", "thakur6376": "This is done by opposition parties and people like you who wants to damage the repotation of Pm Modi and country.", "parekhmunaf": "You are really good swara", "vatsal_rahul": "It doesn't matter how you win in politics , it's only about Winning and some of the people who are not in politics be like aaj insta me kya post kare aisa soch ke time pass krte h , if you really want to change , come join it , fight the elections ,it doesn't matter Modi win or Rahul wins but they fight and they have a huge fan base and a team behind them", "milanpatel4531": "Pakistani", "david.clearwater888": "I really want @reallyswara to keep campaigning for congress as all the 6 people you campaigned for lost. 😂", "anasqureshi011999": "U are right", "priyanshuuu.21": "Jalli na😂", "ajay_paul1": "One more so called FAKE Secular after failing in Bollywood industry... Try to focus on your fail career instead of messing with our PM 😁😂 You are nothing madam infront of our PM Modi.", "roysoumi": "You are either selectively blind or just stupid", "kiranroy18": "@reallyswara having an opinion is good but having a biased one is really poor of a mindset. Do you know the is states calles Kerala n West bengal?", "afrozarif": "Jab bhakto ke hath me katora a jayega tab sudhrenge", "one_higher_than_ur_dreams": "Good going girl..More power to uh.Let the Dogs barks😁keep going❤️", "supratimmaity1234": "Go to hell...😊😊😊", "harishpaul04": "Aayega to modi hi....😂😂😂", "johny_krishna": "चूतिया थी और रहेगी", "majid.hussain.581187": "You are rally great thats why u _reallyswara", "prajwal9_sabane": "@reallyswara What's actually wrong with u?", "im_prashanttiwari": "Just simply unfollow this nonsense actress..@reallyswara", "rishi_b_theofficial": "Didi the more you campaign the more seats you people will lose. Why are you not understanding that.", "raks_k.s.n.m.k": "Let me ask u a question.. U are attributing Hindus to terrorism..so do u agree that terrorism is linked with religion..if yes than I think u are aware of other kind of religions linked to terrorism..in which people are getting brainwashed and influenced..and then recruited..and then using them as pawns for their meaning less missions..why aren’t u talking about that issue?? Note:: I don’t attribute religion to terrorism..I am asking this only coz u are doing that..no minority no majority..here there are only Indians..don’t divide them.", "sathishvkamath": "😂😂😂 apply burnol 😜😜😜😜", "theabhirajgiri_official": "tmhra bazar saf hai.... bollywood ki nachaniya kutiya sali....deshdrohi", "swapnil_sonawane48": "Really true swara mam", "missing_report": "Hey swara u know one thing that u are to bias.....I think u have seen in West Bengal the people are not allowed to say JAI SHRI RAM why because it hurt the sentiment of minorities...I m from West Bengal and I our district we are not allowed to celebrate Durga puja...y is that so...we Hindu are in miniotities..say something for us also if u really care for miniotities...plez help us swara.", "vishal15k": "It's high time to unfollow you. Bitch", "manas_rastogi_1": "Bollywood mai to kabhi kaam dhanda mila nahi flop struggling actress bankar reh gayi to ab ye sab chutiyapanti kar ke apna time bita rahi hai aur future mai iske sahare rozi roti kamane ka soch rahi haii😂😂", "srushtii1205": "Ye gawar ghatiya behuda auntyyyy ko koi burnol bhijwao yaaar😂😂😂😂😂😂😂😂😂😂 @reallyswara ghatiya aurat", "mayur.mawale_official": "Kuch din Kerala , Jammu Kashmir Aur Bengal Mai Rah kr dekh fir tujhe apne aap hi RSS se Pyaar hone lagega... SHAME ON U...Jab Bengal Me Itna Sab ho raha tha tab kaha tha tera kanhaiya ,ravish kumar...😠😠", "din_azad": "कुत्तों को घी हज़म नही होता!", "maulik_panchal22": "Are @reallyswara dig more may be u found it modi self in cartoon.. dw u and your anti Indian boy Mr khaniya have plenty time I don't know like 5 years 😂😂😂", "iammanorag": "@reallyswara Mind your own Business!! Politics is not for you, Better focus on your Work and Life!! Don't get into these kind of stuff!! You are writing all this because of Freedom of Speech is there!! If you would have written against the People's you are supporting, You would have been behind the Bars Straight Away!! KEEP THAT IN MIND!!", "nigam_saab97": "Just like the way swara tries to show nationalism😂😂👍", "i_amgolu": "@reallyswara Thora padh likh Liya hota to Congress ke saath na hoti", "kiranchavda83": "अभी 5 साल आप जलते रहो ,तब तक और साइड रोल करते रहो ,और हा 5 साल बाद भी कोई उम्मीद मत रखना और बाद में शायद आप को माँ का रोल तो मिल ही जाईंगा, और हा आप को और कमाई करनी पड़ेंगी तभी तो आप बच्चे कन्हिया कुमार ,और सैलजा ब,जिग्नेश को पढ़ा पाएंगी अब ये सरकार पर तो आप मुफ्त की आशा मत रखना ,अन्तः जलने वाले तेरा मुँह काला", "7376.singh": "Poison lady", "kulsum236": "You are not actress you are Real heroin", "suneil_kumar_singh": "😂😂😂😂Radar", "mdsameer1884": "बाबा रामदेव = 4 भाई बहन नरेंद्र मोदी = 7 भाई बहन योगी आदित्यनाथ = 6 भाई बहन आडवाणी = 8 भाई बहन तोगड़िया = 9 भाई बहन लेकिन कानिये और इन चड्डीधारी संघियो को दिक्कत मुस्लिम से है 🤣😂", "shobhit.mittal2510": "Rahul Gandhi ka kuch asa hai pyar. Ki aj lgo ko marva rha paa kae amethi sae haar", "teekesh_kumar": "Its very easy to blame to other person, khud kyon nahi jimmedari leti aur jaa k waha ki police ko aade haath leti?? Kyon nahi sabhi doshiyon ko jail me dalwa k kadi saza ki mang karti?? But nahi hame to blame blame khelna hai.. 😒 ek time tha you were my one of the fav. Actress but now i dont know. 😒", "deepamk375": "@reallyswara Being a leftist is good but creating a false propaganda on social media seems annoying.", "ikuunal": "This is how people get attention on social media bcz they not getting any work✌️😂", "aakash.varma1": "Swara ji apko na bs focus chahiyeee.... Nothing else...", "saanjayeg": "Your narrative has been discarded by people if India .Time to shift your paradigm", "shrinidhi21athlete": "Ghumaoo Sir Ghumaao😂", "im_ankitvish": "Jin jin logo ka promotion kiya saare ke saare har gaye 😂🤣😂 @reallyswara librals fail ho gaye so sad yrrr swara😂😂😂😂😂😂😂😂😂😂😂😂😂", "ruksarparwani": "Pain #SHAME really sad", "gani_gnaneshwar": "@reallyswara I totally agree wat dey have done is wrong n nobody has right to manhandle someone, but y not Ur voice won't rise wen dis happen in West Bengal, few days back a Hindu boy got killed in Karnataka, dat u can't see hu...??", "yashibiyani1980": "These incidents are happening because unemployment rate is very high in our country", "binusudhakaran": "Wow! And where was your voice when Hindus were beaten up by minorities?? Unbelievable level of stooping low to get attention!!", "connect2nitish": "You are an opportunist bloody bitch, just go and masturbate only.", "k_k_patel1804": "Better way u have to married Pakistani citizen and gettingl lots of trust.", "naveedchauhan58": "🙌🙌", "udaysingh5894": "Tere pash or ab kuch kam to he nahi tera yaar knaya to bahut buri tarah se hara he tu sali randi kahi ki", "paattiidaar.raahul": "मथुरा में जो हुआ वह क्या था उसके बारे में भी कुछ लिखो।", "beinginstagrv": "Chal jhooti", "karkera7557": "Such a shame u r a Hindu", "valourand_justice": "Hua to hua", "mohsin.sheikh1288": "Just tell something about kashmiri pandit", "sanchubaba": "Please write something about mass killing of Anandamari Monks near Brijan Sethu in WB by Cpim gov ...dont b pseudo liberals and intellect ....i know u r JNU passout dont let me go into its skin .", "aarfsheen": "Well said dii", "im.sahussain": "ye sb namardon ka kaam hai.... isse zyada kuch nhi", "maheshwary77": "@reallyswara - Why don't you contest election and settle this once for all. You will also see if people's support is with you or not.", "pawan.jani": "Everyone unfollow this lady who has lost her mind", "tanwardeep": "Mam phle Puri baat jaankr bola kijiye... Jo pita h uske against phle bhi beef k case ho chuke h and jisne pita h uske agenst bhi case h toh m moral of the story ye h ki he bhagwa phnne wala nationalist nhi hota and MINORITIES m he koi sirf victim nhi hota... In SB se aankh htakr wrong and right and facts dekho @reallyswara", "hiimbhaveshpatel": "Just look at yourself first.... then come to talk about narendra Modi.... I don’t understand why you didn’t see good things happened just because of narendra Modi... every time you thinking like owaisi... you just spreading hate between Muslim and Hindus... even both don’t care what you said... so just shut your mouth and don’t try to make big gap between all casts... they all love each other... they all love our prime minister... they love his work... so just put your shutter down of your store...no one gonna come to support you.... By Indian... (no muslin no hindu)", "pandey_ji_ki_beti": "Unfollowed🌷", "rampamrom": "I respet her even more now", "rima_bagchi": "So jao behen jyada ganja fuk liya apne🙌👏😂", "mannu.choudhary24": "Apni Aukat m raho.. Don't talk shit about our Respective.. PM \"Modi Ji..Do respect & Live peacefully in India. Jo kam h na apna vo kro.. Fokat ki bakchodi na kro varna Jamin pr ane m time nhi Lagega.. Public bithati b h Sar pr.. Aur girati b h Jamin par so be careful when you talk about \"PM Modi Ji \" Jai Hind 🇮🇳", "beingmyself_beingvijesh": "It's useless to post ethical and sensible things here. People of our country are just too blind and useless to see what actually is the true state of our nation.", "rajji90": "Since every other comment is insane and some pretty disgusting, I hope you’re not reading this nonsense. But if you are, you go girl. As a Sikh Punjabi, I see you. 👏🏽👏🏽👏🏽", "armanrahil777": "I salute #reallyswara for your support", "pratiek09_": "@reallyswara jab kuch pta nhi ho toh bolna nhi chahiye... bollywood me 2 taaake ke item numbers krne ki aukat h vhi kar...zyda gyan mt chod... idiot", "meenaljain1_": "Sab itne bade bade stars h kisi k paas dimag ni h bhagwan... Sabko problem h solution kisi k paas ghantaaa ni h 😂😂", "mohit.kumar2192": "@reallyswara abe oh bewkoof Aunty tujhe ab tak samajh nhi aaya ki , tujhe koi dekhna aur sunna nhi chata kyunki tu bahut badi LOSER ho Aunty.", "jay.xv_": "U look better while fingering in movie...bt don't do this in social media it's no more interesting here!", "roops_shaikh94": "Yes", "rddesai0562": "Go away with your fake emotions", "sahamouli3": "U don't get work u know y cz of these reasons...u dumb", "deshnamohadeo": "Get to know the difference of patriotism VS nationalism @reallyswara ...u are just being biased..and making a ridicule of yourself....this post leaves no doubt that you are actually one who is spreading violence and hatred and negativity through the social media..u may have your political opinion...but that doesn't mean you have to infringe others opinion...you are actually violating people's human right. You, being an aspiration for thousands of people out there must be thinking of perhaps unfollowing you because you simply have no respect for people who have voted and exercised their voting rights in a democratic manner!", "ninadkofficial": "Your profile name should be “Not Really Swara”", "bleed_olivegreen": "@reallyswara you have that much problem with Hinduism then why don't you just leave our religion & give yourself a new name like.. \"Fingering\"", "priyanka.manghnani22": "You are Ms. Stupid and i hope you know this 😆", "swetashaw_1": "Aandhi Kanhaiya bhakt", "aakanksha_nd": "🙄swara move on please", "petkatie": "yess", "nirdeshshar": "😂😂😂😂😂😂😂😂😂.5 sal Tak ase hi post karte raho plzzz", "veer_bd007": "How biased you have become! Swara jee iss level ka extremism achha nai hai jee ..AAP chahe kisiko support karo Lekin AAP andhi ho chuki hai ..ye sab agar nai Samajh me aata toh you have a beautiful career ..focus on that", "tanwersunny": "Please b updated bcoz news is dramaticly change the Muslim boy found liar according to video footage.. So Wat u share b think first may b it's make a reason of big controversy... U r public fame don't spoil to do such type of things.. Without evidence u blame a whole community. I know its ur style to take fake publicity, get free chance come in news.. U r country representers I request to u.. B Indian nd always b the same... Do politics but on correct issues which I never heard from u.. May b u avoid my msg.. But don't create ur personal issue as a public issue...", "ajay.sameer": "Gautam Gambhir is a gem of a person. You are supporting a political actor Arvind kejeriwal. People has chosen Modi because there is no better option available. Trust in mandate, it will be a good experience in next 5 year.", "_._i.n.s.a.n.e_": "Way hoy sakshi soni", "saxena_vivek31": "Where were you and your left liberal gang members when a father and his son were killed protecting her daughter from a muslim family in delhi, why don't you raised your voice then, just because they were not minorities, don't be biased, if you are trying to be a social worker then speak for all indians not just for a particular religion. Jai hind🙏", "manish_manola9": "Ye bechari kare bhi Kya Bollywood Mai toh flop hai ye or ab politcs mai comment karke thoda lime light Mai aana chahti hai", "its_anmol_kaushik": "Madam ji....mathura m MUSLIM YOUTH NE EK LASSI WALE KO LASSI KA PAISA MAANGNE PR JAAN SE MAAR DIA...VO NHI DEKHTA AAPKO...YEH DOUBLE STANDARDS KAHA SE LAATE HO AAP...", "13lycans": "The mejority of people from several castes and religions are idiots and only you are smart🖕🏻", "akankshasingh2804": "Stop playing this minority card... People are nowadays fedup of this and ... we voters are not fool... We can understand who is right and wrong for us.", "jayvir166": "Lwara na tum bollywood me ghanta kuch kar payi finger use krne k siva na tum politics me kuch ukhad saki bakchodi ke sivay to ab aapko apni aukat pata chal jani chahiye 😂", "reemaind": "pls dnt let this negative people let u down", "aki_akas": "Acting toh hota nahi suno tum log ka bahut jald dukan band hone walahai", "nikarshveer_rajput": "Sad", "sawai_raaga": "Complete bullshit", "___kiiitttyyy.__": "@reallyswara tera baap na ya bola ki BJP na Kiya hai karka ya toh kanhaiya Kumar be ho saktha hai jo ya BJP ka Nam kharab karna ka liya kar reha ho bhen ki lodi", "kamaleshchary": "twitter katham abh instagram pe agaye tu", "garvit3656": "किसी लायक नहीं है ये", "leenatjabbar": "21718 likes are not a joke. People knows.", "harshul.09": "This is shit from coming from u!!!", "erabhinavchugh": "Just because you are a celebrity and you have a followers .. Doesn’t give you the right to Link the PM of your Nation with hashtag Terrorism hashtag Violence... Bhagat Singh ... ChanderShekar Azad ... They were also extremists.. So you want to say they were also terrorists and threat to nation?? They caused violence?? I don’t challenge your right to freedom of expression.... But there has to be a limit... He is the PM of the Country .. Atleast Respect the Nation and it’s Choice ... !!! You are part of that Nation only ... By disrespecting The PM of the Nation ... You are Disrespecting the People of this Nation ... !!!", "pradnyagargi": "@reallyswara I was following you cause I thought you are a good... But from few days after seeing your post I really feel that how can be my choice so worst... You are from those people who want to sale our country and hence you are following those people who are against nationalism...", "iamrahulakash": "Bullshit", "themilleniumbitch_": "Aap Hi Leke Ate Abhinandan Ko", "sawanttush84": "@ajinkya.kaduskar see comments🤣", "mukeshchaudhary2000": "N no party will take your kind of idiots", "ankit_hardiya21": "Do you have any proof 🤷🤷🤦🤦🙄🙄🤔🤔", "imambrishpathak": "Mam kindly don't spread your agenda..Do you get money for talking against modi??? Do you never see any positive in him???", "___sjd_s__": "👌👌👌", "ezbekah": "😓😓😓", "vikasmaac24": "I'm following you so that I can enjoy your defeat ...", "dj_rocks_89": "Saale Randi tu Kyu ye share kar rahe hai aur sara media kyu ise faila raha hai ye propegeda hai Modi aur Hindu ke khilaaf jisme kaye media, liberal aur tukde tukde gang ke sath congress bhi Samil hai aur tujhe Sach me itne pade hai to kyu Muslim ke study ke nai pade hai tujhe 🖕🖕🖕", "ritupandey71": "I think u just can't see our nation in a progressive hand and mindset", "de.epika4111": "She is dumb mind..see how many privileges your so called minority class have..", "sonia_prreti": "I support u swara....everybody has their own point of view..and equally hav rights to speak whatever hav their own.....🙌", "pallavi.srivastava.3726613": "Mad lady....unfollowing you", "rahulbharawa": "Next INC National president.", "rowdy.raghu": "Pakistan is also a land of #Hindu minorities..bt u haven't once talking about their rights????", "pranay4u": "Basdiwala har baar gali khane wale kaam krti hai🤣", "vinay.paul.92": "Are you crazy or what?", "jackdegrea": "Tumhe sirf dusro pe kichad uchalna aata hai @reallyswara isliye aapko haraa diya jantaa ne😂😂ab ghar pei baitho aaramse gaddaro", "mushtaq2133": "Bjhp paid workers pahoch gaye fast", "vikrant11933": "Abe ye unfollow hogi", "waxbar_": "Stfu up majority of you losers are racist cunts cribbing over meat and bs you’re pm is mass murderer his government full of rapists and terrorists so stfu you f in freaks !", "_thatpsychogirl": "Fuck off !", "soumita_das": "@ms_hashmi92 what we were discussing yesterday", "aawara_hoon1": "whatever", "gaurav_itmw": "@reallyswara you promoting 'tukre-tukre' gang was quite apt .. u r a perfect brand ambassador for all anti nationals .. why? Bcoz you hand pick, portray any act of violence as communal and paint any road side goon as a 'hindu terrorist ' .. reason ?? Coz u r anti bjp .. ok, stay that way but pls spare India and stop vilifying the Hindus as gundas and cow vigilantes .. better use ur finger (for whatever reasons) but pls don't act( you anyways can't do in reel life) in real life .. get some fresh air and let India remain United", "anuran12": "If you really do something. Then join the politics. From social media you can't do anything.", "happ_star_dude": "#unfollowswara", "raghawendrapati": "U r ..............................", "comicster0": "Marry a guy from a very poor minority family and prove your point ... dont lecture others start with yourself miss hypocrites😝", "rajeshrathi14": "You are unbelievable. The violence is unpardonable. Guilty should be punished alright. However why is this episode being linked to what Modi said? Such episodes in an isolated manner have been happening for years in our country. The local authorities and administration should take the necessary mesaures immediately but please don't link this episode with the ideology of BJP. When he has categorically said about minorities being made to live in fear, it is important for every citizen to take note of it and make sure it doesn't happen. Why are we blaming? Every individual is as much responsible for such acts as is the PM. It's so irritating to see people like you politicising everything even when people have given their mandate quite clearly. Get a life please!", "sourav4525": "Very sad!!!", "k_piyush_s": "Ayega to modi hi, 2024 .... Bechari #terrorost #tukre_tukre_gang #flop_show", "moqaliif": "i cant believe the replies she is getting are the people so dumb or they have so much hatred in the heart?", "sandeepilag": "गांजा मारते का तू?", "rishabhdhwajsingh": "Aya to Modi hi :)", "dev123123123": "Tu ja Masterbation karti reh Veer ki fudding", "rajat_1_4_3": "O aunty g ek post aur kar do for YADAV brother's killed for asking money for there lassi i have used my finger wisely", "gauravm344": "No point venting your frustration over your misconceptions. Focus on your career instead of going and supporting someone like Kanhaiya Kumar.", "doshikapil": "Bakwasss", "dreammcatcherr20": "So true🔥", "yasavant": "तुम्हारे jnu से अच्छा मेरे गांव के सरकारी स्कूल है जो कम से कम बच्चो देशभक्त बनाते है।", "o_m_c_a_r": "Just unfollow.. no need to say anything..", "nishantverma85": "JNU walo se aur ummeed bhi kya ki ja sakti hai.....being a celebrity u should not provoke people by posting such things....shame on you.....what you have done for minorities till date...i guess nothing... Even I didn't do anything for them... But I never try to provoke them too..... You r on that level where people admire you....a lot more than a common man like me..... So u should not spread hatered by all this.... Our PM sir is chosen by the people.... So atleast respect that...👎", "_accidentalmarketer_": "Before doing politics pls campaign properly so that your frnds can win.", "sagar.chaavan": "Swara Bhaskar is new laughing sensation .....😀😀😀😀", "dhamu_hadda": "बंगाल देखा है कभी", "ianmolchoudhary": "Annnnndddddd unfollow", "gaurav_k_sharma": "Either you are sick or you want to enter in main stream... but most probably you are sick", "varun.deshpande": "And damn it swara don’t u dare to write about Hinduism without knowing ..you are pathetic sold out downright liar you are sold out just like most other people like u in your left party", "puneet_kumaar_kanojia_": "@reallyswara Waao swara Seeekh gyii politic's bengal m jo hua vo ptaaa ni tmhe Supporter's maare jaaa rhe h vo ni dikhta tmhe ye badi jaldii dikh gyaa 🙏🏻🙏🏻🙏🏻accha khel rhii ho reallynotfakeswara", "____apps___": "रस्सी जल गयी.. लेकिन बल नही गया..", "payel_de_yehyehyeh": "Guys Jo Modi k sacchhe fans ho naah issh maharani actress ki id ko report & unfollow koro main toh karrehi hoon", "abid.ismail": "😢😢😢😢😢😢", "indoriam": "ohh come on silly woman keep your ugly thoughts in your mind.. don't try to spread them outside..waise how much you charge to post these types of stuff", "lavanya262102": "Respect for u @reallyswara .Brave woman. Keep it up. Keep going girl.V will alwaz support u", "agrawalvagisha": "Yesyesyess tell em sister🔥🔥", "sunils.patil": "This is HINDUSTAN not PAKISTAN", "ukw_this_is_nikhil": "Looks like @reallyswara doesn't seem to bother to do some research about the incident she's taking about. Do some research madam and you will get to see that this is an example of fake hate crime just like Smollett tried in the USA against Trump government.", "king210289": "Saali deshdrohi hai Tu 🤬", "cloutgokuku": "Can somebody tell me what's going on", "pows15": "Hello, take care of your career. Do you think for which party your campaigning was right. Think before you post....", "sardaarji_13": "Ye to bas shuruwat hai😛👌🙌 RIP HUMANITY", "himanshu_sain27": "गर्व है मुझे मेरे सेक्युलर होने पर", "ripikasharma": "Stop dividing the country, lynching was done on 22 nd May but media wanted to earn money on politics so delayed this news for election results . Then after this they get again . Madhya Pradesh chief minister is Kamal Nath and should be held responsible state police is under him . Tag the CM , Rahul Gandhi because it has happened in a state where congress is ruling . Above all stop dividing we all should unite . Crime is a crime , we should respond and not react . Why don’t you tag Congress party . Your motives are clear and I don’t think you are interested in the welfare of the country", "ankushgram": "Please go through the details of the same then bark", "bonamilaishram": "You are the biggest loser in both the feilds you are in.", "raising_vinayaka": "#sheisJCB🤣🤣🤣", "sibasisdutta": "People like swara.. Bhaskar...don't even deserve attention", "tapan3121": "I have not seen any of your tweey or social media post on mathura issue where some muslims beated hindu boy whe he asked for his money and you called yourself so called seculat", "nipung7184": "Bad career in bollywood does not promise good career in politics @reallyswara", "dhanraj7858": "Tu sudherne wali nhi hai", "saakchunni": "Finally some filmstars raising voice", "kumar.sushil836": "Filmi career me to kuch ukhad nhi payi ...ab wrong msg deke gandgi faila rhi h....", "pramodsharm": "स्वरा जी किसी भी धर्म,जाति,समुदाय के प्रति इतनी नफ़रत सही नहीं है आप किसी भी समस्या का आकलन निष्पक्ष होकर करे आप आधुनिक,बुद्धिमान व सभ्य नागरिक हैं लेकिन अगर आप घृणा फैलायेगी तो बदले में घृणा ही पायेंगी", "i_m_adnan03": "Well said🙌🙌👏👏", "prince_narshi_99": "Kab shadi kar rahi h aap kanaiya kumar se 😍🤣", "kulkarnisatyajit": "Frustration", "roopsidhu79": "Modi has made people stop using their brains 🙄", "subhajitsaha.1430": "🖕", "rajeev2319": "Please welcome vixen has arrived", "mayur_gavhane1012": "swara u have needd to take tratrment from mental hospital...🖕", "pooni143143": "That's the difference. By posting such things will Make us sure that how happy u were whenever India was attacked by Islamist terrorists. Such cheap filth u r @reallyswara", "rubalkumar6920": "ye modi ji bhi na librandu gang ki bjaye pade hai", "naz__ellahi_": "@reallyswara what you have said is the truth ask the minorities who are threatened daily the hate is real from the extremists India is my country to my forefathers fought in the war look at the gate of India 95300 freedom fighters 61945 are Muslims 65 percent Muslim freedom fighters fought for the democracy of India yet the hate towards is real .", "ajazsh": "These scenes are which must have been missed in biopic...", "gujuche": "Thank you for this. I was born and raised in the US, and we have our own issues with racism, intolerance and violence against minorities. My parents are fans of Modi simply because he is Gujarati, and it frightens me just how much people are willing to turn a blind eye or be uninformed.", "sleepy_tinker26": "Ab to chup ho jaao madam..kab Tak chlega aapka ye drama..having different idolizes is fine but u are on some other level hatred.please get well soon.hope God bless u with u some wisdom", "jaasmaanrathore": "We chose these terrorists ... now we have to bear them for next 5 years ... murderer is our PM and terror accused is our MP 😞 New India", "prashantshrivastava789": "Madam plz attentuin on your work..because u have no knowledge...come and debte me..i promise u will feel ashamed on u", "aliayesha99": "Respect only for u....🙌🙌🙌u need guts to post this....👏👏nd its not abt the gov..its d local ppl who spreads hate ....🙄🤷‍♀️🤷‍♀️🤷‍♀️", "real_runjeet": "We r proud of u mam at lest few people like u r in Bollywood who understands real politics", "excellentpriya": "I think this actress instead of talking of India together - is talking of the divide n rule it won’t work any more. It’s a new India we all are together regardless of caste n creed.", "avtarsingh.1980": "पश्चिम बंगाल में ममता ने क्या किया वो तुम्हे दिखता नहीं, केरल में क्या- क्या होता है तुम देखना नहीं चाहते, अमेठी में क्या हुआ वो भी तुमने नहीं देखा. और तुम खुद को धर्म निरपेक्ष कहते हो वाह क्या मज़ाक बना रखा है बोलने और सोचने की आज़ादी का और फिर कहते हैं कि आज़ादी खतरे में है, संविधान खतरे में है।", "shailvaid": "You are no less then kejrwal, who is always busy in blaming Modi rather than doing his job.", "left_arm_medium_pacer": "Madam ko koi Burnol do 😂😂", "tarunkacha": "Yeh swara hai kaun ?? Koi batayega ?", "officialparulbansal": "@reallyswara your new ajenda doesn't work.....wait for next five years.. 🤣🤣🤣🤣 ayga toh modi hi.....", "mishra1349": "Paid advertisement k liye dm her @reallyswara", "blossomingbeautiz": "U are no one to describe PM Modi like u in ur thoughts! Congress have given such a pathetic experience to us just like ur silly post!", "om_borana_07": "23 May Ka sadma abhi tak hai", "rajsingh_pat": "मैम मैं आपके काम का बड़ा प्रशंसक हूँ ,लेकिन हकीकत से मुंह नहीं मोड़ा जा सकता ,दरअसल ग्राउंड लेवल पर काम हुए हैं ,और ये जित उसी का परिणाम है । एक उदाहरण रख रहा हूँ आपके सामने ,सैकड़ों की तादाद में रोजना जब महिला ये सोचकर सुबह के तीन बजे उठती थी की कोई अभी नहीं देखेगा ,लेकिन रात के उस अंधरे में भी बाईक रौशनी जब पड़ती तो सिवाय शर्म से सर घुमाने का दूसरा चारा नहीं होता था ,एक शहर नही भारत के लगभग इलाकों की कहानी है ,उस बेगुसराय की भी जिसे बदलाव का रास्ता बताया जा रहा था ।एक अदने से शौचालय ने पूरी ज़िन्दगी बदल डाली । सवाल मुद्दों की होनी चाहिए न की बस यूँ ही । देश में कहीं कोई दिक्कत नहीं है ....और ये बहुमत भी उसी का नतीजा है ।", "me_hi_hu": "@reallyswara.... Ma'am I'm a fan of... And a Modi supporter too.. You can call me so called #bhakt.. But why don't u just stop hating and start explaining solutions. World changes by doing... Not announcing what you could and can do... And Modi didn't go there and killing someone, nor he announced to beat someone like your favorite kanhaiya Kumar... You guys tried your best to come into power, unfortunately you failed... But if you really wanna do something for country, help ruling party to solve these issues. 🙏", "priyankaponky": "Ppl who are against nation and narendra modiji#shud leave for Pakistan", "imrizvi9": "Terrorist", "ankitdacarote": "It's true fact", "god_of_thunder1": "India ne apna faisla de diya hai", "sainidipak06": "@reallyswara chand sikko ke liye movie kapde uttarne mein desh ke liye kaam karne meib bahut farak hota.", "high_0n_chai": "Bas jalne valo ki duva😂", "atheistraj": "Or didi bangal me jo ho raha he wo sahi he ??? Tu yaar paunati JnU tak hi reh na ye sab me mat pad tere kaam ki chiz nahi he 572 seats he boli thi tu abhi akkal he nahi or randaap kare ja rahi he fuck you lel selum", "ayushiisharma": "Flop actress,flop opinion", "shivam_patel_07": "Mam i have never seen you taking stand on hindu . It was wrong what was done to muslim brothers but only cursing one party is not right.", "div___ishu": "U R real panoti mam😂😂😂", "immanishh": "With due respect ma'am , as you can see the mandate given by our country and in ur comments too everybody is supporting our gov. Being not a supporter of the government is a good thing but what u are telling is wrong . Our pm has spoken for something good not bad . At last you are a very good actor 😊", "_pumpkinnnnn_": "Which minorities are u talking about.. Muslims? For your information in India there 20 % of Muslims.. which is not minor..", "raku.chaudhary": "Tu jha jha gyi tera candidate bhi har gya...", "083himanshu": "@reallyswara A mob of so called peace loving community killed Bharat Yadav..have you not heard? To ab google kr le @reallyswara mob lynching hui hai mathura me..jara uspe bhi dhyan de le..ab tera placard nhi milega aur na hi uspe koi post ayegi teri...shame on you 👎👎", "shut_up_ya_gaurav": "you're right mam!", "vickymusafir": "jante h par mante nhi ...", "caprakhar": "Kannhya se shadi karlo tum...", "iammmansi": "If one is expressing her thoughts who are you to comment her come on people we are democratic India we can say what we want or feel 🙏🙏", "smiley69lol": "Chal nikal gyan mtt chode......", "anand.s.n": "Swara y you always stay in wrong side", "patkarpatola": "Ur post is full of pessimism. I mean u r a celeb.. u should act responsibly... U give out a strong message of hatred.. how come people manage to find flaws all the time..? We don't live in an ideal world.. don't make one incident so big.. and if u really want to then talk about every injustice that takes place in our society.. Irrespective of minority or majority . We all are humans.. pain don't see castes n religions.. please just don't hate cuz u want to hate.. .. plz spread positivity.. after all u r an influencer.. big youth bunch follow u.. I'm fan of ur work . But this post just didn't go well with me.", "g_rahul_07": "Started 2024 election campaign 😂😂", "miss_batra09": "U lost all my respect lady... Calling your country's PM a cartoon...shame on you..", "sidrah_naushad": "The comment section is filled with filth!! I am with you @reallyswara ❤", "syedsid786": "Be proud it’s new India", "devagamer123": "Abe chutiya aurat deshdrohi tu Pakistan me jake bas ja chin#al k aulad", "swastikbanerj": "Par Aya to Modi hi", "vicky23sethi": "@reallyswara I started following you as an actress but then I found the videos where you visited Pakistan and Mazak Raat and last year you barked against them after praising them while you were there. Now you becoming a shit hole. I understand you dont have enough work in industry so go found something else or get married to a business tycoon...but dont spread this hate. u are being unfollowed...You SHIT HOLE", "aditya20sharma": "stupid bitch !!", "raahul_jaiswal": "Really swaraj oops means fakeswara..pls remove \"really\" word in account...because u r so fake", "angel_st_1": "Oh yes sooo much violence on minorities and thats why modi won with such margin against the so called parties who support minorities .. and guess what to whom the minorities voted --- Modi over others ...", "jack2763": "Apni aaukat main re halki lady", "shail127": "Love you @reallyswara .You are brave! Thankyou!", "yash956": "I Guess We Should Report Her Instagram Account And This Post Also So That She Can't Post Anything Like This Again", "hafsathehotilier": "😢", "thisismukul": "@vishalmishra1996 @prakharsingh26 Yeh ni sudhregi. PANAUTI 😂", "sah.sujata": "@reallyswara mam illiterate people don't care about this incident they only care about that this government is able to provide them light and gas after a long time and also illiterate people don't check your post.and yes don't forget 80% people including illiterate and literate both vote for modi. 😂😁", "dreamer24x7": "You have guts Swara to say something against the Facist tide. Cheers. Proud of your bravery. Ignore the cheap communal trolls. Cheers 🥂", "__s.f.k__": "@reallyswara Is this an Amul add", "fame_mhtzn": "Namo Namo", "ketstar14": "🖕🏻💄", "officialmoinsyed": "Fake agenda hai inka @reallyswara", "obaidsaud": "Exactly🔥", "khyati_srivastava": "😢 u r fool if u hate Namo", "sagarbakshi25": "If you want to do something.. Join politics... Dont distribute Gyaan.... People already know each and everything", "faisalazmi47": "Andhbhakton ki maa ka bhosada", "krn_pndn": "Madam ayega tho Modi hee🤣🤣🤣😂🔥", "navneetgautam_oo7": "तुम्हे ओर तुम्हरा पोस्ट देख मन मे एक ख्याल आता है", "yaduvashiabhishek": "Sali pagal tujhe aur acche se samjhata pr sabdo ki beizzati nhi krna chahta main anti hindu", "reema5210": "U r one blind idiot of our country earlier I used to love ur work but by seeing ur biased thoughts about pm modiji I feel ashamed of u", "rahulbagrecha11": "Out 65crores who voted more then 35crores voted in favour of Modi", "gajsinghrathore": "Mam.... please try to see the bright side of this mandate...the people of whole country have got together to vote for the party who they can lay their trust on...", "m.praveen10": "U r those who comes frm the world,talks unnatural n one sided... 😠😠😠 why u dont ever talks about #KASHMIRI BRAHMIN#??? y u become voiceless on dese issues?? Disappoitnted such things to read from u.😭😭😭😭", "the_tyrannous": "Well said 👍", "nadeemforkhan": "Not only in india its a whole world story @reallyswara", "samriddhi116": "Minority k bare me soche go bhi problem na soche to bhi problem... Wese you r nothing in front of modi ji... Aap ne PM ki respect to thse hoti nahi aajaegi bas bakwas karne", "anamika.jha2712": "N i really don know why m i following u...good bye", "priya1120": "Aa gai aap apna selective outrage nikalne🤦🏻‍♀️🙄", "homefood_gharkaakhanaa": "Can't expect more from \"she\" Idiot...", "amayzing1999": "What is your problem ?", "yash.bharadwaj.31": "Are Madam aapko India me itne paresani h to.....why are u living here?.....kahe or kyo ni chale jati.....Pak chale Jay....ya to Jahannum chale jaye....waise dono ek hi h...", "lavanya92": "Country ka bare me bat karnewali, country keliye tune Kya kiya....itna ladki logoka rape hua,wo time Tera awaz kidar ta? women empowerment ka speech genewale tu & Tera so called Bollywood star,women's keliye Kya kiya ...", "satya.tomar": "Kahan se aayi h filme karle chup chap", "sayalee.s": "It's not at all true 😏", "_brokenyoungs": "@reallyswara and by the way your bio shows what you are - bloody dramebaaz 🖕", "kpawan_k": "I can understand you nothing left in left so sorry for you", "priyabrata__biswas": "@reallyswara Sssshhhhh! 😜", "bholey_ka_bhagat": "@reallyswara ??", "jalebi.bae": "😔😔💔 This is awful"}