{"yosuman29072015": "What is name film?", "shahbaz_khan0": "Suna hai pandit ji ka launda randwa hoi gawa🤣#epic", "dhavaladhav": "Jai shri ram", "narendra5407": "Madamji delhi me mandir toda aapke pyaare mullo ne.. kuch bola nahi aapne @reallyswara", "devendra_singh_palawat": "My favourite movie ever😍😍😍", "manojreal": "Ha ab toh waise bhi 6 yrs se koi film nhi mil rahi😄😄😄😄😂😂", "narendra_singh_khanii": "Modi G ki nagri me Aap ka kya hai??????", "ahinduvictim": "deshdhrohi supporter h ye aur Anti-Hindu bhi @reallyswara", "kapiltiwari560": "Tere baap osama ko America ne ghar me ghus kar maar diya... Kya ukhaad liye tune", "jatinpandey070": "Movie name", "lucky_dancer_55": "Kitna nakli ha tu", "sugandhsharma536": "Teri asliyat nhi pta thi flop kra dete nhi to koi b nhi jata movie dekhne sirf teri vjh s acche actor actress ko b nuksan ho jata", "bhavyaxinha": "हिपोक्रिट", "sharma_prince_55": "Cow love👎👎 Pakistan me to nhi krte Tum kese 🤔", "lohiya_suraj.official": "तुम्हारा मन बोहोत खूबसूरत है❤️", "garvshrma": "Nice bindiya luv ur prfrmnce Mam", "don_vicky07": "Sab fake he behnchod aurat", "choudharyshivjuhi": "Of course it changed ur life u opportunist. Sonam Kapoor se jo Dosti ho gyi iske bad. A list actors ke sath jo dosti ho gyi, haalaki Sonam a list Keval apne surname ki wajah se h,bt still😅😂😂", "priyanka_payaal": "Mn X", "naqvi.aijaz": "I was stunned by the crazy love for the hero performance. I searched for your name. I predicted you would be awarded. Rightly you were nominated by Filmfare. You were sitting in front of me at yashraj, that night. I was equally excited about your award. But it was not to happen. From that day to this day I love you and your acts including twitter.", "anandverma_av": "Duniya ki sabse giri hui ensaan jis ko marke khane ka bolti hai usi k saath nautanki kar rahi hai", "imsagarbaraskar": "Chiiiii kiti gandi dikhati tu", "foram_dalal": "Ye gaai or gadhi sath kaise?", "axel_onelife": "Amazing shoot 📸 If you enjoy travel, come travel in my instagram and tell me what do you think🤙. There are some pics in India everyday 🇮🇳 follow me Have a great day", "kunal_rp": "I watched this more than 50times best of best love u 😍😍😍😘😘😘😘", "sukheja.anil": "I watched ranjaana movie only because of swara , coz I had seen her in tanu Weds Manu and liked her since then 😍", "sakshi_patil7272": "Twinkle sharma nahi dikhi isko sirf muslim log dikhte hai gand marati hai na un logose bhenchod sali mulle ki aulad", "vishalchoudhary_97": "Boycott her", "fouziyarameez": "👌😘😘", "badalrohilla_rajput__": "Tatti movie", "abrar_new_avengers_mcu": "Double standard swara bhaskar", "ruchijain050": "I love it 🥰", "shailly_asiwish": "Jaa na", "nirapjeetsidhu": "👍👍👍", "_raunaq_gill": "Meri to favorite hai ye film apka act be bhut acha hai iss mai", "casu_vaibhav": "u don't deserve to be in Varanasi", "suhasini_rai": "Whattaa Movie🔥 #foreverfav💜", "archisensei": "Suar🤮", "singhgoldie5": "U r super talented .. more power to you", "madhujabhattacharya": "This film is iconic.... I am your fan, and I want to tell you that you are wonderful. You already know that but still going to tell you that again. Love your kitties too. Please do the good work our country that you have been doing!❤️", "arnold.gokavi": "You look more like cow than it . You fat cow", "aulina_sood": "You are really amazing!!!!! Super talented!!! Love how ure not afraid to take up a variety of roles. All the best!", "mr_bald_n_beautiful": "@reallyswara the movie #raanjhanaa portrayed a guy who forces himself on a girl....thrz a dialogue in the movie whr in the lead actor threatens the Heroine of killing himself and her too....and u play a character that is in love with this psycho of a guy..... Double standards - u promote violence against women bcz u r paid for it.... U r really disgusting", "abhi.verma.23": "Jai Shree Ram🧡", "iamgauravpathak": "Aur sirf movie k liye cow ko b toucg kia warna yeh toh cow meat khane wale log hai", "ffaaiizzuu": "I loved the movie.... and enjoyed BANARASIYA song a lotttttttty.... u became my fav since than.", "mihiruwu": "Kaash set se hakal dete tereko", "shubham_surana__": "Us pal us kshan Laga k Banaras bhr ki sari bhang jamare Mathe me aur Mahadev ka jehar aakhon me utar Gaya ho.....", "harshdeokar14": "A chinal aurat kitna leti hai jhukneka", "nandies1989": "Such a looser", "kalyanoneeight": "*Rand*", "methmini22": "❤️", "pandya9824": "MODI MODI MODI", "saurabhbajaj1984": "What a downfall, from heart to arse.", "karnand21": "Use Cow kehte hai, jise Hindu log Maa mante hai, pata nhi tumhare dharm mein kya kehte hai!", "hemantkumar5222": "Bhag bhosdi wali chutiye ki patthi chudarbilli", "suchithkc91": "It is a good movie mam... Hope you get good roles like this.", "im_ankitvish": "Feminist swara😠 bc", "chongjot": "Huge fan of yours", "yau.zubairu.391": "So fantastic", "deepakcool.pal98": "Modi modi modi", "rushabh_1995": "Jai Shree Ram", "shabnamthakur78": "who thought six years back that modi ji will be winning the assembly election from bnaras only 😎😎 love for modi ji 👌👌👌", "fnzz00": "Side role 👎", "g.aliya": "I was big fan of u.. But later when I got to know your real thoughts. I started not liking and gonna keep continuing.. Jai hind", "vikrant.sain.1422": "This film is superb", "jyotsna.bajpai.3": "Still my fav muv", "yoshiartist4": "fav💛", "sarthak3238": "Randi gayee mata ko chuke gandaaa mt kr", "pemkumar03": "Really mam this is onest my favourite movies", "jstprachi": "Madam aaya to modi hi 😄", "rekhapathak862": "Humanity", "fulloflove876": "your anti hindu u should marry muslim man 🙌🙌", "shiven_here": "I loved you in the film but then you as a politician arrived and now I hate your views to the core..", "gaurav_d_pathak": "One of the best movie I ever saw 👌 being a banarasi I must say this is the movie that make u feel like banarasia", "samriddhi116": "Nikall... Bhikari oorat 😕", "shripad.gurav.45": "We hate you ...bitch.... koi accha SA din dekh ke Marja tu", "iam_s.r.k_21": "Chalo kisi movie me to hindu character follow karr liye...😜", "himanshu_sain27": "मुझे तब भी आप पसन्द थे आज भी 😍❤️", "krishna_k_shahi": "I love this movie and actors like they act is still feels like you guys are around. And your acting was live and lager than life. I love your role character in this movie.", "ankitsen.aj": "Congratulations I love this movie", "pagelinkinparkfan": "Go to hell bollywood call girl", "yadav.rahul16": "one of the my best best super best and forever best movie...", "syedimran.ali.9655806": "👏👏", "ajinkya_amg": "Loved your work in this movie i still remember days before by second Vipasana course i had gone to watch this movie for the second time and when was in meditation when I close my eye the sakhi song would be in front of me with u clearly dancing 💃 any way it was just awesome 👏", "khwaish_ek_dua": "Im waiting.for....Ranjhnaa..2 💓😊👌", "ravinaah": "Love the movie 😍❤️", "nehavinod21": "Kya se kya ho gye dekhte dekhte", "chakraborty_kakuli": "Hey swara.....dont say that u r kam chahiti.....u r beautiful and a fanatabulous actor...gid bkess u sweet heart...", "sohansingh0809": "Iske pakistan premi or hindu virodhi hone k karan bdi mushkil se ise gini chuni movies milti h or thode bhut pese de do to kuch bhi krne ko teyar ho jati h to jalil orat😤😤😤😤😤", "harrdyparmar": "I always love to watch behind your love 👏", "eddy._.k": "I was star love u from this movie", "nirvanaemelia": "@temsurenmjn @deepa_basumatary remember the night we sneaked out of the house to watch the movie😛😝😁", "puneet4uall": "I need not to say that how Wonderful & delightful it is to watch your act @reallyswara . There is a simplicity & honesty to the character every time I see you on screen. More power to actors like you 👏🏼 hope to see you visit us in melbourne one day.", "akkishukla007": "F...off", "rohanaps": "चमचागीरी of sonam kapoor... Woh अलग", "singh_vikram_2000": "Bolly wood ki top 1 movei", "lakshmilakshh": "❤️❤️❤️❤️❤️❤️❤️ Cannot forget this movie and you😘😘😘", "prerna.mittal20": "Ranjhana is one rare movie that has got everything ❤️ #foreverfavourite", "_fatema_lokhandwala": "@reallyswara Bindiya 😍😍😍", "divyatiwari06": "Never felt bored though I watched this 100 times❤️", "foysal.useless": "take fucking from that cow", "official_deep_panjokhra": "Very very nice and superb movie love it", "_sachinsakhre": "U were too innocent in this movie", "tarungurjar3211": "@reallyswara ullu ki pathhi ..apne manpasand pakistan chalija ..Hindustam mein gand kyu failari h..🖕🏻🖕🏻💞💞", "irhamlana_": "@faraisha_93 😩😍 this moviee", "_romeo_rajpurohit": "Ungli", "sanjeevparmar55": "this was the only time in my life wen u looked beautiful and good to me @reallyswara bad me to bakwas hi ho gayi👎👎👎👎👎👎🐒🐒🐒🐒kahin ki🤣🤣🤣🤣🤣", "rajput_boy_raftaar": "Zoya Maregi na Gau Mata", "engi_nerdd": "U r love...be like this..u r an inspiration❤️❤️ @reallyswara", "venkatesh7164": "One of your best performances,", "_iamnoor_": "❤️ this movie🙌", "riya._.deep._.gill": "one of my favorites and u rock", "sukhman_2": "Fan ❤💝", "sharmavidushi55": "He is asking for blowjob💦", "tribhuwanaashish": "❤️", "meenak67": "Band kar diya hai inke aur inke jaise kalakaro ki kala dekhna .Shame", "shubhanshishukla123": "Really..!!! it 'll olwz gonna be a spcl 1 to me❤️", "sharmay9114": "Jab bhi gussa aaye or gaali dene ka man kre iske comment section me jamke is Randi Ko gaali do saare paap dhul jayenge😂", "awaisjillani12": "Such a brilliant work done by you & what a beautiful film ❤ so many beautiful memories attached with this movie @reallyswara", "surya_dinakaran": "🖤", "hriitikk": "❤️❤️All time favorite", "yadavinder416": "Modi jindabaad", "pankaj.sati.94": "🤣🤣 cow wala scene was epic", "whonagoriankit": "Best movie", "abdulwahid385": "👏👏👏", "sunny_mandhan": "Bhadvi", "mohitpachouri": "Zoya maregi naa😂", "ikamranmalik": "U r 😍", "iamupasanaranga": "Hayeee!!🤓🤓🤓🤓🤓❤️❤️❤️❤️", "vaibhstunning22": "Ye liberal jitane bhi hai ekdum besharm hai logo ki moral value k sath khelana aur gandi cheez ko support karna inake khoon ma hai chahe ho soldiers ka apmaan ho lekin jab inake liye comment padhata ho jo jayda negative hoti hai dil ko sukoon milalata hai ki humare yahan maximum log abhi bhi bahut ache hai .shame shame swara", "rashmipanwar27": "Jst love this movie😘", "siddharthv7": "❤", "pandit_shyam_swami_gi_1100": "🌏 विश्व के जाने-माने पंडित श्याम स्वामी जी जी ।। 🚩#Love_Marriage_Specialist Call +91-9950857579 सोचने से नही सम्पर्क करने से दूर होगा Love Marriage Specialist Love Problem Solution Love Vashikaran Specialist All Problem Solution Get Love Back By Solution समस्या चाहे कैसी भी हो जड़ से खत्म। बड़ी से बड़ी समस्या का समाधान। अपने मन चाहे प्यार को पाना, काम कारोबार, किया कराया, सोतन से छुटकारा, पति - पत्नी में अनबन, 🔱 You will chat on whatsup and call now +91-9950857579", "aakanksha_s_ujjain": "You think this one changed your life!! You got all eyes on you from your very first Tanu Weds Manu ❤️", "sunil__goswami": "🙏", "ishreyashtiwari": "As a secular u should avoid playing holi on big screen it will suppress the minorities 😥", "d_akshay_jaiswal": "And from then u became my crush...U look so good.", "ajay44u": "the only movie which i byhearted... vitamin humse lo aur aashiqi inse nibhao..", "aeykey._": "One of the favorite movie till today @reallyswara we met tragedy while repeating your dialogues in movie theater , there was a Punjabi family watching this movie for the first time and we people was doing this thing for fourth time , they complaint police that those guys are cheering a lot and repeating cheap dialogues 😂 I still remember those epic scenes", "unofficial_samaadhan": "💙♥️", "beinglalit16": "Die hard fan bindiya", "chandni_joshi02": "My favorite movie because of you and dhanush 😘 your acting make me your diehard fan", "sk_ansar_ali": "What a adorable movie it was.. loved it😍😍", "abhishekchaudhary24365": "Bindia", "ak_graphicsz": "ismein swara kaun hai ?", "imskp907": "Suprb movie..suprb performance..😍...I'm also a part in this movie..as a crowd 😂😁 at assi ghat & tulshi ghat...tum-tak & banaraiya song😊", "mmathur941": "This is mind blowing movie & brilliant performance by everyone.", "utkarsh11o2": "💖", "bangi1993": "Favorite movie", "papindra.suden": "Appreciate you", "pk2216_prakash": "@reallyswara tumhari acting kmal ki thi kash koi aise film vaps Aaye jisme bde namo ki jgh ek story ho", "mouindrani": "Varanasi..🙏❤️", "poojabharti058": "Your acting skill🔥.You nailed it @reallyswara and you were really awesome in this movie.", "djthegr8_710": "It changed u from side heroine to no one", "_e_s_h_a_n_a_": "😍", "ziddi_bokudd": "So hardworking actress . . . Keep it up gal", "naleen.sheron": "The best indian movie ever! Congrats! You all did amazing work. ♥♥♥", "taflu_90s": "Truly this is the film where I fell in love with your acting and character. ❤️", "artist_abhishek_namdeo": "What a movie it was💘 brilliant acting by you all, awesome music, nice script", "nes.sanjay": "Acting is more good than politics.. To miss librandu tu sirf acting pe dhyan de😜", "itsbruphotography": "“Zoya maregina? Boliyena gau maata. Zoya maregina? 🍪”", "singhal.manish15": "You are really superb in that", "nafiee_abdullah": "Though I don't like u that much. But just to let u know its the only Himanshu sharma and his writing that made me realise that bollywood is not just all about all those fency heroes and heroinss. Its also about the simple, flawed small town people and their tragedy..", "ben87yao": "Lol expression", "shardaprakash": "@reallyswara This movie was not just a movie, it was an emotion that runs still in the small lanes of Banaras, it was an epitome of representing the average class of small city their celebration, their lifestyle, backed up by performance which will and is unparalleled to the main stream🤗 Hats off to you for being just you and presenting that on screen. More power to you👏", "ocult.girl": "Wonderful movie❤️", "rohitcoolg": "We enjoyed your acting in this film and we love you. 👌", "that_yamaha_2stroke_rider": "This movie made in fall in love with you!💝", "swapnilonly1": "Indeed you were Amazing & the movie too ✨💥✨💥👌", "naveen._.sagar": "Very beautiful 💗💗😘", "manuzwork": "How come... you become a cow lover... just because of money that movie pays you...", "_mr_sahil_03": "🔥🔥🔥🔥", "iakshay19": "Bindhya > Joya", "benazir7340": "You were so good in this movie @reallyswara", "tanwersunny": "Tum hi sabse kharab acting kiye ho is picture m", "nya_aabha_inle_h": "♥️❤️💜💙", "writer_ki_kalam": "Hello guys, For some motivation poetry 🖊 follow my page @writer_ki_kalam you will definitely like the content 👍🖊❤️❤️❤️", "chetan1lodhi": "Kal shaam hi iska last wala scene dekh rha tha. All tym fav👌👌😘😘😘", "masumtailar": "😍", "swaranjeet009": "I still love her😍😍😍😍😍", "faziabale": "U are a great actric", "harshadchauhan": "It was a great movie...❤️", "umesh956529": "one of the best movies of urs.. loved it😘😘😘😘 loved ur role😍", "tkrishnakishore": "One with commonsense, in bollywood...👌 Keep up your good work...🎉", "ravi_r_prakash": "Mam I love the way you act in this movie....respect for your art👌.", "iamraiyyan": "beauty♥", "sandeep_07_sa": "😍😍😍😍❤️", "anu_trending": "🔥🔥🔥", "rudesteps": "💓💓u r beautiful love", "goswamipriyanka5": "Ye movie mujhe bahut pasand h man. Spacily you", "i_am_mzn": "Best performance by you... Swara", "sashidugyala": "❤️ ur role with our dhanush...👌", "storyofmoments": "Loved you here❤️", "mishra_aditi_": "Best role of urs❤️", "sushil.sonune": "So sweet 😘", "chandak_ck": "Been always a super freak fan of your talent.. only you have the guts to take up the tough characters!! Hope you get what you do deserve one day!!", "priojitkeisam": "Do bhainsiya ek sath 😎😎", "ca_karan21": "Love this film❤️", "thevishaljha": "Always love this movie🎬", "rajatjaiswal.india": "Best supporting actress in every movie😀❤️❤️❤️👍", "rthadani_us": "Yeah, Ranjhnaa was a very good movie, all the best Swara", "clickulture": "😍One of my Favorites😍", "rohitdhillo91": "Gajab bindass acting mam 👌👌👌👌🤗🤗🤗", "hasmi2255": "Kashi me jaadu hai ye insan ki zindagi badal deta hai! @reallyswara", "nick.survivor": "My favorite movie of yours swara. 😘😘 Ur the main role in this movie ❤️", "sukhsamruddhi": "One can easily guesa swara's skills/potential/career life/respect simply from this single movie.", "imarif007": "For me bindiya is better than zoya... Always❤️ love you", "nikitagupta2000": ",gem it was💕forever❤️🐖", "__live_fast_die_young_": "Bullshit like you 😂", "yadavyadav82": "Haad hai yaar phele hindu dharm ka naam le k paise kamao fir uske he khilaf bolo ....wow great pata log kaisa inke picture dekh ne jate hai... Anti-hindu...", "habeebakhter": "Did not watch. Hopefully I will try to watch now.", "gauravashokgarude": "❤️", "krn_pndn": "The only good thing u hv done is this film", "go.anurag.go": "More than loved you in this film. #Joyamaregina?", "lafaz_20": "❤️❤️", "itariqueaziz": "it was realllly awsm", "beautybyneiha": "Fav 🔥😍💕", "_i_m_shivamsingh": "I just loved this movie like anything🤣🔥😍", "nishor_pb": "❤️", "vinayaksoni7": "To bhangi hai bhangi hee rahegi thek hai", "gaurav_singh3012": "A film who loved by everyone. Its dialogue is so incredible", "jaydipmunjapra": "Swara, i love your cherecter binigyan more than zoya.😍❤️👌 @reallyswara", "shilpa.kpr": "Loved every bit of acting by u in Raanjhna.... Much love to u😘", "brinda.x": "i loved youu in this moviee @reallyswara ma'am!! one of my favourite movies💖", "unsorted_pradip": "बिंदीया..❤❤", "adyasha_sahoo_1996": "Zoya maregi na?? 😂😂😂", "khan__mubeen": "@reallyswara loved your acting in Raanjhana ❤️", "aakashshriwal": "@reallyswara . Ae bindiya , kali kutiya se nhi tumhe se hi rachaynge biyah 😘😘😘", "br0wn_shuger": "💗💗💗", "dekhomagardhyaanse": "Nothing like this movie. Ever. ❤️", "riya_jeph": "This movie is my favourite.", "baawra_vikas": "♥️", "saquib_er": "It was awesome movie...we always remember sawara's outstanding performance in Ranjhana 👍", "adarshhtewari": "Fav❤️", "prashantshrivastava789": "That was superb film....", "ripudamanboora": "@abhaydeol acted brilliantly.. you forgot to mention/tag him", "the_himroo_man": "Simply loved this movie. Truly an epic.. one of my all time fav.", "sultankhan1060": "1 of the best movie mera banaras 😍😘", "jaztimarmie": "A movie which glorifies stalking.", "shashaliniverma": "Your acting was so natural in this movie and also in nil bate sannata, always be pure and genuine as you are , more power to you @reallyswara", "imperfect_soul_29": "All time Fav😍", "naveen_singh_raja": "How r u feeling ma'm when u r in Varanasi????", "beingrealakaash": "#bindiya ❤️❤️❤️❤️", "krazzynaveen": "Best movie ever❤️", "huss____nain": "Few days ago I remembered this film and I watched it again.", "faiqa_swagger": "6 freaking years and no change occured in your appearance wow (life goals) 😍", "muhammadshariq75": "@reallyswara mam u r d best. We all admire u alot. Lots of Love and Best Wishes. ❤️❤️❤️❤️", "am.eer1800": "You are my favorite and such a sensational Actress ❤️❤️", "amardeep_2020": "#Crush From Bindiya n Still Deep Like Occean 💘💛💚💙💜💟❤💞", "knight_0011": "My favourite movie 🤗❤️", "winter_touched": "One of the best movie 😍@?@shariyahasan", "anupama_mirge": "❤️", "____apps___": "बेचारी गौ माता भी ईसे गालियाँ देने वाली ही थी के स्वरा ने उसका मुख बंद कर दिया..", "jagransandeep6": "Modi", "mahighane55": "Vitamin hamse khao aur aasiki inse ladhavo..😂I like that dialogue Bindiya❤️", "anuj_kumar_sharma__": "❤️❤️❤️❤️", "mnainesh63": "Beautiful 💕", "i.m_saurabh_yadav": "One of my favorite movies 😍", "abhi2222": "really this movie was amazing", "kumargautamamit": "Koi tho awaz dekar rok lo..👏👏", "aradhyevishal007": "Absolutely lovely role ...", "sandeeprem": "A great actress also with you in this movie. @Shilpi marwah", "mo.hit.singhrajput": "Aana mat kabhi mere sheher me BKL***", "abbas_khanjada": "Awesome movie love it", "p.k.yadav10": "Your acting in Raanjhanaa movie it's awesome and you played naturally real acting", "andyvyasofficial": "Zoya maregi na😂😂😂", "ramneeq_kaur": "U were amazing girl 😍😍😍😍.favourite ❤️", "swapnil.dhanawade01": "And since then you are my favorite artist...।😘😘😘👌❤️", "channdan6901": "👌👌", "maggi.vatas": "😍", "j_a_y_a_r_a_j_s": "I will watch it forever 💯♥️👌", "iamgagan_tuli": "NaMo NaMo 👏", "saddamhashmi_": "I love this movie & I like u", "mausami_patil": "Best film 🙌🙌😻😘", "makrand_kawishwar": "अभी तो काशी में मोदी चल रहा है", "mii_desai": "Very good acting in this movie or other web series ..👌😍😘", "_nashakhor_": "A movie like this should come again", "shri709": "If I get girl like this movie I will definitely kick Sonam Kapoor", "hardiiik_": "fabulous work 👌👌👌", "ro_man9956": "Kaam wali lag rahi hai🙌", "rekhta_artiste": "Love Love Love💕💕💕", "virajimmortal": "Dr wala sabse mst sean", "mohit_krr": "This is my most favorite movie ever 💖", "shravan_jordan": "My all time favorite movie...🖤", "mayur.dv": "Amazing performance🔥🔥🔥", "shifali_9501": "♥️", "__onceuponatime1998": "No one could have done bindiya better than u ❤️❤️i love u yrr 😍ranjhaana will always remain close to my heart. A true Bollywood gem.", "abhimanyu.prashant": "Suna hai pandit ji launda radau reh gya", "iamgaurav56": "My Fav Character Bindia 😍love this movie", "iimihir": "Love your all characters ❤️❤️", "paula_sotomayor8": "😘😍❤", "nuovefoglie": "@reallyswara I still keep watching dis movie with all my heart just for u n dhanush sir... Bindhya is so adorable...", "the.drolling_elixir.sameer": "Sexxoo film", "subha_lifeisfkd": "@reallyswara let me remind you , you began the gau mata trend 😂😂😂", "iam_shekh": "Vitamin hamse khao or Aashiqui inse ladao😝😂 totally loved ur character😅😂❤", "mani.kotte_40": "👏👏", "sanky.g": "@reallyswara I fell in love with Bindiya... Same like Kundan for Zoya", "dabhadevijay": "Zau de", "_avinasharma_": "I loved ur role @reallyswara ..#Bindiya u killed it with Ur acting skills ..felt the character completely I look forward to Ur work", "so.nal6141": "I love this movie", "__devilnikhil__": "maine aaj bhi yhi movie dekhi hai", "swetang__": "♥️♥️🌟", "iamshah___007": "i watch this movie more than 10 times super movie the character of bindiya outstanding 👌role", "gaurav_singhn_official": "New Film hai kya Swara ji?", "siddharth_jain_1109": "Ek pic... Zoya Maregi na..kundan ki Shadi mjhse hogi na...👌👌", "mpushpal": "Changed our life also.....top on list of my films...u r incredible in this movie....tum Tak tum tak", "kartikjoshii": "In the world full of zoyas be someone's bindiya @reallyswara", "ommchaturvedi": "❤️❤️❤️❤️❤️", "swapnilgajghate": "@reallyswara Beautiful 🥰", "9tees_kid": "Still one of my fav mam @reallyswara @dhanushkraja", "udaysingh5894": "@reallyswara ji aap apni bag me Condoms rakhte ho ya nahi qki kabhi hum kai mil Gaye to❤️ I love you soa much", "aarav_badgotiya": "##my best movie all songs of the movie my favrt all.......... Thaaht pe thaaht banarasiyaaa", "iamre_han": "One of the best movie @reallyswara 👏", "parvesh_dhore": "😍😍 my fav girl", "iam.zevey": "Fav movie and loved your Supporting Character ❤️❤️👌", "jigs4915": "N still love this movie 💞❤️💝", "komal_m_verma": "one f d best movie 😍😍😍👌", "prakhardg": "Best scene with that cow! 😅", "keertiaanvi203": "This is the only film I am in love with u ur skill...u r gem..I mean so natural u r...", "splendid_sue": "We loved Bindiya in Raajhnaa ❤️", "rahul_suryavanshi_23": "💕💕", "chetu1212": "All time favorite movie! Loved your acting ❤️🔥", "nandanasaikia": "You were the best character in this movie tbh", "thediptijain": "I always love this movie because your character is me in real life... Amo amo", "tanupriya09": "This movie ❤️👌", "navinsrivastava40": "Anti national", "mr_anonymous1995": "Ye banaras hai yaha sab apna sa lagta hai 🤩❤️😍@reallyswara", "abhilash_ramteke": "💕💕💕💕💕💕💕💕", "shruthipady": "Six years to my husband wanting to name his daughter Swara after watching you in this film! And he did, our no2 is Swara! 😁", "pawan.mpharmacy2017": "Please dont see the movie of Swara, because usse kamaya paisa Deshdroiyo ko fayda pahuchega", "avinashchaubey16": "❤️", "eatexploreread": "You look pretty in the movie swara but I am sorry to say the film glorified stalking", "jaiswal.sidharth": "hindu nagri hai ye..", "iprimadsouza": "@reallyswara Like hell ur were ♥️ THE best in this movie!! totally connected with ur role!! 😍", "kundankks768": "For this movie I started loving u but u join tukre tukre gang I started hating u , do good for country and it's culture and avoid tukre tukre gang", "anil20zen": "😘😘", "nups1802": "😘", "__the__infinite__": "Awesome movie bindiya ♥️😍", "amitkumarsingh5776": "One of the best movie and your acting is so good", "ashtheduke": "I love this movie it made me cry @reallyswara", "that.cool_guy": "Dekhte dekhte 6 years hogya yaar lag to rha tha kuch din pehle hi release hua tha its all fresh even today❤️❤️", "jiteshravariya": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "mahi.k.verma": "One of the best movie 👑....", "rituraj366": "Aap Congress ke sath wahi krti rahe gyi", "sibi_joseph": "Bindyaa 😍😍", "aafreen_khan30": "Awesom character 😘❤️ well performed & dialogues delivery was spellbound 🤗", "_kaam_2525": "Favt raanjhanaa ❤", "iam_ramankaur": "Loved u in this❤️", "__shrutianand___": "❤️❤️", "_kalamkhan": "Best Movie Ever", "shubhangiiahuja": "I loved the film! Great work Swara!", "shelkekomal": "🥰🥰🥰🥰", "bips__rcm": "Loved every bit of you in the movie. 💕You were brilliant!", "nswarupa": "U did a fabulous job in this movie Swara. Really appreciate", "poojanikhilsood": "My favorite movie", "_aniketmaurya1532": "Love❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️ bindiya kundan ko badhae❤️❤️", "abucgartist": "And still one of the best indian movie😊 @reallyswara brilliant acting m big big fan of yours😊 thank you so much for such a wonderful movie😁", "saaraswat.aditi22": "I live in varanasi .I met dhanush sir at the time of shoot. I love this movie and u swara ji U killed it and also murari bhaiya even sare song aaah much love ❤️ one of my most fav. Film.@reallyswara", "shop_affo": "You were so cute in this.", "rdeep22g": "🙌🏻", "objection__my_lord": "Best film❤️❤️❤️ which really touched my heart...never ever seen a movie which has everything ❤️❤️ loved ur acting n loved everything ❤️ watched again n again n still a fan 😍", "somysaini245": ",mne pehli baar ..yhi movie deki thi cinema ghr m💝💝😍😍", "sujit1615": "My favorite movie 😍😘", "krutika.91": "@reallyswara indeed its true, and you became my favourite actress after this movie, to be truthful i had my eyes all on you only during the whole movie as i just loved your character.", "krishna__2401": "And swara mam acting gau mata ki kasam fan ho gae aapke..!", "steffidias": "I will always remember your Tanu weds Manu character more", "amarpositive": "Superb mind blowing acting skills... 👌👌", "eswar_17_": "Semma padam", "impsr55": "My best film ever", "gulahmad007": "That time was good swara", "vinamra_ghildiyal": "That was the best time @reallyswara ! You acted well during those days and were non political ! Dunno what happened to you now?", "ok_sarthakmishra": "Banaras ka Matlab hi raanjhana hai. ❤️ Kundan aur murari ka shehar. 💕", "hedonist_biraj": "You were/are superb", "bhavnagarg90": "Raanjhana is LOVE! All time favourite ❤️", "osho__creative": "Great work", "dogra_ajay": "💓", "meet_parmaar": "Love love love 😍", "gur_jant_22": "ਬਾਲੀ ਨਜੈਜ ਸੀ ਆਹ ਤਾਂ", "mera._nazariya": "One of the best movies I have ever seen.@reallyswara Keep doing the great work in movies and politics", "jackson_is_here_and_u": "I watched this movie 400 times", "anurags3020": "Ranjhana hua Mai Tera koun Tere bin Mera 😍", "swamiraj2021": "Kashi banaras ye jagah tere liye sahi nahi hai. Tu to bankok pataya ja vaha par ghante ke hisab se paise milte hai aur vaha tu bhi khush aur ham bhi khush kyon ki vaha hame koyi nahi janta.", "deepaksingh2015": "One of my favourite movie ever 👍🏻👍🏻", "gurpal1994": "❤️", "manavhg": "@vish_vaah ❤️❤️", "zinroshan": "❤️ I just Love this movie and your किरदार! ❤️ Superb you are as always!!!💜", "itssavishek": "Zoya maregi naaa 🤣😂😂😂🤣🤣🤣🤣", "rry045": "🐒@reallyswara", "hutiyapa_society": "Only one thing which i love of you #raanjhana😍😀", "nav_mhy": "❤️❤️", "iam_smile707": "Fav 😘 @reallyswara", "thepalaceofillusions": "Bindiya. <3", "shiva_the_saffron_activist_999": "®@πdi suara😍", "suraj_kumar_vishwakarma_108": "कब से", "tulikap07": "You were so good in this role!", "mahi07692": "i have watched this movie 5-6 times, still best 👌", "instabhi1": "Bahut sundar hain aap", "theconsocius": "Bindiya 😍", "senkavi12": "We loved this movie n each actor is awsm 😍 .watch every tim comes on TV .😍😍", "artsyponnu": "❤️", "rangesh_s": "Matlab sonam kapoor ne post share kara to tujhe bhi karna hai.... Chaahe kitni hi ghatia actor ho dono", "vivekgaikwad96k": "♥️😍", "sye6404": "And ..my.. Fvrt...movie..can watch.. anytym..❤️❤️", "a_swaminathan": "I feel wonder why swara not following richa chadda ,and richa not following swara , both r extreme feminists....", "diksha_shrivas": "Lovely place..lovely year nd people .and ..movie b .6 year ego ki ..Memory meri b tazi ho gyi ...❤️❤️❤️ @reallyswara ..", "suvra19": "@mandalaofsurvival - all of you.This character was all of you on the screen.", "bordoloi_h_m": "This movie is ❤️", "manish_._verma": "“Mera kundan khoon nahi thokta”", "kriti_kartikeya": "Di ap bahut beautiful ho😍", "apeksha.pudipeddi": "@prakkumar2795 ‘Vitaaamin humse khao. Aur aashiqui inse ladao. 180 rupaye kilo hain!!’ 😂😂", "shantnu_19": "sunne hai panditji ka ladka randuaa nikla.", "fidato_94": "❤️", "sreenu_a": "I felt your are going be in greater heights of life in that moment✨👏", "mani_kashnia": "Favourite", "skarthikchandra": "❤️", "samajwadi_bhai": "कमाल था💞 पूरी कहानी आज भी जुबा पर याद है ।। मजा आया बहुत", "gaz_me_sidd": "Vitamin hamso khao aur aashiqi ense ladao 😂😂❤️", "parijat_tiwari24": "Loved this movie and your character ❤️", "saloni__mallik": "Favourite!!!!! ❤️❤️❤️❤️", "heisenberg.08": "😍😍😘", "mohd.shahbaz68": "Superbbb movie ever . ❤️❤️", "scharada_d": "Really loved you in this one!", "kookie_backpacker": "My favorite I don't think anyone have seen this movie more than me over here! @reallyswara mam true fan of yours!", "nikyrajputana": "Har har Mahadev", "lovely_couple_pic_videos": "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡🧡💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💚💚💚💚💚💚💚💚💚💚💚💚💚💚💚💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💕💕💕💕💕💕💕💕💕💕💕💕💕💕💕💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💓💓💓💓💓💓💓💓💓💓💓💓💓💓💓💗💗💗💗💗💗💗💗💗💗💗💗💗💗💗💖💖💖💖💖💖💖💖💖💖💖💖💖💖💖💘💘💘💘💘💘💘💘💘💘💘💘💘💘💘💝💝💝💝💝💝💝💝💝💝💝💝💝💝💝", "the_skygazer_": "🙌🙌🙌🙌🙌", "tarunxkaushik": "❤️❤️fav", "reshu.fit": "This movie is still my favorite 🌸💜💫", "imran_ansary": "bindiya ❤️", "medico_yal": "Aye i love this secne zoya margi na🤣🤣🤣🤣🤣🤣🤣 @reallyswara your too good❤️", "aprilerste": "Banarasiya..", "anuragbawaskar_music": "One of the bestest movie @reallyswara", "vishwakarmapoornima36": "💓👌", "richagoyal15": "You were incredible in that movie😇 all the best👍", "rv.cheers": "💞💞💞💞खूबसूरत💞💞💞", "krupa4269": "Bholenath ki kasam, still can't forgot bindiya zoya nd kundan still the credit goes to you @reallyswara as bindiya, such an epic role... Loving it since last 6 years... #tumtak..", "pratik_ghodmore": "Modi modi modi💚", "vaishalee.m": "💙", "rishi.udeshi": "@reallyswara u were really brilliant in the movie. One of the finest and intelligent actress's in the Indian movie fraternity.. Keep shining ☺️", "rajeevverma5156": "Ekdam bakwas acting ki thi tum is pictures me😱", "saurav_bb": "Ur act excellent", "tonykamlesh91": "@reallyswara I love you so much #bindiya 😘 Kundan ke payjame ka nada itna bhi dheela nhi h Bindiya, jo tere blouse ke 2 button par Khul jaaye. @dhanushkraja 🔥", "roshh83": "@reallyswara Amazing work done", "dibesh14": "One of my fav movies", "thesupernveen": "❤️😚", "kuldeep_tathode": "Something's to appreciate you..... awesome film..and very good acting by you also....", "faiza_rajput7": "one of the best movieeee 💕 ive ever seen", "minarsandpa": "One of my favorite", "1nnocent.girl_": "👌👌👌👌", "kajal_chan07": "I loved you in this movie...😘😍", "pallu_pulse_25_07_sunnychristi": "My 1st favorite movie, is film ke baad me Swara ka fan ho gaya. Lv u Swara Bhasker", "the_aftabalam": "इस फ़िल्म में आप की एक्टिंग कातिलाना💕💕", "kaushal_doodle": "And you are still my favourite character form this film 😊 Bindiya 😁", "kiyara_sheth": "One of mh fav movie of urs... 😍😍😍😘😘😘", "bhupendra_singh20": "Ek post toh dal deti besharm Twinkle par aapke wali double standard wali charas hamko bhi chahiye madamji", "kingsz_official": "Amazing movie...👌👌", "beretta911": "I was just thinking about watching this again tonight 👍", "style_it_with_nk": "You did an amazing job in the movie 😘", "girish.gk2201": "Aaja Aaja Dil K Gaon ❤️ #awesomemovie @reallyswara", "rich_verm": "Loved ur character ❤", "_tiwari_rishabh_": "👍my fav movie", "prathamesh.wavdhane": "Librando", "jitulal_0022": "❤️", "amitsuman1992": "@reallyswara You were Enormously Droolworthy in this Role and Movie. Saw this movie 68 times.❤️❤️", "mohdfaheemnsr16": "I love this movie", "zarxshaikh": "Favvv❤️❤️😭😭❤️", "zubairahmad698": "peace mercy and blessings of Almighty Allah on you sister", "karthikrobben": "I always Love Bindhya than Zoya :)", "prudhvi.kodali": "Superb role", "iemsangeeta": "Love this movie and all the actors in it. Beautiful songs too.", "khushii__143": "Pure beauty💕", "sabir_gouri": "Bindiya pr to apna pahle se hi crush hai 😍😍😍😍 ,", "theharshraval": "❤️❤️❤️", "smily.sahi": "It was a fabulous movie for sure! I love every character of it. ❤❤❤❤❤❤❤❤❤ So much love to you ma'am 🙂🌸"}