{"vishalidiotarmstrong": "Oi...Kaisa laga election ka result???😂😂😂", "aliibaabaa3268": "🙌", "sugandhsharma536": "Wow or kis kis m equality laogi....", "itssamisworld": "And u think a condom company can solve this problem? Actualy problem lies with ur partner,Check with him first.😂😂", "priancasamant48": "dekho isne mere jaisa pehna h vo brown wala @moni.kapoor5", "4.k.1.b": "Fuck offf", "itsmeridhima": "@jerry_rishhhhhh yahi dress li thi humne see", "vrtsng": "30 crore logon ko raat ka khana nai milta...bhuke ao jaate hain....plz unke liye bhi do shabad bol lo ek baar", "sunidhi2627": "Tmko milta h orgasm while sex then fuck off", "sheikh_hamna_hasan": "🤗🤗", "nicolumens": "Because your men don't know how to f**k.. that's why when y'all move to north America, you date us 😎", "rahul_prajapati01": "Tu to sahi se chudti hai na... That's enough chudakkad", "arsh_a_to_z": "Hi Doctor", "riya.malhotra.733": "Kuch bhi bas bolna hai", "ro_man9956": "KYUN GENDER EQUALITY KAISE.TERE JAISE BAHUT HAIN APNE AAP KO DEKH LE DUREX KI MARKET KHATAM AB SE.DHANG KI MODEL CHOOSE KAR LETE.YE MOHTARMA KI SAKAL TO BANDAR KE PICHWADE JAISE LAG RAHI HAI🙌🙌🙌🙌🙌👏👏", "vaibhavshambharka": "Very nice 👌 myam", "__mr____manhas": "Kuch vi mtlb", "i_am_hem003": "😂😂😂😂😂😂😂😂😂", "jerin_mv": "In this case female should communicate with her partner& More participation also required. Anyway its should be discussed", "_bellaa._._": "bs yhi reh gya tha ab dkhne k lie @kashishkay #OrgasmInequality😂", "jst_in93": "fuck off", "shubh9161": "Mam aap ke pass kuch dhang ki cheeji hai baat krne ke liye.....ya phir lime light mein aane ke taarika hai sirf .......pehle basic enqualities pr baat kr lijiye...ho sake to kuch kijiye bhi", "muhd_sabid": "Go bold", "pramodkldkumar": "Khud hi le le apni dono taraf se .if you don't feel orgasm equality .", "biju_shadow": "I think the mentality of women has to change, they have to be more liberal like men. Show sportsmanship in sex, be a racing horse victory will be yours", "melbin_philip": "Good that someone had to raise it to create awareness. This is more of understanding that helps both genders in the aforesaid topic. Also would like to ask the brand how come you arrived at the 70% cacls? How do they done the survey samples all these matters. At least it might opens some eyes lol 😉😉😉", "akki8rules": "@reallyswara aaj kanaiyha khasam kaha a tera🤣", "__nasi_46__": "Kashtam", "yash_kumar_22": "Khira 20 rupe kilo Gajar 30 rupe kilo 😂🤣🤣😂", "zayngigi_fc": "Paise kei liye yeh log kuch bhi bol sakte hai", "kshitija_joshi_97": "F. .4ql", "1nikkyjha": "Reservation system, dowry , health issue and many more they are no issue , Now the biggest issue and need inequality in India for orgasm #dear swara You need to die now .....kindly stop cheap publicity stunt", "savyapuri": "Men definitely need to reshape themselves from taker to giver and putting the women's needs first. 👏", "sumitmlearning": "Kanhiya ko bula lo vo aazadi dega tumko gandi aurat", "ishanisharma123": "♥️", "pratik_kantode_5th": "Don't judge for this but paid sex is best of all time..", "ansh1293": "Lulli leke so jao, gangbang karlo taxi wale ka drive lelo, jaise orgasm chahiye vaise kar lo, nhi to vire di wedding me ungli wala jo kam kiya tha wahi kar lo,", "musth_fikar": "I Wil always think to satisfy first a women..I mean in future.... This pressure you have to think plz don't be funny she explained true.. Many aunties are facing but how could they explain kept silent", "khare.hitesh91": "If it is so what will durex india do, to overcome this. If you want to endorce condom product dont take the cover of false datum. And with how many men you have sex to reach this conclusion. Ultimately you need a man for orgasm.", "chethansajan": "So sad 😢", "ashifalban": "സ്വര ഭാസ്കർ നിങ്ങൾക് തെറ്റി അതൊക്കെ പണ്ട് ഇപ്പൊ ഫുൾ സെറ്റ് ആണ്", "ajishdivakaran": "❤️", "raheesraz9003": "😍", "ritwik_vats": "Aagya Modi madem😂", "adv.vivek_garg": "reallyswara...Lets we both have Sex..I can claim you will continue to do till you will not feel #Orgasm_Equality....Otherwise #आया_तो_मोदी_ही 😂😂😂😂😂", "akash.nikku.chahal": "O yrrr. Why are you interested in someone's personal life? Everyone has their own wish that they do anything. And how to do it, let's do it. Gys. Change your think. Someone how do it. Hhhan. Do itttttt. Its life. Life is so short story so injoy yrrr.", "me.rry5499": "Hahahahaha ye pure india ka bojh leke chal rhi h ghtiya aurat .. tu kitni vehli hai re swara ... election khtm how to come to footage back good job jobless lady but really bht beshrm h tu manna pdega you are enough for yourself ladies can tell these things to their partner social media ki gnda mt kr gndi aurat", "ma.noj9352": "Beautiful", "realartor": "only u can do it 🙌...i wish one day i will be that confident", "jugnichori": "@mirchi_rj_vashishth", "gauravpatni": "Go to south african...u realli need that", "vivxone_vivek": "If u r not getting Orgasm , JOIN as a PORNSTAR , and talk to #sunnyleone", "bolo_annpurna": "@verma_ankur0512", "shapath_09": "apne muh mei dal de durex ...kyunki jab tu bakti hai tab is desh ko hep c honey k chances zyada ho jate hai....our country need protection from ur filthy cum getting out of ur HIV positive mouth", "wsecrets__": "Check ur dm @reallyswara", "anamfatima327": "@sarasohail49", "sinha_ji111": "उंगलियां कैसी है आपकी?", "bollywoodwikipedia1": "@reallyswara अच्छा विषय है फ्री में पब्लिसिटी के लिए, आज हेडलाइन्स में थी तुम। अब अगला विषय क्या होगा ?", "terminated_body": "Ab choot me gazar mooli daalkar uska bhosda pehle hi bana legi to organsm kaha se aayega?", "sadistic_enough": "Thanx for saying this", "imsanchitgote": "There are more important things to talk about rather than physical pleasure in this country..can we talk about it mam? Please 🙏", "imshivanitanwar": "Fuck you bitch...", "suryasnatabehera": "Why don't you just raise ur voice about some major issues in India.. Instead of these stupid topics.. 👎👎👎👎", "iam.vickyjain": "एक बार सनी लियोनी ओर एकता कपूर से मिल लो शायद कोई गंदी फ़िल्म आफर कर दे ( पैसा कमाओ इज़्ज़त तो आती जाती रहती है", "aadi.max": "Good Afternoon Mam how are you", "siiddique": "Comments pe bhee ek survey Kar sakte hn ...our people r literally horney but. Science is different", "paramramani": "Swara Bhaskar's fake feminism narrative - https://www.youtube.com/watch?v=ZUgK9O4cvIw&feature=share&fbclid=IwAR16SFzm9HeEKysEWrVzfbmuECvSMVpFcb7SAD_nbZAyrZ44lD7LiRR2_f0", "farm_foody": "Buy a good vibrator men are not sexual object", "deathzoneraaz": "Ab Kanhaiya Kumar tumhe argasm nahi dila pata to aao mere paas...meri haveli pe.", "swainranjeet": "Kanhaiya ji is my hero and u swara bhaskar ji is also my fav..i think now india is going to be devasted by the dirty politics of bjp..n some chamcho also", "pkpmishra444": "AAP dharna kyu nahi deti parliament ke samne ye modi bhi na sabko Vivekananda Bana kar chorega I fully support you", "theravindraattry": "@mirzasaniar medam....ise bhi like kar do", "kartikay_the_fitness_monk": "Communal bitch", "idea_of_indiaaa": "@reallyswara I love you❤️", "deshvaibhav": "Panuti", "vishal_2720": "Agar ab male ka orgasm hua aur female ka nhi hua to female ko ladai karni chahiye ki nhi mujhe orgasm karao nhi to sone nhi dungi.. Wah.. Tere jaiso ke hath me desh de diya to pata nhi tu kya kar baithegi.. Tujhe to orgasm lena aata hai na with the help of ur fingers so keep it up..", "divyaunny": "So cute ya you are. ❤️ i stand for this, No Orgasm Inequality.", "rajeevverma5156": "Tum ko yhi sub Gandi bat krni rehti hai aur koi kam nhi rehta hai kya 😱", "vishal.nahar83": "I m proud ##### my girl always gets it first by me then I get it💦💦😍😍😀😀##### Lv is the best felling 💋💋##### First get it for ur gurl and then c the changes in ur life 😘😘😘💃🏼💃🏼💃🏼💃🏼💃🏼##### Life would be awesome", "amdipanjan": "Durex has taken the responsibility of spreading awareness of this form of inequality just by giving statistics but the reliability of this stats is never questioned. To resolve this issue, they may start promoting toys with their brand, educating the guys about different degrees of O and it's influencers. So is it the time to change the path from family planning to empowering women with relatively higher degree of O and eradicating inequality of this nature?", "pinkysangaraju": "It's true.", "iamnitin_garg": "Swara Bhaskar Orgasm ke naam par mahilaon ko bhadkane ka kaam kar rahi hai. In TV walo ki wajah se hi aajkal logo ke rishte jyada lambe samay tak nahi tik paate. Swara bataye kya Orgasm ke liye Bhartiya Naari Machinery ki aadi ho jaye ya extra Marital affairs shuru karde ya ise pane ke liye pagal ho jaye? Mental satisfaction is required or Sexual Satisfaction?", "sachinthakur000": "@reallyswara ... jo gandagi movie or Twitter par failati ho us se achchha porn join kyo ni kar leti...", "rakesh_2707": "Agree.... actually most of men become self centred at the time of sex....", "inamdar100": "swara i,ll support u bindass girl..", "onlysujju42": "When swar bhaskar 👂3 magical words.. Me Narendra damodardas modi....... Swara bhaskar -omg I'm cumming... ☝️☝️😂😂😂", "sanjeev93342": "देश को अभिनेता या अभिनेत्री नही चलाते जनता सभी को चलाती है", "onenonly_natasha": "U go girl...", "apeksha_bhatia": "💖", "harmeet.sehgal": "You have to come up with the solution as well 🤪 not just reminding us the misery 🥴", "shamimzhcdu": "🌹", "gautam.goti": "Ur nonsense and idiot, u should go to mental hospital", "be___pro": "This coming from a Country which gave the World Kamasutra. Sex is Taboo in modern India and Ancient Indians dedicated Temple art on it. Need more talk.", "shayri_dil_se11": "Wow cool post thanks for sharing", "medulla9": "What about u dear @reallyswara ? Is it that ur facing this problem. Anyhow well done", "0shin_singh": "@reallyswara I expect atleast ur opinion in reply, bcoz for me before a celebrity u r a person who is concerned and taking initiatives.. So let me know if i need to change my mind or i am right.. Warna it will be unfortunately aise lagega ki kuch tha nhi toh social attention ke liye post kr diya.. Right.. ? I know its nt true..! So do reply.", "swastichatterjee": "❤️ more power to you", "harshit_chauhan.messi": "Where's your husband kanhaiya 😀😀", "rohanaps": "Why don't you do something about pay inequality in Bollywood.. Why don't you echo what Kangana is saying.. Why don't you protest against nepotism and inequality from star children in Bollywood... Oh उसके पैसे durex नहीं देगा... What a top level hypocrite..", "nikyrajputana": "हर हर मोदी", "safe_faruk": "Your voice speaking to attract listen🤗", "bharatcharan5": "You are bullshit swara this is your business please don't interfere in politics ...", "shwetaforfun": "😍😍❤️❤️", "abhishek.vashishtha7": "Shame on you urban naxalatise", "sunil_ty_67": "Beautiful", "__beinganmol__": "Kisne ruka hai jo marze vo karo india me karne bolne sb chizz ke freedom hai", "l_scoobie_doobie_l": "KK ne diya tha kya", "yashi_baby22": "😯😯did u just said it!!", "rahulmahajan20": "Modi he aaya", "kamleshkumar2837": "Seeking publicity by indulging in nonsense..", "aarav_ksyap": "It'll be hypocritical to say it's the mistake of only one gender, where men do so much effort to satisfy themselves women mostly want the men to take the charge and do things. Can be a probable reason cuz some women do active participation in the things and they don't face such problems up-to that extend probably....thats not the problem the problem comes in when our male society which is so influenced with patriarchy don't let the girl do things on bed and want them to act as a sex doll. #lackofgendernutralityistheproblem", "krishna_sagar96": "Congress ka pass hoga ja ka la la😂😂", "gaya.mas": "👏👏👏", "shivzzz_raw": "Raajneeti ho ya Social tumhre muh se gandagi hi nikalti h", "the_vishal_prakash": "Yeh to kabhi socha hi nahi maine", "bhartisahai": "@harpreetvats", "rajkumarofindia": "U are a piece of shit aren't u? Juz go to hell.", "suldeth13": "Looking very pretty", "chouhanabid": "❤️❤️❤️❤️", "rajiv_fuhrer": "Yes ,husband should be mature enough to understand it. Then only orgasm inequality can be reduced...", "sidyakama": "really?????? i mean really????? 😂😂😂😂", "raghavannarayanan_": "Ms Swarabhaskar : Your acting was good in the films you have added and definitely you coming and doing propaganda for orgasms is really a awareness?a message? Or what? Due you really think singles like me when we see this how we feel .. Virgin boys 🤦🏻‍♂️🤦🏻‍♂️", "the_assamese_bong": "You can realise after going through the comments why bjp came back.....", "stephen_for_a_change": "Great swara bold enough", "ykhanna022": "Seriously this is what gender equality is ?? You guys are destroying what 1st wave and 2nd wave true feminists did . people like you have never read a single book and come up with fb statistics ... Semi literates", "_adarsh_menon_": "What orgasm inequality????!!!!!! Is this a real thing..... Women could ask to go on instead of faking it. If your guy really cares about you he would.", "abhuvan26": "Love you for just everything !", "_rathoresahb_": "Behn ki lodi..kuch aur v kr liya kar na", "ashish_kapasi": "Tu mujhe kaha mil sakti hai akele main?", "subhashdebbarma": "nice....", "ashishsainichandigarh": "Tera fufaa jeet gaya", "amitsingh950": "Aaya to. Modi h madem", "abiratminocha": "U said it girl....kudos", "priojitkeisam": "Aunty pagla gayi he", "azizurabdulrahim": "I am laughing for five minutes after watching this video madam how you get these different concept 😂😂😂 all you need is a man with good stamina or a bottle of shilajit for your husband 😂😂😂 but really hats offf👏👏 i never saw a women who talked so openly about it", "bp_under_review": "I agree ❣️", "piyali_halder12": "Just shut up ghatiya aurat kitna niche giregi saali kutti kahiki ......", "ritikaprashantchauhan": "Wo sab toh theek hai... Par in comments me Modi modi modi kyu kar re hai🤣🤣🤣", "being_abhishek_kapoor": "Jab Films nahi milti toh...timepass ke liye kuch toh chahiye😂😂😂", "naresh_vashishth": "Kanhaiya Kumar ka kya hua", "imanspeaks": "The kind of sick comments here is crazy n it can be seen that men have a problem with women talking about orgasm also, women are very much capable of pleasuring themselves and for that too they don’t need a man , also whether is periods, abortion ,sex or consent it is a woman’s body so only a woman can decide & the sheer lack of words goes to show Swara that ur trolls are highly uneducated ,kam se kam padhai toh kar lo trolls!", "manisha_singh_1210": "U r wierd", "pranay4u": "This hypocrite woman is reported all comments which are against her and she call herself a so called 'troll hunter'🤣 lame!", "rohan__jaiswal": "With you", "sushrutness": "This talk is so fucking unIndian !!", "akanksha010": "My father was sitting beside me 😂😂😂😂😂😂😂", "pr7_kvs": "Some illiterates have already started “thanks for raising”.. lol.. indians do get carried away easily.. and u blame ur husbands for that.. 👏🏻👏🏻 i pity ppl", "priyankabose20\nVerified": "Verified", "lafaz_20": "❤️❤️", "spsatapathy007": "Sickualar", "rohit1904_": "@komal_varsha", "desistupides": "Abhi Twitter par rt kiya toh tha 😁", "freedam_filter": "Hello beautiful swara can you speak in Hindi", "mr._pravinkumar_rajadhyaksha": "🔥🔥🔥", "dev_sam_": "😙", "phalswal.manish": "New Gyan after giving Gyan in indian politics.all your urban naxal friends are history now,plz don’t preach new Gyan anymore.", "shahidsyed848": "❤️ u baby", "i_m_sams": "How this problem showed up with such horny population...", "shivika_sharman_gupta": "@vasusharma29 oh!!! This is what Rakhi Sawant was about .. it’s not about the politics .. sorry my bad. I stand korrected", "shingh_0": "Aap bohoth badi politician ho aap movie me me time west math karo jao aur kisiko harake aao😂😂😂", "m4maheshmicheal": "🍧🍧🍧🍧", "heondavinder": "अति सुन्दर", "kamleshbhandekar01": "Khoobsoorat ho tum kisi phool ki tarha Aankhe hai Tumhari kisi hirni ki tarha chahak hai tum main kisi chidaye ki tarha humari to bus yahi Dua hai Muskurati rahe Tumhari har ek adaa", "asluwf": "Agreed.. it shouldn’t be a one man show and should always discuss the sex with partner. I am really doubt that India men really have any idea about women orgasm to satisfy them and that is where start the failure.. good feedback for men...", "saheryar_fanpage_": "Follow me", "the_caped_crusader____": "@_x_caliber_____", "_hitesh__sharma": "Respect to the remaining 30%", "s1_pink": "Hey how u feel MODI AAGYA😁😁😁😁😁😁😁😁😁", "_rahulsharma18": "Sabhi ko hara ke tu yeh kuch karne lagi aab😂😂", "smeer10111": "but i have seen u getting orgasm using your finger", "amit7872": "women empowerment ka mtlb tere liye yhi sb hota hai kya...iske aage nhi soch paati...aur tujhe itni chinta hai to ja tu sbka orgasm krwa....nalli aurat", "vicky.plz": "@prophishing i think gov must ban these 3 min men....🤣", "saurabh_bhadoriya": "..", "shorty_of_the_town": "@the_artmann Thank you.", "rohitme77": "Tumko kya tension hai ungli ka sahara lena toh India ko sikha hi diya hai tumne sabko", "mr.nik__t": "Tujse to acchi rakhi sabant. Kum se kum desh hit mai to rehti h ,🤣🤣🤣🇮🇳", "iam_s0nu": "@durex.india ab kya Lola bhi nikaloge market mein ?", "blosombabez": "Masturbating expert @reallyswara is perfect ambassador for @durex.india 🤭", "miss_raghvi": "@fs0.1 @avanisonii kya bolte bachi!!!", "jitendra.karki7": "Wo sab to theek h par modi ji ka fault h ye btana to bhul gye aap.", "m_adil_h": "I like your expression when you talk", "neel_s26": "Itna daru, cigarette , tension me orgasm kaise hoga. Vaise yeh survey kya Delhi ki kisi club me 10 ladies me hua?? Next election me yeh mudda uthna chahiye.", "nikkytyagi": "Modi agya mam", "sunil.2949": "तू सेक्स की मारी तुझे तो सारा दिन यही काम है", "neel_2357": "That's why I am telling you FINGERING IS NOT ACTING. 😒😒😒🔥", "dhamu_hadda": "मेम 2024 आएगा तो मोदी ही", "advhitender": "@reallyswara I am happy to see that someone from women section has come forward to raise this issue. Well this topic needs high level of understanding which our country unfortunately is missing at this moment. We don't have time to come out of God's and Lords leave aside science and social science.", "aadii._.is._.here": "Jo jo gali de rhe hai isse uske liy.... Sare chutiye log tum koi ludo khel ke paida nhi hue ho jo iss baat ke liy itna suna rhe ho isse... 😂😂", "baidehid": "@rohinisarkar best movement ever ❤️", "____apps___": "u should promote viagra now instead of tukde tukde gang..", "nadeem_kasim": "Hot swara", "pokhraj.roy": "@reallyswara ‘Lust Stories’ opened my eyes to see inequality of all kinds.", "phildunphybro": "😂😂😂😂😂😂😂😂😂 burnol", "its._.shivi": "🙌 thank you ...", "shubham.srivastav.54540": "Mam'm ap mujko bhot achee lgte ho.....😍😍😍", "majidkhan5": "Because Indian women are raped by their own husbands !!! So where will the orgasm come from ?", "vikbits": "Interesting fact out there that needs to be looked into", "mahavirprasadbhardwaj": "आजकल औरते खुलकर बिंदास और सेक्स को उछल उछल कर मजे ले भी रही है और दे भी रही है स्वरा", "sandeepmarwah\nVerified": "Verified", "vinnie_20191": "You are Litt girl.... beyond awesome 🥰🥰🥰", "bg_714": "Where the Indian girls who like white guys🤔", "the_rana_s_": "Farjiiiiiiiiiiuu", "joshi.pp99": "🤞", "m_chitvan": "@reallyswara Thanks for speaking up on this issue, people need to know. You are a great person.", "foot_frame_fotos": "It has to be higher than 70 percent! I wonder what the sample size was 🤔", "banodeishant": "aa gai chutya gaaliya khane ..", "kahani_khor_kkay": "😂😂😂😂😂😂😂😂😂😂", "nazrul7711": "To all the ladies out there i vehemently support this issue 😚😚😚😚", "boby9836": "How can both get simaltaneously?", "anuj_bathri_rajak": "372 seats wali padi likhi kitna gyan da rahi....", "arbazigar1999": "my gf will b my snack 💚", "veeezmay": "Haters can hate as much as they like @reallyswara your a force we need in our industry! cant wait to see u in ur next movie!!!", "avinash_kumar_raja_007": "Kalmuhhhi....", "starcrossed2244": "Having partner who are aware and care about it surely changes the senario...👍", "kaninmeg": "I know very well how to give full orgasm to a woman @reallyswara", "fanatical_wanderer": "Its really sad to see all these mix comments here on your post. And you do not have to enter politics for raising issues. Its a free country and yeah tell these dickheads that because people that till the time you guys have your ass in politics there is absolutely no way we can have a say cause \" India ka culture ni h\"", "niteshkr077": "Aya to modi hi na😅", "aastha_ace": "@sutiwari 🤣", "abekoors": "I don't see what a condom manufacturer can do about this problem. Men need to be more sensitive towards their women partners, and more attentive to the latter's needs during sex.", "vicky_vanjani": "Are you married? Or are you blaming someone or all male genders", "sanjay_pareek3": "Truth???", "throughsubtext": "Oh god that's actually very unfortunate.", "divi11_": "Vibrators might help? @kai_bha", "dj_rocks_89": "All she is telling is to use you finger like she did 🖕😂 @reallyswara she is sick", "roshni_motwanii": "@chandnikourani", "yogesh._.ranjan": "Hey unglibaz....", "aabbheelov": "@reallyswara try me i will give u orgasm", "gaurav9052": "aa gaya na Modi", "rakeshsharma5066": "Modi hai to ye v Mumkin hai Swara jee", "gaurav_pyare": "Kaisi ho deshdrohi gang", "ajayrathore_1": "Aaya toh Modi hi", "viraj9024": "and again coming to the matter... yes we men should equally think for their pleasure...but ayya to modi hi", "ig.king777": "😂😂", "mistiqex": "#Respect", "monikakhanna94": "This is so very true", "planet_green_eyes_attack_u": "U so cute ....and yeah we can always kick them out of bed", "lostinherhopes": "Someone had to say it. Thank you woman. ❤️❤️❤️❤️", "supriyachandra": "@apoorvsemwal", "realo_e": "Go n take a survey in Bollywood married couples", "sumitkumar071090": "👍", "fatboy_705lbs": "👏👏👏👏", "ashwaryacoolest": "सूवरा बस कर💩🤣🤣🤣🤣🤣🤣", "arjunnbunty": "Surreeleee Swaraaaaa💚😍", "iiblowurmindd": "Lol just by looking at the comments i can see how illiterate, naive and horny our population is.", "sohailshaikh635": "🔥🔥🔥", "being_ahmed7": "😍😍😍", "busybaby0007": "Hindi mai samjaoge ? 😶", "patelyash0025": "@reallyswara You just added it by commenting and posting.... Wow, politics has really over your head...", "singhchiranjeev064": "😍😍😍👌🏻👌🏻👌🏻", "patelshera123": "I thought you gonna promote AAP party's products company", "sgtpepperhasarubbersoul": "@kurchika_nath see this", "bhupi_instaoffice": "उंगलियों पर लगा के करने से कोई फायदा नही मैडम", "rafi_sen": "Very commendable and appropriate that @durex.india would get @reallyswara to talk about this topic. More discussions needed to equalise the discussion around female sexuality.", "00__shashi__shekhar__singh__00": "Bs dadi is क्षेत्र me hi gyan dia kro.. Baki politics rhn do... तुम... 🙏🙏🙏", "suhani.si.ladki": "🙌🏼", "arnabmohanty": "Thanks for your suggestion ma'am.. love you always..", "jyotsna_shadesofgrey": "Love Ur work and just everything about you!!", "the_defender7": "#orgasmInequality", "turophile_tibet": "👌👍🙏", "somnath_rk": "Overacting with overspeaking😂", "diwakark111": "You are right", "anamikasharma278": "🔥🔥🔥", "sherlinromi": "Finally someone said it. 🙌🙌", "rangesh_s": "Shut uppp", "reza.ahmad786": "🔥🔥🔥🔥❤️❤️", "saurabh.poddar": "wow what a issue u have raised ? u have so strong political opinion, why not contest a election with this issue ????", "kumarshetty9": "Madarchoth. Saali", "rimi.jab777": "This girl is really awesome.... More power to u....love u...", "nileshshah105": "Khena kya cahti ho😂😂😂😂", "uday.singh.official": "Hey but to be honest it depends on man to man basis..some men r more into giving pleasure to their partner. I don't think then is gender inequality just those 30% r lucky then got the right men . I hope you get the point. Thanx #orgasminequality @reallyswara", "simransandwhoo": "@ramystified @radzilla13", "smiley69lol": "Chal nikal le Abb....... Tere me dum nhi 😂😂😂", "officalhunnysingh": "Hahaa", "liii_03": "So funny orgasm inequality 🤣🤣 swara this is a new one... most Indian women don’t enjoy sex to the fullest.. thanks babe 🙏", "satishrajput72": "Politics krna chod Diya KY mam.apne modi ko congrats Kiya ya nahi", "sushmita_nanda": "That's hilarious 😂", "aelin_106": "I fucking love you lady", "officialraosahab_": "Chal bhag farzi", "now_its_abhi_": "are you going to sell condoms seriously ...", "_s.rawatt_": "@reallyswara When is season3 of its not that simple coming mam??", "ikzoom": "@reallyswara ya it's fact and be a practical thinking👍", "sayonimondal_": "@______.sreyo.______ learn something 😎😎", "happyface1884": "U look gorgeous and fashion forward 🥰❤️", "pawam_soni_chd_01": "U r amazing mam. Much love 😍", "anujsingh_verified": "IAM biggest fan of you reply is bar kar dijiye", "sachinkadam1766": "Lit girl with lit thoughts 🔥", "loveraj9848": "Kanhiya kumar Ka KY haal h this is ur bf u know", "s_jagga33": "😘😘😀😀👌👌", "_milan_009": "Wow looking so pretty charming👌🌹", "jiten_0306": "@reallyswara r u in those 70% ??", "nikhilyellidiyappa": "How we can talk? when we can talk? will talk and have sex or have sex and then talk? how it that? 😍😉", "gangsta_thor": "You are so gorgeous💖 full of life 🍓", "malz3007": "Wow# This is what i have been thinking in 12 years of marriage but couldn't explain to my husband 👏", "love_guru_specialist_907": "काल को भी रोक दे महाकाल ज्योतिष संस्था.! !एक कॉल आपका जीवन बदल सकता है. Call new+91-72=96=99=32=51. (#)31_TIMES_GOLDMEDLIST_ASTROLOGER)) स्पेशलिस्ट - मनचाहा प्यार, लव मैरिज, किया कराया, पति- पत्नी अनबन, संतान सुख, कारोबार, धन लक्ष्मी प्राप्ति, वशीकरण के लिए सर्वश्रेष्ठ बाबा जी अपने दुश्मन से तुरंत छुटकारा पाएं # Note - R.B.B.S. द्वारा मान्यता प्राप्त। @📞📞📞+91-(72)(96)(99)(32)(51)", "sufyankhan002": "💓", "divyangada": "wt ur opinion", "honeysingh555598": "Att", "mr_kk_chauhan_": "👌👌👌"}