{"gaur_anshuman": "Dub k marja", "dsouza327": "Swara I m glad u broke up vt that old man bf u vl get nice young bf,cheers!u r beautiful n sexy don't b depressed ok", "rahul_r.s": "Itna sawal krti hai na main sunta nhi @reallyswara", "varpingle1": "Neva river", "rishikejariwal": "How come you went to Russia if you didn’t have a passport? Still have no documents?", "shubht2511": "Didi jo passport dikha k yha gai ho na whi hindustan m dikha dogi to koi dikkat nhi h aaram se rehne denge hamare @narendramodi ji or @amitshahofficial ji ✌", "gunjan.g2510": "Passport kidar hai???😆😆", "dv_shah": "Passport mil gaya kya?", "ab_ankit_bhati_": "If You Don't Have any documents, Your Mother really should have to worry about it", "anudeep_tyagi": "Are didi bina passport k bahar kase chle gye tum?Bdi he betichod ho ap toh", "vita.iter": "@reallyswara Didi aapko lagta hai aapke paas documents nahi hai, to aap Bina Passport ke Russia gai kaise? Didi Pls Javab Dena @reallyswara", "awcutedoggo": "How do you travel if you dont have Passport? Aap koi desh ki Queen ho kya?", "ssuman31": "Maim aap ne passport kaise banya ...jab aap ke pass koi I'd hi nahi😂😂😂", "ajinkya_kalshetti": "Tum jese log desh ko Kalank hai... getlostfromindia", "_aavi_8": "@reallyswara aare didi passport kha se aaya .....mtlb aapko log dekh rhe hai kuch seekh rhe h .....km se km jooth to nai bolo .....publicity ke liye kuch bhi 🙌🙌", "ipalash18": "didi bina passport russia? apne agent ka number dena zara.", "ajitdas_1": "Didi pornography join kar liya kya??? But bina passport ke kese gae Russia ... taro ke niche se ya apni black gadhosee ungli karkee... beseram ladki @reallyswara", "khedekar.pratik": "By the way tuze Bhokane📢 ke leye kitane pese deti hay congress..", "itsmani007": "Aise bhi tumhe koi acchi movie to milni nahi hai.", "ashish.kajla": "Don't dare to bark anything about little twinkle u bitch.....u don't have that standard", "bearded_bard19": "Behenchod librandu..... Shame", "karannn_rajput": "madarchod randi udhar hi reee sali randi idhar aaa maat fir see", "arti__2012": "Beautiful😘😘😘😘😘", "abhijeet_singh19": "Looks like Rs. 200 wali paid by @kanhaiyakumar", "kuldyypbisht": "💩💩💩💩", "shubm_nagrare": "Isko koi dhakka de do yahasee😝. Fake Securalrist. Pro Pakistani Flop Actress😝", "puru010": "Okay ma'am aap Pakistan jao @reallyswara", "nibba_14yr_old": "Nikal lavdya phli fursat me nikal", "itsgouravsoni622": "Kya madom congress aa gyi kya 😂😂", "sharifmuzafar_": "nice ❤️❤️❤️❤️❤️❤️", "shambhavisomething": "Beaut.❤", "yasmitasingh1016": "So swara where are your post for twinkle ... Asifa kaa ke liye bhot randi royi th @reallyswara", "pelkrio": "Where are you Prost#tute", "misterwhite39": "Ladki k tukde ko bolte hai DANDI, dhyaan se sun bc, LAKDI k tukde ko bolte hai DANDI, aur tere jaisi dogli feminist ko bolte hai R*%DI", "manoj_upadhye_": "My self Manoj Upadhye I have wonderful comedy stories can u help me meet with Ajay dewagan", "varunkumar28383939": "kutiya aurat", "modi2363": "#Justice___for__twinkle", "sahilthakur1050": "Pakistan chali ja kanhiya Ka Saath chuluu aurat twinkle Hindu aa islye Tumne post nhi Dali", "rishi_suvarnakar": "Hinduhater", "ben87yao": "🖤", "g_manjeet_24": "As asifa was girl the twinkle is also a girl then why this so called difference who only know to spread liberal agenda hat's. To you your thinking now you can't blame Muslim they murdered and sexualy destroyed twinkle come on you badass were are you", "anshikasingh7327": "Laudi", "a.k.s.h.a.t.m.i.s.h.r.a": "@reallyswara madam ji jehar kab khaogi . Poore India Ko aapki maut ka intezar rhega", "mr._rahul_.143": "What about twinkle,. Sali ran.....", "rp3732246": "🖕गाँड़ में डाल लें mc", "pradeep_chaudhary2828": "*(नन्ही ट्विंकल की निर्मम हत्या पर सरकार,समाज को जगाती, दोगलों को धिक्कारती एक आवश्यक कविता)* *रचनाकार-कवि गौरव चौहान इटावा उ प्र* *9557062060* 🔥🔥🔥🔥🔥🔥🔥🔥🔥* *तीन बरस की गुड़िया तिल तिल मरके आखिर चली गयी,* *आज अली के गढ़ में बिटिया राम कृष्ण की छली गयी,* नन्हे नन्हे पंख उखाड़े, मज़हब के मक्कारों ने, देखो कैसे ईद मनाई,दो दो रोज़ेदारों ने, *कोमल अंग काट कर खाये, कुत्तों ने इफ्तारों में,* *नोच कुचल कर लाश फेंक दी रमजानी बाज़ारो में* आस्तीन में खंज़र रखकर कलियों से गुलफाम मिले, हमको देखो कैसे भाई चारे के परिणाम मिले, *आओ थोड़ा शोर मचा लें,हम अपनी लाचारी पे,* *चार दिवस हो हल्ला कर लें,उस ज़ाहिद व्यभिचारी पर,* लेकिन हम कब समझेंगे,मज़हब के कुटिल इरादों को, तहज़ीबें जो सीखा गयी हैं दहशत कत्ल फसादों को, *पूछ रहा हूँ,कहाँ मर गए कठुआ पर रोने वाले,* *शर्मिंदा होने की तख्ती छाती पर ढोने वाले,* बॉलीवुड के बेशर्मो की टोली आखिर कहां गयी, और दोगलों की वो सूरत भोली आखिर कहां गयी, *स्वरा भास्कर कहाँ मर गयी,कहाँ गया वो ददलानी,* *तैमूरी अम्मा गायब है,कहाँ गयी सोनम रानी,* टीवी वाले वो रवीश क्या जीभ कटाने चले गए, डी जे वाले बाबू भी क्या बेस घटाने चले गए, *कहाँ गया बेगूसराय का किशन कन्हैया ढूंढों तो,* *और आसिफा पर रोता वो राहुल भैया ढूंढो तो,* कोई नही मिलेगा,सबने पट्टी आंख लपेटी है, क्योंकि अभागिन ट्विंकल देखो इक हिन्दू की बेटी है, *और किसी हिन्दू की बेटी इसी हश्र को पाएगी,* *अरबी आयत पढ़ के देखो,समझ तुम्हे आ जायेगी,* सोच रहा था योगी जैसा हिन्दू शेर दहाड़ेगा, मोदी अपना जेहादी गुर्गों के जबड़े फाडेगा, *लेकिन ये भी जब्त हो गए वोट बैंक के बक्से में,* *पाकिस्तान नज़र आता है अब भारत के नक्से में,* ईद सवेरे देखो बस में तोड़ फोड़ की जाती है, सड़कों पर होती नमाज़ फिर जाम रोड हो जाती है, *सोच था छुटकारा होगा अब जेहादी रोगी से,* *सन्नाटे की आस नही थी हमको मोदी योगी से,* ये कौमी भेड़िये,बुझेगी इन सबकी ना प्यास कभी, जीत नही पाओगे मोदी इन सबका विश्वास कभी, *ट्विंकल बिटिया चीख रही है,इंसाफी दरबारों में,* *कुछ ऐसा कर दो,भय भर दो इन दुष्टों गद्दारों में,* ऐसी आग लगा दो मोदी इस जेहादी जंगल को, कोई ज़ाहिद आंख उठाकर देख न पाए ट्विंकल को, *वरना यूँ ही सिर्फ आंसुओं से ज़ख्मो को धोएंगे,* *आज किसी ट्विंकल पर,कल सीता गीता पर रौएँगे,* 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 *----------कवि गौरव चौहान(अगर सीने में आक्रोश हो तो कविता को भरपूर शेयर करें,रचनाकार का नाम न हटाएँ)*", "kishan.parghi.77": "hiiii", "rishabh._singh12": "kya kehna chahengi ap ab jab ab placard kaha ha dhongi", "sam_shri_18": "Play card kha h? G**nd m daal liye ho kya 😒😒😒😒 @reallyswara", "iimkrishnasingh": "@reallyswara why u r not saying anything on Aligarh case? Why always there is a double standard from you?", "nes.sanjay": "Librandu and fake faminist...also bakwas look and dirty look😂😂😂😂😂😂", "_rajeev_ranjan_": "Hlooo maam twinkle sharma ke liyea v kuch bol do.. Or apka phir kab aana h begusari(bihar).apka frnd to haar gaya election", "loveislol0": "Payment lene gayi hai 😂😂", "mr_cannibal__": "Russia me bhi l..d khaane chali gayi hai kya yaha tere najayaz bete bhadwagiri kar rahe hai", "star_amit8030": "thu hai tere muh pe kutiya . u r a real bitch kutiya", "radhekrishna472": "Sorry baby twinkle..they don't have time for u...bcoz twinkle tum hindu ho...or yesab faltu logoko bs muslim Ko chatna h..fake publicity k lia", "________shub_hny___": "ऐ मादरचोद स्वरा मेरा लन्ड हिलाने गई है रूसिया मैं या पुतिन का लन्ड लेने गई है रे रंडी पिछली बार कटुवा कांड मैं अपनी गान्ड मरवा मरवा के justice for ashifa कर रही थी ।तो बहनचोद अलीगढ़ वाली बच्ची जो सिर्फ2साल की थी उसके लिए तेरे मु ओर गान्ड कही से भी आवाज नही निकल रही मादरचोद तेरी जैसी रांड दिल्ली और बम्बई की गली गली मैं सिर्फ100-100रुपिया के लिए अपनी गान्ड ओर चुत दोनो को मरवाते ओर फड़वाते घूमती है। अगर मादरचोद तेरे 'इंस्टाग्राम' और tweeter से पोस्ट अपलोड नही हुआ तो तेरी चुत मैं पूरा कश्मीर घुसाड़ देंगे फिर अपनी चुत दिखा कर justice for ashifa चिल्लाते रहेना समझी ना मादरचोद ।।। अगर ये कमेंट पढ़के तू सोच रैली होगी कि इसको केस करके अंदर करवादु तू बहनचोद एक याद रखनेका मेरी । अपुन कट्टर हिन्दू है अगर तू अपुन की बात नही मानी तो तेरे लाऊडे लगा देंगे हम 100करोड़ हिन्दू ।मेरे पीछे हिन्दुओ का हाथ है ये बात अपने कान ओर गान्ड दोनो मैं डालले समझी ना रांड@reallyswara @reallyswara @sonamkapoor @sonamkapoor 🚩🚩🚩🚩", "__the__limelight": "@Reallyswara kha Gye tere wo Sanskaar jo JNU ke Mullo ne sikhaye the....... bolooo....chup kyu ho...#twinklesharma ke case pe ek twitt v nahi....kya hua inn aadarsho ka......#begusarai me ta bade Aadarsh dikha rhi thi.......fool😠", "p_a_n_k_u_u": "🖕🏼", "manas_rastogi_1": "Ab kaha hai tera placard suwarr bhaskar", "mayur_the_kamina": "Chilling 😎✌️", "p_r_i_y_a_rane": "Go to pak n lick them chu", "ayush9392": "Madam ABB thoda poster hanth me lo...Asifa ke liye Kiya tha na...to ABB bhi karo.... please...", "amangautam.official": "Follow for poster design of songs movies and photos editing @aman_gautam____", "akhil.singh2005": "Oye draamebaaz where is your placard? Are you not ashamed now? Put your fingers to better use", "aanchal944": "@reallyswara jab kathua rape hua tha to tere ko sharm aarahi thi hindustani hone me. Ab kyu chup hai.tera bhai rape kiya hai. Ghatiya aurat, deshdrohi ab nhi bolegi i am ashamed of being muslim. Har hindustani tere se nafrat krta hai. Tu humesha royegi narak ki aag me jalegi. Mar ja", "vbhv_agarwal": "Chinaar randi ki aulaad @reallyswara tjko to pakistan bhjna chaie yha khali baithi h yhi double standard wli batein chodegi lodi saali.", "bhupenderthapa": "swara saali randee ab bol ab chup kyun hai", "jadhav_ajju0094": "Shame on you @reallyswara sali kutti", "22anuj": "Raand......randi....randvi 💩💩💩💩💩hug rahi kya kuttiya udhar", "shaan_1613": "#justicefortwinklesharma her mistake was that she was Hindu . and our mistake is that we are seeing your movie", "suklamandal": "Bloody whore", "sudeshamin_14": "@reallyswara -Where is Your Placard Now .Asifa K Time Pe To Bada Likh Rahi Thi (Temple) (Hindustan) etc etc .Aab Kya Hua 3 Saal ki Twinkle K Liye Koi Placard Nahi .Kyuki Vo Hindu yehi Dosh Hai Uska .Ya Tumhe Bas fame Chahiye Tha Asifa K Placards Dikha K From the So Called Peaceful Community .And Twinkle Ka Doshi To Muslim Hai Kya Hua Aab Likho Placard Meh Aur Banao Isseh Bollywood Trend Jaise Asifa K Time Kiya tha .Kyu Kya Hua Aab Gand Me dam Nahi Hai Tumhare .Hypocrite Aurat !!", "prashantkeshri07": "Russia me v laal salaam", "farha_anwar_official": "Beautiful", "i_ammanisha_": "You are a hypocrite person swara👎🏻💩💩💩you support when a muslim girl is raped by a hindu but don’t support a hindu girl when she is raped by a muslim..being a hindu you always support muslims. Such double standards should go to pakisthan.. how much do they pay you.??", "krittikasingh_": "Now she doesn't have any film to promote unlike at that point of time veere di wedding was to be released...she just needed some publicity....she won't gain anything from talking abt this incident...so leave we people are just wasting time by giving her the attention she doesn't deserve...", "androidstreak": "🤮🤮🤮🤮", "thakurrrajsingh": "Waste of india🖕", "sh.iva6085": "Wow nice", "iv_5062": "Jitna gaali bko tko km h🙏", "amit.bhaipatel": "Unsuccessful ladki jo paise k liye kuch bhi kar de", "imbitturider8": "Where r u mothefucker #swarabhaskar", "anand.s.n": "Now she will keep her mouth shut.we must hate this type fake feminist", "shabnamthakur78": "yeah swara ji ab app sharminda nai ho kya ？", "saurabhghag1994": "Shame on u", "debabrat_9393": "What happened to you madam, now don't you have any time to show a play card in memory of #twinkle??", "kishor_kumar_baghel": "आज हिंदुस्तान शर्मिंदा नहीं हुआ क्या दोगले लोगो ,आज तख्ती नहीं उठाओगे जो अलीग़ढ मे हुआ उस पर", "saurabh1_sharma": "Teri tkhti kha h", "mitroo_memes": "#justicefortwinklesharma", "misra6556": "Please report her...she is a bloody hypocrite...and follow this Prevert", "yedzavya_poryaa": "ये रंडे😂😂", "yashlucknowi": "#shameonyouswarabhasker", "charliebhai17": "Ab Kaha kaha ho bhen ki lodi?", "sarthak3238": "@reallyswara u are the best reason to shake our hand after watching ur orgasm video", "imran_sams": "Kutiyaaa mullo ki dallal", "casu_vaibhav": "ab vo secular chakke kaha h jo bolte h swara ko gaaliya kyu dete ho to sun bhosdiwalo isse bol playcard leke ab tal twinkle ke liye kyu ni leke aye ??", "priya_drall": "Kha Mar rhi h. Tu ab nakli feminist.", "honey.mishra_": "#ASHAMEDOFYOUSWARA🤬🤬🤬", "littleboy_tirth": "Bc Abhi saap sungh Gaya Kya tujhe....twinkle Hindu hai isliye koi appeal ni ki na....you are a bad spot in this society", "_sumit_a_srivastava_": "So u r relaxed.., U were having pain when #asifa was raped and u are enjoying when #sweety is raped. Shame on you.", "sunny_m_kashyap": "Kathua par to maut aa gayi thi dayan tujhe....... Ab chupp hai.... Community dalli", "name__is__ajay": "Bitch", "dadheech_007": "Tum jese log srif rupye ki liye bane ho mar jaao tum jeso ko desh me jagh hi nhi milni chahiye", "roopamkhanvilkar": "Hey U so called Liberal b***h wheres ur placard or still busy lookin out for an opportunity.", "ks_anagha": "@reallyswara you can ask justice for asifa but not #justicefortwinklesharma . Shame on hypocrites like you!", "iam.juhiverma": "शक्ल देखो इस कि बिना मेकअप ओर काम बेशर्म औरत का", "parmar2638": "🙈🙉🙊", "arunbhardwajj": "My dear swara you are just amazing naked not just from out side but from inside too you bloody bitch ab kya hua #twinkle Mamle mein kyn maut aa rahi h tum sab behuda besharm logo movies ki kamayi ya votes sirf muslims k yahan se hi ate hain. Tere ya teri kisi apni k sath hoga thn india will tell you k how ashamed india is or hindustan or hindustanies are.", "mayankcraze": "kaha h swara bastard ab is case p ek number ki dogli😑😑", "ismartvishal": "Apni ungliyo ka shi istemaal karo ek tweet kro twinkle ke lye", "raj7s2019": "Don't think always about your two fingers. Show urs humanity on aligarh murder incident", "bhushan_chobisa94": "Kya hua ab tere ko re.... protest nahi kr rhi hai hypocrate bhehkl", "nitish_nkjsr": "Madarchod hai tu....swara Bhaskar", "iamhetalrathod": "SoCalledActor : I am hindustan, I am ashamed #Kathua #justiceforasifa PoorTwinkleFromHeaven : Aunty.. Mere liye placard nai uthaogi?👯 Ab kyu chup ho madam ji?😡👎", "ankit_singh_sinu": "Abhi Kya hua", "sp_182": "Kyu madam, maze kar rahi ho? Woh \"I am ashamed\" wala placard gum gaya ya ab fark nahi padta aapko? 😡😡😡", "_hetviv": "If you can support asifa rape case....then you can also support twinkle sharma #justicefortwinklesharma", "namant145": "Aur dramebaaz ab ni bolegi kya rape case ke liye😡", "_vrishank_": "Where's you placard? You hateful imbecile. 😡😠😠", "deepak_karadiya": "क्या कारण है कि Asifa का Rape सुर्खियां बटोरता है लेकिन #ट्विंकल शर्मा की चीख़ें दबा दी जाती हैं। आखिर दोनों बच्चियाँ ही तो थीं?", "narwal.mukta": "Let me change the hash tag #unfollowswarabhaskar", "szrahulraj": "क्या कारण है जो Asifa का Rape सुर्खियां बटोरता है लेकिन टिवंकल शर्मा की चीख कही दब जाती है आखिर दोनो बच्चियां ही तो थी ? @reallyswara @sonamkapoor @therealkareenakapoor @bhumipednekar @iamhumaq @vishaldadlani", "a_mysteriouswriter": "Jaha gai hai na vhi the Bharat vapas mat aana plz", "mohit123451234512345": "Bhag madharchod😕", "rahul18_rt": "Bhadwi actress ab Tera card kha gya mc😠😠.....ab Tere ho shame nhi aa rhi ....ab tu insaaf nhi mangegi ....twinkle l liye ....", "dhrolu__maahi": "Is jaisi 2 kaudi ki actrrs ki movies boycott kro... Acting k nam pe zero h or bnti heroin h... Twinkle k lie muh me tale pd gye hn in so called securals pe.... Thhu h tm jaiso pe .. akk thuu", "vidushis4": "Ain't you coming out with your playcard game @reallyswara You secular, liberal fucker. Literally shame on India to give such a low graded woman stardom. Where are you when 3 yr old Twinkle Sharma got raped? Ohh yeahh you wouldn't have got the news until now naa cause here the case is of a hindu so how can you be ashamed on being a Hindustani this time.Your kind of double standard people should be thrown out of India and nothing else. Bloody fucker liberals. May Lord shivaa give a life like hell to this kind of women. Humanity is at the stake of dying because of you people.", "sojitra_rajnikant": "Tum nafrat k like bhi nhi ho", "thesachinmishra": "Mai wo card Wala msg dekhne aata tha wo ashamed Wala but dikh kyo nhi rha Kahin", "ab100million": "Now Where is placard mrs.swara bhaskar...🙄", "beingvivek_9": "Desh me kuch chal raha hai log gusse me hai.....pehle to khub bola tha....ab kya huva ....", "shreyansh_tyagi": "Aab bolo na justice twinkle sharma. Justice for aasifa toh bhut bole rahi thi bhenchod ab bole na", "anupam_chandra100": "Hi hypocrite", "gaame11": "Asifa or twinkle mein kya frk lgta hai aapko @reallyswara us time to gle fat gye the aap dogle logo ke chila chila ke...ab silent kyu ho ..kyuki rapist muslim hai aapke agenda ko nhi krte... Isliye log tu tu krte hai aap jaiso pr", "maneeshkumar.889988": "Re maderchod tumhare post ka intezar kar raha hu randi.", "smiley69lol": "Wooo अलीगढ़ me भी ekk लड़की का रैप ओर murder हुआ h... Tumhare muhh से आवाज nhi niikli..... 😔😔😔😔", "rajput_karanveer11": "😠😠😠😠😠😠😠😠😠😠😠😠", "harshdeokar14": "A third class actress ,hey whore where are you now? Doesn't Twinkle need justice?? Or are you still busy sleeping with kanhaiya Kumar", "elegantly_mischievous": "Yaar kyo sablog iss baklol kutiya ko ittni importance de rhe ho... arre agar ye side actress kuch likh b degi toh konsa woh masum vapis aa jayegi. Ye sab jehadi bhadwe h. Kamzor pe zor azmane wale or jahaa minority me hote h wahaa bhigi billi bn jaate h. Peaceful religion h bhai", "ashokhanmantkar": "आसिफा गुजर गई तब तुने बहोत उछला था अब रंडी कहा ग ई छिनाल", "c_u_tti_e": "ab liko na i am hindu proud etc.. shame on you", "robertdjr2": "Randi madhrchod", "ashvikajaiswal": "Madam finding nhi h Kya iss bar Twinkle k liy ...", "ajay_uikey_": "Kaha machudva Rahi h tu ab poster leke khadi nhi hui madarchod", "krishkapoor7": "Randi mdrchod ab tu post nhi kregi bhai log plz reqst h isko har pic me gali do isko kareena ko sonam ko", "traveller0.01": "@reallyswara Madam ji asifa zaada pyaari thi kya aapko ya phir shayad twinkle pasand nahi aapko ,ki iss bar jab 3 saal ki bacchi ka rape hua tab aap ek dum chup hain ,aap toh women empowerment ki missal hain,kyun nahi iss baar justice manga aapne #justicefortwinklesharma", "thekaranvarshney": "Feminism ki aulad ab mt bolna kuch bhi bencho aligarh wale case ke bare main .. madarchod c grade actress", "ani_rude96": "One word can only describe you - RANDI 💯 @reallyswara #justicefortwinklesharma 🔥", "anuj.chandak": "Aaj aapki mombati kaha h @reallyswara... insab ke liye jitne jimmedar vo 2 harami h na utne hi tum jaise bollywood star h.... usless person you are", "reyanshpant": "Ghus gai BK L**DI ghusand ab.. ab bhook na kutiya... ab Q nhi bhookti.. randi teri bhi ladki ho uska bhi rape kare ye jihazi.. or sare hindu chup rahe... i wish", "arya_o.0": "Where are fuckin slut? Kaha hai tera pla card?", "humans_fight_back": "Ab koi bhi musalman apne aapko criticize ni karega. Ye hai tumhara desh hinduo", "aarav.bhardwaj94216": "Mam ab wo white board pe likh ke daalo na.", "rishabh.gandhi.007": "Haven't u heard of twinkle sharma..Can't see u standing with her.. U asshole", "rahul.vishen_": "कथित सेक्युलर जाति की @reallyswara थू है तुमपे जो कठुआ मामले में तुम कार्ड्स लेके रोना मचाती हो लेकिन ट्विंकल शर्मा के मामले में बोलने में भी हिचकती हो । डूब के मर जाओ समुंदर में जिसके सामने खड़ी हो । तुमसे अच्छी तो कुतिया होती है खून देख के भौंकने लगती है वो भेद नही करती की वो हिन्दू का है या मुस्लिम का", "atulsingh5393": "Madarchod secular Randi ki bachi", "muskaaansharmaaa": "Abh chup kyu hai tu bhosdiki? Abh tera muh ni khulra? Khulega bhi kyu bika jo hua hai? Where's your damn playcard,Shame on you bitch you're the most bitchiest person I've ever come across. Fake feminist.", "narendrachoudhary5592": "कुछ बोलती क्यो नही?", "sajan1291": "A girl named twinkle has been raped by man named zahid khan. She was a 3 years old kid and her body mutilated, acid was poured in her eyes. Literally horrifying , the whole humanity has been ashamed but you people(@reallyswara ) will protest or come up only by seeing religion. You can't ask for justice this time coz its not in the agenda you follow. Really proud of silent Bollywood and media, #justicefortwinklesharma", "chitranshi84": "Aisa lagta hai swara didi ke pass marker aur page nhi bache..... fake feminist ab kahan gya tera gussa kyun ab bahar ghoom rhi hai board leke ab khadi kyun nhi hoti.........#fakefeminst", "sharpsharp81": "Han dogli budhiya ab ltkake ghumna Plug Card gale me ki pakistan bhagne ke erada hai", "sachin_swagger333": "Prostitution at its best 😠.... Where r yu motherfucker now for twinkle?", "advnik17": "Finger se fursat mil gai ya nahi mili", "sidheart00745": "Now you are not ashamed why? Now you are not ashamed for being Indian.? Where is your placard?shame shame shame... The problem is the girl like you talk about feminism... Shame @reallyswara", "86.410272": "Tere se ghatiya aur badsoorat aurat mene poori Life m nhi dekhi Bollywood m kaha se a gayi footpath se kachra uthane wali gold digger aurat", "manishmahendra": "Those who are abusing here have same thought process as molesters", "_mr_sanjeev__": "Shame on u 😡😡😡😡😡😡😡 asifa k liye to Jan jal Rahi thi ab Kya hua😡😡😡😡😡", "akanshi_1011": "What would you now say about #twinklesharma. Brutally raped by a Muslim .why can't I see a PLACARD NOW!! Aren't you ashamed now? Arrogance and ignorance at its peak. But you know what I'M ASHAMED OF HAVING PPL LIKE YOU IN MY COUNTRY. Who can point fingers at others but at their will. Whats the difference between asifa and twinkle. Get a bit more logical and rational!! GET WELL SOON SWARA BHASKAR! #SHAMEONYOUSWARA", "abi_s_naik": "Kese actor Ho ap log kese Indian Ho sharam ani chayie one sided people real life actors 😤😤😤😤", "ganamanjarekar777": "Shame on you 👎 @reallyswara #justicefortwinklesharma", "abhijeet__453": "didi aapka maun vrat kb khtm hoga aligarh me bhi 1 bachi ke saath rape hua h", "sumitshukla31": "Unfollow this kamini. Now we are ashamed of her. I pray God that u will not die peacefully.", "guy_has_no_name_666": "Aeeee madarchod...randi saali abb bol naaa...uss Lande ne ek ladki Ka rape Kiya...asifa ke vkt bahot Sharam as rrahi thi naaa...ab bol na...saali randi", "vishwa.hindu.parishad": "कहा मर गई अब। कठुआ केसे में तो बहुत भौंक रही थी, आज गरीब की लड़की जो कि हिन्दू है इसी लिए चुप है ना,शर्म कर अपनी पैदाइश पर😡😡😡 #JUSTICEFORTWINKLE #JusticeForTwinkle #JUSTICEFORTWINKLE", "whowling": "Randi lg rhi ho ek dum 😂😂👏🏻", "23pasi12": "Where is the placard @reallyswara ??", "harshit_chauhan.messi": "Madarchod swara", "lodu_vishal_dadlani_vkcaptain": "Let me say the reason for these Bollywood brigade not holding cards for Asifa....all those who holded cards like @vishaldadlani and @reallyswara have a hatred for Modi government and that's okay to not like the government ...but they were trying to prove that Muslims are not safe under Modi....at the time of Asifa their main agenda was not for the justice of asifa but to spread hatred for Modi government....and thats the reason they are not feeling pain for our country's daughter Twinkle sharma....these people even had no pain for our country's daughter Asifa too", "dheerajchamoli": "Madam plug card ne dalre aap kya ho gya", "aman___1025": "Shame on you.. Hidustan zindabaad gair hindustan in hindustan murdabad. #justicefortwinkle", "shaw.amit56": "Now it's time to ashamed on u @reallyswara", "shuklaabhilash4": "Kyu randi sali ashifa k liy to bahut gand marwa rhi thi insaaf k liy acchha kr rhi thi lakin aaj twinkle k nhi kya ma chud gyi teri randi sali madarchod ab kyu nhi kuch bol rhi sali mil jay na tu gand faad deni hai teri", "vivekkumar288": "Ye saale sab sickularism waale h, abhi iski dukaan band h koi movie release nahi ho rahi Aur av to ye summertrip m busy h iske pas av samay nahi h, saale dogle dohre charitra waale😡😡", "_tarun_1704": "kyu randi ab sharam nahi aa rahi tujhe hindustan par tum bc log paise k liye kya kya nahi karte ho tum jise log kise 1 mazhab ko aage rakh kr baat karte ho bacchi wo bhi the bachhi ye bhi hai but wo muslim ki the or ye hindu ki hai iskiye tere muhh se ab kuch nahi niklega", "yourskt": "oye sawara madam twinkle k liye kuch kahengi ni aap?", "avdheshjha7": "मर गयी या जिंदा हैं ? हद्द हैं दोगला पन का ।।", "roshan_pawar_": "😍😍😍😍😍", "12shree_": "Why dont u say anythng bout Twinkle ....Bloddy b****", "pradyum_official": "#boycott_@reallyswara", "the_kid_actors": "Inke jese logo ko desh se nikal Dena chahiye inhe Pakistan pasand h ye hinduo se nfrt krti h", "_a9di_": "Mam ap troll pr dhyan mt do...you are doing great job...abi placard uthake koi fayda nahi hai jab movie release hogi tbi uthana apko sympathy milegi....aur iss bar dare hue samuday ke insaan ne ye kam kiya hai...aur ye apke agende ko suit nahi krta to ap wait kro ki crime ho ap tbi awaaj uthana l...thank you🙏🙏", "rajput_ki_banno": "Hey arent you asahamed now ....where is your placard swara ...your are just a shit and inhuman...#thuuuuaurat", "mo.hit.singhrajput": "कठुआ रेप से बॉलीवुड की जिन वेश्याओं को हिंदुस्तानी होने पर शर्म आ रही थी आज अलीगढ़ रेप के बाद वो सारी वेश्याएँ चुप हैं 😏😏 M.C. @reallyswara", "kavyasandilya2000": "A behn k lodi kya wha ghum ri h madherchod ab bol na I am hindustan I m ashamed loda lehsun... Madherchod tm desh k bahr hi rho...", "harsh.upadhyay_": "Rand", "psychology_is_everything": "I am feeling shame for the people here, who aren't urging government to punish the rapist which they have elected but now here using baby twinkle as a opportunity to target @sonamkapoor i am feeling sorry for the humanity now, and i want to tell all those people, you really don't care about twinkle you are here just to target the people who strongly stood up with angel asifa, don't call yourself hindu,, you are just brainwashed people and your hearts are dead because of the poison of hatred,,,, God save my country.... I request to the people who have written proud hindu on their profiles don't take this as opportunity, help twinkles family, help them to get their daughter justice . 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏 #justiceforeveryone #sonamkapoor #swarabhaskar #kareenakapoor", "sketching_cooking_lover": "Q Randi ki auld mc @reallyswara", "jinping.shb": "Kutiya aurat, hindu ldki mari hai to muh me kisine lu*d daal diya tere aur agr muslim mr jati to ben ki lo*di ra*di rona chlu kr deti.", "singhaniyagovind": "Go and get fucked by talibanis nd do all anti hindu things u cheap lady", "abhaygurjar43": "Ohh didi twinkle sharma ke baare main pata hai ab sharam nahi aati aapne aapko #doublefaceperson ab ke hogaya likho I am ashamed to be indian ya bharat chor diya kahan gaya aapka pura gang are hum indian aap so called celebrity hindu muslim karte hai flop actors ek bacchi ko leke ki woh hindu thi isiliye chordo koi cmnt nahi karna hai ab yeah mentality hai aap logo ki", "123_kingg": "@reallyswara twinkle ke liye bhi playcard karle... Hypocrite aunty", "anjalib820": "Mam where is ur hindustan vala placard... Oh Now uh r not hindistan ..... #libralsnhisudhrege", "chandakrohitmaheshwari": "Wo kya h na ladki hindu h or jisney kiya h wo inka jija h is liye madam shant h abhi", "rohit.dogra.5817": "kha chle gye woh carbboard lekr insaaf mangne wale.", "shabeeru": "😍 nice 👍", "ashish.sharma.ashu": "दोगली औरत😡", "sachin_nagar95": "कहाँ गए भांड पत्रकार, बॉलीवुड के सुअर दलाल, वो तख़्ती वाली वेश्याएँ, वो मोमबत्ती वाले हिजड़े बुद्धिजीवी तो धर्म के नाम पर बेटियों को को न्याय दिलाते हैं 🙏🏻😒 *ट्विंक्ल* 😒🙏🏻", "sunnychopra100": "Oye rundi kaha chudwa rhi h rape hua h bachi ka post nhi kregi", "threeamshocks": "Ab sharam nahi aarahi kya tumhe??? Then ur not #india", "imankitrai": "Abhi konsi wadiyo mai ho madam ji... Ya sirf majhab dekh ke playCard pakadti ho... #bhagwanthodiakalbhide 🙏🏻", "shishir.varun": "Where is the placard B grade actress ? Seems the funding has not been done this time. Fucking oscar winning actress. A BIG FLOP", "thehimanshu7_": "I haven't seen yur any post related to #TwinkleSharma , fucking Fake Feminist Womens out there😏 #WhereAreYouNow", "tusshardhumal": "Kyu antiji ab sharm nahi a rahi ya #Justicefortwinklesharma", "devid_patel_14": "Hinduo ab to ak ho jao in sbhi Pakistani kutto or Bollywood rindio ko Bharat se mar bhagana he", "v_ikasyada_v": "Jab tak tum jaise actress hai na paise k bhuke aur aur Desh k tukde karne wale tab tak yehi hoga Hindu girl muslim girl tum log ye sab late ho ladki ladki hota jiske saath ye dushkaram hota h vo kisi ki beti Hoti h pr tum jaise log sharam karo tum log publicity k liye kuch bhi kar sakte ho Desh bhi bech sakte ho tum", "sandeepsarswat1992": "T m k b kha margi randi justice for twinkle", "mayursen04": "Where r u now liberal ....#justicefortwinklesharma", "nishantnarayansingh143": "U bitch , where u died, saali ab nahi cards uthaogi, kyunki wo muslim nahi ek hindu ki bachhi thi", "priyanshu_singhtomar": "यही चारों वेश्याएं वालीवुड की लड़कियां है जिनको कठुआ रेप कांड पर हिन्दू होने में शर्म आ रहीं थीं अब ट्विंकल रेप कांड पर कहाँ मर गईं ...बाहर निकलो 😠", "sankalp.006": "Mombatti gang kaha gaya??", "sabsudhanshu": "Mam we want you to hold that placard once again can you do this once again?#socalledliberals", "bablu_nayak1": "Randi", "nishant26prk": "👞👟🥾🥿👠👡👢👞👟🥾🥿👠👢👡", "blosombabez": "@sonamkapoor @anandahuja @ektaravikapoor @vdwthefilm @reallyswara loving all the epic abusive comments of you 🤭", "posterjain": "@vinamrasoni .. mil liyo Bhai", "resol.07": "Kaha mar gayi oye dogli aurat teri gandi shakal abhi najar nahi aati", "iamaakashsaxena": "Where is the placard ?? Such a sick mentality you have.... Instead of uniting the country you are dividing it.", "akshaysinghratnoo": "Libtard", "devendra_singh_13": "@reallyswara tu madarchod Tera baap madarchod Jo tere jaise ko jnm diya", "pawan.mpharmacy2017": "Ye Bollywood ki Surpnakha hai. Ye kisi ki sagi nahi hai. Agar Paisa mil jaaye to ye apne Pariwar ko bech de.Isko to Kanheya Kumar jaise log pasand hai", "thakur.akashk": "Well she has time for uploading shitty pics but don't have time to raise voice for Twinkle's Justice. Shame on u @reallyswara .", "priyanshu.k.kashyap": "💩💩💩💩💩💩💩💩💩💩💩💩Really randi swara 💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩💩", "00.rajz": "Arey madam #ungli_devi placard apne peeche wali paocket me ghusa liya kya", "panku0007": "isme aur terrorist m koi difference nhi hai. ye desh k ander rehkar hinduoo ko target krti h aur terrorist bhi hinduo ko target krte hai.", "urvie0010": "Bitch where is your compassion now?? Ab tu hindustani hai?? Muslims ke liye to bhot jaldi secular bante ho tum log", "imarjun84": "Hi Swara, r u alive or not? Because till now, we haven’t see any tweet for twinkle Sharma rape case.. if u decide intolerance based on religion and caste.. then u don’t have right to live in this country.. so. From today onward do stop barking... ok ...", "bubunnnayak": "Maderchod where is place card now", "suraj.verma_093": "Sali randi..6innar..ben ki lodi..raand", "saurabh.cool5506": "Tujh madarchod Randi ko sadak pe bhaga bhaga k marna chahiye sali kutiya ab tere muh se kuch nhi niklega #twinkle k liye,tum jaison ko daily 100 kode padne chahiye tumne hindu ko badnaam krne ki koshish ki h", "raghvinder.singh": "@reallyswara wo placard kaha hai jispar likha ho i am hindustan and I am ashamed ya phir is baar proud feel ho raha hai 😂😂", "816_vishal": "@reallyswara twinkal ki jagah koi mulli ka naam hota toh aise posts nahi karti.....Wahi gir ke marjaa.... Bharat pe ek doglibaaz ka bhoja kam hojayega", "gautamsameer457": "Gaali km pad rhi hai aapko dene k lie🙂", "sirrane30": "@reallyswara chudail aunty", "tyagi.abhay14": "Bhn ki lodi abb kha gyi teri liberals abb nhi bol rhe kch", "_.ankit_69._": "Twinkle ke time me apka secularism khah gya aab secular nahi ho kya ya esliye ki wo hindu thi", "ashvini_kumar05": "Why u and your gang is silent??", "sharmagq23": "Such a hypocrite on all aspects of life whether it's politics or rape..", "thakursahab4579": "Kyu madam ab apko sharam nahi aa rahe...ma'am rape to galat ho asifa ke sath ho ya twinkle ke sath ho...but aap jase actor ise religion ke chasme ko hta ke dekhe to accha lage ...yea ek serious crime ha madam crime😠", "nirmalkholiya": "Ab kaha gayi tu Ab kyu post nahi kiya tune ki ham sharminda hai. Tum sale left liberal gang apna agenta chalaoge. suno be tum jald hi saaf hoge es desh se me mera vachan hai . tu dikh ja kahi tera sar na foda tab kahna.", "msdiansuraj": "Justuce for twinkle", "devpratap_singh25": "Aligarh #justicefortwinklesharma", "puckpuckaunty": "Swara aunty, you look like shit 🙂. Btw have you gone blind? Did someone fuck you in the eyes and ears? Why is this selective blindness? I wish someone should fuck you in the nose, so you can be silent forever 🤗", "kar0987moin": "You will not raise placard against the rape and killing of 3 year old twinkle sharma.... This shows your hypocrisy... Shame on you.... You are just a laughing element... Flop actresss", "rahulvats21": "I think you forgot about twinkle. Great👏", "ayansinghnishu": "@reallyswara so called liberal can u please post for twinkel or you are busy in your #charamsukh", "ganesh_95_99": "Dont come back in India...Go n fuck yourself in pakistan...", "vmongs": "Stay there India does not need you SUAR . Ab yeh jo news hai twinkle sharma ki, ab kuch nahi bologi tum hyper secular PIG 🐖 🐷🐖🐷💩💩💩", "cute_raghini_": "Harami aurat kese tere muh dahi jam gai... Musalmano ki dalli... Ab tera dil na roya jb ek hindu ldki k sath ek kutte muslim ne darindgi ki hadh par kr di... Are tere jese gaddar qu hai hmare desh mei... Chli ja aur baksh de is ko... Are dayan b 7 ghr chor kr vaar krti hai aur tu apne hi desh ko barbad krne mei nhi chuki... Chiiiiii....", "abhimanyu312": "Hypocrisy", "bharatcharan5": "Shame on you always plays religion card go to Pakistan please shame on you", "randomaccountkj": "Tumhare jaise *pseudo liberal* ke muh se bhi kuch Sunna hai yr. Open up now, go tweet, you selectively secular hypocrite. Mention 'ramzan' the way you mentioned 'devi sthan'", "shriniwas__deshpande": "Not going to hold a placard for 3 year old TWINKLE SHARMA who was RAPED by MUSLIMS.", "ramaraman_": "क्या दोस्त jastice for twinkle ,now where you are?Take your time", "cyberpunk._": "Teri maa ki chut, saali chinaal raand", "pranavtripathi77": "Areee sali kutiyaaaa..... Kuch to sharm kro.. Jb hindu k sath kuch galat hota hai tb muh me lund le kr so jati ho???", "pranay4u": "Bsdiwali ab bol na rape case me, Randi haram ke paiso se ghumne chali gyi. Shame on u.", "sainiuttu555": "Aunty ji whr r uhh,,,whr r u fingering now,,,you bloody-minded urban naxal,,,whr is your placcard now,,,,suna h 3sal ke bachi ka naam twinkle h or aropi shantipriye community se h,,,ab mat khena Tu kuch", "electricuniverse_14": "Justice for twinkle sharma #secularbitches", "atidarshi_sharma": "Hello hypocrite", "naruka_ashok": "Now where is the death of a 3-year-old innocent daughter, your brother brothers have tortured and killed, now your speech will not open Lolalal", "urs_last_choice": "Bc ab aao na placard leke twinkle sharma ka rape kiya h musalman ne bc tm jaiso ko desh se nikal fekna chahiye fake peoples jo india me rehke izzat bech ke paisa kama rahi hai ur muslim ka rape hua to baut showoff kr rhi thi qki usse tmko popularity milti ab kro na bc ab fatt gyi gand tmhari", "vishwajeet10": "i am hindustan ..i am ashamed to have a citizen like you.....", "vinshalu15": "Madam aapke kuch vichar twinkle par tab toh hindu hone par aapko sharam aa rhi thi?? Ya movie release nhi ho rhi toh ab koi fark nhi padta aapko??", "arpita.tiwary": "Abe dogle log kabhi Aligarh rape incident pe v bol do @reallyswara", "being_rowdy_hukum2": "ligarh mudde p ni boli.....??", "the_dey_nihar": "Abhi playcard kidhar hei.. Chutiye log", "rathodc828": "sali, ab twinkle singh ke liye nahi bolegi", "imkdsharma7": "Randi bc", "raju_paswan": "Ab ashamed nai feel ho rai kya hindustani hone par? Oh I forget twinkle was not Muslim ! Dogli behnchod", "amitkum14": "बेशर्म , बेहाया ,रण्डी अभी तुम्हारे पास placard नहीं है रण्डी अभी शर्म नहीं आ रही है रण्डी तुमको आएगा भी कैसे मुस्लिम थोड़े ना थी हिन्दू के साथ हुआ है ना अभी इसलिए ।तुम जैसे बेशर्म के साथ ऐसा होना जरूरी है रण्डी तब तुम सिर्फ मुस्लिम के लिए आवाज़ नहीं उठावोगी ।तुम भी दरिदंगी का सिकार बनोगी रण्डी औरत बेशर्म।", "vivek_raavda": "What now madam, your brothers raped twinkle, any condolences ? Why don’t you commit sucide?", "upendra9618": "Kya hua secularism khatam ho gya kya ab ni banner leke kahengi ki hundstani hooon aur sharminda hoon", "vaibhavmaratheofficial": "Justice for twinkle Sharma @reallyswara 🙏🙏🙏", "pawankumar9677": "Thappad maar dunga agar election laden aa gayi tum", "eeeeesmaarttboyy": "Bhenchod Madarchod Saleee", "mejnyk_o4": "What happened Suar Ki bachhi. Tu chup kyu hai abhi. 3sal Ki Hindu bachhi rape hua hai. Mai hu Hindustan abh tera Kaunsa chut me ghus gaya abhi. Randy chod 🤬", "_chouhann.26._": "Ab playcard lekar ye nahi bolegi ki i ashamed because rape karne wale musalman thy.......... Doghli Hypocrite.......... Tujh Jeso ko to laat marke desh se bahar nikalna chahiye.......... 😠😠😠😠😠😠", "vatshayanshivam": "Twinkle sharma pe ab ku chup hai.. #hypocrite", "himani.023": "Kya hua madam ab ankhe footgyi apki placards kha h apke", "jignesh_jigzz": "Kiss chij PE inspiring ?", "r.adityasingh": "So called Secular . R u not ashamed now ? biki hui secular😬😠 #justicefortwinklesharma", "yogeshberiwal_": "#justicefortwinklesharma 🙏", "rahul.kanakdande": "Aasifa ke liye Hinduo ko badnam Kiya, #twinkle pe Kuch to bol", "akritisharma1146": "@reallyswara kamini ..tuje twinklek time p yad nahi aya am hindustan am ashmaed??? for u rape victim's religion matter?? ab kha hai pamplet am hindustan wala ..man kr rha galia likhu yha tuje badi badi par wo b nahi likh skti kuki tuj jaisi prostitutes ko apni ijjat se koi mtlb nahi ..bhagwan tuje narak b nasib na kare 🙏🙏", "sohansingh0809": "@reallyswara ab kuch bolegi alligarh rape case me jha 3year ki hindu bachi ka rape or murder tere baap mullo ne kiya or sda diya uski puri body ko bc ab q chup h ab jaa ho khadi board leke photo khichva", "saketjalia1254": "Ab kyu ni leke khadi hoti board 😡tu biki hui h 💩💩", "bharat_razzz": "Shame on those who all are following this prostitute who have time for #asifa but no time #twinkle", "gagan0799": "Where's the placards now? you are Not ashamed of Hindustan now? @swarabhaskar #justiceforgudiya", "maloveakash": "#areuashamednow", "iamajinkya2992": "👌👈👌👈👌👈👌👈👌👈👌", "naughtyprashant8": "Madam your minority ....juska app trust jeetne ki baat kr rhi thi ne ek Hindu ladki 3 saal ki ka rape Kiya ....trust hoo gya pura", "aakash9009": "If she reacts on heinous crime based on criminal religion.... start unfollow and don’t watch her movie or anything... bitch i am ashamed you are part of my country", "arpitsri1998": "Excuse me, ek aur asifa ka rape hua hai....Uske baare me nhi bolna tujhe kuch ab....Btw tere kanhiya ki haar mubarak ho.....A big aaaakthuuuu to you", "the_switchblade_assassin_11": "This moron will not talk about twinkle now because people like her and Sonam are double faced prick a scum to our country", "vishalchauhan098": "Don't come back to india", "manetheomkar": "Hey slut why are you so silent now about aligarh rape case?", "ankit.gamer1988": "Maderchod hai tu aur tere ghar wale.", "nneel_shah_": "💩", "expendable_777": "Sali ye toh wihi fingering wali porn star hai", "rammisundle": "Now she is like abba dabba jabba", "meerakainth": "Teri maa ka bhosda........bc sali mullo ki rkhail tu.......chudwati unse", "thebikashkumar": "Unfollow karo esko💪💪💪", "iamkuldeep510": "Ungli nikal li ho to ab aligargh bhi kuchh bol le. #justice_for_twinkle", "dinesh.xy": "Saali rand ab tera mauh nahi khulega.Hindu ladki ka rape kiya tere kathmulle ne", "sannjay_official": "plz... aise bure logo ko like or follow na karein...#deshdrohi #dikha....!... .plz supprt kre #justicefortwinkle", "iamavidubey": "Iske comments section me gandh macho tb pata chale isko.jo ye randirona karti hai wo public sb jaanti hai.", "__lonewolf3": "Randi sali udhar hi mar ja...mc lavdi...Maa ka bhosda teri", "kumarritesh70335": "आसिफा की DP लगाकर इंसाफ मांगने वालों हरामियों, अलीगढ़ की हिन्दू बच्ची (3साल) पर मौन क्यों हो दोगलों और #MC सेक्लुयर भूतड़ों?", "dheerendra_2000": "Randi sali", "proud_to_b_hindu": "Q be kutiya ab saanp sungh gaya ab nai bolegi BKL oohhhhhhoo mai to bhul hi gai ye aasifa nai h aur jisne ye jurm kia vo haramzaade katue h madarchodo k kaum k😡😡 khair ishwar tumhe sadbuddhi de ye bhi nai kaha ja rha ab to", "aakashtiwari5943": "Are ab kaha gaya aapka gussa jo asifa ke samay pr tha....kya twinkle sharma bachchi nahi thi...ye phir wo hindu thi isliye koi gussa nhi hai.....shame on u @reallyswara ....keval ek dharm vishesh ki tattu", "yourdearcomrade": "Rape rape hota hai bhosdiwalo.swara ka kya glti hai isme.aur jo log rapist me bhi religion dhund rahe hai woh log sach me hipocrites hai.", "sachinjoshi77": "नन्ही कली ट्विंकल के लिये आज बॉलीवुड की मोमबत्ती वाली तितलियां, अवार्ड वापसी गैंग, मीडिया ,नेता सभी दोगले चुप क्यों है?😡😡", "dj_ankaj_official": "@reallyswara 2.5 Saal Kii Bacchii Twinkle Ka Toh Pata Chal Gaya Hoga 🤔🤔 Toh Ek Board \" #justice_for_twinkle \" Leke Kab Aa Rahii Ho 🤔🤔", "the_sunil.official": "Madam ab aapko Sharm nhi aa rhi hogi Hindustani hone pr jab Aligarh me ek Masoom ka rape hua h kyoki wo aapke dare hue samaj ki beti nhi h na", "raj_ajay12": "If piles disease had a face, it would look like her 😂😂", "imhimanshjunior": "Bc jaha hai whi rhio, India aane ki sochio bhi mtt bkl,.......", "_silentknight_x": "TATTI", "yudhveerrajput": "Un haiwano k sath tujhe bhi jinda jala dena chahiye", "brahmin_shubham14": "जस्टिस फ़ॉर \"आसिफ़ा\" वालो\"ट्विंकल शर्मा\" भी बच्ची थी।... @reallyswara @vishaldadlani @ndtv @abpnewstv @aajtak 🙏", "ghosts_and_roses_": "So now a hindu girl is raped so you are not gonna say any fucking thing", "janu_jii__": "@reallyswara hey hypocrite ??", "singh.ankur_": "Don't come back", "rahulllllll786": "Where are u hiding and why are u not responding now , the rape of twinkle has happened . Is she not a girl ? Is she not a kid ? Is she not a victim ?! Why are biased on rapists religion ?!", "chowdharysatyajit": "kareena,sonam,swara ye tino ek no. ki @#$%@#$% hai inka koi jat nhi hota ye sb mtlbi hai", "purnima__bhardwaj": "Where is ur placard now? Why nobady is protesting in twinkle Sharma rape n murder case? Because the accused is Mohammed jahid? And victim is not asifa...", "chetan_jaiswal_1008": "Ab tumko sharam nhi aati", "sanam_nangla": "Hidimbaa.... Aur pootna ka mixture... 😂", "ghumakkadbysoul": "Any tweet or post for twinkle sharma? U hypocrite bitch!", "freakoffitnesss": "Why you celebs are soooooo haramkhor 🖕🖕🖕🖕🖕🖕🖕 now u r not even ashamed 😤😤😤😤 go to hell u piggy", "hinal_1111": "Twinkle ke case me kyu aap log kuch nhi bol rahe ? @sonamkapoor @reallyswara kyu vo ladki hindu hai es liye ? Shame on u..shame on Bollywood", "khan.saman": "Love your shoes @reallyswara ❤️", "story_by_himanshu": "Ab kuch kyu nhi boleti ap alighar baby case, ek bhi post nhi use bachi k liye, same on u ???? Ap jese log hi maan abuses karu but kare nhi sakta boz ap ek girls hai", "_.b_i_g_s_m_o_k_e._": "Tm jese log hmare desh m jo democracy h uska glt fayda uthate ho.... Bhago is desh se", "yash05199": "India's best dramebaaz actor goes to so called liberal swara........bla bla bla....What ever 👌👌👌💐💐💐💐", "kabitapandey007": "Miss whatever where is your placard jaha ek 2.5 saal k bachhi ka rape aur murder hua???(of a Hindi baby girl jo ashifa se bhi chhoti thi)", "sarkar_shekharr": "Placrd kahan gyi??yaa so rhi ho?", "abdulwahid385": "Awesome👍", "iamharshitt": "Dear Liberandi, First of all you’re not more than a piece of crap and nobody even care whether you’re alive or not. But having double standards and love for religion of peace shows your real face. You’re one the most hated person in the country and believe me, you’re nothing as an actor and coming years will see your downfall as a person as well. Fuck you.", "hegde_yatharth024": "#justicefortwinkle", "ansh1293": "Hey suar bhasker, aligadh me jahid or asalam ne gudiya 1 cchoti si bacchi ka rape n murder kiya iske bare me kyu kucch nhi bol rahi h kutiya, kaha gaya tera secularism or teri liberandugiri, mar ja tu sali, kyu nhi bol rahi is bare me ab", "imkasaksharma": "Where is your humanity now? Bloody Hippocratic people of Bollywood! Shame on you!!!", "master.wayne.31": "Do u know who twinkle sharma is?", "i_shan11": "Enjoying im Russia now not ashamed ... Do u raise voice religion based that's why ur supported leader lost election because Loktanta khatre me hai bolne wale always partiality dikhate hai", "themanavgrover": "Agar haatho ka uchit prayog karna aata,toh #JusticeforTwinkle ke liye bhi placard likhe jaate. Iss Tukde tukde gang ki supporter ko India se nikalo. Jai Shree Ram! Bharat Mata ki Jai!", "its_sammy_jain": "Kathua rape case ke time pe toh baada religion ko target kiya jaa rha tha bade post kiye jaa rhe the ab kya hua ? Twinkle rape case ke time pe bhi karo na religion ko target.", "nick_indian77": "Swara bhaskar Randi.....Twinkle sharma ke liye no words....apne baap ka penis suck kar saali randi", "pjha23": "कठुआ रेप से बॉलीवुड की जिन .........को हिंदुस्तानी होने पर शर्म आ रही थी आज अलीगढ़ रेप के बाद वो सारी ......चुप हैं 😠😠", "guptarashmi159": "Bitch r u even aware what happened to a 2 yr old girl twinkle", "kritika_prasad": "Ab tere muh se bol nhi fut rahe", "sharma.aarush445": "Where are u madam I think u have no time for #justicefortwinkle just because its majority case nt minority case#fucksecularism", "vishaldhanka16": "Narendra modi jindabad 💪💪", "ayushgupta.co_": "कटुल्लो की दीवानी अब क्यों मुंह बंद है तेरा कठुआ रेप केस में तो खुब मुंह चल रहा था तेरा शर्म आ रही थी उस समय तुझे अब मार दिया हिंदू बच्ची को अलीगढ़ में अब क्यों नहीं बोल रही है बोलना शांत क्यों है🤬🤬😡😡😡😡", "santoshagrawal47": "Kahan halala karwa rahi h Randi... Tera play card kahan gaya.. Tere bur mein gusali kya", "anuraag_9394": "O randi... Ab bhi muh me land liye bethi he kya madarchod.. twinkle ke liye kuch bolegi", "mayank.mahajan36": "Russia me muth mat mariyo 👏🖕😂", "_santosh_v_gample2341": "Shayad ye abhi soyi hai..... Agli baar jab sirf muslim laadki Ka rape hoga tabhi jagegi....@reallyswara ....sharm Karo sharm shameless", "ask.ayush": "eid pe jo dare huye logo ne kiya hai....uske bare m kch nhi bolegi bhen ki lodi", "fanatichindu": "Twinkle wants justice", "i_m_more_handsome_bt_i": "Where is your fucking placard for twinkle...fucking bastard....suck my ass", "its_all_logic": "Aee shh shh.. suno na", "yadavyadav82": "#reallyswara tumhe tab pata chalenga jab log tumhari picture dekh na band kar denge... Bycote her movies", "i_amy_08_": "BC Kaha gya tera ab insaaf sawara ??...sali ab twinkle k insaaf k liye ni awaz uthayegi Tu???", "prabalsahu": "Fucking Hypocrite...", "freaky_brahmn": "Ab mar gyi Tu bkl ab Kahan hai card", "meghajwadekar03": "As amazing as you", "lost_boyjourney03": "Bhen ke lodi Randi madachod", "simrngill26": "Now u r not going to support twinkle sharma haa .. whr r u now miss", "boby9836": "Hot n sexy", "kumar_aryan27": "ट्विंकल शर्मा की आत्मा तुम्हे कभी सोने नही देगी....बदतमीजी.. स्वरा ..तेरा नाम गलत रखा..तेरा नाम कर्कश होना चाहिए...!!", "an_aaravsen": "क्यों बे रंडी अब हिन्दू लड़की का रेप हुआ तो हाथ मे पोस्टर की जगह चुत में मुस्लिम लंड चाहिए अब", "rohit_tayal2.0": "ab bol na bc....ab bol laga sign. jb to aa gyi thi nikal kar kathua kaand ko leker....bkl ab bol na...twinkle ke liye nhi bolegi ku ki wo hindu h or marne wale muslims h......", "butter___fingers": "💜💙💜", "kumarashish1678": "#justicefortwinkle", "saurabhtaker": "@reallyswara kaha gya wo canvas board feel ashamed hindustani nhi bolegi kya arey arey... Mai to bhool gya culprit muslim h chalo koi baat nhi agenda chalu rakho", "sid_jaiss": "Or r***d kuch word twinkle shrma k bare m v bol do", "jainnitin9300": "Kya digvijay aapke saath chutti manane saath aaye hain kya kyunki yahan Bhopal main nahi mil rahe hain🤣🤣🤣", "suraj_dubey10": "I hope u become deaf at first,then u become lymph in one leg and then u become blind in one eye,and then u suffer slowly slowly and die everyday", "ydspooniya": "Swara searching Lenin & Stalin in St. Petersberg 😂😂", "ps_rajput___": "Sorry tiwnkle tumhare insaaf ke liye yeh bollywood nahi aayga suport me qki tum ek hindu our rap krne wala muslman 😈😢😢😢", "_iamdev__": ".", "anand_cool_444": "Hey communal bitch .... #pkmkb", "loving_urs": "Vamp", "dr_ameet_saboo": "dr.gunjan_sakhare", "aloksharma11": "Ab muh kyu band h twinkle sharma par @reallyswara ab sharm nai aari", "devbhati5151": "justice for twinkel shrama ..3 years ke bacchi thi ye 😔..Ramzan ke manth Mai rep hua iska .....tumri takhti gang kaha hai ABB ....@iamhumaq @reallyswara @sonamkapoor", "samippatel111": "Sorry Swara but where is your card on #justicefortwinkle ; I can’t find it", "_kattar__hindu__": "मजहबी हो जाती है आज कल बेटियां भी...कही आशिफ़ा के लिए हर कोई सड़क पर होता है.. वही ट्विंकल के लिए कोई पोस्ट भी नही आती #अलीगढ़_रेप", "__harshit__m": "Mai apna gutka yha thuk du kyaaa🖕🖕🖕", "nikyrajputana": "Islam ki Dalal ho tm 🙏", "_i_am_me_12_": "Vhi reh behnji aaj kaha gaya tumhara movement koi movement ni karogi ? Religion shi ni hai na bacchi ka th maze karo. Double standard fake women", "dablav": "Mast h yaar tu", "official_saket_kumar": "Cutee", "sohampuranik_": "Randi", "vintagesoul1916": "अभी तक इस रंडि का रेप क्यु नही हूआ .भरे चौक मे होना चाहिये .@reallyswara की बेइज़्ज़ती .", "ashishturan8468": "Don’t come back to india, just book your ticket to Pakistan from overseas", "chaurasiaman1000": "Oye zara logo ke comment bhi padh le teri taareefe kr rhe h reply nhi kregi kya unko 😡", "_yash_parande_": "#justicefortwinkle", "vasundharan18": "यह उस 2.5 वर्षीय बच्ची ट्विंकल शर्मा की पोस्टमॉर्टम रिपोर्ट है जिसे रमज़ान में एक रोज़ेदार शांतिदूत मुहम्मद जाहिद ने बलात्कार कर मार दिया, उसकी आंखें नोचकर निकाल ली, उसके हाथ पैर काट दिए, उसके गुप्तांगों में चाकू से वार किये, उसका पेट फाड़ दिया, फिर उसके शव को कुत्तों के खाने के लिए फेंक दिया। यह रिपोर्ट पढ़ने के बाद मुझे विश्वास नहीं हुआ कि कोई मनुष्य इतना विभत्स आचरण भी कर सकता है जरा इस रिपोर्ट के उन अंशों पर एक दृष्टि डालिये जिन्हें मैंने हरे रंग से हाईलाइट किया है आपको भी उस शांतिदूत जाहिद द्वारा 2.5 वर्षीय ट्विंकल के संग किया गया पैशाचिक आचरण समझ आ जाएगा ⭕ बच्ची के शरीर मे छोटी व् बड़ी आंत मिली ही नहीं ⭕ बच्ची के शरीर मे किडनी मिली ही नही ⭕ यूरिनरी ब्लैडर मिला ही नहीं ⭕ जेनिटल्स मिले ही नहीं ⭕ बच्ची के शरीर मे आंखें थी ही नहीं ⭕ बच्ची के हाथ पैर उसकी हत्या से पूर्व काटे गए थे.. Where is ur placard now?? @reallyswara ab voice raise nh ho rahi...", "nationnamo": "#JusticeForTwinkleSharma", "mitul_jari81": "Kab nikalogi madam ye 3 sal ki twinkle ko insaf dilane kaha hai bollywood wale", "_papa_ji_420": "Tum jaiso se acche ..humara hindza smaj h 🖕🖕", "iparaspuniyani": "@reallyswara totally biased !", "____apps___": "पानी और खुली जगह देखकर टट्टी करनेकी सोचना भी मत.. वह रशीया है...भारत नही जहाँ हर जगह ही कि हुई टट्टीयाँ बरदाश्त की जाती है", "msdian549": "Pseudo liberal swara bhaskar ,sharm kro", "himarawat5": "Kutttiya marii nai ab tak😂tu Lahore ja lahore", "tarungurjar3211": "pakistan hi chali jaati kanhaiya k saath , chu*** Aurat 😡😡", "ni_x_o_n": "Ab na bolegi kuch muslim ne rape kiya to", "madhuamritasingh": "@reallyswara why are you silent now on twinkle's rape case?? Now u won't say or protest bcos twinkle was a hindu child. U hypocrite😠😠", "naval_memakiya_007": "justice for #Twinkal", "______tanaya2311": "Twinkle sharma k liye placard nahi lagaya", "singhchaynika": "Are you going to mention twinkle or nah?", "travellingdeepak": "I have same style picture on some place 😀", "x.animal_planet": "असिफा पर रोने वालीं swara bhaskar जी आज पर नहीं रोओगी ! 😢 क्यों कि Twinkle हिन्दु बच्ची थी और रेपिस्ट अपराधी शान्तिदूत समुदाय से थे इसीलिए विरोध नहीं किया क्या आपने ? तुम लोग बिके हुए हो ! हिन्दुओं और हिन्दुस्तान को बदनाम करने का पैसा मिलता है तुम लोगों को ! Twinkle के लिए कोई दुख प्रकट नहीं किया आपने ? क्यों कि Twinkle हिन्दु बच्ची थी, या उस पर दुख प्रकट करने के भी पैसे लोगे आप लोग ! Note:- (Ashifa हो या Twinkle सभी बच्चियाँ एक समान है, जिस भी बच्ची के साथ बुरा होता है वो अत्यधिक निंदनीय है, कृपया अपराधियों का विरोध करने में धर्म ना देखें ) 😢", "prenitbhatt": "Now you've no time to hold placard because elections are over and the victim is Hindu seems like you do selective outrage according to your needs .", "chirag____9": "Madarchod ki bachi placard gaand me daal diye hai kya ab #justicefortwinkle", "nihalv500": "#twinkle", "vaibhstunning22": "The worst person 😎shame shame u parent should ahsmed of u", "bhupendra_singh20": "Madamji placard kaha hai 3 sal ki twinkle Sharma ka rape bhi hua hai Ramzan ke mahine me woh bhi musalman ke hatho", "mr.haru_zala": "Bharat hum sharminda he aligarh rape case ke aaropi जिंदा हे 😠😠😠", "sakshamguptaaa_": "Don't be one sided person", "thedamnedgod_": "Visit chernobyl too, Swara !!", "i_arpita_verma": "Pls wake-up @reallyswara and other hypocrites & psuedoseculars why r they mum on twinkle Sharma rape and murder case . They had guts to voice their Outrage in kathua rape case...y not now?? Stop showing your double standard on such heinous crime!!! Shame!!", "prashant_092pandit": "Ab thakthi latka k hindu ldki k lie protest ni kregi kya.... Tujh jaise log #secular sale society brbad kr rhe h..... Kyuk tum jaise logo ko sirf publicity chahye.... Ldki kisi ki bhi ho ladki hoti h... Wo bhi bacchi thi jiske liye tune Protest kia tha aur ye bhi bacchi hi h.... Jispe koi bollywood bhand sala ni aya agey", "menaria6240": "Odi baba", "saheel_12": "Madam jii kaha ho aap???itni busy ho gayi ki hundustan mai kya ho gaya voh bhi dikhai nahi deta😢😢#justicefortwinkle", "martand06": "do you want to share some outrage over Murder and rape of 3 year old in Ramzan.. you gang of bastards", "anuj_619_": "Wow my india is such a nice place ma bhen ki gaali dete hai such a nice country established", "naeem3388": "Looking gorgeous 😍😍😍👏👏", "dr.gunjan_sakhare": "Doob k mar ja swara bhaskar. Aashifa k waqt cards nikal rahe thhe. Aur ab tu chup baithi hui hai. Mar ja doobkar ya zeher kha le 😡😡🎂", "siddharth_peepra": "@reallyswara hey bitch !! When u'll tweet for twinkle sharma rape case????", "kpawan_k": "Please stay there and dont come back humble request nahi to keh ke lenge", "raj.kamal.5076798": "#आसिफा मामले में पानी पी-पीकर पूरे हिन्दू धर्म को गाली देने वाली, #ट्विंकल के मामले में चुप्पी साधने का ज्ञान पेल रही है। #स्वरा_भास्कर, #सोनल_कपूर और #सी_ग्रेड की इसकी गैंग अब शर्मिंदा नहीं है, क्योंंकि दुष्कर्मी धर्म-विशेष के हैं? वैसे ये कौन सा एजेंडा चला रहे हैं?", "architapande": "Behen jii ab khaa chli gyi... Twinkle k liye kaun magegaa ab....", "harsh_vardhan_mathur": "Sale hypocrite wapis mat aaiyo", "vardaan7.in": "TU chudail saali Ab Twinkle k liye Nai bolegi kuch @reallyswara", "786gobinda": "अलीगढ़ में twinkle को मुल्ले ने बरी ही बेरहमी से मार डाला है अब Q नही तख्ती ले कर post करते हो?", "therefor_mer": "Oyeeeeeee placard sahi ye to mein bana duuuuuuu kuch toh saram kr", "raajdevsuthar999": "Kanaiya is looking for you🤓😄😃", "akkshatchaudhary": "Cool pic", "isolated_af_": "Twinkle Sharma...3 year old... was killed by some muslim guy because of an argument but yoy whore wont raise ur voice now because u dont want publicity now.......ur no less then a prostitue.....", "its_saxena_07": "aapke ek jihadi ne ek HINDU ldki ka rape kia, aur use buri tarah maar daala....where are your, sonam's, kareena's placard of being ashamed of being a Hindustani now...???", "sudixit0102": "mr jaa dub k .", "jenapulak": "Madamji u r no more ashamed?A 3 yr old girl is raped and brutally murdered.where is your placard?", "ashu_2k15": "3 year old twinkle was brutally raped during holy month of Ramadan by md.jahid so ma'am where are you hope you also feel ashamed like before", "rudra.113": "Looking super gorgeous ....", "richa_sharma1060": "So comrade swara bhaskar u landed in ur communist paradaise👍👍", "diya_sharma2601": "Where is your finger when twinkle Sharma was raped by Mohammad zaid? Women like you should be thrown out of the country....bitch.", "ravi_itus": "Ab pakad na placard , pakad na dogali aurat . Bloody hypocrite . Tum jaise chutiye crime ko protest bhi religion wise krte ho , tere ko jitna juta maaro utna hi kam hai. @reallyswara", "jeetendra1402": "Beautiful swara ❤️", "vijay_04239": "🖕🖕", "gurjaint_singh": "@reallyswara ye maderchod ko ab bul gaye 3 saal ke twinkle ka rape because wo Hindu the Ye maderchod kise harme ka blood ha", "piyumalhotra100": "Arey BC wahi kud jaa back side me", "sandeep.khari.56": "These pseudo seculars blamed Hindustan ,Devi Sthan & entire Hinduism for Kathua but Not ONE of these hypocrites remembered they are #Hindusthan today when 3 year old Twinkle Sharma got brutally murdered by Mohammed Zahid. No placards, no protests, not even a lowly tweet. Why this selective outrage ?? Or they were not paid for outraging for #TwinkleSharma ?? #JusticeForTwinkle", "dineshpooniya": "http://thechhichhaledar.com/twitterati-slams-bollywood-celebs-swara-bhaskar-for-silence-over-twinkle-sharma/", "yuvrajsinh_b": "DO U WANT SOME MONEY !? WE HAVE 2 BHIKHARI IN OUR SOCIETY SHOULD I TAKE MONEY FROM HIM FOR U TO BUY THAT WHITE PAPER WITH PEN &WRITE THAT I AM INDIA I AM ASHAMED OF A MUSLIM GUY WHO RAPED 3 YEAR OLD GIRL ! Y DONT U PUT YOUR FINGER IN YOUR MONTH ND EYES !!", "raj_950051": "Motu", "iamgeetkoshti": "hey #Hindustan @reallyswara sorry to ruin your mood but, Have you heard or read anything about Twinkle sharma From aligarh ... ?", "vicky.tak": "फुद्दू", "masumtailar": "Naise", "raaz_goyal": "👌👌", "yashin5332": "osm looking mam🔥🔥", "priyankgandhi_": "Please stay there only India doesn't need people like u ....", "dwaipayan_": "She is a real bimbo. Congrats!", "blueseamotion": "Kaha mar gai kutti...... Aligarh me kand huva....", "dil_bole_cricket": "Aise log Desh m ldane ka kaam krte h....jb 1 cheej koi particular Dharm k against ho placard le k khde ho jaate ki dekho yhi ho rha h...bs hm hi h unke saath...n agr vhi ghinona kaam dusre dharm k Insaan k Sath ho to not a single post.... crime crime hota h usme aise log religion ka angle dhundte h taaki Bharat m nafrat fella ske....shame on you.... bloody hypocrite🙄", "desvarcs": "💫", "bing_sparks": "Marine drive wali feeling aa rahi hai😂❤️", "nomad_prashant": "Superb mame", "your_lover_1996": "I want to tight holding you in my arms. 😂😂😂", "akshay21x": "😕 ab kha pay apka plackard 3sal ki bacchi twinkle shrma ka rape huwa hai no placecard for her @reallyswara shame on you", "jayvir166": "Bahen ki lodi tuje pata hi hoga 3 sal ki bachhi ka rape karke uske sath kaisa kiya gaya hai ab tere gurde kyu lal nahi ho rahe kyu ki waha tere bhai log the 🤬😡", "_vansh_pawar_11": "Modi is best", "vicky_jat17": "कन्हैया कुमार को किसी ने गोली मार दी जल्दी वापिस आ जायो 😂😂🤣🤣😂🤣", "raj_shivaay7": "ghtia aurat..third class", "iglesias_prince": "Hey...how are you hypocrite and bkl???", "rudraprataprao": "Beautiful 😍", "afzal9056": "Vow....awesome 👌❤️", "mr_kuraish_07": "Nice", "javeedgan": "Really gorgeous Swara 🥰🥰🥰", "amolbhalerao10": "copy on mumbai ki marine drive...😍😝", "akhilesh.rajput.927": "Kha ho Abhi mam", "amazing_ladka": "Look so cute", "083himanshu": "Where is your placard now #justicefortwinkle #aligarh body mutilated, eyes gouged, acid poured on body..why are you not posting a single post about her who was brutally raped and killed by Md Jahid....shameonyou @reallyswara @sonamkapoor @therealkareenakapoor @iamhumaq #fuckbollywood #youassholes 😠😠😠😠😠😠😠😠😠😠😠😠", "prathamesh.wavdhane": "Librando.....🔥", "alam.ahmed.37": "I was not expecting the same shoe in the whole tour. Anyway, be happy as always.", "_sanjay_sinh": "Sorry #twinkle they don't have time for you, b coz tum hindu ladki ho", "7474455p8": "Twinkle Sharma was raped in ramzan month by a Muslim guy, she was just 3 yrs, but u won't be wearing a placard, bcoz u don't care for person getting raped, u care for a religion getting raped, be human not a religious fool, desh khokhla kr rhe ho, desh rehna chaiye", "supukushwaha": "Super Beautiful ♥️", "alla_the_russia": "💟", "wali_rahmani": "Keep inspiring us", "vinay_sir": "@reallyswara , You Are Just Looking Like Queen Of The Moment.", "kashifakhtar99": "Looking cool reallyswara 😍😍😍😍😘😘👌👌👌👍👍👍happy vacation", "habeebakhter": "This is wrong. You went leaving me alone and you are posting such beautiful pictures 😜😜😜😂😂", "fashion_lifestyle_store": "💋❤️", "saahiil25": "❤️❤️", "laxmanjagtap_": "Russian marine drive 🤑 #well caught 💐", "08prateekdixit": "Speechless😘😘😘😘😘", "hindustani_ldki": "Hypocrite......."}