{"zeeshan.ul.haque": "👌", "sinceresally_team_dylan": "Fire pic, babe! Let’s collab ❤️ DM @cherrychapstickswim and let’s get it happening!", "kakdebajrang2018": "Awesome pic", "mj_kherata": "Bhundi shakal ki. Budhiya", "brandteam_kenzu": "Hey Lovely, cute insta. Let’s collab.🍒 Msg main account @cherrychapstickswim and tell them we sent you!", "trail_blazer___": "Ayyeee bakrichod...😂😂", "tangentncurve": "Kaat lu 🔥", "vish_kdm03": "Hahahhahahahhaahhhaha sakal ke 12 bajey hai", "akki8rules": "Kanaiyha ne bnaye ye circle kya?", "shivani_4699": "U r really brave, opinionated and beautiful ❤️❤️❤️don't listen to those whob have done nothing in their own life other than spitting venom in somebody else's life", "heprabramedka": "Dear plz try porn m sure aap sunny leone se jada naam kamaogi aur aukat bhi to wahi hai aapki", "swaim_sumel": "Smokey eyes 🖤👁️❤️👸", "tyagidrnatasha": "🤮", "thetrippyindian_": "Bhikari", "karankumarpandey4": "🤣🤣🤣", "priyadarshiricha": "Gorgeous lady😘", "nayan_maheshwari_": "Aunty!!!!", "_theylive_wesleep": "Aapke like Ka intezaar rahega.", "iamsanjeevsharma": "Yeeeek", "md_salahuddin_15483": "🔥🔥🔥🔥❤️❤️❤️", "pushparaja.raja.9": "👏👏👏", "advavinashjain22": "Beautiful", "ghumakkadbysoul": "That's what disappointment looks like", "ajay_uikey_": "Suar jaisi sakl h yaar teri😂😂😂", "intellectualkshatriya": "Most ugliest", "sanka__aknas": "Arre madam aapka top jyada upar h thoda aur neeche hota toh jyada likes aate...aage se dhyaan rkhna madam...phir blue ticks mil jayege aapko @officialhardkaur ki tarah😍😍...aapke bhot bade fan h...aapki tareeki aur ho aur aap nya mehnge wala toy khareed paye...bss yhi dua h hmari♥️♥️ @pkmkb_bkc @cute_kattapa", "jamelh966": "💙", "hisandeep99": "Kutti sali ! Deshdrohi", "official_suraj_krr": "Gaand marwane se fursat milegi tb na😂", "yadavyadav82": "@reallyswara lag bhag 13 picture karne k baad bhi tumhare instagram me sirf 7.6 lakh kuch follower hai yani itni sare. Picture karne. K baad bhi tumhare 1 million follower tak nahi hai...is se zadq 8 ya 10million follower ek youtuber ko hote hai... Yani ki dekh lo log tumhe pasand tak nahi karte 😂🤣 aur jo tumhare picture dekh ne aate hai na log dusre atctors k wajhse aate hai kabhi naye actor ko le k movie karo pata lag jayengi aukat khud ki ... Jo tum itna bhook ti ho na sab nikal jayengi hava😂🤣", "shubhamjuly10": "Randi aurat", "sharmashiv8989": "Ap se pyar krne wale ki tulna me apse nafrat krne wale jyada hai india me ap samjh sakti ho ki apne kya kam kiye hai ab tk", "rp3732246": "सुवरा", "sahadatlaskar": "I love ur voice... Its very soothing....", "sukanya.biswas16": "Are isko koi pakistan tak. Chorkr aao... Saradin burkah k niche rahegi to mugalo ko yaad nh karegi", "meme_generation____": "Kuch bhi kar le filmen nhi milengi", "bharatcharan5": "Go to pakistan if you fell unsafe in india shitty women", "1andonlysrestha": "Sare dalle log @reallyswara ke account pe tatti karne chale aatey hai 😬 Arey bhai, ghar Mein bathroom nahi hai kya? 😂", "nitin_raj_sisodia": "She Belongs to Liberal Gang", "smrutirit": "Wahh randi mast randi ki rani lag ri hai", "makeup_by_navneet": "Disgusted. Your mere existence in my country disgusts me. You are shame for India.", "katter__hindu_": "O vibereting wali bhadwe.... Kisi khandar ki deewar pr gobar lage huye jaisi sakl wali...😂😂😂 Muglo ki aulad ...😂😂😂 Ye bta agr mugal rich the to wo ky bharat apni gand marwane aaye the ky 😂😂😂😂", "athira_rajeevan_": "The reason why are you here cuz your dad brought a old condom and it’s broken while having sex with your whore mom @reallyswara 🤣🤣", "pranay4u": "So ugly🤣", "varunn_sing": "Boycott her movies", "chinki200": "Talented my foot isko ungli dalne ke alawa aata hi kya h 😂😂😂 aur yeh aur actress wht a joke she is just a sympathy gainer pr yeh sympathy sirf kanhaiya aur desh drohiyo ke liye nukalte h", "xangeena7": "Dope😍", "ajittesh": "Ugly bhaiya Rani 😁😅", "flavourpalate": "Check out our page😇", "_arzun11_": "Sasti Actor.", "bhot_kamzor": "Mam... ye maadarchod log kych bhi khe.. aap bhot achi ho cute ho... m big fan of urs..❤️ u are in my heart... inki baato pr dhyan mt dena...", "mishra_anjali254": "Natural beauty", "dudes__love": "Rand hai Tu Randi baap se chud ti h Apne tu", "snaanvkeyeann": "Kanhaiya kumar ki asli bandi @reallyswara", "wasif_wq": "As breathtaking as it could possibly humanly gets🙇🏻🙏🏻‼️", "prashaantpandey": "Y r u anti Govt?", "ankit888888": "Sadabhaskar", "realsanjog": "Amazing", "art_journey_with_pallavi": "#PanoutiAunty", "shivanii0701": "❤", "thakur_sherkhan": "A piece of Shit, we know your fingers are free now, stop your drama on Twitter. #AntiNational.", "sachinsachee": "💙", "amanm104": "BC h sali. Madarchod", "yadavinder416": "Sonam Kapoor ke saath rahegi to gaali hi khaegi", "rry045": "@reallyswara yr sbke comments pd pd k...ab mereko b tum hijda dikhne lg pdi ho", "malkova_mia449": "Fingering queen 🖕🖕🖕🖕🖕", "ankit410singh": "@reallyswara that look and the way u eyes are 🌺🌺♥️♥️", "kumar.rohit71996": "Dslr se to achhi dikh jaogi.. Par man me jo jahar bhra hai desh ke parti anti national hone ka.... Vo to dikh hi rha h na bahan.. Kabhi ham bhi tumare fan the..", "pankaj11wable": "sadak chhap artist with sadak chhap mind", "jstprachi": "🐷 exactlyy same", "humourshot": "Queen. 🙌🙌", "deepakthakur2436": "🖕", "sharpsharp81": "Jahil ki olad chera chola Dnsty ke Bare me padh jake gwar or Sun Mughal ane Say pehle Rome tak India vaipar krta tha tuje ye sab pta nahi hoga kew ki tu 10pass krke gandu panti me Lag gyi hogi sali do take gwar", "vikassingh9625": "Sexy", "shrividi": "😂😂😂😂😂joke", "mr_beast_rahul": "Maderchod Randi ke bache toh jake Muslim se choda", "i_deshrajshukla": "Sakal dekho kutta bhi na pesab kre chehre pr🤣", "rajatdas5200": "Nikal lawdi", "harshit.choudhary": "Most talented 🤣🤣", "mr_aaradhya": "Iske baap ne sahi time par withdraw kar liya hota to aaj ye nahi hoti😂", "rapmytrap21": "Dot dot dot", "sid_jaiss": "Koi iske muh m pani maro kitna tatti lga hua h koi hatao bhai", "amitdhull2": "Bitch", "sachinsinghcool5": "kaha chupi hai re tu randi saali richa bharti ke case me muh nai kholegi secularism ki rand saali", "kapiltiwari560": "Swara khan", "happylifefeeds": "Mughlo ki aulad ..publicity stunt k lie kitna nechey girna h ab tujhe🤬", "mukeshsharma19_": "One of the best terr.....", "rameshvirani_art": "@reallyswara never get let down by these asoles like @sudixit0102 them are pure failures in every form of life and this is their medium of frustration removal. Aapni nakamyabi ka gaam kese chupayenge", "rocknaik": "Sali kutia", "avinash_verma721": "Manhoos swara", "imshivanitanwar": "Teri maa ka bhosda nai kholke Gaye Mughal Randi kutiya.", "crazy___elights___": "You r awesome swara😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘", "mr_cannibal__": "Big fan... Bas ek baar mera kulfa kar liyo 😂😂😂", "raj_mandaliya91": "Aa gayi pakistani and mughalo ki aulad", "a.sha.2019": "शानदार अभिनेत्री होने के साथ-साथ एक अच्छी 'Activist' के तौर पर मानवीय चेतना वाली समाजसेविका भी है।", "amk7865544": "UGLY please leave the industry already", "itz_mohit06": "Bore ho rhe the soche ke swara bhoskar ke id dekh ke khud ko entertain kr le", "anusmita._": "Maybe Mughals made her beautiful and talented", "amishpatel05": "Your parents today would be like... Uss din nai Kiya hota to acha rehta 😁", "kunj__rathi": "Social media ki Randi hai @reallyswara Jo mugalo se Roz chudvati hai #fuckoff #bitch", "priyankasanghvi.in": "Hi. Please check out our page. We're a newly launched label with minimal, contemporary and bohemian-luxe Indian wear for awesome, free-spirited women just like you! We'd love to know what you think :)", "gauri_kantinath_sankhe": "Wish you a Happy Gurupournima.. May Almighty bless you his choicest blessings. Thanks for imparting your knowledge with me and standing behind me always. Without you i couldn't be here at this position. @reallyswara Gauri", "pratik_ghodmore": "Like ur tatoo u will fade out soon ...anti National.", "skrakibab": "How can i ever thank you!! You're a brave super honest heart indian tin cell town has!!Saachi Baat kheney ke liye jigaar chahiye!!! Behen tere jaisa Jigaar akkha India me iss waqt kisiki paas nehi hai!! Saab saaley kuye ka mendaak!! Saach bolna assaan kaam thodi hai!! Behen aap ko darr ne ka nei!! Aap kisiko Darr ta hi nehi!! Jo aap ke khilaaf kehete hai uss kuttey pilla ka aukaat hi nehi rehega aap ki saach ki saamna karney ko!! Mera dil.,mera Imaan,Rishwas,Mere Palan karta aapki.saath hai!! Bharat ki mitti mei sabka khoon samiti hui hai!! Kisi kaa Baap ka jageer nei hai ye!!", "imarjuna": "Sometime eyes say a lot 😊😊😊", "ishan0555": "🤮🤮🤮🤮🤮", "harshit_chauhan.messi": "Terrorist", "mayurchapatwala": "Itni gatiya soch lati kahase ho ki mughalo ne desh ko rich bnaya? Ke koi special course Kiya hai? 🤣🤣", "nilu_kumawat_7019": "❤️❤️❤️❤️💕", "nirmalkholiya": "Only for reading comment 😂😂😂😂", "dharmendrakoiry": "Isko kaun log like karte hai ab to a anty lagti hai kaam to milne se rha _par gaaliyo me yaad rakhna", "nandeep_nandy": "Talented😆🤣😂!", "zain_official01": "Zain inform you something.. Your beautiy harmful for young Bloods 🧡 😉", "narendra5407": "I love Modi❤️", "arpitsri1998": "Beauty of rakhi sawant> swara bhaskar", "mayanksharma936": "🔔🔔🔔🔔🔔 Most talented Actress 💩💩💩", "chetan15_": "Those Who Hate Swara Bhaskar why are you here??? Nikal Laude, Pehli Fursat se Nikal....😊🙌", "mohit.kumar2192": "@reallyswara chi chi.. 🐷🐷🐷", "priya_drall": "Ek ye h muglo ki den Bharat ko. Dekho terrorist log gaddar hi de skte h.", "sakth_launda_saurabh": "India bare me ab kya aag ugalne wali", "harshad_nagar": "https://youtu.be/2Zm2Xvjq0KQ", "dimpichoudhury99": "Pagal aurat", "rahul_patani01": "Bhagvan itna ganda muh kisi ko na de..! Mat lagaya kro aunty aesi pic.. Bachche dar jate hI😢😢", "vishnu.ambattu": "💖", "goel6399": "Hot❤️", "satyamthakur693": "🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕🖕", "healthgoal2335": "Ye kya tatti shakal dekha di instagram ne suba suba💩, insta maaf nh kruga tuze", "ravinderkumar.kumar.9": "One of the qualified and best actor in Bollywood", "sarthak20031993": "You know you are too calm to these chutiya bhakts commenting here .. better to block them sabki akal thikaane aajayegi", "imrohanprasad": "we knw u are not getting any work in movie, But it is wrong to give shitty statements every time just to be in limelight. Aise hi chalta raha toh kya pata kisi din tumhe koi tatti si movie mill jaye or usse theatre mein dkhne ke lie koi b audience na ho.", "pratap.banerjee.3990": "Nikal sali phaheli fursat me Nikal koi sazurat nahi Hindustan Ko teri Nikal chutia sali.", "satishrajput72": "She should marry with kanhaiya Kumar🙌", "083himanshu": "Tatti face 😂😂", "varad_kulkarni.7503": "😂😂", "adarsh__das": "Agaye to modi hi 😁😁", "nitin_5566": "Swara... I recently know about u , and i m really a fan of u now..... I support ur political views also", "mistygoblet": "You all commenting on her looks. Not to mention ABUSING HER. And want a nation where everyone is treated equally without any discrimination. If you disagree with her thinking/opinion you can do that without using any pathetic language. \"YES YOU HAVE FREEDOM OF SPEECH. NO YOU CAN'T ABUSE OR DISRESPECT ANYONE\".", "sarvamdawer": "well that was an amazing joke in your caption!! talented actress😂😂😂😂 then how come u only get roles of a dumb girl whose screen time in whole movie is less than the end credits😂😂😂", "prtci": "Cool pik", "vikky0115": "Nice tattoo😉", "rahulpatel_______": "Apna stardome khud se gawana .. 😂 sala millions bhi pahunchaparaa itna tym hogaya logo ko jante hue .. Or karo bjp virodh m chutiyapa ... Nd i will definitely wait for ur reply .. Swara 😂", "ansh1293": "Jitna bada iske kan ka bala h utna bada to iska hole ho gaya hoga use hoke, picche ka to pata nhi kitna bada hua hoga 😂😂😂😂,", "ankyankur3": "gali dene ka mn kar rha tha achank se ye dikh ki... chutiya ki lodi", "katrinakaifgoddess": "Really Randi Swara", "chirav_parmar": "ugly", "rameshb25": "Dusra hath aur ungli kidhar hai .@reallyswara", "samajwadi_bhai": "वाह!💞🙏", "ehsaanwasim": "Fabulous", "rajuganesh39": "Anti Indian woman list", "bhakti_2098": "Modern look me photo shoot mujhe laga tum anarkali dress me photo shoot karogi #mughal desh ko rich banane wale 😂😂🤣🤣😆😆😆😆 history ki book phek kar tera thobada phodana chahiye😡😡😡😡.", "ahmad0tarar": "🤬", "mamta_kalra19": "Unlike", "indiagreat367": "bat ni bani. low neck try karo", "samriddhi116": "Yah i knw this is potty", "rupali7290": "Looking nice dear", "jaiswal_dude": "Ek gajab ka Nashaaaaa hai pose me..🔥", "wired_weirdly__": "The moon shines because of the Bhasker ☀", "abhaykumar9924": "👌", "yogeshpandey653": "@spnu", "abhijht": "Sunlight beauty❤️", "ali.mohsin64": "Beauty of heaven 🙌", "ketstar14": "Ye Paidaish bhi MUGHALO ki hi he ... kya aap muzase sahmat he ?", "fizzzzzy_shaikh": "Itni nafrat sb laatey kahan se hai jisne hamara tou kch nai bigada itni gaaliyan itni nafrat kya wakayi hamara dil itna kaala hai shame k humein aisi dunya bhi dekhni pdh rhi hai", "humans_fight_back": "Could u please talk about Shiva ji Rao and Bhagat Singh. Chamchi. We only want justice not dominance.", "deependra2312": "Beaut😍❤️", "anila3617": "Did i saw rakhi sawant pic😜", "just_kushalvi_": "Nikal lavdi pehli furset ma nikal", "iamrupeshsalve": "@reallyswara 😍😍😍😍😍😍", "preetam_narnolia": "Kya khub lagti Ho. Bdi \"Sunder\" dikhti Ho. 👌👌👌👌", "malove_praveen13": "🔥", "shankar_rankawat": "Kuttiya sali", "realtypreneur17": "You are that great example, which every parents give to there Indian daughters saying \" beta badi hoke iske jaise mat hona\" shame on you @reallyswara", "_milan_009": "🌹🌹😍😍😘😘😝", "rintinintin": "By your logic, molesters help women come out if their shell", "m4maheshmicheal": "Beautiful", "kasish1448": "❤️❤️", "dhruvpriyanka188": "😝😝😝😝😝😝😝😝😝ewwwwwww", "imush52": "👍", "iamsameer_choudhary": "Beautiful 😍❤️ @reallyswara gorgeous", "letsclickit": "Stunning!!😍", "ommchaturvedi": "💖", "singh_11297_rohit": "Arey nhi 🔥❤️", "run_rahul": "Swara Teri Chut me Chatri dala na to bahut Sare Mughal niklenge", "vikramkanojia921": "Real beauty💕💓👌", "sandeep.9t2": "Wow", "pratik_shirole_ps": "Simply cute", "qazi_000007": "Waooooo👌", "kumarritesh70335": "Hramjadi kutiya....", "shalininegi_96": "Itni Editing, makeup, photos, ke baad bhi jo ldki badsurat lage to fir kya kahe,", "rajeshjain17588": "It's really nice pic mam", "tarun.nayi": "U looks like full moon 🌕😍", "ravi1238": "Shades of Moon!!👌👌😘😘 So beautiful Tattoo!! Look so Gorgeous every time ...", "chandrchat": "Slutty Mullifucker 💩💩💩", "rajeevverma5156": "Ekdam Gandi lg rhi ho 😱", "santhoshbilla93": "OMA💞💞", "chinmay_sabnis": "Talented😂😂😂😂", "aroon.rajput": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥😘😘😘😘😘😘😘😍😍😍😍😍😍😍❤️❤️❤️❤️❤️❤️❤️❤️❤️🌹🌹🌹🌹🌹🌹", "bhushanrajput": "❤️❤️ beautiful", "bollytoholly": "So akbar was your father?", "naeem3388": "Gourgious 😍😍", "manishprakashk": "😎😎💞💞💞", "varadaraj_naik": "Looks like mughals noutanki", "rashidi_212": "❤💙 from 🇧🇩", "punit_jagnani": "♥️♥️😍😍💋💋💋", "jaml1957": "Gorgeous💖", "therealgaurav_batra": "❤️💓", "vaishnavi_bhagwan": "Hi mam", "the_defender7": "moon with all expression of moon...😍😍😍😍😍", "adilrind88": "My love", "arjunnbunty": "Really Swara💚", "md_kaseem_salmani_": "Hiii", "deepak_karadiya": "Aaaa thooo 💩💩💩", "sarin_desai123": "Beautiful God bless you", "indraneelsom": "Mughals had made u🤣🇮🇳", "naveenvakade": "😎😍❤", "diksha_shrivas": "So beautiful ❤️ love u swara", "rajeevkumar5273": "Beautiful", "vineet_srivastav17": "Amazingly beautiful😍❤️", "the_warrior_marshal": "❤️❤️", "mcingh": "@reallyswara I love this Sun & Moon Tattoo of yours. God Bless. 😘🤗", "diwakark111": "❤❤❤❤❤❤", "rameshpatel7532": "😍😍😍😍😍", "theproactivesloth": "@shoegal_19 do you like this tattoo?", "asifrahman3388": "One of your best picture. Stay blessed", "ethereal_pri": "Lots of hate to you @reallyswara", "sureshchettiyar": "Casual classic", "nerruoberoi146": "Lovely ❤️", "md.munna.bhai.143": "👌", "being_ahmed7": "😍😍💓💓", "pinky_mua_thakur": "Tattoo 😍😍😍😍😍😍", "raw_knee24": "Most talented😂😂😂 best joke🙌", "vishalrajputvicky_official": "🖕", "rocky90rock": "Killer 🔥🔥🔥 @reallyswara", "ravi_ahuja72": "👌👌👌👌👌👌👌👌😍😍😍😍😍😍", "hindu_always": "Muglo ko najayj ollad", "devilosaurous": "Adorable as always❤️😍", "sonamalik989": "❤️😍", "manik.kapoor.88": "Super hot", "shilpa.kpr": "Wow", "deep__307": "👌💥", "manjarisinghofficial": "Stunner ❤️", "shivam_mishra7670": "Kutiya lag rahi hai .........", "mayank_saluja_forever": "Beautifulllll Ur d most beautiful", "aslam_r.ali": "Tatto dorry", "terrace_gardening333": "@reallyswara ❤️❤️❤️❤️❤️", "manal_khan2009": "Beautiful", "prudhvi.kodali": "❤️", "__jackreacher__": "The sexiest bombshell of Bollywood 🤣😳😉", "sandeep998": "Kuch bhi kare le aye modi hi", "iamarun_george": "😍😍", "ihansraj": "शानदार !", "ashrhzk": "Looking hot baby......", "maahi_ac": "😍", "jhoney_dubey": "Isko Dekh kar gali nikalti hai saali terrorist madarchod", "nilesh.kute": "Beautiful 😍", "meer_asif_ali1": "Bhakts hogayi subha? Shuru Karo gali bakna", "imrantinkuasn": "🔥", "arkhyd999": "Gorgeous Angel @reallyswara ! Lovely Smile and Nice Expression!", "djthegr8_710": "Unglibaaz🖕🖕🖕🖕🖕", "gurmukhsandhusunam": "Great", "kanhaiya889": "😍😍😍😍", "faisal_deverkovil": "@reallyswara amazing💕😍😘😘😘", "akhilesh.rajput.927": "Aap bahut Aachi lag Rahi ho I am big friend you", "darshana_chatterjee": "👌👌", "firoz.lv": "Always Beauty cuteness overload♥️", "sixteabag_abs": "Ungali😍", "afaq.ahmad01": "❤️", "govindyadav7202": "Nice pic", "malikreyansh278": "Ye ladki bahut hott h bosss 🔥🔥🔥", "masood_saravu": "🌕🌖🌗🌘🌑🌒🌓🌔 ✌🏻", "swooshil": "Sad to see some dull minds here who always come up here for thrash commenting. Shameful.", "jitu_573": "😂😂😂😂😂", "rajeshkumar0910": "Nice 💞 😘", "jahil_pm": "I like your lips always....pahli bar aapko Maine Doordarshan pe kisi program me dekha tha..aur every episode Mai dekhta tha sirf aapko dekhne Ko aur aapko mujhe kisi ki yaad bhi dilati thi... really you are very talented thanks❤️", "ash__khann": "😍😍", "naanu_vijay": "Beautiful💙", "agsilverline": "Talented ??? 🤮🤮🤮🤮😂😂", "yadavyogesh390": "Shrma kro yar thodi......Indian ho...Jo aise stemnet de rhi....I m ur big fan....lakin us din se nai .....RHA ....jis din se mugulo ne....India ko reach bnya tha....bullshit", "mrperfectonee": "Anti national sakal se hi fraud lgti h kitna v dslr effect ho jaye", "___sneha12": "😍😍😍😍❤️🔥🔥🔥🔥👌🤗😘", "rahulsinghr441": "👌👌👌👌", "luqman_hakeem_hak": "❤️❤️❤️", "mohmmad_shakeel_official__user": "Betifull 😍😍@reallyswara", "suraj_d_patil": "😘😘😘😘😘", "varshneyalok": "Silly girl paki", "devendra_hoon": "6", "nofukenway": "Cool tattoo.👍", "b_s_k_6009": "💣📿📿📿📿📿🔥😙😙", "aparna_9221": "@reallyswara the way you are going will soon discover rakhi sawant level😂 what a moron,no knowledge", "priojitkeisam": "Vibrator wali shameless aunty 😂😂😂😂😂😂", "vishal3vedy": "❤️", "santoshrajat": "Preprocessing♥️♥️♥️♥️♥️👌👌👌👌👌👌👌👌👌👌", "vinaytyagi181": "Look beautiful mam", "tranquil_dreamz": "Undoubtedly one of the best actresses and it is a beautiful shot❤️", "sunil__goswami": "❤️❤️", "yuvrajsinh_b": "#shame #sttentionseeker", "pandeyatul348": "एसे लग रहा बहुत मेहनत कर रही हो आजकल", "blkalesriy_": "Very nice ji jai bhim jai bharat", "ndutta555": "U r so beautiful God Bless You Swara..😍😚😘👏👏", "sudixit0102": "tu shakal se hi hijda dikhti hai.", "akshaykaroliya": "Is it new one, tattoo @reallyswara", "sylvesteralvares": "Love the moon tatoo on the shoulder 😍 Nice click", "chouhanabid": "So Beutiful swara ji", "_iamrehan_": "😍😍😍😍", "maddybeingmad": "👌😍😘", "cutecheekstravel": "She is magical", "words.of.word": "I'd look into those eyes, Freezing time while it flies, Energy warmer than fire, Such is this desire, To hold you under the sky so blue, While I'd pray for you to be, a dream come true.", "niteshsingh2610": "Rakhi sawant part 2 🤣😂😂😂", "theskynik": "Absolutely magnetic💗👍👌", "sachinjoshi77": "Muslim secular", "the_wolverene": "Gorgeous woman 😘😘❤️❤️❤️❤️❤️ @reallyswara", "rayezadha786": "😘😘😘😘😘😘😘😘😘😘", "beingrealakaash": "❤️❤️❤️", "virendraktiwari": "La jabab ek namaste 👌👌🌹😍❤️", "shweata121": "Lady crush❤️", "zafar.osman.ali": "Sexxyyyy 😘😋😋😘", "08prateekdixit": "Speechless😘😘😘😘love you forever n ever n ever😘😘😘😘"}