{"yashaswi.pandit18": "साली जिहादी kutiya", "srajan_mishra_ji": "🔊🔉🔈🔇 इस देश मे स्वरा भासकर और कांग्रेस के चमचो ये ज्यादा भक्तो की संख्या है इसलिए फ़टी पड़ी है फ़र्जी secular पिल्लो की.. भक्तो के आगे भिगी बिल्ली बने भागते से सब जिहादी कुत्ते 😂😂", "hotshot_nikhil": "maa chodne ke liye teri", "ritikraj40": "Beauty with half brain....... Beauty jisse secularism ka keda kat gya", "shivamchoudhary25": "Teri maa ka bhosda randi chudi hui raand bhen ki lovdi", "abinavsingh566": "tere maa ko saur ne choda har hindu ka land teri maa or teri khandan ki har aurat mai tere maa ki chut mai awara sauro ka land tabhi to saurni hai penchodi", "ayatmdrehan": "😂😂😂😂", "bind1165": "Ek mahila se itani nafrat sirf uske vichar sahi ke sath hai... Gay ka dudh pathhar pe chadha Kar gay ka mut pine ke shoukin se yahi umeed ki ja sakti hai", "amankchauhan98": "Teri chut dekha kar bhaag rahe hai", "alfa_4g": "Mughal ka muh me liii thi kya madarchod", "namr.ata02": "Or tu kya hai mullo ki chamchi.....chutiya", "abhimanyuarunpimpalwadkar": "One a single class of shit people is happy with your post... Shame on you .. It seems someone insists you to post this shit like ur nature and face", "sardarni1092": "❤️❤️❤️❤️", "cheeky.ron": "I think @reallyswara really revels in ANY attention at all", "arpanrc": "Bhakts r far far better than traitors. TMKB", "hindu_eye": "Ok 👌kon is gali du sochna padta hai 🤦🏻‍♂️", "nayan_maheshwari_": "Aunty ko Twitter chalna aata hai !!!! Surprise!!!!!", "cosmojitu": "😂", "subuhi_786": "Yes mam you are right.. India exists coz of mughals💚❤", "iamali.cr7": "😂😂", "noorulmubinn": "🤣😂🤣🤣😂😂", "shubhamtacker": "Are randi tere chut m bhakt ka lund pdega vo bhi sudol lamba. Randiyon ke maha randi", "sara.zafarudin.tariq": "She's is right in a way mughals made India big geographicaly and gave Hindu and Sikhs proper shelter security and liberty to reign of ther own small portions", "jaglanabhishek": "अगर इतनी ही चिढ़ है हिन्दुओ से तो तुम भी पाकिस्तान चली जाओ,😂😂🤣🤣", "monali_thakore": "😹😹😹 still! It doesnt makes you right no😂😂😂", "arjunnpatil": "Terrorist swara Khan . Nikal bhikari ...hamare akhand Hindu Bharat mein Tere jaise suar aulad ka koi Kam nahi 💪💪🚩🚩 nikal lavdu", "ab_ahir_11": "Lehenki bodi tubhi nikal pehli fursat me mughal chle gye tubhi nikal", "vinittkamble": "Hey anti national", "rmahajan59": "😬😬😬😂😂", "baba_richirich": "Yes bhakt but Desh bhakts you scum", "deepsuman09": "Swara bhaskar tweets tatti..and deshbhakts don't like to be around shitty things or shitty people as a matter of fact..", "pawaramol3601": "Chutiya", "rushabhkanu22": "🤣🤣", "the_mysterious_treasure": "Earlier I thought you talk logically!! but now you turned out to be so pathetic with your tweets. Being a military brat how can you even go to that level of disgust?? Don't I feel any shame on yourself???", "tinyy_words": "For seeking attention she is becoming shameless dayby day... Iski dukaan hate comment pe hi chl ri h... Comment hi mt kro apne aap line pe aa jaegi", "nathawat__sahil__": "Muh se mat hag... 😂", "maitreyityagi": "What a stupid post. I used to like you before not anymore.. Pls don't use such petty posts to be in the limelight.. people won't even remember you.", "arjun_teotia": "we are the fucking right wing and beleive me we are not going anywhere", "rahul_rajput2327": "Hum bhakat to tu libarandu", "ravi887": "Ye chutiya ladki pakka Pakistan ka history pad Rahi hai waha same aise hi bataya jata hai but ye to shayd indian hai na phir waha ke madrsa me padhi kaise😂😂😂😂😂😂😂😂😂😂😂😂", "vaishhh.__": "@reallyswara toh fir Nikal Pakistan deshdroyi saale. BJP Congress ka chod re Phele Indian ban mc Portuguese Mughals soo many people ruled us and you're telling shit celeb. India was rich that's why outsiders came and ruled us. 🙌 Madarchod Buddhism Jainism hindusim was the only religion born in India Portuguese and Mughals wanted to always spread their religion that's truth. They are not Indian religion . Pakistan Chali jaa re", "nawazalig": "@reallyswara u just Nailed it Babe 😍❤️😍😘😍😍"}