{"lisamariahpresley": "Thank you for sharing your story Evyan! I have been scrolling threw the comments and lovehow honest, open and respectful this communitty is! Helos me a lot", "anicanovosel": "I find mayself after long time ,come home and love may vagina and may orgazam,great feeling♥️", "eccentricjukebox": "I love the purity and directness of this photo... the nakedness with zero self-consciousness. Although you're holding the High Priestess, I see a lot of The Star in this 💜 I had a couple of rough weeks adjusting to the new status quo, but last week took time to have a bath and go slow with myself, and my sexuality came alive naturally, almost with that feeling of \"'course I'm still here, whenever you're ready\" :)", "shalisinstitute": "Beautiful body and mind😍🔥🙌🏼", "_chiaar_": "Thid photo🔥🔥🔥 i love the tarot in your phone case!! Talk about manifesting 😍 i am going through my first breakup right now and my sexuality was already low. I have been stuck in mindless porno scrolling quick orgasming for forever and i am trying to break that for some time. Definitely working on sensual dance and seeling pleasure in non erotic context", "alvarobarrington": "Love this", "amanda.kosko": "This really resonated with me. I have been carrying stress about fertility for months and the past few weeks have seemed to exacerbate the disconnect to my sensuality. Just trying to be gentle with myself. And trying to make time to reconnect with myself and my partner. But since I so badly want to conceive, I'm finding it difficult to enjoy sex for pleasure. So I'm digging deep for both patience and forgiveness. Hopefully I'll have time for a bath tonight and can light some candles, bring in all my plants and crystals, and relax ❤️", "jacquesalt": "Thank you for this post and making space for people to share on this. It's", "cpr2323": "thank you for your vulnerability. and for sharing your deep beauty :)", "sophie.jaffe\nVerified": "Verified", "joyfullyjanelle": "have to say: what i love most about this photo is that your hair isn't out. they're in these gorg yet functional Bantus. sometimes i struggle to feel sexy with my hair twisted up. but this was a good reminder that it's STILL sexy. pleasuring myself has been very grounding for me, especially during this time. just need to be mindful of my intention (doing it not to kill time but enjoy myself).", "runaway_daydreamer": "Reading through the tender comments on this post is very sweet and beautiful. 💜 One of the bright things in my life right now has been rediscovering the joy of sexting with my partner...it’s so fucking fun 🥰", "la_brujacita": "I love this. It’s both sexy and sensual while also being tender and vulnerable. What a great photo. And a great message.  I’m feeling very similar to you. My partner and I “broke up” right before lockdown and have been stuck together since. It’s been a battle of boundaries, and I feel so conflicted every time I give in to sex with him (not being pressured into it, just me wanting it) even though we’re in limbo.  Part of that is feeling very low desire - I have depression and the isolation has agitated it. I’ve been interested in other people in my life but haven’t been able to get any reciprocation, making me feel undesired as well. I keep falling back to my partner o think out of fear of loneliness or the battle that is finding someone new, even better for me. I can’t wait for this to be over so I can go out, be free, meet people, flirt, and remind myself that I’m worthy of being desired and loved and sought after.  Thank you for this much needed post.", "kgingyging": "I have been experiencing a complete disconnect from my body. I don't want to feel things right now, I just want to be numb. All of the crazy stress in the world has been hitting me, along with starting graduate school this month. It's been extremely hard to make any time to check in with my body and see what's going on and I feel the side affects.", "sydneyraechin": "My libido fluctuates daily; showering and bathing help me renengage with my sensual self", "kailani_coleman": "So interesting that when this started I did a 7 day fast. Fasting from sex and masturbation instead of the traditional food fast. I learned so much about myself during those 7 days and broke down so many emotional traumas I didn’t know I had regarding love and sex. But after the 7 days I was masturbating pretty much every day after that but this week I Kinda haven’t been in the mood for some reason I feel like I’m also still discovering a lot of things about myself. Also the fact that an ex that I am still in love with is about to have his first child so I’ve been experiencing a lot of really weird emotions with dealing with that and myself and finally moving on from that relationship for good.", "thisislauraluna": "I am really lonely and want to be desired... this is translating in to sexual energy but what I really want is a sexual exchange with someone else. I kinda had a partner but I had to leave him in the US and fly home to the UK, he got depressed when I left and we’re effectively broken up now, we barely talk. I miss him and I miss love and I miss connection and I miss the happiness another person gives me so much 💔", "jahfeelss": "So I think the rest has allowed my sensual side to open up. I've been making some really sensual videos on the Triller app. I keep them in my drafts but they just make me feel soooo sexy. Even in my grandma's night gown.", "wildlilpeach": "Will you be guiding us through another sensual dance meditation tomorrow??💗💗", "unlearningpurity": "Wow I’m fucking crying right now. I needed to hear so much of this just to know that I’m not alone. Thanks Evyan", "halleyrachel_94": "@j.raicoviluna", "dj007im": "Beautiful gorgeous cute 👌🏼 preety stunning picture 🖼", "victoriakeendesign": "hey Evyan~ I am packing up u haul pods to leave LA~ I remember what happened but not the details~ any tips on how to avoid that? we had exchanged messages as I wanted to gift u some clothes when u got here but i think u were ok. thank u 🙏🏾", "pinkbunnysf": "It's such a beautifully intimate picture. Thank you.", "wildwounds": "My partner and I are connecting way more and realizing we had a lack of boundaries with our jobs and it was really putting a dampener on things. Good realizations ☺️", "jenniferrobin8": "So interesting. I've felt like I've been in quarantine for a long time now. I'm alone and going through healing.... Actually, idk that I've been healing. What i do know is i haven't been in touch with my sexuality for a very long time now", "_aggressivelymediocre": "I’ve recently been thinking that stress also kills my desire, so it’s really helpful for me to read that from someone I respect! Thank you ! 🙌", "jenniferpelota": "A few months ago a suffered neurological damage because of a reckless doctor, and it’s turned my life upside down. My career—any semblance of any career—is over forever. I’ve had to move home with my parents who are still staunchly committed to a religion/culture that is highly sexually shaming and rigid. My symptoms are so extreme and strange that it makes my closest friends and family members quite uncomfortable, and I can’t help but face the likelihood of never having a sexual partner, let alone one willing to invest in me long-term. My lifelong depression has crashed to lows of consistent suicidality. I’ve been trying in the past few weeks to nurture my sensuality and sexuality with gentle exploration and kindness. Only once in my multiple “sessions” per day have I found a small semblance of erotic pleasure in touch and solo sex. Orgasm has been far, FAR beyond the possibility of reaching. In my day-in, day-out anguish I try to offer myself compassion in many ways, but especially in this area. My brain has changed mentally, emotionally, and neurologically. I have to relearn pleasure, and it’s a possibility that orgasm may not be physically possible anymore. And for each time I tell myself that that’s okay, I look forward to the day when I believe it.", "gab.bbyyyy": "I’ve been having great sex with myself. It’s been all over the place but remaining connected to self has been a saving grace.", "amore.s_": "Tbh...I feel the EXACT same way that you described. Wow, I can’t believe someone relates, thanks so much for sharing.", "sisithelyricist": "What’s the book you read that you mentioned in BGIO’s publication that you said helped you to begin your sexual awakening? It was like the diary of someone or something I think....", "janashareswithyou": "Honestly, I’m a bit confused as to why I’ve been horny every 👏🏻 single 👏🏻 day 👏🏻 for the past 2’ish weeks now 🤔 I haven’t had this kind of sex drive in years 😳 The feeling is so pronounced I’m not even too lazy to use my hand 😂 Normally I would reach for a vibrator, but the last one broke down 🤷🏻‍♀️ Some days it’s really consuming 😂 It’s really odd 👀", "daneeeeka": "@strawberriesandfigs", "ether_howls": "🙌🏼 this a.m. I masturbated for the first time since right before quarantine, actually. I'm not around anyone I'm usually intimate with . And it felt so dang freeing ⚡", "chefbelive": "GoddessDivine💞", "ashus2ashus": "Ahhhhh 😌😌😌💜", "djaidanadege": "Whew. My sex life has been rough lol. My partner and I both deal with anxiety and with this pandemic our anxiety and stress levels have been heightened so there are times where we are on opposite sides on the erotic desire spectrum and times where it syncs up. I think because we’ve been so anxious and have felt really uneasy that we more so want to feel comforted and sexual desire comes second. My sex life with myself has been a little dry. Because there are times where I don’t connect with my partner in a sexual way, when I do feel erotic desire I turn to him, and when he says he’s not really in the mood, I get a little disappointed or when I do want to get off I’m emotional tired and physically tired from being anxious, sad, feeling grieve, and anger. All of that causes me to feel disconnected with myself and my body. But I have a morning ritual where I journal, pull a tarot card, and meditate for at least 10 minutes to connect with myself. I like lighting candles and incense as a form of aromatherapy. Singing and dancing has been really helpful. I participated in two of your sensual dance mediations and I have been trying to incorporate that in any way daily, so thank you for that. I adore you and your platform. It’s inspired me a ton 🕊🤍", "mypupusas85": "I really needed to hear this. Thank you so much for your words.", "pulchritudinouspeach": "It has meant that I cannot take my joy for granted each day. That if I don’t actively participate in creating it, it may not come. That I can’t wait for joy to find me. #littlelessons", "kierrafosterba": "Thank you for your wisdom and insight. I have been seriously struggling. I live alone and have been deeply missing/longing for physical connection. I have been full of self-recrimination because I have conjured up a loving partner.", "_lolafree": "I’m actually pregnant (quarantine baby lol) and my sex life has been up and down. I try to be intimate with my husband in some way everyday but sex hasn’t been on my mind like I want it to because of the stress of being in my first trimester (feeling sick and all that) and the stress of this pandemic. Your sensual dance meditations have been super helpful getting me back in tune with my body, including making me feel connected to my lil bean inside me! I’ve also been trying to do yoga. I want to have sex and the few times we’ve done it were AMAZINGGGGG so I’m yearning for it but also feeling yucky. It sucks", "ashantidoll": "I feel like I'm giving myself tons more self pleasure since being home. Maybe sometimes out of boredom horniness too? 😅", "bookishwinterwitch": "Would you be willing to share some of the ways you’ve intentionally stayed connected with your sexuality/sensuality? I relate so much to this and it’s so hard ☹️", "crystalcrissandrews": "I have been tempted to eat more sweets lol. I do feel like some days I’m connecting with my self and partner more but other days the fear, stress, and emotions cause me to want to distance myself from him. One day at a time, I’ll keep practicing embodiment. Yoga, prayer, dance, and mediation help me find peace, joy, and connection to my Self and I rediscover my sensuality much more easily that way, when it’s not forced but welcome. 💜", "aventuras_de_ilia": "@evyan.whitney thank you for sharing your beautiful photo and words with us! I've been to all 3 of your sensual dance meditation lives, and have been trying to stay in a good place sensually and mentally. It's been a struggle, but your work and showing up as you are to give has been helping me so much! I got stuck in texas when all the borders closed, so can't be with my partner who is in Argentina... staying in my parents house makes phone sex very difficult, but not totally impossible. I've bought and treasure my chakrub, based on your recommendation, and am working on building a relationship with myself.", "lady_kudra": "“There is nothing quite like having your sensuality affirmed by your own gaze” ✨", "nativawellbeing": "My partner is stuck in México. At times I've felt extremely sensual in theory (fantasizing or musically), but feel completely disconnected from engaging with my body.", "dirtycaffeinater": "Gorgeous🌸🌷", "barefoot_bella": "Today I woke up and did the same thing because I had been feeling mostly the same way. I just felt shitty and I really wanted to connect with the sensual and sexy part of myself... so i took a sexy photo and posted. Love to you. Thanks for sharing. 🖤😍", "lochnezzie": "I’ve also been thinking about this a lot. Thank you so much (and to all the commenters) for sharing your experience. This is such a beautiful community. I currently live with my family in a restricting household and a small house where everyone can hear everything and self pleasure is unacceptable. I just purchased my first magic wand a couple months ago and used it when no one was home, cause people were always out at work and sports and such. Now everyone is home all the time and I have not had the privacy to pleasure myself as openly and loudly as I would like, but I’m working on finding other ways to make myself feel good that are a bit more quiet lol. I miss human touch, I miss my partners, I miss being loud and passionate and fiery and fierce and embracing my sexuality fully. I know I will have time for it in the future, but I want it now, hehehe. Learning patience and learning to be more self reliant in making myself feel good, where I used to tend to look to my lovers to make me cum harder than I could. It’s gonna take some work but I’m grateful for this time in many ways.", "publicistlakeithea": "Times have been stressful for me and my clients! I was feeling less gentle, but have been on a spiritual cleanse and tuning and I'm on day 13. I was encouraged to connect with my feminine power and gentle side this week. I am wearing lingerie all week, it's something that makes me happy, feel sexy, and vulnerable, and connected!", "thelibertylifestyle": "The pandemic has put me in a stressed protective mode with all our people in our house and many dependent on me. It’s made me feel disconnected from my self and my husband.", "alexandra_908": "To be completely honest I haven’t been able to have sex all but maybe twice? without it ending in tears on my end in the past month. And I usually love lots of physical attention and touch. It’s been painful. But my partner has been so patient and gentle and I’m really grateful for his steadiness in this. It’s been a lot of hot baths, shoulder rubs, and I’ve gotten some stuffies back out for the first time in years. I’m trying not to punish myself for needing to just feel quiet and breath. It’s a practice and a process, but I know this can’t last forever. That’s the thing that helps the most", "addyson_aiman": "I love this ♥️", "theeasybay": "This has so been on my mind and in my body! I have been using some of the practices others mentioned, like listening to sexy songs (I have a self pleasure playlist that I add to whenever I hear a song I like), @dipseastories has been hugely helpful, @fourchambers as well. But it’s been challenging to connect and I’m trying to be soft and take it one day at a time (as with so many things right now). I’ll add sensual selfies to my list, thank you for raising this up!", "raininpasadina": "My libido has hit rock bottom and although for the most part I’ve been feeling like I’m handling it well on the surface, I randomly get urges to burst out into tears and sob. Feeling all over the place and trying to remember that that’s okay", "gypsysoul_queen": "🔥🙌🏽👏🏽👏🏽 I’ve been feeling extremely disconnected as well in all aspects due to the stress and anxiety that is in the atmosphere. I’ve been using the time to explore solo sex and reconnecting with my divine femininity and sensuality on and off the pole 😊🙌🏽", "__sein_und_zeit": "You are radiant. I sense some heavily emotions weighing you down. I have been healing from past lately and this lockdown could’ve been a better time for self love and acknowledgment that I’m perfect , I’m beautiful, worthy of time only for me and my desires. Often we get into acknowledging others for a little too long and forget about ourselves. As a result others forget about us too(especially if you have narcissist on your hands like I did). Time to love yourself more then others, so they can love you too. I’ve also been practicing saying “no’ and it’s been remarkable how much satisfaction it’s brining. 💫❤️🙏", "senderbender": "Oh gee... I'm struggling...with my partner with me full time atm my sexuality does not know how to express itself except with her...and I'm finding we don't always connect with the same energy ..which I accept but it's hard to go through as it brings up my wounds.. and then my sexuality sensuality shuts down...I think we normally have more space from each other and I feel she usually has more energy for me...I feel like running away for a little while", "femmedelalune_": "I have had super super low desire lately, which is unusual for me, as I normally have a very high libido. I am trying to remind myself that it is ok and normal!", "caterinaemilitas": "I feel that my sexuality right now is a way for me to feel release...it’s still connection and enjoyment but mostly it’s entering a space that has nothing to do with anyone else (who I’m quarantined with) for privacy and time that feels like an escape from the physically confined space I am in.  I miss my partner so much 🥺 but the thoughts that I have of him in his physical absence give me lots of pleasure (maybe more now that the physical part of our relationship is on hold)  All the ways that I move my body (exercise, yoga, dance, mindful breathing, skin care) help ground me right now ♥️ moving, in any way, is the most pleasurable thing for me right now", "roseglowmorrow": "well... I have had a masturbation breakthrough! Have been squirting so much I keep being shocked, over and over... by myself!", "nic.antoinette": "These are wonderful, hard, and necessary questions—thank you for sharing. I'll be journaling about them this week! My partner and I are now in an indefinite long distance relationship, and the sadness of that (and so much else) has majorly disconnected me from my erotic energy.", "downvalleychica": "thank you for this post, i’ve been feeling the same way 🙏🏽", "shebearherblover": "Oh ya yuppp feelin this too 💘🌸", "thatgalnini": "😍😍", "elianamreyes": "I love you! Thank you for your words. Definitely sensual meditation is one way I’m staying connected to my sensual self, as well as long showers where I slowly scrub my body, as I listen to sensual music. Lately caring for my body (slowly) is making me feel good", "shenanagrin": "that’s my fave flower 🥺🥺", "uglystepfister": "With a lot of distractions gone my partner have enjoyed our time at home exploring each other and gettin freaky. Opened up the dialogue to do some heavy chakra work as a couple too!", "sinisterfeline": "I've had a strange, but welcome return to how me and my partner were sexually in our teenage years. We've been together for 10 y and it's been kind of weird that this pandemic has sort of separated us physically bc we don't live together but also made me feel closer to him in the sensual way which I haven't felt in for years bc of a longtime personal disconnect to myself. Basically, now when I see him I feel a much stronger longing and connection with the love I harbour for him, I notice details I'm ashamed depression, anxiety and fear made me forget. Frankly, I want to start and explore him again and it's as if my teenage self returned now and said \"Hey. Remember when you used to be locked in, and counted the hours until you met the pretty person you fell in love with and wanted to kiss all the time? What happened?\" The universe is wild. Now I count the time again, and wait to run through my door and see my lovers smile.", "daniellefrances_": "We are shifting 🔥", "whishb0ne": "I love the warm self-loving energy coming out of your selfie. On my end, I have had so much rent-related anxiety that sensuality is the farthest thing from my mind. I’m acutely aware of my body but it’s because of the tightness in my chest and the knot in my stomach.", "vhitcious.marie": "Its almost like you took the words straight from my thoughts.💕 i deeply resonate w this. But today I decided to shop for a vibrator!", "highfivesforeveryone": "“There is nothing like having your sensuality be affirmed by your own gaze” - I LOVE that!! I have been meaning to restart the 30 days of sensuality - I let the busy-ness of life take over and now seems like a perfect time to revisit your program and commit deeper to sensuality ❤️", "alfred._.bitchcock": "Love your hair this way!", "raffertyhallows": "👏", "thehazelhayes\nVerified": "Verified", "auxinsandcytokinins": "I'm learning more about photography and getting creative with my self-portraits. And trying to remember to take baths and masturbate and exercise. And trying to be gentle with myself, not to work myself too hard, and to let myself veg a bit and play video games while also gently remembering to keep my creative and intellectual work alive.", "themusingmum": "So out of touch with my sexual self right now. Like I either feel totally numb and switched off or longing for just comfort, being held. I have 5 kids so the constant giving out isn’t leaving me much for myself. But pleasure. Trying to keep a little pleasure in my life even if it is just a trickle to remind myself I can and should be engaging in plasurefull experiences whatever they are during this time.", "maria_la_hinojosa\nVerified": "Verified", "zgr_number1best": "What you described sounds a lot like what my partner is going through during this time. We decided to isolate together, though previously we only saw each 2-3 times a week. Being around her all the time has heightened my desire, and I’ve had to do some tough work to mitigate my overflowing sex drive while hers has receded, especially since seeking an outlet outside our primary partnership is not an option due to social distancing. Challenging stuff!!", "cucurbitaminima": "I experienced a sad but amicable break-up with my partner today. Since we’d been apart for the past couple of weeks I had been on and off trying to take care of myself sexually. But now, I think I just need to give myself space to feel and give myself patience. It happened for the best but I am still extremely saddened over this and I am crying. I need tenderness over anything right now.", "can_i_am": "I've definitely felt the disconnection. Not really in the mood to be in my body at all- let alone masturbate. But to combat this, I've been finding solace in gentleness. More art, a little dancing here n there, and trying hard not to judge where it is that I am.", "chech4u": "thank you for this. i really like the practice of the sensual selfies, i think i am going ro try this.", "_vanessadl": "Feeling you so so much with this. Due to the situation, i starting feeling so committed to include sensual pleasure daily. Venus in taurus inspired me greatly. Pussy gazing on my favorite playlist is my favorite way atm 💕", "katrina.irene": "Thank you! I have completely disconnected from my sexuality during this time of crisis... but keeping in touch with my sensuality is giving me some much-needed connection to self.", "kinkycoilycool": "What a beautiful message! My sacral has been so blocked because of all this uncertainty and tragedy, but like you said my sexuality is my birthright. While I don’t have anyone at the moment I’ve been taking it in my own hands... literally lol", "acommand3r": "This is so beautifully and gently written, it helps me accept the same truths for myself, with less shame 💗", "blossoming_serenity": "This pandemic hasn't been affecting the way I feel in my body at all. I am already a homebody so staying at home all the time is normal for me. As regards to being sensual and experiencing pleasure me and my boyfriend are still having sex and to be honest we aren't really worried about anything. It's really sad that people are dying but it's not affecting us personally at all. We are just going about our everyday lives as usual.", "thejasminebperspective": "I just did an IG story asking people what there favorite sensual songs are! It was pretty amazing. I’m acknowledging that eargasms are my thing and trying to find other ways to experience pleasure."}