{"innyvinny": "My best friends, the universe being on time all the time, sunshine, Hoggie snuggles, mangoes, water, @nolaskinsentials , meditation, and remembering who I am. ❤️", "bretteliza": "Grateful for my BAE @kimcandikaalford who turned me in to you and always keeps me honest!", "gyesenia___": "I am thankful for the I love I have with my sisters, my brother & my mom & dad ♥️", "missmvrley": "I’m grateful for life 🙏🏽", "jesuistiffany": "I’m grateful for peace of mind.", "katesawhney": "@elianabanana__ follow this gorgeous soul!!!", "therayndear": "Grateful for an honest partner who has helped me recently see how I am not living in my truth", "lexijohnnyhair": "@evyan.whitney it's a Pleasure! ! And am soooo DIGGIN this Look on you too!🌟💖", "saraclarkyoga": "I feel you sis! And attitude of gratitude always balances out the intensity if life and in this case Mercury retrograde. Thanks for the reminder. Hair is looking good!", "_jaime_james_": "I’m grateful for my girl @na_talie29 💕", "adoseofom": "Finding your page somehow through cosmic black magical love is what I’m grateful for. Also, for learning self-love and self-care in my lowest moments. Learning to ride my highs with grace and humility. Digging into my bones. Cheers to the retrograde and 🌙eclipse", "ajsela": "Grateful for this post on early Sunday rainy morning while drinking my black coffee ☕️ ( very very grateful for that ) helloz and thank you from London 🇬🇧", "robinhoodrawz": "You’re stunning as always, Ev’Yan! I’ve been following you online since I read your interview on Black Girl with Long Hair; loved your ethic and vibe and I continue to encourage people to seek you out for all of the sexual liberation advice and resources you share. So first, I’m grateful for you and other folks like you working to empower POC. Thank you ❤️. These days I’m also grateful for spaces I can call my own. Spaces to live, work, retreat, and just be.", "stefosofsky": "For the penetration of the Sun. For deep sleep. For cold water when it’s so damn hot outside. For the wisdom of the desert. For friends that pick you up from the airport. For your work in the world. For my mother. For being touched by hands that listen and respond and respect. For coconut oil. For this inhale.", "evajannotta": "I am grateful for the new striped tank top that I love and that my partner always compliments whenever I wear it. I’m grateful that it’s Saturday and I had a calm work week. I’m grateful for the friends I’m making at the gym, for banana pancakes, for lattes, and for creative writing. ❤️", "chynnadollyogi": "I’m grateful for spending time with the lovely @jewels_pena today ❤️💕", "givemelifeee": "Awww yes my sister did your hair!😍🙌🏾", "monisayz": "Yesssssss Virgo. We are some deep folks", "tipsy.with.awe": "Why are your eyebrows so perfect.😢", "princeplusqueens": "🤓", "05orion": "Gorgeous 💜💜💜🔥🔥🔥", "natxoibarra": "Maravillosa", "lvngwomb": "Beautyyyyy!", "lynz__cole": "❤️❤️❤️❤️", "love2lovedana": "Ive followed you and your growth since the beginning of your natural hair journey on different social platforms. I inspire me to be free, enjoy nature and prioritize life experience. Im grateful for you Ev. Love the hair by the way 🤗", "m.a.d.d.o.g": "Thank you for sharing this energy. I’m having so much trouble this retrograde. Stagnant energy abounds! A good reminder to stay thankful🌟✨", "vidaglows": "I’m grateful to be alive, for my health and home and all my loves. Im grateful for you and all the femmes out on the leading edge of the body positivity and sexual liberation movement. Your hair looks amazing", "lnrbrtsn": "I’m grateful for my health, my body, and the ability to discover this world.", "kimstagram_13": "Love this! I’m thankful for my open mind and my sense of humor. Thankful for my amazing group of friends. I’m thankful for my supportive, loving family, and for big dogs, and cats that sleep on my chest when they feel like it. Thankful for watermelon, for vegan pizza and my belly. Thankful that I’m finally starting to understand my self worth. Thankful for you and your teachings ♥️ I’m seeing you speak on Sunday in Brooklyn and I’m so stoked!", "sparklesrmyfavoritething": "I am grateful for safe travels and beautiful adventures. I am grateful to my angels ancestors & guides. I am grateful for all the love I am and that I am supported by and am able to give. I am grateful for true friends and true lovers. I am grateful for the Mediterranean Sea and all that she has cleansed from me, all the beauty that she is and all the luscious hues and ebbs n flows n swells n churns n fizzes n powerful delight n depth. I am grateful for cooling waters in summer heat. I am grateful for English roses and all the wild blooms I love so dear. I am grateful for the care I receive and that I give to myself n others. I am grateful for healing & the gentle power of reiki n breath. I am grateful to be a woman, to be just who I am. I am grateful for all the beings who inspire n teach me. I am grateful for my loving family. I am grateful for nature, for seasons, for the sun n moon n stars. I am grateful for life love n grace. Thank you for this invitation and for your work @evyan.whitney", "elle_aerialist": "So much to be thankful for", "ella_mariew": "howwww are you so beautiful 😭🌈❤️🙏🏽", "sydnesian": "😍", "kelcielizabeth": "I’m grateful to be able to read a humbling post such as this 🙏🏻💕", "mstoilj": "Grateful to be free of things that no longer served me. Also can we discuss these earrings?! Loving this look!", "itsme_khelee": "Grateful for my son and my blossoming spirituality ✨ I love this pic by the way, beautiful! ❤️", "klxeah": "❤️", "sydnoelle.mvmt": "😍😍", "ellensbowles": "Ok obsessed with this look! 😍", "nicoldmoon": "I'm grateful for being aware, feel and love myself, I'm grateful for find people that inspires others to grow and to get to know and feel themselves, I'm grateful for understand that all comes from within.", "megcassidy44": "Grateful for new opportunities, for being able to pay off my car last week, for iced coffee at my favorite place, for my journal. Also grateful for your words and your openness 💖", "sunflowersutra": "i am grateful for taking the time to rest and tend to my body’s needs after a week of putting everything else above it", "thejasminebperspective": "I’m grateful for hope, public transportation with ac, my friend’s health.", "karlita_the_chica": "You look so beautiful and this post is beautiful ❤️", "lauren.mcalpin": "Grateful for you helping others (me 😉) not feel alone in the mercury retrograde fog. ❤", "kehinde_5": "📸🔥🔥🔥", "buttalieee": "Grateful for you and your wise words and your strength and your authenticity and your vulnerability. You are an inspiration that guides me through this wild season!!! 🌈🌈🌈"}