{"supercrampp": "@greekgodless", "talkwitemory": "Thank you for calling them out and bringing this all to light ✨ I’m so sorry this happened and I know how hard it must be to come forward", "magnolia.raye": "I think they disabled their Instagram now. 😑", "emilywilliamson_artiste": "Looks like you endangered the safety of these people just to make a spectacle and take advantage of the divisive bullshit narrative being spewed. Way to go causing more hate and division.", "witchoneagain": "I believe you, this is valid and i am so sorry this is happening.", "khryscordial": "@hewhomustnotbenamed_", "deenaoh": "💖💖💖", "vulturewoods": "Thank you & all who came forward infinitely for shedding light on this bullshit.", "litkowsk": "Thank you for writing this. It helped me identify my own behaviors rooted in white supremacy (blasting everyone who will listen with my opinions on capitalism/evil corporations, while my job is partially funded by Google $). My work should be in sharing opportunity and access to capital, not “protecting” others from it. Thank you again.", "yazzila": "I Believe you and I support you. May Spirit continue to give you strength to speak your truth. Blessings from Miami. 🌻🌻", "marjoriescott": "@misssmallory", "claireogd": "@pb_and_sammyj", "monisayz": "Supporting you and your experience", "aimeemichel_": "So glad you brought this to light. Very brave and empowering decision. I send you my absolute support💞", "kayleighkowalsky": "@sko_that_den @tomwithfivems @gravegunk @sydneycherro", "jench2k14": "Hello, the comments on the wildflower page have been deleted and I can’t remember where I originally saw the comment at the time that all this was released, but I was just thinking about how I remembered seeing a couple of comments saying that the owners of wildflower were “cis passing” and as such should have behaved differently. Forgive me for commenting on here and not the wildflower post but comments are disabled, and forgive my ignorance, but my initial thoughts are that calling a couple “cis passing” is insensitive and could be considered offensive by those people, does anyone have the time to explain to me why it is ok to use this term in this context?", "dyanavalentine": "@rodraroahdar @wyohlee @born.of.trees", "ahnii_obscura": "Cant find any information😕 what happend?", "zestinferna": "Just dm’d you the tiniest of treats", "kanyeesi": "I was sent here because I shared an experience that turned out to be common amongst models in my area with a photographer who has disrespected most of us. You have my solidarity.", "lostseeoul": "What actually happened tho?", "ajwrapping": "I see you. I believe you. I stand with you.", "stylebynaim_a": "❤️", "amidst_movement": "@shanboody", "x0x0xy8": "Would you please link the article again? I found it on Twitter as a retweet.... Got half way thru and lost it. Happy I found you here before that happend! Thank you for being your", "astraia_esprit": "🖤🙏", "lindsaysant": "@greenhaus", "asyoulikeit.shop": "I'm sorry it took me so long to respond thank you so much for sharing this.", "mmetch": "Wow this sucks and I’m sorry y’all are going through it. Thanks for sharing your stories.", "faithuncut": "Read every word. Thank you for your transparency.", "revolutionary_motherhood": "Thank you for your bravery and vulnerability ✊ solidarity", "a.j.choi": "Supporting y’all! WF’s conduct is grossly manipulative, deceitful, and, as you already know, hypocritical. I believe you and will spread this to my community. ♥️", "krissyscouch": "@sexpositive_families have you read this article? Wow!", "hmarielev": "Thank you for opening up. I am Supporting you.", "bloodboneandhoney": "I see you. I believe you. I stand with you. It is my prayer that white folks use their words, time, hearts, money, access & agency to not only engage with your truths, but digest them + assimilate them into their consciousness to the point where we actually take aligned, thoughtful, non-fetishized, non-tokenizing, supportive action about it. To make the effort to sit down & listen from a place of genuine concern. To hold big space for stories like this to be shared + then create protection that’s actually of service to the black femmes putting themselves out on the line to share their truths. As you all stated in the piece - its time to stop performing feminism & start living it. I see you. I believe you. I stand with you. Thank you ❤️❤️❤️❤️", "maravommond": "Thank you for sharing, I will not support them any longer!", "xt_isgorgessjorg": "💚💚💚✊🏾✊🏾✊🏾", "cyantist": "Thank you for posting this. Also, I’m very sorry you were manipulated in this way. I have a long track record of promoting sexual freedom and body positivity - I founded Zivity. Investing in Polly and Unbound is something I’m quite proud of, as things are changing and getting the venture world to pay attention to companies in this space is important for moving our freedoms forward. I also wasn’t hired to rehabilitate an image. I was hired because I am one of the best investors of all time. You can see my track record. It speaks for itself. I refuse to let them tokenize me in that way. It’s rude and dehumanizing and devalued me as an individual. If anything, I’m excited that your post led me to your feed. You are beautiful and powerful and I’m inspired by your marriage. Thank you for being you.", "s.t.a.y.jess": "@decolonizedactivism @bopo_watercolour @designerti", "thesexed": "❤️❤️❤️", "lillatchka.sp": "Sharing your truth is labor in itself, so thank you so much! Your transparency of how much you have given to Black femmes, in this year alone!, is Extremely eye opening for me: Raises the bar in myself for how much I should Really be giving to Queer POC, and other in need communities. 🤗 Thank you, thank you, thank you! So far, I have read the first response by Ev’Yan, and look forward to reading the rest! I’m unfollowing WF, and stand with you. ✊🏻", "snottyvonlacee": "Unfollowed them. Followed you. Their apology is whack", "1.900.mandita": "@aly_nagel not sure if you caught this as I know you also followed @wildflowersex", "oh_hai_shelby": "Thank you for coming out with this! Looks like they removed all the tags from the tagged photos. Makes it harder to find this article", "emmerpope": "Thank you for sharing this- I support you and your work and will continue to do so going forward!", "bees.wax": "I appreciate your honesty and bravery to come out and speak your truth. ❤️", "al_streets52": "@katievigos @the_angela_gallo @milkandhannah @4thtribodies Maybe y’all could use your platforms to spread this ✨❤️", "trashghoul": "I was reading wf’s response and was like “damn that seems super genuine” but then read the full article and now I’m thinking “this is textbook performative” lol. All my support. In trying to fuck over unbound babes, they have signed their own foreclosure lol", "nicktripp": "Seen, heard, and believed. Thank you for doing this work.", "serina_crinis": "🙏🏼 Thank you for speaking your truth", "blckirish": "Speak truth to power . It’s not okay, fuck them for real, I hope they are held accountable for this 🤘🏾❤️", "ellaisfilth": "Couple of 🤡❤️🤡", "sadgirlz.jpg": "Thank you for your bravery. It’s important that we all dig a little deeper into the influencers/shops etc in which we invest our money and our feed, I’m glad this was brought into light. @evyan.whitney", "_ashleystory": "I don’t even know what to say, but sending you and everyone harmed hella love. And sharing 💜", "whoregasmic": "@literatureandchill", "_chronicallykinky_": "thank you for speaking up, i will be reading right now. just letting you know, there’s no kink in your bio 💕💕💕", "ladysasquatch": "Thank you for sharing. Full support to you and the other authors.", "momminaround": "🙏🏽💪🏽✊🏽✊🏾✊🏿❤️", "kay_locke": "terrible to read. i hope they find a way to make things right and begin to truly hold space for black femmes. unfollowing wf. thank you for bringing this issue to light, power to you.", "belovedcoaching": "Heard and shared. ❤️", "natashagco": "@evyan.whitney thank you for sharing this. I stand with you.", "simbyred": "So ignoring WF altogether, I never heard of them before this...are you ok with how Unbound Babes received their funding and their connection to Founders Fund and Club for Growth?? That seems to be the start of the contention but it wasn't addressed at all?", "heyquazzy": "@britthealyou and the full link in the stories", "noah.the.creative": "Thank YOU for calling them out on their fuck shit and I am very much looking forward to giving my $$ to the brands you’ll be shouting out soon. I’m so thankful that I never actually bought from them because I had no idea all of this was occurring, especially not knowing that their white cis male partner was getting dirty $$$ from Google and the fact that they never once had to put their own personal funds towards their business... Sounds about as white and privileged as they come. All in the name of “inclusivity” What a sham🙃", "got2boshun": "beautifully written & such a glorious display of true strength & power...SALUTE", "pip_t": "@presstheamykey", "feministhog": "This is so fucked up.", "maddfoxxy": "Speak sista", "livrosehug": "WOW what a read. Thank you for your time and energy in writing this. 🖤", "thatgreengoddess": "Thank you for sharing. A friend posted this and I read your stories. I’m so sorry this happened to all of you. It’s beyond fucked up.", "jen.maybe": "Wanted to be sure you were aware of the harm @wildflowersex has caused since I know you follow them. @handwrittenrevolution @sixminutesexed @dawn_serra @charlie_on_bass @marc_brighteyes @kellyjoglad @caitie_metz @badgirlsandsadgirls", "plantkindness": "Thank you for sharing, I would have never known otherwise and would have continued believing the lies of inclusivity that WF promote. I will no longer be giving WF my business and have unfollowed them. I will continue following the femmes you share and the stories you uplift. Thank you 💗🙏", "puremox": "I’m really inspired and, though none of this has anything to do with me, proud of you for standing up for yourself and others in this super important way. In today’s fake “pc” world many white and non-black folks use social media to get undue support and attention. I hope this starts something better for your goals and that you’re supported.", "lovelyylaceyy": "Bless you for sharing this! It must be exhausting and I am happy to unfollow and not support white feminist capitalist bullshit! Makes my day knowing I’ll be giving my money and time to those who deserve it and not the manipulative white self serving people who claim to be fighting the good fight. Make sure to take time to rest!! Love you and your work!! ❤️❤️❤️", "wine_grandpa": "I'm so grateful for this testimony from you and all of the contributors. While I'm not involved with the sex-tech industry, I do follow some other accounts specifically about sex-positivity and this has really changed how I'll examine the people I follow and promote in the future. I'm so sorry for the completely undue suffering they caused you after all of the chances they had to make it right. I see you, and support you.", "wasilclothing": "We stand behind you! This is absolutely horrible that you and many others were used and disrespected by this company. About to dive into the read you linked, but we stand behind you!", "shopuntamedflowers": "Will be unfollowing them. This is horrible.", "juliabot": "Wow this is shocking and gross", "babeloner": "Thank you for taking the risk to speak up about this caucasity. WF should be ashamed. And their “apology”? Well we see right through it. I’ve let mutuals know what WF has done", "alexandria.deters.art": "Thank you for writing and sharing. This is very upsetting and disappointing to learn and I will share so others can know 🖤🙏", "mallorymerk\nVerified": "Verified", "kornejito": "WF = wild flower or white feminist 🧐", "mon.ami.lebel": "I don’t even need to read it to believe you. 99.999999999999...% of People don’t show their scars— especially their darkest, deepest ones for ill intention or to lie about them. Period.", "katalyn_k": "Thank you. I love and support you. 🌈♥️♥️🌈", "nadjabianca": "👏🏽 👏🏽👏🏽", "mourning_glory": "This is an incredibly powerful piece and such a sad account of privilege. I wasn't aware of either of these brands or even this sex professional area, but will gladly stand for your rights and the respect each of you deserves", "becauseimprettylikedrugs": "I support you! I believe you! I'm spreading the word. They wont get any of my, my friends, or my families brown dollars!", "pequenaguajira": "@evyan.whitney I see and believe you. What is your paypal? I'd like to donate some money to you. I appreciate the labor and effort to call out this company.", "oellamcclain": "The thing I find the most hilarious is that Nick of WF works for google. I mean who really in this complex system of neo-liberal capitalism is guilt free? Sheesh. A little humility & self accountability would be admirable. I’ve never been drawn to WF content and haven’t given them my business. Your sexuality work is needed in this world- thank you & keep going. Thanks for sharing the story. Sorry but not surprised either it went down this way.", "cosmic.earthmama": "I’m so sorry this happened to you", "creativetreble": "Thanks for sharing your story. I un followed them.", "a_praying_mantis": "I had been thinking of unfollowing them for a while just because something felt off about them to me. I’m so sorry you all had to go through this, thank you for being so brave and speaking up. 💖All my love and support to you all💖", "pumpkinspicemims": "Unacceptable, sickening, childish, beyond hurtful, and abuse of power is what this is. I am so sorry to you and all others who experienced this. You are ALL SO. FUCKING. WORTHY. of all the good that you SHOULD have received from these jokesters. All of your pain is valid, seen, BELIEVED, fucking FELT, and HEARD.", "connerleecarey": "Thank you for sharing. I had been questioning the presence of the brand from what I saw; but this is a whole other level and I’m sorry y’all weren’t respected as you should have been.", "soil.hag": "I believe you and am so so grateful you took the time and the risk of sharing your stories. It hurts so much to hear that a company I have looked towards as a resource did this to you all. I Look forward to further supporting you all directly and putting my resources towards businesses that also support you.", "romancebymyoshi": "WOOOOOOOOOOOOOOW I just read your story first! Wow", "cai_of_the_sky": "Thank you all for sharing your stories about WF. You are heard and valid. It's such a shame that they have disrespected you so much. I was strongly considering getting some of their products, but they've lost my interest completely due to this.", "femfirewitch": "Thank you for sharing these stories, I believe y’all!! 🖤Doing everything I can to expose them. What a world we live in where even inclusivity is being turned into a capitalist tool...", "raedohar": "thank you so much for your sharing and your bravery! we believe you.", "themelissadenizard": "🙏🏽💛", "theannnguyen": "Thank you for this. In support if you and everyone else who bravely spoke up. Standing with you all ❤️", "cryfest": "Thanks for your vulnerability I appreciate y’all 🖤", "jaionthemoon": "dang i felt a big question mark when they left a rather rude response to a comment on their post and this just confirmed that doubt. thanke for sharing your stories!!", "hi_im_steen": "I support you, I read your story and stopped following WF. I'm so sorry you had to once again put white people in our place. We need to do better for you.", "diasporicdyke": "ty for sharing 🧡 I’m so sorry you experienced this. not many things more painful than realizing you have been manipulated.", "heyevelien": "After reading most of the stories I unfollowed WF. This is unacceptable!", "galadrielsmom": "Thank you for baring your vulnerability for a very important learning opportunity. I see/hear you!", "darthvadenz": "I’m really sorry this happened to you and every victim involved. Thank you for being brave enough to tell the truth. 💗", "laceybean_": "❤️", "emilygoldhammer": "Thank you so much for your work and your energy. I honestly didn’t know who WF was (lol) and am glad that I can continue avoiding them in the future. I see you and head you and believe all of you. 🖤", "albielaird": "Thank you for sharing your story its unacceptable & it breaks my heart that anyone would feel scared not to feel safe to come out & tell their truth, going forward I will be giving @wildflowersex a wide berth until they have shown in action they have changed not just in words.", "kelbudesa": "I always felt like those two were shady and fake af. I’m so sorry you had to go through this bullshit, but I’m so glad you called them out.", "jessmanuszak": "Hey, thank you so much for letting us know.", "frankiefunkyfinsta": "@rachel.cargle @ihartericka", "queerofpentacles": "I believe you 💜", "sarahhxdouglas": "This is so shitty! Following all of you. Sending lots of support! 💙", "impaladrama67": "Thanks for sharing you’re story. I stand by you, and have unfollowed WF. Can I post this to my stories to spread the word to my followers? I’m not super influential, but I can reach a few people! Don’t wanna repost without your permission though.", "katherinefequetyoga": "Thank you for speaking up. I support you all! Your voice is valued", "mamihundu": "🖤", "shadybootsjosbae": "Thank you for sharing. This is very brave of y’all and the idea is to stop this chain reaction effect so that, as you said, this doesn’t happen to anyone else going forward. It’s sad to see that no matter where we are and in particular spaces, individuals still abuse power.", "milleyvanilley": "@lesbian.memezz", "madamewaffles": "Just read the article and wow! I heard of WF through your Instagram and began following them. The fact that they didn't compensate you for going to NY is appalling! I'm so sorry you and others were harmed by WF. I support you all and will be unfollowing them! Much love to you! ❤❤❤", "armoragainstwonder": "i hope you are ok☁️", "celphone": "Thank you so much for sharing ! I’ve only made my way through your story so far but just wanna say - WTF and it’s just so important you have shared this !!! Solidarity xx", "dontlook.fck": "❤️❤️❤️❤️🙌🏻🙌🏻🙌🏻🙌🏻 thank you for sharing these horrific experiences! These practices need to be exposed, we believe you, and are here with genuine support!xxx", "nataanii_": "You are heard I don't follow either of these platforms but am thankful this has come up in my existence to listen. I will go read in detail now. Thank You all for coming forward. That takes strength to call in these cycles and for the other side to hear with open ears respect and a change in course", "sketchy_propositions": "Unfollowed WF and will no longer be giving them my business. Are there other companies you would recommend in their stead?", "kofas_darkroom": "White women and their platforms are trash. They will always be white first and that whiteness infects their platforms", "doganay03030": "I did not understand anything that you write", "lauraquenon": "Wow. Much love to you💖💖", "licklectic": "we dont stan snakes who treat others like dogs. we stan the humans who treat each other like humans.", "eat_suite": "This is so deeply disturbing and I’m so angry for you but grateful you spoke up. I’m disgusted by how @wildflowersex treated you (and the others who shared their stories) and it’s so clear to me what they’re intentions were after reading your article. Absolutely disgusting. It was very well written and such important work. Thank you for sharing.", "just_kate4": "Thank you for sharing this so I can honor and support truly intersectional companies and not ones that take advantage of demographics that are already fighting hardest.", "carolinerosalie": "Thank you for coming forward. I’m so sorry that they dragged you in to their totally unethical and shitty white feminist business drama & tried to jeopardise you and others careers. I’m glad to know the truth about Wildflower so as not to show any support for them. I believe you and others who have shared this information.", "jedeyegypsea": "❤️❤️❤️❤️❤️❤️ We stand with you", "le_marg": "Thank you for this!", "eileencullen": "I see you, hear you, respect you. Thank for for sharing. What can we do for you? What do you need from us??❤️", "snail_lov3r": "Thank u for speaking up", "_oriannx_": "Just finished reading the article. I believe y’all and support y’all!", "hannah_macintyre": "sending love and support ♥️ thank you for sharing", "fluid_frolicker": "Thank you for sharing this. I believe you. I stand with you. 💜💙💚", "amberscloset\nVerified": "Verified", "agvishere": "Read your Medium post. I believe you.", "theebigidea": "Thank you so much for sharing this! All of your teams bravery is not only necessary but inspiring and uplifting for other queer POC. You def have my support ! #believeblackfemmes", "flowerbottomswitch": "This is so disappointing and I’m not surprised. I was surprised to see a sex shop / sex positive account run by two yt people get so much love. All the images seemed to really be featuring “diverse” folks and couples- it’s honestly suspect when yt-run institutions only have Black and brown faces on their brochures and grids. I’m so sad they treated you all this way and their “apology” does not address what they did / how they’re going to compensate you", "oddlittlequeue": "Wow and yikes. I'm so sorry you've had to suffer this kind of unprofessional and frankly garbage behavior from adults who ostensibly have the ability to know/do better.", "saruh.williams": "thank you for sharing. I had no idea about any of this- bummed that I just spent money on them.", "disobeyfear": "@wildflowersex I am incredibly disheartened by what I have read in these women stories. It makes me sick tbh. There is so much I could say, yet I am at a loss of words. You cannot move through life expecting things to just happen for you. Esp when your partner is bringing in 100k a year! Wtf. You wanted to trade sex toys for their time and energy. Inviting someone to stay in your apt to help with costs, don’t make me laugh. That’s so embarrassing. I literally am sick. There is honestly nothing you could possibly say to rectify what you’ve done. It is so obvious that you both used these women in order to fuel your own obsessions with @unboundbabes . Competition in the world is always going to be prevalent. It’s what you do with that, that’s makes you who you are. Even if the allegations were true, stay in your lane. Why the need to take every opportunity to call out a brand. It’s a waste of time and energy and to steal the energy of these women who you had either just met via Instagram dm or barley knew to manipulate people into being on your side, that is some real childish behavior and honestly it’s disturbing. No one deserves to be treated badly, including you @wildflowersex you cannot heal hate with hate but I had to speak my mind. I took the time to read @evyan.whitney and these other women’s stories and I was just heart broken. The world is hard enough, why make it harder. Thank you @blkgirlmanifest for your words of advice. I want to be better, I heard your stories. I believe your words. ✨", "_dinahmoehum": "@katunicorncat", "madladycaveman": "@lepetitpeachpit check this", "tracymctx": "Thank you thank you thank you for sharing this. I have bought items from WF in the past and will never do so again. I’m disgusted that they would use their positions of white cis-power (which is exactly what is is) to hurt poc. I am absolutely aware that I am the demographic that benefits the most in this world and I want to be an educated ally for you and other black femmes. I’m not a lawyer but it seems to me like y’all might have some libel suits that you could file if they’re sending out damaging emails about you and others. Please let me know what I can do and I am so sorry. You deserve better than this.", "jewelspules": "I appreciate and support you 💕", "vortex_daddi": "Disappointing but not surprising ❤️ solidarity", "j.q.rose": "@wildflowersex behavior and response is very disappointing. I have unfollowed them. I hear you, I believe you. I think you all @evyan.whitney @ashleighchubbybunny @lisaspliffson @venuscuffs @luhshawnay have done something incredibly brave and shown strength and true solidarity.", "savannahabram": "thank you for speaking up.", "danileahstrauss": "Thank you for this incredible emotional labor and essential wake up call. Your effort and energy is incredibly valuable and you deserve to be supported, paid, and celebrated by the people you work with. Right here loving you and reading every word y’all wrote tonight 💌", "roe_lozano": "I hear you, I believe you, and I support y’all. It saddens and upsets me this shit continues to happen to us poc. We got your back 🖤✨✨", "annathethespian": "♥️♥️♥️♥️♥️", "theangryoptimist": "Thank you for sharing!", "kellygeographic": "wow. I am so sorry. I stand with you, I believe each of you, I will share your stories.", "__rukiat": "Thank u for sharing💜💜", "aamanda.marie": "THANK YOU FOR THIS!!!! In addition to this shedding light on the shady business that is Wildflower, it has also been a VERY powerful reminder for me of how my relationship to capitalism as a white person is very different than that of black femmes and poc in general. Thank you so, so much. 💖", "theabbyway": "Painful read😥 thank you for your bravery", "chillpolyamory": "thank you for sharing.", "megnavoy": "I’m so sorry this happened to you, thank you for being brave and sharing your story. Your time and work is so valuable!", "wayward_nativity": "#blackfemmesbravery 💖", "catspi66": "WF lost another follower and you have gained my support and belief.", "abigailkardashian": "🙌 🙌 🙌", "arrosemoi": "Wow, thanks for sharing. I just finished reading your article and the experience you went through with WF...I was following them and you, but am deeply concerned about their \"ethical conducts\" ...so to speak. Will be unfollowing them, personally, it seems like they are insecure and immature. I worked with people like this and got bullied, overworked, and received no credit. I straight up left, but this really sucks. More power to you! Thank you for sharing!", "brittrfillmore": "Damn. Can someone just say what happened. Fuck.", "mads_extinction": "Thank you for your labor in exposing this BS from @wildflowersex 🙏", "nalaq_": "Saddened by the news; v thankful for this amazing piece.", "arranhamilton13": "Thank you for speaking up. WF will not be receiving my support. I dont want to begin my journey by supporting a brand that tears down other people and sex educators, and doesn't compensate for the valuable labour done by Black femmes. I am so sorry this happened, I send you all my support. Thank you for your hard work ❤", "griffin.griffout": "Just read that whole article, very powerful and enlightening. So sorry you all had to deal with such bullshit", "weepingjessica": "👏👏👏👏", "kristinannehm": "I was so disappointed to read this. Considering everything they post about, it's awful they chose to use and treat black femmes this way. It's also shockingly underhanded and unprofessional. Thank you for speaking out about it, I wouldn't have realised otherwise and they would have been getting my business otherwise. Not anymore!!!!", "olivianorthstar": "Thank you for sharing this", "emflemmefatale": "Thank you for sharing these experiences", "cecily__parsley": "@alexengelman @jazzywomany thought you guys might want to check out what’s going down", "teddycurle": "Thank you for sharing. I will never support WF again.", "pythonintherose": "Unfortunate that WF have taken this approach towards you, they seem to have taken your approach to a reasonably uncomfortable situation with a lot of animosity! We know your morals and integrity are unscathed. Thankyou for being a noticable, loud voice and teacher for all! 💜🌼", "notsoobscure": "White on White crime", "jjayanna": "I believe you. Thank you for speaking up.", "shanicerobertson": "Lol is this request not too privilege? I'm just asking?", "maya_ganjalou": "Thank you ✨✨", "bernbernieberna": "Thanks for sharing 💜", "passionateoegd": "I'm promptly unfollowing @wildflowersex. I'm so tired of this bullsh** AND I prefer @unboundbabes anyway. Thank you for the heads up Ev'Yan. I'm so sorry this happened. 🖤", "saidahb": "Extraordinarily disappointed in @wildflowersex. Wow. Attacking Black femmes professionally and personally in order to essentially boost their own business concerns is that bullshit. Spreading the word that there are other sex-positive retailers to support cuz NOPE.", "simply.steph23": "Standing online in support with you and all the black femmes that have been harmed by this so called inclusive sex brand 😷🤬", "loving_life_barbie68": "I read the article & I'm speechless. I will unfollow wildflowersex.. Unreal.. 🤦", "laurenmignon": "I support you, all of you. Thank you.", "mallorymichel_": "I support you. I believe you. Thank you so much for sharing your story. It’s helped me become more aware of companies and what information I’m taking in as an aspiring sex educator and the need to be aware of what inclusivity looks like. Thank you thank you thank you!", "scarlettsixgun": "Thank you for writing and sharing this.", "nicoleriggsphotography": "Thank you for speaking up ❤️", "latinxhealing": "I believe and support you and other black femmes ❤️✊🏼", "anaiskittyy": "Thank you for sharing your experience. I’ve been feeling weird about them lately anyways and after reading this it really confirmed it. Don’t want to support companies that behave like that. Thank you ❤️", "_growandglow": "I see you, hear you, and believe you. 💗", "hunkbitch": "thank you so much for sharing this painful experience you faced. you deserve all the respect and support in the world 💛", "tooflytobeaguy": "That article is nuts! Thank you for sharing, it was very eye opening.", "loveartpositivity": "You’re amazing! Thank you for speaking your truth!", "lovechatwithnat": "Just read the article. It is sick how obsessed they are with Unbound and how they used each of you to further their agenda and when you didn’t follow their lead, they turned their back on you. I legit feel sick about this. I will be unfollowing them, sharing, and sending you love ❤️.", "marlateyolia": "Daaaammmmm! Just read it all and this is so messed up. I see you and believe you and am unfollowing @wildflowersex NOW", "amacmannn": "👏🏽👏🏽👏🏽❤️🎯", "emotion.l.contagion": "Thank you thank you THANK YOU for making this known. The intent behind their actions soeaks VOLUMES. Its imperative that peoole be mindful of the moral undertones of any nrand or person. Thank you for centalizibg your poor experiences to make them known to the community.", "sarahcontelavie": "You have all my support and my compassion, it's brave to tell the truth, we believe you👏", "erotic.earth.embodiment": "Read through everything. Thank you for speaking up, and for having the courage. We, white folk in the sexuality field, need to do better. I believe you and stand with you.", "sprintingsalina": "You are a goddess. And so are these other women. I do not need to be a black femme to understand how important your work is. Continue speaking out and I’m sorry that anyone made u feel less or used you as a pawn. Your strength is an inspiration. 💜", "audrey_jungle": "unfollowed them, now following you! 💕", "soledadmother": "Cc: @wocsolidarity", "anishinaaughty.kwe": "Indigenous women stand with you. Our voices will not fall silent. ♥️", "joshclasberry": "I support you 🙏🏾", "digital_dancer_": "I believe you and I stand with you, Ev’Yan ❤️ thank you for all that you do for the world.", "allisonalcena": "I appreciate each one of you and you’re willingness to share. This is an absolute mess", "_littlegaby": "Wow. That was nuts.", "janefriday": "I discovered them a few weeks ago, immediately unfollowing now. Thank all of you for coming forward and exposing this.", "genderneutral": "thank u for sharing and i hate to see another black femme be hurt by an “~alt~ ~inclusive~” space", "samanthesoteric": "Thank you for speaking out in such an important way", "meg_trawick": "Thank you for having the bravery and emotional energy to speak up ❤️", "xnicole.lilianx": "Just read your piece and holy shit I’m so sorry that they treated you that way. Unfollowing them now. Thank you for sharing your story.", "lagrosera": "I believe you.", "makedapennycooke": "I appreciate the courage of everyone who shared in that article. I see you. I hear you. I believe you. Sending you a little extra love tonight 💚💚💚", "lilysequoia": "thank you for coming forward", "shellyvonmiller": "Thank you for speaking your truth.", "willowvirchow": "You’re all so beautiful and courageous. Thank you for sharing this💜💜💜", "laraeparker\nVerified": "Verified", "feelmoreadult": "Had to grab a sandwich and read. The sex toy biz got people acting way out of character on ppl of color. Apologies for this happening as bad mouthing happens quit a bit, however, your words of power as well as your strength to write without his is truly encouraging. Black bodies have sexual and financial influence and I'm grateful on the spectrum you all are doing the work...it's hard work but if doesn't have to be cut throat competitive where it leaves those with color in our soon as the sacrifice where power shields other. Hella fucked up!", "bdangerface": "Just read the full article and totally repulsed by @wildflowersex treatment of black femmes. Promptly unfollowed and will no longer be supporting. Hoping this article encourages them to reflect on how they have treated some epic voices who need to be given some more god damn space in this industry. Keep doing you love, I support you 💕✊", "mar.i.p.osa": "@michealaxanne", "yucky__charms": "Thank you so much to everyone who was affected by them for being brave and putting this out there. We see you, we hear you, and we support you!", "missraquelrage": "I believe you and I stand with you.", "natcruztattoos": "Your voice is powerful, i believe you all.", "jtagilli": "Thank you for speaking up. I believe you. ❤️", "chelsea.bradish": "Wow! Unbelievable for a brand that prides themselves on being international to be abusing black femmes.. Wtf?!", "bella__vd": "@frjkrbm even dit artikel lezen!!!", "nickycotta": "thank you for sharing💜", "rosemarymagicae": "Thank you for speaking out and sharing this important information", "lucylolz": "Thank you for sharing this. 💕", "_bee_rook": "I hear you ✊🏻 I believe you", "ashy_clown": "Thank you for sharing. This was hella calculated and despicable. Support you all 100%", "mamalinds22": "Wow. You were totally manipulated. Thank you for being transparent and vulnerable about your experience. Not to imply that this was your intent, but I think you have set a phenomenal example on how to eloquently portray a negative experience to the public without trying to sway people in one direction (which I wouldn’t blame you for). I hope that you heal and find peace 🙏🏾", "austin_coleslaw": "reading that article made me sick. I have never made a purchase from @wildflowersex but have followed & shared their IG posts for quite some time. honestly disgusted by how conniving, malicious, and entitled they are. Amy allowed their bizarre obsession with Unbound to spiral into abusing and exploiting y’all. the overt racism/misogynoir of it all is despicable, and no shitty Instagram apology or pathetic attempt at back-pay will fix that. I will be encouraging all my friends to unfollow wildflower and to turn their support to you & everyone else who contributed to the piece. sending support & gratitude your way ✨", "itsjujubae": "So proud of you.", "pooploop000": "@trufstuf", "mettacine": "thank you all so much for sharing.", "_moonbloom_": "Thank you for sharing your accounts.! I hear you, believe you and stand with you all.", "alicecopping11": "@cioconnor", "misscoryb": "Thank you for telling your story and for giving other black femmes a space to share their stories. I support all of you and deeply admire your courage and strength. Sending so much love 🖤", "shaina2.8": "ugh, i had been having some really weird feelings connected to them recently an while I'm not happy another white couple is being awful I'm glad I've been listening to my feelings an gut and addressing how that affects woc and others.", "suzyjakuzy": "I hear you ❤️", "mx.samsantos": "Thank you for sharing this. I'm so sorry this happened to all of you. I believe you and support you and I truly hope that you get some real justice and reparations", "shinydiscoballs_": "I’m honestly not surprised they did this. I am so sorry. Y’all deserve better than this 💜", "akeylalune": "I went through something shocking like this early this year with another organization and I just want to thank you for standing up and calling it out - it can be a very difficult thing to go through. I see and hear you.", "ehrlicherz": "Thank you for this.", "heartcenteredhealer": "I read the whole thing , i stand with you and black femmes, deserving of compensation for ALL labour , and recognition. What wf is doing is violent and not okay. 💔 thank you for exposing the truth 🙏🏾", "jessikneeland": "Whoa, I had no idea. Thank you for taking the time to tell and share your story, and the courage to speak up about the harm that otherwise would have gone unnoticed and unaccountable by me and many others I’m sure.", "gdejoie": "Thank you all for speaking up. 🙌🏾 Very disheartening but not totally surprising. I’m thankful to get future clarity on where and with whom to put my dollars.", "goddessofthemountain": "Thank you for sharing your stories ❤️❤️and shedding light.", "roogetslifted": "Definitely appreciate this post and the warning. You are definitely seen and heard.", "chris.er.suth": "Yikes, this is some very disappointing news. Manipulative, exploitative, capitalistic disgrace. I really expected more from their brand; I’m grateful for your bravery and emotional labor you exerted while speaking to this painful issue. 💜💗", "deveryminou": "Wow! I’ve given @wildflowersex a LOT of business and this is really disappointing 💔 and the apology on their stories right now is really weak. People make mistakes but you need to make specific apologies. I’m unfollowing and it’s too bad - I had my eye on multiple items I wanted to purchase from them this fall. I hope they can be really accountable and change but until I see that - I stand with you and I’m unfollowing and no longer giving them business", "sarahmacchamp": "I had not heard of @wildflowersex before now, but my God they really did you guys wrong. I'm not a sexuality educator but I am a consumer and I will certainly not being purchasing anything from them.", "miss.mosco.moonshine": "Thank you for sharing your story! Unfollowed WF and am sharing this on my stories. So sorry you had this experience 💖", "jillheller9": "Thank you for your bravery and strength in sharing this story. WF has lost a follower and potential customer in me and hopefully, everyone I share your collective post with too. Hearing you, validating you, believing you. Thank you for being such an incredible sex educator.", "theocthriftshop": "I see you. I hear you. I believe you. You’re valid. Thank you for writing about your experience and sharing others too...", "noisy_ninja": "I posted the article link on my facebook. I'm so sorry that so many have been hurt by this, and I'm grateful that you and your colleagues have chosen to open up and educate. #amplify", "sgitheanachraghallaigh": "So sorry to hear about all of this, am unfollowing them now and support you and everyone else involved 100%", "cheyennegilstudios": "100% support for you @evyan.whitney - reading your story made my blood boil. Honestly just the vibes from PHOTOS of them alone were off for me. Thank you for coming forward. You are supported!!", "goldilocksg\nVerified": "Verified", "sammplss": "Thank you all for sharing your experiences. 💖", "smietzsche": "@amoodybooty", "petaelle": "@brklyn.jns", "lalalovestarot": "Wow, what a read. Immediately unfollowed WF (always felt kind of weird about them tbh) bless you for sharing and onward and upward to more success and opportunities in the future 🙏✨", "sabrina_soco": "@mellycees @deathhart @heyyfelicia noticed you three follow wildflower also (as I once did). Just came across this today and thought to bring it to your attention. ♥️", "nepomucenoimages": "Thank you and everyone else for speaking out ❤️❤️❤️ You guys are supported and believed ❤️", "fern.oxley": "Knew there was a reason why I got bad vibes from that page", "joe_shmoe__": "💙💙💙💙💙", "freebody_soulsister": "I love it. I read story thoroughly. I am happy you are sharing...so upcoming black femmes can really be informed about what to actually expect or what takes place behind the scenes. Thank you for this.👏👏👏", "of.earth.and.salt": "Evyan, I am so sorry that this happened to you and the other amazing black femmes. I am angry and disappointed on your behalf and will stand behind you all.", "_ali_ditto_": "Thank you for your courage and your honesty and your transparency and your hard work and your morality and your intuition and your self-worth and your incredible communication. This could not have been easy for you all, but it was so important and so are you.", "_efspl_": "Very eye opening. I am upset they did not link the article in their stories with their apology...that really makes me think twice about them being transparent/genuine about what occurred. I look forward to following you and will not be a consumer of wild flower now (I had been planning on eventually spending money there).", "lauraaiisha": "Wow! So clear and powerful. With integrity. Thank you for your courage and delivery of this message. I trust you and anyone else impacted in ways that caused harm will receive what it is you need to be seen, heard, respected and that a path will appear so that this doesn’t happen to anyone else. Go ahead sis.. you have my support!! 💜🔥💜", "monicathagoddess": "I stand with you. I will spread these truly disheartening news and testimonies in hopes to alert other people who still follow and support them. You are heard and supported sister 💞💞💞", "cervicalwellness": "I read the whole thing. I stand with you and the Black Femmes who have been crossed", "lescouplestalk": "Standing in Solidarity with you sis✊🏽 #believeblackfemmes 🖤", "wishcandy": "I believe you, I gotchu. Thank you for speaking your truth.", "feelslikemonday": "Sad black women are yet again used as pawns. But not surprising, as I dont see how (m)any of these companies that do claim to advocate for us, dont care to actually comprehend and appreciate anything about us. More spaces for queer and black that are owned genuinely by queer and black folks would be nice...", "co.llyflower": "Thank you for sharing & I am so sorry for your shitball experience with them. You are 🔥🔥🔥❤️", "gabbyababy": "We believe you!👏🏽 Thank you for sharing and for your bravery. As a collective we really need to address the problematic behavior of WF. I have so much trauma and negative memories from working with and being in the same spaces as WF. Attempting to destroy my livelihood, reputation, micro/macroaggressing me etc. I’m tired of their fake solidarity and manipulation", "ella_mariew": "wow, thank you all for speaking up about the disrespect and violence WF has spread. i will definitely be sharing this information with everyone i know who purchases from WF.", "ashus2ashus": "thank you for sharing your experiences and showing that we can and have to speak up! 💙💙", "elo_cheez": "thank u all so much for sharing!!", "breebeeating": "unfollowed", "_whothefuckisfugazi_": "@sluttygrlprobs @lorraejo", "jessieraemonclaart": "Damn I'm sorry :( I hope they apologize and take responsibility", "birdiegarcia": "🖤💜💙", "khadiyogini": "“I ask that I am believed.” We got you, Sis!", "extra_brittany": "Just finished reading, I’m so sorry you’re caught up in this, but I’m grateful for your transparency, and for all the nuance you brought to your story.", "birdsvsmountains": "Thank you for sharing your stories. I’m so sorry this happened to you.", "katy_ann16": "I am so saddened and angry that this happened to you all, thank you for sharing and know that you have my full support 💕 I cannot support companies that mistreat folx like this, and I am so thankful that y’all came forward so we can be better and support other companies and spaces that are truly inclusive", "paradiisa": "thank you for sharing! I support and stand with you @evyan.whitney & @ashleighchubbybunny @lisaspliffson @venuscuffs @luhshawnay", "strange.cobra": "Wow. Wildflower sex is taking advantage, fully and completely. Gaining trust, then withholding support, all while using *your* voices to further their own weird agenda. Definitely unfollowing. Thanks for sharing your story. 💜", "soccer__dom": "I hear you I believe you 💗", "cherryrevolution": "THANK YOU FOR SPEAKING👏🏾👏🏾👏🏾", "thecrescenthare": "A few months ago, they posted some smack talk about Unbound, a company that I had good experiences with and was a customer of. I thought it was super unprofessional, but then was like, okay, they are competition, etc. I let it go. But this shit right here? No no no, this is not okay, and I am sorry that y’all had to go through all this. All the support to you 💜 I am unfollowing WF right now with their righteous asses 👏👏", "jaclynnmoon": "Thank you for sharing I honor your voice and courage to speak truth 🙇🏻‍♀️🙏", "runaway_daydreamer": "This is very upsetting to hear. I wish I could say “yeah they always rubbed me the wrong way” but that’s not really true. Unfortunately I think this really shows how white supremacist power structure are so deeply embedded that sometimes they can seem completely invisible until speaks out. @wildflowersex did an excellent job of hiding it but cheers to you and these other femmes for your bravery in exposing these problematic behaviors from them.", "tecatebell": "Their response was also just so blah and run of the mill. All the validation to all with these experiences and thank you for the time, energy, and courage to come forward. ❤️", "breezy.spice": "Thank you for sharing your story! I saw a few people posting about them a while back and when i checked them out something didnt feel quite right and kind of sused me out. Disheartened to hear that you and others have been harmed by them, again thank you for speaking out about this and holding them accountable for their actions", "moonmedicines": "Just read the story. Unfollowed. That’s bs. Thanks to all of you for using your beautiful black voices and speaking up. 💕", "mckenna.anna": "Thank you all so so so much for the work and energy and time that went into this. And I’m sorry that this happened to you. I’ve always gotten extremely sketchy vibes from WF especially (as you’ve all pointed out) both Amy and Nick are cis and het passing and nick works for GOOGLE. Additionally the ENBY toy sucks and the queer all year shirts that they marketed towards queers and “allies” were cringey.", "ilonawashere": "i never felt like they were inclusive bc of the way the page always looked and the things they posted. Never saw any links to outside resources, unlike other educators. What a privileged thing to do 🙄 i hear you and i support you", "evajannotta": "👏🏻👏🏻👏🏻👏🏻👏🏻 Thank you Ev’Yan", "augustkate88": "Followed @unboundbabes. Unfollowed wildflower. Thank you for this informative article!", "femmegemini666": "Here in support 💜", "innerhoeuprising": "Thank you for opening up about this Ev’Yan. We appreciate, support, and love you 💜🖤", "dkayembe": "I’m constantly inspired by the presence and care with which you show up. Thank you for using your voice. I see you, hear you and appreciate you", "eternaldivinebeing": "I see you, sister. Thank you for standing with integrity, authenticity, and responsibility.", "toranmcgill": "Thank You, for your bravery in speaking up. I believe you. I see you and I am holding space for you", "greyjays_": "Thank you for sharing your experiences. @wildflowersex you must look inward and do better by these (and all) Black femmes asking better of you. Stop causing harm and change.", "neiciam": "Thank you for sharing!", "flwrgirl15": "Thank you for sharing! I support you all💛💛💛", "cyclicalbody": "Thank you for sharing 💕", "belangeah": "And I am sorry this happened to you. ❤️", "aloudoula": "Unfollwed immediately! So sad when communities act intersectional and uplifting and turn out to be a f*ckin BUST. Ugh this article hurt my heart", "yel.rennalls": "(Luther Vandross voice) WELLL WELL WEEEEELLLL WELLLLLLLLLLL 😩😕", "karlapalomino__": "I shared after reading the whole article. Definitely unfollowed them. Thank you all for speaking up. I know how much courage and vulnerability that takes. 🙌🏽 With you. Loving you.", "hello.mariana": "Disappointed but not surprised. Standing with you and all other black femmes used as pawns by the WF team. 💕💕 It always struck me as odd (and frankly, vain) the way they claim inclusivity yet like 80% of their feed is a conventionally attractive, thin, white, cis passing femme. Like?!? Does not compute.", "detinate3210": "Unfollowed them. I’m hopeful they can really hear y’all now or eventually. Will share this!", "metalheadmami": "Smh this is wild! Won’t be giving them my money anymore 🙅🏾‍♀️", "iambellarayne": "Wow I am so damn proud of you for speaking up! This type of abuse on black feemes runs rampant in other spaces as well, I've fallen victim and had my entire livelihood annihilated. It's been about 5 years now and I'm still traumatized and have a really hard time opening up still. I'm trying to get back to being as open and free but I'm held back but what happened to me. I read the whole thing and cried, I believe you all, I see you, I love you 💕💕💕💕", "elementsofshe": "✊🏾", "radiant.heart.path": "I’m so sorry you went through this. I believe you.", "bekahturner": "The way you handled all of this has been exemplary to me. As someone who has faced gaslighting and ostracized by an entire local community and felt I shouldn’t speak about it cause it was “adding to drama” this was amazing to read and witness. Thank you for all you do! Know I see and support you! 🌹", "alexisangelini": "Do you have a favorite black owned sex shop we can support instead? Thank you for sharing your story", "pledgetotheglowup": "Believing y’all. Period. If 5 black femmes came together and said that the world was flat. I’d be like yeah makes sense. But in all seriousness, SO SO disheartened that this is happening. But you can always tell how inclusive/radical a company is by how they treat black femmes.", "tittysweat": "wow. heard. i'm not supporting them. (and they definitely have fatphobic written all over them too)", "justifieddramaqueen": "I’m glad you felt comfortable to share and have had the support of those around you bc ooooh weeee I’d be ready to kick some booty", "geezcheeselouise": "Thank you for speaking up ❤️❤️ you are valued", "findingyes": "Thank you for speaking up", "jellywink_boutique": "See you, hear you, believe you 💕", "haleycat666": "Wow.... I’ve always loved WF, had nooo idea what was going on behind the scenes. Thank you Ev’Yan for speaking up and standing your ground on this!!!! Standing with u 💕", "bloodmoonhealing": "❤️❤️❤️👏👏👏", "auxnatalie": "This article made me so angry to read. Thank you for being brave enough to share. @wildflowersex should stop manipulating black femmes, account for this damage, and pay them for their work.", "bewarethewendigo": "damn, and I was thinking about buying from them too. Fuck them.", "kenyanssenga": "Thank you for sharing", "joy.m.salyers": "Thank you for your transparency and thoroughness. That is a really frightening level of narcissistic manipulation! I'm so sorry each of you experienced that and now have to heal from that sequence of faux solidarity, gaslighting, control attempts, and punishment. That is fucking awful.  To use professed solidarity around opposing white supremacy and working for inclusion as a front for their emotional abuse particularly offends me. As a queer white activist and sex professional, I'm grateful for your testimony and will spread the word.", "bathing_in_books": "Duuuude @theassofiron", "natalievalenciaa": "@noxshop support evyan n this post pls", "smouthworth": "So sad to read the article but thank you so much for sharing your experience 💖.Echoing @misschaunceymarie and @thiswitchybitch, anyone who wants to advance sex positivity should be amplifying the voices of black femmes not silencing them!", "bridgetbadore": "I’m so proud of y’all for coming forward about this because I know it’s not easy! I’m so grateful for the work that you do ♥️♥️♥️", "baileyloowho": "Sending you so much love 💕", "jessicaaahhhhhhh": "I hear you, I see you, I support you. Thank you for your emotional labor.", "just_ally1": "Thank you for speaking up, I believe and stand with you! The behavior of @wildflowersex is gross and shady. I really hope they use this as an opportunity to take accountability for their actions.", "etherealvalkyrie": "Thank you for sharing your experience.. I stand with you.", "nina_beee": "that’s really messed up and so sorry this happened to all of you. Your anger is totally justified and the way you were all treated is unprofessional, terrible and all the way you said in your stories, totally true.", "sicchunt": "Thank you for sharing. So sorry you went through this! Hope to see you speak in nyc whenever you’re back!", "witchdisco": "Thank you for sharing and thank you for your bravery to do the work that you do. WE NEED more of YOU and far LESS of THEM. I’m sorry you face so many challenges doing such necessary work. I have personally looked to your page and your words as inspiration in my own life and within how I express myself, I’m grateful to share this space with you. And here to support back with love and acceptance 🖤", "karolina_kubinova": "thank you all for sharing this. unfollowed them a while back because even though they brand themselves as inclusive i didn’t feel like that was reflected in their content, but would unfollow them again if i could. so sorry you had this experience with them.", "bookofkla": "Sad but not surprising. We see you, believe you and support you.", "knolting": "I fully support you and love your courage in speaking out 💕", "loveslobbers": "Thank you for your post, I believe you. To think I was just about to buy something from their site. Quickly unfollowing.", "babymooses": "Thank you for sharing your stories. Transparency and accountability are critical. I see you all and appreciate the work you're doing. I'll share this. 💕", "magovin": "I hear you. Thank you for speaking out!!", "2bwavy": "I hear you, I see you, you matter! Thanks for speaking out. As someone just starting to explore this community I am saddened to hear this happened to you all! 💕", "hxdonisthealing": "supporting you fully.", "khaleesi_phoenix": "Wow. I'm so disappointed after reading that article. There are so many aspects of what happened that I'm just so disheartened by. I just recently found WFS and was excited to see a brand that seemed inclusive, and educational. After reading this article however I don't think I'll be spending my money or my likes with them. I'm so sorry you and others were mistreated and undervalued. Thank you for your transparency. 💙❤️💜", "grosbis0us": "Thank you! Standing with you.", "theyoganjaboarder": "I stopped following them a while ago because their content didnt feel inclusive to me as a queer woman so I'm not surprised but I am very sorry for your experience. You are heard and valued in this space for being open and honest 💗", "foxandthegalacticclit": "I believe you and stand with you. This is not okay. ❤️", "iamheidix": "Mmm, yes! More of this, speaking up with situations like this!! And done so eloquently. Appreciate this heads up - and very sorry to hear this is happening. 🙏🏽💓", "thetangokit": "Oh my goodness.. I am so sorry to read about all of this @evyan.whitney @ashleighchubbybunny @lisaspliffson @luhshawnay @venuscuffs @blkgirlmanifest @unboundbabes. Bravo on you all for speaking your story. The pleasure-positive sexual wellness industry is so small, and there are so many evils and boundaries and societal myths and taboos to break and overcome that we all need to continue lifting each other up, not infighting and tearing each other apart for a larger slice of the pie. Too many people need our help, education, love, and support. I stand with y'all. -Candice", "kellikikcio": "what an incredibly written and unifying article- here to support you in any/all ways ❤️", "beelecks": "Oooooh boy @wildflowersex 🌼🌸🐍🌻🌺 snakey snakey.", "heybreu": "I hear you, I believe you all and I'm so sorry that you've all been treated like dirt. It's unfucking acceptable @wildflowersex, be better, do better because your platform doesn't mean shit if your actions are causing others serious hurt.", "ava.lord77": "Thank you for speaking out about this. I support you and all of the brave black femmes who spoke their experiences with this vile company. You are sean, you are heard, and I stand with you. 💖💖", "jassyonyae": "Wow! Shady for no damn reason! Sorry you have to deal with this", "babywrist": "Ty for sharing 🖤", "tenofbottles": "🖤 i see you. i believe you. i support you 🖤", "wildmountain_honey": "Uhhh wow, sounds like they are the unethical ones here willing to step on whoever to get to the top! Thank you for speaking out 🔥", "b0ld_chic": "You don’t fuck with people’s livelihood. This some sneaky ass white BS @wildflowersex", "thesearcheress": "I unfollowed the account some time ago because it felt icky and decided to trust my instinct and keep my timeline boundaries tight, saddened that you and others had to endure such unpleasant experiences. Let’s hope to see some real changes 💖🌈✨", "tembizzle": "I hear you! Why am I not surprised...", "rosewayyoga": "We stand with you‼️Your strength and wisdom is profound @evyan.whitney @wildflowersex How will you rectify yourselves ⁉️", "bbkttyy": "As a consumer and out spoken artist I will no longer be following, purchasing from or sharing @wildflowersex products!!! I hear you and support you.", "thiswitchybitch": "Yikes. That’s it for me. You know I was suspicious when someone commented that they hadn’t posted a poc in months and all they said was “we try to be inclusive” 🤔 hm not enough. Thank you for being brave and thank.l you for sharing. I believe you and support you.", "ifurie": "So disappointing but not surprising. I am so sorry. We believe see you hear you hold space for you 💕💔🔥", "hapabee_": "Thank you for coming forth with your story and being completely transparent to the world and your audience. I am a huge fan of yours, forever and always. 💜", "soupdude_": "i kneeeeewwwwww they were sketchy !!!", "babyymeg": "@kaitlynrubyy", "eccentricjukebox": "I'm so sorry to hear this - especially, as you point out, from two folks who position themselves as inclusive. Off to read your post now but a priori you have my support, I believe you.", "taras.trails": "🤮 i’m so disappointed. thank you for sharing your story.", "knotkewlenuff": "I am so fucking disgusted and angry after reading your stories. Wow this is on a whole other level.", "4locrow\nVerified": "Verified", "thesugarmamapdx": "Engaging article! Im sorry this happened to ALL of you. But I’m grateful you are using your voice to call out the system💜", "misiantaylor": "This sucks. I am so sorry. WF has given me bad vibes for a minute.", "noireboss1": "This is awful to hear but thank you for having the courage to speak up 💕💕💯❤️❤️❤️", "saintcottonwood": "I believe you. ⚡️", "polly_claire": "Thank you for sharing your story. Thank you for the work you do and the stories you amplify. I stand with you and these women.", "cocogoesout": "I am so sorry this is happening. You are so strong for sticking up for yourself. I believe you and stand by you.", "honestlylauren": "Thank you for sharing your experience ❤️❤️", "fireflyhealing": "You are seen. You are heard. You are protected & most highly valued. You are fierce.", "lil_livid_lilith": "Thanks for sharing and being brave! I believe and hear you.", "tasha_brandt_": "Unfollowed them. Thank you for this info. It’s extremely important to be aware of. Here’s to ending the toxic cycle of disrespect. Love to you❤️", "saduurn_": "WE STAND WITH YOU 💗 as a long time follower of both you @evyan.whitney and @wildflowersex, i am really glad you are sharing your story. I feel equip to make an educated decision about how much $ and time i want to invest in my social relationship with @wildflowersex. I look forward to their response and i hope they can *try* to make it right with you and all the other extremely deserving black femme educators out there. I hope its not just words but actions, which ideally includes $. Especially based on Nick’s high paying salary job that *conveniently* is rarely talked about... thank you @evyan.whitney. WE LOVE YOU❤️", "englotgg": "Thank you for continuing your work despite all the harassment and discrimination you have faced. You are needed and appreciated ❤️", "raeandhersunrays": "tagging well respected big name people that are following wildflowersux: ⚡️ @theslumflower @bodyposipanda @thehoodwitch @dorideer @the_angela_gallo", "judes.m": "thank you for sharing this information, and taking time to educate us on the nuances of this situation. i read the article and it seems as though @wildflowersex just threw black femmes under the bus for their own personal agenda. they had no problem compromising your livelihood while they did not take that risk themselves by calling out unbound publicly.. all in the name of “inclusivity” or whatever. while i am not a professional in this field wildflower won’t be receiving any of my support", "evyan.whitney": "tagging @blacklorelei7 @ethereal.1 @ihartericka @4locrow in this because I know y’all have worked with WF before. I am also tagging @unboundbabes who are unfortunately mixed up in this mess as well.", "jessieleer7": "@britkish this is hella disappointing", "americahatesus": "we believe you.✊🏿 #believeblackfemmes", "jocelynedrnkst": "💔💔💔💔💔 Sorry to hear you experienced this & I hope there is accountability and action from @wildflowersex", "blkgirlmanifest": "Sending you so much ❤️❤️❤️❤️", "bng.design": "Proud of you for speaking up! 💪🏼", "thelastmimi": "👎🏿"}