{"littleolivebirdbackup": "I feel this so much and I’m going to embody movement today . Thankyou for always inspiring me. You are ART", "shelbysellslove\nVerified": "Verified", "lregan1": "💕", "wildpriestesslover": "I’m feeling so similar, thank you for posting ❤️❤️❤️", "elleinadddd808": "You are beautiful, inside and out. Beyondddd inspiring 💜", "cosmic.creatress": "Wow I resonate with some much of this... Its been intense new moon energy but I'm going to try this for myself ✨ thank you for sharing 🙌💫", "yallcancallmek": "Thank you for this post sis ❤️", "dr.stephanieraven": "Love this 💕", "sinkintorising": "❤", "la_carmensita": "Reading your post is just the right amount of encouragement I needed to know that we are not alone in this journey of self-care/self discovery❤️", "headintheuniverse": "@fordeonfire ✨✨🦋", "bravespaces": "Thank you for sharing...I too have been in my head too much...anxious thoughts overrun my days. It’s helpful to know I am not alone and be reminded that this will pass. Keep going. 💗", "vrising1": "Hello Evyan, I’ve recently found you so glad that I did. I myself am going through a lot of changes, ending a 22 year marriage and dealing with a rare autoimmune disease. I also am trying to reconnect with my highest and best self. Sending you big hugs, my heart goes out to you. I hope everything works out in your world. I keep telling myself this is not an ending it’s a new beginning. So stay strong girlfriend blessed be my sister. 💜🦋💜", "savrewilder": "you're magic❤️", "__queenofthedamned__": "What a fucking Goddesssssss 🔥", "omegasmiles": "This is beautiful 💕 I feel like dancing, yoga, and other movements release tension and help me to connect with what my body needs and wants.", "batzbey": "💎💎", "joshuaandre": "Majestic", "iwrite_akrankin": "@yayasplace", "marywelchofficial": "Bridges bend in the wind. If they were rigid they would snap. Ur moving from one side of something to the other w tremendous grace and fluidity. You’ve got this 😍", "letstrynot": "@annadsobel", "jenn.mancini": "You are so very beautiful my lady. Hypnotic and free. ❤️", "rebeccachelbea": "Just discovered your account and I am in Shook love 😍♥️", "noomalayla": "You stunning goddess♥️♥️♥️", "_marijkeaarntzen": "🙏♥️!!!!!", "empress_kaaset_gira": "Thank you for sharing....many of us are going through similar transitions and your reminder is affirming. May we all transition through our cycles with grace.💜", "knowslk": "Thanks for sharing sister", "abbylafferty": "You are mesmerizing. I was so stunned by the caption and it was Exactly the message I didn’t know I needed. I am so thankful to have received this message from you ♥️", "arlequine_de_luxe": "💞", "megthelittle": "thank you for sharing 💖", "dreamslikedeserts": "Thank you for this post", "imustbeacat": "💚 dancing is my happy place", "melissa_random_": "Thank you for sharing this 🖤", "pondelili": "Thank you, I am learning more everyday how important it is to exist as I. #gonnadomypart", "virtualloyalqueens": "I love this!🧡🧡🧡 Thank you!", "fairy.pokemon": "I feel this on a deep level with how quickly things can change, and how out of the Self it can really take you.", "nicoverant": "🔥❤️", "pequenaguajira": "That is really beautiful and helpful!", "tender.badass": "Thank you so much for sharing. I needed to read this.", "hannahrosedexter": "Thank you for sharing this. I will need to try it out for myself.", "passionbykait": "Love this. When i was really sick and mostly house bound, bed and couch dances were a saving grace.", "layasland": "I love you 🧡", "hummingyourtruth": "🥰", "cherrybombinwear": "This is so beautiful! Stay strong & be brave 🦋⚔️👁‍🗨", "rdanipear": "This is a needed reminder. Thank you ❤️", "kanjizai": "@be_well_chris", "howcumpodcast": "Angel ♥️", "maddfoxxy": "Brilliant and helpful. Thank you😘", "shinydiscoballs_": "I relate to this so so much. As a human that dances connects me so much to myself and my heart. When I have a disconnection with the ability to get up from my bed and move my whole body I move my arms and hands. There is something so peaceful about releasing and expressing yourself through movement, no matter how little or big that movement is it is HEALING.", "serikovaoblaka": "That is such a good idea! I feel the urge to dance all the time but I'm not capable of it because I don't feel okay or my mind is messing with me. I will definitely try this practice.", "awe_inspiredliving": "This is so beautiful. Tears to my eyes honestly. ❤️", "retro_introspect": "It’s so interesting how we do similar things to come back into our bodies but I’ve never named them before. I think there’s power in that. My new favorite thing to do is play Still Blue by SiR after a glass of wine and dance like I’m making love. I hope you have a great day Queen. I appreciate your sharing.", "madamewaffles": "Much love to you!! 💖", "nurturing.me": "It’s been a real shifting week, and we’re due to welcome in the nu moon tomorrow! Honouring this beautiful flow, thank you for reminding us that even in the transition we can do small things that allow us to find grounding 🐚 so #nurturing"}