{"_softas": "Or maybe you know and you ask and they are just too vanilla for you perhaps", "bodyhairpositive": "Or maybe you’re having bad sex because you don’t want to have sex at all", "elleransfield": "@scottsamm", "juliadomundo": "@erlend.tre 😍🙏🏽", "genusaur": "😭 Omg that's so true!", "escolling": "@annamariajones @rebeccareev.s 🔥", "jessicagdennison": "This this this 👏👏", "thetaylorepps": "@natalie_rhea she’s a sex doula- excellent resource. In my top five of doulas I’d interview.", "shehzadiamal": "I didn't have good sex with a partner until I learned how to have great sex with myself. As I've grown older I've realized how stigmatized masturbation is for women. I hear from so many of my younger friends that they don't enjoy it, that it's just not for them....And I remeber saying it myself as a way to cover the shame I felt. Its truly heartbreaking. We need to know our own bodies.", "keeshthylove": "That's right! 👏🏾👏🏾👏🏾", "panasheh10": "what you are feeling is completely natural and if more women were open and honest about their feelings, desires and needs instead of hiding behind the moral and social beliefs of others you would be shocked at the number of women who feel the same way as you are right now, have been and will continue to do so from now on.", "mzfreakin_g": "Oh my God yes. This is exactly what my struggle was ❤️", "thebodyneedslove": "WoW Well said!! 🙌🏽💯", "stefaniamariaa.coaching": "🙌🏼🙌🏼🙌🏼 Heck yes", "shimshao": "@magalidj 😉", "lovejonestie": "🙌🏾🙌🏾God bless you sis I reposted your post and thank you", "downvalleychica": "love this...but how and when do you communicate this to your partner?", "carolshowsup": "This 🤯 spot on ❤️ @mandyfraden", "cyriously_me": "@andryoshka ❤️", "rockchalk.ali": "@little_miss_hawkins", "eyesaur": "@lo_love3491 and this is also one of my favorite people to follow. This series of questions specifically was really eye opening for me. Maybe you’ll enjoy! 😘", "the_j_stew": "@laurelmathews should we do this journaling exercise", "finding_tessasingo": "🙏🏾😍", "marinamaemoon": "Thanks!", "theabbyway": "True🙌", "ps_jo": "🙌🏼🙌🏼🙌🏼❤️ #knowyourself", "the.sensitive.savvy": "👏👏👏👏", "rdanipear": "🙌🏾🙌🏾🙌🏾", "melissajane.991": "👏👏👌👏🙌👌", "afrosensualheaux": "✨🔥✨ you inspire greatly & greatness 🌺✊🏽🌺", "shamanicreiki": "☝️🙌", "sunflowersutra": "👏🏽👏🏽👏🏽👏🏽👏🏽", "carligorgon": "How do you find out what you want tho", "mishaisjustkool": "@evyan.whitney do you have resources or an episode about communicating during sex? I feel uncomfortable talking dirty but also worry about using totally anatomical language.", "whatsinyourbox_": "🗣🗣🗣", "healwithbroocke": "🔥🔥🔥🔥🔥🔥🔥", "hello.keiry": "Don’t be shy to communicate during sex 💙 someone who cares for you will listen", "iamjanetphoenix": "💯💯💯", "jalovesyou": "Yep.", "london_lucille": "Love this!!", "organihanna": "Wow this is amazing, thank you!! 👏👏", "tirsatalks": "wauw, thanks so much! whenever people say that i always only think \"getting to know my body\" means what spwcific techniques do i enjoy during masturbation, but theres soo much more that i can define! just reading the questions not only has answers pop up already, it also opens up a world of what i am *allowed* to ask for and where ive been settling without knowing 💗💗💗", "niniweston": "These questions man. I have so much learning to do!", "alivia_live": "Wow I needed this, thank you so much 🙏🏻", "the.baltic.sun": "This is amazing and I appreciate you making this post so much 💖💖💖", "bigworld.tinygoddess": "YES YES YES ahaha 💖💖", "rebelrebel1776": "I know what I want....it's a matter of finding someone who wants what I want.", "sophiaspallino": "So freaking powerful. 💕", "younghonestmother": "These thought-provoking questions are so timely!", "oso.mar": "🙌🏽", "bobbarker333price": "Wow", "fatgelfling": "idk if i even want sex like i have 0 connection to my body and the idea of my body having sex makes me so uncomfy. so i guess all i’ve ever wanted was for it to just be over.", "someinspirationalsoultokeep": "Right on!", "yazzila": "@brujatip 🌻🌻🌻", "like_the_deer": "🙌🏽", "natredwine": "And it's the most beautiful thing ever 😍", "naturalmagics": "OOF! SHE SAID THAT!!", "softestrevolution": "ma'am, unhand my wig!", "shidehkafei": "period", "im.sinsitive": "it’s so hard for me as a shy, inexperienced, person who also has intimacy related trauma to practice this 🤧 I have like no sexual confidence and it truly is my own damn fault!", "emmelyareyn": "wow 😶 this could not be any more relevant for me right now", "daredevilbean": "Heck yeah!! I think MAYBE if you don’t know what you may like or dislike, perhaps talk bout exploring things? Communication is always KEY in everything, & ofc, sure as hell is KEY during sex . We should always talk to our partners & don’t feel like we can’t!! ^^ Haha, I’d always want to talk & say something otherwise we won’t be able to be satisfied & have a good time .", "stef_finoo": "👌", "bellesaco": "🙌🏽💞💞", "c.champagne.c": "🙌🏽🙌🏽🙌🏽🙌🏽🔥🔥💪🏽", "dmonae19": "@amor_maracuja", "oleksandra_sokolova": "Amen!", "makeyourperfect": "Yes! I think this goes so much deeper. We often don’t let ourselves listen to what we want—in relationships, with family, with careers—even what we want to buy at the grocery store when we are hungry. . Practicing tuning into what you want on these levels actually helps women realize what they want on sexual levels. . So much de-programming to be done!", "thatgirl_withbighair": "Honestly, I don't think I even like sex. I don't get anything out of it. Masturbating is the only way I get off. And I don't really masturbate that often. What does it feel like to be turned on?", "thehappyvproject": "Literally just did a live on this. I say all the time that your partner is not in your body. You have to share that feedback for them.", "_tsn4": "Exactly once you express what you want from sex the term “bad sex” doesn’t even exist", "krystal_tantricyogi": "Most ppl need to be taught the art is love making and intimacy", "ibadona": "Amen. 🙏🏾", "just.pamc": "Thank you for this 💕", "emilyhannah_love_is": "Such a good point 🙌🏻❤️", "hailheidi": "yes.", "eco.dreamer": "With past partners I try explaining to them what turns me on and I try describing how to do it and it never goes well. They either get frustrated cause they can’t figure it out and they’re already turned on and wanting to get off (RUDE), or they do try but they don’t do it right and I feel nothing and then I just want it over with so I can go back to my day. I’ve reached a point where sex is meh for me because I have had a partner that has worked out. 🤷🏽‍♀️", "val_demort": "THANK YOU!!!! So helpful!!!!", "__rukiat": "Preachhh🗣", "christelle_studio\nVerified": "Verified", "lallums": "I can dig it.", "eroticren_aryn": "Aye! This is so true. I used to believe that it was the partner whose fault it was but almost every time I felt helpless to speak up and it has always resulted in bad or meh sex.", "nicolettelocklear": "I NEVER have bad sex because I TAKE what I want from my partner 🤷🏽‍♀️ he has no complaints 😂", "emilyaune": "I needed these today, thank you @evyan.whitney !", "dks_67": "This is me, all day, errrday. I feel like it wasn't always this way though, but somewhere along the way (same partner, mind you) I forgot what turned me on. 😕", "lay.bizzle": "‼️‼️‼️", "theheartadvocate": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 #THATPART", "mama_magda": "@sabrinabisaga", "meg__skywalker": "🙌🏻🙌🏻🙌🏻🙌🏻Yes! This is so true!", "awkward_blackhippie": "🙌🏽🙌🏽🙌🏽🙌🏽", "hannahsholistics": "@andrieleni read this xx"}