{"rx.cosplay": "Related so much to this, as I had an at times frustrating session of intimacy with myself, mad because of the trauma that influences me so. But it's all just a work in progress. 💕 Thank you for sharing this", "poetic_mystic": "🙏🏾 much love sis. Thank you for sharing this", "johanna.hirschler": "Yup we're in this together and nothing of the trauma can be undone... small victories though 😍", "tabe_wil_a": "Thank you for being so open about all of this 💕", "shadydarling": "This post is such a gift. Thank you for your beautiful vulnerability 🖤", "follow.your.destiny": "Thank you for sharing 💕", "luisamaija": "Thank you... I can relate to this a lot, helps to know we’re in this together. Appreciating the authenticity.❤️", "lia.bevenger": "I feel like I could have written that first paragraph myself. The honesty here is comforting.", "moonsandkyber": "Thank you for sharing your raw truths. I experienced feeling less frustration and more validation while reading it. ♥️", "dream_building_ford": "Good words girl! Thank you for your transparency", "wearebodypolitic": "feeling this so hard 🙌", "sapara444": "❤️", "livinlavitamoka": "<3 <3", "tk.flowerfuzz": "Yes, this.", "crossroadsstoryteller": "@bevmara ❤️🧡💛💚💙💜", "alienada_nada": "I saw your igtv about men messages and girl, I support everything you said and I'm glad you're using your platform to show the world how stupid men are 💙", "kelbyymackenzie": "@cardenserviss @maddykenyonn this was the account I mentioned the other night 👼🏼", "trevannef": "I’ve love for you to write another poem soon!", "stylebynaim_a": "I’m so glad I came upon your page...I feel like this entire post was written just for me. Thank you for sharing your words.", "pinepuss": "Wow 💕", "mindsmine3": "U r powerful ❤️🖤💚", "mrtreladd007": "You are destined to grow, overcome, exude greatness and shine brighter that you ever anticipated. It was already decided . You , me , us will realize this in full 👑🎶✨. Peace✌️", "itsjuustliz": "💞", "lysswild": "Yes yes yes", "bees.wax": "Thank you for this post! 💖", "akeylalune": "I relate to this so much.", "lovellycostumes": "Thank you for sharing this, I’ve been feeling exactly the same. So glad to know I’m not alone. Sending lots of love and healing 🙏💛", "tylermb": "You took all the words and feelings out of my mouth and body and typed them! Thank you", "celestialskins": "Took the words directly out of my mouth with the message 👄", "celestestrangelove": "This resonated so deeply with me, thank you for sharing. You have been instrumental in my journey of sexual liberation. And for so many others too, as is evident from all the comments 💖", "beck_ugh": "I find it particularly difficult for us folx in, or peripheral to, sex work fields to give ourselves permission to not be perfect paragons of sexuality. It's hard to encapsulate the duality of owning my sexuality and expressing it while also teaching those around me that such an expression does NOT mean I am necessarily sexual 24/7 and in no way gives anyone permission to sexualize me without consent. In some ways I feel that working so closely with sexual discourse and the complicated bundle that is the psychology of sex makes me more likely to shut down and experience periods of sexual \"hibernation.\" Sometimes it feels like others are reaping all of the benefits of me bringing up and unpacking taboos and stigmas around me while I am left drained and the furthest thing from turned on. Thank you for sharing your own difficulties along your journey. Wishing you love and light 💛✨", "kylie_justine": "as someone who is in a very similar space, thank you for your work ❤", "sagirainbowsparkles": "❤️❤️❤️", "hirsuteskinsuit": "💞", "stylebysteph": "🙌🏾", "brubsgardel": "Thank you for writing about this. As somebody who's starting my journey, all these struggles sometimes seems like I'm the only one in the planet who has them, like there's something wrong with me. But I realize that liberation truly is a journey, that I have the rest of my life to figure this out. Thank you lady 💕", "against_thegrainiii": "🔥❤️", "cannabunnytv": "This is beautiful & so are you💕", "jenteliene": "Your words made me almost cry... they resonated on a deep, deep level that not very often gets heard, seen and acknowledged this well ❤️❤️", "ckbpetitechaton": "You da bomb 👏🏻👏🏻", "oliviainthewild": "Thank you thank you thank you for sharing this 😭❤️😭", "kikicarlstrom": "I agree with almost all of the things you listed that you do not like in your sexuality, as things I also do not like in mine. I’m interested in using this question during some self-care time to see what other things are present, and examine how I’m dealing with them. Thank you for this beautiful reflection and prompt!", "heelermom23": "I see you , I hear you , I am just like you !!!! 💝", "clairexvalentine\nVerified": "Verified", "creatingkelsi": "i relate to all of this. you are not alone. thank you for sharing 💕", "annanirvana": "👏💕👏💕👏💕 Keep on keeping on being a badass 🌟💃🌟💃🌟", "m_prieskorn": "✨ 🖤", "verldsherravelde": "Oi thank you 😔🌸 i feel the journey and the struggle", "pizza.hat.guy": "Thank you for sharing. I really needed this today. Sending you love and always appreciative of your bravery sharing it as a beacon for the healing of others. 💖", "being.miriam": "Mmm love the honesty and transparency 💙🔥 it’s so refreshing and felt!", "chaannnty": "@kmary888 😭❤️", "emeraldskygoddess": "I so appreciate this transparency! Embarking on my own journey with my sexuality has been a bit challenging. Navigating what comes up and what I feel while being mindful of my husband... But your words just remind me to be patient, gracious, and kind to myself. Thank you. And I love your page", "sarahngelique": "💗", "blkhippiegoddess": "💜💜💜", "hana.tuwhare": "Thank you ❤️", "thrdeyetears": "Thank you for saying this.", "wetz": "wow. everything in me melted reading this because i (for some reason) couldn’t fathom what my blockage is....now i kno. I relate to this SO much. trauma mayn...a bitch. Thank u for sharing ur unwavering vulnerability & strength🤍🦋", "iamheather.marie": "I could have written this. With all the progress I (and husband) have made ... I still find I have enormous difficulty sometimes.", "sophiebayla": "Thank you for your honesty. Not a truth you’re obligated to share but one that will help so many feel less alone in their journey! 💖", "sophiademarkis": "thank you so much for reminding me that many people struggle with this in the same way I experience it, and that full healing takes time 🌸💕", "mamasayseat": "Wow @evyan.whitney so powerful. Thank you for sharing and showing this 🙏🏽✨💘You have inspired me to really consider and so tonight I’m going to journal and pour my heart into it xx", "jennmorsephotography": "💖💖💖🙏🙏🙏", "melkay0216": "♥️", "vicky.amora": "Wonderful words!! 💕 Thank you so much for sharing, made me feel a little more in peace with myself.", "trishamandes": "❤️❤️❤️👏🏾🔥", "michaelamhuizar": "Relate so much to this. ♥️", "carehughes": "Thank you for this post💛 I relate to so much of this and reading this was extremely helpful! You’re magic ✨", "kristajoy_w": "Thank you for being vulnerable. It’s beautiful to s", "jonesycat22": "@meggiegaga1 💗", "taberstockstill": "Like always, everyone of your words make me feel less alone in healing sexual trauma. Thank you💫 cheers to the journey", "mama.renay": "Thank you for sharing this. I see you and I appreciate you.", "everydayobservationist": "✨✨✨✨✨✨✨✨Thank You✨✨✨✨✨✨✨✨✨", "natureb.y_": "thank you for sharing honestly 💖💗", "kindly.kirabird": "Yes, I feel this so much, the healing, the liberating, the resurfacing...thank you for sharing 💕", "afrooankali": "I feel this so much 🖤", "olivia.ku": "💗", "svenjasabel": "Thank you for your honesty ✨ sending you love and light for your journey", "mamichakra_": "😍😍😍", "building_delights": "Been feeling this a lot too recently. We're moving forward though, even if slowly", "lori_v1017": "thank you for sharing your journey ❤️", "strawberries__dream": "Beautiful honest words ❤️", "keynoteadventure": "Thank you for your honesty @evyan.whitney !!! 🖤", "quickieswithmickie": "💯💯💯", "r444_lumi": "Exactly how I am feeling. Thank you for putting this into words 🙏🏻💞", "pupspolepizza": "This resonates with me really deeply. Thank you for sharing 💕", "howcomevanna": "Damn. Needed to hear that. Thank you for sharing ❤️", "msviintage": "Thanks for sharing during your healing and growth process. You’ve helped me over the last couple years I’ve been following you to be more intentional about my sexual liberation 💜💜💜 blessings to you 🌿👑✨", "the_annamarie_hernandez": "Resonating ❤️❤️", "jessicalynor": "It's like you took the feelings of my soul and put them into words - brilliant & thank you", "infinite_aura_": "Beautiful vulnerable share, thank you for sharing your truth! 🙌🏽", "violetavaritia": "💓 Thank you so much for sharing. 😻", "cute_little_queer": "When I feel that way about sex/my sexuality and I remind myself that it’s ok to not want sex or have trouble with it. It’s natural and will heal in time", "oliviabylove": "Beautiful thank you ❤️ So helpful to hear the work is never done and even a sex goddess like you still has her wounds 🌞", "missdanifoster": "I love your transparency 👏🏽", "eveningtaylor": "👏👏👏👏👏👏💞💞💞", "sistersisterbreathwork": "Yes, such a forever journey ♥️", "kehinde_5": "📸🔥", "dearbhlahone": "Thanks for sharing ❤️", "heatherg_wildnfree": "So beautiful. Thank you 💜", "softpathhealing": "i can relate to a lot of this. no matter the work we do, the imprints can still be so lasting. it all can take so much time. thank you for sharing. ✨", "dew.drip": "It's scary, I read this and recognized the things you said about your brain blocking pleasure and the trouble you have getting out of your head. I guess you just gave words to the things I experience but didn't understand. I really want to do something about this... but I have no clue where to start"}