{"martixana": "I love this 🙌", "cquinnceyoga": "This! 🙌🏼", "nanchitaaas": "@rudykalma", "peaquals": "Thank you.", "phoebe.g.g": "LOOOOOVE THIS 💚", "wonderkaylie": "Thank you so much for mentioning those of us who experience sex this way on the regular 😍", "darby.dee": "Wow. This is message and thought, something I’ve pondered and explored before, has come at a really synchronistic time. This is so beautiful, such a good reminder, thank you. 🙏🏽✨💖", "curlyalienaim": "I needed to see this more than anything today. Piv is extremely painful for me, and this puts a world of pressure on myself, hate on myself of how I can’t do the thing “ we should be doing “ etc. thank you for posting this 🙏🏻💓", "so_nessassary": "I like naked cuddling. Ima start using that one.", "sippinhannah": "Boom. You just broke open a large vessel of internalized pain centered around \"if we aren't having sex every time does he still want me\". Being in a healthy relationship after trauma not only makes steady scary but it picks at perceived intimacy and sex. NOW because of THIS post I've expanded to seeing how sex HAS been happening in a multitude of beautiful ways. I am just.... wow.", "x.lane.s": "I mean if I agree to do one of these things w a guy I am absolutely not consenting to sex.", "maddoxsmommie": "What an amazing concept! Thank you for sharing and @ohnutco for brilliantly designing such joy. ❤️❤️❤️", "annalinnmurphy": "Do you have Venmo, @evyan.whitney ?? 💕", "pauleany": "@ever.301", "kalyncaterina": "I loooooove this!! Thank you 🙏🏽 💕🌹", "rebekahjoy__": "@kadishjosh ❤️", "tallpretty_____": "@47gully everything we do feel good to me", "jendematteo08": "💖", "shitaginashi": "@sarah_montgomery_ this is v lovely n interesting", "hentaipapii": "Indeed indeed", "aisha_chey": "I loveeee this. Wow", "lorit21": "you are amazing!!!🔥🔥🔥sending this to my bf right NOW", "amaninnewyork": "This is dope, love this.", "tiffany_hardin": "@tiffany_hardin", "gymbunny_daya": "@masan_productions", "_ganjafairy_": "love love LOVE", "cosmic_conduit": "I really enjoyed reading this and appreciate the invitation to explore this more, thank you! ✨", "jahfeelss": "If we went like this then technically I'm not a virgin which relieves alot of pressure. Yay!!", "karlaluster": "Love thisss😍😍😍💕", "spisces_princess": "@light.beer", "lomackelton": "This is such an exciting and beautiful post - I feel my brain and body moving towards exciting and liberating possibilities. Thank you thank you for this ❤️", "yolarf": "This is awesome 💯", "sparklesrmyfavoritething": "Yessss and so much more", "j.m.bishop_": "🙌", "claire_beaux": "@shepherdsfilms 👏🏼", "laurajendusa": "Hallelujah", "perpetualpisces": "Yes, love this! I’ve been MIA lately really trying to have more sex with myself in this way and never thought to equate the two. This helps me view sex with a partner with less expectation and to really be in the moment. Thanks for sharing 💕✨", "laruhears": "✨💓✨💓✨", "gladheartherbals": "@susanheyward 🥰", "socialmediaisfake": "@lapoderosafromtheconcrete 🙌🏽", "jessanana": "I LOVE this 👌🏼❤️", "adventuring.annie": "@_lolo_holo @holtzwoman @testifeye this just blew my mind a little bit", "birdleighboe": "Thank you for this ✨ needed it ♥️", "augustkate88": "Hell yeah! 😍", "sexualhealthfoundations": "1,000,000 yes’s!!!", "abr0w": "I love this @fallintodesire @chlokoh", "kalah.hill": "Preach! 💯🙌🏽😋", "_eve_aloha_": "YES. 💯", "thecyexperience": "I love everything you wrote. I feel enlightened to challenge myself on this concept. I feel ready to have more sex", "antonia__may": "Love this", "fraxinus_a": "Naked cuddling my partner is my most favorite thing ever. The skin to skin and just laying in his embrace or him in my embrace seriously melts away the outside world and fills my insides with peace and calm. I've been working on being present when the moments arise bc I'm always overthinking or in my head about something. 💞💕 I love your page and the conversations, thank you for your vulnerability. I agree penetrative sex isn't the only sex, what a disservice we do ourselves when we continue accepting such limited beliefs.", "creativecalantha": "@andrew.like.duh - yes please. 💕", "rdanipear": "@loventea let's discuss 👀", "yerba.negra": "WOW", "thejasminebperspective": "Thanks!", "sweatybackknees": "🧡", "ryancouplestherapy": "Love this and talk to my clients always about this! We need to spread the word and help people be expansive in how they define sex.", "elianamreyes": "Yes yes yes yes! So much yes! There are so many layers and ways to be intimate, to be soul naked and go expand on pleasure. Loved what you listed.", "ital.womb": "@free.angelica", "tesserini": "Thank you so much for your wisdom and your knowledge, and your willingness to share this with your followers. 🤗 As a queer, invisibly-disabled woman, I have challenged my sister's and all my friends to change their thinking on sex and intimacy, and how orgasms and penetration are only the tip (pun intended) of the iceberg, and do not define sex. Now I have a better, articulated way to show them 💗", "hippypippi": "💛", "luzepeda": "I love this!✨💛", "alittlewildling": "This is wonderful! Thank you for this well thought out post 🙌🏼", "lavenglow_organics": "👏🏾👏🏾👏🏾 Love these thought provoking and soul searching questions 🙌🏾✨ thank you Evyan 🧡", "sterlingnoelle": "💛", "johanna.hirschler": "So love this. Always rediscovering it!", "ulizzo": "I like this definition. Thank you for being so open and sharing. 🙌🏾🌹✨", "erikks": "@ldynck", "sexedfiles": "💘💘🙌🏽🌹", "stephaniesoundsofficial": "This is perfect and everything I have been struggling to articulate. Thank you x", "lunagraceisbelllove": "All for this!!!", "ajsela": "🙌😍Love this", "lissa_reags": "@evyan.whitney I'm not sure if you have or not, but could you list some reading material for this?! Articles or books would be great that you would recommend 🙊💜 very interested in delving into this subject matter 🖤", "theconsciousmama": "@littlenugget_bignugget 😍", "a_nnabae": "@sydneyraechin !!!", "ashoncrawley": "yes yes.", "_adventurerising_": "Yaaaaaassss!!! 🙌🏼 @janesteckbeck_csc", "ayyonajanae": "The best sex I’ve had is riding on a rollercoaster", "sous.la.tente.des.femmes": "Thanks for sharing this point of view 🙏🏻😍", "shewhobeams": "🙌🏾🙌🏾 This is so true. An expansive mindset is everything", "pleasuremama": "I love this 💚", "cfapdx": "I love this @evyan.whitney . I’m newly widowed, but have been ‘alone’ for years due to his illness. This has me thinking about how I will move about navigating new experiences with partners. ❤️", "tiffysab": "I love this so much. Reading over and over again", "ill_send_you_the_link_": "@alainadelrey", "brandynlday": "@madoka_koguchi", "anyatchoup": "Thank you for this!! It so concisely and beautifully puts to words something I've been discussing in my own world a lot lately. Really helpful to have something concrete like this to point to. 💖💖", "yaddydankee": "😭😭❤️", "allielapidus": "I love this and love you sharing about it. I sort of organically found myself pleasure-centering a few years ago and basically realized that anything that feels good and gets you into the body is life-promoting and totally intersects with the creative/sexual energy flow. Savoring food (slowly!), being intentional with scent, really positive feeling exercise are critical for a high-quality life experience. And as you said, they’re definitely *so* connected to the level of enjoyment and satisfaction we experience when engaging in more traditional definitions of sex. The goddess Vesta sort of symbolizes this in astrology- that the body is a temple/house that, when in full and centered SELF devotion to it and it’s aliveness, is the source of our sexual spark and creative fulfillment.", "dreamslikedeserts": "YEEEESSS 100 TIMES YES", "lathe.of.heaven": "@balladestudios “mouth fucking” just got an upgrade!! 💖🔥💖", "tashakti_": "❤️❤️❤️❤️🔥🔥🔥🔥", "maguffie": "Yes to all of this !", "devon.evergreen": "Thank you 💐", "connerleecarey": "WOW thank you for this; this opens an entirely new thought process, a new journey wow. fuck yes", "katylpacino": "Yes yes yes 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "mordecaiandriggleby": "I LOVE THIS💜💜💜", "vivalatails": "@mindybaker_", "aegala": "Fantastic", "renetonalli": "@sammyrhinolander", "theannnguyen": "Yes yes yes yes yes!!", "holisticwombman": "Thank you so much for the work you do❤️", "janettecasolary": "Literally my favorite thing ever written", "jeanetteleblanc": "@winonagrey our convo just now ...", "expressionsbyvidya": "Thissss🙏🏼", "babiaca": "LOVE this so much!! Thank you for sharing!! @sistershakti @returntoom @devaraj.yoga @janine.leagh.alchemy @anna.kymayoga @groundedlivinguk saw this and thought you lovely ladies would like this theory too?? ❤️", "bea_angus": "Very thought provoking, thank you", "shalenah_": "love you", "her_resonance": "🙌", "suya73": "Yasss yasss yasss!", "charlotte_sharingthehealth": "Yes 🖤🙌🏼", "ibambz": "This is really beautiful", "frutarrr": "I cried when I read this", "naught._._": "This reminds me of Audre Lorde’s essay Uses of the Erotic!", "eveningtaylor": "Big yum energy reading this. Thank you.", "dustymoon_studio": "Thisssss!! I want more non traditional sex. ✨🌻✨", "rockandlit": "This is how I re-centered sex for myself a couple of years ago! For me, the idea of any sexual desire was so shameful. To try and remove that shame I looked for anything I found pleasure in, actions that made me feel powerful and sensual. I’m happy to see this post because it’s a good reminder of where I began my sexual journey.", "ether_howls": "Wowza! Thank you for expressing this!🔥", "imaginaryfiction": "This is beautiful. Thank you 💕", "pranjalljain": "This is so beautiful, thank you for sharing ❤️", "m_f_m_": "🔥🔥🔥", "melk_earney_": "I am here for this", "liv2wynn": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "thisiscmartin": "This is really interesting and something I needed to read this week", "tender.badass": "YES 👏", "the.bare.female": "I completely agree. I feel sexually with my partner many times a day throughout different scenarios that aren’t defined as “sex” in the traditional sense- it literally accounts for 80% of our sex life! People can be so obsessed with sex and the number of times you have intercourse with your partner but often forget that your sex life is so much broader than this 🔥♥️", "plantyou": "I love this ❤️", "theealluringone": "didn’t know i needed to hear this but i did!", "tonhyakae": "Love this 💕💕"}