{"i_am_kimpossible": "@evyan.whitney thank you for sharing ! My bf and I recently moved in together and we have separate rooms, which some think is weird (whatever that means 🤷🏻‍♀️). It wonderful to see that there is no normal to a relationship. The people in that relationship need to do what is right for them, not what society tells us we need to do. Keep on doing you! ❤️❤️❤️", "beeee_youtifullll": "i love this so much. all of this.", "thesensualnonconformist": "@transpirationalhealer", "eevolves": "My partner and I decided to do the same thing last year when I moved back to my hometown after being together for 6 years and living together for 4 of them. It’s been THE BEST thing that we’ve ever done for our relationship. Congratulations!!!", "eroticapoetica": "You’re now dating Kevyn Aucoin?", "lydiabeingalive": "Ahhh I'm so happy for you both, that you've found a new way to be together, while honouring your other individual needs/ desires. So much love coming your way 💜", "kikicarlstrom": "Just finished the podcast! Firstly, I love hearing your soothing and sweet voice 😌 it’s been a while. And second, it really sparked such an important conversation for my partner and I around ultimate freedom and how much do we allow to just die within ourselves because fighting for it was harder than just giving up on the need for whatever the freedom was. I think of my mother who has sacrificed the last 26 years living in the suburbs when she deeply wants to move to NW Portland, but she allows that dream to simply die within her because advocating for herself feels too hard. Easier to allow her husband to have what he wants; a suburban life. Anyways, your pod applies to so many different aspects of life and I’m also jazzed to learn a new term (LAT)!", "tefylh": "thank you for this 💕 sharing your experiences makes for incredible source of knowledge and inspiration", "eucavera": "Thankyou for talking about this 💗", "chichi_bombbomb": "Thank you for sharing your story. I’m so happy for you that you’ve chosen to prioritize your self! It takes so much courage to take that leap. I’m excited for your journeys together - apart.", "chereeselavonne": "i haven’t even listened to your podcast yet, but have in recent times been trying to negotiate my own desire to be in intentional relationship, but also considering that living with my partner may take away from the individuality we celebrate. just seeing that there is consideration elsewhere in the world along these lines give me some release to continue to follow my intuition on this. thank you for sharing and for showing up in the world in the way you do.", "spitblue": "thank you for sharing this, i’m grateful to encounter pages like your whet you can find very relatable experiences or just an insight to life which can help others guide through theirs. i appreciate you ❤️", "lillierinyoga": "Loved loved loved reading your transcript. Felt like I was reading a heartfelt letter from an old friend. Thank you so much for providing a transcript too - this is rare, much to the frustration of deaf folks. Thank you again for sharing your story - it’s soul fillin’ stuff ❤️", "s7a8s6": "it means so much for you to be candid and fearless in this way, especially as a black woman ❤️ thanks ev’yan🥰", "ether_howls": "Mmm those kisses💗", "naturalhairrule": "Thank you for sharing. I enjoyed hearing about different types of relationships", "saint_cyr": "❤️❤️❤️", "theevolutionof.a_lee": "I’m so happy you shared this.. my heart really needed to hear your story 💙", "ju1ie_m": "Thank you so much for sharing this! It’s an honor to witness 💗🌸", "cowtowncitygirl": "Loved this! Thanks for sharing!", "iamrubykhan": "Thank you for sharing this! It’s funny cause I was in a long distance relationship with someone in on a whole other continent, and to be honest with the help of FaceTime and WhatsApp, it really helped us to better understand each other. It was difficult at first, but I think it helped us to put so much more value into our relationships.", "igmelinavictoria": "👏👏👏", "chanel_manicato": "Trying to find the words through my tears. Just read the transcript and wish I had this kind of blueprint or even example of different relationships/togetherness practices years ago! This is beautiful and definitely brought up a lot for my younger self. Thank you, thank you!✨", "hellamarried": "Can’t wait to hear this because my partner and I have discussed this idea too! Love the work you’re doing!", "trav3ling.light": "@xcheebax 🖤", "karen_schaupeter": "Thank you for sharing 🙏", "hazelnut_beauty20": "❤️❤️❤️ this episode was so raw and honest. As a currently single woman who has left various relationships because I felt the need for space I couldn't get in the relationship, I no longer feel alone. Seeing you guys work through this is giving me hope to one day find a partner who can respect my space while still sharing love with eachother", "devinalst": "I just listened to your newest podcast on Living Apart Together and I am really really happy to know someone else is willingly choosing this. A lot of the very few articles i managed to find on this seemed so far removed from what the reasons we are choosing this were. Thank you for this. It has given me hope", "eventualmillion": "Sending love to both of you! ❤️", "kacimial": "This episode brought me to tears. I’m grateful for you sharing your beautiful story. I found a few things I could relate to ❤️ thank you!", "lenoreblack_": "I’m am so witnessing you here! I always joke that my ideal relationship is being neighbors 😂 or at the very least sleeping in separate rooms ❤️", "mirrornamedronin": "Do your thing, mama! Happiest of happiests to you both in partnership x distance. If it feels good, it sounds great!", "remykassimir": "Brave woman 💕", "zgr_number1best": "Wow the love is real.", "pollinatorhandmade": "“Much of my independence lived under the protective shadow of my partner”... really got me. Thank you for telling us this story. My bf and I don’t live together and don’t plan to and it’s good to see this type of arrangement normalized. I didn’t know it had an official name!", "darkfaedahlia": "So beautiful 💕", "nefernici": "I’ve been considering living separately in long-term partnerships. Thank you for sharing and can’t wait to hear about your experience ✨", "ritualwerk": "😍😍😍", "blkgirlmanifest": "So so so proud of you friend 💕💖", "fertilefemme": "I appreciate this episode so much! It’s inspiring and a great example of how health can be difficult and still possible. Thank you for sharing.", "torialamaze": "I haven’t listened yet but this concept of living separately yet together is ideal for long term love I believe. My husband and I love each other and share different rooms. I need ME time and not be considering cleaning after another adult. It works. We also have a small child. Kudos to u for living authentically✨💪🏽", "wishcandy": "Just finished the transcript. I’m so happy you’re honoring your needs and learning more about yourself 💗", "iamshaunna_williams": "This is beautiful! I look forward to listening. Thank you for honoring your time that you needed and for sharing when you felt ready enough.", "bigwhaley": "I will absolutely read the transcript. My partner and I made this same choice this past year, it has honestly been the best thing for our relationship. Now five months later we are the most connected and happy we’ve ever been. Sending you both endless good energy and love ❤️ ❤️", "they.them.ryse": "💕💕💕 So much love and respect ✊🏾", "lesliefender": "My husband and I started “living apart together” last year and I’d say this unconventional transition supported more than threatened our 24-year marriage. His lease was up at the end of March and we’re back under the same roof combining our resources during the uncertainty of this pandemic disaster. There are definite benefits and challenges to this new-yet-old arrangement right now, but we both agree we’ll return to separate households whenever/if things return to “normal.” Honestly, neither situation is for the faint of heart. Long term relationships are a beautiful thing, and not without their battles. Thanks so much for sharing. I look forward to listening to your podcast.", "tealeigh": "Thank you for sharing that. This is a very relatable and I think important thing to share so I appreciate the openness. I would really love to try this with my partner and I one day. You’re an incredible human being, one that I’m lucky to have met 🖤", "rebeccaweger": "I love hearing stories about how folks buck expectations and find living arrangements that work for them. One of my favorite experiences with an ex, years ago, was living in adjacent apartments. They were in a house. We had the two apartments on the second floor. It gave us both the space we craved, yet made being physically together easy.", "kailani_coleman": "❤️❤️❤️", "zozojaffs": "@jennykerrym", "chantenicole423": "Loved the real and the rawness of your recent podcast. ❤️", "love2lovedana": "We are truly similar. I support your journey sis", "kleidendrew": "Peace and Happiness to you. 💓💓", "naornvr": "As long as you guys didn’t break up 🥺", "all_lush_everything": "Thank you for being vulnerable and sharing this journey with us. I am encouraged by your courage to create your own story rather than continuing to live by the script most of us were given.", "smartbrownvegan": "I was so hoping you’d realize that y’all could do long distance lol. Great analysis and introspection. And great showing up for yourself. I think I‘m repeating an old pattern of wanting to move in with my partner but I know I need to move back to the city we met in alone and that we live separately. We’re long distance and she lives in the city I moved from. I‘m moving back but feel the pull to merge and I see this as a sign that I should do it alone even tho I also haven’t ever lived alone before. Went straight from mom’s house to my ex husband then back home then to my ex gf. Ugh I gotta break the cycle. 💜", "g_lady02": "This is cool! I have met many couples who live a part and it works better for them, Francoise Hardy and her spouse do so. Do you girl 🌹", "ty_kwan_do_": "@intuitivebiologist @lyzkayla @itssashle @torizulz @_joyce89_ so interesting", "ellieangelk": "What a wonderful podcast. Thanks for sharing. 💕", "lobavaga": "Love this. Support this. And done this. Best thing we did for each other ✌🏽", "severalsnugglers": "It’s so brave to be honest and it’s so noble to accept realities that aren’t socially normative. It’s inspiring to see other people able to support their own true and unique balance.", "kristajoy_w": "Thank you for sharing Ev’Yan", "jessgotclass": "You owed this to no one, but as always your vulnerable honesty will help so many who may struggle with their own truths and journeys. Thank you for sharing ❤", "venus___envy": "I listened this morning! So proud of and inspired by you! It’s an incredible thing to be willing to transform your marriage to pursue other things that make you happy. Glad you’re doing well ❤️", "wildsol_": "crying at the beauty of you two and your love. thank you for allowing us to witness you. ❤️", "qui_lombo": "Love and support you so so much. An amazing podcast episode❤️", "hannahrosedexter": "Thank you!! My partner and I are doing this as well, and it's hard to find examples of others doing it successfully. Cant wait to hear the podcast.", "star_sibling": "❤️😍", "atoastedcoconut": "My partner and I are in the midst of the same. I think it’s a beautiful thing to be able to have the trust and space to lean in to your freedom and individuality while being able to maintain a deep connection with your partner. Can’t wait to listen ❤️", "freshlittlesalad": "thank you so much for including a transcript. 💜", "gabriella_neveralone": "Daaaamn!! A lot of change for you this year sister. 🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 Love and light", "imatbalance": "Love you so much💕💕💕💕", "turtlexxo": "i just cant wait to hear what you have to say...because im going through something similar...*sobbing/ releasing for a lot of reasons*******im very very interested that someone else is doing it. because im very unsure.... . . . .", "deise_dnc": "So beautiful. My husband and I decided to be a part for a time period that's uncertain. He moved to pursue a new job and I stayed because of my businesses. It was really hard however I understand the meaning of a relationship and the meaning of being free and being together. I am certainly going to listen to your podcast! ❤️ Thanks for sharing", "katakeela": "This is so amazing. Thank you for being so vulnerable and transparent with your experience. Long term partner and I have talked about this a lot and being able to see people who love each other in ways that buck the norm means everything. So happy you are where you need to be 💛🌻", "mdoubleu4": "LAT coupling!!! Highly underrated ❤️❤️ Thank you for sharing!!", "africabrooke": "As if you couldn’t be any more amazing! I love you! Thank you for this💛💛💛", "catsaysmaow": "I've thought about this quite a bit, and its encouraging to know that even if I want to live with my partner in the future, it doesn't have to stay that way forever. That relationships are fluid and things can always be reassessed to fit the unknown needs of each person in the future. Thanks for the vulnerable share 💘", "carson0414": "✨✨✨✨", "aurevoircorrine": "Brb, crying because relatable. After 7 years I’m experiencing the same thing. Thank you for this, going to listen later today 💕", "epiphame": "i love this so much ❤️", "torrisees": "Sending you warmth and love and space. thank you for sharing a piece of yourself with us 💕", "jen_says": "You are the epitome of authenticity. Thank you so much for sharing! 🙏", "charmeeifyoudare": "I have been sitting with this episode for the past hour and it really erupted this inner dialogue of “what do I need in a partnership, Have I been nurturing others as a way to run away from myself?” Wow, breathtaking, I could cry this really touched me. I can’t thank you enough for really going there and being so vulnerable publicly! 💕💕", "mariolametaphors": "Thank you for sharing this! I support your decision and will send you both real love. Separation times are needed in order for relationships to thrive in today’s society. Thank you for sharing. You are truly inspiring ❤️", "cpr2323": "Thank you for you vulnerability! My partner of 15 years and I are still close, but people change with time. Our desires, our needs, and well, just who we are. <3", "your_eden_": "I love to see how you are shifting the relationship paradigm and open us for new ideas", "sarzblk": "currently going through this with my partner. thank you for sharing your experience and reminding people like myself that i am not alone in this 💕 sending love and support your way!", "avantfart": "This happened between my husband and I for the last two years. It was intentional and in the end it We are both military and our next duty stations were going to be apart. It was tough but in the end I appreciated the time apart. It’s helped us reconnect with our independence because since we got together we have been inseparable. So the distance was needed. This will continue as long as he is in for 6 months or more at a time every few years. This past month he has come home and it has been tough but rewarding. ☺️ Peace be with you guys 🖤🖤", "peanutbutterandrachel": "I just listened. Thanks for your beautiful sharing. Definitely food for thought about what parts of myself I've hidden or not nurtured after being with my partner for seven years.", "lydiahenriettao": "i just read the transcript of your podcast episode & wanted to thank you for sharing this offering. it was a joy to read & opened my ideas to the horizons of love! what a gift 🦋", "sarah_waugh": "@evyan.whitney I’m listening to the episode as I type this, and it is so timely, as I’m exploring something very similar. Thank you so much for sharing your experience and journey with us. Much love to you. Be well. ♥️", "trianglestrawberries": "Listening to the podcast right now and it’s my first one! Can’t believe I haven’t listened sooner! You’re so articulate and your voice is so soothing. I feel inspired just listening. P.S. I’m a Sag Sun and ALL my best friends are virgos... must be one (of the many!) reasons I’ve always enjoyed ur account!! I’ve done it from afar but I’m gonna make sure to turn on notifications now 😍🌈", "livinlavitamoka": "EV’YAN. You are a constant source of inspiration for us to be curious about and explore what’s coming up for us — no matter our fear — so that we can pursue and open ourselves up to the vast range of amazing possibilities we could have never imagined and would have not experienced if we didn’t take the baby steps to shed light on our truths. Thank you thank you thank you for sharing. It takes deep courage and trust in our desires/intuition so to be able to approach life in the way that you do. And also to share it so publicly. I hope you’re hanging in there during this time in your life and the collective, and I really look forward to hearing about all that you continue to discover 💗.", "softestrevolution": "just listened to the podcast episode and my gemini rising was living for all the tea but there were points where i cried listening to you, not because it was especially sad but because i was so happy to have an expander and example of a woman who had manifested love and freedom within that love to explore and know herself. you're both beautiful. thank you for sharing with us.", "casas.y.luna": "♥️ I was at that first workshop in LA, and you really showed us what it is like to feel liberated ... and now listening to this podcast episode, a year later, and to hear of your continual and gradual settling in to your self is AMAZING!!! Stan you so hard", "aavikdawson2": "Thank you for sharing. Will be listening ASAP! 💛 my husbands job forces us to be apart for long periods, and I am so excited to listen to your take on this. I’ve been needing a new perspective on how to both bond with him through those times, and honor time with myself in the context of our marriage.", "bloomingdream": "Thanks for sharing! I’m looking forward to listening. It’s so important to learn ALL the ways there are to be in relationship with our partners. The best way to bloom and grow is to feed with love, respect, communication, patience and positivity. Change isn’t something to be feared, it’s something to nurture. 🦋💖🦋", "alyssalaurahhh": "LA is seriously a magical place.", "alicechrs": "@louloudarabella ✨", "gialonzon": "💖💖💖", "leenoto_": "Hey sister, thanks for putting this out there. This one really caught my eye and my heart. I acknowledge you for being a pioneer on your own love journey. Your courage and truth is exactly what the world needs. ♥️", "maddisutor": "This gave me valuable insight for my soon-to-be long distance relationship! 💓", "justine_ke_era": "You are a such a blessing ❤️", "maryamajayi": "Love you so much 💖", "arielmstallings": "Living apart together can be such a tremendous blessing. ❤️ It even has a theme song: get down with LAT (yeah, you know me!). ❤️ Lots of love on navigating the transition ❤️❤️", "ashantidoll": "Looking forward to listening!", "scorbynw": "I’m so moved by your opening up about this. As I take big steps moving forward in my own relationship it gives me that sense of comfort to see relationship models that take all forms, with so many different kinds of healthy. ❤️", "rinnyriot": "You have the support of this Texan 🤠", "iambellarayne": "Right now I sleep in a different room than my partner ( my dominant)....when we move from here I will have my own place. We are still very much together but this separation and having my own space jas changed my life💕", "whitneyullom": "Looking forward to listening to you speak about this journey the two of you are navigating. Thank you for sharing it with us. 💗", "akeylalune": "Interestingly I know a couple others who are a couple yet live apart in different locations. It seems to work beautifully for them (of course there are challenges too, just like any relationship), and I’m so happy folks are choosing what works best for them rather than what we think we “should” do. Thank you for sharing!", "asoftknife": "Love this✨", "emiliaduncan": "I love this. There are so many different ways a relationship can look. & being able to shift and grow with someone while honoring your own needs and freedom- that’s beautiful ❤️", "nat_patt": "My boyfriend and I did this at the beginning of the year, as well. I’m looking forward to hearing about your experience. It has been difficult, yet rewarding for me.", "keren_castro": "Omg i’m Just running to hear you", "as_she_sways": "Me and my husband have been recently thinking of the living apart together situation as well. We’ve been together 10 years.", "daredevilbean": "I guess its just something people do to have more space . it does seem scary 😂 but I can't really say anything until I have my own experience :3 I guess its cool as long as everybody is happy :)", "aquariansoullife": "💜✨💜", "emlovecaster": "I just finished reading the transcript, it is VERY INSPIRING. thank you for sharing you story 💖", "09cmoncure": "My partner of 10 years and I decided to do this at the end of February. @letstalkenneagram It is such a tough and insanely liberating decision. I appreciate you sharing and am looking forward to listening to the podcast!!", "thibowhoa": "Do what works for y’all, support it 100%✊🏽👏🏽😁", "chiarahahahahah": "Thanks for opening up about this. Can’t wait to listen to the episode. 🔥", "lothedino": "Just finished listening. It was so enlightening. Best to you both during this time", "josephinespeaks7": "This is beautiful. I'll have to check out the podcast 🙏🏽💫", "pinky_in_love": "I believe having not just separate rooms, but separate homes - is super healthy for any relationships. We have to have our own spaces, to recharge and to recalibrate 💛🤘", "veeteegee": "The timeliness of this conversation is so affirming for me right now. Thank you.", "femmmeow": "Love you both so much and thank you for sharing with us 💖", "katrinamarieski": "♥️", "illumineyewithin": "Beautiful💜", "jessikakelly1111": "@brittxdarling @tashsoundfairy i haven't listened to this yet but am about to. Thought you may be interested in it 💓", "ellagracedenton\nVerified": "Verified", "evyan.whitney": "dang @jonathanmead, we take our best photos when we’re on vacation", "kristenkorvette": "Thank you so much for sharing this! I’ve been planning for such a shift soon in my own relationship 💖", "ericbgrey": "Love you two. ❤️❤️", "hardfemme_softbody": "Can’t wait to listen. I’m going through a very similar situation with my partner of 4 years. Thank you so much for sharing!! 💜💜"}