{"salem_afangideh": "My given name is princess salem. Salem for Peace and completion because my parents lost 2 full term pregnancies before me & learnt to be peaceful with my pregnancy. I hated being that my first name was princess because I got teased a lot in school as a kid. So I changed it to just salem. My parents say it Sah-lem although since being in the U.S lots of other people pronounce it salem (like the witch trials). Thanks for this question. 😁 I don’t know that I’ll ever go back to princess but now I recognize how fitting it was & own that part of my identity", "wholeheartlocal": "My name is Phoebe, pronounced 'Pho ay bay' (or Phoev ay, if you're my mom.) I've been a name champion my whole life, correcting adults as to the pronunciation from my baby carriage. I have always refused the pronunciation 'fee bee' --it's not my name as it was given. According to my parents, my name means 'free.' I was born on the nation's birthday and have always been a free-willed person, so I can say I was very aptly named. Because I'm a community worker, I have the name conversation several times a week, if not more. I've never minded setting people straight on it and have long found it odd when people don't fight for their names --I was an adult before I understood I was a unusual in this regard! I have the added oddity in that my first and surnames make people assume I am white, until they meet me. Many awkward conversations have ensued. 🙄I'm so glad for this name, however. Glad that my parents were a hippie & a revolutionary, respectively and into Afrocentric culture. I feel very, very lucky. And I'm glad that you've grown to appreciate your name as well (thanks for that pronunciation tutorial, I realize I was saying it wrong.) Thanks, too, for asking this question --and for the work you do. And for gracing our lives and this world with you hard won skills and many, many gifts.", "alda_mills": "Your name is beautiful, it fits you perfectly. My name is Alda. My middle name is Gay. Alda Gay. I did not have a name for about 3 months as my parents couldn't decide what I should be named. I have two birth certificates, the 1st being titled baby girl. Most pronounce my name All da instead of Al da. It's my grandmother's name. She passed before I got to meet her in person. It's a German name, but my heritage isn't German. I was told my middle name was given to me, because I was a happy baby. I can honestly say that I literally cried every day in 2016 due to processing grief. Can't say that was Gay at all. I am Gay. Alda Gay that is. 🌈", "baddalice": "Ashley! I hate it! It’s so common and I don’t resonate with it:/ no middle name either to fall back on lol", "laurelbirdsong": "My name is Laurel Birdsong. And I was the child of semi-hippies, definite Buddhists and reformed southerners. So no one has a “normal” name in my family. We have Zuri and Davida and Rock and Luella and Easter Lily and DeWitt and Oscar Dudley. I’m just the newest incarnation of that southern name culture. As a kid I felt like I had it easy. I had the easy hard name. I too was a name corrector- always wanting to pronounce others names correctly (like Phoebe above) because, although I had an easy odd name, I realized others had odd odd names. Here’s to growing into our names and listening closely to others when they tell us theirs!", "maddeehill": "mines madessyn (pronounced just like madison). my mom was getting her masters in education while pregnant, in a very boring class and just doodled out different versions until she found mine. I had a hard time growing up with it especially with substitutes etc who would insist on calling me things like madESS-un or medicine or made-SIN something of the likes. still confused as to how adults with masters degrees were so unable but I love my name now", "susetteyquinn": "I grew up Susette. NEVER shortened and it seemed so formal. And spelled oddly. As soon as I turned 18 I started having people call me Sue. I just went through a divorce-26 years- and Sue might have to go. She was plain and let herself get verbally beaten down. She hid herself from the world for so long she lost herself. Susette started a new job in Oct and she is so much stronger.", "alaiyowaistbeads": "my name is jasai. well my middle name is. I adopted it full time when I turned 18. it means Fire Of God.", "elleepiphany": "leandra epiphany. leandra means lioness in latin, and was always fine with me but i hated epiphany as a child because “it’s a word, not a name.” in college, my manager at limited too asked me about my middle name. i told her and said i hated it. she said, “i love it because it’s so you.” i had t realized that at the time, i was always having revelations. 🤦🏾‍♀️ it was perfect. my father later told me he named me that because he wanted me to have the inner strength of a lioness and to be like a light or revelation to everyone i met. now i think he did a great job.", "ul2mateivy": "My name is Jennifer. I'm used to being 1 of at least 3 jennifers wherever I go. I have always wanted something different/unique. In 4th grade I only answered to the name Genevieve. My momma was unimpressed. LOL", "juniperandthesea": "How are we just finding you?! 😍😍😍😍", "adancerintherain": "Haha! I became Dani (pronounced Danny) since I left school 14 years ago where I was either Dani (Dunny meaning outside toilet in Australia where I spent a gap year) and Daniela...looks like a beautiful name until people massacre it DUNNI-YELLLA or DUN-ELA. I cringe. The Italian pronunciation is /Dunyela/ .... my Italian side of the family call me that but most of the world know me as @dani.saporetti", "kangelblack": "My name is Atemi, wich means the goddess who brings you to the sun. I've always loved it, but oddly enough, people were always telling me that they liked my second name (Sandrine) better... Which has always been weird to me, as I always felt that this name didn't fit me 😅", "divine_energy_seeker": "My name is Ouida, pronounced Weeduh. My mom named me after someone she attended school with, she liked the name. I didn't like it when I was younger, but absolutely love it now and have for quite awhile. The derivation said old English but I never believed that and the oldest semblance of the name I could find is a slave port in Benin, West Africa. A city named Whydah, where French and Portuguese went for slaves. They changed the spelling to Ouidah. Now I need to go there.", "dipity_g": "My name is serendipity and you used it in this post ❤❤", "keolaa12": "My name is Keola, pronounced Kayola, traditionally a males name that means “the life” or just “life”. I was named by my great grandmother, my mom didn’t even have a choice in the matter lol and I wouldn’t have it any other way. I’m considered “Pacific Islander” and though I’ve spent my entire life in Texas, I’ve always had such a deep connection to my ohana because of my name. Marge knew exactly what she was doing when she gave me my name and I hope I can pass it on to my future children or grandchildren ☺️", "exrude": "Hi Ev'Yan! I've been getting to know your profile better and found this old post... Still thought I'll share my name story. My name is Katarzyna, and it's a very common name in Poland, where I'm from, especially among women of my generation. In Poland people tend to use diminutive versions of names, in this case mine was Kasia. It's a very sweet name and it was ok when I was called like that by my friends and family or when I was a young girl, but as I was getting older, I was not comfortable with this version. It felt like it's inappropriate for a stranger to call me that, since it felt too personal or too \"sweet\". I tried to figure out a different name for myself, but nothing really sticked, I guess polish people are very conservative about names... Whenever I was introducing myself as Katarzyna, people would assume straight away they could call me Kasia. It's in the culture I guess, but it was irritating, especially when I was way into my 20s. Then I moved abroad, and here nobody called me anything other then my real name. I started using \"Katarzyna\" or, to make it shorter, Kat. I love both of these versions and I use both of them. They feel really true to me :) Now, when somebody calls me Kasia, even within my family, it feels very strange, I don't identify with this name anymore. I know if I was living in Poland it wouldn't stick though, especially \"Kat\". It sounds too foreign.", "eleanorhadley": "So beautiful, Ev’Yan 💞 I totally hated my name growing up - I thought it was old fashioned and boring. But at some point I realised that it means ‘light’ and that felt so beautiful and affirming for me and now I love it ✨", "lyviacairo": "My name Lyvia (read Lee Vee Yah) was given to me by my mother. One of her sisters (whom she loved deeply and passed away young) was called Sylvia - so she thought about... Olivia... then removing the O... then replacing the I, and voilà ! Where I’m from there are a few Lyvias with this spelling (French Carribean) and nowhere else in the world have I seen this name. I used to correct people a lot with the spelling Lyvia not Livia or Livya, now it happens less. People tend to call me Olivia or Viviane and I just correct them. I truly love my name. I can feel the spirit of my ancestors in it 🥰", "_fleetwoodcam": "My first name ( Cameo ) has surprisingly made me the brunt of far more bullying than most of my friends realized. Even into adulthood it’s hard for me to accept it. Adults and children alike constantly misspelled and mispronounced it on purpose or on accident, even teachers and bosses at jobs. I still struggle to accept my name because of that and the trauma associated with my bio-parents. My first name is, sadly not after the way cooler (and far less pasty and uncoordinated) than me funk - pop band from the 80s/90s. Though learning about them has been a treat. I’m named after the cameo style of carved jewels that have silhouettes or angels on them typically. Personally, I’ve always hated all three of my names. And still struggle with it. But I’ve realized most of this is just a response to how I’ve been treated because of my name. Which is ironic considering most people I have bonded with over this experience have been different from me culturally/racially/ethnically and have far more beautiful significance for their names than I do - and very different and scarier traumas associated with their names oftentimes. I am glad my experiences have hopefully helped me be a good friend to them. My biological mom used to call me “CC”. Because my middle name is “Cherith” - the river in the Bible where Elijah was fed by the ravens. I’ve tried desperately much of my life to not tell people it but I’ve been learning to find the beauty in it one day at a time. I still go by CC and I like it but I’ve started taking it off school documents. Because I only did that to make things easier for other people and not be embarassed and humiliated or have to correct people. I dislike correcting people and the constant comments about my name. Even the compliments sometimes seem backhanded. But, in some ways I am like you. Learning to own my name and make it beautiful for me, make it truly mine. Me and my name against the world. Thank you for sharing this. It really helped me honestly. I know so few people who have unique names honestly, and it can be tough sometimes for sure. Loved the backstory on your name. Definitely has a beautiful ring to it and seems to fit you ❤️", "theblackswandiaries\nVerified": "Verified", "eroticren_aryn": "My given name is Arianna. It means most holy. I hated it but now I kind of dig it. I use Aryn for short!", "side_by_sadie": "My name is Sadie, after my great great grandmother. I never really like it but as I got older I felt like it suited me. Supposedly, the tradition on the maternal side of my family is to name the first girl of a generation Theda (gift from the gods), but my grandma, who named me, disliked her name so much growing up that she decided it was time for a change. 🤣", "ahdarhannah": "Hannah-my mum chose from the bible, I've taken the name not from religious point of view but my point of view that I am grace and meant for a great purpose. Ah Dar-my surname, considering not taking partner's surname because it sticks out like that sore thumb, I love to share that my great grandfather is from Hong Kong wanting to live in Samoa as he did government construction labour HK gov told him he needs to marry a Samoan woman and change his surname so it did not resemble a person of HK citizen. I love the richness in my dad's surname 😎", "makedapennycooke": "I have a long name, Makeda Pennycooke. Throw my middle name in there and it gets even longer, Tanisha. Been meaning to ask my Mom how long it took for me to learn to spell it ☺️ I was named after the Ethiopian Queen of Sheba. The name Makeda is more popular these day but growing up I was the only one and you can bet I never found a keychain with that name on it. For a long time I went by the nickname Penny (from my last name). But in grad school I reclaimed Makeda and now only go by that name. The mispronunciations and misspellings are always interesting but I’ve learned to live with it. Great thread. Thanks for sharing and asking the question", "tintinatundra": "I️ enjoy hearing that you appreciate your name now. My given name is Carlin and I️ have trouble embracing it. I️ find it awkward to say out loud, and always end up being called Carleen, Carla, Carly, Carmen, or anything but my name. I’m hoping I️ will one day embrace it but for now it’s not my favourite.", "idkkateiguess": "Your name has been my favorite since the first time I heard it back in the Apricot Tea days!! Such a lovely name name for such a lovely person 💖", "dreamchelle": "College I had a Black Lit professor pronounce it and tell me my family history. My Grandfather was one of the first black police officers in Memphis, TN. He is in our civil rights museum. I’m married now but I would correct you forever but I won’t give up that name. ❤️", "bu_radley": "Busang - it’s a Tswana name (South African language) that my dad gave me. I was born right at the end of Apartheid, a month before the first democratic elections, and so my name means to take something back, to reclaim. If you put it in a sentence, it can mean the people shall govern ✊🏾", "whitjoyful": "I love the story of your name and how it's connected to you being a writer. My first name is Whitney... also in honor of the late Whitney Houston... what a great coincidence 😊. My middle name is Joy after my godmother/aunt. I got joy tattooed on my wrist earlier this year to remind myself that I am full of joy.", "the_jaded_mum": "My name is Nothando, it means beloved or mother of all love. Growing up in have had my name and my second name Sijabulisiwe (we were made happy) mispronouced. I tend to just let people call me by my nickname 'notty' instead of trying to explain how to spell my name or pronounce it. Names are beautiful in their own right, as much as I love my full name many struggle to pronounce or spell it in the country in now live in.😊", "yourstrulybianca": "Named after Bianca Jagger. A total badass ✨", "incrdigab": "My mom named me Gabrielle Briana because it was what my father wanted his daughter to be named and she didn't mind. I don't have a relationship with my father so I've never gotten to find out the reason behind why he chose my name, but I do like it despite most teachers butchering it. TBH I've always felt a little disconnected from my name because I usually only go by a nickname, but I feel so grown these days using my full name. It's beautiful", "mylittlemplskitchen": "I’m loving reading all your beautiful names. I remember being envious of unique names when I was younger. I still am actually. As a Sarah I feel homogenous and totally separated from my heritage. Me and my husband because of our feelings of apathy towards our own generic names are choosing Gaelic names for our children ✨", "unclesweaters": "i love this post and all these comments! i also searched high and low for license plate keychains with my name on them! i struggled so much with my name as a kid - simone was rare back then, and my last name is long and hyphenated, which still confuses people to this day. when i was little, i desperately wanted to change my name to sarah smith. a fine name, but not for me. it's not surprising but a shame all the same that when we're young, so many of us want nothing more than to just blend in. our names are all so beautiful, the stories behind them, the elders who passed them down to us. i'm proud to be part of the army of folks leaning into what was given to us, even if it has taken us years to get here.", "curlynicky": "My first name is Nicole, which is one of the names that you listed above - haha! It has been a practical name since it's recognized in most languages but it was not considered a cool-girl name for my generation and where I grew up; it was considered more of an old lady name. 👵🏽💥", "gloriapoderosa": "My birth name is Gloria Delgadillo Alvarado, which is the same as my mother’s full married name. When I came to the US the government basically ended up both of our second last names in some legal documents. My mom assimilated into just Gloria Delgadillo and so did I. I hated my first name, I hated being named after my mom. I felt I couldn’t be my own person. It felt like my whole name was a joke especially after I found out my dad only dated women named Gloria’s .... ? When I became a naturalized citizen I found out that my name was in fact legally Gloria Delgadillo Alvarado but the problem was that no other documents had that name enlisted. So when they gave me an option to change my name I decided to once and for all drop my second last name — one of the biggest regrets of my life. As I got older I began to embrace Gloria — after healing some wounds and learning about all the amazing Gloria chingonas out there. I no longer see it as not being allowed to be my own person, I see it as I am the continuation of my ancestors dreams. I am them they are me and everything I do is to honor their spirit within me.", "shesoftheriver": "My name is Araceli. And i love my name. People always ask me if i have a nickname. Which i do, from my family. But when i hear that name it carries with it the love of people who care about me, and i wouldn’t gift it to someone who just wanted to put less effort in knowing me.", "rosebeforehoes": "Rosalyn Colleen, pronounced rose-a-lyn. Named after both grandmothers. Hated it as a child because of how feminine it is (I’ve identified as queer since 4). Often mispronounced & people haven’t believed me when I tell them my name based on my appearance (identify as female, but appear very masc). It’s definitely an interesting experience trying to convince someone that your name is actually is your name", "fiafriskie": "Thank you for this. What a beautiful, personal journey, and one that I can relate to. I am still on that journey. My name is Luthfia, names after my beautiful and courageous aunt. I don't know anyone with that name besides us and it gives us a special bond. Unfortunately, we both go by nicknames (Fia and Lulu) because this racist and normative culture made us ashamed of our beautiful ethnicity. I've tried to get people to call me by my full name but I usually just give up and tell them to call me by my nickname because it's easier. I hope one day I can get to the point where I am comfortable making people call me by my original and true name like you 💕 Thanks again for sharing.", "withemilyrose": "My name is Emily Rose and people lose their goddamn minds because there’s no hyphen but a space! And a capital letter! How could they POSSIBLY know to say “Emily Rose” when I dare to spell it like that. Especially when I introduce myself by saying “Hi, I’m Emily Rose.” Is that your last name? Is that your middle name? Is that your REAL name? Exhausting. Just say the damn thing.", "doublesidedmind": "U r so beautiful inside n out n it’s making me tear up lol", "christieredwards": "My name is Christie, as in Christie Love an old detective show featuring a black woman. It was one of the first shows with a black woman as the main character in the 70s.", "insatiable_sam": "My name is Meliseta. I can't remember ever hating my name, BUT I remember at a very early age hating the name Melissa. Most people look at the first few letters of my name and assume that it's Melissa instead of reading the whole damn thing. I love my unique name because I have never heard anyone else with it. I've also grown to dislike common names. That's why my son's name begins with the letter Z. When I meet new people and that want to shorten my name to Mel (I think is so damn rude and disrespectful to not take the time to learn and pronounce someone's name properly), I tell them straight up, \"NO, that is not my name!\" Once, this older white lady that I saw once a week for over a year looked me in the face and told me, \"I can't bother learning it, so I'm just going to call you Mel.\" I had to tell her, \"NO, learn it!\" And broke it down, again, syllable by syllable for her behine. I was so offended and hurt! I love my name so much that I don't use it online and I rarely post it, because I don't want anyone stealing it...LOL", "ajavines": "My parents named me Aja (pronounced Asia) after their favorite Steely Dan song and album. Growing up, I totally despised my name. Similarly to you, I felt like it othered me; I was already different looking than all of my friends and most of my peers, and the last thing I wanted was this name, which seemed to highlight and magnify all of the other differences about me. In my late twenties I started embracing all of the things I loathed about myself (my natural hair, my body, and my name), and now that I’m in my 30s I feel like I have stepped into all of the power and beauty of my uniqueness. I cannot imagine existing on this planet (or any other one for that matter) with any other name. Damn proud to be Aja Vines.", "laraeawakened": "La Rae - \"how do you spell it?\" \"L-a-capital R-a-e\" \"oh that's pretty.\" Also sometimes called Larry, Leroy, lu-ray.", "itsjiyounkim": "Thank you for sharing this. My Korean name is pronounced \"Ji Yeon\" but my parents spelled it as \"Ji Youn\" when we immigrated to Canada when I was 5 (because it made sense to my dad + his one American friend). But of course everyone calls it \"Ji Yoon.\" When I was 7, I thought my name sounded too Asian so I changed the pronunciation of it to \"Ji Yan\" to make it sound more English, while keeping the spelling. So I've been going through times when I would just spell it as \"G-Anne\" or just go by \"Ji\". I've decided that I no longer want to get an \"English\" name because I admire the beauty of the original meaning (beautiful-hearted purpose). But I still go by \"Ji Yan\" for pronunciation, though I am starting to feel uncomfortable by the white washing. Currently unlearning internalized racism + white supremacy. We'll see where I go from here.", "yael.borensztein": "This resonates so much with me! Growing up I dreamt of easier, simpler names. Now I’m head over heels for my name- Yael. I believe people’s willingness to learn it and say it correctly (to *my* liking) earns my respect and shows that they care about who i am, really. I’ve found that people who are lazy or dismissive of it are harder to trust with my time and energy. I love standing strong in my name. Thank you for verbalizing something I feel so deeply!", "tishushu": "My name is Tishana. The only story my mom had about my name is that she heard it a couple of weeks before I was born. I never felt othered by my name because almost every young woman in my area share a similar sounding name. My irritation was when ppl misspelled my name... I’ve always corrected ppl about it, without fail. But because of my irritation with other ppls inability to spell my name, I have my two children simple four letter names. It wasn’t until I was on the internet that I wanted to know more about it. There was a woman on AOL with almost my same email address, but she didn’t know what our name meant either. Then I saw that it’s a sub tribe of ppl in Ethiopia, and that sub tribe was once leaders in commerce in the area.", "you.are.a.wonder": "I was also named after Whitney Houston. My mother asked my then 9-year-old sister what she wanted my name to be and my sister replied enthusiastically, “Whitney Houston!” And there it is.", "extracelestial": "love this so much, ev'yan. i remember feeling sad going to stores with names on keychains and license plates, knowing i'd never be included even though my name isn't even that unique. i remember wishing i had a nickname, to feel white and blend in with the rebeccas and lindsays (which is hilarious because céleste is a french name). my mom told me that she wanted to call me jessica or emily jane but my dad insisted on celeste. my name means \"heavenly night.\" i grew up without him, but am thankful he stayed with me in this one small way.", "toranmcgill": "Beautiful share. Thank you. And my name story reflects the same. Being othered. Ok it goes like this. My Aunt named me and for a long time the story was she made it up. Plausible I have that kind of family. And once when I asked her since she made it up what does it mean and she said little wildflower. Now fast forward years and I was telling that story to friends and they said oh no there are lots of Torans. So with internet access - keys to the world. I discovered my name is Gaelic and it means Chief and in Hindu it means sacred passageway/doorway. But now as I stand gratefully in my name, I danced for my class and someone asked me what was my erotic creatures name (often other names are given/earned - like Sasha Fierce) and I was able to say boldly and proudly. Toran. Owning both my sexy, sexuality, sensuality, body and dance.", "lulu_anna": "My name is Luīze but I've switched to Lulu ever since I left my home country. I'm always conflicted because I love how beautiful my name is and I'm not interested in making life easier for Americans who can't be bothered to learn the correct pronunciation. However, I find that even if I insist on Luīze, most people won't actually try to pronounce it right and I don't wanna hear it butchered either.. so as for now I go by Lulu.", "drswetachawla": "A very similar story. My name is Sweta (Sweth-ah) and my mom named me after a character in a book. Shweta is a common Indian name but at that time without the h wasn't. I grew up in Nj in a totally Hispanic neighborhood and everyone called me sweet-ah. When I moved at 16 I finally had Indian Friends but they still called me Sweet-ah. When I got to college I insisted on correcting people. Im quite anal about the pronunciation of my name now and it wasn't till recently that I realized how much being \"mis-pronounced\"'effects your identity. I came to America when I was 2 and my family in Indian treated me as an American where people here in the states saw me as a foreigner. Reclaiming my name was an unconscious act of reclaiming my identity.", "daephine_": "Denise, named after Denise Huxtable :)"}