{"innyvinny": "🙌🏾🙌🏾🙌🏾", "winomena": "Loved this post - so affirming and sincere.", "liv.sulerud": "Wow. You speak so much truth to my experience and the unspoken experience of women. Thank you. 💗", "resilience.ink": "👍👌💕", "daughteroftheelements": "I'm really loving your podcast! The poly one was especially excellent. Thank you for your work 💕", "wittknee_": "I'm in love with this woman!!! @_eirelav", "_eirelav": "Wow this is amazing!!! @wittknee_", "bridgetbadore": "YES", "quabitty_assurance": "I love wearing my skimpy summer camis in the house or to the store. I don't care if anyone looks, I actually like it. Sometimes I do it for me, sometimes I expect my husband to become aroused by the visual. Whether he does or doesn't, is not my business. In at the end of the day, I look back at how sexy and happy I felt at feeling free. And I'm not 25 anymore-40 actually. I totally identify with your emotions in this photo. I think I know exactly how you feel!", "kdelriego": "Amen! I always felt embarrassed if my nipples shown thru my clothes, this empowers me to rethink that important anatomy. Thank you, your podcasts is changing my life 🙌🏾✨💕", "tacokat42": "Rock it! I think we should all burn our bras again!! Underwire is just bad for the body.", "allyssamilan": "I love & thank you. Yes. A body is a body. A vessel for this life experience. You inspire me. You empower me to be more fully embodied. Thank you 🙏🏽❤️🙏🏽", "jacks.artistic.photo": "Stay strong, and beautiful", "the.grateful.dee": "Truly", "britthoffman_": "@cria_pet @wellbridgette you guyyyyys need this account 🙏🏻🙏🏻🙏🏻", "_thisnaturalbeauty_": "@amorous88 @thatdamnred_ @alyssadri", "wiley_coyote89": "Yes, yes and more YES!!! Totally identify with this!!!💕", "malviiinou": "👏👏👏👏👏", "cuore_amanda": "Thank you. This resonates deeply 😢💘", "gurlieboo": "I love her..follow her page @pizzakaterina", "romanianinvasion": "The answer must be reeducating ourselves and our sons and daughters by redefining things right?", "stanikomania": "👏👏👏💗", "katrini1974": "Oh my goodness. I am just... lost for words at the way you were taught, & I'm so sorry! Women are no more responsible to make sure their nipples don't \"show\" 🤮 than men are that their \"package\" isn't visible. As a a woman of faith, I want to apologize to you that you were shamed in that way. ❤️ Yes, people might be turned on by that, but that's not... bad, or shameful, or even any of your business, unless you want it to be! ❤️❤️❤️ Nipples are nice. And exciting. And also no big deal. (Actually, I'm getting a little turned on just thinking about it! Whew! 😂) I love that I've just discovered you!!! Bless you! 🥰", "simone_landrum": "Lօօҡs ɢօօɖ tօ ʍe", "rebeccatheflorist": "I feel this!", "junimondig": "This speaks to me sooo much. I've been there and felt this. It is a challenge but we will grow 💖", "addisonfhenc": "Most important post I'll see all week. Thank you for your strength and vulnerability.", "sheeana__": "I love this! I have been on the no bra band wagon for 2 years now and have finally come to the liberating feeling of people seeing my nipples and absolutely not caring. Being free and careless and loving the feeling of my breasts not being confined by bras that actually hurt me 🙌❤️ sending light and love @evyan.whitney", "bouzsani": "My bra is on limited use.. Big breasted and all.", "unstuckproject": "Yep yep @mayrayjane I still struggle with this all the time. Plus totally echoes our cabin convo.", "kellspark": "love this", "irishsweetie30": "You are beautiful all women are beautiful. Free the nipple! I dont hide mine behind padding anymore. Its the sexiest more natural part.", "thisbretthall": "Preach!", "mrsstins": "Love! I've stopped wearing padded bras or underwires and have been finding such beautiful acceptance in my breasts just as they are. If someone is offended by my nipples, please feel free to look elsewhere! Breastfeeding changed my whole perspective 💕", "tuckermama": "I've got to add my voice to this conversation - yes! I get you and you and you! I'm right there with you all. The other day I was feeling inspired to go natural and did - until I had to leave the house. And then couldn't. Put that bra back on to make everyone else feel comfortable. It's a process and I'm still working on loving me and not listening to what I assume others think. Keep talking ladies. Keep this conversation going. It's going to change things - it's gonna change me and you.", "iamkimshee": "I too relate to this...& I came to this post just as I was planning to tame my own \"wild nipples\" (as they've been called before) for today's outfit. Your words inspire me to keep breaking down these thought processes. Free the nipple, indeed...thank you ✨😊", "evyan.whitney": "hey, @jonathanmead - #uncagednipples maybe? 😜😘", "__l_ena___": "❤️", "its_botany": "@theunstuckproject are you familiar with this divine woman? This post resonates with me and I think it would with you too.", "jasmineklee.jpg": "💖", "wisemadison": "thank you for teaching", "chandrakamaria": "I TOTALLY understand! Fully & completely!!", "barefootandplanking": "YES sister. Just today I wore a thin shirt no bra into a chilly grocery store... At first I kept crossing my arms, self conscious even though I go braless more and more these days, then thought FUCKIT and just let them jiggle around, nipples everywhere. It's my body and it's not offensive!!! ✨", "weeds_and_wonder": "🙌🏻💓🙌🏻", "dashboardc": "Stupid religion. I can totally relate.", "taylorgracearmstrong": "I so so so relate to this 🙏🏼", "caitzen": "i resonate. ❤️", "_efspl_": "oh yes. I have no problem with my body...but I worry about others consuming it in ways I don't intend."}