{"michellemdurand": "Beautiful post! Sending much healing, peace and love. The lessons are priceless. Thank you for sharing to help others! 🙏❤️🙏", "kem.contemporarywild": "❤️❤️❤️", "msnicolejones": "Sorry for your loss. Thank you for sharing your perspective.", "wildflowersex": "Sending you so much love. Give yourself space to feel all the feels ❤️", "christa.robb": "So much resonance with this as i just lost my grandpa in april😔😭 im so sad and feeling a little lost with this very situation- lack of communication and connection, regardless the reasons. The distance makes it hard but the habitual superficial focus is even more so, and im lost in fixing this tear between connections. Both my grandmothers are still alive but are so far away from me it hurts. I appreciate your honestly and transparency, im so very sorry and thank you- Much love to you sister💖🙏", "missorian": "Sending you all my love!", "creativecalantha": "@mtayyylor let’s talk about this ❤️", "journeywithlove": "Beautiful sentiments.", "layasland": "Sending you love sis and I’m here if you need anything ❤️", "enbrightened": "Thank you so, so much. Both of my grandmothers passed more than a decade ago, but I struggle on days with my practical estrangement from most of my family. And my husband from his. ❤", "ashangrila": "❤️❤️❤️❤️", "shayladtumbling": "Sending you ❤. Grief is a complicated experience and Ancestral work is beautiful.", "gabalexa": "So sorry for your loss! Grief is so hard but sending you all of the love in the world.", "woman1sh_intuition": "My condolences for your loss and please, Be kind to yourself (as you continue to reflect and learn)❤️", "deadlifts_and_redlips": "❤️❤️❤️", "alannaheavenly": "My condolences ❤️", "alexiaarthurs": "I relate to this so much. Hugs Xxx", "voodoo.masochist": "🌻inspirational", "happybodymind": "❤️", "katienumi": "huge hugs. what a beautiful way to honour her.", "sixdayz_riq": "🤙🏾", "alicelucidreams": "❤️", "inmyevolution": "❤️", "harlemlighthouse": "rest in peace. i’m so sorry + thank you for sharing your vulnerability with us. may i share your process on my page?", "katalyn_k": "I'm so sorry for your lost and your pain. Thank you so much for sharing this--it resonates with me very deeply. ❤️❤️❤️", "__fairylily": "🌷🙏🏻", "bigblackpants": "This touched me...hugs to u", "selfalchemy": "So sorry for your loss ❤️", "milktea_inc": "Thank you so much for this. My grandmother was 92 when she passed this Spring. She was a big part of my childhood but after moving to the US and becoming an adult I too lost consistent touch with her. Nevertheless she is an admirable figure of strength and compassion but I equal parts grieve her death as I do the relationship we could have cultivated.", "katisha2": "Wow ! This resonated with me beyond measure, my grandma has been told she hasn’t got long and we are and always has been slightly distant 😢 it’s definitely time to reconnect, thank you 😊🙏🏿", "the_dreaded_gypsy_": "Resonate with this so much! I've been estranged from pretty much all of my family for a very long time now and I also find it hard to keep those bonds forged. Starting with my mother. Thankyou for sharing you heart so openly and allowing space for others to connect and share honestly with you.. My humble respects to you and your family 🙏💚🌿", "thisisyoursacredspace": "I’m so sorry for your loss Ev’Yan. Mine passed two months ago as I was returning to Portugal and I now understand how much death can affect us. I love you’re choosing to honor her and your own grief and process. Sending you love ❤️", "bcdiamante": "Thank you - I see you too x", "misshappyfluff": "This resonated with me so much. So sorry for your loss. Sending love.", "michellewhitmer": "I hear you. I see you. This message helped me feel seen in my grief. Thank you.", "kaylashanai": "Love to you ❤️", "daethehuman": "Sending my love to you, all that you need", "kristenkorvette": "Felt a lot of this when my own grandmother died. Sending you much 💖", "arielleloren": "❤️", "the.crown.fix": "Sorry for your lost ✨", "marcialsart": "I’m sorry for you loss 💜💜💜 just by remembering here she will always be there with you #ancestors", "itsjujubae": "Beautiful", "inbalsansani": "So much love to you.", "iosonosol": "Thank you so much for sharing this, it's something that's truly been on my mind recently and it means a lot to be seen. I'm with you, and I'm sorry for your loss 💞", "es.lapotra": "Thank you for being so open & honest, sending you love & peace 🧡", "jasmynelliott": "I’ll be holding space for you 🙏🏽", "tishushu": "♥️ yes.", "fatfemmeskillingit": "And I know through all of this, your grandmother loves you fiercely.", "writerontheradio": "I also have an ancestral altar. Keeps me connected", "thecolorgolden": "Thank you for this. 🥀🍂🌹", "glitterinthedirt": "I think about this often. Estranged relations and what I might regret. Thank you for sharing & I wish you healing and peace.", "redfoxren": "I resonate so much w this. I see you. Thank you for sharing 💕", "eyeofshamia": "Wow yes. Thank you thank you. ❤️", "monisayz": "I get this and respect it. We work to protect Self. She will always be a foremother.", "erynamelism": "Sending you so@much warmth. My grandma transitioned earlier last month and it has sent me on some fierceidentity profiling.", "angelicakoi": "Thank you for sharing. Sending you light and strength", "the.runawaybride": "😭 sending love.... I lost my Holy Mother on the 13th 🙏"}