{"shysiren": "Powerful caption, following by your powerful comment (1st one). GREAT Respect to you ❤️💕", "wildandvibrant": "💋👑💋", "justsarahphd": "I wrote a very long thank you for this challenge, and then accidentally fucking deleted it. Anyway, I don’t feel able to participate - too vulnerable personally - so I am loving following the hashtag. So amazing to see women sharing their own intimate world. Damn my other post was poetic & shit, but in lieu of all that - a simple thank you must do for now. You rock 💕", "corinne.kai": "@walkingintospiderwebs", "petitmomlife": "Fyah 🔥🔥🔥", "ashlee_heals_as_she_heals": "Amazingness goddess of radiant gleam and bursting suns ☀", "nashaification": "Thank you so much for doing this and sharing this journey. 🙏🏽 Let your light continue to shine. 💕 For I really want to partake but forgot about the starting date 🙃 nonetheless, glad it’s happening. Continue strong and inspire others 🤘🏽", "thatgirlgolden": "So on it", "carterjville": "Congrats on starting a powerful wave. Blessings flowing.", "itzmeyagirl": "Did you send out day 3 affirmations?? I haven’t gotten anything in my inbox today:(", "babiaca": "@janine.leagh.alchemy @curlyboncered I can see you two being up for this challenge!", "deleted.c.bro": "Love this!!", "long_jaw": "@chantelleawhina", "lind_cee": "Where is the mirror from?", "seitzlucas": "@cloftus67", "mycoachrachel": "@carlysin this is who I was telling you about💕", "johan.nordkvist": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️😘😘😘😘", "mikusek.coach": "❤️🌹 Piękna ❤️🌹", "mycurltokeep": "@ilivebare", "ryder11969": "🔥🔥", "zoliteffenhardt": "👌👍💘❤💖💋💋😉💋😍💘", "ayardhanji": "Sexy", "buckinhell666": "You are one of the most incredible stunning sexy fit gorgeous lady 🌹", "miyazinn": "@ghosthouse3000", "chefwokybalboa": "I'm so glad you started this challenge", "pizza.hat.guy": "Thank you endlessly for this space. Take care of you first! 🧡", "jamaalanddacota": "This is beautiful! Proud 🙌🏾 Although I thought everyday was sensual selfie day...🙏🏾", "jamalthelight": "Hi would you like to pose for a drawing?", "justinemariemodel": "😍😍😍👌🏼 love that ideaaaaa", "lyviacairo": "@thejessicajohansen join with me ? ;-)", "vanessalamorte": "@lexalexa0 @emmstergram_ @briiis", "rubygardenia": "@lilherbielover", "thesoftware_guy": "Dope", "fineartforbodies": "This is beautiful :)", "wendy4wellness": "How can we still enter.... The link in thr bio is not working 😞", "eduardohenajordan": "❤️que rixo", "themobayer": "@pole.dance.play this might be up your ally!", "mx.jvn": "@imlyv check this out!", "astraya.ray.starlight": "🙏", "stephcomfort.jpg": "All I can say is thank you for doing you ❤", "dmonae19": "We thank you for creating this platform for us beauties! I feel so free, inspired, loved, and FIERCE. Thanks to ALL the courageous, powerful, sensual, sexy ladies doing this challenge. ✨🌹❤️", "mariaceciliapozo_coach": "Inspiring!", "heldinea": "I just signed up! Excited/nervous to take a pic when I get home. 😊", "indiaffinity": "Omg looking at everyone words and pictures 😭 you manifested something amazing @evyan.whitney 🙏", "uniqueyorker777": "Beautiful ! Yesss 🙌🏽🙌🏽💜💜I hope mine counts 🤞🏽", "borikenphoenix12": "Thank you for this challenge. I almost didn’t do it for so many personal and public reasons. You gave me a match and I’m honored to light the fire up alongside you", "janashareswithyou": "I love perusing the hashtag for other people’s posts! So much great, beautiful, creative and lovely content! I never cared to check what people were posting the last time, because I wasn’t participating. I wish I had. It’s beautiful to see so many people bravely put themselves out there regardless of what their physicality looks like ♥️ I sure found it to be difficult to show skin on a public forum, so I opted for a more modest approach to the challenge (for now). However, major props to all the nudes out there 👌🏻", "carrie.elizabeth.stiles": "Yasss! Just read your mantra on being sex-positive and how repressed the sacred sex jargon is. Love it. My vibe. Thank you!", "rachelhollandstudio": "@ollie.wylde", "sassi_cassi_whole30_fbg": "I didn’t get my email for today and I signed up yesterday? Please take your time in responding! I know you’re busy. Thanks! 😘", "_mal.pal": "Inspiring women/femmes all over the world! Love this challenge already and it's day 1 💞", "awabeads": "Can we still participate if we havent signed up? Also please check your DM 🙈 @evyan.whitney", "gold_dust_femme": "Thank youuuu for this amazingly magical space container you have created for us💗take good care of yourself💗💗💋💋", "goddesssteph92": "Omg I already cry over my pictures I took I feel so beautiful and the most important I FEEL LIKE A Goddesses and queen and I feel sooo sensual that I got horny with my own selfie lol I think I am sooo hot and sexy thank you for making this healing space for us Whitney I cannot thanks you enough I I love u for this u are a beautiful being and I hope u have nice day today 💖💖💖", "slut4emotion": "@bethalicedobson", "ladyjaydiamond": "Goddess bless.. allow the blooming. And thankyou 🙏🏼", "risaexpizza": "@jamie_thrower 😍😍", "tehfraga": "I hope to take this class/workshop with you one day!!", "i_am_leid": "Dear and beautiful @evyan.whitney , thank you so much for hosting this. It’s more powerful than I thought. I felt dead from the inside all day. I had to challenge myself to take the pic and post it (2 challenges) but I feel alive now again !! Thank you!! 🙏🏻 May I ask you an important question? Why, in your opinion do you think it’s so important for women to reclaim their sensuality? And take in their space? And being sexually awakened? I’d love to hear your thoughts about it. I understand if you don’t wanna answer here and now. I read about your boundaries and you’re being a beautiful example for us in this as a sensitive woman. Perhaps a video or live video might be a good medium so that other women can also benefit from this. ❤️🌸 Sending you my love.. bless you. 🌸🙏🏻🌸", "flowwithfrick": "@nik.villegas ummmmm yes", "thesarahsilvas": "I absolutely love this", "mollonwarriorprincess": "Thank you so much for this challenge!!", "brokenfix3r": "Just walking around doing chores naked, like...", "jeevansingh.co": "🙌🏽", "blackgirlmagik": "congrats!🎉", "theheartadvocate": "I will be posting my pic later. Geeked! You are stunning as always sis! Love this", "beautifully_devine": "😍😍😍 I love EVERYTHING about this", "aystamosdef": "fearless!!! 🙏", "toriilechelle": "#sensualseptember", "raquel_vargas_1015": "I did it and I feel amazing", "brown_chick_lexi": "Yasss complexion cometh thru!!!!", "hotghoulsummer": "It feels so damn good to bask in so much beauty!! This challenge has restored my faith in humanity", "erin_barrio": "So appreciative of you and this challenge! Thank you!", "awharty": "The pics in the tag are absolutely stunning! Go Queeens GO! 😍💖", "teresainconfesa": "This challenge is beyond amazing. The love and awesomeness emanating from my phone right now are unbelievable. Take good care of yourself ♥️", "rachwildflower": "@lovenicoletherese 🌻🌿🔥", "moonchild19911": "Loving it. ❤", "tess.ellationz": "💕✨💕✨💕", "menina_ekinerom": "Go queren!!! Just beautiful", "minaminers": "I’m scrolling through them and they are so lovely to witness.", "bayyylove": "Glowing✨", "fenyxthegod": "💜💜💜💜💜🔥🔥🔥🔥🔥", "evyan.whitney": "hey! wanted to give a few updates about the #sensualselfiechallenge:  1. If you joined the challenge on or after 9/5, you will not receive the prompts that were published before you joined. That’s because the challenge is live and I am unable to resend . You will receive the next prompts bright and early tomorrow morning—around 3:00am PST.  2. If you want to do the prompts you missed, please look through our hashtag: #sensualselfiechallenge. There are clues about what the prompts are in people’s captions.  3. This challenge has grown much bigger than I intended/imagined; there are literally 2,500+ of you taking it right now—which is incredible but also very overwhelming for a highly sensitive empath like me. During the last challenge, I was able to view and like/comment on almost every post. This time that would be next to impossible. But know that even if I’m not commenting/liking, I am seeing every single photo you are putting out and doing my best not to cry my eyes out because you’re so beautiful. 4. Lastly, I just want to mention that there’s no team helping me manage this challenge—no assistants or customer service folks or even interns. It’s just me and my little laptop. I mention this so that you know understand how challenging it is for me to respond to each message and question right now, specifically because I have other work/projects that needs my attention—my clients specifically. So if you’ve got a question, please be patient with me as it might take a moment before I respond. And if you do have a question, please don’t DM me, send me an email (link in bio). I love you. Thank you for helping me practice healthy boundaries that are gonna help keep me sane over the next five days.", "mouskawitz066": "✊❤💕", "foothillshippie": "This is sooo much bigger and impactful than I thought, thank you for sharing this with all of us", "unorthobak": "🔮", "onyxlilli": "I missed the date!! Please please do this again maybe in 2 or 3 months??? Can’t wait to see the beauty unravel and this body love appreciation expand!", "donna_jett": "@dyardzz I love her IG. Can I have one like this?"}