{"wifeofwives": "Love. This.", "skiing_jewels": "Very interesting. I've never thought about how much many parts of the body are oversexualized. Thank you, opening my mind 🙏", "idreamofy0gini": "This is beautiful and very true. Adina rivers has an amazing instructional video on YouTube called \"How to Give A Pussy Massage\" teaching men how to touch a woman there without making her feel like it has to lead to anything, which puts a lot of pressure on a woman and also on that part of her body. I know I have often shyed away from touch because it feels more like a demand than a gift.", "katienumi": "will try this for sure. thanks❤️", "_bex23": "Hm. Interesting. 💞", "cecily__parsley": "Can you tell me why I would want to desexualize my vagina? Honest question.", "tantrictoybox": "❤️ this! Thank you for the super important self love posts you so often share.🙏", "thesexissue": "Love this so much 😭💗", "skinnyawkward": "The first time you posted this, it genuinely changed my life. I have a chronic pain disorder that often affects my vagina, as well as some sexual trauma- subsequently i had developed a really negative relationship with it. This made me aware of something I had never even considered! I talked about it with my partner and I’ve been working to heal that relationship. Thank you!! 💕", "naturalmagics": "Love that there's finally safe space to talk about this! I've been advocating for non-sexual relationships with our vulvas/vaginas to my friends for a long time and it's beautiful to witness the message in a more visible space!! Thank you for your work and wisdom, Evyan! 🌹", "envision_in_3d": "I love it! 💜 It deserves simply love attention 💜", "the_vibrant_hak": "such a great point, i love resting my hand on my pubic bone or even stroking my hair. it feels natural by myself, but i feel like others would be uncomfortable if i did it around them. although men rest their hands on or even outright grab their genitals & in public, too!", "sanity.jpg": "✨ yes!!!! beautiful words! thank you!!!!", "sy_urri": "All the time ❤", "deblowd": "When I started tracking my monthly cycle I got really used to touching myself and paying closer attention.", "therayndear": "I thankfully practice this on a regular basis, it is so relaxing to touch with no sexual intent behind it, especially before bed. Thank you for encouraging others to do the same!", "puntogspot": "Hermosa🙌", "deva_style": "Can I just say you have a beautiful hand! 🌻🌻🌻🌻", "kaitliniversen": "🙌 I love this post! 👏 I agree and think this is both an interesting and an important topic! For us females, but also for our partners to look at and understand too!! 👌", "rileslovesyall": "I love love love this, thank you for sharing this message 💜", "sarastibitz": "Wow this is so oddly radical to me. Thank you for posting. 🙏", "superwennifer": "Ohmygoodness...I love this post so much. I don’t have enough hearts! 😍😍😍 this practice challenges and terrifies me...so much of shame/sexuality/violation/trauma is associated with my vagina I don’t even know where to begin. But thank you for doing this. Instagram better not remove! 🤬", "matwalker8": "Chooselovewellness.com", "madwickbags": "I love this 🌸", "xianbass": "Most nights, I gently cup my hand over Her fuzzy warmth to say goodnight!", "daleyn": "@trapmystic this was the account I was trying to remember last night", "l.c.lewis": "My partner does this all the time. I used to jump because I’m used to doing it myself without any sexual thoughts, but now I’m comfortable with it.", "elizabethdialto": "Ahhh!!! I started doing this instinctively after some serious womb healing last year but never gave it language. This is perfect, thank you 🙏🏽", "carlieklatt": "Worrrrds 💓 @michelleklattphotography @hunterpickering @samarastenson @lindy_brookbank @marasuchy32 @taylorturner96 @celeste__favreau", "serenity_skye": "I massage my vagina and the surrounding area frequently. And even have my partner do it for me here and there as well. Non sexual, just as you would massage shoulders, back, etc. because it feels nice, relaxing, and rejuvenating. I also massage his pelvic area and penis in the same fashion. It feels nice, and loving, and respectful. It’s nice to do for myself, but there is something special about my partner seeing my body, and I his body, beyond sexual, with love and care, and respect.", "rivhasdystonia": "When going to sleep, after I snuggle into bed, I can't get completely comfy without holding my vulva. It's so soothing! 💙", "ivianabynum": "I love this and it definitely encourages me. And I need to know- where’d you get your undies?! Love them they look so comfy!", "disabledspice": "Your words are just so healing. Thank you💟", "barberboutique71": "Yes meow! Show love to the pretty kitty ❤️", "yogithatwantsthesmoke": "When I was scratching my pubes lmao", "aylaadance": "@jess__henderson this is so beautiful", "yasmine083": "I love this! We do forget to love our hidden gems. Thank you 🙏🏼 for sharing ❤️", "ellemestrada": "@lauraschrope", "wildandvibrant": "Yes!!! This is what I do with my shadow oil daily. I created the oil for this purpose. Beautiful words.", "noireboss1": "💯percent necessary. Especially so we can learn to appreciate platonic touch in every area of the body. The healing expands !❤️💯", "thehomiegmomma": "I do this all the time!!! It’s comforting.", "_._empress": "Love this message.", "pocketworthylife": "Your nails are so pretty.", "womanlyours": "You are a gem. Very inspiring. And your texts just lift my mind and my spirit up. 💞", "j.adamsillustration": "@tea_drinking_fox", "hernameis_victoria": "@loki_the_stargazer ❤️❤️❤️", "josiehoupt": "Thank you for this post 🙏 #healing", "creative_chancey": "🙏⚕️thank you goddess! Just the reminders I needed!🤗💕", "evyan.whitney": "& if you wanna hear more about this—I talk about all of this & share a practice I give my own clients who are wanting to have a desexualized, healing relationship with their vaginas in episode 28 of my podcast, #thesexuallyliberatedwoman. link in bio to go to it, or search for it in #applepodcasts or #spotify.", "chrissy.claire": "Very often, especially when laying down and reading. Its comforting cupping my hand there and just holding 💕", "love.lorelai": "I remember us talking about how I’d try to get my friends to understand this platonic relationship we can have with the sexual parts of our body. I love to just rub my bum or massage myself with the intention pure love, and appreciation and it helps me just feel comfortable and connected to myself ❤️", "ayostephyjoe": "All the time. It’s probably sick of my shit. 🤣🤣🤣 especially while watching tv. It’s def non sexual. Kinda like playing with my earlobe during an intense movie scene.", "1920snapbackz": "This was SO timely for me! Love it 😍", "jennifersacoria": "💕 it", "amy.is.peachy": "I love this thank you ❤", "farrahinlove": "I’ve been doing this since I was a child, unknowingly!", "mama.renay": "Thank you so much for sharing this 👌", "trans__mutation": "I LOVE when my partners rest their hand on my vulva in such a casual, non-sexual way when we're laying in bed. It feels so safe", "anewfoundjess": "Need to do this more often for sure! Thank you for posting this!! 💛", "cassandra.ede": "Every day. Thank you for reminding me how important this is.", "courtney_coaches": "💓💓💓"}