{"aprilclarkyoga": "@lahiidi", "lahneeland": "❤️🙌❤️🙌❤️🙌", "thecattownmurders": "YESSSSSSSS", "cummanifesto": "❤️❤️❤️❤️", "raquelthebaglady": "Yes thank you!!!!", "theblackswandiaries\nVerified": "Verified", "pinwheel_art": "Love reading this and look forward to listening. I found myself in, I would like to say conversation, but the lady clearly wasn't listening and simply equated all sex work to abuse and sex trafficking. She wouldn't even listen to the women saying they did the work and enjoyed it and were not abused in any way. It should be respected work and safe work in my opinion. Thank you for talking about these things.💗", "uniqueyorker777": "Beautiful I wear waist beads too 😍😍", "hollygraphix": "I love your messages, but I even more love the care you take with your words.", "taylorfreemyn": "🖤🖤🖤", "bellacirovic": "I’m just at the end of the episode ✨ it was so good, so informative, and very rich convo! Thank you so much, I am truly enjoying your podcast (and learning So Damn Much!)", "dancer_fourlyfe": "@jaetafari", "wellsoulwellness": "@lilyazehner I know you'll love this as much as I do!", "randilevinson": "Yes!💥❤️", "darlenegladue": "I love your name ❣️👌😉🎉", "sarahmarieliddle": "Yes yes yes darling 🖤", "sofiahthom": "Yes!!! We need more of us find this work in the world!!! I'd love to interview you @evyan.whitney for my next International Temple Body Day... Inspiring women to connect to their bodies as a Temple and reclaim Sexual Sovereignty ... I'm going to listed to your podcast now!!! Go girl 💕", "nadiabokody\nVerified": "Verified", "monicabivas": "What is the link to your podcast? Please I would love to listen", "mag_pey_": "@dcherkasova do you follow ev’yan tho??? 😍 10/10 recommend", "taylorbartram": "Yess thank youu 🙌🏼", "daveallyn1698": "Sexy eyes, sexy shoulders. Beautiful.", "illunimati666": "Though i haven't met Doc_obor2 , but i have being hearing and seeing his wonderful deeds on people's life.. This made me contacted him because i was also diagnosed of Hsv2, When i contacted Him, without wasting time, he started His Miraculous work in my Life, I am happy and Glad to say that i am now cured after using His herbal Medicine.. You can also reach @doc_obor2 on hsvcuretemple@gmail.com,or whatsupp him on +2348105813057", "cannadancer": "I love this 💚💚💚 I am passionate about pole dancing and it's also helped me overcome many things in life, from my blood pressure to my anxiety! I want to teach others to dance once I go back to work full time (I've got a little one at home still) and have been worried about what people will think. I don't want to feel like I can't post photos or videos of me doing what I love because I'm showing skin or even the way I dance. Kinda going off here 😂 anyways just want to say thanks and someday soon I hope I can eventually overcome that and promote my dancing more.. because I love it and I feel like I need to share it 💜", "zawadinyongo": "👏🏾👏🏾👏🏾 preach mama! I’ve learned a whole lot from the African sex worker rights movement and worked closely with mighty warriors like @amarulagal director of ASWA (The African Sex Worker Rights Alliance). Part of her story is in a collection of short stories I wrote and published called “When I Dare To Be Powerful”: On The Road To A Sex Worker Rights Movement In Africa. The link to download free is in my twitter bio @ZawadiNyongo ... now following @cummanifesto too. 🙌🏾", "shannonlee.doula": "🙌💃💘", "yawoowooboo": "Hey girl! I love the chain around your belly. You know they make crystal chip necklaces? I wore those all the time a few summers ago. It’s really cute. You should rock those!", "shortcake.xoxo": "I love you and the work you do. Thank you 💕💕💕", "scraperella": "amen", "jaliessasipress": "🔥🔥🔥🔥🔥🔥 🙏🏽❤️ RIGHT", "eroticapoetica": "Hells to the yes!", "danicayoga": "I support you and all you stand for! Thanks for sharing sexually liberating content and not listening to the haters. Just an hour ago another RANDOM dude messaged me just saying “nice ass.” And tried video chatting me. I said, please don’t say things like that to me. And he said “it’s a compliment.” 🤨🙄", "janashareswithyou": "Thank you so much for this! ♥️", "sunkissedmoonshadow": "🌹🔥🌹", "mikachana__": "Love the waist chain 😘", "rocknrollhighschool73": "I love @cummanifesto !!! So wonderful to see you two doing amazing things xoxoxo 💞💞", "rene.kopitar": "Answer me", "lonasmith": "Stunning beauty even more stunningly beautiful words!!! @emsutp11", "mariaceciliapozo_coach": "@ilemirandaile mira a esta increíble mujer! Love her!", "ce_monds": "💜💜💜", "idreamofy0gini": "I have a feeling a lot of people won't be ready for this. Don't let that stop you ❤️", "satinelabelle": "I love this! 💖💖💖", "__fairylily": "💕💕💕💕💕💕", "patlikecat": "Always❤️", "tastytrixie": "❤️🙏❤️🙏❤️🙏❤️", "womb.and.board": "You. Are. The. Best!!", "mabdullahbey": "Awes🍷", "jessicarycheal": "🖤🖤🖤", "hanafinkatiemac": "❤️", "cuore_amanda": "🙏❤️", "lauraquinterophotography": "♥️♥️♥️♥️♥️ thank you for the work you do! I’ll share with other boudoir photographers in my network because this is so important", "sketchy.spice": "👏👏👏👏👏", "lenoreblack_": "Seriously such an incredible interview! 🙌🏼🙌🏼🙌🏼", "ebonykenney": "YESSSSSS!!!!!!!!!!!!!!!! I was literally nodding my head and doing all the things while reading this! This is so, so important.", "suryadeviworld": "Yes yes yes!! Thanks for this 💓😇", "anonymousfolk": "@jenessaprincessa 😘", "shooboxx.77": "❤️❤️❤️❤️❤️👍", "theyoganjaboarder": "💗💗you are incredible. It is so rarely spoken about and so important!", "glitterinthedirt": "I yourself agree with you. It's something I believe & talk about frequently in person, but I think I've only mentioned it a few times here. Thank you for the reminder!", "evolutionofgaia": "Mesmerizing", "evyan.whitney": "note: all anti-sex work & SWERF-y comments will be deleted as I reserve the right the keep this space (my space) safe & SWERF-free. if you’re confused about why I support sex workers or have weird feelings about it, please listen to the latest episode of my podcast, The Sexually Liberated Woman, ep. 35. both I & Allie (@cummanifesto) did a ton of labor to educate you out of ignorance. I’ve also written a blog post with links to incredible reads & sex worker orgs that you can support right now. link in bio for that. 💞", "pusssywitch": "Ahhhh! Yes. Yes. Yes.", "ohhai_alley": "I love this"}