{"bobbieboom": "Ugh💓 are you a ♉? You wrote everything that I want/desire!! @evyan.whitney", "kydiaa": "this is inspiring", "fierce_pisces89": "🖤🖤🖤", "mindfulmarymiracle": "Yes!", "moira_coach": "A passionate paramour! A violet cream. A wish list of simple and deep desires. Perfect.", "manaworks": "I love this! I’m working on similar things in my life. As I was reading your post I recognized some resistance within - more than I I think I realized was there - and I was able to address it with non judgement and ease, largely because it was your share and I wasn’t overidentified with it. So THANK YOU thank you thank you for all your honesty, hard work, and beautiful writing 💕 you’re inspiring!", "fresheima": "I am gonna read this to myself a few times and try to write a text like this soon 😍", "duchess_ofrealestate": "I stand with you sis.", "thejessicajohansen": "@lyviacairo @julie.energyhealing this is amazing! 😍", "allisonsabrie": "“I deserve what I want.” 💛", "march_storm": "@sidney.dehaan ❤️❤️", "womb.and.board": "@luv4ransom follow her! She does the sexual liberation podcast and is the Sexuality Doula 😍😍😍", "tsitsi13": "@miss_shingz", "j_e_s_s_i_c_a_b_r_o_w_n": "You beauty x", "ebele.me": "- you are worthy of all that you want/desire. may you receive them all. ❤️", "immortal_sol": "Let the river of Lakshmi flow. Yass Goddess 🔥🔥🔥", "yawoowooboo": "I dont know if i already said this, or if you responded, but a few years back, i was wearing the strands of crystal chip beads around my belly. You should get some! It felt so good to have labrodorite encircling me.", "zoliteffenhardt": "💖❤💘👌👍👅👅💋😉💋💋😍", "bella_beliza2": "Wow 😍", "_theskyinside_": "May I repost this image with credit to you? I love your desire here so beautiful 🔥", "juststaystoked": "WOW THIS 🙌🏼", "magovin": "I adore the waist beads!", "justinof75": "Lovely dear ❤️📸😊", "miyazinn": "@ghosthouse3000", "thisisyoursacredspace": "Thank you for declaring this out into the world. Ty for reminding me to want also. I forget at times. ♥️", "annaxzhu": "👏👏👏👏👏👏", "nefertira_": "I sell waist beads 😍🙌🏾💛", "belindakae": "Yes to all", "janitaharris2018": "@latil_", "humbled77": "Waist beads I want 👀👀", "lunagraceisbelllove": "As I always say, desire is a signification of readiness to step into what it takes to receive said desire, not a sign of what you don’t have. #yesthankyoumoreplease", "seedandcircle": "You never know unless you ask. Unless you try. Unless you want. Unless you speak up. You spoke. You are speaking. The Universe b is listening.", "thenotsoavgbermudian": "You are amazing and I THANK YOU for what you do 💖 I'm listening to your podcast now (back to back) and I'm looking forward to reading your digital work as well as taking your course. Regarding Tropical Climate: I would LOVE for you to come to Bermuda (subtropical). One day! I really want to being this movement to this little island of mine. ❤❤❤", "bydhiyanah": "💖💖💖", "dear_m_prudence": "Yes, yes, YES!!!!!! 💜🙏🏽🔮", "laraeawakened": "Yasssss sister 🙌🏼", "jadedoctober": "This resonates so much with me! 💕💕🌵", "mabdullahbey": "Awes🍷", "kennylanthier": "Omg @evyan.whitney you are a supreme woman!! To able to put out all of your desires like that!!! I desire those things as well!! And for you to allow it to manifest because of your self empowerment, that is true strength and willpower. Love you for this!!! 👏❤❤❤❤❤ thank you for inspiring 🌠🌠🌠", "dina_tarek": "i wanna copy 🙂🙂🙂", "theculturalasset": "Yes. Yes. YES. ❤️❤️❤️", "bettyemenemse": "❤️", "elizabethdialto": "May you have ALL OF THIS AND MORE. AMEN!! 🙌🏼❤️🔥", "sarahmarieliddle": "Yessssss for wanting!!!!", "_eliana_allday": "Yessssss!!!!", "alexandriathibodeaux": "I love this!", "lalabelle.rose": "Beautiful wish. Your words reminded me of a line that has always stuck with me from the poet Tim Seibles: \"If I didn't want so much so much, then why would I ever say anything?\" (I hope I'm quoting it right.) I wish you many blessings. 💖", "erockfor": "Now that you’ve expressed and declared your wants, watch how your life changes. Imagine what your life will look like a year from now. This is exciting!", "emmabauso_photo": "You have inspired me to want many of these things too, especially when it comes to sex and my relationship with both my boyfriend and myself 💗💗 keep doing it, girl 🙌🏽🙌🏽", "zzeeeeeeeeeee": "YEEEES!!Congratulations love 🎉🎊", "marykellyreed": "Adore 💖", "robinblackhoodie": "luscious👀🔥☯️💕", "elleciapaine": "💜💜How are you in my head?🤯🌸", "eftychia_mavrantza": "This is a mantra! Awesome!!! ❤️❤️❤️", "nya_tamara": "To allow myself to want this much, and not feel like I'm asking the universe for too much. Here for it! Absolutely 💛", "sarastibitz": "Well, you are revered and celebrated. ❤️ And when you’re ready to write that book, I would love to help you do it.", "herbnerdmonica": "What wonderful wants that are totally attainable. @evyan.whitney if you ever graze by my area in Auburn, CA in Northern CA, let me treat you to a Holistic Natural Facial. My treat for all that you have shared with me on your wonderful podcast. Warmly, Monica", "pleasureinitiatrix": "Allowing space for the desires 😻 xxx", "fatssoraven": "Beauty! You deserve it all and more 💜", "pinwheel_art": "🙌🙌🏻🙌🏼🙌🏽🙌🏾🙌🏿", "mermaidkikii": "I hope you get all that you want. You deserve it. We all deserve what we want. 🌹💖", "myorgasmiclife": "Yes 💓✨ tingles as I read this.", "nic.antoinette": "This is so beautiful. I want all of this for you 💕", "rachaelmaddox": "Most certainly, you will have what you want. ❤️I want a lot, too. Thanks for letting yourself want. Feed that seed. Your medicine is so potent. xo", "morristmara": "This!!!😍😍", "minaminers": "May you be granted all this by the universe. And everything you don’t quite yet know you want as well. ✨", "coffeespiritsandtarot": "AMEN! I want all this too 🙏🏽", "moonchildmysticblessings": "Yesss hunny 💜", "tally_ban187": "#same 💕", "missbillustration": "YES. ✨💛", "melody8rown": "🙌🏾", "ceceoh_": "👏🏽💓👏🏽💓👏🏽💓💓👏🏽💓👏🏽", "etherealvalkyrie": "You have expressed almost word to word how I feel. ❤️", "edithtollschein": "Yaaaaaaaaaaaaaassssssss🙌🏽🙌🏽💖💖💖", "calimomntx": "Question. Is there a fine line between manifesting what you want and thinking of what you deserve and feeling guilty and possibly asking for too much and being greedy??? I guess its a struggle I have possibly something intergrated in my brain. Where is that line of manifesting your life and being content of what you have? I ask cause want I similiar things for myself of what you have just asked the universe. And fyi.. I pray you get (and you will) all things listed above. Much love.", "sincerely.this.alchemy": "Yessssss!!! Allll dat and more", "mollonwarriorprincess": "I am in love with these words!", "charlotte_sharingthehealth": "We should all get to experience this, creating a beautiful life is everything to me these days 🖤✌🏼", "madame_nadia": "You and I both!", "lerinalta": "HERE 👏🏾 FOR 👏🏾 THIS 👏🏾 !!", "madywallace": "🙌🏼", "_.sophia_michelle._": "I AM WORTHY. I AM WORTHY. I AM WORTHY", "womanlyours": "And for sure you will have all what you want. You deserve it. All the beauty of this life. From Paris with Love"}