{"evolved2ali": "YES!!!!", "andreacwood": "I am so grateful that you accepted your spotlight and owned your dream! I took one of your classes and participated in the Sensual Selfie Challenge and because of those things, I am starting to own my space and embrace my sexuality. Thank you. Your hard work inspires others to do their own work", "soultripp": "This post of yours went in my “Life” section. 💜", "jeevansingh.co": "Yesss, thank you for your medicine & leadership. As well as the permission to be seen in service of healing the collective.", "jolien.lesage": "So inspiring! ❤️", "schmidtshowgram": "🙌", "so.womana": "L I V I N G  I have to do this. I feel so capable and terrified of expanding at the same time. I know that it’s time. It’s time.", "samtantrika": "so much appreciation🙏🙏🙏", "can_i_am": "Yaaaaassss! Keep growing beautiful!", "amy_warrior_bristol": "I love the last sentence!", "thesoulecho": "I needed this, thank you💕💕💕", "chantelleawhina": "@long_jaw here’s another goodie for you x", "incrediblydeadlyviper": "@treewaterinitiative 💕", "taberstockstill": "You're Inspiring!", "love.lorelai": "❤️", "oliviabylove": "This is pure inspiration magic baby girl, thank you thank you for being big ❤️", "the.yogi.dietitian": "This is inspiring, thank you! Your words further catalyze what I have in the works and I appreciate you for it sister 💜", "jimanekia": "Beautiful", "seedandcircle": "On those days when I am forgetting myself I am lucky enough to have posts like these from you who inspires me and reminds me that manifesting my life is in my hands. Thank you.", "holyplasma": "🙌✨🌈💕Woohoo! I’m feeling the fear and doing it anyway too. Being seen. Putting myself “out there”. Love this post. Thanks for sharing 🙏🌈💗 The world needs you in the spotlight. Thank you for sharing your magic 🔮🦋", "kocomeow": "Glowww", "seasideshaman444": "No more hiding! Beautiful 🙌🏾🙏🏾❤️🌎👑", "bella_beliza2": "You’re so beautiful", "eye.am.samira": "Random question How many braids do u have in ? I’m braiding my hair next month and I like the fullness you have 💗", "plantstrongmami": "AHo! All this and To being our ancestors wildest dreams!!!", "ashantidoll": "Love that last sentence the most💞💞💞", "meganjoymay": "Thank you for this right now. On the precipice of my own expansion confronting and overhauling many of the same fears & blocks. Bless you Divine Queen.", "laraeawakened": "Hell yes 👏🏼👏🏼👏🏼👏🏼", "phenixxb": "Keep rising 💥💥💥", "nadiabokody\nVerified": "Verified", "justine_ke_era": "So dope. So inspiring. Thank you. 🔥❤️🙌🏽", "thatblvckhippie": "You're such a queen. Thanks for making my commute a little better with your podcast", "sarah_wells_ikeda": "Ooooh, I feel like this coming season/year is calling on me in the same way. Thanks for your inspiration. Been following you for a while and just started listening to your podcast. Good stuff! Keep up the amazing work you do in the world ❤️", "emily1717m": "You are so beautiful and honest!!! I love and appreciate your work and cannot wait to see what more you produce! ❤️😍😊", "courtney_coaches": "💓💓💓", "hippypippi": "Yes!!! Radiate sister!!! 😍😍😍😍", "mitzfit_": "💜💜💜", "tessarave": "Yes!!!! You inspire us!!!", "stephfa8": "🙏🏽❤️🙏🏽", "london_lucille": "Amazing. Thank you for sharing your courage. I resonate with the “imposter syndrome” so much!!!", "virtuallybrooklen": "I feel this so hard!!!!!!!♥️ Started an open mic and indie market 6 mons ago, and it is just booming. Been hosting a gig once a week for 6 months thru sickness and health!!! Now I just got an amazing opportunity to work with another awesome indie market and I feel like I am really stepping into my truth. GRATEFUL❣️", "_andreahill_": "YES!", "wildandvibrant": "Feeling this so hard as a creator and a sexuality space holder. Thank you for all you do and inspiring this courage. 👏🏻", "thegreenflash": "Your intention and your beauty grow every year. I'm so impressed by you.", "arosemapstar": "Yay! You are absolute Goals.", "alisha.rae.creative": "🙌🏼🙌🏼🙌🏼", "brandialexandir": "You’re all the things .... and I needed this message", "naturalmermaid": "Yes🙌 recently discovered you 🙏 I’m downloading your podcast episodes right now 💖✨✨✨✨", "sarlejeffries": "Everything.", "wtfvckart": "❤️", "hurrayforbee": "Highly inspirational💓", "kristenkorvette": "Yesss I know that feeling all too well and how hard it is to push past it - and how rewarding the process can be in the end! Huge congrats 💖🎉", "kellybrownwrites": "Thank you for stepping up and out and sharing yourself with the world. Love your work and it's truly inspiring to watch you rise into your strength! It gives me extra motivation to do the same 💚", "peaceloveandbubbly": "🙌🙌🙌", "the_spacequeen": "Damn. “here’s to being your ancestor’s wildest dreams.” Fuck yeah.", "nqueen514": "You're amazing and have gone through a lot. You should be proud. I am proud of you. You're an inspiration. Thank you.", "mardjjaann": "Highly inspired by you. Thanks for being. Your presence means a lot to this damn world 🙌", "consciouscoils": "That’s such good stuff! 👏🏾👏🏾👏🏾", "eroticren_aryn": "We need more POC taking up space. Especially in the sexuality space. More artist more leaders more everything.", "heatherwilliamsyoga": "YAS Queen! So glad you have been following you on your journey this year, you are a badass!", "elena_lipson": "Cheers to “surprising yourself with your tenacity” 🥂", "itsjasminelovee": "❤️I'm inspired.", "erockfor": "I’m proud of you too ❤", "carakovacs_": "You* 🤦🏻‍♀️", "judy_blooms_": "🙌🏽🙌🏽🙌🏽❤️", "songanddivinity": "❤️✨!!", "distinguisheddiva": "Thank you for sharing your light", "nic.antoinette": "I love this, and can't wait to attend one of your workshops someday!"}