{"ashangrila": "😍😍🙏🏻🙏🏻", "onyaenaturals": "I’ve never heard of seed cycling before! That sounds interesting. I hate dark spots. Especially on us black girls", "naima__amall": "🙌🏾🙌🏾🙌🏾 @chakrubs 💛 and absolutely love heritage brand rosewater", "robinblackhoodie": "luscious💗👀☯️🔥", "abracadabra916_": "@moderngoddesslifestyle have you heard of seed cycling? Would love to hear your thoughts!!", "sah.simon": "Your skin is amazing! Love this routine @intothegloss", "uniqueanartist": "Sent a question @evyan.whitney", "naomirochard": "Yassss 🙌 I can't wait to try out the seed cycling. Sounds like the most interesting part. First time hearing about it ❤", "thewinterphoenix": "Your skin is gorgeous 😍 I think you’re right about “less is more.” I’ve switched to that approach and my skin is so much better now that I’m not using a ton of products. Thanks for sharing your regimen with us! I’m so curious about seed cycling! You’re the second person who I’ve come across that has talked about it and now I’m really interested!", "passionbykait": "OMG THANKS FOR THIS", "_beautyandthebroomstick_": "💖 Loooove that rose water & castor oil! Yesss! Castor oil has been great for my eye brow growth and eyelash serum. 🙌", "jayytayy_": "😍😍😍", "daisy_voo": "I use several of these and seed cycle too! It’s amazing the benefits... men and women both thrive from it... I recommend it for us all, since we don’t get natural sun/moonlight we are meant to, along with diets not always giving us all we need to thrive hormonally. I wanna try your mad hippie c syrum. as the kind I use ran out. Thanks for sharing :) I don’t know many people who cycle it’s great to hear and encourages me to keep it up take care!", "haather": "@aubreehayward 💕", "heathrebecca_": "@evyan.whitney thank you so much for bringing seed cycling into my life! Going to give this a try ☺️", "daveallyn1698": "Beautiful wow", "sunbeam_brookie": "Thanks for sharing 💜 @nat_leee read about the seed cycling !", "diabay": "💕", "manaworks": "So cool! Can’t wait to read more about seed cycling. Thanks for sharing 😍", "yogi.tb": "Same products!", "curvy_fit_bodyposwarrior": "Thanks for this. Probably your biggest “routine” is just genetics and you’re so effing beautiful. But I’ll try your suggestions! What’s the significance of the flannel cloth? I’m a trained cosmetologist and I’ve never heard of this 🤷‍♀️", "delightjenny": "Vitamin c should ideally be used during the morning! 😍🌟 it’s an antioxidant and helps with environmental damage that you get thru out the day", "tcd4ever": "Slay queen", "madhippieskinproducts\nVerified": "Verified", "patriciaglows": "Ooooooh just googled and seed cycling seems to be the answer to the hormone balance question I've been asking of myself. I know that my breakouts are timed but been thinking to track them to events. Will give this a shot, especially that the last new moon of the year comes tomorrow. Thank you! 💖", "i_an_am_cain.again": "🙌", "cuccia.co": "❤️", "travelingvoyeur": "💗 Thanks for sharing", "sylviaannelise": "Can I ask the reason you do the rosehip oil in the morning and the vitamin C at night?", "pika_kalie": "geeking about that retro lush coconut deodorant 😻", "_ashleystory": "Oooooooh love love this", "grand.prismatic": "That Mad Hippie Vitamin C serum is some bomb ass shit!!", "christinaebohn": "thank you for sharing! excited to try seed cycling.", "evyan.whitney": "p.s.— @fertilealchemy, your aromatic oil for balancing hormones is such a good support for the other things I’m doing 💞💞💞", "sara_lee_photo": "#goddessglow 😍🙌🏽", "shimasuhouse": "Ooooooh I gotta get on my skin care game like you!", "chakrubs": "Glowing ✨💫", "seskalee": "A naturopath got me hooked on this in the mid 2000s. I was in my 30s and it helped me immensely. More following the flow of my body.", "bluebopkid": "sunscreen?", "laylafsaad\nVerified": "Verified", "pusssywitch": "😍✨😍ahh I love this. Thank you for taking the time and energy to share! I feel soothed just reading about your routine.", "eroticren_aryn": "Omg you use a lot of the companies that I do !", "manda_maria": "@intothegloss Can we get a feature on this amazing woman please? ✨❤️"}