{"ihavesmallhands": "Ugh. I hate this. It's the shitty legislation but at its roots the puritanical bs which your work is a powerful force against", "erynamelism": "Evyan. This is very frustrating news and we have got to collaborate time and intelligence to think of what’s “next” while surviving what’s happening now. Sending you love and freedom. Let’s keep fighting.", "tangelina488": "Keep positive... don’t let them take away the hard work you put into your self and fans ❤️", "shineloveproject": "I see you... thank you for you her deep vulnerability. This too is a concern of mine as I lead sacred sensuality yoga retreats and Johne healing. Inevitably when you’re doing something great you will deal with great adversities this will be one more thing that we all overcome. The vibe of what you’re doing is still there regardless of this platform! Keep shining bright! 🔥💛", "minaminers": "It’s disturbing. I have many sensual self portraits, so I have to keep this in mind as well. I’m enraged, but not surprised...as usual. May you continue to shine and powerfully push forward despite these man made roadblocks. ✨", "_in_between_spaces_": "thank you for the work you do🙌🏾why facebook decided to incite fear in folx involved with any kind of s-x work, educational or otherwise, is beyond me. we live in a world where people are embracing & exploring s-xuality yet these public platforms try to silence progress. so frustrating! please do what you need to do to keep yourself and your work safe💗✊🏾💗", "hannahhakkenberg": "So who's going to start a new social media platform to solve this problem? I don't have the skills, or I would...", "magiyachyvstv": "In sending you my love and support @evyan.whitney! You’ve been a source of huge inspiration and healing for me, praying for you to stay safe 🙏", "kaylawass": "Fuuuuuuck that!!!! The work you do is so important", "maebfilms": "Looks like a few ladies have beat me to the punch but START THAT EMAIL LIST!! Get your funnel going bc if they social media censor-police take your account down they can NEVER negatively affect your private community. Also think about building community on the platform “Mighty Networks” it’s specifically for niche small businesses to grow their audience ❤️❤️❤️", "rosesroses": "🖤🖤🖤", "laylafsaad\nVerified": "Verified", "natcolez": "Thank you so much for sharing!", "baby_veronimal": "I am so sorry. 🌹🖤", "welissamilliams": "I will follow you and the amazing work you do anywhere ❣️", "explorethecurves": "Your fear, anxiety, and anger are seen, heard, and not dismissed or discounted. Sending you much support and love for all you’ve done to help me explore and expand my sexuality. ❤️", "sandcactus": "💘", "alter.eros.healing": "I hate this new policy! And I feel your fear", "thepleasurepledge": "Witnessing your fear and the pain within it. Thank you so much for your incredible work. I hope regardless of where tech allows you to flourish, that there is safe(r) space that emerges for your voice. Much love and gratitude from @kitmaloney and @oactually too", "hilsishere": "This makes me so sad. You have created an amazing space for people who want to grow in love with their own sexuality. You help me everyday and I hope you can continue to do this empowering work in public. It’s so desperately needed 💞", "voicebodyelissa": "Thank you for sharing this and letting us know it’s happening. Super scary. Sending love and wherever the community convenes, I’m there 💕", "verdedionne": "Wow I was not aware of this", "vandenflux": "@mundaneonthemainland", "goddess.training": "I literally feel the same way 😔", "theoriginaljcg": "This isn’t fair @instagram you should adjust the terms for things that are harmful... but yet you’ll keep guns and drugs. 🤦🏾‍♀️", "dawnbreaker08": "Your work has helped me. Your courage is inspiring. Thank you. I will send prayers also.", "chrisbond00": "Thanks", "low_n_lovely": "My love to you. Keep moving.", "sol.flowa.chile": "Thank you for sharing this, wow, that's unbelievable!! Sigh just when Im gaining confidence in my sexuality. And. You are one of the inspirations for that. I'm just gonna pray you protection as well as all us other s-x positive folks on here. This is sad all type of other bullshit can be posted on here but yes ig let's filter \"provocative\" content. . .aka women reclaiming themselves. . .psshhh. . .", "taberstockstill": "I'm also confused about freedom of speech... how can talking about s- x not fall under that....? How can they censor a word that has no derogatory meaning.... hate, racism, sexism is spread every day in every facet.", "trui1806": "❤️", "thesearcheress": "I dream of a world where @badgalriri sees your work and does a sexy selfie challenge sponsored by @savagexfenty , like you said she has the platform and the capital not to be wiped away by censorship or at least start a national conversation about it. We need more people in position of power to start making noise", "jessikneeland": "Ugh. ❤️", "emlovecaster": "Sending you all the love and good vibes <3 We can not always change external conditions, but we can switch the way we react to it. You will find a solution to keep your business prosperous, I have faith in you <3", "carinaroo2": "@ourintensivelove", "marykellyreed": "Participating in your challenge was a powerful catalyst for me to learn more about myself; it inspired me to make some big changes in my life; it pushed me to think about the things I allow myself to have, and demand more for myself; and it gave me permission to share my most private thoughts with people in my life that I was afraid to share with. I just want you to know that your work has touched me deeply and I am so sorry that it is threatened by censorship and fear. 💕", "woman1sh_intuition": "This new policy is just a scare tactic, to insight fear ...don't let them win. Transmute the negative energy by coming up with a new way within compromising the integrity of your work. Im Not sure how but I know there's a way. Don't let them win... Let your Love for what you do Trump their fear of what you do. I'm sending you all types of Light and love... You're work is next level important. Your work is Light. Your work will help us to unlock our creative, healing energy from the sacral chakra. ... It will work out. 💕", "chronicbabe": "here for you, babe xo", "mamalionstrong": "This is part of the war on women’s bodies. Who do you think this policy is aimed at? What is “provocative” and do we ever use that term to describe men? 😡😡😡😡", "viola.1104": "Start an email list, sister. Own your community. You got this. Sending love!", "lxwm": "❤️ I admire your strength and fortitude to speak on this issue. I fear the climate of nation in our current times is normalizing the oppression of that which we fear. The normalization of sexuality in media is as fearful to those whom are sexually oppressed as the idea of a homogenous society is to those whom fear race. We must remember that this fear is what drives oppression and the only way to reduce fear is to focus on education and providing an outlet. Unfortunately the aforementioned companies are solicitors of fear as we witnessed during the last presidential election. The only way to battle this is to be truthful to ourselves and to understand that oppression is the only tool that they have against us speaking the truth and by speaking it we lessen their power. Keep speaking your truth, and don’t let the fear overtake the strength and power that you have within yourself and that which you provide to others.", "morgan.mychelle": "🖤", "shivanimb": "know that we love you and have your back and will follow wherever the paths take you!", "literalamber": "No kidding. I'm having flashbacks to my religious childhood tbh. Part of me is saying this is a collective thing that's coming up to get dealt with once and for all (perhaps it was inevitable from the dawn of social media that we'd one day hit a wall and go super conservative until humanity learns to deal with its issues?) and then the other part of me is furious that we're still HERE. Like...REALLY??! I'll be mad as Hell if your account gets taken down, but I know that doesn't begin to address the countless others who are in jeopardy. This is a policy issue. In the meantime I've asked for your book for Christmas. Please don't lose hope!! Your work is important 🙏", "ddfg13": "Censorship is painful. I hope this fuels your creative fire to source imaginative and provactive solutions. You fire is to intense to be tamed. 🔥", "miranda.sophia.embody": "💔💔💔", "taylojauregui": "Absolutely ridiculous and not fair. Especially because it seems like this will most affect femmes and will only reinforce shame of sexuality and sensuality in people who don’t know any better.", "alleyvalentina": "Can we follow you on other platforms to support your work in case your insta is deleted?", "gdejoie": "💛💛💛 Sharing love and light with you and your important platform and work.✨✨", "grace___hazel": "Hey Evyan. I absolutely love your work and am such a big fan of everything your pour your spirit into. Last week I got my account disabled and it was seriously uprooting as, like you, it's a big chunk of my livelyhood. A group of people pulled together and campaigned to get it back (even after Instagram had said it couldn't be) and yesterday, poof like magic (and no explanation from FB) my account came back. Proof that if we pull together in solidarity, we can get miracles happening. It's an edgy time, but for sure, I now have some faith. Love and strength to you Evyan ❤️ x", "the.wild.sage": "It is so sad! These are the conversations we desperately need to be able to normalize!", "theyoganjaboarder": "I have no words other than I feel your pain. Not because i have similar oppression... I dont. But because your incredible bravery and strength in all the ways has been inspiring. Empowering. Soulfully beautiful. It appeared the revolution was upon us and you at the front fighting for us all and beyond us all. 💗💗💗 if you find and start using another platform I'd love to know. I will download whatever it is.", "itsboy.nina": "Bruuuhhhh", "miamariasiler": "Get a mailing list going! No platform can take away your mailing list.", "kyja_jewelweed": "This sucks. I, for example, just discovered your work. 😡", "hello.mariana": "Your sensual selfie challenged helped me so much earlier this year and I can’t imagine what a great loss it would be to the community if you were taken down. Sending you love and comforting energy 💕✨ It’s absurd that a glimpse of a bare breast or the mention of s-x is getting taken down while there are so many racist, homophobic, transphobic, misogynistic accounts all thriving and with follower counts in the hundreds of thousands.", "sapphiresplendour": "This is utter nonsense that FB is up to! I’m there with you praying so that you do continue to stay and put out all this work that you do so selflessly ! Thank you 🙏🏾", "vcaswell1": "We support you and will help keep SLL on the radar in whatever ways we can. 💕", "primastrong": "Better get you on Patreon or some other venue. I could see you doing well with youtube as well.", "skiing_jewels": "Absolute BS what these companies are doing. Idk how they think censoring solves anything", "messex_": "Hang in there.", "suddsz": "Keep your head up, I’m certain you aren’t looking for advice but I have witnessed a lot of account take downs in the past especially in the cannabis community. I would definitely recommend making a backup account, and informing all your followers about it. Then carry on as usual ✊ #fuckcensorship", "galianpizazz": "This is infuriating. Is there anything I/we can do?", "elizabethdialto": "🙌🏼", "britthoffman_": "Do we know for sure if this has been added to instagrams community guidelines? I can only find info about this in regards to Facebook specifically. Instagrams guidelines have not been changed yet as far as I’ve read.", "rockerscloset": "Trust in the power of your work. People have always found a way to access the leaders & workers they want to follow. It's been this way before the internet & will surpass it. We ran a qtpoc fem-centered live music event in Philly for 10 years that basically ran itself on the strength of those who joined, before IG existed (2005-2016) Collect & strengthen via your other avenues now, and consider building an ongoing tour (if u aren't already)? Remember that people are attracted to the idea of their own liberation and not to you as a social media figure- your work is the plug!!! And I'm sure many of us will continue to spread the word about you..not to dismiss your fears, just wanted to encourage 🌷", "jenerous\nVerified": "Verified", "suruki3": "I love who you are and appreciate all the work you have created. I see you and hear you. Please take all the space and time to be sad, angry, and the emotions of fear. It is a lot to process and the toll of stress is real. Remember to take care of yourself in the process and that the community that you have created is here for you. Sending all my love and if you ever want to talk, I can always offer to listen.", "novablooming": "Nooooooo 😭 why can’t the world stop censoring real life?", "sacredwombanhood": "This is really sad and just more censoring of women and our s-xual expression. Smh", "thejanetbrent": "I’ve been noticing this crack down on sexuality lately... even Patreon.", "_issa_darling": "@ihartericka", "janea.dee": "i’m so sorry this is happening. your work has meant so much to me. i hope your support system is holding space for you to move through your anger, sadness and fear. i believe that you will be able to find solutions and answers in time. please reach out if needed. there is a whole network of support available to you. ✨🌻✨", "sarahmarieliddle": "Thank you, I feel so outraged, sad, frustrated. I know this is a way of silencing us but seriously I feel maybe this calls for us to step up. I resonate with your message and that should keep going in whatever form you can. 🖤🖤🖤🖤", "ninos_club": "@ssamlightt this ☝🏾", "loriana__": "I think it’s important to consider what’s next after Instagram. There’s a dependency on this platform that is not sustainable, in many other ways as well. Every day there’s post about sexuality, racism, etc that are deleted for BS reasons, users being banned, accounts being deleted, etc. We can fight it, but we can also consider where to move to next- what platforms allow space for these topics/issues.", "asyadomique": "Wow", "abbyhumphries": "this is a step in the a scariest direction. the people who make these decisions (men) cannot handle the fact that women are using this platform to find community and power in our sexuality. they can’t handle it because it threatens them and the male privilege that they have always enjoyed and expected. it makes me sick", "beautty_queenn_": "But will this equally apply to men who are topless or in Speedos?", "livcharlottek": "Love <3 I am grateful for all the work you do and the wave you make by sharing your thoughts. It will show sooner or later.", "nadiabokody\nVerified": "Verified", "estrelleeee": "Beauty. 🌹", "eroticren_aryn": "I’m so sorry. I’m terrified to. I just started in this platform to try and build myself a following and I feel like my dreams are going to be destroyed before they even began. Holding space for you and your anxiety. I empathize.", "evyan.whitney": "And please—before you leave comments saying things like “Let’s start our own platform/app” or “How about we congregate to [this obscure platform]”: Know that I hear you and I understand you’re trying to help, but those comments are not productive. For one thing, starting a brand new app/platform takes time, energy, and funds that I (a Black queer woman) do not and probably will never have, so that suggestion is not only not realistic, it’s dismissive. Also: going somewhere else is tempting, but it only lets massive corporations like Facebook and Instagram off the hook for their anti-s-x behavior, which, again, is not realistic or productive. So please, think about that before you share your solutions. And let me be mad/sad/terrified.", "allanahfire": "Wow, this is devastating. I’ve finally gained up the courage to start sex related work again and now this. It’s enough WOC/POC are constantly silenced in this society, but to now take away something that I and you and so many others find release, is beyond devastating. I too am afraid. My sensuality is the one thing I feel I express myself the most in online and to the world. How could they try to control us and our livelihood in this way. Fuckers!!", "notsafeformomgroup": "This enrages me. There are male-centric accounts that seem to be doing juuust fine and are posting nothing educational at all. Misogynistic, degrading stuff. Just look at Candy shop Mansion.", "lindsaymeyerharley": "I am so sorry, IG has become such a battlefield.", "samantha.f8": "I hear you ❤️", "krystal_tantricyogi": "I’m actually wondering how they will be able to monitor everything that is sexual on ig and fb. They would have to censor so many artists, entertainers, and influencers. Even Victoria’s Secret would need to be banned if that’s the case. I find this all very interesting, but I believe there will be other opportunities to share and educate on other budding platforms if that was to happen", "danicayoga": "Totally unfair. It makes me so mad.", "chakrubs": "💓", "themexicanwitch": "We need a new network. Where the brilliant femme techies at?? 💕💕Sending u love thru this. I def think this can cause big anxiety and you deserve to feel secure in your work. I will Always support u!!", "__camilanogueira": "I wish you lots of strength and positive energy during these difficult times. And I reiterate your words: a woman does not have to be modest to be respected. 🌻"}