{"ms.j_bitch": "🗣🗣🗣", "tiaramescudi": "YES!", "cat_everydaymagic": "YES!!! 🙌🏻", "joanna.inthisreality": "Thank you dear one.", "courageous_pathways": "These fabulous questions popped up. Thank you for reminding me of this important facet of beingness. Deep bow in gratitude.", "nunusvybz": "YASSSSSSSSSS🔥👑🖤", "coyotemother": "🙌🏼🙌🏼🙌🏼", "cest.francais": "Yessssss!!!! Thank u for this post 💕", "rachel.slick": "Less inhibited about my squishy parts...", "jenaviemayari": "🙌🙌🙌🙌", "madi_graham": "Wow. Just looked up the FB policy. Scary indeed... especially for all the sex educators I follow here who provide such VITAL information... Sending you good wishes", "london_lucille": "Thank you for this. There are many questions here that I don’t even know how to begin to answer for myself. So much fear and shame and just plain nervousness attached to sex and to really making sexual healing a priority for myself. First step will be to give myself some grace in navigating where to dive in.", "kykujichaguliathelover": "💚", "odetothegreenery": "Thank you 🌻❤️", "yasmeenexplainsitall": "@justmelovely", "azuresummerete": "@oliviasolomons", "astraya.ray.starlight": "🙌", "sourcemother": "@ickytoad", "ana_____italiangurl_23": "🙌 a gem thank uuuuu", "murdockmusings": "@lis.best @louripdug", "jadeypoopoo": "@rhavenrodriguez ✨💕", "romeyrome42": "If you’re with the right partner, all you have to do is ask! #scorpioissues😊", "jayden_dao": "Fabulous!🔥", "megtrev": "🙌🙌🙌", "msjennifertharp": "I love seeing these important questions you’re asking. And that you’re always advocating for healthy relationships, integrity, and self esteem.", "_kjacobs": "👏🏾👏🏾👏🏾", "toranmcgill": "👏🏾👏🏾", "lavme83": "😍💙🙌🏽", "moderngoddesslifestyle": "Yes please and thank you 🌹", "flowfearlessly": "I was wondering what's up with the censoring, thanks for explaining! This year I will continue to flow towards whatever feels right and good, no restrictions, fearlessly ✨✨✨", "intastalidzane": "💎", "larissaweld15": "@roxanna_morse", "sarah.gets.naked": "This year I’m gonna stop faking orgasms just because it’s more convenient than explaining that I might not be in a place to have an orgasm in that particular instance. I’m also going to run the risk of attraction to someone I “shouldn’t” be attracted to because if I keep shutting that possibility out, I’m also shutting out my sexual power, and that I refuse to do without.", "discosis3000": "Facebook now owns IG? Fuuuuuuuh 😭😭😭", "rachealweathers_": "yesss", "brighty_evans": "@bekandthecrazydiamond", "soulfeastkatie": "Legit❤️🙌", "raging_natural": "2019 will be the year I explore my kinks without shame!", "lovehealthok": "🎉🎉🎉🎉🎉🎉🎉🎉🎉🎉", "growing.spirit": "I am definitely going to have the sex i want to have! no more guilt thoughts. sex is a beautiful thing when it comes from right intentions🙏", "chefgabrielaalvarez": "@vickiedean", "themexicanwitch": "I set so many sexual intentions this year!! I don’t really want to sleep with cis men, and I want to have more sex with queer people. And certainly being more (vag) positive @athenasapothecary what do you think?", "incendiaryx5": "HELL YES!!! This is the year of me, I started the year telling long held family secrets and freeing myself from long held barriers. I am SO glad I came across your page, u remind me to make myself a priority and there’s not a god damn thing wrong with that!! xxx", "missalyssyoga": "@kristinacappawhat @mrrickysmith @emmycurt 💋❤️", "princesschey.rn": "@brianachele", "thespreadpod": "2 is my weakness", "nolatrees\nVerified": "Verified", "carolinebauermusic": "Yes!! ✨🙏✨", "joyceoladipo": "You are such an inspiring. What sexual curiosity hasn’t been a question I’ve explore. Thanks for bringing this to my awareness. I desire to explore more wildness", "mag_pey_": "yesyesyes", "user1358899": "Thank you @evyan.whitney I need to read this for reassurance. Due to depression, rejection,weight gain and failed relationships I’ve been without sex for 2 years. In my current journey of healing these emotional wounds I find myself desiring sex again. However, its terrifying. I’m so afraid to appear vulnerable again. Any advice?", "urbansmash": "s-d", "krystal_tantricyogi": "Love this", "chastityfayee": "Wow this is so deep. I struggled a lot with this last year😭. Thank you ❤️❤️", "kathrynstories": "💜👍 @christinedern", "chailattethanks": "@lola_oriowo @isabellabonomo @ahjimoh", "ourandare": "Yassss! #sexualintention #2019", "hail_vvitch": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "noiresol": "All of this", "iamnonabishop": "🙌🏽🙌🏽🙌🏽", "zoey_kriegmont": "i want to have more fun with sex! let things get weird. i feel that I take things too seriously and it is not as great as it could be. how do you all keep sex weird?", "shybuttiefly99": "👏❤️🌹", "dennydiaries": "@llotus20 🙌🏽 just what we were talking about !", "theweeedfairy": "in 2018 i had a series of realizations that kind of illuminated the extent of my ‘sexual dysfunction’ and i slowly started the path to healing. this year all of my goals are about staying true to myself and working hard to build my ideal life, and i think a big part of that is in my sexuality. i want to squash my feelings of shame and inadequacy, i want to prioritize my happiness and reach out for things that make me feel good, that get me closer to being the person i want to be.", "curlyyoungthang": "Evyan, you’ve helped me so much on my spiritual journey. My statement might sound crazy to others but it’s the truth. You make me put the inner me before anything else, you help me to give myself permission and to become one with myself. 💕", "asyadomique": "@queen_phoenix_", "jalovesyou": "As you damn sure should.", "fiercewildlovefreedom": "this.", "themichellemarie": "@happyhutts"}