{"kykujichaguliathelover": "I definitely need to view the new sexual solicitation policy", "jesamiefloss": "Yesss. This post makes me so happy for you ♡", "ajavines": "You are doing such important work and I am so grateful for your existence. Also, I’m a Virgo sun, Cancer moon and I see you, girl.", "oloni\nVerified": "Verified", "luminaewellness": "💗", "chrisbond00": "Mesmerising", "farminginthefeminine": "Celebrating you, epic woman!!! ❤️❤️❤️", "faux_maux_": "Bravo.", "thesoulfulscribe": "You are such an inspiration 💕", "_savini": "How do you feel about movements like @fightthenewdrug ?", "sneepies": "so much love, admiration & respect for you!! ❤️❤️❤️❤️❤️", "annaxzhu": "yessss go u 👊🙌🙌🙌👏👏🔥🔥 u are such an inspiration!!! So proud & happy for u :)", "bare.boutique": "So beautiful so POWERFUL 🖤", "hippiborg": "👏🏼👏🏼❤️ So much gratitude 🙏🏼 ✨", "rubyredchica": "Congratulations! I love how you included “step out of shame”. I’ve spent a lot of time thinking about taking my photography in that direction. It feels needed on so many levels.", "kindredmedicine": "love this and your humility...this makes all the difference in holding space. thank u for u...", "ana_____italiangurl_23": "when talk humanity and space thank u cause i struggle with alot personal issues sometmes remind my self space and take space for my self , and when talked step out shame wow thank uuuuuuuuuu and becaue how can give out love and tired healing men. when , its like if dont value yourself how going value me xo", "weirdsexblog": "This is so inspiration! I’d love to collaborate! ❤️", "its.devonthelegend": "Have a great day! Bright soul! 🙏", "hendrikbirke": "Awesome 💪", "equinoxodyssey": "Omg, did you have a blog back around 2009/10? I couldn't for the life of me remember where I recognized you from, and then it clicked! I loved your blog, and I still visit a certain site you recommended way back then. So glad I found your account. (I hope it's you or else this is weird, haha.) 🌹", "liliannevargas": "💜", "mariko2804": "lovely✨👼💖✨ヽ(´▽｀)/", "lotenba": "You make me smile", "shesoftheriver": "Congratulations!! And celebrating you!!", "deva_style": "🌻🌻🌻🌻🌻🌻", "cuccia.co": "❤️👑👏👏👏", "radiantchilddoula": "happy anniversary beauty! 🎈", "love.spirit.wellness": "I am a Sag sun, Cancer rising with a lot of Virgo energy 😊❤️ love your page and all that you do!", "redreinacuisine": "I’m one of many women who have been positively changed by your work, your honesty and your tenacity. Thank you!", "myprivateinsta927": "*on your anniversary", "nadiaschmidt_": "Omg obsessed with your content ❤️ @k.arlalopes is also obsessed ✨", "oliviapinkney_": "Your work is so vital and changing lives every day 💕💕💕", "mrsmegalomaniac": "You go girl!!! 👏👌🙌", "wellsoulwellness": "Happy anniversary! From one healer/teacher to another I send you many blessings for continued abundance and liberation! Thank you for showing up for yourself and all those in your realm of influence.", "ramblemore": "Congratulations!! <3", "elizabethdialto": "Congrats on your anniversary!!", "the.light.mill": "So incredible, Congratulations on your anniversary! 💛 I'm so completely grateful for you and the incredible work that you do ✨🙏🏻✨", "livefreeordiebree": "Congratulations! I love your podcast and the work you do, especially for women from a strong religious upbringing. I found you on Shameless Sex. ❤️", "nekesha43": "Happy Anniversary", "listenupportland": "🎉⚡️❤️", "ganinleigh": "♥️", "siren14369": "So ethereal! I remember when you made the change and as an observer it’s been so amazing to see. Congrats beautiful ❤️", "_miriamthom": "Listening right now 💕 you mention an episode where you discuss exploring your queerness. What’s the no. of the episode?Thanks :)", "yasminecheyenne": "Yes ♥️🙏🏾. And congrats on your anniversary x", "carakovacs_": "Giiiirl! I am a Virgo cancer moon sex coach too! Like I was already totally in 💓 with your work. But the astrology man. You’s a queen", "the.artist.apothecary": "I adore you and everything you stand for enchanted one. ❤️", "rachelcossette": "You are so articulate. I love “I am the fruits of my labors” I love that so much 🥰", "pythonintherose": "And you are one seriously beautiful woman! Great work 💜💜", "uche_beeeee": "Congrats!🙏🏿❤️ You have been an inspiration to me on my journey to becoming my own ‘sexually liberated woman’. I am married mother of two little ones who never really had a chance to prioritize my own pleasure. Thank you for helping me realize that my pleasure should be a priority! So grateful for you.", "shannonlee.doula": "🙌💘❤️ congratulations Ev'Yan! You are an inspiration and I appreciate and value your message and passion so greatly. Thank you!!!", "uniquewellnessnutrition": "So grateful for your podcasts they have helped me tremendously. Can you recommend a similar practitioner in NSW, Australia as I am ready to start my healing.", "ashmorganmusic": "Congrats i love all that you do🧡", "layasland": "I love you and I am so proud of you 💖", "kiwi3cat": "💖💖💖", "_leavebrittanyalone_": "I drew the Empress this morning! Bless you and all the work you do. We see you. Congrats on this anniversary. I always look forward to your posts and podcasts. 💕"}