{"taberstockstill": "My first love (abusive af) had me believing vibrators were evil because “he could do it all.” It took me a few years to get over that mind control. Now with someone who welcomes it! Who knew sex could be so fun 😋 thanks for the recommendation. Looking into them", "kalimaamilak": "ALL OF THIS.", "grand.prismatic": "Feeling this - thanks for sharing! I just declared how much I love my vibrator and lube to my hubby and I no longer care what anyone thinks about either of those!", "babeswhohustle": "👏🏼👏🏼👏🏼👏🏼👏🏼", "jazzlioness": "Thank you! Another reason to dismantle these pleasure hierarchies is because it’s ableist. Disabled people (like me and many others) find sex toys accessibility devices. Not everyone can bend or reach in the same ways. Our pleasure isn’t less important or real because it is facilitated. And another myth to be busted: disabled people have great sex; we’re very clever!", "nobodyslolita": "I cant even understand people who think theres only a couple ways to enjoy pleasure or that using a vibrator is weird.. Im glad no ones in my life this way. Im happy you are rising and have a fun vibrator 💋", "mermaidemxoxo": "Thank you!! It is ableist as fuck to assume that people can get off just by their hands. I have severe joint issues and I’m able to have amazing orgasms because I have a vibrator and don’t have to exhaust my hands/fingers 🙌", "_hannahvela_": "Yeas thank you!!! 🙏", "deblowd": "🙌🏻😍", "lesly_vafan": "It is sadly how most of us were brought up. It is cultural and traditional. Nonetheleas, we can change that and take control of our own sexuality by achieving sexual pleasure with a man, woman or vibrator!", "danielaa_andrea__": "Yasss Queen! Grateful for this share 🙏🏼💖🌈", "petri_d122": "Thank you!!! 🙌💖🌈", "sineadmore": "Actually found this very comforting.", "jamieleefinch": "My very first vibrator and still my favorite ever 😻", "beyondyourdefinition": "Hi I’ll be in Portland practically all next week for an anthropological conference/ my birthday I love your work & would love to collaborative do an episode on my podcast together if possible. If this isn’t possible l would still love to meet or advice on places to go.Thanks for giving the world your magic.", "_mindmoves_": "I love this caption. It’s so important 🙏🏻", "raesevelt": "@cottonwood.tarot @melboult this!!!!! such truth from an IG ad. thank you, @evyan.whitney! wish every influencer I followed had ads this thoughtful ❤️", "hexkittenclub": "Seriously magical!", "feralsilver": "Awww!! The wevibe touch was my first vibrator and opened up a whole new world of possibilities to me! Didn’t have my first orgasm until I was 22 and used this toy. The amount of crappy sexual experiences I had until then were ridiculous, and the wevibe Touch opened up a new chapter of healing and more positive sexual experiences. Keep up the good work, what your doing is powerful.", "reinaporsh": "I just ran into your page and omg like this was suppose to happen.... love love love", "esilanah": "Love thyself", "just_ally1": "Thank you for putting this into words...i resonate so deeply!!!", "withlovefelicia": "Word. Be free.", "baresexology": "I LOVE the Touch! Gifted from @juna.storeau, it absolutely thrills when used in solo play. ✨", "graybynight": "I love my #wevibetouch 😍", "cruelladebell": "@typi_callie my vibe is certified 💅", "germanwoman29": "I have this exact one, it’s the BEST!😍", "sara.schmatz": "My wevibe is my favorte!", "wildsol_": "Thank you for this post! I’m going to be honest, I remember the one years ago about breaking up with the vibrator (and the follow up awhile later about Chakrubs) which had me all kinds of ashamed and confused about relying on vibrators for pleasure. I actually did stop for a long time, but am happy to report that re-incorporating them has definitely enhanced my solo sex life. Looking forward to giving this one a try! 😍", "kristinannehm": "Pleasure hierarchy is ridiculous. Thank you for this. One of my favourite toys is my remote control vibrating egg. Makes things so fun for hubby and I, and definitely takes pleasure out of the 'bedroom' too! Any man who'd be intimidated by me wanting (or needing) a vibe would be a man I'd rather not have sex with.", "kaymaceachern": "Yess this is awesome", "reeseecupesq": "Hmmmm I prefer real penis, over everything. I’ve conferred with my vagina and she agrees. If I have to used a toy, we’re both annoyed.", "built.environment": "@amirahgoose", "thegutsandglory": "I'm in a relationship and we use a vibrator as an enhancer for our sex. Toys are great, and all of these companies are finding more ways to help us achieve climax alone or with a partner. And also it helps people learn new ways of cumming as well as victims of assault learn to be comfortable again with sexual stimulation. People who think otherwise, y'all missing out on some explosive orgasms. Keep doing you! Let these haters keep having their surface level sexual experiences", "ryraisin": "I was luck in some ways, my mother was very open about sexuality. It was important to her that as a women I understand sexual pleasure by my own command and it not being a bad thing, my hand was okay, a toy was okay. And when I felt ready a partner was okay as long as I felt empowered. It was discussed a loving touch you shared with ones self. It was a security I was ultimately the one in control of my pleasure, even with partner sex, I feel no shame in masturbating with or without my partner there I have a right to my pleasure. Vibrators have always been my rebound tool, it was away to express that need without bring another person into my emotional recovery. All haaaiil the vibrators.", "mindfulcycles": "Thank you for calling out the bs of pleasure hierarchies 🙌👏🌕", "briannewaite": "I had such a hard time overcoming this idea when my partner and I first started getting intimate. I had a lot of shame associated with trauma, but getting a vibrator actually helped me deal with these feelings and realize that there is no shame in my own pleasure.", "elleciapaine": "❤️❤️❤️thank you!!!", "krystal_tantricyogi": "Love it", "valhalla.mama": "I’ve never been able to achieve orgasm without using a vibrating sex toy and I have so much shame about that. Thinking I’m broken and blaming myself for my inability to achieve climax with partners. Trying to root out this shame too.", "beautty_queenn_": "That’s beautiful", "poundcake_p": "I especially enjoy when men understand this and they themselves bring vibrators into the bedroom...♥️ there’s a special place in heaven for those guys lol", "zarah.lily": "It seems unnatural or mechanical. I don’t understand the point.", "micole_r": "My go to vibe. I love @wevibe and this 💕🙏🏼❤️", "amusefrombrooklyn": "👏🏽👏🏽👏🏽👏🏽", "someinspirationalsoultokeep": "Preach! 👏🏽👏🏽👏🏽", "justicelovemagnetic": "I was just thinking about this today! Challenging and changing my patterns by having new experiences and mixing contexts. Today I challenged myself to come/squirt into a bowl as a way to perform for myself and it was surprisingly liberating. 💦💥💎", "demiccubus": "yesss - i spent like ten years trying to orgasm with only hands before I even touched a vibrator. to me, the vibrator shaming and orgasm hierarchies that I see feel like a rehash of the gross \"clitoral orgasms are immature\" nonsense Freud perpetuated. if someone's own personal reliance on vibes for orgasm bothers them, then by all means explore other options. but don't shame someone else's enjoyment of vibrators just because of your own personal feelings.", "camper_empress": "Oh goodness! Thank you for this. I have a hitachi in a box in the care of a friend who’s about to give it back to me. She’s had it for a year because I was annoyed with myself for constantly “cheating” by using it. Giving myself “easy not as good” orgasms. What is not good about an easy orgasm? I’ve learned a lot about my body in the past year. But I could have also been having lots of easy powerful orgasms and subverting the bs idea that one kind of pleasure is more enlighten, more spiritual, healthier, better than another. Thank you for this. Truly. ♥️", "evyan.whitney": "& for anyone interested: me & @wildflowersex had an amazing conversation about pleasure hierarchies & unshaming how you achieve orgasm on episode 33 of my podcast @sexuallyliberatedwoman which you can find on Soundcloud, Apple Podcasts, Spotify, & Stitcher.", "carolinegloverlmt": "Ive had a hard time with this until I pushed myself out of my comfort zones recently. For some reason I had shame built up around using toys that were shaped like actual human anatomy, and could only utilize ambiguously shaped object. I dont know why though, cant pinpoint any specific reasons. *shrug*"}