{"abigaileeannsmith": "Idk if it’s just me, but everybody knows about “hair down there” we all have it. It would be nice to go to the beach and not worry if I forgot to shave, to not have people look at you then quickly look away like how embarrassing for you girl, go tighten that shit up.", "nombreuses_pensees": "This is me, this year, at the pool ❤️🙌🔥👏😂", "danae_jp": "Thank you for decolonizing pubic hair... image #oppression", "acid_polly": "Divina!❤️👏👏👏👏", "daonlyray": "Uhhhh", "ta_ma_po_la": "🙌🏾 thank you🔥", "carstenskjonnemann": "🌷🌷🌷🌺🌺💐💐", "willdavwill": "Stunning", "u.gxwithflo": "I love pubes it’s hot asf in my opinion", "ig_naturals": "😍", "mel_full": "Thank you for being you and sharing your light with us ♥️", "berenice_booluck": "Thank you so so much for sharing this great shot 🙏🏼", "caterina__veronesi": "Yes yes yes. Come through !", "itsallamirage_": "This is so important.", "thelegend792": "I'm loven this all natural Queen 😘♥️👑😍🌷", "cuckoclock": "Livin like a queen 👸", "calihatley": "beautiful!", "_m.asie": "👏🏻👏🏻👏🏻👏🏻", "lolipax___": "Yessss queen all natural hair yessss we need more people like you", "ierh0e": "yes guuuuuuuurl👏🏼👏🏼👏🏼", "jess.squire": "thank you-I needed this", "bergsnfries": "YES YES AGREED! \"razor bumps & ingrown lumps\" so real. We need more examples of dark body hair.", "sloba.set": "Footh?", "selfcareassociation": "You’re amazing", "diva_sass": "ALL OF T H I S ✨🙏 Appreciate your vulnerability✊", "vintagehugss": "Also let me design your next waist-bead. Adorn your body and, @8lossomshop", "mama_magda": "Yes!!!!!!! Been thinking about this a long time!!!", "wahangagakere": "I read an article of ‘social etiquette’ written a couple of years back by a self identifying cis-man about how disgusting armpit hair (and armpit stubble is) on women and t(his) voice was always in my head whenever I had a few little strands growing. Went the same for my other hairs too (and I have extra curly, tight, 4C little Angels) I often though ‘but what if I don’t mind having them on (emphasis on me!) A few years later (this year) I watched She’s Gotta Have it 2 and Nola had grown out her armpit hair and was even putting make up on it! The next week, I went out with my girls and put purple eyeshadow on there and was lifting my arms high when I needed to/if I needed or wanted to. #noshame #decolonizepubes", "bindi_dot": "As a hirsute woman with chest hair, I FULLY agree with this message. 🙌🏾", "word2mylocs": "Thank you for this. 💕", "javionserrano": "Love this!!! Because babyyyy my thang grow lol ❤️", "simms298": "🔥", "kangelblack": "@sokhna_dp", "lalalanabanana_": "YES YES YES", "aresilientalmond": "@anovelpearl", "antoniobragabittencourt": "Fiquei excitado com essa foto. Você é linda e sensual!🔥🔥", "rasheemmcdowell": "Thank you, hopefully this message grows 👏🏽👏🏽", "ianawi": "🙌 4c pubes are way cuter than my stick straight cactus hair pubes. 🌵🌵🌵", "frederik_william": "Ad", "lorrell_ileena_doula": "I am working on embracing mine", "abaswk355": "👏", "kofindigo": "beautiful thank u for this 💗❤️", "lovetiedwaistbeads": "4c pubes 🙋🏽‍♀️➿➿🖤🖤🖤", "jenelleglenn": "I honestly never thought about course hair being shaved like that. Fucking ouch. Sorry for my ignorance ladies. I see you now", "briannachase": "Bless. You. 🤘🏼", "ladyempanada": "🙌🏽", "mariaemanuelamargraf": "When I was born my body already started to set free hair growth hormones, so at the age of 1 i already had hair all over my body. I always felt different and embarrassed since I found out that this isn’t normal. With all these hairless women shown in media I felt like my body is disgusting and will never be loved because of my hair. But now, thanks to this great wave of feminism, I realized, that I don’t have to give a single damn. Either u like my hair or don’t( there is no logical reason to hate someone’s body hair) but for me these are the plants that grow on my body. So thank u for posting this helping me and a lot of young girls and boys to love and accept their hair . <3", "languageofthestones": "I think its so beautiful. Thank u for this💙🌙", "blissfoodflower": "wow thanks for this! Such an important and empowering message💛", "thezexshow": "I’m Italian so I have this hair every-fucking-where it’s so uncomfortable", "nofreenudes": "🙌🏾😍Yes❤️", "maddiemm": "Xoxoxox", "bemoreraw": "@carly_bergman LOVE THIS WOMAN.", "ladomenicaegia": "Thank you", "project_wwha": "There’s lots of diversity over here at Project WWHA!", "moniquetoriii": "🙌🙌🙌 freedom", "jennajewmenez": "Fuckyes. ✨", "nu.azaleaboutique": "🙌🏽your confidence is what we all strive towards 👸🏽", "birdsandthebeeez": "Thank you 🌹 💫", "mak_attack_8": "💗", "loving_gio": "Real women !!!", "staacy_mdy": "@alexia_flow.m tu pourrais ? Krlrkrkkr pas pr moi", "t.nell_m": "@jillvontae_", "angelinamakepretty": "@celdabar", "a_pletinha": "@arielmouralt essa foto te lembra alguém?", "rudy.mbb": "This!!!!! I am here for this right here", "lailawriteher": "Fuck yes", "vvlfg": "VVLFG APPROVED 🍑", "septianiekapratiwii": "@jessyimel mirip", "myeastofeden": "This. Just wow. Thank you.", "honourthetemple": "🙌🏽", "romanticworks__": "@_camille_mrc ça devrait te plaire petit bebe✨✨", "yasminebedward": "4C pubes gang whessup✊🏾", "black.princess4": "❤️❤️❤️❤️", "en.deer.ing": "@ktobuda", "carola_adinda": "Yasss THANK YOU🔥❤️", "dredreschmid": "@k80schmid caption 👏 not alone", "dj_nep1": "Natural beauty 🔥🔥🔥💯👍", "positivelytitillating19": "I’m Italian and the dark thick body hair is real and ingrown hairs are the worst! Love your bodi posi post 😍😍", "la_dee_dadee": "Luvved!! Though I am not quite there with the full embrace of my body hair in all its unruly glory, but I sooo appreciate the sentiments expressed here, and highly agree that we should love ourselves in whatever packaging feel is authentic for us.👏👏👏❤️💖", "kanikundalini": "Your pubes are so cute! Thank you for representing us 4c pube babes", "sekhmetjade": "Me 😩", "ameenamab": "@sztajko", "honeytheory": "💛", "hollywoodysa": "@kierraleone_", "travelingvoyeur": "Loving every bit of this💗💗💗", "plantifulsoul": "this. is. so. important. i used to be so ashamed of how thick my pubic hair was, always growing back right away, completely unmanageable no matter what i did. i was embarrassed to wear a bikini for so long because of my natural state of being. which is insane. body hair is beautiful. it is a sign of health and strength and vitality. ❤️ you are so beautiful. thank you. ps: ladies!! you’ll find a guy who loves your bush as much as you deserve so hang tight. ;)", "jackieskierski69": "@claire_ellis", "alexgonzalez.b": "Alto asco hermana", "monroesteele": "Dis me! Thank you! 🖤", "bishop2718": "Lovely🎆", "e_portami_via": "I thought i was alone in this for so long. Thank you for your courage and beauty😻🙌", "goodgreengoddess": "❤️❤️❤️❤️❤️👏🏻👏🏻👏🏻", "x.maiaaa": "im sorry but i got to shave cause look😭 buttttr", "priddy.hippie": "I needed this today!! My pubic hairs literally grow in circles and I’ve had to have surgeons remove up to 3 2.5inch strands from one lump. I’m tired of the pain and my doctor said I would just have to use scissors for a close cut. I was depressed about this and felt like I wouldn’t be as feminine or as pretty, then I saw this post!! Thank you so much!! 😍😍😍", "dustymoon_studio": "Magic!! 🙌🏽✨🙌🏽", "kali.sudhra": "This is amazing. Thank you sooooooo much for sharing !💜", "sayvalleymaker": "Hashtag Rosebush ha", "joynradiance": "Whoa!!! @biancasaidit #freedom #beauty #blackgirlsexy #blackgirljoy #unapologetic", "mybodywpg": "🔥🔥🔥❤️❤️❤️", "nakagidanielle": "🙌❤️😍", "aeen.alhayat": "❤️", "yasha104": "🙏🏻", "lavme83": "❤️🙌🏽🤗", "tchaiko": "🙌🏾🙌🏾🙌🏾", "babygirl_yeve": "Gang gang thank you for this 👸🏾", "tonilynettecristy": "I'm into my natural head of hair but I don't like it no where else. I admire your self love. I hope to get there because I hate shaving and laser hair removal probably won't work🥺", "fiosayshello": "Thank you", "naturalifebalance": "🙏🏽😍👸🏾", "grouchosarahjane": "Your posts are the emotional equivalent of a damn good work out! Feel so good listening, learning, embracing the reality you drop about sensuality and sexuality. Xo Thank you!", "hoodwitchslc": "wow thank u 😭🌹🖤", "zombiexdoll_": "👌🏽💕💕💕✨", "intvlt": "🧡🧡🧡🧡 love this🌷🌷🌷🌷🌷🌷 Ihair likes bumps.are so real and i appreciate you for showing this photo! This is something I really hope @437swimwear will do with their marketing because new brands are so good at breaking stereotypes of the clean shave.", "jennabaydee": "❤️❤️❤️❤️❤️", "thefuturerich": "Thank you so much I'm here for this ! 🔥", "gant.studio": "❤️❤️❤️", "blackspacebean": "Yessssss 👏🏾👏🏾👏🏾❤️", "honest.to.goddess": "🙌🙌🙌", "brookee.pyp": "Yes 🙏🏼👏🏼", "m.a.d.d.o.g": "The representation! The inspiration! The goddess vibes!🙌💕", "shaeeebabyyy": "♥️♥️♥️ This made me feel some type of way. Thank you 🙏🏾", "tatiannatarot\nVerified": "Verified", "tashahnicole": "Shout 👏🏾 out 👏🏾 to 👏🏾us 👏🏾", "oldassteens": "😍😍😍😍", "allisonsabrie": "QUEEN", "mooroosoo": "Thank yooooouuuuu!!! I cannot get a smooth bikini shave to save my life- the massive amount of dark curly coarse hair refuses to be tamed!!! 👏🏼", "half.queen": "YESSSSSSS👏🏽👏🏽👏🏽", "existentialcrisistime": "Yes! Also I respect your switch from \"womxn and femmes\" to \"women and non-binary folks\" 💗", "hello.allyparks": "thank you for this post & for the amendment 💕", "zoecrook_": "@Lucy iswells 🙌🙌🙌 for so many reasons", "erika_m_sharpe": "Thank you for sharing this picture and this message. Also wow your body is incredibly sexy😭", "leilsbee": "@isabelladabaja", "root2crownwellness": "🙌🙌🙌🔥🔥🔥", "beelauren________": "Yes. Never waxing again. My body says no.", "nominoractress_aishalove": "@naturallyyousa", "misslady700": "Thank you!", "blissfulstupor": "Yeeess, I love thiiis! 👏🏾", "iammatildacarroll": "This picture is EVERTYTHING 👑❤️💋🌹", "monaalkhelewi": "❤️🙌🏽", "bpjsnaps": "That don’t look 4C me imma DM you a photo 🤣 (I’m kidding)", "babydastarzshyne": "Thank you,its about time. Black women are often shamed for their body hair. This is the very post I've seen on the issue", "evelyyyngla": "I never felt accepted with all of my crazy pubes, thank you for freeing me more and more", "theblossominglotus_": "Love this 1000x", "fullspecdoula": "💯", "avaroche": "Beautiful💖", "vhitcious.marie": "My partner lovesssss this look on me.he thinks it’s adorable. Pubs hanging out my panties esp granny panties", "nuance_by_chantenicole": "Yesssss!!!!👏🏾👏🏾👏🏾👏🏾", "sunshine_da_hippie": "❤️🙌", "thoke_s": "✊🏽🙌🏽👊🏽", "grumpybumblebee": "🔥🔥🔥", "dulclinn": "@_milllyy", "uptown_vision": "🖤🙌🏾", "sistersprouse": "🔥🔥🔥🔥🔥🙌", "simpleliving13": "Yassss. Love this!!", "kalimaamilak": "GIVE THANKS 🙏🏾", "keeepherwild": "Thank you 🙏 💜", "bandykiki": "🙌", "cee.vibez": "I needed this today while browsing bathing suits. Doesn’t matter what type of method I use for hair removal, the bumps and ingrowns have a mind of they own ~", "joybelou": "💖💖💖🖤🖤🖤", "joceheardlynn": "Thank you 🖤", "sirius.visuals": "🔥🔥🔥🔥", "caseyberard": "Oh gosh! I have played with these ideas for years and they continue to evolve... the freedom to accept that process touches me most in your well thought out words!", "golden_owl_222": "@spiritualhello I love this!", "k_rockcafe": "💛💛💛", "maria_krzeminska": "I have no 4c hair obviously. But I had so many ingrown hairs too! I stopped torturing myself and let my fluff grow! No more pain, and more gain! Every woman should be able to make a choice to shave or not!🙌", "nabilasawakeningdream": "Though I’ve dated mostly women, perhaps due to grooming etc, I never really knew what was meant by ‘bikini line’. I thought it was maybe like a stray few hairs here and there because that’s all I ever got and all I ever saw. Now dating my current girlfriend, she’s pointed out her own pubic hair growth and been more comfortable around me with it. I finally saw what was meant by ‘bikini line’ for the first time a couple weeks ago. I legitimately said to her, “is this what you meant? I’m so fascinated”. I find it so crazy I’m turning 30 and I never knew. But how would I if I’d never seen it before? So, thank you for putting this picture out there and taking steps to normalising body hair (and ALL kinds of it). ✨", "ennazussti": "OBSESSED WITH THIS", "femininenaturefrequency": "👏🏿👏🏿👏🏿", "corabethbs": "Love and appreciate how you amended your language and notified us of the change in the caption. Now more people like myself can keep this in mind in the future as well!", "laughinggoddessapothecary": "Beautifully on point! 👏🏿👏🏿", "tatiananbodner": "So refreshing to see this VISIBLE acceptance!! Dark, coarse, ingrown- its all beautiful!! Where was this post when I was 15 and crying over my belly hair!!", "shadowworktarot": "This gives me life! Thank you for this representation!🥰💕", "badonkydonk85": "@wise_wombman ❤️", "flynnrainbows": "Yesss thank you for this!", "graci_maikai": "🙌🙌🙌", "_weights_n_cakes_": "🙌🙌🙌🙌🙌🙌", "haather": "Thank you so much for addressing this I always talk about this to people! 💜", "axa_annice": "♥️♥️♥️♥️♥️", "kuwilileni": "👏🏿👏🏿👏🏿👏🏿👏🏿", "aubreynrhodes": "Fuck yes this.", "itslovegravy": "Beautiful", "diamyngirl4": "Thank you 💕", "scusi_queen": "👏🏽Where are all the mustaches, long, coarse chin whiskers, and wiry nipple hairs tho! I wanna see em!", "federal_flashes": "Yaaaas", "rikamia": "Love this!!", "tierrajai__": "❤️❤️", "4ever_postpartum": "🙌🏽🙌🏽🙌🏽", "inmyevolution": "✊🏾✊🏾✊🏾", "cavesoil": "I love natural body hair on women, the self confidence is very attractive.", "moonofferings": "🙏🙏🙏❤️", "zoemailena": "Thank you!! Love love love 🖤💗🖤💗🖤💗", "sprishy": "💗💗", "aliciaann.venditti": "Yes. My Italian hair is not pretty, fine and fluffy. LOL", "bluescastle": "@dra._contreras klk", "diorela": "I was just thi king about this walking into a sauna of a sports complex in Finland! Me, a whiteish Mexican with hair as thick and dark as can be, in a room filled with transparent women with hair so thin they don't even have to shave. I have been trying to embrace my body hair but... In those situations it is so fucking hard! Like it is so easy for this people to embrace body hair when the images of beauty are ment to fit their bodies! 🙄 Nothing agaits them just, every time I hear someone like this say \"I stopped shaving\" I'm like... When, yesterday ? It's so easy for you... Anyway, what I meant to say is THANK YOU FOR THIS ❤️", "lenakaplinsky": "I love you. Thank you for making me feel feminine, sexy and confident❤️🙏🏻", "formosa.exe": "HELL YES 🔥💖", "trelani_michelle": "Thank you. Love, a 4c", "themexicanwitch": "So important!!! 😘😘", "tsfd": "“Shaved women collaborators, shaved women, are they traitors?” -eve libertine, crass", "drgabbyjorita": "This is so important. Thank you!", "gopiepointe": "Yes!!! This got me. I struggle with ingrown hair, and not feeling sexy down there because of it. Especially because I’m a dancer and costumes are not always forgiving. I’m learning to love my body and show it off because it is my first home. ❤️", "st3phmarie": "Thank you for this! 🙏🏻 I am definitely one of the coarse haired babes! Letting go of the shame ❤️", "theonevan3ssa": "❤❤", "itstracyg\nVerified": "Verified", "iam_preena": "This right here, truly.. there is no representation that I’ve seen until your post.. thank you for having the courage to show yourself, it supports me in ways you can’t even imagine.", "represent_editorial": "I always thought my hair was unattractive even though my partner swore it isn't. But seeing this photo shows me what he sees and it's beautiful. Thanks for being out there leading the way to greater body positivity!", "writer.syd": "🙏🏾💜🙏🏾", "anima.chiara": "I LOVE THIS!!! Thank you!!!! 🙏🏾🙏🏾🙏🏾🙏🏾", "moonlight_hirani": "@angittt ☺️💕", "leeshahboo": "I love this ❤️", "pricelys": "Fuck yes.", "ericacfraser": "Thank you for this ❤️", "mx.jvn": "4c pubes and waistbeads!!!!! yes this is so affirming!!!!!!", "iamsimonej_": "The authenticity! 🙌🙏💖", "squidviciousss": "Growing up I was always so ashamed of my pubes because it looked nothing like my friends. Theirs we're less thick and coarse, and stayed only on their v area while mine gree down my legs and up my tummy. I ended up shaving it for years until one night in college I forgot to shave and ended up going up with a boy who was disgusted by my pubes. I have not shaved them since :)", "_savini": "👏👏 I’ve never had my type of pubes represented and you fucking did that 🙏🙏", "jazminelovine": "Yes I love this. And appreciate you so much!", "thecannabisdoula": "🙌🏾", "karettafnfowler": "♥️♥️♥️", "lauraaiisha": "Yes Mami!!!!", "minaminers": "Yessssssssssss 👏🏾👏🏾", "siggi.pd": "Y E S 💪🏼 🌟🌟🌟🎉", "indi.maat": "real 💯", "de_lightfoot": "What you’re doing and being is powerful beyond measure, am so sincerely grateful to have fallen in to your orbit ✨", "mraybaybay": "HERE. FOR. THIS. 🎉🎉🎉", "nancy.konjo": "❤️", "thesunnypage": "PREACH 🙌", "afrocannaqueen": "Thank you so much for this 🙏🏾", "spiritualchameleon": "Ooooo yessss girl!!!! 👏🏼👏🏼🙌🏼🙌🏼🤤🤤🤤🤤", "short_yellow_bus_window_licker": "Well said ❤️", "bekah\nVerified": "Verified", "_omegad": "Yaaaaaaaas queen!! 🙏🏾🙏🏾", "herfullynaked": "😩 I see you love 🙌🏽💯💜💜💜", "lifeoflindura": "It was and is still a tough journey for me, but I love my natural more and more everyday :) thanks for sharing!", "no1neechee": "❤️🙏🏼", "jazzzyjay": "👏🏽👏🏽👏🏽", "khawkinsjohnson": "Looooove this. 4c body hair is rarely seen in any media and this post just RESONATED! THANK YOU.", "kalah.hill": "YES!! 👏🏽👏🏽👏🏽", "nunusvybz": "!!!!!!!!!!!!!!!!!!", "jeanetteleblanc": "Fuck yeah.", "brianaboldin": "\"With razor bumps and ingrown lumps from strands that coil into themselves, and the body hair so dark and defiant that it refuses to be hidden or tamed\"... I may look quite fair but my body hair is NOT. Reading this all today made me feel more normal and beautiful than ever. Thank you for all that you share 💕", "leeleewilma": "THX U 🖤✨", "chopchopstab": "Yes with the 4c pubes 💅🏾", "instabellagramman": "You're positively divine!! Thank you for being you", "thejourneyofjessica": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽 T H I S.", "lanecia_sucia": "🖤🖤🖤", "plantdaddy666": "😍", "they.them.ryse": "I’m sooooooo here for this!!!", "alillyriver": "I love this ahhh💓", "jus_whitt": "❤️🤩 thank you for this", "ninawithdanina": "💗💗", "marieannesirois": "👏🏻👏🏻👏🏻", "theamonyee": "Life...given....🙌🏾❤️", "uniquenecessity": "I won't lie this pic caught me off guard. Which really just proves the point 🔥", "janashareswithyou": "I find pubes erotic 🤷🏻‍♀️ as long as they’re tamed 😂", "ashleykatina": "Wow this is great and I feel SEEN! Thanks for sharing ✨✨", "julie_mako": "Thank you thank you thank you ❤️", "nikiknowsbetter": "You are so important", "rebelrebel1776": "You forgot thin bodies.", "veeteegee": "Yes. Ev’yan. Thank you 🙏🏾", "tattooedmamawolf": "🔥🔥🔥🙌🏽 From an Arab/African/Italian, thank you!!! ❤️", "hercoloredworld": "✨✨✨ xo, a brown woman with that dark + defiant hair that refuses to be hidden or tamed 🙌", "residualvisuals": "🙌 get it ladies, love it", "ana_____italiangurl_23": "🙌", "cees_c": "❤️ Natural", "thechakrawitch_": "YAS Queen 💓👏🏼🙌🏼", "sheroldbarr": "Gorgeous you!", "rayehasen__": "Rep for us then 🙌🏽✨", "the_anomolee": "😍😍😍😍😍😍", "cquinnceyoga": "Yassss!!! 🙌💕💪🏽", "onhermat": "🙌🏾🙌🏾", "katrinamarieski": "♥️ I’ve been embracing my bushy beaver for about 6 months now. I feel so much more feminine whenever my pubes tickle my inner thighs.", "calikels": "Love this💜", "africabrooke": "Fellow 4c puber hereeee!😍 LOVE THIS & YOU!❤️", "kate_davey222": "You are wonderful❤️", "beautty_queenn_": "👏🏽👏🏽👏🏽🙌🏽🙌🏽 Thank you for guiding the way", "johnnarock": "Thank you for saying this.", "iamrachelricketts": "🙌🏾🙌🏾🙌🏾", "binary_1x": "I'd still go down on you", "aurasalchemy": "♥️", "musamoon": "Thank You for your freedom 💛", "vagesteem": "CHILLEEEEE!! I needed that 😂 I say that my pubes are the physical embodiment the word “zoinks!” Because of how “unruly” the hair is. Thank you for sharing! ❤️", "skinalways": "Beautiful message. 🙏🏼❤️ Love your body not standards that make you feel bad about loving yourself There are products you can use to help ease the discomfort of ingrown hairs!!", "aftl___": "Thankyouthankyou for this. 💙", "venee_mcgee": "Thank you ✨🙏🏽 I’m light skin but have the darkest hairs!!!", "wildfire_within": "YES", "pmiller1987": "😘😍", "mandamandalouise": "This is me, thick pubes... nightmare d", "unruly_awuor": "🙏🏽🙏🏽🙏🏽✨✨✨", "aquariusanswering": "🌳 + 🌹= 🖤🤗", "goddesssteph92": "🥰🌹", "alter.eros.healing": "Yes!!! 👏 Thank you for pointing this out. As a white woman, I often fail to notice this because I’m so often portrayed. Thank you for the opportunity to recognize my privilege and to have more awareness of inclusivity.", "nythalia.a": "Thank you so much for this!❤️", "afrolatina_": "“With razor bumps and ingrown lumps from strands that coil into themselves” 💕 we are here, thank you for seeing us", "joydivisionmackie": "Shout out to the \"unruly\" bush.", "herbnhood": "Gorgeous! 💓", "dreamslikedeserts": "MAMAAA 👏👏👏👏👏", "heyyyloe": "🙌🏾", "slugfaerie": "Wow . 🧡", "aydegray": "🙌", "aiyanasage": "YES SIS! 👏🏼👏🏼👏🏼", "shoot4profit": "Womb Wisdom", "you_matter_ms": "@evyan.whitney I’m going to comment on this as a straight man, living in the US. There is nothing more sexy and powerful than a woman who embraces her femininity. No matter how she chooses to do that. No hair, a lot or somewhere in between. Somewhere along the way that got lost in our culture over certain expectations. Ladies, be you. Whom ever that may be. ❤️", "alexandriathibodeaux": "You are sensational", "foxgloveinthegutter": "👏🏽👏🏽👏🏽💓", "sexandempathy": "Thank you!! It's so true that you start getting used to the \"same\" type of deviation and resistance. This picture is striking! As it should be!", "theolivetreesandthemoon": "Oh my gosh YES!!!! Finally someone says this ❤️ so important to normalize different body hair - this coming from someone who until her late teens thought was so unattractive / so different because my thick curly hair didn't look like any of my friends' ❤️", "_xhoneybrwn": "👌🏾", "mooreamasa\nVerified": "Verified", "spndyl": "thank you for this 🙏🏽", "baldheadedbeautyafh": "I don’t agree at all BUT I respect women that do it and don’t believe in bashing women that do....", "sxnoir": "4c pubes are everything ❤️", "liquidnowledge": "THANK YOU FOR THIS! #representationmatters you are so beautiful and inspiring I'm so grateful for your essence and way of showing up in this world", "mercedesrice": "THANK YOU SO MUCH!!! ⚡️⚡️⚡️", "thewildsapiens": "🙌🙌🙌🙌", "ericaquartz444": "Yes!♥️", "ivefoundu": "👏👏👏👏!!! Thank you dear.", "ostrowskijulie": "❤️❤️❤️", "___chocolate.goddess___": "I love you so much for this", "jessahphotography": "😍👏💖💕", "lydiahenriettao": "🙌🏾", "yogaflower_t": "yes yes yes fucking Queen. Thank you.", "eyeofshamia": "this post snatched my wig, grew my edges, cleared my skin, and made me prosperous. 🙌🏾", "thephotographerscorner": "❤️❤️❤️", "midoryaxyoshi": "Yes to 4C pubes. Yes gyal 🙌🏽🙌🏽", "erynamelism": "Meeee😢👑", "woman1sh_intuition": "👊🏾👑💕", "alldeanna\nVerified": "Verified", "kristinannehm": "This made me so happy ❤️", "thepiscesinme": "You arw so awesome 😊", "analelisa_": "This is all that I belive as resilience!!", "norwoodk41": "🙌🙌🙌🙌🙌🙌🙌🙌❤️", "taino_women_": "YOU BEAUTIFUL BEAUTIFUL BEE 💛🐝, thank you so much for your wondrous influence and inspiration!!!", "namokobe": "So here for this!!", "mrsmegalomaniac": "Thanks that people exist. Those talks are in general always very theoretical - all those stars and models and instagram figures talking about body positivity but then using tons of make up, photo shop and shaving their whole body to fit the bias of a \"proper woman\" is insane. Truth is, people can not handle it when women and men go against the bias and gender stereotypes, out of fear that the order of their stereotype lifes will be out of balance. You will not see a picture like that in a magazin - in the vogue or on their models. You will hardly ever see a woman that just has her hair maintained instead of removed. So thanks!", "purfectsloth": "I love your body positivity! You have been such an inspiration to me since the day I discovered your podcast! 👏🏽💖", "very.freaky": "❣️❣️❣️✨", "uni.tia": "♥️", "shortcake.xoxo": "I have a very robust bush, but I'm scared if I try to post, I'll get reported 😿 Thank you for sharing xoxo", "missdarius": "SAY THIS LOUDER FOR THOSE IN THE BACK SEATS!!🙌🏽🙌🏽👏🏽👏🏽👏🏽", "soulsteadkitchen": "I feel so seen", "from.the_earth": "Thank you 🙏✨🙌", "rahisuryawanshi": "Yassss 👏🏽 I LOVE YOU. ♥️♥️♥️", "sarlejeffries": "🖤", "lovelifemarlak": "♥️✊🏽👏🏽👏🏽👏🏽👏🏽 I’ve got a thick dark wired Bush. I’m so happy to see this and feel ok about myself after reading this !! 👏🏽♥️♥️♥️", "shybuttiefly99": "❤️🌹", "oyabunmi": "Freedom!🙌🏾🙌🏾🙌🏾", "wearethewildwmn": "Love !", "awakeninganahata": "Beauty❤️", "kiarrah___": "Mines look exactly like this . Thank you ❤️", "kristinadelphi": "Thank you for this. Signed, a Greek woman.", "momma_lasko": "I’ve been trying to type something meaningful and coherent, and it’s not happening. So let me just say this brought a tear to my eyes and a “hell yes!” to my lips ❤️", "brandithegoddess": "👏🏽🙌🏽😍"}