{"nightdances": "@mouseymcg @magdalenatheiahope", "thelovelylia": "This is amazing, SO excited for you!!! 😃😍💖🙌🤘💗", "sarahkpeck": "@empowermentphotographer I assume you’ve seen this but if not you would love it!", "shansmell": "@shdavis5 😫 I wish this was during your Bach party!!", "ebonyjanice": "OSB!!!!!", "ceragohellahard": "i want to contribute to the raffle! dm'd you", "lifebyolivia": "Omg this sounds so fantastic! Cheering you on from toronto!", "hellolaurenash": "the day I move to LA, wow! 🌹 i’ll be keynote-ing at @thegodyssey launch event but will be in both places in spirit ✨ congrats this sounds lovely.", "fro__real": "@vanessa_cuccia bring this to nycccccc", "imchloewest": "@emmagingerrogers I live in the wrong part of the country 😭", "beccamurrayphoto": "Purchased! Stoked for this ✨", "redefiningsobriety": "@cjust will you be in LA those dates? This would be amazing!", "crystalisthelastunicorn": "@strawberryglitterhead hmmmmm", "drfrantonia": "ROAD TRIP 🚗", "lalaurenmarie": "@magmadness we should do this 💞", "goodfood_mb": "OMFG! This is so dope. If you ever want to bring this beautiful work to CLT. Im down to collab! ✌🏾&❤️", "lalaamorena": "So dope! Do you know how I can find events like this in Chicago?", "elisgee": "Will y’all be realizing more tier 2 tickets? 🙏🏽 @chakrubs", "iamarikalu": "Come to London 🙏🏾", "jillianbadel": "This looks amazing. Too bad im busy this day :(", "wholelivinglosangeles": "@megala_in_la_ala not for me right now but this sounds like something you would like !!", "selvabio": "@rosiebaidenreid !! (It's aya btw) 😁💕", "herfullynaked": "I just want to say as I’m scrolling through your page, I appreciate your existence 💕", "katerinovaaa": "Hi people❤️ there is an account that posts women’s sensual selfies (without consent) & publicly shames them for taking them. (Calling them cheap whores) Can we please report them? The @ is instahastagk If you can’t find it they r tagged in my story.", "ana_____italiangurl_23": "so pretty ✨✨ wish go love efucation xo", "urlocalnymphet": "Wow the EXACT day I’m getting on the plane to go to LA 😭", "huitzilopochtli0": "@evyan.whitney Can we have an event in the BAY?! ❣️🔥", "theconsciousmama": "@c3.orgasm", "phiopur": "looks cool", "super_awesome_babe": "Yesss girl! 🔥", "hoytcr": "This sounds amazing. Come to St. Louis!!", "chakrubs": "Can’t wait for this magic 💕✨🔮", "theunrootedartist": "😩😩😩 Do it on IG live! I’m on the East Coast", "melanie.blooms": "Amazing!! I love what this event is about. I take sensual selfies for myself and it is really liberating and I know exactly what you mean by “celebrating your sexuality”. It means more to me now that I do it for myself rather than for someone else. Thanks for doing what you do! I support it 💓", "alexisehrlich": "@macncheezybeezy @maddigallegos", "m.a.d.d.o.g": "Do you have a coupon partnering with them? I’m quite far from LA and wouldn’t be able to attend, but I’d love to support you in another way!💖", "tarotviews": "Can’t wait to meet you! 💕😘", "okaraimani": "Ahhhh so close I'll be in town like a week afterwards 😫😭 lol", "short_yellow_bus_window_licker": "Have fun ❤️", "innyvinny": "UGH!! I’ll be in Portland that weekend. 😫", "kocomeow": "🙌🏾🙌🏾🙌🏾", "afarmfox": "Congratulations! ❤️", "che.che.luna": "Yes yes yes!!! ❤️❤️❤️", "sexandthestudio": "This sounds incredible!!! Please bring this to Chicago 😍", "tripp_y": "@k.lex.b", "luminous_dew": "go you!! awesome", "galadarling\nVerified": "Verified", "howcomevanna": "Yay!", "avilucea": "This is amazing!! ✨😭😱 Do you plan to host an event like this in the Bay Area?", "tatianadellepiane": "This sounds like so much fun. Hope you come to NY next. Love Vanessa."}