{"saaketvarma": "What do you practice today? If you complain, u will become and expert in that, practice... solutions!!!", "karan.joshi2207": "Third class actor with third class sadak chaap buddhi", "arnavkumavat": "Galat information logo me spread karne tum jaise chutiye celebs ka hi kaam hota hai !!!", "daksh_bhandari.007": "Are ye propoganda to paid lgta h", "saloni_kr_": "Proud of you🙌", "nishant.sharma.319": "Gadhi", "volnado": "Bakwas .. kuch pta bhi hai .. muslims can get refuge through pre existing law .... its an amendment to make the process faster for non muslims .. matlab bolne se matlab 👏👏😂", "thenameisrishav": "You should focus on getting films rather than using your brain", "j.amolvijay": "Tumare jaisi chutiye celebrity hi wrong info spread karti hey, aur minority minority karke desh me bawal karti hey. Minority chutiyappa karti hey tab bhi awaz utana chahiye. Hypocrite", "krati.bhargava": "Are you really that stupid.", "apoorvakumar22": "And think clearly and consider all the aspects and factors", "prabhat_singh20": "Hahaha....u only see one side of the story....and that's the most problematic this u all posses ....", "praaviofficial": "🤣🤣🤣", "hira.edhi": "Lots of love from Pakistan. Glad to see a number of sensible minds speaking up for humanity", "niveditasagar": "Ain't expected that u r so uneducated.I really genuinely feel sorry about you.that You don't know the historical background of Assam, 1971.Only birth certificate is enough.If you are really against of it than pay the loss of money caused by peacefull protestor.Being against of them means Supporting the Crime on minorities affected by The Islamic country.You are super rich women Have the Excluded Muslim family in your own house.Jai hind🙏", "himanshu_sanjay_jambhale": "I am in support of #CAA & #NRC..", "gandhim114": "Nahi chalega tera rona dhona....tereko jaana hai toh tu bhi nikal...samji ....document nahi hai ye kaise chlega....desh hai kabaad khaana nahi...bhaag yaha se", "iamakshaysharma_tonu": "Thank you for your sharing wrong information, your credibility and trust towards India is justified. By sidelining NRC, you are questioning national security as well as giving hope to millions of illegal immigrants(prone terrorists). Just a quick fact: when NRC exercise and it will definitely happen, the government officials will come to your address and request for documents also there are several information regarding NRC you have misled about. I suggest you do a good reading clarifying all the facts first and not believing in Social media pages information. Although you are from bollywood, we can’t expect much from you. Jai Hind. 🤗", "amitkashyap_": "@radhikaofficial Koch paiso ke liye ye post Kar Diya isse acha toh dhandha Kar leti", "_.akkey._": "Where did you see detention camps building?", "rnileshs": "You hate Modi and Shah, We hate refugees. Simple not either we assimilated such a deep subjects", "_k_night_rider_": "Kitne paise mile ek post ke", "misterwhite39": "is GULAAMI se khush hokar dawood ne big banner ki agli 5 films madam ki dilwadi 😂😂", "princewhoslays": "You have spine! Respect 😍", "akshay_dagaa": "अधूरा ज्ञान !!????", "amythkumarr": "The shared doc is misleading", "abhishek__notorious": "Ghantaa", "prateekjain1912": "Full sympathy with ur IQ.. Bhagwaan sadhbuddhi de ki kuchh books padho n kuchh knowledge ghuse aapki moti buddhi me 🙏🙏", "themarchbuoy": "Seems like you are one illiterate who doesn't have common sense to read the act first.. i know , you get your work opposing this kinda stuff because if you support you will stop getting work. People like you are Rahul Gandhis bootlicker who pays and ask for his support.", "mondeep_bayan": "Thank you for speaking up. Love ❤", "anandsharma_14": "Poor stuff", "khaitananuj": "There are more than 100 Islamic countries in the world but not a Hindu nation.Where do you expect these Hindus to go??Muslims migrating from Pakistan, Afghanistan or Bangladesh are not religiously persecuted as bcoz they are already Islamic nations.In past also citizenships has been provided to tamils,parsees and other people.Do why the hue and cry now??", "__akansha.singh__": "Oh god!! So so so so wrong. Cant believe these are the people we gave power to influence the masses. The least that they cud hav done is a lil research. 😶😶😶😶", "ravindradhakad": "😂", "__son_of_ibrahim_": "💯💯", "rajpootgirl05_": "U should get knowledge about CAA and NRC ..", "satapathy.sukanya": "It's shameful when a known actress like you used to post such things without knowing anything... Kindly get proper knowledge about CAB and then post🤣", "vruuushh": "Unfollwing", "tarangini.shetty": "@radhikaofficial if you are really concerned, then stop predicting what govt is going do next. You are spreading falls info to ppl. You are telling as if you know what the government has decided on NRC for the country. Why instigating ppl to protest for something which has not come into action. Wait NRC has not yet come. If you see problems when it comes then let ppl decide if thy r ok or against it. DONT INSTIGATE PPL for false predictions. Least expected from you.", "tuhin.mitra": "@radhikaofficial aunty, tell me why you shouldn't be jailed for inciting violence.", "moushona18": "Good that you are taking a stand whereas other celebrities are pretending business as usual.", "aisha.pervez": "Thank you for speaking up! ❤️", "vyvarma": "Please do not spread false information.....go through the act", "thevirgomommy": "This is bullshit!! Please read the gazetted document before spreading misinformation!!! When you are influencer you should be well informed before spreading wrong information and fake assumptions!!!!", "disharth_gujarati": "Secularrisam ki ma ka bhosda", "purushottam.guptron": "Ek to jisko pata h ye bill kya h wo puch bethe h aur jinko knowledge nahi h sirf suni sunai bat ko sun kr confusions create kr rahe h aur rumor felaye ja rahe h i really don't know why they oppose it are they getting money from some specific political party or may be lack of knowledge", "sll6774": "His sound is upscale🖤🖤🎵🎵🤺🤺@azoz7245", "isitmohit": "Paymnt chq se liya tha ya cash 😂", "beingvishaltomar": "Lol😂 bloody idiot bullshit😂", "buthulz": "Proud of you for speaking up", "azizchaki": "Respect @radhikaofficial that you have shared this fact!", "panikeranish": "Chii ek toh iski shakal Tatti aur uski batein bhi Tatti.. Tu sirf Tatti kar💩💩😖😖", "im_dipenn": "Understand the difference between refugees and infiltrators.", "iam_peshal": "दीदी आपको कितने रुपए मिले ऎसी पोस्ट के लिए नहीं सही है मुंबई बहुत महँगा है ना बॉलीवुड go to hell", "_anushkathapa_": "Are Didi act to padho pehle sahi se👏", "rajdhani_2110": "Understand it before posting... Kindly read laws and then provide your argument how it falls on the face of it!", "tshiva9415": "you should have a proper news about this madame NRC at present is only active in Assam for which you can also show your Adhar your voter ID and even driving Licsence if you are not able to show some documents of 1971 so now only those can not show these papers also who are not the citizens of India..NRC is about the securing our citizens only by throwing out the illegal refugees out of the country And CAA is about giving asylum to those minority of Bangladesh Pakistan and Afganistan....And for your kind information NRC is not active in whole country till now the government is only saying that it will be active someday....", "young._.entrepreneurs": "You took stand.. Respect🙏", "kr_akay": "Tho mdm agar koi terriorst aatack yaha koi apko goli marke chla jaye tho plz govt ko blame mt Krna ki bahar se aaye log marke chle gaye", "himanshuharne115": "Offh bollywood mai inko script samaj nahi aati yaha NRC CAA jaise national issue security ke liye samaj aate hai", "singh.rajvardhan.21": "Your job is to act not to spread these false news nd rumours", "rajputumed1": "Stop your foolish and baseless predictions.Stop misleading people of our country .You should be ashamed of what you are doing.", "tanisshhh": "Arey didi aisa kuch nai h", "sharathkaknur": "I saw you in an ad campaign towards #roadsafety organized by#hyundai, where you had trouble to say #upbeam and #downbeam, if you don't know the terms which are used on day to day basis, which shows your intelligence on basic things, then I won't be surprised if you are not able to pick the core issues of the nation, stop following your intellectual boss and dumbass friend #anurag, and stop posting these rubbish. I know bollywood actors are dumb, you prove it.", "amansharma2321": "You are such a fool..", "lav_stagram": "How many Muslim country allow hindhus ?? Did you ever notice Pak s popultion on Hindus reduces to 2% ?? There are 47 muslim countries in the world .. why can they accept them. I have enough Muslim brothers n sisters in my country . this is not against religion !!", "wajiha_moiz": "@rehmmoiz", "indrajeetsaxena28": "Tu deshdrohi ha 🙉😠", "king_kautilya": "Just burn out your degrees all qualifications you guys have . You are educated enough and you know what's the truth but still spreading the fake news .. I don't know what's the problem with the Bollywood , you too are indians .. if you can't stand in favor of good things , just don't spread fake news .. If I were the Prime Minister, you would be in jail . Why do you have sympathy for those Muslims of Pakistan , Afghanistan & Bangladesh . @radhikaofficial", "menonrajivb": "Radhika 🌹 Thanks", "pradaxina": "You actors are indeed stupidity personified. I just can't watch bollywood movies anymore. You don't deserve to be watched.", "rajputvaishali19": "Itna accha awaj utha lete h aap toh aaiye virodh kijiye sadak pe aake.char pathar humare ghr pe bhi phekhiye. Usse sabko mil jayega barabri ka haq h naa.", "vaibhav07524": "This is our country not any dharmasala anyone coming and living without any registration you are a stupid actress why you only afraid for only Muslims not from poor Hindus how lifes are becoming hell in three Islamic countries.you only afraid for Muslim refusies how have 57 Islamic countries", "juhiazeez08": "Respect.❤️", "sangramshirole0303": "Radhika u r also a victim of half knowledge 1- CAB - It applies only & only to the refugees coming to India who are facing problem of racism, no jobs because of their religion in these 3 countries and this act is in place since 1950’s but never implemented. These people have written several letter to Indian PM’s but no one acted on it. Muslims don’t want to come to India from these countries because they are a majority there and not facing any racial issues there.  2- NRC - The government has confirmed Only 2 things about this bill this bill :- - Citizen Registration will document based and not religion based (It’s an NON RELIGION BASED REGISTRATION) -Government will not implement it as it was done in Assam as they found out that was not done in correct manner, rather they are working of making it very simple. Rest all what people are saying about these bills are untrue and are not confirmed by the Government of India Also there is a rumour that all the Muslims who will not have sufficient documents will be sent to refugee Camps is all False news, Government has not said anything like this only the so called Experts/Journalists/Socialites are expressing their half knowledge", "the_dark_muse": "How would someone who considers Hindutvavadi soch as soul of India, would understand the real matter!", "drtinanath": "Dear @radhikaofficial , I am from Assam. I request you not to put up these posts without proper knowledge about the Anti CAA protest and NRC in Assam. It is quite opposite to the situation elsewhere in the country. I hope you don't mind.", "chirag____9": "Mindless people spotted😂", "mehra.manish83": "To whom we should not allow to stay india...or to whom we shld allow..to give them the jobs,aids and shelter from tax payers money", "khushi_vp": "abe chal pagal pehle knowledge rkh puri fr bolio .", "anuragkulkarni.fs": "Shame on you", "itsmesaiqa": "@radhikaofficial I absolutely commend you for putting this up. Most actors are scared of expressing their views as they do not want to be seen as Muslim sympathisers and their patriotism will be called into question.", "shlok__52": "Poor people don't have documents but the people who are born in India their name are already registered in government documents.", "perksofbeingmuslima": "Thank you for standing in solidarity with all of us", "ethnicearsstore": "😭😭😭", "dwarftraveller": "अग बाई तू तेव्हा कुठे होतीस जेव्हा अमर जवान ज्योती वर रोहिग्यने त्याची तोड फोड केली आणि मुंबई लेडी पोलिस वर हात उचले होते तेवहा झोपा काढत होती i support #CABbill #caa #nrc #vandemataram", "akashgautam2666": "They are anti national", "mohitraj.singh.338": "NRC should be implemented so that all illegal immigrants who are enjoying national benefits with contributing anything to the national interest should be sent back to there country.", "vihan.agarwal_chunu": "NRC aayaa nahi hai laakin aayai gaa", "vishakha_paliwal": "Detention camps ki photo bhi share kar do you saw it already", "krishnapriyarkg": "If u don't know the facts then shut the fuck up people like u are the biggest problem of this country , if u don't understand something then keep it that way ok please don't mislead this country atleast u can do that idiots hamara kaatha haai aur hami pe uulti kar ta hai", "anupriya2696": "Kashmiri pandito k bare me bolne k time kyun secular India ka paath nahi padhate ho tumlog", "rishav4869": "Jo karna hai kar lo we support CAA NCR 🖕", "devvratsh": "Chutiye ki patthi. Assam m already immigrants zada hi h from Bangladesh and Pakistan. Jo indira ne 71 k baad wha Basae the", "bornstubborn7891": "Unfollowed", "shah____jinal": "U look only good in bikinis.. Don't involve in politics.. Or else u might be the next one who's getting raped and then be in a line for justice which you or no one else get now a days in these government", "tushar_saxena250": "Ok so you know what NRC bill will be for India? Time travel?", "u6aidd.37": "Guts he mam apme Hats off to u @radhikaofficial", "arjun_rjune": "And what's bothering you?? Awards or money?? Inda is for indians. Liberals step back..", "parvesh_katira": "U r providing false info madam, muslims also can take citizenship, this is an ammendment, they have not scrapped old bill", "sunshinemoonlight12112": "@radhikaofficial you got it wrong. It states that eg: If a Hindu, Sikh, Christian (who are actually still living in Pakistan as a second grade citizen) seek asylum in India they will be granted as they are minority in the Islamic State of Pakistan. Muslims coming from Pakistan and Bangladesh leaving their country seeking asylum being from a Islamic state does add up to refugee status. Refugee is a person who has been forced to leave their country in order to escape war, persecution.", "shivam.audioslave": "Assumption 1 : poor people ka documents nai milega ( poor people ka documents are much more comprehensive than a normal working middle-class since they depend on it day in day out). Assumption 2 : document nai milega usko desh see Bahar bhej denge ( kaise? Deportation law? Sabko nai par musclims ko zaroor bhej denge?). Assumption 3 : Trivedi ( non musclims)Bach jayega ( agar plan he hai sare Muslims ko Bahar nikalne ka to CAA ho ya NRC ya koi aur combination ...natak se Kya hoga...waise he nikal denge which is impossible in Indian democracy...) So ye Sab bekar ke assumptions share karna band Karo...... One India ... Hindu musclims are brothers......", "_.humerah": "This is going hilarious!! 😤", "partha.saha.986": "I think you misinformed.....1st of all it will give citizenship to illegal persecuted minorities...2nd poor also have documents,if they don't they can ask govt official like BDO office, panchayat etc.....3rd detention center proposed by Assam high court not govt.", "ritikapandit622": "Chutiya kahiki..tmlog ki vjh s aur hinsa ho rha..mc", "rasika10joshi": "@radhikaofficial I request you not to spread false information as it adds fuel to the already gigantic fire of unrest, uncertainty and religious propaganda of some politicians. You are a public figure act responsible. I urge you to also tell this to your peers and people in your fraternity as Bollywood in India has an unreal hold on people's minds....and with incorrect and half information our youth will destroy the their future and with it our country's too.", "ayankhan_25": "people supporting cab are the same people who once believe new Rs 2000 note has microchip which can be detected by satellite. don't argue with them, these are innocent souls😂😂", "deadd_pull": "That doesn't mean you should attack the police", "mituldwivedi": "Wah bc duffer !!!! Arre pagal aurat ye bill bahar se jo aayega pareshaan hoke 3 countries se jaha pe minorities ka rape ho raha hai dharam parivartan ho raha hai vo logg ke liye hai!!!! Jo India me already hai vo logg se koi citizenship nahi le raha !!!! Kya noob hai re @radhikaofficial", "priyashaanaayan": "Dumbest woman ever.", "subani_najumudeen": "Wow finally some celebrity spoke about this", "mervbolt": "Proud of you!!", "randhir_jha": "Or it may be possible that if thet failed only their voting rights been taken and they can work on working visa like most people go abroad does. Why your hypothetical is possible NRC bill is not even draft and you started this propaganda. If it's unconstitutional please wait for Supreme court decision.", "r.u.p.i.n_v.a.r.m.a": "You have documents? You wont be declared as a refugee , and mam we respect you, so please dont make these assumptions or false testimonies viral. Ik you are liberal in thinking, extrovert on speaking but that doesn't mean that the government of India which had a clear mandate , is taking pain on purpose to divide the nation . More learned, and experienced bureaucracy stand behind the laws made by the gov. Please dont fuel and replenish the vested interests of other political parties. Please, atleast if you can show solidarity for JMI students , then you should also stand with the Police personnela as well", "mohit_anand_123": "Bitch", "ritwik951": "Madam Kbhi himmat ho to 1947 ka division justice pdh Lena Ye sb Faltu gyan batna chhod doge", "manish_patil65": "People like u will always add fuel in fire..", "amal____khan": "@soumyakamat14", "sandesh_pictures": "India is a funny country.. Lord Ram has to provide documents🤔 Illegal immigrants want a free pass😅", "shikhamaheshwari59": "#radhikaapte kindly explain NRC and CAA purpose? Many people adore you and you can't deny that somewhere people who adore you get influenced by your point of view, so don't you think it's your responsibility as a citizen + people's influencer/motivator to post about things which you know completely??", "kanha_krish_patel": "Delete this post .....", "ecoaditi": "What makes you think that what you are assuming will be the reality? You really need to look at things more clearly. when the situation is so sensitive all across the country, you could have saved this brainless post for some other day.", "khanafreen81859": "Respect u 🤗", "sona.kitna.sona": "And here Ms Apte for you :) @samarth.khurana", "love.lights.co": "My god so much misconception and assumption ! Please read the whole article and then have an opinion ! Millions follow you.. don’t just assume and post shit out your ass! This act has no effect on citizens of india. The act clearly states people who have become citizens after dec 31,2014 need to show any form of govt paper. Adhar card, pan card, birth certificate, neutralization card etc.. literally any piece of govt paper that states you are a legal citizen. What’s wrong with that? And let me also add people that don’t have the papers.. they have other solutions for the poor, once can bring a witness with them who were there in time or birth, marriage, anything that says they r citizens. And one more thing the cut off date is 1 frikkin year. U really saying people can’t find one piece of valid govt proof of their citizenship in 1 year? Then why are they even in india for so long without being legal? Letting illegal immigrants in and stay in india will cause a disaster for the future generation. Increased population, increased pollution, decrease in jobs. Overpopulation just a complete mess.", "mirrrzza_": "❤️", "milsthorn": "* required our attention.", "anshul.iitbs": "Read the CAA and new guidelines/clarifications given by Govt. You are spreading unnecessary fear.", "sha_nu___": "You are someone in bollyeood who has got some guts❤️", "asraanan": "We respect u maam.amazing🙌@radhikaofficial", "thehungryhedon": "You never disappoint ✊", "its_mr.tripathi": "We Still support CAB", "rishavks106": "Fake news...", "basagouda05": "@radhikaofficial arey o madam... zara padh tho lo kya hai...", "sweta.hersheys": "U know what ... u are also in a way responsible for all the Anti CAA protests n violence that’s happening. It’s not applicable for Indians . Don’t false spread the news", "rizwan4726": "My heart goes to you ma’am. Proud of you, a proud Indian", "gaurangpatel88": "When did u hear any pak Christian attack india? How did people who attack mumbai get in india and what was their religion?", "shalini_singh99": "Appko alag se bheja hi kya bill jisko dekho Jo mann me aara hi vo likh ke daal deraha batao inki alag se baat hui hi Amit ji se😂", "pranavjain_612": "Ofcourse you will say it. After all bollywood mein jina hai to dawood ke talwe to chaatne hi padenge. These film stars are actually spreading hate and misinformation.", "swetapatrakhudania": "Please stop provoking and misguide people", "chetan_jaiswal_1008": "Pagal hai kya 😜😜", "ua_the_creator": "Beauty without brain.... Aga bai tu neet abhyass nahi kelayes....ugaach varyala latha maru nkos @radhikaofficial do your proper research...feka feki nko karus....#isupportNRC #isupportcab", "ersandeep254": "Idiots like you should understand that these two nations were part of India before 1947 and got separate on the basis of religion. Now if the Muslims of their country are welcome here then why the country was divided. Lets come together and make a Greater India, no Pakistan no Bangladesh.", "dr_maulik": "Don't agree", "rao__bhupender": "😂", "akshay_919": "I don’t want to follow people like you @radhikaofficial who don’t respect the Governments decisions and don’t care about people who suffered a lot due to their religion in those 3 countries.", "ashishsharma217": "The CAA nowhere states that \" no muslim refugee would be given refuge in India\". Rather it states that a refugee registered for 5+1 years (non muslim) and 10 years (muslim) from pakistan, afghanistan, bangladesh (where non muslims are ethnic minorities) would be granted citizenship. Muslims would be given citizenship if they have been registered refugees under the govt of india for 10 years. Please dont post irresponsible and false facts. Unless your motive is to spread propaganda.", "an.jana4521": "Right now I un follow you radhika apte", "a_free_bird_1": "This law is for minorities and Muslims are not minorities In other country... So calm down your tits and do homework first n then post , reported this tweet.", "ss.singhsadhana87": "N madam for your kind information muslim only demanded Pakistan n Bangladesh as muslim country in year 1945 so now y they want to come back to india?", "sathwik_malnad": "What about the vandalism and violence that has been caused is that right for you. Now u won't say anything as u have no brain again", "bushu43": "#respect🙏", "shobhitaranaofficial\nVerified": "Verified", "nangia_vivek81": "True.", "khyati.sharma_": "Not at all scary.....they r already registered with indian govt...adhar card nahi hai mann liya..... But rashan card hoga...nrega ya manrega mei registration hoti or agr kuch b nhi hai toh indian nhi hein vo......", "rajivp03": "And please stop using that #studentprotest we all have been students many of us have stood in protests as well. We did neither showed our agitation with violence nor harming public properties. And always respected our nation and the our fellows.", "vsrishty": "Disgraceful statement!!!! What is about do u have any idea? Or you know only to give these types of silly statement? Its not about PM modi and his GOVERNMENT . what they are doing atleast read the CAB ONCE bcoz u r behaving like an uneducated woman mam", "peoplekapedh": "Hi just wanted to know where are these detention camps build..if it's true then this may be same as what showed in lela", "alshifaimam": "Respect❤️", "badanibhavesh": "How the Muslim people from 3 countries can be discriminated on regional basis .? ... Understand n post .don't spread propaganda", "recklessdamsel": "Exactly what happened at the time of demonetization! It was the people living below means who took the hardest blow!", "mitesh.solankii": "Why are misleading people...what are you trying to do by spreading false narratives??", "vijay_pant": "🖕🖕.....just be actress.. don't ne activist", "dinesh.lshp": "@radhikaofficial see this video. And get knwoledge like these little girls .https://www.facebook.com/1453842511589254/posts/2265501867089977/", "s_a_f_danbharia": "Proud of you , 👏 ,,celebrity like you can stand for humanity, respect for you,", "debasish_dutta07": "Stop spreading fake news and propaganda articles ,we understand your feeling of being malevolent .", "sandy005may": "इनको गरीब लोगों की चिंता है और पता भी है कि उनके पास कोई भी नागरिकता का प्रमाण नही हैं फ़िर भी ये सोसल मीडिया पर ही अपना भाषण देंगी कभी जमीनी हक़ीक़त नहीं जानेंगी और जाने भी कैसे इनके पास समय कहा है। इनलोगों को सिर्फ एक नस्ल और कौम की चिंता है बाकी गैर मुल्कों में सालो से प्रताणित हो रहे लोगों की नही।", "shruti_sharma118": "Thank you so much for sharing this. I feel there is someone out there who is willing to speak up.", "chitranjanrai": "https://youtu.be/D8FgsbyItB0", "mishravenkatesh": "I am ur big fan @radhikaofficial but please don't share anything if you not sure about. Don't try to predict things and help to spread propaganda.", "sahel_seed": "Respect", "not_nuts_13": "Where is it written that they wont get citizenship? If a muslim from these 3 countries wants a citizenship , he will have to follow the procedure that has been followed since years. Nothing has changed for them.  Even if getting a citizenship for a Hindu can be easier but the govt. will make sure that the person is not lying. Be practical at sometimes , not political.", "manu.sharma.16": "Fuck off you bloody jai chand why would you want any refugee muslim from paakistan. You must be fucking some porky around", "apoorwaa__": "Don't spread false news", "yogesh_shelar0922": "@radhikaoffical #its a true fact bt ppl around r nt able to understand d fact", "gaurav.jodh": "Half knowledge 🤨", "akash_sky_7": "Even before NRC procedure ... She has full info about NRC great 😂😂", "rosh.nair": "@sanooban", "rishab3105": "firstly all the immigrant have to be residing in country fr 5years and citizenship cn be rejected fr dm,muslim refugees fr said countries can apply for citizenship bt fr dm time is 11 yrs.... read the whole bill. stop burning the damn country for pol. goals", "seemab_vazir": "@radhikaofficial appreciate it👍", "avinash1976": "wow..what a way for protecting illegal migrant...wrong message wrong thought...what to expect ? accept illegal migrant from trouble place ..wow see the situation in Malda..and what happened when we reject Muslim citizenship in India..and what about Hindu being killed in Pak and Bangladesh", "jhini_maitra": "It takes a lot of courage! You are amazing! ❣️", "bonvoyagesadie": "Thank you for using your platform to uplift the people! ✊🏽", "_sharma_paritosh": "Kash aap hi thoda padh leti .... vese bhi ab vo act h bill nahi.. to CAA hua na ki CAB ... aapke caption ke level se hi pata chal gaya .. bill padha nahi.. aa gaye post karne... mera desh JAL raha h AAP logo ki fake news ki wajah se", "iamsahaniaryan": "Stop this plain propoganda , you will ask me about unemployment , GDP ,etc... Our Indian Citizens are busy making tiktok & playing PUBG , every one want jobs....when u don't have skills then how will u get job . GDP decrease hone ki wajah puri awam hai sirf govt. Nhi....#indiasupportscab", "hudasyedx": "So proud 🔥really really very proud! And the rest of Bollywood can die. People will disagree and will call you things! And will tell you to remain within your acting boundaries! But i am thankful that finally someone understood how terrible this could be! More power to you @radhikaofficial ❤️ all my respect to you woman! People cant handle the truth so they are abusing! Saying shit. But you keep doing what you feel is right. Hail india 💯", "bidyut9564": "❤️🙌👏", "akash_malpure": "You should be ashamed of spreading fake news. SHAME ON YOU", "thakorhemant999": "Unfollow her", "your_deft.com_": "Report this as false information as much as you can. Please.", "saimarazzaksyed": "Thnks apte #nocab", "raman_pandey_nshm": "Then what happened to hindu in pakistan who went down from 33 to 3% . As a only hindu majority country we dont think we need to help them. Why muslim need to be allowd from a muslim country. You all r nothing but shit on the name of secularism.", "hema_chauhan_18": "Fuck off", "amit.sin19": "Bimbo you are good at giving your “Audition” tapes to Anurag Kashyap stick to what you know earns you your money", "staphylo99": "Stripped of citizenship?? Where did you read this? This bill has nothing to do with existing Indian citizens- whatever religion they belong. Please don’t spread false news!", "firdous_rabiah_": "Respect 💜👍🏻", "mazaransari": "Hatoff ....bhakt ke jal gai h", "sukritidang": "Dear bollywood actress, did you even bother to read the CAA before reposting this piece of false information? Read it first and if there are any doubts, connect with me and my friends. All doubts welcome. But please don't spread misinformation and indulge in fear-mongering.", "shetty_shobi": "Why specify just Muslims who missed out in the NRC registry. What about 12 lakh others who are missed out, what's their religion? Why aren't you mentioning it? Is it because that their religion doesn't matter? Or is it because using Muslims in your post will get you the label of a secular Indian citizen", "nidhi_journal": "This is not for Muslim refugees because there are already many Muslim nations around. No one ever said India won't accept Muslim refugees. Just for a while stop following or thinking what people around you are.... Use your own brain and take the real facts under consideration.", "jimymukherjee": "Adhjal Gagri Chhalkat Jaye. 😂😂", "ila_rehman_khan": "A big thanks from a citizeb of INDIA..💙💛💚❤💜", "catharin_justin": "Thank you for speaking up 😍😍😍😍", "__amde__": "Totally wrong. Unfollowing.", "ak_khan19": "People who doesn't support in this protest are such a heartless guys you doesn't even care about poor people what's there fault I never thought indian would be so much selfish only care about them if you were in that poor peoples place you will understand that what you will go through when you can't give grantey that poor will be safe in detention camps to shut you mouth let them protest modi bhakts ...", "thakur_amr": "As per rule of NRC anyone outside of North East only needs Adhaar, Ration Card or Voting ID to get citizenship whats wrong in it anyone will explain?", "seecid": "Somebody needs to report these influencers to the police now. High time. She's clearly spreading false news, despite the myths being busted multiple times.", "latifyaqoob": "What about muslim bollywood clebs like stk and salman", "sp_prester": "That first line is so so wrong", "yash_fd": "Saudi Arabia.", "anaya_kapoor_1": "@bbcnews @cnn @ndtv", "ar.aman": "Kindly don't act here u r worth it on screen only just standing in between rise and making a judgement is not enough for the knowledge come to see the real pictures of the remote areas, step out of ur fancy life and then post anything on social media madam. Government has introduced enough schemes to the people who are below poverty line whether hindu or Muslim these people falled into the line for that scheme and for the Muslim community to whom u r talking about that community has the maximum voters and voters are not allowed to vote without citizenship madam. So kindly add some valid points to ur knowledge. May be u can be arrested of passing on the wrong information. Read the whole point and analyse urself.", "aditya_bansal0201": "Just because you guys enjoy celebrity status in our country and you have a lot of followers, doesn’t mean that you will spread false statements. Firstly, CAA doesn’t say that it will deny all the muslims from Bangladesh, Pakistan and Afghanistan citizenship status. It says it will grant minorities of these countries citizenship of India provided they have been living in India before 2015(cut off date). Second, CAA doesn’t affect the citizenship of any Indian (muslims, hindus, etc.) Now coming to NRC, if at all that comes into picture later on and that GOI decides to launch it across the country, everyone will be asked the proof of citizenships(hindus, muslims, etc.) Only people who do not have to prove citizenship will be the people of the Sikh, zoorastrian, jains, hindus ‘of the countries of Pakistan, afghanistan and Bangladesh.’ Please read and understand the CAA before choosing sides.", "ajaykjsahaj": "And Your Thoughts is good and Great But where you Been when Kashmiri Pandit Is Got Out from There Home where you Been when in pakistan Hindu Became 2% from 22% where you been when Muslims get Better Thing against Hindu for Political Benefit by congress government", "utkarsh.varak": "If what’s written here become’s True then it will another era of NAZI rule... and Modi will be new Hitler... and then ... Welcome to World War III", "afsalsanoobz": "The modi govt..was against the national values..we don't need any religious discrimination...protect india . Protest against #CAB #NRC support #studentprotests", "lunatic_for_dogs": "@_gopika_agarwal_", "iamashwani_mishra": "I support CAA and NRC", "uday_365": "in assams case people of the state itself wanted nrc and assam accord to happen they dont want the immigrants to settle in their state for this they signed assam accord in 1985 itself go read those facts first do you", "viraj.junnarkar": "@radhikaofficial before posting any thing at least understand what messge are you spreading in society.... you find CAA problematic.. then why dont you keep all these immigrant in your houses... you know how much burden does government has to take for them... these is only of the reason form unemployment in INDIA as well if you think in broder perspect... People like you find it very easy to post these type of post... What mistakes have happed in past this government is correting them... \"trying to clean up the mess\"... Apte zaar doleee ughdaa👀", "anisha_khan05": "Respect", "rishi_raj_pritam": "India and North East cannot accept a single foreigner. Whole Assam is burning and is against the Act while the mainland India is showing deaf ear to us. #AssamRejectsCAA", "nikhil_balogikar_": "19 lakh ppl found in assam as illegal migrant because of NRC came into power , these 19 lakh packed their bags jumped into india illegally n in these 7 lakhs r muslims who are from bangladesh or from different neighbouring countries. So y do we give them citizenship easily. @radhikaofficial", "mdshariquesid100": "❤️❤️", "sabeehakhan59": "Our Country needs people like you mam.....united we stand divided we fall....... Its the beauty of my India......", "srahul1709": "@akshaypandey815", "bsmurfing": "Really appreciate.. the awareness you are spreading will have a huge impact on people's thoughts", "bilquisahmed": "respect", "rocks.md": "Why we take muslim from pakistan and bangladeds. When they already get 2 contrey for the muslim. Now they want india also be a muslim country. And your kind of mad people support for this.shame on you.", "pawanguppi": "#unfollowapte", "parihar.samiksha": "Cant u see how many people illigally living there. If there very own muslim cpuntries cant give them citizen ship why would we. Nd do u hv to prove no , stop doing this plz", "iam_arshad": "Hat's off Ma'am..!", "_.afshakhan._": "But why only muslims 💔 if this is the plan than apply on each and every one of them", "patoleatish": "शांत बस", "moupriya.m": "@radhikaofficial Extremely careless post from someone at a position like you. It's understandable that you all get paid for every post that you make, but atleast do not capitalize on this related to the nation. At this time when there is so much of unrest, people like you should have proper knowledge of subject and then post. Else just keep mum. It's absolutely ridiculous that you could post something so baseless, not expected.", "__kshay__": "Granted the Act has it's flaws. But this is an outrageously wrong description.", "kitzlove": "@sargam_manghnani this is ridiculous ! Look at the propaganda being spewed by a main stream artist. \"NO Muslim refugee would be allowed\" ? That's just bullshit. They can still apply for Indian citizenship under the existing policies. The process has just been expedited for persecuted minorities in THREE specific countries which have a gory history of raping, murdering, torturing, and converting minorities (Hindus, Sikhs, Jain's, Christians, Buddhists) fueled by religious spite.", "pranav_suthar_": "How these actresses are🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️", "rasikchaturvedi": "All is rubbish ... ..don’t spread the romour please @ we have 1000 document which we proved our citizenship.. !!! Me must support regularise India ... we we not made rules in last 70 years ... @radhikaofficial", "thetanna": "You don't even have a clue what you are talking about. Just reposting WhatsApp forwards. This is how you'll use your social media power?", "armaan1verma": "Idiot bitch!", "_shamsul.alam": "Respect and love", "sana\nVerified": "Verified", "abhishekom1807": "Today, no doubt, we are hearing voices of dissent against the Act. But all governments, across the world, need to standardise and streamline immigration. If India needs to move ahead on the road of development, ensuring that each citizen benefits from the country’s development, then we need to know what is the exact number and condition of citizens in our country. Once we are able to determine these facts, it will help the government take the fruits of development to each Indian citizen.  This legislation is a step towards Sabka Saath, Sabka Vikas, and the credit for this step goes to the Prime Minister of the country, Narendra Modi.", "g0vin_d": "CAA is not linked to NRC", "medhadeepakgupta": "Read about both CAA and NRC before starting your rant. Bimbette", "vinay_s_chavan": "Who are these poor, most marginalized people? Where did they come from? More importantly, who brought them here and why?? Where do they stay? What do they do? Even though these poor people have managed to migrate from other countries to India, are they integral with this nation. Suppose a refugee/migrant has entered India and we keep them here, what happens if in future, any of these 3 nations decides go in against India and start a war, whose side will these migrants take? What if they decide to show their loyalty to their motherland and not with India. What if they decide to become a Trojan Horse and harm India from inside? If that ever happens, you know who will suffer the most? If think you can guess it very well. It will be Indian Muslims who will be blamed for any such miscreant. Do u really care for Indian Muslims or you are just happy sharing a post for them? With these laws, Govt can at least have a record of such people. Law is a tool, just like a knife. If it falls in the hand of a doctor he can carve the disease out of your body. If it falls in the hands of a psychopath, well you know whats going to happen.", "drvishalmujumdar": "Can you dare to say few words against those who r spreading violence in name of protest.do you think it is their freedom for speech.🔥😡😡 .Where were you when same mob put public property on fire.dont you think it is also a kind of mob lynching.", "__bulky__": "Refugee route for citizenship is open for Muslims from Pak, Ban and Afg. I recommend that you read clause 14 of the amendment. I am not defending the amendment, just pointing out the inaccuracy in your post.", "ms_02062004": "When the so called politician say Muslims are scared why shud any muslim would like to come to India and take refuge. This shows India is safe country for everyone. WHY we shud allow people entering illlegally into our country. I am amazed the way majority of the bollywood who have no idea what the real thing is keep circulating same message on their page. Please go and read CAB. No Indian Muslim will be affected by this. Infact I am ashamed that public properties are being destroyed. Stone pelting is happening in Police and Army. Your bollywood maked movie on police and army and then earns so. much but you guys never support them in these conditions. Dont know who is sponsoring or making bollywood people spread such anti talks", "iampoojashah0910": "A country that is hit by terrorism by its neighbours frequenty, a country that is concerned about there soldiers and a country who has a steel heart to take a strong stand on this takes such kind of action.. We protest againts terrorism and sleepcells, we ask for justice and solutions and when we get it.. We act like a fool but getting into political gig.. Bravo..", "iamroshanpudke": "Muzhe aapse yeh Ummid nahi thi RADHIKAA JI❌", "sush.ank": "@radhikaofficial you said muslim refugees from diff.countries like pakistan, afganistan and bangladesh are not allowed to given citizenship, it is because these are muslim majoritarian countries where in muslims harass minorities and the minorities of these nations only has two option either to get converted or die, now they have 3rd one to come India. Why do muslim majoritarian nations need a citizenship of india. Please dont think one sided,like some people did with kashmiri pandits. Dont be so bias, as you are sitting on a platform where in ur voice can be heard so ur lucky, so think 1000 times before posting such things.", "ayatarh": "Y everyone is talking shit..Visit Tripura and Assam n then U will kniw the gravity of the situation.U guys r only talking about religion but we North easterns are concern about our land and its culture,ethnicity and its tradition.If CAB gets implemented then real Northesterns will be wiped off But MODI do not care abt that coz we r contribute less population...Rather than passing these useless bills he should look after poverty and many more problems.I guess he wants to excell in population growth beating China😹", "sachhutomar": "Do you have any proof of that 19lakh people or govt declare that list.", "varun7995": "We support #NRC and #CAA", "kartikr0": "She needs to know more about these act's🙄 .", "0777jeet": "धर्म के आधार पर तो हमारे देश का बंटवारा हो चुका है तो धर्म के नाम पर शरणार्थियों को वापस क्यों नहीं लिया जाना चाहिए", "ranjith.upadhya": "*CAB SIMPLIFIED* 1. Does the CAB Bill affect Indians(Hindus, Muslims, anyone)? Ans. No. It has nothing to do with Indians in any way 2. Whom does it apply to? Ans. Only to Hindus, Sikhs, Jains, Buddhists, parsis & Christians from 3 countries, who are facing religious persecution in those countries AND who are already in India before 1st Dec 2014. 3. Which 3 countries? Ans. Pakistan, Bangladesh & Afghanistan 4. In what way does it benefit Hindus, Sikhs, Jains,Buddhists, parsis & Christians from these 3 countries? Ans. Their residency requirement has been reduced from 11 to 5 years. And they can claim citizenship as a right under this law 5. Does this mean that Muslims from these 3 countries can *never* get Indian citizenship? Ans. No. But they will go thro’ the usual process of acquiring citizenship thro’ naturalization rules….11 years of residence etc. 6. Will illegal muslims immigrants from these 3 countries be automatically deported under this bill? Ans. No. The usual process applies. Their application for naturalisation as citizens will be as per the governing law and based on demerits of the case 7. Can Hindus facing persecution in other countries apply under this law? Ans. No 8. Does this bill apply to other forms of persecution – Political, racial, sexual etc? Ans. No. The bill is very specific in its intent – religious persecution of above notified minorities in these 3 countries 9. Why only these 3 countries ? And why only religious persecution of above Notified denominations? Ans. These 3 countries have a track record of pervasive, systematic & institutionalized persecution of minority Hindus, Sikhs, Jains, Buddhists, parsis & Christians especially the perennial persecution in Pakistan 10. What about Sri Lankan tamils? Ans. (1) The war has been over for the a decade now. (2) There never was any persecution on religious lines. It was on racial faultlines. And over the decades of civil war, the Sri Lankans have put an end to institutionalized discrimination of Tamils 11. Doesn’t India have an obligation under the UN to take care of refugees? Ans. Yes it does. And it is not shying away from it. But it has no obligation to offer citizenship. Each", "kruzin4fun": "All muslims and anti bjp will lose citizenship thus losing the right to vote and the will win with a 100% majority with unlimited power", "vk_chelseablueheart": "She is using her page to give out her opinion.. Why the fuck should we care about what the celebs have to say.. Use your own goddam mind. Support or dont support. Do what you think is the best way forward..", "rajput_pravinsingh0746": "Worst comment..", "merajul_abdeen": "❤️", "r_debbarma": "Thank you ma'am for sharing truth.. we tripuri already become minority in our own state tripura due to illegal immigrants .our job political power all are taken by illegal immigrants but the govt of India doesn't care ..😥😥 I don't what kind law is this they love illegal immigrants more than real Indian 😥😥😥😥", "passing.into.oblivion": "Bruh. Again misinformation, the person after being left out of the NRC has to provide valid docs that he is an immigrant i.e will have to submit docs that he belongs to Pakistan, Afghanistan or Bangladesh. Only and only then he'll be given citizenship under CAB. You make it sound like every Hindu, Sikh, Jain etc will be given citizenship after being left out of NRC. Also NRC guidelines haven't been set up yet. We don't know what it'll incorporate. how can we make assumptions. If it is found to be objectionable in future, we shall protest.", "black_window17": "This action should have taken long time ago, outsider come to india and stay here without any reason. Look America you cannot simply go there and live like its ur own country. You have to follow their rule and regulations. Then why not in Indial. We cannot take anyone for granted those who not belong here. Its high time to stop those people who are not from here. Basically if you are Indian you have ur passport and any other identification then you don’t have to worry. It will give immense problem those are not belong here.", "mohd.rehankhan.716": "CAB must be opposed .It's against our constitution......The Constitution of India.....", "aryann_chhabra": "Is my recent post OK or should i delete it? 🔥", "prithvi.charan": "Dumbest !!", "geshyo": "More Respect to you", "ajeet_kalra_": "Radhika ji un 7 lakh muslims ki jo aap bat kar rahi hain itna easy nahi hai un ko baher nikal dena and un me aadhe se ziyada log Bangladesh se aaye hain jo k kabhi bhi India k nahi the or ab to Bangladesh bhi un ko wapas lene ko tyaar hai baki jo muslims bache ge un ko citizenship di jaye gi, to aap plz pehle poori bat Jan lijiye phir kuch post kijiye, government ki galti sirf itni hai k logon ko wo sahi tarah se aware nahi kar paye hain is bill ko le kar.", "razeena_ibrahim": "Huge respect mam.", "sahanibapi03": "Madam ji - apko reality malum nahi hai. U r just judging the book looking to it’s cover. Come to West Bengal and see the reality.", "darksoul_keshav": "Dusre ke ghar ka garbage hum kyu accept kare #isupportcaa_nrc #shameonbollywood #radhikaofficial #narendramodi", "lover_of_life___": "Fake news...2 min slience for actress wisdom", "sjohnson_1212": "#indiaagainstcab", "shyam.rathore1": "The girl who shows her hairy p..... On camera for money, cannot understand the mind of nationalist leaders like modi and other govt officers who drafted this bill.", "dntchikitsak_deepika": "And moreover PAKISTAN AND BANGLADESH were part of India itself but the Muslims themselves demanded a separate country for them so Pakistan and Bangladesh were mad so again these people want to come back.. And if they really want to do so where will the other people already living in India go??", "rithu_arya_116": "Hello madam first u learn what is CAB , what is CAA , what is NRC 🤦‍♂️ After u wl post it #uneducatedbrute", "deba6_6_19sish": "@radhikaofficial mam the thing is other religions r given refugee status in India on the basis of religious violence on dem. But dat Cannot be in the case of Muslims becaz all of the 3 countries r Muslim countries and dey r the majority der.", "stoned_young_monk": "Even celebrities posting shit with half knowledge. Well for people against the government. The NRC was implemented on 2004 when the present government was not in power and the people were sent to detention camps then too. Why didn't the so called protestors protest then.Lets leave celebrities aside if they don't post anything they'll be criticized for not post anything but we common people need to keep silent until we know the real facts. Please don't spread hate and fake news against the government or anyone else for that fact.", "gayathrimanikumar": "@kumar_gowdahk", "02deekay": "Abe ja na", "anteshshsh______": "Y don't you keep them in your house?", "mahesh_kanojia": "Anpad... Tu B grade film me hi thik thi", "manish.padyar": "Do you people even know what CAB is?", "atishnaik_": "@soragavideepa", "galaxia_en": "Fuckk off bitchh", "apic1000words": "Scarily sounds like pre world war 2 Germany....these things are inflicted so subtly on people that we don't realise there's a bigger picture in play here!! We need to be alert to protect democracy !!", "prashant.jangle": "Read before you post. Educate your self before you protest.", "alkesh_bhagatwala": "There are so many Muslim countries .... They will accept those illegal Muslim immigrants.... Bc inko infrastructure dubai jaisa chaie aur law 1947 k chahie...", "mayank2000jain": "False muslim refugees from Pakistan, afghanistan and Bangladesh can also get indian citizenship by naturalisation process laid down in Citizenship Act, where as CAA gives citizenship to non Muslims automatically. Though govt didn't clarified on they are going to differentiate between rohingya and indian muslim without document.", "ravishingrajesh": "Don’t indulge in spreading misinformation. First page is factual and fine second page is speculation and akin to spreading false narrative. You must take down the 2nd page your share. Be sensible and don’t provoke arson and violence", "shivbaskets": "Radhika, please conduct a fact check and speak to a lawyer once. The above post is absolutely wrong. I can understand that you may be posting something you don’t fully understand. I request you to understand the situation for yourself fully and then post.", "adarsh_patel0007": "All bullshit, don't you know that government is repeatedly saying that it will not effect any legal citizen,and as we talk for NRC just pre assuming anything and spreading hate, and for your information government is repeatedly informing that while doing the Nationwide NRC they will take care of ,not giving problems to the one who is not able to provide documents. And finally, NRC is still not applied.", "be.like.nipun": "Respect , at least you have the guts to speak up . 👍👍👍", "iamyishu_": "Huge respect...", "chinmay.ghate": "Are madam isame aapka aur hamare Muslim bhaiyaonka kya loss hua???? Can you please explain in detail......", "asroy071": "Wow...what an explaination...Let me tell you one thing girl...don't use your small brain on topics that are far beyound your knee cap..enjoy the freedom of speach...bye..😜", "stym.exe": "#indiaagainstcab", "manasakalamdani": "What ??? Do not spread incorrect information. Anybody can still take refugee in India and it’s a lot the refugees who are already liVing in India from many many years. Kindly understand the bill completely before going ahead and posting some screen grabs. Sigh!", "kaifi_siraj": "osama bia laden , masood azhar, hafiz sayed, azmal kasab, i hope ab tm smjh gye hogye", "pradeep_bhartiya": "Yaar aadhe knowledge pe celebrities bhi react krne lge🤦🏻‍♂️", "gsb5353": "Good Sacred Games 3 Story 👏🏼", "abhirajchaturve": "Half knowledge @radhikaofficial and half knowledge is dangerous always", "telal_xul": "Glad to know that a celebrity is speaking against it. But the problem in Assam is ethnic unlike it's religious in other states. The Assamese community wants immigrants to be out of the place or at least we don't want further immigrants to come in. This has been an issue since 70's and we have a history of violence regarding this.", "abhichauhan815": "Apne thought post kijiye please dusro Ka propoganda na failaye", "swaroopsinh": "Totally wrong interpretation of CAB .. pls go through original bill doc. 👎🏻👎🏻", "vivek2610": "Such bullshit.such influencers like you should not post false information like this which i know is written by some student who is pursuing his masters from 10 years.😂.@radhikaofficial .pls do not spread this false perception.", "thapage": "Fake news. No Detention camp in Assam. Assam welcomes NRC results and wants 19 L illegal immigrants (irrespective of caste, creed and religion) should be deported to Bangladesh.", "omkar__bongale": "Radhika.. you can go to the Pakistan.", "narayanchandra1050": "I Agreed", "iamriasingh": "@chiragrai9", "iamrkarn": "That's all fake. That's all congress propaganda. Please stop spreading this misinformation and creating fear among citizens of this country. First do a little research about what CAA is and then post on social media platforms.", "sharma_mohit3": "Matlab kuch bhi bina pade bina law samjhe post dalni hai", "arnab_dhara94": "Refugee status? India has to give refugee status to anyone, irrespective of their religion, on the basis of UN laws. About citizenship, it is a completely different argument. And try to remember what happened to Brussels or Paris attacks, where a particular religion was given shelter. And, Amnesty has officially declared how Rohingyas have slaughtered other religions in Myanmar! How can you forget about these incidents? Or did you forget which religion is responsible for 9/11 or 26/11 or London bridge attack?", "fuckbjp": "Thank you for speaking up about this.❤", "who_else_kk": "How stupid ur show r post Tre that u have no brains and u are capable of only doing stupid movie roles", "shoes_store_jodhpur": "You look good on Netflix only 😂", "uxoriousghost": "He tr mahiti ahe, Navin khi tri sangycha naa....", "aniket.chaudhari.71": "We should provide a better solution rathar than thinking that people being sent to detention camp or wasting time in taking out candel light protest. I m sure none of us have a solution from letting other country people use India's resources for free.", "lovnish_garg": "What about indian population nd economy??? It is getting effected due to refugees and migrants only....why india will suffer due to people who are not indian citizens??? Tell me this first....and whats ur opinion @gargrachit092", "iam.shru": "@sohas_life", "bhaskar_1180": "Stupid not India against it only you and some stupid people are want fame under it... Jamia Student ko Kam maara aur maarna chahiye tha...", "shagun_s03": "Thanks for raising your voice ma’am", "mpkaiser4": "😞", "kshruti_": "Instead of taking a stand by reposting someone else's post, it would be better if you actually read the Act and then pass your judgement.", "mahibinjrawat": "O stree...ye bakchodi kahi aur pelo....", "infinite._.4": "Do you even realize why only Muslims or Assam?? Illegal immigrants (Muslims) have close links with the ISIS and Taliban terror groups. You don't fight the terrorists, but whenever any mishap happens u are the first to blame the government. First gain knowledge about something and then comment.🇮🇳", "vermarohitlmp121": "Wtf** misleading information", "ajaiswal20": "Government is giving citizenship to those only who have been prosecuted in there country in the name religion", "swaroopsiddarthgowda": "A smart actress,but a dumb citizen.", "tvtf__": "I love how Bollywood is just filled with brainless idiots that bark the same thing with no input of their own -", "saudanoor2000": "😢", "amarkantk": "Aaplog paagal ho gaye ho ? Kabhi official documents padhe bhi ho", "gurukiran777": "You can live in UK with your mulla boyfriend @radhikaofficial", "rai_ritwik_10": "Exactly. How the fuck can the unavailability of 50 year old documents with the poorer citizens of this nation, many of whom live live in slums, roads,temporary shelters etc, make them illegal immigrants.", "krnnpnddyaa": "Pseudo Intellectuals, I call BS, uneducated dum dum.. #unfollow", "pratikhunny": "Hmm. Radhika did u know that NRC in Assam was SC mandated", "mr_rohit_kumarrrrr": "Even the poorest one have voted once in life time. All they need is their record which can easily be available. Don’t fucking fool people. But I agree with that the religious bias shouldn’t happen.", "babita.chauhan.313": "Besharam"}