{"yawar2784": "Pela hoga", "krishnapaswan3009": "@radhikaofficial aap meri CRUSH HO", "omi_4747": "You are the independent women and I always respect u...no matter how people think about you...", "asmer_waqar": "Respect from Pakistan 🇵🇰..", "ak.creationz_": "Be careful with the guy near u he might he might slip it inside ur butt", "nikkhhilpitale": "Lovely pic baby....", "praveenb_unofficial": "What the hell is this guys, i mean TROLLERS. What execltly you want from the people. Why dont you mind your own business. Let others do what they want to. You are nobody to tell anyone what to wear or what to do. Everybody has their own life.”RESPECT WOMEN RESPECT YOUSELF” !!", "sidcool.kadam": "Troll karke footage khane ki koshish mat karo trollers ....yeh uski marzi hai jo chahe pehne...tum kaun ho bolne wale...bc itni tumhare gand mein mirchi lag rahi hai toh unfollow kardo simple....tumhari behne shorts mein ghar mein ghume toh bolte ho kya...toh chupchap muh par feviquick lagake baitho....", "pushkarahiwar": "Love you Radhika", "vikas17682": "Such a bitch who was ashamed of being Hindustan.", "mahesh_bhagit": "😍😍😍", "i_m_manjare2793": "just wow", "akshu_9795": "Firstly we all love you mam the way you give your contribution to our film industry.. And one thing that I want to told you is Just live the way what you want and Don't care about the trolls we all with you Radhuuuuuuuu😘😘😘😘😘😘😘😘😘😘😘😘", "poohbaniparvatii": "@gauri_of_the_wind she's just like you man", "popxavi": "Is that your boyfriend??", "iamdurrani1": "uffff🔥🔥", "vignesh_pm": "Chiiio", "bdey4915": "Mr.kesharidheeraj I will ask you a simple question.you have said in The Sovereign Democratic Republic India any person can wear anything.so my question is that can a Army Men or Policemen or a Judge wear the Dress of a clown?????", "priya_siingh": "Sexy back", "siddharth_peepra": "@radhikaofficial mam u looks amazing💖💖", "helana_joy": "😍", "manupralaya": "Which brand u r beer madam", "sherzai007": "U r beautiful", "_wanderwild": "You actually cant wear a saaree at the beach so don't worrt bout no haters, stay on your grind heheh, love you 💓", "gagan.tank": "Ghfy", "siyonaadhav": "@radhikaofficial u look beautiful.. haters gonna hate... Love you anyways.. ignore the loosers", "jetpanja.unofficially.official": "U mentioned this photo on casting couch season 3", "overexcitedtoseetheworld": "@swapnil.londhe.737 benetick tailor", "architect_parithosh": "What a creation of nature everything is beautiful, radhika looking too sexy and gorgeous, sunset and beach all complimenting each other gracefully.", "_sonia_samantaray_": "Guys ignore @rajroutela1 .. bichara sad hai. Kabse comment dale ja Raha hai .. Radhika k attention k liye. Lol. Sala troll", "anilbhole2": "radhika cute pic duniya gayi bhad me tula je aawadte tu ghalu shaktes tula konich virodh karu shakat nahi", "joynshan_ancy": "😍😍", "aleenabht": "I Have No Words I'm Very Shock 😔 & Bdw Check Out My Profile ❤", "swapnil.l737": "I hate NRI bfs", "rockingrocks0": "I wanna them doing more close and intimate pose...", "soilzs": "👌👌👌", "ashi_chauhan22": "Looking beautiful", "harshitapratap": "Wowwww!!!!! You are looking beautiful as usual...", "satish.9659": "Sexy", "shailesh__9001": "Osm", "iam_ark_srk": "Carry on mam, he is the luckiest man", "shining_space": "❤️", "duskymee": "best option.... just report about the account you feel is posting or commenting inappropriate stuff.... u can just open that particular account and u will get the options so needed", "shiva_k_ingale": "Nagdi jayel tumhala kay tyache", "diana__that_shimmers": "You are truly a beautiful person", "simitreesa": "Incredibly beautiful sunset and this pic is awesome...sooo beautiful.. #loveblossoms", "iamabhiresh": "Nice pic mam", "chetan_behade_fitpho": "What happened to youth of India.... Kaise baate kare...itna Ghussa hai to Jaao LOC pe aur laado jitna laadna hai.. And you don't have any right to put your nose in others life....", "danielmarks365": "Hello ... you can see that this is the nude scenario of the kind of cinematics of the cinematala cinematriyam to put up this kind of work and you do not have to talk about the Tamil women's dressing room. First of all you close your mummy and tell me to close madam. Let's remember only good. Whether you are on the shore of Goa and many sea shores, it shows your loneliness in the cinematical scene of the cinema. 'You are a naked devil. You do not have to talk about Tamil Nadu. If you talk about women in Tamilnadu, you can buy a puddle and chuckle", "shbh06": "Sexy pic.. 😍😘😘😘", "_man.vee_": "Awesome pic u all see urself first then comment on other idiots", "camanojgupta": "Nice pic", "yogesh_____sathe_____": "राधिका आप्टे- टेलर", "h.i.s_h.e.a.r.t.b.e.a.t": "@radhikaofficial you rock💙💙💙", "jatinbillionaire": "Not good", "hoseokslatte182": "All the vile comments on here, yall are disgusting. Your parents would be proud to have raised such children", "rainachakma": "Enjoy ur holidays", "richakagalwala": "@radhikaofficial I don’t know why these superheroes suddenly get activated when a celebrity puts a pic like these Nd show there love for Indian culture nd they have sudden urge to protect it....but let me ask u to ‘the saviour of our Indian culture ‘ - why don’t u take an action when a girl get molested or get rapped ....why ur urge to save our Indian culture suddenly disappear ? We really need u there ‘Superheroes’. Come out from the crap and focus on what really matters....", "funnybunny81213": "And guys what we should call a person who doesn’t respect a person Nd call them ‘slut’ ??", "marvel_fandom_rdj_fc": "NYC mam", "ankit_parolia": "Kabhi Bhartiya Paridhan me Gokul vrindavan mathura gaye hote holi celebrate krne tab pata chalta Holi sea beach pe nahi manate,", "krishan_mohan_km": "Nice pic", "kesharidheeraj": "According to Constitution of India any person can wear anything because it is said on fundamentals rights of India", "disneyarsyn": "Shake them off", "fenixfcruz": "Radhika your are just superb and rocking onscreen and off screen", "saptaparnaray": "In my mind u u u q A RRu anJ 6n7n7d n8. in c v 66 n to the do do", "kramya.kramya": "Nice i like u", "__100nal__": "I don't find anything wrong in this picture at the first place the pic is really beautiful. And if u want to troll , then tell us u narrow minded people what should we wear on a beach.", "chandu_abcdefg": "I love Radhika", "vamsidasika": "See the splendid beauty of SEA n Sun those who are commenting really dont want to see Radhikaaa", "the_preshs__diamond": "Sexy", "unmesha_nag": "Ignore the haters, you're beautiful! ❤", "akshaykgt": "Anyone can wear anything", "arkaswapan": "http://amzn.to/2FFIHRK", "patidar9202": "Nice", "mingkengbomnamgao13": "It’s a great photo.", "apurv_singhrajput": "Haters ko Parched dikhao bc hilaaega baith ke", "naga_dce": "Sun set was awesom.....Nice pic😍", "sandhyashobhasharma": "👍🏼", "sunil_bhat_": "Dear Radhika I know ase sharir pradarshan karunach tula films madhe kaam milte aani tujhya jawal paisa v prasiddhi aahe tar patel tasa nanga nach karu shakte ....Ashya kayik talented muli aahe bhartat ki jyancha apan hishobach lau shakat nahi pan tujhya sarkhya actress aani models mule tya mulinche aai vadil tya mulinna pudhe jau det nahi aani tya mulinni virodh kela tar dusre lok mulinna janmala yeu det nahi as fakt tujhya mule ghadte as mi nahi bolat pan same ghatnanmule aai vadil ghabartat mulinna janm dyayla ...Aata tu mala nerominded mhanshil mahitiy mala karan saty koni aikun ghet nahi ....", "suryavanshibunty12": "Looking dam beudiful @radhikaofficial proud of u all we Marathi", "amrithavc0": "You look perfect... beautiful..😘.. ignore the haters.", "sonali_1602": "lovely pic", "sachin_chitnis_photography": "Sad that the tranquility of the sun setting over the sea couldn’t give you the required inner peace ...otherwise you wouldn’t have been so rude with your fans just for not being in the queue on the the airport, poor fellas busy admiring their luck apparently didn’t even realise that the queue should have begun behind you ...", "gaelrg96": "@official_sayaji It's film industry. Showing her body or not is her own choice.", "rajeshdas__younggun13": "Ignore them @radhikaofficial madam . but you should have to give an Answer to that people who thinking there Pointofview it is.. Give a kick on there bums👆👆👆", "masud_baraskar": "Looking awesome", "malviya1633": "hii", "atifrebel296": "Haters ek kaam kro...Please mar jao...", "laxmanharnawal": "Zakkassssssss", "as.if5741": "Her Personal life", "ashishgiri552000": "Awesome", "jimeenaji": "@radhikaofficial Raho Bindaas Jiyo Bindaas. Wish u Great success", "hecmantier": "Attention To All The Trolls, If u go on a beach what will u wear. \"A RAINCOAT\"", "believe_karma05": "You are looking as #dignified as a woman in a #saree .. More power to you.. Haters gonna hate, you're just gonna shake... Shake them off... 😘", "mr.100rabh_": "Radhika....😍", "jagdishdighule": "Love you", "vivek_the_v": "Dear Trolls, Don't Expect Radhika Apte 'To Wear Sari On The Beach' 🤨", "my_notsoperfectlife": "omagoshhh😍😍😍😄😄", "swatisurii": "@virudada7720 It's her choice to wear what ever she wants.. Tujhe koi hak NH hai ki tu ksi ko roke.. And yeah one more thing before abusing any one first know the meaning of the word and then think if u can say it to your mother or sister or daughter.. And now fuck off . Handle your own shit. Live and let live.. Kaam hi nhi h aajke logo ko Dusre ke Kano m tang Daal dte h huhh", "sagarghadi9726": "मस्तं क्लिक राधिका ताई 👌👌😊😊", "piyush8nov": "Bc salon jo log galat comment kr rhe h unke liya..bsdk konsi ladki bech pe ab saree pehanke jaygi?? Tum mc vellad logon ko or koi kaam hai nhi aajate h insta pe bakwas krne", "sandeepkhot10": "Looking awesome 😘😘😘😘💞", "arjun_ek_yodhya": "राधिका प्रतीक है ।माँ है ,बहन है शक्ति है।अबला की आवाज है।अबला की आगाज है।हर नारी का प्रत्यय है राधिका।मातृहंता बन जाओगे गर राधिका पर लांछन लगाओगे।शब्द दोष का लांछन क्यों खुद पर मड़वाते हो।देवी का रूप है राधिका ।क्यों देवी को दोष लगाते हो।ॐ नारी शक्ति।", "jishnu_r_prasad": "🔥🔥🔥", "pmallikarjunanaidu": "nicee", "basavaraja05": "looking good.", "asds7157": "इसने अपनी मूवीज और डॉक्युमेंट्री में अपने बदन का दिखाने लायक एक हिस्सा भी नहीं छोड़ा.. पता नहीं अब लोगों को ऐसे फोटो से क्या problem हो रही है", "gangurdenandu_": "Sexy", "virudada7720": "@gamadiaboyshostel tera to ladkoko dekh kar kadha hota hai... aur tera kya dukha", "shashikantdonde": "खुपच सुंदर तुझ्यासोबत मि असतो तर", "official_sayajipatil": "this people can do anything for money so why we are talking about such people.. she is good actress but some time we need to make some rules for ourselves.", "d.esifeminist": "You're gorgeous!!!!", "inzamumulhaque201103": "I really like this outfit", "shamsheerbains": "It's really sad to see so many people with such hypocritical and narrow-minded mentality, even in 2018. Why are you all spreading so much of hatred by criticizing her and using such abusive words? If you can't say anything nice, don't say anything at all. Really dissappointed...", "nirmaljain88888": "Hotttttyyyyy", "dandeomkar": "Superb pic and awesome sunset", "pushkar3056": "Bikini beach ki taaj hai ,es me husn lagti chikni maal hai", "rajeshthejungli": "Ignore the trolls @radhikaofficial they are simply a biproduct of our male chauvinist mentality.", "surojit.debnath.9847": "Wao Nice", "swati.sen.gupta": "And one more thing, please ask them if you fall sick, in a trouble, will they be there for you to help?", "tamojitbasak": "Good looking", "marshmallow_jishashi": "@rajroutela1 ... Excuse me... Mr. Rautela.. Tera ese troll se pata chlta hai tu Real life me kitna Sharif hai... ... MTV me National tv me ye words use karna jo tumne @radhikaofficial mam ko use kiya hai... Idiots.. Actress ek pics pe faltu cmmnt karte hu shrm aana chahiye tujhe. #mtvtrollpolicehelpline #mtvtrollpolice .. MTV troll police just check his comments . The words he used is ridiculous against radhika mam.. Teach him a gud lesson . That how to respect a women...", "an_artistic_view_periscope": "It is your choice to be in bikini... don't even response in media...I am proud of your work👻😀", "roy.stumi": "nice looking", "sinhavarunkumar": "Nice", "dasratan958": "Vry hot..i like it..", "shreyank.g.bhat": "Nice", "akhileshsingh5079": "Beautiful", "ajay_gram": "All these people are commenting bad on her because they can't get a beautiful/honest person like her to be their partner. So they're showing their ugly fucking miserable shitty mindset on her . Fuck off hater's remember all you Will people rot in hell and Will be remembered as ugly fucking miserable shit fucks in history .", "sandeashhodage": "Ur looking nice radhika mam", "tridevmahato": "@roy_srinjoy664 sorry bhai", "singh_4505": "Udhar tohar pyaar mein manjhi pahar tod rahal baade aur idhar tu beach ke maza liye rahal hu............. #Bewafai", "panwarnitinsingh": "She's shameless", "jiyadalikhan": "Nice 😍", "dev4igram": "who is this lucky man ohh kash I can there", "subhasis_voice": "cute jodi", "abhijeetbhu": "😚😚😚", "ayushverma.8": "@nilesh_singh_sengar comments dekh", "haimant_chouhan": "Shandar pic", "sagar_ragalla": "Superrrr", "anuj_wangdu": "Which beach side ??? Bagha or calangute", "_devil_1967": "hot", "loveinchat_com": "Do not forget to come and subscribe, and if you want more ⬇️⬇️⬇️Online Dating Site. Find Your Love.♥️♥️♥️ https://loveinchat.com/?pid=263", "tear5165": "Gora le gya nazara", "ajayrasal86": "राधिकाताई खुप छान तुम्ही महाराष्ट्रीयन आहात खुप छान....तुम्ही खुप चांगल्या आदर्श आहात आम्हाला मला वाटत तुम्ही सर्वांना हेच सांगाव महाराष्ट्रातील तुमच्या फॅनना तुम्ही पण बीचवर या अस लाईफ जगा......किती छान होयना राधाताई", "s.m.fahimferdous": "sexy", "snsajahtewhs": "@radhikaofficial You have all the rights to live your life! Ignore those haters because they have nothing to do except acting this cheap! They're showing their jealousy in this form! Lots of love to you! ❤", "babayaga6264": "Nothing bad in this pic to criticise. You people f**k off.", "soumyadippaul011": "Shame on u!", "omidharap": "भारीच", "quraishi4960": "Koob maje a rahe", "munish6269": "Lovely", "farajkhan.official1": "Good", "ashok030612": "very beautiful darling....like to see more", "takemetheretoday": "beautiful sunset! 😍👍👌", "mamunrashid288": "Black and White", "avinash6887": "Love you", "preetisamaddar2570": "ULTIMATE", "rajatsikder": "Bindaas... 👍🏻", "nagrajnaaj": "Some people are really in that shick, that we cannot enjoy our life so will spoil other's.. she is good actor and you guys enjoy her films.. trolling her personal life doesn't make you good or either you will become famous.. @MTV trollpolice - you guys doing great job please track those guys and teach them lesson. That they never repeat this again.", "md.afzeng89": "Nice but lacking of everything open.", "punitmartin": "Beautiful nature with lovely couple", "vivaanchourasiya": "Superb", "jaz_haque": "Ooohooh, my first crush.... 😊", "imdivymahawar": "Nive looking... Enjoy... Radhika", "mj_rock_5": "Oooh kya hai radhika aaj be hum aagharaghe k gholam haiii kya tell me", "cherishraman": "@radhikaofficial 😘💕", "bhausaheb_chandan": "Nice", "jeswa2588": "Dongaas confirm", "iamv.r": "Beautiful sunset scene", "h_a_r_e_s_h_baraiya___2032": "Nice pic", "nilayshasmal": "Very nice", "rhythm.papon": "So nice", "sammakesjokes": "@neuroticapeddler", "meme_king7272": "😲😲😲😲😲😲follow for bollywood hot pics", "the_rai_sahab": "i love u @radhikaofficial ...", "gudguy4211": "So wanna fuck you in doggy style right on the beach there!", "rohit.deshmukhxx69": "Life on beach.... Relax... N chill out... Yeah...🙌", "vishalrawat3532": "So sexy very very hot", "mr_vyas18": "Where are you right now???", "priyanka_ojha": "Beautiful", "skdverma9999": "Nice click", "meenaksi_sexy": "U look hot and sexy", "shwetapongurlekar": "beautiful", "sunitbaisla": "Nice", "mahakaal252627": "Very preety", "manish.dhariwal": "Which beach?", "sai_ankana": "Wht a back", "thelocalbeat_goa": "@radhikaofficial you guys shld come along on a village loaf into the uncluttered vintage Goa...", "lady_killer76": "Hotty", "timo_74": "Flawless @radhikaofficial", "yadav.rajbali": "Piche se dikhata hai beby", "theworldkingp": "Bharat Ko Bharat rehne do esko ang prdarsan wala Desh mat banao apni picture share krke ... Aap Jaise ho vaise raho dunia Ko dikhane or sikhane ki jarurath nhi ... Private life Ko public mat Kiya kro all ... Actor/Actress/Director etc ...", "amol_hedau_": "super", "homeplus.hr": "Aapki muskurahat bahut sunder hai...keep smiling...", "abhizeet1": "खूप सुंदर दिसतेस राधिका।", "sadalvi222": "Which place nice one", "harrshakumari": "👌", "mak.raj786": "Nice", "kriss786": "Wow", "ssamadderrocks": "Wow", "kamal___chowdary": "Hi", "lord_shiva_bhakt26": "Aise hi isko manjhi m ni liya tha", "pravin.gadade.58": "🤣🤣😍", "jerrytalks": "@portraitsbyunni", "utkarsh.rana3": "Chiiiiiiiii", "charlieadimani": "Radhika you r very hot and sexy", "suhaskaviskar": "May God bless you both", "priyanshu_official_1995": "nice", "hari_panchal_": "Wow", "virtual_media_tech": "Mam can u plz give ur managers nmbr😊..Plz mam its for a official thing🙏 OR plz check ur inbx mam🙏🙏 @radhikaofficial", "rajhoney7872": "lovely moment", "tasneempar": "Beautiful pic", "rahis_khan_cbz": "📣बिना कोई पैसा लगाये पैसा कमाए अब RS 15000से 20000/महीना कमायें अपने Android फ़ोन से बस आप इस whtsp no.9893954344 पर \"JOIN\" लिख कर send करे", "vaibhav3631": "Radhika so much hot", "jaybhaye_udhay": "Sexy itam Radhika", "sureshsknagar": "LUCKY WHITE BASTARD :-)", "akhwankhan": "Shaam hai Jaam hai aur hai Nasha", "_._who._.cares.__": "❤️❤️", "_____raghv31x": "🙄🙄🙄😦🤨🤔🤔😎😍", "maysajalilah": "Nice picture", "venkatsvamyv": "💝💝💝", "mildredcus": "the biggest failure of life, is to give up.", "manish_negi_rajputt": "U r awesome", "s.k.imran8": "White boy friend nice", "22himanshi": "Hottie", "atrueguy": "Woow Radhika", "urs_subbu_loves": "Wow so nice", "santoshbose": "From shor in the city. Anthahen . This lady has gone places.", "___assu___model___": "Wow fantastic", "umakant11m": "Radhika ur looking so much sexy wow👌👍🌷", "with_u_me": "Ya its so romantic to hv a friend like u n enjoying together", "profildokhtaro": "Konolooo", "manu_0fficial": "Beautiful", "outlook___frames": "Wow cute 😍 @radhikaofficial", "luvur_dreams": "Njoy", "finto_antony": "Beautiful", "prakashkushwaha10": "Awesome beauty", "sarkarjeet": "Yesterday me and my wife watched #Antheen again,I love the movie ❤️", "nikhil_nikki_desouza": "Sexy", "zgashok": "So beautiful", "shubham_pathrikar_patil_75": "😘😘😘", "chaudhari7604": "Dislike ka bhi option hona chahiye", "mrinal_bansal101": "❤️👊👊🤟👊🤟", "nawazkhan_03": "churrrr dera ap ku unaa dabake 😉", "kumar.123456789": "Hot", "raja.saeed9262": "Looking sweet...", "deepak_da": "Poo Di", "iamharshit_tiwari": "Rndi", "bparekh1976": "Hot n sexy 👙❤️", "sagarmakde": "Hotttt", "srijon009": "Nice bikini", "zafarwestern": "❤❤❤❤❤❤❤", "sshahidkhan565": "👌👌👌👌👌", "imhites": "Uff...aise na dekh pagli,", "akash_ak4705": "Awesome", "aashishsjaiswal": "तुम हो जरा हटकर", "aman_3605": "Phaguniya....", "aj__khuman": "Omg wow look", "faiyazali.khan": "Lovely sun Set.....", "gudo.upender": "Drank....", "anishashmi": "U looking sooo hot n sexy 👌🏻", "abhilovegowda": "The true actress ur ... i love u to the coree", "kd_ajh": "abbooo foreinger ke saat", "jatinvsheladiya": "Just visited early then you. Missed the chance to meet you.", "mavericklupino": "Fantastic", "khare_501": "Foreign invasion in desi farm", "nashilasingh": "Bamb💣💘💘", "naveenthapareal": "wow pleas post more photo", "i_am_vivek_chaudhary": "Nyc", "priya.clicks": "Flawlessly beautiful @radhikaofficial", "srilekha08": "Have fun", "sheru_patne": "Kon hai ye", "dr_varunpatel": "Oh wow... Such an amazing place to relax and lose your stress 👌", "stormapril22": "Love you. Such an actor you are. You deserve an outing... Go gurl..", "rajanbabu8888": "Enjoy 😉", "sumitpatadia": "Wow", "trk_rk": "Hope u will get some privacy from fans", "nv_suresh_kumar": "Nice location ur looking naturally", "vinu_pasila": "I'm upset babe", "rajenderpadam": "Hottt", "marography_18": "💗", "fariha_a.trina": "@vedatare", "rajkamal.rajpoot": "Radhika u r perfect bikni women", "akashkangane4": "Awesome", "utkarsh__tiwari___": "@__._.abhi goa ki photo h...bc 2 bar ho aaya hu indian to milti he ni", "smile_swarup": "Bollywood mey eise kabhi....bikini wale song leke aau", "mannusays": "👌☝👍🤘🍻🍺", "hrishi_mukherjee27": "Aise kisi ke bhi sath mt baitha kro... Bura lag jata hai😒😒", "demonic070707": "kudos 🙂", "keepsmiling307": "Besharam ko besharam like karey. Baaki tareef karey na koi. Fokat mein tareef karey aur besharam tab sukhmay hoy", "aaryan_bhandare555": "Nice", "meraz9016": "no", "prasadphilo": "Nice movie", "shoesizeus13": "Mee tujhyavar prem karto. Chal apan palun jaau.", "shiva_shankara88": "Wow amazing", "ashishsharma7520.0007": "👍good enjoy...", "thalarishankar": "super hot bikini", "agastya_shukla": "😍😘", "mondakrantaa": "I so love Goa", "priyadarshini_._": "❤❤", "goasiddesh123": "Agonda beach", "adityagurjar9": "This girl is killing 😍😍", "gowsigun_hlb": "So cute 😍", "armaan_jam07": "Beautiful sunset..", "southindian_lady": "U r absolutely gorgeous, all natural,no botox,surgeries etc...💟", "shankar4647": "Love you", "anadi_bells": "U r beautiful without any surgery😁", "nitin__always_new": "Come......", "santanuzn": "I luv u Radhika😍", "_kushaljain": "😍😍😍😍😍😍😍", "shawayzkhaan": "😍 - Trendsetter- 😍😂", "justaatifways": "@ajaykrishnann yend", "raj_906": "Cute 😍😍👌👌👌", "saniludeikar": "Enjoy d local food 🥘", "irshad_lone_official": "❤❤", "vaz_fotography": "Superb", "perpendicularrrr": "😍😍", "actmandar": "Lovely 👌🏼", "bruisesandpain2020": "Looking nice @radhikaofficial", "pakodetolobc": "friend ya boyfriend", "viewzon": "👌🏻", "arora8718": "U look hawwt!!", "manikpachunde": "Kon ahe aa manus", "madhansamuel": "U look great.... Who is he? @radhikaofficial", "soumen_neel": "@radhikaofficial cheers to the friendship madam!!!! 🤘🤘😊", "_ravishankar25": "✌👍👌💯💯💯", "infinity_myself_": "Shevatch..", "_slaying_actress": "Couple goals... 😍😍", "jadhav.tushar111": "😍😍😍👌👌", "anand43194319": "U looking hot", "therahuldev": "Beach, wine & sunset perfect relaxation ...", "abhinandansabannavar": "Candolim or varca beach?@radhikaofficial", "sam_r0y": "wow", "rajveer._basod": "Ye Aadmi kon ha madam", "romaamol": "Oosam nice", "soyab4463": "Hot pics", "aruj.singh.56": "Nice", "impradeepbelwal": "Tum bhi 😂", "explore_and_explode": "Perfect pic👈👌 @radhikaofficial", "indian.radical.feminists": "👌👌👌", "swapsingh24": "Which beach? @radhikaofficial", "riyaohriya": "You are the hottest bro!", "achintya": "@namit00797 the real thing.", "ll_yashpatelgudli_ll": "Outstanding", "duffer_": "@baseer._.khan", "v101fadhion": "Hot", "bollywood__bbfan": "Awesome", "jyovalvi_dabbuu": "Loved u in #Padman.. Being Modern giving Message to Society in there way in Movies #Appreciated alot .. Love from Maharashtra-Kerala 😘👍", "dixitsuyog": "Cheers babe", "sarun8": "Those eyes ...", "tracymakeupartistgoa": "Palolem", "premprakash922": "Babe give one chance I will fuck u", "kalyanikakkar": "Abey gayatri ye kya", "believer_shubz": "बघा आपले संस्कार...! @radhikaofficial", "8422malkit": "Beautifull girls", "balaji_7rebel": "Adiyae yaru de avan", "ankification": "Yummy bikini 👙", "mrbakerrrr_s28": "Whr r u", "themeweaversdesigns": "Whose photobombing the pic @radhikaofficial 😛", "yatin004": "Super hot!", "satish__vemala9": "Cute", "rayzx90": "gorgeous", "amitaahir": "Kiyo indan nahi mila koye", "realsubham": "Snap a pic alone donning a Bikini 😎", "vinodsinia": "💕💕💕💕💕💕💕💕💕💕💕💕💕💕", "dineshambekar007": "Nice", "maheshbasapure": "Goraa ee pass mar jaoo tum", "kishokmaria": "wow wow oooooooooooooooooooooooooooooooooooooooooooooooooooo", "chinmay.tanksalkar": "Kon ha?", "kailash6021": "Superbb", "rane.apeksha": "Mast", "pravinwarkhede": "Sexy love you r", "devesh88.tyagi": "Who is he? Introduce him to the world", "jaywanth_paul": "Blisssssss", "deependra2312": "Beautiful", "tumpy2.0_still_loading": "Too hot", "charlottehayward": "Adorbs", "akash_powky_": "💟💟#Nyzz😘 👌🏻😘😘💟💟", "sinimalab": "Hello follow our page @movieslab and visit website https://movieslab.herokuapp.com for movies latest updates. Dont forget to share.", "storm_pegasis17": "😻😻", "geerishd777": "Great", "jaskisinghm": "This is south Goa, most probably Benaulim .", "pawansharma9227": "👌👌", "__imajay": "Yahi mila tumko Indian ki kami h kya?", "culturewaali": "❤️", "adarshiips": "@radhikaofficial which beach 🏝??", "harshad.purandare": "💓❤💞🙏💐👍✌💖💕☺😜😘😚🌞👑💚💝👌💗💜💘🌝💛😊🙌🙋😍", "prapti_1616": "🔥😍", "gauravvkchawla\nVerified": "Verified", "knitish7432": "😱 OMG", "findingshiva": "Broke my 💔", "_swapnil_ahire_": "Bhuigaon 🏖 🏝 beach", "roy8055": "Enjoy your holiday radhika", "baban023": "Hotness reloaded 🔥🔥💥👙🍑💕💋💟💘🌹 @radhikaofficial", "iamanagha": "Kon ahe ha manus 🤣", "mohanish65": "Cheers 🍷", "vohra.irfan.14": "Wow", "sagarbpgc": "@pravin.gadade.58", "teji006": "Nice back", "neo_zindagi": "Where are you @radhikaofficial 😃😃😃 im here remember me??", "pravin2989": "👌", "chudasama_chirag": "Lovely pic 👌👌👌👌", "cameocosmos": "@whomayuresh.dere", "simplyfoodcreator": "ur so good ur fan frm pakistan", "shivamgilhotra397": "Who took the pic #awesomephotography😘😘😘", "bunny_zyan": "😍😍😍", "nikhil_sojwal": "😍❤️😍🔥😘", "aqeel.srk": "Kashi aahes Radhika ?", "mudaseer_muzzu": "@radhikaofficial luvd your character in padman .... Kudos to yu🙌🙌🙌🙌🙌🙌", "luxxe_supplements1": "@radhikaofficial are you sure he's your friend", "pavan____jadhav": "super", "bad_mafia___": "Wow baby", "last.edition": "Boyfriend 💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔💔", "shakeelshaikh93": "Beautiful!👌", "anasuya12": "Wow! Look at you!", "viratsinghnawab": "OsM", "ratnamsingh": "Which beach", "the_devi_putra": "Aap kabhi jaisalmer ghumne aaye to plz post kr dena mem. @radhikaofficial", "am_fai_zy": "😍😍😘✌🏻", "monikarana431": "📷👌👌👌", "shwetaa_chavan1": "💟"}