{"ricky42798": "You are disgrace to your own country. These kind of things happens in every country which is sad. I would suggest you to read news before holding such posts like a dumb piece of shit.", "gopalrautaray": "Jab Bihar aur Assam me huatha yese card me ati to bahat achha hota .", "yukta2502": "Cfss", "gorza_gun": "bollywood call girl one movie one night", "ily_7830": "ये झूटी खबर थी और तुम भी झूठी हो", "26000_ult": "@vdia.s u have a sad life...too much time on ur hands", "anilkt9": "Hope so by now must be knowing what really happened .. now you must delete this from your page .. 👍🏻 as you should support the truth not the rumours", "haridassir": "I m ur fan 😍😍😍", "ravikirranraghavapuram": "This is really not cool", "bhavyaxinha": "please do some research before holding a placard. @radhikaofficial", "ultra_cool06": "There was a rape case on this Eid, A 26 year old man raped a 7 years old girl in a mosque in meerut, please hold a card for her too❤️❤️", "smirksintheblues": "For all those people with a shallow mentality who dared to comment on a social platform about @radhikaofficial by using abusive language and also commented on her work which is tune with the real world, it really showed the educated crowd of India what a horrible place it has turned into because of people like you. Be educated guys and not merely learned. Half of the psychotics don't even know the spellings and they are trying to deal with the core problems of India. Jokes on you guys. Radika ma'am is a really strong woman and much educated and deserving than anyone commenting here. If you are not pleased with watching her work, then don't.", "sunilnad95": "I wonder these bollywood bitches know what is shame 😂", "ashutoshrajput75": "What about your nudes", "sandeshguptaaaaaaa": "Racist @radhikaofficial", "_daanav": "It surfaced so you reacted, what about those don't get highlighted even? Demand for strict and non Bailable punishments", "your_saumya": "pahle tum apni to film mein bold scenes ban kro phir desh ki rakhsha krna madam ji itni 3 rd class film bnaati ho with nude boobs scenes sameless women", "drfraud.69": "@radhikaofficial First stop shooting your bold and nanga scenes in your cheap films phir bolna kuch dekho kese tum apne boobs dikhati ho paiso k liye or khud nangi hojati ho films me or ye Hindu dharm ko target karna chordo", "white_sand_090": "You're my favorite actress ❤😍", "shaik.khajapeers": "🤔🤔🤔🤔🤔🤔", "raqhib_007": "🤤🤤🤤", "atishkharade": "Right", "devendrapai": "Can we have a similar upload for Divya who was raped for Imran", "theindianpolitics": "Tumhare jaise bevkuf ab nahi dikhai de rahe placards liye huye.... Bas.ho.gya??? Payment kya muslim victim ho tbhi aai thi isiliye kara tha??? Third class actor", "prahal_anjana6172": "Aasifa ke saath galat hua mujhe bhi bura leaga lakin tum loogo koo ek varg hi kyu deakhai deata h 👎👎👎👎👎👎👎👎👎👎👎", "pramodchaudharyyy": "राधिका जी, आसिफा के लिए तो आपने प्रदर्शन किया लेकिन अब जो हृदयविदारक घटना मंदसौर MP में हुई है उस पर भी कुछ बोल दीजिये।", "satendra_bko": "Hi dear do you feel ashamed of Mandsaur rape case or it was only a drama from bollywood bitches like you. Act now or never act for such incidents again. We do not need your false propeganda to mislead indians.", "veer_jain0680": "#justicefordivya Aata pan vattie ka g radhika Laaj @radhikaofficial", "rsrstudio.official": "Die please", "kaswalarahul": "@radhikaofficial What about Mandsaur ?", "thenadiahkhan": "First of all, for those who are asking her what she have done for other girls who got raped, what have yall done to stop rapes in India? At least she felt ashamed not like you people. Blaming someone just because they posted something they felt from their heart is seriously so lifeless. Before pin point others, go and ask yourself first. What effort you have made to make your country better. Please dont spam with stupid replies. I wont really respect, respond or even act like you exist. #justforthosenegativepeople #nothingpersonal", "milindarolkar": "Mandasuar ????", "vkcall": "Same here then Geeta was also raped bye a Moulvi do you feel also ashemed? Miss Radhika Apte?", "javairea.x": "Hi", "manishverma5131": "Randi madarchod", "cs.arian": "Randi... Mulloh se chudne wali rans", "arunsam_92": "For people like you ,removing clothes or wearing short clothes are freedom", "arunyadav3261": "Galat ..wrong", "vinodkumar.shinde": "What is your opinion about Geeta.", "abdulvajid_011_421": "❤", "sharma.sachin_": "Tujh jaisi ko to sala desh m hi nhi rahne dena chahiye jobless flop actress shamless", "jenu_ten": "Lot of butthurt judgemental misogynistic sanghis here", "rakesh_vannela": "How come 1 million people following you😵😵😵", "kulkarni742": "Where are u now when Geeta is raped in a madrasa ? Why don't u pose with a placard now ?", "hereaditya": "Geeta ke rape pe bhi post karo.", "aayushkpal": "You can stand for Asifa with the influence of media But can't stand for Geeta because media doesn't support. Is that right for Bollywood people whom we youngsters follow.", "gourab__sinha": "@radhikaofficial why don't you post same thing when it happens to each and every girl. Yes, I stand up for her justice as well as for the other girls who have faced the same thing but you aren't. In Assam so many rape cases have happened but you didn't stand up that time, where were you? In West Bengal so many rape cases have happened, where were you then? Shameful.", "porkynx77": "Bollywood is truly a cesspit of deracinated filth.", "saumilpradhan": "Indeed shame on all Indians !! Can’t even imagine how horrible this act is. This is beyond evil!!!!", "kararalsaba": "You can send me over via chat so we are just friends and I do not want to bother any girl just friends do you accept or not", "murbiyaparesh": "Tum log boliwood valo kabhi bahiskar karna chahiye kyu ki tum log apni trp ke liye kisi Ko badnam kar sakte ho kya tum our tumhara boliwood kathva Gaye the temple dekhne kya tum log ladki ke mini Papa se mile ho bhi nahi na to fir itni confirm ke sath kese ke sakte ho k temple me reap huva he saram karo me tumhe unfollow karta he our Jo tumhare boliwood vale he na usko bhi me unfollow karta hu me kya sab Ko tum logo ka bahiskar karna chahiye", "htalesara": "can any body tell why the word hindustan used insted of india?", "abhinavkr_singh": "Mam jab tk court m baat shi nhi sabit hoti aapne kaise post ki ye pic don t u hve mind", "jeetsathe_123": "Khup chan", "the_warrior_breed": "Ashamed ho to plz hindustan mat aana ab 🙏", "bhattbhanubhai": "So sad.", "hardiplakhotra": "Ma Kathy's me that hu shidi chok", "ak.jasoos": "Why aren't you ashamed for the surat rape? @radhikaofficial", "vaishnavi___patil": "Are you also ashmed about the support of casting couch by Madam Sharoj Khan ! ?", "guru_.randhawa.77736": "Hi Radhika Apte", "vaibhav.single": "Geeta ke liye kyu chup hai Bollywood?", "ak.ash141": "I am proud hindustaani. तुम जैसे चूतियों को क्या पता हिंदुस्तान के बारे में ,,अपनी अय्याशी में लगे रहो,,अश्लील फिल्मे करते रहो,, I am hindustani. I ashamed of bollywood actresses", "the_rai_sahab": "Wow...", "ravinder.bhardwaj.5": "It is indeed shameful that you have chosen to give such a henous crime a communal colour by choosing to speak on only one case. Where were you when other innocent girls were victimised. Shameful", "arjunsingh_19": "then you cange uhr religon if Uh ashmed...", "mr_amit_srivastava": "Ye baaat aap to hi bole to achha hoga..", "raselchoudory": "hi", "keepsmiling307": "I am hindustan. I cry only crime against non Hindus. When crime happens with Hindus. I am secular.", "aksmb20": "Please leave then !!", "paulrajan890": "s u r right", "dinesh_dev_patel": "I love you", "vidnyan": "Blocked??", "ardracraft": "It's not about which religion u follow. It's about right of a child, no matter where they belong... And if celebrities want to influence and chanalize their energy to the cause, it's their choice", "arungandhi0952gmail.6824": "Tum log sap karthey ho publicity..", "firozputhenkottil": "then u sangies tell truth...Ashifa killed herself :P ?", "abhisek_subho": "Let the cbi enquiry reveal what's behind and why this selective outrage", "enlightened_yogi": "Radhika you too.. what opened your eyes all of a sudden.. whether you were in comma feom past many months.. ALL RAPES ARE BAD AND ALL RAPIST ARR CRIMINALS, You also joined the assholes club with your bullshit hashtag.. #getlost", "clickechic.it": "ottimo", "rij1316": "Dont come with this type of card protest, if u realy feel ashmed then come on street, but u dont have so much guts not only u,many others like ur type of people swara bhaskar, sonam kapoor, whatever is happen with that 8 years old gilr is realy painfull but there is others child also for them why not u all are raise ur voice.", "sonu.sonukumar.3954": "Aapko sharam aa rahi hogi Hindustani hone par mujhe nahi baki rahi baat rap pidit ke insaaf ki to mujhe mere desh ke kanoon par pura visvaas hai insaaf jarur hoga rape Hindu ki ladkiyon se ho muslmaan ki ladki se ya kisi bhi ladki se insaaf jarur hona chahiye mujhe Hindustani hone par Garv hai", "sonu_bairagi1": "मुझे तुज पर ओर bollwood दोनो पर शर्म है", "ranjankashyap508": "unbelievable", "amitsingh3502": "We are ashamed of you ... don't use word temple and Devisthan", "thepraveshsingh": "@radhikaofficial you should be", "psaundary": "Useless , publicity stunt", "im.nizar_khan2": "#बलात्कारी_विधायक को पकड़ने की #औकात नहीं और बाते #दाऊद को लाने की करेंगे! Bc 😠", "shekharmishra13": "what a joke .. shri ready (Tamil actors) ke bare me bhi kuchh bolte. Ensaf ke liye nude road pe khari hai but uske badle usko ban kiya jata hai... #shamedbollwood. jaha kam ke badle sone ko bola jata hai.. uske bad daraya jata hai kisi ko bola to ban kr diya jayega... I proud Hindustani but #ashamed bollwood in my country .. @sonamkapoor @reallyswara @divyankatripathidahiya @instantbollywood @pinkvilla @aajtak @manupunjabim3 @imanveergurjar @arshikofficial ...", "shah_ronak612": "You ppl just want to politize the issue... Y you ppl want to write Hindustan... It hurts every ppl sentiments... To benefit some political party.. Some bollywood ppl damage whole country s reputation...", "nicetryakash": "ABEEEEEE OYYY R***DI ...DEKHLE AAJ KA NEWS .. PAHLE PROVE TO HONE DE SIDHA LIKH RAHI HAI TEMPLE ME RAPE HUA ... ARE KUCH TO SARAM KRRR ... YES WE WANT JUSTIVE FOR ASHIFA BUT TU DEVI STHAL AUR TEMPLE LIKH RAHI ..TU HINDU DHARAM KO MAT LA BICH JABTAK YE SABBIT NA HO JAYE KI TEMPLE YE INCIDENCE HUA THA....AUR ABHI SOCH AGAR INVESTIGATION ME ATA HAI KI YE MURDER TEMPLE NAHI HUA THA ,TO S**LI TUJHE WOMAN HONE PE SHAME HOGA ...FCK U #shameless #flopactress #kathua #justiceforashifa", "vikaschandraupadhyay": "आ गया कठुआ मामले में देश की आंखें खोलने वाला सच..... रिपोर्ट – आमिर मुहम्मद अली जो मन्दिर इतना बड़ा हो के कैमरे की सिर्फ एक फ़्लैश में समा जाए उस मंदिर में 8 लोग लगातार 8 दिन तक बलात्कार कर सकते है? जबकि मन्दिर गांव के बीचों बीच बना हुआ है और मन्दिर में रोज ब्रह्म मुहर्त में पूजा पाठ शुरू हो जाते हो , और 13 तारीख को लोहड़ी का पर्व हो और लोहड़ी के पर्व पर भी मन्दिर में बलात्कार होता रहा हो? क्या आपको यहां सब बाते कुछ अटपटी सी नही लग रही है? क्या मन्दिर 8 दिन तक बन्द था? क्या मन्दिर में 8 दिन तक पूजापाठ नही हुई? यहां सब वोह सवाल है जिनका जवाब आजतक कश्मीर पुलिस नही दे पाई है।।।। अपराधी कोई भी हो उसको सजा होनी चाहिए फांसी मिले यहां भी मंजूर है मगर कोई मासूम को फंसाया जाये यहां भी जाइज़ नही है इस लिए सीबीआई जांच की डिमांड तो बनती है(साभार कठुआ मामले में और भी सनसनीखेज जानकारी सामने आ रही है आसिफा हत्या वारदात जनवरी की है। अब मामले को राजनीतिक नफानुकसान के लि‍ए प्रयुक्त किया जा रहा है। मेडिकल रिपोर्ट में बलात्कार हुआ ही नहीं है, यह सीधा सीधा मर्डर केस हो सकता है। जिस मंदिर में आठ दिन तक बलात्कार और लाश मिलने की खबर फैलाई गयी है वह भी झुठी है। *कारण मंदिर में कोई दरवाजा नहीं है,और मंदिर बस्ती के बीचोंबीच है*। उपर से मंदिर मार्बल का है। बच्ची के सिर व बदन पर मिट्टी लगी थी जो आसपास की मिट्टी से अलग है, संभत: उसे कहीं मारने के बाद मंदिर में रखा गया हो। अगर 8 दिन तक वहाँ बलात्कार होता रहा, तो लड़की को चीखने की, या यह सब होने की आवाज क्या बाहर नहीं आती? जब मंदिर में छिपने छिपाने की जगह ही नहीं है, और गांव के बीचोंबीच स्थित इस क्या आठ दिन तक कोई पूजा करने अंदर नहीं आया ? अगर आया तो क्या उसे यह सब नहीं दिखा ? वहाँ जितनी भी रैलियां हुई वह रोहिंग्या को हटाने के लिये हुई, ना की आरोपियों को बचाने के लिये। अगर इस मामले की अच्छे से जाँच हो तो इसमें अंत में जरूर कोई *रोंहिग्या* हो सकते हैं , जो वहाँ बस गये हैं। फसादियों द्वारा हत्या हंगामे के मकसद से भी की जा सकती है, जो दिख भी रहा है। मामले में जिस व्यक्ति को फसाने की कोशिश की जा रही है वह व्यक्ति सुरक्षा अधिकारी है और जम्मू-कश्मीर में रोहियांगों को बसाने का पक्षधर नहीं है। PDP की हालत कश्मीर में खराब है, जिस प्रकार वह *भारत सरकार* से गलबाहियाँ करते दिखी है उससे कश्मीर की कट्टर प्रजाती नाराज है, महबूबा उन्हें खुश करने में लगी है। तभी इस कांड की जांच ऐसे अधिकारी को सोंपी है जिस पर पहले से ही आतंकी संगठनों से सांठगांठ के मुकदमे", "prakhardgenius": "Unfollowed this Hypocrite", "techno__phile": "@sufyansufi313 osm yr bro", "kulshreshthatanvi": "Oh Radhika you too with the same narrative. Aah.", "n_r_g_81": "Please get out of my country ....", "shettypratiksh": "It's my thinking that a rapist doesn't have any caste he is an criminal so please stop saying all these Hinduism if u want to say any message then please check raftar's message I don't have any bitterness with you #loverespect", "lalit.syalde": "Shame on you too ma'am.without knowing the fact what media shown you accepted the things as it is...the pain of little Asifa is too much in my heart too but you know that devisthan has 1room 3windows and doors too can it is possible there? May b you don't have work to do so for the limelight you just blaming all Hindus as well hindu dharma too....shame on you", "thanos_from_titan": "Then come to my planet,we will live happily", "nareshbhardwaj755": "Ghanta ashamed", "misskomal492": "me too", "07_raslif_echu": "Proud of u", "sdaksh143": "@radhikaofficial", "heloderahul": "@radhikaofficial posting I am Indian I am ashamed, need justice for 8 year old girl. Whatever happened to that girl was really bad, and I stand with nation to justice for her, But being an Indian I'm not ashamed , I'm proud to be an Indian, I'm not ashamed because of few culprits, I'm proud because whole nation is United for her, I'm proud on my country because I know how our martyrs sacrifice for this country. I know people have anger about this case but that doesn't mean you should defame your country. Jai Hind", "bharat_mumbaii": "Fake", "clickerabhi": "Such an idiot.", "reddy_abhijit": "Who give a fuck what you thing. My country is great there are good people here.. And there are bad people like get your ass out of here we don't need people like you we have seen your sex scandal take care of you first and then think about this country.", "debkanta_majumdar": "Who told you???", "prakashali1011991": "Mil Gaya tucche logo ko, dusre ke dukh mein apna promotion karneka..🙄", "pavanmadhini": "I thought we lived in India.", "mayank_the_infinity": "What about one more placcard for Assam rape and Balasore rape case but you guys won't u guys never follow news when some memes u see trending in FB or Twitter then u all start photo shoot", "parulagarwal7891": "We want justice for her 😡😡😡😡😡", "abhishek_0616": "Bakwas", "awesome_stories_s1": "✌️✌️✌️✌️✌️✌️", "salman.capri": "In india there r 104 women raped per day.... a big shame to u..... this is not about religion this is about humanity.....! Plz try to understand.", "ranji_th": "❤️❤️❤️", "poduvalarchana": "Selective outrage doesn't sell as good as it used to honey. We r not buying ur drama. Raasta naaplo!", "rksaini1986": "You should delete this post. This case is totally fake and repeat this again for girls not Hindu no Muslim.", "theconqueror91": "Dark color pen toh le leti...", "dimple7209": "o", "hardeep_______": "@ganesprasad dei", "mr_omio": "get out", "saurabhsyt": "Shame on pujari who present that time", "nirmal_s215": "I agree and I can understand u.. well if u are willing to get married with me I don't have any problem with it..", "asrafuzzaman_": "Justice for Aasifa", "shalakamathure": "Find a safer country and move there. You just don't deserve Hindustan", "ajit_chaki786": "😥😥😥😥🙏🏻", "imranrock0": "Can you help me out by signing this petition? https://chn.ge/2IQaVHu", "abhishek_582": "Bhakk sali hypocrite", "_mido_22": "what s happen for this little girl is horrible", "irshad__na": "Hats off u..", "call_me_v007": "Itni Little girl ko kyu badnam kar rahe ho social media par us bichari nadan ko to pata bhi nai hoga uske sath kya ho raha,,apke ye sab status update karne se justice nai milega ,,, agar pakde bhi gaye to kya kar lenge gov. Jail me bndh usse jyada to kya fasi ,,ap log kya isse Justice mante ho lol shame kn you...justice hi dekhna hai to other countries me kya hota hai rape case me search kar lijjye...", "amolmorwadkar": "If u r ashamed of our hindustan then u can move to pakistan there will be very good respect for u...So move on...To hell with u....", "saadthesinger": "We are in Shamiatan not Hindustan ...", "i_pankaj_prasad": "thre r so many laws in Indian judiciary.......need to change d mentality", "tabish_khan.29": "We stand for justice", "sunnygupte": "The 1 who is left shame long back by doing porn films shudnt b ashamed of anything else now", "ansariafifah2041": "Justicefor aasifa India", "priyadarshanibo": "🙏🙏🙏🙏we should fight for her", "sindhuyushki": "https://in.news.yahoo.com/amphtml/uttar-pradesh-cleric-rapes-14-074749643.html?__twitter_impression=true mosque may bhee _ amend the placards", "rohanatturi": "They says that God is seeing everything but he does not do anything one day will come every woman rises there head and walks on street but I didn't understood wht the picture means", "dhruv.joshi.1042": "#https://youtu.be/VEz7Z6RqQuU", "nagskonaguthi": "Sad 😣", "aliafzali5444": "😗", "the_toughh_guy": "How come people like u selective in picking victims??? Decided to not to watch any Bollywood movies from now on... Get a life looser radhika apte", "hemangi_mak06": "💔", "zeus_sadiq": "I SENT THE HORSES BACK HOME by Anonymous Maai, I sent the horses trotting, And they found their way back home.  But, I couldn't. My legs that you thought were Swift as those of a deer, They froze. Maai, they froze.  But I sent the horses home.  Maai, them monsters, They had no horns or fangs, Or deadly long nails. But they hurt me. They hurt me bad, Maai. The purple flowers, The yellow butterflies, They stood there helpless.  While I sent the horses back home.  Maai, Tell Baba that I know, I know, I know he tried. I heard him say out my name, I heard him repeat it loud. But, I was sleepy Maai, I was tired. Them monsters, They hurt me bad.  Strange as it may seem to you, Maai, It feels like your warmth now. It doesn't hurt anymore. The blood has dried And it looks like the purple blossoms That swayed with me in the meadows. It doesn't hurt, Maai.  Maai, The monsters are still out there. And there are stories too. Don't listen to them Maai, Gut wrenching and agonizing they are And a lot you've gone through.  Maai, Lest I forget, There's a temple there Where lives a goddess. Thank her, For I think it's she who helped,  The horses find their way back home.  #JusticeForKhatuaVictim", "mahamad_n_mansuri": "waw mem ye hai indian girls salam hai aap pe love you mem", "rahulrao4": "You rise ur voice for Muslim victims only? 10 rapes happened in a as am in few days. ...tum filmy log sirf publicity chate hooo", "wupinglu": "Fuck india", "fahad321in": "I Respect the efforts you gys are doing ...", "i__m__nyk": "Yeh puri movie mei nanga ghumti hai yh hmko sikhayenge...sluts saale...🖕🖕 Pehle apne aap ka character thik karo..aapse achche to paise lene vaali sluts achchi hi..aap logto logo ke samne bs achcha bn rhe bo", "owaiz8976": "Our govt is so slow work about like this cases", "somscor": "See this is what happening...People have turned this into a religious issue.If other rapes were not highlighted of hindu girls,that was also wrong.So what people want to do they don't want to spread the word because she was a muslim girl.And are we all guilt free?We are blaming this star just coz she put up something and maybe of other rape cases she didn't do anything,what have we done?We also keep on hearing of rape cases everyday,but how many times have we responded to that?Sure many of us don't have a big reach,but have we tried posting and protesting on social media and spreading atleast to those friends we have on fb?We should first introspect ourselves,then judge others.", "devtheexplorer": "@radhikaofficial Bollywood itself should be banned we are sick of watching it on screen.", "vinitmr": "Hindustan, devisthan temple, how can u blame entire religion? We are shamed as Indian however like terrorists not having religion, criminals are not having religions. So stop doing double standards", "jairam_pandey": "Bahut hi galat post hai", "palla108": "You Bitch ... How can you blame entire Religion ... In Kashmir population how many Hindus are there . Does Hindús has the courage to raise slogans \" Jai Sree RAM \" in Kashmir ??? If slogans like are are came out . means .. Use your brain Bitch ... Stop blaming the religion . @radhikaofficial . Crime is a crime . but what happened is shame . but the culprits must be hanged .", "rekhatawani": "Because of this Stupid actresses exposing men are not able to control their emoticons and becoming rapists", "sunnybruseman": "Yaha har koi janta h ki rape kaise kiya jaaye kyuki apki industry ye knowledge provide karti crime petrol aur savdhaan India jese pornological serials k dwara ji Han ye serial ye nai batati h ki mujrim ko kitni beheram saja mili ye serial ye batate h ki mujrim konsi Galti k wajah se pakda gaya, rape kis kis tariko se Kiya jaa Sakta h jyada tar episode nabalik yonshoshan k hote h usme sex ko itne intensity se dikhaate h ki sala sex h ya romance pata na chale aur vahi ashlil episode saare media waale bhi dikhaayenge apki industry hi saare crimes ki main wajah, jis desh me biopic unlogo criminal pe bante ho vaha Kya hoga raees,d company,lokhandwala,wadala,Sanjay dutt ki biopic Shri bhagat Singhji mere bhagwanji pe maine 4-5 movie se jyada movie na dekhi hogi par criminal pe aik saal me 10so movie banti h abhi to jisme criminal ko hi bhagwan dikhaate h abhi to legend asina parkar ki movie ko bhi appreciate kiya inlogo ne @radhika apte aap logo koi Kyu respect de jinko respect earn nai karna aati ho", "anto_nishanth": "Stop it, act on it ,, make a mark by forcing government to make death as punishment for rape and don't say ashamed guilty should be punished. Not the other way", "theofficialh2": "Fucking monsters. Sad shit.", "vishwanath_45": "What do you think of # Sasaram, Bihar ?", "abhishek_gupta.8": "Don't drag the country between this... it's a sin did by few countrymen...nt by the Country..!!!", "tejsingh00784": "No media coverage for girls with no name. Because other 5 are hindu girls gang raped and killed by Jihaadis during last week. We cry for Asifa but why no one feel when crime on Hindu children. Rest in peace Indian Media, congress, bollywood, liberals.", "abinashbijayakumar": "shame on all of us", "thomasmathew.arch": "She said spreading news to people who already know the news happening in this country. Hashtagging ain't gonna do shit.", "jyotsnay10": "Kashmiri Pandit lawyer, Deepika Thusu who’s alleging threats for fighting Asifa’s case, was selected by Indira Jaising as one of the 15 lawyers to work for her NGO, LCWRI.  Jaising’s another NGO was permanently cancelled for FCRA violations in Dec 2016.", "raj_borana11": "Bc har jagah pe hindu tempal q...wo muslim hai is liye", "manoj_jagtap0990": "कोपर्डी च्या वेळेस कुठे होती तू आणि काय संबंध रे हिंदुस्थान लिहायचा आज कशी काय जाग आली तुला आणि तुला लाज वाटती का? आपण काय करतो काय नाही ते बघा आधी आणि तुमचे फोल्लोवर्स जास्त आहे असं काय टाकू नको की ज्याने करून जातीवाद होईल मि तर म्हणतोय तुम्ही काय बोलूच नका या विषयाबद्दल उगीच राजकारण नकोय आम्हाला आणि कृपया या असल्या लोकांचे सिनेमा बघण सोडून द्या यांना follow पण करू नका यांचा काही ही एक संबंध नाही आणि मला एक सांग आली का कधी कोणत्या मोर्चा ला भांडण झाली तर तू काय मध्ये पडणार आहे का कोणाच्या नाही ना मग काय बोलू पण नको तू राहती इकडे कमवती इकडे आणि काय बोलतीये तुझ तुला तरी कळतय का उगीच काही तरी बोलायला लावू नका आम्हाला तुम्ही आमच्या मुळे आहे ना मग आमच्या मुळे नाहिशे पण होताल परत काही बोलायच्या आधी हजार वेळा विचार कर", "aj_ajays_world_": "कहा गई वो सब पलिटिकल पार्टियाँ वाले जो आंदोलन करते हे कहा गए वो करनी सेना जो ८०० साल पुरानी देवी पद्मावती माता के लिए सड़क पर निकल आए थे. कहा गए वो निवृत फोजि अन्ना जो बार बार उपवास पर आ जाते हे  कहा गए वो ह्यूमन राइट्स की बात करने वाले??? कहा गए वो हमारे मोदी साहब जो अब किसी ओर की तरह मौन हो गए हे  कहा गए वो सज्जन महिला ए स्मृति ईरानी जी , सुषमा जी, ममता जी , सोनिया मेडम , प्रियंका मेडम जी ओर भी काफ़ी सारी महिला ए जो विमन एमपोवेरमेंट की बातें करती थी???? कहा गए मेरे संबित सर जी कुमार विश्वास जी राहुल गांधी जी मनीष तिवारी जी अमित शाह जी योगी जी अखिलेश भाई जी ठोको ताली वाले सिंधु जी ओर भी काफ़ी सारे पलिटिकल पार्टी वाले  वो बुर्का पहन कर 3 तलाक़ पर एहतेजाज करने वाली औरतें कहाँ छुपी हुई हैं ? आसिफा आवाज़ दे रही है अरे कहा चुप बेठे हो???????? अभी बोलने आओगे या २०१९ के चुनाव के वक़्त?  अशिफा जेसी कई लड़कियाँ हे जो आज इंसाफ़ माँग रही हे वो हवस का नंगा नाच करने वाले के लिए कोई सख़्त क़ायदा कब बनेगा?? आज मेरी एक मुस्लिम बहन पर ये हादसा हुआ हे कल किसी हिंदू पर भी होगा, किसी राजपूत,गुजराती,मराठी, बहन के साथ भी होगा???? क्या तब भी ख़ामोश रहोगे????? तीन तलाक़ पर क़ानून बनाने वाले लोग आज किसी बलात्कारी पर क़ानून बनाया होता तो आज हर घंटे देश की हर बेटी की इज़्ज़त बच जाती. में यार देश में विकास बाद में लाओ यार पहेले देश की लड़की को तो सलामत रखो????? नहीं चाहिए हमें बुलिट ट्रेन नहीं चाहिए हमें कोई चुप सरकार नहीं चाहिए हमें कोई फ़न स्ट्रीट  बस हो सके तो बस इंसाफ़ दे दो उस बिचारे पिताजी को जिसके बेटी के साथ ये हादसा होता हे  सेव गर्ल्ज़ , सेव गर्ल्ज़. मेरा एक वोट भाजप को गया हे में बलात्कारीओ पर कड़क से कड़क क़ायदे बने ऐसी मोदी सरकार से विनती करता हु. अजय सोलंकी. जय हिंद जय भारत", "sandhya.n0611": "Seriously all of us are focusing on religion no one is talking about safety of women😠 this is very ashamed", "avinashpathakofficial": "Unfollowing..... justice for asifa but these Bollywood stars are disgrace to society who are raising there voice for a particular religion", "bishu786": "Shame on u", "shahid.khokhar.5": "Aese logo ko bech choray pr phasi hone chaiye", "shukla.daksh": "तुम सब इसके लिए कितना भी रो लो कितनी भी इंसाफ की मांग कर लो सरकार को इससे घंटा फर्क नही पड़ेगा।। ये कोई नई बात नही है कि किसी मासूम का बेदर्दी से बलत्कार हुआ है आज से पहले कितनी ही मासूमों की जान इसी प्रकार जा चुकी है।। किसी को खबर नही की उनके दोषियों को कोनसी सज़ा मिली।। हर बार कोई न कोई ऐसी घटना होती है जब तक मामला गर्म रहता है सब के सब इसकी कड़ी निंदा करते हैं और जब कुछ दिनों बाद मामला शांत होता है तो किसी दूसरी मासूम के शिकार होने तक शांत बैठ जाते हैं और फिर नया मामला नई कड़ी निंदा सोशल मीडिया पर विरोध प्रदर्शन बस।। इसी तरह देश की बेटियों के साथ दुष्कर्म होता रहता है लेकिन सरकार इसको लेकर एक नया कानून बनाने पर विचार नही करती है।। जब तक संविधान में इस आरोप के लिए बीच चौराहे पर मीडिया और पब्लिक के सामने सज़ा ए मौत का कानून नही बनाया जाएगा और एक दो आरोपियों को इसके घाट नही उतारा जाएगा तब तक ऐसी वारदात को अंजाम देने वाले लोगों के अंदर कानून के प्रति डर नही आएगा।। मोदी जी से निवेदन है कि जब देश में 1000 के नोट बंद करवा सकते है तो ऐसी वारदातें क्यों नहीं बंद करवा सकते।। यदि मेरी बात में दम हो तो अधिक से अधिक शेयर करें।।", "ada_psk": "Go to Pakistan you bitch. And take your Hindu bashing sympathisers with you.", "jal2amt": "sali randiya bhi balatkar pe gyan de rahi hain", "smoke_one_everyday": "Plz don't waste paper", "mitin33": "🇮🇳", "abhinav_ar": "I have those bastered and people who are busy delaying the investigation for their political benifits.", "emo_boy1432": "#Justice S", "umasangari_arumugam": "It's very sad to read this kind of news over and over!!", "nishanthhunsur": "Being biased is legacy of Bollywood and you are one more added to it", "avphotography89": "Why didn't you ashamed when a hindu girl was raped in kerala, many girls in kashmir, rampur... And are you ashamed of showing your private parts in videos... Atleast clean hairs... Morron", "stewwweee": "People like you have a special place in hell ...what a 8 year old girl knows about her religion ?", "lokareddy_3": "Really ashamed 😥😥", "qoutesinsane": "FOLLOW MY ACCOUNT FOR QOUTES WHICH ARE INSANE AND AMAZING 👆 👆 👆 👆 👆 👆 👆 👆 👆 👆 👆 👆 👆 FOLLOW MY ACCOUNT FOR QOUTES WHICH ARE INSANE", "akshaypatil6345": "I am ashemed of bollywood", "ali00005753": "😻😻😼", "akash.chauhan2810": "Kitna paisa mila iss foto ka", "vishwash.agrawal": "जो कठुआ वाली घटना पर विधवा रोना मचाये हुए है उनसे कुछ सवाल है पोस्टमॉर्टम की रिपोर्ट के अनुसार आसिफा के साथ बलात्कार हुआ ही नहीं..... और उसकी हत्या भी मंदिर से बाहर हुई है क्योंकि आसिफा के शरीर पर गीली मिट्टी चिपकी हुई पायी गयी जो आसपास के जंगल में पाई जाती है इसका मतलब लाश मंदिर में फेंकी गई है..... क्योंकि मंदिर में रात को कोई ताला नही लगाया जाता..... और आसिफा गुर्जर बक्करवाला समुदाय से है जो काफी देशभक्त समुदाय है इस समुदाय ने ही कारगिल युद्ध के समय अवैध घुसपैठ की खबर सेना को दी थी.... रोहिंग्या आतंकियो ने एक तीर से कई शिकार किये है.....पहला देशभक्त बजकवाल समुदाय के मन में हिन्दुओ के लिए जहर भर दिया है और पूरे हिंदुओं और मंदिर को बदनाम कर दिया है.... मंदिर में कोई कमरा ही नही है तो क्या एक हफ्ते तक बलात्कार खुले में होता रहेगा और कोई देखेगा भी नही ? खुले में एक हफ्ते तक लाश ऐसे ही पड़ी रहेगी और कोई देखेगा भी नही ?", "atozmarathiofficial": "Justice For Asifa", "_the_focus_studio": "उन हराम लोगो को फाँसी होना चाहिए ....😢", "avinashshambharkar": ",क्यों लोगोकी सोच इतनी घटिया हो गयी है।क्यों लोग इतने हद तक जाते है।इसका जिम्मेदार कौन है ,ये लोग या हमारा कनुन्,जो इनकी हैवानियत् को और बढा वा देता है।आज हमारे देश में हर दिन में न् जाने कितने बलात्कार होते है.please think about that.🤔😡😡😥😥☹️", "santosh_kompalwar": "Didn't u felt ashamed while promoting ur nude body & having sex on the screen for money in Parched", "atishkatkar84": "Everyone should be ashamed of this", "i_saurabhpatel": "Rip", "aaqilawanbhai": "#Wah_____❤❣❤", "zeeaaahh": "Holding a cardboard to show support... really... soo stupid!", "rout.debraj": "Chup.", "makiyasample": "I'm so sorry😢😭", "aj_jaryal": "One more Bollywood hypocrite... 🙄", "say_sayzz_leo": "So wot else can you do???????", "ramamurtyreddy": "So sad", "sumitasom": "Yes it really afread.", "wasi6638": "Ashamed", "amarghorpade": "I have never seen people calling Hindustan.. but after rape incident all the media, celebrities, my Muslim friends started calling #I Am \"Hindu\"stan. #I Am Ashamed", "shahamitk": "U weren't ashamed for doing same in movie?", "param.gunjiyal": "@shivaaysingh9 .... Tere naam type karne m b mujhe saram aa raha hai... # itne attention chaheye toh kuch achieve kar ke dekha gandu....", "cdn_engineer": "It certainly is shameful. I can't comprehend why so many people have hateful comments directed at you for the faults of other sick humans. They should use their time and voices to correct the problem as you are, rather than to complain about who says what and when. They need to find a productive outlet for their anger instead of creating more problems and hatred. They should write their officials instead of their celebrities, and spend their money on protecting children instead of the theater to show what really matters to them.", "banerjiabhishek": "Great promotional tool for all.. What else", "rxdr.babo": "What is this bullshit? Why can’t you say I am India ? Why Hindus ?", "ritika2009": "@radhikaofficial What about the other girls?? Does nobody care for any girl apart than Asifa?? Has anybody even noticed the 5 year olds, the 3 year olds, the 12 year olds... seriously? Are their lives not important?", "loveyoudarling69": "The culprits should get punished & the law for rape should get tougher . Bollywood is India and rape is india shame on guys", "iron_made_in_": "😑", "ramthakur8055": "Jo log esa karte hai un logon ke saath bhi same hona chahiye tab un logon ko pata chalega us dard ka..😢😢", "keon_23": "कोपर्डी सारख्या घटना झाल्या तेव्हा तुम्ही \"हिंदुस्तानी\" कुठं होता रे पिच्चरवाल्यानो ... 😞😠 #justiceforallrapevictims", "the_specialzzz": "😢", "deepak9007": "THAT IS TRUE..... IM HINDUSTAN.......", "anmol_king_of_romance": "\"Justice\" for Asifa!!! I'm just watching since few days how these media houses, politicians, bollywood and some of my friends are emphasizing \"Asifa\" rather than \"Justice\". Reasons are obvious, it's only the name that has the masala which the media and politicians can use for their benefit. Neither have they really ever cared about them, nor will they care today. Otherwise till date I had never seen that the \"Real\" name of any rape victim is made public. Even the 2012 Delhi rape victim was (and is) called Nirbhaya, which was not her real name. Till yesterday, people (I'm not mentioning you individually, you yourself know) who used to say criminal is a criminal, he has no religion, the same people are writing lines like \"Few Hindus raped and killed a Muslim girl\". Seriously? One incident, and u lost all ur conscience? Why don't we focus on \"Justice\" rather than determining her religion. After all this is what we have always taught one another. So why not today? Why Hindu or Muslim? Remember, politicians or media will just look out for making a profit out of the incident. But people like you and me, we are just concerned about one thing, and that is \"Justice\", justice for that little angel, that little soul! Hinduism or Islam have nothing to do with it. And yes, regardless to mention, the culprits should be punished, punished so hard that no other dog dare to even think of touching the daughters or sisters on the roads out there. \"Justice\" for Asifa!", "bhati_s": "अब #मस्जिद के पीछे मिली 4 साल की पायल की लाश जिसको मार कर दोनों हाथ उखाड़ लिए हैं आबेद मुहम्मद ने, काट ली पैरों की उँगलियाँ. #JusticeForPayal", "jhha008": "Let’s wish that all the crime which is happening in Kashmir shall get death punishment", "gaurav_tripathi_21may": "Kathua incidents takes place to thousands of innocent girl child every year.And one day we came out of cave and start yelling. Rapist would continue to rape if a proper law will not be passed. Death penalty for raping girl child below 12 year of age. That's what country needed.  Every ones wait for other incidents to happen. Then came out with a board written with shit.We want is a proper law.Which would be so harsh that one think twice before committing a rape", "_i_m_r_j_": "😢😢", "dane_barot_official": "Jishko b sharm aa rhi ho vo chutiye log chale jao hindustan se.... madarchod jis thali me khate Ho vaha hi thukte ho... kya proof he ki mandir me hi rape huaa he!!! He koi sabut?? Bsdk", "rohin_andotra": "I am from Jammu & nobody from Jammu is protesting in support of Rapist , they’re protesting for CBI probe so that #Asifa gets justice and a fair enquiry should be conducted. Stop spreading Fake Propaganda that Jammuities are supporting rapists. Please enlighten me what’s wrong in demanding CBI probe ? #Stop_Blaming_Jammunities", "swapnesh_swap": "Ashmed urself first one news comes n Ur started blaming our Culture #Stop_blaming_Jammunities", "hidayatullah4847": "Hi", "santu.naskar.7146": "Hi", "prashant.kore.775": "Then F O and P O....", "siddharthtripathi76": "Randi motherchod", "priyankabansal._": "Yes , I am Hindustan. I am made up of people, , not any religion. You people are responsible as there is no humanity left. No religion teach you wrong deeds. Stop faking and start taking responsibility of ur own acts. #needjusticeforhumanity", "lokendrasaran": "👌👌👌👌", "ziidpaul": "#Rapist..#Terrorists..#Criminal have no RELIGION only when they are MUSLIMS.... #Justic_For_All_Rape_Victim ...............", "manishgolu.singh21": "besharam", "ruthshyvonne": "I am ashamed too", "avinash.liv": "Ghar se bahar niklo be a Vigilante if you lose faith in #Justice", "pradeeppanwarddn": "https://m.facebook.com/story.php?story_fbid=10211544377353018&id=1472199831", "imsaghir786": "😢😢😢", "sadiqali7861": "support from pakistan u have a heart", "amitmehta_78": "That’s why i have huge respect for Sonu Nigam...", "manugarg1": "Yeah feeling bad", "sanky8793": "We have to implement such a punishment for murderer that no one will dare to do that again,", "akhalaque_ahmed": "#justiceforaashifa", "samsontrueb": "Hello", "hammadnomo45": "Soòo sad 😢😭", "______________bpv": "😩", "anks131": "shameful", "ningappagouda": "I AM BHARAT  I AM ASHAMED OF SELECTIVE OTRAGE I AM ASHAMED OF HYPOCRISY  SAD THAT YOU ARE MORE CONCERNED WITH \"DEFAMING TEMPLES AND DEMONISING HINDUS '' THEN TO GET JUSTICE FOR THE VICTIM  #CONDEMN_RAPE_NOT_TEMPLES", "prashantkumary": "You prostitutes. Bloody bitch .", "dreamgirlnaina": "@radhikaofficial isme hindustan ka kya fault,us particular logo ka h jo ye chize krte h.kuch ache log bhi h,jo din raat hmare desh ka naam roshan krne me lge rhte h", "hmtipu": "I am a Canadian-Bangladeshi. I want justice for Asifa.", "rajiv1985in": "Please don't do this photo oops when a particular community is involved I do protest this coverdly acts they should be punished only by death as god can only give Justice but please also protest in other cases as well as a woman should be respected by seeing which community she belongs to when terrorist does not have any religion how come a rapist has one", "sagarkulat": "Well said @radhikaofficial", "_zitha___": ".", "_max_vishwakarma_": "#Justice for Asifa....", "ravi___07___11": "#RIP", "hidde2016": "JUSTICE FOR ASIFA", "ankkii_nancherla_": "Be mature. :)", "auwalpluskhan": "Ya Allah 😭😭", "x.nawab.x": "agar is ladki ko justice nai mila to pata chal jaayega hamare desh ki sarkar kitni sachhi hai awr kitna insaaf kar sakti hai woh saarein arrest to hue hai magr unko publically saja na di gai to samj lena saare k saare jail mein vip treatment mein hai hum sab ko ek hi awaz uthani hai punish them publically", "behram_khan_sanzer": "I can't believe that a human being can do a shameful act like this but now I believe that they are not a humans.i am a ashamed as a human being and as a man.plz for forgive us #Asifa 🙏🙏 #JusticeforAsifa", "santysatish": "Do the same thing for Hindu girls also", "iamsugandha": "Bloody social media drama sitting in AC room and posting the picture will posting a picture will change the mentality? Will posting a picture will change the rape? If it really matters you must have come on road to protest not sitting in AC room", "james_fedrerr": "@zigmi_wang_bhutia madarchod u bloody sister fucker u better learn how to respect our Hindustan otherwise I'll put bamboo in your ASS bloody asshole", "lost__in_your_light": "😒", "jayeetahar": "I am ashamed too...", "monikarana000": "shame", "vyom_kidman": "Only likhne se kuch nhi hoga", "raavan_.7": "Agree", "messiah_photography": "Shameful situation in India", "jiyadalikhan": "Wrong grammer, it should be ' i am Hindustani,", "hirawsome": "https://m.facebook.com/groups/1833537916975400?view=permalink&id=1981394668856390", "ramesh_ram97": "Vary sad mam,,that brutes who had done this must punished", "junaid_attar": "Support nd respect. ....", "hippy__sunshine__": "Never saw you holding such cards n bashing Padres n mullas when they raped.", "pallavisingh2386": "Saare bollywood k stars ko wahi mudda q bhata hai jo congress k political agende ko shoot karti hai", "saghar_saleem24": "That's bad", "007isaq": "👍👍👍🙏🙏😓😓😓😓😓😍", "kanakmukherjee": "Im ashamed too....India", "preethab": "this is the end of humanity", "er_sushm": "& y the or what is that \"needed\" to make a # before \"⛳temple⛳\" in particular ! Won't the terrorist from Pakistan hide in \"masjid\"; the y not u dare to make \"#\" before masjid 👍", "janki_k_raval": "Ok @radhikaofficial when were you when Salman got bail in 2 hours in hit and run case ? When were u when he again got bail in blackbuck poaching case ? You celebrities are bunch of hypocrites.", "deepakshriwastava": "Unfollowing now it self from everywhere", "smita_deb": "I am ashamed too.", "patelketan99247": "Hi", "me_ngupta": "Don't be hypocrate. There are many more girls who are raped every day. Why only #kathua. Look into Assam.", "thepoortraveller": "Everyone is ashamed. But nothing s happening. They can change notes. Change taxation. But can't change mentality or the Hipocricy of us, Indians. Many more may die till govt understand the priorities. #kathua #ashamed", "5432.t": "A harsh action should be taken to minimise such cases...", "koundal_anish_journalist": "Ashmed", "7chandan": "Yar up me hua too ..kuchh uske bade me v jejo naa plzz @radhikaofficial", "ashishanshumali": "Exposing and fantasizing people around with movies is what u all can do ... That's not our culture .. actors like you for cheap publicity and money can go naked in front of world ...why can't bollywood movies be as it was in 70-80s where nothing vulgarity was shown ...today we can't. See many films even with good stories with family ...", "vijayarana.007": "Zehar kha le fansi laga le behan chod rand sali tu jis type ki movies banati hai use dekh ke log rapist hi banege tum jese baand logon ka hi sara gand dala hua haiteri maan ka bhosda behan chod bloody bitch", "rupesh8059": "u r right but when u become naked then we all r ashamed of indian culture", "hiraklivee": "Sorry, can not give like...", "piyalmazumdar": "No one here is justifying the incident,they are just saying to raise your loud voice for hindu girls also which no one does this way and because of this selective secularism our country has come to this edge.Read this also.Most of the media houses, almost all of them haven't made any news on this incident till the date.This is just an example,i can give more such examples. http://www.sangbadpratidin.in/kolkata-police-refuse-to-recuse-abducted-girl-father-moves-hc/", "er.rahulkumarvashistha": "Hi Radhika.i am shame on you.why are using country and devi , temple names and such words .it really very sad what happened ? U don't have any right to scandalize my country .👊👊 for u.", "wankhedejaijeet": "\"Hindustan \" is not a constitutional word. Only India and Indian words are used in our constitution. So please say \"I am Indian. I'm ashamed... .#JustisforAasifa https://t.co/Vfw8wWNmTV", "somit12": "Wo koi nhi dekhwga..sab kashmir ke piche bhag gaya", "pgodase17": "I support this but Bhai par kuch bolo yar . This is hypocrisy of Bollywood and cricket stars. They analyse then react.", "arczion": "Ashamed and shocked, nothing in the world justifies what was done to that girl. We need actions against these people.", "dheeraj__w": "Haven’t heard your voice when Hindu women and young girls were raped and hacked to death by muslim men...", "ticklemegiggles": "#justiceforasifa 🙏🏻😞", "ashish.manral": "Don't post such things instead come on ground do at least something,u Bollywood ppl have this habit if any such thing ever happens just click a pic with such board,if you r hurt still u have time for a pic..", "chintsji.21": "I m from #rapistindia", "ashutosh_pati_tripathi": "Apne campaign ki batti bana kar daal lo apane me, yaha rapist ki baat naa kah kar Devisthanaur temple ki baat kaha se aa gayi. Aur tum log toh khud apani izzat bech bech khate ho. Koi izzat hai tum logo ki har din naya customer chahiye tum logo ko.", "avinashverma613": "I'm also ashmed", "imrahulahir": "I support you", "kochukudi": "Oh big deal.. What u have done else???", "imvirajk": "First go to the roots.. it's a false report given by doctor given under mehbooba mufti's gov. She was not raped and she has been murdered by rohingya Muslims", "gurudathshetty": "Fuck off for this kind of selective outcry....", "vinuvinkan": "Oh shucks !! You also turned out to be another dumb Bollywood chick .", "shabanakaarif": "👍😥", "sarfaraz3713": "Hiiii", "amitnayak0786": "We also..", "wierd_creature2995": "Ashamed thing", "dope_dilor": "https://www.newsbytesapp.com/timeline/India/20296/95877/muslim-cleric-aide-rape-14-year-old-inside-mosque", "s_m_hawaldar": "😢😢😢😢😢", "aerostargopi": "Is the issue with rape or temple????? Ppl should know how to react to an issue..", "parasharking": "#ashamed of Hindustani .. #beashamed of situation & people not country ... #feelsbad #noknowledgepeople #", "sanujak": "Middle finger Namasthe India", "a_b_hisek": "Why you...plz mam separate the religion out of it....it will create conflict.justice for that innocent girl should be the priority... not the place...investigation is still going on @radhikaofficial", "taha1815": "I Fuck hindustaaan", "subhranillodh": "Eram..😢😭😮😮", "an.unknown.buddy": "You are stupid. You cant see its just a political dirty game. I wonder how come some people achieved so much without brain ?? @radhikaofficial", "waseemansari5927": "Sorry yaar", "draculadevil": "Oh my god this is first rape case in our country", "ashupbobade": "It wasn’t a rape. It was a murder . Please watch this first https://www.facebook.com/capricorn.abhishek/posts/10211544377353018", "silenteyes_ananthan": "India need army not in border but within India...", "harshil_1504": "मैं #हिंदुस्तान हूँ....!!! मैं जितनी #अशिफ़ॉ हूँ उतनी ही #गुड़िया हूँ । यहाँ #बलात्कार पर भी #राजनीति होती है....वो भी #धर्म देखकर..!!! अगर मैं #अशिफ़ॉ हूँ तो ख़बर हूँ और अगर #गुड़िया हूँ तो चुप हूँ....!!! मैं #रोहिंग्या को बसा चुका हूँ, उनके द्वारा किए गए #बलात्कार और #क़त्ल का गवाह हूँ। #मैं_हिंदुस्तान हूँ...!!! प्रतिदिन #लव_जिहाद का शिकार हूँ, मगर ख़बर में नहीं हूँ ख़बर में सिर्फ़ #अशिफ़ॉ_ला_सकती_है_मुझे, मैं #रजनीतिक_मीडिया पर #शर्मिंदा हूँ #मैं_हिंदुस्तान_हूँ। #Justice_For_All", "9ninedivine": "Paid artist's", "shruti.shrivastava": "This comming from you, such a respected actress is indeed shamefull.. bringing religion into the picture will take light away from the core issue..what happened was horrific.. dont mislead people..", "iam_sandeepram": "Hang them all ...🔫⚰🔫", "_douja___": "What I love about radhika Is that she is so natural she doesn't care about putting make-up cause she has the natural beauty 😍😍👌", "35_yr_old": "selective outrage....what abt Assam rape incident", "jamesbond4390": "#justice_for_asifa", "vintage_saga": "Sad", "ankush_a_": "Guys don't waste ur time here. Simply boycott her. May u guys have forgotten their actual color. No one has stand when 5 people's were killed by a celebrity. No one has protested (from these celebrities) when other celebrities has said ..India is not good for us... Indians are intolerant. Again someone has said Indian is full of intolerant activities. No one has stand against them... because every so called Bollywood celebrities are there to make money. Even no one has stand against Assam, neither Kannada, not Patna, Kolkata... Ohhhh it's simply. When news has already spreaded...do something to be more famous... let's show to the wrld how big my heart is... Neither they has gone to stand beside that family.....Guys, Don't u have other works? Can't u guys spend quality times with u family? Can't u watch Netflix? So why the heck we are following these racist people's? Lets unfollow & simply boycott. Don't forget the past too.", "sohan_lookha": "It's nt about hindu r muslim,it's about punishing those assholes who did this....so there is no temple r mosque involved in it as there is no fear of any power to such people ......so u celebrities please twice check ur stand", "g.prachii": "Selective outrage is the cause of the problem. She's an 8 year old, period.", "kakktsuu": "Thr shld be only one religion called humanity", "vivek_krish1978": "Very bed..", "sourav.das9634": "Justice for asifa", "sivanimandy": "I am ashmed of Indian and ashmed of Hindu. Stop praying Hindu gods.", "bakulpanchal555": "band karo ye sab natak", "brijesh0076": "Sale ka kati do", "iampraveen04": "https://m.facebook.com/story.php?story_fbid=10211544377353018&id=1472199831", "navinnatraj": "@radhikaofficial - You being a celebrity, ensure that you use all your connects to provide justice to that sweet child. Stop doing all this nonsense of holding placards for no reason.", "amit5474kumar": "insaaf hona hi chaye saza do rape karne walo ko", "beingsyedshahnawazraza": "Kaha ja rha hai desh.😔", "iamdivyaprakash": "Good.. Emotional acting.. Just awake in installments..", "parvezaryan": "ek baar moat ki saja dekar to dekho takat h kisi ki jo rape kare .....", "deepakglobus": "SAbhi keliye aise hi nikalna chahiye post madam", "kuunal9600": "Get lost..", "apurv_singhrajput": "Ieee mukhia zamindar pujaari sabki Nazar kharab Hai FAGUNIA #manjhithemountainman", "bappttu": "Rapists of many Kashmiri Hindu girls are hailed and celebrated as heroes, mujhahids, freedom fighters of Kashmir. Where were you then ?? Bloody coward !! UNFOLLOWING YOU !!", "theawesomedas": "They are criminals and they don't have any religion. If they (criminal) are hindu, then I feel ashamed of the fact that such things happened.", "gunner7293": "Hindustani??", "manupreet340gmail.com77": "Baat hindu ya muslim ladki ke rape ki nahi..baat insanyiat ki hai jo utni berehmi se ik 8 sal ki ladki k sath kiya ..jo k marr chuki hai..haiwan gai jo ause kaam krte hsi chahe hindu jo muslim ho...", "akshay.more17": "Jab Kashmir se humare bahan betiyoko ke saath un logo ne aise hi Kiya tha tab to aap Bollywood wale chup the pure Desh me kisine kuch nahi kaha to aaj kyu bol rahe ho police or government apna Kam kar Rahi hai tum log khali publicity ke liye photo Nikal rahe ho or dusri baat isme Hindu or Hindu logoke gods ko mat lao", "s.r.saraf": "Why only asifa . India need justice every girl.", "jaikisshantulsiyaanii": "Same here", "harish_c_narula": "Aap ki Likhi baat sae sehmat hoon. Pataa nahi yeh log apni bacchio, behno ki taraf kion nahi dekhtae, aisa havaaniaat bhara kadam uthane sae pehlae.", "pappuaa": "सासाराम के लिए भी कुछ बोलो", "aninditagarg": "Really ashamed of U now.. Self propoganda ka koi mauka nhi cchorti! Tumhare banner pakadke photo kheechne se.. Aur mere comment likhne se kucch nhi hoga.. Use ur star power to create an unrest.. Take up a mission, tell me what can we do together. Banner pakad ke sirf cute pics kheechke likes mat batoro.", "chinmaya_27": "Parched dekho ja kar.. Aap jese Logo ke liye hin Yanha par Rape ho raha hai sala band karo.bahana bazzi .. Ye post sirf apne promote ke liye hi kar rahe ho tum..", "humandamu7777": "💪💪💪💪💪FIGHT", "mdarshad7558": "Sb mil kr birud kre", "shaan_sagar86": "Yr dont criticise when someone is trying raise a voice for us. I am not saying she did everything right in her life but right she is someone where media focuses and let her if possible support her. Politics is when she says anything about voting parties she is seeking justice for the girl.", "krajneshk": "Happy to see u taking up this issue and addressing it. Rip daughter of india", "viveks173": "The truth is something different. A propaganda is being run by the media and Bollywood bimbos https://m.facebook.com/story.php?story_fbid=10211544326671751&id=1472199831&_rdr", "sayali2108": "Shame on all actress and actors from Bollywood ,for giving communal turn to this case ,she was girl that is enough it doesn't matter she was Muslim or hindu or sikh or Christian.😡", "real.aamirkhan": "#justiceforasifa", "mamtalash": "Hi", "yashwanth_yashuu": "I'm ashamed as I'm in such a great country 😞", "tcdayananda": "First we should tech to respect the girl in early age so this will not append", "shubhitr": "Ashamed of celebs like you who are on payroll of political parties. Stop politicising these issues", "vijaydantuluri": "Rip society", "vickyoberai2606": "Yes its shame on indians humanity people conscience", "ajy_dhadhal": "नोट- मैं किसी बलात्कारी का समर्थन नही करता हूँ। लेकिन कठुआ रेप केस को लेकर जिस प्रकार आज सभी लोग बोल रहे हैं, क्या वे लोग आज ही जागे हैं?? कोई बोल रहा है यह हिन्दू आतंकवाद है, कोई बोल रहा है मंदिरों में ही ऐसा होता है। मैं याद दिलाना चाहूंगा कि निर्भया रेप-केस के आरोपी को जब 10 लाख रुपए और सिलाई मशीन बांटी जा रही थी तब यह हरामखोर बॉलीवुड वाले कहाँ थे?? जब मस्जिद में मौलवी ने रेप किया तब यह क्यों नही बोला गया कि मस्जिदों में बलात्कार होते हैं? आश्रमों में महिला शोषण और बलात्कार की घटनाओं पर ट्वीट करने वालों के हाथ मे तब लकवा मार गया जब मदरसे में ऐसी घटनाएं सामने आईं। गुड़िया रेप-केस में कौन सी सरकार ने कार्यवाही करने के बजाए उस मामले पर मिट्टी डालने का प्रयास किया था?? याद है या भूल गए?? बुलंदशहर रेप-केस में मीडिया और तत्कालीन सरकार किसको बचा रही थी?? याद है या भूल गए?? मोहनलालगंज रेप- केस के आरोपी को सजा मिली क्या?? जब बॉलीवुड के भड़वे लोग मुस्लिम आतंकवादी के पकड़े जाने पर आतंकवाद का कोई धर्म नही होता है यह बोलते हैं, तो बलात्कारी का धर्म कैसे हो गया?? एक बात और बताओ, रेप-पीड़िता की आइडेंटिटी, फ़ोटो सब गुप्त रखा जाता है, पर मीडिया में उस 8 वर्ष की बच्ची की फ़ोटो भी दिखाई जा रही है और नाम भी बताया जा रहा है तो मैं क्यों न मान लूं कि यह एक मनगढ़ंत साजिश हो सकती है कश्मीर के हिंदुओं के विरुद्ध?? और जब कश्मीरी पंडितों की माँ, बहन, पत्नी, बेटियों को घर से उठाकर ले जाकर मुल्ले बलात्कार कर रहे थे तब बॉलीवुड वाले कौन से बिल में घुसे थे?? एक नजर में यह एक साजिश का मामला अधिक लगता है बाकी मैं किसी बलात्कारी का समर्थन नही करती हूँ, यदि अपराध सिद्ध हो तो फांसी पर चढ़ा दो सालों को, लेकिन औकात में रहकर बात करो और दूसरों पर उंगली उठाने से पहले अपने गिरेबान में झांको। देश मे बढ़ रहे बलात्कारों की सबसे बड़ी वजह यह बॉलीवुड ही है, इसी को क्यों नही बंद करवा देते हो??", "abdulnadaf7ab": "😢😢", "vvikram2404": "Art ke naam pe Jo Bollywood me nangaa naach karanewaale log ab social issue pe baat kar rahe hi...", "rehena_ali": "You are a sick person I wished that happened to you then you would know how important it is to not let that happen to ANYONE", "its_farhan_aziz": "Shame on the those people and temple pandit they are involved it,...!", "john.5556": "It looks like 12 or 13 years", "wonderviewer": "Today one thing I learned, God is not exist in Mandir, or if God exist, he can't even protect that child from that bastards.", "planetfitnesskanpur": "Bura karuga aise logo ke sat promise", "rajaramdeb79": "😢😢😢😢😢", "tonyhk420": "#justiceforasifa🙏", "rashidtkz": "🧡🧡", "kshoeb7387": "Great girl love u.sis", "vishesh_nahata7": "Whats the purpose of holding a placard and circulating it on social media? Im also disgusted and angry about this but what will it achieve if i also hold up a placard! Certainly rapes wont stop! I think rapists don’t care whether we’re ashamed or not! Even after arrests, the judicial system is such that they will be free in a couple of months after the media hype dies down! The same protests happened after Nirbhaya but it didnt deter the men to rape another girl! That is why i dont like such modern protests which in a way gets more publicity to the celebrities than the cause!", "iliyasmalik": "लूट कर मासूम की आबरूं, जालिमो तुम्हे नींद कैसे आयी होगी। तुमने तड़पा कर उस खिलते फूल को, अपनी बेटियों से कैसे नजरें मिलाई होगी। कसूर क्या था शायद कोई खता नही थी, कलेजा नही फटा जब वो चिल्लाई होगी। तुम इतने बेरहम कैसे हो दरिंदो, सोचता हूं तालीम ऐसी पायी होगी। #Justic_for_Aasifa", "iamrahul_k": "#kathua", "iakhileshg": "Unfollow # ashamed", "sandeep.ranade": "Unfollowing", "rockstarali_": "Ager ek insaan ke sath nainsaafi ager huwe tab sare insaaniyat ke sath nainsaafi huwe hain i stand with you @radhikaofficial", "anuj_sh": "Mam don't make any opinion too early this news isn't right. You will get to know this in coming days. Rohagnias are involved in this n Asifa was killed in January. Mufti sarkar not allowing CBI Investigation in this case coz then truth would come out. You are celebrity we admire n follow your doings please don't follow anything blindly or just like that. Thank you", "vickyjee_vj": "Thanks for supporting once again thank you very much", "bk_1407": "I feel so bad .", "bj.fddi": "😡😡", "prasannagondhale": "They never say Hindusthan but when it’s time to shame a religion they will use that word. Where were you when other girls were raped and killed, all rapes are not the same?? Pathetic hypocrite.. shame on you..", "ablatif55": "Love u mem i support u", "king_____942": "#justiceforasifa🙏", "bhavesh05": "Its time to unfollow u radhika apte, u should never do like this, y u stand for particular girl, Stand for all girls.", "sankhobragade": "If girls are having periods they won't allow her, but they rape her in temple.", "arunraju_naspuri": "😭😭😭", "rajveers8979": "😔", "monklotus": "What's the solution to this crime epidemic practice of RAPE? An infection to humans which rurns them Demons. How to cure that source of criminal mind?", "sunita6959": "No words to say remained mouth st hut so", "sullyjoshua": "And it is said by porn actress. For movie debut she used Tussar kapoor even ekta kapoor thrown her out #bitch", "prasadchawan1964": "..........sorry for all womens........if I would have been PM I will immidietely adopt Saudi Arabia's law to hang them publically😈😈😈😈😈😈", "manojmammenjohn": "#Kathua", "bhardwajgourav": "@radhikaofficial Where were you people when all other rapes happened in our country... Yes we will question you bcoz you people think it as a joke. We never saw anyone before raising the voice for all these. Holding a banner in hand and clicking a picture and circulating on social media is very easy come out from your comfortable zones and fight for the justice then you will get the real picture....", "mit_023": "Dear Radhika, it's really unfortunate that 8 year old girl raped. And required to be punished. But I request can u please do the same for Assam and Bihar victims.. They were also passed through the same....", "anudeep_julapally": "I request each and every citizen who respect our country to unfollow people like this who will degrade our country our people These who are trying to disturb the unity among the different cultures among india and gain by degrading india among the other countries... So pls i request let us start the campaign of UNFOLLOW of people in social media who are hazardous to country.", "tiiisshhaaaa": "I am also ashamed 😢😢😿😿", "er.kapilgurava": "We want justice gor asifa", "narendersingh4u": "कश्मीर में मुसलमानों द्वारा हिन्दुओ का जो रैप होता है उस पर तुम लोग चुप क्यों रहते हो ? #secularism", "ayaana_khan143": "End of humanity", "_suhani_si_ek_ladki_": "😔😔😔 but still mentality is not going to change .....when i saw people protesting and doing candle march after nirbhaya incidence i thought ki my hindustan is changing .. now they are understanding everything......but i have been proved wrong......people just show fake sympathy ...just wait for 2-3 days more everyone will turn back to either salman khan aur stupid memes ....", "alphaa111": "Shame", "santkumar123": "Shame on the celebrities who on informing by others raise such slogans... Slogans should have mentioned all rape culprits should be punished not only I katua.. All are our daughter's not only in katua... Bloody sick people", "hari_ips": "Shame of u don't add religion on this", "bhavesh_thummar": "23 जनवरी को पुलिस का दिया ये स्टेटमेंट बता रहा है कि लड़की की लाश मंदिर में नहीं बल्कि जंगल मे पाई गई थी। जलील मीडिया गटर में तो गिर चुके हो,अब कहाँ गिरोगे।", "ram_nivas_verma": "मुझे लगता हैं कि ये सब करने से कुछ नही होगा हम सबको एक जुट होकर गुनहगारो को सज़ा देनी चाहिए", "varmarajeshk": "Very sad incident. Hope the perpetrators of this heinous crime are punished.", "miakankshabaswant": "People. It’s about a small girl getting raped n b4 this there are lots who got raped but if we don’t take a step as we didn’t in the past, may be you or your little sister will b the victims or even me for that matter. I don’t want that to happen. So I will stand with her. Stop talking about religion in this, just come together n fight for this so this situation don’t repeat.", "onepurposeband": "*Your thoughts on ASIFA case*... no political religious comments pls... just give a few lines how you feel personally and send it to drjaellis@gmail.com along with a pic so that we can post it on our *fb page www.facebook.com/heartfoundationNgo also like the page too*"}