{"mujithabakc": "OMG ... What a great comment section ... whataboutism at its peak", "kratos_phani": "Burying head in mud at time of national issues", "s_u_b_h_r_a_s_i_s_h": "A girl from Raichur,Karnataka named Madhu got brutally raped and killed a few days back...So where are your placards now ??? Have you drank fevicol ??? Voice problem...or you don’t have any film upcoming recently.... You are the biggest hypocrite living on this planet...shame o you.... No media coverage...No celebrities holding placards shows how biased and hypocrite you all are... #justiceformadhu #hypocrite #pseudofeminism", "_anonymous_creator7": "Well we are going to make a WhatsApp group for single girls n boys......if u wanna join n want fun , pleasure, gf or bf send ur mobile number to me........for more details dm", "thealishairhaideri": "❤️❤️❤️❤️", "f_h_k_f.k": "What about Sri Lanka you lanti face", "hsnnali7": "you need to study more.", "qby0909": "God bless", "nirvanajewels": "😭😭😭😭😭", "fennyg.designs": "Cool", "may979in": "🙁", "haridassir": "😢😢😢😢", "catch_the_case_": "Nice picha!! Stand a chance to feature on our page just buy case from us&send us selfie🤳with cover we will post it in our story😊", "sidiphonegraphy": "what about Sri Lanka no post for that? @radhikaofficial", "rayanbayan2008": "Noo😢😢", "upali.mullick": "Hypocrisy!!!", "souldiary21": "🖤🖤", "aryanmaurya0730": "😢", "modon_singh": "😂😂😂😂", "rratna416": "What's this", "dhineshkmd1409": "😢😢😢", "__akash__bheel__": "Ncy", "iamded_777": "Just bcoz its trending, you are feeling bad for it😮", "moontakim.rohan": "😫", "wanted_baby01": "Sb dhong hai", "ayeshaayaz123456": "Need a Website ? Visit. https://creativebun.com", "_atreyee_chaudhuri": "Extremely sad😭", "ballersumss": "Try having a wider approach to life and not just which tunnels towards your own culture/religion etc. This was a loss of a global heritage site and not just for that particular country. Peace.", "abhijeetkosambiofficial": "So sad...", "dinesh.mathrani": "Kya hua aur kya h ye btao koi i wanna know", "rehan_aslam101": "Jb New Zealand ki masjid me terrorist attack hua tha tb apka net khrab tha?", "desai.madhukar": "Devastating. Can't think of Paris without it.", "thats_how_i_got_to": "#MandirWahiBanega", "existential_skizm": "Reminds me of norwegian church burnings 🔥🔥", "ritzonnet": "What happened", "thevikasjamadandi": "Siachen meh hamare jawan ladrahe hai😌", "mimansha_mandal": "Hypocrite", "bhoopendragolu9839": "Accha hya", "akki2269": "Which place is ds...?? 😱😱", "muskans_place": "TN vv", "here_comes_the_ms": "For fame you will do and post watever you want..😏 why can't you have a eyes on india @radhikaofficial", "abhijit2250": "Bad NeWS", "arun_maurya_": "🙁", "vaislek_kavi": "मी नोत्र दाम  गेली नऊ शतकं सीन नदीकाठी थाटात उभं राहून कित्येक सोहळे जवळून पाहिले राज्याभिषेक पाहिले युद्धाच्या झळा सोसल्या हे नुतनीकरण माझ्या जिवावर बेतेल असं वाटलंच नाही केवढा भयंकर तो आग डोंब माझ्या देशवासीयांच्या अश्रूंनीही विझला नाही मागे राहील्या फक्त आठवणी आणि सांगाडा -कवी वैसलेक✍", "shuchita_shrinika": "@aryashashank", "vinay_v_l": "Really saddened 😔 Big loss of world heritage", "shak_khan10": "Why is it a loss? These churches are full of pedofiles.", "manashisonowal": "😢😢😢", "rajattarafder": "😥😥😥", "samsrabon": "Bangla Song is always popular to all Bangali. They are very lovely people and they love music very much.Cover song listen by many more people. Ans so that they can listen it more easily thats why we made this app. https://itunes.apple.com/us/app/bangla-cover-songs/id1141283137?mt=8", "prasanna_kumar_jena": "What happened", "lonegypsywolf": "Sad for something that can be rebuilt while not sad for the ones who sacrificed their life’s for us", "drabsingh": "To whom is this a loss ?? Possibly a gain for them with a fat insurance claim and 400 million donations. 800 years of sins in there wiped off. So probably a good thing. #idiot !!", "rupesh999999": "Go there and live.. why r u live in India? Why r earning money in India? U eat food of India and feel sad for France? Have you ever feel same thing for Kashmir and our Indian army in Kashmir? #@ if u have answer than plz tell to us", "karthik.gundavarapu": "Bullshit", "rana_balan": "😢", "santosh.786": ".", "saumyabt": "Sad😐", "yane.in": "Kabi India k bare m soch lia kro @radhikaofficial", "best_astrologer_in_india_": "[[[[[[[[[[[[[[[[[[🌹माँ भद्रकाली ज्योतिष केंद्र🌹] +91-8054417981)( बंगाली शक्तियो के माहिर){astro meghraj shastri}get immediately solution for your all problems} astro meghraj shastri ji (a to z ) problem specialist. 24 hours available result 101% guaranteed. ((#Love_Guru)) स्पेस्लिस्ट- लव मैरिज ,वशीकरण, सौतन दुस्मन छुटकारा ,पति पत्नी अनबन गृहक्लेश ,कर्जा मुक्ति ,निःसंतान, whatsapp+91-8054417981 1. Love problem solution 2. Love marriage specialist 3. Settle in foreign 4. Ex lover problem solution 5. Desired love 6. Husband wife disputes 7. Childless problem solution 8. Divorce solution 9. Business related problem 10. One side love solution 11. Extra marrital affair solution. 12.vashikaran specialist Contact & whatsaap no. +91-8054417981", "daastan.4040": "Kya farak padta hai yaarrrrr Kisi ko?? Kaunsa Apne baap Ka Hain??? Faltu me hi bakchodi pel rahe Hain SAB.. #prayforparis bakchodi hi Khatam Nahi Hoti Yaha", "prabhu.chawla.52": "B😢😢😢ad", "yuvrajsinh_b": "I didn't find tour post when we lost our soldiers ! - ek kutiya he jo khati he hamare ghar me or paltu kisi or ki he !!", "saurabh__8": "😔 but. I dont knw. Y people liking this post 🤦🏻‍♂️", "hashmikingofficial": "😢😢😢😢", "sadam_ada": "indians are such fucking physcos, if she feel sad about, so is good. why u comparing pulwama attack with this ??", "sahirchamp": "It's not breaking your heart, no one gives a rat's arse about it", "meriambr3": "I like that 😎😎😂😂😂😂", "deva_ansh0": "CELEBRITY 🙏", "gyalpowr": "😢", "min2891": "Checking comments to see the number of what-aboutist nationalist fools responding to a simple personal viewpoint. Omg.", "amitkumarbaral": "Go there... we I won't need uuh", "darshan_h_sheth": "😢", "nishad1685": "Sad", "nakkytravels": "India mai isse jyada tagde incident hote hai lekin saale in angrezo ki aulad ko tb kuch feel ni hota", "singh_roaring": "जिस देश में रहते है उसके प्रति कुछ कर्तव्य तो सबके ही होते है , जब देश इनके साथ खड़ा होता है , तो इनको भी तो देश के साथ होना चाहिए", "nandyala_karthik_reddy": "@radhikaofficial its very sad all the monumental architecture bring destroyed... and sone one have donated the church 10lk euros...its happy to here...", "bhattacharjeeprithwish": "😔", "one_fallen_knight": "@radhikaofficial what about decaying indian monuments ? Ain't they heartbreaking ??!", "tom_anand": "So sad to see this...☹☹☹", "theengineernextdoor": "😂😂😂😂", "chrisn579": "😭", "sl92h": "💔💔💔💔", "followyourdream81": "Really sad", "yayasamory": "🙏", "d.neelanjan": "The Notre Dam Cathedral in Paris..... history lost but still God is in control...@radhikaofficial . God bless u.", "bouk_sanaa": "🙏😔🙏", "vaibhav.gautam2929": "घंटा इन अंग्रेजो ने सारी दुनिया बर्बाद कर दी। भगवान ने बिल्कुल सही हिसाब किया है। कुछ लोग इसे रो रहे है जैसे उनका बा.........मर गया हो???? हमारे वीर सैनिक जब शहीद होते है तो कुछ नही बोला जाता इन लोगो से।।। shame shame shame... दर्द इतना है तो वही चले जाओ मराठा होके मराठी होके छत्रपति शिवा जी महाराज को याद नही कर पाते गुडि पड़वा याद नही आती ये सब बकवास याद आ जाता है सरम् करो कुछ तो सरम करो।।। अब तो सुधर जाओ।।", "r.aajj": "Fake People", "sullyjoshua": "Are you say same thing about ram mandir? For your knowledge it was in our country", "aharondixit": "😔😔😔", "luizantoniluiz1449": "Não Apareceu ninguém tentando apagar o fogo nem um Elicooptero! Para jogar água Misericórdia!", "puncuz": "Reading all the comments I feel There is a big miss in how a lot of these ‚haters‘ are raised. It’s not normal behaviour. We need more psychologists and councillor’s. But then Indian parents will say psychologists are not proper doctors! It’s all screwed up! Haters it’s for your good... do something more productive then using jio free internet to troll! Get a life!", "fatemagandhi": "Can't even bear to like this!!", "murtuzami": "It’s her account, her feelings, she decides what to post what not to. If anyone feels offended, just bloody unfollow. Atleast, by unfollowing you guys would do a lot better to yourselves. Ek achi neend aayegi gussa na nikalke 😄", "nishana720": "So sad", "prollytrippinskrrrtskrrtskrrt": "Yo Muslims are talking about mosques thay were demolished and Hindus are talking about the temples. I just grabbed the popcorn. This comment Section is burning harder than the cathedral", "moni_krishna": "Are you from Paris? Where the hell hell your were when our Indian solder got matryrd for your peace ? #FakeIndian", "v._rikhi": "Oh God", "adityadeshmukh1": "Hua kya h bhai?", "m_i.c_h.a_e.l_j.o_s.e_p.h": "People out here are so so, I mean they’ll start terming that person as Anti National or whatever. Just because a person shows sympathy towards some other country or a person.", "bhagya__007": "yess really grt loss", "_thalaivi": "😭😭😭😭😭😭😭😭😭😭", "jsaifuasath": "@jamz.yosi 😟", "nature.travel.foods": "😢", "pritamsahaku": "Kabhi kabhi india v dekh lia karo, paisa humare pocket se hi jata hai", "renuka.sharma.16718": "🙏🙏🙏🙏", "that.60s.gal": "@radhikaofficial memories will always remain intact ... beautiful exterior and interior", "_vinod.krishna_": "Post karne ke liye bahana chahiye bas ..!", "let_rock_here": "😦😦", "kareenav26": "Absolute hypocrisy.", "piyush.jimmy": "I was an big fan of ur style n attitude , but this post make u in low , hypocrites. Unfollow u , for this post", "amoghgade22": "Heart doesn't break when indian soldiers die😒😒", "anamika_pandit21": "To all the people who are questioning her right for feeling remorse for the loss of a sacred place. Well guess what you my friend are the part of the problem. Huge. Fucking. Problem. Known as declaring people anti national here and there. You guys have absolutely no other job than this. You are actually the real Indian happy? Now let people fucking be who don't want to reach your level of ReAlnEss. Get your butthurted ass somewhere else you stupid fuck. Let the girl live. There are way more important things to be concern about", "vronicattt": "The whataboutism in the comment section is strong... 🤦🏻‍♀️", "vjloveall": "😥", "arun_k_mish": "🤤😞", "nezmerv": "France deserves it. They screwed/stole/bombed many other sacred and religious heritage. This ones a sweet Cosmic Karma 🆗", "dhruvvvvssss": "Oohhhh 😑😑😑😑😑allaasss", "aleenachohouhan888": "😢", "pt_roadtripper": "Indeed very very sad", "mendez98_s": "Hypocrites...there are a lot of Hindus temples destroyed everyday in India. She hasn’t even mentioned once 😡😡😡👎👎👎👎👎👎👎", "i_aasiyasheikh": "Posting pictures shows our love towards our country? No i dont think so.. Praying for it means something more than posting pictures ...if she has posted it, its her choice.. Who all saying abt the soldiers did anyone except posting pictures & stories went & did something for the family of the soldiers?", "joyd94": "@that_capricious_laila.... Why doesn't a fatal fire in a Mumbai hospital invoke these feelings of heartbreak...", "rude___boy": "Babri masjid k bary me tu aise khayalat ni they app logo kay .. wo bhi bohut historical place thee", "im.sharad": "💔💔💔", "rajsinghpvt": "Can some one tell me what the fuck is going one.Every one is posting this and writing heart breaking caption.And tell me what is this ?", "mehta.niket": "Never seen your broken heart when Indian ancient temples were on fire", "morehardik55": "😢", "prodbynaman": "😂😂😂😂😂😂😂", "deeptiarora_mkr": "😔", "dildar5235": "Insano k lost py b kbi dukh ka izhar kr den", "priyareddy_87": "Lol", "ronnygnair": "Right. Time to build a hospital! #HospitalWahiBanayenge", "the_shubham_salunkhe": "देशातलं बघ बाई आधी लगेच बाहेरच्याचा पुळका येतोय 😐", "jeeva7165": "Great snap", "varun.s.l": "😍😍😍😍", "mayureshchonkargmail.co": "Kay ahe he", "gupta_mohit_007": "Hypocrite 😋😋", "gaayo_marathe": "Time to unfollow", "ne_abrm": "It’s burning n peps liking it", "deepanita1111": "Tum jayso ka herat only money k liye brk hote h.. Tum jaysi paiso k liye Kuch v krogi", "poonam_mahalwal": "14 Feb (Pulwama)ki to ek bhi pic nhi daali...ye badi jaldi update de Dia hume", "iamnomileo": "That's sad", "vikash.poddar.98499": "😢😢😢😢", "madhuk_jha": "Big fan mam. We r sad as well. There is no comparison but trust me these comparisons in ur comment section are from the hearts. Ye nhi hona chahiye tha. Desh prem posts krk hi nhi aata sahi baat hai. Pat kya ye trend bhi aap logo ne hi start nhi kiya. As a daughter of a soldier I feel bad to see these comparisons. Cuz loss is loss. But our jawaan's loss was as much painful or should I say more valuable than a historical building. Soo please u celebrities stop making fun of the emotions of ur fans. This is heartbreaking.", "yousaf_0_o": "😂😂😂😂😂😂💪💪💪", "arunodoi_bhatta": "What about indian monuments ever posted about them.. hypocrites", "amruth_pk": "What's that", "walia.rachna": "🙄yes it’s a great history loss. Which can be rebuilt. If everyone would be more emphatic towards loss of daily lives. I would relate. It’s alright. 🙏🏻", "sonalseyes": "😞😞", "israa.djili_official": "😢😭", "theobijoy": "😢", "agorhibabaji": "💫whatsapp पर जन्म दिनांक व फोटो भेजकर जीवन का समपूर्ण हल जाने mo.+91-8107549573 📞📿🕉 माँ काली की शक्ति और साधना से हर समस्या का समाधान घर बैठे मात्र 3 घण्टे में करवाये वो भी गारन्टी से तो इंतजार किस बात का फोन घुमाइए ओर अपनी हर समस्या का तुरंत समाधान पाइये । हमारी सेवाये 👉 💗प्रेमी प्रेमिका की हर समस्या का समाधान, प्रेम विवाह,💗👪 पति पत्नी में अनबन ,कारोबार ,👔 नोकरी की समस्या ,कर्जा मुक्ति , 🛬विदेश जाने में रुकावट आना , घर मे किया कराया का समाधान , 🕎जादू टोना का इलाज ,वशीकरण ,ब्लैक मैजिक , 🎲लॉटरी नंबर, सौतन दुश्मन छुटकारा , समस्या कोइ भी हो मात्र 3 घण्टो में समाधान संपर्क mo. +91-8107549573", "irfan7582": "Very true", "dipakmashal": "I have been there many times. It is an irreparable loss, French architect can reconstruct it but new thing will be new.", "dis_is_malik": "😢😢", "aayazbagwan": "Very Sad. What a loss.", "amzyamzu": "😭😭😭😭😭", "karanbhardwaj1987": "kaha phoonk diyo", "dineshbabar_dinu": "Very bad..", "itskanchansingh": "🙄🙄", "sampadagejji": "💔", "dadd.y____": "Why the smoke is also like Godly", "anamikasharma278": "🌹🌹🌹", "jte_vinayak": "😕😕😕", "hard2art": "Is it heart breaking!!!", "uchihaavdesh": "Yea? What about our Indian buildings ? Ever posted about them ?", "madhankumardesai": "Oh my God 😱", "ganeshji_s": "Yaaaa", "reachpriyapk": "Omg", "ashoksoni1808": "They have architects who will make replica, probably", "dibyendughosal": "So sad", "anhadhsinghbrar": "Sad 😔", "mahabubur_rahman_": "😆", "taniya_vk": "what is it ...", "vikeshkumar1515": "So sad", "0_utkarsh_0": "Have a look at my story to know the truth 👆👆", "dushyantwarshe": "🔥", "_its__teja_": "😔😔😔😔😔", "ijaynil": "Uncountable!!", "tanujvashishth": "Loss secene but yes photography is grt.could be one of the slam book pic....", "jimlloyds": "truth be told, there’s nothing that expresses how truly devastating the news of the fire at #notredame has bought a sudden chill of shiver down the spine of us all across the world..", "nishanttw": "Loss of all generations", "utkarsha_1132": "💔", "yuva.kalavidha": "😭", "vishnu_shastri.ji": "World Famous Gold Medalist Pandit Vishnu Shastri Ji. -ब्लैक मैजिक विशेषज्ञ ----- -----वशीकरण विशेषज्ञ ------🕉 ----- प्यार समस्या समाधान ------ ----- खोया प्यार वापस ----- ------ अपना प्यार वापस प्राप्त करें ----- + 91-9521244783 सभी समस्याएं समाधान और अपना जीवन बदलो / पति पत्नी विवाद / इंटर कास्ट प्यार विवाह / काला जादू / अपने प्यार को वापस लाओ, जीवन में अपने पूर्व प्यार वापस प्राप्त करें, पत्नी प्यार, हस्बैंड प्यार स्पेल, व्यापार की समस्याएं आदि। बस एक कॉल आपके जीवन को बदल सकता है। 72 घंटे में परिणाम प्राप्त करें पंडित विष्णु शास्त्री जी के द्वारा अभी कॉल करें और चैट + 91-9521244783", "foysal5906": "Rip😂", "akmattack": "There are many monuments and heritage buildings that are decaying in India.. They need your attention @radhikaofficial", "abid_agha_khan": "😓😓", "pranaybinekar": "Aab waha Hospital, orphanage ya school banao..", "sinhaayandeb": "😮😯", "sandip.hullale": "Please provide more context", "iamsaad97": "You Called You Self A Human . How Disgraceful All Of You . I feel this incident with my heart and Sad Too But You People’s are Double Standard Coz You Don’t Have Humanity In Your Hearts For Muslim Community. Muslims Are Burning & Murder All Over The World No One Notice Or Feels Sympathy with Muslims #disgraceful i was a Big Fan Of Yours But Unfortunately you are Equal to All Those Racists. #peace", "jerinjose79": "🙄😔 to hear", "nish_soni": "so sad :(", "nomadic_nush": "😔", "indraneeldan": "True", "sawariyaaa": "💔", "dolly.gogoi.982": "💛💛💛💛", "lalitriyan": "💥💥💥💥🔥🔥🔥🔥🔥🔥🔥🔥loss", "shoukeenzz": "😨", "gayakwadamol": "😭😭", "_deeply_heathen_": "Karama gonna hit both Abrahamic religion amd their heritage for what they did to this world!!", "rahul_singh_rs": "Bc.. kya fark padta hai...tb v photo me dekhta tha...ab v photo me hi dekhunga🤔", "klaudzied28": "Heart breaking ... To see such beautiful ....go in flames..", "patel_shailesh_9241": "😮😮😮😮 God...", "siya_sinha_": "😢😢😢😢😢😢", "deltaman68": "Those flames aren't half as hot as you Radhika.", "shrepho": "https://www.vox.com/world/2019/4/15/18311696/notre-dame-cathedral-fire-collapse-spire-paris", "triviumpr": "Indeed, what a loss!", "sanjib.pradhan.961": "Madam what happened??", "shahrik_8888": "Wow", "vipul_kmr": "Well they will make it again. Don't worry!", "soham092": "💔", "badmdfkr": "🙁", "aashiq_onhunger": "Did you ever visited , false people", "govindthakker": "🙏💫", "art_window__": "💔", "bernardcolaso": "😞", "premologues": "Truly 💔", "iam__kr": "@radhikaofficial isn't the same which happened to Madurai Meenakshi temple? 😶 Why not the same reaction?", "ezaaddollah": "Al-Aqsa was also burnt at the same time. FYI.", "phttiinikkr": "😥", "_sav_rana": "@radhikaofficial is it not possible to construct it back ?", "sanjh_er_pakhi": "☹️", "guruji25122018": "🕉️ {दुनिया जिनको रब्ब का रूप मानते हे!}🕉️ 🔱गुरु जी 🔱 .Get Back Lost Love Specialist .. .Love vashikaran specialist ... ★ Your privacy is our policy, ★ WORLD NO. 1 ASTROLOGER Call & WhatsApp-+91-850-484-9222 🚩चमत्कार को नमस्कार🚩 विशेष – लवमैरिज स्पेस्लिस्ट जैस से: - मांचहा प्यार, मांचाही शादी, मांचहा रिस्ता काम - करोबार विदेश यात्रा, शादी सयोंग बंधन आदि समस्याओ का समाधान घर बेटे करवाए अबतक आप का काम क्यों नहीं हुआ .. .. जानन के लिय फोन करें CONTACT US : -+91-850-484-9222 💫भारत के { no 1 📿ज्योतिष💫whatsapp chat on mo.+91-850-484-9222📞📿🕉 माँ काली की शक्ति और साधना से हर समस्या का समाधान घर बैठे मात्र 3 घण्टे में करवाये वो भी गारन्टी से तो इंतजार किस बात का फोन घुमाइए ओर अपनी हर समस्या का तुरंत समाधान पाइये । हमारी सेवाये 👉 💗प्रेमी प्रेमिका की हर समस्या का समाधान, प्रेम विवाह,💗👪 पति पत्नी में अनबन ,कारोबार ,👔 नोकरी की समस्या ,कर्जा मुक्ति , विदेश जाने में रुकावट आना , घर मे किया कराया का समाधान , 🕎जादू टोना का इलाज ,वशीकरण ,ब्लैक मैजिक , 🎲लॉटरी नंबर, सौतन दुश्मन छुटकारा , समस्या कोइ भी हो मात्र 3 घण्टो में समाधान संपर्क whatsapp on mo. +91-850-484-9222", "singershalini": "😞😞", "sidharthbuddha": "That scene in before sunset!", "gitalijade": "😢😢😢😢😢", "_.hitankar._": "Sacred game season 2 kab ayega🙂", "_ishwartorani007": "😔😔🙏🙏", "jerrin_joy_john": "😱😱😱😱😱", "palomadepomade": "❤️❤️❤️merci", "subhashdtta": "Sad", "ajayekka": "💔💔", "simrat_bhangu_": "france🙏🙏", "chavaprudhvi": "huuu sad news", "iamsaumyashukla": "💥💥", "solve_love_problem235": "🕉️ {दुनिया जिनको रब्ब का रूप मानते हे!}🕉️ 🔱गुरु जी 🔱 .Get Back Lost Love Specialist .. .Love vashikaran specialist ... ★ Your privacy is our policy, ★ WORLD NO. 1 ASTROLOGER Call & WhatsApp-+91-850-484-9222 🚩चमत्कार को नमस्कार🚩 विशेष – लवमैरिज स्पेस्लिस्ट जैस से: - मांचहा प्यार, मांचाही शादी, मांचहा रिस्ता काम - करोबार विदेश यात्रा, शादी सयोंग बंधन आदि समस्याओ का समाधान घर बेटे करवाए अबतक आप का काम क्यों नहीं हुआ .. .. जानन के लिय फोन करें CONTACT US : -+91-850-484-9222", "manshihazarika33": "😢😢😔 Unbearable news...", "vikrambisht_15": "🔥🔥🔥", "all_problem_solution_786_07": "जादू टोना का इलाज ,वशीकरण ,ब्लैक मैजिक , 🎲सौतन दुश्मन छुटकारा , समस्या कोइ भी हो मात्र 24 घण्टो में समाधान संपर्क whatsapp contact +91-8905452280", "priya.kbajwa": "🙏🏽🙏🏽", "guptamukesh_kumar": "Kaha ka hai yah photo", "roheena10": "Yehhhhh... Beautifully historical thing... 🙏", "philosophersazkaban": "Never visited but saddens to see such beautiful monumental architecture being destroyed but thankfully most of the artwork from inside the church is saved.", "jav.islam": "Same incident happened during 1920 radhika. They are showing it on news right now.", "rockermr": "🤣😂", "ilaydawdn": "@ilayda.rr._", "sidheshvarmayilsamy": "Its something bigger than loss 🤯😓", "mr_sumitwagh": "😘😘😘", "xoxo__k__xoxo": "😔😔", "shruti.arya__": "#shrutishona0 #shrutiarya20 ▆.•°``°•.¸.•°``°•. (  #🇳‌🇮‌🇨‌🇪‌ ) ☔ ❄ `•.¸ 💞 ¸.•` #🇨‌🇺‌🇹‌🇪‌ 🌹 🌹 💚 ° •.¸¸❥❥❥═══❥❥❥ 📱📱📱📱📱📱📱📱📱📱 ▆.•°``°•.¸.•°``°•. (  #🇳‌🇮‌🇨‌🇪‌ ) ☔ ❄ `•.¸ 💞 ¸.•` #🇨‌🇺‌🇹‌🇪‌ 🌹 🌹 💚 ° •.¸¸❥❥❥═══❥❥❥", "princejhunthra": "What happens", "cartoon_gfx_": "HMU FOR SELF PORTRAIT 🖌 ✅LOGO🌉 ✅COVERS🎇 ✅CARTOON 🔥 ✅ANIMATED VIDEO🌌", "unfilteredennui": "@roy_samriddhi", "yashmittal058": "what happened??", "__nibin": "😢", "toolazytobehuman": "It really is sad isn't it", "rock_rider007": "850 years old church"}