{"nafisamullick": "I am thinking of getting new winter wear for this party season! #WardrobeRefreshSale @aayatmallick12 @kashafaafreen @ayeshaqama", "piceditor_a7777": "Wohooo! Great opportunity ...I love to buy denim jacket and new shoes for me.. Best for this winter season @sparklingbliss_778 @vishakha_4444 @aesha_3507 #WardrobeRefreshSale", "miss.dreamer2323": "I want to buy beautiful gown for upcoming Christmas party🌟🌟🌟🎄💃🎊 😍 @sitashree___ @gitashree2019 @_khushbu_prajapati_ #WardrobeRefreshSale @nehaparulkar", "aesha_3507": "I wish to use this voucher for my best friend... Because today 15th December is her birthday.. And nothing better than to use this voucher for her gifts..wush to buy jumpsuit for her.. Would love to win this for her and make her birthday more memorable @mahi_1022 @_emon_us_ @munt_az @nehaparulkar", "r_j_stylish": "I want to buy one beautiful lehnga because my brother getting married super soon on next month.. So I want to buy it for his wedding function..I don't want to lose this golden chance.. This is called \"sone pe suhaga \"... May my dream comes true this time and I win something.. Wish to be lucky one @ashimagoyal12 @deepika.vaswani.10 @royall__kaur", "metal_babani": "my wedding is just in a month I have already planned to utilise the Amazon Wardrobe Refresh Sale by buying some necessities for my wedding & of course buy casual outfits, like beach dresses, sandals, good lingerie and obviously some basic necessities for the honeymoon plus regular life ahead. I am sure the sale will have the best to offer. And of course an Amazon voucher would be quite helpful in that. #AmazonFashion #WardrobeRefreshSale @metal_baba @sumedhaa_ @the.bong_mess", "spark_in_darkness7": "Would love to buy partywear gown for my Christmas celebration and new year party @naina.chirag @vishakha_4444 @piceditor_a7777", "nehaparulkar": "Hey guys!! Thank you sooooooo much for participating in the #WardrobeRefreshSale contest. The responses were amazing and I had a tough time picking a winner. But had to chose one, and the lucky winner of @amazonfashionin contest is @dipali_1017 ♥️", "devi_p.r.i.y.a": "Omg!!this is an amazing giveaway 😍😍Thankyou @nehaparulkar for hosting this giveaway ❤️❤️ I'm looking forward to buy a piece of good looking dress for me as Christmas is in the corner 🎄🎄tagging @_laxmi_priya @pritam.nanda16 @__mr_awesome01 Do comment n participate guys", "saihbanali": "Amazon sale is soo wonderful, I love shopping online with amazon. This festive season I have soo much stuff in my wishlist to buy. Infact I have ordered my \"Jacket\" and still I am looking into 'Shoes' as well to buy because online shopping with amazon is so convenient and I get soo many variety. Tagging @kausar_rehan @rehanali1957 @midhatfatma I will also buy my shirt as well tomorrow. Soon I am checking out my cart and would enjoy my goodies 🌸 also by winning this contest I can gift these goodies to my wife and she would be happy with these lovely stuff on special occasion of Christmas 😍", "the.curly.siblings": "This is really an amazing contest 😍 I would love to win this contest for sure 😍 I just love makeup and skincare and these brands are my go to brands. Also some of my favorites of these are getting finished this is such a wonderful opportunity to grab them💕😍 On 17 Jan I am getting engaged and I feel like this is such nice gift for me this Christmas. I have been participating from a long time and I love seeing you 🌸 I hope to win and enjoy these goodies 😍 tagging @reemareviews @1_anam_1 @saihbanali", "meher_ahuja08": "@art_adda7 @dhristimakhija @_rrajwani88_", "jain_dharini": "I am so excited for the #WardrobeRefreshSale on @amazonfashion 😍 I am preparing a list of all those things I wanna purchase, searching them on Amazon and then adding my fav brands in my cart 🛍️ The offers are irresistible !! Tagging @sonalisaxena77 @veena.makhija @hjain04", "_kahira": "Hello @nehaparulkar ❤❤🎇🎇 firstt of all mannn you got Aamaazinggg feeddd goalss!. Like literally i am amazed 😍♥️ ie wish even my feed was super lit like yours!. Alsoo the styling ; i am so inspired by it♥️😍 gonaa tryy your looks for suree!😍♥️. Andd its so so kind and gratef. ul of you to keep this giveaway ♥️😍by this you arr returning all the love to us❤♥️! I really wana win thiss voucherr!⬛🔴 I HAVE PREPARED MY WISH LIST ALREADY FOR THE AMAZON WARDROBE SALE!♥️ I HOPE I WIN THIS SO I COULD BUY THOSE! So nice of you! So lastly i wouldd realllyy wana win this giveaway.! Tagging my friends @_megha_narang @niku436 @MS.VINNIE ! Girlss follow her amazingg page!♥️", "shital_shiroya": "Hey . gorgeous 😍 thank you for Lovely giveway ❤️❤️ follow the all the rules ❤️..lots of blessings this page and most love and support this page ❤️❤️❤️❤️ I would be really happy if I receive this giveways for you ❤️ @nehaparulkar I would to buy plus sized collection for my bhabhi ❤️ tagging @kajal_shiroya @dayashiroya @sweet_cd", "sk.hossain1000": "👌", "praveenkumarakunmar": "love", "12345.shailesh": "Nice", "sanaya68054": "Following 4 account only for my friend @naeela__siddiqui all the best dear ♥️❤️❤️❤️❤️❤️❤️❤️", "divyachauhan7252": "People! Participate! @swarnava_95 @vj_bobz @_saurabh_awasthi #WardrobeRefreshSale 🤞🤞", "arushii1995": "I'm damn excited for the #WardrobeRefreshSale and from that I'm going to buy some makeup & skincare products like Eyeliner, Kajal, Body Lotion and Lipsticks. Some clothing like Jeans, Jackets, palazzo & much more. 💯🤩 Tagging @insane_yashika @cpdhiman78 @manjotmalhi18 Join in guys!! Enjoy the Sale! 🔥 @nehaparulkar @amazonfashionin 🎉", "yavnika_13": "Join in @reemareviews @msmysticsoul @krishnakhajanchi ❤️", "atul_dixit05": "@nehaparulkar @amazonfashionin ❤️🙌 🤞 Already a list is prepared since this seems to be one of the biggest fashion sale till now, and I'm all geared up to grab some super sexy casual blazers and shoes. These are the definite one's, but got some other in my list too, as soon there's going to be most awaited family gathering at my hometown. So looking forward for this sale, kinda superb timing for me. #wardroberefreshsale #contestalert. 🙌❤️ Tagging my friends @yavnika_13 @nainika134 @neetusingh199524 ❤️🙌🤞 do follow and participate guys 🤞", "syedd_zadii1": "Inviting by @naeela__siddiqui wish you win ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "r_official_23": "As I'm a college student so I want to buy one beautiful partywear dress for our next Fairwell party.. Because this is my last year of college.. After that graduation complete.. So I want to win this and buy one partywear gown.. Want to wear it and shine like a star on our college campus Tagging @vishakhagharshat @miss.dreamer2323 @piceditor_a7777 🌟", "girly_lifestory": "Inviting by #naeela__siddiqui wish you win ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "smily__46324__": "I want to buy one headphone for my bestie.. Because on last month during Diwali she face an accident and she has a fecture on her legs.. Whenever I meet her I feel that pain which she face from last 2 months.. I daily visit her home and talk with her around 2-3 hours.. Try to reduce her stress.. But I know in my absence she always think about her legs nd fecture.. Nd crying so many times.. So I want to win this for her and gift her headphones.. Which is useful for her in my absence to reduce her stress and fast recovery.. Hope for the best @naina.chirag @sparklingbliss_778 @stellar_flower91 🤞", "sonianarang_27": "Thanks for this amazing contest @nehaparulkar & @amazonfashionin ❤️ I'm getting ready for the #WardrobeRefreshSale by choosing some Ballerinas & Sneakers for my daughter and a watch for my son. They both will be so happy getting these New Year gifts from me as a surprise. 💥 Tagging @rashmi82_ @nidhi.budhiraja.79 @jayaarora1996 💐 Join here friends..", "munt_az": "Inviting by @naeela__siddiqui wish you win ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "madhurimoon76": "Inviting by @naeela__siddiqui wish you win ❤️", "butter_cup2701": "I am putting all my favourite items in the cart. Once the sale starts,I will start ordering those. #WardrobeRefreshSale @amazonfashionin @nehaparulkar Do comment and participate @varad_89 @queen.26shama @poo.bhansali24", "varad_89": "Favourite items already in cart just waiting for sale n placing an order 😍@apurvabalai_ @butter_cup2701 @santosh_patil__", "rohanbhardwaj1710": "At this Wardrobe Refresh Sale, I want to buy a pair of Sports Shoes for the gym purpose!! 👟 @amazonfashionin @nehaparulkar ❤️ Tagging my friends @nanhenbhardwaj @_vaibhu_pvt_ @_ms._simran @ramitaseth Hope to win..🤞🏻", "mom_of_guddu": "Inviting by @naeela__siddiqui all the best dear ♥️", "harshika_rewani": "Inviting by @naeela__siddiqui wish you win ❤️", "napeetdeepa": "Inviting by @naeela__siddiqui wish you win ❤️", "chandnisaboo": "I am getting ready for the sale by removing all the old clothes and shoes out of my wadrobe and make space for a new and refreshed wadrobe. I have added a lot to my wishlist and I can't wait to get shopping on 15th December, 2019. @nehaparulkar @amazonfashionin #WadrobeRefreshSale @mamtasaboo @poojasb8 @lipikasaboo", "poojasb8": "I am getting ready for the sale by organizing my closet effectively and making space for all the shopping I am about to do during the #WadrobeRefreshSale from @amazonfashionin . I am also donating all my old clothes that I don't use so much anymore and are in good condition so that I can get more space in my wadrobe and the old clothes are of use to someone who needs them. @nehaparulkar @lipikasaboo @mamtasaboo @chandnisaboo", "dipali_1017": "Hey @nehaparulkar ♥️ Thanks for this super exciting giveaway. 🌸 So, From this Wardrobe Refresh Sale, I want to buy a Jacket or Sweater for my DAD as his Birthday is on the wayyyy..💃🏻🌟✨🎉 & Nothing is better than making him Happy with the surprises..! 😍😊 @nehaparulkar @amazonfashionin Tagging @rohanbhardwaj1710 @mitali2056 @sonianarang_27 Hey guys!! Do follow them & take part here!! 💃🏻💜", "neha.tsf": "Following for amazing account for @naeela__siddiqui", "rushikatalreja": "I can't wait for the sale to begin and buy my favourite makeup products like LA girl HD pro concealer @pooja__mange @shobha.talreja @fabgirl_99 💙💙", "sitashree___": "Inviting by @naeela__siddiqui wish you win ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sparklingbliss_778": "Wow... Such an amazing giveaway... I'm searching for this type of giveaway... I really want to win this... I want to buy one beautiful silk saree for my mom on this new year.. As we all know for every mom her first priority are their children... She always save and spend money for our needs... But never purchase anything for herself.. We like any item the most so she quickly buy it for us ..without thinking the price of that items and how much money she has on her purse.. But when she like any saree or product.. Never purchase it or even purchase it with low price... I know how much sacrifices my mom did for me.. She always try to make smile on my face so this this time my turn.. This is golden opportunity for me to make her happy.. Biggest wish to win this for my mom and want to buy one beautiful silk saree for her 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛🤞 guys please follow this beauty queen fast fast for me.. Would really want to win this @r_official_23 @smily__46324__ @aesha_3507 #wishtowinthis @nehaparulkar 😍🤞", "mom_of_my_littleworld": "Inviting by @naeela__siddiqui wish you win ❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "welcome_to.my_profile": "❤❤", "hiral_hsd4ever": "So agree with u.. they have all sizes and varieties", "lifeisafairytale1": "Sweater weather has already started.So would love to buy a \"Lilac Sweater\" because I just love Lilac colour and it's already so cold here but wanna flaunt my style even in winters.Who doesn't wanna look hot? 🤗🤗🤗 Tagging-@poojaaaahh @shefaaaa4 @simuuuuu678 do participate gurls.... You carry fashion so well @nehaparulkar 🔥#WardRobeRefreshSale", "ankitamadhwani": "@nehaparulkar @amazonfashionin : I'm getting ready for the sale by choosing some Kurtas for my mom. I have picked up 2 W Kurtas for her and I'm gonna give her a new year surprise. The Amazon Wardrobe Refresh Sale is just at the right time. 😍 Guys @ruchikatariamadhwani @ananya__76 @bhaskarmadhwani join in 💃💃", "sashaahahahaha": "@sashas_savoury_stories @sejalgundecha_ @shubham_luniya Damn excited for the sale 😍! Getting ready by saving money and waiting for 15th", "naeela__siddiqui": "Super excited for the sale @amazonfashionin i would like to buying a beautiful plazo , long kurta perfect for Indian festive season tagging @neha.tsf @bushra_sayyed @sitashree___ Done❇️❇️❇️", "diaryofsushmita": "Shortlisted all my favorite products 💗💗 the most favorite is the @veromodaindia black jacket, and other things which i love to buy @levis_in jeans, @metroshoesindia black boot, pink glitter top, @hidesignhq handbag♥️♥️♥️ Waiting for the #wardroberefreshsale from 15th to 19th December💕 at @amazonfashionin the vero Moda black jacket is my absolute favorite💜 tagging @itsannabiswas @sanjibtravelworld @drdipakbiswas @prismuntouched 💜💜", "chikaaa09": "@sneha_mishra_91 Remember Vera Moda reminds me in 2009 ya hahahhaha Neha always shopping from there hahaha", "subhashinibose": "OMG 😱 this contest is best for me #wardroberefreshsale My FAVOURITE pick From Wardrobe Refresh sale Are ➡ 👕Tops:@veromodaindia 👖Jeans:@onlyindia 👟Shoes- @bata.india 👜Bags-@lavieworld And i am ready to rock🎃🙈 Hope to Win From My Favorite💜 Exclusive collection from @amazonfashionin Hope to be the luckiest one💛 This is My Dream to win this amazing contest ❤ Lots of love, support, Blessings and more Followers to You Tagging My shopholic friends 👭 @the.ramya.dreams @sweety_katari @dreamyy_land @priyaraj_katari @richadonepudi", "nidhinarang97": "Inviting by @naeela__siddiqui wish you win ❤️", "sweety_katari": "I would like to buy Kurtis from @bibaindia And tops fromm @veromodaindia @maxfashionindia and bags from @lavieworld Really Excited,thrilled and and Nervous For this super and huge Announcement Looking forward to Win This huge Contest #wardroberefreshsale Seen yours Each single post and loved 💖💕you are Content Can't stop myself from telling to my all Friendz, Family And Brides and my Iovely Unique angels @dreamyy_land @foodz_foodz_india @ramya_katari1"}