{"madhuraa1598": "I like this page because it considers being fat as being perfectly normal and regular. And this is such an inspiration to many !! @shraddhajambhekar16 @nikiita_04 .💃", "purnachawla": "U r an inspiration to many including me .. love the way u carry ur body and each look.which brings a different confidence in the person who looks at ur post ...personally I have literally copied ur dress looks . Sorry for that but I love them . Thank u for being such an amazing woman as u r . Would love to meet u in person someday soon .", "shraddhajambhekar16": "Let me tell you first - You rock each and every outfit and love your body positivity 💗 . . The reason I like your page is the same reason you believe in - “The day you stop body shaming yourself ,is the day you stop listening to people body shaming you “ . . . Tagging my friends who would love to participate... @vrunda_pandit @prajaj", "khushii_29": "You are an inspiration to me and i am also plus size and i was not able to loose weight but then i saw your page and thought that being plus size is not a bad thing and we should celebrate that we are plus size @aharsh and @puroovi", "interesting_username_ananya": "What you do is great.. You inspire ppl to accept themselves the way are(including me)... It's awesome that someone is taking the initiative to break the body stereotype #iseenoflaws...i further tag @_kavuuu_ and @arjita06 for this giveaway", "caffiene_n_cyanide": "U 're an such inspiration for me and to.all those plus size girls out there,I love to see ur post everyday u prove it that beauty goes beyond size ND I get motivated ND confident by seeing ur post I lovvvee to c u everytym and really u had always helped me when I need any suggestions u r really d best ..pls be d same ma'am,u r d most beautiful human who helps girls to get comfortable nd live in this society freely without worrying 😍😘😘😘😘😘😘😘😘 ❤ keep inspiring @nehaparulkar 😍😘😘😘😘here tagging@manisharay19 @s.h.r.e.y.a.___ @_.s.h.w.et.a._ @makeupstore_original_ go follow her and stay motivated ND share with friends😍😘😘😘😘", "nehalakhmani_": "I forgot to tag my friends and pressed enter @aayushi.mulasi @niviagram", "sasha_shettty": "You are just amazing❤️", "shekhar_madam": "We had a conversation over dm regarding an issue. I never expected you to reply but surprisingly not only you replied but you tried to help me in every possible way. It’s hard to be so true & pure once you reach heights. I’m so proud & happy for you. I need not say you’re confident because every woman by default awesome. I hope you stay this way and you could send your msg globally. Thanks. @priaa_shukla @rit_j follow this beautiful soul.", "ankeeta_priyadarshani": "@nehaparulkar maam u r an inspiration for all those who feel size determines beauty and popularity. U prove that its the self confidence and the will power that makes a girl feel good look d best and accept herself the way she is. U teach all the plus size girls to lovr ownself and flaunt their curves 🙌🏻 its not easy to carry thr cruves and shine bright @ishaa__a @miss_reight", "nikejoshi": "@nehaparulkar I admire you for your confidence and the way you carry urself. I am sure u must have hear and read this thousands of times but its a fact that u r a true motivator for girls like us i.e curvy, voluptuous and sexy to love ourselves, love our bodies and to stand up and face the society around us eye to eye. It really means a lot to see ur posts everyday and begin the day with a completely different and positive attitude. Thanks a ton for this. 😘😘😍😍😊😊 @elasingh888 @chuimuijui ❤️❤️❤️", "ihdin._": "I like ur page because u r totally an inspiration for people like us and its really a great feeling to be the follower for and u make us aware of the plus size clothings 😊😊😊 😘😘😘😘😘😘😘😘💋💋💋 thank u for it and for the contest for #curvygirls 😉😉😉💋💐💐💐💐💐💐💐 tagging @grgneha_21 @grgkryshaa do follow her and chckout her pgeee😘😘😘😘😘 she is totally an inspirstion for us😉😉", "pranali_donekar01": "@splash__28 @yukta.upadhyaya now you gotta know that from where do I get so much of confidence... Cuz @nehaparulkar gives more power to us", "__regina_draguta": "Hello ma'am! Congratulations on your 15.5k fam. I'm obliged to be a part of your fam and hope it grows exponentially. :) ❤️ Why I love your page? Well, I have plenty of reasons, first of all, I find you UNSTOPPABLE! You are so confident, so beautiful and so unique. I can relate to each and every post of yours as my body is also very extreme (I'm very thin) and at times I feel low because of that. But your posts make me feel so confident about being in my skin that I eventually forget about the world and be beautiful. ❤️ Pls be the same ma'am. You're the most beautiful human who's helping us girls to get comfortable and sassy in whatever way we look like. You're a motivation to thousands of girls like me ❤️ Tagging friends in the next comment 😘", "disha_mukerji": "You are an inspiration to me and many More Plus Size Girl. Love Ur Confidence .. U actually made be feel FAT IS FABULOUS😍 Now I m vry much confident what I wear And What I look Feels Beautiful 😇 Thank u.. I LOVE U @nehaparulkar 💁 She is the one U must Follow nd like her Post @sheenu_arora96 @annu469 @the_fainted_moon Plz Follow her!! 😍😍", "gangwani_chetna": "You inspire to take the word 'fat' as a positive word instead of one flung around as an insult. You always shows that \"Size doesn’t matter , its all about Heart.\" And thatswhy you got such loving friends, family and boyfriend❤😘 @kanu106 @simransimmuagarwal", "bongbombshell": "#inspiring", "miss_vaidik": "You are truly a person who's comfortable in her skin.changing the stereotype and mindset of people who thinks curvy girl cant carry fashion.i love wat you doing.keep inspiring.we need more ppl lyk uh.@poojabalmiki5 @sreerupa_bose", "krishna_covers": "For me you are the one who taught me not to care about others, u made me realize I am also beautiful and can love my body no matter what others think about it... You are my role model, love to share my achievements with you. Love copying your style and your quotes too 😜 Mam you are an inspiration for me and many other girls. You make every outfit look perfect no matter what 😊😊 thank you @nehaparulkar mam for helping and supporting me 😊😊😘😘😘 @priyankaasood @curves_uninterrupted", "kewlkritz": "U r truly an inspiration girl!! Luv ur dressing sense n confidence u carry !! Al your outfits suits u well !!", "bhumishah92": "Love your page Neha! You are so inspiring. You come up with different outfits and ideas ❤️ @shahpooja273 @nid_2411 please like this page and comment once done 😘", "miss_apt": "I'm not a plus plus size.. True. But the harsh truth is that I still crave the Vogue/billboard figure. I still feel ashamed of sometimes never finding the right size at forever or hnm. I'm just 17 and My parents and friends ( yes u guys 😬) constantly tell me I'm fine. But it was today I realised....how perfect we all are.. Sach mein @shreya.raheja @ananyat.99 @shreyarahejaa @natansha_17 abb se patle na hone Ke liye roungi nhi 😂😂😇 thanks @nehaparulkar", "_priyanka5225": "@nehaparulkar coming up and standing against the stereotype needs a lot of courage and motivation itself...you are truly has become an inspiration.. Not only for plus size but to everyone who does not feel confident about their own body. Thanks for being confidently bold and encouraging others to break the rules which were set up by the society and other commercials to fitin in what they think is beautiful and perfect body. We don't need to be according to others opinion rather be what you actually are and be confident in what you have. Our skin and our body is ours.. Just cherish that beauty. We all are beautiful and perfect in our own way. @sni09 @girija30 follow her, inspire others...spread the word... #iseenoflaws", "ananya.yeet": "India needs woman like her!!!!! 🔥🔥🔥🔥🔥💣💣💣💣💣 @itsrohitbitch @gaga_bollywood @me_likey_not", "shriya_sohani": "I just saw you on the buzzfeed video and i had to follow you. You are the reason that inspired me to wear that bodycon dress or that pencil skirt. Ik how difficult it is, to be pluss size in india. As most of the clothes are xxl or if they have big sizes they charge double the money. You are doing a great job.#love #love ❤", "susan_liza": "Hi Neha... You are a true inspiration for millions of plus size ladies. I love watching your insta stories and Feed and Also I love your confidence and the way you carry yourself with anything you wear. You have proved to the world that size is just a number and this has nothing to do with acceptance in the society. Keep up the good deed. Keep inspiring... Keep smiling 😊 @minguuuuuuuuu @stelancia1986", "deepikalalsinghani": "You are a girl boss @nehaparulkar the name on the Instagram shows itself proud... Your are motivation for the girls who fitts in plus size.", "graceful__pandemonium": "If there’s anyone I’ve seen who’s confident about the way they look, it’s you! You rock any outfit you wear and are a true epitome of beauty. You prove that beauty goes beyond size and have always been an inspiration. This is the exact reason why I love seeing your posts. It gives me the motivation and confidence to love myself the way I am! There are just a handful of people who actually help me feel comfortable with who I am and you are definitely one of them. You go girl! Keep flaunting them curves and keep inspiring! @mast_magan_ @litanairsingh here’s someone you must follow! Cheers, love and light ✌🏻♥️", "theplussizewomaniya": "You are an Inspiration to many. So full of love and positivity. I adore you ♥️ #fangirl 😍 @parnika_vicky_bathija @pretty_ingenious @bharti_melwani8618", "thecurlyheadgirl_": "You are the inspriation for me following you makes me more confidence to carry myself n the oufits what ever you wear is just awesome blossom thank you for being my fire birdage after seeing flaunting on your dresses i try to do the same thing 💖💖💖💖💖 #nehaparulkar @nehaparulkar#plus&proud 💖🤘i tag @amyroxx93 @niharika1503 @prachiti.jadhav @niharikashenai @brown_chubby_girl Girls participate 💖", "_lil_miss_panda___": "Omg shein has amazing clothes but i never tried them yet .will try my luck excited 😲😲😲😲", "dishajain222": "@icodeforfood94 @yashashvi_jain_", "adv.kanikasood": "@sood_kanishka @_mahima_kataria", "simarleenmanch": "Why I like your page : 1) You are your biggest fan , one must always love self first , the way you treat yourself sets the standard for others. 2) You enjoy your body , use it every way you can , you ain't afraid of it or what people say about it. 3) You are truly an inspiration for pluss girls ❤️", "sparshibanerjee": "I love u and ur page Neha, coz I love the way u flaunt ur confidence. U r an inspiration for so many girls out there. I can totally relate myself with u being a plus size individual. Thanks alot dear. I am tagging my friends @puri_sudheer and @dr_kirtika_panda for this giveaway. 😘😘", "thatduskywomen": "I like your style as you give motivation to plus size girls.", "weight.and.watch": "You are beautiful inside out and that reflects on your feed. It's filled with positivity, good vibes and inspiration. You not only look stunning but also help plus size people look great with your online/offline store recommendations. So thank you. :) I further nominate my friends @booksand.wandering and @rajarshidasgupta97 for this giveaway. 💗", "pumpkin__panda__": "i love you ma'am Ur my inspiration, after seeing ur pic my confidence level has raised Thank u soooo much 😘 I am tagging my friends @ur_princessssss and @t.khannnnn for this giveaway", "sunilsaranofficial": "Superb👌👌👌", "the__philosophical__guy": "This is soooooooooooo cool baby 😍😍❤️❤️❤️❤️❤️ , you are one epic human soul baby 😘😘 always by your side jaan", "___aline.____": "You're an inspiration to all those plus size girls out there, infact to all the females who feel that they need to change themselves just so that the society stops tlking abt them, you inspire us woman!!.@_trupthi_gowda_ ,@sharon_teresa13"}