{"riddhimutters": "Killing it!", "anakims_art": "Real question. I have big thighs too.. It causes the shorts/playsuits to ride up between the legs. How do you work with that?", "anjalilje": "Shoes!", "mujahid_rehmani_444": "Very nice pic", "wajid_bagwan999": "That’s right💪", "inforstyle": "I’m so glad you broke that barrier. Cuz you’re a goddamn stunner! ❤️", "__aviral_sharma__": "Beautiful", "soumi_chatterjee01": "Love how you combined the gladiators with the dress", "shahvinal14in": "Absolutely 🔥🔥🔥", "prayagpinto": "Ur simply the best", "golu_neta_ji_bjp": "Good looking ever ❤️❤️", "coolestbadgul_official": "Self-love is the best love", "geeta_023": "So true", "punima_cute": "So beautiful man.. 🌹", "lwier_n_a_p_i_l": "عسل", "vene33": "This is so cute❤️ I don’t see it in the app though🥺", "monalisa2319": "U just look damn sexy 😍", "rajeshputtaiah": "Can pls bring those ppl to me who ridiculed and insulted you for wearing shorts.... I just want to shoot their brains outta their skull.. you go gal", "i.am_a_m_a_l": "Nice shot ❤️❤️", "amarvsarda": "You R Looking So Beautiful 👌🏻👌🏻👌🏻", "savagesephra": "Love this..😍", "pandabear_vibes": "Outfit👏👏 Caption 👏👏👏", "gaya_wanderlust": "😍 This is one of the best shot ! Super inspired 💕", "rohankjr12345": "Pretty", "pavi.poojari.526": "👌👌👌👌👌👌👌❤️", "tickwickz": "You look so beautiful 💖 I wish I could make up my mind to have the same attitude. Sending love", "richbubbles": "👌 awesome...picture perfect😍", "edwardduke.ellington": "I'm glad you're feeling more confident and free. Personally I think your legs are gorgeous. You are truly beautiful head to toe and so much more! 🌹", "sanjeevganguly3": "Lovely Gladiators . Brave Woman", "nikkiarora093": "Plzzz send me the link of this dress dear...", "iamparul7": "Love the outfit", "narinkbhatt": "Love your outfit!! 😍", "princy.bhatia": "What if ur bf ask you to wear something different , what I meant is body covering because I have heard this a lot although I don't listen to anyone about this either it's my family or bf but then I end up upsetting them which is the only thing I don't like , what do you think ?", "heysay2020": "Awesome... please check your inbox please.", "glitterxgrace": "U go gal!!! U olwz motivate me...love olwz 😍😍", "ne.el418": "You have the loveliest legs I've seen in a while 😊", "misprimnproper_thestylediva": "Where did u get these gladiators from... Ur rocking d outfit. 💖", "vm_narwade": "Looking fabulous 😍", "sizedupstyle": "Dudeeee staaaappp...Killing it with all that hawt lewks...See I forgot how to \"English\"😁", "salonikwatra": "My first thought seeing this picture was, it she can i can give it a try too. Thankyouuuuuuu! Sometimes all you need is a lil motivation from someone who's been at your side of story too :) thanks", "ahlawatvishal0001": "Beautiful❤️", "honest_to.goodness": "I can totally relate to this...I had suffered and tolerated so much of body shaming..till my hubby gave me the strength to overcome my insecurities..and now I wear whatever I feel comfortable in ,instead of people telling me. So kuddos to you @nehaparulkar", "harshbhardwaj6909": "Nc", "messedup_mom": "I must say you look awesome in this play suit. Keep rocking & breaking the stereotypes. Cheers to the #freedom 🥂", "parul12july": "Love ur spirit and attitude 💕 💗", "vijay_kumar66678": "After seeing this picture my reaction was gorgeous and beautiful @nehaparulkar", "euphorian_gal": "Loved the outfit u r looking gorgeous ❤️❤️❤️", "nonstopniki": "So so pretty", "gadhvi1092": "beautiful", "sham_xoxoxox": "Hi you look great! I can relate 💯! Get weird 'up and down' looks at the school gates from other mothers all the time even when I'm not exposing any flesh! Please can you post the name of this playsuit as I can't seem to find it on the website so many yo choose from!💖", "one.life.one.journey": "Beautiful ❤"}