{"confessions_of_a_gcup": "You are gorgeous. I have thrift shopped before but can’t get into it", "jess_smith_86": "Op shopping is hard when you’re plus size, but there are some bargains to be had! I picked up a brand new pair of city Chic jeans for $9 last week 😱", "prudencejh": "In Melbourne I find Savers is the best as its sized and its categorised into items too. Usally come out with an item or 2.", "thepiquantfox": "Looks great, love it :) and excited to see what @shade_swim bring in for size 18 and 20, ita been ages since I've bought a swimsuit!!", "hom_.i": "Kind angel 😊🙂😙", "self_love.incolour": "I love op shopping. It's one of my favourite ever things to do 👘", "holly_.cee": "Freakin love this dress on you! What a find x", "grazeatsamford": "Nope - not patient enough", "elliethompo": "You look beautiful I love that dress! As a size 20 I haven’t been thrift shopping for ages as I didn’t think there would be anything good in my size any more! Maybe I’ll have another look 😊", "designeremporiumbrisbane": "Looking gorgeous as always! Love 😍 a great vintage find. That’s what we’re all about @designeremporiumbrisbane 💃🏻💃🏻💃🏻", "fra_wheels": "Love it! Maleny has some great oppies 👌🏼", "sistaandco": "This dress was just perfect on you! 👌", "theworldneedsmoresparkle": "I love it!! Agree that there are not normally a lot of larger sizes otherwise I would op shop more often!!", "curvysam": "@buynothingnew2019 I finally found something in my size 😍😍😍", "julietmon2": "I don’t, for that reason, but I loved that dress on you!", "icurvy": "Love that dress 💕", "jennifer__kate__": "Love this dress!! You look lovely.", "brioney365": "I’m probably the same size as you and I find heaps of stuff. 75% of my dresses are all Op Shop. Ya just gotta ignore the size on the label and look at everything. 🙌🏻", "big_bold_bohemian": "Beautiful x 💕", "chloeamandab": "Gorgeous woman! 💕", "taysia_louise": "You look gorgeous 😍 I’ve really been wanting to try thrifting but between worrying about sizing and not wanting to support homophobia organisations like the Salvation Army, it’s felt like too much of a chore. I think I’ll give it a crack this week!", "simoneellen85": "Love having a browse! I do find op shops in some areas in Melbourne quite pricey! I don’t mind because it’s cheaper than what I would pay in store, but feel awful for those in need 😢", "theswiseone": "I love op shopping! Every now and then I find a plus size gem. But I mostly thrift for accessories, shoes, homewares and books.", "_hairbyrach_": "For Melbourne ladies @aplusmarket is on tomorrow. Plus size second hand heaven!!! I leave with my arms full while only spending a little. Highly recommend if you’re in Melbourne when it’s on", "willowcurves": "I love op shopping but it can be really hit and miss", "snepal123": "That is a lovely dress!!", "meg_s_moore": "Dress turned out well. Looks good", "taniaack": "I used to live for op shopping back in high school when I was a size 14/16! I even worked at a vinnies for a while haha I haven’t bothered in a long time due to my current size but I feel inspired after this post to give it a chance 😊", "canyouseem3now": "Omg that dress is stunning on you!!!", "susannedawsonotto": "Pleats are very trendy. It looks beautiful.❤️❤️❤️", "lizaj71": "Not really my thing either but every time i buy something new I take something else out of my wardrobe and it goes to vinnies or salvos so I'm more a donater than op shopper however Sam this dress looks stunning on you 😊", "alexhoneybear": "I’m the same, I would love to go op shopping more but I rarely find anything past a size 16", "whatbeckwears": "I love this outfit!", "bestronglovemuch": "I love this outfit!", "what_bec_does": "I love op shopping and that dress looks stunning on you!!"}