{"fatmumslim": "That is huge! I think that was meant to happen to let you soar.", "louisetaylor48": "Oh wow. I’m really sorry that she did that to you, but I’m thrilled you’re in the other side now - living your best life! 💗", "meganfuryart": "This is such a beautiful post Sammy! Letting go can be so hard but is also so worth it! ❤️", "jenniespitaleri": "Gross", "fmh__x": "Wow!!! I have goose bumps. You see, I heal by forgiving, not so much forgetting but moving on... My parents on the other hand, absolutely can’t stand me for it. They are “hold a grudge forever” type of people, they are also very negative and I feel this is a huge contributing factor. It helps me so much to move on and grow from my past experiences, I’m not so stupid to let someone from my past burn me twice however it is important for that healing talk, whether it be in person or over the phone. 💜🌈", "stephlorenzo87": "Thank you for sharing that. I really needed to hear it. ❤️", "curvydesignmarket": "Amazing. Wow serendipity!", "ssked": "❤️", "realmumstyle": "I love that feeling of “no emotion.” Just knowing that you are at peace with it all. Well done for getting through a weird situation so gracefully.", "__growingpains__l": "This place is incredibly special to the local indigenous people also. It is a place for womens business. Such a interesting place for this to happen, It is one of my favourite places on Earth. I'm glad you are at peace 💜", "snaphappystace": "I got goosebumps reading that!", "inner.monroe": "Wow this post could not be better timed... just little over 2 hrs ago, someone from my past walked back into my life - and while they didn’t drain me financially, they drained me in so many other ways with their toxic behaviour. And now for reasons outside of my control, they are back - so your advice is extremely well timed!!", "m.meraki.18": "Wow @curvysam crazy how the universe works ! What a story ! Meant to be ......", "celtickezz": "This post means so much to me. Thank you so much for sharing", "jacinta_vb": "Wow. What a moment.", "jessie.m249": "😍", "kirstyleanneuk": "You look stunning 💕", "lajoieskin": "You are absolutely spot on @curvysam there is definitely a message there. You are super brave in asking her if she felt any guilt. She cried, but did she accept that she wronged you? In any case, moving on and forgiving those that do not have the same values as you, is the only way to live a life filled with joy. Proud of you hun.", "pro2rpm": "This is one powerful real life story you shared. The power of letting go and moving on. Especially with forgiveness in the mix. Very life affirming. That you for sharing this. I hope it touched someone who is going through hurt. You’ve grown so much. Your shared wisdom is received. Have a great rest of day", "lizzionicole": "Not far from where I live! It's beautiful and what an unreal story!", "alikymross": "Wow! Wow! Wow! I don’t usually comment but your incredibly story of self-love & forgiveness has prompted me to say thank you so much for sharing this heartfelt story! It has made my day!! 💕💕", "loelizabeth": "Okay I LOOOOOVE THIS and miss you!", "curvysam": "@prettyparcel we were in the same spot. Apparently it is a sacred indigenous spot for women", "joril_92": "I really love this ❤️", "hidebo1": "Wow! Good on you for asking her if she’s felt guilt. Good for you and her ...", "accessible_rach": "You have really made me think pleased to hear you have found peace 💕", "gretelthepetal": "Fuck Sam this is amazing. The universe has your back.", "_tuiolosaywhaaa": "That’s amazing 💗 thanks for sharing 😭💕", "jemgemcoon": "I really needed to hear this, right now. THANKYOU! 💓💓💓💓💓", "angie_dp83": "Well done! You can be soooo proud of you!! Go ahead!!!", "elwio76": "Wow!.. xxxx", "moonlight_maker_melbourne": "Thank you Sam for sharing your story. I was also farked over by a so called friend and I can't wait for the karma train 🚉 🤣", "what_bec_does": "This!!! 🙏🙏", "sisinamasinello": "🙏🏻", "leahjo85": "You have amazing strength to be so forgiving. Wish I had the same strength", "carlamartini8": "Shut the front door Cardwell! My partners family are banana farmers in Tully. I love it up there 💗 What an incredible turn of events, it must have been nice for you both to have closure.", "drselinalim": "Let the Universe take its course 💕 proud of you @curvysam", "marymsmith85": "@hey.caitlin 🙌🏼", "froggy.36": "Perfect! Karma does happen and this is how you let go and never have to think about it again.", "leannezimmermann": "What a crazy universe it is 🙀 letting go the negative is the best medicine 🖤", "jem.mccann": "💜💖love!", "mellyp5": "I thought there was just 2 great photos but no an amazing story too. 😘", "beautifulimages.photography": "Love this so much, thank you for your candor and vulnerability to out it out there 🙌🏼 Absolutely universal ergonomics at play, and go you for the peaceful ability to walk away 👏🏻❤️🌟", "natvellozzi": "💖💖💖", "missa_g": "That’s crazy! The universe works in mysterious ways. Did you save your shoe though?", "ohilovethoseearrings": "It really is a small world! I love those bathers btw!", "about_a_french_curvy_journey": "Beautiful place, beautiful post, beautiful life experience, beautiful lessons 😉💜👏👏", "iamvikkikate": "Firstly, I love that place. I’ve never been able to get there and swim yet because we always manage to get there after the rains. Secondly, I remember reading snippets of this story over the time I have been following you and I’m very glad you got your closure. 💛💛💛", "super_mum_of_4": "This shows how much growth you have gone through. 💕💕💕", "jessiebell_k": "Wow", "unicorn_lingerie_lover": "@curvysam thank you for sharing this 💜 The Universe has its way of closing doors and opening new ones with such Affirmation 🎯", "maggiekaycairncross": "So powerful. Thanks for sharing lovely lady. X", "nataliebradley4632": "Love the colour", "theswiseone": "Love this. And I love this swimming hole! You’ve been living my dream life these past few days! I miss Australia and it’s warmth 😭", "bridie.mcintosh": "P.s. this swim suit is amazing @curvysam . What size are you in their swimmers?", "lizaj71": "The universe always has a plan and works in mysterious ways 😊💖", "kristiedaniels_": "Admire your courage 💕", "lattelover__": "That is actually nuts! Like what are the odds?! Wow I’m shook", "willowcurves": "What are the odds!? But it sounds like it’s exactly where you were meant to be", "sharnevickers": "Yes! 🙌🏻 Where is that cozi from? X", "mrscherrieann": "PS - Did you get your show back?", "_jasminscott": "Wow! I firmly believe everything happens for a reason x", "mere_1975": "💕💕", "heatomojito": "Wow. This story gave me goosebumps. Time really does heal old wounds 😘#💕", "alanamaree_": "❤️❤️", "straightupgcup": "All seriousness, this is amazing. The grass is always greener where you water it X ❤️", "champagne.mel": "So well written Sam"}