{"tiff_dobson75": "I don’t even bother with @targetaus anymore. Too frumpy, not inline with current trends and the cut don’t get me started on the cut🤦‍♀️🤷‍♀️", "whenellefreezesover": "The only things I consistently buy from the Belle Curve range are plain singlets and items that are a larger version of pieces in the straight size range but they are few and far between. If they extended the size range of Preview properly I would be a far more frequent shopper.", "amber_seraphina": "I find that none of their pants ever fit me properly - they are either too small in the calves, thighs or both! Their tops are too blousy and I echo the comments about not being on trend either. Patterns, material and cut are all wrong. In summer just because I’m hot doesn’t mean I need my flabby arms out. I suspect some think target clothes look “mumsy” but perhaps it’s that they can’t be bothered traipsing the shops trying to find better given everything else a mum needs to do. If Target can get Danni Minogue to do petites well given their different form why can’t they do that for curve? There’s a huge market available for Target if they get it right.", "whatmellydoes": "I've bought basics from Target (leggings and ponte pants, some knit jumpers). A lot of their Belle Curves items are a bit dowdy...and I feel like a fat, old lady when I try them on. Some of the material is a bit cheap feeling (polyester in the knit jumpers = static).", "alisonclare24": "Also I find the name bella curve to be demeaning. I don't see my body as a bell curve shape", "eva_tee": "I agree with the comments on this post. Would love to be able to buy funky active wear for the gym in plus sizes as well as sports bras which are very difficult to find. I also feel sizes should be inclusive and go up to size 30. I do buy from the Belle curve range and they do make some funky tops in black or black and white which is what I wear mostly to work. I don't even look at the smaller sizes range because it makes me too sad.", "miss_cate1987": "Targets generally always had small sizes. Their tops are to short, their pants are to narrow, their bathers are too short in the torso. The plus size range has always been quite limited and very \"old fashioned\" I would love to see a more modern and young style and prints in some inclusive sizes. For the price, I'd want more.", "angharad.11": "It's rare for me to find many pieces I like in targets plus size range. It's very boxy with very little shape. And the size discrepancy between a 20 in ordinary sizing and a 20+ is enormous.", "tennilleamy": "I dont shop at target because their plus sized clothing is DAGGY! As a 35yo woman i dont want to be wearing a boxy-ass button up shirt in either white, navy or black or a floral top that my grandma would wear. Target plus sized range is not fashion. Why cant they just make their smaller sized clothes in extended sizes? The only thing i buy from target are work pants.", "plummti": "Their plus size section is a joke. Also straight sizes usually run small so the 20 in their standard range is very hit and miss (usually miss). I only ever buy their clothes during winter (slouchy jumpers etc), but they're pretty expensive for what you get.", "emsjay89": "I do not shop at @targetaus - there’s simply nothing there that I’m interested in wearing! The size 20 is a joke- much closer to a 16. Currently really pleased with @kmartaus clothing as quite a lot of “straight” sizes go up to a proper 20, and then there’s a lot of pieces that just extend into the plus sizes so I’m able to buy the cute jumper in their advertisements just like everyone else 🤷🏻‍♀️", "bellacurvee": "Inconsistent, daggy & not fashion forward. Their size 20 in normal range is not the same size 20 in curve range. Curve range runs small & has no shape or real style. Stopped shopping at @targetaus a long time ago. Shame...because they could be a market leader for us curvier ladies who love fashion & style.", "bellagirlsjoy": "Agree with all of the above - I would shop at big w or crossroads before I thought to bother with Target. They’ve lost the plot - I don’t think they realise that just because you’re fat it doesn’t mean you don’t have style. It’s why we shop online and overseas. Cause we like to look pretty and fashionable and sexy just like our thinner sisters. I really don’t think it’s too much to ask tbh.", "g_wizz": "As others have said- plus size range is woeful. Don’t mind the pants for work but the jeans are boring. I can fit into the 18/20 but it can vary greatly- some size 20 pants won’t do up while a 16 will fit in another cut 🤷🏽‍♀️ consistency of sizing & extension of the same range but cut for a curvy body would be great (eg tokito curve at MYER has been great for work jackets/pants & are the same range as “regular” sizes).", "erinlouisefashion": "I’m a 14 and I hate that their clothing is small. I buy their tees in the biggest size they sell and they’re still tight.", "mrsdella": "Target have the worst change rooms / mirrors/ lights. I always walk out feeling awful. It turns me off shopping there. 🙅🏼‍♀️", "50_in_the_city": "From a business point of view it makes absolutely no sense to me why retailers cater to small sizes when the average Australian woman weighs 71.1kg and wears a size 14-16. Retailers have to innovate or we will shop online. It’s that simple!", "melstar001": "I rarely look for clothing in Target as I’ve never had much luck. They have a really small range with basic pieces that aren’t fashionable. I’ve just had a look on their site now as I love this skirt you’re wearing, under plus size dresses & skirts they only have two items. TWO!! The non-plus section has 70 skirts or dresses to choose from", "taniahouwing": "I agree with what everyone else has said about target. They really miss the mark", "dannielle_johnston": "@targetaus don’t be afraid to seek inspiration from other brands hitting up the plus game well with their offerings currently. I.e. ASOS, City Chic, Elloqui, Anthropologie, Ally, Cotton On, Forever New, 17 Sunday’s, Little Party Dress (they don’t go high enough with sizing though) heck even check out Boohoo and Fashion Nova Curve or Pretty Little Thing. If you go do a cross section of those brands curvy styles, cuts, patterns, fabrics and contrast it to yours I think you’ll see pretty quickly and easily where you’re going wrong and where you can improve.", "curlygirlbeauty.com.au": "I don't fit into anything at target. If it's wide enough it's either too short or makes me look like a nanna", "thedivinemissks": "It would be nice for the plus-sized section not to be shoved in the back behind maternity.", "m_kaleta": "I live in Canada and every time I go to the US for shopping I pop into Target. I used to find cute things in the plus section but rarely bother to go into the clothes section anymore. There is no selection and when there is, the clothes are frumpy and not flattering. The sizes are all off as well. Super disappointing. I'd like to know if @target has Plus Size women in their buying department. If they wouldn't wear the clothes, why would we?", "openingthemoon": "I live in a pretty small town (Broome) and we don’t have many options for shopping. We do have a Target though. I probably go to Target 1-2 a week just for a look. I don’t remember the last time I bought clothes there. I’m a plus size 18. The Bella curve stuff is pretty frumpy, they have some occasional cute T-shirt’s or I think my denim jacket from a couple of years ago is that brand. The standard size 18-20s in the non Bella stuff runs pretty small. I do like some of it and the lily loves is cute, but mostly too small.", "whatthecatsaid": "Target has an horrendous range for plus size. Sizing is all over the place. The ‘normal’ stuff is cute but the majority of the time it doesn’t fit and the plus size all looks sack like that even my grandmother wouldn’t wear. Really disappointing.", "danni_and_archie": "I can never find much in target in my size that I actually like! I do usually buy work pants from there and find them to last long! The only other thing I have brought in clothing there is a denim jacket!", "mizzchickenmama": "Almost my entire wardrobe is from Target! But I’m in the US, so maybe they need to extend the sizing in the AU stores! They go up to a 4x, or size 26/28 at the stores I go to. 😕", "whatbeckwears": "Love their preview range! 👏 Great workwear. I own several pieces. Love that it’s all on the one rack from a 8-20z They just need to extend that range to a 26.", "darkknitestudios": "Omg! Soo beautiful and gorg dress", "anabeth.jpg": "Omg if you aren’t the most fab thing!!! 😍😍😍 Love this skirt on you and how you styled it!", "lizajeanw": "The Belle Curve range is frumpy and mostly black", "karalwrnc": "I buy leggings and socks at @targetaus but that is it. Everything else I try either doesn’t fit or has super awkward cuts that don’t work at all, not to mention most of their styles are outdated or frumpy. I find it much easier to purchase from my growing collection of brands (Australian and international) online then make the effort to visit in store and be sorely disappointed.", "flingogal": "I sometimes shop @targetaus for their shell tops, but often the designs are so old fashioned that I leave without anything. Their curvy jeans are made for the wrong body shape, all belly and no thighs, they never fit right, I either can't get myself into them, or I'm high pants Harry. I'm constantly disappointed by Style and offerings, their work wear range is non existent. They no longer have nice bras either. It's a sad decline. I used to love @targetaus", "pollyg74": "Target plus size = old lady clothes most of the time", "jordi5511": "The sizing is so random! Dresses too big in my normal size, jeans that don’t go past my knees. I don’t shop at Target for Jeans anymore as I can never find anything that fits properly!", "hellosally": "Target is so disappointing. There is such great potential, which is probably why it stings even more! The crossover sizes are all over the shop. The extended sizes in the standard sizes feel like an after thought. The curve range is sad and the rare time there is something decent, the size 16 is probably the equivalent of a size 22! No chance of shopping online because there is no consistency.", "casa1333": "I have picked up the odd plus size in a nice fabric and style but the majority are in terrible patterns and actually make you look even dowdier.", "ladybug1181s": "Target USAs clothing isn't without its faults. As a plus size woman, I want to wear what everyone else is wearing, but with the patterns and cuts altered to fit and flatter a curvy body. While target has affordable clothing, I would like to see them using heavier weighted fabrics for the plus lines, more style options (not all of us want to wear big patterns) and better basics and coats to choose from.", "my_shopping_dreams": "I do shop at Target for clothes but not a lot. Like Kmart the inclusion of the a size 20 in some pieces is great EXCEPT when it doesn’t it a size 20 woman. Then the plus size section is all oversized and not flattering. I did buy the linen jumpsuit in a 20 and while it is snug and difficult to get over my butt - it is gorgeous.", "kmorrissey81": "I’m super sad they got rid of the different length pants, used to be my go to for Long length pants (wide or skinny length). Now I can’t remember the last time I bought pants there. Also real women have arms with bat wings, don’t make the arms so tight.", "amyjh98": "Dear Target. I’m a size 20. This does not mean that I want to dress differently from my size 8 friends. This does not mean I need a minimizer bra, or full briefs. I do not want to wear shapeless tents, and I want my normal size 20 body to fit into everyone of your size 20 items, not@mix and match between a million different sizes. Don’t try to reinvent the wheel. Size 20+ girls just want to wear what size 8-16 girls wear, pretty flattering to shapely clothes in on trend colours and materials. Pretty, modern underwear in a range of colours not just beige and black. Currently there are 156 similar comments above me from one bloggers post (and I’m sure many more to come after me) Word is that retail is struggling, but perhaps you are just trying to sell to the wrong market? But credit to you for the Sophie jeans, they are awesome.", "ashbetteridge": "Not fashion forward, dowdy. If they sold more good office essentials in plus they would totally have my money. They do these black ponte work pants but that is the only thing I buy there. They have gotten daggier and daggier as time has gone by. I used to get good flat shoes for work there, but even their footwear offerings have gotten worse over the years. I don’t understand why stores like this don’t understand that fat women have professional jobs as well, we all need basic, professional, on trend workwear.", "newstylechapters": "Having read a lot of the comments here it shows that there are so many differing opinions as to what is fashionable to them. So let’s just think about the poor retailer @targetau here. It’s very difficult to please everyone. To cater for different shapes for example, pears and apple and hourglass, curvy girls with very large busts and girl with small busts. Girls who are taller with long torsos, girls who are shorter. Curvy girls with skinnier legs and those with large thighs and knees and calves. Not to mention then the target (no pun intended) ages. Everyone needs clothes. Young, middle and older. So think about this retailer having to consider all of these and design a range that’s their customers like. In the one store. It would be a very difficult task. I think Target are trying to please us and using influencers is an excellent way to get feedback and to get their product seen. That is a step in the right direction and a positive. My thoughts are they need to think of their market and cater for them with different stories. Be consistent with their sizing blocks would be a good start. Use fabrics with a bit of stretch. And be fashion forward by being inclusive for both plus size and normal size. Design a good basic range but also include an exclusive fashion drop every couple of weeks that is limited, thereby enticing customers to come in store to check out what’s new in. Any way that’s my two cents worth 🤭", "bee.bee.beee": "More everyday clothes, not just work type clothes. Consistancy with sizing. More PLUS SIZE PYJAMAS!! Removing the belle curve pjs was dumb dumb dumb!!!", "nursenerine": "Target 16+ is very hit & miss. I realise they need to cater for a range of ages but most of their clothes are too frumpy. Haven’t bought anything for a few years now. They need to make more of the clothes “size inclusive”, surely it would be cheaper to manufacture and then they could use better quality fabrics.", "therealjessicaloveridge": "I live in Alice Springs NT & our target never has any plus stock or if it does it’s a few sizes in only a few items. I try to wait to I go away but lately the range has been getting more and more disappointing in for and style. On a side not it’s the same for Mr Big nothing new in years! We need fun prints and colours, we love to express ourselves too!", "freerange_mum": "I never shop there cos their slim size style isn't catered for in the plus size.. we want to look pretty too. So much styling for plus size varies from t-shirt with slogans, 3/4 length skirts dresses and pants. The styles are outdated and the fabric is always hit n miss. I also hated that the swimrange was a set. No mix n match as im a different size up top. Well i haven't been to target in about 2 yrs due to the weird plus size range.. that i didn't even fit(i was a size 16 wearing their 18.. not happy jan) the only thing i like from target which i went and bought yesterday, whilst avoiding the clothes i got bras, they've always had a great range for bras, theyre pretty no matter how big they go", "jobeaz": "I stopped shopping for clothes at target years ago.", "days.of.our.lisas": "I would love Lily Loves style clothes in plus size. I can buy plus size basics anywhere, which is mostly what they seem to be selling now.", "teganed": "Their cuts are awful in larger sizes! And their plus range is AWFUL, I feel like it’s designed to cover and shame rather than accentuate and stylish. I bought a pair of navy pants for work which I was really surprised with in the change room but as soon as I wore them and the fabric warmed up (or something) they really just lost their shape and were hanging off me. Disappointing.", "rosemerg": "I’ve purchased this skirt in both colors and absolutely love it and it’s so flattering. I also bought a few jumpers from Kmart this year which im surprised I liked / fit into. I haven’t shopped in Target for about 8+ years prior to buying the first pleated skirt that was released. My biggest piece of feedback is that the sizing between their normal range and their belle curve range is crazy. I am a normal 20-22. Whatever normal is. I don’t normally fit into a “normal” range 20 in Target the sizing always runs small. However then The belle curve I’m a 16 ish because the sizing runs larger, however everything in Belle curve is predominantly I find really frumpy clothes, I just want the same cute clothes they sell in their normal range, in broader sizes - I don’t want to have to go to a range that is essentially oversized blouses and leggings - which is why I can’t often shop Target and I mostly just don’t bother trying.", "cuteclipzetc": "I only buy basics which I wear around home. The selection of plus sized clothing in my opinion does not really speak to me or the younger generation of plus sized peeps. Even my kids say it looks like grandma clothes in this section whenever we visit it!! The fabrics are awful as are the styles of clothing. Far too limited in options! Time to start listening @targetaus if you do, I'm sure it will be better for ALL of us!!!", "chonniesnow": "I have had some really good experiences in Target lately. They have won me back. The change rooms were big and roomy with good lighting and I didn’t feel pressured by sales people. I have bought some gorgeous pieces that I love. BUT I’m an inbetweenie 16-18 so I am still catered for in the standard ranges (not Lily Loves or Dannii Minogue though 🙁). They’re doing fabulous things with their standard ranges. Gorgeous styles, fabrics, cuts and quality. They just need to do this in bigger sizes. NOT just larger cuts 🙏 These need to be tailored to fat bodies. We’re not expanded skinny people, we have different lumps and bumps and curves that need to be considered in plus cuts. I often find the crotch doesn’t sit right or it’s too small across the back or in the arms. I often feel this is because it’s designed for a size 8 then expanded. The current curve range is frumpy and 90% of it is horrid. The standard range sizing is very inconsistent. I take 2-3 sizes of every item to the change room.", "misskristylouise": "Love this outfit! I love target jeans, but the sizing isn’t consistent. I think they’re heading in the right direction by making their “corporate” wear go up to a size 20, and I think some of casual stuff does too but again the sizing isn’t consistent.", "ninjawinja": "It’s so limited and completely aimed at older and can I add taller women. Very dated. And regular ‘extended’ sizing is rubbish can never find anything to fit", "stillbigred0604": "I have such mixed thoughts about Target. I buy soooooo many of my kids clothes there, plus basics and some undies if on special, and their sales are fab. The jeans range is decent, especially the Sophie range. However, the Belle Curve range is for Granny's - in fact my Mum is 70 and even she scoffs at it!! weird floral tents and baggy leggings. Being a 16 bottom and 18 top, I find the regular size range fits but they're labeled weirdly and never sit properly around the bust", "theemmafiles": "I find the plus size range at Target very old looking. I want the same clothes as the geberal range- just in a size 20!! I don't even bother trying on pants or jeans there anymore, they're not made for plus size bellies and thighs. I have had occasional luck with a top or dress but it's so sporadic. They do good plus size underwear and swimwear but can't seem to get the clothes right.", "rabbitabacus": "The actual curve range at Target is definitely for older women. I'm 29 years old and work in a corporate environment and wouldn't wear anything in the current curve range to work. To be honest, Target doesn't even come to mind as an option I would have as a plus size women in Australia.", "rachel_lasala": "Size 18 in the ‘general’ section is never true to size- quite small in comparison to other brands, especially the pants I don’t even both trying anymore. The plus size range is not fashion forward or even fashion current. Everything in the tiny range is baggy, daggy and tries to just cover instead of show off our curves. Bigger busts aren’t catered for in buttoned shirts (can’t escape the dreaded POP around the boobs). They just don’t really ‘get it’ for the young, plus size girl. If they changed their range I’d spend a heap more money there.", "beck_birdy": "You look amazing in this outfit, as you always do 💖 It’s so funny that your posting about Target as I went into a Target store today on my lunch break to check out the new Fila range advertised. I hav’t bought clothing from Target in like, forever. Disappointingly, none of the clothes I liked wet in my size. And those that may have fit me, well let’s just say, I think I’m not that old to be wearing yet. Looks like stuff not even my Granny would wear. Very disappointing, but not surprising. ❤️", "jonniebee1": "💯 agree with vast majority of these post! The plus size style is for ladies who are 65+ with tragic prints & tragic styles - who wants to wear a floral Mumu when you’re in your 20-30s? Completely disappointing and cutting out a huge market particularly when the retail sector is struggling, adequately consulting actual plus size stylists and catering for plus size needs without a doubt drive a strong revenue! Close to 150 posts here from one plus size influencer .. imagine when other influencers jump on board and tell others? It will snowball", "atthatagenow": "Target clothes are uninspired and expensive", "laura.hopper.partystarter": "There plus size range is good for staples but nothing fabulous! Always get my work skirts and bike shorts that I wear under dresses from there but that’s about it .", "kewlchicky": "Yep Target Aus should just follow/stock the same plus stuff as Target USA. Problem solved! 🙌", "rogerliciouss": "Couldn’t agree more with all the above comments. Pull your finger out Target it’s shameful.", "zoe_cresswell": "I hear ya!!!! I’m usually a 16-18 in tops and a definite 16 in pants!! I wear size 20 tops - but only just!! I fit well into their Size 16 denim range, but forget their Preview range or other dress pants!!! I don’t have a chance in hell!! 🙄", "bodymindspiritfukit": "Their sizing is way to inconsistent and I’m not a fan at all if the clothes in the plus range. Plus size doesn’t mean office only or daggy T-shirt’s and blouses. I want denim shorts and funky tops not clothes my nana wears", "nicksta_moves": "Target sizes are so hit and miss. I’m a solid size 12 in every other shop yet can be up to an 18 in target pants. I get anxiety at the thought of trying on their clothes. I know we shouldn’t base our happiness on the number inside our pants but boy is it soul crushing sometimes!", "nadeen1980": "I haven’t shopped there in years because I feel that their curve range is overpriced for what it is. Hideous trousers and floral shirts in incredibly gross fabric. Clingy, sweaty, bally fabric.", "nicolesullivanmua": "I just left Target, I was so disappointed that a gorgeous white blouse I tried on from the preview range was so generous in the body and then so extremely tight in the arms and the sleeves were soooo short. This has happened to me on multiple occasions with their tops. I have previously just rolled the sleeves up on casual styles. However on a dressier style blouse this just isn’t appropriate nor flattering. If they stock bigger sizes I think they need to be catering for how the body shape generally changes the larger the body. I don’t shop at Target often anymore for this reason and can find more appropriately fitting items elsewhere. But I do love some basics in my wardrobe and Target do great basics. So would be great if they were a little better thought out in how they actually fit different bodies 😊", "lattelover__": "I really hope @targetaus takes all these comments onboard, free market research! Seriously just have one group of clothing for woman and have it sizes 6-28", "amandafromyack": "Used to like their non plus ranges (when I could fit into some of them). Agree that the plus size range is ill fitting and daggy. I do like their plus swimwear though and have got some good pieces before.", "piprea": "I find their sizing is notoriously odd. In workwear, I wear a size 14 skirt, but can’t fit into the size 20 pants or dresses?? Doesn’t make sense. Their sizing generally is very small. Most clothes are lovely but not made for anyone past a size 10. And the curve range is frumpy and dorky - patterns are “old”, clothes are tent-like, very limited range and very pricey. Target needs to make their sizing more reliable and realistic and and take their everyday range to bigger sizes.", "bonnieharley13": "Target thinks all plus size women are 50+ years old", "rochellemara": "Target need to extend their straight sized range into more sizes- rather than having completely separate plus sized ranges that are usually horrific! The plus sized ranges are usually awful materials, patterns, and cuts and poorly designed and not at all fashionable.", "skyza90": "I buy most of my work clothes from target (their preview range in 'straight sizes). I only buy tops and skirts because their pants are made so small! I have to size up 2 sizes to get them around my hips but they're too big at the waist! Their curve range is literally one tiny wall in my local target and I never bother going near it because the clothes are ugly and shoved up the back near the clearance section. I will say that Target's Ponte skirts are great for work and true to size.", "elliethompo": "I’m from UK so don’t have a Target, but I shop in supermarkets because their clothing tends to go up to a size 24 at least (still not great but at least I can find something). But something I find particularly when clothing is made as an extension of straight sizes, is that they forget that arms and legs get bigger too, as well as boobs and belly! I regularly try on shirts for instance where the fit in the mid section is good at a size 20, but I can barely fit in the upper and lower arms, and even when sizing up to a size 24 (the largest I can find), it’s clear they’ve just made more space for boobs and belly without accounting for the fact that entire bodies get bigger - not just the middle bit!!! This is also the same with calves in pretty much all trousers. It’s just painfully clear that these clothes haven’t been tried and tested on plus size people, it shows a lack of thought and an assumption on how bodies get bigger. Basically they’ve been made by straight size people! Probably not the right place to rant but if Target gets the memo too that plus bodies aren’t just big bellies and boobs on the same size legs and arms then that’s good!", "ashlynneh": "I hardly ever shop at target now a days! The plus size range they have is frumpy, daggy and just down right horrible. I don't even bother looking anymore. It's like they think curvy women don't want to dress in any colour other than black or dress nicely. I like a lot of their straight size clothing but the sizes are totally confusing and seem to be down a size or 2, I'm a 20 and I can't find anything to fit.", "ellaash93": "I always look there for work clothes. I am a size 20 and there is very small amount of fashionable professional work pieces.", "apringlebell": "I don't shop at Target for the same reason many women have also commented on- frumpy plus size clothing that truly looks awful on me. And sizing- I think sizes are just randomly stitched onto garments. I had to stop going because it was disheartening. As result I don't buy any clothes for any of my family at Target.", "ccatherine_collins": "It’s been years since I found anything I liked in their plus range. I wish they would just extend their preview range further and then also extend their other ranges like Danni Minogue Petites and Lily Loves. And then TELL us about it - I own the skirt (in a 16) and the skirt v2 (in a 20) and the orange ombré number (also a 20) AND the sequin skirt (in an 18) but other things in the same range do not fit me. Some tops I can get on, most are too tight across the bust but if they extended further sizes it would be perfect. I spend most my money on small Aussie businesses that cater up to my size or overseas retail but it can be pricey, or take time to get an order which is fine but sometimes I would love it try things on before purchase! Or just make an impulse purchase that’s not a huge splurge! (To be honest if many things fit the impulse purchase would be larger as there as so few places I can walk in and shop off the rack) I’ve spent money on Target when their things have fit me and I like them because I hope voting with my dollars and my Instatags helps make a point. I do give them two thumbs up for their shoes though - so many winners in the last 12 months BUT I’m an average size (8) and not super broad so I’m sure, once again, there would be a lot of people missing out. Target is at my local shops - if they catered to me in their straight ranges I would 100% spend more there, no question.", "missy_moo285": "@curvysam @targetaus Living rural I don’t have much of a choice where I can shop ‘In store’ and we have a target country. The plus size section in there is about 3 double sided racks. Of the most unflattering, ill fitting, bland clothes. It’s a ‘treat’ to travel a few hours to the closest city to shop at a normal target. It’s very disappointing to see the range they have to offer in both stores. As a plus size person I’m not afraid to wear prints, colours and statement pieces. Big bodies don’t need black tents to wear. More shapely clothes, some flattering cuts and some colour!", "mrshotker": "Plus size does not mean no shape. No tents.", "lovembymichelle": "Sam, this outfit is cute! Re target, I used to shop there a lot, but I am sure their clothes are smaller sized than they used to be. And the 16 plus range is limited and not particularly on trend. Yes, black is great, but there are only so many black items a girl needs in her wardrobe!", "itskyliestime": "I never shop there anymore, the plus size range is so limited and always seems frumpy to me.", "missjulieanne": "I used to love the skinny high waist jeans that were a bargain at $30! I bought 3 pairs in different colours. Then @targetaus changed the style and the straight 20 didn’t fit me anymore (after I’d previously worn a straight size 18). So I tried the plus size alternative and the fitting was all wrong, not to mention everything in the plus range seems to be $5-$20 more expensive than their straight size cousins. So I don’t bother with Target anymore. Sorry Target, but Kmart have outdone you recently.", "e_leesy": "In my opinion, the Dannii Minogue Petites range features the best designs in the store. The Belle Curve range is poorly fitted, frumpy and uninspiring. The standard range may be available up to a size 20, but it isn’t a curvy 20, rather graded from the small sample size. Best of luck @curvysam I hope they listen 😘", "mscarffff": "I do not shop at target because simply put the plus size range is ugly, unflattering and the sizing is not consistent. In the past I've seen pieces that have a mirrored 'straight size' option that's $10-20 cheaper than the plus option. Since I haven't step foot in their clothing section recently I can't verify that this is still the case. Target need to do a hell of a lot more work on their plus range if they want my $$$", "_the_buzz_amy": "As a child, we grew up going to Target, it was the go-to for every shopping need! As a plus-size lady (20-22) I have stopped shopping in Target. A few times my Mum has said ‘come on, im sure we will find something!’ but alas, I never do... which is a real shame!! Cause if you get plus size mums in there shopping, they’ll buy for their kids, they will be gifts for people, they’ll grab things on the way out... 🦶 🦶 = 💵", "simone.young": "No I don’t - I checked out the latest preview range, I am normally a size 16 and struggled to fit into a 20 on some pieces. The curve range is so bad, I didn’t go near it. I was thinking of buying the skirt you have on, it was the only thing I liked that fitted well. Target needs to lift their game if they want to play in this market.", "misskittystyle": "I really like that skirt! I went to Target today and they didn’t have it above a size 14 so either they cannot Keep them in stock (which means they are big sellers) or they cannot be bothered to stock them in larger sizes (which means they don’t care about their customers). Curvy girls are desperate for gorgeous clothes. We like looking pretty. We deserve to look pretty. Target invests heavily in their petites range, making stunning clothes for shorter and smaller women - it stuns me (maybe it shouldn’t) that they don’t seem to give a shit about curvy women. I went and looked at their Belle Curve range and there wasn’t a thing I would buy. They are missing a huge opportunity, especially with big players like Ally, Cotton on and Forever New coming into the market with their plus ranges. I will continue to support players like Harlow, Hear Us Roar and Eloquii who value their plus sized customers and retail beautiful clothes for us to wear.", "belzi11": "I rarely shop at target for the same reasons as everyone else has stated. I’ve bought a pair of pants from the piping hot range in a size 14 and they are loose fitting (prob could have got a size 12) but tried on some jeans recently and I could even get the size 18 done up 🤷🏼‍♀️ I always size way up with T-shirt’s so bought a size 20 which shrunk after the first wash but yet a size 20 camisole was huge! Such inconsistent sizing that it’s not worth my time. In saying that I find their swimwear range fairly true to size", "gailcal31": "@curvysam I wear black all the time, but I love black. I’m an earthy tones girl. I’m a 14/16 - 16 in pants. I just bought black preview pants & I love them.", "tinalouise2428": "Agree with all the comments above re: size, style, price point etc. I used to shop there (linen range was good and nice range of cardi’s for work)but the local Country Target closed (very few curvy items) and now have to travel 100km round trip, so I have to try it on (dirty, pokey change rooms 😝 and little to no service staff) or walk away empty handed - your loss Target 😐", "hayley_miller13": "I bought 2 pairs of jeans from their belle curve range yesterday. One size 18 and one size 24 🤷🏼‍♀️🤷🏼‍♀️", "2012katg": "I stopped shopping at Target ages ago. I find all their clothes are 2 sizes smaller than what’s on the label. For example I’m a 16 in Just Jeans, Jeans West, Tokito, Basque and numerous other brands. I can’t get a 16 done up at Target and struggle to get Target’s size 20 on half the time. They really need to look at their sizing and length of items. I understand that some plus size ladies like to wear shorter skirts/ dresses etc. But I find them all too short and am not comfortable wearing items that stop half way up my thigh.", "kelly_azalea": "I’m a 14-16 and rarely find clothes at target that are a good fit for me. Loved the Sophie jeans though. That stretch 👌🏽 Please, Target, start considering curvy bodies in your standard range.", "prudencejh": "Cute shot @curvysam been loving watching your adventures and watching the NY company's get it right... realise we exit haha", "splint3031": "I’m a size 20 and never shop at Target. Their sizing runs very small and their Belle Curve range is frumpy, dark, and poorly made. Shopping at Target would be very convenient for me, I would love it if their plus size range improved, but it would have to improve a lot", "msmjprendergast": "I love the preview range but I find the sizing so inconsistent! I don’t think the bigger sizes are designed with curvy figures in mind. Some of it is just way too tight across my arms, shoulders and chest -in my usual size (at other stores). I feel like a lot of their clothing is what I want to wear, but the sizing and knowing that if I try it on I might get stuck puts me off.", "copperwings": "I used to shop @targetaus but this past year I was shocked at how the sizes have changed especially the jeans! So I had no choice but to shop else where! I love @katiesfashion and @sussanfashion and @witcheryfashion but only when they are on sale lol as the clothes are priced higher.", "anaidslife": "@targetaus I second all of the above! This post made me realise how long it has been since I shopped there. Great for kid's clothes but with the inconsistency in the fit of 18/20 regular clothes and the hideousness of Belle Curve, now I don't have a small child to shop for there is no reason for me to go in and look around. Though I did appreciate their long opening hours.", "the_nourishing_foodie": "They have some great items if you are in the regular size. Their plus size is only good for tee shirts. It is a bit daggy and too heavily patterned with unflattering prints that look dated and not on trend. I very rarely look at anything in target because it never fits! Their size 20 ( conventional range) runs small, in other stores/brands I can wear a size 16 or 18 top no worries.", "itsjustmemissem": "I gotta say for a cheaper brand aiming at the masses, I find target a pretty enjoyable place to shop. I appreciate their shoes and accessories for cheap bits. I’d like to use it as my go to for work wear, but agree that their plus size line is so much worse than the standard sizes. Now, I’m never going to be a structured suit type work wear girl, but I think there’s a massive market for plus size work wear that I think target is closest too. I’m sorry, I also wear lots of black! But whatever the colours, it doesn’t also have to be baggy and shapeless.", "57snowmonica": "No I don't shop at target. I would love it if Aussie target had clothes like the American target has. I dislike polyester material as it makes me hot & sweaty. I don't understand why brands have to come up with a completely new line for \"plus size\" women. Just make the trendy clothes in fun patterns bigger. Yes the cut is slightly different but surely its do-able.", "krissykiki84": "I'm size 16-18, but larger in target range. I try their pants in normal and curve and they never fit my body. But i really want to love them. I've got blazers from their normal range which are fine. But workwear is just such a miss. Sizing instore is often lacking, but love the click and collect target do so i dont have to search.", "alisa_ocon": "I find their curve range to generally be made of oversized tops, maxi dresses, and unflattering pants. I don't wear maxis because I'm not tall and the fabric is generally synthetic, so my legs are so hot and can't breathe. The basic black curve leggings are really great though! I also notice that the same style in the normal range is often $10 cheaper.", "daniarmstrong": "I am a size 16 to 18 so I can fit the Preview range. I can just fit into some of the regular range. I detest the Bell Curve range even though it fits. Sizing is inconsistent across all ranges.", "flowrluvr": "I’m sick of ugly sacks for plus sized women. Where’s the style!!", "becnherboys": "Target makes me sad. They have so many gorgeous options in their Preview range then hidden around the back is the plus section. A selection of frumpy tops and stretch pants. The size 20 in the Preview range is about five sizes smaller than the 20 in the plus range. I buy most of my kids clothes in Target but they have no interest in selling to me for myself. More than once over the years, they’ve made a fuss of wanting to expand the plus range and make it more appealing. They’re all talk.", "eileenalanah": "I don’t buy any clothes at Target any more as all the larger sizes look so drab and they don’t do exercise wear that is suitable for larger people that don’t want their rolls or midriff showing. When I visited Chadstone Target yesterday they had the larger sizes range right next to the petites range and the contrast was amazing...drab display of drab larger sizes next to a jazzier and vibrant display of the petite range. I left straight away rather than face the humiliation of rifling through the drabber display.", "dressmycurves": "I do like their jeans, I wish they were a bit longer and had a skinnier ankle but that’s the same for me with most brands. Everything else I find hit and miss. Sometimes I can do a 20 in the straight sizes which is great because the options are modern, bright and affordable but the plus range is an absolute snooze fest, especially recently. I don’t even bother going in anymore.", "dennigillies": "I don’t bother to go to the plus size section. It is all oversized t shirts. The preview range is gorgeous. Love so much of it! But the sizing it small and lets me honest that 20 is not really a 20... why not just make that stuff in larger sizes....not rocket science", "a_knights_creations": "I rarely shop at target. Their plus size range is super limited which, in this day and age, I find pretty shitty. I also find while the quality of the clothing is better than some of the other chains (like Kmart or big w) it seems to smaller. I am often left wondering what plus size women who are bigger than me do....", "mellyp5": "😍", "angelinaey": "In a word, no. I buy kids clothes there, but not for me. For the last few years I’ve been between 16-20 and I don’t go back to places where I experience ‘distressing change room moments’ & target is one of those places, sadly. I stick with birdsnest online - great sizing, terrific quality & easy return if it’s not right. I’m not plugging @birdsnestonline for any reason other than they that they have changed my experience of shopping for clothes. They have high quality clothes, at good prices and most importantly they fit & are generally true to size.", "publicemno1": "I used to but I’ve found lately that there is a ridiculously big gap between an 18/20 in the normal ranges (don’t come near to fitting) and the 18/20 in the plus size range. It’s incredibly frustrating.", "kritkira": "No I don't as the plus size in rockhampton qld", "sarahtraugott": "No. Target has been awful for plus clothes lately. Relegated to a tiny section near maternity wear and frumpy AF. Sizes skew small. Prints and patterns are wrong for big bodies. Hate it.", "tayysmitthh": "This was me today! Totally picked up the skirt 💕 but I struggled to find any blouses that worked. I’m a true pear, and none of them seemed to flare out enough over my hips. The fact that nothing had stretch was killer. I was so disappointed! The inconsistent sizing was ridiculous too. I was a 16 in this skirt, but in another I legitimately thought I’d need to ask someone to help peel me out of it 🤣🤦🏻‍♀️", "dididavis": "I find their standard clothing, which sometime goes to size 20, to be on the small side. Their Belle Curve range is dowdy and not stylish so I tend to buy basic tees only. I feel that they could do better, there’s a market for stylish curvy gals and they’re missing the mark.", "l_ren987": "I haven’t shopped there for clothing for a long time. Their regular range stops at a 20 (even then their sizing is all over the place) and their plus size selections leave a lot to be desired. Shapeless tips and floral patterns that aren’t very on trend. Very much targeted at an older demographic.", "donnachev": "I’m a size 20 top 16-18 bottom and I just don’t bother with target- I’m a young 52 and not worried about price but object to paying for clothes my mother who’s in her 80’s wouldn’t wear! No style and definitely not classy for a professional curvy lady..... is it so hard really? If they bothered with a GOOD range they would sell more than normal sizes!", "sydneyyogacoach": "I’ve always found the cut of target clothes problematic. As a size 18-20 and even now as an Aussie size 14. Pants - waists are small and hips cut ridiculously wide. Shirts - loose around shoulders, and even if enough fabric for the bust the buttons are always in a spot where it gaps open - even if you go up in size. Ironically, their petite size 16 by @danni.minogue1 range is cut really well", "leanne_erbs": "Target need to modernise and broaden their range of Plus Size clothing. Their sizing is weird and they have to cater for ALL age groups not just the Grannies.", "jeanettebradfield73": "I shop at Target occasionally but I do find their plus size range to be frumpy. I occasionally find things in the regular sizing that fits, but it is very rare. Target you need to lift your game when it comes to plus size fashion.", "mikiwills": "I don't shop at target anymore. Nothing I want to buy fits and the curve range makes me feel sad. 😭", "finnandfox": "I buy socks and tights from target. I often can't even get undergoes in my size!!!! Their plus size range is insulting. I fit into some of the preview range but the quality is rubbish. It isn't that hard to find some decent basics. Is it?", "princesseatspeasoup": "I'm looking at their website now and it's all a bit middle aged mum for me. I wear black but I wear colour too. The same could be said for ANY SIZE. I don't see anything pretty and ONE dress. I wear mainly dresses. What I see is not what I would consider following fashion. Some basics.", "charleyloveslola": "Agree with most of the comments here. I was a huge target fan, they were my go to shop, being plus size in a semi rural. But over the last couple of years the quality, range & style has decreased significantly, to the point I rarely shop there. The discrepancy in sizes is terrible & frustrating. I love cotton, but found their summery cotton fabrics would always shrink, even when cold hand washed. They do have a fantastic black T-shirt that doesn’t shrink. Plus I love one of their mesh top sports bras & maternity singlet. Do better Target, aim for quality again, not just fast fashion.", "lozzamck": "I agree with a lot of comments that the sizing is all over the place. I am in the Bella Curve sizing category but the tops are ALWAYS too short. It’s my absolute big bear with all brands. Make your tops longer! Pleeeaasseeeeeee", "melaniesjoyce": "Love Target! 🎯 Agree re sizing being all over the place for the Preview range. I have both this skirt and the navy one - I had to buy the black one 3 sizes bigger than the navy 🤷🏻‍♀️", "autismtravelau": "@curvysam I have found their clothes to be uninspiring. I am late 40's but work in the corporate world so like to dress well and use colours. I found target to be bland and everything either hangs on you and you look like a tent wearing hag or they are too right and do not sut well. I also find in general (not just plus size) they dont display outfuts on mannequins well - you don't see how an outfit looks with accessories etc. And yes more colour and less diagonal stripes lol!!", "leannezimmermann": "Spectacular style 🖤 I saw this skirt, it’s amazing", "carrolynnoack": "There is so much potential for Target AUS and its so sad that year after year its the same stock, or mikd updates of all the stuff that continually sits on the racks. All boxy shaped and lacking in both style and finesse. All cut with the same style. Honestly so frustrating, the amount of times ive written them a letter in my head pleading for them to up their game. Target Plus is targeted for Nannas...😟", "thedailyjenna": "I totally agree with you Sam, I never shop for clothes at target as their range of plus size clothing is very small and not very fashionable. I have been able to purchase a few size 18 things in their mainstream lines however the sizing is hit and miss. I would love for target to widen their range as I believe their quality is fantastic! They really have a strong market opportunity", "nicole_w16": "I’m a size 16/18 I really like target’s jeans as they are well priced for my uni student budget. I have noticed their sizing is all over the place but then I notice that at most Australian stores unfortunately.", "fimailer81": "One of the biggest issues I have with target is they assume that everyone who is plus size is a 6 foot giant!! Being a shorty I can never find pants or maxi dresses that fit, and over all their plus size stuff is just boring!!! I know there was talk of dannii Minogues petite range being extended up to a 22/24 ....... @targetaus if you are actually listening, please make things like this happen!! All we want is the same styles as the straight section and a lot more nice colours", "quirkygreek78": "Umm because bella curve or whatever its called should be sitting on my grandmas couch with plastic over it. Better still some of the styles should not even be in existence!!!! Its like we plus size people cannot be trendy and have to follow what they make . Once upon a time i used to shop at katies and susan and hey city chic is my go but even then i get bored and live in the same bigw pants for seasons. So yeah smarten up Australian fashion we deserve to be funky xxx", "the.gypsy.life.of.jess": "My main concern with Target is the fabrics. I'm an 18 and a lot of the pieces are either too clingy, or polyester blends which are not practical for QLD ☀️", "klroberts86": "Every time I walk into Target, I walk out with nothing, thinking why did I even bother. I’m generally a 18-20 in pants, 14-16-18 😂 in tops. Target tops for me (exception of basics and knits) are a terrible fit. Too small on the bust to even get on, or, not enough room in the hips. Some of their clothes look great, but sadly that’s where it usually ends for me. Recently I bought some maternity clothing there after my son was born. Even those items were terrible! Baggy fit, no style, just plain boring. Cos new mums don’t want to dress nice or anything do they 😒😒", "caitlyn.mccallum": "I rarely shop at target because their plus size items aren’t in fashion like their regular or petite clothing. Also some items are more expensive in the curve section. I.e https://www.target.com.au/p/perry-balloon-sleeve-blouse-soft-snake/62279079 is $39 ($20 on clearance) and the curve version is $49 ($25) on sale. It makes it quite disheartening when it is literally the exact same item", "jocullenlander": "OMG gorgeous 💜", "celineleilaniskin": "The styles I find rarely switch out, very limited and very older woman style still to this day. Yet go on the US Target site and the range is beautiful modern and fully inclusive. I find I still have to buy from the US to get stylish items. It would be so great if it changed and turned positive.", "rubes.j.b": "If they made the lily loves styles in larger sizes that would be amazing!! It would be great if the could focus on a young generation, rather than practical work clothes 😊 target in the US is so inclusive and it would be amazing if I could just in aus the way I did in the u.s", "chonitell": "I am an 18/20 and I don’t shop at target for clothes. I find their plus size clothes are very much for a more mature women, I find the fabrics are generally a polyester that doesn’t breathe at all and they are always so short. It’s so disappointing because I love their standard clothes but can’t fit rhem", "anyexcuseforfashion": "I don't shop at Target. Sadly, I send most of my clothes money overseas where brands will accommodate my style and size. I did go to Target a few weeks ago to pick up some shoes and while I was there I saw the Preview range and got excited by all the sequins and patterns. Had a look and remembered why I don't shop at Target... There is nothing there for me. Target doesn't simply doesn't carry fashionable, quality clothes in plus sizes. The plus size range is ill fitting, non breathable fabrics and ugly patterns or designs. For a start, just extend the size range on fashionable lines like preview, make sure the size is consistent across items, and make bigger sizes. Go up to a 30. Australian consumers are desperate for a department store that genuinely caters to the plus market. Not just to a 20 (that's tagged as a 24). Also, those shoes I went in for broke within 3 weeks so....", "janeemoonlight": "Their sizes run too small for the plus size. Like their 22 is not a true 22 more like a 20, especially shirts and pants", "veronica.and.family": "I do sometimes. But I find the sizing is hardly accurate and most of the time (the skirt excluded) the bigger styles are just so fuddy duddy and not me. Im a simple fashion gal too but don't want to dress like an old lady just because I am a little bigger than the standard. I do find some good finds occasionally but rarely look unless I see someone post an item I want as usually I never find anything for me personally at target", "kitcheningabout": "Their jeans are top notch but I can’t say the same for the other styles. It’s not a brand I’d go to for stylish plus size outfits. It’s a bit outdated and unflattering. Their active wear for the plus range is also disappointing.", "emilyhewitt1": "I keep trying @targetaus but they don’t serve the Curvy community well. Not only is their range not diverse enough, but the pricing is higher I feel. I was searching for some active wear recently and they had hardly any range which was so disappointing. If you are going to do a curve/plus range, do it properly!", "rose_fergo": "I don't shop at target unless I see people provide positive feedback on specific pieces (e.g., \"the skirt\"). The main reasons for this are: (1) I typically find I can't fit into their straight size range, (2) find even the smallest size on the plus size range far too big, (3) find the size inconsistency frustrating (see points 1 and 2), (4) the plus range is awful - frumpy, unflattering and horrible prints, (5) when I do fit into straight sizes they are also not flattering, as they have not been designed with larger figures in mind, and (6) I resent having to search the plus range out, as it's usually pushed to the back as an after thought in most stores (usually near clearance racks). I would also like to say that I used to work in the ladieswear department at Target up until 2015. I remember a time when i worked there and the plus range was much nicer. Not sure why the change happened, but it's definitely resulted in a lot of people not bothering with to shoo there anymore.", "_gcholland": "Occasionally I find something I love, but it’s only occasionally. I went in a few weeks back and got two jumpers in the regular size (20) and a size 20 dress I’ll be wearing to a wedding, which is stunning. But often size 20 is too small and a size 16 in the plus range always ends up being too big. There are things in their regular size that I wished fit. Also disappointed at their lack of plus size activewear, often size 20s in active tops are just too clingy!", "jessiecassandrahall": "I find the curve range to be targeted (excuse the pun) towards older women, and rarely find a piece that I would wear. I find a lot of the items to be basic, and then I’ll look over to the straight sizing section and see colour and designs that instantly grab my attention and wonder why those options aren’t extended to be for everyone. I’ll shop for two hours and then realise the only reason I shop at target is realistically for underwear and spanks 😂", "jessica.baggins": "I tend not to due to all the reasons that you have stated Sam. Fabric is crap, patterns are generally ugly or dated, sizing is inconsistent, and at my local they have 2 or 3 racks! I can also get the same quality items for a 3rd of the price at Best and Less or Kmart.", "juzsavage": "I made a decision last year to stop buying fast fashion and to limit my Clothing purchases in general. I learnt to sew which has given me an incredible sense of freedom when it comes to clothing. I no longer have to settle as the sewing community is incredibly inclusive in creating amazing wearable patterns for plus size. It’s also given me an appreciation for those ‘expensive’ handmade brands which I’ll support and treasure the wares I buy from them. In the past I have purchased from Target and other similar stores out of desperation, and never loved what I have bought after the initial wear.", "tagenrowe": "I don't shop at target because their plus size range isn't my style and their other ranges (specifically their preview range) don't come in my size. I fit a 20-22 elsewhere but their preview 20s are too small for me.", "littlemissnochill": "Im a pretty straight 16, sometimes a 14 but very hippy and busty. I find target woman fine for my body, but occasionally I will get lost and end up in the 'young' women section and I will need an 18 which is the biggest that range carries or it just wont fit at all. I also find the sizing of their workwear all over the place 🤷🏻‍♀️ Their plus range is too big and too long for me🤦🏻‍♀️ So I guess yes, I can find things to fit and I do like what I buy, but I dont like the inconsistency and dicking around with sizes.", "jaybeeworld": "Targets plus size range is so ugly, shapeless and daggy!.. Why do plus size get a ‘range’ anyway?? Why can’t we just have the same regular clothes but in bigger sizes!? Forever New, Ally, cotton on.. Ect", "keenforpastasalad": "I spent over an hour trying clothes on in target for a last minute event. There was no consistency in sizing which meant I had to keep putting my clothes back on and getting another size. All of the “larger” sizes were really tight around my bust and it was a really really shitty experience. I ended up with a really nice skirt and cami, but surprise surprise couldn’t find a jacket that would fit and sit right 🙄", "rebelwoutapause": "I find it hit and miss. Have got some great jeans before and a pair of leather look jeans that I’ve almost worn to death because they are so rad.  I also love the fit and shape of most of their shorts but the cuffs are constantly ‘uncuffing’ (totes a word) and rolling down. Noticed it across a few pairs over a few years. Drives me nutso and it’s a shame because they’re great otherwise. The activewear is also not bad BUT it would great if they stocked more loose tops that weren’t from the ‘old lady’ section for exercising. Not everyone wants a tight tee, and not everyone who doesn’t is 60! Some non-clingy racer-back singlets and/or stylish off-shoulder longer lightweight loose tees would be a great addition to the activewear range.  I probably only wander in a few times a year, and usually find something I like, but there’s definitely times where I walk the aisles and find nothing appealing.  For relevance: I’m a 43yo mum of four (sz16) and I’m usually after every day wear that is practical while still modern and relevant.", "thenew_nita": "Honestly when I was larger I avoided target as nothing fit, even the plus size was uncomfortable & unflattering. Even know as a 12-14 they are last choice for me", "alexhoneybear": "I love their straight sized clothing however find there’s a huge discrepancy between it and the plus size 16,18 and 20. Visibly plus sized women simply don’t fit them. And their plus size range is well.... bluntly so matronly, daggy and I just don’t buy it. If they want me as a customer, they need to make their sizing and styles much more appealing and fashionable", "lisaf2710": "I used to shop at target but find their plus section boring, very limited and quite basic. The “regular” section whilst go sometimes to a 20 are vastly different and inconsistent with sizing, I realise the 18 plus is a different shape but the measurements should be similar. I’d also like to see more plus activewear naming tanks. Their quality overall is good.", "_jacqueline_troup": "I find Target’s plus size line offensively bad. Exceptionally limited range, rubbish fabrics, off trend in every way. They have the capacity to make beautiful clothes, in the last few months we’ve seen that in their straight range. Just. Make. Those. Bigger. Target- when you exclude plus size women in this way you’re showing what your values really are.", "stanzie.star": "Agree with a lot of the comments. The plus size section tends to be old school frumpy and a 20 in the regular section is definitely not a plus 20. Although their jeans in the curve are pretty good.", "meandmine82": "I do shop at target, I wear a size 16-18 I recently even bought a dress from the danni petite range ... which fit and I was absolutely shocked about!! Their active we’re i lass on tho ... the fit is awful and not made well ... recently I bought a pair of lonesdale tights size 18 and at $40 I found them quite pricey. I wouldn’t have minded at the material felt nice and not gone complete see thru ....", "steph.derooy": "I normally avoid target because I never know what size I’ll be. Although being pregnant, I do love their maternity jeans - they seem to be the comfiest so far 👍🏼", "buffy_gail": "Nothing that is suitable in my larger size or that I like.", "chelseeaoh": "The belle curve range is beyond weird. I’m generally a size 22 but their 18+ stuff often swamps me and is ridiculously poorly cut. I’m loving some of their preview range and buy a lot of their basics but would love to see Dani Minogues range extended to larger sizes.", "leahjo85": "I don’t shop at target for clothes - haven’t been for years. I just don’t feel like they get the plus size girl. Most of the clothes could probably be used as work clothes but nothing really for weekend wear. The frustrating thing for me is that brands have these materials for there other size ranges - how hard it is to make some in the plus size range. Just makes me angry and even if I do lose weight and get out of the plus size range I wouldn’t shop at Target due to them not being inclusive to the plus size market", "beautifullyfkedup": "I went shopping at Target about a month ago for activewear, specifically A pair of leggings and a couple of tops - there was one style of leggings plain as and not comfy and one type of top to choose from - ALL were black. I walked two aisles over to the ‘straight sized section’ and was met with multiple legging and top choices in THEIR activewear section 🙄 walked out, no plans to ever go back. Their plus size section is shockingly bad, it’s almost like why did they even bother 🤷🏼‍♀️", "a_phillips_89": "I find that target “curve” fashion is very limited in styles. If you are after more than a basic work pant or mumu style top then it isn’t the right shop for you. In saying that I have picked up a maxi dress or 2 over the years. It would be nice to see them offer some “on trend” fashion in larger sizes. Though I feel that is something that is limited in most chain department stores.", "lizphoto": "Ahhh love this look and love this photo!!! 🙌🏼💕✨", "our.cottage.life": "I wear target jeans, although find they're sizing even of the same product very inconsistent. The rest of their clothing is very dated and tent-esk.", "iamcharlotterebekah": "Lately I haven't shopped at Target because their sizing has gotten smaller and smaller and their versatility and range can be pretty boring actually. Make jumpsuits without such fitted zips or fastening so that curvier women can wear them and feel confident and great.", "emmaharvie": "I love the Preview range, but the sizing is all over the place. In that skirt, I was 2-3 sizes smaller than normal. Some of the pants I could barely get past my knees, even going up a size. It’s like they have sized up smaller patterns rather than design specifically for a curvy body. The discrepancy in sizing makes me not even want to try stuff on. The Curve range is frumpy and I wouldn’t even bother", "72pauline7272": "Target is hit a miss with me. ¹6 sometimes fit, then 18s are way too big....I rarely shop there for clothes now....", "curvy_coconut": "Firstly you look great and that skirt is so amazing. Secondly black sells so well because we were all taught growing up that black was flattering and “slimming” so that bullshit takes time to get past those old ways of “how to dress” and I don’t shop at target personally because their range for plus size is dull AF, it’s all one dimensional and no fun and is so badly cut for larger body it’s actually a joke.", "angelamrose77": "yep i do. they have definitely come leaps and bounds in the past few years. about 5 years ago was the most awful cheap range there. so im happy they are on the improve", "lauranicole.b_": "Their plus size range is sooo daggy and frumpy 😑 I don’t understand why they don’t just do their ‘normal size’ range up into the bigger sizes 🤷🏼‍♀️ they don’t need to waste time ‘designing’ different ranges as their core range is actually pretty good 👍🏻 Fashion is fashion no matter the size we all want to look pretty 💗@targetaus", "marzy_37": "Being a size 24-26 I find they have nothing but basics (under tanks etc) that fits... Also the plus range is often very bland and lacking in color compared to the \"regular\" sized clothes", "janijans": "Ive had success with their jeans and tshirts, but have honesty not felt inspired by their designs for plus size women. I havent found them very fashion forward at all and thats been a disappointment for me.", "hello.gorgeous.designs": "I also avoid shopping as much as possible & rarely shop at Target. I'm a 16/18 & it's difficult to find anything that fits PERFECTLY everywhere. I want to celebrate my curves, not hide them under loose clothes or made to feel ashamed for being a curvaceous woman. I'd love more colour choices, patterns, fabrics... I want to be seen looking amazing, not hidden in black dull, unflattering clothes (at many retailers, not just Target)", "ainslieroses": "I find the quality isn’t always great, and the sizes run small. ESPECIALLY the underwear. And given the lack of quality and the sizing, I’ve found them to be over priced. However there are some goodies. I’ve found some natural fibers there that are ok.", "enzinascarcella": "I love the option to have a black and a coloured version of styles. Preview brand is beautiful and I wish it went up to size 24.", "willowcurves": "I don’t shop at @targetaus because it’s not fashion forward enough and I can get similar styles to what they sell from other places", "thedeigans": "I avoid target at all costs because their sizing is shit & definitely does not accomodate to large sizes.... & if they do they are grumpy terrible looking outfits", "bht_khan123": "You look fabulous beautifull"}