{"jen_l_mc_": "Yes found pilling a problem, colour please", "nadeen1980": "Hey Kmart thanks for coming to the party! I’d love for more of your curvy range to have pockets on the pants and cardigans, would also love longer arm length on short sleeve tops. There seems to be a lack of consistency on sizing at times which makes life hard and the curve section is tiny compared to ‘normal’ range. I love your plus size basic underwear range - the best knickers!!! Plus size bras don’t seem to fit very well or offer enough support. Love this outfit you have on Sam 👌👌👌", "jess.som83": "Make more items in normal sizes in plus as sometimes I love pattens of a print but only goes to size 14 why can’t we get the same items", "amydeville": "I love the Kmart plus range, BUT, a lot of it can be quite “matronly” us bigger girls like to wear some of the new trends, we like crop tops and wearing lots of colour. Please consider upping the size range for some the “regular” sized items ☺️", "ecopadsaustralia": "Love this outfit so much!", "natasha.crane.12": "Beautiful lovely dress", "mykittehhasfangs": "I find a lot of their dresses are far too short, you can barely bend over without showing ya knickers! Anything that doesn’t crinkle and shrink would also be a bonus!", "bronlahrs": "Love!!! I find size 18 in normal is such different to 18 in curve", "kallen1900": "@tan_tan_tanni we need to spend a lunch break (or two) in kmart!", "thecontractorswife_": "🙏🙏🙏🙏 I’m so excited by this!", "lilipepp": "@miniluisa_ ❤️", "ruby_plus_madi": "@gemma_sculthorpe this one 😍", "katet6160": "Hi @curvysam - that is a great outfit! I have started shopping in KMart more lately because their plus size range is improving, and part of it is obviously due to them listening to feedback passed on from people like yourself - so thanks for that! There have been some really lovely options lately - loving the linen and cotton ranges, especially as KMart are working to be more environmentally responsible. My frustration? if that's the right word - is around the difference in fabrics and cut between the two ranges (\"normal\" and plus size). I recently bought a gorgeous pair of culottes in a great print, and a fantastic light, summery viscose/cotton fabric. There was a matching top in the 6-20 range, as well as the plus size range. The smaller top was the same fabric, and looked like it would be really flattering on. The larger top was a clingy knit fabric which looked like polyester, and was a sack-like garment that had that weird pleaty bit in the middle of the neckline (why do designers do that??!!) that just makes everyone look bigger and really frumpy. I realise that a lot of cuts and styles that look good on a 6 aren't necessarily going to look good on a different frame, but a little more thought about what works on different body shapes - the fabric and print - would be great. Thanks for passing on our feedback! And I can't wait for that dress 👗 to come out!😍", "kayzeesfashionhouse": "Looking stunning", "andisuarezok": "@esthercitadomin @esther.benitez.395 😍♥️🔥🔥🔥👑😘", "ejackk": "@hayleyjacka", "antonc81": "Amen, the plus size clothing at @kmartaus Is so bad. It's about time they upped their plus size game! How about bigger size shoes as well!!", "misskristylouise": "Love this outfit 😍", "magicalworldofhannah": "Feedback for Kmart and others - don’t buy from Kmart! Unless you enjoy wearing clothes by child slaves.", "jesscuz9": "@amehh92 this is the dress I was talking about today", "the.alteration": "This dress is perfect on you- belted in exactly the right place makes you look 🤩", "the_bowen_tree": "I just want the same range as the standard sizes get but with allowances for tummies, arms and hips/thighs 🙌 also just because I’m in a plus size doesn’t mean I’m 6 foot tall, I’m just out of proportion and good plus size clothing design recognises that 🙏🏻🌻👏", "hannahallenstyle": "@natashajanek @brenviv 🙌🙌", "daniellecatherinejohnson": "Absolutely stunning 🔥", "lizwilsonphotography": "@cat_topliff 😍😍😍", "themindydiaries": "This dress drops in 2 weeks @tabitha.grace.eloise ... i need it. ❤️", "meandmine82": "I love Kmart!!!", "prudencejh": "This is lovely Sami have screen shotted you a million times haha. I think extending similar pieces like the green skirt and this dress...very similar to the straight line but well cut... alot of the wrap dressed and tops and so poorly cut. So its a step in the right direction 👍 I would have paid 2-3 times the prices of the green skirt and ive already brought the 2nd colour. Enjoy your kmart time xx", "thelongweighdownwithjess": "Personally I wish the style didn’t change once it goes over size 20. I’m a 26 and would love to be wearing what my friend is wearing in a size 10. Not a weaker, grandma version of it 🤭", "snaphappystace": "Saw their story, spotted you & was like \"heeeey, i know her!\" 😂😂😂", "stacyreichstein": "It would be amazing to have their current styles in the ‘normal’ range extended to plus sizing. Im not a fan of the plain tent t-shirts and their lack of bottoms range", "lifewithmicahalexander": "I neeeeeed that dress. Looks so lovely! 💕 So stoked to hear they are upping their game in the curvy range. We’re allowed to feel beautiful in what we wear no matter the size!", "kace___": "Maxi dresses with sleeves! Prettier prints, not daggy prints & colours. Long line shirts/singlets.", "emtremethick": "Plus size maternity wear and breastfeeding wear! Kmart (and the other major retailer) maternity and breastfeeding clothes only go up to a size 20. Fat people can get pregnant too. I’m a size 22 and found it so difficult to dress during pregnancy and I’m still breastfeeding a one year old. Thankfully I can fit into their feeding singlets, but none of the feeding tops or dresses. I’d love it if this feedback could be passed on!!", "bellacurvee": "Active wear", "hann_almassi": "When does this dress drop at Kmart!?!?! I need it!", "pinkimages": "Oh I love this! I'd love to see more colour options too. The most frustrating thing about shopping at Kmart is a straight size 18 is completely different to a plus size 18 - why aren't they just the same measurements? I realise not every item is going to suit my body shape but I love the idea of knowing that I can pick up an 18/20 from any rack and know it will be close to fitting. I tried a pair of sz18 pants the other day that wouldn't go past my hips but another pair swam on me.", "taniahouwing": "Sleeves! And not just tiny frilly sleeves but proper sleeve length (think closer to the elbow) And pockets! Personally, add things for hour glass girls. We have a small waist that’s higher on the torso than other shapes. Design a few things with that in mind.", "jannautopia": "Make more wide/bell sleeves. So many times I have tried on a top or dress and it would@have fit.. if only I could have gotten it over my arms.", "renaelcoote": "V necks. Heaps more V necks in blouses, dresses and tshirts.", "fabric_rules": "😍", "reneedoesntfeellikedancing": "Oh and material that doesn't shrink. I always have to buy a size up cos they always shrink", "blairio_fishbag": "🧡🧡🧡🧡🧡", "shellmbell69": "Would be nice if their swim wear went up to a G cup or higher, and also if the active wear leggings actaully had the phone pocket as well. I love Kmart and tbey are my go to shop 😍", "kmartnzlovers": "Amazing 😍😍😍", "saskiapridhammakeup": "Thanks Kmart us curvy girls need “fitted shaped” pieces not just large sacks! This is stunning!", "confessions_of_a_gcup": "I’m loving this look on you!", "a_knights_creations": "Love that dress but I hope all the Kmart range isn’t going to be long like this....I noticed the other day they had a few cute dresses but they were all a weird length. Normal sized section had cute flirty above knee dress but plus size were all long...just because we’re plus sized doesn’t mean we don’t want to show some leg", "mandels123": "Love this dress, looks gorgeous on you. active wear And pjs in plus size would be great. Looks like a fantastic event, have fun x", "mrs.c.gibson": "LOVE this dress! 😍 I'd love to see more summer pieces with longer length sleeves for those who hate the top part of their arms. In brighter colours for the warmer weather but also black/navy/olive for all year round! ♥", "swanniee_": "Better undies! Not all plus size undies need to be grannie panties and high. Midi and nice breathable fabrics.", "thatlakengirl_": "Love this outfit!❤️", "mrs.mellon.and.her.pips": "This is gorgeous", "livinglifethebrightway": "Plus love that dress, so excited that they are working on their range", "ginkoyellow": "👌Very beautiful!", "lozzmurphy": "I like the fact their is better crossover from plus size to standard size. I am an intmbetween and at other store I can sometimes be too small for plus size but too big for standard size. I find at kmart I find things that fit due to the size crossover.", "alana_odea": "Loving their new range btw, and your look lovely in these looks", "biggirlontop": "Love this look . ❤️", "nessyd31": "😍Go Kmart!", "jennifer.buckingham": "The cutest 😍♥️😍", "kasey.rainbow": "Gorgeous!!", "brittany____stewart": "Prints! They do some great pieces in the standard sizing, so why not just do the same pieces but extend the sizing. Not all plus size girls want to be wearing baggy clothes with no shape and bland colours.", "sisinamasinello": "Love this on you 😍", "bay.10": "Very SUMMER 🙌", "erin.may.o": "I love Kmart clothes, but hate that most of their range doesn’t suit tall women. I am only 6ft, so I wouldn’t say excessively tall, and regular length pants are all ankle biters! Plus the jumpsuits and playsuits just don’t fit at all! Is there a possibility to make some clothes that work for taller people too?!?", "kristiedaniels_": "Yay this is so needed! Breathable fabrics in beautiful dresses etc. Always makes me sad seeing the amazing dresses in the straight sized section then seeing the same fabric turned into one of those polyester front, jersey back tops for plus size!", "kate_davies1": "🔥 🙌🏻", "sarahclancyy": "okay obsessed! 🙌🏻", "janalyngilbert": "Very funny that Australia has a KMart that seems to be thriving; KMart in the US is essentially dead 😅😂 It was also known for not having a lot of cute stuff. Good for KMart in Austrialia! And of course the outfit you have looks great on ya 💞", "louisobelmurphy": "Love the cross over dresses the last couple of seasons. Extend the normal range into plus sizes not just 18/20. Also WHY did Summer ‘20 swimwear range stop at size 18 and not extend as has previously done. Really disappointing. The plus size swimwear is not flattering and is really limited. Please extend sizes in normal range!!! 🙏🏼", "thesimpleglamazon": "O this is a great dress! So casual and so chic I love it.", "charlenegirl": "More colours", "lovelyinla": "This is so cute babe 🙌🏻", "ajdreamwhisperer": "Sleeves options on tshirts- no one likes sausage arms Breathable fabrics. Layer options. Key fun pieces. Good pattern makers- so sizing works. Just because I’m in a larger body doesn’t mean I’m over 6ft tall. Bathers- that are fun. all prints in tanktinis. More stock!! Hopefully after your posts we won’t find everything sold out.", "ladamson": "Could they get their in betweenie range working ... plus is too big and normal is too narrow .... it’s so hard as an I between Xx", "lizphoto": "Very pretty love this look 💕", "kimiihugz": "Exciting :) I saw you wrote linen is in a lot of their range which is nice. More basic on trend stuff would be nice. Wrap dresses, pattern 3/4 pants, elastic waist skirts, cute tees with nice print in material that doesn’t stick to the belly. Just thicker nicer materials and popular flattering styles good for stomach & weight coverage. More light coloured jean options for summer.", "curvysam": "@e.s.j.a.y neutrals for curve finally 🙌🏻🙌🏻 I’d blend in with your decor now.", "blossomwithin.photography": "Love this dress!!!! 🙌🙌🙌", "laurelanneconstantine": "More sleeves please!!!!", "smashley228": "So chic❤️", "heyjoberry": "Longer tunic length tops to wear over jeans / leggings that cover chunky thighs. Sleeves! Empire line tops / dresses that give shape rather than being tentlike. Neutral / plain fabrics rather than gaudy patterns. I feel like the powers that be want plus sized women to walk around looking like a cheap gaudy couch!", "michyall77": "Less grandma floral or weird stripes n lace and more on trend patterns in fabric. More cotton less polyester. Maybe bamboo options???", "morgasaurus.rex": "Do they have some clothes that only increase horizontally and not vertically (for the petite plus gals)??", "tinalouise2428": "Better quality fabric (breathable) Longer sleeves More colour choice Wrap style maxi dresses Linen jackets Stylish sleep/lounge wear", "prentice_jo": "It's good to see much better plus size clothing in Kmart. I have been able to pick up some lovely pieces at very affordable prices. All that is needed now is better size consistency. I tend to get a size up in dresses and jeans. Well done Kmart 👌🌹", "danni_and_archie": "Yess so keen to have more of a curve range! But also please make the sizing normal! Some tops I had to buy a very large size because it fit weirdly and then others I buy a smaller or my normal size! I don’t mind upsizing but when you have to go up 3 sizes!! Ahhh!", "maddi.higgs": "Would love consistent sizing. Currently loving the linen blend items in store, more of these and cotton too would be great for summer! As a younger plus size person it’s nice to have trendy options as well as more basic things too. But I was really impressed last week when I went in for some new tops", "natvellozzi": "Gorgeous dress ❤️", "kel4stan": "@marzy_37 ooooo the plus range looks like it’s getting better 👌", "leiighaa_xo": "Their sizing to fit around the bust and arms correctly. Also if an 18 and 20 is going to be in their standard range to make the rest of the top fit those sizes the arms a so tiny.", "tanlounge_official": "😍😍", "maddisoncallaghan": "Styles that suit curvy women and excentuate them. Just because we are plus size doesn’t mean we want to dress in a tent with boring styles!", "peta_behan": "This dress is so lovely!", "cooleo.pooleo": "Ooh is this a cotton/ linen dress too?", "freerange_mum": "Could kmart get rid of the 80+ styles of tshirts and bring out tailored pretty tops.using nice fabric please. The polyester/cotton has got to go! It smells rotten, the fabric pils and the side seams always move. Kmart doesn't have nice enough styles of their own to not keep up to date with the trends that other stores offer. Also all the singlets from the sleepwear with built in bra thing need the bra section to be bigger to cover larger boobs as the size goes up", "learningtolovesarah": "I love kmart! Love this look 🙌", "kirsty_zak": "I bloody love this so so so so much @curvysam - stunning! Can’t wait to see what @kmartaus has in the pipeline!", "casealsop": "@emjy 🙌🏼 more copy cat outfits 😂", "katharine_jane257": "Stunning! 🙌", "just_making_shit_work_as_a_mum": "Kmart has a babe on their side 🙌🏻", "joyess": "Absolutely gorgeous Sam!", "bye.fe.lisa": "Would be great if they had more stock. Every time I go most sizes have sold out. Love this dress. I’m sure I’ll be fighting to get one b", "len_zo": "Amazing! Would love stuff that covers the arms a little more - anything elbow length!", "jocullenlander": "❤️ This", "vegnan2020": "Beautiful photos! 😊💚", "almum91": "Please extend there active wear range to include all plus sizes. There tights only go to a size 20 @curvysam 👍🏼", "shayleedel": "Please stop making so many polyester & elastane/viscose ‘swing tops’ they are super unflattering.  Bigger sizes in active wear. This includes squat proof pants, bras, tops and bras. Stop making cross over tops with the tiny metal button press stud. Having a button or something more secure will stop my boob falling out every time I move. Nicer bras and underwear in bigger sizes. Plus size ladies love to feel sexy too in underwear, not like we need to hide everything.", "mele2541": "Sick of seeing shit plus size range compared to their straight range. No thought or care into making plus size modern and up to date with trends. Take that to buying team 😊", "pretty_little_pairs": "Beauty 😍", "theillusivefemme": "Stunner! ❤️", "jensstid": "💜", "jenniferatilemile": "This is such a gorg outfit and you look sooooo prettyyy 😍😍😍", "blfxx": "Consistent sizing, please!", "talking.shop": "Yasss girl 🔥👏🏽👏🏽", "befjam": "That's such a classically pretty outfit. I love it", "malevolent.benevolent": "The dress is gorgeous 🥰 more current fashion styles like this for plus size is what I'd like. Great preview! If the range is good, I'll definitely buy every item.", "neoncherry_": "Love this photo of you", "emilyhrudicka": "Love tHat dress on you!!", "forzayden": "Love this dress ❤️ but I often find Kmart clothes have inconsistent sizing even in the same size and often the fabrics fade or go out of shape quickly. I would prefer to spend more money for something that will last more than a few washes.", "samscholt": "@curvysam plus size active wear! Trendy clothing, just more of it! More options, love what they're doing so far though!", "gemz.o1": "Extend standard size range to plus size, more consistency is sizing, bigger range, active wear, shape wear, better pjs.", "notyourstandardkim": "Do they deliver to Canada? #misskmart", "twotravellingplanners": "That dress looks really nice 😍", "laurenzoe.x": "Wider variety! And cuter styles! Shoes up to a size 12/13??", "ritaportelli": "Please please bring out plus sized clothing to suit varying heights. Unfortunately being plus size doesn't mean I'm 6ft tall, no matter how much I wish it!", "graphiclane": "Love this 😍 would love to see better sizing and all items going up to plus size. More plus size range.", "chicky_leanne792": "Absolutely beautiful 💖", "lozzymichelle": "Not everyone has a straight body shape. I find a lot of the tops and dresses fit me on the top but because I'm a pear shape that's where I struggle to find something that fits. As soon as they hit my hip/belly area they are too tight", "theplussizemum": "Really love the most recent pieces. I’ve noticed too that there is more stock available whereas previously the key items in the collection will have limited stock. Great work! I’d like to see more of the regular sized outfits extended to plus size. Extended sizing in shapewear would be awesome because us plus size girls are the ones that need it! I’ve never understood shapewear in a size 8 🤷‍♀️ Ideally I’d like them to relook at their shoe sizing. I’m a size 11 normally and I’m lucky if I can get the shoes over my toes.", "joadymacas": "Love the dress but to me the bottom button is too high. Why can’t they button all the way to the hem and it be your choice if you want it open🤷‍♀️", "ainslieroses": "I prefer Kmart over target. Price range is good, but o don’t associate it with quality. However I have picked up some good quality natural fiber clothing. And I wish they still had the same tights supplier from 2016 ish. Their latest tights are just not the same.", "___joal___": "✨✨✨", "confident_in_skin": "Can they have cute outfits in plus sizes made of fabric that doesn’t crease easily too ?", "patrice_lund": "I’m SO glad you got invited!!!! Someone who will keep them accountable and make sure they are building a genuine curve range ....love this dress on you!", "stephmtravill": "Love love love this outfit!", "tanlil381": "Love this dress. Much more stylish than a lot of what’s out at the moment.", "julie_oxo": "It would be great if there wasn’t such a huge jump in their normal sizing range to their curvy size! I can’t fit into their normal size yet their curvy 18 is too big!!", "_mulissha_": "I'd like to see some more fitted pieces, the last few tops I've bought had no shape to it and i felt like i was wearing a smock same with the dresses just felt like i was in a tent. I'd love to see some trendy bottoms with some length, i hate the ankle freezer look lmao and anything elses is too short for my waist.", "kelly_scicluna21": "Less floral patterns! Extend the main range to plus size. Plus size only gets a small range of new items the main range there is something new all the time make it fresh and with the current trends!!", "wovemetight_getsfit": "Love it 😍", "jennifer__kate__": "Hopefully they utilise fabrics like viscose as I just sweat sweat sweat in polyester and a lot of plus size lines seem to really go for polyester", "catriona1980": "Traditionally I don’t tend to shop at Kmart. Don’t like the idea of where or how things must be sourced or produced for such a cheap price. Love that they’re looking to be more size inclusive but would be happy to pay a bit more knowing it had been ethically sourced!", "jessiebell_k": "Sleeves please, and generous sleeves at that.", "kerenleahriley": "Non frumpy clothes and tshirts with normal length sleeves 🤔", "miss_sally_b": "Love this look! Soooo good! 🙌😍", "steph.derooy": "Oh I love this! You look great!", "amandaholt_": "Lovely!", "maddiekat_w": "Height inclusive!! I’m nearly 6ft and I’m a teacher - I need something fashionable and modern, but appropriate! Love this midi length, for dresses and skirts. Also, I would love to see your normal range in plus sizes! We are people too!", "casaba.swim": "Ooo, love this dress! You look gorge 😍", "sallza_": "Ensure all pieces in the standard range go up to size 20. Some do but a lot dont. A petite plus range or at least some pieces that are not maxi's would be great", "eightyseventhstory": "Beautiful! 👌🏻", "lisa_j_85": "I would love some linen shorts, that are to the knee. They are all WAY too short!! 😢", "sallylmatthews": "Love this outfit and dress! Hope it comes in another colour too.", "tenelle88": "More Natural fabrics! Polyester is bloody awful.", "splint3031": "I love Kmart for plus size options, so much more fashion forward and flattering than Target or Big W ! I would love to see more natural materials, polyester is just horrible. And a bigger range would be great, Kmart’s plus size offerings are a lot smaller than their smaller size range. Sleepwear in plus sizes would be great, and more jeans in plus sizes (I luuurve Kmart plus size jeans).", "dantheunis": "Some more cotton or cotton blend items - polyester is so sweaty in summer!!", "lizaj71": "Would love to see more maxi style dresses in their plus size range and with sleeves too and more colour not just plain pieces because not all curvy women like plain 😊", "warden85": "Stunning!", "em_moule": "Oh, this is great news! More of the main range in plus size rather than different items. Tops made from breathable fabrics. Also, going above a size 10 in shoes. 🙂", "belle_olive_reid": "Want hat and bag", "allyjenkins93": "Love this, I love Kmart but can never find anything nice for my size! Hope this improves! 🙏", "kitcheningabout": "Also good quality active wear would be amazing in their line up", "essentially.hannahm": "This dress is gorgeous as are you. 💗 I would absolutely love to see more on tend range for plus size gals, not just a couple of pieces and then the rest is just daggy.", "lattelover__": "Longer sleeves and longer length T-shirt’s. Flattering cuts in the dress range, and more simple colours, not every plus size woman wants to wear loud prints. More trendy T-shirt’s for younger people.", "jessikazz85": "More natural fabrics , way to match polyester going on at the moment", "grahamnjoy": "Luv this on you 😊😊❤️❤️", "shinae26": "A curvy petite range cos not all curvy girls are tall!! 😬🤞🏼", "beautifullyfkedup": "ACTIVE WEAR ACTIVE WEAR ACTIVE WEAR. It is BEYOND ridiculous that their active wear stops at size 20 🙄", "ritacolombi": "Would love if they just made their “standard” sized clothes in bigger sizes. How many times I’ve found a top, dress or pants in an 18 or 20 but just a tad too small! Continue the sizings to 22,24,26!!!", "maddiyeoh": "😍😍😍", "i.am.feebee": "More colours please! I’m sick of olive green, black and grey as my options. It makes me so sad to walk past all the fun colours in the smaller sizes only end up with such drab options in the plus size. Also, some good basics would be awesome - singlets, tees, denim... also you babin’ in that dress!", "sally_finlay": "I purchased the best ever dress recently - I get compliments every time I wear it and would have happily paid 3 or 4 times the price. (the babydoll style with the green background and tropical foliage print). I so want it in more prints! They have the top version in 3 or 4 different prints but not the dress.", "lisaf2710": "Would love to see curvy activewear with a high waist roomy long tops and singlets being just over 6ft I want to cover my tummy. Shorts and pants long and not so flary around the thighs and legs!", "alana_f11": "Material that is less prone to pilling is another problem I sometimes find with their clothes, more cotton, some of their tops are often small around the bust. But all that said half my wardrobe is Kmart so they're doing lots right 😂", "thisismeagankerr": "This is stunning on you Sam! I’d love to see more consistency in fit at Kmart - I’ve tried on a few new season pieces and some are an incredible shape and fit. Others are too big in some places while being way too small in other parts! I’d also like to see them extending the sizing on their plus range", "allytolson": "Love!!!!!", "shellsomer": "I agree with the longer sleeve! And sizing consistency is an issue of theirs!! The active range they used to have was amazing would be great for some items in their straight sizes to be included in curve range.", "loz_bailie": "Love it, can't wait to see what they bring to the table!", "littlemoodesigns": "Looove", "fimailer81": "A suggestion - how about remembering that not everyone who is plus size almost 6 foot tall, it would be great if Kmart could look at a curve petite range", "leannezimmermann": "Fabulous to here that on any improvement 🙌🏼 all things moving forward is a step in the right direction 🖤", "sharna_19": "To have the normal clothes range go up to larger sizes. No need to stop at an 18 or 20. Theres some really great styles at the moment we should all be able to wear the same styles. I’ve recently bought a number of tops at Kmart that I love but am already at the largest size, what about people who are larger than I am.", "shade_swim": "Stunning babe 💕", "sophspics": "Decent shorts (not massively flarey ones on legs) and more cotton items please 👍", "courtycourty": "Please be height inclusive as well! I'm 6ft tall and the only way I get clothes long enough without showing my butt or hoohar is to size up then every where else is baggy!", "chrisduke74": "Definitely 3/4 sleeves or at least elbow length ... I rarely buy tops because their sleeves are too short ...", "womanofstyleandsubstance": "Ooh I love this outfit 😍", "emtreephotos": "Please make some trendy plus size clothes. Just because I'm curvy doesn't mean I want to dress like a 60 yr old.", "reneesheaphotography": "That is so cute!", "thisisashrose": "Love this look!! That dress looks straight out of a high end store 👌👌 well done @kmartaus", "taniaconroy": "Prettier plus size lingerie is something Kmart lacks in would love to see a range that caters for fuller busts that is sexy.....", "amysheppardpie\nVerified": "Verified", "l_ren987": "Love that outfit 😍 I would love to see some shorts with a bit of extra length. Would also like if they took into account for plus size arms in their longer sleeved items! And lastly, sizing consistency 🙂", "what_bec_does": "Review their prices, just because I wear plus size doesn't mean i should have to pay more than an item from their standard range", "becasutton": "Wow that dress! 😍", "jenna_a_j": "Great news @curvysam", "amyjean89": "I would just love to see the same clothes from the straight sizes .... they do amazing pieces I just want them in an extended size .... 🤷‍♀️"}