{"_s_h_e.e_n_a_": "I'm totally down for the next Prom. I'll start saving for it now!!!", "erinc164": "You look absolutely gorgeous. Colour looks fabulous on you.", "parttimepinupgirl": "Oh that dress is divine 😍", "thedavens": "Love your heart, woman. Happy for all the people that were able to go! It looked like a special event. Love from Seattle. 🙌", "72pauline7272": "I was one who said they'd come to an event in Melbourne. I was pretty annoyed when my work decided to hold its annual conference on the same day. The event looked amazing. You did an awesome job 😘", "hilds_m": "You look stunning 😍 thank you for all your time and effort you put in. I love being apart of this group of amazing women 🙌", "leannezimmermann": "Looking spectacular Sam 😘❤️", "alison_devitt": "I was so bummed I couldn't make it, it looked like so much fun and you all looked so beautiful, I hope you do another one❤️❤️❤️", "reza.masroor001": "Looking spectacular tits", "mellohoegs": "@kryddal let's go next year 😘", "sunita_weddings_mua": "Love this dresssss I want it! 💜", "lisslings": "You look beautiful and I’m glad the event was a success", "starleniadawnamos": "I am loving this color", "korieckard": "Very pretty", "leanne_j_mangano": "😍❤️😍❤️😍", "shessoseasonal": "This dress is stunning on you 😍 the colour is incredible", "laura_n_mac": "Love this dress on you! You look beautiful! Also love your old formal photos. My date also got a black eye the night before my formal back in the day hahaha 🤦🏻‍♀️", "jamie_jetaime": "What a gorgeous color!!!", "mountgravattmazda": "Gorgeous ❣", "yourevolutioncloset": "Super pretty!", "tanwool": "Wow stunning dress & you look fabulous in it. That is what I call schmexy!!", "almeparis": "Love this pic !", "big_bold_bohemian": "My fave photo of you goddess! Xx", "profsurgical": "She has stolen my boobs ! ^^", "ritamycyk": "Can we do QLD next time?", "hardly_em": "Beautiful 💕", "jihanamer": "Congrats Love!! It sure looked like a fabulous night 😍😍😍", "marzy_37": "Couldn't make it this year coz of my baby so I'm excited to hear there will be more!!;🎉", "bodymindspiritfukit": "Gorgeous dress ❤️👗 so Sydney next year?", "balzercarlo": "Wow beautiful dress 🌹🥂", "delinadesign": "Yay!!! I’m so glad the tough organizing hasn’t meant that this is the only one!!! Already can’t wait for next year! You’re all amazing!!! 👏🏻👏🏻👏🏻👏🏻👏🏻", "beachyjessxx": "You look stunning!", "fimailer81": "There had better be!!! I’ve got a $500 voucher to burn on an amazing dress!!! 😂😂", "tinaharvie": "Stunning", "daniarmstrong": "You look truly amazing. I am so happy that you all had a great time!", "lyndall_fletch": "Gorgeous!", "tsid_clothing": "Stunning! 🔥", "theswiseone": "Holy crap you look amazing", "xoxheatherpiexox": "That colour on you 😍👌", "lajoieskin": "Well done you and team @curvyau 💖", "jessica.finn.9": "Definitely got FOMO from the prom so I’m very excited that it’ll happen again next year I love your dress ❤️❤️", "natellapip": "You look amazing and this dress is gorgeous. You truely are an amazing, kind hearted, one of a kind person.", "the_nylon_swish": "Beautiful ♥️♥️♥️♥️♥️", "newstylechapters": "You looked fabulous in this gown. And, well you know how I feel about you 😘😘😘", "antoranthony": "Wowa you look stunning in the photo. Loving the blonde hair 🔥", "thekmartlover": "11/10 😍😍😍", "wickerdarling": "You look amazing in this!!", "cinkster1980": "Yes next year for sure. I found your page late so not enough time to budget to get to Melb", "anita_allure": "You look stunning Sam 😍", "therealqweenb": "🙌🏼🔥😍", "jenniferatilemile": "Yesss! It’s a thing. Women used to gather together and that created bonds and a literal sisterhood", "my_shopping_dreams": "Oh my gosh! Babe town!!", "kristiedaniels_": "Looked awesome! I’ll fly over from NZ to go next time", "miss_sally_b": "You look so gorgeous! 💕"}