{"jennieyles_": "Mean girl behaviour is not ok...we see it and I say 'grow the fuck up'. I hope YOU'RE ok @curvysam . This shit has gotta stop. Take care hun.", "rachfriend": "I’m sorry Sam. You’re truly a light on my timeline and I love following you. Sending you hugs. ❤️", "honeybeewell": "Oh I’m so sorry you are dealing with this. Just keep taking that high road you’re on and let YOUR positive actions speak for themselves. Something I like to keep in mind when dealing with trolls whether it be online or in real life, Is that it’s something inside them that is causing them to have this reaction to you. (The Four Agreements, great book by the way) It has nothing to do with you. You’re a wonderful inspiration and you just keep on going ❤️👏🏻", "itsmissveronica": "Also, I never got to go to a school formal, and the photos of the curvyau prom look like so much fun. Next year ❤️", "alycia_e_": "My grandma always used to say that nothing worth doing is easy. You’re inspiring women to love themselves regardless of what others might think. You’re an incredible person. You shouldn’t be treated this way. I’m sorry people suck. ❤️", "thebargainhunter_": "I’m sorry to read this and this is happening to you. You have my support, take the time you need to recharge XX", "tanwool": "This is a disgrace. In the short time I have followed you as I’m fairly new to insta (I’m a late bloomer), you inspire me to just be me and for once in my life i feel its ok to be curvy. I actually look for your daily posts or stories now now. I am a @curvysam Addict. But honestly these people disgust me but I also know one thing for sure. They may be causing you distress but they are simply JEALOUS!! They want what you have gorgeous girl. You are beautiful inside & out. Don’t let the trolls win babe because this is what they want. Keep on with all the amazing things you are doing because you have literally given me a different perspective on being curvy & no doubt many others. I honestly don’t know how these people can sleep at night doing what they do to upset people. It’s deplorable to think another woman can do this to someone. Don’t let them win darls you are frickin awesome so show them just how bloody fabulous are. The laughs on them anyway look at all this support you have. We love you to bits 💗💗💗", "jenniferatilemile": "❤️", "tam75tazz": "Sending lots of love. I’m older than you and you inspire me. I wear dresses and tops off my my shoulders now. I have stressmarks on 1 but now I say f it. I love the look so I’ll wear it. You inspire so many ppl. I love your posts and your honesty. But yes there are times when u need to step back and re gather. I’ve done that many times. Sending love and support to you @curvysam", "tiffylouise": "Following you on Instagram has slowly inspired me to love myself even though I'm a bigger girl. I'm so sorry this is happening to you ❤️", "mere_1975": "You are wonderful. You are inspiring. You are truthful. Please don't stop being you because of some stupid twat.", "daniellecatherinejohnson": "<3 much love to you babe, you're doing amazing and don't let anyone tell you otherwise xx", "princesseatspeasoup": "So sorry you are going through this. That is a campaign of harassment by the way. Please take care xx", "jihanamer": "This looks like such a fabulous night 💕💕💕💕", "tammycreaser": "People will always try to bring you down@in life. Show them you don’t need those kind of people in your life. Sending you lots of love x", "bellacurvee": "Stay strong ❤️", "celtickezz": "Oh @curvysam do not let these mongrels win. Do not let them dull your sparkle, do not let them enter your domain of strength, do not let them decide when and what you post and most importantly - do not let them take you away from us.", "beck.egan": "❤️", "ellennyswim": "😘", "invokecouture": "🖤 stay strong", "randwickbells": "❤️", "shellannew": "@curvysam why shouldn’t you make money from these events? You’re putting in all the risk, time and effort. I mean if you don’t sell enough tickets you’re left with the $$ loss, so surely it’s not insane that at some point you be compensated for your work/ risk? We live in a world where everyone wants to pay $ for items and services but want to have $$$$ in their pay check. Shit costs money and most small businesses aren’t running around with millions in their back pocket. Grow little poppy until your super tall and don’t let anyone cut you down. Fingers crossed for surgery today! X", "ollypolly19": "Fuck them and keep being awesome. 💛", "lozzymichelle": "That is very disappointing. Good vibes heading your way ❤️", "fridayiminlovexo": "Ohh hunny!!! You are amazing sweetheart & so inspiring!! Hope to see SO much more of you here babe 😘😘", "trishtumbles": "It hurts my heart how some people try to take those down who they perceive to be doing better than them, or are a threat to them. It’s just such bullshit. I’m no stranger to bullying and know how hurtful and demoralising it can be. I hope you’ve got people in your corner to straighten your crown when it’s a little wonky. Take some time, come back stronger. Sending you much love 💗.", "one.night.stanzas": "I don't know the law in Oz, but what's being done to you counts as defamation here in the UK and you'd have a right to legal action. These folk ought to think about that. If someone's spreading demonstrable misinformation or lies about you and it has the potential to affect your public image and business, it's defamation. I'm really sorry it's happening to you ❤️", "72pauline7272": "You put it perfectly....\"Most of these actions say more about the person doing them than the person copping the flack\". Stay true to you Sam 💖", "sogwladys": "I'm so sorry to read all the things you've been through Sammi. You're such a genuine person, I don't understand how someone can be that mean with you. I wish you the best 💕", "life_moving_on_35": "If you feel a need to step away a little to feel better, you do it. But to those people trying to troll you, bad mouth you, intimidate you? Well... excuse me, but FUCK THEM! Jealousy hurts doesn’t it, you morons. Sam stay you. You rock at what you do! Xxxx", "louisetaylor48": "Omg! That’s just bloody horrible! I’m sorry you had that done to you. Totally not ok! You have my love and respect! 💕", "kirst42": "Name and shame as I don't want to possibly be supporting a company that would do that!", "momonique8": "Having a break from all work is healthy to prevent burn out and keep perspective even when your job is a deep passion. Sam I hope this is a short break and we see more from you. I value your opinions and content I have always been curvy and I grew up thinking it was my biggest deepest sin the wrong about me the way I ruined myself- I was a child when these feeling began. Now I'm a mum an I want my daughter to know and feel what you promote. Beautiful is a. Not the rent you pay the world for being a woman. B. Beauty knows no size. Fill your cup take a breather. Feel refreshed you deserve it.", "ansandfinnian": "Sending love and light to you 💗🌈😘x", "daniarmstrong": "I am genuinely saddened to hear about this Sam. You are so positive and supportive of your community, it’s incredibly disappointing to hear you have not had this returned. It’s the ugly side of this social media world. Just remember that you are a truly beautiful person who makes this world a little brighter by being part of it. Take the time you need to regather and recharge, but please don’t let this ugliness dim your beautiful light ❤️", "livinglifethebrightway": "I really hope you do find more positive than negative @curvysam as you are fantastic and have really inspired/spurred on my self appreciation journey. 💜 Hope you have a reviving break", "christina_piening": "Hurt people hurt people. Just keep doing your thing!", "kattss02": "Your altruism, care and concern for others and creating a place for true connections outweighs all the crap online. It’s a better place with people like you in it. 💕", "gilllyyyyy": "@curvysam that’s really shit and not okay. You really do touch people’s lives in a positive way each day but that comes at a cost because to touch others as you do also means giving so much of yourself. None of what you’re talking about is okay, yes you’re right, it ONLY says so so much about them but you need to make sure you take time to care for yourself. We’ll all be here waiting to cheer you on. 💕", "cfocken": "Oh I love your posts. So sorry that some people are simply shitty...", "lcost73": "@curvysam so sorry to hear this ... your voice and everything you stand for is much needed and valued! I hope some time away heals and those suckers get bored and move on! You shine gorgeous lady and it’s infectious ❤️❤️", "caf_fein_ated": "You are amazing and be true to you. Haters gonna hate and one thing I have learnt recently is that those who say negative comments to tear down other are jealous of what those other have achieved. You make a difference to so many women and keep being you. 💜💜", "misstann73": "I’m sorry you have to deal with this. Take some time for yourself but know that you have many people who do think you’re inspiring and love following you 💕", "knwj": "I don't usually write anything but felt the need to say I'm appalled that people have been treating you this way. You are an inspiration and from afar I truly appreciated my grid having such a wonderful person on to make me feel worthy. Thanks for all you do and keep being you as you help women to feel empowered xx", "sassy_sarahjane1981": "Sam, I only discovered you very recently, and I can say, from my little piece of the UK that you are one beautiful, inspiring lady, don’t let the haters get to you, it is only because you are such a beautiful person in every way, and they are quite simply jealous!! Sending lots and lots of love xxx", "supertonia24": "Sending much love to you, do what you need, rest, take care.. just know you are an inspiration to many xx ❤️", "kimbeeau": "Hey Sam, I think you are great. That’s all ❤️", "thepiquantfox": "I'm so glad you've taken a step back, to have some space from places that can be toxic even if they also hold very positive and supportive people. Give yourself a chance to recharge xxoo Thank you for all you do 💗💗💗💗", "nellywadeaustralia": "Oh no 😥 People can be so cruel and hurtful and it's so sad. More often than not it's their own insecurities and jealousy. That's no excuse for bad behaviour but is mainly the cause. They deserve your pity but not your time. Your doing amazing things. Keep going and don't step back! Do your hair toss, check your nails - baby how ya feelin'? GOOD AS HELL! 😂😍🤗", "bfield88": "❤️", "kodiejs": "I only got the chance to meet you once but you brightened my day 🌟 keep doing you boo, there will always be negative people hating on those doing amazing 💕", "hannahbobbybrady": "Sorry this has happened, you’re an absolute inspiration to me and so many! Don’t let this get you down, people can be nasty pasties 🖤❤️🙌💪💪💪", "kellylcaldwell": "We love you..all of the support above shows what a difference you make. Its very easy to say ignore it but i know its just not that easy. Take whatever time you need. Just know there will be a group of like minded women here for you when you choose to return..we love you", "grahamnjoy": "Keep on just being you best medicine ever moving right along ignore the Narcissist 😍😘😘", "helbrad16": "Sorry this has happened to you, but also not every 9 to 5 job is shitty. I actually enjoy mine.", "twotravellingplanners": "So not ok to target someone like this! Take your time for you. The amazingly supportive community you have built will be here when you are ready to return. Take care xx", "reegordo": "Sam, I am sorry to read about all the negativity that has been thrown at you. I 💛 reading your inspirational feeds. Haters are always going to hate, I think they are jealous of all the 💛 shown towards you. Don't change for these people, keeping being your lovely self. Take care 💛", "bodymindspiritfukit": "This makes me so sad. There had been so much hate and negativity lately to so many amazing women and the worst part is that it’s coming from other women", "wellingtondany": "I love your account and how vulnerable and honest you are, and how tireless you work for the community (and the animals!). How sad when some people feel they need to get higher by standing on the backs of others. How sad they must be inside. You’re amazing 🦄", "arise.with.jessica.halvorsen": "Sending love❤️", "lausie_jayne": "❤️", "roccismit": "Don’t listen to any of these people or pay attention to anything that they do. They’re going to get karma and don’t deserve you or your attention xx stay fabulous", "kaleenas_life": "You’ve definitely made me more confident and stop hiding behind the camera. You’ve made me realise that being big isn’t a reason to not enjoy life. So thank you for what you do! Please don’t stop!!!", "becfez": "I’m so sorry this happening to you! You truly have helped so many of us to have more confidence in who we are! This person has trauma they haven’t dealt with and is hurting and lashing out to hurt you. However it’s important to remember that is not your responsibility and not yours to own. We are all in charge of how we treat others and how we behave. We don’t always get it right but we should be responsible for dealing with our own stuff not taking it out on others! Thank you for continually being real and raw. Hope you get through this one with the support of your tribe! x", "jem.mccann": "I think your amazing. I love watching your stories and can relate to everything!! Sorry to hear that you are experiencing this. Stay true to you, be protective and go to bed at night knowing you are touching peoples lives in all the best ways 💖", "somethingalittlesweet_": "Sending you a big hug @curvysam sometimes we have to stop and remember they are the actions of others and as you said yourself it's a perfect reflection of them NOT YOU. It still hurts and BULLYING IS NOT OKAY. As I often say 'put on your big girl pants, straighten your crown and be the bigger person' I love your posts ❤️", "alana_odea": "Sam that's awful! You're right, these actions say allot about a person. Please don't take it to heart (easier said then done), and please know that we appreciate EVERYTHING you so for the curvy community x", "kerryn_69": "Sending hugs, you are a wonderful genuine caring person 💕", "jessiebell_k": "I wasn't able to attend the evening, but I was following the progress from afar. The highs and the lows, cheering you on. When I think about the event you put on, I remember you, getting back up again after the set back with the venue. It would've been so easy for you to give up, but you didn't, for other people's sake and happiness. I remember seeing your posts about the spotlight runs and making the decorations with your friends and families help etc. That is so heartfelt and genuine and speaks so highly of who you are. I hope your step back is restful and enjoyable, sweet lady xx", "jessica.finn.9": "Sorry to hear that you’re going through a tough time at the moment. You are amazing and inspirational both online and in real life. Sending love and hugs your way ❤️❤️", "86malina": "@curvysam so sorry to read this! But remember would they say it to your face? I’m sure if you confronted them they’d run for the hills. Take care xxx", "tinacrack": "You do you lovely! You are fun and inspiring and Making a difference for all women. X", "nochubchels": "Sending love 💗 I’m so sorry to hear that these shitty things have been happening to you. Absolutely no one deserves this.", "kyliep82": "Don’t let the haters win babe, I am new to this blogger thing, and I look to beautiful women like yourself for inspiration and support. For every 1 nasty little nome!!! There are 100 gals that have your back 🥰😘", "realmumstyle": "Sam this is so much to carry. You have done such an amazing job of bringing together a community and I am so proud to be part of that.", "tarynkjames": "Much love to you @curvysam keyboard warriors are the worst and make my blood boil - so sorry you’ve had to endure ❤️", "lizaj71": "I'm sorry you're dealing with this negative garbage I truly am, you're an inspiration and I LOVE that you keep it real, raw and honest and I hope you never change because you're YOU and that's just perfect because you are you!!! My inbox is always open if you need someone to just talk too or vent too, I don't judge and I'm a good listener so the options there 💖", "womanofstyleandsubstance": "Holy crap. What the F is wrong with people? Obviously, they are jealous, feel threatened or have issues themselves to want to do shitty things like that. Keep being you, Sam. You're awesome and we love you x", "bridgetalicehope": "Take the time to be the wonderful, brave and beautiful we all know you are. You are so incredible and I’m so grateful for the things you do for me without even realising it. You’re true friends and family will all be here when you are well enough to come back. Until then just look after you. You are so loved. Never forget that.", "bellagirlsjoy": "There are non genuine people everywhere. The worst kind are the ones who pretend to be regular humans , and your friends, when really they are lizards in people clothes. They are sadly places you never thought you’d find them. Sending support and care to you and hoping you can step back long enough to heal some of your pain ❤", "beautifullyfkedup": "@curvysam people are arseholes. There actions say so much about themselves but it’s bullshit that what they do and what they say can be so hurtful to someone else, someone like you who does so much for this community 😞 Take a step back, spend some time with people you love, people who make you smile and laugh and get you for you and when you’re ready, we will all be here waiting for you x ❤", "newstylechapters": "You are strong Sam and a go getter. When lots of others just watch the world go by and still miss it, you instead are living life for yourself and thinking of others, always. You have brought this fabulous community together and you can see so many are grateful. We are all stepping outside of our comfort zones because of you. We are all living life more because of you. Ignore the trolls, delete and move on. Sending a big one of my hugs 🤗 🤗🤗🤗🤗🤗🤗", "baby_got_shade": "I’m so sorry you’re being treated like that. I genuinely had no idea people were that shitty. I also never understand people who follow and comment on people they don’t like! No life I guess. I hope the bad karma train hits these kinds with full force. I love what you do. 😘😘😘", "hayleyy_j": "Someone people just constantly project when really they need to take a good hard look at themselves! It’s not okay what you’re dealing with and going through, but I do hope that you do rise above them and not let them bring you down! 🙌🏻 #youdoyou", "eanewby18": "So sorry Sam. Don't let them get you down. Thankful for you!", "mumof4plusmore": "Please don't let them get you down. We are all here for you.", "kylie510": "I am sorry to hear this and hope that you are ok xx❤️💙", "angie_dp83": "I am sorry for all the bad and negative which has come your way. No one deserves to be treated like this. Keep going on Sam! You rock and you are perfect the way you are!", "trishma": "Sending big love 💕", "charleycostin": "You got this beautiful women 💕💕💕", "karenmary1971": "That just makes me sad someone would treat you like that. So sorry people are such arses!!!"}