{"lcost73": "As Carrie Bradshaw once said “The fact is, sometimes it's hard to walk in a single woman's shoes. That's why we need really special ones now and then to make the walk a little more fun.\" Time to buy some more shoes @curvysam ❤️", "kirstenkitten": "I have been on the fence about buying this dress in this print but this post has convinced me 😍", "dmazik": "Too bad about the shoes! But...you look beautiful in that dress!!", "shondy2000": "That’s a fantastic dress! Looks great!", "tanwool": "Hehehe. Nothing like a good giggle but seriously what are the odds lol. 😂😂💋", "stylepluscurves": "Hahahahaha oh no! Sorry hon!!!", "realmumstyle": "Looking fabulous lady! That belt looks incredible with that dress.", "allaboutsalon": "Amazing 💚", "jihanamer": "You’re just the cutest!! This happened to me in a date once ha ha", "howdystrangers": "What size are you wearing in this dress?", "lizzionicole": "World says it's perfect time to walk barefoot 😘", "littlepartydress": "Damn fine!! Lovely to meet you super quickly babe!! 💋💋", "atthatagenow": "Such a pretty dress", "zuska45": "Oh no about the shoes!! 😩👠 Beautiful dress though! 😃👌👗", "drselinalim": "Looking great and love the colours! Good to connect back with nature- enjoy your walk!", "justaddvodka": "😍", "wingsoffennec": "Oh no!! But you are still so pretty and your dress!! 😍❤", "carbie_2_barbiee": "Not gonna lie this had me in fits hahahahaha I feel like this would happen to me 😂😂😂😂", "kikibibo": "Miss your posts!", "kiikluxe": "Oh no! 😲 But you look cute 💕💕", "honeypositano": "Hahahaha, BOTH? My lord, that would happen to me 😂", "dinjuan": "❤️🌈", "floresdecoloresnm": "Love it! You look fab!💕", "willowcurves": "Oh no 🤦🏼‍♀️ that’s the worst!!!", "leannezimmermann": "Don’t you hate that 🙀", "kash_syd": "❤️❤️❤️", "thenourishednocturne": "My shoes did this when I was going home after the pool party! 🤣", "lausie_jayne": "Love the dress!! 😍", "72pauline7272": "RIP shoes 💔 😭👠", "bht_khan123": "Sooooooooo beautifull princess", "teeny____": "So happy to see you posting and that dress is fab! I was going to buy one but am unsure about the length.", "kel4stan": "Holy hell they literally fell apart!", "hopes89": "This happened to me walking on James st on my break last week, didn’t have a spare pair at work so ended up at Wittner, $60 later...it was an expensive street to lose my shoes on hahahaha", "sezzaruberto": "@lady_sarahja85_ and you thought you had problems today 😂 a double blow out 😳😳😳", "cjrobbo": "Haha, funny! I love these shoes! I had the Miss Shop version and the toe strap snapped like yours when I was out drinking one night. So grateful for the boys behind the bar and some handy sticky tape work 😂😂😂 Probably wouldn’t do the trick for yours though!", "estelleclothing": "Oh no! 🙈 at least you are still smiling! ☺️", "lizaj71": "I bought the @littlepartydress in the same print you're wearing Sam but in the maxi style 😊such a fun and colourful dress 😁loving the blonde too sweetheart 😘", "paularovingstyle": "Both shoes!? What are the odds 😒😩 hope you had a nice lunch at least", "hardly_em": "Beautiful dress!!", "theswiseone": "I had those shoes they were great!", "therealqweenb": "@curvysam exact same thing happened to me at my work Xmas party last year... luv it + luv u! ✌🏼❤️", "wickerdarling": "HAHAHA", "newstylechapters": "Oh dear not a good advert for Target haha but good excuse to buy some new shoes 🤭👠", "jensstid": "😂💜", "bnt_puppies": "Is that the Charlotte dress?", "miss.hellpixie": "Jeepers, they didn’t just break, they completely fell apart!!!"}