{"get_it_staat": "Hope your recovery is fast. Rest up and heal ❤️", "life.as.m": "Life will be so much better for you now!!", "carolynsdivas": "❤️", "sogwladys": "Get well soon Sami 💕", "thekorbie": "Getting mine out 5 years ago was the best decision. Much like you I lived in fear from eating foods that I loved. I'm much more happier now.", "glamazondiaries": "Glad you’re on the up and up. Feel better", "stormy122973": "Hang in there! Feel better soon and glad you got the surgery you needed. Stay curvy, love. ❤️", "brookie_aandz": "Wishing you a speedy recovery @curvysam xx", "msduckydeluxe": "Glad you are back lovely and that your surgery went well.", "flex.mami\nVerified": "Verified", "g8iff": "I truly wish you well, Sam.", "jessie_stokess": "I had mine removed lol 3 months ago!!", "hairromance": "Take care Sam and hope you’re feeling better soon! ❤️", "kimsimmo85": "Get better soon 💜", "alanawimmer": "💜💜💜", "michellemariebarker": "wishing you a speedy recovery!", "lovestylecoau": "Oh hun that sucks, glad your on the mend. I had mine out at 18! Same as my 2 cousins at the exact same age. Not fun at all .x", "honeypositano": "Super glad you had it done, it only gets worse if you don't! I had such complications with my gallbladder. It actually burst/perforated and shot gallstones into the neck of my pancreas, my pancreas got infected and started to die. Long story short, I died twice, had a lot of operations and only have 2/3 of a pancreas but - I'm here. I'm alive. Surgery is scary but there are worse things than a few lil scars (and the pain of recovery is less than the pain of keeping your gallbladder there when it gets to that point) Wishing you a speedy recovery. Hospital socks were lookin stylish 🤪😂", "nikiduhhh": "Hope you have a speedy recovery im getting mine taken out next month", "curvygirldc": "Hope you’re finally feeling better, Sam! 💖 I know this has been a long time coming but it’s for the best and you will begin to feel even more amazing as you heal. Much love my fellow curvy gal pal! 💓💓 Xx", "becnherboys": "Rest up and get better. I had mine out at 23 after getting an attack on a flight from London to Singapore 🤦🏼‍♀️Once you recover it should be smooth sailing!", "luxeandlemonade": "Wishing you the speediest of recoveries beautiful ❤️❤️❤️", "kellee_merriman": "Just saw your stories and you need someone to get you a claw to help pick the things up off the floor. Sorry no claw emoji 😐", "leanne_erbs": "Onwards and upwards now the beastly gall bladder has gone. You will be feeling like a new woman in no time.", "jesswillowtree": "I had mine out in March this year. 🙌🏻", "becizzle_": "It’s crazy how many people get their gall bladder removed! Just one of those organs we don’t use this day and age I guess. I had mine out at 19. Took me about 2 weeks to recover and I was able to eat exactly the same. I did one though get phantom pain after eating salami, but that’s probably one of the fattiest things to eat lol. Glad you finally got it out, and Merry Christmas! Xx", "tracyene": "💙💜💕💜💙", "hh99882": "Nice", "sammie_js": "Best thing I ever did getting my gallbladder out. 1 attack was more than enough - never want to feel that pin again.", "fridayiminlovexo": "Hope you feel better now sweetheart. Take care! Big hugs 😘😘💕💕💕💕", "miacaracara": "Speedy recovery!", "veronica.and.family": "I had mine out earlier in the year. It gets better eventually (well mostly some foods will always never sit right again)", "cptn.megatron": "We have matching scars now 🙌😂", "iversen.stine": "Get well soon. Don’t let the haters get you down, they don’t deserve that win. You are worth so much more then that. I love to follow you, and thank you, for letting us shares you journi in life🤩Merry christmas from Denmark🎄", "sarahgoodier": "I had mine out in September after a gallstone blocked my liver duct and essentially made me jaundiced. Best decision I (well, my body) ever made. I feel so much better now. Sending you lots of love and fast healing. ❤️❤️❤️", "thelittlespook": "The worst part of gallbladder removal surgery is the trapped gas in the shoulder region. Who can relate? 😂", "stylingyou\nVerified": "Verified", "yonniestengelsmith": "I had my gallbladder removed and just last week my hubby had a bad attack and had to have his removed!!! I guess it's a common thing.", "misspattydifusa": "Get well soon beautiful x", "thesimpleglamazon": "I've been there....i had mine removed at 25....glad to hear you'll feel better!", "misstohii": "Im in the wait list to have mine done and I am so petrified! Thanks for sharing your journey, def put me at ease a bit 😊😘", "mrsmackie71": "You’ll feel sooooo much better now!", "collection.of.my.adventures": "Wishing you a speedy recovery 💕", "marzy_37": "Hope you're feeling better soon!! Glad to see you back.", "echorne89": "❤️❤️", "smtce05": "I’ve been in your shoes. 5 ambo visits to hospital That was 15 years ago now and so grateful it changed my life. You’re brave beyond words as I know how scared I was. It’s over and now only good times ahead! Well done 👏👏👏💓", "dixie_uk": "Wishing you a speedy recovery 💕xx", "jacintalice": "@amyamz01", "72pauline7272": "Good to see you on the mend Sam. Sending you love for a quick recovery 😘😘😘", "plusjones\nVerified": "Verified", "___joal___": "Yay!! Life will be so much better, babe!!! My sister got hers out and is soooo much better. The worst is over 💕💕", "teazhair_": "Hope your recovering well! I had mine out also 2 weeks ago! ❤️🙌", "cherie299": "So glad you finally got it out!! You should feel much better in a matter of days, and nothing is better than knowing you will NEVER have that pain again!!! Best Christmas gift you will ever get x take care hun ❤️❤️", "nerdinista": "Scary! Get well soon! ❤️", "thedavens": "Yup.. Had it done in '97. I'm glad you are recovering now. Those attacks are awful. ❤️", "birdsnestonline": "♥️", "misstann73": "Glad you’re on the other side of it now. Take care and rest up while you recover x", "louisetaylor48": "Oh my god! So I saw your stories but because I’m technically inept I didn’t know how to ask what you had done. Poor thing! I’m so sorry I didn’t send a cheerio. So glad you’re recovering well. My gall bladder is fine but I have a pesky bowel so kinda feel your pain with abdo surgery (I had a bowel resection 3 yrs ago). Take it easy, it’s boring as batshit but it’s important. Good luck and keep pudding on a happy face! 😊", "annelisekate__": "Wishing you the best recovery babe. Glad this journey is almost over and that you’re back online 💗💗💗", "theannoyedthyroid": "It’s great to see you back. I hope the cheering of your faithful followers will drown out that terrible troll. The only way is up! 👊🏻", "reckless_abandon_boutique": "Good stuff! Glad you’re on the mend! Forget about stupid trolls, those sad people w no life trying to bring others down because they’re in pain. They are to be pitied. Haha anaesthetic drunk 🥴 Now I’m off to google what a gall bladder attack feels like!", "flower_power408": "Omg girl! Wishing you a speedy recovery! ❤️", "kat_louise25": "So happy you finally got the surgery! Wishing you a speedy recovery X", "vic15star": "Hoping you have a speedy recovery and only fanfuckingtabulous things come your way from now on xx", "gillalin": "Purple looks good on you👌🏽", "renaekelly01": "I feel for you as it’s no fun, & no-one tells you exactly how hard it’s going to be to do the ‘normal things’ afterwards. I’m so glad your friends are helping you out though as you need it. I hope you recover well xx", "mrs_southam": "I had mine out about 3 weeks before Christmas in 2010. I remember the nurses gave me some pre op medication to just help me relax, when the surgeon came in to see me before surgery I couldn’t stop laughing at anything he said and just everything in general. The medication certainly did it’s job ha ha. Not the nicest of ops. Having the drain removed feels gross! Glad you are recovering well and feeling better.", "_the_buzz_amy": "Firstly, glad the surgery is over!! Every day will be better than the last, as long as you don’t do too much!!", "mummasol": "I went through this a few years ago and I'm sure everyone is telling you, it will take a while to get use to foods... something that I wasn't prepared for was the toll this adjustment period took on my skin, as you know your liver now takes over the digesting of fats etc that your gall bladder did, well all of those excess fats and toxins seemed to come out on my face and I broke out in the worst pimples/acne that I had ever had... thankfully this only lasted 6-8 months or so but seriously be prepared!", "juliettekk": "What brand is your crop top/bra?? Hope you recover soon x", "lesty17": "This shit thing nearly killed me , I had 50 stones and it made my body toxic , best thing was for me to get the damn thing out by emergency after my infected insides healed . Useless organ it is !!!", "lauren.a.hughes": "Glad you are on the mend ❤️❤️❤️", "peggieleary": "Beautifully said . Take care and merry Christmas 🎄", "ronnieproctor64": "So happy to hear your on the mend, looking forward to all your new stories and posts in the future, Merry Christmas 🎄🥰xox", "tenelle88": "I got mine out too. It was so far gone it had caused pancreatitis and early liver failure. They're completely useless and cause nothing but trouble! Now you can live your life without worrying about that horrendous pain an attack brings!", "sophieshepp": "Glad you’re on the mend! My cousin posted a quote the other day that I loved - ‘only the weak are cruel, gentleness and kindness can only be expected from the strong’. ✨ so keep strong GF, & bring on 2020!", "teeny____": "I like seeing you around!", "leanne_crouch": "Great to see that you’re doing well post surgery 🌸. It’s only upwards (and no attacks) from here 👏👏👏", "duplessisme": "Get well soon , you won’t be sorry had mine removed nearly 5 years now and not a single days complaints", "meag.mac": "So glad you’re back, you were missed 😘", "melbeegee": "So happy for you that that dam thing is gone! A lot less pain gone, thank goodness!! ♥️♥️♥️♥️", "pita_norris": "So glad you are through the worst and on the mend. Merry Christmas and all the best for 2020!", "natellapip": "So good to hear that you finally got the surgery you needed and are feeling so much better. I know I’ve missed your bright, cheery, interesting and always funny posts oh and the fashion.", "jesssizzzi": "So glad to see you got it out! I remember when I had attacks- was on morphine every time until they took it out, what a relief! So nice to see you back, f**k the trolls, the people that support you far outweigh the bad peeps! Rest up and I hope your recovery goes well xx", "my_shopping_dreams": "So glad to read this", "geeyourebrave": "So glad that you managed to get the surgery. I had my gallbladder surgery when my daughter was 3 months old and honestly once the pain posy surgery settled down I felt Soo much better. You won't know yourself pain free in 2020", "gentle.bliss": "So relieved you finally had your GB removed. Great to have you back on the ‘gram too. Xx", "lcost73": "Back where you belong... ahhh get better soon we bloody missed you!!! 😘💖💖", "courts_40": "💕❤️", "ros.devenish": "❤️", "lizaj71": "Sending you continuous healing light sweetheart and glad you're back too 💖p.s please ohhh pretty please watch what you eat over Christmas cos oohhhh your tummy and liver will NOT like you if you eat anything overly creamy and fried and spicy and welllllllll fatty basically 🤷‍♀️but if you're like me you'll do it anyway lol 😂 been years since i had mine and part of my liver removed (my gall bladder was that bad) and I still pay for eating what I know I shouldn't 🙄😬🤣", "imogen_martyn": "Oo hun! I had my appendix out in September. Almost Same battle wounds !! Hope you heal up nicely and you never need to worry about that little bugger again .. it’s gone!", "kayjay5": "So glad you’re feeling better Sam! Enjoy your Christmas xx", "jaydemelissah": "This warms my heart! Thinking of you down here in Melbs. 😘", "joeyterror": "I had it removed last year, I have a lot of friends who have't got a gallbladder anymore. I feel so much better now and the recovery was a bit slow, but I got to eat normal in a few weeks. Got some pretty scars now and I certainly don't miss the attacks! Hope you feel better! Best wishes!", "ansandfinnian": "💗xox", "hey_its_nance": "Glad you finally got that thing out. Your life will be much easier now! 👌🏼", "beautifullyfkedup": "@curvysam I’m SO glad you managed to get the surgery done before Christmas so you can start 2020 afresh (and hopefully not in pain 🤞🏻). I’m sorry to hear about the trolls, gosh people can be arseholes BUT I’m glad that you’ve seen how loved and supported you are by the good people who follow you and also those who know you in real life xxx ❤", "auntemerald": "Look after yourself Sam! Don’t you love the stylish stockings! ❤", "wickerdarling": "This is wonderful, so lovely to hear!", "immabeemlb": "I also just had mine out about 2 weeks ago. Hope you are healing fast and well.", "ritamycyk": "❤️", "caf_fein_ated": "Glad you are back and healing. Surgery is never fun but onward and upward health and wellness wise for 2020!", "penelopelatts": "Well said. So glad u r back. Merry Christmas to you. 💕", "mustangsallytwo": "So glad you had it and everything turned out well. There’s always a silver lining and we love you 💕", "treenie_jane": "Welcome back and wishing you a speedy recovery 💜", "livedexperiencecounsellor": "I got mine out a few months ago! I'm so glad I did. I hope recovery is going smoothly for you! 💕"}