{"lovelyinla": "I love @tangleteezer @tangleteezerus 🙌🏻", "the_carlie_story": "Silk pillow case (not saturn) You can also get silk turbans to wear for bed etc, silk hair ties. You’ll thank me later.", "hannahmwrightx": "@curvysam L’Oréal extraordinary oil, just as good as kerastase elixir. Used it for years !", "missmeggie92": "Function of beauty! Best decision I ever made", "bodymindspiritfukit": "Satin pillow cases will help heaps with knots and frizz at night", "anuradha2.0": "Coconut oil 45 mins prior to hair mask", "pr1ncesschelsea": "And a Wet Brush - swear by the combo!", "thedavens": "Satin pillowcase?", "mumma_to_our_five_tribe": "@curvysam we buy the detangler from Aldi. It's a purple bottle ( for kids ) but works a treat. I have hectic wavy thick hair and I'm thr same I hate brushing but a couple of sprays and she's good to go :)", "janalyngilbert": "You could always try combing it in the shower once you've applied conditioner! I haven't brushed my hair since I was like, 11 haha", "lawlessleggings": "Don't brush it 😂😂😂 Haven't brushed mine in a long time but that's curly hair. @aylarose2k17 Got me onto the assume hairbrush that doesn't hurt to detangle my daughter's hair! 😍", "vicky198": "Coconut oil would definitely help.", "lauzylee": "I have blonde hair down to my butt and the best products I’ve found are the Nak range - i think I bought a pack for $50 which had shampoo, conditioner and a mask.", "mysoulfinity": "Elevens miracle hair treatment!", "chrissiegirl02": "Hi Sam. Hope you are feeling better by the hour now. Are your Grandparents from Liverpool UK?", "lovestylecoau": "When mine gets bad i use a lot of argan oil every night 😄", "hom_.i": "Merry Christmas 🤗😊🙂", "dyane_michelle": "Wet brush", "missbaines__": "Braid it!", "rudziutki3771": "Such a lovely pic.", "bosscurl.co": "We think a Curl kit would help 😍 it helps to detox your hair from thr nasties and also create a beautiful Curl x", "rebelliousgrace_bne": "😂😂😍😍", "theswiseone": "Also only ever comb in the shower while your conditioner is one with a wide tooth comb. Don’t brush wet! Using a old soft T-shirt instead of towel when drying is also good. I used to somewhere wear my hair in plaits if I washed before bed. Or in a top knot or high pony (pineappling) which also helps to prevent breakage at the crown. Don’t use coconut oil. It can’t actually penetrate the hair shaft so doesn’t actually do anything.", "realmumstyle": "Get a happy hair brush. I hate brushing mine too and this brush is amazing.", "sallylmatthews": "I would also recommend the @happyhairbrush I recently got one and would not use any other brush now. Have just purchased some for my nieces for Christmas.", "susannedawsonotto": "I find smoothing conditioner through my dry hair 10 or 15 minutes BEFORE shampooing helps settle it. Rinse, then shampoo and condition as usual. 💜💜💜", "madalingiorgetta\nVerified": "Verified", "emjh55": "I sleep with a satin bonnet to keep straight/frizz free/knot free xx", "ccatherine_collins": "Juuce smooth enz is what I use on my hair after every wash and condition. Helps comb it out much easier - I use a good@sized blob!", "nicolemountney_x": "@curvysam try these brushes by @happyhairbrush", "mrs.davidson_": "@curvysam “It’s a 10” after you shower!", "_itspoppie": "I've had terribly knotty hair my whole life, like I'd practically get dread locks just from one night of sleeping with my hair down. The only thing that I've found that stops me angry crying when trying to brush the birdsnest is using the purple Lady Jayne detangling brush, the flexi one. I've tried so many products and brushes but nothing besides this works as well and as painlessly. It seems to be improving my hair quality too? Super cheap and I think most chemists have them too!", "elizabethabull": "John Frieda Frizz Ease Miraculous Recovery Repairing Conditioner! It’s amazing on my hair with the same problem.", "dannideamyand86": "Coconut oil is a great hair treatment for budget, and I always sleep with my hair braided or plaited to stop the Frizz and knots , also a good hair de tangler is always handy to have in the cupboard along with a hair detangler brush", "d_lish74": "Try the Happy Hairbrush $39 but worth every cent 👌", "staceely": "Not sure what available in AU but Ouai products are amazing, its a 10 leave in spray works like a miracle. Nexxus keratin shampoo and cond is like hair rehab", "bel_chalks": "I would highly recommend not using coconut oil unless you speak to your hairdresser first! You don’t want a build up that then when they colour your hair makes it harder for them to achieve your desired colour! And if you think about how coconut oil sits on your skin when rinsed under water, it’s doesn’t come off. then that’s exactly how it will be in your hair.. building up. Blondes worst enemy. Most great salon products will be some what water soluble which is why they cost more. Invest in some miracle hair treatment from @elevenaustralia its only $24.95 and is literally what it says!! It will make the world of difference. It’s an Australian owned salon only product but totally budget friendly.. most things in Priceline will cost just as much!! Definitely get some!!", "carbie_2_barbiee": "Honestly @foxitribe bamboo brush is amazing not going to lie it’s not a product but I’m obsessed", "jjdeets": "Yup I remember this after my surgery 😂", "starsontheboulevard": "Use two pillows, the one on the bottom should be wrapped in a regular case. Use a satin case on the top, and you should be slip free!", "stockingriot_": "Brush your hair when in shower and full of conditioner! Will tear less and also mean less frizz long term because less breakage. I also wrap my wet hair in a t-shirt as towel is said to be more rough", "alycia_e_": "When I went from my natural dark brown to platinum, the only thing that saved my hair was a mix of coconut oil, olive oil, and an egg. Put it on and leave it as long as possible, then shampoo it out and condition as usual. You can also use mayonnaise, avocado, and banana in this mix if you have some around.", "g8iff": "What an absolutely gorgeous picture.", "lizaj71": "Just posted the same on Facebook hun but spray in conditioner if you can find some or alternatively use whatever conditioner you have and mix it one part conditioner to two parts water (hot or warm water mixes it better) in a spray bottle and leaves in 😊😘", "lauren_bll": "Another vote for @happyhairbrush 🙌 my toddler has super fine hair that is in literal dreadlocks every morning and brushing it out is so much less traumatic now (for both of us). I don't even understand how it works but it just.. does", "elite_amber": "@happyhairbrush - I have seen some good things about this brush... Maybe give this a go to rid ur hair of tangles? 🤗", "m_kaleta": "Try tons of conditioner in the shower and a wide tooth comb. I comb it out in the shower with conditioner in. That helps", "hm538": "My.organics goji angel potion - $15 at chemist warehouse and it’s amazing !", "givernyh": "Smooth and groom from just cuts:) and silk pillow case saves blonde hair", "dessiebean": "Honestly, I braid the hell out of my curly hair, or put it up in a high bun if I'm lying down. Saves the headache of brushing it!", "antoranthony": "CPR Fortify leave in moisturiser, not heavy and goes along way. Still use it now even though I’m not blonde anymore.", "jenwoollard": "I love my tangle teaser and a silke head wrap may help if your silk pillow case isn’t?", "melaniemctighe": "When I was blonde mine tangled badly. I used to put it in plaits for bed", "miranda.ocarroll": "I second @happyhairbrush , best brush ever!", "teags1186": "Coconut Oil is the only thing that helps my blonde frizzy, curly, tangled hair.", "integralady05": "Garnier papaya hair mask. It’s the best. Coles sells them 💋", "allthingsjanelle": "Can you try just a kids hair detangler spray", "thelittlespook": "Have you tried a silk pillowcase? I hear those are great for reducing frizz and tangles", "jodi2682": "I have platinum bleach blonde hair and I never brush it, ever! I lather my hair in coconut oil twice a week and leave it in overnight and that keeps it smooth and tangle free. I have really fine hair though..", "daaani7": "Olivia garden wet brush!!! Swear by it", "aussie_barbie": "Coconut oil", "brittfowler93": "as a fellow bottle blonde I feel your pain! I find that my hair is easier to mange if I keep it in a high bun when I lay down. I also have a tangle teaser that is amazing for getting out tangles. Since I got that I find I don’t get massive tangles"}