{"renaestephens83": "Stunning 💓", "katebreakingfree": "I have just bought a bikini! First one in maybe 15 years. It hasn’t arrived yet but I’m nervous. My belly is very soft and wobbly and oddly shaped.", "heavenlycurvesau": "😍beautiful @curvysam..", "tazy_smurf": "I started wearing a (super) cute bikini at the start of the year and I absolutely love the positive vibes I feel. I’m so high on these vibes that when I can clearly see/ hear people making negative comments or laughing, I smile and think about the fact that they are so concerned with a complete stranger and what they are wearing. I smile and stand tall and confident and don’t let it get to me. It actually fuels me to continue to wear it, I mean besides the fact that I love it.", "miss_nadia_loves": "I never wore swimmers when I was 60kg because I was so self conscious.... I’m now plus size & I totally bust out my bikini 👙 🙌🏻❤️", "beautifulimages.photography": "You are beautiful ❤️ and this message is everything 🙌🏼🤘🏼 thank you ❤️", "jennifer__au": "good on you 💕 I love that you’re challenging things and that in reality we are just like you too ⭐️", "home_with_chellebelle": "Gorgeous 💟", "melbeegee": "I’ll try girl, I’ll try! Just watched stories, and I love the black look! Haha, Beetlejuice is a fave of mine as well!! 😂🙌👌", "elwio76": "You look amazing", "johanna__viktoria": "Amazing picture 😍 you should frame it", "confessions_of_a_gcup": "I absolutely adore this!", "a_knights_creations": "Never :-( not even as a child as was always “the big girl”", "tam75tazz": "Never. Though I did buy a swim bra to wear under my rashie", "ellennyswim": "Go you 😘😘😘", "bobby_da_funk": "Beautiful photo", "travellingmacs": "Wore mine in Hawaii . How I see it is I don’t dress to appease others. I’m not asking them to be watching me. If they don’t like what they see , avert their eyes.", "plus.ppl": "You are so #beautiful and #amazing, keep spreading #selfconfidence and #selflove. 😍 You are a great example of our amazing community #PlusPPL. Go on like that. 🔥 #YouArePlus 💜 🙏Please join and Follow us to help empower women all over the world⚡ ➕❤ #YouArePlus ➕!😊", "emierate_": "I've deleted the previous post, really I'm sorry", "victoria.l.and": "🙌🏻", "daniellecatherinejohnson": "Yes yes, 100000% yes!! ❤️❤️❤️", "tenelle88": "Never", "amysheppardpie\nVerified": "Verified", "dan_yell.b": "You look gorgeous", "erikathecurvyfashionista": "Never 😩 sad to say but even when I was a size 12 pre kids I thought I was “too big” now as a size 18 mother of 3 with stretch marks, an apron and thicker than a snicker it’s even more nerve racking! But I’ll get there eventually especially with brave women like you paving the way 👏", "thisismeagankerr": "I’ve become super comfortable in swimwear because at the end of the day, who is missing out if I don’t swim, or won’t go to the beach? I am. My kid is. My family is. Not some random Karen having a judgey stare. Myself and my fam enjoying our time at the beach is way more important than the idea that someone else might have an opinion of me 🤷🏽‍♀️", "anurturingdrop": "Never worn a bikini in my life but I love seeing women of all sizes wearing them with such confidence and really enjoying themselves!", "throughshadowtotheedgeofnight": "Lookin bangin girl! 🤩", "thekmartlover": "I rock my bikini and my scars and lumps and bumps with pride now. I never used to. I love my body. And you my friend are sexy and beautiful", "caatherinehq": "Love this", "stace_63": "@curvysam ❤️❤️ have a body wear a bikini 👙... there you go a bikini body !! Tell my beautiful daughter everyday ❤️", "lajoieskin": "Love ya @curvysam ♥️", "mandyhar73": "I just wouldn’t but more power to you 🙌🙌🙌 I don’t think I’ve ever worn one and no real desire to. Each to their own huh.", "my.adventures.in.bopo": "Love my bikini! I learnt a very important swimwear tip a couple of years back: How to get a bikini body? Put a bikini on your body. 💁🏻‍♀️", "maddylphillips": "💕💋", "blossomwithin.photography": "You look beautiful Sam! 💕 You definitely have inspired me!", "tanlounge_official": "😍💕🙌", "mademoisellestevie": "Gorgeous 🙌🏼", "jenniespitaleri": "Yes they are looking at other people", "lisas_sick_sad_world": "❤️❤️❤️❤️❤️❤️", "curvebridalboutique": "Never to be honest 😘😘", "auntemerald": "👏🏻👏🏻👏🏻", "bianca_carroll_": "🙌🏻❤️😘 You rock it!! Xx", "dionna_e_rob": "❤️❤️❤️❤️", "qualitylashesandbeauty": "Beautiful pic and beautiful message! Hear hear @curvysam 🙌❤️😘", "_lavi__love_": "👏🏽👏🏽 💯 I used to think ppl were staring at me but the honesty it was all in my head 🤦🏽‍♀️ you look fabulous in ur bikini 🔥", "c.porter___": "I have never worn a bikini out in public, in my life. I'm always covered with a baggy over sized shirt and shorts. I struggle so much with it, but this is my ultimate goal. One day.. 😍"}