{"adavobr": "Get a men’s seat for a cruiser bike on it, Makes it so much more comfy to ride it", "dandizzle1": "Such a stunning photo 💕 the back drop and you of course @curvysam 😍 I also feel super uncomfortable with my hair up. I like to hide behind my hair and feel really exposed when it’s up. I have it up at home or if I really need to concentrate doing notes at work lol To tell you truth you really suit the braids they are cute. Enjoy your bike 🚲", "allthingsjanelle": "Well done on the bike! I’m too chicken for a bike, car drivers are too stupid with bikes on the road. There are great paths out near Woody Point. Love the braids too, I have a round face too so feel ya there 😐", "rosietwyf": "Good on you! I really want to jump back on a bike. Maybe I will add that to my list and get looking for a bike. I hope you had fun, riding bikes should be fun like it was as a kid!", "aleishalangton": "Yep a different seat, or some nicks...padded pants", "megmagoo22": "Love this so much!! I havent ridden a bike in years and have been wanting to try it again. You should be bloody proud ❤️", "melgreen_": "Ooh girl I pray for ur ass bone tomorrow. I went for my first bike ride last weekend for the first time in years. Could not sit without a gasp the next day. Def need to find a bigger seat for next time.", "leannezimmermann": "GO GIRL 💪", "72pauline7272": "Omg I got on a bike for the first time in about 10 years over the weekend. By the bruises on my legs, it appears I forgot how to stop and dismount properly! 🤣🤣🤣", "neat5": "I bought a new bike a few weeks ago and love riding it so much!!! Hot tip on a better seat, I picked up one on eBay under $20 & 28cm wide ...heaps nicer on my butt!", "gentle.bliss": "Super cute!", "stuff.sam.makes": "Woohoo!!! I love all of this 💕 And I am super jealous of your braids!!! I LOVE them 😍", "kells_2401": "I’m super jelly that you’re allowed to drive places in QLD that we aren’t allowed to do in VIC!! Hopefully your bum isn’t too sore tomorrow 😝", "bodymindspiritfukit": "Hair looks super cute ❤️ also how weird is it riding a bike after ages? I started again and it’s so odd", "yippeesue": "Get some proper padded bike nicks- will make such a huge difference to how your ‘bits’ feel the day after! If that’s not in the budget grab a gel seat cover. I think you can even get them in kmart", "etn_africa": "Yessss Sam 🙌", "hannahbobbybrady": "I think the braids are super cute, now to find some braid tutorials on YouTube so I can copy the idea 😂 🔥👏", "sarahs_cwpconsultant": "Awesome! Might need to get myself a bike", "jamie_jetaime": "You are the cutest! And i agree there’s growth within the discomfort.", "alice.brandy20": "Suits you very nicely!", "corrinna.johns": "I have gone back to my bike for the same reasons, too busy on the streets to walk! My one tip is get padded shorts if you haven’t already!", "resting.pole.face": "Get the biggest cushiest seat for your bike. The stock standard ones are not made for us curvy girls.", "lovelyinla": "Love this shot of you 💜", "deltina84": "Love love love! I got a new bike today too, a vintage cruiser and we went for a 7.5km ride around home! So good! It takes a little getting use to being back on a bike but an it’s fun and freeing!", "katherinefeeney": "Yay bicycles 🚲", "nataliecartertalksfitness": "Yes mate! Go you 💪🏼. I fucking hate cycling (I’ll do it but I don’t enjoy it) but I love trying new things and embracing new challenges.", "champagne.mel": "Get a bigger seAt that narrow one will give you blustery in places you don’t want.", "lajoieskin": "Love cycling with a passion. Inspired to buy a new bike. You look sensational ♥️love it..💖", "jessica.finn.9": "I know a good bike track on the Southside of Brisbane.Haven’t gone on a actual bike in years as I find the seats very uncomfortable especially as I’m pear shaped", "caliburnathletic": "I wish I had the courage to get out on the bike! It's always on the 'to do' list, but I always find excuses 🚴‍♀️", "confessions_of_a_gcup": "Wooooo!!!!", "karla.m.james": "I recommend getting yourself a comfortable large seat to replace to bulk standard one on your bike. Biking is so much more enjoyable when your comfortable 😉", "lizaj71": "Well girl I’m proud of you 😊 i use an exercise bike but being deaf and having ear balance loss makes riding a normal bike impossible but I know with my exercise bike you need to stretch regularly especially your hip flexors and quads too otherwise you’ll find yourself getting sore too often 😊 can’t help with bike tracks as I’m in NSW 🤷‍♀️😊 side note LOVE the braids they really suit you, really 😍💖", "pamandjazz": "I hear you in the bike, I just got one too, ridden it once but I’m really nervous about the whole thing.", "jodes_": "A few days ago I got on my bike for the first time in forever - I enjoyed it a lot BUT my butt hurt so much after the shortest time so I didn’t go far", "natvellozzi": "😍😍"}