{"jessica_kane": "👏💥👏 yes bucket list and huge huge hugs to you! My bucket list is short - cover of Fast Company 😭😭no really, and all the things that it takes to do that!", "eanewby18": "Great post! Thanks for sharing and always being real! ✅ i hope I am able to visit all 50 states in the USA and see more National Parks.", "_simply_aschi_": "GORGEOUS... love the outfit and the background wow. #Goals.", "cassdesireep": "You are amazing and your strength shines through I always read what you have to say. My bucket list would include traveling around our beautiful country Australia 🇦🇺 with my fur babies and hubby. X", "maelee_curvemodel": "To live in the moment", "thebiggerblog": "What a Beautiful setting 🌻💛", "wendyeagle": "Gorgeous pic. I would love to take the fam to Hawaii next year, big bucket list item, smaller goals are to get out and exercise more and do more with my kids before they are to old! Get some work life balance! 💕", "elishamhunter": "Beautiful caption and pic 🙌🏽mine is to enjoy my passion so I can live fullest and work doesn't feel like work bc instead of the office I'll be pursuing my dreams", "hedenshave": "Mange tak . Du satte fingeren ned lige i såret . Jeg starter idag . ❤️ Thank you. You put your finger right in the wound . I am starting today . ❤️. .🌿👒", "leannezimmermann": "I have just found you on Insta and love that you put yourself out there in style and fun, I have been doing lots of things this year that I normally would not do 🙀 dogsled in Norway, traveled to some amazing places and just this week went in a Tuk Tuk in Bangkok 🙀 life is an adventure and live how you want, and you do it beautifully 🖤", "croneemma": "I recently attended a talk by Sebastian from 100 things.com.au and creating a list and doing things that make me happy is now a big focus for me. A few things include: visit somewhere new in every state/territory in oz. Cook something new once a week. Buy more adventurous and colourful clothing. Learn a new language.", "my.baby.steps": "I'm so sorry for your loss. I can't imagine what you're going through. ♡ . In the next 12 months I want to lose enough weight to get the help I need to conceive another child. My daughter's 3rd birthday is fast approaching and I still have 30kg to drop before the IVF clinic will even consider taking me on. it's hard to concentrate on much else of a bucket list with that being such a big and blinding goal. Short term though, is just to keep preparing for our moving from the city to the country over the next 3 months, and to have our plans come to fruition there.", "haeleigh_west": "Where is this sunflower field please babes? ?", "mumma_klou": "Gorgeous bright pic, u must have the personality to match x", "healthyish_nic": "I took some time out of my career this year to live my bucket list! looking forward to going back but to a more balanced life this time. Love this post 💜", "jennajennajingle": "Love this pic 💛", "hmwilles76": "Beautiful", "curvysam": "Wow so many comments you guys are amazing", "just_lovely_and_delicious": "✅✅✅ definitely more travel, take risks , live a life filled with laughter and joy", "pink_fairy_viola": "Love this 🌞🌞🌞", "girlfriday26": "@miss_maci_tate", "sandiicook": "Perfect Australian gorgeous look", "jesuisunerebelle": "OMG 😍😍😍", "samimastrario": "This outfit is just the cutest! I’m constantly checking off travel bucket list items. One random one from my list is going behind a waterfall. I attempted it a few weeks ago on my first hike ever and didn’t make it. Gotta work up to that goal. ❤️", "nerdinista": "Sorry for your loss, great message and beautiful photo! 🌻", "denialrenae": "I have a weird bucket list. For instance, get my photo taken with @bluecoltsmascot I checked that one off last year. 😂 one item that is currently on my list, is to take a hot air ballon ride.", "dessiebean": "I've spent the last 2 years living the dream in the UK (I'm from Sydney originally), and am travelling more than ever! I've been on 5 overseas trips this year, and have two more before March; including camping in Africa for 2 weeks! I've just turned 30, and it's definitely been hard being away from my family, but I'm taking my life back this year 💪🤘", "jennifercelotto": "Only recently started following you and feel your positivity and energy already. This is indeed a pretty picture but mostly because you radiate happiness xx", "daisy_brisbane": "Such a great pic, I love sunflowers and I love that skirt!! I think I need to make a list 😝 I’ve traveled a lot though, and our next trip is to the snow in Japan in a few months 😄😄", "sarahsapora\nVerified": "Verified", "txk9mom123": "I remember this! You in those beautiful sunflowers!! Stunning! 🌻🌼💗👌🏼💗🌼🌻", "torstoltberg": "🌻❤🌻😁", "jamiebeingmommy": "Where is your skirt from?????? 😍😍😍😍", "lynnettejayne": "Congrats on such a great year and the realization that you come first (loving yourself and bring compassionate to you) while having healthy boundaries around you including remembering to be humble and kind. So sorry for the loss of Josh! It is okay to talk about him - you are not bring a Debbie Downer - that is how you are processing your grief....honor that and how you are feeling!! Keep moving forward as you never know who you might be inspiring or helping!!❤🙌❤😊", "melaniesjoyce": "Always read the comments & love your page Sam. You've done so much this year! @curvysam", "_jasminscott": "Love this post!! You've got me thinking @curvysam Time to start my list ✔️", "delinadesign": "Wow lots of change and growth and more change for you Sam! Big hugs for your loss & adventures! 😘❤️", "tootlepip72": "What a great post! Lots of changes for you and I have admired you for the way you have handled it. This year my major ✅was to leave a toxic work environment. It was having a huge impact on my health. I'm still in recovery mode but am looking at getting back into the work force & have even applied for a few jobs! I am getting my health back on track and that will continue for the rest of my life!", "_tamaramae": "I've spent the last 2ish years ticking off many practical things that have made me a better person. I have recently started studying again and am feeling a little lost. But I am working on my health and wellbeing at the moment. Making myself as happy as I can. Which I feel is important.... you've done so well Sam and you're such an inspiration to me!! I hope you keep on being the best that you can be xxx", "natellapip": "Reading this made me realise I need a list and need to do it for me.", "sezzrobbo": "Thanks for sharing x", "katurtle23": "Awesome list. I have lots of vague ideas/plans in my head but think it's time to write it all down", "m_ee_e81": "Snorkel the Great Barrier Reef, go to Uluru, climb some stairs on the Great Wall of china, travel overseas alone (or anywhere alone!), sponsor an Australian child in need, New York, Europe", "withwonderandwhimsy": "You are an inspiration. I love this! I've learned to make my own opportunities and magic too. You can't just wait for things to happen to you. Decide what you want, and then do it! In the next year I want to learn how to sew, take another adventurous trip to the wild unknown, and make more time to craft and create!", "sophieeturner\nVerified": "Verified", "shandashannyshan": "This makes me wonder what's on my bucket list. Thank you for the inspiration and insight!", "tricia_velthuizen": "Really sorry to hear you lost someone dear to you ... may your heart be filled as you choose to continue to embrace the adventures you courageously choose", "_._.toes._._": "Learn to love myself again and know my own worth💚", "champagne.mel": "Love this photo", "charlieethell": "Fuck this hit me in all the feels sam, Life is all about chasing dreams but it’s time to start making that list again. I hit massive goals this year and now I need a new one !", "hayleys_journey": "Your story resonates with me so much.. being there for others and forgetting what I want! You are absolutely stunning x", "curvesinacardigan": "Preach! 🙌🏻 Life should be all about following joy!", "missstephierose": "A bucket list goal is about to be ticked off tomorrow. I’ve wanted more than anything to live in the city which is my happy place and tomorrow is the day I move in. I’m terrified, I am so scared that I am going to fail at this but it’s nice to reach for a goal. Plus, only a 15 min commute now!!!", "_jacqueline_troup": "To start a podcast! (Also- so happy that you’re living life, such an inspiration!)", "roguecurves": "Love this ! I'm currently working on my 30 before 30 list... gradually ticking things off ✔️✔️ congrats on all your achievements.", "becizzle_": "Love this post! I’ve been feeling really down lately and even though I’ve achieved the things I’ve wanted to (still have heaps more to do) I’m still feeling flat. This has made me determined to start a bucket list and get my life on track again!", "gadgets_n_things20": "You are a woman of substance. Keep inspiring everyone. How’s my bucket list without a bucket of money.", "glitter_and_gratitude": "✔️\"retire\" from teaching", "lisslings": "Expand my business, get healthier", "curvycartel": "I’m so proud of what you have achieved in the last 12m babe, it hasn’t been easy, nobody said it would be, but you have taken it in your stride. Onwards and upwards, here’s to many more adventures together. 💟", "shellsomer": "You’ve had an amazing and devastating 12 months. I have too-had a baby, lost my job, lost friends....I’m focusing on the positive!!! I have boring goals but they are achievable and I can have loftier aims once I tick the basics off 😘 #keepdoingyou", "binny_girl": "You inspire me everyday...thank you. My list grows everyday. I want to travel more and be kinder to myself 💗", "theswiseone": "This picture is amazing! As are you 💃🏼", "louiethafly": "I've just realised in the last year that I don't have to compete with anyone. I don't have to explain myself to anyone. I can say no. I can live a life that is completely mine without anyone else influencing me. I am suddenly unapologetically me and its magic! If thats not a life goal made than I don't know what is!", "jennieyles_": "You've packed so much in. I have a list that I tick off regularly. Life is short, do the things...especially the things that scare you", "danibower": "Sending you all of the love in the world for your openness & honesty. Some of my bucket list is below. xx R Raise $12k by shaving my head. Complete the city to surf and a triathlon. Travel Europe. See the northern lights. Walk a runway. Work with @melissamccarthy Change the world or change someone's world. LA pride. A few simple items!", "nikki_annee": "I have so many things I want to do! I have a short term bucket list: be in a field of sunflowers, enjoy the outside more, finish my degree (which can nearly get ticked off as of today!) Have longer hair And long term ones: roadtrip America, roadtrip Australia, have a white Christmas and birthday, have a year long winter, be happier 😘", "thedailyroutine.co": "We love this! 👏", "kittykattjules": "I lost the love of my life when I was 38 - I'm now 44. I have achieved so many things I never thought I was capable of, I almost feel like I need to live for two people now. Go you! Such a huge 12 months, keep on crossing things off that list xx", "jenniferatilemile": "Travel more, and make more time for hanging with those people who are important to me 💕", "gaelleprudencio\nVerified": "Verified", "jodiyoung74": "I am a busy Mum of 3 (2 adults one tween) i got news today that a good friend is ill. We went through a rough time last year with my eldest being ill. Life has to be lived. You have to learn to say no. You have to enthusiastically say yes and throw abandon to the wind. For me the next 12 months will involve, concerts, beaches, late nights, friendships, family and lots of love. My bucket list is simple; be happy with where you are and what you do, if not change the situation.", "justaddvodka": "👼 gorgeous", "melblackhen": "Just a bit inspiring. Love this.", "jessstastic_": "Bucket list: buy a new car, travel to Japan, sky diving, sing karaoke, buy a house, throw a Gatsby theme NYE party. Thanks @curvysam for making my think about some things I want to achieve. Turn 30 next year might try and put things into place to start achieving them!", "thebargainstyler_": "Love this. I couldn’t agree more. Definitely more travel ❤️", "nicole.patryce": "To get more tattoos and educate myself more on self love and self care ❤️ you've achieved so much in just 12 months. You should be so proud ❤️", "danibelle1985": "I ticked lots of my bucket list this year ......traveled to America ✅ and biked over the Golden Gate Bridge ✅, got lost in NYC ✅, saw the Grand Canyon ✅, drove on the other side of the road ✅ but there is so so much more! I want to have a baby 🤞🤞, go on a spontaneous holiday, have a white Christmas in NYC, hot air balloon ride, learn how to make pasta and macaroons from scratch 😂😘", "summerhayes__": "@curvysam what a beautiful post. Thanks for being open and inspiring. I want to spend quality time with loved ones & embrace being a little more unorganised.", "jodi2682": "Similar to you - I've just ended my lease early on a house in Sydney's burbs where I've lived for years because it's 'comfortable'. Im about to move into Melbournes CBD for a totally different pace of life - a bucket list moment for me ✨", "krisssty": "After a rough 12+months I need to put myself first more often. Today mark 1yr since my first miscarriage- since that day I have not been the same person. I had a second miscarriage in Aug- still heartbreaking but i was better equipt to deal with it. My health has been not great but I haven't been looking after myself as well as I should/ normally would. So that is on my bucket list!! On a side not my husband and I did start our earring buisness and we have been attending markets and expos which has put me out of my comfort zone!!", "busty_diaries": "My list just says: Make a bucket list.", "rocks_boots_dust_and_utes": "You’ve got such a great attitude that I really admire. I’m sorry to hear of all the crap you’ve been through but well done in all that you’ve achieved so far! My bucket list isn’t too long: I’m just working on getting my health back, I’d like to be able to travel with my family without having to worry or plan ahead for my sake. It’s interesting to see that when times are tough, who actually sticks by you - I’ve realized this in the last 12 months that’s for sure! I’m not going to let my illness define or defeat me!!!✅", "stace_mcgregs": "This is on mine too! I want to take my mum as sunflowers are her favourite. Mum and I ticked off a bucket list item last night, she's always wanted to see the All Blacks play live ✔️", "assillejade": "I don’t have a list but I just want to do what makes me (and the family) happy. We love travel so will do that. We support each other to get shit done from the small things to the big things."}