{"michelled222": "I totally agree... Dont miss out because of insecurity. Most of the time people are more worried about themselves and dont even pay that much attention. We are often our own worst critic. Remember, Confidence is Sexy! You go girl! ❤", "fairypants": "This is fantastic ❤️💕💪", "leanne_erbs": "You Go Girl! Love your positive outlook!", "kerryn_69": "You are a beautiful person, I love reading your post and I feel that little bit more positive for it 😀", "egak": "YES! I love going to the beach during summer, just because I'm a little larger doesn't mean I need to miss out on all the fun!", "justaddvodka": "Yasssss girllllll", "goodhewtohansson": "I love this so much! Ur an inspiration to me. It’s really hard to feel positive when you’re constantly receiving messages that you’re unworthy and grotesque. It is a definite work in progress, the old self love.", "jesseleigh_": "Love your real posts, love that you put the effort into writing a meaningful caption, thank you! 😊❤", "grayvineaustralia": "Beautiful 👌🏻", "katherine__boyd": "Youre stunning!!!!! Keep rockin that banging bod babe!", "joeyhaes": "💕💕💕💕😍", "hannpollock": "Love them! 😍", "healthyish_nic": "yes! It's so sad that people wait to be \"perfect\" before getting out there and enjoying their lives. What a waste 😣", "jenniferatilemile": "You look fantastic 😍 keep rocking your hot bod babe xx", "jennajennajingle": "Beautiful", "pastrybypatersons": "Hi Sam. Love these bathers. I’ve felt fat for as long as I can remember but I was also always a swimmer... and strangely enough getting in my bathers has never bothered me too much. It’s the one place I can easily say “ this is me and if you don’t like what you see a) get stuffed & b) avert your eyes because I’m coming anyway! #", "lisslings": "Looking good, love this swimsuit", "sequinsandsand": "That is such a wonderful cossie on you. Cossie confidence is everything in summer. Well done! Ax", "tonesoninsta": "Damn it I forgot to enter", "dieter04": "Hot", "bark1995": "So beautiful", "confi.dance": "Queen ❤️😩👌🏻", "ems_life_xx": "Exactly, its not what you look like, but how you feel ♥️♥️♥️ You are Amazing @curvysam", "karenbrittenxo": "You are beautiful @curvysam ♥️", "curvycartel": "You are beautiful inside and out my love 💟", "amandaholt_": "Beautiful and I just brought this print in a different style!!!", "busty_diaries": "Beautiful as always 💗", "croneemma": "@curvysam those are fabulous sunglasses, where are they from?", "nikkifiesta": "I need those sunglasses in my life! Where are they from?", "emisacollections": "LOVE this pattern Sam...looks stunning 😍", "lynette_passionateliving": "Go you!!", "emperry__": "Sooo cute lady!!! I'm so glad I've been able to find people like yourself to follow and help me work on my own body confidence.", "sogwladys": "So pretty 😍😍😍", "just_me_klee_": "🙌🏻🙌🏻🙌🏻", "sarah_mansfield1975": "Beautiful lady and amazing attitude to life 💕🙌🏻", "kirsty_zak": "You are stunning @curvysam - both inside and out xxx", "swimweargalore": "❤️❤️❤️", "hey_its_nance": "You always look gorgeous Sam"}