{"triccinicci": "I love this! It helps me choose what i like!! Thanks 😘", "keeffi": "@danni287 the last dress!", "just_wingin.it": "That black dress...gorg", "jencummins16": "That black dress is amazing on you gorgeous! ❤️", "louisetaylor48": "Love the last 3 - black dress very glam, striped dress so cute, and palm print dress is to die for- super flattering too,💜", "blondebakingmama": "Omg! That floral dress is amazing! I need it in my life! Xx", "carla.ironingladyinstadreamer": "Those 2 print dresses are gorgeous 😍😍", "itsajoycefullday": "Cute 💗💗💗 I just bought a ton of stuff from ASOS too! Love them so!!!", "txk9mom123": "You look fantastic in the haul ~ too bad the check skirt was a tad small ~ it's super cute!! I especially loved the floral dress!! Enjoy!! 🌺🌸🌼😍🌼🌸🌺", "tarlajb": "Looking amazing hun, what size it's the black dress with long sleeves and the brand ? I wanna surprise my mom with a nice dress 😍 looks fantastic on you I'm sure she gonna love it ⚡️", "teagz.rae": "@curvysam.. grrr that would make you so angry", "stefaniejaynestout": "Love that tropical dress. No bra too? Win win!", "lizphoto": "Love the striped dress and the bird dress! 💚", "glowupwithjessicakane": "👏🏻👏🏻👏🏻👏🏻 another awesome video", "organic_radiance": "🌸", "monie.hart": "Love your haul video 👏😘. It’s so nice to see the clothes on 👍🏻💜", "mademoisellestevie": "Looks great!!", "supportthegirlsaus": "Love the look of products. Went to look at ASOS but most are polyester. 😭😭 Look fab though. 👌🏻😍", "lillianchenhall": "Hi what is the black dress called?", "clairseymour": "Yaaasss loved the haul!", "dannistudt": "😍 that black dress!", "moggalicious": "I LOVE THE BIRD / PALM DRESS!! Did you keep?", "thefunniestmum": "Love that black dress and the stripe one best. Very flattering The others are nice too, but those are my faves", "curvyfatale": "Loving it! You look great on dresses 👗 🔝🔝🔝♥️", "bec_kyrkou": "The black and last dress looked amazing on you, you just glowed in them 🙌🏼", "daniarmstrong": "I enjoyed this video! The sizing discussion was very helpful, I might look at ASOS again. Black dress is stunning and I thought the gingham bathers were very cute!", "jjanderson87": "Did you get your normal size or size up on the last dress... Palm/cairns inspired?", "confessions_of_a_gcup": "The black dress! Daaaaamn guuuurl 👌🏼👌🏼", "curvycartel": "🔥🔥🔥", "caprioscaswimwear": "Looks like you got some great pieces 😍", "passion_ellegance_and_beauty": "Where do you get the clothes from ?", "_berrinda": "Love the song 👍🏼👍🏼", "bec.smith.stylist": "That palm print bird dress is so cute!", "twosweetfigs": "I think you should make them longer Sam, so we can get a better look at the clothing on you. Love the palm print bird dress that's my fave!", "sparklesandlace": "Baby James was totally mesmerised by this video!! You have an admirer", "jane_carr": "The palm print dress is my fave! Wasn’t sure how it would look, looks awesome 😊", "suzi.sparkle68": "PS everything looks great on you , dresses look great💙💚💛", "quirkygreek78": "Is the tshirt asos also", "lizajeanw": "Watched this today - loved it - loved the sizing comments - would love more info on fabric - breathable ? Stretch ? Thanks for sharing - Loved the tropical print dress and loved loved loved the tiger dress 💕💕"}