{"belindalwilson": "Traveling to Bay of Islands. Would be perfect. @huntergirls12 @wilsoaj26", "mrsaimeelangridge": "I’d wear this on my Hawaiian honeymoon next year! It’d be perfect for those relaxing days by the beach ☀️🌴🌺 @_meaghanhill_ @joshlangridge", "peachwhine": "Id wear this to Koh lipe island - Thailand and just by the pool in surfers paradise what a stunning pattern @ywinks @andre5750", "ywinks": "On my 40th birthday cruise 🚢 @peachwhine @trenthomann", "laureneve85": "Palm Beach, QLD @retstaa @christiesue85", "midgee63": "Wear it all day - comfortable @skylar_dakota_mummy @kayla_mccarthy98", "erikajayeb": "On my cruise to the South Pacific! @dandoesketo @havebutterwilltravel", "ashlysaght": "@8telisha8 @lucy_wells", "bubblzmac": "@karen_and_penny @ljc.photography", "jodiyoung74": "I would wear it all summer long. To the beach, home again. Out for dinner, home again. It would get so much wear. @ritchiedonovancaroldonovan @kel.stephens", "lauradoesbrunch": "I can't seem to tag my two friends @curvysam! But I would 100% wear this to the beach", "charmnz": "#freeshitwithcurvysam", "tam75tazz": "I'd give to my mum who has been looking for a nice kaftan to wear @carol13t @chich86", "miss_nae_m": "Trinity beach New Years holiday house @lozee_simone @neenie_ltb", "tahliascholes": "I’d wear it on my first family holiday in February! It would cover all the bumps nicely! 😍 @emma_crouch @laurennewby006", "bluekrushbabe": "@mrs_cinnamon @lozwatts xxx", "beejay84": "Around the pool on Christmas Day!! @lady_and_a_cat @denhamjanelle", "nearlygrandlove": "Would wear it on my holiday to Fiji!! Would be perfect 👌 @erintonkin @brooksy317", "emlouiseduncan": "Anywhere and everywhere @gillyhgilly @isabelheighway", "curvysam": "#plussizeswim #iwillebracesummer #everydaystyle #yourbodyconfident #brisbane #visiblyplus #brisbanemodel #weekendvibes #styleinspo #curves #plusmodel #30plusstyle #australianstyle #spotmystyle #curvyau #popofcolour #psfashion #plussizefashion #bodypositivity #dressinspo #bopo #beinyourskin #anybodyco #buzzfeed #mamamiasummer #ownsummer #mybodyisabikinibody #bikinibody", "hayleyhedges96": "@curvysam I would wear it to the beach all the time and take it on my Bali trip next year. I don’t have the smallest body so it would make me feel a little more confident at the beach. @naomihedges @meegs1996", "skylar_dakota_hank": "Probably all day everyday around the home and out exploring since I live at the beach 😍🌴 @midgee63 @becbeclt", "marzy_37": "I would wear it everywhere!! @kel4stan @boppercraft", "natellapip": "On holidays or weekends! Just gorgeous @samnash2509 @myblossompepper", "danibower": "I would rock this while in Hawaii for my birthday/12th wedding anniversary in January with @sethbowerruxton And then in February when we have our first family cruise with @flyingb0o and extras!", "flickharvey86": "I would wear this in Mackay and Airlie beach where it’s the ultimate summer destination 🦀🙌", "rocks_boots_dust_and_utes": "Would love this for the beach!🏖 @apples74 @kirsty_zak", "amyyywalters": "Everywhere. Where wouldn't I wear it!? @christyjanette @jordan_e_95", "mustangsallytwo": "So pretty! Love the colours and print 💕", "peta_scarcella": "I would wear this for my next holiday to Bali! @gaerobbie @tinkabelltina", "coco.walsh": "I would wear this by the pool all summer long, it will also look amazing covering my soon to be belly 🏝⛱ @nicoleacremer @twiggz99", "_._.toes._._": "To the beach on holidays perfect for Christmas! @tashmoxey @frasem8", "ellatomsett": "I would wear this beauty to the beach over the road from my house and out to the river when we take the jet ski out 🙌🏻 @katetonta @jonitomsett", "thisislizbit": "I would wear this to the beach whilst hanging out with my kids during the holidays @leilahermei @little.miss.keys", "2lou7": "Sitting by @r_kinman pool drinking cocktails @b_e_c85", "retstaa": "@laureneve85 @beccrg", "danni287": "I'd definitely wear this to the beach but also relaxing by the pool during many a summer evenings! @keeffi @jess_alldis", "tanz_85": "@ally.nawrocki this would nice cool for summer at the beach. such pretty colours 😀 @emilyrj06 perfect for your pregnant belly", "sweetstarsky": "Relaxing by my folks pool on Xmas day @nanks85 @mel06985", "keeffi": "@danni287 @therenovationco umm pretty sure this is perfect for Hawaii trip!! 🙌", "tonifromthemount": "In beautiful Mt Maunganui (home) with @seachellemckee and @missnutritionista", "chantellemarie__": "I would love to wear it at the beach, by the pool, around the house, it’s acceptable to wear one ANYWHERE @aliceblows @hopefulraeofsunshine @justme_andmy_vsg @finding_rachel_ @rosieg_wls_rny @minus121", "amandaholt_": "To the beach! @grizzlybear_82 @jen.bush", "uandme_plusourlil3": "Yes please. I would wear this everyday to the beach with my kiddies 😍 This is stunning and perfect. Thank you x", "jessstastic_": "I’d wear this around the pool on Christmas Day with the family. Perfect for Gold Coast weather plus style!", "courtycourty": "I would wear it out to dinner with a nice pair of sandals and a statement purse/necklace 😍😍😍 long version too!", "laurenboase": "Oh how gorgeous! My neighbours have just put in pool and I plan to spend my summer hanging there...this would be perfect for the walk around the corner! 😍", "annajodonnell": "Looking forward to rocking a lovely short kaftan at Lennox Head with the fam to our annual camping trip to the beach!", "lisarockstar": "Everywhere!", "kyserstuhl": "At the beach all summer probably Marion Bay, SA where I’ll be spending a week over the Christmas break - sun shiney days!! ☀️☀️🏖🏝⛱", "emperry__": "I would wear it while sipping cocktails by the pool under the warm sun with @tahnee_stokes and @curvycartel", "liss_doughty": "I would it on my well deserve holiday to Port Douglas in January with my fiancé on a nice sunset cruise! @makeupby_mel.t @jesspacquola", "busty_diaries": "Hell yeah! I have been looking for something to wear with my new swimmers. I will wear this poolside every day these holidays!", "laceynickers": "I'd love to wear my kaftan to a tropical island... but I would wear it to Moama, where I'll be celebrating my wedding anniversary & ringing in the new year. Poolside, of course! 🏝", "allisonjulie27": "I'd be swanning around in that kaftan everywhere this summer 🌴🌊", "panda151705": "Perfect for my pregnant belly at the beach this Christmas 🎄 #freeshitwithcurvysam", "rochellemara": "I'd wear it at home in the heat after a long day at work cos I'm working through...☹️"}