{"missrachelanne_": "@sallylou7 @meggie_kate_davis", "breanne83": "You need this @hannahtorrisi87 @leesar87", "itshayleymichelle___": "I struggle to drink water but this gem would come to work with me for sure & help make me drink that clear goodness. I'd also take it on my hiking trips! 🤞🏼 @jesssss01 @mirham88", "kiahl0uise": "@bryony_drought @beccalea123 I’d take this bottle with me on my weekend hikes👌 doubles as a weight!!", "mummarachy": "I would take mine straight to the bedroom & plonk it on the bedside table. Nothing worse than waking in middle of night breastfeed and I'm ridiculously thirsty! Perfect for those times. @simmons_cheryl & @caitlin2195", "hayleyhedges96": "Everywhere! It Would be great way to keep me on track, perfect way to make sure I get 2L of water a day!! @_ashleighsampson @meegs1996", "bekjeno": "I’d take it with me while I sit outside in my yard enjoying the sunshine 💕 @nellegambold @katrinabrizzi", "ems_life_xx": "On walks with me, shopping, it would be permanently in my hand, it's gorgeous, and definitely a necessity 😍👌🏻 @emma_brooks_xo @tahanalee", "shotsandsnaps_": "@kirkel23 @renee_sellers I’d take it to Lake Canobolas for some hydration after paddle boarding 😂", "kitcheningabout": "This would go with me on my summer outings with @tea_and_whine", "skylar_dakota_hank": "I would take this wherever we go with the kids to make sure they always have plenty of water 😊 @midgee63 @becbeclt", "freerange_mum": "I'd take it everytime I go outside with the kids to play, hang out washing and doing gardening @kristyleex @je53de", "nikki_annee": "I'd like to say some place cool, but realistically to work so I could be lazier and not walk to the kitchen every 30 seconds. @andreaklove @eidnolb90", "thethriftyshopper": "Taking this beauty to my desk at work lazy life af less refill trips! @ultimate_ocd_mama @nanat_001 - please enter because i’m the best sister and need a free water bottle #helpasistaout", "emperry__": "I'd take it to the beach to stay hydrated in style with @_hayhayz and @emm_life_ 😍😍😍", "curvysam": "Thanks to everyone who entered 💜", "realactivemovement": "Whoa! Summer in a pic. Love this! ☀️💦💦💦", "visitairliebeach": "Nice ☼ Please check out my page ↠ follow @VisitAirlieBeach if you like ♥", "_._.toes._._": "@tashmoxey @reenz90 everywhere I go like me second skin but mainly work", "danni287": "@keeffi @jess_alldis", "seri_01": "I will take it everywhere, that's why the big handle right? @jexsollisphotography @senijaofficial", "nsammy28": "To class @thejunglebodywithzul @thejunglebodywithchantai", "princessbrows": "❤", "amydeville": "To a weights sesh 💪🏻 @jade.elise.x @_courtxox", "pinkoolaid": "❤❤❤", "jodiyoung74": "@kel.stephens @ritchiedonovancaroldonovan", "ellietubbs": "Needed this in cairns @ingerz @_hot_tub", "jessicamareeyoung": "@fweb96 @kirabyles need this when I take ivy walking argh it hot 😣", "confessions_of_a_gcup": "All of the days! @nicool_radshaw @whattheteacherwears", "somekatiegirl": "It’s first trip would be all around the amazing FNQ at Christmas time! Perfect item to help me get my butt into gear🌴🌊🍍🍓🌊😍👌🙌 @jessicashimmin @dizzyrhodes", "carlywilso": "Ulupna @cwilso44 @jensie.misha", "retstaa": "@laureneve85 @authenticallyjessr", "becfez": "I'd take mine to Pilates and then the beach! @titfan @bettysteenbergen87", "being_michelle": "I’d take it on my morning walks, definitely need to keep hydrated in this humid QLD weather ! 🤗 @ali_carolyn16 @kathleenclinton", "shauns_92": "It would come to work and the gym, everywhere possible :) @klaseyh @captainpiratelly", "charmnz": "I'd take it everywhere- a must have accessory for summer @madicowan @lebenjammin1992", "julia.fing": "It would come everywhere with me! Help me get my 3L in per day! @judygent @caff.whitstock", "becks_spurdle_fisher": "Work, the gym and summer adventures around NZ. @hannahspurdle how cool would this be for our sister gym sessions? x", "ashlysaght": "This would be amazing when I’m in labour! 😍😂 @teagan.stuart.x @8telisha8", "mrsaimeelangridge": "I’d take my bottle EVERYWHERE, but mostly to work; to show off (how stylish it is) and save me from the four 600ml Mt Franklin bottles I’m forced to squeeze into my bag and lug around every single day!! @_meaghanhill_ @healthai.mee", "chantellemarie__": "I would take it EVERYWHERE with me, but I would love to take it with me for when I have surgery!! Ensuring I keep my fluids up!! @aliceblows @hopefulraeofsunshine @chiller_putting_in_werk", "aliceblows\nVerified": "Verified", "eme.bear": "I'd take it to @fit2function_f2f @abby.lee91 @clobegley", "daisy_brisbane": "To work 😅 @_tung_ @nmurphy", "okr_2015": "I would take it EVERYWHERE @realactivemovement", "bectweston": "@kathskippen @rskippen school every day!", "amy_jarvis21": "@laurendries @kettlelc - I need this for work! I fill up my drink bottle about 60 times a day, this would be a real treat! And it’s pink!", "jessstastic_": "@carmennrex @fireyred07 on my walks up cape hillsborough 🏃🏼‍♀️⛰🏝", "tanielle.e": "To netball and gym @sheridan_norton @_taylorwestlake", "curvycartel": "Looks amazing babe. 💟"}