{"kelly_azalea": "You go girl 💪🏽💪🏽💪🏽", "supers2506": "Find a good trainer to learn good technique. Focus on technique and proper form, don’t rush to increase the weight. I struggle working out on my own, so a gym buddy or group classes motivate me. You’ve got this! 💪💪💪", "leannezimmermann": "Looking freaking amazing 💪🏼💪🏼💪🏼", "_jens.life": "Loving this outfit and post. Activity isn’t always about weight loss. So many other benefits. Good on you.", "kimbalikes": "Looking awesome! Love the matchy matchy. With my chronic pain issues, exercise is very tricky for me. It’s a fine balance between trying to regain some strength and not increasing the inflammation.", "sprinkleemporium": "🔥 it’s on my list of things to do for 2018!!! I bought one of those vibration machines and I think it might actually be starting to work a smidge.", "nadine_samme": "Try to stay healthy and get fitter, too. Also decided to try new things, I started Yoga 😊💪 you look amazing! Weight lifting sounds cool👌❤", "carbird83": "💪💪", "hayleysee": "I love powerlifting! Nothing better than feeling strong. The beauty of it is its so easy to feel the improvement. Things that felt heavy feel light, unlike cardio where you're always puffed and dying but you can just delay the dying part for longer 😂", "vanessa_francis44": "Be constant with your training. I despise cardio so i have gone to weight training only. I have found that muscle loss happens really quickly. So if you have a week off you can really notice the difference at your next gym session, what ever progress you had made is significantly reduced. Hopefully you will enjoy lifting. Its a crea", "gabrielababipetit": "💪💪", "kellyparty": "Good work hun! I go through waves of motivation and just let myself go with it! Currently motivated and getting up early to exercise about 3 or 4 times a week (which is massive for me 😹)", "stephanie_roberts90": "💪🏻💪🏻💪🏻💪🏻💪🏻", "daisy_brisbane": "💪💪 powerlifting is amazing, and seeing yourself improve each time you do it is the best motivator :)", "emperry__": "Just the fucking bomb girl!!!!! Love this so Much!!!💣💣💣💣", "tabitha.mackey": "💪🏻💪🏻💪🏻💪🏻", "shanaenae01": "@curvysam find a really good PT that knows how to lift to teach you technique and how to programme for results!", "lifewithleilah": "I love this! You look amazing. 👏", "deanda_cris": "Girl, you’ve been to Nepal?! I love it there!!!!!", "elle_herself": "LOVE your activewear! 💕", "jennajennajingle": "Beautiful xxx", "lauralovingherself": "Enell bras could contain ya boobs!! 😂", "justaddvodka": "Groovy! The cutaways are so cool", "jjdeleon1982": "Beautiful, lovely, gorgeous stunning lady and love the outfit", "itsmichelleslife": "😍 I wish I could look this amazing in this", "renee_antoni": "Love this set on you! So so slimming too!! I must buy!! ☺️", "curvysam": "@fullerfigurefullerbust same set@that you got too@", "___joal___": "I wish I had this outfit woman!! 🔥 🔥 🔥", "isabelroseh": "💪💪", "backtobasics2989": "Love that outfit", "whitney_joan": "This outfit is amaze balls", "isabellabrusilo": "One of my New Years goals 💪🏻♥️", "islandgirlcoco": "💪🏽🔥", "juanitaat44": "That's my second goal, the first one is nor to be so lazy .... haven't reached that one yet. 🤣", "thequeen_shakira": "Cute gear!", "hayleys_journey": "💪💪", "ot3577": "Awesome 👏", "awesome.aga": "Started strengthening my back muscles, am way too much sitting 💪🏻💪🏻💪🏻", "cassdesireep": "🏃🏼‍♀️💪🏋🏼‍♀️smashing my goals", "lisslings": "Yep! 💪🏻", "pammybcakes": "💪🏽💪🏽", "clairseymour": "Loving this 🔥🔥🔥 I love lifting weights", "tash_craig": "💪💪💪 you've got this!", "_rachelwithers_": "💪🏼💪🏼", "nicoleeenid": "💕💕💕💕💕💕", "jaydabeau": "SAM YOU LOOK SO HOT OMG ❤️", "prue_devery": "You look amazing in that outfit.", "craftyclaudes": "💪 im into my 2nd month at the gym. First time in almost 16yrs. Its scary but kinda exciting. Next month i hope to start weights too!", "onuntillmorning": "What size did you go for? I need to get a set, too.", "pritipurohit_": "💪🏻💪🏻💪🏻 yes mee too", "tricia_velthuizen": "I have started moving my body again ... even *thinking* about 🏃🏻‍♀️", "mommalion1": "💪💪", "thecurvy.sisterhood": "🏋️🏋️here here!!! I need to get my abdominals stronger again after baby #2 my lower back is so unsupported", "roguecurves": "💪🏻💪🏻 also, love that Puma set !", "borgerdonna": "🏃🏼👍🏻", "melsy82": "Get a trainer to help with proper technique, and strength and mobility exercises!", "thatsteph_": "💪🏻💪🏻💪🏻", "dannistudt": "💪🏻💪🏻 yeessss! I used to love running, now after having my baby I don’t 😂Have always loved weights though!! My advice...go to a PT or a specialty gym with weights classes to learn proper technique. You’ll be even more addicted 🏋🏻‍♀️", "glitter_and_gratitude": "💪🏻", "rubyhilda": "It's all about feeling fabulous and strong 💪 👊👊💪", "quirkygreek78": "🏃‍♀️🏃‍♀️🏃‍♀️", "flossylox": "Cute set! I was looking at all@the colours! So cool", "millandmurph": "💪💪💪", "sarahinjuly": "I do. I love lifting and got into it a couple of years ago. It’s shifted my brain and thinking around so much. I realise how amazing my body is and it’s stopped me obsessing on what’s wrong and now I am really proud. My biggest tip, be consistent and regular. And if you can get a trainer on the hardest day for you to get to the gym as then you’ll always have someone waiting on that day and not miss it and the rest will flow.", "msclaire76": "Weights are my favourite workouts with my PT.", "itskatejanmaree": "💪🏻💪🏻 yas girl", "rachaelmclean92": "💪🏼💪🏼💪🏼", "_carmal___": "💪🏾💪🏾💪🏾", "danis.getting.healthy": "💪💪💪", "itsmefifid": "💪🏻💪🏻💪🏻", "lizzylove89": "💪🏼💪🏼", "nicole.patryce": "💪🏻💪🏻", "curvycartel": "Love this set babe, good on you 💟", "annelisekate__": "I’ve come home from New York so inspired to workout and make that change. But my weight now and 3 weeks of walking means I’ve hurt my ankle. Hopefully just another week of rest and then I can get the ball rolling 💪🏼💪🏼", "lauren.somers_": "💪🏼💪🏼💪🏼", "danibelle1985": "💪🏻💪🏻💪🏻", "peta_scarcella": "💪🏼💪🏼", "becnherboys": "💪🏻💪🏻💪🏻", "kel4stan": "💪 it’s all about getting fitter & feeling good! ❤️", "magicalworldofhannah": "Holy shit wow you look so wondorous 😍😍😍😍😍😍😍😍🔥🔥🔥🙌", "hayley.87": "Lifting is my fave! I’m no pro by any means, but I would say work on perfecting your technique before you go too heavy. We got this @curvysam 💪🏼"}