{"thecurvytrini": "Very powerful post here love ❤", "glitterarian": "This is such a beautiful and important message! Conscious consumerism and minimalism are wonderful ways to ground your life and also feel more free! Thank you for this reminder. ❤", "gracejane": "This is amazing! You are amazing!", "charmnz": "👍👏❤❤", "rachelgeebee": "Yes! I was talking to someone about this. How I used to fill a hole with clothes. It's not unusual to fall into a consumerist trap that buying stuff will male us happier. I still do it sometimes with makeup but I'm more aware now.", "didimo1313": "Best post I've seen in a long time. Thank you!!", "the.mom.saga": "Wow so classy", "slowdownstyle": "Love this message - great work!", "emma.marie.82": "Adore 💗", "feek27": "Love those pants 😍😍", "mummaflip": "Refreshing!!!!", "2012katg": "Yeeessss! Totally agree @curvysam 👏🙌", "daniarmstrong": "Awesome post Sam! I think it’s fun to post how I style my clothes differently - well that is my excuse and I am sticking to it 😘 (fact is, I also need to seriously cut back on my consumption!)", "liveandbreatheyoga": "Fave post ever!!!!", "mele2541": "Yuuuup! Less is definitely more! Main reason for me opting for a plant based diet was the cost of all these industries on our planet. I'm not saying it's the fix-it solution but I admire people who are willing to change or go without for the sake of our planet and the future generations ☺️☺️", "merrollee": "Love your comments and as a Shop don’t see why you can’t wear the same item many times. The idea should be to have clothes that work and allow you to make lots of different looks. We love seeing ladies in items styles different ways on different days. Think others out there also do.....Post how you shop your wardrobe and use your clothing to show the value for money! Cost per wear $$$💕 love your honesty! 😍", "daisy_brisbane": "Love the outfit and the words. You can still post awesome walls and cute outfits without buying stuff all the time, I’d be happy to see how you rewear and restyle clothes for sure 👍", "amyjean11": "Love that you’re so honest.", "mariainathens": "Shopping therapy. A little treat after working hard, boosts you up (albeit temporarily). We all have much more than we need.", "sonyasartorio": "Thats so awesome and so true, we don’t need a lot of stuff. Minimal is so important buying quality pieces that will last the extra mile instead of spending money of outfits that will be worn once!!! Thank you for sharing this xxxx", "gentle.bliss": "🙌🏼👌🏼❤️", "littlesteph.e": "Great caption and picture . So true . ! 💓💓💓", "justaddvodka": "🌍🌎🌏", "bridie.mcintosh": "@curvysam can I pls ask what size you wear in these pants ? I've been on their website but they don't have details on their size 18 up. Thought I'd ask :) thanks 😁👍", "mandyclogs": "Well said 👌", "schoenkurvig": "You are so right 🙌 I am also trying not to buy new stuff every week. But it's hard 😅", "summerhayes__": "@curvysam i love this post so much. Good on you Sam!", "melkeating73": "YES!!! Have done the same but doesn’t buy me happiness! Agree totally xx", "pro2rpm": "Thanks for sharing this beautiful bit of wisdom. Happy Friday. Good to see you again. Have a great weekend", "natatree": "Yes, I've been so much more mindful of my purchases. I don't have much to spend and most is going to saving for Hong Kong but that has made me realise what I already have. Which tbh is a lot of clothing that doesn't get worn, so i've been focusing on shopping my wardrobe, wearing what I have.", "joeyhaes": "Where do you find all these magical walls?", "cjtemps": "Fantastic post @curvysam 👊🏼 I worry a lot about the environmental side of our consumeristic society & try to cut back too. Good on you for getting this out there! ☺️", "juzsavage": "I just watched @truecostmovie on Netflix. WOW! We all need to make a bigger effort to wear what we got.", "girly88": "Couldn’t agree more with your post - although I must admit, I just went on to Showpo and bought myself a pair of those pants in navy! 😍👌🏼 x", "cuddlesandfetch": "Great message! ❤️❤️❤️", "fearlesslyjustme": "Love you and this ❤❤❤", "andreawestbrook_livewithheart": "I know what you mean about buying less! I’m trying too! I ❤️ those pants though! Xxx", "tiffanyjadeo": "Great post. Very relatable. We are So much more than clothes (even if they are bloody fabulous) and we are so much more than what we wear and 'who' we wear 👏👏👏👏👏", "liss_doughty": "@curvysam well said! You should definitely do a video showing how you shop your wardrobe to mix and match different outfits! I would love to see that! Keep going girl x", "palmbeachshoessydney": "Love the pants and totally agree to your post", "katurtle23": "This. Yes. And, BTW, love those pants.", "sallylmatthews": "I agree so much! Thanks for posting.", "just_me_klee_": "Your always full of truth! Yes yes yes!! I buy things when I really want it cos lately there isn’t much!!! And seriously who has the money to buy a new bloody outfit each week unless it comes from Kmart lol 😍😍", "__geeac": "Love this! Keep doing what suits you!!", "nsammy28": "You should do post with the outfits side by side styled different? I would love to see that. Your pants are soooo cute", "sogwladys": "And your words 🙌🙏", "rudilandmann": "Love this; thanks for speaking your truth! 😊❤️✨🙏", "tarynkjames": "@curvysam those pants are amazing !", "danielle_maree19": "Those pants look amazing. What size do you wear in Showpo clothing?", "candace.scanlan": "Thanks for sharing 💗", "jaydemelissah": "I love this! Over indulging in material objects does not make anyone happy long term. This is something I’m learning a lot these days. And has been something I’ve been more focused on since my yoga retreat in Fiji last year and transitioning to a plant based lifestyle. I’m also trying to buy quality items that I know I’ll wear forever. They don’t have any value once you’ve worn them anyway. 💗", "lauralovingherself": "Yes, 100% agree! I used to love buying new clothes but now I just can't afford it and it is such a waste! I still like to look nice, but I can look nice in the 4 pairs of shorts I own 😂😂", "theswiseone": "Yasssss gurl!! 🙌🏻 this is so true. No one needs new clothes all the time.", "thebuddhaandbuffyfamily": "It's the one thing that bothers me when following these fashion blog type pages. As much as I love the style inspo I also get annoyed at the pressuring to buy new stuff, obviously part of their job, and also wonder why they need such a constant parade of new clothes. Kudos to you for showing that our wardrobe doesn't need to be always added to make us feel content and beautiful", "sunshineandpudding": "I am way more interested in remixing current pieces than always buying new stuff these days, it sort of become its own vicious cycle ‘Ooooh, I love that top but it looks amazing with dark wash jeans, I better get those too...’.", "taniahouwing": "I agree 💯! It’s like people haven’t heard of a washing machine? Why can’t they just wash it (and dry it) and then wear it again?", "stace_mcgregs": "I want to get into your pants... literally", "daniellejungle": "I love this so so so much!!"}