{"glitter_and_gratitude": "Gorgeous as ever! Love the white dress. 😍", "cheyhyde13": "I have an all white hens in June and am struggling to find a white dress I love! And the separates I have brought for it are not quite the same shade grrr! Whites without patterns etc is so hard to find in a flattering style for my figure!", "thefashionheist": "Killing it in this outfit 🔥🔥🔥🔥 I loveeeee to wear white", "bodypositivitywithsammy": "Looove", "mel.overton": "I love to wear white but my problem is when I spill food it always shows more because my boobs are so big it just stops there🤣", "cordeliarocks": "You look amazing girl! I think white really suits you, looks very elegant on you.. i love your smile & confidence too! Keep it up ❤", "wbywhitewolfe": "Babe x", "dawnlucia19": "Love the dress!!", "stayceew": "I am ridiculously clumsy so avoid white at all costs! 😂", "carolinaplussize": "Beautiful! 😻 @curvysam", "emmy128": "Couldn’t agree more but I find them in odd places! I was travelling in cairns and come across a white dress on sale in City Chic I say embrace what makes you feel amazing!", "luxe_everyday": "White suits you my dear 👌🏻!", "keira_alexandra_": "Looking stunning babe 👌🏼", "katurtle23": "Gorgeous", "itsaishanikora": "Dress is so cuteee", "littlemiss_corporate": "cute :)", "thecurvytrini": "Adore this super chic white look!", "justaddvodka": "⚽️⚾️🏀🏈 let's play dress ups", "crystal___india": "Do you happen to know the name of this dress? Or have a link? Xx", "tarynkjames": "@curvysam just gorgeous lady !", "imaclassylady": "Lourrrrrrve this look 💜", "seramatasere": "@sami_linnet this would look amazing on you gurl!!! 😍😘", "prudencejh": "@curvysam I'm stuck in a white shirt for world 5days a week atm. 1- it was impossible to find white shirts. Had to pay over $100 for an unglam one. Then finally found some at an outlet for $20 which are not total business but at at least all white 2- feel so self conscious and really big in white. How silly is that!", "magicalworldofhannah": "This is an amazing dress and looks so good on your figure! Suits perfectly I think!! 10/10", "shantahnee": "I loveeeee this! Also you have the best legs 🙌🙌", "amandaholt_": "Love it! But with three boys it’s not ideal lol you look amazing 😉", "curvywordy": "This dress looks so chic on you 👌🏻", "sam_heriot": "Love white! Have a cute swing dress and 2 pairs of jeans in white 😊", "annaritaevans": "Absolute babe! ❤", "joeyhaes": "I love this dress on you xxxx", "chelseeaoh": "How do you have the confidence to eat or drink in white? I literally have to have a pep talk and tell myself I’m a grown ass woman and won’t be spilling anything today 😂", "livvyrae_b": "That looks gorgeous on you! 😍", "candace.scanlan": "Omg Sam looking sensational 🔥", "littlemissnochill": "Love this dress!", "mothertheresa74": "It is hard to find white but I love this!!", "jessiicaaa_l": "Totally agree! I don’t often gravitate towards white but I really wanted to wear a white dress for my hens party last year. I knew it wouldn’t be easy so gave myself 6 months & still didn’t end up with anything I liked so ended up wearing pink & white. Was so disappointed with the lack of options in bigger sizes.", "misshelen_xo": "I have a white party that ill be attending with size 8 fashion bloggers. I hate wearing white dresses at night time! But ive got about 50 suck in undies to try on after!!", "itshayleymichelle___": "Love this dress on you! 😍", "jenniferatilemile": "Cyuuuute! Love this dress on you! And the location 😍😍", "summerhayes__": "@curvysam total babe!!", "murri_mama": "I can’t wear white. I’m a complete GRUB!", "sammie_js": "I find it hard to move away from dark colours. I would love to wear light colours though, because this looks fabulous.", "somekatiegirl": "Even wearing the tiniest bit of white, I still manage to turn the colour to whatever I’m eating 😂😂", "kody.m.s": "I looooovvvee white clothes!", "princesseatspeasoup": "I won't wear white only because I will pour tomato sauce down the front in under ten minutes but this dress looks gorgeous.", "emilydoherty_": "Gorgeous! Hope you had a fab weekend. Xx 😁", "stace_mcgregs": "White HOT sista!", "bek_cheb": "I have a beautiful white shirt I bought last September and still haven’t worn! I know I’ll spill something on it the second I wear it 😂"}