{"emmamichellemillinery": "@juliawatson_zarbella 😂😂😂 Roadtrip at the Crab shack", "tildanicol98": "I use to love Bondi sands but now I’m obsessed with Le tan ultra dark, also Priceline has 40% of all tanning products tomorrow-Thursday 😍", "leanne_erbs": "Bondi Sands has a variety of products including a tan eraser just in case.", "juliawatson_zarbella": "@emmamichellemillinery thats hilarious 😂😂😂", "berightbec": "@joelene_anthony @tashnaydur", "_vickin_": "Le tan has a back tan mitt. U think this is weird but it works! I got mine at kmart and they sell them in priceline too", "joeyhaes": "St Tropez or if you are going to UK St Moritz", "becca_b00m": "Bondi Sands liquid gold! So good and doesn’t destroy your clothes or sheets!", "guillenmaita": "😂😂😂😂😂😂😂😂😂😂😂😂", "ifsharuledtheworld": "😅😅 this is so me!!", "justaddvodka": "OHHHHH!", "ksmilie": "Bondi sands on a Thursday night for a lovely glow all weekend-it’s “proper” Tan, like need a tanning mitt and back applicator. Palmer’s tanning moisturiser is my other go to. Nice and easy to use and i put it on at night, chuck some baggy clothes on and hop into bed. Get ready to sweat chocolate though", "hello_elbie": "@kizmet41", "curvyandfearless": "A true statement has never been said... UHHH #WhiteLatina", "lanaelien": "Jergens tan lotion...looks natural on this super-pasty girl!", "stylingcurves": "Lol", "plussizeitaly": "Ciao, ho creato questa pagina per tutte le ragazze plus size ITALIANE (compresa io sono una taglia forte ahah) voglio semplicemente condividere con tutte le altre ragazze come me e non ovviamente, esperienze, pensieri consigli di shopping di make-up tutto qui, se magari puoi aiutarmi a farmi 'notare' io sarei davvero molto contenta, grazie mille se lo farai! 🌹❤️✨", "veronica.and.family": "Oh the pale girl life is real. Sorry no tips I just live with my paleness nowt", "jessicasmith27\nVerified": "Verified", "meak_handmade_jewellery": "lol!!!", "ahotmessmumma": "@curvysam I use @bondisands it never lets me down, actually sitting on my lounge soaking the colour in as I write this. I use the back applicator from Bondi sand to do my hard to reach area x", "iamrita_h": "😂😂😂😂😂", "deannakentcelebrant": "🤣 same! Whiteness of winter", "mefdf55": "🤣🤣🤣", "jodi2682": "Priceline sell back applicators - theres two different types 🙌", "littlepartydress": "I’m too scared to do my own! I get a spray tan fortnightly... there’s a beautician under my apartment, I don’t have to waddle too far afterwards! 🙈😹 Or I use St Tropez gradual tan for a top up 👌🏼", "freerange_mum": "Bondi sands Its very similar to model co but not so fake dark and doesnt seem to go patchy as it fades", "juzsavage": "Bondi sands!", "angeeela_84": "Bondi Sands! I’ve never had a bad or streaky tan", "clairseymour": "Bindi sands, ultra dark, two layers 😏 (if you dare)", "janakaren1111": "😂😂", "bekjeno": "Bondi Sands 😘", "sunshineandpudding": "Bondi Sands, Dark. Get the long thin fabric strip with loops on each end to do your back rather than the paddle type (I find the paddle one annoying AF to use). To set your tan so you feel less sticky, a light dust with baby power applied with a brush takes the tack off. Bondi Sands 1h express is also great in a rush but it’s hard to blend so work quickly!", "poppyandblake": "🤣", "allybutler19": "@breeee22 😂😂😂", "pinkbarbiedoll33": "Hahaha I can so relate ! ;-)", "allira.potter": "@curvysam Le tan uber dark 💁🏾 I use that ....Yes I tan hahaha", "lizzylove89": "Bondi sands! And they also have a back applicator but if you don’t have that, grab your wooden spoon from kitchen, pop your tan mitt over it, secure with an elastic band & away you go 🙃"}