{"savvy_styler": "I love that I always want more from life and am always striving for more (a good competition for a voucher!! @haylesmumma )", "biancajwood": "I love that for 10 continuous years (ages 20 to 30 😨) my body grew and fed 4 healthy, happy, spirited babies @maybs_wood", "daniarmstrong": "I love my eyes! @jnel_m", "tarynkjames": "Fierce loyalty and ability to forgive also I’m hilarious just ask @shugajag 😂", "the_balanced_mumma_": "I love that no matter what, I keep going. I don’t ever give up! @elle_ethan_25", "mrsjomets": "I love the way that even in really crappy situations I can always find the positive @allanmets", "_deeeeeeeeeee_": "I love that I'm unique in everyway 😍 @bryonielynnette", "rain.drops.on.roses_": "Its a struggle to find something but today its my boobs @missjaney69 🤗", "lisarockstar": "@sadie_beatrice", "ashton483": "I love my smile @alexiemeiners", "freerange_mum": "I love that im a chatterbox and meet so many people when i go out @genzenyogaau", "emma.marie.82": "@cameron.skye you love a cute dress xxx", "2012katg": "I love that I believe in myself, and I love that my body is one of a kind @curvysam 💃", "mrs_mummamac": "I love my ability to bring people together and the fact I can read peoples emotions and can know when to support them. I love that I can laugh at myself and embrace my post baby weight 🤣🤣 @lansellis", "teka_anne": "I love my stretch marks! I know that sounds odd, but each of them tells a story. I've fluctuated something shocking when it comes to weight my whole life and I've carried and birthed two beautiful healthy babies and each time I've gained a little reminder on my belly. I'm not confident enough to show the world but they are mine, for me. For the first time in my life im proud of my stripes 💕 @emilymary92 - your turn!", "saras_happiness": "I love that I have found and made fantastic friends, who are there for and I for them. @joannesteiner74", "paloutu": "I love my ability to make up songs about anything and proudly sing them! So do my kids 😂. @amostunlikelyrunner", "that.tekkie": "I love my determination to keep going when the odds are against me. I won't accept no, and I'll keep going no matter what happens, to ensure that I can live my best life. @bertconner You might like this!", "curvysam": "☀️☀️ entries closed ☀️☀️", "hello.sparkle": "I love my eyes the most. I share the same colored eyes with all 3 of my children and when I look at them I always see a piece of me which I love 💗 @leamaree", "kitcheningabout": "I love that I am perfectly imperfect and that I am unique @theinnerproduct", "maddi.pa": "@nicole_irenee @moni.royds @diamondgirl_241", "laurenwoodzy": "I love my quirkiness and positivity! I started teaching this year, and I think without those two things, my job would be so much harder 😂 @jessicajune2511", "sarinabentley": "I love that i am always honest and love my friends and family❤😊 @skyezy90", "liss_doughty": "@curvysam I love how confident I am in my own skin! I always dress up and im never embarrassed of looking fab in plus size fashion! I am curvy and bold and I embrace every part of it! I love fashion and I love making it work on my curvy bod xx @jesspacquola", "tash_craig": "@tara__lea enter cause you might win a free dress 😙", "tara__lea": "I love my curves! @tash_craig i love you too. 😘", "katie_parrott": "I love my resilience, and ability to pick myself up after any setback! @ms.alice.armitage", "sweetstarsky": "@basfordbarbara I love my hair", "amy_jarvis21": "@canberra_modern I’m a great friend and a good listener. I’m still working on my body confidence, but I am loving the sense of style I’ve developed since stepping out of my basics and plain colours and embracing new shapes - all since becoming addicted to @littlepartydress", "kittynbug": "My resilience", "nattieg19": "I love my growing confidence I have in my body shape after having kids. I am a completely different shape now but have way more confidence in how I look compared to when I was a couple of sizes smaller!", "hozwaa": "@kg_8619", "nikki_bunch": "@_breezza I love that we both grew tiny humans inside us and that our girls will love each other as much as we do!! I love my sense of humour, my eyes and my boobs 😜😜", "behindthecounter_int": "This looks insane!", "katurtle23": "I love my eyes, which change colour (seemingly randomly) between green and blue. @abbylou__xo", "abbylou__xo": "I love my dimples, after lots of years of hiding them, I've finally realised they are me! @katurtle23", "meg_s_moore": "Some days I love me, some days I don’t.. I’m a women, we’re up and down! 🤷🏼‍♀️♥️@jessemma82", "ashlysaght": "I love that my body was able to carry my son for 9 months and now I have a healthy three month old! Although it’s now worse for wear it’s worth it a thousand times over 💙 @__emellisse", "bec_brougham_": "A cury figure, all my @littlepartydress fit perfectly 😍", "littlemoodesigns": "I love my caring nature. 💜 @twirlgirlboutique you need this dress 👋", "finch.s": "@jogging_jane I love my hair! Just switched up my haircut and took a bit of time to get used to but now I'm loving it 💁🤗😍", "belerina_s": "Just purchased this dress last night after seeing your pic! Looks gorgeous on you!! ❤️", "laureneshelley": "I love my empathy 💞 @nicshelley_schoonzie", "emlouiseduncan": "I love that I'm an independent women!!! @isabelheighway", "mummaslove4fashion": "Looking gorgeous in that LPD and It may have taken 48 years but I decided to Love myself 💖", "onuntillmorning": "I’m hilarious @janellw22", "erinkathleen88": "@ellie_mcphillips I’m the same as you (but NOT my legs 🤦🏼‍♀️) my smile, sense of humour and the fact that my body helped me become a mum ❤️ (oh, and my boobs 😜)", "rachaelalexandra89": "I love that I'm starting to accept my curves and just love and be kind to me! @lyssey_c 💕", "jaydes_hair": "Just beautiful reading all of these!! I love my smile. Day or night, rain hail or shine I have the ability to smile 😊", "laruba24": "I love being a redhead. I tag @rachaelalexandra89. Let’s win a dress! 😍", "ksmilie": "I love my dark, sick sense of humour and that some of my friends have it too hey @kyliemareee", "uandme_plusourlil3": "I've lost almost 20 kilos and I'm feeling super proud of myself atm 😊😊 I also love how @littlepartydress caters for every beautiful women for upto date style , fashion and affordability 😍😍", "billiejo_best": "I love my smile 😆 @hodgettsclaire you’re up x", "thevennom": "I love my muscular (facial) cheeks from a life full of smiles and laughter, and my ability to get stuff done NOT at the very last minute (anymore lol) 😆😏☺️ @aashell", "bex_wescombe": "My skin. I've never had acne. Winning. @nattygon", "liz_kubes": "I love that I have just survived the toughest 10 days being diagnosed with breast cancer at 46 in both sides and proud I got through surgery yesterday with hardly a tear. Also amazed at the support from my tribe 💛 @loudit", "snepal123": "I love my thirst for life, to live it to the fullest. I like the work I put in to change my mindset and to acquire confidence. @me_barsha", "dontsmilebeforeeaster": "I like my eyebrows - and now they’re in fashion which is convenient for someone so lazy 😂 @sarahantoniaz", "plussizeitaly": "Ciao, ho creato questa pagina per tutte le ragazze plus size ITALIANE (compresa io sono una taglia forte ahah) voglio semplicemente condividere con tutte le altre ragazze come me e non ovviamente, esperienze, pensieri consigli di shopping di make-up tutto qui, se magari puoi aiutarmi a farmi 'notare' io sarei davvero molto contenta, grazie mille se lo farai! 🌹❤️✨", "just_simply_shannon": "I love that the older i am getting I am realising how important it is to love yourself and CARE for yourself #cantpourfromanemptycup @kl_ink", "tashmoxey": "I love how my life has changed in so many ways, single mum, home owner, life @teaganyo", "merrollee": "Great dress @guesswhoerrol", "mcgeemariqua": "I love that I waa able to create & house an absolutely amazing bubba. So enthralled with what my body can do! Not to mention how awesome it would look in this dress! (& how poor I am being on maternity leave) 😍 @paige_deanne", "shannon_lindsay": "I love that I've started to feel comfortable in my own skin and I don't worry about how I look (mostly). It's a work in progress, but I'm getting there! @stephgrenda", "orlypops": "I love my hair! And @donnadinkin ‘s is pretty spesh too 💁🏼‍♀️💁🏻‍♀️", "beejay84": "I love my ability to spend my pay before it even hits my account!! #onlineshopping 💕 @lady_and_a_cat", "educationwithkaitlyn": "I love that I’ve devoted my life to be an educator! I am two weeks away from completing my final ATP placement and I can’t wait to have my own classroom! ✨❤️", "_._.toes._._": "I love that I had a passion for drawing and not many people know. @tashmoxey", "lunar_eclipse2018": "@krysta_le", "flamingulous": "I love that I keep it real all the time, that I’m sweet with being the warp when everyone is weft @ang.nic1", "thisislizbit": "I love that I’m a great teacher. My “kids” still come to visit my classroom when they are seniors and I know I’ve made a massive difference in lots of their lives ❤️", "mysimpliciouslife": "I love that I love my freckles because I know my daughter will love her freckles too 💕💕 @bec_brougham_ ... you would love @littlepartydress. I love their designs 😍", "lauren.hosking87": "@k_and_r_adventures", "em_moule": "My blue eyes. @bexselkirk", "heyzamy": "I love that im a caring person who likes to make other people happy from organising a surprise party to checking in on how someones day is going. @michellesegedin", "h0llie_x0x": "I love how strong and capable my body has become 💕🏆💪 @k4te_drumm0nd x", "mymonkeysandmoi": "@raising_my_roses_", "kindfulbodymind": "I love that I’m resilient, strong and powerful! Woo! 💪💕 Your turn @shannon_lindsay ... LPD 😍😍", "emilya.smith25": "I love that I’m theatrical and a little bit weird. It makes me unique @lynchberry94", "justaddvodka": "Cute!!!", "sara_wiggz": "I love that I always try my best to be a happy and positive person with my friends even when I’m not feeling it 🤗😏💕@bettscooper", "kelpie91": "I love my quirkiness and sense of style and love how LPD has such fun prints to play with. Don’t mind my back on a good day either haha. @chelsea.todd @leaahrara", "courtycourty": "I love my independence and endurance through this shitty year -2 major injuries in 6 months, one requiring surgery but I'm still chugging along even though none of my plans for 2018 have happened yet haha thankgod for amazing friends and family support ❤ @lucymaree13", "bubblykarina": "@katmiller15", "magicalworldofhannah": "I love that I always stay open minded and that I can appreciate Mother Nature fully. @clancollective I'm tagging you Claire!! LPD is run by a local Sydney gal and it's a super inclusive space !", "jayfol": "I love my newly found confidence in myself and I love my friends that supported me to get here @rubywoj", "ellie_mcphillips": "@nikki_bunch I like my legs, my sense of humour and the fact that our bodies grew humans!!!!", "salmrideout": "As a mum of new born twins and 2 others, I love I had a shower today. @kristie_mountcastle 😘", "kirstymonssen": "I love that your competition closes on my birthday.....🎂@erin.monssen", "kathrynca1n": "I love my smarts 🧠. But i also love a pretty dress!", "cupcakessunshinencoffee": "I love that I can always find the good in everyone and I love that I am not afraid to compliment a random stranger! @gabcatalyst", "_nicolelake": "I love my toes 😏", "reneesimone28": "I love my baby girl for choosing me to be her mum. ❤❤ @basicbitchsophie", "tashiepoopoo": "I love my creative brain. It helps me master so many things, from putting together the perfect outfit, to making costumes and fun things for my 2 boys, to being handy with all that is crafty-even establishing a tiny handmade business out of it, to being able to think of and locate the PERFECT gifts for my friends and loved ones. @rach1133", "72pauline7272": "I'm going to say it. I LOVE my boobs!! For a 46 year old, they are perfectly perky🤪🤪🤪 and if I have a chance to show them off, I do ( but those moments are few and far between these days)... @chelsea.rickard", "meagancashion": "My legs and the girls 😉 @gemmatriffitt", "kirsten.ashby": "@andreaallendorf I love my ability to be able to handle any challenge or obstacle that is thrown at me! I would love the $70 to buy a new dress to start my new job as a primary school teacher in July 🙊😍🤞🏼", "sallza_": "I love that I can now see my worth and it has nothing to do with how I look or what I weight. Now that I'm free from that crap I love wearing fun, fab clothes on my fantastically fat bod 😊💜", "joeyhaes": "Love this pic, great back drop too xx", "veronica.and.family": "I love that I am willing to fight for what I have and want. @jess_embray", "koolkatkp93": "Love this and all this Instagram love! I love my legs and smile- lots of other things are working progress ❤❤❤ @t_a_s_h_a13", "jocelynseip": "@hotlinebrit love my brows tbh 👌🏻", "kellyeas": "I have the ability to find the perfect accessory for any outfit!! @chloe_eas", "carmen.gatfield": "Ability wear any earrings I want thanks to @kenziecollective", "kerryphotos": "I love that I’m raising 3 beautiful humans with love, joy, compassion and fun!", "tshay02": "I love that I've started to love myself more and not be worried as much about what others think of me and to step out of my comfort zone more often. I also love that I taught myself to crochet. @boliver5463", "laurens_lil_learners": "I love my eyes 👀 🤞🏼🤞🏼 @caroltribolet", "what_brooke_wore": "Looking gorgeous Sam!", "theretromumma": "👯‍♀️I 💖 @littlepartydress 👯‍♀️ @bec__foley", "rosie4850": "You look gorgeous & quietly confident! I have so many positive things I like about my body, it housed my greatest gift- my son. My tummy and hips carried the most beautiful boy. Now LPD helps me honour those curves with beautiful dresses that celebrate me being a curvy fabulous woman!", "lisa___king": "I love that i have a positive outlook on most things in life, she’ll be right! @ducky_feet_", "mazzybstar": "I love that I feel content with where my life is heading @shelleg21", "the.wolfpack.and.us": "I love tht I dnt go with what everyone else is doing and I always keep true to myself no matter what other people think or say x. @maddielovinglife", "tamariane": "I love that no matter how many times I fail, I still try and succeed no matter how many times I fail. @sparkles_and_milo", "mirandas_world": "I love that I’m finally finding the courage to love my body for all that it is, especially after having 2 children. @rini_tee 😁", "noodlehousen": "I love that as I've grown to love my body, I don't just one or two things about me (my hair, or my nose or even my ankles), I just love me. @kitten_mineow", "laurahawk_": "I love my party side just like my bff @mrsbecblake - put us in a situation to meet new people, have a laugh, with a wine in hand and we are unstoppable!", "missj.loves.reading": "I love my kindness and warmth, and my smile for something physical! @miss.ottewell", "my_crazyclassroom": "I love that people always feel like they can talk to me. I seem to have a face that people want to ask advice from or even strangers in the shops asking for directions. @em555", "bec__foley": "@theretromumma LOVE IT! Love that my friends make me smile so much... don’t mind my boobs either 🤪@curvysam", "kellyparty": "Love this Sam! I’m a fan of my legs, and my ability to laugh during the shitty times!", "sjmor1": "@bubblelanesoap", "ashleysmeg": "I love that after having two kids I have finally learned to love my amazing body just the way it is. @nlw1007", "em_kate_plus_one": "I love that I’m finally stepping out of my comfort zone and going back to school. Showing my daughter mums are able to do it all. @krystle._.w", "casey_erinnn": "I love my red hair! @hannahbrowne95", "coads": "I love that I know when I’m in a bad mood or am having a rough time and that I know all I need is my bestie @spanninacan to talk some sense in to me 😘", "stylebylauraaustralia": "Fabbbb dress 💙💙", "toni_w14": "I love that after having my first child, I can still look at my self and love all of me - I know I have created a beautiful little human 😍", "annelisekate__": "I love that I have so many knee scars that show my journey and strength. @amandalfo you’d love these dresses!", "ollysdownunder": "@bekyoung I love that I continue to grow and learn and give and love even as I head toward my 60’s. I love that I have survived cancer, twice, and overcome contemplating suicide. I love life, God, my husband, my kids, my grandkids and myself. I LOVE MYSELF, wow!", "amandaleeess": "@theowenologist", "emt_86": "I LOVE this dress!! I love that I'm a good mummy to my two beautiful girls. @pipsta89", "overtherainbowimages": "I love that I'm a positive, happy person", "em_2111": "I love my dimples that I got from my mumma @wendysquires would love to win a LPD! 😍", "stayclassyclassrooms": "I love that I have strength to keep going everyday with what needs to be done for my family.. and I’m loving on my curly hair again 💁🏼‍♀️ @mummy_mumma_muffin you should definitely enter 💜", "thewaltzingmoose": "@ollysdownunder", "vulcanella": "@caffeineinduced - something I'm good at is kicking ass at the Aldi checkout lol that shit can be intense!", "tashybo": "I love my resilience, independence and compassion for others. I like my eyes 👀 @tl_wiradjuri", "xoastridleexo": "I love how much stronger I’ve become through recovering from a serious injury... mentally and physically... I can see the light ✨ this goes for you too @pucpat", "cmareeeeee": "I love that I am emotional and that I lead my relationships by the way that I feel about things. My relationship with myself importantly is lead by how I feel. I allow myself to feel different things and I am tune with my feelings and those around me ♥️♥️♥️", "jordan.murrill": "@taylahmurrill1 😍😍😍", "breanne83": "I love that I have learnt to be myself ... the good the bad and the ugly !! @ktorrisi80", "nicksta_moves": "I love that I’m not afraid to stand up for what I believe in. I lived in the shadows for far too many years 💫", "crazyclaire": "A feature my 3 yo loves to tell about all the time its my fat tummy 🤔 @recall500", "misschloenelms": "I love that my default reaction is to smile. Of course it’s okay to not feel like smiling, but even when I’m down, I just can’t help but crack a grin. It can get annoying. The whole resting bitch fave photo look just DOES NOT work for me. I just can’t. Hopefully the smile brings a bit of joy to someone who passes it. @wanderlust_danni91", "georgiaaaa_smith": "I love that I'm able to push myself past limits I thought were impossible to even get to. @shaunashauna_", "motinuss": "That dress!!😍😍😍😍", "littlepartydress": "Beautiful darling!!!! 🖤🌹", "merrinjp": "@rafael_ynwa", "jodiyoung74": "I love that I love. Its simple I love alot, I love hard and I love fast. If you are in my circle, then I love you. @kel.stephens", "curvycartel": "Love it babe, @littlepartydress always delivers 💟", "abby3728": "Would love to try something from @littlepartydress what about you @ellybaker12??"}