{"configuring_christianna": "I definitely invested in the car dress, so bloody cute! 😻", "curvycartel": "There is a @gormanclothing Opening at Chermside soon, super Excited! 🙌🏻💟", "living.countryside": "I love colour and @gormanclothing is my goto but only the oversized dresses - love the pants - might have to try them! I’ve also had success with the smock styles from @obusclothing 💖", "photographermarina": "Green pants and colourful t-shirt look amazing on you! 😍", "kristyleecrocker": "@curvysam Hi!! What size are you wearing in the navy dress please Sam? 🙏 xx", "kyserstuhl": "I love pic no. 8 on you or second to last in the stream of photos. The colours look amazing! Can I please ask where you got your heels from? Love them! 💕", "miss_little_monkey": "Love it 👍🏻!", "kellihennessey": "@curvysam love the green pants, I saw them online at Gorman but just thought nahhh. I’m a 16. They look comfy and fun 💋", "jaydabeau": "Looking stunning queen", "just_me_klee_": "You have the best legs!!!!!", "alexdmiley": "Wow , thats a pretty cool post! 🤗 🤣", "tenelle88": "Holy shit I love the first one! 😍😍😍😍", "missa_g": "Where are your sandals from? They’re cute!", "shamelesscurveloi": "Love this dress I remember when I was in college", "ollypolly19": "Thanks for this post!", "betal": "@japansunshine", "laurenboase": "All are gorgeous but goodness I love the first one!!", "lizzy_lou88": "BEAUTIFUL", "lebusteaustralia": "I must have no.1 and the second last outfit! Loving the prints", "lozzymichelle": "Saw you on @thecurvycon insta story 😊", "all_sizes_are_beautiful": "Wow you look so pretty 😍", "the.wolfpack.and.us": "What size did u get in the first pic? I love it", "rochellemara": "Love that first dress! You look amazing in them all!", "brisbanista": "I love the first one.", "daniarmstrong": "That first dress is just gorgeous!!", "dave_gone_somewhere": "1st flower one and flower one with blue wall my fav!", "jenniferatilemile": "Yes! What I’ve learned is you just need to try!! These look fab on you 💖", "sparkle_spince": "First one", "ahhchah": "The cat dress!!!!!!!!", "pivalasvegas": "Green pants and colourful top FTW! Hope you bought!", "thisisashrose": "Loving these pieces. Never thought to even shop @gormanclothing actually!", "raisingmcbabes": "@xbrookeyx love thoA little drrss", "thetillieproject": "I looooove the cat dress", "samdraws": "Oh I love that cat dress! ❤️", "simoneellen85": "Love them all! Thanks for sharing x", "_._.toes._._": "In love with the two piece!!!", "jessiebell_k": "Those green pants 🙌🏻🙌🏻🙌🏻", "nady_sparkle": "This is so lovely I love the brand but didn’t think would fit my size 20 bod! Just shows how we buy into ideas of what we can and can’t do size wise!", "stace_mcgregs": "Is that a tee in the green pants shot?", "deirdrekenny29": "This dress is gorgeous on you x", "stephiepeffie": "Bless your cotton socks! I've been too nervous to try these dresses on but I will definitely give it a go now.. thanks for sharing, you look great 👌🤗💜 @curvysam", "confessions_of_a_gcup": "Oh my gosh!! The first and second last dressed on you are just devine Sam!"}