{"72pauline7272": "❤ the dress!", "curvycartel": "I love this cut on you babe! The print is everything 💟", "stylebylauraaustralia": "Beautiful babe!!!!!", "tarynkjames": "@curvysam ❤️👌", "miss_little_monkey": "You look great. That is so good to know. I’ve only ever bought their shoes because I always felt too embarrassed to even look at the clothes 🙂.", "just_me_klee_": "Oh I lovvvve this pic of you!!!!!! You look bloody fab!!!! 😍😍😍", "jacinta_vb": "Great that they had stuff to fit & it’s a fab dress which looks awesome on you but... does it not illustrate the huge issue with have with sizing?", "kmonitrain": "@curvysam 🙌🏻🙌🏻 THANK YOU for this post!! I have always been too afraid to shop at Gorman but you may have just given me hope. From one curvy girl to another, thank you! 🙏🏻😘", "michellejades": "Awesome pic!", "____lauraorder": "Sam it was SO lovely to help you in store!! Joyous customers like you are the reason I love my job so much. You look INCREDIBLE! 💕💕💕", "my.colourful.life": "@alanabrown19 I think you should get the cat dress for work 😂 I want it but have no where to wear it!", "delphiejoy": "You look amazing in this dress!!", "kellieanne": "Once you buy one gorman it never stops 😜 the beach dress is also a loose fit", "katejmurray": "@lizmurray1 you should follow this chick for her dress recommendations and happy vibes! Do you like the cat dress? Xx", "sovkhi": "It was such a pleasure to have someone so excited to get into some fabulous Gorman pieces! Sam you look amazing!! Definitely come back and see us at Gorman Carindale! 🖤🖤", "mccowcow": "@sarahjaneduff", "brongenator5000": "@curvysam and this is why I love @gormanclothing too. I’m a 16-18 with G cup breasts so finding dresses is challenging. I can luck out on some of their dresses and that makes me so happy! You look gorgeous in it!", "kat.ward_123": "This is great to know...im always too scared to step into non curvy shops just in case i have another shop assistant tell me that nothing here will fit you 🙄", "smallprintdesign": "Ohhh my goodness. I LOVE this! Totally going looking!", "louise_polidano": "I’m curious to know why they’re not labeled to their correct size ? 🤔🙈😬 doesn’t say much for their integrity 😞", "inner.monroe": "I la-la-love that daisy print 😍", "tammysoffices": "Love bed the daisy dress not so much the other. As larger woman (larger than you) I’ve always shied away from big prints but that bold print looks really beautiful on you!💕", "steelemystyle": "So gorgeous x thanks for sharing your individuality with my#spotmystyle #realstreetstyle xx 😘", "nikka4615": "😍😍😍", "joeyhaes": "I’ve always wanted to try Gorman 💜❤️", "katherinebykatherine": "Beautiful!!!!", "nicolettamou": "I legit just bought the flower dress! So pretty and looks fab on you!", "bec.smith.stylist": "Such a cute print 🏵", "becizzle_": "Love this dress! Looks amazing on you!", "katelukephotography": "You look hot! Love gorman!", "emmylouwho": "@soph_jane", "melblackhen": "What a great review. I have often walked past the store at carindale. Thanks for posting, will definitely have a look next time. I agree - bold and bright is the way to go.", "jessieclaire88": "I love that dress with the hat!", "bankyanks": "Interesting you say about the Carindale store! Because it’s so small I’ve never been in there assuming they would have a big variety. Will have to try!", "anjil_girl": "Looks so lovely on you!", "victoria_stag": "@cuvrysam. You look so great! This is our next dress 😘", "lisslings": "So pretty", "melaniesjoyce": "@curvysam are they cats on the second dress? It’s lovely", "panda151705": "Good to know 🙌 you look lovely.", "juzsavage": "Gorman looks great on you x", "confessions_of_a_gcup": "Such a flattering style on you Sam!", "dawnlucia19": "Love it!", "onuntillmorning": "I have lots of Gorman pieces in a 12 and 14. I’m also an 18-20! Sizes are crap.", "heatomojito": "Cute!! 😍", "lausie_jayne": "LOVE that dress!!", "daniarmstrong": "I never thought that Gorman would fit me. You look sensational Sam!!", "chelseeaoh": "Ahhh I’m so happy seeing this, I’ve been lusting after there stuff forever", "rochellemara": "Thank you for posting- I’ve been too nervous to try but might now!", "nooshjewellery": "You look gorgeous!!!!!!!!! 🤗🤗🤗", "emperry__": "Omg this is amazing!! All the colour!!! 💜💜", "whoot_whoot_designs": "Oh I didn’t realise their clothes would fit me either!! Uh oh dangerous realisation!! Thanks lovely!", "kaitxiv": "Thanks for posting - so good to know!"}