{"bodyconfidencesociety": "You look wonderful Sam! T-shirt dresses are the best 😍😍", "jacinta_vb": "I love a t-shirt dress. Lived in them last summer - had 3 on rotation. Best add another into the mix 😍", "jennaboucher9": "Yas! I just ordered this on Friday ! Love it on you 💜", "thisisldizzle": "T-shirt dresses are the best!!", "serpenteve": "i love it! though i sew dresses like this one myself, they are relatively easy. being plus size in russia is tough 😅", "curvysam": "@rachelgeebee this might be good for you? And it’s jersey 😉", "jen.mutter": "The best dress for travelling and layering, I have several 💜", "stylebylauraaustralia": "Hot babe", "mustangsallytwo": "Absolutely love a good t-shirt dress! Comfy but cute", "fashionschlub": "SO GOOD", "agelessandcurvaceous": "❤️the shoes! 🤣I relate to the boob veranda🤣! Cute earrings too.", "temmaperry": "Love this dress!!! Looking good gorgeous x", "mummy2v": "I love this! Out of Interest, as I rarely buy online due to sizing, are you usually a size 20? Or have you gone up a size? @curvysam", "akoiadesign": "Babin’! Love T-shirt dresses... just need to find a good one! Will check these guys out x", "jaydabeau": "Fab babe 😍", "jessica.baggins": "Do you have the other colours? I'm keen to try but worried about my gunt 🙊🤣", "birdsnestonline": "We are loving the way you styled this dress!💕😍", "all_sizes_are_beautiful": "Amazing 😍👑", "pammybcakes": "I want one", "just_wingin.it": "I have this and the striped version, love them", "cassandra.scout.mellow": "Rocking it 😎can we get you featured in our brand hotmiamishades ? check my page link and submit the form so we can send you some items 💖", "ahhchah": "Hahahaha I call mine a “boob shelf” but veranda is gonna have to be my new go to 😂", "rochellemara": "I like the sleeves! You’re so obvs not in Melbourne!", "missboi": "Oh yeah Babes.. I’m feeling the T-SHirt Dress 👌🏼👌🏼Me thinks BMorgs needs one in her life pls!", "fairls": "Yaaaaaas! 🙌🏼 best.", "kattss02": "Haha boob verandah! My friends time how long until I drop something on mine. I think I need new friends 😂", "curvycartel": "Classic cut, great length, love that colour on you! 💟", "stace_mcgregs": "I love Tshirt dress. With sneakers on a weekend or heels and a blazer for work. So versatile 💜", "itskatejanmaree": "Love a t shirt dress 👏🏻this style looks so comfy on you girl! 😍", "la_fringe_da_minge": "Omg, T-shirt dresses are my go to outfit. Love them for all the same reasons you do!! 😂😂", "emperry__": "Love that cut, it's so versatile! I think I need to get myself one of these!", "nonairbrushedme": "The best kinda outfits are the ones you can just chuck on and wear them anywhere", "natopialeggings": "Yes! And leggings! (Although I am in Melbourne) 😂", "biancajwood": "Gorgeous! Have been wondering about their dresses, thanks for the review 😊", "miss_sally_b": "So cute! I need more dresses in my life!", "daniarmstrong": "Oh I love it!! I am always worried I will find tee shirt dresses too clingy or short. Thanks for the tip 😘"}