{"nicolelj76": "This was really good. I really liked you in the black pants. Think it’s the first time I’ve seen you wear pants. 😍", "wellingtondany": "Boohoo togs are terrrrible, I’ve returned about 5-6 pits, all too short in the torso. I agree, don’t know who they’re sizing them on. I’ve ordered those lemon shorts for myself, totally guessed on the size front!", "thebargainstyler_": "Oh yes!!!! Need to watch this", "bythejess": "Love the strippy skirt, hate boohoo sizing. Howd you find the sizing?", "howdystrangers": "This is awesome Sam. I’ve just discovered these kinds of videos and it’s helped me with online shopping so much! And the shade was totes justified, it really makes me angry that this model is like an AU 12/14 and consider d a ‘plus’ model.", "meandolive": "Omg I just watched the vid and you crack me up! 😂 Thanks for being so honest ❤️ Gus is gorgeous too", "confessions_of_a_gcup": "I love this video!!!", "72pauline7272": "Such inconsistencies with sizing makes it hard to purchase online 😟", "candace.scanlan": "Loved watching this 💗", "_._.toes._._": "These are best! It makes me really think about the other options there are out there I use to seriously be only CC girl. And everyone’s wearing the same bloody thing cause there isn’t anything really else. Now I know there’s a whole world out there in curve ranges and that you should love you body as it is. Where what you want and know where to look!", "ot3577": "Gorgeous, continue what you do best", "lizs": "Boo hoo is sooo unreliable 😩", "louisetaylor48": "Boohoo, my god, they’re so inconsistent in sizing!", "styleandspace": "@ashleighpatrice", "tallarajade": "Loved it 🙌🏽 I also loooove the sequin dress, where is that one from 😍", "themissbeth": "@jessica_l_payne 😍", "gillydevine": "@beckdevine", "pinkbarbiedoll33": "I NEED that sequin dress !!!! 😍😍😍😍😍,You look amazing!!!! ❤️❤️❤️😘🤗", "alanaaarose": "@gabbriiellaa_", "shand87": "Boohoo is such hit or miss but at least they cater for plus size", "ashlopashlo": "I want that sequin dress!!!!!! I think it’ll look good against my dark skin.", "shezzwah": "@shellybums", "fleurdarling": "I love it!", "carolynoliver19": "Oh I wish I had spotted that pink jumper before I placed my boohoo order 🤦🏻‍♀️", "naybsy": "@parkez1980", "itspernillla": "Love this!! I have a weird body and am just about giving up on shopping 🤔", "nattymura": "Love this. Boohoo is always hit and miss so its good to see someone honestly review the plus range.", "ahhchah": "You and I have very similar body types and I always seem to buy something from your hauls.... it feels very stalker-y 😂😂😂😂😂", "rochellemara": "I love your reviews! The lemon shorts are really cute! PS as a 5’3 chick you are tall!!!!", "thesubtlemummy": "I want that mermaid dress", "luscious_lanyards_by_chloe": "Love it", "sjmor1": "Love your haul videos so much! Would love you to do an @allyfashion one for their new plus size range", "livvyrae_b": "Yes! Love this!! Slay girl slay! 😍", "emmalhambleton": "Lmao I feel this, being a slim curve model who is asked to shoot for brands like City Chic where I am barely an XS 🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "jordan.murrill": "I love this 😘🙌🏻", "thepiquantfox": "Great vid, I just watched it over on YouTube :) Love your authenticity, style choices and GUS!", "belleishy": "I just laughed so much at less sexy leg and more vagina 😂 particularly love the spot trousers on you"}