{"inmyjoi": "Gorgeous Sam!!! 💕", "thesimpleglamazon": "You look amazing! And you have an awesome message.", "styledbyreah": "I totally agree! Life is too short to not embrace every single part of it!", "elwio76": "Thanks for the message xx", "jennifer.buckingham": "Gorgeous 💖", "i.am.katie.louise": "Could not agree more! X", "thebiggerblog": "💕💕💕", "thedavens": "New subscriber, and love your message!", "confessions_of_a_gcup": "One thing that comes across in each of these photos is how happy and comfortable you look. In the wise words of eddy murphy - damn I look good ☺️😂", "katesyogini": "Glorious. I hope the world will one day embrace your very important message!!! 🙌🏽💕", "lajoieskin": "Beautiful 💖", "chelseeaoh": "♥️", "activetruth": "🙌🏼👏🏼", "caatherinehq": "I believe the change is happening.... finally. It's an amazing transition to see - fabulous women, like you and @authemmie, are helping other women feel and share their beautiful selves. 💖💖💖", "joeyhaes": "(In this photo I mean. Obviously you still look like your gorgeous self always) I live the message you are putting out there xxx", "burleighwagon": "Yes I love this !!! Do not miss out with your kids at the beach ! Embrace you now 😍🙌", "swimsuitsforall\nVerified": "Verified", "axilswim": "Beauty!💕", "zoelouiselondon": "Beautiful ❤️", "angejh71": "You look gorgeous @curvysam ♥️", "manfattan": "Your a whole vibe in this shot!", "justaddvodka": "🙌🌞", "mademoisellestevie": "You look beautiful! Such an inspiration!!", "zarc_clothing": "Amen Sam!!! 💗🙌👊🏻 we all come in different shapes and sizes, live life and be happy!!!", "hayleywelkmua": "Beautiful woman, beautiful message 💖", "kasey.rainbow": "So gorgeous ❤️", "tamara1979": "Just gorgeous girl! X", "ccloudvillage": "Those are some stunning photos of a beautiful lady! 😍 x", "infilou": "Omg so many beautiful photos 😍 you rock every single one of those looks. Gorgeous 💖", "lovelyinla": "Love this!! And so very true!!!", "stylepluscurves": "Loving the message here! So important to love and appreciate the body you have right now and not miss out on your life!", "curvygirltravels": "Great message 🙌❤", "authemmie": "Yes! I think progress is being made", "kirsty_zak": "Absolutely stunning @curvysam 💕💕", "erinboorer": "Your so gorgeous, I wish I had the confidence you have. You show me that it’s possible. @curvysam", "emt_86": "Gorgeous photos! Thank you for sending such an important message xx", "sezzrobbo": "Beautiful and such an inspiration 💖", "fleurdarling": "I love this and agree wholeheartedly. Thanks for the work you do!", "rochellemara": "All beautiful photos- thank you for sharing everything as you have. Is one of those in Budapest?", "katie_parrott": "Love this Sam 😘😘", "pinkbarbiedoll33": "You look fantastic!!! 🙌🙌🙌❤️❤️❤️, Sadly I STILL go to the beach each summer and look at all the skinny chicks and feel so sad like I don't belong there and I swim in black leggings to cover up my entire legs and wear a singlet top etc,I still won't be seen dead in bathers,😭😭,people are so judgemental and sadly at my beaches everyone is a size 10 or smaller 😭,xx", "dandizzle1": "You look amazing, confident and that equals happiness and health.", "kyserstuhl": "Love the Moroccan style bathers are they an old old season bathers? They are fun! 🧜‍♀️ @curvysam", "busty_diaries": "And THAT is why I follow you! Thank you for all you do.", "cjtemps": "💪🏼💪🏼💪🏼 Thanks so much for being this person! I love following you 💖💖", "imogenw": "Beautiful", "plussizeclothingco": "YES!! 🙌🏻 Love this and thank you for leading the way and inspiring women to love themselves in what is (generally) a false and damaging social media landscape. Your real beauty shines through 💕", "shannon.louise__": "You are a goddess Sam!"}