{"deelocbreegok": "Where is that black swim suit from", "emz_extra": "I just watched it. Amazing!!!", "michyall77": "I loved it. Watched it with my 13 and 15 year old sons. Trying to teach them everyone is worthy of love and support", "samanthajoanmary": "It was so good!!", "scrapknack": "“That’s my girl” 💜💜 I have been with my partner since high school, 32 years together. Many familiar memories for me 💙💕💙", "bnvw123": "I literally cried through this whole movie because I relate so much to her. I’m a big girl and I feel the same way she did in that movie.", "dsaarikko": "Watched it this morning - so great!", "justaddvodka": "Love it🐣", "mademoisellestevie": "So cute. Need to watch it!", "confessions_of_a_gcup": "I love this! I need to watch this movie", "joeyhaes": "Just watched this- it was lovely ❤️❤️", "wendinthewillow": "Such a fab movie 🍿", "jocullenlander": "I love this pic! Loved the movie too", "thesubtlemummy": "I watched that last night!!", "renaelcoote": "Just watched this on your recommendation - really sweet movie", "lizphoto": "Love yah and miss yah, gurrrrrl💕✨ good memories! 🌊", "plutoheights": "Stay Blessed", "mama_izzie": "Go head ladies", "hoolacollective": "Sounds like I need to watch this movie asap!", "alliandsimon": "Just watched this movie this week! Loved everything about it!", "sandiicook": "Agree Agree Agree - loved Dumplin’ too - that gummi bear floaty is super cute and my 2 daughters want them!! 💕🥳", "leeeash_x": "Amazing! The movie made me cry! Where are the swimmers from ? Love them 🙌🏼", "leannezimmermann": "Such a fabulous shot of sexiness 🖤", "kaitlin_j90": "Such a good movie! I watched it last night", "tinacrack": "Watched this movie over the weekend, it was so cute!", "littlemisslady_csarkid": "Ma and I are literally watching Dumplin right now and I thought it the second i saw this photo. amazing!!", "beautifullyfkedup": "@curvysam Dumplin was a great movie 👍 but I shed A LOT of of tears during it, it cut just a little too close to the bone for me 😭", "shellannew": "Omg I watched this the other night and was going to say you need to watch it. I balled the entire film. 🤦🏼‍♀️ it was so beautiful and honest.", "jammmiejam": "I watched this today too, I was on the verge of tears the entire movie 💕", "wavilov": "I just watched this on a plane, quietly trying to wipe away the tears rolling down my face - loved it", "beachyjessxx": "I watched it over the weekend! Love the accent!", "nooralhuda__": "This movie meant so much to me! I cried the whole time because it was so nice to see a nuanced fat character", "iamdi": "I loved this movie", "the.wolfpack.and.us": "You 2 look hot as f’&k! 💗💗👌👌", "carlas_favourite_things": "Loved this movie!!!", "tash_craig": "I watched this yesterday and loved it, will be watching it againwith my daughter 💕", "balancingact_nutrition": "@sallyvictoria_ can we pleassssse watch", "jessstastic_": "I’ve been rocking the soundtrack everyday! 💜", "mzbel082": "I really loved this movie.", "cuteredshoes": "Cried so many happy tears watching this 🙌", "kurvygirlswag": "Just finished watching this a little bit ago. So good! This is on a must watch list with my daughter.", "jessieclaire88": "I loved Dumplin'. I loved all the messages in it! I like how they focused on the teenage angst and grief more than anything else. I also liked how in the end even though she didn't win and the pageant stayed true to conformity it wasn't the focus, the focus was on the first runner up! I like how Willowdean walks out as the winner is being annouced so as I said above the focus wasn't on that; Willowdean was off to get her man!", "ccbloom90": "I'm watching this right now! Thank God is not another 'Insatiable'", "mackaybehindthelens": "great movie", "mishh722": "I watched it today and loved it!", "theswiseone": "I loved it so much ♥️"}