{"sprinkleemporium": "I’m grateful to have a life filled with love, great friends and family and my beautiful pussycat.", "danni_and_archie": "I’m grateful for my baby boy , hubby and all my fam n friends!! So much to be grateful for!! ❤️", "lizaj71": "Grateful for friends who are my chosen family ❤️", "memissmegan": "I’m grateful for baby cuddles distracting me after getting a freckle cut out this morning, now to hope it’s all ok 🤞🏻", "shellannew": "I'm grateful for family. Moved home after several years away at the beginning of the year and wouldn't change a thing.", "caatherinehq": "I'm grateful I get to choose my adventures💟💟💟", "gentle.bliss": "I’m grateful for the rain we’ve had in Melbourne to water the garden naturally. 💦🌿🌱🍃", "hayleywelkmua": "Aircon!!!!! 💖💖💖", "mama_izzie": "You look amazing hon. And I'm super grateful for the opportunity to be in Costa Rica teaching", "veronica.and.family": "Definately for it being Friday and roast dinner night. Mr 3.5 years says Mum so I am grateful for that too", "styledbyreah": "Today I am grateful for my flexible schedule! ❤️❤️❤️", "plusjones\nVerified": "Verified", "stylepluscurves": "I’m grateful for new opportunities and fabulous friends! 😘", "inmyjoi": "Another day of life ❤️", "lovelyinla": "That view!!! That pool 😘😘😘💯💯", "thesimpleglamazon": "Those are super cute Sonny's! I'm grateful that I was able to talk to people today. I'm always grateful to be alive and to enjoy life.", "manfattan": "I’m grateful for my mom @cosmiccarla and that I get to see her next week! ❤️", "authemmie": "I'm grateful for the opportunity to see new friends, and to have no obligations tonight", "jennifer.buckingham": "Im grateful that it is Friday and I can catch up on life this weekend ❤️ You look beautiful!", "meaghanpoconnor": "Grateful for my nieces, they are truly the best blessings 💕💕", "raaaaftaaa": "Beautiful smile ❤️ 💋 💋", "justaddvodka": "Grateful for amazing friends ❤️", "bgdd6618": "💋💋💋💋", "joeyhaes": "I’m grateful for my friends ❤️❤️❤️", "wendinthewillow": "I have those glasses!", "jocullenlander": "Looking gorgeous Sam xx I’m grateful for my kids xx", "willowcurves": "I’m grateful for long summer evenings so I can go to the park at 8.30 with the puppers", "busty_diaries": "To have a roof over my head.", "what_katy_did_next": "I’m grateful for all the years I got to have my beautiful Nanna in my life. Unfortunately we said goodbye a few days ago and I am about to jump on a plane to attend her funeral. She was an amazing woman and the world is a sadder place now she is no longer in it!", "karamichellex": "I am so grateful for getting through my university course, and being able to graduate tomorrow. My Dad was diagnosed with lung cancer when I was in year 12, which fucked up me in my exams, and then passed away in my first year of uni. I've been through so much shit and tomorrow I get to walk across the stage with high disctinctions and I'm so proud of myself for getting through everything", "tootlepip72": "I'm grateful for my health, my home & my support network. I work in a hospital & today I met a patient who, once he is discharged, has nowhere to go and no belongings. His wallet, his tent(which is his home) & all his clothing has been stolen while he has been unwell. This man just wanted to be listened to, so that's what I did for 5 minutes. Just 5 minutes out if my day meant so much to him & he was so grateful. But what he doesn't know is that his story has impacted me so much. I have worked in community services for over ten years & heard these kinds of stories over & over, but I needed to hear this one today. Thank you mate, for making me stop & think how bloody fortunate I am to live my life the way I do. 💗", "nataliek_00": "I’m grateful baby is healing so quickly after her surgery... truly amazing me. And I’m grateful we have such good medical treatment available to us for a reasonable price.... feeling blessed today!!", "renaelcoote": "You look like Mariah Carey’s younger sister in this photo!", "jensstid": "I'm grateful daily to live in this wonderful country & for my holidays starting Friday 😊💜", "lizphoto": "Love those sunglasses babe! 💕🙌🏼✨", "ritamycyk": "Grateful to my mum who is helping me with my postnatal. She has no idea how much she means to me. ❤️❤️❤️❤️", "72pauline7272": "I'm grateful for my family and that we have food in our bellies and a house to live in. This time of year always makes me reflect on what others don't have. My hubby and a few family members always donate 2hrs of our time on Christmas day (and once a month during the year) to help out at a Community Center in our area", "confessions_of_a_gcup": "Today, I am grateful for practicing self love. I don’t need people to make me happy, if I am happy Withington my self the. I am grateful. Oh I’m also totally grateful for getting my hair done, just finished at the hairdressers and feeling freeeeeesh", "tamara1979": "So very grateful for a comfy bed, roof over my head, good health & two beautiful fur babies that make me smile every day! So much to be grateful for👏🏽💕", "infilou": "I'm grateful for how much I've grown in the last few years.. for my self love, self expression and the connections I've made throughout that journey. I'm grateful to older, wiser, stronger and happier than I've ever been. I'm grateful for how thankful and hopeful I feel most of the time 💖", "emperry__": "Grateful for finding happiness in the small things. ❤️", "jessica.finn.9": "For being apart of CurvyAu ❤️", "misskristylouise": "Grateful that I got to catch up with a good friend before the Xmas crazy kicks in ☕️💕", "ccbloom90": "I'm grateful for my air conditioning", "kirsty_zak": "You are stunning both inside and out @curvysam - big loves to you beautiful girl 💕", "ashas_curves": "Beautiful! Today I’m greatful to be able to wake each day and see my babies faces ❤️", "itspernillla": "I'm grateful that l can pick my children up from school every day. We juggle work and kids without family around and I love being with them every afternoon 💕", "leishyrose": "That’s lovely!💗I am grateful for my health and family.x", "champagne.mel": "Even tho I woke up with conjunctivitis this mornings (thanks kids) I am truly grateful for my girls and my partner for shaping who I have become.", "mademoisellestevie": "🙌🏼 yasssss Grateful for my beautiful family and friends", "baby_got_shade": "Grateful for my beautiful family!", "cree310": "Im grateful today for bike rides around the Brissy river with my teenage son ."}