{"katalin22": "I have these bathers! I also wore them at Oliver’s hill 😍😍 they are the best!", "kel4stan": "Be the star of your own life 😘 and those bathers are banging 🔥", "simplebotanicals": "🙌🏻", "elice_kate": "Its so sad that women have been brainwashed to believe being comfortable in a piece of clothing is brave! You look gorgeous as usual ❤️", "voluptuous2fit": "You’re gorgeous & would love to be as confident as you.... very inspiring 👌👏💋", "caatherinehq": "Love those bathers!💖", "aimie_": "@eb.loses live your best pant less life", "kimberryrae": "BEAUTY", "lovetheone": "You look fab! Also got swimmers from City Chic and they are fab!", "mrsrjc": "I think I need to try these on...! They look fab and I also have #bigboobs so hoping they work for me too!", "coralieogden": "Looking sexy well done you look lovely. Coralie OGden office Manager for Brian Ogden ELECTRICAL NElson New Zealand", "jeffy_leigh": "@melissajlord !! My swimmers", "natashasflowersandhomewares": "But beautiful. 🤗", "jeetkunedobuddha": "Yup!", "jessicadearsley": "I actually don't agree that this isn't brave! It takes people a lot of courage to overcome their body confidence issues, regardless or their shape or size, and so for some it is a very brave thing to put themselves out of their comfort zone. LOVE this cossie though X", "shankamp_": "Yaaaaas girl 😘😘", "any.body_co\nVerified": "Verified", "cassie.randf": "Love this! You go girl!", "justaddvodka": "❤️🖤❤️🖤❤️", "lkyly_mythq": "😍😍😍", "bgdd6618": "💋💋💋💋💋💋💋💋", "pro2rpm": "Rewriting the conversation. This is on point 👏🏾👏🏾👏🏾👏🏾", "shopghiaccio": "Gorgeous!", "fullerfigurefullerbust\nVerified": "Verified", "hello_jessimarie": "Your earrings!! 🍉❤️", "bht_khan123": "You look gorgeous 🔥", "rachmcconnachie": "Love your earrings! I have some of those too", "mustangsallytwo": "Love this on you and hell yes to the message, and I am obsessed with those earrings ❤️", "ann_scully": "I don’t know when this pic was taken but if it was yesterday then you are brave Sam. Melbourne was pretty chilly yesterday for bathers! 🌨", "lady_brisbane": "Gorgeous💛 Perhaps when people say ‘you’re brave’ they actually mean they aren’t brave enough to wear a swimsuit🤷🏼‍♀️Anyway we like in such a fabulous country with such amazing climate everyone should just put on their togs and live life💛", "kristy.mae": "This is just a girl in her swimmers. The end.", "ms_careyb": "You look amazing in that swimsuit! Really suits you! On another note...just casually perving on your bedspread! I love it!", "misskedennis": "I have these bathers and they are sexy as! Makes me feel like a goddess! Work it 😉", "fatgirlifts": "I wore a 2 piece to the pool yesterday and felt great!!", "emperry__": "Completely agree, you look great!😘", "ambuntiprincess": "👏👏👏", "sim18790": "Yes i love this and totally agree. Who cares what size you are you have to love you for you xx", "louisecorranshughes": "I love this post and its message.", "fantsypantsanna": "Love this suit! You look 🔥🔥🔥", "janellethebell": "You look gorgeous! 💖", "stuff.sam.makes": "😍😍 LOVE this swimsuit on you!! Hoping it arrives on the @citychicusa website soon 💕", "the.vita.v": "You look awesome #cossieconfidence", "jesssizzzi": "Love @citychiconline bathers, just bought a new pair today! Also, I love your earrings!", "womanofstyleandsubstance": "👏👏 wearing clothing is brave? Wtf? 😂", "akoiadesign": "Absolutely love this and your attitude! You look fabulous as always btw😘", "chonitell": "Um, sorry, can we just stop for a second over those earrings?! ❤️❤️❤️ woooow", "integralady05": "I hear ya @curvysam.", "erinboorer": "@hellyjames exactly what you were saying", "lisebee_": "These look gorgeous on you @curvysam ! 😍", "mindthecurvesza": "Obsessing over your earrings! So, so great!", "featherleather": "@citychiconline rock my world with their swimwear! I feel f@cking amazing and just wish I had discovered them years ago ... 🙌🏼", "suziepetkovski": "You look gorgeous! I have those swimmers in red and I feel like a million dollars wearing them. I say thank you to @citychiconline for making real women feel like they don't belong in a sack and hidden away! 'Act of bravery' and 'being brave' should be kept for our first responders- the ambos, police, firies, doctors, nurses and all our wonderful people who defend our country every day. Not a woman with hips and boobs for putting on swimmers in 30+ degree weather!", "baxterblue_\nVerified": "Verified", "kateleaney": "👏🏽👏🏽fuck.yes.this. !!! Also, those earrings are 😍😍😍", "stylebylauraaustralia": "You are rocking these swimmers babe!!!!!!", "sallza_": "Yasss 💚💚💚", "alison_devitt": "Agree totally gorgeous Sam❤️", "hayleymd78": "Yes yes yes!!! 🙌🏻", "thatssomethingclarewouldwear": "Yes queen! 🙌🏼🙌🏼🙌🏼 appreciate this and appreciate my own body in a swimsuit!!! 💕", "sarahantoniaz": "Yesss!", "pearlsandpastries": "🔥🔥🔥 Your Boobs look amazing in this swimsuit!!!", "tonifromthemount": "🙌🏽🙌🏽🙌🏽", "amyjean11": "Could not love this more 🙌🏽🙌🏽 I said the same thing on a similar post in CurvyAU. #thisisnormalnotbrave", "fleurdarling": "I just got a swimsuit from @citychiconline and wore it Christmas Day like a graceful mermaid. I love it! I'll tag ya in a photo of it because I think you'll appreciate the bogan water feature ... stay tuned", "trissywiss": "You look 🔥", "naomi_honeyy": "I just think you look beautiful! This year I filled my Insta with women that inspire me and encourage me to be real with myself and love myself and your one of them my dear. I even posted a pic of me in a bikini yesterday without even thinking twice ....because this has become my norm...😘", "katie_parrott": "These are MAGNIFICENT swimmers. (And totally agree, totally loath the “you’re so brave” or “you’re so confident” comments)", "joanneocallaghan": "Love love love", "stanzie.star": "Totally agree!", "abbykollmorgen": "Fab earrings :)", "keiraandnix": "Awesome 👏 you look great x", "_jasminscott": "I have these too and love them 👙.", "throughshadowtotheedgeofnight": "I have these swimmers and I loveeee them!!!", "kells_2401": "Just a chick, wearing her swimmers. Nothing unusual to see here party people 👊 PS...love these swimmers lots 😍", "realmumstyle": "Couldn’t agree more! Shared a #notbrave post recently. Guess what people said in the comments “you’re so brave” 😂😂😭", "zoegirl175": "Great swimsuit! Love the earrings too!", "bek_jo": "Completely agree! Do they have any support though?", "just_me_klee_": "I have these! They are so sexy!", "tinacrack": "I love their swimmers! Great coverage and really cumfy💕", "mrsaimeelangridge": "Love it - the swimsuit and the message! Thanks for sharing @curvysam. Happy Summer! ☀️😘", "lannahholstein": "It’s like when people ask me if I swim or if I wear boardies! Hell yes I swim it’s friggin hot and no I don’t need to wear boardies I have swimmers.", "melinatulifau": "Love the message!! 🙌🏼🙌🏼🙌🏼", "miss_sally_b": "This is the best! 🙌💕", "licia___xo": "Girllllll!!! I went to the pools and beach today and wore a bikini for the first time today in years!!!! I felt amazing and proud of myself!!! #carefactorzero As long as you feel great who cares! 💁🏼‍♀️ have to say Dani inspired me @simplebotanicals 😇", "leanne_erbs": "Love the swimsuit!", "jeanettebradfield73": "Well said. Just because we are plus sized doesn’t mean we can’t been seen in swimwear 😊", "modern_miss_melanie": "Amen. I’m wearing a bikini this summer for the first time in 20 years. I’m just over caring!", "lifeaspland": "Do @citychiconline deliver to UK (you know, for that one day of summer we get here?) 😂", "kyzza_": "Might have to look at these bathers. I have big boobs lol. They look great on you.", "72pauline7272": "This message right here. Best message of 2018!", "minimalkarina": "Amen!!!!", "ruby_tuesday_on_a_wednesday": "🙌🏼🙌🏼🙌🏼", "steph_____x": "These swimmers are the best! I got there and a rashie from Swimwear Galore 😍😍 you look amazing, not brave!", "ri8ca": "Love this swimsuit 👙 looks great!", "the_wardrobe_green": "Yes I agree! You look great💟", "pippinhillau": "I love that you ‘do you’ 💗", "_yvettemm": "YES. I hate it when people say you’re brave for existing 😂 that’s such a punch in the face.", "straightupgcup": "Well said Sam! You go glen coco 🙌😍👙", "becky_norcott": "Love it! Great swimmers and love the watermelon earrings too! 🍉"}