{"tootlepip72": "Sydney girl born & bred, then moved to Gippsland, Vic for love - and married him! It just him & I - but I'm hoping to convince him to get a puppy soon! Not loyal to any particular brand, except Peter Alexander. I'd live in pj's if I could. Have just done a double shift today/tonight & need to get some sleep before I have to go back tomorrow. I work at our local hospital & have just cracked some permanent hours -YAY!", "laurenboase": "Hi! I'm Lauren from Adelaide ☺ Independent woman with a fabulous back crew ✌ white fluffy Sadie (Sadie-Bug/Sades) - last thing that made me giggle was at family dinner tonight, my cousins burley, blokey husband got really excited in our conversation about Marie Kondo's new netflix show and telling us how he spent yesterday clearing out his wardrobe and file folding- he was so passionate, it was brilliant! Fave clothing brands...all my recent purchases have been from @shestreetofficial @bohemian.traders @littlepartydress and of course @kmartaus ❤", "louisetaylor48": "I’m a dog lover, own 2 Labs, married, 2 kids 19 & 20. I giggled tonight at Rafa Nadal’s funny faces at Fast4Showdown Tennis - awesome. I love that you love dogs, love so many brands but they don’t usually love my plus body. Live in Sydney! I live semi rural but dream of a sea change. 💗", "amanda__oxford": "I’m amanda, I’m 31, I live in Brisbane, I have two cats - jilly and pawpaw - both my little rescue babies. I am living for pretty little thing clothing at the moment and just ordered $300 worth of clothing last night 😂😂 thank god for afterpay. I am single 😪 you may remember me messaging you about what happened 😂 and the last thing that made me giggle was watching stepbrothers 🤣", "lozzymichelle": "My name is Lauren. I'm from North Brisbane. Work for QHealth - MNHHS. Single AF. I have 2 Belgian Shepherds. One is an Australian Champion the other is ex RAAF and Corrective Services. I generally wear what I can find that fits! Torrid is good for that but so expensive as we all know. The last thing that made me truly laugh was a video on facebook of 2 blokes riding a mechanical bull.", "emmaharvie": "Melbourne girl, currently travelling in Romania! Independent, my cat is my fur baby 😻. Fav brand is Harlow but have recently discovered Little Party Dress and am obsessed", "stuff.sam.makes": "Hi 👋🏼 I’m Sam and I live in North Carolina in the good ole US of A. I have a 🐈 and 🐶, both rescues, that are my family. They make me giggle all the time. Thrifting 👚 👖 and reuse is important to me, so I don’t have a fave brand per say, I just like clothes that fit! I’m awkwardly between “street” size and “plus” sized clothing, so shopping in general is challenging. XOXO", "missyrae85": "Hey I'm Melissa I live in Salt Lake City, Utah. I'm recently divorced from a 7 year marriage and I don't have any kids. But I'm loving the single life! Guardians of the Galaxy- I rewatched it this weekend and it makes me laugh every time.", "tarni.mcginness": "Hi Sam 👋 I’m Tarni, I have a fambam, I moved from werribee to a dairy farm not far from port Campbell about 18 months ago. So I have three dogs, two cats and about 500 cows as pets 🐄 my son and partner makes me giggle everyday", "just_simply_shannon": "Hi .... 🏡 i live gold coast hinterland 👵40 something mum of 2 teens (i have no clue what I am doing! ), 👰wife of 1 awesome man for 21 years 😃 teen boy makes me giggle every single day, but almost 6 month old🐶 Labradooddle puppy gives me the biggest giggles at the moment. Fav brands as a curvy girl & dress addict 👗 @littlepartydress (for the flattering styles and gorgeous prints) @adriftclothing (sale racks) and @jaase_au (for those boho feels)", "itsmisscara": "Hi Sam I am Cara. I'm from Frankston 😊 living with my partner and out adorable staffy. She is probably the last thing that made me giggle. I am a kindergarten teacher and it brings me joy everyday. I don't like to spend alot on clothes but I do love to sew so make probably half of my own clothes. Fav rtw is probably target.", "funkyolgirl": "Hi Sam im Diana.. live in Brissy bayside.... married with 3 pets .... made myself laugh this morning cant believe i’ll be 70 this march... hysterical 😂😂😂", "kittykattjules": "Single girl in her mid forties here living alone in the Eastern suburbs of Melbourne. Very independent! I had a giggle today when my elderly neighbour sprung my 'special friend' leaving after a sneaky lunch time visit 😉 I pretty much live in city chic dressses. No pets at the moment, my beloved cat died in September and I'm still mourning him......not quite ready to get another just yet.", "madebykate.art": "🙌🏻😍", "life_of_nush": "I’m a happy little Brisbanite. That said, I’ve recently put it out to the universe that I’d like to move to Tasmania. The weather suits me so much and I fell in love when I was there recently. I was an independent babe loving the single life. I’m still an independent babe now but in a new relationship. He’s a sweety. We titled our first fight ‘Currygate’ because it was over him eating my left over curry without asking. I’m Srilankan! He should know better!!! 🤷🏽‍♀️ The last thing that made me giggle was a watching a video my friend sent me of her super giggly 13 month old bundle of human gorgeousness. She’s the cutest. Fave brands are those which are accessible, affordable and preferably ethical. @theiconicau @asos_loves_curve and now @allyfashion too. Love Australian local handmade accessories though. So many fun pieces.", "icurvy": "Been eyeing off that skirt - looks great on you 😍", "leannezimmermann": "Looking super gorgeous 🖤", "allyfashion": "Pretty lady 💖", "ccbloom90": "I live in north Bris with my partner and my cat Beans (Tommy Whiskas is missing 😭) the last thing that made me laugh was an Instagram page about hats for cats 🤷‍♀️. My fav brands are probably Asos, CC (When it's good) and Kmart/Big W's cheap ass clothes. Byeeeeee", "danni_and_archie": "Adelaide! Have a Hubby and a Lil boy who is 7 months! I laughed at myself as I found myself standing in the bathroom looking at insta and had no clue how I got there or why I was in there 😂 No pets 😢 Love City chic, little party dress and a new one ally fashion curvy! Tried Ally out because of you actually! Went into a store that stocked the curvy range and was pleasantly surprised that pretty much everything fit me! 💕", "shaenal21": "Hey girl! You inspired me to start a YouTube channel! I am very newbie but I’d love for you to check it out and welcome your tips: https://www.youtube.com/channel/UC2HAbScL5YyJhPliXmWP6Pw", "cjtemps": "I’m Chrissy, 37 from Melbourne! Independent woman 💪🏼 no pets but I love dogs 😍 I shop all over - Sussan, K-Mart, Harlow & love getting inspired by you. You’re super Sam! 😀 👊🏼", "runmegsyrun": "Hi @curvysam I’m Megan, 49 yo & live in Sydney.. I’ve got 2 teenage sons (16 & 14) & 2 Labradoodles (Gatsby & Daisy). I shop all over, incl. Susan, Target, KMart, Raq Apparel, and many more online stores. I’ve just discovered your account & I’m excited!!🌈💞🙏", "stylebylauraaustralia": "I live on a farm near Canberra. I have 5 dog's (we also breed kelpies) and live with my partner. We have sheep and cattle...no kids yet. Been together since I was 16", "stephanie_cox_xx": "Hey! So I’m Steph! I’m currently living in Melbourne but I’m moving to Brisbane in 3 ish weeks! Been single a year and living life. So excited for new adventure. I have a puppy named Abby who a Labradoodle and I’m little obsessed with her. With clothes I’m not big of brands I buy a lot from @littlepartydress they are my fav but I do have an obsession with mimco.. I’m a big movie buff and Disney is my fav!!! And love to read books. I maybe read 2-4 a week just depends ❤️❤️", "dannielle_oliver": "I live in Bendigo, Victoria. Married with two little ones - 4yo & 19mo. I’ve been laughing at Facebook memes tonight, in particular one which read “I’m too old to drop it like it’s hot, so I’ll sit down like it’s warm” 😂 I have 2 dogs, a puggle named Austin and a pugalier named Tiki! Fav brands... hmm... I love Jeanswest curve embracers for jeans. Most of my wardrobe is a mix of pieces I’ve picked up from boutiques I’ve come across online. I’ve recently been loving CityChic. Their clothing is cut so nicely it suits us curvy ladies!", "joril_92": "Live outside of Melbourne. Have a partner of nearly 9 years. 2 cats and 2 dogs. Fiercly protective of my immediate fam so I keep them close. Last giggle: My cat sleeping in my trackies whilst I'm on the toilet.", "itspernillla": "I was born in Sweden, did 10 years in the UK and have been in Sydney for 12 years now. I've got a partner and 3 girls 11, 9 and 2. I have no family in Australia other than those 4 and I love to travel, read, drink wine and watch crime. Currently on holiday in Europe and have bought far too many jumpers 😂", "i.am.katie.louise": "Live in Canberra, originally from Tassie. I have a gorgeous little fambam - hubby & 2 cheeky munchkins! Last thing that made me giggle was Fuller House on Netflix 😂😂 we have a little ball of fluff puppy called Ellie x", "72pauline7272": "Howdy Sam. Well you already know a little about me but for the rest....I'm 46, married 28 years to my best friend, i have 2 kids (27 & 16), one daughter in law, and 2 gorgeous grandchildren. I'm a practice manager in a physio clinic. Ive been involved in 3 bank robberies when I was working for NAB. I then worked 20 years for Ambulance Vic in the Finance department, but was made redundant 5 years ago. I have 3 cats, Cookies Cream and Waffles. I love wearing Crossroads but more Kmart,. Target, Rivers. (I'm not a brand name girl.) Oh and I paint my nails every second day and record them her on IG.", "gentle.bliss": "Hi Sam, I’m a Melbourne girl, married for 23 years next month with 2 gorgeous fur babes. I love wearing Witchery tops. Something that made me giggle recently ...trying to think, there’s been a few recently, just can’t think if one where you didn’t have to be there!", "meandmine82": "Live in nsw, south coast. 4 kids and a gorgeous hubby of 15 years. Have our first hairy baby together still simba his 14 human years .. totally deaf. I love him to bits. We brought him with us when we moved from California ( American husband) his had a good little life. Reading a post from baby Mac just made me laugh!", "kimmykmcdonough": "I live in Murwillumbah NSW, I have 2 daughters, one lives in Melbourne, the other with me. We live with my partner and his 13 year old son. Last thing that made me giggle was my 19 year old daughter telling me she has joined a Kmart Mums group and is now dedicated to spending her time to looking at Kmart things (I have tried for years to get this kid to share my love of homewares!!) I wear a lot of City Chic - and I love love love Camilla - not that I can afford them often. But so worth a splurge now and then! I have a qualification in fashion design, dress and pattern making but own a swimming pool shop with my partner. 💗", "lily_onadustbin": "time traveller? Weren't you in Brisbane earlier 🙃", "carries_petsitting": "Live in New Farm, Brisbane. No fambam - I’m independent. The only time I’m not alone is when I’m at work. Last giggle would have been with one of my team mates at work. No pets but surrogate to lots of puppers. 💖", "imogenw": "Melbourne (and I love the weather). Two cute hounds (@the_adventures_of_tacosaurus ). Trying not to wear so much black, love @gorman. Working in health care 🥼😷. Proudest achievement in 2018 was consistently riding my bike to work 🚴🏼‍♀️", "stephmtravill": "Live in Melbourne but originally from NZ. All my fam live there. Luckily my husbands family are close and lovely. Last thing that made me giggle was Ellen’s comedy show on netflix. She’s great! I have one 🐱 and my fave brands are Little Party Dress, Asos, and the plus brands from the Iconic.", "kathy_hatzipashalis": "I am a Mornington girl too. Moved coastal three years ago from Cheltenham and not looking back. Married with two beautiful kids. Took a break from the corporate world six years ago to build a house and haven’t gone back lol My son makes me laugh and we have budgies ... lost count how many 🤦‍♀️", "busty_diaries": "Hi, I’m B. I live in Brisbane & have a family. I’m not very independent & am pretty much never ever alone. The last thing that made me giggle was a kids Aussie TV show called Bluey, it’s a cartoon family of cattle dogs living in Brisbane. It’s surprisingly good. Our pets are slowly dying off, so we now only have 1 cat & 1 dog. I don’t buy clothes very often & don’t loyally support any particular clothing brands. I live in hand-me-downs & prefer it that way. 💗", "prudencejh": "Hey Sammy🙋‍♀️ Live in outer Eastern Melb with wifey and our two black labs. Wifey just made me giggile while singing her pasta song while cookinh dinner. My fave brand to wear is probs anything that fits currently haha totally lots my mojojo 🤦‍♀️😑🤣 loving your hauls hoping to sassy it back up in 2019💃", "heatomojito": "Townsville 😊", "daniarmstrong": "Love this outfit!! I am from Sydney. Work in HR Married nearly 17 years. Have 2 kids, boy 14 & girl 10. Pets - 2 chickens (Chicky and Chickolina), 1 tiny dachshund x puppy named Jet (he’s jet black) and latest editions are 2 finches (Rosie and Speedy Gonzales) Current obsessions clothing wise are Little Party Dress, TSID & Kmart 😂😂", "jessica.baggins": "Holler! I'm Jess. I live in NQ and have three kids, oh wait, 2 kids and a man-child husband. No pets as am flat out keeping small humans alive. Last thing that made me giggle was my 6 year old son asking me what that noise was after he farted. I don't have a lot of favourite brands, but am learning that there are nice plus size labels out there! I love @fussygus and @confetti_rebels tees and @lindy_bop vintage style skirts and dresses. @atmosandhere plus size range is also fab and I ended up wearing one of their dresses when I eloped last year 😍"}