{"ansandfinnian": "You look gorgeous @curvysam (as always!) 😘 x", "plusjones\nVerified": "Verified", "scwarby": "Love a good head scarf!", "earth_through_images": "Love your work. Bee great if you could explore my page out as well curvysam", "iamdaniadriana\nVerified": "Verified", "hopes89": "Yay, I’ve planned a Kmart shop especially to stock up on some to glam up a messy bun/pony tail. Also loving that skirt on you 😍", "beth.kelly20": "I feel like they are so cute on other people but I can never get them to look proper on me. So I gave up.", "quirkygreek78": "Headscarfs are the bomb especially if your having a bed hair day", "daisyacocks": "You are rocking it!!! I love the look of headscarf’s but I always end up taking them off as I feel my face looks silly. Today I purchased a beautiful headscarf from Seed and I’m determined to wear it!", "fridayiminlovexo": "💖💖💖💖💖", "itspernillla": "Looks amusing 👌😍", "danni_and_archie": "I just bought a whole heap of head scarfs from a market! $3 each, which I thought was a bargain!!", "beckcarlson": "Love your head scarf. I live in Mornington, just down the road from Mount Eliza. Enjoy your time in my hood 🧚🏾‍♀️🧚🏾‍♀️🧚🏾‍♀️", "authemmie": "Ahhhh puppy! The headscarf lools great on you. My hair is so short that I've yet to master it.", "styledbyreah": "I’m new to the headscarf game and I love it too! PS- Bulldogs are the BEST!!!", "curvygirltravels": "Hahahah fur baby are great", "manfattan": "There just too levels of cuteness in this photo!", "jayne.drzezdzon": "@curvysam have you ever bought off shein?! I tried to see if you’d done a haul but couldn’t find it. Wondering if you recommend?", "jennifer.buckingham": "I’m obsessed 😍", "paularovingstyle": "Loving the headscarf! I love any sort of head dress that can disguise a not so great hair situation 🤣", "sheikenails": "If only humans would love the way a dog does 💜", "stylepluscurves": "You are rocking those pirate queen vibes in that head scarf! Love!!!", "pqcollection_": "Love that headscarf on you! I've recently fallen in love with them too, I like tieing them around a high-ish bun in so that a bow sits on the top of my head 🎀", "__hannahhm": "Love this!! 😍💗✨", "thesimpleglamazon": "I'm working on it! Great shot! So cute💖💖", "dennigillies": "I appreciate your reviews of ally. I ended up ordering an outfit after I watched your YouTube clip.", "panda151705": "🙌 to the headscarf looks good.", "lozzymichelle": "Those kinds of things always slide off my head haha", "fashionandframes": "Absolutely stunning Sam! ☺️", "ashas_curves": "I’m nay because of my round face but seeing this on you I could be a yay", "cuteredshoes": "It looks AMAZING on you! 😍", "truuudo": "I have just started wearing a headscarf. I feel a little strange, but work colleagues say it looks great. I thought I you’re looks great.", "rosie4850": "You look great! You were in my home town! So beautiful here isn’t it!?", "lily_onadustbin": "love them on other people .... yours looks great .... but I just can't 🤷‍♀️", "steph_____x": "Legit 10 mins from there 😍", "justaddvodka": "🍪😍❤️🍾", "stopitjaimie": "On myself it's a nay, the back of my head is kind of flat so they shift and slip constantly. On people with lovely skulls it's a yes queen!", "stuff.sam.makes": "You look fabulous! I like headscarves on others, but don’t know how to style them on myself.", "kellysimmons27": "Looking fantastic. Yes that’s my home town....", "allyfashion": "Babe! 😍", "laceyjadechristie": "Yes to headscarves! I love the colour of that one!", "mammytosammy": "@ashleyfolino that skirt 😍", "cuteclipzetc": "Love the headscarf! I'm right into them, oh and love me a topknot too! You look gorgeous! ❤️🙌", "_tamaramae": "I don't have enough body in my hair for anything like that! I have a decent head of hair, but it's so unbelievably fine it looks like I own 5 strands.... Plus I have a cabbage patch baby face 😜😘", "vnessy": "LUUVV the skirt! (And head scarf 😜) Is the skirt from ally fashion??", "joyess": "Adore this look on you!", "vivrkrawat": "💞 Wow looking beautiful pretty girl💞", "stefanavella": "Oh SUPER CUTE!", "allthingsjanelle": "Like you I think my face is too round!", "msdownunder": "I've never been able to wear them. Do love them though", "champagne.mel": "I like it, I’ve not worn one in many many years maybe it’s time to try it out again", "myearringobsession_": "Headscarves, headbands, bows... Yes to them all!!!", "72pauline7272": "I'm a nay for any headwear except the occasional headband. Looks awesome on you though 😘💖", "desireeturner88": "Headscarfs alllllllll the way. How you have styled yours looks 🔥🔥🔥", "collection.of.my.adventures": "I’m a huge yay! Love them. Yours looks fantastic on you!", "jaydemelissah": "Yay with headscarves! Personally but also on you. Looks fab!", "jemma2689": "YAY YAY YAY!!! Looks fab 💕", "miss_sally_b": "Yay for headscarves! 🙌😍"}