{"maman_martini": "Not doing anything online again. If it happens organically, great, if not, I’m beyond caring any longer 🤦🏽‍♀️🙄", "bostonjacqui2410": "🤣🤣🤣", "glitterandfairies": "Girl you should come speed dating in brisbane! You may not meet someone but it’s always eventful haha", "mamas_learning": "@juhlyndanae", "akachia85": "I am so with you! And maybe I will get free pizza then😁😂", "nickijbelle": "Luv you xx 💋", "emma1586": "@sophiaingle 😜", "notyourstandardkim": "@megankaur 😂😂😂😂", "becnherboys": "They ride bikes around here 🤦🏼‍♀️🤣", "ri8ca": "I'm with you🤣 pizza seems so much better", "justaddvodka": "🍪🍪🍪🍪", "pearlsandpenguins": "@jenngruenke 🤣", "hello_elbie": "And when you call them they will ALWAYS come over...", "twylamyrin": "@alexdevick 😂😂😂", "senikr3": "Me too👍", "jjdeets": "I feel you girl!", "carries_petsitting": "I gave up on dating and I’m happier now than I ever was. 😆", "chlojansen": "I met a guy at my favorite pizza place and now we’re dating!! 😍🍕 I knew pizza would never fail me!", "foxyjojo77\nVerified": "Verified", "didyousaycupcakes": "My life 100%. I have been rage blogging about it.", "taniakamkel": "@mznellynels 😂😂 ain't this the truth", "thesimpleglamazon": "😂😂😂😂😂🙋🏾‍♀️", "christinecorcoran_coach": "🤣🤣🤣🤣🤣🤣", "vivianvalmont": "Best plan ever!", "sarah180brown": "Good idea xx + free pizza 🍕", "jodiepearce91": "Haha feel you Girl!", "kimbalikes": "You're gorgeous and smart and talented and damned hot! They should be queuing up! 💗 I lucked into the love of my life 20 years ago. Fingers crossed you stumble across a good one soon - and not because he's passed out on the ground! 😂😘😘", "carlysnapz": "👏🏼👏🏼👏🏼", "heyitsmemaddybee": "LOL. When I was trying to find a housemate I actually ended up going on a date with a guy I met on Flatmate Finders 😂", "lozzymichelle": "This is so perfect", "jesssizzzi": "I feel like that all the time but I just keep powering through the dates (when I can be bothered!) But if ‘the one’ doesn’t show up soon I’m getting myself a dog and being ‘one of those crazy dog ladies’ 🙌🏼 🐶", "littlecuddles": "@damitajulie", "thatssomethingclarewouldwear": "Oh girl! 🙌🏼 just spent the last hour and a half swiping left and right while watching the trash of steaming piles of male trash on MAFS and I GET YOU!!!", "straightupgcup": "Got me some cajun chicken tonight. This decision every week or two is one of my better ones hahaha", "bodyimage_therapist\nVerified": "Verified", "chloelukee": "@megtonkin", "alifelivedcurvy": "Extreme is an understatement", "l0zm0z": "Pizza will never let you down ❤️", "confessions_of_a_gcup": "YEEEEEES! So good!", "ryliehumble": "Dating sites are the actual worst.", "ange__angela_butneverangie": "I feel you big time!!! Especially after my experience today. 🙄 told date I didn’t want to continue on anymore and they told me that I was misleading them, emotionally immature and that they wished my future partners good luck. We had met once and talked for about 3 weeks... completely sane response. 🙄🙄🙄🙄🙄🙄🙄🙄 pizza it is ❤️", "ashleyfolino": "Amen to this 🙌🏻 lol", "love.from.ginger": "I can’t with tinder and all the things. Refuse to from here on out!", "__hannahhm": "🙌🏼 - why is there no hair-flick emoji!", "ashmc27": "@emm_ryan 😂😂", "stephaniee90": "Legit just finished ordering pizza and this is the first post that shows up when I open insta 😂😂🍕🍕", "antoranthony": "Preach!", "amanda__oxford": "Done with boys and pizza - both bad for you in the long run 😜", "activetruth": "😂👌🏽"}