{"siggas_journey": "@jess_smith978 how stunning is this😍", "thattwinmum": "@pintsizeclothing thanks for spending the weekend with me and the little ones so I could attend a work conference. You the best nana 😘 PS. Look at the pretty dress!", "vaginasaur_": "@piggee_smallz I love you! Thanks for doing everything for me!! You’re the greatest!", "piggee_smallz": "@vaginasaur_ I appreciate your kind words you're a babe also and would look real good I'm that dress", "rebecca_a_lamont": "@annawoning I appreciate you because you’re always the first to encourage and always the last to give up! Love you x", "charmnz": "@madi cowan I appreciate yoy because you are hard working and always thinking of others. You are the kindest person I know. Love you to the moon and back.", "caitlinhm": "😍😍", "debstar444": "@natalie.letters you are truly one of the most special people in my life... Love you xx", "lisaf2710": "@fattofitneet you my friend are inspirational to so many in your honest posts. Thanks for putting yourself out there ❤️", "trexhands": "@themessyplayco because you are literally the bees knees. Wouldn’t be able to do life with out you in it. Xx", "kellysimmons27": "@narellepasquill love you and your strength", "joanne.cardow": "@megangerathy", "natnatwood": "@elizabethanorman I appreciate you because you let me help you in your garden and you also let me boss you and your dog around sometimes 😘😂🥰", "themessyplayco": "@trexhands you are the greatest lady I know. Keep rocking at life xxx", "kymmyj": "@selwel81 bestest big sister in the world 😍 Also my fashion parade advisor #thanksbro", "deedjukic": "@kerri.chapman.378 I miss you my friend, I miss our daily chats, many lunches shared together. Sharing our lives, the good, the bad and the ugly without judgement and always looking out for each other. ❤️", "emzie2903": "@premieredancewear", "curvysam": "Winner is @ellebowandlu", "saguezeric": "Bonjour à vous", "zoecartmell": "@amelia.ailema this would look great on your new sized bod to show off all your hard work ❤️", "cora.confetti": "@sandradearing because you are the beautiful inspiration I have at work to live my best happy life and thay it's doable in a healthy way 😘", "benny___all": "@petapiper24 I can see you looking fabulous is this dress xx", "jen11a": "@carlita1589 thank you for all the love and support you give Rod and I. I Couldn’t of asked for a better sister in law to be! 💜", "megangerathy": "@joanne.cardow no one appreciates a fabulous frock like you 💕", "emcostello01": "@meganariches 😍", "_mulissha_": "@ella.harrison.9887 i appreciate your dorky self, bc you're funny, sassy, witty and so confident ❤️", "sarahlight26": "@seemeswoon I love watching your makeup tutorials and adore your fun fashion style.", "becoming_georgia": "@badgal_weewee, because you just make me happy 🙌.", "mrslynhle": "@loan111 you never buy anything for yourself so if I win, I’m gifting you the dress because you’re so selfless and always giving to others before giving to you. #mysister 💗", "misskittystyle": "@mardi.stapleton I appreciate your support, your wonderful sense of humor and your fabulous style!", "telltelli": "@jessshawnrj because you are such a good mumma", "angie_stergs": "@marsantos2004 @penny.gaskin @holstar79 #love #friendship #forever", "mardi.stapleton": "@misskittystyle I appreciate our friendship, your kindness, amazing style and wise advice xx ♥️", "jesslovesbargainfashion": "@lindab_arbonne such an amazing mum to Will and a beautiful friend. With all that you have had to deal with you are a true inspiration.", "outgrewtheold": "@tezm1978 appreciation post - just what to say how amazing you are and how I couldn’t do life without you! As a single mum to 5 kids ur not only my best friend, you step up and help me out when ever I need that second pair of hands. One day I hope I can repay the favours!!! Love you mick and the girls endlessly 😘😘😘", "nicolapaigee": "@kaitlyn.delaney I appreciate youuuuuuu You make me happy and I love the passion you have for everything you do! 💕💕💕💕💕", "andreaallendorf": "@kirsten.allendorf love your determination commitment and your ability to relate and teach little people 💕❤️💙💕", "jazzyb_c": "@one_mamas_home I appreciate your friendship so much. Your style is gorgeous and you always make me feel special in whatever I wear xx", "justaddvodka": "Love🔥", "renewbylaura": "@jazzyb_c because you always put everyone else first and are extremely thoughtful and you too inspire me xx 😍", "msmitty69": "@chrissieswan I appreciate my morning laughs with you and the boys every morning", "jessica.finn.9": "@katie_parrott this dress would look fabulous on you.", "wineymumma": "@mishy11 ❤️☕️", "daniellejade1979": "@wineymumma 💕 because you love me for the crazy thing that I am..... you accept my crazy", "nessas_life": "I love this dress!", "katie_parrott": "@morgan_229 bc you’re wonderful xx", "jenilee72": "@insta.clementine - Gotta love a friendship that starts with a mutual love of fibre, fabric and champagne and celebrates the joy of connected minds xxx We have to catch up soon ❤", "the.wolfpack.and.us": "@sleevedmumma", "ellebowandlu": "@annagracebell you are the kindest, most genuine, funny, brilliant best friend I could imagine! Thankful you’re in my life 😍", "gorgeous_by_carly": "@mrs_giggles_world", "_k_rad": "@shanmckee_ appreciate that you are back in life xo", "cmareeeeee": "@tesstrues appreciate the shit out of you. From fashion nova hauls to watching me put on clothes i thought i looked awful in and telling me all the things nice and literally slowly but surrly changing the way i see my body and myself ❤️", "_._.toes._._": "@brooklynyo I appreciate you over this 25years of friendship! Your put up with me you deserve a medal! Love ya for Eva!", "gilllyyyyy": "Gorgeous dress!! And those shoes 🔥🔥🔥", "tarrady": "@kal_sie i love that i can talk to you about anything at any time of the day and your always ready with a listening ear 😘😘", "tahliascholes": "@emme_anne I appreciate you having a ‘destination wedding’ so I get a break from the kids 😂😂 this dress would be perfect for me to wear to it 😉💕👰🏼🤵🏼", "bostonjacqui2410": "I love your shoes 😍😍😍", "anna_radich86": "@soph_duggan90 you know I love you 😘", "veronica.and.family": "@jennerstevens for being my mum and for everything you do and help me with.", "misskristylouise": "👗 💕 @mctucs", "lisa.wright3": "@meegz000 love you girl x", "emma.vao": "@chantelmichael because you are an incredible Mumma and you rock it everyday 🙌🏾", "72pauline7272": "@sallygaunt This woman is going through a tough time at the moment and anything I can do to make her day brighter I will. Sometimes life throws you shit but She is incredibly strong and loved 💖", "caitlincooper": "@carly.m.civelle because how often is it BFF love at first sight? You also swooped in to rescue my (and my kids) after barely knowing you two weeks. And you stopped me buying that orange jumpsuit today. #twinssss", "laurahawk_": "@starylicious", "chelseeaoh": "@richelleh Dear Bad Gal RiRi, it was you Jesse Mac was singing about when he said beautiful soul. You’re my favourite ranga and a highlight of my life 💃🏻💃🏻", "kirstbalk": "@faith_b88 is the one of a kind. She helps me adult when I want to curl up into a ball. She is kind, generous, wise & appreciates a great coffee 😉. I would be lost without her & am truly grateful for having the privilege of being her friend 💜xx", "fleurdarling": "@tashywebb I really appreciate youuuu haha has it been a whole decade that I've loved you?! 😑😑 no it can't be because I'm still in my youthful mid twenties hehe 😂", "caatherinehq": "Love the shoes💖💖💖", "thelutzes": "@mytarantism", "dottyair": "@biancacheyne 😍😍😍", "outfit_by_ebay": "@i.n.s.t.a912 help your mum win this stunning dress!", "simonehanckel": "@vickibphoto I can see you rocking this dress!! ❤️❤️❤️", "kristy.mae": "@reneehinkley I appreciate you because your great at taking my advice 😘", "___joal___": "@nadia_mumof4 You know I 💕 you and couldnt have gotten through some tough ish without you 😘😘", "patrice_lund": "@teresa_plus_three quite literally couldn’t do life without you!!!! Would love to see you in this dress...looks amazing for big boobies (also looks bf friendly 👌🏽) 😘", "epitomeconcepts": "@cathrynheap", "peppercornfarmkoonwarra": "@annikarhair ❤️❤️", "hannpollock": "I want those shoes.", "julie_oxo": "@emjay_xox appreciation post because you are my forever friend ❤️❤️❤️", "madeleine.sheppard": "@tara_smith53 I appreciate your mummy guidance as well as our gf chit chat. Thank you for being you x", "kel4stan": "@marzy_37 💖 love you 💖 our friendship is so perfect & pure! Free from judgement we can tell each other anything & we just ‘get it’ 💖 plus I love me a black dress too 😂😘", "ashleysmeg": "@guzzie88 thanks for making me feel like a babe everyday", "adrienneleo": "@mary.castles81 I would appreciate you wearing this in France... or me ❤️", "jjdeets": "#freeshitwithcurvysam @jessica81890", "nikka4615": "@blondie4rhino 💕 Thank you for being you bringing happiness and giggles on Facey everyday.", "tanmunn": "@nik066 we could wear this on our hol together. Day about 🤣", "fullerfigurefullerbust\nVerified": "Verified", "mademoisellestevie": "GORGEOUS", "miss_sally_b": "That dress! 😍😍", "amyyywalters": "@christyjanette Do I even really have to tell you 😛 💕💕💕", "jode_w": "Love and appreciate @carlyferling my little sister who is always there for me.", "ponticellogiulia": "@carolinekingdon this dress would look amazing on you #freeshitwithcurvysam", "lauradoesbrunch": "@miss_sally_b big shout out to you 🥂 ps I fixed my car!", "daniarmstrong": "@dunnmj72 you are one of my oldest and dearest friends & we would both rock this dress 😘", "bellagirlsjoy": "You are amazeballs @kimky374 x", "icurvy": "@katie_parrott because you NEED that jumpsuit 💕", "nrthors": "@rebeccarowe00 we both need this dress haha. I appreciated you x100. Doing life without you wouldn't be the same", "blue_zone_only": "@tracyanneclare", "willowcurves": "Love those shoes!", "rayjayaroadie": "Love the shoes! 💜", "tracyanneclare": "@jacinta_vb", "melgj87": "@suzanneaskew the best mumma bear to two amazing little girls and one giant man child!! You deserve a mountain of appreciation girl!!!!!!", "brooke_alb": "👏", "achooyou": "@kylie510 you are my sister and that in itself deserves free shit for putting up with me 🤣❤️", "dannieldridge90": "@kgates1964 you are the best mumma in the world", "maddi.higgs": "@alex_mole98 love you mate, not just bc I want this dress 😂", "kel_brook": "@kpayne13 love you ❤️❤️❤️", "fimailer81": "@sandratylor ...... Mongs for life, enough said 😘😘", "katurtle23": "@abbylou__xo Abs, best baby sis ever. Win it and share it? Love ya sis", "hey_its_nance": "@misssilvie_ this is 🥰", "chloelukee": "These SHOESSSS 😍🔥😍🔥😍🔥", "billiejo_best": "@hodgettsclaire No words could ever be enough to describe how much I love and appreciate you! 😘 Can’t wait to see you!😭 #soulsister", "k.kealywatz": "@tianameikle okay this is cute as heck", "teachingtravelswithmrsg": "@jaman55 mumma bear I appreciate you to the moon and back. No matter how old I am I can still rely on you to have my back. Nothing beats mumma advice or love xxx", "truuudo": "@mel.luca - you know I appreciate you girlfriend. Just wish we caught up more often. Check out Zarc Clothing. I bought my 6th item from them last weekend - my first ever jumpsuit."}