{"dbeals107": "what is a car with a s on it? i dont knowif i have sseen that before", "cfswift": "Go the VW Tiguan it’s such a fabulous car 💕 I had one for a few years but just upgraded to a Discovery (you know, growing kids, dog and all associated crap 🙄) But I still miss my zippy tiggy", "platter_to_plate": "You are doing such amazing things lovely! Glad you could sit back and take it all in 😘", "brisbaneminigarage": "Have you thought about a MINI Countryman? It has the size of a small SUV but the go kart handling of something smaller & zippier like you’ve been used to in your Swift... plus MINIs exhude so much character too 🚘🇬🇧", "aleishalangton": "My mum has a Vitara and it has been really great. She can jam a lot of stuff into it! They are really good", "lisslings": "Nissan x trail", "becca_b00m": "I went out to buy a SUV & came home with a corolla sedan! So much room & a big boot. I love it!", "womanofstyleandsubstance": "I have a 2018 Mazda 3 Neo Sport. The seats fold down for heaps of room in the back. I'm sorry I got the sedan instead of the hatch though 🤦‍♀️ For two teens in the back, I needed the extra head space 🙄", "catcoldwell": "I have a Kia Sorrento but we have 4 kids. The sportage is a little smaller but good!", "lizwilsonphotography_boudoir": "We have a Mitsubishi asx. We take it off-road more than we should, I take clients in it, our three fur kids, and we have the diesel model so it’s not too bad on the fuel. We do a lot of road trips and big drives all over the place. It’s super comfy for my plus size butt and it doesn’t fat shame me like my sister car (next level up Mitsubishi) that has a short seatbelt so I am in pain anytime I am in it.", "curvysam": "@zupps_suzuki jimny or vitara? What’s the best", "zuppssubaru": "Look at the new Subaru XV or Forester. Come see us and ask for an extended overnight test drive. 😁", "justaddvodka": "🎆🎇✨", "theindependantmumma": "A Toyota Kluger!! They are awesome, sexy, secure, simple technology easy to fix IF you ever get a problem - strong safe car and sexy an all wheel drive so you can go ‘off road’ to a certain point - rugged but speck at the same time - great boot for pets and gear and 7 seats if you really need them! Back seats are in the floor so the boot is still really spacious when they are folded- I would have bought another one when my last one got to small for my tribe - my youngest has high special needs so we need space for wheelchairs, sports gear and kids! Lol 2 oldest at 14 & 15 teenage girls very long legs and play sports so sadly I had to go for the ‘modern mumma bus’ a Kia carnival all the space of a kluger and more with a huge boot even when the back seats are up and a generous 8 seater in total makes it cost effective not being petrol - it’s great but the one thing it isn’t is an All Wheel drive so when the weather is crazy I don’t feel as safe and know that pot holes and flooded roads are no longer ’easy’ to negotiate! ☺️", "irisszs": "I love Brissy! Miss it so much, its been 2 years 😩", "thenatnicholls": "We downgraded size wise from a Q5 to a Mini Cooper Countryman. It’s amazing!! It’s a fun euro styled car with lots of power. I call it our big small car. My husband refused to buy a Mazda mum car even though I’m a mum. Haha. The whole family loves it even my son. It has fold down seats and a boot cavity where the spare wheel should be. It has drive flat tyres.", "jeska_rose": "Nissan qashqai. I freaking love mine", "allira_missm": "I’m a Suzuki girl too & I think the vitara is a good choice!!! I love my swift & I’d consider a vitara next 👍🏼", "jackyjo": "I just got the VW Tiguan Allspace and I’m in love! Wasn’t one on my list but my fav out of all I tried! Was concerned it was ‘too big’ for that city life but actually find it easier than my previous Kia Rio hatch cause sensors and cams! 💕", "becfez": "I’m a Toyota gal all the way due to the quality and they hold their value well so I’d recommend the C-HR their small SUV or the RAV4! Nissan Qashqai or Honda HRV are also meant to be really good!", "beejay84": "Mitsubishi ASX alllll the way!", "rebeccajanesarah": "I love a Mazda ! ❤️ how about a cx5?", "jennieyles_": "I have a Nissan Quashquai and love it", "kattss02": "The VW tiguan is great for room, all the seats lie very flat... there is not a thing that hasn’t fit. Its like a beefy golf. It doesnt have all the bells and whistles included like a sunroof as standard but the engine and space and quality can’t be beaten.", "melkeating73": "Hi Sam, I have had 5 suv type of cars in the past 10 years. My favourite was the Mitsubishi ASX! Brilliant SUV! I look at the Vitara & it’s not all leather seats even the top model.... Crazy... good luck", "misscolliversclassroom": "Toyota Rav 4. You can’t go wrong with a Toyota. They’re super reliable, plus very fuel efficient!", "curtainbounce": "Loooove my Mazda CX3!", "__jessicaalice__": "Mazda CX-5! Love mine! 😍😍", "marymsmith85": "Toyota RAV4 great brand but a gutsy little car. I have a Prado and I’m sooooo in love with it. But 4wd probably not all that practical in the city. The guys I take my car to, to service it. Have all brought there gf’s and wife’s Toyota’s.", "courtneynatalie_": "I have a Mitsubishi ASX and absolutely love it! It’s a ‘compact’ SUV but I easily pack a lot into the boot, and have my partner and our two Great Danes in the car no problem 👌🏻", "craig921": "I loveeeee the vitara it’s so versatile! Would support that choice haha otherwise the Nission xrtrail I also love", "volvocarsbrisbanenorth": "Can’t go wrong with the Wheels Car of the Year 2019.m, the Volvo XC40 🏆🚙. Big enough to fit everything you want but small enough to be nimble in the city. Stop by and see us in the valley to find out for yourself 🙌", "philliemillieands": "Love my Mazda CX-5", "myearringobsession_": "I love my Honda HR-V!", "iamadriannaring": "Mazda Cx5", "erinboorer": "@curvysam get yourself an outlander", "rachel_lasala": "I’ve had my HR-V for almost four years and have never looked back. The cool folding seats are only the start of the amazing features. Couldn’t live without the blind spot camera!", "balibliss181": "Hyundai i35.", "confessions_of_a_gcup": "This is one of my favourite views", "charlieethell": "I was a hard core Suzuki girl pre my Mitsubishi ASX and love it !", "lozzymichelle": "Love my Xtrail ST-L, you can get it in a sporty version. I chose it because it's very roomy in the back seats as my family members are big/tall like me. Plenty of leg room. Also the back seats can be moved backwards and forwards to make more room in the boot or back seats. Can also section off the boot for groceries etc. 😊 I also chose it because if I ever have the opportunity to become a parent there will be plenty of room. 🤷🏼‍♀️", "vic15star": "Go for Honda, Mazda, Nissan or Mitsubishi all amazing to drive. From past experience please avoid buying a Hyundai I know they may be cheaper option for the size but they crumble like a tin can ☹️", "sarahantoniaz": "Honda HR-V has magic seats. They're the best. Can fit a bike in there 😂", "livinglifethebrightway": "Just upgraded my forester to a used Jeep srt, absolutely in love it’s soo over the top though. My forester was perfect for running around town before kids car seats came on the scene", "cassdesireep": "Subaru XV or anything Subaru I absolutely love mine.", "amyyywalters": "I have a Asx. I love it. It's not to large but still big enough for everyday needs (1 child and a dog) as well as family and friends.", "biancabaileyandmilo": "HRV, CX-5 (5 years of absolute personal fave before I converted to a grand Cherokee - so many ikea trips!) Nissan qashqai. Can’t go wrong with a Japanese Build. My friend fit a fridge in her HR-V!", "rosie_winter": "I have a suzuki grand vitara and I love her 😍 I like how high up it seats you so you can see whats happening ahead in traffic. It's a proper 4wd but not so massive that you can't park it. I love it", "foreverosie88": "I’ve got a Nissan Xtrail and love it but the rav 4s are super cute", "jessiemac92": "Honda HR-V with the magic seats. So many cute things.", "jessstastic_": "I love my Honda CR-V. After I got mine a year ago I had two close friends and relatives buy one each as they saw how amazing mine was and needed their own.", "sez_leigh": "I love my Toyota FJ. It’s the best", "misskristylouise": "Honestly do yourself a favor & check out Honda! The HRV would probably be perfect for you & it has the magic seats, otherwise CRV is amazing!", "jennainai": "Mitsubishi ASX, easy and comfortable drive but with a smaller price tag 🚘", "miss_sueky": "So excited to watch your journey!! 💗", "laceyjadechristie": "I feel like the list of meet ups are endless! I can't wait to see what you come up with next!", "lukeygirl": "I love my Hyundai Tucson. Great boots size. Comfy seats. Handles beautifully but not a big mum SUV.", "hannnable": "I have a HR-V and it’s amazing! Not too small but big enough and the seats are super handy👌", "jess.i88": "I love my Mazda CX5❤️ Poor Girls Audi Q5 😂", "becky_norcott": "Yep Kia Sportage. I love mine! I have 2 kids and good boot space.", "antoranthony": "The Honda HR-V or Hyundai Tucson are great cars.", "butterflies.and.caterpillars": "Kia Sportage for sure!! There’s a reason they’re top on the list & you can’t beat that 7yr warranty! 🙌🏼👌🏼", "jessjaensch": "The mazda cx5 is amazing. It’s spacious but not too big. Good size SUV 😊", "jesssizzzi": "I have a Mazda CX-5 and love it, so much room! 🚙💨", "mel.mesiti": "The Toyota C-HR Koba! It’s my poor gals Range Rover", "onuntillmorning": "We have the Vitara Turbo and we looooooove it.", "willowcurves": "You achieved something so incredible over the weekend, you should feel so proud!", "gemz.o1": "Mazda CX5", "icurvy": "The car I loved the most was my Subaru Forrester", "beautifullyfkedup": "I second the Sportage 👍", "katie_parrott": "The swift did a great job carting everyone around!", "fullerfigurefullerbust\nVerified": "Verified", "katica_x": "I have a Mazda CX-3 and love it!"}