{"kel_does_stuff": "I’m exhausted after a huge stressful week, my five year old twins are exhausted after a hard week or prep. So I’m running up to the market as soon as hubby is home from golf to get fresh bread and fresh honey and then we are having a pyjama day. I’m working on some event stuff and planning work for my charity, the girls are watching movies on the iPad and hubby and my son are watching movies in the lounge. Exactly what all of our souls need. And it makes me happy that we all get to hang out in the house together", "rainyday_lingerie": "Dinner with friends Friday night and dinner with friends Saturday night! All about the hugs this weekend 😊", "amindunstable": "Monday the kids are at school and my man finally has a day off. Ahhh, air-con, no pants and gaming 💜", "coastalbeechstyle": "This outfit looks great on you 😊.. the huz and I are going to kick back this afternoon with a bottle or 2 of champagne and some prawns, which will make us happy today, maybe not so much tomorrow 😂 have a good weekend.", "micheala.tequila": "Enjoying my last weekend in QLD 😱 Moving from my hometown (townsville) to the \"big smoke\" Canberra 🚛🚛", "justaddvodka": "🙌", "meerustyle": "Beautiful 💙", "curvysam": "@willowcurves this is one of the walls in that spot", "peta_behan": "Seeing my nephew & his mama on the weekend and then checking out the @metremarkets 😍", "jessica.finn.9": "I'm currently spending my birthday weekend in Sydney. I flew in early this morning and I'll be there till Monday afternoon. Tomorrow night I'll go to the theatre to see Charlie and the chocolate factory the musical 🍫❤️", "littlemissclaire86": "I eventually have a weekend off work and I’m going to spend it snuggling my grand-babies ❤️", "ritamycyk": "I have a rare day off with hubby. No plans yet so prob just laundry. 😭😭😭", "joril_92": "Stunning as usual ❤️❤️ I need to repot the only plant I have left alive and continue with our home renos 😍😍", "jesssanzmua": "Bikram yoga and buying an electric bike. So frkn excited 😍", "erinbain91": "Have a lay in with my partner! We only get to do it once a week so we make the most of each other's company 💕", "72pauline7272": "I'm making 2 new cakes. One for my sister and one for my grandson. If you want to see my work you can at @mayfaircreativecakes 💖", "lisslings": "Go to the gym, visit my parents", "bec.smith.stylist": "Im having a lazy weekend netflix, sleep, cleaning and laundry 😁 👏", "roundedbasher": "Drinks and tacos with the girls", "livedexperiencecounsellor": "I’m going to write a big fat to do list for next week and get on top of life and all my plans!", "lozzymichelle": "Going to meet some of my dog's puppies 😍", "nataliek_00": "Family day at daycare- building the community.", "tootlepip72": "Time with the husband, pruning my roses & sleeping! It's been a long week!", "rainbow_bloom__": "I’m at my parents. My mum has dementia and I’m here to give my dad some time off for the weekend.", "therachproject": "I’m in Melbourne for the weekend so what’s gunna make me happy is exploring, shopping and eating all of the things 😍😍", "_tamaramae": "Ill be going to a local neet uo tomorrow so i can make me some friends! A small group and I'm so excited!", "tam75tazz": "I just got home from seeing Bryan Adams. Still got a good set of lungs on him. Have a fab weekend everyone", "what_bec_does": "I’m going to write another blog post!", "platter_to_plate": "I’m making allllll of the Platters 😂", "jensstid": "Brunch with my Bestie 💜", "57snowmonica": "Cuddle my new nephew 😍", "dessiebean": "Tattoo time this arvo, catch up on the AFL round 1, and start packing to move! All the fun shit 🤘", "busty_diaries": "Since my baby was born early I wasn’t able to have a baby shower (she came the morning of my party!) So, this weekend we’re having a do over. Baby shower/meet the baby party.", "katurtle23": "I'm hoping we finally get to sorting out the lounge room (including assembling the lounge) and unpacking some of the boxes, so we can actually use the living area in our new house.", "motomum0517": "I'm off to my happy place 😁😁😁", "theemmafiles": "Wine and hand sewing tonight, then off to the Queensland Science Festival tomorrow!", "mrsaimeelangridge": "I’m getting a pregnancy massage 🥰", "straightupgcup": "Just having drinks in Mooloolaba after a big week 🙌", "lizaj71": "Spending time with my elderly parents and their two BEAUTIFUL dogs whom I absolutely love to bits 😍😍 and have coffee with my best friends Mum who's here visiting and I love like another Mum 😊plus eat cake lol 😂", "kyliehams": "I’m going to spend time with some of my hiking friends tomorrow, hiking down at the Great Ocean Road. I need this, being in nature surrounded by like-minded friends makes me so happy, and my Friday has taken a very upsetting turn.", "vic15star": "Meditation, brunch, belly dancing and dirty dancing immersive event in Melbourne super busy and exciting Saturday!!", "kellihennessey": "I am going for a swim in the ocean 🌊 I love the sea, so restorative plus good hair, wild beach curls come at me 💋", "miacaracara": "Jarring home made quince paste!", "suza1414": "Time spent with my most special people because it’s my birthday!", "annelisekate__": "Celebrating my new strength after my 6-week gym challenge finishes tomorrow, looking forward to a democracy sausage after voting and really just chillaxing - I’m still recovering from Brisbane!", "allyluscombe": "I’m going to @bris_icecream_fest 🍦🥰", "meganl76": "Walk the puppers with a market adventure included. Visit with my young sister and watch the new season of queer eye! Have a great one. 💕", "katie_parrott": "That skirt is so good!!", "confessions_of_a_gcup": "Oooooo! Me, I am going to watch some local footy and go to the movies with a work friend", "rochelle.jpg": "I’m going to finish building my LEGO hogwarts!", "icurvy": "I’m going to try and get my life in order - which won’t necessarily make me happy, but will make me less overwhelmed 😂", "daniarmstrong": "I love this outfit Sam! Had the best fun with my girlies today. Went to the Sugar Republic pop up in Sydney. They had a ball pit for grown ups!!", "willowcurves": "I’m going to a music festival with a dozen friends to listen to all the music we listened to when we were 16!", "joeyhaes": "I’m in Bright, Victoria for the weekend ❤️", "delinadesign": "I’m going to the first Tiny House Festival! 👏🏻👏🏻", "lauradoesbrunch": "I’m going to my friends birthday party 💃", "siggas_journey": "Ooh cant wait to see whatever adventures you get up to! I'll be spending the next 48 hours studying, sleeping, and eating. All of which makes me very happy ❤️", "brittany.cutler": "Spending a FULL day with my girl after a long week at work and uni 😍 Also heading out for my birthday with my squad for some fabulous Italian food 🤤", "sezzaruberto": "Voting tomorrow in the NSW election, golf lessons for my son and some chill time", "patrice_lund": "Going to spend some much needed time with my family and my bestie 🙌🏽 hands in the dirt repotting mmmm so good for the soul 🙏🏽 enjoy your weekend beauty x", "mrsjomets": "Going to get some sleep after a 4:00am start today 😊 x", "korynreddy": "Spending time with my daughters, crafting, painting and whatever a 1 year old and 3 year old want to do 😊 let our imaginations run wild 😂", "sal_grif": "Celebrating my daughter turning 21 💜🌺"}