{"temmaperry": "Are you in Canberra?! I’m in Canberra!!", "bostonjacqui2410": "You could wear it anywhere but I picture us drinking rose at stoke house. On the water. Match with a nude Pair of heals. Wow absolutely stunning and classy gorgeous dress the colour on you it’s just amazing and the style 😍😍 let’s go to races or picnic on beach. It’s like it was personally designed for you", "thesimpleglamazon": "This Justice perfect or work. I would pair it with a pair of espadrilles!", "imhungrymax": "Love this dress!", "curls.curves.charisma": "Totes Gorg!💛", "bumps2babiesau": "Beautiful dress. Looks gorgeous on you. I travel with work so love these dresses 😊💛", "womanofstyleandsubstance": "Ohh love 😍😍", "birdsnestonline": "What a stunner you are! This dress was made for you! 😍 Love, Shannon and the birdsnest girls x", "curvynursey": "This dress looks so amazing on you Sam! And crinkle free? Sign me up! Love a glam look with out having to iron. Would those sassy gold heels of yours go with this outfit ? Pink and gold... ❤", "somewhereouttherejesuis": "I would wear that everyday - looks so comfy and easy to put on! 🙌🏻", "mollyroselove": "Oooh that’s nice - does it come in a blue?", "chloeamandab": "❤️🙌🏽", "crochetandcaffeine": "I love a wrap dress for work because they make it look like I’ve made an effort without even trying!", "2012katg": "@curvysam left a lovely comment on Birdsnest’s post. I think my comment is the only one that they’ve specifically replied to/ commented on 💕 Love seeing everyone represented ✨", "pennytruslove": "Black kitten heels. And a leather jacket - there are heaps around atm...", "lovelyinla": "Gorgeous dress on you 💕💕💕💕", "girlbored": "@sarahhertrick", "katy_potaty": "Yessss to the Belle Bird wraps!", "justaddvodka": "❤️🖤❤️🖤❤️", "sere_anto_cecca": "Wunderful ☺️", "sinceresallyscout_kath": "Hey Sam, We should work & collab together! DM @sinceresallyboutique and let them know we sent you 😍🔥", "jessiecassandrahall": "I would totally wear this to work! With a nice pair of black heels! ☺️✨", "online_bag_lady": "Our leather Sophia in pale pink bag would be divine. Or go bold with our Femme leather bag in Fushia Pink 💖You look amazing x", "antoranthony": "Looking great 👌🏼 such a fun print.", "lauradoesbrunch": "Yes I love this! Love seeing curvy gals out there. I think I would go a little classic brown wedge or chunky heel to go casual with this", "_berrinda": "You look gorgeous babe! Killing it 😍", "jobeaz": "Work 👍🏻", "pinkbarbiedoll33": "Looking fab as always!!!! 🙌🙌🙌❤️❤️❤️😍,I would wear it to a cafe or to a few places really,as it is versatile 😁👗,I'd wear pink high heels as I loveeeee pink 😍,omgggg AND crinkle free!!! Now your speaking my language as I don't iron anything 😂😂😂,I'm loving that this is plus size and good on you for representing all us curvy girls out there!!!!", "truuudo": "I lurve this dress. I’d wear it casual to the markets with some white sneakers, with ankle boots or even tan heels. Thank goodness for another Brand that comes in my size. Thanks for showing me @curvysam.", "danibower": "This dress is almost as stunning as the model!! Loooove that it’s crinkle free too! Let’s be honest I’d probably pair it with some sparkly flats - coz that’s my jam! Tell me there’s most photos coming??", "ccbloom90": "Glad to see brands incrrasing their sizing to include more shapes and sizes. And seeing clothing on a similar body shape is SUCH a breath of fresh air. You're looking like a SNACK in that dress 👌👌👌", "dave_gone_somewhere": "Looking great Sam! That super suits you! 🔥", "kattss02": "Yeah I was thinking black accessories would be the go with this one!", "katurtle23": "I'd be wearing it to work. Probably with black heels. Super cute dress.", "emz_extra": "So pretty!!", "supersimone365": "Let's get @curvysam to Cooma for a styling sesh + some D&Ms @birdsnestonline 🙏 ❤️", "tarajadecakes": "Loving this dress from @birdsnestonline on you @curvysam. Looking fab as always!!", "theswiseone": "Sah cute! Black patent pointed heels or flats or bright white converse for a casual look", "mademoisellestevie": "YAS!! YOU LOOK BEAUTIFUL 👏🏼👏🏼👏🏼", "ellebowandlu": "Is this pink? I love it! Coming into Autumn I’d have to go with boots fo sho.", "katie_parrott": "White shoes! Or black! Looks like a divine work dress to me", "jjdeets": "I would wear black scrappy high heels. A cute wedge would look fabulous too!", "icurvy": "I love a wrap dress and you look stunning in this one ❤️😍❤️", "siggas_journey": "Love this! And I love that I could wear it to work but also to lunch, just swap the flats for some snazzy heels and I'm good to go 😍", "super_mum_of_4": "Looks soo comfy 🥰🥰 did I just read that correctly no need to iron 😱😱 it’s offical I need this dress... nude wedges with a nude bag and bright lippy would so go with this dress... @curvysam u look soo beautiful", "iamrita_h": "Luv the dress! But what I do luv is that you could wear this with heels and chunky sneakers.. Crinkle Free too... 👍", "confessions_of_a_gcup": "I’d pair a set of green pumps!!", "daniarmstrong": "It’s gorgeous on you Sam!!", "willowcurves": "Ohhh I love the colour! I think it would be a perfect interview dress! Fun but still professional", "miss_sueky": "Perfect brunch date dress with strappy heels!", "ali_shannon_h": "You look absolutely beautiful....this dress is fabulous x", "tanmunn": "I love a wrap dress. Soo flattering for all 😍", "mrs_porter01": "Love this style of dress, so flattering for every shape 💕", "jessica.finn.9": "Light Pink flats or Wedges would look nice", "fairypants": "Wow girl 🙌🔥 I think this can be fancy OR cas!! Good to know they go up to a bigger size and travel friendly! ❤️"}