{"amandaholt_": "And the shoes they do are great too.! 🙌🏻and the pants!!", "laceyjadechristie": "I cant with the cold weather. I actually spent today thinking about how great it would be if i moved to Brisbane", "lajoieskin": "♥️", "tml051": "Sorry its a massive thumbs down to TS for me....", "lovelyinla": "Love this Sam!!!", "brooke_alb": "Always good quality.... and great comfort!!! I think they are starting to market to a bit of a younger audience which is great 👏", "platter_to_plate": "Now amazing is it!? I loved being there last weekend ❤️❤️", "kayla_ebony": "Ts totally rocks some pieces and totally flops on others. But when you find something you love they are 100% with it ❤️", "nooshjewellery": "Loooove that jumper!!!! The neckline is gorgeous and the colour is fab 🙌❤️", "donavan.k.govender": "❤️❤️❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥🔥🔥", "flower_power408": "Yay u found a pink wall", "_leahnolan": "Cool pictures!📸", "joeyhaes": "Beautiful ❤️🍁", "jocullenlander": "Hi Sam, what sizes does it go up to?", "jennajennajingle": "🍁 Gorgeous ❤️❤️❤️", "debstar444": "I had checked out @takingshapestyle over the years and didn't like it much, last year I went in and haven't stopped going back, I'm loving some of their newer ranges and I've developed a whole new classier style that gets me a lot of compliments and my confidence has had a massive boost. The quality is definitely very high as I love that they have very decent sales... I love this jumper on you...", "ann_scully": "What a gorgeously comfortable and fetching outfit 😍", "cazzakenz": "Super cute top and great length too. You look fantastic 💜", "thepiquantfox": "First time I've heard of this brand! Maybe because I live in the forests of country WA?? Keen to check then out :)", "beckcarlson": "Yep love the too! I have a few basics from them as well. Ill check it out 💚💚💚", "howdystrangers": "Love that Jumper. And you’re right, I love taking shape, not all of there clothing but I like to pick and choose pieces. They have excellent sales too!", "lauradoesbrunch": "Super cute ❤️💖 loving the colours", "lizphoto": "Yasss love this! You look great & love that top 💕🙌🏼", "joeymckenzie__": "Oh my gosh could you be any cuter?", "takingshapestyle": "Looking fabulous in this colour x", "leanne_erbs": "Love this outfit and I would certainly wear it myself. Hoping the jumper comes in other colors as I dont usually wear red. I am also hoping it is available in NZ as we dont get all the lines released in Aus here in NZ.", "styleandspace": "Lookin good girl! 🙌🏻🌸♥️", "ponticellogiulia": "Looking beautiful love this look. Hopefully with you on board, I will be able to fall in love again with @takingshapestyle It's lost its quality and choose for me, not mention high prices. But saying that I wait for the sales.", "_mulissha_": "This is such a rad outfit, i love it 😍🙌🔥", "misskristylouise": "😍", "beanebag": "I’m not against TS and often browse their website but for me their style always seems to be primary colours, tunics and appliqué tees which doesn’t really float my boat.", "prudencejh": "Love the colour and cut Sam! Taking Shape always had really great pieces and they last FOREVER!! Must head into my local sometime soon the girls are lovely and the pieces you have shared recently make me wanna head in😍", "millicentwebb": "Brought my first item from @takingshapestyle it was the girlfriend jeans and I’m in love 😍😍😍 well worth the money and comfort is next level!!", "jessjaensch": "I’ve just started going into taking shape and they do have some good pants 👍🏻 I’ve also bought some shoes from there too. There’s always been a few things in store that have caught my eye 👁 thanks for sharing some clothing tips @curvysam ☺️", "justaddvodka": "Yayyyy❤️", "amy_mildura": "I love the length of this! And can’t beat red. I stalk taking shape releases and always pick up a few pieces. I agree that TS items are long lasting 👌", "michelle_mck": "Love it", "kerryn_69": "Love it 😊", "juzsavage": "I found the most beautiful velvet coat in taking shape last winter. It could almost pass for vintage. Plus their undies are amazing!", "justkatelouise": "I absolutely love TS, they do have an older section but there other “younger” fashion is amazing, the quality is AMAZING and it’s definitely on the pricy side but that’s what you pay for but in saying that have really good sales all the time. Even up to 40% off. 👌❤️", "inburstsofcolour": "Yaaaasss!! Gorgeous 😍 loving that pink and red vibe!! 💖", "joadymacas": "I shop at TS and it isnt for everyone. You say older demographic yet their models are young and in proportion. I understand for their catalogues but for their insta cant they use normal people like you and older ladies like me and my friends???", "lizaj71": "Love this outfit look on you @curvysam 😍 Happy Easter too 🐣🐰🍫", "katie_parrott": "Love the pop of colour!!", "marymsmith85": "LOVE IT!!!!!!", "egak": "I'm really liking TS at the moment, yes they are a little pricey, but they always seem to have sales.", "mandyhar73": "I’m a Melbourne girl through and through 😍😍😍 I live in the Yarra Valley though, the traffic is getting worse though out there. A place would have to be be pretty special for me to relocate, we’ve got it all here and more 😎🙌", "confessions_of_a_gcup": "Bring on the cooler weather! My wardrobe is totally not ready for it though", "curvebridalboutique": "#love the red babe !🔥!", "jaydemelissah": "That knit looks soooo good on you!", "loopistyle": "Pink and Red ❤️🌸❤️", "icurvy": "What a great colour - I’m loving the vivid red ♥️♥️", "willowcurves": "Red is a perfect colour for autumn! Love the leaves!", "carries_petsitting": "I’m currently in Melbourne too. Lovely weather! 😁", "jessiecassandrahall": "I probably wouldn’t wear this to be completely real, but I do love the colour and the length is great! Also loving the Pink and Red clash 👏 my favourite thing to do!"}