{"marjiverach": "Isn't it romantic! With rebel wilson", "k.kealywatz": "OA and umbrella academy for sure!!!! The Order also!", "birdsnestonline": "You're such a stunner Sam! What a beautiful smile! Love, Shannon and the birdsnest girls x", "mademoisellestevie": "You look AMAZING!! Just being your best self 🙌🏼", "thryvdigital": "Beautiful lady 🙌", "icurvy": "Also that jacket is incredible!", "fitgurli": "🌹🌹🌹Amazing, we are looking for models", "alana_odea": "LOVE the Blazer", "janegbodyimage": "The Good Place and Dirty John", "bellamanagement": "🙌🔥", "plussnow": "Following 🙋‍♀️", "mama.duck.said": "Beautiful 💗", "leannezimmermann": "What a fabulous way to spend Easter 😘❤️", "jstar_eight": "Atypical is awesome.", "_laneandco_": "We just finished watching Spartacus. I’m currently watching the OA which is out there but hooks you in.", "thebiggerblog": "Such a cute jacket. Love it!", "saraaaelizabethh": "That jacket 😍😍", "curvyau": "Oh spill the tea girrrrl ❤️❤️❤️", "joeymckenzie__": "Umbrella Academy!!! If you loved Sabrina you’ll love it! And also, how freaking amazing is Sabrina 😍 That second season...I nearly died!!", "howdystrangers": "I purchased these jeans this week! Thanks for the recommendation Sam. 😍", "salerose": "That blazer is everything!!! Have you seen grace and Frankie ? It’s really funny! I just started Our Planet!", "thatlakengirl_": "This is cuteee girl!😍", "geeyourebrave": "Queer eye season 3", "silversarah17": "santa clarita diet is my absolute fave netflix show ever. silly, witty and hilarious but not for the easily squeamish. #sclockhorror", "theannoyedthyroid": "You, Queer Eye, Derry Girls, Sex Education 😀", "beck_birdy": "Grace and Frankie is hilarious and there are 5 whole seasons to binge on Netflix 😍 P.s- your jacket is amazing 💖", "jessieclaire88": "Ooooo this is on my wish list!!! Is it a comfy jacket? I reckon it would help brighten up my office lol", "jess_smith_86": "Santa Clarita diet, after life (trigger warning-suicidal themes), black mirror :)", "72pauline7272": "Nothing. I don't have Netflix....", "daleenglund": "Animal Kingdom! You look 👌 and I now need this outfit!!", "nerdinista": "Umbrella Academy! ☂", "biancabaileyandmilo": "Sex Ed, Umbrella Academy, The Good Place 😍😆", "cupcakessunshinencoffee": "I just watched Afterlife with Ricky Gervais it was excellent!", "itspernillla": "Line of Duty, Luther, Bodyguard, Marcella, Broadchurch, the Sinner", "sparklesandlace": "I’m a Stan girl myself. I have both but watch Stan the most. So I’m no help! I’ve sent you a PM so you should be able to message now 😊", "eanewby18": "Love the jacket!", "nikkinat77": "Absolutely love this look! That blazer is fantastic 💕💕", "lovelyinla": "All American, Lucifer, Santa Clarita diet 🙌🏻", "simonehanckelphoto": "If I Hadn’t Met You is my newest favourite. So good! Also loved Sex Education 😊", "what_katy_did_next": "OMG this jacket!!!", "danni_and_archie": "Just watched dirty John which is good! Also if u haven’t watched the OA give that a go! Oh and if u haven’t watched sense 8 do it because it’s amazing 😍", "dogsvdragons": "Oh my @nat_revell I think we need to do a day trip to Cooma!", "thesimpleglamazon": "Ive gotta look for this blazer!", "lcost73": "Dirty John ... but it might put you off online dating for a bit 😩", "fleurdarling": "Love that blazey!", "sandradearing": "Lucifer for the win on Netflix 🙌", "kylie_brooks1984": "Dirty John!!!! OMG its intense though!!!!", "_carlz": "Sex Education - makes you glad to be past high school and being a teenager. Laughed out loud. Doesn't take too long they've only done 1 season so far 😁", "jenna_a_j": "Love the jacket!", "busty_diaries": "The Ted Bundy Tapes was unsettling but I enjoyed it. Not sure if that’s your jam?", "runmegsyrun": "That jacket!!! 🙏😍", "claireparka": "Line of duty 👌", "crystalmicheala": "I am loving people suggesting Schitt's Creek! Yes!!!!", "cherry_cherry_77": "Blazer 💕💕", "champagne.mel": "Any full length photos of the outfit?", "online_bag_lady": "Love the jacket! You look great", "krista.bear": "Nashville on Stan is my current obsession... I’m a little bit smitten with Connie Britton - and I didn’t even actually mean for that to rhyme, but there we have it haha 😂", "theillusivefemme": "That jacket 💙", "emilyhewitt1": "Schitts Creek on Netflix - seriously good comedy, loved it 👏🏻", "krissy.osullivan": "The Good Place!! Didn’t think it would be my thing but omg I got so hooked! I’ve finished it already 😍", "jesslou79": "If you are into medieval saxons vs Vikings, check out The Last Kingdom", "krisssty": "Animal Kingdom. The Good Place. Or Younger on Stan🤗", "justaddvodka": "🍪🍪🍪🍪", "jessica.finn.9": "I'm currently watching Series 3 of Queer Eye on Netflix and I watched Bad moms on Saturday night which was hilarious 😂", "jessymon": "That jacket 😍❤️🌈", "bridie.mcintosh": "Also How to Get Away with Murder / The Blacklist. So good !", "snepal123": "Schitt's Creek! I really enjoyed it :)", "tanmunn": "Mary Kills People. It’s on SBS on demand.", "fatgirldoesstuff": "If you like true crime, the Gianni Versace series is fabulous.", "coastalbeechstyle": "Love the jacket... we are watching after life, its not bad", "joril_92": "That blazer is EVERYTHING 🔥🔥 I just finished The OA but a good binge would be Santa Clarita Diet. Hilarious.", "jessstastic_": "The OA", "samanthastyle__": "If you like drama, Jane the virgin is my current obsession 🙂", "kayjay5": "Bodyguard. And not just for Richard Madden 😉", "georgieegirl27": "@birdsnestonline love this jacket! So glad you are modeling it @curvysam !", "elspeth12": "It’s not looking good for you getting a fire 🔥 But with or without fire The Good Place was binge-y", "juzsavage": "Nashville on Stan!", "confessions_of_a_gcup": "I LOVE THIS JACKET! Unmmm Netflix...I love re-watching gossip girl, OH and the good place is amazing", "fimailer81": "That jacket is everything!!! I’m binge watching the golden girls on Stan ........ that show is even funnier as a grown up and you understand the jokes (I used to watch it with my nanna when I was a little little kid)", "willowcurves": "Ohhhh damn! That jacket! I am literally on my way straight to @birdsnestonline to get it!", "samanthajoanmary": "The Umbrella Academy is so easy to binge!", "ashas_curves": "Sierra Burgess is a loser, I’m going to watch tonight, will let you know If it’s any good", "kyliehams": "I have no recommendations, it takes me years to watch one show 😂 But it’s looking like it’s going to be fairly warm down here over Easter fyi, particularly on Saturday & Sunday - mid to high 20s", "onlyjustjo": "If you’re up for a bit of a thriller, try You.", "kylie_ad": "I think it's going to be mid to high 20's all week... love your jeans!", "antoranthony": "Love that jacket @curvysam", "lisslings": "Loved the new Ricky Gervais one", "ahhchah": "I binged the latest The Santa Clarita Diet season in a day last week.... love it!", "inburstsofcolour": "Love that blazer! 🌈😍 Ok Netflix suggestions: Unicorn Store, Santa Clarita Diet, Queer Eye, Sabrina, Crazy Head are all awesome 🙌 and am pretty excited about starting Special! Looks so good!!", "meandmine82": "That jacket 🙌🏻", "franmyworld": "Killing eve on abc iview", "deannabuckley": "Dirty John 🤗😊", "kellihennessey": "I love that Blazer! 😍", "sarahlight26": "That blazer is the bomb 💣", "katie_parrott": "Firstly, you look amazing. Secondly, I watched the Madelaine McCann documentary series which was super fascinating (and sad), do recommend."}