{"lizaj71": "@curvysam wear wear wear these colours OFTEN because WOW they're stunning on you 😍oohhh and love those pants too.... off too looksy 😂", "mrsaimeelangridge": "How perfect the colours are for this time of year! They also look lovely on you 😘", "mademoisellestevie": "So autumnal! Looking beautiful!", "maddi.higgs": "This is such a great photo! Love the warm tones on you, I need to try this and stop living in monochrome 😂", "nataliek_00": "So lush!! 💗", "gilllyyyyy": "Gorgwahhh!!!", "a_knights_creations": "Love rust!", "kirsty_zak": "Stunning @curvysam 💕", "ariwearsthings": "I don’t know if @madewell ships to AU, but they have a lot of autumnal colors.", "hannpollock": "Love this!et me buy these pants!!!!!!", "harmony_industries": "These colours are indeed heaven 😍", "fatmumslim": "I could not love this photo more 😘", "joeymckenzie__": "Ohhh love these two together gal 🔥", "zarc_clothing": "Gorgeous Sam!!! You look so relaxed!!!", "lisamichelle115": "Totally approve 🙌", "collection.of.my.adventures": "You look lovely! These are some of my fave colours too. Especially mustard! 🧡💛", "sharon_donald": "I work at autograph and we have had heaps of things in these colours come in. Been selling like crazy in my store.", "platter_to_plate": "Stunning 😍😍😍", "mustangsallytwo": "Beautiful girl! Love this on you 💕", "diversetherapies": "Great colours - looking fabulous 🙌🏻💞", "lindyloumac": "Congratulations on making the Fab Four 😄", "bht_khan123": "You look amazing sweetheart", "felixjohn871": "so nice", "thebiggerblog": "I have the same with these color tones. Love the natural tones at the moment", "busty_diaries": "Bare foot is my favourite way to be!", "birdsnestonline": "Sam I think @katie_parrott said it best, these colours really suit you. Beautiful photo and lovely outfit. 😍. Enjoy the cooler evenings, we are already enjoying some pretty big frosts down here in Cooma ❄️ a QLD winter sounds pretty ideal. Love, Pen and the birdsnest girls x", "meg_s_moore": "Beautiful tones", "misskristylouise": "Gorgeous I love this colour!", "kellee_merriman": "You always look great but this is 😍", "supersimone365": "oh these colours look great on you Sam and totally into grounding as well 🙌🏼", "jennifer__kate__": "I can’t remember if you already bought them but Ally has an amazing pair of rust culottes with buttons on the side. I got a pair and don’t want to take them off!", "life.by.jayde": "@bohemian.traders has just dropped a heap of gorgeous rust goodness. ♥️", "ranece": "The colours look lovely on you! And looks like you had the best weekend! 🐶💕👌🏽", "pattyspankpants": "I just picked up a snuggly, soft rust coloured oversized cardigan from Kmart today! LOVE THESE COLOURS 🔥🔥🔥", "icurvy": "Love this photo of you - so beautiful ✨", "styleandspace": "Hell yeah! Looks great 🙌🏻🌸", "andieandolliephotography": "You rocked this outfit girl!!! 😍", "antoranthony": "Yasss work! 👏🏼", "jennieyles_": "@bohemian.traders has quite a bit of rust", "willowcurves": "I’ve never suited autumnal colors but they look great on you", "katie_parrott": "I looooove these soft warm colours on you, such a heavenly photo!", "confessions_of_a_gcup": "I love these colours on you!", "_._d.e.l.e.t.e._._": "Love this outfit 💛🧡🍂🍁"}