{"bfield88": "I just bought 5 of the jeggings from best and less - they feel like real denim and absolutely amazing.", "christinecorcoran_coach": "Totally in need of new winter clothes so will haveta check these out 💗💗💗", "coastalbeechstyle": "I'm going to check them out thanks😊", "curvyau": "Cute! 🌸👌🏻✨", "mademoisellestevie": "You look so CUTE! I love this look, business chic.", "confessions_of_a_gcup": "I need to try these! Do you know what sizes they come in?", "fontaineaimee": "Great..always hard to find nice pants. Definitely will check them out too ☺️", "nadiaperixo": "Slaying that pink wall 💖", "72pauline7272": "I have 2 pairs and could wear them all day everyday they are that comfy!", "_jane_liz_": "I just discovered these this week too! I got the grey ones but after I wore them for ten minutes realised they were too big and exchanged them for the smaller size and I love them! Very cheap and comfy and look amazing ❤️😊", "kyzza_": "Looking great @curvysam. There will be no best and less pants available now.", "thesimpleglamazon": "Girl this is my daily work uniform!!", "sheikeloftgirls": "Hey babe, your account is amazing! We would love to work with you, Dm us for more info! 💞", "aquatalia": "You have amazing style! ❤️", "justaddvodka": "Fab. U. Lous!🍾🍪🔥🐣", "llivia_beaute": "😍😍😍 love this outfit. Didn’t know about these pants! X", "k8t1979": "Omg finally got a chance to check these out today. No 18 in black so got the 16... and they fit! So amazingly comfy. Thanks for the tip!", "joeymckenzie__": "These pants sound amazing! Might need to go check them out!", "pepperpinegum": "@missayres_s this Sam has some style, likes your pants 😉", "melgj87": "Omg I have been singing these jeans’ praises for the past few weeks. So comfy!!!", "bels_style_file": "Great pants 👍😁", "missdynsty.curve": "ADORE your page 😍 Wanna Collab? Take a peek at out website and DM us if your interested 💗 xxx", "willowcurves": "I’ve loved seeing how everyone has chosen to style them. The blazer and tee combo is such a classic!", "natellapip": "I bought a black pair and omg they are amazing! I sit all in my job and these were great (hate pants that dig in too much) so comfy !", "holly_.cee": "Yaaaas! They look work-appropriate and have a tapered calf, not like so many pants I've tried on where the calf part is as wide as the thigh part 😣😅", "miss_sally_b": "Apparently I need to get my butt to @bestandless love that they’re so stretchy! Need!", "lauradoesbrunch": "I’m so about these pants! 😍 Saw them on your stories the other day and didn’t quite believe you (I mean they are only $20) but they are actually some of the best pants I own now! Thanks sis! 💃", "hannpollock": "I want these pants 👏👏👏", "kattss02": "Can’t wait to get my hands on them! One in every colour pleasethanks!", "itspernillla": "They didn't work for me 🙁 they fitted ok up top but far too loose in the leg and also a bit short. Such a shame", "leanne_erbs": "Great casual style. It looks lovely on you and very slimming.", "mumtumsandpancakebums": "Bloody hell!! Everyone is raving about those @bestandless jeans!!! That's it, I'm going to buy a pair tomorrow.....!", "anouschkac": "Great to know they come long. its impossible to find good comfy trousers that fit the hips and hit the length:-) 😊", "jessiecassandrahall": "20 Bucks! Bargain! I need the grey pair in my life 🤪", "sisinamasinello": "Looking fantastic as usual xx @curvysam", "emryan75": "I’m super short, found the best and less jeans were really long 😕", "claire.elise87": "Looking smart! 😍", "thatgirl_lucyryan": "Honestly can’t believe how comfortable they are hey?! Absolute bargain! 😍", "lizaj71": "Aren't they comfy 😍 for cheap $20 jeans they're pretty darned good i say 😁", "ann_michel": "@jageli3 you would look cute in this outfit.", "brittany.cutler": "I got a pair of these pants this week cause I’ve seen soo many people posting about them. And holy guacamole they are the shiz! Love them so much. Even got to size down, which come on let’s be honest- it’s rare these days to find something tts"}