{"darraghpearsetuite": "Blondes have more fun 🔥", "dianecovinoptyltd": "💕❤️ Beautiful Lady ❤️💕", "thisisldizzle": "Keratin treatment is incredible!", "lizaj71": "This retired hairdresser loves the new hair and yes keratin treatments work wonders 😊 as for being fussy searching for a hairdresser well so rightly you should because as someone who’s been on both sides of “the chair” you’re inviting someone into your personal space and that’s pretty ‘intimate’ so trust and confidence are paramount for both parties in my opinion 😊😘", "jess_smith_86": "Looks amazing! There is a red check dress in one of your pics and I need it in my life 😂", "punkybunkie": "Absolutely a hair transformation!", "sistaandco": "Looks fabulous!", "theswiseone": "Omg I love it!!! You look amazing.", "daniarmstrong": "Your hair looks sensational! I am in love with Keratin treatments, I am onto my third! It’s going to be so good for your hair!", "shushuboose": "😍😍😍 Suits you beautifully x", "carlyd12": "Do you know which brand/type of Keratin treatment they used? I’m currently researching having this done but there seems to be a few.. feeling lost and confused! Yours looks great 😍", "curvebridalboutique": "Wow such a transform 🙌🔥😘", "jessie_haddacks88": "Your hair looks beautiful Sam! I wondered what particular range of the Bosley shampoo that you use? I remembered you me mentioning them before but they have so many to choose from! I’ve suffered with PCOS for years and dread washing my hair as it comes out in handfuls.", "bigboldbeautifulblog": "Your hair looks lovely! I love how it feels after going to get my hair done!", "tsid_clothing": "Gorgeous! It’s hard to find a great hairdresser, once you have one though.", "birdsnestonline": "Looking stunning, Sam! Your hair looks so incredibly healthy!", "hannahjanzen_": "I’d love to know what products you used for hair growth please! I’m completely lost with where to start! Also can you do the karatin yourself or is that a salon online product? Looks lovely!", "carla_sully_84": "Beautiful!!!! Love it looks so healthy", "lizzy_lou88": "Looks beautiful 🥰", "mamma_dog": "You have your Mamma’s beautiful hair Sam 🥰", "mademoisellestevie": "Looks amaze! You would any hair colour 🙌🏼", "izann205": "Beautiful", "larbaouiothmane": "Beauté", "justaddvodka": "🙌🙌", "confessions_of_a_gcup": "YAaAaaaaaas", "amysheppardpie\nVerified": "Verified", "natasa_rusit": "I had no idea u had such fab curly hair! But as a fellow curly sista I understand why smooth = easier! I have done the chop cuz #mumlife but I'd love to know is the keratin just a treatment or does it straighten too??", "newstylechapters": "Looks gorgeous Sam. Perfect 🙌🏻🙌🏻🙌🏻", "ansandfinnian": "So pretty 😍🎉💁🏼‍♀️ x", "temmaperry": "Gorgeous!!", "leannezimmermann": "Glorious before and afters 🙀 hair flicks all day gorgeous lady 🖤", "karleyhokin": "Omg wow 😮 😍", "vanessamaisie": "Bombshell reowwww 🔥😘 *all of the wolf whistles*", "livgracecloud": "i loooooove curls so much but i must admit, keratin straightening is great for people who just don’t like to manage their curls. my mum has gorgeous curls but they were always fluffy and thrown back in a ponytail, she just had keratin done and it looks so put together! it’s less work for sure", "supersimone365": "looks great Sam, how long does the keratin treatment last for?", "kattycakes10": "Can you still curl it with tongs after this @curvysam x"}