{"laurenzoe.x": "I'm just about to buy a new swifty", "teggles88": "I have one of the new swifty's and absolutely love it ♥️♥️", "___jximee": "I love my Swift (Suzie) too much to upgrade her!", "super_mum_of_4": "I love my car too much the thought of getting another one scares me. I am soo emotionally attached that I cried when I test drove my future car😭😭😭... When your ready to get a new one you will know ❤❤ goodluck", "the.jessica.ritchie": "Yes!!! I felt the same about my little Swifty. Loved her! Shed tears when she left 💗", "georgieegirl27": "I sold mine of Facebook. Stick to your guns on price. Get a cash deposit then get them to send a receipt of payment - that way you’ve got their banking details. — write them a receipt and sign it saying it’s being sold as is, no refunds. Make sure you get prechange over paper work sorted you need a certain slip to sell it (a mechanic needs to look over it) and fill in the change of rego with the buyer so you know it’s been completed. Go with them when they test drive it. They only need to go round the block.", "biancabaileyandmilo": "I sold my last car on Facebook marketplace randomly! It’s always so painful though. I hate it. And I hate the playing hard ball with the price. No tips on that one, just know what you want and stick to your guns!", "summerhayes__": "@curvysam i used carsales to sell my 2012 holden barina. It was a breeze!", "beck_birdy": "Defo list your car on both carsales & gumtree. Give your car a good wash/clean and Take as many photos as you can (20+ for carsales, & Gumtree alow 10 pics) try and order the photos so the viewer feels like they are seeing the car in person ie. outside shots then inside. Write a bit of a story as well, just like you have here and let petiole know what a great car it has been and why your selling. Also if it has been one owner since new/lady driver/non smoker/no pets etc. List the key features & accessories in point form so easy to read/scan info. Good luck 💖🚙", "jakwalena": "When my friend and I sold her car, we listed it at the same time on both Gumtree (free) and CarSales ($60+) and it was sold within 24hours to the first person from Gumtree. So my suggestion is try Gumtree first and see how you go, you might easily save the $$!", "emryan75": "I struggled to sell my second car - Ford Festiva that I had won in a raffle! 🚗 I drove it for 12 years", "simonewiththeredhair": "I recently sold my car to sellmycar.com.au. They were great and offered me the same as what I would have got for a private sale without the hassle", "catdarlin": "You can check used car sale prices online. I think with Kelly blue book. They post the price expected as a dealership sale, private sale, and trade in. Get a quote on the trade in option even if you aren't thinking of going that way. At least in the states I've noticed people selling used cars for under the trade in value in ads. Ironically the system here seems set up so that a private sale benefits the new owner and not the seller. The law dictates a 30 day guarantee for cars sold any price over $4500 here. I believe they call it a lemon law. I'm not sure if there's anything like it in Australia.", "eanewby18": "I hate to say goodbye also! I'm still holding on! Good luck selling!", "shanonni": "I actually brought a new car yesterday and just traded my old one. I'll be looking forward to saying goodbye because the new car is all about new starts. Just remember both as a buyer and a seller that the price on a car can be negotiable. Don't stress about a tear, they can fix it if they want. As for all trade ins being rip offs, they paid me lots more than my car was worth.", "bycassandre.women": "DM @bycassandre for collab💞👙", "angelically11": "FB marketplace. I sold mine within the hour.. good luck ☺️", "m_ee_e81": "I had my car for 8 years. I moved in it a number of times, cried in it, had a great time in it, even drove my new born baby home in it. I cried my eye out when I sold her", "birdsnestonline": "We hope the process ends up being a breeze for you, Sam! Love, Shannon and the birdsnest girls x", "ness_butterfly23": "I bought a new second hand car in February. It was time for a newer one.", "katiestayshome": "Just washed and cleaned my car (giving it to my parents) and picking up my new one in the morning. Feeling sad to say goodbye to my ‘Dory’. She’s been with me through highs and lows and has been my second home as a single gal. She’s served me well. I 💯feel this post.", "joeyhaes": "Oh hey Swifty", "karen_murray_au": "just choose ease, you’re busy enough. Trade all the way, just negotiate hard on the changeover sum.", "heyitsmemaddybee": "Offer for them to be a passenger as you drive it, so they get the experience of being in the car and seeing it all works. Or if they insist on driving it, go with them and also hold onto their licence as an insurance policy. And re: fixing the tear, I would only do it if you really need to get a good price on the car (it'll likely improve the sale price of the car but it's effort that might not be worth it...).", "becizzle_": "I decided to trade in my car rather than trying to sell it private. Way too much hassle with time wasters etc", "boemoon": "My betty recently broke down after 13 years of services. I was so sad, we went threw alot together... like you she was one of the only constant in my life.... it was hard saying goodbye. I reckon check out it value on redbook and trade in.", "msjpo": "I change my car every 2-3 yrs and always sell privately. 1. Never hand your keys over. 2. I’ve previously let people test drive but will make them sign a document saying they’ll pay insurance excess if they insist and take a photo of their license. 3. Ask for bank cheque/direct deposit for payment. 4. I wouldn’t bother getting tear repaired unless it’s an easy thing to do. Good luck 👍🏼", "willowcurves": "It can be hard to fathom how to start a process like this, hope someone gives you great tips below - I’ve got nothing sorry", "sambutt": "I’m in the same boat! Don’t want to say goodbye to my baby. Like I’ll literally cry.", "rockstarmumma": "Try Fb marketplace...I was in the motor industry for years... Shop around for your new car and try and buy towards the end of the month...I’ve heaps of industry contacts so if you want a hand just send me a Dm .😘", "sallylmatthews": "I'm with you, even when I get a brand new car I'm sad to see the old one go. I've had this one a little too long but it's almost time. Love the outfit too!", "jesssizzzi": "I used car sales and sold to the first person who looked at it. I went with him when he test drove it. It was heaps easier then I thought it would be but be aware- people will bargain on price so have a clear figure of what you want and add some $$ to it so they feel they are getting a bargain 😉", "___caitlinparks": "I’ve sold 2 of my own cars off gumtree and my mum has sold 3 of hers! We have used car sales all times we have sold as well - but gumtree has always been where the buyers have been from! 🤗", "lizaj71": "Sorry but my last car i had for over 18 years and this current one nearly 4 years and I’m as attached as the old one soooooo sorry I’m no help 😔🤷‍♀️ oohhhh and LOVE your outfit too 🥰", "assillejade": "Why do you NEED to update your car?", "discopantsandhaircuts": "Sold mine of gumtree too. The dealer where i bought my new car, wouldnt take it as a trade in. It didn't take long to sell"}