{"casmana": "Thanks for this, look forward to more reviews @curvysam you are such a cool chick!", "anothernursesbeautyblog_": "❤️❤️", "marymsmith85": "❤️❤️", "rose_n_kids": "My 3 year old just said \"why she have ham on her face?\" 🤣🤣🤣", "b3cccsta": "The charcoal foaming ones from Kmart, are very entertaining my sisters and I kill ourselves with giggles when we do them 😘", "kirsty_zak": "Geeps you are STUNNING! @curvysam! Loved this! #curlyhairgirlsrepresent 💕", "bubblzmac": "🤣🤣🤣", "krisyeo": "Love this", "mstyleandco": "Cool vid! Fun💫 These masks can be a little trial and error I find? Im about to try a hydrating disposable mask from @neutrogena see how it goes $6 💕", "lovestylecoau": "How would you rate these?", "dawgsrsupercute.com.au": "👶", "angie_dp83": "👍🏻", "lizphoto": "Super cute! 💕🙌🏼✨", "_julia.ka.todor.sb_": "OMG I LOVE YOUR ACCOUNT", "curvysam": "@lovingelliesbelly you so need to get one of the @vs_sassoon hot roll brushes. It’s legit all I have used for 5 years.", "kirstymay06": "💕", "beckjmccabe": "Love this idea!! I’m gonna play next Monday. #CS_MaskMonday 😉", "yamuramachi": "Loved this video!!", "kellihennessey": "Bloody love this 😍😍🔥🔥💋💋", "pastrybypatersons": "♥️ Never really done masks maybe I should start!", "theswiseone": "Love this! I need that hair styler ASAP", "you.plus.me.makes.3": "I just watched this & my 4.5 year old little girl said \"oh she looks pretty!\" 😍", "lizaj71": "You make masking (covers it all lol 😂) cute and funny and inspiring too because now I'm reminded I should do this when I return home from my medical appointments in canberra and break time with friends 😁😍", "joril_92": "My skin is dry so I use jojoba oil and Sukin face moisturiser, they're amazing. My hair is also dry and I learnt quickly that most products out there make your hair feel soft but do nothing for the actual issue you want to address so I lived for eleven hair leave in or rinse out treatments. I just bought a leave in from Nak in their aromas range and it's been quite nice so far and smells amazing.", "palmers_aus": "Such gorgeous skin and hair! Xx", "suppressant1": "We're did you get your electric hair brush ❤", "a_phillips_89": "Is the before hair pre or post keratin treatment? I can’t decide if I want one!", "busty_diaries": "💗", "vs_sassoon": "Gorgeous! Hair looks amazing ❤️ so glad your loving our Hot Air Styler @curvysam", "inburstsofcolour": "Ooo yes! I need some masks that I can do with a neck brace! This one looks doable! 🙌💕 P.s. love this idea 😘", "architecturewithtelle": "😍", "thesimpleglamazon": "Haha...the nose!"}