{"nature.thrillseeker7": "Here is a review I wrote of your awful book:  I’m not a fan of this book at all. Her dating tips are not applicable for the average single woman who has confidence and self-respect. Plus, it’s hard to take her dating advice seriously, because she alternated between being in an open relationship and friends with benefits with a guy. She constantly says in her book about how it’s hard dating seriously these days, because it’s rare to find someone who wants a committed relationship and that’s true. And she even claims that she understands the struggle for women who want commitment. Well it doesn’t seem like it, because she was in an open relationship and friends with benefits with a guy for YEARS. She didn’t even want a commitment with him!! She’s a hypocrite! How can she teach one thing, and do the exact opposite in her own life? @shanboody", "ohmamiiiixo": "Let’s Dance like this bae @landodinero_ 😭😍", "melrosehoneyofficial": "The fact that you guys played this song takes you to the Carter's level in here for it \"happy bday Lisa happy bday Lisa Lisa it's your bday\"\"🔥", "_ofthesaints_": "What a beautiful moment captured and captioned with such a reassuring message. 🤍", "sybellemusic": "🤍🤍", "sincerely.beautifull": "Yesssszzzzzz. Happy birthday 🎉", "simonespeed7": "happy belated birthday Shan !", "atticfl0wer": "Oh my gosh was your birthday April 2nd!? If it is mine is too@", "headlesskidd": "Happy Belated Birthday! 😊🎉", "carolsteinfeld": "I always thought you lived in Toronto, not L.A.", "edenmtf": "Wait we hs e the same birthday 🎉HAPPY BELATED 🎉🎉🎉", "sumtingbouttati": "I love this ❤️", "ronirenegade": "Happy b🎊🎊🎊🎊🎊🎊elated birthday🎈🎈🎈🎈🎉🎉", "devrivelazquez": "😍😍😍", "afrodelik": "u both are amazing!", "zachariah_shoots": "This is adorable! Happy belated bday Shannon!", "lyunea": "Beautiful", "nando_nkosi": "😩❤️", "drefromthebk": "Aww man. I felt that. 😢", "thelovelyyou": "Happy birthday 💕💕💕", "kaylove93.25": "Happy belated birthday love 🎉🍾🥂❤️", "mrkimsays": "❤️❤️❤️❤️", "thenomad333": "Happy Belated Birthday!", "kingjulienfu": "How do you help someone with struggle love. A love they keep going back to but it isn't good for them. Something they know in their heart as well?", "getoutthebox": "Happy birthday Shan 💕", "chasityscooper": "Happy birthday gorgeous!", "djspoonz": "Happy birthday Shannon 🙏🏾🙏🏾🙏🏾 biggest MJ fan I know !", "enkore_85": "Happy birthday @shanboody. This was a beautiful moment. You could tell at the end how the moment hit you. With everything being so uncertain, nothing else mattered but to be sharing it with the one you loved. May you enjoy your day today. Be blessed. P.S. that song from the Michael Jackson imposter episode I remember watching live on Fox lol.", "zoereypin": "Longing for hugs like that...😩", "rfiona3": "Dancing on a roof that is the life you two are the perfect pair you dance wonderfully together ❤️❤️", "heirglz.03": "Happy Birthday Shannon ❤️❤️🔥", "valdiviez": "✨💜 Happy Birthday bright beautiful soul", "that_dude_wh3at": "This is Love ✊🏾", "only_lisalee": "Love that song. Happy birthday", "highcalibre_13": "HAPPY BIRTHDAY!!❤️🎉🎉", "wattssensei": "Mi mudda birthday is April 2, and she Trini Indian. I’m dougla like you too. That is awesome sis!", "goldie_lockes": "This is my birthday song every year because my name is Lisa 😊 Happy New Year!", "jayniibravooo": "I was wondering where I knew that song from...😂💗💗 happy birthday beautiful😘", "quintab\nVerified": "Verified", "capetowncurly": "Ncaaaaw this is precious. Happy and blessed birthday to you Shan", "agardjeanann": "Belated Happy Birthday Shan.Be safe and have a great day.", "hazey_jaay": "Happy Birthday @shanboody we love you sis😍😍😍😍😍", "vishnu_chavan_official": "Free video call girl massages me fun👙👙👙👙", "being_rejoice_": "Happy Birthday Shannon ❤️", "thaigerbomb": "Happy birthday, queen! Seeing yalls love always put a big ass grin on my face", "___saucyk": "Happy Birthdayyy Beautiful 💛💛💛", "creativemakersguide": "Happy Birthday 💜👏🏾", "justinisaacs_hrh": "Happy birthday! You and @enjoyjaredbrady are my absolute favorites! Things are getting just as hectic in South Africa but I'm grateful to be alive and appreciate the time to calm TF down, find me again and get ready to grind once we are free again. Together we will overcome, millions have done it before. Always continue doing whatever makes your soul shine sthandwa 💕💕", "ninaclove": "😍😍😍happy birthday", "ariannaaasmith": "@jonnyt616", "jenuinelyjay": "Happy Birthday Shan! My husband had his birthday during the quarantine as well we drove up to Malibu and just made TikTok videos, drew in the sand, and headed home to bake a cake and have dinner. I’m glad you have Jared and you make the best life together. Beautiful 😍", "davsilv": "BE STILL MY HEART 💕❤️", "justdiarra": "Happy birthday! Wishing you all nothing but greatness. You are deserving of all the light and beauty this world has to offer. Blessings to you all❤️", "torianwilson": "Awww Happy belated birthday @shanboody 💖💖", "supernova1908": "Happy Birthday @shanboody !😀🎉🎊🎈🎉🎁🎀💞", "naimai_t": "Happy birthday!! & Aw this song was on my first MP3 player!👏🏾", "syan.i": "Happy birthday! Were both April 2nd babies!", "laik_show": "Happy Birthday Shan!!! Y’all Are Such Cuties...Your Fave Looking Like That Hugg Was Life🙌🏽🤣", "ken.tm.will": "I am late and didn't mean to be 😭But happpppppy birthday darling! You is smart, you is kind, & you is STRONG. Much blessings for this new year. Easier said than done, but shake the funk away & keep on moving/dancing with hubby.", "ana1quiroz": "Beautiful HAPPY BIRTHDAY GIRL", "porshasmith_x": "Happy belated birthday 🎈", "insiderdating": "HBD🙏🏾", "desievans1981": "So beautiful and loving ❤️❤️❤️🎉 happy birthday #", "slkissy": "Just when I thought you couldn’t get any cooler, here you are dancing to one of my fav (and apparently banned?) Simpson’s episodes!!! You two are too sweet, hope you had a wonderful birthday ❤️", "jaynasoul": "Happy birthday beauty ! My inspiration for so many things 💕 I love your love !", "demboyzx3": "HBD🎉", "ttackuller": "Happy birthday!!❤️", "thefemininecollective_": "Happy birthday queen!!!", "warhol.or.brain": "Coming from a 23 year old who watched simpsons religiously", "msmayaleigh": "I loved this episode!! Happy birthday Shan, and thank you for the inspiration to enjoy my birthday on Sunday to the best of my ability 😍", "thetracymoore\nVerified": "Verified", "jjfreshy": "I’m late!!!! I’m late!!!! For a very important date.....(please sing) it’s your birthday....go Shan....it’s your birthday....go Shan!!!! Happy birthday Hey Hey Hey Happy birthday 🎁🎂🎈 Xoxo JJ", "remiharveydotcom": "Beautiful! ❤️🎉👏✨", "njvirgo71": "6'!😂😂😂", "genieeeeeeeeeeee": "Girl I FELT that hug. Def have been there. And I peeped that you are a true MJ fan cause you stay having his rare songs on lock!!! 🙌🏽", "majesticrossi": "Happy Birthday 🎂🎊🎉!", "lovely_msbunch": "Happy Birthday beautiful ❤️❤️❤️", "rockwellknuckles": "This is amazing. Happy birthday.", "salssssaaaa": "Happy birthday ! ❤️🎉 love you and know we can all get through this", "yonilovee": "Happy Birthday Shan!! 💕💕", "peacelovecheeba": "Happy birthday QUEEN @shanboody 👸🏼 ! 😍😘🥳🙌🏻", "krs_tin": "Happy Birthday Shan! My birthday 3/24 also looked just like this including crying in my partner’s arms about bag of paydays (my favorite candy). I definitely connect to all the feelings in this post. I hope like mine your birthday was a beautiful mess 🤗🤗🎉🎉", "jaz_fairy_j": "Happy Sunlap return queen ❤️❤️🌸🌸🔥🔥", "preperly": "Happy Happy Birthday 🎉 💕", "tamcam_91": "Happy Birthday! Are we able to message you on whatsapp @shanboody ? Xx", "jennychain1983": "Happy birthday 🎂🎂", "butterflycurls": "Happy Birthday Beautiful!! Thanks for your transparency I think so many of us are experiencing the same but trying to be strong for those around us. It’s not easy but together we can!!!! 🙏🏽💜🎂🤗🎉🎁", "_journeywithsteph": "Awww Happy Birthday beauty !❤️", "zhayynaa": "❤️❤️❤️❤️❤️❤️", "dangertang": "You're incredibly talented, beautiful inside&out, and a great role model for women everywhere. Happy Birthday Sweetness 🎂🎉🎈", "derrexbrady": "We love you 🎂🎉💛✨", "danisassy7": "🎉🎉🎉🎉🎉🎉🎉", "iamsabrenarenee": "Happy Birthday beautiful! I felt that release when y’all embraced! We’re going to make it through. Better days are on the way. Praying you have/had an absolutely beautiful anniversary of your birth! ❤️", "angel_cabbie": "So so so sweet! Happy birthday @shanboody 🎈🥳❤️", "cyraknight": "Happy birthday 🧁😊", "jefferjim": "@bettyetrade This doesn't relate to this post but I've to share with you how I've been financially free with bitcoin investment, all you need to do is send a DM to the name above, she is a nice woman and she will teach you and put you through the process on how to start earning from the comfort of your home through bitcoin mining. Best investment ever", "kristi_jagger": "That’s beautiful in every way. My feeling is we all gave to give up some control to be able to feel good in this. As soon as that happens the sadness and depression go away. Happy Birthday to you! 💜💜", "dovekat": "It was so cute! I loved that song", "emsophi_": "I want a birthday like this ❤️", "tcholesworld": "Happy birthday Queen 💕❤️", "iam_hungryinheels": "This is so beautiful! Happy birthday @shanboody !", "cocoon_bloom": "Happy Birthday you beautiful soul ✨💕💕 I’m so lucky I get to see you participate in this world in this life time. Such an motivating teacher you are! You are such an inspiration to me and I’m sure for many others!", "thejasminebperspective": "HBD!", "socialimpactwithstephanie": "Your vulnerability is inspiring! I hope you continue to find ways to see the silver lining. Much love! 💖", "chaycinchange": "🖤🖤🖤🖤🖤🖤🎉🎉🎉🎉🎉🎉", "sugar356": "Hey, 🥳 Happy Birthday! 🎉🎈🎁🎂 🍷 thank you for sharing that, I have been feeling the same. Appreciate the reality and the positive Vibes.... enjoy your weekend beautiful!", "dianadrepper": "Happy birthdaaay!!! Make the best out of it - you deserve to treat yourself!", "olivia.bordley": "Happy birthday Shan!!!", "divaytalley": "❤️❤️❤️❤️❤️❤️❤️HAPPY BIRTHDAY SHAN! @shanboody", "trarondaa__": "HAPPY BIRTHDAY!!!!!!!!!", "dehattcia__": "Haaaapppyyy Birfdaaaay😍🎈", "xy.jack": "That face & embrace of “I’m so thankful for you” ... I FELT THAT 😢💓", "fashionatmstee": "So much beautiful energy in this video 🖤 You should definitely mark it as one of the best...Sending tons of Birthday Love 🎂🖤", "splesh__": "Happy birthday my guy @shanboody", "i.n.transit": "💜💜💜💜", "lboogie40": "Happy birthday! It's such a blessing to see a new day. 💛", "melissa_gsmn": "Happy belated birthday 😊thank you so much for your work 💕", "carlinereality": "Aaaawww", "madlymocha": "My daughters 16th birthday is on the 21st... she’s so sad that we’re still going to be quarantined. I have to figure out something fun to do for her.", "lil_missjstar": "Happpppppy Birthday to you!", "sammisoda": "The love you two have is so sweet and genuine. Happy Birthday Shan! I suggest playing some Brandy today", "rosellegrant": "Shanon has nice legs!", "ash.baca": "Birthday twins! Happy birthday, Queen!", "melissaeatsdonuts": "@shelbyl27 the birthday jam", "clarissajusdan": "Happy birthday beautiful lady. Blessings always. You are in our thoughts and prayers.", "official_selfloveclub": "Happy birthday ❤️🔥💪🏽", "jessingmeowt": "That song is one of the best things The Simpson's ever gave us. Happy birthday, girl.", "msginger2013": "Happy birthday beautiful. Today is my birthday ☺️", "pepperann78": "Happy Birthday 👸🏽. Your face at the end... I really felt that 😢. Yep we are all feeling it too. Focus on the good things and lean on your better half. Know that this too shall pass , we just gotta do our part and make smart decisions. Again Many Happy Birthday 🎁🎂 🎉 wishes sent your way. 🙋🏽‍♀️🥳", "blackkman._": "Happy Birthday. May God bless you with many more birthdays.", "_teuf": "Happy birthday beautiful ✨✨✨", "kayyyciaaa": "Happy belated birthday !! This is such a sweet moment ❤️😊", "edwardistheman": "Your husband is a lucky man @shanboody", "rainbowbrit": "I love beautiful, sincere moments like this. You two are so wonderful for each other", "teamallme": "🔥🙌🔥😍 happy birthday shan, and I love the Simpson's birthday birthday song.", "ms_kinda_fly": "HBD!! 🎉🎊🎉🎂🎁 Your my bday twin 4/3 #TeamAries 🐏", "tiytiy92": "Happy belated birthday", "bleusclews": "Happy Birthday 🎉🎁🎂🎈 That song is everything! This was such a beautiful moment. Getting back to the basics and finding the beauty in simplicity is necessary. We are happy to have you with us another year! Cheers to many more", "sheilaf.nseca": "Happy birthday xo", "iamdesistukes": "Happy Birthday 💃🏽", "roksanadaw": "Happy birthday!!🎉 Wishing you more better days 💛", "kimberly.jonell": "Happy Birthday SisStar🌟", "officialnerddd": "Hope you had a great day❤️ happy birthday love", "antiterrorsecurity": "Happy Birthday Shan, 🌹🌹🌹❤️❤️❤️💎💎💎 🎂🎂🎂🎉🎉🎉 ... May God Bless you and your family forever and always...", "kindaliketivi": "Oh... happy birthday, love!👑🌻💛", "nise626": "Happy Birthday 🎂🎊", "freddie.sims0740": "Happy birthday !!👏👏❤️❤️", "fallonelaneauthor": "Beautiful 🔥 🔥Nothing like being with someone who loves you in such uncertain times. Happy Birthday 🎂", "lighterstateofmind": "Love you girl! I hope you had a incredible day and felt showered with love and appreciation. May this year be filled with adventure, growth, life experience and overwhelming love in your relationships woth others. Happy birthday Shan Boody", "thebestdamnnonsense": "Happy belated birthday! Sending love 💛💛💛", "teyolia": "Happiest birthday to you beautiful 🥺❤️", "worldofzach": "Happy Birthday love 🤎🤎💛", "kiearra.wavy": "♈️♈️♈️", "adaezeoguaka": "Happy birthday 🎂🎈", "ketsogirl": "Happy birthday✨🎊🎊🎊🎊 you will be seeing many more years to come. Stay blessed❤️", "nellavibes": "Happy Birthday Shan Boody! Keep shining, thanks for being a great inspiration. Sending you good vibes from France !💕🇫🇷", "__emineaslan_": "Happy birthday shan ❤️", "peejay_esthetics": "OMG I love this!", "mos_m.a.k.e.u.p": "Happy birthday Shan!!", "nabila_lungeni": "Happy birthday Shan 💗", "aln_lovejoy": "Happy birthday! ❤️", "crysta_cryss": "Love this so much. Thank you for sharing and HAPPY BIRTHDAY!!!🙏🏽❤️🎂", "maameks": "Happy Bday Shann!❤️🥳🥳!!", "instamarj": "This is so sweet hbd 💖", "theayeshajade": "happy birthday 💜", "powerofkay": "Love you Shan, happy birthday to one of the greatest of all time. Youre an inspiration", "amylouise94_": "Happy birthday Shan 💖", "vincentvianen": "Happy Birthday!🎉", "jasminetischler": "Happy Birthday ❤️", "iamblessedbrooks": "What a genuine moment.", "jamilamartinwingett": "💛🎂💛", "glusta_hemaca": "This made me smile, happy birthday", "nina.graciela": "Beautiful 😍 Happy birthday! 🎉", "beachgoddess": "✨Happy Birthday!!✨", "eauxchae": "Aries legend Happy Birthday 🙌", "glowingintuition": "Have a blessed birthday Shan x", "cgetsgains_personaltrainer": "Happy birthday Shan! How tall or.. short are you btw", "ansogo": "HBD QUEEN❤️", "hotgirlspaz": "Aries QUEEEN", "itslaurapaola": "You 2 😩😍", "dorcasanthonie": "Happy Birthday @shanboody wishing you all of God's best. 😍😍❤️", "mrcurrygoat": "Happy Earthstrong! Queen Shan! Bless up! 🙏🏾💫", "pepperedbarn": "Aww that sweet endearing hug🙈🙈🙈❤️❤️❤️", "salenasmarie": "It’s nice you have someone to hold like that", "jackieaina\nVerified": "Verified", "zahrabentham": "Love you Shan! Sending you love and hugs! Happy birthday beautiful ♥️ @shanboody", "shunique_35": "Aww💖 Happy Birthday @shanboody Blessings✨", "nessers_90xo": "Happy Birthday Shannon!!💜💜", "_nataliia_": "This love makes me so happy.❤️Happy Birthday & stay safe!", "realglamazontyomi": "Happy Birthday Shan ❤️❤️", "jordangolden": "@fattym", "kymmyizabeauty": "Happy Birthday Beautiful One!!! ❤️", "long_live_life": "Happy Birthday Shan 💕💕", "fe_monee": "I adore y’all ❤️ Happy Birthday girl! We love you! 🙏🏿❤️", "ciaomacarena": "I've felt the same way! We got this girl. Wishing you a happy birthday 🎂 💓", "jazmine_artistry712": "Happy Birthday @shanboody thank you for sharing yourself with us and all your knowledge. You’re such a beautiful person and so humble. Happy Birthday gorgeous, have a blessed night. ❤️", "estheticfetish": "Hope u had a great birthday!!!", "sehabe": "Happy birthday ❤️✨", "mariahpapayah": "Happy belated, birthday twin!💕", "mawilliams": "Happy Birthday Shan!! 🙌🏾🙌🏾", "headkydonthekorner": "Happy Earthstrong! May this revolve around the sun remind you of what is important, and worthy of a life worth living. Peace be with you 💛🥰 Praying for many more 💕", "evehrb": "❤️❤️❤️", "andythehurst": "Happy birthday rockstar!", "ladyraii35": "Too Cute", "epm_pixie": "Sweetest couple 💕❤️", "chocolako": "Happy Birthday Aries Sis 😍🤗", "valerieeirelaav": "❤️❤️❤️", "reddheartsfotos": "@acarolvaldez", "taenichol": "Happy Birthday Beautiful!! ❤️", "madisonhilburger": "Happy Birthday ❤️", "jjkanes": "@_jaimi_louise_ we better have a dance party in my apartment on my birthday if we are still quarantined", "klarry04": "I remember this song!!! Happy Birthday Shan!", "stephen_ph_": "Happy Birthday Shannon!!❤️❤️❤️ 🙏🏾🙏🏾🙏🏾", "puff_puff_pastries_407": "🤔We still texting you songs or nah?? 🤷🏾‍♂️", "karinaduh": "Happy Birthday QUEEN🔥🔥🔥", "ceci1302": "Happy Birthday!", "zatinag": "Happy Earthstrong!! 🙏🏽🙌🏽💪🏽 🎊🎉 @shanboody", "lilylyonmusic": "GOALLLLLS", "beingtassy": "Happy birthday 🥳", "vmjphotographyandmusic": "Happy bday❤️❤️", "jtbaby_101": "Fellow ARIES YESSSSSS ❤️❤️❤️❤️", "hernameisrocio": "Happy birthday my fellow Aries bae 💕; we're all in this together.", "iamkristinamira": "Happy birthday beautiful! May you always remember to dream big and surround yourself with the truest love 💖💖💖", "t._mc": "@shanboody HBD Boo😘 May it be blessed.", "sidneynicolerogers": "😭❤️😍", "itsnikeita": "💙💙 Happy Birthday Beautiful 💙💙", "gen.crtz": "Happy Birthday Shannon!!", "pammcakez": "Happy birthday ! 🎉🎉🎉", "reign_beux": "Happy Birthday beautiful.", "itsnadia.e": "Happy Birthday", "xteeennaaa": "The hug at the end got me 😭😭 Happy Birthday. Your guy’s love is beautiful", "kylaheliza": "ily", "ivycoco23": "Wow! This made cry! Happy birthday 💕", "tvibe": "You are so blessed. Happy birthday!", "charissemclennan": "Happy Birthday Shan, keep your head up, chin up - you inspire others, including myself on the daily. Thank you for being born ♥️🌹", "startasticly": "Happy birthday beautiful 💜", "yanerac": "Happy birthday 🥳🥰", "haillewalsh": "Happy birthday!", "empoweredbycathy": "Happy Birthday 💛", "julieeem__": "One of my favorite episodes ever! Happy birthday!🎈 ✨", "ahhamomma": "Happy birthday!!! May the beginning of a new chapter of your life start with excitement and positivity and flourish with passion and happiness!", "classic_leigh": "Happy Birthday!!", "bribricutie3": "Happy birthday Shan🥰💕", "bbygirlflo": "Happy birthday!!!", "itsjessiebt": "Happy birthday Shan 🥳", "miniquerice": "We are holding the fuck up!! 🙌🏽 Yaaaaas!! Happy birthday!! 🎊", "hippiemegs": "HAPPY BIRTHDAYYYY ❤️", "ekram_mn": "🎊🎉Happy birthday ❤️🎉🎊", "eleven_19": "This is so beautiful! It seriously brought tears to my eyes! Happy Birthday!! 😍", "domina_franco": "Happy birthday and thank you for all you do ❤️", "fabulouspatty": "Happy birthday to one of realest! YOU, Beautiful lady that has a gift that’s all true to your own!!! God bless Shany @shanboody 💋❤️🙏🏽🎂", "asherah.faith": "Happy birthday, Shan!! ❤️❤️❤️", "just.nana_": "Happy birthday. Are you an MJ fan?", "basimental_art": "This song is from Fresh Prince of BelAir!!! Lol l now that is a cute way to make a birthday!", "midnightwuu": "Happy birthday Shan! 💜 love you so much! You inspire me everyday! Sending you love today ✨", "wynreeves": "Happy birthday beautiful ♥️", "cocktaleswithla": "😍", "mecca.j._2323": "Happy birthday shan,❤️❤️", "banvoa": "hbd, bby! 💕💕💕", "honeyue": "happy birthday shannnn ❤️❤️ i’m glad you had a great birthday", "claudiegodbody07": "That’s love I felt that. It’s great to have a partner and friend. ❤️", "chivonjohn": "Happy Birthday Shannon 💜", "wander.woman_": "This is so beautiful! Happy birthday!", "geniusofinsanity": "Happy Solar Return", "guahaity": "Happy bday!!!", "redheadtokyo": "Happy birthday 🎉🎈🎂🎊🎁", "ashleysmith.tv": "Happy Birthday Shannon!! 🎉", "mizzscott2306": "Happy birthday", "jazzyj022": "Happy birthday Shannon 💛", "allilovezto": "I love this song too!", "bobbierileybeauty": "explains all the amazingness!!! Ur an Aries too ❤️💕 Happy Birthday Shannon :)", "chelbay19": "Happy birthday lovely ❤️", "followthebuti": "Happy Birthday!!!! 💕💕💕💕", "empressgoddessking": "Happy birthday", "issaraeof_ny": "omg you are a fire sign!! Happy Solar Return!! i feel like your chart has a lot of earth in it tho!", "youbettaglowgirl": "Mad cute. Happy birthday ❤️", "shellypath": "Happy Birthday Shannon!! 😘", "madam_nnk": "Happy birthday hun ❤️", "christinachyvonne": "Happy Birthday ♈", "thegracielacey": "Happy birthday beautiful!! You are AWESOME ♥️ we will get through this. Take time to heal 💕💕", "lauren.denisee": "Happy Birthday! 💕", "christamic_": "Happy birthday Shan 🎈", "miniviaaa": "Happy birthday!!!!", "billinda_carmela": "Happy birthday❤️❤️❤️", "amourisssima": "I felt that hug", "_sade13": "❤️", "curvy427": "@shanboody happy birthday beautiful. Enjoy every moment of it. Remember the only thing constant in life is change! Embrace it. PS. Michael Jackson Simpsons episode best ever HANDS DOWN. Always cry when I watch it🤣🔥🤗😘❤️", "theterridiaries": "Happy Birthday ❤️❤️❤️", "teepurplebliss": "I love this, happy birthday, I wish you guys more birthdays like this❤️", "onnistmusic": "Aw you guys are sooo cute bless you", "tsmall4real": "🎂🎂🎂", "_aquilasouto": "Hello I never knew I could be Abe to earn up $18,000 with just $3k in a day , thank you @torayk.fxba who made it possible.#staysafe and #getpaid", "camb.s": "Happy birthday beautiful ✨", "jkatana": "Happy Birthday!♨️❤️♨️", "overdoseonit": "That hug made me cry!! 😭😭❤️", "sasha__alexia": "You are loved!! This will pass. Happy birthday! ❤️", "tisworthit92": "Happy Birthday Shan ❤️", "jayceegan": "Happy Birthday Queen! You deserve the world ❤️❤️❤️", "zoe_blevins": "As I fellow aries I feel your pain! I’m turning 21 Monday and it’s not how I pictured this birthday going but hey, there’s always next year for us to throw it back during our season ♈️♈️♈️", "hey_tesi": "Happy Birthday Queen ❤️", "llezeatz": "Awwwww!!!! Happy Birthday Queen!!!", "andretimoll": "hbd", "_buhleeshuhhh": "Happy Birthday!!!", "sweettiffrn": "Happy Birthday Shan Boody! You are an absolute treasure!🎉🎈", "d.e.z.a.b.a.e": "Happy birthday Shan!", "gabriellecorney": "🥂", "raychelamb": "Happy Birthday beautiful! 💕🎉", "heykd": "Happy Birthday Shan!!", "geekybeauty": "you guys 😍", "tanuka12": "Happy Birthday!", "xelixelmai": "Happy Birthday ♥️♥️♥️", "marty_mcfli": "Not Lisa it’s your birthday🔥🔥🔥 I love it", "wandaprince6781": "Happy Earthday💞🌟", "sozady": "This is the fucking realist moment have seen in a long time. I could literally feel you appreciating him.", "kandi4days315": "Happy birthday Shan thank you for being such an inspiration ❤️❤️❤️❤️", "riseoffaith": "Happy Birthday Shan!! Hope that it was the best of birthdays💕", "pigeon_pair_mummy": "Absolutely love the song choice! Birthday blessings for you from down under in mutual isolation 💜", "_mrsalicemazmania": "Win big on Forex trading,I made $10,500 out of $2,500 in 7days of trading with @torayk.fxba am still amazed sir give it a shot and thank me later 🙏👏 #staysafe and #makemoneyfromhome", "ysloza": "Love you Shan!!!! 😘😘😘😘", "thebritd": "The sweetest thing I’ve seen all day. Happy birthday ❤️", "callmeshakag": "Happy Birthday 🍾🎈", "officialrob_roberson": "That face changed in that hug and I know you FELT that!!! Push through! Better days ahead", "jenalbell": "Happy birthday!", "topaz_brady": "Happy Birthday 🎉🎉🎉", "ellemazing": "Beautiful post. Happy, Healthy Bday!!", "sensualxerces": "Happy birthday love!", "jajasbakes": "This is just so sweet , i was singing the song, one if my fave episodes! Happy Birthday my IG cousin in my head 💞💞", "rah.klim": "Happy birthday Aries sistaaa❣️❣️", "tmlindo": "Fave birthday song 🥰🥰🥰", "vickikrush": "Happy Birthday‼️", "workingqueens": "Happy birthday!!!", "therealocee": "Birthday blessing to one of my favorite humans!! You are my idol 🤗", "taciturnly_tynisha": "Beautiful. Total flashback with the song! Happy birthday 🎉", "chelseyschwan": "You inspire me every day 💖 Happy birthday you beautiful soul!!", "sheholdslight": "Happy Birthday!", "dwightclarkart": "GOALS🎁", "dani_cngr": "Happy birthday! 💙", "indigo_vibe_": "Happy Bday Lovely💕 #ariesseason♈️", "keisharo76": "Happy Birthday 🎊", "nikiiwatson": "Happy Birthday!!", "_heyyylauren_": "That hug at the end....is there anything more important than that? ❤️❤️❤️ Happy birthday, Shannon! May you be blessed with many more!", "sachisaurus": "Happy birthday!!’ 🎂🎂🎂", "edelduokiboro": "Happy birthday beautiful!!!", "fromliztoyou": "💜💜 Happy birthday!! 🥳🎂", "libbymarquee": "Happy Birthday you beautiful soul. You inspiring human being. Thank you for being you so people like me can be confident in being ourselves ♥️ you matter ♥️", "chenoia": "HAPPY BIRTHDAY, beautiful!", "4allcurlkind": "Happy birthday!!!", "karinna.paris": "Happy birthday! Texted you a song 💖🥰 hope you love", "amikkamara": "I can feel the love 💗 from this video", "naomiek.m": "happy bday queen💗", "eliybell": "That was the best hug I’ve witnessed in a long time. REAL LOVE. The action and scene of LOVE. The best video I’ve seen in a long time on IG. 💜 @shanboody thank you for sharing.", "krystalcaliyah": "🥺 happy birthday beautiful!💕", "raregemiyanna": "happy earthday queen!!", "littycakesbakes": "@shanboody we need to send you a Birthday Box!!! 😘😘😘", "trey5fanpage": "Happy birthday ❤️🙏🏽 you got this", "bthny.smth": "I love y’all. Happy Birthday Shannon 💞", "curlychristabel": "Omg I just cried at this video alone it’s such a precious moment thank you for sharing it", "itsjaybabes": "My fucking parents this is BEAUTIFUL. We love you Shan.❤️", "fu_ran_ka": "Awwww😍", "evierobbie": "Of course you are a fellow Aries!!! Happy birthday", "ohmy_its_": "This is gorgeous", "xoxo22cc": "Happppy birthday beauty 😘😘♥️♥️", "taviagarland06": "HAPPY BIRTHDAY LOVE!!! YOU ARE BLESSED AND HIGHLY FAVORED!!!! 👑👑👑💚💚💚💚", "jazelleinez": "Happy birthday Shannon! ✨🎈", "kbrowniie": "So adorable ☺️ happiest of birthdays to you ❤️", "munday999": "❤️", "ashleynycole_xo": "Happy Birthday!", "_ithinkitsbecky": "Happy birthday 🎉", "thebabybuddah": "😩♥️♥️♥️", "1dawoman": "Making me cry😭", "lady_bambi_eyes": "❤️❤️", "da_funny_kid_": "The second she put her head on him you could tell that she is soooo happy with him", "clara_lynn4": "❤️❤️", "dominguezcyn": "Happy birthday!!!! Today is mine and I just did a video chat with all of my favorite peeps🍾🍾", "reynapananoir": "@shanboody Happy birthday!! 💕🎂🎁", "badgirlmimi93": "I could feel that hug from here! Happy birthday 🖤", "jill.s__": "Happy birthday Shan! 🥳💕🤍 @shanboody", "kenyaste": "You are extremely loved, Shan! HAPPY HAPPY HAPPY BIRTHDAY, GIRLFRIEND!!! 😘🎊🎂🎈🎉", "sophiawishes": "I could feel the weight of that hug through the phone 😢❤️... Happy Birthday Shan! I know it’s not the perfect birthday but this feeling will pass. I’m happy you and Jared have each other during this time & I’m thankful you were born. 🤗🙌🏾👏🏾🎂", "saraojut": "Happy Birthday girly✨", "amjedosman": "Happy birthday!", "shiqlife": "HAPPY BIRTHDAY!! I know how you feel. It’s my birthday too and I live in a different country than my mom( who was gonna visit before all fo this) but we are alive and well thank God..thugging it out ❤️❤️", "cdronebarger": "Knew you were a ♈️ !!!", "stephanaaaa": "Omg yess!!! Love that episode too!!", "karinphoenixwho": "I knew that song sounded familiar!!!!! Happy Earthstrong Shannon the Great!!!! Been following you since Those Girls Are Wild and I am so extremely proud of you and your success and love in business. Fa real fa real inspiration. I wanna like you in the sexology streets on day! Shine brightly sis!!! Thanking Jah for your gift of Jared. Peace.", "fly_rarity": "This is so beautiful", "jaywhittbeats": "Happy Birthday Family ❤️", "karlynpercil": "Happy Birthday Beautiful 🎂🎉🎉🎂 Enjoy your special day!!!", "eleanoftroy": "You hug him like he’s your home♥️ Chin up Shan, I hope you feel incredibly blessed today.", "manalaitt": "Omg this is more than goals 😭😭😭😭❤️❤️❤️❤️❤️❤️❤️", "fitmommynkp": "Happy birthday beautiful!!! ❤️", "samanthagabriellex": "Happy birthday!", "britchung": "Happy birthday", "sunnymegatron": "Happy birthday! ❤️💕😘", "so_fun_kay": "Happy birthday 🎊🎈", "lorrainedanielle6": "Happy Birthday Beautiful✨🖤", "astoldbydaria": "Happy Birthday 🎊🎉", "sjc4l": "Happy MF Birthday 🗣❤️", "goodnews_20": "My experience with MR. Eduart Hannes is a testimony, if you want to invest in binary options/forex trade Dm him for your investment. @eduart_fxtrade_expert", "oldenhue": "Happy bday !!!!👑👑♥️♥️", "donderzak": "Chuuune!", "carolynminx": "Happy birthday QUEEN🙌🏽🔥😘💓", "basicallybee": "🖤", "__honey.yc": "Happy birthday beautiful", "davidastyles": "@shanboody wishing you a beautiful year ahead and all the 💕you deserve it!", "nique_chanee": "That's my favorite birthday song! Happy birthday!!!", "heavenarcade": "✨💚💚💚💚", "thequirkyjournalist": "Happy Birthday 🎉🎂", "doudoulove56": "What are those on his feet lmao", "keisha_mp1992": "Happy Birthday 🎉🥳", "kleidendrew": "Happy birthday!!", "jabari\nVerified": "Verified", "ven_j_": "Happy birthday to the most beautiful soul I ever had the pleasure of connecting with through YouTube, ig and your book 💛 honestly an inspiration and comfort in my lowest of times and I love that you are an Aries, just like me ☺️🙌🏽", "liesl_michelle": "Happy Birthday!!!!", "glasseskeysphone": "Happy birthday ❤️", "amusing_millennial": "Awwww happy birthday beautiful", "becauseimelise": "😭😭😭 That’s so sweet! HBD!", "kyreeskreations": "Happy birthday Shan! 💕💕", "wenzdaithegoat": "❤️❤️", "playboy\nVerified": "Verified", "dlcamarena": "♥️♥️♥️", "blahtoyourface": "Happy birthday, fellow April baby! ✨🎊", "mizz_v357": "Happy Birthday gorgeous many blessings to u today and always 🎉🎂", "onesharpemomma": "Happy Birthday Shan!!!", "micro_me": "Happy Birthday!!!", "davey__03": "Did my guy steal your slippers", "compassionx_": "❤️❤️❤️❤️", "deblue13": "Happy Birthday! Enjoy every moment! 🎂", "morgan_divine_": "Happy birthday beautiful fellow Aries ✨", "ronxj": "But this all that matters 💙❤️", "mesydnee": "Happy birthday ✨✨✨✨🎈", "nu133": "Happy Birthday. Thank you for creating a space for conversation with your profile. I learn so much. 🙌🏿♥️", "thekarl.co": "Happy birthday!! 💕", "brvmgl": "😩😩😩", "limayri_d": "Happy birthday @shanboody !! ❤️ Hope you have an amazing rest of the year. Even through the madness!!", "bnezbee": "Happy birthday! I love this ode to the simpsons! Too cute! Def took me back! 😍", "trinitystarlight": "👏🏾👏🏾👏🏾👏🏾👏🏾🎉🎉🎉🎉🎉🎉😭😭😭💕💕💕💕💕", "stacykingmassiah": "Happy birthday many blessings keep always being the true you", "ashleycambie": "😍😍😍 Happy birthday boo", "jazzy_jazzzzzz": "Man I know those hugs all to well. The kind that will bring you to your knees and bring you to tears. My hubby does this to me often.", "iamroolis": "Happy birthday. I love the mix of emotions here. So relatable. Thank you for being you. ❤️", "anthoniquetamara": "Happiest birthday", "sincerelyshonda": "Happy Birthday!!", "celested.bonds": "Happy birthday love! To another year of living and growth.", "xtinajlife": "Happy BIRTHDAY!", "mermaidclari": "Happy birthday beautiful 💙💙💙💙💙💙 Remain safe, happy & balanced.🌐🌊🌱", "ms_leahr": "Happy birthday Shan 🎊🎊💕💕🤗🤗", "arianastowe": "Happy birthday 😍😘🎂", "christinablacken": "The beauty of love is being fully seen in our darkest times and in our happier moments. Thank you for sharing a bit of yalls love with us it’s so needed at this time that as long as we genuinely love one another we’ll get through this.", "comedianrong": "Happy bday buddy!", "unearthedamber": "Happy birthday babygirl! ❤️", "brittanygricee": "Happy birthday boody queen💕💕 stay up", "annalysemonet": "aww 💕", "livingfearless_mae": "Happy birthday 🎉", "lisaaa_may": "I hear that song every year! Haha my birthday is in 16 days and it just felt like an early birthday celebration😂😂", "mreastman2u": "Happy Birthday Shannon 🎂🎈🎁🎉🙏🏾❤", "brooklyndj9906": "awh 💖this was from episode where the character thought he was Michael Jackson. Happy Birthday ♥️", "carissastephens": "Happy birthday baby 🥳🎂🎉💕", "sterlingvictorian": "I love this love!!!! 💜💜💜", "yooitsmedavid": "This toooooo cuuuuuuuute 🥰 .... Happy Birthday 🙌🏽!!!!", "iamkenyam_": "Awwww 😍 Happy Birthday Shan, we love you.", "philippabm": "Happy Birthday!!", "pixiedustolita": "Happy Birthday 🥳", "crystalreize": "Happy birthday beautiful ❤️", "sweetshy_ross": "Happy Birthday!!!", "reeree333": "Happy birthday love! 💖", "lydz_art": "I love this so much! Happy birthday love ❤️❤️❤️❤️❤️❤️", "natasha_simgr": "Happy Birthday🤗", "miuhaiti\nVerified": "Verified", "mcfarlandlatavia": "Happy birthday💜💜💜💜💖💖", "thevaldezlife": "I always think of this song around bdays and I am glad you all played it. I am glad to know i am not the only one. You both are beautiful and so special and i just want to say hpy bday and thank you for sharing both of your lives.", "celestialanne": "Happiest of birthdays, love! Enjoy your day to the fullest. You are blessed with another day, waking up next to the man who loves you unconditionally. You are healthy, you have family and friends who cherish you. These are just one of the many blessings. ♥️🎉🎈🎊🎀🎁", "sarahsidmohamed": "Happy birthday! I always get excited when I watch mean girls and see you size up lindsay Lohan🤣🤣 !!", "erockfor": "Happy birthday!", "hellosynthia": "Omgoodness, happy birthday love ♥️", "lakagary": "Are you tired of working for someone? Are you tired living off paychecks? The opportunity is now start investing in bitcoin mining forex trading, binary options investment today and be a boss if your own. @eduart_fxtrade_expert", "reneesamara": "Happy Birthday Shan! All the best and wishing you another amazing year ahead 😘 🎂", "mynameishisani": "Happy Birthday Queen 👑👑👑", "adeolaadunni": "Happy birthday Shan.....wishing you so many more!!!!❤️❤️❤️", "stephanieohg": "Happy birthday!!", "low_impactlife": "Happy Happy Birthday Goddess", "keishaannram": "Swwwwwwweeeeeet 🥺🥺♥️♥️♥️🤗🤗🤗", "novarose_xo": "Happy birthday!😘😘 @shanboody", "blackyogini": "Happy Birthday!✨❤️", "kzulyfl": "💖", "keylimex3": "Happy Birthday lovely 💓", "breannajane239": "Suit and slippers is a VIBE", "moonequalist1": "❤️❤️❤️❤️❤️❤️", "ladiebug09": "This is so cute!", "shasha_maz": "Happy 35th Birthday @shanboody", "queenv2014": "💓", "o0infinitegalaxy0o": "Happy birthday!! 🎉🎈🎊 ♥️", "mdaniford": "Happy Birthday 😊🥳", "nita_mandy": "Happy Birthday!", "nicki_mvrie": "Love it!!!!!!!!", "_claudiahamilton_": "Happy birthday <3", "kay__ray\nVerified": "Verified", "rebekahaladdin": "❤️❤️❤️❤️❤️❤️❤️", "ad_pyt": "Happy birthday!❤️", "thejillking": "Happy birthday! I also celebrated in Isolation lol", "tata__2013": "Happy birthday 🎉🎊🎊", "lindor_xo": "Happy Birthday 🎂 (from the T Dot). The amount of emotions & love in this video is breathtaking. ♥️", "pauleannareid": "🙌🏾 The cutest", "andrea.choice": "Happy birthday. I am glad your day was special.", "kauidias": "Happy Birthday!!!🎉🎂🎊🎁😘", "iamvonnna": "Happy birthday girl. Love you and your book.", "addigoyette": "I see the love 🥺❤️😍", "libbymonroe": "Beautiful! Happy Birthday Shan!", "alohamaliyah": "😭💛💛", "cozygirlpdx": "Happy birthday to a real one ❤️", "afrolatina2.0": "Happy birthday beautiful ❤️❤️❤️", "modo126": "Hang in there Shan. We all struggling. Know you are not alone", "christen_alyssa": "Happy Birthday to my mentor in my head!! ♈️❤️", "_missverde": "Happy birthday gorgeous 💕", "shaeboogie96": "Happy b-day!!! 💕", "sarah_iloveto": "Happy birthday to one of my biggest inspirations out there!! You are fabulous you are a gem of a human and thank you for being you !! The world is a better place with you in it💕", "gracejonesfierce": "Yall so cuteeee", "naked_kisses": "💕💕💕💕💕", "mustb_kish": "❤️❤️", "gabrielamanceraleon": "Happy birthday beautiful 😘", "joyana.alexis": "Happy Birthday Shaaaannnn! 🎉❤️✨", "nickyysongz__": "Happy birthday sunshine ♥️😍🎉", "jadecaver": "happy birthday! 😎🎉", "_aaaclass": "If this ain't the Kinda love I'm receiving I dont want it. Love & light mama 💕", "ayeshapi\nVerified": "Verified", "mzlari504": "Happy birthday beautiful", "jen_martin27": "Goals 😍😍 Happy Birthday! 🎉", "fanboy_trav": "I haven’t heard this song in FOREVER.", "instalessche": "😍💕", "justcallme.drdee": "I love y'all relationship bc it's so genuine and honest! Happy birthday 🧡 all the March and April babies feel the same way. But we can always make the best of every situation so long as we are alive🧡", "only__1__g": "🥳🍻🍻🍻", "blu_steel_357": "Happy birthday!🎂🥳", "heymony25": "Classic #Simpsons and #MJ! 😉👍. Happy Birthday, Shannon!! 🎉🎈", "therealmrstijani": "Happy Birthday Gorgeous !", "purpngold305": "Happy bday 🔥🔥🔥💪", "chauntrellclay": "❤️❤️❤️", "jessmoroz": "#meee toooo #aries bday vibes during quarantine  Happy bday, sending love❤️", "therachlindsay\nVerified": "Verified", "raesoular": "Happy birthday Shan!!!💖💖💖", "nunzi_dooz_cakes": "❤️❤️❤️❤️❤️this is so beautiful, heart warming and truley guienuine. Happiest of birthdays to you! You guys are a beautiful couple i can feel the love", "ariellesilvanyc": "Happy Happy birthday lovey! ❤️❤️", "elegant_destiny": "Happy Birthday Shan!!!", "nickolette_reid": "Happy Birthday 🎉🎉🎉", "tazzyspazzzy": "Happy birthday!!!! You are incredible!! 💕", "natestar_": "Happy Birthday love @shanboody ! All the best this year. keep yah head up🙏🏾", "muahx0x0": "✨✨✨❤️", "black.silk.gkeume": "💯💯💯💜💜💜🌹", "i_am_me_down_by_the_sea": "Today is my Daughter’s birthday too. It’s a big one from child to teen, 13. Without a party or friends and a world where even adults are scared. It’s been a difficult one. Buy today we cope & celebrate by eating her favourites extra cheesy homemade baked Mac and cheese & a triple chocolate cake. Happy Birthday Shan, I hope you found your slice of cake to celebrate too. 💕", "xodose": "Happy birthday 💖", "soulcial_healing": "Happy Birthday 💕", "tauries0420": "Happy birthday", "looneytune___": "I love that song! It’s so nostalgic 😩😍 HAPPY BIRTHDAY MS SHANNON! 🥰🙌🏾🎁🎈🎉", "__mayra_j": "lmao @ the honk at the end. happy birthday shan❤️❤️", "daisydukes987": "Happy birthday Shan! Yes you are alive girl you are blessed! 🙏🏽", "val_bk_": "Happy birthday gorgeous. Many blessings to you.", "_ally100": "When you love someone so much that just a hug can bring you to tears but they love and support you soo much .... I can’t wait", "kickinitwitkc": "Awwww Happy Birthday Shan😊😘🎉", "vivandra5": "Happy birthday gorgeous. After every storm comes the sunrise.big love❤️", "jadenovah\nVerified": "Verified", "kittym0ld": "Happy birthday 💕", "sodasmallz": "Aww Happy Birthday beautiful! I hope it was as incredible as it could be xo🎉😘💕", "shahnyk7": "Happy birthday & God bless", "nikkinetteanna": "Happy Birthday!!!!💕", "wzrdnatalia": "Happy birthday 💗💗💗", "imcharmed4evr": "- Awe, Happy Birthday! 🎉🎈🎂🎁", "snobtsula": "A", "followthatgirlwiththecurls": "HAPPY BIRTHDAY!!!!", "munah_0818": "Happy Birthday beautiful 😍😍you're amazing on so many level😘😘", "onyx_ocean": "Awww Happy Birthday.", "___yea_her": "Happy birthday hun ❤️❤️❤️", "victoriamendez__": "💜💜💜", "mimeki": "Why was this song playing in my head all day today! Lol. Wow. Happy Birthday Shan!!!", "jacqueartistry": "Happy birthday Shan!! Wishing you all the best. I hope your day was sweet and joyful. You are truly a gem in my eyes. I have learnt so much from you and I’m constantly wow’d by your grace, intelligence and honesty. You are amazing 💞😩✨", "kjoberk": "I love this song so much 😍 one of my favorite episodes 💕 happy birthday through this fucked up shit 🙏", "qmrchld": "😍❤️❤️❤️ happy bornday Shannon, you deserve so much good, love and peace your way. wishing you a happy day and a safe day! ❤️❤️", "lblanc_9": "Happy Birthday Shan♥️♥️♥️", "shena_g": "Happy birthday 🎈🎊", "shesolovelee": "This is my aunt’s birthday song cause her name is Lisa 😂 Happy Birthday✨", "deborah_amanda": "You chose right in each other 💖", "alknfashion": "Happy birthday!!!", "curlmyfries": "HAPPY BIRTHDAY I LOVE YOU 💖💖", "chia_habte": "Awww happy bday ma!!! ❤️❤️", "brirollin\nVerified": "Verified", "_xoriana_": "I love this 💕👑", "priscillaxo1": "Happy birthday!! 🎈 ♈️ 🔥", "ilovesummer_xo": "This is the cutest 😍💜", "nataliemegandsouza": "Too unbelievably sweet for words, you lovebirds! Happy birthday to you! ⭐️🎂❤️❤️", "alotta.lara": "I love this song😭😭😭", "mmmbree": "This is what bliss looks like. I know you’re having a very happy birthday. Enjoy💕", "elisekayzee": "I always like good hugs like this that end with that little “you’re fine I love you now get goin’” butt pat", "quickieswithmickie": "we love you! and we appreciate you today and everyday🌹", "_missunderwood": "Happiest of birthdays to youuu😊❤️ have a great one cheers!", "kumoyovibe": "Happy Birthday Shan!!", "findyourstory": "Happy birthday!! ❤️", "producergirl4": "Happy Birthday my love 😍", "gibbonshorton": "Bonne Fête!", "missmeb0205": "Happy Birthday lady! Every birthday is glamorous when you are with the one you love. Love this video🤗", "nesserz85": "QUEEN!🍰🎉😘", "pree_preee": "Chunnnnnne!! Happy birthday mama!", "destynelan": "I wanna be held like this 🥺 that hug just seems comforting af.", "thelotusroot": "Happy birthday!! 🎉🎁🎂🎈🎊", "hilliarybarbour": "Happy birthday!🎉🎂🎈💕🤗🎊", "parisiana": "this is magic✨", "rocfit_11": "Amazing! Happy Birthday/New Year to you!", "unaversal_unacorn": "This is so sweet. 💕", "milla.val": "I think it was the most glamorous. 💕", "meilingyu": "happy, happy solar return! ☀️ thank you for sharing! love ya'll love, fills my heart with so much warmth - feeling held as ya'll hold each other! 💞", "ndvidyuall": "@the_indigenous_hippie I wish I knew this song existed yesterday", "berrynthings": "Man, even I felt that hug😭✨ Happy Birthday April bb’s I hope everyone finds strength and hope during these trying times💕", "shannonchenee": "Goals", "janine9492": "Happy Birthday 🥳", "cindy_bunn": "Happy Birthday beautiful!", "withlovely": "Happy Birthday 🎉🎉", "nailahayo": "Happy birthday!", "heygorgjess": "Sweet ❤️", "davidjones9623": "I have no doubt that bitcoin mining is one of the most successful platform I've had good experience with, it so exciting how the possibilities come through getting an average of $5500 weekly.all thanks to @trade_with_cheryl_murray ,she made it all happened.", "_alleyboo": "Happy Birthday🎉", "sara.naomii": "Happy birthday love 💗", "adrieblueberry": "I love you guys so much!!!!! 😍😍😍❤️❤️❤️❤️", "caripoppins": "My sister plays this song for me every birthday and changes Lisa to my name. Lol Happy Birthday Shan!!!! ❤️❤️❤️", "jenellrenee.sacredwings": "Happy birthday! Mine is tomorrow ❤️", "_blazefiree": "Happpy birthday ♥️🥳", "ugottahave___whit": "Happy Birthday Shan!!!! Glad to have met u during this trip around the Sun for u!", "jennyquantum": "My favorite episode as a child! Happy Birthday Shan!!", "sdotgillon": "Love this msg. WE ARE ALIVE 💫💫 Happy Birthday 👑 🎂✨🌟🎉", "_itsniques": "Happy Birthday ❤️🎉", "itsheymorgan": "❤️❤️❤️❤️", "dontuwish__": "Happy birthday!!!! I love how real you are ❤️ stay strong 💪🏽", "timchantarangsu\nVerified": "Verified", "memycurlsni": "Happy birthday!!!💖", "talya.macedo": "🌹🌹 Love you both 💙💙", "sensitiveoldsoul": "Happy Birthday gorgeous!!! 🎂🎁🎉❤️🎶🙏🏼", "vee_block": "I just sat here like wait did she really post the Simpsons bday song 😂😂😂😂😂😂😍😍😍😍", "thetrapwitch": "Love you Shan! Happy birthday to you ❤️", "mzdevine1": "Awww 💜💜", "shellena": "Happy Bday @shanboody !!!! 🎉🎉🎉🎉♥️♥️♥️♥️♥️", "rosemusicinc": "Happy Birthday beautiful! Thank you for sharing your words, and this beautiful moment. 💫💫❤️", "kashaylamusic": "Happy Birthday @shanboody", "miss_mikky": "Happy Birthday!! 🎉🎂 I thought I was the only one who remembers that song!!!", "enjoyjaredbrady": "I love you !!!!!!!❤️", "franklinmonroe1958": "Wow I'm speechless for the moment don't really know what to say but i really appreciate Mrs Hither for her goodwill over me, I'm currently earning $8500 weekly and working from home, for every beginner and Aspiring investors i highly recommend her @hither_schumer", "raf12carr": "goals af🔥🤘🏼 HBD MAAM 🙌🏼🎉", "vals63": "Happy birthday beautiful 🥳💕", "al.komara": "Happy birthday!!!", "nishrod": "Happy birthday 🎁 love 💗", "belitwilson": "Happy Birthday @shanboody you are showing the light that you are and it’s always going to be time when this over to really get a celebration you deserve!!!", "sumraeofsun": "💚", "reign_check": "Happy Birthday Shannon!! Strength in struggle always 😘", "simonenopumba": "That hug 😭🥰 I love a good, loving hug", "millyjazz": "Happy birthday love...this is beautiful💕", "milicadorovic": "Happy birthday beautiful ❤️", "patrick_otoole": "😌 Happy birthday!", "armasandroses_": "🤍🤍🤍", "alysssa.chavez": "I love seeing this. Happy belated, queen 🧡", "kaylaagreaves\nVerified": "Verified", "jgoddessunlimited": "Happy bday", "natgins": "Happy birthday Aries queen! 💝", "jojosepulveda": "Love the song!! Happy birthday 💜💫💫💫", "marsha.jeune": "This is Beautiful💞", "imswasey": "Awwwww HAPPY BIRTHDAY BEAUTIFUL!!!!❤️❤️❤️", "mochodesigns": "It is your best birthday. No glitz or glamour. Just pure love.", "cynicalcystinuric": "Happy birthday!! 🎉", "_ijeoma": "This is super cute 😍", "adiosnigga": "We love you Shan! -Jessy.", "ashleeey_gee": "Awww adorable!! 😍😭 Happy happy birthday beautiful!! I’m so blessed to have met you and known you because you are such a radiant star! I’m so happy you have your love by your side through this time 💛 stay safe you two, and happiest of birthdays to you gorgeous!!! 💕", "devonayre.g": "I love you guys 😊", "a.laniece": "❤️❤️❤️", "ashley_alicia12": "thug it out Shan ❤", "rraveeerin": "So sweet 💗 bless you both", "kwenette": "Happy birthday Shan! Thank you for your light and your gift. Your book really helped me to get in touch with me for I went back out into the dating world. I appreciate you more than you know. Keep being you and thank you for showing up on this platform exactly as you are. 💕✨", "rosen_decluttercoach": "🎍", "shelloutheshell": "Happy Birthday 🎂🎊", "mar1am.ali": "Happy Birthday ❤", "krystal04clear": "Aw this made me tear up. You guys are beautiful 💖", "sinceresallyscout_grace": "Hey Shan, You are literally killing us with your gorgeousness! Let's collab! DM us @sinceresallyboutique ❤", "dejariley\nVerified": "Verified", "amberlewisphoto": "This is such pure love, happy birthday!", "_aisheteru": "Birthday wishes, love and positivity coming your way✨💕", "its.just.hope": "Happy Birthday 🎉🎊🎈", "sarahwangechii": "Goals af", "cantbetam_ed": "SOOO CUTE!", "browstresskrys": "So beautiful! 😩❤️", "3velina___": "Happy birthday goddess! Keep shining bright🌞", "bennettsbeeninit": "Ugh! Amazing. I can see and feel the energy and interconnection between you two! 💙❤️ I feel like now is the best time to have someone special by your side", "naomildunston": "❤️❤️❤️", "jazmin.faith": "Your love is so beautiful", "euella_isis": "Happy Birthday Shan!! 💞❤️", "kaylajairus": "Happy birthday beauty! Sending lots of love 💕", "nighlawn": "Awww 🥰😍", "theothercrystal": "Happy Birthday 💛💛", "prettyydreyah": "It’s MJ! 🙌🏽", "kriziacruz_": "Felt this deeply!! Happy birthday queen!! 💓💓💓💓", "dayaaa_xp": "@fer_ch5 for a min I thought this was you & your man!! 😮😅", "catrina_doyal": "Seriously watching you two dance together makes my heart smile. Such a beautiful love 😍 Happy Birthday 🎉", "bhumi_joshi95": "Aww Happy Birthday!!! Super cute!", "dswakhsr": "❤️", "anniecwhite_": "I love to see it 😍❤️😍", "chudgs": "Happy birthday", "misscrichlow": "Happy birthday love! 💕", "_inott": "I love you both. I can’t wait to fall inlove 😢🥺", "jmaicaroxanne": "This song!!!! ❤️❤️❤️ Happy Birthday!!!", "lesbianlove246": "Happy birthday!!!💜💜", "misssky.allen": "Happy Birthday lover!! Thank you for your endless vulnerability. We are experiencing really troubling times, but I hope you feel loved, today of all days, because you are loved and cherished and chosen ❤️", "ness.ess.ity": "This is precious ❤", "monschristoph": "Absolutely beautiful and great song choice", "maltasgoddess": "You’re my Birthday twin! This is beautiful! Enjoy it, sis!", "keoneaaliyah": "It’s my birthday too! I’m so glad I could share it with such a bold, educated and beautiful human. You have taught me so much about myself. Showing up for myself and other and most important loving parts of myself as I learn. I’ve followed you since I was about 17 and learning and growing, I am 23 as of today. 🤍 thank you for helping me grow and love the woman I’m becoming both inside and out. Thank you 🙏🏽", "sophiasimone_": "I can feel the energy in this 🙏🏾❤️", "strawberrymage": "So cute :,) happy birthday 💝", "sandra_melissa11": "I never knew I could be abe earn up $18,000 with $1000 in a 5day, thanks to @rebeca_fxtrades who made it possible", "spiritualgangstaaa": "Omg!!!! You made my wish on YOUR day come trueeeee!!! This made me SO happy!!!! 😍", "champagneandtequila": "This is the absolute cutest.", "dancinivy": "Happy birthday fellow aries!!!! 🤎🤎🤎🤎🤎🤎", "simoneiwood": "Happy birthday you beautiful soul! 💕", "poofimback": "Omg this is wonderful 😩♥️", "fremabrenyah": "This is so beautiful! <3", "mirthsoul": "Happy birthday Shan! I’m glad you at least have Jared by yourself to enjoy your birthday 💕", "msmoszee81": "HAPPY BIRTHDAY @shanboody 🍀", "iyannibrisslet": "I love the vulnerability 😭 Happy birthday Shan I really hope you recover from this low you’ve been dealing with 💕", "beykaylene": "So beautiful you guys ❤️❤️❤️❤️", "veraliz_": "Happy birthday Shan!💗", "lifeofdianand": "Lovely.", "kimmygeek": "Happy Birthday!!!", "aaexs": "mom n dad fr fr"}