{"animj19": "I think shan stretched the \"open\" relationship thing as a way for more clout. I don't truly believe u can just changed ur mind in an instant, she just wanted to be sure she wanted to be with her now husband, kinda like have her cake and eat it too", "kidd_cara_": "I love you! Really needed to see this video! Thanks for sharing", "brrrennaa": "this is important.", "get_wealth": "We TEACH people how to treat us! Love ❤️ yourself more and then you won’t allow trash in your life! Blessings!!!", "luexproductions": "Well that sums it up for me .... #toxic", "fitnfabulous10": "That’s all!!", "kauuyla": "❤️❤️", "alleynestraker": "@theecambam when you see the signs. Free yourself before you feel more trapped than anything else. Free yourself and let your awesomeness shine! 😘😘❤️❤️", "modelfaceann": "@cocoa_babiie", "rocknation6": "A toxic relationship imagine a dumb chick listening to this actually using this as a guide 1st off since when did you get qualified definition of a toxic relationship 2nd how many relationships you been in cause if you don’t got skin in the game or your not an old head please stop", "ms.niki._": "That’s where there needs to be boundaries set in place.", "lalalauraloo": "@arcamia", "destiny_savary_": "Just saw this on YouTube great tips.", "kimdashlee": "@jaysondyers10", "erickabc": "@melianc29 !!!!!!!!!!!!!!!!!!!!!!!! Escuchalo", "ma.josedelavega": "@giobruschetta 🐰💕", "iamkristenfaith": "@ibeeasian she would be perfect for @btsadv !! Let’s be friends!!", "kyyylie_g": "PREACH @gabbaaa91", "bontle_sekhotho_": "Dude her video's are so educational @zinhle_zinklez", "sarahe.fulmer": "@bevverrly", "wellsy242": "An educated queen!! 💕👑", "polymatic_": "🙋‍♀️", "popster613": "@lish.health.fitlife someone else I follow who is amazing!", "kikinix007": "@yokox3", "q_etesh": "Family. Whole of my life", "mirandafavela_": "@thisisbryyy_", "malpaula": "🙌🏾🙌🏾🙌🏾", "alex.cia": "This video made me pre-order your book.", "leece_yesitsme": "Totally", "swilovato": "@aurora.borealis_21", "hoelistichealthcare": "Hey Shan! ❤️Do ebook preorders count?", "onlyhers4life": "I always say conflict in a relationship is a healthy part of a relationship we are two very different people who think and feel things differently and even if the other person may not understand fully where your coming from being able to vocalize how u feel at any given time makes a relationship healthier..the person your choosing to be your partner should be the one person u can vent to. But I think your so on point about the fact that everyone's communication languages are different and understanding your partners language is a major breakthrough on growth within a relau", "judi_lamb_": "@shanboody😍thankful for @cityline and @thetracymoore❤#newfollower#my 2 new fav females", "editaud.io": "We are so excited! ✨", "hey.itskell": "I googled something similar to \"red flags for an abusive relationship\"", "maxx.lucas": "Love this and I love what you’re doing Shannon! @shanboody ❤️", "poorscientist": "@kaydream_", "eliannas": "@victoriadiemerbennetzen 👏🏼", "_nolamarie_": "When I realized that he would never be capable of truly building me up and supporting me bc of his own insecurities. He began to downplay anything I was good at and pointed out my flaws whenever he could.", "sweetlildesire": "@niklove 💯", "melaboricua": "How do you stay so calm? Meaning if you’re nervous I can’t tell at all. I get so nervous public speaking and since I’m getting my PhD right now, I’m starting to speak at conferences, in the classroom etc . But I’m sure it helps knowing your material and the years of experience. She asked you that question and bam you answered with no hesitation. I need to get on your level 👏🏽👏🏽 lol.", "mami_flyyz": "@shanboody ❤️🇨🇦", "aline.ferone": "@shanboody I have been in that toxic relationship 90% draining/10% energizing and now I am in a healthy relationship 10% conflict /, 90% energizing. And it's actually with the SAME person!!!!! It's because I have been in a bad place back then, so I attracted bad behavior in my partner. I basically didn't give the other person a choice but to fullfill my negative inner patterns. The more I focused on self development, the stronger I became and the more respectful behavior I attracted into my life. Interestingly, at the same time, my partner developed too, just like me. It's still amazing to me when I look back on our journey! I'm not saying you should stick with a toxic relationship in hope it gets better. Of course not. But if BOTH people work on themselves on their own decision, it can be a catapult of growth. On the other hand, I believe, if I had broken out of the toxic relationship back then, WITHOUT looking at and working on myself, I would have attracted the same toxic relationship just with another partner! ♥️☀️", "migdalia_marie": "I’m so ready to receive my book !! It’s pre ordered and I’m waiting patiently", "amour_kya": "@marchmadness91", "_theprincessleah": "Yes, but I didn’t realize it until I got into a healthy one. I found myself mimicking reaction to toxic things and my current partner reassuring me that he was not toxic and my healing can began. I am so grateful 💕", "_crystalliane": "♥️", "yellowmoon33": "My depression has gotten in the way of having a healthy relationship with a guy who loves me unconditionally..", "kukukiki420": "@mskeyathegoddess per your fb post", "mstcbakk.mstcbakk": "Ugh yes 😑 ummm like half way through my pregnancy & i was like” 🙄 this will neverrrrr 🤦🏾‍♀️work‼️”. 👩‍👧 that’s okay though my mini pumpkin & i are doing so well for ourselves 🥰", "ecokerr_": "City line!! Go Toronto 🌎", "elb_muh": "@allysonhairston", "fatiiluvzyou": "@therealdaytime", "iamtwuan": "🔥", "makeway4tre": "Good stuff brejin 🙌🏻", "twomuchmara": "@ctauaia", "cristalk17": "When I was constantly making excuses for the persons behavior", "geliproductions": "I have been single for 5 years and havent even had sex since and feel content being single. Im focus on moving to LA next year, getting my own apt and getting my Bachelors so a guy would only distract me. I can worry about the love when I get to LA lol but love seeing the love between you and your mate💖💖 @shanboody", "brittrfillmore": "I was in an abusive/toxic relationship in my early 20s. He cheated, put his hands on me, would embarrass me in front of company, and ran out on paying bills. Needless to say, I moved all my stuff out when he was gone without telling him, changed my number and NEVER spoke to him again.", "omgakilah": "@shanboody would you describe a relationship as toxic when nothing particularly harmful happens, as in the examples in the comments, but one party still feels 50/50?", "brwneyes__": "I would have to disagree on the definition. I think our relationships aren’t meant to be self serving or what you can get out of them . If you yourself are not reciprocating what your seeking in a particular relationship it’s always gonna be “toxic”. Being content alone and loving yourself is the key bc then everyone you have a relationship with won’t “drain” you and knowing boundaries. I also feel like the word toxic get thrown around so generally because everyone is so selfish now and the majority lacks understanding compromise and compassion.", "lagas_sasi": "Oh my! Thank you so much. I almost cut ties with someone I really, deeply love because of some dark parts of our relationship as I thought it wasn't healthy for me. He was the only one improving while I felt like losing myself in this couple and this short video is helping me so much.", "holyfourofficial": "80/20 is an incredible recipe. Strong🔥", "bellanii07": "I realized when my daughter would yell at me to stop fighting with her dad and she was 2. The relationship needed to end for the mental health and well-being for myself as well as my daughter. Been good ever since.", "gee_nimo": "Not really toxic but one sided.", "taramoussavi": "👏🏼👏🏼👏🏼👏🏼", "_stacey237_": "@shanboody just wanted to say that as an MFT I appreciate your work and openness in discussion all aspects of relationships and sometimes I find key points to share with my clients. So thank you and I wish you continued and growing success 💜", "keyanasade": "I’m in one now and I can’t bring myself to walk away", "ashleymroberts": "When we were at dinner and he said he was ready to leave, but I still had a glass of wine in my hand.. his attitude grew very sour and he pretended to go to sleep...in the restaurant..while ignoring me. He later stated that he wouldn’t have acted that way if we left when he said he was ready go. That’s what finally clicked after 8 years. I walked on eggshells the whole duration of the relationship as my every move was watched and critiqued/questioned. He even started keeping tabs on my friends too...but that dinner moment was my breaking point.", "cassie_ollie": "😮", "vbaby84": "@cristinajefahn", "sincerelyssquared": "been there and moved tf on. toxicity in any instance is unworthy of our energy!", "shannon_kayj": "This is such a perfect description, thank you for this breakdown!", "_doitlikeshasha": "Soooo happy you found your voice mamas!!! I remember you were a little scattered in the beginning chapters of YouTube (but still killing it) and now you’ve absolutely soared ❤️ hope i can meet you one day😩❤️ you and @mayasworld", "emmy_cee": "We had gotten into our millionth argument that got so heated I came thisclose to punching a mirror so that I wouldn't punch him instead. Definitely went home that day upset with myself that I was with someone who brought that out in me. The relationship ended shortly after that.", "saffire_blitz": "When I went to college and saw how other people were treated by their families. Then I realized and recalled how differently my family treated me growing up.", "rachellejonolan": "I can’t even begin to touch the surface of “realizing” it was toxic because it was so complexly denied by both of us. I still believe it’s a genuine miracle I made it out of that relationship alive.. Not for physical reasons, but by the stress of the toxicity and sheer manipulation. So many facets and layers.", "trippy_sasquatch.gov.au": "@_shikspeare_", "iamparissantiago": "So gorgeous and smart ✨✨✨", "tbrooksz": "Shannon you da bomb and all! I have been supporting you since those girls are wild but uhhh these comments hunnay! Look at all these educated black women emotional cleansing their soul and sharing their experiences 💕 I am so here for it!", "toya.alicia": "When you’re genuinely not happy and find yourself compromising your boundaries, your standards and you’re own well being. When you no longer feel good about yourself and feel fulfilled in the relationship. I’d say that would do it! There are almost always signs of toxic behaviour that too often we ignore though and we gotta stop and pay attention and take care of ourselves first and foremost. Great post!", "bonbon_lov3": "🙌🙌Speak it ❤️❤️❤️ I love this", "mr_makin_moves": "Sounds just like the relationship between police and US Citizens", "nenenevada": "Moral of the story stay aware and know yourself ✨", "danisworld": "Ughhhh such a great interview!!! ☺️", "butwhoamireallly": "Didn't realize until 6yrs in....I literally didn't know the meaning of manipulation until I met them. I am a giver and I gave endlessly, any and everything for them. I had no boundaries. 6years later, looked around, I had no friends (partner never felt comfortable with me having friends), felt guilty going out to do things alone (partner always wanted to do things together) no progress in my own career/finances(chased thier dreams/ideas), I was depressed, felt trapped, started flirting with others just so I felt some excitement/happiness/freedom. Being in that relationship slowly tore away at every inch of being that I was, until I was an empty shell. 2 years post relationship I'm still single, not dating, and still re-teaching myself how to live in a healthy state of mind.", "imanibrammer": "So where can we see this in full??? 👀", "momo_sah": "@mjenbug", "tiathecreator_": "I’m definitely purchasing your book!", "kashmaka8": "Definitely needed this reminder... Thank you💕", "mayasworld\nVerified": "Verified", "queen_riese": "When I was accused of stepping outside of our relationship every other week. He made me second guess my actions where I wasn't living for myself anymore. That's when I had to leave for a piece of mind", "imagineinstyle": "Everybody has something about them that will be nerve-racking but nothing should be “draining”.", "veetwodaci": "Oh yahhhh 🔥🔥🔥🙌", "itsjosheats": "YAS YOU WERE", "amethyst_point": "The lack of compassion and consideration for my painful time when I’ve always showed support and gave love for his. That’s when I knew it wasn’t healthy for me.", "20insomechange": "Yup been there", "lex_the_khan": "I love this. I love you. Spread knowledge, queen 🤘🏾", "_poet_mo": "Can I come on your show and tell my story", "beccaaaaw.930": "I was in a toxic relationship, but it wasn’t until it was over that I realized it. That was a year ago and looking back I can’t believe how naive or how much I convinced myself that her behavior was okay. The relationship before this one I wanted to fight so hard to stay in it, but my (ex)gf didn’t. So when this relationship started I was fooled into thinking that the fighting was okay. I’m still working to be at peace with my decisions. I never realized how much the emotional abuse had affected me until the relationship was over", "everythingscominguphayley": "Trying to figure this out but with friendships.", "a_ranford": "@catwildsmith", "itschanicerich": "I’ve been in two back to back both drained me financially, mentally, emotionally and physically. Very abusive toxic situations and like most people said I didn’t realize until after I was out. Being blinded by what you thought was love is sooooo real.", "__taylorlynnnn": "I knew it was toxic when every time i voiced an issue with us or a concern it turned into well you make me do this and that. That’s why they acted the way they did. Or threatening to hurt themselves whenever i expressed i wanted out of the relationship", "karmaaperez": "im so in love with you, you literally put things into perspective for me @shanboody 😍❗️ #KeepOnBlackQueen", "_africangiant": "This doesn’t just apply to romance toxic relationships can have this affect from anywhere", "thejazziestg": "When I started to feel “crazy”, unstable, and insecure due to his gaslighting, passive aggressive behavior, and refusal to hold himself accountable. The good thing is, it only took two weeks to be done. Unlike the last time (7 years ago), it took me three years. 🙌🏾🙌🏾🙌🏾", "whisperunique": "There was a whole lot of signs but one big one towards the end he tied up our dog while I was at work cuz she chewed something & put her in a laundry basket and covered her with clothes. Came home and asked where she was and I swear to you I saw the devil in his eyes. that was four years in. Also, sex was always painful. I realized afterwards when I experienced healthy relationships I loved and enjoyed sex (and no pain!), my body was shutting down & didn’t trust him and I didn’t realize it.", "starryjennings": "When I attempted to break up w him & he said “no we’re not breaking up”, stalked me, and slashed my tire. There had been so much toxicity there the whole year-ish we were together, in hindsight our relationship actually began based on him manipulating me after I set the boundary that I didn’t want to date him. Grateful to be able to recognize similar flags from now on.", "leahjb15": "everyone needs to hear this! thank u for breaking it down ❤️", "iamjadefox": "there i was, scrolling. and then this post smacked me in my god damn chest", "thatgirlrory": "@tuduontumetse", "yisryliyah": "He went to see a prostitute the same day we found out our STD results were positive (which he picked up from sleeping around and gave me.) I knew that same moment his love was not real. Still hurts though.", "anni3_r_u_ok": "My most recent ex had/has an issue with drugs. I was always sp worried he was going to OD or get arrested. He faught with me over the smallest things and expected nothing less than perfection from me. I basically became like a care giver to him and he did nothing or gave nothing back in return. I realised I had to get out when I wasnt eating or sleeping for weeks on end and I felt like committing suicide. I'm so glad I left that situation, not to say I dont still miss him or that I dont love him anymore... it was just too draining and I couldn't watch him kill himself anymore", "wolfpawsandrainbows": "Oh boy. There was a series of moments over 4.5 years. The final straw was backpacking in Pukaskwa National Park (Canada). The lead up, the planning, the after. I had a panic attack the night before we left and he blamed me for not being ready while he hadn't even come home that night to help. The trip itself sucked and when we returned home early we were home maybe 15 minutes home before he left for his parents for the week. I broke up with him two days after he got back. Took him vandalizing the apartment before I kicked him out (felt bad because he needed a new place but then he found out I had starting seeing my then best friend and now fiance). This got way longer than I thought and I am so sorry", "lordelightskin_94": "Whew, I could be here all day cause I got some damn stories 😭 never date girls from Ohio, broads are cruel. Thing is, I didn’t realize I was in one until I got into a healthy one (with my lovely headache now). And it makes you realize (shit, this is how you’re SUPPOSED to be in a relationship, fuck was I in then).", "savagesonya_": "I’ve never been in a toxic relationship, but when you ask the right questions you can sus out the individuals out there who are fake", "stephmilius": "my cousin said, “oh my god does he really talk to you like that?!”", "jacindathegreat": "So...Moral of the story: STAY SINGLE! lol I feel like everyone drains me tbh", "chezalepresents": "Great advice!", "iamnovibrown\nVerified": "Verified", "lynn.coco": "When I kept making excuses for him, gave him another chance, and he didn't change. I realized it was a pattern that wasn't going to change.", "siren_3y3": "@shanboody i loveeee the light you bring!", "curvesdee_luxe": "I knew when my boss looked at me said my eyes don’t shine like they use too.", "locsnleesa": "@hunny504", "treasures.place": "The time i knew was the moment i began to describe my experience to my friend B. I mean listing off being burned, fights, emotional turmoil, as if those were normal things to experience in a relationship. I was like ohhh, damn. This really isnt it!", "priscillabarney_": "When I learned the definition of gaslighting and realized I had been manipulated into feeling shame and guilt over things that were not my fault. Also, the moment when I realized I would hide certain aspects of my relationship from my closest friends and family for fear that they’d call my ex out on his bs. 🤦🏽‍♀️ Thankfully, I’m in a different place now and have learned how to set healthy boundaries! 🙌🏾", "just_amillion_thingz": "💙 This explanation", "freyamayy": "when he went to a strip club the day i found out my friend had committed suicide 🙅‍♀️", "katemariemcquade": "the moment i realized when i went to jail because of it. he was interrogated by the police after being charged with a crime &instead of saying “i plea the 5th, i want a lawyer” he attempted to shift blame away from himself in any way possible by blaming me🤣 while i was in a different city with family at the the time he was charged with the crime. &he let the police text me from his phone number to lure me to their location so they could arrest me. they arrested both of us, he didn’t get anything for dragging me into his business.", "douphph": "#BangOn", "reallychyna_": "luckily i learned from watching my parents and friends", "rowiekins": "I was in a toxic friendship but I was the toxic one. I didn't realise how much I was hurting her until she stopped talking to me one day. Her stopping talking to me was the best thing she could have ever done because it made me realise how awful I had been treating her. No one should ever have to go through what she went through and I can never forgive myself for what I have done. I am so grateful to you for talking about toxic relationships.", "reesiebabe": "Facts!!!", "glamgirljaayxo": "My first relationship I don’t even know why I stayed ahaha young and stupid don’t even call it love now smh #Growth", "potentialfilmsinc": "FACTS", "jasminee_fit": "Yeeesss🙌🙌 I'm glad I ended my toxic relationship", "jjlc_photography": "💯", "hayden0livia": "I was in denial for a long time but I realized i was in a toxic relationship about a year and a half into the relationship. It took me a long time to realize what I did and didn’t deserve and my worth but I know it now and I’m in a wonderful, loving relationship. It’s hard to imagine that just four years ago I was in such a dark place. Love you and the work you are doing. You help me to feel that I’m not alone or crazy for thinking/feeling the way I do. ❤️", "eyrricka": "Might be in one now. I care for him and love him but don’t feel that he’s the right fit and when talking about breaking it off, he talked about feeling worthless and wishing he were dead. I’ve had relationships in the past where I was codependent and thought I’d broken the cycle but realized in that moment that maybe I hadn’t after all.", "valid__a": "when the relationship was over & I was physically haunted by their presence years after breaking up bc they felt the could come & go as they pleased (they’re still trying to) & I didn’t know who I was w/out their faults being projected onto me. now I’m in a relationship w/ someone I’m in love w/ who loves me back & is building a future w/ me", "whatsunderyourscrubs": "When my ex went to rehab and it was the first time we’d been apart in 6 years and I cried because I finally felt free", "kcaesthetic": "80/20 I needed that", "sillla": "This", "_____poetik": "I was, and I realized when I felt him emotionally draining me.", "cat.elise.williams": "I had my realization about halfway into the 3 month relationship that has shaped my love life the most. When I realized it didn't make sense to constantly have questions about the nature of our relationship, and I realized that I shouldn't be silencing myself around him or my friends. When I opened up about my situation to my friends and my therapist, and he told me not to talk to anyone other than HIM about our relationship. When I realized that I constantly felt like I was never going to be enough. When the lines of our relationship were blurred between poly and open, and our conversations about it were never going anywhere. But now I'm 7 months free of him, and I'm so much happier.", "majorrsmith": "This is so good Shan. Perfect timing sis perfect timing", "delianlp": "Love this answer! However, do be weary of those “little bit” draining and toxic people. Like Shan said conflict is healthy but I don’t think you should feel drained.", "domifreakingj": "I feel attacked. I wasn’t ready girl", "_msimmaculate": "Where can we watch this!!", "lstanford": "Loved this segment today! You’ve got a new follower👌🏻", "taiylarmade": "I definitely was! I knew it was toxic when I realized the person didn’t respect me. Her lack of respect caused her to treat me in ways I knew that I knew weren’t right. When we both projected our traumas onto each other, I knew we had hit rock bottom and then I decided to leave. It’s been the best decision so far because I fell back in love with myself. I will never allow anyone to treat me how she did.", "ynotkeeb": "❤️❤️❤️❤️", "zhana123": "when i finally got with who i was supposed to be with from the jump", "jocariperalta": "Then I definitely was not in a healthy relationship", "_kaylondon": "Yus! Thank you 🔥❤️", "flashman.wade": "Yesssssss", "i.amnicole.d": "Love it! ❤️🙌🏾", "theblossominglotus_": "I remember feeling silent like my words didnt matter. I remember forcing my words to stay inside and that's when I knew. I was NOT created to be quiet. If my words didnt matter in any relationship, I knew I'd never be free! I am thankful I loved writing at an early age. What they never knew was that I never sbetrayed my voice, even when demanded. My intuition always led me to the pen and paper!", "fabab13": "Love this 🙌🏾", "classycassi278": "This segment was excellent... 🙌🏽🙌🏽🙌🏽", "motherinthewild": "When I was sick with food poisoning and could barely crawl to the bathroom, let alone walk my son across the street to school, and when I asked my boyfriend (at the time) to do it, he yelled loud enough for my son to hear: “He’s YOUR kid, YOU do it!” I left everything behind (the house is now worth over $2M) and started over. Now I’m healthily married to someone who would drop everything to help me out!", "misscrichlow": "Love this. Short and sweet explanation everyone can learn from! 💕💕💕", "andrisethe1": "I've been in one toxic relationship and she never let me hang with friends, I couldn't talk to any girls every one's that came before her and we argued ALL the time about fuckin nothing. We broke up and now she's got 2 kids and is always talking about how she wishes we never broke up and she misses me. 🤷🏾‍♂️🤷🏾‍♂️🤷🏾‍♂️", "ms.shanelleh": "I love this", "_lexisevans": "When they complained about every little things I was doing and who I was as a being.", "miss_lokay": "Yep unfortunately", "tephywephy": "Ugghhh yesss! Realized I shouldn't compromise my happiness for anybody else. Our mental health come above everything. Tell yourself you're a fucking queen and you deserve nothing but the absolute best ❤️", "porteluswaldine": "I like how clear and straightforward she ask the questions to Shannon", "thuggishruggishbonnie": "I was in a relationship with someone that lived 1.2 miles away and he never made time for me. My son asked him if he wanted to go to the movies with us and he flat out said no he didn’t want to see a kids movie. 🤦🏾‍♀️ the moment I realized how truly selfish and toxic he was I had to let it go", "itstracyg\nVerified": "Verified", "muh.ry.uhhh": "Yes 2 months free of it 🙏🏽", "char80sbaby": "More important than realizing your in a toxic relationship, is realizing you also have toxic behavior... Which is the reason you attracted it in the first place.", "chantel_riley\nVerified": "Verified", "phydiva": "This is so well explained 👏🏾", "_francescaestrella": "@lucchianaspaudo", "jiisica": "Not until after the relationship was over 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️ I couldn’t admit during the relationship that it was at all toxic because I refused to believe that I had been so unkind to myself enough to the point of allowing myself to be treated the way I was and to keep making excuses to forgive and stay in the relationship even though it seemed like almost every week I’d be crying and screaming in my car at the top of my lungs, pulling out my hair and I couldn’t for the longest time figure out why until the relationship was over.", "miraeaiofficial": "Yes I have been. Shit damn near killed me emotionally.", "mrspennylane_": "@shanboody ugh I was in SUCH a toxic relationship for 4 years 😱 there were TONS of moments I had that I can’t pinpoint, but I can tell you the EXACT moment I knew I had to leave🙌 I snuck away with a group of girl friends and had the time of my life for a week and I was like “this is how life should be” no panic, heaviness, shame, anger or pain. I called him and broke up with him. However it was very open ended :/ its been several years since then, and I have a lot of trauma from that relationship, but thankfully I’m in therapy 🙌", "shellisshe": "Every time I expressed my feelings they would get mad & defensive and it turned into an argument. Even for something as simple as the reason I like the ice cream I liked vs the kind they like 🤦🏾‍♀️"}