{"blendedblkgrl": "She’s 🗑", "alizahkiarie": "This is a repeat of the typical white ‘woman needs attention’ stunt. White women invalidating the words of black women but then turning around and saying the SAME DAMN THING with damn near the EXACT words.", "bballmom786": "@sarahshahi never even heard of this woman before... white women love to call Black women “cute” to devalue our maturity when they’re really super intimidated... tell this short bitch to get a grip and watch her mouth... looking like a middle-aged chihuahua", "chudgs": "There is always going to be someone out there that not going to like you & don’t know anything about you. Just smiling a keep it moving.", "anaismxy": "Maybe she was just jealous of you hence the \"shes so cute....but\" 😔", "rocknation6": "It’s called a personal opinion bitch if someone has a personal opinion about you it don’t matter bout yo feelings cause it’s there opinion learn to take it bitch or do you need a safe space do you need a venting session or should a personal opinion be banned and outlawed listen go be a whore and stop crying", "gloweileen": "Ok but who tf is she? She needs us to descend", "imjazzmineleigh": "Shan...where is your vibrator necklace from?!", "ambra.is.love": "The fact that someone you don’t know could hurt and offend you in this way is the actual problem. This means a stranger has a lot of power over you. She’s showing you a powerful lesson. ;)", "forevermoniika": "U watch her videos I like the one she talks about aging on youtube I Jus followed her on here @uniquemarieholmes", "creative_nas": "Ok, a little late to the party but here's what I gotta say. I feel you on being hurt, I acknowledge your hurt and I'm extending compassion for your hurt. That being said, you know what was the most ironic thing about that segment, the fact that she said that she wouldn't take advice from you but proceeded to give advice. Ummm where'd she say she got her sexology license from again 🤔? Oh right she didnt have one. So why even give her any light? Your advice clearly wasnt for her it was for the happy couple who from the looks of it, worked. So I'd day you win!!! Yay!!!", "susanalambert": "My girl literally repeated EVERYTHING you said in a less sophisticated way.. So what was her point???", "cata_maomix99": "It’s such a shame women have to put other women down with no rational sense of motive . She can disagree but in a more constructive manner , and her disagreement point was invalid . Why In the 🌍 would you ridicule someone who clearly has credentials than just being a cute face ! If anything she’s the cute face because she’s and actress and acts like an airhead on television . Also you embarrassed her on live television ! No shame , No class , and definitely SUpEr idiotic .", "melismakeupxo": "@sarahshahi shame on you for trying to diminish another women’s work.", "eoremo": "@sarahshahi shame on you. Do you feel better about yourself by putting others down??.", "danavancey": "Because someone disagrees with you that means they’re questioning your credentials?? I’m confused.", "datmommadukes": "R you serious if you were that educated you wouldn't even have commented about what she said everybody isn't going to agree with what you say or take your advice the mature thing would have been just to ignore it and move on", "rebeccaperrin": "Sarah owes you an apology and she really should issue one, the perception is that she’s willingly ignorant and an absolute idiot.", "kmd_nolarealtor": "@quianawatson_ true example of auto pilot hate 🤦🏾‍♀️😂😂", "shrutisadana": "Also, congratulations on your book and all your successes 😘 it is very well deserved!", "alyse.nakyra": "@sarahshahi This is truly disgusting. Women should always have each other’s backs, especially in this economy.", "pierrette.panashe": "Honestly don’t get where she gets off on making a mockery of you and your hardwork... reducing your worth to your looks! Only to then go disagree to what she wasn’t even listening to and saying the same thing 🤦🏾‍♀️ Women should be warriors of other women and if she can’t be bothered doing that then why are waste your breath on someone you don’t disagree with when you could be promoting your own things 🤪🤷🏾‍♀️", "ayeeyomichelle": "I got teary eyed first time watching this video; what a BITCH! Keep shining ♥️", "kiana_latrese": "@sarahshahi take note sis. This is class at its finest😍", "reginarharris": "You have done such an amazing job. Your work speaks for itself. Just know that those who are specking from a low place are in a low place. And God bless her!!", "makeitez97": "We riding for you girl. Most eloquent clap-back to date 💕💕💕", "sade_ashley": "@sarahshahi you're NOT cute", "tsamar1997": "The hosts of that show are just as bad for laughing along, I really hope they issued you an apology to you. Disrespectful period, if she disagreed w you she could have easily pulled u aside privately and had a respectful convo.", "deluxlopez": "God bless @sarahshahi shes so cute.", "celestial_ange": "Sending you love and support❣️ Girl you are amazing and don’t have to prove yourself to her because the proof of your success is very apparent", "mixxedbreedtoya": "💙💙💙 You are the bomb hunni don’t let that hate dull your shine...good job addressing it tho 👏🏽 I appreciate all of your advice you give 😊 keep up the awesome work 👏🏽💙😊🤗", "ricomessiah": "Keep doing you! Don’t let her energy bother you. Her disrespect will not be tolerated though.... Fuck her", "iam.adriv": "You popped up on YouTube, glad I clicked. Keep your head up... I'm buying your book!!!!", "camilleleniece": "@sarahshahi this is why people like you don’t deserve to be in the place you’re in.", "dfelix70": "@accessonline should be ashamed. It was very unprofessional for @iamscottevans and @kithoover to allow @sarahshahi to be so disrespectful and condescending towards you. Disgraceful of all three of them", "hottielupita": "She wants advice from who.. a old white fart 😂😂 ugh white women are a joke", "_vindicated": "@sarahshahi girlllll you cute but you goofed. You too @accessonline", "victorious911": "So sorry you had that experience. I just checked out that woman's page and apparently she decided to limit the comments that could be made since people saw your video and went in on her😂😂😂😂😂! You're where you are because you deserve to be there and you've worked. Keep striving, you're inspirational🙌❤🙌!", "cicimoya": "I've now change my opinion on this video. It's true that WOC can't stay silent anymore. We're always \"too loud...too reactive... too aggressive.\" Dammit, enough is enough. I take back my comment on your YouTube video. It's evident that this post has touched many hearts who relate... So it turns out I'm really glad you spoke up 🌹", "sandisiwembadlanyana_": "I'm glad you spoke out about this. #westanwithyou. You are a powerhouse, you're beautiful and beyond amazing. You are amazing Shan. You are AMAZING! A GIFT!", "lleze84": "@heyfranhey @lookatdustin @heyassante @kidfury @crissle", "illiegetdoe": "U should do a segment on sexually and love with disabled people like sex with someone in wheelchairs and things @shanboody i am available if u need insight if u already dont have it it would be my pleasure lol", "lifexautumn": "I couldn’t envision myself with a seat at the table until I saw a person who looked like me (you) sitting at the tables I wanted to be at. Seeing you fight for your seat tirelessly encourages me, motivates me, and makes me value you more and more everyday.", "vale_calder27": "Classy ❤️❤️", "alyshalikespink": "fuck. her. UP!!!", "nia_message": "It’s so much that can be said. Wow! But usually when women are so quick to attack and discredit another woman it’s because they are in lack of purpose at times and are intimidated by your very presence. It’s quite interesting that she pointed out your looks and as a punch line but uplifted another woman out of the breath. So we can’t young beautiful and give relationship advice? How judgmental. To uplift another women does not discredit the next! @shanboody carryon you are awesome💜", "lisha_plz": "@shanboody such a classy and respectful responds...ur awesome🔥🔥🔥...I'm still growing...mine wouldn't of sounded like this at all", "davidachanel": "I am drawn to your work and I am in awe of your courage to share your journey through your work. You are seen and your work is valued.", "nanalove.xox__": "Shame on @sarahshahi", "nerima_groove": "I love how you responded to that ❤️ more power to you! That is the way of dealing with something like that to look up to and take notes 💯 thank you!", "cyndi.grant": "@sarahshahi", "its_janelle_tho": "@sarahshahi Shame on you you unthoughtful woman! Please go apologize to Shan Boodram right NOW!!!!!!!!!!!!!", "redjailove": "So sad that we have to constantly explain who we are and our experience to people who don’t do research or ask questions before coming out their mouths. She can have an opinion but to belittle someone’s talents is ridiculous", "naomicowan\nVerified": "Verified", "iheartanyarenee": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 Amen and amen ‼️", "sexyfarmsbabe": "Hey babe, can we send you & your friends something from our Swimsuit & Athleisure (athletic leisure) store? We think you and your friends would be excellent models or ambassadors. DM us to get started 😍💋🔥 xoxo", "ajahlee": "That was an extremely classy clapback! You did that!", "capriciouscompany": "You’re so much more than CUTE. 🙄🙄🙄", "californialovesfrenchies": "Don’t be hurt or offended!! You shine so bright sistah and that brightness has folks all bothered and up in arms for anyone to say something wrong or weird against you they see Brilliance !!! I see it and it’s written all over your face you don’t even have to say a word😘", "kayodemodupeojo\nVerified": "Verified", "fluffykilburn": "She disabled her comments 🙄 weak ass", "esengolabel": "@sarahshahi", "shaunabaker\nVerified": "Verified", "_neasantana": "Wow. Ughh! So disheartening to see not only a #woman but a #Latina, discredit all your work with such a smug and dismissive attitude. That “cute” comment would sent me over the edge. Esp in a #Trump era, the lack of support is truly astonishing. Disagreements are great and completely valid, it opens a space for communication which is great! but when you are being a bully on the playground as a result of some sort of insecurity... No Bueno! We love and support you Shan. You’ve earned every #cute ass right to be here educating people on the topics of sex and relationships! 💙✨", "thekrisinreallife": "We need more women in this wolr", "gurpreet_randhawa97": "👉NICE💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥👉OSM👉💞💞💞💞💞💞💍💍💞💞💞💞💞💞💞💞💞💞💞💞💞💞👉LOVELY🔥🔥🔥🔥🔥🔥🔥🔥🔥💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞👉BEAUTIFULL💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞💞🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥💞💞💞💞💞💞💞💞💞💞💞💞💞", "thisischrystian": "@johnettalafond @hashimlafond y’all are in this and curious of your perspective. Super proud of talks achievements and rooting from #boston", "herehaveanecard": "Shannon, wow. You are the EPITOME of a strong woman. If I didn’t know that before I know it now. There are SO many adjectives I would use to describe you and believe me when I say “cute” is probably the LAST. Not because you aren’t attractive or whatever...but because you are so multi-faceted that so many other words are worth mentioning before just a physical attribute. You handled that with friggin GRACE & POISE. And believe me when I say, you ARE our generation’s Dr. Ruth and THEN some. You’ve inspired me to really take a look within and examine myself as a woman and in relationships. As someone who NEVER reads “advice books,” I purchased TGOD - not just to support you, but because you are so well informed, so articulate and so personable...I BELIEVE in your ability to teach me something valuable and new. I hope @sarahshahi takes some time to read your book or take in some of your other work and evaluate how she can be her best self - which is exactly what you’ve helped me to do 💕 TL;DR - you’re friggin amazing and Toronto (and Guyana) is so proud of you!", "__j.kay___": "@sarahshahi", "godgivengenius": "Your the best!! .. she prob hating on the success of your book. Shake those hoes off of you!!!", "ironmonkeebrand": "Yo @shanboody I'm so sorry lovely queen. I know what I'm about to say is not your style but..[ She must got you fucked all-the-way-up! ] WTF?? Is she serious or on bath salt crack? •You have dedicated your whole adult life to empowering All people in general to embrace their creator given sexuality. To be strong, assertive but responsible individuals and couples. Through you we have all vicariously found what we've needed in life: a web wifey, a fav author, a muse, a counselor, a true friend, a sister, the best Sexuality adviser and you've done this through hard work and grind! What you do, that seems so effortless, would be like a trigonometric equation if I were to even try it. Honestly and truly.. she got me all ALL THE WAY Fucked up. Trying you like that I'll slap her ass !!", "1love7even": "🗣 Seems like she just wasn’t on your level. I saw the threat in her eye. Ewww. Do you sistah!!! 👏🏽", "callmekamille": "Unnecessary and honestly comes off as insecure. To disagree with someone, vocally or not, is one thing, but to use your platform to belittle another woman is insanely sad and counterproductive. As someone who has had such phenomenal support from women and who prides themselves on the uplifting of others, it's sad to see this. It's also interesting that many of her statements seem to be reitterations of yours, whether she knew or not, it makes me wonder why she felt such a strong overwhelming desire to discredit you rather then build credit for herself.", "dramattie_3": "Wow... that’s awful. I really liked her ever since she played Carmen on the L word.. but, I cannot support or be a fan of someone who tries to bring others down. You’re an amazing human and did not deserve that. 💜", "staciatheartist": "Girl. This whole video gave me chills. Super proud and inspired by how you handled this. YOU GO GIRL!!", "j.shamese": "@sarahshahi we’re waiting for you to issue a public apology. The audacity of you to degrade another woman’s expertise.. it takes a very insecure person to tear someone down in an effort to build themselves up. Do better!", "migster.tc": "This was just disgusting. You are the best Shan!!!", "doelowsoulgroup": "And now the hashtag #istanwithshan has been banned! Goes to show you just how the whities try to silence us.Just imagine,a rightful hashtag bringing awareness to what our Queens who are leading us have to unfairly go through.Why would they block that hashtag?!", "niftykeisha": "Typical, petty, immature, pathetic behavior. All she showed was how much work she needs to do on herself. That insecurity is not a good look mama. We see you! @shanboody keep being the intelligent and accomplished woman that you are!", "stevie__med": "Dear Shan... you are so much more to so many people than you will ever know. I am a WOC in medicine and your you tube video for this resonated so strongly with me that I had to do the church shout as I ran around the room. The work we have to put in to even be here... there is just NO comprehension of that for so many. But what I loved most is not that you spoke out but HOW you spoke out. The way you respectfully targeted the conversation and openly acknowledged your unwillingness to accept someone’s attempt to be disrespectful to your role/knowledge while still up lifting that very same person... GIRL!!!! And then going on in a second post to teach even more by sharing what you’ve gotten from your life partner and putting it into action... You are just alllll the life!!! And with all the “ratchet” crazy foolery currently trending as ways of handling conflict, you are the EXACT type of role model young women of any race creed or color need to see in their social media timeline. Please never stop sharing you and the lessons you learn as you interact with this world. 🙌🏾", "naturellabellalive": "You came with the receipts, bravo! 👏👏👏", "sharon_kambale": "I love you lady ! Keep pushing!", "hiphiphoorachell": "I loved your segment! I'm so sorry @sarahshahi had to say such rude and ignorant things to try and undermine your expertise. Your're amazing and keep up the good work!", "andreank95": "👏👏👏👏👏👏👏", "victoriawisechild": "I adore you and I have been following you for a long long time, I feel so frustrated and irritate that you continuously get put in situations where you feel as though you have to defend yourself from being minimized or a dismissed for the space that you take up. I think you're amazing, I think your work you're doing amazing and vital. You have earned the space that you have taken. And you deserve it.", "lauren_htxx": "Watch this “cute” video @sarahshahi", "aliciuhhhh_": "THE TEA🔥🔥🔥🔥", "rae_wambia": "I love you...❤️ u rock", "majedamtb": "Speak on it sis 🗣💛", "ivycoco23": "@sarahshahi you should watch this", "naija_queen_": "@sarahshahi stop tearing down hard working women", "artist.mab": "Crybaby ass bitch😂", "bkiddo13": "@sarahshahi shame on you. Apologize to @shanboody. Why you would discredit another hard working woman is behind me. YOU GO SHAN!!! I’ve been watching your YouTube channel since I started college and you have help me find self love and what I would like to find in a relationship. Love you!!! P.S. always thought I was following you on Instagram 😩 now I am!", "geliproductions": "@shanboody She didnt hear you! Say your name again and again because she is going to remember who you are. Oh your are more than just cute , when they see women of color rise even women who should upllift other women push them down. This is why we need you and the other women to rise ro show others there is no stopping us..PERIOD!", "_exotic_vibez": "What she said and her whole approach really says a lot about her energy and it lets me know that a few of her chakras are off balance. She has a moment to let HER purpose show thru but instead she tried to discredit yours (to no avail might I add). You addressed this magnificently with such grace and poise. Keep educating yourself and educating us. 👑 @shanboody", "msnova11211": "She said that because she's insecure. She wants an ugly old white woman to tell her about sex Because that makes her feel better about herself. You a bad bitch and clearly you frighten her subconsciously. That comment was a clear sign of insecurities. And fuck her!!!", "refindyou": "Nothing anyone says about you or to you is ever personal! Your credibility can never be questioned unless you question it. Just some encouraging words to remind you that you are a bad ass and no one has the power to take that away from you!! Keep shining boo! 🌟🌟🌟🌟🌟", "getoutthebox": "Shannon your review of what happened gave me chills. There is nothing I hate more then condescension. Did she even listen to you?? She just decided from the get go she wasn’t gunna take advice from a young attractive black woman, like you couldn’t possibly have the tools to provide assistance to the couple you were helping. And for everyone to be laughing, even the hosts. Like wtf. So gross. You continue to kill it though Shan, you have done the work and continue to so that will always be the thing that gets you in the doors. Great job thus far!", "its_astoldbynatalie": "Oh so she thought you were just a “cute “face 👿 @shanboody is the most eloquent , knowledgeable, respectable person I follow on YouTube ! Especially in her craft ! Love you Shan ! The haters will hate , keep doing you boo !!♥️", "rn_beauty87": "Just watched your video you laid it all out there so gracefully and beautifully and I commend u on being so positive while still defending yourself. Sorry you had that experience but in that I'm sure you helped so many and myself with how to stand up for myself without spreading negativity", "spookyforestfaerie": "As someone who grew up in Scarborough watching your videos on youtube because adequate sex ed wasn't always available in my own community - I am so thankful for the space you take up as a being on this planet and as an educated, strong and brilliant being. Thank you for being continually someone that I idolize and thank you for handling this with so much grace and love <3 Love you Shann", "wachslena": "Am so sorry, but you know you and nobody can take that away from you..💕", "_themedallion_": "Just know as a woman and furthermore as a woman WHO LOOKS LIKE ME, and like many others whom I love - I ADORE And respect and value and appreciate WHAT YOU REPRESENT & PROVIDE. the insight and knowledge you share - You have resonated with me from the first day I came across your spirit online. The amount of audacity one might have to ATTEMPT to discredit you in an arena where YOU’VE CLEARLY SHOWN UP .... says a hella lot more about them sis. Bravo on using your voice even in moments like these, the world needs you and YOUR CONTRIBUTIONS ARE MORE THAN VALUABLE !! But you know this !! Major love from Jersey ‼️‼️ 👌🏽", "oxiamxo": "Keep that beautiful head up queen!!🙌", "manda.pandie": "Wow... that’s crazy. I’m sry that happened to you. She should be ashamed 🙄🙄🙄🙄 YOU GIVE THE BEST ADVICE", "sexologistmegan": "Really unacceptable. You’re amazing and It’s evident that she has no understanding of who you are", "minimalistblkgrl": "She just a haterrrrr. She doesn’t take advice from Dr. Ruth. @shanboody you have helped me so much figure out how to navigate this hell of a dating landscape, we have watched you grow from firing your manager to now making (idk) a shit ton of money. We watched you find love, evolve as a creative, try new things, fail, try new things again, and succeed, you’ve doubled your following count in about 2 years. Girl, she can’t take it away from you because you already did it. There’s people that tear down Beyoncé. You got old tired ass wrappers that can’t wrap their brains around women like Cardi B topping the charts. Let them talk. They only talk because YOU ARE RELAVANT. And think about that! Instead of promoting herself, she brought more attention to you. She shot herself in the foot. You are great, we know it, but most importantly, you know it too.", "ciciriot": "I watched your full yt video. What happened on @accessonline was completely inappropriate. As a woman of a colour who knows what it is like to have to constantly prove your capabilities and value In spaces that were not traditionally made for you, I am sick. These comments are so offensive and hurtful. And for it to be perpetuated by another woman of colour is so disappointing. @sarahshahi - do better! How would you like it if someone used their public platform to pick apart your accomplishments or to so casually make determinations on whether or not you’re even qualified enough to be speaking on a panel. Imagine someone telling you that you’re no Meryl Streep or Halle Berry. Or only accepting the opinions from people who have won an Oscar or Emmy. Finally, @accessonline , I hope this was a one off. The experts you bring on your show deserve more respect than your hosts showed Shannon when they allowed the discourse to continue. Unacceptable .", "dreyashardai_art": "I think she wasn’t referring to ur looks when she said god bless ur cute that was her way of belittling ur intelligence... u are amazing keep shining, keep educating, keep growing, keep uplifting, keep rocking cuz u rock sis", "thefunkiwan": "Yes please! My friend is in a wheelchair and get discouraged by people intimidation’s of how he might be “limited” but pleasure comes in all forms and his erogenous zones have moved themselves to more accessible places. The world needs to know!", "kacii_eleven": "Oh Carmen, I am so disappointed.", "thevalentinean": "Now following after watching full vid on YouTube. K. Thanks. Byeeee!", "itsnavnit": "@sarahshahi check yourself pls cuz you’re not cute", "courtneyalise": "Ughhhh so frustrating and so hurtful. It’s ok to disagree with someone, however, it’s not ok to disregard or discredit your voice! And i agree with you. The most invigorating part of this is her excusing her behavior by calling you “cute.” I worked on Steve and although we never met, you were one of my favorites! Ask Shareen :) I’ve always felt you were one of the strongest, most powerful women we have ever had on the Steve show. Your ability to speak your truth, regardless of popular opinion, is what I admire most about you. Yes, you are beautiful but your beauty pales in comparison to your spirit, soul and profound knowledge of human behavior both emotionally and physically.  Keep shining, bright star! Because that’s where you belong. In the light 🌟", "murj_art": "I’m so pissed for you! Yes let’s dismiss this hard working woman and call her Cute hehehe 🙄. The fact that she spent her whole segment kicking dirt.. Wow! The hate jumped out! Keep shining Shan you absolute powerhouse!", "candace_ecadnac": "DAMN!!! 👏🏽👏🏽👏🏽👏🏽", "michelllleeeyyyy": "You’re MY Dr. Ruth!! Thank you for providing this example of how to handle conflict without sacrificing your value and worth. Can’t wait to read the book!! 💕", "niall_forall": "SUNY?!? Does that mean you may be doing some things here on the East coast? Please post if so, you are one of my FAVORITE sexologists and would definitely go to any presentation nearby!", "kimberlyn_ellis": "I’m speechless at the amount of grace, poise, and ownership of your space that you articulated during this video. It’s extremely inspiring and a teachable moment for all the black and brown girls who will consistently be told that they don’t belong in a field that they worked their asses off to be in. You don’t just have a voice or seat at the table. You ARE the entire fucking table!", "cindurella": "You go girl!! This moment has clearly already made you stronger.", "natasha_sen\nVerified": "Verified", "deszw.jr": "Don’t ever unknowingly give fuel to a fire, that would have flamed out literally that day. Just continue to walk confidently in you and I’m sure you know that everyone else are just Co-staring in your movie called life.", "iknow_nolimits": "The fact she had to address you and compare herself shows she’s intimidated, possibly jealous, why not just speak her own truth instead of having to juxtapose you against hers. Just highlighted your powerful presence... take it with a grain of salt keep creating greatness! 💪🏾💪🏾🖤🖤", "lemonpepperwngs": "@shanboody This was so eloquently said Shan! It is evident to me that she is extremely jealous of your beauty, which she SPECIFICALLY mentioned, your articulation, intellect, discernment, & delivery. I feel sorry for her as she has not yet found her own confidence. Her own self worth. Her own light that she feels the suffocating impulse to “attempt” to dim yours.", "dlth5k": "Keep on doing you Shan. There will always be haters. Love ya", "marjannahfaith": "@sarahshahi", "glographics\nVerified": "Verified", "ladyzee143": "She’s not worth or time or your energy. You are Amazing at what you do that’s why I follow you. She needed to say what she said to make herself feel good about herself and what she has accomplished. She can not discredit you or all your hard work! Stay Blessed and Keep Shining. 🙌🏼🙌🏼🙌🏼", "kmaries91": "The fact she said all that means she has no idea who you even are... the people who know you know you are an expert in your field, PERIOD. Which is why you were brought on in the first place. Like who hurt her?", "beequammie": "This is infuriating and shows a LOT about her character. I'm so sorry you had to experience that, but continue flourishing in the work that you do because it matters (or they wouldn't have INVITED you on...nobody nah beg fi nuttin SMH). Mek she gwan.", "leegraylove": "Watched it last night. #TALKTHATSHIT 👏👏👏👏", "imcharmed4evr": "- I cud understand u feeling a little upset, though u don’t need to go thru ur credentials with us, those that follow u, know ur education and how hard u work, not to mention all that u’ve accomplished. To be fair, I’ve never even heard of this women. Remember, if u have haters, ur somebody. 😅😂😅", "jess.lorraine.p": "Ugh @sarahshahi do better girl 🙄 let’s empower each other instead of dismissing the other because their path doesn’t mirror your own", "tats_adz": "SHUT IT DOWN SIS!!! I mean your whole video gave me chills!! You’re even taking this opportunity to educate people on how to stand up for themselves in a graceful manner and respond in the case of an attack. Like can you get any greater!?! In awe of you and your character, you’re truly special. Everybody knows what she did says a whole lot more about her character than anything about you. We stan with a Queen!! 🙏🏼", "itsjeyyy_": "The real question is WHO IS SHE EVENNNNN i literally know her as corny ass Carmen from L word, who played a Hispanic and is not one. Forget her l", "msginger2013": "How annoying", "jocariperalta": "You are so classy and so inspiring. I love how you’re an open book and a deep thinker who takes us wherever you go, in the good times and in the bad. Keep sharing your story and your light. 🙏🏽💖 Remember that you earned your spot and only God can judge/ decide if he wants to remove you from there or keep you there. No one else has that type of authority. Sending love ❤️", "tooth.gapbaby": "@sarahshahi", "gabelisabeth": "You know you are doing something right when people come for you like that! Don't let her dim your light. Keep shining! You are amazing. Also #whoisshe 🤷🏽‍♀️.", "miraeaiofficial": "This is so disgusting!!!! She doesn't know u!! She doesn't know of u!! It's not like u woke up y'day and became an expert. You put in work, you've gone to school for crying out loud. She was soooooo disrespectful D-list actress. Fuck outta here.", "artlifesunshine": "Her comment was so low. I’m glad you made this video in response to unpack why it was so dismissive and out of line. And that she was basically giving similar advice anyway. So she just felt like she had to shove you out of the way..why...to be petty? Ugh. Anyway you’re a class act and you know your shit and you use your knowledge, your experience, and your compassion to help others and to share stories and to empower others to own and enjoy their sexuality and inherent power in general. You’re a gem. Stay strong sister 💜💪🏽", "_erickadurant": "I’m so sorry you had to experience that and feel like that. Your presence is so intimidating to her, she was threatened and her only response, sadly, Wes to put you down. Keep pushing, keep working because you belong there!!! Don’t let naysayers and haters get to you! 👏🏽👏🏽👏🏽", "itscydneyrai": "That cute comment with the laugh after made me upset for you. That says everything about the type of person she is and the type of people in her circle. You are brilliant, a badass, and you had every right to be there. You fought to be where you are today and you did it with passion, grace, and an unapologeticness that most people only dream of having. Trust me, she cannot dim your shine! - P.S. I definitely agree with @velabeauty. There are so many ways to disagree with someone without feeling the need to tear them down. That was not one of them.", "bablately": "That was distasteful and brilliant flawed. You should not have to defend your credibility in the way that you did on video. If all she had to say was negativity she should have questioned you face to face and challenged you while you could defend and define your beliefs and studies. Your work and attributes are not invalid and your beauty is just accessory. Keep pushing because its obvious you are making waves", "lady_jadee": "That’s so out of order. And to call you cute. Your a grown woman. She’s clearly jealous.", "paulinaokieffe": "So sorry you had to go through that @shanboody You are this generations expert on this topic in my opinion. She and her opinion are irrelevant and she showed her true colors.", "leilita": "Disagreeing need never be disrespectful. Good on you for speaking up 👏", "sexualessentials": "So sorry you went through this it says more about her character that she used her time to secure the bag to tear you down", "littlemisskei": "Hopefully people saw right through her, because nobody starts with bringing someone down on television before they even start talking about their shit without looking sour. 🤷🏻‍♀️", "_theg1rlwiththeeyes": "it sounds like she is really conservative and does not necessarily want to accept all of the advice you provide or the way you chose to go about your own relationship. i follow you because i like many of your thoughts and ideas and how you articulate them. i don’t agree with every single thing you say but that doesn’t mean i don’t think you should be a valid source for relationship and sex advice. you definitely have a passion and do research and are far more open to work with people that are in a variety of relationships that may or may not be traditional. it’s fascinating to learn about how other people operate and the way they think and chase their happiness or express their thoughts on different topics. there would not be a place for those conversations if it wasn’t for your segments. i only see further success and recognition in your path. keep doing your thing! 💕🙌🏼", "mslovely_curves": "You went in on her😂😂😂😂 but handled it well💜💜💜", "zoeniete": "Shoutout to @youtube for giving us a platform where we can speak up and voice our feelings. Great video 💜", "halle_cherry_": "@shanboody Also let’s not forget... 👏🏽👏🏽👏🏽#GameOfDesire#ApplesBestBooksOfJuly", "rin_yin": "Another hater that goes to that long list of haters that can't appreciate a woman with talent and authority. Don't listen to her or anyone else on that matter who only serves hatred and bad vibes on a platter. Be the bigger and better person that you are. She just can't handle another woman of color who can do as much and way more than she can handle. Instead of being another woman who pushes another woman down, she needs to bring them up. Keep up with the good vibes 😘😁", "shesthebrunette": "That sucks. I don’t understand why people undermine others like that? She doesn’t even know you.", "jitsukawaa": "I don’t even know her. I’m not gonna year her down or anything but I’m sorry you’re hurt. I’m sorry she hurt you. You deserve to feel hurt because she was rude. I never comment on posts, but sis you’re iconic, your videos and advice as helped many and sis you’re doing your thing!! I don’t even know her, she is a non factor and you’re doing amazing. Thank you for all that you do!", "amethyst_point": "What a jealous hater! Ugh! She totally needs sex advice 🤣🤣", "gibbonshorton": "As always...very eloquent and professional. Love you!", "shonthelioness": "Dont worry babygirl everyone can see through her bullshit. She didn't take anything away from you, PERIODT!❤️", "tai_renee": "@shanboody No need to give one more thought to HER. Her opinion of you isn’t about YOU...it’s about HER. More women need to support and uplift each other. Don’t people know how DOPE WE ARE??!! Keep doing your thing because WE know WHO YOU ARE.....What’sHerFace can kick rocks. #Waiting4YaNextBookToDrop 😘😘", "misshypeme": "And it's because you're cute, which is the true reason why she's 🗣🎶 pressed, pressed, pressed, pressed, Shan don't need no press🤣...there will be people who don't agree with you, and be the tool Sarah is.🤣 She has no power in your life. Press on. You were invited, so obviously the show recognizes you and wanted YOUR expert take on the topic. Talmbout she wants an expert opinion from someone like Dr. Ruth😭 Bih, Dr. Ruth 246 fuqn years old! And the fact that she couldn't pull a more UP TO DATE sex expert (not sure of your professional title, no disrespect), out her ass proves that she's a hater. Folk love TRYING to minimize our accomplishments. Sarah, mind the business that pays you.", "pahpah_smurf": "I’m glad you are calling her out! I have no doubt that you’re strong enough to not let this comment attack your credibility. People NEED to be called out and told how their actions actually affect people! Words have meaning & power. These words didn’t give her the power to do anything but make herself look bad. Next time “hopefully” she’ll think twice before making a comment like that. I was trying hard to not to stoop to her level but—- 🤔Why she so stuck on Dr. Ruth? Is it bc she’s white or is it bc they ARE/LOOK the same age? #ohyesidid Keep glowing sis! That’s why social media exists.✨ We will continue to listen to your advice/tips & that broad can stay up at 1am for Ruth.", "taramoussavi": "The way you handled this was great, turning the negative comments into positivity in the full video. It’s disheartening seeing someone like Sarah who has played queer characters on TV shows say such things about yourself that is also breaking down barriers on other taboo topics. People of various intersections should be working together and uplifting others, not joking about their much needed work.", "denishaspeaks": "👏🏾👏🏾👏🏾👏🏾", "hyper_chick26": "Wow how disappointing to see a woman tryna bring down another one.. a fascinating one at that! Fuxk her keep doing n being what ur meant to! ❤️❤️❤️🙌🏼", "kueenk.og88": "Keep shining like the star you are. If she’s not here for you don’t worry theirs thousands and soon to be millions here for you and your content boo ! You know you’re doing something right if you have people trying to knock down at your success. Don’t even give them the satisfaction of letting them see you feel some type of way because that was their goal in the first place. Keep your head up Queen and let your work speak for it’s self. Theirs always going to be critics but you’ll always be met with love because of the authenticity that comes from your work. Love you and having an Amazing blessed Week. 💗", "dajungle_book": "I agree. She wasn't being professional at all... this was also on LIVE TELEVISION too??", "scoops1983": "❤️❤️", "terri2kool": "That’s a WORD! Going to watch the full video later today but you keep doing you, boo! You are amazing and such an inspiration. No flex when Aunty said “cute” I felt the disrespect! People with privilege tend to use those words in such derogatory ways and act like it’s nothing 😩", "tibbytx": "Why give her that power over you?", "pjamesmusic324": "Listen, I love @sarahshahi, wait....used to love her. I was disgusted and more importantly to me disappointed in her ENTIRE interview. I commented it was entirely classless and got blocked. Bravo to you for showing was TRUE CLASS really is. You now have a new fan.", "clarissajusdan": "Shannon, continue to believe in yourself and your accomplishments. I believe in you. You are smart, beautiful, and intelligent. That woman is trying to put you down to promote herself. How shameful and disgusting. You rock", "pariah2society": "We all know what this is🙄 u get so much hate man but gonna take the opportunity to say thank you for what you do! Keep standin up for yourself unapologetically Queen! 💚", "meta__phoric": "I now don’t like who ever she is", "missginadarling": "You are so classy. I woulda pulled up with some Vaseline and straight blades. You do you girl. Fuck what they say. You’re incredible. ❤️", "mindiabetes.dk": "F her. Get on with your fabulous self. You shine, her negativity does not.", "cornerboy_jon": "There will always be someone who wish they come up with a body of work like you did but didn't & doesn't have the mindset to. Jus keep doing what you're doing it was reason you was on the segment to begin wit. So dont let a nondoer affect what your doing!!💪🏾💪🏾", "mibeads": "You're amazing Shannon! I'm following you all the way from Chad and have nothing but awe and respect for your work and way of taking up space in a world that needs your medicine! 🔥🧡🙌", "brandonmbolton": "Forget Sarah I support you. Shan I knew you were a kind person ever since my sister was talking to you from my car at vidcon 6", "emteren": "Soooo... im buying your book... couse woman... you slay❣️❣️❣️", "dre____dre": "More doors will open... many more opportunities are about to arise. Keep your head up ...keep pushing through. She's entitled to her opinion..... its simply that...her opinion. Keep it moving sunshine you have so much more to see and do! 😘😘😘 muaaah! 👑💕", "penbadger": "Wow. She was so triggered. Turned into a whole entire child. On live TV. I’d be so embarrassed. That’s wild.", "wanjikukarugo.esq": "@sarahshahi there is a million ways to disagree with someone, but this was disrespectful, demeaning and just a disgrace. By trying to tear her down, you just looked ignorant and unintelligent. @shanboody thank you for showing her what the embodiment of grace is.", "martha__lucia": "Watched the full video & this reminds me of something I heard on @jayshetty podcast just yesterday when he interviewed Gary V. There’s always going to be people that wanna bring you down & criticise you. At the end of the day, you’re amazing & so many of us (your followers) love what you do & support the 💩 out of you! ❤️ Keep doing you! xx", "leanneriley_": "Girl I been following you for years, to me you were at the beginning of my YouTube years when you were doing hair tutorials and stuff. You been doing this! Don’t worry about her, just goes to show you’re getting closer to the top. What’s her instagram page too! 🔥", "breenaylaya": "I don't know you but I came here from Geos story. I'm all about women empowerment and that hurt me. I love what you do, everytime I see something about you I'm like damn ok girl. That's dope! I didn't know who that girl was but even her calling you cute was just weird and rude/fake..I absolutely couldnt stand to hear that twice. That being said I'm goin to watch the whole video on your channel and gurl I stand with you. You did not deserve this AT ALL! ❤️", "leeleemakibs": "@sarahshahi so disappointed in you. Disgusting", "pauleannareid": "@shanboody we love you and continue to stand with you. ❤️", "50shadesoflesswaste": "I'm very sorry to hear about this, but I am so glad you came back with this video. Hope she saw the full video, and thinks twice the next time she calls anyone cute... PS you are amazing. 💜 Your YouTube channel and Instagram have been inspirational for me.", "hajnaaal": "i don't even know who she is tbh 🤔", "simoneiwood": "Who is dr Ruth? Just go back and read my email to you titles “you are the best” because you are! You are smart, educated, funny and you make people feel comfortable talking about a topic that most people find uncomfortable. Love ya! X", "ifranciine": "By far my favorite video from you!!! 👌🏾I have so much respect for you!!", "xian8524": "They can't steal your shine! Its not just anyone that gets invited to speak as the SME on their specific expertise. Waste no more energy on it. Evict her from your mind, and live rent free in hers.", "leahgrantart": "I stay proud of you Shannon. You constantly fight for yourself and the things you love. I think it's great that you find a culture that many people can be apart of. You help us love all of us. Keep shining and sharing with us.❤️❤️❤️", "ingridnacole": "Nothing about you is diminished. It just shows the ignorance and negativity of the person that spoke against you. Be strong and be proud of your accomplishments.", "nolaconoces": "Girl, im so sorry!! You are amazing! We love you! She sounds like a hater. Fuck her.", "erin.r.haley": "Women should be lifting each other up not tearing each other down! So sorry you were made to feel like this- just know there’s so many more people out there who love and support you 💕", "michelleheyoka": "DISGUSTING. She tried to belittle you and embarrass you in front of everyone what a bully. You were AMAZING.", "graytheartist21": "Degrading anothers work sound like jealousy to me 👀", "dimplesz_56": "I mean i had no idea who she was so and still dont care to find out soo... who is really winning🤷🏾‍♀️", "king_riviere": "That laugh after what she said just piss me off. 💯..... Watching her reminds me of a dumb school bully who has nothing positive to contribute to the class but jokes.", "ct.love10": "You are amazing. She did not dull your shine. I hope that my hard work and efforts get me to your level of knowledge and wisdom some day 💪🏼 ❤️", "shayna_marie_j": "Boo! Why! so rude! You can disagree without being an ass!", "olivia_alicea": "Your full video 🔥🙌🏽🙏🏽 Handled that all like a beautiful beast", "lorelle.diane": "Instead of using her 15 minutes of fame to talk about healthy relationships, advocate for women’s issues, and be an alley to women of colour in Hollywood @sarahshahi talked about white washing her name and how she likes wearing a strap on...😑", "balancedles": "You handled this so so well. Keep on keeping on and walking in your purpose ❤️", "rfiona3": "Yes to that caption! I love what you do and many of us do, always ❤️", "hashtagmirandarene": "I hope she can learn from your elegance someday✨", "thelittlelotuspond": "I feel like she feels threatened by you perhaps?", "nickolette_reid": "She’s is upset that she will never , ever have your impact . Don’t worry about her at all @shanboody , jealously is fuel 👏🏾👏🏾. Thank her for HER time , she used to talk about you and move on . P.S -Lions don’t worry about Sheep 💗", "mrskaycudjoe": "Supporting you always!", "mrs_mccalister30": "You are wonderful, educated, and talented woman.", "keilahrose": "She’s upset mad af cuz you’re gorgeous. Not all therapist gotta look like wall paper - patty mayonnaise lookin ass", "wowmikaila": "It doesn't feel that serious to me but maybe I just don't understand", "aliciafranco16": "@sarahshahi this woman deserves a public apology", "days_sima": "You’re inspiring. I’ve never even heard of her", "nessa_thefinessaa": "Her behavior infuriated me and it didn’t even happen to ME! 😫🤬 I can only imagine what you must’ve felt watching that... wait till I find her IG it’s a wrap 👊🏽 jk... 👀 not really 😂", "iamxiandra": "She’s so cute was definitely SHADE. Your a grown woman! And when does it matter who gives the advice! As long as it is useful and you’ve done your research how can she discredit you like that !? 😒 ewww just distasteful 🤢", "intentgreat": "No worries shan she only increased your book sales in the long run.", "viann_v": "This is why you are an amazing role model👏👏👏👏👏👏👏👏", "thephilipmichael": "FUCK THAT RACIST BITCH! U da new Dr Ruth of our generation!!!! 💯🙌🏾👑❤️", "olesyafedulova": "Don’t worry ❤️ you rock !!)) and she might be jealous 😂😂", "ilovelloydia": "You're amazing! Keep doing everything you've been doing!!!", "latericerule": "Im just seeing this. Whats her @ ?", "fatmandkc": "Wow that may be very disrespectful honestly kind of truly people may have their own opinions which is nice but when it comes from love and sex advice no matter how old you get you really need to know your stuff but her putting you down like that is pretty fucked up", "natali.nicole": "Wow. That was disgusting to watch. I’m so sorry you had to experience that. Keep doing you!", "lorena0926perez": "Well said!", "itsgabbytee": "QUEEN!!! You have spoken at an empowering level and have shown how powerful educating yourself can be! Thank you for being the bad ass babe you are! ♥️", "heliaxo": "What’s the woman’s Instagram handle ? I’m tryna see somethin 👀💪🏾", "ve7us": "Fuck. Her. Periodt. But you already know.", "zojanelle": "I went and watched the other person’s segment out of curiosity and to be honest, I think this is case of one person not having the best execution of their thoughts and so it came off as dismissive at best. She is however allowed to disagree, however how she did it may not have been the best method. In addition her preference to want take advice from another expert is in no way a jab at you. It simply means Dr.Ruth may offer her something(maybe as an older woman) that is more appealing to her than you and that’s perfectly fine. Just my two cents ✌🏾", "dar_ling_nikki": "She’s a A$$hole @sarahshahi", "simple_curls": "You are an amazing woman!!!! You are intelligent, wise and outstanding! Your videos are incredible to watch and your words are uplifting. Being a woman who had three strokes it’s hard to become intimate and confident but your help is making me grow and becoming myself as a person! I thank you for your youtube and IG! I thank you for teaching me and others also hearing from other women is beyond amazing @shanboody your work is phenomenal", "blissandfaith": "Saw your video on YouTube earlier and let me just say that you handled this situation with such class and grace, something that Ms. Shahi clearly lacks. Her behavior was a clear example of hateration and she should be unequivocally ashamed of herself.", "gina_baby__": "This hits home bc as a black women no matter what field you are in at some point in your career you will experience this from another woman who will 9/10 be white and older. Not a bright moment on the behalf of @sarahshahi. Very disappointing. But you handled the shade great. Hate just let’s you know your doing something right.", "androgynine": "The Ageism she displayed is disgusting and down right unprofessional", "rebelmommahealth": "🙌🙌🙌👏👏👏", "mizztaj": "And this Sarah is supposedly a woman of colour? What a joke. 🤬😒", "buf_ufwallal": "@shanboody i just saw this. I think you are really awesome especially after seeing this video.❤️❤️❤️❤️", "unicorn.from.utah": "What is so sad to me... is that Sarah... does not KNOW the lives you have touched with your work. You made sex comprehensible for me. Your YouTube channel alone has helped me get to a place of actually coming out and living my truth.... How unfortunate that some one felt the need to try and break your work and character down like that because why??? She could have introduced herself and “disagreed” with you in person. I just don’t understand... However I am grateful for your existence in the world and the work you do.", "danowensmgmt": "Wow. What a waste. She embarrassed herself.", "lisa_mmango": "Jealousy is an illness, truly! I feel that’s it’s fairly common for people to THINK that insulting someone else, makes them look better. I’ve seen it too often 🤦🏻‍♀️ We gotta remind these people... there’s NO competition between us. They’re competing in a pee wee league and we’re competing in the olympics ❤️ we can both win, but we still won’t hold the same position! You’re winning mama, people will continue to come for you.", "whoistrudychristina": "How insecure of her..🙄 Hurt people hurt people. It seems like Sarah needs to do some self evaluations. Shan “You belong here”, and nobody can tell you otherwise.", "sashakay33": "I hear you @shanboody and I hope @sarahshahi does too, and reaches out, watches your video and cracks jokes at her own expense!!", "devikadi": "Don’t be offended girl people will always be haters. She just put the spot light on your book", "briepugh": "Clear example of someone living in SCARCITY MINDSET!!!! There is enough space for all of us. Hello abundant universe 🙄🙄🙄", "kelliana.wilder": "@shanboody they talking you doing something right. This is more a victory than anything. Press forward.", "therealkeshmoney": "The haters are threatened girl!!! Keep pushing!!! 🔥", "ariellesilvanyc": "And she was wearing an ugly sweater:/.", "dawn.of.a.new.day33": "@sarahshahi Please take time to watch and learn. You discrediting someone because she is soooo cute is ridiculous. Watch your words, how you say things and the energy you put out into the world. ✌🏽", "cio0_": "You are a strong educated woman with many credentials. Obviously @sarahshahi not even close to being professional. I feel sorry for her. But you keep moving forward with your head up as you’ve always done 💕💕", "_kamoraa": "Keep shinning your light Queen💖", "babisanoja": "You 👏🏽 shut 👏🏽 her 👏🏽 up 👏🏽with 👏🏽 class👏🏽 🔥✨", "iamniko__": "Don’t worry Shan! I went to her page and SPAMMED THE HELL OUT OF IT! We love you—I love you. You taught me various things that I continuously carry and think about on a daily. Please don’t stop & HELL YES YOU ARE WORTH IT! You need no validation from us, but we will lift you up anyways!", "blastedinkmorgan": "You have so many people cheering you on and love watching you stand in your truth, knowledge, and knowing. Keep doing what you do, cause we are here cheering you and and believe in you!!", "dstisme": "The way you addressed this was so mature. She had to be hella insecure to use HER time trying to take the light off of YOU. Keep doing you!", "myplantfolio": "why can’t we have differing options anymore am i missing something? it’s ok to disagree!", "namshine": "You are a queen and I’m so sorry she hurt you. She told on herself though. If you need to speak ill of someone else to make yourself feel better, you show who you really are. Onward and upwards sis. We got you ❤️❤️", "lovelygeb": "GO OFFFFF!", "mariatumanyanx": "There is enough space in the world for women to be successful in their own right without feeling the needs to tear each other down. What she did was cruel and distasteful. You handled it beautifully. You’re so incredibly wise and you worked hard for the knowledge you possess. I am so excited to read your book ❤️.", "laticia.rolle": "SHINE ON BEAUTIFUL QUEEN. 🕊", "houssosemon": "who is she? 🤷🏾‍♀️ YOU are amazing!", "_angelineromana_": "your work speaks for itself", "mskassandraj": "I remember your video where you reviewed the book Judge This Cover and you talk about how some people respond to different intimacy educators depending on their needs/desires. You can disagree with the delivery without demeaning the messenger. You have been so influencial in the way I view sex and relationships as well as the way you always handle the haters with class and empathy. There's no other woman I would rather seek advice and information from and I can't wait to get your book in my mailbox! Keep your head up, Queen 👑", "lovet.marie": "Shan, for somebody that I've followed for a longgggggg as time and that I've questioned myself on who I am and what I accept in my life in any aspect bc of you challenging what I might accept and disagree on I swear that you have helped me build on who I am as a person and who I am as a partner. You do NOT deserve this. You have been a voice of reason on topics that I may have been on the fence about and made me more comfortable in myself that I can be a better partner for my man. You are doing that damn thing and don't deserve for your spotlight to be dimmed in any way no matter who has an opinion on what! Tbh you have made me reevaluate on how to be a better me. If I was single or not! Keep doing what you do bc you help a lot of people find themselves. You can't deny that! Your supporters will always stand behind you no matter the platform you are on!", "violetcity24": "Damn Carmen ... Why? 😧", "kandikanec": "👏👏 Go girl! Sarah, who?", "morgantreks": "👀 stoooooop. Why? Girl.", "jadarashawn": "You bodied her in the most classiest, educated and articulated way!! This is why I love you! When they go low. We go high! 🙌🏽🙌🏽🙌🏽", "keldaroe": "I'm so tired of white women using the language of expertise and credentials to mask their racism. Lordt. Tearing you down didn't put food in her mouth. Ugh.", "uriel_ram121": "Ever since the slumber party. I’ve been a subscriber and supporter of you. And I’ve always loved and watched your content. And helped feel comfortable and open about my sexuality. So I would definitely recommend you to anyone that needs advice. Or to watch your videos.", "jennifermjoseph": "This is absolutely disappointing...how dare she? You know what’s not cute? Her bangs. Fuck her, you’ve handled this soooo well. Smh 👏🏽", "lalaperrera": "@stepram09", "shauntaerose": "Sooo she thinks discrediting you makes her feel better about herself🙄 it's a shame that happened. Keep doing you though!", "teana_pyt": "It hurts my heart that women continue to attack each other especially in the current climate where we are already under attack. Absolutely no reason for her attack on your words when 1. Miss lady already had her seat at the table and 2. You both said exactly the same thing. Clearly she is sad. Don't stop what you do because we can see the bullshit a mile away when people behave this way. Never let anyone question why you deserve to be in the places you are when a quick search on Google would clear those questions right up (your name and website do come up on Google girl). You've done your due diligence before you opened your mouth on that stage and weather or not she choose to believe this is entirely up to her. You didn't get this far on bullshit love. 💕", "uniquemarieholmes": "We have your back boo!", "rymagillacutty": "I watched the whole video that was posted on YouTube..Shan you rock, your phenomenal, a true role model and you really laid this video out well!! Thanks for being you always and for sharing this experience with us all! Props to you always boo, keep reaching for the stars! You give me lots of motivation! Congrats on getting into school YET AGAIN, You'll kill it!!", "shatona_a": "Watched the full video & it’s funny you two ended up having the same point. Sad. Oh well you are amazing & I watch every video❤️ congratulations on going back to school 🔥", "lannamarievanessa": "Im so sorry!! Shes gross!", "starring_princessthickums": "I just finish watching AND I would like to say I learned a lot about you. And maybe one day I can work for you.", "lukecharleshammer": "Go off!!!!!", "miss_king_kong": "I don’t even know her but I’m not gonna watch anything she’s in!!!!", "delssysantos": "@sarahshahi", "tittay_t": "@sarahshahi xx you’re welcome", "charliecoopertv": "Your youtube clap back is perfection. You were there because you EARNED the right to be there and thankfully no one can take that from you! Yes, \"she's cute,\" but she's also MANY other things- including brilliant!❤️", "kathleennb": "Yoooo this has me RAGING sis. This woman’s coded language. The caucacity! You are incredible. The support in these comments say everything anyone needs to know about you. 👏🏾👏🏾👏🏾", "iamvictoriaanne": "So she one of those \"let me ride someone else's fame to get attention\" types 🤡🤡🤡", "rodriguezmelannie": "It's ok! unfortunately you are going to encounter these type of people on your way up. Don't let that ruin your day or your moment, I've been following you for a very long time and I would take advice from you. Some people forget that whatever energy you put out that same energy will come back to you. More blessings to you 😍😍😍😍", "amy_rook_": "Keep doing you Shan! You are rocking it! ❤️", "miesharenea": "Allow me to begin with the deepest apologize possible. You are excellent and in way you do. I have gained much knowledge about myself listening to and reading YOUR WORK. You have established your position and it’s intimidating when any woman of any hue other than white is making her mark in the industry. Regardless of how anyone tries to spin her buffoonery, it’s based on what is first seen to her, your skin. Her comment stating you were “cute” said it all for me. It’s often utilized to mask he ugly truth that bothers them first. When you have unexpected competition (that never was nor is in competition with you) and top it off she is melaninated (made it up lol) it actually scares them. In return, their defense mode kicks in and all the have is their opinions that hold zero merit. Your response shows your class, internal beauty, and so much more. Although you have been hurt, turn that pain into motivation. Let her ignorance be a reminder of why you excel. Love and blessings 🙏🏾❤️😘", "iconicchange": "You know you're doing it right when people hate you for being you. You're amazing and an inspiration to so many women, keep being your amazing self and never dim your flame for anyone 🔥💖", "oliviapopeee": "A Queen 👸🏽 🙌🏾🙌🏾🙌🏾🙌🏾", "hungry4life": "This video was amazing and what a smooth and classy way to handle yourself and standup for yourself", "thewowyana": "She sounds jealous of you! Hmph 😤 so typical 🙄🙄🙄", "marimars.art": "So thankful for your grace 🧡", "lanita11": "I watched the whole thing and it’s mind boggling how another woman tries to down play and belittle another woman. You are AMAZING!!!! Never forget that!!! And if you ever do... we are here to remind you that you are AWESOME and an advocate for all of us! 💕", "lindseysimcik\nVerified": "Verified", "theholisticbohemian": "My condolences in your time of grief, Shannon. I sand in full support of you 🖤✊🏾✖️. What that woman did was so DISAPPOINTING + DISGUSTING + DISGRACEFUL.", "dutchess_southern_blessed": "Dr Ruth is cool and all but I think you make things a lot more understandable to people in this time. Since I start following you I found out a lot about my self and the type or types of partner I want. As well as embracing my sexuality as a individual not what society wants me to be", "ilincaah": "Shan you are AMAZING .You are literally mindblowing to me (in the best way possible) .I’m 22 .Insecure af.And I’m looking at you hoping some day i Could be at least 1/10 of what you are .Confident,strong,hardworking,passionate,charming SUPER WOMAN.You are GOALS to me", "wanderer_lifeisajourney": "Fuck that bitch....periodTTT. SHE MAD CUZ SHE IS NOT YOU. DONT GIVE HER ANOTHER MIN OF ATTENTION. KEEP MOVING", "intvlt": "Yas girl you have worked hard to get here omg I've been a fan since 4 or so yrs ago 😍 I've seen you pushing girl 🙌🌷", "kkid2781": "I love your work, Shan!! Keep doing u and it will continue to speak for itself! 😊👏🏾💜", "taylormayde1323": "@shanboody Don't worry about it, there's always one that has to disagree. Keep doing what you're doing because you're the new voice of this generation and don't forget that.", "arleneeeem": "Pre-ordered your book on amazon just now! Haters shall not prosper!!!!", "ryanriddick88_": "So Carmen from the L word, got you messed up?? She doesn’t need to disrespect you and your accomplishments. I’m sorry sis", "sexologistshamyra": "But why!? She is trash for this.", "professorpeach2121": "@sarahshahi how disrespectful.", "aye.alexandria": "She just mad boo! She wanna be you 💖", "kaylinsmithdotcom": "I watched the full video. Handled with such grace and class. Keep breaking barriers and being an inspiration! You are an incredible woman! 💗👑", "sarairollins": "You make vulnerability & hurt look so strong 🙌🏼🙏🏼", "kikicarlstrom": "Anyone who has been a viewer of your work for some time KNOWS your credibility. I’ll have to watch this entire video to see the full story. How sad, especially as a woman to bring another woman down for no reason at all. Keep doing you and working as hard as you do Shan! You’re loved by many including me! You’ve inspired me in many ways as I continue the process of becoming a counselor 💕", "prettyyvegan": "You’re classy Shan and people like her don’t understand that everybody is different wether it be turn ons, love language, and style or understanding. We understand you’ve worked very hard and you are enough and you are VALID 💕", "katreinamarie": "Watched the YouTube segment and am buying your book because of how you handled this. You’re fucking dope and an inspiration mama @shanboody", "manylivesmanyclairs": "@shanboody I totally understand how you feel and why you are so hurt. I truly do, but I feel like you are giving this person way too much power over you. She is not part of your tribe. She is not part of why you do what you do. If you look thru your comments, many of your supporters don’t even know who she is! She is irrelevant. This is one moment in time that will pass. It doesn’t change who you are, it’s doesn’t eliminate all the work you’ve done and it’s not going to prevent you from succeeding. I’m sure this feels like a personal attack because you are so passionate about what you do but please don’t allow this to take up anymore space in your heart and mind than it needs to!! You are AMAZING, keep doing what you’re doing!", "roshanjihan": "You rock. All grace 💕", "dandrea.williams": "You’re giving her too much credit doll, she didn’t tear down anything you’ve done, accomplished, or built. You have your own audience/following and nothing she could say or do could make any of us value your opinion or your advice any less. 😘😘😘", "_naija.goddess_": "Buuuuuuttttt who even IS she Sis???? Like.... Nobody checking for her. That's probably why she's mad. You ARE cute.....AND knowledgeable, AND an author, AND in a loving happy marriage, AND an expert in your field, AND a powerful voice in multiple communities, AND the voice of reason for many of your followers, AND in your bag, I mean I could go on and on and on! Hatin Ass Heather needs to stfu. Ugh... #Lame", "sammi_bootz": "Damn that sucks cuz I follow her and love her on the L word and love her husband but forget they’re actors and you really will never know the real them until u see some shit like this 🙄 shake my head ! @shanboody baby stay true , stay humble and slay on these duds you will never grow as a human being by dimming someone else’s light so hot diggidy dog thank you!. You are an inspiration like @amberscloset says and a reminder of what self love is constantly! Thank you❤️", "gilly": "I’m sorry this happened. She is beneath you. Definitely not watching her new show.", "lovedanialexa": "WHY TRY TO BRING SOMEONE DOWN TO MAKE YOURSELF LOOK GOOD.. THAT WAS SO TASTELESS 🙄 SO SICK OF WOMEN DOING THIS... AND HAD THE NERVE TO SAY DAMN NEAR THE SAME THING BUT REWORD IT😂😂", "mcapril": "@sarahshahi wow! What a way to display your grace! Never would’ve thought a women who was seemingly so charming functioned at such a low vibration. Damn! How disgusting! Do better!", "bleumoonxo": "You articulated your thoughts and feelings so well while being so belittled! This video is a masterpiece and can teach EVERYONE something. You are fantastic. 🔥", "misty.maria.bonita": "@sarahshahi jealousy is a really ugly look on you.. if you’ve gotta tear another woman down and resort her to her looks by refers g to her as “so cute” while you attempt to discredit her in an attempt to make yourself look better.. you ain’t shxt sis 😒", "erynt_lewis": "@sarahshahi", "itsjosheats": "The way you handled it though!! Always impressed with you Shannon!!! 💗💗💗", "dannahshillingford": "You are amazing!!! The fact that she took the time to say those things shows that she is threatened by the space you’ve earned with your expertise and continue to take up. Stand tall. Your advice and perspective is everything ❤️", "1908foodie4lyfe": "Wow! Sounds like a good debate. In today’s society I’m not looking at Dr Ruth to give me relationship or sex advice. I appreciate you. I think if she didn’t agree with you, then she should of said that & kept it pushing. Don’t come for your neck, but not to your face... as if the two of you weren’t on the same set @ the same time. “When they go low....” MO. Keep doing ya thing! 🙌🏽", "_domonant_": "She will age badly for talking shit", "azaleazoe": "Always stand strong 🙌🏽🙏🏽✨💗 Bout ”cute” Steupse", "thesaferbeautyactivist": "Perfect, gracious, honest, and impactful response 💜", "k.jenellelynn": "@sarahshahi", "kingkristinaaa": "“When they go low, we go high” 👏🏾 I love you Shanboody 💕", "spokenbynneka": "@sarahshahi", "sharanichole1": "Cute? Intimidated much. she tried it! Love ya Shan🖤", "noraeee_": "And thats on period", "tianajovana": "This was a classy and on point response to the unnecessary shade she threw. Her decision to try to diminish you says far more about her than it does about you. It takes a special kind of person to call someone out in a way that still allows them to take the high road, and you did that. I hope anyone who thinks about trying to cut you down thinks twice. You have earned your position at the table and kudos to you for making it clear that you belong in whatever space you fill.", "nishaluvscoffee": "She really tried to make you look bad. She's a 🤡! The hell with that noise! You have so much going on! Can't wait to dig into your book when it arrives on the 23rd! Congrats on your book and what you have going on in the near future! ❤️", "haleybooxo": "Girl. Shame on her. You have so many people who look up to you and appreciate you. I’m really sorry that that happened to you.", "tatiyanaselam": "Well done!!!!!! Well said, you are amazing and have rightfully earned your spot to be in that chair. Love this 👩🏽‍🎓", "park.ave.thewineguru": "Wow that’s the chick from the L Word", "rgalluzzo414": "@sarahshahi shame", "breejustbree": "Absolutely DISGUSTING especially coming from another woman!!!!", "savvy_6": "@shanboody she honestly sounds ignorant and this makes me so sad because I truly love her as an actress but this right here..... not okay. Women supporting women is what the future is all about. Not this pettiness. You deserve all that you have and nothing and no one should diminish that. You go girl, you continue to spread your knowledge. Let her sit there and look like the jealous and petty woman she is.", "moodiemommy0813": "You are absolutely amazing!!!! I look forward to your posts every day! To be able to see your \"cute face\" not only talk about something I wish more people would talk about, but to see a woman who looks like me on TV being open and honest about something she worked her tail off for inspires me so much. Keep doing what you do @shanboody and congrats on going back to school! You are an inspiration ❤️✊🏾🙌🏾🎉💯", "lilsooz2882": "Guck this bish! You are qween.", "reemalhajri.design": "♥️♥️♥️", "renewedmission": "The fact that @accessonline allowed that is despicable, but am I surprised ... NOPE", "smokingxroses": "She’s a fucking hater! Ew..", "nocheeseplz": "She’s so cute. Her jealousy is showing. Meanwhile she’s twice your age, uneducated, AAAND wait who is this? EXACTLY.", "renasmama": "AND THATS JUST THAT ON THAT. PERIODTTTTTTTTTT", "the.echeloncode": "The way you checked her, empowered me !!!!! Love love love this !!!", "water_willowminnow": "🙏💕💕💕 Fuck them. Keep flying bby girl", "allthingsvikki": "My first reaction is 👀😮😏. Next was WHAT?! Sigh....you are right. Call her out! Maaaaan that burns me up. Who is she? Right #DontKnowHer", "nootherkindrell": "Well said & intelligently put 🙌🏾 👏🏾", "mokisses143": "She pretty much said I’d rather take my advise from a white person. Don’t mean to make it a racial thing but fuk her!!! Ugh. Jealousy man. Gotta expect that on your way up. Smfh. AND to top it all off she’s another female ! Excuse my French again but #FUKher 🤷🏾‍♀️", "dearraleann": "She had nothing relevant to say about herself", "waddup_cass": "@rootedresistance watch the full video. She read this girl in the best way possible 👌🏾", "elifselincila": "No one knows who she is- dont even give her the publicity. Neeext", "sbd_xx": "Sooo because you dont look like who SHE would get relationship advice from, that means that YOU are not valid to be in that space?! In what world does that make sense?! Please know that people treat others the same way they treat themselves. What she said really wasn’t about you, it was about her own perceptions and lack of understanding. Keep shining queen, your perspective is valuable and needed!", "sexpositive_families": "She was so clearly threatened by you and obviously didn’t come prepared to speak from a place of her own ideas and expertise. And as a white appearing person putting down the work of a woman of color, she used her power in the worst way. She has three children? Definitely not a shining moment for her if she desires to be a role model to her kids. I’m so glad you spoke up and called this out. The labor we do as a result of this kind of behavior is exhausting. Sending you nothing but love and respect. 🙏🏾💜", "curlykinkyfroquay": "Well said, @shanboody 👏🏾👏🏾👏🏾👏🏾", "stevenm.5": "She's not important! The people that love you are. Keep doing you @shanboody just remember, you are independent of the good or bad opinions of others. Whatever she has to say about your expertise is none of your business. Just let her live in her little corner and hate while all of us enjoy your content and show love. You always have our support. You are where you are for a reason and your platform is helping lots of people daily. Keep doing you 👍", "phoenix.rising.flower": "Wow at @sarahshahi women’s empowerment and degradation all in one package. People have a right to their opinion but don’t say God bless right after insulting someone based on your preference about a job you have no expertise in💁🏾", "bella_galore11": "I’m disgusted this woman had a platform to speak on whatever reason as to why she was invited to the show but took that as an opportunity to talk about and discredit your hard work. You are not small! You are bigger then she will ever be. I don’t know her. I know you and the amazing creative yet informative videos you have shared with the world. She can’t stop what the universe and the man up stairs have in store for you. You ain’t cute honey... your fierce", "gotta_befearless": "See the old me.... woulda been down to dog walk some folks.... but I no longer beat up hurt intimidated people.... cause that's all she is. ................... so imma just prove her wrong by continuously supporting the amazing things you produce. ................................... unless you still wanna take her for a walk them DM me.", "drjacqhay": "She’s the epitome of hate. Keep shining, pushing, and thriving. She doesn’t want anyone that that looks like you to have a seat at the table. But you’re already there sis, that deserves a “little laugh.” 👏🏾👏🏾👏🏾", "mafayyz": "I'm so sorry this happened to you. And fuck her. She has some fkn nerve", "samanthastew99": "The she’s so cute comment was condescending and disrespectful.", "fromlowithluv": "Such a classy response. Whatever she thinks about you has nothing to do with you. Please keep pushing through. I’m so sorry this happened to you.", "muva.jeaux": "You are fricken amazing 💋💋", "lucyteamarie": "There’s a special circle of hell reserved for women like that.", "secwepemcsage": "You are amazing and it shows 💕", "corinnelson": "Omg I am so upset. What an asshole. I love and support u 🙌❤️👏🙋🏻‍♀️😘", "thatg23": "Ive learned alot from you. Continue being the brillant, educated professional you are. Im upset that the Black co host didn't shut her down . Ive never seen a shows panelist bash the previous speaker. Continue being great. We appreciate you.", "kylielovsey": "Unacceptable way for another not only woman but an Iranian woman to speak about you Shan. I'm sick. @sarahshahi", "mariafernandaa_98": "White women always lookin to degrade you", "anguswhinfield": "You are Strong Beautiful Guyanese woman! Never forget it. She expressed her ignorance in her statement. Dr. Ruth’s fame was initially rooted in how she looked. It was a shocker to see a Grandmother giving sex advice.", "cashiesh": "Fukdatho", "benihanababe": "This reminded me of when white men call black men boys to “put them in their place “ discredit them and shit. This cute girl got degrees talkin bout “why would i want to get advice-“ listen...all that air time she should have been introducing herself bc i never seen her in my life. What book is she promoting and why would i read it? How is she a expert? She probably thought she was being quirky fun and funny just plan fucking rude and especially bold for someone in the room.", "jalesatucker": "Thank @shanboody for all that you do to illuminate everyone (myself included) about this topic 👌🏾. You’re amazing and we’re all rooting for you.", "pynk_matters": "If she was confident in her advice she wouldn’t have to mention anything negative about you! I’ve grown to know when people are intimidated they do/say the most foolish things. 🙄 Your success is amazing... keep shining ✨", "baddieglow_": "Wow 😮 she’s a bitch ! Well you know they say the devil don’t attack if it’s nothing that’s worthy to ! So it’s about to get better .", "aminamarie": "Just watched this whole video and YES SHAN!!! You are so incredible and I love how you handled this situation. Please don’t let these projections get to you ❤️❤️ Thanks for sharing your voice and inspiring us!", "derrexbrady": "We love you and you are a light that continues to soar. Bravo to you for standing up for yourself while encouraging others as well. 😊💛💫", "kayann_ward": "And you have every right to how you feel. Continue doing what you do..her action is a sign and very big sign that you are doing good work..the closer you get and the bigger you get..you will get more and more of that type of reaction from insecure people. I pray she finds peace in her world of pittiness and I’m looking forward to seeing continuing to share your gift.", "_raisly_": "👌❤️👏", "carongaby": "Talk about a women who wants to put others down rather than lifting them up. She should be ashamed of herself. You know you're amazing and have your place in this space. 🔥🔥🔥", "melaboricua": "You threatened something inside her. Why? Cause you’re well spoken, clearly know what you’re talking about AND sexy af lol . Living in a patriarchal society has really conditioned us to think that there can ONLY be one, esp when it comes to anything related to women. Here’s where you’re great. You use your platform to uplift women everyday, and not just any women but also marginalized women. You show us your flaws and how you’ve gotten better at them, and I’ve never seen you knock someone down to get to where you are. Anyway, I don’t want to dismiss how she made you feel at all. I’m sorry you had to experience.", "tymbeauty": "We need John Wick", "demandaxo": "I want to call her some not very nice things but I'll just say this, not a single one of my friends follows her so she obviously ain't shit. Lol She clearly is putting her insecurities on you. Keep pushing, Shan. She gon eat those words.", "k4clife": "I will take sex advice ANY day from you. ❤️", "ssaammii_f": "🔥🔥🔥YES SHAN💞 WE GOT YOUR BACK", "michellegce": "Terrible thing for someone to do, I’m so sorry - You didn’t deserve that! You have worked so hard hun! I have followed your rise over the past 10yrs since we worked together and I smile when I catch you on TV and see your posts! I know how hard you’ve worked and I’m so proud of you! Good for you sticking up for yourself but don’t let her affect you! You help so many people, I personally can’t wait for my copy of your book, I ordered it! Your doing great sweetie ❤️", "rosen_decluttercoach": "Wow! How unprofessional of her. Her envy is a dark dark green that is unfortunate to see in 2019. She basically patted you on your head with \"she's cute tho\". She is exactly what's wrong with psuedo-feminist. There was no female empowerment, no sisterhood, no leaning-in. She was a complete mean girl. She showed her weakness. She could have simply said she disagreed with you without the venom. Women like her want to call out men on their bad behaviour, but actually they are worse. At least now you know that your confidence and increasing profile threatens her. She took a cheap shot. Don't let this stump shake your leaves🌳 Shan. We 💛U.", "le_jen_": "Disagreeing with someone is one thing, but undermining someone's intelligence is another. Woman like her keep others from accessing this type of space. You came about this in the most graceful and respectful way. Thank you for sharing ♥️♥️", "laango": "Such a classy response!", "dianamarceil": "FUCKING DISGUSTING 🤮🤮🤮🤮 hope her career falls to shambles typical JEALOUS little colonizer 🤮 \"cute\" what a filthy oppressor smdh", "iamnancyjay": "She na av sense, nuh tek on bad mind 😘🇬🇾🇬🇾", "issatrae": "CARMEN 😭😭😭", "auracrystal": "I saw the whole video. Really, truly a reflection of her own inadequacies and projecting feelings of jealousy. You’re a hard person to follow, so instead of lifting you up, she tried to bring you down to try and lift her own insecurities off the floor. I don’t know her, but actions speak louder that words and it was written all over her body language. Keep doing you...", "k.arche": "She repeated what you said but in a dumbed down version. I’m so sick of these others. Next thing you know she going to crying through an apology. 🙄🙄 Keep doing you sis.", "ndijeru": "Don’t let that dim your light! No one has power or authority over you except God. He made you and is the only one that can break you. We love you Shan keep rising!", "annhmcbride": "She was jealous and she was jealous in a way that left her unable to do anything other than discredit you. She was raised to believe that being a white and educated and passably attractive was the top level of superiority and THEN she has to be confronted with the reality that ALL that was a lie. You are a intelligent, gracious, kind, beautiful, powerful, sexy, and purposefully driven human and she JUST COULD NOT HANDLE IT. So feel hurt because that’s where you are right now but know that she can’t nor never will have what you have. We see YOU. Keep on being brilliant and see threw the bullshit because that is all they have to throw. Be well sweetie xx 😘", "makfatty": "Your bomb Shannon and we appreciate the work you do! Keep on keeping on!", "brittylovenotes": "SHAN DO YOUR THING! You are 🔥.", "isonhill": "Keep doing you! She can't block your shine.", "etta_aquarids": "Anna oop", "heysounloving": "you triggered her. dont worry, your people know whats really up. she's too occupied in her small world. love you!", "irene.okwuosa": "This weighed so heavily on my heart. Sarah shahi. Once relevant, now irrelevant. I used to be a fan but no more. To hurt another human being, to hurt another woman, when we're at a time in our lives, where we're trying to encourage and help one another grow and evolve. Shame on you. Practically saying the same things Shannon said. Ms. Shannon. You are a blessing. A goddess sent to help us grow, accept and love ourselves. May you continue to grow and succeed. And allow this unfortunate situation to allow you to attain the notoriety that you are truly deserving of. I am a fan and forever will be of yours. May God bless you, keep you and continue to shine His light upon you.", "poetry_face": "Wow !!! This is ignorance to the highest levels.. what’s even more antagonizing is that shes a woman !! What the fuck !!!", "lindseyslifenstyle": "I’m so sorry that happened to you! She was wrong in so many ways. She’s a mama and a woman! She should be uplifting other women. :(", "emilythefreakinrican": "I’m sure my comment would get lost among the masses, but I listen to you on ologies and I was completely blown away by how intelligent and well spoken you are. After listening to that episode, I started following you on Instagram and saw that you have a book coming out. I cannot wait until your book comes out and I currently have it on my wish list on Audible. Women should be supporting women and I hate this Woman chose to be little and degrade another woman. It’s such a shame. You’re doing amazing and you are completely inspiring to me and I’m sure many many many others. Keep doing what you do girl!!!!", "trulymarleero": "What’s HER @!??? I just wanna see something @shanboody 👀👀", "smithgina7": "Fuck them!!!! Don’t let them take your positivity and your good vibes. That ass hole and that show are NOTHING!!!!! Nada!!! Zero..... zip.... zilch!!!!! Keep your head up as you know their industry will always stab you somehow..... ❤️❤️❤️❤️❤️❤️❤️", "milanpyramid": "We love you and we are so proud of you❤️", "samkayjay": "Your response was INCREDIBLE. I aspire to be even half as graceful, generous, kind, and (deservedly) self-assured in response to that kind of dismissal and belittling as you were (honestly I probably wouldn’t be I’m petty AF)", "lamariposamorena": "She obviously feels threatened by your talented, fabulous, beautiful self, and would feel more comfortable with Biblical Pussÿ telling her what they did back in BC. Füçk her.", "imrachaellea": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "millelikemillie": "I seen this and wanted to jump through the tv because she literally contradicted everything you said just to say everything you said but “with her twist on it”.... Idc what anyone says if I’m getting sex advice from somebody who has a degree or my Grandma I’m listening period... I enjoyed your segment keep doing what you’re doing. I look forward to buying your book.", "meaganksmith": "Keep shining on em sis!!!!!", "forever_bodacious": "I LOVE repeated stabs of kindness. A ROLE MODEL", "nessqwickk": "💓", "courtmoves": "Shan, you fucking queen! 👸🏽👑 *taking notes* as should she 👀", "jeyy_hdz": "I’ve been watching you for years ! I loooove everything you’ve done & am a HUGE fan of your work. I don’t know you personally but have been able to see you grow & grow along with you. A lot of your videos & content have helped me in my personal life to grow & know what what i want for myself and where I want to be in the future. Don’t let this 1 person get you down beautiful 🌺 There’s a ton of us rooting for you in the sidelines ! Never commented before , but couldn’t stand watching this withought being able to let you know how truly greatful i am for all of your hard work & everything that you’ve put out into the world that I’ve been able to hold so dearly and make my own. Thank you for what you do 👏🏼 & thank you for who you are 👏🏼 Keep going ! 💕", "iamtwuan": "Forget that chick", "mr.goofster": "what a bitch fuck her and what ever she doin in life.", "ms.shanelleh": "Smh how dare they!! You are amazing @shanboody", "megginmoves": "Go Shan! Best comeback video I’ve seen because you did not tear the other person down you simply stated the facts!!! 😍", "cc_the_coins": "BITCHES.BE.HATING..", "theamandanicholson": "That sucks that happened to you! Keep doing your thing!!! ❤️", "krishanajk": "This is so disgusting so glad you spoke out about it !", "davidsocomedy\nVerified": "Verified", "talya.macedo": "Disappointing attempt to infantilize and diminish you. I feel like I went back in time watching this. I long for the day that success isn’t met with projections like this. ANYWAYS...let the preorders, views, book deals, talk show features and other impactful and necessary opportunities roll in. You are THE ONE Shan. 💙✨", "lovelynema": "Honey you are a woman of color, and always under attack. With that said they don’t know who they’re messing with. I love all that you stand for and more. You have educated me in a number of ways on numerous topics that I had no idea about so you are doing your job. She used you for a reason because she understands how powerful you are. Keep doing you #byebecky ❤️", "idea_chic": "Keep doing you girlie, She's just HATING, it happens, it comes with the territory of being YOURSELF luv!!!💗💗💗", "tiekonejon": "Oh my gooooodnessss and I had to search for these few simple words! Speechless for real! BUUUTTTT she removed her own crown. You do not need to give place or space to her, here or in your heart.", "tinbitehaile": "@shanboody I’m sorry you felt that way. I watched your video and I was furious!!! Her tone was very condescending and “cute” really?!! That was just unnecessary. But it had nothing to do with you or your talents. It had everything to do with what’s inside of her. I’ve watched/followed you since the very beginning and you’ve earned the right to sit at EVERY table!!! Keep doing ya thing💖✨", "deniserenee0224": "Forget her, you are very right and true in everything I’ve heard you do. I look forward to your post and I learn a lot. That woman was just a hater and is mad she doesn’t have what you have... don’t let it bother you and keep shining!!!🔅💏", "dominextdoor": "did she really call you cute like you’re some little girl? i’m furious. seriously.", "anahatahandmade": "I would looooove to see yall talk to each other. What does her decrepit self disagree with. Dr. Ruth was highly respected and she's cute....lol. But she's also old age and sex convo wasn't all open still in her time. People like you, myself and others that have theses conversations LIVE or recorded are creating voices, value, respect and knowledge. No shame. Open and honest. Keep doing what you do mama.", "nicoleacardoza\nVerified": "Verified", "simonedennymusic": "She obviously feels VERY threatened by you and it shows.... sad. She’s not worth your time or energy ! Keep rising !👑👑🙌🏽🙌🏽 @shanboody", "simplydovania": "Just pre ordered your book on @amazon @audible . Sending love & support your way! ❤️", "cladindelicates": "I bet you she watches all your videos and eagerly awaits new ones. You can tell she‘s jealous by the condescending tone.", "dwightclarkart": "Honestly you are so much more current and vibrant than she will EVER understand, it’s true the higher you go the more you will reduce some people’s ability to comprehend in the altitudes. KEEP DOING YOU!", "kmmccaffrey": "🙌🙌🙌 WELL👏FREAKING👏SAID👏🙌🙌🙌", "chandrellaaa": "🗣YOU THAT CHICK SHAN!!! 🌹", "electric.elissa": "WOW. smh", "spittz_": "Fuck that bitch, but always vent it’s a must. You dunno every job, worker or entrepreneur you gonna meet/work with the fucking devils of negativity. Don’t give them no attention bc the real heads already dunno. Trust* #stayblessedfamily.", "lovinglifewithlinds": "@shanboody grrrrr being a powerful, well spoken leader naturally creates opportunities like this to make you feel vulnerable. First of all, bravo for being in the position for someone to critique your words in the first place. Secondly, I'm so aggravated to see a woman belittle another woman the way she did. If nothing else it shows her insecurity. She knew she couldn't follow you! Not her place. It won't be the last time either unfortunately, but you have it what it takes to keep trekking through. Don't stop shining sister!", "roja_janrosa": "Keep shining girl!!! ✨✨✨", "legacylola": "Cute is an understatement and also one of your less interesting qualities. You’re brilliant, funny, articulate, witty, confident, empowering, compassionate, and ambitious, just to name a few! Your frustration and disgust is warranted but don’t stay in that space too long, the hat is confirmation that you’re squarely in your purpose and right where you’re supposed to be!! ❤️🙏🏽 @shanboody", "girlcanpaint": "@shanboody it’s a shame her ignorance didn’t let her see she was saying the same as u just in other words as she was to busy “trying” to bring u down", "ash.baca": "I love that instead of belittle and sink down to that level, that you educated her. You are incredible.", "lipsticknpistol": "Wow! I was a fan of hers, but this is really sad and disappointing. She needs to see this and take this lesson to heart.", "skyeisaacmusic": "She tried it!", "hashimlafond": "I want you to know that my wife and I are extremely grateful for what you do. No matter what others may say, your advice works. Thank you 🙏🏾", "sincerelyrisse": "Damn. And I’m a true fan of @sarahshahi ‘s work. This was so disheartening to watch. I hope she takes the time to educate herself and apologizes to you for the disrespect.", "m_shepy": "Not Carmen!!🤭🤭🤭", "kiaundrajackson": "I had no clue you were going to be on the show that day. I turned on my TV and bam! I saw your face. I was like yaaaaayyyy because you did a great job as always. Just know that we all love you. Periodt!", "iheardshealeader": "She’s white. She doesn’t know any better. LoL", "ifthese_locs_couldtalk": "I have followed you for 11 years...maybe even more (I'm old it's foggy). I bought Laid when it came out and it still sits on my shelf. I have already preordered the Game of desire on audible. Through the years I have cheered and stopped my day for a moment every single time I have unexpectedly seen you on a segment of a show or podcast. You are a close friend in my mind and I have nothing but love, support and enthusiasm for your continued sucess. I watched this video so disgusted and disheartened But not at all surprised. Age discrimination (both ways) is something I am constantly calling people on and feel so strongly about. Although there may be other prejudices happening here, I have no doubt with the \"cute\" comment and reference to Dr. Ruth, age is part of this. But as always you handled this with true acumen and grace and it is one of the reasons I have followed you for all these years. I hope Sarah sees your video. I hope she reaches out to have a conversation. I hope she can learn from this. You are amazing Shan. Keep shining🔥 Keep educating💗", "judi_lamb_": "She reminds me of a bully at my work! Thank God for your postive impact on all women young and old❤ Bless you for being a person that empowers not destroys!", "youcancallme__aj": "No one asked her if she agreed or not. We don’t care about her opinion! Keep glowing sis. Your amazing!", "kamariart": "Stay strong, queen! ✊🏽✊🏽✊🏽", "electricbrandi": "Go ‘head, Shan. Be great. 🌹", "chinadoll_chuli": "@shanboody sis, I’ve been watching you for almost a decade and you do NOT have to relay your resume to people... I completely understand the desire to claim an upright stance and walk in your power (I am active duty Navy w/ higher education & I’m female/brown/LGBTQ+), but make no mistake YOU WERE VETTED, YOU HAVE BEEN TESTED & YOU WERE SELECTED. We support you and we’re proud, she’s just another validation scammer. You never question another person’s light when you are walking in your own… she’s shook, leave her there! Move forward!", "charandroses": "Forever grateful for your transparency because although you don’t owe us any of it, you make it a priority to share your truth the best way you know how: to educate us and inspire us. I love you Shan!", "erisey": "I used to think @sarahshahi was cool, but I’m a super disappointed that she took it upon herself to even address you that way. Way to put another woman down. “Cute”? @sarahshahi stop! Someone that used their time to crush someone else like that is not someone I’m looking to for advice. #badkarma #getittogether #liveyourownlife", "solve.maria": "The way you handled this. With vulnerability & strength 👏🏾👏🏾, you’re amazing!", "_andralee": "So uncalled for...but your response was everything 👏🏾", "lyshasantos": "I watched the video and I felt hurt for you, almost to tears. Then as it went on I just felt like screaming \"THAT'S 👏 MAH 👏 GURL 👏\". I feel a lot of pride for you and your work. I hope that when @sarahshahi gets wind of this she simply feels inspired to empower all women around her and in her field. Hopefully more mindful in the future of the power of her own words and authority. 💛💛", "tea_and_incense": "I love your response!!!! You were so dignified. You didn't belittle her and you spoke facts. You took her words and redirected them to all of your accomplishments and acumen. Well done!!! That!!! Was a read🙌", "lindsaygogol": "XOXO!", "blackgirlspole": "Damn Sarah Shahi is a petty little asshole! Like why try to stop another woman’s shine? No worries @shanboody you are beyond dope and what you have done for so many does not go unnoticed! Keep Shinin’ Girl 🙌🏾🖤", "motherhood.unmastered": "she made herself look like a whole ass hating joke. You are fucking magic girl— shine tf on al👏🏾ways👏🏾", "oottum": "You're still a genius, so don't let anyone let you think otherwise. It's OK to feel what you're feeling in this moment... But know this: You are still a queen and a boss! 🌞 Shine on sister! 🖤", "cortneydaniellemoore": "With the time constraints guests get during TV segments, I can’t fathom why someone would make it a point devote negative energy when it’s supposed to be “their” moment. I guess she really didn’t have anything to add to the conversation because those few minutes were a mess with Melania level plagiarism.", "dinadavid": "Thank you for speaking up. That feeling of others putting you down or making you feel less than simply isn't cool. Unfortunately this still exists... And it's from actions like calling it out and encouraging discussions, that will allow for more awareness and hopefully action to cut this shit out. Keep being, doing you!! Congrats on all your accomplishments and going back to school! Woot", "opalellyse": "This is why we love you Shan!!!🙌🏽✨🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 Anyone who comes for you falls off 💯", "rashondarhodes": "BOODY WILL ALWAYS BE THE BEST", "jackieolympia": "Keep shining 🌟 Stand tall 👑 You are blazing a path for yourself and other women of color to have spaces in environments that aren’t familiar with recognizing our brilliance ✨", "qweirdtees": "Ain’t nobody in this day and age trying to listen to no fuckin Dr. Ruth! I mean, Dr. Ruth had a GREAT run but let’s be real", "cindicrose": "I hate to see women hating on other women like this. And yes. She was hating by diminishing you to “cute” as if that’s the extent of what you have to offer. Pathetic. You can disagree without belittling someone.", "rubndstrk": "She got nothin on u sis.", "bre_mini93": "She was intimidated PERRRIOODDTTT. She couldn’t get advice from someone coming off as confident ass you, youthful, brains and beauty. So she took her moment to try to steal yours smh", "jaquitamaymusic": "That was rude.. entitled and low class. It is so unfortunate weak women feel the need to tear other women down. You keep ascending Queen @shanboody 💜", "angdimples25": "She's so insecure, FDB! 🙄😤", "tach.j": "And then you came through with the CLASSIEST flex of all time. 🙌🏽 You more than deserve to be in this space! ❤️", "brookelynmosley": "How pompous and a total fail. Never mess with another woman’s light so you can shine. Shame on her", "underemployedcouchpotato": "You are POWERFUL. Your response is the ultimate example of how to deal with negativity and belittlement. Your efforts, knowledge, dedication, and hard work will not be dismissed. I absolutely love everything you stand for and everything you hope to transmit/inspire. You are grace. You are an idol. You stand tall ❤️", "jayda_kissed": "I want to print this video and hang it on my wall. Thank you for filming this. The directness, the grace, the compassion, the truths, everything was on point.", "yourauntdani": "Sending love, you absolutely belong and deserve the recognition for your hard ass work and inspiration!!!!! ✨", "loviez13th": "So sad... a woman- giving us a real demonstration of insecurity and selfishness at the same time. This world is filled with oxygen thieves- non- supportive... no game changers! You thrive @shanboody ... you are amazing and DARING... and to me you are family. Life is too short for the disappointment woman like her speak.", "redlotus32": "Keep doing your thang!! One comment can’t tear down what we are all helping you hold up. We gotchu ! ✊🏾💕", "__chimera": "You’re a badass and I hope you know it. Don’t take that personally, it just shows what space that woman is occupying.", "i.amnicole.d": "You keep doing what you’re doing! YOU are making a difference in spite of what she has to think or say about it. PeriodT! We see you queen 👸🏽", "truth.over.facts": "You didn’t deserve that @shanboody. That was disgusting and we are rooting for you 💜✨", "calimiles": "Very obvious she’s jealous of you with such a catty reaction. How embarrassing FOR HER. 💜", "smashenfashion": "Stay shining Shan. You clearly were memorable to her. Your light is as bright as the stars and she felt your strength. It may feel like hate but deep down she admires your gifting. Keep climbing. We Stan for you!!💓💓💓", "rachbluebird": "AMEN!!! You owned your accomplishments, expertise, feelings, vulnerability, truth, all in one clip. You spoke your truth, and even when someone else tried to pull you down, you still lifted her AND everyone else. Thank you for standing up for those of us that do the work, but maybe don’t “look the part” - whatever that means. I, too, know this infuriating feeling all too well. I am sooo tired of seeing people (women in particular) tear each other down. Kudos for rising above!", "jouneb": "I am proud of how gracefully you handled this situation.. You are the definition of beauty and brains.. Never apologize for you, you will break barriers. I am learning a lot from you. Keep pushing.. She feels threatened that's why she dedicated half of her air time to you. So, thank her for the free press💋😏", "ejbennett23": "I had the opportunity to moderate a panel w you last year at VidCon and you blew me away. I was already familiar with your work, but your words on stage not only inspired me but also so many others in the room. Keep doing YOU! You are such a gift and a light to so many and we love you for all that share with us everyday!", "reesiebabe": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "k_a1beauty": "She didn’t tear down shit but public opinion of herself ! Insecurity in the form of criticism ! 😘 stay cute @shanboody cuz by cute she meant a powerful force that threatens her ! 💯", "sharonamoves": "You’re not “cute” you are an EXPERT that’s why you were there and you took your time on that show to highlight YOUR expertise. How small of her to use that language and her time to describe you and your work in that way- disgrace. Stay shining and giving to the world!", "heavy.metal.evelyn": "You are the voice for us that are misrepresented, misunderstood, and resented. You are our forefront. We respect you and those that cannot see our truth are simply blind. Keep doing what you're doing. Powerful people intimidate those who are close minded. YOU are powerful. We will not succumb to their level but educate and enlighten them through truth and honesty. Thank you again.", "optionalsoup": "You only know she was talking like that because inside she was jealous. You're young, attractive, extremely hard working and successful and you're happy with what you have while still being hungry for more.", "ahhhchiuuu": "You go shan! Some times people need to keep their opinions to themselves. *cough* Sarah Shahi *cough*", "youlovemani": "You are that female period!! I been rocking with you since YouTube days! You are extremely gorgeous and you are amazing at what you do! I never heard of her personally ,and I can’t believe she would do that and then call you “cute”. She could have just said she does not agree and kept it at that 🙄🙄. I love you Shan and you are the best!", "thepassionseeker": "you are (already) goddess, she still on her way. keep going girl, love all posts/inputs from you and you so inspiring ♥️♥️♥️", "emanifresh": "👏👏👏👏👏", "a_different_kinda_queen": "Thank you so much for sharing your expertise with the world, and thank you more for addressing this injustice the way you did. Your video was classy, and pointed, and necessary! Powerless people have always been afraid of powerful people and that’s all that was. You definitely have made me feel like my own personal sex expert so mission accomplished!", "faces_by_jena": "Wow, I'm sorry she made you feel this way! Very dismissive and unnecessary on her part.", "namibiah": "Dont worry she came across as a hater and not very articulate 😊", "winnieharlow\nVerified": "Verified", "nisidisdat": "@shanboody there will always be people like @sarahshahi that will try to discredit you even though you have worked your ass of! it’s part of being successful. Spread love and wisdom like you always have. Don’t stoop to her level!", "goodmoms_badchoices": "As mother who have sought and benefited from your advice you absolutely have nothing to prove. You are a master in your expertise because you have truly made it your life’s purpose. The word “cute” as a way to describe you or your work is incredibly degrading! Not only as a woman but as a woman of color (who we don’t see in these spaces). We as women need to do better. Your class and grace prevails and I truly hope that made her feel like the terrible person she was in that moment. Keep shining Shan!", "shanshhan": "I watched the YT video and all I can say is well said..... What a way to turn her mess into your most empowering message..... The lower they go the higher u rise hun 🙌🏾 Push through", "njoywells": "♥️♥️♥️", "holly.blair": "No one can *make* you feel anyway. What if this is it, YOU MADE IT SIS! Not only were you on Access as an expert but you gor discussed even further later? 👏🏼. The bigger you get the more opinions people will have. They're totally their own. It's peanuts. Don't let this overshadow a big accomplishment that you are clearly really proud of.", "diamondzandcurlz": "When people talk down on others or try to minimize another’s success it shows their insecurities and lack of character . What did she gain by talking down on you . Shame on her for making herself look like a bitter Betty on national tv 🤣. Keep doing you boo !", "joellephillips": "I just have one question. Before she parted her lips to spew anything about you... did anyone at that table even ask her for her DAMN opinion?! If not, why is she even speaking I’m confused 🤔", "mama_sid85": "How disgraceful. I would never want to take advice from a woman who would bring other women down. Really sad how envy shines right through and a true example of what a mans world looks like, \"Cute\"? Thank God there are strong women like you Shannon who shows face to other strong women and can stand up in a world like this and speak. You are such a joy to listen to and an inspiration to where you came from. I applaud you👏👏👏", "thapoliticalpoet": "Best dis since 2pac-Hit Em Up 💃🏾💃🏾 Jkjk Very eloquently put. It’s a shame any woman can think to belittle another woman’s work in 2019. Shine on ✨ @shanboody", "dynamicallydella_": "It was absolutely inappropriate and diminutive. If you guys were sitting on the couch together on camera having the same discussion she would have mentioned her differing opinion without dismissing you as an individual for not fitting \"the profile\" of what she would consider an expert worthy of taking advice from....We don't even have to spend the time unpacking the inherent bias underlying her knee jerk comedic vitriol, but recognize from whence it came. @shanboody your track record, work ethic, divine purpose, and invitation to the conversation validate you. What she did was unintentionally expose an area for her to grow. Thick skin has nothing to do with being disrespected and deemed unqualified \"in the midst\" of your work.", "endthecall_22": "You need to apologize @sarahshahi", "chosen2elevate_": "You’re amazing and always will be. She was just trying to steal your thunder.... It’s not what you say, it’s how you say it. So for her to try and degrade you with the “she’s cute” line. Was so unnecessary and only shows the type of character she is. 🤡", "dom.creates": "'shes so cute' for another woman to be so condescending when 'cute' is a label that many of us try to escape and is used to negate our skills and experience is just so disgusting. Shes tried it, that was cute, moving right along. 🖕🏾", "exuliadiamantino": "don't worry Shan, a comment coming from someone that is only known for ONE role on her entire carreer, you should be honored that she doesn't agree with u", "_natashanadiaaa": "Keep influencing, keep moving forward and continue being authentically yourself in every space. You’ve taught me a lot and have helped to open my mind up in ways that were outside of what I grew up believing. Stay educating those who are open to receive what you have to say and even those who aren’t. Your message will continue to touch and open the minds of whoever it is meant for WE appreciate you ❤️✨", "blaqmoonmami": "Wow, Im sorry that happened to you. Your light shines no matter what. So proud of you, even though I dont know you personally lol, and believe in you! Keep inspiring 💖🔮", "jaysparxx": "Chile, Sarah shahi...? you talking about Carmen from the L word? We don’t pay attention to her anymore. Don’t stress, karma will work it’s way into her life. ❤️", "ibetonmyself": "You’ve been doing this too long for this type of disrespect smh TOO LONG! @shanboody", "natalie.odell": "Preach girl!! U killed it!! 🖕🏽a hater!!", "barbwire92": "What @sarahshahi said was absolutely uncalled for and I hope that she apologizes for her rude comment. ultimately she ends up only making herself look very unprofessional. You are such an inspiration, Shan. Dont let anyone tell you otherwise 💙💙", "liizaaboo": "Her problem with you is none of your business, it’s HERS. Where she went wrong was speaking about it on a national, public platform. Keep your head up and keep doing the work you enjoy cause you’re amazing ✨💙", "transformationofself": "@shanboody You will NEVER be criticized by someone who is doing more than you... Let that sink in. You're brilliant, you shine. Haters love to throw shade and you just keep giving them reasons to. She's a prime example of what's wrong with women in our world... Instead of rooting for each other's empowerment they try to discredit us.", "chanellemidwest": "Love u", "hazardouswaist": "That “she’s so cute” is so dismissive of your work and patronising at the same time, not to mention a form of gaslighting. I’m so gutted for you. What you do is so important and necessary. How dare she do that to you. ❤️", "elese_kennedy": "@sarahshahi 👀", "raddrae": "She threw shade and paraphrased the very advice you gave 🤔 hmmm...", "valerieashley82": "You are awesome at what you do...when they go low you stay high @shanboody ❤️", "thecharlessmith": "BOOOO SARAH hatin ass", "ninavsmichelle": "Apologies for the typos", "hellomsmitchell": "LOVE LOVE LOVE YOU, Shannon you’ve kept me calm in some moments with your honesty, transparency and wisdom. Thank you! 💛💛💛", "velabeauty\nVerified": "Verified", "diabadassmomcandice": "Girl. Congrats!!!! You’ve got haters! Means your doing BIG THINGS! You are class/ you are professional and you are everything she isn’t! Go in brush your shoulders off cuz you have already achieved a level of greatness that will be unachievable by her. That was cute how she tried to say you’re cute (cue the trigger) 🤣. Ooooh... now you got me wanting to research what it is was she was on there for and why in the hell she wouldn’t use her precious time wisely?!? Well she sure showed her colours didn’t she?! Keep doing what you do! All the books and shows and research can’t touch touch anyone on the market now days for what you teach! Get outta here jelly lady. Hold your head high girl. You got this. ♥️💋❤️👍💕", "jodiekeene": "So frustrated for you, this is unacceptable behavior of someone who claims to be a professional 😠 You're an incredible human, just keep doing you and try not to let this get you down!! 💜", "kimmie_supreme": "You know its mockery when she throws in 'cute'. Kmt", "briannad_1": "So incredibly immature. Who does that? With so many talented people in this world not getting the attention they deserve, for her to use hers to bash? Ugh. So much for women supporting women. 😒", "ashleysmith.tv": "Wow! Haters gonna hate. Your energy is everything, so of course they want to dim your light. Keep shining girl. We love you! ❤️", "raynata_e_osman": "Ooooooo the way you dropped them accomplishments!!! You keep on shinning and keep on proving these people wrong. Watch that black girl fly❤️🐝", "prettyb1104": "Keep doin you Shan!!!!!!! We gotcha back boo!!!!!", "questforsexywithquetsy": "@shanboody She cannot tear you up or discredit you unless you allow her to. Everything she said about you was a reflection of her. You have inspired thousands upon thousands of women, worked your ass off to be seen and educate. You are beautiful relatable and worthy of everything good! This person clearly is not happy with something she has done and is projecting. You are and always will be MY and many other’s trusted source of information. Thank you for doing the work that you do! I love you! 💕", "girlonaplanet": "Damn im sorry this happen to you shan... this isn't the only place I've experienced this type of thing what I've heard other \"experts\" in different fields shame others in the same field that are younger than them.... and a lot of time it is to promote their own product and credit themselves. But what I really think it is is them being upset about the fact that they didn't find that type of success as young as you. And it's sad you have to tear down someone else to try and validate yourself or your opinions. But in this day and age this type of thing exposes itself and if she ever sees this hopefully she can take something from it instead of hate", "theteniola": "Fuck her. You're doing great ❤️", "_misslariss": "Your poise and composure is admirable!! On a platform where education and experiences should be shared, you knocked it out the park per usual!! 💪🏼✨", "stylesofcin": "You are amazing!!!! 💓 Keep doing what you are doing WE are your audience not her!", "karahofh": "I DMd her telling her how disappointed I was to see someone I was a fan of, disrespect another woman, an expert in her field. I’m with @amberscloset, her taking up her own time to dismiss you is a show of her own insecurity. She sounded ignorant and bitter and you continue to speak with eloquence and strength. You’re the true role model here!", "jayyteehhh": "It's easy for her to discredit and you and mock you when she hasn't even accepted herself... I mean, she cant even accept her first name, the idea of accepting anyone else's input that's different from hers is difficult for her. She didnt disagree with you, she belittled you, and as a grown woman with 3 kids. I hope she's teaching her kids better.. #sarahshahi", "lyra_phoenix__": "I love you @shanboody ❤️😭❤️ you have impacted my life and lives of millions of young and old women with the knowledge you give so freely.. keep exuding your light with so much grace as usual ✊🏾✨", "zreanebsai": "Love you 😍❤️", "kisshh_x": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "smiley_dezie": "Sis is pressed cause she wants a foot rub and shes not gettin it lol she dont want to make it about sex cause that's probably nom existent in her life lol good luck sis", "awkwardly_ekeneshaa": "It’s ok sis I’m bought to go off on this fucking bitch for you. I’m MAD.", "nickibee1226": "We appreciate you and your truth", "tooswag4uboo": "I’m so sorry you experienced this and can only imagine the array of emotions. Having said that, look at how bright you fucking shine!!!! 🌞❤️🙌🏾Thank you for being there for us on the regular, sharing your heart , and being your own advocate. Leadership, baby. You got it!!! 👊🏽🔥💙", "dauche": "You handled this very well. I’m pissed, will hold all other comments except for...you are INCREDIBLE. KEEP GOING SHAN! KEEP SHINNING QUEEN ✨", "avgustreign": "Others opinions are more of a reflection on them than on you. I’ve watched you since I was in high school and learned so much! @sarahshahi honestly owes you an apology. In this day and age what women is really going to take away from her own shine to try an tear down another woman. Your more than qualified to be talking about this subject. She should find something better to do with her time ❤️❤️", "lavie.josie": "@sarahshahi I really thought you were better than this. I thought you were the type to uplift other women, not minimize the accomplishments by calling her \"cute\" during your segment like shes a child.", "lifeinglookinghealingliz": "I see women taking other women down in my office every day of the week; the only difference is its not broadcasted on TV for the world to see but that doesn't diminish the pain to see what women are capable of doing to their own kind. Every day my boss would rise up, go to work and put on a brave face and be the bigger woman that she is.", "_lexbehappy": "Wait is that Carmen from the L word? Wow! Since I was younger she became a household name to me because of her character from that show. In watching both your response and her response, I find it quite interesting that she dismissed you just to end up agreeing with you but in her own words. Your response at the end of the video, just was so damn classy and mature, which is why I admire you as an educator. I never understood this notion that one needs to have this prestigious background to be recognized for their work. You killed her with kindness and I wish you good luck in school❤️", "iamliya": "It says way more about her then it does about you Shannon. You keep doing you. Keep empowering, encouraging, educating and inspiring as you do love!❤️ keep your head up.", "stephworldwide": "Never understand when people take time and energy to tear someone else down. I really don’t lol", "kendall_all_day": "That honestly just says a lot about her and nothing about you.... why would anyone take the time away from the time slot they were given to promote themselves to tear down someone else, who hasn’t done anything wrong? Are you not successful enough to fill up your time slot with what you’re doing? And I hate that she called you “cute”. As if you’re just some random person with an opinion and not someone who is a certified professional in what you do! I know how that feels; I’m a 22 year old black woman getting my PhD in the sciences, so I’ve gotten that before. If it counts for anything...I’ve been watching/following/keeping up with your career for 6 years and your advice/knowledge has always been very helpful and insightful to me! You’ve accomplished sooo much and are doing great things! ❤️", "jojishouse": "Take that @sarahshahi DONT COME FOR MY GIRL !!!! Love you Shannon ❤️", "cherrilizabiff": "The funny thing is, she referenced Dr Ruth, who would probably celebrate/encourage you and the stance you take on many topics regarding sex. To each her own, i truly believe that, but this chick’s approach was way off. She could have disagreed without attempting to discredit you.", "sasha__alexia": "We love you, Shan!! All she’s doing is sending more people your way. 👏🏾", "maxwelllil": "I’m so done with women calling other women “cute” as a kind of backhanded compliment. Support your sisters - call them fierce, intelligent, powerful, beautiful, kind, articulate, etc - but not CUTE - don’t claim to be empowering and supporting other women while you continue to contribute to infantilising them and sullying their power!! So say what you gotta say girl! We are here for you.", "styleinthecity": "I think you’re brilliant, let’s get that straight. 🙌🏽❤️ But I’m a little perplexed as to why you’ve allowed somebody with a difference of opinion to get to you. She’s entitled to hers. However, NOTHING she said makes me think any less of you. And my opinion is important too. So please let’s all stop giving our power away to people that aren’t worthy of it. You made a video about this? That energy could have gone into you creating content that either helped others (as you often do) OR focused on something more positive. You’re AMAZING and most people think so. Ignore haters they simply don’t matter. 😘", "peacockbuddha": "For those who get you, her words were easily washed over and she just doesn't speak your language. Don't worry, she'll come knocking. This is just mean girl hateration. Keep shining and doing you!💖", "__kaylathegoddess": "Ohhh she was intimidated by your presence. Some people are like that. Their energy just hates you because they aren’t you. She might need to pick up one of your books instead because she’s projecting.", "ddidz3": "Your video was so well said. Not only that but it is clear who is able to have an open, mature conversation and discussion regarding this topic. You go girl.", "lesavagecabbage814": "You look DAMN good to me too!! I think you’re great, and have learned a lot from you!! Keep up the GREAT work!!", "_terryjosiah_": "🙌🏽 Rock it like you supposed to! 🔥", "_westbabylon": "Girl welcome to the real world we all get it nothing new here not just you experience it. Just keep doing your thing prove them wrong with your success. 💪🏾", "thepamela252": "She wants advice from dr. Ruth because she's intimidated.", "justsayjackiee": "You’re amazing Shannon. Talk yo shit girl. ❤️", "misslopeznyc": "Cute, Angry, Hostile, Bitchy, Strong willed, bossy...all words that POC women, especially black women, are called to minimize their existence!! Sounds like privilege to me.", "meganlorenmaccallum": "@amberalonzi", "themelissadenizard": "Shan, I’m so sorry. But again, here you are: using this experience to enlighten us and to be incredibly insightful. You are always a winner, even when it isn’t obvious to the naked eye💛", "cneastwoman": "I would like to introduce that woman to the dean of students (now retired) and the director of the campus student health office of the #1 community college in California, SMC, and have them tell this woman how YOU taught them in their senior age new terminology and how young folks are so they can understand the younger generation they represented. How YOU came and taught ME as a 22 year old new things and gave us all a safe space to communicate together, where that had never happened there before. This was near 10 years ago! If you’re not an expert now, then Dr. Ruth is not...and we all know you both are.", "amberscloset\nVerified": "Verified", "ashlemonade": "@SarahShahi puppies and bows are cute sis. You choosing to minimize someone after the fact instead of face-to-face...tuh. You’re pressed.", "rosiegrier_": "Just watched your video and you absolutely killed the response 👏🏼 There will always be people who want to patronise out of insecurity and perceived threat on whatever level. And you will always elevate above it because you’re a damn boss at what you do and I couldn’t be more proud of you every damn day ❤️ keep killing it and demanding the respect you are so deserving of girl!", "threetoedyemzzz": "About to go snatch that bitch up 😡", "lalasweetb": "She's the type of person to ask the RN of 20+ yrs for a doctor of 3 years like girl...", "chiquitaboat": "Mannnnn... the face of human sexuality and relationships is fine af! We cant help it if theyd rather take advice from old white ppl. No disrespect to Dr. Ruth doe! Keep goin Shan!", "alexandriaashcroft": "The fact that she had a reaction means you had something of substance to say. You know you who you are and what you’ve done and have yet to do. Keep blessing those with an open heart and mind to receive. Passive aggressive people don’t know how to coexist with assertive people. I ❤ you boo", "ruaimaa": "That was so wrong, I’m glad that you could come out and discuss this in a neutral yet respectful manner. She is on a public show, she needs to be more wary about what she says and how she says it. Very unprofessional of her...", "noisaidilikedu": "I mean look at her and then look at you. She’s upset.", "naturallyang1_": "What a sarcastic bih! You rock Shan!", "clarissa__jay": "You are so powerful! Shes missing out. We hear you and that’s all that matters.", "chanicetv": "Shannon!! No one can dull your shine girl! We got your back ♥️♥️♥️♥️♥️ I would never forget when I came across your channel I was feeling so unattractive and the first video was what seduction technique suits you and I just felt so empowered after...I've watched your series on gosh that big collab you had when you date tested (you know when you squeezed a lemon by accident and the guy got all red in the face 😂) and I was like look at my girl doing her thing AND TEACHING. FUCK A HATER....She's simply jealous...you got so much going for you sis. Send her peace and light. She needs it ♥️", "trainingwithtroya": "What an amazing and classy way to respond!!! I’m so proud of you @shanboody !! I pray lesson was learned!! ✨✨✨✨", "chrstnalxndra": "I wanna applaud you for the EXPERT read you gave in your YouTube video. You literally have NOTHING to prove to her, but I love how you came from a place of love to stand your ground. Fuck what she thinks. 👏🏾", "ekoidstudio": "This video makes me so mad. She was trying to undermine you and I can't believe people didn't stand up for you. Every job that I work out, there's always the group of mean girls and guys who are insecure, loud for no reason and try to talk shit about others to make themselves look and feel good. The fact that she did that on national TV, I'm embarrassed for her. Well everyone knows that type of person she is. Congratulations! She's played herself.", "roxandabs": "Love you Shan!!!", "mimilovesmojito": "Shannon Shannon Shannon........I am ready to fight!!! You are such an advocate and champion for women to have their own voice and do what’s right for THEM. So to have this woman belittle you and judge you and try to make it seem like there’s only one way to think (hers) is just.......sad. And gross.", "kay_is_royal": "I’m so proud of you. I’ve been following your IG since I got an IG account in 2013. To watch you grow has been my pleasure. What happened to you is inexcusable, but your response has been nothing short of classy. I adore you. Keep doing what you’re doing.", "jahshona": "❤️❤️❤️", "papaya_ayah": "YOUR RESPONSE VIDEO ON YOUTUBE WAS SO WELL DONE!! A READ! Buying your book!! ❤️", "missttjones": "This just made me so mad! What she did was beyond disrespectful and I completely feel your hurt. You are amazing and so worthy and deserving of the platform that you've earned. I hope that she apologizes ASAP!", "thel_rich": "GO OFF SIS!! Defend your craft!! You worked your ass off to get where you are!! & it’s sad women can’t support each other!! Lastly.. DR RUTH?!! Nothing against that woman but can I get sex advice from a woman who reps me?! One that I see myself in!! Maybe she sees herself as an old white woman HOWEVER I do NOT! Keep on KEEPING ON!! #BRAVOSISTA", "tiffanyjanay": "This is a brilliant and incredibly inspiring. It radiates class and vulnerability. You were able to intellectually speak on what hurt you and defend yourself without attacking yet you stood your ground so firmly and clearly. I'm so in love with the women of my generation and how much work we are doing to end this toxic way of how we treat other women and other humans in general. Bravo to you Shan! I'm so inspired to keep being better at the way I interact, defend myself, and express my gifts and talents. This is an excellent example.", "caseyheckmanrn": "I'm sorry, that's she is uncouth, completely out of line and does not deserve to pass judgement on anyone or their education. Don't let her dim your light @shanboody", "deedeeluh": "I love you Queen 👸🏽", "daisydukes987": "She sounded like a whole hater. Downplaying all your years of work and research to “oh she’s so cute”. How disrespectful.", "brysonknoel": "Keep pushing Shannon! You do an exceptional job and your work has inspired me beyond measure.", "pscilaaa": "YOURE AMAZING! this video is everything. so much respect for you 🖤", "trisha_hughes_": "Damn. You handled yourself w grace & dignity. You’re amazing, that’s all. ❤️", "leslie_justagirl": "YES👏🏾 MAM'M👏🏾 STAND👏🏾 FIRM👏🏾IN👏🏾YOUR👏🏾LIGHT👏🏾 Such an inspiration to me Shan. KEEP SHINING!!!!!!!", "shesharishow": "She can literally disagree in silence. Or not use this space that you both shared promoting your work and diminish it with “your so cute” . This was extremely triggering. I can remember being in offices and doing presentations and another woman saying “ I couldn’t pay attention to you because your braids were so cute” … passive aggressive rhetoric. I’m glad that this generation is now being vocal !", "mskianamishea24": "I really don't like how humans treat each other 99% of the time bc they always show their true colors and all masks come off when u think they won't show their whole ass, they always do. 😮😮 When someone does show their true colors...believe it. I am sorry that happened to u on tv; it is not cool at all. U have every right to share ur excellence and she didn't even try to acknowledge u for anything other than being \"cute\"...First of all, ur more than cute u are beautiful. Secondly, she should have been way more adult about how she addressed u. To disagree with someone is one thing. To make fun of them, put them down, disrespect, be mean, rude, and demeaning is unacceptable in every way. Ppl are so mean it is beyond sickening smh. U handled this situation with class and dignity. I respect & love u for that. I know that was hard to experience, but u will overcome this. Don't ever feed into negativity that is what this world wants u to do smh. Rise above anyone that is not good or has negative intentions by showcasing ur greatness. Always be positive. One of my personal quotes..\"U have to be the light u want to see in this world\". U will rise to new heights in ur successes & accomplishments. Adjust ur crown, smile, and keep being beautiful. Continue to walk in ur excellence with ur head held high queen 👑❤💕", "karmalaluna": "I know exactly who she is because I watched The L Word, but haven't watched any other project she's been in. Won't start now smh.", "nikhiyang1992": "She said practically the same things you said -_-", "brittrfillmore": "Who is this lame? We’ve never even heard of her 🥴", "r3ma_k": "@shanboody Go ahead wit yo bad self...some people will always try to tear down what they cannot climb up to but keep doing YOU...you are loved for who you are and what you do ❤️👏", "jazminepadin": "@shanboody she is just jealous and wants attention. You are awesome and a inspiration.", "reginaldfirstofmyname": "I would love to read your book and learn more of your insights. What Sarah Shahi did was the epitome of being a Childish Underhanded Negative Troll. The devil here is in the details.", "sittinpreett": "What was she gonna talk about if you weren’t there?Didn’t she become prepared for her segment? Or is tearing other people down to let herself shine her thing?", "simsinga": "@ her so she can get that ass rotisseried", "sweetsting_": "Two words :::: Fuckkkk errrrr 😩😂💪🏽✨", "desireemichele_1": "The disrespect was unwarranted and stupid, @sarahshahi commented on something she knew nothing about. She doesn’t know you or your credentials. I hate it, I hate that women have to tear other women down just to get noticed", "autumnofficial": "I’m honestly WOWED by her nerve. You handled this like a QUEEN. 👸🏽", "2nycephotography": "Holy crap....what was her reason for doing this? SMH", "chelssology": "Loooove how you call people out in the most poised and classy manner", "freeasthespirits": "You are a mover and a shaker. It's a shame she can't admit it. 💕", "joiseygoil": "Fuck her ! You’re amazing ♥️", "_mariahsymone": "FUCK HER SHES A HATER!", "edenannalise": "Wow. I felt so disgusted watching this horrendous display of a woman tearing down another woman. She just showed herself to be ugly and small. You’ve earned the right to speak in this space. Don’t even pay any mind to these ppl who spew out garbage from their mouths. You have an army of supporters mama, we know you know your ish and more importantly we love and respect you.", "stayreddy": "wooowwwwww. well you are clearly the bigger person in this. and damn, jealousy don’t look good on no👏🏾bo👏🏾dy! keep shining, love! ✨", "zboogieindahoodie": "@ashantoib girllll this tea was hot", "gentillybree": "Who even is that? No, that’s not a diss, I have no idea who that is. How disgusting of her. Enough of that now but Shannon, thank you for everything that you do. I will never be able to put into words how you, your books and videos have helped me. Yes you’re beautiful but you’re smart af too! ✨", "xicanista_soul": "Smh. Such a white women tendency to hate and disregard women of color. I'm sorry you have to deal with this. Sending love to you❤️", "shopgirl3535": "This is so disappointing. Lost all respect for @sarahshahi. You don’t need to tear other women down. And that “you’re so cute” comment down right infuriates me.", "zensue1": "Keep your head up....you are brilliant and many of us enjoy your work😊💖💖💖", "sunnismilez": "I just watched the full video. I LOVE how you handled it 🌻", "ethicalesol": "Keep up the amazing work! You are powerful and professional. I always look forward to your content and realness. You handled this with the same integrity you always bring. Thanks for working to educate and inspire people!👏👏👏", "perfectlyashlee": "You are literally magic!! Women like her are so intimidated by another woman’s glowing light, that all she can do is ATTEMPT to tear you down. My advice to you is: DONT LET HER!!! You keep doing you and being a light ✨💫!!!", "niecydny": "Like you said...KEEP PuSHING! What this woman’s FAILS to realize is YOU are someone’s DR RUTH and some people are probably wondering who the hell is Dr Ruth? No disrespect to DR Ruth at all but there’s room for you to do YOUR thing YOUR way and shine!!!! Don’t let anyone dim your LIGHT..keep doing YOU and promote the heck out of your BOOK!!", "paigecoster": "She’s just projecting on you because you hit the nail on the head with your advice. Keep doing your thing girl xx", "liv.ing__": "Wowowow. Words cannot express the amount of disgust i felt watching this. What could she have possibly gained from doing it. Completely malicious. You are a phenomenal woman, a trailblazer. This just says a lot about her character & things she must deal with internally.", "april_riles": "Super classy response! Keep up the good work! ❤️", "unicorn_goddess89": "So cute?! Biiiiiitch. Secondly, sweetheart she's clearly not with the modern times with sex and intimacy and just overall humanity. Any day can be trash day sweetie. Shan, you are amazing and I've seen you (and your curls) flourish so wonderfully❤️❤️❤️", "plainkvte": "I am so obsessed with everything you do! Your work, your graft, your intelligence, your ability to take knock downs like this the way you have and STILL BIG THIS WOMAN UP I am SO proud of you. I share your videos all the time with my lovers and friends as my way of helping an area I deem necessary and I have not had a single person get back to me with bad feedback, whether your videos are their ‘kinda thing’ or not. You’ve given me confidence in so many different areas of my life and been a huge reason why my personality is the way it is now. I was so mad this woman tried (and tried she did but succeeded? I think not!) to make you look small and make your work look like a joke.... and you spring back the way you did?! I’m in awe. Fucking killing the game every damn day. I know you’ll never stop doing great things! 💪🏻 Congratulations with as you said going back to school, can’t wait to learn more through you. 💓", "tiathecreator_": "What in the entire fuck?! I’m appalled, I’m disgusted, I’m upset. “She’s so cute” is demeaning. The nerve of that condescending cunt. She’s so bothered that she didn’t even promote her own shit. As cliche as it is, all she did was make you more relevant and poppin. Kudos to you for being exuding grace. Sorry for my horrible language but I’m real passionate about robbing of their moment and hater culture.", "adrinaxo": "👏👏👏", "jhane_nay94": "I mean I don’t have a blue check or anything but I’m sorry who is she , it’s crazy how she said the same thing you said just in a different way I think an apology is due here @sarahshahi !", "sydniruth": "I definitely just READ her in her comment section. Classsssily! In True Shan Fashion! HOW DARE SHE!", "anez77": "This is terrible. Next- I much rather watch you then @accessonline !!!", "sabrimakeup": "Keep doing what your doing because you stand out 💯", "leslie.marisha.11": "You know what? I’m so proud of you for sticking up for yourself Shannon! Clearly she’s just ignorant @shanboody", "tameikat": "So disappointing to see another woman tear down a female like that. You handled it like a boss. Keep pushing 🙏🏾👏🏾", "chaneldecember": "May EVERYTHING that bitch touch crumbles.", "freshwatafletch": "ugh i admire you so much! politely and punctually putting people in their place 🗣", "designerti\nVerified": "Verified", "spiritually_freeme": "They should’ve stopped her dead in her tracks... “Aht Aht lets not do that!!”And continued on with the segment.", "_ashcaassh": "💛 keep shining ✨✊🏽", "georgiemorley": "Ooph girl so sorry that happened to you. That was not the right forum for her to say that at all and the “she’s cute” line is so gross and dismissive. Thank you for being brave and defending yourself and modeling how to do it with integrity", "cynthiacaguama": "We ♥️ You Shan", "shesthedopest": "Women hating on other women is so common. She thought by tearing you down it was going to somehow take credibility away from you but it only made her look jealous and petty", "nicolledelarosa_": "We love and support you Shannon!", "darriendivinity": "Don’t allow for someone else’s misunderstanding to dim your light!!! Keep rockin it Shan Boody!!!!!", "xxvelmadanklyxx": "❤️", "motherinthewild": "Girl, I grew up watching and listening to Dr Ruth and Sue Johansson. And let me be straight with you...it made learning about sex somewhat mechanical, even a little comical...it was enjoyable! But what I’m learning from YOU is downright accurate, current, without judgement or stigma. You are still teaching and uncovering but as a gorgeous, empowered VERY REAL woman. And you bring SEXUALITY into it more! You bring all the nuance into it more. The world needs you. You have a HUGE place in this field and I’m so grateful for that. I’m not even going to comment about the many unfortunate things that other guest did (mostly for herself). I’m sorry you were slammed in such a petty way, but I love the way you keep rising!", "franziska": "💪 ❤️", "chezzaouttanowhere": "Ok but the truth is, sis. She 100% did not minimize or tear you down. She cannot REACH YOU! Ok. I’m livid, but that’s standard inferior, incurious, basic bitch behavior. And also a clout grab. I didn’t know why she was until you made this video. The world is moving digital and television people are clamoring for crossover appeal. With all due respect to your feelings FUCK HER! Bitch can kick rocks. And I’m going to write an essay on how colonial and aggressive her statements were. Like tonight!!", "kellybagels13": "Wow, what a sad sad person she must be to have to put another down in order to make herself feel better. Women should raise each other up. You are not the one who should be embarrassed and I’m sure she’s perfectly aware of that.", "sheespeaks_": "Wait Sarah Shahi as in Carmen from The L Word?!", "iripaza": "I have been following you and learned a lot. Your reaction to this person is just amazing. A polite and classy way. I believe that a person who is diminishing the others to shine is a person who has self confidence issue. When you rock on what you do you do not have to be condescendant. @shanboody you rock and I am learning so much with you. ✨", "the_girl_in_the_cafe": "That sux 😒", "giababyy18": "Ew. Someone’s bitter. I’m proud of you for speaking out on it babe!", "cozygirlpdx": "Like a true queen. Grace and all.", "aisha_crna": "And I bet you she has recently used the term hotgirl summer. Girl have a seat.", "amawhyte": "Haters? Panini Pressed in the words of Aunty Jackie. You got accolades 🙌🏾", "trcelan": "I wouldn’t even waste my time! Jealousy but girl we on your side !!", "_byekaybee_": "You handled this SO well! Thank you for sharing and thank you for remaining respectful while CHECKING HER!! 👏🏽👏🏽👏🏽 You’re amazing 💕💕💕", "briyoumetravel": "You’re a gem Shannon! Thanks for sharing your vulnerability with us. We keep it pushing past the negativity, always ✨", "cristalsoren": "@sarahshahi", "donewiththisig2019": "She’s 🗑", "chantel_riley\nVerified": "Verified", "kamikaze_bees": "Honestly through your online presence and the resources you’re constantly putting out to help people better understand themselves you’ve given me better language to articulate my needs and desires and a better handle on what I want from relationships and for myself. It makes me sick to see women trying to tear other women down, especially by using minimizing terms like cute which have been used to hold us back and devalue our hard work for so long. Shan, you a boss bitch and all of us know it. You’ve worked damn hard to get where you are and you’ve helped so many people along the way. There is no question that you deserve that platform or any other, you have worthwhile things to say and you always say them respectfully. We appreciate you Shan!", "vale_dotcom": "🙌 you handled it magnificently, I applaud you🔥", "genie_ran": "That’s her small minded opinion don’t let her dull your shine ⭐️ Haters gonna hate. If you don’t have criticism you ain’t nobody ❤️", "lovelesky_": "Shan. Fuck her and them crooked bangs! PERIODT!", "the_hopeful_optimist": "Im quite disgusted. She just screams insecure. Trying to put out your light so she can shine. Keep shining bright hun.", "officialjovanyoung": "Crabs in a bucket, shame on her", "someoneamaziing": "- yo @sarahshahi. you came for the wrong one! disrespect will not be tolerated.", "tarji_michelle": "Fuck that bitch. She don’t matter. Keep it movin", "chele_mmi": "Shan you already know you are a boss ass woman no matter what a hater says. ol girl was literally saying the SAME shit you had just said .... 🤔 why hate when you can encourage and appreciate another woman? Not a good look lady, whatever her name is", "_no.name88": "You’re a rockstar! I’m sorry that she tried to dim your light. Little does she know she only dimmed hers.", "pricillaaricea": "Even in the face of adversity you remain your best self and inspire me in a new way all over again! I love you much!!!", "transparentrose": "This video just proves to all your fans and everyone who has yet to discover you how AMAZING, BRILLIANT, HUMBLE and STRONG you are. You are more than just cute 🙄 I always joke about wanting to be a sexologist but watching how passionate you are about what you do and the work you put into it just makes me realise that isn't for me but I'd like to be as passionate and hardworking as you in whatever career I get into. I am happy that I stumbled upon you because you're an inspiration and being a sexologist isn't a joke. Everything you do and say resonates with me and if I had money I'd buy your books and gift them to EACH AND EVERY ONE of my friends because I think your book would be a great help to them, you explain sex and relationships in a way everyone can understand and you're so down to earth. The way you articulate and present yourself and try to help people is amazing. You're fierce and I really appreciate what you do.", "stephmilius": "Stay strong!! That’s wild", "misskay808": "That was clearly done from a place of insecurity on her part, no doubt about it. I admire the way you addressed it in this video, you exude confidence and you remained respectful while still owning your space! 🙌🏻 Keep on rocking girl, you deserve it!", "alanapoppins": "Someone who uses you as a come up didn't have much to add in the first place. 💕", "natty.rankiin": "Her actions say less about you and more about her.", "spacialnottingham": "Dr Ruth old as hell, I respect her opinions on sex but they are out dated and how is she a more reliable source on sex. Keep doing your thing don't let hate disrupt you", "isaymarley": "You are amazing ( period )", "hayleydelaine": "Wow... what a disgusting action. She clearly was intimidated by your greatness. Keep doing you!😘💕", "delightfulcocobunny": "@sarahshahi is not that much older than you but she came across as if to be dismissive of your message bc of your age. She basically reiterated your point except with disgust which is just despicable! Because nothing that you said was so far off from the point she was making about marriage! Im just proud that you’re standing up for yourself!!!", "meaghanpeckham": "This is a reflection of her, not you. Don’t let it shake you.", "kellz_freeman": "Who is she? Nothing good comes to haters. Smh", "evg31": "wow", "bodyscapeboudoir": "Shame on them for posting the segment with her and not acknowledging her belittling you. I am glad you made a video regarding it, I loved what you had to say during your portion of the show and your response to this all.", "gabbybeauvais": "Damn right. You stay you & stay true!", "misscrichlow": "Always politely address passive-aggressive behaviour folks. I'm glad you did not let this settle into your spirit ! 💕", "chenaidavid": "They have been/are enough old white women occupying this space, diversity is a must. I relate to your content because you are a young racialized women with great perspectives and knowledge. ❤️", "lily.whyy": "fucking YUCK", "myishia": "She was intimidated and made herself look stupid! Women don’t tear down other women. She didn’t get the memo. Also keep in mind certain mayo patty women are hella threaten when they see beautiful women of Color confident in their sexually classes, brilliant and beautiful. When for so long they thought they had it going on she didn’t know what to do. She can have Dr. Ruth. We have you!!", "whiskeyrebellion": "Well...i support you. I support your profession. I support your will and drive to help others to love freely and safely all while also helping others build that sexual self esteem and learn about consent. I support the safe and educational resources you give on a wide range of topics (sexual education only 1 aspect of the passions you have to share with words.) You do so much and sacrifice so much for no return and should not receive ignorance or laughter for it. Thanks for what you have done! You have helped me and i hope to continue seeing you do your thing! #IGotYourBack #StillGottaOrderYourBook 🌻", "gypsy.frank": "It sounds like @sarahshahi owes you AND the producers of the show an apology.", "mechemill213": "And WHO IS SHE???? There’s always a Becky somewhere 🙄 I think you’re amazing! I love your videos. I think you give some great advice and I really appreciate your openness and candidness when discussing sex & intimacy. Keep doing you! 💕 @shanboody", "faithleeee": "you handled this with such grace. ♥️", "novembers_very_own_89": "♥️♥️♥️♥️", "phreespirit5": "Def says more about her than you. She should have used that same energy to promote herself rather than tear someone else down unnecessarily. Sad.", "tuhmeekahl": "Shit, you ARE cute — and know what you’re talking about too 💁🏽‍♀️. That’s why they mad.", "cairocarrot01": "Love you! Keep doing you!", "lifeofk93": "You are amazing!", "misstiaraxo": "Bitches be hating 😂 I’ve wanted and learned from you for 8+ years, you have nothing but 💎 to drop 🤷🏽‍♀️", "coco_stone87": "You're awesome. 👏🏾👏🏾👏🏾👏🏾", "ohyesitsv": "Dr. Ruth young?!? Did she really say—-girl bye! Shannon! Her trying to minimize what it is that you have to say has nothing to do with and everything to do with her. Keep being amazing, sharing your story and sharing your knowledge.", "equitacosmetics": "Fuck her! I love your advice! When I met you at Vidcon last year. You were representing black women on your panel and also helping all women. Your spirit is awesome! 💕", "thegymselfie": "It’s okay for someone to disagree with you @shanboody . You’re an adult. I’m sure you’ll be fine.", "emerykaye": "Is that dr. Drew in the corner there?", "ellegoosen": "PROUD to learn and take note from the ICON that is you @shanboody", "nikki_nichols": "On one hand, I'm like, \"you shouldn't have to list your resume to prove a point\" and on the other hand I'm like, \"go off, sis! Let 'em know!\" 👏🏾👏🏾👏🏾", "renzyslim": "Girl.... dont be offended by her and her oversized sweater on national television. 🤣This speaks more to her lack of credibility than it does yours👑", "pris.cilla11": "@shanboody 💜People who are insecure are usually the ones to put other people down...it has nothing to do with you ...keep shining your beautiful light!", "thisisdelisha": "We love you. We appreciate your hard work and dedication. I learn a lot from you and you helped me become confident in me. She gained nothing by trying to put you down. Clearly, you were MEANT to be there. Not many of us can say we have been asked to share our platform on national television. With her speaking like that about you only dimmed her light and showed how she’s not truly confident in her own abilities. You handled this well. You always carry yourself with elegance and we support you.", "xladybrown": "You handled this so well Shan! You deserve an apology @sarahshahi", "cherise.mikell": "Your cute but her personality is ugly", "wanderlust_mina": "You are going to shine regardless, we see you. We respect your craft. When others project their own insecurities it is more of a reflection on them than the description they set forth for you. 💜", "ashleemariepreston\nVerified": "Verified", "jenae2.o": "She looks a little older. Older women tend to be this way sometimes. Threatened really", "ness.ess.ity": "If she stopped and listened, maybe she’d realize what you were saying. You’re more than her ignorance", "jupitersttal": "@sho_thelword SO SHE BETTER NOT BE COMING BACK IF THIS IS NOT ADDRESSED.", "connectwithcali": "The fact that she felt like she needed to take any moment out of the time she was allotted to speak about herself and diverting the attention to her completely irrelevant disagreement with your professional opinions and even minimize you with a “she’s cute”! I am just 😤 Just goes to show how insecure and truly intimidated white people are by brilliant POC like yourself. She tried you but I promise the people that matter don’t give a damn about SARAH #typicalwhitegirlname #whitepoepleboreme", "3lijones_": "Beat dat bitch ass 🤠", "charliculture": "Love you Shannon, you’re a real one!!! That says more about her than it does about you or your qualifications. Your excellence continues ❤️ @shanboody", "lyssa_fayee": "You’re exceptional and she knows it", "producergirl4": "So sorry she made you feel this way... 😘", "_klala": "Fuck her!", "tsobis": "Her opinion is so irrelevant! Don’t waste a second more on her! Love you 💕💕", "amystery416": "Ruth sucks", "tokslabossmua": "You rock 🙏🏾✨✨✨", "dom.notdumb": "Jealousy at its finest", "liveshiv": "WhatEVER I want my advice from YOU ♥️🙌🏾", "terinafaye": "Petty. I’ve followed your work for years. You’re on fire right now and brilliant. Thank you for your amazing influence and the impact you continue to make! 🙌🏽🔥", "wifeandwife": "Fuck her!! You’re amazing! I’m trying not to racialize it, But sometimes “they” don’t like seeing black/POC people in authority. She’s jealous of your dominant presence and your excellence. Keep pushin’ 💙", "anray1818": "Sending all of my love to you. ♡", "pretty__perspicacious": "Wow that’s so fucked up.", "fayzeface": "She owes you a huge apology. Not sure if you want us to tag her but I would want to. What she said was extremely condescending and ignorant.", "alexisbelon": "That dead ass stung", "giabueno_": "She wants sex advice from an old hag 😂 Shan don’t even let this bother you, you are more than enough, Morw knowledgeable and have come so far to let this Becky’s attempt to make you feel small do so. Fck her! Keep on shining babe this is your lane and your owning every bit of it!!", "the_akilah": "🇬🇾🇬🇾🇬🇾🇬🇾🇬🇾🇬🇾🇬🇾 I want my sex advise from a GT girl!!! Love your work ❤️", "jenkinsnd11": "I hate that happened to you. Don’t let ppl like that dim your light. You shine like a diamond darlin. Keep doing what you’re doing. ❤️❤️❤️", "love.sassha": "What she did was very foul", "itsthemorgie": "Let no one diminish your accomplishments. Fuck her. She looka like she could use your sex advice... Looks like she has cobwebs......", "ave2noondelite": "Trash humans!! You lit, lit!!!! Anyone thinking otherwise smokes dust. 🤷🏽‍♀️", "raregemiyanna": "What went down was childish! YOUR SO BADASS✨🌻 her views don’t matter & never will 💕", "simplystylish411": "I don’t know how many people have to shame you for your work. And your work is important across the board. However the number doesn’t matter cause you’re still able to do you. 👑", "safaribarbie5": "💯💯💯 you keep doing you boo! You’re admired and respected in your own right ❤️", "_caity_baby_xo": "Shanon you are amazing !! I have followed you for a very long time and I appreciate you! 💕", "labeautyologist": "How To Spot a Hater: 101", "isthatcarmenq": "Wow! I will never understand those women who are so unsatisfied with their lives that they choose to put other women down.", "mellamilan": "Fire sis", "clairelyrics": "Fuck her hating ass", "kiadvs": "COME THROUGH WITH THE CREDENTIALS HONEY 🔥🔥🔥 I’ve been following you for years now and one thing I’ve always admired about you is your ability to to have such composure and grace when others challenge you. You have helped and are helping so many people and continue to inspire and educate others. She ain’t do nothing but give out free press. We ready for this book & we’re ready for all you’re planning next.", "simplysalmin": "“I love her, she’s so cute” right before tearing down a woman has become a common thing women say to try and not look like she’s hating... it’s just not right.", "cnickview": "Girl I’m pissed “your so cute” sis don’t need the approval. You keep on shining girl , and working YOUR LANE ❤️❤️", "alexx_feww": "PROUD OF YOU 💗 you are a queen & I will always looks up to you 💖", "kriziacruz_": "You are great and your light my love outshines this moment! Those of us who have followed you from the beginning know just how much knowledge, expertise and truth comes from you. Keep on shining. We love you!! ❤️⭐️", "taliii_b": "You’re awesome Shan , and I’m excited to ready my second book by you !", "melaniefiona\nVerified": "Verified", "venividiviciiiiiiii": "❤️ love you Shannon 🙌🏽🔥", "candymusicbox": "Dr. Ruth???", "iamjanagomes": "I’m furious for you! It just shows her own ignorance and unintelligence. When I look at you I see all your hard work and academia (I study psych and sexology - it’s intense) she looks at you and sees her own insecurities and feels intimidated by your success and knowledge. Strong women don’t put other women down. ✊🏽", "bianca__kuonqui": "“She’s so cute “ 🥴🥴🥴 does she know WHO THE F*CK YOU ARE ANDDDDDDS YOUR CREDENTIALS ?!!!", "weezywtf": "What a condescending bitch honestly. Can I just say..... I feel like a psychic... because I knew exactly what she would look like? 🙃🙃🙃", "misspells": "Yassssssssss 🙌🏾🙌🏾🙌🏾🙌🏾!!", "influence_the4thkind": "I noticed this for sure! Definitely shows she has no class", "_thesociallight": "This was so triggering because black women experience this everyday at work. I’m so sorry, Shan. You are legit, and enough. & eff her.", "lancegross\nVerified": "Verified", "trish.pogue": "The sad truth is, what she did and how she did it is all a mask to who she really is, that type of behavior, dismissive, disrespectful, demeaning and unkind does not come from people who aren’t dealing with inside issues. Shan, I don’t know you but you’ve stayed true to your journey in trying to help others on many different level of this subject, keep building your empire queen", "kanneella": "So small of her, it's so easy To be negative !!That was ugly!! You did a good job !!! 😍😍 #sisterhoodwin", "nineandnorthco": "Wowwwww are you f’in kidding me??!! anyone who needs to say anything about anyone else who is NOT them in order to make their points seem relevant is already discredited PERIOD!! The fact she even brought you up in HER interview says a lot about HER not you. You are amazing and the fact she felt the need to address you PROVES she thinks you are amazing! Keep making these bitches TALK boo!! 😘😘❤️", "itsnot2pac": "Don’t let em’ get to you, you’re amazing!", "itsmichaele": "It’s really unfortunate how the light of others threatens some. Love your platform, how you’re using it, and even appreciate your truth in sharing your hurt! Hope you move through it swiftly 💛", "theshaqshow": "@sarahshahi here is a video outlining her credentials. Thought you’d wanna watch since you decided to be so flippant in your comments about her. 😘", "nikitinack": "So immature! And the way she diminishes your voice and message by way of remarking on your looks, “she’s cute!” Infuriated on your behalf! 😡 I don’t even know who she is but not gonna give her relevancy by googling her. Keep doing you!!", "thisisaruth": "I got mad respect and love for you Shan ❤️. What that woman did is just flat out rude and disrespectful", "_sweetarianna": "You are an incredible women. Seriously.", "heyitzsarai": "Wow. She’s hella pathetic and that’s what people will do when they have nothing going for them. Tear others down", "j.tureaud": "She wanted relevancy. Life long learners know you can learn from anyone, especially the people who are younger or more relevant. 🤷🏽‍♀️ We're listening for a reason sis... You don't need her permission to be great. ❤️ Lol the nerve.", "brand.nerdnco": "You handled the entire situation like the boss you are.", "i.lsabella": "Ew so annoying how she did that 😒 and super frustrating", "sunchild444": "All too common; good for u for standing up for yourself", "lexy.stephen": "I’m sorry your experiencing this Shan. What was meant to harm you is going to be turned around for your favor💛", "discovering_kay": "how dare she.", "justcallmeag": "Keep pushing, I’m forever in awe of you and the work you do! ✨", "cheicom": "Keep your head up girl 😘😘😘", "iamclerichena": "It says more about her than you.  You have to feel really low and insecure to try to throw others down so you can boost yourself up.  Your work is not for the close minded because the close minded only see the darkness in everything they can’t appreciate your light. Keep shining!", "ashwriight": "She’s really your biggest fan...and also fuck her."}