{"mixxedbreedtoya": "Congratulations 🎉🎊", "_chiquitaperiodt": "Smart and Beautiful 😍", "bibrations": "When I was 15 I wanted to work in the music industry as a photojournalist for my favorite magazines but it always felt out of reach. Now being 25 I realize it isn't. I'm in the beginning stages of building my portfolio and I'm having so much fun. I'm finding my people and I'm finding myself.", "perkigiver": "Dang it! Fine I'll go! 😆 Congratulations 🎉", "karenmichellle": "🙌🏼🙌🏼🙌🏼🙌🏼", "xian8524": "You can do it. I got my Masters in 2015, 20 years after my Bachelors. I am thinking about getting a PhD, and I am nearing 50. Never too late!", "reemalhajri.design": "♥️♥️♥️♥️♥️♥️💪✨", "diidie_k": "and you're your damn beautyself like always daang! That is so amazing for you. Good luck with all of it <3", "_1blakeg": "Congratulations 🙏🏾🤩", "project_eighty_nine": "D.O.P.E💯", "tifftherealtrainer": "Intentions 🔥", "adannelove": "🙌🏽🙌🏽🙌🏽🙌🏽", "martoinne": "SO GOOD! @rheamonetwilliams", "onna_lifestyle": "🙌🏻🙌🏻🙌🏻🙌🏻", "welcometomyigaccount": "Congratulations!", "bri_crawford_": ".", "o.gfinesse": "Keep on being great", "cherrelleskeete": "Wow congratulations. *when you have to take your own advice 💕", "maxence1992": "Beautiful women", "natthefitceo": "Love this hair style and look on you so much! 😍", "its_mafiamamii": "Lemme get a tutorial on this hair style sis 😩", "xonadroj": "I’d love to know what classes you enrolled in. I’m actually enrolled there too for the fall in Human Development as well!", "lilcocopuff": "definitely needed to see this", "reese51592": "WOW🤔😍", "maxprofit_faceboys": "👌🏾😎", "bae_kei": "This is the nudge I needed in my life!! You are soooo inspiring, follower från Sweden! 🙈❤️", "winnieharlow\nVerified": "Verified", "yayitscia": "I just bought the book!! So excited to read and excited for your schooling!! Thanks for being so dope!!", "localsouthasianrani": "YOU'RE GOING TO SUNYXKTDTISTISTISTUARIS CONGRATULATIONS MA'AM", "teebry132": "Good luck!!! I just received my BA in Cultural Studies this spring semester", "heytayloritchie": "You are such an inspiration 🙏🏽", "flyinhd": "👏🏾👏🏾👏🏾", "calmercazi": "Congrats!", "ziineb__": "Amazing love it!!❤️ Also love the necklace you are wearing. Where did you buy it?😊", "kaylamarieto": "👏🏽👏🏽", "songosongs": "Congratulations! I hope your bachelor's program is informative and helps you futher achieve your goals. 😊 #KnowledgeIsPower #WomenInStem", "jazzyforsure": "Yes!!! Congrats to you! All that hard work paid off💕💕", "lilangelito17": "I'm young, but I love learning new things, and you have really helped me learn so much. Thank you for being you and just trying to teach everyone and empower💛💛💛💛💛", "truegoddess_queen4ever": "I’m in my internship for research in San Francisco you never know you might want to do research :) @shanboody", "__briiaannnnaa__": "It’s so inspiring that someone can be this beautiful mentally, emotionally and physically! Thank you for what you do🙏🏼💞", "officialjovanyoung": "Is Human development another word for self development? Either way it’s a very good look 👊🏾👊🏾👊🏾", "mawhns": "You are such an inspiration to all of us! Always striving to better yourself - keep up the good work! You are doing amazing🔥😍", "heshandsome____": "🔥", "jhenellehill": "Congratulations beauty , brains & booody!!!!!🔥🔥🔥🔥", "msginger2013": "Congratulations", "biancalavernejones": "That's fire! Keep the faith! ❤️❤️❤️❤️❤️🔥🔥🔥🔥🔥🔥🔥🔥🔥❤️❤️❤️❤️❤️🔥🔥🔥🔥 #SUNY (PURCHASE Alum here)", "serati_sa": "I also want to go back to school! Congratulations xx", "belle_femme__bouclee": "Your definition of success is spot on. Exactly how I feel", "serenity_scorpion": "Congrats on new beginnings and on a successful start on your degree", "_nattyp": "You are so so so stunning!!! #goals You are one amazing lady!!!❤️", "chandlernwilson\nVerified": "Verified", "cocolicious35": "Congratulations!!🍾", "kendranewt": "Congrats, amazing achievement!", "shibbybacon": "Shiiiid, I feel the same way about going to get my Masters. Congrats on taking the leap!", "sarahfpo": "Those pants 😍", "thisisseanniece": "You went to Coppin?!?!?!? Ayyyye. And congrats", "izthath3r": "@itsmo2", "aka__alika": "This was everything to me in this moment thank you!", "rubenarana": "Whaaaaaa??!!? I taught at coppin 2005-2008...I know you probably don’t remember me, we met at April Butchers event in Vegas a few years ago. Congratulations!!!", "esthervlessing": "I’m sooooooo proud of you!!!! 🙌🏼🙌🏼🙌🏼", "__nadsz": "🙌🏽🙌🏽🙌🏽🙌🏽", "robinsonmb7": "Congrats!! Thanks for keep pushing forward!", "_sammylou": "You’re killing the game Shan! ❤️", "iamtwuan": "🔥", "renewedmission": "Congrats love!", "horchatahoneyy": "IM SO HAPPY & PROUD OF YOU :') ✨💓", "keepitkosherr": "This is lovely!", "nnekaxoxo": "Thank you so much for sharing this!", "lyzalittle": "the timing of this post.... 🙌🏽😭", "eman\nVerified": "Verified", "ayanapatri": "You’re going to love it!!!! That it was I majored in!!!!", "laurienohotea": "🤩🤩🤩🤩🤩", "roraskighs": "Congrats @shanboody you deserve that and much more", "jjlc_photography": "Just wow. I saw you video. I can't believe Sarah and those ridiculous comments. She's limited comments on her page😒. I support you and think you're an awesome, accomplished, intelligent, woman who gives great advice ✨💜", "channiee_lu": "MAJOR", "chillexmydude": "Congratulations ❤️", "ms.shanelleh": "I’m so proud of you yayyyyyy @shanboody you are truly incredible ♥️", "shelly5511": "I’m a fairly new student back @sunyempire after almost 20 years out of school, and I absolutely love it! You will too! Best decision I made was to go back, even at 36! Good luck to you 👊🏻", "neleiva": "Where is the rest of this video??", "lilyauguste": "Yay!!", "taylor_made70": "Inspiring...was definitely something in this for me thanks", "zenobia.simmons": "That's awesome news! Congratulations!", "fantaszee": "🤗", "dominiquemckinsley": "B A L T I M OR E 😍", "_ro_kelly_": "Congrats @shanboody! I’ll be graduating with a bachelor of science in Human Development and a minor in Psychology next May", "alyana_b": "🙌🏾🙌🏾🙌🏾", "baywatch_without_boobs": "Bravooo👏", "_atiyya_": "New friend here. Can KNOT stop watching your videos since finding you on the Friend Zone Podcast. You affirm and so eloquently discuss such resonating issues with daring vulnerability! I am always enlightened and in love with myself just a little more after you share. I’m rooting for you, and Jared too!", "depthgod": "👏🏽👏🏽🖤", "its.jori.jackson": "SHANNNNN😍✨✨✨✨💙💙💙💙💙💙💙💙", "jasmillmelisa": "Aww congratulations ✨✨✨ youre so bomb and so inspiring! I love seeing your growth 💙💙💙", "numberonecrushh": "Omgggg ur IUD necklace is EVERYTHING I love it so much @shanboody 💕💕💕💕", "dameluuzz": "Yasssssssss HD majors are the bomb!!", "nataliesoutlet\nVerified": "Verified", "encouragedwithivie": "Yay! Congrats!😊💛", "aaliyahqueenbey": "CONGRATULATIONS 🎉🎊❤️❤️❤️❤️❤️❤️❤️❤️❤️ love you so much 😍😍😍😍🥰🥰🥰🥰", "hpdeloach4": "🔥👏 🙌 Hell yes! Congratulations 🎉 🍾Excited for you and thank you for sharing and being an inspiration!", "shameless_a": "Omg I will have my B.S. in Human Development in December from Michigan State! I want to be a FLE focusing on the Human Sexuality content area ! ❤️", "glasseskeysphone": "Come on over to the city den!!!! 👏🏽", "allthingsvikki": "❤️❤️❤️", "possiblyeccentric": "Man, this hit me hard. Thank you for this. I’m starting a bachelors degree this fall too and the fear of failing is sooo real.", "mrdabney": "🙌🏽🙌🏽🙌🏽 Ayyyyy!", "liv3_2_dance": "Yas congrats from an old Coppinite !!!", "ultimate.educator": "🙌🙌🙌🙌🙌omg YASSSSSS #3 Go shannon, I am BEYOND proud of you. And congratulations on these major wins and major self investments into yourself as well as the your ripple effect. #1 sign of a good woman is: when she shines, so does everyone around her. Thanks for sharing your light, love, openness, and honesty with us. We love you with that same intensity. I personally speak as a 4 year fan. I found your videos at a time in my life where I had just started going to therapy and was finally ready to open up and learn about sex, but I wanted to learn about it from a psychological perspective. I did this in order to change the narrative in my head from sex being malicious to sex can be healthy and healing even. Not to be too long winded, but your videos were everything and MORE. Thank you Shan, viewing your channel has changed my life in unimaginable and in ways that I once perceived as insurmountable. Even if you aren't sure all the time of this fact, just know that you are ACTIVELY changing lives all the time. I love your style in which you deliver information, because it is a true testament to the depth of your knowledge. Whenever you are able to take complicated psychological terms, theories, and processes and break then down into relatable terms, you know this is your calling, your field, and where you feel most confident. In summation, I am so grateful to have found you. 💗💗💗", "keyappeal": "I really want to meet you one day 🙏🏽❤️", "katcunning\nVerified": "Verified", "_shellynatikigraves_": "I will be returning to school no later than 2022, I totally get that burning desire, congrats on this manifestation!", "__ana_patricia": "Yasssss girl 👏👏👏 we both are starting out fall semester ✨✨✨", "srhxhnrqs": "I needed this 💕", "v.aiin": "Trying to do the same 🤗", "keishacharmaine": "Shoutouts to you for choosing a SUNY school! I went to a SUNY, UAlbany 💕💕💕", "daniellelovelightmckinney": "Congrats, you got this! 👏🏽🙏🏾❤️", "tomiwarhoda": "I’m terrified to start the process of going back for my masters. I feel frozen and stuck, and I just had my 25th birthday reminding me that time is passing and I’m not closer to that goal. Maybe this post will help...", "melaniefiona\nVerified": "Verified", "claudiamedway": "Honestly, you’re just the damn fucking best.", "officialanaisforreal": "I returned to get my BA as an adult graduated with a 9 month old and returned again when he was 9 to get my Master’s. I am finally in a position where I’m no longer questioned about my credentials. Keep on pushing and keep on putting folks in their place that need it. * Had a typo in the previous post. Can’t be talking about a Master’s with typos in my shit. 😂😂😂", "djjasonchambers": "Congrats", "_blavii": "Love this ❤️", "tore.williams": "Congrats", "yoyo_74": "I'm a suny empire alum. You will accomplish all that you set out! Congrats sis", "juwonadenise": "I feel personally attacked 😂😂😂 that was me I had to learn to love myself enough to try and love myself enough to know that it’s ok to fail.", "eromihc": "❤️❤️💃💃", "_whattheslut_": "Amazing @shanboody!!! I’m a big proponent of post-secondary education and am always impressed by your knowledge and expertise! Hoping to go back to school as well to do a masters one day...⚡️", "titimarquis_": "Congrats! Very inspiring and keep up the great work 😊🎉", "destineealicia": "YOU STAY INSPIRING ME! I can’t wait to meet you when you come to Toronto 😩🖤✨", "ms.dianamaria": "That's why I went back after I became unemployed. And now I am almost done with Masters in leadership and mgmt. Check out Wgu.edu. cost efficient and terms are every 6 months and based on competency.😊 Good Luck.", "antoinettehardie": "I’ve always wanted to start acting and creating my own original content. The fear of failure is real 🙄", "itsjosheats": "YAS never stop learning!!! This is super encouraging! Thank you Shannon!", "simod_bond": "And just like that I got an injection of faith.", "azteca_deluna": "😍😍😍", "sbarber_28": "@kaguilar37 she is so dope", "michaelray6767": "🔥🔥🔥❤️❤️❤️😍😍😍", "iamkenyam_": "Yayyyyy you’re moving to NY?! We welcome you. Congratulations 🎉🍾I’ve looked up to you for so many years, especially being that we’re in the same line of work (I’m pursuing sexology now) so to see this it’s so inspiring. I wish you nothing but joy and success on your new ventures and i can’t wait to meet you at your NY Book Launch Event.", "juliajmarroquin": "Are you from Baltimore?!", "kietacolston_": "Congratulations. I know you are going to crush this goal and get that degree. You got this", "_humble.me_": "I am so proud of you; seeing you bloom from the very beginning. I watched your recent YouTube video and I appreciate you for setting the record—which for some is very brave to do. It’s so important you continue to pave the way for us black and brown educated women especially in this field—we have every right to be taken just as seriously and to occupy space and educate others just as much as anyone else. Congratulations and much success to you! @shanboody", "antonio_king32": "Black girls STAY gettin degrees. 😂😂 Congrats!!!!!!", "ashleighdiosa": "This is so exciting! So proud of you!!! ❤️", "matthewballew": "✨ Congrats!!!", "m.i.a.m.i_": "Congrats boo", "i_am_king__": "🙌🏽🙌🏽🙌🏽🙌🏽", "adriannaexplainsitall": "@shanboody I’m enrolled in the exact same program @ESC! I’m so happy for you boo! I went back recently too! Amazing college!", "marsha.jeune": "Proud of you💜", "xorejeane_": "Dope !👏🏽", "hellonecole\nVerified": "Verified", "thejasminebperspective": "Congrats!!", "tabiacharles": "Yassss girl!!! Keep stacking on those achievements. I'm so proud of you!", "blackgirlsaregod": "I just got chills fuck I love you", "helenalibang": "I’m so proud of you! Seeing you do your best and pursue what you want is so inspiring! You are my role model! 🙌🏽❤️💋", "ms.nekki.nek": "You are so bomb like really.", "ashilaire": "Congratulations!!! You will do amazing!!!", "bossladyamerley": "So true that people fear to fail and i always try to use that feeling to push myself to the best me. If i fail at least i tried and it now i know it wasn‘t for me. 👌🏽", "courtmoves": "Thank you for being you, aaannnnddd giving me the continuous inspiration and push!!! You're beyond amazing and it's beautiful to keep watching you fulfill all your desires!!!🔥🔥💕💕", "edwardistheman": "Congratulations 🎉 @shanboody", "woodmother": "I was gonna go to that school but never mind enjoy sis", "niya.jpg": "Damn Shan! Here you go, inspiring us again! 👏🏾👏🏾💕", "chantel_riley\nVerified": "Verified", "goodmoms_badchoices": "🙌🏾", "khalalaht": "I’m so excited for you! 🎉😊Our feelings towards school are the same. This has sat inside me for far too long, THANK YOU once again for being an inspiration. All the time that has passed has prepared you for this next step! You got this!!! 🎉💕😊", "itsteesavagee": "Proud of you mama . You continue to inspire me . Good luck on your future endeavors . You got this 💚", "justjenny00": "Congrats @shanboody 🎉🎉 it’s great to see you on this journey! Very inspirational!💪🏾", "ll_cool_rey": "You look like you're made outta butterscotch and Magic 💯💞", "herstory85": "Ok Maryland roots!! Just got Amazon notification that book is on the way! Yay", "dujorrr": "Damn... I was JUST thinking about going to get my Masters before seeing this post... I’ll take it as a sign. Back to school I go 🙃😭", "dlpendley": "Congrats. I am finishing up getting my Associates in Business Administration, and starting fall at Texas A&M University San Antonio", "aliyah221b": "How are you so beautiful", "ldr101": "Wow I love this, you’re so inspiring. I wish I could get this depression and anxiety together and be as brave as you 😫 one day I hope!🤞💕", "thekat97": "ooo hail ya", "brownkids": "Inspired! 🙌🏾🙌🏾🙌🏾", "sunnismilez": "Good for you Shan! Congratulations", "eden_skye_29": "Woohoo! Another SUNY student! @shanboody", "briannepatrice": "👏🏽👏🏽👏🏽 yes babe!", "glographics\nVerified": "Verified", "swslbear": "YESSS👏🔥💋💕🔥💋😍🎉", "jilljgalbraith": "CONGRATULATIONS", "abio_007": "Congratulations beautiful, you'll do great!", "rochellealessandra": "Congratulations🎉🎉🙂", "angelilia_007": "Can you please please help me? I'm really desperate and idk who to go to. Is there any way I could contact you? I can't talk with anyone about this. Please", "doomdada5": "Shan you inspire me sooooo much. Love you. Thank you.", "tminardi2": "I love this so much. Describes everything I'm feeling. I'm gonna make my photography page public. And you know what :) I'm gonna go get myself a graphic design degree and stop making excuses. ❤️ I needed this Shan. Thank you", "kenyaonhair": "I love you, Shan. Thank you for always sharing yourself with us. Giving me courage to show up for myself every time.", "shesfuckinweird": "You’re such an inspiration. I have always felt so insecure about going back to school (I’ve done the college run about 5 times and still haven’t walked out with a degree due to some pretty tough family issues throughout the years) and I’ve been wanting to go back. Haven’t quite decided what I want to go back for is the only thing stopping me. How did you decide what you wanted to go back for? Or have you always known what you wanted to study?", "seanriggins": "@shanboody Where can we see the rest of this video?", "uniique678": "CONGRATULATIONS!!!!!!!!!", "lydiatekle": "Proud of you!!", "relaxin_v": "Awesomeness 👌", "__anomaly": "Woooo @shanboody, yes! I constantly say I’m afraid of success but you hit it right on the head. I’m mainly afraid of finding out that it’s all a sham and that I’m terrible at what I’m trying to build my life around. That’s some deep seeded fear right there sis. Congratulations to you for looking fear in the face and saying “excuse me, I got shit to accomplish.” I’m doing my best in this area and I’d love it if you read my post called “What are you waiting for?” on my blog (it’s in my bio). I had a long overdue conversation with fear and this post of yours is SO timely for me. All is in alignment ✨ I love your insight, wishing you all the light and success! ✨", "chloe.hakim.moore": "You’re incredible. ✨ Cheers to you!!", "_lockandki": "Are you doing all your courses online or commuting back and forth ?", "dev_b4": "Congratulations!!", "mizz_evez": "Wonderful woman. 💓💓💓", "ohcherfulday": "GOO SHAN!!! Much love and respect 💓✨✨✊🏻", "watcherica": "Yaaas! congrats. Keep inspiring. I’ve been debating whether or not I want to go back to school part time. You may have given me the extra push I needed.", "smilebklyn": "😭😭😭 You’ve got me crying!! So proud of you Shan!! You’ve got this! 💙", "lawand.pravin": "👌👌👌👌👌👌", "msgloryg": "Are you moving to Albany?", "bri.yona": "Yesssss 🙌🏾🙌🏾🙌🏾", "essslora": "Congratulations love!!!", "brittneymariah.official": "Congratulations! And aww you were a Coppin Eagle 💕 I work in the College of Behavioral and Social Sciences. Once a Coppin Eagle, always a Coppin Eagle. Congrats sweetheart!!!! ❤️", "1boroboy": "So beautiful and so down to earth! In the middle of a slightly broken society and the ugly way people treat each other in general, its very refreshing too see people who genuinely care about helping others and sharing knowledge.😍🤘😍", "peejay_esthetics": "You are absolutely gorgeous and an amazing woman! You are such an inspiration @shanboody ❤️👌", "morphine_fashion": "Wow love it 😍, you should visit my fashion brand account, it's definitely your style 🔝🤩", "_brehunna": "Does this mean you’re moving to New York 😍", "danidevito__": "Oh wow you were enrolled at Coppin?! I graduated from Towson 🔥💕", "justinerebekah": "@shanboody moving to Saratoga?", "__perfect__imperfection27": "💙👏🏽👏🏽👏🏽", "consciousbeautbykristen": "🔥", "izienovbiagele": "👏🏾👏🏾👏🏾👏🏾👏🏾 Good for you Queen!!!!!!!!!! #FORWARD 🙌🏾", "khimburlee": "I love this and I love you", "shandn.e": "I remember this video and all the times u mentioned going back to uni. Congratulations on all that you’ve done and keep doing!!! 🎉", "jungle_hair": "Wow. I would’ve thought you were going to school for a doctorates. It seems like your videos are research that you’ve conducted for a doctorate. Go Shan!!!!🙏🏾", "neshacc": "Congratulations. I love your videos you got this. 👏👏👏👏❤️", "koboei": "Congrats !", "melaboricua": "I’m so excited for you!!! You are doing the damn thing !! I’m also excited that now we can share the pain of studying, papers etc together lol. But all worth it. Side note: I keep checking my order status for the book. I can’t wait much longer 😩😩 lol. Congrats !! ❤️❤️", "alluretrends": "Congratulations", "chachi7043": "@_lui05", "aquagem17": "Do I love those pants you have on!! Where did you get them??", "desihookeddesigns": "I want to finish writing my book I've been writing for idk 8 years now but somehow i never think its good enough. 🤞", "frecklesmedicineandbooks": "I needed this. @pattygirl135", "shiba_loverrr": "Welcome to the Fam!!!!!!! You’ll connect with some incredible people", "simrynkaur": "👏🏼👏🏼🙌🏼🙌🏼🙌🏼💃🏻", "kellyevilgenius": "Congratulations now we should so much luck and success with your college career", "mynameisngozi": "Love it! Do your thing, girl! Keep living up on yourself, (future, past & present) and feed your soul with accomplished goals 🙏🏾", "diversityinbeauty": "Your post are always so on point. Congratulations on continuing to elevate yourself and standing out of your on way! The nudge I’ve been feeling lately is to go full throttle with my platform and make it as big as possible! I’m also strongly being pulled to get my cosmetology license AND THEN get my masters from Howard University (which means I’d have to leave L.A. for 2 years but I’ve also had this nudge to explore the East Coast:). Thank you again for showing us that we can achieve anything we want 🙌🏾", "tameikat": "👏🏾👏🏾👏🏾", "enjoyjaredbrady": "So proud of you ! Watching you blossom in this time is such a treat. I love you. ❤️", "doctor.sunk": "Amazing!💪💓🌼", "blue_ochosi": "🙌 So excited for you! Congrats..and enjoy the journey", "jenniferpmarques": "❤️❤️❤️❤️❤️ We are all so proud of you girl❤️❤️❤️❤️❤️", "malpaula": "YESSS", "tommiegun602": "Looks like a prettier version on if Ayesha curry had a lil sis 😏🔥", "motherhood.unmastered": "congratulations mama! Go on with ya bad ass degreeed self🥇💛", "jacquemarqu": "Congratulations Shan! Wishing you nothing but success 🙏🏻", "micheleaudish": "That’s great!", "suny\nVerified": "Verified", "mrcoven": "This is absolutely amazing! It’s never too lat to jump back in, and with the added experience and wisdom you’ll crush it. If you need help paying for it, or just want to avoid loans, I run @scholarshipjunkies a non profit focused on helping you find, apply to, and win scholarships! I’d love to help! DMs here and there are open! You got this!!! 🙌🏾", "cortneydaniellemoore": "This is super awesome. Congratulations! 🍾 I recently started going back to school to hopefully move my career along. I’ve put it off for a few years, but I guess 2019 is the year of elevation. 🙏🏽", "itsjaybabes": "You inspire me. ❤️", "imanibrammer": "Zaaaaammmnnnnn Mami you just stacked upppp 😍😍😍😍", "dream_piixii": "Yaassss girl!! Congrats!!👏👏💪💪💪🔥🔥", "devsamone": "Congratulations!!", "jenova_juliann": "YES Shan!!!! You go girl!!!", "mayasworld\nVerified": "Verified", "deespeaks_": "🙌🏾 Congratulations!!!", "mercedes.munn": "👏🏾👏🏾👏🏾👏🏾👏🏾", "la.today": "LOve youuuu 💕💕💕💕", "ear2ear": "👏👏👏👏", "untapyourpotential": "You are amazing 🤗😍", "normalight18": "Congrats!!!", "yelenarleigh": "Goooooo Shannnnnnn💖", "only_up_from_here": "Congratulations for pushing yourself to take this next big step.", "angel.co.uk": "Congratulations💯", "kellitrebicka": "Love this so much!Congratulations Shan!❤️", "n.nikita.rabon": "Congrats 🎊🎈🎉 Queen 👑!! I’m so proud of you for stepping out and handling business. I did the same thing and I’m starting school next month to get my bachelor degree. I have always wanted to pursue this dream and now I finally am. Keep setting those goals and achieving your dreams 🙌🏽👏🏽👏🏽", "nishaluvscoffee": "Love you! Congrats! Book comes tomorrow!!!!❤️❤️❤️", "iamstephsimone": "So dope! Congrats 🙏🏽"}