{"justrosalynnn": "I'm buying it asap!", "heylissamonet": "Happy book birthday! Adding this one to the collection STAT!!!", "ajeaniahealthtea": "Good morning Beautiful, this right Here is nothing less than 🔥 You nailed it🎯📸", "james_earljones00": "Congratulations", "allthingsang": "You are like a real world Carrie Bradshaw from Sex and the City, I love it ❤️", "katinachimney": "Got my book in the mail this week...yay! I pre-ordered but couldn’t get the freebies on your site. Are they still available...say yes!!!", "smoovepapito": "🍬🍯❄️🍵", "danielale8": "Can anyone tell me where to buy the book in person?! I checked Barnes & Noble and no luck 😭", "jessesforeveryoung": "I just ordered your the book, I can't wait to read it!!!", "powerofkay": "I preordered the minute you posted about the book....i should have got it in july and i still havent. I have 3weeks left of my masters so rn looking into this isnt priority...but i cant wait to see where my book is, get it and do all the extra stuff youve added to it. (Im uk based) i preordered from amazon", "ronitcohn": "Congrats my love! I know this has been a long time coming. I’m gonna get mine today! 👏👏👏", "ashuraaaaaaa": "@jasminerussellll @ymanisedona can we start a long distance book club !? I love Shans YouTube and I feel like her book is probably amazing! It also comes with a secret podcast 💕", "_tara_j_": "@papiii_chul0", "shari.mf": "Just got my book! Can’t wait !!", "mouasuneta": "@bejulep the book I’m talking about 🤗", "jazzzy.jayy": "@nikki_1217", "sweetestthinguknow": "This one @dominique.dawnelle", "gareth.m.thomas": "I walk around with cum in my pants all the time", "heeths.monrae": "@queen_ethel1203", "mlresquire": "@cali_it_is3", "chels.bells": "@jordyyy.02 😍", "ekiuwa1": "Funny cuz when I met Shaquille for the 1st time I did what Anna did... Locked eyes and flashed a smile! Works like a charm 😉", "empressgoddessking": "Congratulations", "iambeautifulchaos": "Are you the voice of the audiobook?", "zoevikstrom": "Hi Shan! I was wondering if your book includes any advice about queer relationships or mentions of queer couples. Thank you!!", "kangaimwiti": "Don't know if you'll see this Shan but I preordered your book months ago. I'm a huge fan and have been for years- I absolutely love what you do and how you do it, especially your passion for teaching and giving your knowledge away. You definitely need a book tour- in Kenya!!!! Love you- keep up the excellent work!! Ama je @thespreadpod? 😁😁", "tierneycelina": "@marandarenee28", "iamtwuan": "🔥", "cristobolatk": "Hi Shan, can't wait to get me a copy. I hope it's available at the Airport in Atlanta.", "risinggoddess999": "Is there anything in your book for gay/lesbian women? Or is it all from a heteronormative perspective?", "reydidit": "Ok. I'll buy the book!", "cynthiacovello": "I'm so proud of you. I've been watching your content for a while now and you've honestly earned this. You've inspired me to really take control of what I want out of love and relationships and I've grown so much as a woman because of you. Thank you, thank you , thank you ! A million times ! & Congratulations ♥️♥️ - love from Toronto 😜", "courtvox": "Congrats Shannon!", "sabinastyle.au": "Sending love to you!!! ❤️❤️❤️❤️", "rei.lo": "@noalie_xoxo this is a neat tip to keep in mind 😛", "thevibesetter": "🔺Oh yeah u Snapped on this", "jayannahsimone": "Damn Shan🔥", "gilly": "Congratulations!!!", "_skamlikely_": "I’m so happy you gave us a sneak peek. Now I know I need it 😇😊", "annitaabdelsayed": "@amelamcmanus", "streisandnicole": "Finally! I’ve took all the quizzes and have been sending links to everyone I know! I can’t wait to go pick this up from the bookstore on my campus! Congratulations!! 🥂❤️", "daniellelovelightmckinney": "❤️❤️❤️", "taiylarmade": "You marketed tf outta this book Shan! If Harper Collins don’t increase the bag I’ll be to them on Monday (I really will I work in publishing and I have a meeting there Monday lmaoooo)", "raeshelikes2move": "I ordered my book Monday #preordergang🔥", "rebeccacorrinne": "You. Are. A. QUEEN! Purchased💕", "turrarae": "*trey songz voice* I’m abouta DIVE INNNNN", "mayasworld\nVerified": "Verified", "starofmyownlife": "Congrats!! I’m waiting on mine to arrive on tomorrow. I can’t wait to start reading so I can get this love life of mine together. Loved you on The Friend Zone and WHOREible Decisions 😍🥰.", "erykadrodriguez": "Bought the audio just now! Can’t wait to listen.", "ms.crissyj": "Congrats gyal! More than deserved. 😉", "livingsoulplete": "🙌🏾", "shacora95": "Damn after reading this I need this book", "k_studd": "Girl! This book is so good 🙌🏽", "__missana": "I NEEEEEEEED🤗", "nallyberry": "Just ordered your book! Just wondering if you’d ever consider writing anything about open relationships? Love your YouTube videos about that topic and I find it’s hard to find modern day resources in that area; it’s so comforting to hear you bring up a lot of those unspoken challenges :)", "iamredofficial": "Congratulations on the book @shanboody keep moving forward", "makeupbymardy": "Mine was delivered today. About to start reading it...so excited. Congratulations! ❤️", "meetmacy": "just got my copy in the mail", "kahya_mc": "Okayyyy 👏🏾 I gotta read @niamc_ @goldenjem", "adriannacosta\nVerified": "Verified", "ashleemariepreston\nVerified": "Verified", "spirituallyamber": "I was waiting for my library to get this, but F it, I'll buy it my next pay day! 😩👏🏾❤️", "chidoll87": "Listening to your book now!", "jaz.nn": "I can’t wait to read this book ❤️❤️✨", "bonitaantoinette": "Dope !!!", "_lleexxii2": "Queen", "cj_cupcakediva": "Literally just got mine...thrown at my door...but that's neither here nor there... Can't wait to read it!❤", "sorelleamore\nVerified": "Verified", "mortonthemartian": "Congratulations on the drop, can’t wait to read it🔥", "jaywinterr": "My copy is coming tomorrow.", "kbrowniie": "Congratulations 🙌🏾☺️ so excited for you and I can’t wait to start reading 😃", "halm11": "Hello Shannon! I really need your help. How can I reach out yo you? There is a topic that you never talked about and I watched all your videos! I need some answers please and i think you have them", "santanaabananaa": "I pre ordered weeks ago on Apple and nothing happened today so I went back and brought it. Nothing will stop me!", "aprilmarietoo": "Downloading to my Kindle right now.", "alizakelly\nVerified": "Verified", "michellecgranados": "Saw this post and went ahead and bought it 🙌🏽🙌🏽 can’t wait till the 25th ❤️", "michael_egbert": "Congrats Shan! Can’t wait to read it!", "poeticallyj": "Dayum. Makes so much sense. 😩", "kagamizen": "Congrats", "camilagiovannaa": "Dope 🧐", "ercinozunturk_\nVerified": "Verified", "kiagcnl": "Got it !!! Excited to read", "hilbigamatisv8": "Awesome", "syd.ali323": "First thing I did this morning was purchase this book 💕", "meundies\nVerified": "Verified", "stevieboebi\nVerified": "Verified", "lavidayg": "So PROUD🔥🇬🇾", "iam_just_anna": "Is it on audible?", "taj.oh": "Yesss 🙌🏾🙌🏾", "nette_clarke\nVerified": "Verified", "iammarilynalexis": "INCREDIBLE"}