{"_diella_": "@keenanjansen_na", "sarahe.fulmer": "@lisaamoniz @may_espinal I love her 😭😭🧡🧡", "veganjourneytolife": "🐉🐉🐉", "hassanibee": "I finally felt focused + motivated to pick up the book today + I had to immediately snoop + see once I got to the page because I never noticed lol. I love that as soon as I spotted it, it’s mentioned in the caption. Side note, I can’t put the book down + you have all the wheels in my head turning. Definitely has me breaking down a lot of things in divine timing. Thank you for your gift, expertise + being one of the best things on this planet, in my opinion, a healer💚", "deeperthanpoetry": "GORGEOUS eyes madame", "_soniamonique": "@valenzuelalili", "sunz19": "@yassizm", "bambola91": "What’s the name of the book?", "pastelpink.ca": "💘💘💘", "kee.sey": "@my_karona first this lady rocks. Second, glad you found your forever spikey legs kinda love.", "tegodecaprio": "In any relationship ive every been in ❤️❤️❤️ and the support she gives me in following my dreams and pursing my goals in undeniable 🔥🔥🔥", "faeriesandfanta": "@bodybykamoni you got me hooked on this woman!!! I love her", "lolohnah": "@your_favorite_esti 🙏🏾", "voicu.ralu": "@ovidiubog", "denicemariee": "😭😭😭", "faith_teresa": "I haven't gotten the book but I want it 🌹❤️", "brainsbeautyandfinances": "@the_erviar._", "mzzmimilet": "@j_litman63 thank you for accepting my spiky legs 😂😘", "jeweloftheaisle": "❤️❤️❤️❤️", "chelseajayden": "@roslyntait", "hoosierontherun": "Oh my ur make up! A1!", "wandastrickfaden_art": "Being loved. Y someone else is a reflection of how you love yourself. Especially when they love is pure. So yes, it makes total sense.❤️", "delfina_eva": "@mkiely913 the end lol 😂", "thediaryofagoddess": "Love youuuuu😍♥️", "_chrissytay_": "Honestly I'm just waiting til I get paid and as soon as I do I'm purchasing a copy of you book (so excited to annotate it and really use it to learn about life, relationships, and myself) I've fallen in love with your ability to speak so concisely and I love the feeling when you say something and it just clicks with me. You know how to put into words so many of my questions and thoughts that I have not only about relationships and sex, but just life as a whole. So excited to support you and support myself with your new book! ❤", "heyrebecka": "👀 👀 🐉 love the book!", "mrssharpe3rd": "\"Spikey legs\" love 💝", "alexdaurizio": "@2lue_g ❤️", "tikeafierce": "Love this and it’s sooooo true! 🔥❤️", "ashaalogy": "💕💕💕", "esperanzaakaelhom": "👁️👁️ ❗❗Loving the audiobook, Shan 💖", "fab_being_fab": "❤️❤️❤️❤️❤️❤️❤️ The honesty", "pri025": "@hoysebrendaa ♥️", "_almightybonnie": "I see no lie 🔥😍❤️💪💪💪", "maddy_lee2": "@shanboody Where can I get the audiobook and what is it called? ❤️", "abeauty_queenn": "@thomas_rockcliff ❤️", "willmederski": "@xennamw - love our love, love. 💞", "cousinshaqxx": "Did everything I had to do to uplift her. Put her on the highest pedestal. She didn’t have any insecurities anymore because I always use to tell her how beautiful she was just the way she was . Told her she never needed validation from anyone. You’re amazing.After all that ,I still got dumped .Now I’m hurting and she’s happy . I hate love", "thewesleymadison": "Ahhhh I get what you meant by “lie” now😂 👀", "his.cold.eyes99": "Aww wow that's very touching. I'ma check it out", "grace.labby": "This is how my man loves me. Felt this on a deep level ♥️♥️", "jieflowers": "Your legs are always smooth", "me_clermont": "@valerieepc", "thegardnergirl": "This is my new favorite follow @jordanosaurr", "mzdee2019": "❤️❤️❤️", "slowjamphilly": "@luxlexx", "tahli2001": "@toriarna_fagg ❤️💋", "yours_selfish": "Is the book available in French yet ?", "teenytimber": "♥️♥️", "shaywinters": "I dont get it. Is she happy or sad? 😟 someone?", "brownskindevil": "Man! This made me emotional @_itsmizzkayyy", "frankhmbs": "❤️❤️❤️", "whatsupmaraofficial": "👀💚", "iamtwuan": "🔥", "xhavija": "Girl you are amazing! 🙌 just started following you and I can't wait to get your book! 😊", "kruto.beats": "Dam Bea where have you been all my life???😍😍😍🌶️👅😘", "ricanlitebrite": "😉", "thatco0lchick": "💛💛💛", "unbalance_world": "@abee592", "amberxregina": "@leahnardo_", "jas.jeter": "👁👁👁👁👁", "milliewillie71": "Never heard anyone say this, but I totally agree.", "itseschelle": "😶💚🙎🏽‍♀️", "theonlysuanny": "❤️❤️❤️❤️", "yunnypilates": "@apricots.gingerdots", "candidlychelz": "❤️", "yamile1029": "👁👁 lol", "ms_doc_whit": "Thank you for sharing this...I can relate. Looking forward to listening to your book!", "j.lashee": "💚💚💚 loving it so far!", "laurenmagnum": "Girl yes. 🙌🏽", "millie_the_yogi": "Haven’t read the book yet but I think 👁 see it 🤔 lol", "risk_byclark": "I soooooo loved that vulnerability you shared ! 👌🏾👏🏾😍", "idealperception": "Good love is supposed to make you love yourself more. It's just rare. And you found it because you believed in yourself on a deep level and felt that you deserved it whether you knew it or not...", "alexpeebee": "I just bought my audiobook!! 💃 LAID was a great read many moons ago... so stoked about game of desire and the theories you outline!!", "ms.shanelleh": "Yeah I ordered the book girl I can’t wait to read it @shanboody", "ma.cherie.d": "😜", "msjuliec": "Prime gets me the book tomorrow 🙌🏼", "shadae_speaks": "Yesssss🙌🏾 it definitely should work that way", "_brendalyee": "What boook", "jennjenny82": "I am assuming the lie is either you dunno if it's supposed to work that way or if it's that it makes you feel guilty. It's gotta be one of the two becausr everything else just makes sense. ❤️🥂", "misscynthia86": "Amen!!!!", "cristal_ramirez_": "@tuntun_brah what i can say about you 😭💖", "dayday_buttons": "I just found out about you and your book because someone I follow liked your stuff and I took a leap of faith because I always go where my POC are and support. I WILL be getting your book and I WILL be getting the audio as well.", "robert_zee_photo": "Wow. THOSE. EYES. ARE. GREEN!!!", "imichelle89": "Bought the audiobook!! Loving it!", "belvides_": "I need this kind of love 😩😭", "ms_trock": "Facts", "freakdeluxe": "It’s so true!! It shouldn’t be that way, but I’ve definitely experienced this! ♥️♥️♥️", "natestar_": "Omg Shan imma bout to tear up. This love game is no joke", "shaquiramiller": "Y e ssss", "sweet_humble_rainy": "Hey 🙋🏽 where can I get the audiobook?", "ldwebster86": "👏👏👏 Yass sis. Felt that. 😍😍😍. He showed me sides of me.", "flores_delalma": "Toot Toot !! ❤", "mawiyahjohnson": "Wow! Just finished the audiobook. Here’s my review:  Confession: I initially had zero intentions of purchasing this book. My assumptions from the cover art and Shannon’s self proclaimed “open relationship” had me tightening my judgy pants. However, the audio snippet via Audible led me to believe that maybe what I assumed would be a cheeky, possibly sleazy read might actually be something deeper... I am so glad I pressed “purchase” - this audiobook (expertly voiced by Shannon herself) actually has little to do snagging the man of your dreams and everything to do with engineering the LIFE of your dreams. (That includes a dope romantic partnership). The accompanying self-assessment quizzes are soooooo time consuming. And. Worth. Every. Hour.  This work of art 1.) Empowers you to hold a mirror up to to yourself and examine every inch of you. 2.) Equips you with actionable steps and mindset shifts to engineer a life (and love) you consciously choose and truly adore.  Bonus: these shifts work for every area of your life: romance, family, work, errthang!  Now, I’m gonna have to drop even more coins to get the hard copy because there are way too many gems that I need to highlight, keep on my nightstand, and review.  Bravo Shannon and seriously. Thank you!", "aliciasunshinemoore": "You're so beautiful even crying ❤️", "aida_lucie": "Started reading it yesterday and almost finished!!! It’s so damn good!🙌🏼 PS, Your eyes are glowing 😉", "emveke": "hi shan! Not related to the post or book but I just wanted to say thank you for being an amazing and safe place to go to with anything sex-related and for being an inspiration in all you do. I love your videos and will hopefully be getting your book soon!!❤️", "scholasticmrfox": "Picked it up today and started it on the subway home! Love from Toronto, girl! ❤️", "just.monid": "Sis I totally felt this!! ✨", "thelillianbanks": "Why can’t I buy it on audible?? 😩", "ixosa.12": "Did you broke up with your bf no cuz- you look dead upset 😭😭pls don't cry @shanboody 💞", "sablor": "Just purchased on Audible. Looking forward to reading (listening). ❤", "ashliz822": "I need this book❤️", "ellsmama": "The lie: “I don’t know if it’s supposed to work that way”", "kiannabanks": "I don’t think I’ve ever seen eyes this green. Wow 😍", "nalanibeautyco": "🦋💕", "cynthiacovello": "Heyy I'm having some issues with my book order ! I direct messaged you. If you could get back to me , I'd really appreciate it ! Thank you ❤️", "dontdieafraid": "I’m one of your biggest supporters. And I can spot the lie because I have two copies of the book! 👁👀💚💚", "uronleesunshine": "🤣❤️😍", "bre_new.yorker": "I finally got my book and went straight to chapter 5, page 86!!!! 🤯🤯🤯👍🏼👍🏼🤐🤐 @shanboody girl!!!! I love 💕you. 😘", "_tonieeflores14": "❤️❤️❤️", "thiccmytsticc": "wait that was meant to be a compliment lmao", "herbandculture": "Eyes of #jade... So green!! Wow", "itsjessiebt": "@redge_reflectconnectcreate", "snacks.perry": "I'm sorry but you look like your sister so much in this video.", "kenyaonhair": "🙆🏾‍♀️ I got both. Reading along with you! I’m so happy for you, Shan. For your book and for your LOVE.", "randisavage87": "🐲", "shawneemusic": "Girl.. u are fire. Way to be. Keep doin ya thang ♥️", "daninicolemusic": "👁", "eeemmylou": "@chloehollidayphotography ❤️", "nyah_the_natural_": "😭💕", "te_massage_and_wellness": "I have the audiobook😩😩", "melaboricua": "SHAN! My book is coming by the end of the day today !!! Finally !! I’m so excited 👏🏽❤️❤️🙌🏽🙌🏽", "goyi_0716": "That you learned it in that relationship in particular??? Is that the lie?", "_allaboutthebenz_": "@brimorgan722", "gowiththe.flo": "@shanboody What books do you recommend I get from your first? I’ve been hesitant but I might as well splurge on payday 😂❤️", "n.iqi": "Aud-ered it! 😘 Excited to listen and learn from you 💕", "riickyia": "💕💕", "alexischillington": "I read the book 👀😉💚", "blckreginageorge": "@victoriabelyi soon we shall relate...", "vitamin_si": "I signed up within the first 10 minutes of your post saying you were having a meetup in nyc and never got an email back. We’re emails ever sent or is this something that I’ll know closer to time? I pre-ordered and everything & never got an email to your previous nyc meetup. I want to see & hear you. 😩💓", "marie.uwimana": "Ughh i dream of that kind of love.", "koolee89allday": "How can I get the book", "skyeshorizon": "I know this is completely unrelated but, you look gorgeous in this lighting and everything! Your eye color really pops!!! You look SO BOMB 💞💞💞💞", "_chartina": "@reckl.m.e ❤️", "sheenabeana82": "❤❤❤", "modelfaceann": "@1queenofny 😥", "shika_chica": "So so true. You are not crazy. I have expirenced this in my current relationship. First healthy relationship I have been and I have been growing more then I ever knew", "aquamoonbxtch": "The spikey legs Shannon. The spikey mf legs. I’ve loved you for yrs, but I feel an even more special appreciation for you cause that is 💯 relatable right there😩😩👏🏽👏🏽❤️❤️🙌🏽🙌🏽🙏🏽🙏🏽🙏🏽🙏🏽", "monicachante": "👀", "kelislong": "😍Your eyes are beautiful", "cindyc853": "‼️‼️Attempted to purchase through @harpercollinsus and it was a complete fail. They never provided the audio book and indicated they do not do refunds. Just check out the HC Audio app reviews, I’m clearly not the only victim of this. 😤 My advice is to purchase through other retailers. *this is not a reflection of @shanboody by any means* ‼️‼️", "bea._.trice": "I just got the audiobook 💗", "_yayamontano": "❤️", "toddrika": "My friend and I are doing a mini book club with this 💕💕💕 we love it so far !", "tiffanylaibhen": "Love how open and vulnerable you are! Speaking into existence that I will meet your beautiful soul one day soon ❤️❤️❤️", "gissel_larios": "@jayj_44 @amayams_", "rhondathough": "I love this ♥️", "cello.mxviii": "You good b? Just having a moment?", "27th_francis": "Let it out. It's okay 👌.", "tres_leches_": "My book comes in tomorrow 🥰", "bainsforchange": "Grabbed mine. Very proud of you and the messages you convey. Congratulations 🙌", "k_liyah17": "💖💖💖", "katieharbridge": "I’m on 10 and I cannot stop!! 🙌🏼", "tifffiny_rose": "I need you too know that I appreciate you for reason's you will never know. But I thank you.", "dupreearmon": "😩😩😩😍😌 @max_hsa", "mycheryeamor": "😭🙌🏽 You are amazing. Please keep being exactly who you are! We need it. 🤞🏽", "jessicamowforth": "Just got to page 86☺️🙏🏼😘", "nijahmechel": "BOOM", "atheenayanez": "Buying the audio book today!!!", "mahappyy": "I love u sm, so happy for you always ✨♥️!", "thera_evolution": "💯", "p.o.p._the_writer": "@shanboody I think love is suppose to work like that. You attracted to you the epic love that you're in right now.", "janatsoomro": "@tahleelk @spilltheteeh I love her 💕", "v._ash": "The eyes! The eyes!", "lxquisite": "Can somebody order the book for me? I really want it but I’m broke lmbo", "reesiebabe": "😍😍😍😍😍😍😍😍😍😍", "theesalmasky": "Ugh. 😭 ❤ So happy for you Shan. You and Jared have something special. Can we also have a moment for your eyes. 😍 Love from Zambia 🇿🇲", "ecall3nd3r": "My book arrived yesterday, can’t wait to dive in! 🙌🏽", "neurophobicandperfect": "Lol I have this video on my favorites tab for when I want to cry", "ratchetconsciousness": "I agree with this! I never really agreed with the whole \"you can't expect to be loved if you don't love yourself\"", "agent_1407": "Amazon is taking too long 😩I’m just going to go buy it off the shelf.", "shandasara": "👀👀👀", "bri_deneille": "I'm so sorry, but your eyes are THE MOST STUNNING green. Omg", "christwixtheshepard": "Preordered!!! 💚💚💚", "pieceofchic_": "The book is in my Cart 🥰👏🏽", "kylakupid": "I seriously want the book and the audio book, is that too much am I crazy? 🤣💕", "brittanyyourbrilliant": "How can you be gorgeous when you cry😍😍", "lilyreilly": "@shanboody How can I buy the book in New Zealand ❤️ xx", "musically_drugged": "💁🏽‍♀️👀😉", "redirect.to_empris.durden": "I ordered it last night, can’t wait to meet you, I’ve been following you for 5 years", "your.sunflowerrrr": "Sooo beautiful 💕", "b.raeven": "👀 👁 👁", "drchristinaalicia": "😉💚", "amileya": "Yoooo I started listening this morning and already on chapter 6 of the audiobook. Love your voice and the work you do 🙏🏾💖", "nicole.raymondi": "Girl. Never smooth!! Like the thorns on a rose, always there but what makes us the divine goddesses we are 🔥🔥🌹🌹🌹", "francessmith": "Absolutely ❤️", "mariakatrinaphotography": "@tanveerflora @avnish.flora this is everything.", "jessiemondo_": "@vanessa.napoli follow her& read her book!! This woman is everything!!!✨💙💙", "jasthecherrybomb": "Just got the audible!!", "lexsewtrill": "You deleted a yt video where you said something like \" when you love someone love them enough to give them blank pages ...\" whats the rest lol", "queenchewbacca": "😉😉 I feel apart of it all 😂😂", "indelibly_jaz": "Gotta hurry up and get this joint😍", "karenxpeinado": "@vibewithalex_05", "viktoriacsik": "i’ve watched this video like 5 times. so touching and sweet. 🥺 endless love for the two of you", "spatialtherapy": "I'm 50 something pages in I almost skipped ahead after reading this caption but na.....imma wait", "maryscupofteaa\nVerified": "Verified", "tasheenamedina": "💚👀", "holistic_hedonist": "@shanboody you should never feel guilty for experiencing all that you deserve. You can’t meet anyone at a lower vibration to raise there’s, you can only stay in high vibration and they’ll meet you! 💗", "taylor_made70": "So so true! I’m picking the book up today!", "urbpanya": "Ummmm I haven't read the Book (YET!!) Buuuuut 😍💚💚", "kiwi_midwife": "You're a queen! Just started following you. Congratulations, you're killing it!!!! 🙌🙌🙌", "denitrawallace": "Yes🙌🏼", "markdaddy_": "@wendy_415 🥺", "roraskighs": "It isnt a bad thing that someone else who loves you can make you feel that way it just reminds you of how beautiful you really are 💕💕", "acityonahill": "soooo true 💛", "emccary": "Whelp, I loved this.", "_fawnn": "I think the lie isn’t that a good love *makes* you love yourself-but that, a good love helps you realize the love you’ve had for yourself and empowers you to soak in it.", "iammayakhabira": "❤️❤️❤️❤️❤️❤️❤️❤️🙌🏽", "sawdustinmycurls": "💚😉 Not finished with the book yet but loving it so far. I’ve put all my coworkers on it. Thank you so much for your work!", "_sheslikesummer": "😭💖💖💖", "xyz.aries": "Lie: this is the most stark thing youve learned from this relationship", "dakotaacross": "The part about your legs ?! Is that the lie lmao @shanboody can’t wait to listen to the audio book", "leilita": "Did not expect that 👀", "courtmoves": "🤔🤔🤔😉💚", "life.of.jin": "Were your eyes always that green👀😮", "kiarratee": "I bought the audiobook yesterday!!! Loving it already 🥰😍😍", "bananazzz_": "Buying the book today! We met at the sports bar in LA during the NBA finals, thank you for the great convo 😊🙏❤️", "tameikat": "💕💕", "exquisite_destruction": "Figuring out the lie was simple, all I had to do was look into your eyes 😂😉 @shanboody", "simonesgh": "That's what people are for! People teach you more about yourself.", "brosiaaa\nVerified": "Verified", "thatgrlnextdoor": "ordering it now. love you so much", "thekorimonster": "💚👀💚", "baddgalsteph_": "awww i love this ❤️", "a.jenifer_": "😭🙌❤", "julsykakes": "@evab_13 omg we were just talking about the audio book!!!!", "nottooordinary": "I've got the book, audio book, and ebook 🤣 #thegameofdesiregang 😂 thank you so much Shan, I just got it for one of my good friends for her birthday as well 👏🏽👏🏽👏🏽", "elhxi": "Is the lie that it’s the most stark thing you’ve learned in the relationship?", "brianarena": "I haven’t read the book yet but i’m about to cry watching this. Ordering soon 💛", "__.amirahhhhh": "I was focusing on her eyes she has the prettiest green eyes ive ever seen", "jadirahhhh": "Love you @shanboody you inspire me and so many other women you’re such a powerful being ❤️", "liesl_michelle": "Is the lie that your eyes? They look a lil greener than normal?", "yayitscia": "This is beautiful💕 You are beautiful 💖 Loving the book! Thank you so much for it!!", "caleymcdowell": "@bethannyelila", "night_owl96": "Just got the audiobook can’t wait to listen @shanboody 💜", "taiylarmade": "👁", "kozma__": "“Idk if it’s supposed to work that way” is that the lie?", "smckinny": "@kt_thabaybaykid", "rads_world": "I live in Canada where can I find it ? I would really love to read it. I’ve literally been following you since those girls are wild days !!! You’ve taught me a lot !! ❤️❤️❤️", "ligayaslegit": "I love you for this ❤️", "polet__": "👀👀😶", "darcaia": "You are SUCH an inspiration doll 💜", "mon.mon.d21": "the old man chuckle i just made reading page 86 🤣 LOVE IT! i never thought of it that way", "morelifedeity": "❤️❤️❤️❤️❤️", "itz_sarah_ashley": "❤️❤️❤️", "nuvgoraya": "@kam.k.s i'm crying at the library lmfao, gonna read her book after my MCAT", "audreypm31": "@subashini_tavamany @phaikhuang @munmunyap @hemand_89", "rianna_____": "Cmon someone tell me", "joannamihalicz": "@lukomski05 you for me", "simmy1587": "A good love adds to your existing love of yourself x your already whole and there whole and you two meet and add to each other’s lives", "layleiri": "Just got it Barnes and Noble 🥺💖", "danicrks": "@daniii_crooks", "visionbykovios": "I am very excited to read this and or listen to this. You put your all into the things you are passionate about and I’m sure this is OVERflowing with that Boodram passion. Congrats!!! 🎊 🌹", "michaeladrian": "Your truths are relatable, thats one of the reasons you are so great. Always Love Kiwi", "xquisiteclothingbrand": "😍", "mspatriceashley": "Just got my copies in the mail 😊", "luvhimorhatehim": "Your eyes are amazing", "e0_james": "Saw you briefly on tv yesterday!", "thelovehourpodcast": "This!! Thank you for this! ❤️", "britkiara": "@jessevette think I’ll read this book", "erigom15": "I love this, it speaks to my soul ❤️❤️❤️", "heyqanie": "👏🏽", "desire_": "Good love makes u love ur self more... that’s a lie... you have to be the one loving ur self more and more no matter what love between you and another can share. You do not sacrifice ur self love for love by attaching a relationship on how to get more love. Is that close?", "blogbyhola": "Do you ship to Puerto Rico🇵🇷?", "jay.luna": "Hey Shan can I get the audiobook another place than audible? It doesn’t seem to be working for me in Canada. I already bought the book on Apple Books but wanted to hear you speak to me!", "itsmoniquerenae": "You are beautiful. 👀", "klm_xo": "Every single thing about this video I LOVE, thank you for sharing this!", "indigx__midas": "This was DOPE 🌺", "akaschwartzy": "Lovely.", "charandroses": "Crazy cause before logging on IG I was thinking of this video 😩🙏🏽", "aye_rii": "💚👀", "rochelle_pf": "👀👁", "jess_like_wahh": "You’re amazing ❤️", "kgardner882": "@shanboody I’m still waiting for the book to be delivered. Hopefully it’ll be here soon 📕", "ramyr71": "My ego made me lose that person for me! I had him in every way you explained but my ego didn’t respond well 💔😢", "mutterknowsbest": "That it's the most stark thing you've learned about love. P.s. you're magic.", "alejandrasantana7": "Where can I get the audiobook?", "jasmine.dragon_": "It’s her 👀👁", "as_seen_by_myah": "I know the secret! 🤐🤫", "rollingstone.xo": "😭💗", "yellastonerr": "@baddiezola you 🖤", "dopefreshlife": "❤️❤️❤️", "_cbsq007": "Facts!! That's me in my relationship as well. ❤️❤️ God bless you both.", "vicboat": "The UPS guy legit just delivered the book! So excited to start reading it. Thanks @shanboody!!!", "kevine.caldwell": "😢", "yunicornyanice": "Make up is fleeeeeeeeking", "im_shelbyrudd": "I call bull on the spikey legs. Your IG feed says otherwise", "petitelypackaged": "I can’t wait to get my hands on this and pimp it out to booktube", "kyerrah813": "I'm buying this book for myself. I'm buying it for my girls. I'm buying it for my dudes. Thank you @shanboody for writing this because there are SO many people in my life who need to hear what you have to say. Myself DEFINITELY included!", "naturalbeauty712": "I love this ❤️❤️", "hollyalie": "I felt this", "fenamunoz98": "Can I buy the book if I’m not from the US?", "beautiful.disaster.ls": "💕💕💕", "ash.jabrina": "Is the lie that you dont know if love is supposed to work that way?", "trishnaomi": "❤️", "carmensanjaygo_": "@debbiehascakes damn babe this is it right here ♥️", "lemon_love_90": "Spiky legs? I know that’s not the lie but damn men actually exist who don’t mind spiky legs? I need to find them lol", "missferriberri": "This is so true! ❤❤❤", "lionsolunaria": "This is so 👏🏽damn 👏🏽true 👏🏽. Mi amor shows me the type of love that allows a safe space for me to grow. I am learning to love myself more through his love and compassion.", "miss_tee3233": "Gosh I need to get the book TODAY!!!!", "jiggyjamalwillslapabean": "BEAUTIFUL!", "danielle_dolittle": "👀👀 I may just have to use this one", "iamsahararose\nVerified": "Verified", "__la_risa": "Beautiful", "heliaxo": "*Googles @enjoyjaredbrady horoscope sign *", "hellotanda": "💚💚", "meetmacy": "@brittney_boria this is why I sometimes feel like I should have made it work 😥", "yel.rennalls": "👁👁", "bri_loure": "Waiting on my preordered book to come in the mail 😊💕", "xladybrown": "@branperkins", "shesharishow": "You are so blessed! I believe when true love is present whether it’s coming from you or another person it cultivates growth. Don’t feel guilty… continue to be the awesome example of what you can attract when you love yourself❤️", "jungle_hair": "Grateful for you and your YT channel. Keep being you Shan! I cannot wait for my book to come in the mail!🙏🏾", "dani_cngr": "I have the audiobook :) Reading it next!", "marlie_____": "Her eyes in this video is so beautiful 😍", "__ladygrace": "aaargh can you please postpone all of these posts until I get my copy in August?😩😍 wish I could read alreadyyy", "melaniefiona\nVerified": "Verified", "jayeeeda": "I feel this. This is how I know my relationship is right, because I’ve never felt for in love with myself, life and my partner. It’s a very beautiful and overwhelming experience.", "ninaluvvv": "Sometimes you feel guilty for it working that way..that’s the lie ..I think lol", "lilbitmorgan_": "This touched my soul.", "yannabona": "@gorgie.morgie sisterhood relationship", "__shalili": "Amen girl!! Yaaassss! 🙌🏾🙌🏾", "bby.jesssss": "💋❤️❤️❤️", "mstaliag": "This 🤣🙌🏾", "_jackiki": "👁👁😘", "salmorany": "❣️❣️❣️❣️❣️❣️❣️❣️", "_gotyou2insane": "wow everyone deserves love like this🌹🌹", "wynn118": "@kiaya_la_papayaa", "thekeymiahsister": "Ordering my book today🥰🥰", "tiaralmccoy": "💚💚💚", "sacha.b_": "I just got the audible today!! ❤️💃🏽", "daydreams_n_smokerings": "See this is so true. This is why I’m a hopeless Romantic...always looking for the man that will complete me. Yes I do love myself but you vibrate higher and radiate different when you’re loved right. You even have a glow about you. Praying for that kind of love. Seems so hard to find. 😔", "_nayyohmee_": "@cudin9ne", "emm_nomadicjourney": "You are incredible 🙏 💕", "msga__": "@swongp310 this is what you make me feel. I love you", "reallytaya_": "👏so true shan #goodlove", "rootedresistance": "👏🏾🖤👏🏾", "saraelkh": "♥️", "rozdidit": "Mine is coming tomorrow 💃🏾💃🏾", "catchkarhere": "I’m loving the audiobook @shanboody your voice is so calming, yet energetic! My sleep has been so good since “reading” it before bed. 😃💜", "teena_officialfit": "😭😭😭😭", "brittrfillmore": "Ugh. About two years ago, I completely gave up on love. I had to do that. But I’m slowly regaining the knowledge to re-understand love and what it means for me and understanding it in a new light from watching/reading your work 🙌🏾🥰. Thank you!!", "baddieglow_": "💜💜🙌🏾", "nazik_ali2": "What shade and brand theses two beauties are please 💚💚", "sidneedidit": "@stephaniehaydeng 😩😩😩😩", "pickles_and_peanutbutter_": "@weezo_kingofkings", "seacgo": "💜", "tashelizy": "Your lucky, and it’s obvious you know it and appreciate that. Some people never experience love like that, and it’s a sad tragedy.", "jjxo_27": "I love this but I'm scared to have this again ☹", "j.eyy": "Your so beautiful 🌹", "malpaula": "🥺🥺🥺this is beautiful", "enjoyjaredbrady": "The me thinking the spiky leg is cool part.. that’s the lie. But I don’t mind it lol ❤️", "daria_noire84": "This is very true unless you're not ready to be loved, which is usually because you don't really even know yourself. That good love can feel like attack & correction. But let me hop out these comments about my FORMER business. ✌🏿", "jes_rod": "I bought the audiobook last night🎊 I’m excited💕 congratulations 🙌🏽😊", "kangaimwiti": "💚💚💚", "charlotttecouch": "@dannymac97", "s_bowes": "So true", "ms_l3ella": "And you did an awesome job at the audio that's what I'm listening to @shanboody", "a.miamme": "@k.emmma a good love. The best love.", "nickolette_reid": "💗", "mindysmallss": "@oga_mijo ignore the caption but I love what she said in the beginning. That’s youuuu", "poeticaboutjustice": "😫", "__nadsz": "Yassssss got that audiobook 🙌🏽", "migh.tee": "💗", "_jewelsofgold_": "❤️", "sandramarie_iam": "❤️❤️❤️❤️", "perfect_quincy": "👀👀💚", "followthatgirlwiththecurls": "😩👏🏼👏🏼👏🏼👏🏼👏🏼 I so felt this", "insidewynter": "😍😍😍", "wutizthisvelvet": "@bonefide.hair 😍💕", "thensidertv": "The truth!!!💕🙌🏽", "hopelessfromantic": "Awww my heart 😭. You deserve that exact kind of love 💕", "mscree": "🙌🏼", "hope.wanderer": "👀How you gonna make me skip pages though! haha", "jowee_ann": "❤️❤️❤️", "pityriasis6618": "👏", "flawsofcouture": "Beautiful. 🙏🏾💕", "rachel_bastien": "👏👏", "xokaylovee": "♥️♥️♥️♥️🙌🏼🙌🏼", "oops_its_amby": "❤️❤️❤️", "majpointoh": "💚😂", "ranikkaj": "THIS IS SO BEAUTIFUL! ❤️ I have to purchase your book! Congratulations again! 💕✨✨✨✨", "anabella__58": "Toot toot , you better toot your horn!!! You killed it! ♥️", "heycoachmauri": "I’m so touched. Buying the audiobook.", "ashleyy.017": "👀", "dinanooh": "💚💚", "cheycamille": "Those damn eyes are piercing", "unanchor": "🐉", "meeka0506": "Those eyesssss!!! Lol but I love this !!! 😩 The book is for sure going to help me get a love like that. I am already listening to the book for a second time!", "libertysue": "Havent received my book yet. I think it comes out in October for the UK but I know when it arrives I wont be able to put it down. I feel like it's just one of those books you know. Very excited", "phosephone": "Just about to download it on kindle! I’m in Australia and am so picky about my books being in good shape when I get them (not dog eared) so am going to wait till I see it in stores here to also buy a paperback! 😂", "mledip": "\"A good love makes you love yourself more\"", "gabstersc": "Love you Shannon ♥️ can’t wait to get your book. Love from Guam 🇬🇺 ♥️♥️♥️", "t0risimone": "damn, jared... such a good guy", "secure.the.journey": "👁", "_missmarymac_": "Thank you soo much for sharing!! ❤️"}