{"alexandriaashcroft": "I like when I smell nothing! 🤗", "hannaposey": "There are many studies that prove pheromones are instinctual forms of communication in many animals including rats, cats, and snakes. It is so cool that you chose to experiment with humans as well!", "thislifeiliveintruth": "😂", "tres_rose": "Savage", "keeshie_": "But like no one is commenting on the clap back 🤣🤣🤣😂😂😂", "eashtonnn": "Caption", "a.r.b_87": "Consume Apple Cider Vinegar. ✔️", "abby_claron": "👏🏻👏🏻", "shinjinisur": "Soooo I’ve never heard of vabbing before and I trust you Shan, so I decided to try it. Skeptical at first but holy shit it works! I smell freaking phenomenal hahahha whole new level of self love achieved thanks to you babe 🙌🤗🥰", "ncanejo": "😂", "viviianna_": "👏👏👏👏👏👏", "momcrushmonday": "Thank you for sharing and being so informative! Someone’s gotta discuss it", "tamikaherkley": "I was paying attention👍🏾. People crack me up with these comments", "organicloven": "@shanboody #TruthBeTold You know my thoughts on vaginal secretions. 'Pussy should taste like pussy.' #SexGoddessTalks #SistersInSex", "lungtao1800": "🤤🤤🤤💯💯💯🥴🥴🥴💦💦💦", "ii.kyxa.ii": "I- Y'all really out here putting vagina juice on your body💀", "trini_sexiness": "100", "kristina.trout.96": "Regardless of if it smells like tuna or not you are fucking disgusting for doing this.", "itsfinallysakari": "Some people real disgusted in these comments for no reason, like you don’t check if you smell good? There’s your problem", "_jelisaaa": "😭😭😭😭", "rooted_deeply_": "Nah it’s still a no for me I don’t have an order but it’s still will be a no! I think most ppl don’t even know what their natural BO are because of this false sense of what “ hygiene” is it still will be a no for me.", "brea.bailey.98": "Why would you publicly post about your tuna vag lol", "nadinearaksi": "Shan you are a true queen. Just finished GoD audiobook and it totally transformed me in a week!! Gave me a cool business idea for you, too. We should talk the next time you’re in the 6ix! @thetracymoore can vouch for me ♥️", "kennedyeford": "Someone should let peaches know🤧", "brooklynndoubleu": "This 🙌🏼🙌🏼🙌🏼", "genotv63": "I’m out ‼️", "callynnlynell": "And I oooop! 👏🏾", "sapio_shar": "Preach, Queen!", "king.skorpio": "I get it", "cbellaphotos": "I smell like 🌹🌷💐🌹🌺. Good nutrition is very important!!! 👏🏼", "oceanofagape": "I’m maddd happy that so many women not just smell themselves but truly enjoy their scent. I used to think I was weird for loving my scent. Glad to know I’m not cray.", "keekee.pie": "@shanboody I think it's ridiculous how we are conditioned or told what a woman should be by society and by the media. There are different sorts of women and we should learn to embrace that. We are all beautiful in our own way.", "1cheekylittlemonkey": "Truth... ppl need to pay attention to what our bodies are telling us. Especially us women", "itsnaomiadams": "Breaking down and fighting male ignorance and hate for our bodies one incredible tweet and video at a time. 💞💞💞✨✨✨", "yh.kaleb_fy": "What has the world come to🤮", "trilllg": "🤣🤣🤣 u really have chicks rubbing their pussy fluid on their neck desperate for dick...😅", "lordswaggo": "Shan with the clap back 😂😂", "gcirclerecords": "Lmaoo", "lovelavender92": "Women need to be more comfortable with their natural bofy scents. I noticed that when I don't drink enough water I get more discharge that's very thick and smells stronger and more acidic per say. When I've had lots of water I barely get any discharge and it smells very light and very sweet.", "cole.balantz": "Lmfao what the fuck is wrong with you", "justsheherhers": "Oh and by the way, putting your vaginal moisture on your pulse points is lowkey a form of conjure and something that has existed longer than this country.", "dxvsis": "Caption", "loussoe": "\"you don't need Chanel, you need a checkup\" hahahahahaa awesome. Thanks for this! 💜💜💜", "edwinmikheil": "Yo pussy nasty and so are you 🤡", "thedynomizer": "I've seen it all now", "playboybandito": "What in the actual fk! Lol ur not serious! I need to smell this! 😅🤣", "simonesgh": "Lmaooo I love your comebacks", "a1leeko": "So now everyone is going to stater smelling like they cat now 😭 oh well 2020 on some new shit", "throughmyeyez_jpg": "😂😂💕💕💕", "karinatehrani": "Omg ily", "big_bear15": "You lost it", "stryvelle": "Good morning", "anthonysansone": "Your fucken nasty u stank bitch 😩😩🤮", "michellepanning": "Yes!! Our vaginas are self cleaning and if your vaginal odor is offensive, then you most likely have an infection.", "iamkatscott": "Pleaseeee keep educating 😩😍", "physicalmemes": "That twitter account is a troll, nice response regardless 👍", "nolimitidriz": "You dirty bitch", "hannahmixdchick": "My bf always laughs at me because I say I smell great after the gym but it’s true lol 🤷🏽‍♀️😂", "nick_ya_boi_": "So, do you really wear your vagina juice... that’s so nasty", "justpppeachy": "I love my smell! I thought I was the only one!", "gotlovin": "Lol🔥🔥🔥", "seharpanjwani": "yaaaaaaaaas", "brandonmbolton": "🙌", "jawshimmanuel": "RS!!!! Fuck those guy this shit is sexy af 👐🏾🙏🏾💯", "jashleyb91": "Lol I can't believe how many women like to smell their own panties. I love Instagram, shit gets real, real quick", "nulight_": "Nicely done👏", "jfrink1": "Educational and informative yet unintentional shade😂😎", "blue_wallflow3r": "👀 Oop 😂", "snkrdls": "Wtf you’re disgusting.", "fka_pcakes": "Your vezina is naturally acidic, so it's not going to smell like roses, but shouldn't smell like super fishy either", "nicki.lewinskyy": "Caption killa", "joelsmith64": "How is it backed by capitalism (an economic system) again???", "philip_lombardo": "Bruh why we acting like this is empowering?", "cerdakayla88": "One ex boyfriend told me “if it smells like fish it’s a dish, if it smells like cologne leave it alone” 🤷🏻‍♀️ Summers Eve be my favorite 🌸👃🏻", "fatimaf.a97": "Yikes caption is a killer! Facts no 🧢 that girl needs help if her thing stank like that", "the.planet.kiwi": "My smell is very bearable. Idk about others", "__missymoo__": "@juliediplock22", "elleoquently": "My natural odor is beautiful and I love it and thank my diet for that. Your body expels what you intake 💋💋💛🦋🌌🌺", "manyflawsmusicc": "And stop messing with dudes that be phucking that pH of yours sis , tell them again @shanboody 👏🏾👏🏾🗣", "missalibrown": "Honestly thank you for talking about this 👌 you're the true mvps. Downloaded your book, looking forward to reading it", "sweaty_tachanka_main": "Imma nut in my hair and use it as gel thanks for inspiring me", "itsviviankaye": "My whole body is yummy. 😂🙌🏿", "itsmarbearrr": "PERIODTTTT", "charminghoney": "I love my natural aroma! My ex couldnt get enough of it. I would meet him at his job in break just si he could smell it 🤷🏽‍♀️", "ucashtro": "Regardless ur wearing ur pum juice on ur body", "tonirox": "P.s., i love good body smells. Ive smelled the colonge that made me want to jump bones before but the search is still on for me", "beenbrock": "Na bitch you just gross", "trillsami03": "Aye bruh word on the streets is that u use ur poum liquids as perfume🤡🐟", "jesusleansta": "Ain’t you the jit that wears her pussy juice as perfume??", "chocolate_wine_curls": "I smell like 🌹, so I have no idea what this lady is talking about!!", "iamemkae": "Within this can we stop adding so much shame to our scents rather its a “good” smell or “bad” smell. I feel that some people radically imply that it’s that persons fault for their scent bc they should *just* know how to treat their vaginas. Not everyone has access to the vital information on how to treat their bodies. We have to give them space to learn instead of automatically resorting to group shaming. Instead of resorting straight to “You nasty fishy bitch” why not just gently bestow that knowledge. Sharing information is caring.", "htbsle": "I truly hope @shanboody is not even slightly pressed by all this backlash about her book! That audible has completely transformed my life for the better! @shanboody if you need a consumer book review from a poetic lyricist, I will gladly provide such reference 💃🏾#thegameofdesireftw", "katrvdical": "You drag people so eloquently and I cri everytYm", "alittleafternoon": "💯", "keys_nicole": "💜💜💜", "taylormoe8": "I think I smell too sweet and I don't enjoy the smell. It doesn't smell bad or wrong, but it's just not what I enjoy. My boyfriend is happy though 😂.", "bml.logan": "Bitch you nasty", "chaviiita": "Say it louder for the ones in the back!!!!👏👏👏👏", "_.brasian.ng": "🐟🐠🐟🐠", "chuckyb._": "@6ixbuzztv", "vumbambodance": "This whole thread is warming my heart 😍", "tabbihhh": "Clap back queen!!!! 👸🏽💦💦💦", "carolynvan": "Exactly", "deni_dondada": "Bloop!!! Did the bitch respond back after lmao 😂 😂 😂", "noiglauren": "“If the idea of your own smell makes you nauseous to me that’s the real topic that needs to be discussed” Facccttss!!! Absolutely inspired by your work @shanboody ✨❤️", "julivsbellotti": "Ur fucking disgusting bro stop tryna be extra", "nik.macintosh": "y’all fucking disgusting 🤮🤮🤮🤮🤮🤮🤮🤮", "clickforjae": "yes girl!!!!", "1inamilliondre": "Lmao natural scent really smells good these people aren’t aware because they’ve compromised it with the toxic things they’re putting in their bodies. I don’t even have to wear deodorant majority of the time. Sooooo it’s really all about what you intake", "ybc.ftl": "Still a clown if u wear pussy juice", "kaschabreona": "Do u believe in v steams?", "en_trapperneur": "Ahhhh I saw a post on 6buzz with a BUNCHHHHH of ignorance in the comments...but it brought me to your page and I LOVE what you’re doing, keep educating the city and eventually take your influence global...the ignorance surrounding sex and our sexuality is astounding so we need you and more ladies like you 🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸", "manicnotpixie": "I fw the caption", "evanffoster": "What are you doing?", "silviacaroline_1": "Honestly I love my natural smell. I take care and know my body well.", "staraaatv": "@officialcyatteas", "notoriouzceo": "Smh", "maatabena": "You are a Queen 👑! It's crazy how women have something negative to say about this, spend some time with your p***ies and then you'll realize that there's nothing better than the aroma of her. Love your bodies, inside and out.", "__octobersveryown80__": "🤢🤢🤢 Mine don’t smell but that doesn’t mean I should bottle up my pussy juices and spray them on my neck 🤢🤢🤢", "nami.nae": "You don’t need Chanel u need a check up lol 👏🏾👏🏾the clapback I love youuu 😹", "3ammindfulness": "My natural smell is amazing. I love smelling my panties. I do it all the time. I smell so good!", "shany394": "Natural all the way 🥰🥰🥰", "rekofrmtheblvdd": "vileeeeeee", "mandatav": "You’re fucking disgusting!!! 🤮🤮🤮", "saugavalleyblvd": "I thought I was the only one that rocked pussy juicy thank god sis🙏🏻", "alesiaa_": "👏🏽👏🏽👏🏽", "makinggoodmusic": "Yu bxtchs WILD ona dead homie lil homie", "_themedallion_": "Yes Shan check em with Facts !", "dannyjoe_oldaccount": "You and all these comments so horrendous", "thereclaimed": "😂 Your brand of shade is my fave😂", "alldabest24": "Nigga if you wanna smell natural then don’t wear artificial perfume and wash yourself. It doesn’t mean you gotta wear your vagina perfume 🤢🤢", "annesiainprogress": "Vabbing? = Vagina Dabbing as in a dab of vaginal fluid upon my wrist 🤣😩 yes!!! Pussyfooting around this 🤣🥰 @shanboody incredible", "lexybaldwin": "😂🙌🏼🙌🏼🙌🏼", "curlyladee": "Vabbing OMG I had to look this up...learned something new I tell ya. 😮", "1dspicy1": "Why are women coming on here saying they love how they smell?? Lol that’s awesome I do too but weird flex...", "themelissadenizard": "😂😂😂We love a teaching moment", "imaninmm": "🍵☕🍵☕🍵", "heidi_chevez_ulloa": "My normal PH is very pleasant, but I am very sensitive to changes in my PH thankfully I became aware of this very young (about 18) therefore I am very in tune and can usually tell right away if I need any meds! Doctor also advised that for women like me to be very careful of feminine products of all kinds! I use only plane water based lubes no smells or added chemicals all natural pads/tampons and no scented washes or douches of any kind!! Also latex free condoms were a life saver when I was single! Listen to your bodies and talk to your OB they can help tons!!", "chris_prelations": "Folks literally exposing themselves and how bad they smell 😂", "jaci.nikki": "Stick to Chanel? Wait what? Lmao I’m actually confused.", "taylor.loretta": "You gather these people so tactfully", "canned.ed": "poo poo hut", "theperioddoctor": "I’m an actual gynecologist and @shanboody is exactly right 👏🏾👏🏾👏🏾", "stephbbeckham": "@alyssadunits show this to ur aunt🤣", "br4ndxn_": "Who came from 6ixbuzz?", "follow_geminimusiic": "YES ❤️", "villa.guerilla": "Facts", "iceiszuriah_": "@thehoneypotco has great products to get rid of bv also!!", "halimajoli": "Even tho vabbing is not my thing, I laugh at small minds like this. My Kitty smells normal and healthy. I eat healthy for the most part and I drink a lot of water . If you don’t vabb just because you smell, than that’s not the practice problem, it’s your problem that you should fix. 😂😂😂💀", "curlyella_1": "🗣🗣BORIC ACID SUPPOSITORIES", "soluasoul": "#facts", "owainwellborn": "Looks very nice, really love it !!! 😍🌼", "brookebarrows": "LOL your clap back honestly isn’t even a clap back because that’s #FACTS", "lotus.casuarina": "truth", "christinamickella": "I swear by Prevegyne a vitamin c capsule for the vagina. 6 day treatment. One tab immediately restores ph by 20% and no prescription needed", "sorelleamore\nVerified": "Verified", "blkltsk": "I love my smell, I literally smell myself after every v wipe, panties change, shit even while at home randomly. I’m definitely trying this. Thanks for sharing what vabbing is.", "shainotshy_": "“You don’t need Chanel, you need a checkup” lmaaaaooo! Facts!!!!", "castaneda9618": "This is 100% true, I actually like the way I smell. But I've had BV and I know what that smells like. You are 100% not supposed to smell like that. Nope nope", "lesleyannparris": "SPEAAAKKKKK👏🏽👏🏽👏🏽", "thisisirielove\nVerified": "Verified", "sexologistshamyra": "Love your caption @shanboody. I remember E. Badu saying she did this a while back. We need more vulvovaginal health info circulating Al Gore's internet.", "phoenixrise100": "🙌🏾", "nadiaorsoitseems": "Tell em", "s.tersigni": "@lindscec @saraacec dragged and I love it. Vabbing forever. Keep ur mans inside and away from me", "jkyhcbll": "the crazy part is that we can smell each other’s pheromones. women who aren’t on birth control can smell potential mates and are repulsed by the scent of men they are biologically incompatible with and same for men. i definitely might try this out on a date and see if that enhances the vibe 😂", "shesvibey": "Definitely sounds like bacterial vaginosis", "aisha_crna": "I was wondering like... nothing over here smells like fish 😂 Definitely diet. Plant based and or minimal meat will do it for you. Think about it, if you have decomposing flesh inside you, where do you think the smell goes?", "misty.maria.bonita": "She told on herself, didn’t she?! 🤧😷🤭😂😂", "ekoidstudio": "I'm clean but I just don't like the concept. It's cool but not for everyone.", "mynameiscandiss": "These the females that find it repulsive for a dude to kiss them after going down on them 🙄 that speaks VOLUMES about your hygiene/health if that’s disgusting to you 🤷🏽‍♀️", "thatsokee": "I’ve tried it before. Saw it in a movie once lol and I like how my vajayjay smell so it was no problem to me. Like she said unless you making your own perfume from it you not really gonna smell it like that. Y’all so bought into consumerism you disown what your bodies are naturally meant to do smh keep sharing the truth @shanboody ☺️💕", "sweetlyironic": "Reeeead 😂😂😂😂📖📖📖📖📖", "majin_boobs": "There are plenty of videos on yt to natural treat bv and yeast infections ppl, use your resources before going with antibiotics", "ashleyemond": "Only way to combat nonsense is with intelligence! Well played.", "fabdltp": "You don’t need Chanel 😭😭😭😭 LMFAO", "lanna_bear84": "Chanel stinks too anyway.", "aestheticbyflo": "Ohh damn this girl needs a reality check she has clearly been brainwashed or atleast taught properly about her body!!Glad at least your educating🔥 👌🏽you should def be helping creating sex Ed curriculums!", "nikkakarli": "Exactly!!! 🙌🏽🔥🙌🏽", "hey.itsnique": "CAPTION 🔥🔥🔥🔥🔥🔥🔥", "dieuber.frau": "DRAG THEM", "dr_brooklyn": "I'm on board I'm bout to start rubbing shmegma in my beard every time I hit the club", "tanashanality": "😂😂😂😂Shan said that with her entireeee chest. We Stan", "atma_things": "❤️❤️❤️❤️❤️", "at_mack": "😂👏🏽👏🏽 the end", "euella_isis": "👏🏽👏🏽👏🏽 tell them!!", "capriciouscompany": "Ahh I hate seeing women conditioned to hate their own bodies and bodily functions. 😭", "khloedosh\nVerified": "Verified", "openmind_openears31": "But if you smell other than your natural scent please take it to the GYN for some help. Scented soaps and douching will continuously destroy your normal flora and create a breading ground for unwanted bacteria. Different sex partners can throw off the PH as well", "bounceabiggitybamba": "An intellectual read. I will forever stan Boody!", "rbmdjanii": "Yo I LOVEEEE my natural smell I hate perfumes that cover it up to heavily every woman has a unique scent I recognize mine is a lot different than a lot of womens. ...It’s so soft and warm anf not very pungent and this isn’t a holier than thou comment I’m just sharing what I learned I’m vegan and I’ve been very conscious of my ph balance and sexual health since puberty, my mother is a vegan that leans more towards holistic health care so vaginal health has always been a thing for me. I’m telling you guys the way you smell has EVERYTHING to do with your health and what you put in your body (food and people) !!! Not just your vaginal smell but your body Odor in general.", "highyella_bruja": "Some of y’all need to just drink water 💦", "tonitula": "This is hilarious!!!!!!😂😂😂😂😂😂", "mel.issarey": "Tuna? 😳 the vagina shouldn't be smelling of tuna. 💀", "coconutsandhoney": "PSA for real...😬", "iconicchange": "I love how you handle hate with both class and education. People need to be taking notes 👀", "ladiiredd_pasoi": "😍", "kierstintaylor": "Amen! Uh oh, how did they even type up those words without understanding the revelation behind it. #youwaitedtoolongsis", "heliaxo": "Not gonna lie, I really love my smell. Not enough to put it on my neck, but in it’s rightful place, I just KNOW mfs stay dreaming about it for months after they’ve felt it 😌😌😎😎🤣", "thetracymoore\nVerified": "Verified", "iamvanityflame": "Tuna stank 🤣🤣🤣🤣🤣", "poofimback": "👏🏾LET 👏🏾THEM 👏🏾 KNOW 👏🏾👏🏾", "ashantae.seaborne": "She just told on herself. 🤣", "karlynpercil": "We're smelly - aka as humans what we eat/ even stress activates a different scent. That's what makes us amazing human beings! I love all my scents - agree that it can be an indication when something is off. Abd Vabbing? Wow - I learned a new term today:) Thank you Shan! 🥰🥰🥰", "77re77": "👏🏽👏🏽👏🏽👏🏽👏🏽", "jazzy_do_that_thang": "The term \"vabbing\" was coined by a listener of the Secret Keepers Club podcast that was created by @carlyaquilino and @emmawillmann", "trulysplenda": "It really saddens me when I hear women talk that way. We already have enough ill informed men making those comments we dont need women shaming our parts as well.", "evolving_spirit21": "💯💯💯💯💯💜", "thekristawhite": "Informative and shady, we love a petty psa", "c_rossyourheart": "BLOOP", "annaapplegatemusic": "LOL girl needs a douche", "natalianicolec": "😂 Got em", "lethal.poise": "😂😂😂😂 OKAY!", "d_shai_": "People are so ignorant , educate yourselves instead of making fun of people", "sheeisrichnmaintains": "🔥👏😂🙌The classiest 👏and most informative 👏clap👏 back 👏 eva!!", "a.mariexo_": "👏🏽👏🏽", "indiannnajones": "The most classy clapback", "thethingsleahloves": "When I first read your prior post on this I’ll admit, I was like “umm okkayyy” but then I figured, to each her own. If you don’t like the scent someone uses (whether their own fluids or some nasty old lady perfume), stay out of her personal space!", "avchrys": "I love that you’re posting this message. This post is so dead on! 🙌🏾", "delightfulcocobunny": "😂 Your response.", "grace.wyng": "Lmaoooo best clapback ever", "ziggyzagging": "I work in women's health and there are many things that can throw off your ph in your vagina. Some girls even get it every month after their periods.", "melaboricua": "A daily probiotic in the form of a yogurt, pill, or even in a tea can make a difference ! I didn’t even realize that your partners soap can even throw your ph off. We are so shamed about our vaginas that sometimes we aren’t properly taught how to take care of them.", "lamplightpath": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "natsanyal": "PREEEACH", "kharmonyfortune": "This is GREAT 😂 what was the first part though?", "drjolenebrighten": "👏🏼", "sleeplessmax": "......I BEEEN using my vagina fluids and have only been told good things like \"I like how you smell\" and all of that. People need to chill and embrace themselves 🔥🔥😂👌", "iamholidaybranch": "Lmaooo I cant believe women can be so ignorant these days. Get off the gram and buy a health book. We love you Shan!", "livintherealworld": "Thank you for saying this! Just makes me roll my eyes whenever people make comments about vaginas smelling like fish", "birdlovesyou": "It’s when I STOPPED using soap on my vagina that it started smelling good instead of fishy. I am team no soap no chemicals! Also taking probiotics helped my husband’s junk stop smelling. We need those good bugs!", "thisisangeladavis": "🤣😂😂", "andreannachin": "Eye am scrimmmmmin @miamehtg", "fluke_in_flow": "period.", "helenechristelle": "And Thats THAT on THAT🤷🏾‍♀️🔥", "dalishantiy": "Clap back season! Lol", "mschelseareeves": "I'm trying it!!! Anytime I take off my underwear, I'm always like \"omg my honey pot smells good!!\"😍😍", "beautifyrainydayy": "Why would she call herself that! ‘oinknika’ 😂 @shanboody i like how you’re giving us truths, science, and educational information. I personally wouldn’t experiment this and I never knew this existed. However, thank you for educating us about vabbing.", "the.soulish": "While this is not something I personally would do, these comments, reactions and replies are priceless!", "moniquensmith": "I- 😭", "ovodshaun": "You just flipped the switch 😂", "dbanidurnz": "Fuck it I'll back you on this I honestly did this without any knowledge on the matter, I work out, eat clean, and drink over a gallon of water a day. My scent has been describe as divine, my lover would tell me I smell like a lioness ready for cubs lol as silly as it sounds we are ANIMALS our society's and media can try all they want to disrupt this fact but dna science does not lie! Ever kissed someone and immediately knew you weren't compatible? Same fucking thing but you wouldn't have to stick your tounge down a strangers thoart. Just saying stop shaming your fucking bodies and everything naturally it does.", "queenv2014": "🔥", "ambernicole___x3": "- \"Tuna stank\" -", "luxegirlhair": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "gawddess_aura": "when you roast yourself 🤣", "miss_pena": "You don’t need Chanel, you need a check up! 😂 Boop!", "gigibonita1": "I was 🙋🏽‍♀️days old when I learned about vabbing. Oh em gee.", "blksoltheory": "Yoni steaming, plant-based Feminine vaginal washes like Honey Pot Co. (and others), decreasing the amount of dairy intake, Yin Herbal Wash, + having a gynecologist are incredible ways to truly heal the vagina and womb, keep it healthy, and to have no harsh smells.", "missiemaya": "Yes", "kenyaste": "Hahahahhahahahahhahaha", "organichaitian": "👏🏿", "samanthanatasha": "😂😭😂😂 “You don’t need Chanel, you need a checkup.”", "demariek": "Boop !! 😝👏🏾✊🏾", "uniquemarieholmes": "🗣message!", "ring_iq_boxing_memes": "Vaginas are smexy but if this principal were applied in reverse. Dudes rubbing their own meat juice on they neck so that pheromones draw women. You’d just get a lot of guys running around smelling like pee 🤣😂 I do believe in the vabbing theory though. Makes sense 🤷🏻‍♂️", "kalievans": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "aleahll": "👏🏽", "jonyhaspizza": "🙏🙏", "takeyoursoulandelope": "I love how you REAAAAD people throwing shade in the most professional manner 🙏💚", "_gracetime_": "Honestly couldn’t agree more!!! After watching your IG post about vabbing, I tried it out before going to an event aaaaand literally no one noticed haha. Thankful that my natural odor isn’t “repulsive” or “tuna stank” since I monitor what I put inside my body, drink lots of water, etc. Thank you for continuously educating us on these matters and saying “fuck that” to conventional societal norms @shanboody !! 👏🏾🤗", "masdemassy": "TELL EM 😝💕", "ms4n6": "🙌🙌🙌", "mike_ddzz": "Right 💡💡✅", "ambirheart": "👏👏👏👏👏👏", "vmariah": "🙌", "cleo_vs_cloe": "🤣 people are so ignorant", "thesoulfulrose": "👏🏼👏🏼✨✨", "monkybugz": "🙌", "love.lorelai": "Period!", "iampaigebrown": "Well said!🙌🏾🙌🏾🙌🏾💕💕"}