{"carlos_monteon": "@allisonlnunez @vsaraisilva As soon as I read that first sentence I was enthralled. Your talents, effort, and hard work (which many of us have been following for quite some time now) was displayed throughout the entirety of this book. So many quotable sentences, pages even, that can be applied to your day to day life.", "curly_zeljac": "@_derora & @ luce who does not have insta anymore. Anyways, going to you girls, because this book made me realise things have to change in order to get what I want, and by things, I mean me and the way I think, act and feel. I know this will be a book that will change the way you see relationships and, I dare say, life and romantic interactions.", "chenaidavid": "@dreadfully_raw @youngdon4ever I loved this book because it focuses on the experiences of multiple women", "maddy_lee2": "I absolutely love this book because I'm learning a lot and it's helping me feel completely in control of what I want from a relationship. ❤️🙏 thanks @shanboody for everything.", "sashaseverance": "@jillcsanford @bridget_irene_ almost finished with this book and I’m obsessed. Definitely a book that you go back and revisit. Definitely is helping me break through some barriers and walls I’ve confined myself to, forcing me to workshop and think about who I am not only as a partner in my relationships, but also the woman I am and want to be UNAPOLOGETICALLY. I know you both love a good read and one that gets the gears going, and this book is definitely it. 🔥❤️", "kiara.gold.art": "@sch.nee @mintymx ! I love this book because really, it gives you the power to *figure* out what you could do better and *shows* you how to improve yourself. There's something for everyone here. 😌💕😍", "starofmyownlife": "I love the book because it not only shows you how to get out of your comfort zone but it gives you the steps. It also helps to show how it work out for 5 different women as well. @key2ur_heart @forksr4losers", "sashadimetries": "@dominique_anastaisa @_aleasecooper I am definitely sharing both copies with you guys cause I love me a physical book (although I bought the digital. Couldn't wait! Don't judge me) this book to me is down to earth and that is what I love most about it. There are hundreds, maybe even thousands of relationship advice books, sex-help books, self-help books, etc. But I feel like all of these different points are in this 1 book! The way it is written isn't hard to understand. This book is so knowledgable, and when you read it, @shanboody is coming from a genuine place. Even if I don't win this contest, I'm happy to have purchased your book. @thegameofdesire will go down in history 🙌🏽🙌🏽🙌🏽🙌🏽🔥🔥🔥🔥", "precarious_mind": "@jayocmusic @onlyeden I adore this book because it has allowed me to continue courting my forever partner. While a lot if points are geared to single women, I am a firm believer that one should not ever stop \"dating,\" their mate, and I have tasked my man with reading this book with me so we can grow together as a couple.", "aliatubri": "Is this book for people in monogamous relationships too?", "mskayleen__": "Omg you book is amazing just as you 😍😍😍😍😍😍😍😍", "lexijanelle3": "@smileyriley333 @liv__holmess The Game of Desire allows me to better understand myself and what I want from a partner", "martha_lewis_": "@alexbeason", "emilydarden": "My package with your book got stolen off my door step 😫 they probably needed it more than me BUT I’m about to order it again!", "lulu_mcklien": "Disgusting 🤮🤢", "opiz973": "🐺🕶🔪", "toomucheva": "@lmmc3 🔥", "mikricky": "I loved this book because it follows real women, each with a different story and lifestyle and transforms them from dating drags to the ultimate seducer, while keeping true to themselves. Gives me hope :,) @cristinafelixx @__.roniii", "diimplesz07": "@lesly_ann__ @liany_p I love this book because it’s opening up new things I never knew about myself and how simple signals work to the extreme 😁 it is also an easy/fun read, I’m someone who doesn’t read much because I get bored reading them but not with this one ☺️", "sealsa12": "@shawbeshawbss @sugarfreeshu this book enlightened the hell out of me and gave me a foundation of knowing myself through the personality tests. Also it was entertaining and easy af to read!!", "kbelieve.xo": "Anywhere we can buy the necklace besides the official website!? Shipping is 96$ 🤦🏽‍♀️", "princesspresh__": "@shanboody @kristen.longoria @samolivarez20 I just got the book not too long ago and I already can’t put it down. I love your book because it’s made me become really self aware. It’s challenged me to think and be honest about exactly what I want out of my dating life. It’s made me take a step back and reflect on everything I need to work on within myself before I confidently get back out into the dating world. I’m excited to eventually get back out there and communicate exactly what I deserve/want with confidence knowing that what I’m looking for IS out there. 💗✨", "lavida_delisa": "@iamtineshia @_ambieeeee I loved this book because 1. You wrote it. 2. It made me feel like I had some control, knowledge, and power in my dating life which is something that I’ve felt like I had no control in at times. And I’m grateful for that. It also helped me get to know me more.", "taipace": "@jessicamtl @jujpolamalu I love this damn book! First off I literally read this & she makes you feel like she’s the homegirl who has pulled up for story time & wine & she is spilling all the tea. Through all the comic beauty is knowledge though. She gives us so much game about ourselves. How to navigate through love & rise from icky things & learning I’m not my past I’m not my ex this is doesn’t have to be mystery anymore! All in all ladies it’s a gem for masses! A true must read!!!", "merelygrace": "@jessicagreyourisman + @annjiehouston | This book is remarkable (and fun). I read it as a woman in a relationship to see if I could pick up any tips, and it taught me so much about myself and how to alter the way I approach my relationship and confidence. I haven’t felt more connected with myself and with my partner in a long time. 😍", "itsbrittanyhenry": "@mayaaa_glenn @jordynricard", "mike_ddzz": "@its.kerianne @_official_allie @ronnie.ddzz @haliahfate", "missymalii": "@izzybellybel @umaparekh, I love this book because it's not only educational but also highly entertaining (the way it's narrated and just the way it's written in general) ❤️", "artsyalexasylum": "I havnt yet gotten all the way through the book but I love how the information is presented. This book is confirming a lot of thoughts I have had but havnt had the confidence to fully delve into. This is an issue I've been pondering for quite some time and find relief in knowing I'm not alone and also that it's okay to be different than what society has made us feel we need to be in order to be \"normal\".. I love your style and look forward to finishing this book VERY soon!", "sexed.yam": "@rocioangelica16 @nicolemarinei I LOVED this book because it led me to understand that I can have control over the men that I meet and that using what is already in me I can attract whomever I want and deserve. Another thing I loved was how I could see myself in Maya @mayaschubert and how her journey helped me understand mine. #gameofdesire💚", "violet.notes": "Lend to @tsuki2330 giving it to @kitt.play.love 💖", "txen_atw": "The only audio boo i desired ever! I still want a hard tho! I havent been able to start tho book yet because the semester just started, but from your story, to your youtube channel, to all the people raving about this book, im excited to start listening (& hopefully reading😜) your book! What i love the most about it already is that it isnt just about dating. It was created for everyone not only to discover their true sexy selves & what they want out of a realtionship, but to find more ways to interact with ourselves and others. i would share this book with @cassandrapri & @brianna_nicole520 cause this book is right up their alley lol!", "shanacodada": "@heidipros @venusyola c’est un livre à livre ABSOLUMENT!!", "hadj_i_hadj": "I am going to give them to @nickiangell and @eva_suboticanec bcs we love phylosophizing about relationship, and this book explains everything in a fun way and covers all our topics and problems in love 😁", "chickie.magnet": "@icyskiies @anxious_senpai I love how this book helps you reevaluate how u date. From the perspective of a go-getter woman of color, I couldn't ask for a better author!", "kimmkimmxo": "@brendiiee @citlalli_garcia13 i listen to this book on audible and i love relating to other struggling girls, we all have issues and it helps me realize that i gotta step into my power and be confident, it also gave me a guideline for qualities i’m looking for in a job and a boo! ❤️", "macaroni199425": "Atm i cant afford i copy but i would love to read it", "woman_on_earth_": "Hi, im from switzerland🙌 I love your book because its very good writen and very specific. It shares alot of well information. Thats why i will recommend it to alot of my swiss german friends.♥️🥰", "randisavage87": "@theredlippedrealtor @sheacass I loved the book because it has actionable strategies for determining who you are, what you’re looking for, and how you can seek it out strategically. It’s also baked by hella science, which is definitely my jam. Plus, listening to @shanboody read the audiobook is the icing on the cake. I’ve already been telling my single friends they need to read it.", "belen.calvo.h": "@high_hoper @esperanza.calvo.c I'm almost done with the book (I'm reading it on Kindle) and I absolutely love it! I could give a million reasons, but I'll highlight its practicality! ❤️", "burkster_": "@wwalis i love this book because is super reliable and gives great advice. And you will definitely get my extra copy if I win", "oqechi": "@_belagrace @yin.kaa I'm loving this book so far because it gives you realistic and helpful advice when it comes to dating and also helps you to look at yourself honestly at the ways you may be holding yourself back and shares the steps to take to get you to understand yourself and what you truly desire ❤️", "gewald_m": "@joriendewaard @laurenmaria.b Love this because it has given me the language and tools that i was missing in the dating sphere. Like Shan says; this shit works!🔥", "rubberband.empire": "👋🏾 me @shanboody", "getchofeelingshurt": "Shut up bitch u stink", "soypesolet": "@itsamariixo @joyceanne_20 I loved looking myself in the mirror along with the other women, hearing their push back and feeling like I wasn’t too late in the game to improve in the game of desire.", "laurajane.mcdonough": "@nishagabrielle @_naomifeeney I loved this book for all the learning tools and quizzes at the start. Was fun to think about and create the \"This is how to love me\" document 💅🏼🤪", "leil_cooks": "You’ve been beautiful for my whole life😩😍", "callmecbizzle": "Already lended it to @andrea_fantauzzi_, @hlytee you can have the extra one! I LOVED THIS BOOK! It's been so long since I've read a book that easily and quickly. This book gave me a real understanding of who I am sexually and how to pursue men I'm attracted to but more importantly to HAVE SOME FRICKING FUN WHEN IT COMES TO INTERACTING WITH HANDSOME DUDES! \"Flirtation is communication with sparks\" ❤️💥🔥", "iamtwuan": "🔥", "mia.carnival.6ix": "@roamwithash @jenz_ramz ............ While my book was on delivery I was intrigued by the workbook. I signed up and took the tests and answered the questions that made me reevaluate myself as a person. When everyone in the world is trying to tell you who you are you tend to lose a bit of yourself. Each test including the questions affirmed that I am dope asf! But I also have some things that need to get dealt with. So I am looking forward to reading the book!", "clovercat_catherine": "@mlptt @tiffany Funny, down to earth, easy to understand! Like talking to a friend!! Love this book, and Canadian QUEEN🇨🇦🇨🇦", "adiosnigga": "@sunshiinered @elizabeth_blurose @gapptoof. I have two copies. But I will loan if and of my ladies are ready to face the world with me. 🥰. I love the book because it allows me to confront all of the dark parts that I put away. Reminding me that I am not my pain. That there are people like me. And I never have to feel alone in my desire for affirming, comforting, challenging but never hard... LOVE. Your book reminded me that I am great. I am deserving and that love is not far. Thank you @shanboody for everything that you are and have put into your art. 💓💓", "marriahbob": "@tiffanylitshae @racheal_carrillo i loved this book because it makes me step out side my comfort zone and take control of my dating experience. Too long I’ve been a passenger I’m ready to drive 😍🔥", "brittanytwhite": "@wheatneee because she’s the one who introduced me to the book after hearing so many of my complaints about my struggles and men @teeeeee______ because men are trash and we all need a book to help navigate that —- I love the book because it has made me reflect on a lot of my own problems and given me ideas on ways to improve.", "chantelkdh": "@ladii_babs @_fw.l3x I’m nosy as shit and this book has so much good information in it! 😭", "kristalbustillo": "Love that this book is really putting into perspective how much control I have in all aspects of my love life.", "halfpintty": "@itsparijay_ @twisted_pencilz I like the book because it made me understand how I find communicating about my romance likes/dislike is so much easier than communicating my sexual likes/dislike based on not only social/environmental influence but my “closed minded” thinking as well.", "poofimback": "🎂 🎂 Im lending my book to @__samantaa__ and I’m gonna give the free book to @kass_phrel . I’m loving the book because I do believe it’s possible to get better at dating just like ppl can get better at cooking. Also it taught me a lot of new versatile tricks for dating and outside of the dating area. As soon as you announced you were writing a book, i was instantly interested; you have taught me so much about dating, friendships, sex ... I knew that I would love your book. I also appreciate how you took the time to recrute every single women who was picked and it’s amazing how relatable they are; I’m convinced that the readers had no problem identifying to at least some of what one of them expressed. Because of this book I finally see dating as an interesting puzzle , it doesn’t have to be a chore ; thank you for inspiring me. On YouTube you were always giving us amazing free advice and you still managed to provide us with new infos through TGOD. Lastly, do u mind giving me ur opinion about my profile picture; do I look goofy or joyful? ♥️", "sweetqueenbeas": "@cali_beauty_of2 @shantastyle. I was planning on buying you guys a copy anyways but this really help me evaluate my dating habits and personality", "hope.wanderer": "1. Got it, love it! 2.@caseyest and @camrn808 (extra copy is all yours!) 3. I love that you aren't just a spectator but are doing the internal work to be liberated and confident within yourself and in all aspects of life, including dating. From the original intro, to the back cover; each section is a challenge to put away preconceived ideals of how dating (and life) should be and expand to a myriad possibilities that align with your true characteristics. The women are relateable, the book well written, and the advice raw and real. It's empowering & refreshing!", "juwonadenise": "My friends and I are all reading it and going on dates! Love it and your event was sooo much fun!!", "momcrushmonday": "@majoringinmotherhood @sammidee", "dw.xl": "@moorekenken @_lauryn_5.11 bc they deserve for this book to open their eyes to new experiences as much, if not more, as it did mine.", "jazyerra": "@skateboardp_92 @thatniceasshole I loved this book because I could relate and also tell my friends ways to empower themselves in the dating world. Rather it be promoting our natural smell (vaginal fluids) or choosing a picture or location on a dating site for more pick ups", "courtmoves": "💦💦💦", "risk_byclark": "Can’t enter cause I ain’t lending my copy to NOBODY😩🤷🏽‍♀️ I CANT take that risk !", "monikaonthedaily": "@hiphung @virgorockstar89 Guys this is the amazing book I kept talking about! One reason why I loved this book was because I was able to find out what my Frozen Five was... basically the 5 things I look for in a guy that should never be overlooked! It also gave me the idea to make a job description for the types of relationships I was looking for and I’ve learned so much from it 😍❤️", "des.tynni": "@vianaford @siennarodrii I love this book so far because it’s so open and allows you to explore dating in a way you might have never thought of. It’s a book that uses others experiences but also encourages you to use the mentioned tactics in your day to day life, it’s insightful and challenging... what more could you ask for?✨", "demomary2": "@csowa3 @valerierichfield @jennyk702 I will lend any of you it bc it’s so good! I loved it bc it was practical and gave you so many things to think about and work on for yourself from the quizzes to the experiments :)", "iamriagee": "@mariavschefner is who I will lend my copy to and @faith.honor.destiny is who I would give the 2nd copy to. This book is def a must read for every woman. It’s not only about learning how to be more “desirable” but also teaches you about who YOU really are and want in and out of relationship. I haven’t had the chance to finish it yet, but I’m def excited to learn more about myself and the “game of desire”. 🔥", "wook.trap": "I love how you address the idea that we seek training in so many other areas of our life but we stigmatize getting help finding our partner for LIFE! You’re changing the stigma of dating help for the better! Thank you ❤️@thebrandofb I’m definitely giving you the book if I win and @alixbeetheart I hope you’re enjoying it so far!", "hilla_rhea": "@yunng.coco @ms.esco__ tied between learning to flirt with Ari and learning that the power of dating is in our own hands / heads!", "prettycoach": "1. I already have a copy. 2. @thecyexperience @danijohn619 3. I love the book because I am able to use the tips in every aspect of my life.", "_kishla_": "I loved this book became Maya’s transformation was absolutely amazing!", "sarahrperry44": "@the_cat_lady @that.palindrome This is the awesome book I’ve been talking about & this is the cool giveaway that’s happening!", "thecyexperience": "1. Yes I have the book. Audiobook 2. @prettycoach @ayanalynne 3. I love this book because I could apply to more than just dating. It really made me do a deep dive into myself 4.reposting", "sophia.lazuli": "@xavier_triche @dolled_brinny_xo I loved this book because it showed me that in order to be in a relationship you need to fully understand who you are and what you want and never settle for anything less ✨", "taishaun.elite": "I have to hop on this book", "vasi_trof": "@elianamilgromm @delafee Because it demonstrates how all the relationships with others start to form with your own thoughts about yourself.", "withlov3_kem": "Your book is absolutely amazing, the first few pages had me rethinking everything I've done, it has been conversation starter with my friends.", "ahoyyealex": "@shel.diablo & @sandracvela I knew I needed to make changes in the way I approached relationship of all kind but I was at a loss for the what and how. Reading the book helped me realize exactly what I needed to work on and made me feel so in tune with myself. Having the participants experiences made the work toward self improvement seem less scary and more tangible! It’s such an incredible book ❤", "sabbii_g": "I love this book because I see so much of myself. I’m that person who wants to meet someone without going out or going online. I’m just not with the outside world. Your book help me see the world and myself in a different way... I can setup and control my environment not only with the power of conversation but also body language. It help me feel more confident with not only dating but just regular friendships. I’d lend @taj_taj_ bc I know where she lives and I can get my book back lol but also bc she’s the complete opposite of me she’s not afraid to go out or after the love she wants but The Game of Desire will help her hone her skills but also help her narrow her picks. I’d give @br0wnskindbeauty a free copy bc although in a long term relationship there’s so much more for her and her partner to learn about themselves and each other and rekindle that Fire!! Thank you for this body of work @shanboody", "allthingsteemz": "1. Whew I own the book. 2. I will lend my copy to @kingkwynn and give my extra copy to @thelifeof.kiara . 3. One reason I love this book is because it doesn't just give you a bunch of quick tips. But in order to reap all the benefits this book has offer it requires that you be honest with yourself, and that you do the work. And lastly the book is beautifully written. I'm already in a relationship, but I bought this book because I love and support @shanboody and I know I still have more to learn. Okay that's more than 1 reason but fuck it. Love you Shan and thank you for this gem 💜", "brainfrequency": "@mtnpigeons @dopeass_witchygram Love the realness!!!", "brenda_422": "@marciaita @shaeloves2save", "ar.quesea": "@arguableolive @st3v33zy This book allowed me to learn a bit more about myself. I loved reading other people's experiences in the game. I related very well to some of the women before the their journey through this book and it just showed me that its possible to be find love in another person and in yourself as well.", "jaywinterr": "@jojo__baby @wolfjmcfarlane", "alexandramercedesd": "@brianny2000 @adii.marie ... I just really loved learning about what type of things get me excited because I'm new to the whole learning about my body.", "_imanidelvalle": "@dejj__m @faisonedd I love this book because it’s not just sex and dating! It is personal development. It is self discovery. It is empowering people to go after what they want and deserve. And mostly it is changing our conversation about sex, sexuality, dating and so much more that society tell us is set in stone! ✨❤️", "dianaslife2": "I pre ordered it but because it’s the UK i haven’t had the chance to read it yet! 😩😩😩 But i love the little excerpts you post on IG and how every little advice has been given from different kinds of people so it resonates with more ‘ types’ of people than usual dating books do! It also teaches you confidence and literally it embodies your fierceness and lets us find it in us,too! ❤️🔥 I’d give a copy to my sister @wooyoum2 and lend mine to my other sis @bianka_94 🙌🏼", "iamcelinem_": "@donya.mg @_jorlyseee", "nottooordinary": "@sweetestea @ms_smith88. Sheesh only one reason? Uhmm, the power of knowing where you can be better makes you better. It's an in-between the lines thing but I definitely learned that through this book!", "jsogalla": "I love this book because it has encouraged me to gain (and make smarter moves that stem from) deeper understanding of self", "ashleyconceicaotavares": "@lizpopss @lashannonnnn I love how this book can relate to people from all walks of life and is inclusive 💕", "healthylivingwithjoanna": "@alexandrahaitas @dina_sfks ... ladies this is a great book and a must to following @shanboody", "rumorjazz_it": "@soulcial_justis & @_whitneysarah I loved this book because it showed me how to have confidence when approaching the women I’m interested in and that no one is out of my league. Oh and @itsarifitz is in it❤️", "agnes.elena": "@delss.a @feliciacroset I loved the book because it is full of stories and experience", "rmirage92": "@g4ster and @lotoyasd. I love the book because it provided a step by step guide on how to gain confidence in dating and relationships by narrowing down what you want and abiding by it. It showed that having confidence in this area can spread to other areas of your life because building and maintaining healthy relationships is important to grow as a person in all aspects of your life. Containing stories of the average woman's common problems with self-esteem and men in an honest way, made them more relatable and gave me more confidence to try out the techniques listed. Because ultimately the book is more focused on the journey to self-discovery instead of the outcome of having a partner. And yes the journey is rough and up and down but taking that chance and pursuing it will teach you about yourself and start the journey of loving yourself first before loving someone else.", "exquisite_destruction": "@jeonsieva you already have my copy and @athenaalia you’d of course get the extra one with how much I talk about it!!! This book was the first of its kind that I read and weeks later I’m still ranting about it. I loved how it simplified everything and as someone who hid behind walls, always attracted people with commitment issues, and never thought that girls could make the first move I am so happy to say that my mind frame has completely shifted. Work on yourself first and then shoot your shot 😂😂 As a guyanese I’m loving that you wrote this because it’s honestly a topic that is so stigmatized in the culture and the topics you cover really need to be discussed more within the community! The little tidbits about Guyana and the little creole in the book honestly made a sis glow with pride 😩😩❤️❤️", "kousalya_2510": "@madhu_5700 cause I trust you with my books and @tt_reddy cause you NEED this book (trust me on this) ... this book answered most of my relationship related questions in a way that I understand it 😊🥰🥰", "alexatoribio": "Absolutely loved you touching on Maslow’s hierarchy of needs! It’s so important to get through the basics before reaching for the next level. Highly recommend to @nelidacollazo @thehotchocolate ❤️", "whatsupwithwhit": "@nettiie_ @jesssrocks there are many reasons why I loved this book but one of them was because it helped me do a lot of work on myself... taking all of the quizzes to find my love language and apology language finding out about new aspects of my personality from talking to my ex were all aspects that helped me work on me... also loved the triangle square tip which has helped me get guys to actually approach instead of just staring at e/o all night", "illnessink": "@lecwalexis @pennedbypaws This book feels like you are having a great conversation with your best friend. It's incredibly informative without feeling like you are reading a textbook. You managed to find such a perfect group of women that could highlight so many of the different problems someone could have in the dating world, or even just with themselves. It challenges you to figure out who you are, what you want and how to apply that in your everyday interactions. ❤️❤️", "reap_sow_tati": "@malica_love @lamontpitt I looooovvveee this book because it’s like you telling you how to better yourself annnnddd how to adjust to a better dating life. I love self reflecting y’all know this but this book made it easier for me since it’s literally a step by step guideline 😍. Now I just have to figure out why I keep attracting older men 😂.", "slnayaxo": "@sandrawairimu @not_simon_ I love this book because it brought interest into my life! I was able to step back and see a better version of my self! Scraping up my college coins was worth it!! Thank you Shan for what u do!", "findpeacewithin": "@marvelousbre_ @lavagirl_2.0 I just purchased it today, but I've spoken to several women that have read it, and this is their first response 🤯, I'm sooo excited 😁 I just moved so hopefully I can begin reading tonight before bed", "itsjessiebt": "@travelforchangeblog @lalitalune this book is a game changer! Self-help meets modern dating. We truly can take control of what we want in our lives and manifest our innermost desires✨", "dyr3dgurl": "@mullatto35 and @bottomlinestew. This book has been such an eye opener for me and the things I’ve been doing wrong. I have encouraged some many people to check out the website do the quizzes and even the workbook. The better you understand yourself the more you realize your value and what you truly bring to the table. If it wasn’t for @authenticallyadrien introducing to listening to a podcast from The Friend Zone podcast I almost missed out!", "zoevikstrom": "@helenawestphal @mimingtonn you HAVE to read this book!!!! It is about dating, but I actually found it super helpful to my long term relationship. I’ve been in a relationship for several years (and you guys have too!) but I found these dating concepts to be super refreshing and I applied them to how my relationship is now! Also- check out the workbook that comes with the book because it was really helpful for seeing how YOU are in a relationship but also what you need in a partner 🌟 I know this is a giveaway post but I genuinely think you guys would really like it ❤️", "kimmycoqueran": "@taylorrmoraless @simplyheav This book is so different from any of the others I’ve read before. The way that’s it a social expirement but easily made into a book that keeps me wanting to read is amazing. As a young woman I hope to use this book as my guide.", "this.is.jasmin": "@snuggglefuck @nerdpie I love the game of desire because it’s an affirmation to our agency in our birthright to love for ourselves + each other <3 legit, I’ve been team shan since these girls are wild days because I loved Andrea. But your vibration has remained in my life since then. I’m so grateful for all the ways u have us vibrate higher. Steady cheering for u <3", "_martamakeupmua": "Lol battygyal uses her vagina as perfume", "franneedoolee": "@terichhhilaaa @chelbelle817 YO! I love this book b/c it’s not just another regular degular dating advice book that tells you to change your entire to self in order to get a man. Instead, it helps you learn about yourself, all the good and complicated things, and then feel more confident in pursuing and having a relationship 👏🏽👏🏽👏🏽", "nadinearaksi": "1. Just finished the audiobook (and started it all over again for round 2!). 2. @stacemunro and @katiebrooks82 ♥️ 3. Listening to the stories of the women going through the course taught me that I have power that I’ve been giving away. Plus I fell in love with all of them and having @shanboody read me her own words was powerful and authentic AF (couldn’t stop at just one!)", "krystle.nicole": "This photo is everything 🙌🏽", "withlove_stef": "@evermorelenore @___deniseeee I am still reading, but I have especially loved the idea that in other aspects of our lives, like our career or school, we are taught to seek help and educate ourselves to be successful - so why not also educate ourselves in building successful relationships? A simple idea, but interesting in practice!", "_kaylondon": "@hellotanda @jiingaling I think this book was the first time I laughed out loud and cried realising how much I needed to focus on myself and dig deep. That initial task to ask your ex where you fell short made my tummy tighten. I was afraid my darkest moments about myself would be put into words in the open. Big love to this audiobook", "littlemissrijos": "@its_simply_cila @neekab00 I really want this book it’s supposed to be 🔥", "dravendarkwyr": "@acaciameara @b.chrry", "___alexisssm": "@naturalbarbie77 @amayamartin98 An absolute amazing read. I am loving how insightful and eye opening this book is. It really makes you dig deeper into you’re true self and explore all aspects of who you are & teaches you keys to overall success, not just in dating. Would recommend to young women everywhere .", "tres_leches_": "@asquaredd_ @kayla_hoffman_ I love this book, gaining some tricks up my sleeve", "myblk_is_beautiful": "@theplantbased_bap @therealchenoa I loved this book because I saw a little bit of myself in each of the 5 women that completed the program. To hear( because I have the audible) their success and growth throughout is admirable and a testament to the potential for success by believing and trusting yourself. I felt this book wasn’t only about dating, but about self love more than anything. When you truly love yourself, that love overflows into other aspects of your life. This book was one of the most inspiring pieces of literature I’ve read(listened) to in a long while. I’m hoping to win the grand prize so that I’m have the hard copy as well 🙏🏾🤞🏾.Thank you so much for dropping these gems! 💖", "shayewest": "@kamals15 @shirlitas_way I loved this book because shit got real. I loved focusing on playmates for practice and finding out what my love language and apology language is. Finding out more about my self helps me in dating as well as career and interpersonal relationships. #notjustfordating 🙏", "jcordero912": "@janellemariec and @lopezmarynis. I love this book because it teaches me how to identify my weaknesses and strengths while dating.", "carmiaray": "Currently working on my copy, but loving it because woman are 💪 and don't need settleee but be true to yourself and figuring out how to do that with confidence is so important. 💗@asianaj_ @misss_xoe and Caroline who has no IG but she's in on this too lol.", "laura.iokim": "@sama_dot @jane.luisa ahhhhh this is the book that I wanted you to read. Would be amazing to get an extra copy. I'm so excited❤️ the book showed me that I can be confident in getting what I want and that I should not only rely on other people. I love to see how this is blowing up. You are constantly doing amazing work @shanboody ❤️", "kai.eli17": "@tayler.moon @jxrdvnnnn I’m loving this book so far because it’s making me think about myself in a way that I haven’t before. But more than that, I love that beyond reading the book I’ve gotten to talk to Courtney and she’s helping me kind of break down the parts that I didn’t let myself fully understand. I can’t wait to see where it goes, and then do the workbook ☺️", "hannyherself": "@baldsuperwoman @gcatjones sex positivity and woman’s liberation!", "jonyhaspizza": "Omggg. Haven't read the book yet but i'm sure i'm going to love every page of it. @marissakroese @anneke__b 💗💗", "morenitabonita__": "Aww I neeed, my sis met you a couple days ago in nyc and she’s been using the crap out of that paper when it comes to her clothes and following your tips in the book. Shannon you are a force!", "domvharris": "I love the book cause I adore the author, like laid I appreciate the organization. I enjoy the science. So for her to make dating and relationships science. Made sense to my ♒️ left brained self. @_brinikole @jantherealist", "xoxojasmined_": "Sent my copy to @b_magical I’ll give my extra copy to @grissx_ cause I learned somethings about myself and dating as a whole that I feel so many women of color need to know. 🥰", "tatianna.angelica": "@paula_daniii @xo_delilah This book helped me recognize my flaws, insecurities and strengths in my long-term relationship 💛 and of course I loved it because you wrote it 💁‍♀️😝", "__devy_dev__": "@glendamarie26 @mandypena1 this book really helped me to figure myself out. I was able to clearly put into words how i like my love when i gave me an honest and detailed explanation that i owed myself. This book inspired my growth, it’s taught me to focus my intentions on exactly what i want from my man. I’ve already ditched two guys and cleaned out my wardrobe! Thanks so much for writing this book 💕", "geniedreams": "@namrah1.0 @maz.misty my copy just came in last week!! 🤤 this book taught me that you dont gotta look a certain way to be seductive and confident!! its helped me so much in relationships other than romantic and sexual as well, plus that necklace is a NEED lmao 👀", "oliveyou_olivia": "@alyxg @mandypooh06 I loved this book becauseeee it is honest, REAL, and written from the heart to help women WIN in the world. ❤️", "jenndulu_nutrition": "@myanngram @bw.irene.... just here trying to win this books for you gals coz you will totally love it. Been referring to it and quoting it in our conversations coz it’s so relatable and true", "chare_bear13": "@kellylouvene @cj.pierce Read the whole book already and loved it. Even if you’re in a relationship already, I think this book is great for everyone. It really makes you think about and put you on the path to discovering the core of who you are (if you didn’t already know) and reinventing yourself if need be and the way that you interact with other humans...not just men you’re trying to date. This book will prime you to reveal the goddess within.", "_vousallezbien": "@shanboody is this contest open to Canadian residents ?", "khaleesireds": "@deanna.chong.0827 @ellenyd - I would be lending and giving my copy to these ladies. This book is more about dating. It’s about stepping into who you are - boosting your confidence - boosting that empowerment mentally, physically and sexually and it’s getting the shielded part of you out there and confident in knowing what YOU as a woman wants in a significant other and in a relationship moving forward. For women and men by someone who is educated beyond measure and is not afraid to put her own experiences and those that she learn from people around her into a book for all of us to learn and read and experience.", "chiccritiques": "@farrinheit_ @ranessarozayyy I have her audio book and it was Dope! Learned how to understand my influence as a woman and where I can add value to my dating experience. Also so many of her stories with these girls she worked with we HIL Larry US!!", "vivvski": "@zoezinha__ i’m literally sending you my other copy tomorrow haha and @lukeawright you should read this too (truly, everyone should!). One reason i loved this book was that it is such an incredible, comprehensive, resource on getting what you want. Not only that, but figuring out yourself and what you need and want in the first place! It’s a resource for fulfillment in every aspect of life 🥰 THANK YOU for writing this!", "santothebeach": "@_vashthegemini @caribbean.cece I loved the book because it doesn’t just tell you what to do but how to do it. It also shows that even though it might not be easy at first if you make the effort you’ll definitely see results ☺️", "moniquensmith": "Got it on Audible. This shit puts the power back into dating where we used to sit around waiting to be chosen. You guys already know I love this book cuz I can't stop posting about it and i'm tagging you to help me win free tings 😂 I'll lend my copy to @casidon cuz you all the way in JAPAN and i'll give a copy to @xchangalangx cuz you already love her YouTube channel so you'll like the book too 🌹", "heyitsginabe": "@pianteb @tiaramarie_tee", "shellyifyanasty": "@symone.paige @_nayssa ... I absolutely loved this book (just finished it today) because it showed me just how much more I can get from my romantic experiences if I take full control of them and put in the effort into attracting who I want and not just who wants me. Will def be sending to you guise soon!", "marguga__": "@mavetdominguez @bendnblend it is practical, empowering, makes you feel understood by one of the women in the project and it roots back to the importance of self awareness and self love ♥️", "a.dancing.mama": "This book despells the myth of dating/love/soulmates/great sex happening by chance and has SO much research, science, and psychology behind it... it feels like you just opened up a book of secrets 🍯 I love it. @urbanjungledesign this is the book I was telling you about, @bombshell_beauty01 I think you’d love this ❤️", "laydee_west": "I love how the book was entirely relatable to me despite already being married. It has sparked a fire inside of me which has me flirting with my husband in ways which I never did. It is almost as if I am courting him all over again. @life_lived_essentially @leclair_maria are two of my girls who I feel will benefit from this glorious manual.", "alloranicole": "@lindsey_wade @mk.feuerstein The main reasons I love this book are because it makes the dating experience not seem so lonely and abysmal and it really helps to get a deeper look into one’s intimate self.", "libbymarquee": "@londynkeyz @fijimelons loved this book because it allowed me to evaluate who I am as a lover and friend. It then helped me get a sense of what kind of lover I was and help communicate that to anyone I’m dating from the jump! I was able to close doors and get closure from my ex what I asked him in chapter 4. Some relief was let out! Best advice yet", "cnsloan_": "@ebonydesirae @beejean629 I LOVE this book because it helped me to truly understand myself down to my core which has now allowed me to communicate my feelings and needs in my relationship with confidence and conviction. Bonus: it made me feel like I’m not alone in my feelings. We all have our gripes with dating and there’s so much power in sharing ♥️♥️♥️♥️", "tht.gal.kris": "That wet look on your hair 😍", "afroroseblossom": "@olive_lucy @haylemariee @hunchojazz_ Gawd, why do I love this book? 1) I can't put it down 2) the knowledge in it is enumerate 3) I love the principle of working within before you step into the world trying to make things happen. It's a wonderful read and I'm so blessed to have a copy! It's damn near glued to me!", "sexandempathy": "@hjbergeron_621 @elizabethramirez4 I loveddddd this book because it's teaching me about the key to introspection in successful dating. Know who you are so you can get what you want ✨✨", "thename__kingg": "@xoabena @xo_niemaa I loved this book because each woman was a little bit like me", "ebonydesirae": "The reason I am so grateful and in love with this book is because it is more than just a dating book. Regardless of relationship status it teaches you so much. How to become the woman you wish others saw in you. How to manifest your confidence when it comes to dating/stepping out of your comfort zone. I don’t think you could read this and not walk away with something useful. Thank you so much for giving us this amazing book 💜💜 @cnsloan_ @kayseymarie_", "spelledlikebobmarley": "@itskonemanee_ @sydney.holdright this book is so relatable & makes you put in WORK. That’s why I luvvvvv it 💗🤩", "gameboycj_": "@ketssiaa @jaew3y coincidentally, i already have a friend borrowing this book. but, i loved the knowledge it already gave in the first few chapters & also flipping the script of what dating means especially for woc i needed to let my friends know about this amazing book :-)", "dutchesslainie": "@vicky4nier and @baileyforfar - I love this book, my girls already know I can’t stop talking about it. Shan, my favourite part is your writing because I feel like you’re just having an informative and hilarious conversation with your reader! ❤️🙌🏼", "theboujiebudgeter": "@idontdobudgets @thecapitalwoman this is such a great read for women entrepreneurs! Past dating it’s all about interpersonal skills and knowing how to grab the attention of whoever your audience is. We have to dominant the dating scene and the the business scene to come out winners.", "unanchor": "@wise.river and @itsgilldoe because it's not just about dating but how to excell in all social interactions. Love this book because it helped me realize my strengths and weaknesses in an empowering way 😘", "hellotanda": "@_kaylondon @jiingaling I learnt SO much from this book most importantly this quote touched my heart ‘you can become who you consistently choose to be’ it digs deep, made me cry and is completely true. 📕💖💫", "theskshow": "@laura_ashley_l @arreal32 @chante_devette I’m literally obsessed with this book! Several reasons: 1. She stated we are taught to be bold and specific when investing in things like our careers, dreams etc. So why don’t we treat our dating experience like a career. After all this ish is serious. 2. It’s coming from a prospective no one else is talking about. Use dates as an experiment, until you figure you out. It’s freaking brilliant! 3. I’m going to invest in my circles dating life. Each lady I’ve tagged, including myself, I plan to coach and undergo these 5 steps!", "hlytee": "@callmecbizzle !!!!", "mfarris07": "@mikelqaz I have a copy for you I bought at her signing 😜 @brittneydawnnicole this is the book! Shan is a bad ass who depicts love and relationships from a strong woman’s guide. Being playful and flirty! It’s amazing!", "janellebandayrel": "@ohkaylyn @kmduclayan got this book the first day it come out! I absolutely loved this book, one thing it has taught me is to get out there! We can’t stay in our comfort zones expecting things to change, discovering how much of a bad ass I am has helped me to realize how much fun dating can be and the power I feel is amazing ✨", "marsha.jeune": "@amyannia @moamazinthanyu I love this book because it's not just about dating but about getting to know yourself more and owning your power as an individual. It's filled with lots of activities and quizzes to help you figure out what you really want in a relationship", "ms_leahr": "@helloabbyr @anniemelissa.events. I love seeing the different women's personalities shine through as the go through this journey with Shan.", "kyshab_": "@simransnath @naomicheyanne needdd🔥🔥 this book reminds me of our convosss", "sadiedaniel": "@sammiedaniel @love.lorelai this book is so relatable! It’s completely refreshing, and down to earth. ♥️", "b_e_brown": "@isa_collazos @mackmcg15 yall know how obsessed i am with this book. I love that it's more than just \"think about sex so your pupils dialate and you look sexy\". Its about taking charge of your being and most of the skills can be used in other aspects of life. ❤️❤️", "alexwalkerjones": "@kiwi.to.my.heart @lurking_lilly I’m actually still waiting for my book to be released in the uk (I’ve preordered and i’m counting down the days!) i’ve already learned so much about myself by watching your videos and learning from the experiences you share!", "rebeccamaloneuk": "I'm gonna lend it to @arthvrs we are both big fans ( and he will read it when I leave it lying around the house 😆) and I would give my extra copy to @akeilabrowne because we really want to bring you @shanboody to the UK to do an event with us ❤️❤️", "asteroid_": "@cece_flores13 @iam_whateveryousayiam I L❤️VE this book because I learned so much about MYSELF. The more I know who I am and what I want, the better I can communicate that to others which makes dating easier. It is helping me gain confidence and ease my doubts. This book gives me a positive outlook on EVERY experience/encounter as opposed to feeling defeated whether it goes well or not. I especially love this book because I got to meet Shan at @thelitbar and got a special note just from her ❤️", "lillikatharinag": "@leonie_w1105 @gwenyfer.k i love this book because half way through it has already tought me more about myself than 12 years of school", "mariamora.nyc": "@twopoundsofraw @bnayy I love this book because it motivates me to look at dating from a different perspective. I'm beginning to feel more confident on how I approach dating and most importantly, how I view myself <3", "shitneverworksout": "@hadisonmernandez @stcyhndz I loved this book because of the groundbreaking experience of the women in the book & understanding just how much I truly resonated with them struggling to love/understand themselves thus struggling to create/build healthy relationships loving other people. Ily ily 🥺👼🏾 (also shoutouts to @hadisonmernandez one more time for ordering this book for me)💞💞", "keepin_it_kae": "@mindovermars @the__lioness_ I loved all the experts that you brought in to talk with the girls. It was a whole 360 view for the game, and it didn't focus on just one aspect!", "lesleyannparris": "@synner_g_ @susanchauuuu definitely still lending you the book, once I finish taking all my notes! Lol. I loved that it put a mirror up to myself for me to learn more about who I am and provide an opportunity for growth. BUT it was honestly beautiful to see the growth the women experience (shed a few years,can't lie🥺).", "erinnekolek": "I'll send the extra copy all the way to your hometown, Toronto, to @thatchick_jasmine and @sarahannleon can borrow my copy <3 o <3 Love this book because it's teaching me how to learn the ways I like to be loved. It's also great for learning ways to have confidence during social interactions!", "jkyhcbll": "@kailahomega @glowria93til 👀", "aye.ahbee": "@ever_despondent @queenelephnt The main reason i love this book is because it’s really making me learn who I am as a person. It’s forcing me to understand the way I work and how I approach things. I didn’t know any of these things for the first 30 years of my life. It’s a huge eye opener and I hope that I will really be able to grab life by the balls.", "theoriginalbsto": "@msdomi13 @oilyolives00 ... one of the many reasons i loved this book is becaaaaause it read like a conversation or book club with my friends 💙", "jay.chance": "@joeybauchle @katieharbridge I love that the book can be used for anyone in any area of life to be more desirable. Get what we want ! ❤️", "tisworthit92": "That necklace is the absolute most best...best thing ever 😏."}