{"therealchelseasmith": "That’s such a back handed “compliment” and extremely shallow and creepy for someone to say. “I just hate that other guys were lucky enough to be recipients of having sex with hot babes like you trying to find themselves.” Typical, shallow sleeze ball. #Gag 🙄🤮", "emmy_cee": "My partner of a decade is the nicest person I've ever known in my life and not because he wants to have sex with me. He's nice to me, his family, his coworkers and, most telling of all, complete strangers who he benefits from in no way. Maybe this commenter and I have very different definitions of \"nice guy\".", "tres_rose": "Yeah I used to have this mindset when I was in highschool, but I had to learn on my own that it's really a matter of confidence, and not having expectations. I didnt change a thing about my principles or anything, didnt care about a body count, didnt care to date many women, I just knew what I wanted. So I did things, and put myself in situations to build confidence. I was terribly shy. Many self proclaimed \"nice guys\" sometimes feel women owe them for their favours, or that being \"nice\" is what is holding them back. That's false. The difference is a level of confidence, not being a pushover, and understanding she owes you nothing. A real nice guy with those attributes will not go unnoticed.🤷🏾‍♂️", "leahhvioletta_": "What I’ve realized is the respect and love and loyalty my nice amazing handsome boyfriend gives me is worth wayyy more a pretty face that doesn’t value me.", "real_iconic_images": "It sucks to say this, but NICE GUYS really do finish LAST! All of you women in the comments who are now happy and proud of your nice guy picked him LAST after finished dating all of the bad ones..LOL", "catiaspi": "A nice guy is nice. A nice girl is nice and attractive And has a socially acceptable amount of partners and....... I hate that nice guy crap. I really do", "itsruthbb_": "\"nice\"? More like entitled. Don't nice people say nice things and not put people on pedestals based on looks?", "belle_femme__bouclee": "I married the nice guy. We’ve been together for 18 years now....”nice guys” don’t usually call themselves nice guys. They just are who they are. 🤷🏽‍♀️ and nice guys aren’t pushovers overs with no sex life; they just move different. Guys who call themselves nice guys tend to be immature little boys in the body of a grown ass adult.", "chanel.cummings": "@welcometoroom3228 this should be a topic for an episode", "astonbrielle": "@segour 1 point for team nice guy right?", "thatprocrastinationgametho": "Sounds like an incel", "kenzy.bb": "Lool entitled much ? Sounds like those men who think not getting any equates to being opressed... As if it was their God given right to get laid or something 😂", "devodevo": "The notion that this guy assumes that being a nice guy entitled him to sex and that is all he’s focused on is a real nice red flag. Doesn’t even mention relationships or dating, just goes straight to whining about not having sex with “hot babes”. Oh boy.", "worksoulflow": "YES. @denvsthename we are seriously psychic (or something 😁)", "tabiacharles": "I'm with a \"nice guy\" and to be honest \"nice guys\" win when it counts.", "mara_loveinabox": "So glad I found you through @khadeeniam and @iamdevale podcast", "samantha.m.512": "🙌🙌🙌🙌", "jjohn0145": "A mans compassion and genuine “niceness” has no real value until a woman has faced a relationship, or relationships, where her carnal desires fail her. The swag,money,hot boy pursuits lead to heartbreak will have a woman question her decisions-this holds true for both genders. This guy seem to just have no confidence and cares too much about having a relationship as a fixture in his life .", "callme__kiaaa": "Exactly! People want to focus about the part where their “nice” okay what else? Is someone turning you down soley because you’re nice? Or is it because that person isn’t attracted to you physically? Are you loyal? Are you confident? Do you have the ability to take control, and be protective if needed?Maybe you’re too young, immature, or lack common interests/goals/commonalities/ morals etc., people saying this irritates me because most women do want a man to treat her nice and gentleman like. But at the SAME TIME we’re not basing dating you off you solely being “nice”. Please be able to have a back bone and take control as well cause that’s also a top reason i know that women don’t actively consider “nice guys” because most show passivity in certain situations. Women want to have a man that is able be nice and sweet to them, but also be able to speak up and take control when needed.", "cassie_stanton21": "That self titled “nice guy” sounds like an entitled fuck boi", "queennotifah": "🙋🏾‍♀️many times the guys that claim to be nice, actually aren’t.", "bwell_somenterespire": "Huge difference between \"nice\" and \"kind\"", "mylifeoftheblue": "Clearly the end goal for him is to “have sex with a hot girl” too.... which is NOT attractive. It’s not like he’s owed sex for being nice and he wants every girl on the web to recognize that... what a weird thing to write!", "emerykaye": "Nothing is sexy about whining ✌🏼 we pick winners not whiners", "iam_prophett\nVerified": "Verified", "littlewookietaylor": "🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️life partner = the nicest guy I’ve ever met!! 🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️ 🗣cause I read the caption I wanna participate today🗣 in my opinion, if you’re bitter about not getting laid then you’re probably not a nice guy. Nice guys know their values and hold integrity, not nice guys think they’re entitled to x. Y, z, including a partner. I think the folks who think they’re “too nice” are usually the ones that have a mindset of “if I give this person what they want they will read my mind and reward me how I want.” (Which credit where it’s do, that’s how most movies and TV shows and porn work - so it can be easy to think just cause you don’t hit someone or verbally abuse them that you’re point blank NICE”) nice as a transaction isn’t nice as a character quality.", "itstracyg\nVerified": "Verified", "batmanbambi": "I’ve heard someone put it this way - the ppl you date are not the people you marry. Maybe we date assholes and settle down with “nice” guys. 🤷🏻‍♀️🙏🏼", "k.t._.moore": "He one tweet away from being an incel shooter 😂", "heinzketchuppp": "@shanboody Idk if you’ve ever heard this perspective but I recently realized that I had been operating as a nice girl in my relationships/situations with men! Like my ego was really feelin some type of way when guys didn’t choose me. “How could he not choose me, I’m perfect?”, “I’m a good girl how could he be with her?” “They always choose the girl with more sexual experience over me.” like seriously these are the thoughts that I had in my head. My identity was literally rooted in being the nice good girl. But I too had to do the inward work of asking myself what else do I bring to the table other than being a nice good girl? And when I really got down to the heart of it, I have an abundance of qualities I can possibly bring to the table however I wasn’t 100% confident in those qualities. What I am 100% confident is I can be nice. I can be a doormat. Pick me, I’m a people pleaser! That’s what I was taught kept a man...basically not being my true self. And when they didn’t pick me the people pleaser I’m salty because I was ready to quite literally give up everything for them. But they don’t want that...and truth be told neither did I. I didn’t want to be that person, but I just wasn’t sure if being my true authentic self was worth it (isn’t that crazy?). For me, It’s about being confident in everything that you are with or without someone and standing in that. I’m operating in the space now that I am amazing. I am intelligent, funny, sexy, the coolest girl you’ll ever meet. I can’t wait to try again whenever the time is right and bring all of those things to the table instead and see what comes happens. I just wanted to throw out the same thing happening from a woman’s perspective! Ego is ego whether you’re a man or woman, and when you’ve never been taught the truth your ego really starts to believe all the lies. I’m a new follower of you and your work and I am just so empowered by you. I am a work in progress right now and doing all the therapy and self work haha but man is it wonderful to know that I can flourish just like you on the other side! All love❤️", "blaqmoonmami": "👋🏽 def been with the \"nicest\" person I've dated for 6yrs. Kind-heartedness is a winner long-term. I feel like a lot of \"nice guys\" may see another nice guy who has swag (aka confidence) and sex appeal and perceive him as a fkboy. The trick is honestly just rocking who YOU are and being a good person, that's what wins.", "the1_and_only_ledgers": "There's no red flag bigger than \"I'm a nice guy\"", "kvnnxdy_": "I used to think that I was too nice and that’s why I wasn’t in relationships in high school. But after I graduated and had a relationship, I was praised for being so sweet and caring and thoughtful because they had never been treated that way before. So ultimately I agree that the “nice” guys actually do win and sometimes it make take longer to find a mate but to me that’s better than having to go through heartbreak and the same relationship process over and over again", "xxvelmadanklyxx": "❤️", "angieofficiallyinthecity": "I'm marrying the nicest most thoughtful opinionated humble guy i know🥰🥰", "cennagh": "First boyfriend I ever committed to and publicly said hey this my boyfriend is a nice guy (even maybe a too nice guy he’s working on it) none the less we’ve been together for almost two years and all the “bad boys” I was interested in before I never fully put my time into", "simplystylishzoey_": "I have", "earthtonedd": "engaged to the nicest guy I’ve ever met 💗✨", "mayameup": "My husband is the nicest most kind hearted man I know. Women love nice men. Men who claim they are “nice guys” are most likely not nice and feel entitled to female attention.", "mellamocici": "Who ever made this comment sounds like a 14 year old. I hate seeing men say this 😂 this line of thinking just screams emotional immaturity, entitlement, lack of self-awareness, and pride. THOSE qualities are probably the reasons you’re repelling women. Being a nice person should be a default trait, and it does not mean the world, or the opposite sex owes you anything.", "jasmillmelisa": "Team being authentic. Team being kind. Team spreading love. Team personal development ✨✨✨✨", "kabanane": "My partner is a major sweetheart who puts himself first and loves that I do the same. He's allowing himself to be vulnerable with me without putting all the weight of his emotional labor on me and I do the same. He caught my eye by being himself and honest through and through, by being truly interested in what I have to say and who I am and by sharing my battles and values. I feel like it's some basic stuff though he's never had to tell me he was nice for me to know he was good.", "but.shay.tho": "Guys who whine about nice guys not getting sex are in my experience, not really that nice. 🤔", "gynesys": "My ex was a \"nice guy.\" He called himself that in jest but I think he genuinely believed it. You really hit the nail on the head. People don't like \"nice\" people because they always seem to have ulterior motives. \"Nice\" is a fiction we presume lives in other people's heads. Nice is like being \"real\" or \"honest.\" If you have to announce it, it's probably not legit.", "jasonzheng18": "Stfu and stop being a little bitch lol", "thegreatbaybino": "Guys that call themselves “nice guys” scare me. It’s often really “I’m being nice to you therefore I am owed your attention/sexual or romantic interest.” That’s not nice that’s entitlement! Run! Lol", "amandaqfox": "What if the measurement of nice? What makes him think he’s so nice? Who has verified this? 🤔", "pascalle_": "I dated mostly nice guys.. However I don't like pushovers or men with no backbone. I havent found THE niceguy for me YET. But I'm pretty sure he's out there for me. Anyway being bitter or jealous of badguys is not making him more attractive.", "bleusclews": "✋🏾#TeamNiceGuy but don’t push him😂😂😂😂", "clairenatalia23": "Pls do have a group chat, app or something . That will help young ladies like me who grew up in strict family and know less about ourselves as women , or things related to to sex who will ask questions or know more .", "daljiimara": "Why does he feel so entitled to a waning simply because he’s a “nice guy”? A woman doesn’t have to give you the time of day if they don’t want to.", "queenchewbacca": "Definitely dating the nicest guy I know.", "maya.deshay": "I take huge issues with comments like these...it shows a scary level of immaturity and ignorance among men. Yes we all, men and women, go through stages in puberty and as young adults when we're unfortunately very naive and affected by fucked up societal and cultural influences regarding what is sexy and attractive in a male/female. As a result, we pick partners that are bad to/for us. Most of us grow out of it, but irregardless; self-pitying \"nice guys\" who whine about not getting laid because they are too nice have some fucked up, subconscious belief getting laid is a human right and women exist in this world to provide them that, and when it doesn't happen it's because something is wrong with women....I would advice this guy, or any guy who has the same problem, to educate themselves about gendered socialization and take a look in the mirror, work on themselves, on becoming the best version of themselves they can, be more humble and when they meet women; it should come from a place of wanting to get to know this interesting, cool, funny, hot, fascinating person - not get them to like you and sleep with you. Life gets so much better when you stop focusing on getting people to like you and give you stuff (as if the world owes you anything) and instead just focus on doing you, being yourself with pride, doing things that makes you happy, evolve, explore hobbies and talents etc. Then seek out people you like and give them your time and love without expecting immediate rewards.", "getoutthebox": "I have a nice guy. Real decent stand up guy! But he’s no pushover and that’s the difference.", "roscospears": "i’m engaged to the nicest guy i’ve ever met.", "alana_the_magnificent": "Love your response 🙌🏽💯", "kkatarina8890": "\"Any man who must say, 'I am the king' is no true king.\" - dude. I have never heard any genuinely nice guy say \"I am a nice guy\". Nice people act it, they don't say it.", "localcamguy": "\"Still see love through a high school cafeteria lens\" I just had this conversation with someone.", "jingles_not_jangles": "@media_rocket", "celiletv": "Shannon, these \"nice\" guys are a known phenomenon online. They're also known as \"incels\" (involuntary celibates). They're often very misogynistic and entitled guys who have poor interpersonal skills. They hate women for not falling to their feet. There are entire subreddits dedicated to mocking their misogynistic comments. (I wouldn't say that all of them are horrible people, some are lonely and just (sexually) frustrated. However whenever someone refers to themselves as \"too nice\" that should be a red flag. It's not much different than a person saying \"I'm not racist but... *proceeds to say something racist*. Nice people don't have to remind others they're nice, and they typically act that way because it comes natural to them not for sometype of reward. People who are genuinely nice would be more likely to think they're not nice enough and feel bad that others aren't nice to each other. Look at what this guy wrote. It's entitled, he's victimizing himself, it's self centred and he's objectifying women as a means to just sex. He's measuring your value purely by looks rather than take into consideration things that are attractive about your personality. I don't think most women like being treated like a piece of meat, and we can tell we can tell usually when someone sees us that way. Even fuckbuddies, people who's relationship is based purely on sex, will require mutual respect.", "ingahenryfarkas": "🙋🏾‍♀️so happy life lead me to my nice guy.", "bougiesteph": "Problem, you cannot just be nice. You should also be smart, witty, passionate, sexy, driven, confident, etc. Being nothing but nice is very boring. Ok, I want someone who treats me with respect, but that person should also be capable of giving people a “no”, indicating their boundaries, and delivering criticism when needed. AND of course there should be physical attraction and chemistry. There are other factors that play a role, which is what these Nice Guys tend to overlook.", "tazziii": "I’ve been with the so called “nice” guys honestly anyone calling them selfs a nice guy probably isn’t a nice guy. Most times they are just super assholes delirious to the fact they are assholes.", "magalifergie": "Oh yeah its a marathon! The nice win! The assholes end up in hospital beds begging for forgiveness from all the people they hurt. Anyway self proclaimed nige does not sound nice.", "svbrinv_k_": "Ameeeen @shanboody 👌🏽", "arslifestyle": "I realized the other day that the whole \"nice guy\" concept is pretty much BS. A lot of times that \"niceness\" is really just a lack of knowing who you are and what you want. When you know yourself, not just anyone can fit into life with you, and if they try to fit where they can't, it can seem like they're a jerk no matter how they approach it.", "ms_zeebee": "Can we also have a conversation about \"nice guy\" entitlement? Men who wear their \"niceness\" as an honour badge and therefore feel entitled to your yes as a woman.", "samcorreatorres": "I’ve dated a nice guy. He’s a good man but I wasn’t in love w him so I broke things off. I knew he wasn’t right for me and I wasn’t right for him . I know one day I will fall in love", "ashxhussain": "Truly nice guys don’t call themselves “the nice guy.” The ones that do usually have an entitlement complex and turn into assholes once they’re rejected", "crazy.fijian": "🙌🏽🙌🏽🙌🏽❤️❤️❤️", "lori_loliq": "#teamniceguy for 3 amazingly happy years. And I agree with @j_lynsation - never have I heard those words. Not from him, or \"nice guy\" friends. Ever.", "pacificmermaid421": "Some of the \"nicest\" guys I've met have also been some of the biggest monsters. Listen to your gut. ❤️", "jaypercytheartist": "I remember being 16, and A guy I was into told me he had just turned 18. When I found out he was actually 23, I remember telling my friends, along with a guy who was also in his class (who hated the guy)- who was also 23. Despite the fact that I explicitly said among the group of friends I wouldn't date someone that much older than me, this new 23 year old guy was so needy. He would bother me on instant messenger, follow me around college, send me songs about his feelings and even tricked me into a date by saying other friends would be there (But they never turned up), asking to come to my house to help me speed up my internet (I never said yes). He kept asking me how I felt about him... as a 16 year old against someone 7 years older in my friendship group it was very scary for me articulating explicitly that I just wanted to be left alone. When I told him I wasn't looking to date he got really angry that he was a \"nice guy\" and I didn't like him but I had the nerve to like the original guy in his class who wasn't a \"nice guy\". In fact I think he said something along the lines of \"nice guys finish last, huh?\". That experience taught me a lot about guys who count themselves as nice. No social skills whatsoever- how can you not tell when someone is not into you and is infact letting you down gently day after day? This whole thing went on for 3 weeks.", "joannalawrencia": "@iamphilys 🙋🏾‍♀️♥️🙏🏽", "ruthquick_": "My past two boyfriends where SO nice, not an asshole bone in their body! I'm really not into when guys delcair themselves 'nice guys' in this way though.. I think it just sounds bitter and resentful and blaming women 'liking asshole' for their bad times. 🤷‍♀️", "wellymavem": "Comments like this truly irk me! Self professed nice guys are NEVER GENUINELY Nice...... They expect certain priveledges just because they have performed 'the nice act guy'! They tend to gaslight people into remaining in a relationship far longer then they should just because they are 'Nice'. 😩", "moriemores": "This person’s comment appears incel-ish. Like they feel entitled to sex with women in exchange for simply showing up and being ‘nice’. Slightly creepy.", "jennifer_cortese": "Hot babe over here 🙋🏻‍♀️ in love with the ~nicest~ guy everrrr", "toomucheva": "Nice guys don’t say that they’re the “nice guy”. Simple as that.", "mialearned": "I think my husband is a balance between nice guy and asshole. He is never an asshole to me. I had always dated \"nice guys\" to my detriment (e.g. ex would help his ex with diapers, etc. and hang out with her platonically [SN: they broke up because the baby wasn't his and she messaged me once about wanting him back. He refused to cut her off.]).", "dr.emoception": "My boyfriend of 5 years is the nicest guy I've ever met. In my experience, the guys calling themselves 'nice' aren't usually so.", "a.l.l.y_m.i.m.i": "Funny how actually nice guys never declare themselves “nice guys”. They seeing being nice as a foundation of being a decent human and build on it with more interesting things, not a special and magical trait to stand alone.", "canela42": "I’ve dated some of the “nicest” guys who’ve treated me like a queen! One specifically I remember, I didn’t stay with because I felt he had no life of his own. He left all the decisions up to me and wanted to hurry up and move in together and I thought, “no way! I don’t wanna be “mom”!", "brandee.b": "I married the nice guy too🤷‍♀️", "1quietfire": "Research has proven...women are attracted to the mysterious...dark triad, asshole...badboy. It wasn't until my 30's that I realized that being a \"nice guy\" didn't work. But it was too late by then. I missed the boat. Never had love in any romantic form. Went to school to earn a grad degree...and nothing to show for it. I have since lost my drive for life. In the meantime...Lil Wayne clones (minus the money & fame) or (insert any rapper type...or a-hole or badboy)...", "actuallysure": "Being nice to women so they have sex with you is not nice. Women can smell that bullshit a mile away. Be nice to people in general because you’re a wonderful person, not because you want something in return.", "thecrimsonkiss": "🙋🏽‍♀️☺️", "charismasewell": "The nicest, most loving guy I’ve ever met is the guy I’ve been in a relationship with the longest and have every intention of marrying. Some people just aren’t as nice as they think they are.", "booksbrunchandblackwomenla": "My partner of 7 years is the nicest guy I have ever met in my life. 😍 give it up for the nice guys! 👏🏾💖", "followthatgirlwiththecurls": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "brayden.pdf": "Holy fuck I never thought of that am I being a people pleaser. But can I be both at the same time?", "almaroccas": "I would prefer dating an asshole over a self proclaimed \"nice guy\" any day. They are usually on a nearly incel level entitlement to sexual gratification from women.", "iamchrisnicole": "I always thought, it's not that girls don't like \"nice guys\", it's that girls don't like PASSIVE guys. Or men who are nice because they want something", "timchantarangsu\nVerified": "Verified", "_nellysunshine": "My ex was the \"nicest\" guy ever but he lacked communication skills and that part of the intimacy bubble. So 🤷🏾‍♀️ you can be nice all you want, but if you're not showing up in other ways, then you're still gonna be single", "danielleprescod": "Incel alert", "msjaimiking": "Same...❤️", "tashaamolly": "I also married the nicest guy I’ve ever met ♥️", "rachel_crider": "I have been with the sweetest man I have ever met for 7 years now and never once has he called himself “a nice guy” I believe the difference between “nice guy” and “nice guy who gets girls” is that the guy who is nice and gets the girls doesn’t feel that he deserves the girl just because he is a kind person.", "micahsmind": "Most “nice guys” aren’t actually nice 😕", "misty.maria.bonita": "I’m marrying a “nice guy” next month! 🥳 it’s a lot harder to find a nice guy than guys want to believe. They’re actually quite rare 🦄✨", "wxngari": "Self proclaimed nice guys 🚩 🚩🚩🚩🚩", "fayedaniels": "I'm so over the nice guy narrative. Sure, you're nice instead of having a bad boy image but that doesn't mean you don't fall short in other ways. Please be introspective, ask questions and be truthful with yourself. We all have downfalls, we all have things to heal from and reparenting to do. Work on being the best you not just a \"nice\" you. You'd be surprised how many women are creeped out or put off by behaviors that men think are \"nice\".", "mgoodm12": "My favorite quote has been, “Nice guys don’t finish last...wimps do.” I feel like that’s one of the main distinctions as well.", "moscovel": "AND, I don’t think someone just gets to assume they’re deserving but haven’t benefited because they’re seemingly a “nice guy.” That’s what you’re supposed to do. Be nice. “Nice guys finish last” is (to me) just as foolish as “boys will be boys.”", "la_haley": "The fact that you think you’re a “ nice” guy but you are salty you didn’t get to have sex with “hot girls” shoes who you really are and what YOU value in women", "malpaula": "🙄🙄🙄", "birdee__belle": "Hot babes? He sounds like an incel & there’s nothing more annoying than a self-proclaimed nice guy. Maybe she’s just not that into you.", "mutterknowsbest": "Hint: if you talk about women this way, you're not a \"nice guy\". You might be a \"good guy\" gaslighter, you might be a predator, you might just be a casual creep, but you're definitely not a nice guy...", "najah_singletary": "I know some self professed “nice guys” but because I know them it irritates me because they somehow have conveniently forgotten they weren’t always so “nice.” As a matter of fact some of them were liars and cheaters. Now they wanna cry about women passing up the “nice” guy. Honestly every man I ever met who lead with statements about being a nice or good guy turned out to be some of THE WORST people. Wolves in sheep’s clothing!", "mollyalmighty": "If you’re going to take advantage of women when they’re in a vulnerable place by “being nice” just in the hopes of having sex, you’re not the nice guy 😂. Lol at his lame ass intentions.", "damnjonqueen": "I know some of these words", "miamehtg": "@dave_lasoul_ ☺️", "charmazinnng": "A subtle read lol", "taylakurner": "That’s the thing about “nice guys.” They think that being nice is enough. Nice is great. It really is. But are you kind? Are you confident? Are you healthy? Physically and mentally? Are you emotionally intelligent? Do you have hobbies? Can you dance? Do you dress well? Oh, you’re just nice? Yeah, sorry. You’re gonna finish last. 🤷🏾‍♀️", "ms_frisco": "I've dated nice guys. They had some serious a-hole traits, once I spent more time with them. It made me rethink what nice actually is. What does nice really look like? Just because someone is \"nice\" doesn't mean they do well in relationships 🤷🏽‍♀️", "officialjerrytravels": "Just send them my way @shanboody and I’ll show them the difference between a “nice” guy and a GREAT guy 👍", "seaz_of_evil": "🦄🦄🦄 i love women.", "ladyraii35": "I have never been the kind of women that liked a bad boy I've always enjoyed being treated well and bad boys don't appeal to me.", "lashonn94": "@winnstagramp this is what I'm talking about! \"Nice guys\" being hurt because they feel overlooked when in reality girls may not be interested due to other reasons.", "theblaquemusehair": "His version of “success” is very surface level which lets me know he hasn’t really evolved to the point of actually being ready for a deep relationship. If that’s the lifestyle you want that’s perfectly fine but don’t call yourself a nice guy 😐", "fatemaalisha": "I dated a “nice” guy before. What he actually is was a person who hated confrontation, couldn’t talk about our issues, and didn’t want to stick up for me when his family brought up the idea that they couldn’t accept a person different from them but then turned that all around on me when it was the end. My current partner has never called himself a “nice guy” but is truly the best person I’ve ever met. He never doubts me but will call me out anytime I’ve been hypocritical or unfair, will always want to fix and make things right, sticks up for me, is ready to fight for our relationship and is an active participant etc. The total opposite from the “nice guy” as there is growth, health and prosperity in being a sometimes but for the right reasons asshole :)", "damonahoffman": "I met my husband while I was doing a dating plan called “Operation Date Nice Guys” - def worked out for him and he’s still the nicest guy I know ☺️", "labeautyologist": "My boyfriend is literally the nicest man. I’ve dated a lot of nice guys. Nice isn’t a personality trait. If you’re only nice and nothing else you’re boring AF. and if you’re only nice because you want social rewards from women you’re not nice either.", "rurab710": "\"Nice guys\" have an entitlement that being \"nice \"should've brought me to him on a platter 😩😂", "gatnb": "Sometimes these self proclaimed nice guys also just misinterpret things. They immediately assume that if a woman doesn’t like them back that they like assholes, when really, they just didn’t like them 🤷🏻‍♀️", "lipstickandtech": "Those kind of comments drive me INSANE. Unless someone calls you a “nice guy” I’m always weary because more often than not they’re “bad guys” with disguised bad behaviors. The man I’m dating now I went on a date, REJECTED, and then went on dates w him again and low and behold we’ve been dating for 5 years 🤞 goes to show that you can find love if you keep your ego in check!", "bvp.jordan": "If your only nice because you want something or your scared of hurting someone’s feelings, your never going to have fulfillment in life, if your kind because you genuinely care, your life will improve drastically", "eviie816": "@shanboody nice guys can break hearts too. But I’m glad I married a nice guy. He’s everything I needed. Nice guys DON’T finish last. That’s a lie!", "greenlava": "I was team nice girl until I got tired of being walked all over. I live in the Bronx, NYC where no one is nice. If they are nice they want something. It’s not a good mindset but it helps me from getting hurt like I use too.", "brookebarrows": "Best response ever", "rudegalnana": "I live for you 🙏🏽🙌🏽 you just always preaching", "_afitz23": "I think it’s time for your blue check. Not that that validated your credibility, but you are a very credible source and the information you bring is 🔥🔥", "booty_merchant": "Some people just gotta grow up", "danieljaredphotos": "For the nice guys in these comments. When a female says you’re too nice...move on. I’ve had females come back years later and say “ damn I was dumb, you’re a great guy”. Be you and someone will respect that, the goal isn’t to capture numbers but to find someone you can vibe with that lets you be you. Also if you like someone make sure you’re putting up boundaries between your female friends you may like and the ones you don’t. Everything has a time and place but nice guys tend to wear their Hearts on their sleeves and sometimes it’s a bit too forward. But you know what...someone will like it✌🏽#goodluck ps: dress nice, learn how to cook and keep up with yourself thats half the battle. Lol.", "kerriisms": "I think there’s a big difference between being a nice person and a good person. Sometimes, those lines get blurred and it could be really confusing in relationships. I think having great intuition and being aware of your feelings definitely plays a part in figuring out which kind of “nice” the person is.", "afrovocative": "I consider myself more of a kind sweetheart. Praying there’s a partner who matches my energy, love, affection and intentions to add to my life.", "coolasl": "Lol I’m for sure a people pleaser.", "september_bleu": "I definitely agree and to that end I feel there’s a difference in being nice vs kind. Niceness from my observation is more predicated on ego to appease others to hopefully get acceptance in some way. While kindness comes from a shared sense of empathy and self confidence that reflects the wholeness of fellow human beings without sacrificing yourself in the process.", "keishacharmaine": "Guys, respect the friend zone. If she doesn’t want you, she’ll hook you up with her friend if you don’t act thirsty.", "memejumpp": "Ugh I wished sadly my needy energy attracts assholes. But currently I am attracting nobody lol", "meganangelica": "Being nice doesn’t need to be rewarded with sex! And if you’re only being nice for sex, you’re manipulative af. 🤡", "xorejeane_": "👏🏽👏🏽WOO chil’ you said a mouth full 👏🏽 !!", "kietacolston_": "This is a really good topic. I think a lot this of this comes from the idea of being friends first. The only problem I see in this way of going about things is. The possibility of getting stuck in the friend zone. Granted this may not always be the case. Another thing I think makes women want to choose the asshole is his confidence. You can probably attest to the fact that women are more attracted to guys with confidence rather than guys who shy or meek. This is something I’m trying to get better at myself. Nice Guys don’t have to be the shy guy standing in the corner (not saying that they all are). They can also be the suave debonair gentleman with loads of confidence. But this is my take on it lol", "agent_1407": "I met my parents because of the advice you gave on one of your videos and she is the nicest person I have ever met. 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "sleepyvicki": "My fiancé is the nicest man I’ve ever met. Too nice. I scored big time", "tiffani_cupcake": "Guys who are constantly screaming about being nice guys usually aren’t lol", "chevydee8": "🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️ My fiance is the nicest guy ive even been with and ive never been happier", "poofimback": "This guy should read your book, he will most definitely learn from it!!!", "thatchefjojo": "nice guys finish last", "artmamimoni": "This guy sucks just like the majority of them. He deadass just framed this as “what’s the point of being a ~nice guy~ if we’re not entitled to your body!”. Like duh dude, because if you were REALLY a nice person, you wouldn’t act in kindness with the secret intent of fucking or access to anything else. If THATS the goal, Id rather know someone is going for that directly than go through being lied to about the intent behind those “nice” gestures.", "the_annelis": "Anytime a man *declares* himself a nice guy, I run in the opposite direction. Those usually think they deserve whatever they want from you just because they treated you like a normal person.", "annajorenee": "Most self proclaimed “nice guys” are actually toxic af as they do nothing to court a woman but “be polite” and expect her to read your mind then when you do date them (or even when you do)everything is about how we like the wrong men the bad boys win cause a lot of them make it known that we are wanted and sometimes they even chase us", "amberscloset\nVerified": "Verified", "kiaraserasera27": "Ahem I want a nice guy 👏😘", "hallebylsma": "I’m currently dating probably the nicest guy out there and it’s such a breath of fresh air. nice guys, i’ve discovered, have the incredible ability to make you feel known and wanted that the stereotypical douchebag fuckboy just doesn’t have. they have the ability to make you feel so chosen without it simply being out of kindness.", "ona_a": "Incel", "silversprings81": "I find that most of the people who say this aren’t actually nice because they’re nice people, they’re nice because they want something for it. There’s a huge difference between being a genuinely kind/nice/good person and being nice in order to get something from someone. People feel that energy, friend.", "phumiembambo": "Lol \"nice\" is code for entitled and usually turn out worse after you interact with them because they're actually mean spirited", "gingerfoot": "Hmmm very interesting observation!", "iamanjaeve": "🖐 I’m with the nicest guy I’ve ever met (NOT a people pleaser) and I’m very happy ❤️ Instead of choosing to believe that women don’t like nice men you can also ask “what is it about ME that keeps being attracted to women who aren’t the right fit? what can I learn here or see differently?” When we do our inner work first we will be much more likely to attract the right person (man or woman!)", "kittym0ld": "Gave a ‘nice’ guy a chance and I got cheated on. You can’t give them any kind of self esteem because then they don’t know what do with it since there not use to it. 🤷🏻‍♀️", "lov3.muffin": "How do I access the stuff to go with the book if I downloaded it with audible?", "cee_lita": "Neverrrrrrrrrrrr😩😩😩😩😩😩😩", "rebelbeautyjasmine": "Who Shannon if that’s not a word 😩👌🏾", "justdomakim": "Most of the guys who bemoan being the \"nice guy\" are guys who lack either the self confidence, or the directness to ask a girl out and make their intentions known. Instead they rely on the fact that they're polite as some sort of pass that grants you access to a woman for whatever their purposes are be it a relationship or just sex.", "babyface323": "this right here thooo 🔥", "klikmj": "I’m always leery of guys who say they’re a ‘nice guy’. In my experience they’re usually the exact opposite", "theruvian": "Well that's because nice isn't enough of an alluring quality. It's a standard everyone should have. But the narrative of the nice person vs the bad person is, nice people fail to the positive qualities that bad people have and fail to see that they have their own attractive qualities other than nice. I use to be the over looked nice girl. I'm still nice, but I'm also more", "destii_tmc": "I’m “ too nice “ I feel this is a server issue for me .... on the bright side I just got your book right now after listening to the audio version ...round two ☺️", "machoavgperson": "@shanboody I would have NEVER answered from that certain perspective. The fact that you did, I am so fortunate for because it’s such a valid, yet overlooked statement. Thank you for being you Shan.", "unapologeticbabee": "First of all, the whole comment hinted that this guy is actually not... a nice guy."}