{"aleahtrends": "My apparel brand @tyictoronto", "straponme_official": "Sexy and classy!", "oxnard331": "my jewelry business ✨ https://depop.com/oxnard331", "kndrck397": "Listen to the radical sister on YouTube and get your thinking right", "ronejae\nVerified": "Verified", "creativebyhand": "Love you msg this definitely speaks to my life. Love the pic by the way🙌🏽❤️. I am currently promoting myself at as nail tech in philly and a children’s learning YouTube channel @jonrsykidtv. I’m a stay at home mom trying to use my talents and skills to help keep my family afloat. But I always struggle with putting myself out there. So thanks so much for this msg. For me it was more motivation to keep putting myself out there. 🙌🏽❤️", "nailed_by_rachel": "Www.nailedbyrachel.etsy.com", "madamesienna": "@shanboody check your dms. We’re putting on a benefit concert for sexual awareness at USC!", "cmays___": "👌🏾", "rolani2.0": "Creative Director of @gloryweddings", "therealqued_17800": "I'm crowdfunding for my latest project to be put on 12\" Record here is the LINK thank you for the encouragement https://qrates.com/artists/14635", "mercyankama": "I make music!", "californialovesfrenchies": "Im promoting my very own Brand of CBD oils lotions creams and Adaptogenic shit all for all who will need I am a Master Herbalist@wanting to change the world 1 healthy body at a time via Health wellness cbd and organic foods for you and your pet since we must co exist together😉 Love your real honest straight to the point no bullshit work just amazing 🔥🔥🔥", "millionaires_estate": "We Are @millionaires_estate a Husband & Wife Urban-Pop Duo from Atlanta! Our current Single “GET IT GYAL” is streaming like Crazy in Spotify (it is on all platforms) and we’d love for everyone here to go take a listen!!💛💛💛💛", "mayra.hrtmnn": "This has been a theme this year - being my own biggest hype man whilst not being entitled. I just started DJing and am currently promoting my mixes. Link in bio ;)", "aryeharmony": "My YouTube channel: (Arye Harmony) be lit! My vlogs are 🔥🔥!! I love my growth on there and hope to keep growing!", "jennydek7": "As you know I’m a Police Officer - but I have Naturally based hair care ! I’m doing this as a side biz that has flourished.. since my hair at the age of 42 grew back longer and thicker - even after battling thyroid issues.. I want to help others. I also now Also no longer need renters and I can support my children’s group on my own girlz_will_be_girlz1 Which I’m a mentor to girls in high risk high crime areas. The whole thing is a win win in my life. If I can help anyone here with hair loss, growth, dry hair, oily, not growing... plus using naturally based products.. I’d be happy to help. Thanks Shan for offering this info out to share 💕", "sixdayz_riq": "💍🥰🤷🏾‍♂️", "plutoboi747": "im not gone lie when i first seen boodram i was watching steve harvey show and the way she was dessed she had this slit in her dress and i was vexed after that . I rote her name down for when id get the internet back to look her up and i did to see more angles of her and stuff then i moved on but she is a sexy sista.", "emiliyayilime": "My family’s boutique winery @apriswines ! Our mission to give back to our war torn homeland and provide wine education to whoever we can 😊🍷", "vegan.nudess": "❤️❤️", "helloitszury": "@michellebbatista", "unique_sibanda": "Wow first I love you and I had forgotten why I followed you in the beginning... and now am only seeing this post .... I am currently promoting my work on #socialemotionallearning through @beingunique_purpose ... I want to have conversations about being unique and learning to love your damn self like all of you and understanding that’s how you discover your purpose . Also trying to write two book while in #quarantine 😁", "riverselive": "Yes! Sooooo awkward sometimes. Your #GameOfDesire promotion has low-key inspired us over the last few months. You are doing the damn thing! We are always promoting ourselves - Toronto Pop/R&B group here to REPRESENT THE UNDERREPRESENTED. And right now we're pushing our latest track, Clapback SZN - think 90s Dance/R&B track delivered in 2019 (also released same day as @enjoyjaredbrady put out 'Enjoy Ya Life,' which we thought was a good sign... two bangers that are!! 😜)", "tatinana2008": "Shaaan! How do you keep your boots gartered??", "positivesexualitycsun": "Promoting open honest conversation about all things sex! 🔥🔥🔥", "w1s1a": "•سلامُ على بلداً بات الخراب ينهش في •اجزائه ؛ ولايزال يُرممها من دمـاء أبناءه 💔..!•اللهم الأمان لبلداً لم يرى الأمان يوماً💗،!برداً وسـلاماً 🇮🇶💔.. #Hello_world #There_are_people_Making #Revolution_now_in_iraq ! #Show_your_support_for_the #right_of_Iraq_people_to #protest_peacefully #Save_the_Iraqi_people #HELP_Iraq #saveIraqipeople", "ginger_ele": "@shanboody when is your collab with @godisgrey coming out? Has it already & I've missed it? I NEED that content y'all.", "joefrancisco8287": "@shanboody Thank you for this post with that being said I’m promoting myself and my writing specifically my most recent self published book of poetry the first of a series. @joefrancisco8287 and check you DM whenever you can I know it’s probably crazy. Thanks again just the push I needed", "dialaskitchen": "💕🙌🏽", "goddessflexx": "Saw her speak and I fell inlove 😂😩❤️❤️🔥", "charlottebuflerwunderwaffe": "🙌🏻 I’m promoting my agency theWunderwaffe.com with a lot of heart projects as the FEMALE DRIVE interview format: interviews with leading female creative rockets on the backseat of a car - „What drives you?“❤️", "louisepwo": "I started a podcast this summer called @therecesslife which is all about lifelong play and creativity. I definitely struggle with promoting it- thank you for this!", "jvehdvh.bee": "I promote my artwork. I’m an artist from seattle. I love to paint 😇 I also promote music for my boyfriend and friends 💁🏽‍♀️", "_whattheslut_": "I write about female sexuality in public spaces and advocate to #decriminalizesexwork☂️ Check our my blog and podcast! I also dabble in writing erotic horror for all you fantasy buffs out there🖤", "coachchanelchaqui": "My Book “Sacred Eternal Life-Giving Force” and Life Coaching!🙌🏼", "adikt_junkie": "@adikt_junkie ❤️❤️❤️", "themadswami": "If anyone wants to give my podcast a listen or two https://open.spotify.com/show/0La5my4ln9BSnQ9kuHu6qJ?si=E3rfp56CSfS7Wr1Et9ZN-A", "pastorjtownsend": "Women’s healing emotionally, breaking chains and years of people-pleasing!!!! Life coaching and motivational speaking that inspires and ignites her to begin again and follow-through with becoming her true self. 💪🏾 Working on my logo now.", "samhunerlachstudio": "@tinyhappycreature 💕💕💕💕💕", "drdonnicamoore": "I’m promoting the #BurgundyChallenge & #LivingBurgundy for @globalliverinstitute —& this photo is perfect!!! Those burgundy boots are KICKING IT! #LiverAwareness #OctoberIs4Livers", "thislifeiliveintruth": "Currently promoting my podcast This Life I live in Truth new episode drops tomorrow night Oct 2nd at 7:30pm EST. Available on Spotify, Google play, iTunes, Stitcher. Please listen and leave a rating and review. Much thanks. Love you @shanboody", "sajurnafran": "Just going to shamelessly plug my new makeup page here! For anyone who’s looking for an MUA in your local Toronto area 💁🏾‍♀️ go checkout @slaybysaj 🤗", "euphoricvibesalign": "A GLOBAL Business Opportunity with Health & Wellness #LinkInBio", "andrene.france": "@welltravelledjamaica your guide to all things and places healthy, well & wise in JAMAICA 🇯🇲 🙌🏽. Thanks @shanboody 💛😘", "savannarose.ig": "Thank you for this! My most recent post’s caption is inspired by this message. And I’m promoting my DEBUT album ✨♥️", "miranda.amora": "WOMENS EMPOWERMENT & SELF LOVE NUDE YOGA CIRCLES ❤️ stay tuned for the next one in LA.😘", "meldixonn": "I’m currently promoting my online website @thegirlstopzine its geared towards female empowerment based in Toronto !! 💕", "thedreaddm": "I'm promoting myself! I'm a freelance copy editor and proofreader. And I'm great at what I do!", "engridmari": "@dulcecomomiel5", "terri2kool": "My radio show 🎙 I am live on @hott1075bermuda each and every weekday from 5 - 7 PM! That’s Atlantic time. The listen live link is in my bio! Give thanks to everyone who comes over to listen to me. I appreciate your lending me your ears for 2 hours each weekday 🙏🏽💙", "real.little.chicken": "I am doing what I can to help push Native Americans to reclaim our narrative. Since the birth of this country we have had others formulate ideas and imagery of who we are. I am sharing my story via YouTube and Instagram for those who want a glimpse into the life of a modern Indigenous woman. This includes tackling my issues with my own identity, self discovery, my mental health, identifying the aftermath of historical trauma that still effects my family to this day, and more. And also just showing people how we are not these sacred museums objects...we are real people who feel joy, possibly the funniest people you could meet, we are overcoming and becoming. And also documenting my life for my daughter and her children. I watch your videos every day to help push me to continue to create and talk even with my small but meaningful audience. You are a huge inspiration to me. So thank you!", "beejae_": "I am promoting my pastry themed makeup line @pastrycosmetics", "karagaisiecoaching": "Thanks for asking @shanboody! I'm promoting an opportunity to say BYE to the day-after-day burden of unfulfillment in the office", "whimsicalmelon": "Just recently started promoting notebooks that I've doodled on!", "chantylew": "@melaninmartha it’s a Afro Caribbean lifestyle brand. I’m trying to keep our culture alive ina dope way that makes us proud", "montaiwilson": "Eww why do u look like that", "mmontiel20": "Girl me and my wife think your gorgeous!", "lovelizzyk": "🌈🌹🍓My new YouTube channel: Lizz K❣️", "thetangokit": "Thank you for this reminder to self-promote, @shanboody! I'm promoting the first sex ed box for adults, The KinkKit! We distill the science of mindblowing sex into approachable guided games and experiences for couples to help them talk about their intimate needs. @thekinkkit", "kendan911": "Are you suffering from any form of STDs or non std such as Herpes Genital Virus, HIV/AIDS, Heart disease and you have tried all means and the infection is still there?. Check my bio.", "x_helenita_x": "So true!!! 👏🏿My YouTube channel.", "carolsteinfeld": "where do ladies get these great wide collar leather jackets?", "misynsecrets": "I needed this. I remember being one of those people that use to judge when people over promote now that’s it’s me doing it I think I’m even harder on myself. Well fuck it! I’m currently promoting my online boutique @selfishlbl and if any other like minded business peers want to peer up for support, let a sis know 🤗", "thewallacewilliam": "yes! ✊🏼 I’m an artist and currently promoting my debut project that comes out at Midnight. reading this made me feel better about talking my shit lol", "laura_g_l_15": "Wild because I was just talking to a friend about this today and how I feel so out of place and cheesy when I promote, but it’s necessary. So thank you for the pep talk 💖💖💖 I promote me! I’m a teacher of all things humanities, a writer, and a tarot reader and I want to work with everyone who needs me. DM me!", "eastalahna": "Working on a short film that will bring attention to the immigrant experience in the US. Have to do a crowdfunding campaign to try and make back some of the production cost. It sucks cause like I hate asking people for money 😩 but the story is important and I keep trying to remind myself of that fact.", "alex.clementine": "I'm currently working on my podcast @collectivelypodcast and my YouTube Channel.. Trying to shake away the nerves and share my passions shamelessly. This post pushed me closer. Thank you Shan!", "theinfinitetransition": "What am I promoting? Wellness, emotional freedom, and healing from traumas and limiting belief systems. Thank you for saying this. We all need that reminder.", "kuh_tee_yah": "Promoting @bykatea... Currently offering hand crafted, hand poured scented soy candles.", "_t.boyce": "I’m promoting my first book of poetry I wrote 😌", "lovelyvirginia": "Check out @unratedunruly! A podcast I host with one of my best friends! We discuss relationships, sex, love, friendship, and so much more all while drawing on our own experiences (no matter how embarrassing). New episodes every Tuesday!", "organicallycheeba": "I'm a dog trainer and I help people have better relationships with their dogs and a better life with them in general. There's so many dogs in shelters because there is such a huge lack of education in dog training. It's my passion and it makes me feel so fulfilled. If you own dogs and want to learn more about how to have a better dog feel free to follow @pack321dogtraining and feel free to ask any questions.", "teamtysha": "This share on THIS Monday!! Epic", "giddy": "Currently promoting a prescription-free treatment option for ED 🙌 on a side note, those boots are 🔥🔥🔥", "hitoroki": "I'm promoting my artwork. I do comic book store character design and illustrations. You can see some of my work here on Instagram and/or on my website (Link's in my bio).", "opal_inthesun": "I am currently promoting my art. I'm a digital artist trying to get my name out there 😅.", "kadinelindsayart": "@toxicfemnintyofficial BUY MY MF MERCH", "melaboricua": "I’m promoting myself ! I’m a PhD student who just took out what feels like a million dollar loan to complete school, I’m a social worker, I’m doing research on mental health for Afro Latinos. I’m also a behavioral health ambassador for HBCUs. I just want some support ! Lol. So im promoting myself. But I’m promoting myself to promote my belief in real mental health awareness. Real behavioral health research done by a person of color to help other ppl that look like me. To reduce stigma around mental illness and mental health issues. That’s it. Side note. This does feel weird and embarrassing lol.", "becomingthekades": "My fiancé and I started a YouTube channel, your relationship openness inspired us to give the black gay aspect. Check us out on YouTube and IG: @becomingthekades", "adriana_anguianoo": "Okay so I’m going to promote myself to you again, I am a traveling (coming to LA oct 12-15) Curl Specialist and I just started my own business at 21 with my private studio and I would kill for the chance to do you & jareds hair and teach you about your curls 💕 my hair page is @_curlytopcreations I’ve been subscribed to you on YouTube since I was 16 and curious about sex and you’ve taught me so much and I just want the chance to do the same 🥺🥺💕", "eliza_peters49": "@shanboody I’m using your platform to promote my candle business. I’m from NYC and I make soy scented candles. Visit my website @ www.shanellsspecialtycandles.com", "goldie_lockes": "I too am a published author of @the_barometer :The Bartender's Guide To Measuring Up In Your Relationships", "annick_lt": "YESSS - promoting my freelance content marketing services!", "cyn.is.cyn": "Come check out my rehabbed furniture and glow in the dark art and spoken word! I’m no influencer! I’m just an artist trying to showcase my creations and along the way I like to showcase other artists that inspire me!!!", "mrs_cutthecheck": "Myself!! Empowering realtor for women who dream to get ahead 🔑", "tortoiswind": "Love this pep talk, thank you #iamyou", "bonitastreet": "YUP big facts 📠 💯!!!", "officialnekaleslie": "I am Promoting my Music and how to balance being in the Medical Field while raising a child etc...❤️", "therealelijas\nVerified": "Verified", "valientefleur": "Ok but can we promote these boots cuz 😍😍😍😍", "sarahmhistand": "Truth! Promotion feels hard but I’m doing the hard things bigtime these days because my stuff is 🔥🔥. I help people have a happy & healthy winter season with my Ski Babes winter training program that starts next week!", "donicalove": "😍😍😍", "marketing_kings": "We have a dope ass podcast @unfilt3r3d_podcast check us out and we live @stayreddy poof", "renita.mitchiner": "Promoting my page, where talk about healing, and self love and being unapologetically yourself!!!!!!!", "brealove247": "I am currently promoting my YouTube channel! (Link in the bio) I sign songs, and a new video is going up this Friday and I’m super excited!!", "germanyflowers": "Thank you for this! Currently promoting my instagram where I post videos that help heal others & my inspirational wristband business @bigbandz.gf 💕", "myss_starr": "Yes! I’m promoting my new podcast “She Is Magic” available on Apple Podcasts, Spotify and more. It’s about celebrating our badassery, drawing out our greatness and embracing our femininity. Check it out! Also—-I need the deets on those BOOTS‼️😍😍😍", "azi.anezka": "@veronnnie 👈🏼 her amazing project @baddfyah.tripjm 🇯🇲 (which includes dancehall culture trips and carnival trips to JA)..already promoting trip number 4 and im so prooooud of her ✨💪🏼", "carlaamee": "I want to say for those of us that love your content of course we want to know how we can get more of it don’t be shy girl! And feel free to promote you hubby too", "iam_na0m1": "🔥🔥🔥", "mstoyabedeau": "I’m currently working on putting together a theatre production involving actors and dancers featuring some of Toronto’s best dancers and choreographers. It’s called NIGHTMARE and our show comes just in time for Halloween on Friday October 25th at the MiST Theatre. Tickets can be found on Eventbrite and more info @inthagroove_ 🙌🏾🔥", "grafziggy999": "Those boots and your legs tho", "jeanevarose": "I’m promoting my newest dance visual on YouTube for @dojacat song - Juicy✨ link to the full video is in my bio.", "ntoetselerotholi": "I write nerdy deep dives into my psyche and the things that I love (read: am nerdy about) on my non-blog 😂❤️", "javaydabae": "I have an inclusive, comprehensive sex education YouTube channel! Go watch it! Search Javay da BAE on YouTube!!!!!!", "ginaspot": "Wow. I really needed to hear this. I'm a TERRIBLE self marketer. I'm promoting my amazing @naturalsbyginab body products. #KissMyAsh is everything. 😘❤️🙌", "ashbass27": "@lindsaykatethings I know sometimes you post about not knowing if people care about what you post, so this made me think of you. I know you have it in you to succeed!!", "tanja321": "Oh girl I feel you on this one. I’m trying hard to get my business going in a completely male dominated world - coaching. So yeah, I’m promoting myself. And it’s hard because male coaches can be topless and show off their body and still be perceived professional. And people get it. But when a woman trains in a sports bra and shorts, she’s automatically sexualised, objectified and no one takes her seriously, because you can’t actually be good looking AND smart at the same time, right?!😅 anyways, this is my dream so I’m putting everything into it. And I know you faced your own challenges in your business path and it really really motivates me, even though we are in different professions, to watch your videos and see that even you have been struggling at some point. Not that I’m happy that you struggled, but it’s nice to see that you got so far even though you started very underprivileged. It gives me strength to work in my ‘regular’ job and at the same time grow my side hustle until someday my baby is big enough that I can live off just doing what I love - coaching people. Thank you for normalising self- promotion. Like you say- I’m promoting it, because I believe in it and I know I made something worth your time!!💪🏻🔥♥️", "yoli_xxox": "I needed this! I’m currently promoting my YouTube channel on makeup, hair, fashion & lifestyle 💕", "lovelylita": "Love this ❤️ I make decorated cookies 🤗 I’m currently offering in-person weekly cookie classes for teens (the Bay Area) but looking into doing online classes 🌎 . Check out @blessedsweettreats & click the link in the bio to subscribe to the newsletter for class updates", "maxartworks01": "We make revisions to satisfaction, 🇺🇸🇺🇸 📩 Message me if you need any kind of 💫💫 graphic designs like 🌟 HD Cartoons portrait ,  Logos,🎌 flyers,  Mix tape cover, 🎨 Animated Cartoon📹 videos. All In HD Quality 💻", "martinamagorin": "💪", "mayasworld\nVerified": "Verified", "gawjuss_enigma": "I’m promoting my baking business @_deesdelights, ALL the flavor with NONE of the animal products 😉 (100% vegan)! Check out our FAQ highlights for any questions you may have! 💚🍩🍿🍰", "oldworldnew": "Easy #SustainableLivingTips! From a black woman, for everyday folks. I mostly share here on @oldworldnew. I also have a Patreon where my community can gift me donations for the free valuable information they receive from my website, YouTube, and social pages 💚💁🏾‍♀️♻️🌍", "mariamarkovaa": "👏🏼👏🏼👏🏼", "iam_imari": "Started a YouTube talk show about talented creatives and professionals around Detroit, MI! 🤗🤗🤗", "atiya_bloom": "So much truth here ✨ I am promoting my positive affirmation cards and handcrafted intention candles at @eleven11affirmations 💛", "samanthagberry": "😍😍😍", "soula.rb": "My illustrations ✨🤗 @soula.rb", "thelipbar\nVerified": "Verified", "_myammee_": "😍😍", "hashtaglifestylist": "I’m currently promoting my styling business and blogging , it’s hard for me because I started later in life but it feels so good to live in my truth🙌🏽", "tribecalledkris": "I absolutely love those boots on you. Where did you get them??", "__sanaleia": "I'm working on publishing my second poetry book. And creating a new platform for my writing", "tkammamboleo": "Queen!", "nutritherapywithflo": "I do health analysis FOR FREE until I graduate in holistic health in november!", "carversk": "I SO needed to hear this! I am@so nervous putting myself out there as I hopefully grow my own business!💪🏼💪🏼👏🏻", "ericajones10": "I am promoting myself as a photographer. I am the most passionate at concert photography. So far all of the passes I’ve shot are 100% independent, but because I haven’t worked with publications I get rejected A LOT. I have my own website, business cards, contacts, everything. If there is anyone starting out in music, or already established, please DM me. I would love to capture your moments!", "jessicataylorregan": "Currently promoting my women’s support group in Toronto, the Small But Mighty Women’s group! We discuss mental health, love, relationships and rewriting our own narrative", "larasavenije": "Just yesterday my friend told me \"OK we get it\" after just three posts bout the launch of my documentary. Thanks for this ❤️", "wildcaprisun": "Currently promoting my special hour of music on ynotradio.net Philly’s real alternative ! Wednesday at 11 am & 10 pm and Saturday at 5 (ET) it’s an hour of local music and it’s always so much fun 🙏", "tiaraxo__": "my BROW business ! @529artistry !", "they.call.me.mimii": "I can’t wait to read your new book Shannon", "erockfor": "thanks for the reminder! i’m promoting my first single. it’s coming out october 9th. i make jazzy soul/hip hop music!", "sharaslays": "I resell women’s vintage on Depop currently. My website badjoycustoms.com is under construction to offer vintage and styling options🚀 coming soooon", "laquistaerinna": "I’m always promoting mental health for professional women of color and also women veterans/military. I have some amazing projects in the works and have two anthologies out now.", "thenameismarinadale": "Good Gawd, Lady!", "stayreddy": "this is a great reference post with a wealth of information and diverse offerings! i’m always promoting my photography business @stayreddy.photography! i cover corporate & tech events in the bay area and i do travel lifestyle photography as well. you can join me on a @dipaways trip or hire me separately! 📸✈️☀️", "otuawan_": "Promoting myself as a musician", "danicacorin": "My sister was just talking to me about this. She told me that I shouldn’t be ashamed to push my art to sell it. I’m an artist. I paint and yes they are for sell.", "mizzseychellois": "I'm promoting my art and Redbubble shop! I draw mainly black and brown women, every now and again i draw one of my followers for free. Would love for anyone to see this and check out my page! Don't mind the cats haha, it's mainly art! My shop link is in my bio!", "17apresents_tmarie": "I'm in the process of writing my first book and full feature screenplay.", "sinead_khan": "My podcast @findingyourfabuleuse is about finding the \"fabuleuse\" in the every day...if it sounds like your jam come say hi!💕", "_imanidelvalle": "My blog posts and YouTube videos !! Link in my biooooo ❤️", "iatiii": "My food page. Focusing on african food with a modern take. Right now basic recipes but it will improve and refine with time. GO FOLLOW @eataifood @eataifood @eataifood", "dani_changg": "I am promoting my youtube channel \"Dani Changg\" I started this year on Relationships. I want my viewers to improve all of their relationships with others and themselves. I produce solo, group, and comedic videos ❤️ SUBSCRIBE ❤️ cuz the content is 🔥", "alisaamaro": "my photography and modeling! book with me now for collabs/rates or check out my link in bio✨", "willow.rising": "Currently promoting my 1:1 human design readings—truly is a gateway to transforming your life and giving yourself the permission you’ve always wanted to be exactly who you are.", "gaynete": "My Freedom Slay Inner Circle monthly membership to assist women who are ready to ditch their 9-5", "windblownpixie": "I’m a henna artist, and a vocal instructor! Girl you are so right. It’s hard pushing yourself out there and finding clients. THANK YOU.", "magdakayofficial": "Hahha i LOVE promoting myself and my services 😊💖", "jaypercytheartist": "I've had a big issue with promoting my art business and am finding it difficult knowing where to start! I want the sales from this to pay for an art psychotherapy masters, but can't do it without the sales first!", "sehowiam0": "@trep_talk", "illlenses": "I’m a photographer! And for each month I’m donating half of my profits to different illness organizations. Hence my name iLLLenses. Promote on!", "applepiebombs": "Beautiful picture.. your such inspiration as a fellow brown skined, curly hair girl and fellow Artist/ creator.. love what you do!! Blessings girl ***", "lukheyluk": "👍🏼😎", "iamaalliyah": "@liyah_designs <<< my dress making/learning, my latest projects uploaded here", "catchingclaudia": "I’m also promoting @thesolidsixx a travel/lifestyle Instagram made by 6 college besties.", "lucia_ruby": "Yes yes, thank you for this pep talk! Im promoting my ethical recycled silver jewellery range @pieceofnova ✨", "theoliviab1": "This is true yet exhausting. In a perfect world, u want it to sell itself completely but it’s unrealistic 😩. In the meantime, check out my earring business @thrilllobe 💗", "cindyscharkey": "@shanboody 🙌🏽 Thank you for this today!! 🧡", "tiaraleatrice": "I barely promote myself because of the cringy feeling but I have a YouTube channel telling Koreans about foreigners and I wrote two novels and I dance alongside my money bringing job. I do a lot but I hardly share that.", "sarahkhan.bw": "Looooove what you're wearing here girl! 🔥🔥🔥", "daggy.longlegs": "@loucorryphotography read the caption!! ❣️", "beautifulsailingsoul": "Yesss! I'm promoting my reading blog @openbook.openmind ! My goal is to inspire & encourage people of all ages to read & plant the seed to travel through books ❤️📚", "helenaxhaile": "I needed to read this! Thank you! 💕 Currently promoting natural hair care & self love ✨✨✨", "mynameishisani": "So I’ve just started a merch company for anxious people and parents it’s early days but it’d be great if people could give me a follow @barelyfunctioningshop ❤️❤️❤️❤️❤️", "karma_asada": "Those boots... 🔥🔥🔥😍", "christacamarillo": "I love this & your book 📚", "sofiargatti": "I’m pushing the awareness for how damaging the fashion industry is to our planet! People don’t know it’s the 2nd largest polluting industry in the world and we need to stop our excessive consumerism! I’m going to keep pushing so I can make a difference ..... 💚💚", "lilyzaremba": "Promoting a platform to teach people how to invest and help them grow their income in the financial markets like forex on their phone!", "djandsoul": "promoting both my DJ radio show and my hospice...two different ends of the spectrum, but I have a passion for both", "heyyximena": "Currently promoting myself as a plus size model/ influencer. I was growing at a steady pace but then I got shadow banned bcuz the algorithm is fucked up. So if you wanna see some real ass big bitch body positivity check me out pls ❤️", "callme_oasis": "My modeling in Texas and I’ll be promoting financial wellness soon! I definitely needed to hear this!", "_emily.june_": "Yes! Worked to get there this year! Offering Pay-what-you-can for introspective personal consulting through the end of the year🔥🔥🔥", "shaka.lee": "God you are so right about this. I feel 🤮 when I have to mention something on my stories more than once. Right now I’m promoting my heels dance classes in Toronto and a Freestyle dance workshop on October 24. ☺️", "day_zhuh": "Your boot/garter combo is fucking fire", "brandonmbolton": "❤️", "treasures.place": "The Travelin' Doula Project/ link in my bio SoulFamily💚💚💚", "kareem__w": "IM PROMOTING PHONE CASES GO SHOP @dreambreem for all the latest phone cases gadgets and ACCESSORIES‼️‼️‼️‼️‼️‼️❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️❗️💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾💪🏾🤟🏾🤟🏾🤟🏾🤟🏾🤟🏾🤟🏾🤟🏾🤟🏾", "earthtonedd": "Learning to model for my own site, & and pieces that I’m selling @rebelher.shop", "e.wacuh": "🔥🔥🔥🔥🔥", "joyce_nuhill": "My music☺️", "focusedj": "I’m promoting my career development agency @rockcareer! We help our clients with services ranging from resume writing to salary negotiation.", "sadie_lune": "Yeah I resisted this truth for 15 years and only in the past 2-3 start to accept/work it. I’m promoting my talent as a public speaker, facilitator, Coach and project consultant on topics of sexuality, BDSM, sex workers rights, feminism, pornography, sex positivity, and queer parenting. I’m promoting the films that I make and perform in. And I’m promoting #AsYouWishMyLady, a beautiful #photobook of queer bdsm photography by @jopollux featuring pictures of and text written by me.", "michaela.starr.sakell": "Myself! Check out my page!!😊🙏💕", "poetimmaculate": "Ugh love the caption! You have to be your own biggest fan!!", "ginasiva": "Trueee that being said, I do stand up. Follow me😏.", "omg_itsbethany": "I’m just tryna be a lawyer. Anybody else in the comments waiting on bar results??", "derriuslogan": "been talking about this fact for weeks as i develop this new muscle, & also figure out how to better articulate what i’m working on.", "potentialfilms3": "Well first off I would like to thank you @shanboody for being the narrator for our documentary Called This is for Toronto which gained Distribution on AMC networks in 2016. I’m excited we will be officially releasing it in Canada🇨🇦 on Oct 1st 2019. Available on our website www.Potentialfilmsinc.com 🎬 #Thisisfortoronto thank you love and respect always 🙌🏽", "daviaakenami": "I’m currently promoting my music ❣️ I’m a singer-songwriter and I’m going to release a new song and a music video 10.10 💞 Would make my little heart so happy if you checked me and my music out 🦋🎶", "nkalagram": "😍😍😍", "deonwarrenmark": "Love the boots", "irene.namuli": "Thank you for this reminder! I’m promoting peace and empowerment through movement.", "lizz.tovar": "LOVE and compassion", "vanessa_vanita": "Agreed 🙌🏽💯🙌🏽💯🙌🏽💥 Promoting my #mentalhealth #fromdepressedtosucess Podcast @vanessas_voices! Come on my podcast and tell your story whoever is reading this and feels like this speaks to them ♥️", "epihealthycure": "❤️❤️❤️ I’m promoting Good Food. Real Fast. I share gluten-free seasonings, time saving cookware, healthy cooking classes, all geared around getting dinner on the table in 20 minutes or less! I’m also promoting an east end #torontoevent this October 26 where we’ll be sharing all about the business opportunity with our company & a meet/greet with the CEO! Message me for details on the food or the event! Thanks @shanboody for being you, doing you and pushing us to be proud to do the same! Traceyvandervalk.epicure.com", "andreaheard_": "This is a good message", "sagechrisy": "I recently launched my first Airbnb rental & am working on adding more properties. If you or anyone you know is heading to Albuquerque, New Mexico & needs a great space to stay come check it out. https://abnb.me/l7H8kwMce0", "anaismoniq": "Planted-based, chemical-free DEODORANT @plantjuicebox 🌱🍋📦 Plant-based hair gel and conditioner coming soon! 🤗✨❤️THANKS SHAN!", "requin.b": "🤩", "theastrolotus": "👏🏽👏🏽👏🏽 Yes all of this!!! Currently promoting my astrology services! ✨🌕🌖🌗🌘🌑🌒🌏🌔✨", "qkittykat": "Scenttazzle.mygc.com", "_dreamingseoul": "Those boots are lifeeeee", "iam_ajoh": "On that note lol please check out my page and follow me if you like my content. I don’t do one specific thing, I focus on living out my purpose on my own terms, and I share that on my feed and stories. Check it out thank you 😂❤ yes I’m cringing a little on the inside", "karinegoos": "@kapayasbeauty trying to sell 90s inspired clothing and accessories😊", "lyviacairo": "For all your French followers, currently promoting a course about self love and inner security. Thanks for the opportunity to share!", "fizzynation1": "Hello 🌹🌹🌹", "sidneymharper": "Come on @shanboody ❤️❤️❤️", "me_clermont": "🔥🔥🔥🔥🔥❤️", "rkalra7": "Omg thank you sooo much for bringing the realness and for getting 👏🏼 shit 👏🏼 done 👏🏼 whatever it takes! U are such an inspiration 💞", "nairisha.tv": "Queen 👑", "naomiwilsonpoetry": "Love this message, pure facts! I'm promoting my book Love, loss & Relationships. Available worldwide on Amaxon....my poetry page is pretty epic too 😂😊😊💗", "kyng.imari": "@howtohuman.ig", "kandikanec": "So, so true! @kaikos.swim Toronto based / minimal designs / made in Brazil – you need a set 🖤 check your DMs", "zestofdes": "Currently promoting my podcast, @powerinprosepodcast a space created for black women to embody their authentic voice. Too often black women are told to shrink, this platform was created to help them bloom. Available on all platforms!", "mimilovesmojito": "Nothing yet. But soon......my paintings!!", "shewolfdiaries": "Needed this. I'm an artist and a podcaster and always feel like a braggy asshole when I post about my work. Thanks 🖤", "sadicka.inc": "Currently promoting my YouTube channel, and all my social media platforms. 💕", "californiagirlla": "Promoting my YouTube channel. Link in Bio!", "alexandriaashcroft": "My book Sinnful! It's a contemporary biker romance novel available in ebook everywhere ebooks are found and paperback via Amazon... I'm currently reading your book Shannon! Yes I'm one of the slow ones😜 love you girl, thanks for giving me permission to be shameless in talking about my creative works! 😍❤️", "dominickrieux": "👏🏾👏🏾👏🏾", "jayceeblak": "Truth, thanks for the 🔥", "fitfierylatina": "Thank you 🙏", "illiegetdoe": "@illiegetdoe im promoting radical thinking and the healing power of positive thinking i an writing a book about my life i was a star athlete at once and i was a victim of violence and currently im fighting for my life in the hospital again but imma make it God bless u and im disabled and still taped into my sexual urges lucky it still works thats how i found about you God bless the artist in us all @shanboody", "adamwontlose\nVerified": "Verified", "justbeingmesh": "💯👏🏾👏🏾", "jeannesha.s": "How do I become Sexologist? @shanboody @sexplanations", "thehollandgirl": "Are these pieces from your wedding? Or am I crazy", "bumpsuponatime": "Shan, I was actually feeling a bit down about this exact topic today. But damn you’re always lighting a fire in me 🔥 Back to the grind!! Also, I’m promoting my 🤰 birth & postpartum 🤱🏻 doula services!", "gracecoudal": "💫 @staa.co which is an activist art group that explores the topics of intimacy and identity! as well as @itsbetweengirls which is a platform for young women and femmes to have honest and vulnerable conversations! 💫", "namaste.stasha": "Nothing but THIS IS WHY girl....biggest sigh of relief just now.", "nik_vicious": "My friends actually push me to promote myself. I don't listen (for the reasons listed in your post), but I'm working on it. Lol @vicious.royalty", "krystleceasar": "I’m promoting my Art! 💜", "thelotusroot": "I’m currently promoting my handmade aromatherapy eye pillows (filled with organic lavender & flax / with ultra soft, washable bamboo & organic cotton covers) @thelotusroot 💜", "soulseaing": "@mambasapparel my handmade kids clothes 😊", "lunab.___": "Your confidence is amazing 😩😍", "mekealohav": "I'm promoting my mobile massage practice in the Phoenix area. Massage to your home or office 💜 Me Ke Aloha Mobile Massage, @mekealohav ... Thanks for reminding me to keep pushing forward and out of the comfort zone @shanboody .", "rissadwilson": "Felt that ❤️ promoting my next @morejuiceplz event happening Friday in Los Angeles.", "thebrandgenie": "Designer for a day! Get your website or brand designed in just one day for $757. www.thebrandgenie.biz/designer-for-a-day", "iamniko__": "Tell me why I needed this so bad. I felt so dumb posting about my new cover video. Shan you never cease to amaze me with knowledge and a digital safe space to grow and learn. Anyway, I'm starting up my youtube channel again, so yeah LOL Check me out?! I think I am worth watching.", "luvinthislife": "My book, The End of Me which is about the three times that I died. For real. And, wait for it: link is in my bio. 😂💛🙏🏽", "eatthecaketoo\nVerified": "Verified", "palatesandpetals": "I’m promoting amazing culinary experiences in the comfort of your own home.", "reignfreeafrica": "Yes talk it out and and don't stop! Completely self promoting our waist beads!! @reignfreeafrica Love to see you wearing a set @shanboody (also completely excited for Tuesday's bookclub💕)", "astoldbycash": "#tappedintunedinturnedon ⚡️", "infinite_energy369": "@annaxmxrie caption! 🔥", "whoismotherisaalove": "PREVENTIVE MEDICINE :: USEFUL PRINCIPLES FOR THE NOW", "venus.andaya": "CURRENTLY PROMOTING MY PHOTOGRAPHY @six.nineteenphotos and me and my boyfriend’s streetwear brand @baremonkeyclothing 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 CHECK US OUT!", "jstormh": "100% pure marula oil. We ship in South Africa. It's an amazing product for your skin (as simple as daily moisture, but can also be used to treat serious illnesses like eczema) and also your hair (keep that texture soft, help fix your hairline) https://instagram.com/umngongo?igshid=icwkr5kypyp4", "chelsea_gwin": "I'm currently promoting forex trading and coaching others on how to become independent traders. And it's been hard because alot of people had bad experiences from dishonest people and they dont realise that this is even bigger than the stock market. Thanks for your message shan I really appreciate it", "lorenalatorre_": "I'm currently promoting my EP \"Urban Escape\" by Lorena Latorre (available to stream on all platforms)! 🥰 💜", "stannimambacita": "I have a fashion show in DTLA I need to sell tickets for. I have five sold so far. My show is Oct. 5th @6pm. https://themodelexperience-dot-yamm-track.appspot.com/Redirect?ukey=1SRelS1tcIisXoO-50XIrOvujIK1Q4YSKjM5Xlc1MgII-1821951509&key=YAMMID-56398140&link=https%3A%2F%2Fthe-model-experience.myshopify.com%2F%3Fref%3DStanniSoberanis I still need to sell 5 more or I can’t walk 😕 Anyone wanna support an aspiring runway model?", "hey_optimist": "Apparently, I needed to start following you TONIGHT and reading THIS post RIGHT NOW! Thank you! I have been hiding behind my computer and phone for too long, thinking that I needed to “look” a certain way in order to sell/promote myself. Well I am an author and a blogger returning to my storytelling roots with a desire and passion to help other tell their stories in their own damn words! It’s time- hell it’a been time for me to be me and write, publish and promote the shit outta me! Thank you for your lIght and existence in this world, Queen! I appreciate it.", "rootsmanchin": "I'm promoting my non-profit Web site ConsciousVibes.com . It's a collection of links and tips to Health & Wellness, Fitness, Vegan, environmental: Web sites, experts, films, books, etc. . I also have links and tips on Photography, Adobe Lightroom, WordPress, programming, and Reggae music. . This is a long-term project to share the resources I learn about. (Link in Bio) . Also check out my photography on my IG. . Thanks for this opportunity and encouragement @ShanBoody", "thegoldenclit_": "@afromayan !!!", "lady_.lestat": "This is the coolest thing any influencer could do! 👏🏽👏🏽 I’m promoting My Muay Thai inspired Clothing brand @chokdeelifestyle 🙏🏽💛💛", "authentiquelife": "My blog on vulnerability for millennial women! ❤️", "deevcole": "My poetry book \"Black Man The Poetic Experience\"", "curlycurvypassion": "This makes a lot of sense..thank you! We need to be even more unapologetic about promoting our IG page and corresponding blog", "beebrydges": "Thai yoga massage, energy clearing, self love 💕✨", "em_ci_sq": "You are literally my style inspiration", "music_loveher": "My modeling!!!!!! My Instagram is where I showcase my portfolio...I do high fashion, commercial, artsy vibes, beauty, swimsuit, etc etc etc. 😊", "nathiofficial": "MY MUSIC!", "kemiboyce": "Come thew boots with the garter belt attachment", "sophia.lazuli": "I started a speed dating company in Atlanta and NYC with my sister! If you’re looking for love in these areas check out @simplyspeed 🤗✨", "dswakhsr": "👏👏👏👏👏❤️", "daisha.nichol3": "@thesoxialxperiment_ is my brand that encourages authenticity, soon we'll be dropping merch. If you interested or wanna know more follow and dm me😁👋🏽 That actually felt great ☺️", "urmannequin": "New Street Glam Collection by @posemannequin ♥️", "jjlc_photography": "Wrote my first ebook professional development guide. The link in my bio is the emailing list for ppl looking to grow their career! Also, made a few youtube videos! ✨💜💜", "giannamasaew": "#GlampingonaFullMoon October 25-27th! A weekend retreat to activate quantum consciousness in a language that speaks to us most 🌹🔮", "theemrdozier": "🙏🏿💞🙌🏿✨", "moecha_latte": "I am currently promoting my real estate business in Atlanta! Check my page @therealtor_moeb and anyone looking to buy a home in Metro Atlanta can reach out to me via text, email, call, or DM!!!! I am also a Notary in the area 😊😁", "lady_db84": "I ❤️ the dupatta, earrings and blouse ☺️", "saba_tekle": "I am promoting my online school, co-authored book, and YouTube. I was feeling exactly as your post mentioned while I am just finishing the touches of my course. 4 years of business and still feel like this, woah. 😐", "themelissadenizard": "I am a 20 year old activist and organizer seeking to book more speaking engagements regarding race, gender, and or class @themelissadenizard", "kis_odyssey": "My travel blog, and hopefully agency someday. Also planning to write a book and start a business soon", "nillyearth": "Love you 🔥🔥🔥", "saykiara": "Needed this!🙌🏼🌿", "redcandy100": "Omg.. u are a Inspiration!!", "onethreadcoaching": "I’m a holistic pleasure coach empowering womxn through 1:1 coaching, to feel, envision and step into their leadership power through pleasure! Bye patriarchal standards of hustlin! I also have a womxns group, Come As You Are, focusing solely on exploring pleasure and sexuality ✨✊🏽💗", "dom_renee19": "I definitely needed this! Promoting my natural body care company @realrichnaturals", "gaias_wayllc": "🙌❤️🔥", "bonafideblend": "🙌🏽🙌🏽🙌🏽 I’m promoting a guilty free curl care brand called @bonablendsbeauty", "corinnelson": "🙌❤️👏🔥🔥🔥🔥", "itsviviankaye": "I grew my business @kinkycurlyyaki To over a $1 million in annual revenue as a solo mom & College dropout. I have a live weekly Instagram show ( Wednesdays @ 2pm EST) called Mind Your Business where I chat about all things entrepreneur-y, how to run your business, fix your mindset and making money. I also do coaching for e-commerce businesses. AAAAAAND I just did a pretty dope podcast with @shopify 🙌🏿🙌🏿🙌🏿", "xavierruffin": "This caption hit me in a real way. I promote others for a living but feel drained when it comes to promoting my own shit. I feel like I don’t want to give my last bits of energy trying to convince other people to like my work. Even though I think it’d be nice if they liked my work. 😒 lol", "gigi_stardustt": "@shanboody I work as a Branding and Marketing Manager for a global reforestation and women’s empowerment charity, @treesisters_official ✨💕 We are changing the world one woman at a time, rrrooaaaarrrrrr 🙌🏽✨🌎", "heyimshann": "Appreciate the message🙌🏿 I’m currently promoting my music, check me out!! Link is in my bi! Much love❤️", "feliciagrossbellamy": "Currently promoting @flow.with.fe & @blackpartneryoga 💜🖤🖤", "vanessa_p_a": "So here we go: I'm a Chef, wanting the world to know and appreciate my meticulous skills and share in my immense love for food. Browse my page and follow only if you're up to having a spontaneously aroused appetite and learn some cool info on food, recipes and promoting things I like to do other than cooking and eating: @vanessa_p_a . Hire me for your hotel, restaurant, private dining and catering. I will do pastry only if you force me to (by simply asking) 😌", "melanie_1913_": "Currently promoting my boutique @lornascloset1 it's named after my mother who passed away 10 yrs ago next wk. I literally pound social media daily talking about my brand and ppl feel I'm only focusing on that and neglecting being engaged in social gatherings but this is my baby and I need as much support as possible. Especially since its only been up 6 months but my pieces are protected by love, peace and positive vibes. I hope you all check it out😊❤️", "thebrowspace": "I offer tailored semi permanent cosmetic #brows in a relaxing & professional environment in #Houston. Great brows & Great vibes. 💆🏿‍♀️💆🏾‍♀️💆🏽‍♀️💆🏼‍♀️💆🏻‍♀️✌🏼@thebrowspace", "shewannabemyfriendsobad": "www.shadesofpink.ink", "lexdaplex": "My artwork 🖼. I can paint everything and especially a bomb portrait. Im really good and if you don’t believe me check out my feed ☺️", "shedesignsorg": "Promoting a UX training program for women ❤️", "chezzaouttanowhere": "I really struggle with self-promotion. And I MUST get over it.  Right now I’m pitching my show @wanderwomenshow. We just finished some last minute casting changes. Not ready for promotion but it does help if people know it’s a thing that exists. Im also working hard to make some changes in the cannabis industry and support black and brown farmers. Right now I just need people to care and if they have a resource, share it,", "tabiacharles": "Yasssss honey!! This right here!! I agree with all of it and will do more to put myself out there!", "sacinthesheets": "My blog! www.sacinthesheets.com ❤️", "zaydaliciousdesigns": "My art. I create watercolor mermaid paintings and line drawings of couples mostly but I have a few pieces that are more random. I am Zaydalicious Designs on Etsy, Instagram, Facebook, and Tumblr.", "beebeautiful2": "Ok boots 😍❤️👢 😍", "harmonythegoddess": "@revive_poc", "eboneelatoya": "I’m currently promoting my fashion blog that I started 2 weeks ago! Hoping to get 100 visitors on my page for this month! (Link in my bio!) lol 😘🤣", "lifebynaek": "Yes yes yes to this! I’m promoting my candle company @scentedescapecandles - soy candles with scents inspired by good memories, moments and moods hand poured in The Bahamas", "enjoyjaredbrady": "✔️✔️", "jenekajool": "Currently promoting my youtube channel (link in bio) and my travel blog!!", "missalovely": "Whoa 😯 girl! This is 🙌🏻 life. Thank you for sharing this message, it is truly inspiring. ✨✨✨", "black.remote.she": "@aftonelizabethh CAPTION 😩😩😩", "drjolenebrighten": "I’m getting ready to promote TAKE BACK YOUR HORMONES online women’s hormone conference to help every. Single. Woman. Know her body!", "k.u.n.j.o": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "empressconsciousness": "I've been reminding myself to fearlessly take up space as of late! Thank you for the reminder💚  I'm promoting my business @findyoufit which is focused on merging Spirit, Mind & Body Wellness. We offer services and share content designed to help with Self-Healing on all levels, so we can all begin to live life at our fullest potential.💚 Please check us out to see if we can help you translate what you're currently going through in life into Healing, Growth & Success.💚 Sending you love.", "glowwizzz": "You are so right. This speaks volumes to me 💎", "balancedles": "YES 👏🏾 thank you for this reminder!", "theteniola": "I’m an actor currently living in Lagos Nigeria and telling stories one character at a time. I’m always open to opportunities to show my craft and yes, I agree... The more you talk about your shit, the more people start to believe you are the shit!", "kay_lee_yuh": "Yessssss!!! I’m a marketing and communications consultant, helping brands and individuals effectively tell their stories and spread their message across various platforms.", "hollisb": "@itsbetweengirls", "emily_fischer_art": "I agree with this. Why are you perceived as pretentious when you talk about your skill? If you don’t promote your craft then who will?", "_miamor_mi": "Credit restoration and building 💪🏽 I feel amazing about what I do for my people! http://www.ucespp.net/MScott18", "themamasutra": "Hey @shanboody You’re so right! 👏🏼👏🏼 I feel like I’m constantly hustling. Promoting my book that helps parents with “The Talk” 🙌🏼🙌🏼 bit.ly/TMSReadMe", "valena_marie": "💯✌🏽💜", "aryannacooke": "Also, I’m a certified travel agent, so if you’re looking for a travel advisor to help you with booking a trip, email me at aryannacooke@redflighttravel.com (PAYMENT PLANS AVAILABLE)", "laura_lpta_traveler": "I want to start diving into bringing awareness to the foster care & criminal injustice connection. Maybe form an initiative to get these kids help & continue the exposure to what the system is doing to our most precious generation.", "thequeenofconnections": "Promoting a fun Group Trip: Queen V Experience ~ Cartagena MLK Weekend January 16-20, 2020. Exploring Palenque, Rosario Islands, Walled City, El Totumo Mud Volcano & more. Previous Queen V Experiences have been to Accra 🇬🇭, Cape Town, Havana, Paris and now Cartagena 🇨🇴. Pics of previous trips on my IG, DM me for 🇨🇴 trip details :)", "keshia.ro": "💛💛", "egoffmom": "I am currently promoting financial education, in which I teach people how to help families earn more income, protect their finances, become debt free and financially independent. Thanks for allowing me to share!", "ynk.jpg": "I have an art page, follow this account for logos, profile pictures and general art and photography", "athenalindsey_": "I'm currently promoting my brand @donttakecreatephotos, my YouTube Channel,", "shelleyhamilton": "I’m promoting my fruit carving platters 🍉🍍🥝🥭🍇🍓@brown__sugars.", "savanalees": "Ahhh I I love love this!! I am promoting my art and my writing ♡♡ so excited to continue to create commissioned art and connect with the right agent/editor to get my book published!! Promote yourself and your dreams!! You give other people a green light to do the same when you go big. Love this and all the energy ❤️❤️❤️❤️👏👏👏", "_dcarrie": "I have a podcast @travelnshit_ where I, along with the occasional guest discuss what we’ve learned from our travel experiences. We get into our opinions, feelings, experiences and expectations on not just travel related topics but everyday concepts like race, sex, religion, gender and how they’re experienced through our travels abroad, home and everywhere in between. Link in bio n shit!", "noabelle": "Yes to this!!! I needed this long caption for my newest business venture.", "ashraevision": "I'm constantly promoting my portraiture. It's what I want to do all the time. @ashraevision", "amaniyasmin.photo": "My photography. My photography means everything to me and getting clients is hard but this doesn’t mean I will not stop pushing and achieving my goal, which is establishing my own business.", "jeannececelia": "My menstruation underwear that I’ve been working on. Prototypes almost done and prayerfully heading to production soon 🙏🏾!", "jeveuxharibo": "It's been a few months since its publication but I have a book review (link in bio), and I have a few tv reviews I wrote last year on The Weekly Spoon! I'm also currently working on my debut novel🙌🏾", "rhondiva13": "@frisky.femme Females Encouraging More Meaningful Experiences by having more honest conversations, uplifting women to feel better about themselves and getting rid of stigmas society has placed on women about sex. @frisky.femme", "tiffanyyhyatt": "Promoting @wearwhatinspiresyou, clothing that inspires but not promoting it as much as I should 😏", "lizzydicocco": "Thank you for sharing this! We all need that push. I’m promoting my makeup artistry services 🎨", "tiawins": "I design and make jewelry to support free jewelry classes for underserved youth. I believe exposure to jewelry fabrication will lead kids to imagine more career options. My newest project is #TSDmobile. I am looking to convert a city bus into a mobile jewelry studio, so I can meet students where they are. Purchase jewelry via @teesankeydesigns or just follow and share to help spread the word ❤️", "theycallmetap": "Yasssss!!!!! Thanks for the reminder and on that 🙏🏾 @shanboody note, Shannon, and everyone else in the comments, I’m promoting my Channel: ‼️YOUTUBE.COM/THEYCALLMETAP ‼️it’s lifestyle vids, some reviews, some travel, pop culture topics, but I also talk about my very personal experiences in the hopes that my openness lets others know they are not alone! 🇧🇸 ❤️", "mami.x.fuego": "I’m promoting my business. @la.bruja.negra I’m a Bruja and I’m keeping the practices of my ancestors alive. Helping people find the courage to decolonise their spiritual practice and find peace in the exaltation of Afro/Caribbean deities(y los ancestros). I’m just beginning, but it’s blooming every day and I’m helping more people find prosperity through ancestral connection. 💛", "everybodylovescristina": "I am promoting my life insurance business that teaches people about their finances and how to make and save money. What they don’t teach you in school and especially not to the minorities!!", "friendswithagenie": "Omg @shanboody I legit was crying about the conflict I had towards “promoting” my business and making cold calls. I needed to see this. Thank you. 🌹", "r.diggz": "🔥💜", "shezelslife": "Yesss, I love this and you!😆 I am a 26 year old mother, wife and bachelor of nursing student here in Toronto, sharing all of my knowledge and experiences gained, on my lifestyle blog @shezelslife, with the hopes that I can encourage women to live and embrace their truest, most authentic lives!💕", "acemxo": "Trying to promote self love & confidence everyday, one person at a time 🥺", "rishmawalji": "My passion and purpose keeps me going and hopefully the desire to help will win over the cringe of self-promotion. 😊 Currently it's a fertility program helping people to get healthy so they can get pregnant, stay pregnant and recover post-partum. 💕", "cakenap": "I love that you're encouraging fellow creatives 👏 I'm promoting sacred adornment through my jewelry line @moonteatalismans everything is hand fabricated by yours truly 👩🏽‍🏭🖤", "kan_dia": "@infromtherainlashes", "iamroyalfit": "Online and physical trainer check me out", "kena_thequeen": "With that said, plz check out my new music video! Link in bio ❤️😭😭😭", "obtusepanties": "You know I wish I was promoting myself! I feel all of those things about it though so I don't. But I love creating and have been dreaming about making it into something lately.", "tats_adz": "This message is so important!! Thanks for sharing 🙏🏼", "j9_bruen": "Singer/actor/performer based in New York! Also working toward building a business as a voice teacher. (Manhattan/Staten Island-hit me up singers!) Thanks for this great post!", "keishaannram": "My books as well 😄😉😘 link in my bio 💕", "amyaymes": "This post has me shook. @kylakupid @mandygphotography I’m gonna need a think and come back later to comment 🤔 what AM I promoting..?", "myleslieanne": "Hell yes. I have a blog. (The link is in my bio.) And I’m a visual artist. ❤️", "rowbrennamac": "I mean, since you asking.... My curly hair business with my partner @natsheco‼️ We make everything ourselves and are based in Toronto ➡️ @curlshoppe 💛", "ahew76": "My food company, it’s my passion and I’m a cook and food writer @hewitts_kitchen", "ariannelyoung": "I’m promoting my virtual assistant company for those who can’t find the time to concentrate on the work their meant to do, I’m here to tackle the “everything else.” ✨🖤", "__teephenomenal": "😩😩😩😩gorgeous", "maddyvae": "Promoting my new crystal business @gemenergies ✨💕 I am SO damn passionate and excited about this and I want the world to know! Thanks for this “permission” to promote, a well needed reminder", "awkwardchicjewels": "The introverted in me makes it difficult for me to share that I sale affordable and fashionable jewelry...I'm always worried about bothering people 🙈", "a.d.skolar": "Thank you for this post. I’m promoting myself as an edutainer, my health and wellness podcast, my coaching and public speaking business. Thank you again. 👊🏾", "crystaldymondartistry": "this was a much needed caption. sometimes i feel like just because im not as “popular” as other people who do what i do that i dont have the courage to promote MY craft. but im realizing that we all start somewhere! i’m promoting my makeup artistry in texas!", "charlotteruthwilson": "This is a very apt post for me today", "toya.alicia": "@nude.swim and I’m dying for you to wear your suit... nUde Swim to di wooooooooooorld 🧜🏼‍♀️🧜🏼‍♀️🧜🏼‍♀️🧜🏼‍♀️🧜🏼‍♀️🧜🏼‍♀️", "heavenarcade": "✨I do freelance photography/videography, if you like my work come book a session and let me capture your vibe on film or digital 📸🏁🦋", "sophiasundar": "Currently promoting my vegan apparel company 💚 Thank you for this", "momomoradz": "My artwork 😯 @momomoradz", "lilyshepardmoves": "@growyourlovespace", "mukeshsankhla27": "Fantastic 💟💟💟💟💟", "_everythingcurly": "I’m promoting my friends @dennard.found.it realtor page and my friend who is a upcoming skin healer @lisaraye08_ located in dallas tx", "nevertheless_gpersisted": "My photography @gm.creativephotography", "travismorrisss": "I am promoting POSITIVITY! 🌈🤩Embracing who you are and being and Living that to the HIGHEST AND MOST AUTHENTIC WAY! 😄🙌✨ As well as ME!! 😂😄👏", "mike_ddzz": "HEYY FRIENDS AND LOVERS . WHAT AM SUPPORTING (TONIGHT) ISN'T JUST WHAT AM DOING BUT WHAT OTHERS AROUND ME ARE DOING . I SUPPORT EVERYONE WHO'S ON THE MOVE TO DELIVER, BUILD OR CREATE SOMETHING NEW , OPEN , INNOVATIVE AND CREATIVE & ARTISTIC. I SUPPORT HEALTH REFORM . THE USE OF NATURAL PLANTS (HERBS, VEGETABLE &FUNGUS) THE USE OF CLEAN FOODS AND EVERYDAY PRODUCTS THAT WE MAY HAVE NOT CONSIDERED TO BE DETRIMENTAL TO OUR HEALTH AND WELLBEING. I SUPPORT MATURE SEX DATING AND RELATIONSHIPS (even when am not totally there ) I SUPPORT WHATS GOOD FOR US AS A WHOLE. I WANT TO ELEVATE THE MNDS OF THE YOUNG AND OLDER PEOPLE TO GROW MENTALLY WHILE SEEKING KNOWLEDGE IN ALL THE LEGIT PLACES POSSIBLE. EXPANDING MINDS IS MY PROJECT 🧠LOOKING FORWARD TO BECOMING A BETTER PEOPLE WITH EACH OF YOUU WHO SEES THIS ❤️❤️💡🧠 @shanboody I SUPPORT YOU .", "itsbriannacamille": "My Beauty account @blendedbybricami I'm really young and just starting but I'll post more content soon enough", "growyourlovespace": "@shanboody thank you for this message. i am currently promoting my Sacred Space Facilitation, Full Ass Human tshirts and my Rooted + Growing Oracle Card Deck!", "shaunneka.kh": "Damn!👏👏👏 I feel this. Currently working on putting myself and services out there.", "mrsjciceron": "See this is why I've always felt connected to you! You inspired me to think big and to be confident in my ability to create. I want to be this person for someone else someday! You're amazing and a total game changer! ❤️ Currently, I'm promoting my talk show @voicestalkshow on YouTube. It's a panel-based talk series that brings everyday members of my community together to openly discuss tough conversations surrounding social issues that effect our. Everything from racial tension and discrimination to mental health and even immigration. I just launched last month and wrestle with promotion trying to get people to engage. I'm also promoting my podcast @unapologeticallyanxiousme ~ Confessions of a Haitian Girl in Small-Town Minnesota. You can find it on Apple or whatever is your preferred podcast. This focuses mostly on me and my background, my struggles with anxiety and depression. I talk a lot about my hardships and experiences with racism being one of the only black families in my small town. Thank you for this opportunity Shan. 🙏🏾 It means so much. You embody what women in this industry should be to each other. ❤️❤️❤️", "dr.karinab": "A word I needed to hear! I am a hair model and digital creator of hair/beauty and health related content. Subscribe to my website for everything health and beauty from a health professional! - Thedispensarxy.com", "shanaekidd": "This gave me so much insight and Inspo 🙌🏽 I need to stop being scared of promoting my shit I put my heart and soul into 💜 @girlhiboutique woman’s clothing store ✨✨", "blssdgrl": "🔥🔥🔥", "emma.louise.hewson": "Love this! I'm an awesome Toronto based piano player and always looking to play in great projects 🎹", "danixelleleigh": "Follow @ASHIDO.CO for all things cannabis, all things femme 💚 A cannabis lifestyle brand #follow ✨", "andreasamuels__": "Makeup Artist in LA, always promoting my God Given Skills 💄🎨💄🎨💄🎨", "bmoore__fit": "Perfect timing...I just launched my first online fitness training program and as I created another story to tell everyone about it. I was like okay girl just STOP 🛑 but no I won’t stop!! Lol thank you @shanboody 🙌🏾🙌🏾 🔉EVERYONE GO TO BMOOREFIT.ORG and purchase my 3 Week Home Program: Only $25‼️ I’ll be doing the program as well!! Let’s get these gains together 💪🏾💪🏾♥️♥️", "liv_with_spirit": "This is so awesome that as a creative woman you are sharing this message. I love all of your work. 🖤 I am a Self-Love Coach and I have a beginner 30 Day Self-Care Challenge (Giveaway) starting Oct 1st. Check out my page for rules and details everyone. 🌱", "thesamlao": "Ugh I feel this so hard. Self promotion just feels so pushy and annoying and awkward so I tend to shy away from it and neglect it for months on end 😭 right now I’m promoting my new single “Selfish” LINK IN BIO 😬", "ashido.co": "We’re promoting the normalization of women cannabis smokers 💨💪🏾 Follow @ASHIDO.CO A Cannabis Lifestyle Brand for the everyday femme 💚", "itssugarluxe": "So right! I am promoting my delicious gourmet flavored cookies and custom designed sugar cookies! They are amazing and can be used to help you promote whatever it is you are promoting! Click the S and check me out! Much love 💕", "loliittaaa__": "THESE BOOTS!!!!", "jetlife_nikki": "Wow! This thread is beautiful! 😍 Check out my podcast page @the_boujieblackgirls and catch new episode every Sunday at 11am eastern standard time. Thank you @shanboody for your beautiful personality and this dope ass opportunity!", "almostoldpod": "I am promoting the podcast @almostoldpod", "darrylnarain_art": "Great post! I learned this lesson about a year ago and ramped up the promotion of my art 🍻", "_keesh": "My sister @kjalexan40 wrote and illustrated a Children’s book and it’s available on Amazon!", "kurlykrisss": "I’m promoting my Euphoria inspired makeup series on my IG ✨", "authentically_asb": "Well since shameless promotion seems to be permitted here, I'd love it if you guys could subscribe to my blog AuthenticallyASB.com (link in my bio) and my podcast @strongfriendcheckin. Each platform is dedicated to mental health in the black community and how it intersects different areas of our lives from career to relationships. 💜💚", "lacksruehle": "Shannnn what time were you born 😂 I need to do your birth chart!!", "blackgirlstexting": "Yess!!! We are always promoting our podcast @blackgirlstexting! Thank you so much for posting feels so good to acknowledge our work 💜", "charellegriffith": "I just launched my inner circle for solopreneurs. An exclusive community for people building a one person empire 💪", "chalicekristell": "Love this caption! I’m promoting my interior design business! @kristell_interiors ✨🥰🙌🏽", "jazminngee": "Getting certified as a makeup artist soon and also a full time student I’d love more clients or just support on my makeup page @jazmingmakeup", "thebxsocialite": "My novella is included in @runningwildpress 's Novella Anthology vol. 3, book 3. Coming out Dec. 1st! :)", "katdamm": "I started an instagram account about sustainable living because that’s what I’m passionate about! I called it @the_sustainher 😊😊😊", "jillisawinkler": "Currently working on big announcements for @blissfulbalmsandbath but feel silly sharing things on my personal account everyday. But I really just love this stuff! Thanks for always sharing positive pushes, if you say I gotta keep bragging on my products the new plan is talking about it EVERY.DAMN.DAY. 💫", "kerriisms": "I have a few projects coming up...announcing a big one this week! If you’re into lifestyle, beauty, books, and wellness, come and check out my page and join the crew! Thank you Shan for this needed message! 🙌🏾✨😍", "maherah1218": "I'm a new Realtor in norcal.. struggling to get the ball rolling but promoting myself as much as I can!! #whosyourrealtor", "iammrs.ellis": "My little girl dresses @labellissimacouture", "clue313": "I’m promoting my sneaker care service @cleansneakercare!", "quisochic": "🙌🏾🙌🏾 Yesss!! Thank you for this. I’m promoting my planner —> Savvy Jetsetting: Getting Sh* Done Planner for sassy stews & stewardesses @itsa_lifestyle365 💖", "theholisticbohemian": "I’m promoting my fashion + jewelry design business @ssstylestudio + my 🧘🏽‍♀️ wisdom in yoga asana.", "leil_cooks": "My skills until I eventually start my own brand", "imaeffingfool": "Omfg @shanboody", "misscrichlow": "*clears throat* I am a Masters Student in Counselling Psychology who uses my platform to talk about every and anything to do with relationships! 💔💖 The video tonight will be on the different types of cheaters! 💄...Thanks Shan, I definitely needed to hear this! 😶❤", "faux.rass": "Promoting my blog on Wordpress, offering writing services soon 😌", "maia_mnt": "Thank you from France. I needed to hear this. You are so right. Im promoting my project @loesoa_cap but I play shy and I don’t play extra loud about it. It s an eco friendly cap made from recycled plastic and organic coton❤️🙏", "briyoumetravel": "So true! I’m still working on getting better at this 😭  I’m promoting my travel company @youmetravelco, which helps more black millennials see the world ✈️ with group trips, custom itineraries, free resources and events!", "saturatednights1": "I just wrote my very first series of erotic tales! Mr. Unexplainable available on Amazon 💜💜", "urrnotmymom": "I’m an 22 year old hairstylist specializing in blonding and Color of all hair types in the North east Florida area ☺️💕✨ @HairBy.Jacara", "kusemek": "My ART!! I am a fine artist with a deep connection to my spirituality. Currently working with pencil mediums 💕🎨 @kusemek", "fullcourtpumps\nVerified": "Verified", "thelastdyingbreed": "Thank you ! For holding us accountable! I will do better", "reign_check": "I’m promoting my soon-to-be book 📖 called “Uneasy” about intersections of the black femme! Follow my page @uneasy_thebook for updates on when it’s out!", "zoerhuey": "@Z.Commentary ⚡️ A personal/opinion blog!!🧡", "ashleyharriscaptures": "😍😍", "aliciaacewest": "I have my “Positive and Productive” merch I’m promoting!", "meggles1820": "Love and acceptance ✊🏽✊🏽🔥", "teenanaa": "It’s so weird that this post is exactly how I feel about promoting my business. And it’s sucks even more when you shamelessly self promote and the positive response you want isn’t immediate, it may even be slow or nonexistent but persistence is key and faith in your own power to manifest what you want for your business is key so THANK YOU @shanboody for the reminder! If you’re ever in Toronto in the future and need a fire natural nail set: @grownglonailbar 🙏🏾✨", "kat_antoine": "Amen 🙌🏽", "shanicegravesandy": "I so needed to see this. Still trying to find to courage to promote my cheese boards @shmoreboards", "healthzinergytoronto": "Big thank you for the reminder am opening my Yoni wellness spa in Toronto and am super excited.", "lady_rhaenys": "I'm currently trying to promote streaming channel. Everytime before a stream I have a freakout moment just thinking about promoting it fun but extremely terrifying I need this XD", "anna_b_rich": "I am promoting my food blog IG _anna.eats_", "iam.marche": "I am promoting my personal YouTube Beauty channel and my partnership online clothing store @prettyplatinumclothing", "brittanyabrooks": "Yes!!! I love this!! And with that so eloquently put, I’m promoting ME!!! IM A DRUMMER AND A VIDEOGRAPHER AND AVAILABLE FOR HIRE IN EITHER PROFESSION! BOOM 👊🏾", "solusvenus": "wow i REALLY needed to hear this", "xx.taty": "IM PROMOTING MY YOUTUBE CHANNEL TATYMARIETV lol link is in my bio ☺️ also shan baby you stay slaying 😍😍", "bu4350": "💖😍", "arthurmorrissr": "I love ❤️ your style 😍🌹🌹🌹", "paperootdetroit": "❤️❤️❤️ Can I get some honest opinions on my work??", "aisha_crna": "I’m promoting my line of blue light glasses @shopuvea", "_lakeish": "@_blvcmrktboutique ! An All Black Vintage Boutique 🖤", "genebhunter": "Wowowowow I needed this! I’m promoting my blog + lifestyle platform — all things identity, style, and inspiration. 💓💓💓", "jcordero912": "I'm currently promoting the @canvsart we are a visual arts company with our own app on where to find murals around the world. We are looking for funding to help expand our brand. Check out my story for more information.@canvsart", "marsha.jeune": "I am promoting my online book club open to anyone from anywhere if you would like to sign up please click the link in my bio to take the survey the first book that will be reading is you are a badass. and yes the @thegameofdesire is on the book club list so if you have not read or purchased it get to it!", "domvharris": "My mutha-phucking podcast, Loquacious Dom. I educate everyone about things that tend to fall through the cracks. When I learn something new. WE learn something new. Welcomed to listen to the best podcast on Mars.", "glamgirljaayxo": "Preach girl I’m consistently talking about my podcast 👏🏾👏🏾", "prettysocialatl": "@hankyshouseparty @brandtherapypodcast @prettysocialpics <<< That's all me!", "siani_annie": "I'm promoting my writing. Eventually, I want to be directing", "itsdiamondjewel": "Yassssssss felt this on so many levels 🙌🏾speak sis SPEAK!", "iamthemonetizer": "I am an actress, writer, filmmaker, and marketing genius! I specialize in helping artists, actors, and creatives monetize their craft! I would LOVE to help YOU or someone you know turn their passion into PROFIT!!!! DM me for details! I can do virtual coaching or local (Atlanta) Let’s support each other!", "monetvation": "A conversation I had on my friends YouTube channel on building confidence, and the role it played in finding my husband #linkinbio", "courtneykocak": "🙋‍♀️ my podcast @privatepartsunknown with @thesofiya ... you & @enjoyjaredbrady should come on & talk abt your relaysh!", "vonnettasdiys": "Facts🙌🏾", "ekoidstudio": "I enjoy promoting other people. It gives me excitement and I feel accomplished. However, I realized this year, that they same people I get excited about promoting couldn't care less about supporting my dreams and goals. 2020, I'm focusing on fearlessly promoting myself. Why not now? Because I want to thoroughly plan out my next steps and goals. I will no longer promote people harder than I promote myself.", "gabbiieew": "Im promoting my photography, Videography and modeling! Check me and my work out but checking out my ig or my YouTube channel (link in bio) ☺️💕", "nami.nae": "I’m promoting my makeup account please follow @nami.tology 🙏🏾🤧", "randisavage87": "My dope podcast about black millennial dating and relationships called Situationships Podcast! Check me out! @situationshipspod", "_iamabigailrose": "My business @blendedsense @blendedsense.io !!!!", "outofctrl_podcast": "I struggle with this! Thank you for this reminder @shanboody", "renayalthea": "@veritythepodcast ! We Would love to have you on as a host ! 🙏🏾🙏🏾", "soshecreates": "My photography!", "supasoph_": "I’m promoting my yoga teaching services for community workshops and after-school programs as well as my tarot and divination skills. Business page coming soon. PLEASE follow and stay tuned 💫", "marlyymarrr": "Ugh, I totally felt this when it comes to promoting! But I am currently promoting my skin care body butter brand @spiranaturals 🤗", "merelygrace": "@imperfectfifth is about to announce our 2nd anniversary event/showcase in KC! Women led music publication bringing the arts to the masses!", "pinanthye.vee": "I'm promoting #SOCACIZE thanks to you actually!", "thejasminebperspective": "🖤Thanks for this!!I have a blog about being a black girl from a low income community who is managing chronic illnesses and anxiety while sharing my love for beauty and life.", "tiffyneerenee": "@frisky.femme females encouraging more meaningful experiences...", "privatepartsunknown": "Our podcast! We just did a special ep for #InternationalSafeAbortionDay with @lizzwinstead @ameliamaris @divadelux & some other rad ladies. Check it out 🤗", "thewesleymadison": "I have a single pit, link in bio, and I really love it! And you 😘", "divinityray": "I’m a queer hairstylist DTLA and we just opened the first safe space LGBTQ+ hair salon downtown called @thairsalonla ✂️🏳️‍🌈 Currently accepting new clients! I love beautiful, colorful people in my chair", "dwo_boss": "Omfg 😍😍😍😍😍😍😍😍", "quickieswithmickie": "currently promoting my youtube channel, dating coaching services, and ecourse coming soon 💖💖💖", "kalindtv": "Well if that’s the case ..... if y’all are into podcasts can y’all check out my podcast @cousinsnightpodcast_ ? Shannon, we talked about Vabbing on the most recent episode at 1hr 8mins", "sirenaalyce": "Web design and development services! @sirenaalycewebdesign", "health.yeah.nutrition": "Coaching women to better eating habits with a flexible and empowering approach 🤗🤗💪🏼💃🏻", "jtesini_photo": "I do photography down in Miami", "heedthewarning": "I’m promoting my book “It’s Hit the Fan: A Disheveled Mind in Print”. It’s a book about the acceptance of a mental illness as well as some poetry. The link is in my bio!", "sarahclarebrown": "@sheisnotyourrehab is what @myfathersbarber + I be promoting! A movement directed at MEN we wanna take global!!", "diedreinwanderland": "I'm promoting a free guide to finding cheap flights 👌", "thuggishruggishbonnie": "Yesss!! I feel so guilty about promoting. I am currently offering CBD skin and hair care items, crochet fall gear and waterproof sex blankets 👏🏾!!", "returnofthespirit": "Content writer over here!", "amkrasner": "@twowestentertainment come check us out @shanboody 🔥🔥🔥", "sexandempathy": "INTIMACY EDUCATIONNNNNN ✨✨✨", "kaylanedza": "I’m promoting my group wellness program for high performing women 🙌🏽🙌🏽🙌🏽", "anahita_kash": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾🙌🏽", "dominique.dawnelle": "Can I get a book on this, because I need so help 😭", "joettaloren": "❤️❤️❤️", "tiffany_marieshultz": "I’m promoting my vegan bakery @dutch_s_860 👏🏾👏🏾 Hustling hard working full time and dedicating ALL my free time to my business. I’ve secured my first wholesale account and hoping to open a shop in my hometown in CT🤩", "jackssta5": "Alright. You go Shan Boody.", "infinite_blue_": "I’m promoting my graphics business! It’s scary as hell to take on new clients but it’s the best way to continue to build on my skills. Thanks for the inspiration! @victoriafelixgraphics", "noni_rene": "WHEW! I NEEDED this message. Truthfully, I need this as a daily reminder somehow --- currently promoting, @noni_rene www.nonirene.com --- Please check out my singles \"Good Vibes\" and \"The Time\" on all platforms, including Instagram stories! I have a campaign where I offer FREE merch to those who use my music in their IG stories 🖤✌🏾⚡", "jayfromca": "Yooooo! So proud of you. I have to come get my book signed. 🤩🤗", "saidovna.k": "Shan fuckin body, you are always on time. IM PROMOTING MY MUSIC! Go check it out. Link in the fuckin bio!!", "shilohinthecity": "Why is that you always drop these pearls of wisdom when I need it the most? 😭", "protegeon_la_planete": "❤️❤️❤️", "gaylyn.lareese": "I am currently promoting my dancer self care brand @mymotionprep. I am so sick of seeing professional dancers trying so hard to please the industry that they don’t take the time to care for themselves and their bodies. As hard as this journey has been, I know that being a professional dancer who has experienced this makes me the best person to close this gap. 💙", "genfricker\nVerified": "Verified", "alexamutchler": "Alcoholics Anonymous (and other 12 step sobriety) recovery jewelry, t-shirts, bags, cards/bookmarks, and lapel pins! @billsfriends (www.billsfriends.com)", "lla.ama": "@amaalhaircare My hair account for natural hair care tips & Braiding🌻", "unaversal_unacorn": "I co host a podcast @melaninvoicespodcast voices. It’s for millennial people of color who are just trying to figure life out! We usually drop new episodes every Tuesday check us out 💛", "miss_anelas": "Check out my calligraphy page @nicolecalligraphyco. Website is in the description box.", "deee.persaud": "👏👏👏", "theselfcarementor": "I’m promoting Black Mental Health! I been doing this for a little over a year, sometimes I get discouraged and fearful of what could be. But this past week I finally filed for my LLC and opened a business account so now I have to make this work!! @DomoniqueRobinsonLMSW 💚", "cnickview": "My esthetician businessss what’s up DMV. (I do feel weird in the pit of my stomach promoting this , cause I just got started ☺️)"}