{"fantaszee": "I would for sure", "kijukijus": "i mean i tried to do that while we were together anddd after we broke up and got no where so 😬😬 i’m good on that", "c0ldbrew": "Hell yea @vonny.a_ why I’m a better man now", "natalyaamres": "I LOVE @alain_de_botton, and I’ve seen this video so many times! Also, yes to feedback from exes 👍🏼", "wellnessinlove": "I did something like this with my ex. Was very helpful in!", "haydeearizala": "I wish I could have done this part of the workbook properly , I think I would have loved to know. Unfortunately I couldn’t ask in a safe way for me. Self knowledge is my special interest though, I work regulary on all of this and i did my best to get good feed back from other people", "lil.tangent": "I kind of want to do this with my current partner to see it if can shed some light on issues we're dealing with and help us work through them more efficiently. Thank you for this! 💕", "noreenpilime": "@thee_rainbow_chaser slide through", "keepinupwithkell": "Hmm @hollywoodpearl I’d almost rather stay wrong😄. But, maybe it’s worth a try?", "chefifi_777": "No previous relationship was long or strong enough for this but I and self examining with my sister. We're so much closer, more understanding and willing to talk/work toward solutions rather than let things pile up, linger and frustrate us both later on. We're mirrors to each other and I feel like I'm a better me in all my relationships and friendships going forward.", "dakotasnape18": "@jennyvy_ @nguyenvy_", "_britany": "Absolutely! I always get feedback from exes!", "nikki89.15": "👏", "becomingchefwright": "What is your take on this? @iamebdiaz", "sincereiam": "My exes told me that it was my way or the highway. I never knew I came off like that. I gave a lot.", "chriscrosserx": "A ton of this is just common sense. It’s really about knowing what you want and understanding you self worth.", "shamrockinit": "@moe_rae_dp I ask you this question", "mayra.hrtmnn": "This is a really great idea", "shortestnamepossible": "@smartyk13", "evierobbie": "Yes. I interview my exes", "x010495x": "@kirstyjoanna", "lemmontine": "@tassy_08", "isabelhunt1985": "Yep. I've definitely done this with an ex. It's helpful!", "ronejae\nVerified": "Verified", "chidoll87": "My ex didn’t want to help me improve for someone else 🙄🙄🙄", "miss_suzanne_lilly": "Yes I would🙌🏽 100%", "dykedelic31": "I’ve done this before with my last ex tbh . Nothing wrong with trying to help each other out after a break up it could help them and you grow as a person.", "julie.elena": "@kisssmyphanny", "lifeofradiohead": "I did. And i will ✨🙏🏽", "glutton_to_goddess": "Is it bad I used my husband for this portion?", "iwantimani": "If she wasn’t a psycho... sure.", "daninicolemusic": "Oooh, conspiracy of silence around us!! I feel that.", "xenerbeaner": "Damn i need to buy this book", "tis.symone": "I wish I could 😩 I did this with my ex but too soon after the marriage ended. Wish I could do it again now with more solid questions 😭", "le2theann": "Valid", "nae.nirvana": "I did this and it was definitely a good look in the mirror. Sometimes it doesn’t matter your intention if the person you care for was hurting.", "reflection_oasis": "I think it’s your close friends who will tell it like it is about your flaws and attributes . Just ask your one frd who is blunt as a knife and take it without taking it personal to improve yourself . 💪🏽🙏 #goodluck", "droppinjewells": "I have 2 copies of @thegameofdesire to giveaway for FREE!! Check out my last post for the deets ❤️", "mamamiemotional": "I think for me the hardest thing is that after most breakups... especially immature ones... ex’s can get a warped perception of you and a lot of times with make themselves the victim when in reality it could have been a conditional love or just a mutual this doesn’t work. Once other people get involved in you relationship it’s hard to know what memories happened the way they could be saying it.", "worksoulflow": "\"conspiracy of silence\" I love that phrase! It's so true. I think this is a great exercise.", "ericachadwick__": "Girl goddamn.", "_kstrong": "👏🏾", "flawlessbritny": "You’re a genius girl. 💕", "iamzetamorrison": "DAMN SHANNON! How you communicate... your intelligence is just mind blowing and inspiring. Whew 🔥", "officiallamajreema": "Perfectly explained!!!!", "justinerebekah": "Issa no for me, ex was a narcissist, relationship was in an earlier age point early twenties life changes, focused on self development, meditation and reading books like “ codependency no more”...don’t need his insight or feeling of “expertise” on past actions to know more about current self! ...might work for others though I’ve moved on to a better self relationship and intimate relationship with my current partner than has also done a lot of relationship reading and work on his own self ! 🧘‍♀️", "sincerely.beautifull": "Yup. I have reflected with exes in this way in the past. Enlightening and healing.", "ameenah_loves": "Yes, asking the ex was really important for me and my history. Some key blind spots were illuminated. And applying what I learned created depth to my next relationship(s). I also loved the original talk with @alain_de_botton . A pleasure. - Humorous and insightful.", "becomingash": "Yes I would", "brispeaking": "I wouldn’t only because he made sure to tell me all the ways I was wrong post break up so I didn’t need to ask", "deonwarrenmark": "👍💯 Your explosive 🔥🔥🔥 keep moving forward!!!", "abilema__": "@gu1nness", "theawold": "@elenafernandez", "avchrys": "Soooo I’ve been practicing this for years. I’ve been blessed with pretty receptive ex’s and they’ve all given me such great insight into myself/our relationship. The caveat is to be able to actually LISTEN with curiosity and then be real with yourself, about yourself. So happy you’re a public figure speaking on such real issues. You go girl!", "ms1epic": "I did this. I got good feedback, but a word of caution: make sure your ex knows that “working on yourself” does not mean “working on getting us back together.” WHOOO CHILLAY. My life is so foolish.", "gowiththe.flo": "Fuck it. I got some extra money now. Going to buy the book.", "laurengching": "YESSSSSS Alain! Big time guru 🙌🏼", "_loudwhisp": "Amazing", "hunterjbriggs": "@@passionatepathcoach", "718consultants": "Yes I want to know everything about myself —- is specially the me In the eyes of people I’ve love.", "sweetheat_dani": "What if they are unreachable? 😭 The two that l can/could trust their feedback- one has past the other has blocked communication 🤷🏽‍♀️", "eriinak": "You teach me so much literally every day ❤️", "chevrandy_w": "I would love to but Maybe in a few years. Can’t speak for him but I think we’re both Still a little salty about it😅.", "carmen.ferry": "I find this so interesting...", "belleza_365": "I've already done this mutiple times unfortunately @domwhaley8 🤷🏾‍♀️❤", "moriemores": "Super clear what you meant and great job!", "devin.lea": "I only have two exes and both were hella toxic 😭 one was abusive and the other one was super controlling and we got into yelling matches every single day.", "cycleseeds": "@shanboody i LOVE you. daaamn. YES woman!!! keep doing the workkkk🤗", "loussoe": "I would ask my current partner to be a better lover for them", "makedafleming": "I definitely think its important and beneficial for all parties.", "s1p9s8n6": "@mscookies876 ououuu, interesting....😏", "jazzy.phae": "I love this!", "jenkinsnd11": "My ex husband answered back with paragraphs for each question. He was very thorough. It was very insightful and truly served its purpose.", "blacklvrboy": "Came in the mail yesterday", "iammarilynalexis": "MAN YOU MAKE ME PROUD", "chelsealauren.soulnutrition": "YESSSS I TOTALLY AGREE WITH THIS 🔥 I’d love for an ex to tell me where I fell short so I could work on myself! 💓", "maximilian_fernandez2": "It's amazing to watch you grow in success shannon 🔥 very inspiring @shanboody", "juliamit": "My ex is now a good friend of mine and he actually helped me to become a better person.", "cartier.cubby": "I could but i don’t want to", "findyourstory": "truth!", "kingchuck_": "@la_jacqueline funny seeing you here 🤣", "dswakhsr": "👏👏👏👏👏❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sexologistshamyra": "Are you wearing a Vesper on The Doctors though!? @shanboody I'm here for it!🙌🏾", "heysol_sista": "Done this. Liked it. And I use the feedback.", "thunderous_lover": "People are often too entrenched in pettiness to acknowledge the possibility for growth in uncomfortable environments, or to take personal constructive criticism from someone they still harbor feels/ire towards. Part of growth is an openness to it, wherever it may stem from.", "dfa4bk": "I just started following you and it us so funny to find another person using the word \"welp\". Folks look at me funny when I use it to share a dramatic opinion. 😜.", "daniel.pillai": "I am ready to ring a ling a ling ☎️", "bella_galore11": "Is it crazy that I spoke to my gf ex a few weeks ago. It gave me a huge insight on things", "fatemaalisha": "@toryrajani ooh interesting..", "iamsahararose\nVerified": "Verified", "genieeeeeeeeeeee": "Girrrrrrrl so well put! Your exes can give you a lot of insight", "b__is__an__alien": "That’s where self realization comes to play. You can’t expect feedback from people because they will always tell you from their perspective and at times what they perceive of you isn’t true. Even if the person is good or bad. Asking for feedback from a person who doesn’t practice awareness of the self is going backwards, A lot of people don’t know themselves and shouldn’t use others to make themselves aware of themselves. I feel that makes no sense. All the answers are in us, seeking answers from others is more so a need for validation. If you really want to become a better lover, person etc, then just do it without involving others. You are an individual first and foremost, so you have to work on yourself by yourself for yourself so you can always be the best for everyone you come across. ♥️", "blynnn_": "@chapter.iix which one should we start with ? I actually was debating on doing this the other day after talking with my therapist 😂", "_cristinalovee": "Feedback is always key! 🙌🏽 I do have a question though. He's currently happy with a gf I'm acquainted with now (long story short she added me and we talked). She's a nice person and people find it wierd we're cool with each other. Anyways, do I ask her if he can give me feedback? I'm not sure I'd ask him because I wouldn't want to be in an uncomfortable situation but I do know how much I have grown within these last two years ☺️", "mustafathepoet": "I love this", "jenniferarnise": "I wasn’t sure about buying your book. I’m a little older and thought it was only for y’all young girls...but I’m in chapter 7 and I’m completely sucked in and LOVE IT! I don’t want to give any spoilers out but I’m 45 and single and there are so many nuggets and perspectives I’ve taken away...it is so dam good. Well done Shan!!!💕", "mixedmatch": "I love this.", "nickshx": "Is this the dude who sprays herself with cum or smtg", "meronii.pepperonii": "@shanboody I’ve literally lost the book after highlighting and writing notes all over it 😭 buying another one just so I can finish 😂😂😂 you’ve got me hooked 💖", "mscookies876": "@s1p9s8n6 @d_nice735", "tatertotbot": "I would and have.", "angelikkdeville": "I would love to do this, but my ex and I don't communicate at all, so I doubt they'd be open to it.", "thejasminebperspective": "When do said “Thank you for the clarification” I felt that lol.", "fo_sho_energy_work": ". Damn. They put the EX in sEX? Lol. I wouldn’t ask a “ex” because to me that means they have been “X’ed” out. I would ask a past Lover because there is still Love there", "remedi68": "I tried with two of my ex's it didn't go over well.", "nessers_90xo": "You’re amazing!! 💕💕", "mariia.dogan": "My ex would tell me I’m bat shit crazy and during that period of my life... he wouldn’t be wrong 🙃", "kiwi_blu": "I always ask my ex’s what did i do wrong why didn’t it work? The can never tell me. It upsets me so much!!🤦🏾‍♀️🤷🏾‍♀️", "kimperper": "@mitchieadelle @omonsm", "kristiniris": "I wouldn’t but only because I don’t speak to any of them. I had to cut them all out of my life to protect myself and I won’t break a boundary that I’ve insisted they abide by themselves.", "nubianhueman": "🙋🏾‍♀️ did it! Gained excellent insight. It was very real, truthful, and respectful. Glad we have the post-relationship friendship we now have.", "kerriisms": "I resisted doing this at first, but I went through with the exercise and I’m so glad that I did. I learned even more about myself. Also helped to connect the dots with the self-summary workbook. 🙌🏾✨🤗", "shikeema1990": "I can’t wait to order this book tomorrow", "foreverambitiouspink": "🤔🤔🤔is there a way you can post the vid theres no sound on any of theirs😍", "georgialeatrice": "This is just brilliant! You are just brilliant!!!!! Thank you", "martha__lucia": "@shanboody As someone who is constantly working on themselves, I wouldn’t be scared to ask an ex for feedback. However, I’m so glad you added the comment about only asking an ex that was good to you whilst you were together because I think this is super important! This was the first thing that came to my mind when you made the suggestion & it made me question whether someone who wasn’t good to you could have any helpful insights. 🙌🏽", "drsharh": "I asked my ex while reading the book", "_msimmaculate": "What if all yo ex’s are trash tho?", "sabrina_smilez": "Girl I tried and it turns out he’s turned into someone I never thought he could be. He tried some stuff that was so disgusting, even my best friend was surprised 🤦🏽‍♀️", "i_c_cheekes": "Do you think this is a good exercise to do with my husband now??? @shanboody", "_afitz23": "I wish I would’ve asked this before I got married", "lovelyfoofie": "P", "ness.ess.ity": "I had to because I wanted to see if what I thought was my flaw was indeed it. IT WAS. I move too fast!", "starcomet_80": "There's too much to talk about with my own spouse than to go dig in the past. I think is also disrespectful to everyone's new spouses. Since things are better left alone.", "julesaujus": "So interesting! I like this idea but when it comes to my ex I wouldn’t want to hear it 😂", "10minutetalkshow": "Brilliance. #OnBrand", "vibe_with_nana": "I did it with my first real EX. He was really helpful and have me a lot of insight. The he asked me to do it for him. It's a meaningful exercise when both parties are open and honest and truly want to learn for the sake of self growth. ❤️❤️", "_nellysunshine": "This is why my ex and I are back together for the 3rd time. 😂 we've always wanted to see each other grow, but we didn't know how to communicate in ways that would deliver a positive interpretation. We want to help each other now LIKE a best friend would, yet also coming from the stand point of a lover. Life is just crazy and these days you'll never know where you'll get the right answer from. Open your heart- open your mind❤✌🏾", "kiara.lunaxo": "both my exes are abusers so i have no one to ask :( but this is really great advice", "nollibee_": "How would you go about if you have no relationship to base it from?", "batmanbambi": "Yup! So good! Did this exercise! 🙏🏼💕", "trice.ware": "@destany_not_destiny I think this a good question to ask one day ? Lol I wanna see what ppl from mobile think 😂🤔", "p.o.p._the_writer": "I like your brand and your tube.page Much success to you.🙏", "amanddarose": "With people I’ve dated not as seriously/long-term, but both my exes were so toxic I wouldn’t want to let them back into my life for the sake of an exercise 😅", "cosmic_isabella": "I think it does help, but long after the relationship has ended and there are no feelings involved with either party. Both can benefit from a mature conversation without fighting and can learn lots.", "lisa_wangui91": "I did, I asked he said as a mum I was an 11 as a wife I was a three, simply because I refused to continue being manipulated and controlled, and being smacked across my face every time I went out and got a Lil drank.", "tabiacharles": "I think it would be amazing if we could all get to a place to think about how we could have possibly done things differently/better to help out partners become better lovers to us. Of course every relationship is different and certain actions wouldn't necessarily have made ourselves or our partners better lovers but I think this is something we can and should think about because it can help us be better lovers in future relationships.", "estrellajrios": "I did w my ex ab our behaviors and it was sooo insightful!! 💚", "theblossominglotus_": "This was my favorite challenge in the book!", "sydthecreative": "Your ex knows you enough to be able to analyze your good and bad but from a lens that isnt completely biased or filtered. Love this!", "theperfectrunaways": "I’ve done this before, don’t get why it’s a problem, it’s like asking a old friend, ur old roommate they were with u, they knew you. What they say might not be 100% right but knowledge is power", "iamcocochanelle": "Yassss Shan!!!! Great advice!!! 💕💕💕💕", "motherinthewild": "All of this! 💯!!! This is why you’re leading the pack!", "curlyfitnalu": "Tried to, but it just didn't work out. He kept giving excuses about when & how to do it. I ended up doing the exercise with a close friend ...still eye opening 🤷🏾‍♀️", "alegrate_lavida": "My recent ex was supportive and uplifting. He would compliment and cheer me on in my triumphs, hold me when I things didn’t go so well and console me, he would also tell me when I was being an asshole. He actually called me passive aggressive, I didn’t know I was, until I did some self research and realized “oh yeah, I am.” While I thought he was great and supportive in many ways... he still cheated on me. So... is this someone I can ask???", "piinkliips_cici": "I wanted too but the way his new wife is set up 🤷🏾‍♀️🤷🏾‍♀️", "emilyjoslin": "This is useful stuff! 👍🏻", "mbinns__18": "Hell yeah I would 👏🏾👏🏾👏🏾 knowledge is power!! I wouldn’t wait until they were my ex to ask this either. I’m all about growth and my partner should/will be too!", "kendramichellenorman": "I’ve gone to a number of my exes and have had these conversations with them recently and honestly, I can’t imagine living without that feedback. It’s been a guiding force to my own healing and to my relationships that are playing out right now 🙌🏽", "stephscurls": "Def believe in this", "yaaduhh": "How often should you ask the people around you for an evaluation? @shanboody", "spunkscribbles": "I speak to most of ky exes amd trust and believe that they have told me about myself. Lol. I think that this is a great exercise because MOST people don't see the trauma that they have caused and it spills into future relationships. Sometimes it's YOU homie! #ScribblesApproved!", "babyazse.xo": "This is brilliant!! I LOVE IT", "dawn.of.a.new.day33": "I did this last year and it helped me grow tremendously! Everyone needs truthful honest feedback to grow. If no one tells you the truth about yourself then you will probably never work on those things. I have become this person for my family and friends. I’m always going to tell you the truth even if it hurts. I always try to say it in a constructive way. I want my friends and family to be the best versions of themselves so tell them what they need to improve on. This has created a safe space where they can also be truthful with me on my downfalls.", "kayy_blair": "Love this perspective", "derrexbrady": "👋👋👋", "warrior.cdv": "Yes I would. He was my lover and best friend for 10/25 years of my life and we basically grew up together. And we ended on a positive note, and we both knew we wanted to pursue our own individual growth so one way anyone can do is to evolve in the way they love another (or others). Sometimes we are so stuck to just loving ppl one way or the wrong way, and the best way to learn and grow how we can love others is by basically asking ourself or our past loved ones, how can I be better? How can I be a better lover or the best lover I can possibly?? Choices in the past teaches us life lessons.", "littlewookietaylor": "My ex reached out to me a while back because his long term relationship after me didn’t work out. We both had grown since our relationship and had some productive chats! I’d say we both benefited from talking about it!!", "_maddie_q": "I tried but he ghosted on me after we set the date and time to talk 🤷🏽‍♀️", "janellesymon_": "What if your ex doesn’t want to have contact with you and doesn’t reply ?", "brians.interlude": "🔥🔥🔥", "queennunniehairboutique": "You’re so freaking smart Shan. The book is 🔥🔥🔥🔥", "museofsorts.jpg": "I don’t know how, but this actually showed my ex how he fell short in our relationship. We reconciled a month ago and now are best friends.", "thelensishers": "Love this approach it’s great to get feedback so that both you and your ex can improve and become better versions of yourselves 👏 most people wouldn’t be open to this maybe because of how things ended but we all grow and after some time has passed we all mature and can engage in conversation!", "malanghiarts": "@tanvir_arafat17", "fiercelyfab1989": "Omggg I read this idea in your book last night on my flight back home and I was thinking \"omg what the heckkk would I even say? Who would I pick? Could I even work the courage? How would i articulate to him that this is in noooooo way a \"reach out connection\"???\" But I love how you described your reach out to \"Mark\" and showed your sample reach out email soooo I could get a blue print of what to say👌 I have yet to do it butttt I plan on doing so because this is going to be key🙌 to my growth in my struggles with relationships", "skinsobeautiful": "I love you❤️😍", "mylifeaslin": "This is not something he would be open to hearing but I would love his insight", "smooveoceanskai": "I feel like this can also work with your partner as well. To become more self aware. Not just with your exes.", "pedroaltagracia": "One of the best pieces of self improvement advice I’ve heard. Ever.", "openmind_openears31": "💯💯💯💯", "moniquebryan_co": "This is fabulous advice!", "am_plus": "I’ve been thinking about this for years. I’d say it’s a unique, possibly productive concept. Maybe possible depending how you left off with them in the relationship.", "shaniyapapaya": "I’m currently on this part of the book!", "__napturallycee": "It really does work. I went on a forgive me binge so to speak bc I realized just how crazy I treated my ex's. They weren't squeaky clean but they also weren't horrible and in those conversations I basically heard back that they understood my flaws and put up with me bc they knew how good of a person I actually was. That alone made me start trying to reconstruct myself bc if the ones who knew me intimately could see something that I obviously wasn't feeling/projecting, I needed to do so.", "melancholy_bebe": "Yass girl you killed that 👏❤️", "ericahilll\nVerified": "Verified", "queenkells718": "@a.geminiqueen21 ❤️", "lecwalexis": "I did this exercise and found it to be quite eye opening.", "iam.msjoi": "Yes you can .. I’ve spoken to my ex husband about things in our past and it’s helped us both in our current relationships . We are pretty much best friends and the discussion have helped us heal and grow", "tabbtavv": "I've done this before and everytime I talk about it, people think I'm crazy!!! Lol I'm so happy to see this is an actual thing! 🙌🙌🙌 freaking love this!", "mzbrittbrat15": "@shanboody Soo Girllllll .... i asked my ex ... the responses were blah and VERYYYY vague like (yes & no responses) I was kinda annoyed .... but in hindsight I probably shouldn’t have asked him even though it was my longest relationship 🙄🙄", "thetracymoore\nVerified": "Verified", "suhannacarvajal": "Agree 100% i have been fully open and honest but they take it the wrong way. Their lost.", "hilla_rhea": "It’s such a smart idea. Nobody knows you better, at least for a moment of time or romantically. If your ex’s hate you / vice versa it’s highly likely you’ve got something to learn. Like the book says you don’t want to be going back to anyone harmful or dangerous, but over all it’s a really excellent way to learn about your dating self and patters, flaws or habits.", "natthefitceo": "Loved how you added the disclaimer to reach out to someone who you know was good to you in the relationship (best interest)! Valuing that person’s opinion.", "geo_antoinette\nVerified": "Verified", "katelynnxnicole": "Of course. I always ask my exs what I did wrong. Because I’m no angel & I think it’s essential for growth. 🙏🏾", "ari___elle___": "I would. But my ex and I broke up over intimacy issues. Lack of intimacy/sex/initiation coming from him. He could ‘take or leave sex’ while I’m highly sexual. I’m not sure how that would go- might be triggering since it was our Achilles heel. Also, it’s still a fresh breakup >3 months. 💆🏽‍♀️", "lalathebeautiful": "This is everything! Now off to buy the book as I should. 😍🥰😘", "heytheresruby": "jesus your vocabulary just called me illiterate, I’m in love with the way you speak 😭", "lordelightskin_94": "I definitely would if I was single. However, my current partner already has told me time and time again that contact with a past ex isn’t it. But that actually is a great question because I feel that there’s been times (in my current relationship) that I was doing things that were issues in my past one. But because I never was aware, I feel I continue to do it and not even realize it. And it makes me want to know if this was always an issue, but once, current gf would never approve of that.", "ms.shanelleh": "Yessss girl yessss 👏🏾👏🏾👏🏾👏🏾♥️♥️♥️🙏🏾", "hellolondonash": "While reading the book I did this with 2 exes! One I dated before I had my son and one I dated after and it was very insightful! 🔥❤️ amazing work @shanboody !!", "dayoldkate": "I have ! I learned that I’m not affectionate enough for most people.", "glamgirljaayxo": "Honestly sometimes I wish I could ask this question but I swear like I’ve been with exes that I know I can’t ask this question because one they had low self-confidence and tried to make me feel that way too and also they were the ones that treated me horrible and tried to make me feel horrible as well just like they probably felt when I knew I wanted better for myself which wasn’t them.", "brandonmbolton": "🙌🙏", "lilsisvee": "I don’t think I would. Everybody is different. What didn’t work for me may be the key to someone else. Just because I didn’t like it doesn’t mean someone else wouldn’t love it 🤷🏾‍♀️", "domvharris": "Ummm. Million dollar question. What if you don’t have an ex? Who would be the next best person to ask?", "amalie.have\nVerified": "Verified", "prettyyellotone": "@tward04", "lovejoysimi": "I want to say thank you so much for this post. I really had a hard time explaining this to my cousin. And this is spot on", "_patriciadlrr": "I did and he aint text back, now what lmao. Jk i kept reading the book anyways. 😌", "issatrae": "I’m not to this level of real ness yet but I love this approach honestly", "tiffanykorymay78": "Nope...because I hate my soon to be ex-husband 🙄 2 more months till I am FREE!!", "caitlinjsharp": "Just ordered your book and can’t WAIT to read, evaluate and grow from it.😍", "carmiaray": "How do you choose the right Ex to talk to? I'm not sure any of mine would be good for this.. I'm actually in a relationship but still interested in what I can learn from this book... Are these questions you could/should ask someone you are currently in a long term relationship with?", "thebirdspapaya\nVerified": "Verified", "stullysia": "You are a Queen♥️", "thelastdyingbreed": "Thank you!!!", "brenttany": "This is everything I’ve considered doing this and now it’s confirmation that its nothing wrong with getting insight", "justinwwaldrop": "You kicked ass!", "rashida.ayanna": "I literally just went through it🙈🥺realizing my fear based destructive pattern.. had to put your book on my wish list for my birthday!", "lightskin_pose": "This is growth! When you want better for yourself you will go the extra mile. You have to know what you did wrong in the last relationship so you can be a better partner and ultimately a better person! 💙🔥", "antonio_king32": "Amazing and informative as always! 🔥🔥", "yourfavlittlebeing": "great idea—if the breakup was mutual. you’ll have a better understanding if the responses & feedback are coming from the ex in a place of maturity & honesty, or anger & pettiness/spite.", "c_how_md": "Great post! I would ask an EX but unfortunately there are some exes who carry the mentality that just because it is over, you all now have to be enemies. It’s an unfortunate mentality because I believe (for the most part) we are all trying to grow and figure it out. This could be an opportunity for growth from someone who has seen you in a space that your friends or mom may not. Valuable information there", "depthgod": "Yess🔥🙌🏽", "justjadealexis": "Yep I did this and it was very eye opening! Not that he told me anything that I didn’t know already lol but it helped put things into perspective.", "courtmoves": "This shit works. 🔥❤️", "tyler.matthew_": "I want to....I probably should ....", "cassandraaavila": "You are amazing 🌟", "raven.shanelle": "Go Shan Go !!! Your right where you belong !", "taysaidit": "Can you share the link to @alain_de_botton Video? I would love to watch more", "noheatups": "@patwhalen she wrote the book I was telling you about.", "k.ruja": "Yes yes and more yes", "thetrapwitch": "Me and my ex husband went over our failures as best friends so we could both move forth. If that person is open it is life changing. Wasn’t my husband no more, but was still my dawg and helped in my healing once I cared about it too! It might not be immediate either. It took two years after divorcing to get to that point, but so worth it. My future has my past to thank and also myself 💙🔥", "coach.carey": "Wow wow wow !!! I am so happy you shared your message and passion ❤️🏆🏆🏆🙏🙏🙏❤️❤️❤️", "keishaannram": "Yes! I did this exercise. It was eye opening. I also wanted to tell my exes about themselves but sadly, that wasn't the assignment 😂", "cozygirlpdx": "I love this", "heyitzsarai": "This is awesome. I’ve tried doing this and it ended up just becoming a mess but I do think it can help though Lolol", "jaypercytheartist": "ADB is my man 👏👏👏", "travismorrisss": "YOU OWN AND WERK GIRL!! 😍💕💖🥳👏👏", "oobeeliix": "wearing the vesper 😻", "jaci.nikki": "@only1.ash_", "mayasworld\nVerified": "Verified", "breejustbree": "I love this!!!", "lovu.ca": "I love this man!😁"}