{"reese.levy": "Shan life is to be lived. Stop it gyal and have fun! People are fun and we don’t have time to be on this earth trying to figure out who’s who....cultivating and accessing everything. That’s fo much. Life is too short. Forming a healthy view of relationships is key. You know this. I think we all should hang out with kids more often because they are the true relationship builders. That can still be us but more of an evolved person. You lost a little of that. But I am going based off your responses. That sense of freedom and trust. We have to offer it to get it. You miss out trying to access. I don’t think everyone coming your way should be your “friend” but you miss out on experiences. People are going to play themselves out regardless and people are going to stay in your life...regardless. Like just now. we are here.. you and me...for whatever reason. 😎 live it up kiddo!", "bigreek_89": "I agree to a certain extent because if you have ever moved away from your family and friends you need somebody nobody can go thru life alone idc what anyone says. It’s get lonely by yourself and can cause depression and anxiety.", "chris_prelations": "Would love to see if you’re available for an interview soon for a black Inspirational Spotlight", "poca.hontess": "If I don’t feel instant fireworks 🤷🏽‍♀️ ✂️", "ms_im_unique": "All my meaningful friendships happen naturally. I agree if someone rushes to make room for me that is a red flag to run the other way.", "canadaii0": "I feel like this comes from a place of such priviledge though... like what about for those of us who have no friends?? 😂😂", "soulspite": "@teganbarg", "blue_intentions": "It isn’t about time, it’s about a connection - energy", "_lindsaytompkins": "I think it totally depends. My best friendships are slow friends. And my disastrous relationships were fast ones. Until now. We knew about each other for a while through a mutual friend but when we met it clicked. And I had to be vulnerable enough to actually give into the feelings I was having. We moved in after 4 months because even though we didn’t feel it was fast I had to ask myself “fast according to who” it was not fast according to ME so I had to trust my own self. I also know I can exit a relationship or friendship without it being dramatic as a part of the inner healing of my childhood trauma I have done. I trust my instincts and then I analyze as I go, unafraid to be wrong. And don’t put expectations on things. Me and my guy are still together and getting married after all that time. I think knowing others really comes from knowing yourself.", "veronicacosmo": "I agree . People are weird af.", "nadiadallee": "🙏🏽🙏🏽🙏🏽", "poseidon224": "Riding on the coat tails of several comments, I believe it’s a culmination of things; Chemistry, were you are emotionally in life, and the consistent vibe of a person. Mind you I’m sure there are more intricacies at work. None the less, how you meet someone and where you are when you meet someone has a lot to with how a relationship grows. Whether it’s grows like mint or an apple tree is more or less based on those factors.", "king.kaylee": "I 1000% agree with this. I ended up being roommates with someone that I got close to really fast or we grew close as “friends” and it was faster than I expected but I thought we just had a lot in common as far as the way we see and process things. Now we are no longer friends, i don’t know what happened but all of a sudden she changed on me and blames me but I’m very happy that we aren’t friends anymore. It felt too fast, too surreal, and I felt used a lot (emotionally & mentally) and then thrown to the side. I noticed a LOT of things about her but I’m so loyal and supportive that I tried to continue being nice and then I ended up being kicked to the curb for no good reason. But like I said I’m glad things have changed but I apologize to myself for not trusting myself and my intuition about us being roommates, getting close, and letting her use me as an emotional punching bag", "noori_artista": "I think both can crash and burn based on the combination of whom we and they are as people. I tend to make friends fast but I also wait for the other shoe to drop. If it doesn’t then it turns into long-term. If drama and red flags pop up then I know those people aren’t ready for whatever it is I’m looking for. Which is fine too, and in the process, the thing I love is that we end up sharing precious and vulnerable moments. I’m not a guarded person but I also recognize and observe patterns. 💕", "mivacarper": "I second your comment.. When I met new people and I felt the click, I have no hesitation to start bonding a friendship, i can be closed friends just like that. Little that I know at that time not everyone are meant to be your friend. For the past 6years, I have always been the person who loves to arrange a get together, plan birthday suprises. It was all enchanting until as of 2019 I stopped doing that and then I realized that those who I so called friends (fast friends) fall appart one by one. Now I have 2 of male buddies who I have known them for almost 5years and I am forever grateful for them❤️🙏", "lovinglyfe_22": "Forced friendships are huge red flags! I’m a very private person and protective of the energy I allow myself to receive. I have boundaries. I love organic friendships. Why force it??? I typically run to the hills when I feel forced.", "khatydid_whaaa": "Someone trying to move fast is a huge flag for me but I’ve noticed in certain instances it was “but this feels so right or feels so good” that I went ahead w| it anyway! I learned a lesson, have no regrets but won’t do it again.", "ishtar_333": "I adore you @shanboody ❤️💋🔥", "the.morganproject": "@carly_macz @esaah_ny", "ojuforfashion": "Yeeep ! Anything too fast when I was young fizzled or turned out to be partners with a lack of boundaries /esteem ..mine was low too but not anymore !", "theycallmemisterpig": "@bails_of_hay11", "mother.soulwriter": "@miss_inezt we dating 😄😄😄😄", "jamiepavs": "This is very interesting! I totally agree until I met my current best friend, it was a connection like no other and I’ve never experienced such a strong bond with someone. She holds space for me, is supportive and kind and my cynical ass never thought a relationship could build like this, this fast. 🔥🔥🔥", "styled_bycarolina": "SAME SAME SAME", "glow_mobb": "I’m a bit guarded now. Fast friends in the past have turned out to be bad situations for me. I’m actually taking a break from meeting new people in any way and just working on myself.", "gennyfk": "I have a wildly accurate intuition and I'm mad judgy. I will figure out if you're someone I want in my life within our first encounter and so far I have never been wrong. I have super super deep friendships and romances and somehow always know when I connect with someone. And I put my friends and romantic partners first in my life priorities. It has never been to fill a void, and has always led to long lasting, deep connections", "teamtysha": "Nope. Same. I’m protective of my space, peace and energy", "msjrfoxx": "@shanboody I have found that we as people confuse someone who we may find easy to talk to and have strong similarities to us as a “ fast friend”. Instead, I think thats ease and similarity allows for a more pleasant journey to a friendship❤️", "briabribre": "@shanboody what is a full life to you and could you give a few examples? I believe I have been or am this person that put that pressure on relationships of any kind. I guess with referring to a romantic relationship it depends on the person and your needs from the person who you want to connect with but idk. Also why is there a negative connotation attached to high maintenance friendships vs a positive with a person you are sleeping with or in a romantic relationship with? Like it comes off as anyone who hasn't taken that path with a person is seen as not having a life until you have your everyday person you can bare your inner self with. Great conversation topic and I like your transparency no room for confusion!", "its_pronounced_danye": "I completely understand where you’re coming from. I have had a lot of fast friendships/relationships crash and burn. But I have also had a couple that were genuine and have lasted to this day. I guess I’m the end I would say follow your gut. Looking back, the friendships that ended involved people that I would see red flags, but ignore them due to our quick connection. Now if I see those flags or feel uneasy, I take a step back and observe for a bit. I also pay close attention to how they treat others bc most likely that’s how they’re eventually going to treat me. Anyways Love you Shan❤️❤️❤️❤️", "mamamarie2011": "@shanboody TRUTH! Had to learn this the hard way.", "back_country_trail_work": "Killd it on the ologies podcast. Respect.", "thedreamgenie": "I used to be like that, but there are just certain people you meet that you just gravitate to naturally. Some may be seasonal, but in the midst you may stumble upon life long friends who are more like family. I learned that time does not determine genuine bonds and if you allow yourself to be open you may end up meeting some of the greatest people. Sometimes people have a habit of holding on to the wrong people because of time. There’s comfort and security in time, but holding onto friendships that don’t fulfill you for the sake of time hinders you from meeting those who are destined to help elevate you. You’ll even meet people who are there for you more than family. I’ve learned to still have discernment when meeting new people, but also be open because genuine people that you instantly connect to do exist.", "kriisalyse": "This! My strongest friendships happened over time. For me, CAUTION immediately pops up when someone is pushing for us to categorize a moment that may be singular into “now we’re friends!”. I think there is nothing wrong with thinking of new friendships in the same way as dating.", "macreadies": "@jess_med", "atoyaburleson": "I’m an energy girl....it says a lot about a lot.", "queenchewbacca": "One thing I have learned about fast friends is that there really is no way you can know who that person is. And when things get serious they may show themself to be someone you don't like.", "reignfreeafrica": "I think it's all about energies. You can have friends for years that you cant have that same energy with vs. Some you just met. But I'm not one to talk, I'm a tough cookie to crack..always on guard 😆😆", "deaconrobertbennett5465": "I don't", "supriya_roy_aus": "Sometimes there is caution for just having this thought about new people in your life.. its about maintaining the right boundaries for myself. And as far as others go, they either fit in or they dont right now... either there is flow or there isnt... slowly the attraction balances itself out.", "deearebee": "@kangchante she gets me. us. it.", "twiza23": "I think it depends on your life experiences and it’s just a personal thing. I met one of my best friends and we instantly hung out and clicked but there’ve also been some fast friendships that haven’t worked out. I can see how experiencing that would put someone off..", "lovemebellablonde": "Sometimes you just click with someone. I used to be that way, but good vibes are good vibes. Until you show me different, I will accept you. I’m a pretty good judge of when to invest and when to pull out! There’s enough love for everyone!🙏🏾", "_brittstagram": "This is so me", "itstttina": "if it feels good , let it happen. sometimes you meet people who are just meant for you and it clicks . just like sometimes you fall out of touch with people you’ve known for ages. ✨", "moreforme_": "Ufffff this so on point", "c.champagne.c": "I think it’s important to communicate. People allow fear to bind them to situations. It’s uncomfortable to be honest at times, but it’s so crucial to your wellbeing. I personally don’t like to feel rushed into anything, but I do believe that connections can quickly manifest w/o you being able to “control” it. And in those moments, because I truly care about maintaining that connection, I’m completely honest as to the time and energy that I’m able to invest. And I leave it as an open discussion so my partner feels safe expressing their feelings about my boundaries. So to answer your question...I don’t necessarily always focus on the pace but more-so the connection itself. Sometimes you gotta grab ahold of those special people that magically pop up in your life and make moves, even if they’re baby steps. ❤️ I love what you do! Education and open discussion is 🔑. #yourock", "dann0activist": "@shanboody So true its like everyone is so quick to do things its like they'll jump headfirst into a furnace. I dont necessarily think its because people are not to be trusted even though a few times it is however, I think its more to do with the anxieties within people to conform to having a relationship status in todays society especially people in their twenties. I could be wrong but its just a thought.", "islandspice26": "I feel the same way but i figured im just a weirdo 🙄 lol", "shanterrialmusic": "For me it’s all about Energy! And if y’all become friends organically I don’t see the problem. I think we have to realize that just like the seasons change, so does the people in our life, and it’s ok. It actually hurt me that the friendship I took my time on, didn’t last. I was trying to make them work but the season was just up.", "thekelloway": "Totally disagree. Love fast friends. When you know you know. ✨ Some of my best friends I met and clicked and instantly became meaningful relationships in my life. Waiting a year is a long time!! Life is short. You could be gone tomorrow. Love fast and hard and often. 💜", "vivekshraya": "Same", "sherelleharmony": "As ive gotten older, i 100% agree with this", "wazermelon": "I agree 1000%, it gives time to see true colors and know if you guys can tolerate and work on characteristics or behaviors you dont like in that relationship, everyone always seems okay/cool when they are feeling okay, but how are they with handling other emotions", "imsmitn": "You need time to get to know people. See them through a few seasons or see real life demonstrations of their character before I consider them a true friend. There's a difference between knowing things about someone and knowing someone.", "milenacucu": "When I meet someone interesting I usually dont make space for them but I include them into the things I do anyway like sports or studying. That way I dont feel like Im forcing anything", "drjulissa": "Brilliance, Divine Soul~ 🙏🙌", "leslie.marisha.11": "I agree 100%! I’m a single mother to three special needs kids and I don’t have time to be building bonds with every new person I meet. Moreso because I really care about the people I love and the ones that I get close with end up staying around for the long haul. Ain’t nobody got time for that 😂 My very small circle of friends have been around since school.", "scaredpencil": "I had a coworker that would make fast friendships and the problem I saw with her is that she didn't develop the trust part. So she'd rush into friendships and then the first signs of trouble she was assuming the worst about these friends and like accuse them of damn near sabotage. Her problem is she likes to talk about herself a lot and so each new person was a new opportunity to just pour her whole emotional life onto them. As far as pace, I feel like pace differs. Some people take a minute to open up and I respect that, some a little quicker and I respect that too. But you have to feel it out. If someone is like really forcing that kind of like, I don't know like, emotional friend intimacy, then I know it may be because they are going off their own needs versus like just forming friendship bonds.", "levelsofsanity": "Well said. It’s more than the Scorpio ♏️ in me. It’s calm down and feel the vibe first.", "themahaliap": "This.", "l19ssa": "Me neither", "deniseheckenlively": "I you think you can hit it off with someone right away and others take a little longer to get to know. I think that you can find a balance. I think that maybe after knowing somebody for several months you get an idea of whether you have things in common or not whether they're genuine or not I really think as in all relationships you do have to watch out for red flags but I also believe in just following the natural progression of a relationship not being guarded but just following how you feel at that point in the friendship.", "nicknamelulu": "This is the real !!!", "shainaaaaaaaa": "1000% agree💯💯💯", "tatertot522": "I agree with taking it slow but yeah a year is a while 😂", "superblakc": "That was astronomically profound", "beyoutiful_irie": "While i am not quick to call someone friend there have been exceptions for those whos energy was high enough to match my frequency. This past season I have met two people like this but mind you it has only been two people in the last 10+ years. I am very particular about exchanging energy with people on a consistent basis and a great conversation/encounter or a few great conversations/encounters are not enough to make me call someone my friend.", "jaydaalfarooqi": "I was thinking this yesterday 😁😍🙏💜", "1.oh.8": "@jeneferena", "mishalmoore": "Spoken like a true fire sign. Yea, I’m not with that shit. @meghantonjes knows how slow moving I like my friendships to develop🤣", "sheendabeen": "I feel like if you talk to somepne and instantly feel a connection then there's nothing wrong with that, sometimes you just fit with someone, yanno. But of course building a certain amount of trust takes tine", "intuitivewordz": "Some ppl just click and the vibe is there. When that happens i run with it as it doesn't happen often", "the.life.alchemist": "Pretty much all of my friends I immediately clicked with and have been growing with for years 💜 very supportive and high-vibe friendships as well. When you know, you know! ¯\\_(ツ)_/ ¯", "paarisss_": "My partner and I became best friends in literally one night, didn’t start dating until 3 months later but we spent SO much time together just hanging out as friends and I felt our bond straight away. I agree to an extent with what you said as most of my friendships that have started quickly, ended the same way BUT sometimes, you just know they’re meant to be in your life and it feels extremely natural to become close to them without a lot of foreplay if you will", "bunnywarfare": "Maybe I'm just a good at judging people, but my fast bonds have been the strongest and longest lasting. In romantic relationships and in platonic ones. If takes me too long, it's because there isn't anything there. But everybody has to do what makes them feel comfortable.", "coolintentions": "“Began with need” girllll you are in my head ! So on point!", "nikkiblanco.jpg": "Everyone doesn’t have an agenda... 🤷‍♀️ some people really are just kind and open to new connections. Vibe says a lot though, and I just go with my gut.", "aphriite": "It makes me anxious because fast friendships don't usually last but I'm learning", "s_jackson8": "#facts", "venustierraa": "@adilenelopezz", "alexandriaashcroft": "I think you can have a connection with a friend, but it's anyways time that tells you if they're worth building with. Just like a love relationship. ❤️", "bigbootjesusdechristo": "Those are traumas that are specific to you and the generation that you belong to.", "butterjujunut": "People always get on me for not being \"super friendly\" with new people at my job and I always say this. I don't like people who can just be best friends/fast friends with you two seconds after you meet them. Like what is that? I 👏🏾 don't👏🏾 know 👏🏾you...", "ltg720": "YES", "kamensah": "@shanboody I don't think there's such a thing as too fast or too slow when it comes to building a friendship. People usually know when it feels right (or wrong) then they will make necessary adjustments. Good topic!", "amandas_healthy_soul": "I don't do fast friends. There are people who I instantly vibe with, and know they will be important in my life, but I still take my time. If the Universe predestined our friendship, then it's not going anywhere. My energy and time are valuable. I like to take it slow.", "arundhati_12": "Some of my closest friends today started off as fast friends. In regards to that, I don't think the length of my relationship with someone matters so much as how they make me feel and what I can discern their intentions to be. I've always been able to decipher whether someone will be good for me or not, so I trust me judgement. That being said, I also don't divulge intimate details with anyone unless I know there's consistency within the relationship. Overall, I think fast friends are fine and can really allow for great memories and even better bonds if circumstances allow for it.", "deneemoe": "I've never actually put this into words but it's exactly how I feel. The people closest to me happened over time. Sometimes you don't even know when it happens... you look up one day and realize how much you love a person because you allowed time to form a strong bond... nothing forced.", "moonymik": "if the energy is possitive mutual and consistent why complicate with predetermined timelines?", "noyouarethat": "I do believe in immediate chemistry that propels the drive to grow a friendship. And sometimes my friends of one year feel like I have known them forever. But those connections are special and definitely not common imo", "chrissy_universe": "Yassss💜", "itsmemissnikki": "Been saying, love bombing doesn’t just come from someone trying to Boo-up!", "melody.nieves": "Very worrying. Especially when those same people draw up a list of expectations they already have you ready to fulfill with no intentions of reciprocation. I love my solitude but boy does that piss people off and I take notice when they can’t respect that. It’s perfectly fine to go at your pace.", "kashmadame54": "Actually I see where you are coming from. Sounds like people who are opportunists to me.", "musicali22": "I don't understand fast friends, not legit to me......is", "thearzoyusuf": "Totally same! I get really nervous when someone wants to be my best friend after 3 months...I immediately think...what do they want? And usually my gut is right.", "leegraylove": "OKAY! 👏👏👏👏👏👏👏👏👏👏", "latisha.carr": "Yeah, no thanks. Foundation is needed", "marionlynnt": "@assicmr", "jayneallenwrites": "A little too guarded luv. Some people are capable of creating a space and holding that space for new people because of personal work. Vulnerability needs to be met with vulnerability. Sometimes you have to honor special new connections and trust them that they are real ❤️ Friends fill voids (that is how space is filled in nature) and fast friendships can grow and evolve just like slow ones.", "_nellysunshine": "I'm not certain what a fast friendship really is🤔 I go with the flow I guess... see if we can hangout at the mall, get lunch, if we communicate well. I wouldn't invite someone out/ go out if I didn't feel some type of bonding layer.", "fullnamecola": "Makes a whole lotta sense to me", "bruleegirl": "Sometimes friendships click and last a lifetime and there are times friendship take a while to grow. A quick friend can be a savior and a old friend can forsake you. The opposite also applies. In my opinion people should just enjoy the friendship at the time and place.", "gjpmedia": "Facts!!! 💯", "_trinitymonet_": "@talal_ayyash 👀", "yuungweirdo": "When you said \"it makes me weary that they're trying to fill a void vs. Find a friend\" SHIT U HIT MY HEART WITH THAT >>>>", "shanellkierra": "I agree with this and have always felt this way. Part of it comes from watching people lose those fast friendships left and right because they didn’t take time to get to know who the person really is. You have to make time for the true colors to actually appear.", "ash_bash616": "@shanboody I’m much like you. I think it’s takes take to form worthwhile bonds. Anyone who from day one wants to be BFFs I find very alarming but maybe there’s something to fast friends cause I have been struggling with my friendships or lack there of lately. Feel like I can’t find my tribe 😥", "sochelee": "Factz", "choose_joylove": "I agree. I feel like some people forego getting to know people over a period of time and want to know everything upfront. It feels rush, rush.", "danikeystone": "Yes", "ceceglitternglam": "This isn’t black and white some people you meet and you bond. But for the most part yes. I don’t allow people in my space", "tiffanylaibhen": "Yes yes yes!!!!!", "chenechristinecoaching": "I agree! Slow paced", "glographics\nVerified": "Verified", "_ketu": "thinking about it most of my friendships are fast formed. I can feel something that clicks immediately and just go with my gut feeling", "jthesap": "I traded phones with a girl I knew a week 🤡(Meaning we went through each others phone)", "hollie_mve": "SAY 🙌🏼 IT 🙌🏼 AGAIN 🙌🏼", "spirituallyamber": "So true! 😩", "naledinova": "I go with the energy of the other person! I have very quickly formed solid friendships that lasted years. I’ve also taken my time to get to know people and build from there slowly. the latter has been more of my experience since living in LA and being an adult outside of college. I think genuine adult friendships naturally take more effort and time to form. Ppl are busy, they may have families, trying to keep their lives together, etc. nobody has time for a needy, insecure, draining friend, so I think it’s better to be slow and build a foundation as opposed to a friendship that may be built off of convenience or superficial things. ✨", "christinamroy": "Every best friend I have (its a tier, not a person) I knew the moment I met them I wanted to keep them. I just felt a connection. But with each of those relationships we also did the work and invested in it. Versus other people I met who I just kind of got a high from and inevitably those relationships never lasted.", "paris_humphrey": "@tonilodge oop-", "ohyesitsv": "I think I might be too slow. In fact, so slow that people interested in being my friend may think that I’m not interested in being theirs and end up fading away. It’s happened a few times so I figure it wasn’t “meant to be”. Also as an introvert, I’m very interested in people but I need my space so it takes even longer. 😩 But once I consider someone a friend I’m loyal and steadfast.", "cianadoll": "Me. I side eye you. I want to know you long/well enough to see how you move with your other friends too.", "lauryntvylor": "I think sometime you meet people and you just click", "nieceanderson_": "I was recently love bombed so this really spoke to me 🙏🏿 I will def be more vigilant in the future", "renimaaa_": "exceptions can & should be made based on the specific person. but i feel this...", "breannalucy": "I think it depends on the motive, sometimes I genuinely just *click* with people quickly and we become fast friends. But those are often aided my things like working together or having friends in common. They won’t necessarily be the most lasting friendships, but they’re still great while you’re in them ☺️", "ugottahave___whit": "I’m with you on the quick friendships/relationships. Those are often surface level relationships that only one person ends up fighting for in most cases....they often leave as quick as they came.", "the_brisbane_blonde": "@leannegerich What we were talking about!!", "alexandrianowhere": "That is the Truth", "blackwithplants": "@thatschelsea, does this resonate with you?", "michellengome": "I believe there is a difference among networking, colleagues and friends. There's level to this and it takes a lot to enter my core group of friends. Theres people I see on a weekly basis because of our networking relationship but there is no vulnerability. Its merely surface yet valuable. Value comes in many forms just make sure its authentic and reciprocated. 😉", "yungbabyhair": "I 10000% agree. I dont like temporary and frivolous friendships or relationships. I feel deeply and I value genuine bonds. It takes me a while to get there and bothers me when people try to rush me into trusting them.", "happyycathy": "Well said Shan! 😍 I like this perspective and will keep this in mind. PS I can’t believe you know @geo_antoinette ! Some of my favourite YouTubers here..I look up to both you ladies 💗", "antoinara": "For me it‘s about what connects us. Is it a void we both fill, are we „friends“ bc we socially benefit off of it or is it just boredom? I think the best friendships are the ones where you always know each other and what connects you is knowing the other at the core. That’s just naturally something that takes time, but sometimes it happens fast other times you‘ll never really get to it.", "tdodart": "Ahh, how I love you. Thank you!", "rachelleguitian": "I used to like fast friendships, but now I see that as a red flag for “too much too soon.” I now prefer to share a little bit at a time and have learned that is the best way for my friendships to build trust and intimacy.", "toniromiti\nVerified": "Verified", "cremedelaarose": "Agreed! But this would be different than organically having chemistry with someone and hitting it off well, correct? 🤔", "lifeofwins": "I agree with this 100% gotta protect your energy and essence. Some ppl just want to be near you because they can see how to win of you in an ingenious way.", "diving_in_stilettos_first": "👏👏👏👏👏👏👏👏👏👏👏", "push_success": "Make a video about this Shan 😊😊Pleaaaaase🙏🏾🙏🏾🙏🏾", "gethookedonbundles": "I've been told I move to slow with people. But you gotta get to know who your inviting into your life. And that doesn't happen over night💯", "kcasweet84": "Fast friendships can be just as bad as fast relationships for people with big hearts and people who trust too easily. In this world organic exploration is VITAL.", "herbrilliancy": "@shanboody I have noticed this trend as well with most things fast. They usually end just as quickly as they start. Things in life are a process and moving too quickly around or through them can certainly cause you to miss some things. I do also believe that there are more enlightened beings around us with the perception, high EQ, insight and intuition to be be able to quickly discern and assess within a relationship to identify its validity.", "carongaby": "Im not sure I agree. I've built some strong friendships quite quickly based on shared experiences. I don't think that time is a factor in how deep a friendship is or can be. Personally, I find it difficult to build a bond with those who are wary or not open to forming new friendships.", "__foxbell": "Agreed .. I feel like my energy is mine. I feel as if there’s a motive when it’s way tew fast it feels dragged almost . Like a reach if even . Letting it flow is way more special", "aquamoonbxtch": "🎯🎯🎯🎯🎯🎯💯💯🙌🏽🙌🏽🙌🏽🙌🏽 I have no best friends. Not even friends really. I’ve never felt that genuine, sincere, resonating comfortable feeling with ANYBODY enough to even give them a “friend” title. I feel MOST ppl are “friends” with others for the wrong reasons 🤷🏾‍♀️ my supervisor have me hope and said she met her BEST FRIEND when she was 37 and it’s been nothing but love and support ever since 🙌🏽🙌🏽", "__ashabriana": "Whewwww! I felt every word of this!", "_mmqez": "This is such a scary question bc now i feel like all my friendships were based to fill a void, but is that wrong to do ?", "lea.zen.923": "I totally agree!", "officialavelez": "not sure. i’ve learned someone you met recently may have better intentions for you than someone you’ve known awhile.", "idreamofcindy": "I like fast friendships/relationships. Slow ones are typically because we're trying to force a relationship or I'm constantly avoiding due to feeling uneasy or lacking a connection. Fast relationships feel more natural, as we've made a genuine connection that doesn't have to be forced. If a problem arises, there's nothing wrong with creating a distance and setting boundaries. Life is much too short.", "jcordero912": "I think as adults we definitely need to start separating our \"party\" friends and \"close\" friends this has helped me established which friends are close and which are for convenience so I dont get my hopes up.", "nad8211": "I tend to slow the process down when I meet people who seem too keen to be BFFs when we have only known each other for a few weeks or a few months. Like fast food, I think fast friends can be unhealthy. That said, it doesn't mean I don't try to get to know people I find interesting. I actually also look for opportunities to hang out with them in different contexts and the frequency will vary depending on who I'm connecting with. Beyond that, given that all my previous romantic relationships started as good friendships (the concept of dates to find a partner is still a mystery to me), it's something I pay a lot of attention to. I also enjoy doing things on my own so I don't feel I need to rely on others too much.✌🏾✨", "marvelousxe_": "I sort of agree...Some people you meet, you know you knew in another life and you are just picking up where you left off.🖤🥰 I am an #empath and my body knows who I like when I meet them IMMEDIATELY. 😎😎And I'm rarely wrong. however there are people who don't take 'no' for an answer and those are the Yolanda Saldívars. (The lady who killed Selena) BE CAREFUL! Know thy self. If your judgement isn't finely tunes yet or you are uncomfortable, hit the brakes on fast friends. 😋😋😋😋", "natural.ree": "Gosh, this is a word. You just connected a million dots in my head for me. I'm so glad I followed you!! Great posts, insights, and questions!!!", "coach.carey": "The realest ❤️🙏", "pip24d": "I think we found what your next book should be about. Your first was amazing, I laughed, I cried and learned more about relationships even though I’m married. I’m excited to see what comes from you in the future. I wish you the best in everything. I remember watching you on YouTube when you first started and loving your personality and rawness", "tykergiselle": "I didn't have this approach before but after being burned a couple times I have this new found respect for myself with regards to fast friendships. Not jumping in too quickly, trusting my intuition and using the word friend VERY carefully. 🇹🇹", "erin_docking": "I agree with this sentiment. I used to feel so special when people wanted to be my friend right away, but any friendship that started that way ended because I could never be who they needed and rather than appreciate me for who I was they would get mad at me for not fulfilling their needs.", "ibrevilfit": "I’m really feeling this post @shanboody. This definitely hit home. It has me thinking on my own actions and expectations when it comes to relationships and friendships. Thanks for this!✊🏿🔥", "tiaraleatrice": "I'm not a fan either. When a friend tries to latch onto me quickly I'm very skeptical of it and my pace is much slower than theirs. But like a few weeks later drama and problems within this person always seem to show itself. And I'm like okay let's bounce. They don't like that but I don't like drama unless it's on TV 🤷🏽‍♀️", "fullcourtpumps\nVerified": "Verified", "sierracjohnsn": "Facts", "thebedstuyboheme": "I run from them. My avoidant attachment style hates them.", "arithehealer": "I wholeheartedly agree with this and why I seem to struggle to find deep meaningful friendships. People just wanna party it up and take that connection as being “friends” and that’s not how I roll. I need to be with you one on one many times , in sacred spaces to consider someone a friend. I am too a slow friend maker and that’s how I decide who is my friend and who just wants me around 🤷🏻‍♀️🌻", "istrapnheels314": "I dont know. My best friend and I clicked and we meet on POF. It took us a month before we met in person, but once we did it was like Ive known you my whole life kind of connection. Ten years later and two relationships later we are still very close. We moved into a more intimate relationship after all that time and now we are engaged. So idk depends on the person.", "_dinayvette": "fast friends are great for a good time but not a long time", "yhnnss": "YES, I agree", "notnataliya": "💯", "homemaking_and_healing": "I can read people very quickly, so for me fast friendships aren't a problem. I generally know from the beginning what someone's intentions are. Also I think all friendships are meant to fill a void in some way. The question is, is it a healthy void? For example- I want someone to share my motherhood experience with (other than my husband who isnt a woman) so we can support each other, vs I need someone to constantly validate that I'm a good mother and be there any time I want to talk about myself.", "indialindsey": "All of my friendships that happened quickly, ended quickly. They were more so fans than friends and it showed when we fell out. It always ended nasty and not in a way a friend would part ways.", "long_natural_nails": "I agree", "cancerascendant": "You’re speaking to my soul with this! I’m extremely slow moving with all of my relationships, it’s important to spend time getting to know the core of a person and that takes months and years, not days and weeks.", "_jazmynanderson": "I’m a huge believer in this; I didn’t want to think so at first but especially with friends, I’m VERY guarded with friendship, I’ve only had one real best friend that was mine only up until recently as my friend circle changed. I always felt like the friend coming into the circle, not being the “original” so I feel like I’ve intentionally needed to take time to be friends with people. When it comes to relationship, this is a non negotiable; people are shook me and my fiancé have been together so long it’s because we’re friends first!!! That is what made our foundation so strong.", "lavie.josie": "I'm friends with everyone fairly quickly, mostly because I'm a friendly person. Also, I'm a mom- so friendships with kids are pretty quick and we kinda have to build our village- especially if we dont have much family. 🤷🏾‍♀️", "lanecia174": "@shanboody honey this is a repost!!!!! 👏👏👏👏👏👏", "meg_n_kas": "❤️❤️❤️❤️", "brittanythehost": "I have made instant connections with ppl and over time our bond grew. I never put too much pressure on making them anything but just stay in the moment and go moment to moment. But because I’m a solid person, I attract solid ppl and can weed out ppl who mean me no good easily. So I don’t put a time limit, I just let things happen naturally with no pressure and live my life accordingly.", "miajvana": "Amen sis.", "i_amart": "I honestly hear you but at the same time disagree to an extent. I feel like intimate relationships (rather open or exclusive) compared to friendship building carries a different kind of weight and energy feel to it. The intent behind both are different despite that some friendships can turn intimate or loving. It’s the same concept to me with going into a relationship thinking everyone is out to hurt you or want something from you. So we closed them off. So there you go putting up walls... because these friendships needs to meet a certain criteria. I enjoy whatever pace friendships because that’s our human nature to connect on many different soul levels; as for moving forward in a relationship, there’s a lot more work to develop certain chemistry and to me shouldn’t just occur as you would with friendships. Friendships should feel natural not forced. Everyone has something to offer like a service. Even intending to add timing and pace to the inevitable whatever be will be. Be it we’re closing ourselves to be protective in fear of being hurt or disappointed. We can learn those same lessons even if we moved slow... or fast", "thethingsiwishiknew": "I agree with this in some ways. Strong friendships take years to build. On the other hand there are people who come into your life and it fits. Whether it's friendship or love we should never rush into anything or lay all our cards on the table. It's also true that we never really know anyone because like time nothing will ever remain the same. People change and what works for you now may not work for you years from now.", "___artofathlete": "💯", "but_youre_a_potato": "Now that I'm older it only makes sense for it to be this way!👍", "askemilywilcox": "This is so important, thank you for addressing this!", "elchat83": "When I was in my teens it didn't matter but life brings hard lessons when having those fast type of friendships. Now in my late 30s I've learned to take my time and maybe that's why I don't have too many friends as I used to its all good I prefer quality over quantity.", "chelsearrahh": "I will admit, I would approach friendships with people quickly. That's always been who I am, but lately, this year, I have been more aware of the difference between authenticity and flow vs forcing so I have been allowing space for me to just enjoy the vibe and community with someone without looking to make it anything and I appreciate them as them.", "slipsta": "I had to get burned multiple times to recognize that the “fast friend” relationships were often not long-lasting and quite often led to toxicity", "takeyoursoulandelope": "My heart is super open, so when i connect with a soul that resonates on a soul level i just know!", "anokhitheone": "I’m super slow with friends always have been because I do so much on my own and LOVE alone time. Someone would have to top that which is rare and when it’s organic it’s awesome! When you’re a business owner that provides a service people start to blur the lines a lot. To me business is transactional friendships are not and if they start to be one sided transactions where they’re getting services that customers pay for then they need to become a customer and pay otherwise I need to keep it moving. It happens a lot and take some time to sauce out which is why I don’t mind moving slow.", "nedanightingale": "Hear, hear mama. Hear, hear ♥️", "piinkliips_cici": "I’m really easy to get along with. Which in turns makes people wanna be my “bestie” off of first encounters. I encourage it because I feel everyone shows who they truly are on first impressions. Either you have that vibe I want in my life or you don’t. Knowing the kind of person I am, I can bond with them and have a long lasting relationship. Which most people I know I do. It’s all on intention n work.", "jreid0906": "I have been bitten for my willingness to make fast friendships. But I take my lesson and move forward. Usually there was a need for us to be in each others lives and I'm genuinely ok with the nuance of relationship with people.", "1love7even": "@josielondyn I’d like to believe we became friends pretty quick", "fitneeks_": "🙌🏽✨", "dre2421": "I think you’re right and wrong.", "happy_hermi": "Girl I am CHEWING UP that Boody Nugget. You don’t even KNOW", "tiffanyheals": "I agree. I am in this space now to where I am starting to open myself up to people more, however, I am absolutely fine with taking my time. This period of self-discovery/homecoming in my life has taught me patience and to flow. Therefore, I feel no need to rush and definitely not jumping in due to desperation.", "anastasia.doria": "However like I would say your viewpoint is healthier than mine. It’s just that sometimes I feel that spark with someone and it’s almost like a drug - you feel so good exploring that connection that you throw caution to the wind. I’ve had several long term friendships result from that but also have had my heart deeply broken by trusting a connection with someone too early that ended up actually having a lot of incompatibilities. Once you’ve attached that much though you’re less likely to see the red flags or distance yourself. However - different people bring out different things. Most people I connect with slowly, some very fast, and some out of those fast ones end in heartbreak. But I will say that those connections are still some of the most beautiful and inspiring - and I just can’t see myself giving up those few magical moments to be cautious and pragmatic. Some of my best art and writing and songs and some of the most growth I’ve done has come from those situations - throwing myself into something almost like a child, experiencing the magic, and then learning how to grow and move upwards if the situation doesn’t pan out. I think if I did this for all of my relationships it wouldn’t be maintainable, but once every few years someone comes along that just makes you want to act heart first. And as a romantic It feels disloyal to my core beliefs not to", "rina_verve": "I think the opposite for me. It took me a long time to become friends with the people I’ve know for years only for those friendships to fall apart because they either knew nothing about me or they always felt very negative about who I am only to find out years later how they really felt when they decide to come clean because we are no longer friends. The friends I’ve been meeting now play no games. We share the same goals and aspects on life and hanging out feels organic. Maybe because I’ve grown into my discernment and I’m a little more spiritual I can pick up on whether the energy is good. So I’m not making fast friends... I’m finally attracting the friendships I prayed for.", "lucas_warren": "I can make fast acquaintances but in order of be my friend and receive the trust that comes with that takes time. Same for relationships, I am perhaps too guarded in a relationship, takes about a year before I will share anything that matters to me.", "susy.ermert": "@hailkale 🙌♥️", "ai.hyshi": "Yaassss! I don’t know why it’s such a hard concept for some people to understand", "laurennwinston": "Okay so I really struggle with this. I meet beautiful souls all the time who I feel I can be deeply connected with but truly believe in the organic process of sharing time, space and community to build bonds. HOWEVER, I feel like capitalism has really destroyed this process... between work, side hustles, trying to “get free” and practice self care, I find myself alone and flaking ALOT! So it’s like that authentic space to build doesn’t exist the older I get. Anyone else feel like that??", "kerriisms": "Yup! I feel the same way about this", "missarie1411": "I think if you have a good foundation on what a good friend is you can tell if a fast friend will end up being someone that you can have a long lasting bond with. I have amazing friends, they are truly a blessing. Our bond spans over 20+ years. When meeting other people who I quickly bond with if those people exhibit many of the same traits I believe it's okay to have a \"fast friend\" . Worked out for me in my newer friendships.", "sarayarasahara": "Fast anything is bad: fast food, fast friends, fast relationships. Take your time people. Take your time and explore", "bethanybonsu": "I agree but maybe for a different reason. You can develop a friendship with someone quickly and then realize they aren’t the type of friend you want in your life.", "sheealw": "I just avoid forced relationships. I don’t have a time requirement for friendships. Organically, we may brunch right away or maybe not. If it takes someone a long time to get back to me or firm up plans, I assume they aren’t in a place for new friendships. And I just keep it moving.", "queendom_come21": "Haha big Taurus vibes lol", "smiley_dezie": "I met this girl about 2 months ago. We had alot in common, we spoke alot and I was enjoying the beginning of our friendship. I told her I'm only looking for friendships and i really want to take the time to get to know people. She \"said\" she understood and thinks that's a smart idea. We had only been getting to know eachother for a week, and within that week she told me that she had feelings for me romantically and couldnt be friends with me, and basically didnt want to talk to me if it wasnt on a romantic level. But it bothered me because we had only been talking for a week, and she didnt want to take the time to get to know me if it wasnt for a relationship or a romantic connection. It didnt really make sense to me because things take time and to just jump into something so fastly when you dont know a person really didnt resonate with me.", "_emesia": "I think in some cases like college roommates it's okay, because you're basically living with each other for about a year. I didn't hit it off with my college roommate right away, but it didn't take us long to become friends. She is my now my best friend, and I've never felt so secure in any relationship!", "gabby_geruntho": "Say it again for those in the back", "lynnebelike_": "I met my Sis/Friend May 2015. Instant connection and then we was tight ever since then. It’s now about to be 2020 and I still love my sister @buffalo_solja716 somethings are just meant to be.", "sunshine_musket_": "This is very interesting. I happen to be extremely intuitive (whether I like it or not 😩); however, I read people instantly so I usually know exactly who they are right away. This post actually makes me realize that my willingness to be someone's friend quickly might freak the other person out, if they can not see my soul as quickly as I see theirs. 🤔 New perspective. I will try not to scare the dope ass ppl I meet, lol. I appreciate this post @shanboody", "miss_breb": "My sentiments exactly!", "mizz.salsa": "Same!! 🙏🏽", "questforsexywithquetsy": "💯👏🏼👏🏼👏🏼 Amen!", "noisaidilikedu": "Agreed to a point. My bestie and I were fast friends and we are still very close after 20+ years. Call me crazy, but room should be left for intuition. Our intuition was correct and time solidified our friendship. I feel the lack of intuition has lead to bad connections as well.", "ohhh.karla": "After my past year, I completely agree with you!", "mbaliville": "I'm decisive & a good judge of character so if you're in my life it's 'cause you're decent & kind. I appreciate that. Instantly at times.", "geo_antoinette\nVerified": "Verified", "daninicolemusic": "Oh yes, this is interesting!! I've always wondered why I gravitate towards or away from certain people, but this makes a LOT of sense. Trust is definitely a thing, people who share too much too soon and expect the same from you, like... what are your intentions with this information about me? Or when they start asking to see you more often than you see established friends. Then the flip side is 2 people who are super healthy and just have instant chemistry, like they knew each other in a past life, which I've definitely experienced.", "jakeexplores_": "I learned in therapy that because I make so many quick bonds with people, I need to learn how to classify the different levels of friendship. That those in the bullseye of the target are not the same as those in the outer rings. I had just been putting everyone in a circle.", "youngrichauntie_": "Can I like this a million times? Lately, I have the hardest time connecting in a romantic way because people are wanting to move soooo fast. I’m like sir....I don’t even know your favorite color. 😂😂😂😂", "kamara_lighty": "I'm with you on this Shan. Not sure that's a good or bad thing though, considering I'm 35 and single and only have 3 people I can truly call friends.", "unikourt": "😫 I feel the same...but ppl be PRESS’n for my “ships” & I DO NOT like to be pressed... i was having this internal dilemma recently if it was tooo soon....I wanted to take my current relationship slower but his intentions were clear from day one, we’d be dating getting to know one another and there wasn’t really particularly on my end why any reason to not start a relationship....", "mslatanya05": "🗣💯", "myvibe.mytribe": "Yea, I take forever to let people in. If they stick around then I guess that means something🤗", "yotengotumbao": "Agreed. Ppl use the word “friend” too loosely. For me, you have to earn that title.", "bri0nna": "🎯🎯", "inquisitivechels": "that's an interesting perspective I find it to be very situational often when I meet someone who's amazing I'm so starved for amazing people that I want to bring them into the fold of my life and why waste time I think you're amazing I want to get to know you more so let's get to know each other more 🧠🔥", "cheekyandthebeast": "Yeah, I often feel like I'm too slow :)", "cassandra_of_thewind": "Agreed! I am incapable of trusting someone fully without time and consistency. Maybe that's why my circle of friends is small 🤔", "djkingtrizzy": "Me too✊🏾", "e.r.i.k.a.d.e.n.i.s.e": "Slow and steady wins the race 💕💕", "chishanni": "I personally don’t mind fast but it has to feel natural and not forced. For example one of my closest friendships of 8 years started out with us hanging out with everyday hangs fairly quick and it was just because we enjoyed making each other laugh and one of my my most intense relationships that has since manifested into a deep friendship happened in a span of two months. Time isn’t so much my thing as comfort and pace, don’t push up on me, let things flow naturally.", "gypsypride": "Yes trust = time but some times a leep of faith and the willingness to care about people override all that. It's like love at first site .. yes it can be mistaken for lust, but sometimes life just aligns it self and put the right people in your life and it just feel perfect and you know that person will be your friend your partner your soulmate your whatever. Sometimes you gotta have faith in your own instincts.❤️❤️", "joellenofficial": "Agreed", "feliciagetsinspired": "@b_likeme we were just talking about this yesterday!", "sunchild444": "I’m all about going with the flow. I pretty much am open to everywhere. They fall where they are supposed to rather that is close friend, acquaintance, community member, occasional invite, business associate or total cut off", "simplydaye": "@shanboody I’m okay with fast friendships. Am I thinking in the back of my head why does this person crave a friendlationship with me of course, however I just let things run it’s course. Energy speaks all. So that’s a short way to put it & basing it on the energy & not holding expectations. People dismiss themselves all the time of my life so I don’t lose sleep or peace.", "tanettalynette": "A word!", "thegum25": "I think a few months is the minimum for anything, but over a year is too long. Most people struggle to keep up a front from day to day, so if you know what you’re looking for and what to avoid then it shouldn’t take too long to know what someone’s about (without overtly testing them).", "sheenixmarie": "I feel you. I had a fast friendship in the past two years... we ain’t friends anymore.", "camilaspeters": "Thanks for this 💜", "msgoldie723": "I agree....I am weary of people that are ALL IN from jump. Gojng slow is not just for romantic relationships.", "caraestol": "Some do, some don’t. Some connections are that strong and genuine that y’all become closer than any of the people you’ve been life Long friends with.", "jaydester": "I've always taken my time with friendships and romantic relationships. But the one time the relationship became serious quickly, it was the one time I knew it was going to last forever. It just depends on how you click with people.", "jeezy_city": "I don't quite agree. But also depends on what one's definition of a friend is. I believe that the most important thing in life is human connection. So if someone is out there genuinely interested in making a new friend then make a new friend (children do this so easily) I feel like our baggage/scars/past hurts  build walls so we can protect ourselves. But if we take that approach then imagine some of the amazing connections one could miss out on. There are also different intimacy levels to friendships... So maybe figuring out what level to put someone one and to build is key here. Anyway my ✌🏾cents", "tivonamc": "This is me as well...fast friends and relationships worry me!!!", "goforcarla": "Lol i too move slow.....men can never understand but it makes me feel uneasy if its fast.", "serena.hussain": "Facts all the fucking way. I am ALWAYS suspicious when friend/potential mate immediately wants to consume space and attention and feels rejected if not reciprocated. Someone actually said “you’re such a man”. I think they were trying to say I’m being 🥶 when in fact I’m being RATIONAL and taking time to see if my energy wants to mingle with a new energy. Otherwise I’m fine! No void. I’m chillin. Not cold. Sheeeesh.", "obtusepanties": "My best friend of 8 years or more was a fast friend. But other fast friends I have lost. And because I rely on fast friends to know if I \"truly will feel loved\" I don't really know how to grow slow friendships. I'd love if you could talk about friendship more as well. Like the foundation", "a_britt_of_joi": "You took the words right out of my mouth. I’ve always side eyed people who met someone yesterday and all of a sudden they were a friend or had one conversation on fb messenger etc and they were friends. I just don’t understand it. I’ve always been cautious because ppl can have an amazing vibe or connection and it still not stem from a healthy place. I agree, for me it takes time.", "concta01": "@ohdeeandy ❤️", "ms_essense": "@m.l.mack I don’t think our friendship happened fast at all and I think it was for the better", "yesitslexx": "@xox_tne", "_nicola_fox92_": "Your wisdom has helped me bridge so many gaps x", "lgcubed": "I think it's a person to person thing in addition to past experiences. The more failures under your belt the easier it is to navigate to the successes in relationships(romantic or platonic) in my opinion", "kayfletc": "@kamikajade", "teshi.ujani": "idk why i’ve been letting myself overthink lately. but, i try to remind myself that no matter how slow things are being taken (not to where things are going TOO slow and nothing’s happening) everything will turn out exactly how it’s supposed to without force. it’s hard to take things slow. however, if that’s what it takes to grow a connection that i eventually want to become everlasting, then that’s where i have to make sure my head is at. if you don’t already have a for sure answer, then there’s no use in trying to shut down something that hasn’t even had the chance to form yet.", "thongria\nVerified": "Verified", "christagloster": "Agreed. I need time and consistency.", "dan.i.a": "Seems like you’re talking about a specific type of behaviour (ei making time out, tryna connect all the time), which for sure can feel a little off put tings. I don’t believe in any set pace, whether slow or fast. None can ultimately predict the direction of a friendship or bond. But I’ve definitely met a lot of ppl that very quickly we wanted to hang out again soon and we eventually became great friends. I think it’s little gifts of life.", "mademoiselle_milla": "While I do think there is a level of intimacy that true friends are privy to, I don’t think exchanging numbers in the first encounter or scheduling lunch/hang out makes one a fast friend. you can simply want to stay in touch with people you have shared interest with and build a sense of community without necessarily being besties. And for me, it’s less about timing and more about intention and it being authentic. I think there’s a difference when it’s forced vs fast. I also tend compartmentalize many of my friendships, whether that’s a good thing of bad thing is TBD but I have various friends and different crews and support systems for different things, some I’ve known my whole life to others only in the last few years. Some bestie/like family and some not.", "darrylinhorne": "I think if the chemistry is there, then just go with the flow. If it feels right, time shouldn’t really matter.", "earondesign": "Everyone has their own process and systems they feel comfortable with, so if it takes you a year to trust someone then it does. If later you find that it could be faster then it can change, you are perfect ✨🙂", "subriamusic": "There is a large chunk of my friends that I’ve had since elementary school but from my early 20s onward, I’ve moved around and travelled quite a bit. So, I tend to make friends fast. Interestingly enough, it’s worked out that any “fast friendship,” started with a vulnerable conversation from a first meeting and that’s always served as my compass (whether or not that convo ends there or if we finna have plans next week).", "tonii.zim": "I didn’t know how to say this", "xsugeidy": "@d.vladimirovna7", "coreyrobinsoon": "🔥🔥🔥🔥🔥🔥", "meggles1820": "💯💯💯💯💯", "gwimmlord": "I generally make fast friends but rarely make friends. I think it's becuase I have specific things I like in friends that it either clicks really fast or it doesn't progress much further than acquaintances.", "daaanysse": "I truly believe this is a form of Love Flooding like you’ve talked about many times before over the years. I dont think the concept is exclusive to only romantic interaction but also professional, platonic, and even mentor to potential mentee. Its always been a huge red flag to be placed quickly on a pedestal before the v human thing of getting to know and understand one another. If you’re too guarded than perhaps I am too.", "malia.walcott": "For some reason my friendships were always made really fast but they’ve lasted me years. But I’ll also only 21 so I guess rules change", "marywaliczek": "@jennerfei", "parrish812": "🤔 sometimes connections are just there fast. I like that shit!", "erickadanielleh": "This is me! I get anxiety from overly friendly and familiar people that I have just met. I feel pressure to engage outside of my comfort level and then I just shutdown completely", "vanessacraft\nVerified": "Verified", "vincentvianen": "I base my pace on if it feels right. Sometimes it’s fast and sometimes slower. I think the universe has a big role in allowing the moments. No force applied in the process", "brwnbird": "This certainly puts into words those feelings I acknowledged, yet failed to comprehend as a self care tool. Now, I do see how it is an important and a necessary way of maintaining oneself authentic and pure in spirit. Shan, girl, thanks for reinforcing this!💛🌼🙌💯", "lyfeandlove": "I agree wholeheartedly, I'm slow but not that slow. I just know I'm extremely observant of anything that doesn't align w/ my values or morals. I watch for past toxic behaviors (in myself or in them) that I used to allow. I'm mindful of how certain words are used, time & place of certain topics, & the integrity of their character when they speak of themselves/others. If there isn't any alignmnet I'm backing off/steeping our K", "amberscloset\nVerified": "Verified", "sincereiam": "some ppl just feel safe and like that long loss cousin", "bysaint_pierre": "Read this and the caption. @s.o.u.rpatchkid", "meaty_mink": "Fast friendships help me a lot. I don't have time to make space for someone when I know I'm not going to be in their life for a long period of time, and vise versa. But having fast friendships, w/ obvious boundaries, helps me not feel so alone in certain situations.", "ivyharley": "This!!! 💗", "adribakshi": "This is SOOOOOO TRUEEEEE!!! Over the years, I have had these random “fast friends” who declare that I’m their “best friend” when I think we’re just hanging out and getting to know each other. In my youth, I used to feel bad for them (thinking “If you consider me your best friend, you must not have any real friends!”) and try to fill that role of one-sided BFF, but each and every one of those people eventually showed WHY they didn’t have friends and were clinging on to a complete stranger/super casual acquaintance for emotional heavy-lifting: THEY act out and ruin their own friendships. None of them has ever stuck. I now am weary of those fast, clingy types for sure!!! No more pity friends.", "beautypalacethings": "I’m posting this from my anonymous account because I feel bad for feeling this way. My cousin has a friend that I literally just met fall of last year. I’ve literally barely hung out with her but she asked me to be a bridesmaid for her wedding and I felt like I couldn’t say no. I genuinely feel like she thinks we are closer than we really are. And I want to drop out the wedding because I don’t feel like I bring the same energy as her other bridesmaids but I feel like it would be mean. I honestly think that she doesn’t have close friends and I may be filling a void. But I genuinely take time before I consider someone a close friend. She also has this habit of trying to insert herself into my cousin’s friendship group and genuinely feeling upset when they exclude her! And my cousin hates it because she’s been best friends with her friends for like 9 years and this girl just keeps inserting herself 😭", "tx_bred_champ": "Once you reach a certain point in life you should be able to read people and their intentions rather quickly i know instantly if I wanna be around you or not and if the vibe changes I j keep it moving 🤷🏽‍♂️🤷🏽‍♂️ plus you can open up to somebody without being vulnerable we’re all adults everything doesn’t have to be so intimate and do or die to appreciate it..", "ivanavidakovic_": "It takes me FOREVER with anyone (romantic/platonic). People often don’t stick around long enough because I’m seen as secretive and guarded but those that do, end up being amazing people. I’ve had to learn to accept myself for it though because it’s not the norm in today’s world.", "cleoellis_": "Building bonds take time, but I know what I look for in the people around me and sometimes you just click. I have friends that are my people that have only been in my life a few years and friends who I’ve knows for my whole life. Time isn’t an indication of authenticity in a friendship. Time definitely strengthens bonds, but new friends aren’t necessarily less worthy or less valuable. I’m a new friend to MANY people and they’ve let me into their lives, their homes, and their families and I don’t take that for granted. These people have valued me as much as their lifelong friends. So personally, I’m not weary of new friends or fast friends. I’m 32. I know what I need from the people around me and sometimes, it just clicks. But I hear you — sometimes fast friends aren’t the right friends. Intentionality matters.", "appliqant": "I find that people see this as an opportunity to prove themselves. Or some see boundaries as a personal insult. So they make it a habit to challenge the clear boundaries you have in the beginning. It means you aren't all that, or you aren't intimidating. It's annoying tbh. Like I just want us to respect each other first.👏👏👏", "gonzalezjayy_": "It takes me time too, and when people are in a hurry to hangout or to even have my number I become timid..and feel as of they are moving WAY too fast.. I like organic connections @shanboody", "poeticaboutjustice": "All mine except two took time. I’m so picky with people and my energy. You either an acquaintance or a friend. The minute i see some funny shit I’m out 😂", "amaalnuux\nVerified": "Verified", "emerald.topaz.healing": "As a trauma survivor I totally get the apprehension and weariness of fast friendships and romantic partners. I’ve had to work hard to maintain my boundaries when I’ve encountered these relationships but there are people that have come into my life that for unknown reasons feel as if I’ve known them decades or from another life it seems. Those feelings make me curious to explore those friendships but always remain vigilant on maintaining the boundaries I’ve worked hard to establish for myself", "ksylvers": "It really depends on the relationship. I let relationships develop the way they were meant to/organically happen; sometimes that’s fast and sometimes that’s slow. I don’t like to put timelines on things because that’s restrictive. But, I can identify certain bonds that may be moving too fast (or some that may be going unnaturally slow) and I try to adjust from there. But, I don’t like to restrict my relationships in that way.", "cubanatropicanna": "Agreed Shan!!!", "katmg_": "Interesting!", "olivialanaecreates": "Yes I totally agree! My ex and I moved into together after 2 months...turned out it was just love bombing from a narcissist. Learned my lesson the hard way 😅", "jadele_director": "Definitely agree", "dianetate1": "Absolutely me! I have realized that fast friendships similar to fast relationships always fail me somehow. I get invested too early and learn that people are very different from who they portray themselves to be. Taking time to get to know someone really does reveal a lot about them and your relationship with them. I am also much more choosy about who I spend my time with now (sometimes I feel like its because I'm 45 and wiser) maybe it is just because I have learned some very valuable lessons. Time is so precious and I want mine to be filled with people who I love and adventures and experiences that I enjoy not uncomfortable moments or relationships that make me question my judgment or who I am.", "jacindathegreat": "If it’s a comfort thing does that matter? Like the women I thought was the love of my life spoke to me for like an hour at a party and we ended up talking for a couple of months - she ghosted me (so probably a shitty example) but I’m usually not fast but not slow about getting to know you if you seem interesting or vibe really well", "chixinapod": "I do think for the most part of the fast friends are usually toxic people. But not everyone has that intention. Typically the best friendships are proven by hard times. If they are there for you through the worst times then they are worth keeping. Those rules apply when dating too.", "chef_liyah": "This is a new perspective for me, I want to analyze this", "asktash": "I’m also really slow.. been burned so many times by “good” friends in the past and I had to do a lot of work on both sides to figure out why. Still doing a lot of that work on myself but I think by keeping the discovery process long it’s beneficial for both of us.. connections that are meant to happen will eventually happen in their own natural time", "i_thought_sew": "Message...", "kateinapocket": "I couldn’t agree with this more, and just experienced it myself!", "surayyaaminah": "ultimately, whether you move quickly or slowly, the relationships in your life that are meant to last will stand the test of time", "vinayakpagareartwork": "@shanboody rightly said ✌ it does take time to connect to other individual, doesn't matter how much you think it's instant, the fact is that it needs time n patience to truly understand other significant", "withluvvalways_": "But what if you guys automatically click..do you stay guarded or embark the journey?", "imswasey": "Yup! I ALWAYS question the thirst.", "meltingpot_michael": "Forming a worthwhile bond absolutely takes time to develop, but having an immediate connection and a desire to have that person become a part of your life doesn’t have to have anything at all to do with loneliness, filling a void or anything of the sort. I have a number of friends/acquaintances but have only had a handful of truly close friends, and with every single one of them the connection was immediate and strong, and something that we recognized and made space for precisely because of how rare that feeling is. The years haven’t changed any of that with them, it’s just deepened the connection. But, I am admittedly a SUPER intense person, and that rubs some people the wrong way if they’re not used to it, or if they’ve had bad experience with similar types of people.  It is a shame that love bombing and other narcissistic/toxic behavior looks exactly the same as an intense, sincere interest in someone. But that is why communication, setting boundaries, being honest & reflective with yourself and others is so important, regardless of the type of relationship.", "thebluejumper": "I think it depends, my best friend and I became good friends very fast but we were both in the same place (just started uni, on the same course, both took time out before going etc) I think the balance meant no one was expecting more from it that the other which I think is important. But we still took time to build trust and get to know each other as well as we do now.", "beautyybyl": "Sometimes those relationships that you’ve spent time on building is a waste of time rather than your spare of the moment friendships... it definitely depends on circumstances", "misscynthia86": "I feel you on this. In my experience, fast friendships tend to be more superficial and lack depth. I don't trust easily, therefore taking the time to get to know a person is better for me.", "kangaimwiti": "Hi @shanboody.. I have a slightly different take to this. Being someone who has moved around a lot, finding people who I gel with and understand deeply has been difficult. And so when I do find someone on the same wavelength, I jump in. Yes- this has bitten me on the butt a number of times, but as I review my friends I have found that a couple of my deepest friendships began on the fly, jumping in the deep end and learning as we go along. That being said, these relationships began with a specific maturity in mind, and were based on similar interests and goals. Plus we established boundaries early on so we do know which buttons to push and which to avoid. On the other hand, I do have friendships that have taken decades to establish. We don't talk often as we are spread out around the world, but these are people who I'd do anything for. Few, as close circles should be, but precious. I guess when it comes to things like these it's subjective. And in the end, I alwAys just say that you should do whatever suits your heart, and only you know what that is.. Love your work Shannon - keep it up.", "candiscandi": "I I understand your viewpoint totally. However for me I believe some friends are meant to be fast friends and fast former friends. Then there’s some friendships that are made fast or slow that are meant to last forever. Just depends on what the universe has for us to learn from one another. 💗", "octavius.caesar": "Message", "toniijustiina": "Lmao she would side eye tf out of our friendship @nbrga.jaz 😂🤷🏽‍♀️", "_chenicole": "I’m not open to fast friendships anymore because I’ve been hurt and in avoiding them I’ve learned that it’s probably best to go in slow so you can build trust instead of fast and hard hitting disappointment. I think in college I was more likely to spill everything whereas I had friends from childhood who I didn’t start sharing traumatic experiences with until recently but as an adult I definitely go in slow because people will try to trauma bond with u and think that’s endearing", "savedbythetruth": "It takes me a long time to feel comfortable enough with someone to really relax and be myself, so most of my friendships only become \"true\" friendships atleast a year into the friendship when I finally trust them. I definetly think that I'm too guarded and that my hesitation comes from a negative place (fear of being judged and betrayed)", "cnickview": "Whatever naturally evolves, and whatever sticks. We could all use a few friends fast or slow. And if it dwindles either way let it be.", "patricia.lubeck": "I think it's less about time frames and more about the quality of situation you witness each other in. If you only text someone about pop culture, 5 years may not be enough. If you have a natural intimacy and share meaningful experiences a couple of weeks may be appropriate.... But ultimately it depends what you want to cultivate. Fast doesn't mean shallow. Slow doesn't equal depth. I want full hearted connections. I don't with old my love. It comes unconditional. Like, time spent togs their, commitment, etc is then something that depends on compatibility. But how painful to actively force ourselves not to be affectionate or loving just because it's a certain date.. I cry about a loss the same way after a week or a year. I'd rather know. And if someone doesn't want to have me in their life that's perfectly okay. Just how could I give someone value and space in my relations if they hold me at arms length and only get in touch when they find convenient or are bored...", "lovemisskat": "A WORD", "linn_zey": "My absolute best friend in the world and I were fast friends. We meet and immediately we clicked and have been close friends since. We understand each other so fully and learn even more about each other as time goes on. For me, if the friendship is genuine it can happen fast and still be great. 🙌🏾", "thenameismarinadale": "Ummm, I was actually a Girl Scout for like 8 years (or something ridiculous like that) as a kid so I don’t just wanna be your fast friend, no ma’am... I’m ready for us to be actual sisters like right after you tell me your first name! 🤣🤗 Needless to say, I def get my feelings hurt a lot, tho! 😔👯‍♀️", "sabah25013": "*wary", "kfmisey": "idk, i disagree...i make very fast connections. im an open book & i like to talk so things move fast. i can instantly tell if im going to vibe with someone or not. I still think you can have organic connections even if they develop quickly..u just expand on that as time goes on or u faze them out if it seems disingenuous", "deenie_loveislove": "Yes!", "natalita_x0": "💯 🙏🏼🙏🏼🙏🏼", "jacuzzi_splash": "Lol i share these same sentiments. Im very guarded and I do not trust easily, But I had a girl I went to adult day school literally decide that she was going to be my friend cause she liked me lol and fast forward 10 yrs later she's the Ying to my Yang and it's hard to imagine life with out her support love and friendship. I never knew friendship till I met her. I'm so glad she made the decision to try and befriend me cause I would've never got to Know her on my own and who knows where I'd be today 🥂", "sammie11411": "Im kind if on the fence about this. Ive had friends that ive connected with super quick and we are still friends 15 years later. Ive also met people that it took years to connect with. I agree with many of the comments above. Everyones time frame is different and instincts should be trusted. I believe we genuinely know who will be good for us, it just depends on if we listen or not.", "essa.pr": "I’m exactly the same way✨", "topaz559": "Thank you for expressing this because I thought I was weird and not friendly", "fitnerdymom.dotcom": "I’m all about fast friends though. When you know you know. Husband told me he loved me the day he met me. 10 years later still very happily married. Fast isn’t indicative of connection depth to me. It’s either there or it isn’t, time isn’t the decider.", "shutesforthestars": "My current boyfriend & I got together relatively quickly. Within a month of working together & being friends, he asked me out. But we both describe our connection as love at first sight. It really did happen in the cliché way I’ve always heard: it comes when you stop looking. I stopped looking & we found each other. On the other hand, I have a big, bold personality & form relationships with people quickly, but the actual connection of a friendship takes some time. I’m 50/50 with this one", "sunshine_desert_girl": "I’m with you on that. I want to develop lasting relationships built on trust and those always take time (for me). To be fair im like a scared wild animal that runs from physical affection soooo... maybe i also take it too slow?", "ari_taylor__": "Not sure if I agree I’ve met ppl that I’ve just automatically clicked with. It felt like I’ve known them forever. That is the real true friend I’ve had over the years. I recently heard a lyric “never judge the length of a relationship over the strength of a relationship”. I don’t believe the length could make anyone a better friend because sometimes you meet ppl who are more supportive than ppl who have been there forever. I truly think it’s about the connection you have with a person and the pl you are at in life.", "louie.ge": "Life is too short to wait too long for love. But it's always worth the wait. But if it takes that long? Therapy is better than taking your time with a person. It doesn't matter who the person is waiting too long could be a by-product of trust issues.", "djp_228": "‼️‼️‼️‼️‼️", "iam_mirandabowden": "I believe that with some people for sure. But some others just fit like a puzzle piece and you grow that relationship through trial and error. We know when someone is shady we just choose to ignore red flags.", "louisamadsen": "@frejatopp Ingen hurtige venner for os", "imrachaellea": "I sit on the fence. Sometimes fast friends come at just the right time. A total connection you never knew before. I think the question is, why do they want to be fast friends? Am I benefiting from this mutual friendship? Am I connecting or leaning a new friendship as a crutch. For the most part I agree with you, but there are a few diamonds in the rough.", "bri_deneille": "I know someone who met her husband, married 3 weeks later, and happily married over 40 years. While yes that's rare, I wouldn't necessarily be skeptical of those who fall in love quickly. Although I would advise everyone to take their time Now quick friendships, those make me Leary.", "claujograms": "I think this can be tricky. I’ve had friends I made fast and I’m still learning lots about them and I’ve had friends I considered to be sisters and we’ve parted ways. I say it depends on the person, how extroverted/introverted they are, and where you meet them. I feel like now more than ever, people are super lonely and isolated. No one wants to feel like they’re a void filler but how do you be enthusiastic about meeting someone new and wanting to learn more about them without the person feeling like you’re being clingy or insecure? You can’t win for losing! 😂😂", "sunnymegatron": "BOOM. Yes. Agree 💯", "tamyraj_": "Ditto", "gwenelliot": "Wow - great topic! I don’t hear anyone talking about this, and it’s really important to have discernment when it comes to letting new people in! 🔥🔥🔥.", "crzysarah": "I feel the same way💯!!!!you gotta be through thick and thin and know who is there for you . Bestie title is not given out lightly", "miss.clark": "A few years ago this girl and I had become friends, because her and her girlfriend had broken up. Her ex had cheated on her. After this, we were hanging out EVERY SINGLE DAY. Which was probably not healthy. In my head I was just trying to be a good friend. In her head, I think I was just someone there to fill her void. And then she started to grow feelings for me that I didnt reciprocate. Our friendship turned really toxic. At the end of it all she told me she was never comfortable around me. Which was BS. She was trying to make a dig. And then she ended up hating me for pretty much no reason. Years later when I think about what happened I think I was supposed to make her ex jealous and just keep her company. But then she wanted to actually be with me. And I wasnt down. So it was easier for her to cutt our friendship off in a mean way. SO NOW, I am very guarded and careful of who I let be my friend. I dont want people in my life who only choose me when they have no one else. @shanboody", "queenof_freckles": "I trust the vibes and how I feel 💘 if it’s the vibe - Issa vibe !!", "funnyfacects": "I think I love too hard for fast friendships to be the norm, but if my spirit takes to you, I trust it.", "fionadejonge": "I LOVE that you also speak on friendships. I know you are a relationship and dating expert, but I absolutely wouldnt mind more of your insightful content on friend relationships. I’m slow as well but somehow struggle to accept my friendship style so this kind of content helps a lot. Thanks Shan <3", "_daniellebernadette": "50/50 I feel like they're there for a purpose even though it's short lived but i dont quite trust it yet. We could be fast friends and all but in general I'm a very private person. I dont like how the time is being used up for fast friends. Like I could be using that on something else.", "kweilin": "I’ve learned", "kiersten_patton": "Oh 💯My best relationships (romantic and friend) form naturally and evolve over time! They weren’t forced or rushed.", "blakchyl": "Speak Shan speak", "iamkamalikabarua": "Amen", "tanirah": "I think the difference is between a fast connection and a forced connection. We are naturally drawn to energy. And we can connected with people at different paces because of this. I don’t necessarily believe that this type of connection is to be mistrusted. Now a forced connection is unnatural and people who push too much or too hard to me are not to be trusted.", "shapedbyshayshay": "👏🏽👏🏽👏🏽", "antoinettedaniels_": "You are not wrong....Narcissist are fast friends and lovers... Take your time with people...", "colbykamilah": "I don’t make friends easily. I prefer to interact with people one-on-one, and I don’t reveal a lot about myself to just anyone. I have to really trust in order to be vulnerable, and that takes time.", "ravenn_lb": "@shesjustwright_ ❤️", "madyson_valerie": "I have never heard anyone talk about this subject before, but this is so so important! I had to learn this the hard way. Over the years I would be so excited when I vibed with someone instantly. The friendship would move fast and over time I would see the mask be taken off and the toxicity shine through. I was always way to trusting of people. We all have our own path they were just not in alignment with mine Just like a romantic partner you should TAKE IT SLOW. To see if this person is the right match for you. All my friendships that moved fast and chaotic didn’t last, while my slow and steady ones are my forever friendships. @kenzkucera @madi.haas @jerk_of_all_trades ✨ What do you guys think of the subject?", "tiffany_racine": "I’m screaming 👏🏾🙌🏾", "akacrazyb": "I don’t agree with this. Because every friendship and relationship is different and depends on what place you are at in your own life and that determines the pace you should go. Just because something is fast doesn’t mean it’s not organic. People need to learn themselves and what they desire and require before they form any connections. Learn yourself is #1", "potato__cutie": "I agree with this if the vibe feels forced and unnatural", "dannikimberly": "@shanboody I disagree and agree! It’s situational. I find that bonds born out of a shared mutual experience or hardship can be fast and true. I’m currently in a nursing program for second career ppl, I see my classmates more than my own family...we have shed tears together, become emotionally raw because of the stress of the program, Fed each other and experienced more things together than I have with some family members...Time is not a true measure of friendship...but the quality of the friendship itself is", "antiterrorsecurity": "👍💎🔥💣❤️🌹😁 💯 💯 💯.....", "_love_soulbounce": "I feel the same way. I take friendships or any kind of relationship seriously. It takes awhile for me to consider someone a friend", "_bignelly": "At the end of the day, you need to take time to learn your partner. I have friends and clients that have entered into relationships quickly and impulsively. Most tend to not work out. The ones that do work out, it tends to take some time adjusting. Personally, I want to get to know the person before making serious commitments.", "jnuelz": "Whew I know a couple.", "sjudis": "@shanboody I honestly can’t say that I agree at all with you. Fast friend are a bad thing? What?! You literally sound ridiculous. If people make time for you it should be appreciated not taken for granted. Honestly unfollowing .... you don’t know what you’re talking about. It’s clear as day.", "natasha_sen\nVerified": "Verified", "abida_a98": "Normally I would consider myself very guarded when it comes to relationships but I moved in w my girlfriend after 8 months so I’m not one to speak. Of course we’re still learning about each other but open communication has to be one of the best things about our relationship", "adriennelives": "I just think everyone’s needs, desires, and speeds are different. What works for you may not work for others. I think its a slippery slope to set universal/vague time frames. Just like we talked about not putting a time limit on when people decide to have sex, I think this feels similar.", "jeanelleisoutside": "You've hit the nail on the head with this", "ladytai225": "I like how you said its like they are just trying to fill a void vs find a friend. I think the most important thing is to know your boundaries and communicate them. If they are shady you will know", "trishnaomi": "I agree with you 💯💯 💯 I just cannot be artificial. It takes a lot for me to call someone a “friend”. Male or female... most ppl definitely are just acquaintances in life but a lot misconstrue that for friendship. Both friendship and a romantic relationship bear a lot of commitment and loyalty. Loyalty requires sacrifice and selflessness and if you were to test many “so-called” friendships and even relationships.. you will quickly learn... mofo’s never loved y’all lol (Drake reference) My test is loyalty... the longer an acquaintance stays around shows me that they just might be genuine. Can take years to determine. But on the flip side. There are those rare, organic spiritual and mental connections that come along once in a blue moon and those can just stick from day 1.", "official_smith34": "💲5️⃣0️⃣0️⃣0️⃣➕OVERNIGHT➕HMU💰💰💸💸", "opalellyse": "💯", "dawn.letters": "I hate fast friendships. it takes me years to be friends with somene", "tifara87": "I thought i was stuck up , i was thinking the same thing 🤔🤔🤔🤔", "goldn_charmr": "[Criticism but not bad] Hurt people, hurt people. It seems that you have had a long healing journey and may be some ways away from getting to a point where your energy is SO full that nothing can hurt you, but sometimes (especially in this age of social media) people forget that, rare as it may seem, there are GENUINELY good people in the world and sometimes these people are just as genuine as you but do not have a friend. I struggle with making friends, because people have come and gone out of my life a lot, but when I try to change that, people who think like you suggest hurt me by not giving me that chance. Just food for thought, and it’s all love ❤️", "amandamuse": "I was an expat for a while, and when I decide I like a person and we vibe, let’s do it. You never know how long you’ve got with people or places. Friendships can be lifelong, or just a season and I’m cool with both. Also tho, I’m in my 30’s and can smell the lack of authenticity a mile away so I trust my instinct.", "iheartanyarenee": "Not a fan of it... it actually drains my energy... I think it’s also dependent on the culture and how that person was raised... I can only vibe with a certain type@of person", "iamhemlee": "Indeed.", "gyaldemskinny": "I see a lot of people who have a multitude of friends/acquaintances while I can count my friends on half of one hand. I think some are just not hurting for connections while some of us may long for it. I try to remind myself that when I am connecting with someone to not be too needy. But I be needing a damn friend lol. So I can def say four years for a lunch would make me feel like I possibly don't meet the standards of a friend and would most likely move on. ❤️", "vee_leigh": "💯💯💯", "karinphoenixwho": "Faxxxxx", "livintherealworld": "Hm, interesting. Maybe this is why none of my friendships last 😂", "takingbacktamara": "I think it is different depending on the people you are interacting with. I get along with people pretty easily so if we've hung around a few times in a group scenario and I sense that they are a person I could connect with individually, I'll reach out and schedule coffee. I don't think I go into it with the aim of trying to force a friendship, it's mostly just interest in who they are. For me there are also different levels of friendship, so I have a large pool of people that I mostly interact with in groups and am friendly with, a smaller group of people who I hang out with both in groups and one on one (every couple of months or so for the latter), and finally a group of friends that I'm very intentional to spend quality time with and get to know on a deeper level. It definitely takes me longer to get into that deep friendship space. Some of the friends in that group I've had for several years (one even nearly two decades), but there are a couple who have managed to fit into that space after only knowing them for a brief period (8 months-a couple years).", "_chaeeee": "It’s 50/50 to me. My wife and I have wanted more friends for a while and we have a lot of free time so technically we can make time for friends. Now in a way I’ve met someone who always wants to go out and have drinks and I’m very hesitate of it because I just don’t think i it’s the easiest way to meet a new person.", "funddiva": "@shanboody my instincts are spot on when it comes to friends and a lil dull when it comes to ❤️ relationships- I dunno what that’s about", "priscilllaaa00": "I'm of the mindset that quality of time trumps quantity of time. Also I think that it doesn't take long to love someone's spirit and energy but getting to know their history and what built that spirit takes time. So in short, time isn't a big deal and it's a case by case basis.", "msjasnicole": "I think I’m a fast friend based on a description you provided in the comments. I am naturally enthusiastic about people unless someone just feels off but I don’t hesitate to be upfront about my interest and wanting connect. I will reach out and if the person is receptive, great. If not, I don’t take it personally. everyone is paced differently. Not to mention living in LA it’s easy to come across this superficial blend of networking and friends. I suppose experience can dictate perception and influence the way we navigate socially. I have a group of friends who I have invested that time in and we have close intimate relationships but 9/10 of them started because I showed an interest in them. Some of my relationships/friendships took a long time to develop and those didn’t necessarily yield a better result. So I think we just have to trust our intuition about people (good/bad) and be okay when we get it wrong and grateful when it’s right.", "senpai.swavey": "I had a fast friendship in the 6 grade it's been ten years and me and that person kinda fell off about two years ago but we still talk and hang out like every other month or so", "themodesthiker": "So agree with this. Always struggled with the idea of temporary anything. All my good friendships have taken time and effort to build and romantic relationships are no different. Im not looking to fill the space but instead looking to give quality love and receive quality love in that space. 💓", "butilovememore": "No microwave friends, love or raps!", "plantacealabs": "Yes!! Move at the speed of trust. Your ancestors know what’s too slow or too fast, not other people.", "ameliaa.rose": "Ive always taken awhile to “warm up” to people. I have a thick wall up but I’ve realized over the years that the right people will be patient. I’d much rather have a close knit circle of people that mean the world to me over fast friendships/relationships.", "worddoc": "💯% with you on this one!!! #ProveYourselfToMe", "snacks.perry": "It depends on the environment.", "only1lovee": "It has been hard over the years to keep & build a friendship . I would consider myself a loner but I yearn for a true friendship. I don't know maybe one day. Until then I will continue to create & rediscover the uniqueness of friendship. Lets face it everyone needs friend! #letmebeyourrainbow", "ashantae.seaborne": "This is me. Im a friendly person, but Im also insanely detached from people and my emotions sometimes and although it may seem like Im trying to find future bridesmaids in some social settings, Im just trying to be nice and not spend my time in awkward silence, I try to treat people like I want to be treated, but I am becoming more aware that I have a pretty strong personality. It's a teachable moment for myself.", "nikkicadestudio": "Totally agree!!🙌", "laindiaaaxo": "Earth sign here! Prefer for things to happen organically 💕", "hey_lanae": "Agree! I take friendships so seriously... I have to sit back and feel you out. I strongly believe the saying, “Show Me Your Friends, And I’ll Show You Your Future”", "mandielisciouss": "I say this all the time. People are too fast with attaching themselves to people sometimes you just need to sit and feel out their vibe first.", "christinablacken": "I agree I think being too guarded can make missed opportunities for connection but people who want to be bffs from hanging out once or twice are connecting with a projection and or only trying to fulfill their needs which doesn’t make for a strong long term relationship", "graciestackk": "@sharonsullivaaaaan @riadhh___ facts", "diamundrouff": "Idk. When I’m in my power, fully operating from my heart center, I am soooo incredibly open and receptive to almost anyone. It’s been detrimental in so many ways though, so I’m slowly learning that my openness can actually frighten others. Also learning that everyone doesn’t need immediate access to my energy in that way, even if they seem lovely. I believe God is strong in my spirit and that naturally makes me open and compassionate towards energies that I feel are in sync. Again, I definitely realized this year that I can dial back and use more discernment. It’s hard though. I just love sharing positive energy when it feels right. ✨💎", "miss_jasmine_oviedo": "💯", "noobetterlove": "Definitely agree!!", "jessicankaya": "🙌🏼", "sarahisfocused": "Same.", "santasierra": "It can happen that someone healthy clicks with you right away. Usually, it doesn’t. I consider it a red flag for an unstable personality if they suddenly love you without really knowing you.", "_healthywithm": "Wow yes 🙌", "jdanistheman": "I prefer slower than faster. All my close friendships were never forced. There was effort on both parts but it never felt forced. I’ve tried quickly forcing romantic connections and it never felt right.", "abbyy_cc": "I frequently find myself “chosen” by people who want to impart friendship upon me who are lonely, but don’t value my presence. You can be platonically love-bombed (friend bombed, if you will) and the effects are the same. It’s hurtful and can be demeaning when people who don’t know you rope you into something so fast, without having come to learn you.", "alunobaruchel": "I definitely agree long lasting relationships take time and are an investment which means they don’t develop overnight, but I actually like someone that seems excited to make space for me in their life because we match energies or we have similar interests. So if they’re down to hang out I’m like ok cool! I feel out the vibe and either continue hanging out with this person or it can be a one time thing. This has resulted in both short friendships and long term ones but I definitely don’t hold people at an arms distance unless I feel like I can’t trust them and if that’s the case, I just don’t pursue that friendship. I’ll keep it super casual and don’t go out of my way to hang out. If we do, we do and if not it’s cool. And if it seems like it’s a waste of energy to even hang out at all, it’ll just fizzle out. For ROMANTIC relationships, I definitely become friends first. The romantic aspect from when we decide to date seems “fast” but only because we took a while to be friends first. Cuz sometimes you realize you don’t even like them like that and it stays friends. And sometimes they aren’t even good friends and then you saved yourself from being in a bad relationship. There’s no rules to it, I just go with the flow but so far this has worked for me ✌🏼😊", "xo_slade": "This is something I’ve been thinking about a LOT lately! I moved to a new city not too long ago and have sort of struggled to “put myself out there” and make new connections. I, too, am turned off when people attach to me too quickly, but I’m also someone that people tend to naturally gravitate towards. So the potential is there, but I can be a bit guarded. I’m learning to be cautious about moving too fast or being too optimistic about potential new friends, and also learning to listen to my gut and discernment about people. For me it’s become a case-by-case analysis. 😅", "kk_02129": "I definitely believe in fast friendships - I do not believe in fast romantic relationships. There have been Some people I have met that have instantly connected with and almost feel like long lost friends. It’s similar to friends That I have lost touch with but when we see each other we can pick up right where we left off. Intimate relationships on the other hand I am much more guarded about people who fall so fast for each other ...", "styledbymele": "I'm like that, if you're going to be my life , I will scan you like a xray, and move accordingly. Everybody ain't your friend, but they can fit in your life in another way.", "halima_yaray": "I definitely agree! All the friends who took that fast route with me are no longer in my life. It’s not for me. Some people also are not looking for deep relationships either , they just like to socialize. So you have to keep eye on which category they fit in and whether they’re a good fit for you.", "konsk33ted_08": "❤️❤️", "balsamickgravy": "Here in Hawaii we have Aloha and are friendly to people... but It's not the same as acting like you have known someone their whole life. I would definitely be scetched out about that.", "equitacosmetics": "I agree! Great things takes time! What’s the rush?", "jonnydavis77": "Did you seriously like your own tweet?", "shari__smith": "I find that establishing new adult friendships is extremely hard because people have their own clicks, groove and reservations. But they are sooo important because we are constantly changing and evolving and that sometimes requires new friendships. For me, I think building a new friendship is similar to dating - I.e Randomly approaching someone, talking about random things, asking for their information and being invested in establishing a connection thereafter. So, maybe a “fast friendship” isn’t the best way to view it, but maybe “fast connections” that have the potential to be “true bonds”.", "mpress.of.brilliance": "I make fast friends and fast love tbh. I genuinely love and trust everybody until they prove unworthy of the level and access I’ve given them and I adjust accordingly. I also listen to my instincts and ancestors", "dean._.marie": "Agreeeeeeeed.", "ogechionyeukwu": "Girl you said it!", "_chanelshalise": "Thiiiiisss!!! I’ve been saying this forever I can’t trust someone who has a new best friend every other season 💯💯", "chezzaouttanowhere": "Oh and WE GONE BE FRIENDS FRIENDS ONE OF THESE YEARS @shanboody!!! I said it first.", "kdinahs": "YES! I am older than you but so glad I have found you and enjoy your insight. Excuse the language but I fucking LOVE you!!!!🙌🏽 Female empowerment and femininity at its BEST! Keep it up love.", "sabriyya": "It’s instincts for me, some connections transcend time & space. Why deny them just because they are “too fast” or take “too much time”.. i don’t think about the timing so much as I think about how these people are making space for me and vice versa.", "kalyncoghill": "I find that this was a problem of mine when I was a people pleaser. These friendships would fizzle out as soon as they would start.", "faithbxo": "I don’t mind connecting with someone if the vibes are there and we have a mutual friend. A random person I would naturally be more guarded with because they’re a stranger. Lol but I’ve had real friendships that blossomed quick because we had a mutual friend or worked together and saw each other everyday. It doesn’t happen often. It’s all about the vibes I guess. I welcome good energy.", "shellisshe": "I can understand this bc I have had quick friendships/relationships & they fizzle out but I have also connect with people and things progressed quickly, naturally with no pressure or pushing from either side. So, for me, it really just depends on the person & what happens naturally.", "saabirahlawrence": "Oh god, can I relate! I have a guard up which is annoying, I didn't let people in easily I'm really wary of peoples intentions and authenticity so I just keep myself to myself. I think friendships do take time but I do think I take a bit too much time 😂", "misterode": "U get the art i msged u before?", "cherrydriptriplex": "I’m this very way I like to know I can fully trust you with my whole entire being and I thought that it was a disconnect with myself that I needed to learn to be able to allow myself to be comfortable with people that are new coming in my space it’s very precious to me. I’m glad you said this is you as well It makes me feel like I’m not all bad so I don’t feel bad anymore 😂😊", "enthusiasian": "@mtncd we were literally talking abt this!! All my fast friendships disintegrate tbh", "assanti_the_beloved": "It depends. If I meet these friends in a context where some shared values or ways of life have already been communicated (friends of my friends, church/religious community, charity/community fundraisers and organizations, podcast meetups, etc.), then that does make me more open for connecting with them past superficial levels more quickly than a random person I’m not sure I have as much in common with. And not that I have a ton in common with a person to be genuine friends with them, but the familiarity from shared values and ways of living definitely helps build those connections more quickly for me. But in general, I like to take things slow.", "1strategic_chick": "🙌🏽🙌🏽🙌🏽", "lafleish": "Took me a long time to learn this", "indianagiordani": "These are my sentiments, the people like this don’t just worry me but I get defensive by being aloof and secretive.", "youngzilo\nVerified": "Verified", "soulfillingpodcast": "This was one of my favorite takeaways from our interview! I personally love the idea of becoming immediate friends and lovers. But looking back at all my divine relationships it was organic and definitely not rushed.", "badbitchgonegoddess": "Time is the ultimate test. But I do think there are too many intricacies about human relationships to make a blanket statement one way or the other. I’ve had ones that were fast and others that took time. In both cases some have been amazing and others not so much. These days I take a “be open but stay woke” approach. Checking in with my intuition regularly and not ignoring any red flags. 🤷🏽‍♀️", "margarettmel_": "I agree with you but at the same time I don’t . I’m pretty 50/50 on it. Yes, they should grow organically but there’s nothing wrong with having an instant connection with a friend and just having a cup of coffee or lunch with someone to get to know them. A lot of us are so guarded and think way too deep into it sometimes. If someone is meant to be in your life then they will be. It just depends what type of people you want in your life . If we’re going to be guarded for so long then we are going to miss out on the experiences , good or bad. You never know who you will bump into I your life that will change your perspective", "ibetonmyself": "All facts", "cpbrucci": "💯💯💯", "sweetrain72": "i completely agree. i like to take my timr getting to know someone as a friend and rhr same applies in romantic relationships. When someone comes on too strong, too fast it makes me wary of them.", "yo_ag1": "@shanboody fast friends = No", "anoritakei": "I am a little 50/50 on this one. I am weary of people who attempt to form fast friendships with me when I’m not feeling it. However, now my boyfriend I got together very quickly. Literally “like at first sight” and we were together six years (he passed away recently). I said all that to say, I trust my instincts. I can tell when me and someone are on the same wavelength.", "jasmineelliscomedy": "My rule is let the friendship blossom before the obligation does. There’s nothing wrong with putting yourself out there as long as you center your own growth first. If I meet a woman and think we have complimentary energy and direction I’ll say hey “do you wanna get coffee Friday” and then go get cofee Friday because I want cofee Friday I don’t depend on her or feel obligated to her but my door is open.", "raesoular": "completely agree!! energy vampires see that you possess the energy they’d like to give off, so they cling to suck the life out of you 🥴", "sunii.santeria": "I agree wholeheartedly. I feel like the friendships and romantic relationships that I ever acquired abruptly were because of trauma bonds. Exactly like you stated, needing to fill a void. Our spirits knew each other through pain and not peace. Whether it was outside inflicted pain that we could relate to, discuss together and bond through or pain that we unconsciously inflicted upon one another the bonds were not healthy. It wasn’t until I healed the part of me that needed outside validation and love that I was able to organically attract healthy friendships and romantic partnerships. I personally feel like those relationships are always attached to voids and trauma.", "toya.alicia": "I kinda need this 🙏🏿", "kris6ix": "@kiana208 🤔", "c.duvefjard": "I agree with you tough. I feel like with the dating apps and what not, there is such a hurry to make a connection. And while it is possible to have an instant connection sometimes that is not the norm of how relationships develop. Relationships, as I see it, develop over time and the process of warming up towards each other and creating a safe space between the people involved takes time and is not something you create over 2-3 dates.", "christiluv88": "Same", "beyoutifulamber": "🖤🖤🖤🖤", "isiscbeauty": "I learned this the hard way! Lol, I prefer it slow and to get to know them and let there be a journey in the friendship itself, that’s how most of my friendships from today are still valid after so many years ☺️💜", "arthy9": "Eye opening. Definitely have a few of these in my life right now. Too much, too soon.", "40code69": "I feel completely different during this life season as I did in those prior. In the past, I’ve rushed experiences only to miss or ignore obvious directional signs not indicating “Go,” only to learn costly lessons I could’ve read about somewhere. In this season, I’ve chosen to slow my ass down and smell the roses.", "minimalistblkgrl": "That’s so true", "blaknshiny": "So ..we're not friends?", "mikkironie": "Yes girl! I feel you on this 💯!!! 🙌🏽 I say it all the time, but all of the friends I have...I’ve had for YEARS! Not to say I’m not open to new friendships...but unfortunately there are a lot of people who are not genuine or have your best interest at heart...and those need to be weeded out before I call you “friend!” Some people use the term lightly. I can not!", "mariamcnair": "Maybe they’re lonely? I mean I agree that trust should not be given so quickly but if you give someone the chance maybe you would be surprised to see some people are just inherently good", "vanessa50987": "That is soooooo true. I'm always like 🤔🤔🤔 what's the motive here?", "theprincesslifestyle": "Fast friends leave as quickly as they come 🤷🏾‍♀️", "issatrae": "I don’t have any “fast friends” but I do feel like fast relationships (w/o organic progression and stability) are huge red flags and not my style for sure. I’ve been in those situations in the past & have been inherently negative and a huge blow to my self-worth as a whole. I’m healing / healed from feeling but I remember thinking “I haven’t even know this person that long, why are they treating me like XYZ” or “I haven’t even known this person that long, why do they feel entitled to XYZ” and it’s baffling. Lastly, this is why I hate the “U-hauling” stereotype amongst queers and same-sex couples. It places normally on moving fast & make natural progression and stability seem abnormal.", "duarteiolanda": "Never ends well... At least for me", "theemrdozier": "I agree on fast-fake friends @shanboody but what of those that organically happen in an instant because of reels chemistry and transparency up front?!? 🤔 Likely not preferred I get that, but also can be just as powerful as friendships that took you years to develop. I think the fear of a fast friend stems from past trauma and being let down by those you once deemed worthy, who in the end failed you. My two cents.", "poojapallavi": "I dunno, I have met people &immediately felt a soul connection &also trust myself &my instincts to know if someone is supposed to be in my life. But it’s def not every person I meet.", "only__1__g": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 #agreed!", "heynat00": "PREACH🙌🏾", "leah_cymonne": "I’m on the fence. I completely under where you’re coming from and can take some of this and apply it to my life at times but I do find when those connections are strong and undeniable to In fact explore them. It took me a while to learn to trust my intuition more and more but once I did, I found that I blocked a lot of people out mainly of being leery and fearing that fast connection. @shanboody Love you so much 🙌🏾🙌🏾🙌🏾🥰", "loveyaya87": "💯. I just stopped seeing someone for these exact same reason. It sounds crazy to say you don’t want to date someone because they’re doing all the right things, but too fast. If I don’t feel like I’ve earned certain treatment I get nervous. Like why are we rushing this? What don’t you want me to want me to see that time will reveal? More importantly why don’t you feel like you’re something worth being worked for? Then again I’m sloooooooow yo commit to anything 😂 so these could be natural things that I just don’t understand.", "rai9_8": "I’m slow too lol! When ppl are super anxious to hang out with me, I’m like who sent you and what do you what 🤔", "mr1loveto\nVerified": "Verified", "wowmikaila": "I think sometimes you just click tbh", "nimeaariana": "Sometimes there’s a connection at a soul level that is too hard to explain, you simply know. Most of my best friends and closest confidants / deepest personal relationships have happened this way. It’s a different way to relate. Not all will get it, but for those who do, sometimes “fast friendships” is exactly what’s needed for you. Then there’s others that it takes years to build with, until you let go of your walls, but neither is better or worse, just different levels to relate on. ♥️", "maggie__humphrey": "I feel like I do that...... but when I find someone I think I’ll actually like I’m not afraid to just talk to them. Unless I really don’t like someone I treat everyone like they are friends (for the most part) in the way that I talk to them. Even if neither of us would ever really call each other friends. I feel like it’s just being cool with someone.", "etnothome1": "🤯", "fearfullyflawed": "The older I get the more this resonates with me.", "renayalthea": "@jamoie thoughts on this?", "affioncrockett\nVerified": "Verified", "umbralinux": "I live by this rule so much now. The last few months have been a test. I never though I'd have to keep this wall up like this.", "ninas_notions": "I agree. I don’t know that there’s a set time frame in mind before I consider someone a friend but like you I’m definitely not a fan of fast friendships. I think that just like I’m dating it can take months or years to see someone’s true colors so I feel the slower the better before we put labels to any connection.", "akilahjamila": "💯", "bdajour": "I learned this lesson recently! You’re absolutely correct. Friendships are so important and I take friendship breakups hard 😭", "lajoilieorchidee": "I prefer to move slowly as well", "kaytreuna": "Soo what you doing in between that time ?? Texting ? Liking IG pics?", "aintlifegrand0717": "If anyone tries to have a fast relationship with me, my guard instantly goes up and I become apprehensive about them. Male or female", "ms.nekki.nek": "Agree. Omg.", "__xxshxne": "To an extent yes because some people you can immediately vibe with them because they share similar energies to you but effort still has to be made. Some people you can take slow time to know them and they can end up being a waste. I believe for both trust your gut and intuition and monitor things regardless of pace.", "charandroses": "I agree! Vulnerability and transparency take time and those are important in all my relationships!", "driasaidsew": "This finally set in this week 👌", "ashleyjmha": "I definitely know what you mean!! In the past, I became friends w someone so quick it seemed like a perfect friendship but she ended up being really toxic to me and it seemed like I was just there for a confidence boost or boredom filler.. BUT i have also made friends super quickly that i still love and trust to this day so I think it depends on how smart I am when deciding who to stick with!!! Some people just suck and others don’t lol", "darlingtiara": "Real shit, not always disingenuous but sometimes they’re in need of something too fast when we haven’t even explored the friendship compatibility.", "jinawa": "Agreed", "dewanemutunga": "I’m the exact same way‼️ Once I lock in, it’s a forever thing so I take my time to explore everything in an organic, natural fashion...", "carcar.vroom": "I think this is something I’m learning for the first time. I’ve had to take a step back and examine why I need things to happen so quickly, and how to be not only okay with but grateful towards people who care enough to not rush.", "aaminalove": "I feel it doesn’t have to be slow. I like to think I am very intentional with selecting who I spend my time with. Sometimes it does take longer and other times not because it’s hard for me to find people I vibe with with the same Midset interest and goals so of course naturally when I find that I’d like to spend more time with them. So I feel in a general basis yes move slow but sometimes the connection is just there. But I have a super small circle to begin with.", "writeeversosoftly": "I’m on the fence about this. I do think it takes time to build a connection however sometimes people have this energy that you didn’t even know that you wanted to be apart of your life. Sometimes connections are instant.", "ayik.an": "@shanboody I feel the same way, like \"this is moving to fast\". I believe true friendship and relationships take time.. who u are in that moment may not be you in three months and that's okay. but being surrounded around people who understand and promote growth is just as important. so whoever is willing to be down will be and whoever isn't, thank you for saving me the time❤️", "guyblaze": "👏🏾", "honeyb_ismyname": "The click is usally fast but the trust is slow.", "iamemkae": "Perhaps our past experiences inform our comfort levels with the speed of bond building. I am very withdrawn so I have a hard to building bonds AT ALL. When people come into my life and bond very quickly, before it felt like a rush of positive energy cause I am so often socially isolated and I love having that energy. Now, I feel the same but I also am guarded and on the look for red flags when people come too quickly. But that’s just from maturing, learning and experiencing bad relationships. I think there isn’t a timeline. There’s just the fact of “are there red flags or no.”", "thewayflowersgrow": "Facts.", "zee_elle": "100% agree!", "wehavenoshame": "I like to lean in to those immediate connections because life is short, but I maintain some serious boundaries until the person has proven themselves.", "michelle_dionne_": "Agreed! I’ve always moved at a slow pace out of necessity for myself, my feeling, emotions etc. I take bonds seriously as you have to nurture relationships/friendships for them to sustain. I too am a comfortable moving slow and in times where I did move fast it crashed and burned as I knew it would.", "riklev": "How do you distinguish a void from availability?", "kai.eli17": "With @xxlulublainexx everything just fell in. I don’t trust easily at all with any type of relationship and always felt uncomfortable when told “we’re like family” months deep into a friendship, but with my twin I found a friend that I couldn’t wait to introduce to my family and already started meeting his. We help and heal each other, and I don’t think energy lies. At least not in this case lol. So it probably depends on the person and the connection, and what you believe the intentions are behind someone wanting to be a part of your life.", "lidmelgar": "All of this👏🏽👏🏽", "nuvgoraya": "@christina.jm agree 8000000%", "nawaalsams_": "Fast friendships end even faster", "marita_mariel": "How long do you think people should wait? I made a friend and got closer after a year, and now two years in I have completely removed them as they are disrespecting towards me. It sucks when you wait a year and they still turn out to not suite you. I feel like I get friends and then I lose them. It's my choice if I remove them tho. But I ain't got time for bad energy.", "jodi.williamsx": "I agree !! people wanna call you bffs after a few weeks 🚩🚩🚩🚩based on what luv??", "kmaries91": "Not a fan of fast friends which is why I only have 3 and they’ve all known me over half my life", "bryarcrose": "What's a fast friend", "casharroyo": "🙄 @talea_m", "val_vxn": "This is the absolute truth! 🙌🏻", "designerti\nVerified": "Verified", "mz_resillience_survivor777": "I agree it does take time to build. I had fast friendships/ relationships and neither is standing til this day. Take your time at what pace works best for you. If it's genuine and meant to be it will.", "territv": "Agreed! All my relationships are 15 years plus or more!", "kayconleche": "I click fast with certain kinds of people people but a true bond will always take time.", "bethlo_": "I’ve realized very early that I moved slow with forming relationships. I prefer the bond to be formed organically because for the life of me I never understood how people could be BFF in a month or so.", "ultimate.educator": "I feel you Shan, but whew 4 years for one lunch, Idk about that for myself. Personally, all or my relationships are different. Some of them take a long time to form, but some of the others are just as strong if not stronger and they have been in my life for a shorter amount of time. So, for me time is not always a factor.", "euella_isis": "I’m exactly the same! I want my relationships to be like fine wine 🍷", "gurlieboo": "I totally agree 🙏🏽🙏🏽", "aye.ahbee": "I’m 50/50 there have been some people I let in my life quickly who turned out better than those I’ve known for years who have turned their back on me. In some cases it really depends on the person. But I do agree that it takes time to build things. That’s something I’ll forever take with me since my last relationship we move so quickly. For some it works sure but not always. Idk it’s tricky", "shayyyyb": "👏🏾", "upgradevee": "I’m slow✨✨. I enjoy organic connections.", "saran_j_vaughan": "This!!🔥🔥", "moondaddykylie": "Faster than four years 😂", "ms_a_renee__": "Fast friendships are okay, but I side eye the fast marriages. To each their own..", "y_v3t": "Couldn't agree with you more. I feel the same way.", "florenceis_amachine": "💗🙏💗💗💗", "melaboricua": "I started a fast friendship at the end of March, we became inseparable, calling/texting everyday, every minute basically, and hanging out as often as possible, the friendship ended in June. It was a fast friendship, other things came into play, like I think we both had secret feelings for each other, and at the ended started to push me away, to the point where he wasn’t there for me as a friend anymore. Tbh it felt too good to be true but I thought the bond we created, he was a friend for life. Fast forward to now, we are cool, text here and there but not even close to the same. Lol sorry for long paragraph !", "lovemadebytina": "I am usually the take your time get to know someone but I met my wife it was literally love at first sight and here we are four years later going on our 5th Year married", "eduarddollar": "🙌🙌"}