{"_patriciadlrr": "You have your own crowd, regardless of what ppl say, we (your crowd) need you.... so one day we can let go of our fears too. ❤️", "davidkingsley29": "yea", "rfc_ent": "@enjoyjaredbrady 🔥🔥💯💯💯 my point exactly", "tapialuky": "@sauudia I love it 😂", "andrene.france": "Girllll! Watching you on E right now! Sooo proud!🙌🏽❤️😍🔥 To hell with the haters.", "brothersincereteach": "🔥🔥🔥🔥🔥🙌", "smilebklyn": "Shannn! What’s the video called about the couple where the girl was always arguing with her partner but avoided/bit her tongue with coworkers and everyone else? I can’t find it on your page but I need it. 😩", "haitian_goddess1": "I felt that!! I’n my soul🙏🏾🙏🏾🙏🏾❤️❤️❤️", "aliciaann_wildercrafts": "Yesssssssssss", "fionaseigneurauthor": "Happy 2020. All best, it takes courage and incredible inner strength to speak openly as you do about dating, sexuality and relationships. Grateful came across your videos on Youtube. These words spot in too. Thank you for sharing", "edscarbro92": "@chelseaholder", "evesconvo": "I've seen the criticisms and frankly, I don't understand it.I suppose people who are close-minded find it hard to keep their mouths shut. But opinions are like assholes, right? Everybody's got one. I hope 2020 will be a fantastic year for both you and you sexy hubby. I recently purchased your book on Audible, and will send my daughter a print copy. She thinks you're amazing and so do I! Sending virtual hugs and kisses while I'm rockin to Enjoy ya Life! Cheers", "inspirationallife_guru": "I think you are terrific!", "aprilbloom16": "I just realized what the wings were", "enora.ysa": "🤣🤣🤣🤣🤣 🙌", "worthwhilepick": "#rightsforsexworkers #sexworkersaremoreimportantthandoctors", "1999starchild": "Nice🔥 keep doing you🌸", "zac_88street": "That pussy stink", "afrodelik": "LOL!! Love this", "sarahcrazychild": "@jordana_antonia", "rrruum": "@quhkui", "ajaysaju_": "❤️", "winnieharlow\nVerified": "Verified", "kisstina__": "@sampolletta_", "elite.thinker": "I’m too emotional for this. But I felt this on a thousand and thank you for sharing", "maria_sophiarb": "❤️🌷", "kalis5": "@partyscrooge", "exkluzive": "🔥🔥🔥", "zhaylinn_": "I love that picture 😂👏🏾", "love_tiahhhh": "🗣🗣🗣🗣", "everybodyhatesjoel": "Hold on, now I understand the message, but my main question is... are those pussy lips?! 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "yourdreamvacation_st.lucia": "amazing thanks for all you do!", "findingangelaetc": "Hey! I dmd you! Saw some skincare stuff on your story. She really helped me with my acne. Did wayyyyy more for me than the derm did. She’s in Sherman oaks (:", "notyourwifeyy": "Flap away bitch @missbrittani", "_mrssab_": "👑♥️", "coconutsandhoney": "Every word. ✊🏽", "jblaze": "Yes whole heartedly agree🙏🏽", "aldon_d_gr8": "Well said Shan. I love your statements & look forward to being your IG 'friend'", "justbeingmesh": "Powerful message", "blessed__beauty": "😊", "evasands08": "❤️🙌🏼", "your_sex_educator": "I love love love what you do🔥🔥🔥❤️", "straightup_0": "Always freaking crying 😂", "allegra_miaaa": "@taj1999", "im.blessed.88": "😍😍😍😍😍🙏🙏🙏🙏🙏 I love you girl I remember when I first started watching you n amber YouTube videos then went live on you now you have grown so much in your career confidence and self love came along with that. Stay strong minded don't just focus on one thing keep busy continue working don't bother looking back keep moving forward you got this #empathabilities", "ramie2.0": "💗", "niecydny": "You got this!! 2020 love! Continue to be you and blossom on!!!!!b", "ljsbrand": "I adore you @shanboody 💗 You’re one of the smartest, toughest, most caring people I’ve had the pleasure of working with. Your courage to be open and honest is an inspiration 💫 Cheers to an incredible 2020 my friend 💕💕", "1cheekylittlemonkey": "Your one dope chick! Let no one and nothing hold you back. Personally i love the knowledge you drop it keeps me feeling informed and stronger in myself and my relationship. Soo i hope to see more of you in 2020 and i definitely can not wait to get cracking on your book💖👊", "naturealsupplements": "Love, love, love your sincerity and message 👑🖤✨", "mylittleyoni": "🙌🙌💖💖", "sweetlady.jm": "❤️❤️❤️", "tbaby3107": "THIS👏🏾👏🏾", "iykyk2000": "Why not post more content about your craft and to help educate ppl rather than complaining about ur own personal issues 🤷🏻‍♀️", "lone.body": "💯💯💯💯💯💯", "kerilynh": "I love and appreciate you and the work you do ❤️", "mama_sid85": "👏👏👏👏", "vibhupandit1": "Nice one", "_emeraldb": "Ffs😭😭😂😂😩 love u Shan", "sophiasocean": "Loving u 💜💎", "pascalle_": "👏🏻", "xoxosweetshay": "Yaaassss💯💥 2020 will be an awesome yr for you!!! Xo", "vanessacraft\nVerified": "Verified", "bryceena": "Looooove this message! Where can we find that J Brady song?? 💕 Anthem all 2020!", "enjoyjaredbrady": "❤️❤️❤️❤️", "dashbarks": "YOU DEEPLY INSPIRE MY SOUL🖤", "thephilipmichael": "🙌🏾🙌🏾🙌🏾 good message too! U a real one Shan! Thanks for always educating ways for the people to have better sex! 💯", "sh0pwork": "@shanboody love your transparency one thing that helps me to overcome negativity is writing a letter to each of my enemies and oppressors day it out loud then burn it🔥🙌🏾 metaphysically you are calling them out and destroying that negativity. Praying for you ❤️🍷", "alexis_phaya": "@audreymohr @jvdelaney love this", "msbossalady": "@shanboody what’s the name of the song?", "pr3ttypr1": "😂", "wtf_gabbie": "WHO IS THE.MUSICAL ARTIST?", "djphatz": "It’s okay to cry but you cry a lot be confident in who you are and the energy you keep it’s never a mistake", "michellef_ig_": "I was meant to see this post. Halle(fucking)lujah", "barenakedkaties": "Hubby at the end wrapping it up for you 🙌🏼", "itslaurapaola": "I couldn’t say it better ❤️", "julieta.halblaub": "❤️❤️❤️❤️", "kickinitwitkc": "\"No matter what you do, someone somewhere is going to disapprove, so might as well choose the course YOU are proud of.\" Yes mama, preach!!! 🙌 Love you and thank you for your work ☺️💖 @shanboody", "sehabe": "❤️❤️❤️", "jovial_soul": "TRUTH 🖤", "mieshashih": "Thank you Shan for your positivity, strength, spirit and inspiration.💜", "yoliscurlnetwork": "Facts", "basketballdiva71": "Luv thid🔥🔥🔥🙌🙌🙌", "realbryannaalexis": "This caption is WOAH! Yes🙌🏾", "fly_jamaican": "🔥🔥🔥💪🏾💪🏾", "natalialeemuriee": "Favorite caption of 2019", "chaldea_lynn": "Good message...This picture took me out tho 😂", "missmegmadn": "👏🏼👏🏼👏🏼", "ashleyvonallen": "❤️❤️❤️❤️", "livewithlisachang": "This is everything 👏🏽. Thank you!! 🙌🏽", "davidastyles": "love you @shanboody happy NEW year", "therealdiamond2020": "🔥🔥🔥🔥", "ni_john": "🙌🏾🙌🏾🙌🏾 What is the name of that song at the end?? It was a a whole mood", "ardefour": "luvu and all of your work. 🙏💞", "womenwhohowl": "You go lady @shanboody. Even though it’s sometimes heart-quenching, there’s always such a beautiful reward in being your authentic Self and staying anchored in your sparkling truth. It might force others to reflect. I might upset them. It might frustrate them. But we’re doing our work in holding our heads high and keep shining the light of love and compassions. Inspire by being - others reactions are not your responsibility (unless we ignore the principles of respect and love). You are wonderful. Keep doing you. Over and over again. It’s the most beautiful gift you can share with this world.  Happy almost end of the freaking decade 💃🦋", "ashleynicole_anml": "😭😭", "beckylbrooks": "🙌🏻", "a.stylesme": "I appreciate you being so transparent and posting this! A great way you view life! Thank you! 🙌🏾👏🏾❤️", "germaine_nimundele": "I cannot! 😂😂😂😂😂 @abigailabraham", "aka.hubby": "I f*cking love this so much", "curlymisfitsss": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "char_wilcox": "Love u ❤️❤️❤️", "tea_and_we": "@shanboody that’s part of being authentic, dealing with the negative emotions that come with being real but then choosing to let it go and let it be. Also love the attitude of dis music 🎶", "rae_diamond": "Love this ❤️", "ana_504_": "You are very inteligent & super gorgeous ❤️", "rturnofthemac_": "🙏🏻🙏🏻🙏🏻🙌🏼🙌🏼", "shante_loves": "I love ALL your post but this one is my FAVORITE!!! Thank you for being you ❤️❤️", "millyjazz": "🙌🙌🙌🙌🔥🔥🔥", "akilahjamila": "💯🔥", "justbeingmyself13": "Exactly, if you care about other people opinions, you will never get anywhere in life. Live for you not for the approval of others because at the end of the day Who pays Your Bill's. Only you!!! PERIODT", "86akyin": "❤️❤️❤️❤️❤️", "jmitchearley": "🙌🏾❤️🙌🏾", "jennydek7": "Love this so much - much love to you ❤️", "isabel.espinozaa": "Facts!!👏🏽👏🏽", "prizeviolet": ":cabbage patch: love all of this!!", "goddessy_gold": "Thank u, I needed this..your courage means alot 🙌🏾", "kimfeezy": "Phenomenal work!!!! 😭😭😭", "_lakoi89": "I so needed to hear/read this 💙🏁", "nikkakarli": "🙌🏽🙌🏽🙌🏽", "sincerity4": "🤣🤣🤣🤣🤣", "sterlingvictorian": "@amberscloset knows ill lay spiritual proverbial loving hands on a hoe if they try it! 💜💜💜", "tarisse_king": "Me and you @sarritaking flying away with the beef curtains 😂😂😂", "smilebrite2015": "Carry on Mami💃💃💃💃", "_build_environment": "Well done mate ❤️much live Australia", "allthingsang": "Amen! 👏🏾👏🏾👏🏾", "shani_lea": "😂😂😂😂😂", "crystalrw989": "💯💯💯", "jannesa_nuce": "Hahahaha yaaaas 🔥😂😂", "transformationofself": "Soooo much hate. Keep rising queen 👑", "joshuatelfer": "@davidtherobot 👌🏾", "angelmika2010": "Ok...the first pic caught me off guard that I spit my juice everywhere laughing 💖", "ethioqueen_12": "I had circum to the same conclusion on Molly lol . I was literally hold myself back with my beliefsystem that didn't support me . 💕", "iamdanivc": "Success brings, major haters, leaches, cyber bullies, etc. Take it to God and he’ll handle them for you. Wishing you health and protection. God bless you 🙏🏽💕", "estherricco": "This is too die for! I love @shanboody for this!!!!", "ashleemueller": "Shan👏🏼 Shan👏🏼 Shan👏🏼 Shan👏🏼 (starting this chant, you deserve it.) Thanks for everything.", "lareina_prana": "Where can I find the flow 🎶 on the 3rd post?? I fr fr want this to by my 2020 anthem 💕💕", "almost30podcast\nVerified": "Verified", "ww.mayra": "♥️♥️♥️", "nadenesuzi": "Fuck yeah girl! Always do you and the right people will appreciate the hell out of it❤️!", "hey.there.valerie": "@janel_serrano this is such a good post!!!", "skyetownsend": "HAHAHAH", "msangela_amor": "This just SPOKEEEE TO MEE 🙌🏾", "queenxperrierin": "BEST THING IVE SEEN 🙌🏼🙌🏼🙌🏼🙌🏼👏🏼", "kayy_blair": "👏🏾❤️", "reesiebabe": "Do you boo!!!", "garden.bum": "Such a great post! THANK YOU! 💗", "nianay97": "What is that song? ❤️", "sarah.a.mahoney": "🙌🏽🙌🏽🙌🏽 thank you for being you.", "beauti_flaw": "♥️💯🔥", "iambridgetkelly\nVerified": "Verified", "mayasworld\nVerified": "Verified", "iamdimirae": "🙌🏽🙌🏽🙌🏽🙌🏽💯", "israeltorrellas": "@shanboody what’s that song. Sounds good.", "saranleoni": "🙌🏼🙌🏼🙌🏼🙌🏼❤️", "shesthedopest": "👑", "young_art.sr": "@remy_man_3", "this_is_bernie_": "@jess_knoetze 🤣🤣🤣 rolling on the floor!!!!! 🤣🤣🤣Tooooo funny", "kerriisms": "This pic is so hilarious!! Can’t even! 😂 This is a great message. Each year we become more of ourselves through these lessons. Some lessons are challenging AF, but they’re all gifts. Your work and dedication to this field is a gift. Thanks for sharing it with us and a happy 2020 to you! 🙏🏾✨😍", "loyobofit": "Wow. Thank you for all that you do and for your honesty in posts like this. Please keep doing YOU. You are so needed.", "queen_zoe_4eva": "💯", "seaofmarina": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "crystal_ball": "I love Jared’s song is it on iTunes??", "gbreal1971": "Keep doing what you do so well. Also, I’m feeling that music clip🙌🏾", "sarita_wildrose": "You inspire, mama. Thank you for sharing your vulnerability and truth. Sending love from the magical island of Kauai ✨🌴🌈 Keep loving.", "sherrined": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "mrs__kimes": "❤️❤️❤️❤️", "write_dance_travel_repeat": "Sooo true 💯💯💯💯", "2marbrown": "Thank you... Thank you", "tonyxtones": "So real, thank you 🙏🏾", "ebonypj": "❤️❤️ Your husband sings it best", "amanda_parris\nVerified": "Verified", "mary.kathryn.davis": "Credit @davidtherobot 🙄", "flip4gina": "Yassssss! Preach Sister!", "thenerdzzz": "Picture speaks volumes", "daisiesandflowers0325": "I need a picture like this 🤣", "keenamartineau": "@itsdivadani", "cocoaolivia": "🔥🔥🔥", "livewithanita": "Yes girl!!! Yassssss! 🔥💯 Keep killin it!!", "ladyoftheuniverse": "Oh he said something lol okay that makes sence.I was like huh sainene? Lol", "labeautyologist": "This is so real. YES.", "missniccosmic": "🙌🏽", "iamchrisnicole": "All I did was open n Instagram n this is what I see 🤣", "imjaidoee": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "therealerio": "🤦🏾‍♀️😂🤣😂", "tvnyx": "the adventures of shanboody and her flying fanny flaps 😂", "mrsbrydson": "I love this. Found your channel last night, and binge watched a lot of your stuff. I didnt realize you lived in Toronto!!! I live about 1 hr east. Wow. Super cool. All the best in this new year. Keep doing you! ❤️", "maria_manias": "👏👏👏👏👏👏🔥🔥🔥", "miss_coke": "🙌🏾🙌🏾🙌🏾 This", "james_earljones00": "Cool pic", "tianapollari": "This post is everything 🙌🏽🙌🏽", "chelseakantor": "credit @davidtherobot for the original artwork?", "maggybearlovesyou": "Yes to all this and THIS FIRST IMAGE THO 😭😭😭😭😭🌈🌈🌈🌈🌈🌈", "glow_mobb": "I’m feeling this with my WHOLE soul girl. For real. Leaving them all in this decade.", "itsdavidsolomon": "🔥🔥🔥🔥👑", "rachelsavb": "Lmao I love how the nippies are covered up yet the giant labia wings are the heart of the painting", "annaikeerbes": "He sounds like Russss lol", "terezakovarik": "Dear Shanon, I never comment or like your posts because I am not very active on social media but needless to say, I am your big supporter. I believe there are so many people like me so whenever there are haters showing off, please, know there are silent lovers too. Much love from the Czech Republic, thank you for everything you have done for us.", "jaynasoul": "❤️❤️❤️", "elizabethvictoria126": "❤️🙌🏾", "jramos_1129": "👏🏼👏🏼", "areandbecreative": "@coachedbyhayley", "thecharlessmith": "This pic will forever make me wince lol", "emrr__": "Spoken like a true Queen 🙌🙌", "cynthialoyst\nVerified": "Verified", "academic_bae": "Lots of love Shannon! You blessed us with so much knowledge and empathy. You are so genuine and I feel that you want people to win. You are getting stronger with everything they throw at you. I have learned so much from you. Things I wished I’d known for so long. Things I’d wish my mother would’ve taught me. I am currently 25 and I see you as a big sister figure. Your love and your personality, your Truthfulness comes out during everything you do. When I watch a video - I feel as if you’re talking right into my soul. Let’s make 2020 even more glorious ❤️ you are my role model. Everything about you is magic and when I watch your videos, I feel as if I get a little bit off of that magic too. Sending you so much love!! I learned so much and finally don’t feel caged no more due to your work. You selfless, lovely blessing! ❤️ Thank you so so much!", "selflovesupremo": "I love ya posts fuck them lovingly ♥️♥️♥️♥️", "dlitefulz": "🙏☝💪💪🎁💜🎁", "dejariley\nVerified": "Verified", "samanthagberry": "Grateful for your 1-of-1, purpose-driven power-filled voice Shannon! 💯💚💯", "warrior.cdv": "Thank you from the bottom of my heart!!! This means so much to me💗💗💗", "unattachedandunbothered": "BIG FACTS! You’re such an inspiration. This is a lifelong lesson 🙏🏿", "pugh.elle": "You are super duper amazing ❤️❤️❤️ Don't stop doing you", "birdylyn": "Exactly.Keep going.❤️", "heysounloving": "you are a BEAST for dealing with all the haters!! being yourself and breaking societal norms is not easy!! im so proud of you and thankful you use your platforms to say everything ive always felt❤️", "iamher_monica": "Others opinions don’t matter until you agree with them.", "mscurvyfitzy": "❤️", "_shellynatikigraves_": "Yaass, especially to that last part.", "monicadiazprz": "Amen!", "sts.toronto": "YESSSS YESS YESS. THANK YOU FOR BEING YOU 👑 you inspire.", "kurious_katie": "♥️♥️♥️♥️♥️", "tlchub": "So inspiring gurl! I rep this in its fullest! Soar on to greatness!!!", "reshmichetram": "👏👏👏👏", "_amiramohamad_": "...”Talking to me or unintentionally to their own Insecurities through me.” I felt that!", "l.mae_servesva_realty": "🙏🏽", "kilosexgod33": "Dudes shirt is so sick! 🔥", "elleedwards_inc": "Truth", "uzuriiyanu": "I really needed this today!! Like, you have no idea. This gave me hope for 2020, a new year, a new me, that is strong, and won’t let the words of others affect me. I love everything you do because you’re so inspirational! I might need my face photoshopped onto that and made into a poster for my room😂♥️♥️", "mstaysh": "I love this beaut👏🏾 thank you for these words ❤️", "nicr0se": "💯 well said!! I love your work and awesome to see this from a fellow Toronto-ian!! Keep it up girl💕", "missmistryy": "Beautifully said, all the best in 2020 and beyond 💕", "kristenward1": "You are loved and admired ♥️", "shirleydor_": "Dead Shannn", "moemonimo": "🖤🤣🔥👏🏼", "ednasey": "Guuuuuuurl! You are right on point!!! Thank you for sharing your life lessons! You're helping with your words! ♥️♥️Happy almost 2020😘😘😘", "thamissez_": "Love your words 🔥", "shiba_loverrr": "lol this is such a thoughtful message but I also love the sprinkle of shade", "the.wellness.dialogues": "I’m glad you’re have the strength and resilience to keep going amid criticisms. Despite knowing people project their own stuff on others it can be a struggle to not take it personally. You’re an inspiration and I admire how you are able to be vulnerable in this space ♥️👏🏽", "drsteveperry": "I’m rocking w you. Much success.", "cocktailsandconfessions": "Keep doing you! You’re doing it right! Shine on! ❤️", "lifeofradiohead": "I think you’re amazing 🙏🏽", "trey2breezy": "@shanboody Is that u spreading your p*ssy lips", "teytyme": "Beautiful 💜🌟🌻", "alphaleedah": "I fckin love this.", "tri_aldr": "Love this post!!! Amen", "a.jenifer_": "Stay strong my love ❤", "lilnlizzie": "Yes!!!! ❤️❤️❤️", "artebbe": "You are such a force!! ♥️♥️", "jacqueartistry": "Thank you Shan!❤️ Proud of you, these words really touched me 🙌🏻", "keepitkosherr": "“Your responsibility begins with your intent and ends with your impact.” Thank you, Shan.", "l.henrythegoat": "Absolutely", "sharia_lanae": "Your the best!!! Keep shinning and sharing your gifts with the world. The ones that matter loves your truth!", "missdaisy79": "All that ! ☝🏾🙌🏾", "shewshoe": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "treign4": "Yessss 🤣", "cafeandjesus": "👏👏👏👏", "mo_jito209": "👏🏽👏🏽👏🏽👏🏽❤️❤️❤️❤️", "nadiamoham_beauty": "💯!!! Apparently Many of us had to learn this lesson this year, myself included...you rock @shanboody keep doing you girl 👏🏽👏🏽👏🏽", "yongfaces": "Labbbiiiaaaas 😭😂😂😂", "mlxbla": "❤️❤️❤️❤️", "shabeda": "❤🔥💯🌹", "duhhhhboss": "Lmaoo this gets me every year😂😂 luv ya spirit bishh", "missarie1411": "I love this. @shanboody You're never afraid to show your strength through vulnerability & emotion. You face it head on and also share it with us. Looking forward to following your journey in 2020 and beyond!", "kailynnwright": "I adore you so much", "lucia_elmira": "Spot on ❤️🌟", "elaishajade": "Energy for 2020. Thank you for this.", "high.n.healthy": "❤️❤️❤️", "scorpio88mystique": "💜💜💜💜", "classociety": "Lovers gonna love that’s more important. 🙌🏼 Jared’s verses are a nice touch to this whole message. 👏🏼✊🏼", "ekoidstudio": "❤️", "queen_paninthecity": "🖤🖤", "_bree_805": "👏🏼👏🏼👏🏼👏🏼 yass girl!! preach needed this today might look at it every day until i get it through my head. thank you 🙏🏼 @shanboody can you also tell me the name of the song at the end of your post please!!", "tonisofiabeauty": "Well said. I completely understand this and will heed these words :)", "camfromdt\nVerified": "Verified", "amourisssima": "Haha give @davidtherobot some credit!!", "melaboricua": "Will always love and support you Shan ❤️", "lanecia174": "Chile I'm diggin this ponytail he rockin! Yaaassss natural come thruuu", "catta_lyst": "😂That pic is so funny I love it ❤️", "faith__warren": "All is this 👏🏽 👏🏽 👏🏽", "stella.shinee": "👑👑👑👑", "shock151": "🎶\"Flying high upon the wings, of love.\"🎶", "lilacinfinity": "I love this photo ❤️", "msmoszee81": "Stop crying on the Gram, Is on un attractive😤😤😤", "kenyaste": "My fave annual pic!", "itsme__bahar": "👏🏼👏🏼👏🏼😍😍😍", "theelizabethgo": "Great post! Almost 2020! 👏🏽👏🏽", "the_dr_sous": "😂😂😂", "am.bolyn": "I love this holy crap 😳😂", "donyellkennedymccullough": "Shannnnnn.... THIS 👆🏽RIGHT HEre... Confirms you ARE a Beauty & and BEAst!!!! You are ready for all manifestation coming your way•2020!! ❤️-U!!!🙌🏽👏🏽👏🏽👏🏽👏🏽😉😘🥰", "ms.bruno": "👊👊👊", "saucydumpling": "What song is Jared singing at the end??", "lavie.josie": "I love this whole post. First slide, it reminds me of @johnleguizamo comedy special when he talks about his first sexual experience and #mothra ... the 2nd because you are vulnerable and honest, the world doesnt deserve it but we should appreciate it. The last, because it's your hubby supporting you with his own art and that is just beautiful. ❤️", "iamsahararose\nVerified": "Verified", "mrvslw": "So glad i found you! Sending you BIG love", "aishabeautiii": "Loving all you do girl @shanboody Congrats to you!!!!!", "chia_habte": "BEST❤️", "tanyateanna": "Lmfaooooo", "openmind_openears31": "❤️❤️❤️❤️💯💯💯💯💯", "valvirgogirl": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽💕", "glographics\nVerified": "Verified", "xochelleo": "❤️🙌🏼🔥", "ferguson.tashana21": "👏👏👏👏👏🙌 yess @shanboody you're a true Caribbean woman", "fly_away_emry": "Why do ppl care if ppl cry on Instagram it’s the same as crying in real life and we all have a right to cry or express our emotions in a way that we choose. Just font watch videos of ppl crying if you don’t like it. But don’t tell ppl not to cry 😂", "syl4008": "💕 shine bright! I love your content and what you express. Fuck haters", "_cookiebunz": "I need to hear that whole song from Jared!", "five12studio": "You are an incredibly strong and intelligent woman. That strength scares people but that’s not your problem. I love seeing your growth and can’t wait to see what 2020 does for you. 🖤", "sheealw": "A whole vibe... like I owe you something ....Ion’t owe you nothing!", "shauntedenee": "@shanboody heavy is the head that wears the crown! I’m grateful for you and how you are helping others!!!! Also you husband is very talented wow I wish you more success in 2020 ❤️", "jae_be": "“...deciphering when people are talking to me or unintentionally to their own insecurities through me.” This one line alone. Thx Shan. Happy almost 2020✨", "marlyndy_chef_dy": "Hi , I don’t really understand the image can you explain @shanboody", "julietxjuly": "This.. 🙏🏽", "powerintheplants": "I love u", "theblackoc": "💯🏁", "milano036": "Keep shining girl!!❤️ FROM Amsterdam 💋", "pharcart1": "Facts!", "bodaciousmonet": "Preach!! You must speak life into yourself!!🔥🙌🏾💯 You have to believe before anyone else will", "taymocha\nVerified": "Verified", "thetracymoore\nVerified": "Verified", "cynthiaakacynth": "Fuck me I love all of this! Yes gurl 🙏🏽🙌🏽❤️", "lilsooz2882": "💗💗💗if people start hating you’re doing something right! Keep goin Shan!!!!!!!! Ps: which song of Jareds is in the clip?", "zd_gant": "👏🏽👏🏽👏🏽", "lyfe_n_wordz": "💕💕💕💪🏾💪🏾🙏🏾", "artsy_gypsy_hippie": "I love you @shanboody I had no idea I needed this pic today, but look at spirit. And the caption 👏🏽 😂 ✨💖", "faceatwa": "🙌🏾❤️", "montamusinska": "Wow! Thank you. So so so true and needed. And you do you, it's all that matters 😍 you came here to bring the best of YOU not the collective fears and do's and don'ts. We have enough of that already. 🖤", "shoneski": "💜", "ms_scrumptious": "Running around my house singing.... MOTHER FUCKER I OWE YOU NOTHING.... I Love Yall... Power Couple.... Beyond Beautiful... 🎤🎶🔊", "dwntwnwrld": "❤️❤️", "sashaexeter": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "thecrimsonkiss": "🗣🗣🗣🗣", "livtruwithmichellepena": "❤️🙏🏽", "_artofhealing": "Yes! And that song at the end 🔥", "aishathalia": "Amen to this entire caption 💙", "dswakhsr": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "sonnie_888": "i discovered you last year in 2018, during a time where my parents categorized my sexual curiosity as a “sin,” which derailed me to believe that my OWN sexuality was ungodly. OH MY GOSH. i can full hearted & genuinely say that i love you. you are an incredible human being that i admire. now i have created a mentality that’s based on the foundations that you preach, like “confidence is a practice.” i’m 17 going on 18 (don’t let my age scare you 😂 sexual education is essential & ageless) & i’ve definitely seen a transformation w/ allowing myself to tune out society & to finally listen to myself for once. thank you for being you & i’m so proud of you <333 p.s. your book just got mailed to me yesterday :))) 😘😘😘😘", "lush_and_lashfull": "❤️❤️❤️❤️", "lilyyawson": "🔥🔥🔥🔥🔥🔥🔥", "j.meiah": "“it’s a new dawn, it’s a new day, it’s a new liiife for meee ... AND IM FEELING GOOD!” 💆🏾‍♀️ Love it Shan! Keep pushing 🤎", "opalellyse": "This is so hilarious to me cuz it’s my coloring as well😂😂😂😂 in all seriousness I discovered you over Christmas break last year and the way you won this year is phenomenal!! Criticisms will come cuz you’re doing your purpose and our purposes are Gods work, it’s good over evil and there will be haters. #YoureWinningBig love🙌🏽✨", "friendswithagenie": "When you speak it sounds like poetry. I think you should write a book. Oh wait you did! You be killing em! ❤️ I adore you and this post resonates with me so much. I’ve been on both ends of the toxic ridiculer and being on the receiving end. I’ve finally decided to just keep on doing me. So thank you for posting authentic you that speaks to my soul @shanboody 🌹", "intellectisbeauty3": "This makes me think of John Leguizamo's standup where he said she picked up her coochie lips and flew away 🤣🤣🤣", "she_humanitarian": "You are a beautiful woman inside and out. Period. ❤️", "ju1ians": "If anybody is interested the original artist of that illustration is @davidtherobot who makes all kinds of “interesting” genitalia drawings lol", "laignerlmassey": "And your fine ass husband has your back! Girl I STANNNNSSSSSSSS! Do You. Your supporters and your tribe appreciate you for all the selflessness you convey. You Tribe Gets You, Shan.❤️💖", "adriennelives": "If they dont contribute to my heart, orgasms or bank account... DELETE. No emotion from me to fuel their energy. ❤️", "genieeeeeeeeeeee": "Girl I’ve watched you on a TUMULTUOUS road for years. No weak person can do what you have been doing and I can’t begin to imagine how much you’ve had to endure criticism or even questioning yourself and having to pick yourself up and remind yourself of your purpose in all the adversity. It’s so inspiring for someone like me, tho I know it doesn’t feel as glamorous as it looks. 🙏🏽", "atoyaburleson": "Real talk! Keep shining! ✨", "equitacosmetics": "Song lit 🔥🔥🔥", "sju_khb": "👏🏾👏🏾👏🏾👏🏾", "courtmoves": "Yes to this radiant energy!!! I just need to add my face on there cause this exact revelation is what I'll be working on, intent and impact🔥🔥❤️ love yooouuuu", "mrsblair": "Love This!! ❤️", "thebohobardot": "“Like I owe you somethin....MF I owe you NOTHIN!” 2020 mood.🙏🏽", "smithhea": "🙌🙌🙌🙌.", "corinnelson": "❤️ ❤️❤️", "shana_1love": "🙌🏽🙌🏽I love this❤️", "sidneyrai": "I felt this in my soul!!!!!! 💙💙💙", "maameks": "The strong Boody!❤️ Every word that you wrote went straight through my heart. You are loved by many and that is all that matters❤️🤗", "daria_tsvenger": "Yess! The more visible you become - the higher chances of being hated 😂😎", "yaphawebb2020": "Yes to all of this!! I live for this message and especially that photo.", "peaches_montana": "😂", "headeddowntomars": "I love this post. I can't wait to see what 2020 brings you! 💖", "geo_antoinette\nVerified": "Verified", "iamangeliquemartina": "😍 🙌🏼👩🏽‍💻", "que.beee": "@msjesmarie @jamia_leah 💜💜", "jessicamulroney\nVerified": "Verified", "k.e.h110203": "I really needed this message thank you 💕", "ashmvtine": "Who sings the song in the third clip @shanboody", "beautifyrainydayy": "🙌❤️🙌❤️", "shantellleann": "BARS🔥🔥🔥🔥🔥", "melaniehartnett": "so much yes 🖤 you got this", "ashleycambie": "Lmfaoooo 💛💛", "_conti": "How I felt after childbirth 🤣🤣🙈", "emilyrosenaked": "💯", "kristel.jnaz": "👏🏼👏🏼👏🏼", "tonitabonita": "❤️❤️❤️", "ajjaneendream38": "Facts", "wildbutneverfree": "Yes girl🙌🏾", "1.synthesize_2.actualize": "Ayyyee 💖💞💗", "kseeenniia": "💛💛💛", "fashionatmstee": "Such a beautiful message 🖤", "groundedwombdoula": "👏🏽👏🏽👏🏽👏🏽👏🏽", "thebirdspapaya\nVerified": "Verified", "kei_shantor": "This caption!!!!! Girlllllll “ The only words that can be weaponized against your character are ones that have come out of your own mouth!” A WORDDDDDDD!!", "_accio.joy_": "I needed to hear this. Thank you!", "_november_1145": "Love this @shanboody . 2020 is the year to start choosing YOU. 💜", "ness.ess.ity": "Your brand is so real. Already knew what it was before it loaded. Another year of Shan and our growth 👌🏾", "karinalouisesolis": "👏👏👏 preach @shanboody 🙌 🥂 to purpose, passion, and potential! 🎯", "drjolenebrighten": "Look, when you stay authentic, challenge the dogma and up level then it’s going to shine light on the stories people tell themselves that prevent them from living the life they actually want. I think this message you are sharing in this caption is something we should all be taught as kids. 🙏🏼❤️ Can’t wait to see what you’re bringing in 2020!", "tegaztoon": "Hmu for dope artworks‼️ good price Same day turn around time 💯🙂", "lydiamok": "Bahahahaha I BURST OUT LAUGHING"}