{"julliejolly": "Try the app ovia it's really good", "i_stay_miles_above_yall": "Have you ever tried Progesterone cream & detoxing... You rub the cream in at your wrist, where they check your pulse. You may have a built up of excess estrogen hormones. I used this cream & got pregnant after getting off of being on birth control for 7+ years. God bless🙏", "wanderlust__pk": "Thank you 💜", "qckeni": "❤️❤️❤️", "lizfoleyesq": "God made me see this!!! Everything you said is absolutely right!!! Every month when we get that no it makes us want the yess even more!! I know when God gifts us with His life that He’s created, we will know it was all we ever wanted!! Been waiting 4 months on this yes!! Also, been drinking water and working out lol", "delfina_eva": "@kierstyn__power This one got me in my feelings!!", "just_adeline87": "Hi new to your page but I just wanted to say it took me 4 months to get pregnant so it’s normal for it to take time maybe even up to a year! I hope it happens very soon for you and your husband! And I love your page by the way", "_l0nnie_": "I'm just now discovering her and this and I'm crying. She nailed it.", "grigrimama": "I love this ❤️❤️❤️ bravery", "kiaflora": "Thank you so much for this 🙏🏼 it’s so true and this awareness is everything. Thank you for encouraging others to speak up.", "mothernaturessandy": "Have you talked about your IUD experience on your show? I’ve wanted to get one for a while but heart an array of horror stories. I’d love to hear your experience!", "kissmyblackgritss": "I’m turning 46 in 13 days I a beautiful 19 YO she’ll be 20 in 6 days so I’ve experienced Motherhood. I’ve been trying and it’s been impossible so after Covid drama we’re gonna face the music and take some steps so we can be one of those awesome Geriatric pregnancy success stories God Willing 🙏🏾"}