{"kungfushezi": "So fine💕", "hayleydelaine": "So happy for you! You’re killing it. 🙌🎉", "princessdylan": "Now we need you to have your own Netflix show! Same concept that you are best at - dating and social experiments!", "sunnyd360": "I've seen the show.", "jcdoesads": "❤️❤️❤️", "nicchellenaomi": "Got so excited when I first saw it, I was like “I know her!” 😂 Seeing someone you’ve been rooting for (even though you don’t know them) getting the recognition they deserve is the best. Makes me feel so happy!", "heystephania": "I WAS SO EXCITED TO SEE YOU", "thatguynamedwy": "@cagra_", "francisneslo": "@nathievibes mana zij is zoooo amazing❤️", "twaambojlm": "Giiiiirl I went off. I shared this more than your links to your YouTube. I swear I was looking crazy. But OMG I was so excited for you. It's crazy because I don't know you. But the excitement I felt to watch you succeed. Is as if I grew up with you in my home. Which in hindsight,I kind of have in a way. I Love you so much. Keep going girl 🙌🙌🙌😘😘👏👏👏👏🔥🔥🔥", "heykris10": "Yes! I follow you!", "n00giez90": "So happy to see you on there!", "askbeans": "Shan you are everything !!! Thank you for sharing your knowledge with the world. 💕🙌🏾🙌🏾", "shayanacaesar": "I was watching too hot to handle and then I saw Shan and was like ayeee!!! This bout to be lit!!!", "aaexs": "literally screamed when u showed up", "alteredpoca": "You’re pretty much the reason i started watching too hot to handle 😂💙", "asap_pockyyy": "I’ve been telling all of my friends when they watch it “did you see Shannon?” I’m so proud like I’ve known you forever. I’ve been watching you since those girls were wild.", "lexis_lovee_": "I did the exact thing when o saw you on too hot to handle and posted it on my snap I’m like “Yassss it’s Shannon! I love this woman!” So happy for you!", "majortraeger": "Ahh me! I’ve been following you for a while too and got exited when I saw you on too hot!! ❤️❤️❤️🙌🙌", "thatsgaby_1": "Im younger than Shan and I’ve looked up to her for years now but I felt like a proud mom. 😂", "chynnadollyogi": "🙌🏾❤️", "k_nyxx": "I literally just screamed at my tv “OMG SHANNNN!!!!!! I love herrrrr” 😩😂", "_cerys.tae_": "I IMMEDIATELY went to watch hot stuff when I heard you’d be in a few episodes, and I’m so happy for this new accomplishment you’ve made. I love seeing hard working people succeed, and after so much work you surely deserve it!!! You are an AMAZING person that I look up to and learn from so much. Keep going Shan you are destined for greatness and I can’t wait to see where your ambitions take you!! @shanboody ❤️❤️❤️", "mizdnelly": "Yaaaaaasssssss girl!!!! Serve all that fierceness!!!! Loved seeing you on such a HUGE PLATFORM!!!🔥🔥🔥🔥 Been following you FOREVER!!! ❤️❤️❤️❤️ Keep killing the game!!!! One love!!🇯🇲🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 @shanboody", "j.dominique": "I really was so upset that they weren’t as star struck and excited that you were on the show as I would’ve been. I was like OMG it’s Shanboody I love her", "ms.todd": "Congrats Shan! ✨", "anastasiacreative": "I literally screamed “OH MY GOD ITS SHAN I LOVE HER SO MUCH LOOK AT HER GO” to my TV, so yes. This caption is very accurate. 😂🙌🏼", "shivonneallagoa": "💘", "bravemia21": "You are absolutely amazing and have such profound words of healing. Can't wait to learn more from you @shanboody 🙌🙌🙌🙌💞", "icoemts": "❤️❤️❤️❤️❤️❤️ We love you Shan! I was so happy and exited to see you appear 2 times at the show! I was like Dammmmmn they loved her YES💪🏼more opportunities and exposure for our girl 💃🏾♥️♥️♥️♥️", "spirituallydope": "We love uuuuu", "tor.i.rot": "anyone have advice for dating a man who is in an open relationship? hes very communicative and I'm open to keep getting to know him but I am also a little hesitant because I dont have any experience with open relationships", "msonyinyen": "Lol I just saw you come across my screen and just scream like , Yessssss!!!!", "0912esme": "yesssssssssssssssss", "amiianectar": "I WAS SCREAMING IN MY MANS EAR “GO AWFFFFF SHAN”", "alice_at_your_service": "Read your book, started following you, then saw you on Netflix, all within a week! The universe is Not Subtle! 💙", "heavenforthewin": "Definitely my reaction when you popped up on that screen! So happy to see you SHINE! ✨", "kiannajay_": "The way I screamed when I saw you I was like omg I’m sooo proud of you 🙌🏾❤️", "jean.talon": "Congrats 🥳❤️👏🏽", "hersheydomme": "Wow you’re so awesome. I literally always learn something new from you. Today it was a new word, s/o to mitfreude 👏🏾", "l.o.v.e._life": "Wow very cool! Thank you for sharing", "kraeprepared": "Learned a lot from@this post. Thank you.", "daka_taongapatience": "Could you please list the books you were reading when writing the game of desire...I see them your highlights but the titles are not so clear. Thanks @shanboody", "mike_rophone_": "Watching the show I had to immediately tell my roommates ***oooh shit I follow her on ig, she talks about sex and relationships** @shanboody", "daniela_raise_your_vibration": "You are amazing. And super hot!", "aohdav": "“Mitfreude” 🔑🃏❤️", "ali_phillips09": "Loved seeing you on the show girl!! Definitely had such a sense of pride 💕💕", "mmamitah_": "We love youuuu Shan!! I was also superrr excited to see you on HHTH!", "glographics\nVerified": "Verified", "a_k_johnson": "@stkajo", "gwenelliot": "💗💗💗💗 Amazing!!! I’m watching you on the show 🤩🤩🥳🥳", "madimcewen": "Yessss I was watching this show with friends and raving about you to them!!!! Been following you for 3 years you are amazing 🔥🔥", "morgan.hutcherson": "I was so excited to see you on there!", "rachelzo": "I was so excited to see you!", "jd_maner": "🙌🙌", "shanta_sturdivant": "https://join.cashgem.co/ssturdivant13 this app is free to use and will pay you straight to cash app. Easy money! See for yourself", "rosiegrier_": "You’ve had me flexing that Mitfreude harder than anyone else I’ve never met in person! Whether you always believe it or not, you are consistently SUCH a phenomenal trailblazer for so many people and we greatly appreciate you for it 🏆❤️ What you do undoubtedly opens doors for my future career so THANK YOU SHAN!", "thewhywomenproject": "Ahh you were the best part of the show, go Shan!!! Yoni Puja should be part of sex education for all people with vaginas and their partners! Loved your second episode. ❤️🌷👑", "eduwaaa": "Yesss loved it sis 💕", "tarynsouthern\nVerified": "Verified", "moka.indd": "loved to see you on and told all my friends about your work!! so amazing to see you up there, so deserved", "stillnotdefined": "Thank you for what you've given us ❤️", "ohhthatsjustsyl": "I was one of those people who popped up and yelled!! 🙌🏽", "bbellis_": "I felt the same way when I saw you on the show !!", "nayaamran": "Every time I see your face, your work, or your art online I smile inside. Keep killing it sis 💕✌🏽 love from home 🇨🇦", "beatriz_pc": "What!? Guess I will have to watch this show...", "milly_melly": "❤️❤️❤️", "createhershq": "Well said!!!", "carlychoppin": "I just started getting into your youtube channel and you instagram profile!! I love the work you do and i love learning from you🌟🌟", "empressshady": "I see you boo get that bag...... @shanboody", "junglejiminsta": "From my rusty High School German, it says, literally, \"With Friend\" or \"With Friends\"...", "theshelahmarie": "I was yelling at my screen too! We love you! ❤️", "documen.tary": "Love to see this growth❤️❤️❤️❤️", "rahumathbv": "Amazing ♥️♥️♥️", "allysanford": "I watched the show just to see you in it! (I am not a reality tv fan) Love you Shan!!!", "_callmesilver_": "Well...now I have to watch.", "_theealainanichelle_": "I literally saw you on there and was like OMG I HAVE BEEN A STAN WAY BEFORE THIS HOES! Glad you’re getting the recognition you deserve 😍", "kerriisms": "Yessss, love it!! 💕", "ariesval": "Yes I was so SHOOOOK to see you on TV! Was a proud long time follower moment 😭❤️😍", "honeymonet": "Soooo happy to see you on there 💕😍", "whyisalextaken": "We love you!", "therealfookiebookie": "💛💛💛", "bethexotic": "We love you Shan 😭😭😭😭😭😭", "tiffanyperdigao": "Actual conversation: Me: Holy shit it’s Shan. I love her! Husband: Who’s Shan? Me: The reason for my vibrating necklace Husband: Ohhhh Shan. I love her too 😀", "heykd": "I definitely yelled at my TV, proud of you girl!! 🙌🏾", "mrsbrydson": "Yes, I was so happy to see you on there twice! So fun! ❤️ what was the experience like?", "monica_edelhoff": "Well now I gotta watch it ...", "melaboricua": "Girl I was ABOUT To turn it off until I saw you’re beautiful soul come through. I am so proud of you, you are amazing and proof of when you do something with pure and good intentions good things happen, even if they take awhile ! You keep growing baby girl ! Can’t wait to see you in more everything !", "curvycams": "Just saw this episode of Too Hot to Handle today with your bondage exercise and was fanning out! 😍😉", "fiathascorpio": "I just finished watching the whole thing and I honestly wanted to scream and jump when I seen you ! buuut it was 3am so I had to contain myself 😂", "meldixonn": "❤️❤️🙌🏽", "pieces_of_dee": "Now I gotta look at that show🤦🏾‍♀️🤦🏾‍♀️ I was uninterested until now!", "__nivaine": "My friend and I both yelled at the screen and cheered when you came on!!! 🙌🙌🙌🙌", "mayasworld\nVerified": "Verified", "wanikos": "❤️❤️", "adaaleide": "congrats shan! been following forever and i’m glad you’re receiving the recognition you deserve. thanks for all you do <3", "komalminhas": "I only watched the section of the show you were on!! Such a transformation you took them through! Keep crushing!!", "gorgeous33_": "I was so pressed when you popped up 💃🏻🙌🏽❤️", "kittysuniverse_": "That’s our girl !!", "__chavelle____": "Since those girls are wild days", "designbysyd": "Been watching you since Those Girls Are Wild lol I've appreciated your honesty and journey. So happy for your success💓🙌🏽", "_.cioccolato": "OMFG YOURE IN THIS. Even if it’s for a minute now I’m definitely gonna watch😭", "sparklelikelea": "I literally saw you & got so excited like I personally know you! I made my friend pause it like, “I KNOW HER! I’VE BEEN SUBSCRIBED TO HER YOUTUBE FOREVER & I FOLLOW HER ON IG!” We had a convo about what you do then continued watching with me randomly squealing at you on screen lol.", "diidie_k": "Yeeeeah that was amazing. I couldnt believe it when i saw you and then yeah same i was like yaaass i know her!! Haha. Just for that im very glad my bf made me watch this show ♥️😍😘😘", "sharmaak19": "But does that mean I'm envious of cheeto in chief if I would take pleasure in seeing him in an orange jumpsuit?", "piinkliips_cici": "My whole heart dropped seeing you in this show 😂💙💙", "_jenelle__x": "I was so hype when they introduced you on the show. I’m glad you’re getting the flowers that you’ve earned for your hard work and dedication!", "monalisaw": "Yoni power!!!!", "__justtea": "I literally watched because you said you were on there! I screamed at my laptop when i saw you!!! watched all episodes till I saw you twice. I'm so happy I found your channel you've helped unlock so much knowledge and perspective in my life. I literally have had all my friends do all of your quizzes and worksheets on your site! 😅 Its helped create great dialogue we didn't even know we needed. I can't wait till the game of desire gets here thank you for being so open and vulnerable and just the beautiful being you are.", "treyrichards\nVerified": "Verified", "deejkhaleesi": "I was so excited when I saw you!! Was telling my husband all about you!", "mztrailblazer81": "This is great! Honestly I think I’ve been searching for this in a lot of friendships and I’m excited and joyful for others but I intuitively feel my feelings once reversed are not reciprocated. In 2020, I vow to only surround myself with people who genuinely want to see me shine!🙏🏾", "redsallnew": "I was so excited to see you! 😂😂 I FOLLOW HER! SHES FROM TORONTOOOOO!!! represent!!! That yoni lesson... Everyyyyy woman needs to examine the effff out of their 😽!!!", "lyndsii_": "I literally felt that watching you on there. I loved it!!! So happy for your success and joy! 😀", "reneesamara": "You been a baddie, an intelligent queen! And although this show is not my cup of tea I don't have to watch it to express my mitfreude for my former classmate. You glow girl! So happy for you!", "lucirbt": "Perfect share on this Monday morning 🙏🏻 I loved you on that show just like all your work & what you’re sharing, so grateful 🦋💕", "bryntstagram": "🙌🏾🙌🏾🙌🏾🙌🏾", "emimuto": "Thank you", "danniellemell": "yes!!", "kyshab_": "SHANN!! I’m so proud of youuuuu siss 8 screamed when I saw you on netflix aha my friends were confused but i know the dealll🔥❤️", "emilieiggiotti": "It was so good to see you on the Netflix! When I saw you on TV, I told my boyfriend: OMG I follow her on Instagram!!!", "bigboss.moe": "Yess I was so excited to see your beautiful self on my screen✨", "daddyspumpkin86": "Mitfreude is similar to compersion, yes?", "sade_mp": "Literally like 5+ people texted me when they saw you on this show because they know how much I admire you❤️ so proud of you and your work🤩", "_vnessss": "I was soooo happy when I saw you on the series!!", "theothercrystal": "You were amazing on the show!!!", "gilly": "❤️", "megswithlegsss": "Although I didn't care for the show i LOVED seeing you on there. Been with ya since TGAW, definitely an inspiration and a motivating spirit. 💕", "mostlymeee": "You are amazingggg girl! I yelled at the screen likeee \"yassssssss that's my girllll!\"", "taymusqua": "For real! I was so happy", "sunnismilez": "SHAN I LOST IT WHEN I SAW YOU ON THE SHOW 😭😂😭😂😭😂 😍 LITERALLY I WAS SO HAPPY.", "bluethealien": "I was so excited to see you were on the show ❤️ my friend told me about it and you were the only reason why I decided to watch 😍", "wander.woman_": "You're such a gem! 🔥💕", "justinediiane": "lmfao my boyfriend can attest when you popped up on that screen OMMGGG MY BABYYY SHAN BOODY!!!!!!! YESSSSS BITCH!!!! 😂😂😂😍😍😍😍😍😍😍😍😍😍", "hafsaisalwe": "As someone who’s followed you since your Those Girls are Wild days, I am so happy for you. Congratulations, and thanks for sharing this wonderful concept! 💕", "ednatheefficient": "I LOVED U ON THIS SHOW!! 😭😍 I was so so excited to see you, and you did your thang! 🥰🥰", "yanii_yanely": "🔥", "poetically_urs": "@lorenzqupid 🖤 I love Shan too girl!", "friendscallmestudz": "Keep up the incredible work!! @shanboody", "lindseygrangertv\nVerified": "Verified", "gulleyty": "Sexy lady. 🔥", "popster613": "I literally screamed at my TV when I saw you on the show, just like you said!!! Thanks for being amazing! 💕", "amillionminds": "A true inspirational goddess. I just binged the whole season last night and was like YASS gwan fellow Durham Queen 🔋💗.", "heysade_therapy": "I love this excerpt, I need to read this! What book is this from ?", "jessilarene": "@kativerson MEEEEE", "aliberg21": "Beautiful post! Keep working girl! Proud of you ❤️😍🔥🙌🏼", "uniquemarieholmes": "👏🏽👏🏽👏🏽", "leandrabragasilver": "Favvvvv book too", "whatlauralikes": "I full out screamed when I saw you on the show!!! Felt like I was some special insider because I already followed you 😂🥰", "theycallmemotlow": "I definitely was happy to you pop up while I was watching. I love your work!", "missiemaya": "I definitely said yassss bih when I saw it. #guyana stand up lol", "msmickyk": "We love to see it 🙌🏾🙌🏾", "froever_raven": "I saw you on there and was like “omggggg that’s Shanboodyyyyy” lol", "eme.eff": "Definitely not my type of show, but I had to tune in to see what wisdom you would give me! It was fun seeing you shock strangers 😂❤️", "meditationvisuals": "I was so excited to see you on the show!!!!", "bennettsbeeninit": "💙💙", "cgetsgains_personaltrainer": "Shan loving the growth. I actually stumbled across the word schadenfreude while studying narcissist personality disorder after dealing with a few🤦🏿‍♂️ but mitfreude is a new term that well thanks to you I can look into so thank you. Keep growing and glowing", "recklyss_j": "I was talking to my cousin about you a few days ago and then he was like, \"yo, that girl showed up on my Netflix show\" and showed me the clip lol", "thewesleymadison": "So proud of you mama. Sending a copy of TGOD to my friend to digest in quarantine 🙌🏽", "heyyyitshewan": "I SCREAMED when I saw you on Netflix sooo proud 🔥🔥🔥🔥", "ashleystalteri": "I was so happy when I saw you, definitely trust your work and knowledge", "iamchanelc": "I showed my boyfriend. I was like I know her 😂❤️", "the_mixedup_minimalist": "I was so happy to see they had you as a consultant/educator for the course! I wish they would have shown more of your session!", "sharanichole1": "Yep. I definitely yelled at the screen like\" LOOK AT SHANNNNNNNN\"😩😂😂😍😍", "aphriite": "Omg you're in it ?! Okay I have to watch it !!", "yvonne.mugure": "Yaaasss I screamed when I saw you and said the same thing! You truly are one of a kind. I’ve learned so much from you🤗😘 So proud of you!!", "baby.c.jesus": "The way I screamed at my best friend like “IS THAT SHAN!!!” and danced all over my room when I saw you on tv! I love when I see people grow in their field, such an inspiration", "imeldasutuj": "When I saw I u I screamed and then u come on again and I was like yesss they brought her back"}