{"allysanford": "Congratulations babe!", "ayyyyyeoh": "@chikaokpobiri in awe of you!", "sharonseatin": "Congrats!!! You’re always doing incredible things 💕 so brilliant", "bigwayne45": "This is AMAZING...Congrats!!", "ataleaboutagirl": "Congratulations! I graduate with my masters in nursing leadership and management this week! 👏🏾✨", "leilaniterris": "Props for going back! Being a working adult and pushing towards higher education is no easy task. Im right here with you 💕. Congrats", "nashurllydope": "Fave❤️❤️❤️❤️", "marsha.jeune": "🙌🏾", "jiggyjamalwillslapabean": "Shan I would die if you made video going into depth about your experience with finding enjoyment or fulfilment in education again 😭 I am super interested!! Love you, 💛 J", "thegrinchwhostoleselfies": "Bahahaha i cant stand you 🤣 you would play Poggs during class 🤦🏾‍♀️", "elainemusiwa": "This is awesome, Shan! Good for you 👏🏾👏🏾👏🏾", "corasaur_rex": "Check OUT that GPA!!👏👏👏 get it!😻😘", "rockerbee": "Congratulations 🙌🏾 very proud of you🥰🥰", "aryeharmony": "I went back to school as well!!!! Studying to be a Veterinarian Assistant. Ugh. Didnt think the day would come I would think about it. However I loved school (my college years). I'm enjoying my education now but definitely can't wait until I graduate!! Lol", "sack_reign_music": "#thatsbig 😎 👏💯", "shutupchandra": "Wait I just got done reading the Art of Loving by Fromm. Is that what you read?", "devapresence": "I wish you happiness and success. May your quest for education continues. I know you will achieve great success. ❤️❤️❤️", "foodiewithacamera": "I get this. Congrats!", "simonespeed7": "go Shan ! 👩🏾‍🎓", "dylyntk": "Thank you we out here getting our degree and now more than ever are we being tested...literally 👏🏾💯", "ariel_bby5": "@shanboody proud of u and inspired✨✨✨", "socialimpactwithstephanie": "👏🏾👏🏾👏🏾", "the_girl_who_made_soup": "School sucks and you’re wonderful💕", "nillyearth": "I loved reading your teachers notes idk why that had me so hype 💚💚💚 congratulations ✨✨✨", "itstracyg\nVerified": "Verified", "kellyevilgenius": "I am happy in my own education that I know who Piaget and Vygotsky are", "liliquejael": "Yes 👏🏾👏🏾👏🏾👏🏾👏🏾 good for you!", "__sincerelychelle": "Yayyyy!!!! ❤️", "blue_intentions": "@locssmith this is so motivational", "fitfreakqueen": "You. Give. Me. Life.🙌🏽", "rhianneecampbell": "Good for you Shan!!! Congratulations 🥳🥳", "onyx_ocean": "Congrats!", "_animusvox": "Just finished my first semester 🙌🏾 @shanboody", "young_0ne98": "Wow... you sharing this made me feel soooo much better about going to school... I had my doubts cause I wasn’t all that great of a student in hs either... this is so great love!", "samanthagberry": "💯", "ashleyemond": "This is amazing!!! Congrats!", "island_gurl4life": "This is inspiring! I’ve gone back n forth about getting an online education/degree versus going to a regular class setting. I realize the focus, dedication and organization required to take courses online. Congratulations to you and thank you for giving me the inspiration that it’s possible to do n succeed at!", "sarayalyn": "Yeahhhh girl. !!😘", "jepstu": "Congratulations", "blackyogamom": "Congrats!", "creatorhq_": "@nodiploma_ you might enjoy this story.", "mamaciitablaze": "🙌🏽 love this!", "marleymom14": "Congratulations to you! As a teacher and a first generation college student, an education is such a beautiful thing and the best gift you can ever give yourself! Job well done!", "cccarmelll": "So inspiring! I just submitted my application to university yesterday and I’m 33! I finally feel driven and ready ☺️", "richellecampbell": "Say it louder !!", "itsnoelleanneyo": "I can completely relate! I’m a 31 year old mama of 2 and will be graduating with my BA in business at the end of the month ☺️", "deonstraight": "Yesss that’s so awesome congrats!!! I earned one of my BAs in HD as well! Loved it!!", "vaughntwin": "This is AWESOME! I've gone back to school online, too. It's stressful at times and I wonder what I was thinking- but it will be over soon😄 Congrats!!💖", "herbtheentspec": "👊🏿👌👍👆", "flex_freedom": "Pogs and slammer... 😂😂😂😂 No tradebacks!!! Playing for keeps!!!", "filiprima": "Wow phenomenal! 🙌🏽 Congratulations 🎉 what course was it that you got 95/100 on for that paper? Looks really intriguing and like a class I would invest time in", "rahelxc": "🥇🌟", "stephmilius": "Go girl!!!!!!!! Same thing happened to me. It’s magical", "marscoyles": "Fromm❤️", "_itsgilbertt": "You go girl!", "angelmarvoyiemanneh": "Yes Shan! Congrats love!", "kristennkrissyy": "Inspirational 🙏🏾", "realaveryturner": "This inspires me 😭🙌", "omois_": "Congrats 👏🏾 This is so inspiring. I’ve always admired how well you interpret, critique and communicate material because you’re knowledge is passion driven. Many notable scholars and thinkers felt the same about class and profs. You are the best kind of scholar to me ❤️", "thecaffeinist": "This is so inspirational!!! I love how you’re constantly in pursuit of being a better you.", "santamonicaharmonica": "Congratulations, ma!!! Can we read these amazing essays?? They sound so interesting!! 🔥🔥💕💕", "asherdeveno": "Your dumb asf 😂", "loverufaro": "Congratulations babe", "belinda_ingoz": "Well your certificates “here and there” matter as much as this . It is beautiful to hear of your process . Thank you for sharing ! All is valuable and All is knowledge! Right on amiga .❤️", "spicymari": "It’s never too late to go back to school 🙌🏽", "chris_footsie": "Soooo hot😍", "ohhh.karla": "Yaaaassss!!!!", "esilanah": "Congratulations ❤️", "jasminetdshivers": "Awesome!!! Congratulations!!!", "jaswinjohn": "Congrats Shan! So proud of you 😌🎉", "iamvmays": "Go girl!", "thewesleymadison": "Congratulations mama! Big accomplishment. Maybe you didn’t NEED to but it’s still valuable 💜", "jessicamurdy": "Congratulations!! I’m graduating with my Masters in Library Science in just two weeks and I asked myself everyday why I decided to go back. But my husband always tells me education is never a waste even if I don’t become a librarian. And of course I finally figured out how “to do” school without stressing in my last semester.", "neptune_fire": "Do the dang thing ladies.", "_danceswithwolves": "😭👏😭👏😭👏", "zimkhitha_duze": "This is awesome! ♥️", "thats_justanne": "Congrats!! This means a lot to me from someone I look up to. I’ve struggled with this stigma my whole adult life and it’s refreshing to see someone who has accomplished so much understand the struggle with sympathy and respect. This is why I follow your career and hope the best for you and your family, because you are genuine and that’s rare in this world. Keep at it girl. Whatever you want in life, you’ve proven you can and deserve to get it. ♥️", "derrexbrady": "Super proud and excited for you!!!! What an accomplishment! Bravo!!!! 👋💛A✅", "adrianjermayne": "Wait... you were playing POGS when you were 22 years old?", "cassential": "Yessss 👏🏼✨ @shanboody lowkey I kinda wanna know your thoughts on erich fromm 😁", "karisma_quiballo": "I was a Highschool drop out and went back to school after 3 kids. I am now finishing a doctoral degree and I graduated with my bachelors summa com laude, won awards, for big scholarships, and have had much success and been able to help people in ways I couldn’t have without my degrees. Not bad for a Highschool dropout. Keep the fire burning 🔥, soon to be Dr. Quiballo ♥️", "iambebemichelle": "Probably my favorite post from you. So proud of this!", "adriannaexplainsitall": "Congrats to my fellow @sunyempire classmate! 💕", "glographics\nVerified": "Verified", "glowco.skincare": "Same here, I was actually a horrible student behavior wise (my grades were on point though considering I barely was there). Congrats hun and you will kill every single semester!", "she_lovey": "Congrats!!!!! Im working on my masters too and its a lot of hard work but feels so good to be working towards my educational goals. Hubs and I have 8 kids (we're blended) so its not easy but im so proud of myself!!! Keep up the great work girl!!!", "jadore_xo610": "Congrats!!! 🎊🎊", "teamtysha": "Wow this is amazing Shan and inspiring. It’s never to late👏🏾👏🏾👏🏾👏🏾👏🏾", "angie_right": "I need to read that paper! I am curious now!", "jimanekia": "I am a school junkie LOL I just finished my Masters in health psychology like three weeks ago. And I just applied for a certificate program for continued graduate things. Congratulations", "magzbear": "Love to see it 💕💕💕", "__deepti1111_": "This is awesome! Keep going! As a psychologist, I feel like I need to read this paper! Please do share it, if you can. 🙏🏽 All the best!✨", "piinkliips_cici": "I think you just motivated me to go back to school. I had the exact same mind set. And I graduated with a 3.6 gpa.", "caulmemichelle": "Get it!", "mspatriceashley": "We love it see it 👏🏾👏🏾👏🏾", "njrrtt": "Congrats", "iamlatashatrimese": "👏🏽👏🏽👏🏽", "tatyanaillianna": "Ugh!! I love. I LOOVEE!! I'm currently writing my last paper of my undergraduate career 😱😱 and just sooo worried I'll eff it up, i keep getting stuck. I will keep this post as motivation!", "sassytashie": "Congratulations! Such a great accomplishment 👏🏼", "theamakaopara": "congratulations Shan!!!!", "domabailey": "go shan! go shan! ✨", "barb_hhdez": "Thank you!! I needed to hear this.", "ao.lola": "👏🏽👏🏽👏🏽", "amandabowler": "Congratulations!", "gulleyty": "❤️❤️❤️❤️", "msbrittyrenae": "I took 7 years off of school bc of family issues and plus I was just slacking off! Lol I finally re enrolled and just finished my first semester back. I was petrified. All of the kids in my classes were just that...KIDS. I was the old lady and was afraid that I was gonna fail! However, through hard work and dedication, I just found out I made the deans list!! I am so proud of myself. And I’m proud of you too. I know first hand how hard it is to start over in school. Good luck on the rest of your studies!!", "_lleexxii2": "Queen!!!!", "laguanacagringa": "Congrats!!!! ❤️🙌🏻", "tmra.b": "Queeeeen 🏆🏆🏆", "stephtrainsdogs": "Great job Shannon! Inspiration at its finest, I didn’t apply myself in high school much either because the subjects just weren’t interesting to me. But once you find something you’re passionate about it makes sense to stick with it and pursue it! Go get em girl! 👏🏼", "mslisarenee": "Congratulations to you🎊🎉🍾🎊🎉 Thank you so much for the inspiration!", "vmjphotographyandmusic": "What a great story!! Congrats 🎉🍾🎊", "saritaesi": "Very inspiring! A reminder of what is possible when we don't allow the limitations of others to narrow our vision and potential.", "kamensah": "Nice work. Always learn, learn all ways.", "barbarajane2263": "Fantastic! Major kudos to you and thanks for sharing your story. Very inspiring.", "mavis.mitchell3": "Big Congratulations to you for finding your place and claiming accomplishment ! 🙌🏾👏🏽👏🏽👏🏽🔥", "kyandra___": "I just finished undergrad at 30 lol. My kids pushed me. My husband motivated me. I needed them. They are my team lol. Good for you! You have us as your team now! You got this ♥️♥️", "peaceandparsimony": "For me, studying something of interest far exceeds studying necessity. I find my performance in courses that interest me are far better (which makes sense given the neurotransmitter acetylcholine which aids focus and attention is more present when we are interested in the subject). Congrats!! Love your work!", "ah_leesh_ah_": "I have just been realizing how important it is to celebrate tour successes! Thank you for sharing this. I'm sure this is just the first step of many and you will continue to level up 💜", "sade.danielle": "🙌🏽🙌🏽", "sassyyetclassy84": "💙💙💙", "dreamscome": "So happy for you!!! You should read born for love by Bruce perry! It’s a wonderful book about the development of empathy, it changed how I view the world! :))", "yaphawebb2020": "Congratulations!!!", "littlecroisssant": "Such an incredible story. I was a similar story of not being a great student early on. It wasn’t until college that I excelled and knew my potential. All those years of feeling dumb... I am so proud of myself for overcoming all of that. I am smarter, stronger, and more confident that ever! 🔥❤️😻 Nice job sista, cheers to us! ;)", "spirituallyamber": "Hey Shannon, I agree completely with be in person in school. I hated high school with a passion and unfortunately went to my graduation because my family was there to see me, but taking online classes has me enjoying school like I've never done before. The fact that I can go at my own pace and at the same time not have to deal with long lectures in person has been the best feeling!", "katdalua": "I’m so happy for you Shan! 💖 I’m curious, was the degree a Bachelor’s or a Master’s degree?", "poetic__embrace": "👏👏", "fucluv_xx": "🤸‍♀️", "fad8awayko24": "❤️💯", "neesha_f.baby": "Congratulations!!!!!👏🏽👏🏽👏🏽🍾", "kalilynnking": "👏👏👏👏 go, girl! I slowly went back to college three years ago while being an only parent to two kids, working full time, and putting days in weekly to physically building my home. I'm waiting on next week to hear if I've been accepted into my program 🙏 so much respect", "ayshawaberi": "Congrats beautiful woman 🙌🏾🙌🏾🙌🏾🙌🏾❤️", "lavidayg": "Yoooo🔥 Congrats!!", "oh_sof": "Congratulations!!! 🍾💕", "mantereligieuse_": "GO GIRL 😍🔥", "alex.t.barth": "Ahhh go Shan!! 👏🏻💕", "brookedeemusic20": "♥️💪🏽", "capablenquali5ied": "✊🏾", "shinegirlshine": "This inspired me! Glad you followed through @shanboody!", "lolo_wink": "Congratulations!!", "sintiendomasnatural": "😍😍😍 Congratulations!!🎊 👏👏👏", "amkrasner": "🎉🎉🎉", "oshunchi": "This is so inspiring. I’ve been wanting to go back to school for YEEEEARS!!! But I’ve been too nervous too and, let’s face it, have not wanted to continue incurring more student loan debt. Thank you for sharing. This has give. Me something g to think about", "kmrodg": "👏🏽👏🏽👏🏽", "jazzmynflower": "So inspiring Amor!! I just enrolled in a bachelors program at 24 years old and I never thought I would have the courage to do it. I felt regretful because of the costs but seeing this makes me feel so much better it really is soo important no matter what price! Knowledge is powerrrr 💜", "chelsearrahh": "You go, girl!!! 👏🏾", "tricksonyourmind": "Congrats! All love ❤️", "veni.mihaylov": "Congrats!!! I’m beyond proud of you for being on this journey and absolutely slaying it. Your videos have been life changing, thank you for everything you’re doing! 🖤", "jalva5": "If I could triple and quadruple like this post I would !! Congrats !!!!! ❤️❤️❤️❤️", "chef_liyah": "CONGRATULATIONS YOU QUEEN!!!", "elleoquently": "I’m so proud of you ALWAYS girl!!! You’ve inspired me to do so much from moving out of monogamy, embracing that I’m non-binary, writing my book, so many things! I love you and am so happy for you!", "bj_balancedbees": "😍😍😍😍😍😍 You go @shanboody !! Thank you for sharing! Academic is not for everyone. The format doesn’t exactly allow creative, curious, non-traditional minds to flourish or be seen. I admire your work and plan to be your peer one day.", "you.a.hoe.if.i": "You are so inspiring Shan. Thank you for sharing every part of your journey with us.", "tharealree": "Amazing 👏🏾definitely inspiring I’m so unsure about going back to school 😭", "sunyempire": "Congratulations, you’re crushing it 🎉🧡💪", "amillionminds": "The universe has a way with divine timing, I’m taking this as a sign to prioritize the last 2 courses I signed up for last month but have fallen behind on. Keep going Queen🌹🔋.", "inked.nicole": "This gives me so much joy! I’ve made the decision to go back to college to finish a degree I never finished. It’s never too late to start out on a new path! Thanks for sharing. 👏👏👏", "lab_art92": "I'd have you know that gpa's practically means nothing especially when you continue onto postgraduate research. Students start with a gpa of 3 and above but they don't know anything else but the work that they've memorized for their bachelors.", "corinnelson": "Rockstar!!! 🔥And you were studying the incredible Erik Erikson & Erich Fromm? Both a huge part of my fave course in school! Though your essays sound waaay smarter than what we did. Congratulations 🙌💕@shanboody", "jaer_by_ern": "✊🏾✊🏾✊🏾✊🏾", "heyajules": "Congrats!!! 🎉", "brittbratproductions": "Congrats 🎊🍾🎉🎈", "nimc.o": "Congratulations girl 👏🏽👏🏽👏🏽", "lc_palma": "That's awesome!!!♥️♥️♥️♥️♥️", "trustnotadamnsoul": "Yes shannn keep it up sis!!! So proud 💙", "atribecalledquartermain": "That’s awesome! Check your email. 👊🏿🙌🏿❤", "picturem3this": "This is inspiring.", "iam.shwn": "Congrats 🎉", "tarotandtantra5": "Amazing! I've been thinking of doing some courses on that subject as well", "lacepetals": "This is so inspirational and with divine timing 😭! I am 25 and feel SO behind on post-secondary edu, but I know everyone’s life journey is different, which is why I feel this is truly my time to focus on pursuing my degree seriously after being in/out of university for 6 years. I admire your work ethic on self-development and growth Shan. All the best in your endeavours 💛✨", "i.am.aras_": "Wait so what your formal education? I mean like how'd you become a sexologist?", "_justvahnna": "Amen!!!!!🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "alexandriaellison": "You go girl ❤️❤️", "calmercazi": "🥳 congrats", "tamyra88": "👏🏾👏🏾👏🏾", "russelllane": "Same! I didn’t go to high school or my college graduation, but I pursued my masters degree and didn’t fully appreciate the school experience until I knew what I wanted to do.", "monkie_2012": "🙌🏼💫", "queenquarantine_nyc": "@shanboody Girl you just inspired me! I’ve been putting it off for so long for the exact same reasons!", "adiasinead": "Congrats to you! This is so inspiring. I recently shared with a coworker that I was thinking about going back to school and they immediately started listing reasons why it’d be difficult for me! But I’ve thought about it some more and I truly feel like it’s my next journey. I know I can make it work.", "devsamone": "You’re amazing! Congratulations Shannon!", "nolongeractivegoodbyeforever_": "Congrats", "spenceselah": "Well done 👏🔥", "drawinggigglez": "CONGRATS SHAN keep it up 😊❤️", "sunbeamshow": "Been wanting to do the same, would you be able to share where you’re studying? If we’re paying full price, we need it to come recommended ya know?! ☺️", "remymoore": "#pogs", "melasia_": "❤️💕op", "edwardistheman": "Congrats @shanboody", "shadanhani": "Nice job Shan, you deserve it girl❤️", "soulcial_healing": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾💛", "milo_718": "It’s definitely a struggle! Completed my masters this year now I’m on my way to be licensed as an LCSW. Congratulations!!", "toomucheva": "Girl, you literally talk, write and read about things I ADORE and have had the most interest for in my life! 🙌🏽 CONGRATS! Good for you. Btw have you read Sex at Dawn? One of the best books on human sexuality/monogamy that I’ve come across.", "a_dot_mor_": "🥂 I know that feeling and co-sign all of this! Especially the “you don’t need to” & “you don’t have time”", "thetracymoore\nVerified": "Verified", "trinidy.tierra": "Needed this", "toscamarleen": "Omg same!!! I realized that I’m an independent learner as well, just registered for Harvardx certifications!! It’s never too late 💕", "thee_camerondavid": "Lol youre a G for the #Pogs confession! I kne there was something special about you 😎👍🏾", "veronicafinesse5": "Congratulations!", "i_am_simply_aycee": "Yeeeesss!!!!🙌🏾🙌🏾🙌🏾", "powerofkay": "So damn proud of you!", "laignerlmassey": "Yesssssssss We Stan a Queen with Brains and Beauty!!!! Congrats!", "nikkinetteanna": "Congrats!!!!!", "brilove_nolimit": "Omg I couldn't recieve this post in a more devine time. I'm 28, never took school seriously, wasnt the best student but I always knew I wanted to be in the field of Marriage and Family Therapy and Sexology. Last night I was looking over this follow up email I received from an admission counselor for this Bachlors program in Psychology and immediately got anxiety just reading through the steps in order to apply. I got anxiety because I'm scared to fail, like you I listen to a lot of ppl around me about how expensive college is and how old I am and how I can just get certifications...ect ect. But its because of the anxiety i knew I was doing the right thing to go after my dreams. Reading this just gave me comfort and confirmation. Especially because I've been following your career since the beginning and you have always been such an inspiration to me. So THANK YOU SHAN FOR SHARING!!! 💛💙 @shanboody ...I'm manifesting right now, in this post that we will meet one day and that we will get to work together some how some way! We will cross paths, I know it. Especially since we both live in Los Angeles.", "nikki__willi_": "Congratulations! Well deserved 👑", "dabossj_stomp": "When it matters, you'll care and work for it. Congrats, girl!!", "reneesamara": "Same Shan! I went back to school when I was older too. I think you need a bit of life experience to allow you to really put your all into your school work. Especially when it's related to things you've already been doing. Congrats!", "sher_small": "I can relate to this on sooooo many levels. Congratulations hun! Well fucking done!", "fleur_flaura": "Proud of you shannon. I am currently full time students myself and seeing this just give me motivation to do my best. Keep gurl and god going to continue blessing you.", "laura.vater": "Congratulations Shan !", "birdylyn": "Congratulations 💞🍾", "biaisthatu": "Great job, congratulations on the GPA AND finding your flow❤️", "meg.susanne": "About to turn 30 and mid way through a masters in counselling - also mostly online! So tough and worth it! Kill it!", "jasbrean": "This is super inspiring and its pushing me to go back to school as well. Congratulations and blessings unto you", "fescott": "This is awesome. Hats off to you for going back and kicking butt! It’s hard I know. My hubby is one class shy of his Masters and will be done this summer. It’s hard especially when you are a working adult. I work over the weekends so I can be home with the girls during the week (we homeschool) then when he’s off work on the weekend he trying to take care of the girls and school. In the end we know it will pay off. I know that your hard work will also pay off for you 💜", "taylorloraa": "Beautiful!!! Higher education is so important. Many try to down it but at the end of the day college opens so many doors.", "izienovbiagele": "👏🏾👏🏾👏🏾👏🏾👏🏾", "celinecrr": "Shan you are amazing. A truly inspiration 🥰", "david_acs101": "Congrats 🙌 🎉", "domina_franco": "Yes! Good for you! I just finished my Masters of Human Sexuality but I’ve realized I also need the Masters of Social Work to do the work I want to do- so it’s back to school for me too. It can be so hard-but also so rewarding! Congrats on the great feedback and grades- you’re clearly KILLIN it!", "therodneydrichardson": "Congratulations 👊🏿❤️", "katyamorozova.me": "Beautiful! Congrats! Education is important... but it’s actually valuable when we do it for ourselves because then we’re committed. I went to university right after high school but I “missed” most of it because I was too busy partying. I think it’s important that folks get their education when they’re ready and not when they’re “supposed to”.", "rachel_denee": "I was told it was too late when I had children. Why do we do that to people? Ended up finishing high school at 30 and 2 masters when I was 44. Fuq em.", "ahloofah": "This is fantastic! I had a similar college experience, and I tried to finish my degree online, but it is HARD when you have so many other things on your plate!!! So bravo to you and any adult who can make it happen! ❤️❤️❤️", "klumseykatie": "I’ve finally buckled down and am going back to college. I normally don’t do well with school stuff these days, but I want to grow in a way the requires a degree. Thankful that I have the opportunity and means to do my schooling online and hopefully in person in the coming semesters (as long as this whole pandemic thing has calmed down). Shan, I’m looking up to you, proud of you, and am cheering you on. Thank you for the encouragement.", "ahhhh_snapperz": "🔥🔥🔥🔥 truly inspirational ... 🙌🏽", "absomedia": "Congrats Boody! 🎉 PS what class did you get kicked out of?!?", "kamariaellerbe": "☺️Go Queen🙌🏽✨", "msgray2u_": "@shanboody do you mind me asking where are you taking your degree in human development?", "principessabiondaa": "Where are you studying??! I want to go back to school, online as well.... great job!! 💘✨", "xxvelmadanklyxx": "Proud of you!", "the_ink_is_dry": "🙌🙌🙌 get it girl!!!! So proud of you! I love having inspirational women like you on my feed. Keep on pushing girl! 💪", "chyna_girl13": "Love to see other women reaching their goals through higher education 🙏🏽👏🏽👏🏽❤️❤️ I definitely plan to go back to school in the future because the learning is never done 💪🏽💪🏽", "colominicana": "Yasssss 👏🏽👏🏽 brilliant and beautiful!", "yay_all_day07": "I know exactly what you mean. I was an average student, at best. Once I figured out what I wanted to do, (after failing both initial years at a Community college, right after high school... staying away for 6 years after that) I went back to school and finally, for the first time ever in my life, got straight A’s! Hard courses to become a Paralegal, so like a mini version of law school. All while newly dealing with Rheumatoid arthritis and being pregnant for the first time. It’s my Al Bundy high school football moment; one that I will most definitely Always talk about 😂even to complete strangers 😬 congrats to you!!! I know exactly how you feel!! 🙌🏼🙌🏼🙌🏼", "kumoyovibe": "Congrats Shan👏🏾👏🏾👏🏾", "_kaylondon": "So proud of you this is incredible ❤️", "micheaux": "👏🏾👏🏾👏🏾🙌🏾", "ohsolove_ly": "👏🏾👏🏾👏🏾", "conbonconnie": "Amazing 👏🏻", "aprincess_8": "👏🏽👏🏽👏🏽💃🏽💃🏽", "ceo_nick": "💯💯💯", "gentillybree": "I took a much needed break from undergrad but 1 day I will go back and finish.", "yml1086": "That’s awesome. And Pogs, that’s a real throwback!", "tsmall4real": "🙌🏽🙌🏽🙌🏽👏🏾👏🏾👏🏾", "feliciagisondi": "Be my mentor plz", "frames.of.josephine": "👏🏽👏🏽👏🏽", "floydbrenda66": "Congrats", "hellokitty3482": "Congratulations and I feel this in my soul... school was never my thing and I barely graduated from college ( I had a D in French and a C in science ). Then to my surprise and everyone else’s I went on to get a masters and doctorate at a better school and ended up with a GPA of 3.93...", "jennysilva85": "Amazing!", "auroralovecoaching": "Yes, I feel you! School is so much better when you’re passionate about what you’re studying 🙌🏾", "potentialfilmsinc": "Pogs!! Congrats homie.👏👏👏", "dyferent1": "The amount of people who told me “oh, just go on YouTube” is the exact reason I don’t talk about going back to school out loud. It’s so annoying. I’m glad you’re back at it and have found your groove.", "elizabethscarlette_": "So happy to see this 🥺 I knew you’d do well, you’re so passionate about what you do", "mskarengarcia": "This gave me the feels!!! I've been thinking about higher education too, ty 😍❤️😘 congratulations and God bless", "lutaylor_82": "I am 37 and a mum and just decided to pursue a new career as a Midwife and I terrified of the studying but also very excited for my journey.", "khyla.s": "I am in school as well! It’s tryingg but so rewarding. Cudos to you on this step! 🙏🏾", "tiffanialexus": "Yesss, congrats! 🙌🏽Human Dev was my minor. Keep going. 💛", "wenzdaithegoat": "It’s so crazy bc on every piece of media I see you on, I think 🤔 she sounds so well educated. Her choice of words are always impeccable!!! 🙌🏾", "sisithelyricist": "This was very refreshing to read. I can relate to this. Still looking for my flow, but seeing you find yours is encouraging. 💛", "smashfizzle\nVerified": "Verified", "ajahlee": "You go girl! 🔥🙌🏾", "justcallmeag": "Yaaaaaay let’s hustle!", "esmarelda": "That’s amazing, congratulations!! I worked full time while pursuing my MBA part time and it was tough but I felt so accomplished after.", "kiaraisxbel": "You’re such a fucking inspiration", "subsaharan_soul": "This is dope!!!", "krism365": "Congratulations!! I was the same way in grade school and undergrad. I've learned that as you become more wise you start to appreciate education waayy more. Starting my masters degree journey in the fall, and I have never been this excited about learning lol. Thank you for providing me a little more motivation ☺", "shesabakingfool": "I’m a grown ass woman who decided to go back to school after letting myself down too many times in the past. I love that you shared this! This is my first year at a “real” university that I worked extremely hard for. Now I’m having to do everything online from home with my kid and animals running a muck around me. It’s my luck haha but I have so much to be thankful for and I can’t dare stop now 👵🏼👩🏻‍🏫", "theshaniproject": "I feel so seen! I didn’t not care for the learning process, I always got in trouble for talking too much in class. And I am currently a therapist. My masters program was my favorite because it honed in on what I was passionate about. Thank you for sharing!!!! You’ve inspired me to share my story! @shanboody", "justkelseyjanae": "Good for you girl! It took me 10 years on and off to complete my bachelors and now I’m in school for my masters! 😊 Doing it your way is the best way ✨", "tisamarie_hmua": "That’s amazing! Good for you. I also decided to get my degree late in life. But the backlash I’ve received has been so discouraging. People telling me it’s “not a real college” or “it’s not hard”  I attend university of Phoenix and work really had to have a straight A GPA. I’m currently attending to achieve my Masters. But I have this HUGE concern my degree will mean nothing because of the college I choose.  Maybe it’s a stigma against the school. But regardless I do my best to keep my head up and be positive for my choice", "iamjanetphoenix": "👏🏽👏🏽👏🏽 a role model !", "adriana_22888": "Congratulations!! 👏👏", "itsmekat_yay": "Biiitch I’m in awee of you 👏🏼👏🏼👏🏼👏🏼", "lovley_leidy": "Congratulations!🎈🙌🏽🎉🎉🎉What online school did you earn your degree from?", "dejaisdope": "Go Shan 😭💕 So proud of you sista girl", "shanerton": "Get it girl!!! Keep making Toronto proud!!", "itsjaybabes": "I’m so proud of you. You just inspired me thank you❤️", "sade_mp": "So proud of you! I’ll be graduating with a BS in Human and Social Development in a week❤️", "melaniefiona\nVerified": "Verified", "courtney.collins.1297": "Yes🙌🙌!I feel ya girl!! I started going back to school last fall as a full time online student. I’m holding out strong and I’m thankful I found the right degree that will help me with my career development!! Power on sista we got this💗💗", "chica_banana": "👏🏼👏🏼👏🏼👏🏼", "amindbroadcast": "Congratulations Shan!", "eri.cedis": "i’m studying psychology online and would be very interested to know about Freud’s feminine ideas and positive psychology. they don’t mention any of that in my book😅", "sensitiveoldsoul": "Awesome!!!!", "wiicctoria": "YESSS I LOVE WHEN EDUCATION DRAWS OUT THE BEST IN PEOPLE INSTEAD OF MAKING THEM FEEL INFERIOR ANYMORE 👏🏽👏🏽 KEEP US THIS ENERGY BABY GIRL AND DONT STOP LEARNING", "arijana_ari": "Amazing!!", "notevenalli": "I’m studying Human Development right now as well!", "_gmga": "An inspiration 💛!!!!! Congrats!!!", "doubleplay1914": "🙌🏾🙌🏾🙌🏾🔥🔥🔥", "katrinaasantiago": "Amazing 💯💯💯", "jacqueartistry": "Yes shan🙌🏻😩", "ashgarner": "🙌🏽 Congratulations! 💕💕💕💕", "vmn101": "Congrats girl,hey btw ur videos had help me a lot with some serious questions I had ,and I really appreciate all ur knowledge, really it is a game changer for me , because well,here 🇲🇽 our sex ed system is very bad,and all I learn it through internet,and u had been key,keep doing ur thing sis❤️ thank you🔝", "tawnee_vee": "👏👏👏👏👏", "theshaqshow": "Ayyyee! One of fave YouTubers!!!", "xxenxx_": "So proud of you ! So inspiring !"}