{"diosanegrita": "Girl thassyo MAN??? YALLLL FINE AF!", "under_construction3": "Hey Shan do you have any recommendations for a book to help with intimacy?", "nailitgirl123": "👏👏", "temp.zine": "That's a real creepy Hollywood classic playing if you dk😂", "karleigh.caramanna": "@eriemadd", "cc_million": "Never happening!! 🙌🏾", "marquised__": "I agree!! So when people say “you don’t respect me” when we refer to being treated kindly. You would say respect isn’t the correct word?", "prem_aimer": "@gsharma2408 its @arrahman composing😍", "piyushsanghvi_": "So you're into Bollywood music ah ?", "lovelyme_365": "❤️❤️", "naptural_ry": "@teebecuttinup", "king.sasha": "drop ya curly hair care routine", "brandybharlan": "❤️❤️❤️Love this!!!!", "sensitive_sunbeam": "Your husband literally looks like a lightskin maxwell and i just...", "gorgeousmuzic": "😍😍 yall are beautiful", "mixxedwithroyalty": "Seeing you in underwear is the best birthday gift you could’ve given me thank you 🙏🏾🤣🤣🤣🤣", "whengirlsto": "Good body gyal😍", "theplaylixt": "@willthathird", "williamsakeshia": "Whew chile the response to that question", "dduncan53": "Damn i can eat that booty like grocery's for days mama 😍😛", "byroncwrightjr": "😮", "tiannyg": "Indirectly I did—the clothing. I couldn’t get past it. Ultimately I broke it off because it wasn’t a match. One partner did tell me i needed to watch my weight because if his girlfriend gained weight he would break up with her. I’m happily single and looking for Christ 💕", "jasoncarterofficial\nVerified": "Verified", "sandraayinbode": "I need to save this one for people to see! Definitely one of my topics of discussion since I’m still dating and people don’t understand this is important", "sheisbornoffire": "Omg. You two are the cutest ❤️", "della.bourbon": "Your dancing is on point!🌹✨I see you were looking for more Bollywood jams & there’s a Bollywood themed IG live happening today (10am pacific 1pm eastern) w/ @djrekha (I’ve been looking forward to it all week) 💜", "jwalkercoloredpencilart": "@wheel_man_anf", "anhhohuuherter": "I'm married and still stuck with only having single selves. My brain hasn't registered the relationship self yet. As of right now I think there should be both as we should embrace all that exists within and outside of ourselves. No rules specific to gender, it's hormones' business, not ours.", "mae_isbae": "@exotic_lolli watch the 2nd video", "kirstensophia": "I’m late but I wanted my husband to gain a little more weight/muscle so that we could be ideally proportioned. Meaning he’ll look a lil bigger than me because at this moment he looks smaller than me. But I still make him feel good and I try to make it a joint thing where I try to lose weight as well to reach that ideal.", "stevenlobel3": "Sexy lady ❤️", "nillyearth": "That track was one of my favs on the slumdog millionaire soundtrack 💯💯💯💯 ringa ringah RIN!", "missnikka_28": "@shanboody could you tell me where your top is from please? ❤️", "matiszymoniak": "Just wanna ask to title of the song in the video where he’s dancing thank you", "reakinhavocindabx": "That song though 🔥", "discotears": "Yall are BOTH so beautiful omg", "1nonlyii": "I don’t wear underwear so I think Instagram policy would have a huge problem with me doing this same dance. My girl partner however appreciates it and has even tried the free life 🙈😩🤣", "aspiringawakegirl": "I think I'm pretty much the same with my partner as I am with other people. It's taken a lot of communication and a lil compromise to live together, but that's mostly logistics. By myself I'm different, but that's cause I'm an introvert and shit gets weird when I'm alone for a lil too long 😂😂", "wonderlust13": "I think it’s fair to tell your partner your preferences, like if you think they look better with their hair a certain way, or if you don’t like all of their hobbies (but not telling them to stop), but I think if you feel you have to change change someone, then it’s a sign it’s not a good fit for a relationship. Just because you have attraction, doesn’t mean you have a healthy relationship. All relationships have compromises of some sorts, but each partner should be able to retain their own personhood when they come together and be able to share their lives, even if they don’t enjoy all the same things, or have the same sense of fashion. Why would you be with someone you can’t appreciate or can’t appreciate you?", "freespiritedreams": "what was that Bollywood song you were dancing to?! I love it", "streetbeatztv": "💯", "shaneecechristina": "@mother.tongue.eats", "britstylestudio": "I feel u should accept your partner for who they are & vice versa. It’s easier/ healthier mentally & emotionally to have the same personality with your partner & away from your partner", "teamtysha": "👊🏾💜", "haleighyankoski": "OMG where is that top from?!?!", "intvlt": "Preach shan thank you for spreading this love ❤️🙌", "bigheartytess": "I'm in love with this post. Thank you for sharing and for forging the way on this path.", "zara.sully": "Gosh you are so articulate and inspiring !!", "ericahilll\nVerified": "Verified", "miji_2020": "Your relationship is absolutely beautiful!😍 I stand strong couples that give eachother the room nedded to grow individually✊🏾", "mychoicemypowercounseling": "I have definitely asked people to change or behave differently so that I'm not \"embarrassed\" by them. I've also altered my own behavior to fit in with a partner's family or friends so I don't embarrass them. I've since realized it was my own insecurities and rules dictating these unrealistic asks and expectations. I worried entirely too much about what people thought of me. Self work needed. Finally got to a place of acceptance of who I am and who I am not (still growing and evolving), and that's okay. Left the \"need to fit in\" or \"be good\" thinking. That freedom helped me accept and truly ENJOY other people too! I'm the biggest cheerleader for living and being true to SELF!! Be you boo..I see you shining!! And I like it!", "thesalonchat": "Love it 🙏🏾", "mvirgo22": "Love this", "pocketsoflife": "Yes. I met my boyfriend a few months after having my child. So he always saw me as they woman with a child. we dated for a few months and we’ve been together almost 2 years. Every once in a while I’ve gotta remind I’m not just a mom. Kids change everything.", "lilmultnomah": "😍😍😍😍😍", "zaaahrtje": "I did ‘change’ my exman regarding his styling, we started to shop together, he grew a beard, changed his glasses etc...the ladies started to notice him and in the end he even cheated on me, he just couldnt handle the attention he got from girls. Girls that never gave him attention before he knew me...(couldnt forgive him for this but wished him all the best, still a tough time, we were just married and trying to have a family) So that changed a lot in life for me.. Regarding my current relationship, my bf is more demanding..my marriage changed so much for me that I cant get worked up about appearance. But he still focuses on the looks, clothing, how to act. I understand that he finds these things important, but as I grew up (from the divorce), I learned that other things are more important to me. We have a daughter together, so I’m focused on parenting, how our behaviour effects our daughter, instead of what dress I’m wearing. I would rather see that my daughter thinks, my mom is amazing and I can look like whatever and I’m perfect as I am, instead of focusing on clothes and teaching my daughter that appearances are so important and you have to be on top of that game. Especially when you have a bf. because mommy taught me..as she was my rollmodel. I do discuss this with my bf and that we have to be aware that our words and actions can be bigger than we think. And I would hate it to see my daughter growing up, being so aware of her body or way to act because mommy and daddy showed her that its ‘the correct’ way..", "juicyy_goddess_playhouse": "@bbw_scorpionqueen", "ladyjustice92": "Song please🙏🏼💗 @shanboody", "itsbusi_yo": "@septemberarts", "lecwalexis": "I always wondered the answer to this question. There is so much to share but not in a public space.", "ohhthatsjustsyl": "Ouuuuu I am watching you on Too hot to handle!!!", "flygirlperla": "My ex wanted me to change myself I to who he wanted me to be and didn’t allow me to be myself without negativity with it so I got divorced. And any man that doesn’t allow me to be myself freely is no longer welcome in my life.", "innaxmaraine": "okay but like what Mascara you got on is the REAL question👀", "melk_97": "I love this", "iamjanetphoenix": "Facts 💯💯", "banm2124": "I had a guy in my life. Who wasn't even my boyfriend. Who used to call me just to comment on my snapchat story and let me know the jacket I was wearing wasn't working for him. He constantly persisted that I take on his fashion sense (btw he was boujee af, I mean waste your money type boujee) and that I allow him to give me a makeover. There was so much things he picked on from style to personality to making sure my body was \"thicc\"but not \"too thic\" that I started to wonder how he liked me. He even spent time judging my ootd with his mom and casually send an \"affirming\" text of his mother and his approval (as if I asked). I was so naive didnt even realize the depth, but I knew something was wrong. I found a way to get out of that \"talking phase\" before it was too late even though in his mind we were married....kinda straying off topic ik... anyway Shan I love you and your relationship. I admire your ideas of individualism. Sometimes it's hard to pair that with my Christian faith and traditional Zimbabwean background. But personally with my experience I've now become sensitive to any sort of superficial change my man may ask of me. Unless its serious, I do t wanna hear it. Never been in a serious relationship so I dont know for sure. But I think if it's not something that breaks the relationship then shouldn't share your opinion, unless asked. And it goes back to relationship expectations. It should be know from the get go, so you dont get sidelined with some ridiculous request or standard thats not you. Which is easy to establish with all your website resources you provide💜.. I suggest everyone visit shanboody.com", "withemilyrose": "Had a partner ask me to be more androgynous which made my femme ass very sad. Now even when I want to present more androgynous, I question my own motives.", "myztiqphoenix": "There is definitely 2 relationships, the hardest part is acknowledging it, and at times-accepting that you forgot about you resulting in snotty actions.... expecting the other to understand why you did or said what you said....", "motherinthewild": "👏👏👏👏", "lindyllbloys": "🖤", "christmas_naja": "First of all, husband! Secondarily, she’s just mad. 👏🏽", "sijalr.fitness": "Them Bollywood dance steps is on point, Shannon! 🙌🏽 @shanboody", "king_hori99": "So beautiful🌹🔥", "shalisinstitute": "🔥🔥", "tina.iota": "I think a lot of my past issues in relationships was that all of the things that made me attractive in the first place (flirty, adveturous, independent) turned out not to be traits they wanted in a girlfriend. They wanted me to change once we were in a relationship, but I can't and won't suddenly be a different person for anyone. It's honestly something I still wrestle with at times. For a long time I thought I was just not girlfriend material.", "alpha.qup": "🇹🇹", "alozano99": "I work in India but now grounded. 😷, here’s my favorite Bollywood jams💃🏻: https://open.spotify.com/playlist/1YGEDHSnsdSBPH8elUMx6o?si=Vtt9nSJuR0S-nQmxti6lSw", "shelciaconceicao": "@pauloalexandre21", "shadowdragon2k23": "Love how you let loose in this. Theres something amazing about a woman so happy and in love dancing around. Very sexy and beautiful. 💃", "malikangozi": "Yes! I’m so glad you showed your husband dancing in his underwear too! People love to police women in relationships about what’s acceptable. When they could always.... mind their own business!", "jwr_photos": "🔥🔥🔥💥💥👍🏾", "breannlafaye": "Dang Shan! Just started my weight-loss journey 3 days ago... Let me catch up 😫 You look BOMB 💣💕", "samanthagberry": "your words, educate.", "oneinamelon.co": "I love your answer!! My future partner must understand this🙌🏽", "_cbsq007": "Jared's curly to is everything! && It's GROWING!!! Omg. I've grown with his hair. Lol anyways, so off topic. But I'm just loving the vibes from the videos. 💃", "lmk_lauren": "I love my man with all my heart but he wears very comfortable clothes (t-shirts and sweatpants or loose jeans) on a daily basis and doesn’t have anything for date nights, brunch, holidays etc. I really don’t mind if he wants to dress like that but for special occasions or just nice things we do together I’ve asked him to get nicer pants some nice plain shirts or button downs somewhere between want I want and what he wants but he hates shopping. I don’t care if it’s name brand or anything, I just don’t wanna get dressed up and do nice things sometimes if we take pictures and he’s in a random t-shirt idk is it just me?", "majaaa_thesky": "That's actually a valid point. One of my exes to this day does not respect me(in the definition you've given) he always wants me to be someone else. Tone down myself", "oreytunechi": "@themba.sishi", "undefinedbeauty_co": "Mesmerized ✨", "ibunny21": "MY FAMILY HAS BEEN DANCING TO THIS SONG SINCES HIGH SCHOOL!!!! 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍", "mavaney": "Y’all are truly beautiful human beings. Inside and out.", "glow_mobb": "Your kids hair is gonna be 👌🏽", "allfavthingslb": "😍Cute", "carlen.costa": "🔥🔥🔥👑🙌🏼✌🏼", "kx.xxt": "There's most definitely a relationship self, and then a single self in my relationship, and its becoming a pattern, my partni have never been interested in my hobbies, and most of my hobbies are what makes my personality.", "msthrasher": "What song is he dancing to?", "classicdominique": "I don't have any answers to your questions right now. Y'all are both so pretty! 🤗", "zayne_allysa": "I'm just here for the lipstick deets 😍😍", "mirahtheemaven": "@moralmisanthropy", "ayshawaberi": "I really like you 😘😘😘😘😘", "marciapeschke": "I've been single for 4 years (I have met some people in that time but have not been in partnership). I had to do this to unlearn codependency type habits. I have more respect and Compassion for myself. This awareness means I'm able to open space for others to be who they are. Should I have a romantic partner, I want to create those spaces of being for us both. Love to me is this- I want for you what you want for you. I don't remember where I read that but it's stuck with me. To be empathetic with another human being is important to me.", "sw33ti3pie": "Love his hair", "krissyheartlovingwood_": "🗣 Big FACTS!!!", "ilovemandie": "I mean, do y’all want a third, or?", "143watermelon": "ur livinggg. & i luv it.", "thrustmessiah": "You have a perfect butt. Small yet still shapely and firm.", "kiranmanik": "💛💛💛", "harlem_lyric": "Your lashes are EVERYTHING 😍", "nellybelly0702": "Y'all are so freaking cute 😍💕❤️", "barbilarue": "I love this !! I feel like more women near to hear this. We have to stop performing and changing who we are to find a man to “love” us and marry us. Take me as I am", "afimusze": "Yall are a Beautiful couple #goals And your mans looks like a light skin 90s Maxwell", "charlipenn\nVerified": "Verified", "aliciaacewest": "My ex used to hate everything.. from my size (I lost hella weight then I was too thin) to what I wore, how I smelled.. EVERYTHING. I realized it was more of a him thing than a me thing. He used that as a control mechanism.", "blue_intentions": "Definitely have before", "leaveittorach": "I respect and appreciate the way he chooses to present himself if it makes him happy. The only exception if if the way he presents himself hurts other people or our relationship. For instance he has a habit of saying things in a way that can come off as rude and that’s when I step in", "luxjourni": "No homo... I stared at your buns the entire time lol", "aliatubri": "I hope one day I’m able to find a Pakistani or muslim guy who actually appreciates my free spirit, feminist mindset, Instagram posts, music, dancing etc. I’m not holding my breath thooo", "velocirapper_atx": "My ex used to criticize all of my fb posts and selfies so I got rid of him. That said more about him than of me", "blue.notsad": "I’m non-binary and my partner mostly presents as a man but doesn’t strongly identify with it. I always encourage him when he steps out of traditional manhood because it makes me feel like our relationship is “more queer,” something I struggle with as a bisexual.", "optionalsoup": "I think that it's important to grow together and definitely make compromises for eachother...but we shouldn't be trying to change who our partners are if that's who we fell in love with. Perhaps trying to change or control your partner in some ways is a projection of how you feel about yourself.", "theycallmemiyagi": "Setting positive example for the world, I respect 👀 your approach!", "jazzyfikkidizzle": "I love that song! It’s been on my World playlist for years!", "_xojackieg": "Anyone know the name of the song her boyfriend is dancing to? Please and thank you", "sarahxxdanielle": "Love you guys 😍❤️", "emma.ulalia": "Love that on respect", "katrina1987_": "I'm just watching for them cakes 😂", "thisisjewel": "GIRL...Brains, beauty, and shaking that booty!!! L❤️VE you so much!", "antamakoese": "So, body piercings. Both my ex and current partners have (or had) a hard time accepting my current poercings, and the one I plan to do. My bf just finds them unattractive. I want him to like me physically, but at the same time i don't want to compromise how I present my body, and how i decorate it. So for the time being I just pushed some of the \"extreme\" piercings i had planned for later on in my life.", "basseyworld\nVerified": "Verified", "gingerinagreysweater": "Yes. It was not recieved poorly. I have been asked the same of, it's not bad unless the individual objects or has an issue with it, if that is the case, and it's such a deal breaker, that relationship might not be for you or some deep reflection then conversation is needed.", "cubalinaa": "Respect = Accept 😌", "ebonybomani": "Bawdy! 😍", "_mad.as.a.cut.snake_": "BRUH YOU AND YOUR PARTNER ARE GORGE", "marielweinand": "y’all are goals", "cecelia.carrejo": "Shan blessed us w a beautiful booty (n message) to open up the app to.... I just feel like.... don’t.. question it? Ok thanks. Love u girl.🥰", "athayash": "YES YES YES YES saving this for when someone says \"how do you expect someone to date you seriously when you're so open on socials\" 🤦🏾‍♂️", "rfiona3": "You two both so intelligent hot and real yesssss i need to remember your answer from second question cos no doubt I’ll get that question one day from someone 😂", "chrissy_universe": "My favorite girl😘", "shonthelioness": "Nope... You came and found them how they were. Maybe eventually your style could rub off on them but I don't believe that's something you should ask of your partner.", "serinadope": "When my boyfriend and I started dating and he was getting to know my friends i asked him to be more open and outgoing with my friends. To have him try to connect with the people I that I connect with. But after realizing my bf is not the type to open up so easily with people he has no connection with and for him to be outside of his comfort zone with people he doesn't know. I realized it was an unrealistic expectation I had of him. I just realized my bf will get along with my friends at his pace and to not force him to talk to people that I now know he is not comfortable with. I think this answers your question to the best of my experiences", "sarahterschegget": "♥️!!!!", "evelynfromtheinternets": "Whew y’all fine 😅", "courtney.smellink": "The closest I've come to that is asking him to keep his face shaved, but that's because getting scratched by it always causes me to break out in acne. So not to look a certain way. I can't imagine doing that :/", "mmmixto": "My spouse and I were just having this discussion. We both feel that heterosexual culture is full of jealousy and possession. When I listen to straight friends and family and the way they talk about their significant others.... it’s immensely different than our relationship and queer relationships around us. Obviously not all het couples! I would never imply that.", "bqe_mermaid": "I just did today. Has to ask him to take down a post that sounded kinda homophobic....Reflects bad on him and bad on us. I know he isn’t homophobic, so it was an inaccurate representation anyway.", "gingerma82": "I need your butt.....I got nothing else lol", "julissamaya_": "I love how sexy you sound putting knowledge on that person asking the question and then teaching to an even bigger audience on your ig platform. It is always a pleasure learning from you & hearing your messages❣️", "melaniemespi": "@brandonjespi", "sharonndann": "Great question", "brieanimator": "Additionally, I could watch the two of you dancing in yer undies alllll day long, you adorable, stunning humans.", "yana_yz": "😍😍 yall better dance in ya undies like that!", "karmamccainvip": "#respect 💯👏💯", "thenameisnini": "@ncfranco swipe left we were talking about this the other day!", "yupimwright": "Absolutely! My fiancé @kareenheru is so supportive of me but he does not baby me at all. We both accept each other for who we are but he does not hold his tongue when it comes to expressing his desires for health, wellness and our financial future. I believe 100% that there is a “single self” and a “relationship self.” Over the span of our relationship, we have both had to let go of some “single self” things to please the other. Communication is key for sure but it definitely works! #CommunicateWithRespect #ListenToYourPartner", "islandvibbin": "Ok y’all, I am sure I am not the first to say your husband is a young Maxwell. I love your vibrations together.", "bianka.velevska": "Get it gurlll x ✨✨✨", "mikejones4021": "Damn!", "shaylaaayala": "I have asked my partner to try to dress a little nicer in college. He would literally roll out of bed and go to class. I didn’t really care what other people thought of us as a unit. I just knew how handsome he was and I wanted to see him look nice for me. I wouldn’t have been interested if that’s how he dressed upon meeting each other so I think my request was appropriate. He has never really asked me to change what I was wearing before.", "amisow1045": "@itzfamzey_", "aannique2": "I used to be in a relationship where my partner didnt like how excited or loud I'd get or how I talked when seeing friends/family and instead liked when I was quiet and to myself. It got to a point where it felt like I wasnt myself and my partner just wanted that certain peice of me instead of all of who I really was.", "babyblue75282018": "Has anyone ever told you you look like you and trya banks could be related?", "massagekneaded": "😻👑🔥 Ummmmm I’m in love Shaaaanaughty", "angelica_243": "That lip color 😍😍😍😍 and your eyes ♥️", "giowiththesteal": "I'm sorry but your booty is amazing", "tristanmarcelle": "Ok B cup booty!", "acefamily24xoxo": "cuties ♥️♥️♥️", "annieleejorg0705": "For me I like when they give me their opinion (i.e I like when your hair is long. I prefer brunettes. I prefer girls without tattoos.) However, I don't like when they tell me what to do. Tell me that I'm less when I show cleavage or anything damaging like that. I try to do the same thing I give them my opinion but I explicitly tell them that it isn't going to change how I feel one way or the other. I, also, try to tell them what's important to me (i.e they have to be nice to my family). I have very different opinions then my family and my partners in the past have to. So I tell them it is important that they be kind and try to be empathetic to their views. I never censor or try to change them. More just communicate what I like and how I feel.", "megdianne92": "I am so glad you made this a post!😍 I wrote down your definition of respect! I have always been in relationships where my partner (Male and/or female) have tried to alter who I am. I am a pleaser so I would normally comply. I have now added respect to my 5 non negotiables, I've set limits and boundaries so I find someone who loves me just the way I am 💁‍♀️ thanks Shan 😘", "kyndrasage": "I believe that my partners self-esteem, individuality, and self expression is more important than how strangers judgments both negative and positive affect my ego. In my opinion, agreeing to be in a loving relationship with someone subconsciously submits you to loving them for their truest self and that if you’re not ready to do that, or find out late that their truest self isn’t good for you in anyway, then you shouldn’t be together", "lindafknrosa": "Thank you for this Queen. It often seems like we , especially us as women, are expected to cover up and post less Bcus our partner tells us to or isn’t comfortable with the fact that we are free with our bodies and the image that we present of ourselves", "peace_bytiye": "Song- fire by jared brady", "datbawdybawdycurvy_6412": "@shanboody DJM BUT what mascara are you using 😍😍😍😍 I literally had to watch this 5 times", "cisthepainter": "Nah he’s just a dork", "goodmoms_badchoices": "I don’t want to have to compromise myself for my relationship... I want u to love me as I am and encourage me to be me and vice verse. Is that wrong? 😩 also haven’t really had a man in a while so maybe that’s why", "morelifemichele": "And it’s her HUSBAND. Not her boyfriend. #period know the difference . 💁🏽‍♀️", "bea._.trice": "Sometimes my husband does but I just ignore him lol you@met me this way so deal with it 😂😂😂 love the way @enjoyjaredbrady dances lol", "jessieversteeg": "@cammynguyen_", "___niama___": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿", "its.bobbie._": "No ... i never ask them to change because what attracted me too then is that little annoying little thing that makes them different ... i want that little annoying thing forever 🤷🏽‍♀️", "kelinickole": "Nah. My partner and I both respect the fact that we’re trash people and will dress in beat up work boots and always have a messy bun, respectively.", "katharinakuduro": "Exactly this topic was always a big struggle in my last relationship 🙄 \"how I have to show myself because of what people could think or talk\"", "ohthatrenee": "I have had moments of bratty-ness with my partner and his appearance, but at the end of the day, he knows how sexy I think he is. Our opinions are very important to one another, but we can't force the other to do everything based on our preference. We also make small compromises, but nothing of rea", "naturebugk": "Ended up in a v conservative ✝️ marriage for a while. My ex really changed the way I presented myself so I was ‘respectable’. Don’t misunderstand me, I actually gained a lot of confidence in the teachings around modesty (stopped NEEDING to show my skin to feel pretty or desirable), but ultimately my ex’s view of ‘proper modesty’ was damaging. Realized that there is no shame in my body, naked or fully covered. And my value and worth doesn’t change whether I’m on insta in a floor length skirt or my underwear.", "marthasnowden": "I have a question... My loml and I are in thia weird place because he loves animals and I not so much . he has a husky that he that he allows free run of his house and him and it is offputting and anxiety producing for me. I dont like the dirtiness of animals in the house let alone what I feel ahould be our private i timate space like the bedroom. Iys distracting during sex its distracting all the time because she isnt trained well she steals shit destroys ahit steala food and ahe has attacked me trtinf to bite me she mauled my back a few days ago.. Is this negotiable in a way that is reapwctful of him or am I asking too much and not respecting him for wanting him to change how he interacts with her", "msdangergalore": "I just wanna know what song that was and what are some of your favorite Bollywood films & actresses.", "iamcroping": "💕✅", "katylpacino": "Oh my, I am obsessed with that top! Where is it from???", "margorilu": "💖 @shanboody ✨", "loukoumadi": "The best real ass Ive seen on ig in forever", "emycurr": "I haven’t had a relationship in 4 months due to me getting over my ex. It’s hard out here", "shayeedasparkles": "No", "kait.monroe": "@laignerlmassey this🙌💜", "xfkn": "such an icon", "james_navy1976": "❤️🔥❤️🔥🔥❤️🔥❤️❤️💯💯🔥💯❤️🔥🔥❤️💯🔥💯❤️😘🍷", "nikita_s_karim": "omg the first song, yass Shan!", "aitzaescobedo": "And goddamn your boy is hot, just saw the last pic", "ultravioletx88": "Love this. You guys are a beautiful couple, and I mean that in the full sense of the word not just regarding physical appearance.", "sunchild444": "I haven’t changed the way I present myself for my partner; it has changed as I grow older my comfort level moves as it relates to my clothes etc. I am still who I always was just in different wrapping and my partner never tells me what to wear/what not to wear", "roywoodstoronto": "Love this 👏👏👏👏", "cshe.writes": "Girl your butt is cute! I had no idea you had that back there 😂👏🏽", "_jazmynanderson": "No, never. I feel like if we come together it’s because of how we each present ourselves that way it’s not a discussion? I feel like that presentation can always be added to enhanced whatever that means for each couple, but when we linked I liked how he presented himself already and could see us representing well.", "tikobalyanfitness": "Had an ex who smoked cigarettes and didn’t exercise and didn’t eat all her nutrients, when I told her to change she took it offensively, and she never changed, so I left 🤷‍♂️", "themusclemaven": "The color combination here is everything 💜", "rmj5009": "Yeah I asked him to stop being an idiot and he just couldn’t. 😂", "indiaysabel": "What is the song ??? Unrelated to the post I know😫", "crazy_jo87": "Turn around one more time. Let me get a good look at it.", "susan.0127": "I dated a guy for a year who was very into a certain look. He never directly asked me to change anything and complimented me ever so often. But I found myself, over time, dressing to appease him and make him more attracted to me. It was a subtle thing that happened. And only after we broke up did I realize. The next guy I date, I met on an app so did a few months of actually going on dates and I always did my hair and dressed cute, but in a way that was more reflective of my personal style. He told me I was beautiful, hot and sexy allll the time. And once we got passed that stage and more on a day to day basis I was totally comfortable being my normal laid back self. And he still told me I was beautiful, hot and sexy alllll the time. And when I got done up, he appreciated it a lot. But he also appreciated me and my natural beauty and style. It was great to be in a relationship I could be myself completely. I think it’s nice to do something special for your partner, like if they love your hair styled a certain way. But be you and do you. There is a line.", "dionne_matt": "People are too brainwashed about their own bodies. And egos destroy marriages and relationships.", "mali__rose": "💕💕💕💕💕💕💕💕💕love this babe 💕💕💕💕💕💕", "ohhellonikki": "So where can I find a top like that", "dreamsnjourneys": "😂😂😂😂😂........🖤🖤🖤🖤🖤", "ms.paolairy": "I love matching with my girlfriend, but it’s always in HER style, with whatever she feels comfortable wearing. And we do it only when going out with MY friends, because that’s what makes me happy. Done respectful of each others comfortable levels and styles is fun.", "sheis_sabrina": "I personally think it's weird to ask someone to change how they present, because that's who they were when you met them. My experience has been when people have wanted me to change, it was because of someone else's opinion of me. Not their own.", "liv2wynn": "I feel like this is an EXTREMELY relevant topic in the LGBTQIA 🏳️‍🌈 community", "beckystew87": "Love this!!", "alley1328": "Omg I love I AM BODY BEAUTIFUL by Salt N Pepa!!! I play it every time I get ready!!!", "marieaz44": "This is so cute", "imanibrammer": "What's the name of the Jared song @enjoyjaredbrady is playing??", "pj9381": "My current relationship I am enjoying what we have because we both elevate each other. When we met he was more quiet, reserved, and not to confident, I am outspoken, crazy, and independent, during this last year of being in a relationship I have helped him think outside the box and elevate his mind, his goals, his achievement, and he has elevated me to pursue opportunities, think of other alternatives. And calm my crazy down. We have had if any maybe 1 argument but we are talking about elevating our careers, our money, purchasing a house very soon. And what I love most is we haven't changed each other we just enhanced the good that each one of us had. ❤️❤️❤️❤️", "_itsniques": "Beautiful definition ❤️", "kiki_kensington": "Feel free not to answer but what brand and kind of underwear are those! I've been looking for something like that for a long time!", "ambernicole___x3": "Okay Q2 : okay so I'm really having a hard time understanding this question. But I'm gone try to answer it.. The relationship that has is if I don't respect my partner they not going to be calm and that's with anybody then they gone benefit from the situation because they get the chance to think. If I respect my partner then they'll never know I'm mad. Allowing me to benefit in plenty ways, growing into a noble human being.👀", "organicallycheeba": "No. For me I accept my partner as a whole in who they are. Even the things that can be difficult or frustrating. I do believe in boundaries however. If i find something to be disrespectful or harmful to my well being I will create space for myself. I do think there is a relationship self and a single self. I don't think there are rules specific to gender.", "__dirtylilhippie94": "Yaaaase Shan!!!🔥🔥😍", "kkatarina8890": "It sucks when someone tries to change you. My husband allows me to be me 100% and I'm sure as hell going to do the same for him. Sometimes I notice I want to say something to him when I see my family judging him for some of the things he says and does.. It is the desire in me to please them and to make them love him as much as I love him. But I stop myself because I don't want to do that to him. Craving my family's approval is my issue, not his. And there's something so freeing about stoping yourself from caring about other people's opinions and just enjoying your relationship and the person you are with. I love my husband for everything he is.", "thehartwithsoul": "i won’t ask you to change physically (you doesn’t need to anyways 🤷🏾‍♀️) and i don’t DEMAND that you wear certain clothes but i do make suggestions on what i think looks nice! i do encourage you to try out ideas you have on your own like certain clothing and hair choices, right? 😅idk @martindarazs", "ja_naked": "Ooowah! Your man is glowing 😍🔥", "andreaheard_": "I had a partner who was grew very tricky about this type of thing. And it scorned me. It was not like that in the beginning but as time went on it got to be extreme. It started w tights. He told me not to wear them outside except for when I worked out. I worked out and showed up to his house w them on and his friends were there and he freaked out. We eventually broke up and I had to do some real self work to understand how those were not my issues.", "26g_26g": "I couldn’t handle you if I tried😴", "tontaconcha": "I remember this one time I posted a pic of my makeup n I was wearing a sports bra n my bf at the time called me telling me to take it down bc I was slowing cleavage ..... I took it down to not risk having a fight but a fight happened anyway. Looking back on that day I should have realized that it was the start of him finding new ways to control me/ then isolate me. I know now that it doesn’t matter if my whole tits n ass is out, I won’t let a man tell me what I can and can’t do with my page , my body 😌🖕✨ never settle babies. With time a great love will come", "hellefire": "@kammynaidoo this is the boss babe I was screaming at on the screen when I saw her on too hot to handle! She is EVERYTHING!", "ms_hue": "@shanboody I just love the way you explain everything 😍😍😍", "georgiadawkins": "👏🏾👏🏾👏🏾", "see_koya_": "@prettylittlefittie88 💜💜", "joan.rupram": "I need to be able to have me ALL OF ME and you too. Im single AF right now navigating experiencing the loving gaze of my own eyes on me. Experiencing joy of being and caring and loving me. Experiencing divine supreme love with me. This devoted relationship with my divine nature means learning to love all the pieces of me before sharing these pieces with a partner. Loving me this way helps me learn to love another through the devotion of my gaze that I practiced on myself. I can just be love with you as you learn to have and be with all of you. I don't think I answered your question, but I feel my lover will understand this idea of having all of me and you too. They would need to have all of them first before I give them any of me ❤", "demandaxo": "I had an ex who straight up made me hate my body because of his constant comments about how HE thought I should look and present myself in general and online. I think a lot of that commentary comes from a place of insecurity (or a need to be in control which is low key abusive) and when you’re secure in the relationship and respect your partner’s autonomy you know you gotta accept them as they are or move along. I have definitely had to reform my way of thinking about my partner to align with that (because ya stay with someone who controls your image long enough and it’s a big part of how you relate to your partner). Forward progress is progress tho.", "leo_el_creo": "I tried to get my ex to try dressing in a way that exposes a little more skin, like just her belly or some cleavage or some leg. She was straight from Vietnam so other than wearing skinny jeans she dressed very conservative. I also wanted to elevate my own dress. I didn’t really think of it as wanting her to do that for our image as a unit but I guess I did want to be seen every once in a while with a girl that would make everyone around her gawk if I’m being completely honest. I wanted her to turn heads like she turned mine when I saw her with less clothes or in certain outfits. I don’t compare instead when we’re alone I let a woman know how sexy or pretty she looks to me when she tries something on. Still my ex never could wear what I wanted her to because of family, but my current gf has this amazing big smile whenever we are at the mirror and I’m like “DAMN!!! I like you in that!!!” So I literally just asked her if she likes it when I suggest she dress a certain way while typing this and she said yes but it’s still up to her to accept that suggestion because she prefers to dress comfortably and that is what gives her the most confidence.", "alyssawilliams444555": "I love this so much", "deltatail16": "👏🏾👏🏾👏🏾👏🏾", "wzmi157": "She so damn fine", "verapapisova\nVerified": "Verified", "freespiritstuff": "That’s my song!!!!", "dee_da.demon": "Lmfao whats the name of the song j was dancing too, i fucked around and started dancing with him 😭", "victoria.the.poler": "I’m actually struggling with this now. When I met my spouse I was 17. Didn’t know who I was as person... let alone, who I was as an adult when I hit 18 and set free like a bird. With all that freedom I had to find out the things that make me happy without the parental control hovering over. The adult me is completely different than the “under parental control” me was. Now at 24... I joined pole classes, I buy sex toys, I want to wear anything that makes me feel sexy. Unfortunately, my man doesn’t allow for that. I can do all things that make me happy behind clothes doors, but when I walk out the house I am to be modest at all times and “not ghetto”. I don’t put any restrictions on him. He’s a black male with macho views. Toxic masculinity. He does what boys do. Gym, basketball, play games. It’s not like he’s rolling down the street naked. So there are no restrictions I can put on him. But for me... when it’s a swimming pool situation, he wants me in a one piece with big shorts. He doesn’t like when I wear tight shorts in public. V-necks are out the question with my D-chest. Showing midsection?? 😂😂😂 not going to happen on his watch. He’ll tell me things like, “you asking to be raped” 😮🤔🧐 like what!?! That’s some bull. I hate it... I really do. But I’m so use to it by now that it’s second nature to go shopping in the men’s section of clothes for sweatpants in the summer. 🙄🙄 it’s bullshit.", "zonohedra": "damn hot. black cakes!", "t_es_14": "Hot couple 🔥", "shesabakingfool": "The only thing I have in common with my boyfriend of 12 years is our mutual understanding of morals and respect and for us it equals love for one another. The other stuff doesn’t matter, plus we are able to teach each other new things in so many areas by bringing something different to the table... I don’t try to change him and he doesn’t try to change me. Also, I don’t like being told what to do so I needed a strong willed man to stand on his own and let me do my own thing 🙌🏼", "xtinajlife": "And they wrote bf ....", "solovalentino": "Thank you for giving me a response to people who ask me the same thing lmfao!!!!", "iamlyrasis": "Love this RESPECT ✊🏽", "misscoryb": "Girl your butt is (and I cannot emphasize this enough) INCREDIBLE 👏🏻👏🏻👏🏻", "daddyspumpkin86": "I would never, but I didn't marry my husband because he needed to be changed. We are who we are and we accept eachother for that. My husband has changed himself all on his own because he didn't like who he was.", "karinmat1": "Tbh sometimea it's hard... My boyfriend never comments anything bad about my look, but to me it's sometimes challenging - I don't like when he's not getting a haircut / some of his clothes are not a good fit for him, etc. I always try to express he's perfect no matter what, and most of the time he doesn't care changing these stuff for me, but I then feel bad when he does... I guess it's normal to have a preference, and trying to please your partner (when it's something you're fine with), but it's a thin line...", "jenova_juliann": "Ayeeeee! Connecting with your Indian side 🔥🔥🔥", "kbass2.0": "I love everything about this, thank you for sharing!!!💛", "thiruswoop": "Anyone know what this song is plsss? 🙏😫", "annamaskos": "When I first started dating my now husband I realized that I was projecting body issues shit onto him and started thinking about why I thought my partner should look a certain way and realized it not only kept me from letting myself have this deeper relationship that was developing, but also made me realize: Just like I don't want any man to dictate my body I have no interest/business doing the same thing to my love. Working on this helped me work on my own body image issues and one thing I came up with was ditching the scale. Good stuff! 🔥👌😊", "resha_indiamorenita": "Depends on what the change is. The core things like open communication and honesty should be forever but if it isn't it should change.", "maru.ohi": "Loved your answer 💜", "donttelldevan": "I JUST WATCHED “TOO HOT TO HANDLE” ON NETFLIX AND BABE!!! 💓OMG I WAS SO HAPPY TO SEE YOU, I couldn’t believe it!! 💗Congratulations to that opportunity, it was amazing watching you work with the group! Love u always 💓💓", "kelseakittens": "Your intelligence and insight is so inspiring! Not to mention couple goals!! 🙌 Thanks for the constant encouragement in being who we are and supporting each other through our journeys. 💖", "_b.ellex": "Healthy balance of accepting someone for who they are but also being able to Express you're true feelings to your partner without fear or repercussions for the honesty. Freedom in love 💛", "forest_nb": "Nope she’s her and I am me. We exist as partners and as long as she’s happy with how she presents and the same for me, that’s all that matters. The reason why we are together is because we like these things about the other person.", "kaylarwhitley": "Love this! Recently had a conversation with my best friend about an interaction she had where her boyfriend told her he thinks those kinds of pictures should be special for him. I’m glad that she didn’t attempt to compromise who she is by telling him she will stop. She had always posted pictures in her underwear because it makes her happy and she shouldn’t have to stop just because she got into a relationship.", "gulleyty": "Sexy😍", "denzelwenzel": "I dont really relate to the whole idea of \"take as I am, or not at all\" In my experience, a good relationship helps you grow as a person. I might be a little coloured by the the people I've encountered, who (in my perception) mostly use that mantra, as an excuse to act like self centered dicks, towards the people around them", "rukhsultana": "I knew my relationship with my ex was heading downhill when he asked me to shave my nipple hairs 🥴 honey I’m a fuzzy brown girl and you’re gonna either take it or leave it lol", "nad8211": "(1) Have I ever asked a romantic partner to change how they present themselves to fit with how we saw ourselves as a unit? To be honest, I have. This was also my very first relationship. (2) While I'm not currently seeing anyone, respecting my partner and expressing parts of myself should coexist. (3) In my view, there is a self which always changes whether in a relationship or single. (4) Honestly, I don't know if there are rules specific to gender.", "itskcity\nVerified": "Verified", "juancontrol": "“Are there rules specific to gender?” Distortedly, yes. Of course there are natural differences and specificities that need to be address and handled for our health and well-being but Societal Rules certainly the loudest that followed and regarded. I carry my opinion silently that a form of expression performed by a cis man can and should be performed by anyone else if their heart’s desire the act for self gratification. As long as this person is doing this for the fulfillment of themselves...then go. The rules do not apply in my view of the world however I am fully aware that Gender Rules are real and abided by.", "christyarseneault": "You guys are the cutest, 😘", "justinediiane": "are those the @tomboyx underwear??? 😍 so cute.", "missashleighlove_": "🔥🔥🔥", "viedelanature": "I’ve been expected to change and I expected the person to change as well- until I realized we were just not the match for each other AT ALL. So I hope I’m as accepting as I expect my partner to be towards me whenever I do enter another relationship.", "mesflow": "@jay_birdie 😂 Why does she remind me of you when she does the movement with 🙏", "findpeacewithin": "That Booty though 👀🍑🔥", "shaun_rolo": "Women have asked me to do that several times. Since I always refuse I'm still single lol. I figure if you want me to be someone else to fit your vision, you should find that person you want me to be", "zulmita8877": "At the beginning my boyfriend started pressuring me to dye my hair black. I thought it was cute so I did it. Mom this later I caught him on his dm’s talking to some girl and she had same hair color and style he suggested, a couple of months later I discover a bunch of pictures of his exes same hair color and style. That was the type of girl he liked. 🤦🏻‍♀️ I think get it know the person better, if is something to make you both look as a couple I’m on board but if it has anything to do with his past like I found out months later, no.", "ms_leahr": "Love that you book ended the album with another underwear dance #doperelationship", "notur.bbygrl": "@zeeez good read", "dnario_dunkin": "That’s the thing ALOT of females nowadays don’t even tell you who they really are until it’s too late and they end up getting caught cheating at least your honest", "a.kyle.francois": "💖💖💖", "superbstyle": "Wow. That’s literally my song !!!!!!! Yas Shan", "mommielizz": "I LOVE THISSSSS!!!!", "luckyy18": "I absolutely hope I don’t get someone who’s that controlling I wish I find a partner that allows me to be free respectfully and that this wouldn’t even be a conversation being in my home with my partner if I’m lounging in my drawls In my home and I’m dancing around drinking coffee and if I wanna post it my loyalty should shine through none of the responses should matter if my man cool with my comfort then why would he trip if I post me being my free self", "ahh_my_knee": "Yass slum dog millionaire soundtrack 👏🏾👏🏾", "leil_cooks": "I’m convinced you’ll be amazing for my whole life", "kelly.renn": "In the past My ex would try to put me into a box. The thing was his came from a culture that often dominated my own, and would put me down as if my culture (Portuguese) wasn’t as good as his (greek). They had traditions that even me not being from the same background was expected to follow if we ever got married. I would have to convert religions, i was not allowed to name our kids because it had to be after the parents. And i knew if we ever married i would not be happy so when we ended things i completely changed my life around and much happier. Now I’m dating an Australian and he likes me just the way I am and I like him just the way he is! Often I tell him if he ever wants to change, it’ll be because he wants to and i support him not because i would force him to.", "easleydone": "I think a lot of boys can't fathom their women being eye candy to anyone else. If we aren't an open relationship then I'm totally fine with the thirst traps until she starts contributing to those other men thinking they have a shot. It would be the DM flirting, entertaining, and giving off mixed signals to other men is what would annoy me.", "theshelahmarie": "Girl this is me every time someone asks how Aces feels about me being on IG in swimsuits etc. He feels fine this is who I was when he met me 🙌🏾", "primarhyma": "🔥", "bettina_schurek": "My man @w.walterson always asks me to remove my make up, cause he prefers it that way🙏😍🤣❤️", "shanillia26": "Love this so much!!!!!😍😍😍😍❤️❤️❤️❤️", "kontrolthenupe": "So I was watching \"too hot to handle\" on Netflix the other day and I saw you on there and I almost shrieked with excitement! Lol @shanboody I enjoy your work! Keep it up!", "vanessasubmarine": "I love both of your genuine and authentic smiles when you’re dancing for yourselves! I love this! 🔥👏", "vintagedollface": "My bf is currently in the process of growing his hair longer and he has a full beard and everything now before I was like no don’t do that but now I love it he looks even hotter now 😍❤️", "bdeleonart": "😍😍😍😍", "aliciaaa_rae": "LOVEEEE this 🔥🔥🔥♥️", "delia0692": "This is amazing ♥️", "sourceofsol": "I asked my exes not to present as liars and to not entertain women that wanted to have sex with them. I felt that would affect our unit in a negative way", "casharroyo": "No, I’m sure he might want me to change my social media image. I won’t though. I just feel like you met me this way, why change me?", "emgasper": "I wouldn’t want my partner dictating how I dress/look, so I wouldn’t do the same to him. I think it’s actually a turn on when a partner says that you should dress/look/groom however it makes YOU feel good! 🧡", "stoned_witchery": "I want to be confident like this 😍😣", "amillionminds": "I’ve asked my partner to be more active recently. Mainly, because he’s made comments about how good he feels when he does them. And I notice how positive and patient he becomes when he does it. I’m not implying anything weight-related but I love that it makes him feel good first and the results that come with that aspect of self care for him. 👨🏻‍🦰💗", "maggiegreenie": "Coming from a conservative and white family, when I started dating my partner who was raised completely different, I tried to stifle his humor and personality around my family. I would tell him not to wear certain clothes, not to say certain jokes/words, etc, and it only hurt our relationship in the end by making him think I was embarrassed to be with him. I decided to let him be himself around my family, because I love him and support him when they’re not around, and I want them to get to know the version of him that I see. I used to want my family’s approval so badly, but I realized that I don’t want him to change who he is just to gain their approval.", "triniainteazy": "@quintellbrown 👀", "mariah2saint": "Love this, a great point", "satorizy": "Whtas the song of Jared?", "kece47": "How’s underwear any different from a bathing suit thong looking bikini ??? Same thing. If not it’s covering more of her body than a Vicky secret underwear ad. I love how she stays to herself no matter what. Why can’t anyone be fine with seeing someone happy and dancing 😍❤️ she’s great", "rawguju": "Why stop here let’s get you some Indian clothes girl 🙏🏽💯😂🇮🇳🔥", "heyy_arii": "My ex literally told me how he expected me to look , feel , and act with him and made it a huge point later when i was breaking up with him to say i wasn’t doing what it takes to upkeep a relationship ... it then occurred to me that i definitely could not be with someone who doesn’t just let me be who i am and vice versa", "efh_76": "I definitely find myself doing this. I get stressed about the future and become very critical of my partner and how they present themselves. I was fortunate enough to be able to get some space from my partner and relationship and it really reminded me that what I was focusing on was unrealistic and harmful to our relationship. I fell in love with the person I met on our first date not the person I saw in my head. Getting perspective helped me remember that and it's a life lesson I'm not going to forget any time soon.", "lizdaponte": "Before quarantine I was tryna make my man not wear tall ass white fruit of the loom socks to the gym paired with all black sneakers 🤦🏻‍♀️ that's it tho 😂", "otra.nicole": "What about a partner that doesn’t pressure you to act/look different than you actually are, but is constantly praising girls that are nothing like you unconsciously raising some insecurities?", "sera_knee": "Cuties 😍", "real_illest": "my ex used to ask me to dress like sloan from entourage...which is nothing like my personal style; that relationship didn’t last long", "melanininfusedglow": "Its whatever works for each relationship...", "thatswright": "Yes, I am guilty of asking my partner to change. I had to self reflect, if I am constantly trying to change this person for me. Do I really like this person for who they are? I came to realize that I didn’t truly like my partner at all. That’s why I kept trying to change him. It’s not that he was a bad partner or person just wasn’t the right person for me.", "drawanna3": "I’m the first to say that I don’t know how everyone else is, but I know that I really need the space to be my own person both single and in a relationship. Therefore That can actually be a sticking point for me. I had a past relationship that asked me to hide certain parts of myself. That act was a signal to me that that person was not right for me.", "djbombae": "my desi queen 😂❤️ busss off yuhself to that ringa ringa 😂🔥", "pris.cilla11": "💗💗", "pretty_mfn1": "Omg I know and LOVE the movie this song came fron", "thedesertmarigold": "I'm in a new relationship & ideally I would like my partner to be in better shape. I love him as he is of course, but I see an image of him in my mind where he's healthier, fitter, happier, just as a I do for myself. I've wondered, is that bad? I basically want my partner to lose weight.. I'm aiming to make this the healthiest relationship I've had, & it already is so far, so I don't want anything to intervene with that", "luisitothe_entrepreneur": "@shanboody I mean that is relationship suicide. Men will resent you and the first chance, he is outta there. I wish a woman would try to change me to their standards 🤣😂🤣😂 Good Luck with that", "muvaluna_": "Why do men desire women who are over sexualized, yet if their partner did anything similar ex: twerking, dancing in underwear, wearing a short skirt/tight dress or any normal sexual expression and all of a sudden you are like “those girls” and now undesirable to that person? Is it all just ego to fit the image THEY see fit for you?", "kashani321": "I love how you are always on point with the educated responses!!! ❤️", "sarikasamosa": "AN INDO-CARIBBEAN QUEEN 🌺", "vaginajpower": "I had an ex who was pretty much rude to waiters but nice to me and i wanted him to change how he interacted with others... i realized there’s no changing him that’s who he is LOL rude 😂", "sadebomb": "I appreciate it when my partner helps plan outfits with me when we are dressing up for something fancy like a wedding. But otherwise we don’t care. We more often end up realizing halfway through the day that we accidentally both put on our @surlybrewing or @edsnonamebar shirts that morning 🙄 haha but that’s as far as it goes.", "shellyifyanasty": "single self and relationship self should only be separate as it pertains to growth from one into the other and vice verse... I want a person to love me for who they thought I was when I was without them, that’s a love that doesn’t ask for anything. how ever it is that we evolve and the questions that transformation poses for us are valid, those are “we” problems... but who I am is who I will be as it pertains to single self, those are “me” problems, if you didn’t like those you should’ve left me be.", "mwg38": "I’m sure this has already been said, but dude looks like a young Maxwell.", "ameliapass": "I love you guys that’s all I have to say bye xxxxx", "tiffanymalonee": "I ain’t got no man Shan! 😭", "edwardistheman": "For some reason I really enjoy watching the first video @shanboody", "freshheir7": "So I have experienced the desire for my partner to want me to present a certain way. Although it made me feel uncomfortable as I got older and entered the phase of woman I wanted to be I realized the benefits and the power I possess by doing so. So it upgraded me. It's just the approach is important when preserving the security within the relationship.", "_jesssieb": "😍😍🔥🔥", "lozbux": "❤️❤️❤️", "vampiresarecreeps": "After an ex wrecked my self esteem through criticisms about my weight/body, I’m careful to avoid commenting negatively on anything that clearly makes my partner happy/peaceful/joyful or even is just a neutral thing, especially if it has nothing to do with me. I have no pressing urge to make him different. He is who he is and maybe he’ll naturally change because of my presence in his life but if people think we don’t “match” then they’re mentally too deep in our business and need to face forward.", "alteredpoca": "I used to have a partner that suggested i put on his sweater whenever he thought there was too much skin showing", "anondi": "Yep, does not end well", "tanja321": "Me and my partner started our relationship with him coming from a culture where topless on the beach is prohibited by law and he also shared those views. But through our relationship he’s grown so much, so that now he supports me having an Onlyfans. He even takes the pictures for me 😆😆 so yes I’d say definitely in the beginning he tried to make me cover up a bit more, but then later, when he learned to trust me, he became super supportive. Key was really getting to know each other and him realising that even if I send out pics of my boobs for money, it’s not threatening him. I am and always will be his partner and no matter how many guys slide into my DMs, it will stay like that. And that’s really something he had to learn and I had to be patient with him (because I’m someone that likes being naked A LOT and I remember how uncomfortable he was when I would just walk around in the sauna naked, when I could have wrapped myself in a towel). Anyways, I’m super proud of him, and how we grew so much in our relationship 😆♥️", "belikechance": "Like I always say, relationship should always be about \"what you see is what you get\" trying to change anyone to suit ones perspective is a waste of time and a total disrespect to who they really are, you don't own them just because you are in a relationship with them.", "niqueexplainsitall": "I love that!!! Yes Shan! So many times we alter ourselves in relationships because others deem our behavior no matter how natural inappropriate! Y’all both keep dancing and loving on each other! Bump the haters!", "chrixtinai": "I never thought about this but my now husband used to only get me designer dresses and bags and at first I was like why?? Am I not good looking as I am? But he knew I never liked spending money on things like that for myself and then I realized his mom and sister also enjoyed the finer things in life so I eventually shut up and accepted the McQueen bags 😂", "iamkenyam_": "“Boyfriend?” What non-fan sent that question?", "j.kingqueene": "No, but I used to get that all the time. I wasn't pretty enough, I was too smart, I was too honest and direct. Now that I'm engaged to be married all the things exes put me down about are the things my fiancee cant get enough of.", "ashleyraefitness": "@schavrick", "yvettecorinne": "Bodyyyyy 😍", "meherguptaa": "Yasss we love the Indian side coming out", "iam_lroze_": "Ugh that song was my fave from SlumDog Millionaire", "britdickey07": "I’ve had someone ask me to change. I’ve always wanted teal highlights and my ex said that since we are an item that I represent her. She said she would tell all her friends and family that she doesn’t like the highlights and doesn’t know why I like them. Sooo... I didn’t get the highlights. 😩😂👎🏾", "pandaxotic": "Never did and never would ask that to my partner, there are times where for example I don't really like the way he shape his beard or something but instead I try to tell him that it's not my favorite look on him but that he's handsome either way and that doesn't change how I see him ! I've never been asked that either.", "fallon.corinne": "I absolutely adore your energy and how open and free you are with yourself!!! It gives me LIFE and helps me to be more courageous with myself 🥰🙏🏻😍💗💞 Keep doing you, boo!!!", "raqhavisham": "I had an ex who would always make a fuss about me wearing shirts that showed any amount of cleavage, despite that being most of what my wardrobe consisted of- work clothes included. He would say that I was making him look bad and make me feel insecure all the time that I ended up buying a whole new wardrobe and felt weird even about showing my shoulders! Mid you he didn’t start doing this until we moved in together!", "ataleaboutagirl": "YASSSS 👏🏾👏🏾👏🏾 LOVE THIS!! ✨✨ You’re gorgeous!!", "mskimdan": "🗣 You BETTA tell it Sis! 👏🏽This 👏🏽 Is 👏🏽 Me!", "ourveganvilla": "When my daughter-in-law and son started dating, my son had worked for Ralph Lauren and was very much into clothes. He had changed careers, though, and had entered the military. She was former Air Force. They had a conversation that she initiated when they were about a month or two into dating regarding how they dressed. She told him directly that she was not a dress-up girl. She said she did not mind what he did, but if he was looking for someone to match his concern about clothes and dressing up, she needed to know, because she would not be the girl for him. He told her he didn’t mind and after about a year and a half he told her thank you for taking the pressure off of him that he put on himself regarding what he wore every day. He told her he appreciated feeling comfortable at all times with her no matter what he put on. Just thought I would comment because being direct helps a relationship and it’s not always that one has to “come up” to the other. It might just be that the other person needs the freedom to relax and become comfortable with who they really are.", "bellaagolden\nVerified": "Verified", "julesaujus": "I used to - I don’t sacrifice my true self anymore but it’s def something I did!", "cashman59": "Beautiful 💗", "reebean": "My boyfriend is def a Type A with super OCD tendencies that have only been highlighted with this virus business. If he’s type A, I’m Type...Z lol. I really go with the flow and try to be tidy but my brain is chaotic in nature, so it’s hard for me to keep my outside space organized. I worry that if we ever move in together, we’d super clash. I’ve brought it up to him and the great thing about him is he’s open to meeting me in the middle. He wasn’t in a relationship for a long time, before me, so I really appreciate the effort he puts into making me feel comfortable. I also understand that I can’t ask a grown man to change who he is but I feel we’re on the right track. We respect each other as individuals and when we come together, we work to communicate and meet each other in the middle. I’ve def become more organized since dating him! Lol", "w1d0wpunk": "I like to sometimes “edit” how my man dresses😭 it makes me feel awful but he has a good style it’s sometimes just too much with too much and so I say that and he then asks what I would suggests and normally agrees but I still feel bad 😂", "wanderingtiye": "Thisssssssssss. I’m constantly debating my freedom to talk to people in public w my SO bc he feels I’m too friendly. He says he loves how easy it is for me to connect with people but it’s clear he’s threatened by it as well. Very very annoying.", "la_noellelissett": "Giving me life girl 😍", "6feetofshan": "Great question! I’m from a small city then lived in Philly for years, whereas my bf was born and raised in a more rural area, his fam owns a farm, he loves to hunt, etc. Hopefully I don’t come off as a b*tch: I have a 2 camo pieces max rule. It started as a joke but now he actually follows it. Otherwise he’d wear camo shoes, camo hoodie, and a camo hat. The worst are his camo crocs, which he LOVES. There are far more important things than style, so I let them slide.😅 But whenever we go to law school events I ask him to at least wear a polo and dress pants, and he does.", "glowco.skincare": "Lol you are everything 💖💖", "artly_one": "❤️❤️❤️❤️❤️🙌🏾", "ashley.clingerman": "First serious boyfriend used to pinch my stomach fat, call me chunky monkey and scrape half of the food on my plate to the side to “save for later”. He wanted a homemaker. A soft spoken woman who didn’t drink. I was 19 and insecure and daddy never loved me right so I dropped to 90 pounds. I started wearing turtle necks and fucking 50s style dresses. The day I broke up with him I put on a crop top, ate a burrito and cussed up an oblivion. My next seriously boyfriend from 21-25 wanted me to do aaaalll kinds of things I was never comfortable with. Wanted me to be a dessert chick with long hair. Never wear floral print because “that’s what fat chicks wear” oh and don’t ever wear a maxi dress around him. He called those “hippy mumus”. My poor husband, once I started dating him I said “I will do whatever the fuck I want with my hair. I’m never going to surf even if you want me to and I will fluctuate my weight like you won’t believe. Deal with it” and man has he loved me for every size and shape and hair color. Took me till my late 20s to finally realize I should be loved for ME. Not a version of me that they liked", "lesego_mol": "I hear you say create an environment for them to flourish in who they are, so what happens when that environment is hanging out with the boys, doing other things except being emotionally available?", "sushi_afishionado": "I am reevaluating my 15-year toxic(?) relationship after hearing you define the word “respect.” You’ve given me a lot to think about.", "sosomiiiiii": "What’s the song he’s dancing to 👀", "chezzaouttanowhere": "I had such a good comment typed out!!!!! And I swiped on accident trying to post!!!", "bayleaf_ball": "I’m now worried I’ve done this, and pushed my partner in ways. But I feel like I have grown from discussions about my behaviors, could things be presented in a way that doesn’t exactly fit this descriptions? Just asking! Love your work 💕", "valinvogue": "I don’t think I’d be comfortable with that. 🤷🏻‍♀️ My husband and I kinda of “match” anyway.", "__._.leo.__": "You’re soo beautiful 😩", "facedby_v": "I would never change my partner ( now ex) but we did kind of upgrade together to fit eachother better if that makes sense", "mr._j._turntine_jr_": "✊✊✊✊✊", "karolynsdiary": "All of my exes used to ask me to stop being my usual goofy, sometimes loud, and energetic self when we were in public because it would come off as “immature”. They’d also ask me to dress more feminine. My husband dances alongside me in department stores and loves when I wear sneakers, I got lucky 😹. I don’t think it’s fair to have two versions of yourself when it comes to relationships and I also feel that men are the ones who typically “expect” a woman to look a certain way, I’ve experienced it wayy too many times myself and heard it from my friends over and over again. But women are definitely guilty of it as well.", "lelahabibae": "I had an ex tell me he prefers me with makeup on and Im not as pretty without it lol. I basically never wear makeup unless going somewhere nice. We had to have a convo about if you want me to dress up more, encourage me to do so by taking me to nice places, not shaming and criticizing me into being who he wants me to be. His delivery was trash and so was the message.... I’m not wearing makeup 24/7 to please you sir. Cc @sandababyyy because she has the same trauma from the same ex 🤣😭", "kikiwithki": "I mean... Is it really yalls fault y’all are so fine? 😂", "big_iis": "G uh m", "taylormaesh": "My opinion might be odd but I think it’s %100 okay for him to express himself as freely as he wants.... however I do not appreciate if he still talks to other women as if he’s single! That’s where the “single self” and “relationship self” are separated for me.", "somi.marie": "@nimbus_lyfted", "sam.i.am365": "You’re so beautiful 😍👏🏼", "nezziibabiii": "What is the song you husband dancing too? I need it 😂😂", "alexisknm": "@shanboody Also, this post shows me that you’re a way better dancer than @enjoyjaredbrady 🤣", "tiffynco_": "His hair is gorgeous hunny!!", "teasha_da_best": "Nope", "mskaimichelle": "No, I’ve never asked a romantic partner to change how they presented themselves. However, seeing how a potential presented himself changed my mind on wanting to go out on future dates. He didn’t care how he looked. Like he rolled out of bed each time and popped up. I mean grunge rough looks come with minimal grooming right? I wanted him to match my energy on all levels and that include self care", "covenant102": "😍", "hopelessvirgoo": "Bollywood 😍😂", "indtoronto": "Hit us up for all the chutney & bolly songs old and new 😚❤️", "camiladuarteitg": "👏👏👏👏", "deborah_amanda": "I love you guys! Thanks for being such an inspiration for young people. We really need better role models when it comes to relationships and how to grow them in a healthy fashion. 💖", "uzimadancefitness": "I hope all those that were 🤢🤢🤢grossed out when @lizzobeeating was dancing in her underwear, can see their hypocrisy and hatred of fat bodies now that they're liking and commenting positively here. Beautiful!!! Both ladies.", "cocoapuffs_": "Love this💕", "thekimmakin": "@shanboody I think there is a relationship self and single self, although I don't think there should be. For some reason there's just something that 'unsettles' the single self when you say \"I'm in a relationship now..\" I think it has to do with internalised monogamy in heterosexual relationships 🙄🤷‍♀️", "art.of.divine": "Change of appearance is no big deal if it isn't a big deal to them or for special occasions", "__maliarose__": "@shanboody thank you. A word 🙏🏽", "phoebetay.lor": "I try to consciously evaluate why or what I’m asking my parter to change/shift. Cause like 90% of the time it isn’t about him AT ALL and just my own shit coming up 👏", "amaniyasmin.photo": "I love you both!! Expressing your true self can be hard in our society but it doesn’t have to be. I will say though I have done this and I am more conscious of it. I would love and appreciate my partner to be who they are inside and out and to not change a thing about themselves", "alainarodela": "What's the song, with your hubby dancing 👀", "mrsrjh": "Tell’em!!!! Some people who aren’t or cannot genuinely be themselves will not understand this; therefore, they will project their insecurities and belief systems on you because it’s different from theirs. Thank you for keeping it real❤️❤️❤️❤️❤️❤️", "mike_ddzz": "@shanboody is that an Egyptian dance 💃 looks Kool.", "kmakesart": "Amen!!! 🤗❤️", "arie.x.b": "I want this level of freedom in my relationship.. I want to encourage my partner to be his whole self and I do the same. I don’t want the type of relationship where someone acknowledging my partner as attractive is disrespectful to our relationship", "gentillybree": "You look great and ima go workout now.", "stillnotdefined": "Love you & J 💜", "idoobie.puissancegod": "YES YES YES!", "m.pereyra7": "You are soooo beautiful and i did not find this video thootie at all 😂😂 @shanboody", "sochi_bashful": "I’m really trying to see who has better hair? Like this is a serious curl battle. Forget the under wear whose curls was more popping and had better volume and bounce 😂🤔.", "el.socio__": "I’ve never done that and I think rather date someone you see in that image already? @shanboody please please have a thread/question/video about passenger partners ie: partners who expect to be dated but not do much in return and how that actually affects the willingness to give effort from the giving partner. Please! I feel like more people need to be introduced to that convo", "christinareka": "As long as I don’t feel disrespected I’m happy. If I feel that way because of my partner’s actions I make sure to communicate it, and we can work it out, trying to get to know each other’s perspective and boundaries. I don’t think that’s bad 🤷🏼‍♀️ and I’m not talking about like massive things that oh you need to completely change yourself. But I think being mindful of how the other person feels as long as it’s reasonable is important. If we found the right person for us they will like who we are in what really matters anyways. 🙌", "jonesthaman08": "Goals 😧💯", "hadassahisme": "You and your husband are so beautiful 💕💕💕", "weezywtf": "Ugh you guys are so hot", "tooswag4uboo": "My journal is calling...!!! Thanks @shanboody for the insightful prompts.", "_mel_i": "my man wanted to elevate my look so we can match as a couple, then sure yeah he could buy me a nice bag LOL i won't deny that. I'm happy my bf gives me the space to do my thing and doesnt judge me but ive had guys in the past that \"prefer when my hair was blonde\" or \"prefer my long hair\" or try to dictate my hobbies and i hate that. U either like me or u don't what does hairstyle have to do with it? I would never ask my man to change but regardless with a partner u start liking similar things and its just normal to role model off each other i think as far as style and lifestyle. Relationships that support each other mutually in all aspects is goals to me. Insecure people will ask u to change for superficial reasonss!! Pick partners carefully please everyone, give it time to ensure u have a good match, get to know each other and figure out what theyre all about so this won't happen because it sucks when it does! 😩", "tanyamaybe": "I have been asked to change my appearance to look less queer so we would get less stares when we were out in public. Is that sorta what you mean?", "arewrld": "This is so good!", "nvcola": "😍😍😍", "dennydiaries": "I try to make sure my single self aka”my true self” align with my relationship self ... sometimes that isn’t as easy as said just because when i fall short it’s easier to let myself down vs “feeling” like you are letting your partner down:: example my single self may go to bed without doing the dishes but my relationship self would feel less then (even tho my partner would be fine with helping out with that chore) it’s definitely a mindset thing ... well if you picked the right partner", "whynotwellness": "Beautiful couple!! #relationshipgoals ❤️", "withashsullivan": "So much freedom and beauty!! But nope, in my marriage we choose to make adjustments based on the needs that we personally feel for ourselves. If something makes the other uncomfortable we are always open and honest with each other without fear of retaliation.", "onyyria": "Omg Shan Im watching too hot to handle and when I saw you I got so excited!!!!!!! 😍", "mzmarey": "Unfortunately there have definitely been moments in the past where I’ve wanted my partner to change something about themselves according to my preference. It took a while for me to realize that it was my responsibility to deal with those emotions of discomfort instead of projecting it on my partner - it was honestly more of a me issue than them, that I needed to grow out of for our relationship to flourish. I fell in love with them for a reason.", "kenclareben": "no but I have been the one asked! was a definite red flag, and surprise surprise we are no longer together 😇", "chaneldisla": "You and Jared are so toned jeez 😍👏🏽", "e_koala_ty": "I'm sorry when I look at her in her underwear I'm not thinking damn she got body or anything of that nature (though you do gurl 💁🏻‍♀️@shanboody ) but that thought is secondary and a compliment rather than being fresh. What I first see is a woman being happy dancing to what I believe is her cultural/traditional dance and if not then someone exploring into it which is a beautiful thing to expand yourself 🖤🍃", "ishani_rose": "Where is this song from and why do I know it lol?", "queerblacktherapist": "This is interesting. When I was younger I had an image of how I thought my partner and I would look like as a unit, but it really boiled down to me having a partner that was seeking comfort in their own bodies ...through everything looks amazing. I don’t think there is a relationship me and a single me...I gotta ask my tribe to see how they perceive me because I feel pretty consistent 🧐🧐", "ash__trey": "I used to try to shape my husband into being someone different before we were married like cutting his hair for example. I def realized how fucked up that is and stopped doing it. I catch myself sometimes trying to repeat those habits, but I more conscious now.", "mia_the_riddler": "I need to know what this song is.", "diyanti.w": "🔥thank you for this post. Encouraged me to stand my ground and be myself with or without a partner and hopefully one day attract a partner that respects me. Thank you!!", "catarinalmeidaaa": "loved your participation in too hot to handle💜", "keval0143": "Umesh it's Indian mame", "shanaisew": "I think as long as trust is present then who you are and the friendships and relationships u have with people outside of your relationship u have with your romantic partner should not change based on your relationship. If they change it has be because u want them to change not because your partner wants them to. If trust and respect is present then your partner shouldn’t feel threatened by you simply being authentically and organically yourself whatever that looks like.", "heygorgjess": "Whats the difference between someone posting a pic in their panties (which you are just dancing in, not doing anything sexual like the cucumber challenge lol) versus posting a pic in a bikini?", "sadie_reidy": "@materukhina_aa listen to her podcast with @thejeanniemai !!! ✨", "lifeofpash": "You are literally my Spirit Animal 💕😭", "fashonvega": "Fiiiiiiiire 🔥 point. FACTS", "bobbierileybeauty": "I absolutely love THAT answer about respect!!!! Hello!!!! 💯", "ratedbamf": "I asked my bf to not grow his hair out, mainly because mines long haha. However I do prefer, his hair short but he still looks good with it long so ¯\\_(ツ)_/¯ its fine.", "cindy_bunn": "You’re beautiful", "fernwolburg": "I think my single self and my relationship self are very different. It’s a struggle!", "taush.o": "Yes!!!!!!!!! ❤️❤️💛💛❤️💛❤️💛", "jro1204": "@shanboody love it and the respect definition y’all are gonna have gorgeous babies 😍😍", "laurencrawford22": "@deemdadream32 is this ok? I’m sure she’s not looked at as a thirst bucket", "_b2ts_": "I love yall. So cute and fun!!", "tabtab_atl": "I might be late, but congrats on the marriage! You two are so cute!", "j.o.sie26": "You look amazing 🔥🔥🔥", "ruthillea": "@alixjm thought this was you when i was scrolling my feed!", "elliepontoriero31": "I don't think its fair at all to ask someone to change who they are to make yourselves as a unit look more appealing. I do think there are boundaries that shouldn't be crossed (for example activities that are harmful and/or disrespectful to the relationship). In my opinion there definitely are differences between ones single self and a relationship self. When I was single I wasn't focused on/devoted to one person and now that I am in a very committed relationship I have definitely changed my priorities and how I act. I also think gender specific rules are bs! I've been in relationships before where I was told because I'm a girl I shouldn't post pictures in certain outfits, meanwhile he was posting shirtless pics. Its like you've said! Its all about the respect and trust in the relationship. 😁😁😁❤️❤️❤️", "sweetlilyana": "i mean the only thing i’ve ever asked a partner to change was doing drugs or trying to help them with better hygiene or something like that lol", "coach.carey": "This is such an important topic❤️🙏", "queen_of_fate16": "Facts 💯", "runnin_outa_canvas": "I don’t think there’s a relationship self and single self. You should authentically along with your partner be yourself in all situations and never cut down each other because of a vision of how you want you relationship to seen. You both should create that vision together in my opinion", "missmirawilson": "Been with dudes that would be upset at how I “portray” myself on social media but I feel as though it’s such a strong tool cause you get to push away the weak ones that can’t handle a confident woman and then the ones that can handle it usually come around 🤷🏻‍♀️", "fvckapril": "No but the day I meet someone that makes me feel I can act like my normal self in a relationship with them will be the day I meet my final soulmate at this rate", "theplantainpanther": "Can we get a video on this please!", "cassceci": "As long as there’s trust and respect between you and you’re partner I don’t see any issue w/ it🤷🏻‍♀️", "fit_ari629": "👏🏻🤗", "eriiepps": "Shan got booty 👀😌💕", "sincerely.beautifull": "😍💗💗", "a.q.lopez": "🙌🏽🙌🏽🙌🏽", "iamtianamarie_": "💕", "thegroovy1": "LOVE", "_gracious1": "♥️", "sensitiveoldsoul": "Beautiful in every way.", "kjoberk": "I've had partners who have tried to force me to change who I am and I've learned that if I have to stifle any part of who I am for a relationship, then I don't need to be in that relationship.", "abr0w": "Love this 💗", "labeautyologist": "Shan BOOTY 😍", "dyinbreed00": "🔥🚀🙏🏼🌹", "taylorisbougie": "For sure there is a relationship self and a single self. There’s always going to be elements of “how I would/did do things” and “how we do things”", "mimi_so_sweet": "🤣🤣🤣", "meundies\nVerified": "Verified", "queenaichad4": "Beautiful❤️.loving the colors✨.", "__sincerelychelle": "Swiftly becoming one of my fav. genres of music even though I have NO IDEA what they’re ever saying!", "iam_na0m1": "I love this. Thank you for sharing🙏🏾💪🏾", "mayakee1992": "all i have to say to both y’all is “hey big head “ 😍😍😍", "nikkioyoga": "Great post!!", "makarovalaina": "absolutely beautiful my love 😍😘😍😘", "ms.roya": "So gorgeous 😍", "theinnerblooming": "Ughhhh I just love you so much!!!!", "speakingofmeesh": "Y’all are my favorite couple!! You have opened my eyes more in regards of relationships, sex, sexuality.", "annechristyaniek": "And no, to answer your question. I would feel uncomfortable to ask that of a person. If they are not what I look for in a partner, they wouldn't be my partner.", "amanda_salcido": "Booty is poppin!", "gue.pequena": "If the boy I’m dating looks hot in a pic I’ll spam it everywhere, so that’s what I expect from him too. If a guy is uncomfortable with me being publicly hot we’re not going anywhere", "gastalien": "Go woman!!", "unearthedamber": "Your body is so beautiful 😍", "blessedapplesauce": "compared to these ig models...being in your underwear is pretty PG"}