{"betthatbreezymakeemjump": "Because I’m waiting for him to make the first move. 😩", "crabbyabbie27": "Commitment issues 🤷‍♀️", "chelseychante": "Definitely fear of rejection", "llalexxbloomll": "Love the click girl", "sumi_maire": "Wasn't ready for a relationship yet.", "jp.dafranchise": "👌🏼", "_reginaselma": "@thekneesofatomboy relationship gal/expert✨", "judeboxx_": "You smoking Beautiful ma’am", "twaicie": "@fearofjosh you are handsome", "unclefunkysdaughter": "Love your hair, @shanboody! May we send you some products to try? 💕", "jamesadellfotos": "Love this! 💖🖤💖", "africaz_finest": "I shot my shot & got shut down. 🤷🏾‍♀️", "anaandthepoetphoto": "Very Nice!", "ayyoloretta": "I dated his friend (pretty serious) a handful of years ago and don’t want to come across like I’m friend hopping.", "tori_robinson1": "@shanboody self esteem...not pretty enough to think they'd ever like me. Sad but true", "jadaida_reborn": "She's straight", "always_lyssa": "Confidence", "joaocrusbjj": "❤️❤️❤️❤️❤️", "7.nanashi.7": "Fear of rejection 😂", "_cristinalovee": "He's still in touch with his ex who he proposed to. Of course she rejected him and I'm not sure why he still keeps her in his life 🤷🏽‍♀️ We work in the same company though so I think it's best if we stay friends ☺️", "moonequalist1": "Finding one 🤣", "_indxgo": "I don’t have no crush rn lol they all celebrities", "_alexiswolf": "They're straight.", "lotsofglo": "Nothing bc he's my man now", "thetower.thechariot": "I have a gut feeling I'm not his type", "joey_too_smooth": "Lack of confidence that it'll go well", "lareeeesh": "I want to be the desired one, not the chaser 😂", "car_la1475": "Honestly, being poor.", "simplymekayla": "1)Thinking about the consequences 😂 2) he always seems to dodge when the “does do something” 3) I think to much 4) I just don’t know, I mean he already knows that I like him since I told him 🤷🏽‍♀️", "bohemianlikeu_06": "Mine is a mixture of being rejected and not feeling good enough for that person. I got rejected not too long ago and man not only was it embarrassing but it made me look so foolish. The rejection was horrific, which made me never want to approach my future crushes ever again.", "takenbyart": "Cause I have none 😂", "slayomi_like_smoke": "@malikimamapriv his girlfriend", "get_rid_of_the_couches": "They can do waayyy better", "lil_pres_shes.jay": "Fear............", "kurlykrisss": "I made a move the other day and got Friend Zoned. You win some you lose some and now I have a cool guy friend 🤷🏽‍♀️", "lobeau_carino": "Nothing stopped me she just said it wasn't the right time in her life..???😅", "brit1800": "They're all fictional", "estherministers": "I married him.... But.... He's in another country.... Can't make a move on a man in a diff time zone.", "dahliaflowers__": "Hmmm🤔🤔 i get so nervous, and i dont know what to say... im not a good convosation starter", "goofymorena": "i shoot my shot but no one want me", "kc_isme19": "I don't have a crush. It's hard to find someone of substance - of something far beyond superficiality. Most people my age can't relate to my constant quest for all things intellectual.. all things real despite how intangible they may appear. So, why settle? I'm trying to learn how to share myself with those only willing to do the same EQUALLY... It's a work in progress if you will lol.", "elizebethcourtney": "Being at an in between phase in my life and not feeling like I have something complete to offer. Not sure if this is the best approach since I seem to be constantly in school. :/", "mike_ddzz": "Felt small . I felt like she was to big of a person in this world for someone like me . Even when we spoke i wouldn’t say the things I rehearsed because of fear of rejection and lost of friendships. Sometimes she intimidates me and that’s a tune on but it’s make also make me fear that I can’t handle. @shanboody", "_laura.bebe._": "My face doesn't help me out lol", "justjaayy": "👌🏼🔥🔥🔥", "kalievans": "Knowing they don’t feel the same", "kodihn": "He shows affection and then holds back. We are both celibate so we are waiting but I sometimes want to express that affection intimately, I'm just afraid how he would react. Amy advice? @shanboody", "darrylsylver_5.0": "Gorgeous", "shanahasagram": "When it’s a friendship, ruining that bond you have. In general, feeling out of your league or hyper aware of their interests and not sure if they would make you the acception", "brownsugartalk": "It's my crush.", "tbglover77": "Distance", "miwilli954": "Their wife", "cata__strophic": "Unfortunately you live a continent away", "k4clife": "Fear of losing a good friend if he doesn't want more.", "xiuxiulinlin": "Not having feelings reciprocated due to shallow reasonings", "rdotzdot": "Honestly I only crush on thing I know I never have the chance at. They are all just a dream.", "ashmichy": "Some personal confidence stuff...spent way too long being considered second best and it really hits.", "alovelydai": "This bag tho 😯", "coolassjenny": "I did and they blew me off. I said ✌🏻", "liv2wynn": "Age 🙃", "cloudyaphrodite": "everything lmaooo", "lovealliro": "I didn't think I was good enough for him and had a fear of rejection", "millendoan": "Unrequited feelings", "arre_jay": "Well you live in like LA or something and I’m in North Dakota", "callbackchristina": "Maaaaan i just went for it. At that point I told myself that the worse he could tell me was that he wasn’t interested... aaaand he was haha 😋", "harjinder_singh09": "Always very charming my dear friend 🌺🌹🌻🌼👍👏", "mizzseychellois": "My entire face, body and being loool 😂😂", "braxyb": "I'm a chicken.", "wizardress": "Ask that*", "afrothunder93": "Not sure if I’m his type and I don’t know how to talk to cute guys", "shi.is.art": "I made the move and I’ve been with him for 8 years now ❤️ don’t be afraid to make that move. There’s so much potential for the pay off to be great.", "sisithelyricist": "Love your style💕", "kirstenreneesays": "@quileskayla biiiiitch get my list 😂", "fetubadu": "his “ girlfriend “", "ohwizeone": "Fear tha2my crush doesn't like me in a romantic way.", "being_ieva": "Thinking they were out of my league 😣", "ytk.r": "The fact that he’s taken.", "iamzflo": "Pshhh... she lives in fucking Los Angeles.... I gotta move there first. 😂", "domiiluvv_": "He’s not the type of guy I normally pursue and that scares me. *rejection, not good enough, etc*", "beyoncestealsedges": "Not knowing if it’s mutual", "love__monn": "I feel like I just don’t have time right now. . .", "undergroundpink": "So @shanboody you know we need a video on this so we can get our summer mind right", "marebeare0": "I felt that if they were to date me it would be out of pity or it would be a joke.", "liz_seiver": "Not having one", "tomiwarhoda": "Knowing he’s a player and not wanting to get hurt", "cindyherrera90": "Fear of rejection", "lukatr_": "Anxiety", "1quietfire": "Oh....awesome topic Shan. I will give the rare perspective from a guys view. I don't have any crushes. I am an older guy who is profoundly disillusioned about women. But in the past it has been a combination of the following: 1. Rejection fear. I have always prided myself on having never been rejected. But it's because I have never allowed myself to be (have never asked). I like having that perfect score. It's never happened...at least not in my adult life. But I did ask a few times in my teens...and was shot down. Once or twice over the phone and once face to face. The few times that I asked anyone on a date as an adult were via the internet/email. And they said yes. If I sense even a slight chance of a rejection...I don't make the move. I think (I know) that I am a better man than the a-holes who women chase...and who dog out women. So I couldn't live with the idea of lesser men easily getting what I can't or what I have to work 10x harder for. Is that pride? Maybe so. 2. More specific rejection fears are due to a). Being a black guy (when the female is of a different ethnicity). I tend to like women who aren't likely to date black guys/men of color...could be due to stereotypes or their families & friends not accepting it. b). Not having enough money (I only earn between 40k & 50k....not much for my education level). Most women will judge a guy negatively for that...even if they aren't heartless golddiggers. 3. Being too old. I allowed my best years to pass without taking any chances or pushing myself to meet more women (the dating ritual is just not a pleasurable task...it's a chore. I get no enjoyment from it whatsoever). Most women of child rearing age aren't interested in a guy my age. 4. Being under 6 ft...fearing rejection for that reason.", "rina.jazzmean": "Self doubt", "fabienalexis": "Shyness. & I’m not where I want to be in my life, so I’m focusing on me for now, but keeping my eyes open.", "odiumpopuli": "Fear of commitment on my part", "dezracine": "Being married. (I'm totally joking... I think)", "limaonthegram": "Fear of rejection definately.", "captainlindt": "Mostly fear of not being interesting or smart or funny or sexy enough for him ..", "lesliejgonz": "@jesseniacastle kinda like your outfit last night!", "mike68_detroit": "SexyGorgeous 🔥🍓🌹💋", "aizt_": "Not ready for a relationship", "quietstorm15": "I did, got rejected..He doesn't like me, but likes my friend...Story of my life", "celeste_maria_q": "Not knowing their sexuality 🙃", "jlbowie20": "Fear of rejection and possibly a lack of freedom", "eulondabeard": "Not being sure if I'm ready for that and If he likes me like that", "regdow": "Fear of rejection.", "xxvelmadanklyxx": "I have no issue shooting my shot 🤷🏽‍♀️", "castaneda9618": "I'm married now but when I was younger I was always afraid they didn't like my race.", "butilovememore": "nada", "epitomeofascorpio": "Nothing. I shot my shot and now she’s madly in love with me 😁 @tea_and_incense", "ohheyshayy": "Getting crushed in the end and ruining what was built which is a friendship.", "goddessy_gold": "I always get crushed..", "hoelistichealthcare": "Realizing they’re a shithead😅", "keysa96": "Insecurity....", "milenacucu": "Friendship", "lauroyalty": "His character", "destiny___tierra": "Fear of rejection, fear that I won’t have the strength to try again when someone new comes along. Also the feeling that I’m not beautiful enough. 🤷🏾‍♀️", "jpanosty": "Because they say if girls make the 1st move you're desperate 🙄🙄😔😔😔", "hollywooddreko": "@shanboody yo boyfriend 😂", "polkadotsncurls": "In highschool I built up the courage to start flirting with a senior I liked. I was killing it too, putting down mad game complemented his beard, touched it. Flustered him, I thought I was in... but it turned out he had a gf who went to another school 😭 so ig I always make a move, but I didn't close shit that day 😅", "idaliaxoxo": "He don’t like my ass 😭😭😭🤷🏾‍♀️"}