{"shottagramz": "👌", "shillume_": "Love your all looks️️❤️❤️Hope you can update more, I will follow you all the time😘😘", "michaelphenomjr": "Very happy to see you two speaking again. I used to love the videos you made together.", "priscillaghene": "proud of you @shanboody ❤❤❤", "_e.l.b.a._": "Wow wow! This is awesome!!", "faarrow\nVerified": "Verified", "afrochicglobal": "Powerful", "enny_integrity": "Woooooow the 16 year old me is spinning", "glowblackgirl": "Almost makes me want to reach out to my old friend 😫 friendship breakups are HARD!", "yosoyannav": "Watching this now. Makes me want to call my ex best friend 😩", "whatuthink_": "I loved the video. Thanks for this. Also I loved the artwork in the back do you know who it’s by?", "livingrebelle__": "Intense. I almost feel she is still #selfish in a way.", "imran.w": "Loved this!!!", "flybyrdie87": "Y’all def were one of my favs back in the day , 💜", "marcelalrosado": "wowowowowkwowow", "kimmikhaos": "Omg I missed you guuuuuys", "more.fiya4eva": "Those girls gone wild", "ruthkar2": "Jealousy must have happened.", "cr8myownlane": "omg I always wondered what happened you guys made me fall in love with my natural hair", "blacklovebible": "Thank you for sharing this. It gave me so much perspective on my own life. 💟✨", "saints.no.where": "She's from degrassi!!", "miss_fit_foxxy": "I remember meeting her in the gym years ago", "hazeleyesneverlys": "I think that girl is from Degrassi", "neccostewart": "U guys were my favvvvvv YouTube channels. ❤️❤️❤️❤️", "simplyrho": "That’s big! Kudos to you guys for learning, growing, and forgiving!", "ayeburks": "This was dope!! @shanboody", "__kaylathegoddess": "This was so deep it almost made me want to call my ex bestfriends but then I realized I closed that door for a reason. Lmao.", "ooga.booga": "🙌🙌", "kickinitwithiv": "Loved this !!! I can so relate friendship break ups hurt more than relationships from my opinion/ experience Love how vulnerable you are on your channel I appreciate the real. Thanks for sharing keep up the phenomenal work and continue to be you xoxo", "liyarahiel": "@kirajaycole we get closure!! 🙀", "itsthemorgie": "Holy crap that's Hazel!! 😯", "melina.honeyy": "😭😭😭", "qff.12": "@qff.10 @qff.10 @qff.10 🇸🇦💐", "chami_bar": "<—————— CHECK US OUT 👀👀 . 🧜🏼‍♀️🧜🏼‍♀️🍓SUMMER 2018!!🍓 ☀️☀️🧜🏼‍♀️👙😎 #Pure #Sexy #Bright #Fresh", "domsy1213": "I don't wanna do business with you but I wanna stay friends. I wish I had been more aggressive with that mentality. Lost a friend over accepting business with her even though I knew it wasn't a good idea", "regyates\nVerified": "Verified", "mrs.lateef_aha": "I was just thinking about the the two of you maybe a few days ago. I was wondering what ever happened and if we would ever see anything from you two again. That's amazing!", "queendk09": "I always wondered what happened to y’all I loved watching your videos together thanks", "gvalentinoball": "This made me cry an intellectual thug tear. Glad to see this conversation happen.", "la.femme.sage": "This is awesome 🙌🏾🖤✨ many are so unwilling to do this!", "i_love_gdub": "I miss them. I loved watching them both on and off YouTube. They’ve grown so much and I wish them both the best❤️❤️❤️", "stacyannbuchanan": "👏🏾👏🏾👏🏾❤", "dionareneee": "Ahhh this makes my heart so happy! I loved TGAW when I was little", "jazminenicollee": "this was amazing!!! I’m so proud of the growth you two have made...being able to speak so openly without judgment or any malice. Just simply expressing your perspectives from the past with no expectation of where things are gonna go just letting them take their course♥️. This took courage 🙌🏽✨🙌🏽. I’m so glad this happened I love you guys♥️. I’ve definitely learned something about myself and from watching this. I’m currently in a rough spot in a personal relationship and I hope that we will be just as comfortable and courageous when our time comes. Cuz right now everything is loaded with emotions.", "shaypeupshay": "Wow! I was just thinking about this, I used to love your channel together", "stevtak1024": "Good for you guys!! This is how it should be! ❤", "knottybyynature": "Uuufff. Kudos to you both. These are not easy conversations. But brings so much clarity and peace.", "sheespeaks_": "Wow, I haven’t seen her since Degrassi! I feel 14 again! Good for y’all hashing it out. 👏🏾", "judora_": "Aw throwback to Those Girls Are Wild 😭😭", "queennotifah": "Man i miss those girls are wild, never knew what happened!", "herecummimi": "Damn I’m glad they did this! I felt like they ended their friendship & left the viewers hanging!! Lol whew! I feel much better after watching the video", "jaunteamaxey": "It’s amazing to see someone choose business over friendship. It’s just something my brain cannot process. I value human connection in my loved ones more than money, I just do!", "aro_hartley": "I'm sorry but didn't she play hazel on degrassi", "tharealree": "You know I always just wondered if you guys were still friends once you started making new business moves", "truemystique": "I'm so proud of you both for doing this. Y'all channel was the shiznit back in the day. I really wanted a hat too, but sadly I was broke. LMFAO.", "meghantonjes\nVerified": "Verified", "followmyothaone": "Yes!!", "marglaza": "Hazel from Degrassi?!?", "guyanesesista": "I've missed you guys so much. I was watching your videos the other day. I was so sad you broke up.", "adornedbybritt": "I loved and admired TGAW ....So glad to see you ladies connect again. This made me smile 😃", "pacinthe": "This makes me very happy", "mademoiselledee": "@shanboody shannonnnnnnn ❤️ omgoodness this brings my heart so much joy; it's truly all about timing and growth - love you both", "stallstoriesmtl": "Omg!!!!!! I miss you guys together", "swann_venom": "Is that hazel? From degrassi @singaboutmee", "unclenickyyy": "Song of the summer... Link in bio 🔥 🙏 🔥 🙏 🔥 🙏", "le_naturally": "Oh wow I remember you two!! I wondered what happened. Glad to see you all spoke!", "toyaweb": "❤️🙏🏾", "ms_leahr": "Wow. I can't wait to watch this. TGAW were the first YouTube channel that I was a super fan for.", "thereneeproject": "I needed this! I still wear y'all TGAW hats", "ruramai.co": "The video says you haven’t made it public yet😩😩am I the only one?", "nds0806": "@shanboody the video isn’t working 🙁", "msjuliec": "Maybe one day this will happen with my old best franssss. Pride and egos aside doing what y’all did IS NOT EASY! So kudos to the both of y’all.", "erikahmarie": "Wow ...cant wait to watch this later", "yung_striker": "yoooo. I completely forgot that used to be on Those girls are wild, tbh It kinda faded from my memory all together, major nostalgia trip to highschool times.", "lala.clark": "I love that you two had this convo, and I love even more that you’re sharing it with us. Inspirational, grown af ❤️ those girls are wild, indeed! x", "sadesharee": "I wondered what happened. I loved watching your videos. ❤️", "erikadiaries": "Wow. I didn’t know I needed this video until now. A flood of memories just came back from the Those Girls Are Wild era. Y’all channel was the first channel that I subscribed too where I would sit by the computer and wait for a new update. I remember being incredibly upset that you guys stopped making videos together. But I’m so happy to see you guys sitting down and having this mature and honest conversation. I’m so proud of you too and thank you for making me happy during my teenage years. ❤️", "marshabnotbrady": "This was so mature and insightful.", "locknessmonstrocity": "I remember the those girls are wild days. It is awesome that you both were able to reconnect and have some type of 'open ended closure'. You ladies are both dope, thank you so much for the vulnerability. I recently lost my best friend since child hood and people rarely talk about this type of break up. It is painful, but takes courage to be honest and open. You ladies rock, and I am inspired by you both 🖤 @andrealewis @shanboody", "rose_glowacka": "I’m so here for this! Respect to you both! ❤️", "dopefreshlife": "I’m really proud of you two for clearing the air like this! ✊🏿✊🏿", "kendra.emani": "You know it’s serious when y’all have your chairs on the other side of the room haha", "jessfiasco": "I am just beyond excited for this!", "creativefamee": "This was soooo good. 🙌🏾", "wightchocolate": "This was superb. 🙌🏾🙌🏾❤️🙌🏾🙌🏾", "pessoa.kim": "Those girls are wild dot commmmmm 😂😂 great video 💙", "jaywinterr": "The video isn't available to watch anymore. 😔😔 I was looking forward to watching it.", "lutac0": "When I say I have been WAITING for YEARSSSS!!!!!!!!!!❤❤❤❤❤❤", "keepingsunshine": "Thank you for your honesty and vulnerability.", "ijeeeooooma": "What happened to the video. It says it's not available anymore", "susie_s419": "Should the video be available now? Can't watch 😕", "lovecaymi": "I’m sad why I can’t I watch it 😩", "queenoceanseariverlakemajesty": "@shanboody You help me to grow in so much ways tremendously. And I think it speaks volumes that you are both sitting in your home. It says to me that you both are not guarded and that the convo must be very candid. Thanks for showing your couragousness! And I hope that there is some positive resolution to this encounter. I love you both are youtubers.", "beenietv": "Give people you love blank pages🙌🏿 @shanboody I am coming to learn this and you worded it so beautifully 🙏🏿🙏🏿🙏🏿", "eeveelutionxx": "I’m very exited for this! Had no idea you guys were friends", "iamtesha_": "This is refreshing. Those girls are wild meant so much to me at that time and i’m glad the two of you were able to openly resolve an issue and both get closure.", "rehana_xo_": "Amazing. I missed you two and have gone through something similar but we’re still not speaking to each other. I’ve followed you both from your those girls are wild days!", "jinjinsing": "Awww I was so sad when you two went your separate ways. Thanks for the transparency.", "simplymisslady": "That’s when I first started following you! Love that y’all sat down to talk!", "mssharshars": "Omg!!", "glamazini": "This is how I found uour channel, like literally when the other channel ended and I was like where'd they go?!", "genieeeeeeeeeeee": "I AM NOT KIDDING I WAS WATCHING YALLS VIDS LAST NIGHT FROM YOUR TGAW YT PAGE, I am going to be tuning into this. omg.", "notime2wonder": "❤️❤️", "avchrys": "Spent years wondering what happened. Happy you two had the courage and will to share. I can’t wait to watch it on both channels!! 😊", "ipromisemusic": "Woooow powerful", "may.lay.will": "This was great. 😊", "stephaniefaiirah": "This was so goooood", "fka_pcakes": "I missed this duo. I'm loving this, can't wait to watch it now.", "cumsponge": "Wow this is huge lolol I’ll b watching", "dominiqueaustin_": "I always wondered what happened. I loved Those Girls Are Wild.", "trainingwithtroya": "@shanboody I was a die heart fan! I’ve continued to follow you both separately! But you don’t know how excited I am for this video wow wow wow!! This is amazing! So many times I’m inspired by you and then BOOM! You too it! Love you both for your raw honesty and sharing your growth and experience! ❤️❤️❤️ blessings", "iam7od": "Happy y’all did this", "ninehers": "Love the maturity & growth here! 💜💜💜", "linluz": "Well damn!!!! Didn’t see this coming! So beautiful to see this!❤️", "deeannfrancesca": "We need more models of brave conversation. Thank you for providing yet another one xo", "basimental_art": "This video was so tufff!! I loved that it was all sort of laid bare for y’all to step into a brand new friendship! I’m happy for y’all!", "mankessiy": "The maturity of it all is amazing!", "raredecember": "Omg Hazel from Degrassi?!?", "ashleyemond": "That was such a great video!", "caline.dhaitiotelo": "Bruhhh bringing back so many memories.", "mynameis.tay": "Personal growth is when you are able to solve your problems maturely and recognizing your mistakes. Loved the video.", "danielleellizabeth": "Shan was the real friend clearly", "myishisthebomb": "❤️❤️", "sbd_xx": "Those Girls are Wild is how I found you!! I’ve been a fan of both you and Andrea ever since so I’m so glad to see this reconnection ❤️", "theycallme_lexxy": "Omg I used to love y’all videos when I was younger", "its_kkryss": "I didn’t even know y’all stopped being friends. I love your YouTube and I’m happy you made this video. 💕💕💕", "goko_art": "Leaving that blank page open! Oh my goodness. That’s gold right there.", "jdanistheman": "I really look up to you and admire what you do so I had to watch this video. I had a breakup with an ex-close friend (not best friend) and I feel like a conversation like this is bound to happen soon. I wanted to see how you handled it so I can get ideas on how to handle my break up.", "_eximious_": "Wow, so brave, I could NEVER with mine... were you inspired by @redtabletalk ??", "annelawz": "Damn this was good. Thanks for sharing this ❤️", "seauxseaux": "I'm gonna watch the video when I get the chance ... glad you guys were able to speak things out", "isee_doubles": "5 yearssssss I’ve waited for this!!!!", "ohitsjustkaelyn": "Omg I used to love you all on YouTube. I will definitely be watching. I just know this is going to make me feel some type of way. Glad you two could have the conversation.", "imansterxx": "After watching those girls are wild and it just disappearing I'm so glad to see this kind of conversation getting to the root of rebuilding relationships... thank you so much for this ❤", "ear2ear": "👍", "alibeansahuman": "I love and appreciate when two women can be sensible enough to just talk no matter what the context is. No fighting. No yelling. Just emotion coming from a place of love and respect. I’m glad you both are cool now 🧡", "mrs_damara": "Wow, I am so happy for you. I can’t wait to watch", "therealkeshmoney": "💕💕💕", "_rose7": "❤", "anuli__": "HAZELLLLLL OMG 💕", "tasherz24": "I've been waiting for this moment!", "ericamacklinrealtor": "I loved the channel you guys had!", "nataleighb": "Man, amazing for you two. this is like, something Toronto YouTube all needed (in our typical selfish way). ♥️♥️✨✨ keep shining.", "kyaneastro": "I will be watching this later and it’s great to see that people can solve differences. This year is about Growth", "iamjmarieee": "Interesting enough, I had the same conversation with a friend of mine and she didn't want to do business with me either. I found it uncomfortable", "petitexpettie": "THIS IS CRAZY IVE WONDERED WHAT HAPPENED B/w yalll!!! 😳wow", "dauche": "DAMN TGAW! I missed you guys for real. So glad you connected again, tuning in...", "cmlee3143": "🙌🏿Jesus be a Healer!🙌🏿 The two of you were the catalyst to my introspective journey. The two of of you are individually a force so together you would be a WILD FORCE! But let me not project. Love you two and your work!", "hattieoconnor": "Damn.", "sunnymegatron": "Ohhhhhhh! I cannot wait to watch this one!!!", "yani_xandra95": "Omg I remember their YouTube videos together", "sergiadupoux": "I wonder if you both feel like this time apart actually will helped? Though I hate losing people I love but I always find that at some point for me to actually grow as a person we had to continue our journeys separate never knowing if it’s permanent or temporary", "nicolevassell": "Can't wait to watch! 😭❤", "kaneicagray": "aww I remember being in high school and finding the “those girls are wild “YouTube . 💚", "antoinette\nVerified": "Verified", "thenakedhustle.show": "Her body language is like 🙅🏾", "sypesype": "@shanboody ❤️❤️❤️❤️❤️❤️", "anjie_4u": "Omg im so proud you you both. I remember watching “those girls are wild”. I think it was a Latoya collab, how you pretty much discovered @winnieharlow and just loving the content. Glad this happened 😍😍😍❤️❤️❤️", "your.alibi": "Hi @rogersjnrs, I'd like to talk...some time. I hope you don't mind.", "yeskeeks": "❤️❤️❤️❤️❤️", "kathleen_naytia": "This brings me so much joy as a TGAW fan and as a woman. I'm proud of you guys. The honesty and maturity the two of you are displaying is inspiring. 💙🤗👏🏾", "chembearlee": "I remember her in degrassi.", "jennifermjoseph": "Thank you @shanboody and @andrealewis my heart is finally at peace! 😩💕", "kimmey_xo": "i was wondering why you girls weren't w each year no more", "tisworthit92": "I've been waaaaaiting for this. I was rather surprised. I can't wait to watch. Thank you for sharing 💖", "thisisdjdeuce": "❤️❤️", "__qnsxx": "@vsw__", "alanna.july": "Yassss!", "kenyaste": "Whoa Shan!!! Well done!", "justveah": "Wow seeing Andrea bought back many memories.", "femmeblkfatale": "Thosegirlsarewild was my show", "socialbutterfly_8i8": "@shanboody Trisha Paytas just shouted you out as bro g on of her favs in her latest mukbang vid on YouTube!", "urtackynih8u": "My heart has been waiting for this. 😢😢😢😢", "melisgreat": "I always wondered what happened with you two.", "brwnsknvxn": "I still want a TGAW hat!!!! Love you both, so proud of you for doing this 💛", "jesjaaade": "Maaaan! 😲 This took me by surprise!! I’m soo glad you both did this! It was definitely a good thing to do! I’m glad you both got so much off your chest and was able to speak about things! @shanboody @andrealewis 🙌🏽♥️", "devsamone": "Omg!!!", "daisydukes987": "Omg I remember even you guys made videos together so this shall be interesting", "prettirandom": "This little snippet Reminds me of the red table talk with gabi and jada....", "teekaay7": "Finally!!", "brittanyamofah": "Finally, can’t wait to watch.", "fentygraph": "Those Girls Are Wild was my sh****t!!!! I can’t wait to watch this!", "e_414_": "Thank you for this...I find my self needing guidance on how to have difficult conversations regarding friendships that slowly drifted apart, never having that closure and why. Big ups to grown women having real conversations @andrealewis @shanboody 💜💜💜", "nurse.ambeezy": "I soooooo needed this!!", "sapioshaun": "Omg!! I've always wondered what happened!! Gotta watch", "tbrooksz": "I WAS A THOSE GIRLS ARE WILD OG SO I CANNOT EVEN HOLD IT TOGETHER ENOUGH TO WAIT UNTIL I AM DONE WORK TO WATCH THIS VIDEO", "_lleexxii2": "Incredible women", "junglewildtv": "❤️", "clearlyappealin_": "I remember you guy’s channel. Y’all were my favorite. I’ll have to watch. Blessings, happiness and peace to both of you. ♥️👑✨", "dannijcoco": "Wow I was wondering the other day whatever happened to Andrea. I'm familiar with from the \"Those Girls are Wild\" days. I'm glad you guys had this discussion. ❤❤❤", "jay_ohh_ayetche__en": "Ain’t she the hot girl from degrassi? Damn I miss her.", "hereisjardana": "I can’t wait to get out of work to watch this. Happy for you guys", "diamundrouff": "Now I know I’m definitely psychic. Just this morning I was thinking about having this in written form with my ex best. How crazy. Watching now ✨💎", "potentialfilmsinc": "Huge!!!!! Glad yall talked about this.", "yourfavefashionblogger": "totally needed and wondered. grown ish!!😚😚", "iammarilynalexis": "I think it’s beautiful that you too can sit down. Growth is so beautiful. Proud of the both of you!", "enyakahuma": "Yaaaas🤗🤗🤗 I always wanted TGAW closure so bad", "ladiluck.34": "👀 @labellejonri", "shelleyhamilton": "Good for u guys!! Tgaw was what introduced me to u in the first place.", "andrealewis\nVerified": "Verified", "betthatbreezymakeemjump": "As a female Canadian teen Those Girls Are Wild was apart of my childhood. 😩❤️ So glad you guys did this.", "87royalty": "Carla from Cadet Kelly", "bamy.bee": "I always wondered what happened since I loved you guys from way back when. Thanks for the glimpse into your personal life", "deliciouslyvibrant": "This was such a great conversation! And since I knew you from TGIW - it was nice to have you two reunited and talk it out - well done ☺️👏🏽💓", "stiinasteen": "This makes me happy 😊", "tnveal": "TGAW was the YouTube account that got me into YouTube. This is the closure tgaw fans needed.", "dxwsa": "I knew i recognized her from somewhere", "itsbeennreal": "Super super enjoyed !", "geekmechic": "👍🏽👍🏽👍🏽👍🏽So happy to see you guys back as friends", "curlmyfries": "Omggg I can’t wait to watch this", "soynegritaa": "Yes!! The video I have been waiting for 🙌🏾🙌🏾", "miblkisbeautiful": "I need to have this conversation with one of my ex best friend of 15 yrs but I’m blocked 🤦🏾‍♀️🤦🏾‍♀️🤦🏾‍♀️🤦🏾‍♀️", "iammiriamblake": "@aria.lashawn everyone’s apologizing to their ex best friends. Issa sign", "venesajco": "I really appreciated this video I’ve fallen out with friends I thought I be close with forever so this was eye opening. ✨", "scarlettday": "@honestly_niisha those girls are wildddd 👏", "vastiapascale": "Growth!!! Been following both for forever and must say I’m happy to see this. Those girls are wild was where I was introduced to you. 💜💜", "life.by.nv": "@li_taught_you I feel like I remember us talking about them lol", "kesh_easy": "This makes me smile. Those girls are wild was one of the first YouTube channels that I subscribed to.", "punkie_dancester": "Woah I knew I knew her!!!!!", "aebyma": "I love this, inspiring", "ave2noondelite": "You ladies are so dope for doing this. 🙌🏾", "jayjibsbeats": "Wow! Those girls are wild together again. I had no idea of the fallout, i thought life happen, but anywho, this is great. @shanboody @andrealewis", "miss_arolf": "Take em to the jungle ❤", "yoursheronna": "#growth 😍😍", "n_cole27": "@daniellapajonas_ she was bffs w hazel", "chescaleigh\nVerified": "Verified", "lyndonjamez": "Omg i use to love you 2!!!", "sorelleamore\nVerified": "Verified", "prod.bytokiwa": "Omggg I was wondering what happened! I lovedddd the web series!", "tannyboo": "I use the watch their channel all the time 😩", "melaninnomad": "HAZEL?!?!?!", "ms_frisco": "😲😲😲😲", "miszzbee": "So excited to watch this! 🙌🏾🙌🏾🙌🏾", "nikkiapproves": "This means a lot as a “those girls are wild” Stan. ❤️", "thatdudemcfly": "i’m so fuckin proud of you two.", "misterkendric": "\"No like... like .... (clap)\"", "ayelovelee": "That's the girl from Degrassi? 🤔", "deelaux": "I miss you guys! TGAW was litttttyyyyyyy", "heynic": "Was always hoping this would happen! So cool to show we can talk to each other as black women and not hold onto the weight of the past.", "kathylagran": "Omg I’ve been waiting for this. I used to watch your videos on YouTube! 😭❤️ STAHP MAH HEART, MAH SOUL ❤️✨", "jazzythickandfit": "Just watched this. Really good stuff 🧡", "rebeccacorrinne": "This is beautiful", "bryanbrock_": "💙💙", "mikalahgordon\nVerified": "Verified", "_underthesie": "Those girls are wild .commmmmm 😭😭 I need to get off work NOW so I can watch!", "bobbypen": "Awww I loved you guys on Those Girls Are Wild! That's how I came to learn of @mayasworld. So happy to see you guys talk it out", "kayesquared": "I missed yall...I used to watch your joint youtube channel way back in the day.", "simonehindslondon": "😱😱😱", "salvationkelly": "Those girls are wild was literally one of the first channels I consistently watched on YouTube. This makes me happy!!", "shes_a_doggette": "Omg ... from Degrassi?????", "evitablaze": "I miss u guys together. I have to watch this video.", "laurienohotea": "Wow wow wow!!! I wasn't ready but I've been ready!!! Can't wait to watch. Is it normal that I get excited about someone else's life?", "oloni\nVerified": "Verified", "0nlymi": "I used to love watching you guys", "machaelalala": "Finally", "marystcloud": "You’re so awesome & inspiring Shan. I love your content.", "enjxyisa": "Hazel from Degrassi !! What !!??", "flawsofcouture": "My heart💕💕💕", "talya.macedo": "I’m so glad you guys did this.", "upgradevee": "I love that y’all did this❤️❤️❤️ longtime fan of both of you", "naomicowan\nVerified": "Verified"}