{"dominiquerunway": "Your words of wisdom today were truly empowering, thank you for motivating and reassuring me of my path in life ❤️❤️", "intuitive_miss": "Congratulations, before and after marriage. This kind of union is rare and uncommon and not everyone innerstands what you share. It takes a hell of alot of honesty and spiritual maturity to have the courage to experience yourself through another in this way . I get it, its what union looks like to me, i havent experienced it yet to this degree of authenticity or freedom but I see its possible. Thank you for sharing your journey. Its beautiful! Much love to you both ❤", "zachariah_official": "I love this explanation. Congrats Shannon! I'm so happy for you both!", "mscookies876": "@tahanyah @shar_shine78", "allilovezto": "This is beautiful ❤️", "allthingsvikki": "❤❤❤", "kboozyy_": "I think the point is for a couple to get married is to put a legit stamp on the relationship. Like you are with this person forever until death or something goes wrong and a divorce happens. I can’t explain well at all 😂😐but I wanna get married one day, it’s just a big step.", "michu93": "I love you. You're a role model to me and I have nothing but happy thoughts and blessing to you and your fiance. ❤", "prissyab": "Beautiful engagement story! Congrats! 💙", "tabiacharles": "The point of marriage is many things (as we've discussed so many times my love)it's status and not being just part of the majority. The majority of people do not get married...it's almost like getting higher education, a master's, a doctorate, etc, everyone's not willing to do it. Marriage separates you from those who aren't willing to take that extra step (for whatever their reasons are). Going back to the status thing, for whatever the reason, society seems to have more respect for couples that are married (which is crazy) but that's just the world we live in. I must admit, i love the idea of marriage, and taking that extra step that separates us from our previous relationships.", "plants_and_poetry_": "Love this.❤️", "beautifullifeofaaliyah": "facts this is how i feel ♥️♥️", "smugbeauty": "Congratulations on your engagement! 😍😍", "wildflowertrails": "GENERATIONAL WEALTH, TRADITION, when you die, your lover gets nothing without marriage unless willed in . If you go to the hospital , only your husband would be allowed to see you, Insurance,", "jasminemee": "@trav_lodo", "_alleyboo": "Aww congratz❤️", "kokii_shak": "Read this 😻 @audreymots", "peejay_esthetics": "😍😍😍😘😘", "thediyphilosopher": "The point of marriage seems to be for other people. So, nah thanks. I don't need to prove or do anything to help others approve of my life. But I understand not everyone is there yet and most people still need the approval of society at large to validate their choices. I think it's a matter of personal evolution. Best wishes for you and your marriage.", "basiclich": "Death and taxes lol no but really, there is a level of security in knowing that one's partnership is spiritually, socially, and legally committed. It's easy to say that it doesn't impact the relationship itself and if you really love each other you know it and none of it should matter, but people change, situations change, and this step forces people the see beyond the fluff and think about what they really really want long term. Otherwise a person could invest a lot of their heart and a lot of money into a future that their partner has claimed to want and have the rug suddenly pulled out from under them. The romantic aspect of marriage is important, but so is the legality and logistics.", "mdtek989": "@sky_kiss3d", "lovechass": "@oh_thatsmike28 read this.", "team_ex3": "Great insight and makes a lot of sense. This is why we ahouldnt let others dictate our marriages either", "theeuphoricbae": "Sounds right", "sawdustinmycurls": "I love your perspective on this. For me the “don’t care what people think” line is about trying not to let other people’s opinions prevent you from living your truth and doing what’s right for you. For example, not having an open relationship because some people take issue when you know it’s right for you and your partner. We don’t live in bubbles but hopefully we chose to walk our own paths while respecting that we’re part of a larger collective. Congrats to you for walking your path gracefully.", "kamensah": "It's one of the 7 sacraments according to the holy bible! Basically, God says it's a must! 👍", "victoriaelizabethb": "@e.power7 soon 💋", "bertnahh": "Can't say I disagree with you! Kinda how I feel too, probably won't ever marry!", "stevtak1024": "@girlzdad09 🤔🤔🤔", "serena.hussain": "I agree. Society does value a married couple above an unmarried one. I get it. But it frustrates me. Yes you’re in a more powerful place to ‘build a legacy’ but there are way too many holes in this that I’d poke and there’s always an opportunity to pave a new way. But that’s where I’ll respectfully stop questioning because it IS your life and your choice. Thanks for being open as always.", "chrysavgicharalambous": "❤️", "milenacucu": "Marriage is about paying less taxes and having the same name.", "journeyinward": "Well i dont think marriage is fully for other people. Its for yourself. When it shows u have made up your mind. You are sure you want to be with this person for a very long time. And you are quite confident that its going to work out. So you reward yourself and the other person with the state of marriage. Just to make it clearer.", "takeoffyocool": "I think you should get married for yourself, not to meet other people’s expectations.", "ikeposton": "I have told you before...wise beyond your age. You have the ability to speak what many hearts long to speak. Thanks. P.S. just got back from a cruise to Nassar with my honey, just to take time away from the hustle and enjoy each others company.", "ashleychakona": "I swear I tell people this all the time. We know the foundation we have & how solid we are. Marriage is nothing more than a document.", "jocariperalta": "👏🏼👏🏼👏🏼", "simoneiwood": "Honestly I don’t think I know the point of marriage. Maybe because I think so many ppl do it for the wrong reasons. maybe because my parents separated when I was younger. I just personally think you can have a marriage type relationship without an actual marriage. I feel like I’ve seen so many ppl getting married thinking it’s going to change their whole life when I don’t personally think that should be the goal. But also the idea of having to plan a wedding that satisfies everyone’s needs (cos I would be thinking of everyone) gives me a head ache just thinking about it. Haha plus I’m a tight ass and I read the average Australian wedding cost 50k these days! Lol I’d rather spend that money on something else!", "crysrcharles": "Does that mean the open relationship has become an open marriage?", "jamiaxmia": "Congratulations!!!!!!!", "angelfacee_": "Loveeeeeee this 🤗✨", "spoopykitty": "Also I screencapped the image bc it's super sweet and I want to send it to my fiance 😍💛", "shak_will": "Marriage is a public declaration that says I’ve been chosen. It’s also a public measure of accountability. Outside of these things, it’s simply a tradition. A tradition that may or not fit an individual. It’s not above or below, it’s just a relational posture that shouldn’t been seen as a benchmark for healthy relationships.", "makeupfestation.online_company": "I love the way you put that in words!! 😍", "sheena_bailey": "I’d also add to that the legal contract that we are sharing everything we have built here. Marriage solidifies that. So I can put this house in my name and you can put that one in your name but this marriage contract makes both these properties legally ours.", "alexisjamiese": "I love seeing this union become something so beautiful! I feel like I’ve witnessed the whole thing lol not really, but you know what I mean ☺️💕 to me, marriage is about having an unhindered, potentially everlasting bond with another person. I say “potentially” onlyyy because if you find out after 10, 20, 50 years that the season (very long but a season nonetheless) with that person is done then you have to do what you feel is in your truth. Unfortunately, marriage and divorce is kind of thrown around like it carries less value these days, HOWEVER it has allowed the freedom of living your truth instead of feeling trapped or stuck. Long story shorter lol marriage is a form of an “official” union with someone...almost like a contract of a union. Though I DO feel like you can live and carry on without the title or the paperwork, paperwork and contracts can sometimes make life a smidge easier - just like in the world we live in! Shit gets done and is “set in stone” with contracts 🤷🏾‍♀️", "sandalion3": "Marriage is ordained by God and hold Christian values", "dassahxlovely": "Congrats, marriage is beautiful 💕", "nakedlove_": "Congratulations, I hope every moment is like the fairytale you imagined. For a long time my mindset on marriage was kind of like, why not? We're forever together anyways. But being a single young woman right now and hearing the way some people see it, I can adapt my thought process to something along the lines of @lexiteresa; a birthday party for your love 😄🎉🎈 it makes me excited and hopeful for such a moment in my life one day.", "simoneqt": "@kaptainkai7", "heyyitsven": "AWWW. GURL. LIVE YOUR BEST LIFE. I'M REALLY HAPPY FOR YOU. 👏🏼👏🏼👏🏼❤️❤️❤️", "knottybyynature": "@drlouiebae", "vrockica": "👌🏿👌🏿👌🏿👌🏿👌🏿👌🏿👌🏿💦", "itskylanotkayla": "I love this", "dlssg77": "Congratulations!", "djbluetv": "I love the conversations you start 🙌🏾", "ever_evolving_she": "@h2ent", "sidia_20": "Ok it's kinda right, but I don't think it should be done JUST because other ppl want to see it. I good what you said but...not doing because someone wants me to😲😬", "krissy_krissy": "Your engagement video was so warming. Your philosophy to love and life is so inspiring.. I wish I would’ve consumed your thoughts sooner. I wish my 20-something year old self had a fraction of your clarity before I got married.", "bagewr": "Very interesting...I learned a long time ago that societal norms are fluid. What we see as morally acceptable now may not be the same 100 years from now. Marriage/family in 2018 doesn’t resemble marriage/family in 1918 or 1818 and will be different in 2118. A lot of our social constructs are set up to benefit society as a whole.", "snacks.perry": "The only reason I would get married is if I decide to have kids with the person. For me personally that's how I was raised. I would have a different life style (stay at home mother). But if no children are involved than I wouldn't get married.", "michelle.siloata": "I LOOOOOVE this explanation!!!!", "mushie.pie": "I completely agree with you. Marriage is externally symbolic. In Christianity, people get baptized as an external sign/ message to the world. It really doesn’t change anything in one’s personal spiritual journey. So so happy for you too! You are as authentic as it gets. Thanks for sharing that with us. @shanboody", "washingtona": "But why do we care so much? If what you’re saying is what you feel (and others feel too) and you know you’re love is real, then why bother putting on a show for people who will forget in the next year lol  I believe the wedding”deals the deal” but idk @shanboody", "hersocialgrooveandbaby": "@shanboody your imperfectly perfect engagement story was so beautiful! From one Torontonian to another, I wish you and Jared all the best as you embark upon this new journey! You are both such a wonderful couple and it will only continue to go UP from here. Thank-you for being so transparent girl! You’re truly a beautiful soul and I hope we will meet one day 💓💓💓 as for me, since I am married officially two years now, it meant to me that I had decided to make a public commitment to God and my husband-to-be (at the time) to love and cherish him with all of me for as long as I walk this earth 💕", "nico.lowe": "Congrats @shanboody 🤗🤗🤗", "gg_caldwell": "In a world where we move around and move in different circles it's important to have that one person that is constant. It's important to build a history with one person that has seen you at you worst and best, a person that has seen you grow from an intimate point of view.", "_cbsq007": "And congratulations once again ! Xoxo", "naturallypriya": "I’ve been following you for years. I stumbled on your channel at a point in my life where everything I’d been taught and believed was challenged, you helped me process the change I went through in my early 20 somethings. With my humanity and sense of self stronger partly because of you, I just want to say congratulations to you and Jared as you go through another new phase of life, and am excited to see more growth for the both of you. ❤️", "sunnymegatron": "That’s a really good question. I got married for the first time at 43 and it’s an open marriage. This is after having two prior “life partners” I didn’t marry and having 2 children. For me it’s twofold-- it’s first and foremost a level of commitment designating this is your lifetime person (with my prior 2 I just knew deep down they weren’t my lifetime people). The rest I find really difficult to put in words-- it’s a deep level of love that’s indescribable. It’s something I didn’t even realize was a thing until I was in it-- you just KNOW, you know? The secondary reason (and it’s super secondary but is also a factor) I think came with age. Marriage offers certain legal protections that become more important the older you get. Mainly what happens in the event of tragedy, death, failing health, legal status with the kids, etc. When I was younger those things didn’t matter as much-- those kids of things seemed so far off. But approaching our 50s it’s also a part of our reality.", "mamamiona": "That's so beautiful. CONGRATULATIONS", "sheisdreah": "I got married because I feel like marriage completes the relationship and shows commitment. I know divorce is still an option (for others) but it’s a lot easier to break up with your bf/gf than your husband or wife! My husband and I got married at the courthouse with a few friends and family.. nothing big, just surrounded by love!❤️", "becoming_mojo": "I agree @shanboody, marriage is for the family and for society. Because you can't look at two people and see their marriage all you know is that they are married. The marriage is the exciting, sacred thing that is happening behind closed doors away from prying eyes, stolen glances in crowded rooms, the wealth building at the kitchen table.", "morenang_lakwatchera": "As for me, Why get married when you can still stay faithfull even without that thing...", "capture_her_moments": "Love this!!", "tiffy2dataffy": "Marriage for me is more of a spiritual event It’s going before God and allowing him to bless our union and to show that person that I’m bond to them under God It’s literally becoming one in every way", "iamquueenb": "It’s so true. We get married and go through all the rituals as part of our religion/ cultural practise. It’s a societal norm and requirement in some countries like Singapore where couples are only allowed to collect the keys to their government-owned housing with the prove of a marriage certificate. It’s very rare that couples move in together prior to marriage (in Asian countries)", "katcandidly": "Just out of curiosity, would you keep your last name or take Jared’s? I’ve met more and more women opting to keep their last names in the last few years. I wonder if that’s a tradition that will die off", "ggnailzit": "A beautiful book!", "enjoyjaredbrady": "❤️❤️❤️", "magdalena0022": "Very interesting perspective. #truth 💯", "thereallala619": "I see marriage not as for others, but for me and my future spouse. I could literally just have us two and the the person performing the ceremony. It's a pact that I'd make to him and to God (because I'm a believer ). That binds us as long as we're both honest and mature enough to maintain it, so for me that would be forever. I don't need the dress, reception, or cake because I'm celebrating the creation of our lives as one unit, two hearts one love. Everyone else is different. Also legally it helps because my husband would be able to make health decisions for me in case of emergency.", "younikness": "Congratulations to the both of you. Many more blessings to come @shanboody", "kbelieve.xo": "I think marriage has changed so much for society now, but to me, it definitely has to be because I know for a fact that this person will be my partner in everything and that it will be for life. But at the end of the day, that wouldn't change even without the ring (although I want the ring 🙄😂) Not gonna lie it scares me tho, because I have such high hopes for marriage and don't want to divorce. I love hearing other opinions and I definitely respect them. I think everyone has to be open minded and understand that if it doesn't work for you, it doesn't mean that it's wrong. That's how society grows. Wishing much love, happiness, complicity and peace to you both! 💛", "yosoyannav": "I totally agree. After meeting in our early 20s and 8 years later we finally decided to get married. Not to strengthen our relationship but to I guess for friends, family, and for us procreation. I wanted to be married before we had kids. Just personal preference on that part lol", "ravenbroski": "@retrorosser", "ilovemyvans123": "😭🤧💖", "hannahjeanwood": "I love this! My fiancé and and I are going through the insanity of wedding planning right now and we keep sending each other little reminders of why we are doing all of this nonsense, and this is what it comes down to.", "rerebri": "is this an open marriage?", "jeena.as": "Congratulations @shanboody from Toronto!!!! So excited for you, sending you best wishes and warm hugs to building your legacy. Xoxo", "_reginaselma": "I wish there was a way to be \"married\" like taking that next \"physical\" step of lifetime partnership and an act of \"documented\" commitment (??) hard to explain... but without the government interference vibe... the contract vibe. I just feel like it gets murky legally to involve the government in something so emotional and personal... but my goal is to be married to someone that I don't have to doubt or fear what \"murky legal woes\" would come up anyway though so I guess I'd be good... that's the goal! 🎉☺️🎉 Congrats on finding true love, friendship and partnership!", "azariaxzulu": "@shanboody I am still exploring what marriage means to me, since I don't currently have a partner I can only say I'm OPEN to the concept of marriage because if and when I do find a life partner, I want to build with them. A life, a legacy and most importantly a family 👪 Culture (not religion) is also an extremely big part of me and who I am and in my culture (Zulu culture in South Africa) marriage is traditionally to appease the ancestors. The ceremonies and rituals that we go through introduces you to the ancestors of be family you are marrying into and makes you apart of that family almost as blood. There are also rituals that respect the elders of both families, express love through music and dance that has been passed for centuries. Even if I marry outside of my culture, I can't run away from that ❤", "p.bella.k": "Just curious, you guys going to have an open marriage?", "ednachantellier": "@gia.maulbeck", "3ethie": "It changes the way everybody sees you as a unit. Even in my case my family tells me all the time that \"men come and go\" and expect me to put my man on the back burner whenever they feel like I should. If we were married they would have to accept that he's here forever and that he's my family just like they are and I'm gonna choose his side.", "shemeenas": "For me it started out as the way I understood relationships at that point and also bc I knew it was important to my family in different ways. Then it evolved into something extraordinarily beautiful as we evolved. And now we are family and always will be. ✌🏾❤️👸🏾👸🏾", "bballmom786": "Congrats! @shanboody def some good material for my midnight pondering... 🤣 anybody ever been eloped?  Thoughts please on getting eloped...", "penbadger": "For me getting married was an acknowledgement of the nature of our connection. We were meant to be married. We already were on a soul level. Made for each other 100%. It was undeniable. It wasn’t a choice for me other than to accept what is or not. That doesn’t sound very romantic maybe, but it is. Lol", "itsjenniwithani": "And.... I’m divorcing you because you had an affair with your best friend’s wife", "niaskindaneat": "Sometimes I wonder if it’s just for financial benefits!", "teahxhammet": "@caleb_kriedemann", "meetmyriam": "@shanboody First off, thank you for sharing your life with us and being so transparent. 🙂 I think some people are missing your point. (Correct me if I'm wrong). Yall, Ms. Shanbody is planning to take over the world..like Oprah type status. She wants to be highly influential, and leave a \"legacy\". So to accomplish that she needs to be relatable to as many people as possible. Marriage will make her relatable and reach a larger audience. Go head girl!!! I'm here for it. Make your legacy 👏🏽👏🏽❤🙌🏽🙌🏽❤❤❤💎", "cherrilizabiff": "I don’t pretend to understand anything about the complexities of love and relationships, nor do i even know what the “ideal” relationship would look like for somebody like me - but i have to say, i hope that the next relationship I’m in is filled with the mutual respect, understanding, and adoration you and Jared display. Your levels of openness and communication - not only with each other but with us - are inspirational and aspirational. Thank you for sharing your journey with us and i wish you two nothing but the best in this new phase of togetherness. 💕💕", "busi_bug": "@luthandeaux", "mesiashereene": "@shanboody to me/us it was a declaration of something we already knew or believed about who we are to each other. Telling the world that this is my person through and through. There is something sacred (and scary!) about standing in front of friends family and god(dess) of your own understanding to declare partnership. We had a friend read the poem Union by Robert Fulghum that depicted our emotion on that day and every day forward. Sending lots of love and blessings on your union ❤", "scorpiobaby1984": "No point...it's an old old concept based on economic reasons and child bearing", "nashayy__": "I agree with you. Marriage for me is about declaring my love and dedicating myself to this person under God and in front of the people that have raised me so that they know that we are and will forever be, a unit. Honestly, I don’t really care about the wedding. The wedding is for everybody else, but the marriage is for us; it’s solidifying the fact that I choose this person so let’s celebrate our love.", "niftykeisha": "Pretty much. My wife and I were together for 11 years before getting married. We knew we would at some point, but we’re already clear about our relationship and our commitment so it was all that pressing. People kept asking, “Why aren’t you married yet?” As if it meant something, it just meant that we were secure enough in what we have to not need to make it a priority. Now that we are married, I do see the difference in people’s energy when I say wife. It’s totally so others can understand the depth of our commitment.", "tammitakeover": "Shan I'm with @yungmaddietwice. I respect others reasoning but she hit the nail on the head for me.", "_ash_senpai": "Agreed I dont think a relationship should change because you got married. If things go to hell when you get married it would of went to hell regardless.", "finewomanhood": "The point of marriage is to promise and commit before God as well as loved ones that you & that person are to be one. Marriage gives the relationship stability and safety because you are physically, mentally, spiritually, and emotionally committing your life to the other person. While boyfriend and girlfriend you can always do the same things as a married couple but the the stability of that is not as strong compared to the married couple nor is it guaranteed because legally and spiritually you are not bound (the same way as a married couple) to your boyfriend/girlfriend. In a boyfriend/girlfriend relationship it is much more easier realistically to leave that person whereas married couples have a lot more to deal with and take into account when it comes to divorcing their husband/wife. Marriage is also a religious/spiritual/legal thing as well which can make it much more special to some people who see it as such. But overall it depends on the two people involved, there is no right or wrong way when it comes to establishing a couple's lifelong love!❣️", "amalbarks": "You should make a video about this topic", "1964amandaotis": "I want the world to know my relationship is legit. I got engaged so we are officialy partners, family, companions. When something happens to him or me, the other one gets informed first. In my country when some of the partners in a marriage loses their job, the other one needs to provide for them. And I want all that. I want the world to know that we are that unit who care for each other, work for each other, love each other. Thanks 4 this post Shannon, I feel very understood by you.", "lethal.poise": "❤️❤️❤️", "bexrosichan": "Congratulations @shanboody - happy to see and hear you so happy and clear. ❤️", "_.malisa_": "Marriage was stability. We are together but now in the government's eyes we are together. Now we can enjoy certain assets from each other like health insurance and having the same last name.", "nycdivorcelawyer": "I just wrote a book about this...", "lovelyfa": "Where I come from we get married to build for the future and for security. You have a lot and I mean a lot of kids so they can put their bricks in and build with you. Finding a partner is sometimes a business transaction... 🤔 who or what family has the best qualities to help me build the future I’m (me and my family) are envisioning? The concept of falling in love and marrying someone isn’t new to us but it just isn’t a stander for marriage it’s a bonus! (At least for my parents generation and my older siblings) it’s changing for us now more so then ever and love/comparability is definitely becoming the priority! BUT security and building that family name is still very important!!", "fayzeface": "I agree with this pretty much. I don’t see things changing before and after marriage other than how people see me and my partner. Wish it didn’t have to be that way, but I do like a good party too so I look forward to celebrating my great relationship with my partner with all the people I love.", "jillianar": "@jessicarodrig this is nice!", "_mbaliza_": "Are you guys still going to be open in marriage?", "staycr33py": "@brittanylily I love her so much, amazing youtuber to check out, but also this is a great answer about marriage", "backtocalle": "Way to blow my mind. I've never valued marriage and made it very clear to my longtime boyfriend/baby dad that I'm not interested in a ring or marriage. I also try way too hard to not care what people think but thanks to a comment you left above, you have me thinking things through once more.", "primping_is_a_habit": "@shanboody I agree with you about the societal acceptance of marriage. It is important to be understood by others in order to be a productive and influential member of society. However, even if you don’t care about society’s perceptions, marriage is a smart financial move for some because of the tax implications that it can have.", "heyanahera": "I am so with you @shanboody! I have so many thoughts on this and I go back and forth trying to figure out if it’s something I really want, or something I’m trying to prove to everyone else 🤷🏾‍♀️", "mizz_v357": "Love this", "joy_sonnet": "Congratulations! I have a question, no harsh judgement tho. Why would you care what others or about how society perceives your relationship? It is YOURS after all. Wouldn't it be something more for you and your partner, whether it changes anything or not? A statement just for the relationship? I'm curious!! Haha massive respect for you and Jared 😊💕", "naaduago": "What a beautiful post", "yooo_itsnicole": "Studies show that marriage benefits men as far as health wealth and happiness but negatively impacts women in those same era. So why would a woman want to marry knowing this?", "thickdaddydandelion": "Hmmmmmm that’s a viewpoint I’d never even think of, it really makes sense to me. You don’t get married to get to know someone better...that should already have been happening right? Maybe that’s a reason for divorces...married before they really knew each other 🤔 anyway! Lol I appreciate your way of thinking!", "jayce10k": "Marriage is about the a accumulation of wealth and for the man to pass what he accumulates down to his son. Back then, with no paternity tests, the only way a man could determine if the child was his was matrimony. Today marriage seems a bit archaic because paternity can be scientifically proven. Marriage is a business contract that has dire consequences for the breach thereof. Therefore, if you choose to get married my suggestion would be to choose a mate that is adding to your estate, an asset not a liability. If your partner isn't bringing anything to the table but looks and affection seems to me that you could find that anywhere and marriage in that case is more of a liability. Love should be in the equation of course; However, do not let it blind you to the reality of things. Most of the time we are driven into marriage not by love but alterior motives.", "_nikitka_": "For me, marriage is a dying archaic ritual. It's hard to believe in marriage, because the idea of marriage is forever. But as people, we grow, we change, and sometimes our feelings for others can change as well. Yes, it takes commitment and courage to stay married to someone, but sometimes marriage is viewed as bondage. I myself am divorced, but my partner and I are committed to the idea of being with each other for the rest of our lives. At this point the only benefit to marriage that I can see is for the benefits that would be given to us by the government.", "_m0onch1ld_": "😍😍", "hollerinanne": "Thank you for your eloquence, Shan! You’ve put my thoughts about marriage into words... as a person in a poly/open relationship people have often questioned why my partner and I got married, and it’s the signalling idea that you talk about - the hey look! this is my person, my family - that is being celebrated with a marriage. Congratulations you two 💫", "k.3.s.h.0.n.a": "To me, marriage is a public and legal declaration to those around you that you intend on doing everything in your power to support, uplift, grow with, and understand the other person(s) to the best of your ability for as long as they intend on reciprocating the same to you.", "doctor.sunk": "It's stability not for others in my but for the partners. A marriage choice has nothing to do with outside influence unless WE ourselves create that thought. It's the couple who want it show that with the ring or whatever may be in whatever form is that they are dedicated to go through everything together.", "viciousvibrato": "To me, you get legally married for financial and legal benefits. I can be with someone for the rest of my life and be spiritually married. We could wear rings and call each other hubby and wife or wife and wife or whatever and I’d be okay with that. It wasn’t until an ex-girlfriend told me that to get married as gay women could mean it would be easier to do second parent adoptions and for establishing things for our children. For me, marriage happens long before the actual act. But I do agree that I’d love to call someone my spouse because I want the world to know just how much I truly love that person. Regardless of how my marriage will operate (I’d like something open). I do agree that marriage is more so for the proof of others around you and not so much about what you already feel in your heart.", "izzycurlslife": "I completely agree, which is the main reason I do not believe in marriage. I do not feel I should have to help people understand my partner or the reasons why I chose them. I feel if I been with someone and move in with them, this person should already be treated like family after my actual family feels comfortable. I do not want do go through all that for others. I don’t believe in it, I believe that if I find someone and we are committed to one another we should work to continue that commitment over and over and love each other for who we are. Titles change things and make everything more complicated than it needs to be. But I’m also biased because everyone around me has gotten divorced after centuries of dating and few months of marriage so.", "_venussunset": "I have no clue what the point of marriage is but I like the way you worded it && I'm so happy for both of you, I love ur love, well what I've seen of your love🧡😭💫🍦", "1quietfire": "Marriage can mean whatever you want it to mean. Although I would like a steady long-term partnership with the ideal lady.....and the romantic & social concept of marriage is still good...I have come to realize that- as a man- it has no tangible benefits...and legally is more detrimental than positive. It's not made or geared towards men at all. It is there to benefit women. I don't need a marriage license to express love for someone else.", "iamjeseniayamilet": "To share your life with the person that you love along with respect, care for, like, appreciate. Marriage does not bind you for life. The bond beings with the unconditional feeling toward one another. Marriage should be a hard job but work does need to be factored in, it should be effortless like breathing. Marriage being to be able to share your life with your best friend everyday, even when days are shitty.", "lavidayg": "Marriage is legal. The benefits and responsibilities that a husband/wife has to his/her partner is the biggest distinction between a loving relationship titled live-in boos/bfgf/roommates/etx", "brainontoast": "I get what you‘re saying. But why marry for someone else? Why try to make them understand something they‘re not even part of? I think it only matters what the people in a realtionship think about it. I certainly think it‘d be really cool to be like 80 years old and still have a boyfriend🌝", "katreebee": "Yeah that's a great point Shannon! I really dig your opinion. Along with being considered a family comes the legal financial benefits as well... Like taxes, shared insurance, and being able to make important decisions for your partner if they're sick.", "violetitamusic": "That typo tho. Gotcha good. Haha", "dejalew": "Religion plays a factor", "fashonvega": "The truth ain’t never lied ! #SaidItAgain!", "shellyifyanasty": "Marriage is for nothing more than stability for me. I would not be upset without a ring as long as I can love my partner everyday. It’s almost nothing but a show considering the love was established (or at least I hope it was) well even before the proposal...", "jacihill88": "👌", "nessers_90xo": "Marriage is for the both of YOU not for anyone else💕", "imsortaok": "For tax breaks 😝 (congrats btw ily)", "marissalobos": "Agreed 100% Which is why marriage is not for me. Lol", "kalynnsrobinson": "I can see this, especially how the commitment ritual of marriage is something you do in front of people. Husbands and wives are usually a representation of one another. Which is why I believe people should marry someone whose values and character are as close as possible to themselves and what they're aspiring to be. Because your partner is an representation of yourself.", "mynameishisani": "I think for me marriage would feed my love language - words of affirmation are my highest and a proposal to me is the other person telling me that they love me enough to make a 12 hour song and dance about it if that makes sense?", "mrdevinaire": "Yes yes yes!", "alex_yng": "@_luilopez", "findingclaudia": "Open marriage as well, Shan?", "selizart1234": "This is so important. People ask me “How does marriage create more love?” And I say it doesn’t. Marriage is a legal way of making your partner your family. You’ve both chosen each other as lifetime partners and so you solidify it under the law and most likely in front of friends/family. Then I hear “Marriage is just a piece of paper/title”. And I say well... money is also just a piece of paper so that’s one. And 2, our society is nothing but titles. You call your partner boyfriend/girlfriend, right? Isn’t that a title? Doesn’t that hold some sort of significance to you? The conversation goes from there. I’m so happy for you Shannon! Can’t wait to see the hopefully new content on your channel to include couples who are married/been together for years. There’s not much on your channel about that! Congrats to you both ❤️", "blossom.mafia": "Just like my partner and I say * jeez bri 🤦🏾‍♀️ not my parents lol!", "wallamella": "I honestly see marriage as a tool to cut down on paperwork. For example, I have a chronic illness. So being married makes it easier for my person to advocate on my behalf without delays. That being said, I’m not married and don’t see myself doing it ever. There aren’t enough benefits to outweigh the hassle.", "monsterballmakeup": "I love weddings and being apart of them, same for children I love them and there wonderful but both are not for me. I feel as though a life partner and Marriage are the same thing. Their marriage isn’t more important then my relationship because some one decided to sign papers and wear a white dress. I think marriage is a beautiful thing for those who want that. I just know if me and mines know and so do my friends and family, and as long as we’re both happy and healthy that’s all that matters to me. I love the proposal part and the rings, I think it’s special to Have something you and your partner have to symbolize your love for one another but as far as as wedding and marriage goes I think I’ll pass.", "imjasmineb": "I don’t view it being for anyone else but the two of you. The wedding and marriage bands, yeah but the commitment is solely for the two of you IMO... it’s not supposed to only be this fairytale romantic thing either. You make loyalty clear by doing just that, being loyal.... but in marriage you’re combining your life paths, and building for legacy together (under the covenant of God for those of us who are believers).", "brwndeva": "So happy for you.", "sngwenya": "A wedding is a celebratory occasion, highlighting the love shared between two people. Marriage however, is an institution and therefore, it is for institution, it is not, and can never be a measure of love.", "smithgina7": "It’s the true test of unconditional love !", "zuleyma2.0": "Crying 😢", "allthingsjaxyoung": "Marriage is to build a family with someone, if you are a believe in any religion, it’s the ultimate and most important sacrament. Personally, to me, it’s not about how others perceive my relationship but how I view it, what impulse I want to give it! People don’t take marriage seriously these days and it is a shame because it’s a beautiful thing. I know it’s hard work, even harder than being bf and gf but it’s a wonderful thing. @shanboody", "strawberry.sweetheartt": "I agree with this 100%", "russelllane": "This is a reasoning/description that I can fully digest and rock with. I’m curious of your perspective on taking on your significant other’s last name, once married. Also, major congrats! 🍾", "kurom1dyke": "The Concept Of Marriage Is A Bit Much To Me. I Don’t Want To Be Married To Someone Because I Shouldn’t Need To Pay For A Marriage License And All That Craziness To Show That I’m Inlove Or I’m With Someone. I Also Feel Like Marriage Was Definitely Not Made To Fit A Woman’s Standards. It Was A Way Of Ownership In My Opinion. It’s Just Doing Too Much.", "teamtysha": "Beautiful.real. Words of understanding", "flower26power": "So no more open relationship for you guys then?!", "jimmyra.1988": "No problem", "jajacrysta": "Partner(s) ?", "dan.i.a": "I find it beautiful that two people want to share their commitment to one another with their close ones. It’s also two families coming together and creating a new one. Weddings can be overrated, but marriage is celebrating unity, love, growth, hardships and fam gang. Congrats on this one :)", "krissy_mae13": "I think marriage has lost its importance to both individuals and others around them through out the years. Sometimes it worries me that media doesn’t seems to honor marriage like it should and it causes a ripple effect for generations to come.The point of marriage is live life with this person whom you have connected with on a level that no one else could. The good, the bad, the beautiful are all counted up in the cost of marriage and at the end of the day it’s worth it to build with someone whose worth building for. I’m looking forward to watching your new journey and you dissecting it and sharing your knowledge.", "blackgirlsaregod": "As long as you're happy, im happy 💓", "__.kerenha.__": "To me, marriage is about bringing the families and friends of the two individuals and merging them into one unit. The lives of those people were previously separate. A wedding is a show of public unity.", "a_musing": "Shan you guys inspire me on a daily with your relationship, even if that means I’m not taking the same route as your relationship. The mere existence of your love together reminds me of what LOVE should be. Wishing you two all the best 💖", "iyomi_ashira": "I adore your story 😍❤️💕", "goddessoflovelightandcurrency": "Interesting way of putting it. Also could you doh a skin care regimen video PLEASE", "kaliyahnaisr": "Marriage to me is exactly what the post said, i wanna build a legacy with you. I can have a million different connections with a million different people but if we have something that we can build on mentally, spiritually and physically beyond the basic necessities of for you and me why should we ever want to lose that. It’s not just because they make you sexually attracted or you like the way they look at you because if that’s the case everyone would be married to everybody. I feel that marriage is something that should be reserved for someone that in all 360 different views they make you better.🧡 (and not just in a selfish gain)", "fabiola.cave.paquette": "I agree 1000% with you. It’s family, pure love and unity.", "lauraaa.cl": "Seeing this makes me believe in love at a different level, thank you for being you and sharing ❤️", "shanboody\nVerified": "Verified", "ellelta": "I feel like marriage is a way of showing your partner that you are committed to them and that they are worthy of the title of 'husband/wife'. When you've been together for so long, you might feel some doubt like 'damn, why he ain't putting a ring on it? Am I not the one?'. Proposing and tieing the knot is solidifying your commitment to each other.", "sapphrodtie": "I honestly don’t like the concept of marriage. I don’t think you should have to pay to love someone forever. As long as you know you see yourself with that person for a long time in your life, I believe in life partners. My name isn’t attached to anyone. We can do our thing without the whole ceremony. I can love someone for light years as long as I know that’s my person thats all that matters to me 💕 Bc if i fall out of love I can just leave them & not pay to be separated from them & deal with court yadayadayada.", "carefree_kris": "I think getting married is like co-signing someone else’s life.", "melisgreat": "The point of marriage in my opinion is continuing to grow with the one you choose to spend forever with. You continue to share your world with that person and you vow to accept them and love them until the love is no longer.", "karolynsdiary": "This is exactly how I feel and I'm actually going to repost this because I am siiiick of people asking me \"how much has your relationship changed since you got engaged? whats gonna change once you get married?\" Literally nothing but my last name and how I file my taxes will be changing. Very well said, I feel like you always put my feelings into well put together thoughts lol", "heyfoss": "Antiquated exchange of “property” from one family to another for economic, business, power, and procreation. Don’t have to be married to build a dream for the one you love. But yeah… that too."}