{"likea_sea": "@mungaloo my periods are 7 to 8 days too. Its a sad life", "fluffykilburn": "🌹💋💃🏽🍒🍓🧘🏽‍♀️❤️❣️", "batalienyers": "i was intrigued by the idea of the blanket until i saw that it retails for $370 😭😭😭 i am all for period sex though! no shame", "unjustlee": "Always been one of the baddest", "ronald.roddy": "Amazing", "bu4350": "💗✌🌺", "elohims_warlord": "If I'm really feeling the woman I'm with. Her cycle aint stopping no action... I got a black bath sheet just for that.", "iamstevesmooth": "Wth??? 😂😂😂😂 I just use a dark towel @shanboody", "andrea_henriquezz": "I originally went on hormonal pills when I was 18 to clear up my acne and be protected! I kept forgetting to take my pill so I switched to NuvaRing... GAME CHANGER!!", "shesthebrunette": "Omg this post is amazing thank you. I can now stop throwing out towels and busting out the hydrogen peroxide.", "vezflys": "i think@period sex might be kind of beautiful", "kurlykelle": "@fresh770", "francizcarreon": "@drescarreon", "nigel_nelly": "Just looking at her makes my heart pound!😅💓", "vegan_super_man": "With out the drugs of course", "mixedchick32": "Over here waiting for this period vid! Im siked", "fearlesskryss": "@_toldbyashley94", "flawedeity": "can you make a lil video about your experience with an IUD? or have you already?", "datsjusbritt": "I had a embarrassing experience with this", "thee_gorgeous_rhiri": "@sivu_sojola", "neicyofficial": "Thank you for sharing...", "ramirasoles": "@pape_esposito lo que estábamos buscando", "stephaniebohanon": "Oh I need this", "kiannabanks": "You are me. Wow", "jill.s__": "@high4sk", "kdewolfe09": "Ok but this blanket is like 300 dollars?!", "operanna19": "Wowowowowowow!!!! YES!", "sev_la_cheffe": "Why not just use soft tampons? They made my long distance relationship way easier...no more bloody mess", "leotheseeker": "@shanboody it was great honor and pleasure meeting you! Definitely the highlight of my vidcon experience!", "ms_frisco": "A blanket eh? Fascinating. Useful.", "iridescentbeach": "❤️❤️❤️", "mashley226": "The fact that we as women are having this conversation openly and honestly without judgment makes me so happy!! I've tried period sex in the past, however at this age, 49, my cycle is so heavy that I cant really consider it. But the cool thing is that my cycle only lasts 3 days now! Yay...", "vintageseahorse": "@number_1_mezcal_fan", "liveshiv": "YES.", "mrcgyl": "@swaaggyp", "iamtwuan": "🔥", "tribekkaaa": "Keep your sheets untouched while getting touched...🤔😉 #poerty", "thee_lovest": "All systems go! We'd always put a towel down, preferably a dark one", "nichollecaren": "I got desperate and tried the pill too. Pretty much nearly lost my mind. The thing literally changed my personality. My raw vegan diet is the only thing that worked but the way my life and bank account is set up... 🤷🏾‍♀️", "4_leafchlover": "Period sex blanket... SUCH A GOOD IDEA! Wow innovative!", "we.amina": "Ahhhh your transparency is hella refreshing", "gruskaykidd": "@madskap21 yes lettuce (let us) invest", "lafnear_kimberly": "Yeah that’s a no for me", "thobekagoba": "Please could you do a review on how it works??", "i_smile_and_laugh": "Blood smells mineraly. I don't really feel like sex during anyway. My periods are usually three days, tho", "flawsomee": "EIGHT DAYS?!? hell no 😭 idk how you did it", "fabyoulousface": "Ar the end I don't mind but... The man does", "dewannaglow": "I see you girl ❤️", "firstladypush": "Statistically 1in 4 men cheat. About 1 in 5 woman cheat. 47% of men who have cheated are cereal cheaters. With woman coming in at 44%. We all like to think \"not are partner.\" Ah woman's cervix is dilated larger during menstruation. Making it a high risk of bacterial infection. Your kitchen counter, door frame, and pillow case hold the most bacteria in your home. About 1,400 different kinds. What do you think about that sexy doorway pose or using ah pillow to lift your pelvis now. We don't think of these things and many bacteria wait for proper conditions. You may experience ah sickness more than a week later and never put 2 and 2 together. Going back to STD. Men Are you willing to bet your life on contaminated period blood. Women, on Std or bacterial infection that can prevent you from ever having children...we don't dare mess with our appliances while thay self regulate or self clean, yet wet do it with our bodies. We always reap what we sew. Be it a month or 5 years from now. The most important reason why we shouldn't expose our minstrel... God says don't do it...As parents we guide and instruct our children and don't always explain why \" this...or that\".. Cuz perhaps they wouldn't quite understand or they should trust that we have the best interest in mind. God does the same, listen to your father in heaven. Unless your an expert on theology, spiritualism, and microbiology because you asked Siri a few questions.", "mel_lauder": "This would be good for those who squirt. 💦", "simoneiwood": "I never have. But I just watched your story and I feel like I need this blanket simply for a peaceful nights sleep on my period!", "llezeatz": "Interesting.... Idk how I feel about it but glad to have that option... @musiqueluver82", "khloedosh\nVerified": "Verified", "bigjules63": "Yuck..does that include oral sex...but hey what ever turns you on. You know what turns me on? You standing up and showing off the Shanboody....", "tranaelabranche": "@carlos_ibarra400 during this drought this might be the solution lol", "lethal.poise": "That copper IUD was the devil lol.. so glad that’s out of my life!!!", "shaun_ie09": "@tristongriff 😳 ppl think of everything hun", "sunni_daze911": "Period sex = shower sex lol leave the mess in the shower 💁🏾‍♀️", "shanteldannbehr": "@shanboody I sent you a message a while ago..... if you need anything skin related let me know. My husbands a dermatologist in BH and SM.", "jennylopes2000": "Nothing like a goooooddd orgasm to relieve them menstrual cramps. Love period sex!", "babeontherun": "Oh that’s interesting 😃", "shanboody\nVerified": "Verified", "a_la_knickerbocker": "@flex is my favorite way to have mess-free period sex.", "ariethereyet": "So God thru ii8i8iiiii", "lilbig_savage": "You're probably the most perfect woman I ever came across on the Internet like dead ass❤❤❤", "chicothefuckinman": "I dont mind helping my woman out when its \"that \"time, I love her and am not afraid to get messy in the name of love and relief. This sentence is the only thing a period stops. 👌👌", "namaste.stasha": "@shanboody you GOTTA try the cup! There is an over the counter SoftCup that you can try! Sexy time is supposed to be less messy....... Omg sounds like a wonderful and fun experiment.... BEST PERIOD SEX PRODUCTS.... Cups, sponges, and blankets! 😘", "itscaseyjoe": "Because of my Endometriosis my period was 10 days long and came every two weeks . So I know that feeling !", "kewgardensmama": "Wow! Somebody’s actually taking about this?!!! On social media. This is why I love your 👏🏽👏🏽👏🏽🙌🏽🙌🏽🙌🏽❤️❤️❤️", "labeautyologist": "Also, I’m an esthetician based in Beverly Hills. Dermatologist & estheticians have different philosophies as it comes to treating acne. Doctors want you on meds. I treat skincare issues holistically, with custom designed skincare regimens. Reach out, I’d love to help.", "museofsorts.jpg": "I’ve had period sex on a bed & in the shower. Both are great. I actually prefer the bed though. Thankfully my period is only 3 days and I’m not on any birth control. But I definitely need this blanket!", "anxietyluv": "It depends on how comfortable I am with my man , and what point I’m at.... if it’s like massacre time shower only.... otherwise a towel then shower 👍🏻💋", "ratchetconsciousness": "Iunno man.. I just can't do it lol. But definitely not shaming those who do it!", "tiffy2dataffy": "Thanks 4 the tip! 😊", "ronejae\nVerified": "Verified", "theannaoakes": "So I guuueess this is sexier than an old towel?! 😬", "lesliebangamba": "Nah boo you don't f**k a gyal on her code red 😝🤢 #ISaidWhatISaid", "harjinder_singh09": "Always very pretty my friend.. Have a blessed day 🌺🌻🌹🌼", "kt82": "https://www.shethinx.com/blogs/thinx-piece/driving-across-the-country-in-a-pms-truck", "led.hed": "Pretty 🌹", "thisisjessicarose": "Game changer", "fvckapril": "Yo mine are 10-11 I think I should gey checked out lolllllll", "lifewithnichelle_": "@slaylarai", "shanmiss": "I wish it didn't cost soooo much for my budget rn, hopefully it's still around when I can afford it", "natasha_hynes03": "@ryanthompson344 omg they made a goddamn blanket for it", "debbosss": "Serious inquiry: do you use both the copper IUD as well as hormonal birth control pills?", "mocha_goddess_": "I love my Thinx! Yes I’m here for this", "jordan_spiva": "Period sex feels way better than regular. Lol. The mess is the only drawback", "ninavsmichelle": "Oh yes I like this page. Real talk!", "drewcaraballo": "@krismolinaa boy what the hell did I just read? Run red lights 🤣", "thecharlessmith": "Have you tried removing certain foods from your diet before going on the pill?", "xrxntx": "Sex period is a no no for me. Not only with all the cramps but I’m actually disgusted by my own blood lol. Can anyone relate?😖", "jasminejionne": "Love this‼️", "carlideckert": "The copper IUD is so great at preventing pregnancy, but horribly with cramps and bleeding, I'm so glad to know I wasn't the only one! Doctors told me the initial bleeding from having it inserted would last about a month, but I had my period for 70 days straight. With many ER visits due to cramps and an immense amount of bleeding, things have finally calmed down, but now I have my period for 10 days rather than 5. Throughout this time I had to learn how to embrace my desires, even during my period. Never be ashamed of something so natural ! It may not be everyone's cup of tea, but don't let that stop you from doing what pleasures you!", "snareoffbeat_sweet": "It funny how life works. I was literally reading all the reviews on THINX yesterday and gaging whether or not I should spend money on these advanced panties....and boom you pop up in all your amazeballness speaking highly of them lol I'm still skeptical, but I may try them out....at some point 😂", "kemmydufwa": "@kerryprecious", "artisancouncil": "Such a brilliant idea ❤️", "curlswithlove": "Such a good idea", "avey_smith": "LOOOVVEEE how open you are about things that are looked at as forbidden to discuss!!!❤️❤️", "andreshame": "Nice one.", "tore.williams": "I run red lights so 🤷🏾‍♂️", "milehighmolly": "I really feel you. I have the copper IUD too and my period lasts for 7-8 days as well. It’s frustrating but I am trying to find a balance so I don’t feel limited by it... Even so, it is still a struggle sometimes. I could say so much more on this topic!", "napppturner": "THAT PRICE DOEEE 😩", "laurienohotea": "Oh god my period lasts 3 days, 4 days MAX! SORRY for you guys and @shanboody but period sex? I see no problem here. I always say I'd rather have an orgasm than a Tylenol to calm the cramps. 😏😇", "roamwithash": "This is incredible!", "k.t._.moore": "I have the kyleena implant and miss about every other cycle if I have one at all. Maybe you should switch 🤷🏾‍♀️", "self.vibez": "fr fr, I don’t think it’s anything wrong with period sex; it’s just the smell that some girls naturally have while on it that would get me🤷🏾‍♀️", "olliej317": "One of the best sex sessions I had with an ex was when she was on her period. She had her tubes tied and so we didn’t use condoms (we were both negative for any STDs/STIs as well), so that was already great. But having sex on her period was AMAZING. I think the combination of just all the extra wetness and sensitivity, the “taboo” nature of it, plus the level of intimacy and trust it takes to try it just made everything that more explosive. 20/10 would do it again!", "absoltruphly_keiph_kizaru": "Shiid i run red lights everyday B", "shanicebanton": "@jaclyngenovese this is the brand you were taking about at the workshop?!!", "heart_spxo": "You're a hottie!", "jae_be": "This is brilliant", "funnyfacects": "How do you wash this blanket though — regular thing products need to be hand washed 🤔", "djmastertrej": "I have the implant and let me tell you, I am CONSTANTLY on my period. I really love the idea of this blanket because ruining towels just isn't my style anymore. Lol. Seems like a great alternative for sleeping without underwear while my uterine lining is gushing out of me too ✌", "naomicowan\nVerified": "Verified", "_carriemccann_": "This is dope! Thanks for sharing!", "jovanni_cd": "This is magic😳I’m already obsessed with their panties and now I need this🖤. It took some years of getting over the “embarrassing” part of having a period and move into the space where I won’t be with a partner that finds any aspect of me as “gross”.", "ooo.charlie.ooo": "@the.old.grumpy.gentleman 😂😂😂😂😂😂😂😂", "boricuaensav": "@mitch_k250r", "heyfranhey\nVerified": "Verified", "livperry": "Yes 💕💕💗✨", "shethinx\nVerified": "Verified", "elizab3thjoy": "@the.sweetest.joy", "kenyaste": "I can’t wait for my THINX", "kizzire": "Interesting", "guantai.w": "People reallu have it that long??? Mine is only two days and am done", "k_e_l_l_e_y_": "I don’t think I could ever want to have period sex and know my husband wouldn’t be for it either...I feel gross on my period so the last thing on my mind is sex lol", "heyyitsven": "Ma period lasts like 7 days. Every month, without fail. This product is definitely a good idea. Problem is I literally don't want ANYONE touching me when I have it. 😂 So I just wait semi-patiently till it's over. Still a good idea tho. 👌🏼", "bekahpollard": "Omg this is such a good idea!", "seayedub_": "I have the copper IUD now and I swear my periods are like 3 days long! I shortened my bleeding from 5 days to 3 days but I still get cramps and such but I love it 😩 and the only thing periods stop are sentences 🤷🏾‍♀️ #LoveLivePeriodSex", "hmblatter": "I started using sea sponges specifically to be able to have period sex and not worry about mess. That, plus I have found that they are the most comfortable and reliable method I have ever used when I am not in the mood for freebleeding into my THINX underwear (which they are a 10/10 brand). Thanks for promoting options like this, not enough people know about this stuff!", "syndrome_air": "I love period sex as much as anyone, but $369 not to ruin my $45 Target sheets, when I can use a towel....😖", "afeelizabeth": "@abosedee", "leecobainn": "😍😍😍😍", "davidastyles": "👌🏽👌🏽👌🏽👌🏽", "siyaolivia": "“If you bring the exclamation mark” 😩😭 genius !!!!!!", "thesupertrampgirl": "@tiago.branco", "mscookies876": "@neterie", "fuckthislifeandthenext": "@mayh_em 😂", "iammarleyyy": "YESSS. finally ! Lol", "teasha_da_best": "Ewww. I feel gross enough with blood running outta my snatch. U don't need anyone all up in there", "shh_justlook": "I’ve had sex accidentally and on purpose while on my cycle, usually it’s best to avoid my first day but afterwards it’s not as heavy and strangely when I’m actually having sex it’s like my body knows not to bleed as much?? 😂 he doesn’t mind and I usually take the condom off and afterwards just hop in to have a nice shower together afterwards (which of course involves more touching). But this blanket def will come in handy", "ll_cool_rey": "My girls not about it. I've tried. Lmfao", "_elyserae": "@shanboody you NEED to read #WomanCode by Alissa Vitti - it will change your life and get you back in sync with a good healthy period. The acne is coming from something internal and the pill just masks those symptoms and creates more problems - like overexposure to estrogen which can lead to cancer and other awful things! Seriously check it out!! I’m gonna DM you a link to her stuff xo", "vironikasays": "We need to sit and have lunch or dinner @shanboody because I have sooooo much to talk about on every topic you start....whenever you’re in Las Vegas, please hit me up girl 😉", "sirenagomez19": "Yesss, I love you for talking about this! This isn’t touched on enough because women go through it with their periods, and the world needs to know it’s okay to have sex on it AND without it.", "michaleve": "Any tips on managing the IUD strings during sex? I love the copper IUD but, over time, the strings can be really uncomfortable for both of us.", "thedvsmonkey": "Slippery when wet! Just adds to the new ink stains on the sheets! :-D OO", "arrivinginmelanin": "Sooo, I'm shocked by the comments. Of course I want sex more during that time, also I want to be left alone. My body is self cleaning itself and sex messes up your pH levels so why would you want to have sex when your body is regulating its system? Genuinely curious.", "talya.macedo": "Ok this is awesome. I usually just default to shower sex.", "katastrophex3": "So innovating!! Thank you for sharing! Cheers to no longer fucking up the sheets/towels! ❤️", "lu.cretiab": "Have you ever tried out the menstrual cup?", "1sherwood": "The smell of blood alone kinda makes me woozy. But this is cool. Good to know it's perfectly okay to have sex on a ladies period. I think part of me always felt like it was bad for her - its also hella messy but this might be something that helps me get over my aversion to blood and sex on her period. Danke schoen ❤️", "beenietv": "This is a very interesting product. Ive tried period sex once and it didn’t feel that great. Can you do a video on tips for enjoying and having period sex?", "prettylittlefittie88": "What is the hormonal pill u take for ur acne?", "alecia_antoinette": "Ugh. I got my Copper IUD removed a few months ago, I had it for a good 2 years 😩... Personally, I need to be intimate at LEAST 3-4 times a week so IUD had to go, those extra long periods were making me WEAK 😴 After day 2 Period sex is AMAZING (which oddly, I just realized that 2 years ago when I got the IUD 🤣. For ME, it must be done with someone who accepts all of me though imo Ps. I am in no way discrediting the IUD (copper). I can’t use hormonal therapies and have a busy life, so it was a life saver and it’s good for 5 years so it was SO HARD to give it up. #RIPCopperIud 🙏🏽", "melanin_mermaid2": "I don't mind lol just not day 1", "iamlaurendorsey": "Omg...we must be \"blood sisters!\" 😂😧😭 I hate having dumb long periods! I was thinking about getting a copper iud, but was told that they increase bleeding/heavy bleeding.", "shy__brown": "I was just talking about this yesterday with my bf.", "catherinehickley6": "I’m pretty chill with sex on my period :)) but only after day two let’s be sensible here", "erockfor": "I’ve yet to try their products but I love what they’re doing! Side note: I got back on accutane to treat my acne a few months ago. I hope the pill works for you!", "scorpiobaby1984": "Throw some towels down and you're good to go!", "onbekendjee_020": "@fiona_araya oke?", "sade.tanya": "@amelia_pz my kinda blanket lol", "chasityscooper": "This is dope! What a concept!", "kenziefairy": "Ugh I’m legit so horny on my period, but my cramps 😭 we haven’t gotten down during my cycle in a long time, I’d like to get back there for sure!", "mamaa.x389": "I have had a copper iud for 2 years and it is the worst I’m losing my mind with these 11 day periods", "jessiele.ann": "I never thought I'd do it until I did lol. It was amazing", "asdfmariely": "I just do it 😂", "chris_cullers": "✌🏾", "alannadwoskin": "@charfitz_", "iam.ambyr": "hi mom", "momojusvibin": "Wowww amazing!!"}