{"kumbuu_": "Ugggh I love you 😩", "nastassjawoods": "@_justmegs", "riqtheruler": "Speak on it @shanboody", "alanblandofficial": "I feel like being loyal is a choice and if you can’t be loyal then there’s no need to make excuses for cheating. If you want to do what you do be single and don’t make someone feel down because your doing what ya do", "portiawild": "@thetitclub", "vansgmz": "Yes!", "chedalu": "@rxnique", "picture_mel_rollin": "@dejmurray_", "namibiah": "@duncan_johnson5 shes the one I meantioned", "mysht_banggg": "@yo_b_letmecallu We talk about this all the time.!", "tarieslove_": "Facts", "jazmynxskye": "Can I ask, what is your sign? @shanboody", "recklessrani": "Def feel the same way 💕", "nyariangchieng": "That part! 🔥", "bbbbb.gr": "@soniasings", "s.l.eee": "@bwoy_z", "jazxnova": "@a_yeerome this is what I try to say babe she says it so much more eloquently", "jamee_rae_": "@tomedwardssss", "poca.hontess": "Mmmmmm... someone will always have something you don’t so if there’s no loyalty they will not always choose you but go off", "itsbethbitchx": "@simonefraserr this is who I was on about xx", "lorenza.gotor": "@amciferraz", "__.kharizma": "@stunthardmmb", "divine_ghaddess": "Agree 💯 percent", "maddisondavies93": "@laurennerissacooper YESSS FOUND IT!!", "polobrit_mom": "Agreed!", "ayr.in": "Love this", "taraschwartzmakeup": "Damn girl... allll of your ideas, thoughts, concepts are so f’ing real! So many shared feelings, and go hear you verbalize them makes me feel not alone 🤯🙏🙏🙏💗", "carlingjacksonart\nVerified": "Verified", "r.o.art.blue": "Wow! What she said was tasty. 😎🔥🔥🔥 #realtalk", "terissamitch": "I absolutely love how you brain works and thinks .... I love this", "yaaagirld": "@f.un_siz.e", "damon_dash1": "Facts", "itsradiobiz": "@shanboody And one more thing, in this vid (I could be completely wrong here) It sounds like your husband is telling u that Loyalty means a lot to him. Loyalty makes him feel good! It sounds like you hv a man that finds pride in being loyal to his wife & that same loyalty, reciprocated from his wife. Hopefully u are able to appreciate that about him.", "annykbe": "@bbiaani", "queencu_": "@ajm_1092", "ashleymercedesss": "👏🏾👏🏾👏🏾YES!", "finniyani": "🙌🏾", "yasmomeni": "@dani_keko this woman Is so cool lol", "shida_the_diva": "Damn Shan @Shan boody you just open my mind to embrace a new perspective on the concept of unconditional love. Thank you", "villenovelle": "@theredeye thought of you", "chenelle_frederick": "I love this .... makes sooo much sense!!!", "pashempress": "I feel really bad for people who love like this. For they have missed and/or are missing something amazing. I thank God that I have unconditional love and that I love unconditional.", "lachick1": "Yesssssssss", "goodgirllbadhabits": "AGREEEDDDD", "dajabrooke": "💯💯💯", "voluptuous_highness": "I really am loving your page", "chefdomod": "I’ve always said this...LOVE is very conditional.", "jadekka": "@flowsik_diamond", "lisa_mmango": "I feel like love is unconditional. You can leave someone you if they make negative changes they’re not willing to work on or be(come) disrespectful, etc......but the emotion (love) still exists. To me, loyalty is beautiful. Loyalty bridges the gaps. When you’re a life long (long term) partners/lovers/spouse there will be days or weeks (months?) where work and/or kids and everything else gets in the way. That mental distance could make someone walk away, but loyalty means i made a choice that my partner is worth holding on to, even when we’re in s rough patch. 🤷🏻‍♀️", "andreadp": "@stellapeatu checkea esta chiquita", "cahlshould": "@kenna.shouldice", "inspiredbytonevic": "Very well said. 👏🏼", "she.sparks.joy": "totally agree!", "allykatekessler": "💖💖💖", "dreamweavei2": "Yo I agree hella, yet people I tell this to see it as blasphemy or or I'm trying to plot on the next lady...smh I love the hell out of my wife, but she do some shit to cross the line..ya boy is out lmao @asia.n.w ❤️🤣", "aushalonye": "I totally agree!", "joshdtoken99": "Sorry guess I ain't see the pain in your eyes guess I'm not that nice of guy guess I ain't really try guess I just didn't see the signs guess you weren't really mine guess I just didn't spend enough time guess I should have pried more when u said u were fine theres a cancer where my heart used to be sense u left my chest gets tighter feel like I'm running out of breath so much shit I wish I could take back that I wish I never said when I kissed u goodbye man my fucking heart kissed death girl I don't know how to manage this permanent damage you were were always my muse guess all I did was cause a fucking bruise sorry I made those tears fall from your eyes wish I could fix it but I guess I'm not that nice of a guy guess I couldn't see it guess i couldn't see that your heart was bleeding I choked on mine when I watched u pack those bags and start fucking leaving guess I didn't do everything i could if I could do it all again girl I would and family just never understood buts it's okay guess I'm leaving now baby guess this is my cue. @kaceeblu @kcsmakeupartistry", "zachchevalier": "Well as long as I'm not the only one that have ever thought this way 👏🙌🔥", "ya.court": "So much yessss!", "simplyaamazzing": "I’m going to watch this video rn.", "ruaimaa": "Shan, an intellectual", "blerdboy_b": "I relate. Ppl love to use unconditional love as a way for you to tolerate their shit even when they’re wrong.", "ericavvu": "@jarthurr", "gabyauza": "@brunellagalindo 🤔 tea", "notbasticksasha": "@megfelkers", "asiaklove": "I am going on 3 Years married and I believe everyday myself and my husband get up choosing to be intentional. We are still learning however we take what we know about each other and we are intentional about loving each other . We have gone through ups and downs thus far and I believe that’s unconditional, I express what I need and desire and so does he. Overall we tend to one another mind body and soul and we are happily married. I believe loyalty ties into commitment and these same concepts I bring to my loved ones/ friendships . So I’m not sure what your meaning but I’m wishing the best for your marriage to last a lifetime and have solid relationships 😊", "xndsz": "@aoyouiirin te girl o!", "sassycritic": "I completely agree. Love is not conditional. If it were, many people would still be together.", "brittanythehost": "Gems for days!!!", "orangesunaa": "@sarah_h02", "bmikayle": "Check this phenomenal woman out! I’ve been meaning to tag you guys. Veryveryveryvery good content @p3nnisthemenace @shutuphollly @kynlaine @mfrancois @trbrannen @itsmel__ @bnlangston @ferngullyvibez", "fly_guy_ray": "@chyloww", "nyongogogirl": "🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾 Wise words sis!!!", "thedestinyn": "This made me question my thinking", "soopermikey": "Love is unconditional. You don't choose love.", "yaellee11": "💛", "louis_v13": "So what about prearranged marriages that turn out great... are they the exception ?", "kachi.u": "@amandaseales already said this a year ago.", "shaquiramiller": "Yes", "b_cole_rite": "That’s Deeeep🤔I like that", "krystal_lite": "well said 🙌🏾", "valerieashley82": "Girl I love you🙌🏽 @shanboody", "dashofting": "Word!", "sunbo_b": "This!!!", "rastabarbie": "❤️❤️❤️❤️", "derrick_devon89": "🙌🏽👏🏽💯", "rain__storm_lluvia": "@yo_zebo I fuck with you heavy ♥️", "tea_fortolu": "Aaaaa@enn n", "yeaitsdomo_": "Yeah definitely agree. I feel like only God as unconditional love period", "barelyberry": "Agreed. Choice makes everything different and more authentic, whether it be good or bad. Its like your choice is your truth.", "caydenceamelia": "@simoneiwood woah this whole page has just blown my mind within two minutes", "shebashayne_": "Unconditional love.... damn what a blessing and a curse! it is damaging to the the giver of there is no understanding that reciprocation is not guaranteed... it’s a completely selfless act and it’s not deserved by everyone! In its essence it’s actually needed by everyone! Good topic especially because these term are thrown all over the place these days", "ieshasworld": "YES. I’ve been feeling like a weirdo cause everyone out here talking about unconditional love but I’m like uhhh that doesn’t sound like a thing", "joannaplatano": "@jfowwow", "goddix.rising": "@mtlbrokelife", "blackdiamondempire_": "💯💯💯💯", "rockabilly_darling": "I love your mind! You are just so brilliant and open minded.🥰 You remind me there are amazing people out in the world, because there are a lot of examples of...the other kinds of people who aren’t so great.lol Love you and what you do! 💜🐼", "tgpoet": "And If it is real love it has no limit!!! Unconditionally states to love beyond conditions...if that is not pure and in-depth then what are we really saying?....conditions are only placed where we choose them to go! You disagree with all things that are bestowed within the so-called marital virtues as a life chosen contract! If this wasn't so then you would just stay life mates contract free!!! These statements confuse me as they come off contradictory....", "chiaramfm": "idk of je haar kent maar je moet dr echt checken @jamillasia", "x_oluna": "👌💯💕", "jc.lat": "Is this video on your YouTube channel? @shanboody", "ajira": "It seems to me that the only context in which unconditional love makes sense and certainly the only one that I apply it to has to do with parents loving their children.", "diimondc": "Unconditional love means that you'll always have love for that person but it doesn't mean you have to be with them if they disrespect you or if they cheat it, means the love that you give doesnt just go away because they are an imperfect human making mistakes and doing whats the most right for them at the time. Its kinda like understanding their humanity. Love is infinite and you can give as much as you want if you have it to give.", "stacyreneeeden": "Choice! Love! Adding value! Thisssss seriously is so powerful in breaking so many codependent romantic myths! So awesome! So strong as a woman and a partner! Cheers!", "cicimoya": "I think loyalty is an important concept in relationships for me because it says that my partner is expected to stay true to me and support me on good or bad days, whether I am present or not. But I also think it is tied to commitment, and when there's no commitment there's no need for loyalty.", "queenileiaa": "Babe we totally can do videos like this. @love_ismy_religion_", "ohnobabystiffwhere": "@nessaaa.babyyy", "torontotroy": "“I think choice feels better to me” 🖤", "lilmama.ayanna": "I’ve watched this video like 3 times back to back because I felt that shit lmao i agree 1000%", "demandaxo": "Yesssss! I feel the same. I always feel like I have to remind people that unconditional love kinda implies that we should put up with abuse and other things we shouldn't stick around for. Nah, b. I'm good.", "shamaabbasi": "i can't find the full video.", "ohiaintnobody_": "Loyalty is more like a virtue... its more of a moral than a Condition, well in my case anyway. It's a continuous gift, and the gifts can stop if i want them too lol.", "authorfaithackerman": "I cannot say I agree. I 100 see where you're coming from but dont like the idea of well you have to be serving me or me serving you, putting in time and effort only for you to decide well I'm done now. I'm past this. I'm ready for something different. Thanks though. Humans are fickle. And I don't think wanting security and loyalty is bad or weak. Yes I want you to continue to choose me. And I hate thinking someone did from obligation. But saying how I feel this year is different because I'm choosing to stop caring about you seems like you must not have really cares.", "_justbeachy": "@nathalie_alvarado", "shikey79": "@creativekisha", "anastasiaboltik": "@_klsb", "tlady03": "@thirtiesclub this sounds good but I need loyalty. I don’t need a nigga not paying rent because he’s mad. That choice shit makes me skiddish.", "miriankatrib": "I feel you can choose to love someone unconditionally yet not be with them at the same time... we can love from a distance... unconditional love is for me... for my joy and well being... I choose to love unconditionally... I choose to love that person because it feels better than the latter... but by no means do I have to stay... loyal... ❤️🙏🏼", "cindyklopez": "Makes sense to me 👏🏾", "stormyallure": "I’ve been saying this for so long and it seems like people don’t understand this concept and it made me feel like I was low key crazy but I knew it was actual truth . I agree with you Shan . 💕", "yimsyb": "I think unconditional love exists and should be expected between parent and child but I wouldn’t say the same for man and woman.", "ascension_ash": "Wow this makes so much sense👏🏼😊", "h0lly_g0lightly_": "But aren’t you choosing to stay loyal to someone’s who’s been there for you that in itself is choosing to remain loyal and in that instance what would u call it then “Hey well I’m not loyal to them i just feel like being there when i do “ Hey I’m “loyal” to you i “choose” to be loyal to you because i know you’ll be there” I think it’s about how u use the word and when you use it Just like the word love you don’t throw that work around if u don’t feel it so don’t be loyal to those who don’t give u a reason to be But also don’t take loyalty away from those who’ve Earned it because of your own deeper personal reason That says more about who u chose to be loyal to in the past", "knowskillz101": "@sptclothing we were just discussing this.", "simone_theunknown": "Looking at a few of your video clips & Our views are very similar. But as I can see from the comments... a lot of people can’t handle the thoughts of an open minded, free thinker.", "tubby.tubs": "@scrr.r do you agree?", "janvierhuit": "💯", "tsukikoren": "To know exactly if you're the best option one would have to go through the billions of options that are in this world. People grow people change people evolve. For the one who doesn't want to evolve it would take unconditional love for the two to stay together. There will always be better options. To have a conditional love that would mean love is not everlasting. It's all perspective. and in order to be unconditional love you would have to know that you're not this body and know that you are more. Love is not something you give love is something that you are. And when you are who you are you don't stop being who you are because of certain conditions wasn't fulfilled.", "b_dot_lynn": "@lay_coleee", "geo_antoinette\nVerified": "Verified", "itsjustroxanne": "@music_snob33 @bon_dia_nicole what are your thoughts? 🤔", "wendy_maria": "I love your view on this. So many people stay in unhealthy relationships to prove their loyalty. However people fail to recognize the possibility of growing apart. People do grow apart. In your 30s/40s you're not the same person you were in your 20s. Well at least I know I'm not.", "_milli_mama": "@mssexycass 💜", "mariahdyson": "@littlemissbria", "_neekoles": "@lalazio @bejoyous", "jordyrawse": "I like it. 🖤 I would say that I recognize unconditional love as the most radical choice one can make in a relationship. For me that choice is based out of trust and a proven positive track record for the relationship. Choice feels like love to me too.", "earthwindfire__": "🔥🔥", "godiva_17": "@letmecooktv", "pelafinahlivre": "Unconditional love is a burden", "iamgoldsmith": "Smh...You cant love unless its unconditional", "f0lasade": "👌🏾", "yuyuhakushou": "I feel like people who look for unconditional love in relationships do this because in childhood they weren’t given that( or at least felt like they didn’t) by their parents. Our parent are supposed to give you unconditional love so that we learn how to love ourselves unconditionally. I think thank healthy adult relationships are allows tohave conditions though, because a healthy self loving adult loves themselves enough to know when choose themselves over a relationship that isn’t working out anymore because a condition was broken. If that makes sense. In other words: our parents are supposed to teach us self love and self worth and give us unconditional love so that we do not seek it from others, but find it within ourselves.", "lesley.gutierrez": "Always speaking truth!", "itsmarisolreyes": "@shanboody I love this, how do you feel about “agape” love, I learned it as “sacrificing love, but some other know it as unconditional love. I love everything you said here, so I’m curious. I appreciate your time.", "jellorina": "Same same same same same same same same same wow", "theworld_beauty_101": "I can tell she had a rough patch growing up 😫🙏🏾", "mishy_fishy": "@zainiaz2", "dierbeatz": "But is loyalty not a choice? Lol I don’t believe people are just walking around blindly loyal. I also don’t base all of my friendships on what you can add to me because with that logic I’ll never have any true long lasting friendships because my loyalty would change with each person based on the purpose they serve in my life. Those are just my thoughts. Love ya @shanboody you always got me thinking outside the box lol", "realigkells": "I fuck with u is a better term than loyalty......breeehhhhhh 😕 you might be a runner...lol", "frecklesmedicineandbooks": "@danachanel", "rootvintagefashion": "I completely agree with you. Unconditional love and loyalty are not the same. I feel like loyalty is with yourself. Staying true to your gut feeling not going against that. Everything works out. But if you're feeling like you are doing something because you have too, because you are loyal to this person and you are dragging your feet or you're not into it then that breeds resentment and all types of negative vibes you don't need in your life. But in my humble opinion, most people are codependent, so loyalty is a must, they must feel like you will die for them or it isn't real. Because most people don't have a full cup to begin with due to parents, school, church, etc telling them how to be. Very few people are whole so they cling to this idea of loyalty being the holy Grail. But are you loyal to yourself? Most people aren't. And there lies the core to most of the world's problem. Most are reaching outwards for fulfillment. When it all starts within yourself. Like deep inside.", "keyon_ce": "I literally just asked my boyfriend if he believed in unconditional love like a month ago. It was interesting convo. I believe it can only happen with your kids and some family. Marriage you take vows which are essentially rules/guidelines to live your marriage by. So how can you have “unconditional” when your relationship has boundaries? Definitely is a good debate😏😏", "karenxpeinado": "Where is he full video? 😫", "foreverkeyyy": "I completely agree Shan ❤️❤️❤️👏🏾👏🏾👏🏾", "pop_darby": "Real one ♠️", "justapeek23": "OOOOOOWEEEEEEEEEEEEE, MORE TRUTH PLEASE. I WANT MORE!", "neebrasharniece": "🙌🏾", "shewhobeams": "I think real love is love because it’s unconditional. There is a wholeness that one accepts in choosing to love someone unconditionally. It’s the same love that sees beyond actions or choices no matter how hurtful. But real love doesn’t sabotage either. I feel like the choice is in the relationship. But I don’t think being able to love someone unconditionally means never leaving in terms of being married of booed up 🙅🏾‍♀️ that’s not healthy at all", "thejasminediaz": "Interesting discussion", "treneecia": "🔥", "athkerine": "NOW THIS.", "jayda_kissed": "👏👏", "mdonald8": "Yes, I did, not anymore.", "pprm_nyc": "👏🏾👏🏾👏🏾👏🏾", "burke_jamal": "@shanboody, I agree with your perspective on loyalty. I was told before and now I know for myself, there’s a thin line between loyalty and stupidity. No shade or disrespect to anyone!!", "carynprince": "Came with the major facts!!", "magicalmermaid_xo": "This video is exactly how I feel and it sucks when people don't understand it or don't wanna accept my opinion on this topic.", "tiffandjess0323": "@gregsoull 👆🏼 follow", "dearsimone_": "This! So well said.", "miss.katt_": "Wow. Spot on!", "inisikpe": "DEEP", "edwardistheman": "I totally agree with you @shanboody", "melatmulugeta7777": "Didn't see the videos yet... But love gotta have some conditions... I believe in dat", "drikadoesdis": "Watching you on the Steve show!", "phydiva": "🙌🏾🙌🏾🙌🏾", "francessmith": "👏🏾", "ms_frisco": "Unconditional love isn't for every relationship. Loyalty i", "whereisdavegoing": "@renee_simone", "mortalorganism": "This is real", "s2ricky_": "🤦🏻‍♂️", "mstcbakk": "Whew!!! I’m going to watch this and take notes!!", "fleuresquedesign": "Interesting thought", "m0liife": "I love this 💕", "bunny_salsa": "...if we are rooted to the carnal relm then logically all that makes sense...im a weirdo for not giving into logic or conditions as who else can walk this earth and make acceptable conditions ? Im okay being a weirdo 😂 i love it", "sysesq": "Agreed", "thesabrini": "Love this🙏🏻", "mye_tie": "@novemberbaby101", "burymeinchanel": "I say this all the time about unconditional love. Love is great but it does have conditions.", "maries_massage": "@fujilove your thoughts?", "jonesie_jay": "@stauna.shades", "fka_pcakes": "How many times have we been in relationships and been waiting for it to be over or for the person to real up with you bc you don't want to hurt them or you feel bad. Like no one wants sympathy love. I do however feel if you're adding value and being great to that person. You deserve some level of loyalty. Like that you won't just mess around with people who you don't see a future with, I mean if the relationship is monogamous anyway. Obviously don't stay with me if you're not happy but don't do things to sabotage the relationship bc you think I'll be loyal no matter what or love you unconditionally so you can do whatever.", "callmethrillz": "Totally agree with you‼️", "_venussunset": "I love listening and learning new perspectives and being like \"oh I never thought abt it that way, okay that makes sense\"💫", "sheischillin": "She speakin! 🗣👏🏾", "beatsbyiesha": "#LISTEN", "sincerelyjq": "Yes. Yes. Yes & more yes. This is exactly how I feel.", "darlingblasian_london": "After watching this and reading the comments - it got me thinking that maybe unconditional love doesn't even exist . The meer fact it only applies to children because they are your children is conditional. I think there is just love while others will receive more than others and make expections here and there it is just that love. It's a hard concept because we are imperfect and selfish beings.", "_heysus": "I understand where you’re coming from but I’d have to disagree for a few reasons. The first being you have the have a healthy balance of all three loyalty love and logic. if you let your logic out weigh everything all the time you will get trapped in a vicious cycle of hurting people which in turn hurts yourself. if you have ever truly hurt or broken someone you would understand what I mean and this is because unfortunately most of us suffer from the disease of more. There is always going to seem to be someone that’s a better option better looking has more money better house better car and many times the grass always seems greener on the other side until you get there. I think J Cole said it best you have to learn how to love yours and with this mind set it’s always going to leave someone at the altar and it’s all good until that someone is you. There are so many guys running around out here unable to be happy and that reason is because they have never been loved unconditionally or had any level of loyalty nor given it. So to you @shannoody I’d say love unconditionally don’t hold anything back because of what ifs and but also don’t forget your logic. You have to learn to be vulnerable to some not all and many times your logic will not allow that.", "gingerfoot": "I believe in unconditional love with your lover/bf, gf, hubby etc. I haven’t been in a relationship for a couple years, but I believe it will happen, unconditionally. Work! Work! Live! 😘", "priscila51018": "@chuckchai dude", "yungbabyhair": "I had to rewatch this multiple times and I 100% agree now. At first I was like hmmm idk but that's because those 2 terms SOUND good. But that bit about choice is everything. I love how you broke that down. 👏🏼", "ahmedjuudge": "To me unconditional love means that you give love but not excepting a return, if you’re having a bad day and that changed your mood, you was acting kinda mean to me, that’s the moment where I need to show you love even though my ego is tell me no let her be mad by herself.", "hopelessfromantic": "I appreciate you saying this. It’s hard to explain this to people as a single woman Lol.", "ms.todd": "This really resonated with me", "theauntofdragons": "Love is love and has no contract. I've seen way too many couples stay together because they feel this loyalty to the other because they \"put in the time\". Like it's a prison sentence. If we start to take advantage of one another, this relationship is no longer benefiting neither of us. I think we're all so fearful of being alone but there's nothing wrong with being single. It's not a scarlet letter", "teamesme": "such a great mind", "spirituallyamber": "PREACH!!👏🏾👏🏾👏🏾", "feelmiibunzzzzzz": "Makes me think of @derrickjaxn book.....", "tayloramor": "I always felt confused by the concepts of love and loyalty for this very reason but hearing you say this out loud makes everything make sense", "marystcloud": "You’re amazing", "faith.h.human": "@superdupershak okaaay.", "widdlebirdyy": "@mwani19 interesting pov", "nattymo21": "Yup.", "chinarae": "I resonate with this heavily @shanboody 💕💕", "tibyan_kamal": "I keep postponing watching this cuz am waiting for the perfect time 😂😂I don’t want to waste it", "paulyyb": "whenever I hear you talk I’m always on the same page as you I love it ✨", "essdeedub": "👏🏾👏🏾👏🏾", "erineerinarin___": "🙌🏽🙌🏽", "queen.of.hearts_____": "👏🏽👏🏽👏🏽", "masdemassy": "This is so good to hear.", "dreamboi": "So much truth in this ❤️🙌🏾", "itsasiamonae": "Everytime I watch you I find myself more and more comfortable with who I am. It’s okay that I’m different. It’s okay that what’s “normal”(for lack of a better word) isn’t for me. Please don’t ever stop what you do. It’s important. It’s informative. It’s helpful. 💖", "gosunnygo": "I love this perspective, however, I do think that unconditional love can exist even if it means you aren’t supposed to be together, I will always love a lot of my exes, without bounds, sometimes love isn’t enough to stay together exclusively.", "iamkevinwade": "Yes Shan!!!!! We have terms and conditions all up and through this bitch all dayyyyyy! Okurrrrrrrt!", "sypesype": "@shanboody I am fascinated by your full disclosure and oppositional rally towards a conditional love that still feels deeply realized and benevolent in nature. It’s provocative that we haven’t established this into our culture... and in many ways I feel you are onto something big. A self actualization that requires a shift in consciousness. Something around the truth we tell ourselves about the way we allow accountability to be distributed to everyone. Ourselves, others and the ones we “love”. I am grateful you share your voice with us.", "sexandempathy": "@ladysavaj", "fashonvega": "Yeah unconditional love is the way and easier than we think! We confuse it with unconditional loyalty! Two very different things! Your love even at its unconditional state has a condition which is, it’s yours to give as long as you choose! When you no longer wish to give it it is your to direct elsewhere!", "recklyss_j": "@shanboody you know you were in my thoughts over the weekend. Hope all is well. I'm glad for this perspective. I've been\"loyal\" to so many people and situations in my life because of the historical value but I feel that there were conditions because the reciprocity wasn't there. You said when someone shows you who they are the 1st time, believe them. Sure relationships take work but you need the best people around you to help you be your best, not just the ones you knew back in the day", "curlygirlbri": "I was all in this clip and then @jadenovah popped on the screen 😍😂", "a.dark.alle": "@aelowrey she preachin", "tylerrr.l": "@from_de_270", "zachariah.sterner": "For Real , this is some truth, love and loyality is something that is earned, it's not a right.", "kelisa_t": "I don't believe in either anymore.", "justrosalynnn": "Love this ❤️", "theebestamber": "I love this!!!!", "looksbylynne": "these are the kind of conversations i LIVE for! 👌🏽😩", "___lawyerbae": "when y’all got to how the presence of your partner in your life coincided with other key aspects of life improving, felt like a good barometer for thinking about how healthy partnerships/ friendships are for us 🙏🏽🙏🏽❤️", "janeceann__": "Loved this!!!!!❤️", "marlonmcglashan": "Wow..", "vumbambodance": "@sexandempathy", "tiny_caines": "Loved it", "visionbykovios": "Mmmm this. Very very thought provoking. 🙏🏽💫", "emotionz22": "I’m pretty sure loyalty and because i fuck with you go hand in hand though and loyalty should be mutual never sacrifice your self worth just to say you’re loyal", "karaisshort": "Your definition of loyalty is interesting to me because, even though people who know and love me would call me very loyal, I've never believed that loyalty is unconditional. I'm as loyal to you as you give me reason to be. In actuality, there are quite a few conditions. I also have issues around the idea of unconditional love, so I get you on that 💜", "ms_chloe_emmaline": "@humphreybear88 this is exactly what I was talking about!", "brittanysroom": "I never thought of it that way 🤔🤔🤔", "i_am_king__": "I would like to believe in unconditional love. I value loyalty becuz it’s rare out here in LA", "genieeeeeeeeeeee": "I loved this video! I remember when you said you don’t really have any deal breakers except for if he obviously killed your mom or something 😂 I don’t believe in deal breakers either. it just is what it is, just keep constant communication and openness between each other", "sayheystar": "I think it’s obviously unhealthy to hurt yourself, to prove your loyalty to someone. For me and my Ex. I love him “unconditionally” in the sense that I still love him to this day, despite what we’ve been through and how he may have hurt me in the past. However, we are no longer romantically involved because I love him unconditionally, without hurting myself in the process. We are good friends to this day. I love your videos and post! ❤️✨", "bri0nna": "Mmmmh I like this", "iloveyoucherrymuch": "I wish you could be on @redtabletalk when Jada and Will talk about being responsible for their own happiness and taking the time to find your match no matter the time in life as well as investing in love that’s the best match I always think of you 😩.", "annnna__p": "@petitefille1599", "_animusvox": "Well said @shanboody", "girlslockerroom": "💯💯💯💯‼️", "chip_247": "“Everything has conditions and conditions are healthy” — felt that", "xo.alessiariachelle": "You lost me...then blew up my thinking. I want my husband to choose me everyday. I want to choose him daily. That choice keeps us on our shit. How we look, how we treat each other, how we show up for one another. In my opinion, That unconditional breeds complacency", "diamondtruckergirl": "I agree with you !!", "iielaineii": "@iams360", "simplyearthy": "You said a mouthful there @shanboody This is so on target.", "yosheedean": "Good conversation valid points 👏🏿👏🏿", "shonarae.d": "You just put my thoughts about this into words 🙌🏽🙌🏽", "fahimandfaher": "With that logic, what happens if someone better comes along? Do you leave them because they’re better or stay because?", "kashbryant": "Goddddddd that is so G ... I been saying this for so long. This is also why people stay in bad relationships/situations. The counter argument is that you will leave people, jobs, etc as soon as you find slightly better. Grass is always greener effect. BUT I still think people and jobs need to hustle to make it worth being in your life. Loyalty should be rewarded, not expected", "_crissybabe": "@morenito_8288", "laydee_west": "Wow...that's a mind blowing perspective. Loyalty has always been top of the top for me. But \"choice\"...yes...choice. I choose you, and want you because that is what I want...not because of obligation or expectations, but because of want and desire.", "keishjp": "💯", "_uniquelyme___": "What y’all think @theafterschoolpodcast", "jodianne.beckford": "Wow all of this!💜", "_dearari": "@livielove_sozo", "sabrina_ands": "@rachhdwyer thoughts???", "tianna_griffin": "My mother is probably the only person I could love without any condition no matter what she did or whatever happened.", "prettyyellotone": "I guess it’s all in how you look and perceive it 🤷🏽‍♀️", "tonrox": "Unconditional love exists and is very realistic, just not in chosen relationships. I feel like the term only applies to your children.", "kelleenpaige": "🙏🏼🙏🏼🙏🏼🙏🏼", "danaiaajee": "Wow . Deep", "igotthekees": "The only thing wrong with it is the idea of desire... choice is great but how many unstable people to we encounter regularly THATS shifts like wind in our live because of what they can get ( what value you bring) and what else is out there... this commitment to choice without solidification to foundation will have you fucked... try this method with something as simple as your credit score... you won’t be able to be solid enough to obtain a trustable history for the lender.. and it ends us in a whole of personal debt, where we feel empty. There has to be reciprocity and not desire based reciprocity. I’m out wants are endless, especially if we have a history of lack, which many of us do... this is coming from an open minded individual aswell. This isn’t wise in idea, not backed with proper reason", "rotordoc_": "If you’re not loyal to yourself then you should not be in a relationship", "elevated.dreamer_": "Period!!!!!", "am_i_wrong_doe": "Is this referring to love life or people in general, like family too??", "sade.genevieve": "@simply_stiina", "theflyingspur": "Churchhhhh", "_heyyylauren_": "My love is unconditional, but my time and energy are not. I believe it is possible to love someone for exactly who they are (unconditionally), while still setting healthy boundaries for how we interact with one another. There are people in my life who I've chosen to love from afar, because that was the healthy choice for me-but I still love them and wish them well. Hope that makes sense.", "kurom1dyke": "I’m Excited To See Another Dinner Table Talk!", "sole_legit": "@ebonysroom", "dacacaona": "His hair 🖤👌", "imjordanjoseph": "So you believe love should have conditions? @shanboody ? Great topic BTW. I’ve always believed you can only truly love without them but this is interesting and understood", "reidbetweentheliines": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "robhillsr": "I enjoyed this!", "meghantonjes\nVerified": "Verified", "lisscharlton": "🙌🏾🙌🏾🙌🏾", "_reginaselma": "Love this @thekneesofatomboy Who made up that phrase anyway? Someone with no boundaries and who was also married in 1909. This goes for any type of relationship. 😤💪🏾", "latericerule": "The only person I feel unconditional love for is my child. Everybody else, not so much.", "dork_a_lodeon": "This right here 👍👍👍🙌🙌💪", "melaniefiona\nVerified": "Verified", "fake_gucci92": "@kathrynymagill", "andrene.france": "I totally agree 💯 We live our whole lives based on the right conditions for us. We choose our friendships, jobs, play, where we live and even sometimes the family members we link. It's not all perfect, just a balance of which things in those scenarios we're willing to live with.", "laliquekae": "Choice feels like love 👏🏼", "__kaylathegoddess": "I loved this video", "angieofficiallyinthecity": "I legit just talked about this to my mom!!!!! Definitely going to give this a watch after work 😍😍😍😍 fuck that day 1 oh we've been thru soooo much! That doesn't matter if its not healthy for you 🙄", "neatandstreet": "That’s too millennial for me. Not knocking the idea, however what other choice is there in relationships other than choosing to love one another. If you’re being serious about having a relationship that’ll last past the shelf life of a loaf of bread then loyalty is a big part, for me at least. I’ll watch the full vid though because imo this clip makes it sound as if loyalty & complacency are 1 in the same.", "jdanistheman": "Love this video", "salenadevon": "💯👌🏾🙌🏾", "tiathevenin": "🔥🔥🔥", "beatlej24": "@lucyford14 what do you think about this?", "msclieo": "Loyality for me (since it has a evolving meaning as I understand it) is to not cheat or deceive someone and to stand up for them even in their absence. BUT also includes calling them out on their shit, to help them stick or challenge their morals and boundaries. As for unconditional love... everything is conditional. Maybe not for your children, but since I don’t have any, I can’t say. (Sry, for any mistakes. English isn’t my first language.) hope everyone has a great day 💛", "so.raeh": "This!!! 🙌🏽", "rickyshucks": "EXAAAAACTLY", "amberscloset\nVerified": "Verified", "makeup_playhouse_": "Same here I agree🙋🏾‍♀️", "joan.rupram": "lobed this👏", "nou_nour": "Shannon you just put my thought process into perfect words!", "__reka": "Can’t wait to watch!", "israeltorrellas": "Ok need to see the full video... switching platforms in 3 2...", "_lleexxii2": "Yes my intellectual queen!!!!!!!!", "abilema__": "Realist shit ever ❤️", "thickgrlscloset": "Felt this so deeply", "its_wamere": "You just eloquently said everything I feel about choosing someone. To me that is what love is. Unconditional love is for parents and their kids in my opinion.", "kandicedanielle": "Totally agreed with you 🙌🏽", "lady_like": "I like your view! 👌🏼", "keeniakolada": "We are literally incapable of unconditional love anyways so it’s just a romantic ideal to imitate God’s love for us...", "makeupbyd1220": "Love this", "sashaysashey": "Facts. Please be my best friend 😍", "longlivelava_fai": "Love the way she thinks 😍", "pizza_raia": "One of my favs 🙋🏾‍♀️🔥", "ameliasheridan": "@milito_hernandez thats very interesting", "axel.anire": "My super logical brain agrees with you Shannon!", "asap_dontie": "These crazy LA folk at it again", "tabiacharles": "I can't wait to watch it.", "xsolo.x": "Love this", "itsronnielynn_": "I have to watch this.", "simplystylish411": "I can’t wait for to watch this because I was just talking to my friend about loyalty last night because sometimes that can be a slippery slope.", "artbyanitaheart": "i loved this video so much!! hearing your perspective and another couple’s perspective on relationships is so educational and eye opening, i hope this format continues!! also....ya’ll were so beautiful!!!! lmao", "oakmediakc": "Like ppl that say I need to be with you vs I want to be with you. I still choose to be here & not need due to externals like kids, bills, friends/family, credit, or career advancement etc.", "cydnewashington": "Fascinating", "jowiththefro": "I think unconditional love is chocie", "abiasmiles": "I get what you're saying and agree so much... I believe in loyalty within conditional love tho... If that makes sense.", "bailey_raeholiday": "@chasetinnermeier", "sarochita": "Yes but I also believe in resentment lol 🙃", "lexrosegold": "I’m going to find you and I’m going to marry you into my relationship. You’re like my second brain.", "plantinfidem": "👌🏽", "thenames_cc": "@tmirving_ thoughts?", "vancer22": "This gave me a lot to think about. Thank you 👏🏾", "melissanathalia_": "Love this perspective. A lot to think about!", "mznigeria": "This is one of those thoughts I’ve always had in my mind but never had enough courage to say out loud because it the ‘unpopular opinion.’ Choose me & keep choosing me as long as I serve a purpose/add value. My love is conditional and I expect the same from others. Love is a choice to help someone grow, it’s not a situation we get stuck in and it’s not quantified by time.", "kaymeaganxoh": "@kiersten.alexandria", "itstracyg\nVerified": "Verified", "topaz_faerie": "Love is very conditional. At least for me. 🤷‍♀️", "therealamberjoy": "Preach Mamaa.", "sunnismilez": "Saw it already boo", "bronzecigar": "This is such a mature convo. I think that we are given these one size fits all ideals and it’s just super refreshing to hear another perspective.", "iamparissantiago": "I REALLY needed this today, going through a traumatic break up and waiting for the pain to end! I would express the same feelings about unconditional love to my ex that @shanboody is speaking of and it wouldn’t sit well with him. But it is my truth. People need to realize everyone has a limit as to what they can and cannot tolerate. Thank you Shannon!", "smashenfashion": "Funny I came across this. I was just speaking with a colleague that worked with me in a jail house and this issue got raised many times amongst our women groups. We referred to it as \"jail house mentality,\" as a number of people most women, however. including men were serving sentences based on the premise of loyalty, even though their loyalty wasn't always a two way street and even though it subtracted so much time and value from their lives.", "princessmiabia": "Every one needs to hear this message. The whole conversation was amazing! Please continue this segment! I enjoyed every minute of it 🖤✨", "quickieswithmickie": "thought i was the only one ✨ thank you so much for sharing /expressing this so eloquently :)", "tomiwarhoda": "Words cannot express how much I LOVED this video! So many good points were made from everyone. Loved your take on the term “unconditional love”. And I love how you talked about almost feeling guilty about participating in marriage and Jared was like “BUT YOU HAVE TO”. Ahaha homeboy was like, I didn’t get you that ring for nothing 😂 loved every part of the video. Plus both couples are amazing to look at 😍 lol", "bailalo.brown": "Dope perspective", "thisbrwngrleducates": "Choice feels like love!! I completely agree.", "neffeybaby": "And people need to be honest with their feelings in relationships and stop wasting people's time if your not going try and be committed at least...", "hyfr_ovo": "Its important that People listen to these kinds of conversations. I love how Shan uses her platform to spread knowledge and get people talking. GO AHEAD SIS!👏🏽 I’m here for it!", "kinglion415": "I really love the message your saying but it feels a little to me like you’re conflating loyalty and a contract. I feel as if you can have loyalty to someone but that loyalty can always be broken, for example killing your mom, you have a choice whereas with a contract breaking it seems to always have a negative consequence that people fear. Just my hot take on it though.", "aminahchann": "wow but I completely agree with you. unconditional loves makes no sense, it literally doesn’t compute with me.", "cshellx": "Love is the continual choice", "ohsnapitslauren89": "@srhlcs I love watching her channel! She does a lot on relationships! Check her out.", "nenapolap": "@sxrar @franziplp", "prettybhamidi": "🙌🏽 LOVE WHAT YOU SAID", "alynimue": "You are glowing gurl ✨❤️", "color_mysoul": "Such a good conversation!!! Love you @shanboody", "a11hale": "Obsessed with your mind 🙏🏼", "teytyme": "@jwcmiller", "jojodbanana": "Wow🙌🏾 never thought about things like that! I’m still trying to figure out how I define love in my own life and this definitely helps and confirms some things for me! Will definitely give this video a look after class😊"}