{"iputon4jesus": "Visit my page for encouragement", "mrs.lateef_aha": "I got the copper iud put in after my first daughter was born. I only had it in for 6 months because my body started to reject it. I ended up have full blown contractions and got it taken a few days later. Later I realized I didn't want to get preg5again and the pill wasn't something I could keep up with. I got had another iud put in. Even though I felt my hormones were more balanced. I need up growing cyst on my ovaries, having one rupture. I left it in for the full 5 years and when it was time to take it out my husband and I were wanted to try to have a child. Immediately after my hormones were all over the place. It was the worst year of my life. It took use a year to conceive. I don't think I'll get on birth control again. There is one type, that is a simple thermometer type that tracks when your ovulating. I hadn't had a chance to try it yet because we are expecting again but it's my next choice for birth control. Self control has to play a part in it though too lol. I feel like my experience wasnt great and could have been worse. ******Please give the information about the harm that birth control has on a woman's body too. You have a lot of woman who look up to you and will listen. It's best they know both sides*****", "thorsdreamgirl": "copper IUD also!!! every time I get my period I’m like “I forget how bad this shit is dhdkelshdll” but the comfort of knowing I’m good for the next 7 years without having my hormones fucked with???? SHUKRAN ALLAH! 🖤🖤🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "chayatamara": "I’ve been taking the pill since I was 17, it helps regulate my cycle so I know when to expect my period. I also have a family history of ovarian cysts (had to have surgery to have a huge one removed this time last year) and the pill is the first line of defense. Also, I get to have sex and not get pregnant which is pretty cool.", "heyyits_ash": "U need a podcast 😩", "redpetite_89": "How is the copper iud... I've been on the merina for 9yrs since I had my daughter", "bluethealien": "I loved this video!", "hannah_hawkins_": "Paraguard copper iud!", "datsjusbritt": "Shout out to the patch n plan b😂😂😂", "madisonhrose": "Nuvaring!!", "sarahcimi": "@amandahomen89 you should do something like this dude! For yourself?!", "gowiththe.flo": "Mirena IUD.. I love it because I don't have periods and don't get pregnant", "sadiepetiford": "I was un informed about copper toxicity from the copper iud. I had no idea what has happening as it was happening because none of the symptoms where listed expect “cramps” and “bleeding”. I almost died from the crippling mental and physical health issues it gave me. I called the Paragard company gave them my story and the rep on the phone said “sorry... but the bottom of the box says ‘this is not a complete list of side effects’” there is no compete list. It destroyed my life. 1 year post removal and the symptoms are", "sassycritic": "I had the copper IUD twice and loved it! However, my body rejected the first one after 2 years. I got another one that lasted 5 years but caused a lot of problems towards the end. Infection that led to an ovarian cyst, abcess, and emergency surgery to remove it plus an ovary 😔. So while I think it's a great thing to have, I've learned that it can and has caused serious issues for many women so just be sure to stay on top of any issues that come up, if any!", "britz_24": "Ahm..condoms..n pulling out", "hadme_atshalom": "Birth control meaning condoms? Because birth control pills and shots cause more harm than good.", "lash_and_brow_fairy": "And comments on the merena?", "glamandcurvy": "I use the same one and I'm so thankful for it🙏", "fashandtalks": "I’m using the same as you ✨", "_keiandra": "Kylenna! Hormonal IUD thank God and modern medicine 🙇🏾‍♀️ 🙏🏾💕", "amyrudometkin": "Men on birth control. They are the ones that should take/use it. My body, mind and spirit... we’re over it. 🤪 #onacleanse #itsthemansturn", "almightyloca": "I have the nexplanon implant in my arm. My only complaint is the random and constant light bleeding. Its getting annoying.", "shanaboo15": "I’ve been using a birth control pill for 8 years now to regulate my period. Thanks to birth control I don’t bleed for weeks or months on end @shanboody THANKS, BIRTH CONTROL", "dea.____": "Been on the pill now I have an arm implant ! Still hormones but it does a great job + no period !", "my.fluffy.companions": "Natural cycles has been an amazing experience for me. I was very sceptical at first but I did my research and can honestly say I made the right decision. It has allowed me to stay chemical free in a long term relationship and gain understanding of my body. ⚠️Make sure to read the facts and not the slander news articles that have no validity!⚠️ If you choose to give it a try head to my bio for a 20% off link for a years subscription and a free basal thermometer 🤗🥰", "eden_skye_29": "I have the pill now, been on it for the last 3 years and next week I’ll be switching to the depo shot.", "belle_femme__bouclee": "Over the years I’ve tried Depo, various pills, condoms, IUD, and am now on the rhythm method. To be honest since I am in a committed relationship and have some medical problems I can’t see myself ever going back to artificial birth control. We will see how I feel after giving my body a break for a year or so.", "nappyrootz_": "Fuck birth control 👎🏾", "loveandfitness10": "I didn’t like birth control really lol. I remember one called TriNessa, it makes your boobs big but completely depletes your sex drive. A few of the different pill brands really altered my mood, I was so “ugh” all the time. I tried spermicide insert tablets & films too. Better alternative if you want something non hormonal but more expensive. You also have to remember to put it in 15 mins before sex and they work for like and hour.", "chrissy_luvs_u": "I just track my ovulation cycle", "badformchanel": "THANK YOU BC FOR SAVING MY LIFE AND SKIN 👏🏾😩👏🏾😩", "spooopyy": "I was only ever on the depo but it took away my period and had really no side effects. I haven’t had it again since like March?? And still period free 😎 I literally only took it for that reason. Am planning to go back and continue it soon.", "taylowfayeee": "#thnxbirthcontrol shout out to #nexplanon although you did ensure I didn’t get pregnant you also ensured I lost some of my hair. #goingbald #literally", "__kaylathegoddess": "I’m against birth control for my body but shout out to the women who do take it and it’s making their lives better. ❤️😊😊", "williefordham": "Being gay", "kayselcaribay": "Nextplanon ❤❤❤ period every 3 months and it is in my arm so i", "shannbann": "Ive been thinking about trying something nee because I always forget to take my pill. But im scared. And pros and cons for the IUD?", "stitchbanger": "IUD", "adriana_anguianoo": "Do you have a video talking about your experience with the IUD? If not, that’d be sum I’d watch 😉😂", "yanataughtyou": "Copper IUD!", "alexpeebee": "🙌🙌🙌", "realigkells": "Who makes up these days...", "soraiasakkaidou": "Beautiful Woman", "naturalistanas": "I use the pill, always have. I want to explore my options though", "kathleenrenwiicke": "IUD 💖💕💓💗", "babygirlgabriella": "I have an IUD for treatment of my polycystic ovarian syndrome & endometriosis. So far so good! 👍", "k.catalyst_": "Glad this is here 💕", "dealsforyouz": "Great #shootout4shootout", "taylormortlock": "Love the IUD!", "martinadragunova": "I personally use FAM! I am not relying on just on it though and I have to say I am very happy with it so far !", "indilinda": "copper IUD 💯", "deniek.turner": "@sarinaneote", "drling.nikki": "Thankful for the pill!! It’s been the most effective for me and I’m a stickler when it comes to taking it properly so I never miss a beat. It’s my body and I’m so thankful I get to choose when I want to have more and when I don’t.", "uglyassfckinnoodlehead": "Lesbian.", "hashnastty": "Date girls.. best birth control", "theocubeforfemalecondoms": "🙏🙏🙏🙏🙏", "teresa_ashley31": "@j_solis94 !!!!", "spreeisms": "IUD is life! But nit all brands are made equally. Mirena is much better than the rest", "mindshifter108": "Yaassss copper IUD!!! I was nervous to get it but so far I'm loving it as a non hormonal care free form of birth control. #thankyoubirthcontrol", "lilbrownbby": "I’m using the copper IUD too! I love it. The only complaint I have is that it makes my period longer, which is annoying", "c.allllie": "I have a copper IUD. It’s the best for me because it doesn’t interfere with the medication I take for my chronic illness. It’s really great (even though the first few period were quite heavy after the insertion) but it’s been good for me and my lifestyle. The insertion wasn’t even that bad, and the cramping lasted a day afterwards. I’m really glad I have this form of protection that I don’t have to worry about taking on a daily basis.", "zalandria_32": "Shout out to the IUD!❤", "heidi_chevez_ulloa": "#thxbirthcontrol I have used many different types from the pill to the patch, I had a Tubal when I was 28 and so although I don’t need birth control to prevent pregnancy I am so thankful for Mirena (IUD) because it has put balance back into my body and I am able to function with my cycle and avoid further surgery for now! I started the pill at 14 for the same reason! (Didn’t have intercourse until after high school) although a danger to a few women, birth control has helped so many! And not just to prevent pregnancy!!! But it is also a plus to have the ability to choose when I was ready to get pregnant with all 3 of my amazing children!!", "iamangelaway": "Mirena IUD! 🙏🏼♥️", "mrspennylane_": "@shanboody copper IUD is LIIIFFEEE!! I’ve had mine since I was 19, just turned 28 yesterday and have had NO complains or issues 🙌 I get regular check ups and everything is always good to go, and no unplanned pregnancies and no added hormones ✨✨✨✨", "ashleybrantley_": "I have a blood clot issue and almost didn’t make it out of the hospital last year due to the birth control patch. I was told by three doctors at two different hospitals that I can’t be on a hormonal type of birth control. I’ve been using my ovulation chart and condoms so far and it’s been working well.", "drewultra": "My birth control has to be Jesus himself honestly because I’ve never used birth control in my life. I’ve never been pregnant either. My boyfriend and I have been together for almost 5 years now and I don’t remember the last time he used a condom. 😭", "kingnequil": "Pulling out", "chinarae": "So thankful for the pill, it’s saved my life in more ways than one!! Been faithful for almost 10 years 🙏🏻💫", "jon2trill": "I love it!!", "slicelyf": "The pill stay coming thruuuuu 😂", "mszfazia": "IUD (mirena in particular). 1. It lasts 5 years. 2. Fertility returns to normal after removal 3. Reduces heavy periods", "king.aire": "Birth control is only for those who have a weak pull-out game😂😏", "miss_fit_foxxy": "I believe birth control is destroying women. Especially black women.... why??? Because it’s causing a bunch of fertility issues in women. Many doctors use birth control pill as a solution to every menstrual problem or to any stomach issue and it’s wrong.... (don’t shoot the messager)", "lexxboyy": "Nexplanon!", "teisateonna": "Birth control has really brought my health down dramatically. I’m no longer taking it.", "awkwardly_ekeneshaa": "Plan B 😩😞", "bellethadon": "What’s the difference between the copper iud vs mirena", "hershebeauty": "My method of choice is the pill", "theprogressivestarseed": "I’ve found that the temperature charting with @naturalcycles works well for me, because I have a regular cycle along with using condoms.", "courtney.smellink": "I was so relieved to have no side effects from copper IUDs all the years I used them. I react horribly to hormonal BC.", "mimilovesmojito": "My preferred birth control is none, so me and Usher Raymond can pop out 1 million beautiful brown babies. But until then, my preferred birth control method is the pill cuz I don't want to be stuck with hella babies when Usher comes calling.", "_noelleon": "@shanboody can we talk about your copper IUD? I got one a couple ears after having my son and literally have a 10 day period. BUT I’m still thankful for this option because I can’t use bc with hormones. Are their multiple types of copper IUDs?", "leabouchard89": "Copper IUD", "ydivadior": "I have unfortunately had the worse experience with all birth control since the age of 18 now 35. My body rejected the hormones and every side effect you could imagine I experienced (headaches, acne, weight gain bleeding etc). Even with the patch it ate through my skin so bad I still have scars on my body from it. When I was in my mid 20s I was very excited about the copper IUD because for the first time I was able to have birth-control that did not have hormones. Unfortunately my body rejected it after the first insertion. They had to then put it back in via ultrasound. That is when the horror begin. I would bleed so bad on my periods that I would have to wear both tampons and pads at the same time and change hourly. I unfortunately even bled through my bridesmaid dress at my best friends wedding (horrified) because of the excessive bleeding. The day I took that out of my body was the happiest day of my life. I just wanted control back over my body. After that I remained abstinent for years. Now I track my cycle and ovulation with Natural Cycles which has worked extremely well for me. And I am 6 years free of BC 🙌🏾", "tdodart": "Beautiful 💙", "just__darlene": "Nexplanon! Although my period is soo unregulated and it last for up to two weeks and half🤦🏽‍♀️ its a great birthcontrol method☺️. I did some research on the IUD and i read that it can accidentally move from place. Also, can your partner feel it when having sex?", "ashlinkston": "Thank god I have the implanon 💕 so easy and effortless", "keke.loves.orange.soda": "Thanks to the pill for regulating my horrendous cycle", "mimbirose": "I’ve been thinking about the copper IUD for months now, I was on the pill for 14 years and been of it now for 7 months!!! Go me! Let me tell you it hasn’t been easy. Talk about pimples and mood swings 🤣🥺 and “party hats” the good old mood killer 😩. Thanks for this post sister, I’ll look a little further into it ❤️", "elisha.esc": "@jxryd217 we need to start this", "blamelos": "Pulling out 🤷🏽‍♂️😂", "elbeautyblogdeeli": "Some answers really worry me", "iamtaylorsavage": "I also use the copper iud (Paraguard) @shanboody and I love it, I recommend it to anybody who hates hornones and forgets to use or take the birth control!", "eyedahfineme": "I use @naturalcycles ! I stopped taking the pill a year ago (after being on it for 5 years). Coming off it mashed up my body. Horrible acne and highly irregular periods 😩 Finally after a year my body is somewhat normal again", "jess_marie1027": "I have been on the pill since I want to say 2010. I love it I don't have pms symptoms (no cramps, hardly any bloating, etc.) I know when my cycle is coming and how long it is going to last and I like having that kind of control and understanding of my body. I was on the patch for about a year 2008-2009 and it was painful to remove and the fact you couldn't put it in the same spot twice sucked too. I still have a little white spot on my right booty cheek where the patch tore off the top layer of skin smh lol", "mizz_v357": "Merena (non copper IUD) if it wasn't for this I would definitely be on #5", "delightfull__dee": "I think BC messes with the natural hormonal processes of the body which then impact overall health in the short term and long term. condom use 100%", "theshonalovechild": "Condoms! Coz hormonal birth control drives me nuts and my body can’t do the IUD", "s.rozie_": "I’ve been on birth control literally since I was about 16 or 17 after I lost my virginity. I started on the pill and was faithful to it until I had to stop in 2014 going into the army and not having it during basic training. I have a three year old daughter who I love, but I jumped back on the pill two weeks postpartum in 2015. Now I have the Mirena going on a year and I love it! #thxbirthcontrol", "1inamilliondre": "🙌🏽 IUD it’s been the best Birth Control method 6 years in the bag 💯 another 5 to go 😂🙌🏼", "milenacucu": "Three of my female friends had horrible reactions (fever, inflamed uterus) to the copper iud so that two had to have emergency removal surgeries and the other one has incredibly.strong bleeding every month. I am scared of the metal IUDs but I am looking into the hormonal IUD", "lady_rhaenys": "Just had my first born two weeks ago. Me and the Husband both agreed that for now our family was perfect the way it is now. And I decided to get the Rod. So far love it. The pill made me go crazy so didn't want to go with that again. 👏👏👏 Atleast we have 5-6year's to decide if we want to expand our little fambam. Oooor take it out sooner. But for now our family is perfect the way it is.", "sheisblessed_": "mine is not having sex with men 😊", "jaytea___": "Been on the Nuvaring since I was fifteen due to heavy periods + nausea, fevers, etc.. still on it today, literally picked up my refill today lol. Honestly a life saver.", "pammcakez": "IUD!!! ❤️", "ellollova": "Been using the pull out method for years. Tried nuvaring for a little while gained a bunch of weight and said, nah. 🤣", "_allimaniac": "I’m all about that patch, bout that patch, no babies 😌", "alyson_h_": "IUD all day", "kinged_me_mcpherson": "Lesbianism for now! 🤣🤣🤣 But, my wife and I will find a donor when we are ready 😉 @shanboody", "penbadger": "But also I have my tubes tied. So liberating.", "thefoxymoxxie": "I’m thankful everyday for mine🤗💕", "daisiesandflowers0325": "I have the same copper IUD! ❤️😘😍", "princessfluffs": "Thankful for my BC cause my cramps were fucking hooooorrible. Heavy periods are a thing of the past. Depo has me covered. Im saving money on pads and all that. Literal blessing 💕", "bryanaalyse": "I use 🔥💜PARAGARD💜🔥", "kiannabanks": "BC has not been kind to me and my body lol but it works great for my friends they have the implant Nexplanon", "amandabowler": "Having gay sex", "djmastertrej": "I have the Nexplanon implant. I am thankful for my birth control because it allows me to live life on my terms and without the anxiety of potential unwanted pregnancy. ❤", "greenteanicole": "I started on the shot, decided it wasn't for me so I'm now on the pill and so far so good. Thanks birth control!", "corischerer": "🙌🏽🙌🏽🙌🏽", "carlingjacksonart\nVerified": "Verified", "ndnadia9": "Normal birth control pill. It regulates my period and let me have sex a lot without worrying getting pregnant. Well.. that's the old days. Now I'm pill free. If you're not planning to have kids and very active, you should take it.", "terremup_": "Yes thanks birth control! Making both women and mens sex lives better every day 🙏🏾", "shanice_shanelle": "I don't believe in it, but I'm glad it's available to women who need it!🤗", "pelafinahlivre": "I have an IUD that causes me to get constant infections but I don’t get pregnant", "lovechatwithnat": "Cycle tracking and condoms.", "baddictedtomakeup": "Pill popper😂👌👌", "polyam_life": "This is 🔥", "enid_drthy": "IUD all the way🙌🙌🙌🙌 It did shift my period though. I came from 6 days to 3 days. Should have started this stuff at 12yrs", "msmulatto79": "I am a married woman of 18 years but I use birth control for regulations of my menstrual cycle. I prefer the Xulane patch. I only have to think of it once a week to switch it out and the leave it off on the 4th week to have a cycle.", "gingerfoot": "@shanboody endometriosis awareness is so lacking in the black community @tiamowry", "franziska_kioka": "Stopped taking the pill because of the side effects after 2 years. I used to be sick all the time and get bad headaches. Due to not enough research I took the pill without thinking that hormones are literally controlling my whole body mentally and physically. Thanks to listening to my body and finally doing my research, lead me to see a good doctor and I decided to stop.", "dominique_latriece": "I love the pill.", "lisardurden": "I would never use an IUD but I don’t have a problem with women who choose to.", "alyssa4169": "I also have a copper IUD I love it", "kristendoziershields": "cycle tracking & rhythm method/condoms", "lifeofdianand": "I only have 2 kids, instead of 20. The more kids you have, increases the odds of one of them sucking so bad, they drain all the joy out of your life. Thanks to control I have a great life. On the down side, if my mom had access to birth control, I wouldn't be here to write this shit.", "building_.bridges": "OrthoEvra patch! I love it!", "alpha_lalo": "But I do understand your point tho just giving my opinion", "nmyiyka": "Currently using BC to control a growth and pain from Endometriosis. #thankyoubirthcontrol", "ohyesmaxine": "I had the Mirena IUD for 5 years and I loved it! Getting it back in since I just had my baby.", "lavenderamethyzt": "Honestly pop pills progesterone only pills work best for me and I don’t mind taking my pill every morning like my vitamins", "radicalxismosa": "I wish there were more options. They all work in a similar way and have horrible side effects. It really sucks because with the process of trying to find the right one, people go through soooo much. I’m glad there are different options and that they’re generally accessible. Unfortunately I got pregnant twice using two different methods (correctly). According to my doctor, birth control just doesn’t work with my body 🤷‍♀️ Condoms combined with Natural Family Planning it is. ✨", "monsterville": "I also have the paraguard for the last 6 years", "_nerelllyy": "Zero birth control over here 🙅🏽‍♀️ I used to be on the pill, then the bar in your arm, and after getting off, I noticed how anxious they’d made me, and how different I felt. I thought it was the right thing to do at the time, but I’m so happy I’m birth control free!", "emilynov": "Love my hormonal IUD! It was personally the best thing I can do for my body, after being on birth control pills for years. 💖", "_vivalamonster": "THANKA BORTH CONTROL cause I haven’t had a scare in years ok, no better feeling than not worrying 😭🙌🏽", "nianichole": "Thankful for my birth control for allowing me to be in control, have lighter periods and clearer skin!", "shannenigans___": "I use the ortho Evra patch that looks like a small Bandaid and would only have to remember to change it once a week", "sammie_tho": "Thankful to my nexplanon for making my periods much more bearable❤️", "browelegance__lexi": "@beautiful____sin", "inthewordsofme": "Love my OCPs", "whynotwellness": "FAM because the pill shuts down all hormone production and you can’t ovulate so it effects fertility. The copper IUD can cause metal toxicity. Tracking your cycle is the best and most natural way.", "aprilately": "Copper IUD", "mutterknowsbest": "Absolutely love my IUD. It allows my partner and I to have sex the way we want to without me having to stress about the pill or an unplanned pregnancy. It's also helping me keep my bits Trump administration free! I made my appointment the morning after election night and went with Marina, which is good for 5 years. #thxbirthcontrol !!", "theebebe": "Thankful for my IUD. We’re going on 3 years strong & I have zero complications or complaints. 🙌🏽", "miisssimone": "I love my Copper IUD", "princesskyla": "I’ve been using Nuvaring for at 8 or 9 years.", "originaldavidjackson": "🤙🏾🤙🏾🤙🏾🙌🏾🙌🏾🙌🏾", "stclu": "Also using copper IUD! my body doesn't cope well with extra hormones.", "cortneydaniellemoore": "Copper IUD for the win!", "mouthpeace_": "i hope it is", "crysrcharles": "I use the pill, more for period regulation than birth control, but win-win", "bodybynae": "Cycle tracking... birth control and messing w my hormones is a hard NO for me!!", "sharanichole1": "Nothing currently.. My husband and I decided that i would come off of the patch bcus of side effects but maybe one day il go on another form of BC", "sweeneyytodd": "Ohh I wanna know more about the copper IUD!! I have the regular one. I love birth control!!", "hotthangcandles": "Having sex with my wife 👭😂", "agnesjoker": "I was on the pill for 10 years until I found out it increases the likeliness of me getting a stroke since I suffer from great migraines. No one ever told me that lol then my doctor insisted that I quit immediately and suggested the mirena IUD. The reason why I started the pill to begin with is bc I get very bad cramps and had to skip work for the first 2 days every time. Now the iud.. it was the most traumatizing experience of my adulthood. I can’t explain how bad it was. I took strong painkillers before going to the doctor as suggested still had incredible pain when it was put up. The following day I remember waking up and try to get out of bed to take a shower.. I literally crawled to the shower and then passed out from pain. My mom had to come and pick me up from the floor and dry me off and put my pjs on and feed me. I couldn’t move at all. I got it last day of April and got it removed second week of October. All throughout the time I had it I had days where I couldn’t move my legs from pain, I was constantly in bad mood and it took little as nothing to get me upset. I’m very active and I used to run track and now I dance but thru this whole time I couldn’t do any workout activities, even small stuff like walking up stairs could trigger pain that lasted for hrs. Not to mention the horrible acne I got from it. Maybe I had such a bad experience bc my body is sensitive to cramps idk but it was not fun at all 😔 recently I invested in the Daysy that’s gonna help me keep track of my cycle. Sorry for a long comment lol Love from Iceland 🇮🇸", "bubzkutiie": "Mirena IUD, best decision I’ve made regarding birth control.", "tellmewhyty": "I'm thankful that I had birth control when I was young, dumb, and irresponsible. But I'm good now love, enjoy. ✌🏽😂", "gabwithgwen": "Mirena IUD. The first few months are rough. But, it's totally worth it!", "hotgyaldanny": "What is the best non-invasive/least invasive method? (DO NOT say pull out or cycle tracking please) I am new to this sex life and want birth control for sure. I do not want kids. At all. (Fear of pregnancy and motherhood)", "optionalsoup": "Birth control pills, easy to obtain free with that sweet sweet Canadian health care (free prescriptions under 25) and they actually make me feel better", "laydilex": "Xulane", "jamie__hahn": "The patch!", "happylilkenzie": "Thankful for the combination pill stopping my paralyzing period pains. From 11-13 I would miss school and vomit and cry and couldn’t move. Then at 13 I got put on the pill. Now I’m an adult so it’s great for other reasons too", "saras.lane": "IUD ALL THW WAY! I got the Mirena back in 2012 and the Lyletta which is now approved for 6 years last year. I have been a huge proponent of the IUD since I got my first one. I love answering any question I can about my experience and always encourage women to talk to their doctors about the procedure, process, and what it might be like for them. It’s been amazing for me but obviously everybody and every body is very different!", "creshhhh": "Just got my BC removed (nexplanon). Never felt better", "anaia_j": "I use the Mirena IUD and have had it for a year and half now And honestly its great. I never get my period anymore which is great cuz I don’t have to buy pads/tampons anymore!", "topaz_faerie": "I've been on the pill since I was 16. I tried the depo shot, but I had severe mood swings and no sex drive. So back to the pill I went lol. I love the pill the best thus far. 💚🌻", "sbestbeauty": "The more kids the merrier", "itstamarshabihhh": "I have #PCOS and told at the age of 17, I’d never have kids... but thanks to the pill I was able to have three healthy baby’s!!! Without the pill I wouldn’t have them!", "laureenhd": "Patch!", "whoisbre.a": "I was told that the IUD sometimes can move out of place during sexual activity . What could you do to prevent that ?", "_linauris": "Copper IUD since I was 17! Never had any issues. THANKS to my health teacher for sharing the info with me. Honestly the most mature and best decision I’ve ever made.", "b.randallofficial": "I’m currently not on birth control but NuvaRing was the best control I ever had. It worked on my timing and I had no side effects! 🙌🏽", "ikbenlauren": "A vasectomy.", "nik_valsp85": "Implanon (in Aus) and I absolutely love it. I hardly had any side effects, just some light bleeding for 12 day intervals. It's stopped now, and I get very minimal spotting every now and then. Plus it's super fun to poke the rod in your arm.", "allisoncoal": "Mirena IUD 💖", "dyferent1": "I’ve had Explanon for 3 rounds....8 years in January and it’s a BLESSING.", "officialjasminek": "The Depo Shot. I have tried soooooo many other methods since I was 15 (28 now) and this one has been absolutely amazing for me. Been on it for 4 year now.", "tfairmanxo": "Abstinence 🤷🏾‍♀️", "feephifofum": "Mirena IUD! 💖", "tirsatalks": "its so unknown but im using the @caya_usa , its a diaphragm. yay to non hormonal birth control!! 🙌🏾", "owibbia": "@shanboody you left out space in your tag for @bedsider :)! And I’m going on 6 months with mirena IUD, there have been ups and downs but the pros far outweigh the cons for me. Hoping most of the neg. side effects subside around my one year mark and I can feel comfortable keeping this thing inside for another six years!", "tmeysenburg": "Vasectomy FTW!!! (Lots of the pill and condoms before that.)", "miss_ragland": "The shot has work best for me for over a year", "contractor_kasey_888": "Having sex with women😁😁😁", "littleslash2": "Implant in my arm its beautiful thing being able not to worry abt my birth control 🌻", "teamaldred": "A husband with a vasectomy! I realize this isn't an option for all but it's been awesome for us 💕", "jibblyghibli": "Continuous cycle birth control pills for endometriosis because my uterus is literally trying to kill me! Lmaoo", "blissfulsperspective": "Pull out and cycle tracking. The most natural way 🔥", "justsayjackiee": "I’m about to get nexplanon for the 3rd time. Love it. ❤️", "vironikasays": "I have mixed feelings about birth control because of all the side effects they have.....my bff of 10 yrs finally removed her IUD because she’s trying for baby #3 and I’m extremely happy that it’s out and I get a break from worrying about her health. I used the depo shot and that was he beginning of my health issues...I then tried a low dose of the pill and it only added to my health issues. I just think it should be illegal to market a sell anything that has side effects!!! They have to do women better and when they think they’ve done even just a little better, do better again and again when it comes to manufacturing a safer birth control💕 #unapologetic 🙋🏼‍♀️", "chargernation818": "Thank u birth control for letting me go in raw 😂😂😂", "moe_lovely_": "I have the IUD and I LOVE IT!!!!", "justadirtbag_": "\"Condoms\"", "jennypcarmona": "thankful for my birth control cuz it made me thicccc & cleared my skin 😭😭😭❤️❤️❤️", "whitneyeclectic": "I started out with the patch, tried the shot but get the best results with the pill. 😎 #thxbirthcontrol", "mahealanij": "Lesbianism", "monicathomas3792": "IUD also", "_xo.nicky": "Copper IUD! 🙌", "kamenyrose": "Being with a woman @vani_bear18", "sunr9y": "I use @daysyfertilitytracker", "beautty_queenn_": "IUD", "ashlanee": "I have been using the patch! I love love love it", "delphidrew": "Abstinence", "thej_alexandra": "I no longer use birth control. I really didn’t like the way any of the made me feel especially the IUD. I had sever back pain and pain in the uterus it was painful at time.", "lvk.en": "Copper IUD as well!!", "rica_mcd": "Being gay is my favorite birth control method", "yisseldar": "Copper IUD!!! ⚓️", "hyyerrsteffie": "I used to use the pill for a long time and had always been trying to figure out a better way to not fill my body with hormones but I didn’t really want to use condoms with my fiancé so I kept taking the pill. My friend then got a tumor in her liver because of the pill and I finally decided that was it, there must be another way. Now I basically do what people do when they wanna get pregnant but instead of having sex during that time, I don’t or I use a condom. I check my temperature every morning and track my period in order to track my ovulation. You only ovulate one day a month and sperm can live inside of you for 5 day’s therefore 6 day’s a month you can get pregnant. (So because I am still working on figuring out my ovulation I abstain from sex or use a condom for about a week and a half) works for me and no pregnancy and no hormones 🙌🏼", "franya.nohemy": "Copper IUD for life bc I cannot do hormonal birth control 💗 I love it so much", "erez1ja": "My favorite method is gayness. 🏳️‍🌈", "carmens_pov": "Thanks birth control because lord know I probably be pregnant again and next year I'd have 3 under 3 and 0 screws left", "jessicalaurene": "Pulling Out. Lol", "sararoses89": "Cycle Tracking. I’m intensely sensitive to artificial hormones and get every rare side effect you’ve ever heard plus the ones you didn’t know existed. I’m talking full body hives, anxiety attacks, weight gain you name it. The depo shot caused me to lose my period entirely for over a year and a half after I stopped taking it. The only thing I have never tried it is but I’m honestly terrified to put anything else in my body. I love that you are talking about this and making sure people know how many different options they have. 💜🙌🏼🙏🏼", "btowntobito": "Celibacy 😂", "tiana2haute": "i heard and read so many mixed reviews with the Copper IUD. what do you like about it most?", "fun_in_onesies": "The one in my arm. I love it.", "kandizzle2495": "I've been using nexplanon for the last 4 years! I love it so much ✊🏽", "hybridhanna": "I use condoms I put the burden on my husband making him get a snip soon too! I refuse to mess with my hormones for anyone 🤷🏽‍♀️❤️", "smithgina7": "My tubes are tied!!!!! The best", "beencouragedapparel": "Please share your experience with the copper IUD.", "prettyoddsammy": "IMPLANT LIFEEEE", "princess_sucubuss": "If you like rough sex the iud isn’t for you...js", "ratchetconsciousness": "Condoms. But I wanna try that fertility tracking thingy a couple mentioned on your YouTube vid", "ashleyemond": "Thankful for my birth control pill for allowing me to to decide when it was right to start a family. Probably going for an IUD after this pregnancy.", "infinite_energy01": "I've tried the hormonal arm implant, the copper IUD, the pill, and the mini pill. all have such horrible such effects I'm afraid it is the pull out method for me 😆", "naledinova": "I’ve been using nexplanon (hormonal arm implant) and I love it!!! No babies for at least another 2.5 years 😌😌😌✨!!! And no period♥️", "justcrissyd": "Mirena IUD - love it!!", "just_stephanie___": "None", "weezywtf": "Honestly, the rhythm method.", "chloecontemplates": "NFP/FAM 💁🏾‍♀️", "kaayricaaa": "Nexplanon 💗 so far so good!!", "maryquintieri": "IUD!", "imperfectlyperfectcurls": "IUD 🙌🏼 the best ✨", "allbodieshealth\nVerified": "Verified", "color_mysoul": "For the ladies who have or are using the IUD was your partner able to feel it at all? If so what did u do about it? Thank u!!!", "theculturedqween": "was on mirena for 10 years ...... thankful for it but now cycle is all messed up but hey", "notperfectbutwell": "Love my hormonal IUD 🙌🏼🙌🏼🙌🏼", "mialearned": "I'm on the copper iud and have been for a year. I hate it. I was getting the depo shot, but I got pregnant while on it. So #thxbirthcontrol for only one child in almost 30 years 😂😂 She'll be 9 in February. I'm going to go back to an arm implant after we have our second child. SN: I tried to go to the tagged profile, but I think it's got extra letters added.", "laughsmilehello": "Currently on NuvaRing", "mrz_brwnskin": "I’m using mirena second time around ... used birth control pills before but it made my blood pressure high i have no complaints so far ☺️", "taliii_b": "Nuva ring ✨", "bfirst_apparel205": "Add this strength convention! View our insta bio AS soon as possible", "seayedub_": "Shoutout to the copper IUD 🙌🏾", "dianicia": "IUD 💕", "tallasianchick": "MIRENA IUD, BABY!!! 💕💕💕", "emmmm_c": "I wanna love this post ten million times !!", "livthelionesss": "@naturalcycles is the best!!🙏🏾😍", "shamelessjas13": "I use kylena a hormonal IUD I’m on my second one", "littlegeri": "Nuvaring❤️❤️❤️❤️", "mama.llamalexi": "I’ve FINALLY just got birth control today, 9 months after my daughters birth (I’ve been struggling to get it since my 6 week pp checkup). I went with the depo shot bc I want another kid again in 2 years. I honestly just wish they made BC for men because I personally do not like how it affects my body 😫 but happy Birth control day!!", "im_so_curly": "I love my copper IUD", "lecolt69": "Where can I get one of those shirts @shanboody", "iamroguetl": "Abstinence", "brianamarietv": "I’ve only had the one in my arm. I’ve never tried the pill because I was afraid I’d forget to take it. Everyone I know who was or is on the pill has at least one baby because they forgot to take it lol", "bri.mac19_": "Mirena (IUD) 💕", "alecia_antoinette": "So you DID go with the Copper? Yup, it’s second best to Condoms. Those hormones not everyone can manage. I was one of them 😩😂", "cheicom": "Was on the pill for my acne in my early teenage years. Was a God send honestly. Now im on the condom/pullout method with my bf and its all good ☺️", "lasoulfulvan": "Loved the video!", "chantelley.lace_": "I’m on depo, but I sure do miss the pill. Did you have any adverse effects from the copper IUD? Any pains from insertion? since doctors are hesitant to recommend to women who haven’t had children yet", "mia.corren": "Mini pill", "missin215": "Depo.... no more estrogen for me😩😩. Lol I miss estrogen", "selfie.slave": "I’ve had paraguard now for a little over a year. It seems to be working the best of what I had tried so far", "toospicccyyyy": "I use the depo provera shot. Its really convenient and you only need to get it done every 3 months. It stops your periods over time and it stops major symptoms of your period. A plus is that it protects you from pregnancy. Although it's not guaranteed. I have tried multiple birth controls starting from the pill all the way to the nexplanon. And the depo has to be my favorite.", "bedsider": "Yay!! Thanks for sharing the love ❤️ your video is amazing!! 😘😘😘", "slaybaebaex": "Currently on the Mirena (IUD) as well and I love it.", "bakersmind": "IUD! liletta", "kayleen10": "@laladden"}