{"theperfectrunaways": "Facts", "calinita5": "@oscar___rs me this week", "melanin.goddess": "Me the past week 😩", "leeyamakesnoise": "I mean...might be speaking out of place because I Haven’t seen the full video but if it’s the wedding that’s stressing you out- aka the production and of the wedding- have you asked yourself why and if you actually need one? Who will it ultimately be for? And is the idea that one potentially expensive day worth the stress it’s putting on your relationship? Like I wouldn’t be surprised if y’all just eloped in the same way y’all just made that amazing music video on your own!!", "kell_left": "Literally me every single day. Wow", "the_cro_mj": "❤️", "noahdcjohnson": "Check your dm pleaseeeeeeeee I need your help pronto", "shanieedepp": "Focus on love!", "__soul_o_living__": "You inspire me.", "chauntaepink": "I cannnnnn❤️😂😭", "novel_sensa": "@sycha7 refined ambition 👌🏽", "1luv4lif3": "Yes can definitely relate to those feelings.....you got this!! Love what you do but it is also okay to let yourself feel those feelings . Much love always @shanboody", "bethanycamille_": "Short, shoulder length curls with bangs would suit you! 💕", "mnreece": "I can't relate!", "born_intheknow": "I felt this to my core. I’m shook right now. Let me recollect myself. Thank you for the transparency ❤️", "goddessin_themaking": "I have a million clips of myself Just. Like. That....!!! It gets real sometimes. We need your voice, keep going!", "iamqueeniej": "Typical Guyanese superwoman 🇬🇾", "mdjcubanita": "Shannon where is this video?! I can’t find it. Got me over here all intrigued and shit. lol", "intuitive_miss": "Right!", "miss_goldilocks": "Still have that same feeling every time I make a new Vlog. Somehow I get it done. But at that moment no one talk to me or look at me😂😂🤣", "opalellyse": "!!!!!!!! My whole 2018!!!! 😂😂😂🙌🏽🙏🏽✨✨", "voluptuous_highness": "Love love love", "itsradiobiz": "Planning a wedding can be extremely stressful..", "_suga_": "If this ain’t me in a nutshell with my Cancer sun, Pieces moon self smh but we can do it!! 💪🏽", "chooch9669": "😍😍😍😍😍😍", "perkigiver": "When you're the star and the stage parent!", "jayonuh100": "😍😍😍😍😍", "god_is_theplug": "💪🏾💪🏾💪🏾 you got this mamas let it out we can relate @shanboody 🤗🤗😂❤️😘👑", "nafiysh_vianuchi": "Yes you can 😍👌🏾", "lucindaanderson": "After my panic attack this morning of all the shit I need to do, this is it I needed this.", "djlixxer": "😩😩💔❣️", "che.che.luna": "👋🏽👋🏽👋🏽", "maudekwd": "I'm having a rough time myself and I find meditation so helpful. It helps put things into perspective and force yourself to pause and breathe. I highly recommand it to you in such stressful times.", "adriiboo_": ":(", "beingtash": "This is me literally right bow", "kalekalip": "Stay the course 💪🏾", "kera_mone": "Me too Shannon. Me too.", "chantellemenothing": "A constant mood. 😩", "lovenevrfailss": "If this isn’t inspiration in it’s true form I don’t know what is", "mimainwonderland": "Ugh. You’re so beautiful.", "miriama.ariana": "Felt this on a spiritual level", "d.iane.u": "🙋🏾‍♀️", "okaraimani": "Actually footage of me, howd you do that?..lmao 😂😫😭", "blackgirlsaregod": "I love you so much 💓 watching your come up has been amazing, I'm 21 and you inspire me to dream big love u girl keep yo head up💓💓💓", "_s.h.a.n.n.o.n._": "\"Yes you can, and you f*cking will!\" is my new favorite motivational quote. ❤️", "chanelkitchen": "Yess! Let's Continue to Fight and be strong", "jadejanelle": "FACTS! 😔✊🏾", "king___vi": "Yeah,... no completely opposite", "youbettaglowgirl": "Basically me today. But I did it 🙌🏾", "devrivelazquez": "exact same", "noni_rene": "I can relate. Thank you for being transparent! I appreciate your strength as bravery 💜💜💜", "nessers_90xo": "I can relate I cried last night and this morning. I love you Shan💕🙌🏽", "iheartcandra": "🔥ME AF", "gmill4504": "Awww.... Gorgeous @shanboody", "snowbythebundles": "Yesssss! Im constantly talking to my self. Giving myself pep talks every moment of the day", "txmaaaade": "this 😩😂", "bruce.j._ransone": "Yup! Every time I step in front of that canvas to paint I say...\"I can't do it...my talent is gone\"! And I mean every time!😢", "natthefitceo": "I loooooove this!", "jayadoray": "ALL OF LIFE! @missmikks", "imranmani448": "Cuteeeeeeeeeeeee", "melissafullwood": "🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️🙋🏽‍♀️", "jla_in_nyc": "So relatable...to the outside world I had everything going right this year (and admittedly amazing things did happen)...I started an MBA program at a prestigious ivy league school, fully sponsored by my company and while working, I got married to the love of my life...yet I've had more of these moments than I care to admit. Happy you shared your vulnerable moments...we all need a good cry every now and then", "eriolle.nichole": "Deep breaths.", "jbmn.lolasmith.lmt": "@msdeidre04", "lavidayg": "Your continued transparency is my favorite part of your brand. Thank you✊🏿. (And same)", "purple_is_my_passsion": "Damn i felt that 😭", "autumnjoy007": "Love this so much!!", "bigjules63": "Your feelings are on edge about the Wedding coming up. Question? Will he grow up to your standards or what? I say do but it turns out to be shit BAIL.. I've seen these things happen. Go with the advice you give others. 🙏", "sapphrodtie": "Me literally yesterday going to work", "lisethxdlc": "Fcking same!", "lacysfiles": "Proud of you, love you ❤️😘🙏🏾", "andranotsandra": "Yup", "vyb3__": "💯", "nyshajohnson": "@rishma_petraglia 💕😘", "juan_ada95": "Me everyday right now to be honest", "keishacharmaine": "Me everyday", "msdangergalore": "SAAAAAAAAAAAAAAAAAME and I want to sleep.", "aiss.world": "Hugs and love Shannon 💕✨", "notfromaroundhereeh": "I hope we get to a place as society where we stop rewarding endless exhausting work, and instead reward self are and authenticity so the quality all goes up- of life and of work.", "laurennicolefk": "Relatable!!!!! This has been me all year. Pushing through to create content, and having to remind myself, you can do it. Despite wanting to roll up into a ball😅😅😅😅", "miaskudrinjaa": "Me when I sit down to study for Finals 😰😰😰😰😰😂😂", "penbadger": "100% relatable. Thank you for sharing. It’s so easy to think we are the only ones feeling a certain way. Or ALL the ways simultaneously. Lol 😩😘", "unjadedjewelry": "🤗🤗🤗", "eg_canary": "I think we can all relate to this moment to a T. Plus, you have a lot on your plate. We still love you.", "brylikestrees": "Oh my gosh yes. Pretty much every single day.", "oliveyou_olivia": "I love you so much 💕", "divine_nature_neka_": "Yea, that’s about right 😢 ❤️", "jomama78": "i can totally relate!! Especially this morning 😞", "chanpoiuyoi": "I love how you're so honest about your emotions", "_kellette_": "Literally same ,you’re so cute lol", "lifeofdianand": "We all have jobs, except for the unemployed who would probably empathize with you if they had jobs. Now I'm sad for them.", "reesiebabe": "Yuppp", "davendegwa": "You got this Shan! But I feel you 😢❤️", "momswearheels\nVerified": "Verified", "isplit2live": "Everyday I wake up to go to work. 🤷🏾‍♀️ Thanks for showing us it’s not always easy. 😩", "imconduit": "Wow", "0h_thomas": "This is me all the time when I turn on my camera", "brittanyvgreen": "I love a woman who can keep it real 💁🏾‍♀️", "writergypsywolf": "❤️❤️", "gemini_mich": "You CAN, and you WILL, Sis 👊👊👊 take time...", "venustierraa": "You inspire me so much! Plz never give up. You CAN do it! And you WILL! We are all connected, I know how you feel. Sending love your way!", "sherrickayvette": "Hell yeah", "karlynpercil": "🔥🔥🔥Yup! Talking myself INTO my dreams DAILY! 👏🏾👏🏾👏🏾💪🏾💪🏾💪🏾 @shanboody", "isaiah_315": "Girl this summarizes my whole semester right now lol! But you got it this!!!", "dora_wachira": "🙋🏾‍♀️🙋🏾‍♀️🙋🏾‍♀️😞", "jnaeelizabeth": "Ah! I can totally relate 😫 WE GOT THIS", "graciefaerie": "I can relate fucking one hundred fold 💕✨", "withneyyyyy": "HELLO!!! Apart of your choir sis! Felt this!!!", "strictlyshanice": "Yes, very relatable 😩", "thetayraperezproject": "My thoughts and feelings to the Teeeeeee!", "imcriss": "100 fucking percent relatable. Girl get it done! 😘", "briefcase_rafe": "Hey beautiful", "ashlifresh": "\"Yes you can...and YOU FUCKING WILL\" 🙌🙌🙌🙌", "sunnismilez": "I love you🌻🌻🌻 you got this 🌻", "imani.berrios": "I Can relate so much. i’m always battling my inner thoughts & emotions! @shanboody our mental health is something most people (*including myself*) don’t always make our # 1 priority; because we feel obligated to put the people & things we care about first. i’m learning that sometimes it is ok to take a step back & just breath! I love you & your amazing brain & i’m so happy for you success, keep doing you girl, & don’t forget to take a break sometimes!💜", "cicimoya": "Stunning..... *past two months 😝", "lannagene": "My life in 5 seconds", "peeaaa": "You’re so beautiful! And this is totally accurate to my life the past month.", "thapoliticalpoet": "👏🏽👏🏽 So grateful you showed this.. I wanted to give up 5 times toward the end of the semester I was so done with going to school full time and doing overtime at work just to turn around and and try and have a social life. In the end I got paid enough for a week off during Christmas and still have money for bills As well as and Bs// it will pay off 10 fold. Promise.", "september_bleu": "😂 change two months to the last twelve for me. 💯", "kay.renee.w": "yessss! Put it on a shirt!", "syncerelychelsea": "❤️", "iamessnce": "Gorg😍", "zarthamoon": "😂❤️ Facts!", "asheraarmour": "🙌🏼🙌🏼🙌🏼", "kristenlive": "All the time!", "caelibrannon": "Yesss thanks for posting! Me the last two weeks! ✨✨", "leahgrantart": "Ayyyeee! #facts", "amberscloset\nVerified": "Verified", "kennedyrue": "You’re so so so awesome Shan Boody. You can do ANYTHING.", "meggles1820": "🤘🏽🔥🔥✨👏🏽👏🏽 @saraax3 @adri_glo @jaclynmonet @becauseima_panda @shananigans22", "daniellerobay\nVerified": "Verified", "giankaspatricia": "Mom will be there soon and it will all go away. ❤️", "shelleyhamilton": "This is me daily!!", "donderzak": "BAWSE!", "panaminded": "Better days will come to ya. Try to stick anyway.", "adiasinead": "Wow who put a camera in my apartment???", "theblklts": "Hahahha facts", "model_citizensb": "Sometimes you just gotta encourage yourself!! 😂😂", "shandn.e": "Yes i hella believe in you, love u 🙏🏼", "justrashidah": "Me. Right now.", "brezzybri10": "Hahahah I watched that like 3 times that it was a retake lmao 😆", "peejay_esthetics": "I love this girl!!!!", "normalight18": "💓💓😍", "billiebob5520": "Everyday!", "rebeccacorrinne": "I love it💕", "chrisssmichelle": "We love and admire you. And this is so relatable.", "natafernanda": "Looooool so accurate wow", "sisithelyricist": "Here for the sweats💕", "very.carrie7": "Oh my god. Me too.", "myrimirmir": "**hug**", "moemonimo": "Soooo true👽❤️", "itskaytaylor": "Whewww the accuracy", "meiganalicia": "Facts of life!", "joey_too_smooth": "You got it shan!", "nellavibes": "💪🏾✨💕", "brittanytylerrr": "Oh my god.. I FELT THIS", "melaboricua": "Yes yes yes. I started a PhD program in August and it’s been the most challenging academic pursuit of my life. The past 2 weeks was finals week and at the end of it I was highly considering quitting. ESP because I didn’t do well on one of them. We got to give ourselves credit for what what we’ve already accomplished and the space to say we aren’t perfect and still working on things. I swear the pressure I put on myself and my negativity is the biggest detriment to my success at times, anyway love you @shanboody we are all in this struggle together thanks for sharing.", "klumseykatie": "Actual life mood recently", "being.ayo.dele": "OMG! Yes", "kendriadates": "YES YES YES!!", "fernguully": "Hella inspiring to know even women who have their shit together sometimes don’t have it together.", "thekeyznyc": "yo the crying face and then “i can’t do this, but you will” WOW felt this on a spiritual level tbhhhh", "lovelinaaa": "Parenting ..... @shalakaf", "brandonmbolton": "This is me every morning 😂", "big_bold_lovely": "💏💏💏 love you gurl", "fashonvega": "Hope you’re better today than yesterday... I’m here if you need to yell or rant", "sosojaded": "🙌🏾 So raw, so real", "carabearrrrr": "You are so amazing!", "la_erikita": "💕 ✨ 💕", "sydneeleu": "Me lol", "natnicstew": "❤️👏🏾!!!!!!!!!!!!!!", "pariah2society": "Mood tho x", "acinstawilliams2580": "I can relate", "ro_bin_claire": "RELATING", "prodigy_chef": "Man I wanna hug you it’s not right but it’s ok", "makeup_yari": "@lins_vanwag me !!!!! 🤦‍♀️🤦‍♀️😂", "kimcupcakes": "❤️❤️❤️😢", "cydnewashington": "“Yes you can, and you f___ing will.” 😂", "jazzmynejay\nVerified": "Verified", "gq.mj": "Got this @shanboody ✊🏾", "yungcaramella": "my whole last semester in college 😭", "ms.sylla": "Story of my life", "nicolerosanwo": "👏🏾😂", "nanokrystalline": "U know what I love 💕 about you @shanboody you don’t give a F what ppl thinks about you. You just be yourself and it’s take or leave it. And I love that.", "transformationofself": "@shanboody Sounds like me right about now 😘", "ynotkeeb": "RELATE!!!!!", "jjofata": "The struggle girl 🤣🤣😂🙏", "drikadoesdis": "Wow! Me everyday. This resonates with me so much. Ugh the battle of the inner self", "outofashion": "Spot freaking on.", "km_carlton": "The astrological cycle has been kickin the collectives ASS, I cried a lil watching this. But we fucking WILL!", "geminicoquette": "Oh I can definitely related. That’s me right now. And! I was just procrastinating by getting on Ig and saw this post. It was a sign.. 😂 getting back on track now. 🎥", "clearfit360": "Aye! You are an inspiration no matter how long you take to get ready or how many breaks you need remember your soul comes first! 💜", "_m0onch1ld_": "The last two months has been intense, but I can honestly say I finally feel a shift happening. Stay strong and keep pressing through! 🤗✨", "thefeminineenigma": "This whole year honestly 😂😂", "gabi_luvsu": "You can do anything you put your mind to Shan", "mjsosassy": "soo me! my inner trill always tells the debbie downer to get her shit together 🤣❤️", "chivonjohn": "An entire mood", "angieofficiallyinthecity": "Yup....🤣❤️", "hellotanda": "So relatable ~ positive vibes 💕💫", "ophilia.xo": "Me too!!!! It’s so nice to see people i look up to are just as human as i am.", "edwardistheman": "I can look at your beautiful eyes all day long @shanboody", "iamzetamorrison": "Wow. The fact that I aspire to acquire a lot of the traits I feel you have and you feel this way at times is so reassuring. Thanks for sharing. You’re a star Shannon 💫", "itgirltyi": "Honestly, truly... “Yes you CAN & you fucking WILL” I felt that.", "meganjoymay": "Lolllll 💎😂😂😂 so. Freakin. Relatable. 🔥😭. Yes you can and you fucking will!! I FEEL YOU!", "lorealrising": "I say this daily 😂 yes you can and you fucking will!!", "badformchanel": "This has honestly been my ending of 2018!", "keyonna.renea": "😩🙋🏽‍♀️ lawd I can relate", "wemetatacme\nVerified": "Verified", "borgaty": "😍 I love u", "isnjama": "It’s okay love. You got this.", "zoealexondra": "literally me every time i try to record", "laddiesymone": "Giiiiil 🙌🏾❤️😂so me", "adrianjermayne": "I love this. It’s video poetry. Sometimes you gotta adjust your focus but never loose sight of the reality. #EXECPTIONAL", "theivyvega": "Me during essays, midterm, and finals", "breejustbree": "Yes.... lord....I might have to repost your post cause this has been my full mood for a while now too. ❤️❤️❤️❤️❤️❤️", "_hiddenbeauty22": "I can relate 😩", "adore.marie_": "Everyday!!", "pierson_williams": "Sending positive vibes your way", "kayloreen": "Urhggggg yes👏🏻👏🏻👏🏻👏🏻", "jaimialexander": "Girl! I can relate. I literally JUST told myself this 🤦🏾‍♀️ it’s time to move, I need to get events and content done and I’m just......not.....ready LOL", "whyhifly": "♥️♥️♥️", "flores_delalma": "Love❤ 💕LOVE LOVE ❤️💕 Yess you can and you will GIVE YOURSELF A HUG", "trey5fanpage": "It's a phase love, you will get out of it. Trust, rest, reflect.", "therealmarktaylor7": "❤️", "a_adrian_mcrae_d": "Sending a huge hug your way 🤗 ❤️", "ivy_t_white": "Yes", "kalievans": "Yesssssss💪🏼💪🏼💪🏼💪🏼💪🏼", "weezywtf": "Aw bby. Happens sometimes when I go in the studio, having all that good energy to give people is sooooo exhausting!! Hang in there ❤️", "xirinavaleria": "Same girl🔥❤️❤️ you look fire🔥🔥", "ksospicy": "Your the baddest bitch 🤷🏻‍♀️🥰", "abbyogunpolu": "❤️", "__chelsb": "Bruh. @c_rossyourheart @nicole.en.fleurs", "kirstie.b_": "And you will!!! Love you girl!! You got this!! ♥️", "beenietv": "All week. Sending you love ShanBooBoo", "tisworthit92": "Lol super accurate. But it's all work needed to be put in, so...we will survive. Even if we die trying 😂♥️", "truth.over.facts": "I’m in this space right now", "nagy_juliana": "Yessssssss girl", "sharleenthevocalalchemist": "HAA! Yeeesss girl! This is basically me behind the scenes some days. Sending you so much love!", "melaniefiona\nVerified": "Verified", "krissyperfect10": "Every morning for the 9-5 I have to go to 🥴", "_mcdeez_": "Anyone who can share their BTS + vulnerability is an instant legend in my books ... thank you, lady! You + everything you do are so needed", "aliciaacewest": "A mood 😩", "njkitzke": "❤️❤️❤️❤️", "miritesfazion": "Ughhhh so real. Been my whole mood lately. 👏🏾💙", "thatsarria": "Hang in there sis! You got this!!😩🙏🏾🙏🏾", "al_catpacino": "I hope you get to take a little break soon!", "romancebymyoshi": "FUCK YES SISTER!!!!!! Yes yes yes", "bri.a_symone": "Me me me !! 😭🙋🏽‍♀️", "uzu.sixaba": "❤️❤️❤️💖", "territv": "I love how transparent you are about your feelings!!! I CAN RELATE! 😘", "marinbeans": "Yes you can, and you fucking will", "elmundodeleny": "🤣😩💪🏽👏🏽", "michelllleeeyyyy": "🙋🏼‍♀️🙌🏼🙋🏼‍♀️🙌🏼💛", "trilljill4thrill": "So good! So me 😩🙏🏾"}