{"_yeshichoden": "🙌♥️", "jaclynfromjupiter": "I cannot tell you how much I needed to hear this today. It has touched me/hit me like nothing else that’s ever been said to me. Thank you so much for posting this and for your wisdom.", "williemack_productions": "@alleey__katt", "diamondkut_fitness": "@shanboody ... wow. Just wow. So much I can say to you but no point. You hit it right on the head. 🔥🔥🔥🙏🏾💪🏾", "noura.elx": "I needed this, you inspire me ❤️🙌🏼", "in8nina": "Wish I had heard this so much earlier. I’m moving forward now, but maybe I could’ve lit the fire earlier if I had heard this then. Thankful for this wisdom @shanboody 💕", "briefcase_rafe": "😁😀", "zakithitwala": "😭 I needed to hear this. Thank You. God Bless You", "soulsurfinn": "You’re like a mum I wish to have in another life.. I love my mum!! You get what I mean😩😆😍♥️♥️", "heyhollyjay": "@thesearchforpink love shannonnn", "polinagee": "@pamelafacey", "akatherealflash": "Baby.. you a dime. ❤️🔥", "ashleelagasse": "Doing nothing seems like it would be easy but it’s the hardest! Wow that hit me hard. Thank you. 🙏", "rarespliff": "‼️‼️‼️‼️‼️", "nyariangchieng": "Daily watch! Thank you SO much for this @shanboody this video keeps me going, good days & bad days. Bless you 🙏🏿❤️✨", "megan_hart7": "♥️♥️♥️♥️♥️♥️♥️", "kylakupid": "@amycleekart 😭😭😭😭😭😭😭", "rudemeg": "@lauraahetherington", "cchriscoast": "W H O A!!🙏🏼", "elidahlida": "I appreciate you so so much. I watch this every time I feel myself slacking or putting things off and It’s working Shan. It’s all coming together. Thank you 🙏🏼", "divine_ghaddess": "Oh wow, I completely relate to this. I say 2017-2019 has been my lost years I even stopped celebrating my birthday. I can this period “Dark night of the soul.” I have made a conscious decision to actually start living again, and celebrating life as the true version of myself always had.", "lunakomunyai": "@nal_sowazzz", "badassa_michelle": "What’s this video called? I can’t seemed to find it in your channel @shanboody", "diamondashlee": "I’m out of ideas sad to say", "shanterrialmusic": "🙌🏾🙌🏾🙌🏾🙌🏾 I needed this", "forhigherknowledge": "I can definitely relate to this on a deep level and the fact that my lost years were also 2010-2014 and even 2015. I discovered so many undesirable things about myself that were difficult to accept. It took some time but I'm definitely in a much better place in my life and still determined to continue my journey of self-improvement ❤ Your videos are very inspiring and I love how empathetic and open you are to other people's life experiences no matter how dark. 😘", "dreamchasen247": "No CAP", "vive_licious": "I've always considered 2008- 2016 my lost files. It's interesting because I never heard somebody else utilize the same terminology to describe the same exact feelings that I experienced during that time. Working it out now🙌", "deeznegus": "@peyton_toypoodle #Beth", "sleepru973": "Thank you i needed to hear this message I 💯% agree 🤘🏾", "wendehhh": "@alexan_ong hmm", "behatishoppes": "Excellent post I love it❤️", "sangeetabhella": "@karenfiddes @jimmirandhawa", "tylercasual": "Appreciate chu", "growth_pr": "🙌🏾🙌🏾🙌🏾", "tyonnab": "This is... 🙌🏽", "bhumi17829": "Wow rllY needed this bfr my new semester starts 🤧🌱", "morales_429": "This is everything I needed! I will play this once a day", "mwhippy.nmc": "l love what you've just shared cause every now and than you need abit of pushing to develop the real you thats supposed to be", "lovingthislifejada": "@lashco", "ccs_photoshoots": "Check out my page, photography skills in my pics of queens such as this 😝", "foodiesworld___": "Woow 😍 ! Come to my page you’ll love it @worldwidebeauty_____ 🌍🌸", "michellebbatista": "@helloitszury", "go_qna": "🙄 Wow. Srsly? Wow... Aha. <f_nk this 💩/💮 !'m out theme song> by the way (my way out of this such proffesional cosilly prepared profile) nice eyeshadow pallete.", "bodiibiicorii": "Truth spoken", "nobahle_s": "@roxyjay13", "curlybe_": "Touched 🙏🏽", "amillionminds": "This message has been delivered to me at the right damn time. Cause girl.. tahhhh. I've really been feeling it.", "lizatheadventure": "Thank you so much for this. Your rawness and vulnerability surrounding this extremely difficult topic of growth had helped so much. I’ve been struggling and you’ve managed to say with precise articulation and authenticity how I’ve been feeling. This is why I follow you Shannon. You a real one. Thank you for showing there’s hope after the stagnancy.🙏🏽👏🏽", "_shaq_w": "@mindsetofrich @1rezide", "xtina_nina": "@dijanaib ❤️❤️❤️❤️", "voluptuous_highness": "So so so amazing", "x_morningstar": "Bruh i don't know how you choose those words. But that was beautiful. I needed to hear that 😭", "jessvaas": "@r3maggot", "lin.jayy": "@jaymesonte @lalapalozza__ @queenb0518 @callme_tagg", "harmony_fikky": "It's more like you're talking about me... You've really inspired me a lot. Thanks @shanboody", "peoplewithstylee": "Thank yu!", "nick6ondz": "#$ let me get yours 🤑", "julietpapaws41s": "This wise woman", "chrisssmichelle": "😭😩 oh god. It burns. The truth buuuurns. Aaaaalll facts", "yogabaeee": "💗", "intvlt": "Have you heard of @sexeducation coming out in netflix soon?? 🧡🧡", "jasmineasuarez": "Love it ❤️", "gen_kaur": "AMAZING 👏🏻👏🏻👏🏻 @shanboody", "mysteriie": "😢😭😭😭😭😭😭", "olaabisi_": "@rashella15 @chandeboni @trulyblessed21_", "nerisaali": "@itstabish", "daniielleeeeeeee": "🙌🙏there is a reason I found you this year❤I needed this encouragement as I jump into the unknown and embrace the changes✨", "itsvincenguyen": "I’m literally going through a situation like this, and then I miraculously find you on ig out of nowhere. Thanks for sharing your story, and letting me hear that I’m not alone in what I feel right now.", "catmansouri": "Beautiful inside and out", "juanortiz4498": "Thank you so much for your message", "the.annecdote": "I needed to hear this @shanboody!! Here’s to a more successful and abundant 2019!!! 🙌🙌 I’m a long time follower. I always look forward to your posts. As a fellow Canadian I’m so happy to witness your successes.", "jadahmarley": "I’m in that position right now 😢 purposeless", "laticiamichelle": "@sweetcandyapplered @itsriababywatchumean @liyahcharms_", "ecclectika": "This reminds me of the Regina Spektor song, \"Animal\". Particularly the lines \"taking steps is easy, standing still is hard\".", "denisegonzalezz": "@ myself", "natznoah": "@Liz elle_arendse", "feven.k": "\"You're gonna have to do that shit eventually anyways\" Amen to that sis! 🙏", "ki.m.kk": "@shanboody I love your youtube channel the content is always so informative.", "thandiemagwaza": "@5age_", "barelyberry": "Yup! 🙋🏽‍♀️", "tdodart": "💚💚💚💚", "itsblessingg": "@promisedaniella", "goldn_charmr": "👏🏾👏🏾👏🏾👏🏾", "rese_love_kaiden3": "I needed to hear that 😭😭", "ci_danso": "@whotfisjuliaa ❤️🙏🏽", "jamiedanielle__": "Thank you for this", "monika.m.megan": "So inspiring and real, thank you for that💜", "shotbyjanell": "All I can say is wow.. Could you maybe do a full video like this on you YouTube Channel and maybe talk about your story of how you got to where you are now from where you started?", "abckatxyz": "thissss💖", "kolourpalette": "Thank you", "goldenkait01": "🙌🙏👏👏❤️❤️", "cheshirkat7": "Thank you for posting this! I needed to hear this, and I’m sure I’m not the only one.", "shelortiz": "👏👏👏👏👏 thank u", "_quigo": "Needed this one, thanks 👌🏽", "martha__lucia": "Thank you @shanboody 🙌🏽 This is true for me & im ready to do something different. 💪🏽", "lifeofwins": "Question: What were some of the biggest challenges has a Canadian moving to America?", "valiyah": "Love this 🙏😘❤️", "shopuntamedflowers": "Damn", "callynnlynell": "Always preaching to me 😩😭🙌🏾 I keep watching this, ha! I won’t be losing any more of my time! Eventually is NOW! ❤️❤️❤️ Thanks Shannon!", "lanilikescandy": "@djbrettb 🗣", "kurlystance": "❤", "ciarravaloroso": "@laurynhollyk I love her so much", "mauriciaandrea": "Thank you 🌟", "sugarskullz141": "How do you make yourself a stronger person when you're so used to tearing yourself down", "david.makwaira": "Whenever I feel hopeless I'm going to refer back to this video. Thank you", "in_my_lifeetime": "@simple_lanae", "kushkittyyy_": "This 💖 @mysteryintheuniverse", "shekel.jalipa": "@keshwa.naidu", "thekevingarcia": "A word!", "litevanilla": "Amen sister🙌", "gar.funk.el": "i really needed to hear this. Thank you 💕💕", "gendernonconforming": "Needed this ✊🙌 happy new year 🎊🎆🎈", "chantellemarcuss": "This is so power, and very much what I needed. Where's the full video?", "paigeloveleigh": "@mayacameron_", "sedi2_": "@logein_el_sebaay y did I watch this", "jj_xo_17": "Needed this ❤️", "lala.clark": "❤️", "dryewong": "Thank you for sharing!❤️", "_mardez": "To being fearless and doing what makes us happy in 2019 @mavi_fl @amaly058 💕", "brittinay": "2011-2014 was also my wtf stage", "savannah_j18": "🙏🏽", "leti.raeh": "Shannon!!! I feel like you were talking directly to me! Everything you said has described my life for the past 5 years! And I am ready for a change. A scary but much needed change, thank you 🙏🏽", "bosslaydee8787": "❤️", "luse_touf563": "I'm petrified of my real ambitions and worst don't know how to start🎊😂😂😂", "jazjillette": "Thanks Shan!", "1realitalian": "💯❤️🙏🏽🌟 Relatable 💯💯", "kmmccaffrey": "Yeeeeeessssssssss😭🙌❤️", "theregoeslola": "Miss Shan coming with the sermon", "gabifaye": "YAS love you Shan 🔥", "sherrined": "🙌🏾👏🏾👏🏾👏🏾👏🏾🙋🏾‍♀️", "candyamor__": "Wow thank u!👏🏾👏🏾", "katieelovely": "If @katyhearnfit was mixed I swear this is how she’d look! So beautiful! 😍", "allthingsvikki": "All of it was necessary to get you here. I'm proud of you @shanboody ❤️❤️❤️", "itsbibifam": "@jlattimore_", "mizrii1021": "Thank you! I really needed this. I been afraid to try again but i know i need to change. Pray for me things will go somewhat well. 🙏🏾", "mindthemedic": "Took this personally... thanks Shan", "bobbybedford": "I’m so glad you made this 🙏🏾❤️ I really needed to hear this so my inner self can wake tf up!!", "zenobia.simmons": "Happy New Year and hell yes making the hard choices always puts you back in control of any situation. Because even if your choices don't look that good at least you're made a decision. If you don't like your options change that shit!", "so__lauren": "@nataliemason___ @beingjelisa @queenjesi89 @v_coleman", "taraerae": "I really needed to hear this. Thank you.", "cileojewel": "Big facts!", "cosbykiddd": "I needed to hear this thank you🙏", "laydee_west": "I'm not even sure how many more times I could watch this video. I watched and listened deeper and deeper every single time. I watched it so much that tears started streaming from my eyes. I wish there was some way for me to save this video and have it play as my morning alarm. We ALL know how spectacular you are, but thanks for sharing your loving, newlywed energy with us all. 💞💞💞", "gbreal1971": "Thank you @shanboody. I don’t know you but it’s been a joy to watch your evolution. Congratulations on adding marriage to your list of accomplishments. Happy New Year 🎆", "die.ni.might": "Giiiiirrrll preach!!!", "d_ray_lyn": "Well said Shan!! Wishing u nothing but the very best in 2019!!! Keep shining!!😘🎉💕", "christianconfidential": "❤️❤️❤️❤️", "mc_saw23": "Many Blessings. I needed to hear this!!", "scaredpencil": "Thank you for making this💚", "charlotte_doe_": "Yes", "tiffanyhomie": "@eye_m.erika", "ambernicole___x3": "BUT WHAT HAPPENS WHEN I ( CUUUURL ) UP IN A BALL N STAY DER ?????? HMMM . . . . . . :-)", "lilobama": "Last com.e t", "butterfllyyymusee_92": "Absolutely needed THIS!!! Thank you!❤️", "therealmrsransome": "💖💖💖 thank you", "lebokutyofficial": "❤️❤️❤️❤️❤️", "jordanfiction": "Without a fucking doubt. @priscilamusic thank you for sharing.", "kileybohatka": "Thank you.", "charitytimberlake": "So much beauty", "tokyoparisz": "🙌🏼", "vianola": "Wow, need that. Thanks", "katherinecauchy27": "@ebonu.jpg I proud of where you have gotten so far but have this as a reminder that I believe you can do anything you set your mind to happy new year xx", "aquamoonbxtch": "🙏🏽🙏🏽❤️❤️❤️", "afrodevaun": "🎆🎊🎉👏👏👏", "_ohgoddess": "Good grief . This spoke volumes to me , especially on a day like today . Thank you Shannon for being genuine , relatable and very inspiring . I’ve followed you for years and watched you show your transparency , authenticity and growth. Year after year . I feel fortunate to have you as role model for not only ,myself but for the generation in the making . Listening to this message and feeling just as you described , making decisions in my mind, this is what i needed to hear , I was meant to be here to hear you say these exact words . 🥂 to No excuses 2019, for me ❤️!", "simoneiwood": "Girl I needed that! Happy new year 🎉", "dajanese_music": "I can so relate to this!✨", "bippityboppitybeat": "@quitabonita_", "hadisonmernandez": "Fucking love this", "k.lanni": "💙💙", "violetsimonofficial": "❤️❤️", "itsjessthelaw": "I needed to hear this. Thank you Shannon!", "thepreciousnicolette": "Thank you for this! Needed to hear it, queen! 🙏🏾❤😍", "natestar_": "Amen! Very well said", "cosmiccindy": "Wow. @saint.triste", "theboxxcombo": "@taniatoxxic", "vina_ayche": "Thank you.", "cleona_divine": "Wow thank you for this message! I love you & Congratulations on the wedding and happy new year in advance 🙌🏾✨💚", "britchung": "🙏🏾🙏🏾🙏🏾", "eri_len": "This resonated deeply with me. Thank you for this inspiring message.", "dopefreshlife": "Whewwww!!", "kalekalip": "There are years that ask questions and year that answer - Zora Neale Hurston. You’re in your answer years! Big up yuhself, Shannon! 🙌🏾", "jamarimichael": "“You’re here because you have allowed other people to tell you your potential.” Truth 💣 🙌🏾", "mauraswanick": "NEEDED THIS THANK YOU", "smithette89": "@jwaaad", "lynstargirl": "Needed this 🙏🏽", "darlene_sterling": "This is reaallllll good. 🗣 I would say 2010 - 2018 were my lost years. I moved to NYC and life became REAL. I mean really real and I blinked and didn’t even know that that much time had passed. I recently move to LA to reset and making sure I am aware of my days and making sure not to expect my happiness in the future but try to create it now.", "alongcameb": "☀️", "anitsej": "@nano_boogie_", "ecall3nd3r": "@nyccallendergirl", "mstatilee": "Wow I have a similar experience I went from 2015 being the worse year of my life with having brain surgery, then depression, and also spent some time being homeless. Now 2018 has been the best of my life thus far. I’ve got to do a lot of modeling, acting and advocating as a women of color with a disability which led to me winning the Christoper reeves acting scholarship last month to advice my career as a disabled performer. This Hollywood life is rough but I’m thriving and I really feel that rock bottom 2015 was just what I needed to prepare me for what came in 2018 and what’s to come in 2019 congrats on your marriage btw you guys are a beautiful couple", "_nyikia_": "Damn Shannon! Get out of my head! 😂 This is legit the same I feel EVERY DAMN YEAR. 2016, 2017 and 2018 were terribly hard years for me. Emotionally, physically and mentally. And as I write this, I'm currently recovering from a major surgery that has scared me since I found out I needed since September. So much so that my depression and anxiety came back with a vengeance and I went back to therapy for help. I went to believe that 2019 will be better. But deep down I don't. I hate to say it but I feel like it's going to be a continuation of the past three years. Seeing this video has given me a little bit of hopeful spark that wasn't there before. I will continue to watch it over and over until I fully absorb the message, believe the message, feel the message and know the message. Thank you. 💜 P.S. Your wedding photos were amazing. Beautiful day for two beautiful spirts.", "_____robynn": "💎🙌🏽 Preach !!!!", "gregoryallencompany": "Love this god bless 🙏🏾🙏🏾🙏🏾🙏🏾", "meetmyriam": "❤️❤️❤️❤️🙌🏽", "alanaoutdoors": "Dude you’re actually an angel on earth. So much wisdom and light in you girl! Keep doing you. ❤️", "leahgrantart": "I'm proud of your journey. There is hope for us all.", "zantiofficial": "Yes Shan THANK YOU !❤️", "mokisses143": "I love you shan. You need to do a meet and greet in Toronto. Like honestly ! 2019 I wanna see you!! ❤️❤️", "adalyn1.0": "👏🏽👏🏽👏🏽", "anetarobikotleta": "@marta_pelc", "skooooobs": "Tony Robbins who???", "healing_gemzz": "This resonates so much", "theblklts": "🙌🏽", "diyenb": "@princess_k_diana", "skyetownsend": "You look perfect", "shan_jbain": "Def needed to hear this...", "strictlyshanice": "Watching you grow has been amazing. Thank you for sharing this video & being so vulnerable! 🙌🏾👏🏾❤️", "brookewrite": "✨❤️", "mahogneyhope": "Thank you for this message ❤️", "killaaaa23": "Thanks Shannon I needed this 💕", "199jix": "Thank you", "nextlevelshay": "Damnnn! Hard truth!! Thanks 🙏🏽", "ohheyronnie": "❤️❤️❤️❤️😍", "bellebecky": "Preach🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾💕", "coolmamos": "@mrrd_pls", "itsjaidesworld": "I needed this especially having a rough few years and feeling that no matter what I do things will always be the same. I’m slowly realizing that I have so much more potential than I thought and that I can manifest my ideal lifestyle, thank you love and congratulations on getting married 💗💗", "livewithanita": "WWHOOOOOOOO WEEEEEEEE PREACH the TRUTH 🎤Drop. 💯", "callmegabbzzss": "@camera_edge I think this is good for you to hear ❤️", "tabiacharles": "You couldn't have said this any better!!! Love you Shanahan!", "b.nicole2": "@aka.lex", "powerofkay": "I love you so muuuuuch", "missmilah": "Needed to hear this!", "sunii.santeria": "I just love you 😩♥️", "macknificentone_": "Needed to see/hear this 🙌", "lightskinlori": "@disla @edwin_disla @blos27 @chrisxnito @otr335", "lexangeles": "@bizness_first23", "xlifeofkai": "This made me cry. You are my inspiration 😭", "anaislene__": "💛 this was needed!", "xoxo_stina": "A fucking word 👏🏽", "stizzieink": "Lost years.. I relate. Most of the past ten years I've given to others and not myself. I put the needs of those around me first and prioritized myself where I could fit it in. This really hit me deep. Because I've been feeling stuck under water for a minute and I just want to BREATHE.. thank you for this and for always sharing your vulnerability. I pray 2019 will be everything we push for and make it to be. 🙏🏾❤", "brand.nerdnco": "Whew this is a word. Permission to repost?", "carmen.ferry": "💛 Thank you"}