{"van.hales": "😘🤔", "callmecristo": "✊🏿", "natal8997": "The way you look in that dress❤️❤️❤️❤️❤️❤️", "slashax": "Gorgeous you guys look beautiful ♥️", "traumadoll6999": "U should’ve married me instead", "qiarma": "😭 This is so lovely", "miss_mischieviass": "Even if she didnt have any indian background she appreciates the culture. As long as she when she does it she understands the history and the meaning of the cultural value it brings I believe it's fine.", "salma_hamdun23": "I think there is a difference between cultural appropriation and appreciation,even if she’s not Indian that’s cultural appreciation", "jessmarie.d": "In my POV it’s not cultural appropriation if it’s being used as something a person is wearing. A lehenga doesn’t have ceremonial or sacred representation, and I am white and love to wear Indian clothes to formal events. They make me feel beautiful and goddess-like. If you are trying to imitate someone in a disrespectful way, that is an issue but she’s not doing that, so it’s a moot point to try and attack her for wearing a gorgeous outfit for her wedding.", "superjojojetplane": "I loveeee that you wore Indian wear. Girl you a 'dougla' and you have the most Indo Caribbean surname...Boodram ...so you can damn well where this. You make Indo Caribbean brown girls like myself quite happy to see see dressed like this ❤️🇹🇹🔥", "nasiir_90": "You're mixed with Indian so no it wasn't cultural appropriation... idiots need to understand that Google is just a click away.", "5920808ss": "You look beautiful. I just watched your YouTube video. I’m also mixed and I hate people telling me what I am. When I get married I want to wear traditional Burmese attire to honour my father’s side but because I don’t ‘look’ asian I’d probably get shit for it. But hey I will still do it, if the day comes, it’s my and my partner’s day to share with my family and loved ones and they will appreciate it and those are the only opinions I’ll care about ✌🏽", "aravind_raghunathan": "Nope, i’m indian and i loved your outfit.", "tubbkin": "It’s not cultural appropriation if it’s your culture 😂", "astridmcm": "😍😍😍", "sunaiinaa": "I wish you guys all the happiness in the world 🔸", "quynhceited": "@karunarai17 i like this color scheme", "hibernatebunny": "You looked stunning in that and bonus for you to be embracing your roots. Where I’m from, we pride ourselves in sharing culture and tradition of other ethnicity. We are even sometimes expected to wear other ethnicity’s traditional attire to be culturally appropriate for the occasion (we do this all the time).", "thapasrishti": "It looks so bomb. And its really precious when people choose to adapt from cultures for their special day. ♥️", "flashybeans": "@jesscarrolltv stfu wit ya white ass", "shivani_konda": "As an Indian who lived in the actual country for most of my life FUCK NO. Your dress(outfit) was/is beautiful and it's just clothes go for it!!!", "fahreenzie": "@nessamorton", "margauxmargherita": "How can this be cultural appropriation? You’re part Indian!! You look amazing on that dress btw ✨👌🏻", "dr.emoception": "This isn't cultural appropriation. Even if you weren't related to India in anyway, it's cultural appreciation. We Indian people love when non-Indian people choose to wear our traditional dresses. All these people criticising are surely not Indian or are non residential Indians. You looked beautiful in that Lehnga. <3", "ki.arahh": "Nah ya dress beautiful and you look gorgeous", "anniej": "Watched your YouTube video and want to say you are so eloquent! I think your wedding dress is a celebration of your heritage, and it means something to you - so go for it. I’m not mixed race but still relate to the feeling of not quite belonging. People in India think I’m too American and people here think I’m super Indian, so I often get comments like “what’s your REAL name? Where are you REALLY from? Your English is really good, you don’t even have an accent!” Sending you love and wishing you well in this new stage of your life ❤️", "sanikki_pandora": "You look beautiful. Caribbean people will always have to explain themselves or not! People never try to learn about others, instead look at you and immediately pre-judge not knowing the real person. They immediately look at a white person and say no he or she is not Caribbean until that person starts speaking. The same goes for Indians, Chinese etc. Guess what, the Caribbean is a mixture of so many cultures. People should stop pre-judging.", "gir318": "Absolutely gorgeous", "hgnisydnar": "This ain’t it chief", "stephparrott": "This photo popped up in my “Explore” feed and when I saw it, I thought 1. She looks beautiful and 2. I didn’t know she was Indian. Never once did it cross my mind to think she was appropriating someone’s culture. Ignorance on the Internet knows no limits. She handled this situation with so much elegance because I would have CLOCKED! Who is anyone else to say she’s not “Indian” enough to wear this dress? The nerve🙄😡", "rihah": "My family is from Guyana as well!! I explored the idea of identity formation for my thesis 3 years ago photographing myself wearing traditional Indian bridal jewelry (my great-grandfather is from Gujarat). Check out the series fshah.format.com/prefix. Continue to share your culture and your experience as a biracial person! Sending lots of love from Toronto! 🇨🇦", "ll_banante_ll": "Nice photo, if u want to see my photos go to my ig check them out, would appreciate if you supported me and push that follow button @ll_banante_ll", "nu_bee4": "Ooooh that last picture she looks just like @love.carrington 😀", "scripnic.veronica": "You are the most beautiful. 💕 I am Veronica and I am a designer and photographer, I can help you edit your professional photos. Come on!", "therealzameena.ali": "As an Indian Guyanese you are part of us so you are APPRECIATED ❤ ignore negativity on the Internet", "1phatbaby": "Guyana has Indio- Caribbean Afro- Caribbean Latin- Caribbean people and cultures, etc. For anyone to claim cultural appropriation is pure ignorance.", "jignishaa": "@shanboody No you wear what you feel like and dress in whatever makes you feel like a princess on your big day. The dress is absolutely beautiful 👌🏽👌🏽...", "sourpatchbaby85": "Here from YouTube so glad you were in my recommendations😍... Congratulations👑", "judi.jpeg": "If you respect and honor the culture it is not, and typically it’s appropriate if you are from the majority culture using minorities’ culture for some kind of gain. So unless you benefited from it in anyway monetarily then it would be but I think you’re straight because you’re brown and it was a wedding not just a photo shoot you look great btw!!!", "adventures.with.carissa": "Mom and I are watching your YouTube video and You look absolutely Incredible!!! I love your wedding dress. Haters are gonna hate because they lack education. My mom grew up learning about Culture Appreciation and that’s how teaches me. It’s called Culture Appreciation NOT Culture Appropriation—the Haters just need to spell check their hearts! Lol 😂", "itszdash": "I LOVE this. I’m living for this. You look beautiful, and you do you boo.", "sensuallyme": "Those saying it’s cultural appreciation are just ignorant 🤷🏽‍♀️🤦🏽‍♀️", "denisemurray2007": "😍", "killin_crazy": "👏😍😍😍👏👏👏❤️🙌", "aba_kh": "In your case it’s about why you chose it & what it meant to you as someone who has Indian heritage along with several other cultures to choose from. If it meant nothing but style, then that’s not right, but if it held a deeper significance, why not 🤷🏽‍♀️", "salinasidhu": "💜💜💜", "tlatriece": "I’m Black and Syrian and I don’t feel offended 🤷🏽‍♀️ do you sis 😍 you look gorgeous", "raij2": "@shanboody cultural appropriation where 🙄🤷🏽‍♀️ you looked stunning and did you. For all the people stating this is inappropriate and “stealing” I’d kindly remind them of the following; ‘Cultural appropriation, also known as cultural misappropriation, is the adoption of elements of a minority culture by members of a dominant culture and these elements are used outside of their original cultural context—sometimes even against the expressly stated wishes of members of the originating culture.’ Indian wedding dress - worn at a wedding 😱 Shan = Mixed ancestry (Which includes Indian heritage) 😱 In summary you’re a badass blessed mixed woman who owned her heritage and looked amazing doing it 😎👌🏾", "briana.carela": "The Internet will run with anything!!! You can’t appropriate your own culture! Let this girl live!", "shines_withrp": "You looked stunning in it ! And you decided to go with something you wanted and it was apart of your heritage ! There’s no need for you to go back and redo this moment cause you did it for yourself and your loved ones ! Good job for making the video because people need to learn and be educated about these things and how not to judge something without knowing the full story !", "tanya_ess": "Your video was super interesting and brave of you to unpack! Personally, I think appropriation is harmful when a person is benefiting or receiving privilege from a culture without recognizing the oppression that same culture may have faced. Or when things completely loose their context - like the commodification of yoga. You’ve inherited so many cultures to be proud of and as a person of colour, you can understanding the lack of equality that still exists. I don’t think that you were appropriating at all, but rather celebrating Indian culture (which is rich and beautiful!)", "embracenreborns": "👀💗👍", "anyaadev": "If you are Indian, its not. But it would be nice to embrace that culture as well as the outfit. Culture is not something you can choose to embrace just for superficial reasons. Thats taking advantage. I'm Indian and not very traditional or religious at all, but I definitely identify as Indian everyday, even when it's not advantageous to me.", "mariam__nicole": "@duhjelika", "hetal88": "Even if you weren't indian you have the right to wear what you want to wear! Anyone with a problem with this need to look in the mirror and see what they are currently wearing! You look Ace👌 keep doing you💕", "ramshakhan5623": "Love your outfit you nailed it in every way and form love from 🇮🇳🇮🇳🇮🇳 I am not offended by it u should be able to carry the outfit you are wearing that's all that really matters ❤️❤️", "salaminakauapa": "@hiriaxo", "shoshanna_wah": "Not culturally appropriation if your are part of that culture which you stated plainly in your YouTube video. Dress looks beautiful on you! Congratulations on getting married.", "sharmamehak07": "I am an Indian, and most Indians feel really proud when people appreciate their culture. You wore it on ur special day.. to me its appreciation. Also you wore something designed by an Indian designer. So don't worry abt all the nonsense. You looked lovely.", "mc_taughtme": "In this video you had on the CUTEST earrings, where'd you get them from?", "jemimmacarina": "You cant appropriate your own culture but maybe you should probably embrace that part of you more often and not just on your wedding day.", "lrya_photography_": "🤗🤗🤗🤗beautiful...ur wedding is all about u an ur partner...as long a u loved it then that's all that matters!!! Congrats❤️", "neiryjacob": "tell em", "love_mercy_justice": "👑🙌✨❤💎", "x_zariababbyyy": "OMG ❤️❤️❤️❤️", "sdesilvaa": "You’re half brown.... obvi you’re going to wear traditional clothing wtf", "lesbest": "Just watched this. You are amazing. Always addressed with such class.", "weardoe": "I don't think you have been disrespectful in repping these clothes so in my opinion not inappropriate. If you were mocking it that is different. People just seem to get offended these days with no real reason. This is 100% not offensive, infact I think its a huge compliment that you look and probably felt like a Goddess. That is exactly how to feel in those clothes ☝🏽💓", "tam_oo_gram": "Gorgeous !", "mlca1234": "Your wedding and your memories, no one has the right to judge it", "honeyhaad": "Wedding ? @money.mumu", "chillaxgummies": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "ruthsutoye": "Nope 💜💜💜", "the_ashley_phillips": "Love the dress!❤️", "zombina_mina": "I can’t believe it was even an issue. You look beautiful. Congratulations on your big day 💖💖💖", "heykayk": "@esthernyania my wedding day", "paintingwithunicorns": "@_elisexox this is gonna be us too and I'm already so ready to fight people", "mies_store": "🔥", "mar_dinh": "you are soooooo beautiful 😩💖", "randy.od": "You are partly Indian so it's not cultural appropriation BUT I am wondering why you are wearing a white sari for the wedding. Why not the traditional red? White is typically for funerals.", "hamidhmd1367": "Hello, welcome to visit my page Thank you", "tica_the_realtor": "Cultural appropriation would be if you had criticized that particular fashion, then later took credit for it. The dress is beautiful. Great choice", "curtygram": "This popped up on my explorer page and I was like Awww this looks like Shan and boom. It ‘twas! 😂😂😂", "_oyiinkan": "I love the dress", "ggotcha21": "I’m Indian and you look absolutely amazing in that lehenga. Absolutely breathtaking! I didn’t know that you were part Indian. But anytime I see someone that doesn’t seem of my culture, wear or like aspects of my culture I feel proud. If someone is disrespectful to any culture that’d be a problem. But this is definitely not cultural appropriation.", "brooklynthebrooke": "Ya but u looked nice", "trin.na.tee": "You’re so prettyyyy😍", "neilam30": "You look amazing 👸", "thegreat___": "#4THECULTURE 👑❤️👑", "dezmuh": "❤️❤️❤️", "purpleslash": "come check out my clothing line🔥🙌🔥", "eileen.liliaa": "I say cultural appreciation 😍", "truetalks__": "❤ If you want 2 stayy cool And want too get real truth Stay on this page 👉Do follow @truetalks__ Becoz u want get positive nature in your life...u hav too make time for urself👍", "fiori_taylor_cruz": "Perfect match", "semaa.ke": "@38ismaill", "anoipuaisland": "Congrats and Many blessing cuz queen and king @shanboody and @enjoyjaredbrady", "chyna.myee": "😍😍😍 Beautiful ❤❤", "instagramless_bebe": "Nope. Congrats btw!", "verna_jean": "I don’t even know how I came across this post but your wedding outfit was so striking. I viewed your video about the issue and I was gobsmacked. I can’t believe people were being so negative. I couldn’t care less if there was no Indian background/heritage, you looked beautiful and for such a sacred event, you chose a beautiful outfit that made YOU happy. There was no lack of respect. I’m an Australian-born, Fijian Indian and I can’t speak Hindi, don’t cook Indian food and get judged the same way. Can’t win regardless. I incorporated Indian elements in my church wedding and I know it was criticised but you know what, it doesn’t matter, exactly for the reasons you mentioned in your video. Don’t let anyone dim your light. They obviously have nothing better to do and what they are doing serves no purpose.", "naomizerai": "@merontemesgen har dom gift sig?", "drtiffanietv": "You look beautiful, my love. Congrats and blessings. Xoxo", "topboymag": "Oh my god‼️ you guys got married already. Congrats!!! U guys are an inspiration", "polamzi29": "stop what you're doing and follow @cataleya.us", "keshmoneymakeup": "Nooo you looked stunning! More like cultural appreciation!", "mamaquise": "@shanboody I think you chose the perfect dress for your day and that's ALL that matters. Peace and fulfillment to you and yours.👑", "jaybaby1401": "Gorgeous!!!❤️💖👑👏😍", "flyingfortwo": "No, I don’t think it should be up for a big discussion because you’re part Indian. That’s who you are and this is part of your culture. I’m wearing a Traditional Thai wedding dress for my wedding day. I’m not full Thai but it’s still part of my heritage. Do you boo!! I loved it 😍", "magically_madison": "i mean it’s not really for white people to decide whether or not something is cultural appropriation😂", "_withlove_": "Are you a descendant of the people belonging to the culture this style of dress originated from? Thats the sole question of importance.", "kelly24fit": "love it!!", "sharon.anne.c": "Not cultural appropriation! You're half brownie ❤️😊", "evoni.mariee": "If white peoples can’t do it neither can you", "thereallat": "Uhhh hell no!!! If one of your parents are Guyanese and Indian you have every right to!!!! Lml if the others don't know what that is then that's their problem! U LOOKED AMAZING!!!! @shanboody", "mzcremebrulee": "You’re of Indian heritage so you’re simply celebrating and honoring a part of your identity.", "pnutbutter_83": "Do you boo! ❤️", "spammaccesther": "OUR CULTURE isn't about owning things. You look absolutely beautiful!!!! ❤️❤️❤️I'M INDIAN BTW AND people are jealous bc u look better lol!!!", "phoenixphenom": "You look amazing ♡", "sunshinefitness.co": "You're crazy!", "chelle_lili": "@00sio00", "sassycritic": "OMG how ridiculous. I've been following you for a long time so I already knew your Indian background.", "therealbadindian": "The probs us Guyanese women face when having to explain our heritage and cultural background I too am of Guyanese East Indian heritage maybe 80% of my family is Hindu people constantly question when I choose to celebrate that side of my heritage and culture eventho my family openly celebrates and acknowledges that part of my heritage smh people need to read more.", "marykay_maduike": "I personally think people misuse the words “culture appropriation” a lot. It’s the inappropriate adoption of a society’s customs. For one there’s a difference between inappropriately adopting a culture and appreciating a culture. I see no reason why a person of one culture can’t learn and showcase another culture. This is the beauty of diversity and the intersectionality of life. I was born in Nigeria, grew up in several other countries. I adopted their culture and even learnt to speak their language. I self-taught myself the Hindi language. It doesn’t mean I’m not acknowledging the importance of authenticity and the sacredness of certain customs. As a Nigerian there are certain things considered to be an “us” thing, but we all need to understand that teaching others our culture can only lead to a more knowledgeable and equitable world. One can’t comprehend, value and appreciate what they don’t know. 🌍", "lilshums": "Iam brown and this is not, appreciating the culture and admiring it is beautiful", "thewadeeffect": "No it wasn’t.", "danifjeldseth": "Omg you look so beautiful!", "curvi_curve": "Beautiful both of you 🙌👀💏❤", "1kaeber": "That’s for South Asians to decide", "uss_shiv": "You look beautiful dressed in indian wear. I thinked you have show cased our culture well. ❤️", "justtyty": "😍😍", "world_record_sun2019": "@world_record_sun2019 plz like this page", "e.ransom": "Y'all reaching!!", "chuckykimchi": "Beautiful", "avieekiss": "Congrats Cuz😍🍾🎉🎈 this is by far the most perfect looking couple I have Witness thus far", "snehagram": "Anyone who doesn't recognize Boodram as a west INDIAN name probably has no business complaining about appropriation 🤷", "crazy.fijian": "😍😍😍😍😍 Breath Taking! ✨Perfection✨", "soulwanderer": "😍", "_journeywithsteph": "I don’t understand how this is cultural appropriation when you have clearly stated at some point your ethnic background. You are Indian just as much as anything else. 💅🏽 to the haters .... btw We share the same ethnic background. My mother is Caribbean East Indian and my Father is black and white. Side, side bar My husband is Guyanese. Cheers to you 👑! You look gorgeous. I wish I did this at my wedding ❤️", "_chy26": "If you’re not Indian then yes but you’re Indian so no it’s not sis.", "_madd.iee": "😍😍", "anikasabrin": "Every white or nonbrown person in the comments is dragging it by claiming it wouldn’t have mattered even if she wasn’t part brown. UM hello yes it would have. Not ur culture don’t speak on behalf of us. THANK YOU NEXT. If you guys would so kindly shut up bc this ain’t ur territory thanks. Literally the entitlement is ridiculous. Even when it has nothing to do with y’all you make it have to do with y’all. NEXT.", "mamaslaylife": "I’m glad I watched the video bc I thought I was missing something. I always assumed you were part Indian bc ummm your last name is BOODRAM!!🙄 People need better things to do.", "cheirairem": "The fact that you loved this dress so much that you wore it on your wedding day is beyond beautiful... people need learn to embrace others cultures .. you don’t get to decide on what people want to wear or do to their hair etc as long they do it with grace that’s al that matters.", "sade.tanya": "Big fat watery steups 😒", "jess1ka_": "Saw ur video and u said it all", "amkew_": "In my opinion as long as you are showing appreciation for a culture, acknowledging it in every way, it doesn’t matter if you do not have the ethnic representation of that culture in your genes. If you’re not being malicious and just find this cultural wear beautiful and express it as such. Then you should have 0 worries.", "aestheticbyflo": "You look beautiful regardless!!!!ppl getting offended by anything these days, It’s kind of pathetic, there are more pressing matters in this world!", "lericheleroux": "@letanyaleroux ❤️", "cherise.mikell": "1) I am mixed and I have the same experiences. I hate expressing my cultures and it’s looked at in a negative light. In my opinion it’s not@cultural appropriation if you are mixed with it. 2) My partner is mixed as well but we go about find our comfort zone differently. When I was born there was no biracial or multiracial option, I had to be labeled black. To the government I am a black woman, to society I’m a weird mutt. My boyfriend on the other hand I know he sees privilege and oppression but he sees mixed people as ethnic people and we are oppressed as well.", "jaxsecretaccountnoonecanfind": "Follow me and help my dog get 100k likes please", "nirxni": "Liberals 😂😂😂", "monishaissano": "You are the first person I’ve ever come across to have the exact same mix as me! I’ve been called out for wearing bindis/saris too as well as being denied my blackness... it is tiring. No it is in any way appropriation, you have just as much access to all of your cultures as a monoracial person. Solidarity sis 🇬🇾", "majaaa_thesky": "Aren't you Indian? I'm confused", "jessi.lexi": "Obsessed 😍", "kaiomijm": "❤️", "exoticdolltiiff": "🙏🏽 My wedding is going be Afrocentric. Something different. I love your look 🙏🏽", "rutmelid": "❤️❤️", "toritathediva": "Clearly these fools have never watched a youtube vid of yours with your parents...lol", "____jiraiya_______": "Im biracial too, and unfortunately I don’t look brown butttt that doesn’t stop me from appreciating my culture. Unlike me you actually look brown I can see it. I think you’re beautiful and I was thinking about wearing a Indian dress for my wedding. Even if I’m not Indian but Bangladeshi it works in all cultures. My point is, I really don’t think what you did even if you weren’t brown was bad. Like I seriously think you looked beautiful and screw everyone who said otherwise. At the end of the day it’s just a beautiful dress 🤧💕", "jasmyn3lla": "Even if you're not Indian girl who cares. A culture cannot own a dress or hairstyle. I'm Jamaican mixed, living in Utah. Every halloween or college party, someone pulls out the dreads. Mimickation is the highest form of praise girl. Not to mention congrats! Enjoy yourself. People will forgive you, you're pretty lol. That's the sad reality of a world we live in @shanboody", "prasha_kumar": "You look even more gorgeous with the lengha! I’m so glad to see more and more women, specifically women of colour breaking the barriers of societal norms! @shanboody", "glossyspice": "I don’t have an opinion and I don’t feel like it’s my place to speak on it, but I am SO SO SO happy and impressed that you actually brought it up and opened your platform to question and conversation. It takes a certain type of person🧡", "justsheaa": "This is appreciation at its finest. Congratulations to you 💕", "trueoptimist": "Ignore those people and celebrate 🎉 every girl that has a dream wedding will tell you....that haters come out in masses ...even when you are not a celebrity ❤️ continue to do you @shanboody. It’s 2019 and if you don’t Google places in the world you don’t know about...you’re not worth anyone’s time.", "wonderwoman12_": "Im an Indian and I personally think it's amazing when people of any other race or culture choose to wear Indian outfits. Instead of looking at it in a negative way, I just admire how beautiful and different these outfits look on every skin tone. Let's all focus on the bigger issues in the world and stop fighting about things that make no difference at all.", "_noelleon": "I love the hair change. ❤️", "alphas.lot": "Do you have to be Indian cultured to dress this way? She’s not mocking or saying hateful things while dressed in this.", "lizzie_bee023": "Thank you for responding to this in the way you did! I for sure learned more from the dialogue. ✌", "chinagomani": "The questions could not have come from Canadians cause we know what’s up. The Caribbean is a melting pot of culture. PS congrats and you looked amazing !!!!", "melatmulugeta7777": "You've said it all on your video... Couldn't agree more.... U rocked that dress and that's all that matters", "heybriyana": "Nope it’s part of your heritage ❤️", "dee_raithatha": "@shanboody I first saw your wedding pics and I as an Indian woman felt so proud to see you looking beautiful in the lengha! I didn’t know about your cultural or ethnic background. But I thought ‘why the hell not?!’ Indian women are increasingly getting married in traditional white wedding dresses, so what, you like it, it makes you feel good and happy then go head, your life is yours to live 💕", "chandanfashion": "You looked stunning in our Lehnga!!! Thanks so much for tagging us!! Congratulations on your big day!!!! BTW it’s in our opinion that our dresses are made for everyone of all cultures and all races and all skin types! We have been serving our clients for 35 years and there isn’t any one culture or race that we haven’t had the pleasure of outfitting! Live and let live in peace ✌️", "shradha_bhatia": "My thoughts on this: whether you are Indian or not (and yes, I know you are 😁), you’re wearing the lehenga respectfully and on the occasion it is supposed to be worn for - so as an Indian, I don’t really seen the problem! If someone wants to partake in my culture and they do so in a way that is respectful and mindful, why the hell not? I LOVE sharing my culture with people. And I love learning and partaking in other cultures too. This whole debate around appropriation has really gotten out of hand. Wearing a bindi to a music festival - yes, I can see how that might bother people. But wearing a beautiful legendary with utmost grace, respect and for the reason it’s supposed to be worn? Come on, that isn’t appropriation by a long shot. Would be nice if people could be more open minded about sharing and partaking in cultures, especially when people are doing it in the right, respectful way. PS @shanboody you look 💯", "realigkells": "Why would u debate ur wedding.... its ur moment. Just let it be and let them talk", "karmalaluna": "How you gonna appropriate your own... culture? People are stupid.", "betthatbreezymakeemjump": "It is YOUR culture. You’re part Guyanese for heavens sake. 😩 They really think you can appropriate your own culture? You look bomb. ❤️", "chantelawalker": "Not cultural appropriation at all if people bothered to do research before screaming injustice they would know that you have always been open about your heritage and what you said in your video on the topic is so true about racial ambiguity and maybe not “looking” like you represent a specific culture people assumed because you don’t necessarily “look” Indian that you must be appropriating the culture but in all honesty what did you gain from wearing the dress you love to honour your family that could really be called appropriation in the first place. I see someone honouring their family’s ancestry and someone glowing with happiness in their wedding day nothing. Maybe as a mixed race person myself I can understand in a different what that maybe some others would but that’s just my two cents. Love the dress and love the happiness displayed in your wedding photos thank you for sharing with us and thank you for honest open discussions ❤️", "lavie.josie": "It's almost like they don't want mixed people to exist. It's almost like, they prefer eurocentrism. I get it. I understand. It's not appropriation and they (those who consider this appropriation) are wrong. I also consider the idea of appropriation debatable.", "shimmerveli": "congratulations!!! at first i thought these pics were just a photo shoot 😃. 🎊", "alessia.alili": "It's a sari", "j_trinijab": "They obviously don’t know enough about you to be making those types of assumptions. I thought that it was a great way for you to pay homage to your cultural background!", "hertheone": "Idk but who cares? You looked so amazingly beautiful. They need to shut up", "justbecherisha": "No, aren’t you Indian. People who actually watch your videos would know that ❤️❤️", "ladykate_lyn": "Gorgeous ❤️🤞😍flying the Indian flag high🇮🇳 Boo🙏thank you", "v_is4vegetarian": "The definition for appropriation is \"the action of taking something for one's own use, typically without the owner's permission.\" When you add the cultural aspect to that, because no one owns a culture we have to say that it's the taking for one's own misuse without consideration or acknowledgement to the culture.", "eyezbright": "Fuck em. You don’t need to explain your culture or heritage if they have been following you and don’t know who you are or your background. The people the support you know what it is. You looked absolutely beautiful and I’m sure mom and pops were so happy to see you walk down that aisle in that dress. Congrats to you and Jared.", "the_k404": "My only question is, how did your head piece stay smack in the middle the whole time? Skinglue perhaps? 😉", "tishathebrave": "Her dad is of Indian descent so howwwwww did she apporpriate culture?", "aaliyahxparis": "This 100% isn't cultural appropriation... But some of these people in the comments (I feel) are are too focused on being agreeable, that they themselves haven't bothered to make sure they have the correct definition of what cultural appropriation is.", "tqsie": "You're mixed. You're allowed to wear whatever you want from your culture/ethnicity! Can't believe ppl attacked u for this without even bother looking up straight up FACTS.", "shayjsongbird": "How is it cultural appropriation when it’s YOUR culture?! 🙄🙄🙄 ppl need to have a seat", "lanzgrows": "You looked beautiful. If you wanna wear the dress wear the dress.", "cjhunty": "aint she more indian than anything? 😂😂 this is her culture", "anannyasurve": "As long as your not disrespecting the culture and know the reasoning behind the wedding traditions then it's not appropriation", "monalisaw": "Shannon i am actually upset that you had to explain yourself. Maybe its the naive Canadian in me, but the fact that people are out here knowing nothing about the culture but want to speak for the culture. Ugh...Shannon you are beautiful inside and out i wish nothing but happiness for you and yours.", "tiffakasia": "Aren't you part Indian though? How is this cultural appropriation?", "danielleshereese": "Ya name is BOODRAM. 🤣 Where they think you got it from?", "lolo_cy": "Girl you are BEAUTIFUL. Period! Cultural Appropriation where???", "dhazzy_cartoon": "DM ME IF YOU NEED 🎊••••> ANIMATED MUSIC VIDEO 🎉🎊•••> LOGO 🎉🎊🎨•••> CARTOON GRAPHICS 🎨🎉🎊💥•••> COVER ART AND LOTS MORE AT GOOD RATE 💯💯💯🎨💯🎨💯🎨💯🎨💯🎨💯🎨💯🎨💯🎨💯🎨💯🎨💯", "eleshayz": "Urgh, it annoys me that you have to give two cents to about your wedding dress in considering if it is culturally appropriate by society. Wouldn't have guessed that you are have Indian ethnicity but you looked Hella damn gorgeous in that dress. Some say that the dress makes completes some but I think that you completed the dress.", "tirsatalks": "Some thoughts on what you said in the end of the vid about who benefits from the policing of cultural appropriation, if the alternative was for you to buy a white owned dress. I think you may want to look into the difference between cultural appropriaton and cultural assimilation to get the answer to the question: who benefits. The fact that everybody is allowed to wear white people's culture is because everyone is forced to wear white people's clothing. That's assimilation. Not showing parts of yourself because it will make your life, career etc harder. Many things that are appropriated such as hairstyles, cultural wear etc. would mot be accepted e.g. in the workplace or are banned in schools or the military when people from that culture wear it. This benefits white supremacy. Now, if a white artist wears another culture's heritage or white kids wear it at festivals they are firstly most likely unaware of its origins, and if it went hella mainstream and they got the item from HM, no non-white people benefited from it financially. Finally, if it concerns an artist who wears sth for a performance or video clip, without cultural awareness or proper execution/context, but they make hella money from joining the trend, which poc arent able/allowed to join in on... This is how cultural appropriation benefits white supremacy, by erasing poc history, taking away financial opportunities from poc and making a profit for white people. Your case doesn't include many of these elements, not only are you of the culture you portray, you also know the proper way to contextualize the clothing. + You purchased and promoted a POC owned vendor. Now, I don't think the policing of cultural appropriation is benefitting white supremacy, it is aiming to protect and uplift poc and their cultures. In your case it just seemed like it benefits white supremacy because it was a wrongful accusation. When a white artist wears a bastardized native head dress, or when white girls wear glitter on their forehead without knowing where this custom came from, I don't think this benefits people of colors financial wellbeing or their social status. thank you for coming to my ted talk. ✌🏾", "hiba310796": "I think some people think you are african american because they didn't watched all of your vids", "delynn": "When I first saw your pictures I did question it. But then I remembered you were part Indian so no, how can you appropriate your own culture🤷🏽‍♀️?", "magalifergie": "Crazy though that in 2019 people still dont know that South Indians were promised lands in the carribean and Guyana because slavery was abolished and wypipo still needed people to work. I mean... Anyways you look gorgeous😍", "gbreal1971": "People don’t do their research but still find time to type on IG and Twitter 🙄", "gemini_mich": "I'm annoyed you even had to do a video explaining yourself. They're dumb, period. If they knew your lineage they wouldn't have had an issue with it.", "negress_oracle": "Honestly when i saw your dress I thought it was beautiful and didn’t really go beyond that. I didn’t understand what you wearing it meant but you seem to be a very intentional person so I assumed you had a reason and that very likely that reason was nones business 🤷🏾‍♀️ #keepscrolling", "vibe_ryt": "So what your nationality? So do these people know your cultural. I'm confused", "incarnatedbeast": "@a_ghost_grrl no we Indians won't mind if some white girl wears Indian Attire .. i saw a lot of tourist (white ppl )wearing Indian clothes..no one cares except for some stupid liberals...", "heyochriss": "Amazing video. Incredible, thought provoking perspective and questions. 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "aliyah221b": "Lol you’re half indian..", "flores_delalma": "💓💗💖💘💖💖", "specialbabi7": "You’re beautiful! @shanboody 😘🤗💕", "melisawhiskey": "Congrats on your wedding I remember u on Steve Harveys show a while back, talking about your unconventional dating style ... And he was low- key judging you... kmt ....interesting viewing you go up the aisle whilst his own daughter silently called off her engagement and never got up the aisle and is now dating that player Trey Songz i like following your youtube channel because you are honest refreshing and real more power to you beautiful!!💥💥", "lovelealyds": "In the Caribbean, their are few things we would call cultural appropriation. It has to be blatantly wrong and so out of place for us to see it. Living in Trinidad I watch from afar as major western countries deal with that issue. It’s fascinating, in my melting pot of a country where on one street you could have six different ethnicities each with their own cultural practices living on your street as your neighbour. It’s hard for me to grasp it. But if I lived outside that norm, where your culture maybe put down in society but then picked back up by others for “fashion” I think I can emphasize and get it. However, I also need those persons to understand that it’s not a one size fits all, outside of your bubble what you wore is pretty normal. In fact with so many East Indians in Trinidad it’s hard to go a Hindu wedding and not wear a sari or other East Indian wear whether you Indian, African, mixed etc. So I wish ppl would understand one size doesn’t fit all. Cultural appropriation in your world is actually cultural appreciation in mine. Also, you and Jared looked stunning and happy with your love ones and on your wedding day that’s all that matters. ❤", "prettybhamidi": "🏆🙌🏽💕🔥😍🙏🏽", "whineshrine": "😍😍😍", "felly416": "Girl you look beautiful! Bringing it back to your roots! 💕🇬🇾", "yanirababy68": "Girl you didn't have to explain yourself. If they follow you and your channel, they would've seen the pre wedding video when you're talking about parts of your culture you wanted to incorporate in your day. You're wedding was beautiful and you both look amazing.", "makeup_lover677": "No I do not think so and I am Indian. Think you looked absolutely gorgeous", "filibeano": "Arguments can be made for either side. Always best to listen listen to the opinions of those who live it if it’s not your culture.", "whowantwarr": "Absolutely not, you look stunning💙💙", "illdillsokota10": "💯", "opalellyse": "@shanboody This outfit was honoring YOUR culture!! You are Indian, period. You are black, period, you are also mixed with white but can never be white because well white people have made that clear, like legally bindingly clear😂, you are also beautifully multicultural, period. F anyone who was ignorant and didn’t know. I’m mixed (American, black and white) and I love it!! Pretty much ALWAYS HAVE. I never felt confused, I just do me, because of where and how I was raised doing me lines up with black culture really well and I identify as black and mixed, period. It’s a blessing, but I get the hate too, but always from ignorant, usually white people, fuk em😂😂😂😂 it’s our green eyes that throw em off😜 Anyway, who’s doing it well is Alicia Keys 🎹, she’s always done her, she loves who she is and she loves her family. 😂👏🏽👏🏽🙌🏽", "manjotsanghera__": "GURL U FUCKEN KILLED IN im brown and I'm saying it's not cultural appropiation😍😍😍😍😍😍😍😍", "ntoetselerotholi": "I was surprised at the title of this video because anyone who's paying attention (or watches your videos) knows you're of Indian descent which instantly negates the question. In any case, I've always regarded cultural approciaton, like most things race-related, to be about power: Who benefits when white people profit off of traditionally Black features/styles/culture that the originators (black people) are often discredited or ridiculed for? Easy answer right? I apply the same thinking to all cases. The people who accused you of cultural appropriation either don't understand what it means, enjoy using it as a buzzword or, as I said, aren't paying attention. Wearing a wedding dress that honours your culture (regardless of whether they KNOW or ACKNOWLEDGE it is your culture) literally cannot be appropriation. You looked gorgeous then and look gorgeous now (that lip colour is everything), you don't need other people to acknowledge your culture for it to belong to you. You don't have to prove the truth to anyone. Xo", "sugahbabyscakery": "But even if your dad wasn’t Indian..wear what YOU want to YOUR wedding 🤷🏾‍♀️", "sabrinabmalhi": "❤️❤️", "kantsak": "Am... No", "leila.aliibrahim": "People love throwing words around without knowing their real meaning 🙄", "jelissairis": "How? 🧐 haven’t you mentioned your family background in the past. It’s sad how ignorance can take away from the beauty in your moment", "indiaaniya": "I can relate with being biracial. I have gotten the same response. It used to cause alot of anger but like you said in your video. It is really other peoples opinion. Not for you to stress over. That is why self love is so important. Really knowing yourself.", "_lewej": "how about cultural APPRECIATION! 😍", "mandee_klair": "Love it. It is not culture appropriation. It's a beautiful dress. Anyone can wear it. You look amazing", "kgosbourne": "Don’t you have West Indian heritage ? That’s a lot of things, I thought it was very beautiful and paid homage to much.", "a_ghost_grrl": "Geez, I just read you are Indian. So yeah not at all appropriation", "i_fear_bubbles": "It’s beautiful. I’m half black and half Indian and I feel you. You have a right to your heritage and I understand the lack of acceptance.", "mzelaya8": "Watched your video. Great explanation. But, you didn’t need to give one. Your wedding, your dress, your business. You do you. I totally understand the mixed race thing and not being “enough” of one or the other and wondering how people perceive you or what category OTHERS put you in. None of that matters, except the boxes YOU want to check off for yourself. Show up. Be seen. Much love, @shanboody 🙏🏽💛", "odd_joz": "No.", "_diabetic_queen": "YESSSSSSSSSSSS", "charities45": "No its not cultural appropriation. I know of you and your West Indian background way back years ago watching your videos on YouTube. You were in Toronto. Being of mixed Caribbean descent just like you I understand what it is to be racially and culturally mixed. The choice of wedding dress is a natural one. You are Celebrating \"all of you\". To hell with ignorance.", "nuha_xo": "You look stunning❤️ It’s your culture and your heritage, it is yours to claim and no one can take that away from you.", "labeautyologist": "The cultural blend of the Caribbean confuses people veryyyyyyy very much. lol. Excited to watch this video", "blaqmoonmami": "But like. Its literally apart of your heritage tho lol. Huge sign that youve grown your online presence so much that there are ppl who dont know that 🔥", "__tamalli": "You’re Indo, you’re good 🔥🔥", "tyblanar": "Your dress was stunning and you looked gorgeous, so proud of you and Jared that you can express your style with confidence and don't have to follow the so called tradition.", "_krissyx3": "You looked stunning 😍😍 Your last name is definitely Boodram 🤦🏽‍♀️ i dont understand people sometimes", "omaria.a": "as long as i don’t ever see you put down the culture it’s from in any way its appreciation", "curlyladee": "I completely forgot you are part Indian BUT cultural appropriation didn't even cross my mind I saw it as a unique wedding dress of YOUR choice.", "rehana_xo_": "I can’t believe you had to address this. I saw the stunning lehenga and immediately thought of your family and their reaction, knowing you’re part Indo Guyanese as well. Great questions your raised at the end of the video. And you looked STUNNING."}