{"smatsatsa_": "😍😍😍", "kantesaikouyaya9": "🌹🌹🌹🌹", "citlali_otli_": "I love you for this 💗", "xfg.nb": "Looks like Paula", "bigg_davo": "Listen to Bigg Davo- Gotta Feel Me !! Out Now on SoundCloud!!🔥🔥🎤🎧❗️💯LINK IN BIO!!🙏🏾❤️", "hype_fly_kickz": "Wait. Your over 30 yrs old? No way!", "urfriendlyneighborhoodatheist": "Just beautiful!💖", "clareceleona": "Girl you look exactly the same! You fine wine", "simonereynolds_": "😍😍😍", "kylian_allen": "Wow", "bessobarotimi": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "celvett": "Remember you from those girls are wild on YouTube 😭", "_cecelolo": "❤️ This caption", "miadoes_": "I loooove this! I was never concerned with how ppl matured physically in 10 years, but in how they truly grew. That's beauty right there. Keep growing. For our fellow 30s gang, thx for telling it like it is and for being real! ❤️❤️❤️", "ninavsmichelle": "😂😂😂 aging is awesome right ?", "luldejacuh": "Your nose makes you more cuter", "doc_chelle": "😂The muffin part", "leahsilvia_": "Just yes!!! 👏👏👏👏👏👏👏", "iamdaniellemurphy": "All three are beautiful and emphatically you! Thanks for sharing!", "daria_louisa": "In fact, I still thought you’re in your mid 20s. Looking beautiful, girl. 💕", "christianconfidential": "I love this ❤️", "king_staej_xox": "Amazing 💕😍😘", "krazy_ass_mista": "Pure beautiful Goddess", "l.a.y__": "Behind all the flaws you’re still gorgeous 💯🙏🏾😍", "babyjasssssss": "But you’re still so cute so that’s out the window lol 🤗", "parisbonjovi": "Come thru", "milcania_": "True beauty = growth 👌🏽thank you", "choward261": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "princzonn": "Beautiful 🙏", "dare2claire_": "Love this 💗💗💗", "_xtoriw": "@chrisd_30 look like your cousin", "brian_17aegeansi": "Wow the left pics are 🔥🔥🔥👌", "exquisitelyraealeease": "@_artofhardy_ I thought this was you", "k_lynn_gal": "Beautiful inside and out", "mgbvibin": "@cutiestutey I thought this was you cuh", "themolecularmachine": "Perfect, and exactly what I was thinking 💪🏻💪🏻💪🏻🌟✨", "mayowasworld": "Yaaaas!! So beautifully written", "imanijahaan": "❤️❤️❤️", "cosmic_isabella": "You are a very very beautiful woman, and aging gracefully.", "alejandramoreno.1": "📸 Nice", "little_toro": "Thank you 🙌", "art_light_magic": "You’re in Refinary29 about this picture :) x", "louisamcc": "👌", "c___miranda": "Love everything about this! 💖", "admirethetruth": "I fucking love this.", "sheshelll": "@stay_wild_and_wander this is why I love she’s so beautiful and honest! ♥️", "hiishaunax": "Wooooo i thought this was @aokileesimmons hahaha", "adiroxstr": "Love the realness!💯", "ayise_demir": "Wooo @geace_vanderwaal", "sarahterschegget": "I need you in my TL!! Nobody wants to cut the crap! Thankyou 😩♥️", "sabreigha": "I’m sorry, you’re 30?! :O", "jacy.fisher": "Amen!!!👏👏👏", "loveleeo": "Yessss Shan! You better let them know", "cest_moi_destiny": "Love this so accurate", "michaelprivius": "Caption✨🙌🏽👌🏽", "pnutbutter_83": "We love u!", "gotellmichelle": "🙌", "miahon1": "Great to see someone being real 👍🏻😀", "freddiefloresss": "😍😍", "clarissajusdan": "You always look amazing and wonderful and fabulous and gorgeous and.......", "barbaradoray": "Goals!", "realness889": "You dont look your age one bit", "ninalauradionnex": "I've always thought you were so stunning and people say I look like you so I feel good 👏🔥", "e_sideondarise29": "You gorgeous yo. 😍😍😍", "lilia_anna": "👏👏👏 likewise! ❤️", "magswag73": "Why have I felt this way since I’m 25 😂 pick out my gray hairs in the fluorescent lighting of the work bathroom", "jmyl008": "Thirty is treating you good sis :)", "sarahsmth356": "Love this! Definitely relatable 🙌🏽😂😊", "anythingforherhair": "Thank you ❤️😍😍😍😍😍", "acupofmel": "With every line and spot of wisdom, you’re still beautiful inside and out ✨", "according2linda": "I love your truth and you're 💯 beautiful. ❤️", "mahealanij": "I love you for this!!!", "bigste54": "Really cute 😍", "xpriestess": "Look finer than wine to me witcho fine ass 🍷", "agent_1407": "@shanboody : you look amazing with and without MakeUp. Please don’t listen to the haters and continue to live your best life. I am also embracing my grays and looking froward to being a silverFox in my mid to late 30’s.😎", "_french_": "I’m 31 girl..... and this right here gave me some life! Lol", "j_michquel": "@shanboody can always count on you for authenticity 👏🏾👏🏾", "fieryfeiri": "Where did you get your glasses from I love them", "soninke_lodwar": "Good life", "adjei2648": "Hi", "habitually.amel": "⚡️⚡️⚡️⚡️", "laik_show": "Purely Beautiful‼️🙋🏽‍♀️I don’t know bout you but “I’m lookin more Better Everyday I got that Benjamin Button”💥", "lalakiki86": "U look the same boo, gorgeous ❤️", "lockenkopp_": "Omg this is amazing. I've just turned 30 and I can so relate to every single word. Thanks for sharing. 🧡", "valvirgogirl": "Baby girl most of that is genetics. Embrace your beautiful soul Sis.", "sadiya_bello": "love love love your take on the #10yearchallenge... everyone is showing only their glow up game when in reality everything comes with a grain of salt. life is about duality and that's the beauty of it.", "jwill16_": "She still cute", "jmthemusician": "Love this!", "dealsforyouz": "Dreaming", "justjax2u": "Hahaha my knees are like please I beg of thee hahahhaah 😂 I felt that", "fightbadhabits": "@foureyedbandit oh man this is me!!! Haha 😂 loving life! I feel like we've had this conversation on one of our walks at work. Bring on another year. @shanboody you look amazing and still full of life. 😍😍", "mrmikeysmilez": "😎 🎶🎵Run that @champagnepapi song... \"Sweatpants, hair tied, chillin' with no make-up on-That's when you're the prettiest, I hope that you don't take it wrong....🎶🎵🎤", "jaxsecretaccountnoonecanfind": "Follow me and help my dog get 100k likes please", "cicimoya": "That Shan from TGAW daysss..... Still remember the first video I watched of you cussing out Curly-ists! I was thinking \"how is this girl not famous yet!?\"... It was just a matter of time 🤗 And I feel u on the metabolism changes - I used to go 3 days just eating cereal to be able to fit in my outfit by Friday night. If I try that today I'll just get bloated and get adverse effects 🤣🤣 Keep shining Shan! U never stopped inspiring me 💋💋", "agejustlaughed": "She’s so pretty 😩 @asiaky_", "ash.baca": "🙌🏼🙌🏼🙌🏼", "playasiaact": "I think it's funny have people try to outrun age. He's jogging behind you like, \"I've got all your time on this planet.\"", "mscookies876": "❤️👑Yes Queen...talk da tings @d_nice735 @bashynikki @mslady_diana ❤️love this🙌", "nikkidopeness": "Lol..Shannon you are still such a beauty. Super funnier and still so beauriiiifullll 😘 @shanboody", "theauntofdragons": "FINALLY an honest photo. I feel like everyone was finding the most filtered photo of themselves for 2019. I think there's something very beautiful about aging. I'm almost 30 but I still feel young as fuck. I feel like I have so much more energy and I can't wait to see what my 30s have in store for me. Ur flawless btw", "stephmilius": "Ahhh this is the best. You look so healthy!!", "brandon_penson": "Better to age gracefully. You look GREAT!!!! ☺❤🌹", "l3x3l": "😘", "ikheetgeenjoost": "True and empowering! ❤🙌💪", "leiad_cutie4": "You look beautiful at any age. 👏👏👏❤️😍. I'm not just saying it.", "aayyeee_leee": "You’re naturally so beautiful, in all senses of the word.", "sazzay_": "You should of did a TBT from your Much Music Days!!! Only the day ones remember 😩😂😭", "mreno85": "I love this!! I’m 33 and this is so relatable. BUT for the record, you look amazing!", "almeidasuzan": "You are awesome!!! Such an inspiration!!!", "samanthagberry": "i heart u beyond. Your beauty comes from a depth that shines light.", "daniellelovelightmckinney": "Beautiful", "_crystalliane": "✊🏽", "pepperann78": "🥰 love it", "wholesome_holistics": "Thanks for sharing this! You look stunning either way! ♥️♥️♥️", "profchrisc": "Oh god for a minute I thought my sister had cloned herself. 😆", "_cbsq007": "You're still hella sexy! Please😍😍", "tashvibe13": "Love this. Thank you. 😊❤️", "indigenous_weare": "And You Still Gorgeous Little Sis!!! We Age Gracefully...", "emily.senk": "This is beautiful, you are optimistic and empowering! Thank you 💕", "sweet.salvatore": "😍♥️♥️👌🏽", "mizz_v357": "Girl u still look amazing", "nyah_the_natural_": "Trust, you are not alone and always worthy. When I found out my knee pain was due to allergy induced inflammation I cut out wheat and focused on healing past traumas. No more pain. Remember society feeds on women's insecurities and gets rich on it. F**k that! 💜💖", "q_oneofakind": "(☝🏾) Love it 💜", "nyn.to.fyv": "Love what you wrote. Thank you!", "compulsiveintrospection": "Wait...I'm supposed feel some type of way about my grays? I'm forming a storm streak and I'm happy af about it 😂", "lovealliro": "Happiness glow! 😘", "lizziebandar": "Haven’t aged a bit 😍", "chaviiita": "I love your realness! ❤️❤️❤️🙌🙌👑👑 true queen!", "whatdedesays": "I just love you 🙌🏽🤣 Girl yes! Lol", "littleladyfrancis": "All of this!", "thugism_": "@_honeycobaine who she look like ?", "simmydavis": "Such a real ass post. Thank you for the authenticity.", "bandhu_sauce": "I have been looking for pics that can underpin it.", "uniquelyzola": "“I’d much rather have a conversation with myself today.” I love that way of looking at it! And you’re beautiful as always❤️", "k1rrah": "someone told me your 30s are like your 20s but with money lol @shanboody", "doctor.sunk": "Hahaha I loved your description. Hats off to 30+ woman! I am one too!", "orlandonerdgirl": "You’re right, all of those things happen and it keeps changing the older you get. But you also become more wise. Life is so much better the older you get. You learn to appreciate what matters most. You learn to love yourself and not take any shit from anyone. #bringitonmenopause", "gibbonshorton": "Love your honesty!", "anattentivesoul": "Beautiful!!!😍😍😍😍😍😍🧡", "brandonmbolton": "❤❤❤", "terri2kool": "It’s the part about the glasses that hit my soul! Issa whole mood and I’m not 30 just yet. But I def had to tell folks without my glasses. Your face is unrecognisable in these streets! 😆", "nessabrasil1": "💕", "virtualvibesbabe": "I love this, love the honesty!", "mioschi": "Hey! No joke I will turn 34 on Wednesday (1/16/2019) and I feel the exact same way! I recognize all of the changes inside and out and I too appreciate and embrace them all! -At the end of the day we could be sick, dying and or dead. I don’t mean to be dramatic however I had this epiphany when I was in high school and randomly got selected to volunteer at a children’s hospital with children dying of cancer. It changed my life forever!!", "niamulan": "I LOVE EVERYTHING ABOUT THIS... 🗣🗣👏🏾♥️", "lolascurls_official": "Honest AF! Me after a run is a hot mess but still me at 34!", "sherita_byclark": "Without glasses feeling *", "candice_ba": "You always keep it real ❤️. I admire that & it’s inspiring.", "flawlessbritny": "Thanks for being real. People made it into a “glow up challenge” any reason to boost that self ego lol", "saderenea": "Looooooove this", "revasremix": "The knee pain is real", "bookzluver": "You look a lot like your sister in the top left picture", "squintystudios": "Honestly. When you know someone for so long and as you slowly see them age. Its a beautiful thing :). Cause you can't help to think, I've been through some shit with them and we got the years to prove... for example, when I first discover you on askthefeels, I was like woah, she's beautiful, and you're still gonna be beautiful throughout the ages. Just my two cents anyway, even if I don't know you personally haha.", "thefreshesthell": "THIS. YES. 💯", "lifeofdocta_j": "So how old were you in the pics on the left? Or what year was it?", "monika.m.megan": "I feel the same way!", "inallitsforms": "Do you want to hear from somebody waayyyy past thirty? Embrace it all, take care of yourself and express your beauty and creativity in the manner that you feel on any given day.", "ladybugintx": "😌🙌🏼", "lou______burger": "the only time these don’t annoy me (other than your realness, thank you) are when lgbtq folks post them about embracing their identities and how they’ve come to accept themselves or grow into their skin. otherwise it’s all just thirst traps, or at least that’s the vibe i get.", "mj_nabil": "😍👍😍", "kkkkierston": "I’m not even 30 and have greys! Shine on queen!!! ❤️❤️", "quetsyphoto": "So beautiful!!!!", "hotthangcandles": "Beautiful pictures and caption 🙌🏿❤️", "blackmamanof2": "Welcome to the honeymoon phase. I dont know why I gain weight when I’m happier", "mariahinla": "Thank you for this 😍", "soniawaraich": "Well written caption 👏🏽", "iambellaperri": "#Transparency at its FINEST!! And I can't wait to be living out the next to the last line of this post♥♥♥♥ #Goals❤ #TrueStory👈💯💯", "miss_fit_foxxy": "U good girl.... no stress u good", "tahaphoto": "🤣 well said!", "amorraa": "@lynz_jade just read this for a moment and realize it’s normal to age and be ok with it lol", "athinar": "💖💖💖", "mesha_rochelle": "I will be 36 in May. I'm starting to see the fine lines and the back pain... Forget about it!", "kimistry105": "I love this", "carissastephens": "😂😍🙌🏾❤️💕", "margauxlynlancaster": "You are stunning!", "irenehatesyou": "\"I'd much rather have a conversation with myself today. So yeah you win some, you lose some\" 👈 #relatableAF", "mkpsicologia": "I love this ❤️😘", "don_rodz": "👏👏👏 still looking great. Just wiser with life battle scars.", "bigeasy98": "whoa...far better now", "lifeofabrowngirl": "Love this 🙌🏾", "moe_lovely_": "You are still very beautiful!!", "northamericanjets": "Shan we noticed that you enjoy traveling. Would you like to attend to Barrett-Jackson Auction Company Scottsdale, Arizona 2019 with us? Let us know and we'll send you a quotation right away!🔥🙌🚗", "jaeydakiss": "I love the glasses 😍 I’m a sucker For Nerds. LoL it’s all Jokes.", "cassidy.maysonet": "Hahah I love this Shan! ❤️ Especially the conversation with self part💕", "jennijanks": "🙋🏽‍♀️Preach! Concealer is the ultimate 30+ game changer in sooooo many ways. I love that makeup enhances what’s there and I love that I now value investing in the best skincare I can afford... or Visa will grant me through credit... it’s a win-win.", "fanaye_leigh": "Hahaha this caption is straight FACTS!!😂", "77re77": "👏🏽👏🏽👏🏽👏🏽👏🏽", "naraswild": "😂🥰💖✨🦋", "andreshame": "Sexy gal.", "wildhair__": "This is the only post I actually love out of all the others I’ve seen.... SERIOUSLY ‼️ 👏🏽✨👑 ENJOY YOUR 2019 LOVE 😘", "alyssa.charles": "All typa truth here. Mad greys and my joints ache like I’m 60", "thatdamn_ag": "I love this so much!", "am.an.duh": "Thank you for keeping it real! Nobody else did!", "idbracelet04_4l.awly": "🦋🦋🦋", "water_willowminnow": "Your so pretty🙌💕💕", "ts.chaa": "Im 31 and loving it so much more than my twenties. Yes, it takes twice the work to stay in shape, I found a grey eyebrow hair, my hairline is definately receding and my skin is so saggy. But I also feel much more confident, more womanly, idgaf about what people think of me anymore. I gained tons of empathy, plus 30ies sex is bomb (when my back doesnt hurt). 👌🏼", "missktg": "@becominglifeco xx👏🏽", "i_am_king__": "U age quite well", "marinaauswien": "😍😍😍🙏", "fenamunoz98": "You are sooo beautiful inside and out😍❤", "destineealicia": "Always keeping it real! Thank you 🙏🏽", "mayasworld\nVerified": "Verified", "allyelliott": "You’re so freakin beautiful... wow 😍", "eliannas": "I LUV adorkable Shannon 💗", "travel.to.cheers": "🙌🏽❤️ Living the same grey haired 30 year old happy loving life girl!!!! The changes are apparent and not always easy to adjust to, but wouldn’t go back to any of my younger tighter smoother aged days for the world!! Cheers to that! Cheers to loving and respecting thyself!!!", "4evertisha": "💯💯💯💯💯👑👑💜", "jeanannagard": "Shan you start to look like a wifey.Are you expecting?", "y3lhsa": "Yas!! Thank you! I had to start a whole skin routine when I turned 30.", "geo_antoinette\nVerified": "Verified", "aprilbreezy": "yessssss girrrrrl! thank you for that 👏🏻👏🏻👏🏻👏🏻", "__itstamara": "The last part tho🙏 BIG MOOD", "justjewels35": "❤️❤️❤️❤️", "domo_arigatooo": "This is the best #howdidagehityouchallenge yet... Actual honesty. Er body stays searching for their best aged photo acting like life didn't give them a couple battle scars.", "laura_nicole25": "Love this!! ❤️❤️", "mecohbain": "Love this 💕", "someadultconversation": "Love this!", "ms_frisco": "I mean, my challenge post was honest. I'm an unspeakable amount of weight heavier than years ago, but that's due to giving birth twice and my thyroid during f* you after I had my son. My knees are mad at me as well and I actually feel older now. I now wear glasses when my vision used to be perfect. I've been through so much in a decade I'm having a hard time feeling the glow up, but you're shining 😊", "victor.oben": "Dope dope!!", "_champagnepoopie_": "I don’t even understand how I don’t even see any of the “negative” stuff mentioned 🤷🏽‍♀️", "chocolumpia": "👏🏽👏🏽👏🏽👏🏽 Love it! ✨", "califia_queen": "So much #truth ❗️❤️", "reclusepoet": "Talk about it 🙌🏾 I’m here for the honesty I’m happy someone looked at the internal and not just the external 💛💛", "kingbre10": "Just turned 30 a few months ago and I swear..my skin just fell apart, working out has been more difficult. I feel amazing inside though and I love the person I’m becoming and figuring out who I want to be. You’re so right about winning some and losing some ❤️", "cloudsinhualien": "Love this!!! 👏🏾💖", "jaclynkristi": "@shanboody ill be turning 31 in May and soo far my 30's has been pretty shit! Grey, dry ass hair, ance is popping up more, weight gain... Hot mess!! Stress from my car accident doesn't help, hopefully 31 and beyond will be better💁", "soul4reel": "Exactly! ❤️", "zahrabentham": "Lmao oh man♥️", "victoria_pasm": "❤️❤️❤️ so grateful for you & your wisdom", "rick_e_lifts": "You still look good boo boo keep doing you.", "experience818events": "Also you’re eyebrows are way more fire now 🔥🔥", "ariasvoice": "These pics are days apart. I don’t wana hear anything you have to say. Lmao! Just flawless 😂💜", "jeremyrentfro": "I want you to know. As I’m reading your beautiful message... literally “the climb” by Miley Cyrus is playing in the background in my car! Miss and love your positivity in my life on a weekly basis. 🖤😘🤗", "imrachaellea": "🙌🏽🙌🏽🙌🏽🙌🏽", "simplybiancaalexa": "Still gorgeous! That caption is everything 😆 💕"}