{"badtingashh": "Those boots are everything 😍", "lana_in_auz": "I made the 1st move on my now amazing partner of 3 years.", "ngolela": "I'm not afraid to 🤷🏾‍♀️", "jadeymae": "How I met my now husband ❣️ @jcs_king", "ye.zeni.a": "I always make the moves #beenbold", "jewejewebee": "😍😍😍🔥🙌🏾🙌🏾🙌🏾", "amandalashawn": "Made this first move on my husband 15 years ago in high school and now we’re about to celebrate our 6th anniversary!", "emeraldnicole_": "Shoot your shot sis! 🤣 @getinsidemybush", "macsceneshaw": "I’m just trynna exude the energy in this photo tbh.", "tashfraz": "@mohini.gorsia idk who this is but she speaks fax", "mrjmws": "What I've always said to my wife. Women get attention on they worst day. I can get hello in a 3 piece suit, fresh cut sitting on a pile of money and accomplishments. Lol😂", "sasha_cataf": "Where is that outfit from and shooooooooes!?!?!?😻😻😻😻😻😻", "go_qna": "🐵/😂 oh girl.. u r not only pretty but also funny as hell (that face expression = great joke about todays badly seducing society full of 'undecided' women marked by fake #meetoo, Shan Booty aka almost ALMOST Cardi B from 'Taki taki' U deserved a huge 👍)", "skindew": "🖤", "havanalaluna___": "Wow 😍💞", "maiwe_z": "Amazing", "realwisdomjuice": "You got a sister?", "dazzledbee": "The universe is definitely sending me messages: i was just challenged to do the 1st move by a friend... not gonna like i feel my gut bubble with fear but i'll give it a try!", "rackle_spackle": "I made the first move with my ex and we dated for 2 years. I also made the first move with my boyfriend now and we will be almost 3 years together. Ladies don't be afraid! It feels good! Sometimes we miss opportunities with people because they are afraid to approach us and vice versa.", "halienoel.nyc": "🖤🖤🖤🖤 @eclecticinthecity I think she’s right up your alley as far as talking love, dating and sex... also conversation style (see what I mean in her YouTube). I love her! I think you would too.", "ruaimaa": "So edgy ugh 😻", "valdiviez": "😍", "helloimlexiee": "Where r these boots from?!???!", "barelya90sbaby_": "It's fun making the first move. I mean yeah you get nervous but shit, fuck it lol, go right ahead.", "_madammimi_": "Yaaasssss", "compulsiveintrospection": "I used to but I had to stop. No matter how cute someone is, if the mind and behavior don't match, I fall out of like super quickly. I used to pull dudes and realize relatively quickly that I didn't actually want them. So now I slow my roll and get to know people first. Problem is, guys almost always initiate before I know them well enough to figure out whether or not they're what I'm into. It's a headache and a half.", "mickmackpattywach_": "where’s u get ur shirt??!!!?!?!?", "imheatherlynn": "Did that twice last year 😒", "amckoy26": "Damn Jared is a lucky man", "milliedeloro": "@gq.rose how I look at my prey 😂😂😂😂😭😭🤸🏽‍♀️", "anitaaa359": "@lindsaykuschert", "nailitgirl123": "I do all the time...still single 🤣", "african_princess_alz": "@dark_skin_rue I feel like I could show signs that I’m interested most of the time I make it obvious I’ll be smiling like an idiot 😂😂and staring but making the first move is not my thing I’m the type of person that will be like if you don’t talk to me I’m not even gonna try but I’m like that in general with everyone I’m terrible 🙈🙈 watchu think about this topic ???", "slimes.dayz": "bad advice. never do this ladies.", "freakyrobber": "After seeing dem sexy yella legs open up... I'm shooting like Kobe fuck a field goal %💯💯💯", "forevertamiigee": "I was just talking about this the other day!", "jaysart_official": "🔥", "deathbygodiva": "I’ve done this thrice and got curved each time so that’s that guess I’ll stay single.", "secretlyred": "❤️❤️❤️💰💰💯💯✔✔BEAUTIFUL & SEXY✔✔💯💯💰💰❤️❤️❤️💋", "ayesha_mae2": "Advice I need to listen to!👏🏾", "elbeautyblogdeeli": "In my case I always got rejected so I stopped doing that 🤣", "heylissamonet": "🏀🏀🏀", "_kokomo": "@tenecia_d1216 👀", "ash_samples": "Was this research done in a strip club where it’s more profitable to approach men... I don’t see women doing this in the grocery store", "yayitsamarie": "I shoot my shot all the time. Lots of air balls and bricks. But the alternative is just taking my ball and going home. Where's the fun in that? As a wise Prince impersonator once said, \"Shoot the J!\"", "alaxes": "What Are you wearing?!? It's beautiful!! Is it a dress you cut? Did you buy it like that? Please share!", "naturally_kell": "I’m a medical secretary and there’s this good looking man that comes by my job pretty much every other day to drop off packages 📦 I’m feeling him and i know he’s feeling me too. We’ve exchanged a few “how are you’s”, and “how’s your day” but ultimately I’m a bit shy and can’t muster up the courage to say anything intelligible never mind witty (I pretty much just blush whenever he’s comes around).I want to give him my number but i want to do it in a cute unique way. Any ideas Shannon? Help me girl! 😩🙏🏽♥️", "ivyprosper": "I made the first move by telling him how I felt about him, that resulted in a 4 year relationship. Although it ended....he was the love of my life. Women shouldn't be afraid to make the first move. By the way, that outfit is fire.🔥", "herhighness_lc": "There's just something about you that is just so lovable❤💯", "ogunsheye": "😻😻😻🔥🔥🔥", "heydymondhey": "Whew chileee 😩", "mrz.biggz": "OAN can I barrow your outfit I'll give it back lol", "dariussinclair": "My wife made the first move. I thought she was too fine, she said many guys are intimidated by her looks. Going on 3 years now.", "msnova11211": "Honestly I feel it's better for men to make the 1st move. Men like a challenge. When women make the move the challenge is gone and they just don't act right.", "soulful.unicorn": "Rejection for one and most relationships initiated by women don't last", "lifewithlillymay": "I’ve always been the one to make the first move. I’m the type of person you want then get it. Doesn’t work every time but it does have a higher success rate when I’ve waited for them lol", "henrigram1": "Wow🌸", "drdancake\nVerified": "Verified", "amy.argyle": "YES!!! Why wait! Guys seem so timid nowadays!!!", "iwantbenjiluv": "I support this ✊🏽", "shariair_shihab": "Very funny", "brisonc8": "🔥🔥🔥🔥", "queenchewbacca": "I did. And we're coming up on one happy healthy amazing year. :) But I've also been in situations where I did and I ended up in some of the worst situations of my life, so it's touch and go. 😂😂", "_naturallyreagan": "You so finnee.!!!! 😍😍😍", "yesssitseyerisss": "@shanboody THAT LEGGGG 💜IS EVERYTHANGGGG!!😫😍😘🙌🏼", "thepaigester": "@rissa_bby", "joana_fatondji": "I am being more bold this year.", "1quietfire": "This should be the new standard. This is absolutely vital in the age of #metoo. The work of dating has to be at least 50/50. No longer can we have a situation where men do all or most of the work. Women have to send the signal that lets men know that it is ok to be a man....and take his role. This especially true for situations involving co-workers....due to miscommunication & harrassment policies (dating a co-worker is not something I would advise doing....but if you must....the woman has to lead to avoid the BS). This also tells a man early on (even before a relationship blossoms) that you are making his life a bit easier...and that he can be at ease with you. Huge plus. Definitely should be the new culture.", "sweetqueenbeas": "Off topic I love your shirt where can I find one like it?", "nat_lee_": "@chrisannecorrea", "heart_spxo": "I can take charge but usually guys perceive that as desperation. After knowing a certain guy socially for sometime, told him he was cute and I asked for a kiss (I've wanted to kiss him for a while, so I thought go big it go home) anyways, we kissed and talked for a bit then I realized he was acting as if I had to run after him....so i disappeared....🤣", "ameliakahlo": "bomb! 🔥", "wholesome_holistics": "YES! ♥️♥️♥️", "iamzflo": "Damn right Shan 🔥🔥💯💯", "prettylittleliar087": "😯🤤😍😍", "electriccladyy": "I’m mostly on apps and 9 times out of 10 I’m the one who makes the first move. I love when they make the first move,though.", "shi.is.art": "I made the first move. It’s been almost 9 years now and we still going strong!", "mon.yee.85": "@betterlooktwice 👀", "_alwaysbeautty": "I’ve done this and I failed not happening again", "marinajustinee": "@taytayresa find ur dream man and make it happen", "kekoadestiny": "I tried that first move already, and it didn't go to well. He avoided me like a PLAGUE!!!! Oh well...wait till I get hit on then.", "slimfreck": "But can I get details on the thigh highs shannnn", "bluehoodiez": "I'm too shy to make the first move. 😔", "more.fiya4eva": "Can you add wife to your bio now or Nah 😍😂", "_danniewalker_": "😍😍😍", "amber_denay": "@justmekenna you’ve been telling us this 😊", "thejazzynation": "Yup! We wouldn’t be together today, married if I hadn’t asked him out. 😍", "redirect.to_empris.durden": "I do and usually I get friendzoned", "i_hart_nerds": "I always have to make the first move. Shed my fears and insecurities and go for it. I have been rejected every time. After awhile it gets in your head and you stop trying. I lost a lot of confidence and self esteem unfortunately. I keep on going and pushing through.", "intvlt": "Shan can you talk more to maybe a month of practicing confidence in yourself and relationships or something? 🧡🧡", "lizbeth_daza_lezama": "💙🔥💎💙", "mr_mjg": "@dylan__block", "jmtzi": "Made my move and we are married for 10 yrs together for 11 and have a beautiful son. ❤️", "mj_nabil": "🔥🔥😍", "ladydeadlock": "@sierrathompson_ be fierce", "timishaaa": "So true!!!", "dannijcoco": "Its definitely worked for me in the past", "sandalion3": "A man who finds a wife finds a good thing!", "jadarashawn": "Beautiful", "jenyas": "❤️❤️❤️❤️", "londonluxdior": "#demlegsdoe 😍", "shesthebrunette": "And how did you know that I needed to read this ?!", "prettydopehope": "Precisely why I approach men. I’d rather risk rejection than a potential flame👅", "ulondaroshelle": "That’s how I met my husband lol!", "clairekakande": "I need to do more of this ✊🏾", "msambreezy": "I have no game 😫", "klumseykatie": "When the queen walks into the room 👸🏽", "lasandia28": "I do... but it usually gets me in trouble 🤣😉🔥", "ashleybrantley_": "Being bold in 2019! ❤️❤️❤️", "rommma11": "this caption actually gave me confidence and inspired me!!!👏🏽", "b_dnmde": "🔥❤️", "mkzprince": "Me @kelseycoxy", "sasha__alexia": "Hot damnnn! 😍❤️🔥", "brokedevonaoki": "I love this picture BC you look super amazing but it's also super funny bc it looks like you have one long leg and one short leg", "_noelleon": "Yep!! Go after what you want ladies.", "idbracelet04_4l.awly": "damn 🤕 @shanboody", "man.seeking.mania": "🔥 🔥 🔥", "undenyabull_": "I am", "aarnoldphotos": "I have no problem making the first move.", "e11vin_1990": "🙌🏾❤️", "mzsupersoulfighter": "I missed a critical chance a few days ago due to a mental battle as to what to do in the moment but maaan did I want to shoot my shot. Oh well, there will be another chance😩", "tahliagina_": "I was bold with my man, now we’re 3 years strong 🥰❣️", "_mel_i": "🙌🙌", "thisonereddraggonfly": "Did you make the first move with your partner? @shanboody", "itzsonewnew": "👏💜👏💜 Come on thigh meat!!! And yes this year I'm committing to being bolder, more aware & intentional than before!", "charleenonline": "@therealmattkemp can you read her caption and then respond to my DM? I want to see something 😘", "creatorcass": "I’m never afraid to shot my shoot", "ebonysuga": "🤩Gurlllllll okay then!", "jcashdaboss": "@shanboody soooo beautiful & nice legs😍", "its_me_carisa": "I was the one who made the first contact in my relationship and it has lasted longer than any other relationship I have had 😻", "thewesleymadison": "Yes where and how do I get all these strappy apparatuses for my thighs in high boots? Lol u look bomb", "mo.fitmom": "I contacted my current partner first. We’ve been together for almost 4 years 😊😍😘", "myrella.victoria.coelho": "@mar_mami should follow her 👏", "unwanted_moonchild": "Damnnnnnnnnn 😩 #goals", "healing.grayce": "As a woman who regularly initiates, it is true, I have a 100% response rate 😂😂😂😂😂😂😂", "hildat": "@annachoiniere", "libbymarquee": "Owwwww", "__thrumyeyes": "I ain’t never been scared 😂", "femi_bk": "Nope not doing it!! Because after you make the first move even in messaging online or from a dating app it is expected for you to make the first move for almost everything from making dates, to reaching out to having consistent communication. To the point where the guy is not going to take you seriously and not try to really put energy in developing a serious relationship with you! This is what I have seen from my personal experiences from experiences my friends had told me and experiences for male friends have told me and even from statements made by relationship experts have stated.", "eastafricangypsy": "@fm__xo yolo", "jacleen23": "My ‘resolution’ this year Is to step out of my comfort zone, and start asking for what I want, and not settling. So far it’s gotten me a rather significant bonus at work, and a lover who now understands my expectations. It’s been very empowering!", "kannes92": "Seriously needed to hear this!", "aye.alexandria": "You’re so bomb 💖", "keikoel": "Always!", "princessmorghan": "@sydney.jade", "mr.pharaoh": "Ayeeee ShootYourShotSaturdays!! @shanboody 👏", "brooklyndj9906": "😂😂I've been always bold and to some intimidating. which is fine, easier to weed of the weak😂🤗💖", "eliannas": "How can you be this hott 🔥guuurl, I need to meet you IRL!", "the_cro_mj": "💣🔥", "msfaithelizabeth": "Still fan girling over that shirt", "spoutniki": "🔥🔥", "sorelleamore\nVerified": "Verified", "monsterballmakeup": "I have always made the first move 😑 @rahfaeldelaghetto", "yourstrulybianca": "I’m a starter on Team #Shootyourshot", "trendsettatiff1": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽", "queenkiki85": "What do you do if you like making the first move but your S.O doesn't like when you do? @shanboody", "remyindc": "Just bought some thigh highs because of this pic🙋🏽‍♀️", "elle_.elle": "I shot my shot twice this year, and have been curved. I’m chillin. It’s not my time", "theblossominglotus_": "@blackfruitinternational you just spoke this truth at the workshop!!", "d.la.rose": "@htle.jpeg", "confectious86": "I like too, it’s kinda exciting and playful.", "aliciaroughton": "Wow I wish I read this last night when my dumbass was too scared to go up and talk to someone", "amandaloist": "Do it ladies! I made the first move and I’m now in the best relationship I’ve ever experienced! ❤️", "diananaomia": "SHOTS SHOT ALL 2019!!!", "jessimelani": "You👏🏽better👏🏽come👏🏽tha👏🏽rough👏🏽", "angelmarvoyiemanneh": "I did and it back fired. He was my manager so idk if that counts. 😂", "sweetnande": "Well damn 😍", "nextlevelinprogress": "Interesting post @shanboody 👌", "mystivaka": "That would be such a GREAT video idea, ya know👀", "jonesingformorejones": "Honestly this has NEVER worked out for me and usually ends in disaster lol or a semi interested man", "lsintijal": "Yes! I've always been the one who makes the first move :D nothing to lose haha", "lady_jadee": "Very true. 👌🏾", "sdf2030": "My number", "loveeiriny": "😍", "joey_too_smooth": "*Lays back eating popcorn* .... Also thigh game on point, I sees you 👀", "jilliannugent": "@clevermoniker guess I’m 1/10 🥰", "bunnybri7": "I believe in girls making the first move. I don’t understand why people always think the guy has to.", "drewkyre": "@__jaylyssa", "joliemontetb": "A GODDESSSSSSS", "nikkidee84": "love that outfit❤️👍🏽 And yes 2019, going for the bold..😎", "samantha_g14": "Ya vez! @imbriseida 💁🏻‍♀️", "andrea7mares": "W💘W", "slabrosc": "Respect the push you are giving all these guys out here. We must shoot our shot, because as mentioned.. the reality is there’s absolutely nothing to lose 😇", "laurdups": "@jmpana ain’t that right baby?", "lissamercedes": "Serving everythang!!!!!✨✨✨✨", "honeyl3": "i have non issue making the first move.", "sophuggit": "Makes me want my curls back 😭 beautiful", "ipromisemusic": "Talk2dem! 🙌👏", "realigkells": "Lookin 6'8", "thickgrlscloset": "I did with me guy!", "heyfoss": "Not surprising you’re 2x more likely to get a response. You’re the prize.", "reallykidding": "Woman, should give this considerable consideration. For these reasons. It moves the process along. I recall this: people will only show you....what they want you to see. Within the notion of first reveal ‘showing interest. This places initial control of the narrative. The known factor is you have expressed interest in him. How does he feel about that. If shared interest. The process of reveal and consistent behaviors begin.🙂🧐 this a good thing. Enjoy 2019", "rivatoot": "Why does it seem like your right leg seems 80x longer than your left. 😣🤓", "jennyfraz": "I feel like I have to carry the conversation 90% of the time after the man has messaged (because they don’t approach in public lol). So, if I already have to carry the conversation after he simple says hello, I don’t have the energy to also approach him.", "jennijanks": "I almost always initiated with guys in my 20s and I pretty much ALWAYS got what... I mean 😜who I wanted. Very much the huntress and it was glorious! #justhuntin2019ladies", "villageturtle": "Ok wear these boots from and do they stay up 😭 my legs disrespectful", "courtmoves": "I love making the first move, I feel like the ball is in my court and I can choose where things go!!❤️ also. Yeeeessss thigh!!!🔥🔥", "evelinaweary": "I asked my boyfriend out and I’m so glad I had the courage to make the first move 🤗", "annick.huygen": "@sarahvanzaalen check ff deze caption die is voor jou meid", "sash2legit": "Were can I shop this top?", "honeycoated_almond": "The shirt! Where did you get it? Oh, and yes to the first move. What's the worst that can happen? @shanboody", "daninicolemusic": "I always do!!", "mariah_crawley": "Yessssssssssssss 👑", "amaazingsonia": "I knew this guy had a crush on me (I'm late 20s), but he's extremely shy, so I did it! And we've been together since, he's so great, and I'm so glad I moved my ass, as I usually never do anything. 😘", "shamirawest": "I definitely need to be more bold this year @__justbeyoutiful__", "doux.blaspheme": "Ive done it a few times and have had very memorable moments and some even lasting friendships. I love it. But its a thing youve gotta trust your intuition with. 🙏♥️", "badgalari26": "Love this modernized African wardrobe. Beautiful @shanboody", "ranesespieces": "I stan 😍", "eyesisis": "Shiiit our nails be the same colour 🦋", "3nigmatic_dope": "Love the look queen 🔥💯", "iamjypsywhite\nVerified": "Verified", "ashtonlea": "QUEEN 👑", "therealelijas\nVerified": "Verified", "lavoyce": "I’m definitely gonna try to be more bod", "just.jayjayy": "YESSS, it’s 2019, y’all need to shoot y’all shot", "momohamed121": "I'm usually the bold one. I hate wondering \"what if\" just because I never said anything. Alsoooo, where'd you get that top 😍", "princesameena": "I did and we’ve been happy ever since ! Sometimes their stuck and tree and you gotta help them get down 😂😂😂😂", "tisworthit92": "I WANT TO! I REALLY DO! I actually would. I have 1 guy in mind. But I've never approached a guy and if he's not interested I'm going to feel really dumb and embarrassed for trying.", "mizzstace": "Sexy", "bridget.k.parker": "I would if I felt the need for it - I would love to “feel horny” as often as my husband, but I just don’t & he gets frustrated when I don’t initiate; but how do I initiate if I’m not feeling it?!?!", "ptahbeato": "That's how u coming came Shan? Ok", "culturefuzz": "Booommbbbb ❤️🙌", "aryeharmony": "Hunny I grew tired of making the 1st move lol. I understand that they sometimes need a little push, but still there's a way to do it without us being 1st. Also, I had and still am learning to let a man be a man. I want to also state that I'm not against woman making the 1st move, but we need to let them come to us sometimes.", "denny.cakes": "Shoot your shot sis", "w.auguste.m": "@shanboody (not an offensive question) but who approached who out of you and jared", "ave2noondelite": "I need to be....😩", "gq.mj": "🔥🔥🔥", "oaklynnwoods": "If I’m interested I let that guy know haha.", "coffeebeandean": "@bigdaddyep", "maloney_09": "I made the first move with my current partner ! and its been 7 great years :) ❤️🙌 do it ladies!!", "hipster_j_": "Being bold all 2019 🤣🤣🙌🏾", "st3phanie_marie": "😍😍😍😍.. yes, I make the first move if I’m super interested in him. Lol", "claujograms": "Definitely need to work on this 😐😰", "the_k404": "I mean hello lesbian death bed", "kadifa.nai": "❤️❤️❤️❤️", "msfitstoner": "That inner thigh!!😩😩😩🔥", "emz.ben": "Wow I love you Shan 🔥💖", "joaddeo": "Love this! #bebold", "dion_mariewhite": "Definitely nothing to lose 💛", "tomiwarhoda": "Is this a Bumble ad?! Lol", "giordanazed": "I make the first move. It’s exhausting.", "_allthatjazzy_": "Yep shoot your shot ladies.", "kenya.bradshaw": "I love his top can you share where it is from?", "contemplatingnisa": "I definitely initiated things with my significant other and 4 years later we are still going strong.", "mayasworld\nVerified": "Verified", "luthiencia": "Damn 😍", "_visuals.s__": "👑", "trishlindostyle": "🔥🔥🔥", "badbalderene": "I NEVer made the first move. I was always shy BUT not anymore. I’ll make the first move, ask a guy for his number, ask him on a date, all that. I hate the “wait for a man to ask” nah i know what i want and I’m either going to get rejected or it’s going to work in my favor. Energy 2019 *making moves*", "enjoyjaredbrady": "Leg! 😛", "ronejae\nVerified": "Verified", "ashleyasshire": "Nothing to lose, values even if I fail, I’m going to do it fast! Switch it up! Thanks for this reminder!", "daijahdidit": "Looking like you’ll get a nigga in a leg lock 😍😍", "kalievans": "Every time I make that first move, nothing. No call, no text, nothing🤷🏻‍♀️", "jemiie_ovoxo": "Yum honey ❤", "8thegemo": "Yas. I totally prefer to make the first move. 🖤", "september_bleu": "This caption and photo is exactly the energy needed for 2019. 🔥👏🏾", "rubywanomi": "I always make the first move 😎 My friends call me crazy for it.", "simod_bond": "Always with the right amount of sexy. I got mad respect for that leg and I got mad respect for you.", "therosecharice": "I’m living for the thigh action", "devlinwilder": "I would say it’s actually about 1/200 women who initiate contact. It seems to be very rare. I welcome and applaud a woman making the first move. Honestly I prefer it.", "ggyvethe": "Well a friend made a move on a guy last night at the bar. So he has 5 kids and unemployed 🤦", "scorponic": "Yes to this!", "hey_fania": "A look🌻🔥❤️", "alyssa_neill": "I pretty much always have made the first move! And this photo is 🔥🔥", "carolsvntos": "All relationships I ever got into I was the first one to make a move 🤷 I think it's boring to wait", "iamher_monica": "Girrrlll! ❤️", "labeautyologist": "You have such a masculine energy I love it.", "karzerooo": "🔥🔥🔥🔥😍😍", "veronicamariie": "@abbigayleb @alexandrariveraa seeee!!!", "jdanistheman": "My first interactions with women tend to go better when they initiate 🤷‍♂️", "sweetpeachyboo1920": "One of my biggest fears! But definitely one that’s a personal goal for me.", "iamzetamorrison": "Every single relationship I’ve been in.. I’ve approached the guy. So that’s true", "tacago": "Hot fiyah", "mango_cakes_": "@curious_julz8 🔥🔥🔥", "melissahobley\nVerified": "Verified", "yomarielle": "Shoot your shot all 2019💯🤪", "k_emleyy": "I’ve definitely found this to be the case!", "bashua12": "I sure do make the move first! Been with my man for a year now, it would have never happened if I didn’t make that first move 💯", "pollyelizaa": "A queeeeeeeeennnn", "jellinotjam_": "I been bagging these n*ggas", "dealsforyouz": "Cool", "black.silk.gkeume": "yep...no shame in it.sometimes its mutual and they are just scared of the possibility if rejection.", "hunnygooeydrizzledrip": "The fear is being denied or dismissed when u do finally initiate 😣", "mariammena_": "Sheeeeesh girl 🔥🔥", "urperfectverse": "I’m so happy to see this photo again! 😍😍😍", "natasha_simgr": "Okkkkkk!", "agirlhasnoname_rdh": "Okayyyyyyy 😍😍😍😍😍", "nomicaojeda": "I Made the first move & now we’re married with 2 kids 😊😍🙌", "mrkeys24": "Exactly. We’ve been getting denied for years 😩😩😩😂😂😂", "sourirescedes": "I always shoot my shot, Sometimes you gotta be the chooser rather than the chosen lol", "juicyeyelids": "Your thighs give me life. I don't know how to explain it, Shan, but your thighs just scream REAL and FIERCE. Thanks for being.", "bmuah": "🔥🔥🔥😍", "harpersworld_": "You look amazing 😍", "helene_lalala": "@mrluben heard that!", "danowensmgmt": "⚰️⚰️⚰️", "joyceoladipo": "Congrats on tour beautiful wedding. Wishing you fabulous years ahead. Loving this shot of you, so natural and beautiful. I’m all about bold moves too, no more waiting to get what I want. Thanks for sharing.", "itschiaracami": "@giorgiarichards signsss", "raynuu_": "Ouuff😍😍😍😍", "tamtill": "Ok serious question @shanboody did I see you in mean girls???", "m.salgadoo": "@ivesaur 😏", "noheatups": "@adrienne1215 das me.", "harmonyright": "I've always made the first move! It's great", "acemxo": "Energy 🙌🏽🙌🏽🙌🏽🔥🔥", "simply_qaa": "I always make the first move lol I'm a go getta hahaha!!!", "smah2k": "My dignity lmao", "meganjoymay": "You. Are. 🔥🔥🔥🔥", "ashlemichele": "My dignity and self respect.. 😕", "_britnireneeart_": "Haha! Funny, just did. 😂😂", "oops.if.she.wasnt": "Yes mom. I mean ma’am 😅", "majorrkeys_": "Well this is good to know.", "meversesyoublog": "Here for this!", "nelllaaaa_": "girl the outfit deetz tho lol", "veeteegee": "Absolutely nothing! New energy all 2019 🤩", "quinones_nathalie": "I am that 1 out of 10 to make the first move 🤘🏽"}