{"poloralphkari": "That toe is sexy af!!! Lmao", "rothdollasign__": "CARLITO!!", "jookinjeff": "Men looking at camel toes is like the equivalent of girls looking a dick prints 🤷🏾‍♂️", "tonysoulworldwide": "UMMMM, YAH❗ #CAMELTOESMAKEMEHUNGRY 😆😅 😘😘😜😜😛😛💋👅👅👀🤔 #VERYSEXY 😁😉😎", "live.it.up777": "They just are what they are. We all have bodies. Who gives", "yungmaryk": "My pussy too fat and I’m too thick so camel toes are inevitable for me, if I didn’t wear stuff bc of a camel toe then I’d always be in a dress🤷🏻‍♀️", "anatolafinau": "@polygrrl", "takethewhisk": "@kikkomunga these look like the shorts you bought", "kingsiegz": "I think a pretty camel toe print has a lot of sex appeal", "godgivengenius": "You got thiiiick @shanboody 😳😁😎💪🏾", "uncookiedifficile": "In this world now things have changed so conversations and things of importance should change. For example: in the past meeting a woman you would ask are they married or have a boyfriend. Now it should be normal to ask if a woman is into men or women or both. I tried asking this to a girl getting back in the dating scene and she was offended and said I shouldn't ask that question. I also ask women to tell me their age, these things aren't wrong never should be.", "caliphsaad": "Damn son! When i see camel toe 😂", "rainsupremeny": "It's one of my favorite things about new leggings 🤣", "situation_4800": "They ARE the Epitome of SEXY", "yoobiedoll": "Natural camel toe such as this is sexy for sure it’s just the power of the p showing itself lol but that forced or camel toe undies business is just weird", "sarahjfindlay": "I think it's subjective like everything. Guy A might think camel toe is hot and Guy B thinks otherwise. It could even be more specific in regards to if they find the whole package of the person attractive. Guy A thinks Gal A is fine so he likes her camel toe but he thinks Gal B isn't attractive and therefore doesn't like her camel toe.", "whaddupcrudup": "I’ve definitely had dudes staring down there like they would at cleavage or a butt... weird", "clowicious": "I asked my husband and he said he does find it a bit weird looking to see it in pants like that but he personally doesn’t care either. Me-same; it’s a little weird but whatever floats your boat 😋", "ameliafasth": "This is so interesting, idk, can't make my mind up about it", "rustypup49": "rustypup49 @itsarifitz can say what she wants ;D but some things are just not cool. If u don't believe me, chk out https://www.youtube.com/watch?v=o-50GjySwew See the light???", "miralrm_": "@shanboody tbh I don’t like camel toes cuz they look hella weird n the annoying asf", "blackberry_cherry": "In a private pic to ur lover, but not a fan of the camel toe in public.", "peachxspit": "I could not care less", "gonikigo": "I think it depends on how much of the toe is there.... mines is too fat.... mines is low key a moose knuckle 🤣😂🤣😂 your's is good.. you are fine...", "rimipi__613": "I like like a hint of Toe. Just enough to trigger the imagination. When you go full on Toe, I think it defeats the purpose. That's if the purpose is to tease, or entice. Now if that's the way your clothes fit, then we need to have a different conversation.", "sedemka": "I‘ve just watched your last video on Youtube and preordered your book. Just know that you‘ve got a huge fan here in Germany 🙌🏼 keep up the great work🖤", "alex_yng": "@peachglider I THOUGHT THAT WAS OLLIE HAHAHAHAHAHAHAHAHAAH", "coololiveoil": "I don't care I'd show it if I want to", "notcamelliaortiz": "Yall are so fine. I can't.", "misshypeme": "NOPE ain't nothing sexy bout a thirst trapping camel toe or dick print.", "rainbowandpinkcrystalmojo": "I dont want it, but what can we do, except adding padding. Cant fight it", "goddess_sunflower_yoga": "I’m disgusted by the sigh of a camel toe.", "nichylclothing": "Can’t stand them (to see) and to have one is extra uncomfy (IMO)", "hellochrissmakeup": "The toe just exists, they’re neither attractive or unattractive to me.", "israeltorrellas": "@shanboody hayyyyyy. I like what I’m seeing", "monroeblaque": "♨️♨️♨️", "deonwarrenmark": "Lol", "jamarimichael": "I find it sexy on someone I’m dating. I’m indifferent to it otherwise.", "nochlives4ever": "I find camel toes extremely attractive", "lesbianlove246": "Love em", "iamtwuan": "🔥", "sweetlifeofzachnocody": "Case by case situation", "iam_lalah": "Let's talk about how thick you look in this photo though Sis. 😆😆💜🙌 @shanboody", "secretcurlsociety": "Here for the comments...", "bbyyygirllll": "It’s okay as long as you show it with class. Because some people dress up and it shows but it looks cheap and unflattering", "thecharlessmith": "Do you think being able to see a guys full on dick print is sexy? You might look at it desirably for a moment. But if your man was walking around that way it's look a bit ridiculous no? I think it just looks sloppy, not gross, just sloppy. Being able to see the V-shape is fine but camel-toe is too much", "gendernonconforming": "It’s equivalent to seeing any genitalia through pants.", "macjay5": "Cameltoe sexy af", "bambi_est94": "Shiddddd ain’t my fault my puss fat 😂", "chisamaku": "Yall red", "tatianna.peters": "Personally it makes me feel uncomfortable but if a girl wants to rock that shit LET HER", "itsarifitz": "y’all FINE fine", "spicypleasure": "Attractive people such as yourself have to do a whole lot more than that to be unsightly", "joey_too_smooth": "You know I didn't notice until you asked the question lol, but I say sexy, it's pelvis cleavage", "thetracymoore\nVerified": "Verified", "ilovejayana": "@sosucculent.sam peep the comments", "bbxx.world": "LOLZ love this 👌🏼❤️😂", "ritual.space.magik": "I think it's just fine as long as your letting your vagina breathe! I think too tight could cause irritation and inflammation if its sweaty AF. Haha", "kayconleche": "I feel like they're neither sexy nor unsexy. It's more like a really interesting focal point.", "babygirlvg": "what are you and your husbands thoughts to this question?", "sostok": "Most parts or glimpses of a woman are sexy to be honest", "iromealot\nVerified": "Verified", "jixerkai_": "I think it’s cute tbh. Lol y’all sexy sexy", "mandajtate": "Beautiful couple 💜💜💜", "godaffect": "Just saw a camel toe at the neighborhood Aldi and yeah I’d say it’s sexy.", "dnicesanchez": "i think camel toes look like vagina wedgies so ima go with a no", "coach_burd": "They're Seeeeexxxxxxxy 🤤", "andreb407": "Love this❤️", "laik_show": "Definitely Sexy! My fiancé is all about on me and other women‼️", "yeahnotheo": "i feel like this is equiv to a man wearing tight pants 🤷🏼‍♀️ except vulvas are pretty 🤷🏼‍♀️ but uncomfy sometimes...", "le_ahalex_a": "For some reason i dont like how it looks, i think it's its influenced by my desire for symmetry and neatness as a human, unrealistic media portrayals of women in clothing and the tendency to oversexualize ourselves and others unconsciously and consciously at times so that when i see it on my self or others i feel a bit of dissonance that i quickly skip over mentally cuz i feel bad making the judgement.", "audi_nett": "In Belize .... they are considered sexy and seen as a plus to men", "cazh.xian": "@geonnacharnae", "issatrae": "😂😂😂😂😍", "kleidendrew": "Own the toe. Why are to be ashamed of the 2nd pair of lips? I hated when dudes would say things to me. I wish i didn’t care as much then. Own the cooch", "grafziggy999": "Camel toe can be super sexy but depends on whose it is.", "_stacieb_": "I don’t see why people drool when there’s a dick print but when it comes to camel toe, it’s a joke or something unsavory.", "3xotique": "What about the third leg imprint ?", "smithgina7": "No! They are not attractive", "reallychyna_": "Hotties 🔥", "blueissuperior": "Depends on context lol", "shantel_fla": "I dig a good camel in some leggings can’t help the slit!! 🤷🏻‍♀️😋🥰", "mellow143": "I'm always trying to adjust my pants because of how embarrassed i feel having my vagina outlined. I try not to care because i literally cant do anything about it. I dont even get why it happens . i guess it's always jsut made me feel too big. But that's stupid", "just_leash_": "Idk why but I’m uncomfortable around people who have camel toes ...... and I’m at peace with that", "sera_knee": "You guys are twins!", "jonnydavis77": "I don't tend to like it like.", "nylon1984": "I do not like it at all, and isn't uncomfortable? It's like a frontal wedgie.", "queendefinesse": "I love camel toes !!😍😩👏🏾❤️❤️", "curlella": "Sis no matter how much I try I always have one 😫😫😫😫 😭", "pizzancurls": "I have a hard time avoiding one regardless of what I am wearing. Jeans give me a crazy camel toe. I’ve come to embrace it for what it is", "myishia": "Ohhhhhh", "timchantarangsu\nVerified": "Verified", "eibhlinmy": "I’ve decided yes, they are. Mostly because I decided to embrace mine whenever she comes out.", "love__monn": "I believe it depends on where you are at. It’s seen in a negative way but I mean us women can’t really hide it all the time. If you’re at a more laid back thing like the beach, clubs, bars, etc., it seems fine. However, a conference, church, school, etc., it seems more people stare and judge for it 🤷🏻‍♀️", "gsnapsmusic": "Personally, it’s uncomfortable for me, and I teach fitness so i LIVE in leggings and sometimes they have a different plan for me😂 but, in regards to the taboo topic, I tend to feel embarrassed if I have a camel toe.... but why is it sexy if a man shows his “imprint” In some grey sweats?? but women are trashy if they show camel toe 🤷🏻‍♀️ society has made it hard to be “confident” in such a topic. But thank YOU for being such a confident woman and breaking the molds ❤️", "zachariah_official": "Are boners sexy? Lol. Tbh it really depends, but they don't really do much for me usually", "jess.tarts": "Camel toe = not sexy", "nessa0407": "Its just kind of crazy how we over glorify body parts. The toe is more likely going to make an appearance in leggings or swimsuits, & it is what it is. I don’t think you should go out of your way to make it show like at weddings, funerals, church, or work. And definitely getting a fake one is cray cray. If you really want a prominent toe just eat greens & cornbread on a consistent basis & I’m sure you’ll get there, lok", "mcmxxiv": "I think it should definitely be embraced; and it should be respected on that persons choice to show or not show and what I mean by choice I mean hide or allow this involuntary thing to just happen. I think it can be sexy and equivalent to cleavage. I also think it’s kind of odd if people’s eyes just directly drift to your crotch 😂 but hey we are all beautiful and we have features we like to showcase so why not.", "avidastar": "He's holding a 🍑 in each hand. Yaaasss! Such a beautiful couple! And people have always made me notice my camel toe. It doesn't bother me but definitely bothers some onlookers. 🤷🏽‍♀️", "laina085": "Beautiful couple ❤️", "chasitygetsitright": "I dunno... 🐪 toe kind of reminds me of a wedgie... except in the front.", "ciera_danyel": "People are literally purchasing them now... I think that speaks for itself.", "songspiritsoul": "To me it can't be avoided... Gym and leggings always sees my camel toe. Learning to accept it is key", "miss_fit_foxxy": "It’s a visual of what is under the pants. Fat lips, no lips, slim lips..... it gives a man a sense of what he is going to slip into.... I don’t think cleavage is the same thing... vagina is more private hence why it’s covered and can be shown just a little...", "luvhimorhatehim": "Some are some are not to each their own", "fluffykilburn": "Guys sunscreen is sexy. Lol", "toreebby": "Never thought it was cute 🤷🏾‍♀️", "itsmama_g": "If we can the see the shape of a mans dick and find it attractive through some god damn ugly ass sweat pants how can it be not attractive to see the shape of a woman’s eternal sunshine through some sexy ass biker shorts? Lol", "labeautyologist": "Just a body. Everyone has one.", "tumtum_aisake": "I can't control it, my boyfriend says I got a \"prominent cooch\" so I'm just trying to accept it as sexy 😂", "kivisunshine": "Ionlikeit. lol", "rdlifestyles": "Do I find it attractive not necessarily. I'm more so like, \"oh, ok cool,\" but not focus on it. More so it's an attention grabber. It tends to create conflicting emotions in me because protective instincts tends to kick in also. What's attractive to me is feeling like you're comfortable with your body around me. But then if we are in public, the sense of how many others are feeling that way and thinking that gives them the right to get direspectfully comfortable(creating uncomfortable situations).", "nomicaojeda": "Love a good 🐫 toe 🙌😂. I always have one at the gym but ya know yolo... 😊. If you don’t like it look away", "catherineserendipity": "i am always so worried about it, if i have one i try to cover it up or readjust.", "living.as.nick": "As long as someone is comfortable honestly that's what matters. If they feel sexy, then the camel toe is sexy! 😁", "life_as_we_know_itms": "A camel can be attractive. But there is a point where it can look uncomfortable like its a full blown wedgie. But done with good taste it most definitely is", "kaylalala.tv": "You guys look genuinely happy.", "mama_sid85": "I was going to post this question on my IG! I came home from shopping, looked in the mirror and was embarrassed. When I asked a friend if camel toe was a good thing he said, \"hell yes\". I still felt embarrassed and donated those jeans.. I'm watching this post 👀", "jideeguakun": "For me no just because they always seem accidental. Like the girl doesn't realise and everyone doesn't wanna come across rude by saying anything", "kazzikhai": "@shanboody i will tell you yours is sexy", "ttebroc_t": "Y'all better be wearing sunscreen!!! 🤣", "heliaxo": "Unpopular opinion: camel toes are trashy", "vogueandcode": "Not sure but I’m loving this outfit 🥰", "browngirlinrecovery": "I think it’s tricky to make a rule around this. For some people carrying more weight, camel toe shows as soon as they don’t wear loose sweatpants— I think it’s unfair for them to be shamed for wearing tight clothing when the sport or mood calls for it and for thinner people to be able to wear it. A pelvis, nipples- why the shame in it, if most of us have them?", "johsotnas": "All vaginas are sexy that’s my 2 cents 🌼❤️ embrace your own sexy!", "empress_renegade": "I have a prominent camel toe and it doesn’t make me uncomfortable I mean it is what it is I can’t take it off and leave it at home 🤷🏾‍♀️", "lex_malone": "A perfect match 😍", "aunt.dana": "I'm not sex expert. Just a woman who is attracted to woman. I find it very sexy. A lot of women seemed to. Embarrassed by them though.", "itsmeganadonis_": "😊", "munashe_moon": "It's neither they don't really matter unless it's out of control, like saggy baby bump out of control", "thekristawhite": "Not to me but I wouldn’t say it’s “unsightly” just something that happens. Definitely more of a cleavage girl.", "cubarica_21": "Depends on how tight the pants are. If you’re wearing coochie cutters then the poor Nani (punani/vagina) looks like she’s gasping for air. If you wear something slightly tight/stretchy I think it’s kinda like your vagina is winking 😉 likeeee “Hellooo world your Queen is here” @shanboody", "thisistieara": "I want y’all to get pregnant on this trip !", "melaboricua": "Off topic but this is like a pic your grandchildren will see and be like ohh like at them back in the day ! Lol ❤️", "coconutlyons": "I love a camel toe. It’s a flex.", "strangemaggie": "They’ve always given me the sense that the person is unaware of the state of their vagina and choice of bottom, which is not sexy to me. But. I don’t know.", "tore.williams": "Who don’t love a nice camel toe action", "nolynn96": "I think seeing a camel toe actually is very similar to seeing cleavage. Being a human it comes with analyzing the human body, and being able to dissect and experience someone’s body through human imagination verses it’s just naked for all to see is more of an exciting thing. It can let me imagine your body. So I think camel toe is a good and sold yes it’s okay and should be more proud to have sometimes!", "taraiztenacious": "This looks like an ad from an early 90s issue of Seventeen magazine covering this summer’s beach trends. 😎", "ziyanda.08": "The latter. This picture is amazing though. You guys are hair & glow goals omg 😍", "graffiti.collective": "Hmmm yikes ?", "eliannas": "Hella sexy 😎 You guys look healthy and happy 🔥☀️", "brandonkeith99": "Listen closely...your virgina is not to be displayed..your coochie shape is not to be seen threw your clothes by a man's lust....this is what a women doent know....ready......when a man sees a women'shape of her pussy threw her clothes ...he goes..porn thoughts instantly...you like a man's lust..looking at your tight virgina..no..right...so..no ..never show your pussy to any man and stop sayying camel toe...for the women that do do it...they want to just fuck..women who don't their chastity will lead them to a goodman..like me...no camel toe looks..ok..done", "ajwatkinsjr": "They can draw my attention 👀 but I can’t say that I’ve given a lot of thought 💭 to whether they are sexy or not. More so like a highlighted feature in her shape! @shanboody", "haileeschwartzz": "You can make it a sexy trend if you want to😜", "highyella_bruja": "I don’t call it a camel toe. It’s a fat cat. And who doesn’t love 💗 a nice fat kitty 🐱.", "punkie_dancester": "I personally believe that camel toes cant be helped but I don’t mind one", "equipped": "🆙🆙🆙", "bluufoxx_": "Camel toe/ moose knuckle, can be a sexy thing if it’s embraced by the woman who has one. Women that aren’t ashamed of “her” just drip sexual maturity to me. A man in slacks isn’t going to under armor the hell out of himself under his boxers if he’s well hung so why should we hide or be ashamed of this beautiful asset that we have? 🤷🏾‍♀️", "beevelarde": "Isn’t this the most perfect couple you’ve ever seen? ✨❤️", "rebelbeautyjasmine": "😍😍", "mariciacf": "Wtf is a tasteful camel toe 😯 a vagina is a vagina 😒", "imswasey": "You two look AMAZING btw😍😍😍", "terinafaye": "I’m going with sexy!✨ Like side boob, or going bra-less 🙌🏽", "morganwaas": "I know its uncomfortable for me, so whenever i see another person with a camel toe I just think they must be uncomfortable too", "a_spikeleejoint_": "It's sexi to me 🍑🙌", "kirkkoblam": "I don't really think they are bad...they make me hungry when I see one in the wild.", "lovemadebytina": "You guys look not. Camel toe is not something I find attractive or comfortable. Plus calls for too much unwanted attention.", "coldfriesatthebottomofthebag": "I think they are a visual of sexy. To my eyes its attractive BUT it being equivalent to cleavage.....nah...if the outfit shows it with cleavage in the picture, its a bonus. Still sexy, but not equivalent. If that makes sense.", "drthunderbb": "I dig em", "findingtmlove": "Beauties 💕", "bodyscapeboudoir": "As a photographer I absolutely love that detail when photographing clients, but as a woman myself trying to workout, having bigger lips gets in the way haha.", "lucas_warren": "Cleavage gives you a sense of large or small boobs, if you are into large boobs then it can be an attractive point. I find a tasteful amount of camel toe attractive because it is tight fitting and gives a better sense of what the nude figure looks like, however I do not use camel toe to judge the size or shape of a vagina. Similar to a tight cocktail dress versus a sun dress. Not that I have anything against a sun dress, but it doesn't turn me on.", "bluwayvss": "@krwi2 the question of the year", "asiany___": "But what if it naturally appears no matter what leggings or sweats you wear? You can’t really control that unless you’re wearing jeans or baggy bottoms. Which i shouldn’t have to always do.", "t.chauma": "I have one when I wear leggings and workout pants, and can’t really do much about it! So I would rather learn to love it, than hate something that happens involuntary. 🤷🏾‍♀️ But I do know y’all are one sexy ass couple! 🔥", "dreyah.chan": "They’re natural so yes. I don’t know why people nowadays need to have everything smooooooootttthhhhhhh. We’re not barbies we don’t have knobs ❤️😂🤙🏾", "_dearari": "Hell no. I don't like camel toes. Maybe in a two piece bathing suit that isn't tight or in the right dress. I don't like mine. Clevages tho gives a different power. 💪", "officialshannonmarie": "I have no answer to the question I need to just state that y’all look sexy asf 😫😂🔥❤️", "gloriaxfiles": "Yall looking good!!! ♥️", "rainbowbrit": "I don’t like seeing camel toe personally I think it’s just a little too much for me. My partner however likes it 🤷🏽‍♀️", "claire_whiston": "i love a camel toe tbh😇", "solunacr": "It’s like, a girl with big boobs that wears no revealing clothing and tries to hide them, we can still see she’s a big breasted woman, is that considered sexy? Some of us can’t help it, I’m not trying to show a camel toe on purpose, sometimes it happens, specially with leggings and working out (hip thrust can’t escape it in that view) my answer is: I don’t necessarily think they’re sexy, or attractive it just happens, I don’t think it’s a sweat stain either (referring as yucky)", "mecohbain": "Haha idk... but I’m in Costa Rica now and it’s amazing ✨ hope you’re enjoying your trip", "macitchia": "I don’t have an answer for that question but I do know y’all should’ve put sun screen on before y’all went tanning", "yu8mykookie": "It’s annoying as a woman how we get publicly shamed for natural things like this. It’s cold omg her hard nipple. Wearing a tank top garners stares for being busty. Wearing shorts with a big booty gets a slap. Omg a 🐪 toe is showing how unladylike. But a guy shows his 🐪 hump it’s fine. Geez let us glow in are natural beauty 💗😂", "the_brewcrew_": "It gives me thoughts of yeast infections", "ahmadillo55": "I feel like when its in the moment, like during a passing glance it can be sexy. Cuz your kinda getting a view of what they got similar to cleavage.", "goyagod": "issa negative", "___immaannniii": "I’m proud of my camel toe I used to think that it was bad until boys used to compliment me or be amazed by it #powertothepussy", "conqueringlionsfc": "💪🏿", "kayleyjay": "My guy says he likes them💁 he said it means you have that \"fat fat\"😂", "cdazzles": "I wouldn’t say they are sexy and I wouldn’t say they are unattractive but I will say some of us with plumper ‘V’s (😉) can’t help it sometimes so just leave us alone. lmao.", "anodetosmallwonder": "After my second c section, I’ve developed major camel toe. My husband points it out all the time, but I think he likes it 😂", "cubariggs": "Beautiful couple ❤️", "leslievianett": "Looks like men tend find them sexy while women are trying to hide and dislike them. This is actually interesting 👀 By the way Shan, I'm a fan from DR! Love you and your content, hun <3", "dlm_iv": "Eh.... I mean... they're not, not sexy...🤷🏽‍♂️", "lalamabaso": "I like them. They’re a fact of life. They’re just a crease", "afrakaren": "Well they for sure aren’t hygienic ... it’s the equivalent of a choke’d coochie ... let it breathe ... I mean how is it even comfortable to have fabric up there? I", "ms.tay84": "It’s just not cute to me BUT beauty/sexiness is in the eye of the beholder...👀", "michelleprado95": "I think if vaginas were less taboo they would be like cleavage, but because our society makes pussy out to be this outrageous, must-be-hidden kind of body part, only some people will be able to see a camel toe and not have the knee jerk reaction to reject it or look away", "blssdgrl": "I am enjoying this view😍😍", "bb.rocio": "I wear spandex underneath leggings to hide camel toe girl!!! 🤷🏽‍♀️", "obithechief": "It's nice to look at", "mr1loveto\nVerified": "Verified", "lanaticketholder": "I don’t find camel toes sexy at all", "vanvirg": "I'm just sitting here waiting for y'all to pop out some babies, and yes I'm being entirely selfish because yall probably got other plans but I Wana see babies 😭😍", "lasanru": "First thought: not sexy at all! But I do think that a slight 🐫 can be kinda sexy...but there is a fine line between sexyish and ohh that's gross", "telldonjulio": "🌐🌐🌐🌐🌐", "_branden.jones": "Id say it's probably more equivalent to a dick print for women.", "justdomakim": "Indifferent to me. They just exist 🤷🏽‍♂️ lol", "lyzalittle": "OMG. i kid you not in the last few months i keep telling my friends “FREE THE CAMEL!” & then i say “how is it any different than the lines from cleavage that everyone loves?! why is the shape of my china “bad”?!” nope. i’m all about it. wear what you want, how you want & you’ll look great doing it 😍🙌🏽 that’s my 2 cents for today.", "kristen_winger": "Mom and dad", "artbyanitaheart": "dont like having one 🙇🏻‍♀️", "missyb177": "Not sexy at all", "jane_nelll": "I love my phat 😺 lol", "kimbo263": "I think guys like it", "ms.nekki.nek": "No they not sexy. Looks stank lol", "simply_michi_": "I personally think it depends how thick you are in that spot...for me I am THICK..my lips n clit are big No way around it and I was never comfortable because of others opinions but as I matured into a 38yr old woman...ALL IS FREE let the lips be seen😜👀", "mukeshsankhla27": "Hot chocolate", "acnaibmichelle": "I mean I feel like it should be the equivalent cus it’s not like I can cut or would cut my fat ass vagina, I have a serious problem with this my mom shamed me for it but it’s like what am I to do it’s what god gave me 🤷🏽‍♀️", "renitab84": "No not at all.. You two look great though! 😍", "bloodyquills": "You’re both so delicious 😍", "ave2noondelite": "I don’t get the appeal. 😩I hate it! Hate having it. Hate seeing it.", "hot5_b": "Sweat stain for me. Not on the level of cleavage at all.", "keemerz": "You two are awesome!!!!!", "llewin09": "No they are not. If I can see your whole vagina. I know you can see it too. Lol", "_kaylondon": "Im always really self conscious about having a camel toe :( it's seen in a negative light but I wear leggings and sports leggings a lot", "petty_human_emotions": "I’m sure there are ways to make it sexy but I’ve certainly never discovered any of them", "anasofirusso": "I'll tell you what's not sexy, sunburn. 😮", "beautyoutspoken": "I hate to see mine but men love them apparently. I think there’s always a big disconnect between what us women dislike about our bodies that somehow men are into", "fatia.the.poetess": "Look weird to me", "damonjohnson2": "No, I’d say they are very sexy. They are definitely equivalent to cleavage, or even sexier 🔥❤️🔥❤️🔥❤️🔥❤️🔥🔥❤️🔥❤️🔥", "destineej": "😍😍😍", "kellymaryann514": "Hell yes", "lovealwayskris": "Beautiful couple", "salynacole": "Belly button sweat stain 🤣🤣 def not cleavage sexy... idk if sexy is the word, but I don’t mind it on others as much as I do on myself", "zaydaliciousdesigns": "Looks too uncomfortable to be sexy to me.", "iammaj0r": "Depends on if it's a camel toe or a moose knuckle. 🤣", "marimars.art": "Sexy. Also sexy: women with a full bush wearing lingerie panties 😍 call me WACKO", "lipstickthvg": "Fine ass couple ! 👏🏼💞", "elizabethgarnes": "somewhere in between 😭", "kurab1": "I don't think they're cute at all lol but do as you please 🤷🏽‍♀️"}