{"thefunkiwan": "LOVE THIS. And just about all you do girl. Excited for the book, congrats on this part of your journey. And every one deserves kindness and loving, there's always room graciousness, boo. hundreds of thank you's for the conversations you bring to the table and the spaces you create for others to participate in them. <3", "jonny.jonny.music": "Jonnny", "jononott": "Dominating and creating positive vibes 👊", "saxlific_music": "@saxlific", "the_fuck_it_twenties": "Anonymous blogger who has just started putting there content out today and would love you to comment on my page! Been a huge fan for awhile 😌", "unctee85": "@unctee85 😍😍😍", "green_violin": "@green_violin I love you so much !!!", "sheajoyproducts": "Love this ❤️🙏🏽", "sammysouw": "🔥", "naiya.nekiole": "Hey you are literally amazing 😍!!!", "shak.isms": "Shakuntala 💖🌹", "awokenbeauty": "Hello!", "alexandriaashcroft": "Love this", "iamchynecherem": "chy_necherem 😍", "sypesype": "❤️❤️❤️❤️❤️❤️❤️❤️ 🔥 Congrats Shan - I cant wait to read! 🔥❤️❤️❤️❤️", "becky_xtina": "Hey gurl ❤️❤️❤️", "nyariangchieng": "Nyariang! @nyariangchieng ❤️✨", "breanneelizabethg": "@shanboody I'm so glad I got to meet you in Hollywood earlier this year. Even if you don't remember your energy is amazing you a truly a light ✨ that shines bright and I can't wait to read your book!", "i_win_again": "Thanks for considering my story I can’t wait to read your book!", "dominicjustinaa": "You are fire 🔥", "officialjovanyoung": "This is great", "risk_byclark": "Can’t wait for your book @shanboody", "jenellrenee.sacredwings": "So excited to connect with you!! 😘", "agibac": "I love you 🖤❤🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤 ❤ 🖤", "psydoofficial": "🙌🙌❤️", "dayreensola": "Shan, you're the bomb.com. Thank you for all you and the knowledge and research you've shared. You've held me particularly by standing in my truth about love not being finite, on polyamory and being a complete whole irrespective of being partnered up! We love you, the world is wiser because you are it in💜", "hellorven": "We love you! ✨❤️", "ms_trista_alyse": "@taalysse_jewelrybox Thanks❤️", "is.rani": "So dopeee @shanboody 💕🔥", "oheyitsreei": "When i grow up I inspire to be like you ❤️", "caroon10": "Incredible! Xo", "kildabeast88": "@kildabeast88", "nickisha_roberts": "You're such an inspiration to young women including myself. I mean how often do you come across a young woman that is willing to be so blunt about life itself and no sugar coats. I really do appreciate you for that @shanboody ❤️🥰💕💖 Love you... Keep being a blessing to us all..:", "randyrancandy": "You are an absolutely wonderful human being and a phenomenal super woman at that :) Muse!", "avalonmcfadden": "I'm going to get my copy when my class is over. It's been added to my summer reading list.", "karhonda81": "KaRhonda", "abcdefgeez": "I think you’re pretty dope! We all have those days/moments ❤️", "hope.wanderer": "Such a dope soul with genuine vibes! Thank you for being here with us!💖💕", "jetaundavis": "This is a dope illustration! 🙌🏽", "simsinga": "Nah, this is 🔥. Blessings x Success.", "lilly_the_nomad": "You are amazing and I've learned so much from you. Thank you for sharing all your beautiful moments as well as your vulnerable moments", "radiationxblues": "Loooove you!!", "msextraordinary22": "Nix. Keep pushing Shan! You’re amazing! ♥️", "luvinthislife": "Megan and 🙌🏽 love your work! @luvinthislife 💚💚💚", "thatsbrianda": "Ur an inspiration. Point blank done you’re a major thought leader out here in this media realm changing lives. And the literary world!!! I needed your video on age when I had a quarter life crisis, needed your videos on sex & relationships when I decided to go celibate. Yup I said that lololol. GURL you “it”. Ur major 💜 thxu", "whole.harmony.health": "This is AMAZING 😍 Going to watch video NOW 💕", "sjane_mete": "Pre-ordered book one month ago...✅ check out my page! ☺️", "dagella": "You are amazing!🙌🏾✨", "thatbasleykid": "I love you anyways boo. Thank you for all that you do 💕🙏🌹", "amygreenan": "I really enjoyed your \"ologies\" interview! Keep doing your good work.", "aubreyorganicsusa": "👌💜", "her.anasti": "@her.anasti❤️🥰 love what you do @shanboody", "mmeaganicolee": "😍❤️", "zensue1": "✨✨", "karenlknowlton": "I fell off the couch...ouch names Karen", "bestkeptexclusivephotography": "@bestkeptexclusivephotography", "mzmiche": "You soo remind me of myself in my younger days... I need to get that back 😀", "noella_michelle": "Hola! 👋🏽 love your energy, confidence & style! (And hair btw❤️) newish fan, great content.", "_glitznbliss_": "This is beyond fucking dope!🔥", "honeytai_": "Taïssa🥰🥰🥰", "amethist86": "Your awesome in so many ways longtime subscriber on the yt ❤️", "oliivia_chloe": "@emohly you need this girl (and her wisdom) in your life💖", "swipesandgiggles": "Hello LOVA! Love your channel and I really look to you for inspiration on all this love ish! My channel focuses on Online Dating and just love life in general. So I always look to you for different ways to approach certain topics and give credit where its always due! You're creativity is spectacular 🔥", "shaykaay": "I see I’m 21 hours late but hello ☺️", "bethexotic": "I thought your youtube video was great & i dont even watch the GOT. I learned a lotttt from that short video about attachment styles, & how to deal with them in myself and my partner", "jameelahzb": "@shanboody this is amazing and bang on 🔥🔥🔥", "tashaknows": "Ok. Now I want you to design a freaky little game we can actually play with our partners.", "_lleexxii2": "Lexi. I appreciate you.", "leahhvioletta_": "I love youuuu and still remember the day u responded under one of my pics I posted of u 😭😭", "dominextdoor": "not everyone watches game of thrones 😩😅 that’s why i didn’t watch the video.. i know nothing about the show.", "andrewlloydpreston": "@andrewlloydpreston", "keishacharmaine": "Pre-ordered yesterday 🤙🏾", "tristonmaurice": "Crazy!", "cheyliz24": "Ill", "imantraore": "I can’t wait to read the book. You are very inspiring!", "elisa.soto_": "You’re so amazing! I watch your videos religiously 🙌🙌🙌🙌 love from Canada 🇨🇦", "robbatess": "@theofficial_rnb I fucking love ya Shannon lol just started a podcast will be shouting you out in eps 2 you taught me hella when it comes to relationships tune in if ya can 🖤", "nalpakaras": "Sara Mariela Nino Kaplan lol I love this pic!!😍", "crystalelamin": "🙌🏼🙌🏼 We bought 2 copies! ❤️", "lindi_r": "Lindi. Please check out my YT channel inspired by you!!! I’d appreciate your feedback 🙏🏾", "madelaine.wolf": "Can’t wait to read it 😍", "cristobolatk": "Visit my page, tell me what you think.", "kyahhjo": "I’m in love with you. You are incredible!", "tbizzle22": "Def gonna get this book ASAP!!", "lorrainedanielle6": "We still love you and that won’t change! No matter what topic you choose to tackle in a video, if we skip one we’ll be right back on board with the next lbs. KEEP GOING BABE!!🤞🏾✨💙", "caragnagey": "Love u girl", "dalecandela_149": "Lia. Much respect queen ❤️", "puffdaddyrae": "You’ve been a constant source of inspiration & motivation. Thank you for you💕", "lyricalqt": "🙌🏽🔥👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "yorubaprincess2": "Victoria", "avazechiel": "heyo!!", "ohhellonikki": "Im Nikki. Love you and your content! Been here since TGAW 🤗🤗", "cmyurevich": "I’m Calesha! I love and admire you and your work. Beautiful queen inside and out!", "creative_handz": "Nick", "laylaaaa_s": "Layla :) how are you Shan ??", "heyitsnicolerenee": "@shanboody hey boo heeeyyy!!! I watch you when I need a little life guidance and inspiration. 😘", "rainkoats": "Rhiannon 💓", "_thegardenllc": "Monique. Owner of Be Great Beauty 💗 check out my mirror messages for self help and motivation 💓", "krown2k": "👑 King 👑(that’s my real name)", "gbbynicholas": "Gabby ☺️", "joey_too_smooth": "You was my YouTube crush for awhile, you're definitely are inspiration, and don't worry your video will kick back up, you're not the only one who's video \"bomb\" 😉 lol.... Jo-Jo", "_craycrayshayshay_": "Shana. Hey girl! Loving how you are loving the dream! Congrats on your (not so) recent nuptials.", "charissasimplified": "❤️❤️❤️", "chris_originals": "Okay Shan Boody! My name is Christina but you can call me Chris. 👍🏽", "aline.ferone": "@shanboody 👋♥️ Hola beautiful, will the game of desire be on audible?", "keysho77": "Kenny ❤️🇫🇷", "mira_miraondawall": "Samira💕", "mceladc": "Maricela 👑🙌😍 absolutely ❤️ this", "nykia_femmusician": "I love what you do. I'd really like to get into sex research and having a role model so vocal about sex and breaking down taboos is just inspiring.", "mielebooker": "I love the type of content/info you post! I appreciate you, girl! (Plus you're beyond gorgeous)💛😍😭", "xxcasskayeh": "I saw you on cityline for the first time today, and you got me hooked! LOVE your aura, and your confidence, and eager to learn more from you! Keep shining bright you beautiful soul! ✨💗", "sexiiluz": "@sexiiluz", "andrene.france": "@shanboody love is always here from @andrenefrance ❤️ You have helped me face my shy awkwardness, and embrace my sexuality and strength as a woman. Nuff love to you always.", "xtinajlife": "@xtinajlife", "mangoevenings324": "I’ve only been following you for about a year now but I’m so glad I did. I love everything you’ve shared, all the things that you’ve taught me.❤️❤️-Ke’Myra", "kalmonte23": "@kalmonte23 🇩🇴👌🏽", "lanz.leilaniii": "Leilani ❤️😊", "beyondneena_": "I'm Neena, aspiring couples counselor ☺. SO ready for your book to drop!!", "corey_hogue": "That’s 🔥 you are so dope", "rafael.woldeab": "My girlfriend, @zoeellen graciously challenges me every single day to be an advocate for the society in which I want to exist. My most recent post received a lot of love and I’m humbled to be a positive influence for other men in my community. And you best believe keeping positive advocates like you in my network makes me a better person, so keep sharing your truth @shanboody !!!", "mzillla": "this is so sick! and that is sooooo nice of @renra.decordova 😍 you’re aweesome Shannon, like the best friend/sis everyone wants ♥️🙏🏽", "aameanah": "Amina 💕", "itboygonewild": "Sam ❤️✨", "kosh_khanssa": "Love from sudan-africa", "mom_knowz_best": "Hi there. Faith is the name ❤️", "xevajc": "@xevajc", "goddessoflovelightandcurrency": "I appreciate your honesty, your courage and new take on how to live, love, be and fuck especally when it's about saying fuck off to the haters. Lol", "milotheguy": "Jean-Guy. Got introduced to you through the JK crew years ago and been following you ever since. Love all that you do.", "janillavanilla_": "Janill ♥️😘", "bridenisedavis": "Ma’am! 😍", "marshallarts1010": "I love this 🔥💚💚💚 thank you for being so inspiring. @marshallarts1010 is my art page. 🎨", "iyomi_ashira": "Amazing 😍😍💕✨", "yazzy_art": "Yasmin💖👋🏼👋🏼", "prettydoperight": "@prettydoperight", "jasmillmelisa": "Awwww 💋💋❤️❤️", "ma.cherie.d": "Hi, I’m MaCherie. Love your content.", "intvlt": "My friend and I both did the game of thrones quiz and watched the vid together, I loved it!!!", "only_kelo": "❤️ sending love and positive vibes from South Africa 🇿🇦", "in.true.franny.fashion": "Franny. Thanks for all ur work ur an inspiration", "creativelifestyleblog": "🙋🏽‍♀️🙋🏽‍♀️ LaToya!! Hi from DC! ❤️", "_teralynn": "Tera", "lareinaguerita": "You are so beautiful ! ♥️", "siniya_underscore": "Siniya ☺ Sending you love and light from South Africa 🇿🇦❤😚", "mbaliville": "I appreciate your candour & self-awareness. My name is Mbalenhle.", "scarlette_moonchild": "@shanboody you inspire me so much and I’ve followed you for yours keep slaying my lovely! 🔥💖 Also my name is Erin hi", "sheisroma": "Love you Shan", "gigibonita1": "Fellow Canadian over here! 👋🏾 Love your page!", "candy_jay__": "Queen of Queens! Love and support always! ❤️", "firestorm2343": "My name is Bryanna", "debbie_ny90": "This is AWESOME!! 🖤🖤🖤", "shygalaxy": "Pre ordered your book!! Can’t wait to read it 💞", "rosiegrier_": "@thadeousm", "angelfraz": "It would be so amazing if you could my name is Angel.", "gendernonconforming": "Lou Hendricks & I love you ❤️", "temtalks": "Girrrrl everything you do is still on the spectrum of great!!! Temi ❤️", "nyah_the_natural_": "@nyah_the_natural_ Amazing work 🔥", "haydeearizala": "Wow, so beautiful. You've changed the way i was approaching relationships lately (low expectations) thanks for your work. I'm sorry about the video. Ill check it out today ❤", "maniyag": "🙌🏾Gloria from Paris ! Waiting on your book release 😍", "veronjac": "The game of desire could bé great as TV série 😀", "diidie_k": "This is mad fireeeee 🔥🔥🔥🔥🔥😍😍😍 amazing 🙏🏽. Keep being your wonderful self booboo ❣️", "hybridflower": "Paula 💖 love your page and everything your doing", "jonyhaspizza": "Hi! I'm Jony and i want to start studying sexology after summerbreak 🔥❤️", "exeniamusic": "Exenia is my name. Go Shan, you’re awesome.", "feminfinite": "🔥🔥🔥", "countz3ro80": "You go, girl! 🤘 Peter", "kenyaonhair": "Shannon!!", "_jaila": "@_jaila ❤️❤️❤️❤️❤️❤️❤️", "whentheresmooretolife": "Wow. Stunning artistry, beautiful words ❤️ @shanboody", "charellegriffith": "Charelle ps what great artwork", "_vikkibailey_": "Hey! Please check out my friend @plainkvte she introduced me to your videos and loves you!!! She’s the most amazing lady evaaaaa", "aimsy_g": "@aimsy_g ❤️❤️❤️❤️❤️", "diosa_deedee": "Deanna. And you’re amazing I love watching and hearing the thing you have to say", "tiaroxstar": "😍", "lauraanne.ox": "Laura 😘", "_sleepingdeb": "I’m from Italy, and I nope someday to see more people like you even bere so se can talk openly about sex and pleasure! 🔥♥️", "funmikee_": "Amazing I'm a big fan!!! @funmikee_", "el.socio__": "You're life", "fauvevandevoorde_": "@fauvevandevoorde", "nikitatikin": "Nikita 🙆 and you are an inspiring queen💞💪🔥", "calvilyn": "@shanboody Hey Girl Hey!!!! I have been watching you for years now. I love what you do. Continue inspiring all the many lives you can! Love, Calvilyn", "malikabegin": "This is such a great idea. I love it.", "soulfulshenice": "I can’t wait to get your book! - Shenice 💛✨", "msfitdiamonds": "Hello I’m diamond just want to say I love You and your work I’ve spent most of my day studying your videos because u drop knowledge on us love and I appreciate that so I’m part of your Notification gang lol and I will be getting your book vary soon but thank you for being you I mean that have a great week", "leil_cooks": "Kaleil. And I love you😩😍", "makeupfestation.online_company": "Hello gorgeous. Big fan of your smarts! ❤️😍", "mayathebiologist": "Big fan G, keep going! We here! 💕", "dejah.lynn": "Yaaaas girl. My name is Dejah! I love everything you do!", "eyeprtty2": "🙌🏽🙌🏽🙌🏽😍👏🏽👏🏽👏🏽👏🏽 Sydney!!!", "tashigolean22": "It \"bombed?\" Tbh, ppl are just afraid to learn about themselves and improve. Keep it up Shannon. I appreciate your work!", "dali.navarro.loza": "Dali. You bomb", "the_girl_in_the_cafe": "Celeste! :) I d'md you the other day too! Glad you're feeling better! 💪", "redporcelain": "Mireia 🙃 Thanks to your channel my views on relationships and love have evolved tremendously! Can’t wait to have the book in my hand!", "hawa_moudy": "@hawou", "ibithsince94": "damn that’s a killer artwork. wish you were in the show some how lol", "eyesby_naeemah": "Naeemah ❤️", "brittaneenicole": "🥰👋🏽", "vandanathanki": "Vandana", "ynotkeeb": "🔥🔥🔥🔥🔥🔥🔥", "mavanieee": "I ordered your book and I am beyond excited to read!!!!!. I love you and your YouTube channel, you have impacted me in more ways then you will possibly ever know and Thank you!! You are so beautiful!!!!💕✨", "melatmulugeta7777": "Melat", "cairo.jpg": "hiiii im cairo 💗❤️🔥💌 been watchin u for years and love u sm", "razaillia": "I truly adore watching you. Razaillia ~", "thepassionseeker": "Andrea :) Thanks for inspiring with your posts/youtube channel ✨😊", "brandonmbolton": "Amazing! 👑", "rialapae": "Preordered!💃🏽", "oxiamxo": "Yess I love it!!💕👏", "queenoceanseariverlakemajesty": "Demetra", "nadia_mumbles": "Nadia 🤘. Also just want to say you are so beautiful 💕", "djbluetv": "My name is Jeff 🤪 me and wifey have been learning from y’all for years", "reneemwilson": "🌟🌟🌟", "frankie_elaine": "Frankie. You have changed the way I see relationships & sex in an amazing way!!", "loserlary": "Lara :) I love your videos and you already teached me so much ❤️", "joyvaleriee": "Yooo internet fam truly is the best and most supportive ! Def checking out the vid", "jessmaebatt": "🤗🤗🤗🤗", "pam.cake.lake": "I loved your video! Keep going! 🙏💫", "tdodart": "💣👸🏽", "tyler.victoriaa": "Tyler 😘", "intuitivewordz": "Aww proud to be part of your amazing group of followers.", "elyse.turpin": "Hey! Just wanted to flag something on your game of desire website: in the form for your free workbook, the font is yellow so as soon as you start typing it’s very hard/impossible to see - might be just a mobile version thing. Stoked to get your book! 😊🙌🏼", "cozturkkan": "Love your videos I dmed you can you check?", "rosafjalland": "@shanboody as everyone else says: It’s a delight following you, and your shine reaches so many people - thank you for you💕🌸🌻🎉", "lightning.flash.jazz": "Hey I’m jasmine!! 19 from MA and I think you’re awesome!!", "sexysoulcollective": "You inspire my journey @sexysoulcollective", "lovenehajha": "Neha!! This art is INCREDIBLE!! 🔥❤️❤️", "mcdollison": "Matthew I saw you on jk news and on ask the feels and your advice was always stupid good. Shit saved me a few times.", "chelseadeenice": "@chelseadeenice hiiiii!!!!!", "ladysergineblog": "Sergine. @ladysergineblog", "desertsungirl": "Desertsungirl", "janedotteo": "Jane 💕", "iamquueenb": "That video was amazing and I took my text on your website!! I’m the secure type! Though I don’t watch GOT, I still loved it!!💗💗💗 Here’s to expressing more of my gratitude to the knowledge you put out!", "nicci35": "Hey Shan I am soooooo ready to read your book.", "urechi_": "Urechi 💛💛💛", "ginapuatany": "You're amazing and I've been following your work for some time now! Keep up the good work 💕", "missyfarni": "Omg. I am so obsessed with you. ❤", "joneykenzie": "@joneykenzie. Love your work keep up the good work👍👌", "aprils.seventeenth": "Oh man I followed you since those girls are wild and your growth has been remarkable since . Keep going ✨", "o.andradde": "Octavia! Thank you for being inspiration for years now, love you!", "sofiargatti": "@shanboody you once liked a random photo of mine in Barcelona and I thought ‘who is this random?!’ ... I ended up following you straight away and you wound up helping me through a rough time! I listened and watched your content everyday while I got ready for work in order to feel stronger. So thanks for dropping that random like Shannon 🚀🚀🌟🌟💖💖", "leahgrantart": "Leah. Always love the growth you've accomplished", "seanasparkle": "Daseana 💜✨", "_wanjiku.k": "Wanjiku..been on this journey with you for so long am sooooo excited for the book ❤️❤️🙌🏾🙌🏾🙌🏾", "franchescalamarre": "Hello, love My name is Franchesca & I LOVE all your content!!! ✨💕🌱", "amirroyale.ent": "Amir. You’re a legend in all you do Shannon. A walking queen and a rare spirit. Thank you for gracing us with your wisdom hun. 🌺❤️🌺", "cat_eyez_0525": "Cat_eyez_0525", "hitoroki": "Devin. This artwork is fire! Looking forward to the book.", "daunleeshedshow": "This is exactly why I follow you. You’re humble! Keep going Queen 👏🏾👏🏾", "_dianne.f_": "You are amazing sis🔥 Keep on making sexuality and desire a topic that women can openly and comfortably speak on!!! You fucking inspire me!!❤️ Love all the way from St Lucia🇱🇨❤️", "simod_bond": "Badass", "dagoat_106": "I couldnt watch it cause I'm not caught up and dont want any spoilers 😫😫 but this is bomb af Shan love you ❤️❤️❤️", "epihealthycure": "Awesome!!!", "mia.carnival.6ix": "Love what you’re doing .. been a fan since Rogers !! 😍😍😍", "nieceypeace_": "ILYSM!!! You inspired me to become a sexologist - my name is Aura and I appreciate your AURA!!!", "allthingsvikki": "Hey Queen! #KeepShining ❤", "bresutherland": "😍😍🔥🔥🔥🔥🔥🔥", "raczcx": "Rachel. Check my story bc I'm SO MAD", "babigurl2121": "❤️", "ajira": "This is so good @renra.decordova! Love it. And love the love you share @shanboody! It’s a beautiful thing to bring love and inspire love in those around you.", "godgivengenius": "Been following you on YT siince way before you had to explain to folk about what an \"Open Relationship\" is to you and.. how you was just making out with perfect strangers... or just one stranger.. lol then finally joined IG and witnessed you in all your glory Lol", "jdanistheman": "Jordan. I love your content!", "mrs_mccalister30": "This is beautiful ❤️😍", "aminamarie": "This is amazing!! 😍🔥", "kendallxanime": "Appreciate you and the things you share. 🙌🏽🙏🏾 also this is 🔥", "bigbrotherses": "Nice", "marcellionaire": "You dont gotta do nothing extra! I just wanted the chance to say hi and send positive vibes! I love watching you on Steve Harvey! You leveled up my perspective a lot! Thanks!", "thetiffaninicole": "You are incredible! 🙌🏽❤️", "misssky.allen": "This is incredible ❤️ Queen Shan of House Boody, First of Her Name, Queen of the Andals and the First Men, Protector of the Realm 😂👑", "kimarcain": "seeing your journey over the past three yrs since i’ve discovered has been dope.. proud of you and all your accomplishments 🏁", "princia.m03": "This is insanly good~ can't wait for your book - Princia 💕", "aliselliss": "hi i’m Alis , I recently fell upon your page about a month ago and i love how much you’ve educated me! you’ve opened my eyes on a numerous amount of topics and i’m thankful for that!", "motherpluckers.co": "So amazing to follow your journey ❤️ You hired me for one of my first makeup gigs", "copyrights.dame": "Damien", "xoclarrissafierce": "I preordered the book! I can’t wait to get it 🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾🙌🏾", "yendisoak": "Love your informative, empathetic & damn sexy videos. Never fails to make me feel sexier in my own skin 💕", "alison1913": "@alison1913", "icyy_nkosi": "Love your take on relationships and life in general ,it really helps me out at times ❤️", "lanita11": "❤❤❤", "anna_kenn": "Started following after your ologies episode! Loved and and made my boyfriend listen to it 😍", "kimbalucy": "I watched the video, but I'm gonna rewatch and take notes this time!", "thickdaddydandelion": "that’s so cool!🔥 my name is Toi-Anna or Toi (toy) for short☺️", "lady_woo86": "🔥", "natepaul007": "Dope! I’m Nate and I followed you because you’re beautiful and you got a certain type of swagger", "justinediiane": "Justine ♥️♥️♥️ hiiiii", "sabinastyle.au": "Yasss queen 👏🏼👏🏼👏🏼👏🏼", "erockfor": "heya! it’s magda;) was finally able to pre-order the kindle version of your book! so excited to read it!", "ylolamitchell": "😘👐🏾", "sisithelyricist": "Sieara 💕", "_dreamingseoul": "That would make a dope poster to put on your wall. ~Dreama~", "so_meek": "Tameka ❤️💯🙌", "yezzytaughtme3": "Gabby sending you love & Light 💙", "jessicamowforth": "This is dope!! Love ya girl🙌🏼💜", "lovingcalmchaos": "I just love you podcast on @ologies 🔥", "khay.tea": "My name's Katie and I love watching your educational video and learning from your insight!!", "allantebarry": "I've been a viewer for so long. You legit taught me so much😭😂❤", "xcse_mycharisma": "So I am definitely in awe of you! I literally have been much more empowered and inspired to embrace this goddess within me! Much appreciation! That artwork is epic too! ❤️❤️", "cclvchristina": "Hi Shan 🤗🤗🎉🎉 always love your perspective on reflecting on yourself for true life gratification 💜💜 @shanboody", "biku_datte": "Thank you for creating a safe space for important conversation!! Love you ❤️", "frannysbartending": "This pic is so dope❤👏", "prince_alimohamed": "This is amazing!! Name is Ali 😁", "sekiajenifuja": "Hey Shannon, I’ve been following you since ‘those girls are wild’ I really enjoy the content you put out. You are empowering and inspirational to me. I read LAID years back and I’m looking forward to reading your new addition. Love, Seki 😊", "luminous_sincere": "I love you my names Billie", "paobz89": "I absolutely love how you speak about everything with no filters, you’re so amazing!! ❤️❤️", "tracesparkles": "Love following you and love your authenticity ♥️ Keep it coming!", "xakeiax": "Akeia 😘", "izzywuramos": "Time difference 🤣", "ms_leahr": "This is dope", "skooooobs": "Omg 😮 and Id like to believe I had a small part in bringing the Game of Thrones attachment style video into existence 😂", "staceykhuuhair": "Enjoy seeing you and your posts❤️❤️", "renorathequeen": "Eszter Rimányi💞", "zenobia.simmons": "I've been rocking with you for a minute!", "rated.f.to.z": "😍😍😍😍", "channiee_lu": "This is super hard actually lol", "l_asante": "First time I heard about you was when I went to Centennial College - You completed the publishing program there I believe. I love your page and your videos! Please keep em coming! So happy to see how your career has blossomed. May you continue to rise girl! 😘", "tisworthit92": "This is so nice 😍", "neinagonzalez": "Neina Gonzalez, I think you are AMAZING", "stregarose": "You always inspire! 💟", "simply_a_vessel": "This should be the artwork for your next book cover.", "zaneika": "@zaneika 🔥🔥", "tyanasinfronteras": "Tyana! 🙈", "ebonicurlsblog": "You’re phenomenal!!!! ♥️♥️♥️", "dk.the.most.dedicated": "@renra.decordova. damn you DID that", "theshamoyakelly": "This is amazing! So are you !!!👏🏽👏🏽👏🏽👏🏽🔥🔥🔥🔥🔥🔥", "narleyk": "@narleyk ! big fan <3", "santana.picasso": "🙏👑", "leeta_xox": "Leeta ❤️", "mssallyng": "SallyG😊. I love your content🙌🏽", "chaneldisla": "Hiiiiiii 😍😍", "dontdieafraid": "This is dope, I pre-ordered two copies! Met you over 7 years ago when you came to Hofstra.", "lovely_mizz_candy_": "My name is Samantha, and as a fellow author I can’t wait for your book!!", "sabrinazaffino": "Gorgeous and fierce! Love you 😘❤️ love from Toronto 💕", "nakadiaxalana": "💖", "brandicowles": "You are an inspiration!!!❤️❤️❤️", "kellysweets01": "So dope! 🔥", "ms.akr": "Sending you lots of love!!! I absolutely love how much you have evolved.", "sidneymharper": "I love your videos. I loved you and your husband's journey in life amazing person. ❤️", "avery_nzingkha": "@avery_nzingkha", "cheeknows": "Heeeeeey my name is Ciarra 💕 been following you for a while on YouTube ❤️", "queenaa_official": "Love you girl,I always appreciate your much informed YouTube videos.", "codechanel": "Keep slaying queen 🔥🖤", "quickdrawjoe": "New follower, but already a big fan! Keep up the amazing work :) Looking forward to becoming a longtime follower!", "lifeinthephablane": "Aye!!! It’s LIT!!!!", "lord_knowzz": "😍", "saltana_39": "I love this artwork!!!!😍😍", "mindthemedic": "This is epic!🤯", "arifmerritt": "Arif 👏🏽👏🏽👏🏽👏🏽", "zombie.cr": "Best Mashup ever!", "kingsauceymcvey": "You have a loyal ass follower since YouTube and that was from that @thatdudemcfly 🤘🏾🤘🏾🤘🏾 keep doing what you do Shan", "sydwell_nkosi": "@sydwell_nkosi", "serenityslyric": "Goddess vibes!!!!🙌🏾😍🙏🏾❤️🔥✨✨", "stephalafond": "Your post and vids give me life. Love you long time!! ♥️", "miaperk20": "You’re an absolute joy and your content is 🔥. Thanks for all that you do I’m so looking forward to the the book 😍😍😍 congrats! (Awaiting its arrival in my mailbox ⏰ 😂.)", "deariadanielle": "😩💕", "didiatl": "You are awesome Shannon!!! Continue the GREAT work that you’re doing.😍", "simplyearthy": "You are such an inspiration. Keep getting it girl!", "low__ng": "QUEEN", "mosellexalvarez": "My Name’s Moselle and I Love the way your mind works. 🙌🏾", "browngirlmktg": "Your posts are life! Happy to support you.", "itsjessiebt": "💗💗💗", "pocketfuzzz": "love you so much!! been watching your vids since TGAW & you’ve honestly helped shaped my hair AND my love life. thank you for existing and doing what you loooove❤️ 💝 💕💗💚", "heyyitsnaenae": "Hello I’m Nadine, thank you for being a great teacher! You’re a strong powerful woman! love you shan! 💜", "ruaimaa": "The one who should rlly deserves to be on the iron throne 💯", "malik_kineard_": "Holy shit🔥🔥🔥👏👏👏", "iamkeithterrell": "Dope 🔥", "goddessin_themaking": "I love things like this! Spreading love is so much easier than we think 💜 Hello Shan! I so appreciate your knowledge and all you share with us 🙏", "shopgirl3535": "This is amazing!!", "yourcarnivalmodel": "🙋🏾‍♀️ from centennial college days I knew u were gonna go far. Proud of u. Congrats on all your achievements and cheers to many more", "lisanguna": "Congratulations! Let the successes keep rolling in. Hard work does pay off and I'm sure I'm not the only one that is grateful you decided to not only passionately love what you do but to spread awareness. Here's to many more feeling as empowered as I do🌞", "rosemaiella": "Rose Maiella 🌹 thank you for teaching me so much! ❤️", "freshdopefly": "This is EVERYTHING!!! ❤️", "bx_galileo_": "Saw you on an Ask The Feels episode, been a fan since. Check out my videos on my page if you get the chance. Keep being you Shan", "selfluvizbestluv": "This is soooo hot 😵😵😵", "xxkadijaxx": "Hi @shanboody! I’ve been a fan since I was 15 years old watching your “Those Girls Are Wild” videos! 10 years later and I just started my own YT channel. Much love -xoxo Kadija", "pessoa.kim": "Kim 🙌🏽 been here since TGAW 😂💙 congrats on your new book!", "walklikenaomi": "My name is Naomi 🙌🏽 you are so dope queen", "mzashleymack": "This is a really cool concept! Definitely a cover that will make me want to judge the book (in a \"Let me buy this\" kinda way)😍😍😍 Beautiful picture - Ashley", "mtn_beaut": "Love what you are doing by promoting healthy sex education and conversation. Keep it up lady, you rock. 🙏🤗", "nneek.neek": "Damn Queen!", "forbidden_fruitt_": "Carla ✨❤️", "soleaux_": "My name is Solange, your videos always put me in a good mood! Always a vibe! 😘💜✨", "estefy_roro": "HOLY HELL!", "queen_wilddfire": "I am a frequent flyer of your YT.. love watching you!!", "bibifaj": "Abisola 💞 you are dope Shan!", "fourstwob": "I already made reservations for your book at Barnes and Nobles.. onces its come out they will call me ☺️", "yournewnailtech": "I love you and your content so much I had to come and comment from my business page as well!! 🖤 oh my name is Tiffany and my other page is @Queen_Wilddfire 😁", "domo_arigatooo": "You are amazing, you are desired, your knowledge is needed! I appreciate all that you do. 💜", "lessamontyy": "Absolutely adore you Shannon! I’ve been following you since TGAW. You’re truly one of my biggest inspirations. You’ve helped me tremendously dealing with the woes of womanhood and sexuality in my teens. Keep shining & being unapologetically you + I’ll ALWAYS appreciate you right back. @shanboody", "domvharris": "Domonique", "shandn.e": "thank you for de-stigmatizing, validating and normalizing through sharing or addressing personal experiences, advice and education. I love learning from you and ur work :’)", "itstatgirl": "😂😂😂 Nice work I was thinking king about you doing it too 😅", "dicnyyy": "You're so beautiful Shannon. Can't believe you even exist. Keep up the good work and remember to take care of yourself. ❤️", "tomasjusttomas": "The wife and I love everything you do!!", "lemonpepperwngs": "I love how articulate and intelligent you are! 💛 Such a good example for all women", "sunalid": "Sunali 😍❤️🔥 You are The Queen!!!!", "leonicka_": "I loved your GoT vid! Fun and informative. Also bookmarked the 2nd ep of your podcast to listen to on my commute. Keep pushing, Shan!", "micahselena": "This is mad beautiful!!🔥 Fits perfectly✨", "cynthiaawashere": "Ahh! I love you and the work you're doing! I can also finally preorder your book bc I have a new address now! (End of lease+moving) ❤️🤗😭", "fireofsavanna": "lol you’ve got a lot of thank yous to do", "_cbudd": "You. Are. Dope. Af.", "shaka.lee": "You are an inspiration woman!!!! Such beauty and character too. ❤️ so much love", "chesliemarie": "Cheslie!!!!", "jsogalla": "Justine. I still rock my yellow \"natural\" toque on rainy days lol", "rosegoldeb": "Eboni here 💜 Your page is all about empowerment and accepting your boss babe, badassness and I am always here for that 🙌🏾", "emilieann10": "I loved your Game of Thrones video and can't wait to read your book! I can't believe I only just found your YouTube channel but I've been binge watching all your videos. Keep up the amazing work!", "baelafuentes": "Laila, you’ve taught me so much about myself from the internet thank you so much 💕", "elsaherve": "Elsa⭐️ Thank you thank you thank you for sharing all of your knowledge and thoughts!", "charandroses": "And that is OKAY! Grateful for your existence, art and all that you do Shan🌹", "im.seln": "@curlsloveceline hey gurrrlllll👽", "alpha.melanin": "You've been an inspiration. Thanks for being you, it inspires me to be me", "shantilofficial": "@shantilofficial", "ingridgilbertcoach": "Come say hello and keep on inspiring & teaching gorgeous! You're a natural! 😘🤓", "trinas_korner": "Girl you are an aspiration!🙌🏼🙌🏼", "violet.notes": "♥️♥️♥️", "yosh518": "You’re dope af! I first saw you on @timothydelaghetto podcast and I love that episode and I’ve been hooked ever since!", "brittanythehost": "🔥🔥🔥🔥", "senoj33": "Love this🙌🏽🙌🏽🙌🏽🙌🏽💕💕", "ayafrodite": "Love you queen. ❤️", "miwilli954": "July can't get here fast enough (low key I'm not rushing the end of summer tho LoL)", "makeway4tre": "Hey it’s Tre 👋🏼 we meat at wonderland 2 years ago 😄", "curlspecialist": "Hey girl! I hang out on your page to see your curls come out to play and enjoy when you make me think outside the box! Shai is a colleague of mine, I believe he’s done your hair before. Love your bodacious texture Miss B 🔥", "sextalkwitheleni": "You gave me the push I needed to start my sexual health career journey 5 years ago. I should be the one thanking you! 💕", "penguinsrrad": "Wow that looks awesome!! 💜", "cactushill": "I’m a huge fan. This pic is 🔥🔥🔥", "iconicchange": "We see you girl! 💖", "annisaikku": "You are so amazing and beautiful!! ❤️ much love from Finland 🇫🇮 - Anni", "lil_missjstar": "🔥🔥🔥", "djcdental": "Awesome!", "stephhryder": "Your videos have helped me so so much!!!", "kaitlinchapple": "Love love love your page ❤️ sounds like you’ve cultivated such a supportive audience here 💕", "deebrd": "I actually loved that video! I have been a dedicated subscriber for about a year and I love all your content. You inspire me to continue to learn and grow as a fellow educator. Keep it up girl! 🙌❤️", "victoriavadenking": "I met you at BeautyCon NYC in 2016 (I think) and we held hands for a picture 😅 haha (name is Victoria).", "_kijana_": "Hey ☺️", "nnebugod": "@nnebugod @amakacosmetics I am a creative entrepreneur.", "theamandaiam": "Yaaas Queen! Watching you evolve has been inspiring ❤️ I still have LAID 😂", "luisanag_7": "Amazing", "alison.midori": "My name is Alison Preston and I thank you as well. Sending positive energy, bless you and your advice 💕", "authentically_ti": "YAAAAASSSSS 🙌🏽🙌🏽🙌🏽✨💜✨ Tiara here 👋🏽 Been following you for years Queen and I thank you for every bit of what you do! 🙏🏽", "madspaige\nVerified": "Verified", "neurophobicandperfect": "Whaaaat, I don’t even watch GOT But I thought it was clever video, I was into it 👌", "primetimefitnesss": "Rohan", "nefeshop": "Wow🙌🏾 ❤️❤️", "carongaby": "Been following you for a long while now (like pre bedbug days) 😂😂", "mafayyz": "Very cool", "nesserz85": "Absolutely adore you and everything you stand for!!! Thank you for being you and keeping it real for all of us!💖 Vanessa here!💁🏼‍♀️ Hey girl hey!", "iamnancyjay": "Wicked 🔥🔥", "leti.raeh": "Letitia! Been watching since Those Girls Are Wild!!! Always been a huge fan, much love and congratulations on your new book! 🧡", "authoreve": "My name is Eve & you are one of my biggest inspirations ✊🏽 been here since the hair tutorials lol", "_lala_lana_": "@_lala_lana_", "dnicole1114": "You inspire me!!!😍😍😍 My name is Denise", "xbrittneyashleyx": "I just love this girl! Sometimes when I get love from strangers on social media, it blows my mind because it's a choice they make to give me the opportunity to feel loved. That in itself is a great feeling!", "nunusvybz": "Much Love Queen. Appreciate you out here courageously finetuning your craft. Xenia the warrior priness vibes.", "gabberoo": "If it’s any consolation, I LOVED your Game of Thrones Attachment video!! ❤️❤️❤️", "leahhjames": "😍😍😍😍", "gee2times": "We appreciate you Shan 🙌🏽💕❤️", "kilam3305": "This is dope shan", "sunnismilez": "My name is Sunni. And I love you too. Always have since the first video you posted", "itsyourgirlvic": "I’ve been following you for a while and I am in awe of the work you’ve accomplished! Keep it up!!!", "jaceeniblett": "Jacee 🌟💕 love you so much!", "fotocredfab": "My names Fabiola. I love your whole essence. Your advice and perspective is so open 🖤", "petty_human_emotions": "THIIIIIIIIIIIIIIIS🙌🏾🙌🏾🙌🏾🙌🏾", "melaninnqueeen": "I appreciate your work and look up to you so much. You’re amazing 😍💗", "rope.daddy": "Rope.Daddy😈😎😉", "unjadedjewelry": "💖💖💖", "lexisxg0ld": "Morgan😂😍😍👑", "k4clife": "My name is Kimberly. Love your work. I’m a Dean at a high school that focuses on social justice, diversity and empowering our students to be leaders and activists. Just today I was talking to some of my beautiful high school girls about being comfortable with their bodies, finding strength in their feminine power. Thought of when I heard you speak last year. Would love to invite you to our school. Looking forward to your book! ❤️🙏🏼", "ejbb_7": "Hey Shan! Youtube fan and former costumer here (counseling) So grateful for the discussions we had, when I needed them the most! Love, Enrique.", "joiimaii": "This is so dope! Love your discussion topics", "camacho_isamari": "I’m Isamari and your attachment video was a great conversation starter between me and a friend about our desire, boundaries, and fandoms!! I’m sorry you didn’t get the reaction you expected. Please know it def moved me!!!! ❤️🔥", "raneeblog": "This is amazing 🦋 - brynta", "blunyleworld": "⚡️👑⚡️", "kairasworld": "Hey Shan! Fellow Aries, Kaira here. Absolutely loving this! 🔥😍♈💜", "zaydaliciousdesigns": "I enjoyed the video. And this fan art is freaking AMAZING.", "taifromthetropics": "@taifroever ❤❤❤❤ I LOOOOVE YOUUU @shanboody", "bmorenaratchett": "Yesssss Ma’am 😍😍😍", "sharonndann": "Omg", "step.aknee": "♥️Yassss Renra Decordova!!! This artwork shows pure power!!!! ♥️💪🏼 Sending love from NYC! @step.aknee", "luckysuepro": "😍😍😍😍😘😘😘", "thelifeofleez": "Okayyyyyy 🔥🔥🔥", "missmeb0205": "Love it!", "v.oliviaa": "Hi Shan! How can I get your book in London, UK?", "jameon__": "Hey Shan!! This is Jameon, and you are so awesome!! 💕", "mrashan": "Loved you since I saw you on the view", "samanthamwayne": "This is 🔥🔥", "tanzaholic": "Tanekia 🌸 your videos are always a breath of fresh air! Keep at it! 🌷", "theveronicagarza": "@theveronicagarza", "chiaraamarie": "You’re so dope❤️ seriously I get so inspired by you🔥", "thetiffanyhan": "Omg I love this!", "adriennelives": "Yessssssssssssss", "imbaby.nai": "Omg!!! This is crazy 😍😍🔥🔥", "effy__00": "Stephanie ☺️", "itracynicolette": "I don't even watch Game of Thrones but this is fire🔥🔥🔥.. can't wait to read this new book! Already preordered ❤️", "iamakaysha": "@iamakaysha", "queensarabi_": "@queensarabi_ Newbie but I ❤️❤️❤️ your content", "blackgirlsaregod": "Dude I LOVE you. My name is Nick and i rarely comment but I've been following you on and off since I was like 17, and I'm 21 now. You've been instrumental in my healing process and introduction to sex in a positive light. You're so important! Don't you forget it", "lindseynolanportrait": "My name is Lindsey. I love you and all of your content. You enrich my life! 💚", "thisislaurenelizabeth": "Yooooo this is crazy!!!!", "rachethecheat": "This is incredible artwork WOW", "jaysnow23": "LOVE YOU", "yourfriendrosalee": "So freakin dopeeee 😻😻😻 my name is Rose.. sending you a bunch of virtual Roses lol been a fan since those girls are wild 😩 finally about to get the chance to read your second book 😬", "berlin_ave": "William", "nina_in_narnia": "@dannixxoo can’t wait for my birthday present to arrive !! 💕😘", "sillla": "Girl your such a positive inspiration. I love your content!!! I remember doing a show and you were one of the judges and you told me I should win the whole competition after you heard me sing. I’m sure it wasn’t because our sisters are close high school friends but because I am damn good. Thanks for believing in me 💜", "ayyonajanae": "💞💞💞", "alsndra6": "Alessandra", "kgrace7777": "My name is Kaelyn, thanks for the beautiful, empowering work you do!!! 💜💗💗💗", "thekatkiss": "@shanboody I pre-ordered a book on Amazon and I cannot wait to read it. ❤️❤️❤️", "yeezydior": "My name is Cymaiya and I’m a big fan of you and was sooooo happy to meet you at know your status two years ago😁😁😁😁", "ms_scrumptious": "Jessica from *The Scrumptious Family on YouTube... Love ya so much.... Your videos & so much more is so amazing to me.... Many More Blessings 😘💋👑", "kahili": "@hardlyonbutalwaysreppin omg will the goddess herself notice us 👀", "itsbe_za": "Hey 😍😍😍😍", "gaylyn.lareese": "Thank you so much for your nuanced approach to a lot of conversations that people are usually so afraid to have. I feel like you’ve helped me so much in the past two years.", "juwonadenise": "Juwona ❤️ love you videos and what you stand for!", "shelleyhamilton": "This picture is dope. Keep on being an inspiration! Everything about u, ur life, ur relationship is goals! -Richelle", "moondoggie517": "That picture is so cool 😄🙌", "itsvannit": "I'm Jovanni love your videos!! ❤❤❤", "reallollypop": "Latoya Boone", "moriah_chap_": "You girl are on fire! Keep it up and keep being an inspiration. And props to you for responding and interacting with your peeps! Keeping it real always! 🙏", "lifeofdianand": "You should get a copy of this and frame it.", "everlastingjade": "I love you.💕", "theflyingspur": "🔥🔥🔥🔥🔥🔥", "politetraveler": "Very excited to add your book to my reading list for 2019! Congratulations! 🤓📚", "cmoenay": "I subscribed to the email list after I took the quiz ❤️", "jane_nelll": "Shan, some of us just don’t get Game of Thrones. Nonetheless, I love you and appreciate your content! -Janelle ❤️", "_asia.asia_": "This is cool! ...Asia🤔", "oldworldnew": "Addie 💚 we all have our days. Renra has mad skills 😍 this is beautiful!", "desireemichele_1": "My Queen", "stevenm.5": "Started out watching you on YouTube originally then eventually had to come find you here. I've always enjoyed your content. Especially when you would do Head vs. Heart, lol! Keep being you Shannon! 👍😉😊", "thats.sew.sukeri": "Sukeri... thanks for being u ❤️", "donttouchmy_hair": "Hi I’m Sasha, I love following your story 🌻", "lavndrmenace": "Madeline! Love your page! 💛", "cawcamille": "My name is Camille. This is everything!❤️", "vanessaleerenta": "👏🏻👏🏻👏🏻👏🏻👏🏻", "vic_ozz": "Victor... I’m so grateful I’ve come across people like you on IG 🔥🔥", "isabellafletcher13": "Isabella 💕 I appreciate your page", "traychula": "@traychula 😍😍", "spelledlikebobmarley": "So excited to read 😍", "llamaliscious": "So glad I found your page, will be buying your book 100%. Thank you for everything you do ❤️", "checkup_onit08": "Cannot WAIT to read this gem! I’m Chierra💕", "terrell_davon": "Hi! I'm Terrell, been following you on YT for about a year or two.", "meaganksmith": "@mixed_in_america 💕💕", "artisticwonder": "Christine. 😋", "eyemworthy": "Not true! I really enjoyed that video. I learned a little more about myself and why my last relationship was so strained 💜", "abrieljoyu": "This is AMAZING! seriously some great talent! — Also love everything you produce and how hard you work. An inspiration to many!", "designsbykey": "Girl!! I am sooo excited for this! I be checking my Amazon orders like 👀👀👀", "helenalibang": "I’ve got agape love for you!! I appreciate everything you put out and I’m looking forward to your future projects and endeavors! -Helena ❤️❤️", "vu_____________________": "❤️❤️❤️", "technological_mentality": "Divine 😄 i love your videos !", "mosalofafa": "My Name is Mosa.. It means Grace and you have plenty of that.. I admire you🌺", "rosen_decluttercoach": "Wicked🔥", "_smaashley": "Ahhhh loveee this!!! Been a fan since ur photography days! (Nivea!)xoxo, Ashley", "slimfreck": "@slimfreck heyyyyyy shanboodybooty! 🧡", "memphisblu963": "my name is Blu when I first saw you on YouTube you talked about things that most people are afraid to touch and don’t know how I had to follow you I love the way you carry your self and you are so real thank you for inviting us into your world and teaching us things that really matter I can’t wait to read your book and to see what else you bring to the table Shanboody don’t stop you are full of knowledge", "tabiacharles": "That is amazing!!!", "duh_imshort": "Omg I love your videos. Whenever I need a boost of confidence in my romantic life, I always go to your videos. Thank you so much for being an inspiration to people that no longer want to go with the norm. My name is Markeya btw 🤗🥰", "13iconic": "Jazzy been around on and off since TGAW 😋💜", "tjsiren": "💕💜🙏🏽", "callme_oasis": "Naomi 💞", "chevydee8": "Hey girl I’m Chevaughn✨", "mimilambley": "You QUEEN 😍💗🔥", "stevie__med": "Shan being EXACTLY who you are (“privileged ass” and all) is why you inspired the masses. I love how you show your attributes AND your faults. But more importantly I adore the way you acknowledge both being grateful for both and showing how you work to improve and or show appreciation for both. Keep doing you boo! You inspire people like me daily! 😘", "_bumblebreezy": "@brethegodess", "littlegeri": "You're one of my favourite youtubers that has come out of Canada❤️🇨🇦 thanks for always keeping it real", "tsutsu89": "Shaundra. I love you so much and appreciate the amazing woman that you are and have shared with the rest of the world.", "chris_wolf_landry": "Chris hope all is well", "__veronica": "Hi I’m Veronica! You’re kinda my best friend in my head🤣", "muy6yrn": "😍 Angelica", "ms_mahea": "Mahealani. Have felt nothing but inspiration, drive and good vibes since following you. Thank you 🙌🏽", "desireechanel": "Desiree ! ❤️❤️❤️❤️", "superharo": "Haro! 1. This artwork is 🔥🔥🔥 and 2. Thank you for your existence on this planet and all that you share!", "jodianne.beckford": "Shannon!!! You are beyond inspiring! Queen 👑💕💕💕", "bizzyx": "Elizabeth, so excited for your book! 💛🔥", "christacamarillo": "@christacamarillo newer follower. Dig your vibe, hair and just you. 💜", "labeebakay": "Labibaaaaaa", "__nadsz": "I admire your work!", "himalayaness": "@himalayaness Love you!", "krysbeglowin": "Hi, I’m Krystal! Love all of your work. One of my absolute favs is the video shoot you did with hubby! Loved how raw it was and how you are super down for him. I might have watched that video 1000000 times. Keep up the great work! We are all rooting for your continued success! 😘♥️", "mrs.islandsouljah808": "My name is Kuukeiahleilani Nd I’m obsess with you Nd what you doooooooooo", "hellomsb_": "Brianne", "houseofsoul.studio": "@shanboody I love the image and detail captured in it, down to the necklace🙌🏿!", "babisanoja": "Barbara! And you’re a huge inspiration to me 💗", "teacherbae": "My name is Chelsie! I am a teacher and you always remind me how important it is to discuss healthy relationships and boundaries with my students, especially my girls! I am also so proud to see you SOAR, you were made for this sis 💛", "fadumofarax": "hey, my names Fadumo!! Keep shining, love you 😍❤️", "amberscloset\nVerified": "Verified", "thecharlessmith": "Gyaleesi", "gaylerenee._": "Hi I’m Gayle Renee 🖤 & you’re bomb af! 💕", "thejazzynation": "This is dope! And I will have to watch, I realize I’m not seeing your videos like that so I’ll have to turn on my notifications.", "mostoftaylor": "My name is Taylor and I am currently binge watching your videos as we speak. I love how authentic and real you are to yourself and the universe. It takes a strong and connected person like yourself to give back to others in the most fearless way. Keep going! Keep preserving. Keep pressing forward. But most of all, embrace every feeling and emotion. There is no destination to your journey remember that. Yearn to elevate just as you are❤️❤️", "i_love_gdub": "Gary White", "keepingsunshine": "My name is Gabby :) hello hello!", "shanevagwenice": "Hiii my name is Shaneva💙💙 you're so amazing", "egarcia513": "Kat", "mx.mikey_": "My name is Michael! and i love all your videos and the amazing work that you do! 💕😘", "mye_tie": "My name is Tie !!", "kaynic5": "We all love you and the messages you share... you got IT and IT can’t be taught. Just something your born with! No such thing as losing.. you win or you learn! Keep chasing your dreams girl!", "simplydovania": "Hiiii! Love your content. I usually catch up on Sundays when I'm off of work. Xoxo Dovania.", "maryan303": "My name is Maryan. Can't wait for your book!! ❤️", "cedricislife": "🔥🔥🔥", "esther_vencia": "@esther_cherenfant", "ms.nekki.nek": "My name is Shaneika and I just loveeeee u. 😍😍", "miz_jackie68": "Awwww Just remember, you are human babe. We all feel some sort of entitlement but the best thing we could do is recognize and get back in our humble lane. ❤️😘💋", "carpe_diembri_nicole": "@shanboody I love this! I'm Bri, btw stumbled upon your YouTube awhile back and I've been following ever since! 💚", "xx.taty": "@mamiandkalani ❤️❤️❤️", "raec.rose": "Loooooooooove youuuuuuuu❤️❤️❤️❤️", "khleothomas\nVerified": "Verified", "mhmjanae": "My name is Janae! 🖤", "abouj": "Aicha! I remember the first video I watched of yours and I recognized the Moroccan dress! Can’t wait for the book!", "claujograms": "My name is Claudia. Your videos have been a big help to my awkward ass self. Thank you so much ☺️", "relentlss__": "Olimpia! Gurllll, you are a true inspiration and my biggest crush. Keep it going babes!!! 😊😊😊", "dean_trademark": "Hi, Dean here 💕 Thanks for being you! I’m still struggling with finding myself completely.", "lafemmefiji": "Hello gorgeous QUEEN 😍 My name is Chrystal-Lynn ☺️", "risquethoughts": "Risqué Thoughts-You are amazing! Your videos always hit home. But remember you too are constantly growing and maturing your craft. Continue ❤️", "hindhalim_": "Hind (pronounced hend) love your page !!!!🙏🏽", "hiiighfrequency": "ur fucking bomb + literally inspo for a majority of my episodes. thank u 💖 —- @hiiighfrequency", "kohtankanday": "🔥😍😍😍😍😍", "jesscurlsz": "@jesscurlsz Been following you since the “those girls are wild “ days and I fkin LOVE YOU!", "za.boothe": "Love you!!!!💕", "_thesociallight": "@_thesociallight", "airaza21": "Azaria. LOVE YOU SO MUCH @shanboody", "sopa_cay": "Ur fire 🔥 that is all", "sio.leonard": "LOVE! I’m Siobhan. ♥️", "sassyjpalmer": "My name is Christy and I can’t for my copy of you book!! So ready!!", "young_gemini": "Fatima ~ love your page ❤️", "toitotheworld": "@toitotheworld love your work 😍😍😍", "danicacorin": "💕Love you!", "lilliannanajera": "I’m lilly...just found you recently. So happy I did 💛💛", "xaymacanheritage": "I keep wondering why I have not seen a video from you on YouTube. I have to search your name. @xaymacanheritage Michelle #ConversionDisorder", "molina_tfj": "My name is Molina big fan💕💕💕🔥", "yoursmilesonfire": "Shannon, we share the same name!", "shani_nika": "Sending love to you boo. ❤️❤️❤️🔥", "ifomagenevieve": "I love this so much!!! I love you and your videos so much!", "millla.jay": "My name is Jamilla! I think the video was great! ✨", "_m0onch1ld_": "So badass!!", "ashleymariegallo": "My name is Ashley. You are amazing and so knowledgeable. I’m grateful to have passed your page and followed you ASAP 💛", "mahasull": "The name is Maha 💁🏽‍♀️ I love everything about you and all that you do. I got so much respect for you. You fasho know I had to preorder The Game of Desire, not only to read and benefit from your book but mainly to support you. I believe in you and your work so hardcore 💕💖✨ Love you sooo much 🥰", "beautee_85": "Hey @shanboody 🙋🏾‍♀️ Tee here. Love that you’re doing this. Been following you for awhile now and I have seen how much you’ve grown. From your friend (in my head lol) I love to see you winning and all of your success. There are many more great things ahead for you 💕", "danasc.ully": "I ADORE you", "free_mithoughts": "You're always appreciated girl! 🥰 we know you put in that WERK!!", "rayyturr": "Rachel! 🇨🇦 u are pure🔥🔥🔥🔥", "mzccd612": "My name is Ciara and I love what you do. Can't wait to get this book! Go girl 🔥🔥🔥🔥", "thecandacesmith\nVerified": "Verified", "rose_desid": "My name is Rose 🌹 and you inspire me to become a epic sexologist 👏🥂💝", "alexharte": "I’d follow you 💥", "jazellesartistry": "Jazelle 💕 Always sending you love! 💕", "thisisbindi": "@thisisbindi !!! I love you and your presence and representation of freedom and independence and love all wrapped up into one. You’re the definition of a woman and it’s refreshing !!", "smooothchlate": "Allan A, looking forward to reading the 🔥🔥 we been waiting on @shanboody", "csnotepoems": "Carlie. Thank you for the work you do! 🙌🏾", "chrissy.paige.model": "My name is Chrissy! Love your work babe♥️", "laurabduma": "Aw! I love everything you do! Sending so much ❤️❤️❤️ 😘", "emanyouehl": "My name is Emmanuelle & this picture is IT!!!🔥", "rabiaseye": "Hi, I’m Rabia! Thanks for all the work you do ❤️", "cyd__cyd": "Cydney Ellis ❤️❤️❤️omg i love you !! I was so happy to come across your YouTube channel", "abri.ana.jo.i": "Hi beautiful!! I’m Abriana (ah-Bree-ah-nuh) Holliday! I freaking love you and I appreciate the videos you have done on open relationships and sexuality ❤️❤️❤️ @shanboody", "corinichelle": "Cori 💓", "theviragoto": "Tashika here 😊 and this is badass 🤘🏽🔥👏", "museofsorts.jpg": "This is incredible!! ❤️", "christina_dora": "Christina ✨", "starseedk": "You’re the one true queen girl 🙏🏼 xo, Kelsey", "brey_eva": "Breyana & your my inspiration💕❤️❤️❤️✨", "sylviebee.g": "I watched the GoT Attachment video, totes enjoyed it 🔥💖 keep being amazing", "vaane33a": "🖤🖤🖤 super sweet!!! Love this!", "flacko.rembrandt": "I’m Gelani this right here this is amazing 🙌🏽🙌🏽🙌🏽🙌🏽", "niaskindaneat": "That video was so good too! I honestly wasn’t expecting to have a secure attachment style 😂😂 my name is Nia Pipkin-Glover, and thank you for all of you amazing work! ❤️", "tomi_inherent": "Looking to buy the book, waiting for the money, all my love and views in the meantime 💪🏾❤️✨", "signaturetalentsmua": "This is amazing and gorgeous 💜💜💜 Tricia @shanboody", "msginger2013": "My name is Ginger. Keep making your awesome videos.", "canwetakeamin": "Pierrea", "bakiiibakiibaki": "I just wanna say I've been following you since I was in middle school! You've just been a resource for me in so many ways! Much much love!", "kieraplease\nVerified": "Verified", "macy_isabelle": "my name is macy!! i cant wait for your book!!!😱", "_26.08.03._": "My name is Aldi. Love you so much!❤️", "audreyc.lomba": "Yo yo yooooo!!!!! I left you a video on Hangout! Can’t wait to chat on Sunday!! (:", "bre_new.yorker": "Brittanie 💜", "darkbubble": "Lise🤗", "lalalalatifah": "This is AMAZING 😍", "camcobb": "Camryn ❤️ love your work and we have the same birthday!!", "ms.multifaceted": "You're fabulous, Shan! -Ayesha-", "vareckles": "Valerie 💖💖💖 love your work!", "johnkornegay": "This is a positive usage of social media!", "themaradiaries_": "Jamara 💙💙💙", "shenellvictoryah": "Hey girl! So proud of you. It’s me... Shenell", "sian_elizabeth1": "You're amazing and crazy talented and influence so many people with your bomb personality. ❤️", "aliceblmrcx": "Cest elle que jte parlais @gabie_gal 👌🏼", "magentacassatt": "Magenta... living for your work!", "keeganjosepp": "Keegan ❤️ thanks for all your work!", "vazzzy": "@vazzzy", "merdockparker": "This is too hot🔥 also how did it bomb? I thought it was a fun video", "freshprinceofzimunda": "Freshprinceofzimunda", "erika_arg1": "🔥🔥🔥", "oneboobpodcast": "😍😍😍🙌🏽", "queen0fthefall": "Love you!💕🙌🏽", "sylvia_theartist": "Sylvia ♥️🙏🏽", "iamirinadovgan": "So good! Wow. Gorgeous!! 👌🏼", "nicolleili": "Nicolle ❤️ & I have “I own it \\*/ they love it” tattooed cause of how much you’ve inspired me ty ❤️❤️", "lord_harper_246": "Joshua", "melgotit2": "Yerrrrre!!!", "freshwatafletch": "i love this sm", "v._ash": "Varsha 🌸", "milajanelle": "Love this and u! - Janelle xx", "iamfilmore": "Dr. Jennifer S. Perkins", "gavinreus": "Gavin 😌💙", "eveyjonez": "Evey", "_jackiki": "Jackie 🤗", "jaynation23": "Your videos are always dope!! Jeremy", "peachesandsprinkles": "Carly 😍😍😍😍", "curlsbysunflowersandscissors": "Kristy 🌻 I adore you!!!!", "sstrongstyle": "You deserve all the kindness in the world!!!!!!🔥🔥😍🔥🔥", "elisa_2812": "Elisaaa😘", "kandicedanielle": "Kandice. I went straight to the quiz while I was watching the video and actually got Secure Attachment. Definitely thought I was going to get Anxious Attachment lol", "femennei": "Anne 😍", "taken_on_the_wrld": "Amazing picture", "jcaalder": "Jonelle!!", "bobbilanea": "Bobbi💕And love you Shan!! Your content is always helpful and inspiring✨✨✨", "solokari": "Keep up the good work", "arielblair_thebelizean_doll": "This is beautiful and so are you @shanboody ♥️", "floremz": "Mariana 😻", "thensidertv": "Nadia!!💕", "kiannabanks": "Kianna !", "perfect_quincy": "Quincy!! I LOVE U SHAN 🌹🌹 UR MY QUEEN", "asheraarmour": "Ilana", "chivonjohn": "Sending love to you Shannon!", "m.riha_n": "Fariha Xxo - your videos make me happy and help me a lot 🖤🍅❤️🍅🖤", "saliamarie1243": "My name is Salia. Can't wait for my copy of your book 😍", "selkhet33": "🔥🔥🔥thank you for everything you do❤️", "reyez.ro": "😘🙌🏽❤️😍", "thetrapwitch": "Tatiana. I love you and all your work queen and the love that is you and @enjoyjaredbrady", "sincerelysurmone": "Amber 💃🏾", "gypsy_blacc": "Bryanna ✨", "jazzi3butterfly": "Jasmine 🦋", "latinaflamez": "Mizz 🧡", "ashlesha_moon": "Vesna ❤️", "jamaicawest.nyc": "LOVE YOU SHAN !! You’ve helped me embrace and logically make sense of my sexuality, relationships, and desire for desire. 🧡 I feel like such a late bloomer at 26 but you have really made me into the woman I am today", "tus.nalgas_": "Ivette rubio ! ❤️", "maybeonmars": "Ziba 👅", "oliveyou_olivia": "My name is Olivia and I think your page and all your content is so amazing and so relevant, so THANK YOU!! ❤️🔥⚔️", "msmith71519": "Meghan!!💞", "_rastagyalash": "Ashleigh ☺️", "yourtravelwitholivia": "This is AWESOME.. I love this 🔥", "leidylopera_": "Leidy 🐞", "nao.delacruz": "naomi! 💛", "vintagegirl4": "Amazing!", "empressemrys": "Jordan :]", "brooke.lynn.ambrose": "Hey!!!", "_nerelllyy": "Love this and you", "abvii_": "Abril Victoria♡", "lynn_justcause": "Mariah yeargin ✨", "melismanzo": "Melissa 🥰🦋", "the_jolly_juggernaut": "I love your energy on insta! -Eman", "hannahsmorrison": "Hannah Sionead 💕", "sandyysinghh": "sandhya 🥰", "chelseagirvan": "Chelsea 😘😘💘", "afeelizabeth": "Love this"}