{"amani_ward": "Anything helps during these difficult and unpredictable times 💗 Cashapp: $award0812 Venmo: Amani-Ward", "uriahb_": "cashapp: uriahanjea paypal: uriah.bussey@gmail.com  teaching visual artist :) main teaching gig cancelled, & my artist residency is temporarily abandoned. not allowed to work in building.", "lovelyjessmarie": "Latino and other communities are suffering as well so you should make effort to help other communities out too. This is upsetting", "claudiayankee": "Venmo: @claudiayankee Cashapp: $claudiayankee • Consultant/entrepreneur & single mom paying for my son’s college tuition and a mortgage", "fiftyshadesofj_": "Literally displaced college student, which means I cant work at my on campus job. now I dont have a job so I dont know how tf I am going to afford anything. (Ik u said we don’t need a reason but I am just feeling stressed and felt like sharing) Sending love and manifesting better days for everyone affected 💛💛💛Cash App: $jdmmcneil Venmo: Jdmmcneil P.s, Thank you, Ericka. I appreciate you.", "poohbay": "Single mother, lost job. No ideas what’s happening with unemployment. PayPal: graystastytreats@outlook.com", "controversialtay": "My mama who is a barber and has had to turn down all her client's cashapp: $reseecuts | My payment info: cashapp - $TaylorAmariLittle, venmo - tayamari, paypal.me/controversialtay", "steffie.ap": "Venmo: @Stefanie-Peart Cash App: $StefanieAP I’m a college Senior who was forced to leave my permanent residence on campus, and was laid off from 3 jobs. Anything you can give will go a long way ⭐️💛", "amor_de_sol": "@ihartericka Speech language pathology student here feeling the financial effects of not being able to work during covid -19, unemployment is so overloaded that calling and attempting to go online is futile because the site crashes and the lines just hang up on you. I DONT KNOW WHAT TO DO AT THIS POINT 😭🚨🚨🚨🚨🚨🚨🚨🚨🚨 HELP🚨🚨🚨🚨🚨🚨🚨🚨 cashapp: $ALEISHASTEWART , PayPal: https://www.paypal.me/AleishaStewart25", "babymamahood": "Venmo: @mamajujuangeles CashApp: $mamajujuangeles PayPal/Zelle: jujthepoet@aol.com  Student midwife and single parent", "king.bridges": "I am immunosuppressant and am on my last bit of groceries. The most important thing for me is to protect me health and family. Anything helps 🙌🏾 Cashapp: $dakingbridges", "legs_vs_theworld": "venmo: @allegra-phox cashapp: $allegraphoxx", "mar_velouss": "cash app: $marline909 😩😭", "osa_la_diosa": "Cash App & Venmo- OsaOsa Zelle- Osadrisff@Gmail.Com  I am a single mom of a 3yo in the Bronx, self employed health and wellness consultant and I have been struggling since Jan 2020 a little after the 🦠 was the topic of conversation everywhere. Then I completely lost all my clients by the middle of Feb 2020, I am the only income that supports my child and I. I know there was no need to share a reason but I love to story tell and I’m grateful for everything I can be blessed with to help during these difficult times. Thank you for this initiative and for anyone who decides to send me some survival funds 🙏🏽💚✊🏽✨🙏🏽", "letmebrea": "I hate to take from anyone who might need this more than me, but thank you so much if someone is able to help me as well 😭🖤✊🏾 black trans queer fssw, unable to work & having to self quarantine due to immunocompromised + disabled w/ chronic pain & mental health issues 💀🥴 PayPal: letmebrea@gmail.com Venmo & CashApp: letmebrea", "roseprincess2222": "https://en.m.wikipedia.org/wiki/Tuskegee_syphilis_experiment", "peyton.alyse_": "I need to pay my rent", "darastarks": "I could use help for groceries as well as money for a new laptop! My classes have moved online so I need reliable access to a computer, which I don't have. Any help is appreciated! Also if any of y'all know where I can get free online access to textbooks, 👀 holla at your girl", "smakkt": "❤️", "wxtchy_and_bxtchy": "Venmo: StevieLee Cashapp: $spudthestud", "rosetampon": "$dogluvr :) venmo: blcknqueer 💘", "tracimyhusbandisadorkbranch": "Bartender!!been out of work for far to long because of this and am panicking over bills, food and rent! Trying to keep it together for my 8 year old ❤️ blessings in advance 🙏🙏 Venmo Traci-Burnett-4", "chantel_mcneil": "Soon to be college grad (if COVID doesn’t take that away) with no place, reduced hours, and now scared for my life trying to find full time employment during this pandemic. I know we don’t need a reason, but felt like sharing. Looking forward to better days for everyone, and a big thank you to all of the essential workers out there for us everyday! 🧡✨ Venmo: Tieagra-McNeil Cash App: $TCMcNeil PayPal.Me/tieagramcneil", "k_wattttt": "The second I get that $1200 deposit from the govt I will be sharing it with people who need it more than me 🙌🏼", "fumiiii_": "Two babies under two. Trying to make ends meet. Venmo: @fumi-Kivalu", "octavia_yearwood": "Please donate to @_oroori_ that’s fam who continues to give back to community through art and @freebrunchprogram ... They are a family of 5 that was evicted during this time❣️🙏🏾", "daisy1913_": "Back in the day we would have rent parties to help someone. Since we can't congregate you can have a paypal party.", "aopoka": "Venmo: @aopoka ❤️❤️❤️ thank you in advance. The art scene is getting hit hard", "keikoel": "Philadelphia based queer that has lost freelance gigs and now day job as nanny. Anything helps, thank you 💓 venmo: @crawzaddy cashapp: $softandtender sub: onlyfans.com/crawzaddy", "briaes": "$ExquisiteAnthoni, black nonbinary person. Just short $60 for rent, I can pay it back💕💕💕", "kelsoloves": "$kelsoo4. Is my cashapp. Im a black philosopher and i work in education and the school year has pretty much been cancelled. Which sucks. Anything helps. Plus my bday is saturday ❤❤", "layla_synclaire": "Thanks for your consideration for US $Synclairz", "hllobrklyn": "Cash App: $hllobrklyn / Venmo: $hllobrklyn ...got laid off from my bartending job, they’re probably not reopening. It was at the airport so business was already dramatically slower before the governor ordered the closures, and I’ve been struggling since late January because of this virus. I’m getting $450/wk from unemployment and just got awarded only $16 in food stamps/mo for my 13 year old son and I because they said the unemployment is too much! Rent is $1650 and I could only give my landlord $1000 yesterday. Lost health insurance and can’t get meds. Credit cards almost maxed out, expired car tabs etc. someone stole my son’s bike. I could’ve on and on. 2020 is on one!", "flowersrisin": "$briebanksss deserves. she is a photographer with captivating skill and my sweet, dear friend. please give what you can. ✨", "feliz_sam": "Cash app $SamFel, Paypal.me/samfeliz10, venmo Samantha-Flores-137.....thank you for this opportunity. I won't be able to go back to work until the end of August and have no source of income or financial support whatsoever. A little will go along way! Thanks again.", "fatass_stonerbitch": "Black non-binary person who just got out of a abusive relationship where my pots and pans and money was stolen and i could use the help. Cashapp is $stonermistress", "autumnperri": "$autumnplewis — Black freelancer (social media management & marketing), farmer, and organizer who is immunocompromised, trying my best to provide for my disabled, diabetic mother. Any help/leads would be greatly appreciated.", "dommy7nine": "black disabled newly-not-homeless single momcashapp/venmo: dommy79 THANK YOU IN ADVANCE🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "jenniferlora7": "$jlora7 is my cash app. I am disabled I currently live with my mother who is disabled as well. Anything will truly help.. thank you!", "iamavamusic_": "$AvaryWilson extremely grateful for anything during this tough time.", "_ajaimani": "Venmo @AjaImani CashApp $AjaImani", "poethiquee": "♥️♥️♥️♥️", "sarahannsheldon": "❤️", "grrdnldmr": "cashapp and Venmo: Gdamar 🙏🏽✨", "emi_hinckley": "❤️", "fatherfannie": "venmo: @FatherFanni3 paypal: fatherfannieb@gmail.com cashapp: $FatherFannie", "_jazislife_": "Venmo: jazislife", "daddypuss.rex": "@suzanneforbesartist donations needed! 💖", "sonofgod_jesus_protects_me": "Black Business Owner! I started a business from the bottom up (Fully Licensed, Insured, & bonded) to uplift my city (D.C.) and cannot get a personal loan! I’m out of work until further notice and need any help I can get, can’t save up the money to make better jobs for my community due to everything currently happening (Covid-19). Thank you all, stay blessed and healthy. Cashapp: $DamonDaddyDick Venmo: @Damon-Salvatore-1", "momomophoto": "💜$givenolwazimomunny", "jahseh_jahseh_3": "The people in this post who actually deserve help are disabled💀 I stg all these black people and lgbt people swear they’re owed something by society. You think you’re so special cause you’re “different” like bruh stfu you aren’t owed shit cause you’re a fucking freak or cause of the color of your skin", "babytinc32": "💕", "nicomagloire": "❤️", "thetendertender": "❤️", "patty.grimmer": "❤️", "pusssywitch": "💜💜💜💜💜💜", "dontcalluscrazy": "❤️", "maitirose": "❤️", "blackgirlstexting": "❤️❤️❤️", "l.a.ure.n": "College evicted us and is now storing most of my belongings with no mention of when I’ll receive them, lost all streams of income. $llauren20", "v.la.rr": "❤️", "emilia__phillips": "❤️❤️❤️❤️❤️", "kiri_jessie_nelson": "❤️", "lanijaebae": "I’m a substitute teacher with no pay at the moment. Still looking though! Cashapp: $getgoodgraphics 🙏🏾Appreciate ANYTHING", "norawear": "♥️", "robbinmcarling": "For anyone that may be in the Midwest (Illinois, Kansas, Missouri, Oklahoma, Arkansas) I work for a company that has a program called The Giving Branch and you can go on their site and request assistance with bills, etc. thegivingbranch.org", "lori.sara": "❤️❤️", "ronyeduardo": "💖✨", "theashleyhand": "❤️", "catkincatherine": "❤️", "mbow__": "$makbowd @Mak-Bowdren Black trans artist no longer able to work and no longer have studio access I pay out of pocket for medication I take daily 💓", "madison.isaacs": "❤️❤️", "sarahkatherin": "❤️", "jalenfrizzell": "❤️", "terina.scia": "❤️", "ceelexo": "$dehlex @dehlex https://www.paypal.me/dehkwong", "__e.ri.ca": "@MixxTresses on Venmo. Upscale Natural hair care salon in NYC. Mother of two and unable to work since my salon is closed, right after having to take three weeks off to recover from surgery. I make custom wigs/units, clip ins as well so would love anyone’s business in place of a donation or for you all to just share my page/business please. Looks can be seen at www.mixxtresses.com. Thanks in advance and stay safe ! This too@shall pass 🙌🏾💪🏾🙏🏾", "theechandaaime": "🙏🏾 $ChandaAime I had surgery right before this virus, I'm having complications but can't go in the hospital due to Corona so I'm in bed about 22 hours a day praying I dont get an infection and can hold off for a resection surgery once this is all over. Everyone please stay safe and keep others safe💕💕", "4everugly": "paypal.me/ellerywalk", "bigbabypokes": "Venmo: Exgirlfriend PayPal: gdeannalandrum@aol.com CashApp: Xgirlfriend", "mswrightsway\nVerified": "Verified", "naturallysandy": "Small business owner, 8 months preggo, paying out of pocket for medical expenses and a renter trying to prepare for baby. $ShadaYouSlay", "meghannelson": "❤️❤️❤️", "maiaxcorinne": "❤️", "sarahjfike": "♥️", "rooteduyoga": "Free lance international educator (children/adults/yoga + languages + leadership & character dev + school subjects + etc). Anything & everything helps. I’m also open to accepting new students online $rootedu / @rootedu", "missalanablack": "$LannaDonna ❤️ In need of some help after being laid off! Anything is appreciated!", "ckkilbane": "❤❤❤", "m.ire.poix": "❤️", "franhhope": "♥️", "stephanieugenia": "❤️", "star_latte": "Disabled, lost my job. Still have to pay rent, get food etc. No helps came through yet. Cashapp: @starlascoop", "nambyyy": "❤️", "kasthepoet": "Open Mics are postponed, teaching is cancelled, and chapbook orders can’t be filled right now. Literally anything would help. Cash App: $KasPoet", "beautiful_since87": "Just seen this post, hope I’m not to late. $Karmkell anything is appreciated. ❤️🙏🏾😊", "_strawbrey": "❤️", "rileymarch21": "❤", "wassup_kate": "❤️", "goddessperroh": "$goddessperroh", "homewithharm": "$harmhem / paypal.me/harmkai ❤", "fleenstar_": "Cash app/ @$fleenE", "selimx1": "Venmo@sx480 cashapp$nxw1", "loragordon520": "❤️", "farhiaaali": "PayPal Farhia Hassan Alo farhiaali23@gmail.com Thank you❣️ 🙏🏾", "gus_and_lauren": "❤️❤️❤️", "rudder_beau": "❤️❤️❤️❤️❤️", "imaa_ayebea": "Venmo - Imaa_NA Thank you for this!", "honeybluclue": "full time creative, all shows have been postponed, Los angels rent is not budging i appreciate y’all. cashapp:: SNAKESKiiN 🖤", "_indifferently.toni": "Cash app is $Toni1995", "liv_garrison": "❤️", "rd_toys4sale": "Living in Seattle has taken a toll, I'm a freelancer and teacher and can't receive unemployment currently and groceries are harder each week and a move coming up next month I gotta save if I can without work, selling my belongings, venmo is @rdiamond25 anything helps", "kenyaisahrebel": "$kenyathompson", "singledadsfindwives": "Groceries running super low, send help🤍 Cashapp: $moneybeardd Venmo: $Liwbri5532 Corona said fuck everyone. Fuck yo school. Fuck yo job, fuck yo relationships. Fuck yo life", "medusabegam": "Cash app: $medusadior, Venmo: Medusa-begam", "__iambria__": "Cash app: $BriaMcCallum I am an educator, tutor and business owner. Had to stop tutoring which and business events due to this pandemic which was how I was able to pay my rent and sustain my livelihood. Any support would be helpful", "sweetpdz": "Paypal: PayPal.me/dzidzonu Cashapp: $dzidju This a frustrating and stressful time to say the least. Also thank you @ihartericka for all you and Ebony do. I am forever grateful. 💜", "blkncomely": "I negotiated with my roommates to pay 1/3 of rent since I didn’t have time to clear my room out in time to stay elsewhere. Waiting on remaining relief funds. Was told they would be coming in by the end of this month. Venmo: @ Rachel-Ellis-28 cashapp: $rahelneirene", "minnie_daartist": "$Minnie69ine", "p.bella.k": "❤️", "jerellresoort": "1) it's not violence. Landlords need that money. It's their job 2) don't include people who entered the country illegally and don't even pay taxes", "daniellegazi": "$danigazi", "melissafac3": "❤️", "freddiewebster.3": "$FreddieWeb yeah this is ridiculous 🥺", "michaelrhodes1": "💙", "addicted2blak": "This is so appreciated...Community Healer/Asian Bodyworker...Had to stop taking clients March 16.So Much Gratitude. Venmo. Tristen-W /PayPal itstartsinside@gmail.com", "kelseyarrington": "$karringtonstudio photoshoots cancelled until further notice.", "melanityy": "❤️", "kayjay1400": "Venmo: @TheLovings", "shawty_2100": "cashapp: $diamondthottie", "jazmine_joyner91": "💖💖💖💖 Venmo: @ Jazmine-Joyner Cash app: $jazminejoyner PayPal: jazwrites91@outlook.com", "ajira": "🙌🏾 ✊🏾 🙌🏾 Venmo: @ajira Cashapp: $ajiradarch ♥️♥️♥️", "tha5oloist": "$Tha5oloist888 💚🌻", "beingjadaleigh": "$JadaBelton", "skye2014liberation": "landlord is basically a slumlord... in this building there's no moratorium on rent, even if a person loses their job. Sure he can't evict us, but knowing his evil ass, he would call the cops on us and try to get us arrested for trespassing!", "allieschwenn": "❤️❤️❤️", "minimichelle5": "💕", "thatdude_charlie": "Black trans organizer who is Quarantined next door to transphobic neighbors & unemployed due to Amazon’s unsafe social distancing practices. Cash app: $mtndw", "supershara": "Venmo: Shara-deshara | cashapp: $supershara appreciate the help! ✨ Thanks! 💕", "balirococo": "❤️", "jessicaaahhhhhhh": "❤️", "cgr2k19": "$Shanrell", "wity_wit": "❤️", "mcnay.miller": "❤️", "imalady_ish": "❤️❤️❤️", "irisdivinemessages": "I give tarot readings. I can exchange readings for donations as well. Cash app Irischarmsyou", "lizzgatzunis": "❤️❤️❤️", "sukaynah79": "Not here for myself my job has afforded me the luxury of working from home but my friend @cydd___ sent me this earlier ::My very close friend had a house fire yesterday and he and his roommate lost everything. The fire was started by his neighbors that were fighting and one of them started the fire. We are trying to collect donations to help him get back on his feet. If you can please make a small donation, I would greatly appreciate it! I donated what I could now I’m asking you/your followers the CashApp : $FAndMFireRelief Venmo: @Murad-Herbert-1", "adeva610": "In advance I’m grateful and will pay it forward✨🙌🏽✨ $troya610", "wanderlustkei": "❤", "bri.farber": "💗", "valentina_sie": "❤️❤️", "madisonwoodard_": "@Madison-Woodard-10 just lost my job due to the virus I’m trying to help out my family", "_pxssycontrol__": "Venmo Pxssycontrol", "hippysunflower1": "Cashapp: Bklovehaus Venmo: Sunflower-rose", "keelyn.taylor": "❤️", "winterbreeanne": "$WinterMini Venmo: Winter-Bree 😫", "whereisneva": "I wish I had more to give but some friends and I created a free affirmation work book to inspire hope to us all. If interested, please check it out in my bio and insert “0” when asked for a donation. Much love family.", "cornbreadbihhh": "Single mommy of 2 stuck at home and out of work because the schools are closed .... sigh 😔 Cashapp $CornBreadbihh thank you ❣️", "johninthemiddle": "Michael-McIntosh-5", "doula.vanessa": "Black Birthworker & lactation counselor significantly impacted by these stay at home orders. Cash app: $vanessahanible", "terakayy": "💛", "stephsilb": "❤️", "jessgotclass": "❤❤❤", "stephaniebrooks92": "❤️", "carson0414": "✨✨✨✨", "shalemar_1": "Venmo: shalemar-Davis Cashapp: $shalemardavis", "soulful.nutrition": "$SoulfulNutrition Sarah.soulful@gmail.com 🙌🏾🙏🏾💖", "thatkiddmaya": "Cash app: $MayaDominique 💛", "positivepineapple23": "Venmo: plaidcineaste // 4623 Just lost my job yesterday after being told my job was safe during the pandemic. I have some money, but will be losing my insurance and I have about 600 dollars worth medicine monthly. Scared just like so many of us in the world. Anything would be sick! Thank you for help.", "filtered_specs": "$ErikaJ97 anything could help honestly ❤️", "chynnadollyogi": "Venmo: @Chynna-Davis (Jonah hill pic) CashApp: $chynnalaurendavis PayPal: chynnadavis3@gmail.com 🙏🏾❤️", "elliott.ray.lassi": "Queer Musician and cycling instructor from the Bronx 👋🏽 $ElliottRayLassi PayPal.me/ElliottLassi ❤️❤️", "sleeplessautumn": "❤️", "karinallison": "❤️", "_puello._": "Venmo: noelpuello CashApp: $npuelllo . Also my PayPal and Zelle puellonoel@gmail.com!! Needing help ASAP to help pay for my mothers medication. Anything will help", "sweettfactory_": "$Sweetfactorxy I really need to help my mama with her rent, can't have her getting evicted at a time like this. I wish I could help more but my hours have been cut like crazy", "daniellecarelockstudio": "Danielle-Carelock (Venmo)", "eekchilly": "❤️", "_lavenderdee": "I hope you all are staying safe and healthy. All the love and prayers go to my brothers and sisters. The last of my savings went to my rent & I live in Boston so yall knowwww that rent is more than that check we suppose to be receiving lol If I am to be blessed with more than enough funds, I will be sure to do the same for my brothers and sisters 🖤 stay strong and healthy everyone. Cashapp:$honeyyy1997", "mea_correa": "❤️", "darrah.jones": "❤️", "kiraselinalevy": "❤️", "sp00ky_catt": "💖💖💖💖💖", "bobbygodboldmommie": "Cashapp $kendragodbold", "maganff": "cashapp: $magan01 college student who recently lost employment", "_teddybearseason": "Venmo: @Destiny1-Evans", "lady_butta_": "$ladyybutta", "zi_3.14": "$ZiTerrence and tap in with me so I can share some dope ass playlists filled with music that will help you put all this chaos in a box for a little while!! Take a deep breath ✨ the sun always comes back", "kadecahe": "@Kadecahe $Kadecahe Zelle:kadecahe@gmail.com", "vibratehigher__": "Cashapp: vibratehigher222 I am a black woman who’s job got closed down because of this pandemic. No one is hiring in the area I’m in, and even the places that have stated they were hiring...turned me down when applying. all love and praises to the Most High for allowing this kind of love and light to be shared amongst us all throughout this post.", "okthen________": "Handpoke tattooer/tattoo consultant, I can’t book appointments until we are out of quarantine. Tattooing is my only source of income. I told my landlord that I can’t pay rent this month.. my Venmo/Cashapp @$inkthediaspora , PayPal email only.tan.par@gmail.com 🌹🌹🌹", "inkthediaspora": "Handpoke tattooer/tattoo consultant, I can’t book appointments until we are out of quarantine. Tattooing is my only source of income. I told my landlord that I can’t pay rent this month.. my Venmo/Cashapp @$inkthediaspora , PayPal email only.tan.par@gmail.com 🌹🌹🌹", "beauty_goddess96": "You're a blessing... Its hardest for us. The smallest things help", "chocolatttteeeee": "In the gig economy. Could really use the help. I miss DJing 😭😭 Venmo- @Callie-Luttman and cashapp $cocoabea. Much love to everyone.", "emilee.hardin.9": "❤️", "sunflower__mama": "$DeAndreaLottier", "karla_rebirth_": "I am a hairstylist so my funds are no longer available since I am non essential, help if you can, thank you ❤️ cash app, $karlaw31", "shellbeeraditch": "❤️", "nuclearblackness": "❤️🔥", "rinleymel": "❤️❤️", "kalani.terrell": "@Kalani-Terrell (Venmo) Thank you for this post and bringing awareness to marginalized struggles. Pay it forward to the people who need it most", "khaoticthoughts": "Saving this post to come back to after I get paid this weekend. My food services job is deemed essential so I'm still working & thought I'm not well off I am lucky enough to work for a company that is giving us hazard pay so after I know the basics are covered I'll come send a little bit to a few people! This isn't a time for me to hustle to pay off debt, it's a time to help otheres however I can. 💖💖", "chloesieg": "❤️", "lefendi": "My husband @fendibritish and I are donating lunches to doctors and nurses at our local hospitals. We are collecting donations to continue the effort in providing free lunches to frontline workers. Gofundme link in @islandrayco and my bio. Cash app $marlonfendison", "aalistew": "@ aaliyah-stewart on venmo, @ aalistew on paypal. really struggling to get the unemployment office on the phone. those that supported me last time I posted realllly helped me out. I really appreciate it", "nafis_white": "I’m a fine artist and exhibitions, artist talks, residencies, all of it got cancelled or postponed. Thank you for seeing us Ericka! Venmo-NafisWhite@NafisWhiteStudio", "excuseme_flo": "❤️", "jadedvisions": "Venmo: Jadedvisions Unemployed, let go on 3/13, income cut that day.. trying to figure this ish out everyday", "onyxnremy": "Mesign4u (PayPal) warehouse wife and “essential “ worker wife who cares for 175 low income seniors on the daily.. #selfcareoverdue", "blkmoonlight": "Venmo: @Alandria, Cashapp: $alandria09 Thank you!🖤", "kay650credit": "Cash app:rickawilliams12 Venmo:Ricka-Williams Small Black business owner. I created my business to give back to my community, however, we’re both struggling, so any amount helps! Thank you in advance ❤️", "carlcorreia": "❤️❤️", "altair_arts_": "❤️ thank you paypal.me/altairU", "kento_beanz": "💞💞💞", "sasssye": "Cash.app/$efeo I've had 3 clients canceled. That was 2 months of rent, utilities, food, basic necessities", "msidgafkim": "$bigjuicy76", "ashley_whit": "❤️", "howtotrainyoursteak": "I have linked up with a neighbor who has a legacy of community activism in his family. We are trying to appeal to the community to petition a rent strike. Do you know of any resources for wording of these? I am continuing to search but if anyone reads this comment and could point me in a good direction we would be grateful!!🖤 🖤🖤", "merci.suivant": "$37lbs 😘", "mishellewilson": "$Mishelle93", "mariana_i_martinez": "❤️", "kalifalondon": "@lefendi", "dlite23": "❤️", "claudiaamon": "I’m a personal trainer and since the gyms are closed. So is my business. 😩 Cashapp - $claudianunya", "itsjustkimnoberly": "❤️", "erin.k.monahan": "❤️❤️❤️", "_oroori_": "$charlybrownskin about to hit the road after eviction during COVID-19. Leaving for Cali on Monday- just got our van serviced - it cost $935 to be ready for the 3,000 mi trip. 🙏🏾", "cuethemarchingband": "$simplyrie if you can...", "beigebro14": "$beigebro14", "the_guardian_michele": "$shamleyuk", "pricelizzi": "❤️", "kilomoonchild": "$moonchildyogi", "kissmybadass": "Black & work the night life which is now not a life 😔 #HardTimes $NeaBadass", "hlnmrtm": "❤️", "ll_cool_rey": "@Rey-Takang or $ReyTakang 😭🙏🏾", "sofreakinextra": "PayPal.me/sofreakinextra ❤️🙏🏾", "anthonysister722": "Cashapp: $adj722 Venmo: alexab722 ...single mom, was specialist. We survive off tips and get paid below minimum wage, my job closed even after they assured us we would not. Any little bit will help my daughter and myself and thank you for any generosity, hopefully I can help others in some way as well🖤", "zoe_bellini": "❤️", "smoon1822": "♥️♥️♥️♥️", "northwestmoon": "❤️❤️❤️", "tianaverrett": "Venmo: Tiana-Lanee", "taylorrrnc": "$tayncj 😩😩😭", "fourfifthsofakayak": "💙", "necyraquel": "Cashapp: $NecyToure", "bodega.bby": "Cashapp:$samuraisuke/ Venmo:@sukanyewest pls pls pls, I’m a Columbia student who is ineligible for any refunds from school because of being on scholarship and the stimulus package payment because I’m a dependent and I no longer have a job. Anything helps 💕", "creative_ian": "$iandavis1 — I’m a black small business owner. Your support is greatly appreciated 🙏🏾", "hotmessmolly": "❤️", "blackasthecosmos": "Cashapp: $blackasthecosmos Venmo: Brianna-Daniels-5", "nichole.crossley": "♥️", "thelionessgetsfit": "$lionesspoet", "i_amrich": "I own a field marketing company that grows brands by connecting with people. Since this is all centered on live engagement, all promotions have been cancelled until further notice. Tough times but remaining positive for Spring and Summer activations. Thank you for this post 🧡 www.doubletake-marketing.com Cash app $AbiRich PayPal Abigailisvers@gmail.com", "sophiannmahalia": "Cashapp: $SophiannMoore", "weimei21": "Venmo: TayTang and CashApp: $TayTang85. I graduate law school in a few weeks and I lost my job last month due to Covid-19. Any help is appreciated ❤️", "vanessawanyandeh": "❤️❤️", "yesimazoe": "$yesimazoe Transman needing funds for hrt. I don’t have insurance and just need a helping hand getting started", "shestheblackmarthastewart": "$thetriogrlsss personal chef but can’t serve the families, single momma. Thank y’all", "_mixedbeauty26": "Cash app: $KryStyles26 Venmo: @Krystle-George", "rebecccaaamy": "❤️", "daniellemcarter_": "♥️", "katttttchr": "Venmo : NOISYLIBRARY53", "quinnyw83": "$quinnyw this is the worst feeling ever", "grillodesigns": "😩😩😩", "ehelenirene": "❤️", "shelbobagginz": "shelbobagginz 💕", "str8top": "$MarsHirShe femme in need of funds for pain relief /transportation for @dr4gon_femme they also does bedtime stories and their writing ? Amazing 🥺💖", "justcallmenala": "Cashapp $EvaBrech", "ladycocovicious81": "Hospitality worker...Since travel is on halt I’m out of work. Venmo @CocoV81. 🤷🏾‍♀️", "queenrabbiee": "@ihartericka Cashapp: $QueenRabbie. Young Black Business owner trying to survive. Rent due, Car note due, lord everything due omg even groceries will be a blessing. 🙏🏿", "ezpeasygood": "❤️❤️❤️", "m.o.l.l.y.p.o.p": "❤️", "katiefinnnn": "🌺🌺🌺", "jerkchickentender": "My Venmo & Cashapp handles are @MalanyaG - I live in a all Black queer/trans femme household of 3 ppl and we share our food expenses. We are hoping to get help with restocking groceries. 🌹🌹🌹", "iamcatherine.pierce": "❤️", "eleven_19": "🙌🏾🙌🏾", "coxrosefarmer": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "kween.of.the.north": "Venmo: KatLaveaux", "mtroisfontaines": "♥️", "cristalsharris": "$charris829", "vawter23": "#suspendrentnow", "sion.life": "❤️", "jxx.o": "❤️", "meeshalrj": "CashApp & Venmo: meeshalrj", "jordynmarchbanks": "Cashapp $JordynM15 Venmo: @Jordyn-Marchbanks", "saraloudav": "❤️❤️", "itsbigusbirdus": "❤️", "theautari": "cashapp $feedari / venmo @feedari ♥️", "white.whisperer": "$starvingarti 🙏🏾", "eesloan": "❤️", "tribilinripscoobyhernandez": "❤️", "sacreddarkknight333": "$MrGoodwin003", "rxstr": "Venmo: @Rxstr-Woolery My job closed without notifying us employees, and since I work in the beauty industry I am without work, pay, or benefits, and I just took in my younger brother since he completed rehab. I haven’t heard from my landlord, but honestly anything helps! Thank you!", "ninthrasa": "💛🌻✨ cashapp: $zweena venmo: @ninthrasa ; laid off last month and also looking for skill share/barter opportunities once stay at home order ends in DC. sending love to everyone 🙏🏾", "staysexyhoney": "black fat femme inneed of some financial help. 💗 venmo: sweetbitch3 paypal: miasweetbitch thank you ebony and ericka !!", "kyara.robinson": "I'm a first gen student at UCLA who is unable go home to be with my family at this time. My mom is a health care provider that is currently in self quarantine, so I've been alone during this difficult time trying to garner enough resources to do well in my Spring quarter of my 2nd year. Anything would help me buy books and supplies and get groceries while I'm still as the dorms. Venmo: kaayare Cashapp: $kaayare", "kazejewelz": "I LOVE your platform of stressing these necessities and gatekeeping within our community. I AM actually going to take the route of offering my services of Sacred Adornment to heal. I am a master jeweler in metal design and I have COPPER bangles and jewelry for sale THAT WILL KILL OFF VIRUSES AND PROTECT THE SKIN. I have also started supplying Medicinal Herbs to protect and boost the immune system. In result, this flushes and filters the toxins in our body enabling purified blood and cleaner cells. 👏🏾", "d.onye": "Unemployment benefits apparently DON'T reach sex workers(no surprise), and DEFINITELY don't cover undocumented folks. This is about to be one of the scariest times in recent history in so many ways", "katiechristine": "💛", "prinnypie": "♥️♥️♥️♥️", "smileykatxo": "$smileykatxo ♥️😭", "_tiekiee": "Cashapp & Venmo: Tiekiee", "sanguinecells": "$sweetpawz service industry worker in Portland OR, my wages were reduced weeks before shutting down since people were already staying home :(", "djbremix": "❤️❤️❤️", "fauxtograpiv": "$cashellisallen/VenEllisAllen 💛✊🏾 My landlord don’t care one bit about this pandemic. :/", "mang_can": "❤️", "saudakariima": "♥️✊🏾", "anamelissatwice": "Facts. All the “assistance” such as free school lunch for kids only effect black, Latino, immigrants and low income families who have to risk their health every day to step out and get food. All low income families who work for transit are sick and dying. No rents have been stopped to help all Harlem, the Bronx and other boroughs were people majority rent and $1200 won’t cover ones months expenses. This is an attack on our society! An attack on our youth and communities. Stop the violence! 🔥", "sierra.bruton": "Thank you for this! What a great idea $sierrabruton", "mllechapelle": "❤️", "bryakimnita": "Venmo: @ BryaKimnita ‼️‼️‼️ Cashapp: $BryaKimnita ✨💜‼️", "jidibe_13": "Venmo: jilldiane13", "giveafoxamuffin": "Retail manger fired a few weeks ago amid the outbreak. I've got a senior special needs cat who needs his medicine refill soon. Been struggling with really bad depression the last few weeks. Anything would help since I have no income for anything rn 💚 cashapp + PayPal: foxnfans", "plantblerd": "Damn. This is so crazy. Just all of it.", "whatagoob": "💜💜💜", "baked_bean69": "❤️", "shopkidsister": "$kristent98 I posted before but this my main account! I’m a black non-binary femme in need of funds for food and gas because of covid-19 I havent been able to work and bills have continued to pile up.. things feel very uncertain so any support is helpful. cashapp:$kristent98 venmo:@kristigirl", "stikkyblakk": "$theabstrak", "grand.mere": "@candise-ervin venmo $Ecandise cashapp, hope everyone finds a reason to smile today💛🌻", "criavolver": "❤️", "foxybelleafriq": "Black, single mum, freelance chef @chefhenrietta and producer @untamed_afroburlesque partner producer @maddeepbk. All gigs, work suspended indefinitely. Venmo FOXY1", "emrwing": "❤️", "officialkadajah": "Cashapp: MelaninVibessss", "mortvinny": "Venmo: @Dallas-Diaz 🤞🏽", "kikolilbaby": "CashApp $EyeKiko + Venmo @Eye-Kiko510 ⚡️", "dominiquedrakeford": "Facts", "ditriech": "ditriech on cash app and Venmo", "joiriminaya": "Visual artist, most of my freelance gigs (museum education, talks, workshops, etc) are not happening. Also, spent most of my savings for months producing new artwork for an exhibition that should have opened mid-March but is indefinitely postponed due to the pandemic. Venmo: @Joiri-Minaya Cashapp: $JoiriMinaya", "thandiiiii\nVerified": "Verified", "_theprincessleah": "Please, anything can help! Cash App : $ModelLea", "alwayzelevated94": "$nking94 ❤️", "nouveaucocoa": "Thank you so much for this 🙏🏾 I’m a freelance artist and childcare provider, and I haven’t gotten rent together yet! 😩 Venmo: Emanuella-Israel PayPal: emanuella.israel@gmail.com", "traveon666": "Venmo @Traveon-Rippetoe", "jammingsoul": "💚", "gigipearl": "$gipearl Mama of two ( one in the oven) Doula/LC and maternal health advocate + Reiki practioner. can't take clients I'm my home due to stay at home orders in DC and exposure risks to myself during Pregnancy. ❤️ Blessings to all as we push through these hard times.", "loui.mir": "$MiriamMatthews", "justnai_09": "Praying for everyone 💕💕 Venmo: just_nai PayPal: Nybye09", "deangied": "Hi💗 Clinical psychology doctoral student, caring for immunocompromised loved ones. Recently lost my part time job! Venmo @deangied CashApp $DeangieD 💙💙💙", "tiffanyannalisaxo": "Venmo: tiffanyanna cashapp: $tiffanyanna", "dontlookatmegoose": "💖", "zugeilyn": "❣️❣️", "nixflem": "❤️❤️", "destinyisme": "$destinycheyenne 🙏🏽💕", "ohsokimberly": "$ohsokimberly all i need is $200 to make rent by the 10th ugh I lost both jobs", "theonemili": "Cash app- $milim14", "tsoulstar": "CashApp $ThemaHG, Venmo @Thema-Graves ...self employed, Black healing practitioner, yoga instructor, meditation teacher..healing studio is shut down", "mamacrabscastiron": "Venmo @AlinaTucker, I'm a doula and abortion provider based in Missouri. My partner T doesn't have an IG but is a youth educator who just got laid off due to COV-19, their Venmo is @TeaPea. We're both black TGNC folk with low income and big families - any support is helpful at this time! Thank you Ericka <3 I hope you and Ebony are well 💕", "melanin_nubian_queen": "(cash app) $Gemini90s (Venmo) @Nala-Foster (Paypal) barbienala11@gmail.com I’m out of work until the virus calms down but we don’t know when that’ll happen. I have a big family and i’m living with 7 ppl rn", "moirha_moirha": "❤️", "salihawk": "Thank you for this! Venmo @Saliha-Muttalib", "purr_is": "If there is someone in Canada that needs some help I can etransfer a little money, for rent or groceries or whatever you need. Sorry I don’t have venmo/cash app, apparently Canada is stuck in 2003.", "spacelace": "❤️", "maestrokaiso": "🎻🎻🎻 I made most of my income playing in the nyc subways.. it’s clipped for all that now check out my videos! cashapp $maestrokaiso Venmo @maestrokaiso", "maeryblue": "❤️", "mrwhitleygilbert": "Venmo: @KingLeo1 Cash App: $KingLeo369 🖤🖤🖤", "kyra_russell": "Grad student really unsure of how I’m going to make ends meet because my university doesn’t care, my landlord doesn’t care, and the job market is horrendous. Venmo: Kyra-Russell-1 Cashapp: $KyraRussell18", "brxndxnsi": "Thank you for bringing these issues to the forefront! My job shut down and I was laid off. I haven’t worked in quite some time and rent is still due! Anything helps. @/brxndxnsi on Cashapp and Venmo!", "mayreet": "❤️", "estefaniamango": "$estefaniam", "senhful": "Venmo: senhunt", "mcattack_": "♥️", "alanatomas": "❤️❤️", "rse.bd": "@EzraYelverton - Venmo $EzraYelverton - cashapp", "vaude_villian": "❤️", "reidja.t": "Recent college graduate who lost her job due to coronavirus closures. Cashapp: $ReidjaT Venmo: @ReidjaT thank you!", "ayannasoleil": "$ayannasoleil", "hairykatenashleyfolsom": "❤️", "dro2e": "$Drose002", "blakkcupcake": "Venmo: Nay-Bever Cashapp: $reneebever PayPal: naybever@gmail.com 🙏🏾", "iceydenahoe": "$endbreadbro", "shinydiscoballs_": "❤️❤️❤️❤️❤️❤️", "cassie.takes.vids": "cfaygettinpaid on venmo, $cfaygettinpaid cash app. please, i was a film editor laid off in december of 2019 and have been unable to find work which has only been exacerbated by covid-19. it hasn’t even been a full year since i graduated college and i am struggling. thank you @ihartericka for giving this platform", "_alyxo": "@alyciaet and $alyciaet 💕", "xoxoxogopissgirl": "❣️", "keeshoffdaleash": "$keeshpee literally don’t have enough funds for this month", "nalaq_": "Venmo: nalaw", "v3nn_dia": "$shmoulie I'm a college student and I worked at my college, so any support would be awesome", "sippin_orangejuice": "Tf is wealth privilege?", "chell_o_": "$RachOye I got laid off and I have medical bills and school fees. Am also an artist, so you can commission me for logo designs, portraits, or astrology themed illustrations!! 💛🌟", "alienrapperqueen": "Cashapp: $lonewolfxx666 Venmo: mizfirestone I’m a s*x worker currently quarantined only able to work online. This post helped me survive last month, thank u !! 😭 @ihartericka 💜✨🌸", "___broady": "My job has been shut down indefinitely. Cashapp: $angiebeamer1", "maviron": "❤️", "l_zawacki_m": "♥️♥️♥️", "dirtybow": "❤️❤️❤️", "kaitlynchapstick": "❤️❤️❤️", "senpai_uchiha_rebels": "$Roxasthegr8 (cashapp) still no word from my job and unable to collect unemployment... this shit hurts!", "carmenlobue": "💜 @Carmen-LoBue Venmo elderly caregiver and filmmaker activist ✊🏾 sick at home", "whatsda_t_lc": "Venmo: Linda-Chastine cashapp: $Butterflylin PayPal: lindajchastine@gmail.com", "getoffmyariola": "Venmo: @somoneybaybayyy cashapp : $somoneybaybayyy", "supremiacy": "Cash app: $SupremiaBostick Venmo: @Supremia-Bostick", "inez.the.sun": "Cashapp: $NijaHoward", "samhen.ny": "Optimistic single mom of a happy little girl. I live with my family, a dysfunctional one that I love nonetheless. I’m being forced to move out I’m sure due to the increasing pressure & stress of this pandemic. Literally anything would help. Funds would go to relocating myself and my little one & my phone bill. Thank you, love to all 🙏🏾 cashapp: $samhenny ❤", "earneyyy": "PayPal: Ernestina.a.b@live.de rent is not paid 😔", "lanagalem": "Venmo @ lanagalem CashApp $LeyaunaMcGriff 💖", "taeviasalazar": "❤️", "sarahrraysor": "Venmo RaysorSharp cashapp $saucysoju PayPal kawaii1kimiko@gmail.com", "livelovepeacemusic18": "$NAsunshine 🙏🏾", "kaylareefer": "❤️", "honorliketheword": "💕❤️", "kari.of.oz": "$KariOz", "cassjwhite": "❤️", "fayeeshalarmer": "mama and artist who lost my service job. anything appreciated 🙏🏿 venmo: LeEcia-Farmer PayPal: leeciafarmer@gmail.com", "ilaeirasym": "❤️❤️", "curly_hair_sarah": "❤️", "withaseries": "Two queer black women who currently have no income. Thank you so much for this 💕🙏🏽. VENMO: Withaseries / CASHAPP: $shakkadelic ✨", "simplydes35": "$GenetteDestiny Venmo: @GenetteD Furloughed as of this week and I have no idea when I’ll be back to work.", "styledbykishh": "Black Queer makeup artist and esthetician. I haven’t been able to work since March 17th. I’m worried about rent and all my other bills. Anything would help. Thank you so much! Venmo styledbykishh 💜💜", "shotbysage_": "plz anything help! Cash app: $aidan921 venmo : aidanaw paypal: awilliams0921", "gatekeeper90": "Cash app: $Gatekeeper5855", "official__amandaalysaco": "Venmo @Amanda-Feurtado. Have been vigilant on doing the right thing with applying for unemployment and still haven’t received anything. Now I’m down to my last and I don’t know what I’m going to do next. My job doesn’t give out benefits and still has no safety net for us during times like this 😫😫", "hottie_mcnaughty": "❤️", "champagnegrannie": "❤️🙌", "bahbers": "$fashionboo", "kyrahdear": "Thank you as always for this ♥️ Venmo @kyrahdear black birth worker and health care worker just trying to make sure I can still pay for classes this summer and stay on track for midwifery school. Sending love and good vibes to you all ✊🏽", "crrieandrsn": "❤️", "_almighty_kai": "$AkailaWilson - Black college student who is now homeless. National guard took over my dorm and now I have no stable housing and I lost my job... any help or opportunities would be so appreciated", "mon.mon.d21": "❤️❤️❤️", "_sugarwitch": "$blackfemmelove 🔮✨ thank you ❤️", "caseyherger": "♥️", "love.dnmz": "Cashapp: EducatedCameroonian", "mikaelathiboutot": "❤️❤️", "eatdrinklivenola": "Contract worker in public health; quarantined and waiting for results from test with symptoms matching COVID; out of bottled water; still expected to pay rent 🤦🏾‍♂️ @dj_edlnola $djedlnola", "ave2noondelite": "This is amazing! Thank you! Rent has been the biggest issue on everyone! Idk how this can last the next several months not even making it through. $ave2noondelite", "lavenderqween": "❤️", "britneyannmarie_": "Venmo: britneytraep Cashapp: $BritneyPeart  I’m a first generation student at The George Washington University. I’m facing a lot of financial difficulties right now. Anything helps. ❤️", "w1tchb0ard": "Venmo: dickappt Cash app: $mm69420 PayPal: marie@09171993.com", "sorbetking": "Venmo: @loveliestlonely Cashapp: $freehannah", "sarahalley84": "💛", "ladamanic": "@amidayton13", "slayyyourfave_": "$KendallRGuyton any little bit helps 🙏🏾❤️", "lordarze": "Venmo: @ tiltedrose cashapp: $haynar PayPal: princessranyah@gmail.com 🌹❣️", "tlrtdd": "venmo Taylor-Todd-5 and $ttodd92", "sheekstyle_": "I’m a NYC based nail tech and I recently opened up my own business @sheeknailz studio and Me and my business is greatly affected by this pandemic Cash app $tasheekaferryman", "snclre": "$snclre", "close2home_slo": "❤️", "craigasaurousrex": "❤️", "missraichl": "Paypal.me/missraichl #substituteteacher", "princess_clickb8": "$sonomod black af and just found out my landlord has contacted/checked in with every tenant except me. I’m trying to contact him to negotiate rent as I’m still gathering it but I think he’s avoiding me to try to evict me(he’s done it last month as well)", "xtinashopsalot": "❤️", "eneri.daze": "Mommy of 2 (and one on the way any day now!) who was furloughed and lost all maternity leave privileges. Would truly appreciate any donations to my midwife and doula fund: $eneridaze", "inmyothabenz": "Cashapp: $Mdjackson719", "griz_theninja": "Man...I was laid off. I don’t usually do this but cashapp: $Griztheninja", "klutchkendall": "Art Student who was refused to receive refund on my housing and is struggling to pay my tuition! $KendallAshlee", "kjmali": "❤️", "tai.levenleven": "$crwnfit", "queervegfemme": "❤️", "katjoee": "❤️", "evvieey": "❤️", "zea_debonair": "Cashapp: $Kimgsud anything is appreciated & thank you 💕", "jalovelyy": "$jalovelyyyy widowed mom of 3, my daughter is 7, son is 6, and youngest son 3..my husband passed away july 9 2018 and I work in the restaurant industry so clearly not working. Doing everything I can to try and keep food on the table but I'm struggling.", "dancing__daisy": "♥️", "shelbynhaa": "❤️", "rackeldackel": "❤️", "draunimoli": "peace family, not going to be able to tattoo till further notice and all my performance gigs have been cancelled as well. my venmo is @bloodmath + cashapp is $aditora thank you thank you thank you!", "genesys420": "Cash app: $genesys420", "_thatgirlcamille_": "I have absolutely no money for rent since I lost my job. Please help $camillebowens", "torchestogether_": "@Ashley-Brackins $ashleybrackins1  Can’t pay rent until my husband is able to return to work. He was sent home without paid leave until further notice. I’m a stay at home mom.", "niambisala\nVerified": "Verified", "leonne11_": "💜💜💜", "ofesade": "$sweetliish .. single mom, unemployed and displaced !!!!!", "nawalasalim": "❤️", "m.o.l.o.t.o.v___p.u.s.s.y": "PayPal.me/EvianEm laid off single queer mom. Also, if you or yours was in the restaurant industry & lost ur job, rerf.us is doing relief grants, first come first serve while they last, applications open April 2nd on their site", "alunchables": "❤️", "whoreiblefem": "$dayniepat", "devonairess": "❤️", "tiffanyaliyah": "Professional dancer who’s entire tour got postponed because of COVID. no paid time off or cancelled pay. Anything helps! CashApp: $tiffanyaliyah Venmo: $tiffanaliyah", "aaidatesfa": "Restaurant worker who has been out of work since April 20. Venmo: Aaida.Tesfa", "jaime.burney": "♥️", "celinaaghh": "♥️", "emikos_unexplained_blogs": "$emikoftokyo", "ashley.lauren28": "❤️", "honey.bunnii": "❤️❤️❤️", "_soley_": "❤️", "allsnshcklfrd": "Remote hours cut down to 5/wk 😫Venmo: @Allison-Shackelford CashApp $allison1225", "rochellepaints": "Ive been laid off of my job and I’ve fallen into a bit of debt that I’m struggling to pay. Anything helps during this hard time. thank you! Venmo: Rochelle-Dickerson Cashapp: $rochellle", "ricki.cedillo": "My mother just got diagnosed with covid-19. Cash app: $MelisaCedillo Venmo: Melisa-Cedillo11", "aunt_viv": "♥️♥️", "jennnnnaynay": "❤️❤️❤️", "option.a": "❤️", "the_great_potoo": "❤️", "ahhdayy": "thank you so much @ihartericka for all that you do. Recently lost all my jobs and have no money for food or bills! Anything is appreciated! Cash app: $AdeKassim Venmo: Ade-Kassim Paypal: adeb.kassim@gmail.com  Thank you all so much ❣️", "witchykimberly_": "Need food, shelter asthma meds and allergy meds $ErykahKRobinson", "matte.finish": "❤️", "flutekeyes": "KeyesSNKeyes", "sfrankly_mydear": "❤️", "leolalula": "Venmo: @ Leola-Lula Cashapp: $Leolalula PayPal: aloel69@yahoo.com", "luhshawnay\nVerified": "Verified", "theraeflower": "❤️", "selisaks": "$BeySarah college student ☹️❣️", "frankbreaux": "❤️", "curlmeloncamp": "💖", "joolzhatch": "#cancelrent @nygovcuomo", "aclementinetree": "Hooray for getting furloughed! @georgiastoves", "missnewmewgie": "❤️", "displacedyke": "my landlord whom has never texted me before, texted me this morning reminding me that rent is due 💀 cashapp: $vanessaattah Venmo: vanessa-attah anything is appreciated 🖤", "lisathelawyer": "❤️❤️❤️❤️❤️❤️❤️", "sydmckim_": "❤️", "mars_the_mantis\nVerified": "Verified", "hersheysmilez": "$hersheysmilez / venmo: tyana-craig", "jubilant_kreyol": "Thanks for always thinking of the marginalized groups and communities", "trinity.estelle": "❤️", "somebody_maddy": "❤️$ronrb88", "uhhleeesa": "Venmo AlyssaG86. Thanks everyone.", "taylorngibson18": "❤️", "velvetwavez": "❤️", "abstractemergence": "Cashapp $AlesiaMerge or venmo @alesia-ashby", "saaji_mahal": "Venmo: saaji_mahal Cash app: saajimahal Thank you! ✨", "mynotesfromself": "Thank you so much Ericka, this is such important work. $Willywills94", "cocogm": "not my info but adding someone on here who needs help! They been in and out of shelters for awhile now. Their paypal is JAEtheBAE ⬇️ janaebell89@gmail.com or greenwildchild@gmail.com Janae's partner has cancer and they have two girls to support as well. Whatever anyone can give them would be amazing. thank you!", "lilwoodmandevir": "❤️❤️❤️", "gnatalieeee": "❤️", "cstefl": "❤️", "mrs_jodiethomas": "❤️❤️❤️", "silkj42": "❤️", "mayadeshae": "❤️", "waveofemotion": "❤️", "linsy93": "❤️ (bumping up post)", "vargasmarquez": "❤️", "plsstayalivelc": "❤️", "avirosae": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "theoriginaltayfab": "❤️", "blackaquafina": "Thank u it takes a village", "buzheretic": "$meeenie", "arshton": "🙏🏾 @arshton", "jaimegilliland": "❤️", "hannah_cifuentes": "❤️", "_haleymann": "❤️", "renajadeee": "My apartment building has not done anything to freeze/waive rent and I’m a restaurant industry worker who doesn’t have a job right now. Cashapp/Venmo: Renajadeee PayPal: SerenaT2", "maliakakenyetta": "$MaliakaMcCorn Charlotte based MUA. Since my main retailers, Ulta and Sephora, closed I’m out of work indefinitely. Bills still coming in and money is not 😭", "abbyreneebeckley": "❤️", "netkoneznas": "❤️", "indigoesblues": "❤️", "witchimage": "💙", "myrkvis": "❤️", "londafonda": "Thank you for this. I’m a makeup artist and I lost so much money from refunds from weddings and postponing clients. My Venmo is seattle_mua. ❤️😞", "rootsandhooks": "💖", "taylorreneewill": "$YungMedusaa", "ejlw": "@ricawestone", "raquelwill16ms": "❤️", "thisisformebutalsokindaforyou": "❤️❤️❤️❤️❤️❤️❤️❤️", "ihartericka\nVerified": "Verified", "ambernicole.hilton": "Venmo : yaayitsamber", "hoosierqueenkp": "$hustlequeenkp", "_destinyparis": "Graduate student with no income & loads of apartment expenses cashapp:$destinyparis", "imetgodsheblack": "Thank you for always doing this ✨💕😭 @ihartericka", "mad_swan__": "💗", "foreva_lexii": "Cash App: $forevalexxi it’s just me and my baby😫😫😫 I really need help thanks I’ll appreciate anything 🙏🏽🙏🏽", "rippedtshirt": "Venmo : @ teallemons anything helps as I have lost many hours yet am forced to still work and risk my safety!", "kindredsoulkai": "Venmo: @kai-shatteen Cash App: $kaishatteen PayPal.me/kaishatteen", "sassquash._.sighting": "Cashapp- $cutiequinny Venmo- CutieQuinny A server who is still out of work. Currently waiting on unemployment", "martinbrownstudio": "$mbrownstudio 🙌🏽", "tgrbass": "🔥🔥🔥", "j.a.y07": "$jaay7 😩", "iam.stevierose": "$ThatStevieGirl Venmo: Thatsteviegirl", "angbangz_": "I have a serious question that i have been a little confused about for some time... does being Latin make you black also? Maybe i am wording my question wrong but if Ericka or anyone can answer this for me I would appreciate it. I ask because I always see your posts pertaining to black ppl and i have always thought being latin you are also black. Just need this clarified. Thank you.", "negritudinal.longings": "venmo: @kiki-nicole cashapp: $kikiledbetter. i won't be getting paid from my job until further notice and am struggling to make rent because of it", "ianya_g": "Venmo: @mranity, cashapp: $mranity ❤️❤️", "jaleesagraham": "Cash app : $JaleesaMonet", "eat__fashion": "Venmo : @eatfashion Cashapp : $bejideL anything helps 🙏🏽🙏🏽❤️❤️", "always_naynay": "$naylynea", "samiyahwrites": "Cash app: $samiyahwrites Venmo: SaMiyah-Wright  Anything helps! 😭💕", "lifeasdariane": "$darianeD cashapp  Venmo darianed  Displaced nyc bartender 😫 been trying to file for unemployment since the 15th with no luck because 7.2 million people try a week and they only take 10k calls a day 😫😫😫 what", "_oro5_": "My family of 5 and I were evicted March 14th pls support cash app: $5onthemove 🌻", "rutendo_dafana": "https://www.paypal.me/Dafana", "kenniedejavu": "Cashapp: $kendradejavu The money could really come in handy, especially now that I've been laid off 🙏🏽", "ak__the_great_": "Venmo: @AK_The_Great, CASHAPP: $TheGreatAK. Disabled trans person with little income. Grateful for any support provided. 🌻", "brownsistabasics": "Cashapp: $brownsistabasics PayPal: brownsistabasics@Gmail.com Venmo: Cassandra-Chase-2", "tooflyyyaquemini": "$FlyyAquemini", "tlynnmcknight": "Venmo: TLMcKnight 🖤🤍🖤🤍🖤🤍🖤", "hollisthemvrk": "$hollisthemvrk Venmo/CashApp - Just want to get groceries", "qveen.pinkk": "$thebrittney1 I literally worked at my school which is now closed 😭 then they evicted all of us from housing. And still haven’t given us a refund 😒🤦🏾‍♀️", "mwanamisi": "Black woc, and currently unemployed. Would greatly appreciate any help 🙏🏾. Venmo @tmsola", "baldheadedbeautyafh": "Whether u and the money or not don’t believe for a second they aren’t hoarding the money to care their family too because they r pulling form their 401k plans or getting help from the banks to extend the payments for not paying this month and next month", "deeeebo_x": "Creative who just got furloughed. Sigh. Venmo: @Deborah-Conton cashapp: Deesparktarot1", "kiskeyaymiel": "Venmo: @lolaarivera Cashapp: $lolaarivera  Queer non-binary farmer in need of some support rn", "blacklorelei7": "Venmo: @blacklorelei7 Cashapp: $loreleib89 Brooklyn based Black queer muse/artist with all gigs and classes canceled until further notice.", "grownenberg": "$kpsmiley767", "naturally_everafter25": "Cash App: $KatreshaT", "_lunita": "cashapp: $blamethemoon venmo: blamethemoon paypal: spg312@yahoo.com 🙏🏽🌹", "blackqueerspiritualist": "$MSadeNeil, @Monterica-Neil, msadeneil@gmail.com", "it_be_denise": "@DJStar73 is Venmo $PieYump for cashapp. First I was nervous for my health, now I’m nervous about where I’m going to live", "vapepapi420": "$mikiumi 🙏🏿", "tieboyer": "Hey I’m Tie black non-binary trans femme. I’m locked into a particular situation of fuckery rn because I was wrongfully terminated from my teaching job due to discrimination, and then my former employer lied about why I was fired, and unemployment accepted the lie (even tho it wasn’t even in my termination letter). I have free representation and appealed, but all hearings are hereby postponed meaning that while I lost my part time job at the library to this epidemic, the last thing I was told is that I owe unemployment money AND that I’m ineligible until June 10 to receive unemployment. I am STUCK in the system literally. I live on donations and my building is still expecting rent. Venmo: tietie cash app: tiezesty", "nabou_roses": "Cashapp: $eyna 💓💓💓💓💓", "makayla2398": "Makayla-Smith-20 black queer college student in need of funds for groceries", "janaykeys": "$jaypaymay 🙏🏾", "bold_brazen_article": "CashApp: $cjmulcahy. PayPal: cnjohnson1970@gmail.com...", "samirafromcle": "venmo: samira-colbert-1", "vickie_g": "Venmo: @Victoria-Gathogo cashapp: $Stickivicki 💕", "crownroyalk": "Venmo: @kevincornwall anything helps", "tiddyana": "Ugh thank you 😭💕 $tatiJArroyo Venmo: twatiana My partner and I both got fired from our jobs and things are getting mad scary. Trying to hang tight and hope for the best.", "johnmillah": "Im terrified and can’t sleep at all $jrharri thank you so much", "thekaybabii_": "Anything you can give helps 💜 College Senior, laid off of 3 jobs. Venmo: @Stefanie-Peart CashApp: $StefanieAP PayPal: stefannpeart", "catsquest": "Cash app $Patrova been laid off bc of covid", "ziiomizm": "Venmo: ZiiOm Cashapp: $Ziiomi", "suhmanthduh": "I'm truly so worried and scared. Cash app: $moopaloop", "auntiechanel": "cash app: $ripchanel venmo: sideshowboob 💕💕💕", "nyaranga.o": "PayPal nyaranga.odundo@gmail.com", "1grueqq": "I’m just trying to live and can’t seem to catch a break. Trying to stay positive. Sending love to all 💓 Cash app $irmascoin", "aishaawadallah": "Birth doula feeling the financial blow of not being able to support clients at hospitals and loss of other freelance gigs that help to pay the bills. ❤️ Venmo: Aisha-Awadallah", "iam_ravensymone": "Cash app: $iamravensymone Venmo: @iam_ravensymone Thank you so much Ericka for looking out for our community. What a blessing it is ♥️", "nishiibihh": "PayPal: 444nishi", "champagnecalcite": "Venmo: @makaela-newsome (I work in public health and they’re about to make us work weekends and possible overtime with no additional pay. My roommate has already had her job put on hold and won’t be able to cover the rent next month)", "sentimentalheadass": "venmo: @ ilovekatebush420 cashapp: $rhysmiller", "blk.theo.logy": "Cash app $mmathurinn venmo: mmathurinn displaced college student that would really appreciate anything you can share ♥️", "francineapril20": "Cashapp: $FrancineDeLosSantos", "beautifull_que": "Bartender out of work 3 weeks already ... $LaqueshaAlmond cash app", "abbacchio_": "Got laid off last week. Cash app: $plewis90", "worstwestern": "I’m blackity black y’all, and have no work hours. To my black peers dropping comments on this thread, I’m offering free dust masks on my website if you would like one (will ship for free) 💕 Venmo/PayPal/Cashapp - worstwestern", "the_art_within_e": "Cashapp: $eboneSp", "ski.dec": "Unable to give but I wrote letters to my governor and senators! Sharing this post as well", "marcellina_reis": "@honeycrisp-co Venmo, marcellinareis@gmail.com PayPal", "sarahelizabethatkinson": "@quesurah <—— Venmo $quesurah123 <—— cash app", "yettieb08": "Cashapp $yettieb", "youmaybeoffended": "Cashapp: $Darylparisbright Thank you for providing this platform ericka!", "frenchwhitewine": "Cashapp $autumncollinss 💕", "thedappermrjaden": "Venmo: jaden-fields cashapp $jadenfields", "deeities": "$deerovetta on cashapp, deerovetta on venmo. the thing that’s really bothering me is if the action I see now will continue after this is over, not “going back to normal”. normal for me is 10.50/hr teaching 3 year olds. all of us deserve to earn better wages.", "brittanica2385": "Cashapp $BrittStap85", "eseosaedebiri": "Venmo: Samysosa Paypal.me/samysoda CashApp: $SamySoda", "_whoisjaz_": "$flourishh A sick health care worker who’s job is trying to demand me to return to work", "andy.polanco": "Venmo @andypolanco - freelance stylist all jobs canceled/postponed and no answer from past invoices I’m due Thank you Ericka", "bajanbrujashan": "Any and all help is needed !! Please and thank you !! Cashapp : $P00HB3AR98", "alkebuluan_": "Paypal:amerriweather97@gmail.com. Photographer and museum worker who is currently out of work.", "m0stefinitely": "healer & independent contractor out of work now 🌞 venmo: @ stephaniegriffin", "boyimhighmove": "Cashapp & Venmo: janbran12", "hanaelujah": "Venmo and cashapp @hanaelujah black, queer and immunocompromised ❤️", "downtownboogie": "Paypal: ellealyse@gmail.com", "wholeheartednwholesome": "cashapp: $wholesomebby venmo: @lovingplant", "creolebee": "$lezosantana2x", "nema2": "Thanks for posting this! Venmo @ selooma black queer business owner in New Orleans who can’t work.", "domo_913": "Black & queer person out of work Venmo: domo913 ❤️❤️thank you", "na.jma__": "Venmo / cashapp: $caramelprincessyogi 💓✨", "stankadelica": "cashapp: $LaylaBenAli venmo: @Layla-Ben-Ali paypal: https://www.paypal.me/labenali", "mslanai": "CashApp: $Lanai7", "afro_pinup": "$ivvalentine1001", "lisafranksclit": "I’m a black queer femme, I’ve been staying with my grandmother temporarily after leaving an physically abusive home. due to the coronavirus I haven’t been able to work and i’ve been out of school. sending funds will go towards food and paying for a therapist and getting my car fixed Cashapp:$Kristent98 Venmo @kristigirl 💛💛💛", "valenciapetion": "Cashapp $valenciapetion", "dapontefern": "That is disappointing but definitely no surprise.😡😡😡", "amichwill": "@Alicia-Williams-4 Venmo, $amichwill cashapp", "livingdisplay": "Venmo: Diamoree Cashapp: $Diamoree  My entire last check went to my rent, which hurt because I had no choice if i wanted a roof over my head.", "azuaintuition": "We negotiated with our landlord to pay half our rent but even that’s a stretch considering the uncertainty & tentative state of affairs especially as we reinvest all money to continue to make needed healing tools for our collective community. Every little bit helps. PayPal.me/Ageintobeauty @Azua-Intuition (Venmo) @Azua (Ca$h App) thank you Ericka!!! 👏🏽👏🏽👏🏽👏🏽👏🏽", "mothersisterfriend_doula": "Cashapp: $blatia1117 . I'm a single mama, doula and breastfeeding counselor trying to figure out how to continue supporting my family and clients to the best of my ability. Shit is rough.", "ruth.a.roni": "Paypal.me/girlwithbighair", "organizedtangles": "$kendralsrandolph single mom and renter, my shop was shut down weeks ago 😕", "jmontsunshine": "$AbundantJenny", "mangheauxsaurus": "$ Cashapp: $MangoFitness Unemployment has been down for 2 weeks and NYCHA isn’t looking out for their tenants. We’re all scared", "plantsandtequila": "Cash app $amberlucio I work at a garden center doing what I love. We are expecting to be closed soon. Blessings everyone 💜", "veronicabars__": "PayPal vmorrismoore@gmail.com", "_leslierae": "Cashapp: $ShopPhilGood", "kalopanoramic": "$kalopanoramic :( out here by myself surviving y’all 😩❤️", "mastery_of_noble": "$NobleMW unemployed. My stamps got pushed to the 23rd of this month when I got them on the 1st of March. Anything is appreciated", "kay_lush": "Venmo: kaylam15 Restaurant worker placed on leave until this ends", "kay.cupid": "Venmo and cashapp: KerstinCupid", "marshallecrockett": "unemployed full time makeup artist with 2 sons 10 & 16. little one & his grandma are sick with common colds so i’m forced to be socially distant & stay in airbnb’s at moment. any & all help is much appreciated! love you both forever for always looking out for your people! 🙌🏽🖤 cashapp: $MarshalleCrockett venmo: @marshalle-crockett 🖤", "loveiscourt": "Cash app...$LoveisCourt...I work for a hospital and my hours have been cut tremendously...", "marqbentley": "$Marqbentley", "cmdperkins": "Cashapp: $cmdperkins thank you ❤️", "xroache": "@(Roachetattoos)", "jessijumanji": "Independent artist & educator with gigs/contracts cancelled indefinitely $JessiJumanji @JessiJumanji jessijumanji@gmail.com", "_lifeofshi_": "Cashapp: $ShiAtkins Venmo: @Shi_Atkins PayPal: paypal.me/shiatkins93 (email- shi.atkins@yahoo.com) Still waiting for unemployment so I can at least pay half of the rent. Still waiting for health coverage so I can get my medication. We need a safety net set up in place! Sending love to everyone else struggling during this time! ❤️✨ and thank you to anyone who donates! I honestly just need funds for groceries. Everything else I’ll figure it out.", "smelanda_jb": "Venmo: @Smelanda Cashapp : $SmelandaJ anything is much appreciated :)", "victoria.minor": "Venmo:Victoria_Minor cashapp $VictoriaMinor7 ❤", "squwueen": "paypal: mmmadeline 💗venmo: lapetitebrat 🌟", "kelcshea": "Lmao my apartment management company emailed us instructions how to apply for unemployment. Uh thanks? Doesn't help me pay rent TODAY and also doesn't do a damn thing when all the TX unemployment lines are giving busy signals.", "napollonia": "$NiaDarling Venmo: kneeuhhh", "n.yallah": "Venmo: @nyallah CashApp: $NyallahN • Just tryna keep this roof up and my tummy full", "ramsw4g": "Brokeass, hungry ass cashapp: $ramalicious", "taesian_": "$taesiansh", "cymlee": "Cash app: $cymlee Venmo: Cymlee", "on.mommas": "Venmo@onmommas cashapp$onmommas", "meyshameesh": "$meysha", "sarahwhiteblack": "Venmo @sarahwhiteblack PayPal sarahwhitesings@gmail.com", "themelissadenizard": "$MelissaRDP and Venmo: Melissa-Denizard", "vm.turner": "Venmo: vicmturner Cashapp: $vicmturner college student that could use a little extra rn :)", "kimb0slicex": "Venmo: @kimberly-rayas", "liminal_spaces_": "not for me, but for my friend jack, his venmo is @ ohjackmartin 🤍 i don’t have any money to give him but if anyone else wants to send some his way", "nazilivesdontmatter": "cashapp: $nazilivesdontmatter 🙏🏽✨ venmo: t-alexandra 💖 advice: apply for unemployment if yall can, they waived some of the requirements. no job contacts necessary. stay safe everyone. thank you ericka ❤️", "caraelisetaylorr": "$CaraEliseTaylor on cash app / caraelise44@gmail.com on PayPal 🙏🏽🙏🏽", "ninardarling": "Black femme, Caretaker for my disabled mom, struggling with groceries + paying bills this next month. Thank you Ericka ♥️ Paypal: desegregateknowledge Venmo: desegregateknowledge", "leaux.co": "Venmo: LaurenColeman29 Cash app: $LeauxCo 🙏🏾🌹", "nobodyslolita": "I'm a black gal but me and my partners are all equally affected. No income and nervous like yall. Scarlettehardy is my venmo if anyone can help🥀", "niagotideas": "$paynian Venmo: @nia-nicole", "nuggetsgurl3": "$justkrisi01 paypal.me/justkrisi 🙏🏽❤️", "jcharactermusic": "CASH APP- $JordanCharacter VENMO- @Jordan-Character Thank you so much! Perpetual fighting is so exhausting and I've lost both of my incomes i worked for 7 months to get", "heyshaquille": "$fairyfresh ✨🙏🏽", "sagekendahl": "Cashapp: $SageHoward Venmo: @Sage-Howard", "sumistouch": "Venmo: @Sumayyah-Franklin Cashapp: $SumayyahFranklin 💕✨💕✨", "brown_eyed_girl820": "Cashapp: $mayhem820", "slutofthemonth": "CashApp $poetjennifereden", "palyse_j": "Venmo:alyse-james-1❤️💕", "sweetp0tat0thighs": "$sweetp0tat0thighs cashapp", "baileyninaw": "Thank you for this! 💞 Lost my job so it’s been tough. Venmo: Bailey-Williams-6 Cash app: $williamsbai", "denarrian": "$Denarrian thank you goddess", "ashantidoll": "Cashapp $ashantidollll 💖 anything helps because we are paying rent this month and then hoping and praying it gets cancelled next. Me and my bf have no income too", "chermaine_johnson": "YES PLEASE THANK YOU😭😭😭 CashApp is $ChermaineA and Venmo is Chermaine-Johnson whichever you can do please and thank you! I still have my New York apartment and that rent is due and I thank you for this😭😭♥️", "tylorlaure": "Venmo: Tylor-Matthews 🖤🖤🖤 I life with my sister and hours are being cut even tho we are deemed essential workers. Anything helps. Thank you.", "dontbeeaskingmehowtosaymyname": "My cashapp is $bnblithedecarona & so is my Venmo. I’m a teacher & wont be paid after this month. I moved to take this job & only worked 4 days before we had to shut down. If anyone is able to help me out, it’s greatly appreciated!", "suici.de.u": "Cashapp: $DashiaOkami", "_nikole_d": "$nikjuice ❤️", "museofire": "$museofire Venmo: @museofire", "fithelotus": "$fijayei venmo: fijayei 💕", "fleurdeleecee": "CashApp $fleurdeleecee Venmo fleurdeleecee", "tammiciarochelle": "$TammiciaDouglas remaining calm in this storm but my God it’s not easy. Peace and blessings everyone 💕💕"}