{"kizzybeyonce": "Welcome back! Hella inspired by this boss self-care move!", "dannycherise": "I legit checked to see if I was unfriended ...but I think those of us who follow you faithfully had an inkling you needed your space to breathe and live with no prior explanation or apology. Welcome back to our beautiful love birds. 💓🙏🏾🙌🏾😍", "ajpeabody": "Missed ya’ll! Glad you’re back!", "13kelsi": "Beautiful.. omg where can I baguette?", "_simplementeeva_": "I missed seeing y'all in the insta stories and my feed, I'm so happy to have y'all back! But most importantly, I'm so glad that y'all took that time off to take care of y'all first💖", "rockietheweirdo": "Happy that you’re back !!", "shalemar_1": "This is beautiful! So glad you were able to come back to you and recognize it was needed. ♥️ I’ve been experiencing something similar with post grad and wanting to use my degree but also craving some stability for a while, which is definitely not a compound situation atm. So I’m walking through all that and dealing with it day by day. ♥️", "knitwithme": "💞", "brekfast_at_tiffanys": "You both are so amazing, glad you took the time you need for yourself and your doing well! Great to see you back 💙", "kokiolivia": "Welcome back! Missed seeing you both. 💞", "blurredbytheheat": "Welcome back!!! 🧡", "marcijnyc": "This is beautiful 🖤 Thanks for modeling healthy self care. Welcome back 🤗", "therealmamaboo": "💜🦋🤙🏽", "veryobviousvulva": "your thoughts on the article that came out about wildflower?", "loriana__": "💜", "queenkatieoh": "I'm so glad you're back and glad you took a break! 💗💗💗", "blondielhv": "Omgeeeee that lil doggo!!! 😍😍", "decolonizingtherapy": "I missed ya’ll. Just saying. 👏🏽👏🏽 Happy happy love anniversary 🔥⚡️", "alive.hereforit": "I appreciate this❤️seeing you take a break makes me look at myself a lot", "mscrowndavid": "I knew IG was off I didn't see you both ❤️", "rising_of_a_phoenix": "Samesies just came back from a month break.", "amiramirrramira": "Ha omg YES to others watching RHOBH 😭😭😭 I loooove Kyle and Brandi really is trash", "katienumi": "❤️❣️", "licesita797": "😍😍😍😍"}