{"__alextheartist__": "Yes it racism, but should one of the most progressive candidates in the 2020 democratic primary be fired or resign for saying a statement like that? Especially when the quote is usually used as a smear tactic to try to paint one if the noisy progressive candidates in the democratic primary as a racist. I'm not saying this person calling Bernie out of how he said what he said was wrong, I'm saying that I disagree with the original page that posted this in Twitter on ghee notion that because of this quote one of the most progressive candidates in the democratic primary should resign for these comments or be fired for these comments.", "maebyeimdreaming": "YES THANK YOU 🙏🏻", "mojoadegbite": "@tatii.starr", "milaaminat": "@jontehall check her out !! She’s good.", "tbh.gfy": "Hand over what weapon? I'll wait? Some racist white guy isnt going to have assault rifles and think I'm going to be here unarmed.", "dra.johannam": "Always on point, friend @shauweahamilton who i was texting you about. Every cell will light up with joy and validation.", "mcsrhnb": "Y’all do realize that most people don’t hate you ? Stop playing the victim. If you actually want to stop the racists that are left argue with them specifically. Don’t stereotype a whole race as being racist. Racism is fucking awful and every decent human being knows it and therefore doesn’t contribute to it. Not all white people are racist.", "kinassign": "Can someone explain to me why what Bernie said is wrong? Sure, it’s phrased badly, but it’s not racist or violent towards black people.", "femme_inist_warrior": "@cedrahdh this is the account I was telling you about earlier!", "kortney_olson\nVerified": "Verified", "rossammie": "What about when a black man kills another black man or a black man kills a white man. Let’s talk about that. NO You only want to talk about how other races are the problem. This is what is wrong with America #maga #trump2020", "annavprokoshin": "Racist alert. Stop attacking people for their skin color.", "pictureme__rollin": "The fact u think bernie should lose his job based on a factual comment is pretty too radical and stupid honestly", "jfashionblogs": "LMAO how much do you hate white people or can only white people be racist?", "blacksnakemona": "Would you say capitalism and white supremacy goes hand in hand? Or white supremacy exists because of capitalism?", "allycat1268": "I understand the point of this post and I’m constantly learning how to be a good ally but Bernie Sanders was getting arrested for protesting along with black people. He has a history of fighting for black people even though it wasn’t popular. He had a history of racial justice activism.", "koreyrae_": "@ihartericka did Bernie really say that 😕", "it.rileyy": "Your message is fine but the tweet itself is incoherent and frankly kind of racist", "iamjulietjames": "Just something worth noting re: people shopping on Amazon, despite knowing the staff makes minimum wage. Please keep in mind some people who don't drive, who have disabilities, live in rural areas, etc have to rely on Amazon. It's the same as people shopping at Wal-Mart when there are no alternatives in their neighborhood or budgets.", "currentmscook": "I wish we could, but you’re 100% correct", "wtevrpunk": "Idk why things that individuals have done effect an outlook on an entire race/nationality? sounds racist *shrug* #anyonecannediscriminatedagainst #unity #notdiversitybutunity", "myniqabstory": "I love how the term have positive and empowering words so even if there’s negative connotation to the word it doesn’t sound like it @o00super00o @safwa_15", "colormyflaws": "👏👏👏👏👏👏👏🔥🔥🔥🔥. This was an uplifting read this evening.thank you for saying what you did. I want to find where thise quote come from also.", "ty0813": "Yes! Say it louder for the people in the back! 👏", "cnidocytes": "😂😂😂", "daszuckerhaus": "What do you mean by white people dont get to separate themselves?", "liyasunshine": "@superbae__", "godmademedope": "This is a word 🎯🎯🎯", "shesaking": "🌻🌻🌻", "opalzx": "@yxnibrmp", "hellawhite": "We don’t get to separate ourselves? We’re stuck in this box? So my daily behavior that doesn’t promote or condone racism is null and void and unnecessary? None of us get to transcend our ancestors behavior? What about the politicians of other ethnicities that are actively participating in our government? The ones designed to keep marginalized people down? Telling us we cant separate ourselves from the vile and the wicked the evil and corrupt is like me telling you you’re nothing but the worst example of your race either.  This does perpetuate racism and viollence and keeps the race war ball rolling. Stop adding fuel to the fire.", "matangold_": "No one is beyond critique but placing Sanders against the backdrop of a black child's body mutilated beyond recognition, the pleading of a black man as a white officer chokes the life from him, a corporation that is wealthier than most nations that allows ICE to use its servers to tear brown families apart and throw them into for profit concentration cages, as well as the recent mass shoots of brown and black bodies, doesn't seem to make much sense. If the goal of highlighting the pervasiveness and perniciousness of white supremacy was the intention, if this was to show that even the most progressive in the field of candidates can succumb to white supremacy, I don't know how clear that was nor how effective it is without the fuller context of the interview Sanders did with The Daily Beast.", "ke1th_": "THE LAST TWEET. group em up", "me_myself_and_everythingelse": "I know about issues that black people are facing and I think it's not fair, but isn't it just as racist to say that all white people are the same? If I would say that something is just something that black people do, I would be called racist, but if someone black is generalising all white people and saying they are all the same and they are all racist it's ok? There are people of all ages, colours, nationalities and genders that are facing problems, like poorness, beeing excluded, feeling lonely etc.", "leonicachia": "💯and why do I keep seeing the term ‘white terrorist’ as if it’s somehow different from other terrorist acts or terrorism 😩😪", "madireimer": "Holy moly", "hjorvard_ho": "So your argument against racism is to be racist yourself? That's some pretty backwards logic right there, logic that continues a cycle of hatred between people as it escalates and escalates. You're right, white supremacy doesn't value human life, it values white life. But you don't value human life either if you're willing to target an entire race of people based solely on skin colour. There will never be equality as long as this cycle continues, as long as people keep hating people for stupid things like th colour of their skin. As long as people keep fueling the fire racism is be around, it will be around until people just see each other as people. Racism will be around as long as people remain ignorant of racism, and that includes only seeing it in others, or not thinking it applies to them because of x, y, or z.", "_justfir": "👏🏿👏🏿", "sweetindicagal": "So is this gonna be hate call now towards whites? Damn y'all so racist and don't say your not because now a days everyone racist towards everybody. Why we all gotta be put under labels?? I believe in equality and i don't label people under color. Just because one WHITE male or who cares even many white males have killed people doesn't mean all whites are racist towards other races just like this man. All I'm trying to say is no matter what race there are good and bad people in this world.", "radd_ishhh": "Thank you for your constant work teaching and the emotional labour that comes with it. I value your page as one that helps me constantly learn. This post especially bc I know sometimes i think of myself as \"not one of those white ppl\" but literally wording this in a way that made me read it as if you were talking right to me, reminded me that I still have so much to learn and always will ♥️", "sezbot69": "Thank you for sharing this", "amberscloset\nVerified": "Verified", "sueconomics": "Do you have to be white to be a white supremacist?", "afr0z_n_p0ems": "💯", "browngirlsawakening": "This made me cry. I couldn’t have said it better!", "xxhaliamariexx": "That first tweet is VERY racist and extremely rude and hurtful.", "uroneblackfriend": "White supremacy is when Kamala says she’s proud of work when she acted as an accomplice to our Governor Jerry Brown who endorsed our racist San Diego Sheriff because he has investments in private prisons.", "bfitzz95": "So you dont like racist but are openly racist .", "thiskayjohn": "@deshea20 @keraioanemusic", "alenabrianna___": "A thread.", "blaidbekker": "i do not agree with what you are saying.", "auslee_shebae": "👏🏾🙌🏾", "flowerofthepavement": "Absolutely correct", "s.selectah": "👏🏾👏🏾👏🏾👏🏾 SAY THIS SHIT", "china_chapina9": "@justisgibbs", "martina_esq": "😡😡😡", "laidback_87": "Say that shit again!! I just love you❤️", "empathic_realist": "🙌🏾🙌🏾🙌🏾", "denishaspeaks": "I wanna share this entire post!!! Yessss 👏🏾👏🏾👏🏾 all of it!", "kizzybeyonce": "Why ya'll tryna protect Bernie?! Lollll", "nathan_cahill_official": "Minimum wage on a zero hour contract is not really minimum wage tbf.", "domohussles": "🙏🏾🙏🏾🙏🏾", "veevioletbree": "❤️❤️🔥🔥🔥🔥🔥", "whiixxwho": "There are a lot of bad white people don't get me wrong but don't end up dishing out the hatred you've worked so hard to stop.", "mariannascalise": "@baby_rumble", "michellemorse": "🙌🙌🙌 @inequitykills", "professortesticle": "who hurt you", "arielmartinezherrera": "Bernie deserves more than this", "daddysyndromev3": "Damn", "the_end_is_near_aah": "This is the best string of tweets I have ever seen", "datdamnnatasha": "@harlem.born.bronx.bred", "s.zart": "The hatred many commenters here have for white people as a group is pretty concerning. And why should I pay reperations if I was a white American citizen if I am not racist or hateful against black people? This is all pretty weird.", "sapientsoul": "Facts", "atypical_therapist": "👏👏👏 so glad to have you back!", "chuckthebkbaby": "💯👏🏽👏🏽👏🏽👏🏽👏🏽", "clit.hub": "A word", "cristal.yeraldine": "♥️", "deliciarashad": "This entire post!", "agramcalledinsta": "The Amazon part is bs tho. Associates make double minimum wage in warehouses and have the best benefits compared to any equivalent role.", "bee.york.sten": "Is there any way for white people to help? Since no matter what we do on a personal level we still benefit from systems of oppression? Is there any way for us to use this privilege for good on a systemic level rather than personal?", "biblicalheroin": "Thank you for this . So grateful for the labor n teaching you constantly do! ❣️", "simone.star.art": "Wow Bernie, time for some deeper education about power, privilege, and racism. What a seriously damaging thing to say.", "karolinapangracova": "I love how in this age you can ve rasist as long as you are rasist against white people. But it's still rasist.", "blondielhv": "WTF the Bernie Sanders thing?! How does he not equate that comment to racism?!?", "61gel": "Oh internet you so silly.", "xaviaier_m": "🙌🏾🙌🏾🙌🏾🙌🏾", "kmomo_notlew": "@berniesanders 👀👀👀", "alvarosalazar95": "This is the most retarded racist shit I've ever read", "adinadee1": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "ms_write_now_voice_later": "yes ma'am👏👏", "toojays.jpg": "Lol huh", "serenaastrid": "@sweetkellyanne", "halalpig": "You blew me away ❤️ real!", "capicu_": "💯", "itsmechrisjohnson": "Preach 🙏🏾", "allieschwenn": "@ihartericka Reading the comments on this post makes me sick to my stomach. Thank you for shining a light on these topics and thank you for enduring the asinine responses.", "heidy_ace": "@erinhamerstone whoa...intriguing. Didn’t think of this", "lissy0294": "Sad but very TRUE! #thisisamerikkka", "medinamaitreya": "Fuck yes. This! All of this!", "lady_ayaba": "That post made my day !!! 🔥 Thank you so much ❤", "ajbuck94": "👏👏👏👏👏👏👏👏👏", "_gabbiethesag": "Phewwwwwwww @ghostfacedijah thoughts?", "domesticnymph_": "@mamilikespeaches", "theinbetweenqueen": "As a white person I am grateful for this brutal read of me (even if just my unconscious) and my peoples’ history. We MUST do better. White fragility is useless.", "thuyugedi": "i liked this until you included bernie. what he said wasn’t problematic at all.", "leura__": "#Erickaforpresident", "chaycinchange": "🎯", "lastcutproject": "We can not deny the facts!", "susie.wildin": "Don't take what Sanders said out of context. It's true that white folks are uncomfortable about a lot of things when it comes to race, and they need to be. From that space comes change. Sanders has been fighting for civil rights for decades and if that's not an ally, then you lost me.", "robbyjhope": "Despite making up only 13% of the population", "purplebatman5": "You suck", "colton_iw_229": "Umm what about the black race ratio to white race in correctional systems for violent crimes is in the range of 40% greater...This is mental problems for events of no reason. No need to be quick to accuse instead of caring for the effected....", "k8saidwhat": "@goetzwhatshewantz", "giselle_makeup": "Oh Erika... I wish I could just hug you right now. Too much SHUKIN N JIVING IN THIS INDUSTRY", "tommorrowschild": "The Bernie one I kinda understand because I don't think they were racist, they probably just felt like they would get in trouble for voting for a black person", "chaiforedna": "Imagine being so blind to a problem/ what is happening, that you blame the person telling you about it, for it! It's the definition of don't shoot the messenger. Not to mention, you didn't even say anything hateful. Just stating facts.", "ashleydumbor2": "@ihartericka can you explain how calling every white individual \"supremacist\" is any different than white people calling Muslim people \"terrorists\" ?", "itsarielleeee": "@dee_ana21", "loosey_flawlezz": "Thank you for this.", "liasha1010": "😯", "fem_noir": "This hit me in the center of my chest. Thank you.", "adriaffinity": "👏🏾👏🏾👏🏾", "robinsonlikejackie": "Let the white tears begin", "kingbandit21": "Period !!!", "lovelydame3": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "diegothomason": "These are controversial to say the least", "katewatson0207": "😮😮", "garden_britt": "🙌🏽🙌🏽 this !!!", "jmoralestwo": "@amoralestwo", "displacedyke": "damn, you’re always making fat ass points, Ericka. Bless 🙌🏾", "bunnysobol": "Exactly the point, hate in all forms is harmful.", "soulwithbeauty": "It makes me so angry, don’t even know what to do anymore. They won’t even pay THIS terrorism any attention. So tired. What can we do that will actually bring change?", "blaines_magmar": "I understand and appreciate all of these posts but the Amazon one. That's just business lol 🤷🏽‍♂️", "korc.can": "Ne dion aq", "missrepresentationxo": "@ravenstarfire 👏🏻", "panopticonnor": "@swan__meat this is some solid history and present", "secularweb": "“White people white people-ing” Just replace it with: “Black people black people-ing”  And just you watch how you’d cry racism. Hypocrites, you aren’t fighting racism when you’re racists yourselves.", "dankblissey": "And as well, white privilege was caused by white supremacy. Not the other way round. White supremacy is the ideology that causes privilege, it is not whites acting according to the privilage that they have.", "deannaruth_": "Agree with most but Bernie Sanders isn't alone and isn't at fault. Politics is complicated and voting for someone who you think will win is always going to be the first over voting for someone who will change the status quo", "vitamin.dani": "As a white person, what can I do to help?", "bananafannafofellie": "♥️", "lunae.lucida": "all of the white people (and I say this acknowledging my privilege as another white person) trying to claim it’s racist (how???) to acknowledge what terrible actions white people are doing is just gaslighting the communities of people of color who are being affected, trying to guilt them for voicing injustice. I live in Dayton. There are many milquetoast white areas near Dayton claiming that this isn’t related to race when the Oregon district and downtown Dayton is more densely populated with people of color. Why are you speaking over the voices of people of color when they are more intimately affected by this violence? Do you live in fear of ICE agents checking the citizenship of the victims in El Paso?? Do you own the narratives of the people of Dayton? No. There’s no reason to just sit. Down. For one minute and listen to someone else. I say this to the white people in these comment sections as another white person: please have some empathy and stop being so fragile. We all have a responsibility to uplift the voices of people who’ve been harmed by our population’s history of terror to people of color if we actually want things to change", "nitastar6": "Trump is not the cause... it's the consequence.", "kindnessgangsta": "Shared immediately. This is an important conversation. I have so often been brought to my knees by your bravery. Kudos.", "lorena.geee": "Thank you 🙌❤️", "permasamra": "Amen", "karish4va": "Shit.... I didn’t know Bernie Sanders said this.", "abrantina": "Going after Bernie but not mentioning Kamala’s role in the imprisonment of Cali’s PoC is a bit confusing lol", "daria_ann_poet": "Wheeeeewwww", "franticjazz": "@laurenjokirkham I’m white. I presume you struggle with reading comprehension tests. Educate yourself, listen, learn, grow the hell up. The fact you managed this post about poor little you is exactly why it needs to be written & needs to be understood. For a start, I would recommend reading Why I’m No Longer Talking To White People About Race, by Reni-Eddo Lodge. Hopefully that will help prevent you from embarrassing yourself further.", "bourke": "Truth", "fred_skywookie": "I find it ironic that in a country build on the bodies of millions of natives, some people fight to know whose the most racist of all. Black. White. Asians. Latinos. All your ancestors are killers, stop being hypocrites.", "faithkeln": "@specialkai", "undivided_inc": "Truth ✊🏿", "sistasdotravel": "Reposting 👈🏾👁👁", "chelamitchell": "All of this", "dtnla1": "🤦🏽‍♀️🤦🏽‍♀️🤬🤬🤬", "littlemoonsprout": "@willchampbrown", "shishi.rose\nVerified": "Verified", "sunflowrbruja": "WORD", "gtidiva": "♥️", "lynsi711": "I believe. You know the truth of the world. I am on your frequency, just came into truth the past week. It’s been shaking, but knowing you’re here with me, as are others, is calming. The world will change because the world has changed and time doesn’t exist cuz history is now but like damn I’d love for it to pick it up a bit lol.", "_pilobolus_": "I am white. I have been following you for a while and every now and then you will post something and my initial reaction will be “hey! That’s not fair. *I’m* not like that.” But then I will think about it for a few days, or maybe even a week and realize that through my initial reaction I *am* like that. And that because I am a white girl that initial reaction of denial and unfairness is probably not going to get called out. THAT’S my white privilege. THAT’S what is unfair.", "dragonstories": "\"There's no question that in Georgia and in Florida racism has reared its ugly head. And you have candidates who ran against Gillum and ran against Stacey Abrams who were racist and were doing everything they could to try to play whites against blacks,\" he said. \"And that is an outrage, and we have got to continue doing everything that we can to fight all forms of racism.\" From Bernie clarifying this quote", "walk_so_serious": "Yep!", "porio._": "the first slide is literally the equivalent of me saying “Gang fights are just black people black people-ing and acting out of the lack of power their race gives them” and i would be called out as a racist if i posted that. This is the most ridiculous post i’ve seen regarding “white supremacy” and it’s incredibly offensive and racist.", "gretchen_skitchen": "Wow 🙌🏽🙌🏽🙌🏽", "allhaillola": "SPEAK THAT TRUTH‼️ESP WITH @BERNIESANDERS FRAUD ASS", "chronicallyliv": "#thatwholepart 🔥🔥🔥🔥 Say it, sing it, shout it, scream it until the tune shifts to something much sweeter, much more humane, + much less traumatizing.", "erikka4now": "This is so 🔥", "grimeewaifu": "Bernie was never our jewish savior (@ white jews)", "angelicaishellabasic": "B", "norestfortheleary": "Heard", "fumeete": "Sunday sermon.", "sheldridge": "Speak on it!", "lynnaecbrown": "mic👏🏾drop👏🏾🎯", "midtownjamiebrown": "🎯🎯🎯💯💯💯", "mxkingyaa": "Yho. Yho. Yho. Yho. Truth!!!!!!", "elainaloob": "I agree with 90% of this but the last slide has me confused. why choose to divide this nation further by saying that white people don’t get to separate themselves? I am ashamed of the actions of many white people, but i educate myself and act differently from them. Would you really want to put the white murderers in the same group as those using their privilege to help lift up our brothers, sisters, or siblings of color? If someone can help explain, I would really appreciate it! no hate here :)", "r_gm112": "@glennondoyle not picking on you, I tagged you because you have a large amount of followers and regarding your recent post, ALL white people regardless of gender, y’all do not get to separate yourselves from what is happening...", "_lifeofshi_": "Whew chile the yyt ppl in this comment section, and of course majority are yyt women. Some of y’all just love to be complicit. Smh. You wonder why a vast majority of BIPOC don’t have any faith or trust in you. Smh. So worried about your ego! 🤦🏾‍♀️", "adeola.naomi": "Facts on facts on facts!!!!!", "igster11": "🗣SAY IT AGAIN FOR THE PPL IN THE BACK", "kevinkabadi": "THE FACTS 🤞🏿", "raarontogo": "Thank you 🙌🏼♥️", "miashaforbes": "🖤✊🏾", "shylamoma": "All of this sis all of this...", "barefoot_bella": "🗣", "simimoonlight": "PERIODTTTTTT", "its_paris_woods": "Some of the most uneducated blatantly racist statements I’ve ever seen in my life.", "nimba_gal_": "And what she said about him was also true and honest @ashcatchembitch ✊🏾❤️", "arrestcarolebaskin": "#berniesanders said what now", "mcclainstrong": "Wow. 👌🏾! I hope this is read. All of it.", "sunriseindisguise": "Canada isn't any better, but my heart breaks anew every time I hear about something going on down in the States. Thank you for the work you do in these posts, I truly learn more from you and some others than I do anywhere else.", "daeizm": "really couldn’t have worded it any better ✨ 👏🏿👏🏿👏🏿", "teenerwiener": "@simondavidsuzuki 😞", "race_jones": "whew. a word", "i.s.a.b.o.o": "As a native El Pasoen, know that our city is one of the kindest most loving cities in the world. this act of hate does not define our city. we are not dangerous, we are hurting. our hearts are empty and heavy.", "matekiwrites": "That last tweet!!", "mercii_me": "Truuuuuuuuuth 🙌🏽 just SPRAY it everywhere like Febreeze!", "luvmycai": "Most real and best post I’ve ever read on this topic of “white supremacy”!", "tamyraj_": "I'm glad you're back! 🗣 🔥", "kenta.chumil": "This! This right here is what I’ve been trynna formulate & verbalise for years but haven’t been able to manufacture the language to properly communicate but this! This is it right here. Thank you so v much for sharing.", "farleyfrog": "@thecastlelove this", "momminique": "On this day Mr Garner wasn’t selling cigarettes, even though he was known for doing that. On this day he broke up a fight that the police were called for. Which is why Mr Garner refused to get arrested.....he did nothing wrong and was murdered for standing up for his self....", "yo.monixa": "Well said once again!🙌🏽", "_j_carter_j_": "So sad the world we live in 😢", "kewlestchikever": "Fuckin 💔", "sugarazn": "Facts on facts on facts", "pelau": "On point! 🔥", "sejalbarai": "🥺", "mamakrust": "🗣🗣🗣", "keashka": "Thank you for this.", "kamalamama_": "@roguemp__", "sirenssongstitchery": "@bee_tiberiusthornton @rockinannie @katherineshafferdesign @pinkladyunikorn please follow this account if you aren’t already. As my friend.", "joannabananaa": "Boop.", "commandofitnesscollective": "All y’all heauxs!!! A red hat and a hood doesn’t make someone racist 🤷🏽‍♀️", "thegrapevinetv": "Let me go retweet this", "citrussunn": "I didn’t know Bernie said that", "_yasja": "@yosoycueponi", "so.demilicious": "Incredibly well said!!💯🙌🏻", "sarlejeffries": "Was trying to like every slide... 💯", "ladamanic": "Sick", "shannawms": "👏🏾👏🏾👏🏾👏🏾", "darkskindchk": "Carolyn needs to be incarcerated", "pualanastyle": "💯❤️", "asiaaneka": "Yo, I live in Dayton and if I hear one more person cape for this monster (who even killed his own sister) I'm gonna scream. No lies in your post at all. I am angry, hurt, sad, and terrified.", "taashamac": "@i_am___jojo oof", "nikkifaustinn": "DAMN", "analapelotahumana": "equating Bernie with the rest of criminals and hateful jerks who actually do whatever they can to keep their power is just as bad. Miscommunication and blatant hate violence is not the same", "stringtheorystudios": "You. All.", "_w.a.n.d.e.r.e.r._": "Every slide !!!", "nat_allen128": "I don’t understand the “and white people don’t get to separate themselves” part? Could someone explain it to me if you have the time? Sorry if I’m being dumb!", "iam.cierraurso": "Fuuuuucking yes", "_healthywealthyhappy_": "🗣🗣🗣🗣", "abbeythevulture": "Thank you. We as white people need to do so much better. I appreciate the way you shed light on the truth and how you continuously open my eyes.", "saudakariima": "Yup.", "fruittcakkke": "You went away for two weeks & came back super charged . For US. this a whole word.", "allie3114": "Truths white people won't acknowledge or accept", "carmenmarissa": "This whole thread - thank you", "beaderbae": "🙌", "missjeris": "This post is on point. 💥 Thank you. ❤️", "saskilluh": "facts and more facts", "juguayye": "🙌🏽", "theealchemist": "🗣️🗣️🗣️🗣️🗣️🗣️🗣️🗣️🗣️", "joshuasoucie": "@ihartericka Massive amounts of respect for your activism. Please hear me out: I agree with all of this, and I understand the point you’re making. Still, I will argue that it is impossible for a white person (noun) to not white person (verb), which is why the term “white supremacy” is useful. I can spend every day of my life challenging my own internalized racism, and I can call out others when they are ignorant, but my skin colour remains the same. That is to say, I was socialized/conditioned as a white person, and believing that a white person can achieve some sort of absolute objectivity and therefore no longer white person (verb) is, in my opinion, dangerous. That is why a term like “white supremacy” is useful as a qualifier for a person’s overall ideology or specific beliefs/opinions/attitudes.", "onnissia": "SHIT'S UBIQUITOUS!!!!", "jackie.eberle": "I️ love that you bring the truth and open up my eyes even more for every situation! We need people like you to guide us and remind us!", "thetranscapitalist": "👏🏾👏🏾👏🏾", "mylifeepiphany": "🎯 period.", "katieloudalby": "@matirawheeler", "soloreys": "@lexitakespictures", "kivvirachelle": "All uh dat! All. Of. It.", "tteokjjongi": "this !! i feel like everyday my eyes are opened more than i thought possible by your account, thank u so much !!", "biggs_universe": "That last slide though.... 100% facts. If yall can lump, dammit so can we.", "emmapritchardswe": "If you feel uncomfortable voting for a black person then surely and obviously you'd have to be racist. Why else would it be uncomfortable? Voting for the person you feel have the best policies should be the most important part of casting a vote, and not a person's ethnic background.", "anticapitalist": "AND THATS THAT ON THAT💅🏾", "deeannenokes": "@bananastand_dreamin", "kyra4pres": "💥💥💥❤️❤️❤️🙌🙌🙌 #PREACH", "cacaonaa": "@chakabars", "babymamahood": "😭😭😭😭😭", "samirah_tama": "TRUTH. And it's EVERYWHERE. I'm not sure how white people do not see it. I am a white passing person (once people find out I was born Jewish, I no longer look so white lol), but it is CLEAR the power one has with lighter skin. White supremacy is EVERYWHERE worldwide. I call BS on all those in denial. Such tragedies 😞", "jxxh_txxdgxxn": "Yea, all whites are the problem The gov stealing 35% of my pay, then charging me taxes on everything else I buy, and charging for licensing everything I do outside of work, stealing my weapons, and keepin every single photo/text message I’ve ever sent/received... that’s fine.", "emilylovesbroccoli": "@allyb", "catspi66": "You’re right. I’m not separate from this. Thank you for this reminder. Fuck white supremacy and white folks who uphold it daily.", "regwaldo": "@lachillindrina shook", "leah_abraham": "This is so powerful", "hilarydawnherrera": "I hear you💗", "cusigotitlikethat": "I feel all of this, thank you for putting it into words. 💜", "urbanbuppie": "@msporterdidit whew!", "11315dayslater": "💯💯", "thifae": "🔥", "ben_uh": "This", "campgirlmagic": "🙌🏾🙌🏾🙌🏾🙌🏾", "annamae9513": "👏🏾👏🏾👏🏾", "reginahmako": "a THREAD", "dianemmurray": "@o_e_and_me", "frequincys": "The point made here is as clear as ever. Yet, people will find a way to pretend they don’t get it. Thank you for the obvious point that white privilege has been around for years, and is a disease that needs to be addressed and cured 🗣👏🏿", "lady_dee.ee": "🗣🗣🗣🗣🗣🗣", "teddy_j": "Truths. Facts. Compellingly stated. World needs so much more of this, tho that in itself is a tragic fact. Thank you.", "slutofthemonth": "I sure did miss you on these here interwebs", "spellsgabrielle": "To all the yt people validating this post, feel privileged to send some reparations. Venmo:spellsgabrielle or PayPal: gabriellebronx@gmail.com", "laurenkellybenson": "Thank youuuu!!!!!", "maddogmeg": "This. 🙌🏾", "alwaysmlove": "Whew.", "la_bruja_masputa101": "Period!", "xoyote": "RAGING", "murriecurl": "👍🏼💖", "spideygirl91": "Whew! 💯", "youngseedssun": "Shit!", "sexologistshamyra": "Chile!💚", "wonderfulbagofmeat": "@manbabygiant", "kinasky": "Thank you! My sentiments exactly. It’s not Trump, he is only a distraction to the reality of our country and lives.", "doitwithgrace": "🔥", "c0rdero_87": "@ihartericka ✊🏽", "ashleemariepreston\nVerified": "Verified", "sassy_stas": "EXACTLY!!!!!!!", "blackaquafina": "Pass the collection plate this is Sunday sermon we all need to hear.👏🏾", "ava.kill.la.kill": "Where are the lies?! No where in sight! This is America and many of us have been taught and conditioned to accept white supremacy, racial injustice, and white privilege as the norm. Even as we speak there are multitudes of white people playing the mental illness card for terrorism committed by white simp beta males. I engaged with one that claimed white supremacy is caused by mental illness. So Hitler was mentally ill when he orchestrated the massacre of 6 million+ Jews and non-whites 😒 I’ve never accepted racism perpetrated by whites as normal and I never will. But if this country continues to defend these acts of terrorism...the next one will be a combination of Columbine, Virginia Tech, Lubys, McDonalds, Las Vegas, Charleston, El Paso, Dayton, etc. Gabri", "livshaa": "I'm sure some white person is having an existential crisis reading this. 100% facts, 0% lies.", "etothecgirl": "Also, all of this you wrote here is so true. So much white fuckery, all day every day.", "margaret_amy": "Thank you for sharing, I wholeheartedly agree. I can't apologize enough for this disgusting behavior.", "_missrich_": "Deep and so eye opening. I appreciate this message of truth!!", "blackwithplants": "😍😍😍😍😍", "aisha_chey": "Oof. Lordt.", "reginabeana": "so happy you’re back @ihartericka", "__duer__": "Is there a full quote from Bernie or a link to an article or interview? I’m trying to do my own research of course but outside help is appreciated", "eva_godiva": "Thank you for this beautifully written, and emotionally rounded statement. You conveyed everything I've been screaming about all year long.", "novareidofficial": "This is the most powerful and truthful account I’ve seen in this and more. Thank you for speaking up. 🙏🏾", "destiny_laurice": "🔥", "lovingmenprince": "Exactly! A repeated cycle of slavery! The only difference is now that it's modernized.", "petal_pusher": "Still trying to clean the whitewash from my brain, thank you for bringing attention to my dirt.", "_aztec.warrior_": "💔👏🏽👏🏽👏🏽👏🏽🙌🏽", "classandjazz": "Stop talking about it", "ascensiongoddess_": "A thread CHILE!!!", "ikiefa": "All of this! 🖤", "lisahawks": "Thank you for this", "waverlyrosee": "I didn’t read one lie. But I’m 💔 about having to open my eyes to Bernie 😭", "lerinalta": "🗣 FACTS ON FACTS ON FACTS.", "_big_fern_": "Goddamn it Bernie", "suki_miyoko": "All of this!!!! 👏🏾👏🏾👏🏾👏🏾👏🏾", "mikelmccorkle": "@haymccorkle_", "ashcatchembitch": "Why'd you go in on Bernie? What he says is 100% true and honest.", "professorkilla": "🔥🔥🔥🔥🔥✊🏽✊🏽✊🏽✊🏽✊🏽✊🏽✊🏽", "khadiyogini": "Yes, Sis!!", "mama_yb": "👏 thank you", "etsinthecity": "THIS", "mozaic_soul": "Thank you for this 🙏🏾", "bostonchery": "Sheesh , all facts", "1sewwhat": "I double tapped on ALL 8 slides!", "kirhunter74": "Yep.", "venusmichele79": "Talk that shit!", "serendipitouswool": "Yes 🖤", "panddaa.po": "Every time I see a post of yours, I learn something, my perspective broadens, I become more aware, even in the seemingly littlest ways. Thank You for always saying it as it is. It really is inspiring🌹", "moeimaornah": "All bases covered.", "shanshantel07": "ALL of this! 👏👏👏 Thank you!", "johannaalmo": "PREACH!!! This shit isn’t new- it’s white peoples MO", "ruth.a.roni": "That last slide tho", "aarynnlang": "!!!!!!!!!!", "raqqnit": "👏🏾👏🏾👏🏾", "_ncarrington": "👏🏾👏🏾👏🏾", "qbrandi29": "🌈 your words heal me.💕", "prettyinpunk.co": "THANK YOU. 🖤🖤🖤", "painkillercam": "U came thru with multiple words this am!! @ihartericka", "cootieface123": "I wish I could like each individual slide!!", "j_a_zarifian": "All of this. ALL of it. And if we are not actively trying to dismantle - not just call it out - then we white people are just as complicit.", "americahatesus": "you said it all. and we are here for all of it. 👏🏿", "loveiscourt": "A fucking word...", "sydniem": "I would say louder for the people in the back but white people are only going to say that black lady is yelling, she's so angry, blah blah blah. Thanks for saying it at all and I hope white people pay attention.", "angrybrd24": "Accurate facts", "artofzena": "😔", "mcknisms": "@malcolmmartinaliandme 👏🏾👏🏾👏🏾 adding to your post earlier", "tracyleerhodes": "You're absolutely right, we've got to do more than what we're currently doing. You've given me a lot to think about.", "rosesnberries": "👏🏾👏🏾👏🏾", "dysartist": "Absolutely and completely.", "loliluxe": "🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽🙌🏽 I have goosebumps so well spoken", "beccashetler": "🔥🤦🏻‍♀️🔥", "beurre_monte": "☕☕☕", "bespokecurry": "Spot on. Thank you for you voice 💗✨"}