{"iamguzie": "🌚🌚🌚", "icanstillfeelthelove": "looking at the fact that the only way to save the planet is to go vegan and without doing so we will all not exist anymore, vegans actually care more about black lives than non vegan black people. I can't care about a cow's life without knowing that every single human life is important first. that every struggle a human being faces needs to be fought against. if people wouldn't lay hands on any animal, than they sure as hell wouldn't do that to people. I'm from ex yugoslavia and our history is completely erased and people don't talk about that or know about that at all and I can still understand that a cow's life is just as important as a bosnian life that struggles 'cause their family was murdered for being muslim. & I understand that if 50 years ago the world would have been vegan, the yugoslavian war wouldn't have happened and if people were vegan 80 years ago we wouldn't have been raped and killed by nazis. and 300 years ago we wouldn't have been opressed by the austrians and 900 years ago wouldn't have been killed and raped by the osmans. so veganism is not the solution to every single problem or every single ignorant person walking this earth. but it's the most inclusive social fight there is.", "sonja_1988": "@brwnsuga_p13 Straight facts!", "lizzie_amscar": "Yet most vegans wear leather shoes and leather belts...they say their vegan cos they follow a vegan diet but clearly in reality alot of vegans(real vegans don't get at me)are just going with the fashion masses...", "total.libertion6": "There’s a Veganism of Color Virtual Conference happening sept. 14,15. To all the white vegans getting fragile about this post, please attend and LISTEN and EMPATHIZE with what the speakers will be talking about.", "thomma_thomma": "To everyone mad in these comments: this is not a post attacking veganism, it is a post calling out white people for their lack of action in response to racism & gentrification & rightfully so. White people have work to do, an apology to give & reparations to both make & pay. Thank you, @ihartericka; this was necessary.", "kpamfilis": "@elishamama", "themarrigan": "@pineapple_ally follow Ericka!", "honeybobadoh": "boom 🔥🙌", "thecuratedisland": "I don’t think it’s vegans that are the problem. Racists are the problem. Vegans are actively against slavery. Period.", "marinandoblog": "@elieler marca seus amigos 😂", "tranquilitybaseacu": "💯 🙌", "effemelle": "Yessssss", "jfashionblogs": "Black people don't even go hard for their own. 97% percent of all black people murdered are committed by other black people and 60% of ALL murders are committed by 12% of the population, black obviously. You literally cherry pick non-issues and ignore the real problems that exist in African American communities then blame white people lmao. Shut up.", "amxzing_series": "Well, animals are getting killed and they barely have any rights. Even though they are just as important as we are. Especially when you're comparing it to racism you should notice how similar saying \"but it's another race\" to saying \"but it's another species\" is. And on top of this, vegans get a lot of unjustified hate", "bellygril": "I stan the accusatory bullshit between black vegans & carnists wtfever when we could just be acknowledging the power structures that exist in within race, environmental justice, and consumerism so that we can ALL abolish that shit TOGETHER but wtv", "realsavagevegan": "why are you being divisive? I know many people that are going hard for both. what are you going hard for?", "ludwigvandog": "I wish people went as hard for saving the earth as they did for veganism too :0(", "dinneratmidnite": "Ugh srsly", "vetnurses_forallspecies": "I guess you’re just forgetting that intersectionalism is of very big importance to many people in the movement. Because you can’t ignore systematic oppression in other areas of life, and what we want to be achieved cannot without addressing it. The steak emoji though? Not classy at all. Oppressing anyone (human or animal) to benefit another cause is entirely pointless and pathetic. They’re all interlinked.", "theumabomber": "👏🏼👏🏼👏🏼👏🏼👏🏼", "beelexii": "People are missing the ENTIRE POINT!!! #period @ihartericka", "tiye.jones": "They big mad 😂😂😂😂😂😂😂😂😂😂 this is hilarious", "da_bigsissy": "People can’t read", "unkleluc": "I go harder for black people. Y’all can eat trash if y’all want", "rhys_r17": "*visible confusion*", "nicolecatherine1111": "You cannot justify the oppression of one animal by oppressing another. That's just some backwards ass shit. Both are important. Equality is important on all ends of the spectrum. Animal liberation is human liberation.", "displacedyke": "I hate vegans.", "theindigokitchen": "I hear you. As a vegan I’ll always show up for my black sisters and brothers with double the energy. I understand veganism is a privilege. Thank you for all your work and all you do for the black and lgbtq+ community. 🖤🙏🏽", "teenbabywitch": "People getting real tight when the truth is said. I’m a vegan but I whole hardly agree with the fact that priorities need to be address. Vegans want to live this woke ass life but ignore the fact that being a vegan is a privilege in America. A white privilege that is wrapped about wealth. Spending more money on organic foods and knowing more about the injustice of factory farming doesn’t mean you’re woke. Put more energy into racial injustice in America.", "simonalachingona": "@hownottotravellikeabasicbitch also, not sure if you follow her but she speaks fucking truth all the time", "cee_gbolt3172": "@ihartericka I have not seen such reactions on your comments! Wow I think you just proved your point in original post! Smh 🤷🏾‍♀️", "thegustavomunoz": "You’re hanging around THE WRONG vegans. None of the vegans I’m in even peripherally in contact with are this monstrous vegan the woke left has made its target. Literally who is this vegan? I’ll set them straight.", "ihartericka\nVerified": "Verified", "juanitalabelle": "Black and Vegan. ✊🏾🌱", "themountainmindset": "@hownottotravellikeabasicbitch this made me think of you", "justin.a.j": "Veganism frees you from this victimhood mentality", "nynajay17": "How do you feel about black vegans supporting this narrative that not eating meat is the answer to unethical animal practices", "sunflowersol_prod": "LMFBO OOOOOP!", "michaelaslapanska": "@lrojascalderon", "sewerrfaerie": "y’all are ignorant as hell good lord. you’re going after RACISTS. not vegans. do not intermingle the two.", "barbara.rodriguesg": "Indeed! Veganism opened my eyes to some oppressions that i wasn't seeing because i don't live those. But on many vegan groups, ppl just don't give a fuck about other oppressions (just the animal ones) and live on their capitalist plant based world thinking they're sooo cool and empathic ppl. Hypocrites AF", "laurensgainsonplants": "Sorry but if you don’t understand veganism then you ain’t as ‘woke’ as you think and you don’t believe in equality you just believe in certain aspects of it. For the planet for out health and for the animals 👌🏾👌🏾 we can preach about POC issues and veganism just like we can preach about lgbt issues and POC issues someone who truly believes in equality will fight for POC LGBT and animals period. ‘Woke’ people will be out here talking on all topics there are plenty of black vegans who are woke AF", "nikifricki": "Wauw people read SO MUCH about themselfs into one sentence. It’s facinating and cringeworthy to see what happens in people minds and how little questions are asked! 🙆‍♀️", "beanepi": "Food justice means access to food in a way that you can choose. What you choose is beyond all of this and beyond what's important. What's important is that black people can't get food or enough food or safe food or figure out what food works for them. That's the fight I'm fighting. Trying to get people to eat vegan is irrelevant, getting people food is relevant. I'm vegan by any means because that's what works for my body and my mind, if I have to eat something non vegan then I do because I have to eat. We're all focused on the wrong thing, I think that's what Ericka is saying.", "johnslatoya": "Shoot add the yoga community, dog lovers, cat lovers,crossfit community, ect 😂🤣🤣🤣", "jennmcune": "👏🏼👏🏼👏🏼👏🏼", "aprylelectra": "I stay vegan to save my own life (health issues) so I can rally for the homies, including you. I don’t pick and choose. I care about my POC family and friends just as much as I care about animals. I believe everyone deserves happiness, safety, success, love, etc... I’m sorry if there aren’t enough of us. I agree that we can do better. Speciesism and racism are not that different. They both stem from a group of people who think they are better than or deserve to own and control another. As an intersectional vegan, I do feel like most white folks are way more interested in hearing me preach about the injustices POC face daily vs the awful conditions most animals on this planet live in. Most white folks I know actually care about POC and sometimes eat vegan food. Then again, I live in Brooklyn. Again, we can all do better. Shaming groups of people does not unify us. Imagine if all of us who are oppressed united?", "fetus.eatus": "We'd have enough food to feed the hungry in Africa (or most places in the world) if most of the world ate plant-based, just saying. We are already growing enough food to feed the hungry, but we choose to artificially breed and fatten up over 56 billion animals every year. Also, maybe if we teach teach our kids to be kind to EVERY kind, no matter the species, maybe we'd have a more compassionate world. 😇", "brsuga": "Damn ..... absolutely right @ihartericka", "kink.and.cuddles": "I’m vegan, feminist as well as a lgbtq+/ black ally. Perhaps I’m wrong but I believe that the roots of oppression are the same and intersectionality is the way forward. All are equally important to me but - honestly - on a day to day level, veganism is the one I can “do” most easily in that I have 3 meals a day so at least 3 choices of what to consume and I can make those decisions when I go shopping for clothes etc. too. Feminism/ racism etc. are harder. How do I fight as hard for those, what decisions/ actions can I take? (Genuine question, as in looking for advice) I would also say here, that veganism as an environmental movement is extremely important. It’s one of the things we can do to protect the earth, without with everything else will be obsolete anyway. It’s important!", "ceddywiththegoodhair": "Oh shit!!!", "m_a_mcdonald": "So many people have missed the point of this tweet 🤦🏻‍♀️", "choopboop": "There will be no black nor white people if we will continue to kill the Earth. I get the beautiful intention behind the post but honestly those are two different things. We should encourage people to fight for both not to turn people to fight each other . If you are fighting for equality then spread love not hate.", "yeza_be": "facttssss and where are these “fur is murder” fake blood throwing* bitches at when they kill black men and women on the street for no good reason🤔", "ix.lives": "Every vegan I know (even the white ones) also advocate for anti racism. Many of the vegan accounts I follow were posting about the indigenous people affected by the Amazon fire as well. It's not fair to assume that because you see someone publicly advocating for a certain cause that they don't care about the others. And what work they may be doing in their daily lives for other causes. Also being vegan helps communities of people of color becauee as mentioned above the detrimental impacts of animal agriculture disproportionately affects POC communities. So they are indirectly helping non white people. Someone could tell you \"I wish you cared more about the environment than sex\" just because it's not what you mainly post about and advocate for, doesn't mean you dont care about it.", "cala_verita": "PREACH", "veggirl3993": "“I wish y’all went as hard for animal rights as y’all do for human rights.”", "dharma_maja": "🤦🏽‍♀️", "lily_jane": "I wish someone screamed this in my face 2 years ago. We (white ppl) go on and on about veganism, plastic, climate change (guilty✋). I realise now it comes from a place of self gratification to replace that guilt of not taking action against racism. I totally realise that now. It's white PRIVILEGE that puts me in a position to choose my diet & shop @ package free shops. Human Rights > animal rights. White ppl: don't be an ass and compare animal farming to slavery. Just don't.", "pineandwillow": "Damn. Yes.", "alexstirfry": "Yes. 100%. Yes.", "stephaniemadeit": "👏👏👏👏👏👏👏", "trueherbivore": "Well I live at the intersection of black and vegan. In my personal experience the fight for animal rights and human rights connects quite often. Health epidemics like heart disease, diabetes and hypertension disproportionately impacts the black community. These health issues are directly linked to consumption of animal flesh and secretions. The USDA funnels low grade meat and dairy products through the school districts to be given to children. Typically in poverty stricken neighborhoods where the majority of the population are people of color. The employees working in slaughterhouses under dire work conditions also typically people of color. Let's not even talk about food deserts where fresh fruits and vegetables are inaccessible and each corner is populated by a fast food chain restaurants again typically in neighborhoods where people of color live.", "mr_nicdraw": "Um...What about black vegans? They do exist. It is a thing.", "kingpaigexiii": "AND NOT USING STRAWS***", "m.aariririiaaa": "If y’all are out here going hard for Black people, then THIS 👏🏽 POST 👏🏽AINT 👏🏽FOR 👏🏽YOUUUUUUU! *in my Soulja Boy Crank That voice* GAHTDAMN! Meanwhile, half of the huite people on here asking why can’t it be both, also be the same ones yelling “all lives matter” 😫😫😫😫🤬🤬🤬🤬", "brownsugarjew22": "Some of these post be so woke they are overstimulated.. sigh", "alikoshamlerfreid": "So white people can't fight for causes they believe are valuable to all human races unless they fight more for black people, is this correct? Sometimes your logic is mind blowing", "iamjanetphoenix": "Yowww i mostly eat vegan and I’m all for it and I didn’t feel offended. Do y’all even get the post ? Lol. It’s not about NOT promoting veganism. It’s about a lot of people prioritizing animals over black people which is trueeee. Y’all wanna be angry so bad 😂", "luucy.rue": "I felt this in my chwessst", "hm.m.m": "Wow ur just tryna defend killing and raping animals. Ur heart knows its wrong so now u actin out. There is a HOLOCAUST happining.", "blackhanukkah": "scream it louder for the white vegans in the back!!!!!", "koyukipanda": "If it don’t apply, let it fly😂😂😂", "mimilachingona": "Vegans care more about animals than the conditions and wages of the people picking their fruits and veggies. Being vegan doesn’t mean you’re eating cruelty free.", "chicddc": "I believe in the post she’s referring to white people who will talk about killing animals but won’t care to talk about killing black people.", "_chris.danielle": "@ihartericka Hit dogs are hollering real loud in your comment section! 😂😂", "evelyn.h.bell": "I am so so so happy I found your page!!", "kadarbra18": "For all the people talking about how vegans care more about animals then people just know that in order to produce all that meat at a cheap price you buy, the government paid white farmers to make sure tons of livestock never went a day without food while at the same time there are millions of hungry people of color in this country. I think that's wrong. No animal should get government assistance to eat while we have hungry people don't you agree?", "mntnmermade": "Have you heard of protest kitchen? Food is political.", "chelsthebro": "that vegan anti-blackness is jumping out like a mofo", "saralauraellen": "Tiring. It’s not either or. You can choose to care about more than one cause. You can be against all forms of injustice. You can also not care about anything like majority of the people unfortunately do and not be vegan, feminist an activist etc... veganism is a part of the overall solution. It isn’t taking away from the pain other people have to go through. Vegans care about the 50+ billion animals that are killed for people’s meals, but vegans can also care about fighting for human rights and women’s rights and any other thing those individuals are passionate about. VEGANISM DOES NOT TAKE AWAY FROM YOUR CAPACITY TO HELP. Why not encourage all people to fight for humans, why are vegans the target audience for this shit only because they want to stop the killing of billions of innocent beings. What about all the meat eating individual who don’t give a fuck about the environment nor about human rights issues that there are in the world. This is so ignorant and silly. Just say you’re offended by people being able to care about other important shit while eating plants and go. You lot are so exhausting.", "findafinley": "Y’all are so fucking stressful, in these comments. If the shoe fits, wear it. If it doesn’t apply to you...keep scrolling. Damn. Take a chill pill.", "melaninbasecamp": "If this post does not apply to you keep moving. If it does, then maybe you have some soul searching to do...", "chaufit": "💯💯💯🎉🎉🎉🙌🙌🙌", "creestah_ahimsa": "As a BIPOC activist, veganism is a moral imperative (for those of us privileged enough to control our diets) bc our communities are directly harmed by animal agriculture. Animal agriculture is part of the white supremacist agenda and we are working to kill it at the root. BIPOC are harmed first and worst by the climate crisis caused by animal agriculture. We (BIPOC) are the most impacted community by health issues caused by the Standard American Diet, we are most likely to be impacted by PTSD, depression, etc., from working in slaughterhouses. BIPOC neighborhoods are unfairly impacted (as far as air quality) by litter from “chicken houses” aka factory farms for poultry. My grandmother’s neighborhood is toxic from ammonia from factory chicken litter; BIPOC children there are developing lung disorders, etc. “Chicken houses” do not exist in white neighborhoods because white children are protected. Milk adversely harms Black children more than white children. There’s a reason why every hood has a liquor store, a gun shop and a Popeyes. There’s a reason why indigenous land is plowed down for cattle grazing (look at the Amazon right now) without legal recourse for tribes. I get what you’re saying and I agree. Fuck white veganism, but I will spend my last breath fighting for BIPOC lives and animal liberation, because, at their root, racism and speciesism stem from the same ideology; the idea that some lives matter more than others. Sending you strong love. <3", "dina.mm.db": "wow imagine thinking people couldn’t care about two things at once", "sarah.j.wright": "OMG these defensive comments from the asshat vegans are over the top. Did they even read the post?. @ihartericka posting truth! 💙💙💙", "ijustwannaseecatpicturesdammit": "Or lions.", "nixxnoirr": "White vegans are always so quick to say \"You can care about both at once\" yet you never see them consistently speak against racism or anti-blackness. Then when you point out stuff like this, they want to mention every black vegan they can muster and say, \"yoU're erASInG bLacK veganS\" Their activism is so performative and fake.", "so.gina_": "Environmental racism......... Let's research how veganism improves the black community.", "chellykitty": "Okay but animals are more important. They're in hell every fucking day, getting tortured, getting torn away from their babies/mom/family. They are FORCED in to the life of only getting raised to be killed when they're plump and ready. Why do people have to make these dumbass posts about which cause is more important. Animals are innocent. These two things aren't even in the same category. 🙄🙄", "can.i.bee.lamer": "I always look at Ericka's comment section and just... :/", "blackfeministvegan": "For a lot of Black vegan activists (whose life's work are legit erased by this post), veganism is is our direct next step as a Black activist. The reason I went vegan was because of the book Medical Apartheid by Karen Washington. For me, my veganism is directly rooted in and connected to my journey as a queer Black activist. Some of our (Black vegan activists) whole life's work centers Black people and our trauma and our lived experiences and our healing. And what hurts about reading this is that we are hardly given the courtesy of discourse before being shut out of the discussion from other Black activists and Black people. Hours, days and years of our (Black) lives are discredited with posts like this, because I also rarely see activists like you (a Black activist who stands at/advocates for/transcends many intersections with a platform appreciated by many other Black people and activists) with larger platforms, who many of us appreciate, take the time to research or connect with us about why we do the work that we do as much as they share things like this. I do understand the shame imposed upon Black people that come from most vegan narratives, and that is why I encourage folks keep exploring different types of Black liberation narratives-- including those that are vegan, because Blackness and Black people are the reason for my season and I'm vegan for life. To me, the fight is connected. Our lived experiences as Black folk are the main motivator behind my work and my vegan journey and my activism is Black far before it is Vegan. Appreciate you taking the time to read.", "bouncedatashhhh": "So many people got offended so quickly that the whole point of the post went right over their heads...put your ego down and read slower🙄 hint hint...it would be ideal if people did both", "natalieatsplants": "I go hard for both 💚", "zelue": "I’m a black vegan and why must it be two separate fights/truths? Our communities are filled with fast food establishments and we don’t get access to fresh fruits and vegetables until gentrification occurs. We suffer from alarming rates of asthma, diabetes, hypertension,and heart disease. When incorporating a plant based diet studies show an improvement in your health outcomes. The way our neighborhoods/cities are planned (from housing to dietary establishments)isn’t a coincidence. This is all systemic racism. Eating plant based to heal our bodies is activism.", "charlie_delta_81": "I’m just not as cute as a lamb or a bunny so my/ our pain is much easier to brush aside!", "emma_arbys": "Many people center the vegan narrative as being “for the animals” but this “white veganism” is toxic and cancels out the voices of too many. But veganism can be an important tool for both our environment and oppressed communities. Veganism should be built on a platform of decolonization which centers voices of indigenous communities, peripheral countries, BIPOC, latinx, and more. The industrialized agricultural system used today is built on a platform of colonialism. It profits off of the displacement and genocide of indigenous communities and POC. The meat industry (in the US in particular) has extremely negative impacts on POC in the americas especially. Undocumented immigrants are the primary workers in slaughter houses (and all industrialized agriculture). The capitalist, vertical profit market of our agricultural system dismantles local economies in peripheral countries, forcing workers to immigrate to a country in which they are then ostracized, criminalized, and incarcerated in detention camps. While working in the US, these people are paid extremely low wages, face high rates of sexual harassment, PTSD and suicide. And where are these CFO’s and slaughter houses built? Predominantly Near black and brown communities - pushing high levels of industrial waste into their water ways and air stream. Veganism has the ability to center these voices and begin a conversation about the corruption in our global agricultural system. We need to stop centering the story that veganism is “for the animals” and build it from a set of globally diverse voices on a platform of decolonization.", "orangeskirt77": "mmmmm white people weaponizing intersectionality. the fact that oppressions intersect does not make fighting them morally equivalent! when black people say, hey white people, you are not showing up for us in the same way that you show up for animals/Notre Dame/white weed culture etc, we need to fkn listen!", "cinephile": "A-fuckin-MEN! Anything I post about the intersection of race and food has alllll these white vegans coming out the woodwork... where was all of this energy when I was posting about racism etc?????", "nottheshittyalexjones": "@miss_mary_j", "cocoahunni": "This comment thread is a mess really just shows how little people care about black people when they're arguing instead of asking how they can support black communities", "joyjoy2937": "Do you talk shit about other causes too? Like feminism and LGBTQ rights? Which causes are people allowed to support in addition to anti-racism?", "ambroise_finnick": "All the whyte vegan yoga instructors are shaking in the comments", "pythag_anna": "Would you tell somebody who has spent their entire lives advocating for lgbtq rights that they should have been protesting the criminal justice system? Or abortion laws? Or any other important issue. People CANNOT advocate for everything, and if your only response to someone trying to make a positive difference in one way is to tear down other things that they are doing then... (btw i am not an ‘all lives matter’ person and i am trying to find ways to get involved in activism against racism) If you could really tell me, a 14 year old girl, that I shouldn’t be vegan because I should be protesting about racism instead, as if those things can’t coexist, then I’m done", "_vincelorak_": "I just shared on my story and know the “both matter” dms will start piling up smh 😔 if only the save the planet/ minimal waste people would start caring too. Priorities people, priorities.", "kylemountcastle216": "This comment section is a gynormous pissing contest rattled with infighting thrown as a side dish", "annkonkolycnm": "Or for dogs, or instant pots or pumpkin spiced lattes.... 💜", "nellie_scales": "Listen", "maegan.thevegan": "I smell ignorance", "thewallflowerthatbloomed": "I’m so confused. Why are the vegans so upset? It says “as hard”... “I wish ya’ll went as hard for Black people as y’all go for veganism” ... fighting for the rights of Black people doesn’t mean you have to start eating steak chill tf out.", "withered_rose42": "Could someone explain this for me? I dont understand what is being said.", "unofficialamandashow": "Burnt my tongue with this tea! 🔥🙏🏾", "mynameisashnide": "Bruhhhhhhhhhh", "akilahayanna": "@chelseaw.art I’m wondering what you think about this thread", "mfrenchbrown": "TRUTH!", "blackwithplants": "For sure", "drmayashetreat": "🗣🗣🗣", "tsm1207": "Why do you have to put one issue against another??", "mary_jane_xo": "TRUTH. Thank you! Couldn’t agree more with this statement💯🙌🏼 (& I’m a white vegan lol😬)", "funk_m0on": "Quite honestly, I do not think we need to be upholding our culture and or destitution as a commodity. Veganism is in relation to Black People", "theeurbanrover": "Vegan Niggas go to wholefoods to buy the same 7 overpriced non seasonal fruit & vegetables available all year round harvested from prison labor that literally destroy the ecosystems needed for animal survival+ swear they care about the 🌏 animals & humanity ——->(\\_) & let me eat my burger in peace hypocrite 🤣😂", "fennecfaun": "White vegans at a BLM rally: [picture not found] White vegans ready to jump in front of a bus to protest a restaurant: 🏃🏻‍♀️🏃🏻‍♂️🏃🏻‍♀️🏃🏻‍♂️", "laiavelasco": "Criticizing veganism is amazing, we all should so that it can become a better movement. More inclusive and aware to everyone, less isolated and more connected to other incredibly important issues, like destabilizing capitalism and colonialism. White people are usually pretty ignorant regarding the latter. That being said, the steak 🥩 emoji feels nothing like criticism, more like a mockery tbh", "self.awarewolf": "BOTH 🙌🙌🙌🙌🙌", "raw_beautee": "Yup!", "robieryan": "Can I love this more than once?!?", "insayno": "\"I wish y'all went as hard for black people as y'all do for gay people\". \"I wish y'all went as hard for black people as y'all do for transgenders\" etc. You see how problematic that is? It is a fallacy. There are black gays, there are black trans people and there are black vegans. If we don't stop exploiting animals, we won't have an actual planet to live on any more. The meat and dairy industry are literally destroying the earth. White veganism is a problem just like white feminism is a problem, that doesnt mean that feminism or veganism is not important. It actually is.", "issablacksuperhero": "💯💯💯💯", "jolinejolinejolinejoliiiiine": "This post has these cult-like people all kinds of in a frenzy.", "s.t.a.y.jess": "I wish (white) people went as hard for black people as they do for their \"right\" to say the n-word (yeah, I've come across many self-proclaimed \"progressive\" whites who STILL insist they should be able to use the word)", "ser.alida": "Veganism is oppressive by definition. Unless you’re growing your kale in the backyard.", "goldenlady22": "This is all I’m saying", "epmakini": "🍵", "allsparra": "tbt to the midterm I peer edited last semester where a yt girl argued that poc need to be animal rights activists because animals (or animal rights activists -- it was unclear) are more oppressed and it's important to fight for \"non white, non male, non human lives\" cool tell me more about how you think a chicken deserves better than I do", "ron_dykstra": "🖤🥩", "bunnysweater": "☕️", "annatajik": "@chakabars what do you think of this?", "_dafni": "My fellow vegans are so aggy that I don’t associate with em.", "whatevercolewills": "😂😂😂😂💣💣💣💣💥💥💥💥💥🙌", "amandawatcheswaves": "The realness", "anncmoller": "👍👏🏻💪🙏💥", "youwillbespock": "period.", "felakutchii": "🙌🏾", "mmarella": "And as a vegan, I AGREE.", "vaidafilman": "@remidirector I’m not alone 😂", "whoreiblefem": "@___recherche", "tinita_chrisita": "fuck yes✌️", "thee_khali_b": "I said something similar in an office I worked in when the gorilla was killed years ago. \"I wish y'all cared about these black bodies in the streets as much as you do these animals!\" It got really quiet then every person of color either snapped/clapped or gave an mmmhhmmm. Nobody went on a rant again and I didnt work there much longer 🤷🏽", "jamie.weiss.71": "Or as hard for black people as they do for adopting dogs.🤷‍♀️", "biggayidiot": "People swear up and down that veganism will heal the earth, pay off my debt, and make my dad love me!", "onecheckplease": "Same.", "lucygooseynyc": "Say it again!", "carolineroh": "@ajabarber wrote such a great post explaining this, it's titled Food & Racism, read it. Also please be respectful of her voice and space, if you disagree take a step back and check yourself instead of writing useless/non-supportive comments. Listen or move on.", "johan.hedeland": "\"Vegan\" is an Old Norse abbreviated word for \"white guilt\" actually. It stems from the notion that going vegan somehow clears you from all responsibilities.", "czeed": "Vegans think by not eating meat they are smashing the system when they are literally still consuming within the system, just in a different way. They’re not changing fucking anything by getting a veggie burger instead of a beef burger at a huge fast food franchise. If you don’t want to eat animals than go for it, but don’t pretend your choice is less exploitative when undocumented immigrants and children are still picking all your fruits and veg", "_cocochips_": "This though!", "butterbeready": "Man, this is the TRUTH! 👏🏾", "lhakimhealing": "yupp. that would be nice.", "sweetheartstjohns": "💯💯💯💯💯💯💯", "tamramfalk": "How do I do that? I really want to know.", "yaicha": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "morgzelliott": "The fact that there is the option of choice, that's the real point in all this. That one has the autonomy to choose, that it won't threaten their personhood, or that their choices weren't already made for them. Stop deflecting from you (mine, our) white guilt and utilize all that passion for something more than your breakfast. Happy to chat with all the angry white vegans.", "paolagpolanco": "At the end of the day, it is not POC the ones killing the planet. We do not consume as much meat because it is expensive af. And we recycle the shit out of everything 🙄 seriously... I do not eat meat (never liked it) but vegan people need to get their stuff together (those synthetic shoes you are buying instead of leather will take hundreds of years to disappear from Earth btw, and might end up washed in our beautiful Caribbean beaches)", "sonyamtrejo": "Thank you for saying this @ihartericka For the rest of y’all, take this conversation to your friends IRL.", "angeldisguise_": "That part!", "c.d.r.e.a.m": "You are always so spot on. 🙌🏼", "callmeroam": "Oop!", "camillemfe": "White vegans ™ are the worst", "afiyavi_tosi": "Chileeeeeee", "lucie.slbr": "If only flat-earthers used their energy to advocate for Black people rights", "krystalshanice": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "mrlarryrouse": "One might conclude that some people value animal lives over black lives.", "ebonyjanice": "@ajabarber ❤️💜🙏🏾", "dollyrotted": "The issue is that white people wanna be black so bad but also hate black people at the same time", "imines__": "And I Oop-", "heyitsmekita": "🙌🏾❤️ people find a cause to hide behind to feel absolved from the root of the issues... 🤦🏾‍♀️ @ihartericka", "lilrosie25": "This!!!", "dannisapp": "Bloop!", "luminatingruminating": "💗💗💗", "ocimak": "👏🏾👏🏾👏🏾👏🏾", "chulitajuanita": "I’m just gonna say it for those in the back. Being plant based isn’t going to ever solve the problems of oppression and racism. Stop putting animals before people. Stop using veganism as a way to solve any of these things. Veganism is a privilege that a lot of people can not afford. Stop demonizing people who don’t chose that lifestyle.", "rube_ruby": "👏👏👏👏", "mrs_twopumpkins": "Bloop!", "momomagdalena": "There are lots of great black vegan activists out there focusing on food justice!! Don't let a bunch of shitty white vegans ruin veganism any more than you'd let white feminists ruin feminism. Check out @domzthompson @badassvegan and @theinvisiblevegan", "soulful.nutrition": "🗣🗣🗣🗣🗣🗣🗣", "drea_bolt_art": "And pumpkin spice lattes.", "leeannxmvrie": "Why not both? I would argue that eating animals is the first form of learned oppression. Veganism and racial equality are two sides of the same coin. It’s not a one or the other deal. The top causes of death in the black community is heart disease and cancer. 75% of African Americans are lactose intolerant. Let’s not forget that we all stand on the same Earth that is literally being destroyed due to animal agriculture. To speak out about veganism is to stand up for racial equality. If you haven’t seen it, I would recommend watching the documentary The Invisible Vegan.", "amandabritannica": "🙌🏻 absolutely.", "lizard_found_joy": "Real", "vegansophie": "💯💯💯", "bmccann1980": "@seraperincin", "ave2noondelite": "Whew!🙌🏾", "mandaaapeaches": "🙌", "justdonteventryplz": "These are the type of people that say “my people were slaves too” then add nothing else.", "new.account.who.r.u": "The word", "jobopup": "The two are not mutually exclusive", "at_halsey": "Where👏🏾is👏🏾the👏🏾lie?!👏🏾", "gracefulopenletters": "I’m a black vegan so I care for about black people and animal welfare a great deal. A lot of health issues in the black community would disappear if more people were plant based...", "anehthegoddess_": "Seriously!", "herbanhealing": "Honestly", "ruth.a.roni": "People need to stop with the \"both\" comments. Just. Stop.", "waladshami": "Damn", "vertamaloney": "i know that’s right.", "cassiefkeller": "👏🏽", "kelsey.maeve": "People before animals", "nadiagetsfit": "Sooooo truuue", "caffienexcore": "could be you know veganism is the choice to make but right now you’re grappling with making the commitment. good luck!!", "frequincys": "This one right here hits so hard ✊🏿❤️. The facts in it are piping hot ❤️", "basic.987": "yeah literally. the people who will give you a whole anthology of vegan manifestios (some of which are pretty important), have never touched an angela davis book, much less heard of her. bitches are willing to go to bali to do a vegan retreat but wont renounce the police.", "brandimazesticeon": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "apurenoir": "Can I hug you? 😭😍", "sliceopai": "👏👏👏", "mars_lopes": "PREACH!!!", "enbyonce": "A FUCKING WORD", "stephkimou": "@_asha_grant come look at dis truth oooo, exactly what we were talking about in respects to the wing girl!", "nest437": "Ooh-that’s 💯👌❤️", "melissathewildling": "Triggered!! As a vegan and someone who likes to think she's also pushing as hard for the rights of BIPOC, I've just been read, cover to cover. Need to step it up. GOING TO STEP IT UP. Keep speaking that truth & keep calling us out on our shit 😂 💖💙", "beaderbae": "The caption 😩😩", "sunnymaguire": "...Or even just dogs in general. The comments/reaction on a post when a dog dies of natural causes or has been abused, im all like, y’all don’t even seem to care about justice for HUMANS this much.", "mjgraboys": "This reminds me of 'adopt don't shop' all over again... But worse", "everywherebuthere": "❤️👏🏽", "shishi.rose\nVerified": "Verified", "sustainablebk": "Egggggzzzzzzaaaaacccccctly", "afrominimalist": "Chiiiiiilleee... 💯", "somewhere_under_the_rainbow": "I SAYYY THIS TO WHITE FOLKS CONSTANTLYYYYYYYYYYYYYYYYY", "posefx.tea": "OOP...PETA and vegans have left the chat...", "jilla_821": "👏🏾👊🏾👏🏾👊🏾", "dre_on_hair": "Say that!!!", "tiffywiffyiffy": "Exactly. Poor people around the world are vegan and not by choice. Having an option to not eat meat is a privilege; deciding not to eat then publicizing your choice as the gospel is elitist af", "fluffmanor": "If we could harness the energy of yt vegans and dog people combined!", "dani_who__": "I’m just reminded of that one post someone made on twitter where they were comparing pigs to children in ICE detention centers. She was saying the pigs were clearly in cages but these children weren’t, trying to invalidate the struggles of how these children in the detention centers feel. In other words, pigs are more oppressed than the children in these detention centers is what she was trying to say.", "hypepriestess": "Someone literally came into my DMs yesterday with a four page manifesto on why I need to be vegan. Thank you. 👏🏽👏🏽👏🏽👏🏽", "brooklynsouthernbell": "Lorddddd....", "sayyestoserenity": "Oops! 🙊🤔🙋🏾‍♀️ 💚 #wordt", "timothy_smith_": "Or dogs, & cats", "frankiefunkyfinsta": "&👁😯!!!!!!", "bre_n.v": "The truth! I'm waiting for the #notallwhitevegans.", "consciousandaligned": "Ain’t that the truth?! Maybe you’re speaking of Gabrielle the one who tried this morning. 😒", "mydogsbetterthan_yours": "Wish Peta wasn't so anti-black, especially since black people and low income communities suffer the most from environmental racism caused by meat industries. It shouldn't be an either or, the meat industry is one of the most racist industries there are you can't fight for one and not the other", "_asha_asha7": "😜", "leslie_rd_910": "@cristinag_hairstylist great page to follow", "loliluxe": "💯💯💯💯", "j_a_zarifian": "People are always more important to me. And I wanna kill some of those vegans. Ugh.", "empatts": "@Mostins @andrew.patterson24", "comeonsis_": "CCCCCHHHHHHiiilllllllleeeeeeeeeeee", "dominiquedrakeford": "BIG FUCKING FACTS!", "oibrasileira": "👏🏽👏🏽👏🏽👏🏽👏🏽", "anarchocynicalism": "I love the sentiment of this, that black folks (and POC) deserve as much/more social attention as the meat industry, deserve as much outrage at the violence they are facing. I wonder, however, if this comparison makes sense, given that veganism is a choice made as consumer within a market, and standing up for POC is rarely a choice made within a consumer market. I could critique for so long the validity and efficacy of choices within the so-called free market, and veganism in particular, but in this case i am more curious if you see similar choices to support black folks in the same context(s) in which folks choose veganism?", "gigiyogini": "Damn. So true.", "summbody": "Whew!!! 🔥🔥🔥🔥", "sofasrecords": "Love this but serious question can a person do both!? 🙏🏿✨", "shanshantel07": "👏👏👏👏👏", "valankayphotography": "Daaaaamn👏👏👏", "amalie_soderberg": "Preach", "min.t": "Sorry about white vegans - they’re terrible. You should check out Aph Ko, and Aphro-ism, they write about delcolonial theory, environmental racism and veganism.", "lynzylab\nVerified": "Verified", "6kween": "#facts", "carmenmarissa": "👏🏾👏🏾a whole word", "darcydondada": "A word! 🗣", "j_kiins": "Tell them 👏🏽👏🏽!!!", "thebrownbunch5": "And there's nothing more to say about that fact! #wheresthelie 👏👏👏", "slutofthemonth": "As hard as they do for LITERALLY ANYTHING!", "tembizzle": "👏🏾👏🏾👏🏾", "jasminedragontears": "Why not both?", "warmandsticky": "but both....", "montanocrochet": "Yaassss", "india.anyai": "tea", "the.mirror": "White veganism is killing the movement on what it actually should be.", "notyettrending": "Come tell dem", "lvernon2000\nVerified": "Verified", "jessweymouth_": "🗣🗣🗣!!!", "monie_gee": "And I oop"}