{"milah.ash": "hi ericka! i was just wondering if you have any suggestions for podcasts, books, videos, etc. by Black women that further discuss these topics. i really appreciate it!😌", "nataanii_": "BOOM YES", "evilmow": "1) your second sentence answers your first question. 2) autumn peltier, mari copeny, and xiye bastida are just three of many BIWOC doing climate activist work, and they're all young women just like thunberg. copeny has been fighting for years now to bring clean water back to flint and has met both obama and trump. 3) look up amazon watch or people of color in environmental & climate justice or the climate justice alliance. there's three of countless organizations. 4) the amazon. flint, michigan. across the us, black and hispanic people inhale 56% and 63% (respectively) of air pollution, while white people inhale 17% less air pollution despite being the main contributors to air pollution in the us . 5)", "susanayuan": "Wrote another PM. Thanks!", "heydev": "FACTS!", "displacedyke": "What’s gone drop first, this podcast episode or Rihanna’s album?", "meiliapk": "This!!! I'm constantly horrified and let down by people's complete inability to think critically. She is unqualified and if we need a public speaker to rally behind, it should be someone who is being affected by climate change themselves. This isn't going to be bourgeoisie euro white girls, it will be poc from outside the west. This has got to be a corporate/ gov scheme. Too obvious with the people backing her that do..", "_sovay_": "@melanies.view", "ydoc52": "Always gotta make it about yourselves and your own problems instead of actually listening... classic shit", "blackkoorifemme": "Posted about this and been shot down by so many different people and angles 😣", "strength__in__unity": "♥️", "therealblackhistorian": "Hey beautiful when you get the moment, follow my page... Best source of black history on Instagram ---> @therealblackhistorian", "missredfox_": "💯💯👏🏽", "maymillington": "Yes, you said you're from the BIPOC community, which is why I said \"it's not our job\" to bring people into the movement. Race isn't an issue or an argument, it's a reality, and part of effecting global change. It can't be taken out of the climate change equation, as it's BIPOC people and communities who have the biggest stake-- we're the most at risk, so to essentially say \"ignore your race, this is bigger than that, we must all come together to fight\" is a disservice. The people who benefit from that strategy are never BIPOC folx. It always ends in us being told to wait our turn until this new issue, then that new issue, is figured out. You assume that we can't critique who the media & society chooses to be the 'face' of the climate change movement while also working towards halting climate change and saving the environment. People may or may not be arguing; that doesn't mean they're stagnating. Acknowledging race isn't 'dividing'; if you think that, and only want to join the movement on the proviso that we erase that part of our identity in favour of the common good, I would ask, for the common good of whom? And I would also ask, why are BIPOC folx always expected to do that?", "sincereiam": "I feel the same. It really upset me how black celebs are sharing it and upholding her. She's so passionate about climate change and not about human lives! Just imagined how the effect this could had on how blacks are treated if she was this upset about the police killing blacks and racism in the world.", "carabrideau": "@barixiii there is a great podcast from Canada called media Indigina and in episode 180 \"is the green movement still too white\" they give a ton of examples of indigenous youth who have been fighting the same fight while getting ignored by the media.", "kmdudich": "You remember telling your dad something? He has the right to be angry, you’re a freak show of a disappointment. You do not have the right to be angry, you were raised with privilege and entitlement. Like, what you do for money will not last, you have no education or skill set, and you’re unhealthily overweight. Get your life B", "in.vino.love": "The fucking truth!!! Black girls shouldn’t be taught to suppress their anger because if they don’t they’ll be dismissed!", "mcsrhnb": "No one fucking likes Greta just like no one likes anyone else who acts insane.", "gretasusu": "In NZ news today beautifully expressed reminded me of the issue raised here re Thunberg. Thought I'd share: Praise of noble contributions by white women 'felt more like erasure' https://www.rnz.co.nz/news/on-the-inside/410345/praise-of-noble-contributions-by-white-women-felt-more-like-erasure", "j_nswenson": "Also, if white people caused racism and perpetuate it and need to dismantle it, shouldn't the same be said for climate justice?", "delaney06dvorsky": "You’re right that Greta thunberg is a brat but also what the fuck is this other bullshit", "aaronthewitchfinder": "Anybody else thinks there needs to be a violent revolution or is that just me", "han_m_l_89": "I’m so glad someone said it. Thank YOU!", "baaaglady": "@t.tompkins caption", "averysportraits": "A huge issue too is that when it comes to environmental issues, black and indigenous women have been speaking about this for decades. But we are called loud, violent, etc. black and brown folks are some of the first affected by climate change and when we speak out we aren’t allowed to be angry. Yet a white girl is the face environmental activism! White women have this way of being able to step over movements made by poc and take the lead when that isn’t the case. Especially if the movement was prior made by black or brown women. There is so much white supremacy within activist groups and this proves it.", "raskyjeffvisions": "I never fully realized this until now and it's so fucked up", "julianeishere": "word.", "biggboii202": "#facts", "thigo": "Talk that talk 👌🏾", "luztraveler": "Thank you goddess 💜✊🏾", "catsnappstudio": "👏🏼👏🏼👏🏼 Thank you for saying this!", "vphotoblogger_themindfulrunner": "Word.", "sarahbolon_": "👏⚡️", "ms_jsa": "@colourful84", "kim22300": "Follow @israhirsi ❤️", "1stmegarich": "This 🙌🏾", "glenny_wap": "Uh we aren't seen as people by white people so that's why we aren't allowed a human emotion like anger. White people domesticated and bred docile animals n we were once the animals they breed too. Black anger disgusts them like an angry dog would", "lililovesroses": "I've beeeeen feeling this. I had felt guilty, and thought \"okay, dont hate, this is a humanity win.\" But, then I thought about the black children that protest and how they are cuffed and tear gassed. Or her privilege to boycott her education for climate change, and still receive the worlds stage without being called uneducated and any other slur most blacks kids receive. Couldn't help but think.", "restorationhouse": "Mmmmmm, yes.", "mattalonzo\nVerified": "Verified", "__tani.b": "🙌🏾🙌🏾🙌🏾", "ameliawrededavis": "Yes. 💛", "rencocofeid": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "katinboots": "Indigenous, capital I.", "symbiosity": "Lol are you serious", "pham90": "@super_slater89", "samiacreative": "I also have chronic pain due to the same reason.", "sihamkurdi": "May I say that the entire world is angry. I’m muslim female in the Middle East and I have a rage pouring out my soul, yet Greta’s anger is for the good of the planet and humanity therefore I can’t compare her’s with mine that is stemming from personal and societal issues before global ones. Although she could be viewed as privileged she is not asking for anything for herself.", "rozrevo": "Everyone deserves to be listened to. I’ve shared Greta’s speech as it’s the one I’ve seen around like so many others. But I will now look for similar words from different people and share these as well! (Feel free to point me in the right direction ☺️). White people are mainly the ones to blame for the climate crisis. It is our responsibility to fix this shit more than ever. But we shouldn’t do it by taking over other people’s thoughts, opinions and angers. Like we’ve done so many times before. It really is time to stop being selfish and work to make all lives better. Not some of the lives that some people think deserve more.", "george_eastman_throwback": "🗣🙏🏾 couldn’t put this to words. Why they listen to white children, but not black people with fully developed brains?", "maya_c_ennis": "Thank you for sharing. I’ve had strong reservations about the whole thing but couldn’t put my frustration into the right words. This is it. Complete double standard. Let’s also not forget that Little Miss Flint is still begging for water for her community and hasn’t received nearly as much traction let alone an invite anywhere and has been fighting for much longer.", "tamerabak": "@erick_kohl", "yoga_with_di": "Thank you👏🏽👏🏽👏🏽", "aliieza": "I agree wholeheartedly with this. But she's doing her thing, too. I have respect for all of the people fighting for climate change and even more respect for the ones including people like me in the fight.", "lotuslly": "Yes yes and yes. Thank you for sharing your experiences and for your vulnerability.", "yourfavoritejessicap": "That part!!!", "mynameisaicha": "YES.", "jrpiv": "On repeat! 🙌🏼", "alexyvf": "#truth ✊🏽", "tripleadotddotd": "#savetheplanet #blm #nlm #environmentalism", "autieshawtie": "I hope ppl don’t take this as you discrediting her; the whole point is that bipoc, esp those that are her age, are completely disregarded for expressing similar sentiments, and she’ll get praised for things that bipoc go thru just as well and more. I’m an autistic youth, I’m affected by climate change (+ environmental! racism!), and when I was her age I was suppressed by my teachers and elders for voicing similar points as her, perceived as aggression. and I’m still on the privileged end of the spectrum of how multiply marginalized bipoc get disparaged for voicing emotional reactivity to injustice. (I’m super burnt out rn, hope this makes sense)", "empathic_realist": "🙌🏾🙌🏾🙌🏾", "graciebreath": "Oh no! Someone trying to stop climate change! Really boils my blood.", "shayayy__": "Say it louder for the people in the back !!!!!", "2fittnessjunkie": "Say it!", "irisita1987": "I’m so thankful for you @ihartericka, everyday you change my perspective and shed light on what is really the truth. I am owed nothing, but grateful for all of your knowledge and your willingness to share on what’s really what. Bipoc have been fighting these issues for hundreds of years, yet they lack the platform they so very much deserve, thank you 🙏🏼", "aftenstierne": "🙏💪🙏", "beckarrooo": "I have a question that maybe some POC could weigh in on if they have the time and energy. I have read and heard that the best way white people can use our privilege is by literally positioning ourselves between POC and oppressors, for example, speaking up or questioning someone who is acting from racism. one example was if a POC is asked for ID when using a credit card and a white person was not IDed, that white person should speak up and question this inequality because the POC is not free to demonstrate outrage in the same way as the white person, and the oppressed persons should not have to do the work to fix the system that oppresses them and benefits others. Could Greta's actions be considered similar, as in she is using her privilege as a white educated teen to speak against the oppressors on behalf of herself and also more oppressed groups of which she is an ally? I would really appreciate the perspective on this from anyone more knowledgeable -either from experience of racism or from education - than I am, or else if you could recommend a resource that I should consult. Thank you for your work, Ericka and those commenting.", "evieameliasmith": "🙌🏻", "jubilant_kreyol": "Preach sis !!! 👏🏿", "satchelbutter": ":/ idk anyone who is standing for a good cause should not be brought down.", "afro_arch": "Awwwwwwll a dissssss🙌🌻🌻🌻", "mamaberr_": "Thank you for literally everything you do, every part of me that you wake up and challenge constantly with your posts, thank you for your emotional labour 👏🏻👏🏻👏🏻 you are APPRECIATED", "valeriebodden": "👏🏼👏🏼👏🏼 step aside Greta and let’s hear from people who’s voices are always being ignored instead of amplified.", "geoffkcooper\nVerified": "Verified", "cora_thedog_": "I mean no hate and am simply trying to find my own opinion on this issue, as I am white and understand that privilege can often cloud my judgement, so I am just trying to further understand. She has acknowledged that she is lucky to be able to speak in such large platforms. She is also a great voice and activist for those with disabilities and has received a ton of backlash for openly discussing her autism. I guess I don’t see how it is her fault that her arguments are put in the spot light. Yes there is privilege involved, no doubt about it, as there are others that have done even more. So I guess my question is, is the anger you have towards Greta, or is it towards the society that got her there?", "toriuggh": "👏🏽👏🏽👏🏽", "hanlet": "🖤", "themelissadenizard": "Thank you.", "small.pretentious.vegan": "When it comes to \"developed\" countries this is true but one thing we have to also acknowledge is that WE (anyone in a developed country, regardless of race) too are privileged. The BIPOC in \"developing\" countries will be hit so much harder than the rest of us. Greta should be heard but she should not be heard louder than the BIPOC activists such as Little Miss Flint, Autumn Peltier, etc., which she unfortunately is, but those whose voices should be heard loudest should be those most affected by this, right? And that's not Greta, that's not an American of any color, that's those in or from developing countries (and they are indeed BIPOC). Those are the voices we need.", "juliejackson365": "Good thing I have the heart to care for both!❤️", "althea.bee": "Yes, this resonates", "jordana_moon": "👏👏👏👏", "caris.fox": "periodt", "witchdoctorpoet": "Thank you!! This is getting ridiculous. The whole world stops for a crying white girl.", "zohal.n": "this shit makes me sooo mad.", "playwelltogether": "🎯", "fern.galindo": "THIIIIIIISSSS!!", "blaquegoldd_": "Thank you for always being fearless enough to speak your truths. Such a lightful reminder ✊🏿", "pretinhany": "👏🏾👏🏾👏🏾👏🏾 yes. Absolutely. Speak that.", "brownskinn_gemini": "They will never! We are only given the attention when it’s something in it for them!", "idkman.music": "Just be glad people are listening to someone. Stop tearing down a 16 year old kid just because people are listening to her and not you. I find it hard to believe that people are ignoring climate activists just because the color of their skin. If they are, then they're stupid. Racism is stupid. That being said, I'm honestly disgusted at some of these replies. Y'all are just dividing people apart more and more.", "stephiefranks": "Amen, amen!! 👏", "_cocochips_": "Thank you! 👌🏾 Especially that “policing my tone” part.", "emmamcmack": "Yes.", "punchbuggiez": "Periodt", "bettinajudd": "Yes.", "eleven_19": "🙌🏾🙌🏾🙌🏾🙌🏾👏🏾👏🏾👏🏾", "ahsikor": "👏", "itsjunglebae": "True", "shainaaaaaaaa": "🔥", "_alenemarie": "🙌🙌🙌", "respectmycurvez": "Speak! 👏🏾👏🏾👏🏾", "crowned_in_my_curlz": "This the one!!", "rootofthero0t": "YESSSSS", "gforgabriel": "Yes!!! 🙌🏽💯", "shitbyshaniya": "Couldn’t be put better tbh. Do I love Greta, yes because she’s out there doing the thing. Would I prefer the POC who have been trying to do this work for damn GENERATIONS be in her place, also a very strong yes.", "emmasarah1088": "Before I say anything, I have to say I am a white woman coming into this conversation, and I’m doing my best to understand, please call me in if what I say isn’t okay. I shared what Greta said, because it’s such an important message, and I want people to hear this, but my first response was anger because people have been saying this for so long, why only now are they listening, why this girl, who clearly had more opportunities than me, and that was more than girls who weren’t born with my skin. Why does she get to sit there and be heard, when I wasn’t, when others weren’t. I know those feelings that I had are a drop in the ocean compared to yours, this is righteous anger that you have, and I am sorry for any part that I play in it.", "preenmeupscotty": "💯", "blackaquafina": "👏🏽👏🏽👏🏽👏🏽👏🏽 Thank you GO OFF we are not to be silenced.", "thewaythru": "I couldn't quite figure out why i have been so adamantly disinterested in people praising her. But read this and realized OH...because when I have displayed that much passion and stood up for what everyone knew was right, I have been villainized and discarded (or even thanked and discarded). It does feel super exhausting seeing white women be praised for the same things that we are persecuted for, even when what they are doing is right or righteous. It's like making a point in a business mtg and being told to that you're taking the wrong approach, then a man says the exact same thing ten seconds later and is told that he's brilliant. But like...every day and to the umpteenth power. Exhausting.", "iamkarensafo": "👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿👏🏿 I was feeling some type of way wasnt sure if it was jealousy or when I was 15 campaigning about child slave labour in Ghana and people weren't listening. But when other white groups chatched on ears were ready. Thank you for freeing me from this emotional confusion at her speech. Her speech was profound but very disheartening", "tossielong": "That partttttt!!!🙌🏿🙌🏿🙌🏿🙌🏿", "ksegedin": "Can I recommend everyone follow the work of @briannafruean and @pacificclimatewarriors - Pacific people are already facing climate change head on and these youth are incredible 💕", "stephaniejohnsen": "Yes 👏👏👏 I hear this!", "stevenwakabayashi": "Woke", "nurselorraineb": "ihartericka I thought the same deep-seated emotions that you thought that you felt that you heard that you saw my mouth dropped as I watched his white 16 year old girl do the things that we should all be doing for 1 and.. to remember how easily my son's 6th grade teacher assignments him when he committed himself to raising money in a business plan that included utilizing the resources of what he had available to him without having to pay for anyting his teacher told him the plan was unrealistic his friend and since then has been his source for his continuing love of ocean animals. Are household uses no plastic or paper products because of what he learn what we learn and what he taught us does it consist it obliteration of our oceans with our worlds lazy intolerance towards disposal of garbage. My black son was silence his project had to be redone Ellie fudge numbers so that look like he was spending money when in reality he would have to spend no money because he had the opportunity to utilize a space for free teacher couldn't understand how that can happen when I explained to her it happens because I sit on the board of this company she looked at me without any understanding of how I could be a board member", "amusebouching": "I concur", "clarissaidr": "they are impressed she went in a yacht and not a plane!! this is insane", "planesworkshop": "You put into words what I couldn't understand I was feeling and why. ❤️", "damaris.palmer": "Hell ya!!!! Black women are the only ones who have consistently voted in the right side of history!", "hellomynameisstory": "Its also very sad that she wouldnt even have gotten this much attention if she didnt have a famous rich mother.. Her message is still very much important, but she wouldnt be able to do this without her privilege, as both white AND rich.", "hezaire": "THAT PART", "ximena.png": "Let’s talk about how ‘third world countries’ are also impacted by environmental racism.", "dan_yeet_ella": "I love her, but true", "artsyangsty": "The reason Greta’s voice is heard: she is a child who lives in a privileged land that experiences little effects of CC compared to places like the West Indies, South America and Africa, and yet this child sees the ruin climate change caused by white and Chinese industries has wreaked on the silenced voices of poc whilst the idle European politicians have let it slide because they have the power to disregard them. This issue is primarily caused by these greedy few who abuse capitalist systems, but they can do so BECAUSE of global racism. Greta is making the “world” care because she’s spitting in the faces of her own people and shaming them despite her youth and disability. Without her Europe/US would never see, and whilst it’s not the right reason we should’ve listened we needed her. Hopefully those poc voices will be given the openness to scream even louder than Thunberg. It’s time.", "addison666": "@flower_bug_love", "wilnise": "& THATS that on that!", "thisrawsomeveganlife": "You are telling the TRUTH", "she_acts": "An ENTIRE WORD 🙌🏾✊🏾", "lexrosenbaum": "👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻", "pauline_diamond": "Thanks 👏🏾", "sejalbarai": "🎤 drop 🙌🏽", "queenebone": "Facts", "strictlyunsure": "One hundred percent agree, there are black and brown activists all over the world who are speaking the same truth, but being ignored. Anger HAS a racial bias in its reception. However, she’s still right. And Fox News is still shitting all over her. YES listen to black and brown womyn honestly over everyone else. But this is also a rare opportunity. She’s being afforded privilege because of her skin (and also maybe because of her accent?) BUT at least she’s being listened to. The plight that she represents is bigger than all of our human atrocities. Fox News is still shitting on her because she represents an enemy to their interests. She’s on all of our teams. Which is not to say that your point isn’t totally valid, which it is; I understand your anger. Just an addition.", "theytorade": "the blatant ableism this state sanctioned climate strike is riding on :// no one is ready for that tho", "rebeccajanesays\nVerified": "Verified", "dtnla1": "🤦🏽‍♀️🙌🏽", "leorisingyoga": "Absolutely correct.", "cannabiswithcupcake": "💯💯💯", "antwerpjerk": "Whhhhhoooooooo. Chile. Tell em", "thisismelissa": "ALL. OF. THIS. 👏🏾", "sydniem": "WOOOOOOOORD! Why are only white women (or girls) allowed to be angry in public?", "alibrin": "@alphabretsoup @ebrowz also this though", "fannyofdeath": "THIS!!! My first thought when i watch so many report and report and feel her... when’s the last time y’all thought about @littlemissflint ?! I do all the time. It is ridiculous how much the light of issues (especially certain ones that black people are buried under) are shifted and marketed by young white peoples. And thinking about how in 2015 my high school was raising money to build wells in other countries and in our own country children can’t just leave outside and hop in the shower!! That shit a luxury. We deserve the MAIN STAGE.", "chelleorc": "This is why on so many levels that I don't believe we'll be about to fight or stop climate change. Humans are just not going to get their ish together in time to dismantle everything to make even a dent.", "victimoffiction": "Been thinking about this A LOT. It's pretty clear who gets space/time and who doesn't.", "samgamfam": "💯💯💯💯💯", "baanu03": "So true.", "fumeete": "I mean. All of this.", "littlewookietaylor": "💯💯💯💯💯", "munroebergdorf\nVerified": "Verified", "gordibun": "I was expressing this today", "ashtagggz": "🙌🙌🙌", "amyelisehoag": "@andyteahan this badass human is a really incredible advocate and educator. She makes a lot of really powerful points that relate to our conversation the other day. I thought you might be interested in this post/comments section!", "liv.caro.s": "@gretathunberg", "mfrenchbrown": "Say it once again louder for the folks in the back...😐", "mssymi": "❤️m", "daredevilbean": "Even tho I am proud of Greta for speaking up there in front of leaders- I honestly do think that they are of course, avoiding people of colour . They don’t want black or brown people up there.. That’s hella baffling to me? There are LOADS, of black & brown girls who speak up on things like Little Miss Flint girl . :// Just why? Why can’t you listen to people who aren’t fucking white??", "elenalakay": "@ihartericka she was aloud to fully express her anger towards the world on the potential of a future that make her world unsatisfying. To the very same people who are responsible for torturing sacred land of indigenous populations! What is she mad for? The privileged economic elitist will still have options for purchasing clean air/water, nutritive food, and organic living environments that others will not! Stop. Sit down. Any indigenous young daughter could have been a better pick to speak for the world!", "kitzelashun": "🙌🏾", "queenbernaynay": "@doruloboka check dit🙌🏾✨", "lvernon2000\nVerified": "Verified", "leafamina": "🙌🏼🙌🏼🙌🏼🙌🏼", "saumajulia": "Yes!", "lizzie_amscar": "When black children get angry they get handcuffed n locked up...", "heartskobe": "THIS 💯", "regalsmiles": "💯💯💯 thank you for putting this into words because this has been bothering me.", "_aujoacid_": "This! 💯👏", "sake_fevah": "THIS!!!! 🙌🏾", "sflorart": "👏🏽👏🏽👏🏽", "smarvelous.wanderful": "Say it 🙌🏾", "sheekswinsalways\nVerified": "Verified", "kolato_reigns": "👏🏽👏🏽👏🏽👏🏽👏🏽", "l_zawacki_m": "Truth!", "sirm00re": "You better speak!!!!!! That’s right!", "fuegoblanca": "Omg I was thinking about how Little Miss Flint never got recognition for her social justice work but this little white girl did. Not bitter just not recognized ever", "sixid": "A SERMON", "feefee_3000": "Finally someone said it! When black children get upset and voice their concerns/ needs they don’t get a platform , understanding or invited to speak out at events . Stuff been going BAD with the environment for YEARS but we must drop everything and placate Karen right now 🙄", "mercii_me": "Wheeeeeeeeeeew they don’t want hear it though", "mamaontheleft": "Irsa Hirsi is a young woman who’s doing amazing things too! Her voice deserves recognition. As is Autumn Peltier!", "theclauuds": "Yuuuupppp. 👏🏽👏🏽", "coco.leen": "@some_pope", "bigblackpants": "Thank you...all the black children in Flint, had the same energy, you don't see one of them in the media", "soulwithbeauty": "This is really infuriating. It really doesn’t matter until a white person says it. We have to stop everything especially if a white woman is in pain.", "catincalifornia": "Thank you for reminding me of so many privileges I have always but especially for reminding me today that I get to walk into a space and be angry whenever I want. Thank you for sharing this generous emotional moment with us.", "lilyazehner": "☝🏽☝🏽☝🏽", "hifemmefilipinx": "I hear you, loud and clear. 🔥🔥🔥", "vetiver_lbaker": "say that! 👏🏾👏🏾", "toriincharge": "🙌🙌🙌", "tess_laurennn": "This idea also resonated when it came to the vaping “epidemic”. everyone is well and good to put a massive ban on Ecigs into place in many states when six white people die, yet no forceable response to the black and brown communities who have been so deeply hurt by gun violence over and over and over and over HEY WHITE PEOPLE-let’s fucking focus🤦🏻‍♀️", "afrikenia": "You couldn't have said it any better. I felt that @ihartericka", "nessa_bess": "👏🏾👏🏾👏🏾THAT PART", "nuncia_maria": "This is the best take on it. Yes to this.", "astoldbytsige": "Truly 👏🏾👏🏾👏🏾💙", "upshurfineart": "Well said!", "ru.ruuuuuuuuuuu": "Periodt", "bizreitsma": "“That means you are evil and that I refuse to believe” is what she said in her speech. Stopped watching there. She’s a kid and that’s cool but it’s the cornerstone of white privilege in politics to have a genuine belief that “evilness” doesn’t exist within these people.", "ya_boy_shinji": "that part. ☝🏽", "jilla_821": "I feel this deeply. Sounds like we had similar experiences growing up.", "kellygreenlight": "Keep 👏🏾 that 👏🏾 saaaaame 👏🏾 energía 👏🏾", "sophie_blackboard": "Yes, thank you!!! We see this injustice so much in Australia with our discussions around climate change and a complete lack of recognition of our Aboriginal population and their stolen sacred land. There’s no climate justice without indigenous justice!", "lori.sara": "🐸☕", "krinhoh": "Yes ma'am.", "jduhloyz": "And white people need to not be the face of climate justice when we destroyed the planet", "jstniecy": "I had this same discussion with my oldest daughter. My mother is white and overheard the conversation and became so insulted by the conversation that she left the room and wouldn’t communicate any further on the subject. There are black folks who have been doing this work for years, poc that are directly impacted by the impact of climate control who are speaking out, advocating and their voices are silenced by mainstream media because they are not white.👏🏾 Thank you for this validation ✊🏾", "carlclemonshopkins": "that part", "sandi.kronick": "🎯🎯🎯🎯🎯🎯", "thegrassprincess_": "THANK YOU", "374_id_1115": "When bipoc and poc have been protesting the use of dangerous pipelines and the killing of the planet for a long long time yet people are only starting to listen when a white girl says something. No disrespect to Greta thunburg because what she is doing is great but so many of us were speaking out too! Esp black & indigenous folks!", "empowermentensemble": "🙌", "blacknherby": "Exactly. Yup yup yuppity yup.", "iviwithani": "Lord forbid if WE get mad. 🙄", "erinelizabethcole": "@fannieridos", "theofficialareg": "Same goes for everyone loving on the Michelle Williams speech", "marjon_carlos": "Go awf 💥💥💥", "katjuschka____": "Period!!!! And thank you for making me feel less alone with opinions like this.", "summbody": "A word. I have been feeling some type of way about this whole conversation for some time.", "barixiii": "Who even is that person", "mrshaydeelopez": "👏🏽👏🏽👏🏽", "fluffyskittles": "anger must be calm cool and collected - a quiet burning rage. ew what bullshit. just had a thought, I wonder if yt folx are put off by loud anger because some have been conditioned to believe it means violence is about to happen. I know from my experience any time I was yelled at growing up, the belt was coming out. 🙃🤷‍♀️", "fvck.capitalizm": "YEP!!!", "catherinemlea": "Does somebody have Ericka’s PayPal/Venmo info on hand? I poked around and couldn’t find it. (This time I promise to save it)", "hair_by_gina": "#facts", "tylaacampbell": "I needed to hear this *snaps*", "thechrysalis": "Facts on facts on facts", "sarahlotusgarrett": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "chakra_khan85": "THISSSSSSS💯💯💯", "arzoodles": "Just yesterday I read that police came to a classroom and took a Black kid for throwing a TANTRUM.🙄🙄🙄🙄🙄🙄", "mynameisashnide": "I felt jus a lil sum type of way when I saw it too. This made it add up.", "marinaparrondo": "I see your point, but the planet is above race, in fact is above human existence", "iamrachelricketts": "I feel this in every way. There is no space where we can be safe, not even in expressing ourselves", "wesss.kaiii": "totally agree, I was thinking that the indigenous activist xiuhtezcatl martinez has been doing this work for so long. but I do think that greta acknowledges her privilege when she speaks about how those most directly affected by climate catastrophes contribute least to the crisis.", "beatrice.and.zaza": "@geronimo.lempira", "candidlyshare": "🙌🙌🙌", "womensociety.fr": "👏❤️", "oaktowneva": "YES", "lagrossetoile": "Yep yep and yep!", "reikijedikatt": "💜💜💜💜💜💜💜", "nlkaplan": "I hear you. You have every right to be angry.", "gtidiva": "👏🏾👏🏾👏🏾", "oo.em": "100000%", "markelzey": "She also didn’t look comfortable up their either.. uncomfortable to watch.. so maybe there’s more to the story from which she may be speaking out of pressure from her own parents. Apparent the mother is climate change activist, so I can see how using kid to channel anger can generate more attention.. but that’s another story, I wholeheartedly with you on this though 🙏🏽", "5beys": "This truth💯", "rajni_jacques\nVerified": "Verified", "oocas_roar": "Always🖤🧡Environmental concerns plague one demographic throughout our history more than any other (& we all know our terrible past). Nothing kills more or without discrimination when tested. I shout equally for both as I do women rights because they are all the same. I wish more white people understood this. (Not my place, but as a role model of mine, I wanted you to understand my singular white privileged booties reason)", "monie_gee": "@gypjaq !!!", "ionagrant": "As an autistic woman I am so glad that a fellow autistic is being listened to and not being silenced as much as we usually are, but I do wish that it was more recognised how much climate change is already affecting people of colour in huge ways. In particular Island nations ravaged by tropical storms we've never experienced before.", "dayoshowme": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "avocadyl": "i was just watching the video and like, good on her but ......also getting rlly fcking sick of only white narratives being told and getting attention.", "ikiefa": "👏🏾 👏🏾 👏🏾", "vitonga": "for real, ive been trying to figure out why this whole thing makes me feel uncomfortable. thanks for putting into words, Ericka~ much love to you and yours 💜💜", "anaelleseide": "that’s it.", "mentalhealthfemme": "Everywhere I can, I’m highlighting Autumn Peltier, @autumn.peltier a water protector of the Ashinabek nation, and Isra Hirsi, daughter of Ilhan Omar, who’s the cofounder of the US Youth Climate Strike, and every other black and brown indigenous youth because for literal decades and centuries we’ve been screaming about these issues (oh and don’t forget Little Miss Flint - who are still without clean water). I’ll be damned if I’m only moved to mobilize behind whiteness coopting the environmental justice fight (which is itself a racial justice issue).", "fromthesoil_tothestars": "I completely agree and am so thankful you made these statements! Share worthy!🔥", "raki.jordan": "I remember telling my mother that everybody is calling me gay because of how I express myself and talk. She told me too, \"man up.\" I was 7 years old. My blood boiled too.", "blackgirlstexting": "Ok I thought it was just me and I was like am I being insensitive but the whole thing felt doused in privilege- Sade", "julia_caston": "Thank you for this", "poison_alex_pls": "💚", "keeonnachin": "Say it again for the people in the back", "lizard_found_joy": "This is so true. We were out at brunch in a yt (dangerous) part of Washington state. My partner got annoyed (rightfully so) because they were rude to us and treated us like shit. Rather than apologizing and treating my partner with respect as a customer All the yt women called the cops on her/us. She was the only Black person in the restaurant.", "cristalsharris": "Literally how I feel but I could t out words to it. White supremacy destroyed the world...now were made to feel it’s our fault? Or screams are never heard. Yet her whispers are? Seems to me, that the earth will ALWAYS suffer until white folks see their hand in its undoing. Until they address anti-blackness, anti-indigenousness, and over all...having a supremely anti-environment and anti-people regime to gain power and resources.", "azuaintuition": "Black Auntie Clap!!!!! 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "issatrae": "& when we are rightfully upset, yelling and screaming and carrying on — that’s always associated with our race and black ass behavior RATHER THAN being expressive, passionate & wanting to yell and scream about an issue. It’s totally mind blowing that black rage is always deemed inappropriate & irrational since the dawn of time onward to September motherfucking 24th 20 fucking 19.", "madebymeu": "This.", "therealcourtking": "AMEN!", "korc.can": "Let go 🙏 i couldnt care less about a privileged teenager from Sweden", "sierrawgarcia": "All of this. 👏🏽 Also, It struck me that your father was able to apologize. That must have been wildly therapeutic.", "mamacax\nVerified": "Verified", "masheka_sheki": "🎯🖤", "vertamaloney": "yes. yes. and yes.", "the.susannah.slocum": "🙌🏼 THIS 🙌🏼", "asa_hndrx": "THIS. THIS. THIS.", "dannactorres": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "new.account.who.r.u": "THANK FUCKING YOU", "aprebb": "Yes yes yes!!! I 100% recognize this & agree. Black & Indigenous folx have been fighting this for YEARS. Where is their recognition?!", "urlocalnymphet": "@gretathunberg", "butterbeready": "Listen, these very words!! 🙌🏾🖤💫", "__lanaaam__": "Especially poor black and brown people, let us never forget class either. I hear you 💕", "anouskaisonline": "All👏🏽of👏🏽this👏🏽", "kikicarlstrom": "I couldn’t agree more. I’m in school to be a counselor and I remember last year a professor played an NPR YouTube video of a man using music to describe an encounter with the police. A student in my class said “it’s just so great to see a black person be so articulate and calm while expressing his anger.” I went up to my professor after class and said FUCK THAT. The fact that to share our rightful anger with most white folks it needs to be palatable for them to hear, is beyond upsetting; it’s a phenomenon they truly do not understand."}