{"aquariuntay": "hi ericka😻 i love you and eb so much. i check itunes everyday just to see if y’all uploaded a new episode of your podcast. anyway, i’m currently a university student majoring in gender and women’s studies!", "batyulefly": "Baguette X is such a good name I'm in awe", "imanispears_med": "Hello Erika. You are so inspiring. You help me to understand my students and I protect them viciously. I am still learning how to use pronouns because of how we’ve been taught language, but you have helped to equip me with the knowledge base to understand and to help other educators to understand as well. Everyone won’t understand and some don’t even want to🙄...I’m ok with that now...but my students know that they are loved and protected when they are with me. So I’ll keep following you and learning so that I am equipped with what I need to advocate for and protect my students. Oan: My paid gig is a Diverse Learner Teacher (aka Special Education)", "datarra_malani": "First, this pic is soooo🔥🔥🔥. I am Datarra Malani(mostly go by malani for entertainment purposes), my paid gig um lol, I am currently a stock manager at All Saints on 5th avenue, stock help at Aldo, event coordinator/promoter/hosts for the lgbtqn community...Model(runway & shoots), some paid gigs some just to help out friends and seamstress mother.... Been following u for a while and love your words and motivation, but hey, nice to meet you. ✊🏾🤞🏾", "mariem.iman": "Hiiiiiiiiiiiii!!! 💖✨ Its so inspiring to have you in my instagram!!! Thank so mucchhhhh for how you are!!!! 💕💕💕💕💕💕💕💕💕 And I wish i Had a paid gig 😆 I wish some Day to be an artist, meanwhile studying!! 😊🌈✏️🎨", "lillymaaay": "@mayberobin", "lamiafahim": "You’re fantastic! And hi Ericka! I’m Lamia from Pakistan and my paid gig is as a choreographer and a dance instructor! I left my corporate job to follow my dreams! It’s quite taboo in my country but gotta do what I love or die trying! Nice to meet you 🙌🏽🙏🏽☺️💞", "esther_theesthetician": "Yours still have shape!!! Unlike mine!", "lady_of_the_world_": "beautiful ✨❤️😍", "teggggs": "@graceosullivan_", "alayshahaha": "I’m 24 and I’ve had SOOO MANY Jobs too!! Lol can’t help it I wanna live it all!", "theereallucyj": "💗💗💗", "leonrach": "Hi Ericka (and Ebony)! I’m Rachel, she/her pronouns, and I’ve been following your page for a few months now. I appreciate all that you do to help educate us, help us unlearn things that society/families have thrusted upon us, and show us how we can do more to support. I’m a self-contained special education teacher for 7th grade.", "thelaurenstevens": "Gorgeous 😍", "jbord_oni": "Hi Ericka and fam!!! I’m Josie I teach the most amazing human beings in the Bronx (HS public school❤️) I too survived a rare form of Cancer!! You are amazing!!!", "hakkillo": "Wow an RPCV and cutco on here 😭😭😭 I relate a lil too hard. Hi I’m Olka, she/her pronouns, communications manager for a clean energy campaign but aspiring to be a full time yoga teacher/ poet/ story teller/ wordsmith / earthship builder / liberated human who liberates others. Thanks for all the space making, mind freeing, powerFULL work you do !", "canteverstop": "I’m learning so much from you. My daughter and I just watched your breast exam feat Whitney Houston vid and loved it. A really sweet way to introduce her to and (remind myself to) self exam (she’s almost 4 so she’s way off needing it 😉). Anyhoo, thanks for everything. Love, Ces.", "ashleyvix": "Love love love this caption!!! 🖤", "deezybird": "@phoelix_firestorm get around this account xx", "flygirl36": "Awesome 👏🏽 just heard you on the radio and had to look you up! God Bless You!!", "doulaslife": "@blackgirlinbudapest @andreabreitlingart @whatdevondiscovered Someone to feel inspired by ♥️", "nikkileighmckean": "💗💗💗", "herei_tis": "You're beautiful 😍", "s.e.v.i.g.n.y": "@psevig19", "ladycomplexity": "Court (she/her) and I'm an Autism Specialist...I help diagnose and provide therapy recommendations to increase independence and engagement in the child's community.", "sarahjayn": "Hi, Erika. Thank you for sharing some of your past jobs. My name is SarahJayn, and I use she/her pronouns. I’ve had a lot of jobs, too! My main job now is being an instructional teacher leader at an elementary school in Oakland.", "tourniquet_v": "Just found your account through nowhitesaviors! I like the idea of working at Lululemon for 2 days to get a discount 🤣 I get paid for being a PhD student and teaching Italian and French at my university. I also write articles for a fashion plus size feminist magazine, and I tutor formerly incarcerated women to get their GED (these aren't paid but I truly enjoy doing both). Congrats on being cancer free! 💕", "my.little.creature": "Hi! Alana here, commercial fisherman and contract residential construction hand!", "emilyoandasan": "@ihartericka my roommate in 10th grade Adome is from Addis Ababa. Someday I hope to travel to Ethiopia. Also all the jobs you listed is why you are so wise about human behavior. Aloha from HI. 🌈🤙", "pjs_playhouse": "Hello!! We are new to your page (my son, PJ, almost 2 and Mommy @crystalkouri_hairmakeup) Paid gigs: former celebrity makeup artist now retired to be mom of special needs child and volunteer in schools that read Wonder to bring awareness to differences and encourage acceptance and kindness! We are so happy to have found your page, as we participate in relay for life each year and love it! 💕💕💕💕💕", "andreinakjaer": "Hi! My name is Andreina but I prefer Dre or Ina. I've had a lot of paid gigs but I am currently not working. I've been studying UX Design and web development. Last gig I had was a mascot lol. I've been following you for a couple of months and so far and didn't know a couple of the things you shared. Thank you for sharing. I send you love and good vibes 🙌🏽💕", "_run_fatgirl_run_": "I got got by the knives, too. My husband got an email, and I was lunging across the room like, DELETE THAT SHIT.", "bellalovechameleonstar": "Beautiful ❤️", "ajbuck94": "Amy, she/her, English & Social Science Teacher :3", "simona_says": "I'm a pelvic floor physical therapist who also treats gender specific issues (breast cancer and prostate cancer for example.) I'm also trans competent and have taken courses to be competent in rehabbing gender affirming surgeries. The hospital has my title as women's and men's health physical therapist and I want to change it so it encompasses the unique issues of all gender and non binary folks. I would love your input. Is gender specific physical therapist weird? I first came here to work on being anti racist. I'm still here for that. But now I just stalk you because I'm in love with you and Ebs relationship. 😂 I think you need a reality TV show lol.", "runny_babbitt": "Ultimate thude", "afrikhana1996": "@sheila_nangue", "saila.anitta": "Hey! Long-time fan of yours, I’m a teacher and here to educate myself. I’ve said this a few times, but I really appreciate you taking the time to do so, because I know you said it is frustrating and exhausting sometimes. But I also learned to educate myself proactively from you and stay to hear your valuable insight and expertise ❤️ I was always curious: do you speak any other language than English?", "tillieandhenrymomma": "I love this into! Congrats on over 200k followers! I started following you a while ago and it's fun to see your community grow. I get paid for accounting consulting, teach accounting at the local community college, and teaching Barre classes. I also take on a million other side jobs and volunteer work because I just want to do all the things!", "kirstywhitenstudio": "You are beauty of purpose and beauty in my eye ❤️ thank you", "creolesecret": "I’m Kim and my 9-5 is clinical Microbiologist (until I make my “jump”) and my brand is @creolesecret creating therapeutic essential oil products for holistic wellness!", "can.i.bee.lamer": "Been following for awhile now and I did a bit of a tribute practice speech on you for my college speech class! My professor said choose someone you admire who contributes a lot to society (who wasn't Oprah, lots of people have chosen her in the past for the speech apparently lol) and I couldn't think of anyone but you!", "rylopes": "❤️✨✨", "the_syzygy": "Y y", "colinrmmm": "Are you from NYC?", "sezzell": "Hi, I’m Stephanie (she/her)! I’m a 33 year old bisexual here in the Bible Belt, which is less than amazing, hah. I don’t have a paid gig, but I have two little girls and an autoimmune disease, which is so fun... I also just started back in college this semester- trying to get that bachelors degree finally!", "thatendogoddess": "💕", "lulu_prupru": "They look amazing...!💓💓💓🦋", "ohmeohmymel": "Hello Erika! I’m Melissa, she/her pronouns. I broker natural and organic foods. You have taught me so much - some of it has come easy and some of it feels uncomfortable. When I get the uncomfortable feelings I know I need to go deeper in my bias. Thank you.", "5tephaniiee": "Hi im Steph (she/her pronouns) recent RPCV Ecuador, no idea what my next gig will be. Lol", "survivormoda.rachel": "Love this picture of you!❤️ hugs to Eb! 😘", "b.p.and.j": "Hi! I'm an able-bodied woman and I work with people with disabilities, mostly within the Deaf and Hard-of-Hearing community, as a sign language interpreter and job developer. I'm a mother of 2 young boys and want to raise the best humans I possibly can. I initially starting following you because I realized how incredibly white my IG was, despite me being a POC. I have also been unpacking some shit in my motherhood journey and unlearning some serious colonizing ways. Parenthood is helping me realize how much BS I have internalized and I don't want that passed on to my children.", "unwritten.me": "Stunning image 💙💙", "sexualitypower": "🔥", "erinkwashere": "Stunning photo! I'm Erin (she/her) 👋 Mom of two and a Casualty Claims Manager (auto injury) by day. Fellow cancer survivor. I enjoy your IG. Thank you. 😄", "sistasdotravel": "Shout out to @ihartericka Ebony and Baguette X (my hair color inspiration). You give me LIFE on a daily basis. I am the primary caretaker of my @wisesupersenior and I spit truths MWF to university students under the rainbow in the middle of the pacific. Thank you for all you do 👏🏾👏🏾", "carriehoffmanjewelry": "Hey Ericka! I am Carrie (she/her) and I am 2 years breast cancer free. Jewelry Designer and Single mom in LA. Thanks for all you share!", "charmaine_marie": "I appreciate you and all your heart work! Thanks to you and Eb for using your voices to inspire us to be better!", "lisahawks": "#Crush", "lice_ka": "@misandryforever server au pain quot!! C'est la famille 😭💞😭💞", "prinzessin_davidella": "Silly question, but how is the environment behind the scenes at LPQ? Something about it always feels too good to be true, but I don’t want to feel this way…", "morgan_hitz": "this is breathtaking", "showponiee": "Hi @ihartericka I'm Jenna. My current paid gig is remote marketing guru. I get to travel full time thanks to my marketing clients. I currently travel and live in my converted campervan with my best friend, and our two dogs. My sweet lil angel pitbull is also named Erika. ❤️🔥", "ariannemayer": "French and Spanish teacher middle school :)", "totallypuppywhipped": "Hi, I'm Nikki (she/her). I've got an adult son and two tiny dogs who totally rule my life. I live in a small town in Alaska, and I'm a waitress. I so much appreciate your account, because I've spent half my life in a small town at the end of the road, and it's a weird, cloistered place to be.", "peatofmyowndrum": "👋 I'm Peat (they/them)! My paid gig on and off for the last 10 years has been as a Nature and Survival Skills Educator!", "aprilonthefly": "This pic. ❤️❤️❤️", "_jackmariustacktheratrix_": "Hello! Thank you for all your work, you and Ebony are amazing people. I work as the director if communications for an Eco-Shop/ ecogoods manufacturer. 💜", "bestvibes113": "❤️❤️❤️❤️❤️", "helpmetohelpmyself": "Hi Erika, Eb an little Bagette! I’m Nicole She/Her. I’m Bi but only realised in my 30’s. I’m originally from the UK but now am an immigrant in Japan. My hubby and I have two children and although I have a degree in Human Genetics, I have no job at the moment so I am a SAHM.", "cassievalentephoto": "I also got got - I sold cable television packages door to door for a week right after college 🤦🏻‍♀️", "iam.stevierose": "Hi I'm Stevie (she/her) I met you at a lecture you did at u of a in Tucson earlier this year and I love your podcast. My day job is a medical assistant which basically means I'm a low paid nurse. But I'm also a singer/songwriter, poet, and aspiring creative director.", "wormworks": "Katelin- HS ELA teacher. This photo is incredible, and so are you.", "azuaintuition": "I love this. You are a natural master of this social media beast While living your best life!! Go ahead!!!!💕💕💕", "vixonj": "🙌🏾🙌🏾🙌🏾", "bad_mermaid_bakery": "Love all the fun facts. It’s been great following you and learning from you so far, thank you.", "sacredhandsss": "Hey Ericka (p.s. I love how it's spelt), I'm Lyandrea (she/her) and my lover @alexadruiz (she/her) introduced me to your ig. My job is receptionist soon to be stylist at @alchemyorlando but my career is studio artist. The direction of my art is advocating awareness on our earth and hate. Alexa points me in the direction to research individuals like yourself. Which is a blessing because I had no idea what's really going on in this world besides what is shown and not deeply researched. Thank you for you 💙", "artsortment": "This photo is gorgeous and you are gorgeous in it! 🔥🔥🔥", "claire.c.z": "Jack of all trades!", "heyyyyyygirlhey": "Hi @ihartericka 😍 I'm Renée (she/her) and I work at a nonprofit CDFI, providing small business loans to underserved communites in Colorado. So grateful for your work and deeply appreciative of the knowledge you share (and the fire selfies)!", "tender.qwoc": "Hi! I’m Nathalie and Im a student assistant at a non profit organization that helps students of color succeed in school", "curvaliscious_goddess": "Hi, I am 9 yrs cancer free! I chose a double mastectomy so I wouldn't have to worry about the other breast plus I wanted them to look the same, lol. I had a tram Flap procedure that basically removed the fat (and some muscle) from my stomach and placed it in my breast area. I like to tell ppl that they aren't looking at my boobs, they are looking at my stomach, lol. That gets a Lil laugh. I am a newly retired international English Teacher. I am back home with my family and am looking into entrepreneurship. I appreciate you!", "painkillercam": "Stunnnnnnnnnning!!", "cos_mic_life": "Hi Erika! We're Naike & Alejandra. We're building an app for us QTIPOC that connects users based on astrological synergies found in our natal charts. Thank you for all that you do and are ❤️✊🏽", "avachristinem": "Hi I’m Ava (she/her), thank you for all you do! Paid gig is a therapist (2/3 of my way through my MFT hours) and case manager for folx in affordable housing/SROs in San Francisco.", "teapeeee": "Hi I’m Tiffany, I’m a full time student at Columbia studying human rights. My research is on intergenerational violence against women, specifically women from immigrant families. I’m Portuguese/Spanish American. I’m also a survivor of childhood sexual trauma and have a very negative interpretation of my sexuality. I learn something new from all your posts and feel very thankful for it 💕", "caitlinena": "I love seeing people's job lists. Hi! I have been following you for a little while. I'm a bi she/her. I live in Alaska and my paid gigs are: naturalist guide and bus driver in Denali, birding festival coordinator, and beer slinger. I work seasonal jobs so I know that cruise ship feeling and piece it together. It has taken time make it work but I love the perceived flexibility and creativeness it puts into my life.", "islandcurlsncurves": "I forgot to mention that I’m a legal assistant. 😆", "cnbuzzbee": "hiya, I’m Christine. I’m a content strategist in Chicago. Former baker. Breast cancer survivor..almost 2 years! As for pyramid schemes, anyone remember NuSkin? smh Thank you thank you thank you for sharing the work you do. 😻", "lavenderbluesmusic": "Hi! 👋🏾 I’m Alex and I sing to babies! My own boss since 2012 and still going strong! Just released a Baby hip-Hop album 🥳", "bunnysobol": "Hi! I’m a breast cancer survivor, HER2, double mastectomy. I’m the director of a non-profit in upstate NY. We do work in the recovery community, sober living housing, food pantries, outreach programs.", "moneybagfiji": "LOVE IT 🔥🔥🔥🤩🌻🌻🌻", "kane.alana": "Hey I’m Alana I have been following you for a while now and I think you are awesome! You have posted many posts that have made me critically think about my words and actions, and cultivate further consciousness. thank you for that! My paid gig is as Timebank coordinator! We share skills and the currency is time not money! (Getting out of that capitalist systeeeem) maybe there is one near you 🌞💞 love Alana xx", "cakoir": "Hope all is well with you, Ebony and Baguette! I go by Chai and my pronouns are they or he. My paid work is making coffee and occasionally making art! Hopefully more of the art part soon 🖍", "yankeesjenn": "I'm Jenn (she/her) and I'm a social worker at a hospital! You are stunning and so wise! Thanks for your work!", "mrdresskode": "❤️❤️❤️", "tajalindley": "Activity specialist on a cruise?!", "seesaalt": "I’m Raq (or Hazell) depending on who introduces me). i get paid to edit, design and publish experimental books on art / art theory / cultural criticism at a non profit gallery.", "crybiel_": "💓💓", "ms_beauty_undefined": "Hi Ericka! My name is Jennifer. My pronouns are she and her. I just found your page in my explore page a few days ago and immediately followed. My paid job is as an anti-racist organizer and facilitator in Michigan at a non profit. I am on this journey of being Anti-Racist, Black woman and advocate and just learning more everyday while in this work. Thank you for sharing your story. Very nice to meet you 💖", "sarahdauer": "Is the X in Baguette’s name like the letter or the numeral for 10?", "_aobc_": "@ihartericka I love this. There was a post trending not long ago listing all these “famous” people getting famous late in the game. I was like that’s cool and slightly inspirational knowing “famous” people once had to rough it serving omelettes at a Denny’s on the weekend or whatever but where is the social work anti racist equivalent for a 37 year old in grad school trying to support a family with 80,000 in student loans and knowing her career really won’t ever get them $ and being actually fine with that...And 💥 here it is! ❤️ Also your family is so precious and as always thank you for sharing so much of yourself here. It really means a lot to so many", "renaorofino": "Hi Ericka, First, loved the photo😍 Then... I am a lecturer in a Federal university in Brazil. I do research on science education and I’m working with topics related to social justice. I think you’re inspiring and I love learning from you. Thanks!", "caitlinrdiel": "Hi! I'm Caitlin and I teach Spanish at an elementary school ☺️ love the photo!", "deepsearch": "Hi, I'm Emily (she/her) I live in Canada, I have 3 cats & 1 kid & I'm a house painter. I'm grateful for the knowledge you share & I've learned so much from you so thank you very very much.", "__reconstructed": "Haha I almost got sucked into that knife pyramid scheme too!! Fuckin cutco", "gonzocrase": "Im Anna (she/her pronouns) and I am a server at a breakfast/lunch spot owned by a local couple. My non paying job is being mom to a 4 year old and 7 year old❤️", "huggable.lecter": "Hello, I’m Kelsey (she/her) and I have loved following and learning from you! I work at a pet food store and love talking to people about the joys of pet parenthood!!", "glitterboxno": "Hi Ericka! We’re a shop in Nola that showcases womxn and non-binary artists, hosts workshops and supports social justice nonprofits! We strive to be inclusive and supportive always. We love your feed, thanks for taking the time to share with us!", "blueberriesforsale": "I’m a non-binary singer who teaches music lessons and tries to make the classical world a queerer place! Thanks for all that you do, I learn something new every day!!", "ruthbeckermanrodau": "62 year old white Jewish woman from MA. Spent my career in leadership roles at non-profits and retired 4 months ago from job as CEO of agency that supported seniors and younger individuals with disabilities who needed support to remain living in their home. About 5 years ago, my daughter referred to my “white privilege” and I was confused and a bit taken aback. That same daughter (Molly BR from CORO - who met you last week) turned me on to you and today, it is hard to believe how clueless and distorted my perception was and how much I am still learning every day. Thank you for your wisdom, your energy, your expertise and for YOU.", "needleminding": "Hi! Thank you for the work you do! I love that you said hi to your foes & trolls, too. 😆💕 I don't get paid for much -- I've been disabled for about 13 years -- but sometimes writing, art, organizing offices and houses, cleaning. Before that I had some fun jobs, like being a \"wench\" at a Renaissance festival. Seriously.", "orangeskirt77": "hi!! huge fan of yer crucial work! i'm rachel, my paid gig is as a lawyer (criminal defense, immigration defense, civil rights). i was diagnosed with breast cancer 5 years ago, double mastectomy + chemo etc, and don't have words for my gratitude about yer framing around breast cancer. *thank you* to you and yer partner for sharing yer brilliance and ❤️ with all of us!!!", "sirigunnarson": "hi ericka, thanks for your post and your work here, i am a new follower and grateful for your voice and sharing. i am a cis-gendered white woman, she pronouns. i do more unpaid work than paid, make my money as a council trainer, wilderness guide and permaculturist when i can.", "bloomingdream": "Thank you for all the great work you and Ebony do! I’ve learned so much from you both! Am Suzinn (she/her/them), trying hard to be a conscious, compassionate human being on this precious planet. I’m an artist and design organic landscapes. I’m a founder of a CBD oil company too.", "rileyarizona": "Omg you did this shoot on a lunch break !? Amazing!!! Hey I’m Riley 👋🏼 she/her pronouns. Currently paid as a legal assistant but I am about to complete my life coaching certification and get paid for that 👏🏼✨", "the_real_kyser_soze": "Hey Ericka. I hope all is well. I have left a link to my store in your DM. Hope you take the time to check it out 🙏🏾", "benybooom": "👋🏽👋🏽👋🏽👋🏽", "queeniet_": "Hi Ericka! I just found you on the recommendation of a coach @reneemagnusson . I am beyond grateful for you and what I've seen of how you SHOW UP in the world! My pronouns are she/her and my paid gig is a mild-mannered insurance adjuster for the capitalist industrial complex by day (for now). I am a yoga teacher, budding writer and healer the rest of the time.", "fayfaybleugh": "woooow! stunning! recently started following and your content is the best 🙌🏽", "edriona18": "I'm Nye. They/Them pronouns. Fulltime psychology student but graduating this semester #graduate2019 And wants to be a sex/kink educator and tie that into educating communities about mental health as well. 😍🔥 but dont really know how to start.", "yaknowme_hitomi": "♥️", "kelekells": "I didn't know Baguette was Baguette X 💙", "eachtraiochta": "Hi! Thank you for teaching us all so much and sharing your lives. As a trying-to-be-better white girl I find your posts so constructive. I'm a civil engineer working in public transportation, buses and bikeways, mostly. Love! 😍🔥", "stephanie_may": "Love this photo SO much!! 😍😍😍 I’m Stephanie - mama to 3 kiddos and 1 tiny doggie, wife to 1 cutie drummer, and my paid gig is I’m the social media coordinator for @Whole30 🤗🙌", "gogogabriela": "Amazing presence and energy being captured here 💗 get it!!!", "beauti_ful_girl": "Hello, I am Sh’reen from the Virgin Islands and I am a flight attendant.", "black.girl.mag": "Love everything about this🙌🏽🙌🏽🙌🏽", "queenankh": "Hi, I'm Suzi ☺️ (she/her pronouns) and I am a bi woman with a male partner. I've followed you for a while now. I'm trying to be more positive about my body and allowing myself to take up space in the world. I'm currently working in a wholesalers but would really love to be able to make things for a living. I love knitting, jewellery making and creative writing but can't afford to make it my job 😭 keep being you!! X❤️X", "hannah.gundi": "Hi Ericka and Ebony!! Been following for awhile and so grateful for the work. Currently a full time music theatre student but working part time as a Jewish music educator in my community- at pre schools, senior centers, and everything in between.", "myfriendingrid": "Hi! She/her. Love and appreciate you so so much. Fellow cancer survivor- twice, first time at 30, second at 47 w/a bilateral mastectomy on 4/21/17 (came to from a 6 hour surgery to find out Prince had left this earth ☹️). Today, cancer free😎. And currently my paid gig is a florist, so I am really loving this photo. 🌸🌺", "holland.jessica": "Thank you for all the education you are providing 🙏you teach me everyday 💓", "daddypuss.rex": "Hiiiiii! I'm Daddypuss, I'm a non-binary trans-masculine humxn - currently living in Berlin. My higher calling is absolutely to bring the healing gift of yoga (both the Indian and Africa lineages to the under-served and the under-represented people who are excluded and ignored by the yoga Beckys of the world...just outchea tryna decolonize a practice and maybe touch a few hearts & minds in the process. 💖 @ihartericka your content gives me life...thank you 💖", "bitchyy_mcflyy": "Been following you for a min! My name is Danie (they/them). I am a full spectrum doula, childbirth educator, sex educator, writer, and soon will be pursuing midwifery 💜", "watnow76": "Beautiful photo", "justdom1": "Did you love working on a cruise ship?", "rhiannonnewman": "Hello! I’m Rhiannon (she/her) and am a photo editor at a think tank that researches solutions for social and economic issues. And fun fact: you’re were instrumental in me switching things up and getting this job! Please give Baguette allllllll my love.", "oyanoire": "I feel so seen now that i know you’ve sold knives 😩", "softsouthernbutch": "How did you get into teaching sex Ed full time?", "kisha_codes": "My wife always laughs when I reveal more jobs too lol. I've had 30+", "gaiaw.xyz": "Hi! My name is Gaia (they/them) I work at an independent comic shop and publisher. I also T.A. a comics literature course this semester. I'm getting a head degree (MFA) in comics!", "another.baroque.millennial": "Hiiii full time art/production designer & moonlight as a poly play party coordinator/ hostess", "itsalexishaines\nVerified": "Verified", "jlabriola": "nice to meet you, Ericka. I’m a white, mid-40’s bi woman who is married to a CIS gendered white dude and mother to a cutie patootie 5-year old blonde that I’m praying I teach enough about privilege and empathy. My paid gig is in marketing and development for the symphony here in Edmonton. In my free time, I am on a women’s advocacy committee set up by the city, run a small non profit that raises funds and awareness for marginalized communities through arts events, and try like hell to be a good mom/partner/friend/citizen. My brother died when my son was 3 months old so my post partum was a hot mess. Between that, being mid 40’s, and my 8 year old Newfoundland dog, I don’t sleep much and feel like I’ve gotten to know you and Ebs through many middle of the nights on Insta. ♥️♥️♥️", "mskelseyglenn": "Hello! Ive been a follower for a little over a year now. I work full time as a waitress and part time as part of a harm reduction team at music festivals", "holisticalkalinevegan_phyllis": "Just love you ❤️🙌🙏", "robin.horton": "Hi Ericka! I’m Robin (she/her). No paid gig at the moment, as I’m caring for my husband who is battling lymphoma, and trying to also raise our 3 young kids. Prior to, I was a radiologic technologist. The Emergency Room was my favorite place to be!", "gladysbvargas": "Hi Ericka!! My name is Gladys (she/her) and I’ve been following you and ebony ever since @moshoodat posted photos from this shoot!! It’s been awesome learning from you :) My paid gig is working with students on having more sustainable habits !", "jojarks": "Hello! My name is Jojo, she/her/hers. I’m currently in the process of getting my certification as a Certified Nursing Assistant! Someday I want to be a school nurse :)", "realmikkipedia": "😍💓", "yagirlnoname": "I don’t want to sound rude or anything, I’m just curious, what happened to her breast?", "catlady69.art": "Foes and TROLLS 🤣🤣🤣🔥❤️", "aarynnlang": "Still my fave picture of you!", "pridelinksc": "Hey Ericka, thanks for the re-intro! I love the jobs list and I have some pretty random jobs myself, lol. I’m Ethan, Lead Community Builder of Pride Link, a non-profit serving LGBTQ+ folx in Upstate, SC. I’m a white, trans, queer social worker who grew up and has lived my whole life in Upstate, SC...and so enjoyed your presentation and dialogue a few months back at Furman University.", "whomstshotjr": "Hi! I have been a follower since your speech at women’s march in philly. I will never forget about how you were one of the few who acknowledged the misgendering of folx at the march. I don’t have a paid gig rn because of mental health reasons but i really appreciate the work you do!", "phoenixvibes_": "Beautiful 😍💕", "mx.millennial": "I love that you shared that you got got in a pyramid scheme!  I got got with a fucking timeshare 🤦🏼‍♂️ scams are not about intelligence of the person being scammed. A quality con can scam anyone and I wish more people would speak up about it to help future folks avoid those same mistakes.  Also I am a barista by day rn, but currently I am in the interview process to be the Artistic Director for an improv theater. Cross your fingers! 🤞", "lololo_and_lalala": "Hi Ericka! I’m Lauren, she/her, I love your content and your fearlessness. Following you and other wonderful black educators is a delicious daily piece of the puzzle of dismantling my own internalized biases, collecting receipts for helping to educate others on racial and social justice, and overall growing as a human being. The work you do is so valuable, I truly believe you are making the world a better place. Full time student currently (CS), full time veterinary technician, part time data science intern (a bish is busy 😭).", "vinylandthings": "@madatangel👑💕✨", "katyyanda": "💗💗💗", "nessa_bess": "Thank you for acknowledging that you too got *got* in a pyramid scheme-I feel seen and heard now 😩😆🤣🙌🏾", "carolinedijkemette": "Hi, thank you for everything you do! Question: why the misgendering specifically this month?", "landofinkandgraphite": "Hi! I'm Eli, nonbinary (they/any) bi Armenian artist. I've followed you for a while and I'm constantly learning and growing as a direct result of your + Ebony's words and labor. My paid gig is...nothing at the moment. Waiting for some calls back. Will start selling art soon, hopefully!", "mandaaapeaches": "Hi! I am an administrative clerk in local government in Canada. Your page consistently helps me question what I've learned in my upbringing as a straight, cis, white, abled woman. It helps me sit with my discomfort and learn from why some of your posts make me uncomfortable. The emotional labour you put into this account is so appreciated - I hope to contribute to you financially when I am more stable in my finances in the future. Thank you for what you do, there is so much unpacking I need to do as a white person and you help me scratch the surface.", "fierce_passions": "Hey Ericka! Not new. I first read about you in an article featuring that iconic photo, then had the privilege to hear you speak at Sex Down South. I’m M’kali-Hashiki. Working for others: I teach med students how to do patient-centered pelvic & breast exams using my own body as the “demo model”. Working for myself: I have a private practice helping folx (primarily QTPOC) heal their erotic wounds so they can have the erotic & sexual life that is their Divine Birthright.", "aaholmes07": "You make my heart so happy, educated and stronger every time I see a post! My name is Ashley (she/her). My paid gig is a mental health clinician with children in VT. I am also involved in a Grief and Loss Program (only two established grief programs inThe state 🙁), but my passion is LGBTQ+ youth and wilderness. Thank you for allowing the opportunity for this communication and community 💚💚", "stitchenbitch": "I am Tina (she/her). Pan. Cancer ninja. Coming up on 1 year since my mastectomy, having a really rough time ATM. I work(ed) in ag/environmental applied research and education, not sure what I am doing when I go back to work", "thisismillie": "Hi! My name is Millie and I’m a sex educator at a locally owned sexual wellness boutique. ☺️", "this_chickcarla89": "GORGEOUS ♥️😍🙌🙏👏😘🦖", "madeleineroger": "Heya Ericka, (she/her pronouns) I’m a singer-songwriter, producer, and songwriting instructor from Canada! I’ve so grateful for all I’ve learned from you! 🌷⚡️", "aimie_jaouen": "So stunning ✨", "loosey_flawlezz": "Hey Ericka, you are incredible. Your mind and intelligence is so honest and real. I’m a queer social worker living in the most progressive city in Kentucky. Louisville is my home and I am proud to say so. (But for the record there are only two blips of equality in KY, with the other being Lexington.) When I was 9 I watched Patch Adams and knew from that moment on, that this kind of work is what I was born to do. Helping people is my business, my brand. Thank you for doing the work. Love you 💕", "jonbonjodie": "Hiiiiii I'm Jodie (she/her). Been a long time follower/learner and am so very thankful for you and all you do. Professionally I am a medical oncology nurse (congrats on your 4 years 🙌) and in my non work time I ride motorcycles and tend to my 17 year old dog with dementia 😀", "audrelordehavemercy": "Hi Ericka, i am megan, a Black queer therapist in private practice. i prioritize seeing Black trans women on a sliding scale as well as run a therapy group for qtpoc. im a dancer and i just finished a certification in dance & movement therapy, hoping to integrate this into my practice to help our communities process daily traumas we hold in our bodies. grateful for you and your work.", "sage_fem": "Hi, I’m a big fan and so appreciate you, your work and your posts! I’m Sarah, (she/her/they) living on the coast of Maine with my wife missing city life. I was a Babeland customer in Seattle!! I’m a midwife but currently home full time with our baby! ❤️", "brittany_nicole": "I’m Brittany and I just wanna say that I admire you so much", "rwhiteh1": "Hi! I’m Bekah - I’m a social worker for families and individuals in permanent supportive housing - basically working with those who have experienced homelessness, have documented disabilities and have trouble maintaining housing without additional support. I believe housing should be a right and not a privilege! 💓 Been following you a while and keep my mouth shut so I can listen and learn 💯", "_by_the_grace_of_god": "I just wanted to let you know that it is so encouraging for me to see that people who are doing something similar to what I want to be doing were doing the same jobs that I am now when they were my age. Thank you for getting me through this retail shift and making me feel like I’m actually going somewhere ♥️♥️", "_paolacespedes": "That lululemon discount tho! Yes transparency", "jahshona": "💕💕", "luz_de_tu_ser": "💞💕❤️☺️🦋🌻", "shes.kclauren": "Hiii! ☺️ I’m Kassi (pronounced like KC), I followed you a couple of days ago for inspiration and enlightenment. My mother had a mastectomy on the 1st and I’m praying that’s the end of her cancer. I work as an assistant manager for Origins and have my own business making crystal jewelry and Manifestation candles. I also will start doing hair on the side this month. I absolutely LOVE your page. 💕✨", "kellarmeg": "Ha! I fell into a few pyramid schemes too! Now I am a full time photog after spending over 10 years in hospitality management", "sutopiasue": "I LOVE this photo. You look fucking spectacular.", "lady_ayaba": "Hi Ericka ! I am Stephanie. Living all the way down to Cape Town, South Africa 🇿🇦. Pronouns are she/her. I am queer womxn passionate about social justice. Paid gig: I have a consulting business which educate people and brands about spirits (alcohol) and I teach non-colonial spirits history. Unpaid gig: I am the founder of an academy called beyond Bars Akademia @bbakademia which offer hospitality skills and mindfulness therapy to womxn formerly incarcerated in the hope to fight recidivism. Thank you for being who you are. You make me smile on a daily basis ❤ and being French I love that your fur baby name is baguette !!! 😊", "kristinajaypee": "Hi! American Sign Language interpreter and mom of 5 humans.", "flow.days": "🌸🌼🌻🙌", "bea_lissima": "Hi Erika! I’m an educator and burlesque dancer in Canada. I’m a queer woman of colour and I love your feed! Thank you for all you do. ❤️", "kitt.katt._": "You worked at @lepainquotidienusa !? How am I just finding this out ? No wonder why you live the baguettes lol I fell in love with baguettes after working there too. Bread and butter me any day lol", "hunteraklo13": "ericka is the absolute coolest person ever omg", "sarahkiva": "💜", "iamthegoldenchile": "Hi Ericka ❤️ (that was my late aunts name 🙏🏾) my name is Tiffanie (she/her) my paid work is a combat medic for the US Army and street photographer (I’ve had to put on hold due to my enlistment) My unpaid work is mom of 7 year old Kai and currently looking to engage myself in other things I love . I am Bi and am engaged to my life partner Breana. Thank you for your openness and peaking my interest in exploring more of the conversations being had in LGBTQIA+ spaces . There is still a lot for me to learn , growing up all I knew was Gay , lesbian and BI. Thank you for being an inspiration and powerful platform to educate the masses !", "taliacosta": "Hi Ericka! My name is Talia and my paid gig is a social worker at a dialysis clinic in South Florida. Currently working toward licensure to be an LCSW. Trying to constantly use my privilege as a white Latina to call out white supremacy and support POC. Thank you for the work you do, paid and unpaid!!", "crvyambition": "Hiiii 👋🏾", "folami_olujimi": "Do you have a P.O. Box if someone wants to send you gift ?", "im_liamsmom": "I'm Kimberly a Jamaican currently living in the Uk for 10 months now. I'm a nurse in a care home which I hate because it's too monotonous 🙆🏾‍♀️", "tallesttrees": "Hi! I’m Leigh Ann, I teach sex Ed for planned parenthood. I have a lot to (un)learn and value the work you do", "chinksdoe": "💫⭐️✨", "kaygeni": "Recently had an emergency mastectomy and currently recovering from a second round of surgery yesterday 😖 (final stage of reconstruction) I’m grateful to have had you as an example of strength and following your journey has really helped me be bold and vulnerable with mine ❤️", "carson0414": "Hi! I’m Sam (they/he pronouns) a white queer non-binary trans guy. My paid work is navigating the nonprofit industrial complex as a mental health counselor.", "zakaria_is_my_name": "Hi I’m Zakaria! 31, transfemme tomboy, they/them 🤩 absolutely adore following you and witnessing the work you put out there 🙏🏽 very grateful 🥰 I am a barber, an event host/MC, and a QTPOC nightlife organizer! Sending love to y’all! ☺️☺️☺️", "futurewinemomsunited": "I’m Terri, she/her pronouns, queer femme. I am a clinical social worker currently working with people experiencing homelessness & mental health concerns. I use your work daily to help myself decolonize my practice. Thank you for all you do!", "sparkleandshineguidance": "Hello beautiful soul. I’m so happy to have found your page. You and your partner make me smile ✨. I have had many random jobs as well but finally now have settled on my passion since childhood: Astrology and Healing/Coaching work. My favorite is help awakening people to see the magic and beauty that is already within them and is just waiting to be seen. I guess that’s why I had so many other types of work too because it took me quite awhile to recognize my gifts and talents as well. Thank you for being here and sharing love and goodness. ♥️ @sparkleandshineguidance", "katkiss9999": "Hi! Sex worker full time ❤️", "woman_inherits_the_earth": "Hi I'm Alex, she/her. I am a grad student studying Visual Arts Therapy. My paid gig is as a teacher's assistant at my university, but I also make art and bake and alter clothes on the side.", "coizanbithe": "I’m Bek - new follower, found you this week. Non-binary she/they breast cancer survivor, in retail and also this week - working artist not just as a hobby. Hobby though: I make and donate colouring page art to the hospital I got my care at, squiz that at @inkyplaytime if you’re keen. Big love to your energy and messages.", "chriswiley34": "Hi, I'm Chris, he/him pronouns. I cant recall how I found your Instagram, been following awhile. I enjoy the insta stories and love the podcast. Grateful for all you and Eb do. My paid gigs are I'm a librarian and part time bookseller", "odintheoneyed": "@ihartericka special Ed teacher, been following you since mid 2018ish.", "mmarge3": "Hey! I’m a psychotherapist in Michigan currently training to do sex therapy work and trauma work.", "jocelynzim": "Hello! My name is Jocelyn and I’m a history PhD student at Stony Brook University. I study British imperialism with the intent of disrupting and untangling the colonial matrixes of power that still exist with us today. They pay me, but barely. Also, my intelligent and beautiful girlfriend and I just celebrated one year :) Finally, I absolutely love your work and your account - you are truly inspirational. You put the practice in decolonial praxis!! :)", "nicoletelfer_": "I adore you ❤️", "politicsandfshn": "So grateful for you and your work. You made me feel seen. It inspired me to live out loud through my diagnosis and treatment.", "lilyholder": "Hi! I’m Lily, she/her pronouns, and I’m an artist and professional naked lady from South London 🍑✌️", "sarahchristenee": "Sarah, she/her pronouns, & my background is public health program evaluation! Thank you to you and Ebony! ❤️", "salty.world\nVerified": "Verified", "cheese_and_picklesss": "Hey! I'm alayna. Super anxious, super depressed fibromyalgia living human. I'm a preschool teacher but have recently been focusing on becoming a resource teacher and advocating for children's mental health", "mafreako": "Hi Ericka! I’m Mariko (she/hers) from Sweden/Japan. Been following you for a few months and I really appreciate your account, especially because you touch upon so many important topics that aren’t discussed much in countries like Sweden! My paid gig is being a PhD student in human ecology looking into the environmental injustice of the fashion industry and capitalist co-optation of social justice movements. nice to meet you 🌸🌸🌸", "dani.nicoleeeee": "😍❤️", "cirkuswaggon42": "Hi Ericka, I’ve followed you for a while now, ❤️ . I am a designer making fashions with recycled fabrics ✨❤️", "inkindspace": "You are absolutely gorgeous!", "irl_slime": "Hey Ericka, I'm a non-binary academic who's post-grad focus is accessibility to science education for underrepresented students. I teach marine bio/biodiversity labs at the college level and help run microscopy and biology workshops with kids from underfunded local schools. I recently got the results that I'm positive for the BRCA-1 mutation and am SO empowered by how open you are about your mastectomy (especially as a fellow trans person!) Thanks for all your work, constantly feeling educated by you and I'm very grateful for that. 💚🌿", "laylacarmencita": "You and Ebony are amazing and I learn so much from you every day. Thank you for all that you do! Hi, I’m Layla (she/hers) and I work as a youth educator at a local sexual trauma and abuse care center. I’m so lucky to get to talk to youth of all ages. The little ones know me as Safety Layla for my lessons on safe touch, consent and bodily autonomy. It’s my dream job!", "trudoeamirite56": "Hi Erica! Melissa here— pronouns she/her/hers. Been following you for about 2 and a half years on multiple different accounts. Love what you and Ebony do. I’ve learned so much and shared your lessons and knowledge with my friends and family (I hosted a sex toy class for my friends lol). I currently work in operations for an HR consulting firm. Previously did research on depression and anxiety. Trying to figure out what to do next 🐢🐢🐢🐢 but I’m 22 I got time ¯\\_(ツ)_/¯", "hanburb": "Amazing", "rockchalk_kt": "Hey Ericka! been following you for a lil bit now, love what you share with us, you are a beautiful human. I pay the bills via my corporate sales job 😴😴😴", "bigdre239": "God bless you! Im Andre -educator-DJ on leave lol", "emmaelizabethfox": "Hi Ericka and Eb and Baguette!! My name is Emma (she/hers) and I’ve been a follower for about a year now. I love you all dearly and my peers and I get a lot of our continued unlearning from your page! My plants have stopped dying, I love my fat body, and I’m becoming a better anti-racist largely in part to you. I don’t have any paid work right now which is really hard, but I’m hoping to put my grad degree in public health to work soon. Until then, I’ve been supporting my parents and sibling as his part-time direct support profesional. It’s been nice to spend more time with him 💕", "bananamilkbox": "A whole icon, I adore you 💓💓💓", "_wendeezy_": "Hi!💕 I'm Wendy. She/her pronouns. I work as an environmental educator at a non profit serving youth of color", "alektrikcrystals": "Beautiful 💕", "bperformer": "I teach private vocal lessons, I babysit, and I am a production assistant ❤️", "christinadbest": "Hi Ericka! Been following you for a hot min. Love your posts. I’m a fellow survivor, diagnosed at 24 (3 years ago). You helped me get through a lot. My paid work is in education technology. As a fellow Sagittarius who likes to explore all the things, I’m working on a bunch of side gigs as well lol.", "youngheartcollective": "Hello, thank you for all the work you do! 💕 I'm Christine, she/her pronouns, and my current paid gig is as a Victoria Secret backroom associate, and doing sample knitting and crochet.", "chandler_220": "Hey Ericka! My wifey and I are inspired by your posts often! Been following for a year now I think lol. I’m a full-time Gemini and get on my Sagittarius gf nerves daily 😂 My paid gig or should I say gigs is Resume Specialist, part time Photographer, full time Event curator and planning to go back to grad school in Spring 20 for Social Work ❤️ thanks for the amazing posts and lit Podcast", "shishi.rose\nVerified": "Verified", "yuugxn": "I love your account. 💞", "caitmay": "Hey @ihartericka! I’m Caitlin (she/her) and my paid gig is employment counsel for a tech company. I spend a lot of time working on our diversity & inclusion initiatives and your page has been a great source of education for me. Thank you for all your labor here, you’re amazing! Would love to bring you in to speak sometime!", "soulful.nutrition": "👏🏾👏🏾 Hi Ericka! I’m Sarah (been following you for awhile, but love a good intro!) my paid gig is Certified Holistic Nutritionist and Beautycounter Consultant. Unpaid gig is full-time, live-in caregiver for my grandpa who has Alzheimer’s and cancer. 💜 Thank you for creating this amazing space! 🙌🏾", "sueisme": "I’m سعاد, Palestinian, she/they pronouns and blood cancer survivor diagnosed soon after I turned 18. No paid gig at the moment. Instead, I’m currently paying to be in medical school.", "nana41965": "You ROCK ❤️👊", "lakshkarra": "Hi! I’m a family medicine doctor in Denver.", "allisonalcena": "I too sold knifes and I thoroughly enjoyed that $47 settlement check I got a few years later 😂", "emshrab": "Hi! I’m Mila, she/her pronouns. I’ve been following you for about all of 2019. I’m so grateful to you and Ebony. Expanding my knowledge, having me grow at rapid speeds. Anyway, I’m a pastry chef lol", "cleopatra_jay": "Hi Ericka! Jakora (she/hers). Higher Ed Admin pays the bill. Ed.D. Student by night. Focus on underrep / first-gen / low-income students . Issues of access an equity in higher ed", "tori_borialis": "Hello, I’m tori! I currently work in management at an Anthropologie store, but dream of one day opening a book store. Thank you for all that you do! You’re truly an inspiration ♥️"}