{"odudu.em": "hi just want to say i love u and this caption is everything💞", "goldenawakening": "loooooooooooove!!!!!", "kdelriego": "🙌🏾😭🔥🙏🏾💕❤️", "mommyzona": "Sista you got my vote, 7 years strong, no stopping us now❤️🔥👏", "irlstxxch": "Hii! Love you girl, another black queen slaying!🔥💕🙏", "tammakastaley": "We all have these moments of self-reflection, reminding, and checking ourselves. Colonialism did a number on us and it took year to learn this toxic shit. It’s gone take even longer to unlearn it. I try to be gentle with myself and encourage others to do the same. We are so deserving of it. You are not alone, @ihartericka 👏🏾❤️🤸🏿‍♀️ and Ayee! Fuck it up *stripper leg shake, booty pop*", "zjlord": "Big hugs. Love this", "love_to_hate_ree": "You are the DOPEST!!!! From one survivor to another I love you and I'm glad I found your page!", "kamia.elizabeth": "you’re so beautiful", "niko.raimondo": "There are ONLY two genders boy/girl anything else is not real", "amani.aarif": "❤️", "royalhemanthb": "Omg that's great👌💕💕", "rubymorris30": "@olliewoods95", "gelo_helo": "Schönste Prinzessin der Welt😍😍😍", "darvinaplanteyoga": "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "maddsmcclems": "Omg I am struggling with the same thing 😩 thank you for your vulnerability!", "caffeinatedyogini": "I feel bikinis are indeed in your future...❤️🧡💛💚💙💜", "sarahmoneyb": "Beautiful! ❤️", "psoares20374": "Sexy", "alexandraaa.22": "This is what I needed to see! I’m 29, was diagnosed with BC @ age 22. Double mastectomy & I’ve been living in fear, embarrassment, shame of what my body looks like now. THIS makes me feel okay! KEEP DOING YOU & spreading that awareness & self love. 💘", "beardedlady62": "So dang sexy and dork dancing with crazy good smile hiiiii", "avaa.draws": "Three years old???", "marcussg1": "Do you feel the same sensitivity on them as before?", "aliceandevil": "You are a gift to this universe!!! 💕", "laurentmarion96": "😍😍😍", "jehleejeh": "I love that you tell on yourself to release the shame 🙌🏼 that’s how you do it!", "aziakashmir": "hi @ihartericka 💕🌹", "kewlestchikever": "I’m so happy your working through that and are the type to bring that to your community. It’s not right that women don’t feel pretty with long hair or a certain “look”. “Happy women are the prettiest” and I hope every woman on this earth finds happiness 💝", "qbrandi29": "It may not be appropriate, I don't care. I wish to say, nah shout it out very loud. I adore your heart, your strength, your joy. Peace be for you and yours. Much love from my lady and I.", "alguapa_lovetoys": "🔥", "rieleo": "You’re beautiful but don’t eschew the scar cream. Find an inexpensive one to use. Stretch marks can be painful. Using something on them helps with the pain and helps them relax. ❤️", "khyleesi": "Yes. I love you. You are a superperson on my feed, giving me energy that has been so low lately. You are fantastic, Erika. 💜", "renewing_me": "Loooove this..motivation!!😘😘😘", "mim_iamiam": "💚💚💚", "soledadmother": "E, how do we share the highlighted Reed Case stories especially that of the Innocence Project to our own followers??? @ihartericka", "midwife.on.the.run": "Hey Erika! Wishin you were here in Cleveland to educate my 4 year old and 2 year old girls on sexuality! Will a webinar tailored to very young kiddos be available someday? Willing to pay!", "thelipgoddesscollection": "Love this 😍", "future_after_the_big_c": "🙏🏽🙌🏽🙌🏽🙌🏽🙌🏽 yassss my cancer sister 👏🏽👏🏽👏🏽👏🏽👏🏽", "madelines_mantras": "Yes babe!!!😍😍💕💕so beautiful, thank you for sharing your light and wisdom with the internet😄", "doymane": "😍❤️", "megsfadays": "I wish I could have articulated these thoughts and shown this video to my 18 year old self when she found very similar stretch marks waking up on the day I was moving in to college. It’s been 15 years since then and my bodies changes still throw me for a loop. Thank you for dancing into your body and your ambivalence. It is bringing me tears and healing. My white queer existence benefits so so much from the work you do!", "z_ap": "@marri.alyse", "ihartericka\nVerified": "Verified", "j_to_the_ulia": "😻", "adriana.does.pole": "I feel the same way about the cellulite on my legs, I used to spend so much time googling for products to make it go away. Now when I go to pole dance class I challenge myself to buy smaller and smaller bottoms 🍑", "cancer_dr": "Beautiful as ever", "natabananalie": "@ihartericka I am curious, what do 3 yr olds normally learn about in sexuality education?", "courtneyalisonhair": "Stretch marks are a part of being a woman! I don’t think I know many who don’t have ‘em. You are beautiful and inspirational. ❤️", "peter_scanavino_fanfic": "Hi! Love you!", "paulapatchwork": "🔥😍🔥😍🔥", "revathi_truong": "What a beautiful video of self love!!!!", "jesstclinton": "🌈🌈🌈💕", "adri_nicoleee": "I struggle with the same exact thoughts. Thank you for being open about this! It’s nice to know it’s not just me.", "inoshikaocho": "Hi - you’re amazing ❤️", "akilahayanna": "Love this", "kathleencollins": "😍😍😍😍😍", "kiri_crossland": "❤❤❤", "muddypixie": "🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌❤️", "sarahparkerphysio": "Hiiiiii😬👋👋👋👋", "eeomalley": "You are so beautiful.", "mkrohan": "😍🔥", "amanduhh1221": "Thank you for existing. Your positivity and wonderful way of seeing the world is so inspiring. ❤️", "lynkempa": "YESS i love", "wontuplay4me": "you better quit playing & buy/wear all the bikinis you want! do whatever the eff you wanna do! ❤️", "thaexplora": "Thank you for this energy!!! 💖💖💖 dont hide any of you!! Shove it all in our faces!!!", "stvrry.eyes": "You’re such an inspiration!!💕", "little_mizz_fleur": "Could you BE more gorgeous?!! 😘😘😘", "plus_size_sugar_vee": "Hi. I love luuurrrvvvee your vibe💗💖", "stinatea": "💜love love love 💜 love for who you are, love for what you’re bringing to this world 💜", "mizmermer": "Thank you for sharing your awesomeness. I appreciate your educational work and someday hope the University of MIssouri brings you to campus! 💜♥️💗", "nolwazinkwandla": "Hi, I've been here a while and I love you, Eb and Baguette a lot. Like way too much for people (and puppy) that I haven't met before 😊😂😍", "bu817": "Felt this deeply. Struggling still. Thank you for this. ❤️", "carls__barkley__": "This makes me feel loved", "sanyalove": "❤️❤️", "aroseasis": "I relate to the “side versus front” mentality so hard! Thank you for sharing ✨", "myfriendzhenya": "You’re amazing 💕", "denisebidot\nVerified": "Verified", "samgamfam": "Hiiii😍🤩💗💗💗", "daragay": "Yes yes yes! You are sunshine on this cold day.", "maia1976": "❤️", "mohawktheeducator": "I miss seeing y'all. Feels like a ghost town around this building these days. Still a bunch of construction.", "misstrish99": "Hey! You are amazing!", "darkskin_sunflower": "Beauty beauty!! Freedom freedom!", "215soul": "Hi 💚💚💚", "marinedelphine": "Hi ! You're so beautiful ! 😄❤️", "5hread": "Everything about you is a delight! Thank you for sharing and teaching 😍", "tecitoypoesia": "You're so inspiring ❤️✊", "gwenlyn_e": "You’re amazing!!!!! 🔥🧡💫", "wildandfree.at.ashtree": "Hi! LOVE your page. 🖤", "samantha__crystal": "Can I ask a question!? I know you are a breast cancer survivor but, do you currently have implants? Because your breast look perfect 😍😍", "tillytimon": "💗💗💗💗💗", "carmelita_bancini": "New crush!", "hellotybeeren": "Lubes. And. Lubettes.", "lisahawks": "THANK YOU I love you and your work and this brought me to tears this morning. ❤", "shellycantsitwithus": "You are everything that is right in the world. 💚💚💚💚💚", "jl_avery": "Hi! Been following for a while now. Love your content and am grateful for your work.", "pim.pam.pomme": "Hi, I am newish and learning so much. Thank you for being in my feed ❤️", "juju_maestro": "All of this joy! 🙌🏾🙌🏾", "sharonalautoe": "💛💛💛💛💛💛", "sistasdotravel": "Bikinis are for ever Black Body #noshame 💯that stretch", "honeyprosopopeia": "Thank you so much for all you share here I am learning so much.", "partypartynails\nVerified": "Verified", "marire": "Hi Ericka! It’s super powerful to see someone I look up to struggle with this, it makes my own brain moments seem less solitary and shameful. Thank you so much for sharing ♥️", "aeys.12": "i recently developed stretch marks on my stomach too and had the EXACT same thought about “damn, hips were fine but this is not” haha - thanks for this post and thank you for your work Ericka!", "reelevorn": "hi eye love you and your energy 💛", "anyadedyna": "Been working on that stretch mark acceptance (without having a baby) for years. You’re doing great! Hi hi hi! 💕💕💕", "betaniavg": "Yasssss! Unapologetically you! Beautiful and inspiring! 🔥🤗🤗😘", "aaaminaaaminaaaminaaa": "🏹❤️", "sperry103": "Love your content, consistently. 🖤", "asthebirdfliesblog": "💕💕💕", "vinylandthings": "Thank you for being unapologetically, YOU. Your page is one of my favorites ✨💕", "erin_mikrut_young": "Breast Cancer Thriver 🙋🏻‍♀️ Your page rocks, and your messages are beautiful. Thanks for sharing YOU. 😻", "anonymouph_2": "😍😍😍😍🔥🔥🔥🔥", "feliciaholman": "💜🔥💜🔥💜!!!", "miki_moonchild": "Hi 😊 you're so great! 😍❤️", "uberherbal": "Yep, This is what I’m here for! ** cheering**", "orangepeaches": "I'm struggling with new belly stretch marks too so thank you for talking about it", "ryleebonilla": "I love this and I love you!", "littlesquigglepie": "Hey, good to meetcha, Ericka. I'm Rique Ramirez (they/he pronouns). I am a Xicanx, queer, trans masculine person from San Diego, CA. I'm just here to learn, help educate, converse with other folx, make connections. 🙋", "johannapearll": "I love you", "mmabsie": "❤️🔥❤️🔥❤️🔥❤️❤️❤️🔥❤️❤️❤️", "blaqgrwl": "yooooo, i wanna be confident and real about my pain like you 🥺 which i might be wrong about but you’re clearly at a stage im far from ❤️❤️❤️❤️❤️", "dingywhites": "Hi!", "bidneybims": "hi ! I’ve been following for a while and want to thank you for everything that you do! Hoodrat to Headwrap is so good! thank you for your education and empowerment 💙💙", "kadaziasparkles": "Hey Mx. Body! Do yo thang!!!", "meitnerium268": "Hi! Thank you for making stretch marks normal because they are. Seeing your confidence helps others feel more comfortable in their own skin.", "taraamackey\nVerified": "Verified", "o.a.cardoza": "okay after watching this back to back 10 times I'll just go and watch it again!!! lol after a very hard day for me I go on IG and watch @ihartericka do her thing as always!!! Seriously made my day!", "lizmayleaf": "This back-and-forth “it doesn’t matter and I’m great this way” and the “maybe this cream will fix it” is so right on. We are all doing this constantly.", "lillatchka.sp": "Such a beautiful being!", "casablanca7020": "You have beautiful skin💖", "islandbruja": "your an inspiration 🌹🌹🌹", "novibnyc": "👋🏾💗💗💗!", "ceciliagiselle": "i’m new too and you are awesome!!!! 👋🏼👋🏼", "bernbernieberna": "Hi I’m saving to listen to this song and artist again!", "womenofdetail": "🙏🙏🙏😎", "kilomoonchild": "❤️❤️❤️❤️", "maggybearlovesyou": "Yayyyy!!! I was just thinking of you today because I remembered the story you shared about being in a children’s classroom, and how one kiddo corrected the other when they called you a woman, saying “no, they’re an *experience*” 🌈✨🦋 thank you for being you and for sharing your beauty and brilliance so fiercely 🌈💛✨", "preenmeupscotty": "Perfection! 🔥🔥🔥🔥❤️❤️❤️", "naturalisticexpectations": "Been thinking about my new stretch marks too! Thanks for this 🙌", "magggie_c": "❤️", "meggygeez": "💯", "sarahk_bach": "You are so beautiful; and your energy is just next level. Thank you for you! 🌟", "naima_marina": "Hi! The best song. The best content.", "anushyab": "Your page is simply inspiring.", "pulsatingthought": "words can't really express how this video makes me feel...\"free\" is the closest one I can think of... just completely free", "kurrilovin": "I've been following you for about a year now and you're one of the reasons I can never give up the gram. ❣️❣️", "dd.smithhh": "Love you so much 😍😍😍", "erinniscrazy4cats": "You are beautiful! ❤️", "earlmfsweatshirt": "My PRESIDENT 😩❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "louisa_cbe": "You’re so beautiful. Keep up the amazing body positivity work, it’s hard but you inspire others (and me) to love instead of hate themselves. ❤️", "gtidiva": "♥️👏🏾👏🏾👏🏾", "naomyfd": "@sambosoul 😩", "slutofthemonth": "Hiiiiiiiiii", "kitt.katt._": "My ex gf had your body type, she was just short and smaller but I loved it. I’ve always been skinny and have always wanted curves so bigger bodies have always been more beautiful to me. Eb is right ❤️", "blquni": "hiiii ur so awesome!!! I see you! ty! 💕💕💕💕💕🙌🏾🙌🏾😩🙏🏾", "sheila.phillips_foodie": "You always make me smile 😁", "synaptic.sylvie": "Hi! Would love to know how you teach preschoolers avoir sexuality! Sounds super interesting 👏🏽", "thevaginachronicles": "My jam!!! Hi! ✨🙌🏽", "meganhoek": "Stretch marks all the way down to my knees from pregnancy. I feel yah. Hard to remember that doesn’t define you", "_itsnikkitho": "Thank you Ericka 💕 How do I get more info on your sexuality education for my daughter, trying to teach her early ❤️", "heydev": "Hi! You’re so so inspiring, thank you for sharing snippets of your life with us! 💕", "eeanabalerie": "Thank you for this, genuinely makes me feel happy for the body im in its so inspiring", "bridget_akers": "@samakers3", "simonelovesfitness": "What you mean Bikini are no longer in your future? 😤😤😤", "wallsuponwalls": "Hi hello! You are great!!! I appreciate you and your content", "empoweroceanside": "🙋 Newish follower and obsessed 💜", "gordolola": "Episode 358489462699gdhfdhg4486vvdi964", "knina_simone7": "Beautiful", "sandra_michelle17": "Hi", "melsconverse": "i always feel a lil bit better about my identity when i see ur posts!! im afab nb (they/them) and i always feel like an imposter when i want to dress femininely, even though it can be really fun!! its just really affirming to see you so confident about ur identity and ur brand of body positivity, i really appreciate it 💕", "mariamarkolokusmatikus": "Beautiful Wild proud inspiring humam being!!!!!❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "_velvet_morning": "I love youuuuu", "naiyaonpointe": "Yusss get it!! Learned abt ur page this week and am GRATEFUL. Pop awf!!", "knitwithme": "Hi! I've loved and followed you since I heard you on @mynameisjessamyn explains it all. You inspire, move, teach and humble me and I'm glad you and Eb are in my life via Instagram.", "mythologicalcreature": "❤️❤️❤️ You are fire", "autieshawtie": "hi! your page is such a safe and brave space for me to learn, engage, express, etc. ily!", "cutecupcakeprince": "I adore you, I adore this, and I try to remember stretch marks are gorgeous little stories told in out skin! 💙", "chemocarebagproject": "You’re amazing!!!!", "zanahoria.fails": "I love finding in the internet people like you. Thank u for empowering the female body like you do, and thank you for everything you stand for. Kisses from Spain 🌸", "wrex_n_effects": "YASSSS!", "irenediscos": "Hi👍🏽", "officialtoi": "Hey Erika! You are awesome!!!", "_sweetoflove": "You’re amazing 💖", "survivormoda.rachel": "You’re AMAZING. 💗 Hugs to Eb! 🤗", "barefoot_bella": "Not new but heyyyy 🖤🙌🏾", "bertinaa_mt": "I lovee youu ❤️❤️", "_miss.poetic": "You are radiating", "scandalousgrandma": "have loved your page for a minute!!! i teach preschool and am always looking for any early childhood sex ed i can get my hands on. u, ur ideas and stretch marks are beautiful - thank u!! ✨", "lexxsexdoc": "DANCE LOVE😘🖤😘🖤🖤😘", "healingailinghearts": "👏🌹♥️", "char_7798": "I just love you and what you stand for! And ever since you came to NCCU awhile back to speak I've been even more in tune for everything that you speak on. Truly positive work keep it up ❤️❤️ @ihartericka", "corrinavirus": "💖💖💖", "longlivekadriye": "🌻🌻🌻🌻🌻🌻🌻🌻", "ameb4787": "Ah! So beautiful!", "nblvblbavery": "That song is rightfully equated with spiritual and physical freedom.", "labotanicabruja": "The love is real ❤️ #KeepRockinYourEpicEnergy", "geevmir": "Hello! I’m fairly new, and I’m thankful for your constant encouragement, preachings, & BIG personality! We need more humans like you in this world! Much love & positivity to you!", "vividfiberarts": "That stretch mark fretting is real feel. \"This stretch mark is acceptable, but *this one*?\" I love how you danced it out! ( And hi! ❤️)", "mariersborrelli": "Hi 💜💙❤️", "anxiklhkpie": "♥️😍😍😍", "gardengirl_eden": "You’re so beautiful!!! Stretch marks are sexy AF. 💗 Love those panties! 🙌🏻", "erosbespammin": "this whole video exudes femme icon energy. i stan😍🖤", "fattgurrlgangg_": "I love following you!!! Always bring brightness to my feed 😁💖", "turtlelini_alfredo": "Hi. I love your smile.", "cat_teeth": "❤️", "youngheartcollective": "This post is giving my life so much joy! Thank you for sharing! 💕💕💕", "sade.b.alexis": "Hello! I sent you a message abt how much you mean to me as a fellow black femme. You keep me going. You inspire me. You are kick ass 💕", "gigygoez": "Beautiful 👏👏👏", "hannah_cifuentes": "You are joy- that encompasses your whole self😍😍😍😍 (and I totally got stretch marks on my belly after having kids(and I mean after, not while I was pregnant) they shimmer and I’m learning to love them as much as the ones I got while pregnant)", "missangierosie": "Hi Erika! Relatable af! The constant arguments in our heads!! Can get exhausting! You look happy though and I think that’s beautiful!", "lunalight": "Hi Ericka and Ebony and Baguette!! 💕", "marte_wells": "Hi Ericka we love you 🌈@_irisliketheflower", "yeikesmusic": "I am doing so much unlearning and through this process truly loving myself for all of the parts that used to scare me and I think who you are and what you do is amazing like literally keep shining that light boo ✨", "llouisedias": "YOU ARE ABSOLUTELY PERFECT 💛 and inspire me a lot ✨", "allenciathegreat": "Thanks for this", "gabathehut": "👋🏽", "panddaa.po": "I'm watching this video on a LOOP, it's so BEAUTIFUL & so INSPIRING. You just being YOU!!! I wish more of us humans would learn to love, & not judge ourselves, & just be unapologetically US!!! ♥️🌈", "sparklesrmyfavoritething": "Beauty", "nessnandez": "You’re an amazing being! It was a pleasure meeting you and learning/unlearning so much information 🙇🏽‍♀️", "elpequenothefirst": "🤘🏽🤘🏽💯💯❤️❤️✨✨🌈🌈", "michelledaylene": "Hi 🥰🥰🥰", "sutopiasue": "You are such a brilliant inspiration!! 💪🏼✨😘👏🏼", "4africaaa": "Hi i love ur posts ❤️❤️ u teaching me so much", "shandel.parsons": "Hi!!!!🤩🤩🤩🤩", "me_dos": "Yesss!!!🙌💖", "sugaring.brooklyn": "I sugar so many bodies, and I think not having stretch marks on the belly is rare! I loooove your belly!!!! hope you never stop wearing bikinis. I feel claustrophobic in a one piece, so I let my tummy fly! Get that sun on my big fat tummy!", "barbeque_tofu": "I💖you", "treefairfax": "💁🏽‍♀️ live your life like it’s golden ✨", "iskra\nVerified": "Verified", "monstrance.ghastly": "You’re such an inspirational person. And a babe!! 💜", "alanatomas": "i LOVE this 💞💞", "sammplss": "Love this! This is the energy I needed today, thank you for sharing 😊", "deniiizchucker": "Grateful (always) for what you choose to share💗🌈", "okanomode": "🙌🏾❤️🙌🏾", "emily.lalammee": "❤️❤️❤️❤️", "unifiedfields": "💕", "circleskeptic": "life goal: to be able to do this in front of a mirror with no one else around. my inner critic screams at the very notion.", "lucifers_lover_": "I love you so much for everything you are and do, and I’m SO grateful to you for validating the use of she/they. I’m NB but I still identify with my femininity and resonate with both she and they but I have been met with so much grief about it in the past that I’ just don’t talk about my gender identity ever at all anymore. Thanks for not only teaching me to be a better ally every day but for also making me feel valid💖", "stephaniemadeit": "😍😍😍😍😍", "justsheherhers": "🖤🖤🖤 Appreciate you Professor Hart!", "mad.maxipad": "I dont understand why bikinis are no longer in your future, part of being queer is queering concepts of bodies and what's sopposedly appropriate. You are entitled to anything or nothing at the beach, pool, sprinkler, etc.", "bloomingdream": "Beautiful inside and out. 💛🔥🦋", "fallenalien01": "hello angel!", "little_catieee": "You're beautiful 💖", "uuschiobermaierr": "❤️❤️❤️❤️❤️", "st4rkuality": "Hi hii ❤️", "likethebabyfood": "Hi! Can you talk more about how to start educating the very young on sexuality? Looking for ways to talk to my son (now 2.5) and absolutely lost as to where to turn for help.", "menacajso": "I didn't even see the stretch marks, was busy admiring you. Then I saw them and was busy admiring you.", "esquire.rabbit": "🙌🏾💗💗💗🙌🏾", "kjoberk": "💕💕💕 amazing.", "vawter23": "Music + Edits + Smile = Mood Lifter! 💕🌺💖👛🌸🎀💞", "toylsan": "Looking great awesome human", "coach_key": "I love this!! Wonderful to meet you and get the glimpse into your brain 🙆🏾‍♀️🙆🏾‍♀️", "ohmandee": "Hi, Ericka! Love you 💙", "nicolee_farrell": "🔥🔥🔥🔥", "ponchitomc": "❤️❤️❤️", "cvransening": "U a big one tho, why dont u go to lgbt protests and run the security people over", "rasheedah.z.h": "♥️♥️♥️😍 Yes Queen ❣️❣️", "psychadellicspices": "You are beautiful, thank you for all your hard work!!!!💖", "farheenalikhan28": "Hiiiii loves this video. Literally made me so happy. Thank you for being you @ihartericka", "archetypographia": "Wow love the transparency of this whole “this, no this, no that’s what capitalism wants, no this, no dance, no do a google” mindset 😭😭😭😭 thank you for sharing yourself in this way.", "iamsophie_marie": "Beautiful human. Inside and out.", "medusaeny": "❤️", "marialejandraospina": "Hiiii!! Colombian reader over here!!", "mama_yb": "😍 can you please write a sexuality book for kids???!!!", "kelleyjordan": "@joviewilky", "m.ire.poix": "Hello! I appreciate that you choose to share some of yourself with us. 💜", "drkwanza": "Que Lizzo on repeat ! !", "inkindspace": "Try having twins and breast cancer now those are stretch marks! Embracing it all!", "authenkitticity": "Love you!", "zgr_number1best": "Hola", "stephboggiss": "Fuck yes!!! ♥️♥️♥️", "hijadecoca": "💖", "bonbeest": "Wonderful content as always. Thank you for what you do. You amaze me and I extra love that you teach people so young! 💜", "qualitystrikes": "❤️🙌", "minabluebirds": "Hi Ericka!! 🖤", "a.dan.ran": "😭❤️👏🏾", "pissperfume": "You’re amazing Ericka!!! Hi from Montreal 💕", "ms_junebug": "Hi!!💜💫", "raeecrawwford": "💗💗💗💗💗", "heatherlarson": "We all get stretch marks at some point...never had a baby. Have them on my thighs. Not sure when they happened...there will always be something on our bodies we aren’t ready for... sigh 😔 now I’m up to wrinkles and greys, passed the point of, “what is this stupid chin hair” a very long time ago. But stretch marks aren’t an aging thing...they are just a thing. All genders get them. And they are stupid. Harder to hide than a stupid chin hair and a grey hair...and stupid wrinkles... I was never dedicated enough to see if the oils worked or not 😂😂😂 tried a few, lol — like I’m going to be habitual enough about it...", "myrimirmir": "Truly love you. Thank you for being you. ❤️✊🏾❤️", "saucyewest": "Note to people who send Ericka stuff: Send more bikinis for unboxing Friday! LOL! Love you! ♥️", "normantheg": "This made me want to dance in my undies and embrace my stretch marks🖤", "nekonae": "Hey! I love everything about this post. You are beautiful and an inspiration to curvy queer people everywhere ahh 🖤🔥🔥", "languagerazor": "It's so funny they don't censor if you don't have nipples❗ I love you you're way too beautiful and inspiring❤️", "_n_y_a_h__": "The shape.....iconic 😭", "jeniaron": "You’re an inspiring, bad ass human. Thank you for being your sexy and smart self and sharing you with us.", "theologynerd97": "@ffooofs you probably follow them already but !!!", "hauntedfurby": "I love you so much!! Keep it up bb 💞", "chronically_vintage_amy": "Hi love following you, you teach me so much ♥️", "tami_areyou_otay": "Your smile always lights up my day, Ericka 💕", "annachubbybanana": "This video brings me a smile, love your joy and smile, thank you. 💖💖🙌💖💖", "bianchibroad": "Hey hey @ihartericka ❤️ Thanks for changing the world! Hi Eb, thanks to you too ❤️", "yoh4il3y": "People with stretch marks on their tummies shouldn’t wear bikinis???", "reginabeana": "so grateful for you @ihartericka", "stacy_sass_": "3 year olds ? Smh. Wow", "malina.rhr": "Thank u for ur positivity💗 I kinda needed that rn", "nicaroxx": "🔥🔥🔥🔥", "circlesayktmae": "Hi Erika. I very much appreciate your content here. Thank you for the education, the reflections and the outfits. And so much more.", "pastry_alchemist": "Thank you so much for everything you contribute to the world!", "rosemaryxinhe": "@metarecursivity", "michellesinstagrams": "I love you", "nat.asia": "Yessss girl! Inspiration💗", "alannahradburn.poetry": "Amazing", "drjenpsych_": "❤️", "itst_podcast": "This makes me so happy", "blurredbytheheat": "Hi 👋🏽", "itsbrittles": "Hi again! Every time you make a post welcoming new followers I just have to comment even though I’m not new at all😂😂 I just wish when I was in Highschool I followed you on social media because I got stretch marks from a large weight gain and I was so ashamed of myself for YEARS. I bought all the products and oils and of course; they never worked. Thank you for this post❤️ I had a really shitty day and this just brightened up my mood. You and Eb are my favourite Instagram people!!!!!!!", "butterflews": "When you said that, I felt that.", "j_a_zarifian": "Beauty", "rachelle.luck": "Oh my gawd, bless you queen. So powerful to see your joy and openness thank you for sharing your word ❤️", "bittaterrific": "LOVE Teedra!", "talesiya": "🔥💕💕", "benataeo": "Dope new site!!!", "iheartumami.ny": "Hi Ericka!!! 🙌🏼🙌🏼🙌🏼", "jessica_lanyadoo\nVerified": "Verified", "justtryingtohackett": "Totally thought this was a post celebrating your flat stomach! 😍😍 My how our eyes manage to only be critical of ourselves!", "thearidgley": "This is fucking beautiful 💖", "ginita_la_nanita": "You are a gift. 💜💜💜💜💜", "other_sider_girl": "Hi hello! ❤️", "glitterfairymagic": "Hi! You’re beautiful and your unapologetic joy is contagious. Thank you for being you 💖✨", "jae_avilezzz": "hiiiii erikaaaaa 🤗🏳️‍🌈👋🏼", "greennginger": "💖💖💖💖💖", "flyphillyjawn": "You betta WERK!!!! 👏🏽👏🏽👏🏽💓💓💓", "yasminmackie": "I have stretch marks all over the front of my tummy too!!! I’ve been made to believe you shouldn’t get those unless you’ve had a baby, but I haven’t had one either. I’ve had a hard time loving them, but don’t they feel great when you run your hands over them?? The skin is so soft.", "danajannine": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾❤️❤️❤️", "a_collective_feminism": "Hello!! And thank you for this. I believe this expression of self love is what Audre Lorde was talking about. Really inspiring to see. 🙌", "moeimaornah": "BAWDY", "maragold11": "💜", "nessa_bess": "Literal mood every time this song comes on 🙌🏾🥰💖", "ultralightdre": "Hiiii! So grateful for you and all that you generously share!", "hanhtam_b": "Hi !!! I hope you, ebony, and your dog are all taking care of yourselves and celebrating life💕💕💕", "lauralushoc": "✨😍✨", "_______ec_______": "Absolute beauty!! 💖", "tactilestudiosltd": "100% the content I was looking for.", "ancientsong": "Stretch marks are pathways to to remember where you have been and where you are going in your life. Read them, cherish them, and honor them. They are unique only to you and no one can claim them. Ancestral markers that lay the foundation of self and external light. 💜 Shine on.", "taneemccall": "THIS IS IMPORTANT!!! 👏🏾👏🏾👏🏾💞💞💞", "erickaeckles": "😍😍😍😍", "impactlensphoto": "Bikinis are totally in your future and in your today if you want them to be. You are amazing. ❤️", "anabelriv": "You’re wonderful! For example, I consider stretch marks as the natural tattoo that marks the adventures of the body. 💜", "priyala11": "👑👑👑👑👑👑👑", "sweet_ness2016": "❤️", "kidnapsnap": "this is so powerful. thank you! 😩👌🏾💕", "carlsbarkley27": "So happy you're here, so happy you do what you do, you are so valid, and you deserve to celebrate yourself!", "topochicaaa": "You are an inspiration ❤️❤️❤️", "new.account.who.r.u": "You had me at that gangsta lean 😝😍😝", "moma_renny": "💜💜💜💜", "fiftyshadesofj_": "I am so thankful for you 💛", "maaayraaa_": "Hi!! Thank you for owning your truth so boldly. 👏🏼👏🏼 😘", "lightweightwarmastoast": "Loooove this content🔥🙏🏽", "acuario_1979": "🙌🏿🙌🏿🙌🏿🙌🏿🔥🔥🔥", "aliciadiannagarcia": "Hi 💜💜💜", "yeah_thatwoman": "❤️", "michael.soong": "Like George Clinton said “here’s a chance to dance our way out of our constrictions” 😂🤟🏼👏🏼", "rica_latina1": "I wish I had your courage. ❤️", "knock_a_momma": "I love you! ❤️", "motheo234": "hi. I'm new and I love your page❤️", "desireebela": "Hi! You’re so great!", "clever_grrl": "I hope you write a children's book! My preschoolers (and I) would love it.", "_feltzy": "💜", "heather_koza": "Hi! Please write a sex ed book for kids!!!!!", "_geralartist_": "You matter and I think you are one of the most amazing humans on the planet", "gidicreative": "BEST! 🖤🖤🖤", "rayah82": "🙌🏾❤️🙌🏾❤️🙌🏾❤️🙌🏾❤️🙌🏾", "uter.ish": "💖💗💓💞", "shey_dazzle": "Ericka! You DON’T need nor should care what any of us think but you are BEAUTIFUL! This dance compilation is ME! Lol Examining, self talk, dancing and all! Dance your way through them thoughts! You got this, even when you feel like you don’t! @ihartericka", "sunshowerplants": "🖤✨", "mosthighcourt": "uggghhh, you really are everything! 😩😍", "katesayssomethingclever": "Ericka Hart has taught me more than formal education ever did. #paythem", "erinfindsjoyy": "❤️❤️❤️❤️❤️❤️", "trenisewilliams": "Waddup!!", "meeshofthemaroons": "Stretch marks are just symbols of your body doing what it does and what it should do, adapting and ever evolving just like you ❤️", "fiercefatfemme": "Thank you for this beautiful post 💕💕💕. I’m just wondering, why are bikinis no longer in your future? I hope that those stretch marks feel the sand against them and the ocean waves and the sun. At my fattest, I now own the most bikinis. It’s a true treat 🧡💜🧡", "brujapxssy": "I love Kaytranada! And you!", "sara_waddington": "you are absolutely beautiful", "carola_adinda": "😍😍😍", "yamalo17": "Yasssss🙌🏾🙌🏾❤️❤️", "carson0414": "✨💕✨", "kendrickjames88": "🔥🔥🔥", "jettbugblack": "Thank you so much for normalizing the thoughts that go through my mind about myself 💖 You are magical!", "henna_speaks": "🙌🏾🙌🏾", "yaddydankee": "Gorg content", "thewellful": "I love this and you! 💛", "coastalcameron": "Hi! ❤️💃🏻❤️", "cany0nm00n": "YESSS YOURE FUCKING BEAUTIFUL", "mimigonzalez3006": "Maravillosa 👏👏👏👍", "shirleyumustbekidding": "💕hi!!!!", "ashleemariepreston\nVerified": "Verified", "genderfenderbender": "I love this! 🥰 I have a lot of new stretch marks recently too and I’m working on loving them which is tough and I’ve been feeling a lot of what you mentioned here. Thank you for helping me feel less alone 💕", "ti_cherie_travel": "Hi!!! 🙌 Keep shining ✨ ⭐️ and be such of inspiration of self love and acceptation 💫", "alexandra.jamieson.escritora": "I absolutely love tus #representation you are bringing to my IG. Thank you🔥", "woahlers": "@antonia_begonia", "iamerinmichael": "Ericka, you’re amazing! Huge props for all the labor you are doing to fight a system that works to keep you silent at every angle, and for sharing your truths with us. ❤️ If you ever have the time, I was curious if you have any recommended books or other materials for a mom of an almost three year old? I’m always looking for educational resources for my kiddo that are appropriate to her age, especially because nearly all materials (for everyone, but especially catering to her age) explain things in such binary, heteronormative, erasing, white-centric ways. Thanks again! ❤️", "littlered_mtl": "Barbie 😍", "metropolitanjade": "💖 Love you and all the things you have to say/ output into society 💖", "vanessawanyandeh": "This is prime content, I’m living for it🔥", "b.thatgirl": "💜🔥", "amyvirginia": "You are complete heaven 🙏🏻❤️", "theellechase": "Love!!!!", "irenemixer": "👑👑👑👑", "joydivisionmackie": "I have been here.", "annissa_renee": "😍👏👏👏👏😍", "ouifrancesca": "Thank you thank you thank you for YOU and all you do!", "xoai.jpg": "not lubes and lubettes omg. 😍😍", "cplusking": "Hiiii. I’m constantly wondering if I could just love myself what burdens would fall off me? Iono?", "tieboyer": "If you wear coco butter or shea on your skin they will fade but also fuck fatphobia. I have a whole poem about my stretch marks. @bglhmarketplace ‘s whipped butters have helped fade mine, but I use the products to moisturize. I did notice a change tho", "enchantedpsyche": "Get it!!!! 😍", "emilia.winkler": "I aspire to be as confident as you are queen!!!", "vooteevee": "My goodness you are AMAZING!!!", "theonlyaudrayouknow": "You teach me so much. Thank you for sharing your life 💓", "deborahmelogonzalez": "Love u ❤️", "hootszagorski": "🙌👋", "genesys420": "Beautiful", "jqreese92": "Hiii ✊🏾", "urianross": "Yessss sister girl 💕💕💕🔥", "brandellemanini": "You are absolutely beautiful and that is the LEAST interesting and sexy thing about you.", "wxtchy_and_bxtchy": "I think your body would look lovely in a bikini, but I also know self image issues and how better it feels to be comfortable while working through this type of stuff 😭🖤", "camstearycat": "💚💚😍😍", "just___brit": "Ty for your light, love, and knowledge.", "haileyjustbee": "Hi! 🌺", "thelindsaywolf": "I love youuuu!!!! 😍🎉😍🎉", "lkdesignart": "👏🏼👏🏼", "dia_belle_reve": "You're one of the best humans ✨💯", "felineforestmedicine": "hi🔥🔥🔥😊", "marci_romi_": "I love you 💕💕", "chaoticrebxllion": "I fucking adore you! ❤️", "makelemonadewithlupus": "💓💓", "shishi.rose\nVerified": "Verified", "themollydonovan": "💗💗💗💗💗", "mrsknc": "❤️❤️❤️❤️", "xxiixc_": "beautiful human 🌹", "lindeezimmer": "👋 you are amazing 💙", "kofindigo": "❤️❤️😍", "raquelwill16ms": "Hi! Thank you for existing. We don’t deserve you 😭", "annkonkolycnm": "🙌🙌🙌", "aarynnlang": "My jam", "krystalshanice": "I love you"}