{"tamramfalk": "What I mean is wear what you want.", "cristinajajaja": "😍bella!!!❤", "tannerryantanner": "absolutely fab", "xuxe8": "🔥damn🔥", "fanmdjanm\nVerified": "Verified", "victorythekid": "You are HOT!!!!! 🔥🔥🔥", "rachelle.raquel": "You look so HOT! 🔥😍", "rapmusiq": "Thank you for sharing. #bravery #vulnerability 🙏🏾", "jmichaelwalker1": "Actually, you do this dress honor! 👏🏽🔥🌷", "lashawnthompsonbeauty": "I know sis and you look good as hell.", "tanhaulover": "Brilliant Writing.... let us know when you PUBLISH THAT BOOK! Blessings my friend.", "natashalbrown7": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "_altoth_": "You look so 🔥 in that dress, and I love the matching rag. ❤️", "caitlin.meyer": "I saw this photo on @womenirl and stopped to stay “what a cute dress!” Then read your caption. You look amazing, this is a great color and style on you! What people are thinking in their heads is their issue, not yours. You look beautiful ❤️❤️now - where is you buy the dress?? 😂", "literaryyogi": "You like feminist bad ass. Rock it, baby.", "_lmdarisse_": "When I saw this pic I was like yaaaass she looks so confident and is working that look. Would have never occurred to me that you felt that way. We are so much harder on ourselves than we would ever think to be to others.", "ablissmer2": "So regal and beautiful!", "nkengebee": "And you look 🔥🔥🔥", "brandithlynn": "@bryanaalyse she puts off some B vibes 🥰", "jovie2005": "@awkwardhaitian Why come neither of us know/ follow her? So... You're welcome? lol", "dr.dvonp": "💜💜💜", "whatfrancessaw": "@ihartericka this post inspired me to not listen to my own internalizations and get a form fitting green velvet dress for a wedding next week that I normally wouldn’t feel comfortable to wear because it shows off the curves that this world tells me I should hate.", "mrs_honey_queen": "I thought you look gorg af 🙌🏾🙌🏾❤️❤️", "deadjim_music": "You look amazing! 💕", "teremylee": "lucky to exist on the same plane as you😱❣️", "fultwins": "Wait this was a brides maid dress? I love everything about this 💕❤️💜", "anxiklhkpie": "It's super hard to knock those thought out of your head. 💔 I think the dress looks great on you! Especially with the personality the dress is wearing. (You) ❤️", "ralislel": "Scrolling through instagram .... and I ooopp lol. Fierceness 💃🏽💃🏽😊", "hungryirishcat": "Stunning! 😍💚", "justsheherhers": "🖤🖤🖤", "vphotoblogger_themindfulrunner": "I think you look beautiful and elegant! Plus green is my favorite color.its the color of life!", "annamariepries": "Beautiful green dress 😍👗", "zolaah_tho": "You look fantastic! Your outfits are always 🔥!", "nicolereisman": "LOVE!", "giapeppers\nVerified": "Verified", "localfatfriend": "I am grateful for your honesty and your decision to let us see you and thusly be seen as well.", "dansko.queen": "When I saw this on your story I literally GASPED bcuz you look so great. 🔥🔥🔥", "yo.monixa": "You are so real and appreciated 😻💛🔥", "elleward": "🙌🏾🙌🏾", "fruittcakkke": "🔥🔥🔥🔥🔥🔥🔥", "infralu": "Your style is wonderful😍🔥", "rae.uddin": "Gorgeously dapper in green", "josiealcock": "You look incredible. From south Africa xxx🔥🔥🔥", "ellenmarielife": "Yess girl! That dress looks so good on you!", "jesinthewest": "👏👏👏👏👏", "takeshape_studio": "😍😍😍😍", "timmarayofsunshine": "You look AMAZING. Everything that you are and stand for is inspirational. ✨🙏🏻✨", "sage.horsey": "fucking gorgeous ✨🖤", "urshiewin": "I love this dress and nobody could've worn it the way you did- you looked amazing! P.S can you be my best friend?!?!😉", "pocketnovella": "You look absolutely stunning 😍😍", "aoieoeo": "You are so cool", "jessdavenportvalencia": "You look amazing.", "basic.987": "serious @alokvmenon vibes from this", "savrewilder": "fuck, you look 🔥. thank you for your authenticity.", "_alenemarie": "The voices in our heads are complete assholes sometimes. I’m glad you have a partner who showers you with loved and you’re right, Lizzo doesn’t want us to feel bad about us. It’s hard remembering that, and I hope you have people who remind of that 💖", "kia__sophia": "Before I read the caption I was like SHEESHHHH lol 😍😍😍 (and of course the caption was 🔥 too)", "themarkoflyfe": "Thank you.", "kgforhair": "Queen 😘😘😘", "jenny_millips": "😍🔥", "ameliahuntress": "🔥🔥🔥🔥🔥🔥🔥💥💥💥💥💥💥💥", "prinnypie": "Whew ok got teary. I’m honored you saved this dress for my day because you looked BEYOND BEYOND BEYONDDDDD in it. No shade to any of my bridesmaids 😂 but you win best dressed and killed this look 🔥🔥🔥🔥🔥😍😍😍😍😍 Also, I love Eb so much.", "safiae": "🔥🔥🔥", "miggiewithdafro": "Wow green is all the way your color!! I love this fit and the head wrap !! 😍😍😍", "oh___hey": "You are perfect 💖", "whenwildwomenrise": "🔥🔥🔥🔥🔥🔥🔥🔥🔥", "mcfearless": "😍", "plus_garum_ferre": "Everyone is looking at you because you’re a vision. But yeah, I feel those feelings all the time.", "freedahau": "You look ahhhmazing! I feel like finding myself a dress like that and create an occasion to wear it 😅", "moma_renny": "❤️❤️❤️❤️❤️ gorgeous!!!", "cupcakenoire": "Beautiful!", "_madussa_": "Stunning 🔥", "sonyareneetaylor": "You looked FABULOUS. Thanks for sharing the hard parts if the journey ❤️", "ndorser": "You look so gorgeous!!", "zey.nep.t": "Gorgeous inside and out 💛", "toppledcosplay": "That shade of green suits you so well!! 👌❤️", "tatipolaco": "🖤🌻Just passing by to said that you look beautiful and powerful.🌻🖤", "creaanna": "💗💗💗", "drfushy": "I love everything about this look on you! What I see is a beautiful woman in a green that makes that melanin glow!!", "lori.sara": "People look at you cause they wish they could rock it like YOU DO", "ellasantosart": "Ok, but you look beautiful!", "kaaatho": "🔥🔥🔥", "leggyblonde1415": "❤️😍❤️😍❤️😍❤️", "irobyn": "Tha k you for sharing! ✊🏽❤️✊🏽", "dabrownsugasexdoc": "you are a gift ... thank you for being here & teaching me. 💕", "byronatweedy": "👏👏👏", "c00kitup": "🔥🔥🔥 No matter how much we learn, our lower self slips in from time to time to knock on the doors with our worst insecurities. Especially since we’re approaching a full moon AND it’s Scorpio season- the universe is with ALL the shits. But you look gorgeous and you slayed it- damn it all to hell 🙏🏾💯", "slut_hustle": "This outfit is IT. Stunning babe 💕", "tabibelden": "Total babe femme daddy queen energy - LOVE THAT BEAUTIFUL WRAP ON YOUR HEAD!!! Was one of the first things I noticed and 😍😍😍’d at. ❤️❤️❤️", "katjuschka____": "you are everything. every day!", "annachubbybanana": "I’m so sorry you felt that way, you look amazing!!! 🙌🙌😍💖", "dontkeepsweatinwhatido": "That dress is awesome and you look fantastic 💕", "laughing.moon": "My voice is just one of many. But you are insanely beautiful and totes rocked this outfit. In all ways.", "caelad1": "🙌🔥🙌🔥🙌🔥", "annakoplos": "YOU LOOK UNBELIEVABLY GOOD 😭 thank you for blessing us with this bombass photo 🙏🏽", "helenamayne": "Such beautiful colours and powerful words ! What an outfit. And this head wrap, stunning.", "elizabethvargasisababy": "Glorious!", "aimee_mere": "Deep deep resonance! As always, so grateful for you. ❤️", "thedanielleyoung\nVerified": "Verified", "malikaq": "😍😍😍", "bigblackpants": "🔥🔥🔥", "plainglazed": "this world does not deserve you 😘 thanks for leading by example ❤️✨", "jakaylamarieofl": "You look fabulous darling.", "chick_fil_atio": "You are everything in this outfit and all others. Periodt.", "winniethechoochoo": "You look 💚🔥🙌🏻cool/glam/comfortable🙌🏻 🔥💚", "opshopsofadelaide": "We have to should to be heard sometimes. Fuck shapewear. It's like torture. And gosh you look amazing in that dress!", "lil.mandissa": "You are powerful🙏🏼", "erickaeckles": "😍😍😍😍😍😍", "luisa.not.louisa": "Brave, courageous, and sexy AF human! 🔥", "1hope_solo": "🖤🖤🖤🖤🙏🏽🖤🖤🖤🖤", "stonefox4evr": "This was the first picture in my feed when I checked insta just now. My first thought was \"oh damn Ericka! Lookin sexy cute!\" Thank you for sharing your inner voices and speaking on them getting louder and louder. I really identify with that. But you look bom.com and should definitely rock that dress again. 🔥🔥🔥🔥🔥❤️", "emily_burls": "The caption saddened me because you look so powerful in this photo😍", "slapyous": "you look so fucking stunning!!! thank you thank you thank you for being so vulnerable and making an example of the work you’ve done so applicable for us also 💕🔥💕", "imeaniguess96_": "Gorgeous ❤️", "cute_little_queer": "This dress was made for you! Holy wow 😍", "mcintyrespirit": "I am slain...💥🔥🖤", "midnightmurasaki": "Girl. Yes. Yes yes yes to everything, the photo, the dress, the look, and the caption.", "leah_athena": "💗💗💗 everything you do is powerful", "magggie_c": "❤️", "bitterbettynyc": "Phewwww, those internal voices are a real bitch innit? You’re amazing", "tacklingtomfool": "Cute! I love it and it looks good on you.", "tipsyelves\nVerified": "Verified", "jessie_socrazyitjustmightwork": "Gorgeousness and class!", "adorablespice": "My first thought upon seeing this (and before reading this comment) was WOW this energy!! Thank you for your messaging as usual.", "ibambz": "You look UNREAL 💚💚💚💚", "bipolarbooty": "You look GOOOOODT honey , I need this dress 😍", "taylorngibson18": "Thanks for your vulnerability and for giving this photo the permanent spot it deserves! 😍❤️", "tellyouwhatbygod": "🙌🏼Thank you for sharing!", "marissa.morgan.jimenez": "🔥🔥🔥", "nikkitony51": "A LEWKKKKKK🔥", "katieyeilding": "STUNNING 💚😍", "latoyaedwards.nyc": "this dress is sitting just as it should, perfectly ✨", "tucsondra": "😍", "brooklynsouthernbell": "You look amazing!!!!", "mchelyrmrz": "😍😍😍😍 Wow you’re amazing. Thank you for existing and speaking your truth", "mpcs_": "🔥 so gorgeous!!! 💯💯💯💚", "thealijojo": "You’re a Goddess. Point blank, period. ❤️", "hanburb": "🌀🔥🔥🔥🔥you look amazing. And those colors yesyesyes", "jungle.witch": "We love you!!!!", "keshia_rae": "Issa cute look!❤️", "manekibastet": "💯💯💯", "copper_lottie9": "You look stunning!", "syndrome_air": "This is the most stunning look on anyone ever. Of all time. You win.", "nataliavasquezvision": "You look fabulous. ✨", "shanti_peace": "It is fabulous!", "rdjwlv": "You look enviably beautiful, professional, powerful and stylish", "libbymarilyn": "😍😍😍🤑🤑🤑", "kacieversaci": "❤️❤️❤️❤️", "slayannnn": "Thank you for sharing this innanet twin! You look beautiful !!! 💖", "michelledaylene": "Beautiful inside & out", "idontwearpink": "You look AMAZING 🔥🔥🔥", "gretchen_skitchen": "Seriously? You look nice ! 😍 Love the ruching 😘", "taynahyena": "💜💜💜 Stunning", "dmitradawn": "All of this and you look FOINE.", "like.i.came.by": "YOU LOOK GREAT💚💚💚", "dbcadet\nVerified": "Verified", "its_herstorey": "⛽️ ⛽️ ⛽️ ⛽️ Ericka, you are stunning. You are ethereal. You are celestial. All of us motherfvckers are lucky to glance your way.", "piamolofsson": "🔥🔥🔥!!! 😍😍😍", "tulburger": "the moment i saw this outfit i showed my sister and i was like i LOOVVE this look", "rosserinstyles": "fucking stunning was my first thought 🔥🔥🔥", "mekdibaby": "You look so amazingggg. I love this dress and headwrap combination.", "classyallthewayjes": "She queerness ♥️👑", "vanessa.wh0": "A vision of beauty", "ashleyhartmeierprigg": "Shut down the negative voice, you look banging!! Retraining our brains is hard, I struggle with it every day to not speak negatively about my body.", "shey_dazzle": "@ihartericka We all have stuff, we get it. Sometimes it comes from no where and hits us so hard and unexpectedly! I definitely feel you. Have that moment, go through, remember and move forward. But you know what... Having a moment can not negate the actual factual and I must still acknowledge that you are just ABSOLUTELY stunning in this dress! 😍😍😍", "williamfuckner": "Fucking fashion", "welmeinstein": "🔥🔥🔥🔥🔥", "apple_headed": "❤️", "theglogoddess\nVerified": "Verified", "mandy_rose22": "I think it looks awesome!!!", "sclaires": "Maybe their glares were not judgmental and they were appreciating your look? You look beautiful and the dress is 🔥🔥🔥, sometimes what we imagine people are thinking is just an echo of our own judgments of ourselves", "that_rb": "💚", "_acceb___": "Absolutely stunning as always!!!!🙌🙌🙌", "diamond2389": "Sometimes the negative voices scream the loudest and we have to try and muffle them out as best we can and shine as beautiful as we know we are, you look stunning and regal love all your content and posts keep inspiring and enlightening 💓💓👑", "eccentricjukebox": "I love this... I find it so wild we can understand intellectually why fatphobia and anti-blackness (though of course I don't presume to imagine knowing what that feels like from the inside) are bad things, we can deeply appreciate and viscerally react positively to visions of big women in great outfits (my heart beat faster with joy and excitement and I actually gasped out loud when I saw this photo!) AND YET when it comes to our own selves, those tired old judgy comments are so quick to start playing! Those old records with their worn grooves... that shit drives me crazy. Anyway. You look AMAZING, the dress fits and suits you perfectly, from over here it's just a vision of badassery and confidence and I want to thank you for both modelling this look and being so real about your feelings, it's so appreciated. 💜❤️💜❤️💜", "hallarosew": "Looking like a mf snack 😍🔥", "scuba_fly_chick": "You. Look. Fierce 🔥🔥🔥🔥🔥🔥", "avocadoqueer": "🦋🦋🦋🦋🌷🌷🌷🌷🌷🌷🦋🦋🦋🦋🦋🦋🦋", "empanadamamii": "Ufff you look gorgeous ✨❤️", "nurselolita": "Wow😻😻🙏🏼🙏🏼", "lisagayleryan": "😍😍😍", "the_melanin_mrs": "You look nothing short of gorgeous. However I can definitely relate to hearing your Grandma’s voice scolding you for your choices. I call that our first conscious...", "kalirowe12": "Gorgeous!!!", "wanderinginmagic": "When I saw this look I was genuinely like DWAM! Best dressed 2019, can't wait to see 2020!", "reneemagnusson": "You look stunning! ❤️", "freedomofztyle": "You are absolutely BEAUTIFUL!!! Amazing dress, perfect choice! 👌🏼🔥❤️", "sierrawgarcia": "Fucking beautiful🔥", "cornblakes_1102": "❤❤❤", "sleeplessautumn": "Thank you so much for sharing, and you look absolutely gorgeous 😍 this colour on you is everything 🙌🏾", "sula0020": "❤️❤️❤️Beautiful", "thetracypiper": "🤩 You are beautiful and doing the hard work! 👏👏👏", "rebeecagrrcia": "So gorgeous!!!", "yungbabydade": "You have me mesmerized 😍😍😍😍😍😍😍", "bloomingdream": "My first thought when I saw your photo was WOW, she looks beautiful! But I understand because my late mom had internalized disdain for anything ‘unladylike’. 😔", "lilyazehner": "I hear you AND also HOT DAMN, you are the essence of fierce beauty.", "garbage\nVerified": "Verified", "bluth_ish": "The OG Fly Femme. 🔥🔥🔥🔥🔥🔥", "annamkapteijn": "You looked amazing!❤️", "missjeris": "Fabulous - you look amazing in that color!! 🔥🔥🔥", "bittahobserverr": "👏🏽👏🏽👏🏽💕", "l_zawacki_m": "I totally feel you with those inner thoughts but you KILLED that dress! You looked so damn hot! When I saw this without any context to how you were feeling I was like Ericka is rocking the hell out of that dress and looks HOT!! So glad you were able to combat those thoughts. And thankful you shared it with us - cause we’ve all been there.", "marshallecrockett": "❤️❤️❤️❤️❤️❤️❤️❤️", "nadya426": "💚💚💚💚", "marcheruedix": "👏🏾👏🏾👏🏾", "parenchymalkayl": "I mean, ya look damn hot - and your beautiful insides are hot too, Ericka! 💖💖", "meganlamming": "You’re an inspiration! 😍", "afroartemis": "You were looking fly, hunty!!", "nicolegpatterson": "Your style is 💯🔥", "beardette39": "This is your best look ever!", "whitneytheinvincible": "Perfection. ❤️❤️❤️❤️", "rileslovesyall": "it looks amazing & you look amazing. Internalized thoughts are so hard to fight, thank you for sharing your journey 💜", "brookeblaize": "This dress is cute as fuck and you wore the shitout of it!", "dani_the_seaweed_sista": "When I saw this my first thought was how great you look in that dress. The second was how terrible I would look although I have a similar structure to you. Isn’t it amazingly ridiculous how our brains work? As a brown skinned girl with thick thighs and cellulite, it could be hard to show bare skin even the though heat often demands. Congrats to conquering your those debilitating inner thoughts and thank you for giving me courage to ignore mine. (Also, whenever I wear shorts, I also think of @lizzobeeating ! 😭)", "gracecath": "Um excuse me that DRESS ON YOU😍😍", "tediously_brief": "You looked SO FLIPPIN STUNNING last night and I could not stop thinking how much I adored your dress and your outfit (also the outfit changes were so fire). I had the best time sitting next to you and Eb, I wish I had the energy to come salsa!! Def next time xx get home safe you two!", "imaliteraljoy": "Absolutely frigging gorgeous 👏👏👏😍😍😍", "pearlzorn": "Thank you so much for sharing. Its so easy to assume that you or anyone else has it all figured out. I appreciate the honesty. (And the look is 👌🏻)", "nicolettemason\nVerified": "Verified", "sflorart": "😍Beauty!", "livlifenow": "I immediately thought this was one of your best looks yet!! Absolutely love the green and gold combo- you looked amazing. ❤️", "tgrbass": "1. You look fantastic. 2. I hear you and appreciate you. 3. Now that I've committed to the GNC and they/them, I feel guilty when I catch myself liking traditionally \"feminine\" clothes, like I'm going back on my promise to eschew the binary by wearing something pretty. Working through it!", "liba_raunchie": "You look absolutely phenomenal 💜", "marissahbo": "Sooo stunning !!! 🔥", "aarynnlang": "Can relate. Love you beauty", "friskisrad": "You look beautiful.", "erin.hinker": "You are amazing. An inspiration. I love everything about", "freq_of_nature_": "i wish this was a video of you struttin! love this look✨", "lottedriessen": "💪🏼💪🏼💪🏼💪🏼💪🏼❤️❤️❤️❤️❤️❤️❤️❤️❤️ I just love you 😍", "carson0414": "✨✨✨✨", "quanmichelle_": "I love that dress 😍 @ihartericka", "jelliesandjams3": "That dress was made for you!", "la_meli_mel": "I LOVE everything about you (including this 🔥 outfit) & your always powerful & oh-so-necessary message. ❤️", "datarra_malani": "🔥🔥🔥🔥🔥", "lyndsheidt": "You are wearing the hell out of that dress! Your beautiful body and presence, along with your powerful and honest voice are 🔥🔥🔥", "mishpp": "❤️you literally rock any and all outfits I’m always like damn she did it again!!", "haiku2k": "Every day you inspire me. Those voices are hard to ignore and even harder to transcend. Well done and I’m so grateful you’re here", "kellygreenlight": "Yes queen 😍😍😍🎉🎉🎉", "immaglowgetter": "I think you look amazing. You look like an African Queen. As long as you’re comfortable and happy, that’s the most important thing. 💕", "decolonizingtherapy": "Thank you for sharing. 🔥💜 So real.", "julietwanders": "stunning! 😍", "laulalauralaula": "Gorgeous!!", "molly_goodgolly": "you look fucking incredible", "tanisalexis": "😍😍😍😍😍", "yemi.sees": "killed this 🔥", "samanthastroh": "Your fashion sense is perfect. I wish I could put an outfit together like you! 💕", "paula.o__": "I remember seeing your story and was like look at how she’s ROCKING this dress🥺❤️", "youwillbespock": "love your caption, thanks for sharing with us 💗", "authenkitticity": "I appreciate you so much! Thank you for posting and being vulnerable. Every moment of seeing authenticity is like a beacon for those out here afraid to step into their own.", "dustiwusti": "I once had a counselor ask if I'd internalized some racist/sexist stuff from work... the fact that she asked that question made me realize I needed a new counselor. You look bangin way to not let the voices win.", "hannah_cifuentes": "😍😍😍😍", "delinda951": "Wow 😍What a beautiful dress and it looks great on you.", "jvolsson": "You looked so amazing last night!!", "tiffanyanneee": "🔥❤️🔥", "mon.mon.d21": "stunning!! 😍💚🔥", "vconrecon": "Absolutely stunning 😍", "neecolay": "You look beautiful ❤️", "forever__dani": "😍😍😍😍", "sjbolich": "This dress is BEAUTIFUL on you 👏🏼", "katwoody": "I saw this dress in a game & wondered immediately who was fabulous enough to pull it off?! Thank you for your vulnerability & for brightening the world ❤️", "miss_princess_ana_": "Love that dress, its perfect for u. 💕", "_fioh_": "stunninggg 💘💘💘", "nuncia_maria": "I was just about to comment about how freaking gorgeous you look when I read the post. Thank you for always being so honest with your internal life. But also WOW! You are gorgeous here!", "northwoods_hill_farmers": "♥️", "cnic": "I saw this and thought “another masterpiece!”❤️", "audawee": "Beautiful. Head to toe perfection.", "sarahmacchamp": "EB was right, you look gorgeous in your dress. ❤️❤️❤️", "ohitsjusttiffa": "You look powerful in this.", "heydev": "One of the realest captions I’ve come across in a while & you look fantastic! 🌹", "dela.isla": "you look beautiful", "_kristen.renee": "You look tf good — the noise is always hard but it’s a beautiful thing when our affirming “bitch I’m BAD” voice becomes the loudest. Keep slaying 🧡", "c0rpor3al": "The beauty. The grace. The TASTE!", "luv_shay_butta": "🔥🔥🔥", "hannahetshannah": "you are such an intelligent, incredible person and you look stunning!!!!", "survivormoda.rachel": "Beautiful! 💚", "twopheesinapod": "ABSOLUTE BEAUTY.", "din0lee": "All I thought when I saw this photo was : wow you look AHmazing", "coach_key": "🔥🔥🔥🔥", "waffle_pockets": "😍😍😍 🔥", "samirah_tama": "YOU are RADIANT and BEAUTIFUL. You are strong in self and truth always. That's the most BEAUTIFUL thing ever 😍💖", "jldontlivehere": "You look amazing🔥🔥🔥", "hind_sophia": "😍😍😍😍😍😍😍😍", "lesliexkali": "👏🏾🤗", "marymcschultz": "Yo all I see is a fantastic person in a fantastic dress. 💗💯🔥", "jojarks": "You look amazing 😍😍", "ski.dec": "Stunning! And honestly I needed to read this post & comments more than you know. My own body image issues have been coming back up and I feel like I’m drowning some days. This post gave me some life!", "alittlebirdgirl": "🔥✨🔥✨", "trixieg.koehlbach": "You are so beautiful!! 😍😍😍", "sheldridge": "I hear you🙏🏽🙁 That struggle is REAL(!) Thank you for sharing this with us and being so honest. In my humble, you look good; my first glance thought was “🔥🔥🔥” ❤️✊🏽", "roxanne_tooma": "You are gorgeous and an inspiration, please keep doing you! ❤️❤️💥💥🔥🔥", "glitterygrandpa": "Before I read the caption I was just about to comment how stunning you look. You’re always so beautiful though. Your style is so amazing as well. But working to ignore those voices is something I struggle with as well and this caption just really hit me because of that.", "mandaaarae": "🔥🔥🔥🔥🔥", "anniebee3ab": "😍😍😍 Looking amazing", "reanimateddoll": "✨✨✨✨", "collage_diva": "I think you look stunning and fabulous!", "_samba14": "Heavenly", "theheartshala": "i love this look, beautiful 🦋", "megcummings": "You are a vision!!!", "thatkellymarie": "I gasped when I saw this look! I wish I had an ounce of your taste and style.", "heartskobe": "✨ Literally Royalty ✨", "kbx9ph": "Green like your plant babies! 🌱🌱🌱❤️", "lyndsey2009": "You looked and always look incredible!", "glitter_robot": "You look absolutely radiant💥", "_geralartist_": "You look amazing and are amazing.", "amazingannalise": "I LOVE this dress. You look gorgeous!!!", "jdotjourney": "When I saw this grace the IG stories. I was like damn Ericka bettah wear that dress!! Then immediately was like “Where can I get that dress” YOU LOOK STUNNING!!!!!!! ❤️❤️❤️❤️❤️", "a.nisha.z": "The colors of your attire, the accessories, the shoes all of it only emphasized how beautiful you are and the fact that you pushed through negative thoughts and collected your confidence around you shows your inner beauty as well. 👏👏👏 ps: your partner being supportive of you was so sweet to watch too.", "mini_sar": "Folks looking at you like that just hearing their own inheritance because otherwise their eyes would be reflecting your gorgeousness your radiance in that dress, fitting you perfect as it should.", "nicjsimpson": "Beautiful!!! 💓", "schneckertins": "Also this dress is fricken killer on you", "dreambignyc": "So beautiful", "jv_lva": "Funny cause my first thought was “ugghhhhhhhh 💕💕“. Blessed be expression, color, texture, prints, cut and daring to show up as beautiful as we can be to the world", "lmcindc": "👏😍", "jendawsonart": "I know those feelings. I also know that you look stunning in that dress.", "livinglargeinwlochy": "\"Inherited thoughts.\" I never heard this phrase before. It brings so much clarity. Thank you so much.", "_run_fatgirl_run_": "STELLAR AND VIBRANT AF. I am proud of you for not caving to that internal voice, Ericka. I think you're awesome and brave and beautiful, and I'm honoured to experience a s", "soulfreedreams": "🔥✨😍", "khaoticthoughts": "Before I started reading I thought \"damn! Eay to work that dress!\" So I'm glad they lifted your spirits & gassed this photo. I only have to fight the fatphobia & damn those grandma's were the worst! Mine used to wear shapewear to clean the house! It's crazy & I can't imagine having the also fight anti blackness voices. Keep doing your best to listen to the cheerleaders", "teepruns": "I hear your words. May you be able to keep centering in your worth and teaching. May we all keep learning and replacing harmful “truths”. My first thought before reading the caption was “this woman looks absolutely stunning..., and that color is so gorgeous, and the person wearing it has style” !", "oliviaagio": "This dress was absolutely MADE for you!! You look stunning 😍", "seejosiesmile": "Thank you for sharing yourself with us! 🖤", "ecrivezmaria": "Thank you for being vulnerable and letting us know you still have to navigate through insecurities too. Sometimes it feels like why can’t I be more confident but this posts reminds me to be kind to myself", "jujua714": "My first and only thought when I saw this photo is how beautiful you look in that dress. My second thought was where can I get it. When I read the caption, I thought how hard is this battle that most of us struggle with to tune out those voices of not good enough or not supposed to. Thanks for sharing and being vulnerable. Your words help me to reflect. Sending ❤️.", "fern.galindo": "Thank you for sharing ❤️", "clairemarengo": "Thanks for teaching us and showing us again and again and again we need to look beyond socially constructed and racist mindsets! You do look stunning, you're glowing!!", "jojoneecole": "Beautiful. Thank you for your transparency. It helps the test of us fight our own internalized forms of oppression too. ❤️", "luisebe": "♥️♥️♥️ beautiful", "cece.artemis": "❤️❤️❤️", "omaaffun": "❤️❤️❤️❤️❤️", "carpedayyum": "You look utterly gorgeous 🌈", "keirap10": "You are beautiful! 💕", "lbow15": "My God you look stunning. How did Eb keep his hands off of you for a minute? 🔥", "ms_lady_mac": "Absolutely stunning!! I love this colour on you, love the sleeves, love the polka dots. You look amazing. 🔥", "flywild_": "You look amazing and the colour POPS", "nafis_white": "You are stunning, always. The embodiment of power and self possession. A beacon to us all💫", "the_highestpriestess": "Absolutely radiant ✨✨ thank you for sharing with us", "talismanleather": "You are fabulous in all your manifestations", "ciaratoga": "Your amazing my friend ☁️☁️", "santinha.sarinha": "🖤🖤🖤🖤", "mahaliee": "THANK YOU🧡", "lmruth85": "Before I even read the caption, my initial thought was that you looked DOPE and that I def want that dress. Thank you for sharing the vulnerability with us 💕", "somer.time": "I LOVE it 😍", "nocturnalreignbow": "Oooooff green ain’t never look so good ❤️", "oliviaaudds": "thank you for your honesty & visibility - may you continue breaking through those inherited stigmas, you look magnificent! ❤️", "hebejebejones": "You are so so beautiful, made even more so because your style is 🔥🔥🔥 this dress is insanely cool and made me think I should be more adventurous with my outfit choices 🙌🙌", "chaninicholas\nVerified": "Verified", "sylviagreenstein": "💚💚💚💚💚🔥🔥🔥🔥🔥🔥", "costcomascot": "Amazing model and role model", "shalemar_1": "You looked like a dream fam. ♥️♥️♥️", "ghetoflower": "💚💜🖤", "bri.farber": "I had similar thoughts putting on a cute dress that clung to my belly yesterday. I got that dress. Glad you wore yours to perfection!! You and Eb look gorgeous in green - plant parenting coming through 💖", "spanana_": "ABSOLUTELY FUCKING B E A U T I F U L!!!!!!", "moeimaornah": "Felt the exact way when I wore something very formfitting recently to verrrrry bougie lunch situation recently. I went back and forth spewing why nots and eventually I cut shit, recognized my tits and thick thighs look amazing in that dress and left the damn house. Healing and unlearning is an everyday battles. Sometimes there’s wins. Sometimes not. We keep going anyway", "nealxbaby": "Best dress i've seen you on 👏👏👏", "mx_sugar_mamasota": "😻🖤😻", "lenamosia": "Such a stunning woman (and 👗!!!)", "mchakrabarti": "you look fucking fire 🔥🔥🔥. ⁣ ⁣ 💯 that’s it, no questions asked. ⁣ ok? kthxbai ✌🏾", "arepafranklin": "Divine", "nicoleangelah2o": "You look gorgeous 💛", "helloroci": "Literally a vision", "lovelyritah2": "❤️❤️❤️❤️❤️", "soulmoisturizer": "Your body works sis💚💚", "tracycozette": "🙌🏾", "the.a.league": "Love this photo and love you. You look incredible.", "xd3stini": "You look amazing 💕", "loren.interference": "Pure 🔥Love the necklace too!!", "aneesal4": "You are rocking that dress! #iconic", "hannahmathers": "👏👏👏👏👏👏", "msidgafkim": "Yasss absolutely stunning u look great😍❤️", "lovesuzy0126": "@kdwestre", "onomesmom": "I loooooove this fit. What kind of material is your head wrap? And I love this post. I recently cut my long locs off and have a twa. I realized how a lot of black women don’t even have freedom of hair. Trying to keep long hair just to “prove” to the world that we’re capable of doing so, when really what we (I) want is a buzz cut.", "calibrookestrauhs": "🔥🔥🔥🔥🔥🔥", "sashanlenz": "You look amazing that dress was made for you 🙌💚 fuck it up", "emmarooney": "You look fucking awesome 🔥", "camstearycat": "😍", "yllkabojku": "You look hella amazing 🔥", "deviant_rebel": "You are slaying that dress!!! 😍❤️😍❤️😍❤️😍", "justjasmine_x": "this is one of my favorite looks ive seen on you! 🔥", "theonlyaudrayouknow": "Damn gurl 😍😍 #slay", "j_a_zarifian": "Srsly cried. I hear these same voices, growing up in BC an Armenian household where you were supposed to clean your plate but why are you eating that? You’d be so pretty if you lost X pounds. No wonder he left you. No one else will tell you this but let me be the one to hurt you. Ugh. That dress and you are gorgeous. Thank you for your honesty. Always. 💜", "ladylivinoutloud": "Why are you so FLY though!!!!!????????", "michellealyssadelgado": "😍😍🔥🔥", "km_hendrix": "When I watched your stories and this photo popped up, I vocally said, “wow”.", "thecosmicrevolution": "No gas needed. You are the rocket, the fuel and the whole damn universe wrapped in one 🔥", "msscarabelle": "You look amazing. You. ALWAYS. do. No matter what your covered in. (Or not) Thank you for your earnestness. The things we do to femmes. The things we do to Black femmes. This look is resistance and revolutionary. Get. It.", "deborah.simikian": "You look so beautiful! Your words of self love inspire me constantly ❤️", "deeeebo_x": "Whatchu mean, shawty? You shining all the way through. Fuck 'em. Let them stare.", "the1st_noelle": "😍😍😍😍🔥GAWGEOUS!!", "plumpandfancy": "STUNNING 💚💚💚💚", "livinginabundance92": "I saw this and it made me so happy! Your confidence exudes out even if you’re not feeling it!", "ifurie": "And like...just TBH you look like ROYALTY 💅🏾💎💦🔥", "lboogie399": "Unlearning is a journey", "my_left_breast": "💞", "badeoye": "All I thought when I saw you in this dress is you looked stunning af and super pretty. That inner critic is really tough to quiet. 🤫😅😢🥴😂😘😍", "askgoody": "Thank you for sharing this. I struggle with whether or not to wear shapewear daily. I feel supported and it helps my posture, but I struggle with the fact that I enjoy that feeling. I feel like I'm embracing fatphobic ideals etc. It's hard out here for those of us that recognize the roots of our \"training\". YOU LOOK AMAZING!", "sparklesrmyfavoritething": "You look fabulous truly", "victoriad0723": "Amazing 🙌🏾👑", "kristiatolode": "😍😍😍", "moldytoe": "❤️", "luv.lux.luz": "This outfit is everything 😍", "francineapril20": "You look amazing! I love your realness , I love that you came as you are. Society, Celebrities, Billboards, Magazines etc has us to believe most are perfect, skin and bodies are flawless but that just not true. Thank you Queen for being who you are, in and out ❤🔥😊", "pretinhany": "Thank you for sharing your thoughts and feelings around it. It's a battle for myself and I'm sure others. And YET...I feel my on judgements on others as well. It's amazing how we can compartmentalize and do that. But it's gutter truth.. it's ingrained in us. We are both the victims and the offenders.", "alanatomas": "you look BOMB that colour is SO good on you !!!!!!!!!!!!", "rcollman": "🔥🔥🔥🔥🔥🔥🔥", "you.never.saw.me.here": "Beautiful!", "kieranblake": "You look stunning! Head wrap FTW 🔥🔥🔥🔥🔥", "enchantedpsyche": "That dress is dope!!!", "monst.ana": "You are amazing! And this outfit is 🔥🔥🔥🔥🥵💦👏👏💚💚💚💚💚💚💚", "queenaer_": "YOU LOOK FUCKING AWESOME AS USUAL! Btw, you and Eb are in ATL and I’m not meeting y’all?! TRAGIC 😢", "sembalicious": "You look gorgeous!! Amazing outfit!!! You fought well in replacing the negative thoughts by repeating your positive moto to feel love and acceptance for yourself.😌 Victory for ya 😌 And thank you for sharing this honestly with us 💜💜💜", "britta_kristen": "You look hot as hell! 🔥❤️", "halle_hathaway": "REIGN QUEEN, REIGN 🔥🔥🔥❤️😍", "cjpst19": "Beautiful", "simonelovesfitness": "You look stunning!!!", "anydaynowbirthservices": "Beautiful in all the ways ✨", "plantblerd": "You are KILLING that dress and that gele is your CROWN sis!! Thank you for showing us how strong vulnerability is! 💚💚💚", "squarestown": "You look incredible and your words are just as powerful ❤️🔥", "yveelicious": "🔥🔥🔥- don’t watch dem people - you look amazing and sure as hell hot🔥🔥🔥", "reinaprojectny": "You're radiant and insightful thank you for sharing your multitudes with us all 💜", "j.akeline": "you look amazing!!!!!", "longlivekadriye": "A look! 🌻🌻🌻🌻🌻", "stuzoclothing": "😍😍😍😍😍", "jmade_ventures": "First thought: that color is so beautiful! 😍😍 then I read your caption and was like - wow. It’s sad how harshly we judge others and ourselves... what you repeated in your head is the best way to fight it!! Constantly reminding yourself! To make a change it takes work, and you’re certainly working IT! 😍👏💪💪 inside and out - you are amazing!", "jbarajas17": "😍😍😍😍😍😘🔥🔥🔥", "truestbaduist": "🔥🔥🔥🔥", "dillsyrpickle": "You're a stunner!! 🔥🔥🔥", "krudd95": "This caption makes me feel so seen. You look amazing 😍😍", "reikijedikatt": "😍😍😍", "denisebug": "Looking glorious", "amongst_thewildflowers": "I have to fight my own internalized messaging and appreciate your vulnerability-honesty on internalized anti-blackness.", "ljchrystal": "You look amazing", "rey__hope": "true babe!!!", "shefixestheworld": "🔥", "srrockos": "🔥💯", "one_dope_chef": "Points were mad 💞💞💞💞💞 love it", "watnow76": "When I first saw you in this picture I was blown away by how amazing you look in this dress! I would never have the confidence to wear it and you, at least outwardly, looked confident and completely comfortable!", "rzcharlotte": "That dress is everything and it looks so good on you!! Gorgeous!! You’re so beautiful and your style is always so on point! Trust yourself, you know you have great taste 😊", "sunsandsweaterweather": "🔥🔥🔥👏🏾👏🏾👏🏾", "jewel_thegem": "You look incredible! This is a powerful post annddd know that we over here thinking “damn Ericka looks gooodtt”", "saskilluh": "thank you for sharing always ✊", "crumbbumcupcakes": "You look so incredibly beautiful! Every inch of you! 😍💕", "jodi_galvano": "You brought the fire & the smoke🔥", "tarns7": "😍💛✨!", "nlkaplan": "🔥‼️🔥 you are confident, brave and beautiful! Those colors and dress fit you like a stunning glove. Tell the judgmental eyes and harsh voices “you’re welcome to be graced with all of my fullness and fabulous AF presence” 🔥‼️🔥", "_hilit_": "I was a bartender at that wedding last night and kept looking at this killer dress! You looked beautiful", "typicalblacktees": "This is gorgeous on you!!", "thetuckypants": "Beautiful", "theblackplanter": "Ooowee. Those inner thoughts. I felt that. You look amazing and that dress is beautiful.", "fumeete": "🖤", "amandabritannica": "You look amazing (I mean always, but this outfit is 🔥💗)", "nataleh": "My first thoughts on seeing this picture 🔥🔥🔥👸🏿😘", "jazzmynejay\nVerified": "Verified", "tresjolie3": "It’s a beautiful dress and you look amazing in it!💕👸🏾 Navigating spaces like that can be so exhausting.", "kadiesurri": "You look strong & beautifully curvy", "chadrific": "it is funny cuz i thought 'i wish my boobs were small enough to pull that off' cuz all i see is just an amazing black woman and i 😭 also your legs look fucking sick in this dress i do declare", "violadielola": "alll I thought was when I looked at the Pic, before reading the caption:WOW. what a beautiful human, what a magical dress, what a stunning body.", "cycleseeds": "💗💗💗💗💗", "lauralynnleonardi": "❤️😍❤️😍", "kristinbasanta": "🔥🔥🔥", "kalonartsandyoga": "Gorgeous ✨", "sassy_sheep": "I love your look! You look so gorgeous and powerfull! 😍", "bazschmaz": "Fire fire fire", "justgazing": "🔥🔥🔥🔥🔥🔥🔥🙌🏿", "tinamendezb": "You look great!! Love that green", "doulaalexisyogimama": "We are our own worst critics. I think you look beautiful-I’m glad you wore it 💚", "mishmomeeshrishpuju": "...and yet I absolutely love all of your looks. How about we make those positive voices come through louder and stick 2 fingers up at the rest 💜", "elle_simone_scott": "I understand EVERY PART of what you’ve described above. You look great tho. Without exception. 😘", "amandakhiri": "Deva Mahal’s twin... thank you for this pic!!", "ineskapop": "Beautiful💚💚💚🥰🥰🥰", "lizvitale": "💞🙏💞", "tinyhousephoto": "goddess. ✨✨✨✨✨", "alexandras.light": "I love these colors! Your fashion sense in incredible!", "queenankh": "You look fantastic, that shade of green is amazing on you", "giorgiapeachy": "You look so lovely and confident @ihartericka I’m sorry your internal dialogue tried to mess with you. ❤️", "siobhanthedreamer": "Green is your colour, you look great!❤️❤️❤️", "muonja": "You look stunning 💓", "mynewdentist": "You are changing the way for everyone...including yourself...❤️", "brandenhayward": "The internalized self judgment is a real effin b*tch. Thank you for being real about that. You’re admirable and inspiring.", "jbaybay29": "Before I read your caption I thought wow you look amazing and I love that color on you!", "kerraq": "❤️❤️❤️", "karwitha_kirimi": "I gasped when I saw this, gorgeousness", "kwharas": "🔥 ✨ you fine as hell in that dress", "jonesingforgoodbooks": "You look incredible!", "issatrae": "Glow & show 😍🤤", "futurepau": "🔥🔥", "jasxlovelace": "So gorgeous & makes me wanna wear something similar! I love it!!", "mayflowertheseries": "You. Look. 💣 💣 💣 No gassing up - simple facts 🙌🏾🙌🏾🙌🏾 @ihartericka Scrolling down, all I thought was WOW. I never would have guessed what you were going through in that caption", "maryjanek90": "Pshhhh fuck all the haters that weren’t in awe of your beauty and this bomb ass outfit✨", "blacknerdgoddess": "Everyone was looking at you because you looked GORGEOUS!!! 🔥🔥🔥🔥", "normalpersonontheinternet": "♥️🔥👑", "laurabaran": "❤️🔥🔥🔥🔥", "kazejewelz": "It all also comes down to wearing confidence. You said all this to still look good in this dress. You’ve walked runways topless with or without these same glares and bombed 🖤 with your story it’s normal to have these feelings sometimes, but moments like these are reminders for your archives to continue. Please ✋🏾", "brutusbakeshop": "This honest vulnerability is love. So beautiful strong and tender xo❤️", "sunrisehibiscus": "And I was thinking, Damn, she's fly. That's her color!", "the.sacred.self": "Absolutely radiant ✨", "jmend64": "Truth: I stopped scrolling to admire how hot you looked! 😍😘", "talesiya": "🔥🔥🔥", "emjay_will_": "You look amazing Queen 💯.", "biggs_universe": "You look great. 🤩🤩", "christaniadm": "💖", "fullofbrightness": "😍", "masleysa": "You look amazing in this outfit!", "erkellerman": "Pls make a fashion account or something I’m so in love with u & your outfits!!!!!!", "_mackenziesullivan": "It’s a whole fucking look and I love it", "ginita_la_nanita": "💜💜💜💜", "oshun\nVerified": "Verified", "confessionsofaplantlady": "So much of this. The conversations in my head, every time I put something on. I felt this so much. You're awesome! 😍😍😍 👏👏👏", "ree.vuh": "you look amazing as always 🤩", "mellytor": "You look amazing!!!!", "morgzelliott": "I cried a little from how beautiful the entirety of this post is. The voices are hard to work through, cuz sometimes they come from people who were/are important to us. Either way, that's my one cent, the other one is still a little weepy. ❤️", "juliablike": "🔥🔥🔥", "urlocalnymphet": "This is one of your best outfits yet 🧡", "s_pann_a": "So stunning 🙌"}