{"aloejooneatsdirt": "🙏🏽🙏🏽🙏🏽", "starrs.priv": "❤️", "slothpromises": "Love this! 🐦", "laurentrouble": "🙌🏻", "mcintyrespirit": "Thanks for all this info!!!", "honeybluclue": "@finessabuxtable killin it, always.", "jt.shinigami": "13. is quite excluding of aspec relationships and emotions, such as Quasi-Platonic relationships and squishes. Those are often renamed into Bromance and Girl Crush. Don't erase a whole spectrum of orientations, please. I agree with all the other points, but I notice none of these orientations were included anywhere else, but the ways they often manifest as were degraded into \"homophobia\". There's can be a bit more between humans than love and hate, so I'd really appreciate if you'd rephrase that, so that people on the asexual and aromantic and the relationship and feelings they have aren't made to look like homophobia. Please read up on those orientations and alternative relationship-forms before you judge them like this. It will only cause actual aphobia from the allosexual spectrum, while Quasi-Platonic relationships, regardless of how the participants chose to call them, do literally 0% of harm to anyone. Thank you. ❤️", "emmaeatsout": "Please explain point 4. Thx", "krsp_ce": "when you visit the UK next week wil you be doing any other event besides the @galdemzine one (couldn't get tickets) but would be epic to attend another event while you are her in the UK", "morsmugen": "21. You can still have sexual attraction within having sexual urges or the need to engage in sexual acts. Attraction can be based on physical appearance, intelligence, body comfortability, emotional/ mental support, trust, scent, and pleasure foreshadowing. Any combination of these or the presence of none doesn't mean you are flawed or broken. Preference is consensual", "simonelovesfitness": "A whole lot of ass 👀 lol", "glitter_robot": "#5 No.5 💣💥 #ChrystulKizer 💣💥", "the_sensual_sage": "Also #20 don’t know many black poly ppl 😔", "awkwardapostrophe": "Thank you for #13 the concept of people having “girl crushes” or “boy crushes” is so silly. Just say your sexuality is fluid and leave. I realized when I was like.. 13 that all of my girl crushes was just me being a flaming bisexual.", "lemonbottlewolf": "What does eleven mean, please?", "pastry_ranger": "Thank you!", "cancer_dr": "@ihartericka that Green though!", "iamellenasupreme": "Amen 🙏 and you look sexy girl you better get it!", "iam_malikhogan": "❤️❤️😍😍🔥🔥", "terrinaisawayoflife": "Green is the word💚💚💚💚👌🏾", "belizeanvegan": "❤️❤️👏🏽👏🏽👏🏽"}