{"oftheflowingair": "Is it ok to repost in my story with credit to you? If not, absolutely fine. Thank you even for sharing this, it is so difficult to say.", "samanthology_101": "Honestly, just wanted to come back to this post to say, Thank you. I am a sexual abuse survivor, and I realized I was putting the success or “goodness” of a rapist before his victim. Nope. The system failed that girl, and he should have never played another day of ball, without a full rectification of his transgressions. No man should just keep on going, and be applauded widely when he used his power and influences to cleanly sweep an entire rape underneath the carpet. That is what’s sad! And the system that enabled him in doing so. The lawyers, the media, the publicists that worked around the clock to make this a blip on the radar. Who helped her? Who gave her counsel on how to make her voice heard? Her truth believed? Where was the team of people in her corner? That is what’s sad!", "billieeyelash1234": "Thank you for being brave and speaking the truth about him being a rapist", "missangierosie": "THANK YOU.", "emmelecos": "Thank you", "janesca98": "thank you!!✨", "kate.sessions": "I am baffled by the complete omission of the rape by almost everyone posting about him. Yes let's acknowledge the whole person. And also the survivor's blood was on his shirt, she had lacerations verified by a doctor that were \"not consistent with consensual sex.\" He paid her $2.5 million. Why can't we mention that alongside everything else? All these people I respected are glossing over it...thank you @ihartericka for being you 🧡🙌", "kyra4pres": "This may have already been said. \"Healing isn't linear.\" It doesn't happen via being wrapped in pretty package with a sparkly bow. If @ihartericka's healing requires that she speak her truth in this way, that's not everyone's biz. Plus it's her page. She doesn't owe anyone an explanation of what's required in her healing process, as a victim of sexual assault.", "fortheluvofjah": "I also noticed it's mostly white women under this post saying thank you for being able to put their emotions into words... I find it ironic because we live in a country where historically white women have been allowed to lie on black men after consensual relationship that have often led to black men being imprisoned wrongfully or outright murdered in some cases... yet here we are... Even when a man accused was not found guilty of and the white woman who accused him was found to be a lie and admitted to blackmailing... some women lie...", "memofag": "The woman dropped the charges against him, he was accused, not convicted. Grow the fuck up and let others mourn you self absorbed spineless twats", "thiccniek": "Can someone explain?I don't get what sexual assault has to with kodes death?", "sharonyoubani": "I thank you.", "oda2k": "Black people can never Rest In Peace", "threeminkrugs": "Time and a place for everything. Its not about you today and thats ok", "gollipt": "I had no idea he was accused of anything. I was only a few years old in 2003. Interesting.", "leo_k4l": "Imagine thinking any1 cares", "kevin_g77": "At least wait until he’s buried to piss on his grave smh", "fraufrasl": "Thank you ❤️❤️❤️❤️❤️", "chiquititanica": "The fact you can look up the case and find the statements of physical evidence and PEOPLE STILL are defending him ?! The victim was bruised, had vagina tears, and he only confessed to it when they found his semen inside her. He confessed it to “consensual adultery”, no that’s not consensual. Dying an unfortunate death doesn’t make you a hero.", "moniquechantele": "👏🏽👏🏽👏🏽 @erikmarquez15", "liz.samis": "Thank you!!", "becca_boo252": "very well said, and thank you for saying it 👏", "tushal.815": "“Someone ACCUSED...can be triggering” Yes ONE accusation in 2003 of an encounter that did happen but Kobe said was consensual in his perspective, but the accuser said she didn’t perceive it the same way. People seem to assume it was a case of rape when it was dismissed in court and a settlement was reached. It was the same man who loved family, his wife, and daughters , empowering women’s basketball and wanting his daughter Gigi to carry his torch. Although respectfully done, I believe this it is inappropriate at the time to condemn public mourning so people don’t get “triggered” about a global icon who meant more than his game. One accusation of a legend imo 🤷‍♂️🤷‍♂️", "ashleyplatz": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "rebeccabreezyy": "well said.", "rorolozano24": "Thank you", "karon_97": "I hate social media.. Always has to be someone pissing on someone else's grave. Couldn't even wait a few days.", "linje5smilet": "Thank you!", "thepillowtalkofbirth": "Thank you ❤️for speaking up for all!", "shanti0224": "Thank you for this ❤️", "thelindsaywolf": "Thank you @ihartericka ❤️", "chelleorc": "Honestly who I thought of first...", "mothafuckinlust": "She settled for 2 million and dropped charges she didn’t want to raise awareness for his actions she wanted his money. Nobody deserves to be pushed or forced into anything ugly like rape but also no real rape victim would settle for money instead of taking him down and making him responsible for his actions. Her story was a lie and so is this post.", "anj_video": "it needed to be said", "starr.marguerite": "Thank you for writing and sharing this. I really needed it. 💗", "natecraig__": "Clown move fr, literally bro even two days after his passing with the whole world still mourning and u think this is the time to bring up these accusations? Let people mourn, and he’s honestly been an advocate for everything in women’s sports. Paint the full picture if you gonna claim to paint one", "anderwills": "Congrats to Kobe for a life well lived. For his foundation and numerous philanthropic endeavors. For raising 4 beautiful daughters, and for being an inspiration to millions.", "doggerina": "This is beyond disrespectful. I lost a partner in 2002 and the comment that has always stuck with me was the “friend” who said: “I don’t know what to say to you I never liked him.” Condolences are for the living! If you’re pushing an agenda or calling attention to your own trauma the sentiment is not one of condolence, but of your own unresolved issues.", "carmenmarissa": "Thank you for this👏🏾", "beerzmom": "Survivor here — my abuser is a professional athlete. thank you for putting my feelings into words", "nickgeramita": "Buuuut wasn’t it discovered that she lied? Therefore nobody is mourning the death of somebody who was accused of sexual assault, right?", "dwestmenow2": "He agreed That it was consensual but never that he raped her. The case was dropped completely because none of the physical evidence stood in court and she THEN began a civil suit. What lies was he caught in exactly? Because I only READ about the lie where she claimed he ejaculated in her and that was later found to be a lie also. Any woman who has experienced true assault will never be just satisfied with hush money. They would want complete justice. She dropped the criminal case, sued him civically and moved on. In my heart of hearts, being a victim myself, I don’t believe he raped her ever. You believe he did. Our opinions are different and it can rest with that.", "kristof_reygel": "Thank you for sharing this", "judithcherr": "He was loved by many; fans, fellow athletes, friends and family! You can Never take away his accomplishments! The legend and one of the best athletes of all time! No accusations can never take anybody’s accomplishments! Blessings, peace and love! ❤️🙏🏾", "enchanted_but_not_amused": "@ihartericka Thank you for your post. I felt super conflicted and confused yesterday because I was so triggered seeing the glorification everywhere, but I also felt heartbroken for the precious children who were lost and the families left to mourn. The icing on the cake was when a \"friend\" told me yesterday that my expressing that I was triggered seeing and hearing about Kobe everywhere interfered with her mourning ... Being invalidated for feeling the way I feel based on past trauma and trauma I am living with every day now was pretty awful - I am not judging anyone who is mourning - we all feel how we feel. I wish I could turn pain and trauma off for everyone hurting in different ways because of this news. I am just glad I found a safe place where others are also articulating what I am feeling.💗", "xxshibariprincessxx": "🦊", "ali_gramz": "Thank you!!! Why is no one else saying this? Why do people become saints when they die? Most people are not all one thing - saints or sinners. That is an uncomfortable truth about being human that we should be able to sit with but it seems everyone’s either a deity or they’re canceled in our culture today. And it’s a shame. In Kobe’s case it robs his accuser of her truth and it also diminishes his memory because to paper over his transgressions robs him of his humanity and his path to redemption", "aprylelectra": "Thank you for putting this into words. I needed this", "enchantedforrest": "For those who feel uncomfortable by the post, Jill Filipovic's article \"Kobe Bryant and Complicated Legacies\" is a worthwhile read. \"..it is for exactly that reason that there is no disrespect or invasion of privacy in insisting that the inconvenient parts live alongside the admirable ones, that the ugly is neighbor to the exquisite.", "akayla_reid": "Thank you 💜", "thebutcher7": "You support MLK right?? because I saw you post him. Hypocrite", "lulutenant": "Thank you for sharing this. That case was horrific....", "shishkotob": "you are a light in the darkness ❤️ thank you for having the courage to post this", "juelza": "Key word Accused I could accuse anyone of anything doesn’t mean shit The charges were dropped ya donkey Drop this dumb post", "rainbowwwaters": "Thank you ❤️", "caitlinflynn": "Are there any survivors who would be willing to make a group chat to support each other through this? I’m having a really difficult time watching people I really respected and who were very vocally supporters of survivors get very actively angry at anyone who dares to bring up his past or his full legacy and really dismiss survivors for their own postured mourning of someone they didn’t know. I’m really struggling with this betrayal and have been in a really bad place for the last two days. I’m sure I’m not alone (at least I hope not!), so please let me know if you’d like to create a temporary supportive chat", "haleyroseminella": "Boooooooo", "imanimoree": "I’m a survivor. I don’t agree with this post BUT everyone is entitled to their opinions. Differences in opinions are how we as a society make progress. Don’t judge how or what others grieve. 🖖🏽", "nehavr": "🙌🏽❤️💕😘", "nathan_holcomb": "Lmfao. Not the time or place to announce sexual assault over a family that literally just got torn apart. Especially the fact that the ringing of sexual assault overpowers the loss of an icon.", "littlebearjones": "@mastinkipp", "cassotron": "Who people are in private can be very different from their publicly constructed image, clearly. Many of the people memorializing KB had complicated relationships with him and in times of shock and grief, the bright side of that person becomes mythologized. I think this post takes a moment for the person who has spent 17 years being brutalized by the experience and it’s effects is kind and considerate and I thank you for it. You were definitely more eloquent than Ari Shaffir.", "r_jules_k": "❤️❤️❤️", "omgeeestephy": "I hope y’all hold abusers like Lennon and Bowie to the same standard you hold for Bryant. John Lennon was known to be a domestic abuser by both wives, and Bowie was known to take advantage of younger girls during parts of his career.", "summerfire_of_the_pdx161": "#nosympathyforkobe", "cozyqueen_": "this is shady...as fuck", "mynameisrumbie": "I thought I was weird for feeling some type of way", "alisonwuzhere_": "You did THAT", "lea_pomme_": "Thank you for this @ihartericka ❤️ today was a made a little easier by you making me feel validated and understood", "yasmineavanza": "This is extremely disrespectful to his family. I mean it’s just so wrong to say something like that at this time. Can’t you just focus on the fact that he is a person that just died with his own daughter and that now his family, his wife has to deal with posts like this? Isn’t it enough for her to loose her husband and her daughter? You say you stand with survivors and that people disagreeing with you right now don’t but who are you to say that? Who are you to say where a person stands on such an important matter? I think you all need to stop posting everything that comes to your mind on social media because yes you’re free to do and say whatever you want but if you’re not even going to have at least a little respect... Also I just hate how everybody think they can talk about other people’s story. I say this as a survivor that cannot stand people telling me how and when I should tell my story. The only person that I could tollerate saying this right now is his victim. NOBODY ELSE. You say you stand with survivors but did you ever stop to think maybe the last thing she wants is for people to bring up that moment of her life? THINK BEFORE YOU TALK ABOUT MATTERS THAT ARE BIGGER THAN YOU", "elisaelena": "🙏🏻", "aliciaswiz": "💜💜💜", "missbettierage": "@theguerrillafeminist Of interest.", "xiggi_starrdust": "Fuck this page. That girl never showed up in court and apologized for her accusations, that’s cause she was looking for a cash grab. Quit using other people’s tragedies to throw shade and to feel better about your insecurities. Kobe didn’t rape you, nor did he rape that girl. Get of the pitty pot with this victim mentality. None of you victims are ever going to heal with this behavior.", "irishem333": "Thank you. ❤️", "boy.course": "This is very important", "bigstinc": "Everyone here is so ignorant. What is wrong with you self-righteous idiots.", "tall_guy_official": "Too soon, but needed none the less", "sgshaugh": "@hannahnowi", "tinyavocado": "Coulda been two separate posts, thought the second part was going to be empathizing with survivors.", "nunn.chucks": "Thank you! I’ve been feeling uneasy about these pictures all day.", "kittykako93": "❤️", "iamjodi_c": "I knew nothing about this, I hope they are ok", "deenaoh": "Thank you for this.", "californiarightwing": "We know radical left doesn’t support due process. Prosecute the accusers.", "alecgooding": "Y’all are retarded", "balancedbalayage": "🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼", "_b_yee": "This post stinks. Absolutely rubs me wrong. And totally unnecessary.", "bellabird_sings": "Holy shit I had no idea", "shery_william": "Can sb explain this to me", "pmeynig": "@ihartericka I can’t believe some of the responses and hate coming your way! Do people not know or understand what he did? And people die EVERY day! Just because he is who he is we should mourn?!? I think not! Let’s mourn his daughter or his family/wife. Thank you for being honest and truthful! World needs that right now, Love! ❤️❤️", "niagrs": "❤️", "stephwigney": "@bburgess95", "goth_cutie": "This is disgusting", "itsacookieitsacat": "The me too movement is sad and pathetic. Just a bunch of desperate women grasping on to anything they can to ruin a man's life and legacy. Fellas be careful before you fuck a bitch, also make sure she's not left leaning at all.", "cb_gwinn": "❤️", "junibergman_": "Thank you so much for this❤️ I’ve broken down multiple times today do to panic attacks, I’ve felt so unseen etc. I really needed to see this. From one survivor to another, thank you❤️", "kpietiger": "Thank you", "milnehome": "Shut yo fatass up, ur a clown, all I hear is whining from u bitch ass", "orellemagnani": "I’m a feminist but this crosses a line", "claraswanmusic": "thank you for saying this so elegantly ❤️", "ragalindez": "\"Classy post\" looooooool", "mike_da_grrreeeaaatttt": "what's that?", "bayleaf555": "Thank you for this. Encompasses what I’ve been feeling. Grief is complicated sometimes. 💜", "jaclavalle": "Your latest tweet is incredibly inaccurate. There is no appropriation being had in regards to acrylic nails and baby hairs. People from all walks of life for CENTURIES have been wearing fake nails. It is not something owned by one race or another. As for the baby hairs, how are you going to tell white women (🙋🏽‍♀️) with curly ass hair that they can’t lay their edges because “it’s black culture”?", "kelleyjordan": "Thank you thank you thank you", "the_fork_lift": "Man and his daughter died. He was accused and never found guilty of anything. 2020 is a wild place to be I’ll tell you that much", "x_x_x_wife": "Thank you for posting this. I think survivors feel like islands during times like this. Having someone be brave enough to speak out means so much", "citysubject": "💜💜💜", "jayrk72": "I will respond to your hate and attention seeking with peacefulness by continuing to mourn KOBE and his daughter along with the other passengers that passed away. #RIPKOBE", "starazia": "You’re sloppy, Ericka. Very messy. No buts there.", "50waystofightburnout": "Thank you for posting this and acknowledging that these emotions do go together and make life very confusing at times 💕💕", "oaktreewren": "Thank you for saying this!", "gab.delorenze": "Thank. The. Lord.", "swade.mmlv": "You probably need another lesson in respect and probably a dictionary. ACCUSED, especially by questionable “victim”, doesn’t mean that person did it. It’s kinda like if I said you MIGHT have been assaulted. Have some decency and find another way to push your agenda.", "kyngjae": "Wtf is this shit", "chevonnes.place": "🙌🙌🙌🙌🙌", "tazzatamatar": "Thank you for this.", "chrisawilson3": "The man was never convicted of any crime. I have sympathy for victims of sex crimes, but please don’t use this as an opportunity to throw dirt on a dead man’s name. It is incredibly disrespectful and hurtful to those that knew him and cared for him.", "yasminthemachine": "💗💗💗", "sulphur_spring": "Wasn’t he acquitted", "alexaaaaluv": "Yes their death was tragic!! But shit PTSD is a never ending tragedy . Lets not let that get over our head.", "keeshlo": "I didn’t know any of this but it seems like almost every man on the planet is guilty of some form of sexual assault. I am a small voice - not a celebrity or influencer - but I think this post is very strange . Is it accusing ? Or apologetic? Or a way to blacken his name at the time of his death? Wow just wow the shit people put on here", "hunter_kranmas": "this post is descusting, and then after ppl call u out for what YOU did u cry and play victim. GROW UP, the world doesnt revole around you. Just let people morn over the death instead of pushing ur own agenda, u fithy trash of a human being", "ajbuck94": "I feel this sooooooo hard. Thank you for sharing.", "alexandertoppo": "Fuck off", "psychestretchmarks": "@ihartericka I love this post. I’ve been waiting for a post like this. One that validates and names the trigger, and also respects the loss. Thank you.", "lucca.gsmith": "One of my favorite people saying what needs to be said. I never doubt that you’ll stick to your guns despite what people might say. @ihartericka thank you. ♥️", "lilykolar7": "Thank you so much Ericka", "jellynotjilly": "This is perfect.", "rylyat": "May I share this to my story with credit?", "bertolucas": "Nah this ain’t it , you reaching for sure", "michael.kungl": "This isn’t it , disrespectful...", "adaptogenictantricvehicle": "Feeling super triggered", "cloudy_curls": "Thank you to everyone here doing all of this amazingly eloquent and articulate emotional labour trying to explain what it’s like to be a survivor in this moment in time. Your work is valuable and bold and brave and I thank you. And don’t forget to disengage and practice self care. There are people here saying nasty things that don’t need to be here. Take care of yourselves. You are amazing brave individuals. Thank you for this post and thank you for your work. 🎈", "haleyandwolf": "Thank you for sharing 🙌🏻 I feel the same exact way and I’m so glad I’m not alone 💕", "sisterharvest": "Love and appreciate this❤️", "tiffanygroben": "Thank you for sharing this. I needed to see it. I needed to have space held for my triggers. Yesterday was a complicated day. I was heartbroken for the Bryant family. And there was a mix of triggers that also came up", "rose_raine": "All the mourning of this guy is draining. I didn't even know who he was but have read about it and wish I hadn't bothered. I feel like some things have changed since 2003 but still not enough that the discussion and debate still has to happen. The sickening fake RIP social media post from celebrities who should know better is just ridiculous.", "gothboyzues315": "Wtf? @denselbarnes bruh this why white people shouldn’t control black news", "dxjackson_": "The complexity is, not every woman that claims sexual assault is a victim of sexual assault. The woman in this case was proven to have lied and admitted to the intented blackmail. History can be tricky in we can choose to remember the bits that serve us. I understand your intent, and even in graciousness, it is deficient in full truth. This is your page and you can educate as you see fit. Unfortunately, there are many that are unfamiliar with this that are now spreading misinformation. I just offer a friendly, unsolicited critique.", "asthasri17": "This is great. Kudos to this post! More power to you 💖", "ktimes2": "Public mourning by people who are outspoken allies of the oppressed. Of women. Like @lisalingstagram and @jemelehill. Even @Kaepernick who can’t get work after kneeling in peaceful protest is sanctifying a man who got work after committing a rape. I believe Kobe could be two things. A boy who committed a rape and a man who became a good man. But to have it erased by so many is for sure difficult.", "vika.eyer": "Absolutely", "eroticren_aryn": "Thanks for writing this. I am a survival and this has felt super unsafe and brought up some really complex feelings. I think you really embodied this in this post and made me feel like less of as asshole for feeling mixed about this.", "ksslaughter": "Thank you so much for posting this", "fromapt.69": "I was definitely having mixed feelings on this. Thank you for articulating this in a very clear way that still respects their deaths. Just because he/we were silent about the assault for years while he was winning games, doesn’t mean that the assault never happened and the people effected disappear. I love this thank you 🙏🏿", "emelem": "Thank you 🙏🏻", "fnbg.osunny": "People are bashing this comment AS IF we dont teach our kids that the life you live and the people you affect while you're alive will still have an effect even after you are gone! That man is a legend and purposefully became one so he knew every action he had has ripple effects if after he has disappeared. Like the rock in the pond. So, YES we send our condolences to the family but on the flip side, if we are going to talk about Kobe and his life, then you have to talk about ALL OF IT.....him being dead does not rid him of his life choices.", "lookalive1999": "💜", "ohmeohmymel": "I read this post before bed and thought about it again this morning... this is the most thoughtful approach to the situation that respects everyone possibly involved equally. I’m so impressed with how these two comments can coexist. I love your work.", "_willpowr_": "Your fried... She was a schizophrenic who admitted lying about multiple instances of the night, she had another man's Cum on her panties at the rape exam and she refused to testify. If you think Kobe Bryant has to rape someone your living on a different planet than the rest of us.", "withlove_sharkey": "I thought it came out that it was consensual though?", "thingslikememes": "You’re a bitter, disgusting, ignorant dog for these comments", "revjuliaroth": "Thank you ❤️ I was so triggered all of yesterday and dreamt about my own assault last night. It’s such a complicated thing, for someone who is such a basketball legend and icon who has inspired so many. I don’t want to police anyone’s grief. But I did feel “wrong” for being triggered. So thank you.", "realmikkipedia": "❤️❤️", "annaleepercuoco": "Ive been thinking through this all morning and I think the reason it bothers me is as a woman and mother. This lady just lost her child. She undoubtably had complex feelings about her husband. But either way she lost two people that were her family… And I’m sure her daughter was everything to her. I can’t imagine how she must feel and this post seems very disrespectful to her and her grief. However I also feel that I can’t imagine how sexual assault survivors must feel when People accused of sexual assault are glorified in this kind of way. So perhaps a post saying “ check on your friends because when this happens it’s traumatic for survivors of sexual assaults.” And leave off the last part? It feels inconsiderate of Vanessas feelings and grief which honestly feel like that matter ALOT and aren’t really being prioritized here.", "lemontomatocutie": "BECAUSE WE WANT TO FEEL THAT TRAUMA RESPONSE EVERY TIME WE SEE HIS NAME?!!! Damn! Good/bad/celebration/obituary, our first reaction is we WILL feel triggered to seeing his name and face. Whether or not he did it. That stabbed-in-the-gut feeling or that all-the-wind-knocked-outta-ya feeling will always come first. This has nothing to do with holding the grief, including our OWN, for the nine innocent individuals who passed away tragically. @ihartericka is creating space for EVERYBODY today. If you STILL don’t understand, keep your mouth shut and thank the universe you don’t get it", "thefake_tizulu": "You know I love the way you came with your perspective for those who matter. I am suppose to be off social media right now because of the masses continuation of avoiding the truth about their “hero” as a survivor it be hard like damn y’all don’t give a fuck about us. But you know, post like this help me feel less alone and allow me to be the love and light I am. Sending you hella love and compassion straight to you ❤️❤️.", "paulandoates": "Turning the death of 9 people into an opportunity to drag one of the dead on an accusation that he was cleared of is a cosmic low for social media and basic human decency. Pure narcissism.", "andreaambam": "This is really important. I also think it’s important to remember that idolizing Kobe spans across so many generations some of us didn’t even know. I had to google it yesterday. I had no clue about his sexual assault case- I was 8 years old in 2003. This post taught me a lot. Sending peace to survivors.", "megalini_kay": "I hope you are ok today @ihartericka ❤️❤️❤️", "heathergabel": "👏🏽👏🏽👏🏽", "gersacegersacegersacegersace": "😂😂😂", "worksmarter_1": "That man was found not guilty by a court of law.... Smh there’s always one.", "glowbirthandbody": "This is important. Thank you.", "_hannahcandace": "Thank you for this post as a reminder of those that need comfort at this time. This got me together real quick 👏🏾", "saagar_dulani": "This is disgusting. How pathetic of you to try to shift the focus of this man’s death from celebrating his life & accomplishments to trying to disparage his image for an accusation against him for which HE WAS NOT GUILTY. It’s disgusting and unjust how people equate the accusation of assault with automatic guilt despite someone being acquitted of the accusation. An accusation is not equivalent to the truth. And when an accusation is false, the branding of rapist still sticks with the accused despite being innocent; it’s disgusting for you to try to perpetuate this cycle with your post. It’s completely inappropriate for you to bring up that part of his past, especially when it has already been reconciled and especially at this juncture in time (though it should never be brought up anymore at all). Just disgraceful.", "shivam_2210": "@ihartericka can u plz explain me that your this post, you use the word “accusation”..if you are so sure it was rape, then why did the survivor withdrew her case from court and accepted money from kobe despite very well knowing that if a person could do that to her, then he could do to others also..where was all such victimasation when she accepted money..i know survivor must have gone through a lot, but if on first hand you allow a person to get away, and then play your victim card on accuser’s death..then i think that is wrong on your part", "_cactus_m.j._": "omg im ashamed to say I honestly didn’t even remember this because I have never followed him closely, thank you for saying it in such a way as to not disrespect anyone. Ok if I put the post on my story?", "wolverinemother": "From one Ericka to another, survivor to another THANK YOU. I felt like I was unable to express frustration over this but you had the courage to say it. I’m really glad someone did. ♥️🙏", "suzanneforbesartist": "thank you for saying this.", "cmbaxtergram": "👏👏👏", "_amyjae_": "Thank you for this. I even questioned my memory of this instance. Like, did I make that up? That’s how good society was/is at protecting those in powerful positions. I’m heartbroken all over. Sending out love & light to ALL folks hurting. ♥️", "cosiho_m8": "💕💕💕🌱🌱🌱", "evilempire74": "innocent until proven guilty", "nuriaperea": "Thanks for showing another perspective and for the courage 💜", "kath_kc": "Thank you. My story came out at the time of Kobe. It sent a very clear message that survivors would not be believed. My feelings about what happened and who did it have been dismissed so many times that these events are triggering. I understand your post so deeply. Yes, love to the Bryant family and all of the families who lost someone. Love to all us who are reliving our own personal experiences after the potential trigger♥️", "sarahshaugh4": "Thank you so much for posting this . It’s hard not to believe he did it when taking in all the evidence. Especially since people rarely lie about rape. Why would a woman want to accuse a celebrity of rape for “fame”?? All it ever gets the poor women is hate mail and awful defamation of their character :( it’s been hard for me to see the over the top reverence for him. As it is with every other man let off the hook for being famous and male. Anyway. Just thank you. This is a light in the dark.", "schiou": "Thank you", "rudranibanerjee": "Thank you for this incredible post! ♥️", "rebecca.raynham": "❤️❤️❤️", "mlilo.mpondo": "Was he charged for sexual assault", "judithkln": "Thank you for posting this. It meant a LOT to me.", "kell2017insta": "I literally back tracked to find the original poster because I'm so thankful for this post. And your response regarding the \"but\" response.", "kristenodwyer_": "Needed this. Thank you thank you", "body_mirror": "💛", "theerica": "Thank you for this 💜", "mykeydenise": "❤️❤️❤️", "attb17": "This clout chasing and self righteousness is insane", "blaqmoonmami": "I thought I was the only one who remembered the hurt he caused. Ive been struggling with trying to look rlly sad for his passing when ppl bring it up, but Im mostly just sad for his wife and daughters you know...", "brockwest_3": "When you try to appease everyone and end up saying nothing 🤦‍♂️", "kingpaigexiii": "I’m a child molestation and sexual assault survivor, who comes from a family where rape by grandparents was and IS the long standing secret and a burden too heavy to bear for me. and I gotta say....and this is no reflection on you, but I find this post and whoever wrote it grossly inappropriate. Aside from the fact he was acquitted and the woman admitted she was lying, it’s enough to stop throwing the allegation at him. But greater still, the man JUST. DIED. His 13 year old daughter JUST. DIED. Their bodies aren’t even a day cold. He’s got three girls who lost a dad and sister. His wife lost a husband and a child - at The same time. These sorts of posts are inflammatory and just inappropriate considering the timing. He was a legend. Let him RIP", "_luke_mcgregor_": "This is why women shouldn’t be payed equally bruh imagine attacking a man who inspired millions and touched many on a different level. Man he was only 41 he was way too young to have passed and his daughter too before posting shit like this think about his other three daughters his wife and friends and family you fat heartless bitch it’s an accusation and he was proven innocent in a court of law and she admitted to lying leave his legendary name out of your shitwhole tweets and shitty page", "chee_is_god": "How can it be triggering da fuq", "laurakonkin": "thank you thank you thank you", "caitlinmcphee": "I’ve been saying this all day, love this post. Thank you ♥️", "mrgrtmrph": "LA is an extremely triggering place right now, it is uncomfortable and I appreciate you saying this publicly.", "sweatbeforesunrise": "Thank you for this post. 💕", "daisypenman_": "Thank you so much for this. It’s made me so uncomfortable but don’t know how to bring it up with friends. These are perfect words x", "chezzabellah": "Humans are complex and can and usually are 'good' and 'bad' simultaneously. And his privilege allowed him to get away with rape with no jail time. But the example he displayed since then has been immensely positive. However the system that allows for privilege to get away with harming women HAS TO BE DISMANTLED. 🙏🏼", "alannajones": "Thank you ❤️", "uyioghosa_nkem_oh": "Extremely callous to profit off the grief of some to seemingly assuage the grief of others. No one wins here, this is really low.", "lovebabeee67": "Disgustingly tasteless nfs.", "kethysk": "While I understand the purpose of her post and her stance, you can't send the Bryant family a sugarcoated slap. It just doesn't work that way. The beginning of that 2nd sentence is like adding an emoji to a very serious conversation, to soften the blow. She should have excluded the Bryant from this otherwise just post because I doubt anyone in that family in their right mind would accept it. Believe the victims of sexual assault, yes. But leave the mourning families out of it. They deserve better for their loss, no matter the hidden monster.", "svm31": "The adulation has been tremendously triggering. Thank you for this. 💓", "queertheodosia": "thank you for this. i wanted to resist these sentiments coexisting because this day has been fucking triggering, but thank you so deeply. this soothed something in me that i don’t have words for. thank you. 💖", "e973t": "ur a pos", "aliciasea123": "🤦🏽‍♀️🤦🏽‍♀️🤦🏽‍♀️", "hippie_katexox": "I wholeheartedly agree with this post, however I would make a special announcement for the daughter Gianna because she actually hadn’t done anything wrong and I don’t want his name to cast a shadow on hers 💕", "unofficiallyruby": "I’ve been trying to find a way to express how I’ve been feeling about his death and you (as always) have worded it perfectly. Holding space for the survivors and also sending love to the family that have lost two members x", "booklybritt": "Perfectly said. I also appreciated Evan Rachel Wood’s tweet too. Thank you for sending this out!", "rachelle.lanae": "Thank you for this❤️❤️❤️", "maruskaalbertazzi": "From what I know, he was never proved guilty and the woman who was supposedly assaulted refused to testify. That’s what we got in the news here in Italy, maybe I missed something.", "emotionalbabe": "Thank you", "audaboo": "A friend told me today that im negative and only talk shit about people because i posted about what he did. Holding someone accountable is not disrespectful. You can acknowledge what someone has done and still recognize this is a tragedy. sending love to victims rn", "eemiiiillyy": "THANK YOU!!!! Hearing everyone praising Kobe while I was out today, after being told what he did, was so disheartening. That young woman was threatened with death if she didn't drop charges and people think he didn't do it just because the case was dropped. Case dropped doesn't mean shit, nor does a not guilty ruling.", "jerellresoort": "Okay but I never heard of that shit ever and considering he's not being jailed or something imma assume it's false", "virginiaravenscroft": "ThAnk you so much. was really feeling this and feeling alone 💜", "iamelsz": "🌹🌹🌹🌹 Very important", "groovneverdie": "You and all your white women supporters are a bunch of 🤡 for this 😒", "veekawa": "Thank you so much for sharing this!", "hot.tub.crochet.machine": "@davidbandito", "aishaesthete": "accused of sexual assault? please can someone explain? this is a news for me", "whatisgoin9on": "Love u this post is important and these comments speak volumes. I'm sorry u have to get so much hate:/", "jessicatrentpr": "You said this so well. ❤️", "bewwaboo": "Bless your soul", "dbabyber": "This is my most difficult reality 😭 the celebration and or mourning of celebrity abusers. It sets such a precedent that makes me feel unsafe in my daily life. If superstars (suppos’ed role models) are not being held accountable then what chances do I have at justice and protection?! I didn’t even know his history... your post brought that to light. No else seems to be talking about it. Makes me question all the values of the people and other celebrities sharing. 🖤 My heart is only truly broken for his daughters 🖤🖤🖤", "thebalkanwitch": "@thesolerebel", "catherinewaller1": "This is all so complicated. Although I have great respect for Kobe as an athlete and for the things he had been doing post-NBA, I couldn't help but think today how it must feel to see your rapist exalted in the press like this. People are imperfect and so incredibly complicated. And many things can be true at once. Seemingly he evolved, and that's healthy and impressive, but it doesn't negate the experience of victim. You can worry about victims feeling triggered and also care about how his heartbroken family. I think this post actually shows love for everyone in this situation, and maybe the problem is that most people these days just don't pick up on nuance.", "dianayvette__": "❤️", "brietamzinn": "Thank you for saying this 🙏🏻", "jay_breeeezy": "Stupid post, delete this, if you feel a way keep it to your ignorant self, and check ur facts before you post, you'll never impact society the way Kobe has :)", "ceeladyjanerun": "Wow...#unfollow ✌🏾", "__sarah.duncan__": "It's sad that people died, but yeah I'm not a victim and I'm still bothered by everyone talking like he was a saint, especially when none of us knew him. I know it's \"innocent until proven guilty\", but his case is pretty clear-cut imo.", "aksalako": "Swear she never testified smh trash post now you got bad jinn, was it worth it?", "laurelflynn_": "Thank you.", "u_mommy": "@honesttochristina 💯", "_jenkxxs_": "Also...your post was triggering as fuck.", "chefmelissadelia": "Thank you for this. I’m having feelings I never thought I would have.", "sxm1r_": "Just for one day could you please put aside your social justice agenda? It’s been a few hours since we learned this man lost his life and this is the first thing that comes to your mind. How do you think his family would feel if you said this to their face?", "ask_ashleigh_": "Thank you 🙏🏻", "sitwithsharon": "Thank you for putting words to the thoughts of so many. ♥️", "tarun__k": "How dare you, fuck right off classless shit", "duvetslug": "Man I just love when a rapist dies! ☺️Alexa, Play another one bites the dust 🎉 🎈 🎊 🎇 💥", "pisspirate": "Thank you ❤️", "najahlorine": "I feel terribly confused 😕", "couldnotbme": "Oh brother", "cash_labejia_": "I went to the ER for suicidal ideation today... they spent more time researching and talking about Kobe than caring for my treatment. No one listened to me, and I got catcalled in the ER and security tried to flirt... all after the doctor wanted to be careless in probing for info about my sexual trauma. Fuck this timeline.", "timothyheller\nVerified": "Verified", "youreluckyididthispt3": "wow, a man and his daughter lost their lives in the most tragic way possible, let's think about other people and THEIR hurt to people mourning for these lives.", "porg_life": "Fuck yes THANK YOU for this and putting it into words so eloquently. 👏🏻", "futuredr.twright": "🤔", "ashangrila": "Thank you for the potent reminder that all situations are multifaceted 🙏🏻", "scomiesnackysnacks": "Thank you for posting thing 🙏🏽", "anniemartinu": "Perfect post ❤️", "galentorreyoga": "Yes. Thank you.", "reallyclaudia": "Learn the difference between accused and convicted.", "_annabrenner": "Yes. This is so important — thank you.", "simply_chioma": "This was not cool. I see where you’re going with it, but it’s still a bitch move.", "kirbycernosek": "I’m so glad you shared this. It’s been coming up for me all day. And thinking about anyone else who might feel similarly even tho it’s a sad thing he died. So thank you. And congrats on all your success. You are a hero. You are so needed.", "miiyv": "I don’t think this is something we need to bring up after he and his child were tragically killed. Coming from a sexual assault survivor", "lakshkrishnaa": "Do you just enjoy making everything about you or..?", "yo_vic_nice": "Next Slide ➡️", "ks_ross": "Thank you for articulating this so well.💜", "redsoxslp": "Thank you for saying this.", "niiiccooollaaa": "Thank you so much for this", "mahdisaddar": "What in the fuck ?", "getoutyourmap": "Thank you for this ❤️", "kimi_kitten": "At the very least @melzstavonmanson", "branddipjackson": "I'm a victim of a sexual assault his death didn't trigger me. I'm incredibly sorry for his wife, and children. This loss is immeasurable", "pacificnerdwest": "Thank you @ihartericka for always speaking truth", "josephkillspedos": "Imagine thinking that him dying us about you", "roochmagooch": "Thank you for this 💜", "poison_ami": "Ew", "k.ladaris": "😑😑😑", "franciathegreatt": "I’m not sure WHY it’s so tasteless and disgusting to talk about the actions of a deceased person. Them passing doesn’t make what they did go away. I personally haven’t read much on the topic but If he did it, I meannnn, it’s not nobody fault if it’s brought up. Like at all.", "moramuse": "Man do I feel for the families of everyone who passed especially his family who found out he died before the police were able to notify them. God i cannot imagine that feeling.", "z3nyatta": "I did not know how to say this so eloquently. Thank you.", "reganvirnoche": "Thank you for this 💗 the Grammys was tough this year", "scriberesq": "Your post captured my sentiments. I'm sad about his death but then I think about his victim and I'm like, \"This must be so tough for her too.\"", "_stratus_update_": "Hm?", "powsolution": "This is a message of concern with no personal attack.", "nelly_astrong": "I could see how if people were already in a dark place this would add another layer of grief and maybe tip someone who was already on the edge.", "winters.518": "Aw hell naw you hella🌽🌽🌽🌽", "liarosestudio": "Thank you for this. When men achieve in the ways and arenas that our society values we are expected to gloss over and excuse their violence and usery. Unless you were calling out this trash dynamic and naming the numerous examples in pop culture, including Kobe, before today, you can save your pearl clutching over how \"distasteful\" this post is. Confronting rape culture is never comfortable, it's never \"the right time\".", "smashtranaut": "Ooooooooof. I came here for the comments and yall did not disappoint 🙌", "carlynicolemee": "Thank you so much for being the one person we could count on to say this. So so necessary. Truly appreciate your voice. ❤️❤️❤️", "jayleehamidi": "👏🏽", "grevt_bvlly": "So this couldn’t fucking wait? A mother just lost her daughter at 10am. @ihartericka you couldn’t wait a day or two?", "blissg333": "His sweet baby girl ❤️", "thejulesmarie": "🖤🖤🖤🖤🖤", "life.of.a.mama.of.3": "👏🏻👏🏻👏🏻", "mrfruitboy": "Giving us word to heal, Ericka, thank you!", "delicatechaosofmassfury": "Thank you", "artistnamedsue": "I really appreciate this post. Thank you.", "rebeccat.j.h": "22 years ago i was assaulted and had to press charges. 1 year ago he killed himself. so much time had passed i had rarely thought of the assault. once he died, the consistent accolades and condolences brought so many strange and negative feelings flooding back and has once again filled my recent memories of the horrid incident i had to deal with. i’m glad his victim got to hear an apology as i did not and now i can’t. i hope his victim doesn’t have to feel what i’ve been going through. i also hope his surviving family finds a way to heal. lots of emotions on this topic.", "mcholmondeley": "This is one of your posts that slaps my conscience awake when it is asleep on the job. As a survivor myself I ought to know. Thank you ❤️", "pandabride": "@theoneandonlykdk", "itsmeitsjennifer": "Thank you for saying this. Just thank you.", "foresound": "Fuck you, u dumb broad go jump", "justsheherhers": "@ihartericka sometimes I know I fangirl you and Prof Eb but...fangirling is so much easier than putting into words how much I respect you, your consistency, transparency and honesty. THANK YOU for continuing to stand up for survivors/victims when many chose to fold.", "arzoodles": "❤️", "aqueerjew": "I’m confused as to what a helicopter crash has to do with sexual assault ? Just wondering ! Thx", "wholesamgirl": "Death should not give people impunity for the shitty things they did when they were alive, and neither should fame", "_therewillbelight_": "I completely forgot what he did and the deep anger I felt those years ago when the story came out about what he did. And now, I feel a lot of guilt that I forgot; which I think is linked to the idea of forgetting trauma also.", "lay__lay91": "Wow this post was on some bullshit! Unfollowing!!", "mariann_mb": "Thank you for your post.", "mangomariposx": "You’re only person on my feed that has mentioned this and it’s comforting knowing that I’m not the only one (also survivor) with complex emotions regarding this outpouring of public grief over him. I too have been keeping survivors of him in mind. I’m reeling over Gianna and their family though, as well as the others that passed alongside them. Absolutely devastating.", "wadada.izzy": "Really? This is so tasteless and unnecessary. Disgusting.", "theclauuds": "@katiemae1215 Here’s a safe space.", "everybodywangchung": "@phxjohn", "detinate3210": "Thank you for this. I can hear folks being upset and they are centering one perspective and I get it because death can have us thinking we need to see things a certain way - like the person who died is owed that because they died. But that’s not how things really go. I’m grateful that you’re trying to help folks see the whole picture and looking out for survivors who otherwise would be overlooked as usual. I don’t see this is being, as one person said, an oxymoron, rather you’re holding space in your heart for folks who might be having a totally different experience with this news. Even those who loved him, I’m sure, have mixed feelings themselves.", "banannieroro": "That’s all I can think of every post every comment about him", "cathtoo": "Had no idea, thank you for providing knowledge 💞", "yay_taylor": "Wow, this is real. Gotta do my research bc I didn’t even know.", "ohheymisshampton": "Wow", "senpaimoxie": "Very uncouth", "laurita_is_here": "❤️", "ameliahuntress": "Thank you x", "naynayghouls": "Thank you so much Ericka. Solidarity with survivors always.", "ashantiii23": "Thank you so much for being the person that you are, I feel like you always articulate and validate the unpopular feelings that I sometimes feel reluctant or embarrassed to share because they might not be the popular views. I always feel so seen 💖💕 and I truly do appreciate you from the bottom of my heart.", "amber_makes_things": "🙌🙌🙌🙌🙌", "c.madisonpeters": "Thank you for putting this into words. Thank you. 🖤", "alliefire": "@amberfirestone finally", "clc3118": "@thackuverymuch Saw this and thought of you and all you have taught me.", "happyhedgehogadventures": "Thank you", "elementtolife": "Thank you for this post", "beefykush": "In no way is she bashing him so yall needa stfu people are people and did shit regardless thast u could do is understand the victims", "thisismyusername86": "Obviously to post something this cruel you have to be broken inside and bitter @ the world so badly that the only way she could feel better about herself was to put someone who just passed down, there family down and have zero respect for a young girl who died! Just to generate likes?! 🤦‍♂️", "chronicallyliv": "@lizard_found_joy", "allthatraspyshxt": "Yeah, no..not the time.", "oh.dear._": "This is the only things thats come to mind and his face had been everywhere", "jessicadenaples": "💯🙏🏼✨", "angelica.lamourxo": "Thank you thank you thank you!!! 🙏🙏🙏", "babyknife_": "love back to you, from another. 💕 thank you for this.", "jessica_as_letaw": "Finally. First time I’ve seen this acknowledged today. ❤️ and sorry you’re taking shit over it.", "punkanddisorderly_": "Thank you for showing us that you can hold space both for his family and for survivors of sexual assault. On the surface to many of us, it seems like an either/or situation.", "ca.rolannie": "Sending all of the love I can to you and everyone else ❤️", "classyamy": "Finally!! Scrolling through my feed mind blown that no one wants to talk about this. Thank you for this!!", "typi_callie": "Thank you thank you thank you for this❤️", "larryjor": "Stfu with this dumb shit. You bring up shit that has no value with this tragedy. The so called allegations is not the news today. Step the fuck back and know your role.", "kadiesurri": "I had no idea he had this history. I’ve never been a fan and follower. So sad for his family. But will not make a hero out of him.", "mercii_me": "IMPORTANT!!!!!!!!!!!!", "notheft": "Ericka this took unbelievable courage, thank you for your advocacy", "katie_birmingham": "SO TRUE!!!", "maricartier_": "huhhhh", "jennifer_ciplet": "Thank you.", "wanderingme": "Thank god for this post. Honestly.", "marfromda3": "Smh", "divinemissl70": "I’m a sexual assault survivor and this is something that could’ve waited. Regardless of what he did, have some respect for his family and the family of the others who died", "chefchenellemonique": "Ericka Hart I say this as nice as possible but please SHUT THE FUCK UP! PLEASE! 🤗🤗", "sonjablanco": "This is classless and distasteful.", "lfredman": "Thank you!!!!!", "iamkashi": "Such a great way to handle this. Thank you ❤️", "natural_classroom": "Thank you.", "stressica__frog__tits666999": "👏", "abovebelowjewelry": "So perfectly said. Thank you for sharing this ❤️", "selima325": "Thank you 💓 sending you much love today.", "kt_doneitagain": "♥️♥️♥️♥️", "elizabethiggins": "👏👏👏👏", "littl3mng0": "💕", "reluctant_actvst": "TY for this! Not enough people are talking about this!!!", "swolesarah": "I had asked if Kobe had done anything to prove he had changed since his rape case. Minutes later I was sobbing on my kitchen floor as friends told me my bringing up his rape case was ill-timed, offensive, and disgusting.", "ihartericka\nVerified": "Verified", "noemie.ti.pop": "Thank you", "iviwithani": "I was thinking about this earlier. This day is definitely filled with mixed emotions.", "rashelle.2813": "Thank you.", "wow_val": "His daughter died....along with another child. Another parent", "languageofthestones": "Thank you.", "kimberlysanzo": "I’m a sexual assault survivor and I am ashamed to see this.", "snarfita": "@laurenwalk.er", "iamjulietjames": "I'm so grateful to you for posting this. It's been bothering me all day. My heart breaks for the loss of any child.", "amyrosecarrillo": "Yes 💕❤️ thank you.", "casera_sera": "❤️❤️❤️", "joyiswhole": "thank you. ❤️", "mrsdhennin": "As someone who was definitely triggered by the news...thank you for seeing us. ❤️", "kamalasutra": "The prosecution dropped all charges of sexual assault against Kobe Bryant. The gold digger girl just wanted $$ and did her plan to accuse falsely an innocent man.", "kezia.phipps": "❤️❤️❤️", "hexe.pope": "literally if someone checked on me because they saw bryant died and they know i am a survivor i would tell them to fuck off.", "tessyrella": "She could say whatever she wants on her page. Check @arishaffir Twitter today...everyone is entitled to their own opinions and feelings", "hannahmal.crackers": "This this this.", "dlodea": "Thank you.", "maximuscreighprime": "Thank you!!!!!!!", "gingerallie22": "@ninaea this is what I’m saying.", "electric_blarney": "Thank you.", "doonothing": "wow so many fantastic comments this has to be part of conversation i’m thankful you posted this and that there are so many comments @ihartericka ❤️✨ love and respect in solidarity", "larriburd": "What an absolute narcissist you are", "thegerds": "💜💜", "cinnamahn": "People seem to be forgetting he was accused of raping a 19 year old.", "kaludiasays": "this is a good take. Thanks for saying it, Ericka", "mishpp": "You’re the first person to acknowledge this on my feed thank you ❤️", "workoutswithimani": "❤️", "irony.maiden": "Oh my god, thank you, this is LITERALLY the first post I’ve seen acknowledging his past and I was starting to wonder if I was fucking crazy", "whitewillow_witch": "Thank you Ericka. Thank you. What I’m having the hardest time with is seeing how many good friends are “mourning.” Its shocking, honestly.", "porsche.pricey": "Your a grown ass woman , this not the time your your Shit . Take ya anger out on someone that will tell about ya no class having ass @ihartericka", "eeomalley": "Yes yes yes yes yes. Thank you for having the courage to say it.", "katertotthegreatertot": "I think you said this brilliantly. Thank you for modeling how we should approach this delicate subject.", "abbyjanetx": "Thank you for this. ❤️", "ava.joy.821": "Thank you for holding space for survivors and mourners. Thank you for being respectful and empathetic", "nubianfelinity": "Thank you so much! I feel for his children, but felt very ambivalent about this..", "egg__stew": "This post is sooooooo needed and absolutely correct PERIOD !!!!!! I'm having difficulty articulating an uneasy feeling I'm feeling. To non black people, I feel your call to acknowledge the trauma he enacted on the woman in support of sexual assault survivors is not genuine. It feels sinister. It feels like it's rooted in the racism.", "ms.buckingham": "Thank you 💜💜💜", "nyctherapywithlauren": "Thank you. Well said.", "itscandelaria": "🖤", "eberry9": "🙏🏼", "sheworelore": "Thank you", "salfek": "Thank you for this. Feelin it.", "dannalnieto": "Thank you for eloquently you put this. I’ve been thinking about this all day.", "pa.tricia753": "Thank you for this post.💜", "j.fr.i": "👏🏽👏🏽👏🏽", "dantsypants": "Perfectly put.", "lexjayne": "Love this", "nikkiweil7": "Thank you for posting this. It is very true. All the triggers today.", "ohgoshtash": "💖 So many things can be true at once. I’m grateful for this acknowledgement", "riz65": "Thank you for this post. 🙏🏼", "tala_tootoosis": "Thank you I totally felt like I had no space to say anything or feel any type of way because I already seen someone on fb go off about even mentioning that he was accused.", "slutwalkmelbourne": "Well said, Thankyou. sending love to you and all who need it ❤️", "86official": "KOBE over anything 🐍🐍 G.O.A.T even with the bitches 👍", "devilinabluedress76": "Wow this post is so deep. Im truly speechless 😥", "victoria__manoli": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻", "liltorsi": "❤️", "sirimarie82": "Thank you so much for posting this. It is all I have thought about today", "against_thegrainiii": "❤️", "poorlilwitchgirl": "Thank you Ericka", "sugacake88": "All I'm wondering is even after the court transcripts came out and people literally read Kobe's confession and apology, that people are still calling it an accusation... I am confused and triggered. I can't mourn a rapist and I definitely don't care about a legacy just b/c he's black.", "megchastain": "thank you.", "carrieburnettlmt": "Thank you for putting more eloquent words to this then I was able to all day.", "megnickmick": "Thank you for putting how I’m feeling into words. ✨👋", "cheezydoesit": "❤️thank you. ❤️", "peanutandsweetpotato": "❤️❤️❤️🙏", "andawhamybar": "YES", "jenlinjenlin10": "@caseydreed6", "jqreese92": "Weak ass post ✌🏾", "feedmyego": "Girl fuck u", "nava_yoga_": "@ihartericka Thank you for this...", "tofu_queen_": "Really well said!", "careymegan3": "@asj2q", "lauralushoc": "🙏✨❤️✨", "scarlettkada": "Thank you for this❤️ Just wondering if there is a different word that could be used instead of “accused”? I feel like it puts doubt on the victim/survivor and lets him off the hook for it (which he already was let off the hook, despite essentially confessing to it later).", "therealjessicac": "Thank you for saying this ❤️", "sarahmorgan914": "Thank you 💛", "lcwaaat": "❤️❤️❤️❤️❤️", "maymaycincy": "Are victims of sexual assault triggered by his memorialization from perishing in a helicopter crash? The past 17 years had to be rough... he’s had so much publicity for philanthropic stuff... and then he won accolades from his short film.", "hanjuey": "Thank you", "emmyjane333": "Wow, I didn’t know about this. Thank you for this.", "natashalbrown7": "Thank you for posting this 💙💙💙", "motherghen": "Thank you so much for acknowledging this. I’ve been asking myself and others how we are so easily able to forget...", "melonskies": "You always say exactly the right thing. Thank you.", "electriclady_em": "Yes. 👌🏽 well spoken. Prayers and protection to all grieving 🙏🏽", "kmbbc530": "❤️", "eskirkland": "I’ve been thinking about this constantly all day. Grieved for their family but also thinking about what happened in 2003... Thank you @ihartericka ❤️", "missmelissamcbride": "I been feeling this.", "_u_cant_come_in": "Anyone can accuse anyone. He wasn’t flying guilty and that ACCUSER was found to be lying. This clout chasing post. This legend just died with his daughter. You’re disgusting for this", "luz_b_landon": "Thank you", "curious.and.caffeinated": "THANK YOU", "dr._mantis_toboggan_m.d._": "Also, people that are victims of violence and the justice system. R.I.P. Tony ( my friend) and Kobe.", "erinmgraham": "Yes.", "kailjayne": "Thank you for posting this.", "bakedmilk": "thank you for this. thanks to this, i'm just now finding out & researching the 2003 incident. my heart goes out to the survivor 💔", "purpleshamrockcreations": "Yes! Thank you.", "brendanmccabe2003": "The deaths are a tragedy but it’s also a tragedy that Bryant was never brought to justice", "shanook_": "Thank you 💓", "moodysideofthemoon0704": "Well said as usual! 👏🏾", "nativeprincesspeach": "I needed this today thank u ❤️", "kylenbutton": "Thank you.", "khaoticthoughts": "Literally said perfectly. 💖💖", "zaranduck": "As a survivor, what I don’t understand is why it’s important to point out his sins now, the day of his death. Do we all not sin? Would I want my every sin to be remembered the day I died tragically, along side my daughter? Idk. This is hard to grapple with. I can’t say We should be remembered for only the good and not the bad things that we’ve done while our time on earth, but if you’ve changed wouldn’t you want to be remembered for that too? Idk. So many thoughts. I feel for his wife and kids. 😢", "unravelpodcast": "💕", "chasecastro": "Thank you for saying this. I deeply appreciate not feeling so alone today with this heavy on my mind and heart.", "dj_karebear": "Thank you", "polkadotlibrarian": "I’m so sad for his poor daughter and that her life was cut so dramatically short", "theoddestchild": "I have found today so triggering, and it meant so much to have someone say this. ❤️", "mrzdkatez93011": "I will never understand how ppl take one thing & internalized it & make it about them. Someone is dead. I hit a puppy & killed it in front of it's owners. I pray they don't come to my funeral & say ill things about me.", "authenkitticity": "This quite literally the only post I will acknowledge and agree with around the situation.", "smroyer": "Thank you.", "malloryolwig": "🙌🏼", "lbfox.ceramics": "This. Beautiful and important. Thank you.", "canty_liz": "Thank you for acknowledging this ❤️", "hobryant": "👏👏👏🖤🖤🖤", "mystic__leigh444": "May I repost? 💜", "jenniferburdette": "Thank you Ericka 💚", "brittanylittleton": "You’re the only public figure I follow who has acknowledged it 😭 it’s been such a heavy day. Thank you", "deespeaches": "I was thinking about this today. Thanks for this post.", "emcclureot": "Yes. All of this, so much. ❤️", "clittany": "You are the only page I've seen post this. I've had to unfollow so many of his stans. Ugh.", "maestra_silvestre": "Tough pill to swallow for many, but this needs to be said. The movement to end sexual violence has not seen much hope because people refuse to talk about it.", "heartovercrown": "🙌🏽 thankful for you.", "hommepourfemme": "👎", "carly_marie90": "Thank you!! ❤️❤️❤️", "jkyoung27": "Thank you ❤️", "loistierney93": "so important ❤️ sending all of my support and solidarity to everyone who has been sexually assaulted ❤️❤️", "realjamaican": "This bitch", "banafshae": "Thank you thank you thaaaaank you", "agatha_marie98": "♥️", "manicpixiemagicalgirl": "Thanks for this I didn't have the words.", "vconrecon": "Thank you. I’ve been really feeling the dissonance on this and felt that my silence was my best option. I appreciate you so, so much ❤️✨", "ohk80": "I brought this up with my family and was shamed for it. Thank you for speaking to this so well. ♥️", "jeanieforever": "It was the first thing I thought, and worked through slowly. I know none of us are defined by the worst thing we’ve done. It’s not an excuse, and not one of us knows how he’s made his peace if at all. But nearly 20 years later, being blessed with 4 beautiful daughters and a compassionate wife, he has shown much love for his family and support for young athletes, particularly women, and people in general to understand and achieve excellence. Of course, let he without sin cast the first stone. But grappling with witnessing the redemption of someone who has hurt you, while you suffer in silence can be difficult. We’ve to learn to heal and help heal. 💌", "lauriseirl\nVerified": "Verified", "historicrizzle": "Feeling very frustrated with friends' expressions of mourning, its fuckin basketball it means nothing. Meanwhile he commits lasting fucking harm on someone and nobody seems to care", "kkob81": "Thank you for this.", "gallislayer": "THANK YOU!", "gussyrose": "I was just thinking about this.", "kryssss10": "Yes 👏🏻 thank you 👏🏻", "jewelinthelotus": "Thank you for this. Definitely a tragedy for all involved.", "meredithyayanos": "🙏🏼✨💜✨", "damemasangelina": "I had these exact same thoughts when i saw the news. Thank you so much for this post.", "kelkeleb": "Thank you. I was immediately triggered. I posted something on my story about this and got pressured to take it down. I’m feeling all sorts of messy.", "artkillsgallery": "🖤🖤🖤🖤🖤", "xx_kevinish0t_xx": "thank you for putting this into words ❤️", "cria_pet": "Thank you for articulating it so well. I’ve been thinking about this since I heard the news. You’re the first person I’ve seen on social media to acknowledge this. 💜", "clizlempke": "❤️❤️❤️", "scar__lala": "Thank you so much for this 💗", "daredevilbean": "I don’t know what to do . Like holy SHIT I think THIS is the very 1st time in my life I actually feel so confused & fucked up . I am a survivor except my .. “thing” took years to realise what happened so seeing & thinking bout how others must feel....? Fuck . I’m ready to cry rn .", "tee.marie.92": "Appreciate you so much for this 💖", "iamemilyprice": "Thank you for this, something I just said to my husband today. Regardless of him not being legally convicted, he has victims and today is no doubt difficult for them too. Both views matter", "antbarba": "Thank you for the first acknowledgement of this that I have seen. Sending lots of love to those who need it", "thejuliakitchen": "That is all I could think about when I heard the news. Sending light and love to Vanessa Bryant on her most difficult day.", "_beautifullyvic": "Thank you so much for this! ❤️", "rebeccaholopter": "🖤", "reesal1984": "Thank you for this", "jennahturp": "🙌", "amandawatcheswaves": "Love love love that you posted this. Thinking of the specific 2016 survivor and all others today. 💕 You are believed, and no amount of talent and glory that your abuser has now nor posthumously will make irrelevant your experience.", "emilyoandasan": "@ihartericka yes. So important!", "bailey_irl": "thank you so much, it’s been really triggering to see people I respect hail him as a hero and legend", "dyrtwitch_": "Thank you", "badblaccwoman": "Was thinking about this too today. I didn’t know how to feel", "talking.with.talya": "Thank you for posting this. ❤️", "kendrahilty": "@collinelwyn you were right. 😬", "triniboyb": "This is💯 truth", "alexis.hoyt": "THANK🙌YOU🙌. I've felt guilty and like a POS all day for thinking this.", "steinteri": "This is what so many of us need to hear. Thank you.", "obritztattoos": "❤️", "taylorelysemorrison": "I’ve been thinking about this. Thank you for vocalizing it", "courtneedsart": "Thank you for this reminder", "nicolearenth": "💛", "indigo.fairy": "THANK YOU", "claudiacollett": "Ty ❤️", "brescullark\nVerified": "Verified", "lornajanemartin": "Thanks for this 🙌🏻", "hello.rebel.haus": "💓💓💓💓", "untamedtherapyservices": "Thank you! I was feeling and thinking similarly", "oldbloodjewelrywears": "🎯", "iamthebirdflower": "You said the perfect thing. As always. Hope you’re feeling okay today.", "kacimial": "Was trying to figure out how to put this into words. Thank you for post and love and healing to all ❤️", "___cqg": "Thanks for this. 💕", "laura_diana_": "❤️", "thiswomanslifejourney": "Oh wow I didn’t know this 😱😢", "uhsavannah": "important", "bee_and_mae": "Thank you 🙏🏼 I shared this on my stories and I’m already getting shit for it but it’s important! 😖", "twolipps": "Can’t handle all the tributes.", "la.sack": "Yes! ❤️", "carlisleanne": "Thank you for helping me figure out how to phrase my feelings so well. 💕", "dr.amy.laflash": "Thank you for this message that so few on social media seem to echo. ❤️", "sometimeswithsyrup": "thank you so much for this 🙏🏽", "missthriftalot": "Real👏🏾❤️", "ajpanda11": "Thanks for this, for being able to hold all the dissonance in the feelings and express it with grace and warmth", "hot4bergamot": "Thanks for even posting this. I’ve been feeling fucking bananas bc nobody has said anything like, am I the only one who feels this way? Thank you.", "kieranmulcare": "Thank you", "hootszagorski": "🙏", "hilstar221": "This is all I’ve been thinking about. All of us. Used to watching our attackers get praised. I’m sad for his family, but I’m sadder for survivors.", "lovealmaaa": "❤️", "toriincharge": "Thank you for giving me another perspective today! I appreciate it so much💛", "staysexyhoney": "THANK YOU ERICKA💖💖💖💖💖💖people really trying to ignore shit like that :(", "kelseyeagen": "Thank you for acknowledging this in this way.", "mothershipfest": "💚", "laurt56": "Thank you for this. ❤️❤️❤️ 👏👏👏👏👏", "_lifeofshi_": "Exactly what I’ve been thinking. This has to be a very triggering & conflicting day for many people. While many ppl are in mourning I def don’t want SA survivors to be shamed for feeling relief. ❤️", "kandis_williams": "Thank you for this. ❤", "dapontefern": "Ericka...and this is why you are awesome. Very tragic what happened and sad. You're the first person I've seen on here that mentioned that. Thank you.❤", "la_._serpentina": "Thank you for articulating the possibility of a solidarity in grief", "bob_the_lady": "👏🏼👏🏼👏🏼👏🏼👏🏼", "kennaconfetti": "Would it be ok to repost with credit given?", "womeninselfhealing": "THIS! Thank you for saying this 🙏", "kelly.k": "thank you so much for this. i cried a lot of tears of frustration today, and really needed to feel like someone else understands what i’m feeling", "kartinoslslim": "Thanks for posting.", "sarahelizgrace": "Was thinking about this a lot", "kate.la.reine": "Thank you for posting. Very well said. I’m very frustrated at those saying it’s “too soon” to talk about this.", "empowerpuffgurl": "thank you for this 🙌🏻", "realplastictrees": "Thank you so much for this.", "dr_xtinamarie": "👏🏽👏🏽👏🏽", "tponeil1": "❤️❤️❤️❤️❤️", "sydnee_renee": "♥️", "__nonamesleft__": "Very well said 💗", "panther_teeth": "thank you for this", "ericasmith.sex.ed": "This is the post I was waiting for. Thank you.", "nisaco": "Thank you for this"}