{"iischristy": "Love this. Love y'all. 🙌🏾❤️✊🏾", "epiphanysophia": "This is beautiful", "kalaandthelosttribe": "🐳🐳🐳", "erinbrownconnects": "And in the order! #lovematterw", "makkunaito": "👌🏾😍😍😍👌🏾", "danajannine": "#LibidoOnStrong 👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾❤️❤️", "blackbrains88": "🙈😍💚💚💚💚", "yiabs_mubrusmedia": "My dear you're loved,if not by everybody but by me.my queen my crush", "jtothezenn": "You are beautiful and sexy!! Also I saw you in an add for lingerie! You looked gorgeous 💗", "halle_hathaway": "I LOVE YOU + EBONY TOO ❤️", "blachaz3": "❤️❤️❤️ you the best", "jamericansexypants": "So brave and beautiful", "ixxcheeel": "@soy_muxer", "nettiepoohthatbitch": "Beautiful 😊", "smilesfromsiri": "Ny favoritt account @vickys.se", "bobbiejavapoetry": "Fucking hotness 😍😍😘😋", "radical.kids": "@nivenchyy", "bury.magdalena": "Waow now thats a strong vibrant,beautiful woman❤", "lizzymulkey": "Yes yes yes!!! Thank you", "isen_03": "Ugly ass", "colleen_flowers": "#LoveThis !!! We talked all about it in our Young Adult Cancer Meetup yesterday while in a circle of giving/receiving backrubs and head massages 😍 https://www.meetup.com/Berlin-Young-Adult-Cancer-Meetup/events/245021576/", "amberhale5698": "You guys are awesome 👍 #badass #beautiful #brave", "xmei.lingx": "beautiful", "luckoftheirish_333": "You can really see the pure bliss on your face, and how lovingly Ebony is embracing you 😍💜💜💜💜💞 Seeing true love to me will always be something to be cherished!", "hu.rricanes": "LOVE this❤️", "mirz112": "Omg! 😍😍😍😍😍😍😍😍😍😍😍🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥 this is so beautiful and so Sexy", "iamlshauntay": "You guys are every fucking thing. 😍😍😍", "ericanubia": "So sexy @ihartericka", "chillcoop": "You are hella sexy Queen!😍😍💙", "lovimama": "Beautiful ❤️", "tiannasfitlife": "This is beautiful! Thank you for this 😍💕", "msladyg63": "I’m right there with u....but I had a full mastectomy...but when I look at it, I see it as a victory scar😊", "salome_and_the_screech_owls": "Gorgeous sensual sexually divine post", "theaxltd": "✊🏽❤️", "phlfoodadventures": "Yes a thousand times to this image and message", "lene_8_8": "❤️", "altair_arts_": "I can feel the strength and love of you two in this picture and it honestly made me tear up. I'm honestly so happy you have each other", "supernormalpodcast": "This is so absolutely fucking spectacular ❤️", "misswilson27": "I hate the food and vitamin advice", "luciagoode": "Yup! Loving all of THAT!", "some_callme_hero": "Thank you for making that clarification for those of us who struggle with the depth of how to be there and come with the best intentions but not in the same regard", "ariabjazzy": "😍😍😍😍😍😍😍😍🌈👏🏽👏🏽👏🏽", "jatlasp": "Wow❤️❤️❤️❤️❤️❤️", "violet.femmes": "Girl you are the mkst powerful kind of sensual ive seen!", "ms.tlcp": "This is the most beautiful work of art this year. You're going to run the world 💖🌸", "halfbreedhippie": "You are magical. 🔥", "jjessjess": "Gorgeous you two", "kisstheteam": "@waterlit", "fullswingmanagement": "Hell yeah.", "batablanka": "This picture is awesomely beautiful!! Congrats you are a strong survivor!! I admire you so much, kisses 💋😊💖", "beautiful_cocoa_": "This is gorgeous!", "readynotready": "Ten thousand times this. I live with a chronic skin condition, I feel like pepper and glass and sand all the time - but being loved, being touched, having sex with my partner is one of the few things that reminds me I will someday always feel soft.", "dillsyrpickle": "So beautiful for so many reasons. 💜💜💜", "danielle_faye_gilmore": "✨❤️❤️❤️✨", "_la_lo": "@ihartericka thanks to you ! I love what you do and your message. Actually I don't have a breast cancer but you give me hope and positivity about a lot of things, thank you to be like you are, thank you to be you❤", "renee_morrison00": "💞💞💞", "arinjas_verse": "This is an incredible beautiful picture! Completely stunned by the love, trust and intimacy it radiates!💙", "spelledbrittany": "everything. every mutha fuckin thing.", "muskokagirl24": "This picture gave me goosebumps, just beautiful! ❤️", "survivor2xs": "Simply beautiful", "porscha1987": "I love everything about this ❤️", "henriettaeriksson": "This is beautiful.", "nessa_bess": "💜💜💜💜💜💜", "angela_jimenez_p_": "🔥", "nayantaraparikh": "💙💙💙💙💙", "gwendolynfaker": "This is so beautiful.", "bluth_ish": "Dis tew much tho. 🔥🔥😱😱❤️❤️🙌🙌😍😍", "justinmltn": "🙏❤️🙏🙏❤️🙏❤️🙏❤️🙏❤️", "holisticalkalinevegan_phyllis": "@ihartericka you are beautiful strong sexy confident and so on. I so love your strenght and confidence. Warm regards from Suriname South america😚😘", "lyss_arce": "Yesssssss this picture and post tho 💓💓💓💓💓", "breannaleasantos": "♥️ @lindsaymore_o have you seen her?", "justagirlinthewords": "Beautiful. You should feel loved and sexy in Ebony's arms. You both look very loved. 💙", "jessyred28": "Beautiful ❤❤❤❤❤", "ebonys_world": "❤❤❤❤❤", "ricardocatala": "Bellisima foto....muy.caliente....🎆", "jessm1101": "This is a beautiful photo and you make such a great point.. I think you always look very attractive", "imsecretlyacat": "AHHH! Can't wait to meet you next week 😭😩", "hello.rebelle": "❤️‼️‼️‼️‼️‼️", "k.mad": "This is such an understatement, you are sexy, you are human, you are a woman, thank you for letting people know that we need to stop feeding into the stigma you stand for so much 💛", "mcholmondeley": "Beautiful black love!!!! 💜💜💜", "rubywednesday13": "❤️❤️❤️❤️❤️❤️❤️", "humblehartmusic": "This is Sexy, Sensual & BEAUTIFUL ! 😍😍😍😍", "levibenjaminlewis": "I love this so much 👑❤️❤️", "charmedlifecraft": "Whoa, this photo is so hot! 🔥🔥🔥 And also beautiful! Thank you for sharing.", "cako3615mylife": "So true! Nobody ask... even doctors! You're lovely😊😘", "complexblackboi": "Okaaayyyyyyyyy!!!!!!!!!! Forst of off you're amazing. Second off, I SEE YOU and it is just so beautiful, 3rd off, shout out to Ebony and that revolutionary love. 4th...i mean I can go on and on, but more importantly, I love seeing you happy.. I mean I LOVE IT.", "j_hofflinger": "Beautiful", "ninita_ox": "❤️❤️❤️", "christeddypaints": "🖤🖤🖤✨", "missmichellemaster": "Thank for this. #truth...And so beautiful.🖤🙌🏻", "kokobaldie": "Yasssss.... Love it!!", "elicia_g": "all the chills", "chelsey.vandrisse": "You two are amazing", "christinadbest": "Beautiful. Very necessary topic.", "yinkstagramm": "OMMMMGGGGG 😍😍😍😍😍i love you at least 1000x more! Beautiful!", "buggsgurl": "As much as we r inspired, i fall under d category dat doesnt think of u as a sexual being. Thank u soo much for this awakening @ihartericka. I am so humbled. Love all the way from Nigeria", "mrgrevt": "Malaika", "intini": "I see you in a sexual way 😎", "helenfrancesca": "Your bodies look beautifully soft 😍You're hot like fire girl", "ezmaew": "This is just stunning. 😍", "neomi_with_an_e": "I feel a little silly writing on here because you don't know me at all & need zero validation from me but I do feel inclined to state my thoughts. I haven't followed you very long (I'm new to IG) but I see you as an empowered and confident woman. Woman like you and Ebony are sexy AF! The things you post demonstrate your sexuality, sexiness and love for/with Ebony. The two of you are beautiful human beings. ❤️", "houzof_omarica": "You are sexy and very beautiful being 😍", "eycollin": "Beautiful ❤️", "brittblackivy": "Love everything about this photo", "vidawithchristie": "👏🏽👏🏽👏🏽❤️", "cowcatapult": "❤️❤️❤️❤️", "sunshineflicker": "💛💛💛", "giselle.grapples": "💫❤️💫❤️💫❤️", "lustforart__": "❤️ love itt", "venusmichele79": "❤", "hold.her.hand": "I've never thought about this aspect of a survivor. It's always about the battle before the actual person. I'm so happy that you have someone who keeps your fire lit😍 I love you🌼", "hev11": "Great pic. Looooove that bed.", "moustachic": "sooo sexy yet so adorable, perfect capture of what you wanted to share, love this babe!! ❤️❤️❤️❤️❤️❤️", "georgiasdarcy": "Beyond beautiful ❤️", "oliviamanickam": "Love it ♥️", "awkwardkiamma": "❤️💙💚💛💜🖤", "shes.omnipotent": "beautiful 💕", "briest": "❤️❤️❤️❤️❤️❤️❤️", "king.lilo_": "This is beautiful ❤️", "rocreid_inklusive": "Aowwwww 👀👀👀👀👀LOVE IT!! 😍😍😍🌶🌶🌶", "petrahaddad": "😍😍", "smooch6994": "Beautiful", "day_by_audrey": "❤️❤️❤️", "averychase": "You beautiful human beings 💞💞💞", "lyydiaaaa": "This is so beautiful! 💜💙", "mollie.e.mcgrath": "You two are beautiful. ❤️", "naidaspy": "💛🌑🌟💛🌑🌟💛", "jenniferelle101": "I love you all so, so much!", "_dannns": "This is everything. Passion. Love. Sexy. Beautiful. Powerful. Absolutely everything 🖤🖤🖤", "_ms.emily": "You two are maybe my all time favorite couple! Funny sexy, wise, always evolving and sharing your love and your struggles ... on and on! you both deserve to be cherished, I'm glad you've found that with each other.", "circled_power": "You deserve all the love and blessings", "rachel.appleton": "This is absolutely wonderful ♥️", "ruthtzipora": "This is stunning. So grateful to get to share in this orb of love and belonging!", "bbdodd": "💖", "qymerasage": "Ebony literally worships you. Also he is worth of love and respect. It melts my heart to see thriving black queer love! Yall are too precious!", "kanndissriley": "Beautiful", "sistasdotravel": "Happy Tears (no emoji for dat) ❤️❤️", "albinha_galega": "Powerful!!!!", "maggielattrace": "🔥💕🔥💕", "kiwichampagnee": "I love y'all so muchhhhh", "negranomicon": "I always wanted to ask but thought it was too personal.😏", "hillabeans": "This is sooooo good! I love your love ❤️", "talia1042": "😻😻😻😻🤤🤤🤤 you are giving sooo much sexy!!!! And please tell ebony he’s looking hot as hell too!😏", "loveleash": "I struggle with this to this day. I’m going through sexual anorexia (I just learned this term from a Movie lol) I’m pretty much avoiding sex due to fear. Thank you for being so open about something so true and real. Life after Breast cancer is a battle in it’s on 💕💞💖", "enaganguly": "so sexy 😥😥😥", "katieleighartistry": "This is so beautiful. Everyone deserves to be cherished. You both exude love and sensuality.", "introverted_queen1013": "Love this... Incredible 🖤🖤", "aylabridle": "@ihartericka this is beautiful", "daynatroisi": "So beautiful", "jupitersttal": "EVERYTHING everything", "gracegordonsf": "Breasts do not a woman make. You are a sensual being because you are a sensual being. You're beautiful beyond belief in ways that defy and challenge convention and you should be so so proud. You have touched generations of women with your open and conscious soul.", "queenofglitter_": "This is so lovely 💕", "satanic_wallflower": "This dumb ass 😂 next time I see someone with cancer imma straight up ask them “has anyone made that pussy cum recently?!”", "lastcutproject": "Oh, this post. So beautiful you are, as an individual, and as a couple. These words resonate so deeply. 🖤", "brinaltkaiser": "@heathercooan reminds me of how you're confronting your journey 💗", "jajbabys": "OMG so much emotion in a picture. This can rival any museum art. You both are incredible", "theivyrivera\nVerified": "Verified", "su_1200": "This is so beautiful. 💗💗👌🏼", "_everythingisanything": "Love this!!! 😭💕", "_hersociety": "You’re incredibly inspiring 💞", "natyscocina": "This is so beautifully emotive. So much love", "blkmoonlight": "I love this so much", "sixid": "💕💕xoxoxoxoxo", "wheat_from_chaff": "I feel every bit of this and the doubt about our own sensuality that can sit with it. But curious and creative minds prevail (I hope). Glad you’ve found that bliss. And thank you, gorgeous soul.", "nicoleirl_": "♥️", "doctorannieautumn": "This photo brought tears to my eyes. I am learning to renegotiate my sexuality after a double mastectomy (age 35) and it's a hard road, because my breasts were so central to my sexual life and practice. Do you have any suggestions for reading/theory on this???? I'm reading trans theory about remapping erogenous zones, but also wondering if there's anything else? Your inspiration to me is about queer embodiment and its relationship to BC treatment because I felt so alone and isolated and unrepresented . I try to put myself out there, to be visible, but there need to be many of us ❤️", "museumgoingladies": "🎇🎇🎇", "oh.hawksey": "So beautiful and so much lovs", "tesianocera": "Beautiful 💓💓", "e_lorena": "❤❤❤❤ Yessssss", "sureyoushan": "😍😍😍😍😍", "itsdoreenpierre": "🙌🏾🙌🏾🙌🏾🙌🏾", "melkasey": "♥♥♥so beautiful", "mo2love_": "💜💜💜💜💜", "arteaga_kate": "This is so beautifully tender, fierce, and sexy AF. Giving me all the feels. Brings me back to my husband's recovery from chemo/surgery, I was fumbling (unsuccessfully) for a way to prioritize and preserve our intimacy and connection amidst the chaos, find our humanity in a system that wanted to define for us what quality of life really meant. It would have meant so much for a doctor to recognize that struggle. Thank you so much for these words.", "kaieleven": "Beautiful.", "mase_430": "❤️❤️❤️❤️❤️", "itsadair_": "😍☺️😍 got me feelin all sorts of ways over here", "beyourownpet_": "Beautiful ✨", "spotlightpi": "Weldone Ericka! Don't stop being an Inspiration. I heart you!!!", "arianna.spiller": "Why is it that when something traumatic happens to our bodies, whether it be surviving cancer, assault, or some other sort of trauma, rediscovering sexual pleasure and enjoying your body is never talked about? It really makes me sad. Thank you for bringing this to light!!!!! You and ebony are so beautiful and you deserve all the pleasure.", "trilllltrolltv": "Beautiful Queen God bless you #TrueSoldier 🙏🙏🙏🙌🙌🙌👑👑👑", "_mainespoint_": "This is amazing, you guys are so infectious!!!💗💗💗💗", "naima_yolanda": "Your words and this photo are so beautiful.", "sweeteymesquitey": "🙌🙌🙌", "rip.juanga": "💖", "carla_cavaleni": "@ihartericka are you joking ? Yes we see you as a inspiration we admire you for you self estim and your stength BUT first of all when i see ya pictures i think \"damn she's sexy\". Trust me, you were sensual far way before this pic", "fluffmyllama13": "♡♡♡♡♡♡♡♡♡", "amazon_ani": "You bring up such a fabulous point... One I am also guilty of.", "s_p_y_d_e_r": "Beautiful!!!", "krizbell": "YYYYEEEESSSSS!!!! This gives me hope in this twisted up world. THANK YOU!!!!!", "brookiieniicole13": "You both are breathtaking. 💜😍😘", "premietete": "🙌🏿", "apple_saka": "❤❤❤❤", "solomonsthomas": "Beautiful", "cocoabash": "All of this majesty. 💜🙏🏽💜", "vanitybeauty_aly": "I could cry, I love you two 😍", "unapologetically_dope78": "You are so beautiful!!!! @ihartericka", "shesoeffinsassy": "@8hatshepsut7 thank you for making me feel beautiful and sensual during this challenge. I love and live for you ❤️ and thank you @ihartericka for you and your voice. You are beautiful.", "glitterandhotsauce": "Love this ❤️", "wocthoughts": "Gorgeous 🙌🏾", "wen.berlin": "The world needs more of these ideas and concepts. I'm glad you're loved in such sensual ways.", "mozaic_soul": "Beyond beautiful!!!! 🌹", "sir_carter_michael": "I'm so in love with this picture ❤️", "paulasexappealshand": "Beautiful sometimes I wonder about the same thing where my body is concern after my mastectomy I'm still awaiting my reconstruction", "jules_lorusso": "Absolutely beautiful ✨", "survivormoda.rachel": "Beautiful. ❤️", "cbinsantacruz": "Thank you", "peden.m": "beautiful", "nofuecoincidencia": "thank you for pumping your beauty and resilience into the world", "8mamat8": "Can", "ltomart": "💕this ah - giving me the feels 💕", "kick.tribe": "This is magic 💗🙏🏼💗", "thatbadbitchfromserendib": "I love y'all so much❤️❤️❤️", "kael.klassen": "Thank you.", "candygrlxxx": "❤️❤️❤️", "tertiary_adjunct001": "The expression and care for each other is so palpable and beautiful. Thank you for sharing this intimate and special image ❤️", "bailey._.andrew": "This is so beautiful", "leosoul2": "🙌🏿🙌🏿👌🏿👌🏿", "heidiilanis": "I got breast cancer when I was 33 yrs old. My breasts were an area of my body I recieved a lot of pleasure from during foreplay and sex. I'm 36 now and I still mourn the total loss of sensation (which no one asks about or cares about). Getting used to, and learning to love, my cold, numb, lumpy, misshapen, implants/still unfinished reconstruction is only half the battle. I'm thankful I'm alive and well now, but it's all still a struggle for me so it's wonderful to see your photos and hear your voice on the subject.", "tiffanyfreemanstudio": "this is sooooo beautiful.✨", "stylefollowsher": "Love this!! We’re going to have you at Glamcon next year I promise", "brittpysar": "Oh. My. God. 💕❤️❤️❤️❤️💕💕❤️❤️", "imcricket71": "Yes .. everything❤️☝🏻💕💓💜! Such powerful & healing words. 😘 xx", "s_ileana": "Love this!!", "msblackawareness": "I was already in tears, yo...this is BEAUTIFUL. 💜", "_brittanika": "I love u two! Give me butterflies♥️", "technicolorfox": "Awwwwh 🤗", "jenhods": "I’m still trying to get back to feeling sensual. Or sexual. Or just, feeling. Beautiful post and photo. 🌸", "bigtymesgur": "You have to warn a sista when fire is coming!! This photo is EVERYTHANG!!!!", "yajairahdz__": "Love this! 💕", "itspossiblekimm": "Beautiful!! 💜💫", "hannamolen": "Beautiful post!!", "dreamalittledream_ofme": "@hellisempty__", "thegoodnmysoul": "Omg I love it", "sshhannon": "This photo brings tears to my eyes, it radiates so much beauty and love 💖", "thenshesnapped": "Yes! ❤✨Love on love on love and so much sensuality. Feel! ❤✨", "jillisabrownxo": "Wow, this is so powerful and beautiful 🌸 glad I heard your perspective.", "kadetbrown": "Omg you are giving my life", "kindofnatalie": "This is just so beautiful 💕", "urbanbuppie": "Thank u for this. As a fellow survivor, I've never been asked that question either. Wow. So glad you are loved!!!", "hippiebumpeace": "Yes. So much yes. Same here with my Survivor story 🙏🏽💛😙 I love this and you 🕊", "5alutemeimpaige": "I love this", "kerriann_campbell": "@ihartericka I love this💖", "kjens1964": "Sexiness and sensuality are a state of mind: if you believe that you are beautiful and sensual then you are. Period. Scars, nipples, extra weight, stretch marks- name it. Own who you are. Your body is beautiful, flaws and all. They are what make us unique individuals and we are worth knowing, touching, caressing and anything else that makes you feel wonderful about yourself.", "the_water_on_the_moon": "@jennymargalit this is the person I want you to follow! 😍", "browngirlsaredope": "Love it!!!!", "queenbaba__": "Fucking steaming up my glasses over here !! Hot damn 🙀💋💞", "ninthrasa": "😭❤️🙏🏾🙌🏾", "mag_walk": "Y'all.... 😍", "sexdrheather": "❤️ Love", "liddybug": "Such a great capture ❤️", "g_thegiant": "IM HERE FOR ALL OF THIS!!!!", "joannmurph": "Awww", "angelasounds": "So gorgeous. ♥️", "stewhpeas": "LOVE 💕", "shays2cents": "I don't know you but I love you for this post. I hope you don't mind if I share. ❤️", "stillstephnie": "Your face is so happy and blissful - legit, looking at how at peace your expression is gave me a lil piece of the same. Such an amazing photo 😌❤️", "juicyykidd.j": "😍", "beginscarseth": "So sexy!", "marcijnyc": "I love this! The love you two share and the way you share it is 😍", "girlee.zee": "Thank you for sharing something so intimate. Never would have thought of that.", "pocket.full.of.magick": "Yassssss,Y’all betta come on and get good and nasty for the ‘99 to the 2000’s !!!!!", "dat_chic_misha": "😍love it!!🤗🤗🤗", "sorry.not.heather": "this brought me to tears. you two are amazing ❤️", "sofiarclz": "Hermoso y sensual", "recoverybrainfood": "@nicnack228 crying", "alesia.danielle": "My heart💕", "vodkandsunshine": "This is so beautiful", "fenasser": "I’m feeling I’m not sexy anymore after brest cancer. You show me it’s possible", "kimguare": "I love y’alls love. ❤️", "bagosugar67": "Yes, this!! ❤️😍", "dark_rainbow_meracorn": "Beautiful and so hot!!!", "angeldelisiart": "Such a beautiful photo 💕💕💕", "aquababie19": "💜💜💜💜💜", "hipsdntlie40": "Tell em sista no one ever ask those questions I've had insecurities bout my body after the surgeries and i had 2 look n the mirror at myself wit scars and all and say u still a bad bisssshhhh👑 blessings 2 u!!!", "starrbusby_alive": "💜💜💜", "scarred_jones": "beautiful", "emmabacon": "Tearjerker😭", "babiigirlthick_2": "Love is a wonderful thing embrace it 🌸🌸", "staciebalkaran": "This is fucking gorgeous. Thank you for bringing this insight and experience to light--I will be mindful of it as I walk and talk through the world from now onward.", "purposefullylj": "So gorgeous. Black love for the mf win!!! Y’all are so beautiful. 💜💜💜", "chuffed57": "Glorious love. I hear you.", "xoaliciarose": "🤗🤗🤗🤗🤗🤗🤗🤗🤗", "ltnicho": "I would never think to separate you from any other group because of that. I could only see myself saying wow and congratulations.", "thehotnessgrrrl": "Y'all betta werk! Beautiful!", "epiphame": "🙌🏼😩 love this, love you two❤️", "janayy_prettygirl": "I absolutely love this !!!!!!!!!!!!❤️😍", "leilarni_s": "Omg this is so beautiful 😍", "coolcait": "😍😍", "crimson_fig": "You know this #caligurl has mad love for you & Ebony. Your #BlackLoveIsRevolutionary and feel gratitude that you share it with us. 👋🏾 Ebony!", "gallivantingchrissy": "This is so beautiful!!! Y’all BETTA!!! ❤️", "trainlights": "This is so beautiful!", "proxima__": "Yes.", "thenarcisistas": "😍😍", "diazdon17": "👏🏻👏🏻👏🏻👏🏻❤️", "j.a.y07": "This is fucking amazing!!! 🔥🔥🔥⚡️", "chelseliza2": "💜💜💜💜💜💜", "coycasket": "This is the realest reals.", "bedheadrox": "So beautiful", "femmegodforever": "Wow 😭😍❤️", "empanadamamii": "Amazing amazing! Not only sweet and lovely, but sexy and powerful!", "peanutbutterandrachel": "Hubba hubba! Such a lovely post and a hot af pic.", "deborahpurr": "This is beautiful. 🖤🖤🖤", "melodymelamedfoto": "Love it and adore both of you very much", "chivisnax": "WOW❤🙌🏾❤", "balletmeli": "Thank you for changing the conversation on this issue. This a quality of life issue for cancer survivor. ❤️", "taytay.nastay": "💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜💜", "joyi_inbloom": "Amazing", "theshortversions": "So beautiful.", "wearestarstuff479": "This is everything ❤️", "saby1174": "❤️😍😍😘", "timasamad": "EVERYTHING❗I cannot ❤ this enough 😍😍😍", "julieebloemeke": "Thank you, thank you, thank you!", "marissarenee4": "Wow! This is absolutely BEAUTIFUL!!!!!!! I love y'all! Omg 😍😍😍😍", "inraque": "So complete, so woman, so beautiful!", "cori_rine26": "So glad I could be inspired and roused by this photo and your story love!!! #sexysurvivor", "jamilareddy": "👏🏾👏🏾👏🏾 this is everything", "zchelz": "😭😭😭😩 this is so damn beautiful !", "missmegan_marie": "😍😍😍", "sparklethighs": "Sobbing. Sobbing. Sobbing. So much beauty", "cookie_choc": "Wow! What a wonderful Pic!", "leonani_fiatele": "Beautiful on so many levels 💖💜💝", "seafoto13": "Beautiful🖤🖤🖤", "camislove44": "💕💕😍😍", "gildapapoose": "Yessssss", "ocar_yellowrose_": "Aww so beautiful 😍 so sweet ❤️💕❤️", "monazite_": "😍❤️", "millygrace96": "Beautiful beings 😍😍😍", "dnnnise": "♡♡♡♡♡♡♡♡", "biggalyoga": "Stunning 💓", "o_rahh": "You are a gift to the universe.", "jen_nybean": "Love this 💖", "nolasavedmysoul": "Beautiful picture", "tayshouseofvinyl": "Yesssss! This is Love!! Thank you for always sharing your journey with us.", "srira_cha_cha": "Beauty at its finest ❤️❤️", "fly_robinfly": "Omg! This is beautiful!", "chaninicholas\nVerified": "Verified", "quani_mc": "This be love language without the words. Blessings", "janiellemckoy": "Beau-Ti-Ful!!!!! #blackgirlmagic👑", "blairartthou": "💕💕💕💕", "sun_rula": "😩😃❤️"}