{"ashdanley": "🙌🏻preach girl!", "nookiecookiez": "💛💛💛💛💛", "blooming_lotusyoga": "#truth 💯", "ellewilla": "@megglesbee", "vividhaiku": "Why not go to Thailand? Amazing medical there. 10% the cost.", "jessicahollyabdo": "Thank you for sharing this! ❤️ When I had cancer it was a rare form of lymphoma that was in my skin cells. I had it for at least 4 years before it was diagnosed & during that time it would visibly diminish in times of lowered stress, then with increased stress it would grow & turn from light pink/red to dark purple & the pain would dramatically increase. I’ve seen the proof, cancer as well as other illnesses grow & feed off stress. This is crucial! And when dealing with chronic illness or any illness having an advocate is crucial. Many patients develop PTSD from traumatizing Dr. interactions as well as the billing side of things which can be a nightmare. Thank you for sharing this, it’s so important. Glad to hear you’re doing well. ☺️❤️", "happy.yoni": "Outstanding one!", "pri_kuntgen": "You are so inspiring!!!", "jovie2005": "❤️❤️❤️", "cosmetologist_ari": "#AMEN", "maggie_griffieth": "I deal with this also after being in a car accident and having degenerative disc disease, doctors refused to treat me like I was in real pain because I’m so young but have a spitting clean health record prior to all of this. 2 years later fighting to be heard and literally crying in front of doctors I found one that takes me seriously and goes by the tests not his option!", "karagibbybeauty": "I have been suffering a mystery illness with extreme chronic pain for 7 years. Each time I ask/tell a doctor I need to be treated as a whole person...as if each & every symptom is connected...I am quietly, politely ignored & dismissed. 7 years of my life unable to be the mom I want to be, the wife I want to be, and still no real answers. If my doctors can't or won't help, who will? @ihartericka", "richardthruster": "Hot woman!", "firstbreatheaftercoma": "❤️❤️", "charlotte.eas": "@lucca.cae", "eilovedesign": "Gorgeous girl ♥️ thanks for love yourself", "fauxtograpiv": "✊🏾🖤🖤🖤🖤🖤✊🏾", "balletmeli": "❤️", "sashita8": "@ihartericka You are incredibly brace my sister.", "chrispatten": "No country without an NHS, when it can afford one, can be regarded as civilised. In fact, it's the very definition of a shithole.", "bx.im.bre": "BRAVEEE ❣", "puremox": "Wowww all of these things. When I think how hard I fight for my health and eventually I became homeless over AUTOIMMUNE issues is ridiculous. The experience I have had in the medical industry is hardly the worst I’ve heard also. It’s wild. Thanks for being so beautiful and standing up for yourself and others like this.", "thedanielleyoung\nVerified": "Verified", "jocelynchmelyk": "So good! Thank you for your long stories where you discuss what is important - it’s like a mini-podcast episode and it’s greatly appreciated!", "ariananashay": "😍❤️🙏🏾", "blue_fairy_magic_": "💜💙💜💙💜💙💜💙", "sarah_a_sellers": "P.S. You’re the best.", "sfair17": "Rude", "dreamingofshy_": "❤️❤️❤️", "baddiebarbie_barbiethings": "👸🏾👸🏾👸🏾❤️", "theresatakesphotosofstuff": "❤❤❤", "corinaluck": "F u c k", "rrrrechelita": "💜", "soulwithbeauty": "Sad how much our society values money and neglects basic human needs. 😘❤️", "samcharley10": "@zach_the_pilot67", "k8maxs": "🧡💛💚🧡💛💚", "shes_a_charmer": "Wow, you are strong. I am in awe of you. Such an inspiration.", "blackbrains88": "\"So confusing it feels deliberate\" #facts my thoughts exactly 😌", "captjhax": "You are so amazing. Thank you for this.", "timiljones": "Preach ❤❤❤❤ and so glad you're #StillHere", "littlesquares": "Thank you for speaking out ❤️❤️❤️❤️❤️", "keeyyss1": "I’m glad Your still here , Your posts encourages me as I help my granny with her breast cancer journey. It’s tough for all parties involved but just know you have someone who is praying for you", "4.badbitches_": "😞🖤🙏🏾🙏🏾🙏🏾", "liveonthebeacheveryday": "Beautiful", "kravekyi": "❤️🙏🏽", "kaeroshon": "Amazing❤️", "shesoeffinsassy": "Thursday is my date with my breast surgeon. This fucking tumor has tried to kill me. I’m scared and that’s ok but I’m ready. Whatever the outcome, I won’t let this take my life...", "kani_burgos": "@2_nae @allisonrandb @fefie_xo", "tommylazcano14": "Amen", "doll__rodriguez": "God bless ♥️", "ksthornty": "This is powerful. In the U.K. now we’re facing an ever increasing private healthcare system as politicians push to privatise the NHS in an attempt to solve our national debt. You want to solve national debt? How about you stop funding warfare and put some of that money from weapons research into the public sectors that desperately need it. The worst part is so many of our population are brainwashed that they forget to look at America and instead blame each other for our social shortfalls. I hear people daily talk about how privatisation is ‘the only way’ when in reality it’s a poor excuse designed to curtain the real issues. @ihartericka", "hanzdub": "Yes 🙌🏼 I have a chronic illness and also happen to be a social worker. I have literally been trained to advocate for patients (myself) in a medical setting, and I still have a really hard time getting the care I need. It drives me up the wall. How is anyone supposed to get the care they need in a system like this???", "__lone14": "🙏🏾🙏🏾🙏🏾❤️❤️❤️", "ourbocaprincess": "Respect ❤️", "stuzoclothing": "👑👑👑😘🖤🖤🖤", "gurue": "Amen!!!! Well said! I express this daily", "blacktranstv": "🗣🗣🗣🗣", "anja5213": "My house burned down and Aetna refused to provide me with thyroid disease medication saying, you just filled it. What do you not understand about my state is burning and my house is gone? They told me to visit an indigent clinic. I said, no! I have insurance and pay for my drugs before I end up in the hospital! Damn. It shouldn’t be this hard!", "iam_freco": "🙏🏽🙏🏽🙏🏽", "harpervalley": "Yes! I saw your story about wearing a wrist band at the doc’s office. My oncologist does the same thing and I hate it. So triggering. Makes me feel like I’m in the hospital.", "mobetterbutta": "Say this!!!!", "chiliads": "Strong words from a strong woman...I admire you ❤️", "brittanytnorth": "It shouldn’t be a privilege to see a doctor whenever someone needs to. It should be a right and that’s where our country fucks things up when it comes to health care.", "drpetesulack": "You are awesome! love it", "kristyk_fatgirl": "Amazing strength!!", "woldjine": "😍😍😍", "samanthalinatok": "Your soul♥️", "ellie.johnsonxo": "@_abbieq", "amber_jones789": "U looks more than good ur look beautiful what a stunning soul and pretty girl u deserve happiness ♥️♥️♥️♥️♥️", "dillllnpickle": "Thank you. I’m drowning in past due bills and can’t afford my own co pay to get my reconstructive surgeries finished. It will be 5 years since my mastectomy.", "wholelivinglosangeles": "Preach.", "marydthejerzeyb": "Amen🙏🏼👏👏👏👏👏👏", "snicole.x3": "Ohh yesss❤️ Amen", "_.10j": "Amen❤🙏", "missmichellemaster": "YESSSS. Thank you for this. So well put, people need to know about this. I often say the stress of juggling “the system” and medical bills, etc would kill me far before the cancer. It is something that people just don’t understand, thank you for sharing🙌🏻❤️", "arlinalmonte": "💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼💪🏼", "1certifiedbaddchick": "Amen", "maellekrvn": "🙏🏻🙏🏻🙏🏻", "lilit0rres": "Inspiration 👏💫", "cesmiiigood": "Omg your beautiful", "luena.5": "💪🏽💪🏽", "wickedwitcharika": "I had a disassotive mental break due to a very traumatic event combined with my son being diagnosed with autism and a serious growth delay.I was prescribed a cocktail of anti depressants, anti anxiety, and sleeping pills. I told the psychiatrist I didn't want pills( mind you I had a 3 week old baby) I needed help and talk out my problems. I was then offered 1 week of group life skills therapy! Really I said...the dr apologized and said the mental health system is overwhelmed and they can't just talk out everyone's problems there is not enough time, and therapists. I said wow...but if I go home and kill my children and myself then I'll get help in prison💁🏾 she just gave me a blank look. I left there and went into a deep depression that had me unable to function for 2 yrs. then I decided I wanted different and starting running(not saying that's a cure ) but for me while I was running I got all that junk off my soul. I went back to work, and I'm slowly putting my life back together. I was very close to just throwing in the towel on life and then it clicked. If I can be so very low on one side of the spectrum of life, than I also could be equally high on the other end of the spectrum . The mental health care system is a joke in this country ! Just like the health care system. Ppl need real ppl to talk to not pills to numb everything and ppl need real food to heal their bodies ! Our system is one of disease management and trying to wind ppl back up after they've come apart.", "_touchofnene": "God bless you", "ivana.gabela.etimani": "You are incredible ❤️❤️❤️ simply incredible!", "yung6ullcherish_": "Amen", "blu_ice43": "Eww", "thadpole1216": "May Heaven give you complete and speedy recovery!!!", "evelyynn.r": "Amen", "stacieduval": "Your beautiful!", "laurenkellybenson": "“No one should have to fight to be cared for.” Wow. Thank you, sis!!!!", "firstlaedy": "THANK U FOR THIS! ❤️", "burnsandre": "You are my sister I have so much love for you I hope you love me too God love both of us then we know stay as beautiful as you are love Andre God Jesus Christ is good all the time love Andre", "lena_m.m": "Beautifully spoken", "kelseybraff": "You are such a gift to follow and watch grow. Thank you for educating us on so much when you don't have to. Black girls are fucking amazing. Thrive, boo 💖", "darkandlovliii": "Keep God first, Stay strong and positive. #youwillliveandnotdie..", "artsyspirited": "You are so inspiring! I love you!! 💖💖💖", "saltysweetseasons": "PS you’re a goddess 💗🙌🏽", "mightymattdogg": "🖤💚❤️ Queen. Thank you for shining so brightly.", "special_k37ilikefacebookbetter": "Love these real shares. ❤️", "zancestrydotcom": "You’re incredible. Thank you ❤️", "kaylacsosa": "Yes thank you 🙌🏻 feels so good to read those words because I have thought them many, many times. I have chronic pain and have been through many many issues with doctors and been scared at home wondering what’s wrong with me, and can’t afford to go get it checked out. This healthcare system needs WORK.", "court.tangihaere": "@calvnhd Watch her stories 👍🏾👍🏾👍🏾", "audri_burgin": "❤️❤️❤️"}