{"mazzy379": "A fucking men. Sad reality 😩", "khyentsemoon": "Musty white and black folks lol", "zoe_blundell_tattoo": "This makes me so sad and so sorry. Ed needs to use his white privilege and speak out about this to make this a topic of conversation between white people and why it’s not right. If he’s using his wealth for one thing then at least become an activist for these issues and make an example from it. People will only understand when it is explained. I love this page so much because it helps educate my ignorance of what people of colour go through every day. I am actively trying to educate my white friends and family on these matters so they know - cause the ignorance is real. Peace and love 💛", "rockstarsocialworkteacher": "And I know as a black woman, I could never get away with wearing some of the things I see some of my white colleagues where that seems to be okay. So art imitates life imitates art. This kind of expression of white privilege happens in every parts of our Lives. Sad commentary", "layinthefire": "Exactly.", "barbs_cr8v": "If you know anything about Ed Sheeran then you know that he uses his celebrity or any other privilege to help Children’s charities, etc. and that he is into trainers and watches but not high fashion. Beyoncé obviously likes fashion and expressing herself that way besides through her musical artistry. This is who Ed is and we love him just that way.", "whysobasic": "Personally I think she looks overdressed", "underwatersociety": "@ryan_secretmedspa ok my last tag was funny but this is real.", "oliweight": "Can’t people just be who they are? This is just how Ed portray himself... Beyoncé looks incredible and well... she always does. Because that is WHO SHE IS. This has nothing to do with gender. I’m a firm believer you can tell what type of person/personality someone has off how they dress. For Ed. He is just a laid back guy who just likes to sing and play the guitar. Beyoncé is fun and full of beauty and makes herself light up even more with her outfits. (If her voice didn’t already) people just are being who they are and want to be. That’s all.", "primer.online": "In order to erase the lines of race, we need to stop trying to define it where it doesn’t exist. Ed would probably dress just like this at his own wedding, it’s just who he is. And quite honestly, when I see people looking sloppy while they are out, it just sends me the message that they’re a sloppy person in general, no matter what race they are. Let’s not always draw the race card, guys.", "bnanajae": "It really needs to stop, we all dress what we want, it's not about privilage, it goes for evryone, white black asian or anything ,no more hate", "trashley5000": "i laughed at this so hard. this image sums up what it's like to be black and female in america. and then all the \"uwu we're all just human uwu\" people in the comments. like omg 😂 woobie ignorant you're part of the problem honey, hush.", "felyan_19": "Black Lives Matter = BLack people KKK. Let the truth be said. With it you shall deal. B|", "sakelibak": "In the Swedish Idol programme there was this girl coming in to sing before the judges wearing a knitted shirt, glasses and no makeup. She sang beautifully. First the judges were like: \"is she really an artist looking like that?\" But after singing the man was like \"hell to the yes, ofc you should be in on this\" but the female judges just looked at her as if she was a hobo. They didn't talk at all about her singing, they just said that she doesn't look like an artist and can't be one. However, the amount of guys going in there on auditions, looking like they just rolled out of bed is always okay and never frowned upon. I can't even imagine how much worse it must be when you're female AND black, having to push yourself even harder since you're undermined even more by society.", "bellyyyo": "it's fine that ed has his style, which had always been super low-key one man & his guitar thing, and bey is an insanely good performer, but it's also true that women couldn't get away with the same thing", "vitaliii87": "die stupid bitch", "bistryiczech": "Are you retarded?", "milavitagrande": "She's crazy, who allows her to speak at all? People listen to her !!! OMG! Block this account! Fucking racist and man-hater!", "danil_zinger": "That post is so fucking stupid 🤭🤮 Hello from Russia and Ukraine 🔥", "brutalponyriders": "I'm proud of beign a white man. Every racist and sexist hates me just because I exist.", "tsay.vyacheslav": "Ебать ты овца! Тогда ты просто против голодающих детей планеты, из-за того что ты ЖИРНАЯ! Они смотрят на тебя и плачут, почему они голодные, а ты жирная! Почему ты ешь так много, что можешь жиреть, а они даже по необходимости поесть не могут! Я против притеснения голодных жирными! #nofatforhungrychildren", "artisticflair1": "@barbs_cr8v it’s not about Ed Sheran specifically. The bigger picture here is that he has the privilege to do the things he does, as white men often do, white men who all don’t support charities and shit. And even though he does that that definitely doesn’t mean he isn’t helping perpetuate the system?? Donating to children’s charities doesn’t exempt you from needed to learn about your white privilege and dismantle it.", "kate.marling": "This is something that I would not have noticed on my own. Thank you for taking the time and energy to explain this.", "joe_walkerr_": "Ok fuck off", "atusonje19": "this is really a reach.", "mamacass_1920": "My mom is 75. Whenever she flies down here to visit she feels the need to be dressed up. It’s so ingrained. She will not get on that plane in a t-shirt and jeans.", "momtiredlove": "@amiee_m", "refnedge": "👏👏👏", "lorrainedeux": "You claim Jay-Z never dresses like this around Beyoncé but a quick google search proves otherwise....Beyoncé performed in a hoodie and shorts at Coachella. I am sure if she had a look at the examples you just shared in your post she would disagree. Why would she perform with someone who didn’t share the same beliefs as her? You also are referencing hip hop culture if anything hip hop culture has empowered urban clothes to become accepted now. Why do you think Kanye was able to sell a white T-shirt for $120 and sell out.", "_miz.khalifa_": "Yaaassss", "jul.elizabeth": "huh. didn't think of this way!! I thought that the conversation surrounding this image was that it's a charity for preventing poverty and while I know Beyoncé didn't buy the dress n the designer possibly could have donated to the charity in exchange for her wearing it, she's still wearing a thousand dollar dress to a charity event with a dress code casual enough Ed can dress like that. thank you for speaking on this and bringing it to light, I've never been aware of this issue ♡", "kkmanne": "@heatherkparrish", "fullbloomlingerie": "Hey @ihartericka Genuine question. Do you think Beyoncé likes or chooses to wear these clothes or do you think the notion you just explained is still ingrained in her? ❤️", "ashtstc": "This actually is a great explanation about something I completely did not understand. When someone simply posted the pic, I didn’t get it, I just thought oh, well they just dressed to their preferences. Thanks for this explanation.", "laurabhyman": "@sharabkaufman super interesting conversation", "capt_redbeard111": "This is the dumbest post I have ever seen on social media. Plenty of well off people of color dress basic like Sheeran. You just aren’t paying attention. Michael Jordan dresses like bill gates. And what about people like Lil Wayne who look like absolute trash, act like trash, and are still filthy rich? You are cherry picking to fit your narrative. For the rest of us there is a reason they say ‘dress for success’, or ‘dress for the job you want, not the one you have’. If you go to wall St you won’t see people working in T-shirt’s and jeans, no matter what color they are.", "j.bachlein": "@mlmny I didn't become a snowflake, but I applaud your need to use a meaningless word. If you have to go back hundreds of years to try to make some point, then it is no wonder you feel the way you do. Keep playing the victim and see how that works for you. I've chosen not to and will not blame white people for MY life.", "sonalifiske": "Every. Single. Word. 👌🏾", "g.22182122": "this caption was so pleasing to read . so well put together . pointing at all view points and answering the thungs people might argue w at once", "jstlkm": "Honestly it's so fking disrespectful to Beyoncé to get on stage with her looking like this. He's like the dudes that don't brush their teeth or put on a clean shirt before going on a first date with a glamorous woman and still expecting to go home with her", "marguerhidhy": "(", "alewoo_": "LOLOLOLOL", "seanrosswell": "I have spent my morning researching reactions to this performance and have found no response from beyonce herself. I respect that different communities and different people of intersectionalities are made to bend towards cis heteronormative white norms, but has anyone considered Beyoncé’s privilege and her autonomy? Has anyone asked her why she chose that dress or if she feels safe to dress casually if that were to be her desire? I am absolutely open to the realities in which she genuinely feels pressure to dress a part to prove she is that part while Ed feels no such pressure.... but I am also open to the realities in which beyonce just loves that dress and chose to wear it out of passion and not fear. I think guessing around her choice dismisses her voice, autonomy, and intelligence. Open to thoughts and feedback from all perspectives. Just curious if anyone has heard beyonce’s POV?", "alinarrrr": "@hanneloremett absurde Diskussion aber ein bisschen passend zu dem worüber wir im Urlaub geredet haben 🤨", "shyliamarie": "Beyonce probably looks bomb in jeans and a tshirt!!!❤️❤️❤️❤️ where's casual bey at and when can she arrive?!", "lerinalta": "🗣 A most holy accuracies of holy accuracies!!!", "maryjump": "So Rachel Cargyle just posted about that idiotic white girl dancing outside of the Marcy Projects for Jay-Z’s bday (😒) and I think it further prove your point of white privilege and what’s acceptable to wear and do. It’s a whole new level of white privilege, especially considering there were a lot of people saying it’s only acceptable for white MEN. White women do this shit too.", "anniesoberinsandiego": "True, true, true.", "jahlen.tjohnson": "I’m really not trying to be rude and maybe someone can explain this more because I’m confused. If Britney Spears was performing with him she’s be dressed the same way because that’s how she dressed. Ed Sheeran has his own style just like Beyoncé does. He always wears tshirts and jeans. What should he have worn? What could they both be wearing that would’ve showed no white privilege? I’m not saying you’re wrong I just want to understand and I honestly don’t", "nitsuguatellom": "I cannot help but feel more and more pissed everytime I see this kind of post... I absolutely do not mean to pretend I can imagine perfectly what it is to be a black person in the US since I am white and French. Buuuuuut... Don't you think that by taking stance on everything you consider racist and screaming \"look at this new proof of inequality where we black people are once again downgraded by white privileged people\" on every single occasion has the opposite result to the one we should all get to ? For example, I still cannot understand the reason for your post and all the reactions that followed... To me, this is just a singer with his aesthetic signature and another singer with her aesthetic signature performing a show together. He built his, she built hers. I think Beyonce is clever enough to impose herself as an independent woman, black or not. So I am having a hard time thinking she was a victim of \"black/white oppression/domination system\" during this show. What I am trying to say is that by calling out to racism for every detail and therefore making the separation between white people and black people always more tangible, we are not making the situation any better. Always the same scheme \"black people on one side, white people on the other side\". And this applies to any other conflict, and this is where the world is going wrong. As a gay man, I cannot bear this community effect sought by gay people. As a reminder, the first gay activists fought for equality of sexuality, which means they fought so that no difference would be made between a straight person and a gay one. Now, what we see is the completely opposite situation. We see gay people as a group separated from straight people. They claim for their freedom on behalf of the \"gay community\", community which is an illusion and which is the only gay reality people witness. Hence the gap existing between sexualities is getting wider and wider instead of closing up. Which is why as a gay man, I absolutely do not feel part of this gay community, and I even feel hurt everytime I witness such biased activism. To me, the same thing is going on in this conflict btwn black and white people.", "sandi_phoebe": "💯 on the nose. I’m in total agreement of your statement. Jay Z would never be able to dress like that. I also had this discussion with a friend regarding gender a few weeks ago, how as a woman I sometimes feel like I am not successful enough due to not having the energy to “dress the part” of power and present myself in a certain manner. As a white woman tho, if I were quirky and confident and outspoken tho it would probably be overlooked 🙄 A woman of color could never overcompensate enough to be viewed as worthy (or intelligent) if wearing overly casual garb.", "etmafrance": "Talk about the white supremacist optics of evaluation Ericka! We are sipping truth tea this morning. ✨", "iamanadiamond": "@xhallez", "heykrystyna": "“Jay z never performed alongside Beyoncé in a T-shirt and running sneakers “.... Um yes he has", "kellymk16": "So messed up. So true.", "heatherbpace": "The conversation in your IG story really opened my eyes. Thank you for educating me.", "davidgrandfield": "How dare he. 🤮", "readerscramp": "@stephieef", "afroroseblossom": "I usually agree with your points, but this is a reach. If Beyonce wanted him in nicer clothes, he would be. But She’s allowing him to be his genuine self while sharing her stage with him. This is nothing more than two people performing on stage, but somehow you stretched it beyond what it was to fit your narrative. I see what you’re trying to say, but your example is misguided.", "sassimebio": "I guess I struggled with this because I am not American. In Nigeria, we have black female artistes that dress to the hilt like Tiwa Savage and people like Teni the entertainer that will wear an oversized T-shirt, a pair of jeans and a durag and both being black females have no 1 songs across the country. Like Weird MC who had one of the biggest hits some years without wearing a stitch of makeup and wearing an uneven Afro. Maybe I should always read the captions bearing in mind the US is not the world.", "ambroise_finnick": "When hundreds of black women tell us in the comments \"I have to dress up by fear of not being respected and potentially loose my position while my white coworkers could come to work in pajamas if they wanted\" maybe we can, you know, believe them? Acknowledge them? Understand that this is not a coincidence? 🙄", "meiry_martins": "OMG! So real! I'm starting a career as a singer and it's insane how much time I spent learning how to dress to make my music, my thoughts be heard. Sometimes I Wonder if I could Just make music, not be so worried about the labels. But I'm trying to find a balance, and trying to put this in my whole work, we have to believe and actually do something, anything, so that this may stop!!!! Love you 💜 kisses from Brazil!!!!", "darkbride": "Wow! Mind continuing to be opened. 🙌🏿", "ves_anderson": "@radicalcuteness wohl eher white male privilege", "j0leenx3": "I’m just wondering though... Beyoncé is smart. She knows how to use her fame for activist agendas while not endangering her career (just remember her pregnancy post 😁). So out of aaall the dresses she could have worn standing next to Ed... THIS is the one she picks rather than a more elegant one that is more subtle (which is just as acceptable by celebrity standards for black women). Don’t you think she might’ve chosen this extra extravagant one on purpose to get people talking exactly about this? Sure seems like something Queen B would do. ☺️👸🏾", "lovefola\nVerified": "Verified", "ta.mara.li.jien": "As Olivia Pope's daddy says \"If they're good. We gotta be twice as good.\" same applies to dress code 😭😭😭", "yeattherich": "👏👏👏", "gasponce": "In my eyes this makes Ed look disgusting and clearly disrespectful towards Beyonce. Not Beyonce look bad. She is always super extravagant/ over the top and he is like he's been wearing the same outfit three days in the row and also sleepin/eating in it too. Not good etiquette.", "libeldragonfly": "Would you say that these racial differences with regards to the way you have to dress are different in the UK and the US? Also, what do you think about black femmes dressing in the style of for example Nicki Minaj? It’s certainly dressing up, but in a way only black femmes would get away with? I’m mixed race from Europe, so I’m trying to understand.", "puppies.and.yoga": "It took me awhile to see it. That is my privledge.", "elyseastvillage": "He’s so boring I could care less about him & his white privileged butt.", "urban_brahman": "Stop on. When I wear a skirt it has to be robe like. People make excuses for my gender expression instead of accepting my aesthetic as it is. It’s interesting how black people by default have to use “pretty privilege” to survive and be seen as valid to the white gaze again only to be clipped down by jealously, anti-blackness and misogynoir! Another thing about blue eyed soul since we are here, it exists in a vaccuum. White soul artists are “inspired” by black music and black artists while black people are inspired by black people it just have naturally raw talent. Whiteness is such a performance that operations on theft and mediocrity.", "mysurrealife": "You don’t think Tracy Chapman is a household name to people in their 30-40s & older @ihartericka ?", "_itsgabriellle": "@mrjiggledaddy", "moonceres": "Sad fucking truth", "menahdrawings": "Thank you for sharing this, Ericka ❤️", "sinoparin": "I'm white so really can't comment on the race issue but I think it's rude af for Ed to dress like that while Beyoncé has made so much effort. In the same way I'd be pissed if I spent ages getting ready to go out with my fiancé and he just threw on some sweats. It's a sign of respect imo.", "mlilo.mpondo": "Are you saying that Ed Sheran is allowed to be under dressed because he is white, and Beyonce alongside other black artists cant be under dressed because of their black race, and that this illustrates white privilege ?? If this is what you're saying and ive understood you correctly, then you are seriously reaching and reaching has a strange way of diminishing genuine motive. Let our rhetoric not turn us into one trick ponies", "royalpaladin": "wow, i hadnt seen this image till just now but it really made me think. an aside, ed sheeran is the epitome of white crustiness 🤢", "pualanastyle": "🙌🙌🙌🙌", "findinggoodtimes": "I understand this 100% but I think the marketing theory behind his look is that he wouldn't look good even if he were dressed in the most dapper of suits so just go the whole other way and dress him down....", "emlzz": "When I first read this I got confused. But after watching your story I truly am beginning to peel away the layer I have that allows me to choose to see this reality or dismiss it. I really appreciate your work as it reminds me how much I need to listen.", "satatmakaur": "Who the F is Ed Sheeran anyway that he can stand up next to Beyonce?!", "michelledaylene": "Thanks for the education, I would have never clued in", "tkay17_": "I, like many others in the comments looked at the picture and thought “What’s the big deal? They’re each dressed how they always dress at a performance!” But when you stop and think about it and truly focus on what people are saying, it starts to sink in! Thank you, thank you, thank you @ihartericka for being willing to educate and work with white people about acknowledging white privilege/supremacy! I thought I was on top of shit but I still have things to learn! 🙏🏻❤️", "angliciousnes": "@loshrachel", "mollena_lee_williams_haas": "...not sure Ms. Chapman would fall under the \"femme\" classification.", "limitlesslola": "Facts 👏🏾👏🏾 I wasn’t even allowed to wear sweats out the house growing up smh", "honeybobadoh": "so fucking true. ily for speaking the truth 💕🙏", "loishoneywill": "Thank you for this post. It's so important and educational. I had never thought of this (as I probably don't have to!) So I appreciate when it's highlighted to me. You're amazing and I love you're work, messages and continuing fight for equality ❤️", "chinkychamp": "Who the fuck cares 😂😂😂digging way to deep stop getting offended by everything Ed has never in his career worn anything flashy thats not a \"white\" thing thats an Ed thing the fuck look at JB with his expensive watches, chains and clothes wealthy people (especially celebrities) unfortunately want to display their wealth it has nothing to do with race it has to do with perpetrating an image. There are tons of black celebrties who do not promote wearing jewelry nice clothes or flaunting wealth in general i.e Charlamagne Tha God, Edris Elba, etc for various reasons. Beyonce has every right to look as beautiful as she pleases and Ed Sheeran has every right to be as bumming as he pleases... STOP GETTING OFFENDED BY EVERYTHING.", "iliveinlb": "Umm, jay I watched Jay Z live- totally perform next to Beyoncé in jeans and sneakers 🤷‍♀️ Beyoncé is a little more sparkly than most people and Ed is a little more laid back. Look at Elton, Bowie And Freddy 💕", "saviorself___": "So so true!!!", "thefallonbrand": "What makes me uncomfortable is how Beyonce isnt hardly ever at the BET awards or \"black awards\" unless shes getting an award and sometimes doesnt show up for that but shes always present in white spaces. Privilege is a mother fucker though!", "anasofia.f": "I do feel like it's more of a gender issue? Every femme concert I've ever been this is what women dress like...??? And yeah I know I'm going to get comments that I'm. A horrible person and I don't get it. If still like to say what I have seen on stages throughout my life.", "thefullestmag": "❤️❤️❤️❤️❤️", "franciathegreatt": "Fact!", "justicelovemagnetic": "Thank you for this perspective, I see it as an issue of the intersection of white male privilege, specifically, as most all women are familiar with the pressure of their appearance. Yet I recognize you are speaking from a perspective I don't have and I appreciate it.", "lizard_found_joy": "I was reading an academic article on the constant scrutiny, politicization and hypersexualization of Black women and femme’s bodies. Unfortunately I can’t remember exactly which article. It talked about the teaching reviews that students left for this very successful black woman professor who was a leader in her field. It was much more common for Students to leave scathing reviews that were highly personal and unrelated to her teaching quality, course content or curriculum: about her personality, body shape, what she wore etc. Whereas the reviews they would make about other female professors would be very different in tone and content. This is most definitely about race/gender.", "luckoftheirish_333": "I was watching Red Table Talk live on Facebook and the producer whom is white skinned said something that really struck me to my core, the privileges we experience often is what we don't have to face on a daily basis compared to anyone of any other race. I don't have to worry about my skin color affecting my everyday life, unlike other races. It breaks my heart because it shouldn't be that way! Like you said even in the way you present yourself with clothes has to be analyzed as a person of color, I can't even imagine. Seriously learning so much from you Ericka, I appreciate all the knowledge you provide!", "raha_thankyou": "Look like she picked the one lucky guy in the audience to make his dream come true. Beyoncé and the vanilla factory.", "crhain88": "Well, there is that time Jay Z performed in sneakers and Tee, and Beyoncé had on boots and tee... I think she still has a career. https://youtu.be/pLWvvskiSEk", "sxnoir": "Hello Erika ❤️ I was just DM’d you something important about a protest I am organizing and I would love if you could check it out... thank you so much for the work you do 💪🏾❤️", "womxnn_": "It jumps out at job interviews, grad school professional events, everyday work attire, dates, grocery shopping...what'd I miss?", "soft_belli": "Eewww", "k.mariekim": "Thank you Erica. JFC ....", "mindfull.mary": "I’m trying to come up with any female pop star these days that doesn’t have to go all out with how they look.", "daniwilliams__": "@k_atie_porter another person I absolutely adore and whom is always talking about the important stuff", "ginapgrant": "Perfectly said.", "elizabethofarrill": "Omg thisssssss!!! In so many ways this. In all aspects of life. This! I have an actual outfit I wear for my sons parent teacher meetings and other school functions because I get this. Same for my son. I know he can’t just wear the same raggedy clothes his all white classmates be wearing because he will not be judged/perceived in the same way they are. We always have to do extra/look extra just to be taken seriously or not seen a certain way.", "swagecoutay": "not everything is a race thing :) 💞", "msholmesmusic": "Wow", "ponk.konk.11": "The amount of people who like to assume his aloof dress during a formal event is an 'f capitalism' move without him having to say so astounds me.", "jennahturp": "@isntitapitty", "landofinkandgraphite": "White people trying to refute this need to take a step back and realize y'all cannot examine a situation like this in the same way Black folx can. Listen to Black folx and trust their judgement of a situation.", "msmurphyslaw": "They’re tearing into Shon Faye on Twitter over it too. She made some joke about how dare someone dress so casual in Beyoncé’s presence 😂 people take some shit too seriously and this is the PERFECT example of how standards are just non existent for white men 😫", "mollzdeep": "Damn I feel like I need to go to college to understand what everybody is talking about in yhis post 😭😭😭", "ayeshahgeorge": "Although this is facts, I think we also got to consider who they are marketing themselves and their music towards. Beyoncé will be trying to attract a complete different audience to Ed Sheeran, and will have to tailor their look and brand in completely different ways.", "catsocks": "Ed Sheeran is a mess they shouldn’t even be in the same building", "suki_miyoko": "But this applies in the work place to. Too much to write but In short my boss (Black woman) always seems to stress us about our “professionalism speaking through our wardrobe”. In fact EVERY JOB I’ve had since undergrad has preached this same thing while my counterparts show up to meetings in jeans, sneakers, etc and are never chastised about it or written up for it. I take pride in what I wear and how I look and I hate when my braids, natural hair, jewelry or braids are deemed to be “ghetto or not work appropriate” while my counterpart can come to work hair unkept not washed, Uggs on and it’s okay 😒", "saila.anitta": "I live in Finland but did a teaching gig in England for three months and was shocked about the dress code. I regularly go to school in jeans and Ts and nobody thinks less of me, I’m by far not the only one. But I do realize I’m white but his just came mind. In here, anything more than a casual dress is considered overdressing here.", "samtastic4": "@ihartericka thank you for this. I had to read through some of the comments to get the whole point and as a white person this never would have crossed my mind, which is part of my white privilege. Same way it never occurred to me that my sis’s wife didn’t want to come see fireworks because she doesn’t like being the only black person in a group of people. From what I am understanding is it that black femmes (and is it only femme’s or do male identifying black individuals also follow this as well?) always dress put together and nice so that white people or society in general isn’t like “oh well there goes another one of ‘those’ black people?” That one aspect of white privilege is white people being able to go out in pjs and shit and not be judged or still being able to enjoy good service and no weird looks? I am also assuming this is something people want changed. I would imagine it’s a burden to always have to be on point when in public. Not to mention exhausting. Thank you again for shedding light on things white people would otherwise have no idea about.", "leigh_jewellery": "White privilege first and foremost. Male privilege second. This photo is a pile of garbage and it makes me angry every time I see it.", "joy__ha": "Thanks for pointing this out. I really wouldn't have noticed and it shows me a lot.", "yosefozia": "Ed Sheeran always have not been flashy guy. You are reaching", "lauren_gianna_": "I feel like this is a stretch?", "_______ec_______": "@allieofarrell This was enlightening for me. Also, you should follow this account! ✨", "arthurgaribay": "@kellyvu", "katayounjalili": "Such a weird set up!!! He shouldn’t even be next to Bey!", "ryanw__": "Yes yes yes way to be able to analyze just how loaded the juxtaposition in this image is!! Thanks for breaking it down and speaking on the bullshit Societal Pressures!!", "56kilosdesabor": "@ihartericka this post, and the conversation you had with Ebony in your stories, was really thought provoking and enlightening. Saving it as a resource for talking about racism and dress. Thank you! 💖", "mx_sugar_mamasota": "This photo reminds me of so many times I’ve gone to formal events and seen white folks dressed like it was a BBQ! The pressure for us to give 150% just to be treated equal is exhausting.", "pootbutt1959": "YES. We must learn to read between the lines🤔", "willowdaliance": "Didn’t Erika Badhu beat this scenario to the 1 billionth degree and also Lauren Hill and Missy Elliott who all have their own strong FEMME styles.", "cheer4blink": "It seems more like a male/female double standard. Ed just looks like a straight up slob next to her lol", "itsvikkikate": "This makes for very interesting reading, I wonder if things operate this way here in the U.K. also? I’ll ask my woc friends about it now for sure 🙂 Thank you for educating as always 🙏🏻🖤", "w_outanyeffort": "Yep. Perfect caption.", "xtinarw104": "Omg. I had this exact thought while watching it. Not as eloquent as you said but I was appalled. 😔😔", "scar__lala": "Great point- thanks for sharing this!", "caterina.manzi": "@thokozani.r.ngidi you’re always so worried about your hair being combed and your shirts being tidy, and I understand it’s a racial issue...", "mybodywpg": "“The privilege to not consider what you got on” Damn. I learn so much from you. Thank you❤️", "bonhamchristy": "I feel judged going outside looking a mess - as a white cishet woman. So I can't imagine what it must feel like being black, being a black woman, or add any other oppressed label.", "cypressdoula": "Testimony! Preaacch! Yes!", "aocarinapr": "@margarita_listisima remember the conversation we had about this? Siiigh", "laurenzerog": "Damn. Thank you. I would not have even thought of that, and it’s so real and apparent once it’s pointed out. ❤️", "kingcasssidy": "Had to meet w this white man for work....i went out and bought a whole new shirt and tie for the trip he shows up in a wrinkled polo, a zip up hoodie and running shoes with holes 🤦🏽‍♂️", "orlandigrant": "@miazzopardi this", "marilluch": "That shit IS deep", "m4gikarp": "Oh boy", "tarynpunch": "this white girl says you’re totally 100% right, it’s not a reach, or outrageous—fuck anyone that says it is, it’s in the fucking picture! the nerve standing next to Beyoncé, sharing a stage with her, lookin like that 🤬", "cryptdfox": "I never noticed this before, thank you for pointing it out", "iamloveq": "I am trying to understand. So what I am getting from the message is that we are held up to a certain standard in the way we dress, speak, think, overall being in this lifetime and white people are not. Like when we my grandma says “you never know who you are going to run into” so that’s why I never leave the house looking like I didn’t think about what I have on. But with my assumption, white people don’t think about it because the standards aren’t even in their mindset?", "6ftbeautygal": "I get it...for the simple folks let me explain. At my job I dont dresssed down so I cant be disqualifed for a promotion or new position based on my dress code. Granted we have white coworkers that dress like they just woke up but their attire doesnt matter even though we have the experience or education. I have to be constantly \"on\" so to speak to prove I aint no ordinary nigga, I hate that I even had to say that on text but thats the truth. I don't want to be grouped up with the other ladies that come looking any ole kind of way yet I come as if I already made it to prove a point! I am your next manager or supervisor and Im worthy of that position my white counterparts easily gets without an interview.", "djtjc": "something to think about! the genius of Beyoncé being wasted on picking outfits🤔", "camisslee": "achei pouco volume", "buhreena": "This reminds me of when a friend of mine who is Hispanic told me she would never dream of going to work without make up (which I regularly do, I’m white) because no one would take her seriously in her role as an admin if she didn’t look completely put together. She also told me she has to be conscious of what she wears just to go to a store because if she were to dress down (again like I do) she’d be followed around and suspected of stealing. Until she told me it didn’t even occurred to me that was an experience of brown and black people. But I’m so glad she did. Maybe it isn’t exactly the same but i think it’s related to the white privilege this post is about.", "tracyflowerchildsherree": "Who cares? I would love to see Ed and B at anytime. #begrateful", "m.musie": "Ugh I relate to this so much. Also applies to size/body type too I feel. Like Kendall Jenner can wear a plain jeans and hoodie and still look high fashion and super feminine and put together but if I would wear the same thing in my size people just see me as like sloppy or lazy or whatever", "youresuchabetty": "He does not deserve his platform.", "babychickan": "This is about branding. Beyoncé’s brand is as above. Ed sheerans brand is as above. If she was performing w Elton John etc he would too be dressed to his brand. In their business that’s all it is. Their class in this case far outweighs the racial disparity. That being said it is still true blacks have to work harder for the same recognitions in most of societies institutions. My Marxist fat black queer $0.02", "nattajack_art": "This is a serious issue. How do we fix it? What can we do?", "phillyslife": "@kyliemm84 Read this", "_alannagardner_": "This has come to me a lot as a therapist in private practice. I personally hate looking like a stuffy professional but feel the pressure to look “the part” for this reason. I’ve been defiant by not looking the super professional part and wearing things that are professional yet relaxed and in my own skin. It’s challenging at times even in something as small as this. But I do it for me and still provide great work regardless of how “the part” I look.", "_annyma": "👏🏼👏🏼👏🏼👏🏼", "ofshortreprise": "I have noticed that my coworkers of certain races are treated differently by other coworkers based on outward presentation, myself included.", "sugacake88": "I usually agree with most of what you say, but this is a reach.", "amilee94": "I enjoy following you aside from all your glory but because I get triggered. I see the flash and think what the hell are people bitching about now? Then I read the whole post take a moment to process and it hits me. All though my white as fuck experience still doesn't comprehend the whole picture, Im learning. Its horrible realising how deep it does run. Simply because we can't relate doesn't mean we can't take the time to understand. THANKYOU FOR TRIGGERING AND TEACHING XXX", "themixedupwriter": "This, all of this 🙌🏽", "tahliaxenia": "An his songs ain’t even that lit🤷🏻‍♀️", "supersonicgay": "Thank you for this, Ericka, truly! I hadn't seen the headline, just the tweets of people talking about Ed's clothing compared to Bey's and thought people were simply being mean and felt Ed should be able to wear whatever makes him feel comfortable, but I did not consider this at all and you make a very good point. It definitely gives me something to think about. 💖", "lensyo": "Same goes for female vs male, even just in a basic office environment. Women have to dress up to be taken seriously.", "appleyrdtara": "@niamhxh", "mollylovern": "@ihartericka *posts anything whatsoever about a lived experience of a black femme* White people in comments: defends whiteness. That is white fucking violence. Exuding anti-blackness on a black femme’s platform in response to the sharing of lived experience under the guise of wanting to “learn” and “have meaningful discussions”. The entitlement. Ericka, I’m so fucking sorry for violence you are subjected to while you are so generous to put your experiences on the line to educate others.", "homegrownkitchencatering": "well I think he might also just be kind of a slob and Beyoncé is a queen", "hairbymichellecastillo": "@joshuavandervort", "bettinakhan": "This is evident every time I buy groceries, get on an airplane, go to the bank... basically whenever I leave my home. It absolutely is a double standard — and I acknowledge I’m a non black, POC, cis female so I know I have it better than others. Thanks for sharing.", "samcelentano": "People make fun of the way Ed dresses a lot though. Like he won “worst dressed” in some English magazine for his constant casual dress. That being said, I definitely understand what you mean!", "ambsocray": "I.e. Bill Gates, Steve Jobs and other lame dressing white male CEO!", "justdonteventryplz": "I always admired beyonce because she ALWAYS looked perfect. Thank you for this. She might be perfect however she should have thr option not to be. The pressure is probably unnerving", "iamblaireporter": "@itsniaalleyne the timing of this", "danieb_makemyface": "👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾 Just up there completely compromising the integrity of her fabulousness!!", "ionafrancesca": "💛💛💛", "_beautiful.imperfection_": "I Ericka, I sent you a DM through Insta asking about your career. Could you please read it? Thank you - Iyanna", "bombasticvbabe": "@heydanigirl14", "brownsugarjew22": "I'm confused", "cristalsharris": "Beyoncé = literally every black femme Ed = every mediocre white man.... privilege = being on the same stage 😒", "tinsleytj": "I had always attributed situations such as this to the idea of African royalty. My mother always snubbed her nose at white people dressing down at church or weddings and reminded us that for a lack of better words 'were breed from royalty'. I had never considered your stance, but it certainly makes sense.", "capriceclassic__": "May sound crazy but this is their 3rd time performing together & this is the most dressed up fit", "gaytheglowinggray": "I feel like this is related to the fact that White women and femmes are allowed to be angry and break rules and conventions in the name of protest and activism, but the moment a person of color (especially a black femme) does the same thing, they’re told they need to “act professional” in order to be heard. White women can burn bras and scream “pussy power” at the top of their lungs, but if a black woman shows a hint of emotion, she is ridiculed and her opinion is discredited. It seems like even the ability to be angry is only afforded to the elite", "bde.veaux": "Facts. As a performer, and artist, it’s honestly appalling that we have people in the business that won’t honor their art enough to dress the part. Let alone, the issues of having the privilege to do so, which Black people have never had and continue not to. We always have to work harder and overcompensate for our God given gifts because they never believed that we belonged to begin with & THEY STILL Don’t!", "lovetruthandlisa": "@matweddle Interesting points here. In the comments too.", "elicia_g": "OHmYgAW", "dibsonraoul": "Thank you for highlighting this perspective. I'd have thought someone would at least make him put on a tie but it just shows he can wear something casual and look completely out of place and still no one will say wyd because he doesn't have to try as hard clearly", "summbody": "Wow...this has been on my mind lately. As I get older, I have a hard time going out of my way (and bank account) to out dress my peers just to be seen as acceptable. Same with my hair. I am aware of the fact that I am not taken as seriously, even though I work my ass off. I know the \"oh, your hair is so fun\" comments are micro aggressions. It's so depressing everyday.", "iamterion": "If this ain’t the muthafuckin TRUTH", "eleigram": "Tracy Chapman comes to mind. But not any one else.", "yleniaep": "Well put as always!", "mkc2000": "@killatheory your favorite guy", "nadya426": "Thinking of @princessnokia talking about if she would even be *allowed* (by industry, radio, etc.) to put out A Girl Cried Red after 1992, never mind that her style is always on point regardless of genre.", "alicebdenergy": "Thank you for this! I was thinking about a similar thing after I read a galdem article about white women and their hair. That it’s not dangerous for white women to not shave where as some woc have to shave bc they experience violence/ threats if they don’t. And I was thinking how often I rock up to uni with no make up on (even with bad acne) and often a shitty outfit and how many woc are in amazing outfits with amazing make up (fire btw) but it made me think how society holds woc to a higher standard and won’t let them be vulnerable and dressed down bc they will experience inflated structural violence.", "brianajacosta": "After you explained this photo I get it now", "aespragoo": "Can only imagine what would be said and written about her if she came on stage at any point in layered cotton and running shoes. It would notttt go well", "elizlove": "@m.jeezy6", "jpp_yeauknowme": "Wow. This 💯. I so thank you for this honesty and truth. I didn’t even think this when I saw the picture, and I know that is my white privileged AND I know my white privilege is sometimes hidden (to me) in plain sight, and now I have some more awareness and perspective so that I can open my eyes a lot wider to call my white privilege when I see it and to do something about it... I also see this immense value in opening my ears more to just listen and hear others and I am so glad that I started following your page. Thank you for being so honest and raw and calling things for what they are...", "melbell25": "First thing I saw. Look at her and he looks like he crawled out of bed and that is just fine? Terrible. Also, how dare he stand next to Beyoncé looking like a trash bag. I’m upset.", "bri__east__": "All. Of. This.", "et.hoe.pian": "mmmh mmmh mmmmh *begrudging disgust @ ws*", "ggbostini": "I get it. Ed can do whatever he wants bc he’s a white cis gender male. Just curious, should he too feed into the capitalist machine and wear designer (usually gifted) clothes (from designers who want your fans to buy their ridiculously expensive clothes & won’t hire you and/or follow you around the store)? Or is he also saying F capitalism with his simplicity and unapologetic look? He calls himself ‘unfortunate looking’ and doesn’t make money off his body or ‘image’. He is a 1 man band. No entourage. No products to hawk. He donates an enormous amt to legit causes (yes, philanthropy is WS too, I know).", "kosmiq": "Why you paying this ugly fuck so much mind girl. His music sucks and his appearance shows it!.", "amy_heals": "I see your point. But maybe it can also be about how Ed Sheeran WANTS to dress and Beyoncé ACCEPTING who he is! They’ve worked with each other before. Not about black or white, just about who we are, what we like and respecting that. Plain and simple.", "supamakenzi": "baahahahahaaaaa so fucking mediocre", "simimoonlight": "Lmao imagine me getting up on stage to speak and wearing sweats. HA. I would be ridiculed and likely lose work from then on.", "chelleorc": "Exactly why I dress how I want and dgaf. Dress up, dress down, my pocketbook don't got that money to pretend-slay. I had to break those chains for my well-being but I realize that's at a cost I'll never fully know.", "adultbabe": "Who else can be CEO of a giant company and wear a sloppy ass sweatshirt all the time other than a cishet white man???", "aksnyderphoto": "hy·poc·ri·sy /həˈpäkrəsē/ noun the practice of claiming to have moral standards or beliefs to which one's own behavior does not conform; pretense. synonyms:dissimulation, false virtue, cant, posturing, affectation, speciousness, empty talk, insincerity, falseness, deceit, dishonesty, mendacity, pretense, duplicity; #yesallracists", "brownsistabasics": "I’ve been pissed off lately about how white folks literally don’t have to try to be “presentable” but yet have whole ass careers. It’s sickening. I see successful white folks all the time looking like they just rolled out of bed. It’s infuriating and I’m over here in my blackness struggling with respectability politics and deciding if I’m gonna wear my fro out or not.", "simplyyay_27": "This is a stretch!", "theimmaculatewitch": "Thank you 💗🙏", "marisol__vera": "I now realize why I am always ignored at stores. I’m in sweats when I shop. 😔", "dannybruce_": "🙄 lame...dudes style hasn’t changed since he got famous...like Jesus christ", "allwhitenoise": "Oooooooof", "caro1003": "You do realize that he dresses like this all the time whether he’s with a white or black, brown or purple person. Ya’ll act like Beyoncé is some type of goddess that should be worshipped. He’d be dressed like that next to her or Celine Dion cause that’s how he is and how he feels comfortable. Personally idgf how people look at me when I go out looking a mess. Idc if I’m at a store and they look at me whatever way. Isn’t this how most artist dress anyway, like Beyoncé and J cause that’s what most rappers rap about money, luxury and bla bla bla. So they rap or sing about material shit and others are supposed to dress up for them. NO thanks.", "unceasing.goodness": "I showed my whitepassing partner this and he was like “I disagree” but could barely articulate what he disagreed with.. so disappointed lol", "lbc_woman": "Oh oh oh I so agree thank you for putting it into words!!! I end up dressing according to which role I am performing and honestly it gets so damn tiring!!! Thank you, thank you, thank you!", "holatyren": "GYAHT DAMMIT", "darialamoure": "I think that's a White Male priviledge. White girl wouldn't show up on stage next to Beyonce looking like this.", "ms_bosman": "I hear you and all, but what if that’s just how he likes to dress ? Does it really have to be a race or gender thing ? 🤕", "basic.987": "so true! i was thinking, and all of my white male teachers have dressed like that to school and have been seen as the chill, cool teacher. however, if any black teacher wore anything remotely unprofessional, they would probably be asked to leave", "jackn4pix": "My daughter and I were followed in the grocery store. She worked 2am until.... and we stopped in for a snack. I immediately knew it was race because we had gone down the negro checklist: clothes aren't too baggy, clothes in good condition, hair neatly done, tocuh nothing we didn't consider buying, walk at a distance from the shelves as to not accidentally steal, did not smell of weed alcohol or shady motives, no hoods, no loud voices and yet we were followed. We split up and dashed behind aisles then left. He came outside shortly after and got in his patrol vehicle cruising slowly. We knew had we looked like Michelle Pfeiffer and Taylor Swift, this would have been a nonissue. Even looking like RuthAnn and TammyLynn it would have been better.", "yunokathegreat": "this because I refuse to present myself perfect for white folkx. It’s my act of resistance.", "hayls.firth": "Thank you for helping me open my eyes! 💗", "ryanlachica": "This! When I was a environmental ed teacher in Bushwick, will never forget when one of my black students offhandedly said: “must be nice to be white and not always have to match” The pressure is real, even for the kids", "diva_dominatrix": "WOW. You said a mouthful. We pass it down too. A few days ago my grandson said to me, \"Remember you said that we have to dress our best when we go somewhere\" when I told him that he looked very nice just going to see a MOVIE. It kinda perturbed me. Been thinking about his comment ever since.", "thesensiblesexpert": "We’re always pressured to look better and be better but still get treated like shit. Respectability politics never saved lives.", "taraviolet": "This! Ugh Ed sheeran is boring toast", "inclusivelove": "🤮🤮🤮 this feels like my whole dating life from 18 on. Men show up looking like an afterthought and we are wearing $716 worth of enhancements. (Makeup, clothing, bald genitals, hair done etc)", "may.kuboresha": "The caption👏👏👏", "bethbillingsley": "@maamamukose", "ekaterinaandersen": "@rolf__rolf such truth 👆🔥", "gershtown": "Facts. And the way you explain this is exceptional.", "bobo_the_service_pup": "Ye! As a \"plus size\" biwoc in academia I have to dress a certain way to get respect from faculty, admin AND students. I had a woc academic tell me I dressed like a student as an insult because I was wearing a denim jacket. I'm the freaking creative writing professor! Now I dress like i teach at Hogwarts. 🖕🏿", "dabrownsugasexdoc": "LISTEN!!", "spideygirl91": "Exactly! We have to constantly be looking our best on top of being everything to everyone, even our fucking baby hairs have to be \"laid and slayed\" because then it would be \"ugh she should show some class\" (don't even get me started on that gas lighting BS)..you're so right Ericka this shit runs so damn deep SMH #iamtired 😔", "worstwestern": "Im still real upset about Beyoncé and Drake using @bigfreedia on two of their popular (possibly most popular) tracks, and not ever having her on stage at any big shows or performances. Big Freedia has a different style that maybe most wouldn’t get or like. But then they use her voice. Infuriating! But like you and Eb said before, if its created for mainly white people, and loved by mainly white people... it’s not revolutionary. This picture in itself is a bowl of chicken noodle soup 😒", "cerebralc": "@snazi_knickers @brigurl89", "alyssa_neill": "Wow, this is a brilliant point. Thank you for addressing this and helping us all see better and more clearly @ihartericka", "goldenglamfairy": "Soooo true omg you better speak @ihartericka 👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "simone.cupido": "The politics around this particular event was extremely fucky. Capitalism is trying to undermine the struggle for land in SA and did so by giving us a free Beyoncé concert.", "huntjennifer20": "Hit the hammer on the nail, sadly.", "asuperpam": "@mother_of_motherscollective", "justmeister": "Damn, no kidding—this makes my blood boil", "baeavery": "all the comments calling this a double standard I HAVE TO LAUGH. he looks like a fucking high school stoner and it isnt fucking cute. do better and be better", "hev11": "No this is coz eds English and we are just who we are we dont need to dress up to be comfortable. Nothing to do with race go ed 🇬🇧 🇬🇧 🇬🇧", "daje.x": "So freaking accurate.", "katmobam": "Just had this discussion about an interview..take down the Afro as to not look like a mad black woman and try to “look softer”...I swear it’s getting old", "gracebybrewster": "🤗", "lashonwaxoffdc": "Wow", "vickie_g": "Big facts!!!!", "bec.mueffelmann": "Thank you so much for taking the time to write this. 💓", "yazzer_fly": "POC have to look more expensive to get a fraction of the respect and consideration than any mediocre ass white dude", "jessjiron": "Heard! Thank you!", "lizard.principe": "People aren't going to see ed Sheeran for his looks. But then again what is the reason people go see him 🤔 why they even gonna put him within 100 feet of Beyoncé? Whiny baby ass", "labruxapg": "I JUST said this similar thing/ phenomenon to my wife last night!! He looks like garbage and she royalty. And... yet, this is the expectation and narrative that continuously is displayed in all facets for poc.", "_butt0ns": "Holy crap. This is so important and real. Thank you for providing this perspective. Lots of people need to hear it💋💕💜", "ebonyjanice": "But also the whaudacity to stand next to Beyonce Giselle Knowles-Carter looking like a knuckle. At least try. I mean - you just not even gonna try? In the presence of Beyonce you not even gonna brush your hair. ☹️", "inmyownlittlecorner": "My do you invoke thought", "frejafray": "Thank you! New thoughts again. Never thought about it this way before. But of course! Of course!", "treefairfax": "@taylor_kelso 🤔", "beccajanelee": "I know it’s not your place to teach white people about privilege but... thank you. Dressing down never even crossed my mind as a white privilege, I always thought it was some kind of female empowerment, you know, like not wearing heels for work / no make up etc.. but.. this made me realise I have so much to learn and so many people I need to listen to. ❤️", "colorfulkierra": "Yes! Right before I have a gig, I have to make sure I’m dressing up and still being comfortable Bc I have to move around. And THEN I have to make sure i won’t be seen as inappropriate for the way the dressy clothes fit to my body 🙄 whole process takes up too much damn mental space.", "theinformalist": "last line got me shook", "untamedwildnfree": "Wow. I guess I have quite a but of white privilege.. I saw this picture and only thought, \"wow- this must have been an amazing show\"", "careyinwonderland": "@johanna.elizabetth this reminds me of how you were saying that you always have to look “your best” because you aren’t a petite white woman.", "j.ustyn": "I’M- SCREAMING", "iamrachelricketts": "Oooof. “the privilege to not consider what you got on!” THAT SHIT IS DEEEEEP. I feel this 💯. Respectability 24/7!", "phobymo": "Also goes into materialism in hip hop (referring to Jay Z always looking lavish when performing with her). When a big chunk of what you’re talking about is how much more money you have than the rest of us peasants (aka The Carter’s entire album, which is why I didn’t bang it as much and was super disappointed with it), they gotta keep up with that image. Whereas someone like Jcole will perform in a dirty ass t shirt and jeans cause he doesn’t condone that shit and people aren’t coming to his shows to see all that fanfare anyway lol. And obviously the whole reason why hip hop is so hyper focused on material things is cause we never had shit, so totally on the same page as you. So many levels to this shit.", "lolfemme": "The fact that someone as mediocre white man as Ed Sheeran gets to perform with one of the most talented black women in modern history also reads to me as white privilege. Like the fact that they’re equated in any way is ridiculous.", "heartseedscreative": "Yes! My grandfather was from Sudan and was raised in Texas. He had a shame about dressing down, he felt he always had to wear a suite to be respected and used to dress my dad in suites. I feel sadness with this. As a mixed race person I've never felt this due to race but I've definitely felt this as a tomboy. Recently I wore a fancy dress to a party and I was overwhelmed by how nice everyone was to me. It showed me how much value ppl place on looks. I've never understood this because I don't really think about how others dress. I think about how I feel around them...", "skylarholmm": "Could never imagine standing next to a legend looking like a frat boy", "sequoya_community": "All of this 🙌", "endomsworld": "@tre4aggie @mochapeachvintage This is something to think about. #realness", "kocomeow": "🙌🏾True", "arzoodles": "ALSO He stands there with his guitar and sings. Waves his hand. His performances are supposed to be great. (ALONG WITH giving jobs to 100+ POC) Beyoncé sings, dances, jumps, does splits, goes to space,throws glitter, comes back and still people say shit about her performances.", "kasey1290": "Yes to this 100% Ed don’t act like you better than @gucci", "courtneyjewells": "@desiree408xicana", "charstyle": "This is so so real and thank you for addressing it. I think about this a lot with how I dress at work and in predominantly white spaces.", "_glamcam_": "Soooooo deep", "dscopuss": "⛪️ PREACHHHH", "dramaticlegs": "I really first noticed this when watching talk shows. Looking at what white male comedians wear vs. the black male comedians. Most of the black male comedians have more money to their white counterpart but continuously still feel the need to dress up per obvious conditioned reasons, while Adam Sandler and whoever else will come through in what looks like a free raffle shirt & some old new balance. 💁🏾‍♀️", "soulwithbeauty": "This reminds me of friends who for years worked at offices where employees couldn’t wear the wet look aka natural hair with gel or product in it because it looks unprofessional.", "incendies": "Appreciate your eye opening posts. Mysogynoir is a powerful word.", "ninardarling": "It’s cool to be a chill white boy in a t-shirt and jeans while working. It’s unprofessional for a black woman/femme to even have an afro/locs/dreads in the workplace on top of the ADDED pressure of “looking respectable”. Some significant white privilege.", "divadee06": "Deep 🤔", "sai.jen": "Wow.. soooo deep", "nurselolita": "That last sentence got me😭", "sirius_the_scorcher": "I honestly didn’t know who that guy was. I though to myself, “who is that fuckin bot?” Where’s the yawn emoji. He looks like a fart in clothing.", "rulis711": "Yup yup yup", "thefreeblackgirl": "THISSSSSS!!!!!!!!! Privilege, personified...borderline super disrespectful for the occasion...a la “I ain’t even getting dressed for this”", "iamjendon72": "I guess it’s my white privilege that when I first saw this photo none of this entered my mind.", "pepper.pea": "Thank you for sharing this.", "candiceanitra": "You aint neva lied!", "nailahfdavis": "👏🏽GOOD👏🏽READ and THANK YOU!", "ladysavaj": "#thisshitissodeep", "fatasskellypryce": "I can’t. All this tho.", "knittedwit": "Fucking yes.", "editorsmusings": "Damn!! Really deep", "starmagicjohnsonjr": "YES. I talk about this all of the time, but no one hears me. Thank you.", "katiehovercraft": "🤯", "teamwoodnote": "💔", "tashncube": "Wow, this is so real! Whenever I go shopping I always make sure I dress my best just so I don’t get followed around the store or treated passive aggressively by store staff.. so I can definitely relate to this post, sadly.", "dee_lj": "@bruno_746", "thecollectress": "😩😂😩😂🧐"}