{"dawnjoon": "Ahhh A/S/L takes me BACK 😂😂 Been following you for a little while and love the content, from decolonizing spaces, race and gender equity, plants, relationships ♥️ Oh and I’m Middle Eastern and live in Portland, OR. Left a nonprofit job lately that drained me with all its performative equity work and at a much smaller org now where I feel like I am heard and respected ✊🏼", "hungryirishcat": "@magicbabyvintage spread the magic word. Hey im Cat from Ireland, living in the most superficially liberal city in the US, Seattle. Brand new to your page and your work and have learned so much already! 💚", "thebarefootcowgirl": "Been following for a while, white cis woman learning how to identify and check my privilege and be an effective ally and sex-positive intersectional feminist. I love the educational content and how I feel like it’s preparing me for conversations I know I’ll have to have someday when my niece and nephew have questions. I also love the plant posts, because I have never managed to keep one alive. I had a good run with Marvin the cactus, but... RIP, Marv.", "alpha_wande": "I'm 26, South African and found this page through a Buzzfeed article. Happy accident. 😊", "healbitchheal": "Hey! This is an upcoming community for WOC to heal! We’re located in NYC !!", "lynekalittle": "Now on to the gentrification podcast and I'm like, peaches hothouse! 🙌🙌", "christymarie.jpg": "Still new ish. Black Femme artist. 30 in Tampa Florida !", "heartland_soul": "Hello! I’m not really that new but still wanted to say how much I love your posts!!! I found your work through Rachel Cargle. I followed bc of your content re: dismantling white supremacy. Then I totally fell in love bc of your sharing about being a non-binary person in a relationship with a trans person, which is also my life. Of course these factors play out so differently for all different people, but it is just so amazing and life giving and nourishing to me to see real & honest moments from lives of nonbinary & trans people in relationships plus social, cultural & political commentary that is 🔥🔥🔥. I’m basically a huge fan, and you’re awesome, and thank you for making such honest and beautiful and world-shifting content. ❤️❤️❤️❤️❤️❤️❤️", "ellenxmackenzie": "Brand new! Found via the goddesses @lovettejallow & @rachel.cargle. Here to listen and learn. Mother to a preteen child currently exploring her sexuality and identity. Thank you for all your efforts!", "ethelsclub": "Love 🙌🏾🔥", "inga.quintana": "Inga, 29, living in northern NM... started following you a few months ago and been learning so much from you and loving everything you post ever since. Thank you for sharing your beauty and your sweet relationship with Ebony so generously with all of us here, and thank you for all the work you do 💖", "luminatingruminating": "💚💚💚💚💚", "joatnydotcom": "You are fantastic!!! 💛", "worldwide_vee": "Hey the next time you’re in the NYC area let me and my partner @iamtayyonce_ book you some major radio campaigns and interviews www.musicizlife.com", "imaliteraljoy": "Watching your stories every morning really lightens my day. I tend to feel a bit lost and off track in the morning. But you wake me right the fuck up in so many senses. I love it, love your words, love your soul. Thank you from the bottom of my heart. Having your presence here has changed something in me. I can't put it into words. Just thank you, thank you thank you. For your intolerance to submit. You are a warrior. YOU AND EB. I frigging love the both of you, you are both BEAUTIFUL. ❤❤❤", "tatecool": "Hi Erika, I’m Tate. I’m from a pretty sheltered place in CT and looking to learn a lot from you. Also loving the throw back to America Online chatrooms in the early 90s...so yeah I’m a few years from 40. Hope you have a healthy happy new year!", "juju_maestro": "Soon to be 23 from Philly, brought here by @thefatsextherapist IG story. I'm a computer education coordinator and cultural anthropologist. Had seen your name pop up before, but didn't hit follow until now. Interested to hear/see some real shit from someone that looks like me, because both of my fields are predominantly white. 🙏🏾", "beccanomics22": "@thoughtfulleaf", "ratboiscum": "My name is Lumin, i’m 16 years old going 17 and followed you this january 4th of 2019. I‘m pretty sure i can learn more about sex ed and any other topic you aboard from you than from the educational system or somebody i know. I’m a black girl with german nationality living in Belgium 🤗🤗♥️", "cali2ak2cali4life": "Been here for all of 5 minutes and not sure what IG thread sent me here, but thoroughly stuck. More than middle age, lesbian - freed from hetero 6 yrs ago, CA... look forward to old content and new stuff. I'm already so intrigued. The post after sex-ed your points are so thought provoking and worthy of meaningful conversations for our family. Thank you.", "jourdi2times": "i’m new here on your page! my name is jourdi, i’m a white queer cis young adult woman (she/hers). i’m working towards being more present in my body every day, healing from my own hurts obvi, but also reckoning with and healing from what hurts i perpetuate on other folks and hearts and bodies with my whiteness, my cis-ness, my raised-middle-class-protestantness, and being honest with myself about that without detracting from how much i love and respect myself. your posts help me find that balance. i don’t know you or eb, but watching your stories i learn so much about what it looks and feels like to be supportive, thoughtful, and so so so so honest about the realities of human world life. thank yoooou", "mostlikelytostarttheapocalypse": "Hi I’m a Persian and Finnish prosthetic make up artist and writer from Florida. I found your page from @uggiebbyboy and I followed you because you spit straight facts 🔥🔥🔥", "suziegrime\nVerified": "Verified", "miss.sweets2019": "I L0V3 this page, gurl, you need nothing more than just to be you😉🖖 I'm Samantha from Austin Texas yo🖖a stay at home mom/artist/singer/dancer/ writer😁😁😁 I do it all though I am totally feeling this page cause I can relate to an extent; like just being a woman/girl in general comes with a victim label SMH I've been through so much abuse from infancy to this very fuckn day, excuse my french but it's fucked yo😔 I still struggle trying to overcome my fears but fear just seems to never falter when you've been taken advantage of over and over from one person to the next throughout most your life and I'm just LITERALLY waiting for the next fucked up person to cause some sorta trauma like fuck every fuckn day i live with fear in anticipation, it's fucked & it ain't right so I admire & L0V3 people like you bringing awareness to our corrupt world🖖thank you for existing and being you yo🖖😁💜🦉"}