{"taraviolet": "❤️", "hausoflita": "Ugggggghhhhhhh I love this show! #teamgarnet", "prajbot4": "❤️❤️❤️", "revolutionarydream": "Sorry for commenting so much, I should have just made it all one comment. I'm not trying to blow up your notifications I just feel really strongly about this.", "mellums": "@rach_mcauley", "mcblainerson": "I think souls come into this world pure. And then this world/society projects its biases and social constructs on those souls until their views are altered. It is no surprise then that the longer a soul is here in this world, the more constructs they have to unlearn.", "amy_heals": "Aw man that's beautiful!", "marijohanna_jokesonme": "@sacredwilly", "dardarpinks": "Bloop! ✨✨✨", "niahlah": "You an experience til you need your prostate exam", "tooblessed07": "How was this discussion done in school? What part of the curriculum is it?", "nialaing": "@urfavcharity I thought you would like this! 😂", "ehisforalyssa": "@athenagender use this", "nicolezistlerz6": "@tristan_n_vaught", "arsnyder": "@jazrae22", "lemerc2": "@emily_immersed", "emily_immersed": "❤️", "alana_vw": "No. Just no.", "viva_la_negra": "I teach middle school and every year I make a wall of women artists and activists of all ages, mostly of color, or non cis het. Rebecca Sugar is on that wall so is Laverne Cox (students really love her thanks to OITNB which they are too young to watch 🤦🏾‍♀️). One day a student came up and asked “If you have trans women up there, why not Janet Mock?” I wanted to hug his parents so hard. ❤️ The kids are gonna be alright!", "michellesinstagrams": "Crying ❤️", "miss.sweets2019": "👏👏👏🔥👏👏👏", "kracy_memez": "What ever ur mind thinks is not ur gender just becuz I think I'm a tree doesn't mean I'm a tree even if I get surgery to be a tree my genetics say what I am", "kgonzalez111": "This is why trump won", "hi_itssandra": "First, thank you for all the wisdom you (and Eb- hope He is feeling better❤) pour out on your page. So question... I have realized I am not cis. That never felt right. But I feel lost beyond that. I still feel like a femme woman in my brain, which feels right but my parts feel wrong. Is this just dysphoria? I’ve spent my entire life (I’m 38) feeling wrong but unable to really explain it cause trans doesn’t fit but cis definitely doesn’t either. I obviously need some therapy but haven’t had anyone willing to touch the subject only why it depresses me.. uh duh...", "iroseyrox": "POWERFUL. TY ! 🌲🌲", "pasturepastor": "Wish I had that answer 45 odd years ago. I always wore my hair short. Had breasts at 11..didn't stop'm from asking", "luckiecarmz": "@emojighost", "shorthairidontcare": "THIS! You’re such an inspiration! Thank you for creating this space to learn and feel safe ❤️ and for educating our future", "tigerswanstyle": "🔥🔥🔥Yes!!!", "rodcurfew": "@xhybit.a", "nikkisyreeta": "Yaaaasss. Love this.....", "meditation_with_kellymorris": "😁😁😁😁✊🏾", "she.spacecadet": "I love this all so very very much! You are an inspiration truly. 😍", "my4sons": "@rachelleg", "icallmeprincess": "I love this so much. SO so much", "bonjacque": "Not sure if I have a question formulated fully...just trying to figure out if my current exploration of gender is about identity or a desired expression/performance...Any readings on this matter would be greatly appreciated (currently making my way through Undoing Gender but I know there are tons of other resources)", "etmafrance": "Nigga yes!", "_vivrant_thing_": "It just feels like more labels. Like a file on my computer that I have to keep clicking to get to my freaking paper. Very frustrating and tedious. Very walking on eggshells like. As a black person having the label of who i am being changed with the times and still none of them really expressing me....i can't help but see gender identity being a crux just as much as racial identity. But im damned if i don't say im african even though i can't trace my lineage to africa or even trust 23 and me I cant say I'm a native because i can only trace my family back to mt great grandma born and raised in Memphis Tn so to battle with pronouns and masculinity and femininity is too much I like non binary androgynous if i had to choose I rather cling to spirituality is less rooted in physical identity", "pinkflame666": "My nephew is 3 and very femme already. Painted nails, Disney princess dresses, Barbie dolls, watches all the “girly” shows on tv. My fam lives in the country. My fam is pretty cool about it but my dad (an old country man) won’t let him wear his costumes or have his dolls outside of the house. He’s scared people will judge my baby nephew or treat him differently. I’ve tried having convos with him about this but I’m not really sure how to start to have the gender is fluid talk since I know he’s just trying to protect him. Any advice or book recommendations?", "tirsatalks": "hi there! im trying to understand how gender as a construct functions different from race as a construct. Both of them have been imposed by colonizers. But why is it that decolonial activists do not call for us to stop using racial terminology in the same way people call for the end of upholding the gender binary? hope im making sense, if not feel free to lmk.", "stampnicole": "when people ask if a baby is \"a boy or a girl\", is there a friendly, thought provoking, and brief way to answer them?", "emily.tamsin": "YES! So brilliant ♥️", "bujotastic": "How can I start letting my 3 year old define their own sexuality and identifying gender? I try to use the pronouns “they” to point out anyone my child is talking about and steer clear of “him/he, her/she”. Often times though, I will find myself referring to my child as “my son” or hear family say “you are such a good boy”. It bothers me, but I have no clue where to start. My husband’s family is very... ignorant when it comes to gender binaries, but I want to establish a solid base at home, first. Thank you for all the education you bestow upon us, whether you answer or not. ❤️", "mskatecita": "Thank you so much @ihartericka for taking the time to answer questions 💜 I am raising my children bilingual (English/Spanish) and am hearing my 3yo talk about their gender changing from time to time. I am constantly trying to use gender neutrality in my relationship with my babe, but sometimes feel at a loss when speaking in Spanish. I saw in your stories that you have family in Puerto Rico, can you give me any insight into the ways to use gender neutrality in Spanish?? Thank you!!", "mainefocus": "amen 💛💫", "soniarains": "Love this meme! Going to share with my gender class next semester. Thanks for sharing!", "siristolenanderson": "I’m having a hard time understanding something Erika said, can someone explain how pronouns do not inform gender identity? I was under the impression that people chose their pronouns to reflect their gender identity purposefully. Thank you", "dapontefern": "I love this!!!!!!😍😍💕", "huntersd1": "♥️", "heatherey": "Why do some cis gendered people still put their pronouns (she/her he/him) in their bio? When queer people do it they get shamed and bullied but when cis gendered people do it because it’s trendy it’s okay.", "fatafolle": "If society had never enforced the gender binary, and people just respected people’s expression of their authentic selves, regardless of the type of sex organs they possess, do you think the concept of binary/non-binary would still exist? Is gender identity in all its forms a symptom of a broken society or is it genuine human nature?", "nwanyeoma": "I just wanna ask. What is wrong with a boy being a boy and a girl being a girl ??? What is so wrong to be ok with the gender you are based on your sex ? We are not organisms, we are human beings. Its almost like y'all just want to change the natural order of things but i wonder, to what end ? What is the goal here ??? The only set of people this kind of teaching is empowering is the LGBT community. This whole gender identity thing is just creating confused ppl and i see that a lot even in this comment section, ppl dont know what they are. Its absurd. I am a woman and a female 🙏 i will teach that to my sons and daughters. Your sex defines your gender whether you decide to be gay. Even trans ppl can't deny their genetic makeup if not they won't need all the surgery and hormone pills.", "vasiliiltski": "Fckn nigger", "rockstarsocialworkteacher": "I went to a few workshops we're the trainer's suggested that we could use X or Zed instead of a pronoun. And I chose not to ask a person about their pronoun and use the term Zed and that person lime-based me very well. And said that is a horrible term which I do not ever use. Then I turned around and cause more violence to the person by making an excuse about what I learned at the training. To which the person replied I don't care what you learn at any training I just know what I want. So I had to apologize and quickly ask the person what pronouns they would use. And this is a tricky space for Auntie racists advocates. But that's exactly what I would say to a white person if they called me some other name or term that I don't appreciate like visible minority. So I got it I was grateful. The student was able to tell me. But imagine how many times I might have used it with students if that person had not said it to me the first time I used it.", "tdub0110": "I enjoyed reading and learning from all these comments. I just had a baby born last may. Male at birth. My questions r to @ihartericka : so to not push a young child one way or another what does the mother do? My baby is only 6mnth but so far I have offered toys for each sex. But I do call him my baby boy. Or is it ok to treat him male until or if he shows sign of female? Thank u 💖", "gwenfordfaulkenberry": "I keep reading “medical studies prove” and “science proves” etc. on this thread. Will you point me to some specific academic sources you use to support what you teach? I am a college professor and new to this but trying to learn so I can help educate others.", "talawni": "Kids perspectives are wonderful. I love that. Thank you for sharing", "hopebroidery": "That’s amazing! I can’t believe I missed this post even though I clearly love you and Ig should know this by now, so I’m commenting an extra long comment to ensure the algorithm knows I wanna see your stuff!!!!!!!!!! Extraaaaa longhghhhh commmenttttttttt", "snazzyflab": "Such wisdom 🙏 Big steven universe fan ❤️❤️❤️", "go_milkyourself": "This takes my breath away. You are *indeed* an experience. Thank you for all you offer to and share with us.", "allisonfort": "I work in an elementary school and I make an effort to use gender-neutral language when I talk to students - “listen up first graders” instead of “you guys,” etc. Thank you for reminding me of the power of words and how easy can be to make small changes to make everyone feel included.", "onamissionalex": "I have a great new coworker who has a traditionally female first name but likes to be called by the last name. The person may be NB or not. The other day out of habit I started to use a female pronoun to refer to the person, but caught myself and stopped. I don’t want to assume anything and I also don’t want to be rude. Is there a way to bring it up so I’m not rude, or just keep referring to their name (without pronouns)?", "wenchlette": "@monty.0216", "llmo13": "@nataleem84_", "freedapeople": "😻🙌🏽 YES.", "butchsister": "I also used this meme when I was teaching gender stuff to 6th graders last year to explain more about why I go by Mx. and they", "amandamoon": "If someone has/is in the process of transitioning, when you are talking about them before the transition, do you use their current pronouns? Or the ones they used at the time?", "kocomeow": "🙌🏾🙌🏾", "slen21590": "🙌🙌🙌🙌", "lilmarie_days": "💫💫💫 @resiliencechi", "guayabakitchen": "@marimoreliving u", "anyacrose": "@hisnameis_panik", "naiphone722": "My 2 year old was looking at a picture book and said something about a boy. I asked: “are you a boy?” And he said “no! I’m Seun!”😍", "ducttapesilver": "@garrettthegay ok but you watch steven universe right? If not i can't be girl garrett.", "kavitajade": "@tarajadehor", "darcymontague": "Thank you for this, I am learning so much reading comments 🖤🤩", "briochesympa": "Waw thank you for that space, I've learnt so much, your comments are so clear and easy to understand, thank you 🧡", "squeeface": "When in customer service I think a lot of people rely on sir ma'am. Especially when on the phone in call center work. What do you think is the best thing to do to be respectful of genders over the phone or in the customer service environment. Back when I worked with large groups I would refer to groups as, \"you guys\" and learned that folks was a better term, but 1 on 1 on the phone it's a hard line to walk.", "a.poll0": "i love this so much", "therealcurlyhippie": "I had to learn ALOT of cis BS. And Steven Universe made me think about alot including where I stand. I love things that can positively bring up the discussion without being sexualized and SU is it ❤", "trans_fat_alchemy": "How do you feel about people choosing to call themselves non-binary as a political act?", "heartovercrown": "Yesss🙌🏾❤️🌠", "cwhite5678": "When you teach do you separate gender from sex assigned at birth, or do you ficus more on gender and what certain parts do regardless of gender?", "linds.sparkyourshe": "The most beautiful compliment ever... I love it... She's an experience. 💘💘💘", "deadniggasonly": "Mood", "kasie.m.campbell": "@k.b._campbell", "decolonizingtherapy": "I 💛💛💛💛Stevonnie! ❤️🌟💌✊🏽✊🏽", "juliafractal": "@lady_alase 💓", "pecantandimpleface": "@mshosch @joram07 @1todial #🤔", "escritoraliteral": "👏", "straittosummit": "gender is a social construct", "breelash": "Yasssss", "body_love_bunny": "Are there people who believe their pronoun is very personal, and don’t want to share it? I’m a writer and always want to check people’s pronouns before I write about them, but feel like a DM asking them to clarify could sound invasive. (I often write about artists’ work I haven’t personally met) Thank you!", "theghostiam": "How do you know your gender? If it's not your body and it's not your clothes and it seems gender is all made up, how does anyone know?", "bellarae.26": "Awww the brilliance of this child!🙌🏿💜", "sarahcha_w": "What is cisgender?", "anouk_yoga_travel": "@miss.sundaymonday", "thegirleetomboy": "That is beautiful experience you went through with the kids", "antoinetteparkhouse": "@monica.mmi", "patchworkpoet": "My favourite answer of all time. #stevonnieisme", "ileahgreen": "@foleyrothrock this meme is amazing", "ginkoko_": "Lol", "allison.wonderlannd": "If someone acts and dresses and expresses them self femininely, and has female genitals, but identifies as a trans male, why don’t they just identify as a female?", "sarahnaomijones": "@st.mariesse 🙌🏽", "brittsy_babyyy": "Thank you for this post because reading through the comments has just taught me that even as informed as I am, I still don't know SHIT and I intend to keep reading through them after I hit post on this comment. KNOWLEDGE IS POWER! USE IT FOR GOOD! 💗💗💗 Thank you!", "mzrena365": "Love it", "audspoken": "@alienblaxcollective", "fishy_chrissy": "I have a question that was sparked by a previous post of yours. You said that your pronouns are she/they. Could you explain how best to respect that? Should I default to \"they\" when speaking/writing about you?", "cocotough": "I need to start watching Steven Universe", "laur_elyse": "I’m obsessed with Steven Universe and I’m always impressed with the way they show inclusivity with so many different things on the show, especially with love and gender identities", "cherryrevolution": "SOOOOOOOO much value in these comments! WOW. Thank you so much for holding this space Ericka😚❤️", "littlefilmyfox": "@raindovemodel 💕", "lovelightdread": "Thank you so much for opening up this space. I am working on a book about fitness, health, and training for women, and I want it to be inclusive and not transphobic. Any tips on how to do this? I am stuck because I want to back up the book with scientific research, but I know science can be biased. I want to write this book for anyone who identifies as woman, but then I start thinking is it invalid to write a book about health and training for “women” when there is no body that encompasses what “woman” means? Or how do I write about the impact of testosterone and estrogen and hormones when it comes to training and strength and eating and things like that? I’m so grateful for the work you do. Sorry for my anonymous account. I signed an NDA about this book. Thank you for any help. 🙏🏻", "yesitisbeautiful": "YESSS I ❤️ Stevonnie so so so so much they are meee ⚡️", "sammplss": "Thinking about moving from she pronouns to they pronouns as an agender femme. How do I go about this? Any tips on how to come out to people that don't know yet? Has anyone changed pronouns with some people and not others (i.e. problematic family members)? I have a feeling that some family members won't respect my pronouns the same way they don't respect my queer identity (in a hetero passing relationship) so I don't really want to reveal myself to those people.", "makkunaito": "I love Steven Universe! 😍", "jmariegray": "@ihartericka Are there other sexes that can be assigned at birth besides male, female, and the broad label of \"intersex\"? I genuinely don't know 🤦 And do you find that some states/regions are more biased in the treatment of intersexual infants?", "rose__grave": "This is such a cute post I can't", "_intuitive_leo": "I love this I have a student who is this exact meme lol everyday she’s teaching the class about gender conformity and she’s only in the 5th grade ... I love it", "embodiedastrology": "@ayannakaii", "sula0020": "Love this", "phillippa82": "@helss88", "m_illegalstonermom": "It's so true, you're an experience. So many oppressive systems and notions created out of our need to understand the physical world. Just as gender is fluid, there is so much of our world that is hidden and misunderstood because everything is fluid. There are no absolutes when it comes to the human physical experience.", "april.alexander.1977": "Hi Ericka, have you considered writing a children’s book explaining gender? I think something like that is much needed.", "beyondyourdefinition": "🔥🔥🔥🔥", "retos_yrollam": "💜💜💜💜💜💜", "celestial_jazz": "My kid is four. I just recently started as identifying as non-cis (somewhere between genderqueer, gender fluid, or demigirl) and I want to introduce the topic of gender to her. She's taken so well to learning consent and body part names, I'm just at a loss of where to start on gender. Where exactly do I start??", "naninicc": "@vnvlvurv", "bubblegumdynasty": "@lastminutetrashcat", "boorabeemountain": "Yesssss", "lexabonschu": "How do you think gender studies and femininity along with teaching the concept of respecting boundaries or the importance of how we fit in societal roles can be taught in a macroscopic scale? For instance, real life societal values (i.e. cultural studies, tolerance and \"socially acceptable\" behavior from a more global point of view if necessary depending on the area, location or cultural environment", "msdsantos6": "🙌🏾✊🏾 that warms my spirit 🤗 I use to get that question from kids a lot when I was bald...that is a dope response 👌🏾", "_blacksunflowers_": "Should I just refer to everyone as they and then learn about what pronouns individuals prefer or what would be the best way to ask what someones pronouns are when in a casual setting?", "linzbulb": "Can you recommend some good resources for elementary teachers?", "findingpaola\nVerified": "Verified", "lulafoos": "Kids are so smart. They should run the world.", "1amberrose1": "@jaz_colleen", "mccarth88": "@tnylilbows yes!", "asyoulikeit.shop": "We are all here for the experience 💜🌈⚡️", "strangefruitsandweirdrootz": "I love this post so much! I can definitely relate.", "amyskrzek": "This is going to be my new response!", "the_dollyrose": "how do you feel about the frequent grouping together of trans & non-binary/genderfluid/genderqueer folks? to me, they seem like very different experiences with their own respective set of challenges. namely, i think about the tide of violence against trans women (especially black trans women), that doesn’t necessarily seem like something that is inherent to the experience of being non-binary, yet how often do we hear “trans & non-binary folks” referred to as a single/common entity? so, it’s not a clear question but i am curious if you have thoughts & feels about the conflation that seems to exist of the trans experience and the non-binary experience?", "allheartandsoul": "As a preschool teacher I am responsible for helping children with labels. The concept of a gender spectrum is so new, to the larger world not those on the spectrum, that I’m finding so much pushback from all of the adults around me. “We are teaching them boy and girl.” “Gender fluid is so rare that we can’t change our curriculum for one in like a million.” Etc. We both know this is bullshit, but I would appreciate any info you could give in teaching with very young children? So far we have read a few gender spectrum books and I have stopped saying “boys and girls” and switched to “friends”.", "beccaboo078": "@celestial_fyre yas", "tdv_dub": "My youngest child shared with me that they never felt comfortable identifying as the girl that we raised. Looking back over the last 17 years of pictures, I now see how they struggled to be who they were “supposed to be.” I had to throw out my preconceived expectations of the life I thought they would have and open my mind to all the possibilities for this life of being their authentic self. So as a parent, I am struggling with wanting to protect my child from this cruel world and also encouraging for them to live the life they want. I am blessed with a child who is smart, funny, kind, and oh so loving. I am learning how to be an ally and still be a momma. Thank you for allowing me to share and for all that I have learned from you.", "whatsmybodydoing": "AWWW so amazing", "sagetheworld": "@aleahwilla thought you would like this:)", "rubywednesday13": "@ayansunshine @anokithesquirrel @walking_thecow", "lashaylovejones": "I Birth 2 Boys & 2 Girls...Period There Not Any Experience.. They Are Males & Females ....Period", "heyheyhaleyjo": "Steven Universe is one of the best examples for people trying to understand the non binary 😍❤️", "zbornakattack": "@ihartericka my daughter just started pre-school (she’s 3) and gender talk is already falling heavily within the binary - everything is assigned “boy or girl” status, etc. She already seems to strongly identify as “girl” but how do we encourage conversations at home that step outside of this concept of binary- is she too young to “get it”? Do we just keep being consistent on our language and take things as they come (since we can’t control what is being said at school). We try so hard to be neutral and open, but damn it is so ingrained in our culture in tv, books, movies, bathrooms- everywhere! I don’t really know what my question is- just trying to do my best with her. I love you and your work and thank x1000 for taking time out of your day to answer our questions ❤️", "shalala24": "@spare_me_the_horror ❤", "95yera": "💕💕👏🏽👏🏽", "lamisco_": "When someone says their pronouns are they/them I find it really hard to address them... like do I say ‘happy birthday to them’ in oppose to saying ‘happy birthday girl’? I’m really nervous about offending ppl and I just want to get it right", "fern.galindo": "Afab here. Recently claiming a nongenderconforming/non-binary identity...but also? I still want to be a woman.just not only a woman. Like a woman+. I like to wear and shop men's clothes sometimes, but while I'm bi, I'm not going for a Butch lesbian vibe. Am I trans? Am I truly non-binary if I still mostly identify with womanhood? I don't have a uterus or a period anymore, and that is part of why I don't feel fully, only woman. How do I figure out what makes sense for me?", "katestephenjewelry": "👏👏👏👏👏👏👏", "handwrittenrevolution": "@nomadblue", "nturlbruntt": "@caleb.caleb.caleb.caleb.caleb", "stylelikeu\nVerified": "Verified", "fallenalien01": "The sweetest thing!", "joyahevony": "How do you know your gender?", "alcbowen": "I soooooo love this ..... \"I am an Experience\"", "dandydresser": "Saaame✨", "amorenmishuesos": "Same", "leannecmiller.artist": "I wish we had this in Arizona 💜", "cute_little_queer": "I love this omg 💜😭", "jenjenmckeown": "Do you have a recommended reading list for students you would be willing to share?", "history_of_sarah_i_guess": "(i sent this in one of the ask things on your story but it was right before it ran out of time so i'll try again here) how do you recommend someone explore their gender identity? i am an 18 year old and i've always been gnc but i've been trying to figure out if i’m actually trans or just gnc. i am planning on talking to a gender specialist at some point but in the meantime i am trying to figure out as much about myself as i can. p.s. thank you so much for taking the time to educate and talk about this sort of thing. it really means a lot that you do this", "kristabelle1210": "What’s the best way to go about finding a qualified sex educator to facilitate training?", "santinha.sarinha": "That's an amazing story.", "mscreepybunny": "🖤", "aliairving": "@fluidfractal", "wallamella": "I’m open to anyone answering this question or pointing me in the direction resources. If gender is a binary that we are supposed to be seeing as invalid, then how can someone be a trans man or woman? Doesn’t that label depend on the binary existing and man/woman meaning something specific? For example, you can’t “pass” as a “woman” unless woman means something specific. Or you can’t have “gender reassignment” if gender doesn’t mean something specific? (Just using those as examples, not implying anyone should “pass” or have reassignment to be valid in their identity.) I keep trying to work it out in my head, but I keep getting stuck here.", "gaylantui": "that is so pure ! i love it ✨💜✨", "keyahnuh_": "👏🏾👏🏾👏🏾👏🏾", "snoozin_doozin": "@l_jungie Is Grace a girl or a boy 😂", "myslutbox": "💋", "beautiful_cocoa_": "I don’t have children yet, but I am giving strong consideration to raising my children in a gender neutral space (i.e.: using They/Them until they identify their gender identity, etc.) How can I best go about introducing this to my family/close friends who still very much adhere to the gender binary?", "fitmomtish": "@antarbushmswmph ❤️", "ashtreeimages": "I love this!", "blunar8": "Yassssse 💞💞💞💞💯💯", "jacqueline.d.jennings": "I love how quick kids can unlearn conditioning! 🙏🏽 I’m leading some education for young people around hormone health for people with a uterus / ovaries and a menstrual cycle. It’s about reframing it from “the curse” to harnessing the ebb and flow to our benefit, even looking at it as a performance upgrade. I’m avoiding gendering words, leaning more towards “do you have a menstrual cycle? This info is for you” Any suggestions about language or other considerations?", "tigobitti": "Perfect 👌🏾 ✨", "pamela_prediger": "My child goes by the pronoun They or them. Sometimes I mess up. How do I not mess up? Do I immediately correct it? Do I apologize?", "emilygoldhammer": "I’m totally sharing this with my little experience! 😍😍😍", "nishamoodley": "Omg I love this", "liv.caro.s": "I’m so glad I get to raise my sister around diverse shows like Steven Universe and Voltron, I wish they were around when I was young! (Doesn’t mean I can’t be obsessed now though haha)", "beeefreitas": "I was absolutely amazed in the episode that stevonnie shaves their beard <3", "vivalacocoaa": "Steven Universe is SUCH an important show!!!", "ti.zzleowen": "@_.samjohnston._", "pepper__annie": "i’ve been talking with my 6 yo daughter about gender and yesterday we were making christmas decorations and she made a gingerbread elf that was “a girl in a boy body”. we talked about pronouns and how a person gets to choose what pronouns they want to use. she then said that all the elves in the north pole she was imagining were trans. kids are so smart.", "consciouslens": "The unlearning is key. Thank you and others for helping me with that on this journey‼️", "queenmaeverising": "Extremely adorable story 😍", "angryytgrrl": "Amazing! That kid's gonna go far!!! Wow! Totally gets it! 🖤", "nodramacici": "*two snaps*", "sweetmariegal": "I love that my kids can teach me and catch me on this: mom, did you just assume their gender? 👏👏", "divinenegro": "@jasmine_mlogan send me your winter quarter schedule. We need to continue these conversations.", "smilingdaily": "THAT IS AMAZING💕👏🏼💕👏🏼💕👏🏼💕", "magicbabyvintage": "@little_seattle_bungalow", "sexologistshamyra": "Omg. This!!!!", "zaria_belle": "❣️😩💓", "_thisis_ej": "What’s wrong with men being mean and woman being women? Trans being trans? What does denying a gender do? God create you either male or female genetically and that’s just nature. And even when someone is trans they are identifying with either male or female. Besides inequality among men and woman what’s the problem with identifying with either one or the other?", "k.trinamarie": "Love this! One of the kids I babysit said something about his sister being a girl and him being a boy, and his aunt and I were like... how do you know (sister's name) is a girl? His eyes got wide and he asked her if she was a boy, girl, or neither and she said \"I'm a GIRL\" Led to a long talk about gender, and taught me that kids are way more open than adults.", "earthtojordi": "Yassss! Totally had a dream I was giving you a reading! To the FUTURE! 🙌🏾🌟", "_acceb___": "I love this 🙌🙌🙌❤️❤️❤️", "brooke.constance": "@simonbrocksmith", "aalarty": "@lovis_cw", "childofthe__drunkinpine": "@ppurplehaze @delanyharley ME AS FUCK. 😂😂", "zabcary": "Omg that response 😍😍😍😍", "tessapics11": "YESSSS love Steven Universe!! ❤️", "briannadelrey": "😭😭😭❤️❤️❤️", "lingeringwanderlust": "Favorite show ever!", "mybodywpg": "In love with this!🙌🏼❤️✨", "yelzieee": "Thanks for sharing this.🙏🏽 Feel it so deeply. Non binary trans educator here,👋🏽 recently working with the tinys, preschool age. Was asked this question non stop from the moment I started. 😂The purest inquiry. Allowed this to open dialogue on what they know to be true about gender in general. And there you have it, at this age with minimal society influence, not much. You know I had to enforce a binary free environment for the opportunity to learn and explore in the most fluid form. Also, tell my why by mid year these 4 year olds were checking adults on my pronouns. Bless the children, the future is going to be alright.", "venus_beaver": "My question as I navigate the best ways to respect and honor everyone’s experience... Is there a preferred or proper way of discovering how someone identifies? Such as which pronouns to use? I always get so scared I’m going to fuck it all up, or that I’m not supposed to ask, or I AM supposed to ask and am being an asshole by avoiding it? I know everyone is different, so this probably won’t be an across the board answer. I just want to be as respectful as I can be and I’m not always sure what that looks like. Thank you", "paleseptemberr": "@aleshaba the kaption 😭", "allysonmanning": "@jayoweneisenberg", "_lady_light_": "I wonder how you feel about nonindigenous folx using 2spirit as a marker?", "cristalsharris": "👏🏿👏🏿👏🏿👏🏿 Raising up the future to be heavy hitters and gender educated! 💥", "luuna.in.lens": "YES ive used this in youth group", "missdomonique": "I always get the question what are you,,, boy or girl,,,, my response is ....I’m Dominique 😊", "m_ill.ie": "@kaesus_christus", "itsjuustliz": "I am LIVING for this, enby for the win 💯😘✌🏻", "rachelisfearless": "What happened initially? We were born with all different parts and a lot of people are born intersex was there a time that it didn't matter or were or human brains always about putting people into categories for survival? And are gender norms a result of that? Basically how did one certain type of strong, homophobic, I'm better than everyone Cis mans view become the standard", "fitmommon": "Yessss", "spideygirl91": "Love this!", "jamiquans": "💛🔥", "haileyluntz": "If gender is a construct that was created to uphold a strict binary based on stereotypes of how ‘men’ and ‘women’ behave/look/etc then what does gender mean to someone who is non heteronormative? If you are trans femme is your identity based on those stereotypes of what is feminine and vice versa. How does gender function outside of its original western function?", "nicenice11": "@mellie_rosa_ goals", "taytay.nastay": "FAV SHOW", "1sewwhat": "I want to know(I hope this isn't trivial) when someone asks for the restroom key, and I'm not sure about gender, what should I do? I never want to embarrass anyone, but I always get flustered when I'm not sure what gender is being represented.", "janaerhianna": "I LOVE THIS. Great story 💕 so true about the young ones", "brooklyn_smurfette": "🙌🏾That’s right❤️💖💜💙🙏🏿🤓", "linnyfriend": "Just perfect.", "jmaseva": "My question is can gender identity ever be rooted in problematic interpretations of femininity and masculinity. I struggled a lot when Caitlyn Jenner made her debut bc a lot of what she represented was the most shallow of aspects of womanhood. I know there are trans people with way more connection to the gender they identify with but I’ve never heard it put into terms outside of physical appearance. So I’m asking what internally connects trans women to the feminine form to the point that they would undergo procedures to feel whole. I really hope that was respectful. I’m a heterosexual cisgendered woman trying to be better .", "jalebijaanu": "😭💕 I love this so much", "cindyleealves": "💜💜💜 I remember this! Young people just get it y’all ... more than some give them credit! 🙌🏾🙌🏾", "ortizleee": "Feeeeeeel meeeee!!! 😂 Love this!", "coconutdreamin": "Also, how do we help adults /others unlearn what they grew up believing as the ultimate truth?? Without coming off with the attitude of I know more /better than you.", "theaxltd": "Love It ⚔️‼️", "emilyrgarnett": "I love love love this! I have been trying to reframe/undo the first couple of years of binary parenting with my son, now that he’s 3 and much more verbal. It’s embarrassingly surprising to me how gendered the language I have been choosing thus far is, and posts like this keep challenging me to improve and to be better, so I can raise a human that is more cognizant and inclusive.", "jgrayschalk": "Ooohhhh I have been wanting to ask this because I've Google searched to no avail. When people put \"she/they\" as their pronouns (I think I saw this for the first time when I read your IG bio!) which one do I use? Is it a true either or, or is there a preference implied that I'm missing? Or is it dependent on the part of speech? Or am I completely over thinking this?", "chanti_bk": "👏🏾👏🏾👏🏾", "asantiagortiz": "My kid is GNC, and identifies as trans. They are 7. Their school has not respected their pronouns and even though I have brought it up with their teacher, the teacher is not using my kid’s pronouns. My question is, what are some good, simple resources to share with the teacher and admin. To be honest I’m also a little bit concerned about ruffling things since we just moved to the town and it is overwhelmingly white and we’re Puerto Rican. I don’t want my kid to be doubly ostracized. Thanks!!!!", "alexandra_mc88": "Such a cute story!", "wellvyl": "👏👏✨ Love this!!", "slynbutter": "👏🏽", "lucianatwinmama": "What’s the best way to introduce and talk about these concepts with elementary age kids as we are learning and I learning for ourselves? We’ve talked about the difference between sex and gender ( my kids are 8 and 6), What the word stereotype means and how it shows up in gender, and that’s as far as I’ve felt confident going because my own knowledge is limited and I don’t want to get it wrong or give them the lens I was given. And thank you for being open to answering these questions!", "treefairfax": "Love this so much 💛", "thecosmicferrn": "ericka! first i just want to say thank you for your work. thank you for sharing yourself. i constantly struggle with what to post, how do i post my beliefs, do i even want to! & i just appreciate being on this platform and following you. it’s taught me so much. even just language in general, how to say shit. how to check ppl! i’ve been surfing the web looking for resources on teaching my high school sister on gender, race, and classism and everything under the sun! she is a much slower-processor and i want to accommodate that. im wondering if you know, or yourself have an online source of youth education in these areas? 🌿💕🦋🦄 thank you beauty!", "dqlicious": "🙌🏼♥️", "danlala": "@not_clint_eastwood", "neauxla_dawlin": "When I taught preK got this question daily.....i let them decide. Got very awesome answers. It's just sad that 4yos are already engrained into the \"structuring structures\" (Bourdeaux)", "psychicdownloads": "😭♥️", "samantharise": "Stevanie is life!", "peewee.pixie": "Steven Universe is awesome. It has a lot of good “messages”.", "jonahbrydon": "I think it's especially cool that they get that someone they're calling \"miss\" and \"she\" might not be a woman! Adults have such a hard time with that.", "kitchen_canner": "My big question is how to respect gender when the child is not verbal. Example: my godson. The go to compliments are “strong boy, good boy etc.” saying “child” instead sounds cold. I use his name as much as possible to avoid gendering. Any guidelines to support gender expression or how to ungender in a society that even has boy/girl toy aisles? (I avoid the pink/blue dynamic easily. Thinking more about language usage) thanks!", "drurytherapy": "🙌🙌", "joy_cel": "I love this so much", "jelly.wilding": "What are some ways that we can combat the argument that gender/sex are needed for identification purposes? I don’t think it’s necessary but I hear people revert to this argument pretty frequently and Id love to hear your thoughts. Thanks Ericka!", "deadbirdparty": "YES i teach small children art and they sometimes ask, and i'm always like 🤷‍♂️ neither! And they are usually like \"kay whats for lunch tho\". One kid challenged me on it once (they were all 5 years old, for context) and this other 5 year old, before i could speak, *stood on her chair* and went on this rant about how anyone can be any gender and boys can be girls and girls can be boys and sometimes you arent either and sometimes your both and sometimes you're a drag queen and i was just floored at being so vehemently held and defended by a 5 year old. 😭😭😭 they really get it.", "auroredrpx": "This moment look so magic! So truly beautiful!", "vonshifty": "@claudimon01 💜", "life.shoot": "@sara_albi", "erkagman": "Steven Universe has made teaching gender, pronouns, and relationships to my kids a million times easier. I absolutely love this show!", "emkahlobk": "Awww", "sassymcgrass": "@sadiephoenix", "carrotflowerz": "That’s the cutest thing I’ve heard in a long time", "princess.babyo": "I adore this and I’m so glad you had this experience ❤️", "dopalicious_angel": "@rebeccasugar", "kristenpapac": "When you don’t feel like a boy or a girl, does it change daily, or minute by minute? Or do you just not care? Does the label boy or girl just not matter anymore? Curious.", "smashfinallydidit": "I've seen the term \"femme\" explained as gender expression, and I've also seen it explained as gender identity. How do you define it? Apologies if this has already been asked and answered. Thank you for your work and for always keeping it black as fuck! ✊🏾", "that_girl_danni_girl": "Yeeeeeeeesssssssss😍", "thereal_jdneal": "STEVEN UNIVERSE YESSSS", "evol.sam.i.am": "Forever in the top 5 of meme🧡💜💪🏾", "lilyrorock": "@smchampz", "k_lindo": "What single resource/book do you recommend most for those of us with a LOT to unlearn?", "houlenic42": "You’re an inspiration!", "futurgab": "Stevonnie!!!", "camstearycat": "💚💚💚💚", "aocarinapr": "What!!?! This is amazing 😍"}