{"littlemissjoey": "@oxfordbarcelona", "finsuaa": "Argentina ❤️🇦🇷", "nob1elegend": "@blibertad", "nettle.tea": "@gellyfiersh b", "dietculturesucks": "@_lanadelross", "kirstytraffordowen": "How amazing is this kid? @kiriobrien", "olli_3d": "Makes no sense what she says", "wowjamila": "How amazing 😭", "miggiewithdafro": "@the_childlike_empress", "violadielola": "😭😭😭♥️♥️♥️♥️♥️😭😭", "el.hopaness.romtic": "Those children are the future 👏👏👏", "meggangreen": "I'm so glad she gave specifics like \"todes\" and \"nosotres\" because i couldn't always figure out how to put an \"x\" on a word. I'm not a native speaker, so I'm not always sure how to do it and asking people can go off the rails quickly. lol", "jammingsoul": "They must have a huge problem to say that in spanish we can't use the neutral. IDIOTES", "cavemanpaints": "Sounds like she’s been indoctrinated into gender ideology. She’s not “enlightened,” she doesn’t know any better. There’s a difference. There was an infamous figure of the 20th century who also believed in indoctrinating the youth to seek the future he wanted, and I’ll leave you with his quote: “he alone, who owns the youth, gains the future.” -Adolf Hitler", "chelsea___ellen": "I’m sorry you were subjected to that violence.", "roweenie_": "@chrisdametto 👏👏👏👏", "orangeskirt77": "@orchardparty @gun.ray ❤️", "iamrivergray": "@azuniga93", "maggiemay_731": "This little creature is awesome! I am so sorry for the experience you had though. I have had similar ones, where clients write rude things on my questionnaire when I ask preferred pronouns. It ruins my day, and ultimately I had to change it back to just “sex” and “gender identity,” since that gets fewer disheartening comments. Hang in there. The world will change slowly. You are doing great. Lots of love to you ❤️ @ihartericka", "persephone.dove": "LANGUAGE IS EVER EVOLVING YES LOVE LETS MOVE FORWARD ❤️", "daniel_stngrtn": "This is sad that she feels it’s necessary", "juicyjayfox": "@andrea.kelly_", "j_j3rd": "Is it really that surprising that many people think this way. They have been told since the were kids that man and woman were biological. They are wrong but you can’t blame them", "tasty_cows": "Well since in Spanish all words have a masculine or feminine addition to them how does she even speak Spanish", "something_nami": "Just eat your cheerios kid relax you’re not gonna get a award", "rachelmilla2": "👏👏 Tell em !! Bless her 💖💖💖", "theycallmeznasty": "Such a simple concept. Just respect ✊🏽", "xxomgitssamxx": "This child is wise beyond her years!!", "kzhth": "Maybe that's why Indonesian have the word \"dia\".. a gender neutral pronoun lol", "laventuredemavie": "I am a cisgender woman, Spanish teacher and I am teaching my students that there are always options for neutral gender. I really hope spanish language evolves in that way and that people realize that it is necessary to have and use neutral gender words. ❤️", "lizzielu": "@andrea_fuentes 😍", "ghost_account1234567891011": "This girl got more sense than alot of grown folks and that's sad.", "jopetitetre": "@louchkaille @arsenecolin", "indiegok.015": "There only two genders man & woman theres nothing in between", "notvaildnotfound": "I love her I love her I love her 💞💖", "madebyminga": "Wowwwww", "rplanchard": "@majilacudy3", "kbs1914": "@alexism.murillo !", "vidaglows": "@stefangruber", "clk.30": "I work in a completely different space, but with relatable frustrations. I tell myself that my life's work is to throw as much of the stickiest spaghetti I can create at the wall, and be at peace with the fact that I may never know what sticks. You may have made a huge impact on some of the less vocal individuals in the room. It doesn't make it less frustrating, but it can make the frustration feel more worth it!", "janedark_": "A child these days cannot have come up with such a speech on their own. Furthermore, given the context if people disregarded what you were trying to say and explain it’s clearly because they’re transphobic, not because you are a black femme. (May I ask why you decided to use the French word for woman and not the English one?)", "beckayyrg": "@cvrodri !!!! Show this to brother", "ginevragilmore": "i love this ❣️", "teaganblvck": "how mature", "palomawallace": "@becca.turley17", "nutritiousnoodle": "Love this video and YOU. No matter how much they resist, we will keep fighting and prevail! “Es un derecho!”", "marina.jefferson": "Did you know some teacher got fired because he didn’t call a trans student the gender they wanted to be called. The teacher didn’t do it cause it was against his religion and beliefs, so he shouldn’t of gotten fired.", "mskib": "@julesm.b", "hoermie": "Germany has the third gender as official option since the first day of 2019 and what warms my heart is seeing job ads in my local bus company (I’m living in a pretty rural area) using gender neutral language (which is hard cause German words are strictly male or female)", "kidnapsnap": "@qnbrnsn", "grecia_art": "This is dumb", "crochetluna": "Wow...simplemente...wow!😘😘😘", "jalopez21": "Science!", "lila.arriola": "this child doesn't make any sence. Please if you speak fluent Spanish as i do. You know very well that what she's saying doesn't match what they're translating.", "cuckooclockheart": "I'm a Spanish speaker and I find her word so cute. I have never had to use gender neutral language in Spanish but I should probably look into it.", "morovy_gostek": "@christinchalala", "1.yaisa": "💞💞💞", "courtneyvsworld": "@elaniemayx3", "ayyykay": "@tetrahydrocam", "dancingqueer": "❤️ @ballbaltazar", "coolpugdad": "“Pero no es una palabrita, es un derecho” 🙌🏼👍🏻🙏🏼", "steveraz": "@photowar", "pariroehi\nVerified": "Verified", "pdevakula": "@asierra06 @janankohler my child 😭😭", "honey_brownzzzzcecw": "Why are little speaking about conversations like this , instead of playing with dolls and nail polish", "agotavera": "This child is brilliant 💓💓 but I don’t know how would you describe non binary in my language either. I’d need to ask some experts because I don’t really live back there anyways", "adrianthadoll": "You make the world a better place @ihartericka KEEP SPREADING LOVE NO MATTER WHAT BABY", "su.bur.bia": "@helloitsniamhspeaking 🔥🔥", "sophiapriv16": "@ellie_priv", "_.daizyy._": "It's not that easy in every language. I'm dutch and there have been so many struggles about this because we don't have an alternative.", "cbellaa_": "@brlujan", "dimitris_life343": "I don’t know... maybe this is just the highest good you’re capable of fighting for.... so I don’t want to keep that from you.... but understand there are bigger issues then people referring to you as “they”..... it’s nearly insignificant", "khlh4490": "۰۹۳۹۷۵۷۹۵۵۱با سلام.ربابه هستم از بیشتر شهرا مورد سکس حضوری دارم .دخملای خوشکل ودارای کارت بهداشت و مکان امن و تمیز.😍😍برای هماهنگی @LLkk68 ۰۹۳۹۷۵۷۹۵۵۱ چنل اعتماد: https://t.me/khalesexi6712 توجه داشته باشین چنل من بهترین و واقعی ترین چنل در راستای سکس حضوری می باشد.برای اطمینان وارد کانال شوید و مدارک اطمینان مشتریان به ما را مشاهده کنید.احساس خوب را فقط با ما تجربه کنید😍😍", "okbutmoreglitter": "This made me so happy!", "carrie_wren": "@kentwren", "selfsamesoul": "🙌😭🙌", "emsabean": "@kgh_23 @christinesperanza", "catarinadiasilva": "BLESS THIS PERSON!!!!", "severelyobsessed": "This is sensational", "trippyvamp": "my spanish teacher gave a short lesson one day including gender neutral phrases in Spanish, mentioning non binary identities. It wasn't much, but it was more on the topic then id ever heard from almost any teacher at my school. The lesson wasn't of course as long or educational as it should have been, but only one other teacher in my school (that i know of) even attempts to include non binary in their teachings, even my old health teacher, even during the sex talk week(yes, the sex talk portion of health class only lasted a week).", "elesig.ekalb": "@megan.davies.313 @mtcowleyy @kaahu95 @cheyennekokaua @acacia.fetuao @xavier.pxige \"I believe the children are our future.\" 👼🌹", "dr.rosalesmeza": "Gracias for sharing all you do, in being your full self you all are liberating so many and saving lives. A heartfelt thank you 💖💖", "bunbun__baby": "@betaniavg !!!", "superduperyati": "Bless her heart", "ppuntog": "@mdf_dcb", "trivisba": "I teared up a little bit", "sophiamarrria": "@lapazolivia", "katematsch": "@yonceyfoncy 🙋🏻‍♀️", "kai.iniguez": "I kinda like that idea, Todas, Todos, y Todes. Eres inteligente. Aplauso para ti 👏🏻", "xrebe.bebex": "@saintjonut @pastrami_husband @master_jedi_jen look at this precious and perfect childddd😭", "megan_van_de": "❤️❤️❤️", "gasponce": "#Brilliant", "bharlena": "@annacesc", "myspacefiend": "ES UN DERECHO! ❤️ TE AMO", "brazy_dominator": "No digas mamadas", "scam": "⭐", "oliviarichterr": "@vicknarj what my baby says coming outta the womb", "rootedtheyawaken": "@see.quin", "credulidad": "@imagiica 😍", "tenderloinbisquick": "Brilliant", "charlieandbellacupcakes": "@alexandramayaday how amazing is this!", "raesozo": "@msramborose", "_wildergreen": "🔥🔥🔥", "smart_glamour": "@senatordunn this is the video I was just referencing to you", "pretinhany": "Wow this is amazing. I'm pretty blown away.👏🏾👏🏾👏🏾👊🏾💕", "joshuaobawole": "@transmutated_mystique look at this!!!", "firebirdarthouse": "@piedradeindio 🙏🏽💫💫💫", "olive_honda": "@joshuue we need to find this video and create a spanish LGBTQ presentation", "katieallis0n": "@adrienne_epst @iristreinies", "sirena_st_jane": "I’m not crying you’re crying! 😭😭😭😭😭😭😭😭😭 uffff look at the future 😭💛 thanks for sharing this 🙏🏽", "thibowhoa": "I will help to support this idea because it is beautiful to incorporate a third way of saying Spanish vocabulary with a gender neutral stance. I love this idea to be included as well!", "logann_lanphier": "I love her😭😭😭❤️❤️❤️❤️❤️", "tazzy_monster": "This kid is a legend, and it gives me so much hope for younger generations 💚", "jordanriver97": "This is so beautiful! Kids are really the best allies! 💖💖💖💖😭😭😭", "_1nsert_name_here": "Time out I’m confused why does someone sexuality have to change the way the language is spoken?? it’s one thing to respect someone’s wishes and Ideals but to change the structure of a language that’s older than anyone living today seems a bit much", "briaes": "@skwrlyshea", "paige.s7": "In the end it’s all about respect. If I want to be called Pam because I identify as Pam and not Sydney then respect my wish. Good on this child for doing what she can to respect others!", "marcianatl_": "@losadacadavid", "pincheanaivyy": "@_papiichulx ❤️💖✨", "oscar_falck": "😂😂😂😂😂", "ragina__rage": "The kids get it, but we don't. It's so so sad.", "tainaberardi": "Inspiring. So inspired.✨🙏🏽❤️", "swank.ki": "@naataalienicole", "jessbag": "This child is AMAZING! 😍 I wish adults around me understood my nonbinary identity as well as this delightful child.", "peachgabbler": "@laura.vera.1428", "ambroise_finnick": "For those of you who struggle with people who think we can't use neutral language because it's not \"in the rules\", you can always encourage them to actually LEARN about linguistics because the way we talk influences vocabulary and rules, not the other way around! If everyone starts using the word \"poot\" to describe cars, if that is the common thing spoken and understood then cars are not cars anymore, they're poots, just because we decided 🤷🏻‍♂️", "perlesastia": "I do the same in french because we have tous et toutes and i use a neutral one 😊", "2000percentsuperstar": "that’s cute. the only problem i’ll ever have with this issue is when people say it should be required by law to speak like this.", "bsmess": "@mistermxwell sunshine", "semidivina": "@mariselanorte @lowpowermode @andres_payan", "ninacorn": "@noahgtucker stay young !", "ceesando": "this is so amazing & beautiful & hopeful! thank you 💕", "johanthatbitch": "Que cielo de niñaaa😭😭❤️ que lista y que mente tan abierta tiene a tan temprana edad", "gracevsgravity": "Thank you so much for continuing to educate us ❤️", "mafem58": "@javibawigga", "imjustsomebody95": "@victoriagimenez08 🔥", "sleepersaver": "@rosalaura_", "sophdelucca": "@feodri como eu vou educar os meus filhos", "high_s0ul_bby": "@mynameisnotpatricia", "mkross86": "“No matter how many times she tells me that word doesn’t exist, I’m going to keep it in my vocabulary” 😭❤️", "sankofamind": "I LOVE THIS BABY 💗", "jenerous\nVerified": "Verified", "madmadyxx": "Ugh that is so frustrating!!! I’ve had a native Spanish-speaker tell me the same thing but I mentioned this video and they responded, “hmm, well that does make it more ambiguous”. Thank you for spreading the word ❤️❤️❤️❤️", "soul_seeker_az": "I’m sorry you had to waste your pearls on swine. Adults can be so irritating. Kids though? I’m glad they are our future. I love this child’s message. 💓🙏🏻💓", "croissant_alina": "@vainiirisjutut I love this💕💕💕", "amarajoy": "😭❤️❤️❤️‼️", "jewelsales": "This is incredible. I can’t believe a child her age has such emotional intelligence to be able to articulate this. So important", "petriname": "@blackhearthawk", "marire": "♥️♥️♥️♥️", "alialeeanngilbert": "😭😭😭this baby is here for the light of this world to get brighter.", "catrionahoare": "Thanks for sharing. Please can you (or maybe another follower knows) explain the use of black ‘femmes’ here and in many of your posts. I have googled it but there were a whole load of slightly different meanings. Are you using it instead of women and if so I’d really like to understand why and what the difference in meaning is please? Sorry if this is something you have explained before, am relatively new here and keen to learn and understand. Thanks", "iamrachelricketts": "I was just inquiring the other day about how to be gender neutral in Spanish and how it must be challenging but that there is without question a way! Praise this child! 🙌🏾", "mxleahy": "@rachellerfoster what a lil babe 😍", "angela_brandenburger": "@bob_pickard", "merissalehr": "She’s leaving me in the dust over here. I need to be a little braver and step up my game. Thanks for sharing xxx", "jrklus": "😭🙌🏽❤️", "gutterflysigh": "😭❤️", "thurka": "Thank you @ihartericka 💜 you make the world a better place", "mariescalendar": "😭😍❤️❤️❤️❤️❤️❤️", "freddiemercurysmustache": "Teach the babies 😩❤️", "swoonandgoon": "@karlitalibre000 @briyanaclarel", "nightdances": "This child!!!! Yes!! Thank you ❤️❤️❤️❤️", "finding_atom": "My first job out of college I started transitioning. I worked with high school kids all day and they got it right away. Some of them told me they didn’t know anyone who was openly trans but never questioned a damn thing. They respected my journey, used my pronouns, and corrected the ADULTS (my co-workers) when they fucked up. Children and young people understand gender so, so much better.", "hannahbelleslo": "I love how kids can sniff the bs 💩 a mile away. They're being taught to stand up for each other, but she's fighting people in the system that's supposedly teaching them! Hope she continues to open hearts and minds, what a soul!", "andbalmori": "Honestly, is easier in Spanish than in English 😂 the problem (at least in mexico) is that some of us use X and some use E so we haven’t defined yet.", "kamicat11": "Many languages have gender, not just Spanish. Even non-indo European languages have gender. The linguistic details are not as important as the social attitudes about sex, gender, and sexuality though.", "chaycecornette": "@maxwellcormier", "perihelionn": "ADULTS ARE IN THE WAY OF THIS WORK. 👏 Sadly that is too real. Really sucks that they made the experience turn out like that for you. This child is building a better future for sure 🌱", "heyyymrsmcdaniel": "And the children shall lead us 👏🏾👏🏾👏🏾", "queerofficiant": "Thank you for sharing. Brilliant!", "anhobbs": "My heart. This fills it right on up.❤️❤️❤️", "mississippijaz": "💕", "jessikneeland": "Oh god I love this so much 😍😭", "64impala_abdul": "I’m not crying you’re crying", "molly_banda": "Wow! So beautiful and very interesting 🔗🙏🏽", "bujotastic": "This made me want to cry 😭 Children are our future and I have more faith in them, then I do any adult. Thank you for sharing this.", "ladyloveletter": "She won’t be a future leader because she already is one! ⚡️⚡️⚡️", "madamecadaver": "@aaniinkualina @eve_jamami tulevaisuus on näiden käsissä 🖤🖤🖤", "waterocks": "@s.e.casey8", "stemsko": "@stray354", "brain.zap": "\"It doesn't exist\" IT DOES NOW HONEY", "sarahbrinegar": "Wow😻 seeing this is so inspiring- ANYONE can speak these truths! Children are so powerful", "bmayallen": "this is beautiful, and just what i needed to see tonight. thanks for posting 💛✨", "agusrossiter": "@luliroisman", "thelatejc": "Children are brilliant, pure souls❤️", "gngrrg": "why in the world does the teacher take such an issue with this??? it’s not hurting anyone. obviously she knows that the masculine and feminine forms exist, so it’s not a matter of the girl being ignorant. in general i don’t see what the harm is in gendered language but this teacher seems to have put a huge fuss over this when i’m sure there are dozens of better use for her time as an educator.", "justmeliz": "How it’s SUPPOSED to be.💕💕 The children. Are a blank canvas. They are the future and this gives me such hope", "senoj29": "Out of the mouths of babes...", "joannmurph": "😍👍🏼", "leahmertes": "Wooooow. What an intelligent and kind child. ❤️", "steampunk_wedding": "@latinxspiderman", "girlonthegreenbike": "I wanna be like her when I grow up😭", "thisgirlhugstrees": "🧡🧡🧡 is it okay to share your words @ihartericka ? 🧡🧡🧡", "monicapirani": "Thank you so much for sharing this. 💕💕💕", "kavi__b": "Brilliant.", "subriamusic": "@mskingyaa", "afrocaribenalove": "🙌🏾🙌🏾", "drawnbybex": "I don't know if this is a dumb question or not, I agree that the gender binary has been used/is still used to control and oppress colonized people. But I believe it's also been used as a tool to oppress the colonizers own people, like queer people within colonizing cultures, is there a different term to talk about that gender binary oppression since they weren't colonized? Or is colonialism broader than I thought? I guess I'm confused at the gender binary being a \"result\" of colonialism since I thought it existed before within certain cultures? I hope that made sense. I'm both white and cis and have a lot to (un)learn. Sorry about the ladies in your class.", "gretchenwylder": "💓💓💓💓💓💓", "junecatastrophe": "@nochecita_", "aqua_slvt": "@drgstr !!", "unskinnyshero": "Thank you for sharing this ❤️", "momtiredlove": "We have a “trans 101” lunch and learn next week at work through our Equity and Social Justice group. I’m not sure what to expect and not sure how to know if they really meet the mark!", "zuriadele\nVerified": "Verified", "dahnoonie": "@nicolewisler", "emilylorin": "Wow 😭🖤⚡️🖤", "jessjiron": "@caseyfed @manuelafarrell @cadizalu @helenacarmena @humbernal", "teleportprince": "😭🖤🖤🖤🙌🏿🙌🏿🙌🏿🌹👼🏼😍", "daisycosplay": "What a legend", "thedreamyprofessor": "Wow 😯, she just blew my mind, look at this little theorist!", "pretty_t_swag": "I think it's best to address peoplw as they want to be addressed. Assuming is offensive. I would be offended if someone addressed me in a gender neutral manner after I've told them that is not how I identify. Of course it's best to play it safe and use gender neutral terms until corrected.", "foottoface": "I've been wondering about this!", "jessi_mell": "This is powerful.", "ashleemariepreston\nVerified": "Verified", "bridgetbadore": "😭♥️♥️♥️♥️♥️", "torrly": "@eikcajphotography 😭🙌", "wangshui_": "💗", "crystal_cave": "😭😭😭🙌🏽", "nen3co": "💕💕 much love to you and your work im sorry our latinx community is so antiblack. Also to derail in defense of a colonizers tongue that erased and raped indigenous and black latam cultures shows their true colors. tbh we should all 🖕 the spanish language as it continues to oppress and erase cultures to this day.", "sugaring.brooklyn": "This is so beautiful I have chills on my toenails", "simplydes35": "yess little baby. ❤️❤️", "lizziedownes": "@governmentputa thought you might like this", "mojodisco": "I have so much faith in the babies", "joanna.kerch": "The future! @coopmusic247", "jolenetara": "This is so great. 💙 French is my (passable) second language and I've been so curious how gender neutral pronouns work in Latin languages, when even things like doors are assigned a binary gender.", "stcrduhst": "Ah I'm learning french and it's always so disappointing that I can't talk abt my friend that uses \"they\" pronouns in English bc there's not french equivalent. I love that this girl is making her own solutions & being empowered by language, not restricted", "nkechigram": "Also, language is fluid. The second we start using a word to mean something, it takes on a meaning. People only act brand new about that when it serves to demean others and keep their social power.", "shoel_con_j": "There is a lot, and i mean a LOT of problems with the inclusive lenguage, and the only think that this kind of people do it's shit on the idiom xd", "devalux": "This is one of my all time faves (if I'm not mistaken , the child is Argentinean, though Uruguayans have an accent that seems similar). Yes, Spanish is very gendered, thanks colonialism, but thats just an excuse for transphobia. I have had that argument so many times, with people defending the Royal Academy of the Spanish language. We are so colonized, it's disturbing.", "gcarbz": "@ldizzle7_ this sweet child is so brilliant", "watchingtheworldgoby_": "I’ve been so curious about this and haven’t done enough research. Thanks for reminding me!!! Love it.", "subiewandia": "Kiswahili is gender neutral too, including the pronouns, and i think many Bantu languages are too, it's so interesting seeing comments here about other languages. I wonder how such languages shape a person's outlook compared to gendered languages. Also this lil girl is so 😍 i hope no one snuffs out her fire. So heartwarming 😭", "browsbyotilia": "From the mouths of babes. This is beautiful. Thank you for sharing 💜", "icallmeprincess": "If a child can do it um hellllooooooo!!!! Smh it's not that hard to respect someone. If you do apologize and ask. Simple, easy kapow love", "my_left_breast": "💗 the kids will change it! I admit I have a hard time, but not because I don't agree. I do want to honour people's expression of self, but the language I learned is wired into my brain. I slip a lot, but I also apologise and correct myself. (And if people argue about this, it's because they are not self reflective and cannot see how they've been programmed).", "beautiful_cocoa_": "The babies give me so much hope ❤️", "return.of.the.maccc__": "@maya.laliberte", "mstaradye": "What a beautiful video! Thank you for sharing! 💕", "_______ec_______": "Beautiful!", "queen_mel23": "😍😍😍😍 @kinda_i_want2 i love herrr", "jodiepatterson": "She is phenomenal", "zrosaaa": "I speak Spanish with family and I’m going to integrate this into my vocabulary. Thank you for the incredible work you do and I’m sorry you have to deal with such backwards ass people but you are brilliant and wonderful and strong! ❤️", "maramarchizotti": "This little girl is from Argentina, from where I am! She is absolutely great, I remember when this video came out people were loosing their minds, and still today so many won't use gender neutral language, so annoying 😞", "tamday121": "gorgeous.", "ang_e_la_la": "❤️ What a brilliant little human 👏🏻👏🏻", "msposhdosh": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼... kudos to this beautiful being of love and light... thanks so much for sharing 🙌🏽🙌🏽🔥🔥🌻🌻💛💛👑👑", "balletmeli": "La Niña es 😎", "mahoganyrules": "@bella.lablanc ...thought u might enjoy...", "oolaloha": "💖💖💖", "patrickleighr": "Kids get it so much better than adults", "adiegirl": "@juliuuhh", "stephaniejohnsen": "Kids are amazing, inspiring, and have the ability to have empathy and respect for people in a way so many adults don’t...or aren’t willing to. Thank you for sharing this and the work you do! ❤️", "sarlejeffries": "🖤", "aocarinapr": "Ohhh todes is good!!! I've been using tod@s. Or nosotrxs. But I like the e! It's much more subtle! 👏🏼👏🏼👏🏼", "eleeevabet": "Thanks for sharing this--so many adults don't want to open their thinking on gender. I got in a long argument with a friend about the gender binary once--it started when he asked me if I thought trans women were taking away modeling jobs from cis women (🙄). Anyway afterward I sent him a few links with info on different cultures' long history with non-binary notions of gender. he told me the links didn't work. they definitely did. sigh.", "life.as.v": "It’s deeply touching to hear them. My hope is strong when I hear the young ones. So many are so clear, esp when it comes to gender fluidity 👏🏽", "___jessicahannah": "She is incredible 🙌🔥❤️", "omg_it_speaks": "Omg I love this", "dominiqueluzon": "@mxguarnaschelli ♥️♥️", "dammit_oskar": "Omg! 😭😭😭 The wisdom and wealth of knowledge in this young person! My heart lightens.", "just_julie_todd": "@the.lawrence.rogue @lawtownactivist @afrolatina_x @colorles @happytobnappi @fiercerev @miuliza @nataliestrella @bigmomma_kiki_", "rachelisfearless": "This is something actually heart warming that exists on the internet. And it's lovely because it's a child who is actively being silenced by adults and isn't giving in", "tarakeeny": "@caminoboyfriend this girl❤️", "ninnileo.d": "This really got to me 🌿", "juju_pgh": "I love this, I love this, I absolutely love this. Thank you for sharing.", "ponythem": "PLEASE do go off", "farrensquare": "Raising my babies without assigning them gender was the best choice I have made as a parent so far (besides you know feeding them and shit lol)", "mybodywpg": "Children are so wise❤️ Thank you for sharing this.", "uzonwankpa": "In the Igbo language of Nigeria West Africa, pronouns are non gendered. One must make an effort to add boy or girl to their statement to qualify which gender they are referring to", "bemnistired": "I want to protect this child with my life", "kate.marling": "The fact that they went as far as to argue that a language isn't adaptable...they better have only spoken in Ye Olde Fuckin English", "barbeque_tofu": "When I was that young I didn't even know what transgender meant 😩💕", "e_monster": "This made my heart warm. They said it beautifully.", "claire_monica": "@betweeneachwave", "indiaroseharvey": "@junoharvey", "jackienikpour": "This is not a very difficult concept to understand (clearly, as a young child can easily explain it). Those who claim they don’t understand are actively trying to not learn this (mainly to hold on to their power). Thank you for sharing!", "sbootykibbles": "Thank you for sharing this, Ericka. Now I’m the one with tears in my eyes!", "askgoody": "Mouths. Of. Babes.", "annaiseinpalindrom": "@mountainofwords", "is_she_okay": "This baby! She's BRILLIANT!", "annabellemaginnismusic": "✨🙌✨ What a lil hero", "allisonrayjeraci": "Extremely fascinating. I study Romance languages and this is a huge topic and theme. Thank you @nolatrees for making me aware of the videos existence and thank you @ihartericka for posting. When she says that this isn’t a palabrita, es un derecho just says it all for me. It’s an absolute right and we shouldn’t be confined by our language but rather be able to embrace each other and cultivate meaning, culture and understanding through expression.", "devjusticesfbay": "Love this", "damn_the_torrpedoes": "Why do people care how others identify? Geez. I do not understand.", "zadddysgirl": "Amazing! 👏🏽😩", "fuckin_gross": "I love seeing things like this. I used to teach science and climate change to kids and People are always arguing “but how will I explain it to children??” The kids get it folks it’s not that hard!", "lydpiece": "Children are amazing 🙌", "laurakayeum": "@emmadhall sawusaw already but ❤️❤️❤️to this cutie pie", "marjbarj90": "I just watched this video in my advanced college spanish class. I have been taking college level spanish for 3 years and thisbisbthe first class that introduced the idea of gender neutral word endings. I am so excited to incorporate them into my speaking/writing!", "drjennyjenn": "Beautiful. Thank you for sharing. 👏🏽🙌🏽", "amypond______": "Beautiful.", "laurensalgado": "As a sexual health educator and human who speaks Spanish... IT IS NOT IMPOSSIBLE TO USE GENDER NEUTRAL WORDS!! I do it 24/7 365!!!", "bookisabella": "😍😍😍😍🙏🏻🙏🏻🙏🏻🙏🏻", "bevinsparty": "Children know! 🌈🌈🌈🌈", "heidicake": "she is the future omg what an amazing child 💖💖", "jackiegonz": "@billythecamera", "votelikeamother": "♥️♥️♥️", "brand_lyn": "@jaeee94 ❤️❤️", "megansansom": "@luckyjupiter 🤗💕🤗", "loganmanda": "Beautiful video!! I'm so sorry you experienced that. Ugh.", "flamingos4ever": "As someone who teaches preschool, I can say kids get it.", "k8__thomas": "I’m so sorry that happened😢", "masc_sof.t": "@magicisbrown", "hollowillusions": "Wow, I wish I was that amazing at that age, I wish I was that amazing now!! The strength in this one person is awe-inspiring.", "tracycozette": "👏🏾", "healing.grayce": "Have always wondered about this, thanks for sharing!", "clariseamala": "wowwww @moonsamms", "outtamasol": "For the love of the babies!!!!!!🙌🏾🙌🏾", "mourweenie": "@ponciano_seoane !!! This ♥️♥️", "hannahnonna": "@callmeandy_916", "erinelizabethcole": "So lovely! I work in health care and indeed gender is a social construct, sex is biological, and while that must be considered in a treatment plan I make sure all the health professionals I work with refer to patients using their preferred gender pronouns. We still have a lot of work to do to dismantle the binary gender associations in healthcare. Thank you for sharing why that’s so important!", "kathrynlstamm": "❤️", "beebejesus\nVerified": "Verified", "thetaygud": "After hearing some gender roles nonsense, my then-8 year old let me know that he believed there is no such thing as gender after we die. It was beautiful. I hope more people can learn and understand sooner than that.", "kabukigrl": "I'm thankful and in debt for your resiliency. I just have thank you to say and that your voice is always in my heart and and mind helping direct.", "fluffmanor": "Parenting win 👏👏👏💕", "karma_stoned": "this. 💯💯💯 thank you for sharing.", "clairemarie_a": "Wow, that is so inspiring! You are also v inspiring. It saddens me to read that there are people at your workshops who argue & try to justify their abuse. No matter what, you are making a difference ✨ I have really learned a lot through your page x", "any.strange": "Thank you for this ☮️", "love.rebecca.ray": "Such wise words from a young one! 💖💖👏🏽", "compostkutie": "Watch this sweet bb angel. 😭@silksandwich.pdf", "mynewdentist": "Can we give her a class please?", "moonflesh": "I’m black & Japanese, and grew up in Japan. The Japanese language was my first & although it’s very gendered, there are easy ways to work around it. In my child brain it was natural to apply that to English as well. It wasn’t until I moved to the US that I was told in school that using they/them was inappropriate unless I was talking about a group of people. I was stubborn and it didn’t make sense to me, but after a few years of it being drilled in my head, I unlearned it... it makes me sad now as an adult because I had it right all along. 💔", "nolatrees\nVerified": "Verified", "garbage\nVerified": "Verified", "bexlife": "Preach, child! 👏🏽", "dimitarobyn": "@dahc_91 x", "indianajawns": "that’s right, baby!", "treevuhh": "Does a non binary person have to be labeled as trans? Or are they respectfully both their own identity?", "ch_mendeola": "I'm not crying, you're crying. Thank you for posting this, I didn't know I needed to see it.", "_dungula": "So beautiful. Back in high school my spanish teacher was not having it.", "monst.ana": "Yes. So clear, so natural, so true. Love!", "sanyuestelle": "These babies did not incarnate to play!!!", "lillyotoole": "@soniahamilton99", "liv.sulerud": "❤️😭❤️", "face_fyrefox": "Wow! What an incredible little human. 😻💜💜💜", "hinenui": "Within my language, Māori - everything is gender neutral. Keep going ❤️❤️❤️", "saucy27pw": "Yes yes yes!!!! Puro amor!", "ashleamaree18": "@hpdanemma this is the best 😭", "dollhouselucy": "I love this video toooo", "lady808": "The spanish language assigns gender to friggin inanimate objects. Bless this little being and their brilliant heart and mind.", "jrealtalk17": "This girl is AMAZING and spot on.", "dabaddestdoula": "💓💓💓💓💓💓", "halenfredell": "What a bright young and sweet person!", "nananee17": "THIS IS EVERYTHING", "ericamichelle.jpg": "@abradanda ❤️❤️❤️", "youfatterme": "The young one is so assertive and confident. Stunning. Heartwarming. Beautiful. I love it. Thank you for sharing the video and your story. Your perseverance is something I admire deeply and aspire to.", "marthasmarthaa": "👏🏼👏🏼👏🏼👏🏼", "ebonyjanice": "This is beautiful how clear they are!!!! Just basically thug life like you not finna change my mind and you not finna belittle this word. 🙏🏾", "barbieisaac": "Wow", "chroniclesofmarnia": "omg this child 🙌😭🙌", "de_ixchel": "🖤🔮🔥🌈✨ es una maravilla", "megan_iris13": "👏👏👏👏", "joanieayoadeyoon": "@danielhuffjung", "emilypierce": "@bibrarian_ 😭", "frumpypaintbrush": "Wow a little girl with such awareness is so refreshing! I always wondered about how to be gender neutral when speaking Spanish because many many words are gender specific", "juliette_kristin": "♥️", "piliweeber": "👏👏👏👏👏", "wocsolidarity": "@florcyx @nasraad 😍😩", "jay_erahh": "YESS", "rochellefatleopard": "😭😭😭😭😭 My heart 💗", "beeblossom": "What a remarkable soul they are!", "heyrach_": "👏🏽👏🏽👏🏽👏🏽👏🏽 Thank you for sharing this. So beautiful, children are our wisest little souls in their clarity.", "mercii_me": "I love this!!"}