{"black_geek_omega": "Man people are really butthurt over this comment lmao", "pufffropro": "Some of yall are trully dense!!!!! Working with out pay is slavery! Point ! Blank! Period!", "flowerboi775": "It sound like Africa actually.", "sophie.holt.90": "Pretty much every country. Cause almost every country had slaves", "myspacefiend": "YOUR CAPTION IS SPOT ON", "thee_nathanael_alexander": "If the US is trash then go to Africa and complain there, see how long you stay alive", "i_am_aa_ron": "GO TRUMP 🇺🇸🇺🇸", "ethanb_50": "@ihartericka I also find it funny that you’re calling the same country that healed you of your cancer trash.....", "vcollado2": "You're wrong. It's not called \"slavery\". It's called mandatory voluntary work.", "just.chillin.18": "How are we supposed to treat prisoners, with 6 meals a day, hold plated beds, and a full closet of clothes. And actually the people not getting paid are not “slaves” Also, if the USA is trash just move to China you will find what a true communist country is. You should know your facts before you post this good lord get a brain.", "john_bwell": "IF U HAVE A PROBLEM WITH THE US GET OUT NOBODY IS KEEPING U HERE ITS A FREE COUNTRY FOR A REASON U CAN LEAVE IF U WANT", "melanincoquette": "@_allsuggaaa", "cripplingfloral": "Not our current day country", "deborah_arndt": "I don’t see how this isn’t true. The entire American economy is based on the idea of owing more than you have. It’s a very high income you have to reach to be able to breathe easy on your own without anybody clutching your shorthairs", "fluffmanor": "Agreed, and I want to know why the ACLU or someone isn't going after the govt for violation of the 13th amendment", "laurynbesasie": "In the words of the genius Childish Gambino, this is America...", "maestromik3y": "And then who gets mad at who when righteous advocates kneel during the American anthem in protest of discriminatory and abusive behavior by law enforcement and our government; lack of commonality between legislators and the masses, is the problem.", "drcassidy": "currently in Tijuana volunteering with asylum seekers, and I’m learning about the cruel reality of detention centers=slavery", "abobo_access_and_repro_justice": "👏👏👏👏", "bujotastic": "And here we are again, all my fellow WP embarrassing the shit outta of us with this bullshit in the comment section. This is absolutely modern day slavery and it’s fucking disgusting. The WP arguing “they are getting paid, it’s just delayed” need their fucking pay delayed as well and see if they’ll be saying the same damn thing 🤦🏻‍♀️ ya’ll are the dumbest of the fucking dumb, with that shit argument. Must feel nice calling out black Womxn, while you’re sitting all cozy with a paycheck and a system built entirely for you 😒 Gtfo. Seriously. @ihartericka May I share this with credit?", "kieranblake": "And prison work, I mean....that is just a sin upon a sin", "zoey_smart": "Okay I see why people might find this offensive but... @ihartericka got a point", "tinytravelergal": "Lol sounds like this country", "sistasdotravel": "G.O.A.T 💯💯💯💯", "blackdeanmagic": "@lex_talk_about_sex respectfully, real question: what do you call free labor?", "honrablmsj": "I have been thinking this for a while. I didn't say anything because I'm white and am still unpacking my part in all this, and I didn't want to hurt black people by saying something I might not have the right to say. I'm not sure I'm articulating well. I didn't want to do more harm, basically.", "milla_sziranyi": "Hungary", "mrsmomcupcakes": "Thats every internship I have ever done.", "hippiisoul": "YOOOOO YESSSSSS THANK YOU FOR SHARING !!! Didn’t think of this but RINGS SO TRUE 💖", "joannacifredo": "Speak that, sis!✊🏽", "j.a.y07": "💯💯💯💯💯", "tvancort": "SERIOUSLY", "thehimalayan": "@_crosswalks", "mbeard97": "All I can think about is @childishgambino \"This is America\" I really really do not have any respect for this country right now.", "oshun\nVerified": "Verified", "dawndaabul": "I’ve been saying this!!! Yes! Russia/white supremacy trying to send us back to slavery...and its working", "yearofthejackal": "I just wanna see someone come up with a useful solution to this problem rather than making some weird comparison to slavery witch dont get me wrong was awful but between this post and privileged white hippie kids calling the government a criminal organization and no one should be surprised like idk some of yall rly live in a fantasy world and u pick and choose what battles u wanna get involved in based on privilege or lack there of", "mais_29": "Amerikkka", "myplumsky": "Unfortunately, also Finland..", "realmorganchambers": "Africa", "iamadajohnson": "Trumpmerica🙃", "nicenice11": "These comments are bugging yo", "bizreitsma": "The constitution had VERY specific language allowing this for a reeeeeasonnnnn. The people on top will always make sure there are ways to exploit the people making them money.", "sareena428": "Some of y’all are missing the point trying to poke holes in this statement 🤦🏾‍♀️", "monstrance.ghastly": "This is an easy, and very apt, analogy. IT’S NOT HARD!! Smh", "xenia.ranae": "These comments are a mess y’all wtf if your ancestors were not slaves of this country please STOP and think again about wanting to tell Ericka she’s wrong 😒", "fashionshoediva": "My 7th grade students said the same thing yesterday as we discussed it in class!", "mermaidkisses_n_narwhaldreams": "It’s worse than slavery because slaves in the most recent American iteration got something to eat most days, had somewhere to sleep.... this is utter bullshit. 💩", "jamie.weiss.71": "This is America...and please dont say it's not the American way..becuase history has shown what the American way is.", "cristyhutto": "That is exactly what we have been saying in our house. The US government and president is failing its people.", "boisquire": "I heard some attorneys are bringing a 13th Amendment claim against the government for forcing folks to work without pay.", "lizvitale": "AmeriKKKa", "buhreena": "Congress and The President are still getting paid too. Their paychecks should be the first ones frozen when they shut down the government.", "spygirlafrica": "My country #NIGERIA as a matter of fact some sectors re on strike as we speak Nd yet, dey re bn forced to go to work or face sack.", "mica.oz": "My brother is a government employee and they have no indication available to them of when the deferred payment will come. *eventually* tell me how anyone can count on an eventually at some point maybe payment for current gas rent and food costs...", "mims_pantaloons": "And on top of this, if the govt employees that aren't getting paid, receive unemployment, that money will have to be paid back - from deductions on their paychecks. This is also hitting people who live in federal government housing, such as NPS employees. Much of that housing is managed by a 3rd party (government contractors). The contractors aren't getting paid, and therefore aren't supporting the housing, and forcing people out. Much of those people are in really remote areas lacking housing, plus with no paycheck it's a terrible burden.", "thenotsoavgbermudian": "LORDT. The ignorance all up in these comments. 😫😫😫", "julieta_salgado": "OOOOP 😵 when people say “these aren’t American values” I wanna laugh/barf", "keriannsbabii": "It’s the American way!!!", "busi_chanel": "That’s exactly what It Is!!!!", "pretty_n.black": "It's such a sad thing. I'm just glad my ma is a nurse for the D. O. D. I honestly wish I could help the people who aren't getting paid.", "lex_talk_about_sex": "This is a bad comparison", "drmelaniedavis": "@ajn44 I don’t think they get back pay. It’s immoral and disgraceful to furlough them, let alone force them to work for free.", "krisharringofficial": "Whew child! You said nothing but a word.", "chelleorc": "Then when they finally get that back pay, these sh*tty tax laws that disproportionally affect the poor and marginalized will force them into a new tax bracket, making them get even less than they normally would.", "fauxromantix": "How TF these workers aren't striking is beyond me", "ayashaluckett": "Yes It Is", "snackalicious": "Sounds like 'Merica....", "slynbutter": "U.S..", "magicallymargo": "Amerikkka", "themartaviuscaple": "MERICA", "kassiriart": "👏👏👏👏", "yach0": "I agree that the shutdown is horrible but they are not discriminatjng against a specific demographic, simply government workers. This is a false analogy", "sunnypreehar": "What’s gonna happen to people with loans that can’t be paid, guess this means credit score will go down to right potentially?", "k6mil": "Amerikkka.", "c0rdero_87": "@ihartericka 💯💯💯💯💯💯💯💯✊🏽", "iamauntiesocial": "Been saying this all week!", "fitbykylie": "A-mf-men! 🙌🏼", "brushfirepress": "🔥", "deeeebo_x": "And many of the bodies being affected are Black bodies. Whew.", "the_luciferous_shift": "Reeeeeaaaaallllll taaaalllllKKK o'clock!", "_renalien": "Is there anything we can do to help the federal workers?? Anyone to call?", "bostonchery": "Exactly I can’t believe this , how is this man getting away with this and for how long", "mo_healing": "Super 🗑. All cause he wants a wall use money the racist gave on the gofundme and pay these people. They work so hard. Like our water ways are being protected by Coast Gaurdsmen worried about they gonna pay bills and take care of their families.", "nafis_white": "I’m an artist who received a residency with the National Parks for Jan-March. It’s been frozen and I’m making things work from home in a small room and the stipend I would have been paid and planned for is also in limbo. I live humbly like the Park Rangers I interviewed with. Some mentioned living paycheck to paycheck and that is similar to me. I would LOVE to get to work, my art is very collaborative and community focused. This unjust shutdown is hurting so many people. It has put me in a compromised position and I know that the impact is widely felt for hundreds of thousands of others too. Our lives and livelihoods are not a game to be played with. This is devastating on so many fronts. Thank you for amplifying our voices because this entire action by this administration is an abuse of power. Period.", "ajn44": "The difference is that the government workers will get paid. Their pay is delayed. They will get paid as if they’d been at work the whole time.", "lionessontherise04": "Come on church! 🙌🏾", "jennie.not.jenny": "I'm watching my check. If they stop paying us, I aint going", "iamemmajoyce": "It's totally mad. All so an egotistical maniac / petulant child can keep a promise he made to racists.", "caimarison": "I can't decide if I should clap emoji this cuz it's so true or shame emoji this cuz it's so true.", "fatasskellypryce": "Not surprised, Slavery is the American way"}