{"okcana_oksa": "Крутая👍👍", "elleki_08": "Beautiful, Queen!", "rage.in.undies": "I was being wronged because I was too white to be recognized as Latinx.", "kianna.luna": "I unlearned that even though I am part black, I can still be racist towards other black people (this is when I was very little and even hated my own hair/skin and thought that I had to blend in more with the White society to be more accepted with my peers-identity issues of being mixed).", "yankolzuleyha": "Gotune gurban", "jjjiefu2002": "What a cool feed! My buddy @empower_house just posted about you. Thanks, Em! I was gonna jump in with some inherited false thoughts, but then wasn’t sure if this invitation wasn’t meant for BIPOC. If so, I will hood space and cheer you all on with my rainbow cape!", "shobin10": "It's normal to work harder than white people. I should deserve my place and space.", "lexicooks_fr": "That I don’t have to be the majority of minorities that turn the blind eye and death ear to racism in the workplace just to continue being seated at the table!!! My black life matters & that includes my voice when injustice is prevalent still today!!!", "renzpee": "That the natural hair community would be accepting of ALL textures... but sadly the resentment toward non 4C textures is real.", "sseh3r": "@ihartericka ive been reading through your account, love and support what youre doing. Not expecting a response but was just wondering how you feel about mixed/ interracial relationships? Can they still be positive or productive from your pov? Thanks in advance 🙏🏼", "ayana.tyi": "7. Number 7 is so huge! I used to think that way as well. However, I learned real quick! They are white first, and queer second. It’s all love and equality when it comes to queer issues. But Baby! The narrative changes real quick when you need them to “stand up for us” black folk. Anyway I love you’re page, and everything you stand for. 👏🏽💗", "hauteur": "#8 has me thinking 🤔", "queen_moinya": "Whew...where do I start sis?! *takes deep breath* 1. A white person dating a black person or POC cant be racist. 2. Black can be racist 3. Being cute for a black girl was a compliment 4. People who are gay/lesbian chose to be that way bc it was a life style (yikes) 5. Christianity or any organized religion 6. That everything written in the Bible literally happened 7. Magic was bad and evil 8. People who identify as gay/lesbian would try to turn me that way by association 9. Making white ppl comfortable by not talking about racism 10. Well meaning white ppl were not problematic 11. No days off/grind culture/no sleep culture ...ok I will stop there", "francesgolightly": "That being nice was the same as kind. I thought I had no work to do because I was “different” from my family. Right now, I’m working on not adhering to western standards, and telling myself that I do not need to have nipples to feel sexual or wanted.", "blessdisjess": "I used to believe that because I have Black and Asian siblings I couldn’t be racist/ have racist ideology. I now know that I AM the problem and that my siblings have nothing to do with my racist biases and tendencies that I employ because of that assumption. Thank you for asking the questions that need to be asked and for allowing me to share what I am unlearning.", "maisyns_daddy": "I as a white trans man want to reach out and ask what I can do to better help black queer women! How can I help to make the world a better place for you too?! Making a change starts by joining hands with those who don’t have the numbers but have the drive!", "osain.p": "I also used to think LGBTQ people could not be racist. I WAS WRONG, & learned that the hard way. I am 25,black,trans & I never felt fully accepted anywhere in my life. Went to a school with almost all white kids, so not there. Queer \"blacksheep\" of my family, so not quite there. Feeling like I am the opposite sex all my life, so not even in my Own skin. Basically, it hurts...still hurts. I know i was bad kid and I made the wrong decision which has gotten me into trouble in the past. But does that mean I dont deserve to feel wanted, to feel welcomed, embraced & celebrated? One day I will be 100% authentically me and unafraid of rejection. We all going thru something, I get that. Still hurts tho.<3 thx4reading", "tarynjacobsonn": "You are so beautiful!!!!!!!!!!!!!!", "sarah_bronks_fit": "So glad to have found your page, there’s not many people willing to have honest and open conversations about race and ethnicity and we need more intellectual discussions everywhere 💪🏻😍💪🏻", "simplyaddh2o": "That my body was shameful. Especially because I had large breasts, as if I could've done anything about my genetics to make them smaller.", "zizisauvage06": "Elle assume même ses poils sous les bras @morgane_de_toi__", "1120_nuday": "🙌🙌🙌🙌🙌🙌🙌🙌🙌🙌 I freakin Love U 💋💋💋💋💋💋", "alichabot": "That masturbation was just for men!!", "revampedglamour": "Fantabulouuuuuuus 🤩👌🏽👌🏽👌🏽👌🏽", "chantellekohn7": "Love this post, thanks for sharing some of your unlearnings! 1. That there were no issues with celebrating Australia on 26th Jan because harmful treatment of Indigenous Australians was in the past and things were all okay. 2. That christianity was the only truth 3. That alcohol was evil and anyone who drank it (even a little) was on the pathway to hell. 4. That adults had the answers and would never lie to you 5. To be wanted you have to be toned but not too toned. 6. Success is determined solely by the individual", "the_faux_somniphobic": "1) Queerness, specifically lesbianism, only comes in one variety. 2) Vagina = women and therefore transmisogyny is valid. 3) Mental health issues don't count towards disabilities. 4) The law is never unjust aka biased towards marginalized people. 5) *And this wonderful classic...* Respectability politics and the need to live through the White Gaze. 🙃😤😌 #dayspast #sohappythatsover #neveragain I also unlearned 1,3,6, and 9 from your list lol. 😄😁😄 #growth", "jmf.13": "@mrsaucypants13", "imaliteraljoy": "Believing it was the victims duty to stand up to their oppressor. How are they going to stand for their own justice when the \"justice system\" doesn't give a fuck?", "blvcklotusherbals": "@moore_kate THIS is the woman I was trying to tell you about one day, but couldn’t remember her handle. More on that later. In the meantime...", "sop__h": "@michaelaleonetti", "ripest.fruit": "i used to think that because i grew up with my filipino side of the family, knew the language / culture, and was raised in a predominantly black n brown working class city, that made me somehow exempt from my white and light skin privileges or “not like other passing mixed white ppl”", "christinebarkerscarletcalliope": "As a person who’s grown up with white privilege I want to say 1. Thank you for this. 2. Since I haven’t lived and experienced what it’s like to be black in this country there’s no way I can ever truly understand the damage that’s still being done on a daily basis. 3. But I want to help and do whatever I can. 4. But I was raised and live in a very white centric area. 5. So I need help and information on what I can do to help clear up stereotypes. 6. I think a lot of people are in the same place, where they want to learn and help but don’t know where to start. ❤️", "brookitaspivey": "What does your number five mean? I don’t understand it, and I am curious", "etothem": "That because my mom is a white cis queer woman I don’t have anything to learn about the queer community.", "ashleyhefnawy": "Thank you for this honesty! A big one for me that I continue to unlearn is tied toxic monogamy. Thinking a lot about past relationships and how I allowed jealousy from my partners to hinder my own growth and expression of happiness, because I thought jealousy = highest form of love. I also unlearned my habit of feeling immensely guilty (again, due to past relationships that guilted me for looking at anyone else) for finding others attractive, talking to, engaging in any way that might threaten the person I was dating. It was manipulative and emotionally abusive, and it required unlearning, because at the end of the day I wasn’t causing my partner any harm by simply acknowledging a very human thing (attraction to another human).", "macaronilf": "1) that privilege is earned 🤦‍♀️", "sameraaleshanee": "I used to think: 1:my being queer was because of socializing with my LGBTQ community...(before i would consider myself queer). 2: reverse racism was a thing and as bad as 'regular' racism... 3: I'm really ashamed to admit that i sorta absorbed racist ideas from my tiny hometown like stereotypes like Asians being good at math, black people sports, and white people inventing more/ 'contributions to civilization' ... 4: life starts at conception and abortion is murder...5: women are different then men personality wise, biologically. So i believed that women were more 'mothering, emotional, etc'...all bs. I think i didn't think about it once way or another and my brain just accepted it. It's scary looking back at who I've been...", "plus_garum_ferre": "1. My body size and weight show that I’m “unhealthy.” 2. Having weight-loss be a constant and visible goal makes me a “good” fatty.", "parkavenuepinup": "That I’m lazy and don’t work as hard as other people when in reality I’m disabled", "hardie.photography": "Still working to unlearn the idea that a white person engaging in anti-racist work deserves a reward. It’s one I still find myself holding on to.", "headmomincharge": "1. Dating black men absolved me of racism. (Thankful I learned it before marrying a black man and having black children so I will never ever tokenize them) ... 2. People only choose sex work out of desperation or against their will. 3. Sex workers only serve men. 4. Volunteering in other countries made me a good person and helpful to people that otherwise would have never gotten help. 5. Having Native American ancestry (which by all research I've done on my family and dna turns out to not be true even) meant I could claim some sort of mixed ancestry and co-opt indigenous pain as my own.", "chelleorc": "1. That because I wasn't mixed or \"exotic\" I wasn't beautiful. 2. Fat=unhealthy (still unlearning this) 3. That I wasn't black enough because of the way I behave. 4. Acting \"ghetto\" was the reason black folks were struggling (this took alot to undo) 5.shrinking my true self benefits others. 6. No harm in using disabled people as sources of inspiration... Always a work in progress", "priscellajaen": "🌷", "zuzu.valla": "♥️♥️♥️", "totallyawesometaylor": "That European beauty standards, especially straight hair, is goals (right up until my 3 year old natural haired baby girl asked my why her hair was different to hers, the truth of babes!). That being a wife to a white man and serving him was my life’s work. To not achieve too highly (education, work, wage) as to not out do said white husband. (Because god forbid his ego may get dented). That my worth to society was the labels they gave me (wife, mother, nurse) and what size my clothes are or how much I weighed (ironic how the bigger the number is the less I’m worth 🤷🏾‍♀️) and I should strive to take up as little space as possible.", "coraglitzer": "1. Antifa are just the same as nazis (bc of the violence) 🙈 2. Some Transwomen just are men who don't want to be held accountable for their sexist actions. 3. Femininity is weak 4. Safer spaces (excluding cis men) are sexist 5. My worth is dependent on my productivity, ppl liking me, especially men liking me (still working on 5.)...", "buddha.and.i": "I used to think poc and black were interchangeable, thank you for teaching that theyre not 🙏", "thejessicaroseclark": "🖤", "jae_avilezzz": "1. everyone just needs to get along 2. all spaces should be inclusive of everyone 3. fat people don’t have sex 4. fat is bad 5. gender is tied to what’s in your pants 6. private school is better than public school and people who go to private are smarter and more likely to be successful 7. white people can say the n word 8. my inherent value is based on my ability to produce and accomplish 9. because i’m not a man i don’t enforce te embody toxic masculinity 10. queer folk who perpetuate heteronormative relationships are not actually queer", "bene222": "I was kind of raised believing that racism could be solved if we pretended it didn’t exist.", "nalodarling": "Love you, Ericka.", "emanragheb": "1-Sex work is wrong 2-Muslim girls wearing hijab by choice are stupid 3- feminism is exclusive for women (there are no feminist men) 4- men need more than 1 partner cuz it's their nature.", "calliane.e": "1. being gay is a mental illness. 2. Women should be submissive to men/their husbands. 3. Gender is binary 4. That because I have black friends that I'm not racist. 5. That I can't identify as Latinx because my mom is white and my skin looks like hers instead of my dad's 6. Emotional/psychological abuse is not really abuse 7. Crying is a sign of weakness", "madelines_mantras": "1. That I don’t have any deep rooted racist beliefs 2. Racism isn’t as big of a problem as it used to be 3. People of all races are treated equally when it comes to healthcare 4. I need external things to be happy (effect of Capitalism)", "jonbonjodie": "@grosbis0us", "breaddread": "🔥🔥🔥🔥", "esmebotanicals": "That God was calling me to be an « inner city missionary » and that that term had no basis is racism and that god was a white man and that missionary work was good and necessary to save souls. 🚪", "msfamousfamous": "Straight hair = people take me more seriously", "bevinsparty": "I definitely believed that because I was fat I was unfuckable and I kept myself from fully connected sexual relationships (I'm conscious and unconscious) until I was in my mid 20s. I also believed my queerness was mutable and didn't matter because of my false beliefs about my Fat body. I'm glad you shared all of this it's super powerful!", "18sporks": "I used to believe that anybody could experience racism, which is incorrect.", "alerochamegahair": "😍😍😍😍😍😍😍", "jolene.reads": "Thank you for this post. It has encouraged my own thoughtfulness and reflection. Most of the ones I thought of are already mentioned- but it made me sad to think of all the people who still hold them as truths.", "abbeyonce_again": "That just believing I'm not racist and sharing FB posts now and then made me a good ally.", "belindavaldesricondo": "I had to unlearn that 1. fat=unwanted. Always have. 2. That sexual abuse made you dirty and unwanted.", "ellanoruhhh": "1) growing up around Black people means I didn’t learn racism 2) speaking up for marginalized people is the same as uplifting the voices of and supporting marginalized people 3) being any ally is just the bare minimum of not being racist, homophobic, transphobic etc 4) since my Jewish experience was unconventional it wasn’t Jewish enough", "blquni": "love u, love the honesty, inspired by your growth + acknowledging old thoughts 🙏🏾💕💕🙌🏾", "southernpeachwitlocsss": "Yes queen we don't know each other but I'm proud of you for this 💛", "birdswords3": "I used to think that “color blind” and “I don’t see color” was the correct approach. I now see how that’s harmful. I see your melanin. And it’s beautiful.", "megangrint": "I have unlearned the concept of “just pulling up your bootstraps” and hard work can get POC out of poverty. I now understand that I was not taught correct history. I was taught white history. It is now my job to go through my own biases and correct what has been ingrained by my family and my schooling. It is my job to be better and teach other white people as I am learning (even if they don’t want to listen). Thank you for all you do so that I can do the work!!!!", "themelissadenizard": "1. The Obama’s were great for Black people 2. Because I wasn’t born here, racism is over 3. The way we dress makes us deserving of the violence that is brought upon our bodies 4. Most White women have my back 5. My hair is ugly 6. I couldn’t date a bi-sexual man 7. My bi-sexuality is a phase 8. Black people can be racist 9. I am allowed to critique Beyoncé 10. I am not allowed to critique the Obama’s 11. Our faves are unproblematic", "1goddezz": "Teach!", "gabbyscaturro": "This is very eye opening and so real and from the honest heart !", "yourgirlsylv": "Thank you so much for this post! 🤩🖤👑🔥", "danielengels86": "I thought I treated women with respect. I thought I could never share deep secrets. I don’t matter and so can’t anyone else", "madeleinehalow": "That because I am raising a black son and grew up in a community of minorities myself I somehow had a deeper understanding of racism and was exempt from doing so much of the work.", "__just__lex__": "#1: I can’t be racist because I’m married to a Mexican man. #2: Not being racist is enough. There’s nothing more to do on my end. #3: Feminism is the end all be all and the movement cares about ALL women.", "leahballstudio": "That living is better when you’re able-bodied, that growing older is boring, that monogamy means love, that being skinny would fix everything, that describing someone as black was rude, that gay people are sick, that hardship excuses you from accountability, that white people can not be racist, that being strong means you don’t fall apart.", "pot8er_boi": "I'm still unlearning that it's not my place to forgive racist behaviour and that I should listen to poc in regards to this", "brrrruja": "Ugh this is good shit!!!!!💯💯🔥💕", "annieblinkhorn": "That poverty/needing and using welfare systems or ‘benefits’ (as they have been rebranded in the UK) = Shame.", "goodgreengardens": "I used to believe 1. my parents always had my best interests at heart and knew what was best for me. 2. that my value as a person was tied directly to my appearance, especially how attractive others perceived me to be. 3. I also used to believe that people were at fault if they were poor.", "kaitiydidnot": "That I couldn’t be racist or privileged because I was raised by a Black woman.", "aims_b": "@alicia jade this made me think of our conversation the other day. 🙌", "lia.realbeauty": "4) the amount of love i get is contingent on the happiness i bring you", "katie.m.doyle.embroidery": "Had to unlearn so many things and am STILL unlearning things each and every day 1. That AAVE = uneducated 2. I have black friends, I’m not racist! 3. If you’re poor, just work harder 4. Dreadlocks are just a hairstyle. Anyone can wear them. 5. Sex work is shameful 6. Woman = vagina. Man = penis 7. Reverse racism is real 🤦🏻‍♀️", "bobrien33": "I’ve unlearned that only physical and verbal aggression can be violent and I’ve learned that my intent is irrelevant and my impact is all that matters. Thank you Ericka and Ebony!", "spideygirl91": "I thought for most of my life that if I had the approval of my white family members that I'd be happy because of the proximity to whiteness...lol @ me forever.", "jannelleoshaughnessy": "1. I don’t contribute to the marginalization if WOC 2. Anger is violent 3. Someone else will do it 4. Intent takes precedence 5. Sex=gender", "gonthierin": "@bradykitch", "lungolwekina": "Sounding \"white\", educated, and having a large vocabulary in the colonisers tongue was something to be proud of 😣", "skipperoooo": "What I used to believe 1. Racism is over 2. Being liberal made me a good person 3. Reform>revolution 4. Capitalism is the only possiblity", "karagibbybeauty": "I was taught & for a long time believed (to serious self-detriment): 1. Masturbation is a sin worse than premarital sex; 2. Premarital sex is a sin; 3. Pro-life is right & pro-choice is wrong; 4. Homosexuality is a sin (I'm pansexual & have experienced attraction to all genders as long as I can remember); 5. God is real & loves me, but only if \"x...y...z...\"; 6. It is better to mind my tongue & measure my words than hurt someone's feelings even if I'm speaking the truth; 7. Having sex with spouse/partner even when I don't feel like it is the right thing to do if they want/need it; 8. (As a child) If a boy is being mean to me it means he secretly likes me. Obviously this is just a partial list. Your page, @ihartericka, has taught me so, so much, but I thought I'd share some of the beliefs that really fucked with my head & my life.", "jessiejames1331": "That my value lies in my ability to help other people; therefore if I’m not helpful I’m not worthy", "nhopetiger": "I had to unlearn that Canada is not racist because there were no slaves. I had to unlearn the words and actions of my abuser and learn my choice to heal trauma or else repeat it generationally. I had to unlearn that speaking out against racism was the “right” thing to do as a WW And it was my job to “save” people - when I should have been listening to and amplifying BIPOC. If everybody just worked hard enough they could get that job etc.", "cat.canada": "Thank you for this prompt and for everyone’s vulnerability. Just reading through them, I’ve learned SO much. Here are some things I’ve had to unlearn and still unlearning: 1. That institutions — religious, academic, political — are sacred, safe and honestly working for the betterment of those they serve 2. That going to another country to work or serve “those in need” is necessary, appropriate or honorable (re: White savior complex) 3. Other people are doing the work here in America, I need to go somewhere else where they have less access to make a difference 4. That empathy isn’t privileged", "yolandavacree": "1.That because I was black, I knew everything about blackness. 2. That PWIs are better than HBCUs. 3. That because I wasn’t raped, I wasn’t sexually assaulted. 4. That going to college would help me escape poverty.", "kaisajay": "1. I believed because there are POC in my family we weren’t racist. 2. I believed that slavery “wasn’t my ancestors.” 3. I believed my queerness made me some kind of ally 4. I believed feminism was the kind of activism that would lead to the most equality and harmony in the world and would sort of take care of other systems of oppression if sorted out. 5. That intellectualizing issues of oppression was a form of activism.", "cottagegoblin_": "1. Democrats are better than republicans(both parties SUCK) 2. Fat=bad/unhealthy/ugly(I’ve always been fat and this is how my family talked abt it) 3. White people who go into other countries were trying to help(like missionaries) 4. It’s wrong to be with the same sex. 5. The gender binary. 6. You have to have sex to have a happy/healthy relationship. 7. Trauma has to be bad enough to be valid(more-so in the case of my own trauma) 8. I am not worthy because I am still learning. 9. Disability/chronic illness has to be visible to be valid(still learning everyday that I am valid) 10. Only women have vaginas 11. I could only be loved if I submitted 12. My hair is what defined me 13. Jesus was white. I could go on but I’ll stop here. Thank you for encouraging me to continue unlearning all the lies the world has taught me.", "fieryfurniss": "This post is phenomenal. Thank you!!!", "bde.veaux": "4. Is one of the main things I’ve struggled with growing up. I was molested before I even understood the idea of sexuality, and raised by a homophobic father who made it clear that being “gay” was bad. It took years to even realize my true identity, because I had convinced myself that the only reason I was attracted to women was because of what happened to me as a kid; one of the biggest lessons is unlearning the miseducation you’ve been given. Thank you for being so raw and honest with us, people like you lift the veil over amerikkka’s eyes and force us to face the truth of it all. Thank you ❤️ @ihartericka", "alessandravoice": "@ihartericka I enjoyed spending my Friday night reading all of these comments. You are truly amazing and have created a beautiful community here on IG. 1) Being a slut is a bad thing. 2)after women’s liberation movements, women became equal 🤨🙄3) racism isn’t that bad anymore (I thought this while learning “history” in school) 🤦🏻‍♀️ 4) to the point above, I really believed what I learned in history class...thank God for actually doing some research! 5) Everyone in prison deserves to be there (this is when I was a child and just thought life/justice system/laws were fair). Thank you thank you for all you do 💓 love, your fellow UM alum 🤩", "elizabethkhinnant": "Every single thing about race, gender, and sexuality, plus 1. Disabled people should be pitied, 2. That cmpassionate conservativism was a real thing, and 3. That as a white woman I could be the hero in justice stories.", "_thelastpoet_": "Lighter is better", "alittlechrissie": "I’m learning: That pregnancy and marriage is not my final goal and is not a sign of ‘making it’ in life. That my worth is not based on the way men see me, I don’t need a mans approval to be happy with myself. That sexworkers are not bad people. That sti’s have a very damaging stigma surrounding them and it needs to be destroyed. That there is so much casual racism, sexism and fear mongering in Australian media/society. I work hard everyday to unlearn the little irrational fears and first thoughts about POC/immigrants/homeless people that I have been taught as a white person growing up surrounded by white people.", "paninifuckinchowder": "love u", "1phenomenalmommy": "@cornbread_babe", "joluehmann": "1- Indigenous people were less educated unless they assimilated 2- The more developed countries were blessed because they were Christian at the root 3- People with straight hair, lighter skin, taller, skinnier were the most beautiful people. 4- Christianity was THE way to be spiritual, everything else was demonic 5- Men were to be the head of the house 6- Poor people were lazy ... So many more. I cringe now 😖🤦🏽‍♀️", "spacelysprockett": "You are so incredibly BEAUTIFUL!!!", "brsuga": "👑", "marglaza": "That my views on what a good college were and what was the correct way to speak and handle yourself in a situation weren’t based in white supremacy but rather just “proper”", "snugglymisha": "That public spaces are already greatly accommodated for disabled people .... just in general a lot of ableist thoughts that I grew up with. So glad for the great people online who have educated me abt what it's like to live with a disability", "mel30hippie": "Desafio, vai dar mó treta, quando eu disser que vi Deus e ele era uma mulher Preta 💮🦋", "aguilasj": "A variety of versions of white savior complex - like someone said before, looking for ways to be the ones saving other vs. doing the work on ourselves and our own communities (still unlearning this), that as white people doing and calling out this work we “deserve/d” recognition and gratitude (again, ongoing). And that because I have black/biracial family members (by adoption, marriage) that I can’t be racist.", "vanezambrano4": "That there was no racism in Venezuela (where I grew up) because “we were all mixed,” hence I didn’t understand that I had white-passing privilege. I didn’t realize how the racism directly correlated with classism in our language and actions. I have unlearned those narratives by educating myself and it is a re-education process and an unlearning practice that needs to continue throughout my life.", "lam9245727": "Very beautiful", "shannonlk": "I used to believe my queerness/transness made me inherently less racist. I also thought because one of my mothers is a poc, that I couldn’t be racist and if anyone called me out on anything, I acted like they were insulting my mother’s identity, instead of owning up to my own racism 😬", "ceesando": "youre gonna be at 200K before you know it!", "sonerbear": "1. That if I just discipline myself more, or exercise more, or eat less or more healthy than I will lose weight. 2. That drugs will help. 3. That if I’m not productive, I’m symptomatic and need to adjust my meds. 4. That depression is a phase.", "streamwaterveins": "I thought that, although i’m jewish (/white), I cannot help end the issue of racism, and that when i spoke about it no one would take me seriously because of my skin colour. So wrong!", "hechoclark": "Oooh I could say so many, but a big one for me rn is Afro-Caribbean folks were mostly brought to the western hemisphere through the same system of slavery as in America. Growing up I had black friends tell me \"you're not really black! You're from Barbados!\" They did not teach Caribbean history in school so lots of folks thought black ppl in the Caribbean were native to that land & therefore not black in the same way as Black Americans.", "meatlessinmontana": "I used to think that I was so nice that I couldn’t be racist. I also thought it was rude or wrong to ever talk about race, and it was better and more polite to ignore it. Now I know there’s so much to learn about and we white people need to talk about it, and that it was a huge privilege to be oblivious and to ignore it for so long", "hakamme": "I’ve followed you a long time and love all you do. Regarding number four, I am so sorry. My heart breaks and eyes tear reading it. I was sexually abused as a child also and know it made it much much harder for me to come to terms with being bi and being attracted to women when a woman abused me. All my love. X", "ehayesro": "That being nice to POC is a legit signifier of not being racist. I’ve started to wonder whether all I’m doing is signaling to myself. This has been since hearing about the recent research showing that progressive white people try to make themselves seem less competent when interacting with POC,. I’m now curious about whether the way in which I’m being nice is in fact othering, and/or achieving only a pat on the back for myself rather than really reaching out to make a human connection. I’m trying to pay careful attention to how my behavior is received in order to investigate this, and to challenge myself to reach for more in my interactions (e.g. asking “how are you?” Or “how’s your day going?” or “how was your weekend?” rather than simply smiling and saying hi).", "fragileforyou": "I once thought that no one would want to be in a relationship with a trans woman because they are neither one thing or the other. GOOD LORD was I wrong 🙈🙈🙈", "blxcknosugxrnocrexm": "My name is also Ericka, so nice to meet you rare twin. ❤️ @ihartericka", "rachrachface": "That straight hair & being “thin” is the epitome of beauty. That racism is obvious and purposeful (& therefore I could never be an active participant). That equality is the same as equity.", "m0qui": "Thanks for sharing. Let’s see...in 25 years of life I’m just barely fulfilling the bottoms of maslows pyramid need which helped me un learn things, that plus my partners amazing thirst for knowledge.  I thought I wasn’t toxic because I wasn’t traditionally masculine. I thought I could just tell people what I felt was wrong, with them or society without caring for their own place in life. I thought I was cool with white people. I thought gender was a binary and associated with genitals. I hated my body. I hated my voice. I hated almost everyone because I thought I couldn’t fit a box.  Still a lot f unpacking but folks like y’all are really, really doing the world good. 🙌🏽🙌🏽🙌🏽🙌🏽 😭", "paigeposeygrimes": "1. Women in abusive relationships are weak. 2. You won’t get raped in college if you dress modestly and don’t drink excessively. 3. That saying “black people have the cutest babies” is an acceptable statement. 4. That adopting a black child gives you a voice equal to that of POC. 5. That I can’t be racist because I’m a democrat. 6. That white women and black women have similar experiences regarding gender discrimination and generally face the same issues in life, relative to their financial status. (Ie. poor white women = poor black women, rich white women = rich black women.)", "thedreamyprofessor": "1. My thinness means I don’t have to worry about my health because “good” health and weight are tied together. 2. Learning about systemic oppression means you can’t perpetuate it, theory is enough 3. I owe people an education/explanation on the issues I care about 4. Laziness 5. Gender and sexuality are determined by each other. 6. You can tell someone’s gender and sexuality from their body. Most of this is stuff I unlearned from @ihartericka. All of it is stuff I’ll have to continually work on.", "too_fab_4_you_": "I’ve unlearned loads of stuff!!! Feminism is a radical movement for cis women only. I can’t be an activist for black people, people with disabilities, Asian people, trans people, intersex people, and other groups that I don’t fall into, I need to just fight for cis women’s right and queer rights That gay men are people to worship That drag culture is flawless That slut shaming and thinking of your self as a slut because of your past, is completely fine. That I can’t be proud of my nationality because I am white That people can’t be assholes to me about my race because I am white (people assume that I don’t know my privilege) That my problems, struggles, and recovery isn’t valid because of how I was born!", "yourmamadressesfunny": "That pussy hats weren’t a problem.", "northernwildflowerr": "One thing I’m working so hard and painfully to unlearn (that I was reminded of when I saw this photo, actually): that women’s bodies are shameful and should be kept hidden, that it’s women’s responsibility to make sure to keep covered up so men can “stay pure”, that our virginity/purity is the most valuable thing about us and, as I’ve heard pastors say multiple times, a gift reserved for our husbands. I don’t believe any of this anymore, but the shame is buried deep in my soul and it’s fucking hard work to dig it out.", "dapontefern": "Beautiful pic...love your confidence!!! You're goals!!!!!😘😘😘😘", "sssiimmoonneee": "I’m queer so I can’t be racist, violence will never achieve justice,", "scibookie": "1) I'm mixed so I'm not racist. 2) My brothers and I have the same mixed experience. 3) I understand my black parent's experience because we share genes. 4) That empathy is the same as understanding.", "ju1ie_m": "I scrolled for a few minutes and didn’t see these ones so: - that colorblindness is what we should all be striving for - that the only black folks living in Latin America are mostly in the Caribbean and Brazil (the fact that I majored in Spanish in college makes it especially shameful that I was so grossly uninformed about this point at one time in my life!)", "y.barencoabbas": "That the discrimination I received for being of Arab descent meant that I couldn't be racist. Wrong. That because I didn't actively partake in racism, I wasn't racist or helping/ supporting a racist system. Also wrong. Looking at those who are disabled with pity (inherent ableism), was also very wrong. That because people told me \"such a sweet girl\" shouldn't speak up about such \"unpleasant\" topics such as white supremacy/ableism/rape meant I should quiet down to avoid making people \"uncomfortable\". Wrong. I also remember thinking for a long while that because I was \"such a sweet girl\" 🙄 I couldn't possibly be doing anything wrong. That me being conscientious about my inherent racism was enough and I was doing my job. Lots of things that were wrong and lots that I'm working on still.", "omgirlalli": "That I should abandon my poverty stricken community once I finished college because it’s just filled with drugs and violence and WE are to blame for it not that it was a systemic process. AND that Black on Black crime was actually a thing! 🤯🤯", "rarire_": "Main one: It doesn't matter who you are and where you come from, if you work hard enough you will always be successful", "shani_vellve": "Things I used to believe but I no longer do/am still actively unlearning: 1. The term POC is good enough (it actually still often erases black folks) 2. POC capitalists and politicians can and are interested in improving the lives of everyone 3. Allyship is effective (still trying to see how it can be done without doing further harm) 4. Gender binary (or any binary) is useful 5. Barack Obama was revolutionary 6. Radical change can be accomplished without the use of violence against a violent regime 7. Someone can be a proud capitalist but that doesn’t make them racist (as if the two can be separated) I honestly could go on but these are things that have been on my mind most recently. Thank you @ihartericka for making this post. Reading all the comments has been eye opening, seeing how we all use our individual experiences to understand the same concepts is so beautiful to see. ❤️ from LA! I heard you speak on the panel at @kidd.bell Dick Pic show and started instantly following you on IG! Best decision I ever made on this platform.", "itsevab": "Wow! Coming back to this after I meditate on it a bit.", "thirteen.dom": "Things i used to believe: 1. I am not a feminist, i dont need it, i am not a affected by sexism 2. Reverse racism is a thing 3. Anyone can be racist (whereas now i know only white ppl can be racist because of power dynamics eventho we all suffer from prejudice and racist thinking, a narrative created by western europeans) 4. Racism is only an individual problem 5. My mental illness is shameful and something to keep secret.", "mj_atamian": "I’m conscious of diversity, so I’m not racist.", "slothpromises": "I'm white and from a rural-ish area and I've had SO MUCH to unlearn (list below). It's a continual process to be sure. Thanks for this post and all the work you do, Ericka. 1. I knew America was founded on white supremacy and slavery, but I didn't know about the extent of modern day slavery and how white supremacy is upheld today. This is a continual learning process for me. 2. I was the definition of a \"white feminist\" in the past. I was ignorant of the fact that mainstream feminism often lifts up white women's voices and issues and excludes people of color, trans people, and others. I try hard to think beyond myself these days and about what people who don't have the same privileges I have go through. 3. I used to think sex workers were emotionally damaged. Now I see it as completely valid work by people just trying to survive like the rest of us in this thing we call capitalism. 4. I used to think vegans were ethically superior, although I never was one. Now I'm aware that there is no ethical consumption under capitalism. People have different dietary needs, cultural norms, financial concerns, etc. 5. Very recently I learned what pansexual was and I identify as one. Having never been in a relationship with a women I previously felt uncomfortable claiming that I was queer. 6. I enjoy yoga and I'm continually learning about it's colonization and the nuances of cultural appropriation vs. exchange with that and other things. 7. I've found liberalism to be bankrupt. I don't trust most politicans promises or celebrities anymore.", "wellnesswithwambui": "@ihartericka That I’m biracial so the one-drop rule excludes me from having different levels of access and privilege", "mxtiana": "#4 is a big one for me. Thank you for this post. 1. I’m only impressive or successful if a white cishet thinks I am. 2. If you are emotional you cannot be take seriously. 3. My body is inherently sexual whether I like it or not. 4. Sex is only penetrative and virginity is real. 5. Having a tragic life lessens my white privilege. 6. Humans could be illegal. 7. Abuse is only physical. 8. My worth is measured by my productivity (still struggling with this) 9. Gender and Sexuality isn’t fluid. 10. Sexual assault keeps happening to me because I’m broken and it’s my fault. 11. Marriage means you have to tolerate abuse. 12. I don’t benefit from pretty privilege. 13. The military isn’t trash and the law isn’t racist. 14. Representation isn’t that important.", "iamhannahhamilton": "I used to hold that there is sin and heaven and hell and only one way. I used to hold that rape was only when the women was beaten up and clothes ripped. I used to hold that if I wanted to get ahead in work it was normal and acceptable to allow men to sexually harass me and it was normal to have to pretend to like it so you didn’t hurt their ego I used to hold that sexuality and sexual preference was this or that, black or white when really it’s all shades and flexible a constant evolution.", "mystic__leigh444": "I used to think that because I was a vulnerable population (i.e poor and non-able bodied) that my marginalization was equal to POC facing the same. 😭", "tempestcore": "The Judicial System is fair, and everyone who is in jail deserves to be there.", "eternalegg": "💖💖💖", "sarahbnatural": "I inherited the belief that I have a firm and grounded understanding of how racism works. I had to learn that I don't give black people the benefit of the doubt, nor do I see black people as an authority on their experiences with racism (hence I would correct folks and say that they must be misreading the situation or are being hypersensitive). I describe this mindset as present tense because I STILL have to remind myself to trust that POC know what they are talking about and check myself when I get offended by something because that's the ongoing process of being exposed to my privilege. Ok that was a tangent. Just, thank you for being raw and \"offending\" me. ❤️", "creating_kitchens": "I used to think that by not talking about race I was helping be more equal, I thought that be making myself smaller and trying to take up less space I could personally make up for the space taken up by others. I realized that we have to talk about race and privilege and equality, and we have to keep talking about them to continue understanding them, I realized that the inequality is based on us not talking about it, based on the idea that we will blame others instead of take ownership for our own role in race and racism. I talk about it now with my students and their families we talk about inequality and justice for all and I’m still learning and listening and talking because I want to keep learning.", "jessprenosil": "I used to think i understood racism and women of color because of all the oppression i experienced as a girl/woman. I used to think my complex ptsd from years of sexual trauma meant i understood what other oppressed populations go through.", "theroguewarlockmonk": "Basically the same things you said, except gender because still have a lot to learn, which in turn has me struggling me gender identity because I don't know enough and I get a little confused So, 11. Being gay is a sin, I grew up apostolic Pentecostal so I grew up in a very homophobic , transphpbic, anti-lgbtqia church and I was scared to question it or be myself because I thought I was going to be struck by lightning and die and burn in hell . 12. That being kind to people would solve racism. 13. That my weight has something to do with my chronic illnesses. 14. Having abortions made you a bad woman. 15. That women are obligated to have a children. 16. Only white people have mental health issues. 17. Therapy is for white people. 18. That you can just \"get over\" trauma (once I found out what trauma was). 19. Being fat meant you didn't care about your body or health. 20. Showing emotions made you a punk", "mica_nl": "Awesome post! 💗💗💗 Used to believe... 1. Learning about racism is for POC. 2. Low income families couldn’t be happy & fulfilled. 3. Colonization had nothing to do w my families’ success today, since they were poor in Spain. 4. My friend who points out every Asian actor in TV must be crazy 😉 5. Police & DoJ protect everyone; & the court system is fair. 6. Authorities are correct & always deserve respect. 7. The Catholic Church is my home. 8. My parents would eventually understand my queerness. 9. I would be more accepted and loved presenting conventional female style, than a complex & untested version of myself. 10. College would teach me everything I need to know...!", "mybodywpg": "I used to think that all racism was out loud in your face said and done by “the bad people” I used to think that I was not a part of the problem because I was “one of the good ones” or “not like them” and ignored how I was benefitting off systems of oppression. I used to think that there was an end to learning how to be an ally/accomplice. And a whole bunch more!", "a.wannabe.bad.girl": "I use to believe: 1. That feminism is about white cis women 2. That my own bisexuality is a phase and wrong 3. That Australia isn’t as racist like other places 😒", "copyrightfright": "Things I unlearned (mostly due to talking with others) 1. I’m bad/at fault because I’m fat 2. I’m don’t get anything because of white privilege 3. America is a good country with a good history 4. I’m queer so I experience the exact same discrimination racial minorities experience 5. Illegal immigrants shouldn’t come here illegally if they don’t want to be sent back 6. Native Americans get so much for free from the US (I know how terrible these all are. Number 6 is especially ironic)", "__cryssiespeaks": "I had to unlearn that when someone says that they are colorblind, it doesn’t excuse them from the racism that they perpetuate/ don’t call out. I also had to un- learn and continue to unlearn gendered language.", "yarnderwoman": "From an Australian perspective: I’ve thankfully unlearned that Australia Day (26 January) was a time to “forget our differences” and “celebrate that we’re all Australian”. Rather than the truth, that it commemorates the start of colonisation and genocide for our First Nations people.", "chaalyall": "1. If I make myself invisible I can control my vulnerability to sexual harassment and assault. 2. It’s a huge academic, social, and professional compliment to be considered “one of the boys” or “like a man”  3. Gay men and trans men and women are not capable of sexually assaulting me, objectifying me, or discriminating against me  4. It’s my job to be the perfect visible lesbian to destigmatize being out at work/life/home  5. It’s my job to be patient with homophobic people, I have a moral imperative to educate them so they can do better and stop causing harm to our community  6. It’s my fault I’m targeted for assault - if I could just become *less than* in some way I could be safer. If I hide by enlarging my body, having hair in my face, hiding my feelings, and recloseting myself - I will safe", "lou_leelyn": "I unlearned in my adulthood the confusing twinge of fear that entered my brain when I saw a person of color and the utterly false assumption of criminality in people of color that barraged me nightly on the news and was told to me by a mostly white community as a child. I have unlearned the entire history of our country based on the textbooks I was provided that only white people wrote. I have also unlearned the idea that there’s nothing I can do to change anything.", "deathbypansies": "That I couldn't be participating in gentrification because I was \"poor\".", "lagrossetoile": "That because I've spent a lot of time in Africa, I can't be racist ( I thought this up until that wonderful queen of a woman @munroebergdorf made a history-making tweet, got kicked off her L'Oréal campaign because of it, and made many people's brains grow exponentially by refusing to be silent about it- Munroe i am forever grateful to you for making me begin to see the truth about myself and the world 😘). That African countries would regain their power if everybody just learnt how to stand up for themselves and work harder (I'm super-ashamed of that one and just admitting it here in case it helps someone else unlearn a bunch of crap). That Black people and trans people were all included in the fight for freedom which somehow I thought was inclusive and never stopped to question that it's essentially a white liberal thing - I thought it was a white liberal thing, I never understood the real history of Black activism or how I had benefitted from the inclusive activism of others- your week on trans activism was one of the best things you've put in front of this small brain. I've learnt that challenging my assumptions, changing my understanding, and being quiet and listening to others feels really amazing if you remove ego and that seeing the world as it really is is the first thing towards getting us all free. I learn a lot here from both of you.", "puurinxess": "Promiscuous women don’t deserve the same amount of respect as women practicing celibacy or monogamy. That I was better than other women for not having sex", "stayingintheemeraldcity": "That hashtagging and retweeting = action. I say this as a white Australian on 26 Jan, Invasion Day/Survival Day.", "kjoberk": "1. I wasn't racist because I didn't say the n-word. 2. I wasn't racist because I wouldn't not date a person simply because of their skin color. 3. That it would have been a great idea to date a black man at some point specifically to spite my grandfather, who my mother once said would be angry if I \"brought home a black boyfriend\". Most of these were based on youth (like bringing home a black boyfriend) and this is literally the smallest sampling of my own bullshit that I'm working on. Thank you for being the person you are 💕💕💕", "i.was.king": "1- Girls ask to be raped for the clothing they wear. (I said that to a friend once a few years ago, and I regret it like hell) 2- The guy should be able to decide on his pregnant gf (or bf,or enby partner for that matter) if he wants the baby. 3- Dark humor is funny. 4- Not liking dicks = lesbian (I though I was a lesbian because of this, but I still liked guys just as I liked girls, and that \"confusion\" led into some problems :( ) 5- Being relious = possibly being a bad person. 6- Being girly and flirty = slutty, bad, ridiculous.", "there.is.a.field": "My name is Barbara, I’m a 58 yr old descendant of Scottish, Welsh and Cornish tin minors, writing this on Invasion Day (delete if inappropriate): 1 we celebrate today as Australia Day because it’s when we arrived and built the nation 2 The are no real Aboriginal people 2 Im not responsible for taking their children away so they need to get over it 3 it’s ok to be white 4 white people can be racist 5 my childhood had sexual abuse and poverty so I have no privilege 6 I’m a lesbian because my parents wanted a boy to work the farm 7 boys will be boys etc 8 if black folks want us to understand, they need to educate us 9 feminism is inclusive and intersectional 10 radical feminism can be trans exclusionary Im on your page to learn and don’t usually comment as it’s not my place but thank for the invite, I’m stopping now as even writing this is making me physically sick", "pruimtime": "I used to really believe that colonizers wanted to share the gospel and were unaware of the harm they caused. And I thought northerners were against slavery because they saw it as the horror it was.", "eatatmomos": "I’m half black and half white so I can’t be anti black or prejudice. Just because I’m light skinned doesn’t mean I have more privilege than darker skinned black folks. We’re the same Gay also meant something was dumb/stupid  My parents couldn’t possibly have two queer children, so I didn’t come out until I was 28. 🙄Young and Uninformed Mo", "drea_carmen": "Others have said, but truly that as a Chicana I could be racist or hold privilege, nor could my family - an extension to my mother and grandparents that since their brown they can’t be those things either. Plus classist, because “we worked for it”. All that said, that origin led me to the biggest fallacy, and that is my personal experience matters. Like, that it is always relevant and people have to make room for it, when in reality it’s just anecdotal.", "jahfe": "I love your # 2. Many people don’t know the damage his administration caused in Haiti. Even after he was out of office he was still destroying the island. Yet, the news always says the Clintons loved Haiti so much that they honeymooned there 😒", "nixxnoirr": "I used to think educating black children on black history was \"otherizing\", and that it was completely unnecessary anyway because blk history isn't special. (this was wayyy back okay lmao)", "khysles": "I used to think that the racism of the past could be excused by saying “those were the times”; that only monstrous people were racists, not me, or people I love; and that all trans people felt like they were born in the wrong body.", "chriswiley34": "I used to love that Gerald Levert song that said I need a woman with a job, a ride and pays her on bills. I used to think I needed the woman he was describing. Until I realized while these are great accomplishments. None of it tells me about her character. Performance and Perfectionism can be detrimental to the soul.", "sunkissedfuckboi": "Unlearning the idea that people with sti's are disgusting was a long process", "hopebroidery": "You (and ebony) have helped me start to unlearn so much, including: the idea that misogyny underlies everything (I am now seeing that underneath THAT is white supremacy); the idea that it’s only important for trans people to talk about their pronouns; the idea that voting is the best way to make changes in our country; and a LOT more, but it all started when I followed y’all and realized that Meghan markle marrying into the royal family wasn’t the absolute victory I thought it was (I literally watched that wedding and cried, and lord did that whole experience teach me to shut up and listen to what y’all had to say before making snap judgments).", "cscreations_1": "Previously married people cant be queer and if they are its cause their ex husbands/wives turned them queer. 🤦🏽‍♀️", "thejoyexpert": "1. I’m not racist because I’m mestizo. 2. I’m not socialized as racist and/anti-black because I’m not consciously hateful. 3. I’m non-binary so I’m not homophobic. 💕💕your joy is radiant 💕💕 all power & continued blessings to you. XX", "thenakedstudio": "1. Slavery ended with the emancipation proclamation 2. I should cry to get myself out of trouble 3. Nice people aren’t racist or Nice/good white people do not uphold racism", "holykimunion": "I think for me a lot of them boil down to \"wanting to be 'good' is not at all the same as doing/being good\". Wanting to be a 'good white person', able bodied person, cis person, etc.", "vickyverymuch": "love this. thank you for sharing ❤️", "simplyshaquilla": "@watchthezlive", "msbfsurviveshighschool": "That because I didn’t “actively” (what I perceived as actively) discriminate against POC, I wasn’t a racist. And, since I “wasn’t a racist,” that was enough. Also, that if we all just loved one another, then there would be peace. 🤦‍♀️", "shan.sweets": "I had to unlearn that sexual intercourse was intimacy. I learned that in my experience the truest intimacy has a spiritual connection and doesn't even need a physical essence and when you have experienced true intimacy only then can you experience making love. I also am constantly learning that intimacy has no gender or boundaries, sometimes our souls just connect. Beauty should be based off soul not vessel.", "word.of.goddess": "I used to believe that blood family is everything and it was the most important thing in the world to be loved and accepted by them. WRONG! The most important person to be loved & accepted by is myself, on my own terms 😊 PS: That pic of you is just epic!!! So strong and free and present. 🙌❤️❤️ Blessings to you and Ebony !", "americahatesus": "Lincoln freed the slaves cause he “cared” about them; William Lloyd Garrison thought Black and Whites were equal (he didn’t); white people only had one or two reasons to justify slavery; they had a new one every week 🙄🙄🙄", "bengalbrony": "What's wrong with oprah? Ain't she still goals?", "dairydairydiary": "1. Thinking that I wasn't part of the problem/not as complicit", "fannyhenningsen": "i used to think i would be okay if i helped/saved everyone around me (virgo sun, virgo rising, capricorn moon 🙃🙃🙃 i used to feel guilty for feeling a bit relieved when one of my (emotional abussive) parent passed away (can se the complexity in it now, and are still able to hold space for love and grieve) i used to think it was enough for me to experience creative freedom through cishet men. I used to think it was enough to live out my querness by just being in queer spaces (maybe deep internalised homopfobia?!) I used to be colourblind I used to be ignorant about Denmark’s colonial history I used to be uncritical towards history “facts” I used to think veganism would save the world (i’m still vegan with all my heart, but realise more and more that it’s a neoliberal/neoimperial trick to blame poor/marginalized/“3rd” world countries even more)  Thank you and Eb for all you do!!! And for this post, wauw 💜💜💜💜", "weightedblanket_": "Took me a long time to understand what people meant when they talked about the weaponization of “white tears” and to accept that as a white woman I also am negotiating my race in public spaces. Not every space is for me nor should it be. That’s life, not reverse racism.", "elbi_elm": "I used to think that if I showed too much affection to my son it would “make” him gay. I used to think that if I received an education at a PWI (predominately white institution) I would have more success in life and be smarter than my friends at a HBCU. I thought that I had to be thin to be important and healthy I thought that I had to give my 10% tithes to the church to receive any blessings in life🤷🏾‍♀️", "jchivvon": "I have believed that I’m not beautiful and that I’m not worth it. My breast cancer journey has changed so much about me! I know I’m beautiful, strong, funny, and so damn worth it!!", "darkcirclesqueen": "I was full of internalized misogyny, and was the worst type of slut-shamer😔. I’m glad that shit ended right after high school😩. I was so full of rage towards my sex-worker mother(abusive in every sense), and it muddled my opinions on innocent women that had nothing to do with my tragic past. Took a lot of time and relationships to unlearn my hate.", "endlessbutt": "i used to think that trans people had to be visibly trans and/or cis passing, or even have to fully transition to be considered trans when that is the farthest thing from the truth the society we live in is obsessed with fitting people into boxes and i realized that being trans is about every indivual persons lived experience and how they decide to portray themselves to the rest of the world is completely up to them and is frankly none of our business, end of story", "doomgrrrl": "I used to believe fat=unhealthy, reverse sexism and reverse racism are real, abortion was wrong unless it was an extreme situation, that sex workers were all human trafficking victims or sexually traumatized, that people could overcome obstacles if they tried hard enough and wanted it enough.", "_raeghn": "I used to hold that abortion was murder and that trans people were mentally ill and confused.", "shugb": "1. Cops and law abiding people aren’t racist, legislation is. 2. Im not trans if I’m not a trans man 3. There is a time and place for standing against problematic language (actually the time is always) 4.i have to speak for others who aren’t present (best thing I can do in most scenarios is pass the mic to let people speak for themselves) 5. My sexual pleasure is defined by the satisfaction of another soooo many more", "stephanie_ldd": "1. White supremacy is an extremist worldview held only by radicalized people on the margins.", "abenilaila": "Growing up being that I have lighter complexion I used to have a lot of toxic negative perceptions towards people of darker shades. I used to think that representation in the government is progressive and will help all unjust epidemics I used to trust our government lololol (This was when I was really young but) I used to think all that is significant in Black history is slavery and the Emancipation Proclamation like I thought that’s all that there was That’s all I can think of rn. By the way with every post you’re becoming my favorite account. Your content always sparks new ideas into my head politically socially and personally so tysm ily :)", "glgarciaa": "Im still unlearning the capitalist idea that my self worth comes from what i can produce. I get tired. I need breaks. We all do, and thats okay.", "gaytheglowinggray": "Some things I’ve been unlearning: 1) oppression and trauma are a contest, 2) it wasn’t abusive because you were never hurt physically, 3) fat = unhealthy, 4) you can tell a person’s racial identity/history by looking at them, 5) proper command of the English language = intelligence, 6) anyone who doesn’t speak English like I do is wrong, 7) art forms that I don’t understand are inherently lesser", "sendinglavenders": "I used to think that people who had abortions were selfish and wrong, but I educated myself and realized that’s not the case and that women should get to decide what happens to their own fucking body!", "plasticxcandy": "❤️❤️❤️❤️❤️", "simon_isaac": "Someone said something like this above, but I used to think I could relate to the American POC experience as a Jewish immigrant.", "samanthahorn": "I’m still in the process of unlearning everything reform judaism (aka the “liberal” sect) taught me about Israel.", "ashley.fryer": "Reparations for black people would be divisive (I guess they're fine for everyone else?) It's the job of BIPOC to educate me for free. My body defines my worth and is a free topic of discussion. Wanting money and the comfort and security it provides is wrong and makes me or anyone else evil.", "nicenice11": "WHEW CHILE. The interracial relationship and black love one is tough because I didn’t want to make black ppl in interracial couples feel left out of black love but when I had a white partner in the past I wasn’t posting #blacklove with them bc I didn’t fr fr believe it counted. I wanted to think of it as if you’re black and in love it’s black love but really only if that love is helping you love yourself better but I still haven’t made up my mind on that. I used to think I could overcome racism by working really hard and curbing my emotions when talking to racists and homophobes. I also used to being thin was the same as being healthy.", "annabellemaginnismusic": "1. That Jewish people could not participate in Semitic erasure 2. That femme-presenting bodies are easier to have hook-ups/ something fleeting with than masc-presenting bodies 3. And that when I present femme I am less convincing/believable/seen than when I present masc", "jdesorcy": "1. Fat=unhealthy and ugly 2. Straight hair was the only good kind of hair 3. Because I have POC in my family I couldn’t be racist 4. I am defined by what I have These are biggest that I work very hard everyday on!", "esmarelda": "I definitely grew up with a white savior complex implicitly supported my my school and friends. It wasn’t until I was in high school and had a friend going on a mission trip to a country in Africa that I started to feel uncomfortable. I asked why they felt that they wanted to have anything to do with Jesus and what right they had to take away whatever religion (or lack thereof) they were born with- they just said because “Jesus said to spread the word”. I realized they were going to very resource and wealth poor areas and essentially demanding that they convert to Christianity to access the resources they brought with them - which is so disgusting to me. I continue to have these conversations with my friends who have never thought about this, I’m glad I can at least shed a little light and encourage them to look further into it and stop supporting programs and institutions that do this. I’m also recently learning about impact v intention- taking that journey with my mom who works with a gender non conforming person who prefers they/them pronouns and how her intention to not hurt them is not the same as ‘accidentally’ misgendering them because it’s ‘hard to change’. She’s improving!", "mel_brujaja": "That the police are generally good. Lord was I dumb/naive.", "iamemmajoyce": "Slowly unlearning that colonialism and colonisation aren't something that happened years ago but is an ongoing process embedded in ideas of white supremacy and the inferiority of indigenous peoples.", "therealmamaboo": "Attractive equals seductress which in turn equals no intelligence which equals useless.", "jessdavenportvalencia": "I pretty much had to unlearn 90% of what I was taught during my evangelical, conservative, very white childhood. Also- you're beautiful! I just got diagnosed with breast cancer. I'm making this photo my new life goal.", "musingsandmovement": "I believed that I wasn’t racist. I realized I just didn’t look deep enough. I believed I only loved men and realized true Love is about a soul love ...married a woman.", "therollingarmadillo": "I use to feel like other issues, (environmental issues, sustainability practices, progressive education reform, etc) and more broader, \"all-inclusive\" social movements (women's rights) were issues that should be considered a higher priority than social issues like racial equality or queer rights because those issues only apply to certain people. I also figured that the underlying cause of things like racism was money. So it's like, \"yes racism is bad and we should work to fix that, but instead of trying to fix this one issue, why not work on fixing bigger picture shit that way everyone benefits? and also, if the planet dies, then we won't be around to fix things like racism.\" I also use to think that focusing on racism only makes it worse.", "_clarkea": "I’ve unlearned so much and am so grateful for this post. Thank you. It’s powerful to see so many people acknowledge their past beliefs; I used to think I couldn’t be racist bc I was “the liberal one” in my family/friend group or bc racism meant acts taken out against individuals. Many others, but this is one I’ve been grappling with a lot lately.", "annabeth_with_the_bandwidth_": "@ihartericka there aren't enough words to share on the ways I learn from you. Thank you. #beaconoflight #shinebright💕", "chichakino": "01. Queerness is something that’s not only chosen but sinful as well (this is why classes on sexuality, gender & sexual orientation matter and should be taught in schools). 02. The USA is the greatest country in the world (LMAOOOO). 03. Because i’m American i have to follow American traditions like standing for the National Anthem, saying the Pledge of Allegiance, or even kiss America’s ass when people from other countries say we’re trash (as if they’re lying). 04. Being 1/28th or even 1/3rd Black doesn’t mean you’re black (to the nonblack folks with some Black ancestry that love to say the N word). 05. Beating your child for any wrong doings, especially the small kinds, is not a healthy way of correcting their wrongs and can actually have long lasting effects of trauma (the Black community loves to put this method on a pedestal). 06. You can only wear clothes, shoes, accessories & hairstyles, as well as use products that are made for your gender only and by doing otherwise means you want to be the opposite sex (i’m really glad i unlearned that). 07. White LGBTQ+ are less problematic than their cis-hetero counterparts (most of them are actually even more problematic). 08. Lightskin = weak, soft & darkskin = hard, strong. 09. Cis-hetero Black men that put the lives & rights of Black women & Black LGBTQ+ in jeopardy with their ignorance & dominance on a daily basis (i.e. Tariq Nasheed, R. Kelly, Chris Brown, etc.) they don’t need caping or saving from by us nor do we need to stand by them because we’re Black. period. 10. White women are less dangerous & toxic than white men because they’re women. 11. Church (primarily the Black church) is something the general public needs to attend; despite all the drama, religious politics, and molestation of women & children (i can talk to & be with God without others telling me i need to). 12. Young boys can’t be molested by older women because males are inherently supposed to be attracted to women, and if they’re molested by older men they’ll grow up to be gay. ____ i’m sure there’s more but that’s all i can think of so far lol", "ayochiirstiine": "I used to think that: 1) Being tired means being lazy. 2) Being Queer means you can’t like be girly. 3) Latinos can’t be anti-Black. 4) White allies will save us. 5) Non-Black POC from the hood can use the n-word. 6) Grades and hard work are everything and you don’t have to network or “know people.”", "knittingnicole": "1. That my interests(reading, knitting, comics, Harry Potter,) made me less black. 2. I was terrified of \"hood\" girls because I was bullied so badly in school. 3. Sexuality is a spectrum!!! 4. I'm not black enough because I don't like rap. 5. All black men need protecting, he who shall not be named proved that wrong. 6. I can be fat and healthy. 7. My sexual preference can determine my afterlife. 8. All black folks are Baptist!😂😂😂", "fringeish": "I thought we had to \"ignore\" race to get past it, rather than acknowledging and dismantling Institutional racism and inherited privilege. I thought i was fat because i didn't try hard enough, and was inherently less than thin people. (Just a couple, still ripping apart my doxa.)", "hayleywilliams42": "you are so cool. everything you say is so astounding. u da best. ✊🏾", "begoodkarma": "So much. A few “easy” ones. 1. Body hair is yours and doesn’t need to be disposed of (unless you Want to). 2. Queer folks are still worthy of being loved by “G-d”. 3. Christianity ain’t all it’s cracked up to be, but it’s okay to be accepting of believers; and if you distance yourself from it, you’ll still be okay. 4. Elite or exclusive spaces (in pretty much all arenas), are inherently violent.", "aladynamedjune": "I can’t specifically remember my parents *directly* teaching me or my sisters racist proclivities. I do, however, distinctly remember overhearing racist thoughts in their conversations, the conversations of other white people, and from my teachers/friends. I remember the first time I heard my mom say the n-word, and me and my sisters were like legitimately shocked. I was 18-years-old when that happened. That’s when I reeeeeally learned that my parents were racist, and that even though I am incredibly open-minded, I am still part of the problem.  I have unlearned that racism has to be obvious to be racism or to be hurtful. I have unlearned that racism requires direct teachings to be racism, but that it can happen in an indirect way.", "knock_a_momma": "I just love you. You’ve helped me stop being apologetic in spaces for simply being a fat femme. I teach better (I’m a sex educator too!) hell I love my man better after listening to Eb tell his story I learned a little more about how to love my Stella and his changes. Thank you for existing. The world doesn’t deserve a woman like you but thank the Goddess for favoriting us and placing you here on Earth ❤️❤️❤️❤️", "eyeslikeabat": "I love that you were willing to share this list with us. I think acknowledging things we believed in the past but not anymore is a great way to try and understand how others think and how we can get through to them. False thoughts I have unlearned: Being gay is scary and somewhat of a choice (I'm not sure what I thought exactly), I am not judgemental (I am much more self aware and try to call myself out now), and that coming out as gender fluid would be bad for my family so I shouldn't do it. Those are what comes to mind ATM, but I'm sure there are many more.", "jcorwin12": "I used to think that I wasn’t part of the problem because I didn’t do “racist” things. I used to think racism was overt. I used to have no understanding of white privilege and how it benefits me everyday.", "bcdiamante": "Being confident is being stuck up and too in love with yourself. I’m in Australia. That narrative has caused myself and others here to repress our natural rawness and has bred the rampant tall poppy syndrome.", "mc_esther_machangu": "👏👏👏👏", "blackvelvetwinks": "There she goes ❤️🤗😍", "orothschild": "I used to think good intentions where enough. Feels very silly to think now.", "jendomski": "Love that swimsuit!! 😻🌸🌼🌺💖", "finalmile.ink": "I love your photo and courageous words. I'm in the areola & nipple business & a leader in perfect color matching for my African American clients! I'm also a member of the #metoo movement and have written some stories of my own sexual trauma from a little white girls perspective treated like a slave in a fascist sadistic Italian catholic abusive childhood. I have nothing but respect for your fight as you have lived it. I created an entire collection of 15 paintings depicting black skin & white skin co- existing- check it out (I opened this show in NYC exhibited in Chelsea, Amsterdam Whitney Gallery, Monaco French Riviera, etc) #painterofpeopledotcom click on Comfortable in my Skin a sign of our times. More power to you! Cathi Locati 914-659-7777", "ajpeabody": "Lately it feels like everything is ALL a lie. You start to see the cracks in the narratives you’ve been taught and if you follow the crack it leads to another and another. It’s mind boggling. It feels gross to know that I have participated and benefitted from it. I’m working on finding the language to have open conversations with those who are still unaware.", "ebony4georgia": "Oooooo girl, it’s like you were reading my younger mind when you wrote this", "thenerdforum": "1. Believing that “colorblindness” was the key to solving racism. That just treating everyone the same would create peace and equity. 2. That people who are homeless could have kept themselves from being homeless and made poor decisions and are living with those consequences. 3. That anyone can go to college if they just try hard enough. 4. That sex work is dirty and only performed by women who’ve given up on themselves. Hoo boy. So many more.", "schlemmee": "* That spaces exclusively for bipoc were racist/ were diving is more. * Currently learning to quietly give up space and that my voice and background are already well represented. * Unlearning the idea that democrats and liberals are going to look out for marginalized communities.", "sheedaaaaaaaxo": "I'm gonna use this as a writing prompt, thank you!", "tigredelsol": "1. That my Native heritage/culture/religion was something to be embarrassed of and keep private. 2. That because I was mixed I didn't benefit from white privilege or my proximity to it. 3. Because I'm mixed and have many POC friends I didn't have internalized racism. 4. Not understanding systemic racsim and that I do in fact benefit from it. 5. People weren't fetishizing me because of my Native or Asian heritage, I was just that damn attractive and interesting to them.", "rayrulrocks": "1. I did not think I could be racist, because I would call out my parents racist remarks. I thought that was enough. 2. Fairness and justice are common. 3. Being a democrat means you’re part of the solution rather than the problem. 4. More people benefit from capitalism than are hurt by it. 5. My sexuality and gender were for other people to judge and consume", "cutebuttired": "1. Voting is a means of real, tangible change. 2. Losing weight and not being perceived as fat will make me happy. 3. Saying POC in place of issues that affect black people on a larger scale is intersectional.", "legrissfox": "Ive had to unlearn or unhook the long reaching fingers of white supremacy. Its finger prints can be found in the idea of beauty. The idea of success. The idea of peace. The idea of violence. The idea of justice. Sexuality, gender and politics, etc. What I knew about these subjects was what I was regurgitated from the white agenda. I'm questioning everything (and it's not just bcos I'm an Aquarius) and what I feel about it and why do I feel the way I do about it. Decolonizing my mind has been a conscious effort to rid false & violent European imperialist veils that are used to cloud ones judgement and keep you complacent and controlled. Also I had to relearn that my anger is gift.", "amy.smiles": "I believed racism was only overt out there hatred of another race. The term micro-aggression was so far from my radar.", "more.saffron": "wow #4 is very powerful to me, thank you ❤️", "_acceb___": "1. So definitely that part about fat=unhealthy! And 2. That I'm was a bad person if I wasn't vegetarian or vegan (which I still tend to do at times. And 3. That white washed history classes and text books in school really examined and spoke truthfully on slavery", "nora__klein": "This is so gorgeous. Humanity shines from this photo like glistening water ✨", "argosxiii": "1)I believed that the US was a welcoming place and anyone can immigrate legally if they just tried. 2) Ironically, in high school I found out I was undocumented. I thought my struggles as a white undocumented Mexican were similar to those of brown and black undocumented immigrants. 3) That speaking spanglish or pocha spanish means you're uneducated or just not trying hard enough. 4) I thought I couldn't be racist against other Mexicans because \"todos somos Mexicanos\" (we're all Mexican) but I've learned that that's just the white Mexican version of \"I'm colorblind\" and people use it to either excuse their racism, or to claim space on stolen land.", "eccentricjukebox": "I didn't think racism was over but I DID think it was limited to a few isolated assholes... boy how the last couple of years have taught me how wrong I was about that. Also because I was \"colourblind\" I wasn't racist, thankful that someone took time to explain to me why that very term is violent to POC...", "realplastictrees": "In high school, I believed that affirmative action was overall negative for people who benefit from it because I thought it made them insecure about their merits and abilities. Not realizing of course that the main beneficiaries of affirmative action are white women, and you never hear this narrative attached to them. I also didn’t know and understand my caste (Brahmin), religion (Hindu), and nationality (Indian) privilege within the context of South Asia and the diaspora. Unlearning Islamophobia continues to be something I work on constantly (all of this is honestly).", "lovethyself365": "💛💛💛💛💛", "kill2birdswith1maddystone": "1) Trans folks must want to switch to the “opposite” gender and completely pass as that gender 2)being democratic/liberal/on the left meant you were “better” at social issues than others and more morally correct 3) racism is words and singular actions that only happens in less diverse places 4) apologizing for what white people have done in the past or recently is meaningful, useful, or absolves me of any ways I have I harmed POC 5) that I can’t be queer if I have only had relationships with men 6) that western women’s liberation movements of the past were for all women 7) I am not a bad or mean person for expressing when I’ve been hurt or angered and neither are other people~ that it’s not immature or mean especially for POC and other marginalized communities I’m not a part of to express their anger to me (it will actually help me learn and do better) 8) the body positivity movement has many faults, chiefly in taking from fat women’s contributions and then excluding them 9) fat = poor health or poor choices 10) that just because I have learned about something doesn’t mean the work is done~ I have to keep checking myself and my language and actions that I’m am actively unlearning it and removing that bias from my presence in the world as well as actively fighting it in the world to the best of my ability 11) POC in “third world countries” need and appreciate volunteers from US (thank you @nowhitesaviors !) 12) there’s something inherently good or righteous about American democracy and it really does serve all people 13) there’s so many more but I’m grateful to all the wonderful educators like you @ihartericka for helping me learn and unlearn despite the emotional and often physical toll!", "irisvonk": "1. You can only go to therapy when you have big (life-threatening) mental issues. 2. I need to be able to take care of myself at all times, I cannot accept help from loved ones. 3. Thinking I am anti-racist as a white person makes me automatically a supporter of POC. 4. I live in a very accepting country, therefore I don't have white privilege. Boi was I wrong.", "smarvelous.wanderful": "👏🏾👏🏾👏🏾 I always have people arguing with me or trying to compare pain along the line of 8. BUT I do think being Black prepared me for the otherness I experience now that I know I’m queer. I explain it this way when they start w/me: I feel others by both parts of me and I worry, but I have never feared for my life/safety/future/livelihood because I was queer while I regularly fear for those things because I am Black. My false thoughts: 1) there are white people who are unaffected and/or divested from racism/antiblackness 2) being non/Black POC/Immigrant/Jewish/Muslim is equivalent to being Black because of how we’re treated 3) other countries have a better handle of racism and race relations than the US and we need to follow suit 4) racism will eventually fade away with time 5) the work of the civil rights movement and work done in the 60s and 70s was complete and it’s time to work on other issues", "sitasaxe": "Mine is that because I grew up very open-minded in a different country and have been of the opinion that I didn’t inherit a lot of racist beliefs that I could ignore the racial tension in this country and feel separate from it. Then when POC expressed anger towards me I felt shocked and victimized because I wasn’t one of “those” Americans. I’ve been learning to respect that anger and that because I live here and have white skin I’m part of the dynamic and I need to educate myself.", "yamalo17": "1. Fat = unhealthy/bad & equating it with morality; 2. Abortion was murder(ahhh what growing up in a church does to you); 3. Women should dress modestly & if they don’t it speaks of their morality; 4. Anything sexual is bad & not spoken of; 5. That I had to make my blackness palatable for white people; 6. Prisons are good for everyone; 7. I shouldn’t speak my mind because it might cause someone harm even if they harmed me with their racism, fatphobia,etc. I’m sure I have others. Thank you for this. Being vulnerable is something I’m working on more & more.", "colt_lightning": "\"I have black friends so I'm obviously not racist\"", "jjaredzz": "I had to work and unlearn my hiv+ phobia.", "bigbadbanshee": "❤️❤️❤️", "kdubrall": "Golly I love this place 💜", "leah_abraham": "1. Growing up in poverty meant I didn’t have white privilege 2. Being sexually molested meant I was psychologically damaged 2. Marrying an immigrant POC meant I couldn’t possibly be racist 3. Having a bi-racial child meant I understood racism and discrimination (nothing was more hurtful then when other mom’s used to ask me how long I’d been nannying for him but it’s still not the same thing) 4. Wanting monogamy over polyamory made me selfish, closed-minded and sexually unenlightened (I totally get poly and I know why it works for people, it just didn’t ‘feel’ good for me and that’s ok, I’m not prude for liking monogamy and liking poly doesn’t make you a slut) Thank you so much for starting this conversation because there are a lot of things I think or thought were true and am still unlearning, the more I read and see and experience the more I can learn empathize because I know as a cis het women I’ll never fully understand how it feels but I can be a more educated ally.", "krysmelnyk": "Oh man. A highschool lesson from a gay friend - bisexuality doesnt exist, you’re either gay or straight or confused about either. What I would do to go back and teach them.", "clever_grrl": "1) That gender and sexuality are binary. 2) That because I was not alive for slavery or segregation that I was not complicit in the ongoing systemic and individual racism faced by POC. I am learning how to examine my own thoughts, acts, and expressions by asking and listening to others rather than defending myself.", "cosa.rongway": "We’re the ones who don’t take off our shoes inside 🙊", "jmariegray": "I have unlearned so much just by being here, even if it's not specific facts and just unlearning that feeling of white fragility and defensiveness. I've also learned to consciously buy from black small business owners. love your work on all fronts.", "queeennatasha": "❤️", "lisasciandra": "Fat people don't deserve love and sex.", "xcarolynnn": "that my allyship granted me access into spaces that are not meant for me and that the best thing you can do to combat racism is “not see color.” growing up in “liberal” white suburbia, this was our community’s collective consciousness. little did i know my belief in both of these false truths caused me to perpetuate harm. i’ll never be done unlearning. thank you for your vulnerability and your work ❤️", "pepper__annie": "treating POC with extra respect and love and support made me worthy of praise.", "lisetteirene": "That If things make other people uncomfortable we should stay silent so as to not upset them - I’ve learned there are many ways to directly address issues that are appropriate and if the person is upset that’s on them", "julia_montminy1": "I've unlearned that and I'm now lesbo AF!", "croyster912": "Fat = unhealthy. Just because im black i don't have some privileges. I didn't need to unpack my own shit about sexuality", "indigo0o0o0o": "“I don’t see color” 🤦🏼‍♀️", "therealkellyfernandes": "#9 was a big one for me. So I lost a ton of weight and ended up being unhealthy in mind. I’ve all the weight I had lost. Funny thing, my health vitals have all stayed the same and I’m mentally healthy! P.S. so glad I found you!", "surmitch": "Coming from a very rich and very white DC suburb, it was sorta default that good grades and “being articulate” and Abercrombie & Fitch clothing was “white” and so black girls in my school who wore these clothes and were in my AP classes were “basically white” and “the whitest black girls we knew” 🤦‍♀️🤦‍♀️🤦‍♀️ these were of course meant as compliments. It took until college to really see this for the anti-blackness and racism it is. And how my white-centered upbringing made me center everything as its relativity to me (and my whiteness.)", "latinavegana": "That my brown skin and eyes, and curly hair were ugly. And if I just straighten my hair, wear colored contacts and not go in the sun too much, I would be prettier.", "lobell888": "I used to think I was a “good white person” for just acknowledging racism existed. Unlearning this every day.", "other_surrealities": "I was raised conservative and Catholic, so I'd have to write a book to cover it all. I only stopped being homophobic when I realized ALL of my friends were gay. A year later, one of them lay on top of me and I realized I was in love with her🤷🏽‍♂ I didn't even know what trans meant and when it was explained to me,I was like...that's me and figured out why I used to stuff rolled up socks in my underwear during games of dress up as a kid.", "vanessadeleaux": "Wow great list! 1-I used to think Canada wasn’t that racist 2-I used to think because I’m the mother of a black child I couldn’t be racist 3-I thought that if I appreciated other cultures and rituals I could colonize them or I was too ignorant to even know it was colonization 5-If I make myself the smallest and least demanding possible the people who love me will notice and appreciate it and stop taking me for granted", "nimbleonion": "That you should retain relationships with family members no matter how destructive they are", "scorpion_rising": "That skepticism/second guessing black peoples experiences wasn’t racism .", "janefriday": "Old falsies huh? Oh God, here we motherfucking go. Let’s just stick to 10, cause there are so many. 1. That it was totally fine to use AAVE. Even though I’m a white woman. 2. That mainstream feminism was the best thing ever (didn’t know about white feminism AT ALL) 3. That what was in all the school history books was true and comprehensive. 4. That white supremacy only applied to nazis and klan members, not our entire society and me as a white member. 5. That prisons were just and everyone inside deserved to be there. 6. (Got this one smashed only last year) That because my family wasn’t here during slavery and that I’m only 3rd gen, I was off the hook with paying reparations. 7. That saying “Latin men don’t mind that I’m fat, they like it,” is a super racist statement. 8. That white women weren’t dangerous, only white men. 9. That you were only racist if you hated POC. 10. That straight, gay, and bisexual were the only options that existed; that you were either male or female. (Facts & terms I’d never heard of: White feminism, cultural appropriation, micro aggressions, the rainbow of various identities/fluidities/sexualities/pronouns/asexualities that exist, representation, ablism)", "trans__mutation": "1. That trying to find ways to include Black folks and POC into white spaces was radical/anti-racist/\"inclusive\". 2. On that note, that words like \"inclusive\" and \"diverse\" are what we should even be striving for in the first place, instead of the truth that all of this just further centers white people. 3. Surprised when people who don't look punk, or like an anarchist, have an analysis of isms. 4. That I couldn't be trans cause I didn't \"know it since I was born\". 5. That unless you're dating someone with the same amalgamation of primary and secondary sex characteristics, you aren't actually queer. . Side note: I just wanna say you're a gem and I appreciate the hell outta you.", "casa_blancaaa": "Things I used to believe: 1. That I was wrong for not hating myself because I am Hispanic 2. That I wasn’t a good enough latinx because my skin wasn’t dark enough or I wasn’t fluent in Spanish 3. I felt wrong for liking men and women because where I grew up it was a “sin” and you were going to hell for it! (Crazy ass Christians!) 4. I believed then when they told me I was a dirty wet back, Beaner, that I needed to “go back where I came from” even though I was born here but my father wasn’t. 5. I believed that I would never find my place in this country being a mixed person of Latin decent. BUT I am unlearning all of these things and speaking out against them every chance I get! Not just for me, but for any person(s) who have been made to feel lesser than. Fuck that noise!", "wahito83": "Only non black people practice anti-black, neo-colonialism. My African parents practically epitomized the white moderate: relaxers on toddlers, excluded the 1st generation from learning their own culture/language, questioned the humanity of friends who spoke AAVE, raising black children in former sundown towns where seeing their reflection is few and far between...", "manicpixiedream13itch": "That there is a “correct” way to speak english", "thatssobundy": "Unlearning Black women/ men are baby factories. Infertility/therapy/anxiety are “White people” problems", "shellysellsseashells6": "Thank you for sharing your previously held belief that “sexual molestation causes queerness.” I held this belief for a long time in regards to my own queerness as well, and believed it invalidated me being queer.", "brianajacosta": "I grew up thinking racism didn’t affect me but when I was a teenage that my experiences where different from others but I didn’t believe that race was the issue but now I know. I’m still unlearning", "justzeemsw": "That it was my responsibility and “duty” to educate “well meaning” white people about racism. Every time. Over and over again. ☕️", "molly_be": "That “ghetto” was an adjective. That throwing up gang signs with my white friends was cute and funny. that it’s rude to correct someone when they misgender a person who isn’t present in the conversation. that black strangers might give a shit that I like their hair. that liberals are going to save us. that it’s ok to call the cops.", "esmeadunne": "I can’t make a difference; I have to be skinny to be happy or good at anything; I’m ‘bossy’ (you wouldn’t think so if I was a boy); my anxiety makes me weak", "ksshesaid": "That intent > impact. That skinny = happy and if I could just lose another 10lbs my problems will disappear. That certain experiences are unavailable to me due to my size. That I was the only woman in my circle of friends who had been sexually abused (I was floored when I learned that ALL of my friends had experienced abuse or harassment of some sort). It took longer to understand that I didn’t deserve my abuse or that I am allowed to acknowledge my trauma without the caveat of “but someone else had it worse”.", "ohheyheath": "That because I knew racism was wrong it somehow absolved me of racist thoughts, notions, and ideals that I was raised and comfortable with (constantly unlearning)", "delightly": "Used to believe bc I grew up well-off and with one white parent, I could not be impacted by racism & if ppl treated me badly, it had to be bc I was unlikeable. Used to believe my bisexuality wasn’t real and I was either gay or straight depending on my partner’s gender. Used to believe gender and sex were binary. Glad I have grown up & recognize there’s always things to learn (and unlearn)", "imetgodsheblack": "Such an intro!!!", "milica_soric": "❤️i thought that my mental illness symptoms were my fault/a problem with me as a person and believed i deserved to be ostracised as a child for acting ‘weird’.❤️ i thought embracing my sexuality would be beneficial and empowering and not exploited and manipulated by the men around me. ❤️i used to think that hijabs and other traditional religious dress (as well as the concept of religion in general) were oppressive. i don’t remember who educated me, i think it was a friend but whoever it was i’m forever grateful bc i now know better and can be a better ally as well as being agnostic and working on figuring out my own beliefs.", "dai_anotherday": "Have you talked about interracial relationships with white folks not being Black love on your podcast? Would love to hear more about that. Thanks!", "josephinecurates": "You are so gorgeous I can’t even ❤️", "mafo6617": "That being nice and trying to help other white people to be nice, will make racism go away.", "bella.milroy": "That the language that black people in particular and other marginalised groups have to use when affronted with their own oppression should be palatable to white-cis patriarchy. 😣 Thought your stories talking about non-violence the other day were amazing thank you! Can you comment further on number 8? I often find myself thinking about comparisons of disabled bodies and queer bodies (as a disabled person myself) but as cis-white I never want to claim expertise.", "mariescalendar": "Thinness and attractiveness = value. My body has also changed a lot since mastectomies and other cancer-related surgeries, so it’s been tough m, but I’m working on it!! Following you helps! ❤️ @ihartericka", "kalealealea": "Here👏🏾 for👏🏾 this👏🏾 growth👏🏾", "xxiixc_": "Bella ❤️", "m2__r2": "1. Working for a nonprofit was more virtuous, contributing to more good in the world, and overall less problematic than those sellouts in corporate America 2. working “with” communities of color in the US was less problematic than me working internationally 3. Public health (my profession) was less harmful and less racist than medicine 🙈😳🤦‍♀️🙅‍♀️", "jewelyeehaw": "i used to believe that fat=unhealthy. my parents never raised me to believe that, but every weight loss commercial and bandwagon saying that fat was bad worked it’s way into my brain. i unlearned all of that about 2 years ago, and i’m still educating myself to be the best i can be :)", "moxie.michelle": "I used to believe that abortion was murder and that there is a grey-bearded jealous old white man in the sky controlling things and punishing people (taught by family). I also believed I was worthless and a nuisance and unlovable. Also taught by family.", "dawnjoon": "I’ve been living in the US for around 7 years, so I had so many preconceived notions of this place that were wrong: 1) If you work hand enough, you’ll make it 2) The system does its best to be fair and just (this was a rude awakening) 3) My self worth is based on what I produce for society and my life needs to revolve around working (still struggle with undoing this thought) 4) Checks and balances works effectively enough (noooope) 5) Capitalism is imperfect but the best option 6) Liberalism will save us 7) The gender binary 8) Fat = unhealthy 9) Colonialism is a thing of the past 10) Higher education is a must ... Gosh, I’ve had to unlearn so much. Our education systems and media are atrocious. Thank you for being you, Ericka.", "brooke.gillon": "I would have to second your whole list, but coming from white & class privilege in the south, there is sooooo much to unlearn... 1.Loving my black friends somehow exempted me from white supremacy 2.Racism is a southern thing that we (southern whites) need to work on 3.The election of Obama meant we were a less racist America 4.lets not forget, white ppl were also slaves (ugh) 5.not talking about whiteness & blackness in our home, or being “colorblind” would somehow set my kids up to be better ancestors 🧐 Thank you for sharing this & for always pushing us to be better humans ❤️", "yogawithelyza": "I used to think that because my boyfriend was black, I couldn’t be racist. I used to think that POC were being “racist” towards me because I received so much push back for dating a POC, which made the first “used to” null and void. I used to think that it mattered more to keep quiet on my social media about white supremacy because my career depends on my image. I DIDN’T used to think that I was a part of the problem. Now I know better, and I’m doing my best to take action every day to acknowledge my wrongdoings and use my privilege FOR something instead of just FOR myself.", "carliiinn": "❤️", "kathrynlstamm": "That Asian people are not oppressed and that the model minority myth isn’t racist. That being biracial makes me not a person of color. That (white) feminism is faultless and inclusive.", "permasamra": "1. That straight white women care about all women and marginalized people because they could inherently empathize as a marginalized person themselves. 2. That people can’t change 3. That police protect all individuals regardless of privilege 4. That public property wasn’t stolen land 5. That I “attract” emotional unavailable people 6. That individual actions like eating vegan and organic (if everyone would just do it, regardless of cultural, health and personal preferences and income) would be enough to save the planet 7. That have the same privileges as white straight cis men is equality, desirable or fair. 8. Fat=unhealthy and a fault of personal choices 9. Mental illness makes me undateable, lovable, employable and friendable 10. That I should just stay in the career I was *good* at because of $ security even though it wasn’t satisfying to my soul 11. That I need to forgive and forget people to get over harm done by them", "thebeautifulbanker": "Being fat is a character flaw, or some kind of moral failing, and that the pursuit of thinness is as important as other major life pursuits (career, family, etc.).", "scomiesnackysnacks": "1. I'm queer so I can’t be racist 2. I’m Mexican so I can’t be racist 3. I’m Mexican so I can’t have white privilege", "hannah.gundi": "Hey Ericka! I’ve been around for awhile but I love this post. As a white cis straight sized woman (lord the privilege) I am still trying to unlearn so much and your list looks similar to mine! This gives me hope that some of the ideas I still have can continue to be i unlearned and reversed with education and checking myself. Some more things I’ve unlearned: Black people don’t have justification to hate white ppl as a whole, fatphobia is justified bc of the “obesity epidemic” (or any reason), and that I should use my privilege to speak FOR people (rather than helping to give them the space to speak for themselves). Also that if you preach about intersectionality it automatically makes you intersectional regardless of your harmful actions. Still working every day to make sure my words and actions line up! Thank you for the work you do- hopefully I’ll be able to pay up when I’m out of school.", "ihartericka\nVerified": "Verified", "c.d.r.e.a.m": "Ahhhh love this photo! ❤️🔥", "keeproamingadventureco": "As a white woman and social justice warrior I have not contributed to the systemic issues of racism, and myself have not ever been racist. So, so wrong.", "yes.i.died.in.7": "That pale skin and a pointy nose was the peak of beauty, that darker skin = uglier, that gay people were all the stereotypical caricatures I’ve seen in the media, that being gay was a sin and something to be ashamed of, that being ‘promiscuous’ was disgraceful, that if you were sexually assaulted you must’ve deserved it in some way, that femininity was disgraceful, that I can’t be racist because I’m POC, can’t be LGBTphobic because I’m LGBT, that because I’m a POC I’m not appropriative of other cultures (this in turn made me not speak up when my own culture was being commodified and appropriated by other non-Asians) Honestly, I grew up problematic, there’s probably more that I did I might’ve forgotten now, but I’m glad to have willingly undergone the process of being more informed and unlearning these admittedly repulsive ideas and biases I grew up on", "christannchanell": "1. That if I played by the rules, I’d win. 2. That if I listened to what men said, I’d be safe. 3. That men protect women 4. That as a queer black woman who is still figuring it out, I have to be quiet about issues affecting my ethnic group", "_blu3m": "I used to think misogyny only existed in the US in the form of sexual assault, but as I’ve grown and learned I see more and more ways in which femmes are treated worse than masc people. Even in the smallest actions, it’s everywhere I just had to learn to recognize it. And in turn recognizing the smaller scale presentations of misogyny got me to think about the smaller scale presentations of racism, homophobia, transphobia, etc.", "mar_con_el": "unlearning my \"not all white ppl\"/\"😢but im one of the good ones\" response...its so much deeper (complicity, silence, exceptionalism, etc) and that type of thinking only serves to center my lil feelings and not those harmed. and who does that help when its systemic anyways?🦋", "circumspectacles": "Thank you for the work you do <3", "duh_ree_ann": "This post, caption & comments 💕 @lalayurworld @branmarie_ @ratchetmomo @no_itsnesh", "knowyourgirls\nVerified": "Verified", "_jeanettegenson": "That because I believed I wasn’t racist, that I wasn’t. Untrue. In my learnings and experience, it seems to me that white people are born inherently racist, and that we have to actively practice, learn, and admit to these faults to begin growing out of these habits.", "iixxguise": "1. Just because I’ve only been one woman doesn’t make me less queer. 2. I’m still black even though I don’t code switch or only listen to hip-hop and rap.", "adriannatthomas": "Other peoples’ opinions of me matter", "saila.anitta": "Not exercising and giving everything 100% is just an excuse for the lazy. This drove me to serious mental health issues. I refuse to call myself fat anymore. I am curvy and I have to try to love me regardless.  Also I am from Finland and I always hear about how well things are in here. It’s an excuse used when someone brings up racism in our society to distract from its reality. I am certain that excluding names from job applications would give us so much more welcome diversity, expertise and employing people based on their skills and not the notion of what their ancestry might be (or other deep rooted prejudist views)", "carcar619": "Love ❤️❤️❤️", "_lady_light_": "I used to think I was a dirty Indian. I'm not. It's hard.", "lexxsexdoc": "G saw this picture and said BOOBS! 🤣", "mimseygrl": "That racism=bigotry, that being in a relationship with a black man made me more woke, that my liberal parents taught me how not to be racist or prejudiced, that being a “fag hag” was something to be, that acceptance was what I should endeavor to be with those whom I “othered”. That being a Jew gave me a “minority pass”. It seems as I write one another pops up. My only hope is that “We who believe in dressing cannot rest....young people come first they have a courage where we fail.” Ella’s Song, Sweet Honey in the Rock, Dr B Reagon lyrics). I’m no longer one of the young people, and still I cannot rest.", "maenadphyskoa": "Thank you for continuing to teach me about the lgbtq+ community. I'm always trying to be the best supporter I can be.", "etothecgirl": "Oh number 10 is huge......I still hear white people spouting this crap. So ignorant. Before I learned about how systems were set up by whites to ACTIVELY keep black people down in every possible way, I thought that people just needed to work hard and they would have equal opportunities, no matter their color.", "britelitedyed": "That we are all treated equally by those in power.", "keilyw": "So many but the one that was the most painful lesson for me was thinking that representation wasn’t that important. Thinking that loving my kids (3 biracial girls) and telling them they are strong and beautiful and enough would compensate for the lack of representation.", "nadya426": "I used to think it was important that I accumulate space and power because I'm a woman (who is almost always the only woman in the room at work). But I learned that it's more important I learn to cede space and power because I'm white. I say \"cede\" in no reference to the positioning of BIPOC, but only in reference to my own positioning. I think too often white people want to focus on how we can save people we imagine are less fortunate than we are or how we can cleanse our intentions to be more impeccable and just. But actually what is needed is an interrogation of where our own wealth and power come from and how to stop hoarding. No matter how little wealth and power we think we have we can all do this work. Sometimes it's learning not to have a response about everything. Sometimes it's finding a million dollars to build anti-gentrification condos in Oakland. Anyone got an extra million lying around?", "earthtone27": "Things I believed in the past: 1.Homosexuality was “unnatural.”I later learned, and still learning, the many ways sexuality presents in primates (that includes humans). #AnthropologyMajor 2.As a child of Black Immigrants, I was taught/believed that Black Americans weren’t taking enough advantage of opportunities in the U.S. 3.Knowing better automatically meant doing better. 4.Used the terms: Hueman, Wombman, overstand, and other Hotep accessories. 5.Prisons are necessary. So glad to be wiser and in the continuous process of unlearning “norms” that promote oppression.", "dopalicious_angel": "That all racist acts are blatant, direct and hurt deeply in the moment.", "mandycunzy": "💛", "bethannnelson": "So many things. 1) America is the best country in the world 2) Virginity was a thing and losing it before marriage made me a bad person 3) that I didn’t internalize any racist, mysogynist, sexist ideology from society 4) if I didn’t find my way to organized religion I’d go to hell, just to name a few. The past few years have been a lot of self work.", "hello_its_crystal": "I grew up constantly hearing 1. Black people live in dirty homes. 2. No one that is alive was even a slave, they all think we owe them something. 3. They don’t wash their hair, their pillow cases are dirty. UNLEARING THIS IS MY LIFES WORK! It brings tears to my eyes to think about teaching a child these things.", "domo_osso": "That my struggles as an immigrant were the same as immigrants who were POC. I believed this for a long time. Until I got called out for white privilege. And I realized, that DUH, without an accent, with white skin, and with full assimilation, I just became another white American girl, no mater what my struggles USED to be. It was eye opening, much needed, and I am forever grateful for my friend for holding me accountable. Immigrants have very VERY different struggles depending on their skin color, AND country of origin. And this is SO important to realize and call out.", "breathingviolinist": "Things I was wrong about: abortion should not be legal and that it was morally wrong. That being a certain religion was the only way to be happy and everyone else was a potential convert waiting to be saved. That gender was binary. That all people in the military were dicks. That capitalism was good. That women’s bodies should be covered. That monogamy was essential to happiness. That my opinion about rampant racism as a mom of black kids was as important as my kids’ own experiences. A hot fat no to all of those. We learn and we grow.", "kass.erole": "I had to learn growing up that being a darker skin complexion compared to those with lighter skin does not make me ugly!! The melanin will always be popping!!", "troy.rockett": "1. Penetrative sex is more valid, holds more importance 2. Personal worth is tied to net worth. 3. Black people will become extinct. 4. We as a people will lose. 5. My black community and black communities are inherently homophobic. 6. Monogamous relationships are more valid. 7. Poverty is a choice. 8. Anti-black beauty standards. - probably had something to do with being in predominantly white spaces in college and grad school. Those institutions almost killed me.", "cleopatravesty": "1. That my queerness was unblack. After a german friend introduced me to his friend, this friend said in German, \"he's a Nigger and gay? \". I laughed nervously, too shocked to have a reply. 2. Because of racial classification in South Africa, being coloured meant that I wasn't really black. I realised early that I had to unlearn this colonialist way of thinking. I am proudly black and queer. 🖤", "mekdibaby": "That we live in a colorblind society and that black/latinx people don't work as hard as white people. That there is something embarrassing about not being able to speak proper English. Also the assumption that most people are straight.", "mechanikaa": "One of the hardest things I’ve had to unlearn is that a lack of direct sexual or physical abuse doesn’t cause trauma. Growing up in a household where it happens causes trauma. I will be unlearning my internalized misogyny and unbuilding my harmful defences for years to come.", "kkmiceli": "❤️", "jules_theliftinglobster": "I also used to believe fat=unhealthy and I believed that veganism was equated with morality.", "kaytastropheeee": "1) I/my parents/grandparents didn’t partake in slavery therefore i don’t owe reparations 2) everything I’ve learned about the idea of virginity", "rachelkaffenberger": "That biological sex and gender were the same thing and you were just ‘born that way’ so you must ‘be that way’. Also that the above was a mental illness and it totally is NOT. Having a non-binary them/they child has been illuminating!", "yveelicious": "Black is ugly Black people are sexually promiscuous Black people are angry never assertive. Black don’t crack (there maybe no wrinkles on this 60 year old black woman - but have had to deal with actually deal with racism", "briennemartin": "It’s my job to “save” POC. And by doing so, I wasn’t racist.", "pewee.douglas": "I unlearned #8 many years ago. It was a rude awakening to say the least.", "raesock": "The Bible is true in every passage and was literally written by god.", "mahdame_self": "Thank you SO much for your transparency and sharing your former “truths.” I’ve been following you for a few months now and wondering: how TF did she get here and how many gottdamn more books and articles do I need to read to get there?!? 😩😂 Seeing how your understanding and progression went... Phew chil I can STILL be saved. Amen😅🙏🏾 I used to agree with 9 out of 10 of these!", "lenab83": "1 being raised by racist people/family hadn’t affected me. 2 if I followed the social rules I’d be equal to men. 💪🏾 3 Black people just wanted a hand out and weren’t really trying. 🤦🏻‍♀️🤦🏻‍♀️ 4 If I argued enough with my family i could convince them how wrong they were. So thankful for you and others and your feeds. Thanks @ihartericka", "stephanie.m.pratt": "1. Poc could be racist against white people. 2. I had a pretty hardcore white savoir complex before 3. Black men are innately dangerous 4. I'm just as oppressed as a woman. The self awareness part was the hardest, (white fragility) but centering all my thoughts on ME was the problem!", "saraaborden": "Your fourth point is one I believed as a young person and which impacted me greatly; I've mostly overcome it, but it is a fear that still creeps up on me sometimes when I think about telling certain people of my sexuality.", "kadydid_87": "1. Thinking self-identification as non-racist and an ally is enough/that it makes it true/that it absolves you of any unintentional harm/that intention is all that matters 2. Thinking non-racism and anti-racism are the same 3. Thinking racists are only old white people instead of understanding and working to unlearn my own racism/thinking we can hunker down and wait for the old people to die out and everything will be ok", "heatherrmanley": "That by speaking out against racism I was doing the “right” thing when I was really silencing POC.", "stacks330": "🙏🏾 I admire your strength so much it keeps me pushing in life. Thank you so much", "chocolatebarbri": "That I owe men a got👏🏾damn👏🏾thing👏🏾. That if you are surrounded by women in your family, daughters, wives, sisters, mamas, and you can’t still be a misogynistic piece of shit. That “blood is thicker than water,” and you have to tolerate someone’s harm because they are related to you. That I need to explain *anything* about my blackness to white people. That white fragility is my problem. That I need to shape shift to make white people comfortable.", "houlenic42": "1. My allyship warrented me access to safe spaces (I’ve since realized that these spaces helped me come to terms with my own sexuality, but at the time it felt like a strange mix of learning and forcing myself into the space).", "roam_roam_honeycomb": "Because I grew up with and was highly invested//involved in the lives of many black friends around me I knew something of the Black experience... I’m still unlearning this and breaking it apart!! Took a while just to realize I can never claim understanding of this experience and why. Trying to unlearn//re-examine//educate all the time so I can be better at walking along side Black people I love and want to build a supportive world with. White people—re-learning (true) history and listening helps!", "chefheatherumlah": "@leilasadeghee", "kristinbrey": "I grew up watching my parents being super involved in our community - our house was an open house. My (White) dad helped to start the first boys and girls club in our city; a fair amount of my brother black friends and basketball teammates lived at our house since my dad was their coach and kind of like a surrogate dad- my mom invited our cleaning lady (who was an illegal immigrant) and her sister and son to live with us - I always grew up thinking my parents were so generous and I do still think that. I also now realize that there is a lot of white savior complex in their actions. That they were the ones who could fix it. And I think that’s something I have had to unlearn - that largely the communities I want to help lift up, I am not apart of (being a straight upper class white woman) and that the best thing I can do a lot of the times is take a back seat and not need to be in charge. That you can still help without being the leader.", "braedynbos": "(Ugh this pic is so good❤️) I used to believe that legalizing & protecting sex workers was a step back for feminism bc nobody really wanted to do it but instead were forced into it. Also that eliminating the market for sex work was true liberation.", "isabelmoconnor": "🖤 everything", "kellyhsouth": "That I need to be thin in order to be loved/valued/considered attractive.", "_dafni": "Things that I used to believe/uphold: colorism and texturism. That therapy was for crazy people or people who tried to commit suicide. That dressing a certain way warranted unwanted male attention . That sexual abuse isn’t abuse if it’s the same sex. That afros and dreads were dirty and had no place in high society. That I needed to dilute my haitianess with European ancestry to be beautiful. That feminism encompasses all women. The list goes onnnnn and I’m still working .", "treevuhh": "That being trans also meant you were non binary. Happy to say you have helped me come a long way and now I know the difference.", "jnnywstndrf": "Can’t say “have unlearned” bc I still catch myself with lingering shit, but I used to think 1. Fat = lazy 2. black = lazy 3. Disabled = unemployable, probably unintelligent 4. unemployed= lazy 5. poor = lazy or unintelligent or both Unlearning is an ongoing and empowering process. Grateful to ppl like you who regularly remind me to look inside for my own biases and wrongful/harmful/violent assumptions", "gillian.sera": "All this Canadian falseness has me riled up - here’s what our school system taught me that I’m actively unlearning all the time 1) “nice and polite” = tolerant and just 2) Canada is protective and defensive of its natural resources and loves the earth (oh hello tar sands) 3) white Canada was a saviour to black slaves escaping America and was way more progressive than the US in its history of slavery (wtf - progressive and slavery don’t go together) And this one is personal, but oh it’s a doozy: 4) that because I’m “ambiguous”-looking and had people call me exotic and ask “where I’m from”, that I know what racism feels like. 🤦🏻‍♀️ Thanks so much for encouraging this line of thinking, Ericka.", "lavenderteacakes": "That being a tall, fat black girl/woman meant I should be grateful to receive romantic/sexualized attention.", "jadenalayla": "I didn’t realize that I was identified as white in certain spaces and benefiting from that privilege. I didn’t realize that there was so much that I didn’t know and hadn’t bothered to question, both in the world around me and within myself. I didn’t realize how much I needed to read. I didn’t realize how seldomly people are having these conversations in their everyday lives and how uncomfortable it can be to challenge the people around us, and how much of my discomfort came from the possibility of losing some of my “stolen” privilege.", "jackn4pix": "I use to think gay men wanted ttyl be women & lesbians wanted to be men. I thoyght lesbians were just women who were sick of men's shit. I thought white people were more law abiding than blacks. I thought America was the greatest. I thought anyone could be rich if they went to school. I thought leaving poverty simply meant moving out of the hood. I thought saving money was a matter of spending less. I thought cops were inherently good. I thought justice was blind. I thought racism was for kkk members only. I thought dark skin wasn't pretty. I've learned A LOT.", "haiku.ambulance": "1. That optical allyship was good enough 2. That because I was informed, I wasn’t racist anymore (this is so untrue - I have a lifetime of racist systems and cultural practices to unlearn and separate myself from) 3. That white feminism spoke for everyone 4. That when calling out racist behavior, it is important to do so in a way that makes everyone feel comfortable so that we don’t alienate anyone (this is a hard and ongoing one for me - whenever I struggle with it, I am feeling the effects of growing up in a white supremacist culture and getting used to tone-policing.) 5. That calling myself an ally was good enough (it’s not. At the end of the day, it’s up to others to decide whether I am an ally or not.)", "rileyandlunaadventure": "I feel like I'm unlearning everything. Not just from my bible belt, anti everything not white and Christian background but my \"awakening\" in college. All the water down activism and white liberal rewrite of it.", "michelle.lynne.c": "Things I have un-learned: 1. If people would stop focusing so much on race, racism would disappear. 2. If they're my family I can't call out their racism/sexism/bigotry/xenophobia, etc. 3. That most white people want equality and justice for everyone. There are more, but these are my top 3. I come from a large, close-kit family and it's been a struggle not only coming to terms with some of my racist family members, but feeling comfortable enough to call them out on it. Thank you for all that you do, Ericka.", "shesawthings": "Old beliefs::: 1. That “i don’t see race” was not racist. 2. That there is a binary ANYTHING 3. That thin & fit was the only brand of outward beauty 4. That our government has checks and balances that keep evil and corruption out 5. That being an adult meant you have your shit together", "benedictine.herbs": "Because my family are new immigrants from the Middle East, because we have experienced discrimination, because I don’t identify as white, or Christian that I don’t benefit from white privilege and colorism.", "ronicut": "Love this post! I am horrified when I think of notions that were instilled in me as a white person from a “liberal” family and how I had so much unlearning to do (and will continue to do). When I think of how I saw nothing wrong with my views on race, it makes it so challenging to think of ways to get through to people who are so much farther down the racism hole and make that switch go off in their heads. But, I will continue to call out fellow white people and do the work to try and change their thinking. Thank you for your continued education... an education you shouldn’t have the burden of providing. ❤️", "panther_teeth": "1. Black and POC are interchangeable terms and experiences 2. racism is about individuals not institutions (WOW have I learned a lot since then) 3. Fat = unhealthy 4. I could stop being queer if I tried hard enough (and if not Hell awaits)", "saraeavanwhite": "Things I’m unlearning since following you and some other incredible activists... 1. I’m not a racist - a painful but 1000% necessary wake up call. 2. When it comes to issues of race my white opinion has a place (nope nope nope 💕) 3. Echoing someone else above... all sex work is exploitative (absolutely not) 4. If you’re in an interracial relationship you can’t be racist (🙄) 5. White people can teach anti-racism (nope nope nope ❤️) 6. Reverse racism can happen (absolutely not) 7. The first Irish in America (my ancestors) were slaves too (really disgusted that I ever thought that... they were “indentured servants”... so very different in that they could earn their freedom and weren’t considered sub-human. And what did so many of these Irish-Americans do after liberation? Persecuted POC!) 8. It’s ok for me to ask for education from black activists (unless I’m paying for it they owe me nothing). Thank you ❤️", "venus_feast_": "Best allies.. better said better allies bc of a history of oppression than other white folks.. innately without doing our work", "thecoochiecoach": "That my loud voice and powerful energy were too confronting! #bullshit", "gabi.ayad": "In addition to your points 1, 3, and 8-10, I used to believe that being angry was better than being sad, that being sad made me broken, it was worse for women to sleep around than men, that queerness was sinful, being attracted to women didnt make me queer, it was wrong for trans people not to tell the people they were dating, the British were the real bad guys of colonization because the Spanish just wanted to bring God and civilization to the indigenous peoples of America, there are \"good\" oppressed people and \"bad\" ones, and basically 80% of whatever else I learned in private Catholic school 🤮 the other 20% was probably basic math skills.", "_aobc_": "Theyro!! Trying to think of a fluid version of hero @ihartericka", "hannah_cifuentes": "That being “colorblind” was good. That “not being racist” was good enough. That “all you have to do is work hard to succeed”. And I very much though racism was a dying thing- I personally feel 90s culture (the decade of my childhood) perpetuated that a lot.", "donaassante": "I grew up thinking that all Americans were arrogant sons of bitches when I grew up in Europe. Then I emigrated to the US and discovered many were intelligent, respectful people. But then I learned about a disease that’s been ravaging this country since it’s inception...white supremacy. Ever since then I’ve been determined to help “cure” and destroy it. In this day and age should have no place in this world anymore. Sorry to rant.", "mo.otey": "White guilt makes me less racist and more progressive. When in reality it centers myself in the problem instead of recognizing who racism really hurts.", "wanderingchickpea": "Thank you for sharing this", "_artistichair_": "On MLK I learned that the us government put a hit out on MLK. His death wasnt just random it was planned by the government of the United States", "vconrecon": "1.) that Canada isn’t racist because we’re “multicultural” 🙄 2.) Colonialism ended soooo long ago and our history books in school are accurate 3.) White supremacy is a structure that only exists if you’re a white supremacist. 4.) if you’re not happy with you’re situation, you can just change it. It’s that easy. 5.) if you wear revealing clothing you’re a slut and that’s bad (thanks mom).", "monsterballmakeup": "-If i surrounded myself with White people I would some how become socially acceptable to them -if I get rid of my small Latin accent I would be better -that god hates me because I’m gay - that I should wait to have sex because I would be desired by men and well respected (when I used to believe I was straight) 🇲🇽🏳️‍🌈", "movewith_ann": "Up until not very long ago I constantly upheld tone policing. A lot of \"well if that person was just less aggressive then people might listen to them more\". I also though missionary services sounded like a great idea. 🙄", "sarahelabdi": "1. That there’s no such thing as appropriating a culture, you’re just “celebrating it” 2. That my ethnic & religious background somehow overrode my white-passing and I couldn’t possibly be contributing to white supremacy 🙄 3. That sex is binary but gender is not (this was a recent unlearning process and I thank you for your work that greatly contributed to my education on the subject)", "sassy_otter": "Racism is just the \"overt\" shit, not the exoticing or \"nice\" stereotypes. Being gay is a sin (I'm queer as fuck). Jesus is Lord. Privileged people can \"help\" those who aren't. Being masculine is better and preferable. Ron Paul would make a good president 🤦🏻‍♀️. Grammar matters and words have definitive meaning. I'm inherently evil and wicked and unlovable. I don't deserve joy. Is it just me or is looking back both painful and cathartic?", "absolutelyalix": "So many things! But a big one was the belief that Oregon, the state I’ve grown up in, was a progressive state that was safe for all people... Also the idea that not seeing color/not addressing race/ makes you NOT racist... ooof", "erinfish_": "thank you ericka for everything you share with us. its such a joy to follow you. i have learned (and have begun to UNlearn) so much because of you. very grateful and thankful. thanks again <3", "pouty.peach": "I used to think that Canada was morally superior to the USA. I also resented “aboriginal” days at school, in the last few years I have done my best to re-educate myself about how colonialism isn’t a thing of the past.", "carriebethwaghorn": "1. That having hairy areolas is disgusting 2. That my societal value is dependent on whether or not I’m in a romantic relationship 3. That it’s not ok to talk about being molested 4. That being molested makes people think less of me 5. That I have to wear makeup or shave my legs to be “feminine” 6. That having a tragic childhood doesn’t excuse or erase my white privilege. 7. That people avoid me because my family has all passed away. 8. That death is not to be spoken about", "bfinster": "Even though my gender presentation is more femme presenting that doesn’t make me any less masc. Oh, and anything with “man” in it is a curse word.", "thisoldbus": "Thank you for this post and all of your content, i was just listening to your podcast on the way to work. I am so grateful for you, your journey and all of your work! Uh, where can i find your venmo name?", "allie.plummer": "I love this so much 👏", "maryjump": "I learned that I have to unlearn soooo much about white feminism/liberalism and there are times I need to shut the fuck up and listen. Thanks for doing all you do, you and Eb.", "therealtiffycee": "Literally my life has been enhanced since following your page. Grateful for all the work you do. 💜", "joanclothes_": "Thank you for being here.", "kawira_kanga": "White=beautiful (blonde hair, blue eyes etc) and Black=ugly", "iconicspirit": "I thought respect and love was a good place to start but I’m rapidly being educated how much importance is placed on the money. I had no idea.", "hoodratdiego": "When I was a child, I moved to the mainland (FL to be exact) from Puerto Rico. I started school, and everyone told me it was weird to speak Spanish. So, I stopped speaking Spanish. I had to unlearn that what made me different then was not weird, but was actually a strength. I wish I had never let other people create that narrative in my head.", "berrybomb215__": "❤️💫", "kate.e.mckenna": "Trans women are a threat to cis women.", "kellylynnkrumdiack": "Thank you so much for your work! Something I will forever be unlearning, \"good\" intentions and desire to \"help\" should hold the same weight as any harmful and violent consequences.", "omi.o.my": "Some things I continue to unlearn 1. Acne means you’re gross and unhygienic. 2 my breasts are for everyone else but me. 3 you need to wear a bra 24/7. 4 being a slut and advocating for your own sexual pleasure is bad (see: everyone knows better than me). 4 monogamy is the height of relationship status... and there’s tons more", "curly_lora": "1- Only female and male gender. 2- Fat = unhealthy, not selflovable. 3- You can only be gay or lesbian, bisexual is not true, plus I didnt know queer, trans, pan, etc. 4- binary and cis people (this is a topic I would really like for you to explain it better cause I really want to understand it deeply). 5- Feminism is hate towards men. 6- Body fluids and hair are something to be ashamed of. 7- Sex is something to be ashamed of. 8- It couldnt get any worse (oh but it did)", "beyondyourdefinition": "That when people@asked what are you mixed with & reply & just black it’s a complement", "lingerielayla": "That mental illness is shameful and should be kept secret from those outside the family, that because I’m a POC that I can’t be racist/practice white supremacy, that the word racism should be reserved only for extreme acts of violence, that people were gay or straight, that female empowerment started and ended with the power to carry life in a womb, that men could not be empathetic, that people who stayed in abusive relationships were weak... I could go on & on but the unlearning and decolonizing of my mind is ongoing", "emilyfogle__": "Because I give reparations I get a 🍪. 🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️", "rzzadelatorre": "💕💕💕", "xcviidaniel": "Penetrative sex isn't always necessary in discovering ones gender identity or sexuality. I've had ignorant cis ppl tell me \"you don't know what you want or who you are because you haven't had sex yet\".", "joymatlhatsi": "If you are well-mannered and speak English well then you are immune to racism. I didn’t yet know the word” microaggression. My awakening has come with a dose of serious health problems health proble", "little_seattle_bungalow": "* As a child* Boys will be boys.If he’s mean to you it means he likes you. 🙅🏻‍♀️🙅🏻‍♀️🙅🏻‍♀️ Soooo many things wrong here.", "jessbknowing": "If I’m not a loud, Black girl then I’m safe", "blackdeanmagic": "You inspire me in my own development and that of the institutions and communities I am wedged into.", "n.yallah": "Being “strong” all the time is required. My queerness is only valid within the terms of an intimate relationship. I cannot identify as “fluid” when the rest of the world deems me femme. Standing tall in my Blackness & queerness are intimidating/dangerous.", "onlyalyssa": "I used to think sex work could only be exploitive. Which of course does and can happen, but then that's not autonomous sex work & therefore not consenting/acceptable.", "titchbits_xo": "Things I use to think: 1. I have black friends so I can’t be racist 2. Because I’m white I can make black peoples voices heard (NO! I can use my white privilege in a way that educates other white people & speak to POC to give them strength to make their voices heard if they none of their own) 3. White people were slaves too (Hmmmm) 4. Black people can be racist to white people (I’m still struggling with this one so ANY help and education on this would be amazing)", "mkat_dsm": "White feminism isn’t soooo bad 😬😳🙄 🤦‍♀️", "pina_bash": "I inherited the belief that rich people earned more than poorer people because they worked harder, that access to education was based on how hard you work, and that being fat meant you were lazy. I am so grateful to all the people who have called me out on this shit ❤️", "3arabiiiamiia": "I struggled with number 4 my whole life. Took a lot of healing to understand that it wasn’t true.", "ecstasyandruin": "that darker skin should be equated with ugliness/criminal/evil/anything bad. like lots of black kids, i internalized colorism which affected how i saw myself & other black people when i was younger. i spent many summer days in the shade for fear of getting darker. now i’m older & have long left behind favoring lighter skin as inherently more beautiful. fuck notions of beauty that rely on proximity to whiteness!", "mearamcnitt": "Used to hold onto the “My Italian immigrants were oppressed too!” narrative as if that had any impact on my whiteness and privilege today 🙄 Cringe just thinking about it 😪", "emma_bosley": "You have taught me to unlearn the idea that because a company is non-profit, that inherently they are “good”. 👏🏻👏🏻 thank you 💕", "shievas": "That having a big nose is ugly. That being a light-skinned person of color makes you a white person (not just a person experiencing privilege because of colorism, but actually just a white person). That body hair is gross and needs to be removed just for aesthetic purposes.", "charlotte.gianna": "Love those bottoms! Constantly looking for high waisted things 🤷", "elly.frye": "I used to think only and all women have vaginas. Now I know many people who aren’t women have vaginas and many people without vaginas are women.", "mryfrsyth": "I grew up in a family of educators and was taught to believe that more education = higher pay. And that being kind to POC automatically meant I wasn’t racist.", "magclaps": "1) That colonialism was something that “happened” in the past rather than an ongoing process 2) That Canada is “better” than the US as our racism isn’t “as bad” 3) That social workers are agents of change rather than arms of the state (at best we can be both, at worst we are simply harmful)", "crazy_life_of_kai": "That my transness and asexuality don't mean I'm \"broken\" and that not all disabled people look the same or are full time wheelchair users!", "mosey_kim": "I didn't grow up in America, but am still unlearning all your points that felt true to me until shamefully recently. Thanks for being here.", "___jessicahannah": "1. I wasn’t queer, I just fancied/fantasized about women. 2. I didn’t hold any racist beliefs. 3. Being “nice” to black people is enough to be anti-racist. 4. I need to be perfect all the time to all people to warrant love. 5. It’s healthier not to feel things at all - just brush them under the carpet and suck it up.", "carinadesireebrooksking": "I had to learn it was ok to be not ok", "arzoodles": "I used to think \"we are all equal. I'd get the same opportunities as a cishet man\" 😑😑😑😑", "clxtemel": "I'm happy for your growth and I've learned so much from you. No judgment but how did your ever come to believe #5???", "brooke_sistie": "If you care about social justice issues you can’t possible be racist or uphold white supremacy", "farmermaura": "Gorgeous Human 💕💋⚡️", "slynbutter": "👏", "_paulinedavis": "That aave is not proper english. That bisexual men are secretly just gay. That racism is all in our heads. That it's not okay to be a slut. That disabled people are not sexual beings. That being validated by white ppl is important at all.", "emiliad": "Oh man. My false thought that I’m actively unlearning is that the mainstream Jewish communities that reared me truly believe in equity and radical justice.", "herstoriwraps": "Thank you for THIS! Hey 👋 💜", "angbangz_": "Been here a while following you but I’ve learned that sex doesn’t always have to end in orgasm & that virginity is fake. Among other things. Lol but those stuck out to me.", "yazzila": "💗💗💗💗💗💗🌻", "lindsayayayyy": "I’ve been building a list like this over the past couple months. Each bullet is overwhelmed with emotion and specific stories. Thank you for sharing yours! 🙏🏼✌🏼💪🏼", "whenchoclatemelts": "Black folx use to tell me I wasn't black enough because of the way I speak and the interest I have. I now understand Black is Black there is no set guideline of performing Blackness. #melinated", "sotahealthyliving": "That if poor people just “work harder” they can get themselves out of poverty. Also because I grew up poor that somehow I was exempt from white privilege. I’m not & I’m doing the work to unlearn this.", "dippednblk": "People with poor grammar are unintelligent 🤦🏾‍♀️", "jamie.weiss.71": "That when a woman said she was a feminist she faught for all women's rights. I've learned that some women are feminist only when it appeals to white, cis women's rights.", "joydivisionmackie": "Oof, now I am going to do this. The things I believed about gay people, I'm embarrassed to say, and probably latent stuff that I need to work through. Thanks for sharing this.", "sunshine_survivor": "❤️", "allie.mazill": "I grew up being taught the American dream is real and applicable to everyone. Definitely have unlearned that one.", "stefanikasdin": "I used to think that “adults knew better”.", "sody_pop": "This post is amazing. YOU ARE AMAZING. Everything about this is damn amazing. So much love and respect for you.", "patriceando": "💙"}