{"soaringphoenix333": "🖤🖤🙏🏽🖤🖤", "yamalo17": "You are worth more than gold girl!! Nothing is wrong with you. Your fat body is beautiful. You don’t need to that diet that’ll turn into an eating disorder that you still battle with today. Those bullies don’t know you. They just jealous boo. You are loved baby girl ❤️❤️😭😭", "rosie_anne_jackson": "Your adults are not emotionally or mentally mature and it is not your fault or your responsibility. Don't be so hard on yourself.", "katherine.rose.grey": "You had and still have absolutely mag power around you 🙌💕", "katana.moon": "Wet seal!!!👏🏽👏🏽👏🏽 😫😫", "italian_for_strawberries": "You're gorgeous", "activist_hat": "To go to Morgan State and not Towson University 😂😂😂", "dapontefern": "Omg. I remember wearing our belts like that we thought we looked so cool😊😊😍", "eishalynette": "I would tell myself, I know he's cute but keep them legs closed because you'll be a mom of 2 by 19 and will will experience hardship never imagined. Plus I don't have the education to help my now middle & high school kids with their homework. I've deprived them of so much.", "katreena_anne": "Its not a phase", "slh_massage": "They were seeing themselves😂", "clarityskoglund": "No idea what they were seeing. You were/are gorgeous!🌺", "brownsistabasics": "Sis study harder, speak up, leave them dusty dudes alone and you are gay 🌈.", "shenanagrin": "U glow ‼️‼️", "averylarkin": "This is a kick ass post!!! You were & are so damn beautiful!!!! Glad you don’t need me, or anyone else, to tell you that 😘♥️", "_cactus_m.j._": "slay", "nycitydebra": "All youth is beautiful.", "scarred_jones": "Same I would tell my younger self that you are beautiful and your suffering won’t last forever 💖", "mamaincolour": "All the mistakes that your parents made don’t have to reflect who you are and the person you will become. You might not have been born out of love but you will become love on our own. Your conception doesn’t define you. You will be whole one day, you will be happy, and you’ll be able to be the kind of mother you wanted to three little humans. You will find peace.", "the___guesthouse_": "timely. And so much of your story with Eb talking about what bullshit this white supremacy capitalist definition of beauty. We get to remember the truth. You are so beautiful. Your person glows. It comes from the passion and aliveness of insisting on freedom and equality for all people, starting with the most oppressed. You are a living example. Thank you for sharing your beauty!", "enterourstory": "omg 💜💜", "thebutchdaddy": "That it’s okay to change", "drewrhaq": "A Reflection of themself", "erinvthomas": "The belts not in the belt loops! Yes!!!!", "peregrine_starr": "\"You are not fat. You are not ugly. You are smart enough to do anything you put your mind to, and dammit - start a band NOW!\"⭐", "mizmeika": "I would tell myself its ok to be a kid. Slow down you have the rest of your life to be an adult. Your taleted put your energy into your talents", "criaculture": "Love you my forever gorgeous friend!✨", "jasmin.schelling": "Yas, Girl, you are so right. Back then and now still a beautiful, cute, amazing woman!! ❤ I so hope my future kids won’t have to grow up all self-insecure and feeling ugly, because someone tells them so. I so hope that the fight we are fighting right now is worth it! 💪🏻", "harvey_stoned": "I love these shots", "sitaraslove": "Fine ASS WHAT I WOULD TELL ME BC THIS IS WHAT I WAS TOLD AFTER AN IDIOT IN JR HIGH WOULD GRAB MY BOOB", "c22c88": "To my 15 year-old self: “You aren’t the problem. Them girls ain’t yo friends. This too shall pass. Nice for what?”", "deliciarashad": "I'd tell myself to remain strong and that everything is happening for a reason- to build me and make me more resilient. That my life is valuable- that I am valuable, so let those dark thoughts go; I have purpose greater than death.", "pocdeaftalent": "A confident and beautiful young lady with a bright future!!! 🙌🏽✊🏽🤗🔥", "kurtzcrafts": "15 year old me needed to know that she shoulda paid attention to her grades instead of what was in Hot Topic and who was doing what. 😓", "katcunning\nVerified": "Verified", "jess_theartenthusiast": "I’d tell my 15 year old self that your father isn’t right about you. He was cruel for no reason and that you internalizing it isn’t your fault. Also tell her that school isn’t the end all be all and not to be ashamed of being weird. And crying is normal and necessary", "currentmscook": "I would tell myself, you’re absolutely right. This does suck, it’s untenable and you deserve an advocate. But you don’t have one and need to realize that NOW so you can start the hard work of advocating for yourself. The day you start will be the day you walk away", "korc.can": "You ' ll look 35 when you are 55. that's something to be happy for 😅😅", "fatafolle": "Stop being so scared and just talk to him. He’s not into you because he’s gay. It’s not because you are ugly or wear braces or are not cool. Get some damn confidence and talk to him! You just might end up becoming great friends!", "hollie_loves": "This is beautiful 😍", "_lady_light_": "\"hi self, you need to eat more,, listen to your instincts. Avoid males But go after that boy at the ndn center. Also smack that teacher that called a redskin. Your hair is beautiful even if others try to cut it off. You are your ancestors prayers made flesh.\"", "cherry_amare": "I would tell myself the same thing! 15 years later and I wish I had the language and the knowledge back then to tell some of these racist teachers where to go!", "wormslurper": "i am 15 hahaha", "sassyclassymemagrasse": "So inspiring 💘", "opentheyear": "stop dieting, try harder at school, and sweetie you're gay as hell so forget those boys you hang with and get you a girlfriend.", "youlikeannie": "Stop listening to all the people in life - especially family - that tell you YOU ARE NOT WORTH IT and will NEVER succeed. Life is about to get so much harder and you’ll need YOU to be strong.  @ihartericka you are/were double hella cute", "_geralartist_": "I would tell myself that they i'm enough, that i'm cute and smart and worthy of respect and that they are the pure definition of evil.", "vmontes_": "I’d tell her she is loved. I’d tell her that the weight she’s convinced herself she has to lose does not make her unloveable.", "obi_mom_jenobi": "Damn. I guess I would have told myself that your self expression is valid, you don't have to be perfect, you're good enough even though everyone that should make you feel that or claims they do doesnt, you don't owe anyone an explanation, stop apologizing, despite always trying so hard not to be Like your parents you're kind of going to be bc they raised you in their fucked upness, but you will be the one that finally breaks the cycle and heals it all, and above all, you're gonna be ok.", "jocelynstew": "\"Don't smoke too much weed\"", "laurcuts": "I’d tell myself that my life wouldn’t be better if I got a nose job despite how many people told me I’d look better with one! Never got one and still telling myself that to this day but it gets easier!!", "rachelcorradi": "💗💗💗💗💗💗", "xena117": "I would tell myself to not be afraid to be myself, and let all the nerves go. Don’t think about the haters, and have fun with life!", "theweeniewaggin": "@linseedoilz", "amandaeleaf": "I would tell myself that the years of bullying weren't my fault, that the boys who tortured me weren't worthy of my time, and that their misinformed, misogynistic opinions of me should never have influenced MY opinion of myself. I try to tell her this now but trust is so hard, and she's still fighting to be heard. ✊", "worlds_best_jennye": "I would tell myself to start exercising earlier on. To sleep around more. (Yeah, I said it 😂) To travel more. To hold on tight to my friends and not be so petty, bc one day they might be gone.", "dmitradawn": "The. BEST 🙌🏾🙌🏾🙌🏾", "karinsaari": "“Everything gets better after 30. You love yourself and you love your life. I promise.”", "jadewindhorse": "I would tell her that someday you will love yourself, so don't give up! And that it's ok to be who you are and love who you love!", "megative": "😂 Love this. You look so damn full of life. If i could go back i would tell myself to protect my heart and body against those who were not deserving of them. That love and happiness would find me because i was worthy of having a wonderful life. Sitting here in bed next to my baby and freaking weeping now! Thank you Ericka.", "daynadono": "Hella cute! And I’d tell my 15 year old self, “Don’t change, you got this. You’re not weird, you’re not different, you’re you! Own it!”", "meghan_lazzaretto": "This hurts my heart for all our current young people out there navigating this crazy, fucked up, harmful world. You were (and still are) beautiful AND amazing.", "bemnistired": "I need to hear this shit RIGHT NOW. I’ve been so hard on myself recently (well always) about being unattractive but maybe they’re just wrong. I love me and i feel like the moments I turn in the mirror & say “oh how cute!” are victories", "teamfreeman09": "I would tell myself it's ok to be loud and take up space. Don't hide your light under a basket.", "artemis.writes": "I love that. Look at you! Awesome photos! I’d tell 15 year old me that I’d better start learning that it’s OK to be ‘different and weird’ because it’s something I’ll keep hearing forever! And who wants to be ‘normal’, whatever that is? I grasp all of that now and see my 16 yr old daughter grappling with the same stuff and I just wish I could show her somehow that the people calling her stuff don’t matter, but having said that I do remember how all the ugly words find a way in when you’re awkward and sensitive and so young.", "cosmic5hore": "“belle” means BEAUTIFUL. you knew then that you were beauty.", "bethserafina777": "I would tell my 15 year old self keep doing you, because you are awesome! Also, you're right, too many people on this Earth. Thanks for this and you were definitely fabulous at 15!", "kocomeow": "You are so fun!", "username70passwordvixxen": "I would tell myself that NO dude is worth your time if he makes you feel less than the beautiful, crazy free spirit that you are. Focus on the females around you and put yourself first.", "charlottechimbira": "Always been beautiful 🌟", "itskeilavon": "To my 15year old self: Being dark skin is a blessing. All the jokes about being dark will get old & tired and when you’re 24 you will want to be darker. This isn’t the only life that is possible, you have much more power than you know right now.", "raesock": "I would tell myself “your parents suck. It isn’t you, it’s truly them”", "idealblackfemale": "🙏🏿🖤", "fit.phe.yoga": "trust your gut even if it doesn't make sense to anyone else... matter of fact, it's not anyone else's business", "michelle_bee18": "I'd tell myself not to shave the middle of my eyebrows cause there was some hair there. It only made it grow thicker... 😶", "littleravenpottery": "I would definitely teach my 15 year old self to say no, and say it loudly. No is such an important word.", "ell.dubb": "That boy does not love you. It’s okay to want things. You will have beautiful, trusting, amazing friendships. Say “no” to things that don’t make you happy. Your feelings and experiences are valid. It’s okay to need help. You deserve boundaries.", "darian\nVerified": "Verified", "lisaisneat": "i would tell myself, “lisa you are being anti-black. do better.” 😖", "fab_gabxx": "“It’s not your fault.”", "empressnextdoor": "I would tell myself it's okay to not like everybody, you'll do just fine in life", "spiteful_crow_": "I would tell myself that literally no one else gives a fuck and they're all worried about themselves, so relax.", "shesawthings": "I would tell her to stop worrying what people think of her and figure out what and who she likes!", "francaisahae": "omg ROXY!!!", "chromat\nVerified": "Verified", "dancingcroissant": "SO CUTTEEE", "thescrapfaerie": "Nothing ugly about your 15 year old self. People suck.", "stephanieiscovitz": "So much ❤️&🔥", "dabrownsugasexdoc": "take up your entire space - body, voice & mind.", "staysexyhoney": "this makes me so happy 😂😩❤️❤️", "sana_ny": "Calling someone \"ugly\" might be the meanest thing to say. Ever.", "rockerscloset": "Sag Powerrrrrr", "denver_sex_therapist": "Wow. How did you have that wisdom at 15?? This picture is great.", "nicolelnorth": "At 15 we’re all awkward and a bit uncomfortable in who we are. Being bullied can do permanent damage, and I assume it’s even worse when it stems from anti-blackness. I’m glad you were able to grow and move past that so you can inspire the people who are struggling with that today 💕 you’re a great model for black youth to follow", "fashioninformerldp": "You are beautiful, then and now. Stupid people will always be stupid.", "slow_in_the_city": "To my 15yo self: it gets better ❤️ you’ll be ok I promise.", "sfarmgirl": "🔥🔥🔥🔥💋", "katienumi": "❤️❣️👏🏾 yesss❣️", "katie_paw": "The things that are “weird”/unusual about you will be the things you love most about yourself", "manicpixiedream13itch": "Kiss girls instead of boys!!", "jo_bel": "Don’t major in sociology 😩😩😩", "queen_mel23": "I’d tell her save your money and eat what Abuela cooked, (I always ate out like 4xs before I got to my grandmas), also break up with that boy before he breaks your heart and puts his hands on you, you’ll thank me later.", "bookisabella": "I would tell my 15 y/o self: Don’t worry if you feel like you don’t fit in or belong anywhere as you were never meant to. You are an old soul, unique, and one of a kind. You are loving and nurturing and will bring many people joy, healing, and laughter. Your sensitivity is not weakness yet your greatest superpower. You are stronger than you think. You have many talents that are meant to be shared with the world and bring the utmost creativity and success in your lifetime. 🥰", "keona.nicole": "I would tell myself to stop having sex with guys that could give 2 shits about you! So young and naive. 🤦🏾‍♀️", "my.ka.lee": "I would tell myself to stop dieting and live life sweetie because you are fricking gorgeous just the way you are. As well as take some AP classes because we need to get these general college classes out the motherfucking way and you can handle the work.", "balicerry": "I would say, “You will come out of this fog and you will feel more like yourself than you ever have. You will feel growth in ways you didn’t know were possible. And yes, you will have really good sex eventually” 😂", "stormycoconut": "I don’t think I would say anything to her. I would just listen. Offer love, compassion, and support. Affection that isn’t asking for anything in return. That’s what I needed most-a safe haven, and about 5,000 hugs. 💓", "prettypleasecanijust": "This photoset is everything 😭😭😭", "brooklynsouthernbell": "I would tell me 15 year old self that she is perfect the way she is.", "word.of.goddess": "I would tell my 15 year old Self to disregard anyone who tries to make her feel small or lesser-than. ❤️ I LOOOVE these pics, hahaha spot the Sagittarius!! 😍😍😂😂😂😂", "bigtiddiekiy": "I would tell my 15 year old self that no one should make me question my worth and what I can and can’t do. I would tell her she’s a bad ass, smart ass girl and that life turns out well", "tertiumghost": "The same \"baby boo, you not big and ugly, these folks is small and white.\"", "lauriecburns": "It’s OK to be 6 feet tall who cares if they’re making fun of you someday you’ll love your height!", "margs_nicole": "To not care what anyone thought of me. To centre my own love for myself, as that is the most important love there is 💜", "daria_ann_poet": "Omg wet seal! 😩 Do they still exist?", "billyjoelwife": "BEAUTIFUL BB", "oravafinka": "I saw the pictures and thought how beautiful you were, and still are ❤️🔥", "blondefade": "You’re right! You’re beautiful. I was at Silberman school of social work one day an noticed you (before knowing of you through social media) and did a double take because of how uniquely beautiful you are. ❤️", "rachrachface": "“there is no such thing as being too much - too queer, too big, or too vocal about what you care about!”", "beachcityqueer": "I would tell her that I believe them and they have a right to be upset about the very traumatic things that happened to them that year. I would tell them that their ancestors have their back, and to drop those so called “friends” and keep stepping into your greatness.", "deborah_arndt": "I feel like all these responses should be made into an art project for everyone to read❤️", "_cbrennan": "\"You don't have to please adults and live up to their expectations. Do what feels right for you!\"", "_jae.3": "It's ok to be a fat @$$ ..chubby chicken e.t.c", "mortilfjell": "I’d tell myself not to feel guilty about eating the entire Oreo pie at Denny’s and introduce myself to the world of fat positivity.", "pickflick": "I’d tell my 15-year-old self that the only person I need to make happy or proud is myself. I think I’ll tell my 37-year-old self today—she still needs to hear it", "garretthomestead": "You were and ARE gorgeous!", "kayyyciaaa": "I would tell my 15-year-old self to speak up. I used to let a lot of things slide and I still do a little bit. 😕", "goodgreengardens": "You’re allowed to leave home, and you’re actually moderately allergic to peanuts so you should stop eating them now.", "deria.em": "girl been fabulous!", "indianajawns": "i literally wrote this post today - they will make fun of you for being shy and quiet. they will make fun of your gap, your flat chest, and then your huge boobs. they will laugh at you for being a virgin at 18. they’ll say you think you’re better than them because you keep your circle small. they’ll hate you for being able to stand on your own while they fight to fit in. not because they are jealous – because they are weak. they will see your radical self acceptance as a threat. let them.", "jendawsonart": "I'd tell her \"Your dad was a victim of institutionalized racism. His incarceration wasn't his fault. He's an artist and is where you get your creativity and you'll learn this after you realize your eyes have been covered by those who only want to exploit you as a statistic.\"", "suzannimals": "You were (and are) literally stunning. So awesome that you know and always knew.", "daggers.and.dames.vintage": "I love this and can totally relate. My lips were always “too big” my nose was always “too big” and my butt was always “too big”. I remember in high school having a guy tell me how I’d look weird if I was white. My favorite though was when my middle school bully (he once slammed a book in my face because he couldn’t handle how ugly I was) saw me at the grocery store and proceeded to hit on me. I laughed so hard and reminded him of who I was. I walked so tall that day. Anyway... I’d grab my 15 year old self and hug her tightly and say “keep doing you baby girl, you are the queen of your own world and all these people are going to look at you and shake their heads one day”. Then I’d kiss her on the forehead. Beautiful post and thank you for you. I see a very beautiful girl that’s full of life when I look at these pictures of you. 🥂", "ubalraul": "“Go ahead: get that D!” 😎", "veestun": "I would tell her to keep that “big mouth” and that confidence.", "shorthairidontcare": "You are so fucking beautiful!", "fer.nanda.1993": "You were certainly beautiful and probably very fun to hang around 😊 I'd tell myself \"Study hard and tell all these bullies to go f@ck themselves, you're hot girl\"", "indya_campbell1": "You were and are beautiful. Would've told myself to stop caring if boys like you or not cause boys like women that don't intimidate them.", "hayleywilliams42": "i would tell myself that when life gives you lemons you make lemonade. that visual album saved my life as a black woman✊🏾", "esellberg": "A QUEEN", "eatthecaketoo\nVerified": "Verified", "erikarosaly": "Love this picture, love this caption! You have always been so beautiful! Inside and out! And you exude pure joy even in your most difficult times! ❤️", "yourmamadressesfunny": "I’d tell myself not to mistake passing curiosity for sexual attraction. Read: girl, you’re super gay. Quit messing around with those boys.", "c4minho": "to be honest I just thought this was a not-too-old photo of you with different clothes, until I read the description. what's is your secret? 😂", "knittingnicole": "I would tell her to stop looking for validation of my self worth in the affections of men. 🙃🙃", "lovelymoonmelody": "Lol I forgot all about Wet Seal 😂 ultimate cool-high-school fashion of the early 00s 😂", "zkateryan": "You do not need to let anyone have sex with you! I had never even heard of consent. Now I’m teaching my toddler her boundaries and worth.", "4js72f": "i'd tell 15 year old me not to give themself over so easy to people that show the SLIGHTEST bit of positive attention to them. it's just not worth it in the end.", "izetta.h": "Been cute 💅🏾", "cocoonwoman": "I wish I could tell her something sweet but I still hate her so so much", "chelseaalisonmoore": "wow. My 15 y/o 90s idols right here 💫💓", "kick.tribe": "😍 stunning! Always have been. Inside and out ❤️", "kheekaleek": "When I've right about that before I said the same thing to myself! We are so right about ourselves!!! We had to learn self hate!", "sandra18d": "Don't be afraid. Say all the things you are thinking because are clever, interesting and brilliant things. Ask all the questions. Have fun. Be the person you know you are and you are hiding from de world. Enjoy yourself no matter what they could say. Don't listen who underestimate you because they are sooo wrong. You are so amazing and resilient. Enjoy your curiosity. You are lovable and beautiful. Accept your darkness and you'll find the light, the glitter and the universe of possibilities. DON'T BE AFRAID.", "jennifer.crouch": "❤️", "kaytastropheeee": "I wish i could tell 15 year old me that you don’t have to do things with boys that you’re not ready to. Your body has nothing to do with your worth.", "redpepperflakesoneverything": "This has me missing my red “mr. Rogers sweater” from middle schoool! I totally would have been trying to hang out with you & dissing the haters together❤️", "truestbaduist": "❤️💕", "fpunkfiona": "I see the class president of wherever you were. The space is YOURS and you look so cute! Imagining someone said you were ugly, I'm going to say a mom thing and call it jealousy if it wasn't hatred.", "addie_lou_cakes": "There’s nothing wrong with being 15 and having curves. There is something wrong with people telling you to lose weight or sexualizing you because of them.", "gigeemfagerstrom": "Don't get in the back seat of the car with that boy. :)", "_champagnemamiog_": "♥️💛", "sacredb70": "Love. ❤️", "mizzlg": "I would tell myself that I shouldn’t be scared to be my loving, free flowing, intelligent self even if others thing it’s annoying. Thank you for this awareness✨💫💖", "sloppydelicious": "A+ adorable and shining. The world is a messed up place in that powerful people maintain systems that encourage knocking bright young people down.", "headmomincharge": "You are not too much of anything. Be exactly who you know you are, and one day you will meet people who understand and accept it. Stop playing small to make people comfortable.", "honeyb3e_": "I would probably just like to go back in time and give her (me) a hug. Tell her that faith is more important than following all the rules and I will be forgiven not judged. I was so harsh on myself to not sin and the older I get the more I see rigid views as brainwashing and so I'm working on undoing all that still", "beyhivemember": "Yess mama they were DEAD wrong❤", "juicyjenks": "Soooooo cute", "_melissaashleyy_": "I would tell her that I’m beautiful despite what I had told myself. The only love I need is self-love and not someone else. I used to think that I was fat, but little did I know that I was significantly skinnier than I am now, and all I can say is that I feel as though I have more self-love now than I did before. I was unaware of the racism I’ve dealt with at my high school in Texas (because it was normalized). People would always assume my ethnicities. And girls that say mean things about you are only jealous and are simply self-projecting themselves. And just because I look different and undistinguishable (ethnicity wise) to other people, that didn’t mean that I was any less beautiful than those that were.", "delinda951": "Wow this question here was a hard pill to swallow. Never realized how hurt emotionally I was at 15 . I’m 47 now but literally in tears . I have a whole paragraph for my 15 year old self. Mean while I’ll just hug her. Thank God for her and thankful we made it.", "danyellecarter": "Girl, you so fine 😭", "tiffy_hernandez": "Stop giving your body to people in hopes they will like you. THEY ARE A NON-FACTOR IN YOUR LIFE. You will overcome your trauma and it won't define you.", "kelseybraff": "SWEET SAG BABYYYYYY.", "keilyw": "I would tell my 15yo self, you are enough, it wasnt your fault, you deserve and are worthy of love", "yasminthemachine": "Ok but now I wanna know your astrological placements... Bc I'm feeling major fire sign vibes but also maybe libra Venus or rising", "_rainbowroads_": "💗💗💗 this is super sweet and special and sacred 💗💗💗 thank you!", "ak__the_great_": "Bump these basic ass bitches, YOU CAME OUT FIRE!!! Also, my 15 year old self was helping, and holding other black queer folx, cutting school, but maintaining them grades. I was basically homeless and stealing to survive. But, ya girl survived sooo.. I would tell myself, BUMP these basic ass bitches, YOU CAME OUT FIRE!!! Holding you, holding me, holding Us. 😌", "wittytown_707": "Don’t be so meek. Get comfortable with confrontation.", "toyingwithtresses": "I would tell my 15 year old self to stop looking for \"culture\" from other people. As an African-American woman going to a mostly white and East Asian/Asian-American school, I was drawn to East Asian music and pop culture (i.e. Kdramas). I loved engaging with my friend's cultures but I didn't see myself as having my own African-American/Black American culture. Now I know, we outchea and we beautiful and culturally rich💓", "powerfemmme": "You look the saaaaaaame", "punkanddisorderly_": "I love that you were confident at even such a young age! I feel like so many young people are not. I’m still not sometimes.", "iixxguise": "I would tell my 15 year old self that one friend is better than none and it doesn’t mean I am loved any less.", "lieutenantbird": "Look how happy she is :,,,,,)))))", "haleyesc": "You’re freakin amazing! I would have loved to of grown up with you. You seem like a lot of fun and spit lots of knowledge. Haha & yes Guess and wet seal were all the rage back in the day.", "little.podge": "These pics are cute as fuck ❤️❤️❤️", "jackn4pix": "Dear 15 year old Jackie- you are not fat! Get that out of your head now. Yoy are healthy, strong, active, flexible and built like a woman... but not fat. Stop looking for flaws. Your nose, calves, teeth, hair, hands etc don't define your worth and are actually not bad looking. Don't stop being creative, feeling emotions or using your voice.", "skyemo": "Fucking yes HELLA cute. That first picture made me yell - yes! confidence! 🔥💥", "etothecgirl": "Soooo cute!!!", "_alannagardner_": "I would tell my 15 year old self to be as shameless and outgoing in any and all things. Don’t sweat being well liked. It will work out great for her in the long run. 🤗", "teganmarie97": "People who speak with such hate in their hearts cannot truly see any beauty this world has to offer. You make this world more beautiful just by being you and living your truth! 💕👑", "makecookiesnothorcruxes": "I’d tell her that she doesn’t need to work so hard to make up for being fat.", "azuaintuition": "This!!!!! Ok. So I’d tell my 15 year old self “They were wrong. You’re Black and you can create something out of nothing. And I Love you. And you’re worthy of the best. And you are Eternal” 💕 I may come back and say more", "lexiccarson": "That Sag energy always and forever 🔥🔥🔥", "laceybabona": "That my stepmom was damaged and to let it go.", "accidentalxgold": "Oh and I would tell 15 year old me that sex is not all it's cracked up to be unless you love the person. I would tell 15 year old me that boys are not worth the tears AT ALL and that you cannot find any real, true love until you have learned to love yourself.", "missmegan_marie": "I would beg her to try to find some way of dealing with existential terror other than trying to find a permanent relationship. 😂 Spend that time on your friends instead!", "sencreatesart": "I would tell my 15 year old self it was okay to be fat and people were still gonna love you if you cut off all your hair. 💗🔥", "blxjss": "Beautiful💓", "crystaldmc": "❤️❤️❤️", "m_illegalstonermom": "So freakin cute. 💞✨", "fracus": "I see beauty and joy", "lagrossetoile": "They called YOU ugly? Jesus, what hope for the rest of us!", "cee_gbolt3172": "I can relate Ericka..you were beautiful then and stunning now! Keep telling your truth and inspiring others to tell theirs. You are awesome!❤", "simplyzoubou": "Thank you for sharing!! 😍😍 I would tell myself to stop doubting about my blackness, to by proud of my roots and that Blackness comes in different shades. The beauty of black women is something that most people want! ✨", "vntglabel": "@rosavaniterson", "roxy__who": "I love that the green shirt says ‘roxy’ What wonderful pictures!", "jamillah.j": "I'd say: Try out for that play, you're going to love it. She likes you, it's okay and not gross. He likes you, it's okay and not gross. She's not going to be a good friend. Reach out to your extended family, your mom will not as she is still hurting. Find your father. And lastly, I know you're not fond of school but go away to college instead of going into the workforce at 18. Trust me. 😍", "holder_ofthe_hallows_": "I would tell my fifteen year old self to find solace and safety in the arms of my friends and my own existence, instead of in the arms of dudes who don’t give a shit about me. following your page not only is #relationshipgoals but also #learningtolovemyselfgoals ❤️", "misss__farah": "I don’t understand why anyone would call you ugly. You’re absolutely beautiful. If I could I’d tell myself not to be scared, life can be and is a beautiful thing 😘", "mtroisfontaines": "So cute!!! You have always been beautiful!! I'd tell my 15 year old self that the men who preyed on me were wrong, it wasn't my fault.", "molemaam": "I would go and tell my cute fat self and my cute fat best friend that they need to get into way more trouble and kiss way more faces without wondering if you’re good enough and be queer and punk and metal and be gentle and sensitive and it’s okay to cry all the time, everyday in every way! And that you’re tough with the tears, ruined eyeliner still makes you a macho babe! ❤", "mariacd_08": "Oh okay E so you BEEN that person huh?? ❤️👏🏻👏🏻👏🏻", "luhshawnay\nVerified": "Verified", "taraviolet": "So cute & beautiful! I would tell my 15 year old self not to base my worth on other’s validation, not to take people’s meanness about my appearance/art/extroverted personality/disorganization to heart. Not waste my energy crushing on jerkface boys. To focus my time on my close friendships. Believe in myself and be kinder to myself", "jen_and_her_fuzzy_girls": "You’ve always been beautiful 💙", "willienillie17": "“They are anti-black.” I REALLY wish I understood this when I was young.", "orgamsme": "You are so amazing!", "shsush4177": "💗 I would tell my 15 year old self that your worth does not lie in the desires of men.", "verldsherravelde": "Super cute 😍! I'd go back and tell myself that it's ok to be different, even if others don't think so. And that there are others like me out there.", "kingsoul.by.design": "🙏💝", "blackaquafina": "I would tell my 15 year old self that you are beautiful you don’t need your friends boys or anyone to validate who you are. You don’t need expansive clothes to be accepted. Your natural talent and gift will get you further. You are a empath protect your energy. ❤️🙏 wait for the right one", "beccanomics22": "Soo cute. Omg wet seal", "carliiinn": "🙌🏽", "softemi.x": "soaking up this post (free wisdom) as a fifteen-year-old. thank you ericka", "emilymahiai": "I would tell myself not to be ashamed of her body, that it’s glorious and doesn’t need to be shrouded in “modesty.” That it’s completely natural to have crushes on people. That sex is awesome and normal and GOOD. that her parents were wrong for sheltering her AND controlling her to the point of emotional abuse. It was out of love, but it was still wrong. And that it was okay for her to be upset and scared. I probably wouldn’t tell her she was queer cuz I don’t think she was ready for that. 😂", "to_love_from_me": "🙌🏽", "lavidadivine": "Beautiful indeed!!💜💜", "explaurren": "You cannot make homes out of human beings. All bodies are in constant change, physically and mentally. It’s okay not to feel okay.", "whoiszenobia": "Such a sweet kiddo", "ifurie": "I don’t know what I would say. I just feel really sad for 15 year old me. But yes to wet seal and urban outfitters I think I even tried JNCO skater jeans. Oof.", "raddollz": "1. It’s okay to be fat and love yourself and 2. Their jokes aren’t funny you were right, they are demeaning, sexist, racist and rooted in hate( I came from a really crappy town).", "detchka": "Da cutest", "strengthwithgrace": "If you do not want to have sex, that is more than om!", "lauralushoc": "😍", "thongria\nVerified": "Verified", "sequinofevents": "Don't listen to mama,don't be practical,keep dreaming big,and let go of your big boob dreamss that's your internalized self hatred talking.", "rcs.artsy": "Yesss work it!!! And I would tell myself that it’s perfectly ok to be queer, mixed, and to deal with mental health. There’s no need to shame yourself for being different. I would tell myself that I can do anything and that being me is amazing.", "fire_walkwithmee": "you have the nicest teeth😘", "gemstar296": "I don't think my 15 year old self would pay any attention to what I had to say. 😂😍", "gluffsugga": "\"it's okay to share your inner thoughts. It doesn't Make you a burden to Share your burdens with loved ones\"", "anomalousneesh": "i’d tell myself to read more and stay true to who i was then. i reckon i was my truest self and not disgusting then", "penelopehardcore": "I'd tell my 15 year-old self that a 40-something year-old \"rockstar\" wanting to date her was not cool or glamorous. And also that her nose is gorgeous. She'd maybe listen to the second one.", "naomistrange": "Who the hell was telling you that you’re ugly? That’s really rude. You’re beautiful BTW, I can’t believe someone would call you ugly SMH... especially as a kid!", "natasha_toushka": "Magnifique 😍", "mohawktheeducator": "I don't know but it probably wouldn't have mattered. If I went back and warned myself of too much, would I have been a better, different, or more well rounded person? Not sure. But one thing I could have done without was my shitty nutrition and reckless physical activities that has me trying to undo damage from ailments and injuries today."}