{"m00nlight_nails": "oh I love this!", "officialbarki": "@ihartericka how you shave by the way", "iam2jazzy": "Society makes us think hair is unnatural for women. I'm a hairy woman (arms, legs, face, etc.)and cannot help what grows out of my body. Typically I don't shave my legs, pits, unless I'm going to wear a swimsuit. My pubes I trim when I get too hot down there. I think it has been helpful that my guy doesn't judge me for my hairy body, but he loves it. It helped me to feel better about not wanting to shave. I also feel like shaving is a chore, maybe it wouldn't feel like that if I didn't feel like I was doing it for society. I still think about people judging me if I have hair, but I know I shouldn't. Still working on that. I was listening to the radio a few weeks ago and they had a discussion about hairy women. The guy said 99% of men don't like hairy women, and the 1% of men are weirdos for liking it(made up data). I was offended by that because why is a man weird for liking a woman with hair? Why is a woman grss for having hair? The 2 women on the show said ewww...hair is gross. I shave daily, the other one said I shave every other day. That conversation is furthering the beauty standard of no hair is sexy. Why couldn't the conversation have been I prefer women with no hair, or I prefer women who shave, but women who don't are still beautiful. It's about self-love and doing what an individual feels best. I'm not judging women who shave daily, but people who shave daily would judge me for not.", "jenniferannsteen": "Wax my ‘stache and shave my armpits and legs because I like how smooth my skin feels. Shaved down there in college because I played basketball and we all showered together after practice every day and I was self-conscious. Later, I did a landing strip for a former partner who asked for it, hated it, and went full Brazilian the day we broke up. It was liberating. Kept that up when I was dating around because it made me feel empowered and sexy and ready for fun. When I met my husband, I asked him what he preferred and he said “I prefer whatever makes you feel most open and sexy. I don’t think a man should tell you what to do with your hair...it’s part of your body.” I knew he was a keeper. Gradually went more natural and now I do full bush and I love it. I think your version of what makes you sexy is ever-changing, but I learned to make that choice for me.", "sarcastic_booknerd": "i love your posts but don't have the headspace for your long stories, they're kind of overwhelming. would you ever consider making a second account for the lifestyle stories and keeping activism ones on here?", "_shaunajadefoley": "@dylanxbarnes", "billionnaluxx.bebe": "Love this and I Love your love for yourself 🙌🏾 You are amazing 😘", "cutdifferently": "Three post in and I love your content 💞💞🤗🤗😍😍", "c8linwm": "I like to be shaved and smooth just because I like the way it feels, but I alwas regret shaving my vulva and bikini area because I always end up with razor burn and wanna die for like 2 weeks while it grows back in.", "curlydidi": "I shave my legs and armpits, and get a Brazilian now and then. Personally, I like the feeling of softer skin. Never ever shave/wax for a guy/girl. Your body hair is yours and your choice if you want it or not", "improvecathyq": "❤❤❤❤", "ivanpavletich": "@josesierravega", "colourfulnose": "I HATE my body hair, it's thick and black and looks horrible on my pale skin, not to mention my body hair pattern is like my brothers!! Everyone I know has the lightest blonde hair, or when they shave they dont have BLACK spots under their skin, honestly i want full body laser hair removal. No matter how many body hair empowering posts I see, this is one thing that will always taunt my life. It makes me feel ugly and not feminine and gross. I'd like to add that i love it on other girls and at times pubic hair on vulvas especially is quite attractive, and i never seem to get any pubic hair in my face during oral so that's a weird thought! Haha! Anyways love your page and you! 💕", "kushite_organic_kitchen": "Goddess", "steffbaker": "@cottspots", "new.account.who.r.u": "I enjoy picking pubic hairs out of my mouth during oral. I find it funny. ♥️", "_run_fatgirl_run_": "And I'd like to hear more about that fb group. But to finish the tale of the fuzz, I get a little hinky about it when people are dicks and mention it like they have some input on my body that matters, but in the end, I don't mind my hair, and those who do can fuck right off.", "rissri": "Sincerely appreciate your perspective on body hair, one I’ve never imagined. I’ve always struggled with removing my body hair being teased & what not, until recently I’ve began to embrace the parts of me that others made me hate about myself. Idk how I’d feel not having the choice to keep it now that I grow it out and love it. Thank you for sharing how losing the hair without choice could make someone feel 🙏🏼🖤", "les_chichis_d_emilie": "🔥🔥m", "pecheflesh": "I have pit hair and really enjoy it haha. From a fuck societal standards of what a woman should look like perspective to an erotic perspective. I find hair to be very virile and it is biologically hard wired into our brains as a visual sign of fertility, since in general, we have the most body hair when we are the most fertile and the most potent. Other hair I sometimes shave sometimes don’t just as my mood dictates. I think pubes are fun because you can do a lot of different shapes, full bush, no bush. I wish we’d move to the place where hair or no hair is just like red lipstick vs nude vs chapstick. Where instead of being a radical statement it’s just merely a means of self expression, without the social judgement and hate it often incurs currently. Because thinking women are gross for their natural bodies is pathetically ignorant, absurd, and just incredibly puritanical and unsexy.", "aaronlamardesign": "Pencil Cactus 🌵 😍👏🏾👏🏾👏🏾", "ben.van.arum": "👌👍", "jfashionblogs": "you're so edgy LOLLLL", "gvddessornaw": "I think people should accept someone as they are. So that someone can decide for themselves what they want their body hair to do or look like, without the pressure of those decisions effecting their relationship.", "bowenpinnacle": "Bush Garden 💕", "leslielavinia13": "Use to not shave, but I had more hair then most. Now I shave, not for anything other than it got itchy.", "exorcisecaution": "My body hair has always been patchy bc I went through chemo before puberty (freakiest thing for me was no eyelashes), which was frustrating as hell as a teenager. I would try to shave but I get dizzy when I lean over and I couldn't reach the back of my legs very well. My decision to stop shaving was, at first, mostly disability related. As I began to question my gender, it became an affirmation of my non-binary gender. I'm still frustrated by it's patchiness, but now because I wish it was darker and fuller.", "madeupofmemories": "sometimes hair is weird for me because of sensory issues. but i view all hair as normal and people can do with it as they please but we should question why we feel the need to change something natural. i have shaved my head a few times now and each time i do it’s because someone tells me not to lmao because i feel cute bald and it really shows me who my true friends are when i do it. i used to shave my legs all the time because i liked the soft feeling but then i let ‘em grow out because my current partner doesn’t give a hoot and i’ve grown to not either. it’s a waste of money for me. i honestly wish my armpits had more hair?? because i have like 7 armpit hairs total and that’s annoying haha. i also don’t trust adults who always wanna be with people who are completely shaven all the time because, that’s how children are and adults are meant to have the hair they do? anyways that’s my rant lol", "indo_cubeam": "Personally I view my body hair as a symbol of my reaching adulthood—I am a mature person and I have the physical traits to match it. Thank you, though, for the reminder that not all adults can have body hair, whether for treatment or otherwise.", "goddix.rising": "I remember the first time I naired all the hair on my vulva! The next few days I experienced the worst itch known to humankind. I vowed never to do it again. My mother and I still laugh about that experience!! Thanks for sharing 💓", "bethazon": "Also, you're gorgeous as always ❤️", "_thewellnest_": "Queen", "_geralartist_": "I love women with armpit hair. Something about the badassery of saying \"I don't want to fucking shave\" on myself depends on the season and the mood.", "itsme.fe_": "Me and an ex sat for about a few hours arguing how not having body hair on women is a societal preference but he believed he wasn’t influenced by society and it was his preference but also agreed it was okay for society to deem women with body hair unattractive because its “smart marketing”", "ashantihazina": "I agree with you and your perspective on hair in seemingly “undesirable” places. I’ve always had an issue with should I... should I not. And I had to realize that I have to make the decision for myself. So now I reserve the right to choose what I want whenever I want. Also if someone’s mood is completely changed because of hair in “undesirable” places then it’s/they’re not for me during this time in my life.", "aeppich21": "I loved the hair loss part of chemo. It was so nice to not have to shave. My partner went down on me every time we had sex. Now he won’t unless I’m trimmed. I keep having dreams about divorce. 😝", "bujotastic": "I’ve had a love/hate relationship my body hair my whole life. My family had dark, corse hair and it grows everywhere. I remember when I was 16, my dad noticed when I stretched, that I had a very light happy trail under my belly button and he commented with a weird tone “whoa! Look at that happy trail you got going there 😂“. I was so fucking embarrassed that I started to shave it. I regret that decision every day and hated my dad for it. Now, I love growing out my body hair and found me a partner in life, who doesn’t give a flying f**k. Hair is so natural, and I’ll never make someone feel that way about themselves, the way my dad made me feel about mine. LOVE THIS PHOTO OF YOU! What an awesome group of plant people 💚", "marvelousspiral": "I am extremely hairy, and have been since I was a child. It used to bother me, but I now am in my “fuck it forties”, so idgaf. I pluck chin hairs, dassit.", "bethyglynn": "I have never been too worried about body hair, but as I get older, I care even less. Bonus is that my husband thinks hairy is hot. The only thing that bothers me is that I come from a long line of ladies with crazy chin hair. That’s my hair removal obsession.", "mystic__leigh444": "After shaving my legs for the last time (3 years ago) and having painful welts all over, I said FUCK IT! Life's too short to think about body hair. I, too, was on (oral) chemo for many years and although my hair didn't completely fall out, it was enough to make me revisit my emotional connection to it. 💜", "believewomxn": "I used to get picked on for my hairy arms to but not once have I ever used nair or shaved them. I’ve always loved how hairy they are and how hairy I am it’s part of my ethnic background. There’s a thick patch of hair on my lower back and I’ve always thought of it as the cutest thing. But the accosting about my legs in gym at that point in my life did make me self conscious enough to want to change them", "coxrosefarmer": "I remember shaving my legs cutting myself very minor but feeling like i was dying cause i couldnt get it to stop bleeding. Raised my my single dad being told what a women is what femininity is from a black male persepective. I rebelled against it all and now as adult im wearing pink make up, and trimming not shaving body hair.", "lou_greene_w.model": "I let it all grow but shave my head. I have ginger hairs all over my body and it makes me so proud to show them off 🧡 do whatever makes you happy/feel comfortable 🙌🏻", "omgiawtc": "I like body hair. I personally trim my public hair or wax if I can afford it because it grows in this weird pattern that knots with hairs across from it. It's soooooo painful. So painful. I'm mixed race so I'm not sure if that's why my public hair isn't typical but whatever. And that's my public hair story, thanks for listening.", "stagiworks": "❤", "myledisrm": "Hermosa", "kieranblake": "I could not love this more. You can’t deal with hair on my vag? Then you don’t get anywhere near my vag.", "yourmamadressesfunny": "I stopped caring what people thought about my body hair around 30 and let that shit grow. I sing @kimyadawson ‘s song “We’re All Animals” to the kids all the time...and now my 10 and 14 year old both shave. Even though they’ve been raised by someone who preached a love of hair. Societal pressure is a bear. At least the middle kid listens to me...two out of three ain’t bad? I remember sitting in a hotel bathroom at 12 or so with bleach on my toes and hair between my legs and I just want to go back and tell her that her hair is beautiful and anyone who thinks otherwise is not worth her time.", "shosh.them": "I have found more and more that having long body hair is really gender affirming for me. I have fairly coarse hair and shaving my armpits and legs has always hurt, and has always made me self conscious. Deciding to let my armpit hair and leg hair grow out was the best decision ever. I love when the wind blows on my leg hair, I love having armpit hair. I am a really feminine presenting person and I feel like it balances me out. I always hated when the stubble grew in because I felt like a porcupine, I didn’t have soft baby little hairs. I will never go back to shaving lol", "ahstilley": "This photo and your words are🔥 I remember changing for gym in 6th grade and getting made fun of for my hairy legs. I asked my mom if I could shave them and she said no, she’d teach me when I was older. I found a razor and did it anyway, much to her horror, and remember being annoyed because it wasn’t that hard. My journey to love my body hair took a long time, and a partner who finds it extremely erotic. Now, if I remove any hair, it’s because *I* find the smoothness appealing. Sometimes he begs me to keep it, which is also pretty appealing 😎", "craftyveganmommy_aletha": "I have a wide range of experiences with keeping or shaving body hair because of competitive swimming, where you abstain from shaving most of the season to promote \"drag\" i.e. friction (that makes me laugh now as a drag fan) and then shave it ALLLLL off for big competition. To the point where I shaved my head a couple times, also in an effort to be more androgynous and get girls to like me lol. To living in the wilds with no access to running water and loving my long soft pit hair ... i started shaving my legs in 5th grade, before my older sister, bc I was self conscious of the thick carpet on my legs and eager to seem mature... but I have never been able to square getting rid of my pubes. They are naturally long and unruly but growing them back after shaving hurts so bad. I just try to tame them with trimming mostly for convenience sake. I guess I'm saying I started out being ashamed or confused about my body hair but swimming and feminism helped me see it more as a tool and my relationship w it since has been more based on practicality and convenience, which I realize is a privilege of being white/skinny. I used it to express my bi feminist identity but started shaving again being in a hetero relationship bc it helps me feel more feminine. Will never surrender the Bush though.", "theolivetreesandthemoon": "Love this love this! And love body hair! 🔥❤️", "kadiesurri": "I have a mixed relationship with my body hair. I have never been successful with waxing or shaving my pubic hair because my skin doesn’t tolerate either. After losing ALL of my hair with chemo I really marveled at the smoothness of my skin. My hair is back but different...my head is covered in curls, which I love and I have very little pubic hair, and somewhat envy those who have thick luscious pubic hair (wanting what we can’t have), and I only grow hair in one pit...so I’m letting it grow.", "claire.c.z": "I remember in 5th grade I was relatively hairy and hadn't started shaving yet. One day I was wearing some of those ripped bell-bottom jeans and a boy saw through the holes that I had hair on my legs and started making fun of me, other kids chimed in of course... I lied and said I just forgot to shave that day is all. Went home that day and begged my parents to let me start shaving, and my dad pretty much left me with \"yeah you're gonna get made fun of if you don't shave, so you should start shaving.\" For years I didn't know how to shave properly, I was pressing down WAY too hard so I would get the worst razor burn. I remember being mortified when the hair on my armpits started coming in. I hated all of it and wanted all of it off. Took me years to break myself out of the mentality that \"body hair on women is bad.\" Now I only shave when I feel like it, not because anybody else says I should.", "jen_and_her_fuzzy_girls": "Body hair or the lack thereof are both fine with me. I also married a partner who likes me either way💗", "mrs_vicius": "❤️❤️😍💯💯💯💯", "ichbinberlyn": "I stopped shaving in highschool and it was deemed so rebellious. I was given a lot of looks and teased but its what felt better to me (plus I was angry that I was getting attention and flack for not removing hair just because I was a girl) I started again because of battling with my former partner for 4years over their discomfort about my body hair vs. The welts and scars and ingrown hairs and perpetual skin irritation no matter what form of hair removal I tried because of ultra sensitive Baby skin🙄 now I don't shave anywhere anymore (except the sides of my head sometimes LOL) and I've never felt better. Something about the body in its \"natural state\" makes me feel sexy ¯\\_(ツ)_/¯ but sadly my eyebrows will forever be patchy from all that waxing as a young teen", "mjsoulsqueeze": "I was so tired of trying to look a certain way I thought my partners wanted. Plus, the irritation and pain finally made me stop it and do what's best for me. And I'm gaining even more love for myself and my body. But don't I love just shaving the sides of my head! It's a feeling of power and ease. Absolutely love. Thank you for sharing! 🙌✨💕", "cycleseeds": "i let it flow with my tactile desires (: sometimes i crave feeling wavy soft hair, sometimes i crave feeling skin only. 💕", "anthologies": "I don’t shave my pits and pubes bc my skin is so fucking sensitive, I can’t do it! The redness and itching is not worth it just to make someone else comfortable. Sometimes I’ll go without shaving my legs for months just because it makes me feel cozy (I guess I feel the same 24/7 about my pubes- COZY!).", "izabellasoko": "Real talk. I definitely feel those pieces of shame / Unsexiness if I have hair and I’m with a new partner. Frankly, when I let my leg hair grow out one winter, I felt my power grow. Now I’m in Goa with hairy legs hitting the beach- once upon a time that would be mortifying. Thank you for this honest share✨", "splenda_m0mma": "My own body hair gently reminds me of the soft, wild creature that I can allow myself to be", "livinitspz": "So since we are white we cant talk about a guy(a human like me) was fakeing IT to hurt people? i guess that is racisem? Haha keep playing victims, he fuc*ed up, @jussiesmollett you have do deal with IT! Color dosent matter btw", "hexexscrawls": "I look young for my age so I can't imagine getting rid of all my pubes, I used to try to but it irritated my skin and was so much effort. Now I'll only trim if it gets uncomfortable when I do sport", "the.nikki.alcala": "@nba435 You should def be in that group 🍑🌿", "symonaiuliana": "😍😍😍😍😍 you are amazing kiss you😍", "jetpack_bingo": "Hey! Nice pencil cactus!", "blue_eyes_and_chubby_thighs": "I started shaving my legs, underarms and privates at age 12 because \"all of my friends were doing it\" and I felt that I needed to do it as well. I spent the next 12 years of my life shaving all of that plus I moved on to shaving the hair on my belly and my toes. It got to the point where even one single left over hair drove me nuts. Fast forward to around June 2018, I was growing tired of struggling to shave every other day because of how fast the hair would grow and get prickly...so I stopped shaving my legs and belly, I still shave underarms and privates but that is only for comfort reasons and not social viewing reasons. I'm so much more comfortable and confident now than I ever was when shaving like that, my mother bugs me about needing to shave but I'm 25, it's my body and I can grow hair wherever I please. 💕💕💕💕", "dlar18": "After battling with body hair shame for a while, I finally stopped letting other's opinions dictate what I do with my body. I stopped shaving altogether for a while, but then I started to miss smooth legs. I almost felt like I was letting someone down by shaving my legs until I realized I was still caring about other's opinions. Now I shave my legs whenever I feel like it and I leave my armpits alone.", "cactusflowr4": "I too was a nair casualty.. as a latinx kid I have a ton of dark body hair. I got teased a to . I naired basically my whole body before an important school trip to a water park. Then I found out quickly I was allergic and went to the ER, where the meanest girl in school was there for a broken pinkie.. also, houseplant hobbyists is the most pure group on the planet 🖤🌿", "stumpytitch": "I shave my legs because I love how it feels when I can slide my legs around in the bed 😍😍😍 best feeling ever ❤️😂", "janefriday": "Like many women on this thread through the media and peers I was in world where body hair=bad and undesirable. My mom shaved her legs and pits but had major big bush pride. I was getting different messages about pubic hair from my peers and porn. It took a lot of razor burn, bleaching, waxing shaving and getting older for me to finally straighten out how I feel and what I like. I shave when it’s comfortable for me. And I get my bikini line and upper lip sugared because it doesn’t damage skin like waxing can, and the results make me feel incredibly sexy and together. I keep the pubes in a V and mum def passed on her bush pride, lol.", "thephilasaurus": "Body hair is a strange one, growing up I was ashamed as most teens are that they're all of a sudden hairy in places that haven't been before... In school you were mocked if you didn't shave but it still took years for me to get a razor, then it was religious - shave every day or you'll be bullied, make sure you're smooth and hairless or people in the changing room will notice. Now though, I'm more in to leaving my body hair alone, I haven't shaved in months and apart from the occasional wax I mostly just leave it all alone - my sister found it weird at first but then a few weeks ago she told me 'you have nothing to be ashamed of' and it was a turning point for me. Everything I feel that guilt or embarassment I question myself, who am I trying to impress, do I really want to be friends with people who make me feel ashamed of my body? And the answer to that is always no. So another day goes by where I leave my hair alone 😊", "kc.bdb": "@swagityanne", "soul_seeker_az": "The only thing I shave rn is the hair on my head. And I tweeze my eyebrows and chin hair. It’s nice, however I haven’t ventured out in shorts or a skirt or dress in public yet. In Arizona public that is. When I travel the PNW it’s more accepted.", "travelbanalities": "I have a decent relationship with my mom but I started getting tattoos when I was 18 and my mother never approved. When I was about 22, I decided to stop shaving. When she saw my hairy legs for the first time she said “that’s more disturbing to me than any tattoo you ever gotten”. Ouch.", "deemakhoba": "I honestly hate shaving my Vagina.. I don't have a problem with shaving my armpit.. I love body hair I don't see myself ever shaving my legs", "blaze2242": "I’ve been growing out my pit hair because I realized, similar to you, that I only shaved because I was ‘supposed’ to. Now I am annoyed by itching and pulling on my clothes from the hair so I will shave again but now I know it’s because I like it.", "cryingzerosandones": "personally, I'd keep all of my body hair, even my pit hair off deodorant didn't get clumped in it :////", "miss_t_thats_me": "I've never really had an issue with body hair. I never got the hangup, but I do prefer my pubic and pit hair trimmed just because for me it's easier to maintain. I have strong body odors and the smells get trapped more easily when there is hair. However, I think to each their own. Not shaving works for some people and I delight in seeing bodies full of hair and bodies without them.", "pocketsizedqueer": "Being a transguy makes your relationship with body hair kind of... weird? At least for me. Like it can make me so gender euphoric at times, and other times this wave of shame that I was brought up to feel about I will wash over me. It's even weirder how different strangers will act around you because of your visible body hair, depending on how they read you. Either way, I stopped shaving a few years prior to coming out, and never regretted it. I think body hair is beautiful, regardless of gender and expression. It also has a nice tactile sensation to it. Like walking barelegged the first warm day of spring and feeling the breeze catch on to your little leg hairs. It's pretty neat.", "samtastic4": "Love this. First time I realized I was “hairy”. I was in the 4th grade and some older boy at school said “what are you a gorilla?” No I could give a shit and for health reasons don’t shave but also for health reasons I am hoping to get laser.", "theonlymb": "I shaved my legs and armpits for the first time in two months today and that shit took like 15 minutes in the shower using all the hot water 😂🤣 I do like a nice smooth leg. I think I’m more attentive to removing the hair in the spring and summer or if I’m dating someone (no surprise there) but I don’t shave my pussy bald anymore. That shits for the birds. If you can’t stand some pubes - this kitty cat is not for your pleasure 😂 alsoooo I am attached to the hair on my head and it’s a feminine security blanket and i don’t feel I look good with short hair because then my upper back fat isn’t hidden. #fulltransparency woo!", "etnalliv": "Body hair has never bothered me on anyone else, but it’s been a massive source of anxiety and misery for me. I’m Italian and when I was 10 my body hair came with a vengeance, I was horrified. None of the other girls my age had anything, it made me feel absolutely disgusting. I would go at my self with scissors and the like but my mum would always find out. I would have kids calling me a gorilla and others touching my arms to feel it, so I started only wearing long sleeves and pants even in summer. My mum let me do something about it when I was 12, even though she really didn’t want to. I waxed for years and then moved on to getting laser because it still brings me so much anxiety, I just need it gone. I know that there’s nothing wrong with hair, that it’s natural and beautiful, but it’s just made me feel so awful for so long and I don’t think I have the energy to sort through all my feelings on it at this point.", "streamwaterveins": "It’s so weird how people are deemed attractive/sexy with hair in only CERTAIN styles in CERTAIN places??", "marmazoid": "i shave my pits bc the hair makes me get sweatier, & sometimes i shave my legs bc i like how they feel. i used to shave my vulva bald but stopped cuz it itched like a mf when it grew back & cuz i read that it put ur vagina at risk of infection to have a bald vulva. now i just trim it & shave off the sides so it doesn’t stick out my panties. oh & anyone else shave their ass sometimes? i do if i’m gonna have sex but idk if it’s more hygienic or less hygienic than having hair there, anybody know?", "spacecace": "I wish it would have never became culturally cool to remove it. It’s so natural. Human. I wish we would have never been manipulated into thinking it is gross, to sell steel/razor blades. Or manipulated by porn ... that to look prepubescent is the only thing that looks sexy. Mature, sexy folks know better 😉👌🏼.", "libbymarilyn": "Plant nudes might be the best thing ever", "b.collier13": "Beautiful shottt", "kelsitenango": "Learning to love my armpit hair & not give into societal pressure to shave", "honeybobadoh": "i luv u thank u for inspiring us all😍", "barber_baby18": "Beautiful!", "darcie_rose_photography": "Wow love this ✨", "priest.00": "I personally don’t care for my partners body hair it’s their body and it’s what makes them happy. But for me I like being a wet baby seal sometimes a strip is cool, sadly my mom never taught me about shaving (or even masturbating for that matter) so thanks to some amazing women on tumblr who made a shaving post I was able to shave with ease (bless that hoe post)", "slobdylan": "realizing i was non-binary has made my relationship with body hair really weird and confusing. do i wanna leave it because it’s too much work to groom? does shaving it mean im adhering to a feminine norm? but honestly i just try to do what feels best for my skin because it can be soooo irritable when i shave.", "allegra213": "Thank you for this. I feel a lot of shame about my mammalian ness and hearing all this brings me back to the sacredness of my entire body. Going thru chemo was a trip especially when the eyebrows left. 💖", "mskniterrific": "I'm hate spending time and money on shaving so don't bother 99% of the time. I went back and forth on it for years but I'm old and refuse to buy into other people's beauty standards now.", "leilaballard": "Winter is too cold in MI to want to shave ❄️", "jaycee_917": "I stopped shaving (everywhere) a few months ago. The hardest part for me to adjust to is the armpit hair, but even as I struggle, I sort of love it. I am not in any type of sexual/romantic situation, so I am curious how I would feel/what I would do if I were in one. But my choice to stop came out of a few things 1-questioning that patriarchal view of beauty and 2- being diagnosed with physical disability, I just refuse to spend my limited energy on something that is not necessary. That indoctrination though, it sneaks in when I least expect it! Thank you for this post!", "catherinestarnes": "Hi. We’re humans and we have body hair. Anything aside from that is honestly considering.", "niaskindaneat": "I only shave my body hair during the summer since I work food service and it’s effected the amount I get tipped. I feel like a child if I shave off my pubic hair and I also get hella ingrown hair’s so I just don’t! I definitely used to be hairless when I was worried about what the men I was sleeping with thought", "one_simple_lady": "My story is similar in some ways. About two years ago I started to really get tired of shaving and finally said to myself “why?” Now I shave WHEN I FEEL LIKE IT. (Sometimes shave my legs and sometimes I don’t 🎼)", "transcendentbeing222": "Loved the story and beautiful photo! 😍 and hair all the way! But I truly like both hair and no hair! Rockin’ either looks fab!🥰😍🖤🖤🖤", "foxface23": "Your talent with plants is fantastic, and I am in awe of it.", "psychiczya": "Love this", "peregrine_starr": "I love this photo! I have PCOS, so hair grows where it \"shouldn't\", and doesn't where it \"should\". The only thing I shave is my face. ;)", "unruly_awuor": "When I was 19 I decided to stop shaving and my (white) grandfather shamed me for it in front of my family. So I stormed off and turned around and said “OH AND I LIKE GIRLS”. My family was pissed... I don’t regret it 😂", "bravebird131": "@wellbyellamcdo do you follow Ericka? I think she’s amazing and could be a wonderful resource on your journey.", "darkn_kinky": "Sometimes i do and sometimes i dont, sepends on how I feel. I have little girls that was vorn with pubic hair and whenever their ready we'll talk about it and move on. As long as their comfortable in thier skin, everything is alright😁😘", "brittanytnorth": "Thank you.", "hellogoogy": "Nair never worked on me. My body hair is too coarse I suppose! I trim my pubes when they stab me, and get the edges sugared sometimes. Today I went to the gym in short shorts and hairy, HAIRY legs and pits and it felt great to have them all blowing in the wind!", "90216_": "Growing up I used to get teased at for having hair on my body, which I inherited from my dad lol. Still scared of using a razor till this day so I just hair removal creams for my legs and armpits. however ever since I started waxing my genital area (at age 17) I’ve enjoyed that freedom of no hair down there as I tend to sweat a lot and get itchy. After that I never used to remove the hair off genital area because to be honest I was way too lazy and I was very asexual. Nonetheless I still keep the hair on my arms and embrace them because I know that no one else will as much as I do.", "lovefola\nVerified": "Verified", "brittrfillmore": "❤️❤️❤️", "ultraviolenceandchill": "I love this! It took me so many years to overcome the shame and stigma of being an AFAB person and not being totally hairless. Now a days I mostly love my fur but sometimes it's still hard to not fall into social programming.", "aquariansoullife": "ahaha I have a similar story re Nair - never showed my mom tho. Love this share, thank you 🙏🏾💜", "mskimswanson": "It's your hair, do what you want with it.", "sacredb70": "Love this post! Love pencil plants. Love you!! 💖", "amapola_violeta29": "So beatiful", "whishb0ne": "I agree with the last bit about how getting a hair in ones mouth should be easy to laugh off. My first bf used to make faces and fuss whenever he got a hair in his mouth and it wasn’t till I dated my second bf, who had a lot of body hair, that I realized how rude the first one had been. With my second bf I feel like i fell in love with his body hair and my own so now I just appreciate it more in general 🙂", "aleekia": "Also I’ve always been made fun of for my hairy arms - even by cosmetologists who are waxing my eyebrows and will make comments like “you sure you don’t want to do those too?” Took a while but I actually like them / could give no fucks to what anyone else thinks now.", "daria_ann_poet": "Do what makes you happy. I like how being hairless feels to my skin. And I don’t like how hair traps smells. But I don’t care what another woman does (unless she is smelly in my vicinity. Lol.)", "imawhicher": "I electric razor buzz head down, armpits and arms excluded. I love the sensation of armpit hair, dislike the sensation of having a public hair poking my clit or catching in the weave of my underwear ( and am getting over the bs of *gasp* an unshaven bikini line 🙃), and am impartial to whether my legs are shaved or not. Razor burn is not worth it. Windy summer day with body hair? Awesome. ❤️", "somewhere_under_the_rainbow": "I haven't shaved or waxed anyyyy body hair (except occasionally grooming my brows & rogue chin hairs) & I'm super comfortable in my body and in queer settings, not always at doctors or mainstream societal thingsss. Love this post and that I have someone like you to resonate with 💙", "ellis.greer": "Middle school bully pointed out I had leg hair so I started shaving in secret but that summer my parents found out of course and then at least I learned about body wash and not to use an old blunt or rusty razor", "indya_campbell1": "I love body hair both mine and any partner I'm with. I recently grew my armpit hair out again and kept it that way and just shaved it off and found I like my armpits and vulva to remain hairy. I like shaving my legs and arms on and off but I think the vulva and armpits will be bushy for life :)", "spideygirl91": "I honestly don't mind body hair, on my partner and myself..in the summer I shave my pits basically because I sweat soooooo much and it irritates my skin x.x", "nixxnoirr": "I shaved for the first time when I was like 12 or 13, but quickly I found that I liked the way my vagina looked with hair way more lol. It felt natural to me to have hair. I would shave my armpits and legs like once a year in the summer, just to avoid comments. I've started shaving my bikini again for an ex bc he was grossed out by it, but i wouldn't do that again. I never was disgusted by my hair, I always shaved for someone else, so I feel so much better knowing i don't feel pressured to do that anymore", "adamdonason": "Queen", "lcloganempowers": "Beautiful", "tzaangor9": "I wouldn't shave my pits ever if I didn't have to. And by \"have to\" I mean I get horrible heat rash if I don't. 😞 I've become indifferent to body hair as a whole, and am more forgiving of myself if I don't shave for a while.", "fibrofag": "my mom wouldn't let me shave either so I have soooo many memories of standing in the bathtub waiting to wash the nair off!!! once I was getting rid of my arm/leg hair before middle school prom and my mom noticed I had some peach fuzz hair on my back, so she slathered it up. I ended up wearing an open backed dress that showed off my sick burns from nair 🤦‍♂️", "discoveringcasey": "I realized that shaving was more out of the comfort of others rather than myself. I shaved one time and accidentally cut pretty deep on my outer labia. I told myself no more and have not shaved there since and it’s been at least 6 years. Once in awhile my legs and armpits, but it’s like once every six months. I just do it when I feel like it. It should be because you want it or don’t. Not for others.", "ashantidoll": "I use to be anti body hair on women because of society brainwashing me. Some girls put me in check about it and never again. Ill let mine grow out sometimes and I feel great but if I had it my way I would have no hair below my eyelashes. I genuinely lovee my body hairless! But I have no disgusting thoughts about people who choose not to shave anymore. I would slap the old me for that now❤️", "julesmarools": "I didn't shave a thing as a \"radical\" queer in my 20s, then got self-conscious about pit hair in my 30s. In my 40s, I don't shave my legs, but shave my pits and trim my pubes for my partner when I think of it. If I was single, I wouldn't trim a thing. I think armpit hair is kinda sexy and bold!", "erinmichigan": "🙌😍🔥All of this", "miaschachter": "I loved reading this. Thank you. Still constantly checking myself on my feelings about my body hair. I stopped shaving my armpits because my aunt didn’t shave hers, and she went through chemo and passed a few years ago. It was something of an ode to her because I admired her for never giving a shit and unknowingly challenging my learned feelings of disgust about my own body. ❤️", "face_fyrefox": "So I used to hate my body hair. Shaved every day (sometimes twice a day) from 10-22 because my family made that the norm. Then at 22 i just couldn't anymore. My skin had gotten so sensitive it was ridiculous. Now that i have body hair, i hate how I loove without it. I look like a child and that weirds me out, so now im crazy proud of all my body hair.", "plus_garum_ferre": "I didn’t want to start shaving my legs during puberty but my mother said I had to. So I’ve been removing hair on my body for 36 years, now. Started waxing off and on about 10 years ago until it became a monthly appointment/expense. I don’t feel great about it because I dislike the gross way people talk about it making them “cleaner”—body hair isn’t dirty.", "mollywollypollypants": "Thank you for sharing your story! I did swim team thru high school, so in the winter we wouldn't shave until districts. The whole team would shave together in their swimsuits - the girls would help the boys shave the back of their thighs and then everyone would help the boys shave their heads because they didn't like swim caps. It made me feel so close to and supported by everyone! One year I had them shave my head and though I looked like an egg afterwards, it was such an experience for me and I felt like I had shed (haha) so much worrying about my appearance. I haven't shaved anything in 3 years and I love my body hair! It's not a political statement to me - just a part of my body that I accept and love dearly!", "yogamamasara": "@moonjitt for your next plant pic??😉", "justnece": "The 11 year hold me hugs the 11 year old you. When I say exact same experience, man! Nair everywhere.", "luminatingruminating": "🌱🌱🌱🌱🌱🌱🌱", "aminorstacy": "I’m queer and I’ve always found body hair on my partners to be a turn on. Whenever I see a femme lift their arms and see a shock of armpit hair it feels kinda thrilling. Probably because there is something inherently rebellious about it. The only part of my body I (inconsistently) shave is my legs and that’s only to show off my tattoos.", "jaima78": "I don’t shave my arm pits very often. I lived in Germany a couple times as an exchange student in high school and college and they were much more accepting of body hair. Also, my husband doesn’t care and travels for work and is sometimes gone for a month at a time. So I might go a month or longer without shaving. I have gotten some strange looks from the southerners in the summer (moved to Mississippi last year, def not as many granola hippie types down here), but fuck em. My body, my hair, my choice. I also happen to hate how itchy it is to grow hair out after shaving or trimming (pubic hair especially).", "samantha.kovach": "The first thing that comes to mind is being in 6th grade and always sitting at my desk hunched over with my arms wrapped tightly around my stomach. I had super dark, thick hair on my arms and the boys in my grade would call me “Harry”. So I made sure to never put my elbows up on my desk. I wore long sleeves whenever I could. As soon as my mom would give me a razor, I was shaving my arms. I shaved my arms for yeeeears, through high school and my early 20s. I don’t remember anything monumental happening, but eventually I just stopped shaving them and honestly don’t think much about it anymore. Kids can be so cruel though (pft, adults too), I can vividly remember the intense feeling of shame and humiliation.", "rey__hope": "so many babes in new orleans lettin their hair grow, inspired me four years ago to stop shaving and i havent looked back once!", "lostcrakers": "From puberty to 25 years old, I even shaved my arms/hands. I was mortified to have body hair. I'm finally loving my 6-months unshaven pits. I'm just struggling to come to terms with my other body hair. I'm NB but femme presenting and struggle to feel pretty, say, in a dress with hairy legs. I really want to overcome this.", "cadaverbox": "The decision to stop enduring ingrowns in my armpits and on my monds was the best decision ever! And a deeply terrifying one. As a hairy brown girl I had my femininity viciously denied to me - as many black and indigenous and other poc femmes can surely relate to. I am still wrestling with internalized racism / fear / shame over the amounts of thick, dark hair I have growing all over my body and face. And the dermatillomania I developed alongside my traumas. As much as I love my hair, and hair on others, it brings me panic when a lover gets close to my pubic hair. I still obsessively pluck my face to the point of scarring (and my bikini line - but I am happy to say I am slowly learning to let go of that impulse). 🌱 It's all a work in progress - thank you for opening this discussion and bringing awareness to all these experiences!!! 🌹OH and I love seeing my hairy legs with a pair of killer heels and my \"EAT DIRT\" ankle tattoo, it affirms my strength and my queerness 1000%", "queenbryt91": "I hear what you’re saying. Definitely conditioned at a young age. But as I’ve grown up, I have to shave. Once it starts turning into a bush, ahhh I’m so itchy all the damn time. And hair in my mouth? I wish I was easy breezy about it but damn near anything in my mouth makes my gag. But I would never make a partner feel like they had to shave. Weird and hard balance sometimes.", "velaninsha": "Body hair is the coolest shit ever", "iveynyc": "I’m kinda mad that I don’t have a Hair Choice :-/ *humph* I was one of the many that got diagnosed with cancer and was prescribed ‘Tax-o-tear’ (spelling ?!? 🤔) and the side effect was : Long term to Permanent hair loss in most all areas So I’m completely hairless in the armpits, crotch area, and eyebrows! My hair is very spotty ...", "alathariel": "I am verrrrry hairy, and would shave every day, and it would be growing back by evening. Often painfully, tbh. One day someone at a booth was trying to sell me a spa package including all the different ways and places to be waxed, and it was so expensive and intimidating! The person pitching to me could see my reaction and said “I know! The things we girls have to do, eh?” And I was like “have to?” On top of that, my then partner would tease me or shame me for ANY hint of body hair. When we broke up, I thought, I’m done. I don’t shave anything anymore and I LOVE flaunting my leg and armpit hair. Also, every sexual partner I’ve had since doesn’t give a shit, or enjoys it. That’s not the point, but I think it’s important to know that cool people don’t care about body hair as much as we think, even straight men. My favourite part has been my young niece saying she can’t wait to grow her hair.", "_entwife": "Also this and you are so beautiful 😍", "elishamarie3": "My thoughts on body hair.... I grow my armpit hair until its long enough to wax. I’m the summer there is a period of time where those hairs are long... doesn’t bother me nor do I try to hide it... I’ve had to ask myself why I still shave my legs and I think that for me I like the feeling of smooth legs, I don’t do it super regularly and have notice I have stoped letting hairy legs dictate what I wear like I did when I was young. I love hearing about other people’s journeys with body hair.", "undocuqueer": "❤️❤️❤️❤️❤️❤️❤️❤️", "mechanikaa": "Okay, I Started shaving legs and pits at 13? My first (way too old for me) bf when I was 15 pressured me into shaving everything and I maintained that for over a decade despite having very sensitive skin and hating it. In the later half of my twenties I started a landing strip because I couldn’t take the irritation anymore, that grew to just maintaining my vulva, to just less frequent trimming. Then I tried waxing, but my love of that lasted less than a year (Ingrowns are no joke) forward to now! I stopped shaving my armpits one year ago! And my legs are pubic hair I’ve been going natural for a few months too though not as confidently. I do still occasionally shave, I do like the feel of smooth legs sometimes. I do still get mega self conscious about a new partners and have found myself apologizing/warning before hooking up that I “haven’t groomed” 🤦🏼‍♀️ I am excited for the future of me just not caring to do it unless it 100% FOR ME. No one talks about this. Thank you 1000000x @ihartericka as always for making space for us to share about this topic ❤️", "rosie_anne_jackson": "My wife and I got married with full body hair last year. My wife even put glitter in her armpits! Hairy glitter pits! I had glittery hairy legs! I love having body hair. It makes me feel grown and more complete. Less deconstructed by society's wants. Took me a lil while to not feel embarrassed/unattractive by it when I grew it in a few years ago tho, is natural.", "libraryofnights": "I’m very hairy, since the day I was born lol. I had a super hard time with it growing up due to a lot of commentary, so I would shave every inch of my body damn near. Now I don’t fucking care and if someone doesn’t want to be with me cause of that, then that’s their business.", "killertofu__": "you’re such an inspiration 🌱🌱 glad to have this kind of positivity on my feed.", "paintchipsfromthewall": "I haven’t shaved my armpits in months and Weirdly enough it’s just not been a priority and not a conscious political choice ? I guess maybe it’s been less heavy on me as a person who naturally isn’t very hair but I realised the other day that I was starting to get comfortable with my body and it was such a casual but nice realisation. I think it’s important to ask yourself why and what your relationship to hair and hair removal is based in. Only really opinion I have on it.", "darlingjanex": "Suchhhhhh a beautiful photo 🧡", "_ctotheizze_": "My intro to “women shouldn’t have hair where men don’t want it” was in middle school, 7th grade, when a boy who wanted to make out with me wanted to make sure I had a shaved vulva 🙄 idk what he and his friends thought was gonna happen, but the joke was on him because all we did was kiss and then word got out that he wasn’t any good at it. 🤷🏽‍♀️ It’s such a double standard. That wouldn’t even be a stipulation for me. Nice? ✔️ Cute?✔️ Funny? ✔️ Respectful? ✔️ BUT ARE HIS BALLZ BALD??", "beeonederful": "A very similar experience to yours @ihartericka . I went through chemo 10 years ago. When my hair did come back, i went right back to fighting it. But my skin never reacted well, so, about 5 years ago I started experimenting with growing it out. Soon realized what a hassle and a financial drain shaving is. Love my hair and my skin loves me for not shaving it off.", "julia__clara": "My full time job is waxing and it’s really interesting to hear people talk about their thoughts on their bodies and hair. Ive heard many call their pubic hair disgusting and tell me they won’t let their partners see it, and don’t even want to have sex after their hair has grown out a few weeks. I try to tell them that it’s not gross and that they should only get waxed because of personal preference. Also, I’ve been more mindful about asking clients if they are ready and checking in with them often during the service to make sure they feel Ok (after hearing you talk about consent.) Even though they technically consent before stepping into the treatment room, I know it’s important to check in regularly. Thank you for everything Ericka.", "uctrish": "First, this picture is stunning ❤️ second, I feel that whatever makes you comfortable with your own body is the route you should go. I don’t shave often and I feel beautiful af regardless. If someone can’t handle a little body hair on a person they aren’t someone I need to spend energy on.", "nolaboogie40": "❤️", "maybe.maybenat": "I grew out my armpit hair to eventually wax it, and became oddly attached to it!", "the.starry.eyed.poet": "Minus leg hair, none of it ever really bothers me. Its more so the appeal to others I desire from it. Like shaving my pubes, fuck that shit. Stubble, pimples. Uh uh. I'd rather rock all natural. But I do it for my partners, in moderation.", "ari.s.p.e.c.t00": "I stopped shaving about a year ago because I realized it was a monetary and time cost that I didn’t really get any satisfaction out of. I waver back and forth about whether I want to go back to the status quo, shave and feel more comfortable or just let my body do what it does.", "lilybellevedere": "I have a body map for all my thoughts and techniques for my body hair. I like having smooth legs and I have tattoos on my right leg so I want them to show up as well as possible, so I shave my legs, but I have really sensitive skin so I can only use those one blade cheap razors. More blades equals more ouch! I was a stripper for years, so I used to have to remove everything below my neck, so when I stopped stripping, it was a whole new world of hair! I’ve had long luscious armpit hair for about five years now, and I really like it, although it’s so much a part of me now, I forget about it most of the time, until summer rolls around.", "findingnoma": "I started with Nair too when i was younger too. Now sometimes I shave but honestly most times I don’t. Mainly my pits tho—everything else is maybe a biyearly thing. I do tweeze the chin hairs tho (those grow rampant on my mom’s side 🙄)", "melodyinthecity": "My feelings on body hair are folks should do whatever makes them feel good. I felt a lot of shame around body hair and shaving when I was younger because of bullying. But by my mid 20s, I had just run out of fucks for the time it took. And the money to buy razors! Now I shave my legs maybe once a month, because I like how they feel all silky smooth and lotioned. I shave my upper lip occasionally to help with acne. Underarms and pubic hair I trim with a body hair trimmer every so often.", "emma.lettie": "Sometimes I am self conscious if I show body hair or facial hair in public, but on my own or with loved ones I have stopped caring! Yes I have a lot of hair but that's nature. My body is a body like any other. No need to feel inferior.", "skintonic.studio": "Lmao! “When I looked in the mirror I loved it, looked like all the ladies on porn” 😩😂 I’m just imagining this whole nair situation take place. Lol man we had no clue. I totally feel you with these hair stereotypes. And the thought that hair on the body isn’t sexy or “lady like”. (Whatever) 🤭 Now, I feel like it’s my skin protector. It’s that layer of protection you need as the first line of defense for bacteria and germs before it touches the skin. I still remove the hair but only a few times a year versus every chance I get. @ihartericka 🖤", "pegasaures": "Funny not a mood killer 🙌🏼🙌🏼🙌🏼", "erinluvv": "When I was a kid they teased me about my hairy arms, so I shaved them. Then they teased me for shaving. 🤷🏻‍♀️ I became obsessed with and ashamed of my body hair, constantly comparing mine to others. The further I go into my 40’s, the less I care - but it’s still an issue that I would love to release.", "popster613": "I haven’t shaved my legs or my armpits since October. I have someone who loves me and doesn’t care if I shave or not. But I’m super self-conscious about going to the gym in a tank top with my armpit hair (although I did it yesterday for the second time!). I’m working on loving my hair and being okay with having my body hair showing in public.", "hardie.tori": "Give em a face full of bush and if they leave they aint worth it", "mt.b___": "Thank you for sharing your story. Being ashamed of having body hair is something that has been a part of my life for so long it’s been strange to thing that this is not normal. Body hair is normal. And I am learning to not feel bad for not shaving when I don’t feel like it and not having to apologize for having spikey legs", "anddddie": "BEGGED my mom to let my wax my lil 14-year old peach fuzz back when I was living in the US. My mom was disappointed during the whole process lol. she basically forbade me from doing anything to my body hair until I came home crying cause of middle school boys! She used to tell me how beautiful my lil hairs were but I remember writing “I’ll be pretty when my mom lets me shave” in one of my journals (also had my white friends steal it and read it out loud to my classmates!!) now, living in the Philippines where mostly every woman STAYS hairy, I let my shit grow lol", "lil__bangs": "i sobbed and begged my mom to shave and she finally let me when i turned 8, still figuring out my relationship to body hair as my feelings about it change literally DAILY it’s frustrating :(", "youfatterme": "My skin hates a razor. Type, shaving product, moisturizer, after shave product, water temp, shave direction - none of it matters. My skin rebels with painful rash. I also have stubble same day, and my pubic hair will have in-growns almost instantly. I finally threw the razors out 3 years ago. I'm done with attempting femininity, and certainly done shaving.", "kitty_ekralc": "👏🏼👏🏼👏🏼", "revtory": "I love my body hair. I gave up shaving years ago and i love how soft and furry it is now. I definitely agree though - it’s hard not to hate it when you get socialized as a femme-presenting person. I also recognize that my whiteness protects me from a lot of hair-related bullshit. Hopefully we’ll reach a day when nobody’s hair is stigmatized.", "zenmebefree": "All of my body hair didn't really grow back after chemo 😒 i use scissors on the few hairs on my legs - if i feel so moved- nothing really under my arms & i trim my pubic hair to help avoid order esp in summer (gets warm down there)...my daughter is as hairy as i WAS & prefers to shave. I told her as a yungin that she would to make peace her body hair cause it's hers 😊💜 i believe everyone should. Don't feel like you HAVE TO do as others do", "nlkaplan": "I shave my bikini line for me now and leave my armpit and hair leg alone until I feel like shaving. Sometimes, I just really need the feel of shaved legs against clean bed sheets! What’s changed is my relationship to my body hair is that it’s between me and me- for me, and not for my partners.", "mrz_hudson": "I’ve never shaved my legs because I don’t grow leg hair 🤷🏽‍♀️ but I used to wax my puss and shave my pits like it was my religion until I met my fiancé and she didn’t. Then she told me how much she enjoyed hair. Then I realized I didn’t have to get hair ripped out of my vag every 4 weeks and quit. It was a freeing experience.", "baremother": "I’m so sorry people were laughing at your armpit hair when you had such cause for celebration. The world is messed up sometimes. I keep fairly hair free, as much as anyone does with young kids (fuck if I don’t have time to wash my hair I’m not going to shave my whole body). I keep my pubic hair shaved or trimmed short though, and prefer my husband to do the same (although we’re both pretty lazy these days 😆). It’s so much nicer than a mouth full of fuzz! There’s nothing better than freshly shaved legs on clean sheets though - feels so good! Absolutely no problem with anyone who doesn’t shave, and it frustrates me that there’s so much stigma around women having hair. Like of ALL the things to feel strongly about.", "theumabomber": "I got waxed a couple of weeks ago to get ready for a date and what I expected would be the first sex I have had in three years. Fuvkboi never showed. Found out later he \"met someone else he had more of a connection with\". Meaning he probably fucked her on date one. So yah. Right now IDGAF about hair. I'm still tryna figure out HOW TO DATE MEN WHEN YOU HATE MEN.", "monie_gee": "As a female dancer, the expected aesthetic is to be hair free, especially under the arms and bikini line. When I was younger, I used Nair and got chemical burns and then eczema along my bikini line. I couldn’t shave because it irritated my skin so I would trim it as low as possible with this grooming tool. Eventually I started waxing as a young adult. As a 30+ I sometimes let the hair grow in when I’m not performing to save money and cuz I realized I actually don’t mind the hair.", "alexisangelini": "Thank you for talking about this! Body hair should be more normalized", "tactilestudiosltd": "I stopped shaving in high school. I was never good at it, and sick of all the nicks. Then I fell in love with my armpit hair, then much later. I had a kid and decided my body was just fine however the fuck it was. Hairy, stretchy, whatever. Having preeclampsia changed my judgement of my own body, I’m happy to be here, and happy to have hair to grow.", "nickyheartspubhealth": "I have a very charged relationship with my chin hair.", "beccashetler": "I have this constant question with myself: do I prefer to shave because I actually like it, or because I’ve been conditioned (oh, a hair pun!) to like it? 🤦🏻‍♀️", "hippiisoul": "😍 Love your story. Thanks for sharing 🙌🏽", "gameandglam": "Still getting there with my body hair. My underarms, legs and arms are usually covered in long, thick, and dark hair which I was always told isn’t cute or feminine, so I started shaving at 10 because I was told boys wouldn’t like me 😩 I would wear pants everyday and yet still felt the need to shave my legs until I turned 18 🤦‍♀️", "zomothehomo": "Ooh what’s the plant group with nudes + plants?", "izzycurlslife": "I hate body hair but only because it makes me sweat. Now atleast, before I thought it was unlady like smh due to my environment. After I came to terms with it, now it makes me sweat like crazy due to Endo treatments so I can’t deal with it and so I take it off but atleast I know is my preference 😁. This picture is amazing and the story is even better thank you ❤️", "bethanyprofaizer": "@abrownbrownbrown", "lowtide.lettering": "I shave my pits when they stink, I shave my legs when I feel like it would look sexy (and don't when I'm lazy, which is most of the time), and I wish I could afford laser hair removal for ~down there~ because it feels much better hairless. I pluck my eyebrows, I tried plucking my toe hairs once and that hurt like hell. My current level of no-fucks-given about my body hair took a loooong time to arrive at.", "marcheruedix": "love love love love! and cool plant too 😉", "libbydefranco": "💚💚💚 PLANT NUDES!!! 🌱🍃🌿", "oh_emmy_gee": "I used to. I've always been fat, but after an emergency C-section I ended up with the 'mothers apron' so now I'm going in blind. So I just stopped. No complaints though.", "emily_raee": "Oooooh I hella resonate with this. My white mom didn’t know what to do with her brown, hairy af Arab-American daughters. She originally told us we couldn’t shave our legs until a certain age but I kept coming home from school crying bc white kids made fun of my body hair...she finally relented and then as a teenager I shaved EVERYTHING! Arms, legs, stomach...everything, including plucking my brows into oblivion. I look back on that time now and laugh, but also just wanna hug that sad girl who tried so hard to fit into the garbage euro-centric beauty standards box 🤦🏽‍♀️", "fauren": "speaking personally, the timing of your post is incredible. I just spent the morning reading other folks’ takes on body hair and whether/why they remove it, whether I could call myself feminist and still shave my legs... I’ve cycled through most iterations of hair removal over the last couple decades of my life. I quit removing hair about six months ago in tandem with a self-imposed break from romantic and/or physical involvement with other people, mostly for reasons of convenience and comfort. the arbitrary end date I set for that break was this past week, and I thought all along that I’d shave as soon as that date hit. but I find myself a) feeling really proud of what I’ve grown, and b) unable to come up with a reason to shave that doesn’t involve other people’s opinions of/discomfort with MY body. until and unless I find a reason for removing it that comes from within, it’s not going anywhere.", "itsjustemilyokay": "I shave my pits and occasionally my vulva if I feel like it, but my legs are just toooooooo much real estate and I don’t have that kinda time 😂", "walk.run.repeat.blaze": "Sometimes I shave sometimes I don't. I only started shaving my legs lately. I actually like the . ihair on my legs. I shave my arms and private monthly. I started arching my eyebrows in my late 20s. I do love arched eyebrows.", "oolaloha": "I fully support everyone doing whatever they see fit with their own bodies. Whatever makes you feel the best and only do whatever for yourself- no one else or to fit into any molds. ❤️", "tessuhdawn": "I have pretty bad eczema, so shaving my armpits feels like a must, like keeping the hair almost irritates them. But shaving my legs (especially in cold dry canadian winters) is different. I shave a lot less in the winter. But more in the summer. I just like the feeling though. Fresh shaved legs on bed sheets is pretty wonderful. Other body hair I always just left alone. It doesn’t bother me too much. Also, beautiful photo ❤️", "mccalla_hill_art": "🙌🏼 YESSSS. Love this. I remember in my twenties I had a male partner who once told me I had “a beautiful bush” and I remember thinking, “wow some people like pubic hair” and then the more I thought about it the more I started to love pubic hair. Also, when mine is shaved my clit sometimes gets overly sensitive and irritated.", "mohawktheeducator": "The porn I watched when I was a kid was from the early 80s and there was a lot of body hair. It wasn't until I was sexually active in my teens that I got teased for having a full bush. Went back and forth a lot but now I mostly keep it all except my pit hair from time to time.", "lisa_thecoolbiaunt": "This looks like Mormon Tea. It used to grow wild outside my house as kid. You're so beautiful and I'm so happy that you've been able to do so much reclaiming of your body", "deliciarashad": "I love this! I have always loathed body hair on me. I love it on my partner or whoever wants to do it but for myself it had to be gone. Then I ended up in an industry that required me to be bare in all places but i wasnt bothered. Now im learning to appreciats the hair and live with it since im on a budget and shaving is a no go for my skin and it has been hard! I still feel very uncomfortable lifting up my arms or wearing crop tops because of my happy trail. Nonetheless, im glad to be embracing it", "idontwearpink": "I stopped caring..... most of the time 😂 I don’t bother shaving areas that don’t show, I usually wear pants or leggings so almost never shave my legs. If I went swimming or something I would probably care more and shave. Armpit hair doesn’t bother me too much either anymore. Shaving is a hassle! I do get a Brazilian because I like how smooth it is after 🤩", "amandabritannica": "I shave pits all year because I feel gross otherwise. Legs not as often during the winter because the shower is cold but I prefer how it feels. Bikini line only when I feel needed. I do not care what anyone else does with their body hair because it's their body and I hope they make whatever choice makes them happiest.", "basickwitch": "I have lots of body hair, sometimes I let it be, sometimes I remove it all but what’s on my head and face. I say do what makes you feel like you. Sometimes for that’s being a hairy being sometimes a bare one ✨✨✨.", "damemasangelina": "My mom and a lot of other people in my family were essentially \"hairless\" and they only hair hair in places that would be deemed \"acceptable\" Meanwhile going through puberty my hair was SO thick and I was always so embarrassed. After a while I just got used it it. Why would I shave when it's the dead of winter? It just seemed silly. Hair is hair! It's natural and it's there for a reason. But like some folks said sometimes I like shaving it all and starting fresh in a way. But honestly people who make fun of body hair or lack there of are fucking lame. It's just so liberating to be like this is how I look and I fucking love it ❤️", "the_melanin_mrs": "Sometimes I do, sometimes I don’t. I love when I have my hair because I am so free that when I wear something that shows it and I’m usually at work and it’s a conversation starter mostly because I could careless about how anyone view me having hair and they can’t understand why 🤷🏾‍♀️ But I like it both ways to be honest", "stephwould": "My femme friends and I shaved our arms, our arms! in 6th grade. A lot of us didn't even have arm pit hair by then, but we got the message - no hair for femmes. I had to wear a dress to 6th grade graduation and begged my mom to let me shave my legs. She wouldn't. I did it anyways. So, been shaving since 11 😩", "mama_cook": "This photo is amazing! You are my plant witch goals💚", "whatisthehalflifeofloneliness": "I used to care, used to shave my legs. I'm a redhead, so my hair is very twilight and light, not very noticeable. I stopped shaving when I realized my partner didn't give a single shit. Honestly I'm just too lazy nowadays. I don't care anymore.", "meg___8": "I am so conditioned to have hairless armpits and vag that I don't think twice. But, I also love that I smell better when shaved in those areas. Which also stems from being told not to smell bad my whole life I'm sure. I don't give a fuck about my leg hair though. It can grow for months and months without a second thought. But.... growing leg hair doesn't smell. Weird how our brains work.", "nessa_bess": "Some weeks I love it and let it grow like some kind of power lol. Other times, I strip it away to feel new again. Both feel sexy in different ways for me.", "mtroisfontaines": "I shave my underarms and legs, and I get my pubic area sugared. I am very pale, with thick dark hair, and I was never physically or emotionally comfortable with body hair, so away it goes! Hair or no hair, every single body is perfect the way it is, and frankly it's no one's business anyhow. P.s I love the nude-plant photo thing!!", "stinkysamcat": "💓🌿 What is the Facebook group for plants and nudes? That sounds wonderful. 😊", "deborah_arndt": "I love mah pubes, and I have trich. So. Those two battles + recently libido rage have me considering (tho not acting on) clipping again. Never shaving, fuck that, and strike me down for saying it but I like my vulva to look 34 instead of 12", "alicexbenn": "It’s funny coz body hair on other people doesn’t bother me whatsoever but on myself I feel untidy and self conscious. I’m trying to unlearn the stigma and embrace body hair on myself. I have quite a lot of it, although I love the feeling of having smooth legs, I hate shaving, it’s a chore, my legs get prickly again the next day then I hate it again. But sometimes when I leave it to grow for a few weeks I don’t hate it, my skin is still soft although it’s hairy. I think it’s purely about how other people perceive me and my body and I need to get over it cos it’s normal!", "blackmagicbotanicals": "Unfortunately I get ingrown hair far too easily to even let this be a choice", "wzrdreams": "Finished up chemo for BC in November and my pit hair was the first to return. I’ve never grown it out before but I’m enjoying seeing it there now. It’s proof that I’m recovering. Every hair feels precious.", "quitababehh": "I’m pretty good with my hair down there. I don’t let it get too long cause I don’t want to smell. My happy trail is long too ☺️ I shave my legs/pits based on my mood. When I was a child I had shaved half my eyebrow off, my mom let me walk around crazy but I feel my body hair shaming came from more external sources than at home.", "i.was.king": "My mom made me shave for the first time when I was 10 or 11. Before that, a \"friend\" always teased me for being hairy. As I grew up, I started to feel more confident about my leg hair, my facial hair and my arm pits. But I am 100% hairy, I have in my back and butt, and on my tummy and boobs too, and it makes me feel like shit, no matter how natural I know it is. No matter how normal I know it is, it makes me feel like shit, and I still shave when I go to parties were I know there will be guys (and I feel like shit when I can't flirt with anybody, like I feel everybody thinks I'm ugly)", "meg_oneill_": "In Australia where summer goes forever and you are in a bikini all the time and constantly wearing singlets, I feel the need to shave my underarms and bikini line. Honestly wish I didn’t though because shaving your vag is a bitch", "fracus": "Nice plant !", "zoek00": "My family were all visiting my Aunty in hospital who had just got the terrible news that it’s incurable, I go to take my sweater of and my cousin sees my under arm hair and starts laughing while at the same time saying “woah Zoe, what are you doing with your under arms”. Then my other aunties chimed in, even my brother said that his gf (who had a beauty salon) would wax them for free if I wanted. I pointed out to them that we have Aunty Kerry here in a hospital bed and you want to talk about my underarms. It was flawed logic. I always rock a bush and I have even left guys houses if they refuse to go down on me becoz of my bush. Sometimes, I’ll wax it and I don’t mind but most the time I’m too busy doing life then to worry about spending time and money on maintaining everyone else’s beauty standards.", "tgrbass": "You marvelous beacon of life & truth 👑 I remember my mother saying that one of the benefits to her chemo was that her body hair grew back more sparse and easier to shave off. Somewhere around then I decided to stop shaving, but I also hid my legs and armpits from public view. The first time I walked around in public with legs out, I was terrified. Now I love em.", "miforelo": "I used to bust my legs all the way up wanting to be hairless like the older or pretty girls. My white friend called me gross in 7th grade because I didn’t want to shave my thighs. I didn’t understand their hairless obsession but I went along with it because I wanted to be like them and liked by them. I know better and I’m reclaiming that part of my life now. I’m a woman and this hair is a beautiful part of me. I haven’t shaved my legs since September I think. It’s long enough to not be prickly and it just doesn’t bother me. Plus if a old creepy man gets close to me I know my hairy ass legs will protect me from any unwanted advances 😁🥰 redefining femininity @sakiraaa", "arwynm": "As my husband says, humans come with hair. I wasn't allowed to shave my legs until I was 13 (my mom's rule) so I attempted to cut my leg hair off with scissors because I was teased at school. Like the girls in grade 6 teased me for not shaving my ARMS, let alone legs (and I am not someone with a lot of thick hair). Needless to say the scissors did not work well and I cut myself several times. At this point I only shave armpits/bikini line/lower legs when I want to, and the rest of the time I'm too lazy. I think my husband's acceptance of me in whatever haired state I choose has helped me get over the shame I felt as an unshaven 11-13 year old. (My mom wouldn't have bought me Nair, either, she probably would have said something about unnecessary chemicals or whatever.)", "e_run": "Such mixed emotions. I recently let my arm hair grow in (when i was 14 all the girls started shaving their arms for some reason) while it's a relief to not deal with the discomfort and effort of shaving and prickly regrowth, i haven't seen myself with naturally hairy arms in over half my life!! So it still genuinely bothers me every time i look at them! I feel similarly about legs and pubic hair. I hate the burden of shaving but am still burdened by feeling like I should look smooth and hairless. It's a lose-lose!", "ms.emjohnson": "I shave when and if I want to. Otherwise I just let it grow or trim. I have learned to love it. One day I will probably lose all of my hair(alopecia runs in my family and is a side effect of my condition) and until then I’m going to enjoy it however I please.", "katietunn": "This is such a wonderful post, there aren’t enough ways to like it 🙌", "thekatculture": "I'm learning to appreciate (maybe even love??!) my body hair, outside of societal conditioning of \"what is attractive\" but undoing brainwashing is a difficult process 😅", "badjobella": "Ugh ur awesome. 💛", "drea_carmen": "As a hairy girl, yes! I have keratosis pilaris, so shaving my legs helps, otherwise I do not bother. And no one (man) has worried about their pubes with me, so they can just suck it up for mine. 😂", "hellgirl1117": "❤️❤️❤️❤️❤️", "msdsantos6": "I felt this...I was 6 and I remember being at school using the bathroom and a girl opened the door and said \"ewww you have hair down there!\" and told everyone at recess 😩 I thought something was wrong with me. It took a long time to embrace body hair but I think I'm just at an age where idc what ppl don't like about me", "msmayafelix": "When I was 14 I was so ashamed of my body hair. It was thick and dark and all the people around me were white and hardly had armpit hair. I asked for laser hair removal. Luckily my mama told me to think on it for some time. To dissect why I thought the hair that my body naturally made was wrong. She also had breast cancer at that time so her own relationship with hair was evolving. Over the last five years I’ve learnt to love and treasure my hair. I’ve been harassed and threatened because of it, but it’s such an important part of it. It has taught me to honour my body and have a less narrow perspective of what is beautiful ♥️", "stardust_7777": "🔥", "thechocolatesensation": "Was just remarking on how my leg hair is the longest it’s ever been since I started shaving at like 10/11. It’s been keeping me warm. 🙌🏿 @ihartericka", "amandaeleaf": "I think body hair is just as personal of a choice as anything else. For me, I have coarse hair that can actually be irritating when it's long (ingrown hairs + tight jeans = fuck that), but I would never presume to even think that someone, anyone else should get rid of theirs.", "mspeachestoyou": "Growing up I was so ashamed to sprout hair shortly after my period started at just 8 years old. By age 10 I was covered in thick fuzz from my cheeks to my toes. I removed every scrap of hair-arms too. I stopped shaving the backs of my hands 2 years ago and my armpit hair nearly 1 year ago. My body hair comes from Italian and Native American bloodlines so now I feel oddly connected to it.", "candiceanitra": "I recently stopped removing all hair from my legs & pits & occasionally from my vulva. I love the freedom from a hair removal routine.", "becky_beckyh": "I can go weeks without shaving my legs and it doesn’t bother me. But armpits are an absolute must for me (I just feel cleaner when they’re shaved) 🤷🏼‍♀️", "ms.smashley.rose": "My mom also didn’t trust me with a razor so we went with Nair too. I didn’t wash it off well enough so my legs started burning AND because I didn’t wash it off of my hands properly, it started softening my nails. WHOOPS. I used to be very self conscious of my body hair, and it didn’t help that mom was a cosmetologist who was ready to wax or tweeze at a moments notice. Or that my step dad at the time called me Yeti/Bigfoot (and not in an endearing way). 5 years ago or so I realized that spending money and time on removing my body hair wasn’t making me happy so I stopped. I just want everyone to do whatever the heck they want with their body hair without other people being jerks about it.", "theroguewarlockmonk": "I really don't get bothered by it I have PCOS and other vaginal hormonal issues so I'm extra hairy, I used to try to constantly get rid of it (which is weird because growing up apostolic Pentecostal I wasn't allowed to take off body hair it was considered sinful) but I tried everything because I was so embarrassed and people would make fun of me, but eventually I learned to embrace but every 4 months or so I'll remove it, especially during summer because I live in Florida and I have chronic nerve pain and sometimes hair weirdly adds to pain and even the overheating so I'll remove it when it's hot but other than that I leave it on. Except for my face I'll pluck the chin hairs and take off my catfish whiskers", "sureyoushan": "I have been extremely hairy since I was about 8 or 9. By then, my legs pretty much looked like my dad's and had way more hair than my mom's. And it didn't help that I'm lighter-complected and my body hair is thick, black, and almost wiry. I can remember begging my mom to let me shave my legs and armpits. Even as an adult, I used to hide my legs if I hadn't had a chance to shave them and I kept my armpits bald. I was made to feel like it was a matter of hygiene and propriety. However, over these past couple of years, I've come to love my body hair. I don't remove any of it unless I just want to, for me. (I do enjoy that silky smooth feeling sometimes.) I love my hirsute body more though. And it is PLENTY hirsute.", "fkajoseph": "I always say if we weren't meant to have it, it wouldn't grow. I listened to a podcast recently and a girl put it better than I could and I always say this anytime someone brings up my body hair now \"THE ABSENCE OF BODY HAIR IS INDICATIVE OF A PRE PUBESCENT BODY AND THE FACT THAT THAT IS WHAT SOME PEOPLE FIND ATTRACTIVE OR LUST AFTER SAYS MORE ABOUT THEM THAN IT DOES ABOUT THE PERSON WITH THE BODY HAIR\"", "maryjump": "I used to care a lot more about hair but my friend once said, “they’ll fuck you with a bush as much as they’ll fuck you without one.” She was right.", "elyssium7779": "Really struggle with my body, feels about it, toward it, pcocs diagnosis gives me a good idea that my amount isn't \"typical\". Needed to read this, thank you thank you", "crimson_fig": "#BlackFolksInFauna 🌿💚🌿 and all the hair or nair they so please!", "joelladuncan": "Sometimes I shave. Sometimes I don’t. I have better sensations when I shave it all off. But I left the shame behind. For some reason my toe hair and top of foot hair is the one place I still get embarrassed if I let it get too long lol. Such a weird hang up.", "endlessbutt": "i stopped shaving about 5 years ago mostly because of laziness but also to say fuck you to societal expectations of what a feminine presenting person should look like obvs if you choose to shave power to you ive got no problem with that but you do your shit and i'll do mine and we won't have any problems! also used to worry about shaving for romantic partners but my current boo could care less where hair is on my body he still thinks i'm sexy regardless and i hope everyone's partners are made to feel good no matter where your hair grows!!!", "jodi_galvano": "My mom is this hairless no body hair woman, it my dad’s culture is on the darker and thicker body hair spectrum. She really struggled with me and body hair as a kid and teen and just didn’t know what to do with the fact that my bikini line ended at my knees and blurred with my leg hair. It definitely left me with a shame stigma that I had hair on my upper lip at 10 and a possible beard, but I accept that and own it. No shave November here I come", "herbanhealing": "I just made a post about my relationship with body hair and removal 2 days ago, check it out! I don’t don’t do that shit, never have, my body is what it is, and I’ve found that not removing the hair on my body keeps a lot of shitty people away from me, sexually. Like, I just wouldn’t ever be intimate with someone who thinks body hair removal is mandatory. I’ve never had any complaints, and I’ve mostly been intimate with cis men. Not once has any person I’ve ever been with either complained or commented on my body hair, unless to say it’s sexy, and if someone asked me to remove hair from my body, that would tell me we just aren’t compatible. Back in the 90s it felt revolutionary to not shave because we were few and far between, but when I was a kid working in farmers markets with my folks in the 80s, I remember seeing this lesbian couple at a market one day, I was around 10, they were holding hands and were boldly queer for 1986, but the part that stood out to me most was their super hairy legs, I thought that was so cool as I’d never seen any women with hair on their legs in public like that. I wanted to shave like a lot of girls at 11 or 12 but by age 15 or so I was so nature hippie oriented I fully rejected hair removal. I worked in Salons and spas about a decade ago, so I experimented with it when I was there and it was painful and pricey so I didn’t continue that practice and do ever plan to. My hair grows on my body for a reason and I consider it protective, and from a health sciences standpoint, it is protective, so I leave it alone!", "raisingredmans": "I was picked on because I was “hairy” I was 12. I’m pale with course, dark hair. It was noticeable and I’m still scared by their comments. I started shaving and as I aged my anxiety presented in a sensory issue and now I can’t tolerate the feeling of hair on my legs so I shave every day. I’m looking in to laser with the hope that it will soften my hair (as well as remove it).", "sibiandgigi": "Plant nudes!! Yaaaaas!!", "ihartericka\nVerified": "Verified", "gabrie_alea": "To be completely honest my parents thought I’d be crazy to shave off my arm hair let alone pubes. So with that kind of mentality in my home growing up I don’t shave. Only my arms (not under arms) in the summer, my partner doesn’t mind my hair down there either ❤️", "brianajacosta": "I don’t shave at all. My body hair grows back so quickly plus I didn’t enjoying shaving at all", "_tmmxo": "It took me a long time to be comfortable with my body hair. Thank god I did, the feeling is so much more free and you learn to judge less. If people value you on the amount of hair that’s is or is not on your body, those people are not good for you!", "veganlicious.lj": "Thank you for this post! After a recent breakup, I stopped shaving for the 1st time in 30+ years. I’m super into my armpit hair but I’m working on overcoming the conditioning that says my leg hair and unruly pubes are not pretty. Thank you especially for your point about hair in the mouth during oral being funny, I needed to be reminded of that. ❤️", "actually_owl": "Injured myself plenty as a kid, spent too much of my allowance on bleaching creams and razors for my arms, even shaved my “side burns”. Thanks to people like you, and those who inspired you, I’ve unlearned the hate for body hair and don’t give a fuxk", "learning_to_let_myself_be": "Whatever tickles your pickle is what you should do. ❤️", "lovemolella": "💕💜 your light is so bright", "beatricebearruns": "Oh wow. Such a love/hate relationship. I don’t like the feel of hair on my legs but I would rather grow the hair in my pits because it helps with chafing when I run. The pubic hair is another story🤷🏻‍♀️. Like, it is huge and wild and I’m tired of fighting it. Even though for years I’ve felt shame around it.", "__alltherightweaponry": "When I was 7 I went to school in a dress and I was teased mercilessly because I had hairy legs as well as arms. I went home feeling so horrible I stole one of my dad's razors and attempted to shave my legs but instead I cut myself up my leg and was too afraid to continue. As an adult I think about that and the hair on my body no longer makes me feel uncomfortable, it's other people that feel uncomfortable and that's not my problem.", "averagechezz": "I only shave when I can be bothered. Im lazy 🤣", "sk8witch": "A friend of mine had older sisters who were all shaving etc long before we were allowed. When I decided to shave my leg hair it was because I thought it made me “look like a man”. My mum was so mad at me but I kept doing it. All through my teens I hated my vulva for so many reasons, hair being one of them. I’d put up with terrible ingrown hairs just to keep it the way I was told I should keep it. So glad I figured out it’s all a choice. I still get called Sasquatch from time to time... but I am not bothered. I haven’t taken a razor to my legs or armpits for so long I don’t even think about it. But for some reason I still feel more “modest” by shaving my bikini line 🤔🤔🤔 wonder why I can’t admit I have pubes 😂", "aespragoo": "This picture is the best.", "_senti_pensante": "I love all my body hair and wear it proudly", "iriewrist": "I think it’s our natural defense against so many things, and it shouldn’t be something people are ashamed of. I think that everyone should also have the ability to care for themselves and their body hair as they see fit, as it belongs to them. Beauty lies in it too!", "ohmissmarley": "Love love love this photo 💜", "msnae2u70": "💜💜", "kbx9ph": "I can't stand body hair on myself,aside from hair on my head and brows, but on other people it's fine.", "superduperkas": "Your body, your hair, your business and no one's else. Rock whatever hair you want or don't want.", "raisaflowers\nVerified": "Verified", "luongonm": "First, love this photo. Second, when I was about 15 (and not even vaguely sexually active yet) I one day had the brilliant idea to melt hot wax intended for (very White, very fine - haired women's armpits) and spread it all over my vulva. I blame porn, and internalized misogyny, but suffice to say I spent the next several days peeling wax off of my labia and out of my vaginal opening without actually having removed any of the hair I had intended to remove. Lesson learned.", "resse_bun": "Coming To The Realization That My Body Hair Is Perfectly Fine And If I Wanna Shave It, Keep It, Color It, That's Okay Too. No Longer Shaving It Because Someone Else Doesn't 'Approve'.", "lennaeleilani": "I used to shave pits and legs but no longer! Why should I spend so much time trying to get rid of something my body works so hard to grow?", "they.them.ryse": "I don’t shave anything. But I wax my eyebrows lol. I started shaving because a boy I liked commented on my hair 😑 and I used to watch a lot of porn too so I thought I shouldn’t have it. But I have a skin condition, and shaving, and waxing gave me the WORST ingrown hairs! So bad they would get infected. I had to chose between hairless skin with ingrown hair bumps, and scars that itch like shit, or my natural hair? I then realized I DONT FUCKING LIKE to shave... like at all, it’s a chore and I would only do it so a partner wouldn’t judge me. Got married and realized that seriously those who want you, don’t care. I haven’t shaved in years but I still struggle to go out in public showing my legs.", "themelissadenizard": "Also, slay!!", "lightskindntcare302": "So gorgeous Queen 😍😍😍🤤🤤👑👑👑", "_lunita": "oh! p.s. - take nude photos with your plants is so up my alley. what’s the fb group called? lol", "nevermore905": "I hate shaving my armpits. Always have, but recently stopped because idgaf. I buzz my bush but can't use razors cuz my skin explodes. I might try waxing at some point. It's mostly because I really can't stand when it gets too long for practical reasons. For me, a good partner won't give too much thought to my pube situation", "cleopatravesty": "OMG bitch I want to cry. You're fulfilling such a deep purpose and destiny in my life, teaching me such vital and timely lessons. Feeding my soul. Showing me the light. Guiding me. I thank your soul!", "classyallthewayjes": "You are so beautiful Omg this woman give me life truly amazing 👑👑😍😍😍", "kinghaggard": "That pencil cactus is gorgeous!!!"}