{"fpannabanana": "🌳", "babatiago15": "@leite40 quero sua opinião anoite sobre esse tema, gosto das suas opiniões!", "lauracanosaa": "🌳", "msole_privatee": "🌳", "laurasaizvila": "🌳", "rubenpeyta": "🌳", "vasilisachudesnaya": "🌳", "roza_vasilishina": "Finally someone talk about it! Thank u for this ❤️", "soccergirl.0716": "🌳", "gaia.formentin": "🌳", "halfwhitegypsy": "🌳", "lapetiterosenoire": "🌳", "maja.wolniewicz": "🌳", "meg______b": "🌳", "tiffialexandria": ",🌳", "grace.yl": "🌳", "albacaracuel": "🌳", "mr_lefthook85": "Pubes are sexy to me", "clairede_loon": "🌳", "jenjiboy": "🌳", "seb.pdf_": "yall fucked up if u think that they’re gonna waste money on fake pubic hair just to make a statement", "destructible": "🌲🌴🌵🌳 d i v e r s i d a d 🌳🌵🌴🌲", "caitbadamo": "Well. Because kids DONT have pubic hair. And don’t necessarily spend a lot of time looking at other adults genitals (or I hope not) so there for. They don’t associate genitals with hair. Not all children can handle understanding sex and puberty. Children mature differently.", "meek.a.m": "I proudly sport pubic hair, leg hair, underarm hair...I only tweeze between my eyebrows and shave my face. I try to change the conversation in my community that body hair is just that...hair. It’s not unsanitary because of its location. And we don’t give cisgender men much thought for their hair. 🤷🏻‍♀️", "braids_by_kailey": "So glad I found you. This post is so fucking real. Another thing to be mindful of while I parent my baby girl. Side note... I hate barbie. #liberatepubichair", "chonky79": "How are these even classes? People actually pay real money for them? 🤪🤡", "miriam.with.an.e": "Don't be a fucking clown this one's a no brainier", "chick_fil_atio": "🌳", "nikimccormick1": "🌳", "imprins_kpl": "🌳", "chatsupreme": "🌳", "giaallaa": "🌳", "legendofthesiren": "🌳", "maelik.oberson": "🌳", "kracy_memez": "It's a kids toy are all gender bender this stupid and want to teach kids about sex at the age of 4", "rantingandrighting": "🌲🌳🌲🦇", "ne__ctar": "🌳", "squiidneey": "🌳🌲🌴🌱", "jpinthetree": "🌳🌴🌲🌿🌱🍃🍀☘️🍂💐🌻🎄🌵🌾", "oliviadelphi": "🌳🌲☘️🌴🌵🌿", "twomainemamas": "🌳🌳🌳🌳🌳", "aria_di_primavera_": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "lily_moo": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "thesleepyphilosopher": "My opinion has nothing to do with social conditioning. I just feel better when it's shaved. Lighter. Less sweaty lol. My ex preferred long. I didn't. He's gone. So is my pubic hair. ;)", "hannah_macintyre": "yes!! Never even thought about this 🌳🌳", "notablenormalcy": "🌳 🌳 🌳 —- YES!!!", "tracylikestopost": "🌳", "wabasspro1982": "It costs money to insert hair into a doll. They probably didn't put pubic hair on them because they're for children, why would they spend money putting hair under the clothes. You ever wonder why they don't put scars on them either? Or pimples? This Instagram account is great, every single post here is hilarious", "ohmamazia": "🌳🌳🌳🌳🌳 yes!!", "xandersucksateverything": "Probably because it would be very expensive and difficult and probably unnecessary considering that they are sold with close aswell as the several complaints you would get from parent and guardians", "_ussy_ink": "🌳🌳🌳", "ether_howls": "🌳🌳🌳🌳🌳🌳🌳🌳", "kermit.t.k": "Cus it’s a FUCKING KIDS TOY", "hzacks": "🌳🌳🌳", "sho.uto": "barbies r getting attacked for existing at this point...... this is rlly funny", "natashabartley_": "🌳", "dysartist": "Wow. Thank you. I am so grateful to read your words.", "redheadedwarrior": "🌳🌳🌳YES", "theteacherdrive": "🌳", "oldaccount270305": "I don’t think it’s dolls, as young children don’t have pubic or armpit hair themselves so it’s not abnormal for them. I think it definitely starts with porn. Kids as young as 8 are accessing it now", "indigo.persephone": "🌳", "frenchaud.made.me.do.it": "🌳🌳", "sadiebennett.x": "🌳", "shola_aw": "🌳", "madison.commander": "Maybe because dolls are for little kids..?", "_annakarle": "🌳🌳🌳🌳 yes to all this!!!", "thelovingpathyarn": "I have never shaved my pubic hair. I have never understood the desire to do so nor how others find this attractive. I'm all for intact 🌳.", "hrae013": "🥦", "leggyblonde1415": "🌳🌳🌳🌳", "sooziespore": "🌳", "mrsedwardsjlk": "@ihartericka i added the hair to one if my dolls full figured dolls,my daughter had questions about it so added the hair to explain to her,so she had a visual.", "weightlessinthewomb": "🌳", "miejohanne": "@karenmulleer", "karuye_": "@princessphen", "kirzly": "😂 trust, me its porn no boy sees fucking Barbie Doll and be like, \"I should shave\"", "graceandbenji": "🌲", "mariagarcia.recent": "umm wtf? it’s a kids toy. A KIDS TOY. not a fucking sex doll. if you want to sexualise a doll for other purposes then do so. but a 5 year old is not gonna have pubic hair and most likely doesn’t know what it is. why the fuck would you even say something like this?", "curlydidi": "@ihartericka Theres so many things wrong with barbie - her body proportions, facial features, a whole lot. Barbie isnt real. Also, pubic hair is a personal preference. It's a spectrum- some prefer very hairy/full Bush to completely bare/waxed. I'm sure not all of those students believe that completely bare is the best and better yet are completely hairless.", "sparklesncoffee": "The American culture and a lot of religions shame us for our bodies and desires.", "jamesmasters4": "I suffer from depression and as a woman, was always and still am embarrassed by my un groomed pubes.", "parkerwoods__": "What the actual fuck", "bermjuice": "Yes, let's all put fucking pubic hair on a toy made for children. That's definitely necessary.", "eldina_jaganjac": "🌳🌳🌳", "beef.stroganauf": "🌳🦚", "thisisbindi": "🌳", "valconnnnnnn": "sis-", "itsgussy": "🌳🌳🌳", "voodooandcaviar": "I guess ill be the voice of descent here; it traps pee and body odor, and smooth just feels better. Men should also keep their's shaved, trimmed, or neat in solidarity. 🤷‍♂️", "ae.lb": "What the actual fuck", "kimberericaj": "🌳🌳🌳", "jamilareddy": "Honestly… I’ve never understood human dolls ... period. I’m skeptical! Dolls are usually intended for people assigned female at birth to either learn how to nurture and care for a baby or practice being an adult. Idk. Makes me feel uncomfortable.", "macro_bing": "it's also a problem in print and social media; we have all these beautiful bodies represented in photos, but everyone has perfect bikini lines with no hair or pubes 🤷🏼‍♂️", "rulerclip": "They don’t have it there because dolls are made for kids who haven’t gone through puberty yet", "_kartel": "🌳", "tod_from_customer_services": "Because that would be FUCKING DISGUSTING TO HAVE PUBLIC HAIR ON A DOLL MEANT FOR CHILDREN!!!!!!", "chigirl_breezy": "🌳", "krain85": "🌳", "lariamelie": "🌳🌳🌳🌳", "hippietrashkenziee": "@barbie @mattel", "wateredwoman": "🌳", "_gavin.long_": "Wtf is this shit", "___oo_o_oo___": "🌳", "theclauuds": "Yess. PREACH!", "pot8er_boi": "🌳", "phairhead": "For me, shaving became about not wanting to look like my mother. Lately I’ve been considering growing it out", "chel_sees_theworld": "@uph25", "sofia_anai": "@german_pmartin", "summerdaleavenue": "@mr_explorer13", "littlelouiseloveshair": "I’ve recently been letting all my body hair grow out after a lifetime of waxing and plucking and shaving. That whole routine is so exhausting and i thought “why am i doing this? I hate it.” Family members and friends have commented that it’s gross, unsexy or unladylike and when I challenge “why do you think that?” all they can say is “It just is.” Ok but who told you that, because you weren’t born thinking that. Women are constantly bombarded, starting young, that body hair is gross and unfeminine, by the media/society/family/friends/etc. It really has me wondering, “where did this all start? Who decided this?” I sometimes struggle with this when i see people staring at my underarms or legs. Im definitely self-conscious about it, but i refuse to do something I hate for someone else’s comfort. 🤷🏽‍♀️", "elianarmrz": "🌳", "haileyjustbee": "🌳", "snacklynandrews": "🌳", "fridasskold": "🌳🌳", "margaretkammer": "🌳🌳🌳🌳🌳", "goodnessgraciousliving": "I wonder if they get their ideas about pubic hair because they have access to porn at such a young age. Rarely see pubes on women in porn!", "bluestbluetoeverblue": "🌳🌳🌳🌳🌳", "cptsd.hope": "Wow I had never thought about that!!!!", "kirrcollective": "🌳🔽🌳", "sensitivesultrysassy": "🌳🌳🌳🌳🌳", "makenzieboyle": "🌳🌳🌳", "dtomolson": "Late to this, but 🔥and 🌳please", "alexandrafearon": "🌳 🌳🌳🌳🙌🏾🙌🏾", "missrepresentationxo": "@ashleymoniiique very interesting", "eyla_cuenca_birth": "I could on for hours about the dolls!!!!", "burnashburn": "🌳🌳🌳", "sofiasharpe": "🥦🌳🌲🌵🎄🦔🦚 free the pubes! Free the armpit hair! Free the hairy areolas!", "brookeyookie": "🌳🌳🌳", "mj_inbetween": "🌳🌳🌳🌳🌳🌳", "larisanotlarissa": "🌳🌳🌳🌳🌳🌳🌳 took a long time for me to shed the stigma for myself!", "danilala_xo": "🌳🌳🌳", "crickettoes": "🌳🌲🌿🌵", "1sabelcaballero": "I shaved my pubs once when I was in college and I remember looking at myself in the mirror and having a flashback to how I looked as a child. Since then I've never shaved again because I want my partners to see me as a grown ass woman, not as a big child. I've had discussions about this with my friends who say it's \"sexy\" because it looks like a porn star and get really mad at me for saying it looks childlike and it's a nod to pedophillia. I think everyone's entitled to their choices, but you can't sanitize them and act like they were made in a social vacuum.", "alec_moniz": "“The resistance to pubic hair is also rooted in anti-blackness.” Lmaooo oh god", "lucinafox": "👏🏼🌳", "singsofrivers": "Most of my barbies' molds included undies??? Some even had printed-on pink undies. I always thought it was weird because I couldn't fully undress them.", "bisexual_lightsaber": "🌳🌳🌳", "juliafractal": "@ihartericka I recall a Barbie I had that had a pattern of some kind of B logo basically emulating pubic hair in the early nineties, but I think that for phased out, which is a shame.", "queeringqueering": "🌳", "symphonyofsound1": "🌳🌳", "ah.sonya": "🌳🌳🌳", "krystengrimes": "“We grow up wanting multiple homes and hating our bodies.” Could be the title of a book about being raised in the 80’s and 90’s My mom is fair skin with red hair and dad is a dark-featured Cuban. My mom wanted us to feel comfortable in our own skin so no shaving until we were much older and no mention of waxing/plucking. Printing bible verses to put on our bathroom mirror to remind us that we are beautiful. I resented that parenting decision so much bc I thought “she doesn’t understand. she doesn’t have dark hair on her face, chest, stomach, or back. Her hair is so fine and mine is so coarse.” So away I went plucking and shaving (RIP my beautiful eyebrows) Years later I realize that she was right and she did the best she could (and knew) to help us appreciate our perfect bodies. 😭❤️", "the_faux_somniphobic": "I started shaving when I was 13. My bff at the time was dating a pedophile (no lie) who made her shave. But of course she didn't tell me that until after she pressured me into shaving. So there I am, a preteen who isn't sexually active, prepping myself for something I certainly wasn't ready for. And all because some disgusting POS brainwashed a child in my class. 😖😤😖", "digginthebaldspot": "🌳", "ariannaaabb": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "barkovapolya": "🌳🌳🌳🌳🌳🌳", "siennamoriarty23": "I always hailed my mom growing up for taking barbies, pointing to them, and telling us “this is not a realistic expectation of how a body should be” but now I’m realizing as great as it was that she made that point, I still grew up thinking pubic hair was bad and needed to be taken care of. Even got the nickname “George W.” In high school when I didn’t get rid of my bush 🙄🙄", "badmovejean": "🌳", "suave.so": "🌳 i just saw a meme featuring a children's book entitled \"Brenda's beaver needs a barber\"...whatever adult who wrote illustrated and published that body shaming innuendo for children is a piece of shit.", "margogo28": "🌳 bush bush bush 🌳", "lemocko": "🌳", "madeleinelitchfield": "🌳", "sssbeat": "Wholeheartedly agree! The costs associated with doing that are too high for a business to consider though, not to mention all the parents who would boycott their products. I think painted on underwear would be just as effective (if not more so), as it removes the whole concept of perfect genitalia to begin with. I’ve always felt that the weird smooth bald lump gives such a bad impression. I don’t think we should be hiding the idea of genitalia from kids, I just don’t think a plastic mass produced toy will be able to do real people justice 🤷🏼‍♀️", "boomerangnika": "I agree with most of this but I think it's pretty hard to put hair on those places. also dont barbies often have these panties on? idk. the hair under the pits is hard to do because there's ball joints. idk if they can change that and make it look realistic.", "chantallypatton": "🌳🌳🌳", "courtney_luznelly": "Omg this is soooo true! Such valid points! Thank you.", "mamahoodandi": "🌳🌳🌳", "rocknrolljezus": "🌳", "ms.emsworth": "Have a whole forest 🌳🌳🌳🌳🌳🌳🌳", "trans_fat_alchemy": "🌳", "plus_garum_ferre": "I grew up the heyday of big, full bush. I was aware of an increase in waxing and shaping around me, but I didn’t partake. A new boyfriend asked me to wax my genitals because it was, he said, like kissing a guy with a beard. I tore him a new one. I still have my bush, although I do get my underarms, lip, and butthole waxed. The last part changed summer forever.", "adelaidelemonade": "🌲🌳🌲", "e.sage.p": "🌳🌳🌳🌳🌳", "http.alexsha": "🌳🌳🌳", "yarnklipper": "🌳🌳🌳!", "kitkatt___": "🌳", "absnoble": "🌳", "andreaolgy": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "liliamoralesmusic": "I loved Amy Schumer’s recent Netflix special that talked about pubic hair... I had no idea that millennials remove it all. Proudly full (trimmed) bush. Lol!", "em_attewell": "🌳🌳🌳", "hardfemmerising": "🌳🌳🌳🌳🌳🌳", "officialrobins": "🌳", "fiona_ralph": "🌳 yesss!", "aoieoeo": "🌳 ‘multiple homes and hating our bodies’ upside down world eh. Your words are beautiful. Your thoughts right on point.", "jeskaheck": "I got rid of it because I don’t want it sticking out of swimwear and then I realized why isn’t that normalized 🧐", "alovesupreme420": "🌳", "dandyvee": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "adrimi_luna": "❤️🌳❤", "afromoksha": "🌳🌳🌳🌳 fuck yes!", "zephrineroyer": "Your posts are so freaking relevant and on point! Thank you @ihartericka for asking those prickly questions that a lot of us have had in us (sometimes unknowingly) for a long time (me for one!). 👊🏾", "liciabear87": "🌳🌲🌳🌲🌳🌲🌳🌲🌳", "timelapselah": "I Totally agree with you... I am very hairy and I got To Like It more and more. My hair color is blond but people and even friends tend to tell me that they don't see me very hairy as it's a compliment and I am not comfortable with that. I am hairy, it's beautiful and That's it... Ericka and Eb, you are amazing!!! thank you for accepting All of us ❤❤❤", "river.west.79": "🌳", "ceceschemm": "@larissaschemmann", "medicallyanantique": "🌳", "emmyjane333": "Also its a common thing for people to say that pubic hair is unhygienic! Whats ur take on this!", "hazeljives": "🌳 I had to type tree not bush. Let’s get a bush emoji.", "sardonyxjade": "🌳", "janefriday": "🌳", "riobates": "🌳🌳🌳🌳🌳🌳🌳🌳", "puravidaconelperro": "🌳", "beaveramanda": "🌳", "danandleslieb": "🌳", "kandizzle2495": "I thought everyone had just accepted that barbie is a drug dealer 😂😂😂😂", "shafjodi": "🌳", "yesitisbeautiful": "🌳", "jenpdarling": "🌳🌳🌳🌳🌳🌳🌳", "literallyjusme": "Damn.. This hits home.. I started puberty early as fuck, at 8 yo, and I remember when I found my first strand of pubic hair and wanting it to grow so I never shaved down there and I, of course, had a bush by the time I became sexually active. Anyways, I'd gotten dudes that didn't mind pubic hair so I became comfortable with it tbh. Until I started falling for this one dude and he told me that he wouldn't even put his face near there until it was shaved because it was \"nasty\" and \"unsanitary\" and it did hurt cause I dont mind giving head even with pubes which is what I did with him but he literally wouldn't give head until I got a wax. So ever since then I've been waxing and feel insecure when it gets even a little fuzzy even though I know pubes or not I keep my shit clean. Idk this post jus came up at the perfect time.", "glgarciaa": "🌳", "va4mf_wolfmama": "🌳 💓", "yolnahari": "🌳", "nayyirransome": "🌳🌳🌳🌳🌳🌳", "miabunn": "Well if everyone shaves then crabs are out of business. And well ...less BO😆", "jundawoo": "🙏🏽 Comes from porn culture too. As a physician have seen many skin infections and ingrown hairs.", "mkjpepper": "🌳🌳🌳", "caprisun.bitchrising": "🌳🌳🌳🌳🌳", "prajbot4": "🌳", "shenannaganss": "🌳", "_dday": "🌳", "ranilovesmax": "🌳🌳🌳", "plague_ratoncito__": "🌳", "allydean3": "🌳", "noir_twins": "🌳🌳🌳🌳🌳", "andrealndstrm": "🌳!", "sonja_1988": "🌳🌳🌳🌳", "cuc_et": "🌳", "chloepekel": "My friend told me she was embarrassed to shave though because she got bumps and had to tell her everyone gets bumps and its normal cause you have irritated very sensitive skin. You can't win! If your partner makes you feel shit about any decision you have made with your public hair, dump them.", "zohameanslight": "🌳", "myfitlife": "This is definitely a topic that needs to be addressed", "gabalanche": "@grapefruitzest c a p i t a l i s m", "sashkarothchild": "🌲", "issymintz": "🌳🌳🌳", "bonesmarioni": "🌳", "leighanndwg": "🌳🌳🌳", "waitwhhaaat": "🌳🌳🌳🌳", "maharvie": "🌳", "dustylibraries": "🌳🌳🌳", "treehuggr69": "🌳🌳🌳", "emileamusic": "🌳🌵", "kitt.katt._": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "m.ire.poix": "I hadn't even thought of it. Thank you and your students. 💜", "kristinemccourt": "🌳🌳🌳🌳🌳🌳🌳🌳", "foolishg.irl": "🌳 🌳 🌳", "creature_comfort": "🌳🌳🌳🌳", "k_lindo": "🌳", "authenkitticity": "🌳🌳🌳", "triosadventurer": "🌳!!!", "moonstruckscorpio": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "cookesinead": "🌳", "bigearthmama": "🌳🌳", "whishb0ne": "🌳🌳🌳", "willmederski": "🌳", "artisticking": "FUCK BARBIE", "bqwertyme": "🌳", "katyyanda": "✨✨✨", "seafalcone": "I WANT HAIR EVERYWHERE 🌳🌳🌳", "milljpet": "🌳💚", "feeling_full": "Only humans that actually look like that ^ are under the age of 12. Scary. Food for thought", "ladysasquatch": "🌳🦚🌳", "hotsaucejoce": "🌳", "sanpapi_": "🌳", "k_now011": "I wonder where barbie works?!!", "___jessicahannah": "🌳", "themeriwether": "🌳", "tsh.nyc": "Where does Barbie work 😄😄😄", "chelseahlawrence": "🌳💗", "m.roeh": "🌳", "bernbernieberna": "🌲🌳🍀 Yes!", "fatbloodandbones": "🌴", "rachaelrenk": "🌳🌳🌳", "pureintenntions": "Wow i just love you so much. There's so many things that I was brainwashed with and didn't question. I never even thought of this and I agree when will they have body hair? Granted I didnt play with dolls I was much more into the big bratz heas so I can do their hair but had I seen a doll with thick dark arm hair, long sideburns, hair on their belly on their butt and genitals. My mommy would have probably gotten them for me. Especially with me having pcos. I got hair in places very early on and I even have facial hair. Wow ona daily i think about that question you asked a while ago about \"when did you know you were black\" and I couldnt answer it because I had felt I thought I always knew. But then I think about my education experience and I'm like \"oh yeah this is it\" it made me second guess relationships I have/had with teachers. I just wish I had you growing up to teach me about sex ed and to love my body and to validate that it was okay that I loved to matsturbate and explore myself. Keep doing this Ericka. Im telling you this is your calling. You change my life now and i get just a snippet man oh man if I had you in my adolescent years I would have made less mistakes.", "wildtenderness_": "🌳🌳🌳", "youhadme.atblack": "That would be a cool doll. Normal human beings.", "_erfishman_": "🌳🌳🌳🌳🌳🌳🌳", "carolineisangry": "🌳🌲🌳🌲🌳🌲🌳", "linafalkeling": "🌳🌳🌳", "zandii_outta_control": "These were my exact thoughts about dolls as a kid. Why were they so different as far as a man and a woman goes but Barbie didn’t have the genitals that I had? Why did Barbie not have hair down there or up here or over there? I thought something was wrong with me as a child in more ways than 1 and it was all because of my Malibu Barbie", "sabiduria_floreciendo": "🌳", "katecarli": "🌳", "samgamfam": "🌳🌳🌳🌳🌳", "courtney.has.words": "🌳 🙌🏾🙌🏾🙌🏾", "crisftw": "🌳🌲🌱☘️🌳🌿🍃🌾🌳", "taliastormx": "🌳 free the Bush", "shelbybumble": "🌳", "mareliski": "🌳🌳🌳", "j_a_zarifian": "🌳", "maumag4": "🌳🌳🌳", "jocelynchmelyk": "🌳🌳🌳", "wesleybrook": "🌳", "ankhduality": "🌳🌳🌳", "kaijckmn": "🌳", "geewally_": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "ingridurr": "🏡🌲🌳☘️🍀🌱🌿🍃🌵🎄💐🌹", "honoredintuition": "🌳", "andrealkeating": "🌳🌳🌳🌳🌳", "endlessbutt": "🌳🌳🌳🌳🌳 i'm not shaving this bush for nobody!!!", "thisischrystian": "🌳", "shonaghmacrae": "🥦🌳🍀🌾 I’ve decided to rock out with lush armpit hair French style! Still waiting for full luciousness to arrive!", "anna.elizabeth.sue": "🌳🌳🌳", "reclaimingida": "🌳#decolonizepubichair", "be_my_wilderness": "🌳", "nydiasimone": "Never thought about that.", "jackienikpour": "🌳", "blk_hrt.drk_rts": "I remember running around the house screaming excitedly about getting my first pubic hair! I DEF think Barbie needs a bush 🌳!!!!! For sure nipples would be great too! Ken could use some hair on his bod too", "ediestarktherapy": "👏🏻👏🏻👏🏻👏🏻👏🏻", "vidaglows": "🌳💚🌳💚🌳💚🌳💚🌳💚", "_.foa._": "🌳🌳🌳🌳🌳", "tatiekaggart": "🌳", "maggiemunkee": "🌳", "0erika0": "🌳", "rubydanger": "🌳!!!!", "glitter_robot": "🌳🌳🌳 & instilling creativity early on w our pubic hair 🌲🌲🌴🌵🦚🌾🌿💥💥💥", "sweetheartstjohns": "Love this! Free the bush❤️💯", "isaverybelle": "🌳", "couryincolour": "🌳🌳", "tawnamarina": "🌳 🌳 🌳", "katherine.with_a_k": "🌳 Bring back pubes!", "evaglamaris": "🌳", "plant_baby_sex": "🌳🌳🌳🌳🌳🌳🌳", "treevuhh": "🌳🌳 My 6yr old son the other day said he knew I was a girl cuz I had pubes and he had never seen his dad with some (he keeps his area pubeless) and he didn’t have any. It was quite the convo to explain to a 6 year old that all adults get pubic hair. Simply some choose to cut it. I ended up saying something like its just like everyones different types of hair on their had we all make our own choice and we are all different. Some keep pubes and some don’t. How odd tho that he had constructed this idea purely from lack of education paired with observations. I hope I guided him right on that. Cuz your post has me thinking even harder about it 💭💭💭", "citticippi": "🌳", "butterandsnacks": "I definitely drew pubes and nipples on my barbies", "gardengirl_eden": "🌳", "pyrrhicx": "🌳🌳🌳🌳🌳", "ez.radical": "🌳🦔🥦 for my adolescent self who refused to wear shorts (or bikinis!) because of the ingrown pubic hairs that extend down my inner thighs", "mx.samsantos": "🌳🌳🌳🌳🌳", "chynamonique_": "@aarondeadalus", "arianazeee": "Yesssss....this is so necessary 🌳🌳", "dreadfuljayy": "🌳🌳🌳🌳", "tayla2801": "@robbie_sd13 I had the same conversation with you", "nearsightedwoman": "Do you all remember the Disney Movie “Fantasia?” I remember distinctly watching it as a child and there was a weird trippy scene with an evil witch like woman who had prominent nipples, whereas all of the good, pure women had no discernible nipples. I was pretty young, so maybe I’m not remembering that correctly. But I’m wondering if puritanical society sees a lack of nipples and pubic hair as a woman being under-developed, and therefore not aware of her sexuality? When a woman is not outwardly sexual in her behavior she is deemed as “pure” (and also, assuredly, not going to have high expectations of her sexual partner). Weirdly, men feel free to sexualize the asexual woman for their own gratification while the woman who is sexually mature and wants to achieve sexual satisfaction is considered “dirty” and “evil” and “scary.”", "playingwithcolor": "I’m 79....I don’t think that hairless pubes were a thing when I was young!", "alidiaaaaa": "🌳", "j.hope_lilz": "🌳, they need body hair in general, plus... Nipples? The breast are not a sexual organ so why shame it", "seinmaestro": "I AM A BUSH BABY!!!! 🐑🦔", "elainaelena": "🌳", "birdsandbones": "This is an excellent point. My very buttoned-up mid-western granny handmade me a doll with a little heart and underarm and public hair. It confused me as a young kid, but remember feeling comforted by it as I started puberty.", "nina_tame": "It’s always struck me as a bit weird that anyone would want their vag to look like a child’s 🤢 I like my bush to be MASSIVE 🙃", "lilykoihawaii": "Pubic hair is the best jackass/fuckboi deterrent ever. Ever.", "roam_roam_honeycomb": "🌳", "ellalabellaaa": "🌳🌳🌳🌳🌳 a whole forest of trees for this idea", "meitnerium268": "🌳", "cassidyjemo": "🌳🌳🌳🌳🌳🌳🌳❣️❣️❣️", "wheelofashes": "🌳", "thelittleghost": "@easylovemusic duuude", "messytessie": "🌱 that 🌳", "kate.e.mckenna": "🌳🌳🌳", "softgarbage": "🌳🌳🌳🌳🌳", "kizzykells": "Personally, I wish my bf would at least trim his hair because I’m tired of picking pubes out of my mouth 😂😂🤣😂. I get the job done regardless. Again, just my preference.", "wrecking_ball_8": "🌳🌳🌳🌳🌳🌳", "jurbston": "🥦🌳", "heysurah": "PREACH! I love being a hairy woman. 🔥", "paralasestrellas": "🌵🌴🌳🌲", "frankie.mxsgendered": "When I was little I had a Barbie hotdog stand. So . . . I guess she's making all that bank running a front organization? A pubeless Barbie slinging hot dogs doesn't make much sense", "bleedingartsclub": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "more.unfucking2do": "🌳🌳🌳", "ssuberman": "#putapubeonit 🌳", "iamkarenalexander": "🌳", "kyoko.nagahashi": "🌳🌳 just get rid of Barbie 🤮", "juanamille": "🌳", "makpatata": "🌳", "cursed.kaiser": "Barbie doesn’t have pubic hair cause of capitalism lol...they used to paint her panties and now they just don’t cause they don’t want to pay for the extra paint anymore...as for why she has that kind of figure she was based off of Bild Lilli, she was a sex worker who starred in comics, who would later become a kind of “sex” doll. This doll was created with men’s ideals of a “hot woman” at the time in Germany (tall, skinny hourglass, aryan AF with blonde hair, possibly hairless down there.) Mattel bought the copyright, then brought the doll to the US and changed her up a bit to become what we know as Barbie. TBH she hasn’t changed much since then aesthetically. There are other toys that actually depict children as children and are sold to kids but they ain’t as popular as Barbie unfortunately which can have a toxic effect on how kids view themselves/their bodies. Lol I could go on when it comes to toys and child psychology. 🌳🌳🌳", "msmayafelix": "🌳🌳🌳 YES. There are barbies with every hairstyle imaginable now but still not a single one with any hair from the neck down?! Women with body hair not being represented ANYWHERE publicly just makes it feel like a big shameful secret - especially to young people! Most young women and girls I’ve spoken to on this thought that it was absolutely necessary to remove all body hair as soon as it started developing as they thought it was ‘unhygienic’..", "salientia": "Just gonna point this out, Barbie has a shit ton of jobs, she literally does most professions. I don't disagree, I'm just saying.", "akaylainprogress": "I’m so pro pubic hair, but as mine grows out it gets so uncomfortable that I wax every couple months. I get mad ingrown hairs and the like. So if you have a pubic hair care regimen, I would loveeee that. I’ve tried so many different things but nothing really sticks.", "megawheeze": "🌳", "johanna_eh": "🌳", "tamarahusseini": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "_diaye": "🌳🌳🌳🌳🌳🌳🌳", "gissel_grizzle": "🙌 great post. So much of who we are isn't dictated by our true core, but the beliefs of others who know nothing about us.Ain't that crazy. We h", "pastel_pwussy": "🌳🌳🌳🌳", "danihallingxo": "@megan_rose_lane think you would equally appreciate this🙌🏼😂", "rbentrepreneur": "Yes! Children are trained as such an early age to feel shame around their bodies and sex. More 🌳🌳 please!", "elerzaberph": "🌳🌳🌳", "robynmackinnonart": "🌳", "frizzkidart": "🌳", "kmzmich": "🌳", "cinephile": "🌳🔽🌳", "tastes_like_daisy": "🌳 I’ve been shaving since I was 16 due to my first boyfriend telling me I should. It’s engrained in the minds of men and women that a smooth hair free vagina is the expectation and this makes me so sad :", "patty.grimmer": "🌳", "trurinny": "🌳!!!", "claracharmak": "🌳🌳🌳", "orchiddelerium": "🌳🌳🌳🌳💙", "bren2d2": "🌳🌳🌳", "poodpie003": "🌳", "anyalud": "🌺🌻🌼🌸🌹🌳", "theletterzee": "🌳 ALL! THE! WAYY!!!", "edtcontd": "🌳🌳🌳🌳", "badwolf_onrice": "I remember the first time I saw my mum's pubes and I thought something was wrong with her! I was like 7. 🙈", "peregrine_starr": "🌳", "_thisisem": "🌳", "tgrbass": "🌳🌲🌴🍁🎄🎋", "lozervirgo": "🌳", "knoepf.chen": "🌳🌲🌵", "alexandra_corvidae": "🌳🌳🌳", "mrseapm": "🌳🌳🌳", "madelines_mantras": "Yess🌳🌳🌳", "katy_kop": "🌳 yes!", "katherinespence": "🌳🌳🌳🌳🌳", "cornelius_mackie31st": "I want to add that I prefer and request that my lady either have pubic hair or she should grow it. At first for a few who don’t have pubic hair I bring that up in conversation along the way and say I rather you be natural from time to time with a full growth of pubic hair and they’d say I have hair now but I’m usually waxed down there. I’m like keep it natural it’s more exciting. Most ladies I’ve found who don’t shave these days are the 40 somethings ladies when porn had nothing but a huge bush. It’s the 30 somethings ladies who grew up after Dru Hill’s Thong song is when I noticed the big change. But the 70’s porn had bushy Kats and oh how I love them today. But it all depends on your body after a good close shave if it can resist ingrown hair making it itchy and uncomfortable. Pubic hair is so normal and beautiful. I shave my ball sack and trim above my shaft because of heat only. But in the winter I full grown. I like the pubic hair nappy or curly but I prefer it nappy. 🤷🏾‍♂️🤳", "devdoee": "Points were made!", "jwienholts": "🌱🌵🌿🌴☘🌲🌳🍀🌴☘🌵🌱🌿🌲🌳", "nubianfelinity": "🥦", "jae_avilezzz": "🌳🌳🌳🌳", "quantumqueerentanglement": "🌳🌲🌴🌵🌳", "whatisthehalflifeofloneliness": "🌳", "kimchiichica": "🌳🌳🌳🌳", "talullahspies": "🌳 🌳🌳!", "jocelyn.lavon": "🌳", "e.eeluz": "🥦🥦🥦🥦🥦", "rgoodstein": "Bahahaha, 🌳", "dangthatsdank": "🌳🌳🌲🌴", "whatmakesmetiff": "🌳", "cucklord_666": "🌳🌳🌳", "jssrmndx": "🌳", "_saroba_": "🌳", "downntempo": "🌳🌺🌳🌺🌳🌺🌳🌺🌳", "downntemppo": "🌳🌳🌳🌺🌳🌳🌳", "emilymahiai": "Yessss 🌳", "teadrinker23": "🌳🌳🌳", "franksnobeans": "🌳 🌳 🌳", "tanisalexis": "🌳🌳🌳🌳🌳 Yes!!! Ive always worried about this resistance around hair and wondered if it stemmed from this sort of thing.", "_tessellation_": "🌳", "bo_archive_scraps": "🌳", "mc.emartin": "🌳 🌳 🌳", "cassiopeiacrows": "🌳", "caryluna1": "🌳🌳🌳", "missfield999": "It's time!!", "net.imler": "🌳", "dreadysetgo": "And can we talk about how most of the kickback comes from other women! My husband loves my bush, hairy legs and pits, because he loves ALL OF ME. But my mother and sister will be the first to make Chewbacca jokes and sneak diss.", "yourmamadressesfunny": "🌳", "briegz": "🌳", "thetendertender": "🌳", "cee.ess.vee": "🌳", "katrinamdonahue": "🌳", "peters__kelli": "My 11 year old wants to shave because of her period. She says it’s messy and I don’t blame her. I just haven’t decided it I’m going to allow it yet. She could care less what it looks like.", "hatucker7": "🌳", "funkycatcrochet": "🌳", "leonne11_": "Free the bush 🌳🌳🌳 always!!", "sarahaile": "🌳", "waltta_kadane": "🌳", "nicolenewblack": "Never join a twitter discussion on body hair. Folks swear having public hair is unhygienic and leads to infection - adults proclaim this from the rafters all loud and shit. The same ones advocate for the circumcision of babies and it’s super disturbing.", "martin.mulberry": "🌳", "urbanbuppie": "Sis. This line “we grow up wanting multiple homes and hating our bodies” 🤯🤯🤯🤯facts and truth!! Also the convo linking the shame of pubic hair and anti blackness. I was 13 when my sister went to college( a very white one). She came home once and told me how her black curly haired bestie was shamed by her all white roommates for combing her hair in the bathroom because it reminded them of pubes 😒😡🤬it was eye opening to learn that’s how they view us and our natural state.", "sheadyy_shea": "🌳", "caitkacz": "My buddy's girlfriend was talking about getting a Brazilian and I said something like \"oh I wouldn't know, I've never had one\", and she looked at me like I was cr*zy because I didn't wax it all off.... To each their own I guess, seems expensive and painful 😂", "heatherrmanley": "🌳", "_in_between_spaces_": "🌳", "kaygracea": "🌳❤️🌳❤️🌳", "annabellemaginnismusic": "🌳🌳🌳", "clare_miklaunus": "🌳", "yel_lo.e": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "daria_ann_poet": "Barbie works as a doctor, dentist, vet, Olympic gymnast, ballerina and in retail...to name a few. 😂 But I think they want to desexualise Barbie for the kids (to an extent.) breasts give her the aspirational “womanly” profile Mattel wants girls to see. But they are desexualized because they lack nipples. No pubes, No genitals, no nipples...I know nipples aren’t inherently sexual but they are often viewed that way. You can see all the cleavage you want but one nipple and its soft core porn. I think she has no pubic hair for the same reason. I even had barbies with painted on panties. Not sexy grownup panties. Little girly panties with swirly letter B’s printed on them.", "kimmy.hale": "I totally had a knockoff barbie that had wavy little pubes molded into her pubic mound. I was little and thought she had worms for a while.", "2hellandback_": "They dont have hair cause thats extra work and money for companies", "aphrenarave": "🌳 yessssss!!! This has been a huge thing for me recently. My nieces are getting to the age that “they should shave their legs” but they’re still so young! This is an awesome post, thank you.", "itsjuustliz": "🌳🌳🌳🌳🌳🌳🌳", "adultbabe": "A doll with a full bush that you can trim to your liking?!? ERICKA!!! This is brilliant. Patent that and let some corporation give you all their money! 🥂", "shanna_lee": "🌳🌳🌳🌳🌳", "localmija": "🌳", "thetropicalthunder": "🌳🌳🌳", "fit.mad": "🌳🌳🌳", "a.happy.sunflower": "🌳🌳🌳🌳💖", "_ellitt": "it would also be great to have dolls with bodies that aren’t cis. diverse dolls!!🌳🌳", "moontwerk": "Don’t get me started on how this is also related to the idea of people wanting others to have younger seeming bodies. For some. Not all. But some.", "m_eknight": "What I love about @ihartericka is your voice is an echo. We all have to challenge our internal dialogue about what it means to be #black, in doing this uncover this anti-blackness. We might find it on our clothes, in what we speak, or how we appear in the world, we might find it in our spouse. Your voice is a challenge to illuminate.. #✊🏿 #🌳", "fancymustard": "🌳", "shani_lee_soriah": "🌳", "sexandempathy": "🌳🌳🌳🌳🌳", "ameliaresists": "🌳🌳🌳", "toenopawfull": "🌳 🌳🌳🌳🌳🌳 love my full bush, hairy pits, and hairy legs.", "starrbusby_alive": "🌳", "ak__the_great_": "I had a partner who is a non-binary femme who LOVED my pubic hair, and all my body hair for that matter. Say yesssssssssssss to the bush!!!!! They changed the game for me, and I never looked back!!! 🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "demire_johnson": "🌳🌳🌳", "_nikole_d": "🌳", "rockingmama": "🌳🌳🌳🌳 or in my case 🌲🌳🌾🌲", "liv_garrison": "🌳🌳🌳🌳", "alanna_macenery": "🌳🌳🌳🌳 I stopped shaving years ago and it’s very liberating to just not worry, I’m glad my kids will grow up with a mom who has body hair so they will not have unrealistic expectations", "ambrosia_the_nectar": "@ihartericka hiii do you have any tips on moving into sex Ed or getting sex Ed training in the south?? I’ve been doing research and it all seems so complicated. Not sure where to start", "hotmessmolly": "I used to think I was dirty because of my pubic hair. I would then obsess about it which only made me feel terrible. Teenagers should not be worrying about their pubic hair, in fact no one should.", "katertotthegreatertot": "Do you think the shaving/grooming of pubic and body hair in Islam is a result of colonization? I’ve pondered this. Especially since many of the people abducted for slavery were Muslim", "charleyroxy": "🌳such a necessary conversation 🌳 Thank you!!!", "chelsea_rath": "🌳 bush it up, Barbie", "avocadadii": "🌳", "suzponomarenko": "@danceinfinitely", "12lizzie12": "🌲🌳🌴", "__harlot__": "🌳🌲🌴🌳🌲🌴", "annamariepries": "🌳", "feminist_brain": "🌳", "katakeela": "🌳 🌳🌳🌳", "ddeloach01": "🌳🌳🌳🌳🌳🌳🌳", "motherofgirl": "🌳🌳", "dahnoonie": "🌳🌳🌳🌳🌳🌳🌳", "willowtreebrook": "🌳", "charrua__": "🌳🌳🌳🌳", "portiaferrari": "🌳🌳🌳🌳🌳🌳🌳✨✨", "ksshesaid": "🌳", "exhale_blue_bird": "🌳", "blurredbytheheat": "🌳!", "katayounjalili": "People have asked me several times if my bush is even real or if it’s a merkin! I’m a performer and do a lot of naked shows...", "my_hipster_sister": "🌳", "jackie.eberle": "🌳🌳🌳🌳🌳🌳", "carolineroh": "🌳👏!!!", "ichbinberlyn": "🌳🌳🌳🌳🌳🙌🙌🙌🙌🙌🙌", "messinaeve": "🌳🌳 pubic hair and body hair", "luna.ticks": "🌳🌳🌳", "elisacourtway": "🌳", "ashtonic7": "🌳🖤", "grazehoney": "🌳🌳🌳🌳🌳🌳🌳", "minda_price": "🌳", "ever_green_living": "@ihartericka thank you for sharing your insights on the body specially with your clear and open insights on sex. As a mom of a little boy (4) I am trying to beware of messages I might unintentionally be passing along and what topics I myself might be believing or holding on to. It’s just so mind blowing still to how confusing and such mixed messages on sex and our bodies. So again thank you 🙏🏼 ❤️", "freya.e.n": "🌳", "lsmvo": "🌳", "janashareswithyou": "I find it erotic on both men and women. I’m more into a tamed/trimmed look though, ‘cause I’m not going there to floss my teeth either 🤷🏻‍♀️", "jenjenrivas": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "lizziedrippinn": "🌳🌳🌳🌳🌳", "tactilestudiosltd": "🌳🌳🌳🌳 100%.", "dimabunda": "My topic @ruthfraukec 🌳", "tru_rose_beauty": "🌳", "ratchetmomo": "@sh_kan_tyu @duh_ree_ann @sarcastictone", "leatamae": "🌳🌳🌳", "je.suis.desagreable": "🌳🌳🌳🌳🌳🌳💝", "dodo_tsekhosh": "🌳🌲🌴🌲🌳", "handonmyass": "🥦🦚🌳", "sadmayonnaise": "🌳", "pickflick": "🌳🌳🌳", "its_natashac": "🌳", "b_____mh": "My only thought is I stopped playing with Barbies before I had an idea of what a bush even was... maybe they’re more intended for children who aren’t sexually aware yet and aren’t at a point in there life where having a bush is normal so playing with dolls without bushes is normal. I mean sure add the bush but from my experience it was ALWAYS men who gave me the negative vibes around pubes and that was only at the age I actually started having pubes. Just my thought and my experience. Change Barbs all you want but we still need to teach our men/ and whoever else to respect our bush.", "sadhbh_o_maonaigh": "🌳", "cassinprogress": "Hell yes 🌳🌳🌳 so tired of pube shaming. Hate to think of young people feeling like they have to shave to be desirable and sexual. Fuck that.", "melaniewinter_": "🌳 ALSO WHERE ARE THE NIPPLES!?! @instagram learned some shady ideas from these same dolls I suppose", "bri.farber": "🌲🌳🌴🌵Bush celebrations! Hairy legs pits arms chests backs faces!", "lasvanetas": "🌳", "punkanddisorderly_": "🌳", "neemdreamz": "🌳", "lilcryan": "🌳🌳🌳🌳🌳", "courtneymariemusickharvey": "🌳🌳🌳🌳🌳🌳🌳", "jessicakilljoy": "🌳 yes chick 👌", "dontlookatmegoose": "🌳", "dontastorey": "🌳", "mortilfjell": "🌳", "monika.blue": "🌳 I’m also for dolls with genitals. It would make teaching sex ed so much easier if kids already understood their anatomy.", "jellybeanjanine_": "🌳", "seafennel": "🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳🌳", "theaxltd": "AMEN -- All Of This 😩👏🏽👏🏽👏🏽👏🏽👏🏽 Celebrate The Bush & Yeah Where Does Barbie Work???!!!", "hannahthuva": "🌳", "10.twenty.40": "I’ve had so many white people tell me my hair feels like pubes and it’s really rude", "dutchessofbedlam": "My eight year old nieces told me I was disgusting for not shaving my pubic or underarm hair off. Out of the mouths of babes.", "luisanananan": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "gemjamart": "In for a penny, in for a pube(s) 🌳", "_drbug": "🌲🌳🌴", "__allie_": "🌳", "makelemonadewithlupus": "🌳", "socambeck": "👏🏽👏🏽👏🏽👏🏽", "_dianapartel_": "🌳🌳🌳", "brittcasavant": "🌳🌳🌳🌳🌳🌳🌳🌳", "pvnderthighs": "🌳", "meganjoymay": "🌳🌳🌳", "livloves_": "🌳!! i’ve also found i enjoy sex more when i have pubic hair vs when i waxed/shaved", "saraaborden": "Barbie simultaneously has all the jobs and none of the jobs. I would love to see dolls with body hair all over, pubic, chest, arm pit, etc. But I admit, I would take great joy in watching the pearl-clutching that I'm sure would commence.", "chane1_baby": "I mean yeah if you’re gonna sexualize a doll to that degree why not give them natural body hair? Why don’t the men have body hair under their armpits or on their chests if they are like 25 years old? If anything, make it so they wear underwear instead of having them be completely naked. Never knew that distaste for pubic hair is rooted in anti blackness, but I can definitely see that connection.", "__advaitha__": "🌳", "rachcp3": "🌳", "bearlycare": "🌳", "doinjstpeachy": "Its kinda weird cause like barbie is an adult but she's for a child to relate to and most children don't have pubic hair.", "castaneda9618": "I think completely shaving down there is disgusting. It seems to child like to me.", "atomic.balm": "🌳🌳🌳🌳🌳🌳🌳", "daniellekuhlmann": "🌳!!!", "bri_yawning": "🌳", "hazelmoon__": "Yes definitely 🌳", "jessierodger": "🌳", "theolivetreesandthemoon": "🌳🌳🌳🌳🌳 For life!", "forgymua": "🌳🌳🌳", "monique_wolff": "🌳", "heyitsmekita": "🌳", "bryonydiamond": "It’s so sad that not only as it seen as unattractive but it’s also (mostly on women) been branded as unhygienic when that’s literally the opposite of what it is. I never really thought about dolls but I can absolutely see how it adds into the normalisation of this shit x", "_deebear": "🌳🌳🌳🌳", "bethanybumbleb3": "🌳", "cornblakes_1102": "🌳", "filmcinemamovie": "🌳", "ratchetlenni": "🌳", "lalajazzy": "🌳🌳🌳🌳", "lu_martig": "🌳🌳🌳🌳🌳🌳🌳🌳🌳", "stephaniemackley": "🌳", "_rhetoriq": "🌳🌳🌳", "anybodyanything": "🌳 and a reminder that you can find pre medieval texts with prostitute characters that waxed their pubes!", "ladamaaz": "🌳", "malisa_shae": "🌳🌲🎄🍀🍃 100000% on point. Also, it seems that including genitalia would be so normalizing and help us to learn from childhood that genitals are not inherently sexual and should not be automatically sexualized. Also, why do neither Barbie nor Ken have nipples?", "pocketship.co": "I shaved immediately after getting my first body hair. I lied to my parents/pediatrician for years, saying I didn’t have any body hair, because I was disgusted and ashamed of my body. I also hid my period for years, but that’s another story. Puberty was super hard to come to terms with.", "sarahpalisi": "🌳", "therecoverycloset": "🌳!!!", "theotherrosy": "🌳", "pansypxwer": "Pubic hair is a blessing we should all appreciate 😩 my man doesnt mind at all that I let my pubes grow. He still goes to town on this cat 🤪🤣", "earthtojones": "🙌 🌳", "russianvampp": "🌳🌳🌳", "theyaremagic": "🌳🌳🌳", "lreasons": "🌳🌳🌳", "andreeasm80": "🌳", "pizza.hat.guy": "🌳", "herbnhood": "I'm glad you're speaking on this 🌳", "ktladymay": "🌳love this", "grider.mtaylor": "🌳", "nessaposton": "🌳", "the_lez_bear": "🎄🌵🌴🌳🌲", "reagankimzey": "🌳", "denisebug": "🌳 for sure!!", "kieranblake": "🌳🌳🌳🌳", "lorajeankelley": "🌳🌳🌳", "paper.lune": "🌳", "catchynoun": "I love this post... I do appreciate that she doesn't have nipples though 😍😍😍", "shyvolcano75": "Hellz yes. Also why the vacant smile?! I want to see RBF Barbie or Melafuckingcholic and/or Fierce Barbie - with BUSH. 🌳", "pbthecharmed1": "🌳🌳🌳", "kristinannehm": "Goodness. In the summers my friends and I have a spot where we swim naked (it's the local naked swimming spot, everyone who goes there, old/young/families are all naked). Anyways I remember one summer a friend agonising over whether or not she should shave all her pubic hair off, or leave a strop, and literally wondering what other girls she knew might be doing, so she could be just like them. I was like honey, just do what you want! I could hardly wrap my head around someone caring so much about pubic hair, and what other women's vulvas might look like!!! Our society does us so many disservices. Growing up in Europe I definitely missed a lot of this nonsense, depending on which country, body hair is usually *not* a big deal like it is here (US).", "jack.king.goff": "🌳🌳🌳🌳🌳🌳", "tylersojourner": "🌳", "apple_is_life_": "If your partner makes you feel like you have to shave anything —dump them. They've internalized so much shit and are projecting", "hair_by_gina": "There’s a video @willowsmith posted of her practicing archery and she had on a sleeveless top that exposed the hair underneath her arm and people criticized the hell out of her for it. First of all she is a child(or was a child at the time) and who tf are you to tell her to shave it or shame her for having it?! I never understood why people cared so much about someone else damn body and how they choose to embrace it. Now there’s a body hair glitter trend happening! I’m not rolling up my damn pubic hair to make others feel comfortable; you gone get what I give you. PeriodT. Thanks @ihartericka for always shading light on things we all seem to over look. 🙏🏽", "professorjohnston": "🌳💕", "moolosttheirmarbles": "🌳🌳🌳🌳", "_oroori_": "I wonder will pubic hair lead to adding genitalia (anatomical correctness)... and then we got to get deep into the whole what gender to assign to genitalia fight again.... maybe if we could give dolls areolas and pubes and just go- I’d be for it.", "keelsmillss": "🌳", "melissalynnel": "There’s a documentary about the company (I only made it half way through) detailing the pressure to make a “diverse” set of dolls. The women are so clueless and ignorant. It’s all just marketing, they don’t actually give a sliver of a shit about representation.", "pisces_dreamboat": "🌳❤️🌳❤️🌳❤️🌳", "n.c.ourager": "🌳", "jazzgoldman": "🌳🌳🌳🌳", "lalalala_leslie": "My best friend cut the hair off her Barbie's head and glued it on her vulva when she was a kid. One of the many reasons I fell for @primatemetals 🌹", "metricdisco": "Hahahah “where does Barbie work?” took me out 😂💀", "mikayla_mal": "🌳", "helsalsa": "🌳", "bluebird_momma": "I played with Barbies my whole childhood and this NEVER crossed my mind!", "mollyrstern\nVerified": "Verified", "sailing_home": "🌳", "freerangemeggs": "🌳", "damnitkeely": "I don’t disagree but maybe they don’t because they don’t want to sexualize kids toys", "aichalives": "🌳", "juicyjenks": "🌳🌳🌳🌳🌳", "dontbeeaskingmehowtosaymyname": "Oooohhh, I remember in college when I shaved my head to go natural, I was suite mates with one of the most beautiful women I’ve ever known, and she’d just cut her super long hair into a sharp bob so we were talking about hair. I was soooooo excited to be natural again after over 20 years of perms so of course I was in love with my short spiraling, coily hair! She yelled something about how gross it was, how it looked like pubes, how it better not be all over the bathroom. It was terrible. Especially considering the fact that we were studying similar things and I was looking to choose her as my older mentor. Womp, womp, womppp. Sometimes the universe just chooses for you lol, so glad I didn’t have her small minded ass living next to me for long.", "deadnettle": "🌳🌳", "fibrofag": "damn. I've never even thought about how this could be rooted in antiblackness (though obviously I'm white, so I have the privilege of not having to think about that). thank you for opening my eyes wider as always! I would love to see dolls with not just pubic hair, but body hair in general! where's our barbie with thick visible arm hair and leg hair? where's our barbie with pit hair and a mustache? so tired of the eurocentric view of \"perfection\" displayed on barbies", "fernmarx": "🌳 definitely, it's time!", "jordanisjustfine": "🌳", "jenniesara_": "🌳🌳🌳🌳", "bizreitsma": "my mom always told me that barbies are wearing “body suits” and that’s why they don’t have genitalia, nipples, pubic hair, rolls, etc. she would say they aren’t naked but simply in a flesh colors spanx suit lolol", "_emotional_eggplant": "🌳 @ihartericka thank you for sharing this. Something else I always wonder is if this ties in with how much we want to infantilize women in our culture...", "clanktopus": "🌳🌲🎄🌴🥦🥬🌵", "njmural": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "_msiku": "Ive had that at school “your hair looks like pubes”", "lubadalu": "🌳", "gregariousali": "🌳", "mahika____": "But dolls don't have any hair on their bodies either. Maybe we should start there?", "bellajoypottery": "I never thought of it that way, but it totally makes sense.", "m.trouvaille": "THIS! Once a (shitty) ex bf told@me I should shave it, and I was like, “I waited 12 years to grow this shit, and plus it grows in a cute little triangle. It ain’t leaving.”", "the_melanin_mrs": "I can agree with this. I really never liked dolls as a kid so I didn’t care much. But as a Mom I feel like you’re spot on. I have 2 girls and I had to explain to my oldest that having public hair is the norm and it’s nothing wrong with it. This is one of the main reasons I went natural, not only for myself but to teach and model for my kids self love. Growing up I was taught pubic hair needed to be shaved because 1: it was nasty to have a bush (mind you as a kid knowing this is natural growth I questioned it a lot) 2: No man wants a woman who isn’t shaved and at 28 1 and 2 was dead wrong. And honestly my pubic hair looks rough but it isn’t. It’s all about upkeep of the pub’s lol Good Morning 😃", "gaelleelma": "oh @ihartericka you’ve touch a sensitive point. i remember my foster mom would make fun of me and telling me how my hair looks like pubic hair. i was so ashamed. that comment alone made me always shave everything... it feels so good to know that we are not alone. thank you sharing this.", "ultra_momma": "I started puberty early as in 9 years old. I was still playing with barbies. I had a friend that started growing pubes & was so embarrassed about it. I already had a full bush & told her it was nothing to be worried or embarrassed about. The next time we played barbies we spent the day drawing pubes on each & every one of them with sharpies.", "backdownsouth": "Right and no nipples! I drew pubic hair on my Barbie as a kid.", "gingerkidasaurus": "I’d love a doll with a full bush 🧡 Especially because I’m very fond of my own! Body hair in general needs to be normalized.", "lilyhenley": "This truly is brilliant in every possible way.", "purr_is": "Omg we drew pubic hair on our dolls when we were younger. And skipper was a teen, so she only got a few hairs. 😂", "lyketea": "My hair is so thick that I regularly get cystic ingrown hairs, when I went to get one checked out my doctor shrugged at me and told me to stop shaving but like...i cant. Its too thick. 🤷🏾‍♀️", "chelsthedirector": "Facts", "luxehairbymichelle": "🤔🤔", "worlds_best_gram_": "These kind of dolls would be specifically good for sex education."}