{"stewhpeas": "Hey! I’m Sequaña! 👋🏾 I’m a multidisciplinary Creative whose work centres healing from inter generational trauma. I’ve been a full time survivor since birth, if we’re being honest- more recently I lost a huge source of financial stability and have been struggling financially which has hurt me a lot emotionally. I need reparations to help kill my debt, help with bills, RENT, food, and in order to make room for real savings which will allow me to create a place of healing for all POC specifically Black and Brown people. My cash app is $solosequana Venmo: solosequana and Apple Pay cash: sequanahasmail@gmail.com ANY AND EVERYTHING HELPS! Thanks so much for this @ihartericka love you and you know how I feel so I ain’t writing no paragraph lol 😂 💛", "oncode_media": "I'm inspired...", "tiffanyaliyah": "just had a terrible day & would like to eat something other than noodles tonight. CashApp: $tiffanyaliyah Venmo: tiffanyaliyah", "sincerlycee": "Started my business Working on another at the age of 18 my cashapp tag is $sinceregal", "1ofmylittlemoods": "Hey everyone!! I’m a poor black student that lost my job and would really appreciate some financial support!! My Venmo is larkblackson💎💎💎💎💎💎", "annavprokoshin": "I’m not paying you shit. My family came into this country in the 90s, we never owned slaves. 👋🏻👋🏻", "asap.mia_": "Cashapp: $AhmiaPorter currently an undergrad student working to become a forensic scientist", "flower_girlu": "My cash app - Mikaylaorrian", "misskarmie": "paypal.me/karmieb", "dingyd0lly": "Y'all I need sum glasses mine are broken I've been walking around blind and my parents don't have the money to pay for them at the moment so anything will help cash app is Pastacupid PayPal gabriellebronx", "empirewhiskers": "Is the better move to just say \"yes, reparations are the answer but because our government is designed to empower slave holders and white power, we'd have to abolish the Senate, add new states, and pack the courts, which is extremely difficult and unlikely likely but I'll try!\" or to mumble about incremental change? Both seem bad", "thats_ms.acacia": "@ratchrover @woodschan @jonny_bobby", "red.mai": "$redmai - budding Atlanta artist. 🙌🏼", "thnx4_2day": "This recurring \"not up for debate/discussion\" = a closed mind. Good luck living in your bubble. All of this nation's real problems are culture made and we wonder why people don't relate; we don't think deeply enough about the positions we take.", "aleyeou": "I’m a single mom in college and working a full time job and trying to finish my book! My cash app is $aleyeou", "sonofruth": "Shout out to all my Afro-Caribbean, Afro-Latinx, and continental African cousins who also deserve reparations from their respective oppressors/colonizers (which includes the USA for many of them as well)! 🌍✊🏿💰", "ekkiolu": "Venmo: @Ekkiosa-Olumhense College Student", "camburguesa_": "cashapp: $artsyheau Hi! I'm a young student who hasnt gotten her reparations :(", "jes_sic_af": "@jaliaf", "nak1a": "black, queer, in debt: cashapp $jokia427 /venmo: @nakiatw", "luxefatale": "I just watched a clip of AOC interviewed by TaNehisi Coates and it sounded as though she is very much in favor of reparations... Maybe she also said something else along the way that got misconstrued? Or maybe she at some point recently changed her tune? Anyway I would like to think at least she would be on the right side of history in this.", "incensegurl": "Thanks Sis @babymamahood My Company Incense Gurl paypal /motherdivine9@yahoo.com", "orchard_guy80": "The Indigenous peoples of this hemisphere are owed some serious reparations too, and not just a bunch of coin, at that. Land and sacred spaces re-matriated BIG TIME. It was the women who were the real leaders. White settler colonists refused to recognize them though in order to de-legitimatize status, personhood, and \"possession/ownership\" of the land. Same holds true for much of Africa, from what I have read anyway. Solidarity! ✊", "picklesmayonnaise": "Support my art + etsy shop @starstationonetsy. Paypal picklesmayonnaise@gmail.com", "halberdj": "Venmo: Joshua-Halaberda Cashapp: $polyhex", "bombzforbrickz": "Absolutely. $NikketteGlaze", "marii.shaili": "I’m not going to put why i need the money. I’m Black and that should be enough! Cashapp: moneym345", "blkgirlblog": "Cashapp: $ilam1", "00027g": "@ihartericka Andrew Yang is running on the platform of giving you $12,000 a year. I think a UBI is a feasible idea. Check out @andrewyangvfa", "malik1k_": "cash app $idoannouncements . i’m not looking exactly for repatriations, just want someone to invest in my success. i’m a social science education major with a minor in africana studies. i want to change children’s future through the classroom. help a brotha out, i promise you won’t regret it.", "kylaa.paige": "I’m a young black woman 😊Cash app -$Kyliee33", "easplashman": "Paypal.me/GhostElectricity to help expand my business", "javelin.z32": "$blvckspindle working towards becoming a cybersecurity specialist", "shayla_renae_": "Because I deserve $PayShay92", "3lessed_": "My cash app is $Trinniee", "samirafromcle": "Venmo:samira-colbert-1 black genderqueer college student/organizer", "lennaeleilani": "@jaisa__", "hus_mans_is_this": "Hey I make zines! I’m non binary and wlw and working 2 jobs as a cook in the Midwest. My artwork is picture heavy but sometimes there’s words- the content spans from jubilant expressions of being gay to gaining empathy for ghosts as a result of being mistreated as a queer POC in a state lacking diversity. Dm me and I’ll send you some zines! Special deals for POC and queers 💕", "livingdisplay": "Im a preschool teacher, who also runs an art business and models in my free time. Venmo/cashapp: Diamoree Paypal: Diamondyoung75@gmail.com", "thepagesintheword": "Truth. Do you have an opinion on Marianne Williamson’s reparations proposal?", "chronically_determined": "I would gladly pay an added tax (or however the government would figure out the logistics) to see reparations to African Americans and Native Americans. Accountability is essential to moving forward past racism and hatred.", "channelmarqus": "@hunniipie MAKEUP ARTIST💄 cash app: $hunniipie email: hunniimakeup@Gmail.com Could use the help 🤗♥️"}