{"krissmincey": "This is the most accurate definition of Black Ive heard to date. Thank you for this language💆🏾‍♀️", "mid_nite_rogue": "Hi @ihartericka I'm T (holding out for the day pronouns become completely irrelevant). I've seen you at the DapperQ fashion show for several years and your energy even from afar was so inviting. It didn't occur to be to check for your social media until recently and I'm so glad I did. Seeing you and Ebony two powerful and uplifting and unabashedly honest Black Queer folx on my screen everyday gives me just enough motivation to keep plugging along in life and love. Fun fact: I'm from eastern Suffolk Long Island and grew up a Jehovah's Witness. I didn't truly come out until I was 30 and left. These last 5 years have been an awakening of my spirit and a birthing of my true self. Thank you both for existing and illuminating a way through some of this muck. Now I'mma shush and go find your podcast and get my life.", "livie_dee": "I'm Olivia, I am also a queer sag plant mom who feels most at peace in the ocean, tho any body of water will do! You and Eb are joy and education and more joy. That tadpole story sounds awesome and mildly overwhelming. I did dance for ten years, am trying to put out a zine series, and once had a 5 hr job interview. Thank you for all that you do!", "koolasjas": "Random Fact: I received an award from President Clinton for volunteering when I was in middle school.", "sharonap": "I'm Sharon, a 49-year-old white female. My white husband and I adopted three biological brothers who are black over 12 years ago. Our family is beyond gorgeous.", "silkbfrb": "Thank you for the work that you do!!!", "kris.bels": "I just came out to myself as being demisexual and demi-boi today. I scrolled through my old IG posts and was like “how did I not see this before??” It feels nice to have labels.", "morningsareforcoffeeandtrek": "Hey, I'm asexual and Queer! Seeing a queer person be so open and fight for others is so inspiring! Also you are stunning 😍 Keep up the good work👏👏❤️", "sustainablebk": "Yaaassss🖤🖤🖤", "oitaylor19": "Hi, #6 reminded me of a story. I stole a zebra print pencil from my school when I was little and got so upset I made my mom turn around so I could give it back! Also, what happened in the peace corps? Why did they do that!", "ttina_g": "I know a peace like no other in the ocean 🌊 💗 if you feel comfortable, do you mind sharing about your peace corps experience?", "jacq_jypsy": "Hi Ericka! I'm here procrastinating from the next meditation in an Open Heart Guided meditation series I've been going through cause it's been bringing up a lot of emotions I don't know what to do with. 💖", "hannahelder4ever": "Love these intros/learning more about you not just from you // I always cut my waffles/pancakes up before I eat them so that a. I don’t have to waste time while I’m eating and b. more even syrup distribution 🥞", "havelittle": "Number 9. Choke. Amazing dad. Number 10. I've been told I was unplanned my whole life and am fighting back anger as I am now 5 weeks along with a intentional child. (don't tell till 10 weeks, because miscarrage would become less stigmatized). I've followed and unfollowed many times, as I know this space isn't for me, but I can't help coming back because of how challenging your content is - in the best way. Thank you.", "ladyphritty": "Hi love! In kindergarten I wanted so badly for our name to be spelled like yours and I still do to this day! I love plants and have over 40 in my home! You are a ray of light and I have to thank for expanding my mind even further and for your daily doses of real!", "gercelt": "Hiya I'm Ger from Ireland...I found your account through @3tokenbrowngirls and am addicted now 😍😂😍 thanks so much for the amazing posts", "micheleedith": "Hey, Ericka! I listen to your and Eb’s podcast while at work on a flower farm. I also went to an amateur porn film festival @humpfilmfest and while the content and artistry and concept was amazing, I was disappointed (but not shocked) that most of the folks in the films were white. Thanks for all you do 💚", "jessdoeswellness": "Hi Ericka! I also worked on a cruise ship 😬🚢 one of the hardest, tiring jobs I’ve ever had, but also probably one of the most fulfilling and man do I miss being able to view/be in the ocean/be on the beach 🌊", "soundartmagic": "hey ericka, i once stole a bullion cube from the 💵 store. even at a young age, my love of salt surpassed my morals.", "weezle_t": "about 15 mins into my first episode of #TucaAndBertie when they go to their neighbours home and They are a very tall femme who is an actual #Plant that loves #turtles and casually goes topless so I assume the character is based on you :) The main characters walk into a bakery and on the wall is a picture of a person wearing a #baguette #strapon ...I hope you find the Baguette Strap-On of your dreams.", "robinestrella": "hi ericka! i'm robin. something unusual about me? in my family i'm a solid minority. semi-straight (wasn't always), white, married to an old white guy who treats me as I should have been treated all along. obviously ally. proud mama of all the kids who needed to belong (and now do). ❤️💜💙💚💛", "xineel": "Hi❣️random fact: I’m asexual and the happy wife of a trans woman .", "darianswer": "hi Ericka! my random fact: I read each book in the twilight series at least 3 times between middle & high school 😳 unashamed of the obsession, fiction is escape, but whew, the representation of romantic \"love\" was influential in many toxic ways. Also. Fuck the u.s. peace corps. ❤️", "relentlesscheer": "Hi Erika and everyone—I love this account and learn from it all the time. Started the @laylafsaad #whitesuptemacyworkbook thanks to a commenter on one of your posts. I’m a musician outside of my retail job and I call my genre future soul. 🧡", "justagirlflyingaway": "Random fact about me, Finding Nemo is my favorite movie. Clipping is my favorite band. When I grow up I want to be a camp counselor(make a camp), at a camp that is like the YMCA Camp that I know and love (hello queen friendly) but is not a part of the overarching organization that is YMCA", "tichswilson": "My name is Sarah and I love dancing at home alone in my underwear while confusing my dog.", "kylethecool1279": "I’m Kyle and I love giving my friends hugs", "rrrapture": "I enjoy seeing your posts about plants / being fabulous / queer identity...just a few things. Oh and you're so pretty :).", "hanawolff": "Can you elaborate on #10? I wasn’t aware those phrases were triggering for folks and I’d love to know why, but more importantly what would be better/less triggering to say instead! (I have no babies so this isn’t a defensive thing, I’m just trying to learn more, thanks for giving it time/energy if you decide to answer!)", "krispy_ink": "Hey ericka! Do you think you and eb will be recording any more podcasts in the not too distant future?", "mamaontheleft": "Hello! Similar to your tadpole adventure, my random fact is that my 11 year old (as of tomorrow) son’s stick bug laid eggs and my son had been collecting them in a jar (why????). Now that it’s warming up in Canada, many many of them hatched. Loose in my house.", "undivided_inc": "Hey! I’m 50yrs old and apparently look 30 and if it wasn’t up my love handles I’d eat rice everyday, twice a day! More importantly though, I’m attempting to make the world a better place by doing something Wish me luck!!! #undivided_inc", "starwomb": "@ number 9: that is one of the most heart warming things I've ever read. All queer people deserve a love like that, we do, we do, we do 💕", "miacatriona": "I‘m mia, i‘m 18, queer, half scottish and half german and currently volunteering for young disabled people abroad. In my free time i love to dance and eat vegan ice cream. Your account makes me reflect and educates me every day and i’m super grateful for that ❤️❤️❤️", "cirkelvarv": "Hi. My name is Lisa and i live in Sweden. I love nature, i'm really good at musicquiz and i remember my dreams every morning. I've been following you for a wile. Love to see you and Ebony.💕", "moth_whisperer": "I have a frog story too... when I was little I would collect frogs and keep them in a terrarium. Sometimes they would go missing and I thought that this one little hiding place was a portal to some magical frog kingdom because they would disappear but show up a couple days later. It wasn’t until recently that I realized the frogs were dying and my parents were going out and collecting more so I wouldn’t know 🤦🏻‍♀️😂", "c.azzi.miei": "Hi! I've been following you for awhile and I often intend to comment on posts but get distracted and forget. I'm Stef and my my random facts are that I used to think I was a guinea pig and that I'm really interested in quantum physics and want to be able to have a complete understanding of it and possibly help the scientific community prove hypotheses related to dark matter and dark energy.", "thedogshouterer": "Hi Ericka! My name is Shannon. I'm a 42 year old women whose life was permanently shaped by 1) losing my leg to cancer when I was 12 and 2) watching my 31 year old brother die of cancer. It's taken years, but I now am joyful in my body. I don't like sarcasm. I have the silliest/dirtiest sense of humor. I would love to know the name of your green paint color in your living room. I'm not a mom but good parenting moments (like your dad's) make me tear up.", "researchermum": "Hi! Random fact: I don’t like eating crunchy food. The sound is just too much... it’s why I prefer crisps/chips when the bag has been open for a day or so and the crisps have gotten a little softer.", "msboogiebugg": "This greeeeeeen 💚. When I was like 8 or 9 I put a big bucket of water outside and thought tadpoles magically appeared. They were actually mosquitos. My family joked that I single handedly brought west nile virus to the Bronx.", "fen.melcher": "Number 9 is so pure😊", "yrveggiemami": "Hi! My name is Alissandra (he/she/they). I’m a queer, latinx, first generation American with a combination of family from Nicaragua and Scotland. I work at two public libraries, am a full time student, and volunteer with a local grassroots organization that fights for progressive issues. Fun fact about me is I used to work on a small, organic dairy farm. Working there made a huge impact on the way i viewed my relationship with food and animals 🧡", "champagneboho": "Hey Ericka 😍, just had a quick question if you don’t mind. Would you DM our main account @bohoseventy thanks! 👌", "alexlovesyoutoo": "Hi there. I checked out your page as a recommend from @jameelajamilofficial and I liked your content. I’m 35 yrs old and in Pennsylvania. I’m married (to a woman) and we have a 9 yr old dachshund named Squee. I’m a Capricorn (since you mentioned you’re a Sagittarius). I don’t feel like I’m what it says a Cap is tho? I’m an only child and both my parents are gone. Luckily got to come out to them before they passed and both times it was a positive experience. In life, I’m working on becoming my own hero. Look forward to seeing your posts and getting to know you.", "balletmeli": "Hello my name is Meli . ❤️ 📚 🎶 especially 80s and 90s. Dance ballet from ages 3-22. ❤️ 🎭 🎥 🍿 🖼 museums. I am 4 year breast cancer survivor stage 2A estrogen receptor. Going back to school for medical billing, and approaching my final class. My goal is to audit medical records. Also working on completing paperwork for an apprenticeship in medical billing. I 🙏 I get the apprenticeship so that I can gain experience in this new field.", "daughterofravens": "🔥🔥🔥🔥🔥", "dlo_onthephoto": "As a kid I would also collect tadpoles from the local creek / storm water drain hoping they’d turn into green tree frogs....but they always turned into cane toads and then I’d need to kill them because they’re an invasive species which would eat native frogs / spawn / tadpoles. So it was less cute, more bleak. I would have been full of so much joy if my garage was suddenly full of green tree frogs 🐸", "thelastqueerbender": "Omg #10 tho", "holidayst_r": "hi!! thank you for all your wisdom and having the patience to share it with a sometimes unwilling world. you may not say things people want to hear but they should be said and your unending patience and grace is a treasure", "lilvamplaura": "Hi I'm Laura, genderfluid she/he pronouns. I just want to say I love following you and seeing you share your education and insight. I believe I followed you when you walked for chromats show and I love seeing videos of your presentations and the ones of all your plants.💚 also I collect antique glass bottles bc I live in a windowless basement and can't have plants :/", "bydeedee_nl": "Hi, From Holland. A random fact about me is that i started my first job at 15 as a cleaner in a care home 4 elderly people. This only lasted one week.", "tgrbass": "Hi Ericka! I've been following you for a minute and I appreciate your education and livin. ❤️ Random fact: I had boh my fallopian removed at 36 so I'd never have to have an OOPS BABY (UGH) scare. 💩", "runtimecomplexity": "I'm Yim and I'm on the autism spectrum and I study how we can change the world of technology, computing, machine learning, and artificial intelligence to be accessible to non-cis non-white people!!!", "hannah_macintyre": "I’m hannah! I’m an autistic lesbian with a service dog named coco who comes everywhere with me! I love the ocean as well and am working towards becoming a marine biologist. My favourite animal is a shark and I’d love to swim with them one day. I love plants and horror movies and true crime and love love loveee the honesty of your account ♥️", "comeauver": "Hi I’m Pat, 27, he/him, been a follower for quite a while! I love watching @the_skindeep videos, I think it’s so healthy and helpful to watch other people converse about big and small topics, and absolutely loved yours and Ebony’s! ❤️🙌", "tipsyelves\nVerified": "Verified", "emilygoldhammer": "I had a “surprise” baby! And I am so glad Eli surprised us! I also hate that “oops” “mistake” idea...why would you ever call another human that?? Eli was our great big surprise, the exclamation point and delight of 2016 (sorely needed).", "arrestcarolebaskin": "Omg tell me all about the peace corp", "xxarw": "Hi! I'm a NB femme, sagittarius plant mom too! *high five* my favourite fun fact is that I still have three of my baby teeth because the adult teeth never grew and pushed them out, I also never grew any wisdom teeth!", "maddiliciousssss": "I'm maddy - black and bipolar with ptsd, depression, self doubt and anxiety but I'm also way more than my mental disorders! I play the saxophone, enjoy travelling and writing poetry too. I work as a business analyst for neurodegenerative disease markets and I'm passionate about genetics especially of diseases like sickle cell. Love your page, work, posts, and I learn a lot from following you 💙", "mama_yb": "Hi I'm Yevgeniya. Born in Odessa Ukraine. Brooklyn has been home since I was 6. As a child, I witnessed an attempted murder (a stranger, he was ok!) saved someone from drowning and survived a burst appendix by a hair. Why did I choose such morbid fun facts....? Also, I was on Cash Cab. And I'm obsessed with setting people up--relationships, friendship, business. Everything. It's becoming a problem. Recently became super into plants and witchy things. We have 2 kids (6 yr old Asher and 3 year old Tamara, both named after dear relatives) and I'm SO with you about the surprise baby thing. Very inappropriate on a variety of levels... Love love love your page. Thank you for all you do ❤️", "cocoflowerchild_": "Hey there I am CocoFlower proud erotica artist, artist entrepreneur poly demipansexual! Love using my art to bring awareness💞🔥😍 thanks for sharing and being so open!!!", "ceesando": "goooooorg", "eltacodor": "Totally not the same deal but because of my infertility #10 is triggering for me too. I wish you the best of luck on your baby journey.", "tallasianchick": "Hi! Random fact: I was born on 11/1 at 1:11am! 😋", "inshallahfeminism": "Omg, hi! My name is Soha and I’m from Karachi - all the way in Pakistan! I’m a brown pansexual genderqueer person and Ericka, you are such an inspiration to me! You are someone I really admire and look up to. I learn a lot from you everyday so thank you for everything that you do. 🐳🙏🏽", "boomerangnika": "random fact about me is that i had to laugh about the tailor swift one cause what", "jukeboxnachos": "Hi EriCKA thank you for your grams! I am blind on one side because I got hit by a car — did you know they drive on the wrong side of the road in the UK?? I’m fine but it IS super easy to sneak up on me!", "pinkelman": "I’m Kendra and I live in Ohio. Random fact: I have butt acne too and I LOVE that YOU are the first person I ever heard say they have it too!!! Now I don’t wonder why it’s just me...❤️", "ohilyssa": "Hi! I love the both of you. I stole Little Mermaid erasers from a Payless when I was 4, and my mom said it could be “our little secret.” Aka she had no desire to drive me back to Payless 😂😂😂", "futurowoman": "I'm nancy, I'm 48 and I live in Texas, but am originally from California. I'm an only child and current care for my mom, who has dementia. My partner and I live with our dogs and my mom in a home where I love to grow plants, indoors and outdoors. I'm an historian and my focus is Palestine, gender, cross-cultural encounters, decolonization. I love to cook and take photos, esp with vintage cameras and expired film.", "fallenalien01": "Angel !", "blacksagefemme": "Hi Ericka! I got to introduce myself a little bit to you when you were here in Madison. I'm still a student midwife and trying to get through finals..it's been difficult. When I'm not worried about school though I do aerial silks. I did it almost religiously when I was 16 years old. I hope I can become as good as I was back then", "tkhord": "Hi I just started following you! Your content has been teaching me so much and I love your passion/voice for the things you stand up for. I honestly don’t know what non binary femme means and was wondering if you could help inform me?", "jubblejubble": "Also did the tadpole thing as a kid. My mom was less than thrilled. 😂🐸🐸🐸🐸🐸", "_just.a.sliver_": "I've been terrified of open water all my life but my husband loves sailing. He FINALLY convinced me to come out with him one day and I was really scared, but I went because I wanted to see a whale. He said he'd never seen one out there, but you never know. It ended up a beautiful day, AND we saw a whale. Unbelievable day.", "its.el.now": "I’m El, I use they/them and I’m active in MA state government and I aspire to study Sociology and (hopefully) sexology.", "lorajeankelley": "Thank you for sharing about number 10. I will be more mindful when I talk about my family.", "sheblyb": "5. !!!!! 8. 😒 pHAH", "beemama8": "Hey Ericka and Ebony! Firstly, your respect for each other’s knowledge and work out videos are major relationship goals. You both have me nodding and cheering along with all your stories and posts. Thank you for all your work, education, brilliance. Being a bit of an emotional masochist, I enjoy sitting in the discomfort I feel from confronting my own prejudices, privilege and misconceptions. Your posts have helped me frame feelings I’ve had into words that I can share and put into actions. 💗  I’m a white presenting mixed race First Nations person. I’m a member of the Cree Nation of Northern Alberta and a descendent of Swedish and Italian (and other European) immigrants. Most of my work right now is in examining the juxtaposition of privileges and intergenerational trauma of white-presenting Indigenous people. I also have a keen interest in sexual health and education in First Nations communities - especially in the remote north. I hope that in the next decade, this become my graduate and paid work.", "gardens_n_ghettos": "Hi I’m Tierra! Baltimore made. Grandmother raised! I’m a Social Worker and in my line of work I get to help ppl who are activity dying or in the process of dying transition comfortably. Most times I’m hood as shit and sometimes struggle to balance it. 😂. I enjoy writing very short poems or motivational quotes and sharing via social media. I am the daughter of parents who were addicted to heroin and crack. My dad is no longer living. My mother is in recovery. I love cats! And i love plants too!!", "emmaemathes": "I’m Emma and first I want to thank you for your honest content. I love following you. Fun(?) fact about me is that one of my favorite feelings in the world is being on a non-crowded Subway that’s going the right speed, not hindered by delays. (Which is in stark contrast to the feeling I get from any other kind of subway ride) Claustrophobia is a bitch! 😭", "imapurplequeen": "Beautiful", "_madeleineblair": "Hi! I am a huge enthusiast of both frogs & mermaids, and I LOVE your posts. When I shared your dancer pose/wand pic my followers lost their minds (in a good way!) Also very curious about the Peace Corps story. Thank you for sharing so much with us 🖤", "spikedmartini": "Okay but yes obviously everyone is all about that photo 😍❤️ also, laughing thinking about the frogageddon you unleashed in your garage 😂", "capicu_": "You do amazing work and I’ve learned so much from your account! Also, you and Ebony are reminders of how freeing and safe love should be. Thank you for sharing yourselves with us. Much love to y’all.", "fauxlabelsphotography": "Hi 👋🏾 my name is Lé, I'm photographer, sexuality and reproductive health educator here in Ohio. I adore your page and your work. You stay inspiring and motivating me. I'm not new new, but I've been reading/ lurking for awhile. Thank you for being dope.", "voiceactivatedwriting": "I've been a child print model, a background actor, a substitute crossing guard, a tutor, and now an introspective coach for LGBT folks of color. :] So happy with my current job! The challenges are worth it.", "mousey_love": "I’m that white gurl asking about t swift in your dms 🤦🏻‍♀️ I legit didn’t realize what was happening, when I googled it last night I had just got off work and it looked like ppl were just comparing for her putting her hand on her hip, I was like, huh? 🤷🏻‍♀️ Anyways, sorry, should’ve googled more than a sec (also a perfect example of white ppl asking other ppl to do the work for them), this morning- I see it, I saw a pic of the marching band and immediately got it. (whyyyyy swifty WHY, how could anybody on her team not realize this!?) white ppl have been ripping off black peoples work for generations. I‘m here to learn from you, including sorting thru my own subconscious. I appreciate you. You make me think 💜 I actually have tickets to listen to @rachel.cargle talk tomorrow in LA 💪🏼 If you’re like who iiiis this bitch? I’m Rachael 😊I just moved home from living abroad 5 years, my parents live in Orange freaking county, CA. I’m moving to Long Beach next week 🤪 had I never moved abroad, I probably would’ve never been here, but stuck somewhere with my head in the sand. I am grateful I am not. I’m trying to talk the talk. Call ppl out for their casual racism like my own parents, as well as recognize and unpack my own subconscious. Ps your frog memory reminded me I once played w tons of frogs near a river and made a little frog farm, I woke up the next day and they were all dead and I still feel like I killed them somehow 🙈 pps I love that you’re a sex educator, sexuality is something ppl don’t talk about often enough and I wish I’d learned more about my own when I was young, please keep doing all your amazing things 🙌 ...thanks for not saying there is some white jackass in my DMs asking about Taylor Swift 😬", "dipperdebbie": "Hi I have a teenager who is non-binary and am loving finding people like you out in the world! I’m a divorced mom who has chronic illness and loves to hike.", "shannonsarti": "If you don’t mind me asking, why did you get kicked out of the peace corps?", "silly.being.of.light": "The green is poppin! 💚💚💚💚 when I was little I would steal some dollars and coins from my dad's jeans, on the weekends, then sneak off to the corner mart and buy candy. He asked me about it last year and I confirmed it. We had a good laugh.", "sandi_phoebe": "I have the same trigger. Whenever my female fiancée speaks of having children I feel inadequate not being able to give her any, or carry one due to a heart issue.", "liisaklopez": "I would love to know what age you were for number 5 lol", "palestinian.princess_": "Hi, I’m Noel. I’m first generation in the U.S., both my parents were refugees who came from Palestine. Fun facts about me is I helped created a study abroad program to take other students to Palestine this summer! My racist school gave us a hard time but it was finally approved :) love your account and all that you do.", "knock_a_momma": "I’m afraid if vacuum cleaners, I came out at 7 years old, I’m also a sex Ed teacher, I am afraid of spaghetti, I didn’t start eat chicken until I was 17, I’m dating a trans man, I stole some Lisa frank stickers out of a binder in Walgreens when I was little and the shame I feel STILL LOL so essentially I feel as if we are sisters with all our similarities ❤️❤️❤️❤️❤️😂😂😂 I flipping love you 😍", "chelsea___ellen": "Just wanted to say thank you for your honesty and how you and Ebony share your knowledge. I look forward to seeing what you post and your analysis of anything and everything. Also your style and plant mom status is amazing! 🌿🌿", "souzmister": "hello! im happy today bc my hair is finally growing since i accidentally cut it like lord farquaad last summer", "orangepickles": "Thank you for all your content! It’s amazing the work that you’re doing- putting yourself and these issues out there, and as a white cis-hetero female psychotherapist (working with trauma, eating disorders and recently more gender and sexual identity) it feels invaluable every time I watch your stories and read your posts, so endless gratitude to you and Eb for your vulnerability, courage, wisdom and knowledge that you’re giving the world!! We are lucky and blessed to receive it! 💓💪🙌", "_gs_galaxy": "I love learning more about you! Fact about me: you have inspired me to become a sex educator. I have always been interested in it but didn't know how the field would be for me as a queer Black woman. Seeing you and all you have done has let me know that they're definitely is a place for me and to make my own spot when there isn't one already available. I plan on pursuing that field after I'm done with my current master's. Also, you have truly helped me address my anti-blackness. I'm pretty pro-black but never realized my anti-black tendencies. I am much more aware of them and where they stem from now. Thank you. Lastly, it is one of my goals in life to not only meet you but to have the opportunity to have a conversation with you. Love you 💖", "iuliia_dr": "I have only recently found your account, and, having only recently come to terms with being non-binary, find it very reassuring and empowering to see a femme non-binary person who uses \"she\" alongside \"they\". Being from Eastern Europe, it's hard to comprehend the white privilege, since a lot of conversation around it focuses on the Western context specifically, but I'm trying to educate myself nonetheless.", "mad.slut.problems": "7, 8 & 9 are the most👏🏽You inspire me to be better to me & to other humans. Being a plant Mom is the most🗣Thank you opening us up🙏🏽", "emiwee707": "Can we hear the Peace Corps story!?! 👀", "efe_de_poet": "Hi Ericka, my name is Efe and from Ghana, Africa. Been following you two for a while and I must say I love you(Ebony inclusive). You inspire me everyday. I must confess you two sometimes are the reason why I'm strong enough to go out of my house. Here we don't deal with racism (lol). Just a lot of homophobia and transphobia so it gets hard. But then I see you two and I'm like you got the best insta role models ever", "shawwnuh": "I am not sure about any random facts about me, but I just wanted to say you are an inspiration to me. I’m a two time Cancer Warrior, and as of late, I’ve been struggling with a lot mentally and physically. And you, help me look at the big picture. I look forward to your posts every day, no matter what the topic is. Thank you for helping me on the journey to validating my self worth. ❤️", "aweb80": "I’m Alex. I’m a special Ed teacher at a big public high school in Oakland, Ca. Your stories with Eb represent the best part of Instagram, and I look forward to seeing both your faces every day. Thanks for teaching me.", "jenblei": "I'm Canadian, and fortunately my American husband wanted to move here. My triplets are 23 now- one's a cancer survivor and two are autistic. They're all amazing.", "pearlzorn": "My name is Kate, I am so grateful for the education you provide here - it is such a valuable jumping off point for my anti-racism education. A random fact about me - having my son has changed my life, I feel such responsibility for becoming a better human so I can raise better humans. I am fascinated by the Montessori method and different respectful parenting approaches, respecting our children is so important and life-changing ❤", "_n_y_a_h__": "Hi I’m nyah and a random fact about me is that I WON BEST DRESSED at prom (still not over it)!!!", "angelaemorris": "Hiiii 💛You and Ebony are my favourite people on the gram. Still trying to figure out how to be friends with the both of you. It’s good to have goals. 😂 When I was young my mom used to bowl cut my hair. I also used to bring home critters for my mom and leave them on the front doorstep. Sorry, mom!", "sugaring.brooklyn": "Random fact: before I got into sugaring I was in the music industry. I’ve sung in seven different languages!", "lorenaismyhero": "Hi, I’m Kortney☺️ I’m a single mom barely surviving at the moment. DV survivor working toward becoming a criminal defense attorney to help get women/minors out of prison (87% of the women in prison right now are survivors of multiple assaults by different people and cannot afford proper counsel. EIGHTY SEVEN PERCENT.) Someday I would like to have a bunch of foster kids on a farm teaching them law. I want all the badass “no good” kids nobody wants or loves and I’ll love them 💗", "vlj1120": "I am an intersectional End of Life Doula.", "margaretkammer": "Thank you for the intro, Ericka! So appreciate your work here and the lessons you and Eb have shared. I’m Margaret (she/her). I got kicked out of a 10-month long AmeriCorps program after 9 months of service! I have a cat with cerebellar hypoplasia, and I’m excited to say that today is the first day of my local farmer’s market!", "haisley29": "Hi! I'm Haley, a college student. I'm working on unlearning my internalized racism while looking for ways to take action in my community and how I can do activist and advocacy work as a professional. I have 9 plant babies and I'm always on the prowl for a new succulent", "annemarieandchupa": "Lmao ily", "dontbeeaskingmehowtosaymyname": "Hi! My name is B and I’m an artist who’ll eventually become a lawyer. I think the funnest fun fact about me is that I’ve never been swimming, but I’ve kayaked blindfolded. Or maybe it’s that I’ve technically performed three surgeries on myself? OH or the fact that my very first outfit was a baby Dior tuxedo.", "freddiemercurysmustache": "Hey, fellow Sagittarian! Random fact about me: I have the letters W, X, Y, an Z in my full name.", "cassirosee": "Wow reading how supportive your dad is made me tear up! That’s beautiful. You got kicked out of the peace core? Wow I wouldn’t mind hearing that story!!", "thetropicalthunder": "Hi!! My name is Frankie. I’ve been following you and Ebony for a while now and y’all are my relationship goal💕 I absolutely love your account. Random fact about me: ramen noodles are my favorite food 🍜", "maruskaalbertazzi": "Hi! I’m Maruska. I’m a cishet white wealthy skinny stereotype. AND. I suffered from anorexia, hypomania, and two post partum depressions in a row. I’m Italian, a writer, screenwriter and tv author. Acquarius. Got here Thanks to @jameelajamilofficial whom I thank for all the amazing follow suggestions.", "blacktivistmommy": "Team Sagittarius ♐️🙌🏾", "dominiquencole": "Hey beautiful. I learned how to swim when I was 40 something. Learned how to ride a bike when I was 23. I’m 45 and want another baby but don’t think it’s likely cause the doc said I probably don’t have anymore eggs which discouraged me and so now I’m focusing on my plants and making stuff as another means of bringing life into this world. Thanks for listening. I know it was a run on sentence. I wanted to ignore what I’m supposed to do. Tired of following rules. I love you. You’re absolutely amazing.", "britny.marie": "Secretly hoping you come out with a kids book series!", "killertofu__": "you and Ebony have a created a [proactive positive] space on this platform that fosters self acceptance, visibility, and transparency. i hope to see you speak in person someday and am grateful for the *free* content we all get to receive on here from you. i’m working on myself with each of your posts whether it be about all my failed plant mom attempts, body positivity (i’m an eating disorder survivor and every day is a choice to step forward or back with that) or most importantly, being a white woman and how i can deconstruct and rebuild the narrative i’ve known for 29 years with white privilege. i check myself and assess it all on the daily because of you, thank you so much🖤", "easterneden": "Hi, I’m Chelsea. When I was four I stole a donut shaped baby bottle from a store because I refused to give up bottles. I have since retired from my brief life of crime and am now a writer, domestic engineer, and mother. Also- why would you have to stick up for Taylor Swift? 🤔 thank you for sharing and educating!", "great_illustrate_300": "Dm for 🎨digital graphics such as 🎨toon of your picture 🎨logo 🎨album cover 🎨flyer 🎨mix tape cover 🎨illustration 🎨cartoon graphics banners and lot more", "africa_bytoto": "@ihartericka hi ! I’m Brianna moved from Brooklyn to Philly last year - I just watched obsessed with Beyoncé and the fight scene is a whole ass mood - thank you for all the work you do ♥️", "__reconstructed": "I started following you looking for other survivors and have learned (and unlearned) so much from you and Ebony. Would love to hear the Peace Corps story. Also #10 🤬 - congratulations and fuuuuuck youuuu", "velvet.curls": "I trained to become an opera singer for 7 years and still wish that dream came true.", "l_zawacki_m": "Hi! These were such interesting facts! Like many others I’m definitely interested in knowing more about your other jobs. Love the work you do here and the love you and Eb show for each other. And yes also you are quite literally glowing in this picture! Random facts about me. I used to rub the cartilage at the top of my ear as a kid as a comfort and now my ears are really flexible. Also I just left a non-profit to open my own mental heath counseling practice.", "girlwiththecattattoos": "Hi I’m Kaitlyn! I’m a non binary person (they/she). I’m 29 and never learned how to ride a bike 🤷🏻‍♀️😂", "jcorwin12": "Hi!!! I have been following for a while. Thank you for being you and for everything this Insta account does. You definitely have me giggling with the frogs in the garage scenario. Random fact about myself: I am obsessed with children’s books.", "polite_as_phck": "Hi, Im Jessica. I learned to sew at 8 years old, I also feel at home in the ocean, I will never defend Taylor Swift, I try and check my white cisgender privilege daily, my favorite late night snack are tortilla chips with any kind of microwave melted cheese 🙄😊", "averyjanex": "You’re so magic", "featsofeducation": "I just posted a rant about biological essentialism and racism and transphobia, clicked post, and was greeted by your wonderful (and gorgeous) face. Thank you for being. 🧡", "hardie.photography": "I’m Whitney - I’m a birth photographer and I love frozen burritos. Also a plant mom and a chicken mama.", "atomic_twitch": "I’m Mary (they/them, non-binary) 👋 I’ve been following for a while. Your content reminds me that i need to sit down & listen, and I’m appreciative for the work you put into this acct. Also, I’m relating to #10 in a big way. Random fact about me: I love to bake & decorate cakes but when it comes to eating, I prefer pie. 🥧", "amv_skowron": "Hi, I’m Amanda and I’m new to the Breast Cancer Survivor Crew! I make maps and I’m obsessed with clouds ☁️☁️☁️☁️I’m also new to your account and so far I find it honest, important and lovely!", "paradiisa": "hi im isa (she they) also a non binary femme. i was born in colombia and immigrated to miami when i was 3. pisces sun, libra moon & rising. Do you an Eb share your zodiac publicly? also i want to thank you for the education you offer, so many of us. i hope i can access more resources so i can materially support your work but in the meantime i share & cite you. thank you for all you do.", "more_with_less_": "Hi! I am from the Netherlands and I'm a beginning intersectional feminist and sustainability nerd (these topics are interlinked!!!) I am awed by your work outside and in this space. I'm turning around a lot of my internalized racism, so thank you! Randon fact about me: I have a nice job (in chocolate, so that's fun), but I wish it was more meaningful sometimes", "starsnsarah": "You teach me so much, and I am thankful for you and Eb and all the wisdom you drop here on IG. Random fact about me: I was adopted at the age of 6, went from a life of abandonment/foster care to a life of privilege. Also went from a unique name, Chenoa Melody to a common one, Sarah Marie (I think this was partially picked to make it difficult for my bio mom and her family to find me, since it was a closed, rushed, adoption.", "privar2192": "Hi! Good morning to you and Eb!! Random fact: I used to steal bracelet charms by sitting on them (I was in a wheelchair when I was a kid) & then sold them at school 😆", "handigs13": "Hi Ericka! Hanging out on your insta is always a great place to be. THANK YOU for all that you do to educate and cultivate, for bringing Ebony to us all (inc the podcast), and for guiding me to my unlearning every day. I think you're just amazing 🙌🏼 Also no. 7 😍 and no. 8 🤦🏻‍♀️", "mynameisashnide": "Damn😍😍", "nicole13rae": "Hi Ericka and Eb!! My name is Nicole, I am also a plant mom and a stage IV cancer survivor!! ❤️", "saraminerva444": "Just commenting to say thank you for sharing your knowledge and experience here.", "somewhere_under_the_rainbow": "Also can I say, I AM SO HERE FOR EVERY SINGLE ONE OF THESE COMMENTS!!!! EVERY ONE OF YOU IS EFFING MARVELOUS & UNIQUE!", "nataanii_": "Oh my gosh to number 8. Seriously, is that even a question 😂😫. Random fact about me I love to dance n jive what makes me feel the most sexy.", "sister_of_doom": "Hi Ericka 🖤 I work in a hostel but I use my molecular biology degree knowledge to tell every racist lgbtqi phobic person they don't know shit about biology 🔥", "slayannnn": "Yes twin ! 😍", "juliabelgrave": "Just saying hi and thanking you for everything you teach and share on here. ❤️", "erica.marley": "My name is also Erica (she/her)! I’m a bisexual girl from the Northwest. I’m married to an amazeballs man named Brandon whom I love 3000. Shout out to you—Ive been self educating and trying to repair some of the generational damage my family and ancestors have caused for about 7 years now and your posts and education mean a lot, so thank you!! One time in second grade I got in big trouble for mimicking Harriet the Spy by writing things about my classmates in a notebook during recess and class. Imagine your teacher reading your journal 😂😧My parents put me in theater after that incident and I loved it.", "jessicanarouge": "I really love your 5 and 6! I named a baby cow Greg once.", "messytessie": "Fun fact: I've almost died drowning 5 times. But water is still my favorite place. I also insisted on being called Buttercup for a year of my life at age 5 because I was obsessed with The Princess Bride and everyone in my family either obliged or got screamed at in hateful 5yo.", "xenia.ranae": "Hi I’m Xenia! I finished my bachelors degree in the fall, and I think I want to get an AA in Early Childhood Education (to teach preschool) instead of a Kindergarten teaching credential because I want to care more about following my passion than making money. And I’m scared but it feels like the right path for me!", "sereeenz": "Hiii! I've followed you for a few months now and am so grateful for all that you do. I'm also a plant mom 🌿 random fact: I left an actual letter to Hogwarts stuck in my bedroom window, waiting for an owl to come and get it, and respond to me on when I was getting in 😭⚡📚", "hannah.gundi": "Hi Ericka! I’ve been following for awhile and am so grateful for the work you do. When I’m out of school and making money I want to give back to you for sure! Some facts about me- I actually used to be terrified of all water and had to take 8 weeks of lessons just to put my face under. I’m super into Enneagram. I’m also a songwriter and would kill to have Eb has my engineer when I move to NYC after college 🤩", "peachy_plover": "Hi I’m Anna. I’m studying to be a psychologist in correctional facilities and most days I learn more from you about dismantling white privilege than I do from my program. I spend a lot of time thinking about how my partner and I will raise children of mixed race in this world. I also have a money tree and love him. Also, thank you for your work.", "silverscreen": "Hi:) I'm Iris:) @tracy_njeri send me here to find some answers :) what i found looks like a whole universe of answers i never knew i was asking for :) i lought so hard about the frogs. As i have two cats and two dogs i know a little something about the magic animals can be (and also the disaster. Jenny this morning ate part of my pillow whilst Scheggia decided to re-decorate the bathroom) greetings from italy :)", "catalinawellness": "Hi! Random fact- I’m grateful for your honesty.", "mightymightyafrodite": "How did you get kicked out peace corps? Lol", "kiararamsay": "Hi Ericka!! My random fact is that I am only 17 and I have fibromyalgia so my body feels like it’s 70 most days, but I just got back into yoga!! Yay", "scarred_jones": "The number 8 😂", "angeldisguise_": "Wow. I use to want to join the peace Corp. I can't see you working on a cruise ship and taking ish from passengers. #saggirls", "mangoleira": "I am so thrilled that @jameelajamilofficial linked to you as someone to follow in the positive mental health realm. Love the frogs fact! My special intro: I have eaten lemons raw , with or without sugar, since I was a child.", "beigebro14": "@ihartericka greens looks soooo good on you!!", "brodie_maggie": "Thank you for this💙 my random fact is that after 30 years of not recognising the biases, privileges and thought processes I posseSed, I am working hard to rewind them and live a more meaningful life 💙", "lexjayne": "I am so happy your account/you were introduced to me 😍💘", "annabeth_with_the_bandwidth_": "👋🏼 @ihartericka I really appreciate you & Eb. I learn how to grow my brain, help others and how to effectively be an ally. I am 42 and learning to love myself.. I have finally come out as queer..(Demi pan) and its the best feeling.", "cyndie_hart": "I’m working on finishing my Undergrad degree at 44 - I am a divorced mom of two teens that I get to ‘weekend parent’ - I want to go to Grad School to get my degree in I/O Psychology - Then I want to travel the US in an RV while I do research and write and meet interesting people.", "physicsandcoffee": "Random fact: I have met 4 winners of Nobel prize - 3 physics, 1 chemistry. Random fact of which I am most proud: i finally learned to fold a fitted sheet, almost as square and even as a flat sheet.", "honeydupain": "Haiii! I’m Hunter and I have a podcast called Guess Who’s Coming where guests and I talk about “inappropriate things” (sex, dating, relationships, etc.) at the dinner table. It’s a QPOC safer space that prioritizes marginalized groups 🥰", "mekdibaby": "You look beautiful and your existance on here is so important", "stackwanderer": "I am TERRIFIED of frogs, so, #5 might have given me a heart attack.", "nazilivesdontmatter": "i can’t get over your skin in this picture 😩 i initially followed you after seeing you model for chromat. i’ve never seen a BLACK femme who had beaten cancer at a young age. i beat it at 21 while my grandmother & aunt passed of higher staged cancers. and then to see that you’re queer, a sexuality & women & gender educator on top of already being a bad ass? makes you the best person to follow. the free information & advice you give is extremely kind & important. but going off your tadpole fact: i’ve grown up with the woods and a creek as my backyard. baby toads/frogs are the absolute cutest thing. there’s one tiny island of rocks in my creek where the toads always spawn, and a few years ago i stepped onto it and like 5,000 teeeny tiny frogs hopped in sync away from me. i’ve never been closer to heaven 😂❤️", "andreabrownriley": "I feel number 10 so so hard these days.", "_curvyballerina_": "Skin is poppin beautiful!!!🌟🌟🌟", "thevsoliloquist": "Hi I’m Briana aka The V-Soliloquist (pronouns: she/her) a Caribbean American cis female! A random fact about me is that I spend over 20 hours a week watching Netflix! It’s an addiction! Help 😩😩! I also like to entertain myself by talking in the mirror with my Marylyn Monroe voice 😂😂", "mrsmermaidonion": "I love the Eb facts (this is his insta too!) 😂 You two bring me much joy, and give me a lot to think about with your content. Thank you for your work! (Fellow plant mom 🌱🌿)", "jsblzr": "*womb", "lucylpmn": "I’m such a fan of your work! But also... where are those earrings from? They’re so cute!", "graduatedhell": "CAN WE PLEASE HEAR MORE ABOUT YOUR EXPERIENCE WITH PEACE CORPS?", "katy_ann16": "Fun fact: I too am a plant mom and a Sagittarius, and you are a queen!", "bowlegged_pussasion": "My name is KaShawn I’m a cervical cancer survivor and I make all Natural No Chemicals hair oil, grease, and shampoos I’m a mom and married my wife my soul mate 1/1/18 and I think ur awesome 😘", "richpurplequeen": "Hi, I'm Jamaican and one of biggest dreams is to drive and own a whole fleet of what I think Americans call semis( not sure) but we call them trailers....really big trucks😄", "badwolf_onrice": "Hi! My right eye squeaks if I rub it.", "coalcrowncreative": "Everything that you are and stand for is a pure embodiment of what our Audacity Tee represents. Would love to send you a shirt!", "raesock": "I love your account. I feel like it is partly a love letter to Ebony and I love seeing you two together. You obviously bring each other a lot of joy.", "anthony_amorcito": "I was just listening to your April podcast! And would totally reccc Vincent Woodard’s book", "leahjsharpe": "I can’t stop picturing a garage full of frogs! I learn so much from you and Ebony. Thank you for your work. P.s. I’m a terrible plant mom... I’m in awe of your plant rearing abilities too.", "kammie1217": "Hey my fellow Sagittarius @ihartericka. I used to read the encyclopedia as a kid as well as books in general because I was told they make you a better writer. 👍🏾", "nicolevbenvenutti": "😍Gorgeous Ericka!! Inside, outside and completely unapologetically authentic! You’re amazing!", "mortilfjell": "I can’t even with this lime green on you. Stop being such perfection. (But don’t tho). 🖤", "kaleighrose23": "Been following you for a while and adore your work and Ebony’s rapping. I love to learn and this morning read an amazing article on prison abolitionist, Ruth Wilson Gilmore (NYT, “is prison necessary.”). I was previously familiar with the prison industrial complex, profit making of private prisons, etc. but hadn’t read much about prison abolition. So now I’m in a deep dive on the internet to learn more. Thanks for everything, Ericka. You’re one of my favorite parts of Instagram.", "nightdances": "Thank you so much for being here. You so often bring a swoop of amazing energy into my day❤️random fact: dance is my healing:)", "lowcountry_mom": "Hi I’m Melinda I’m 31 years old and I have major issues with white Americans and their “culture” (white washing) Oh and I’m from the south", "katekolenda": "Hi I’m Kate and for the past few years I’ve been practicing self-imposed social media blackouts on every platform but this one every Monday so as to avoid posts about the white nonsense that is Game of Thrones", "amytatina": "Hi! I'm Amy! I almost joined the Peace Corps but I chose to do AmeriCorps instead. Why were you kicked out? I didn't know they would do that. I'm sorry that happened ☹", "chadrific": "i am a jane of all trades, i draw, write, sew, crochet, embroider, work with clay, weave, quilt and bake. i normally pick up another hobby once every year or so. if i can figure out how to make something i will make rather than buy. the downside is that i am a libra and very indecisive so i seize up and never get anything done. im also not an expert in anything i do, close but no", "__mrsthor__": "Hey, I’m Amy. I’m actually scared of the ocean, or any water where I can’t see the bottom. Probably because my mom left cable on when she took a nap while I was a tiny kid and I watched Piranha I and II by myself. 😳 Other than my irrational phobia, I’m pretty boring. I love to cook and wish I was brave enough to open a cafe.", "kelsitenango": "Random fact: I’ve only climbed a fence twice in my life. Once as a child and I ripped my shorts all the way and second as an adult and broke my foot. Never again 😂🤦🏼‍♀️", "iamshaunna_williams": "Omgggg the tadpoles turning into 100s of frogs!!!! One time as a kid I we were crabbing and caught a fish and my dad put it in the same bucket as the crabs and I was terrified for the little fish and cried getting it out the bucket and putting it back in the water. But I mean why aren’t you standing up for T Swift??! 🤦🏾‍♀️🤷🏿‍♀️", "hanhtam_b": "How long have you been an educator??? Also these new facts are so interesting especially the tadpoles one", "texassweethart": "Hi!!! I like to paint my nails and pick all the polish off the following week 🤷🏽‍♀️😁", "mizmeika": "Fun fact you were my coach in the introduction leaders program. I resisted the whole way but you still stood. Did that 7 month kick your ass program again and caused 40 Il's and was #3 in personal registration cause I still did my way. Would've been #1 if I did it the way it was designed. But I'm a beast when it comes to registration In my life and for LM. Thank you for that stand now I enroll & register people to detox their lives from the mind and body", "roze_royze": "Or verse", "reginabeana": "my first thought was WOW 😍😍😍😍😍😍😍😍😍 then i read the caption! i’m not the only one 😁", "tiny_bass": "Not No. 8🤦🏾‍♀️", "carrieshuffles": "When I went to LSU, I would go to class in the morning, work at a daycare center from 3-6, then work at a shooting range from 6-9. It was one of the most bizarre work history moments in my life. 🤷🏼‍♀️", "thecreativept": "Loved hearing more about you ! You’re such an inspiring woman an educator 💕 also a Sagittarius here 🙌🏻", "azurelaine": "In high school I doing cartwheels with my friends and split the seam of my pants all.the.way.around! 😂 Thanks you for sharing yourself @ihartericka ♥️", "darkskin_sunflower": "You are literally glowing to the heavens. Angel from above!’ Skin routine??", "cortneykt": "Ok I have a frog phobia and it’s possible I may never sleep again after reading #5 😭😭😭", "tie_dyed_jessica": "Oh these are all so amazing. I feel like if you wrote a chapter on each of these bullet points it would be a really lovely book 💜 random semi-related fact.. I brought home a bucket of tiny frogs I found by a small lake because they were SO cute and I fed them kix and loved them, but they all died overnight because.. they did not need to eat kix and live in a bucket. They needed the lake ☹️ poor babies.", "itsjnm": "Beauuuuutiful🔥", "alessandravoice": "Omg 8 🤦🏻‍♀️🤣🤣 and 9 about your dad 🥰😍☺️❤️", "uncleirohfanclub": "omg im a saggitarius too", "hey_juanny": "My name is Johnny. I want to work in Sex Ed or publishing.", "fara.oana": "I wanted to work on a cruise ship and was almost set to leave when a friend of mine came back from working 8 months on a Carribean cruise ship and told me how exploitative it was.", "bummblebeeho": "I'm only 16, so there's only so much I can do to learn about my white privilege in terms of professional educators. So if just like to thank you for all the free (!!) content you give to the internet. I see myself called out in almost every post you make, which means I can work on it, fix it, dismantle it in myself. So thank you so so much.", "vetiverandcedar": "Hi! I’m Wendy, I’m a new follower, y’all got me hooked with the cancel culture conversation the other night. Rapidly becoming obsessed with your plant collection, I’m having to give mine all away in prep for a cross-country move in July and I’m so sad (especially about my Norfolk Island pine). Random fact about me: for the last two years of elementary school I attended an alternative school where we had lessons in gym class on swashbuckling and circus arts... and that’s why I can sort of half-assedly juggle, ride a unicycle, and swing in on a rope and rescue someone like I’m Douglas Fairbanks. 😳😂", "nartustrust2": "Hi !!! New follower as a couple of months ago & I love your page 💗 I'm an advertising and graphics design artist - eventual art counselor for sexual assault victims & ptsd sufferers", "kaylasdfghjkl": "You introduced me to @theestallion and it changed my life 😝😜", "itsmekellieb\nVerified": "Verified", "scremilyjane": "Hi! 👋My name is Emily, a fact about me is that I'm a social worker who works with the Deaf community, I'm learning ASL and v eager to be fluent one day!!", "even.more.stephen": "Hi EriCKa (and Ebony) :) I’m Stephen. Random fact about me: I love falling asleep to science documentaries or a story read by LeVar Burton on his podcast “LeVar Burton Reads”. I’m 34 and still find bedtime stories soothing lol", "emilybrianna": "Thanks for the work you do! I instantly teared up when I read #9. I learn a lot from you and appreciate it so much. 🖤", "andreterreljackson": "Hi Ericka! Long time follower, first time caller! Random fact??? I’m an attention seeking introvert Aquarius Lmfaooo", "alliemason.is": "I can’t wait to hear more about your story. Especially there Peace Corp and all of your other various jobs. I love to see how in hindsight all of our experiences tie together into something that influences our current situation. Fun fact about me: I’m almost 33 and still don’t have my drivers license 😬", "_gourmandine": "Hi,my name is Amandine and I am allergic to shrimps, but I love them so much that sometimes I risk it all and eat some! I've been following you and Ebony for a year, I think! Thank you for the safe space you've created here!💓", "postureless": "did you tell your peace corps story on one of the podcasts?! would love to hear", "delasondas": "#5 has me dyin. It’s a great visual. I feel like if I brought home a bucket of tadpoles they would have just died :( Fun fact about me, I’m trying to get my AASECT certification as an educator. That’s not so much fun I guess, really more a fact.", "blackgirlmasculine": "@moonflowernalo", "lyssterine": "Hi I’m Alyssa and my dog almost broke my knee once. Now I know better than to get in the way of his giant head when he’s sprinting around the back yard 🙄 I also want to illustrate/maybe even write a children’s book one day!!!", "msmariamhage": "You missed 11. You are fucking awesome ❤️ Random fact about me, I eat citrus fruit as a whole", "mika_rosique": "Can you please share more about why the Peace Corps kicked you out? I’m considering the Peace Corps", "hopscotch15": "I love playing RPGs on my Xbox.", "lori.sara": "Ericka your intro posts just get better and better. Tadpoles tho??? Hahahaha 😍", "lauralushoc": "Green Dream ✨💚✨", "keshallagniappe": "Hi! My name is Kesha [they/them] and I'm from the Mississippi River Delta and am Cajun Bible Belt Queer, Capricorn, artist, anthropologist and writer. My work is anthropology is focused on the importance of the🌻 unseen be it affect, emotions, the visceral, intuition as knowledge, spirituality, embodiment etc! This work is done to dismantle/disrupt the Eurocentric, heteronormative notions that logic, reason, and only the tangible, what can be physically proven are superior and valid to other forms of knowledge like intuition or emotions. Other than being an artist, I work mostly with children and young adults (I'm a teacher, mentor and nanny on the side) especially those that have recently came out. I emphasize emotional and intuitive validation in this work. Fun fact: I love aerial aerobics and silks and love to fence. Both of these I learned to do late in life (at 29) because I didn't have the accessibility or financial means to pursue them early on. It's never too late to learn something new and do that thing you've always wanted to do!", "carinadesireebrooksking": "My nickname is “Pinktoes” I was really bright skin as a youth and my grandma called me a “pink toe” cause that’s why they called while folks back in her day lol 😂 I also can’t stand dogs I lesss they are chihuahuas because im convinced chihuahuas are not dogs", "kidscissors_finalform": "hi i’m lizzy!!! i really really really like your all’s page. you are so cool!!!! 💘💘💘 a fun fact about me is that i’m gonna start studying next school year (i am currently in high school) to become a social worker!!! (which is also scary bc i potentially could get my msw in five years, and i have p much chronic mental health issues/emotional dysregulation so it’s like i have a hard deadline of five years to recover and get my shit together so i can actually be effective at what i want to do.)", "2leda": "I also feel at home in the ocean. Come visit st Augustine Florida and swim with me :)", "sass__hole": "Have you shared the Peace Corps story before? Fact about me: I am a new plant mom and I’m worried I’m gonna kill them all but I’m trying so hard to love them and give them everything they need.", "loup_kat": "I'm dead about the standing up for Taylor ish 😂", "ajs721": "LOLLLLL #8 😂😂😂😂😂😂😂", "seriously.samantha": "THIS PIC THOUGH 🔥 Thanks for having us all here ❤️", "blackaether": "Hi I’m Javonne! I’m a Sagittarius too and a garden educator. I say ‘spaghetti’ to help me remember things. My mom and I listen to your podcast in the car and pause repeatedly to discuss. It takes us like 3 car rides to get through one podcast. I attended your workshop at Babeland and really wanted to say hello after but people were hovering so I scurried away. So, Hello 👋🏾! You and Ebony are my friends in my head. Okay bye bye. 😂", "nicoleyb": "Hiiii! Name is Nicole. Fun fact about me is I love the beach and going to the pool buuuut, I can’t swim to save my life. 😐 if you throw me in the water, I’m not coming back up 😩. I need to learn to swim. 😕🤦🏾‍♀️", "klmurray85": "I have learned and changed so much because of you and Eb. Thank you! I’m the same way about #10. Random fact: the only “boyfriend” I’ve ever had was in 4th grade- he liked me because he said I was good at kickball. 😂", "courtney.has.words": "💚💚💚", "picayune24": "Hi Ericka! I'm ayun. you and ebony have taught me so much about myself and about fighting the white supremacy everyday. Thank you for everything you do 💜 a random fact about me is that I started to sing again this year after YEARS and it's been beautiful.", "arm342": "New follower here. So grateful to learn more about you. I was adopted as an infant almost 70 years ago, raised Jewish and just connected with my Sicilian Catholic biodad's family through DNA testing. I'm feeling very fortunate. My newfound sister couldn't be more welcoming, and I'm going to her son's wedding today.", "phallon.wright": "You and Eb give me hope that being loved for exactly who and where you are is possible. Sometimes we don’t know what is possible until we see it. Thanks 🙏🏾💛🌱", "kasthepoet": "10. I thought I was the only one", "simonelovesfitness": "Number 8 took me out lol I worked for the peace corps too 😭 and I’m learning how to swim hopefully one day I can feel the way you do in the ocean. Random fact : I didn’t see my mom and my siblings for 13 years 😞😞", "amiliaphotography": "#9 is the best! Always makes me emotional when parents support their kids. Fun fact about me is that I’m a therapist and primarily work with people living with HIV!", "ihartericka\nVerified": "Verified", "gigilee82": "#8 had me hollering. I would've looked at that DM and blinked lol.", "tbizzle_sizzle": "I’m a second generation black Arizonan...we do exist! Reppin black liberation in this whit ass state 🌵💕✊🏾", "fern.galindo": "Omg 🐸🐸🐸🐸", "nowhitesaviors": "“This is essential his insta too” 😂😭 🐢 💕 🐢 we stan a good Ebony rant via @ihartericka stories ❤️", "chromat\nVerified": "Verified", "gaelleelma": "Hi! My name is Gaëlle! I love to eat shrimp, but when I am in my period I only want to eat that(I’m obsessed). Lol!", "leighanndwg": "Love learning more random facts about your life. This list had me laughing (#5), eye rolling (#8) and tearing up (#9). 💚 Random fact about me: I spent my childhood summers in Greece with my father’s side of the family.", "cleelebeda": "Hi! Some facts about me are that I fell in love with dance this year (the videos you share of you and Ebony dancing together are so lovely and special) and I will be playing a sexy duck onstage this weekend.", "hopebroidery": "I will admit to you and Ebony that I always thought I was a Gemini/cancer cusp, but apparently I’m a cancer sun Gemini RISING. I still consider myself a Gemini though? If insisting I’m a Gemini even though an app says “no, hope” isn’t a Gemini thing, I don’t know what is??", "nydiasimone": "I’m triggered when I have to speak about my birth certificate because of the circumstances around how I came into this world. Working on it tho.", "fabulousveganrecipes": "@ihartericka you're so pretty 😍😍😍 also the unplanned thing drives me bonkers as well😂", "seaofglitter": "I also enjoy the ocean. So much that i’ve decorated my home to look like an oceany pirate ship. I pretend i’m an adult bu saying my style is pirate cave couture haha", "thebigfoodytheory": "Wow!!! Gorgeous 😍", "cee_gbolt3172": "Ericka plz do a makeup /skin care tutorial and tell us your secrets! You skin is so beautiful 💯", "paura_lalmer": "I am trying to finish my PhD in history of christianity, I'm also a plant mom and I bake a lot! Been following for a few months and I'm learning and unlearning a lot from your content thanks Ericka!", "copywritebrown": "Guuurrrrrlllllllll‼️‼️‼️", "uche_beeeee": "I’m obsessed with you and Ebony. 😍 You are the truth.🙏🏿🙏🏿🙏🏿", "meredith.kittle": "Lovely and creative intro! Hi there nice to meet you! I'm Meredith. I love showtunes! I enjoy singing and dancing along in my kitchen. For some reason I can listen to a song a hundred times in a row and still not learn the lyrics. My only chance of learning the words to a song are to read the lyrics and memorize them.", "lizzywithlove": "I desperately dislike mornings and feel like getting up is one of the hardest things I do all day but I know each day is a gift so I try to get over myself", "kieranblake": "Ooooh I want to hear the Peace Corps story. Random fact: learned to ride a bike at 35. In Riverside Park with 4 y o zooming past me 🤦🏼‍♀️😳", "jessie_walnut": "Ericka invented neon", "abbeytillman": "I’ve been following for a few years, I didn’t know you worked on a cruise ship. What did you do? (I work in hospitality so i always nerd haha)", "sunny_sonja": "👑👑", "metheinterrupter": "Oh dayum! wakanda black botanics is dis? 🍂🍃🍂🍃🍂🍃🍂🍃•.•", "lulafoos": "Hi Ericka! I've been following you for over a year and I'm always thankful for your content. Fact about me: I play the ukelele. A lot.", "deeperthandesigner": "The most disturbing part of this post was the vision of the frogs. 😩😂 Also random fact: I’m most turned on by my girlfriend when she’s got her retainers in. 🤔 idk what that says about me. 😂😘", "margs_nicole": "Number 5 😂", "prince.ofproduce": "Hey! My name is CUP (they/them pronouns). I'm a farmer boy. I thought i was allergic to carrots my whole childhood. I eat carrots out of the ground now. I'm an Aquarius. I dropped out of AmeriCorp 2 months into my term. I for pay I work solo as the manager of a rich mans hobby orchard. Nice to meet you! 💚💚", "indya_campbell1": "Ooooooh why does \"we didn't plan this baby\" upset you? I've never heard anyone be upset by that! *this is a genuine question - not being shitty*", "sendinglavenders": "why were u kicked out of peace corps??!?!", "mrs_jodiethomas": "Hi! 👋🏼 I love you and Eb together! You ever do a home plant tour? 🌱🌿🌵 A random fact about me is I’ve been with my husband since our first week of college (half my life now)!", "samduran_": "I am studying abroad and I think a lot about how much I am playing into colonialist way of searching for myself. I could’ve found myself at home in the US helping kids at schools just like a do here but my PWI made me feel this way was necessary."}