{"just_adultshoot": "Horroryfyin Follow 👉 @horroryfyin Double TAP for more amazing chilling posts 👌 -👥TAG a friend to show this 💡 -🔔 TURN ON POST NOTIFICATION -✔FOLLOW for mor... - - - - - - - - - - - - - - - - #horrorstories #horrorstory #horrorfacts #horrorfact #creepypasta #unknownfact #horrifyingth ing #things #scary #scarystories #creepystories #creepy #creepyfacts #creepyfact #scaryfact #scaryfacts #conspiracy #theories #theory #theoryconspiracy #conspiracytheory #conspiracytheoriesandchill #shanedawson #strangerthings #pennywise", "jellywooff": "This outfit is great! And you are great in it! 10/10 would wear ❤️👏", "secundrabeasley": "Stunning from head to toe.", "liz_baregu": "@ihartericka brave goddess you are!🔥🤗😘🙌🏻", "giannaeileenn": "I LOVE YOU", "jezmindenise": "You look HOT!", "foto_quioto": "I actually like this on you", "laura_s0529": "It looks great on you !", "8jx.6": "I can’t decide that I liked this photo because of composition or place but it is really good✌️😍", "black_environmental_heritage": "🔥🔥🔥", "jennylouiseaustin": "Love this caption and the way she spells her name 💖 @erickabentson", "moonknighting": "❤️", "themajoritygroup": "😍😍😍", "8ritual8": "You look real nice, this happens to me at times & I have to step back and really look at myself in the mirror and tell myself I'm trippen and feel myself as to why it is I'm actually feeling that way. It usually has to do with not meeting up to my own standards on other activities & the sum up of it all gets me in a weird self loathing mood. But you gotta snap back quick from that 🌟 you look great!", "celizabethforte": "#selflovecanbecapitalist ‼️", "tuhfrik": "Love love love you! #afuckinglook", "waratahblossom156": "Wow. Thanks for sharing this. What you wrote was timely and resonant for me.", "hana_milanah": "Fuckin killin it sis 👏💗", "ju_the_colossal_idiot": "This caption 🔥 this look 🔥", "mayrecreo": "You look like a goddess💕", "hannah_suzannah": "I screenshotted this for style inspo before I read the caption. 🔥🔥🔥❤️❤️❤️", "zipporahthevegan": "@delai_15 check their podcast out! It’s so good 💛", "girllikeschairs": "Damn 🔥🔥🔥", "lordknowsimweak": "You radiate ✨", "lydiataterz": "you look really stunning, love🙏✨", "k.azariarts": "Crazy cuz when I saw this I said out loud, damn she looks amazing!", "alannahradburn.poetry": "This caption 🙌🏻🙌🏻🙌🏻💓", "lauren_samet": "🔥🔥🔥", "mi1kdog": "u r literal heaven 💖", "ayyyoung": "👏🏼👏🏼👏🏼🔥🔥🔥🔥", "seattlelite_in_paris": "😍😍😍", "claudiayankee": "Yasssss! G’head!!! 🔥🔥🔥", "heartskobe": "💛💛💛", "eme_demutante": "You look super 😍😍😍😍", "genuinessa": "Wow... u look incredible! I'm going to take your advice.. it really is about unlearning what was unconsciously learned", "to.thine.own.self.be.trill": "I know this feeling so well and need to “tell on myself” more. You look fucking fire, tho.", "sahjei": "YOU LOOK AMAZING IM SORRY U STRUGGLED TO SEE IT BUT LEMME TELL YA U ARE LOOKING SOOOO GOOD BABES!!!!🔥🔥🔥🔥🔥", "saltyb0y_": "Holy 😍😍😍", "michellelcampbell": "😍😍😍", "katienumi": "So very true. Stay blessed❣️", "meganjuliaaa": "You look beautiful!!", "90s.wild.child": "she lookkkkkks so good 🔥🔥", "onepartelation": "🔥🔥🔥", "kbuena626": "🔥🔥🔥", "issatrae": "this level of honesty. Wow. Well relativity too. I struggle with this a lot a lot a lot. Maybe you know you look good but don’t feel it? Maybe you feel like you look good but somethings off? I do this all the time & I have to remind myself like.... you’re great, you look great you’re a fucking snack. It’s hard navigating self-love but sometime chanting shit in your own head helps 😭😭 anyways, YOU R A FUCKING GOD OK 😍", "its_chris_tea_ane": "You are breathtakingly perfect ♥️", "melonskies": "You're a fucking babe.", "daisy.sparrow": "@taylorwoodford wow beautiful.", "brighton_place": "You look incredible from here 🖤", "chanayethomas": "Btw, you look cuuute!", "sav_christine": "Girl you look SO good. Fuck yeah. That outfit and your body are just killer 🔥😍", "christine_ewell": "U look hot as fuck girl!", "sfosm": "first thing I thought upon looking at this was how bomb as fuck you look in that fit. for what it's worth, which may not be a ton. you look gorgeous.", "heiditrevethan": "You’re so beautiful ❤️", "alxgae": "u always look good", "growpositivestrength": "You look amazing and fierce!", "de_foot_hills": "☺️", "ashhh.jenae": "The look is amazing and you look fucking amazing", "stoneyfamily": "😳😍👏❤️🔥 all of this picture and that caption!", "m0qui": "I’m not sure what self love is other than it looks and feels different for everyone. Still Issa look an you have people to lean on when you need it. You go!🔥🙌🏽🔥", "wallflower.jenn": "I’ve never seen an outfit you didn’t make look good😍😍", "melancholybutterfly": "No way!? Before I even read your caption, my first thought was \"dayummm outfit on fireee\" 🔥", "rachierach___": "I’ve so had those nights. Glad you pushed through!!! And you pushed through! Looking fly as hell 🤩🖤", "anequalexistence": "😍", "stetskiwi": "❤️", "swagner914": "that outfit is amazing and i love it❣️", "theinbetweenqueen": "“You have to constantly tell on yourself to unlearn what you have been forced to believe is true” —hit me real fuckin hard", "mojoandsparkles": "You look hot to trot in this outfit 🔥🔥🔥🔥", "marquitann": "You look amazing 😍", "ritual.symmetry": "You look like a Queen 👑 I’ve started doing something similar where instead of picking apart my body in an outfit I just fuckin wear it because I like the clothes. I love following you. Blessings 🙏", "lindalollipop07": "You honestly look beautiful 🧚🏿‍♀️", "a.vuitton": "you look amazing!", "destiny.inc": "Dang girl 😍", "aqua_slvt": "You look amazing🔥", "lizbills": "You look gorgeous, tearing up. So true. I love that you said “leaving yourself alone” I’m a huge advocate on self love and loving others but I noticed even through all of that I am still a bully to myself. That quote resonates so close to home. I want to leave myself alone too and be free of the bully within, cuz fuck that voice!", "marinadelrey__": "❤️🙌🏼👑", "jeneedelerme": "This is beautiful", "mrs.atcher": "So cute!", "jolinejolinejolinejoliiiiine": "You hit the nail on the head. I fucking hate the world.", "persianvegan_": "Impeccable ❤️❤️❤️😍", "fenix___13": "Thank you", "linneabatey": "You look SO GOOD!🔥🔥", "ladyladyparul": "@selah_genesis 🙌", "dapontefern": "I think you look beautiful Ericka and the outfit so hot!!💕💕 I also know the feeling you speak of too...it's a struggle some days!!💕💕😊😊😍😍", "kaybar1": "Stunning x", "_in_between_spaces_": "looking like a true goddxss🙌🏾", "hobsonhb": "This look is FIREEE 🔥🔥🔥", "floating.paradise_archive": "Beautiful!!", "marilluch": "You radiate", "t.imiro": "Relatable content fr. Learning to hold space for myself by being patient and sitting in the discomfort some days- while simultaneously celebrating this body? Did big things for my mental health.", "msblackawareness": "You look amazing. And that’s NO bullshit.", "_dearprudence_": "this look is bombbbbbbb", "pancakes_bobchin": "@ihartericka It’s astounding how unnecessarily critical we can be of ourselves. I saw this photo and my immediate response was “WOW!! She looks sexy as fuck!!” Meanwhile you felt uncomfortable the entire time you wore this outfit....well for the record I’m digging absolutely every single thing about this pic.", "alysespieces00": "I love this. I needed this. The worst feeling is that when you feel guilty about NOT having self-love. Hard on oneself for being hard on oneself. It’s ironic and shitty. It’s nice to see those we admire being human and vulnerable. It strips away a layer of pressure. So, thanks boo, I needed this right now. Also, you look fan-fucking-fierce-tastic, just sayin❤️", "olympusmonsvii": "shit. would approach 🙋🏽‍♀️😍", "mangomariposx": "You look incredible but I totally get how we see ourselves doesn’t match how others see us for whatever those reasons may be and they’re valid 🖤.", "daddyluvr12345": "Damn😍😍", "finessabuxtable": "This fucking caption!!!!! I know this feeling all to well. Thank you for this because I swear I feel so alone when I don’t like how my body looks in a fit but wear it anyway because I either don’t want to change or feel like I have nothing else to wear.", "ceilidhlacy": "What are inherited thoughts?", "mjtconnolly": "🔥🔥🔥🔥🔥", "mrfruitboy": "@taichi_wallabee don't this look like the Palestinian wine shop off Foster. Nostalgic of our days at the queer mansion. 😍😘💕", "imaliteraljoy": "Literally said outloud, holy shit she looks so amazing and showed my family 😂❤ perspective is a funny thing. You look in 👏cred👏i 👏bul👏 ❤❤❤", "la_mi_ka": "SHOOOOOES 🤤", "aorists": "you look brilliant and your words are even more so", "treefairfax": "😍😍😍😍", "skyisfly": "This is great look !", "buritanipyopyo": "🙌🏻 Powerful", "cornersofmytravels": "Self love is really about unlearning everything you were taught to hate 💙❤️", "balletmeli": "😎 ❤️ your honesty", "iveynyc": "Scrumptiousness 🔥🔥🔥", "dmnd.person": "🔥🔥🔥🔥🔥", "ruthellencraig": "You are so beautiful and inspiring 😍🔥🔥", "o.kami": "Looks good.", "q.ivy": "I always love your style, Queen😍", "micheauxbelafonte": "Looking fresh asl. 🤘🏾🔥💯", "luciagoode": "Love the booties. Thought the nude color was a cut out. I always zoom on your footwear.", "pearlzorn": "Yes thank you for sharing this! I think everything is sold as a destination and we are shamed out of being present to the journey and the messiness of self development. 💕", "apple_headed": "Such a cute look❤️👏🏽", "hayleygeekchic": "GORGEOUS!!!!! 🔥", "sarahjeanloui": "I think you look hot as hell 🔥", "jikes1975": "Yes! Thank you... maybe they’re born with it (self-love, comfort in their bodies) or maybe they are, as you say, leaving themselves alone. (Will I ever tire of Maybeline commercial references? No I will not. )  And the pressure on top of everything else, to achieve self love.... I’m not against self love. of course but mostly I find I’m upset with myself for not achieving it all the time. Sigh...", "ana_____italiangurl_23": "❤️❤️🌹🌹🌹🌹🌹 i know how feels and body disphormia and under weight up and down anxietry and look amazing and can relate gorgeous!!!its and well your beautiful", "madmadyxx": "🔥🔥🔥🔥", "cardinalstates": "Uff 💛 this look is the temperature of the sun 🔥☀🔥", "jewel_thegem": "Your transparency and vulnerability is inspiring. I’m honored to be your friend. Continue unlearning all the fucked up shit we’ve been taught about desirable bodies. I also wanna affirm that you’re sexy af. K bye 😘", "_nattybynature": "You look GOOOODT ✨👏🏽", "badbcomplexco": "Thank you for being vulnerable and talking about it", "shawwnuh": "Beautiful. Thank you.", "krinhoh": "Youre presence in your skin is inspiring. And you're absolute beautiful. Love, a mom. ❤️", "billiewhitex": "Laaaawd😍😍😍", "jameelajamilofficial\nVerified": "Verified", "pomegranateandaspidertarot": "😍😍😍😍💓💓💓💓✨✨✨", "apzell": "Uh rapidly compiling a vault of @ihartericka oneliner’s - “you have to constantly tell on yourself to unlearn what you have been forced to believe is true” 🧠 💥 😦💚", "lovesherline": "😍😍😍", "_were_all_mad_here_": "You look fucking phenomenal. 🔥❤️", "cecibaybay": "I've only been following you for a few weeks. In that short period of time you've shown me what beautiful can and should mean! Fuck beauty standards! Fyi you look bomb in that outfit. Frfr❤️", "losingsheep": "@maefaced", "cassirosee": "😍😍😍😍🔥🔥🔥", "heyitsmekita": "🙌🏾😍❤️ Omg this look is 🔥 #issalook", "yesthatlindsay": "💖💖💖💖", "endlessbutt": "this outfit was made for you", "original_gata": "You look amazing and I fully appreciate how hard the self-love journey can be. It’s a journey with many pit stops, u-turns, closed roads and pit holes, but don’t give up. You look absolutely incredible!", "marciegoldman": "@thearielviews there's no arriving at self love", "lialaurine": "😩😩😩😩🔥🔥🔥🔥🔥", "jessdavenportvalencia": "Gorgeous 💕", "rowena_kosher": "This caption really resonates with me. Trying to reach “self love” usually just makes me feel worse about myself for not being able to. Really love the idea of inherited thoughts. Going to use it in my mind next time I feel hate towards my body. Thanks 😊", "simplewisdomwithin": "@thegodsdogambol", "amnaeatsyourface": "OMG perfection! 🔥🔥🔥", "paninifuckinchowder": "you are gorgeous!!", "nubianfelinity": "You looked sexy. You are sexy...and smart and funny. JUST KNOW THAT AND NEVER DOUBT!", "denengethefirst": "😍😍😍😍😍", "power2beeflower": "🔥🔥🔥", "creativevixenwi": "Love the outfit, and you look gorgeous af in it. I’m glad you told your inner critic to fuck off and went with it. I hope you were able to enjoy your night!", "spamanthamarie": "THIS OUTFIT! You killed this. Absolutely killed it!", "rosso_gelsomino": "Gorgeous ❤️", "granola78": "Someone called me pretty the other day and I stood their like a moron blinking a lot and not knowing what to say. I was a homely, chubby kid and to me that is just who I am all of these years later. I have always dressed as simply as possible so people won't look at me \"on purpose.\" I am trying to \"unlearn\" all of this so I can be \"forty and fabulous\" - whatever that means. 😐🙄 P.S. I really like to use quotation marks, apparently. P.P.S. You are the most beautiful plant mom that I know. ❤️❤️", "donna234rae": "Gorgeous.", "mekdibaby": "😍😍😍", "nurselolita": "You are so beautiful. Holy fuck.", "sgraceoconnell": "Stunning 😍😍", "yuk0nsam": "Aa soon as I saw this I said ‘wow I have to tell her how fierce she looks!’", "kidcasser": "Beautiful", "missfield999": "I love that you wore it anyway but honestly you look amazing. Yeah I'm never sure how to feel about body positivity/self love. I don't LOVE my body, like I still feel conscious of some parts and I am fully aware that's kinda shitty as I have the privilege of being cis and slim BUT I think I've reached a happy medium where I can honour those feelings and not let them dictate my life at the same time. Anyway I'm rambling, thanks for all you do", "beemama8": "My first reaction to this photo was “Fuck, is there anything this femme can’t rock?” Everything about this outfit and you is amazing. How we see ourselves is always a challenge. We see you as confident, badass, gorgeous, fashionable... Your transparency is telling us how you really feel helps us all figure out why we feel these things against ourselves. Appreciation. 💕", "unamericandragon": "You look so good Erika! Thank you for being you! Sending Love 💜", "lorenaismyhero": "🔥🔥🔥🔥🔥👅💦💦💦", "j_a_zarifian": "You are pretty stunning.", "lila_desouza": "Breathtaking beauty. You've got this!! 🔥🔥🔥", "saruh.williams": "LOOOVE this outfit so much 💖 I’m glad you decided to wear it anyway", "amarachimera": "You look amazing ❤️", "naturally_fitlondon": "Loving you in the outfit sis 😍 banishing the negative self talk. Not today Satan!", "criavolver": "You are fire.", "wasabiseth": "You look amazing. One of my favorite outfits", "fettuccina1": "Before reading the caption my thought was \"she is so fierce. So bold. So stunning", "melisssa_v_": "Beautiful ❤️", "revjuliaroth": "Truly stunning 🔥🔥🔥", "aerialmichelle4": "Beautiful 💜😘🔥", "seaofglitter": "It helps me and i’m sure others too", "theealchemist": "This is crazy, I had a similar experience this morning, but I actually seen this earlier before I responded to your other post and was like ayyyyyyeeeee! I like the fit. I put a bookmark in my mind to come back after my thoughts on that otha thang😄 I actually found inspiration in you (in my lil moment) reminding myself that all of me is sacred and tender. Sending love again. Issa vibe today, love that is! Glad we had a chance to connect today. The ancestors are gifters. *BLASTS STILL FLY* 🤸🏾‍♀️🤸🏾‍♀️🤸🏾‍♀️✊🏾😊💕😆👢👞👢👞", "whopaigejones": "😍👑", "napppturner": "I fucking loveeee this look!!", "delmarinalopez": "🍤🍤🍤🍤♥️💋", "the.jazz": "😻", "witchfingermart": "🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥", "cholapaola": "Que guapissss 🔥🔥🔥🔥🔥!!", "pinknacl": "You should add \"stylist\" as part of your career description. The colors, balance, creativity, and fearlessness- just a joy to behold.", "oshun\nVerified": "Verified", "cocotough": "This fit is straight 🔥🔥🔥🔥🔥🔥 Lesson learned = wear more outfits that I hate my body in 🤣", "blackgreywhite639": "I appreciate honest vulnerable posts so much. My friend i love humans that defy standards and make it look fire. You radiate beauty inner and outer.. Women are so fucking beautiful and i am greatful for women like you who prove that point completely and go against the illness that are the standards of society.", "mccalla_hill_art": "Stunning. So stunning.", "sharonalautoe": "I was saying to my mum how I wanted this sense of fashion. I am inspired by your looks. 💛", "mbeard97": "I had this same issue last night. I went out to a club for the first time in a year. This June marks 1 year of no shaving and I hadn't properly been out in any outfit that showed my body hair. I haven't arrived but I'm much closer to the fuck it attitude I desire.", "catherinestarnes": "👑 👑👑", "c4minho": "Boss!! 💪🔥", "_megan.hurley_": "“Tell on yourself” ❤️", "lovemolella": "Damnnn okay!! 💕🔥", "titilola_will": "😍", "stephaniemadeit": "😍😍😍", "nuncia_maria": "I also saw this and thought/wished that I had your style and confidence. As much as it sucks that we all have these issues, it helps to hear that even my heros have their struggles. Thanks for always being so real and honest.", "quani_mc": "Well you’re my fashion crush. Always admire your style. Nothing like others just simply divine. Who tf knows what self love is? Half the time I’m not even sure of what love is but I manage to press on. Learning to unlearn the misguided information that poisoned my mind.", "mashon221": "Thank you for sharing your journey, vulnerability and strength. I’m in a major clinical depression but I’m getting out of bed today because of you. Your honesty and wisdom makes you so amazingly beautiful.", "jujua714": "Love this caption!", "aheartlikeastonecottage": "LOVING your body in that outfit!!!!", "maruskaalbertazzi": "You look amazing in this outfit. I’m not so sure about the bag, but the oveall effect is stunning.", "agua_espumoso": "You look incredible.", "big_buddha_boi": "Yess ❤️ plus, you’re killin’ it!", "drjennyjenn": "Dopeness. Personified 🤗✊🏽😽", "thedivinedame": "Goddess.", "lene_8_8": "Yes!!!💗", "karmapoliz": "Wow. Please let it be known that this wow is in response to both a) the language of inherited thoughts - which is so perfect - and b) how fantastic you look.", "alishanandi": "I want this look head to toe😍 But I’d probably feel uncomfortable too. Probably go to the bathroom to cry out my anxiety and then I’d kill that shiiiiiii😂", "little_gem_designs": "I know you won’t believe me, but from the heart you look beautiful. X", "jennydetergritsch": "Breathtaking 😍", "soy.mamacita": "You inspire me in so many ways. Thank you for everything, always 🖤", "aarynnlang": "You look amazing. A lil bedrock, but make it fashion.", "anahata_joy": "White lady respectfully holding back compliments on this one....but definitely still thinks them. 😍😉", "iischristy": "Come the fuck through!!! 😍🔥🔥🔥", "meghantonjes\nVerified": "Verified", "brianajacosta": "This outfit 🔥❤️", "na_luu_": "Love your style and you look beautiful", "themelissadenizard": "You killed this lewk, Ericka!👏🏽", "resetrefocus": "Wowww thank you for being this vulnerable! You really show how u can’t tell what ppl r goin thru on the inside cuz u really do look phenomenal 💖", "theunrulywoman": "@rresn And this too.", "it_be_denise": "“Chiiiiile if you don’t staaahp!” I know you know how i said it and exactly how it was meant. 😍 Thank you for sharing a part of yourself because we’re fighting that same nagging voice in the back of our minds. Thankfully the “they gonna get this outfit and boddie yoddie“ voice won!", "blacmagic_woman": "i love you, and am constantly thankful to listen and learn from you💕 still figuring this all out myself, everyday is a struggle, SO much unlearning. But people like you, and spaces like this remind so many that we ain’t alone. One day and one SLAY at a time✨✨✨✨", "tell_you_what": "thank you for posting this! I feel like sometimes it’s nice to scroll through the archives and land on something like, “damn, I felt awful about myself that day but I actually looked like a whole ass snack” and I wish this for you 🙏🏽💗", "alllibc": "You look wonderful 💞🔥", "myledisrm": "Hermosa. 😘", "anshruthaa": "You look bawse", "francesgolightly": "Same with every outfit. Weirdly cancer gave me more confidence with clothes on. Way less with clothes off though.", "ktend": "💗", "sugaring.brooklyn": "Woah! I’ve been thinking about this so much… At 43 after literally a lifetime of body positive fucking affirmations and advocacy I can still feel fucked up and ahead over my body. I literally have to make hard choices every day like this. Thank you for validating.", "tashaknows": "“Honoring my inherited thoughts as inherited thoughts helped.” Damn. So I didn’t even know that’s what I was doing until you put words to it. But that’s exactly it. My thoughts be “oh well this is what my body looks like and I can’t attach myself to the outside world’s agreements about that. I have to live here.” But what you said is exactly it. Thank you for this vulnerability I needed that shit 🙌🏾😭", "jsblzr": "You look so good tho!!! 😍 I swear we are our own worst critics! Ugh!", "other_sider_girl": "This whole outfit is amazing ❤️I’m glad you wore it. I feel the same way about pink", "sarah.finegold": "A cool ass outfit and you stayed it", "jeniaron": "You look AMAZING", "ephigeniablue": "Agree with the other commenters that when I first saw this photo I was like “wow. That’s fucking badass and beautiful.” Then I read your caption. It both sucks and is awesome that we all relate to that feeling. Thank you for being honest and open. 💙Next time I feel bad about my looks I’ll think “you know what, Ericka thought she looked bad when she looked amazing so maybe I do too.”🙏🏼💙✨", "nessa_bess": "Whew! 🔥😍🔥", "martasnaefridar": "This look 🔥🙌🏻", "theblackplanter": "Ooo yes. I go through this process often when getting dressed. I'm working on it. Thank you for this", "iammiss_dee3": "A continuous conversation of self love that can never stop💕", "ambergabriela": "Queen", "candycemarie": "Looking bomb dot com 🔥 My first thought when I saw this; fuuuuuck, I need a denim skirt now.", "saraspondasmile": "🔥", "thinkinfinity": "You are gorgeous!", "who_is_ali_sugar": "I know it’s not the point, but you look amazing!! Here’s to the learning ✨", "vivalacocoaa": "Wow. You look really great. Thank you for wearing it anyway. You inspired me to do the same when I feel this way", "dtursi": "“There is no arriving at self love...” oooof... needed to hear that this morning. 💙💙", "basic.987": "you are the 💣", "ultralightdre": "Yes! it's less about a destination, just a constant deprogramming of the BS. I'm so glad you wore it anyway. It's stunning and you look amazing. 💗", "missbirney": "Love your outfit.🖤", "that_boy_aint_right": "\"Inherited thoughts\" is such an excellent phrase. Also, you look amazing 🔥🔥", "samseesworld": "You are the most beautiful 🔥🔥", "e_run": "Saw this in your stories and thought, daaamn this outfit is hot! 😍🔥", "lisawinnerphotography": "I wish I could pull off that outfit! You look fly as hell. ❤️", "spring_is_here415": "I love all your fashion choices and you have a beautiful, strong body. It is hard to unlearn the lies that society tells you about you. Just yesterday a man passed by me and said “go on a diet, you fat bitch”. We are at war with patriarchy every day. We some strong ass individuals to survive such brutality. You remind us to push on with your bravery and vulnerability. You are 🔥.", "zchelz": "You look amaaaaazing boo 🥰", "nocturnalreignbow": "Yes push through! Because you did we got to see this look and ma’am you look good asf 😍", "caro_lou_warren": "You look stunning 😍", "l1zzybell": "Needed this just now. Thanks! And you always slay.", "nazilivesdontmatter": "self image is so fucking difficult. thankfully you have all of us to see you the way you are! looking GOOD as shit", "soulo_gypsy": "We're cheetah girls cheetah sisters!😍😂", "_mackenziesullivan": "Why did you wear it if you hated your body in it?", "k_carbon": "Before I read your caption, I was like “hot damn, she looks amazing.” You do. You really do. I love that you’re so honest though. All we can do is power through those negative feelings and show up. Xo", "mayralouise\nVerified": "Verified", "kdubrall": "I feel like this a lot. And you, btw, look beautiful. 😍", "l.escoffery_": "....and here I am thinking that you are a model and that you style effortlessly....that models don't have to be stick thin @ihartericka", "sharonmsowell": "I needed to read this❤️", "char0804": "It’s crazy because I saw your Instagram post of this outfit and immediately smiled... you honestly look stunning! .... tell those thoughts they’re gonna have to take an L on this one", "thefitbritt": "Girl you look sooo bomb!", "itsmekellieb\nVerified": "Verified", "christinamstuart": "I can absolutely tell you’re not comfortable. I’m a professional photographer and soul seer, though, so I see on a very different level than most. You look amazing and I’m so glad you went out anyway! Facing those inner thoughts and reprogramming them. Thank you for sharing!", "kalyptic_cue": "🔥🔥🔥", "nicoler30": "You look stunning", "anuva_nabiha": "Yasssss", "sharonandfrankie": "You look amazing 👍😊", "nickdariushtaubes": "💯", "icwithpeace": "Thank you for the transparency. I have been struggling with similar thoughts. As I search for “a perfect” outfit to wear for graduation. 💛", "kieranblake": "Self love is so flipping hard. Obvi easier for some. Thank you for the honesty. And for wisdom and for looking gorgeous.", "futurowoman": "Thank you for your transparency. I never swam in public (in mainland America, land of fat shaming galore) between the ages of about 11 until 41, because I was too insecure. Then I realized, wow, look at everything I missed out on! I was ashamed of myself. It's a daily practice but I keep trying and seeing you and others reminding me that I am worthy regardless of whatever my perceptions of others' perceptions of my body are, well, it's priceless, thank you.", "one_dope_chef": "U look bomb 💓💓", "blonnnded": "YOU LOOK AMAZING 😭", "fara.oana": "Damn, Ericka, I look at this pic and wish my progress would be so far along thag I'd feel confident in that outfit. Yet here you are telling us you weren't feeling 100% in it. And that's the essence of the self love journey, sometimes you have to let those negatively self conscious thoughts just happen and navigate them even if it's not the most comfortable of feelings. You look amazing tho ❤️", "livie_dee": "Can't tell at all. Amazing what ppl see vs what ppl internalize. Way to take yourself on that unlearning journey 🌱 I love this outfit so much", "jordanisjustfine": "You are very inspirational to a lot of us, I think. ❤️", "shimmyshaker": "Feeling that last sentence hard. Ive been making more of a practice to leave an outfit alone lately as well 💖", "msdsantos6": "🤗😍👏🏾👌🏾✊🏾", "vegetab.le": "YOU LOOK SO GOOD FUCK", "muliana____": "Your perspectives are always on point", "verovivaldi9": "😍😍😍 beautiful. Thanks for sharing. It sucks that you were uncomfortable but your caption says it all ❤️", "mrempoo": "Thank you so much for this ♥️", "gemmaprunnes": "Ugh!!!! Word. This honesty though", "chillsworld_": "You’re not alone ♥️", "wavywednesdayyy": "Baby 🖤", "miss_griffin08": "I love this and your words are beyond truth 😍", "sjames18": "Thank you so much for sharing this - it’s so affirming to hear that you have to work at this too, and that it’s important to keep working 💗", "myrimirmir": "I love you and THANK YOU for the reminder of “inherited thoughts as inherited thoughts”. GOSH, that hit me GOOD! 😭👏🏾❤️"}