{"manekibastet": "You've got this! ✨🙌🏻💯", "jennabrig": "Sending you all love and light 💕", "username70passwordvixxen": "Agreed! But you got this!!!", "buhada": "💜💜💜💜💜", "gollybrittany": "sending all the love and positive vibes. i drove my mom to/from and stayed with her during every one of her chemo treatments. many nighttime foot rubs and promising her that she looked gorgeous without hair (because she TOTALLY did). she's been in remission for over a year now and we are so blessed. i whole-heartedly wish that same blessing on you a million times over. ❤️❤️❤️", "alielimakapea": "💗", "queeringqueering": "All the best possible thoughts and wishes to you!", "tessholliday\nVerified": "Verified", "sylviabvee": "I love how open you always are 💛 . Hope everything is ok.", "lyferic_official": "https://youtu.be/5TIQrSu3q9s", "sea_sylph": "Wishing you everything you need in this moment x", "beaderbae": "Lmaooo", "doodystyle": "Sending you all the good juju and love! I know this feeling too, I have my next one next week. #alwaysmakesmewannabarfandhide", "holly.metcalf_": "I can’t imagine the anxiety going into a follow up appointment. Sending you lots of light and love. #warrior", "ro.takeyourspace": "💚💚💚💛💛💛😙😙😙", "oyveyimblitzed": "Good luck!!🙌", "iamcocoliscious": "Holding you in my heart💖", "kiki.did.it": "This here is powerful 💪💪🔥", "queentinachindori": "Follow ups are so hard...💛💛💛 You , my baby are a champion! I love your desire to be happy! ! Greetings from Zimbabwe Africa!!🔥🔥🔥", "maryyasmine": "My thoughts are with you Ericka! You’re a bad-ass! (Love the underwear!) 💋", "remy_that_blue_rat": "Hey pal! You know you do have a gender. You can’t just say you’re something when you’re not for example, if I say I have one leg but still have two connected do I have one leg?", "hcansevdi": "Is that male panties?", "susanayuan": "Just wrote you a PM and dozens of comments on your pics. I am a Spanish journalist, hope you can read my PM on IG and let me know", "hussein_jaafari": "@a.z.shakoury @alisoheeil @emil_a100i @salimi.mehran @ashkn.sh", "contextandco": "🙏🏾🙏🏾🙏🏾", "lisanelsonlevine": "Sending big love and healing prayers. 💛💛💛💛💛💛💛", "liberatum\nVerified": "Verified", "baultas_47": "Sending my love 😍", "jaquecoco": "Sending you so much love💞💞💞💞💞💞💞💞", "pignolia": "❤️❤️❤️❤️❤️", "social_butterfly.77": "Hardest part!kick butt", "findyourselfherenow": "❤️❤️❤️❤️❤️❤️❤️🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏", "l.escoffery_": "Much love😘😘😘", "momminaround": "💗", "writerwrenee": "Cute panties, and awesome that they match your shoes. Hope things went well.", "vinvinlives": "♥️♥️♥️", "introvertedblackgirl_": "❤️❤️❤️", "d_ellyse": "I hope all went well and you are feeling peace! ❤️", "elkhornvintagesupply": "all the ❤️❤️❤️", "linds_a_sutton": "It’s truly terrifying. Sending you strength to accept whatever the outcome is. 💓", "gilterken": "sending a fuck ton of love as you wait for your results 🖤🖤🖤", "tbyrd2884": "Sending so much love!!! You got this!!!", "balletmeli": "🙏", "thenotsoavgbermudian": "💕💕💕", "apple_quiche": "Sending you love ❤️❤️❤️❤️❤️❤️❤️", "susansri": "I am late commenting here, but I hope all went well today. I know this anxiety all too well (5yrs out). Thoughts and most healthiest of wishes to you 💪💪", "melodrama_llama": "And yet...you make a hospital gown look BADASS. All the love and juju.", "heiden.lundberg": "💕💕", "bex.benson": "Wishing you all the best 💗", "remoterenegade": "You know, I’ve just been admiring this shot, zooming in and gently allowing my eyes to take in your beauty. I felt my heart swell, at the sight of your being, in all your glory. The contours, lines and textures of you that are just so real and delicious. It was only after I came back for a second look that I started paying closer attention to your shift and it started dawning on me that it’s a hospital gown. Honey, it’s testament to your mighty fierce- and fine-ness that you can rock this look in a way that fills up the space and you totally own it - outshining any sense of hospital and the fear and anxiety associated with these visits. Sending you soothing, supportive feelings. It’s only natural that the follow ups bring a multitude of feelings to come visit. See how many of us are holding you in our thoughts? We got you. Just lean a while and take a rest. Pls keep us updated. xxx", "jtisthebestyo": "Hope it went well! I love your shoes by the way!", "thewinterphoenix": "❤️❤️❤️", "liadee": "Sending you love and light", "caso_whatsup_": "Sending you all my love ❤️ everything you do helps so many groups of people be seen and heard, and makes people see what they refuse to see.", "omaaffun": "💙💙💙💙💙", "natasjiaa": "You wear it damnnnn well 🔥❤️", "tinarita_m": "Sending love always & prayers for good health", "autumnjane": "Sending love and good luck you beautiful soul💗💗💗", "pisces_deluxe": "Sending ❤️ and 🙏🏽 they found a lump in my left breast but it was not cancerous and too small to remove. I do have chronic mental and physical issues also. They just want to monitor to size and shape of it. ❤️❤️❤️❤️🙏🏽🙏🏽🙏🏽🙏🏽🤞🏽🤞🏽🤞🏽🤞🏽🍀🍀🍀🍀 and everything else to you!!", "ahhhhlisa": "Sending clear scan thoughts and ❤️", "moonknighting": "❤️❤️❤️", "sunshowerplants": "💫", "kharileigh": "🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "saila.anitta": "Hope you are ok and everything continues to be ok with scans. Sending you strength on this day.", "tgrbass": "❤️❤️❤️❤️❤️", "amaznnay": "👏🏾👏🏾👏🏾 Strength", "iischristy": "Love you. Ava and I are always sending love. ✨", "simplyherfav": "Sending all the prayers your way girl!! 💙💙💙", "bayleaf555": "💜💜💜", "bluth_ish": "Love ya! ❤️️🧡💛💚💙💜💖", "tainamakesthings": "Sending so very much love!", "curlmeloncamp": "💖", "imaquariusjones": "Sending all the love", "plantblerd": "Sending mad love and light! 💗💗💗", "cindyleealves": "Femme you know I i I i I love youuuuuu 🎙💜🙌🏾😘✨", "hijx.de.nopal": "all the good vibes that you hear good news👐🏼✨🌸🌸🌼", "ultra_momma": "Sending you tons of love & badassery vibes!!!", "theculturalasset": "❤️❤️❤️", "tina_b81": "❤️❤️❤️❤️❤️❤️", "tosha.snaps": "Sending you all the love bb 💕💕", "futurowoman": "Sending my best vibes!!!!!", "raggedy.han": "All my best love and juju to you ✨✨✨✨", "cheesybunnie.84": "✨❤️", "hearher_roar": "Sending love and light and cuddly puppies", "k.elseyk": "🙏🏼♥️", "possumxqueen": "Sending all of the positivity, love, and light your way. ❤️🙏🏾", "glitterandhotsauce": "💕", "marire": "♥️♥️♥️♥️", "tenzin_phenthok": "💗💗💗", "slowhoneyhome": "🖤🖤🖤", "ebporter": "Sending you lots of love, good vibes for great results! ❤❤", "nicoleheinen.nl": "Wishing you all the luck and strength in the world 💪🏽😘💕", "ktluvstx": "✨sending✨all✨good✨healing✨things. May you feel loved, supported, and safe as your day unfolds.", "camerashymomma": "sending you good vibes. i’ve got my cancer scans tomorrow. also? you rock that hospital gown!", "_run_fatgirl_run_": "Those shoes! Positive vibes, Ericka.", "collectsunrays": "Good luck 🙏🏻", "karinelipstickqueen": "Sending hugs 🤗 💋", "apurenoir": "May Allah be with you and those who have to endure the same journey 🙌🏾", "maymillington": "Sending you all the good vibes ❤❤❤", "deadspooky2": "This may be a weird statement but I love your underwear, it’s so cute and I can never find underwear that fits my stomach properly", "azurite.e": "🧡🧡🧡🧡", "thespomancer": "💜💜💜💜💜💜💜💜", "auntamelia": "Just got out of my quarterly CT, I’m doing great with stg. 4 and the surveillance is so triggering!! Sending love.", "theimmaculatewitch": "♥️💗♥️💗♥️💗", "brrawrr": "💜💙💚💛🧡❤️", "nicolettemason\nVerified": "Verified", "smarvelous.wanderful": "🙌🏾 Prayers and blessings, auntie. You and Eb will be in my full moon ritual tonight, abundance and gratitude 🙏🏾", "mhurst00": "❤️", "heyheyhaleyjo": "Sending all the love, positive vibes, thoughts and prayers high high up for you love. You inspire us all so much. 💜", "iamqueenkai": "Sending you more strength and peace, the ancestors got you ✊🏽✊🏽✊🏽", "clarafrisoni": "sending you lots of love!!💕💕💕", "spideygirl91": "Fingers crossed!!! You got this! 🙏🏽🙏🏽🙏🏽🤞🏽🤞🏽", "levres": "Sending love! 🙏🏻💗", "albielaird": "💗💗💗", "holistic_hedonist": "Still crackin jokes #inmycalvins 💪🏽💕", "hostenashley": "There will be a movie about you one day. 💪🏽", "bravebird131": "Sending you so much love and prayer.", "uche_beeeee": "Sending you love and positive vibes!!!", "toxictreat": "*sending love intensifies* 🖤🖤🖤", "flamingtashhh": "my mom started her chemo last week. seeing you and so many folks talk about their healthcare is so helpful and has given me so much hope. thanks for being so transparent about this!! sending sm love and good thoughts your way❤️", "ashangrila": "🙏🏻❤️🙏🏻❤️", "montanocrochet": "You and your body got this!!! Sending all the vibes, and telling the universe to have your back!!!", "ohko_": "♥️🙏🏽", "yosefozia": "To much clothes to be Kanye West line.", "toylsan": "I'm rocking this look", "bekka1243": "Sending so much love your way today!", "currygoatfables": "✨💗💗💗✨", "hannah_christine96": "Thinking of you and sending positive vibes ❤️ I know that doesn’t necessarily help but still.", "glitteryfemme": "Sending love and positive energy your way 💗💗💗", "etymologyjewelry": "Sending love. My mom went through breast cancer too. She just made it to the 10 year survivor mark :)", "beautiful_cocoa_": "Sending you all the love and positive thoughts for healthy results. Also, all the baguettes and plants ❤️", "lisathelawyer": "❤️❤️❤️❤️❤️❤️❤️❤️", "inespatrick": "💛💛💛", "brick_city_homeschool": "Sending big love and all the good thoughts💕", "hotsaucejoce": "We love you & are here for you Ericka💞💞💞 also your shoes are so fly", "a_mellow_world": "💜🙏🏽💜", "suthrncan": "💖💖💖💖💖💖💖💖", "jendawsonart": "sending lots of love and light your way 🌞💓⚡🕯️💗", "bookisabella": "Much love and light", "clementines_mama": "✨🙏🏽💖💕", "danadantet": "Sending good vibes and lots of love your way 💖✨💖", "oshun\nVerified": "Verified", "jessicaaahhhhhhh": "🌈🌈🌈", "rileyandlunaadventure": "🙌🙌🙌❤️❤️❤️ you got this! All the love and prayers.", "reanimateddoll": "💕💕💕", "serpentfire": "Sending love. Follow ups are SO anxiety producing. Fingers crossed everything continues to be well ❤️", "monicamonfre": "Sending you all the vibes. I know this journey now but you are every single breast cancer thriver and previvors inspiration.", "kaymbee_": "Sending you all the good vibes today 💖💖💖", "maisyns_daddy": "So much love and good vibes sent to anyone who ever has to get follow-ups. So much love sent to the loved ones of those going for follow-ups as well. 💙", "papayedreamer": "💗💘💖💗💘💖💗", "garbage\nVerified": "Verified", "divagirlrn": "Sending prayers and good energy your way.", "hlopac": "🙃🥰😘❤️", "samanthazyski": "💜💜💜", "sophiawallaceartist": "Thinking of you and hoping for the most caring team, least invasive procedures and healthiest results. ⚡️✨⚡️", "mujerplanta": "Sending all the healing love and energy your way. You got this and you will be on the other side of this soon 🙏🏼🌹", "lovaeij": "Sending love ❤️❤️❤️", "sommeliere.bryn": "❤️❤️❤️ lots of love to you!", "boyarbeebs": "❤️💚", "tarynshultz": "♥️♥️♥️♥️", "kari.no.bull": "Sending you courage and peace!!", "basic.987": "I wheezed 💀💀💀", "restwithme": "I just scheduled my next MRI and it was denied 😂 oh well! I guess I don’t have to go. Womp womp. It sucks having to advocate for something you don’t even want to do in the first place. You look fierce tho ❤️", "spritzi_mcgillacutty": "I know that scanxiety. It sucks. Sending prayers your way for CLEAR CLEAR CLEAR results! ⭐️", "inkindspace": "Follow ups send all those tingles back to you! Keep breathing!", "hayley_keaton": "My husband has to do those. Not fun. Sending up prayers for peace and good results.", "kieranblake": "🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻🙏🏻", "learninhowtobe_critter": "Sending love fortification and cancerlessness!", "kitt.katt._": "🙏🙏🙏", "bigblackpants": "Prayers up...been there...", "kazmo78": "✨💫✨💫✨💫✨", "serendipitouswool": "Sending positive vibes and hugs ♥️", "iammiss_dee3": "🙏🏾🙏🏾🙏🏾", "hollswellthatendswell": "Sending love and hope for clear scans", "elliottsailors\nVerified": "Verified", "sarahewheelerr": "Sending love ❤️", "rasta__vibe": "✨🙏🏽✨ relatable praying for good results", "rxmancandle": "I wish the best for you 💗", "berrysherry08": "Worst part is when the scans come back and they find out the cancer is back. Me and my mom are back in the battle again", "mariechristinematthieu": "🧿🧿🧿♥️", "simimoonlight": "Sending you tons of love 💗", "sensitiveassfish": "❤️✨", "what.does.real.mean": "I don’t know if anyone life is more valuable than another life... I don’t even know what I know anymore thanks to you (honestly, THANK YOU).... but this world can not lose you. 🔮 juju 🔮juju 🔮 juju 🔮 juju", "kristabelle1210": "Thinking of you!", "authentically.mj": "💓💓💓", "headmomincharge": "🙏🏻💕", "crimson_fig": "All the good juju ✨🙌🏾✨ #fuckcancer", "alto_acumulus": "Lots if positive vibes and well wishes from London!! xx", "elmath1": "Love and hugs and prayers and peace 💕💕💕", "tanisalexis": "💗💗💗💗💗💗💗", "tlikey": "💐💖 good vibes 🙌🏾", "valngrant": "Praying for you, sending love and healing energy.", "missmisha79": "Sending you love and light💕💕💕", "blackvelvetwinks": "You got this!!! 💪🏼💪🏼 Sending you lots of prayers your way ❣️🙏🏽", "rhl": "On scan days, my blood pressure is at stroke levels.", "benadrylkween": "💕💕💕💕💕💕💕", "umi_sayssmile": "💕💕Sending you all the positive energy and support, Ericka. ❤️", "treefairfax": "✨✨✨Sending alllll the good energy and love your way ✨✨", "afropeanblues": "Sending lots of love ❤❤❤", "cvanvaley": "Sending you lots of love and good vibes. Scanxiety is scary and hard. It would throw me off for weeks leading up to the appointment.", "brsuga": "Sending all good vibes juju my prayers thoughts and love your way 👑", "ashleelovelee": "🧡", "stephanieugenia": "STYLE ICON, MAKE WAY 🙌🙌❤️", "can.i.bee.lamer": "As someone who deals with chronic illness, I feel you pain and anxiety about procedures and scans! I hope all goes well and that everything is good and healthy with no signs of relapse 💚💚", "camille.xk12": "Omg I love ur shoes!", "kwharas": "💜", "brianna_lynn_boss": "Sometimes the unknown is more anxiety provoking than the known. All good thoughts headed your way ❤️", "j_a_zarifian": "Huge love and light, lady!!", "soucymir": "Sending love and good vibes ❤", "erin.k.monahan": "Sending you all the love and support, Ericka!! You got this 💗", "jimmycartersufo": "Me and my mom (also a cancer survivor) are sending you love and thoughts and good vibes and prayers", "emilyorr": "Sending all the good vibes your way!", "carlos_alberto_roa_carmona_": "😍😍😍😍😍😍😍😍😍", "jamielikesmakingthings": "Sending so much good stuff and love", "beccashetler": "Praying for courage and peace for you, and a good report!", "erikalindwall": "❤️❤️❤️❤️", "larissa.ramey": "Sending love!", "nlkaplan": "It you’re open- I’ll send you long distance reiki!", "minda_price": "Sending lovee and prayers💕💕", "revolutionary_mystic": "Sending so much good juju and prayers for optimal outcome! 🙏🏽💜", "hagnamedhayley": "❤️❤️❤️❤️❤️❤️❤️❤️", "emilyscollins": "❤️❤️❤️❤️💪🏼💪🏼💪🏼💪🏼💪🏼", "waffle_pockets": "❤️❤️❤️❤️", "chivisnax": "❤️🙏🏾🤗", "lucia_newell": "Sending All the good vibes your way!!! 💕💕", "annaolovely": "Best wishes!! 💖", "lior_vibe_feeler_art": "💖💖💖💖💖💖💖", "allbodieshealth\nVerified": "Verified", "zohameanslight": "🙏🏿🙏🏿🙏🏿", "beforeandagain_": "Sending all love 💖", "chocolateenoir": "Amen!!!!", "lhammond828": "🖤💜🖤💜🖤", "fons1107": "💜💜💜", "tangtues": "Juju ✨ Prayers 🙏 Love 💛 It’s just information and it’s better to know what’s what than stay in the dark. You are strong and beautiful 💪🙌", "m.trouvaille": "Praying your scan shows NO CANCER!", "jthor48": "Sending magics🖤🖤🖤🖤🖤🖤", "badeoye": "💖💖💖", "thechocolatesensation": "❤️💪🏿❤️", "jerk_nugget": "🌈🌈🌈🌈💕💕✨✨✨", "balaenarosea": "❤️❤️❤️", "oilsandfurlady": "Sending lots of prayers your way 🌈", "anjaliethescrivener": "what your account means to me is more than i can say with words, sending all my love and prayers for your health ❤️", "luluchavet": "💗💗💗💗", "wanderinginmagic": "So much love 💜💜💜", "abovebelowjewelry": "💓", "lobarry": "🧡🧡🧡🧡🧡🧡", "downthesamehill": "❤🧡💛💚💙💜🖤", "fmathie": "So much love your way!!!", "queerandmarried": "🖤💜💚", "my_hipster_sister": "❤️❤️❤️❤️❤️❤️", "mpcs_": "✨💖", "danascruggs": "❤❤❤", "cestlag": "💖💖💖", "arutht": "I'll be thinking about you today!! 💓", "shylamoma": "🙌🏾🙌🏾🙌🏾", "bootasha": "💖💗💖💗💖💗💖💗💖", "anarchycomingsoon": "Daang those air force 1s 🔥🔥🔥", "alex.haller": "Sending alllll the good vibes. Manifesting some good results for you! ✨", "mstiffanyrueshaun": "❤️❤️❤️❤️❤️❤️❤️❤️", "withalldeliberatespeed": "❤️❤️❤️ you got this! My momma had her follow up last week and she says the same thing. 😘😘😘", "raaaaaachael.k": "Good energy and love on its way to you 💖", "mama_yb": "❤️", "muddyfingers3": "Juju, prayers, love and vibes sent!", "beatrizzz_trejo": "Just had my scan a week ago, scanxiety is real. Positive vibes your way! ❤️", "viitis13": "✨💜✨💜✨", "verovivaldi9": "All the good things ❤️❤️❤️", "loveiswiseillu": "🙏🏾💜🙏🏾", "taraviolet": "Sending you good vibes ✨✨", "michellealyssadelgado": "❤️❤️", "ysee___": "Lmfaoo 🤣🤣🙏🏾", "jpapanyc": "Sending love Ericka! 💖", "the_lydster": "♥️", "nickdariushtaubes": "❤️", "mizzlg": "Sending all the Juju, prayer, love and black girl magic over to you💖💖💖", "yanece": "Sending love and support your way!❤️🙌🏽✨", "cochinaaa": "Say it with me, “I am healthy and the tests will reflect that”. I do this while I wait for my results too. Prayers queen ✨", "druscilla_foxglove": "Loving the matching hair, shoes, and panties! Be safe, hope everything is clear.", "sheflourished_": "🙏🏽 ♥️", "jduhloyz": "Saying a prayer for you ❤️", "gilleonsmith": "🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾🙏🏾", "melissafac3": "❤️❤️❤️❤️", "nicoler30": "❤️❤️❤️", "nina_tame": "Sending you loads of love 🖤 Also your trainers are 😍 and you look powerful as fuck!", "chromat\nVerified": "Verified", "swashbucklingfatqueer": "Big facts! # 4yearscancerfree right here!", "yourstacey": "🌹🌹🌹🌹🌹", "seemesafeffsfund": "Sending❣️🕊❣️🕊❣️🕊❣️🕊❣️", "samanthastroh": "Sending you all my ❤️ today!", "m_a_mcdonald": "All the love💚💚💚💚", "mekdibaby": "Love and prayer for you 💕", "mojodisco": "Kiiiiii 😂", "urbanbuppie": "I totally understand that feeling. Prayers up 🙏🏽🙏🏽", "sassyblackcat": "Sending you love!!!", "anniesoberinsandiego": "You got this, we got you.", "tam.kino": "❤️❤️❤️", "eva.taylor": "💕💕", "shaychaloupek": "Praying now!", "sarahaile": "❤️❤️❤️", "carlybullough": "❤️❤️❤️", "kathleencollins": "You got this! Sending good follow up vibes💕💕💕", "doctor_midwife": "At least your draws are cooperating. Comfortable cotton draws are the shit.", "ms.sativafieldz": "Sending love boo I can’t wait for that feeling of knowing it’s over❤️", "issablacksuperhero": "Sending love and light sis ♥️♥️♥️♥️", "adashofdolly": "❤️❤️🙏🙏", "w.windstar": "godspeed", "myfitchbad": "💗💗💗💗💗💗💗", "bobbi5e_": "💛💛sending you all my love y un fuerte abrazo💛💛", "themelissadenizard": "💛💛💛", "livelovemusicnavy": "❤️❤️❤️🤞🏻🤞🏻🤞🏻", "l_zawacki_m": "♥️♥️♥️♥️", "discipline.ctrl": "💕🧿🙏🏾", "samanthahorn": "❤️❤️❤️", "earthtone27": "💚💚💚💚💚", "emilyshultz05": "❤️❤️❤️", "alessandravoice": "Prayers and love 💓💓💓", "olivexoike": "You are covered ♥️", "livshaa": "Sending you good news, love and support 🖤", "kiraselinalevy": "Sending ❤️❤️", "roze_royze": "Sending you lots of love and hugs my friend", "itsmekellieb\nVerified": "Verified", "granola78": "Sending you all my positive energy this morning!!! And lots of love too. ❤❤", "kennedy_tribe": "💓💓💓💓💓💓", "seafalcone": "Kanye could NEVER sending healing vibrations to uuuu", "discoveringcasey": "You are in my thoughts beautiful 🙏🏼", "msdsantos6": "Sending ❤❤🙏🏾😘", "figbotanicals": "🙏🏼🙏🏼", "myrandomcat": "Big hugs", "vanessa_e": "❤️❤️❤️❤️✨✨", "lisahawks": "Loving you from Baltimore dear one", "un_becomingme": "❤️❤️❤️❤️❤️❤️", "alexandra.g.11": "That was really funny, blessings", "pghkayla": "🙏🏽🙏🏽🙏🏽🙏🏽", "sexi.couture": "positive vibes mama!", "hansonareback": "💛💫💛💫💛", "luluwolf": "❤️❤️✨💕💞", "arti.speaks": "You look amazing. You are powerful. You are so so capable and you can handle any shit that life throws at you. You got this!", "broguinhodos2": "Boa sorte. Tudo de bom ❤️😘💝", "assatataughtme47": "Sending you ALL the love and healing!!!!", "katdepas": "💗", "monimimimomo": "Love you baby, prayers for good results, good vibes, and days all around❤️", "najlabarance": "❤️❤️❤️", "auxsombresheros": "💓💓💓", "madbrew\nVerified": "Verified", "keyairakelly": "I so love these undies. Sending light and prayers your way.", "tieboyer": "Sending so much love your way!", "iamsophie_marie": "Sending you all the good vibes today! ❤️", "misss__farah": "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "envick": "💕💕💕", "drina_f": "❤️❤️❤️", "jamie.weiss.71": "❤️❤️❤️", "colesanatomy": "sending all the good vibes n love your way 💕💖", "dangerouslyinchub": "💖💕💖💞💖💗💓💖", "heatherrohnert": "💕", "physicsandcoffee": "Sent.", "loveaprilkae": "Kanye wishes!!", "farrahevita": "Sending love ✨", "miamia": "❤️ Strong", "samiyashakir": "More power and positivity to you! 😍 You are my inspiration ♥️", "thetiffanyhan": "💕💕💕", "mirz112": "💗💗💗💗💗", "junebug_vs_hurricane": "✨✨✨💛💛💛💕💕💕✨✨✨", "nuggetsgurl3": "❤️❤️❤️😘😘😘😘💕💕", "shanshantel07": "🙏❤", "sierrawgarcia": "We love you! Sending you all the goodness. ✨❤️", "ca.rolannie": "Praying ❤", "killahkof": "So sexy don’t mention Kanye’s name", "saturndayze": "Sending forth allllll the love n light n good vibes ❤️❤️❤️❤️✨✨✨", "noraooooooo": "💗💗💗", "moiranmaloney": "❤️💓❤️💓❤️💓❤️💓❤️💓", "mrempoo": "💕💕", "aleeeeeeuh": "i’m sending my love and prayers to u ericka!! hope all goes well xxx", "the_lez_bear": "I’ll be thinking of you Ericka ❤️🙏🏾", "koyukipanda": "YOU LOOK GREAT! You got this homie ❤️❤️❤️🙌🏾", "polysaturatedfat": "sending you nice thoughts and love!", "daria_ann_poet": "❤️", "riyokota_": "From Russia with love 💕 💧"}