{"rebecca.theartist": "I miss you", "mindsmine3": "Proud of u❤️🖤💚🔥🔥say it out loud", "gracecath": "We havent been seeing your posts and storiea and we miss you 💜 with luv from me and @meow_miiix 💋💘", "hallowed_fate": "People will always try and shove you into their box in order to accomplish their own agenda. You’re amazing for staying resilient.", "rachellowden.png": "Haven’t seen you on Instagram in a little while, I hope you’re well. ❤️", "jena.renee.domicile": "Where'd Ericka go????", "p.bella.k": "We all miss you and Ebony. Hope you’re both ok. If you’re taking a social media break I hope you guys are enjoying your time away and getting some much needed rest and relaxation ❤️", "jadetsng": "Ugh sounds like such a disheartening experience to have all your work misrepresented and undervalued like that. Glad you could articulate it so Well and share though. And you look great.", "woretour": "What you said was so profound. I am not familiar with you or your work, but this post alone has me interested in learning more about you and what you are teaching to others.", "christinamstuart": "I’m so happy to see there’s a publication out there like this! Congrats on the cover!!! You look fabulous on it!!! We definitely need to talk more openly about sex, expectations, our bodies. So much can be gained from talking about it! Thank you for all you do!!", "anaonointimates": "Wowwwww", "d1fg": "They are trash for that", "detailedjourneys": "For future pieces, is there any way to require they sign a short contract that states you absolutely get to view the draft before it goes to print? I'm not sure if it would help at all, and really shouldn't be needed - this is unacceptable of the publication.", "simon_ten_haken": "⁷", "wearethensfw": "So amazing!!", "woundedhealeryoga": "@rattyg1996", "kubikrubik_24_7": "You are fucking awesome!!!😍😍😍", "susanayuan": "Just wrote to you a bunch of messages hoping at least one of them reach you. Also, details given on a PM here, in IG. Thank you. Hope these all does not creep you out. Not my intention at all. Again, thank you so much.", "doulaalexisyogimama": "Just seeing this post. I’m sorry Ericka-that must feel extremely frustrating and disappointing. I could tell how excited you were for this cover in the stories you posted leading into your photo shoot. But thank you for continuing to call people out on their bullshit. 💗", "amyscurren": "Hope you are doing well ❤️", "carrieshuffles": "How hard would it have been for anyone at that publication to do a simple check and ensure they use the correct terms for you? Not very hard at all. How few people are willing to do the work but want all the glory. It’s a shame. HOWEVER it won’t stop you and you are fucking PHENOMENAL and I applaud you for being transparent and not afraid to call folks out when they need to learn a lesson. 🔥🔥🔥", "sweetp0tat0thighs": "Can u sue for defamation of character? 👀 Is that a thing?", "lilericakane": "You and I have the same first and last now😍", "smokinluzarte": "You are legit. That's all that matters. Keep helping others, they will care", "bluth_ish": "Just popping by to say hi! Miss y’all! Hope y’all r staying hydrated!! ❤️️🧡💛💚💙💜💖", "yinyang_kids": "Very good photo because of the composition. I think just need some lighting in this photo then great! 😉", "ascensiongoddess_": "Hi Ericka, I miss seeing your beautiful spirit on my IG stories. I hope you are resting well & will return refreshed, rejuvenated, and ready to serve the children w/ your radical fierceness 🔥. COME BACK * in my Rose from the Titanic voice after she let Jack hand go cuz she got tired of holding that bih*", "ayo_vet": "❣️", "loveaprilkae": "❤️", "viva.la.erin": "are Ericka and Ebony okay and safe they’ve been offline for awhile they’re usually vvv active", "henrygoatbag": "Fack!!! Ggggh.", "ladybacktoblack": "🤦🏾‍♀️ They tried it", "playwelltogether": "love", "briannass_closetttt": "Congratulations beautiful 💕", "sorry.not.heather": "what a wasted opportunity for this publication and their readers to grow and (un)learn 💔 shame on them, honestly. thank you for speaking up about this", "justtish_": "Absolutely beautiful 🖤", "alexmvpes": "🤡", "the_yvesdropper\nVerified": "Verified", "waladshami": "SO PROUD OF YOU! Manifest success!!! 😍💕💕💕", "lolafaleye1153": "I appreciate you sis. I want to know if you did breast reconstruction after mastectomy!", "yfw.ireland": "Excuse me if I sound ignorant but what are ericka's pronouns??", "je_ne_sais_kat": "DISAPPOINTED BUT NOT SURPRISED", "helterskelton89": "Not to put words in your mouth, but this conjures thoughts of The Rock. Publisher: \"I think you're a woman and influen...\" Ericka: \"IT DOESN'T MATTER WHAT YOU THINK!\" Bump these people who think they can define Ericka Hart, Ericka is precisely the mystical person that they intend to be!", "maxineheron": "Why are these publications so fucking tonedeaf? How did they manage to get it SO wrong?", "indigenouswomenhike": "I’ve been through something similar and it becomes harder and harder to do any kind of interview. The journalist is almost always a white woman. I’m sorry this happened to you and that this person shaped your identity in a way that does not honor you and the incredible and valuable work that you do.", "glorels": "How you gonna fucking misgender the person you're interviewing and putting on the cover and also get their line of work wrong?? Like you're fire immediately what??", "chellec1969": "That moment they think they know you better than you know yourself. Please exit left. You’re radiant & powerful. Always!", "listenmovement": "🔥🔥🔥❤️❤️❤️❤️❤️❤️", "tessholliday\nVerified": "Verified", "marion__amanda": "This is horrible. I think \"healing professions\" are some of the most steeped in white supremacy, especially when it comes to the treatment of black and indegenous folks. As a white person currently training to be a therapist, I will do my best to call this out when I see it, and pass the mic to my colleagues of colour. Thank you for sharing.", "fluffyskittles": "I was super excited to see you on the cover annnnnd then I read that bottom line \"her crusade for equality\" & GODDAMMIT good feeling gone. I'm sad this is a common occurrence for you, but not surprised when I stop to think. sigh.", "dawnalg1": "@lynseybrown88", "nicolettemason\nVerified": "Verified", "saucyewest": "You are breathtaking. I’m sorry this happened to you. Shit is foul", "ellen.pim": "Damn. I’m sorry.", "classyallthewayjes": "❤️❤️🔥", "mraybaybay": "\"Crusade for equality\" tastes bad... Didn't like that before I read the caption. I'm sorry this happened. 😞", "slynbutter": "Yikes.... Bitter Sweet in ways. Yet so seemingly perfect.", "lifeistechnicolor": "Congrats on your cover, and I’m SO SORRY to keep hearing stories like this. A constant reminder to LISTEN to people and respect their self descriptions and their work. 😵😵😵", "hillycooke": "How incredibly disrespectful.", "millyblue": "Yes, I read that and was like ‘?!’ *sighs* White people have a long way to go. I’ve never been in a classroom with you but you have educated in many ways. And I’m so grateful for that. Thank you. 🙇🏼‍♀️🙇🏼‍♀️🙇🏼‍♀️", "foolishg.irl": "The fact that they literally FUCKED UP every part of your description is ridiculous. Making money and getting attention off of you and not giving you a shred of respect. 🖕🏾 @ sexual health magazine. This is also so dangerous for a platform that’s supposed to educate and open people to be giving advice, stories if it’s not even going to be correct or truthful", "other_surrealities": "This makes me so mad. You deserve so much better than this. Is there anything you can do legally? They used you and then printed false information about you.", "emilyburrito": "This is beautiful! Must subscribe!", "refashionedgarbage": "Thanks for sharing your experience. It’s important to know about how magazines fail to adjust and listen to the people that they showcase. Sorry that you were not heard", "melonskies": "Wow!! 😍😍😍", "melissau\nVerified": "Verified", "weezle_t": "The idea that a sexual health magazine wouldn't consider confirming your pronouns and terms, thus entirely negating your hard won existence, is embarrassing. That should have been their #1 priority, it is inaccurate and the editor needs a frickin' head shake on that call. In a field which should be vigorously championing consent; to dismiss your lack of consent regarding their decision to reposition your gender and career identity, atrocious.", "willowdaliance": "oh no- sorry this shit goes on! WTF is soc med influencer really but a pop contest ,Crazy click bait bs! You’re authenticity is deep! I thank GOd/dess for you!", "reneemagnusson": "I hope you get an apology and they change it. ❤️", "freeblackgirl": "Ugh. I am so sorry this happened, Ericka. You deserved better than to be disrespected in that way.", "stevensanazco": "The disrespect. Standing with you and we see you. 💙", "roman.makhmutov": "Hey looks great! Congrats!", "danascruggs": "Disgusted. It feels like they never gon learn. Or care. Or care to learn.", "ddlovewrites": "I am so sorry they disrespected you. This is such a shame", "blerdgirlchronicles": "I'm so sorry that they disrespected you like that, but thank you for calling their asses out. Also, you look amazing (you always do, LBR), so I hope that you at least felt good/happy the day you had your photoshoot.", "barbie.rns.everything": "So they did the opposite of promoting/protecting sexual health by actively misgendering and misrepresenting an expert in exactly that form of oppression ☝🏼🤦🏼‍♀️ Anyone feel like sharing their thoughts with the magazine can here  https://sexualhealthmagazine.wordpress.com/contact/", "libbypaigediamond": "Thank you so much for sharing this experience. Seeing the picture by itself with you looking as amazing as always made me consider subscribing to it, but what absolute shit!!! You have the most amazing energy and intellect of anyone I have ever taken class with.. teaching while technically a student.. fuck that influencer title and that magazine!", "traceyfromkc": "Wow. And damn. I had never heard of this magazine before, and would have been interested in checking it out...but not if they’re gonna be dismissive. How totally disrespectful! I’m sorry that you had to endure this.", "jeniaron": "You are magical and amazing. Thank you for all that you do. I’m sorry there’s always an edit on your life from outside forces (whiteys). Love you and appreciate you. 💛", "miss_minty_fresh": "🤦🏼‍♀️🤦🏼‍♀️🤦🏼‍♀️", "booraw": "But hello, influencers are THE MOST IMPORTANT...😑😑😑 fucking mess. You are an educator!!! Thank you for all you do. 💕", "natalieebigscott": "That’s so disappointing. The photo is absolutely striking.", "cancer_dr": "Read my story @ihartericka read what white doctors Prof Richard Hift and Prof Jordan did to me....I should be a Professors in Radiation Oncology by now but what a black women has done is always ignored mimnimised. @sephora34th street did the similar thing i planned hosted and organise the October event they came the next morning ranking me por speaking at their event...lol they are just rediculous to think we are that stupid... We are kind passionate bit not stupid", "wrekd_lucy": "💜💜💜😍😍😍💜💜💜", "nehemiesb": "Unbelievable, yet not shocking😫🥴. We see you and we are with you. BTW, you look incredible!!💜💜", "rebecca_carragher": "This is disgusting. What they did is disgusting", "napalilli": "I hadn't read your caption yet, I was focusing on the image then I saw their descriptor of you and was like uh oh let me check out this caption real quick cause I know this ain't right 🤔😡", "devamahal\nVerified": "Verified", "blackgirlfromnebraska": "It’s sad that I’m not surprised. Why can’t you be accepted as the non-binary femme sex educator you are? I appreciate you for exactly who you are! Thank you.", "pppshhhthisisalibrary": "So I guess we're just going to play like sex educator, sex positive influencer, and sexpert are all the same. Just like a nonbinary femme is always a woman. Without sarcasm though seeing the white washing over your work is horrid, and shows how a desire to share actual education dosent look the same as performative action.", "theblackplanter": "I was scrolling and so happy to see you on another cover. Now I'm flabbergasted and yet not surprised. Completely disregarded and dismissed what you represent. To be misgendered by a sexual health magazine thoroughly baffles my mind. You are appreciated. We see you. And you look stunning as always. Shoutout to your team.", "syrachaaa": "Tbh these are such basic ways in which you define yourself. That publication did not do the journalistic work you or the world deserved. That said you are a VISION!", "beth_rinko": "So shitty of the magazine! Why bother interviewing you if they don't actually care what you have to say about yourself?!? I'm also super salty about this because I'm tired of the whole \"influencer\" label and the culture around it. I'm sorry they misrepresented you in multiple ways.", "poppyminds": "You deserve to have all aspects of yourself respected and represented accordingly!", "rachmale13": "😍😍😍😍 congratulations!!! Beautiful and strong cover 💪🗣", "frasstronaut": "I'm so sorry that this happened. I have contacted the publication and let them know how fundamental and inexcusable I think these errors are. No exaggeration, a grade two student would have described you more accurately.", "sunny_sonja": "👑👑", "alongstory_short": "What do they have to say for themselves? More lies?", "madame_masochist": "You are inspiring ❤️#womanempowerment", "artsortment": "This is so disrespectful and unprofessional. But that cover image of you is 🔥🔥🔥. I’m sorry that what should be a moment of celebration is tarnished by this bull shit.", "realmikkipedia": "Fuck I meant to follow up to my own comment which was just incoherent ❗️❗️❗️ But there are too many messages of love and informed support in here to find it, which is a good thing.  Sobfucked that you bring your A game to every interaction, and it includes knowledge, intention, kindness, and rigor—and you got none of that in return in this situation. I’m so sorry ❤️💓", "lashawnthompsonbeauty": "This is ridiculous!!! We want to focus on you as an influencer? Are they fucking kidding me! These publications have got to do better! Next time they have to sign contracts stating that they will represent you for who you truly are in the world. They pulled the okey doke so they could so what they wanted. 👎🏾", "moeimaornah": "BELLA", "pretty_berie": "Hello good people, please i need help I am an orphan I and my younger sister have been struggling to survive no job and life has been extremely difficult for us but I trust God as i put my own efforts to get something doing please assist me with what God lays in your heart to help. i want to be making snacks and selling me and my sister. God bless you as you help us amen", "the_life_and_art_of_jlp": "That’s terrible! I’m so sorry they didn’t respect you or treat you professionally :(", "sanyuestelle": "When people don't care to actually understand your stances or your appeal. Boooo to WS trying to disrespect you 💥", "active_lizstening": "That's messed up! So sorry they misrepresented and misgendered you ew 😾 Thank you for your work and for sharing your truth!! Also you look amazing 🔥💖", "_whoisjaz_": "Yessssss👏🏾👏🏾👏🏾👏🏾👏🏾 congrats", "ophelia_obscura_obtuse_xqzmi": "💚💚💚💚💚", "michelledaylene": "Wow, call it. This magazine gives you a cover and you still call them on their \"mistakes\". That's incredibly powerful and inspirational.. I hear u loud and clear", "joanacaona": "Such a strikingly beautiful portrait", "kimberericaj": "Well that’s completely shit.", "msdsantos6": "Yasssss 🤗🙌🏾👏🏾👏🏾✊🏾✊🏾", "luv_like_thiss": "👑👑👑👑👑", "jexblackmore": "🙌", "justinhachlaf": "Brutal. I’m sorry, they should do what’s right. If they don’t know they better ask somebody. On the strength, you look amazing!", "new.account.who.r.u": "“Crusade for equality” 💕💕😍", "sierrawgarcia": "Get that cover!!🔥🔥🔥🔥✨✨✨ Does anyone know the handle for this mags insta?", "discoveringcasey": "Even when you call them out they don’t listen. They don’t see YOU, but just another bottom line. You deserve so much better. You look phenomenal though 🙏🏼🙌🏼", "shawwnuh": "FUCK EM. You are still shining bright 🌟", "anettieh": "Raging.", "goodegawd": "Wtf! I'm so sorry you had to be erased in all the work you do and as who you are.. thank you so much for being transparent and open.. most of the time people are made to feel like they are supposed to be erased!", "d_ellyse": "I’m sorry they didn’t give you the respect you deserve!", "mghsmith": "Wow. Congrats!!!! 🙌🏻🙌🏻🙌🏻🙌🏻", "cee_gbolt3172": "This is awesome! Congrats to you 👏🏾👏🏾👏🏾❤️", "skintonic.studio": "“White people will always find a way to assert that you are something other Than who you have asserted yourself to be” — Ericka 🖤 a whole word", "akaelguido": "Ugh, this picture is great and these institutions always are so condescending. You'd think they of all publications would understand pronouns and genders.", "mekdibaby": "YAS BEAT AND HAIR. Although its really irresponsible they misgendered and misrepresented you like that", "jmofeminist": "I’m so sorry this happened", "venusx\nVerified": "Verified", "eye.charlie3": "Congrats! ❤️❤️❤️ wow! Well deserved +many more cover pgs", "hubcap_molly": "That’s some bullshit. I’m sorry they didn’t follow up with you for approval.", "sendinglavenders": "Seriously??? Its one thing to not fact check but they didn't even change it? Ur the cover! Shouldn't you be allowed to dictate your own gender as their cover story? What the fuck man", "runtimecomplexity": "You look amazing on the cover and they fucked up. Your followers see you, your gender, your expertise, and we learn from you every day. Rock on and thank you for pushing. 💪🤘", "rieleo": "It’s a beautiful cover, but I am upset for you that they did not discuss what they wanted to focus on for the article so they could get your preferences and hear what you thought about their focus. It feels like a violation to me. 😔", "onomesmom": "This is beautiful ugh 🤗", "susanisrad": "those aren’t preferential phrases that you’re asking for, you’re asking them to correct errors and oversights. what kind of author or publication is ok with disseminating inaccuracies???!!!", "savannah.smackdown": "🤬 they are garbage journalists!!!", "withalldeliberatespeed": "I just emailed them with a complaint. It's wrong and they should be ashamed.", "chloemac86": "How is it professional of them to pring something without factchecking and making sure the person that is the subject is happy?? 😡😡", "jeanpaulpaula": "💖💖💖", "archetypographia": "Ironically they seem ignorant to the fact that you will share this info with the folks they were so desperate to “influence” on your feed who will never even look their way again.", "itsveronicaelizabeth": "🧡🧡🧡", "beyhivemember": "Congrats👏🏾👏🏾👏🏾👏🏾 well deserved❤️", "garbage\nVerified": "Verified", "days_of_dean": "They should have called YOU to fact check; anything less is sloppy at best, unethical at worst.", "katykabloom": "♥️♥️♥️♥️", "diane_twitchell": "Damn I liked the pic without reading the caption first. Gonna write to the editors about this. You look 🔥 tho", "joshuaobawole": "Absolutely to everything you just said! I am sorry it has to be so disappointing and frustrating. Especially bc of all of the work you’ve put in + literal educational/professional qualifications like wtf lol white ppl are really trifling 😤🤣 congrats to you either fucking way bc like you said the validation is already baked into the beat 👏🏿👏🏿👏🏿👏🏿 ✅", "aarinsanity": "🔥🔥🔥", "behindthescars_": "And that's incredibly frustrating - regarding the interview/ content - especially when it's in your field!", "fake_meat": "What the hell, this is so disrespectful to you! If it’s any small consolation tho, your work speaks for itself and you look amazing ❤️", "nadya426": "🤬🤬 big MF fail Sexual Health Magazine.", "chantellekohn7": "How infuriating and disrespectful to you and your work! What even is a 'sex positive influencer'?? You're a sex educator and an incredible one at that.", "pualanastyle": "💯💯💯💯💯", "bet_si": "@ihartericka", "remixyourstyle": "Wow. The image is stunning. But the recap of your experience is outraging. Thank you for continuing to show up anyway. Your truth is YOUR TRUTH. ✊🏾🖤", "theafrodisiak": "thats so gross. but you are great and we see you, non-binary femme sex educator and (if you dont mind me saying) extraordinaire. thank you. 💜", "thewaythru": "You look dope and you are. And also, that’s trash. They never want all of us, just the part they made up about us.", "lotuslly": "I’m so sorry they turned what should have been a positive experience into something negative. Sending you love. 💕", "gabsriellle": "Ahhhh fuck that!!!! A swing and a mfing miss", "the_vibrant_hak": "so glad you shared your side of what should be a success story 🤦🏻‍♀️😤💜", "gallivantingchrissy": "Trash. I’m so sorry this continues to happen to you. But this glam tho? Whew. Slight* silver lining. You look gorgeous!", "its_natashac": "So disrespectful that they misgendered you, and so unprofessional not to fact check. I’m sorry this happened and I hope you receive a genuine apology❤️❤️", "cindyleealves": "🚮🚮🚮🚮🚮 You look like everything and they’re trash for tarnishing this moment for you! #moreofthesamenonsense", "glitterguide\nVerified": "Verified", "fracus": "Disappointing but a great photo . Not enough i know .", "naushonyoga": "Fucked up, gross, and beyond unprofessional, I’m so sorry this happened. They should issue you a public apology. You look gorgeous (as always) though.", "zuzu.valla": "👏🏻👏🏻👏🏻", "iischristy": "You want me to fight? Why they gotta ruin shit? Besides all of that You do look beautiful as always my friend. Proud of you ✨💓", "m.trouvaille": "How insulting to not do the most BASIC courtesy of using your correct pronouns and giving you the final say over your own interview. Has the magazine responded to this yet post publication? Congratulations on the cover though! I hope you are given more spaces and publicity to share your important work as a sex educator, with respect of course!", "mochalola": "We see you Ericka 🤗. Thank you👏🏽", "meghantalks": "Fuck. This sucks. I’m writing the editor. I hope their next issue is dedicated to the importance of consent and using proper pronouns. You’d think of all magazines, one that focuses on sex would be extra mindful to treat people with permissiveness and respect.", "azurelaine": "Shit. They even listed that false and misleading info on the COVER.", "josierosarionyc": "Congrats Ericka! ❤️", "wonderfullyartistic": "Hi 💕 What is the difference between a non binary femme and a woman? (Please don’t attack me guys-I want to be educated) thanks✨", "hair_by_gina": "😍🔥😍🔥😍", "balletmeli": "Sorry you went through that. 👀 Fabulous. ❤️❤️", "jo_is_glen_coco": "First time commenter as this is a place of unlearning for me. I’ve been following you for a while and I was really confused that you were called “she” and had the wrong job title. I’m really disappointed for you. I have a degree in PR/Communications and this is sloppy work by the magazine who could not do a basic fact check. Misrepresenting marginalised people does not help anyone to “raise awareness” and will add to the misinformation about the very things you are trying to teach 🤬. I hope anyone reading the magazine will be tempted to follow you here directly to avoid further distortion.  Finally, you look stunning and perfect!", "jsblzr": "Fucking ridiculous and shameful! Ugh! 🙄 You’re fine as hell tho! But wtf?!", "lizard_found_joy": "Yikes that is terrible. Sorry this happened to you and that you were midgenderer/mischaracterized.", "oilsandfurlady": "Ugh 😑", "like.i.came.by": "So sorry to hear they’ve disregarded you, I hope you’d feel better knowing this - I follow you for you. I follow you to learn you and your peoples’ truth. Your words matter more than those platforms’ words. Just keep going and I’ll keep reading. Sending you love, congratulations anyway because you look beautiful here.", "sex.iwishyouknew": "So fucked up, but sadly not surprising, that they are lionizing you on their cover but don’t use an informed consent process for publishing or allow you to self-identify. I’m impressed you still know your value despite the bullshit, and are using your audience to counteract the structural discrimination you encountered. You look amazing, you are amazing. 💛💛💛", "kazejewelz": "It was so lovely meeting you and Eb the other day at the stoop sale! As frustrating and exciting this is and was, know that there are a plethora of platforms that will represent you exactly how you say you are, without diverging the narrative. Maybe a “fubu” magazine?? However with the awareness you just shedded trust and believe apologies will be swarming. You’ll receive the genuine, uncontrolled platform where you’ll be celebrated and represented at the minimum for what you directly stand for. 👏🏾", "downntempo": "your hair rn 🙏🏽", "1120_nuday": "😍😍😍😍", "annemarieandchupa": "Fucckkkkkk thattttttt", "chanellemidwest": "Wooww disappointment 😩", "healwithbroocke": "HOLY SHIT 🔥🔥", "posefx.tea": "Loveeee!❤️", "thepagesintheword": "They did you wrong, I’m really sorry you were tokenised and redefined in this way. Writing to the editor.", "themelissadenizard": "I’m so sorry, Ericka.", "itsbforbristole": "So hurtful that they are not only misgendering and misrepresenting you and your work, but also to not include you in the process for fact checking before publication. Shame on them and others that do this. When will these magazines, newspapers, ects ever going to stop using educators as a social media boost rather that focusing on the knowledge and education from the educators to spread to the publication's readers to educate others on important subject matter that can be life changing for some, eye opening for others if that is what their publications \"stand for\". Rather than \"oh, this being is popular! let's ask if they can do an interview but really we just want attention that we are doing good when really we are just as exclusive as any other nonallying publication and misusing the trust and focus of inclusiveness that people are fighting for and are misrepresented all the time and not focusing on the change and education of this being's worth to give a voice to others\". I am sorry they did this to you and I am sorry if I speaking out of line but this makes me so frustrated, sad and angry for you and how they have treated you. It is not a surprise they did this, which is another sad part, as was excited about you being on the cover, as you look amazing because you are inside and out, but reading what they did to you is not right nor ever will be, and I hope those of us writing to them gets their attention of their misuse of you as an individual, educator and what you bring to the world.", "undocuqueer": "Sorry these ppl can’t do journalism right 😪😪 but aaayyy cover girl happy for you 🎉💘", "_geralartist_": "Time to develop a contract for these magazines and publications to sign before you agree to work with them. Making it as specific as possible will help with these issues. Maybe not stop them completely but I love a paper trail. ♥️", "cryingbull": "I’m about to cry 😭 💕💕💕💕💕💕💕💕", "georgina.megan": "this makes me so mad! so unprofessional and you would hope a sexual health magazine would know better and properly listen to you with regards to your gender identity. I hope they apologise and correct this!", "venusinariesrose": "Wow. They could have mentioned your social media following in the article and still have presented you the way you wanted to be. So unprofessional and rude on top of everything else.", "aacapinurass": "Damn Ericka... THEY REALLY DID THAT", "justsheherhers": "Le sigh. I was so stoked about the cover I failed to realize they misgendered you. I have no words.", "mynameisjessamyn\nVerified": "Verified", "ahntologies": "Absolute radiance as always. You are the sun, Ericka 🌻☀️💛", "melaniezoeyishere": "I’m so sorry. It sucks to not be represented as you would like to be. My experience with media is they always use your material for their own angle. My pole dance film for sexual empowerment had articles about it in Shape magazine about fitness & working out. It’s all about their click bait and agenda. Your light shines through in all you do. Hopefully this piece will bring people to you on social media, where you have the power to assert the identity of who you are. You’re a blessing to us all.", "ggbostini": "Thank you for your leadership, transparency & for advocating for yourself and your identity. This will absolutely empower other people. You have turned lemons into lemonade. 💕", "scruffitre": "❤️❤️❤️", "domina_franco": "Ugh. Fuck. I was so excited to see you on the cover and so hoping it would be an article aligned with who you are. That is shitty they misrepresented and misgendered you. I know you’re likely not surprised at all and neither am I but I’m angry for you. Im going to write the editor", "ariesvenus13": "Where are their headquarters I feel like taking a shit on their couch", "slutofthemonth": "First of all, YOU LOOK THE FUCK GOODT! Secondly, keep shining!", "_itsellyyyyyyy_": "So they can’t even apologize for their bullshit?! Uhg y’all look beautiful and bomb as always BUT the mag needs to do a reissue with published apology. All my love to y’all! 💜🌈🔥🔥", "edwaujonte": "Fuuuuuuuuck. Why can't they just name us as we ask to be named???? It's not that difficult 🤬", "newyorktoycollective": "Gorgeous 💗", "kellylynnkrumdiack": "😥", "kristiniris": "Wow. I’m pissed this happened to you. The blatant white supremacist disregard is maddening. Aside from that I’m so over the fucking word “influencer”. That word means literally nothing in general and especially in the grand scheme of the work you do. This was a massive disservice.", "mad.madam.mermaid": "I’m sorry. That fucking sucks. Whoever interviewed you and wrote the article had a responsibility to get the basic facts right! And then to not build in sufficient time for corrections? It’s very sloppy, and in this case, invalidating and hurtful.", "firstnamemcnally": "You look spectacular! Very disappointed they didn’t honor your wishes about how you were presented but you are right, we gotta stop expecting them not to fuck up.", "bhawksnipes": "Love you & thank you for constantly living in your truth even if certain publications try to ignore it. ❤️🙄", "megakeen": "So frustrating 🤬", "blk_magik_woman": "Soo they just used you? Is that what I am getting here? For your social media following... so in their mind it’s “oh she has a following, let’s get her up here to sell some magazines” even though we aren’t really going to listen to her words. Now I see why you are so so thoughtful in your choosings of where to represent.", "mica_hdif": "✊🏾❤👏🏾❤", "lb.mahan": "So gross and disrespectful to push their own narrative rather than give you the credit you deserve for years of investment in your expertise and practice. It’s unethical journalism. And I don’t even know where to start with a sexual health publication failing to correctly gender the person on its cover 😔", "raisaflowers\nVerified": "Verified", "the_melanin_mrs": "😩😩😩🙌🏾🙌🏾🙌🏾🙌🏾😍😍", "youngseedssun": "Trashy! But you look flawless and we see you.", "fogapocalypse": "Caucasity smh I’m sorry you were disrespected like this", "hadialaghsini": "My Hart! 😍", "dianne_young": "Breathtaking!! Also the contrast of green and pink 😍", "josejacobarce": "I’m so sorry this happened. I was so excited to see that your work in being shared in this way until reading your experience. That’s disappointing but not surprising.", "_aliyanda": "this is SO frustrating 🙃 ya look 🔥 tho!!!", "angelamorrismakeup": "I’m sorry. Another example of them wanting to profit off of you but not wanting to respect you in the process", "__sia1_": "✊🏽✊🏽✊🏽✊🏽❤️❤️❤️❤️❤️", "n.yallah": "Heard you. This is trifling, you do you great tho 🖤", "imetgodsheblack": "A hot ass mess. I’m sorry boo! They need to get their together and learn how to respect people and their identities", "geminitheflowergoddess": "🙌🏾✨YAAAAASSSSSS IM ROOTING FOR YOU!!! Bissssssh you made it!!! I’m so proud of you!!!!! ✨🙌🏾", "honeybluclue": "Goodness 💕😻", "k_a_gr8": "That stinks. I hope they make appropriate corrections and apologize.", "el_jay_the_lion": "Damn damn damn. Why do people feel the need to question who we say we are?! I am telling you I am non-binary.... you telling me I’m a Tom-boy. NOPE. I literally just told you. 🙄🙄🙄", "saruh.williams": "so disrespectful and disappointing from a publication that truly should (but apparently doesn’t) know better. I’m so sorry this happened to you.", "nickdariushtaubes": "👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼👏🏼", "lastcutproject": "Honoring you for all you are and all the way YOU identify yourself 🖤", "jemontoast": "What Fucking assholes. Who thinks doing that is okay??????@shaniya_hope", "ifurie": "Damnit!!!! Ugh way to leave such a horrible aftertaste to something that should have been able to feel momentous to you and your work. You look incredible...🔥🔥🔥", "yas.disquiet": "💖💖💖", "alannarenee": "What kind of response is that to someone telling a publication that the feature on them is inaccurate??", "thesensiblesexpert": "I really felt this one", "amandapicotte": "Wow that’s so delegitimizing to prioritize you as an “influencer” rather than professor, teacher, mentor, etc with the credentials to back it up. IMO influencer is a title for people who need followers to seem like a professional, and I’d also hope a sexual health pub would acknowledge being non-binary 😬😬", "blkgirlmanifest": "THIS! 👏🏾 Beyond the work that you do, just existing & surviving in this field as a Black non-binary femme is so vital. So glad you spoke on this & really hope other Black folks in the field hear you that legitimacy and success are ours too ✨", "hillabeans": "Ugh wtf. I am so sorry they did this to you my friend. I hope they will issue a retraction and apologize publicly.", "kaibutterfield": "I’m so sorry you were misgendered, Ericka. Thank you for all that you do to assert yourself. I didn’t have the language to express my gender until I started following you. Your work is truly life-changing 🌻💛", "aarynnlang": ":(", "beyondrosetta": "going to press w/o factchecking with you is so unprofessional!", "zachgrear": "Damn. Blatant disregard for your autonomy in career AND identity.", "wilcope4": "😭😭", "sazzlegazzle": "You are inspirational", "aundreadd": "So they get to be the “essential source for sexual wellness information” but can’t respect and credit you as an educator or even the very basic thing of properly identifying you. They should stick to online listicles like “what your penis shape says about how you like your coffee.”", "mazzy_draws_stuff": "that’s so infuriating", "darlo_darling": "The first thing I thought when I saw the cover was wow - after all the work you have done and they still misgender you on their cover #notlistening", "___cosmic_dancer___": "😡", "samerongen": "😍", "adrimi_luna": "Your honesty in this is everything, Erika! Never stop. They should issue a public apology to you and LEARN.", "her__majestea": "Thank you for calling them out. It’s inspiring 🙌🏾🔥", "lschuster2": "Amazing so powerful 💎", "thenapministry": "Ugh. This obsession with the word influencer. So irking.", "cassidy_maya": "A damn shame, why don't they listen? Thank you for being a sex educator.", "bahbers": "Ugh I’m sorry Ericka. And I’m sure people will come with the “just be grateful you’re even in it” rhetoric but like nah! It’s so simple for y’all to just get it right!! 🙄 you look bomb af tho 💁🏿‍♀️", "qtpocpersonals": "👌🏿👌🏿❤️❤️", "mellysadventures": "Time to start your own magazine babe! Featuring the depth and breadth of gender and sexuality x", "eb.pabino": "🖤💕", "santxpapaya": "SEXY AND BEAUTIFUL!", "carson0414": "😡 @thesexexpo do better", "simonelovesfitness": "That really sucks that they can’t describe you properly. I don’t understand why it seems so difficult. I mean they chose you for who you are, why not abide by it? You look flawless as always!", "obritztattoos": "Misgendered on the actual cover 😤", "hantisedeloubli": "they just wanted to use you for their own narrative, regardless of the work you do. they saw a queer, black body \"available\" for consumption", "mwrcollection": "DATS MY SISCUSSSSS!!!😍😍😍", "issatrae": "Easy Breezy muhfucking advocating crusader ass black as fuck Cover Girl 😭😭👏🏾👏🏾", "sydnoelle.mvmt": "👏🏾😍", "leeanndunton": "That’s a bummer. :/", "delysialachatte": "🔥🔥🔥", "americahatesus": "*Insert all the fire emojis here*", "koolasjas": "Yassssssssss ❤️❤️❤️", "mizzmock": "FUCKING YT FOLKS WILL NOT STOP. I’M TIRED AND genuinely so sorry this happened. Ya’ll are amazing 🖤", "itskeilavon": "Wow I only liked it in agreeableness and affirmation of your caption. You’re a beautiful soul.", "assatataughtme47": "YASSS PROFESSOR!!! UGH I swear it's such bullshit that they consistently misgender you and other folks, like these binaries need to fucking go!!!!", "lagrossetoile": "Also that they don't give you the chance to proofread before they publish, which happens so much even when it's a condition of doing the interview and is just insulting. On the upside, you look lush."}