{"gtacat": "I totally see what you're saying and I'm thankful to be in a community of authentic queer ppl but I always gotta laugh when \"clout\" is used because that's actually my last name so I like to use that and say \"I was born with Clout so I don't have to prove anything to anyone, I just gotta be me about Everything\" which is a total aqueerieass 😂", "angryzine": "A valid & important question to ask 🙌🏼 Really resonated with me after a month of rainbow capitalism too... I used to be in a bad relationship with a dude who claimed queerness as a way to get out of accountability for a lot of things & it always rubs me the wrong way when people adopt the label of queerness for any sexual behaviour (e.g. hetero polyamory, pegging) without the politics too...something they can slip out of when the time comes but is trendy for now. I don’t believe this is about bi/questioning folks at all. Glad you said this. ❤️", "palomabriceno": "Ok so, as a white-passing latina cis straight person I read this and was like: hmmm what? Am I boring. So first off, yes I’m boring second of... I’ve been reading this comments and learning. I did think at first questioning others’ queerness was a step back, but honestly I don’t think the queer community has to stan all those people who literally just use gay/lesbian/bi narratives as bait for straight men (“top” models, music videos). Some people just claim queer/gay/bi/+ when it’s convenient, not when it comes to the ugly part. (This is a thinking out loud post, I’m glad I stumbled upon this, I’m learning a lot)", "leorisingyoga": "cc: @themilajam @angelicactorres #QWW", "soft.gale": "Queer hetero people exist.", "katnzinghasdead": "👏🏾", "dylanjuza": "I’ve had an extremely difficult time meeting women and nonbinaries. As well as an extremely hard time explaining this to certain family members. Thank god my parents actually understand me. But still, I have had an extremely difficult time navigating my gender experience. And i am in a happily monogamous with a cis male. He was easier to meet. Which says something about how hard queer life is to navigate. While it’s great to point out the band wagon...it is not productive to make people feel paranoid about questioning who they are when it is already an extremely challenging life experience and no one gets to decide but a person on their own.", "kymea": "The amount of men who claim queerness just to get femmes or get particular types of girls to have sex with them is alarming. (Sad bi eboy aesthetic, (trying to get w that bi egirl) I’ve learned the hard way about these types of men) weaponizing queerness when it benefits them and using it for manipulation. People benefit from claiming queerness bc it’s seen as the “cool” marginalized group. People attach their queerness to elevate their aesthetic or to try and rebrand their boring ass selves themselves. Queer e girls/boys profit of this shit because in all honestly it’s become a marketable tool. I think some people like to feel marginalized simply bc they’re not. Straight white ppl choosing to align themselves w queerness because it’s trendy, quirky, and on brand for them. I think people who are trying so hard to make this about themselves in the comments or be upset with this argument know ppl who benefit for queerness/queer culture or feel like this could be them and are uncomfortable in noticing that. Conversations definitely need to be had. We have forgotten the ppl who really needed inclusivity to begin with (this applies to many marginalized groups) Why are we trusting the capitalizing of queer?", "disaster_phan": "I get that this is supposed to be a message for people to stop fetishizing queer relationships and all that but I am now worried that I might actually just be straight and making it up...", "ella.rose.card": "idk, I support your beliefs and I stan. But this post kind of made me think, the LGBT community doesn't need to be telling people that they're not lgbt and that they're just fishing to be oppressed. If someone says they're lgbt, who are you to question that. That's their job. Not yours.", "sonja_1988": "This whole post was on point. @brwnsuga_p13", "cacklebabez": "It isn't hate. It's calling out appropriation!!!!!", "apes17": "I need more of this one. What if we’re creating more space to feel safe in ones own skin and more people are just comfortable coming out? Similar to the results of destigmatizing mental health, we see an increase of mental health hotline calls, not necessarily less. When labels to an identity are destigmatizes, people are more comfortable wearing that. I think queerness exists within people more than the mainstream, Christian-ruled, colonial narrative allows. And I want to hear more of this original though, more examples to wrap my head around a different perspective", "speroarchives": "Yesss!! I am so tired every week of coming across another white, privileged, straight-passing, cis woman married to a man who prominently identifies as queer in her public profile for her influencer/artist/bizwoman acct for PROFIT!! I am not the sexual orientation police, but every one of those women, w/ just a little digging, turns out to be \"queer as in I once kissed a girl, or thought about it, or I'm asexual/demi-sexual or just FEEL like I'm different than normies.\" While living with extreme privilege, usually supported by her husband's income, and usually also identifying as a spoonie. I'm not the invisible chronic illness police, either, but, again, most of these women eventually reveal that they have... vaginitis, or eczema. Both forms of poaching business and attention, by claiming queerness while enjoying straight privilege, and identifying as disabled while living with the privilege of having excess amounts of free time to rest and heal from manageable conditions, while at the same time using their superior financial resources to grab much social media capital, at the expense of under-resourced people actually living queer lives while struggling w/ debilitating illnesses, make me super-mad. I literally see this EVERY week. It's soo lame. But, as a straight-passing, privileged, probably chronically ill but lucky to have free time to rest, cis bizwoman married to a man who is financially supporting me, I didn't feel it's my place to say something. Also, idk what to say, don't have the language for it. It's rampant. And it's wrong. Thank you for addressing it.", "k0reyw": "so fucking true, I always thought this but I could never explain it so succinctly", "santxpapaya": "🤣🤣🤣🤣 love this so much!", "cristalsharris": "Wheeeeewww Ericka SET IT OFF! Cleo would be proud.", "eviemichal20": "The (white) people mad about this are the ones that need to sit back and ask themselves this exact question. Don’t be mad at Ericka when y’all should be mad at yourselves. Besides, does a black queer non-binary femme really hold power to gatekeep y’all that claim queerness during the month of June? The answer is no.", "sex.iwishyouknew": "Wow love this", "madisyndenoff": "It doesn’t matter, just let people live. you only learn by your own experiences and everyone will eventually figure out who they are. I’m sure they don’t need the help of your tweet to do so", "sunflowrbruja": "This whole thing!✨", "meglab": "@latiitude_ 😂", "theredheadyoulovebest": "This feels like gatekeeping. Either people identify as queer or they don't. And if people want to come out on the internet because it feels safer to do so there first, before they live it out irl, let them.", "pootspalooza": "It’s cooler and “safer” (for cis white people) than ever to be queer, so out pop the James Charles palette-waving straight- folk who use rainbow flag emojis and say “‘Call Me By Your Name’ is a groundbreaking movie.” Pansexuality as an identity is obviously valid, but if I had a dime for every time I have heard “I just like people for their souls!” accompanied with a cry of queerdom from a previously and exclusively straight mouth, I could Scrooge McDuck a swimming pool.", "mylifeasapaprika": "okay I’m confused. @ihartericka you’re bashing ppl in the comments who are saying that this post is kinda harmful to those figuring out identity still, bc “another person who didn’t read my post” but uh isn’t that what you’re saying? this is a genuine question bc I’m lost, if that’s not what you’re saying/achieving, then what is it exactly that you’re trying to say? maybe I’m dumb and can’t read but can anyone explain bc this does come off as “gatekeeping” or whatever.", "nurselolita": "@kendrareidphotography this is exactly what we were talking about!", "christoph_ilg": "Why is sexual orientation here put in hierarchy? It is not something people choose to have, so by saying a certain sexual orientation is boring a hierarchy is created. Not cool.", "eccentricpsychedelic": "I think about this a lot. It sucks around pride month especially when every body is fucking “queer” for fun and here I am having to stay in the closet from family and work etc yet another year. Another year in therapy working out my internalized hate of my sexuality and trying to not feel dirty and shameful. But some straight dude painting his nails for a week or some insta chick who has never shown any support for the lgbtq+ folks can be queer for the brand and everybody is cool with it", "patrick_aaron": "Wow 🙌🏼", "charles_helfand": "Are you, as a member of the LGBTQ community actually being oppressed, or are you just tired of being accepted in society?", "lukeveld": "U are seriously fucked in the head", "wise11111": "If you never had signs or questioning moments when growing up then there is a very high probability your straight. And you really do have to think back, because certain situations may be your answer. For example, i dont necessarily align to the queer community, because i always considered myself straight. It wasnt until i watched a show called torchwood and the main character, jack harkness had relationships with everyone men, women, aliens, etc (its a sci fi/ fwi also in middle school when i saw this). I realized i felt connnection to him and after searching i discovered he was pansexual and realized that term matched me perfectly. And after thinking farther back there were alooot of signs in my childhood, but i never thought much of it because there were no terms for anything really besides straight and had a vague concept of people being gay. And eventually i started realizing more about my sexuality and it started becoming more defined. And i realized other people who were queer had some major signs in their childhood, too. And if you never had these signs, but you claim your queer that kind of makes you suspect and raises some red flags.", "shmemilyyyy10": "@satelllite_heart", "chumpsnacks": "THANK YOU FOR PUTTING THIS INTO WORDS", "alexasbeet": "I liked this, but I also have issues. I used to be an NB person who presented as my assigned gender at work because I was afraid. Now I'm femme in all contexts. Am I adequately queer now? Of so, when did it happen? I guess I don't feel like there is a finite quantity of gay in the world, so what's the point of guarding it?", "farrahfang": "👀🤐", "xdraemerx": "You just made me question my sexuality...", "madeleinerclark": "@hollyhales_ interesting", "shenanagrin": "I’m glad I read through the comments!! I never rly consider enough how much queerness is inherently rooted in politics even though I personally align and identify with this connection. It makes me consider a lot, though. I especially appreciated someone sayin something I NEVER see anyone bold enough to say abt the typical cis white woman talking about bi erasure as though it’s not privilege enough to be in a place of even PRESSING that convo. Thank you for pushing boundaries in a healthy and mindful way.", "cs.mulatiza": "Lmaoooo oh", "neeeens_": "Loving this question and how deep it goes.", "lori.sara": "Ya I'm just a boring straight person I admit it !", "ladieslitsquad": "☕️", "getbetterrecords": "💜💜💜", "thickthighs_shortshorts": "Ouch.", "feminist_brain": "YESS", "katecooper4thechildren": "Miley 👏🏼 fucking 👏🏼 Cyrus 👏🏼..... like what?!?! My eyes couldn’t possibly roll further into my head than they did reading her quote on her “new-age” marriage lol sit tf down.", "krisbailey_birthbusiness": "I’ve been feeling a little bit of an Imposter with the word queer . By American standards I’m boring and only leaning into queer . But I’m home home country I am queer to a disadvantage !", "chrisssmichelle": "Whewww !!!!", "carson0414": "🙌🏻🙌🏻🙌🏻", "emilyheatherprice": "thank you for saying this. people really gaslight on this topic but it's very real.", "gottesss\nVerified": "Verified", "oranges05": "Where do you stand on asexuality? I’ve realized recently that I definitely lie on that spectrum (Demi). But as I learn more, there’s seemingly alot of debate as to whether Ace/Demi folks get to claim themselves as queer if they are also hetero. What do you think? If you care to share.", "newyorktoycollective": "If you haven’t seen some sort of convenient queerness for capital gain this pride season then you haven’t had your eyes open. It’s one thing to be an ally, it’s another to claim an identity you don’t participate in for profit.", "mollyhassler": "have been looking for the language to talk about this w/o gatekeeping. thank you muchly. i also have strong “are you really queer or are you just using queerness as a bandaid for your white quilt/white privilege” feelings ! queerness is not entry level oppression or a mechanism to deflect all accountability for your actions ! it’s harmful to people who are actually queer and BIPOC ! don’t use the idea of queerness to sell to a primarily queer fan base ! sorry i got a little heated ❤️🌹 love y’all and thank u erica and eb (and baguette 🥖 ) for your work - y’all are the GOAT.", "italian_for_strawberries": "What's difficult as a person who is pan, rejecting the binary is that when I am partnered with a Male presenting person and I appear female to others (their assumption) I dont appear queer. I'm still as queer as I ever was!", "bethencrisdale": "I've been thinking about this a lot over the past couple of weeks.", "quanmichelle_": "I was just talking about this yesterday.", "brillachetipassa": "Wait, when has it ever been convenient to claim queerness? Isn't it the opposite? I think I'm quite ignorant here", "kxitlinhxtchison": "Yes. Yes. Yes.", "sophiawallaceartist": "Thank you for saying this. Right on time. 💯", "kineticlunarays": "What I’ve been saying! @pumpkin_dizz 🤦‍♀️ #trending", "bam.peesly": "I’ve thought this so many times but I’m a boring straight person so I never felt comfortable calling anybody out!", "sensa_netri": "I am heterosexual, and polygynous. Ain't no privilege over here. Polygyny is not even legal. So, I wholeheartedly disagree.", "mackenzieyes": "I hate this. Yes, too early!!! Who is claiming queer and yet is not? Even dating ir fetishizing a same sex person makes you queer. Its not conevnient and may not be coming from an elightened place, but it is still queerness. Mayb this question could be, how do you respect queer folks youre in relationship with?", "suttinsweet": "Being in a heteronormative relationship can be seen as not queer which is why you start the conversation and announce it as such. Owning that is essential to one’s identity as much as my mixed heritage is. I wouldn’t hide either one especially in the face of an opportunity to educate.", "keniciamc": "Honestly, I think people “claiming queerness” is a much smaller issue that does less harm than scrutinizing and gatekeeping the amount of queer you need to be REALLY queer and “accepted” in queer spaces. If someone is claiming they’re queer and they’re not...what active harm are they doing? If you know they’re not, how much effort or pain is it causing to just ignore them and their foolishness? That is an honest question because maybe I’m just not seeing it. Why does them being more successful because of their claim of queerness matter to you? Why should we be so concerned with these people? And to say, “I’m not gatekeeping BUT...” feels a lot like when cishet folks say, “I’m not homophobic BUT...” just because you claim it (ironically enough) doesn’t make it true. Just because you say “this shouldn’t harm questioning folk” doesn’t mean it won’t. I also find it to be a huge red flag when a question like this appears to be an open question for all answers but is then any opposing view is met in the comments section with IMMEDIATE undermining of personal identities, accusations of getting caught up in their feelings, not reading what you said, etc. It is 100% possible to have read this, sat with it, put emotions aside, and STILL find this more problematic (and quite honestly, more like petty moaning than anything revolutionary) than helpful. Yes this is her space, but she is a public figure and this is a public page and people have the ability to comment so they gonna. For real, read this comment section close and sit with THAT. Something isn’t right here and no amount of “you’re triggered, I’m not offended in the SLIGHTEST (because I’m so superior and more queer than everyone is how that reads btw which in turn just makes you seem the most insecure in your identity. And that’s fine because questions like this make that difficult and that sucks, I’m sorry.) seeing people laughing at, mocking, and taking pleasure in others’ pain and struggle with their acceptance of their identities is really sickening to my soul. We’ve been gatekept enough by society as a whole we don’t need to go back and start doing the same shit to our own people.", "garbage\nVerified": "Verified", "bisoucore": "miley cyrus be like", "evieameliasmith": "👏🏼", "lee_croix": "🙌🏼", "jazzybaby82": "I’m not queer, and cannot understand why someone would want to steal others identities to make themselves feel “cool” or “in.” Just another ploy to get seen. YOU ARE SEEN, let marginalized communities and their members have THEIR shit. Fucking taking appropriation asses. I hate folks sometimes 🙄😤😑😡", "cintia_quesada_": "💯💯💯", "tgrbass": "🎯💯🎯💯🎯", "d_santina_ruiz": "THIS!!!", "dancefightcarol": "🔥", "snirns": "@katyp17 @annietummy1994 I feel we know so many ppl and this is exactly what I try to explain when I’m annoyed with them", "daaaymgina": "@k_reagan 🙊", "dazedcourt88": "Aka gay until graduation", "strange_her": "😂", "campgirlmagic": "Thank you so much for this post! It’s relevant and timely! People need to get out of their feels and do some honest introspection... and then put in some work on behalf of the community. ✊🏾✊🏾✊🏾💖💜💙", "sadiesardr": "👏🏼👏🏼", "cottoncandylisa": "“Jessie J comes out as straight!”", "aundreadd": "Apparently white queers got UPSET about this—well if you read this and felt called out, GOOD. Ask yourself WHY instead of attacking the person who said it! There are plenty of celebrity activists who exist to affirm whiteness, go back to them. Or, better, stay here but shut up.", "preciousthyme": "It makes me so sad that some people would pretend to be something that many wish they weren’t based on how they are treated at home and by others. That is some privilege. I would know I have entirely too much myself.", "thestartlingrealityofthings": "💗", "thevietvegan": "This is totally something I'm terrified of doing. I just married my partner and I definitely benefit from the privilege of being in a straight relationship, but I think it is important for people to not feel afraid to embrace their identity even though they may be in hetero relationships.", "kutestlove": "This just sounds so bitter- just because you list all these things,etc to correct your statement, doesn’t make it any better. It’s as bad as someone saying I hate all blacks, but then list all of the ones you do like. We all know people become trends, black, Asian, queer, skinny, fat, grouping people to make a statement out of frustration is not the way to go. ✌🏾💜", "giraffrocentric": "👏🏽👏🏽👏🏽❤️", "the_childlike_empress": "All I’m sayin is if you know you’re queer this post ain’t hurting your feelings. But if the shoe fits my honeys, you better go ahead and lace that bitch up and start walkin", "chadrific": "please drag straight people, we are the worst. i have been wondering this myself but since i am straight i don't have the right to call someone out. this is a whooooooole damn mood. yes gawd drag the hell outta the straights", "llorarita": "Hey i just want to say i love your page, and am myself a queer woman, but i feel like this post is offensive. I feel like as a society we need to accept all types of love as valid, beautiful and unique. To me, being straight isn’t “boring” -it’s just people loving people. Which what i am personally always trying to advocate for.", "tylerdestroit": "For someone that is in a nesting relationship with someone who considers themself cishet, the question always comes up if I’m still a queer person. The idea of being queer to be cool, and even trans to be cool (ie “transtrender) is hurtful in a lot of ways. I would hope people are taking this as the next step of capitalizing on queer culture, but how can you really tell? There is no true blueprint or one way to be queer. I understand the heart of this content, but I do find it to be a fine line to walk.", "leti.lluna": "does a straight person have to be boring?", "maya.tep": "How about we just believe people, don’t questions who they are? Nobody should be psychoanalysed over if they are queer enough. Queerness is a spectrum not a ‘Queer or not’.", "monsteration": "💯💯💯", "nizzycrafts": "I get what you're saying about people capitalising off of queer identities, and how queerness is political, but the tweet in this screenshot is the sort of thing I see thrown at heteroromantic aces all the time. Being asexual is a queer identity, and when people exclude heteroromantic aces, they also give the message to aces with multiple queer identities that they are not truly welcome either (as a non-binary, biromantic ace, I definitely feel this way)", "phillyfledgling": "Well damn. 🔥 #convenientlyqueer? You gon have people in their feelings.", "aubdaub": "This is such an excellent question!!!", "jrink22": "Yup. Agreed.", "faiche_stiabhna": "Ericka is 100% not gatekeeping but am I the only one who would be totally ok if she were the one who got to decide who’s in and who’s out of the queer community? Some people need their cards revoked!", "natlablack": "@taylorswift", "hannajacksonalvage": "On fucking point! Thank you! 🌈", "salem_afangideh": "@adeola.naomi the teaaaaa", "jkulek3": "Funny how people want you to \"inspire\" them without also holding them accountable 😑", "thestarsmythic": "I have never felt like straight was an accurate marker of my identity, in fact I struggle to name my sexuality at all because no word has ever seemed to embody the fluidity of it. However, I’ve never felt comfortable using queer as a marker of identity because I have been privileged to be seen as straight in my life and have not had to suffer the marginalization and danger that out queer people have had to endure. I feel far more queer than I do straight, but do not feel okay claiming it as my identity. This is a great dialogue, thank you for opening it.", "rooftopphilosopher": "You're on point and I have another good read for you. Bisexuals are the light skin of the LGBT community. The amount of time people who can pass as straight will stand up for a person making homophobic jokes happens too much online: \"i'm bi and I find this funny\" 🙄🙄 then straight people are like \"See?? I knew you were all taking it too seriously\". People who identify as Queer and Bi and are passing, they're not directly impacted by the danger that comes from the jokes, the antagonisms. Though the ones who are wearing clothes that defy gender norms, that shows commitment to me, because you're being yourself and risking your privilege for real", "linda.kima.zake": "@ihartericka are all white people that are straight are boring? This feels a bit like shaming.", "jordanisjustfine": "Also, very telling that yt people do not relate queerness to politic. We have so much privilege that I think many privileged yt queer ppl don’t consider it political until *gasp* another queer is slighted (like not getting a cake from a Christian bakery) which people should be upset about? But maybe be as fierce when black trans women are getting murdered???", "melmangles": "Oh yes! Ericka Heart is on the case again. Thank you!! I’ve seen this in FB housing groups. White Ppl claiming to be queer for access to more affordable housing options in shared homes. Pathetic.", "favepart": "cough @porches_hiii cough", "kenzie.aisling": "I know I'm queer. Only word that has ever felt familar to me", "_run_fatgirl_run_": "This fucks me up. Fake queerness. That's fucking wild. That hurts, actually. Damn.", "space_babes_art": "Omg this though", "simonelovesfitness": "Reading comprehension....", "leonne11_": "And this is why I never claimed “queer” even though I’ve been with and am attracted to women. It’s more than who you fuck. And until I understand that fully, I will continue to identify as cis-het. It’s not that hard. You yts need to get out of your feelings cuz y’all got Eb & Ericka fucked up.", "monatheism": "Sometimes I won't lie~ I don't always feel 100% female but never male in any sense and. I've always been attracted to people of other genders. But I've only ever experienced life as either a gay cis male or a straight trans female. And lately my romantic and emotional interest has been v confusing for me. 😭", "fireflyhealing": "🙌💟🔥🌟💖🙌💙💖🌟🔥💙💟", "guardian_vibe_angel": "Not naming names but I def know straight people who call themselves queer ...!", "i_needbeanzandrice": "I had this really really well thought out and well written post...then I accidentally deleted it 🥴 thank you for everything you do with your platform. I just can’t tell you enough how awesome it is. There’s a lot of internalized shame/and unnecessary embarrassment I felt with a lot. A lot I’m still processing and there’s so much I want to say but idk how yet. I can say I feel this though.", "jodilynsmith1": "I’m hoping all this fantastic discussion doesn’t get out of hand with drama, which will only hurt this incredible movement. We’re all in this together. Just check out a bell curve of sexuality and 80% of us fall somewhere in between fully straight and fully gay. That’s a lot of us to gain power, as long as we’re not fighting amongst one another. 💪🏻😎💕", "therealmamaboo": "I’m that boring straight person who’s friends are all queer 😁", "sydney___patricia": "My experience with this is how queerness and its relation to art have been weaponized. Countless white cishet men I went to high school with and whose behavior was largely dictated by toxic masculinity moved out of our conservative suburb to go to school and were suddenly making blocks of cement with pencils sticking out of them or painting a few squiggly black lines on a canvas and claiming to be queer yet dating only presumably cis and likely straight white girls. Just because you learned about feminism, painted your nails, and got in touch with your artistic side does not mean you get to claim queerness. Especially if you’re utilizing your white cishet privilege to live in the largely white, financially abundant neighborhoods of liberal hotbed cities.", "justnece": "👏🏼", "discoveringcasey": "🙏🏼🙌🏼", "kbx9ph": "I read your posts daily and when you has spoken about companies just taking advantage of pride I began seeing it everywhere. I decided to speak out against a well-known hair company for coloring there \"pride products\" which was the normal product with a rainbow on it. As soon as I had asked them if money would go towards a charity for helping people, they had changed their post an hour later claiming it went towards something. I don't know if it helped...but I hope so. ❤️", "ninardarling": "Can’t they see? How they hang on so desperately? To words they act like they can’t read? To a nuance they fail to see? Y’all are missing the point Queerness is not something to anoint That’s the point It’s not to be taken up Until the jig is up Y’all take what doesn’t serve you Wanna start conflict that ain’t even about you It’s about the ones it’s about It’s a question meant to find the clarity and the doubt About the misuse of an identity About the abuse of something used as a commodity If it’s not you, why you trippin? If it is you, start that self interrogation Get it straight, this is about queerness Not about answers steeped in defensiveness Don’t misunderstand erickas words Trying not to listen so the words won’t be heard That’s all I got cause y’all make me laugh With all this convoluted conflict, y’all are a pain in my ass", "nicolelnorth": "Oh boy there’s some fun biphobia in the comments 🙃 BI PEOPLE ARE QUEER AND VALID. You are queer enough!", "phoenixical": "All of this!!!!", "tatianafogt": "@brazentravelthoughts per our convo earlier this week!", "victoriagrows": "I love your thought provoking questions! Thank you for always keeping us honest and introspective. (This is a white, recently out bi person with a lot of privilege.)", "ajayslive": "I feel this heavy, not only am i and have I been in danger for my queerness with or without a partner but I also don’t get to capitalize or cash in my queerness in any space for clout or money or exposure or access and there’s so much tension in the folks that can and are. Similar conversations go for folks who are considered “passing” because of whatever reason, erasure is definitely violence but it’s a different type of violence and threat than the one I live with - a threat that doesn’t afford me with any privileges. Mad nuance", "alathariel": "I think about this a lot. I don’t want to take up space with my queeries (k but that’s good right?) and I wonder why “straight” doesn’t feel right to me. How about I figure it out before I shout about it in queer spaces.", "carriebethwaghorn": "Something to think about****", "quicavstheworld": "Maybe I'm misunderstanding, but just like all minority folx, most queer folk are not comfortable just proclaiming, or...idk the word...that aspect of their identity. I think most often, if you're so comfortable identifying it publically, etc. And not using your platform, youre either privileged enough to not need that fear, or you're not really queer and it's a tool for your identity. But, like I said, maybe I misunderstand. I commented so I can read more responses and learn. I love LEARNING and GROWING from questions like this b", "anyalud": "Honestly on the heels of sooooo many straight white people marching in Pride this year, not soon enough. Thank you!", "amberamal": "I saw a lot of straight white people taking up space for Pride and centering their allyship. Going strong. Not only is it vomit inducing it makes me ask why they don’t come with this same energy for racism? Love is Love as long as your straight ass can dance and wear a rainbow but where is the love for all the black folks being murdered by cops? I dunno. This year nothing felt right.", "lynnemonsoon": "Thank you!!! 💜", "leahnicoletisdale": "Claiming queerness isn’t easy. 16yrs after coming out, i still struggle & have my bi credentials questioned. It makes me sad to think people are claiming queerness for clout. I almost can’t believe it. Because the lived experience is anything but rainbows for a lot of us.", "jme.mths": "White people not needing to feel special and takeover and exploit every identity and be fine with boring straightness 2020™️", "thisrawsomeveganlife": "I just screamed", "treasalevasseur": "Thank you for opening my mind further.", "holeiosis": "This go crazy", "shay2105": "@virginia_kate_ ohhh this", "el_jay_the_lion": "Here’s the thing. If this bothers you, then you should really rethink your queerness. If you automatically want to say, “but but but”... then you got something to work on. And there’s nothing wrong with that...... take this as a gift, look within and LISTEN.", "stacefacekillah": "Thank you for never being afraid of saying things that people are way too willing to attack you for. If you’re attacking @ihartericka for this QUESTION maybe you’re being defensive for a reason (or you aren’t actually reading their post).", "indirectpurpose": "I’m really queer but I absolutely concede your point. I grew up with semi-closeted lesbian parents in NC and I think knowing the feeling of being on the margins sometimes has helped me look back and better understand how my socialization and upbringing was inherently racist and the product of a racist society. It helps me gain perspective when I can hop right in the closet (shame story) and not hold hands with my wife when we travel one hour in any direction from Raleigh NC (usually stopping for BBQ). I have caught myself and been in situations, like a queer meetup at a social justice conference recently, where I noticed the comfort reappear and it felt like whiteness was re-centered in the conversation when so much effort had gone into making space for marginalized voices the rest of the time. Thanks for the opportunity to think about it. I’m working on unpacking, and leveraging some white privilege.", "fern_elsi": "i agree! i see a lot of people in my generation being queer for a “trend”, however, i also believe that no queer person has the right to tell another queer person who they are. i think there is a line to be drawn between what is conversation and opinion and what is gatekeeping", "kolbybrianne": "I wonder how many people read this question, realized their true answer is the latter and then decided to lash out instead of doing the internal work needed?", "doctornursesierra": "\"Queerness as a convenience until it's inconvenient\" THIS IS EVERYWHERE", "aeppich21": "This really has me thinking so I decided to ask my spouse who is white, cis, straight, male, how he would describe my sexuality. He said, “that you’re a straight woman who has liked other women in the past.” Mind you he knows my relationship history and who I am attracted to. So I say to him, “I’ve told you I’m bi before. You know this.” And he says “You can’t be bi because you’re married to me. Bisexuals have relationships with both and can’t make up their minds.” Bless his little ignorant self. So I explained to him the difference between monogamy/polyamory, bi/pan, gender/sex/sexuality, and how all of this intersects with my white privileged, hetero-appearing self. Whew I’m tired. This is what my privilege affords me. Not having to have these conversations unless I choose to. Thanks for the question and making me work a little bit.", "pumpupthespacejam": "Thank you for this 💎💎💎💎", "bettinajudd": "Cis het feminine women deciding they are femmes.", "forestfreeek": "👏🏽👏🏽👏🏽", "cuatesmom": "It’s the same as white racist folks who claim to be Native, usually claiming Cherokee, so that they can say they have a right to call other folks illegal. And then state their allegiance to Trump.", "jordanclairesmith": "This puts queer and straight on a binary, which is ultimately harmful. This exact thinking is what led me to not come out sooner- am I really queer or do I just want to be part of the community? And that hurt me. Because I really am queer, and always have been. How are you defining who is “actually” queer and who isn’t? Because this seems to me like a way to shame multisexual people who don’t have experience with the same sex or have preferences for their opposite binary gender, or those who don’t have a label yet but don’t consider themselves straight. I can’t comprehend how trying to determine who’s queer and who isn’t could possibly do any good.", "prayyedupp": "Can someone explain queer to me please I consider myself bi or pan but idk really what queer is", "uhkiea": "LOLLLLL boring straight person. *snickers*", "priwillbgreater": "I don’t wanna be a boring straight person", "_ree_belle": "\"Apart of your business model\" ...👀🕵🏾‍♂️", "dumpnixon": "hell yes. thank you", "ericalovejones": "How would someone even differentiate if they are questioning is that the whole purpose of questioning", "meowwwza": "I am extremely hesitant to say I’m queer because I’m a white cis-gendered female and I’m currently in a long-term relationship with a straight white cis-man. And Im attracted to cis women, transgender people and cis men. And I still don’t feel comfortable disclosing my sexuality because even saying i was bisexual was called into question. I also realized this about myself at 30 years old, so a lot of people around me just didn’t understand nor see it as real/true or they may instead have sensationalized it. It’s an uncomfortable space to be in, but others are dealt worse, so I’m fine being here.", "cassetz": "Thank you for saying this", "kingagetsherlife": "@dwwalks thats all I'm sayin! Lol", "theblackbisexual": "I ask this shit allllll the time👏🏾👏🏾👏🏾👏🏾👏🏾👏🏾", "beth.o.brien": "I know what you’re saying. And I know what you’re saying in defence of your post. I see the validity. Whether you said anything specifically like a gatekeeper, this type of thought is used against non monosexual people daily. Biphobia and bierasure are really prominent in hetero AND queer spaces. We get it from all sides. Being queer doesn’t mean you can’t hurt other queer people. So while i can see and agree with your point, it’s not cool to disparage our POV. Those thoughts and feelings are valid too. They don’t invalidate your point(s), but your point doesn’t invalidate our feelings or experiences. The fact that there is at least one biphobic person in the comments is an example of that. Attitudes like that are what lead to much, much higher rates of depression and suicide in bi people than monosexual orientations. And we make up 50% of the queer community. It’s not criticism. It’s asking to be heard and respected. Just like you are.", "nblvblbavery": "OH S***. TABLES ARE SHAKING.", "al_inthewoods": "I see this more recently with white people who try to claim non-binary. White people, who recognize their privilege but don't want to be associated with it, are constantly trying to make themselves as marginalized as possible. They think it absolves them and they think it makes them cooler. As a white queer who used to engage in this type of problematic behavior, I'm able to easily recognize it in others. It's gross and harmful", "davidcarbs": "been saying this and i get dragged all the time for “policing” queerness. ugh lol", "alexandria_amina": "Any advice for someone who's questioning? I'm nervous about dating before I'm sure because I don't want to waste someone's time, but I'm confused about what my sexuality is?", "abby.potter": "HDFSIDGAODHSODBSODBDOFB", "seesaalt": "A valid question", "laur_true": "I am disappointed in this post", "charlie_g_fennel": "Chapó", "sugaring.brooklyn": "I mean… Are you just claiming queer when you’re in queer groups… Or are you claiming queer when it’s hard?", "amyrsward": "Loving so many of these comments! I always downplayed my queerness or outrightly confirmed to heteronormative constructs because the person I ended up loving and marrying was a cis man. Like others, I felt like more loudly sharing my queerness took up space (I'm dripping in privilege) and then I had a kid and couldn't balance hiding my full self while raising them to be fully themself. And instead of using my privilege as an excuse to stay quiet and let (again and again) folks who experience more oppression and marginalization than me do all the fighting I benefit from, I'm here to join that fight and wield my privilege and power in service.", "thestrippingshrink": "This is a tough question... as a questioning bi/pansexual person I have a lot of anxiety about claiming the label “queer” (I’m in a hetero relationship, so am protected from a lot of external stigma). I have certainly come across people who call themselves queer but are by their own admission only interested in hetero liaisons (straight soft bois who want to fly under the radar and score liberal women, for example!!!). For questioning people like myself this is exactly what makes me afraid to call myself queer... but I am certainly not straight either (is anyone, really?? The very concept confuses me...). It’s a constant battle between internalized stigma and the fear of rejection from both queer and straight camps. Not an easy or comfortable place to belong 😢", "sampraus": "@tarasonali", "caitlinrmathews": "Literally almost everyone at my school is starting to claim they are bi saying they’re apart of the queer community, while behind the scenes they say they will never date the same sex and have never stood up or spoken out about the issues our community actually faces.", "skynoire": "Literally here for the comments 🍿", "suzannemw": "👏🏼👏🏼👏🏼", "leonicachia": "Honestly, when Katy Perry came out with I kissed a girl or the L word was broadcasted, being a lesbian became all the rage. I never fully considered the harm of this but can you imagine that this was a trend and it seems from the post, still is, probably was before and I just never noticed as a cis gender heterosexual. On a capitalist standpoint this is so evident with brands aesthetically backing LGBTQI but put their money into conflicting companies and politics that does not support the needs of LGBTQI and this is without considering the intersectionality of race, class and age... How people are confusing this with self-doubt related to queerness and attraction/ sexuality is perplexing. 🙄", "lilrosie25": "Wow, reading through the whyte comments on this was exhausting. If this question is causing such a stir it might be a sign that you should sit with it and think about it a little longer y'all. I am not straight, but don't use queer as an identifier as I currently in a cis relationship. I am not offended by this in the SLIGHTEST because it raises a very good point.", "remotedestroyer": "boop!", "cahappymeal": "Thank you for all that you share. The answers and the questions ❤️", "hollytillphoto": "@bloodbloodgla_", "lhakimhealing": "litterally thought this a few days ago anout may folks I saw during pride.. 🙄", "nickrogers1312": "I know I’m gunna get hate for this, but I feel like the only people who are gettin mad at this post are the exact ones it’s talkin about 🤷🏻‍♂️", "sarah__saha": "@rockbonesdan", "rosemarsbar": "@ihartericka i think this is such an important post following NY Pride this weekend. a black trans woman was nearly arrested during a drag show AT the stonewall inn because she wanted to honour the 11 murdered black trans women this year (white audience kept heckling her and she gets nearly arrested 🤔). It just shows that whatever queerness is, Pride does not include or benefit all of them. So even if this “threatening” question maybe prevents some people from coming out, I think it’s more important to think about why multinational corporations are getting more money because of their rainbow flag logos and people have a fun day dancing in the street, while black trans women are being murdered.", "thewaythru": "I feel like this whole social media thing has robbed us our internal voices. Like...why can't folks see something that doesn't apply to them and (internally) be like...that doesn't apply to me. 🤷🏾", "just_mandyr": "I think about this question a lot, personally. I’m queer/bi and am in a heteronormative marriage. Does it matter who I can be attracted to if I’m in a relationship? Does my inner identity matter? Why do I want people to know this about me? I don’t know if/when I’ll have my own questions to this, but I do know that something inside of me keeps pushing me to come out over and over again, feeling like it is important to me even though it’s scary to say out loud.", "verapapisova\nVerified": "Verified", "csudhqueer": "Such a good question. Also, to add a layer. Are you queer or are you using one of the only words we have to redefine beyond broken ideas how you feel and know yourself? We see a lot of people questioning and exploring queerness when what they are trying to explore deeper is how to break heteronormativity how it is today and until words are alive queer sometimes is the first to try on.", "rachael.alaia": "Oh, damn 🔥", "suzponomarenko": "This reminds me of the conversations that were had of the term bi 10 years ago and I think we should have safe spaces to explore and also ask these important questions. It’s good stuff if given proper support.", "_aobc_": "Ericka: encourages people to perform self reflection. People: nah 🛑 😭", "micajacu": "is this a thing ?", "takeaholladay": "📣📣📣", "oldbagel": "Sad *", "quaquaversality": "...and those people who move the world visibly as cisheteroromantic “queers,” but manage to dig out receipts for their isolated past queer sexual encounters whenever they’re called out for enthusiastically partaking in cishet(-erosexual) + (-romantic) privileges🤨", "kanndissriley": "Why my queerness has been private because I didn’t want to discuss it but people like Erica make me think 🤔 and talk to other about it in my community", "lagrossetoile": "Also alllll the performing activists suddenly stating that they've been supporting queer folk and femmes for years. Oh, really? Even their language suddenly changed.", "iischristy": "Thank you !", "4shp1nk": "Fuckkkk that. I've felt so conflicted since I was a kid with my sexuality and the fact people want to be insta famous for ring queer is repulsive", "chelseamato": "💜💜💜", "etnologico_": "questioning someones ''queerness'', as sketchy as they seem, opens space for any one to question your own queerness, and thats very dangerous. don't know the point u are trying to make here, but thats definetly not a great start", "quemmegalaxy": "I discovered that I was ngt straight very/quite late. I absolutely did got through a second puperty. Though my first one was not much at all. Anyways - If I would have read this question during these times I would have definitely thought about if I was really queer, if I belonged etc but it wouldn't have stopped me to explore and to come out. I just felt it was right where I belonged, despite of the doubt. Not only sexual but also political/identity wise. A question can irritate and inimidate but imho not stop you from becoming what u really are. that goes out to everyon saying this is \"dangerous\".", "raneenbukhari": "Thank you", "iamshaunna_williams": "Everyone is very sensitive. I’m all about feeling your feelings but dang. People will use anything to sale or fit in!!! It’s a fact. What’s even more side is that people who haven’t been in the struggle are profiting off of the benefits. People are out here commercializing vulnerability and victimization, it’s insane. However, my loves. Chill, live your life. This is a self discovery question and yes it may have an ego/negative feel to you if it’s the lenses you’re perceiving from— but babies... it’s a question! All of y’all are giving your power away on this post and then wondering why we can’t bring peace to our hearts and homes and be treated rightfully. Can I get an amen!!!", "cheyeran": "@ every pop star with a bi-curious single and the train stops there", "vanessa.wh0": "I thought I was awful for thinking this about certain people", "lifeofcarrot": "I think this is a particularly hard topic to tackle. On one hand there's no denying that most people are comfortable being cis and straight. On the other, I simply do not believe that human sexuality is either or. It's a spectrum. So where do we set the boundary? How much of the unwillingness to let people claim the queer status is our own disbelief that there could be so so so many queer folk out there or the wanting to remain, in a certain extent, an exclusive group? Of course, I don't want to take away from the actual queer folk's experience or give more voice to the fake queers out there. It's sI wouldn't wanna be the person discouraging people from discovering who they are.", "sailorlesbian": "Ericka isn’t talking about people who are struggling to find themselves in a cis/heteronormative landscape. As they’ve said repeatedly on here they’re talking about those who capitalize off of queerness without facing nearly any of the real material conditions of LGBTQ marginalization. A perfect example is ariana grandes music video for “break up with your gf I’m bored.”", "melaniezoeyishere": "Some of us can own queerness without advertising it - and take responsibility for our own boring-ass privileges. Both/and. By speaking about it, however, we can do so not to call attention to ourselves or capitalize on the term - but rather inspire more people to acknowledge how on the spectrum we all are and can be. When we are openly free, we encourage other people to find their freedom, too. For me, any time I speak about my \"queerness\" (which is very, very rare b/c of said privileges) I feel a sense of fear and personal stake. I feel the tremble of authenticity in myself. I agree that we have to monitor ourselves and our own intentions, but we also can't be afraid to speak at all for fear of being accused of faking it. I think that we have to practice trusting ourselves and our own intentions....while also listening very hard to those who created and claimed these identities before us, so as not to overstep or diminish the power of these words. Thank you for starting this important convo, @ihartericka happy pride.", "baddaydreams": "OOP", "possumxqueen": "Thank you for this post 🙏🏽 my ‘bi’ friend who exhibited hella transphobic behaviors married a homophobe and now lives in Alabama.. 🤦🏻‍♀️ I cant.", "raffertyhallows": "I've noticed this too. Thanks for putting it out there", "_paddygarrigan": "A MILLION TIMES THIS", "femmeinfloral": "My spouse and I were just talking last night a few friends we have who claim queerness but have exclusively dating cis white (or white passing) men. Like their identity is still valid, even if your attraction is 90% one gender you can still be bi or pan or whatever but ALSO they are not living the same queer life as my spouse and I, who both have a F gender marker. And then also important to note that my spouse and I are not living the same queer life as qtpoc as we’re both white.", "osain.p": "And I oop...😂", "criticalchemicals": "I feel like I am within the queer definition, but being asexual isnt something a lot of people recognize", "ocean_femme": "I shouldn't be surprised that people are not reading what you said and getting caught up in their feels. Every queer/gay goes through a moment of not feeling queer/gay enough. But that's not even what the post is saying. Like it's about fetishizing queerness like it's this jacket you put and and take off. It's fetishizing queer people and everything about us. I say this as someone who is cishet passing who has many cishet passing friends. This is NOT about gatekeeping. It's literally about people reducing queerness to a cute lifestyle aesthetic built around rainbows and queer people to magical unicorns and shit.", "brownboicookie": "👏🏽👏🏽👏🏽", "thelocdbella": "Just like blackness or proximity to anything black is convenient until it’s an inconvenience", "taprootdoula": "SAY IT", "mswrightsway\nVerified": "Verified", "katertotthegreatertot": "For me I’m uncomfortable with my queerness and keep it private in interpersonal non-online relationships. This is also a product of oppression, it’s very interesting that it would go the other way 🤔 I’ve had several long term relationships with women my family has never met. Thank God for living out of state!", "koyukipanda": "🙌🏾🙌🏾🙌🏾🙌🏾", "jilla_821": "🔥🔥🔥", "broccoli.rabert": "THANK YOU. I’ve really struggled with seeing some folks I know claim to be queer and it gives me so much pause. Maybe it’s cuz I literally endured a five hour beating from my parents when I came out sixteen years ago that I feel this way, but it feels like people want to claim queerness without the struggle. I don’t mean that you have to get your ass kicked, disowned, taunted, etc to be truly queer. I’m more saying that for so many of us, it’s been a struggle, and to see so many taking this word now that it’s in vogue to be queer is hard. By all means, question yourself. Be queer, be genderqueer, be curious. But be respectful of what this word has meant for so many.", "beingflower.pdf": "Haven't personally met anyone like that, but I do think that queerness and blackness are becoming a trend....and that's hurtful to progress. Not gonna lie, I was triggered a little 😅 mostly because I am in the close with my family and I am Bi/Pansexual....but this isn't directed at that so I probs needa work on my white fragility 💁", "just_fitz_in": "I also feel like a lot of people will invoke “queerness” then will judge and mock other marginalized groups (SWers, POC, trans women, etc). I never want to gatekeep or be exclusionary, but if your queerness includes upholding existing power structures, what exactly is /queer/ about it?", "theafrodisiak": "it is happening. speak it.", "samhasadog": "💯💯💯💯💯💯💯", "mariposafemme": "🙌🏽🙌🏽🙌🏽", "hijadecoca": "💖💖💖", "amphetaminecommunist": "@malakjm_ SHOTS FIRED", "nepenthesenuts": "This post and all of its comments sent me on an emotional rollercoaster, THANK U.", "displacedyke": "#QueernessIsntATrend", "aiseiri": "All the ppl", "loveytheawakenedarcher": "Real talk ✊🏽🖤", "borikenphoenix12": "Facts!", "youre.doing.amazing.saweetie": "Shu📣", "hairicane_u": "THANK YOU!!!!!🙌🏿🙌🏿", "deeeebo_x": "I've asked myself this plenty of times in regards to my Queerness and to be honest, being Black is Queer. And I oop...", "brookeblaize": "A lot of y'all read what you wanted to see here as a means to center yourselves rather than actually examining what was said.", "sexologistshamyra": "I definitely appreciate your clarification here!💚💚", "hallanorth": "Is that a thing in the states, straight people going trojan horse queer? I'm curious cause i haven't seen that happening in the Danish and Icelandic queer scene, except for once when I thought one person was doing that but was just like... Really? Do people do that? Am I imagining this? Why???", "eunicekkwon": "Damnnnnnn such an important question!!!", "yasminthemachine": "I'm Queer as in 'actively yearning for the downfall of capitalism\"", "scremilyjane": "I've been thinking about this post all day. I think the ultimate irony of everyone accusing a black non binary person of harming bisexual ppl is that the actual phenomenon @ihartericka is referring to (straight ppl using queerness for cool points) is something that ACTUALLY harms bisexual ppl! I know so many bis feel so lost in the sauce when it comes to these convos and I really get it (I'm one of those Bad Bisexuals™ - dating a man, having a lot of feelings about it, feeling lost in queer community)... But what I think we always always forget is that other queers are not the people who have the power to harm us (and esp not queers with multi marginalized identities). It's straight ppl - holding them to account actually helps us get closer to freedom. Not the other way around. ♥️", "rroxymore": "💯", "b0mbonsito": "👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽👏🏽", "londisgoods": "@melissam1239 your whole school", "vargasmarquez": "👏👏👏👏", "ruby.kmb": "me @ myself every time im attracted to a man", "baddestbas": "@lma1515 this always", "mostlikelytostarttheapocalypse": "If people legitimately do this I legit want to wring their necks out. It took me years of unlearning the brainwashing I went through with my parents. They told me that I was just acting like I loved my girlfriend to turn on someone else and I’d be seen as a liar (to make me seem special) at best, and a whore (they even implied I’d be raped if I dated openly) at worst. They told me I’d never find true love. They brainwashed me to be a puppet out of fear. I live and love openly now, but if what ur saying is true, it makes people like me wonder if my parents were right. It triggers people like me back into the suicidal mental state I was in when I was fifteen and clueless about what was right (loving openly) and what was wrong (my abuse).", "bravebird131": "Thank you so much for this. I recently interacted with a thread on twitter that acknowledged being a queer woman by choice for politics as a valid queer identity and it hurt my feelings so much.", "xovitoxo": "Amen!!! Can we talk about that?!??", "daria_ann_poet": "Omg I seeeeeeeeriously wonder. But as a cishet woman I don’t want to dismiss people’s queer relationships/identity as phony or tell them they’re not “gay enough.” I also get that sexuality is a spectrum and some are just coming to terms with the fluidity in themselves. I get all this and yet. And yet sometimes...", "fourthreefivesixzero": "What people aren't grapsing is that Ericka is calling awareness to people claiming a marginalized group, the LGBT community, as their own when they themself aren't marginalized in any way in order to be on trend or relevant. That's why they also mentioned white people claiming blackness because it's on the same wavelength. They're trying to help make sure that our community is protected from capitalization and fetishization. Which is what happens when the LGBT community is used by people and businesses for the wrong reasons. If you're not doing that then you're not the problem and that's that.", "laura_luna": "“They do anything for clout”", "tai_sen_choy": "As a boring straight person 👏", "myfitchbad": "💯 on the mark as always", "trainingbrawl": "True. I have two branch off questions if you're not sick of talking about this yet. First: What harm is caused to us by these personal gain clout-chasing types? Second: Would embracing them alleviate that harm, or help make it easier for queer folx to exist/operate/survive in this world? Thanks for bringing this topic up, I've been thinking a lot about it too.", "quant_umm": "Oh we also gonna talk about cis white gay men presenting feminine for likes or notoriety but never doing anything for queer poc and presenting masculine/promoting toxic masculinity when not on the internet?", "cadaxala": "@ihartericka I apologize for commenting here. I was trying to help clarify the situation, but clearly I did not do so. I agree with your message and wish you well, and I’ll refrain from commenting as I usually do.", "croptopgoth": "omg i was SCREAMING about this yesterday — thank u for this excellent post", "candaland": "Those of us who are cis white women need to stop acting like Erika’s (and any POC) posts need to be a “safe space” for us to process our coming out. It’s up to us to work through our own internalized homophobia or bi erasure separately on our own time (and yes there’s support for us out there, despite discrimination we could feel in some queer spaces) This post is obviously talking about a separate issue, and if it makes us feel uncomfortable, we need to sit with it and figure out why. Just because I’m bisexual and had trouble coming out for fear of “attention grabbing” doesn’t mean this post is directed at me or taking from me. It also doesn’t mean that there aren’t white people taking up space in places and ways that reflect colonialism and having fun with a queer “persona” without committing to any queer issues, especially issues that affect QPOC. All white people need to think about how we indirectly (or directly) contribute to the erasure of QPOC’s needs and issues and how we participate in capitalism and media consumption. Who is doing the hard work? Who isn’t? What can we do better. QPOC do not need to be tone policed by us. Not every post needs to be our “safe place”. Nothing in this post is attacking your sincere coming out process. Gotta absorb the complex and nuances info here and check ourselves and then move forward to make things better.", "blacknerdgoddess": "💯", "heyheyhaleyjo": "Wonderful question and got me thinking as always. I appreciate you and your insights so much because you always bring up all the unthoughtof (definitely not a word 😅) perspectives. As a queer woman who is out, but unaccepted by a lot of family still, my openness and being truly myself are sadly reserved for the people closest to me, the most understanding and accepting souls. And It sucks. I find myself daily wanting to post things that scream by true sexual orientation, but it sadly, so sadly, isn’t worth the damn drama with the bigots in the family. Just this week I was called out for “not being gay enough” and “using queerness as a bandage to cover my whiteness” and while I do not disagree with their opinions, it was one of those moments where I caught myself questioning my own sexuality. Like am I gay? Or am I stuck in the mode of thinking that’s how I’m suppose to be because of my past with women? It’s so good to think about these things, to look inward and really discus with yourself why you are doing certain things. But it’s also hard to be completely honest when you still have to closet yourself for the obligations of “family”", "lizard_found_joy": "Tbh my girlfriend and I ask this all the time. Thanks for validating our thoughts @ihartericka", "natlizzo": "Yooo, my younger sibling and I were just talking about this, thank you for articulating this 🙌🏾 There are folks who are cappin’ cause they wanna hold a torch in the Oppression Olympics 🥴", "shinydiscoballs_": "👏🏾👏🏾👏🏾👏🏾", "tigredelsol": "I feel like it's the same type of person who does one of those ancestry dna tests, finds out that they have .02% indegenous blood then buys Pendleton everything and uses it as an excuse to wear war bonnets at festivals. Like just be ok with being attracted to different people sometimes without exploiting queer identity or culture in order to brand yourself to be relevant. trying to grasp onto someone else's struggle in order to have the illusion of some depth or relevance is an easy alternative to putting in the effort to discover your true self.", "dontforgetthesnacks": "@rheanna_may SAAAAAME", "jennyrohbee": "💯💯💯", "groovinonadoobiewave": "But what makes someone queer in your eyes? How is questioning someone’s queer identity different than questioning any other facet of someone’s self-identity? I’m unsure as to how you can ever say that someone’s claim to queerness is ever just about appearing relevant, especially if your context is just their public life that you see online, and not be gatekeeping.", "nadi_amarena": "Man oh man oh man. Did you know that you can be both anti gatekeeping AND call out those abusing and co opting queer culture? Honestly thank you for this post and people getting riled up for nothing", "dani_who__": "This kind of thing makes me question myself, even though I’ve known since I was 13.", "irisbonnaud": "Oh I have been asking myself this question a lot since I started to look for ways to educate myself about my privileges. This is why I love your work here, I am so happy I found you! Thank you so much for everything you do ❤️", "spookybluekay": "I’ve wanted to have this conversation so much, but have been afraid of being called a gatekeeper. There are too many celebrities and youtubers and businesses that queer bait and profit off of queer people & culture w/o actually being queer. And when people ask them if they’re queer or not they don’t want to give an answer, not because they don’t want to label themselves (which is totally ok) but because they don’t want to give up the charade & queer baiting and lose their LGBT queer audience. I’m tired of it. Not to mention the fetishization & “trendiness” of being queer. There is nothing wrong with questioning, with being in the closet until you feel comfortable, with personally not wanting to label oneself, or with appearing as heteronormative but actually being queer, but there IS something wrong with queer baiting & using queer identities & culture, ESPECIALLY when you backtrack when it inconveniences you or you have to actually put work in to help the communities you profit off of. End of conversation.", "notyettrending": "Man this is spicy and I love. 🔥But to my Pan and Bi friends shouting oppression. Please listen closer THEY ARE NOT TALKING ABOUT YOU. The most fabulous Erika is about them folks. Who become a little to curious about weather or not we've had a threesome. They're talking about the people who very clearly be playing a role for performance purposes only. Now I know we've have possibly heard this from someone really trying to come at us sideways. But the statement is not meant for you.", "ninakossoff": "omfg 👏🏽 this is never too early I think about this so much", "glitteringtone": "@bleuj____ @coolgruel this is what I was trying to say the other week!", "anamiree": "@ihartericka When you have a kid and people think you look like a woman, they almost always think you're straight too. Because the only way to have a child is obvioisly by loving the cis-het dick. It's pretty frustrating sometimes. You'll see when you have your own baby. I'm not mad about it, but it gets really old sometimes. Maybe some people have been traumatized enough by society that this is a triggering question. The ones who think you personally are being aggressive or threatening are definitely having a racist moment though.", "yourempoweredvoice": "I’m a “recently discovered that I’m queer” queer person. And I appreciate this post. We have to be willing to do self-inquiry and I don’t see it as gatekeeping at all. I recognize that even as a straight-passing queer person I have a ton of privilege, and I find it best to speak about it, yes (especially since it’s in alignment with how I show up in the world), but not make it the center of my business. I have a lot to learn about the politics of queerness, especially where it intersects with race. And frankly, I am not someone who *needs* advocacy, etc as much as others in the LGBTQ community. My challenges (inconveniences really) are nothing compared to what Black trans women experience, for instance, and they’re the ones who paved the way for people like me to be able to only be inconvenienced and not ostracized. Those of us who claim queer/bi/pan/etc and have privilege (passing, cisgender, white, money, etc) need to be willing to leverage that for others in the community.", "anteeniya": "all the whites are crying in these comments", "lessmessness": "♥️✔️♥️✔️♥️", "ashleemariepreston\nVerified": "Verified", "failureprincess": "This post is good. That’s all I gotta say, lol.", "_nicolejp": "If you know who you are in and out you should not be triggered at all by this question. If you felt any such way you may need to look inside yourself to see why", "imannabellee": "people claim queerness as a way to excuse themselves from addressing their racism, cis and hetero normative ideals. You dont get to detatch yourself from the politics and still join the party whilst queer and trans people expecially poc are being persecuted", "britorious": "WORD👏🏻", "lastcallmurph": "If this post bothers you so much, ask yourself why you fee attached. She’s not saying that those that truly identify as queer should stop.", "angelicaisaibecerra": "💯💯", "dinneratmidnite": "Thank you! A lot of it feels so performative these days.", "tweeterlive": "This is a mighty word,right here! I thought I was the only person who noticed the random queers. Cause they def wasn't shooting with us in the gym 💁🏿‍♀️💅🏿", "sanne_imal": "This is the best thing I’ve seen in a looooong time. Thank you thank you thank you for posting this!", "draftdraftdonotpublish": "fellow bi pan people, it’s okay to feel triggered by this, it is. It’s okay to remember people who tried to keep you out, but pls take a minute before you type to let yourself feel that. We’re meant to feel. Feel it, let it out, process, learn from it, and come back to look at this when you’re in your #windowoftolerance . I promise you, this post is not an attack on anyone who’s queer. Remember how we pause before “not all white people!”-ing? I found in this post a call to action. An invitation to not use the hurts others caused to try to silence someone who has something to teach you. To dive deeper into queer history, intersectionality, and how and where you can plug in to fight for everybody queer.", "pupspolepizza": "Case in point: Taylor Swift's new \"gay anthem\" 😞", "frankieeob": "@gabriellewaltonprint 🙃🙃🙃", "wildorangeblossom": "I often question whether or not I'm really queer. I'm married to a cis dude and have never been with a woman. Sometimes I think this is internalized biphobia, and other times I think I'm just pretending. But who would I be pretending for?", "helenardgs": "Babe, I admire and respect the hell outta you and I also encourage questioning social behaviours that start trending. I just wanted to bring your attention to generalizing straight people as boring... we don't like being put in a box that says queer people are promiscuous or too bohemian. We shouldn't do the same. Love you", "beautycon\nVerified": "Verified", "nikkitikkitavvi": "I try to use the label “straightish”, and I hate to see the mainstream water down the real experiences of queer people. My openness to queer experiences absolutely does not open the door into the queer world.", "alejspek": "Yes yes! I ask myself this a lot. I’m questioning (asexuality among other things) trauma has never allowed me to have a relationship with my sexuality so it’s personal work that is very important to me. I talk about it with friends and in therapy and in spaces where it is ok to ask questions. Some people have told me, “you’re queer”, but I’m a white passing, cis POC who walks around with a lot of privilege to what end would I be making this declaration? I’m not saying I won’t but if I do I want to be able to put my money where my mouth is...right now sexuality for me is mostly just saying “no” which is a huge deal for a trauma survivor, but not really an identity that will ever be put on the line. Thanks for sharing it was helpful in being able to put words to my hesitancy.", "mekdibaby": "Nooo for sure. I've met ppl who claim it but definitely do it for artsy points or because they hang out with queer people who are in the arts.", "amethystxocean": "I’ve asked this same question in my head. I’m seeing thin, white influencers in cis-hetero relationships claiming queer and bopo and sometimes I feel it is muddling the voices of those whom are not so passing or privileged; who are struggling with the weighty oppression and in need of the awareness, spotlight and support.", "gatorsdontsweat": "It’s big in pop culture, it’s cool now. It’s a trend, marketable and mainstream. I’m sure lots of people who wouldn’t be queers otherwise do it just to fit in with a certain group or have their voices heard/respected in certain spaces.", "fiercefatfemme": "YES. Queer doesn’t stop or begin at sexuality, it is a politic. I also feel like some boring identity people claim being “fat” so that they belong to some marginalization when they aren’t and they benefit soooooo much from thinness/thin privilege and whiteness and cisness and ablebodiedness.", "ttyyal": "Lmao", "hannah_christine96": "I see celebs doing this all the time! People who are hetero until it’s not the “it thing” anymore. I come from an LGBTQIA+ family and being pansexual myself it’s incredibly frustrating to see queerness abused and used this way for clout and $$$. #bewhoyouare", "oshkoshmygosh": "I absolutely thought I was one of these people! The fear made me delay officially coming out but when I did everyone responded with “duh girl, we knew”. Still dealing with a bit of imposter syndrome though", "rhia0_0": "The MOGAI community makes my eyes bleed. When I working for a non profit about LGBTQ+ it ruined many conversations with people I had on the streets and caused them to not take the LGBTQ+ community seriously. These fake labels and identities in the MOGAI community and their claim of queer spaces is hurting actual queer folks.", "the.gabe.agenda": "Are you queer or are you just gay and like calling yourself queer for the radical connotations?", "babyclowndoll": "So like Tana Mongoose w/ Bella Thorne? Cause tbh I always felt like Tana wasn't actually bi and was just doing it for the spectacle", "czeed": "This is exactly why I don’t claim any identities. I am not visibly queer or trans or non binary so I experience no active oppression, so I choose to not claim them regardless of my inner feelings/thoughts. Also this is a very valid question to ask when many famous people like Lady Gaga are using the ‘trendiness‘ of lgbtq communities to take up space and make money off of queer identities", "nonchalantaboutit": "There are a lot of people on my feed that need to see this.", "zaizai0809": "Very much reminds me of academics who talk in theory and look good on paper but their personal politics and relationships show that they have a lot of unpacking to do. Makes you almost anxious and guilty for questioning people for possibly attempting to adjust their privilege to refrain their power", "tashahnicole": "One of the first lines I put in my dating profile “must actually like dating women.” Bc some ppl think it’s a game #dontplaywithmyheart. Also sucks when ppl want me to “prove” how I sexually identify though 🤷🏾‍♀️. We live in very strange times.", "alchemillajewelry": "Lol too real", "unclejemima99": "Lmao you gon hurt some feelings with this one 💅🏿", "harpeli": "I'm bothered by queers with tremendous privelege who aren't (consistently) political. It demonstrates (to me) a lack of exposure to/understanding of our history and current struggles. Some people come out later when it's less taxing on family relationships, but many of us risk losing stability by coming out younger. Or by coming out in a society which is much less shocked by non-hetero behavior (thanks to previous struggle). Queerness isn't just in who we love, it's in how we exist and fight 🙏", "bonesteeth": "I am in a straight passing relationship and I know I’m queer enough. Do the searching and reflecting on your own, not in the comments of a queer black persons page. This isn’t about you, it’s about STRAIGHT people who literally steal our identities because they fetishize ppl, queerbait, and want the fun and glitter and glam without the pains of being queer. Stealing identities is not new (yt ppl do it all the time) and it’s ugly and dangerous af.", "theronnieshop": "Shots fired 😂🙌🏾", "leyvemealone": "people wanna be queer so bad but don’t understand that queer lives are constantly in danger sure Jan go to Russia and claim your queer ya big proud bitch", "jodinecastin": "A black non binary femme is asking a question on her own gd Instagram page and white people are misreading the question and getting upset at the answer they made up and pretended that you said. Woof.", "kiratsougarakis": "@lolwhatamidoing oh I can’t w a i t to be subtweeted", "chellonwheels": "👏🏼💯👏🏼💯👏🏼💯", "dustiwusti": "I've had a woman say she was straight but \"politically queer\" She thought that by being queer for the sake of arguments in our conservative town she was being a good ally. We were working with LGBTQ youth at the time. Kids who were fighting to live and she was queer for the sake of arguments. The privilege was mind boggling.", "sefiasco": "I have never been more excited to read comments 👀👀", "risquereviews": "Very important, love this message. I am an ally and try to be educated and informed of what spaces I’m welcome in and how I can use my privilege. Thanks for reminders and the emotional labour of teaching 💕", "mais_29": "Oooooooooooooooooooooof!", "davidize": "@ajcabrera87 @drborderlandspapi Damn, some folks just got dragged but this is so true.", "noiremedusa": "@j_london27 Gurl, I can't even count the number of convos we have had over the past few years on this very subject.", "daniellepondermusic": "This!", "genderphobia": "🔊🔊💓", "maiziemazeee": "Devastatingly hetero @ayyymustbethehonay", "deborah_arndt": "I've honestly held off on living what I feel is my actual gender identity because I'm scared of exactly this. I don't want to appropriate a culture just because I can't get my own shit straight. I realized that instead I wanted to focus on supporting the people I meet and whatever is meant for me to happen, will happen. If being queer is becoming a fashion statement, I think I'm going to vomit. I already spent a good 10 years avoiding my own sexual preferences because of that fucking Katy Perry song", "lucassilveira\nVerified": "Verified", "fluffmanor": "I personally err on the side of acceptance. If you wanna say you are queer, I'm not going to ask you to prove it to me somehow. I'm just going to go with it. Maybe there is a small contingent of fake queers (would love to see who!), but it's worth it to me to look past them to make room for people who are questioning, afraid, ace, or other \"queernesses\" that are still rejected by the larger LGBTQIA community.", "layshiac\nVerified": "Verified", "faithkeln": "@specialkai", "kidscissors_finalform": "hot take: gatekeeping can be good. why would we not need to gatekeep to some extent? if being queer came with no material repercussions i wouldnt care who called themselves that but the fact is that it does. i find it really harmful when ppl w/o a lived experience of queerness feel the need to take up spaces and RESOURCES that are meant for queer ppl. *that’s* why questions like these are important.", "seadawn.me": "This!!", "lostseeoul": "Anything can be fetishized...", "missbellbottomz": "@wishingoodvibes *cough* Arianna Grande *cough* 🤭", "kibbutzflorist": "THANK U", "gaudyglitch": "Very valid question with all the pop stars. However, I also think this helps normalize the acceptance of an identity if not the understanding. So I’m torn because the good that comes out of it outweighs the intention for profit? Or nah?", "alikoshamlerfreid": "Boring straight white woman", "bronzehunny": "I gasped at the accuracy of this tea 🤭😯🙃", "tenerezza101": "!!!!!", "lisahawks": "❤️", "everydayogamber": "@__the_war_den__ this is exactly what we were talking about, but this is explained WAY better than what we were trying to say.", "chicddc": "I’m straight af and I’ve been asking myself this same question but wasn’t sure if I could even pose it considering how I identify.", "raging_manatee_mey": "What if I'm a boring queer person", "hijadelaagua": "This!!👏👏👏", "ihartericka\nVerified": "Verified", "blaasomhed": "I'm super straight, boring, white! And very aware of not taking anyone's rightful place to be \"different\" and therefore celebrated. ❤️", "brunchatthebar": "Dis dis dis", "ruthlesslove88": "Meow meoooowww 😼", "candy_pain_official_fan_club": "🙌🙌🙌", "littlebryn": "👏👏👏👏 alllllllll of this", "miacloud": "I love and understand the point you are trying to make here, but the wording in your photo is hurtful to those that identify as straight and are allies to queer folx - (I am queer) & some of my close friends have expressed the shame they feel sometimes as being straight. They never pretend to be queer, but they support us! I understand they have never been oppressed, but why shame those that support us??", "kendra_cunov": "Boring straight person here 🙋‍♀️", "deliasalomon": "Yo especially @ white folks looking to use the suggestion of queerness to absolve them of racism", "behbeit": "🙌🏾🙌🏾🙌🏾🙌🏾 That part", "yung_jeanzy": "Always counting on you to say this shyt. It gives me LIFE! ❤️🤘🏾🙌🏾", "4350n6942w": "This 👏👏👏", "tessholliday\nVerified": "Verified", "sadierebecca152": "a few years ago I was questioning if I actually was attracted to girls or if I was making it up because I didn’t want to be white AND straight. I mean a few girlfriends later and I know I wasn’t fabricating it to be against the status quo but damn it’s some wild shit", "easyteenqueen": "I feel this way about ppl who always shout about bi-erasure during pride season (cis white ladies always/only in heterosexual relationships) but do NOT talk/support about anything else in the queer community, like more important things like celebrating and protecting TWOC (and yes this is more important that cis lady bi-erasure). It always seems like this is about centering a certain (privileged) experience. So your hot take nailed it. especially with the rainbow capitalism that grows into a larger monster every year. 👏🏻", "bebatjof": "Am I queer or am I misogyn towards myself?", "suziegrime\nVerified": "Verified", "comicsbae": "🗣🗣🗣🗣", "jimmycartersufo": "For a second I got very very anxious because I thought, what if this is me? But then I realized that was my anxiety and internalized biphobia + gender issues and I read through the comments for clarification and I know exactly what you're saying.", "romeowhitenoise": "🔥🔥🔥", "_artofhealing": "From someone who is questioning, especially after this post 😕 could someone define queerness for me as best as they can?", "aintforeverybody": "Yes! \"Queer\" is too easy. Like, \"you mean bi?\" Or do you wanna exclusively date women and occasionally jump on some cis D without repercussions from the lesbian community? Cuz there will be. As long as women who are identifying as lesbians keep fucking dudes we will never be taken seriously. So queer is the answer. Look, I firmly believe there are no rules with an individuals sexuality preference but queer is some vague ass bullshit. Not my favorite. In the age of \"I don't like labels\" the word queer gets the most attention. Again removing the proud label of lesbian gay bisexual. The work from my protesting ancestors to make sure we're recognized and those labels are proud ones.", "fibrofag": "it absolutely IS too early for this read but honestly get us before the coffee kicks in!", "alyssamarybeth": "I am bisexual and claim it because I am attracted and have dated both sexes. I don't claim queer because one, I'm not sure I fully understand the platform for it and two, do I fit in with that demographic? It seems to be a thing more and more blacks are starting to say and if that's for them go for it honey!", "brittsulkinlifecoach": "👏👏👏", "s.e.v.i.g.n.y": "@lef316 this is interesting. Glad I'm following her 💛", "landofinkandgraphite": "I see a lot of people citing the \"transtrender\" debate and I'd like to point out that most folks who believe in transtrending are folks who want to enforce the gender binary and believe that trans folks cannot be gender-nonconforming. All of that ties into white colonial gender thinking and roles, and adds the element of white supremacy into the transtrender discussion. Ericka's question isn't that lol.", "maruskaalbertazzi": "Wow. Never thought of that. I think it will take centuries before something like that could happen in Italy. I think you should be proud to live in a country where queerness can be faked to appear cooler. (I’m a white, cishet boring thing, btw, but still adore you).", "kateelaney": "This is really interesting, I’d (naively) never really considered that people would claim a different sexuality to the one they feel inside just to appear relevant or on trend 🤔", "yodababy69": "Ooof.. dis guud. @prairie_ritual", "samantharise": "HOLY SHIT", "aej.create": "@kayleach_ @trippychickmakeup 👀👀👀👀👀👀👀 omg", "queen_animalia": "This rhetoric does tend to harm people who are doing the deeply personal work of finding their own queer spaces. If I had read this when I was just figuring myself out (and to be honest,who still isn’t), I would have felt shamed and felt that other people perceived me as a straight girl wanting attention, and may have shamed myself back into the closet. My queerness does not disappear when I am in a relationship that is externally perceived as straight. My queerness does not disappear when I am not in relationship to another person. My queerness does not disappear when I may have to minimize or hide it to survive. This question, especially from someone as prolific and well-respected with the community as you, silences those who are discovering, who are surviving, and who are beginning to find ways of claiming queer outside of themselves.", "hello.mariana": "And this is why I keep my mouth shut about my feelings and attraction towards anyone but cis men to myself.", "tteexxaass": "👏👏👏", "georgia_o_k33f": "July is for processing the shadow of pride month", "antidietriotclub\nVerified": "Verified", "inespatrick": "i think that this is good to recognise but i also feel like it can be a little dangerous. this kind of mindset could lead genuinely queer people (particularly people who are bisexual or non binary) to stress about whether they are ‘queer enough’ and could also give biphobic people (both queer and cishet) another excuse to try to push us out of the community by telling us we’re basically straight, invalidate bisexuals who are in a relationship with someone of the opposite sex and force us to doubt ourselves and our identities.", "gpignanelli": "@pippalupita @oressayou this tho.", "bbbeegee": "Thanks for bringing this up. I immediately felt myself get defensive because of all the work I’ve had to put in to prove that I’m queer enough. However I pass as cis and heterosexual and it makes it way easier for me to move through the world, gives me a shit ton of privilege. And as someone who was used for emotional labor in someone’s “queerness journey”, but also directly affected and our romantic relationship defined by their internalized homophobia I find it really important to acknowledge privilege involved in passing as cis and het. I think maybe it’s not a question of who is really queer or being queer enough but rather what labor are you making people who are out and have put a lot of work into being out, (and experience the world/oppression for being trans or gay, etc) do for you? This is not to say that being out is necessary to being queer, I think it’s just really important to ask ourselves who came before and did the work so that I could call myself queer? And do you have privilege as someone who reads as straight is cis or dates heterosexually at times? If people aren’t acknowledging that privilege and are using queer labor for cred and not acknowledging that, it’s violence. Queerness is not something to use and discard when it’s convenient (again I am not speaking about people who pass because it’s not safe for them not to).", "arutht": "Cough cough coughtesshollidaycough cough", "the_bodylib_advocate": "Tell us more.... ❤️", "angelamorrismakeup": "Thank you", "yehshaiiii": "What is queer? I don’t have a specific sexuality that I adhere too. I just like what I like, whether it’s a girl, guy, trans , or non binary etc. So what makes someone queer?", "josephinecurates": "I’m queer. And while I certainly have been in a relationship where that was publicly obvious, I married a straight dude and we have a kid. That’s a lot of straight passing privilege, from taxes to healthcare to not fearing for my physical safety in the same way. I really watch how much oxygen I take up in queer spaces and try to put my money and energy into supporting the folks in our community that need it most.", "charcharbinks23": "I would not be surprise to find people doing this tbh", "grisgrismama": "Wow!! Such a good question. I acknowledge my hereto cis female identifier and have often said im a queer ally and politically queer-I love that this was posed!💜 I’m certainly radical and non traditional but this is a different identifier that I try to be sensitive about.", "katienumi": "👏🏾", "venusx\nVerified": "Verified", "they.them.ryse": "Thank you for putting this into a post, I have seriously been like.... umm you can’t just be queer for June.... it’s not how it works.", "nadya426": "I think white supremacy only functions if we deeply believe we deserve things we have not earned. If we did the work to unravel our entitlement, this system would not function. The freedom and beauty of queerness are earned. This reminds me of @alokvmenon 's discussion of how America's love for drag does not translate into them walking down the street safely. This is not only about extraction, it is critical to try to strip the political from the powerful, to neutralize art.", "kimmy.hale": "I struggle with this all the time. Because no matter how pansexual and non binary I am inside I know that I do not have to face the struggles of those who don’t “pass”. I’m white straight and cis seeming if people think that what they’re going to see. My gay dad can’t do that. Can’t just hide the husband. Can’t seem straight to a casual onlooker. It does make me feel boring. And like my privilege isn’t doing anyone any good.", "spike_of_all_trades": "That’s so funny because I’m straight but I have to repeatedly explain to people that I’m not a lesbian... even as they try to convince me that I am. 🌸", "salvia_officinalis_": "I identify as queer but I won't enter queer spaces for this exact reason. If my queerness is not putting my wellbeing at risk, I don't need to be in queer-only spaces.", "n.yallah": "welp. The tea is burning my tongue this morning. ask these questions!!!!!", "vsprolorin": "That the “I’m heteroromantic homoplatonic greysexual and bicurious” mixed with a little “I’m Czech, French, and Greek” 😂 exhausting. Absolutely exhausting and dry. Just say you’re a (usually white) straight woman to touched a girl’s butt at pride one day while your dating/sexual history is nothing but cishet men who sometimes like to be pegged. Because that’s usually what it is.", "karen_solt": "I’ve been thinking and feeling this same thing. Thanks for expressing it so clearly ❤️🏳️‍🌈", "julesridgeway": "Never NEVER neverrrrr too early for this read!! 🔥👏🏼", "georgibw": "@jaymie_lee_fines GOLDEN", "the_luciferous_shift": "Speak on it 👏🏽", "fem_noir": "🙏🏾🙏🏾🙏🏾 You’re a gem to us all sis. Thanks for the shout out. Your posts always have me in my feels/ interrogating my privilege/ coming for ppl’s necks! 😂🖤", "pig_vicious": "I have been thinking about this a lot lately. I’m cishet presenting in a cishet relationship, and have never been in a non-cishet relationship, but I don’t think I would reject being in a non-cishet relationship. It doesn’t feel like gender matters for me, and I am attracted to women and non-binary people as well as men, but wonder how influenced I am by the objectification of women and queer people. I don’t want to jump in claiming I’m queer, and would rather be a friend and accomplice to the queer community while continuing my journey to identify myself outside of the capitalist system. Thanks for asking this and I hope I’m not out of place.", "morenadelasol": "Should one ever claim queerness as a way of committing allegiance to their lgbtq+ia community? Or is that too far for a hetero person?", "sniwritdaiksh": "I wanna share my story. I feel like I’m not fitted as hetero but I’m not sure how to label myself, so called it queer. I’m a female by birth and I prefer have sex with male. Although I don’t feel like I’m cisgender, cause in my mind, I’m both male & female, or it just blurred. But then for romance, I’m open for anybody, but I prefer if the person is masculine (not automatically means male). For example like Ruby Rose or Jake Zyrus. Probably I’m heterosexual-panromantic, but since I’m not sure yet, I’m gonna call myself as queer. But I think, definitely I’m not heterosexual-heteromantic.", "neonluna": "🤣", "a.m.green.e": "The way you put this into words is perfect.", "moon_pumpkin": "White people have it so good they want to marginalize themselves so they can feel victimized too", "theonlyaudrayouknow": "Owch this gives me feels", "theunapologeticallybrownseries\nVerified": "Verified", "jessi.so.messi": "Girl yes. I swear I was shut down by these people and shamed for being bisexual as it was always viewed as a fetishized or transitioning phase. I AM QUEER DAMMIT. I have been since I was a girl.", "saradnaaa": "@lenins_ghost dayummmmmmm", "leah.peacock": "Never too early!!", "averyjanex": "My 🐍 ex. Straight cis white man who’s racist, sexist, transphobic but now claims to be queer bc he performatively wears dresses and claims his pronouns are “whatever”", "panther_teeth": "telling the truth", "gucci.nut": "did you mean: “spicy straight”", "mangitodulce": "I’ve been searching for the words to say this 👏🏽👏🏽", "rootedresistance": "👏🏾👏🏾👏🏾👏🏾👏🏾", "dark.marble.eyes_official": "Everybody wants to go to the party until the party gets raided.", "douxnoel": "YES", "dontastorey": "🙌🏾🙌🏾🙌🏾 AHHHHH! Yesss! Point em OUT!", "themelissadenizard": "“Are you really Queer or is it a part of your business model?” 👏🏽👏🏽👏🏽👏🏽", "bethanyrenn": "👏👏👏💚💚💚", "nyxturna": "This. Fuckin. Post. Literally had this convo with several people recently. Of course the topic is complex and there are layers but...still a valid point", "_berceuse_": "Not too early--Too fucking important!! Being able to take off the identity whenever it's convenient is a plain and painful insult!", "pelhamjacobs": "I’d ask the same question and add cis next to straight. 🤷‍♀️", "inheavensname": "I feel attacked. But, I’m also thinking. Am I straight? I really don’t think so. But, my queerness (just like my blackness) is something that I do have the privilege of slithering into or out of at will", "xystugli": "IM SCREAMING", "animalprintisacolor48": "Amen 🙌🏿💕🙌🏿 this shidd is real", "stephaniemadeit": "👏👏👏👏👏👏", "destiny_laurice": "I think a lot of it in celebrity is about clickability, but for the common folk I believe just people feel comfortable being out. As someone who grew up as a repressed bisexual in an evangelical home, I still battle with accepting and loving my queerness in its fullness. Baby steps for those folks and later for those who are exploitive!", "findingpaola\nVerified": "Verified", "mmmhmmsure": "🙌🏽🙌🏽🙌🏽", "nottheshittyalexjones": "@miss_mary_j This.", "thesoniag\nVerified": "Verified", "reesabobeesa": "Yeoooooooooooww", "hardrockhope": "👏👏👏", "bayleighzagami": "👏 This 👏 is 👏 so 👏 relevant 👏", "melbeeganisvegan": "👏🏼👏🏼👏🏼", "mogwai96": "PREEEEEEAAAAACCCHHHHHHHH", "rheanna_may": "Oof, this hurts to read as it was the biggest fear I had about myself and kept me from leaning into my queerness for so so so many years. It’s an important question to ask yourself, but not to shove at people who you think aren’t ‘queer enough’.", "lagrosera": "Yes! People are out here making queer apolitical and it’s not.", "ziiomizm": "Wow. This this this this thisssss", "alma_aylmore": "What an awful, cynical thing to insinuate. A threatening question that could push questioning people, or people unable to express their queer identity due to social circumstances, further into the closet.", "emilyjurbaniak": "Wooooah. This question! 🙌🙌🙌", "keyairakelly": "Ooooooooooooo SAY THIS", "neonpunches": "i dont think ive ever seen this! can anyone give me an example? it might help me conceptualize it as a queer person. (not disproving this i’m really wondering!! 💞)", "trs_nrmn": "!!!! i have tried to have this convo and immediately been shut down for gatekeeping. I’m not trying to gatekeep but I am skeptical of a lot of claims to queerness w/o actual queer action - if that makes sense.", "oliveoliviaolio": "It’s not to early for this", "relentlesscheer": "Baaaaahahahahaha", "mxdevin": "and i oop-", "chaninicholas\nVerified": "Verified", "libertarianlol": "Why is being who you are boring? Even if who you are is straight.", "jeanneofdark": "I don’t know, this really feels like the whole “transtrender” discussion", "quirkyrican\nVerified": "Verified", "sunray_gm_": "FACTS", "queernature": "👏🏽👏🏽👏🏽👏🏽👏🏽", "cantalu": "THIS!!!!", "tamikie": "😂😂😂😂🔥🔥🔥🌱", "jessicachernicky": "@maya_anaconda_dont", "leah_abraham": "👏🏻👏🏻👏🏻", "zarah.z99": "On point as always", "kiersey\nVerified": "Verified", "beingmichelleedwards": "I’m the opposite. Not fully claiming or owning my queerness", "henry_marie_elizabeth": "🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤🖤☝🏽☝🏽☝🏽☝🏽☝🏽☝🏽☝🏽☝🏽", "moldydillon": "Glad someone named this", "treevuhh": "As a questioning person who is also experiencing divorce and motherhood as I learn about my queerness. I can say I still do not feel confident/comfortable ever asserting myself as queer to anyone other than my intimate self. If someone can just jump to asserting themselves as queer when they have always been straight or do not show any other support of the community or decolonization, it definitely sounds like a scream for attention and they can surely be someone who is using it for the convenience/fetish.", "issatrae": "whhhheeeewwww 😰😰😰 can we.... discuss bec I think a lot of people ponder this but do not want to be labeled as a gate keeper or trying to label queerness. But I’ll circle back in an hour for some informative & messy comments ❤️🏳️‍🌈", "___.j.s": "Wow ! So much truth 👏🏽👏🏽", "earthwindandflowers_": "Oop! @mamawolff !", "analaurabuendia": "the tea 🔥", "chanellemidwest": "I always sort of consider this when certain celebrities come out as bisexual or pansexual", "ezpowersphoto": "I think this is a dangerous question and could potentially invalidate people on the edge of accepting they are “queer enough”. The question is what are the differences between being queer and this idea that someone is pretending to to be a better ally?", "broobs.psd": "I screamed omfg", "dr.taraesutton": "Yes yes yes yes yes 💜", "somewhere_under_the_rainbow": "THISSSSSSSSSSSSSSSSSSS. #stopcooptingqueer", "_geralartist_": "I think it’s a fair observation. Queer isn’t rainbows it’s pain, rejection and so many other things.", "melanityy": "So much relevancy", "sunnymaguire": "I didn’t even realize this was a thing until recently. Way to appropriate coming out, an act that can literally get someone killed or excommunicated from the people they love the most, straight people. FFS.", "fromabolivian": "Ommggggg 👏🏽", "persianvegan_": "Omg I know so many people like this!", "inaholub": "THANK YOU!!", "asa_hndrx": "Never too early!", "joybelou": "They're probably the same people pickup and put down black culture/fashion/mannerisms whenever it conveniences them. It's been two days since the end of pride month so they'll probably return to heteronormativity in about...2 weeks? Rough estimate.", "fiercelyte": "💯", "socialjusticedoula": "Chile...oh this is a MFN word right here!!!!!", "knoepf.chen": "ouch... 👏", "jrpiv": "Thank you for this! 🙌🏼❤️🌈", "sameole_ky": "👏🏾👏🏾👏🏾Say it louder for the ppl in the back", "demure.delights": "Oh my goodness. I felt that in my CORE for all the \"masquerading as queers\" that I know #accountability #imshooketh 🙌🏾", "yerrr_betty": "GIRL. @xocanelita", "soliselena": "🗣 keep asking these real questions!", "thongria\nVerified": "Verified", "ssecretsharer": "🔥 Not too early!", "dangerouslyinchub": "Def not too early for this read! I been thinking on this regularly- thanks for saying it out loud!", "breebianca": "👏🏽👏🏽👏🏽", "charisefrazier": "Whew shit!", "andreamanica": "💓", "my.ka.lee": "Whew!!!!!", "springer_gabby": "👏🏻👏🏻👏🏻"}